{
    "directions": [
        "1. Pour the cream and milk into a double boiler or a heatproof bowl set over a saucepan of gently simmering water (the bottom of the bowl should not touch the water). Whisk in 1/2 cup (100 grams) of the sugar, the tea, and the salt and stir until the sugar and salt have dissolved. Warm the mixture until you see steam rising from the top. Remove from the heat and strain the mixture into a bowl, pressing on the tea leaves to extract as much infused liquid as possible. Discard the tea leaves and return the infused dairy mixture to the double boiler.",
        "2. Meanwhile, prepare an ice bath in a large bowl and set another bowl over it. Set aside.",
        "3. In a medium bowl, with a kitchen towel underneath it to prevent slipping, whisk together the egg yolks with the remaining 1/4 cup (50 grams) sugar until uniform. While whisking, add a splash of the hot dairy mixture to the yolks. Continue to add the dairy mixture, whisking it in bit by bit, until you've added about half. Add the yolk mixture to the remaining dairy mixture in the double boiler. Set the heat under the double boiler to medium and cook the custard, stirring continuously with a wooden spoon and reducing the heat to medium-low as necessary, until steam begins to rise from the surface and the custard thickens enough to coat the back of the spoon. Hold the spoon horizontally and run your finger through the custard. If the trail left by your finger stays separated, the custard is ready to be cooled.",
        "4. Strain the custard into the bowl sitting over the prepared ice bath and stir for 3 to 5 minutes, or until the custard has cooled. Transfer the custard to a quart-size container, cover, and refrigerate for at least 4 hours or, preferably, overnight.",
        "5. Pour the chilled custard into an ice cream maker and freeze according to the manufacturer's instructions. Place the container in which you refrigerated the custard in the freezer so you can use it to store the finished ice cream. Churn the ice cream until the texture resembles \"soft serve.\" Transfer the ice cream to the chilled storage container and freeze until hardened to your desired consistency. Alternatively, you can serve it immediately—it will be the consistency of gelato. The ice cream will keep, frozen, for up to 7 days."
    ],
    "ingredients": [
        "2 cups heavy cream",
        "1 cup whole milk",
        "3/4 cup (150 grams) sugar",
        "6 tablespoons (30 grams) loose Earl Grey tea",
        "1/2 teaspoon (2 grams) kosher salt",
        "6 large egg yolks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Tea",
        "Egg",
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Spring",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Earl Grey Tea Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/earl-grey-tea-ice-cream-56389790"
}
