{
    "directions": [
        "First, prepare the lemon and orange slices: Place the slices in a wide stainless-steel kettle and cover amply with cold water. Bring to a boil over high heat, boil for 1 minute, and then drain, discarding the liquid. Return the slices to the kettle and cover with 1 inch cold water. Bring to a boil over high heat, then decrease the heat to medium and cook, covered, at a lively simmer for 30 to 40 minutes, or until the fruit is very tender.",
        "While the citrus is cooking, prepare the tomatoes: Bring a medium kettle of water to a boil, then carefully drop the tomatoes into the water to loosen their skins. Leave the tomatoes immersed for 1 minute, then drain them in a large colander. When they are cool enough to handle, peel them over a large bowl, discarding the skins. Using your hands, gently tear the tomatoes into medium pieces.",
        "When both the citrus slices and tomatoes are ready, put them together into a nonreactive heatproof storage container with the sugar, lemon juice, and saffron, stirring well to combine. Cover tightly and refrigerate overnight.",
        "Place a saucer with five metal teaspoons in a flat place in your freezer for testing the marmalade later.",
        "Remove the tomato mixture from the refrigerator and transfer it to an 11- or 12-quart copper preserving pan or a wide nonreactive kettle. Add the cinnamon stick and stir well to incorporate any undissolved sugar.",
        "Bring the mixture to a boil over high heat. Cook at a rapid boil until the setting point is reached; this will take a minimum of 30 minutes, but may take longer depending on your individual stove and pan. Initially, the mixture will bubble gently for several minutes; then, as more moisture cooks out of it and its sugar concentration increases, it will begin to foam. Do not stir it at all during the initial bubbling; then, once it starts to foam, stir it gently every few minutes with a heatproof rubber spatula. As it gets close to being done, stir it slowly every minute or two to prevent burning, decreasing the heat a tiny bit if necessary. The marmalade is ready for testing when it turns slightly shiny and its bubbles become very small.",
        "To test the marmalade for doneness, remove it from the heat and carefully transfer a small representative half-spoonful to one of your frozen spoons. It should look glossy, with tiny bubbles throughout. Replace the spoon in the freezer for 3 to 4 minutes, then remove and carefully feel the underside of the spoon. It should be neither warm nor cold; if still warm, return it to the freezer for a moment. Tilt the spoon vertically to see whether the marmalade runs; if it does not run, and if its top layer has thickened to a jelly consistency, it is done. If it runs, cook it for another few minutes, stirring, and test again as needed.",
        "When the marmalade has finished cooking, turn off the heat but do not stir. Using a stainless-steel spoon, skim off any surface foam and discard. Remove the cinnamon stick. Pour the marmalade into sterilized jars and process according to the following instructions.",
        "When making preserves, be sure to sterilize your jars and lids, unless you plan to eat your jam right away. Although jams and marmalades are unlikely to become contaminated with anything toxic, it is important to eliminate even the minutest risk.",
        "There are many ways to sterilize jars, including putting them in a canning kettle or a sterilizing dishwasher, but my preferred way is in the oven. This method is easier than the other methods and, if you use an oven thermometer, is virtually foolproof. To sterilize jars and lids in the oven, first be sure they are perfectly clean. Place the clean jars upright with an equal number of clean unused lids on a baking sheet or sheet pan in a preheated 250°F oven. They should remain in the oven for a minimum of 30 minutes to ensure they are heated through. Remove them from the oven right when you need to fill them. After you have filled them, leaving 1/4 inch of room at the top, wipe the rims with a clean, damp cloth. Put the lids on, being careful to screw them on just until they are snug, and replace the jars in the oven for 15 minutes or so to ensure they are completely sterilized. They will seal as they cool.",
        "Sometimes the jars can become a little bit too hot when using this method, so before filling them, test their temperature first. Pour a little jam into one, and if it bubbles or boils in the jar, wait a few moments before filling the jars.",
        "Upon removing your filled jars from the oven, place them 1 inch apart on a drying rack to set overnight at room temperature. Do not jiggle or disturb them during this time, as this may disrupt their ability to set correctly. As the preserves cool, you may hear a few little pops as the lids seal. Before putting your preserves away, be sure to feel the top of each lid to verify that it has sealed; it should be curving in very slightly in the middle. If any jars have not sealed, put them in the refrigerator for safekeeping.",
        "To store sealed preserves, label and date them and keep them in a cool, dark place until you open them. After you open a jar, keep it in the refrigerator. You may also keep higher-sugar preserves at room temperature, assuming you plan to eat them within a few weeks or so. Low-sugar preserves should always be refrigerated once opened, unless you plan to consume them right away."
    ],
    "ingredients": [
        "1 pound seeded lemons, halved crosswise, each half cut lengthwise into quarters and sliced crosswise medium-thin",
        "1 pound navel or seeded Valencia oranges, halved crosswise, each half cut lengthwise into quarters and sliced crosswise medium-thin",
        "3 1/2 pounds Early Girl or other sweet red tomatoes",
        "4 pounds 14 ounces white cane sugar",
        "4 ounces strained freshly squeezed lemon juice",
        "A large pinch of saffron",
        "1 (1 1/2-inch) piece cinnamon stick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Orange",
        "Summer",
        "Edible Gift"
    ],
    "title": "Early Girl Tomato Marmalade",
    "url": "http://www.epicurious.com/recipes/food/views/early-girl-tomato-marmalade-361569"
}
