{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 10 1/2x13 1/2-inch baking dish with cooking spray.",
        "Bring a large pot of water to a boil; stir 1 teaspoon salt and vegetable oil into boiling water. Gradually stir macaroni into the boiling water and cook, stirring occasionally, until macaroni are tender but still slightly firm, about 10 minutes. Drain well and pour macaroni into prepared baking dish.",
        "Pour Alfredo sauce into a 3-quart microwave-safe bowl and stir processed cheese into sauce; microwave on 60 percent power for 6 minutes. Stir sauce mixture and microwave for 5 more minutes on 60 percent power. Season with black pepper and paprika. Stir 1 cup shredded sharp Cheddar cheese into mixture until cheese has melted and sauce is thick and smooth.",
        "Pour half the cheese sauce over macaroni and stir to coat; pour in remaining cheese mixture and stir again. Spread remaining shredded sharp Cheddar cheese over macaroni. Top casserole with bread crumbs.",
        "Bake in the preheated oven until the casserole is bubbling, 45 minutes to 1 hour. Broil casserole under oven's broiler for 3 to 4 minutes if you like a browned top. Let macaroni and cheese stand for 10 minutes before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1536&h=804&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F997804.jpg",
    "ingredients": [
        "cooking spray",
        "1 teaspoon salt",
        "1 teaspoon vegetable oil",
        "2 (16 ounce) packages elbow macaroni",
        "2 (15 ounce) jars Alfredo sauce",
        "1 (1 pound) package processed cheese (such as Velveeta®), cubed",
        "1 teaspoon ground black pepper",
        "1 teaspoon paprika",
        "1 (16 ounce) package shredded sharp Cheddar cheese, divided",
        "dry bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easiest Homestyle Macaroni and Cheese",
    "url": "http://allrecipes.com/recipe/231530/easiest-homestyle-macaroni-and-cheese/"
}