{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 muffin cups. Grease and flour an oven-proof glass or ceramic bowl.",
        "Beat cake mix, water, vegetable oil, and eggs together in a bowl with an electric mixer on low speed until just-moistened. Increase mixer speed to medium and beat until batter is smooth, about 2 minutes. Fill prepared muffin cups with batter; pour remaining batter into prepared oven-proof bowl.",
        "Bake cupcakes in the preheated oven until golden and the tops spring back when lightly pressed, 18 to 21 minutes. Let cupcakes cool briefly in the muffin tin before transferring to a wire rack to cool completely.",
        "Bake cake in the preheated oven until golden and a skewer inserted into the center of the cake comes out clean, 33 to 45 minutes. Let cake rest in the bowl for 10 to 15 minutes before transferring to a wire rack to cool completely. Transfer cooled cake to a serving platter.",
        "Place 2/3 of the coconut into a resealable plastic bag; add red food coloring, seal the bag, and shake until coconut is shaded pink. Repeat process until coconut is your desired shade of pink.",
        "Measure out about 1/2 cup of remaining coconut and place in a bowl. Pour remaining coconut into another resealable plastic bag; add green food coloring, seal the bag, and shake until coconut is shaded green. Repeat process until coconut is your desired shade of green.",
        "Secure 2 cupcakes, tops against the cake, with toothpicks to one end of the cake to form bunny \"feet.\" Place 2 marshmallow halves, cut-side down, on top of each cupcake to complete each \"foot.\" Secure remaining cupcake, top-side against the cake, with a toothpick to the top of the cake to create the \"tail.\"",
        "Spread pink frosting over cake and \"feet\", excluding the \"tail.\" Cover pink frosting with pink coconut. Spread white frosting over the \"tail\" and cover with reserved white coconut.",
        "Cut fruit roll to form 2 small ovals and 6 smaller circles. Using frosting as \"glue,\" secure 1 oval and 3 circles to each \"foot\" to resemble foot pads. Secure paper bunny ears to the serving plate at the front of the bunny cake using frosting. Sprinkle green coconut around the cake to resemble grass."
    ],
    "ingredients": [
        "1 (15.25 ounce) package yellow cake mix (such as Duncan Hines®)",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1 pound flaked coconut, or more as needed, divided",
        "3 drops red food coloring, or as needed",
        "3 drops green food coloring, or as needed",
        "2 marshmallows, halved lengthwise",
        "1 (16 ounce) container ready-to-use pink frosting, or more as needed",
        "3 tablespoons ready-to-use white frosting, or as needed",
        "1 pink fruit rolls (such as General Mills® Fruit Roll-Ups)",
        "pink paper bunny ears"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easter Bunny 'Butt' Cake",
    "url": "http://allrecipes.com/recipe/241685/easter-bunny-butt-cake/"
}
