{
    "directions": [
        "Wash the lamb head and neck thoroughly and place in a pot with the onions. Cover with cold water, season with salt, and simmer for about 1 hour, skimming the surface several times.",
        "Cut the intestines into several pieces and wash thoroughly under running water. If you like, slice them open so you can wash them more easily. In a separate pan, bring some salted water to a boil and add the intestines. Blanch for 2 minutes, then remove with a skimmer and discard the water. Chop the intestines finely. You don't need more than 1 cup of chopped intestines.",
        "The head and neck are done when the meat falls from the bones. Remove them from the pot. Using a sharp knife, cut open the head and separate the meat from the bones. Remove the meat from the neck and cut all the meat into small pieces. Strain the stock and discard the onions. Let the stock cool and remove the fat. (Up to this point, the preparations can be made a day ahead. You can refrigerate the meat and the stock, making it easier to skim off the fat.)",
        "To finish the soup, wash the liver well and cut it into small cubes. In a skillet, heat the olive oil and sauté the liver with the scallions and chili pepper, if using. Add the finely chopped meat and intestines, together with 1 cup of the dill, and turn a few times with a wooden spoon. Transfer the mixture to a pot and add the stock plus an equal amount of water, and bring to a boil. Reduce the heat and simmer for 12 to 15 minutes. Taste and add more pepper and salt if needed.",
        "Beat the eggs in a large bowl with about 2 spoonfuls of water and the juice of 1 lemon. Slowly add cupfuls of the hot soup to the bowl, beating continuously with the whisk. When the egg mixture is very hot, pour it slowly into the pot, stirring well, over very low heat, to prevent curdling. Taste and add more lemon juice if needed. Sprinkle with the rest of the dill, and serve immediately.",
        "NOTE: Some people add 1/2 to 1 cup short-grain rice to the soup.",
        "If you hate the taste of boiled lamb, you can make an equally tasty magiritsa with chicken livers and chicken stock. There is even a meatless magiritsa. Sauté the scallions and dill, adding a few chopped leaves of romaine lettuce. Pour in water or stock and simmer for 10 to 15 minutes. Make the egg and lemon mixture as described above and serve."
    ],
    "ingredients": [
        "Head, neck, some intestines, and liver of a young lamb or 3 pounds lamb bones",
        "2 large onions, halved",
        "Sea salt",
        "1/2 cup olive oil",
        "2 cups finely chopped scallions",
        "1 small chili pepper, minced, or freshly ground pepper to taste",
        "1 1/2 cups chopped fresh dill",
        "2 eggs",
        "Juice of 1 1/2-2 lemons"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Lamb",
        "Easter",
        "Spring"
    ],
    "title": "Easter Lamb Soup",
    "url": "http://www.epicurious.com/recipes/food/views/easter-lamb-soup-231781"
}
