{
    "directions": [
        "Sprinkle yeast onto warm water in a mixing bowl; let stand 5 minutes. Stir in 2 tablespoons sugar and 1 1/2  cups flour until smooth, then cover and set aside in a warm place until doubled in bulk, about 1 hour.",
        "Cream together the shortening, 1 cup of sugar, and salt in a bowl. Add the 2 eggs and egg white, one at a time, mixing until smooth between each addition. Stir in the yeast mixture along with the lemon zest, lemon juice, and remaining 3 1/4 cups flour until a smooth dough is formed. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into four equal size rounds; cover and let rest for 2 minutes. Roll each round into a long rope about 18 inches long.",
        "Grease two large baking sheets. Using the two long pieces of dough, form a loosely braided ring on one of the baking sheets, leaving spaces for three colored eggs. Seal the ends of the ring together and use your fingers to slide the eggs between the braids of dough. Repeat to form second loaf. Cover, and let rise until doubled in bulk , or until your finger leaves a dent when the bread is gently pressed, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Beat egg yolk together with 1 tablespoon heavy cream; set aside.",
        "Bake in preheated oven for 10 minutes, then brush on egg yolk mixture and decorate with candy sprinkles. Continue to bake until the loaves are dark brown and sound hollow when tapped on the bottom, 30 to 40 minutes."
    ],
    "ingredients": [
        "2 tablespoons active dry yeast",
        "1 cup lukewarm water",
        "2 tablespoons white sugar",
        "1 1/2 cups all-purpose flour",
        "3/4 cup shortening",
        "1 cup white sugar",
        "1 1/2 teaspoons salt",
        "3 eggs",
        "1 egg white",
        "4 teaspoons grated lemon zest",
        "2 tablespoons lemon juice",
        "3 1/4 cups all-purpose flour",
        "6 eggs, in the shell, dyed if desired",
        "1 tablespoon heavy cream",
        "2 tablespoons multicolored candy sprinkles",
        "1 beaten egg yolks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easter Bird's Nest Bread",
    "url": "http://allrecipes.com/recipe/103983/easter-birds-nest-bread/"
}
