{
    "directions": [
        "Pour the chocolate chips into a heatproof bowl and set over but not touching simmering water in a saucepan. Heat, stirring occasionally, until melted and smooth, about 5 minutes. You will have 1 cup melted chocolate. Plan on using 1 generous tablespoon-size dollop of melted chocolate for each lollipop.",
        "Color half of the melted chocolate for decorating: For each color, spoon about 3 tablespoons melted chocolate into a small bowl. Add 1 drop of food coloring and stir until blended. Spoon the tinted chocolate into a sturdy resealable plastic bag and secure closed. Or spoon into a disposable pastry bag, twist the top closed and secure with a rubber band. Place the filled portion of the bag in a small bowl of hot water so the chocolate does not harden. Repeat to color more batches of chocolate.",
        "Give each child a small sheet of waxed paper and place a lollipop stick on top. Remove the melted chocolate reserved for making the lollipops from over the hot water. Let each child spoon a dollop over the top of the stick, and then use the spoon to spread the chocolate into an oval about 2 by 3 1/2 inches. Twist the stick gently to coat it with chocolate. The stick should extend from the middle of the oval.",
        "Carefully dry the bags of colored chocolate and snip the ends to create small holes for piping. Have the children pipe designs onto their eggs and decorate with candies and/or sprinkles. Let the decorated lollipops dry until firm, about 15 minutes. Peel away the waxed paper and enjoy! Makes 8 lollipops.",
        "Adapted from",
        "Kids Parties,",
        "by Lisa Atwood (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 bag (11 oz.) white chocolate chips",
        "3 choices of food coloring",
        "Small candies and/or sprinkles for decorating (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Easter Egg Lollipops",
    "url": "http://www.williams-sonoma.com/recipe/easter-egg-lollipops.html"
}
