{
    "directions": [
        "Have all the ingredients at room temperature. Over a small bowl, sift together the flour and salt. Set aside.",
        "In the bowl of an electric mixer fitted with the flat beater, beat the butter on high speed until creamy, about 2 minutes. Reduce the speed to medium, slowly add the sugar and beat until light and fluffy, about 2 minutes, stopping the mixer occasionally to scrape down the sides of the bowl. Add the egg and vanilla and beat for 1 minute, stopping the mixer once to scrape down the sides of the bowl.",
        "Stop the mixer and add half of the flour mixture. Beat on low speed until most of the flour has been absorbed, about 1 minute. Add the remaining flour and continue beating until all of the flour has been absorbed and the dough starts to pull away from the sides of the bowl, 2 to 3 minutes.",
        "Turn the dough out onto a work surface and divide into 2 equal balls. Shape each into a disk and wrap separately in plastic wrap. Refrigerate for at least 2 hours or up to 2 days.",
        "Remove the dough from the refrigerator and let stand for 10 minutes. On a lightly floured surface, roll out the dough 3/16 to 1/4 inch thick.",
        "Preheat an oven to 350°F. Line several baking sheets with parchment paper.",
        "Using Stamp & Style Easter cookie cutters, cut out the desired shapes. If the dough sticks to the cutter, dip the cutter into flour before cutting out more shapes. Using a small offset spatula, transfer the cookies to the prepared baking sheets, spacing the cookies about 1 inch apart. Reroll the scraps and cut out more cookies. Decorate as desired with the decorating tools.",
        "Bake the cookies until golden brown around the edges, 7 to 10 minutes for smaller shapes, 12 to 16 minutes for larger shapes. If baking more than one sheet at a time, rotate the baking sheets from top to bottom and 180 degrees halfway through baking.",
        "Transfer the baking sheets to wire racks and let cool for 5 minutes, then transfer the cookies to the racks and let cool completely. Store the cookies in an airtight container at room temperature for up to 3 days. Makes about 20 cookies."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1/2 tsp. salt",
        "12 Tbs. (1 1/2 sticks) unsalted butter, at room temperature",
        "1 cup sugar",
        "1 egg",
        "1 1/2 tsp. vanilla extract"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Easter Cut-Out Sugar Cookies",
    "url": "http://www.williams-sonoma.com/recipe/easter-cut-out-sugar-cookies.html"
}
