{
    "directions": [
        "First, prepare your mold. Coat with vegetable oil, let sit for a few minutes then wipe clean with a paper towel. Then grease and flour your mold, making sure to get all the little areas.",
        "Preheat oven to 375 degrees F (190 degrees C). Sift the cake flour, then sift again with the baking powder and salt; set aside.",
        "In a large bowl, cream together the butter and sugar until light and fluffy.  Add the flour mixture alternately with the milk. Stir the batter until smooth after each addition. Add the vanilla.",
        "In a large glass or metal mixing bowl, beat egg whites until soft peaks form. Fold 1/3 of the egg whites into the batter to lighten it, then quickly fold in the remaining whites.",
        "Fill the face side of the mold with batter. Move a wooden spoon through the batter GENTLY, to remove any air pockets.  Make sure not to disturb the greased and floured surface of the mold. Put the lid on the mold, making sure it locks or ties together securely so that the steam and rising batter do not force the two sections apart.",
        "Put the mold on a cookie sheet in a preheated oven for about 1 hour. Test for doneness by inserting a skewer or wooden toothpick through a steam vent.  Put the cake, still in the mold, on a rack for about 15 minutes. CAREFULLY, remove the top of the mold.  Before you separate the cake from the bottom let it cool for about 5 more minutes so that all the steam can escape and the cake can firm up some more. After removing the rest of the mold, let the cake cool on the rack completely. DO NOT sit the cake upright until completely cooled.  Frost with Seven Minute Icing or any other white icing of your choice and decorate to look like a lamb."
    ],
    "ingredients": [
        "2 1/4 cups cake flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 1/4 cups white sugar",
        "1/2 cup butter",
        "1 cup milk",
        "1 teaspoon vanilla extract",
        "4 egg whites"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easter Lamb Cake II",
    "url": "http://allrecipes.com/recipe/17129/easter-lamb-cake-ii/"
}
