{
    "directions": [
        "Preheat an oven to 350°F. Spread the coconut on a baking sheet and toast until lightly browned, about 8 minutes.",
        "Line a standard 12-cup muffin pan with paper or foil liners.",
        "In a large bowl, whisk together the flour, baking powder and salt. In a small bowl, stir together the sour cream, oil and vanilla. In another bowl, using an electric mixer, beat together the sugar and butter on medium-high speed until light and fluffy, 2 to 3 minutes. Add the eggs one at a time, beating well after each addition. Reduce the speed to low and add the flour mixture in 3 additions, alternating with the sour cream mixture in 2 additions, beating until just combined; scrape down the sides of the bowl as needed.",
        "Divide the batter evenly among the prepared muffin cups, filling each about three-fourths full. Bake until the cupcakes are lightly golden on top and a toothpick inserted into the center of a cupcake comes out clean, 18 to 20 minutes. Transfer the pan to a wire rack and let cool for 5 minutes. Then transfer the cupcakes to the rack and let cool completely, about 1 hour.",
        "Frost the cupcakes with the buttercream. Top each cupcake with a ring of toasted coconut. Place an Easter egg candy (or candies) in the center of each nest and serve. (The finished cupcakes can be refrigerated in an airtight container for up to 2 days; bring to room temperature before serving.) Makes 12 cupcakes.",
        "Adapted from",
        "Cupcakes,",
        "by Shelly Kaldunski (Weldon Owen, 2008)."
    ],
    "ingredients": [
        "3/4 cup sweetened shredded coconut",
        "1 1/4 cups all-purpose flour",
        "1 1/4 tsp. baking powder",
        "1/4 tsp. salt",
        "1/4 cup sour cream",
        "2 Tbs. vegetable oil",
        "1/2 tsp. vanilla extract",
        "3/4 cup sugar",
        "6 Tbs. (3/4 stick) unsalted butter, at room temperature",
        "2 eggs, at room temperature",
        "Quick buttercream frosting",
        "Easter egg candies for decorating"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Easter Egg Nest Cupcakes",
    "url": "http://www.williams-sonoma.com/recipe/easter-egg-nest-cupcakes.html"
}
