{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Grease and flour an 8 inch springform pan. Line the bottom and sides of pan with greased parchment paper.",
        "In a large bowl, cream together the margarine and brown sugar until light and fluffy. Beat in the eggs one at a time. Beat in the flour. Stir in the golden raisins, currants, candied cherries, mixed fruit, lemon zest and mixed spice. Pour 1/2 of batter into prepared pan.",
        "Divide almond paste into 3 equal portions. Roll out 1/3 of the almond paste to an 8 inch circle. Place the circle of almond paste on the cake batter in pan. Cover with remaining cake batter.",
        "Bake in the preheated oven for 2 1/2 hours, or until evenly brown and firm to the touch. If the cake is browning too quickly, cover with foil after an hour of baking. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely. Set oven to broil.",
        "When the cake has cooled, brush the top with warmed apricot jam. Roll out 1/3 of the almond paste into an 8 inch circle and place on top of cake. Divide the remaining 1/3 of almond paste into 11 pieces and roll into balls. These represent the 11 Apostles (excluding Judas.) Brush the almond paste on top of cake with beaten egg. Arrange the 11 balls around the outside edge on the top of cake. Brush the balls lightly with egg.",
        "Place cake under the broiler for 8 to 10 minutes, or until almond paste is golden brown."
    ],
    "ingredients": [
        "1 cup margarine, softened",
        "1 cup light brown sugar",
        "4 eggs",
        "1 3/4 cups self-rising flour",
        "1 1/3 cups golden raisins",
        "1 cup dried currants",
        "2/3 cup candied cherries - rinsed, dried and quartered",
        "1/4 cup candied mixed fruit peel, chopped",
        "2 tablespoons grated lemon zest",
        "2 teaspoons mixed spice",
        "1 pound almond paste",
        "2 tablespoons apricot jam",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easter Simnel Cake",
    "url": "http://allrecipes.com/recipe/24995/easter-simnel-cake/"
}
