{
    "directions": [
        "1. Soak the mushrooms in 1 cup hot water for 20 minutes.",
        "2. Heat a heavy-based, high-sided frying pan or saucepan over medium heat. Add a generous chunk of butter and a glug of oil and sauté the onion and garlic for about 5 minutes until soft but not colored.",
        "3. Add the rice and stir vigorously around the pan for a couple of minutes until the grains start to turn slightly translucent at the edges. Deglaze the pan by pouring in the wine and scraping up the bits at the bottom. Bring to a boil, then lower the heat and simmer for a minute or two to burn off the alcohol.",
        "4. Meanwhile, heat the stock and add the soaking liquor from the mushrooms. Add a ladleful of the hot stock mixture to the rice and stir over medium heat until absorbed, then add another ladleful. Repeat until all the stock is used up or the rice is tender but still al dente. Make sure to stir regularly to create a creamy risotto. (This should take about 20 minutes.)",
        "5. Chop the rehydrated mushrooms into small pieces and gently stir into the cooked risotto. Add a chunk of butter and the Parmesan, then stir to mix well. Taste and adjust the seasoning if necessary, then leave the risotto to cool (it will do this more quickly if you spread it onto a baking sheet).",
        "6. If using mini mozzarella balls, halve them; if using part of a large ball, cut it into 3/4-inch cubes.",
        "7. Lay out 3 plates or shallow bowls. Put the beaten eggs in one, the flour (seasoned with a pinch of salt and pepper) in another, and the breadcrumbs in the final one.",
        "8. Once the risotto is cooled (it doesn't matter if it is still a little warm, as long as it has stiffened up a bit and is cool enough to handle), roll it into balls the size of golf balls. Push a piece of mozzarella into the middle of each ball, making sure that the cheese is completely enclosed. Leave to set in the fridge for at least 30 minutes or overnight.",
        "9. Heat a deep-fat fryer to 340°F or fill a large saucepan one-third full of flavorless oil and heat until a cube of bread dropped into the hot oil sizzles and turns golden brown in 30 seconds.",
        "10. Dip a rice ball into the flour, shake off any excess, then dip into the egg, allowing any excess to drip off. Finish by coating completely in the breadcrumbs. Repeat with the remaining balls.",
        "11. Deep-fry the balls in batches for 2-3 minutes until golden brown all over. Remove with a slotted spoon and drain on paper towels. Serve immediately while the middles are still melting. Drizzle with lemon juice, if using."
    ],
    "ingredients": [
        "1 ounce mixed dried wild mushrooms",
        "Butter",
        "Flavorless oil, such as peanut",
        "1 small onion or large shallot, peeled and finely diced",
        "1 garlic clove, peeled and crushed",
        "1 1/3 cups risotto rice",
        "1/2 cup dry white wine",
        "2 cups vegetable or chicken stock",
        "1 ounce Parmesan cheese, grated",
        "Sea salt and freshly ground black pepper",
        "9 mini mozzarella cheese balls or 1/2 large ball",
        "2 eggs, beaten",
        "About 3/4 cup all-purpose flour",
        "1 cup panko breadcrumbs or regular breadcrumbs",
        "Lemon wedges, to serve (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Rice",
        "Appetizer",
        "Fry",
        "Vegetarian",
        "Oscars",
        "New Year's Eve",
        "Mozzarella",
        "Deep-Fry",
        "Breadcrumbs",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Easy Arancini",
    "url": "http://www.epicurious.com/recipes/food/views/easy-arancini-51161800"
}
