{
    "directions": [
        "Preheat oven to 250 degrees F (120 degrees C).",
        "Place duck legs in a large bowl. Drizzle with vegetable oil. Sprinkle with salt, Chinese 5-spice, and black pepper. Mix ducks legs so all surfaces are coated with oil and seasonings.",
        "Sprinkle large pieces from 3 green onions into a baking dish large enough to hold the duck legs in a single layer. Place duck legs skin side up on top of the scallions. Scatter garlic clove halves over the duck legs. Place a piece of parchment paper directly on top of the duck legs to help retain moisture. Tightly cover the entire baking dish with aluminum foil.",
        "Bake duck legs in preheated oven for 3 hours. Turn off the oven, open oven door just a crack, and let baking dish rest in oven for 1 hour; do not uncover dish during this time. Remove dish from oven and let it cool to room temperature. Baste duck legs with some of the rendered fat. Place the parchment paper back over the duck legs and re-wrap the dish in foil. Refrigerate overnight.",
        "Mix hoisin sauce, lemon juice, sesame oil, and hot sauce, and together in a bowl.",
        "Remove bones from chilled duck legs; leave the skin on. Cut into 1/2-inch cubes.",
        "Place a tablespoon of rendered duck fat in a skillet over medium-high heat. Cook and stir 1/2 of the cubed duck until pieces are brown and crispy, 4 to 5 minutes. Add the second 1/2 of the duck pieces and cook and stir until duck is just heated through, about 1 minute. Stir in 1 tablespoon chopped green onions.",
        "Fill lettuce cups with a generous spoonful of the duck; drizzle serving sauce over the top. Garnish with diced cucumber, chopped green onions, and sesame seeds."
    ],
    "ingredients": [
        "6 whole duck legs",
        "1 tablespoon vegetable oil",
        "1 tablespoon kosher salt",
        "2 teaspoons Chinese five-spice powder",
        "1 teaspoon freshly ground black pepper",
        "3 green onions, cut into large pieces",
        "5 cloves garlic, halved",
        "Serving Sauce:",
        "1/4 cup hoisin sauce",
        "1/2 lemon, juiced",
        "1 teaspoon sesame oil",
        "1 teaspoon hot sauce",
        "1 tablespoon rendered duck fat",
        "18 whole butter or Bibb lettuce leaves",
        "Garnishes:",
        "1 cucumber, diced",
        "6 green onions, chopped, divided (or as needed)",
        "1 tablespoon sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy \"Peking Duck\" Lettuce Cups",
    "url": "http://allrecipes.com/recipe/245029/easy-peking-duck-lettuce-cups/"
}
