{
    "directions": [
        "Mix ground beef, 1/3 cup cream of onion soup, panko crumbs, egg, 1/4 package soup mix, salt, and black pepper together in a large bowl until smooth; divide and shape into 6 oval patties. Reserve remaining cream of onion soup and dry onion soup for a later step.",
        "Preheat an electric countertop skillet to 225 degrees F (110 degrees C).",
        "Cook patties in the hot skillet until browned, 3 to 5 minutes per side. Drain grease and return patties to the skillet after draining.",
        "Stir 1 cup water and the roast beef gravy mix together in a small saucepan until smooth. Cook gravy over medium heat, stirring frequently, until gravy comes to a simmer. Simmer 1 minute; remove from heat. Gravy will thicken after standing for a short time.",
        "Whisk remaining cream of onion soup, remaining packet of dry onion soup mix, ketchup, Worcestershire sauce, and dry mustard powder together in a bowl until smooth; stir soup mixture into prepared gravy. Pour the resulting sauce over the patties in the skillet.",
        "Cover skillet with lid and cook patties in the sauce, stirring occasionally, until the patties are very firm, hot, and no longer pink in the center, about 40 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C)."
    ],
    "ingredients": [
        "1 1/2 pounds ground beef",
        "1 (10.75 ounce) can cream of onion soup, divided",
        "1/2 cup panko bread crumbs",
        "1 egg",
        "1/2 (1 ounce) package dry onion soup mix (such as Lipton®), divided",
        "1 pinch salt, or more to taste",
        "1/8 teaspoon ground black pepper",
        "1 cup water",
        "1 (1.2 ounce) package roast beef gravy mix",
        "2 tablespoons ketchup",
        "1 1/2 teaspoons Worcestershire sauce",
        "1/4 teaspoon dry mustard powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Salisbury Steak for the Family",
    "url": "http://allrecipes.com/recipe/239537/easy-salisbury-steak-for-the-family/"
}
