{
    "directions": [
        "Mix brown sugar, spices, pepper, and 3 Tbsp. or 4 1/2 tsp. salt in a small bowl to combine; sprinkle all over surface and inside cavity of turkey. Place turkey on a V-shape roasting rack set inside a large roasting pan (if using a disposable pan, place it on a rimmed baking sheet). Chill, uncovered, at least 8 hours and up to 1 day.",
        "Let sit at room temperature 1 1/2–2 hours.",
        "Place a rack in middle of oven; preheat to 450°F. Smear butter all over outside of turkey. Arrange turkey wings (if using), neck, and giblets, then onions, celery, and garlic around turkey and pour in wine. Roast on center rack until skin is golden all over, 25–35 minutes. Reduce oven temperature to 300° and continue to roast turkey, rotating 180° halfway through, until an instant-read thermometer inserted into the thickest part of breast registers 150°F (temperature will rise as the bird rests), 1 1/2–2 hours. Carefully transfer turkey to a cutting board and tent with foil.",
        "Increase oven temperature to 450°F. Push vegetables, neck, giblets, and wings (if using) into center of roasting pan and sprinkle flour over. Roast until flour is very lightly browned in a few spots, 12–15 minutes. Scrape contents of roasting pan into a large saucepan. Add thyme and broth. Bring to a gentle boil and cook, stirring occasionally, until reduced by nearly half and gravy is thick enough to coat a spoon, 25–30 minutes. Strain mixture through a fine-mesh sieve into a medium saucepan; discard solids. Stir in soy sauce; season with more salt if needed. Bring to a gentle simmer over low heat while you carve the turkey. Thin with a bit more stock if needed."
    ],
    "ingredients": [
        "2 teaspoons dark brown sugar",
        "2 teaspoons ground fennel seeds, coriander seeds, aniseed, and/or celery seeds, or favorite spice blend (optional)",
        "1 teaspoon freshly ground black pepper",
        "3 tablespoons Diamond Crystal kosher salt or 4 1/2 teaspoons Morton kosher salt, plus more",
        "1 (11–13-pound) turkey, neck and giblets removed and reserved, patted dry",
        "6 tablespoons unsalted butter, room temperature",
        "1 pound turkey or chicken wings (optional)",
        "2 large onions, unpeeled, quartered",
        "4 celery stalks, halved crosswise",
        "1 head of garlic, halved crosswise",
        "2 cups dry white wine",
        "1/4 cup all-purpose flour",
        "6 sprigs thyme",
        "4 cups (or more) low-sodium chicken broth",
        "3 tablespoons soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Christmas"
    ],
    "title": "Easy Roast Turkey With No-Roux Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/easy-roast-turkey-with-no-roux-gravy"
}
