{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Spray baking sheets with cooking spray, or line with parchment paper.",
        "Place the flour, butter, cream cheese, and salt in a bowl. Cut it together with 2 knives or a pastry cutter until the butter and cream cheese is the size of small peas. Shape the dough into a ball, wrap with plastic wrap, and refrigerate for at least 2 hours.",
        "Cut the dough in half and place half in the refrigerator to stay cold. Roll the other half between 2 pieces of wax paper or parchment into a sheet about 1/8 inch thick. Lift off the top sheet, and use a heart-shaped cookie cutter to cut 18 cookies. Before lifting the cutouts from the wax paper, put the dough onto a flat baking sheet and into the freezer for a few minutes to firm up the cookies. Set the 18 cookies aside. Repeat with the other half of the dough, also making 18 heart-shaped cookies.",
        "Place 18 cookies onto the prepared baking sheets so they don't touch. Carefully brush a little beaten egg around the top of each cookie, and spoon about 1 teaspoon of preserves into the center of the cookie. Top each with another unfilled cookie, press together around the edges, and crimp the edges with a fork to seal in the filling and make a pretty edge. Brush the tops of the filled cookies with beaten egg, and sprinkle with sugar.",
        "Bake in the preheated oven until the cookies are a light golden brown, 10 to 12 minutes. Cool completely before placing in containers."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1/2 cup cold butter",
        "1/2 (8 ounce) package cold cream cheese",
        "1/8 teaspoon salt",
        "1 beaten egg",
        "6 tablespoons apricot preserves",
        "2 tablespoons white sugar, for sprinkling"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Fruit-Filled Pastry Heart Cookies",
    "url": "http://allrecipes.com/recipe/212858/easy-fruit-filled-pastry-heart-cookie/"
}
