{
    "directions": [
        "Sprinkle chicken breasts with 1/4 teaspoon salt, or as needed, on both sides. Place onto a rack, cover, and refrigerate for 30 minutes. Remove from refrigerator, and cut in half lengthwise on a slight diagonal to make 4 equal-size pieces. Place the chicken pieces between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to make 4 cutlets about 1/4 inch thick.",
        "Preheat oven to 200 degrees F (95 degrees C).",
        "Mix together flour, cornstarch, 1 teaspoon of salt, black pepper, and sugar in a shallow bowl. Place each cutlet into the flour mixture to coat; shake off excess flour. Melt 2 tablespoons of butter in a skillet over medium heat until foam disappears, and gently lay the coated cutlets into the butter. Cook until golden brown on both sides, about 3 minutes per side. Remove the chicken, and set aside on an oven-proof plate in the preheated oven to stay warm.",
        "Pour the sherry into the skillet and bring to a boil, scraping and dissolving all the brown flavor bits from the bottom of the skillet. Cook until the sherry is reduced to half its volume, about 5 minutes, and stir in the chicken broth; add the apple slices to the skillet. Cook, stirring occasionally, until the apples are soft and the sherry mixture is reduced by half. Stir in the brown sugar, 1 tablespoon of butter, and the Marsala wine until the sugar is dissolved and the sauce is thick.",
        "Return the chicken cutlets to the sauce, together with any juice from the plate, and turn to cover cutlets with sauce. Simmer about 2 minutes per side, and serve 2 cutlets per serving, topped with apple slices and sauce."
    ],
    "ingredients": [
        "2 skinless, boneless chicken breast halves",
        "1/4 teaspoon salt, or as needed",
        "3 tablespoons all-purpose flour",
        "2 tablespoons cornstarch",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pinch white sugar",
        "2 tablespoons butter",
        "1/4 cup medium sherry",
        "1 cup chicken broth",
        "1 Granny Smith apple - cored, peeled, and cut into 1/2-inch thick wedges",
        "1/3 cup light brown sugar",
        "1 tablespoon butter",
        "1 dash Marsala wine"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Chicken Cutlets with Apples",
    "url": "http://allrecipes.com/recipe/214227/easy-chicken-cutlets-with-apples/"
}
