{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Heat vegetable oil in a skillet over medium heat, and cook the ground turkey meat until browned and crumbly, breaking the meat apart as it cooks, about 10 minutes. Drain excess fat if necessary, and place into a bowl. Bring enough water to cover the frozen vegetables (about 2 cups) to a boil in a saucepan, then stir in the mixed vegetables; bring back to a boil over medium heat, cook until tender, about 5 minutes, then drain. Place the mixed vegetables in the bowl with the turkey. Mix the 2 packets of turkey gravy mix with 2 cups of water in a small saucepan over medium heat. Reduce heat, and simmer until the mixture comes to a boil. Simmer about 2 minutes to thicken. Pour the gravy into the bowl with the turkey and vegetables, and mix well.",
        "Stir the 2 packages of pie crust mix with the ice water, adding the water 1 tablespoon at a time and stirring it in with a fork, until the mixture forms a soft dough. Gather the dough together, and cut in half; cut each half into 4 pieces (8 pieces in all). Roll each piece out on a floured surface to about 6 inches square, then fit 4 pie crusts into the mini-loaf pans; retain the other 4 crusts. Spoon 1/4 of the turkey and vegetable mixture into each pan. Top each pie with another crust, then use a fork to crimp the 2 crusts together to seal. Cut away excess dough. Using a sharp knife, make 4 small slits into the top crust of each pie.",
        "Place the pies onto a baking sheet, and bake in the preheated oven until the crusts are golden brown and the filling is hot, 15 to 20 minutes. Allow to cool for about 10 minutes before serving."
    ],
    "ingredients": [
        "2 teaspoons vegetable oil",
        "1 1/2 pounds ground turkey",
        "1 (16 ounce) package frozen mixed vegetables",
        "2 (.87 ounce) packages turkey gravy mix",
        "2 cups water",
        "2 (9 ounce) packages pie crust mix (such as Jiffy®)",
        "1/2 cup ice water, or as needed",
        "4 disposable mini-loaf pans (5 5/8x2 inches)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Personal Turkey Pot Pies",
    "url": "http://allrecipes.com/recipe/215449/easy-personal-turkey-pot-pies/"
}
