{
    "directions": [
        "Cook noodles in a medium pot of boiling salted water according to package directions. Drain and rinse with cool water; set aside.",
        "Meanwhile, whisk oyster sauce, soy sauce, vinegar, and honey together in a medium bowl.",
        "Slice beef against the grain as thinly as possible. Transfer to a medium bowl and toss with 1/2 tsp. salt and 1/2 tsp. pepper.",
        "Heat 2 Tbsp. oil in a large wok or skillet over high. Add beef and cook, tossing often, until medium-rare, about 3 minutes. Transfer to a plate.",
        "Heat remaining 1 tsp. oil in same skillet over high. Cook garlic, ginger, and half of the scallions, stirring, for 30 seconds. Add peas and bell pepper and cook until vegetables are softened, about 1 minute. Add oyster sauce mixture and reserved noodles and cook, tossing with tongs, until everything is coated and sauce thickens slightly, 1–2 minutes more. Add beef and stir to combine.",
        "Divide among plates and top with remaining scallions and black pepper."
    ],
    "ingredients": [
        "8 ounces lo mein noodles or spaghetti",
        "1/2 teaspoon kosher salt, plus more",
        "1/2 cup oyster sauce",
        "1/4 cup low-sodium soy sauce",
        "1/4 cup rice wine vinegar",
        "3 tablespoons honey",
        "1 1/2 pounds flank steak, chilled",
        "1/2 teaspoon freshly ground black pepper, plus more",
        "2 tablespoons plus 1 teaspoon toasted sesame oil, divided",
        "2 large garlic cloves, pressed with a garlic press or finely chopped",
        "1 1/2 teaspoons finely grated ginger",
        "3 scallions, thinly sliced, divided",
        "8 ounces snow peas",
        "1 medium red bell pepper, cut into 1/4\"-thick strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Noodle",
        "Beef",
        "Pepper",
        "Pea",
        "Soy Sauce",
        "Ginger",
        "Dinner",
        "Lunar New Year"
    ],
    "title": "Easy Beef Lo Mein",
    "url": "http://www.epicurious.com/recipes/food/views/easy-beef-lo-mein"
}
