{
    "directions": [
        "To prepare the chicken, cut the chicken into 12 serving pieces—2 drumsticks, 2 thighs, 4 breast quarters and 4 wing segments (each wing cut into a drumette and a flat)—or have your butcher do this for you.",
        "In a medium bowl, whisk together the garlic, ginger, five-spice powder, honey, soy sauce and red pepper flakes; transfer to a large sealable plastic bag. Add the chicken to the bag and marinate at room temperature for 1 hour.",
        "While the chicken marinates, make the slaw: In a large bowl, whisk together the sesame seeds, rice vinegar, miso, sugar, ginger and salt. Add the sesame and canola oils in a slow, steady stream, whisking constantly, until emulsified. Add the red and green cabbages and green onions to the bowl and toss to combine. Refrigerate for 30 to 60 minutes before serving.",
        "Preheat a Breville convection oven to 400°F (200°C) on convection roast mode. Line a quarter baking sheet with aluminum foil. Arrange the chicken on the baking sheet and roast for 25 minutes. Remove the chicken from the oven, arrange on a serving platter and serve with the slaw alongside. Serves 4.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1 chicken, 3 1/2 to 4 lb. (1.75 to 2 kg)",
        "1 tsp. minced garlic",
        "1 tsp. grated ginger",
        "1/2 tsp. five-spice powder",
        "1 Tbs. honey",
        "1/2 cup (4 fl. oz./125 ml) soy sauce",
        "1/4 tsp. red pepper flakes",
        "2 Tbs. toasted sesame seeds",
        "2 Tbs. rice vinegar",
        "1 Tbs. white miso",
        "1 Tbs. sugar",
        "1 tsp. grated ginger",
        "1 tsp. kosher salt",
        "2 Tbs. sesame oil",
        "1/4 cup (2 fl. oz./60 ml) canola oil",
        "1/4 head red cabbage, cored and thinly sliced",
        "1/2 head green cabbage, cored and thinly sliced",
        "2 green onions, white and light green portions, sliced thinly on the diagonal"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Easy Weeknight Chicken with Sesame-Miso Slaw",
    "url": "http://www.williams-sonoma.com/recipe/easy-weeknight-chicken-with-sesame-miso-slaw.html"
}
