{
    "directions": [
        "Place the frozen rolls (or frozen bread loaves) on a baking sheet to thaw. Cover with a tea towel and let thaw and rise for 2 to 3 hours.",
        "Preheat the oven to 400 degrees F.",
        "Melt the butter in a large skillet over medium-high heat. Add the onions and allow to cook for a couple of minutes. Add the sausage and cook until brown, crumbling the sausage as you stir. Add the Italian seasoning and red pepper flakes. Remove from the skillet and allow to cool on a plate.",
        "In a separate bowl, combine the ricotta, mozzarella, Parmesan, salt, some pepper, parsley and 2 eggs.",
        "When the sausage is cool, stir it into the cheese mixture and set aside.",
        "When the rolls are thawed and risen, roll them out on a lightly floured surface until paper thin. Spoon 3 to 4 tablespoons of the filling onto half of the dough circle. Fold half of the dough over itself, and then press the edges to seal.",
        "Brush the surface of each calzone with the beaten egg, and then bake until nice and golden brown, 10 to 13 minutes. Serve with warm Marinara Sauce.",
        "Add a tablespoon or so of olive oil into a hot pan over medium-high heat and throw in the garlic and chopped onions and give them a stir.",
        "Now add the wine (or chicken broth), whisking to deglaze the bottom of the skillet. Cook until the liquid reduces by half.",
        "Add the crushed tomatoes and stir to combine. Add salt and pepper to taste and a pinch of sugar. Reduce the heat to low and simmer for 30 minutes.",
        "Toward the end of the cooking process, chop up your fresh parsley and basil and add it to the sauce to taste, stirring to combine."
    ],
    "ingredients": [
        "16 whole frozen, un-risen dinner rolls (I use Rhodes, can also use frozen bread loaves)",
        "1 tablespoon butter",
        "1 whole medium onion, diced",
        "1 pound breakfast or Italian sausage",
        "1/2 teaspoon Italian seasoning",
        "1/4 teaspoon red pepper flakes",
        "15 ounces whole milk ricotta",
        "1 1/2 cups grated mozzarella",
        "1/2 cup grated Parmesan",
        "2 tablespoons chopped fresh parsley",
        "1/2 teaspoon salt",
        "Black pepper",
        "2 whole eggs plus 1 whole egg, beaten",
        "All-purpose flour, for dusting",
        "Marinara Sauce, warmed, for serving, recipe follows",
        "Olive oil",
        "3 to 4 whole cloves garlic, minced",
        "1 whole small to medium onion, chopped",
        "1/2 cup white wine (or chicken broth)",
        "Three 15-ounce cans crushed tomatoes",
        "Salt and ground pepper",
        "Pinch sugar",
        "Fresh parsley leaves",
        "Fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sausage Recipes",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Easy Calzones",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/easy-calzones-recipe"
}
