{
    "directions": [
        "To make fillings, cover prunes with water in a saucepan, bring to a boil over medium heat, cover, reduce heat to a simmer, and cook for 10 minutes. Drain the liquid, and mash the prunes with a potato masher. Stir in 1/4 cup of walnuts, 2 tablespoons of honey, and 1 tablespoon of lemon juice. In another saucepan, cover apricots with water, bring to a boil, cover, and simmer 10 minutes; drain liquid. Mash apricots with 1/4 cup walnuts, 2 tablespoons honey, and 1 tablespoon lemon juice. Set both fillings aside.",
        "For the cookie, stir together the flour, baking powder, and salt in a bowl until well mixed.",
        "In another bowl, place the butter, shortening, and sugar, and mash them together with a spoon until the mixture is completely combined and creamy. Beat the egg, milk, and vanilla extract into the butter mixture. Beat the flour mixture gradually into the butter mixture, while sifting the flour mixture in through a sifter. Turn the dough out onto a well-floured surface, and knead a few times, until smooth and easy to handle. If dough is too sticky, knead in additional flour 1 tablespoon at a time. Cut the dough into two portions, wrap each portion separately, and refrigerate at least 3 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.",
        "Roll a portion of dough out on a floured surface to 1/8-inch thick, and cut into 12 circles with a 3-inch round cutter. Place 1 heaping teaspoon of prune filling into the center of a dough circle, and pinch the dough together to form a triangle, with the center open to expose the filling. Repeat for the rest of the circles.",
        "Brush the cookies with beaten egg and sprinkle with sugar, if desired. Bake in preheated oven until the cookies are lightly browned, 18 minutes. Remove from oven and let cool for about 5 minutes before removing to finish cooling on rack.",
        "While the prune cookies are baking, repeat the process with the second refrigerated portion of dough, rolling and cutting as before, and filling each with 1 heaping teaspoon of apricot filling. Pinch the cookies into triangles, brush with egg and sprinkle with coarse sugar as before, and bake the apricot cookies in the preheated oven for 18 minutes. Cool as for prune cookies."
    ],
    "ingredients": [
        "10 pitted prunes",
        "1/4 cup finely chopped walnuts",
        "2 tablespoons liquid honey",
        "1 tablespoon lemon juice",
        "20 chopped dried apricots",
        "1/4 cup finely chopped walnuts",
        "2 tablespoons liquid honey",
        "1 tablespoon lemon juice",
        "2 cups all-purpose flour, or more if needed",
        "2 teaspoons baking powder",
        "1/8 teaspoon salt",
        "1/2 cup butter, softened",
        "2 tablespoons vegetable shortening",
        "1 7/8 cups superfine sugar",
        "1 large egg",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract",
        "1 beaten egg (optional)",
        "1/4 cup coarse sugar for sprinkling (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Purim Hamentashen",
    "url": "http://allrecipes.com/recipe/213637/easy-purim-hamentashen/"
}
