{
    "directions": [
        "Blend all ingredients in bowl. Season butter with salt and pepper. (Can be prepared 2 days ahead. Cover and refrigerate.)",
        "Place clams and cornmeal (to help purge clams of sand) in very large bowl or pot; fill with enough cold salted water to cover clams. Set aside at least 30 minutes and up to 1 hour.",
        "Place 12-inch square of cheesecloth on work surface. Place celery, parsley, thyme, bay leaves, and peppercorns in center. Roll up and tie with string. Place bouquet garni in large (at least 18-quart) pot. Half-fill pot with cold water and bring to boil over high heat. Add 1 lobster headfirst; cover pot. Boil until lobster is almost cooked through and shell turns bright red, about 8 minutes. Using tongs, transfer lobster to bowl. Repeat with remaining lobsters.",
        "Add potatoes and onions to pot. Ladle off cooking liquid into large bowl, leaving enough to cover vegetables; reserve liquid in bowl. Bring liquid in pot to boil. Cover; cook potatoes and onions 10 minutes. Layer sausages and corn atop vegetables. Cover; cook until potatoes are just tender, about 10 minutes.",
        "Rinse clams thoroughly. Arrange clams atop corn and sausages. Place lobsters atop clams. Cover pot tightly with lid or, if necessary, cover tightly with overlapping large sheets of foil. Boil until clams open, about 12 minutes. Remove from heat.",
        "Transfer lobsters to work surface, shell side down. Place tip of large knife in center of 1 lobster. Cut lobster lengthwise in half from center to end of head (knife might not cut through shell), then cut lobster in half from center to end of tail. If necessary, use kitchen shears to cut through shell. Repeat with remaining lobsters. Mound clams (discarding any that did not open), lobsters and sausages on large platter; reserve cooking broth in pot. Surround seafood with corn, potatoes and, if desired, onions. Sprinkle vegetables with salt and pepper. Sprinkle with parsley; garnish with lemon wedges. Cover with foil to keep warm.",
        "Melt seasoned butter in saucepan; divide among 6 ramekins. Discard bouquet garni from pot. Taste broth; season with pepper. Add some of reserved lobster cooking liquid if broth is too salty. Bring broth to boil; divide among 6 soup cups. Serve seasoned butter and broth alongside vegetables, sausages, and seafood."
    ],
    "ingredients": [
        "1 cup (2 sticks) butter, room temperature",
        "3 large garlic cloves, finely chopped",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "6 dozen littleneck clams, scrubbed",
        "1/4 cup yellow cornmeal",
        "2 celery stalks, cut crosswise in half",
        "6 large fresh parsley sprigs",
        "6 fresh thyme sprigs",
        "2 small dried bay leaves",
        "1/4 teaspoon whole black peppercorns",
        "3 1 1/2-pound live lobsters",
        "12 small (about 2-inch-diameter) red-skinned potatoes, scrubbed",
        "6 small onions, peeled",
        "1 1/2 pounds fully cooked smoked sausages (such as kielbasa or andouille sausage), cut into 6 portions",
        "6 ears of corn, husked",
        "Chopped fresh parsley",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Sausage",
        "Clam",
        "Lobster",
        "Corn",
        "Summer"
    ],
    "title": "Easy Summer Clambake",
    "url": "http://www.epicurious.com/recipes/food/views/easy-summer-clambake-105351"
}
