{
    "directions": [
        "Preheat the oven to 450 degrees.",
        "Place the leg of lamb in a large roasting pan fat side up and pat it dry with paper towels. Combine the mustard, 1 tablespoon of garlic, the rosemary, balsamic vinegar, 1 tablespoon salt and 1/2 teaspoon of pepper in a mini food processor and pulse until the garlic and rosemary are minced. Spread the mixture on the lamb.",
        "Place the tomatoes, olive oil, 1/4 cup of the honey, the onion, the remaining 1 tablespoons garlic, 2 tablespoons salt, and 2 teaspoons pepper in a bowl and toss well. Pour the tomato mixture around the lamb and tuck in the thyme and rosemary sprigs. Drizzle the lamb with the remaining 1/4 cup of honey.",
        "Roast for 20 minutes. Turn the heat down to 350 degrees and roast for another 1 to 1 1/4 hours, until a meat thermometer registers 130 to 135 degrees for medium-rare. Place the lamb on a cutting board, cover with aluminum foil, and allow to rest for 15 minutes. Discard the herb stems and return the tomatoes to the oven to keep warm. Slice the lamb, arrange on a platter, sprinkle with salt and pepper, and serve with the tomatoes and pan juices spooned on top."
    ],
    "ingredients": [
        "1 (6- to 7-pound) bone-in leg of lamb, trimmed and tied",
        "1/2 cup Dijon mustard",
        "3 tablespoons chopped garlic (9 cloves), divided",
        "1 tablespoon chopped fresh rosemary leaves",
        "1 tablespoon balsamic vinegar",
        "Kosher salt and freshly ground black pepper",
        "3 pounds ripe red tomatoes, cored and 1-inch diced",
        "1/2 cup good olive oil",
        "1/2 cup good honey (see note), divided",
        "1 large Spanish onion, sliced",
        "4 sprigs fresh thyme",
        "2 sprigs fresh rosemary",
        "Note: You'll want to use a liquid—rather than a solid—honey for this recipe so it can be drizzled on the lamb."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Tomato",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Rosemary",
        "Winter",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Easy Provençal Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/easy-provencal-lamb-360869"
}
