{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch square pan and an 8-inch round pan.",
        "Beat white sugar and 1 cup butter together in a bowl with an electric mixer until creamy and smooth. Mix eggs, 1 tablespoon vanilla extract, and almond extract into creamed butter mixture. Stir baking powder and baking soda into butter mixture until just combined.",
        "Stir 1 cup flour into butter mixture until just combined. Add 2/3 cup milk into butter-flour mixture; mix well. Continue adding 1 cup flour and 2/3 cup milk, alternating until all the flour and milk are used and batter is smooth. Pour batter into the 2 prepared pans.",
        "Bake in the preheated oven until a toothpick inserted in the center of each cake comes out clean, 30 to 40 minutes. Cool cakes completely before removing from pans, at least 2 hours.",
        "Beat confectioners' sugar, 1 cup butter, and 2 teaspoons vanilla extract together in a bowl with an electric mixer until icing is fluffy and smooth.",
        "Remove cakes from pans and slice round cake in half. Lay the square cake on a work surface so it resembles a diamond-shape. Lay 1 round cake half on the top left side of the 'diamond' cake. Lay the second round cake half on the top right side of the 'diamond' cake, creating a 'heart-shaped' cake on top. Spread icing over the assembled cake."
    ],
    "ingredients": [
        "Cake:",
        "2 cups white sugar",
        "1 cup butter, softened",
        "4 eggs, beaten",
        "1 tablespoon vanilla extract",
        "1 teaspoon almond extract (optional)",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "3 cups all-purpose flour",
        "2 cups milk",
        "Icing:",
        "4 cups confectioners' sugar",
        "1 cup butter, softened",
        "2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Valentine's Day Cake",
    "url": "http://allrecipes.com/recipe/231236/easy-valentines-day-cake/"
}
