{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a pot of water to a boil. Cook chicken breasts in boiling water until no longer pink in the center and the juices run clear, 12 to 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into 1-inch pieces.",
        "Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes; drain.",
        "Melt butter in a large saucepan over medium heat. Cook and stir onion in butter until tender, about 5 minutes. Pour mushroom soup, chicken soup, and celery soup into the saucepan; stir and bring to a simmer. Add about half the Cheddar cheese; stir into the soup mixture and cook until velvety, about 5 minutes. Stir chicken, half-and-half, pimentos, wine, mushrooms, parsley, and steak sauce into the soup mix; cook until hot.",
        "Toss angel hair pasta and soup mixture together in a large baking dish; top with remaining Cheddar cheese. Sprinkle paprika over the cheese layer.",
        "Bake in preheated oven until the liquid is bubbling, about 45 minutes."
    ],
    "ingredients": [
        "5 skinless, boneless chicken breasts",
        "1 pound angel hair pasta",
        "2 tablespoons butter",
        "1 onion, chopped",
        "1 (10.75 ounce) can cream of mushroom soup",
        "1 (10.75 ounce) can cream of chicken soup",
        "1 (10.75 ounce) can cream of celery soup",
        "1 1/4 pounds shredded sharp Cheddar cheese, divided",
        "1 cup half-and-half",
        "1 (7 ounce) jar pimentos",
        "1/2 cup white cooking wine",
        "1 (3 ounce) can sliced mushrooms, drained",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon steak sauce",
        "1 dash paprika"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Chicken Tetrazzini for a Large Family",
    "url": "http://allrecipes.com/recipe/232165/easy-chicken-tetrazzini-for-a-large-f/"
}
