{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray at 9x13-inch glass baking dish with cooking spray.",
        "Combine sugar, flour, butter, eggs, walnuts, cocoa powder, vanilla extract, baking powder, and salt together in a large bowl, stirring well as each ingredient is added, until smooth batter forms. Pour batter into prepared baking dish.",
        "Bake in preheated oven until top is dry and edges have started to pull away from the sides of the pan, 20 to 30 minutes. Cool to room temperature, 30 to 45 minutes.",
        "Remove ice cream from freezer to defrost slightly, about 10 minutes. Spread caramel topping over cooled brownies using a rubber spatula. Spread a single layer of ice cream over caramel topping. Scatter 1/2 of the peanut butter cups evenly and press into ice cream layer. Place cake in freezer until ice cream layer is hardened, at least 1 hour.",
        "Remove baking dish from freezer. Spread an even layer of fudge topping over cake. Cover with waxed paper and return to freezer until hardened, about at least 1 hour.",
        "Frost cake with chocolate frosting and top with remaining peanut butter cups."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "Brownie Base:",
        "cooking spray",
        "2 cups white sugar",
        "1 1/2 cups all-purpose flour",
        "1 cup butter, melted",
        "4 eggs",
        "1/2 cup chopped walnuts (optional)",
        "1/2 cup cocoa powder",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 gallon vanilla ice cream with fudge and caramel swirls",
        "1 cup caramel ice cream topping",
        "1 (13 ounce) package miniature peanut butter cups (such as Reese's® Minis)",
        "2 cups fudge ice cream topping",
        "2 cups prepared chocolate buttercream frosting, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Brownie and Peanut Butter Cup Ice Cream Cake",
    "url": "http://allrecipes.com/recipe/246375/easy-brownie-and-peanut-butter-cup-ic/"
}