{
    "directions": [
        "Special equipment: 10-inch cast-iron pan",
        "Preheat the oven to 400 degrees F.",
        "Sprinkle the chicken tenders with paprika, sage, oregano, salt and pepper. Heat a 10-inch cast-iron pan over medium-high heat and add the olive oil. When the oil begins to swirl, add the seasoned chicken and saute until cooked through, about 4 minutes on the first side and 3 minutes on the second side. Remove the chicken to a plate with tongs, leaving the oil in the pan. Rest the chicken for a few minutes, and then chop into 1/2-inch cubes.",
        "To the same pan, add the onions and peas and carrots and sprinkle with salt and pepper. Stir and cook until the onions become tender, 3 to 5 minutes. Add the garlic and cook until fragrant, about 1 minute longer. Sprinkle in the flour and stir until the flour dissolves into the vegetables and juices. Add the chicken stock and raise to a simmer, stirring until thickened. Once the liquid has thickened, stir in the heavy cream. Season with salt, if needed.",
        "Return the chicken to the pan. Unfold the pie crust and place over the top of the filling, tucking the excess edges inside the pan. Brush the crust evenly with the egg wash. Using a knife, gently cut 3 vents in the top of the crust. Place in the oven and bake until the crust is golden brown, about 20 minutes."
    ],
    "ingredients": [
        "1 1/2 pounds chicken tenders (about 10 tenders)",
        "1/2 teaspoon sweet paprika",
        "1/2 teaspoon dried sage",
        "1/4 teaspoon dried oregano",
        "Salt and freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "1 cup frozen pearl onions",
        "1 cup frozen peas and diced carrots",
        "2 cloves garlic, minced",
        "2 tablespoons all-purpose flour",
        "2 cups low-sodium chicken stock",
        "1 cup heavy cream",
        "1 store bought pie crust, unbaked and thawed if frozen",
        "1 egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Pot Pie Recipes",
        "Vegetable"
    ],
    "title": "Easy Chicken Pot Pie",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/easy-chicken-pot-pie-recipe"
}
