{
    "directions": [
        "Heat 2 tablespoons oil in a small saucepan over medium-high heat. Add onion, garlic, and chile; season with salt and pepper. Cook, stirring often, until soft, about 5 minutes.",
        "Add tomato paste to saucepan and cook, stirring, until beginning to darken, about 1 minute. Stir in Worcestershire sauce, vinegar, brown sugar, mustard, and hot sauce; simmer until slightly thickened, about 5 minutes. Transfer to a blender and purée with 1/2 cup water until smooth. Strain through a fine-mesh sieve into a small bowl, if desired. Set sauce aside.",
        "Heat remaining 1 tablespoon oil in a large skillet over medium-high heat. Season steak with salt and pepper and cook, turning occasionally, until deeply browned and an instant-read thermometer registers 130°F for medium-rare, 8–10 minutes.",
        "Transfer meat to a cutting board; let rest 5 minutes before slicing. Serve with sauce.",
        "DO AHEAD: Steak sauce can be made 1 week ahead. Cover and chill."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "1 medium onion, chopped",
        "4 garlic cloves, chopped",
        "1 Fresno chile or red jalapeño, seeded, chopped",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "1 tablespoon tomato paste",
        "1/2 cup Worcestershire sauce",
        "1/2 cup red wine vinegar",
        "1/4 cup (packed) dark brown sugar",
        "2 tablespoons whole grain mustard",
        "Few dashes of hot sauce",
        "1 1/2 pounds hanger steak, center membrane removed, cut into 4 pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Meat",
        "Steak",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Easy Steak Sauce with Seared Hanger Steak",
    "url": "http://www.epicurious.com/recipes/food/views/easy-steak-sauce-with-seared-hanger-steak-51209670"
}
