{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.",
        "Blend cake mix, water, oil, and eggs in a large bowl at low speed with an electric mixer until moistened. Beat at medium speed for 2 minutes. Pour batter into the prepared pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 26 minutes. Cool in pan for 10 minutes. Crumble cake while still warm into a large bowl and stir in chocolate chips. Once chocolate chips have melted, stir in frosting. Mix by hand until the mixture has a dough-like consistency.",
        "Scoop cake mixture with a melon baller or small scoop, round each scoop into a ball using your hands, and place on a baking sheet. Freeze cake balls for 10 minutes.",
        "Melt about 1/4 the chocolate coating in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes.",
        "Remove cake balls from freezer. Dip each stick into melted chocolate and insert all the way through cake balls. The melted chocolate will harden and hold cake on the stick. Return to the freezer for 10 minutes.",
        "Melt remaining chocolate coating and white chocolate coating in separate microwave-safe bowls in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Remove cake pops from freezer; dip each cake pop in either melted white chocolate or chocolate. Spoon sprinkles or chopped nuts over cake pops before the coating hardens. Stick each cake pop upright into the styrofoam blocks until candy shell hardens. Refrigerate cake pops until ready to serve."
    ],
    "ingredients": [
        "2 (18.25 ounce) packages devil's food cake mix",
        "2 cups water",
        "2/3 cup vegetable oil",
        "6 eggs",
        "1 (6 ounce) bag semisweet chocolate chips",
        "1 (16 ounce) package prepared chocolate frosting",
        "2 (14 ounce) bags chocolate confectioners' coating",
        "50 lollipop sticks",
        "2 (14 ounce) bags white confectioners' coating",
        "1 (1.75 ounce) package multicolored candy sprinkles, or as needed (optional)",
        "1/2 cup chopped nuts, or as needed (optional)",
        "styrofoam blocks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Easy Fudgy Cake Pops",
    "url": "http://allrecipes.com/recipe/234001/easy-fudgy-cake-pops/"
}
