{
    "directions": [
        "Fill a large pot half full with lightly salted water and bring to a rolling boil. Add corn cobs and return to a boil. Cook until corn is softened but still firm, about 5 minutes. Remove from pot; rinse with cold water until cool enough to handle. Cut kernels from the cob with a sharp knife; place into a large mixing bowl.",
        "Place edamame into a large pot; pour in 2- to 3-inches of water. Cover; bring to a boil. Steam edamame until shells are softened, 2 to 3 minutes. Drain; let cool. Squeeze the center of each pod to pop the edamame out into a bowl.",
        "Mix edamame, black beans, tomatoes, and onion into the corn kernels; season with salt and pepper.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; place jalapeno skin side up on the baking sheet.",
        "Roast jalapeno in the preheated oven until outer skin is charred, about 5 minutes; mince with a sharp knife.",
        "Combine olive oil, garlic, roasted jalapeno, lemon juice, cilantro, balsamic vinegar, and cumin in a bowl; whisk until well mixed. Pour over vegetable mixture; stir until vegetables are coated."
    ],
    "ingredients": [
        "Salad:",
        "6 ears corn, husks and silk removed",
        "8 cups fresh edamame (in shell)",
        "1 (15 ounce) can black beans, rinsed and drained",
        "2 large ripe tomatoes, diced",
        "2 small onions, finely chopped",
        "salt and ground black pepper to taste",
        "Dressing:",
        "1 jalapeno, cut in half and seeded",
        "3/4 cup extra-virgin olive oil",
        "4 cloves garlic, minced",
        "2 1/2 tablespoons lemon juice",
        "2 tablespoons finely chopped cilantro",
        "1 tablespoon balsamic vinegar",
        "1 1/2 teaspoons ground cumin"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Edamame Salad with Homemade Garlic Cilantro Vinaigrette",
    "url": "http://allrecipes.com/recipe/254879/edamame-salad-with-homemade-garlic-ci/"
}
