{
    "directions": [
        "Heat oil in large pot (preferably nonstick) over high heat. Add next 6 ingredients; sauté until vegetables are deep golden brown, about 15 minutes. Transfer 1 cup sautéed vegetables to cutting board; chop vegetables and reserve. Add 6 cups broth, parsley and thyme to pot and bring to boil. Reduce heat, cover and simmer until remaining vegetables in pot are very tender, about 15 minutes. Remove from heat; cool slightly.",
        "Working in batches, puree vegetable-broth mixture in blender. Transfer to strainer set over bowl. Press on solids to extract as much liquid as possible. Discard solids in strainer. Return liquid and reserved chopped vegetables to pot. (Can be made 1 day ahead. Cover; chill.)",
        "Bring soup to boil, thinning with more vegetable broth if necessary. Add pasta; reduce heat to medium and cook until pasta is tender, about 10 minutes. Add edamame; simmer until heated through, about 5 minutes longer. Ladle soup into bowls; top with cheese."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "3 large plum tomatoes, quartered",
        "4 ounces crimini mushrooms, quartered",
        "1 large onion, sliced",
        "1 large red bell pepper, cut into 1/2-inch-wide strips",
        "1 carrot, peeled, slice",
        "1 garlic clove, chopped",
        "6 cups (or more) canned vegetable broth",
        "3 large fresh Italian parsley sprigs",
        "3/4 teaspoon dried thyme",
        "1/2 cup small elbow macaroni",
        "2 cups shelled cooked edamame beans (from about 26 ounces of pods)",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Mushroom",
        "Onion",
        "Pasta",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Bell Pepper",
        "Carrot",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Edamame and Sauteed Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/edamame-and-sauteed-vegetable-soup-104193"
}
