{
    "directions": [
        "Heat a large skillet over high heat. Remove from the heat and coat with cooking spray. Return the skillet to the burner and add the eggs, turning the pan to coat it with a thin layer of eggs. Cook 30 seconds, loosening the inside edges of the eggs with a spatula. Gently flip the eggs over and cook 10 to 15 seconds. Transfer the eggs to a cutting board.",
        "Heat the same skillet over medium heat. Add half the oil. Add the mushrooms, bell pepper, broccoli, and kale. Cook 4 to 5 minutes, turning often, until the vegetables soften. Add the garlic and ginger. Cook 1 minute, until it becomes fragrant.",
        "Increase the heat to high. Push the vegetables to one side of the skillet and add the remaining olive oil, and the rice. Cook 1 to 2 minutes, turning the rice over with a metal spatula and scraping up bits that stick to the pan. Add the edamame and soy sauce and remove from the heat. Stir two or three times to mix in the soy sauce.",
        "Thinly slice the eggs. Top the rice mixture with the eggs and scallions and serve."
    ],
    "ingredients": [
        "Olive oil cooking spray",
        "2 eggs, beaten",
        "2 tablespoons light olive oil, divided",
        "8 ounces shiitake mushroom caps, thinly sliced",
        "1 red bell pepper, seeded and chopped",
        "4 cups broccoli florets",
        "4 ounces kale, chopped (about 2 cups)",
        "4 garlic cloves, minced",
        "1 2-inch piece fresh gingerroot, minced (about 2 tablespoons)",
        "1 cup uncooked short-grain brown rice, cooked according to the package instructions",
        "1 1/2 cups frozen, shelled edamame, defrosted",
        "3 tablespoons reduced-sodium soy sauce",
        "2 scallions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Vegetable",
        "Stir-Fry",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Broccoli",
        "Kale",
        "Healthy",
        "Brown Rice",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Edamame Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/edamame-fried-rice-51186610"
}
