{
    "directions": [
        "Pour the oil into a small, deep saucepan and place on the cooker (stove) top or over very low and steady heat, making sure it does not reach a very high temperature. Heating the oil can also be done over the edge of the cooker top so that it is done as gently as possible. When the oil is warm, place the separated, unpeeled garlic cloves in the oil and poach them gently for approximately 2 hours. They should be tender, easy to peel and thoroughly impregnated with oil. When ready, drain the oil, peel the garlic cloves, crush them, then pass them through a chinois and set aside.",
        "Place the kaolin, lactose, black dye and salt in a bowl and mix together, gradually adding the water. The mixture may seem too dry at first, but if left for an hour or so will liquefy and develop a yogurt-like texture suitable for coating the boiled potatoes, thick but not runny.",
        "Gently clean the potatoes with a soft brush. Do not peel. Bring the salted water to a boil in a large saucepan, then add the potatoes. Boil for 15-20 minutes, depending on the size of the potatoes, without overcooking them. Drain them and place on a baking sheet.",
        "Pierce the flattest side of each potato with the tip of a skewer. Remove the skewer and insert its blunt end in the same hole until it reaches roughly the centre of the potato. Stir the kaolin mixture until thoroughly combined and of the correct consistency. Dip the potatoes into the mixture, completely covering them. Insert the ends of the skewers into the holes of a perforated baking sheet so that they are held in a vertical position. Place the sheet in a stove or oven at a low temperature—50°C (120°F)—for approximately 30 minutes or until the coating has dried out to a crisp texture. This will contrast with the smoothness of the potato inside, which will be tender and creamy thanks to the protection of this 'shell'.",
        "Put the garlic confit in a tall beaker, add the egg yolk and combine with a hand-held blender until the mixture forms an emulsion. Meanwhile, slowly drizzle the oil in, being careful that the emulsion does not lose stability. Once ready, add salt to taste and set aside in a covered bowl.",
        "Heat a few polished river stones the size of the potatoes coated in the grey clay in the oven at 70°C (160°F) for 5-7 minutes. The stones will add the finishing touch to the presentation and keep the potatoes hot for longer. Serve the potatoes in between the stones. Serve a heaped portion of alioli in smaller, individual dishes. The potatoes should be eaten with the fingers and the first bite should be taken without the sauce. This will accentuate the difference in the texture between the coating and its content. After that, the potatoes should be dipped into the alioli."
    ],
    "ingredients": [
        "500 ml extra-virgin olive oil",
        "1 garlic bulb",
        "60 ml kaolin",
        "40 g lactose",
        "1 g black vegetable dye",
        "0.5 g table salt",
        "80 ml water",
        "16 small Cherie potatoes (32-35 g each)",
        "3 litres water",
        "24 g salt",
        "The potatoes (see above)",
        "The coating (see above)",
        "40 g garlic confit (see above)",
        "1 egg yolk",
        "60 ml extra-virgin olive oil",
        "Salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Potato",
        "Appetizer",
        "Halloween",
        "Party"
    ],
    "title": "Edible Stones",
    "url": "http://www.epicurious.com/recipes/food/views/edible-stones-51102800"
}
