{
    "directions": [
        "Stir seeds in large skillet over medium-high heat until beginning to color and pop, about 6 minutes. Transfer to blender. Add 2 3/4 cups broth. Blend until smooth, scraping down sides of blender occasionally. Thin sauce to consistency of thin mayonnaise, adding broth by 1/4 cupfuls; season with salt.",
        "Combine tomatoes, 2 tablespoons oil, 2 tablespoons water, oregano and chili in heavy medium saucepan and bring to boil. Reduce heat to low, cover and simmer until tomatoes fall apart, stirring occasionally, about 30 minutes. Transfer tomato mixture to processor and puree. Season to taste with salt. (Sauces can be made 1 day ahead. Cover separately; chill.)",
        "Preheat oven to 325°F. Pour additional vegetable oil into medium skillet to depth of 1/4 inch. Heat oil over medium-low heat. Fry 1 tortilla in oil just until soft, about 1 minute. Transfer to baking sheet. Pat with paper towels to absorb excess oil. Repeat with remaining tortillas, adding more oil to skillet if needed.",
        "Rewarm pumpkin-seed sauce; remove from heat. Dip 1 tortilla into sauce; transfer to plate. Spoon 2 tablespoons chopped egg into center. Roll up to enclose egg. Place taco, seam side down, in 13x9x2-inch glass baking dish. Repeat dipping and filling remaining tortillas. Cover dish with foil.",
        "Bake tacos until heated through, about 30 minutes. Rewarm tomato-habañero sauce and remaining pumpkin-seed sauce. Transfer 2 tacos to each of 6 plates. Spoon remaining pumpkin-seed sauce, then tomato sauce over tacos. Sprinkle with grated eggs and serve.",
        "*Also known as pepitas. Available at Latin American markets, natural foods stores and many supermarkets."
    ],
    "ingredients": [
        "2 1/2 cups shelled pumpkin seeds*",
        "2 3/4 cups (or more) canned low-salt chicken broth",
        "6 large plum tomatoes, halved",
        "2 tablespoons vegetable oil",
        "2 tablespoons water",
        "3 fresh oregano sprigs",
        "1/4 seeded habañero chili",
        "Additional vegetable oil",
        "12 5- to 6-inch corn tortillas",
        "8 hard-boiled eggs, peeled, 6 chopped, 2 finely grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Herb",
        "Tomato",
        "Appetizer",
        "Bake",
        "Lunch",
        "Hot Pepper",
        "Summer",
        "Tortillas",
        "Seed",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Egg Tacos with Pumpkin-Seed and Tomato-Habanero Sauces",
    "url": "http://www.epicurious.com/recipes/food/views/egg-tacos-with-pumpkin-seed-and-tomato-habanero-sauces-103781"
}
