{
    "directions": [
        "In a large bowl combine well the hard-boiled eggs, the onion, the apple, the béchamel, the cumin, the lemon juice, and salt and pepper to taste and chill the mixture for 30 minutes. Form the mixture in 1-inch balls, dip the balls in raw eggs, shaking off the excess, and roll them in the bread crumbs, transferring the croquettes as they are made to a baking sheet lined with wax paper. Chill the croquettes, covered loosely, for 1 hour. In a deep fryer or heavy deep skillet heat 2 inches of the oil to 350°F. and in it fry the croquettes in batches, turning them and transferring them to paper towels to drain with a slotted spoon as they are done, for about 2 minutes, or until they are golden. In a small bowl stir together the applesauce and the horseradish. Serve the croquettes with the sauce.",
        "In a saucepan cook the onion in the butter over moderately low heat, stirring, until it is softened. Stir in the flour and cook the roux, stirring, for 3 minutes. Add the milk in a stream, whisking vigorously until the mixture is thick and smooth, add the salt and the white pepper, and simmer the sauce for 10 to 15 minutes, or until it is thickened to the desired consistency. Strain the sauce through a fine sieve into a bowl and cover the surface with a buttered round or wax paper to prevent a skin from forming. Makes about 2 1/4 cups."
    ],
    "ingredients": [
        "6 hard-boiled large eggs, chopped fine",
        "2 tablespoons chopped onion",
        "1/4 cup chopped dried apple",
        "1/2 cup béchamel sauce",
        "1 teaspoon ground cumin, or to taste",
        "1 tablespoon fresh lemon juice, or to taste",
        "2 raw large eggs, beaten lightly",
        "2 cups fresh bread crumbs",
        "vegetable oil for deep-frying the croquettes",
        "1/2 cup bottled applesauce",
        "1 teaspoon bottled horseradish",
        "1 tablespoon minced onion",
        "3 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "3 cups milk",
        "1/4 teaspoon salt",
        "white pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Appetizer",
        "Fry",
        "Apple",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Egg, Onion, and Apple Croquettes",
    "url": "http://www.epicurious.com/recipes/food/views/egg-onion-and-apple-croquettes-11506"
}
