{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.",
        "In a large skillet, melt 2 tablespoons butter over medium heat. Saute onion and celery until onion is soft and translucent.  Stir in the ham and continue to saute until the vegetables are tender and the ham is heated through. Add the chicken broth, water and the remaining 1/2 cup butter or margarine and heat until the butter is completely melted.",
        "Place the stuffing mix in a large bowl. Pour the contents of the skillet over the stuffing and toss together gently until mixed. Turn the mixture into the prepared baking pan.",
        "Cover pan with aluminum foil and bake in preheated oven for 25 minutes, until heated through. Remove from the oven and make 6 evenly spaced indentations big enough for each to hold an egg.  Take care not to leave a bare spot at the bottom of the indentations.  Carefully break an egg into each indentation, leaving the yolks whole.  Return to the oven, uncovered, and bake another 12 to 14 minutes, until whites of the eggs are nearly set.",
        "Remove from the oven again and sprinkle evenly with the cheese and then dust with paprika.  Continue to bake for another 3 to 4 minutes, or until cheese is melted and whites of the eggs are just set, but yolks are still soft. Serve hot, with one egg in each serving."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1 cup chopped onion",
        "2 stalks celery, diced",
        "4 cups diced cooked ham",
        "1 (14.5 ounce) can chicken broth",
        "1/2 cup water",
        "1/2 cup butter",
        "1 (14 ounce) package seasoned cornbread stuffing mix",
        "6 eggs",
        "1 1/2 cups shredded Cheddar cheese",
        "1/2 teaspoon paprika, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Egg and Cornbread Bake",
    "url": "http://allrecipes.com/recipe/21068/egg-and-cornbread-bake/"
}
