{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Lightly oil a 15- by 10-inch shallow baking pan, then line bottom and all 4 sides with parchment paper, allowing 2 inches of parchment to hang over short sides of pan, and lightly brush parchment (except overhang) with oil.",
        "Heat 1 teaspoon oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then cook sausage, stirring, until finely crumbled and cooked through, about 2 minutes. Transfer to a bowl and keep warm, covered.",
        "Add remaining 2 teaspoons oil to skillet and sauté garlic and scallions, stirring, until golden, about 3 minutes. Add mushrooms, pepper, and 1/4 teaspoon salt and sauté, stirring, until mushrooms are softened and golden, about 8 minutes. Add sausage and spinach to skillet and sauté, stirring, 3 minutes. Transfer half of spinach mixture to a food processor and add water, then blend until finely chopped. Return to skillet, stirring to combine, and keep warm, covered.",
        "Blend whole eggs, whites, milk, Parmigiano-Reggiano, and remaining 1/2 teaspoon salt in a blender until smooth and frothy.",
        "Pour egg mixture into baking pan and bake until firm, about 10 minutes. Remove from oven and leave oven on.",
        "Sprinkle egg layer evenly with half of Gruyère, then spoon spinach filling evenly on top and sprinkle with remaining Gruyère. Bake just until cheese melts, about 5 minutes.",
        "Position pan on a work surface with a long side nearest you, then gently roll up egg layer toward you, using parchment as an aid and holding filling in place with your fingers.",
        "Cool roll in pan on rack 10 minutes, then transfer to a platter using 2 large spatulas. Trim ends and gently cut into 8 slices with a serrated knife."
    ],
    "ingredients": [
        "1 tablespoon olive oil plus additional for brushing baking pan and parchment paper",
        "1/2 lb turkey sausage, casings discarded (if necessary) and sausage coarsely crumbled",
        "2 large garlic cloves, chopped",
        "4 scallions, chopped",
        "1/2 lb fresh shiitake mushrooms, stems discarded and caps chopped",
        "1/2 lb fresh cremini mushrooms, trimmed and chopped",
        "1/4 teaspoon black pepper",
        "3/4 teaspoon salt",
        "1 (10-oz) package frozen chopped spinach, thawed and squeezed dry",
        "1/4 cup water",
        "2 large whole eggs",
        "4 large egg whites",
        "2 tablespoons fat-free (skim) milk",
        "1 oz finely grated Parmigiano-Reggiano (about 1/3 cup)",
        "3 oz Gruyère, coarsely grated (1 cup)",
        "Special equipment: a 19- by 13-inch sheet of parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "turkey",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Sausage",
        "Spinach",
        "Gourmet"
    ],
    "title": "Egg Roulade Stuffed with Turkey Sausage, Mushrooms, and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/egg-roulade-stuffed-with-turkey-sausage-mushrooms-and-spinach-231999"
}
