{
    "directions": [
        "Cook bacon in a large skillet over medium heat, turning halfway through, until browned and crisp, 8–10 minutes.",
        "Meanwhile, use cutter to punch out a circle in the center of each piece of bread (save for snacking, now or later).",
        "Transfer bacon to a cutting board; cut in half crosswise. Carefully pour half of bacon drippings into a small bowl. Place 2 slices of bread in skillet and cook over medium-high until bottom sides are golden brown, about 3 minutes.",
        "Crack an egg into each hole in bread (some of the white may pool on top of the bread). Season eggs with salt and pepper and cook until underside is set, about 2 minutes. Using a thin spatula (a fish spatula works best), carefully turn both pieces of bread to briefly cook second side (this helps set the whites, but the yolk should still be runny), about 1 minute. Add 1 Tbsp. butter to skillet and swirl skillet to distribute, encouraging some to get underneath. Carefully turn bread again. Top one slice with half of the cheese. Remove pan from heat and let sit about 1 minute to soften cheese. Top with half of bacon and some hot sauce. Close up sandwich and transfer to a plate. Repeat process with remaining bacon drippings, bread, eggs, butter, bacon, and cheese and more hot sauce to make another sandwich."
    ],
    "ingredients": [
        "4 slices thick-cut bacon",
        "4 (3/4\"-thick) slices sourdough or other country-style bread",
        "4 large eggs",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons unsalted butter, divided",
        "4 slices cheddar",
        "Hot sauce",
        "1 1/4\"-diameter cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Egg",
        "Bacon",
        "Breakfast",
        "Cheddar",
        "Kid-Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Egg-in-a-Hole Sandwich with Bacon and Cheddar",
    "url": "http://www.epicurious.com/recipes/food/views/egg-in-a-hole-sandwich-with-bacon-and-cheddar"
}
