{
    "directions": [
        "Grind coriander and cumin seeds in spice mill or with mortar and pestle to a powder.",
        "Heat 1 Tbsp. oil in a large skillet over medium-high. Add onion and cook, stirring frequently, until soft and beginning to brown, about 5 minutes. Add ginger and garlic and cook, stirring, until fragrant, about 1 minute. Add coriander, cumin, turmeric, and cayenne and cook until mixture starts to stick to bottom of skillet, about 1 minute. Add potatoes and remaining 1 Tbsp. oil and toss to coat. Add 1/2 cup water and scrape up any bits in bottom of skillet. Stir in tomatoes and their juices and salt. Bring to a simmer, breaking up tomatoes with a wooden spoon. Cover and cook, adding more water by the tablespoonful if necessary, until potatoes are tender, 20–25 minutes.",
        "Stir to combine (it’s okay, and kind of preferred, if some of the potatoes get a little smashed here). Add eggs, turn to coat in sauce, and simmer until warmed through, about 5 minutes. Divide curry among bowls and top with cilantro and yogurt. Serve with rice or naan."
    ],
    "ingredients": [
        "1 tablespoon coriander seeds",
        "2 teaspoons cumin seeds",
        "2 tablespoons vegetable oil, divided",
        "1 onion, finely chopped",
        "1 (1-inch) piece ginger, peeled, finely chopped",
        "4 garlic cloves, finely chopped",
        "1/2 teaspoon ground turmeric",
        "1/4 teaspoon cayenne pepper",
        "2 medium russet potatoes (about 1 pound), cut into 1-inch chunks",
        "1 (14.5-ounce) can cherry or diced tomatoes",
        "1 1/2 teaspoons kosher salt",
        "8 hard-boiled eggs, peeled",
        "Cilantro leaves with tender stems (for serving)",
        "1/4 cup plain yogurt",
        "Steamed basmati rice or naan (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Curry",
        "Egg",
        "Rice",
        "Dinner",
        "Ginger",
        "Tomato",
        "Coriander",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Egg Curry with Tomatoes and Cilantro",
    "url": "http://www.epicurious.com/recipes/food/views/egg-curry-with-tomatoes-and-cilantro"
}
