{
    "directions": [
        "Combine egg yolk, mustard, and a pinch salt in a medium bowl. Anchor bowl by setting it inside a towel-lined saucepan, which will afford you 2 free hands—1 for pouring and 1 for whisking. Whisk until very smooth.",
        "Combine olive and vegetable oils in a measuring glass and pour into yolk mixture, drop by drop at first, then in a slow steady stream as mixture stiffens, until all the oil has been added. Whisk in vinegar and hot sauce; season with salt and pepper. Thin mayo with water if needed, adding a teaspoonful at a time until just loose enough to fall off a spoon.",
        "Gently lower eggs into a large saucepan of boiling salted water, and cook, maintaining an active simmer, 9 minutes. Immediately transfer eggs with a slotted spoon to a bowl of ice water and stir until cool enough to handle, about 1 minute. Drain, pat dry, and peel eggs. Tear eggs into large pieces and add to mayonnaise. Gently fold just to coat; season with salt and pepper. Spoon over bread.",
        "Toss scallions, basil, dill, chives, and lemon zest in a small bowl. Add lemon juice, drizzle with oil, and season with salt. Toss to coat. Pile herbs on top of egg."
    ],
    "ingredients": [
        "1 large egg yolk",
        "2 teaspoons Dijon mustard",
        "Kosher salt",
        "1/4 cup olive oil",
        "1/4 cup vegetable oil",
        "4 teaspoons apple cider vinegar",
        "1/2 teaspoon hot sauce",
        "Freshly ground black pepper",
        "8 large eggs",
        "Kosher salt, freshly ground pepper",
        "4 pieces focaccia or slices country-style bread, toasted",
        "2 scallions, very thinly sliced",
        "1/4 cup torn basil leaves",
        "1/4 cup torn dill fronds",
        "2 tablespoons 1/2-inch pieces chives",
        "1/2 teaspoon finely grated lemon zest",
        "1 teaspoon fresh lemon juice",
        "Olive oil (for drizzling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Egg",
        "Vegetarian",
        "Lunch",
        "Dill",
        "Mayonnaise",
        "Lemon",
        "Basil",
        "Graduation"
    ],
    "title": "Egg Salad Tartines With Mixed Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/egg-salad-tartines-with-mixed-herbs"
}
