{
    "directions": [
        "Heat 2 tablespoons extra-virgin olive oil in large skillet over medium-high heat. Add garlic; stir 30 seconds. Add prosciutto strips; cook until slightly crisp. Remove from heat. Set aside.",
        "Heat 1 teaspoon oil in each of 2 nonstick skillets over medium heat. Crack 4 eggs into each skillet. Cook on 1 side until eggs begin to set, about 2 minutes. Remove from heat. Cover; set aside.",
        "Cook soba noodles in large pot of boiling salted water 5 minutes, stirring occasionally. Add sliced asparagus to pot; cook until noodles are cooked through and asparagus is just tender, 2 to 3 minutes. Drain noodles and asparagus, reserving 1 cup cooking liquid.",
        "Add drained noodles and asparagus to prosciutto mixture in skillet. Cook over medium heat until heated through, tossing and adding reserved cooking liquid by 1/4 cupfuls to moisten.",
        "Remove skillet from heat. Add grated Parmesan cheese and remaining 1 tablespoon plus 1 teaspoon olive oil and toss to coat. Divide among 8 plates. Top each serving with 1 egg and cheese shavings. Serve immediately."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil, divided",
        "5 garlic cloves, coarsely chopped",
        "1 3-ounce package thinly sliced prosciutto, cut crosswise into strips",
        "8 large eggs",
        "1 9.5-ounce package thin soba noodles",
        "1 pound asparagus, ends trimmed, cut on sharp diagonal into 1/8-inch-thick slices",
        "1 cup freshly grated Parmesan cheese plus additional cheese shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Sauté",
        "Low Cal",
        "Dinner",
        "Meat",
        "Ham",
        "Asparagus",
        "Spring",
        "Prosciutto",
        "Noodle",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Egg-Topped Soba Noodles with Asparagus and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/egg-topped-soba-noodles-with-asparagus-and-prosciutto-357234"
}
