{
    "directions": [
        "Preheat oven to 200° F.",
        "Discard coarse stems from spinach. Wash leaves well and drain in a colander. In a large heavy kettle steam spinach with water clinging to leaves, covered, over moderate heat, stirring occasionally, until wilted, about 3 minutes. Drain spinach in colander, pressing out as much liquid as possible with back of a large spoon. Return spinach to kettle and cook in butter with salt and pepper to taste, uncovered, over moderate heat, stirring, 30 seconds.",
        "Brush a 12-inch non-stick skillet lightly with oil and heat over moderately high heat until hot but not smoking. Remove skillet from heat. Working quickly, stir batter and fill a 1/4-cup measure. Pour batter into skillet, tilting and rotating skillet quickly to cover bottom. Cook crêpe over moderately high heat until bottom is golden and top appears almost dry, about 1 minute. Turn crêpe over and put one-fourth spinach in center. Fold in edge of crêpe to form a square, leaving spinach in center exposed, and cook crêpe 30 seconds, or until bottom is golden. Slide crêpe onto a large baking sheet.",
        "Keep crêpe warm in oven while making 3 more crêpes with remaining batter and spinach in same manner.",
        "Brush skillet lightly with oil and heat over moderate heat until hot but not smoking. Break eggs, 1 at a time, into skillet and cook until whites are set, about 2 minutes. Top each crêpe with an egg and 1 tablespoon crème fraîche or sour cream."
    ],
    "ingredients": [
        "3 bunches fresh spinach (about 3 pounds)",
        "1 tablespoon unsalted butter",
        "vegetable oil for brushing skillet",
        "buckwheat crêpe batter , half reserved for another use",
        "4 large eggs",
        "4 tablespoons crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Breakfast",
        "Brunch",
        "Steam",
        "Vegetarian",
        "Spinach",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Egg and Spinach Buckwheat Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/egg-and-spinach-buckwheat-crepes-14193"
}
