{
    "directions": [
        "Cut away and discard the stem from the center of each kale leaf. Coarsely chop the kale into 1-inch pieces. It will look like you have a lot of kale but it will cook down considerably.",
        "Heat the oil in a large nonstick skillet over medium heat. Add the tomatoes, shallot, garlic, thyme, and red pepper flakes, if using. Sauté until the tomatoes and shallot soften, about 4 minutes. Add the kale and sprinkle with the salt and pepper. Toss with 2 wooden spoons until the kale wilts but is still bright green, about 2 minutes. Stir in the basil. Remove from the heat.",
        "Fill a wide saucepan with enough water to measure 2 inches deep. Bring the water to a rolling boil over high heat. Break each egg into a separate tea cup. Turn off the heat under the saucepan. Immediately slide each egg from its cup into a different part of the water (the whites will spread out). Let the eggs stand until the whites are set and the yolks are still very soft to the touch, 3 to 4 minutes.",
        "Meanwhile, using tongs, toast each tortilla directly over high heat until beginning to blacken in spots, about 15 seconds per side. Put the warm tortillas on plates. Spoon 1 tablespoon of hummus on each tortilla and spread to cover, leaving a 1-inch border. Divide the kale mixture over the hummus.",
        "Using a slotted spoon, lift each egg from the water, wiping excess liquid from the bottom of the spoon with paper towels. Put the eggs on top of the kale. Slit the yolks and press on the eggs a bit so the yolks begin to run (this will make them easier to eat). Fold up the bottom of each tortilla and then fold in the sides, leaving the wraps open at the top. Serve."
    ],
    "ingredients": [
        "5 large kale leaves",
        "2 tablespoons extra-virgin olive oil",
        "1 1/4 cups grape tomatoes, halved",
        "1 large shallot, chopped",
        "2 garlic cloves, chopped",
        "1 teaspoon chopped fresh thyme",
        "1/8 teaspoon crushed red pepper flakes (optional)",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup chopped fresh basil leaves",
        "4 large eggs, at room temperature",
        "4 (10-inch) whole-wheat tortillas",
        "1/4 cup store-bought plain hummus"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Vegetarian",
        "Kid-Friendly",
        "Kale",
        "Healthy",
        "Tortillas",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Egg, Kale, and Tomato Breakfast Wraps with Hummus",
    "url": "http://www.epicurious.com/recipes/food/views/egg-kale-and-tomato-breakfast-wraps-with-hummus-51213010"
}
