{
    "directions": [
        "Put 2 cups of the milk, both citrus zests, and the vanilla bean and tar in a medium saucepan. Bring to a simmer over medium heat. Meanwhile, whisk the egg yolks and the 1/2 cup sugar in a medium bowl until lightened in color.",
        "Gradually pour the hot milk into the eggs while whisking constantly. Return the egg mixture to the pan and set over medium heat. Stir constantly with a wooden spoon in a figure 8 motion until the custard thickens slightly and coats the back of the spoon, about 2 to 3 minutes. Remove from heat and immediately stir in the remaining cup milk to stop the cooking. Transfer custard to a large bowl; cool to room temperature. (To speed this up, set bowl in another bowl of ice.)",
        "Put about 1 inch of water in a saucepan and bring to a simmer over medium heat. Put the egg whites and remaining 2 tablespoons sugar in a heatproof bowl large enough to rest in the saucepan without touching the water. Set the bowl over the simmering water and beat until the sugar dissolves and the egg whites feel warm to the touch, about 1 minute. Remove from the heat and beat the whites with an electric mixer until they hold a soft peak, about 3 minutes. Fold the egg whites into custard mixture. Add the rum and bourbon, cover, and refrigerate until ready to serve.",
        "Transfer eggnog to a punch bowl or pitcher. Pour into small cups and garnish with freshly grated nutmeg and citrus zest. Drink."
    ],
    "ingredients": [
        "3 cups milk",
        "1 large strip orange zest",
        "2 large strips lemon zest",
        "1 vanilla bean, split and vanilla seeds scraped loose",
        "4 large egg yolks",
        "1/2 cup sugar, plus 2 tablespoons",
        "2 egg whites",
        "2/3 cup white rum",
        "2 to 3 tablespoons bourbon, optional",
        "Freshly grated nutmeg",
        "Finely grated orange and/or lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Eggnog",
        "Holiday",
        "Christmas",
        "Sugar",
        "Dairy Recipes",
        "Egg Recipes",
        "Drinks",
        "New Year's"
    ],
    "title": "Eggnog",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/eggnog-recipe"
}
