{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C). Grease and flour two 8-inch round cake pans.",
        "For the Cake: In a large mixing bowl, beat together the cake mix, eggs, 2 cups eggnog, melted butter, nutmeg, and 1/2 tsp rum flavored extract. Divide the batter evenly between the two prepared cake pans.",
        "Bake the cake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes. Remove from the oven to cool on wire racks.",
        "For the Filling: Mix together the vanilla pudding mix, 2 cups eggnog, and 1/2 teaspoon rum flavored extract in a medium bowl. Cover with plastic wrap and refrigerate until firm, about 30 minutes.",
        "For the Whipped Topping: In a small bowl, sprinkle gelatin over the cold water, allow to stand for 5 minutes to soften and then stir until the gelatin is fully dissolved. Whip the heavy cream in a large mixing bowl to soft peaks. Add the sugar, gelatin, and 1/2 teaspoon rum flavored extract, and continue whipping to stiff peaks. Refrigerate until ready to use.",
        "To Build the Cake: Remove the cakes from the cake pans. Place one round onto a serving plate. Spoon the filling onto the cake round, and spread over the cake evenly. Place the second cake round on top of the filling. Cover the top and sides of the layered cake with the whipped topping. Refrigerate until ready to serve."
    ],
    "ingredients": [
        "Cake:",
        "1 (18.5 ounce) package yellow cake mix",
        "2 eggs",
        "2 cups eggnog",
        "1/4 cup melted butter",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon rum flavored extract",
        "Filling:",
        "1 (3.4 ounce) package instant vanilla pudding mix",
        "2 cups eggnog",
        "1/2 teaspoon rum flavored extract",
        "Topping:",
        "1 tablespoon unflavored gelatin",
        "2 tablespoons cold water",
        "2 cups heavy cream",
        "1 1/4 cups sugar",
        "1 pinch salt",
        "1/2 teaspoon rum flavored extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggnog Cake",
    "url": "http://allrecipes.com/recipe/80689/eggnog-cake/"
}
