{
    "directions": [
        "Preheat oven to 325°F. Place six 3/4 cup custard cups or soufflé dishes in 13x9x2-inch baking pan. Bring half and half to simmer in heavy small saucepan. Remove from heat. Whisk yolks, sugar, vanilla and salt in medium bowl to blend. Gradually whisk hot half and half into yolk mixture. Whisk in bourbon. Divide mixture equally among custard cups. Pour enough hot water into baking pan to come halfway up sides of custard cups. Bake custard until knife inserted near center comes out clean, about 40 minutes. Remove custards from water. Cool on rack. Cover and refrigerate overnight.",
        "Line 2 baking sheets with aluminum foil. Lightly oil foil. Place 1 cranberry on the point of each toothpick. Combine sugar, light corn syrup and 1/4 cup water in heavy medium saucepan. Stir over low heat until sugar dissolves. Attach clip-on candy thermometer to saucepan. Increase heat to medium-high and boil without stirring until syrup is deep amber and thermometer registers 325°F, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 15 minutes. Carefully pour 2/3 of syrup onto 1 prepared baking sheet, tilting sheet to spread caramel thinly; set baking sheet aside.",
        "Working quickly, tilt saucepan and carefully dip 1 cranberry into remaining hot syrup to coat lightly. Place candy-coated cranberry on second prepared baking sheet. Repeat with remaining cranberries. Allow caramel on baking sheet to cool and harden. Break caramel candy into 1- to 2-inch pieces. (Caramel candy and berries can be made 6 hours ahead. Let stand at room temperature.)",
        "Sprinkle custards with nutmeg. Stand a few candy pieces upright in custards. Remove cranberries from toothpicks; place 3 berries atop each custard."
    ],
    "ingredients": [
        "2 cups half and half",
        "5 large egg yolks",
        "6 tablespoons sugar",
        "1 1/4 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "1/4 cup bourbon",
        "18 fresh cranberries",
        "18 toothpicks",
        "1 cup sugar",
        "1/2 cup light corn syrup",
        "1/4 cup water",
        "Ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Cranberry",
        "Winter",
        "Chill",
        "Christmas Eve"
    ],
    "title": "Eggnog Cremes",
    "url": "http://www.epicurious.com/recipes/food/views/eggnog-cremes-930"
}
