{
    "directions": [
        "Sprinkle gelatin over 1/4 cup dark rum to soften for about 10 minutes.",
        "Beat egg yolks and sugar with an electric mixer until the egg mixture falls like ribbon off the beaters, 3 to 5 minutes. Continue mixing on medium-high speed, and pour in scalded milk in a thin stream, mixing constantly.",
        "Transfer mixture into a saucepan. Cook over medium-low heat, stirring constantly, until the custard coats a spoon, about 20 minutes. Do not allow to boil. Take the pan off the heat, and transfer to a bowl. Stir in softened gelatin mixture and vanilla, stirring until gelatin is completely melted. Chill custard over a bowl of ice until room temperature. Stir occasionally; do not let the custard set up.",
        "Beat egg whites with a pinch of salt until stiff but not dry; set aside. Whip 3/4 cup heavy cream until medium-stiff peaks form. Gently fold whipped cream into the whipped egg whites. Fold in custard. Spread filling into prepared pie crust. Chill for 45 minutes in the refrigerator, or until filling is set.",
        "Combine 1 cup chilled whipping cream, confectioner's sugar, 2 to 3 tablespoons rum, nutmeg, and cinnamon. Whip until soft peaks form.  Spread over the top of the chilled pie, mounding in an attractive fashion.  Dust the top of the pie with additional nutmeg."
    ],
    "ingredients": [
        "1 (9 inch) pie crust, baked",
        "Filling:",
        "1 1/2 (.25 ounce) packages unflavored gelatin",
        "1/4 cup dark rum",
        "4 egg yolks",
        "1/3 cup white sugar",
        "1 1/3 cups scalded milk",
        "1 1/2 teaspoons vanilla extract",
        "1 pinch salt",
        "4 egg whites",
        "3/4 cup heavy cream, chilled",
        "Topping:",
        "1 cup heavy cream, chilled",
        "3 tablespoons confectioners' sugar",
        "2 tablespoons rum, or to taste (optional)",
        "1/8 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 pinch ground nutmeg, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggnog Pie with Rum",
    "url": "http://allrecipes.com/recipe/12472/eggnog-pie-with-rum/"
}
