{
    "directions": [
        "Line a plate with a paper towel; place a layer of 2 or 3 slices of eggplant onto the towel. Sprinkle eggplant with sea salt. Repeat layers of eggplant sprinkled with salt until all eggplant slices are stacked. Place 2 paper towels onto the stack and place a plate on top of the towels. Lay a heavy book or can of food onto the plate to squeeze out moisture. Allow to drip for 20 minutes to 2 hours. Rinse and pat dry.",
        "Beat eggs with milk in a shallow bowl. Place bread crumbs into a separate bowl. Dip eggplant slices in the egg mixture and gently press into the crumbs to coat; set aside.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.",
        "Heat olive oil in a large skillet over medium-high heat; fry eggplant slices in the hot oil in small batches until golden brown, about 1 to 2 minutes per side. Drain on paper towels.",
        "Pour about 1/4 cup of marinara sauce into the bottom of the prepared baking dish and arrange a layer of eggplant slices to cover the sauce. Scatter basil and a few slices of smoked mozzarella cheese over eggplant; repeat layers, ending with a layer of sauce on top. Sprinkle Parmesan cheese over the top.",
        "Bake in the preheated oven until heated through and the cheese has melted, about 15 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 large unpeeled purple eggplant, trimmed and cut into 1/8-inch thick slices",
        "1 teaspoon fine sea salt, or as needed",
        "2 eggs",
        "1 tablespoon whole milk",
        "1 cup Italian-seasoned bread crumbs, or more as needed",
        "3/4 cup extra-virgin olive oil, or as needed",
        "1 (24 ounce) jar prepared marinara sauce (such as De Cecco®)",
        "1 bunch fresh basil, coarsely chopped",
        "1 (8 ounce) package smoked mozzarella cheese, very thinly sliced",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggplant Parmesan with Fresh Basil and Smoked Mozzarella",
    "url": "http://allrecipes.com/recipe/223361/eggplant-parmesan-with-fresh-basil-an/"
}
