{
    "directions": [
        "Brush panini press, panini pan, or grill rack with oil; heat press, pan, or barbecue (medium-high heat). Brush eggplant rounds and pepper strips with oil; sprinkle with salt and pepper. Working in batches, grill eggplant until tender, turning occasionally, about 6 minutes. Working in batches, grill bell peppers until tender, turning occasionally and flattening with back of spatula for even cooking, about 6 minutes. Place 8 eggplant rounds and 8 bell pepper strips on rimmed baking sheet. Place remaining eggplant and peppers on work surface and slice thinly; reserve for salad.",
        "Place 4 bread slices on work surface. Divide half of Fontina cheese among bread slices; top each with 2 eggplant rounds, 2 tablespoons Parmesan cheese, 1 tablespoon basil, and 1 teaspoon oregano. Top each with 2 bell pepper strips. Arrange remaining Fontina cheese atop peppers, then top with remaining bread slices, pressing to compact. DO AHEAD: Can be made 2 hours ahead. Cover with plastic and let stand at room temperature.",
        "Heat panini press, panini pan, or barbecue (medium-high heat). Brush press or pan with oil (if using barbecue, lightly brush bread slices with oil). Place sandwiches in press or pan or on grill; cover and cook until bread is golden and cheese is melted, about 5 minutes per side.",
        "Meanwhile, whisk 2 tablespoons extra-virgin olive oil and vinegar in large bowl; season to taste with salt and pepper. Add spinach, thinly sliced eggplant, and thinly sliced peppers; toss to coat. Season salad to taste with salt and pepper.",
        "Cut sandwiches in half. Serve with spinach salad."
    ],
    "ingredients": [
        "Olive oil (for brushing)",
        "1 14- to 16-ounce eggplant, cut crosswise into 1/2-inch-thick rounds",
        "2 large red bell peppers, cut lengthwise into 1 1/2- to 2-inch-wide strips",
        "8 1/2-inch-thick slices olive bread or country white bread",
        "8 ounces Fontina cheese, thinly sliced",
        "8 tablespoons grated Parmesan cheese",
        "4 tablespoons chopped fresh basil",
        "4 teaspoons chopped fresh oregano",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon balsamic vinegar",
        "1 5-ounce package baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Dairy",
        "Pepper",
        "Vegetable",
        "Fourth of July",
        "Picnic",
        "Vegetarian",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Eggplant",
        "Spinach",
        "Bell Pepper",
        "Family Reunion",
        "Poker/Game Night",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Fontina",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Eggplant, Red Pepper, and Fontina Panini with Spinach Salad",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-red-pepper-and-fontina-panini-with-spinach-salad-354309"
}
