{
    "directions": [
        "Sprinkle eggplant with 1 1/2 teaspoons salt in a colander and let drain in sink, turning slices occasionally, 30 minutes.",
        "Finely chop together basil, mint, and garlic. Toss with tomatoes in a bowl, then drain in a sieve set over bowl.",
        "Preheat broiler.",
        "Rinse eggplant, then pat dry in batches between paper towels, pressing firmly to remove excess liquid. Brush both sides of slices with oil (about 4 tablespoons total) and form small stacks, then cut stacks into quarters. Arrange eggplant pieces in 1 layer in 2 shallow heavy baking pans and broil, 1 pan at a time, about 5 to 6 inches from heat, turning eggplant over once, until golden brown, 7 to 8 minutes per batch. Cool eggplant to room temperature.",
        "Put pizza stone in lower third of oven and preheat oven to 500°F (allow 1 hour for pizza stone to heat).",
        "Do not punch down dough. Gently dredge 1 piece of dough in flour to coat, then transfer to a sheet of parchment paper set on baking peel or baking sheet. Holding 1 edge of floured dough in the air with both hands and letting bottom touch parchment, carefully move hands around edge of dough (like turning a steering wheel), allowing weight of dough to stretch it to a round roughly 10 inches in diameter. Lay round on parchment and adjust shape as needed.",
        "Discard any liquid exuded from tomatoes and toss tomatoes with remaining tablespoon oil and remaining 1/4 teaspoon salt in bowl. Brush dough round with oil and scatter half of eggplant, half of tomatoes, and half of cheese over it, leaving a 1-inch border around edge. Line up far edge of peel with far edge of pizza stone and tilt peel down, jerking it gently to start pizza moving. Slide pizza, along with parchment, onto stone and bake until crust is golden brown and cheese is bubbling, 12 to 15 minutes. Remove pizza from oven by sliding peel under paper. Transfer pizza to a cutting board and discard parchment.",
        "While first pizza is baking, assemble second pizza on another sheet of parchment, then bake in same manner."
    ],
    "ingredients": [
        "1 (1 1/2-pound) eggplant, cut crosswise into 1/4-inch-thick slices",
        "1 3/4 teaspoons salt",
        "3/4 cup packed fresh basil leaves",
        "1/4 cup packed fresh mint leaves",
        "2 garlic cloves",
        "10 ounces grape tomatoes (2 cups), quartered",
        "5 tablespoons extra-virgin olive oil plus additional for brushing dough",
        "Pizza dough",
        "Flour for dredging",
        "1/4 pound Italian Fontina, rind discarded and cheese cut into 1/4-inch dice (1 cup)",
        "Special equipment: a pizza stone; parchment paper; a baking peel or rimless baking sheet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Mint",
        "Basil",
        "Eggplant",
        "Fontina",
        "Gourmet"
    ],
    "title": "Eggplant, Tomato, and Fontina Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-tomato-and-fontina-pizza-230755"
}
