{
    "directions": [
        "Beat eggs with water in a shallow bowl. Place bread crumbs into a separate shallow bowl.",
        "Dip an eggplant slice into beaten eggs on both sides and gently press into crumbs to coat. Set aside on a plate. Repeat with remaining eggplant and zucchini slices. Let coated vegetables rest about 5 minutes to set the coating.",
        "Pour canola oil into a large skillet, filling pan to at least 2 inches deep with oil. Heat oil on medium-high heat until oil is almost smoking, about 10 minutes.",
        "Fry 5 to 7 slices of eggplant and zucchini per batch in the hot oil until golden brown, 3 to 5 minutes per side. Drain on a plate lined with paper towels. Repeat frying remaining coated vegetables.",
        "Pour about 1/2 cup spaghetti sauce into the crock of a slow cooker. Lay slices of eggplant and zucchini over sauce; top with about 1/4 cup mozzarella cheese and 1/4 cup Parmesan-Romano cheese blend over vegetables. Repeat layers of sauce, eggplant and zucchini slices, and cheese. When all slices of eggplant and zucchini have been layered, top with any remaining sauce. Sprinkle with Parmesan cheese.",
        "Cook on Low until sauce is bubbling, 6 to 8 hours. Let cool 10 to 15 minutes before serving."
    ],
    "ingredients": [
        "2 eggs",
        "1 tablespoon water",
        "2 cups Italian-seasoned bread crumbs",
        "1 large eggplant, sliced into 3/4-inch-thick rounds",
        "1 large zucchini, sliced into 3/4-inch-thick rounds",
        "1 quart canola oil for frying, or as needed",
        "2 (14 ounce) jars spaghetti sauce",
        "1 (8 ounce) package shredded mozzarella cheese",
        "1 (8 ounce) package shredded Parmesan-Romano cheese blend",
        "1 tablespoon grated Parmesan cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggplant and Zucchini Parmesan In the Slow Cooker",
    "url": "http://allrecipes.com/recipe/232221/eggplant-and-zucchini-parmesan-in-the/"
}
