{
    "directions": [
        "Heat 1/4 cup oil in a medium saucepan over medium-high heat. Add onion and cook, stirring occasionally, until beginning to brown, 6–8 minutes. Add chopped garlic and cook, stirring, until fragrant, about 1 minute. Add tomato paste and cook, stirring, until beginning to darken, about 2 minutes. Add tomatoes, crushing them with your hands as you add them; season with salt and pepper. Bring to a boil, reduce heat, and simmer, partially covered, mashing tomatoes occasionally, until slightly thickened, 15–20 minutes. Set tomato sauce aside.",
        "Preheat oven to 400°F. Using a vegetable peeler, remove skin from rounded side of each eggplant half, leaving a 1\" strip of skin around the cut edges. Divide eggplants, oregano sprigs, whole garlic cloves, and 1/2 cup oil between 2 large rimmed baking sheets. Turn eggplants to coat with oil; season with salt and pepper and place cut side down. Cover baking sheets tightly with foil and bake until eggplants are very soft, 40–45 minutes.",
        "Toss breadcrumbs and remaining 2 tablespoons oil in a medium bowl. Transfer eggplants, oregano, and garlic to 2 large shallow baking dishes, placing eggplants cut side up. Top eggplants with tomato sauce and mozzarella, then sprinkle with breadcrumbs and Parmesan. Bake until mozzarella is bubbling and breadcrumbs are golden, 25–30 minutes.",
        "DO AHEAD: Tomato sauce can be made 3 days ahead. Let cool; cover and chill. Eggplants can be cooked 1 day ahead. Keep covered; chill. Entire dish can be assembled 4 hours ahead. Cover and chill."
    ],
    "ingredients": [
        "3/4 cup plus 2 tablespoons olive oil, divided",
        "1 medium onion, finely chopped",
        "10 garlic cloves, 2 finely chopped, 8 whole",
        "2 tablespoons tomato paste",
        "1 28-ounce can whole peeled tomatoes",
        "Kosher salt, freshly ground pepper",
        "4 medium or 8 small eggplants (about 4 pounds), halved lengthwise",
        "8 sprigs oregano",
        "1 1/4 cups coarse fresh breadcrumbs",
        "12 ounces fresh mozzarella, torn into bite-size pieces",
        "3 ounces Parmesan, finely grated (about 3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Mozzarella",
        "Parmesan",
        "Eggplant",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Eggplant Parmesan With Fresh Mozzarella",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-parmesan-with-fresh-mozzarella-51193670"
}
