{
    "directions": [
        "Preheat oven to 350°F. Place unpeeled garlic cloves in small baking dish. Drizzle garlic with olive oil and toss to coat. Roast garlic until very tender, about 25 minutes. Cool. Peel garlic and mince. Transfer to small bowl. Mix in balsamic vinegar. Gradually mix in 1/3 cup olive oil. Set dressing aside.",
        "Preheat broiler. Arrange eggplant slices in single layer on broiler pan. Brush both sides with olive oil. Sprinkle with salt and pepper. Broil until beginning to brown, about 4 minutes per side. Arrange squash slices in single layer on broiler pan. Brush tops of squash with olive oil; season with salt and pepper. Broil until tops begin to brown, about 4 minutes.",
        "Alternate eggplant and squash slices around edge of serving platter, overlapping slightly. Arrange tomato slices in center of platter. Sprinkle tomatoes with salt and pepper. Drizzle dressing over salad. (Salad can be prepared 2 hours ahead. Cover and let stand at room temperature.) Sprinkle salad with chopped fresh basil and serve."
    ],
    "ingredients": [
        "4 large garlic cloves, unpeeled",
        "Olive oil",
        "1 1/2 tablespoons balsamic vinegar or red wine vinegar",
        "1/3 cup olive oil",
        "3 large Japanese eggplants, cut crosswise into 1/2-inch-thick rounds",
        "3 large yellow summer squash or zucchini, cut crosswise into 1/2-inch-thick rounds",
        "3 tomatoes, thinly sliced",
        "16 fresh basil leaves, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Tomato",
        "Vegetable",
        "Broil",
        "Roast",
        "Vegetarian",
        "Low Cal",
        "Basil",
        "Eggplant",
        "Squash",
        "Summer"
    ],
    "title": "Eggplant, Squash and Tomato with Roasted Garlic Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-squash-and-tomato-with-roasted-garlic-vinaigrette-2385"
}
