{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "Arrange sliced eggplant in a single layer on 2 sheet pans. Brush on both sides using 3 tablespoons of oil and season with salt and pepper. Roast the eggplant until it is soft and golden. Turn slices halfway through, about 25 minutes.",
        "Meanwhile, in a medium skillet add the remaining 2 tablespoons of oil and the sliced mushrooms. Saute until soft for about 7 minutes. Add the minced garlic and chopped thyme. Cook for another 2 minutes. Once the mushrooms are cooked remove and set aside to cool.",
        "In a large bowl add the ricotta, eggs, 1/2 cup Parmesan, oregano, mushrooms, 2 teaspoons of salt and 1/4 teaspoon pepper. Mix well. Brush an 8-inch baking dish with oil.",
        "Spread half of the marinara sauce on the bottom of the prepared baking dish. Lay 4 slices on top followed by the ricotta mixture. Lay another 4 slices of eggplant and finish with marinara sauce. Top with the remaining 1/2 cup Parmesan. Bake until golden brown, at 350 degrees, for 30 minutes.",
        "Preheat the oven to 400 degrees F.",
        "Peel 5 cloves garlic and place them in a square of foil. Sprinkle the cloves with salt and pepper and drizzle with 2 tablespoons olive oil. Wrap up the foil and place it directly on the oven rack. (Be sure that the foil packet is secure so no oil will leak out.) Roast the garlic until it's brown and tender, about 25 minutes. Allow to cool enough to touch and squeeze the garlic from the skins. Set aside.",
        "Saute onions and carrots with the oil in a medium saucepan. Add tomato paste and stir well. This will cook off the tomato paste and give a nice orangy color. Cook for about 10 minutes. When vegetables are softened add the roasted garlic, salt, pepper, basil, oregano and stir together until incorporated. Pour in the tomatoes. Fill the empty can with water and add it to the pan. Bring to a boil then lower the heat to a simmer. Simmer for 1 hour, uncovered. Stir occasionally. Once sauce is ready carefully pour it into the food processor and puree until smooth."
    ],
    "ingredients": [
        "2 large eggplants, sliced lengthwise 3/4-inch thick (8 slices)",
        "5 tablespoons olive oil, divided plus more for baking dish",
        "Coarse salt and freshly ground black pepper",
        "1 cup thinly sliced cremini mushrooms",
        "2 garlic cloves, minced",
        "1 tablespoon freshly chopped thyme leaves",
        "1 (15-ounce) container whole milk ricotta cheese",
        "3 large eggs",
        "1 cup grated Parmesan, divided",
        "2 tablespoons freshly chopped oregano leaves",
        "2 cups Nona's Marinara Sauce, recipe follows",
        "5 cloves garlic",
        "1/4 cup plus 2 teaspoons extra virgin olive oil, divided",
        "1 large onion, diced",
        "3 carrots, peeled and diced",
        "2 tablespoons tomato paste",
        "1 cup fresh basil leaves",
        "2 tablespoons freshly picked oregano leaves",
        "1 (28-ounce) can crushed tomatoes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Italian",
        "Lasagna Recipes",
        "Tomato",
        "Vegetable",
        "Mushroom",
        "Cheese",
        "Ricotta",
        "Eggplant Recipes"
    ],
    "title": "Eggplant Lasagna",
    "url": "http://www.foodnetwork.com/recipes/danny-boome/eggplant-lasagna-recipe"
}
