{
    "directions": [
        "Cover bottom and sides of each of 2 large colanders with 1 layer of eggplant slices; sprinkle generously with coarse salt. Continue layering eggplant slices in each colander, sprinkling each layer with coarse salt, until all eggplant slices are used. Place each colander over large bowl; let stand at least 30 minutes and up to 1 hour. Rinse eggplant slices to remove excess salt; dry thoroughly with paper towels.",
        "Position oven rack 5 to 6 inches from heat source and preheat broiler. Line 3 large rimmed baking sheets with parchment paper. Arrange eggplant slices in single layer on prepared baking sheets. Brush both sides of eggplant slices with olive oil. Broil 1 sheet at a time until eggplant slices are tender and beginning to brown, watching closely and removing eggplant slices as needed if cooking too quickly, 3 to 4 minutes per side. Remove baking sheet from oven and cool eggplant while preparing filling.",
        "Bring large pot of salted water to boil. Add chard to pot and boil just until tender, about 2 minutes. Drain; rinse with cold water. Squeeze chard very dry, then chop coarsely. Squeeze chard dry again between paper towels. Whisk eggs and pinch of coarse salt in medium bowl. Stir in chopped chard, ricotta cheese, 1 cup Parmesan, mint, and black pepper.",
        "Lightly oil 15 x 10 x 2-inch glass baking dish. Spread half of tomato sauce evenly over bottom of dish. Divide chard-ricotta filling among eggplant slices, placing about 1 heaping tablespoon filling in center of each. Starting at 1 short end of each, loosely roll up eggplant slices, enclosing filling. Arrange rolls, seam side down, atop sauce in baking dish. Spoon remaining tomato sauce over. Place mozzarella slices in single layer over rolls. Sprinkle with remaining 1/4 cup Parmesan cheese. DO AHEAD: Can be made 1 day ahead. Cover with foil and chill.",
        "Preheat oven to 350°F. Bake eggplant Parmesan rolls, covered with foil, until heated through, about 30 minutes if freshly made or 40 minutes if refrigerated. Uncover and bake until brown in spots and sauce is bubbling, 15 to 20 minutes. Serve hot.",
        "Available at many supermarkets and at specialty foods stores and Italian markets. Regular mozzarella can be substituted."
    ],
    "ingredients": [
        "2 medium eggplants (about 2 1/4 pounds total), trimmed, cut lengthwise into 1/4-inch-thick slices",
        "Coarse kosher salt",
        "Extra-virgin olive oil",
        "1 1-pound bunch Swiss chard, center ribs removed",
        "2 large eggs",
        "1 15-ounce container whole-milk ricotta cheese",
        "1 1/4 cups finely grated Parmesan cheese, divided",
        "2 tablespoons chopped fresh mint",
        "3/4 teaspoon freshly ground black pepper",
        "1 15- to 16-ounce can tomato sauce",
        "1 8-ounce ball fresh water-packed mozzarella,* drained, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Broil",
        "Vegetarian",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Ricotta",
        "Eggplant",
        "Family Reunion",
        "Swiss Cheese",
        "Party",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant Parmesan Rolls with Swiss Chard and Fresh Mint",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-parmesan-rolls-with-swiss-chard-and-fresh-mint-357494"
}
