{
    "directions": [
        "For the vegan meatballs: Preheat the oven to 400 degrees F.",
        "Heat a large saute pan over high heat. Add the grapeseed oil and then the eggplant, onions and garlic and saute until the eggplant and onions are tender, 8 to 10 minutes.",
        "Add the salt, pepper and chili flakes and cook for another 1 to 2 minutes. Remove the sauteed vegetables from the pan and let cool.",
        "Combine the cooled sauteed vegetables, white beans and parsley in a bowl and mix well. Transfer the mixture to a food processor and pulse until the mixture is mostly pureed with some small chunks.",
        "Grind the oats in a spice grinder until a fine flour. Mix the oat flour into the pureed mixture. The mixture should hold together in a ball, if it is too wet add more oat flour.",
        "Form the mixture into 2 1/2- to 3-ounce balls and place on a parchment-lined baking sheet. Bake until browned and hot in the center, 20 to 25 minutes.",
        "For the spaghetti squash: Cut the squash in half lengthwise and scoop out the seeds. Drizzle the flesh with the grapeseed oil and season with the salt and pepper.",
        "Place the squash halves cut-side down in a casserole dish. Add 1/2 cup water to the dish and cover with foil. Bake until the flesh is tender, 20 to 25 minutes.",
        "Remove the squash from the oven and, while it is still hot, scoop the flesh out with a fork. Season with salt and pepper and hold for plating.",
        "For the tomato sauce: Combine the whole tomatoes, onion, basil, olive oil, garlic and oregano in a large pot. Puree with an immersion blender. Add the diced tomatoes and bring the sauce to a simmer over high heat. Stir in the tomato paste, season with the salt and pepper and simmer for 15 minutes.",
        "To plate: Strain the liquid off the spaghetti squash and divide the squash among 6 plates. For each plate, place 3 vegan meatballs on top of the spaghetti squash and top with 6 ounces of tomato sauce. Garnish with the chopped parsley."
    ],
    "ingredients": [
        "1/4 cup grapeseed oil",
        "1 1/2 pound eggplant, diced",
        "1 cup diced yellow onion",
        "2 tablespoons chopped garlic",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon crushed red pepper flakes",
        "1 1/2 cups cooked white beans",
        "3 tablespoons fresh parsley, chopped",
        "2 cups old-fashioned rolled oats, plus more if necessary",
        "1 spaghetti squash",
        "2 tablespoons grapeseed oil",
        "2 teaspoons kosher salt, plus more for seasoning",
        "1 teaspoon freshly ground black pepper, plus more for seasoning",
        "One 28-ounce can whole peeled tomatoes",
        "1/2 cup diced yellow onion",
        "1/4 cup fresh basil, chopped",
        "1/4 cup extra-virgin olive oil",
        "2 cloves garlic",
        "1 tablespoon fresh oregano, chopped",
        "One 8-ounce can diced tomatoes",
        "2 tablespoons tomato paste",
        "2 teaspoons kosher salt",
        "1 teaspoon fresh ground black pepper",
        "1/4 cup fresh parsley, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatballs",
        "Spaghetti",
        "Tomato",
        "Vegetable",
        "Squash",
        "Eggplant Recipes",
        "Spaghetti Squash",
        "Beans and Legumes",
        "Main Dish Recipes"
    ],
    "title": "Eggplant and White Bean Meatballs with Spaghetti Squash",
    "url": "http://www.foodnetwork.com/recipes/robert-irvine/eggplant-and-white-bean-meatballs-with-spaghetti-squash"
}
