{
    "directions": [
        "Place eggplant slices on 2 baking sheets. Lightly salt eggplant on both sides. Let stand 1 hour. Using paper towels, pat eggplant dry, wiping off salt.",
        "Heat 1 1/2 tablespoons oil in large skillet over medium heat. Add onion and garlic, sauté until golden, about 10 minutes. Add tomatoes with their juices and thyme sprigs; bring to boil. Reduce heat and simmer until mixture is reduced to 2 1/2 cups, breaking up tomatoes with back of spoon, about 20 minutes. Season sauce with salt and pepper. Discard thyme sprigs.",
        "Preheat oven to 350°F. Add oil to 2 large skillets to depth of 1/4 inch. Heat over medium-high heat. Working in batches, add eggplant to skillets and cook until golden, adding more oil to skillets as necessary, about 5 minutes per side. Transfer to paper towels and drain. Working in batches, add potatoes to skillets, cook until golden, about 3 minutes per side. Transfer potatoes to paper towels. Add green peppers to same skillet; sauté until almost tender, about 5 minutes. Transfer to paper towels.",
        "Layer half of eggplant in 15x10x2-inch glass baking dish. Sprinkle with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with half of potatoes. Season with salt and pepper. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Place all pepper slices over. Season with salt and pepper. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with remaining eggplant. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with remaining potatoes. Season with salt and pepper. Top with 1 tablespoon thyme and 1/2 cup sauce.",
        "Bake uncovered until vegetables are tender, about 40 minutes. Let stand 15 minutes before serving."
    ],
    "ingredients": [
        "2 1 1/4-pound eggplants, thinly sliced crosswise",
        "1 1/2 tablespoons olive oil",
        "1 large onion, chopped",
        "5 large garlic cloves, chopped",
        "1 28-ounce can Italian-style tomatoes",
        "2 large fresh thyme sprigs",
        "olive oil (for frying)",
        "3 pounds russet potatoes, peeled, thinly sliced",
        "3 green bell peppers, cored, thinly sliced",
        "5 tablespoons minced fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Tomato",
        "Side",
        "Bake",
        "Vegetarian",
        "Casserole/Gratin",
        "Eggplant",
        "Bell Pepper",
        "Healthy",
        "Vegan",
        "Thyme"
    ],
    "title": "Eggplant, Potato and Pepper Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-potato-and-pepper-casserole-347"
}
