{
    "directions": [
        "Prepare barbecue (medium heat). Arrange eggplant slices on baking sheet. Brush both sides with oil and sprinkle with salt and pepper. Grill until slightly charred and tender, turning occasionally and moving to cook evenly, about 5 minutes. Transfer to foil-lined baking sheet. Grill plum tomato until skin is charred and split, turning often, about 5 minutes. Transfer to sheet with eggplant and cool. Core plum tomato; place in blender. Add chopped basil, vinegar, and 1/4 cup oil. Blend until smooth. Season with salt and pepper. Transfer to small bowl. DO AHEAD Eggplant and dressing can be made 2 hours ahead. Let stand at room temperature.",
        "Overlap eggplant slices, cheese slices, and heirloom tomato slices on individual plates or large platter. Sprinkle with salt and pepper. Drizzle salad with dressing and garnish with basil sprigs."
    ],
    "ingredients": [
        "1 (1-pound) globe eggplant, trimmed, cut crosswise into 1/2-inch-thick rounds",
        "Olive oil (for grilling)",
        "1 large plum tomato (about 4 ounces)",
        "1/3 cup chopped fresh basil plus sprigs for garnish",
        "1 tablespoon white wine vinegar",
        "1/4 cup olive oil",
        "2 (7- to 8-ounce) balls fresh or buffalo mozzarella cheese, drained, thinly sliced",
        "2 pounds (about 4 large) heirloom tomatoes (preferably assorted colors), thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Mozzarella",
        "Basil",
        "Eggplant",
        "Summer",
        "Grill/Barbecue",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant Caprese with Grilled Tomato and Basil Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-caprese-with-grilled-tomato-and-basil-vinaigrette-238764"
}
