{
    "directions": [
        "Pour enough oil into heavy large skillet to coat bottom; heat over medium heat. Add eggplant to skillet, arranging in single layer. Sprinkle eggplant with salt and pepper. Sauté until cooked through, but not browned, about 3 minutes per side. Transfer eggplant to sheet of foil; reserve skillet.",
        "Arrange 1 bell pepper strip atop rounded edge of each eggplant piece, trimming to fit, if necessary. Sprinkle cheese atop eggplant. do ahead Can be made 2 hours ahead. Let stand at room temperature.",
        "Arrange lettuce leaves on platter. Reheat oil in skillet over medium heat. Place eggplant, cheese side up, into skillet. Cover and cook until cheese softens and begins to melt, about 4 minutes. Place 1 eggplant piece atop each lettuce leaf. Sprinkle each with olives and oregano."
    ],
    "ingredients": [
        "Olive oil",
        "1 2 1/2- to 3-inch-diameter eggplant, cut into six 3/4-inch-thick rounds, then halved to form 12 semicircles",
        "1 long slender red bell pepper, cut into six 1/4-inch-thick rings, then halved to form 12 curved strips",
        "1/2 cup crumbled feta cheese (about 2 ounces)",
        "12 small inner leaves of butter lettuce",
        "10 large imported green Greek olives, pitted, chopped",
        "1 teaspoon finely chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Appetizer",
        "Sauté",
        "Cocktail Party",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Feta",
        "Eggplant",
        "Bell Pepper",
        "Summer",
        "Lettuce",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant with Bell Pepper, Feta, and Green Olives",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-with-bell-pepper-feta-and-green-olives-235141"
}
