{
    "directions": [
        "Heat oven to 475°. Remove pulp from eggplants; cut pulp from one eggplant into 1/4-inch cubes and discard the rest. Coat eggplant shells with cooking spray; sprinkle with 1/4 teaspoon salt. On a baking sheet lined with parchment paper, place eggplant shells open side down. In a bowl, coat eggplant cubes with cooking spray and toss with 1/4 teaspoon salt; place in one layer on a second baking sheet lined with parchment paper. Bake eggplant shells and cubes until tender, 10 minutes. Remove eggplant; reduce oven to 350°. In a medium nonstick skillet over medium heat, heat oil. Cook onion, celery and carrot until soft, 5 minutes. Add garlic; cook, 1 minute. Add lentils, eggplant cubes, broth, vinegar, pepper and remaining 1/4 teaspoon salt; reduce heat to simmer, stirring occasionally, 5 minutes. Stir in chopped mint. Flip shells on baking sheet and stuff with lentil-eggplant mixture; cover with aluminum foil and bake until warm; 10 minutes. Top with cheese and mint leaves."
    ],
    "ingredients": [
        "2 globe eggplants (1 pound each), halved lengthwise",
        "Vegetable oil cooking spray",
        "3/4 teaspoon kosher salt, divided",
        "1 tablespoon olive oil",
        "1 medium onion, finely chopped",
        "2 diced celery stalks",
        "1 large carrot, peeled and diced",
        "2 cloves garlic, finely chopped",
        "2 cups packaged steamed lentils (such as Melissa's)",
        "1/2 cup low-sodium vegetable broth",
        "2 tablespoons balsamic vinegar",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup chopped fresh mint, plus torn leaves for serving",
        "2 ounces crumbled goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Goat Cheese",
        "Eggplant",
        "Lentil",
        "Healthy",
        "Self",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant with Lentils and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-with-lentils-and-goat-cheese-51204210"
}
