{
    "directions": [
        "Prepare grill for cooking over direct heat with medium-hot charcoal (moderate heat for gas); see Grilling Procedureepi:recipelink.</epi:recipelink>",
        "While grill is heating, stir together tomatoes, parsley, 2 tablespoons oil, vinegar, pepper, and 3/4 teaspoon salt in a medium bowl.",
        "With a cheese plane or vegetable peeler, shave half of cheese into thin slices (if using mozzarella, thinly slice half of it with a knife) and cover slices with plastic wrap, reserving remaining piece for another use.",
        "Brush bread on both sides with 1 tablespoon oil per slice.",
        "Trim off top and bottom of each eggplant, then cut 2 (1-inch-thick) slices lengthwise from center of each eggplant, discarding remainder. Brush cut sides with 3 tablespoons oil (total) and sprinkle with remaining 1/2 teaspoon salt.",
        "Lightly oil grill rack, then grill eggplant slices (covered only if using a gas grill), loosening with a metal spatula and turning occasionally to avoid overbrowning, until very tender, 8 to 10 minutes. While eggplant is grilling, grill bread, turning over once, until grill marks form, 1 to 2 minutes total, and transfer to a large platter.",
        "Transfer eggplant to platter, then top evenly with sliced cheese and return to grill and cook, covered for charcoal or gas, without turning, until cheese begins to melt, about 1 minute. Transfer eggplant with spatula to platter.",
        "Transfer grilled bread to 4 plates and spoon tomato mixture on top. Drizzle evenly with remaining tablespoon oil and top with eggplant. Season with pepper to taste."
    ],
    "ingredients": [
        "1 lb tomatoes, finely chopped (2 1/2 cups)",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "1 tablespoon white-wine vinegar",
        "1/2 teaspoon black pepper",
        "3/4 teaspoons salt",
        "1 (8-oz) piece smoked cheese such as Gouda, mozzarella, or scamorza",
        "4 (3/4-inch-thick) slices country-style bread (from an 8-inch round loaf)",
        "2 (1-lb) eggplants"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Vegetable",
        "Vegetarian",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Parsley",
        "Gourmet"
    ],
    "title": "Eggplant and Smoked-Gouda Open-Faced Grilled Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-and-smoked-gouda-open-faced-grilled-sandwiches-234662"
}
