{
    "directions": [
        "1. Trim the ends from the eggplants and peel off the skin. Cut each eggplant lengthwise into four or more 1/2-inch-thick slices. (Some of the slices will be smaller than others, but all should be of equal thickness.) If needed, trim a thin slice from each of the rounded sides so the pieces will lie flat on the baking sheet. Sprinkle the slices with coarse salt and layer in a colander to drain for at least 30 minutes or for up to 2 hours. Rinse the eggplant slices under cold running water and dry well with paper towels, pressing to remove as much moisture as possible.",
        "2. Preheat the broiler and position the oven rack about 4 inches from the heat. Line a large heavy baking sheet with aluminum foil. Arrange the eggplant slices on the sheet in a single layer and brush both sides with oil. Broil for 7 to 9 minutes, turning once, until the eggplant is tender and lightly browned on both sides. Leave the broiler on.",
        "3. Meanwhile, combine the goat cheese, sun-dried tomatoes, and olives in a small bowl. Toss gently to mix. Divide the mixture evenly over the broiled eggplant slices. Sprinkle the Pecorino Romano cheese evenly over each slice and return to the oven. Broil for 1 minute, or until the goat cheese has softened and the grated cheese is just beginning to brown at the edges. Watch carefully to avoid burning. Scatter basil over the top of each slice and serve at once."
    ],
    "ingredients": [
        "2 medium-large eggplants (about 1 pound each)",
        "Coarse sea salt",
        "6 tablespoons extra-virgin olive oil",
        "1/3 cup crumbled goat cheese or sheep's milk Feta",
        "8 sun-dried tomato halves packed in olive oil, drained, and coarsely chopped",
        "12 pitted Kalamata olives, coarsely chopped",
        "1/3 cup grated Pecorino Romano cheese",
        "2 to 3 tablespoons slivered fresh basil leaves, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Herb",
        "Olive",
        "Tomato",
        "Vegetable",
        "Side",
        "Broil",
        "Vegetarian",
        "Eggplant",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant Steaks with Sun-Dried Tomatoes and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-steaks-with-sun-dried-tomatoes-and-olives-238664"
}
