{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil. Grease foil with olive oil.",
        "Arrange eggplant halves cut-sides-down onto the prepared baking sheet. Pierce skin of eggplant several times with a fork.",
        "Roast eggplant in preheated oven until soft, 30 to 40 minutes. Remove from oven and set aside to cool completely.",
        "Scoop the flesh from the eggplant halves onto a cutting board; chop into small chunks and put into a large mixing bowl.",
        "Mix ground turkey, carrot, onion, Parmesan cheese, egg, garlic, basil, parsley, oregano, sea salt, and black pepper with the eggplant chunks until ingredients are somewhat evenly mixed together. Gently mix almond flour into the eggplant mixture; scoop with an ice cream scoop onto the prepared baking sheet.",
        "Reduce oven heat to 350 degrees F (175 degrees C) and bake meatballs in oven for 15 minutes, flip the meatballs, and bake until browned and no longer pink in the center, about 10 minutes more.",
        "While the meatballs bake, heat marinara sauce in saucepan over medium-low heat until hot; add baked meatballs to the sauce and stir to coat."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/3840199.jpg",
    "ingredients": [
        "2 teaspoons olive oil, or as needed",
        "1 large eggplant, halved lengthwise",
        "1 pound ground turkey",
        "1 carrot, shredded",
        "1/2 small onion, diced",
        "1/3 cup grated Parmesan cheese (optional)",
        "1 large egg",
        "2 cloves garlic, or more to taste, minced",
        "1 teaspoon dried basil (such as Simply Organic®)",
        "1 teaspoon dried parsley (such as Simply Organic®)",
        "1 teaspoon dried oregano (such as Simply Organic®)",
        "1 teaspoon sea salt",
        "1/2 teaspoon freshly ground black pepper, or more to taste",
        "3/4 cup almond flour",
        "2 cups marinara sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggplant Meatballs",
    "url": "http://allrecipes.com/recipe/240973/eggplant-meatballs/"
}