{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Toss eggplant with salt in a colander set over a bowl and let drain 30 minutes. Rinse eggplant, then squeeze handfuls of it to extract bitter liquid. Toss eggplant with oil in a bowl, then spread in 1 layer in a large shallow baking pan. Roast, stirring once, until tender and lightly browned, about 25 minutes. Stir into meat mixture and spread in baking dish.",
        "Cook pasta in a large pot of boiling salted water until al dente, about 8 minutes, then drain.",
        "Bring milk and garlic to a simmer in a 2-quart heavy saucepan. Heat butter in a 3-quart heavy saucepan over moderate heat until foam subsides, then add flour, and cook roux, whisking, 1 minute. Add hot milk mixture in a fast stream, whisking vigorously to prevent lumps, and simmer béchamel, whisking occasionally, until thickened, 3 to 5 minutes. Discard garlic. Remove from heat and stir in feta and salt and pepper to taste, then whisk gradually into eggs in a large bowl. Stir in pasta, then spread evenly over meat mixture. Bake pastitsio until bubbling and golden brown, 30 to 35 minutes. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 (1 1/4-lb) eggplant, trimmed and cut into 1-inch pieces",
        "1 teaspoon salt",
        "2 tablespoons extra-virgin olive oil",
        "6 cups chopped braised veal shanks with sauce, reheated to warm",
        "3 cups short tubular pasta (about 10 oz) such as cellentani",
        "3 cups whole milk",
        "1 large garlic clove, smashed",
        "3 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "7 oz crumbled feta (1 1/2 cups)",
        "3 large eggs, lightly beaten",
        "Special equipment: a 3- to 3 1/2-qt (13- by 9-inch) shallow baking dish or casserole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Pasta",
        "Bake",
        "Casserole/Gratin",
        "Feta",
        "Veal",
        "Eggplant",
        "Gourmet"
    ],
    "title": "Eggplant and Veal Pastitsio",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-and-veal-pastitsio-232796"
}
