{
    "directions": [
        "Puree tomatoes in blender. Strain into heavy small saucepan. Bring to boil. Reduce heat to medium; simmer tomatoes until reduced to 3/4 cup, about 10 minutes. Add 2 tablespoons oil and simmer 5 minutes to blend flavors. Season with salt and pepper. Remove from heat.",
        "Combine 4 cups water and 1 teaspoon salt in heavy medium saucepan. Bring to boil. Gradually whisk in cornmeal. Reduce heat to medium-low and simmer until polenta is very thick, stirring frequently, about 10 minutes. Remove from heat. Add Parmesan and butter and stir until melted. Mix in cayenne pepper. Spread polenta in 9-inch-square pan. Refrigerate until cold, about 1 hour. (Sauce and polenta can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Sprinkle eggplant slices with salt. Let stand 30 minutes. Pat dry.",
        "Prepare barbecue (medium-high heat) or preheat broiler. Brush eggplant and zucchini with oil. Season with salt and pepper. Grill or broil until tender, about 2 minutes per side.",
        "Preheat oven to 375°F. Lightly oil large baking sheet. Using eggplant as template, cut polenta into 4 rounds. Place rounds on prepared baking sheet. Top each with eggplant, 2 zucchini slices, basil leaf and mozzarella slice.",
        "Bake eggplant stacks until cheese melts and begins to brown, about 15 minutes. Transfer to plates. Rewarm sauce. Spoon around eggplant stacks. Sprinkle with chopped basil and serve."
    ],
    "ingredients": [
        "1 14 1/2-ounce can chopped seeded peeled tomatoes with juices",
        "2 tablespoons olive oil",
        "4 cups water",
        "1 teaspoon salt",
        "1 cup cornmeal",
        "1 cup (packed) freshly grated Parmesan cheese (about 3 ounces)",
        "1/4 cup (1/2 stick) butter",
        "Pinch of cayenne pepper",
        "1/2 large eggplant, cut crosswise into four 1/2-inch-thick slices",
        "Coarse salt",
        "1 large zucchini, cut diagonally into 1/4-inch-thick slices",
        "Additional olive oil",
        "4 large fresh basil leaves",
        "4 1/4-inch-thick slices mozzarella cheese",
        "3 tablespoons chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Mozzarella",
        "Basil",
        "Cornmeal",
        "Eggplant",
        "Winter",
        "Healthy",
        "San Francisco",
        "California"
    ],
    "title": "Eggplant-Polenta Stacks with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-polenta-stacks-with-tomato-sauce-3070"
}
