{
    "directions": [
        "Heat oil in heavy large saucepan over medium-high heat. Add onion, celery, carrot, and garlic; sauté until tender, about 8 minutes. Add wine and cook 3 minutes. Add crushed tomatoes, stock, and basil; bring to boil. Reduce heat; cover and simmer 30 minutes to blend flavors. Season with salt and pepper. Cool.",
        "Place ricotta cheese in strainer set over large bowl. Let stand until excess liquid drains from cheese, about 2 hours. Transfer ricotta cheese to medium bowl. Stir in Asiago cheese, spinach, nutmeg, and cayenne. Season to taste with salt and pepper. Mix in egg.",
        "Preheat oven to 350°F. Oil 2 large baking sheets. Brush both sides of eggplant slices with olive oil; arrange on prepared sheets. Sprinkle with salt and pepper. Bake until eggplant slices are tender, about 13 minutes. Cool on sheets.",
        "Place 1 eggplant slice on work surface. Place scant 2 tablespoons ricotta mixture near narrower end of eggplant slice. Roll up, enclosing filling. Repeat with remaining eggplant slices and filling.",
        "Spread half of sauce over bottom of 13x9x2-inch glass baking dish. Arrange eggplant manicotti in single layer atop sauce. Spoon remaining sauce over. (Manicotti can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Bake manicotti until heated through, about 20 minutes. Sprinkle with Parmesan cheese and serve.",
        "Available at specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "3/4 cup chopped celery",
        "1 large carrot, peeled, chopped",
        "1/4 cup chopped garlic",
        "1/2 cup dry red wine",
        "1 28-ounce can crushed tomatoes with added puree",
        "1 cup chicken stock or canned low-salt chicken broth",
        "1 cup chopped fresh basil (from about 2 large bunches)",
        "1 pound fresh or whole-milk ricotta cheese",
        "1 cup grated Asiago cheese* (about 3 ounces)",
        "3/4 cup chopped fresh baby spinach",
        "1/2 teaspoon ground nutmeg",
        "1/8 teaspoon cayenne pepper",
        "1 large egg",
        "2 medium eggplants, unpeeled, each cut lengthwise into eight 1/3-inch-thick slices",
        "1/4 cup (about) olive oil",
        "1/4 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Tomato",
        "Bake",
        "Parmesan",
        "Ricotta",
        "Basil",
        "Eggplant",
        "Spinach",
        "Winter",
        "Illinois"
    ],
    "title": "Eggplant Manicotti with Ricotta, Asiago, and Spinach Filling",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-manicotti-with-ricotta-asiago-and-spinach-filling-105539"
}
