{
    "directions": [
        "Halve onions through root end and thinly slice. Finely chop garlic. In a large heavy skillet cook onions with salt to taste in 2 tablespoons oil, covered, over moderately low heat, stirring occasionally, until soft, about 15 minutes. Add garlic and cook mixture, uncovered, stirring occasionally, until any liquid onions give off is evaporated. Add tomatoes with juice, sage, and thyme and simmer, stirring occasionally, until excess liquid is evaporated and mixture is very thick. Season mixture with salt and pepper and cool. Preheat oven to 450°F. Brush at least 2 shallow baking pans with some remaining oil.",
        "Cut eggplants crosswise into 1/3-inch-thick rounds and arrange in one layer in baking pans. Brush eggplant slices with some remaining oil and roast in upper and lower thirds of oven, switching position of pans halfway through roasting time, until tender and golden, about 20 minutes. Cool eggplant 5 minutes and transfer with a slotted spatula to paper towels to drain.",
        "Cut zucchini lengthwise into 1/3-inch-thick slices and roast in same manner until tender and pale golden, about 25 minutes. Cool zucchini 5 minutes and transfer to paper towels to drain.",
        "Quarter bell peppers lengthwise and discard stems, seeds, and ribs. Arrange peppers, skin sides up, in oiled baking pans and brush with some remaining oil. Roast peppers in same manner until tender and lightly browned, about 20 minutes. Cool peppers 5 minutes and transfer to paper towels to drain.",
        "In a 1 1/2- to 2-quart heavy saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking, 3 minutes and whisk in milk and cream. Bring mixture to a boil, whisking, and simmer, whisking occasionally, 2 minutes. Remove pan from heat and cool sauce 5 minutes. Whisk in eggs, two thirds Parmigiano-Reggiano, and salt and pepper to taste.",
        "Preheat oven to 400°F. and lightly oil a 14- x 10- x 2 1/2-inch or other 3 1/2-quart shallow baking dish. In baking dish arrange half of eggplant, overlapping slices to form an even layer, and season with salt and pepper. Top eggplant with half of tomato mixture, spreading evenly, and pour about one third Parmigiano-Reggiano custard over it. Nestle half of zucchini in custard and season with salt and pepper. Top zucchini with half of peppers. Repeat layering, reserving half of remaining custard for topping. Pour reserved custard over final layer of peppers and sprinkle with remaining grated Parmigiano-Reggiano.",
        "Bake torte in middle of oven until custard is puffed and golden brown, about 35 minutes. Let torte stand 10 minutes before serving."
    ],
    "ingredients": [
        "2 large onions (about 1 pound)",
        "1 garlic clove",
        "about 1/2 cup olive oil",
        "a 26- to 32-ounce container chopped tomatoes",
        "1 tablespoon finely chopped fresh sage leaves",
        "1 1/2 teaspoons finely chopped fresh thyme leaves",
        "2 large eggplants (about 2 1/2 pounds total)",
        "4 large zucchini (about 1 3/4 pounds total)",
        "4 large red bell peppers",
        "2 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "1 cup milk",
        "1 cup heavy cream",
        "3 large eggs",
        "6 ounces freshly grated Parmigiano-Reggiano (about 2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetable",
        "Appetizer",
        "Bake",
        "Parmesan",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Spring",
        "Summer",
        "Gourmet"
    ],
    "title": "Eggplant, Zucchini, Red Pepper, and Parmesan Torte",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-zucchini-red-pepper-and-parmesan-torte-101664"
}
