{
    "directions": [
        "Preheat oven to 300°F. Line rimmed baking sheet with parchment paper. Mix all ingredients in large bowl. Arrange tomatoes, cut side down, on prepared baking sheet; drizzle any remaining mixture from bowl over tomatoes. Bake 1 hour; turn tomatoes over and bake until slightly dried but still tender, about 1 hour longer. Peel skin off warm tomatoes. (Can be made 2 days ahead. Cool, then cover and refrigerate.)",
        "Preheat oven to 350°F. Cut top 1/2 inch off garlic head, exposing cloves. Place garlic in small ovenproof dish; drizzle with 1 tablespoon oil. Cover tightly with foil and bake until cloves are soft, about 50 minutes. Cool. Squeeze garlic head from bottom to release garlic from skins.",
        "Cook potatoes in medium saucepan of simmering salted water until tender when pierced with fork, about 12 minutes; drain. Bring cream and butter to simmer in large saucepan. Remove from heat; whisk in sour cream. Add potatoes to cream mixture and mash. Mix roasted garlic, ground almonds, lemon juice, and minced fresh garlic into potatoes. Season with salt and pepper. (Can be made 2 hours ahead. Cover and let stand at room temperature. Rewarm before using.)",
        "Soak eggplant slices in milk in large bowl 1 hour. Drain; pat dry. Sprinkle eggplant lightly with salt. Whisk egg whites in medium bowl until frothy. Dredge eggplant in egg whites, then breadcrumbs, coating completely; place on baking sheet. (Can be made 2 hours ahead. Cover and refrigerate.)",
        "Heat vegetable oil in heavy large skillet over medium-high heat to 350°F. Working in batches, add eggplant slices to skillet and fry until golden, about 2 minutes per side. Using slotted spatula, transfer to paper towels to drain. Sprinkle with salt and pepper.",
        "Place 1 tablespoon skordalia in center of each of 6 plates. Top skordalia with 1 eggplant slice, 1 tablespoon skordalia, 1 tablespoon sliced basil, 1 oven-dried tomato half, 1 eggplant slice, 1 tablespoon skordalia, 1 tablespoon basil, 1 oven-dried tomato half, and 1 more eggplant slice. Garnish with olives and serve."
    ],
    "ingredients": [
        "6 plum tomatoes, cored, halved lengthwise, seeded",
        "1/4 cup extra-virgin olive oil",
        "1 garlic clove, chopped",
        "1 teaspoon chopped fresh thyme",
        "1 head of garlic",
        "1 tablespoon extra-virgin olive oil",
        "1 pound russet potatoes, peeled, cut into 3/4-inch cubes",
        "6 tablespoons whipping cream",
        "1/4 cup (1/2 stick) butter",
        "1 tablespoon sour cream",
        "1 cup sliced almonds, toasted, cooled, finely ground",
        "1 tablespoon fresh lemon juice",
        "1 garlic clove, minced",
        "18 1/4-inch-thick round eggplant slices (cut from 1 large)",
        "4 cups whole milk",
        "6 large egg whites",
        "2 cups dry breadcrumbs",
        "4 cups vegetable oil (for frying)",
        "3/4 cup thinly sliced fresh basil",
        "1 cup oil-cured olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Garlic",
        "Olive",
        "Potato",
        "Tomato",
        "Appetizer",
        "Bake",
        "Fry",
        "Basil",
        "Almond",
        "Eggplant",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Eggplant Crisps with Skordalia and Oven-Dried Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-crisps-with-skordalia-and-oven-dried-tomatoes-108543"
}
