{
    "directions": [
        "Preheat oven to 350°F. Spray 3 baking sheets and one 13x9x2-inch glass baking dish with nonstick spray. Place flour in 1 wide shallow bowl, eggs in second bowl, and breadcrumbs mixed with 1 cup Parmesan cheese in another. Sprinkle each eggplant slice with salt and pepper. Coat each slice with flour, then beaten egg, and finally breadcrumb mixture. Arrange eggplant slices in single layer on prepared sheets. Bake eggplant in batches until coating is golden, turning after 15 minutes, about 30 minutes total. Cool on sheets.",
        "Mix mozzarella cheese, ricotta cheese, basil, and 1 cup Parmesan cheese in medium bowl. Season filling with salt and pepper. Divide filling among eggplant slices (about 3 tablespoons per slice); spread evenly. Starting at 1 short end, roll up eggplant slices, enclosing filling. Arrange rolls, seam side down, in prepared baking dish. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 350°F. Spoon marinara sauce over rolls; sprinkle with remaining 2/3 cup Parmesan cheese. Bake uncovered until rollatini are heated through and mozzarella cheese melts, about 30 minutes."
    ],
    "ingredients": [
        "Nonstick olive oil spray",
        "All purpose flour",
        "4 large eggs, beaten to blend",
        "3 1/2 cups fresh breadcrumbs made from crustless French bread",
        "2 2/3 cups grated Parmesan cheese (about 8 ounces)",
        "18 1/4- to 1/3-inch-thick lengthwise eggplant slices (from 2 medium)",
        "3 cups (packed) coarsely grated whole-milk mozzarella cheese (about 12 ounces)",
        "1 1/4 cups ricotta cheese (preferably whole-milk)",
        "3/4 cup chopped fresh basil leaves",
        "3 cups purchased marinara sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Bake",
        "Mozzarella",
        "Parmesan",
        "Ricotta",
        "Basil",
        "Eggplant",
        "Fall"
    ],
    "title": "Eggplant Rollatini",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-rollatini-107076"
}
