{
    "directions": [
        "For fresh tomatoes:",
        "Score the skins with a sharp knife in an X on the bottom of each tomato. Place the tomatoes in boiling water for 30 seconds, then transfer to ice water bath to cool. Peel, halve, and slice tomatoes, and reserve.",
        "Preheat the oven to 425 degrees F.",
        "Toss the squash with a drizzle of extra-virgin olive oil and season with salt, pepper, and nutmeg. Arrange the squash on a baking sheet and roast 25 to 30 minutes, until tender and brown at edges.",
        "Heat 2 tablespoons extra-virgin olive oil in a large skillet with tight fitting lid. Add the peppers, onions, garlic, ginger, and season with salt and pepper, sweat out the vegetables a few minutes then add the eggplant, curry, chile powder, and cardamom. Stir to toast and combine, then cover the pot and cook 12 to 15 minutes, stirring occasionally, until eggplant is tender. Stir in the roast squash, tomatoes, chutney, and stock. Cool and store for make-ahead meal.",
        "If serving immediately, start the rice a few minutes after the squash goes into the oven. Otherwise, reheat the curry over medium heat, stirring occasionally, 15 minutes after you start cooking the rice. To prepare the rice, follow package directions adding lime zest or leaves to water before rice, add the scallions to the rice and lime juice when the rice is done and you fluff with fork.",
        "Serve curry on bed of lime and green onion rice with extra chutney for mixing in."
    ],
    "ingredients": [
        "3 to 4 plum tomatoes OR 1 (14-ounce) can diced tomatoes or stewed tomatoes",
        "1 to 1 1/4 pounds peeled kuri, pumpkin or butternut squash, cut into bite-size pieces",
        "2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "Salt and freshly ground black pepper",
        "Freshly grated nutmeg",
        "3 mild red frying peppers or 2 small red bell peppers, seeded and quartered lengthwise then thinly sliced",
        "2 small onions or 1 large, quartered lengthwise and thinly sliced",
        "4 cloves garlic, sliced",
        "1 (1-inch) piece fresh gingerroot, peeled and grated",
        "1 small firm eggplant, diced into bite-size pieces (1 to 1 1/4 pounds)",
        "2 tablespoons West Indian curry powder* (a couple of scant palmfuls)",
        "1 tablespoon chile powder (a palmful)",
        "1 teaspoon ground cardamom (1/3 palmful)",
        "1/2 cup mango chutney, plus some more to pass at table",
        "2 cups chicken stock",
        "Red rice, cooked according to package directions, or brown rice",
        "Zest and juice of 1 lime or Kaffir lime leaves",
        "1 bunch scallions, thinly sliced on an angle"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Curry Recipes",
        "Eggplant Recipes",
        "Vegetable",
        "Squash"
    ],
    "title": "Eggplant and Squash Curry",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/eggplant-and-squash-curry-recipe"
}
