{
    "directions": [
        "Preheat oven to 400°F.",
        "Toss shallots and tomatoes with 3 tablespoons oil in a large roasting pan and season with salt. Roast until tomatoes are tender but not falling apart, about 25 minutes. Transfer tomatoes only to a large bowl.",
        "Add pumpkins with salt to taste to shallots, tossing to coat with oil in pan. Roast until pumpkins are just tender, about 30 minutes, then add vegetables to tomatoes.",
        "Reduce oven temperature to 200°F.",
        "Straddle roasting pan across 2 burners. Add water and 1/2 cup wine and deglaze by boiling over moderately high heat, stirring and scraping up any brown bits. Reserve liquid.",
        "Cook soybeans in boiling salted water until just tender, about 1 minute (3 minutes for lima beans), then drain. When cool enough to handle, shell soybeans, discarding pods.",
        "Cut 2 (2-inch-thick) crosswise slices, or \"steaks,\" from thickest part of each eggplant and season generously with salt and pepper. (Reserve remaining eggplant for another use.) Brown 3 eggplant steaks in 3 tablespoons oil in a 12-inch nonstick skillet over moderate heat, about 5 minutes on each side.",
        "Add 1/4 cup wine to skillet and simmer, covered, turning once, until eggplant is very tender and wine is absorbed, about 5 minutes total. Transfer to a small roasting pan. (If wine is absorbed before eggplant is tender, add water, a few tablespoons at a time, and continue cooking until tender.) Repeat with remaining 3 eggplant steaks. Keep eggplant warm, uncovered, in oven.",
        "Heat remaining 2 tablespoons oil in skillet over moderately high heat until hot but not smoking, then sauté mushrooms with garlic, rosemary, and salt to taste, stirring, until golden and any liquid mushrooms give off is evaporated. Stir in reserved deglazing liquid and simmer until mushrooms are tender, about 10 minutes. Add roasted vegetables and soybeans and cook, stirring, until heated through. Stir in vinegar.",
        "Serve eggplant steaks topped with vegetable ragout."
    ],
    "ingredients": [
        "1/2 lb shallots, quartered lengthwise",
        "1 lb plum tomatoes, quartered lengthwise and seeded",
        "11 tablespoons olive oil (about 3/4 cup)",
        "1 1/2 (3/4-lb) sugar pumpkins or butternut squash, cut into 3/4-inch wedges and seeded",
        "1 1/2 cups water",
        "1 cup dry white wine",
        "1/2 lb fresh or frozen edamame (soybeans in the pod; 1 1/2 cups) or 2/3 cup fresh or frozen shelled lima beans",
        "3 large eggplants",
        "3/4 lb fresh chanterelle or shiitake mushrooms, trimmed (discard stems from shiitakes)",
        "1 tablespoon minced garlic",
        "1 1/2 teaspoons minced fresh rosemary",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Soy",
        "Tomato",
        "Vegetable",
        "Roast",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Rosemary",
        "Eggplant",
        "Pumpkin",
        "Fall",
        "Vegan",
        "Shallot",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Eggplant Steaks with Pumpkin, Tomato, and Mushroom Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-steaks-with-pumpkin-tomato-and-mushroom-ragout-103832"
}
