{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Cut 5 crosswise slices from center area of each eggplant, about 1/2-inch thick, to total 10 slices. Peel and dice remaining pieces of eggplant.",
        "Heat 2 tablespoons olive oil in a large skillet over medium-high heat until oil is very hot. Sprinkle eggplant slices lightly with a pinch of salt and cook in hot skillet in batches until slightly softened, about 3 minutes per side. Set eggplant slices aside on paper towels.",
        "Heat 1 tablespoon olive oil in skillet and cook garlic for about 10 seconds; add diced eggplant and season with a pinch of salt and red pepper flakes. Saute until eggplant is softened, about 5 minutes. Pour in marinara sauce and water. Turn heat to medium-low and cook until eggplant is tender, about 15 minutes; stir occasionally. If sauce gets too thick, add a little more water.",
        "Combine ricotta cheese, 1/2 cup Parmesan cheese, pepperjack cheese, a pinch of salt, and a pinch black pepper in a bowl until thoroughly combined. Spread about 2 tablespoons cheese mixture over each eggplant slice. Fold eggplant slices in half to enclose the cheese mixture.",
        "Spread about half the sauce into an 8x8-inch baking dish. Lay folded eggplant slices in a single layer into the dish. Spread remaining sauce over eggplant slices.",
        "Combine bread crumbs, 1/2 cup Parmesan cheese, and 2 tablespoons olive oil in a bowl; mix thoroughly. Spread crumb mixture over eggplant casserole.",
        "Bake in the preheated oven until casserole is bubbling and crumbs are browned, 35 to 40 minutes."
    ],
    "ingredients": [
        "2 large eggplants",
        "2 tablespoons olive oil",
        "1 pinch salt, or as needed",
        "1 tablespoon olive oil",
        "2 cloves garlic, sliced",
        "1/2 teaspoon red pepper flakes",
        "3 cups prepared marinara sauce",
        "1/2 cup water, plus more as needed",
        "3/4 cup ricotta cheese",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup shredded pepperjack cheese",
        "salt and freshly ground black pepper to taste",
        "3/4 cup dry bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Eggplant Parmesan Casserole",
    "url": "http://allrecipes.com/recipe/235794/eggplant-parmesan-casserole/"
}
