{
    "directions": [
        "Preheat the broiler. Arrange the eggplant slices in one layer on baking sheets, brush both sides of the eggplant with the oil, and sprinkle them with salt to taste. Broil the eggplant in batches about 4 inches from the heat for 4 to 5 minutes on each side, or until it is golden and tender, and transfer it with a metal spatula to paper towels to drain.",
        "Line a loaf pan, 8 1/2 by 4 1/2 by 2 1/2 inches, with plastic wrap, leaving a 3-inch overhang, and in it arrange the eggplant, the olive paste, the bell peppers, and the goat cheese in several layers, beginning and ending with the eggplant. Cover the eggplant with the plastic overhang, weight the terrine with a 3-to-4-pound weight (such as a loaf pan filled with canned goods), and chill it for 24 hours. (The terrine may be made 3 days in advance).",
        "Remove the weight, invert the terrine onto a cutting board, and discard the plastic wrap. Cut four 3/4-inch-thick slices from the terrine, pour about 2 tablespoons of the parsley sauce onto the center of each of 4 plates, tilting the plates to spread the sauce, and arrange a slice of the terrine on each plate. Garnish each serving with a parsley spring.",
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)",
        "In a blender purée the parsley and the garlic with the vinegar, the water, the oil, and salt and pepper to taste until the sauce is smooth and strain it through a fine sieve set over a small bowl, pressing hard on the solids. Makes about 1/2 cup."
    ],
    "ingredients": [
        "2 eggplants (about 2-1/2 pounds total), cut lengthwise into 1/2-inch-thick slices",
        "1/3 cup olive oil",
        "1/4 cup bottled black olive paste such as tapenade or olivada (available at specialty foods shops and some supermarkets)",
        "3 red bell peppers, each roasted (procedure follows) and cut lengthwise into 3 sections",
        "7 ounces soft mild goat cheese, such as Montrachet, sliced thin",
        "parsley sauce (recipe follows) as an accompaniment",
        "parsley springs for garnish if desired",
        "1/2 cup chopped fresh parsley leaves, preferably flat-leaved",
        "1 small garlic clove, sliced",
        "4 teaspoons balsamic vinegar",
        "2 tablespoons water",
        "6 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Olive",
        "Vegetable",
        "Broil",
        "Vegetarian",
        "Lunch",
        "Goat Cheese",
        "Eggplant",
        "Bell Pepper",
        "Summer",
        "Chill",
        "Healthy",
        "Gourmet"
    ],
    "title": "Eggplant, Roasted Pepper, and Goat Cheese Terrine with Parsley Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-roasted-pepper-and-goat-cheese-terrine-with-parsley-sauce-12262"
}
