{
    "directions": [
        "Beat together besan, rice flour, and water in a bowl with a handheld electric mixer at high speed 6 minutes. Beat in nigella seeds and salt, then let stand, covered, at room temperature 30 minutes.",
        "Test batter: Drop a teaspoon of it into a bowl of water. It should float, even though part may be submerged. If it sinks, batter should be beaten more, testing after each minute of mixing. Be careful not to overbeat, because that will produce a honeycomb texture, and then fritters will absorb too much oil.",
        "Preheat oven to 250°F.",
        "Cut eggplant lengthwise into 1/8-inch-thick slices, then halve each slice lengthwise, forming roughly 5- by 2-inch slices.",
        "Heat oil in a 12-inch heavy skillet over moderate heat until hot but not smoking. Dip about 4 eggplant slices in batter, 1 at a time, letting excess drip off, and fry until browned and tender, about 1 minute on each side. (You will have just enough batter for all of eggplant.) Transfer to paper towels to drain. Keep fritters warm in 1 layer on a baking sheet in oven and fry remaining eggplant in batches in same manner.",
        "Available at Indian markets and Kalustyan’s (212-685-3451)."
    ],
    "ingredients": [
        "1 cup besan (chickpea flour)*",
        "2 teaspoons rice flour",
        "3/4 cup water",
        "Pinch of nigella seeds (also called black onion seeds)*",
        "3/4 teaspoon salt",
        "1 (1-lb) eggplant",
        "1 cup canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Appetizer",
        "Side",
        "Fry",
        "Vegetarian",
        "Eggplant",
        "Winter",
        "Pan-Fry",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Eggplant Fritters",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-fritters-106164"
}
