{
    "directions": [
        "Peel and dice the eggplants, peel and slice the onion, peel and slice the garlic, slice the celery.",
        "In a large bowl, toss the eggplant with the salt. Transfer the eggplant to a colander to drain for 2 hours. In order to facilitate the draining, top the eggplant with a heavy weight, such as a dinner plate topped with full cans.",
        "Heat 3 tablespoons of the olive oil over medium heat in a large sauté pan. Add the onion and sauté until translucent, 4 to 5 minutes. Add the garlic and celery and sauté for 5 minutes more, or until the garlic softens but does not brown. Add the anchovies and cook for 1 minute.",
        "Add the tomato paste and stir to thoroughly combine. Cook for 2 minutes, or until the paste turns a deep red, almost brown, and starts to stick to the pan. Add the vinegar and sugar and stir until the mixture thickens, 3 to 4 minutes. Turn off the heat.",
        "In another large sauté pan, heat the remaining 2 tablespoons olive oil over high heat until smoking. Add the eggplant and carefully toss it in the oil, letting it sear before stirring. Turn the heat down to medium and cook for 8 to 10 minutes, or until the eggplant is translucent and soft.",
        "Transfer the eggplant to the caponata mixture and cook over low heat for 3 minutes, until the flavors combine. Add the capers and their brine and stir to incorporate.",
        "Serve warm or at room temperature accompanied by toast points or crostini."
    ],
    "ingredients": [
        "2 large Italian eggplants, peeled and cut into medium dice",
        "2 tablespoons kosher salt",
        "5 tablespoons extra-virgin olive oil",
        "1 red onion, thinly sliced",
        "4 medium garlic cloves, thinly sliced",
        "4 celery stalks, thinly sliced on an angle",
        "2 anchovies, in oil",
        "1/4 cup tomato paste",
        "1 1/2 cups red wine vinegar",
        "1/4 cup sugar",
        "1/2 cup capers, in brine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Side",
        "Kid-Friendly",
        "Eggplant",
        "HarperCollins",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Eggplant Caponata",
    "url": "http://www.epicurious.com/recipes/food/views/eggplant-caponata-56390144"
}
