{
    "directions": [
        "Preheat oven to 400°F. Arrange prosciutto slices in single layer on rimmed baking sheet. Bake until prosciutto is crisp, about 12 minutes. Remove prosciutto from oven; let cool on sheet. Coarsely crumble.",
        "Whisk oil and vinegar in small bowl for vinaigrette. Season with salt and pepper. Combine next 4 ingredients in large bowl.",
        "Fill another large bowl with cold water. Pour enough water into large skillet to reach depth of 11/2 inches. Add 1 teaspoon coarse salt; bring to simmer. Crack 1 egg into each of 4 custard cups or small bowls, keeping yolks intact. Gently slide eggs into simmering water. Cook just until whites are set, about 2 minutes. Using slotted spoon, transfer 1 egg at a time to prepared bowl with cold water. Reserve skillet with water. do ahead Prosciutto, vinaigrette, salad, and eggs can be made 4 hours ahead. Cover prosciutto, salad, and bowl with eggs separately; chill. Let vinaigrette stand at room temperature; rewhisk before using.",
        "Whisk 2 egg yolks and lemon juice in medium metal bowl. Gradually whisk in melted butter. Set bowl over medium saucepan of gently simmering water (do not allow bottom of bowl to touch water). Whisk constantly until mixture thickens and instant-read thermometer registers 140°F for 3 minutes, about 5 minutes total. Remove bowl from over water; whisk in last 3 ingredients. Cover to keep warm.",
        "Toss salad with vinaigrette. Divide among plates; sprinkle with prosciutto. Bring skillet with water to boil. Using slotted spoon, slide poached eggs back into skillet; cook until heated through, about 1 minute. Using slotted spoon, divide eggs among salads. Drizzle with hollandaise."
    ],
    "ingredients": [
        "5 thin prosciutto slices",
        "3 tablespoons extra-virgin olive oil",
        "5 teaspoons white balsamic vinegar or white wine vinegar",
        "10 cups coarsely torn frisée (about 2 large heads; 9 ounces total)",
        "1 1/4 cups frozen shelled edamame (soybeans), thawed (about 8 ounces)(soybeans), thawed (about 8 ounces)",
        "8 radishes, trimmed, thinly sliced",
        "1/2 small red onion, thinly sliced",
        "1 teaspoon coarse kosher salt",
        "4 large eggs",
        "2 large egg yolks",
        "3 tablespoons fresh lemon juice",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1 tablespoon Dijon mustard",
        "1/8 teaspoon coarse kosher salt",
        "Pinch of ground white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Christmas",
        "High Fiber",
        "Mother's Day",
        "New Year's Day",
        "Prosciutto",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Eggs Benedict Salad",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-benedict-salad-351052"
}
