{
    "directions": [
        "Using 3 1/4-inch biscuit cutter or clean 6-ounce tuna can as template, cut ham slices into rounds.",
        "Whisk mayonnaise, 1 1/2 teaspoons Dijon mustard, orange juice, grated orange peel, and fresh lemon juice in small bowl to blend. (Ham and sauce can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 300°F. Fill large skillet with enough water to reach depth of 2 inches. Add white wine vinegar and 1 1/2 teaspoons salt to water. Bring to simmer over high heat. Reduce heat to medium-low. Spread 3 tablespoons butter and some additional Dijon mustard over split sides of English muffins. Melt remaining 1 tablespoon butter in heavy large skillet over medium-high heat. Add ham rounds and cook just until beginning to brown, about 1 minute per side. Place ham atop prepared English muffins. Arrange English muffins on baking sheet. Keep warm in oven while preparing eggs.",
        "Crack eggs into skillet of simmering water. Cook until whites are set and yolks are set to desired doneness, about 3 minutes for medium-set yolks. Using slotted spoon, transfer eggs to plate.",
        "Stir sauce in top of double boiler over simmering water until just heated through, about 2 minutes. Season sauce to taste with salt and pepper.",
        "Place 1 egg atop ham on each prepared muffin half. Spoon warm sauce over eggs, sprinkle with basil or parsley, and serve immediately."
    ],
    "ingredients": [
        "8 ounces 1/4-inch-thick slices Black Forest ham",
        "2/3 cup mayonnaise",
        "1 1/2 teaspoons Dijon mustard",
        "3 tablespoons orange juice",
        "2 teaspoons grated orange peel",
        "1 teaspoon fresh lemon juice",
        "1 tablespoon white wine vinegar",
        "1 1/2 teaspoons salt",
        "4 tablespoons (1/2 stick) butter",
        "Additional Dijon mustard",
        "4 English muffins, split, toasted",
        "8 large eggs",
        "2 tablespoons chopped fresh basil or chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Pork",
        "Breakfast",
        "Brunch",
        "Quick & Easy",
        "Ham",
        "Summer",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Eggs Benedict with Mock Hollandaise",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-benedict-with-mock-hollandaise-108441"
}
