{
    "directions": [
        "Split muffins. In a large baking pan dry muffin halves, uncovered, at room temperature 12 hours. (Alternatively, dry muffin halves in a 250°F oven 1 hour.)",
        "Butter a 13- by 9- by 2-inch baking dish (about 3 quarts).",
        "In a large saucepan of boiling salted water cook broccoli until crisp-tender, about 3 minutes, and drain in a colander. Refresh broccoli under cold running water and drain well.",
        "Coarsely chop bacon. In a heavy skillet cook bacon in oil over moderate heat, stirring, 3 minutes. Drain bacon well on paper towels.",
        "Chop hard-boiled eggs. Arrange muffin bottoms, split sides up, in one layer in baking dish and sprinkle evenly with hard-boiled eggs, bacon, broccoli, Jarlsberg, and salt and pepper to taste.",
        "In a small heavy saucepan bring broth to a boil. In a bowl whisk together 2 uncooked eggs and lemon juice. Whisk half of broth in a stream into egg mixture and whisk mixture into broth remaining in pan. Cook mixture over moderately low heat, stirring, until thickened (do not let boil). In bowl whisk together remaining uncooked egg, cream, milk, and salt and pepper to taste and whisk in lemon mixture in a stream until combined well. Pour custard slowly and evenly over muffins in baking dish.",
        "Butter muffin tops and quarter them. Arrange muffin pieces on top of custard, buttered sides up. Chill pudding, covered, at least 1 hour and up to 12. (If chilling pudding 12 hours, bottom muffin layer will develop a custardlike consistency.)",
        "Preheat oven to 350°F.",
        "Bake pudding in middle of oven until custard is set, about 30 minutes."
    ],
    "ingredients": [
        "6 English muffins",
        "3 cups 1-inch broccoli flowerets (from about 1 bunch)",
        "6 ounces Canadian bacon",
        "1 teaspoon vegetable oil",
        "4 hard-boiled large eggs",
        "1 cup coarsely grated Jarlsberg cheese (about 4 ounces)",
        "2/3 cup chicken broth",
        "3 uncooked large eggs",
        "1/4 cup fresh lemon juice",
        "1 cup heavy cream",
        "1 cup milk",
        "1 tablespoon unsalted butter, softened"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Pork",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Bake",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Eggs Benedict Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-benedict-bread-pudding-14575"
}
