{
    "directions": [
        "Combine all ingredients in small bowl. DO AHEAD: Relish can be made 1 day ahead. Cover and refrigerate.",
        "Preheat oven to 375°F. Stir olive oil and garlic in large bowl. Add bread cubes and toss to coat well. Transfer bread to heavy large baking sheet and bake until lightly toasted yet still chewy, about 10 minutes. Cool.",
        "Whisk olive oil, vinegar, and shallots in large bowl. Add arugula, frisée, and migas; toss well. Season lightly with fleur de sel. Divide salad among 4 plates.",
        "Heat olive oil in large nonstick skillet over medium heat. Add eggs; immediately cover top of each egg with cheese, dividing evenly. Cover and cook until egg whites are just set and cheese softens, about 2 minutes. Carefully transfer 1 egg to each plate; top with ham and season with pepper. Top each egg with relish, dividing evenly.",
        "A Spanish cheese made from sheep's milk; sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1/4 cup chopped pitted brine-cured green olives",
        "1/4 cup chopped drained roasted red bell pepper from jar",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon chopped fresh oregano",
        "2 tablespoons extra-virgin olive oil",
        "2 small garlic cloves, pressed",
        "4 3/4-inch-thick slices pain rustique or ciabatta, cut into 3/4-inch cubes (about 4 generous cups)",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon Sherry wine vinegar",
        "1/4 cup finely chopped shallots",
        "4 cups (lightly packed) arugula leaves",
        "4 cups (lightly packed) torn baby frisée",
        "Fleur de sel or coarse kosher salt",
        "1 tablespoon extra-virgin olive oil",
        "4 large eggs",
        "4 ounces very thinly sliced Manchego cheese*",
        "4 very thin slices Serrano ham or prosciutto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Olive",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "High Fiber",
        "Lunch",
        "Ham",
        "Arugula",
        "Pan-Fry",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Eggs with Serrano Ham and Manchego Cheese, Green Olive Relish, and Migas",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-with-serrano-ham-and-manchego-cheese-green-olive-relish-and-migas-241877"
}
