{
    "directions": [
        "Remove the meat from the lobster tails and claws, and dice into bite-size pieces. Dice 6 eggs into the same size pieces as the lobster.",
        "Bring 4 cups water to a rolling boil in a heavy-bottomed pan. Cut out the green stem portion of the tomatoes and drop them into the boiling water for about 30 seconds. Remove immediately to ice cold water, and leave for several minutes. Peel the skins off the tomatoes and dry the tomatoes with paper towels. Cut the tomatoes into quarters, and remove the seeds and membranes. Dice the tomato flesh into the same size pieces as the egg and lobster.",
        "In a large ceramic or glass bowl (not metallic), whisk the mayonnaise, ketchup, and Worcestershire sauce together until combined. Add the lobster, egg, and tomato, and fold together gently. Taste and season with salt and pepper. Spoon the egg and lobster mixture into an ornate glass dish, and smooth the top to make it level.",
        "Soften the gelatin with the sherry in a small pan. Place over a low heat, and stir until dissolved. Spoon a thin layer of the sherry over the top of the egg and lobster mixture and refrigerate the dish until the layer has set.",
        "Using an egg slicer, cut six circles of egg from the remaining two eggs. Brush the tops of each egg slice with some of the remaining warm gelatin. Cut each of the shrimp in half lengthwise, dip into the gelatin, and arrange neatly on an egg slice. Refrigerate until set, and then lift each egg and shrimp garnish to decorate the egg and lobster salad. Garnish with 1 sprig parsley. Serve as an appetizer with lemon wedges and sliced and buttered brown bread."
    ],
    "ingredients": [
        "2 (1 1/2 pound) lobsters, cooked and cooled",
        "8 hard-boiled eggs, divded",
        "6 vine-ripe tomatoes",
        "2 cups mayonnaise",
        "1/2 cup ketchup",
        "1 teaspoon Worcestershire sauce",
        "1 packet unflavored gelatin",
        "1 cup sherry",
        "6 medium shrimp",
        "6 parsley sprigs for garnish",
        "Salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Breakfast",
        "Wedding",
        "Mayonnaise",
        "Lobster",
        "Shrimp",
        "Boil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Eggs Drumkilbo",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-drumkilbo-364789"
}
