{
    "directions": [
        "For the hollandaise sauce: Place the white wine vinegar, peppercorns, sliced shallots and tarragon into a pan, bring to the boil and reduce by half. Strain and reserve.",
        "Place a large pot filled partway with water to the boil, then lower and keep at a simmer. Place the egg yolks in a bowl that will fit over the pot of simmering water but not touch the water. Add 1 tablespoon of the reduced vinegar to the eggs and place the bowl on top of the pot, making sure the water does not touch the bottom of the bowl. Beat the eggs with a balloon whisk, occasionally removing the bowl from the heat so the mixture does not become scrambled, until the eggs thicken and double in size.",
        "Remove the bowl from the pot, then whisk a small ladle of the warm clarified butter into the eggs. Continue to gradually add the butter while whisking. If the sauce becomes too thick, add a small amount of warm water. Whisk in the lemon juice and season with salt and pepper. Keep warm.",
        "For the poached eggs: Mix the white wine vinegar, some salt and 5 cups water in a pan, bring to the boil and then bring down to a simmer.",
        "For the toasted English muffins with smoked salmon: Meanwhile, place the English muffin halves into a toaster and toast until golden brown. While the muffins are still warm, spread the softened butter onto the open toasted side of each and layer 1 1/2 ounces of the sliced salmon on each buttered muffin half.",
        "To poach the eggs, crack each egg into an individual small bowl. Use a whisk to gently stir the simmering poaching liquid in a counter-clockwise direction, and pour each egg into the water in the same direction the water is moving. Gently simmer for 1 minute. Remove with a strainer, drain and place onto a garnished English muffin half. (If you are keeping the eggs for later, remove them from the water with a strainer and place immediately in salted ice water. Reheat them in the same cooking water.)",
        "Spoon 2 tablespoons of the hollandaise sauce over each poached egg and garnish with 1/2 teaspoon of the caviar."
    ],
    "ingredients": [
        "1 1/2 cups white wine vinegar",
        "5 peppercorns",
        "1 shallot, finely sliced",
        "1 sprig fresh tarragon",
        "3 large free-range egg yolks",
        "1 cup melted and skimmed (clarified) unsalted butter, warm",
        "1/2 lemon, juiced",
        "Salt and freshly ground black pepper",
        "1/4 cup white wine vinegar",
        "Salt",
        "10 eggs",
        "5 English muffins, split",
        "5 ounces salted butter, softened",
        "15 ounces sliced Scottish smoked salmon",
        "2 ounces American caviar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fish",
        "Salmon",
        "Caviar",
        "Egg Recipes",
        "Brunch"
    ],
    "title": "Eggs Benedict",
    "url": "http://www.foodnetwork.com/recipes/eggs-benedict0"
}
