{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Bring ham and cream to a simmer in a small saucepan over medium-low heat, then remove from heat. Let steep, uncovered, about 10 minutes.",
        "Cook onion in 1 tablespoon butter in a 12-inch heavy skillet over medium-low heat, stirring, until softened, about 2 minutes. Add garlic and season lightly with salt and pepper, then cook, stirring, 1 minute. Add spinach, 1/4 teaspoon salt, and 1/8 teaspoon pepper and cook, turning with tongs, until spinach is wilted.",
        "Drain spinach in a colander, pressing to remove excess liquid, then coarsely chop. Divide spinach, then ham, among ramekins, spooning 1 tablespoon cream into each serving. Crack eggs into ramekins and season lightly with salt and pepper. Spoon 1 teaspoon cream over each egg. Cut remaining tablespoon butter into 8 small pieces and dot each egg with butter.",
        "Put ramekins in a shallow baking pan and bake, rotating pan halfway through baking, until whites are just set but yolks are still runny, 15 to 20 minutes, removing from oven as cooked."
    ],
    "ingredients": [
        "1/4 cup thinly sliced country ham, finely chopped",
        "Scant 3/4 cup heavy cream",
        "1 tablespoon finely chopped onion",
        "2 tablespoons unsalted butter, divided",
        "3/4 teaspoon finely chopped garlic",
        "10 ounces spinach, coarse stems discarded",
        "8 large eggs",
        "Equipment: 8 (6-ounce) ramekins or ovenproof teacups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Brunch",
        "Bake",
        "Ham",
        "Spinach",
        "Ramekin",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Eggs with Cream, Spinach, and Country Ham",
    "url": "http://www.epicurious.com/recipes/food/views/eggs-with-cream-spinach-and-country-ham-241180"
}
