{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C). Spray a baking sheet with nonstick cooking spray.",
        "Place the beef, bread, egg, liquid seasoning, Worcestershire sauce, pepper, and seasoned salt in a bowl, and mix well. Using about 2 tablespoons of meat mixture per meatball, form into about 40 meatballs. Place the meatballs onto the prepared baking sheet, and bake for about 15 minutes, until the meatballs are no longer pink.",
        "Remove the meatballs, place them into a large baking dish with a cover, and set aside. Reduce the oven heat to 350 degrees F (175 degrees C).",
        "Whisk the cornstarch into 1/4 cup water in a bowl until smooth. Place 2 cups of water, onion, beef bouillon granules, and 1/4 teaspoon black pepper in a small saucepan over medium heat, and bring to a boil. Whisk the cornstarch mixture into the hot bouillon mixture, and return to a simmer. Reduce the heat to low, stir in the mushrooms, soup, parsley, and sour cream, and bring back just to a simmer.",
        "Pour the hot sour cream sauce over the meatballs, cover the baking dish, and bake for about 30 minutes, until the sauce is bubbling and thickened."
    ],
    "ingredients": [
        "2 pounds lean ground beef",
        "3 slices day-old white bread, torn into small pieces",
        "1 egg, lightly beaten",
        "1 teaspoon wheat-based liquid seasoning (such as Maggi® Seasoning)",
        "1 tablespoon Worcestershire sauce",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon seasoned salt",
        "1/4 cup cornstarch",
        "2 1/4 cups water, divided",
        "1/3 cup finely chopped onion",
        "1/4 cup beef bouillon granules",
        "1/4 teaspoon ground black pepper",
        "1 (4.5 ounce) can sliced mushrooms, drained",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "2 teaspoons chopped fresh parsley",
        "1/2 teaspoon paprika, or to taste",
        "2 cups sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Elegant Stroganoff Meatballs",
    "url": "http://allrecipes.com/recipe/178097/elegant-stroganoff-meatballs/"
}
