{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a small baking dish with cooking spray and set aside.",
        "Heat vegetable oil in a skillet over medium heat. Stir in the onions and garlic; cook for 1 minute. Add the celery, carrot, and mushrooms; cook until the vegetables have softened. Stir in the cornbread and Parmesan cheese. Season to taste with salt and pepper, then set aside.",
        "Lay the chicken breasts flat on a work surface. Create a pocket in each breast by using a paring knife to make a horizontal cut down one side; making sure not to cut all the way through. Stuff the breasts with enough cornbread mixture to make them quite plump. Sprinkle with salt and pepper, then place into the prepared baking dish.",
        "Bake in preheated oven until a thermometer inserted into the center of the stuffing reads 160 degrees F (70 degrees C), about 45 minutes.",
        "While the chicken is cooking, divide the asparagus spears into two, 6-piece portions, and wrap each bundle with a slice of bacon.  Place into a shallow baking dish, and bake along with the chicken during the final 20 minutes. The asparagus should be soft, and the bacon crisp when done.",
        "To serve, slice the breasts on the diagonal into 1/4-inch slices. Fan the slices out into a half-moon shape on one side of the plate, and place an asparagus bundle on the other."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1/2 red onion, chopped",
        "1 tablespoon finely minced garlic",
        "4 ribs celery, minced",
        "1/2 cup grated carrot",
        "6 large mushrooms, chopped",
        "1 cup cubed corn bread",
        "1/2 cup freshly grated Parmesan cheese",
        "Salt and pepper to taste",
        "2 (8 ounce) skinless, boneless chicken breast halves",
        "12 asparagus spears, trimmed",
        "2 slices thick sliced bacon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Elegant Stuffed Chicken and Asparagus Bundles",
    "url": "http://allrecipes.com/recipe/133105/elegant-stuffed-chicken-and-asparagus/"
}
