{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9 inch) pans. Sift together the flour, baking soda and salt. Set aside. In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.",
        "In a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in 1 1/2 teaspoon vanilla. Stir in the melted chocolate. Beat in the flour mixture alternately with the sour cream. Stir in boiling water (batter will be thin). Pour batter into prepared pans.",
        "Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.",
        "Make the Chocolate Buttercream Frosting: In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, whip the butter for about 10 minutes until it is super fluffy, beat in egg yolk. Gradually blend in the confectioners' sugar, alternating with 2 tablespoons vanilla and 2 tablespoons cream, then blend in the melted chocolate. Beat in the softened cream cheese.",
        "Make the Ganache:  In a large saucepan, combine chocolate chips and 1 cup heavy cream. Heat, stirring constantly, until chocolate is melted and smooth. Remove from heat and set aside.",
        "Assemble the cake:  When cake is completely cooled, cover the bottom cake layer with as much ganache as desired. Refrigerate for 5 minutes, or until ganache has set. Spread frosting over the ganache. Cover with top layer of cake. Frost top and sides with buttercream, and garnish with more ganache."
    ],
    "ingredients": [
        "CAKE:",
        "2 1/4 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "6 (1 ounce) squares unsweetened chocolate, chopped",
        "1/2 cup unsalted butter",
        "2 1/2 cups dark brown sugar",
        "3 eggs",
        "1 1/2 tablespoons vanilla extract",
        "1 cup sour cream",
        "1 cup water",
        "FROSTING:",
        "6 (1 ounce) squares unsweetened chocolate, chopped",
        "1/4 cup unsalted butter",
        "1 egg yolk",
        "4 cups confectioners' sugar",
        "2 tablespoons vanilla extract",
        "2 tablespoons heavy cream",
        "1 (8 ounce) package cream cheese, softened",
        "GANACHE:",
        "2 cups bittersweet chocolate chips",
        "1 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Elizabeth's Extreme Chocolate Lover's Cake",
    "url": "http://allrecipes.com/recipe/26027/elizabeths-extreme-chocolate-lovers/"
}
