{
    "directions": [
        "Preheat the oven to 325°F. Grease a 12-cup bundt pan with the margarine.",
        "Cut the fish into large chunks, and place in the bowl of a food processor. Pulse about 20 times, do not puree, but grind fine. Place in the bowl of an electric mixer.",
        "Heat the oil in a large frying pan, and sauté the onions over medium-low heat until soft and transparent. Let cool.",
        "To the fish mixture, add the onions, eggs, 2 cups of cold water, matzoh meal, salt, white pepper, sugar and lemon juice. Beat in the electric mixer at medium speed, using a paddle attachment, for about 10 minutes. Add the dill, and grate in the carrots; mix well.",
        "Pour the mixture into the greased bundt pan. Smooth the top with a spatula, and cover with foil. Place a large pan filled with water which is almost boiling and comes at least halfway up the sides of the bundt pan.",
        "Bake in the oven for 1 hour, or until the center is solid. Cool for 5 minutes, or until mold is cool to the touch. Run a knife around the edges. Place a flat serving plate on top, and then flip over, inverting the mold onto the plate. If the mold does not come out easily, give the plate a shake. You should feel or hear it give.",
        "Refrigerate for several hours or overnight. Slice as you would a torte, and serve as an appetizer. Garnish with the parsley and remaining dill, and serve with red horseradish."
    ],
    "ingredients": [
        "1 tablespoon pareve margarine",
        "2 pounds halibut fillets, skinned and boned",
        "1 pound salmon fillets, skinned and boned",
        "3 tablespoons vegetable oil",
        "4 medium Spanish onions, diced",
        "4 large eggs",
        "2 cups cold water",
        "6 tablespoons matzoh meal",
        "1 tablespoon salt, or to taste",
        "2 teaspoons freshly ground white pepper",
        "2 tablespoons sugar",
        "1 tablespoon fresh lemon juice",
        "2 tablespoons snipped dill, plus more for garnish",
        "2 large carrots, peeled",
        "parsley, for garnish",
        "prepared red horseradish for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Appetizer",
        "Bake",
        "Passover",
        "Halibut",
        "Salmon",
        "Spring",
        "Chill",
        "Kosher",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Ellyn Goodrich's Alaskan Halibut and Salmon Gefilte Fish Terrine (Pareve)",
    "url": "http://www.epicurious.com/recipes/food/views/ellyn-goodrichs-alaskan-halibut-and-salmon-gefilte-fish-terrine-pareve-102011"
}
