{
    "directions": [
        "Preheat the oven to 450 degrees F (230 degrees C). Grease a large baking sheet.",
        "Spread the eggplant and squash slices out in an even layer on the prepared baking sheet. Place the cloves of garlic off to one side of the pan, so you can find them later. Bake for 15 minutes in the preheated oven",
        "While the vegetables roast, whisk together the red wine vinegar, balsamic vinegar, olive oil, and lemon juice in a large serving bowl. Season with oregano, parsley, salt and pepper. Remove the garlic cloves from the oven, and chop or mash. Whisk the garlic into the dressing. Set aside.",
        "Remove the vegetables from the oven, and stir the squash and eggplant. Layer the asparagus, red onion, and red bell pepper over the top of the eggplant and squash. Return to the oven, and bake for another 15 to 20 minutes, or until the asparagus is tender but still bright green.",
        "When the vegetables are cooked through and slightly toasted, remove them from the oven, and place them in the bowl with the dressing. Stir to coat evenly. Taste and adjust salt and pepper if necessary. Chill for a few hours to marinate the vegetables."
    ],
    "ingredients": [
        "1 eggplant - quartered lengthwise, and sliced into 1/2 inch pieces",
        "2 small yellow squash, halved lengthwise and sliced",
        "4 cloves garlic, peeled",
        "1/4 cup olive oil, or as needed",
        "1 red bell pepper, seeded and sliced into strips",
        "1 bunch fresh asparagus, trimmed and cut into 2 inch pieces",
        "1/2 red onion, sliced",
        "1/4 cup red wine vinegar",
        "2 tablespoons balsamic vinegar",
        "1/4 cup olive oil",
        "2 lemons, juiced",
        "1/4 cup chopped fresh parsley",
        "3 tablespoons chopped fresh oregano",
        "salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Emily's Famous Roasted Vegetable Salad",
    "url": "http://allrecipes.com/recipe/61680/emilys-famous-roasted-vegetable-sala/"
}
