{
    "directions": [
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil.",
        "Arrange peppers on prepared baking sheet.",
        "Broil peppers in the preheated oven until skins begin to blister and turn black, about 5 minutes. Turn peppers and repeat until other side is evenly blistered and blackened.",
        "Place peppers in a plastic resealable bag, seal, and cover with a kitchen towel. Let peppers sit so the steam loosens the outer skin, about 10 minutes. Remove peppers from bag and rub off blackened skin. Break open and remove seeds and stem.",
        "Blend peppers, flour, and 2 cups buttermilk in a blender until creamy. Transfer to a medium skillet over medium-low heat. Add remaining 2 cups buttermilk and stir. Season with salt. Simmer until sauce is thickened, 5 to 10 minutes. Set aside.",
        "Bring a large pot of lightly salted water to a boil; add chicken. Boil until chicken is no longer pink and juices run clear, about 25 minutes. Drain, cool, and shred chicken.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat canola oil in a large skillet over medium heat. Fry corn tortillas in hot oil, working in batches, until just softened, 1 to 2 minutes. Transfer to a paper towel-lined plate.",
        "Pour about 1 cup of pepper enchilada sauce into the bottom of a 9x13-inch baking dish.",
        "Fill each tortilla with shredded chicken, diced onion, and 1 to 2 tablespoons Monterey Jack cheese. Roll tortilla around the filling and place seam-side down into the pepper enchilada sauce in the baking dish. Top enchiladas with remaining pepper sauce, remaining Monterey Jack cheese, and queso fresco.",
        "Bake in the preheated oven until sauce is bubbling and cheese is melted, 20 to 25 minutes. Top with Mexican crema to serve."
    ],
    "ingredients": [
        "12 Anaheim chile peppers",
        "2 tablespoons all-purpose flour",
        "4 cups buttermilk, divided",
        "2 teaspoons salt, or as needed",
        "1 pound skinless, boneless chicken breast halves",
        "1/2 cup canola oil for frying",
        "12 (6 inch) white corn tortillas, or more as needed",
        "1 white onion, diced",
        "1 1/2 cups shredded Monterey Jack cheese",
        "1/4 cup crumbled queso fresco",
        "1/2 cup Mexican crema (cream)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Enchiladas Verdes (Green Enchiladas)",
    "url": "http://allrecipes.com/recipe/223160/enchiladas-verdes-green-enchiladas/"
}
