{
    "directions": [
        "Let cheese sit at room temperature while you prepare the rest of the ingredients.",
        "In a small saucepan, boil beets in salted water until fork-tender, 20 to 25 minutes. Do not overcook; they should still have a bit of firmness to them. Let beets cool, and then slip off the skins with your fingers. Cut the beets into 1/2-inch cubes and place in a medium bowl.",
        "Cut the tops and bottoms off the persimmons, then run a knife between the peel and the flesh to cut off the peel. Cut flesh into 1/2-inch cubes and add to the bowl with the beets. Add Meyer lemon juice, zest, oil, salt and pepper; toss to combine. Let beet mixture stand 15 minutes to let flavors meld. Taste and adjust the seasoning, keeping in mind the cheese will add some salt to your dish. Depending on the sweetness of your lemon, you may want to add a pinch of sugar.",
        "Meanwhile, cut the bottom ends off endive heads to separate the leaves. With a sharp knife, cut a tiny bit off the curved underside of each leaf so that the endive cup lies flat.",
        "To serve, place a heaping teaspoon of cheese in each leaf, then spoon a bit of beet-persimmon salad over it. Garnish with torn mint and serve.",
        "DO AHEAD: The beets can be cooked up to 3 days in advance and refrigerated."
    ],
    "ingredients": [
        "1 cup crumbled marinated feta or goat cheese (see Cooks' Note)",
        "2 medium golden or red beets",
        "3 ripe Fuyu persimmons",
        "2 tablespoons Meyer lemon juice (or 1 1/2 tablespoons regular lemon juice)",
        "1 teaspoon Meyer lemon zest (or regular lemon zest)",
        "3 tablespoons extra-virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "Pinch sugar, optional",
        "8 heads Belgian endive",
        "Torn fresh mint, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Christmas",
        "Feta",
        "Beet",
        "Persimmon",
        "Endive",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Endive Cups With Beet, Persimmon and Marinated Feta",
    "url": "http://www.epicurious.com/recipes/food/views/endive-cups-with-beet-persimmon-and-marinated-feta-51259680"
}
