{
    "directions": [
        "Using on/off turns, blend goat cheese, olive oil, 1 tablespoon lemon juice, and lemon peel in food processor just until smooth and creamy. Transfer mixture to medium bowl. Stir in chopped cilantro and chives. Season cheese mixture to taste with salt and pepper. Cover and refrigerate until cold. (Can be made 1 day ahead. Keep refrigerated.) If desired, transfer cheese mixture to pastry bag fitted with small plain tip.",
        "Cut off and discard root ends of endive. Separate leaves. Cut cores, with some smaller leaves still attached, crosswise into thin strips. Toss sliced endive with remaining 1 tablespoon lemon juice in large bowl to coat. Arrange sliced endive on large platter. Pipe or spoon about 1 1/2 teaspoons cheese mixture at wide end of each endive leaf. Place 1 very small sprig cilantro and tomato slice atop each. Arrange leaves in concentric circles atop sliced endive. (Can be made 4 hours ahead. Cover and chill.)"
    ],
    "ingredients": [
        "1 pound soft fresh goat cheese",
        "2 tablespoons extra-virgin olive oil",
        "2 tablespoons fresh lemon juice",
        "2 generous teaspoons grated lemon peel",
        "3 tablespoons finely chopped fresh cilantro",
        "3 tablespoons finely chopped fresh chives",
        "8 long slender heads of Belgian endive",
        "Very small fresh cilantro sprigs (for garnish)",
        "6 grape tomatoes, cut crosswise into very thin slices, slices halved (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Citrus",
        "No-Cook",
        "Cocktail Party",
        "Vegetarian",
        "Low/No Sugar",
        "Graduation",
        "Goat Cheese",
        "Lemon",
        "Summer",
        "Chive",
        "Endive",
        "Cilantro"
    ],
    "title": "Endive \"Spoons\" with Lemon-Herb Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/endive-spoons-with-lemon-herb-goat-cheese-108221"
}
