{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Remove and discard the chicken giblets. Pat the outside dry. Liberally salt and pepper the inside of the chicken. Cut the lemons in quarters, place 2 quarters in the chicken along with the garlic and reserve the rest of the lemons. Brush the outside of the chicken with olive oil and sprinkle the chicken liberally with salt and pepper. Tie the legs together with kitchen string and tuck the wing tips under the body of the chicken. Place the chicken in a small (11 by 14-inch) roasting pan. (If the pan is too large, the onions will burn.) Place the reserved lemons and the sliced onions in a large bowl and toss with 2 tablespoons of olive oil, 1 teaspoon of salt, and 1/2 teaspoon of pepper. Pour the mixture around the chicken in the pan.",
        "Roast the chicken for about 1 hour and 15 minutes, until the juices run clear when you cut between a leg and a thigh. Remove the chicken to a platter, cover with aluminum foil, and allow to rest for 10 minutes while you prepare the sauce, leaving the lemons and onions in the pan.",
        "Place the pan on top of the stove and turn the heat to medium-high. Add the wine and stir with a wooden spoon to scrape up the brown bits. Add the stock and sprinkle on the flour, stirring constantly for a minute, until the sauce thickens. Add any juices that collect under the chicken. Carve the chicken onto a platter and serve with the lemons, onions, and warm sauce."
    ],
    "ingredients": [
        "1 (4 to 5 pound) roasting chicken",
        "Kosher salt and freshly ground black pepper",
        "2 lemons",
        "1 whole head garlic, cut in 1/2 crosswise",
        "Good olive oil",
        "2 Spanish onions, peeled and thickly sliced",
        "1/2 cup dry white wine",
        "1/2 cup chicken stock, preferably homemade",
        "1 tablespoon all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Recipes",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Engagement Roast Chicken",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/engagement-roast-chicken-recipe"
}
