{
    "directions": [
        "Heat the milk in a small saucepan until it bubbles, then remove from heat; add butter, sugar and stir until melted. Let cool until lukewarm. In a small bowl, soak the saffron in the hot water, let cool until lukewarm, drain and reserve the liquid.",
        "In a large mixing bowl, combine the milk mixture with the reserved saffron water and eggs. Add the yeast and stir to dissolve. Add the salt, nutmeg, cinnamon, lemon zest and 4 cups of the flour; mix well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large mixing, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into three equal pieces, form  into 14 inch long 'ropes'. Braid the 'ropes' together and place on a lightly greased baking sheet. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake at 350 degrees for 50 to 60 minutes or until golden brown and the bottom of the loaf sounds hollow when tapped. Remove to a wire rack and cool."
    ],
    "ingredients": [
        "1 1/2 cups milk",
        "1 cup butter",
        "1 cup white sugar",
        "2 teaspoons saffron",
        "1/2 cup hot water",
        "2 (.25 ounce) packages active dry yeast",
        "2 eggs",
        "2 teaspoons salt",
        "1/2 teaspoon ground nutmeg",
        "1 teaspoon ground cinnamon",
        "2 tablespoons grated lemon zest",
        "6 cups all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "English Saffron Bread",
    "url": "http://allrecipes.com/recipe/17097/english-saffron-bread/"
}
