{
    "directions": [
        "Preheat oven to 400°F. Plan to create 5 sections of nacho flavors, each section with 3 layers of ingredients. Spread one-third of the chips in an even layer on foil-lined baking sheet, then follow the directions to build each section. Once all sections are assembled, bake until cheese is melted and ingredients are hot, 8–10 minutes. Then finish with fresh toppings.",
        "Working in the first section, spread one-third of the spinach dip over chips with a spoon. Top with one-third of the onions, artichoke hearts, Fontina, and Parmesan. Repeat with 2 more layers of chips and ingredients.",
        "After baking, top with sliced tomatoes.",
        "Cook bacon in a large skillet over medium heat, working in batches if necessary, until crisp, about 10 minutes. Transfer to a paper-towel lined plate. Crumble bacon once cooled. Pour fat from skillet into a heatproof bowl, leaving burned bits in skillet. Wipe out skillet and return bacon fat to skillet.",
        "Peel potatoes in long, thin strips, reserving potato skins. Heat skillet with fat over medium-high and fry potato skins, turning, until golden brown, 4–6 minutes. Transfer skins to another paper towel-lined plate, reserving fat in skillet; season skins with salt.",
        "Cut potato flesh into 1/2\" cubes. Heat skillet with fat over medium and add potatoes. Season with salt and pepper and cook, stirring occasionally, until potatoes are golden brown and cooked through, 8–12 minutes. Transfer to another paper towel-lined plate.",
        "Working in the second section, top tortilla chips with one-third of the potato chips, cubed potatoes, bacon, cheddar, Monterey Jack, 3/4 cup sour cream, scallions, and paprika. Repeat with 2 more layers of chips and ingredients.",
        "After baking, top with additional sour cream, fried potato skin strips, chives, avocado, and pepper.",
        "Toss pork in 1/2 cup barbecue sauce in a large bowl. Working in the third section, top tortilla chips with one-third of the pork, mozzarella, and jalapeños. Repeat with 2 more layers of chips and ingredients.",
        "After baking, drizzle with additional barbecue sauce and top with slaw, white onion, and cilantro.",
        "Working in the fourth section, drizzle tortilla chips with one-third of the marinara sauce, then top with one-third of the pepperoni, Canadian bacon, sausage, bell peppers, mozzarella, and Pecorino. Repeat with 2 more layers of chips and ingredients.",
        "After baking, top with olives, red pepper flakes, garlic powder, oregano, and basil.",
        "Toss chicken in 1/2 cup buffalo wing sauce in a large bowl. Working in the fifth section, top tortilla chips with one-third of the chicken, Colby cheese, blue cheese, and red onion. Repeat with 2 more layers of chips and ingredients.",
        "After baking, drizzle with additional wing sauce and top with celery stalks, leaves, and pepperoncini peppers.",
        "While nachos bake, heat queso dip until hot in microwave or in a heatproof bowl set over a pot of barely simmering water. Place tostada bowl in the center of the baked nachos and fill with queso dip. Serve immediately."
    ],
    "ingredients": [
        "6 (9-ounce) bags restaurant-style tortilla chips",
        "2 cups store-bought or homemade spinach dip, warmed",
        "1 large yellow onion, thinly sliced, caramelized",
        "12 ounces marinated artichoke hearts, drained, coarsely chopped (about 2 cups)",
        "10 ounces grated Fontina cheese (about 4 cups)",
        "1 1/2 ounces finely grated Parmesan (about 1/2 cup)",
        "3/4 cup cherry tomatoes, quartered",
        "1 pound sliced bacon",
        "2 large russet potatoes (about 1 1/2 pounds)",
        "Kosher salt",
        "Freshly ground black pepper",
        "3 cups ridged potato chips (about 3 ounces)",
        "8 ounces grated cheddar (about 2 1/2 cups)",
        "8 ounces grated Monterey Jack (about 2 1/2 cups)",
        "3/4 cup sour cream, plus more for serving",
        "2 scallions, thinly sliced",
        "1/2 teaspoon paprika",
        "2 tablespoons sliced chives",
        "1/2 avocado, diced",
        "4 cups shredded pork baby back rib meat (from about 1 pound ribs), or pulled pork, warmed",
        "1/2 cup barbecue sauce, plus more for serving",
        "1 pound shredded smoked mozzarella (about 4 cups)",
        "1/2 cup coarsely chopped pickled jalapeños",
        "1 cup store-bought or homemade vinegary slaw",
        "1/4 cup finely chopped white onion",
        "2 tablespoons cilantro leaves with tender stems",
        "4 cups marinara sauce, drained in a paper towel-lined colander",
        "6 ounces sliced pepperoni",
        "6 ounces Canadian bacon, cubed",
        "10 ounces fresh Italian sausage (about 3 links), casing removed, crumbled, cooked",
        "1/2 cup chopped green bell pepper",
        "1/2 cup chopped orange bell pepper",
        "1/2 cup chopped red bell pepper",
        "1/2 cup chopped yellow bell pepper",
        "1 pound grated mozzarella, (about 4 cups)",
        "1 1/2 ounces finely grated Pecorino Romano (about 1/2 cup)",
        "1/4 cup black olives, pitted, coarsely chopped",
        "1/2 teaspoon crushed red pepper flakes",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried oregano",
        "2 tablespoons basil leaves, torn",
        "4 cups shredded rotisserie chicken (from about a 3-pound rotisserie chicken)",
        "1/2 cup buffalo wing sauce (such as Frank's), plus more for serving",
        "13 ounces shredded Colby or Colby-Jack cheese (about 4 cups)",
        "4 ounces crumbled blue cheese (about 2/3 cup)",
        "1 small red onion, thinly sliced",
        "1 stalk celery with leaves, thinly sliced",
        "2 pickled pepperoncini peppers, seeded, sliced",
        "2 cups store-bought or homemade queso dip",
        "1 crispy tostada bowl or taco salad shell",
        "1 (18x26”) or 2 (13x18”) baking sheets, lined with foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Super Bowl",
        "Entertaining",
        "Party",
        "Hors D'Oeuvre",
        "Chicken",
        "Grill/Barbecue",
        "Tortillas",
        "Cheese",
        "Appetizer",
        "Pizza",
        "Potato",
        "Spinach",
        "Artichoke",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Epi's 50-Ingredient Super Bowl Nachos",
    "url": "http://www.epicurious.com/recipes/food/views/epis-50-ingredient-super-bowl-nachos"
}
