{
    "directions": [
        "Place escarole in bowl. Drizzle with 2 tablespoons oil; sprinkle with 1 teaspoon salt and pinch of ground black pepper. Let stand 5 minutes.",
        "Heat large skillet over high heat. Cook escarole until browned and wilted, about 6 minutes; turn and cook until tender, about 3 minutes. Transfer to cutting board and cool. Cut off root end and any blackened pieces from escarole and discard, then coarsely chop escarole.",
        "Whisk 4 tablespoons oil, vinegar, minced garlic, and 1/2 teaspoon salt in medium bowl. Season with pepper. Add escarole and toss to coat; let stand at least 15 minutes and up to 30 minutes.",
        "Preheat oven to 400°F. Brush bread slices on 1 side with additional olive oil. Place oiled side up on baking sheet and bake until golden, about 6 minutes. Rub bread with halved garlic.",
        "Meanwhile, cook bacon in large skillet over medium-high heat until brown but not crisp.",
        "Place 2 crostini on each of 4 plates. Divide escarole among crostini; top each with 1 bacon piece and 1 cheese slice. Sprinkle with salt and black pepper. Top each with 1 teaspoon mostarda.",
        "A sweet-tart Italian condiment made of fruit preserved in syrup, mostarda contains only a bit of mustard and is served like a chutney with savory foods. You'll find it at some supermarkets, Italian markets, specialty foods stores, and cheese stores. Burrata, mozzarella filled with cream and curds, is available at some supermarkets, Italian markets, and cheese stores."
    ],
    "ingredients": [
        "1 medium head of escarole (about 13 ounces), halved lengthwise",
        "6 tablespoons extra-virgin olive oil, divided, plus additional for brushing",
        "1 1/2 teaspoons coarse kosher salt, divided",
        "Freshly ground black pepper",
        "1 tablespoon plus 1 teaspoon red wine vinegar",
        "1 large garlic clove, minced, plus 1 garlic clove, halved",
        "8 bâtarde slices or large baguette slices or four 5x3-inch country-style bread slices, cut in half crosswise",
        "8 thick slices applewood-smoked bacon, halved crosswise",
        "2 8-ounce balls burrata cheese, each cut into 4 slices",
        "8 teaspoons mostarda"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Fruit",
        "Leafy Green",
        "Pork",
        "Appetizer",
        "Bake",
        "Sauté",
        "Quick & Easy",
        "Mozzarella",
        "Bacon",
        "Spring",
        "Escarole",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Escarole and Bacon Crostini with Mostarda",
    "url": "http://www.epicurious.com/recipes/food/views/escarole-and-bacon-crostini-with-mostarda-234119"
}
