{
    "directions": [
        "Whisk together aji panca paste, soy sauce, mirin, ginger, and garlic in a medium bowl. Add pieces of fish and toss to coat. Cover and refrigerate 2 hours.",
        "Combine water, salt, onion, and ginger in a small saucepan. Bring to a boil, reduce heat, and simmer 20 minutes to make a quick broth. Add shrimp and boil 1 minute, then drain immediately. When shrimp are cool enough to handle, remove shells. Season shrimp with salt.",
        "Combine passion fruit juice, rocoto pepper strips, ginger, and sugar in a small saucepan. Bring to a simmer over medium heat. Reduce heat and simmer until mixture is the consistency of honey, about 20 minutes. Remove from heat.",
        "Heat oil in a small skillet over medium heat. Add garlic and sauté until opaque, about 1 1/2 minutes. Add aji panca paste and continue to cook, stirring, for an additional 3 minutes.",
        "Stir aji panca mixture into passion fruit mixture.",
        "Boil fish stock over moderately high heat until reduced by half, about 10 minutes. Add cream, reduce heat, and simmer for an additional 5 minutes. Season with salt and pepper to taste.",
        "Preheat broiler.",
        "Put cream cheese and turmeric in a large bowl. Warm passion fruit juice in a saucepan over moderately low heat, then whisk in agar agar until dissolved. Pour passion fruit juice over cream cheese and whisk until smooth.",
        "Peel one flat side of one mango. Cut 8 pasta-thin slices using a mandoline or sharp knife. Peel and slice other side. Repeat with second mango, for a total of 32 slices. Cut a round from each slice with a 3-inch cutter.",
        "Lay 16 mango rounds on a greased baking sheet and sprinkle with sugar, about 1/2 tablespoon per slice. Broil until sugar melts and browns, about 6 to 7 minutes.",
        "Divide other 16 mango rounds among 4 plates, lining up 4 rounds on one side of each plate. Spread 1 tablespoon cream cheese mixture on each mango slice. Lay 1 cooked shrimp on top of each. Top each ravioli with 1 caramelized mango slice, sugar side up.",
        "Heat 2 to 3 inches oil in a 4-quart heavy pot over moderate heat until thermometer registers 375If using carrots, slice lengthwise with a mandoline into 16 flexible strips. Roll strips into coils and secure with toothpicks. Fry coils in oil until crisp, 1 to 2 minutes. Transfer to paper towels to drain.",
        "Remove fish from refrigerator. Pour flour into a large bowl. Using a fork, transfer pieces of fish to flour and toss to coat. Fry fish in oil until crisp and brown, 3 to 4 minutes. Transfer to paper towels to drain.",
        "Re-warm passion fruit-aji sauce over low heat. Stir in passion fruit juice, 1/2 tablespoon at a time, until sauce is thin enough to drizzle.",
        "Re-warm salsa marina over low heat.",
        "Place 4 fish pieces in a vertical line on each plate, each piece opposite a mango ravioli. Spoon a little salsa marina over each piece of fish. Drizzle 4 horizontal lines of passion fruit-aji sauce across each plate, one line across each row of fish and ravioli. Remove toothpicks from carrot spirals. Arrange 4 spirals in a vertical line down the center of each plate, between fish and ravioli. Sprinkle plates with sea salt and chives, and serve."
    ],
    "ingredients": [
        "1/2 cup aji panca paste",
        "1/4 cup soy sauce",
        "1/4 cup mirin (Japanese sweet rice wine)",
        "1/4 cup minced fresh ginger",
        "4 garlic cloves, minced",
        "4 (6-oz) steaks escolar or swordfish, each steak quartered",
        "1 1/2 quarts water",
        "2 teaspoons salt, plus more to season after boiling",
        "1 onion, quartered",
        "1 inch fresh ginger, sliced into thick coins",
        "16 large shrimp, in shells",
        "1 cup passion fruit juice",
        "2 fresh rocoto chile peppers, seeded and sliced",
        "1/4 cup minced fresh ginger",
        "5 tablespoons sugar",
        "1 teaspoon vegetable oil",
        "4 garlic cloves, minced",
        "1 cup aji panca paste",
        "2 cups fish stock (fresh or frozen)",
        "1/4 cup heavy cream",
        "Salt and pepper",
        "8 oz cream cheese, room temperature",
        "2 tablespoons ground turmeric",
        "1 cup passion fruit juice",
        "1/4 cupagar agar powder (available at health food stores and Asian groceries)",
        "2 firm-ripe mangoes",
        "1/2 cup sugar",
        "About 2 quarts vegetable oil",
        "3 carrots (optional, for garnish)",
        "3 cups all-purpose flour",
        "1-2 tablespoons passion fruit juice",
        "Sea salt (for garnish)",
        "Fresh chives (for garnish)",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Fish",
        "Ginger",
        "Onion",
        "Marinate",
        "Sauté",
        "Cream Cheese",
        "Mango",
        "Shrimp",
        "Hot Pepper",
        "Carrot"
    ],
    "title": "Escolar Fish with Mango and Shrimp Ravioli",
    "url": "http://www.epicurious.com/recipes/food/views/escolar-fish-with-mango-and-shrimp-ravioli-109615"
}
