{
    "directions": [
        "Preheat oven to 325°F. and line 2 large baking sheets with parchment paper.",
        "In a bowl stir together flour, ground espresso beans, cocoa powder, and salt. In another bowl with an electric mixer at low speed beat butter until just smooth. Add sugar and beat until creamy. Beat in egg white, scraping down side of bowl with a rubber spatula occasionally. Gradually beat in flour mixture until dough forms.",
        "Form a level teaspoon of dough into a ball and with your fingertips roll back and forth on a work surface to form a 6-inch-long rope. Form rope into a simple pretzel shape on baking sheet (2 loops with ends meeting in center). Make more cookies in same manner and arrange about 1/2 inch apart.",
        "Bake cookies in batches in lower third of oven until firm when lightly touched, 12 to 15 minutes. Cool cookies on baking sheets on racks 5 minutes and transfer with a spatula to racks to cool completely.",
        "Chop chocolate and in a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Transfer chocolate to a pastry bag fitted with a #3 plain tip (slightly smaller than 1/8 inch).",
        "Pipe thin lines of chocolate over pretzels in a back and forth motion to form stripes. Let chocolate set 30 minutes at cool room temperature. Cookies keep, layered between sheets of wax paper in an airtight container and chilled, 5 days."
    ],
    "ingredients": [
        "Parchment paper for lining baking sheets",
        "1 1/2 cups all-purpose flour",
        "1 tablespoon finely ground espresso beans",
        "1 teaspoon unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup sugar",
        "1 large egg white",
        "4 ounces fine-quality bittersweet chocolate (not unsweetened)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Espresso \"Pretzels\"",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-pretzels-14534"
}
