{
    "directions": [
        "Dissolve the espresso in the boiling water. Set the extract aside to cool to lukewarm or room temperature.",
        "Working with a stand mixer fitted with the paddle attachment, or in a large bowl with a hand mixer, beat the butter, sugar, salt and cinnamon, if you’re using it, together on medium speed for about 3 minutes, scraping down the bowl as needed, until well blended.",
        "Mix in the vanilla and espresso extract on low speed. Turn off the mixer, add the flour all at once and pulse to begin incorporating it, then mix on low speed until the flour almost disappears into the dough. Scrape down the bowl, add the chopped chocolate and mix until evenly distributed. Give the dough a few last turns with a sturdy flexible spatula.",
        "Turn the dough out onto the counter and divide it in half. Shape each half into a disk.\nWorking with one piece of dough at a time, sandwich it between pieces of parchment paper and roll it to a thickness of 1/4 inch. Slide the dough, still sandwiched, onto a baking sheet—you can stack the slabs—and freeze the dough for at least 1 hour, or refrigerate for at least 2 hours.",
        "Center a rack in the oven and preheat it to 325ºF. Butter or spray a regular muffin tin, or two tins, if you’ve got them. Have a 2-inch-diameter cookie cutter at hand.",
        "Working with one sheet of dough at a time, peel away both pieces of paper and put the dough back on one piece of paper. Cut the dough and drop the rounds into the muffin tin(s).",
        "The dough might not fill the molds completely, but it will once baked. Save the scraps from both pieces of dough, then gather them together, re-roll, chill and cut.",
        "Bake the cookies for 18 to 20 minutes, or until they feel firm to the touch and have some color. Transfer the muffin tin(s) to a rack and leave the cookies in the tin(s) for about 10 minutes before carefully lifting them out onto the rack to cool completely.",
        "Continue with the remainder of the dough, if you only baked one sheet, always using cool tins.",
        "For Ringed Espresso-Chocolate Sablés: If you have 2-inch baking rings, use them to cut out the rolled dough. Bake the dough—in the rings—on lined baking sheets just as you would the muffin-tin cookies. Leave the rings in place for at least 20 minutes before lifting them off, rinsing and reusing."
    ],
    "ingredients": [
        "1 1/2 tablespoons instant espresso",
        "1 tablespoon boiling water",
        "2 sticks (8 ounces; 226 grams) unsalted butter, cut into chunks, at room temperature",
        "2/3 cup (80 grams) confectioners’ sugar",
        "1/2 teaspoon fine sea salt",
        "Pinch ground cinnamon (optional)",
        "3/4 teaspoon pure vanilla extract",
        "2 cups (272 grams) all-purpose flour",
        "4 ounces (113 grams) bittersweet chocolate, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dorie Greenspan",
        "Chocolate",
        "Christmas",
        "Edible Gift",
        "Coffee",
        "Bake"
    ],
    "title": "Espresso Chocolate Sablés",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-chocolate-sables"
}
