{
    "directions": [
        "Pour 5 teaspoons cold water in bowl; sprinkle gelatin over. Let stand until softened, about 10 minutes.",
        "Bring milk to boil in heavy medium saucepan. Whisk yolks and sugar in medium bowl. Gradually whisk in hot milk. Return mixture to same saucepan. Stir over low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 4 minutes (do not boil). Remove from heat. Add gelatin mixture and stir until melted. Pour custard into large bowl. Mix 1/4 cup hot water and espresso powder in small bowl to blend. Stir espresso mixture and vanilla into custard. Refrigerate until cool but not set, stirring occasionally, about 45 minutes.",
        "Spray eight 3/4-cup custard cups with vegetable oil spray. Beat cream in another large bowl until stiff peaks form. Fold whipped cream into custard in 2 additions. Fold in crushed cookies. Divide mixture among prepared cups. Cover and refrigerate until set, at least 4 hours or overnight.",
        "Whisk all ingredients in small bowl until smooth. (Bavarois and sauce can be prepared 1 day ahead. Keep bavarois refrigerated. Cover sauce separately and refrigerate.)",
        "Run small knife around sides of cups to loosen bavarois. Unmold bavarois onto plates. Spoon sauce around each and serve immediately."
    ],
    "ingredients": [
        "5 teaspoons cold water",
        "1 1/2 teaspoons unflavored gelatin",
        "1 cup whole milk",
        "5 large egg yolks",
        "1/2 cup sugar",
        "1/4 cup hot water",
        "4 teaspoons instant espresso powder",
        "2 teaspoons vanilla extract",
        "Nonstick vegetable oil spray",
        "1 cup chilled whipping cream",
        "1 1/2 cups amaretti cookies or Italian almond macaroons, crushed",
        "3/4 cup whipping cream",
        "1/2 cup mascarpone cheese",
        "3 tablespoons powdered sugar",
        "1 1/2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Dairy",
        "Dessert",
        "Chill",
        "Kidney Friendly",
        "Peanut Free"
    ],
    "title": "Espresso and Amaretti Bavarois with Mascarpone Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-and-amaretti-bavarois-with-mascarpone-cream-sauce-1282"
}
