{
    "directions": [
        "Preheat oven to 325°F. and butter a 9-inch springform pan.",
        "In a bowl stir together wafer crumbs and butter. Press mixture onto bottom and 1 inch up side of pan. Bake crust in middle of oven 10 minutes and cool in pan on a rack.",
        "When crust is cool, wrap pan in foil by putting in middle of am 18-inch square of heavy-duty foil and crimping foil around bottom and up side of pan to secure.",
        "In a large bowl with an electric mixer beat eggs with sugar until light and fluffy. Add cream cheese and beat until smooth. Sift cornstarch into mixture and add 1 teaspoon vanilla and sour cream. Beat filling until smooth and transfer 2 cups to a small bowl.",
        "In a small cup stir together espresso powder and remaining tablespoon vanilla, stirring until espresso powder is dissolved. Stir espresso mixture into filling in small bowl.",
        "Add chocolate to filling in large bowl, stirring until combined well, and fold in whipped cream. Pour chocolate filling into crust. Spoon espresso filling evenly over chocolate filling and spread to form an even layer, being careful not to mix layers.",
        "Put springform pan in a larger shallow baking pan and pour enough hot water to reach halfway up side of springform pan. Bake cheesecake in middle of oven 1 1/2 hours. Turn off oven and let cheesecake stand 15 minutes with oven door closed. Transfer cheesecake in pan to a rack and cool completely. Chill cheesecake, covered, at least 1 day and up to 2. Run a thin knife around edge of pan and remove side.",
        "Garnish cheesecake with chocolate curls. To serve, cut cheesecake with a sharp knife dipped in hot water."
    ],
    "ingredients": [
        "1 1/2 cups finely ground chocolate wafers (about 26)",
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "4 large eggs",
        "3/4 cup sugar",
        "1 1/2 pounds cream cheese, softened",
        "2 tablespoons cornstarch",
        "1 tablespoon plus 1 teaspoon vanilla extract",
        "1 cup sour cream",
        "2 tablespoons instant espresso powder",
        "12 ounces fine-quality bittersweet chocolate (not unsweetened), melted and cooled",
        "1/2 cup chilled heavy cream, whipped into soft peaks",
        "Garnish: bittersweet and milk chocolate curls"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cream Cheese",
        "Chill",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Espresso Chocolate Cheesecake Harris",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-chocolate-cheesecake-harris-14248"
}
