{
    "directions": [
        "Preheat oven to 350°F. Generously butter bottom and sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Wrap outside of pan with double layer of foil. Finely grind cookies, hazelnuts, sugar and cinnamon in processor. Add butter; process until moist clumps form. Press crumb mixture onto bottom and up sides of pan. Chill while preparing filling.",
        "Using electric mixer, beat cream cheese in large bowl until smooth. Add sugar and beat until well blended. Add eggs 1 at a time, beating just until blended and scraping down sides of bowl after each addition. Beat in sour cream and 1/2 cup cream. Stir espresso powder and 2 tablespoons warm water in small bowl until powder dissolves. Add to filling and beat until blended. Beat in vanilla. Stir in nuts.",
        "Pour filling into prepared pan. Place pan in large baking pan. Pour enough hot water into baking pan to come halfway up sides of springform pan. Bake cake until top is puffed and center is almost set, about 1 hour 15 minutes. Turn off oven; open door slightly. Let cake stand in oven with door ajar 1 hour. Remove pan from water; transfer to rack. Cool. Wrap in foil and chill overnight. (Can be made 3 days ahead. Keep chilled).",
        "Run small knife around sides of pan to loosen cheesecake. Remove pan sides. Beat 2/3 cup cream in medium bowl until stiff peaks form. Spoon whipped cream into pastry bag fitted with large star tip; pipe around top edge of cake. Garnish with chocolate-covered espresso beans."
    ],
    "ingredients": [
        "8 1/2 ounces butter biscuit cookies",
        "1/2 cup hazelnuts, toasted, husked",
        "2 tablespoons sugar",
        "1 teaspoon ground cinnamon",
        "5 tablespoons unsalted butter, melted",
        "2 pounds cream cheese, room temperature",
        "1 1/4 cups sugar",
        "4 large eggs",
        "1 cup sour cream",
        "1/2 cup plus 2/3 cup chilled whipping cream",
        "3 tablespoons instant espresso powder",
        "2 tablespoons warm water",
        "2 teaspoons vanilla extract",
        "3/4 cup hazelnuts, toasted, husked, coarsely chopped",
        "Chocolate-covered espresso beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Mixer",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Hazelnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Espresso-Hazelnut Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-hazelnut-cheesecake-1213"
}
