{
    "directions": [
        "In a medium saucepan, cook the butter, sugar and corn syrup together over medium heat, stirring occasionally with a large wooden spoon. Once the butter is melted, remove from the heat and add the almonds, flour, cream, espresso powder, vanilla and salt. Mix well, and allow to cool at room temperature for 20 minutes.",
        "Preheat the oven to 350 F. Line 2 cookie sheets with parchment paper or silicone baking mats. (Because Florentines spread so much, you will only be able to bake a few cookies at a time, so the pans will be used multiple times.)",
        "Using a small cookie scoop or 2 tablespoons, spoon 6 mounds of dough on each sheet, spaced evenly. Bake until golden amber, 10 to 12 minutes.",
        "Allow the Florentines to cool on the cookie sheets for 3 minutes, then remove them using a thin spatula. To make bowls, place them on top of inverted glasses, and press down gently to mold. For taco shells, drape over a rolling pin. For cigars, gently wrap around the handle of a wooden spoon. For sandwiches, lay them flat on a cutting board or countertop. Cookies will hold their shapes after they've cooled completely. Continue baking cookies in batches. (It is not necessary to cool the baking sheets completely in between.)",
        "Cookies can be stored in an airtight container for 2 weeks, or stored in the freezer for 3 months."
    ],
    "ingredients": [
        "1 1/2 sticks (12 tablespoons) unsalted butter",
        "1 3/4 cups sugar",
        "1/2 cup light corn syrup",
        "4 cups slivered almonds",
        "1 cup all-purpose flour",
        "1/2 cup heavy cream",
        "2 tablespoons instant espresso powder",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Cookie",
        "Coffee Recipes",
        "Dessert"
    ],
    "title": "Espresso Florentines",
    "url": "http://www.foodnetwork.com/recipes/espresso-florentines"
}
