{
    "directions": [
        "Preheat oven to 350°F.",
        "Place the cookies in a small bowl, drizzle the butter over them, and stir, making sure the crumbs are evenly coated with butter.",
        "Place the cookie crumbs in an ungreased 9-inch spring-form pan. With your hands, pat and spread the crumbs evenly over the bottom and about 2 inches up the sides of the pan. Bake in the center of the oven for 5 minutes. Remove and set aside to cool to room temperature.",
        "Lower the oven temperature to 200°F.",
        "Place the cream cheese and sugar in the bowl of an electric mixer and, with the whisk attachment, beat on high until smooth. Add the espresso grounds and mix until incorporated.",
        "Add the eggs one at a time, beating until each is completely incorporated. Add the egg yolk.",
        "Add the coffee mixture, vanilla, and flour. Mix until smooth and all ingredients are well incorporated.",
        "Pour the filling into the cooled crust and bake in the center of the oven for a few hours&151;;at least two hours, and maybe as long as four hours.",
        "You can check for doneness by giving the pan a little shake. If it wobbles like it's still very liquid in the center, keep going. This could take hours. But I'm betting you want a cheesecake with a creamy-smooth consistency and no cracks. So just wait. If you give the cheesecake a shimmy and it jiggles just a little in the middle but otherwise seems nice and firm, turn off the oven but leave the cheesecake inside to cool slowly. Then remove the cheesecake from the oven and set aside to cool completely in the pan.",
        "Unmold the cheesecake and refrigerate, uncovered, for at least 3 hours before serving."
    ],
    "ingredients": [
        "2 cups chocolate wafer cookies or Oreos, processed until very fine",
        "1/2 pound (2 sticks) unsalted butter, melted",
        "1 1/4 pounds cream cheese, softened",
        "3/4 cup sugar",
        "1/4 cup fresh espresso grounds (don't use soggy, used grounds. Grind fresh beans into a fine powder and add this directly to the batter.)",
        "3 large eggs plus 1 egg yolk",
        "1 cup brewed coffee",
        "1 tablespoon instant espresso added to the coffee",
        "1/2 teaspoon vanilla extract",
        "1 1/2 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Coffee",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Vanilla",
        "Spring",
        "Party",
        "Potluck",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Espresso Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/espresso-cheesecake-358278"
}
