{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Butter a 2-quart baking dish liberally.",
        "Peel parsnips, reserving peelings for broth. Slice into 1/8-inch rounds. Arrange 1/3 of the parsnip slices in a single, overlapping layer in the prepared baking dish. Sprinkle 1/3 of the Parmigiano cheese over the top. Repeat with remaining parsnips and Parmigiano cheese.",
        "Heat 1 tablespoon butter in a large skillet over medium heat. Add celery, 1/2 of the leeks, 1 clove garlic, and ginger pieces. Cook until softened, about 5 minutes. Add parsnip peelings; season with salt, pepper, and nutmeg. Add 2 tablespoons water; cook and stir until water is completely absorbed and mixture turns pale brown, about 5 minutes more. Continue to cook and stir, adding water as needed, until well-browned, 8 to 10 minutes more.",
        "Pour remaining water over celery mixture; add bay leaves, 1 sprig rosemary, and Parmigiano rind to skillet. Increase heat to high; bring liquid to a boil. Lower heat, cover, and simmer until reduced to about 1 cup broth, 20 to 30 minutes. Season with salt, pepper, and nutmeg. Strain broth through a fine sieve, pressing solids to extract as much liquid as possible.",
        "Heat remaining butter in a saucepan over medium heat; add remaining leeks, remaining garlic, and several rosemary leaves. Cook until softened, about 5 minutes. Add reserved broth; cook and stir until most liquid has evaporated and mixture is pale brown, 10 to 12 minutes. Stir in cream, salt, pepper, and nutmeg to taste; cook and stir until hot, about 3 minutes. Pour into prepared baking dish to 3/4 of the way up parsnip layers.",
        "Bake in preheated oven until parsnips are soft, cream mixture is thickened and bubbly, and top is golden brown, 45 to 60 minutes. Cool until gratin is set, about 10 minutes. Garnish with more nutmeg and rosemary leaves."
    ],
    "ingredients": [
        "1/4 cup butter, or as needed",
        "2 pounds parsnips",
        "1 cup freshly grated Parmigiano-Reggiano cheese",
        "2 ribs celery, chopped",
        "2 leeks, chopped and divided",
        "3 cloves garlic, crushed and divided",
        "2 slices fresh ginger root",
        "sea salt and freshly ground black pepper to taste",
        "1/2 teaspoon freshly grated nutmeg, or to taste",
        "3 cups water",
        "2 bay leaves",
        "2 sprigs fresh rosemary leaves, divided",
        "1 (3 ounce) piece of Parmigiano-Reggiano rind",
        "2 cups heavy whipping cream, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Essential Parsnip Gratin",
    "url": "http://allrecipes.com/recipe/245847/essential-parsnip-gratin/"
}
