{
    "directions": [
        "Place a large cast iron skillet in the oven. Preheat oven to 375 degrees F (190 degrees C).",
        "Combine ground beef, Italian bread crumbs, noodle soup mix, 1/2 the tomato sauce, eggs, onion, ketchup, cracker crumbs, 1 tablespoon Worcestershire sauce, barbeque sauce, steak sauce, salt, 1 1/2 teaspoons black pepper, 1 teaspoon garlic powder, and 1/2 teaspoon onion powder in a large bowl; mix well.",
        "Mix remaining tomato sauce, 1 tablespoon Worcestershire sauce, 1/2 teaspoon black pepper, 1/2 teaspoon garlic powder, 1/2 teaspoon onion powder, and cayenne pepper in a small bowl until topping is smooth.",
        "Remove skillet from the oven. Place ground beef mixture in skillet, smoothing the top. Spread topping over beef.",
        "Bake in the preheated oven until beef is mostly cooked through, about 1 hour 30 minutes. Remove from oven and drain off grease. Return to the oven and continue cooking until meatloaf juices run clear and an instant-read thermometer inserted into the center reads at least 160 degrees F (70 degrees C), about 1 hour more.",
        "Remove meatloaf from oven and allow to cool for 15 minutes before serving."
    ],
    "ingredients": [
        "4 1/2 pounds ground beef",
        "1 1/2 cups Italian bread crumbs",
        "2 (4.5 ounce) packages noodle soup mix (such as Lipton® Soup Secrets®)",
        "1 (8 ounce) can tomato sauce (such as Hunt's®), divided",
        "4 eggs",
        "1 yellow onion, chopped",
        "1/2 cup ketchup",
        "1/2 (4 ounce) packet saltine crackers, crumbled",
        "2 tablespoons Worcestershire sauce, divided",
        "1 tablespoon barbeque sauce",
        "2 teaspoons steak sauce (such as A1®)",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper, divided",
        "1 1/2 teaspoons garlic powder, divided",
        "1 teaspoon onion powder, divided",
        "1/2 teaspoon cayenne pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ethan's \"Hungry Man's Cast Iron\" Meatloaf",
    "url": "http://allrecipes.com/recipe/246398/ethans-hungry-mans-cast-iron-meat/"
}
