{
    "directions": [
        "Mix the yeast, water, and sugar together in a large bowl, stir to dissolve the sugar, and let the mixture stand until a creamy layer forms on top, about 5 minutes. Stir in the oil, and sprinkle the yeast mixture with 2 tablespoons of salt, 2 tablespoons of poppy seeds, 2 tablespoons of dried onion, 1 tablespoon of dried garlic, garlic powder, and onion powder. Add the flour a cup at a time up to 6 cups, then add more by half-cups if needed to make an elastic but not sticky dough.",
        "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Form the dough into a compact round shape, and place in an oiled bowl. Turn the dough over several times in the bowl to oil the surface of the dough, cover the bowl with a cloth, and let rise in a warm area until doubled in size, about 1 hour.",
        "Line 2 baking sheets with parchment paper. Cut the dough into 2 equal size pieces. To make 3-strand braided loaves, cut each piece into 3 pieces. Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Place the loaves on the prepared baking sheets. Cover the loaves, and let them rise in a warm place for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Mix sesame seeds, kosher salt, 1/2 teaspoon of poppy seeds, 1/2 teaspoon of dried onion, and 1/2 teaspoon of dried garlic in a small bowl. Brush the loaves with beaten egg, and sprinkle with the seed mixture.",
        "Bake in the preheated oven until the loaves are cooked through and golden brown, 45 to 60 minutes. Check for doneness after 45 minutes of baking time."
    ],
    "ingredients": [
        "3 tablespoons active dry yeast",
        "2 1/2 cups warm water (110 degrees F/45 degrees C)",
        "3/4 cup white sugar",
        "1/2 cup vegetable oil",
        "2 tablespoons salt",
        "2 tablespoons poppy seeds",
        "3 tablespoons dried minced onion",
        "1 tablespoon dried minced garlic",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "6 cups all-purpose flour, or more if needed",
        "1 teaspoon sesame seeds (optional)",
        "1/2 teaspoon kosher salt (optional)",
        "1/2 teaspoon poppy seeds",
        "1/2 teaspoon dried minced onion",
        "1/2 teaspoon dried minced garlic",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Everything Challah",
    "url": "http://allrecipes.com/recipe/115000/everything-challah/"
}
