{
    "directions": [
        "To make the dal, in a medium heavy saucepan, cover the dal with water. Swish the lentils around with your hand, then drain the water through a fine-mesh sieve. Return any dal from the sieve to the saucepan and repeat, washing, agitating, and draining, until the water runs absolutely clear. It will probably take 7 to 10 changes of water. Pour the 3 cups (710 ml) of water into the pot to cover the lentils. Bring to a boil over medium-high heat, skim any scum that rises to the surface, then lower the heat to maintain a simmer. Add the turmeric and cook until the dal is quite creamy, 45 to 60 minutes. Stir the dal regularly as it simmers or it can catch at the bottom of the pan and burn. If the dal starts to look dry before the lentils are cooked, add hot water (from the tap is fine). Season well with salt.",
        "About 20 minutes before the dal is done, make the tarka. Melt the ghee over low heat. Fry the cumin seeds for maybe 1 minute, until sizzling and fragrant. Add the onion and chile and cook, stirring, until the onion is very soft and translucent, 15 minutes. When the dal is ready, tip the tarka over the dal, stir to partially combine, then sprinkle the cilantro on top. Serve right away with lime wedges and naan or over rice.",
        "Melt 3 tablespoons ghee over low heat, then add 1/2 teaspoon cumin seeds and 1/2 teaspoon fennel seeds. Fry for 1 minute. Add 1 minced onion and 3 minced garlic cloves and cook for 10 minutes, stirring often. Scrape in 1 teaspoon grated ginger and cook to take away some of its rawness, about 1 minute. Stir in 2 small tomatoes that have been diced, 1 or 2 green chiles split lengthwise, and 2 curry leaves (optional). Fry until the tomato starts to break up, 5 to 7 minutes more. Stir most of the mixture into the cooked dal and let simmer for 5 minutes. Check for seasoning, then tip the remaining tarka over the dal. Garnish with chopped cilantro."
    ],
    "ingredients": [
        "1 cup (225 g) moong dal (split yellow lentils)",
        "3 cups (710 ml) water",
        "1/2 teaspoon ground turmeric",
        "Medium-grain kosher salt",
        "2 tablespoons ghee or unsalted butter",
        "1 teaspoon cumin seeds",
        "1 small onion, minced",
        "1 or 2 fresh or dried whole red chiles",
        "Leaves picked from a small bunch of cilantro",
        "Fresh lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lentil",
        "Soup/Stew",
        "Dinner",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Everyday Yellow Dal",
    "url": "http://www.epicurious.com/recipes/food/views/everyday-yellow-dal"
}
