{
    "directions": [
        "Coat a large saute pan with olive oil, add the onions and bring to a medium-high heat. Season the onions generously with salt and cook for about 5 to 7 minutes. The onions should be very soft and aromatic but have no color. Add the garlic and the crushed red pepper and saute for another 1 to 2 minutes. Turn off heat and allow to cool.",
        "In a large bowl combine the meats, eggs, Parmigiano, parsley and bread crumbs. It works well to squish the mixture with your hands. Add the onion mixture and season generously with salt and squish some more. Add the water and do 1 final really good squish. The mixture should be quite wet. Test the seasoning of the mix by making a mini hamburger size patty and cooking it. The mixture should taste really good! If it doesn't it is probably missing salt. Add more. Add more anyway.",
        "Preheat the oven to 350 degrees F.",
        "Shape the meat into desired size. Some people like 'em big some people like 'em small. I prefer meatballs slightly larger than a golf ball. Coat a large saute pan with olive oil and bring to a medium-high heat. Brown the meatballs on all sides. Place them on a cookie sheet and bake them in the preheated oven for about 15 minutes or until the meatballs are cooked all the way through. If using right away, add them to your big pot of marinara sauce. If not using right away, they can be frozen for later use. Serve with pasta and sauce or just eat them straight out of the pot! YUM!",
        "Coat a large saucepot with olive oil and add the pancetta. Bring the pot to a medium-high heat and cook the pancetta for 4 to 5 minutes. Add the onions, season generously with salt and stir to coat with olive oil. Cook the onions for 6 to 7 minutes stirring frequently. The onions should become very soft and aromatic but have no color. Add the garlic and cook for another 2 to 3 minutes stirring frequently.",
        "Pass the tomatoes through the food mill. Be sure to pass all of the pulp through the holes leaving only the stems and the seeds, and be sure to scrape the pulp off of the bottom of the food mill. That's all of the big money stuff! Add the tomatoes to the pot and rinse out 1 of the empty tomato cans with water and add that water to the pot (about 2 to 3 cups). Season generously with salt and TASTE IT!!!! Tomatoes take a lot of salt. Season in baby steps and taste every step of the way. Cook the sauce for 2 to 3 hours, stirring occasionally and tasting frequently.",
        "Use the sauce right away on pasta or for any other tomato sauce need. This sauce can also be cooled and stored in the refrigerator for a few days and freezes really well.",
        "Yield: 2 quarts"
    ],
    "ingredients": [
        "Extra-virgin olive oil",
        "1 large onion, 1/4-inch dice",
        "Salt",
        "2 cloves garlic, smashed and chopped",
        "Pinch crushed red pepper",
        "1/2 pound ground beef",
        "1/2 pound ground veal",
        "1/2 pound ground pork",
        "2 large eggs",
        "1 cup grated Parmigiano",
        "1/4 cup finely chopped fresh Italian parsley leaves",
        "1 cup breadcrumbs",
        "1/2 cup water",
        "Marinara Sauce, recipe follows",
        "1/4 cup extra-virgin olive oil",
        "1/4 pound diced pancetta",
        "2 large Spanish onions, cut into 1/4-inch dice",
        "Kosher salt",
        "4 large garlic cloves, smashed and chopped",
        "4 (28-ounce) cans Italian plum San Marzano tomatoes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Italian Meatball",
        "Italian",
        "Meatballs",
        "Beef",
        "Meat",
        "Onion Recipes",
        "Vegetable",
        "Pork",
        "Veal",
        "Tomato",
        "Sauteing Recipes"
    ],
    "title": "Excellent Meatballs",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/excellent-meatballs-recipe"
}
