{
    "directions": [
        "Combine the garlic, ginger, chiles and 3 tablespoons kosher salt in a food processor and process to a fine paste; transfer the marinade to a large bowl. Using a paring knife, pierce each chicken wing two or three times through the skin then add to the marinade, tossing to coat evenly. Cover the bowl with plastic wrap and refrigerate for at least 2 hours, or preferably overnight.",
        "Meanwhile, toast the coconut in a medium skillet over medium heat, stirring often until golden, 4 to 5 minutes. Transfer the coconut to a bowl and let cool.",
        "Make the raita: Combine the cucumber and 1 teaspoon salt in colander set over a bowl, toss to combine and let stand for 30 minutes. Use your hands to squeeze as much moisture as possible from the cucumbers, then transfer them to a bowl. Stir in the yogurt, cilantro, lime zest and juice. Season the raita with more salt and pepper then cover with plastic wrap and refrigerate until ready to use, up to 2 days. Stir before serving.",
        "Put the chickpea flour in a large bowl. Using tongs, remove half the wings from the marinade and toss with the flour to coat evenly. Transfer the wings to a wire rack set over a baking sheet and repeat the dredging process with the remaining wings. Discard any leftover chickpea flour.",
        "Heat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 350 degrees F. Working in 2 batches, fry the wings, turning occasionally, until golden brown and cooked through, 16 to 18 minutes per batch. Use a slotted spoon to transfer the wings to a large bowl and sprinkle with salt. (Make sure the oil returns to the proper temperature between batches.)",
        "Toast the mustard and coriander seeds in a medium skillet over medium heat, swirling the pan until the mustard seeds begin to pop and the spices are fragrant, 2 to 3 minutes. Stir in the turmeric, cook for 10 seconds, then stir in the butter. Heat until the butter melts and the spices begin to sizzle, about 1 minute. Pour the butter and spices over the chicken wings, toss to coat, then transfer to a serving platter. Add the toasted coconut to the seasonings left in the large bowl, then sprinkle over the wings. Serve immediately with the raita on the side."
    ],
    "ingredients": [
        "2 heads garlic, cloves separated and peeled",
        "One 8-inch piece ginger (about 6 ounces), peeled and thinly sliced",
        "10 serrano chiles (about 4 ounces), stems removed (remove seeds for less heat)",
        "Kosher salt",
        "4 pounds chicken wings, separated into flats and drummettes",
        "1 cup sweetened shredded coconut",
        "1 cucumber, grated on the large holes of a box grater",
        "1 cup plain whole-milk yogurt (not Greek)",
        "2 tablespoons finely chopped cilantro",
        "Finely grated zest and juice of 1 lime",
        "Freshly ground pepper",
        "Vegetable oil, for frying",
        "3 cups chickpea flour",
        "1 tablespoon whole brown mustard seeds",
        "1 tablespoon whole coriander seeds",
        "1/2 teaspoon ground turmeric",
        "1 stick (8 tablespoons) unsalted butter, diced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Indian Recipes",
        "Chicken Wing",
        "Dairy Recipes",
        "Chicken",
        "Poultry Recipes",
        "Appetizer",
        "Main Dish Recipes"
    ],
    "title": "Extra-Crispy Indian Spiced Chicken Wings",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/extra-crispy-indian-spiced-chicken-wings"
}
