{
    "directions": [
        "In a medium bowl, stir together the flour, sugar, baking powder, and salt. Cut in butter using a pastry blender, or pinching between your fingers. Add egg, and mix until a dough forms. It may take a couple of minutes of mixing. When the dough starts to hold together, turn it out onto a floured surface and knead briefly. Shape dough into a long roll, wrap, and set aside.",
        "Place the figs, almonds, apricot preserves, raisins, orange peel, chocolate, rum, and cinnamon into a food processor or blender. Process until finely chopped. If the fruit is hard, it may be soaked in boiling water to soften for 15 minutes before processing.",
        "Preheat the oven to 350 degrees F (175 degrees C). In a small bowl, mix together the remaining egg and milk to make an egg wash.",
        "Divide dough into 12 pieces. On a lightly floured surface, roll each piece out into a 3x12 inch rectangle.  Brush the strips of dough lightly with egg wash. Place a strip of the fruit mixture lengthwise down the center of each piece of dough, and fold the edges over. Roll gently to seal. This will make the filled tube of dough a little bit longer. Cut each tube into 3 inch pieces. Make a one inch long slit with a knife down the center of each cut end. Spread the ends out to form an X shape. Place cookies 2 inches apart onto lightly greased cookie sheets.",
        "Bake for 15 to 20 minutes in the preheated oven, or until the edges are golden. Allow cookies to cool on the tray for at least 5 minutes, so they will not be too delicate, before removing to wire racks to cool completely. Dust with confectioners' sugar when cool."
    ],
    "ingredients": [
        "4 cups all-purpose flour",
        "2/3 cup sugar",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 cup butter, cubed",
        "1 egg",
        "3/4 pound dried figs",
        "1/2 cup chopped almonds, toasted",
        "1/3 cup apricot preserves",
        "1/4 cup golden raisins",
        "1/4 cup chopped candied orange peel",
        "1/3 cup semisweet chocolate chips",
        "1/4 cup dark rum",
        "1/2 teaspoon ground cinnamon",
        "1 egg, beaten",
        "2 tablespoons milk",
        "1/2 cup confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "X Cookies",
    "url": "http://allrecipes.com/recipe/50534/x-cookies/"
}
