{
    "directions": [
        "Put warm water in a small bowl, add sugar and yeast and stir until dissolved. Set aside for 5-10 minutes or until it foams.",
        "Blend in the warm milk, yogurt and melted margarine. In a large bowl, mix flour, salt, baking powder and poppy seeds. Pour in the yeast/milk mixture all at once and work it into the flour, using your hands. Continue mixing, adding flour or water as needed, until the mixture leaves the sides of the bowl.",
        "Knead for 6 to 8 minutes or until smooth and elastic. Place in a lightly oiled bowl and turn to coat. Cover with a damp cloth and let stand in a warm place to rise for about 4 hours or until doubled in volume.",
        "Preheat oven to 550 degrees F (285 degrees C) or your oven's highest setting and set a rack in the lower third of the oven. Place a large pizza pan or iron griddle on the rack and preheat. Also preheat the broiler.",
        "Punch the dough down and knead briefly. Divide into six pieces and shape them into balls. Place them on an oiled plate and cover with lightly oiled plastic wrap. Let balls rest for 10 to 15 minutes. Roll out and stretch each ball until it is about 10 inches long and 5 inches wide. Remove the pizza pan from the oven, brush with oil and place one of pieces of bread on it.",
        "Bake at 550 degrees F (285 degrees C) for about 4 to 5 minutes until bread is puffed and has brown spots, then transfer to a wire rack, returning pizza pan to oven to keep hot. Place bread under broiler until  'charcoal' dots appear on the surface.  Wrap finished bread in a towel while baking the remaining loaves. (If your pizza pan is big enough, try baking two loaves at the time.)"
    ],
    "ingredients": [
        "2 tablespoons warm water (110 degrees F/45 degrees C)",
        "1 teaspoon white sugar",
        "1 (.25 ounce) package active dry yeast",
        "1/4 cup warm milk",
        "1/4 cup plain yogurt, room temperature",
        "4 tablespoons melted butter",
        "3 cups unbleached all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon poppy seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Naan Bread",
    "url": "http://allrecipes.com/recipe/15074/naan-bread/"
}
