{
    "directions": [
        "In a large glass, dissolve the dry yeast and 1 teaspoon sugar with 3/4 cup warm water (about 100 degrees F). Let it sit on your counter until it's frothy, about 10 minutes.",
        "Meanwhile, sift the flour, salt, remaining 1 teaspoon of sugar and baking powder into a large, deep bowl.",
        "Once the yeast is frothy, add the yogurt and the olive oil into the glass, and stir to combine. Pour the yogurt mixture into the dry ingredients and add the kalonji and fennel seeds, if using, and gently mix the ingredients together with a fork. When the dough is about to come together, use your hands to mix. It will feel like there isn't enough flour at first, but keep going until it transforms into a soft, slightly sticky and pliable dough. As soon as it comes together, stop kneading. Cover the dough with plastic wrap or a damp tea towel and let it sit in a warm, draft-free place for 2 to 4 hours.",
        "When you're ready to roll, make sure you have two bowls on your counter: one with extra flour in it, and one with water. The dough will be extremely soft and sticky-this is good! Separate the dough into 6 equal portions and lightly roll each one in the bowl of extra flour to keep them from sticking to each other.",
        "Shape the naan. Using a rolling pin, roll each piece of dough into a teardrop shape, narrower at the top than at the bottom. It should be 8 to 9-inches long, 4-inches wide at its widest point and about 1/4-inch thick. Once you've formed the general shape, you can also pick it up by one end and wiggle it; the dough's own weight will stretch it out a little. Repeat this method with the rest of the dough. (If you're making the gluten-free version, you'll have better luck pressing the dough out with your fingertips, than rolling.)",
        "Warm a large cast-iron skillet over high heat until it's nearly smoking. Make sure you have a lid large enough to fit the skillet and have a bowl of melted butter at the ready.",
        "Dampen your hands in the bowl of water and pick up one of your naans, flip-flopping it from one hand to the other to lightly dampen it. Gently lay it in the skillet and set your timer for 1 minute. The dough should start to bubble.",
        "After about 1 minute, flip the naan. It should be blistered and somewhat blackened, don't worry - that's typical of traditional naan! Cover the skillet with the lid and cook 30 seconds to 1 minute more.",
        "Remove the naan from the skillet, brush with a bit of butter and sprinkle with a little coarse sea salt. Place the naan in a tea towel-lined dish. Repeat with the rest of the naans and serve."
    ],
    "ingredients": [
        "1 teaspoon active dry yeast",
        "2 teaspoons sugar",
        "2 cups all-purpose flour, plus more for rolling, see Cook's Note*",
        "1 teaspoon fine sea salt",
        "1/8 teaspoon baking powder",
        "3 tablespoons plain yogurt",
        "2 tablespoons extra-virgin olive oil",
        "1 teaspoon kalonji (nigella seeds), optional, see Cook's Note**",
        "1 teaspoon fennel seeds, optional, see Cook's Note**",
        "Melted butter for slathering on the finished naans",
        "Coarse sea salt for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Baking",
        "Easy Recipes",
        "Indian Recipes",
        "Bread",
        "Dairy Recipes",
        "Vegetable"
    ],
    "title": "Naan: Indian Oven-Baked Flat Bread",
    "url": "http://www.foodnetwork.com/recipes/aarti-sequeira/naan-indian-oven-baked-flat-bread-recipe"
}
