{
    "directions": [
        "Place sardines or kombu in a large Dutch oven or donabe, fill with 6 cups water, and set aside at least 15 minutes or up to 1 hour.",
        "Meanwhile, cook spinach in a medium pot of boiling salted water until just cooked through, about 1 minute. Using a slotted spoon, transfer to paper towels. Gently squeeze water from spinach, then transfer to a cutting board and cut into 2\" slices. Transfer to a plate. Return liquid to a boil, add snow peas, and cook until just cooked through, about 1 minute. Drain and transfer to plate with spinach. Wipe out pot and reserve.",
        "Bring sardine liquid to a simmer over medium-high heat. Using slotted spoon, discard sardines, then reduce heat to medium. Add chicken and simmer until cooked through, about 5 minutes. Add mushrooms, tofu (if using), soy sauce, mirin, and remaining 3/4 tsp. salt. Cook, stirring, until mushrooms are tender, 3–5 minutes.",
        "Meanwhile, cook udon in reserved pot 2 minutes less than package directions.",
        "Bring chicken mixture to a simmer. Drain noodles and add immediately to pot. Add spinach, snow peas, scallions, and fish cake (if using), arranging each into sections and leaving an opening for egg.",
        "Gently beat eggs in a small bowl with a whisk or chopsticks. Pour into broth and cook until just set, about 2 minutes.",
        "Serve soup immediately in pot tableside, portioning into individual bowls."
    ],
    "ingredients": [
        "1/2 cup dried sardines (about 1 ounce), or 1 (5\") piece dried kombu",
        "5 ounces mature spinach (about 3/4 bunch), trimmed",
        "3/4 teaspoon kosher salt, plus more",
        "1/2 cup snow peas",
        "2 boneless, skinless chicken thighs (about 8 ounces), cut into 1\" pieces",
        "7 ounces thinly sliced shiitake, shimeji, or enoki mushrooms, roots trimmed",
        "2 (1/2-ounce) pieces fried tofu (aburaage), cut into 1/4\" slices (optional)",
        "3 tablespoons soy sauce",
        "1 teaspoon mirin",
        "8 ounces udon noodles",
        "1/2 cup sliced scallions",
        "1 1/2 ounces Japanese fish cake, thinly sliced (optional)",
        "2 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Noodle",
        "Chicken",
        "Mushroom",
        "Sardine",
        "Spinach",
        "Tofu",
        "Dinner"
    ],
    "title": "Nabeyaki Udon Soup With Chicken, Spinach, and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/nabeyaki-udon-soup-with-chicken-spinach-and-mushrooms"
}
