{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Spread half the chips out in a large shallow casserole dish or on an ovenproof platter. Top with half the beans, in small spoonfuls, and scatter with half the chiles. Repeat with the remaining chips, beans, and chiles. Sprinkle the top of the nachos with the cheese. Bake until heated through and the cheese melts, about 3 to 5 minutes. Top the nachos with dollops of the sour cream and serve.",
        "Pour the oil into a large heavy-bottomed pot to a depth of about 2 inches. Place a deep-frying thermometer in the pot. Heat the oil over medium heat to 360 degrees F.",
        "Meanwhile, stack the tortillas, and cut the pile into sixths to make chips.",
        "Raise the heat to high. Working in batches, fry the chips, turning them with a skimmer or slotted spoon, until golden brown, about 2 minutes. Using a slotted spoon, transfer the chips to a paper towel-lined pan to drain. (Return the oil to the proper temperature between batches.) Cool and season with salt. Serve.",
        "Preheat the oven to 350 degrees F.",
        "Brush both sides of the tortillas with the oil. Stack the tortillas and cut the pile into sixths to make chips. Spread the chips out in a single layer on two large baking sheets and season with salt. Bake until golden brown and crisp, rotating the baking sheets once, about 12 to 15 minutes. Serve.",
        "In a small bowl, mash two-thirds of the beans with a fork or potato masher. Reserve the whole beans separately.",
        "In a medium skillet, heat the oil over medium-high heat and add the onion. Cook until lightly browned, about 3 to 4 minutes. Add the garlic and cook, stirring for 1 to 2 minutes more. Add the spices and cook until fragrant, about 1 minute more. Add the mashed beans and half the broth and cook, stirring frequently until thickened, about 5 minutes. Add the whole beans and the remaining broth and simmer about 4 to 5 minutes more until thickened but not pasty. Season with the salt and pepper, and stir in the fresh coriander, if desired. Serve."
    ],
    "ingredients": [
        "8 ounces homemade white corn tortilla chips, fried or baked, recipes follow",
        "1 1/2 cups refried beans, warmed, recipe follows",
        "2 poblano chiles, roasted, peeled, seeded, and diced",
        "2 to 4 canned, pickled jalapeno chiles, stemmed and thinly sliced crosswise",
        "1 cup finely shredded Monterey Jack cheese (about 4 ounce)",
        "1/2 cup sour cream",
        "Vegetable oil for frying",
        "12 (6-inch) corn tortillas (preferably white)",
        "Fine salt",
        "Twelve 6-inch corn tortillas (preferably white)",
        "1 tablespoon vegetable oil",
        "Fine salt",
        "One 15 1/2-ounce can pinto beans, drained and rinsed",
        "3 tablespoons extra-virgin olive oil",
        "1/2 medium onion, chopped",
        "4 cloves garlic, minced",
        "1 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1 cup chicken broth, homemade or low-sodium canned",
        "Kosher salt and freshly ground black pepper, to taste",
        "1 tablespoon chopped fresh coriander leaves (cilantro) (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Cheese",
        "Dairy Recipes",
        "Corn Recipes",
        "Vegetable",
        "Monterey Jack Recipes",
        "Beans and Legumes",
        "Jalapeno Recipes",
        "Appetizer",
        "Recipes for Parties",
        "Tailgate Party",
        "Super Bowl"
    ],
    "title": "Nachos",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/nachos-recipe"
}
