{
    "directions": [
        "Line an 8-inch-square baking pan with foil, pressing it into the corners and up the sides; leave an overhang on 2 sides. Butter the foil and dust with flour. Position a rack in the lower third of the oven; preheat to 400 degrees F.",
        "Bring 1 inch water to a gentle simmer in a medium saucepan over medium-low heat. Put the chocolate and 2 sticks plus 2 tablespoons butter in a heatproof bowl; set the bowl over the saucepan (do not let the bowl touch the water). Stir occasionally until melted and smooth. Remove the bowl from the saucepan.",
        "Add the sugar, cocoa and salt to the bowl and stir vigorously with a wooden spoon until smooth. Add the eggs one at a time, beating well between each addition, until the batter is thick and shiny. Add the vanilla, then add 1 cup flour and mix until combined. Spread in the prepared pan.",
        "Bake the brownies until a toothpick inserted into the center comes out with just a few crumbs, about 35 minutes. Remove from the oven and scatter the marshmallows, chocolate chips and peanuts on top. Return to the oven; continue baking until the marshmallows are golden, about 5 more minutes.",
        "Let cool in the pan on a rack, 30 minutes. Lift the brownies out of the pan using the foil and transfer to a cutting board to cool completely before slicing.",
        "Photograph by Lisa Shin"
    ],
    "ingredients": [
        "2 sticks plus 2 tablespoons unsalted butter, plus more for the pan",
        "1 cup all-purpose flour, plus more for dusting",
        "6 ounces bittersweet chocolate, chopped",
        "2 cups sugar",
        "3/4 cup unsweetened cocoa powder",
        "1/2 teaspoon salt",
        "4 large eggs, cold",
        "2 teaspoons vanilla extract",
        "1 cup mini marshmallows",
        "1 cup semisweet chocolate chips",
        "3/4 cup unsalted roasted peanuts"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Baking",
        "Easy Recipes",
        "Brownie",
        "Chocolate"
    ],
    "title": "Brownie Rubble",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/name-this-dish-brownie-recipe"
}
