{
    "directions": [
        "Using an electric mixer on high speed, beat butter, powdered sugar, and vanilla in a medium bowl until light and fluffy, about 4 minutes. Reduce speed to low; add milk, salt, and 2 1/2 cups flour and mix just to combine. Form dough into a 1/2\"-thick disk and wrap in plastic. Chill until firm, at least 1 hour.",
        "Let dough sit at room temperature to soften slightly, about 5 minutes. Roll dough out between 2 sheets of parchment paper until about 1/8\" thick. Cut out rounds with a floured 2 1/2\"-diameter cookie cutter. Cut out a circle in half of the rounds with a 3/4\"-diameter cookie cutter and transfer to 2 parchment-lined baking sheets, spacing 1\" apart.",
        "Whisk egg and 1 teaspoon water in a small bowl and brush tops of cookies with egg wash. Bake cookies, rotating halfway through, until golden brown, 12&endash;15 minutes. Transfer baking sheets to wire racks and let cookies cool.",
        "Combine milk, sugar, and baking soda in a large saucepan; scrape in vanilla seeds and add pod. Bring just to a boil over medium heat, stirring to dissolve sugar. Reduce heat and simmer, whisking occasionally, until mixture is reduced to about 1 1/4 cups (it will darken and separate, with little bits visible), 80&endash;90 minutes. Strain milk jam through a fine mesh sieve into a medium bowl and let cool.",
        "Spoon a small amount of milk jam onto flat side of a cookie without a hole and sandwich with a cookie with a hole. Repeat with remaining cookies and filling. Dust with powdered sugar, if desired."
    ],
    "ingredients": [
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "2/3 cup powdered sugar",
        "2 teaspoons vanilla extract",
        "2 tablespoons whole milk",
        "2 teaspoons kosher salt",
        "2 1/2 cups all-purpose flour",
        "1 large egg",
        "1 quart goat's milk or cow's milk",
        "1 1/4 cups granulated sugar",
        "3/4 teaspoon baking soda",
        "1/2 vanilla bean, halved lengthwise",
        "Powdered sugar (optional; for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Butter"
    ],
    "title": "Nana's Butter Cookies with Milk-Jam Filling",
    "url": "http://www.epicurious.com/recipes/food/views/nanas-butter-cookies-with-milk-jam-filling-51248640"
}
