{
    "directions": [
        "Combine the first six ingredients in a small bowl. Set aside the \"falafel\" spice.",
        "Line a plate with paper towels, Using a mandolin with a safety attachment to protect your fingers, cut the garlic cloves into paper-thin slices. Pour olive oil into a medium-size heavy skillet and heat over medium-high heat. Add the garlic slices and cook until crisp and light golden brown; do not burn or the garlic and oil will be unusable. Remove from the heat. Using a slotted utensil, immediately transfer the garlic chips to the prepared plate to drain. Reserve the garlic-cooking oil.",
        "Add the chilies and 2 tablespoons of the reserved garlic-cooking oil (save the remainder for another use) to a large heavy skillet. Set over medium-high heat. Add the pistachios and sauté for 1 to 2 minutes. Add the \"falafel\" spice and salt and stir until the pistachios are coated with spice and heated through, 3 to 4 minutes. Remove from heat. Transfer the pistachios and chilies to a serving bowl. Add the garlic chips and toss well. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 tablespoon ground cumin",
        "1 tablespoon ground coriander",
        "1 tablespoon dried ground basil",
        "1 tablespoon dried ground marjoram",
        "1 tablespoon dried ground rosemary",
        "2 1/2 teaspoons turmeric",
        "2 cups (300 g) whole peeled garlic cloves",
        "2 cups (475 ml) olive oil",
        "6 dried hot red chilies, such as chilies de árbol or pequin chilies",
        "4 cups (500 g) unsalted pistachios in the shell",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pistachio",
        "Hors D'Oeuvre",
        "Cocktail Party",
        "Nancy Silverton",
        "Spice",
        "Cumin",
        "Coriander",
        "Garlic",
        "Chile Pepper",
        "Passover"
    ],
    "title": "Nancy's Falafel Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/nancys-falafel-pistachios"
}
