{
    "directions": [
        "1. Prepare a medium-hot fire in a charcoal grill with a cover, or preheat a gas grill to medium-high.",
        "2. To make the mayonnaise, combine the ingredients in a small bowl and mix well. Cover and refrigerate until needed.",
        "3. To make the patties, combine the sirloin, Zinfandel, basil, onion, bread crumbs, sun-dried tomatoes, and garlic salt in a large bowl. Handling the meat as little as possible to avoid compacting it, mix well. Divide the mixture into 6 equal portions and form the portions into patties to fit the rolls.",
        "4. When the grill is ready, brush the grill rack with vegetable oil. Toss the moistened basil sprigs directly onto the fire. Place the patties on the rack, cover, and cook, turning once, until done to preference, 5 to 7 minutes on each side for medium. During the last few minutes of cooking, place the rolls, cut side down, on the outer edges of the rack to toast lightly. During the last minute of cooking, top each patty with a cheese slice.",
        "5. To assemble the burgers, spread the mayonnaise over the cut sides of the rolls. On each roll bottom, place a lettuce leaf, a patty, a tomato slice, an onion slice, and a basil sprig. Add the roll tops and serve."
    ],
    "ingredients": [
        "2 pounds ground sirloin",
        "1/4 cup Zinfandel",
        "1/4 cup lightly packed minced fresh basil",
        "1/4 cup minced red onion",
        "1/4 cup fresh Italian bread crumbs",
        "8 sun-dried tomatoes packed in olive oil, finely chopped",
        "2 teaspoons garlic salt",
        "Vegetable oil, for brushing on the grill rack",
        "8 large basil sprigs, moistened with water, for grilling",
        "6 large seeded sandwich rolls, split",
        "6 slices Monterey Jack cheese",
        "6 red leaf lettuce leaves",
        "6 (1/4-inch-thick) large tomato slices",
        "6 paper-thin red onion slices, separated into rings",
        "6 basil sprigs, for serving",
        "2/3 cup mayonnaise",
        "2 tablespoons prepared basil pesto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Tomato",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Mayonnaise",
        "Basil",
        "Meat",
        "Ground Beef",
        "Grill",
        "Grill/Barbecue",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Napa Valley Basil-Smoked Burgers",
    "url": "http://www.epicurious.com/recipes/food/views/napa-valley-basil-smoked-burgers-355970"
}
