{
    "directions": [
        "Pick over crab meat to remove any bits of shell and cartilage and if using lump crab meat lightly shred. Peel and core apple and cut enough into 1/4-inch dice to measure 1/2cup plus 1 tablespoon. Peel and seed tomato and cut enough into 1/4-inch dice to measure 1/3 cup. Reserve 1 tablespoon each diced apple and tomato for sauce and in a bowl combine crab meat, remaining diced apple and tomato, 1 tablespoon chives, 3 tablespoons lemon juice, 1 1/2 tablespoons sour cream, 1 1/2 tablespoons mayonnaise, and 1 1/2 teaspoons curry powder, tossing to combine well. Chill filling.",
        "In a bowl whisk together milk and remaining tablespoons lemon juice, sour cream, and mayonnaise and stir in reserved diced apple and tomato, remaining teaspoon chives, 1/2 teaspoon curry powder, and white pepper and salt to taste. Chill sauce while making tuiles.",
        "Preheat oven to 350°F. In a small saucepan melt butter over moderate heat and cool slightly. In a bowl whisk together flours, sugar, salt, white pepper, and nutmeg and whisk in whites until just combined. Whisk in cream until just combined and whisk in butter until just combined. On a baking sheet spread 2 teaspoons batter in an arc shape. With a pastry brush spread batter into a 5-inch-long arc, about 1 1/2 inches wide. Make 3 more arcs with some of remaining batter in same manner, spacing them about 1 inch apart. Bake tuiles in middle of oven until bubbly, crisp, and golden, 3 to 5 minutes. Carefully transfer tuiles with a thin spatula to a rack to cool and make more tuiles in same manner. (There will be enough batter to make about 26 tuiles, more than you need for the napoleons; leftovers may be used as an hors d'oeuvre.)",
        "Spoon 2 tablespoons filling onto a plate and top with a tuile. Make 2 more layers with 4 tablespoons filling and 2 tuiles. Make 3 more napoleons in same manner. Drizzle sauce around napoleons and garnish with tomato, chives, and curry powder."
    ],
    "ingredients": [
        "3/4 pound peeky-toe or jumbo lump crab meat",
        "1 Granny Smith apple",
        "1 vine-ripened tomato",
        "1 tablespoon plus 1 teaspoon thinly sliced fresh chives",
        "4 tablespoons fresh lemon juice",
        "2 1/2 tablespoons sour cream",
        "2 1/2 tablespoons mayonnaise",
        "2 teaspoons curry powder",
        "2 tablespoons milk",
        "freshly ground white pepper",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup rice flour*",
        "1 tablespoon all-purpose flour",
        "1 1/2 teaspoons sugar",
        "1/2 teaspoon salt",
        "1/8 teaspoon freshly ground white pepper",
        "1/8 teaspoon freshly grated nutmeg",
        "1/3 cup egg whites (from about 3 large eggs)",
        "1/4 cup heavy cream",
        "Garnish: julienne strips of tomato, sliced fresh chives, and curry powder",
        "*available in Latino section of supermarkets and at natural foods stores"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Tomato",
        "Bake",
        "Apple",
        "Crab",
        "Curry",
        "Fall",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Napoleon of Peeky Toe Crab and Apple",
    "url": "http://www.epicurious.com/recipes/food/views/napoleon-of-peeky-toe-crab-and-apple-15621"
}
