{
    "directions": [
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Grease a baking sheet.",
        "Cut the zucchini in half the long way, and scoop out the seeds and pulp, leaving a thick shell of flesh. Brush both halves of the zucchini with about 1 tablespoon of olive oil, and place them, cut sides down, onto the prepared baking sheet. Bake until the zucchini are hot and beginning to release beads of moisture, 5 to 10 minutes. Remove the zucchini from the oven.",
        "Reduce the oven heat to 450 degrees F (230 degrees C).",
        "Heat 2 tablespoons of olive oil in a skillet over medium-low heat, and cook and stir the garlic and shallot until translucent, about 5 minutes. Remove from the heat and let cool.",
        "Place 1 tablespoon of olive oil, the shrimp, diced tomato, mushrooms, 1/4 cup of Parmesan cheese, basil, and the cooked garlic and shallot into a bowl, and stir to mix. Season to taste with black pepper, salt, and garlic powder. Stuff the mixture into the zucchini halves, and sprinkle each zucchini with about 2 tablespoons of Parmesan cheese.",
        "Bake the stuffed zucchini in the preheated oven until the cheese is browned and the filling is cooked through and hot, about 20 minutes."
    ],
    "ingredients": [
        "1 extra large zucchini",
        "1/4 cup olive oil, divided",
        "6 cloves garlic, finely chopped",
        "1 shallot, finely chopped",
        "1/2 pound large shrimp - shelled, deveined, and cut in half",
        "1 large tomato - peeled, seeded and diced",
        "8 cremini mushrooms, quartered",
        "1/4 cup grated Parmesan cheese",
        "8 leaves fresh basil, torn",
        "ground black pepper to taste",
        "kosher salt to taste",
        "garlic powder to taste",
        "1/4 cup grated Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nat's Shrimp and Veggie Stuffed Zucchini",
    "url": "http://allrecipes.com/recipe/204093/nats-shrimp-and-veggie-stuffed-zucch/"
}
