{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line a large baking sheet with aluminum foil. Grease a 2-quart and a 1 1/2-quart round glass baking dish each with 3/4 teaspoon olive oil; drizzle 1 tablespoon of remaining olive oil into bottom of each baking dish.",
        "Bring a large pot of lightly salted water to a boil. Cook macaroni, ziti, farfalle, and radiatore pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 to 10 minutes. Drain.",
        "Arrange sausage slices on foil-lined baking sheet.",
        "Bake sausage in the preheated oven until browned and crisp, 30 to 45 minutes. Lower oven heat to 325 degrees F (165 degrees C).",
        "Beat eggs in a large bowl until foamy, using an electric mixer. Add Pecorino-Romano cheese, salt, and black pepper; continue to beat egg mixture with electric mixer on highest speed until eggs and cheese are blended, 2 to 3 minutes. Stir cooked pasta into eggs and cheese; mixture should be runny and look like pasta is floating in egg mixture. Stir additional beaten eggs and Pecorino-Romano cheese into mixture if more egg mixture is needed.",
        "Ladle spoonfuls of egg-pasta mixture into each casserole, followed by a layer of sausage; continue layering pasta mixture and sausage until all sausage has been used. Top casseroles with final layer of pasta mixture. Drizzle top of each casserole with 1 tablespoon olive oil. Small pieces of pasta should stick out of the egg mixture.",
        "Bake in the oven until casseroles are set in the center, about 1 hour; raise oven heat to 350 degrees F (175 degrees C) and continue baking until the tops of casseroles are browned and crispy, 1 to 1 1/2 more hours."
    ],
    "ingredients": [
        "2 1/2 tablespoons olive oil, divided",
        "1/4 pound elbow macaroni",
        "1/4 pound ziti pasta",
        "1/4 pound farfalle (bow tie) pasta",
        "1/4 pound radiatore pasta",
        "1 pound sweet Italian sausage links, cut into 1/2- inch slices",
        "12 jumbo eggs, or more if needed",
        "1/2 cup shredded Pecorino Romano cheese, or more if needed",
        "salt to taste",
        "1/4 teaspoon freshly ground black pepper, or more to taste",
        "2 tablespoons olive oil, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Naunie's Pastera (Leftover Easter Pasta Bake)",
    "url": "http://allrecipes.com/recipe/231662/naunies-pastera-leftover-easter-pas/"
}
