{
    "directions": [
        "Place pinto beans in a bowl and cover with room-temperature water. Let soak, about 8 hours. Drain.",
        "Transfer drained beans to a large pot; pour in 6 cups water. Cook over medium-high heat, stirring occasionally and adding water if the level gets below 1 inch, until beans are tender, about 1 hour.",
        "Stir thawed chili, cumin, oregano, garlic powder, onion powder, salt, and black pepper into the pot. Continue cooking over medium heat, stirring occasionally, until beans are soft, about 1 hour more.",
        "Combine flour, baking powder, and salt in a large bowl. Pour in hot water gradually, 1/2 cup at a time, and knead until dough is soft but not sticky. Let dough rest, covered, about 30 minutes.",
        "Pinch off a piece of dough the size of a tennis ball; flatten out into a round on a floured surface. Repeat with remaining dough.",
        "Melt lard in a large saucepan or deep-fryer over high heat. Gently lower dough into hot lard and fry, rotating with a fork, until evenly browned, 15 to 20 seconds. Flip dough and fry until second side is golden brown, 15 to 20 seconds more. Drain fry bread on paper towels. Repeat with remaining dough.",
        "Place 1 fry bread on a plate. Cover with chili beans and top with Cheddar cheese, tomatoes, onions, and lettuce."
    ],
    "ingredients": [
        "Chili Beans:",
        "1 pound dried pinto beans",
        "6 cups water, or as needed",
        "16 ounces frozen chili (such as Johnson®), thawed",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons garlic powder",
        "1 1/2 teaspoons onion powder",
        "salt and ground black pepper to taste",
        "Fry Bread:",
        "2 cups all-purpose flour (such as Blue Bird®)",
        "2 tablespoons baking powder",
        "1 tablespoon salt",
        "1/2 cup hot water, or as needed",
        "3/4 cup lard",
        "Toppings:",
        "1 (16 ounce) package shredded Cheddar cheese",
        "2 tomatoes, chopped",
        "2 onions, chopped",
        "2 cups shredded iceberg lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Navajo Tacos",
    "url": "http://allrecipes.com/recipe/247200/navajo-tacos/"
}
