{
    "directions": [
        "Slice 1 garlic clove in half crosswise and set aside; smash remaining garlic cloves with the flat side of a chef’s knife.",
        "Heat 4 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Cook smashed garlic, stirring often, until golden, about 5 minutes. Add onion and fennel and season lightly with salt. Cook, stirring often, until onion is translucent and fennel and onion are browned around the edges, 8–10 minutes. Add lemon zest, rosemary, and 3/4 tsp. red pepper flakes and cook, stirring often, until rosemary is very fragrant, about 3 minutes. Add bay leaves, beans, feta brine (if using; anywhere between 1/2–1 cup is fine), a couple generous pinches of salt, and 8 cups water and bring to a simmer. Partially cover pot, reduce heat to low, and gently simmer stew until beans are creamy and tender all the way through, 60–70 minutes.",
        "Add basil sprigs and olives to stew, then add escarole in batches, letting wilt slightly before adding more; simmer just until escarole is tender, about 3 minutes. (If stew is too thick, add more water to reach desired consistency.) Stir in lemon juice; taste and season with more salt if needed. Pluck out bay leaves; partially cover pot and keep stew warm over low while you make the toast.",
        "Heat broiler. Drizzle 2 Tbsp. oil total over both sides of bread and place on a rimmed baking sheet; season with salt. Broil until bread is golden and toasted, about 2 minutes per side. Let cool slightly, then rub with the cut sides of reserved garlic clove.",
        "To serve, slice toast in half and divide among shallow bowls; ladle stew over. Top with feta, basil leaves, and more red pepper flakes and drizzle with oil.",
        "Stew can be made 3 days ahead. Let cool; cover and chill. Reheat covered over low."
    ],
    "ingredients": [
        "1 head of garlic, cloves separated, divided",
        "6 tablespoons olive oil, divided, plus more for serving",
        "1 medium onion, chopped",
        "1 small fennel bulb, chopped",
        "Kosher salt",
        "1 tablespoon finely grated lemon zest",
        "2 teaspoons finely chopped rosemary",
        "3/4 teaspoon crushed red pepper flakes, plus more for serving",
        "2 bay leaves",
        "2 cups dried navy beans, soaked overnight, drained",
        "8 ounces feta, preferably in brine, brine reserved, cheese crumbled",
        "4 large sprigs basil, plus leaves for serving",
        "1 cup Castelvetrano olives, pitted, torn",
        "1 head of escarole, leaves torn into 2-inch pieces",
        "3 tablespoons fresh lemon juice",
        "4 (1-inch–thick) slices country-style bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stew",
        "Bean",
        "Escarole",
        "Garlic",
        "Fennel",
        "Feta",
        "Olive",
        "Vegetarian",
        "Dinner"
    ],
    "title": "Navy Bean and Escarole Stew With Feta and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/navy-bean-escarole-stew-with-feta-and-olives"
}
