{
    "directions": [
        "Mix corn, cilantro, lime juice, jalapeno, 2 tablespoons cumin, 1 tablespoon onion powder, 1 tablespoon oregano, chopped garlic, and 1/2 teaspoon Himalayan salt together in a bowl until salsa is well mixed.",
        "Mix olive oil and liquid smoke together in a separate bowl; rub onto mushrooms. Season mushrooms with 2 teaspoons cumin, 2 teaspoons oregano, 2 teaspoons garlic powder, 2 teaspoons onion powder, 1 teaspoon black pepper, and 1/2 teaspoon sea salt. Place seasoned mushrooms onto a grill pan with the flat side down. (A grill pan for a countertop induction oven can also be used.)",
        "Place grill pan in the oven and heat oven to 445 degrees F (230 degrees C). (Or turn on a countertop induction oven to Combo 1.) Cook in the oven until tender, 9 to 10 minutes.",
        "Mix refried beans, 1 tablespoon cumin, 1 tablespoon oregano, 1 tablespoon garlic powder, 1 tablespoon onion powder, 1 teaspoon black pepper, and 1/2 teaspoon salt together in a saucepan over medium heat; cook and stir until heated through, about 5 minutes.",
        "Remove grill pan from oven and spoon bean mixture into mushrooms; top with Cheddar cheese.",
        "Return grill pan with mushrooms to oven. Set oven to broil and cook mushrooms until cheese is melted, 30 seconds to 1 minute.",
        "Spoon salsa over mushrooms and top with avocado and tomatoes."
    ],
    "ingredients": [
        "Corn Salsa:",
        "1 (15 ounce) can corn, drained",
        "3 tablespoons chopped fresh cilantro",
        "2 limes, juiced",
        "1/2 jalapeno pepper, chopped",
        "2 tablespoons ground cumin",
        "1 tablespoon onion powder",
        "1 tablespoon dried oregano",
        "1 1/2 teaspoons chopped garlic",
        "1/2 teaspoon Himalayan salt",
        "2 teaspoons olive oil",
        "2 dashes liquid smoke flavoring",
        "3 portobello mushrooms, stems removed",
        "2 teaspoons ground cumin",
        "2 teaspoons dried oregano",
        "2 teaspoons garlic powder",
        "2 teaspoons onion powder",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon sea salt",
        "1 (16 ounce) can refried black beans",
        "1 tablespoon ground cumin",
        "1 tablespoon dried oregano",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "1/2 cup shredded Cheddar cheese",
        "1 avocado, roughly chopped and slightly mashed",
        "1 Roma tomato, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nayza's Mushroom Fiesta Cups",
    "url": "http://allrecipes.com/recipe/255328/nayzas-mushroom-fiesta-cups/"
}
