{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Line 48 muffin cups with paper liners.",
        "Stir both packages of brownie mix with 1 cup vegetable oil, 4 eggs, and 1/2 cup water in a large bowl until evenly combined and smooth.",
        "Mix strawberry cake mix with 1 cup water, 3 eggs, and 1/3 cup vegetable oil in a separate bowl until moistened. Beat with an electric mixer on medium speed for 2 minutes.",
        "Spoon about 2 tablespoons brownie batter into the bottom of each prepared muffin cup.",
        "Top the brownie batter with strawberry cake batter, filling each cup about 2/3 full.",
        "Bake in the preheated oven until the cupcakes spring back when lightly pressed and a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes.",
        "Cool in pans for about 10 minutes before removing to finish cooling on racks.",
        "Beat unsalted butter with an electric mixer on medium-high speed in a bowl until butter is pale and creamy, about 2 minutes.",
        "Beat confectioners' sugar into the butter, about 1/2 cup at a time, beating well after each addition and scraping down sides of bowl as needed. After each addition of confectioners' sugar, raise mixer speed to high to beat as much air as possible into the frosting; reduce speed to low and continue beating until frosting is smooth. Repeat until all confectioners' sugar is incorporated, about 5 minutes of beating time; beat in vanilla extract.",
        "Spread cooled cupcakes with buttercream frosting."
    ],
    "ingredients": [
        "2 (19.8 ounce) packages brownie mix",
        "1 cup vegetable oil",
        "4 eggs",
        "1/2 cup water",
        "1 (18.25 ounce) package strawberry cake mix",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "1 1/2 cups unsalted butter at room temperature",
        "1 (16 ounce) package confectioners' sugar, sifted",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Neapolitan Cupcakes",
    "url": "http://allrecipes.com/recipe/220883/neapolitan-cupcakes/"
}
