{
    "directions": [
        "Remove the dough for the bottom crust from the refrigerator. If necessary, allow it to sit for about 10 minutes or until it is soft enough to roll.",
        "On a floured pastry cloth or between two sheets of lightly floured plastic wrap, roll the bottom crust 1/8 inch thick or less and large enough to cut a 12-inch circle. Transfer it to the pie pan. Trim the edge almost even with the edge of the pan. Cover it with plastic wrap and refrigerate it for a minimum of 30 minutes and a maximum of 3 hours.",
        "Place the sliced nectarines in a large bowl and sprinkle them with the lemon juice. Sprinkle on the sugar and salt and toss them gently to mix evenly. Allow to macerate for a minimum of 30 minutes and maximum of 1 hour.",
        "Transfer the nectarines and their juices to a colander suspended over a bowl to capture the liquid. The mixture will exude a full cup of juice.",
        "In a small saucepan (preferably lined with a nonstick surface), over medium-high heat, boil down this liquid to 1/2 cup, or until syrupy and lightly carmelized. Swirl the liquid but do not stir it. (Alternatively, spray a 4 cup heatproof measure with nonstick vegetable spray, add the liquid, and boil it in a microwave, about 12 minutes on high). Allow it to cool for about 10 minutes or until warm.",
        "Meanwhile, transfer the nectarines to a bowl and toss them with the lemon zest and cornstarch until all traces of the cornstarch have disappeared. Stir the Kirsch into the cooled syrup and pour it over the nectarines, tossing gently. Transfer the nectarine mixture to the pie shell and top with the raspberries.",
        "Roll out the top crust large enough to cut a 12-inch circle. Use an expandable flan ring or a cardboard template and a sharp knife as a guide to cut out the circle.",
        "Moisten the edges of the bottom crust with water and place the top crust over the fruit. Tuck the overhang under the bottom crust border and press down all around the top to seal it. Crimp the border using a fork or your fingers and make about 5 evenly spaced 2-inch slashes starting about 1 inch from the center and radiating toward the edge. Cover the pie loosely with plastic wrap and refrigerate it for 1 hour before baking to chill and relax the pastry. This will maintain flakiness and help to prevent distortion.",
        "Preheat oven to 425°F at least 20 minutes before baking. Set an oven rack at the lowest level and place a baking stone or baking sheet on it before preheating. Place a large piece of greased foil on top to catch bubbling juices.",
        "Set the pie directly on the foil-topped baking stone and bake for 45 to 55 minutes or until the juices bubble thickly through the slashes and the nectarines feel tender but not mushy when a cake tester or small knife is inserted through a slash. After 30 minutes, protect the edges from overbrowning with a foil ring. cool the pie on a rack for at least 3 hours before cutting.",
        "Room temperature, up to 2 days.",
        "— The nectarines should be ripe but firm so they maintain their texture in a pie. If squishy, they lose their character.",
        "— As you slice the nectarines, toss them occasionally with the sugar mixture to coat to prevent them from turning brown.",
        "— The liquid must not be hot when added to the nectarines because it could cause the cornstarch to lump.",
        "— Be sure to put a sheet of foil under the pie pan, as there is always a little spillover with this much fruit.",
        "— For a truly crisp bottom crust, bake the pie directly on the floor of the oven for the first 30 minutes."
    ],
    "ingredients": [
        "Flaky Cream Cheese Pie Crust for a 2-crust 9-inch pie",
        "8 cups (sliced) nectarines, rinsed (5 to 6 large), pitted and sliced but not peeled",
        "1 tablespoon freshly squeezed lemon juice",
        "3/4 cup sugar",
        "a pinch of salt",
        "1 tablespoon finely grated lemon zest",
        "2 tablespoons cornstarch",
        "1 tablespoon kirch",
        "1 cup raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Picnic",
        "Raspberry",
        "Nectarine",
        "Summer",
        "Family Reunion",
        "Potluck"
    ],
    "title": "Nectarine-Raspberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-raspberry-pie-101864"
}
