{
    "directions": [
        "Halve and pit nectarine. Cut halves into pieces and in a blender purée until smooth. In a heavy saucepan whisk together purée, yolks, granulated sugar, lime juice, butter, and vanilla. Cook mixture over moderately low heat, whisking constantly, until it just reaches a boil, about 7 minutes, and immediately remove pan from heat. Strain curd through a sieve into a bowl and cool, its surface covered with a buttered round of wax paper. Chill curd at least 2 hours and up to 2 days.",
        "Preheat oven to 375°F.",
        "Cut butter into pieces. In a food processor pulse flour, brown sugar, and salt until combined well. Add butter and blend until a dough begins to form (mixture should hold together when squeezed between fingers). Press dough evenly into bottom and up sides of a 13 1/2- by 4- by 1-inch rectangular tart pan with a removable fluted rim. Bake crust in middle of oven 20 minutes and cool in pan on a rack. Crust may be made 2 days ahead and kept in pan, covered, at room temperature.",
        "Halve and pit nectarines. Cut halves into 1/4-inch-thick slices. Spoon curd into shell, smoothing top, and arrange nectarine slices decoratively on top. In a small saucepan heat jam over low heat until hot. Pour jam through a sieve into a bowl, pressing hard on solids. Lightly brush fruit with glaze. Chill tart, loosely covered with plastic wrap, until ready to serve. Tart may be made 1 day ahead and chilled, covered."
    ],
    "ingredients": [
        "1 firm-ripe medium nectarine",
        "5 large egg yolks",
        "1/3 cup granulated sugar",
        "2 tablespoons fresh lime",
        "2 tablespoons unsalted",
        "1/8 teaspoon vanilla",
        "3/4 stick (6 tablespoons) cold unsalted butter",
        "1 cup all-purpose flour",
        "1/3 cup packed dark brown sugar",
        "3/4 teaspoon salt",
        "4 firm-ripe medium nectarines",
        "1/3 cup peach jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Lime",
        "Nectarine",
        "Summer",
        "Jam or Jelly",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Nectarine Lime Curd Tart with a Brown-Sugar Crust",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-lime-curd-tart-with-a-brown-sugar-crust-15128"
}
