{
    "directions": [
        "Bring plums and 3/4 cup water to a boil in a small saucepan. Reduce heat to medium-high and simmer, stirring occasionally and mashing plums with the back of a spoon, until plums have completely broken down, about 15 minutes.",
        "Pour plum mixture through a fine-mesh sieve set over a small bowl, pressing on solids to extract as much purée as possible; discard solids in sieve. Let purée cool.",
        "Add oil, vinegar, and 2 tablespoons water to purée; whisk to blend. Season dressing to taste with salt and pepper. DO AHEAD: Dressing can be made 1 week ahead. Cover and chill.",
        "Divide greens among plates. Scatter nectarines, cheese, and almonds over, dividing equally, and drizzle some of dressing over. Season with salt and pepper."
    ],
    "ingredients": [
        "2 black plums, halved, pitted, chopped",
        "1/2 cup extra-virgin olive oil",
        "4 teaspoons ume plum vinegar or red wine vinegar",
        "Kosher salt, freshly ground pepper",
        "12 cups (lightly packed) mixed greens (such as arugula and frisée)",
        "4 nectarines or peaches, halved, pitted, cut into eighths",
        "8 ounces firm blue cheese, such as Cabrales, sliced",
        "1/2 cup almonds, preferably Marcona",
        "Ingredient info: Ume plum vinegar (also called umeboshi vinegar) can be found at Asian markets, natural foods stores, and some supermarkets. Marcona almonds are available at natural foods and specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Fruit",
        "Vegetarian",
        "High Fiber",
        "Lunch",
        "Blue Cheese",
        "Nectarine",
        "Plum",
        "Almond",
        "Summer",
        "Low Cholesterol",
        "Lettuce",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Nectarine and Blue Cheese Salad with Plum Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-and-blue-cheese-salad-with-plum-vinaigrette-51108380"
}
