{
    "directions": [
        "Blend together flour, butter, shortening, and salt in a bowl with your fingertips (or pulse in a food processor) until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle evenly with 5 tablespoons ice water and gently stir with a fork (or pulse) until incorporated.",
        "Squeeze a small handful: If it doesn't hold together, add more ice water, 1 tablespoon at a time, stirring (or pulsing) until just combined. (Do not overwork mixture, or pastry will be tough.)",
        "Turn out dough onto a work surface and divide into 6 portions. With the heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all of dough together with scraper and press into 2 balls, then flatten each into a 5\" disk. Chill dough, each disk wrapped tightly in plastic wrap, until firm, at least 1 hour.",
        "Toss nectarines, plums, raspberries, lemon juice, and 1/4 cup of sugar in a large bowl.",
        "Grind tapioca to a powder in grinder, then whisk together with cornstarch, salt, and remaining 1/2 cup sugar in a small bowl (do not toss with fruit until dough is rolled out).",
        "Roll out 1 disk of dough on a lightly floured surface with a lightly floured rolling pin, into a 13\"-14\" round, then fit into a 9\" pie plate and trim edge, leaving a 1\" overhang.",
        "Roll out remaining disk to a 14\" round. Slide round onto a baking sheet. Cover and chill both crusts for 1 hour.",
        "Preheat oven to 400° with rack in lower third. Toss sugar mixture with fruit and transfer to chilled pie shell.",
        "Using fluted pastry wheel (or other utensil), cut chilled dough round into 3/4\"-wide strips. Weave strips over filling, forming a lattice. Trim strips 1/2\" shorter than dough overhang. Fold overhang over strips and crimp edges decoratively.",
        "Brush beaten egg over crust edges and lattice. Sprinkle 1 tablespoon sugar over crust. Set pie on a large rimmed baking sheet lined with foil.",
        "Bake pie 30 minutes. Reduce oven temperature to 350° and continue to bake, checking frequently and covering edge with a strip of foil or pie shield if crusts are browning too fast, until crusts are golden brown and filling is bubbling, 40-50 minutes more.",
        "Cool pie to room temperature on a rack, at least 2 hours."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2\" cubes",
        "1/4 cup cold vegetable shortening",
        "1/2 teaspoon salt",
        "5 to 7 tablespoons ice water",
        "2 pound nectarines, cut into 1/2\" wedges",
        "1 pound red or purple plums, cut into 1/2\" wedges",
        "12 ounces raspberries (about 3 cups)",
        "1 tablespoon fresh lemon juice",
        "3/4 cup sugar, divided",
        "2 tablespoons quick-cooking tapioca",
        "2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1 egg, beaten well",
        "1 tablespoon sugar",
        "pastry scraper",
        "electric coffee/spice grinder",
        "fluted pastry wheel",
        "pizza cutter or sharp knife"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Raspberry",
        "Nectarine",
        "Plum",
        "Summer"
    ],
    "title": "Nectarine, Plum, and Raspberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-plum-and-raspberry-pie-51238250"
}
