{
    "directions": [
        "Preheat the oven to 450°F. In a saucepan combine the nectarines, the blueberries, the water, the sugar, the cornstarch, and the lemon juice, bring the mixture to a boil, stirring constantly, and simmer it for 5 minutes, or until the fruit is softened. Transfer the fruit mixture to a shallow 1 1/2-quart baking dish.",
        "Sift the flour onto a sheet of wax paper, into a bowl sift together the flour, the sugar, the baking powder, and the salt, and make a well in the center. In a bowl beat the cream until it holds soft peaks, spoon it into the well in the flour mixture and combine the mixture with a fork until it just forms a dough. On a lightly floured surface knead the dough until it is combined well, roll or pat it out about 3/4 inch thick, and with a 2 1/2-inch round cutter cut out 6 biscuits.",
        "Arrange the biscuits on top of the fruit mixture, brush them with the cream or milk, and sprinkle them with the sugar. Bake the cobbler in the middle of the oven for 15 to 17 minutes, or until the biscuits are browned and the fruit is bubbling. Let the cobbler cool slightly and serve it with the ice cream."
    ],
    "ingredients": [
        "8 small nectarines, pitted and sliced thin (about 4 1/2 cups)",
        "2 cups blueberries, picked over",
        "1/2 cup water",
        "1/2 cup sugar, or to taste",
        "1 tablespoon plus 1 teaspoon cornstarch",
        "1 tablespoon fresh lemon juice",
        "1 3/4 cups all-purpose flour",
        "3 tablespoons sugar",
        "1 tablespoon double-acting baking powder",
        "a pinch of salt",
        "1 cup heavy cream",
        "heavy cream or milk for brushing the biscuits",
        "sugar for sprinkling the biscuits",
        "vanilla ice cream as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Blueberry",
        "Nectarine",
        "Summer",
        "Gourmet"
    ],
    "title": "Nectarine Blueberry Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-blueberry-cobbler-12734"
}
