{
    "directions": [
        "Preheat oven to 350°F. Butter and flour a 13- by 9- by 2-inch metal baking pan, knocking out excess flour.",
        "Sift together flour, baking powder, baking soda, and salt into a small bowl. Beat together butter and 1 cup granulated sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 2 minutes, then beat in vanilla and almond extract. Add eggs 1 at a time, mixing at low speed after each addition until just combined. Add flour mixture and sour cream alternately in 3 batches, mixing after each addition until just combined. Spread batter in pan, smoothing top.",
        "Cut nectarines lengthwise into 1/8-inch slices and toss with lemon juice and remaining 3 tablespoons granulated sugar in a bowl. Arrange slices, overlapping slightly, in 4 crosswise rows over batter. Cover surface of cake with a piece of buttered wax paper (paper helps fruit glaze itself) and bake in middle of oven 15 minutes. Remove paper and bake until a tester comes out clean, 20 to 25 minutes more.",
        "While cake is still warm, dust generously with confectioners sugar, then cool completely on a rack."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup plus 3 tablespoons granulated sugar",
        "1 teaspoon vanilla",
        "1/4 teaspoon almond extract",
        "2 large eggs",
        "1/2 cup sour cream",
        "2 medium firm-ripe nectarines (14 to 16 ounces), quartered lengthwise and pitted",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons confectioners sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Nectarine",
        "Almond",
        "Vanilla",
        "Summer",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Nectarine Cake Squares",
    "url": "http://www.epicurious.com/recipes/food/views/nectarine-cake-squares-106920"
}
