{
    "directions": [
        "1. Whisk together all the ingredients for the dipping sauce in a medium-sized bowl and reserve.",
        "2. Place the aziki in a small bowl and cover with 1/4 cup warm water. Let sit for about 10 minutes, then drain, reserving the soaking water.",
        "3. Place the shiitake mushrooms in a bowl and completely cover with boiling water. Let sit for 30 minutes then drain and pat dry.",
        "4. Place 1 tablespoon of the oil in a large, nonstick pan over medium heat and add the onions, garlic, carrots, and turnips and then add the aziki along with the reserved 1/4 cup water. Stir, cover and let cook until the carrots and turnips are beginning to turn tender, 6 to 8 minutes, stirring occasionally to be sure the vegetables aren't sticking to the pan and adding additional water if necessary. Be careful to not add too much water, you don't want the vegetables to be soggy. Add the cabbage, stir, cover and cook until the cabbage is tender, an additional 3 to 5 minutes. Stir in the fish sauce and taste for seasoning. Transfer the vegetables to a medium-sized bowl.",
        "5. Dice the shiitake mushrooms and add them to the vegetables.",
        "6. Place one rice wrapper in a pan of very warm water and let it sit until it is pliable, about 2 minutes. Transfer it to a tea towel set on a work surface, pat it dry, and place about 1/4 cup of filling in the bottom third of the wrapper. Lay several cilantro leaves atop the filling. Working quickly and carefully, roll up the bottom edge to enclose the filling, pressing on it gently. Fold the edges of the rice wrapper over the ends of the roll to completely enclose the filling, then continue rolling from the bottom to make a nice, firm rectangular roll. Place the roll, seam side down, in a dish and continue with the remaining rice wrappers and filling.",
        "7. Heat the remaining 2 tablespoons of oil in a non-stick skillet over medium-high heat. Place as many nems as will fit easily into the pan leaving a bit of room around them and cook until they are golden and crisp on all sides, 8 to 10 minutes total.",
        "8. Remove the nems from the heat and set them briefly on paper towels to absorb any excess oil, then transfer to a serving platter. Arrange the fresh mint leaves around the nems and serve, with the sauce on the side."
    ],
    "ingredients": [
        "2 tablespoons Nuoc Mam",
        "6 tablespoons water",
        "1 tablespoon rice wine vinegar",
        "1 teaspoon sake",
        "2-3 birds eye peppers, crushed",
        "one-quarter cup aziki (a sea vegetable — you may use any sea vegetable you like)",
        "5 dried shiitake mushrooms",
        "3 tablespoons mild vegetable oil",
        "6 spring onions, trimmed and cut in very small dice",
        "2 cloves garlic, minced, green germ removed",
        "2 medium carrots, trimmed, peeled and cut in very small dice",
        "2 small turnips, trimmed and peeled",
        "3 cabbage leaves (preferably Napa cabbage), minced",
        "1 tablespoon Nuoc Mam (fish sauce)",
        "eight 9-inch, dried rice wrappers",
        "one half cup fresh coriander leaves, lightly packed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Vegetable",
        "Appetizer",
        "Carrot",
        "Turnip",
        "Summer",
        "Pan-Fry",
        "Cabbage",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Nems",
    "url": "http://www.epicurious.com/recipes/food/views/nems-103516"
}
