{
    "directions": [
        "Preheat oven to 200 degrees F (95 degrees C).",
        "Toss shrimp in a bowl with Dijon mustard until coated and sprinkle with seafood seasoning. Refrigerate shrimp while you complete remaining steps.",
        "Pour cream and chicken stock into a large pot and bring to a boil. Reduce heat to medium-low; stir in shallot, butter, garlic powder, and grits. Bring mixture to a simmer and cook until grits have absorbed the liquid and are thick and smooth, about 20 minutes. Season with salt and black pepper.",
        "Place bacon in a large, deep skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.",
        "Wrap Italian bread in aluminum foil and place in preheated oven to heat, about 10 minutes. When bread is hot and the outside is slightly crunchy, slice into triangles. Cut the triangles apart horizontally, place onto a baking sheet, and brush with 2 tablespoons olive oil. Return to oven to toast, about 5 minutes; remove and keep warm.",
        "Pour 2 more tablespoons olive oil into skillet with bacon drippings and place skillet over medium-high heat. Cook and stir shrimp until pink and no longer translucent inside, about 5 minutes.",
        "Divide grits among 6 serving bowls and arrange cooked shrimp around the edges of the bowls. Place each bowl on a serving plate with 2 slices of bacon and 2 toast triangles. Sprinkle grits with shredded Cheddar cheese."
    ],
    "ingredients": [
        "1 1/2 pounds jumbo shrimp, peeled and deveined",
        "3 tablespoons Dijon mustard",
        "1 pinch seafood seasoning (such as Old Bay®), or to taste",
        "2 1/2 cups heavy whipping cream",
        "2 1/2 cups chicken stock",
        "1 shallot, finely chopped",
        "3 tablespoons butter",
        "1 teaspoon garlic powder",
        "1 cup regular grits, uncooked",
        "salt and ground black pepper to taste",
        "12 slices maple-cured bacon",
        "1 loaf Italian bread",
        "1/4 cup olive oil, divided",
        "3/4 cup shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Neo-Traditional Shrimp and Grits Meal",
    "url": "http://allrecipes.com/recipe/220900/neo-traditional-shrimp-and-grits-meal/"
}
