{
    "directions": [
        "Preheat oven to 200°F. Place 2 nonstick baking sheets in oven.",
        "In medium saucepan, cover cod with cold water by 1 inch. Set over moderately high heat and bring to simmer. Drain and set aside to cool.",
        "Using box grater or food processor fitted with grating disc, coarsely grate potato and set aside in colander to drain.",
        "In large mixing bowl, lightly beat eggs. Whisk in flour, then add onion, celery seeds, and celery salt. Break cod into small flakes and add to bowl.",
        "Press potatoes to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork.",
        "In heavy-bottomed, 12-inch skillet over moderately high heat, heat 1 tablespoon oil and 1 tablespoon butter until hot but not smoking. Drop 4 scant 1/4-cup portions of batter into pan and flatten with spatula to form four 3-inch pancakes.",
        "Fry until bottoms are golden-brown, 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes.",
        "Using paper towels, carefully wipe out pan. Add 1 tablespoon oil and 1 tablespoon butter and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 tablespoon oil and 1 tablespoon butter before each batch.",
        "Serve pancakes hot with Tartar Sauce ."
    ],
    "ingredients": [
        "1 pound skinless cod fillets (approximately 2 to 3 fillets)",
        "4 large russet or Idaho potatoes (about 3 1/2 pounds), peeled",
        "2 large eggs",
        "2 tablespoons all-purpose flour",
        "1/4 cup coarsely grated onion, squeezed of excess moisture",
        "1 teaspoon celery seeds",
        "1/4 teaspoon celery salt",
        "6 tablespoons vegetable oil",
        "6 tablespoons unsalted butter",
        "Tartar Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Fry",
        "Hanukkah",
        "Cod",
        "Kosher"
    ],
    "title": "New England-Style Cod and Potato Cakes with Tartar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/new-england-style-cod-and-potato-cakes-with-tartar-sauce-233368"
}
