{
    "directions": [
        "Bring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells.",
        "Chop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill.",
        "Melt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 Tbsp. water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing.",
        "Remove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper.",
        "Divide chowder among bowls. Garnish with chives and oyster crackers."
    ],
    "ingredients": [
        "8 pounds cherrystone clams, scrubbed",
        "1 tablespoon unsalted butter",
        "8 ounces bacon, cut into 1/2\" pieces",
        "2 celery stalks, minced",
        "1 large onion, minced",
        "1 garlic clove, minced",
        "2 1/2 pound Yukon Gold potatoes, peeled, cut into 1/2\" pieces",
        "1 tablespoon chopped fresh thyme",
        "1 bay leaf",
        "2 tablespoons cornstarch",
        "2 cups heavy cream",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "Chopped fresh chives",
        "Oyster crackers or Vermont Common Crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Potato",
        "Lunch",
        "Bacon",
        "Clam",
        "Celery",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "New England Clam Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/new-england-clam-chowder-51122640"
}
