{
    "directions": [
        "Whisk crème fraîche, mustard, and lemon juice in small bowl. Season with coarse salt. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Mix first 5 ingredients in small bowl. Place beef, fat side up, in 13x9x2-inch roasting pan. Spread butter mixture over top of roast. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Let beef stand at room temperature 1 hour before roasting.",
        "Position 1 rack in bottom third and 1 rack in top third of oven; preheat to 450°F. Combine mushrooms, turnips, carrots, celery root, shallots, oil, and rosemary in large bowl. Sprinkle with coarse salt and pepper; toss to coat. Transfer vegetables to large rimmed baking sheet, spreading out in even layer.",
        "Place vegetables on lower rack in oven and beef on upper rack in oven. Roast 20 minutes. Toss vegetable mixture. Reduce oven temperature to 350° F. Continue roasting until vegetables are tender and beginning to brown and instant-read thermometer inserted into thickest part of meat registers 130°F for medium-rare, 30 to 35 minutes longer. Transfer roast to platter and let rest 10 minutes. Spoon fat from top of drippings in roasting pan. Drizzle drippings over vegetable mixture; toss to coat. Season to taste with salt and pepper.",
        "Spoon vegetable mixture around roast. Serve mustard cream sauce alongside.",
        "Full-bodied and spicy Brander 2007 Colson Canyon Vineyard Syrah, Santa Barbara ($35)"
    ],
    "ingredients": [
        "1/2 cup crème fraîche or sour cream",
        "2 tablespoons Dijon mustard",
        "1 teaspoon fresh lemon juice",
        "Coarse kosher salt",
        "1 tablespoon unsalted butter, room temperature",
        "2 garlic cloves, pressed",
        "1 teaspoon finely chopped fresh rosemary",
        "3/4 teaspoon coarse kosher salt",
        "1/2 teaspoon freshly cracked black pepper",
        "1 3-pound boneless beef loin New York strip roast",
        "1 pound assorted mushrooms (such as button, crimini, and oyster), large mushrooms halved",
        "1 pound turnips (about 2 medium), peeled, cut into 2x1/2x1/2-inch strips",
        "12 ounces carrots (about 4 medium), peeled, quartered lengthwise, cut crosswise into 1 1/2-to 2-inch pieces",
        "1 12-ounce celery root (about 1 medium), peeled, cut into 2 x 1/2 x 1/2-inch strips",
        "5 large shallots (about 12 ounces total), peeled, cut crosswise into 1/4-inch-thick slices",
        "5 tablespoons extra-virgin olive oil",
        "1 1/2 tablespoons chopped fresh rosemary",
        "Coarse kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Mustard",
        "Roast",
        "High Fiber",
        "Dinner",
        "Steak",
        "Root Vegetable",
        "Carrot",
        "Turnip",
        "Fall",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "New York Strip and Fall Vegetable Roast with Mustard Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/new-york-strip-and-fall-vegetable-roast-with-mustard-cream-sauce-355197"
}
