{
    "directions": [
        "Special equipment: 5-cup broiler-safe casserole dish",
        "Melt 4 tablespoons of the butter in a large skillet over medium heat. Whisk in the chili sauce, lemon juice, garlic, Worcestershire, cayenne, oregano, paprika and hot sauce. Bring to a low simmer and cook, stirring frequently, until slightly reduced, about 5 minutes. Add the shrimp and cook until they are pink and just cooked through, flipping once, 4 to 5 minutes. Remove from the heat and let cool.",
        "When cool, place the shimp mixture in a food processor and pulse until roughly chopped. (The shrimp mixture can be made up to a day in advance and refrigerated.)",
        "Combine the cream cheese and sour cream in a large bowl and stir vigorously with a rubber spatula until smooth. Add the shrimp mixture, scallion whites, parsley, 1 1/4 teaspoons salt and a few grinds of pepper and stir to combine. Place in a 5-cup broiler-safe casserole dish and spread evenly.",
        "Melt the remaining 4 tablespoons of butter and pour over the top of the shrimp dip, making sure to cover the entire surface with a thin layer of butter. Sprinkle with the scallion greens. Chill for at least 4 hours and up to overnight.",
        "Just before serving, position an oven rack in the top third of the oven and preheat the broiler. Broil the dip until the butter layer just begins to melt. Serve with the crackers and crunchy bread."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) unsalted butter",
        "1/4 cup chili sauce",
        "1/4 cup fresh lemon juice",
        "5 cloves garlic, smashed",
        "2 tablespoons Worcestershire sauce",
        "1 teaspoon cayenne",
        "1 teaspoon dried oregano",
        "1 teaspoon paprika",
        "1/2 teaspoon hot sauce",
        "1 1/4 pounds peeled and deveined large shrimp, tails removed",
        "4 ounces cream cheese, at room temperature",
        "1/2 cup sour cream",
        "3 scallions, white and green parts separated and thinly sliced",
        "1/2 cup loosely packed fresh parsley leaves, chopped",
        "Kosher salt and freshly ground black pepper",
        "Kosher salt and freshly ground black pepper",
        "Crackers and crunchy rustic bread for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dip",
        "Shellfish Recipes",
        "Shrimp",
        "Appetizer",
        "Holiday"
    ],
    "title": "New Orleans Barbecue Shrimp Dip",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/new-orleans-barbecue-shrimp-dip"
}
