{
    "directions": [
        "The night before serving, prepare the pizza dough and refrigerate. Remove the dough from the refrigerator 1 to 2 hours before forming the pizzas. Position a rack in the lower third of the oven. Place a large pizza stone on the rack, and preheat an oven to 450°F, allowing at least 30 minutes for the oven to preheat fully.",
        "To make the pizza sauce, in a bowl, mix together the tomatoes, 1 Tbs. of the oil, and the oregano. Set aside.",
        "To prepare the toppings, in a large frying pan, heat the remaining 1 Tbs. oil over medium-high heat. Add the mushrooms and cook, stirring, until they give off their juices and are browned, about 8 minutes. Transfer to a bowl and season with salt and pepper. Add the sausages to the pan and cook over medium-high heat, stirring and breaking them up with a wooden spoon, until no longer pink, about 10 minutes. Transfer to the bowl with the mushrooms. Set aside.",
        "Divide the dough in half and shape each half into a taut ball. Place 1 ball on a lightly floured work surface. Return the other dough ball to its bowl and cover. Roll, pat and stretch the dough into a round about 12 inches in diameter. Generously dust a pizza peel with cornmeal. Transfer the dough to the peel and reshape into a round as needed. Spread with half of the sauce, leaving a 3/4-inch border uncovered. Top with half of the mozzarella, then half of the mushroom mixture.",
        "Slide the pizza off the peel onto the hot stone. Bake until the crust is golden brown, about 12 minutes. While the first pizza is baking, repeat with the remaining dough, tomato sauce, mozzarella and mushroom mixture, so the second pizza is ready to bake when the first one comes out of the oven. Using a wide spatula or a rimless baking sheet, remove the baked pizza from the oven and transfer to a cutting board. Sprinkle with half of the Parmigiano-Reggiano cheese. Slide the second pizza onto the hot stone and bake for about 12 minutes. Cut and serve the first pizza. When the second pizza is done, top with the remaining Parmigiano-Reggiano cheese, cut and serve. Makes two 12-inch pizzas.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1 batch Food-Processor Pizza Dough or purchased pizza dough",
        "1 cup canned crushed plum tomatoes",
        "2 Tbs. extra-virgin olive oil",
        "1 tsp. dried oregano",
        "1/2 lb. cremini or button mushrooms, sliced",
        "Kosher salt and freshly ground pepper",
        "1/2 lb. sweet or hot Italian pork sausages, casings removed",
        "All-purpose flour and cornmeal for dusting",
        "1 lb. fresh mozzarella cheese, thinly sliced",
        "4 Tbs. Parmigiano-Reggiano cheese, freshly grated"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "New York–Style Sausage and Mushroom Pizza",
    "url": "http://www.williams-sonoma.com/recipe/new-york-style-sausage-and-mushroom-pizza.html"
}
