{
    "directions": [
        "Preheat oven to 350°F. Butter bottoms of three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with waxed paper.",
        "Mix flour, soda, and salt in small bowl. Using electric mixer, cream butter in large bowl until light. Gradually add sugar and beat until fluffy. Add eggs 1 at a time, beating well after each addition. Beat in yolks, then melted chocolate. Mix in dry ingredients alternately with buttermilk, beginning and ending with dry ingredients. Divide batter among prepared pans. Bake until tester inserted in centers comes out clean, about 25 minutes. Transfer cakes to racks and cool 5 minutes. Run small sharp knife around pan sides to loosen. Unmold cakes onto paper towel-lined racks. Cool completely.",
        "Peel paper off cakes. Place 1 cake layer on platter. Slide waxed paper strips just under sides of cake. Spread 3/4 cup frosting over, Top with second cake layer. Spread with 3/4 cup frosting. Top with third cake layer. Spread remaining frosting decoratively over top and sides of cake. Remove waxed paper strips. Arrange walnuts around top edge and center of cake if desired. (Can be prepared 1 day ahead. Cover with cake dome; store at room temperature.)"
    ],
    "ingredients": [
        "2 cups sifted all purpose flour",
        "1 1/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2 cups firmly packed golden brown sugar",
        "2 large eggs, room temperature",
        "2 large egg yolks, room temperature",
        "5 ounces unsweetened chocolate, melted and cooled",
        "1 1/2 cups buttermilk, room temperature",
        "Bittersweet Chocolate frosting",
        "13 walnut halves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Walnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "New England Heirloom Cake",
    "url": "http://www.epicurious.com/recipes/food/views/new-england-heirloom-cake-233679"
}
