{
    "directions": [
        "Preheat oven to 350°F. Bring broth and chiles to boil in small saucepan. Cover; reduce heat and simmer 5 minutes. Transfer mixture to blender. Add vinegar, honey, and cumin. Blend until smooth, thinning with broth by tablespoonfuls as needed for thick sauce. Season sauce with salt and pepper. Transfer to bowl; rinse out and reserve blender.",
        "Melt 2 tablespoons butter in large ovenproof skillet over medium heat. Sprinkle chicken with salt and pepper. Add to skillet; sauté until brown, about 3 minutes per side. Transfer skillet to oven; roast chicken until cooked through, about 8 minutes.",
        "Meanwhile, blend hominy with juice until just coarsely chopped, about 5 seconds; drain well. Stir hominy and 3 tablespoons butter in medium saucepan over medium heat until heated through, about 2 minutes. Mix in half of cilantro. Season with salt and pepper.",
        "Spoon hominy onto plates. Top with chicken, then sauce and remaining cilantro. * Available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "3/4 cup (or more) organic chicken broth",
        "4 large dried New Mexico chiles,* stemmed, seeded, coarsely torn",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons honey",
        "1/2 teaspoon ground cumin",
        "5 tablespoons butter, divided",
        "4 skinless boneless organic chicken breast halves",
        "2 15-ounce cans golden hominy",
        "3 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Hominy/Cornmeal/Masa",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "New Mexico Chile-Glazed Chicken on Hominy Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/new-mexico-chile-glazed-chicken-on-hominy-polenta-350744"
}
