{
    "directions": [
        "Combine 5 1/4 cups flour, cinnamon, ginger, cloves, and salt in medium bowl; whisk to blend well. Using electric mixer, beat butter and shortening in large bowl to blend. Add 1 cup sugar, molasses, and lemon peel and beat until smooth. Beat in egg and buttermilk. Stir 2 teaspoons water and baking soda in small cup to blend; beat into butter mixture. Beat in flour mixture in 2 additions. Stir in more flour, 1/4 cup at a time, until slightly firm dough forms. Divide dough into 3 equal parts. Shape each into disk. Wrap disks and chill until firm enough to roll, at least 2 hours. (Can be made 2 days ahead. Keep refrigerated. Soften slightly before rolling out.)",
        "Working with 1 disk at a time, roll out dough between sheets of waxed paper to 16x12-inch rectangle, occasionally lifting paper to smooth out wrinkles. Using 4- to 5-inch cutters, cut out boy and girl gingerbread people. Pull away excess dough around cutouts; flatten, wrap, and chill excess dough. Slide rimless baking sheet or inverted baking sheet under waxed paper with cutouts and chill until firm. Repeat with remaining dough disks, refrigerating cutouts on waxed paper on baking sheets. Roll out excess dough and make more cookies, using all of dough. (Cutout cookies can be made 1 day ahead. Cover; keep chilled.)",
        "Position rack in center of oven and preheat to 350°F. Using thin metal spatula, lift chilled cookies off waxed paper and transfer to baking sheet, spacing 1 inch apart. Bake until darker at edges and just firm to touch in center, about 12 minutes. Cool on sheet 5 minutes. Transfer to rack; cool completely. Bake remaining cookies, 1 sheet at a time.",
        "Sift powdered sugar into medium bowl. Mix in lemon juice and corn syrup. Mix in enough water by teaspoonfuls to form smooth icing soft enough to pipe but firm enough to hold shape. Divide into 3 or 4 portions and tint with food coloring, if desired.",
        "Spoon icing into pastry bag (or bags if using more than 1 color) fitted with small (1/16- to 1/8-inch) plain tip. Arrange cookies on work surface. Pipe icing onto cookies in desired patterns. Apply decorations as desired. Let cookies stand until icing is dry. (Can be made 3 days ahead. Store cookies airtight between sheets of waxed paper at room temperature.)"
    ],
    "ingredients": [
        "6 cups (about) all purpose flour",
        "1 tablespoon ground cinnamon",
        "2 teaspoons ground ginger",
        "1 1/2 teaspoons ground cloves",
        "3/4 teaspoon salt",
        "11 tablespoons (1 stick plus 3 tablespoons) unsalted butter, room temperature",
        "2/3 cup solid vegetable shortening",
        "1 cup sugar",
        "1 cup mild-flavored (light) molasses",
        "1 1/2teaspoons grated lemon peel",
        "1 large egg",
        "1/4 cup buttermilk",
        "2 teaspoons water",
        "1 teaspoon baking soda",
        "3 cups powdered sugar",
        "1 1/2 tablespoons fresh lemon juice",
        "1 1/2 teaspoons light corn syrup",
        "Water",
        "Food coloring (optional)",
        "Decorations (such as colored sugar crystals)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Ginger",
        "Bake",
        "Christmas",
        "Spice",
        "Winter",
        "Molasses"
    ],
    "title": "New England Molasses Gingerbread Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/new-england-molasses-gingerbread-cookies-107526"
}
