{
    "directions": [
        "Chicken Marinade: In a large, shallow glass baking dish, mix together soy sauce, 4 tablespoons dried thyme, 1 teaspoon cayenne pepper, 2 tablespoons paprika, 2 chopped onions and 2 tablespoons black pepper. Place the chicken in the marinade. Refrigerate for at least 3 hours.",
        "Saute bacon in a Dutch oven over medium heat until brown.  Add the onion and garlic.  Continue to cook 5 minutes.  Mix in flour and sausage.  Cook 5 minutes more; stirring frequently.  Add the ham, thyme, cayenne, chicken stock, tomatoes, reserved juice and green peppers and bring to boil.  Stir in rice and cover.  Cook for 25 minutes.  Remove from heat and cool completely and refrigerate.",
        "Two hours before you intend to serve the jambalaya, discard marinade and bake chicken breasts at 500 degrees F (250 degrees C) for 12 minutes, or until the flesh is firm when pressed with finger.  Remove from oven.  Cool and slice into bite-size pieces.",
        "Reduce oven's temperature to 250 degrees F (120 degrees C). Place covered jambalaya on large baking tray filled with to water.  Bake until warm, about 2 hours.",
        "Just before serving the jambalaya, boil 5 quarts of water.  Add the shrimp and cook for 3 minutes until they are firm to the touch.  Drain well.  Toss shrimp and chicken with jambalaya mixture and serve."
    ],
    "ingredients": [
        "1 cup soy sauce",
        "4 tablespoons dried thyme",
        "1 teaspoon cayenne pepper",
        "2 tablespoons paprika",
        "2 onions, chopped",
        "2 tablespoons ground black pepper",
        "16 skinless, boneless chicken breast halves",
        "3/4 pound bacon, cut into small pieces",
        "8 onions, diced",
        "4 cloves garlic, minced",
        "6 tablespoons all-purpose flour",
        "3 pounds chorizo, sliced into chunks",
        "3 pounds cooked ham, cut into 1/2 inch pieces",
        "3 tablespoons dried thyme",
        "4 teaspoons cayenne pepper",
        "5 cups chicken stock",
        "6 (14.5 ounce) cans peeled and diced tomatoes with juice",
        "4 green bell pepper, chopped",
        "6 cups uncooked white rice",
        "10 pounds medium shrimp - peeled and deveined"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "New Orleans Jambalaya",
    "url": "http://allrecipes.com/recipe/12866/new-orleans-jambalaya/"
}
