{
    "directions": [
        "1. Combine the peanut butter, tamari, honey, apple cider vinegar, garlic, ginger, tomato paste, chipotle, and orange juice and zest in a food processor and buzz until the ginger is finely chopped.",
        "2. To use the marinade, place the tofu in a nonreactive bowl or zip-top bag and pour or spoon this luscious mixture over it. Refrigerate the tofu, covered, overnight.",
        "3. The next day, preheat the oven to 375°F and generously spray a nonreactive baking dish with oil (I use an 8 or 9 by 12-inch deep glass baking dish).",
        "4. Place the tofu and its marinade in the baking dish, spreading the marinade as needed so both sides of the tofu slices get a good smear of it. Bake, turning once, until fragrant, firmed up, and golden to deep brown in spots with the marinade considerably thickened, about 30 minutes."
    ],
    "ingredients": [
        "1/3 cup natural, unhydrogenated peanut butter",
        "1/3 cup tamari or shoyu soy sauce",
        "1/3 cup honey, light brown sugar, maple syrup, or thawed, undiluted frozen apple or pineapple juice concentrate",
        "1/4 cup apple cider vinegar",
        "4 to 6 cloves garlic, quartered lengthwise",
        "About 1 tablespoon chopped fresh ginger (optional)",
        "1 to 2 tablespoons tomato paste or ketchup",
        "1 canned chipotle pepper in adobo sauce, 1/2 teaspoon cayenne, or 1 fresh serrano or jalapeño pepper, de-stemmed",
        "Juice and grated zest of 1 orange (optional, but good)",
        "12 to 14 ounces drained, sliced traditional water-packed firm or extra-firm tofu or tempeh",
        "Vegetable oil cooking spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soy",
        "Side",
        "Bake",
        "Marinate",
        "Vegetarian",
        "Dinner",
        "Tofu",
        "Chill",
        "Honey",
        "Soy Sauce",
        "Peanut Butter",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "New Wave-New Fave Baked Tofu or Tempeh",
    "url": "http://www.epicurious.com/recipes/food/views/new-wave-new-fave-baked-tofu-or-tempeh-394509"
}
