{
    "directions": [
        "Place the shredded potatoes in a bowl, cover with water, and set aside. Bring the onion, garlic, green chiles, and chicken broth to a boil in a saucepan over high heat. Reduce the heat to low, and simmer until the sauce thickens; turn off the heat.",
        "Meanwhile, place the strips of bacon on paper towels on a microwave-safe plate, and cook on High until crisp, about 1 minute per strip; set aside.",
        "Heat the vegetable oil over medium-high heat in a large skillet. Drain the potatoes, and add to the skillet. Spoon hot oil over the potatoes; sprinkle with the onion powder, salt, and pepper. Flip the potatoes occasionally, but let them fry until crispy bits form and the potatoes are cooked through, about 15 minutes.",
        "Place the tortillas between two damp paper towels. Microwave on High until warm, about 30 seconds.",
        "Spray a separate skillet with butter flavored cooking spray and cook the eggs over medium heat, whisking them continuously until the eggs are completely set; turn off the heat.",
        "Lay a tortilla flat in front of you. Place some potatoes, scrambled egg, and a strip of bacon on the lower third,  leaving about an inch of room from the bottom, and about 1-1/2 inches on the left and right clear for folding the burrito. Spoon on a little of the green chile sauce, and sprinkle with Cheddar cheese.",
        "Fold the left and right edges into the middle about 1-1/2 to 2 inches. Take the bottom edge closest to you with the stuffing and pick it up, pulling it OVER the filling, while keeping the sides in place until that edge now touches the tortilla about 7/8 of the way up to the top edge. Check to see that the sides are still tucked well. If they aren't slide them in a bit now that you have the filling covered. Finish by tucking the bottom flap that you pulled over the filling UNDER the filling a bit to seal it, then continue rolling the burrito up to the top edge, forming a tight cylinder.  Let it rest seam-side down, and it will stay nice and tight. Repeat with remaining ingredients."
    ],
    "ingredients": [
        "4 potatoes, shredded",
        "1 small onion, finely chopped",
        "1 clove garlic, minced",
        "1 (8 ounce) container frozen Hatch, New Mexico green chile peppers",
        "1/2 cup chicken broth",
        "12 strips bacon",
        "1/3 cup vegetable oil",
        "1 tablespoon onion powder",
        "salt and pepper to taste",
        "6 (10 inch) flour tortillas",
        "butter flavored cooking spray",
        "12 extra large eggs, beaten",
        "2 cups shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "New Mexico Green Chile Breakfast Burritos",
    "url": "http://allrecipes.com/recipe/200257/new-mexico-green-chile-breakfast-burr/"
}
