{
    "directions": [
        "Pat roast dry and rub all over with 1 tsp. salt; set aside.",
        "Purée anchovies, garlic, rosemary, orange zest, oil, pepper, and remaining 4 tsp. salt in a food processor until finely chopped, about 1 minute. Transfer all but 1 Tbsp. garlic mixture to a medium bowl; reserve remaining garlic mixture in food processor.",
        "Rub roast all over with half of garlic mixture from bowl. Place fat side up on a wire rack set in a rimmed baking sheet or in a roasting pan fitted with a rack. Add breadcrumbs to remaining garlic mixture in bowl, mix thoroughly with your fingers, and press onto top and sides of roast. Let stand at room temperature at least 1 hour.",
        "Meanwhile, add butter and parsley to reserved 1 Tbsp. garlic mixture in food processor and pulse until well combined. Transfer to parchment paper and roll into a log. Chill until firm, about 2 hours.",
        "Place rack in middle of oven; preheat to 500°F. Place roast in oven, then reduce temperature to 350°F. Roast until an instant-read thermometer inserted into the center of roast registers 120°F for rare or 130°F for medium-rare, 70–90 minutes.",
        "Transfer roast to a carving board and let stand 15 minutes. Slice against the grain into 1/3\" pieces. Serve with herbed butter."
    ],
    "ingredients": [
        "1 (5-pound) New York strip roast (also called beef strip loin or top loin), fat trimmed to 1/4\", untied",
        "5 teaspoons kosher salt, divided",
        "2 oil-packed anchovy fillets, drained",
        "8 garlic cloves, peeled",
        "1/4 cup coarsely chopped rosemary leaves",
        "2 tablespoons finely grated orange zest (from about 2 large oranges)",
        "3 tablespoons olive oil",
        "1 tablespoon freshly ground black pepper",
        "1/4 cup plain breadcrumbs",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 cup (packed) parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Dinner",
        "Kid-Friendly",
        "Rosemary",
        "Orange",
        "Herb",
        "Party",
        "Christmas",
        "Christmas Eve",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "New York Strip Roast With Rosemary-Orange Crust and Herbed Butter",
    "url": "http://www.epicurious.com/recipes/food/views/new-york-strip-roast-with-rosemary-orange-crust-and-herbed-butter"
}
