{
    "directions": [
        "Place the bacon into a large stock pot over medium heat, and pan-fry until crisp and brown, turning often, about 10 minutes. Remove bacon, allow to cool, and crumble when cooled. Set bacon aside.",
        "Pour water into the pot with the drippings, and stir in the onions, turnip, green and red bell peppers, apple cider vinegar, honey, garlic, black pepper, hot pepper sauce, and celery seed. Bring to a boil, and stir in the mustard greens. Reduce heat to a simmer, and cook until greens are very tender, at least 2 hours. Crumble bacon into the greens to serve.",
        "For canning, sterilize the jars and lids in boiling water for at least 5 minutes. Pack the greens into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large dial-gauge or weighted-gauge pressure canner. Place the jars into the pressure canner, and add water to completely cover the jars. Seal the pressure canner, place over medium heat, and bring to 12 pounds of pressure. Reduce heat just enough to hold the pressure steady, and process for 75 minutes, or the length of time recommended for your area. Remove from heat, and allow pressure in the canner to release gradually; remove the lid, and remove hot jars with a canning tongs.",
        "Place jars onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "6 slices bacon",
        "8 cups water",
        "4 onions, chopped",
        "1 turnip, peeled and chopped",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "2/3 cup apple cider vinegar",
        "1 tablespoon honey",
        "5 cloves garlic, minced",
        "1 tablespoon ground black pepper",
        "1 tablespoon hot pepper sauce",
        "2 teaspoons celery seed",
        "3 pounds mustard greens, washed and chopped",
        "6 1-quart canning jars with lids and rings (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "New Orleans Greens",
    "url": "http://allrecipes.com/recipe/218504/new-orleans-greens/"
}
