{
    "directions": [
        "1. Mix all the ingredients except the coriander and the chilies in a greased 3-quart baking dish.",
        "2. Cover and bake in a preheated 250-degree oven, stirring occasionally, until the vegetables are soft, but not mushy, about 2 hours. Let cool.",
        "3. Using a fork or a potato masher mash the mixture coarsely with the chopped coriander to facilitate stuffing into the chilies. This can be prepared a day ahead.",
        "4. Place the chilies on a cookie sheet in a preheated 450-degree oven. Roast for about 20 minutes, turning occasionally, or until the skin is black. Remove to a plastic or paper bag and leave until cool. Peel off the skin.",
        "5. With a sharp knife, make a slit from the bottom of the stem to the point of each chili.",
        "6. Gently scrape out the seeds and rinse the inside of the chili.",
        "7. Pat each chili dry and stuff with chopped tsimmes so that each chili is slightly overstuffed, causing the slit in the chili to open, exposing the filling.",
        "8. Bake in a preheated 350-degree oven for 10 to 15 minutes. Alternately, you can merely put the stuffing mixture in a greased flat casserole, approximately 9- by 13-inch, and bake in a 350-degree oven for about 20 minutes or until it is warm."
    ],
    "ingredients": [
        "3/4 pound pitted prunes",
        "6 medium peeled carrots, cut in chunks",
        "3 medium sweet potatoes (about 2 pounds), peeled and diced",
        "6 tablespoons honey",
        "1/2 teaspoon nutmeg",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon salt",
        "1 tablespoon lemon juice",
        "1/4 cup orange juice",
        "2 tablespoons chopped fresh coriander",
        "12 green or red Anaheim chilies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Vegetarian",
        "Sukkot",
        "Rosh Hashanah/Yom Kippur",
        "Prune",
        "Spice",
        "Hot Pepper",
        "Carrot",
        "Sweet Potato/Yam",
        "Fall",
        "Kosher",
        "Honey",
        "Fat Free",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Newish Jewish — Southwestern Tsimmes Stuffed in Chilies",
    "url": "http://www.epicurious.com/recipes/food/views/newish-jewish-southwestern-tsimmes-stuffed-in-chilies-40016"
}
