{
    "directions": [
        "Pull meat from chicken; discard skin. Warm chicken and salsa in a large skillet over medium-low heat until heated through.",
        "Meanwhile, heat oil in a medium skillet over medium. Cook garlic, stirring occasionally, until softened, about 1 minute. Add beans, salt, and 1/2 cup water and cook, stirring and crushing beans with the back of a large spoon, until warmed through and creamy, about 3 minutes. Let sit until ready to use.",
        "Working one at a time, warm tortillas with tongs directly over a gas burner, turning often, until lightly charred and puffed in spots, about 1 minute per side. (Alternatively, wrap tortillas in foil and heat in a 350°F oven until warmed through, or wrap in damp paper towels and microwave in 20-second bursts until warm.) Transfer to a plate and cover with a kitchen towel to keep warm.",
        "Fill tortillas with chicken and top with avocado, slaw, and cilantro. Serve with lime wedges, hot sauce, and refried beans alongside."
    ],
    "ingredients": [
        "4 cooked chicken thighs from Crispy Chicken and Potatoes With Cabbage Slaw or about 2 cups shredded chicken",
        "1 cup good-quality tomatillo salsa",
        "2 tablespoons vegetable oil",
        "1 garlic clove, pressed or finely chopped",
        "1 1/4 cups cooked or 1 (15-ounce) can low-sodium black beans, drained",
        "1/4 tsp. kosher salt",
        "4 corn tortillas",
        "1 avocado, sliced",
        "1/2 cup leftover slaw from Crispy Chicken and Potatoes With Cabbage Slaw, optional",
        "Chopped cilantro, lime wedges, and hot sauce (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#cook90",
        "Dinner",
        "Chicken",
        "Taco",
        "Bean",
        "Salsa",
        "Cabbage",
        "Cilantro",
        "Tortillas",
        "Quick and Healthy",
        "Quick & Easy",
        "Healthy"
    ],
    "title": "\"Nextover\" Chicken Tacos With Quick Refried Beans",
    "url": "http://www.epicurious.com/recipes/food/views/nextover-chicken-tacos-with-quick-refried-beans"
}
