{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "Heat the olive oil in a large oven proof saute pan over medium heat, add the onions and garlic and cook for about 5 minutes until translucent. Add the red pepper flakes and dried oregano and cook for 1 minute more. Add the vodka and continue cooking until the mixture is reduced by half.",
        "Meanwhile, drain the tomatoes through a sieve and crush them into the pan with your hands. Add 2 teaspoons salt and a pinch of black pepper. Cover the pan with a tight fitting lid and place it in the oven for 1 1/2 hours. Remove the pan from the oven and let cool for 15 minutes.",
        "Meanwhile, bring a large pot of salted water to a boil and cook the pasta al dente. Drain and set aside.",
        "Place the tomato mixture in a blender and puree in batches until the sauce is a smooth consistency. Return to the pan.",
        "Reheat the sauce, add 2 tablespoons fresh oregano and enough heavy cream to make the sauce a creamy consistency. Add salt and pepper, to taste, and simmer for 10 minutes. Toss the pasta into the sauce and cook for 2 minutes more. Stir in 1/2 cup Parmesan. Serve with an additional sprinkle of Parmesan and a sprinkle of fresh oregano on each plate."
    ],
    "ingredients": [
        "1/4 cup good olive oil",
        "1 medium Spanish onion, chopped",
        "3 cloves of garlic, diced",
        "1/2 teaspoon crushed red pepper flakes",
        "1 1/2 teaspoons dried oregano",
        "1 cup vodka",
        "2 (28-ounce) cans peeled plum tomatoes",
        "Kosher salt",
        "Freshly ground black pepper",
        "3/4 pound penne pasta",
        "4 tablespoons fresh oregano",
        "3/4 to 1 cup heavy cream",
        "Grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Dairy Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Nick and Toni's Penne Alla Vecchia Bettola",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/nick-and-tonis-penne-alla-vecchia-bettola-recipe"
}
