{
    "directions": [
        "Whisk 2 1/2 cups of flour and salt together in a large bowl. With a pastry cutter, chop the vegetable shortening and unsalted butter into the flour until the mixture resembles coarse crumbs with a few pea-sized pieces of fat; stir in ice water, 1 tablespoon at a time, just until the mixture holds together when squeezed. Divide dough in half, and form each half into a ball; wrap the balls in plastic wrap, and refrigerate at least 1 hour or up to overnight.",
        "Preheat oven to 375 degrees F (190 degrees C). Roll out a dough ball on a floured surface into an 11-inch circle; fit the crust into a 9-inch pie dish. Refrigerate while making filling.",
        "Mix strawberries, rhubarb, 1 1/4 cup of sugar, tapioca, 2 tablespoons of flour, vanilla extract, orange juice, orange zest, and cinnamon together in a bowl. Pour the filling into the crust-lined pie dish. Sprinkle 2 tablespoons of butter pieces over the filling. Roll the second dough ball out into a 10-inch circle on a floured surface, and gently place the top crust onto the filling. Crimp the edges together with a fork to seal. Brush the pie with beaten egg white, and cut several slits into the top crust with a sharp knife..",
        "Bake in the preheated oven until the crust is golden brown and the filling is bubbling, 55 minutes to 1 hour. Cover the pie edges with strips of aluminum foil if they start to brown too quickly. Cool completely before serving."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 cup vegetable shortening, chilled",
        "1/2 cup unsalted butter, chilled",
        "1/4 cup ice water, or as needed",
        "2 1/2 cups chopped fresh strawberries",
        "2 1/2 cups chopped fresh rhubarb",
        "1 1/4 cups white sugar",
        "2 tablespoons quick-cooking tapioca",
        "2 tablespoons all-purpose flour",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon orange juice",
        "1/4 teaspoon grated orange zest",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons butter, chilled and cut into small pieces",
        "1 egg white, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nicki's Summer Strawberry Rhubarb Pie",
    "url": "http://allrecipes.com/recipe/216994/nickis-summer-strawberry-rhubarb-pie/"
}
