{
    "directions": [
        "Peel the eggplants, leaving a 1/2-inch strip on each of four sides. Trim the ends and cut into 1/2-inch slices. Layer the slices in a colander and sprinkle each layer with a little salt. Cover with wax paper and weigh down with something heavy, such as a large can. Set the colander in the sink. Let the eggplant stand for 30 minutes to an hour to drain off the bitter juices. Press down with your hands to extract all possible liquid.",
        "Dry the eggplant. Heat 3 tablespoons of the oil in a skillet over moderately high heat. Fry about one third of the eggplant slices until golden on both sides. Remove with a slotted spoon to paper towels to drain. Add 2 to 3 more tablespoons oil to the skillet and fry another third of the eggplant slices. Remove and drain. Add 2 more tablespoons of oil and fry the remaining eggplant. Drain and reserve.",
        "Place the anchovies in lukewarm water to cover to remove the salt. Soak for 5 minutes; change the water; let stand for 10 more minutes. As the anchovies are soaking, heat the remaining 4 tablespoons oil in a medium saucepan. Add the onion and garlic and cook over moderate heat, stirring constantly, until soft. Add the tomatoes. Bring to a boil. Lower the heat and cook, uncovered, for 10 to 15 minutes, or until the sauce has thickened.",
        "While the sauce is cooking, chop the anchovies fine. Stir the anchovies and fried eggplant slices into the sauce with a fork, mashing the eggplant into lumps. Depending on the tomatoes, the sauce may be very thick. Thin it with the wine to the consistency of pancake batter. Taste for saltiness and, if necessary, add a little more salt. Add a generous amount of pepper, stir in the basil leaves, and continue to cook. In a kettle of boiling salted water cook the pasta until it is al dente and drain.",
        "Pour the sauce into a heated serving dish and add the pasta. Toss and sprinkle with the pecorino. Toss again at the table."
    ],
    "ingredients": [
        "2 medium eggplants (about 1 pound each)",
        "Salt",
        "3/4 cup olive oil, or as needed",
        "5 anchovy fillets",
        "1 large onion, chopped (about 1 1/4 cups)",
        "2 large garlic cloves, minced",
        "1 pound ripe Italian plum tomatoes, peeled and chopped",
        "1/2 to 1 cup dry white wine",
        "ground black pepper",
        "1/3 cup shredded fresh basil leaves or 1 tablespoon dried basil",
        "1 pound penne or other short pasta",
        "3/4 cup grated pecorino cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fish",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Dinner",
        "Lunch",
        "Eggplant",
        "Winter",
        "Noodle"
    ],
    "title": "Nika Hazleton's Penne with Tomato, Eggplant, and Anchovy Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/nika-hazletons-penne-with-tomato-eggplant-and-anchovy-sauce-5104"
}
