{
    "directions": [
        "Combine water, rice, and 1/2 teaspoon salt in a saucepan; bring to a boil. Reduce heat to low, cover, and cook until rice is tender, about 20 minutes. Remove from heat and add 1 tablespoon butter; stir until rice is fluffy.",
        "Preheat oven to 350 degrees F (175 degrees C). (If using a countertop induction oven, preheat on the \"Combo 1\" setting.)",
        "Place pork chops in a 9-inch baking pan (or grill pan if using the countertop induction oven). Drizzle olive oil on top. Sprinkle Creole seasoning, salt, and pepper over both sides. Arrange green bell pepper and onion slices on and around pork chops.",
        "Bake in the preheated oven until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), about 20 minutes in the conventional oven and 10 to 15 minutes in the countertop induction oven. Cover with aluminum foil.",
        "Melt 1/4 cup butter in a large skillet over medium heat. Add mushrooms and chopped onion; cook and stir until onion is translucent, about 5 minutes. Pour in half-and-half. Stir in flour slowly; cook and stir until sauce thickens, about 5 minutes.",
        "Pour sauce over pork chops; stir to incorporate juices in the pan.",
        "Return pork chops to the preheated oven and bake until flavors combine, 3 to 5 minutes. Serve over rice. Sprinkle paprika on top."
    ],
    "ingredients": [
        "Rice:",
        "2 cups water",
        "1 cup white jasmine rice",
        "1/2 teaspoon salt",
        "1 tablespoon butter",
        "Pork Chops:",
        "4 (1/2-inch thick) pork chops",
        "1 tablespoon olive oil, or to taste",
        "1/2 teaspoon Creole seasoning, or to taste",
        "salt and ground black pepper to taste",
        "1 green bell pepper, sliced",
        "1/2 small onion, sliced",
        "Cream Sauce:",
        "1/4 cup butter",
        "1/2 cup sliced fresh mushrooms",
        "1/4 cup chopped onion",
        "2 cups half-and-half",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon ground paprika, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nikki's Pork Chops with a Mushroom Cream Sauce over White Jasmine Rice",
    "url": "http://allrecipes.com/recipe/255323/nikkis-pork-chops-with-a-mushroom-cr/"
}
