{
    "directions": [
        "Cook butter in a small saucepan over medium heat, stirring often, until butter foams, then browns (be careful not to let it burn), 5–8 minutes. Remove from heat.",
        "Meanwhile, process cookies in a food processor until finely ground. (Alternatively, place cookies in a large resealable bag and crush to fine crumbs with a rolling pin or heavy pot). Transfer to a medium bowl.",
        "Add 1/2 cup brown butter and a pinch of salt to cookie crumbs and mix until well blended (mixture should resemble wet sand). Transfer to a 9\" pie dish and press evenly into bottom and up sides of dish with a measuring cup (make sure to come up all the way to the top lip of the pie dish). Chill 20 minutes.",
        "Brush the bottom of crust with 2 oz. melted chocolate; return to refrigerator.",
        "Whisk egg yolks and cornstarch in a medium bowl. Whisk cream and cocoa powder in a medium saucepan until no lumps remain; whisk in milk and sweetened condensed milk and bring to a bare simmer over medium heat. Whisking constantly, gradually add milk mixture to egg mixture, then, still whisking, pour egg mixture into pan. Cook over medium heat, still whisking, until mixture is considerably thickened with the occasional bubble rising to the surface (think chocolate pudding), about 4 minutes. Add remaining 6 oz. chocolate to custard and remaining 1/2 cup brown butter; whisk until smooth. Scrape into chilled crust and chill until custard is cold and set, at least 2 hours.",
        "Using an electric mixer on high, beat egg whites until loose and foamy, about 2 minutes. With motor running, gradually add granulated sugar and beat until stiff, shiny peaks form, about 5 minutes. Gradually add powdered sugar and beat another 2 minutes (meringue will deflate slightly when you add the powdered sugar but will regain volume).",
        "Spoon meringue over pie, swirling decoratively. Use a kitchen torch to toast meringue, if desired.",
        "Pie with meringue can be made 1 day ahead. Chill."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "6 ounces chocolate wafer cookies",
        "Kosher salt",
        "8 ounces bittersweet chocolate, melted, divided",
        "4 large egg yolks",
        "3 tablespoons cornstarch",
        "1 1/2 cups heavy cream",
        "2 tablespoons unsweetened cocoa powder",
        "1 1/2 cups whole milk",
        "3/4 cup sweetened condensed milk",
        "4 large egg whites",
        "1/2 cup granulated sugar",
        "3/4 cup powdered sugar, sifted",
        "A kitchen torch (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "No-Bake Chocolate Cream Pie With Toasted Meringue",
    "url": "http://www.epicurious.com/recipes/food/views/no-bake-chocolate-cream-pie-with-toasted-meringue"
}
