{
    "directions": [
        "In a bowl, combine the oats, raisins, and seeds.",
        "Place the Marshmallow Creme, butter, and milk in a large, heavy saucepan. Cook over medium heat, stirring with a heatproof spatula, until the marshmallow is mostly melted.",
        "Add the peanut butter, cinnamon and vanilla extract. When a few lumps remain, remove the pot from the heat and stir until the mixture is smooth. Add the oat mixture and stir until all the ingredients are well combined.",
        "Spread the oat mixture in the prepared pan in an even layer. Moisten your hand lightly with water and press to pack it firmly.",
        "Refrigerate until the oat mixture sets.",
        "Using a sharp knife, cut the chilled oats into 3 wide strips. Cut each strip crosswise into 8 bars. Serve cold or at room temperature.",
        "For the homemade marshmallow creme: In the bowl of a stand mixer fitted with a whisk, sprinkle the gelatin over the cold water. Let sit.",
        "Place the Stevia In The Raw in a small bowl and mix 1 tablespoon water into the stevia until it looks like soft marshmallow. Set aside.",
        "Place the sugar and corn syrup in a heavy medium-sized saucepan. Add 1/3 cup water.",
        "Cook over medium heat until the mixture boils and registers 225 degrees F on an instant-read or candy thermometer, about 5 minutes.",
        "Continue boiling the sugar and when it reaches 235 degrees  F (about 3 more minutes) start watching it carefully. When the thermometer registers 240 degrees  F - \"soft ball\" stage - about 3 more minutes, immediately remove the pot from the heat.",
        "Promptly start beating the softened gelatin at medium speed and carefully pour the hot sugar syrup slowly down the side of the bowl in a thin stream.",
        "Add the stevia and vanilla. Increase the speed to high and beat until the mixture triples in volume and looks like Italian meringue or well-beaten whipped cream, 5 to 6 minutes. The creme will flow from the bottom of the whisk in an even, thick column.",
        "If not using Marshmallow Creme immediately, pack it into a plastic container, cover tightly, and store at room temperature for up to 2 days"
    ],
    "ingredients": [
        "Oat Bars:",
        "3 cups quick cooking oats (not instant)",
        "1 cup raisins",
        "1/2 cup raw sunflower seeds",
        "1/3 cup raw pumpkin seeds",
        "1/4 cup toasted sesame seeds",
        "4 cups Homemade Stevia Marshmallow Crème (see recipe below)",
        "3 tablespoons unsalted butter",
        "2 tablespoons 2% milk",
        "1/2 cup natural smooth peanut butter",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "Homemade Stevia Marshmallow Crème:",
        "1/2 cup cold water",
        "2 (.25 ounce) packages unflavored gelatin",
        "2/3 cup Stevia In The Raw® Bakers Bag",
        "2/3 cup sugar",
        "2 tablespoons light corn syrup",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "No-Bake Nutty Oat Bars",
    "url": "http://allrecipes.com/recipe/256471/no-bake-nutty-oat-bars/"
}
