{
    "directions": [
        "1. Read the package directions on the graham cracker crust and prebake if necessary. You can, of course, use your favorite homemade crust recipe, pressed into a 9-inch pie pan and prebaked. In either case, let the crust cool on a cooling rack while you prepare the apples.",
        "2. Melt the butter in a large nonreactive skillet or sauté pan. Add the apples and cook, stirring, over medium heat until they're just about tender, 5 to 6 minutes. Stir in the confectioners' sugar and lemon juice, cook for another minute or so, and remove from the heat. Scrape the apples and their juice onto a large plate and let cool.",
        "3. When the apples are almost cool, scrape them and their juice into the pie shell, spreading them evenly in the crust. Without measuring — that's the fun part, not measuring — slowly pour a little less than half of the bottle of caramel evenly over the apples. Put the pie shell in the freezer for 30 minutes to firm up the apples and caramel. When you do this, put the ice cream in the refrigerator to soften it.",
        "4. After 30 minutes, spoon the softened ice cream over the apples, pressing it down and smoothing it out with the back of a fork. Now pour as much of the remaining caramel over the ice cream as you like. You can pour it in a spiral, a zigzag, or any decorative fashion you like. (Note to kids: you probably won't need to use all of the remaining topping, but you don't have to tell your parents I said that, if you don't want to.) Sprinkle the nuts over the top of the pie, then put the pie back in the freezer for 1 hour to firm it up. No cheating and taking it out before an hour is up. Slice and serve."
    ],
    "ingredients": [
        "1 large store-bought graham cracker crust",
        "2 tablespoons unsalted butter",
        "3 Golden Delicious apples, peeled, cored, and cut into 1-inch chunks",
        "1/4 cup confectioners' sugar, sifted",
        "1 1/2 tablespoons fresh lemon juice",
        "One 12-ounce jar Dulce de Leche caramel topping",
        "1 quart vanilla ice cream",
        "1/2 cup chopped walnuts or pecans, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "No-Cook",
        "Kid-Friendly",
        "Apple",
        "Walnut",
        "Fall"
    ],
    "title": "No-Bake Apple Ice Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/no-bake-apple-ice-cream-pie-107349"
}
