{
    "directions": [
        "Prepare the pastry, roll it out, and line the pie plate. Prick the pastry bottom with a fork and chill until firm. Preheat the oven to 425°F. Completely blind-bake the shell.",
        "In a food processor or using a fork, mash 1 1/2 cups of the cut-up mixed fruit or berries. Measure the sugar, cornstarch, and water into a saucepan and whisk until smooth. Stir in the mashed fruit and cook over medium-low heat for 7 to 10 minutes, or until the mixture is thick and clear. Stir in the lemon juice.",
        "Taste the cooked sauce and correct the balance of sugar and lemon if necessary. Stir in the butter and all the remaining cut-up fresh fruit and berries. Firm fruits like apples or plums are best slightly mashed into the cooked sauce, while softer fresh fruits and berries should simply be stirred in. Chill until partially thickened, then spoon into the cooked pastry shell and chill for at least 3 hours to set. Serve with ice cream or sweetened whipped cream."
    ],
    "ingredients": [
        "9-inch pie plate; food processor or bowl and fork; 2 1/2-quart non-reactive saucepan",
        "4 cups any combination of fresh berries, picked over, washed, hulled, if necessary, and drained until dry, and/or cut-up peeled fresh fruit, divided (1 1/2 cups and 2 1/2 cups), (Note: try blueberries and peaches, or raspberries and nectarines, or blueberries and strawberries, or plums and peaches with Marionberries or huckleberries; do not peel plums, nectarines or pears)",
        "2/3 to 1 cup granulated sugar (depending on sweetness of fruit)",
        "3 tablespoons cornstarch",
        "1 cup water",
        "1 tablespoon fresh lemon juice, or more as needed",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Fourth of July",
        "Kid-Friendly",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "No-Bake Fresh Fruit Pie",
    "url": "http://www.epicurious.com/recipes/food/views/no-bake-fresh-fruit-pie-103948"
}
