{
    "directions": [
        "Chop chocolate and in a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove top of double boiler or bowl from heat and let chocolate cool to room temperature, stirring occasionally, about 15 minutes. In a bowl with an electric mixer beat together butter and confectioners' sugar until combined well and beat in chocolate, water, 2 tablespoons liqueur, vanilla, and salt. In another bowl beat 1 cup cream until it just holds stiff peaks and fold into chocolate mixture gently but thoroughly.",
        "In a small bowl stir together milk and remaining 4 tablespoons liqueur. Working with 1 vanilla wafer at a time, dip wafers into milk mixture twice and arrange enough in a 10-inch springform pan, touching each other, to cover bottom of pan in one tight layer. (Do not worry about spaces between wafers.) Cover wafers in pan with one third chocolate mousse, spreading evenly.",
        "Make another layer of dipped vanilla wafers on top of mousse in pan in same manner and cover with half of remaining mousse, spreading evenly. Make a third layer of dipped vanilla wafers and cover with remaining mousse. Cover chocolate with a final layer of dipped vanilla wafers. (There will be about 1/2 box cookies left over.) Chill torte, covered, at least 6 hours and up to 3 days or freeze torte, well-wrapped, up to 3 months.",
        "Run a thin knife around edge of torte and remove side of pan. Smooth side of torte with a knife dipped in hot water. In a bowl beat remaining cup cream until it just holds stiff peaks and spread over top of torte.",
        "Garnish torte with chocolate shavings and serve chilled or at cool room temperature."
    ],
    "ingredients": [
        "8 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup confectioners' sugar",
        "2 tablespoons hot water",
        "6 tablespoons Kahlúa or other coffee-flavored liqueur",
        "1/2 teaspoon vanilla",
        "1/4 teaspoon salt",
        "2 cups well-chilled heavy cream",
        "3/4 cup milk",
        "two 12-ounce boxes vanilla wafers",
        "Garnish: chocolate shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Dessert",
        "No-Cook",
        "Graduation",
        "Kahlúa",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "No-Bake Chocolate Torte Salamon",
    "url": "http://www.epicurious.com/recipes/food/views/no-bake-chocolate-torte-salamon-15272"
}
