{
    "directions": [
        "Preheat oven to 350°F. Blend first 4 ingredients in processor until graham crackers are finely ground. Add butter and vanilla; process until moist crumbs form. Press crumb mixture onto bottom and 1 inch up sides of 9-inch-diameter springform pan. Bake crust until deep golden brown, about 12 minutes. Cool.",
        "Pour 1/4 cup water into small saucepan; sprinkle gelatin over. Let stand 10 minutes. Stir over very low heat just until gelatin dissolves. Set aside.",
        "Blend cream cheese, cream, sugar, and lemon juice in processor until smooth. Add berries; puree until smooth (some blueberry bits will remain). With machine running, add warm gelatin mixture through feed tube and blend well. Pour filling into crust. Cover; chill overnight. (Can be made 2 days ahead. Keep chilled.) Run knife around pan sides to loosen cake. Release pan sides. Transfer to platter.",
        "Beat cream and sugar in medium bowl until firm peaks form. Spread cream mixture thickly over top of cheesecake. Place berries in bowl. Heat jam in small saucepan over low heat until just melted. Pour jam over berries; toss to coat. Mound coated berries in center of cream, leaving 1-inch plain border. Chill cake at least 1 hour and up to 1 day."
    ],
    "ingredients": [
        "9 whole graham crackers",
        "1/2 cup old-fashioned oats",
        "3 tablespoons (packed) golden brown sugar",
        "1/8 teaspoon salt",
        "5 tablespoons unsalted butter, melted",
        "1 teaspoon vanilla extract",
        "1/4 cup water",
        "1 tablespoon unflavored gelatin (measured from 2 envelopes)",
        "12 ounces Philadelphia-brand cream cheese, room temperature",
        "1 cup heavy whipping cream",
        "1 cup sugar",
        "1 tablespoon fresh lemon juice",
        "3 cups fresh blueberries",
        "1 cup chilled heavy whipping cream",
        "1 tablespoon sugar",
        "4 1/2-pint baskets blueberries",
        "2/3 cup blueberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Cheese",
        "Dessert",
        "No-Cook",
        "Mother's Day",
        "Blueberry",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "No-Bake Blueberry Cheesecake with Graham Cracker Crust",
    "url": "http://www.epicurious.com/recipes/food/views/no-bake-blueberry-cheesecake-with-graham-cracker-crust-108320"
}
