{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Spray a 9x13 inch baking pan lightly with nonstick spray; set aside.",
        "Mix the persimmon pulp with the 2 cups sugar in a large bowl; set aside. Whisk together the eggs and baking soda in a small bowl. Add the egg mixture to the persimmon mixture and beat well; set aside.",
        "Whisk together the 1 cup flour, salt, baking powder, and cinnamon in a bowl. Stir 1/4 of the flour mixture to the persimmon mixture. Add 1/4 of the buttermilk and mix well. Continue alternating flour and buttermilk, adding 1/4 each time, and mixing well after each addition, until all of the flour mixture and buttermilk are incorporated. Stir in cream, honey, and melted butter until well combined. Pour the pudding batter into the prepared pan.",
        "Bake in the preheated oven until set, about 1 hour. While baking, do not stir; Turn off the oven at the end of the baking time, but do not remove the pudding from the oven.",
        "Meanwhile, when the pudding has about 10 minutes of baking time left, make the sauce. Boil the water in a small saucepan. Whisk 1/2 cup sugar and 1 tablespoon flour together, and whisk sugar mixture into the boiling water, whisking until smooth. Boil the sauce for 5 minutes and remove from heat. Stir in vanilla.",
        "Pour the sauce mixture evenly over the pudding, and leave the pudding to cool in the warm oven for 20 more minutes, being sure that the oven is off so that the pudding does not continue to cook."
    ],
    "ingredients": [
        "Pudding",
        "2 cups persimmon pulp",
        "2 cups white sugar",
        "2 eggs, beaten",
        "1 teaspoon baking soda",
        "1 cup all-purpose flour",
        "1 pinch salt",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1 1/2 cups buttermilk",
        "1/4 cup heavy cream",
        "1 tablespoon honey",
        "4 tablespoons butter, melted",
        "Sauce",
        "1 cup water",
        "1/2 cup white sugar",
        "1 tablespoon all-purpose flour",
        "4 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nonnie's Persimmon Pudding",
    "url": "http://allrecipes.com/recipe/95191/nonnies-persimmon-pudding/"
}
