{
    "directions": [
        "Put pickles and onions in a colander; stir in salt and top with ice. Let mixture sit for 3 hours.",
        "Combine vinegar, sugar, mustard seed, cloves, celery seed, and turmeric together in a large pot; bring to a boil. Cook and stir vinegar mixture until sugar is dissolved into syrup, about 10 minutes.",
        "Drain pickles and onions and add to syrup; bring to a boil and cook until onions are tender, 5 to 10 minutes.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack pickles and syrup into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "18 dill pickles, washed and sliced",
        "8 small onions, thinly sliced",
        "1/2 cup salt",
        "2 cups ice cubes, or as needed",
        "Syrup:",
        "5 cups vinegar",
        "4 cups white sugar",
        "2 tablespoons mustard seed",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon celery seed",
        "1/2 teaspoon ground turmeric",
        "6 1-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nonni's Bread and Butter Pickles",
    "url": "http://allrecipes.com/recipe/238872/nonnis-bread-and-butter-pickles/"
}
