{
    "directions": [
        "Soak mushrooms in hot water to cover until tender, about 30 minutes. Drain well, discarding soaking liquid and stems, then finely chop caps.",
        "While mushrooms soak, finely chop pork belly (partially frozen meat will be easier to chop; return pork to freezer if it's too thawed to chop), then bring to room temperature.",
        "Heat wok over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add peanut oil, swirling to coat wok evenly, and heat until just smoking. Reduce heat to moderate and stir-fry pork until no longer pink, about 3 minutes. Add mushrooms and shallots and stir-fry 2 minutes.",
        "Add soy sauce, wine, and rock sugar and cook, stirring, until sugar is dissolved. Add water, licorice root, and salt and bring to a boil. Transfer to clay pot and simmer, uncovered, stirring occasionally, until mixture has reduced and thickened to a sauce-like consistency, about 1 hour. Discard licorice root.",
        "Bring stock to a simmer in a 3-quart saucepan.",
        "Blanch bean sprouts in 6- to 8-quart pot of boiling unsalted water 30 seconds, then transfer to individual serving bowls. Boil noodles in same water according to package instructions, then drain and divide among 12 bowls. Sprinkle with cilantro and spoon pork topping over noodles. Add enough stock to almost cover noodles, then add 1/4 teaspoon vinegar to each bowl and top with 1/4 teaspoon mashed garlic and 1 shrimp."
    ],
    "ingredients": [
        "1 oz dried Chinese black mushrooms or dried shiitakes",
        "1 lb boneless fatty pork belly (preferably with skin, partially frozen)",
        "1/4 cup peanut oil",
        "1/2 cup finely chopped shallots (2 medium)",
        "2/3 cup dark soy sauce",
        "2 1/2 tablespoons Chinese Shaoxing cooking wine or medium-dry Sherry",
        "2 oz Chinese rock sugar (sometimes called rock candy), crushed with bottom of a heavy skillet",
        "2 1/3 cups water",
        "2 slices dried licorice root or 2 Turkish bay leaves",
        "1/2 teaspoon salt",
        "About 6 cups chicken stock (or 5 cups reduced-sodium chicken broth plus 1 cup water)",
        "2 cups fresh mung bean sprouts",
        "1 lb dried Chinese wheat noodles or rice vermicelli",
        "1 cup chopped fresh cilantro (from 2 bunches)",
        "1 tablespoon Chinese black vinegar (preferably Chinkiang)",
        "1 tablespoon minced garlic (about 3 cloves), mashed to a paste with side of a large heavy knife",
        "12 cooked peeled shrimp",
        "Special equipment: a well-seasoned 14-inch flat-bottomed wok; a 2-qt Chinese clay pot or heavy saucepan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wok",
        "Chicken",
        "Fish",
        "Garlic",
        "Herb",
        "Mushroom",
        "Onion",
        "Soy",
        "Stir-Fry",
        "Gourmet"
    ],
    "title": "Noodle Soup with Soy-Cooked Pork (Slack Season Tan Tsi)",
    "url": "http://www.epicurious.com/recipes/food/views/noodle-soup-with-soy-cooked-pork-slack-season-tan-tsi-236022"
}
