{
    "directions": [
        "Adjust an oven rack to the center position and preheat the oven to 425°F. Coat a heavy baking sheet with vegetable cooking spray or line it with a silicone baking pan liner or aluminum foil.",
        "In a large bowl, stir together the all-purpose flour and whole wheat flour. Add the butter and work it into the dry ingredients with your fingertips until the fat particles are very fine. Stir in the baking soda, salt, sugar, wheat bran, oat bran, wheat germ, flaxseed, and sunflower seeds.",
        "Beat the egg lightly with a fork in a 2-cup glass measure. Add enough buttermilk to come to the 2-cup line and stir with the fork to combine well. Add the liquid to the dry ingredients and stir with a wooden spoon or rubber spatula until the dough gathers into a thick, wet-looking mass.",
        "Sprinkle your work surface with whole wheat flour and scrape the dough onto it. Dust the dough with a bit more whole wheat flour. Pat the dough into a circular shape about 7 inches across and 2 inches high and transfer it to the prepared baking sheet. Don't be concerned about evenness—the loaf should look rustic. Make a cross-shaped indentation on top of the loaf going right to the edges. I use a plastic bench scraper and press it into the dough very gently; don't actually cut the dough. During baking the indentation expands, giving the top of the loaf an attractive pattern.",
        "Bake the bread for about 40 minutes, until it is well browned and sounds hollow when rapped on the bottom. An instant-read thermometer inserted into the center of the loaf should register 195° to 200°F. Cool the loaf on a wire cooling rack, and serve warm or at room temperature. Cut into quarters and slice each quarter with a sharp serrated knife. Delicious with butter.",
        "The loaf keeps well at room temperature, wrapped in plastic wrap, for 2 to 3 days. The entire loaf or quarters of it can also be frozen when completely cool. Wrap in plastic wrap, place in heavy-duty resealable plastic bags, and freeze for up to 2 weeks. Thaw completely before unwrapping. If desired, refresh the bread in a preheated 300°F oven for 10 minutes."
    ],
    "ingredients": [
        "1 3/4 cups unbleached all-purpose flour",
        "1 cup whole wheat flour or graham flour, plus more for shaping",
        "3 tablespoons cold unsalted butter, cut into tablespoon-sized pieces",
        "2 teaspoons baking soda",
        "1 3/4 teaspoons salt",
        "2 tablespoons granulated sugar",
        "1/4 cup wheat bran",
        "1/4 cup oat bran",
        "1/4 cup untoasted wheat germ",
        "2 tablespoons flaxseed",
        "1/3 cup raw sunflower seeds",
        "1 large egg",
        "About 1 3/4 cups buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Breakfast",
        "Side",
        "Bake",
        "St. Patrick's Day",
        "Healthy",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Noreen Kinney's Irish Soda Bread",
    "url": "http://www.epicurious.com/recipes/food/views/noreen-kinneys-irish-soda-bread-241956"
}
