{
    "directions": [
        "Preheat the oven to 375 degrees.",
        "Place the bacon in a medium sauté pan over medium-low heat. Sauté the bacon for about 5 minutes, or until it has begun to crisp and most of the fat has rendered out. Add the garlic, onion, and carrot and continue to sauté for about 4 minutes, or until the vegetables are soft and the onions are translucent but have not taken on any color. Remove the pan from the heat and allow the vegetables to cool (see Note).",
        "Place the ground sirloin into a large mixing bowl. Add the eggs and milk and, using your hands, work the liquid into the meat. Add the bread crumbs and continue to work the liquid and crumbs into the meat. Add the cooled vegetables, mustard, barbecue sauce, and horseradish along with 1/4 cup of the parsley, salt, pepper, and thyme. Using your hands, gently work all of the ingredients into the meat until well combined.",
        "Place one-half of the croutons into a shallow baking dish at least 14 inches long.",
        "Transfer the meatloaf mixture onto a clean, flat surface and, again, using your hands, shape it into a loaf about 3 1/4 inches wide X 2 1/2 inches high X 12 inches long (or into a round, breadlike form, a letter of the alphabet, an oval, or into several small loaves). Press the remaining croutons into the loaf, making sure that they are partially pressed down into it.",
        "Gently press the unpeeled garlic cloves into the top of the meatloaf. Carefully lay the loaf on top of the croutons in the baking dish (you might need to use a couple of spatulas to facilitate this), reforming the shape with your hands, if necessary. Pierce the meatloaf with the bay leaves and thyme sprig. Place the meatloaf in the preheated oven and bake for 1 hour, or until the internal temperature reads 165 degrees on an instant-read thermometer and the top is nicely browned.",
        "Remove the pan from the oven. Allow the meatloaf to rest for about 5 minutes before transferring it to a serving platter. Remove the bay leaves and thyme sprig and sprinkle the remaining parsley over the top of the loaf and around the platter. Cut crosswise into 1-inch, or thicker, slices and serve."
    ],
    "ingredients": [
        "5 strips lean bacon, finely chopped",
        "6 cloves garlic, minced",
        "2 medium onions, finely chopped",
        "1 medium carrot, finely chopped",
        "2 pounds very lean ground beef sirloin",
        "2 large eggs",
        "1/2 cup milk",
        "1 cup finely ground fresh bread crumbs",
        "1/4 cup Dijon mustard",
        "1/4 cup barbecue sauce",
        "1 tablespoon bottled horseradish, well drained",
        "1/2 cup finely chopped fresh flat-leaf parsley",
        "2 tablespoons coarse salt",
        "1 tablespoon freshly ground black pepper",
        "1 teaspoon finely minced fresh thyme (or 1/4 teaspoon dried thyme)",
        "2 to 3 cups croutons",
        "10 whole, unpeeled, garlic cloves",
        "4 bay leaves",
        "1 sprig fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mustard",
        "Onion",
        "Pepper",
        "Bake",
        "Horseradish",
        "Ground Beef",
        "Bacon",
        "Thyme",
        "Parsley"
    ],
    "title": "Not-So-Basic Meatloaf",
    "url": "http://www.epicurious.com/recipes/food/views/not-so-basic-meatloaf-355903"
}
