{
    "directions": [
        "In a medium bowl, mix together the brown sugar, chili powder, paprika, black pepper, 2 tablespoons garlic powder, 2 teaspoons onion powder, kosher salt, cumin, cinnamon, jalapeno seasoning, and cayenne pepper. Rub generously onto the pork spareribs. Cover, and refrigerate for at least 4 hours, or overnight.",
        "Prepare an outdoor grill for indirect heat, or preheat a smoker to 250 degrees F (120 degrees C). Soak wood chips (apple or cherry are our favorites).",
        "While the grill heats up, prepare the mop sauce. In a medium bowl, stir together the apple cider, apple cider vinegar, 1 tablespoon onion powder, 1 tablespoon garlic powder, lemon juice, jalapeno, hot pepper sauce, salt and pepper.",
        "When the coals are gray and ashed over, place 2 handfuls of soaked woodchips directly on them. Place the ribs on the grill grate bone-side down. Cover, and cook for 3 1/2 to 4 hours. Add more coals as needed. Baste with the mop sauce, and throw handfuls of soaked woodchips onto the coals every hour. Keep the temperature of the grill or smoker from going below 225 degrees F (110 degrees C). Ribs are done when the rub has created a wonderful crispy blackened 'bark', and the meat has pulled away from the bone. Discard any leftover mop sauce."
    ],
    "ingredients": [
        "6 pounds pork spareribs",
        "Dry rub:",
        "1/2 cup packed brown sugar",
        "2 tablespoons chili powder",
        "1 tablespoon paprika",
        "1 tablespoon freshly ground black pepper",
        "2 tablespoons garlic powder",
        "2 teaspoons onion powder",
        "2 teaspoons kosher salt",
        "2 teaspoons ground cumin",
        "1 teaspoon ground cinnamon",
        "1 teaspoon jalapeno seasoning salt (optional)",
        "1 teaspoon cayenne pepper",
        "Mop Sauce:",
        "1 cup apple cider",
        "3/4 cup apple cider vinegar",
        "1 tablespoon onion powder",
        "1 tablespoon garlic powder",
        "2 tablespoons lemon juice",
        "1 jalapeno pepper, finely chopped (optional)",
        "3 tablespoons hot pepper sauce",
        "kosher salt and ground black pepper to taste",
        "2 cups wood chips, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Not Your Every Day Smoked Pork Spare Ribs",
    "url": "http://allrecipes.com/recipe/85634/not-your-every-day-smoked-pork-spare/"
}
