{
    "directions": [
        "Combine milk and 3 tablespoons butter in a microwave-safe bowl; heat in microwave until butter is just melted and milk is warmed (120 degrees F/49 degrees C to 130 degrees F/54 degrees C), 30 to 60 seconds.",
        "Mix pumpkin, white sugar, and salt together in a bowl; beat in egg and yeast. Stir milk mixture into pumpkin mixture until evenly combined.",
        "Whisk all-purpose flour and bread flour together in a bowl and divide mixture in half. Beat 1/2 the flour mixture into the pumpkin mixture on low until well mixed, about 5 minutes. Add remaining flour mixture and beat until dough is very soft.",
        "Turn dough into a bowl that has been greased or sprayed with cooking spray; lightly grease or spray dough. Cover bowl with a damp cloth and let rise in a warm area until dough is doubled in size, about 1 hour.",
        "Grease or spray an oblong baking sheet with cooking spray.",
        "Punch the risen dough down and turn onto a well floured work surface; knead until dough is smooth and easy to handle, 1 to 2 minutes. Roll dough into a 10x12-inch rectangle and brush top with melted butter. Sprinkle cinnamon, brown sugar, pecans, and currants, respectively, onto the butter layer. Roll dough, beginning with long side, around filling in a jelly roll fashion and pinch the other side onto the roll to seal. Cut roll into 12 slices.",
        "Arrange rolls, cut-side up, on the prepared baking sheet. Cover with a towel and let rise until nearly doubled in size, 30 to 45 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove towel from rolls and bake rolls in the preheated oven until golden, about 20 minutes.",
        "Beat cream cheese and 1/2 cup butter together in a bowl using an electric mixer until smooth; beat in confectioners' sugar and vanilla extract until icing is fluffy and smooth. Spread icing on pumpkin rolls."
    ],
    "ingredients": [
        "Rolls:",
        "1/3 cup milk",
        "3 tablespoons unsalted butter",
        "1/2 cup solid-pack pumpkin",
        "3 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 large egg, beaten",
        "1 (.25 ounce) package rapid rise yeast",
        "1 cup unbleached all-purpose flour",
        "1 cup bread flour",
        "3 tablespoons unsalted butter, melted",
        "1 tablespoon ground cinnamon",
        "3/4 cup dark brown sugar",
        "1/3 cup finely chopped pecans",
        "1/4 cup dried currants (optional)",
        "Icing:",
        "1 (8 ounce) package cream cheese",
        "1/2 cup unsalted butter, softened",
        "1 (16 ounce) box confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Nutty Cinnamon and Currant Pumpkin Rolls",
    "url": "http://allrecipes.com/recipe/234859/nutty-cinnamon-and-currant-pumpkin-ro/"
}
