{
    "directions": [
        "In the bowl of a standing mixer fitted with a dough hook, proof the yeast by combining it with the warm water and sugar. Stir gently to dissolve. Let stand 3 minutes until foam appears. Turn mixer on low and slowly add the flour to the bowl. Dissolve salt in 2 tablespoons of water and add it to the mixture. Pour in 1/4 cup olive oil. When the dough starts to come together, increase the speed to medium. Stop the machine periodically to scrape the dough off the hook. Mix until the dough is smooth and elastic, about 10 minutes, adding flour as necessary.",
        "Turn the dough out onto a work surface and fold over itself a few times. Form the dough into a round and place in an oiled bowl, turn to coat the entire ball with oil so it doesn't form a skin. Cover with plastic wrap or damp towel and let rise over a gas pilot light on the stovetop or other warm place until doubled in size, about 45 minutes.",
        "Coat a sheet pan with a little olive oil and corn meal. Once the dough is doubled and domed, turn it out onto the counter. Roll and stretch the dough out to an oblong shape about 1/2-inch thick. Lay the flattened dough on the pan and cover with plastic wrap. Let rest for 15 minutes.",
        "In the meantime, coat a small saute pan with olive oil, add the onion, and cook over low heat for 15 minutes until the onions caramelize. Preheat oven to 400 degrees F. Uncover the dough and dimple with your fingertips. Brush the surface with more olive oil and then add caramelized onions, garlic, olives, cheese, salt, pepper, and rosemary. Bake on the bottom rack for 15 to 20 minutes."
    ],
    "ingredients": [
        "2 teaspoons rapid-rising dry yeast",
        "1 cup warm water",
        "2 tablespoons sugar",
        "3 1/2 to 4 cups flour",
        "1 tablespoon coarse salt",
        "1/4 cup olive oil",
        "Cornmeal, for dusting",
        "2 tablespoons olive oil",
        "1 onion, diced",
        "2 garlic cloves, minced",
        "10 Kalamata olives, pitted and quartered",
        "1/4 cup shredded Parmesan",
        "1 tablespoon coarse salt",
        "Freshly ground black pepper",
        "2 tablespoons fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Bread",
        "Focaccia Recipes",
        "Olive Recipes",
        "Vegetable",
        "Cheese",
        "Parmesan Cheese Recipes"
    ],
    "title": "Fabulous Focaccia",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/fabulous-focaccia-recipe"
}
