{
    "directions": [
        "Pour the warm water into a large bowl, and whisk in 4 teaspoons of bread flour, the yeast, and the white sugar until thoroughly combined and the sugar has dissolved. Allow to stand until the yeast starts to form creamy bubbles, about 5 minutes.",
        "Fit a dough blade into a large food processor, and place 3 1/2 cups of bread flour, the oats, whole wheat flour, salt, brown sugar, and vegetable oil into the work bowl. Start the food processor running, and slowly add enough of the water-yeast mixture to allow the dough to form a firm ball and pull away from the sides of the processor, about 1 minute. Process for another 30 seconds to knead.",
        "Place the dough into an oiled bowl, and turn to coat the dough with oil. Cover with a damp cloth, and allow the dough to rise until doubled, about 1 hour. Punch down the dough, and divide into 2 equal-sized pieces. Form each piece into a loaf; pinch the seams and ends closed.",
        "Grease 2 4x8-inch loaf pans, and place the loaves into the pans with the seam sides down. Allow to rise until the dough is 1 inch above the rim of the pans, about 1 more hour.",
        "While dough is rising, preheat oven to 350 degrees F (175 degrees C).",
        "Bake in the preheated oven until the tops are browned, about 35 minutes. Allow bread to cool in pans for 10 minutes, then turn out onto cooling racks to finish cooling."
    ],
    "ingredients": [
        "1 1/2 cups warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "4 teaspoons bread flour",
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon white sugar",
        "3 1/3 cups bread flour",
        "2/3 cup quick cooking oats",
        "2/3 cup whole wheat flour",
        "1 1/2 teaspoons salt",
        "3 1/2 tablespoons brown sugar",
        "3 1/2 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fabulous Homemade Bread For the Food Processor",
    "url": "http://allrecipes.com/recipe/219073/fabulous-homemade-bread-for-the-food/"
}
