{
    "directions": [
        "In a small 2 cup measuring cup, or something similar size and shape, combine all the marinade ingredients. Using an immersion blender, puree the marinade until smooth. Transfer to a re-sealable plastic bag and add the steak, seal and shake to coat. Refrigerate the beef for 2 to 4 hours to tenderize and flavor the beef.",
        "Preheat a ridged grill pan on high heat.",
        "Drain the marinade from the beef. Lightly oil the grill or grill pan. Season liberally with salt and freshly ground black pepper. Grill the steak over medium-high heat and cook for 4 minutes on each side and then transfer to a cutting board and let rest. Depending on the size of your grill pan you may need to cook in batches.",
        "Once the beef is off the grill pan and resting, add the bell peppers and onions tossed with lime juice and olive oil, if using. Grill the mixture for 7 to 8 minutes until the vegetables are just barely limp.",
        "While the peppers and onions are cooking, heat up the tortillas. Turn any free burners on a medium low flame. Place a tortilla on each flame and let it char about 30 seconds to 1 minute, flip the tortilla and repeat on the second side. Once heated and charred remove the tortilla to a clean tea towel and wrap to keep warm. Repeat until you have warmed all of your tortillas.",
        "You can also heat your tortillas in a microwave, lightly dampen a tea towel with some water, wrap the tortillas in the damp towel and heat in the microwave for about 1 minute. Check to see if they are warm, if not repeat the heating at 1 minute intervals until they are warm and pliable.",
        "Thinly slice the steak against the grain on a diagonal.",
        "Spread some guacamole on a tortilla, top with a few slices of steak, peppers and onions, and salsa. Roll up the tortilla to enclose the filling.",
        "May also be served with sour cream and shredded cheese.",
        "5 ripe Hass avocados",
        "3 to 4 limes, juiced",
        "1/2 small onion, chopped",
        "1 small garlic clove, minced",
        "1 serrano chile, chopped",
        "1 big handful fresh cilantro leaves, roughly chopped",
        "Kosher salt and freshly ground black pepper",
        "Drizzle olive oil",
        "Halve and pit the avocados. With a tablespoon, scoop out the flesh into a mixing bowl. Mash the avocados with a fork, leaving them still a bit chunky. Add all of the rest of the ingredients, and fold everything together.",
        "Lay a piece of plastic wrap directly on the surface of the guacamole so it doesn't brown and refrigerate for at least 1 hour before serving."
    ],
    "ingredients": [
        "1 orange, juiced",
        "2 limes, juiced",
        "4 tablespoons olive oil",
        "2 garlic cloves, roughly chopped",
        "3 chipolte chiles, in adobo sauce",
        "3 tablespoon roughly chopped fresh cilantro leaves",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "2 1/4 pounds skirt or flank steak, trimmed of fat cut into thirds or 8-inch pieces",
        "Salt and pepper",
        "2 red bell peppers, thinly sliced",
        "1 large onion, thinly sliced",
        "Lime juice, olive oil, optional",
        "12 flour tortillas, warm",
        "Guacamole, recipe follows",
        "Good quality store bought salsa"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fajita Recipes",
        "Dairy Recipes",
        "Beef",
        "Meat",
        "Fruit",
        "Orange Recipes",
        "Main Dish Recipes",
        "Recipes for Parties",
        "Super Bowl",
        "Cinco de Mayo",
        "Holiday",
        "Marinating Recipes"
    ],
    "title": "Fajitas",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/fajitas-recipe2"
}
