{
    "directions": [
        "Preheat oven to 350° F. Butter and flour a 9-inch square baking pan, knocking out excess flour.",
        "In a metal bowl set over a saucepan of barely simmering water melt chocolate and butter, stirring occasionally, until smooth. Remove bowl from heat and whisk 1/2 cup sugar into chocolate mixture. Add yolks 1 at a time, whisking well after each addition, and whisk in flour, cocoa powder, vanilla, and salt.",
        "In a bowl beat whites until they hold soft peaks and gradually add remaining 1/4 cup sugar, beating until whites just hold stiff peaks. Stir one fourth whites into chocolate mixture to lighten and fold in remaining whites gently but thoroughly.",
        "Pour batter into baking pan, spreading evenly, and bake in middle of oven 40 to 45 minutes, or until a tester comes out with moist crumbs adhering. Cool cake in pan on a rack. (Cake will sink as it cools and top crust will crack.) Cake may be made 1 day ahead and kept, covered, at room temperature.",
        "Cut cake into 9 squares (crust will shatter) and serve with ice cream, sauce, and whipped cream."
    ],
    "ingredients": [
        "9 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "3/4 cup sugar",
        "5 large eggs, separated",
        "3 tablespoons all-purpose flour",
        "2 tablespoons unsweetened cocoa powder",
        "1 teaspoon vanilla",
        "1/4 teaspoon salt",
        "coffee ice cream",
        "Butterscotch Sauce",
        "whipped cream if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Gourmet"
    ],
    "title": "Fallen Chocolate Cake Squares à la Mode with Butterscotch Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fallen-chocolate-cake-squares-a-la-mode-with-butterscotch-sauce-14038"
}
