{
    "directions": [
        "Combine all the ingredients in a large bowl. Set-aside.",
        "In a large heavy-bottomed casserole, ideally cast iron, heat 1/4 cup of the olive oil over a medium heat. Add the turnips, artichokes, carrots, and cardoon and cook for 2 minutes, stirring frequently. Add the porcini mushrooms and the fennel quarters and cook, shaking the pan from time to time, for 1 minute. Stir in the onions, and add enough chicken stock so that there is about 1/2 inch covering the bottom of the casserole. Cover and cook until all the vegetables are tender, about 12 to 15 minutes. Continue adding stock as the vegetables cook, so that there is always about 1/2 inch of stock covering the bottom of the casserole. Check the vegetables frequently, as some will be done before others; as soon as a vegetable offers no resistance to the tip of a small sharp knife, remove with a slotted spoon and place in the marinade. When all the vegetables are cooked, let cool, then cover with plastic wrap and refrigerate for 6 hours. Transfer the braising juices to a bowl, cover, and refrigerate.",
        "With a sharp knife, carefully make a small slit in the flat side of each chestnut. Put the chestnuts into a small saucepan with just enough water to cover and bring to the boil. Cook for 3 minutes, then remove from the heat and set aside to cool slightly. Drain, reserving the cooking liquid, peel, and set aside. Strain the cooking liquid and set aside.",
        "Bring a medium pot of water to the boil. Plunge in the green cabbage leaves and blanche for 1 minute, then remove with a slotted spoon and transfer to a bowl of ice-cold water to stop the cooking. Set-aside.",
        "In a medium saucepan, combine the chestnuts with 1 cup chicken stock, the chicken jus, fennel, and the reserved chopped fennel. Heat to boiling over medium heat, then reduce the heat to medium low, cover, and cook, stirring frequently, until the chestnuts are tender, browned, and glazed with sauce, 10 to 15 minutes.",
        "Melt 2 tablespoons of the butter in a medium skillet over medium-high heat. Add half of the grapes and cook, stirring frequently, until they have a caramelized appearance – they should be shiny all over and golden brown over at least half of their surface. Remove to a plate and repeat with another 2 tablespoons butter and the remaining grapes. Set aside.",
        "Drain the vegetables and set aside. In a large heavy-bottomed saucepan set over a medium heat, heat the remaining 2 tablespoons of butter and the remaining 3 tablespoons olive oil. When the butter has melted, add the marinated vegetables, stir to coat with the butter and oil, and cook, stirring frequently, for 2 minutes. Lay the cabbage leaves on top of the vegetables. Cook for 5 minutes, shaking the pan frequently to prevent sticking. Add the grapes and cook for 4 minutes longer, shaking the pan frequently.",
        "Add the reserved chestnut cooking liquid and braising juices to the saucepan and cook until the vegetables caramelize lightly, taking on a nice golden color, about 3 minutes longer. Season to taste.",
        "Arrange the apple and girolle slices, overlapping them, on the bottom of four soup plates. Drizzle 1 teaspoon of extra-virgin olive oil over each serving, then sprinkle on a few drops of lemon juice and a pinch of salt. Divide the vegetable mixture among the plates (the heat from the cooked vegetables will slightly cook the mushrooms and apple), then scatter on the grapes. Serve immediately."
    ],
    "ingredients": [
        "1/4 cup sour cherry nectar",
        "1/4 sour cherry vinegar",
        "5 strips lime zest, sliced with a vegetable peeler",
        "juice 1 lime",
        "1 1/2 cups chicken stock",
        "10 juniper berries",
        "30 black peppercorns",
        "30 coriander seeds",
        "7 tablespoons olive oil",
        "4 small white turnips, green tops trimmed to 1 inch, outer 2 layers peeled off, and halved",
        "2 small purple artichokes, trimmed and halved",
        "4 medium carrots, peeled and cut on the diagonal into 3 inch pieces",
        "4 small porcini mushrooms, trimmed and wiped clean",
        "4 medium fennel bulbs, trimmed, outer layer peeled off, cored and quartered lengthwise; one quarter coarsely chopped and reserved",
        "4 spring onions (white part only), outer layer peeled off",
        "About 4 cups chicken stock",
        "8 chestnuts",
        "4 crisp Savoy cabbage leaves, ribs discarded, sliced into triangles",
        "1 tablespoon chicken jus or rich chicken or veal pan dripping",
        "1 dried fennel branch or 1/4 teaspoon fennel seed",
        "6 tablespoons unsalted butter",
        "3/4 pound seedless green grapes",
        "Fine sea salt and freshly ground black pepper",
        "1 medium Granny Smith apple, peeled quartered, cored, and sliced paper-thin",
        "1/4 pound girolle mushrooms, trimmed an cleaned, very thinly sliced",
        "4 teaspoons rich, fruity extra-virgin olive oil",
        "Juice of 1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Mushroom",
        "Braise",
        "Marinate",
        "Sauté",
        "Apple",
        "Cherry",
        "Fennel",
        "Fall",
        "Healthy",
        "Chestnut",
        "Grape"
    ],
    "title": "Fall Fruits and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/fall-fruits-and-vegetables-105877"
}
