{
    "directions": [
        "Preheat oven to 375 degrees F. Line two cookie sheets with Reynolds(R) Parchment Paper.",
        "Combine flour, baking powder, pumpkin pie spice, baking soda, and salt in a medium bowl. In a large bowl, beat butter and sugar with an electric mixer on medium to high speed for 30 seconds. Beat in egg and pumpkin until combined. Beat in as much of the flour mixture as you can with the mixer. Using a wooden spoon, stir in any remaining flour.",
        "Drop dough by rounded teaspoons 2 inches apart on prepared cookie sheets.",
        "Bake 12-15 minutes or until bottoms are light brown. Transfer the cookies on the parchment paper to a wire rack; cool completely.",
        "Spread the bottoms of half of the cookies with the Marshmallow-Spice Filling, using about 1 tablespoon filling on each. Top each with one of the remaining cookies, bottom side down, to make sandwich cookies.",
        "Spice Filling: Beat 6 ounces softened cream cheese and 1/3 cup softened butter in a large mixing bowl until smooth. Add one-half of a 7-ounce jar marshmallow cream, 1 teaspoon vanilla, and 1 teaspoon pumpkin pie spice. Beat until well combined. Gradually add 1 3/4 cups powdered sugar, beating until smooth."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons pumpkin pie spice",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup butter, softened",
        "1 cup granulated sugar",
        "1 egg",
        "1 cup canned pumpkin",
        "Spice Filling:",
        "6 ounces softened cream cheese",
        "1/3 cup softened butter",
        "1/2 (7 ounce) jar marshmallow creme",
        "1 teaspoon vanilla",
        "1 teaspoon pumpkin pie spice",
        "1 3/4 cups powdered sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fall Pumpkin Sandwich Cookies",
    "url": "http://allrecipes.com/recipe/238410/fall-pumpkin-sandwich-cookies/"
}
