{
    "directions": [
        "Toss together the onion powder, parsley, 1 tablespoon garlic powder, seasoned salt, 1 1/2 tablespoons black pepper, marjoram, cinnamon, and nutmeg in a large, resealable plastic bag. Add the cubed pork, toss until well coated, then seal, and refrigerate overnight.",
        "Preheat oven to 250 degrees F (120 degrees C). Line a 9x9 inch baking dish with half of the spinach leaves.",
        "Pack the marinated pork into the baking dish, and cover with the remaining spinach leaves. Cover the pan with aluminum foil, and bake in the preheated oven for 3 hours, or until the pork is tender.",
        "Heat the olive oil in a large pot over medium heat. Whisk in the flour, and cook for 15 minutes, stirring frequently until the flour has toasted. Scrape into a heatproof dish, and set aside. Melt the butter in the pot, and stir in the onions and celery. Cook and stir until the onion has softened and turned translucent, about 10 minutes. Add the mushrooms, and cook until tender; stir the flour mixture back into the pot to coat the vegetables.",
        "Pour in the beef broth, stewed tomatoes, cooked pork and spinach, bay leaves, red pepper flakes, and 1 teaspoon garlic powder. Simmer 1 1/2 hours.",
        "Stir in the butter beans, yellow squash, and zucchini. Simmer 30 minutes until the vegetables are tender. Season to taste with salt and pepper before serving."
    ],
    "ingredients": [
        "2 tablespoons onion powder",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon garlic powder",
        "1 1/2 tablespoons seasoned salt",
        "1 1/2 tablespoons ground black pepper",
        "1 teaspoon dried marjoram",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "3 pounds boneless pork shoulder, cubed",
        "1 bunch spinach leaves, washed",
        "1/4 cup olive oil",
        "2 tablespoons all-purpose flour",
        "1/4 cup butter",
        "1 onion, thinly sliced",
        "2 stalks chopped celery",
        "1 pound fresh mushrooms, sliced",
        "1 1/2 cups beef broth",
        "2 (28 ounce) cans stewed tomatoes",
        "2 bay leaves",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon garlic powder",
        "2 (15 ounce) cans butter beans, rinsed and drained",
        "1 yellow squash, sliced",
        "1 zucchini, sliced",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fall-Apart Pork Stew",
    "url": "http://allrecipes.com/recipe/162882/fall-apart-pork-stew/"
}
