{
    "directions": [
        "1. Heat the oil and butter in a pot over low heat. Add the onion; cook, stirring, for 10 minutes. Add the garlic; cook 2 minutes more. Sprinkle with the flour and tarragon; cook, stirring constantly, for 1 to 2 minutes more.",
        "2. Add the carrots, potatoes, apple, and broth; bring to a boil. Reduce heat to a gentle simmer and cook, partially covered, until the vegetables are tender, about 20 minutes. Add the peas, dill, tomato, and chicken; season to taste with salt and pepper, then cook 5 minutes more.",
        "3. Preheat the oven to 350°F. Spoon the mixture into a 2-quart round ovenproof casserole. On a lightly floured surface, roll puff pastry out to form a circle 2 inches larger than the casserole. Brush some egg wash around the inside and outside rim of the casserole. Lay the pastry over the top, trim the overhang to 1 inch, and crimp the edges around the rim to seal. Cut several slits in the pastry to release the steam, then brush with remaining egg wash. Bake until crust is golden, 40 to 45 minutes."
    ],
    "ingredients": [
        "1 tablespoon each olive oil and butter",
        "1 large onion, chopped",
        "2 teaspoons finely minced garlic",
        "2 tablespoons all-purpose flour",
        "2 teaspoons dried tarragon",
        "3 carrots, halved and cut into 1-inch pieces (1 1/2 cups)",
        "1 cup peeled and diced (1/2-inch) russet potatoes",
        "1 Granny Smith apple, cored and cut into 1/2-inch pieces",
        "2 1/2 cups chicken broth",
        "1/2 cup fresh or frozen peas",
        "1/4 cup chopped fresh dill",
        "1 medium-sized ripe tomato, seeded and cut into 1/2-inch dice",
        "2 1/2 cups diced cooked chicken",
        "Salt and pepper, to taste",
        "1 sheet prepared puff pastry (1/2 pound), thawed if frozen",
        "1 egg mixed with 1 tablespoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Potato",
        "Bake",
        "Apple",
        "Pea",
        "Carrot",
        "Winter",
        "Dill",
        "Phyllo/Puff Pastry Dough",
        "Parade"
    ],
    "title": "Family-Size Chicken Pot Pie",
    "url": "http://www.epicurious.com/recipes/food/views/family-size-chicken-pot-pie-105863"
}
