{
    "directions": [
        "Mix 2 tablespoons garlic, 2 tablespoons rosemary, 1 tablespoon thyme and lemon peel in bowl. Rub over veal. Sprinkle with salt and pepper. Cover; chill overnight.",
        "Preheat oven to 350°F. Heat oil in heavy 8 1/2- to 10-quart pot over medium-high heat. Add veal; brown on all sides, about 8 minutes. Using tongs, transfer veal to roasting pan. Add ribs and ham hocks to pot; brown on all sides, about 8 minutes. Using tongs, transfer to same pan. Add sausage to pot; sauté until brown, about 3 minutes. Using slotted spoon, transfer to same pan. Add onions and 1 tablespoon garlic to pot. Sauté over low heat 5 minutes. Add carrots, broth, wine, bay leaves, caraway, 1 tablespoon rosemary and 1 tablespoon thyme. Bring to boil. Return meats to pot. Cover; bake until veal is tender, about 2 hours.",
        "Using slotted spoon, transfer meats and vegetables to large platter. Cut off string from veal. Slice veal; place on platter. Tent with foil. Boil juices in pot until slightly thickened, about 15 minutes. Spoon some juices over meat and vegetables. Serve, passing remaining juices separately."
    ],
    "ingredients": [
        "3 tablespoons minced garlic",
        "3 tablespoons chopped fresh rosemary",
        "2 tablespoons chopped fresh thyme",
        "2 teaspoons grated lemon peel",
        "1 3-pound boneless veal shoulder roast, rolled, tied",
        "2 tablespoons olive oil",
        "2 pounds double-thick beef short ribs",
        "1 pound ham hocks",
        "1 pound fully cooked smoked sausage (such as kielbasa), cut diagonally",
        "2 onions, halved, thinly sliced",
        "4 carrots, peeled, cut into 2-inch-long pieces",
        "6 cups canned low-salt chicken broth",
        "2 cups dry white wine",
        "3 bay leaves",
        "1 teaspoon caraway seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Pork",
        "Braise",
        "Low Carb",
        "Beef Rib",
        "Veal",
        "Sausage",
        "White Wine",
        "Winter"
    ],
    "title": "Family-Style Veal Roast",
    "url": "http://www.epicurious.com/recipes/food/views/family-style-veal-roast-3182"
}
