{
    "directions": [
        "Active time: 45 min. Start to finish: 10 hr. Make crumb crust as directed in separate recipe. Preheat oven to 550°F.",
        "Purée farmer cheese (or cottage cheese) with sugar in a food processor until completely smooth. Then beat together cheese, sugar, flour, and zests with an electric mixer until smooth. Add eggs and yolks, 1 at a time, then vanilla, beating on low speed until each ingredient is incorporated and scraping down bowl between additions.",
        "Put springform pan with crust in a shallow baking pan. Pour filling into crust (springform pan will be completely full) and bake in baking pan (to catch drips) in middle of oven 12 minutes, or until puffed. Reduce temperature to 200°F and continue baking until cake is mostly firm (center will still be slightly wobbly when pan is gently shaken), about 1 hour more.",
        "Run a knife around top edge of cake to loosen and cool completely in springform pan on a rack. Chill cake, loosely covered, at least 6 hours. Remove side of pan and transfer cake to a plate. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 crumb-crust recipe , made with finely ground graham crackers",
        "5 (8-ounce) packages farmer cheese (or cottage cheese), softened",
        "3 3/4 tablespoons all-purpose flour",
        "Finely grated zest of 1 orange",
        "Finely grated zest of 1 lemon",
        "5 large eggs",
        "2 large egg yolks",
        "1/2 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Egg",
        "Dessert",
        "Bake",
        "Shavuot",
        "Cottage Cheese",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Farmer Cheese Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/farmer-cheese-cheesecake-102590"
}
