{
    "directions": [
        "Line baking sheet with waxed paper or parchment paper. Mix first 6 ingredients in shallow bowl. Dip cut sides of goat cheese rounds into spice mixture to coat. Place on prepared baking sheet. Chill until ready to serve. DO AHEAD Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.",
        "Whisk first 4 ingredients in small bowl. Gradually whisk in olive oil. Season with coarse salt and pepper. DO AHEAD Can be made 1 day ahead. Cover and refrigerate. Rewhisk before using.",
        "Steam potatoes until just tender, about 10 minutes. Transfer to plate; cool. Steam green beans until crisp-tender, about 5 minutes. Rinse under cold water; drain. Pat dry with paper towels. DO AHEAD Potatoes and green beans can be made 6 hours ahead. Wrap separately in paper towels. Place in resealable plastic bag; chill.",
        "Combine greens and basil in large bowl. Add enough vinaigrette to coat lightly; toss. Arrange on large platter. Add potatoes and green beans to same large bowl; add remaining dressing and toss. Arrange potatoes and beans atop greens. Scatter tomatoes and olives over. Surround with goat cheese rounds."
    ],
    "ingredients": [
        "2 tablespoons sesame seeds",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons paprika",
        "1 teaspoon finely chopped fresh thyme",
        "1/4 teaspoon coarse kosher salt",
        "1/8 teaspoon ground black pepper",
        "16 (1/3-inch-thick) rounds chilled soft fresh goat cheese (from one 11-ounce log)",
        "2 tablespoons red wine vinegar",
        "1 shallot, minced",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon Dijon mustard",
        "5 tablespoons extra-virgin olive oil",
        "Coarse kosher salt",
        "1 pound baby new potatoes (such as Dutch yellow baby potatoes), halved",
        "1 pound green beans (or mix of green and yellow), trimmed",
        "8 cups (loosely packed) mixed salad greens",
        "1/3 cup (packed) small fresh basil leaves",
        "12 ounces assorted small tomatoes (such as cherry, grape, and teardrop; preferably mix of red and yellow)",
        "1/2 cup black olives (such as Niçoise)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Leafy Green",
        "Olive",
        "Potato",
        "Tomato",
        "Vegetable",
        "Goat Cheese",
        "Summer"
    ],
    "title": "Farmers' Market Salad with Spiced Goat Cheese Rounds",
    "url": "http://www.epicurious.com/recipes/food/views/farmers-market-salad-with-spiced-goat-cheese-rounds-239065"
}
