{
    "directions": [
        "For the soup: Place the chicken pieces and the backbones in a large pot and cover with 16 cups water. Bring to a boil, then reduce the heat to a low simmer and poach the chicken until cooked through, 25 to 30 minutes.",
        "Use tongs to remove the chicken pieces and set aside to cool; discard the backbones. Once the chicken cools enough to handle, pull the meat from the bones, shred and roughly chop; set aside. Strain the chicken broth and keep warm.",
        "In a medium pot, melt the butter over medium heat, and stir in the carrots, garlic, celery, leeks, onions and poultry seasoning. Cook the vegetables until they begin to soften, 8 to 10 minutes, then stir in the flour.",
        "Add the reserved chicken broth, bring to a boil, then reduce to a simmer and cook until the soup thickens slightly and vegetables soften, about 25 minutes. Stir in the shredded chicken and bring the soup back to a low simmer.",
        "For the dumplings: In a medium bowl, add the flour. Use two butter knives to cut in the milk, butter, baking powder, salt and eggs. Add additional milk, 1 tablespoon at a time, if necessary. The dough should be moist but not too wet.",
        "Pull the dough into 1/4-cup pieces and place directly in the simmering soup; cover and cook for 10 to 12 minutes. Sprinkle with the chopped parsley and serve."
    ],
    "ingredients": [
        "Two 3-pound chickens, each cut into 6 pieces and backbones reserved",
        "1/2 cup (1 stick) unsalted butter",
        "6 medium carrots, chopped into 1-inch pieces",
        "6 cloves garlic, thinly sliced",
        "4 stalks celery, chopped into 1-inch pieces",
        "2 large leeks, white part only, chopped into 1/2-inch pieces and soaked in cold water to remove grit",
        "2 medium yellow onions, chopped into 1/2-inch pieces",
        "1 tablespoon poultry seasoning",
        "1/2 cup all-purpose flour",
        "2 1/2 cups flour",
        "3/4 cup milk, plus more if needed",
        "2 tablespoons butter",
        "1 tablespoon baking powder",
        "2 teaspoons salt",
        "2 large eggs",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken and Dumpling",
        "Soup",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Farm-Style Chicken and Drop Dumplings",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/farm-style-chicken-and-drop-dumplings"
}
