{
    "directions": [
        "Preheat the oven to 400°F. Set the cored tomatoes on a rimmed baking sheet. Drizzle with 2 tablespoons of the olive oil and roast them until they look wrinkly, about 30 minutes; set aside. While the tomatoes cool, heat the remaining 2 tablespoons olive oil in a small sauté pan. Add the shallots and 2 cloves chopped garlic and sauté over medium-low heat until they turn golden brown and caramelized, 15 to 20 minutes; set aside.",
        "When the tomatoes are cool enough to handle, peel off the skins, which should slip off easily. Put the peeled tomatoes in the jar of a blender along with the sautéed shallots and garlic, crushed tomatoes (with juice), 1 tablespoon salt, and sugar. Process until the soup is smooth. Stir in the cream and vodka, if desired. Refrigerate in a covered bowl for at least 6 hours, or preferably overnight.",
        "Toast the pine nuts, stirring occasionally, in a skillet set on medium heat until they turn golden brown, about 4 minutes. Combine the arugula, pine nuts, 2 cloves garlic, 1/2 teaspoon salt, and lemon juice in the jar of a blender or the work bowl of a food processor fitted with the metal blade, then slowly add in the olive oil through the feed tube and process. Transfer the pesto to a bowl and stir in the Parmesan.",
        "Ladle the chilled soup into individual serving bowls, and swirl 1 tablespoon of pesto into each.",
        "The soup can be made up to 4 days in advance and refrigerated. Ditto for the pesto. Both should be well covered. Arugula pesto does not brown when exposed to oxygen as does its more common cousin, basil pesto.",
        "The more traditional-minded may prefer a basil pesto. Also, you can eliminate the cream and top the soup with a dollop of crème fraîche or Greek-style yogurt and a drizzle of pesto."
    ],
    "ingredients": [
        "10 medium or 4 very large ripe tomatoes (about 4 pounds), cored",
        "1/4 cup olive oil",
        "2 shallots, coarsely chopped",
        "2 cloves garlic, chopped",
        "1 (28-ounce) can fire-roasted crushed tomatoes",
        "1 tablespoon kosher salt",
        "1/8 teaspoon sugar",
        "1/4 to 1/2 cup heavy whipping cream",
        "1/4 cup good-quality vodka (optional)",
        "1/2 cup pine nuts",
        "5 ounces baby arugula",
        "2 cloves garlic, coarsely chopped",
        "1/2 teaspoon kosher salt",
        "1 tablespoon freshly squeezed lemon juice (about 1/2 medium lemon)",
        "3/4 cup extra-virgin olive oil",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Tomato",
        "Lunch",
        "Parmesan",
        "Pine Nut",
        "Arugula",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Farmstand Tomato Soup with Arugula Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/farmstand-tomato-soup-with-arugula-pesto-358151"
}
