{
    "directions": [
        "Bring a 6- to 8-quart pot of well-salted water to a boil.",
        "Meanwhile, mince and mash garlic to a paste with 1/2 teaspoon salt, then stir together with vinegar, oil, and 1 teaspoon salt in a large bowl. Add tomatoes and stir gently, then set aside.",
        "Cook corn in boiling water until tender, 4-6 minutes, then remove with tongs and cool.",
        "While corn cools, peel lengthwise ribbons from 1 side of a zucchini with vegetable peeler into another bowl, stopping when you get to seedy core. Turn zucchini a quarter-turn, then peel more ribbons, stopping at core. Repeat on remaining 2 sides of zucchini (you will end up with rectangular-shaped cores). Reserve cores for another use (such as soup).",
        "Cut corn from cobs; add corn to tomatoes.",
        "Cook pasta according to package directions until al dente. Just before pasta is done, stir in zucchini ribbons and snap peas and cook 15 seconds. Drain pasta and vegetables together in a large colander and add to tomato mixture with onion (if using), then toss gently.",
        "Add herbs and toss gently again."
    ],
    "ingredients": [
        "3 garlic cloves, minced",
        "3 tablespoons Sherry vinegar or white wine vinegar",
        "1/3 cup extra-virgin olive oil, plus more for drizzling",
        "1 1/2 pounds multicolored cherry tomatoes, halved (quartered if large)",
        "3 ears corn, shucked",
        "1 1/2 pounds medium zucchini",
        "8 to 9 ounces dried egg pappardelle or dried egg fettuccine",
        "1/4 pound sugar snap peas, strings discarded and peas halved diagonally",
        "1/2 cup thinly sliced red onion (optional)",
        "1 cup small basil leaves, torn if large",
        "1/2 cup mint leaves",
        "1/3 cup snipped chives",
        "Special equipment: A good vegetable peeler, preferably V- or U-shaped",
        "Shavings of Parmesan made with vegetable peeler"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Corn",
        "Zucchini",
        "Summer",
        "Healthy",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Farmers' Market Pappardelle",
    "url": "http://www.epicurious.com/recipes/food/views/farmers-market-pappardelle-51174410"
}
