{
    "directions": [
        "Place porcini mushrooms in a bowl and cover with warm water; soak until mushrooms are reconstituted, 20 to 30 minutes. Drain and chop mushrooms.",
        "Heat olive oil in a pot over medium-high heat. Saute brown mushrooms with a pinch of salt in hot oil until slightly golden and moisture cooks off, 5 to 10 minutes. Add chopped porcini mushrooms, reduce heat to medium, and cook and stir until hot, 2 to 4 minutes.",
        "Stir onion into mushrooms; cook and stir until translucent and golden, 5 to 7 minutes. Add garlic; cook and stir until fragrant, about 1 minute.",
        "Pour farro into mushroom mixture; stir until farro is coated in olive oil. Increase heat to high and add 1 cup chicken broth with a pinch of salt to mushroom mixture; bring to a boil. Reduce heat to medium-low, cover the pot with a lid, and simmer, stirring once, until liquid is absorbed, about 10 minutes.",
        "Increase heat to high and stir remaining chicken broth into farro mixture; bring to a boil, reduce heat to medium-low, cover the pot with a lid, and simmer, stirring occasionally, until farro is starting to get tender, about 15 minutes. Remove the lid from the pot and continue simmering uncovered until farro reaches desired tenderness, about 15 minutes more.",
        "Reduce heat to low; stir creme fraiche and parsley into farro mixture. Season with salt and black pepper. Stir Parmigiano-Reggiano cheese into farro and ladle into bowls."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/2332452.jpg",
    "ingredients": [
        "1/2 ounce dried porcini mushrooms",
        "2 tablespoons olive oil",
        "10 brown mushroom caps, diced",
        "salt to taste",
        "1/2 onion, diced small",
        "2 cloves garlic, minced",
        "1 cup pearled farro, rinsed, or more to taste",
        "3 cups chicken stock, divided",
        "2 tablespoons creme fraiche",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "freshly ground black pepper to taste",
        "2 tablespoons freshly grated Parmigiano-Reggiano cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Farro with Wild Mushrooms",
    "url": "http://allrecipes.com/recipe/241554/farro-with-wild-mushrooms/"
}