{
    "directions": [
        "Set the farro in a large bowl or spouted glass measuring cup and add ample cold water to cover. Set aside while you cook the beans.",
        "Heat 1 tablespoon of the oil in a large, heavy pot over medium­high heat. Stir in the onion, carrot, and celery. Cook until the onion softens, about 3 minutes. Add the garlic and continue to cook until the onion is lightly browned, a few minutes more.",
        "Drain the cannellini beans and add them to the pot. Add 8 cups of water. Bring the liquid to a boil, then cover the pot and simmer until the beans are almost tender, 40 to 60 minutes (depending on age and storage conditions).",
        "Drain the farro. Add the farro, tomatoes, and salt. Return to a boil, then cover and simmer for 10 minutes.",
        "Meanwhile, prepare the kale: Discard a few inches of the tough root ends. Thinly slice the stems and coarsely chop the leaves. Rinse well by dunking it in a large bowl or sink full of water. Drain well.",
        "When the farro has simmered for 10 minutes, stir in the kale gradually, adding more as each batch wilts. Cover and continue cooking until the beans, farro, and kale are tender, usually 10 to 20 minutes more. Add the remaining tablespoon of oil, the basil, cheese, and salt and pepper to taste.",
        "Soak the farro for 10 to 15 minutes. Instead of dried cannellini beans, substitute 1 can (16 or 19 ounces) chickpeas, drained and rinsed. Add them when you add the drained farro."
    ],
    "ingredients": [
        "1 cup farro, picked over and rinsed",
        "2 tablespoons olive oil",
        "1 large onion, diced",
        "1 medium carrot, diced",
        "2 stalks celery, diced",
        "3 cloves garlic, minced",
        "1 cup dried cannellini beans, soaked overnight in ample water to cover",
        "1 can (15 ounces) diced tomatoes, with liquid",
        "1 teaspoon salt, plus more to taste",
        "1 bunch kale (about 14 ounces)",
        "1/2 cup chopped fresh basil or parsley",
        "1/4 cup Parmesan cheese",
        "Freshly ground pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Kale",
        "Legume",
        "Fall",
        "Winter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Farro Soup with Kale and Cannellini",
    "url": "http://www.epicurious.com/recipes/food/views/farro-soup-with-kale-and-cannellini-51195210"
}
