{
    "directions": [
        "Put the farro in a saucepan, add the broth and 1 tsp. of the salt, and bring to a boil over high heat. Reduce the heat to medium-low and simmer, uncovered, until the farro is tender and all of the liquid is absorbed, about 30 minutes. Transfer to a large bowl and let cool to room temperature.",
        "Meanwhile, preheat an oven to 400°F.",
        "On a rimmed baking sheet, toss the squash cubes with 2 Tbs. of the olive oil, 1 tsp. of the salt and the 1/4 tsp. pepper. Spread the cubes in an even layer on the baking sheet and roast until tender but still slightly firm to the bite, about 12 minutes. Let cool to room temperature.",
        "In a small bowl, whisk together the lemon juice, honey, parsley, the remaining 1/4 tsp. salt and several grindings of pepper. Add the remaining 6 Tbs. olive oil in a thin stream, whisking constantly until the dressing is well blended. Taste and adjust the seasonings with salt and pepper. Add the dressing, squash, turkey, cranberries and green onions to the cooled farro and toss well. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Salad of the Day",
        ", by Georgeanne Brennan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "1 1/3 cups (about 8 oz.) farro",
        "4 cups chicken broth",
        "2 1/4 tsp. salt, plus more, to taste",
        "1 butternut squash, about 3 lb., halved, seeded, peeled and cut into 1/2-inch cubes",
        "8 Tbs. extra-virgin olive oil",
        "1/4 tsp. freshly ground pepper, plus more, to taste",
        "1/4 cup fresh lemon juice",
        "1 tsp. honey",
        "1 Tbs. minced fresh flat-leaf parsley",
        "6 oz. boneless smoked turkey or chicken, cut into 1/2-inch cubes",
        "2/3 cup sweetened dried cranberries",
        "3 green onions, including tender green portions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Farro Salad with Turkey and Roasted Squash",
    "url": "http://www.williams-sonoma.com/recipe/farro-salad-with-turkey-and-roasted-squash.html"
}
