{
    "directions": [
        "Preheat oven to 350°. Toast hazelnuts on a baking sheet, stirring occasionally, until golden brown, 8–10 minutes. Let cool; set a small handful aside. Blend broth and remaining nuts in a blender until very smooth, about 5 minutes. Transfer hazelnut stock to a small bowl and stir in vinegar; season with salt and pepper.",
        "Heat oil in a large skillet over mediumhigh. Add mushrooms, season with salt and pepper, and cook, tossing occasionally, until golden brown, 8–10 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Add wine. Bring to a vigorous simmer and cook until wine is slightly reduced, about 2 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Add pasta, 1 cup pasta cooking liquid, and 1/2 cup hazelnut stock to mushrooms and cook, tossing often and adding more cooking liquid to help finish cooking pasta and more hazelnut stock to help thicken sauce, until pasta is al dente and sauce is thickened and coats pasta, about 5 minutes. Taste and season with salt and pepper.",
        "Just before serving, finely grate reserved hazelnuts over pasta and top with lemon zest."
    ],
    "ingredients": [
        "1/2 cup blanched hazelnuts",
        "3/4 cup low-sodium chicken broth",
        "1 teaspoon Sherry vinegar or red wine vinegar",
        "Kosher salt, freshly ground pepper",
        "1/4 cup olive oil",
        "1 pound maitake mushrooms, torn into bite-size pieces",
        "2 garlic cloves, finely chopped",
        "1/2 cup dry white wine",
        "12 ounces farro spaghetti",
        "1 teaspoon finely grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Pasta",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Farro Spaghetti with Mushrooms and Hazelnuts",
    "url": "http://www.epicurious.com/recipes/food/views/farro-spaghetti-with-mushrooms-and-hazelnuts-51263920"
}
