{
    "directions": [
        "Cook farro in boiling salted water until tender, about 20 minutes. Drain, let cool, and set aside. DO AHEAD: Farro can be made 2 days ahead. Cover and chill.",
        "Heat 2 tablespoons oil in a large heavy skillet over medium-high heat until it shimmers (the oil needs to be very hot to crisp the mushrooms). Working in batches, add a single layer of mushrooms to skillet. Cook, turning once, until crisp and cooked through, 4-5 minutes. Transfer to a plate; season with salt and pepper.",
        "Bring broth to a simmer in a medium saucepan over medium heat. Add farro and cook, stirring often, until heated through. Season farro with salt and pepper. Add butter and stir vigorously to combine and create a creamy texture. Add mushrooms, parsley, chives, and thyme; stir just to evenly incorporate. Serve immediately."
    ],
    "ingredients": [
        "2 cups semi-pearled farro",
        "Kosher salt",
        "2 tablespoons (or more) olive oil",
        "4 cups (about 8 ounces) assorted fresh mushrooms (such as chanterelle, porcini, lobster, maitake, and crimini), cut into 1\" pieces",
        "Freshly ground black pepper",
        "1 cup low-sodium chicken broth",
        "1/4 cup (1/2 stick) unsalted butter, cut into 1/2\" cubes",
        "2 tablespoons chopped flat-leaf parsley",
        "2 tablespoons chopped fresh chives",
        "2 tablespoons chopped fresh thyme",
        "Ingredient info: Semi-pearled farro is available at Italian markets and natural foods and specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Sauté",
        "Thanksgiving",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Healthy",
        "Low Cholesterol",
        "Boil",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Farro with Wild Mushrooms and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/farro-with-wild-mushrooms-and-herbs-51118030"
}
