{
    "directions": [
        "Whisk garlic, lemon juice, paprika, curry powder, and turmeric in a medium bowl; add chicken and toss to coat. Cover and chill at least 6 hours.",
        "DO AHEAD: Chicken can be marinated 1 day ahead. Keep chilled.",
        "Bring raisins, vinegar, and 2 tablespoons water to a boil in a small saucepan, reduce heat, and simmer, stirring occasionally, until liquid evaporates, 8-10 minutes.",
        "DO AHEAD: Raisins can be prepared 3 days ahead. Let cool, then cover and chill.",
        "Heat oil in a large skillet over medium heat. Add bell peppers and onion; season with salt. Cook, stirring often, until softened, 8-10 minutes. Reduce heat to low and cook, stirring occasionally, until vegetables are caramelized, 45-60 minutes.",
        "Add garlic and tomato paste to skillet and continue to cook, stirring occasionally, until tomato paste begins to darken, 10-15 minutes longer. Mix in vinegar and paprika; season with salt and pepper.",
        "DO AHEAD: Soffritto can be made 3 days ahead. Let cool, then cover and chill.",
        "Remove chicken from marinade; season with salt and pepper. Heat 2 tablespoons oil in a heavy 5-6-quart pot with a lid over medium-high heat. Cook chicken, skin side down, until skin is brown and crisp, 10-12 minutes; transfer to a plate. (You can remove bones at this point, if desired.)",
        "Reduce heat to medium. Add chorizo to pot and cook, stirring often, until crisp, about 2 minutes; transfer to a small bowl.",
        "Add soffritto to pot and cook, stirring constantly, until sizzling, about 1 minute. Add broth, scraping up any browned bits; season with salt (salting liquid adequately here is important for flavorful rice). Add rice, sausage, chorizo, and raisins. Stir and bring to a boil. Reduce heat, arrange chicken on top, cover pot, and simmer gently, until rice is tender, 20-25 minutes. Uncover; increase heat to medium-high. Drizzle remaining 2 tablespoons oil around edges of pot and cook, undisturbed, until underside of rice is crunchy, about 5 minutes longer.",
        "While rice is cooking, mix garlic, fermented beans, if using, cilantro stems, and chiles in a small bowl. Peel prawns, leaving heads and tails on. Devein, stuff cut side with garlic mixture, and set aside.",
        "Combine clams and wine in a large skillet, cover, and cook over high heat, stirring often, until clams open (discard any that do not open), about 5 minutes. Using a slotted spoon, transfer clams to a large bowl.",
        "Reduce heat to medium-low. Lightly season prawns with salt and cook in same skillet until opaque in the centers, about 2 minutes per side. Transfer prawns to bowl with clams; pour pan juices into a small bowl.",
        "DO AHEAD: Prawns can be stuffed 1 hour ahead. Cover and chill.",
        "Mix gochugaru, cayenne, and salt in a small bowl. Dip cut sides of lemon wedges into seasoning mix.",
        "Top rice with prawns and clams and drizzle with reserved pan juices. Top with lemon wedges, eggs, olives, pickled chiles and peppers, and scallions."
    ],
    "ingredients": [
        "2 garlic cloves, finely chopped",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon smoked paprika",
        "2 teaspoons curry powder",
        "2 teaspoons ground turmeric",
        "6 skin-on, bone-in chicken thighs (about 3 pounds)",
        "1/2 cup golden raisins",
        "2 tablespoons Sherry vinegar or red wine vinegar",
        "2 tablespoons olive oil",
        "2 red bell peppers, thinly sliced",
        "1 large onion, thinly sliced",
        "Kosher salt",
        "4 garlic cloves, finely chopped",
        "1 tablespoon tomato paste",
        "1 teaspoon (or more) Sherry vinegar or red wine vinegar",
        "1/2 teaspoon smoked paprika",
        "Freshly ground black pepper",
        "Kosher salt, freshly ground pepper",
        "4 tablespoons olive oil, divided",
        "2 ounces cured Spanish chorizo, thinly sliced",
        "3 1/2 cups low-sodium chicken broth",
        "2 cups jasmine rice, rinsed",
        "4 ounces Chinese sausage or andouille sausage, thinly sliced",
        "2 garlic cloves, finely chopped",
        "1 tablespoon fermented black beans (optional)",
        "1 tablespoon finely chopped fresh cilantro stems",
        "1 tablespoon finely chopped pickled chiles (such as serrano or jalapeño)",
        "6 large head-on prawns",
        "1 pound Manila clams, scrubbed",
        "1/2 cup dry white wine",
        "Kosher salt",
        "2 tablespoons gochugaru (coarse Korean red pepper powder)",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon kosher salt",
        "2 lemons, quartered, seeds removed",
        "Halved hard-boiled eggs, oil-cured black olives, green Spanish olives, pickled chiles (such as serrano or jalapeño), pickled sweet peppers (such as Peppadew or cherry), and thinly sliced scallions (for serving)",
        "Gochugaru and fermented black beans can be found at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Shellfish",
        "Marinate",
        "Sausage",
        "Clam",
        "Shrimp",
        "Advance Prep Required"
    ],
    "title": "Fat Rice",
    "url": "http://www.epicurious.com/recipes/food/views/fat-rice-51187300"
}
