{
    "directions": [
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Chop the bacon, and set aside.",
        "Bring a large pot of lightly salted water to a boil for the pasta. While water is coming to a boil, heat olive oil in a large, heavy skillet over high heat, and pan-fry the scallops until browned and opaque, about 2 minutes per side. Remove scallops to a plate.",
        "Stir the angel hair pasta into the boiling water, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink, and divide the hot pasta between 4 plates.",
        "Pour white wine and sun-dried tomatoes into the skillet, and scrape up and dissolve any browned flavor bits left in the pan. Stir in the cream, bring to a boil over medium heat, reduce heat, and simmer until thickened, about 2 minutes. Remove the pan from the heat, and add the butter and garlic. Whisk the butter into the sauce, return the scallops to the pan, and cover with sauce.",
        "Spoon scallops and sauce over the pasta, sprinkle with chopped bacon, and season to taste with salt and pepper."
    ],
    "ingredients": [
        "4 slices double smoked bacon",
        "1 1/2 tablespoons olive oil",
        "12 large scallops, patted dry",
        "1/2 cup dry white wine",
        "3 tablespoons sun-dried tomatoes packed in oil, drained and thinly sliced",
        "1/4 cup heavy cream",
        "2 tablespoons butter, at room temperature",
        "2 teaspoons minced garlic",
        "1 (8 ounce) package angel hair pasta",
        "salt and black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Father-in-Law's Scallops with Sun-Dried Tomatoes and Bacon",
    "url": "http://allrecipes.com/recipe/214763/father-in-laws-scallops-with-sun-dri/"
}
