{
    "directions": [
        "1. In a dry pan over medium heat, toast the dried chilies until they take on a dark color, pressing them down with a wooden spoon to increase contact with the pan, 3 to 4 minutes. Be careful not to inhale over the toasting chilies. Transfer them to a plate, then toast the peppercorns, swirling and shaking them until they crackle lightly and release their aromas, about 3 minutes.",
        "2. Working in batches, grind the dried chilies and black peppercorns to a fine powder in a spice grinder. Stir in the lime zest. Transfer the mixture to a bowl, mix in the salt, and set it aside.",
        "In a food processor, combine the palm sugar, fish sauce, garlic, shallots, and young ginger. Pulse to a paste, then add the coconut milk and pulse more to smooth it out. Transfer the paste to a bowl and set it aside.",
        "1. Put the brisket in a deep container and rub on the dry rub. Make sure to coat it thoroughly.",
        "2. Next rub all of the paste on every part of the seasoned brisket. Cover the container and refrigerate for at least 24 and up to 48 hours.",
        "1. Preheat a smoker to 190°F. Remember, you're using a nice local hardwood but no pine, cedar, hickory, or mesquite, which will overpower the flavors in this dish.",
        "2. Smoke the brisket for 12 to 14 hours, monitoring the temperature the whole time and doing what you can to keep it within 10 degrees of the target temp of 190°F. At 10 hours, and every hour thereafter, check the beef with a skewer. The brisket is done as soon as the skewer goes in and out easily and when you get a jiggle that's borderline erotic upon poking the brisket with a finger. Or, fine, when it's around 150°F in the lean, flat part of the brisket. This is not your Jewish grandma's brisket, so don't expect it to fall apart.",
        "3. Using some large, flat spatulas, remove the brisket from the smoker. Let the meat sit untouched for at least 20 minutes before carving and devouring in order to give the brisket some time to reabsorb its juicy juices."
    ],
    "ingredients": [
        "2 cups dried red chilies, such as cayenne",
        "2 cups black peppercorns",
        "Zest of 4 limes",
        "1 1/2 cups kosher salt",
        "2 tablespoons palm or brown sugar",
        "1/4 cup fish sauce",
        "20 garlic cloves, peeled",
        "10 small shallots, peeled",
        "2 inches young fresh ginger, peeled",
        "1/4 cup well-stirred coconut milk, preferably Aroy-D brand",
        "1 whole untrimmed brisket (about 12 pounds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Dinner",
        "Meat",
        "Brisket",
        "Family Reunion",
        "Smoker",
        "Potluck",
        "Chile Pepper",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fatty Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/fatty-brisket-395589"
}
