{
    "directions": [
        "Separate the onions into individual rings. Use only the larger rings for this recipe; reserve the smaller rings for another use. You should have 20 rings total. Lay the rings in a single layer in a large rectangular baking dish. Pour the milk over the rings and allow them to soak for about 20 minutes, turning them once so that all surfaces of the onion rings have been exposed to the milk.",
        "Preheat the oven to 425˚F. Place a wire baking rack on each of two foil-lined baking sheets, and set them aside.",
        "Put the flour in a shallow dish. Put the panko in a small dish. In a large bowl, whip the egg whites with a whisk until they are extremely foamy but not quite holding peaks.",
        "Working in batches, remove the onion rings from the milk and dredge them in the flour, shaking off any excess. Add the rings to the egg whites and toss to coat completely. Add the rings, a few pieces at a time, to the panko and coat completely.",
        "Spread the onion rings out on the wire racks. Season the rings generously with salt and pepper, and spray them lightly with cooking spray. Bake until the panko is golden brown and crispy and the onions are tender, about 20 minutes.",
        "Meanwhile, in a small bowl, whisk together the mayonnaise and the liquid smoke. Season to taste with Tabasco.",
        "Serve the onion rings with the mayonnaise for dipping."
    ],
    "ingredients": [
        "4 large Vidalia onions, cut into 1/2-inch-thick-slices",
        "2 cups skim milk",
        "2 cups whole-wheat flour",
        "2 cups whole-wheat panko breadcrumbs, such as Ian's All-Natural",
        "4 large egg whites",
        "Salt and freshly ground black pepper",
        "Nonstick cooking spray",
        "3/4 cup Rocco's Magnificent Mayonnaise or store- bought reduced- fat mayonnaise such as Hellmann's Low- Fat Mayonnaise Dressing",
        "1 tablespoon liquid smoke, such as Stubb's",
        "Tabasco sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Vegetable",
        "Appetizer",
        "Side",
        "Bake",
        "Super Bowl",
        "Graduation",
        "Backyard BBQ",
        "Tailgating",
        "Poker/Game Night",
        "Healthy",
        "Breadcrumbs",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Faux-Fried Onion Rings with Smoky Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/faux-fried-onion-rings-with-smoky-mayonnaise-363403"
}
