{
    "directions": [
        "Bring a saucepan three-fourths full of water to a boil over high heat. Add the fava beans and boil for 1 minute, then use a skimmer to transfer them to a bowl. Squeeze each bean free of its tough outer skin. Set aside 1/2 cup (3 1/2 oz./105 g) of the fava beans and transfer the remaining beans to a food processor. Add the cheese, basil and lemon zest and process until smooth. Season with salt and pepper.",
        "Preheat an oven to 200°F (95°C).",
        "In a bowl, whisk together the eggs and water until frothy. Season with salt and pepper.",
        "In a small nonstick fry pan over medium heat, warm 1/2 Tbs. of the olive oil. Pour in one-fourth of the egg mixture and cook until the eggs just begin to set, about 1 minute. Using a spatula, gently lift one side of the egg mixture while tilting the pan to allow the uncooked eggs to flow underneath. Repeat until the eggs are cooked through, about 3 minutes.",
        "Place one-fourth of the pureed fava mixture onto half of the omelette and fold over the other side. Transfer to a plate and keep warm in the oven. Repeat to cook 3 more omelettes.",
        "Place the spring greens in a bowl. Drizzle with the remaining 1 Tbs. olive oil and the lemon juice, and season with salt and pepper. Top the omelettes with the remaining fava beans and the spring greens, dividing evenly, and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Healthy Dish of the Day,",
        "by Kate McMillan (Weldon Owen, 2014)."
    ],
    "ingredients": [
        "2 lb. (1 kg) fava beans, shelled",
        "5 Tbs. (3 oz./90 g) part-skim ricotta cheese",
        "1/4 cup (3/4 oz./20 g) chopped fresh basil",
        "Grated zest and juice of 1 lemon",
        "Salt and freshly ground pepper, to taste",
        "8 eggs",
        "1 Tbs, water",
        "3 Tbs. olive oil",
        "2 cups (2 oz./60 g) spring greens, such as arugula or\n  watercress"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Fava Bean and Ricotta Omelette with Spring Greens",
    "url": "http://www.williams-sonoma.com/recipe/fava-bean-and-ricotta-omelette-with-spring-greens.html"
}
