{
    "directions": [
        "Blanch beans in a 2-quart pot of boiling water 1 minute, then drain in a sieve and immediately transfer to a bowl of ice and cold water to stop cooking. Gently peel off skins (it's not necessary to peel edamame, if using).",
        "Fill a large bowl with 4 cups cold water and squeeze juice from 2 lemon halves into bowl.",
        "Cut off stem of 1 artichoke and reserve. Cut off top inch of artichoke with a serrated knife. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until you reach pale yellow leaves with pale green tips.",
        "Cut remaining leaves flush with top of artichoke bottom using a paring knife, then quarter bottom. Cut out fuzzy choke and purple leaves with paring knife. Trim dark green fibrous parts from base and side of artichoke, then rub cut surfaces with a remaining lemon half and put artichoke bottom in bowl of acidulated water.",
        "Trim 1/4 inch from end of reserved stem to expose inner core, then trim sides of stem down to pale inner core (don't worry if remaining stem is very thin). Rub cut surfaces with lemon half and put in bowl of acidulated water. Trim remaining artichokes, including stems, in same manner.",
        "Drain artichokes and cut crosswise into 1/4-inch-thick slices, including stems. Cook guanciale and onion in oil in a 5-quart heavy pot over moderate heat, stirring occasionally, until onion is softened, about 6 minutes. Add sliced artichokes, fava beans, and remaining ingredients and simmer, covered, stirring occasionally, until vegetables are tender, about 45 minutes."
    ],
    "ingredients": [
        "2 cups shelled fresh fava beans (2 1/2 lb in pods) or shelled edamame (fresh soybeans)",
        "2 lemons, halved",
        "4 large artichokes (3/4 lb each)",
        "2 oz guanciale (smoked pork jowl)* or pancetta, cut into 1/8-inch-thick matchsticks (1/2 cup)",
        "2 cups thinly sliced onion",
        "5 tablespoons extra-virgin olive oil",
        "2 cups fresh or frozen peas (not thawed)",
        "2 teaspoons finely chopped fresh oregano",
        "2 cups water",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Pork",
        "Soy",
        "Stew",
        "Lemon",
        "Artichoke",
        "Pea",
        "Winter",
        "Gourmet"
    ],
    "title": "Fava Bean, Pea, and Artichoke Stew",
    "url": "http://www.epicurious.com/recipes/food/views/fava-bean-pea-and-artichoke-stew-107806"
}
