{
    "directions": [
        "Place potatoes into a large pot; add 1 bay leaf, salt, and pepper. Cover potatoes with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and return potatoes to pot. Mash potatoes with 8 ounces milk and 1/4 cup butter until smooth.",
        "Preheat oven to 200 degrees F (95 degrees C). Spread olive oil into the bottom of a 12-inch square baking dish.",
        "Combine remaining 20 ounces milk and 1 bay leaf in a large, deep saucepan and bring to a simmer. Cook haddock, salmon, and smoked fish, working in batches if needed, until fish flakes easily with a fork, about 5 minutes. Remove fish from milk and separate into chunks on a work surface. Arrange fish and shrimp in the bottom of the prepared baking dish, reserving milk.",
        "Pour the milk used to cook the fish into a measuring cup, adding more if needed to equal 2 1/2 cups.",
        "Heat remaining butter in the same large saucepan over low heat; slowly whisk flour into melted butter until smooth. Add the 2 1/2 cups milk, leek, parsley, scallions, and mustard; simmer until thickened, about 5 minutes. Pour milk mixture over fish and shrimp and top with the mashed potatoes, spreading evenly.",
        "Bake in the preheated oven until bubbling around the corners and lightly browned, 30 to 45 minutes."
    ],
    "ingredients": [
        "2 1/2 pounds potatoes",
        "2 bay leaves, divided",
        "salt and ground black pepper to taste",
        "28 fluid ounces milk, divided, or more if needed",
        "1/2 cup butter, divided",
        "1 tablespoon olive oil",
        "8 ounces skinless haddock",
        "8 ounces skinless salmon",
        "8 ounces skinless smoked fish",
        "1/3 cup all-purpose flour",
        "1 leek, sliced",
        "2 tablespoons chopped fresh parsley, or more to taste",
        "2 scallions, chopped",
        "1 teaspoon spicy mustard",
        "8 ounces cooked shrimp, peeled and deveined"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Favorite Fisherman's Pie",
    "url": "http://allrecipes.com/recipe/241383/favorite-fishermans-pie/"
}
