{
    "directions": [
        "Place tongue in a large pot, pour in enough water to cover. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 3 hours.",
        "Pour 1 quart water and black beans into a large saucepan. Bring to a boil over high heat, and boil for 2 minutes. Remove from heat, cover, and let stand 1 hour.",
        "When tongue is done, drain and plunge into cold water. Make a lengthwise cut in the skin, peel off, and discard. Slice the tongue into 1/4-inch slices, and stir into beans along with dried beef, chourico, and bacon. Add water if needed to cover, then bring to a boil over high heat. Reduce heat to medium-low, cover, and simmer for 1 hour.",
        "Heat the vegetable oil in a saucepan over medium heat, and stir in the garlic and onion. Cook until the onion has softened and turned translucent, then stir in the jalapeno and tomato. Season with salt, and cayenne pepper, then cook until the vegetables have softened, about 5 minutes. Remove from heat, and stir half of the vegetables into the cooking beans. Continue cooking the beans until tender, about 1 hour more.",
        "Once tender, remove 1/2 cup of beans, and mash with some of the cooking liquid to create a sauce. Stir in reserved vegetables.",
        "To serve, arrange the tongue and sausage onto a serving platter, pour the sauce overtop, and garnish with orange slices. Serve the remaining beans in a separate bowl."
    ],
    "ingredients": [
        "1 1/2 pounds whole beef tongue",
        "1 quart water",
        "1 (12 ounce) bag dried black beans",
        "4 ounces dried chipped beef",
        "1 chourico, cut into 1-inch pieces",
        "4 ounces bacon, cut into 1-inch pieces",
        "1 tablespoon vegetable oil",
        "1 clove garlic, finely chopped",
        "1 onion, chopped",
        "2 jalapeno peppers, minced",
        "1 large tomato, chopped",
        "1/8 teaspoon salt",
        "1 pinch cayenne pepper",
        "1 large orange, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Feijoada",
    "url": "http://allrecipes.com/recipe/83093/feijoada/"
}
