{
    "directions": [
        "Preheat oven to 450°F. Butter 13 x 9 x 2-inch broilerproof baking dish. Sprinkle shallots, rosemary and garlic over bottom of prepared dish. Cook fennel in boiling salted water until crisp-tender, about 12 minutes. Using slotted spoon, transfer fennel, cut side up, to prepared dish. Pour wine over fennel. Dot with butter. Sprinkle with salt and pepper.",
        "Bake fennel uncovered until tender, basting occasionally with wine and turning fennel over halfway through baking, about 30 minutes. (Can be made 1 day ahead. Cover; chill. Rewarm, uncovered, in 350°F oven for about 15 minutes before continuing.)",
        "Preheat broiler. Turn fennel cut side up. Sprinkle goat cheese over fennel. Broil until cheese melts and begins to brown, watching closely to avoid burning, about 6 minutes.",
        "Transfer fennel to platter. Season wine mixture in baking dish to taste with salt and pepper; spoon over fennel. Garnish platter with reserved fennel fronds and serve immediately."
    ],
    "ingredients": [
        "1/4 cup chopped shallots",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon chopped garlic",
        "6 small fennel bulbs, trimmed, halved lengthwise, fronds reserved for garnish",
        "2 cups dry white wine",
        "6 tablespoons (3/4 stick) butter, cut into pieces",
        "6 ounces soft fresh goat cheese (such as Montrachet), crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Braise",
        "Broil",
        "Thanksgiving",
        "Vegetarian",
        "Goat Cheese",
        "Rosemary",
        "Fennel",
        "White Wine",
        "Fall",
        "Healthy",
        "Shallot",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fennel with Shallots, Rosemary and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-with-shallots-rosemary-and-goat-cheese-15647"
}
