{
    "directions": [
        "In a saucepan simmer potatoes in salted water to cover until barely tender, about 12 minutes, and drain in a colander. Cut potatoes into 1/4-inch dice. In a heavy skillet dry-roast fennel seeds, cumin, and turmeric over moderate heat, stirring occasionally, until fragrant and several shades darker, about 2 minutes, being careful not to burn them. Add oil, onion, chilies, gingerroot, and garlic and cook, stirring, until onion is softened. Add potatoes and spinach and sauté over moderately high heat, stirring, until spinach is wilted but still bright green, about 2 minutes. Season filling with salt and pepper and cool. Filling may be made 1 day ahead and chilled, covered.",
        "Preheat oven to 400° F. and lightly grease a baking sheet.",
        "On a work surface arrange 1 phyllo sheet with a long side facing you and brush lightly with some butter. Top with a second phyllo sheet and brush lightly with butter. Cut stacked phyllo crosswise into 5 strips, each 12 by about 31/2 inches. Put 2 teaspoons filling near one corner of each strip and fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip, maintaining triangle shape. Put samosa, seam side down, on baking sheet and cover with plastic wrap. Make 24 more samosas with remaining phyllo and filling in same manner. Samosas may be prepared up to this point 6 hours ahead and chilled, covered. Bake samosas in middle of oven until golden brown, about 10 minutes.",
        "Garnish samosas with mint and serve warm with chutney."
    ],
    "ingredients": [
        "1/2 pound red potatoes (about 5, each about 2 inches in diameter)",
        "1 tablespoon fennel seeds",
        "1 tablespoon ground cumin",
        "1/2 teaspoon turmeric",
        "1/4 cup vegetable oil",
        "1 onion, chopped",
        "3 small serrano or jalapeño",
        "chilies, chopped fine (wear rubber gloves)",
        "a 2-inch piece fresh gingerroot, peeled and grated fine",
        "3 garlic cloves, minced",
        "1 pound fresh spinach, coarse stems discarded and leaves washed well and drained (about 3 cups packed)",
        "ten 17- by 12-inch phyllo sheets, thawed if frozen, stacked between 2 sheets wax paper and covered with a kitchen towel",
        "1 stick (1/2 cup) unsalted butter, melted",
        "Garnish: fresh mint sprigs",
        "Accompaniment:mint chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pepper",
        "Potato",
        "Appetizer",
        "Bake",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fennel-Scented Spinach and Potato Samosas",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-scented-spinach-and-potato-samosas-13008"
}
