{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Crush fennel seeds with a mortar and pestle or wrap in a kitchen towel and crush with bottom of a heavy skillet.",
        "Pat pork dry, then sprinkle with crushed fennel seeds and 1/2 teaspoon each of salt and pepper. Cut fennel bulbs lengthwise into 1/2-inch wedges.",
        "Heat oil in a 12-inch oven-proof heavy skillet over medium-high heat until it shimmers. Brown pork on all sides, about 6 minutes total, then transfer to a plate. Sauté garlic and fennel wedges in skillet until fennel is golden brown, about 6 minutes. Add wine, stirring and scraping up brown bits, then stir in broth and butter. Put pork on top of fennel and transfer skillet to oven. Roast until an instant-read thermometer inserted into center of pork registers 145 to 150°F, about 15 minutes. Transfer pork to a cutting board and let rest 10 minutes.",
        "Meanwhile, transfer skillet to stovetop (handle will be hot) and boil, stirring occasionally, until most of liquid has evaporated. Stir in lemon juice and 1/4 cup chopped fennel fronds. Thinly slice pork and serve over fennel with sauce."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds",
        "1 pound pork tenderloin",
        "2 medium fennel bulbs, trimmed, reserving fronds",
        "2 tablespoons extra-virgin olive oil",
        "3 garlic cloves, smashed",
        "1/4 cup dry white wine",
        "1/2 cup reduced-sodium chicken broth",
        "2 tablespoons unsalted butter, cut into pieces",
        "1/2 teaspoon fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Pork Tenderloin",
        "Fennel",
        "Winter",
        "Healthy",
        "Candy Thermometer",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fennel-Rubbed Pork Tenderloin with Roasted Fennel Wedges",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-rubbed-pork-tenderloin-with-roasted-fennel-wedges-351294"
}
