{
    "directions": [
        "Preheat oven to 350°F. Divide bread between 2 large rimmed baking sheets. Bake until slightly dry, about 10 minutes. Cool completely. Transfer to large bowl. Melt butter in large skillet over high heat. Add onions and fennel bulbs and seeds; sauté until onions soften but fennel bulbs are still crisp-tender, about 8 minutes. Remove from heat. Mix in prosciutto, pine nuts, parsley, marjoram and lemon peel. (Bread and fennel mixture can be made 1 day ahead. Cover separately. Store bread at room temperature; refrigerate fennel.) Add fennel mixture to bread. Season with salt and pepper. Mix in eggs.",
        "Loosely fill main cavity with stuffing. Add enough broth to remaining stuffing to moisten lightly (about 1/4 to 1/2 cup, depending on amount of remaining stuffing). Generously butter glass baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 25 to 30 minutes. Uncover and bake until top is slightly crisp and golden, about 15 to 20 minutes.",
        "Preheat oven to 350°F. Generously butter 13 x 9 x 2-inch glass baking dish. Add enough broth to stuffing to moisten (about 3/4 to 1 cup). Transfer stuffing to prepared dish. Cover with butter foil, buttered side down; bake until heated through, about 30 to 35 minutes. Uncover and bake until top is slightly crisp and golden, about 20 to 25 minutes longer."
    ],
    "ingredients": [
        "1 1-pound round sourdough bread, crust trimmed, cut into 3/4-inch cubes (about 10 cups)",
        "6 tablespoons (3/4 stick) butter",
        "5 cups thinly sliced green onions",
        "3 medium fennel bulbs, trimmed, bulbs very coarsely chopped",
        "1 tablespoon fennel seeds, coarsely ground",
        "9 ounces prosciutto, chopped",
        "1 cup pine nuts, toasted",
        "1/2 cup chopped fresh Italian parsley",
        "1 tablespoon chopped fresh marjoram",
        "1 1/2 teaspoons grated lemon peel",
        "4 large eggs, beaten to blend",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Herb",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Pine Nut",
        "Fennel",
        "Fall",
        "Prosciutto"
    ],
    "title": "Fennel, Prosciutto and Pine Nut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-prosciutto-and-pine-nut-stuffing-100466"
}
