{
    "directions": [
        "Preheat oven to 450°F. Toast fennel seeds in a small dry skillet over medium heat, tossing often, until fragrant, about 4 minutes. Let cool.",
        "Combine fennel seeds, garlic, paprika, and 2 tablespoons oil in a small bowl. Season pork with salt and pepper and place in a resealable plastic bag. Add spice mixture; seal bag and turn to coat. Let sit at least 30 minutes.",
        "Heat remaining 1 tablespoon oil in a large ovenproof skillet, preferably cast iron, over medium-high heat. Cook pork chops until golden brown on 1 side, about 4 minutes; turn. Add potatoes and shallots to skillet; season with salt and pepper and toss to coat in pan drippings. Cook, tossing potatoes and shallots occasionally, until pork is golden brown on second side, about 4 minutes.",
        "Transfer to oven and roast until potatoes are tender and an instant-read thermometer inserted into thickest part of chops registers 135°F, 10–15 minutes. (If potatoes need more time, transfer chops to a plate and continue to roast potatoes until tender; transfer chops back to skillet when potatoes are done.) Remove skillet from oven and mix in parsley and vinegar. Let pork chops rest 5 minutes in skillet.",
        "Transfer chops to a cutting board; cut meat from bones and slice against the grain. Serve with potatoes, shallots, and any pan juices.",
        "DO AHEAD: Pork chops can be marinated 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "1 1/2 tablespoons fennel seeds",
        "2 garlic cloves, finely grated",
        "1 teaspoon hot smoked Spanish paprika",
        "3 tablespoons vegetable oil, divided",
        "2 1\"-thick bone-in pork loin chops (about 1 1/4 pounds total)",
        "Kosher salt, freshly ground pepper",
        "1 pound small Yukon Gold potatoes, quartered",
        "2 large shallots, cut into quarters with some root attached",
        "1/2 cup fresh flat-leaf parsley leaves",
        "2 teaspoons red wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Potato",
        "Roast",
        "St. Patrick's Day",
        "Dinner",
        "Pork Chop",
        "Fall",
        "Winter",
        "Shallot",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Fennel-Crusted Pork Chops with Potatoes and Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-crusted-pork-chops-with-potatoes-and-shallots-51214810"
}
