{
    "directions": [
        "Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes; let cool.",
        "Finely chop 1 shallot half, then thinly slice the other half crosswise; set sliced shallot aside. Combine chopped shallot, mustard, sugar, and 1/4 cup vinegar in a resealable jar. Add oil and season with salt and pepper. Cover and shake to emulsify; set vinaigrette aside.",
        "Toss figs, reserved sliced shallot, and remaining 1/4 cup vinegar in a small bowl; let sit until figs and shallots are softened, at least 30 minutes.",
        "Just before serving, toss fennel, celery, blue cheese, and toasted walnuts in a large bowl. Drain figs and shallot and add to bowl. Drizzle with vinaigrette and toss to coat; season with salt and pepper.",
        "Vinaigrette can be made 1 day ahead; cover and chill. Figs and shallot can be soaked 4 hours ahead; store covered at room temperature. Fennel and celery can be sliced 4 hours ahead; place in a large bowl. Cover with a damp paper towel and chill."
    ],
    "ingredients": [
        "1/2 cup chopped walnuts",
        "1 medium shallot, halved lengthwise, divided",
        "2 tablespoons whole grain mustard",
        "1 teaspoon sugar",
        "1/2 cup sherry vinegar or red wine vinegar, divided",
        "1/3 cup olive oil",
        "Kosher salt, freshly ground pepper",
        "6 dried Turkish figs, very coarsely chopped",
        "1 fennel bulb, core removed, very thinly sliced",
        "6–8 celery stalks, very thinly sliced",
        "4 ounces blue cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Celery",
        "Fennel",
        "Thanksgiving",
        "Fig",
        "Blue Cheese",
        "Vegetarian",
        "Walnut",
        "Wheat/Gluten-Free",
        "Side"
    ],
    "title": "Fennel-Celery Salad With Blue Cheese and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-celery-salad-with-blue-cheese-and-walnuts"
}
