{
    "directions": [
        "Toast fennel seeds in a dry small skillet over medium, tossing occasionally, until fragrant, about 2 minutes. Transfer to a small plate and let cool. Finely grind in spice mill or with mortar and pestle.",
        "Pat chicken dry and sprinkle with half of fennel; season generously with salt and pepper; set aside.",
        "Preheat oven to 425°F. Cook bacon in a large ovenproof skillet over medium heat, stirring occasionally, until bacon is crisp, 8–10 minutes. Using a slotted spoon, transfer bacon to a medium bowl. Pour off all but 3 Tbsp. bacon fat; reserve for another use. Increase heat to medium-high and carefully place chicken halves, skin side down, in skillet, pressing down so skin makes good contact with surface of pan. Cook until skin is golden brown and starting to crisp, about 5 minutes. Turn chicken; transfer skillet to oven and roast until an instant-read thermometer inserted into the thickest part of thigh registers 165°F, 35–40 minutes. Transfer chicken to a cutting board and let rest 10 minutes.",
        "While chicken rests, add garlic, parsley, oil, lemon zest, thyme, red pepper flakes, and remaining fennel to bowl with bacon. Mix well; season with salt and pepper.",
        "Serve chicken drizzled with pan juices and topped with bacon mixture."
    ],
    "ingredients": [
        "2 teaspoons fennel seeds",
        "1 (3 1/2–4-pound) chicken, halved, or 4 pounds chicken legs (thigh and drumstick)",
        "Kosher salt, freshly ground pepper",
        "8 ounces bacon, finely chopped",
        "2 garlic cloves, finely grated",
        "1 cup coarsely chopped parsley",
        "1/4 cup olive oil",
        "2 teaspoons finely grated lemon zest",
        "1 teaspoon finely chopped thyme",
        "1/2 teaspoon crushed red pepper flakes",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fennel",
        "Bacon",
        "Dinner",
        "Garlic",
        "Lemon",
        "Roast",
        "Wheat/Gluten-Free"
    ],
    "title": "Fennel-Rubbed Chick-etta",
    "url": "http://www.epicurious.com/recipes/food/views/fennel-rubbed-chick-etta"
}
