{
    "directions": [
        "With a pastry cutter, mix flour, sugar, salt, baking powder and cubed butter until small clumps form and mixture develops a crumbly texture. Clumps of butter should be no larger than the size of a pea.",
        "Add cold sour cream until combined, do not over mix! Wrap with plastic and chill for one hour.",
        "Peel and cut apples into thin slices. Place into a medium bowl with two tablespoons apple juice or lemon juice to prevent them from browning. Add in sugar and cinnamon, making sure each apple has been coated.",
        "Preheat oven to 350 degrees  F.",
        "On a floured surface, roll out pie crust into a circle, the dough should be 1/4 inch thick. Transfer dough to a parchment lined baking sheet.",
        "Place apples onto dough, you can layer each slice into a circle to make a design or just pile them on, leaving enough room to fold over the edges of dough. Once your apples are placed in the center of the dough, fold over the excess dough covering the outer edge of the apples.",
        "Cut two tablespoons of butter into pieces and place sporadically on apples.",
        "Whisk the egg and 1 tablespoon water together until combined.",
        "With a pastry brush, brush egg wash over the edge of the dough and sprinkle with sugar. Place into oven and bake until crust is golden brown, approximately 35 to 45 minutes.",
        "Let cool, cut into slices and serve! Add a scoop of vanilla ice cream if desired."
    ],
    "ingredients": [
        "Pie Crust:",
        "2 cups flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking powder",
        "1 tablespoon sugar",
        "8 ounces Finlandia Unsalted Butter, cold and cubed",
        "1/2 cup sour cream, cold",
        "Apple Filling:",
        "6 medium-to-large apples, sliced thin",
        "3 teaspoons ground cinnamon",
        "3 tablespoons sugar",
        "2 tablespoons apple juice or lemon juice",
        "2 tablespoons Finlandia Unsalted Butter",
        "Egg Wash:",
        "1 egg",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Festive Apple Gallette",
    "url": "http://allrecipes.com/recipe/255476/festive-apple-gallette/"
}
