{
    "directions": [
        "Open vents in lid and bottom of a kettle grill and put 25 briquets on each of 2 opposite sides of bottom, leaving middle clear. Oil rack and position it with flaps over briquets (for adding more briquets), 5 to 6 inches above them. Light briquets. (They're ready when grayish white, 20 to 30 minutes.)",
        "Halve dough and form each half into a disk. Dust dough and your hands with flour. Holding 1 edge of 1 piece of dough in the air with both hands and letting bottom touch work surface, move hands around edge (like turning a steering wheel), allowing weight of dough to stretch round to roughly 6 inches. Flour your fists and with them stretch dough from center of underside, turning dough to maintain a rough circle, until about 10 inches in diameter.",
        "Put round on a lightly floured foil-lined baking sheet, then lightly flour top of dough and cover with another sheet of foil. Repeat shaping with remaining piece of dough and stack on top of first round, lightly flouring and covering with foil.",
        "Stir garlic into oil.",
        "Discard foil from top crust and lightly brush with 1 tablespoon garlic oil.",
        "Holding foil underneath, flip crust, oiled side down, onto rack of grill. Repeat with remaining crust. Cover grill and cook until undersides of crusts are golden brown, about 4 minutes.",
        "Turn crusts over with 2 metal spatulas, then brush each with 1 tablespoon garlic oil and sprinkle with bell peppers, feta, oregano, and salt and pepper to taste. Cover grill and cook 5 to 7 minutes more, or until undersides are golden brown and cheese is slightly melted."
    ],
    "ingredients": [
        "1 lb fresh or thawed frozen pizza dough",
        "All-purpose flour for dusting",
        "2 garlic cloves, finely chopped",
        "4 tablespoons extra-virgin olive oil",
        "2 red bell peppers, cut into short, thin strips",
        "5 oz feta, coarsely crumbled",
        "2 tablespoons finely chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Feta",
        "Bell Pepper",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Feta and Red Bell Pepper Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/feta-and-red-bell-pepper-pizza-103660"
}
