{
    "directions": [
        "Pulse cream cheese, feta, walnuts, and dates together in a food processor, stopping occasionally to scrape down side of bowl, until nuts are finely chopped and mixture is combined well. Quick-chill filling by freezing until cold (to make it easier to handle), 15 to 20 minutes in freezer.",
        "Stack 8 sheets of phyllo and cut stack crosswise into 4 strips (each about 12-by 4-inches), reserving remaining phyllo for another use.",
        "Stack phyllo strips, then place stack between sheets of wax paper or plastic wrap (to keep phyllo from drying out) and cover with a kitchen towel (to help keep the paper or plastic wrap in place).",
        "Preheat oven to 400°F with rack in the middle.",
        "Place 1 sheet of phyllo with a short end nearest you on a work surface (keep remaining sheets covered) and brush with butter.",
        "Roll a scant tablespoon of filling between your hands into a 3-inch-long log and place log in center of phyllo sheet, parallel to short end. Fold phyllo in half, enclosing log, and brush with butter.",
        "Roll a scant tablespoon of filling between your hands into a 3-inch-long log and place log in center of phyllo sheet, parallel to short end. Fold phyllo in half, enclosing log, and brush with butter.",
        "Starting at log end, roll up pastry to resemble a cigar. Transfer, seam side down, to a lightly buttered baking sheet.",
        "Make more rolls, leaving 1/2-inch of space between cigars on baking sheet. Bake until phyllo is golden, 15 to 20 minutes."
    ],
    "ingredients": [
        "6 ounces cream cheese, cut into pieces",
        "6 ounces crumbled feta (1 cup plus 2 tablespoons; patted dry if wet)",
        "2/3 cup walnut pieces",
        "1/2 cup chopped pitted dates",
        "1 (1 pound) package phyllo dough (roughly 17- by 12-inch sheets), thawed if frozen",
        "1 1/4 sticks (10 tablespoons) unsalted butter (preferably European-style), melted and cooled slightly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Christmas",
        "Cocktail Party",
        "Thanksgiving",
        "Cream Cheese",
        "Feta",
        "Date",
        "Walnut",
        "Christmas Eve",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Feta Walnut Date Cigars",
    "url": "http://www.epicurious.com/recipes/food/views/feta-walnut-date-cigars-365214"
}
