{
    "directions": [
        "Preheat oven to 425°F.",
        "Roll out pastry into a 14- by 10-inch rectangle (about 1/8 inch thick) on a lightly floured surface. Trim edges, preferably with a pizza wheel, and cut pastry lengthwise into 6 (1 1/2-inch-wide) strips. Chill strips on a baking sheet, covered with plastic wrap, until cold, about 10 minutes.",
        "Blend feta, cream, pepper, and 1 tablespoon egg in a food processor until smooth, then form into 21 balls on a work surface.",
        "Keeping remaining pastry covered, brush top of 1 strip with some of beaten egg. Starting 1/2 inch from one end and leaving 1/2 inch at opposite end, evenly space 7 cheese balls down center of strip. Cover with another pastry strip, pressing ends together, then press between balls of filling gently but firmly. Press pastry around each ball to seal top and bottom together and wipe away any filling that leaks out. Brush top of strip (but not sides) with some of egg and sprinkle with 1/2 tablespoon thyme. Cut between mounds of filling to form squares and arrange pastries 1 inch apart on a parchment-lined baking sheet. Make more pastries with remaining strips, filling, and thyme.",
        "Bake in middle of oven until puffed and golden, about 12 minutes. Serve warm."
    ],
    "ingredients": [
        "1 sheet puff pastry (from a 17 1/4-ounce package), thawed",
        "All-purpose flour for dusting",
        "3 1/2 ounce feta, crumbled (scant 1/2 cup)",
        "1 tablespoon heavy cream or 1/2 tablespoon whole milk",
        "1/8 teaspoon black pepper",
        "1 large egg, lightly beaten",
        "1 1/2 tablespoons fresh thyme leaves",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Quick & Easy",
        "Feta",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Feta Puffs",
    "url": "http://www.epicurious.com/recipes/food/views/feta-puffs-108081"
}
