{
    "directions": [
        "Preheat the oven to 325°F. Grease 8 holes of a muffin tin with the spray or sunflower oil and set aside.",
        "Put the eggs, tomato, spinach, nutmeg and salt (just a little bit as the feta is very salty) and\npepper into a large jug and whisk together until combined. Divide the mixture evenly among the 8\nmuffin  holes and then sprinkle over the feta cheese.",
        "Bake in the oven for about 20 minutes or until the muffins have risen slightly, are firm to the\ntouch and lightly golden. Then, remove from the oven and leave to cool a little.",
        "Place the salad leaves on a large serving plate. Whisk the oil and vinegar together in a small bowl\nor mug with a little salt and pepper and pour over the leaves.",
        "Using a small, sharp knife, loosen the edges of each muffin from the tin and carefully pop them\nout.",
        "Arrange them on top of the salad leaves. Rip up the basil leaves, scatter them over the top, and\nserve."
    ],
    "ingredients": [
        "Cooking spray or sunflower oil, for greasing",
        "8 free-range eggs",
        "8 sun-dried tomatoes, drained well and roughly chopped",
        "Large handful of baby spinach, roughly chopped (about 2 Tablespoons)",
        "Good pinch of freshly grated nutmeg",
        "1/2 cup feta cheese, roughly broken into bite-sized pieces",
        "A few fresh basil leaves",
        "Sea salt and freshly ground black pepper",
        "1/2 cup arugula, watercress, or mixed salad leaves",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon balsamic vinegar",
        "Sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Brunch",
        "Breakfast",
        "Omelet",
        "Muffin",
        "Spinach",
        "Arugula",
        "Egg",
        "Tomato",
        "Feta",
        "Quick and Healthy",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Feta, Spinach, and Basil Omelette Muffins",
    "url": "http://www.epicurious.com/recipes/food/views/feta-spinach-and-basil-omelette-muffins"
}
