{
    "directions": [
        "Combine tomatoes and vinegar in large bowl. Season with salt and pepper. Let stand until tomatoes release their juice, about 15 minutes.",
        "Heat oil in heavy large skillet over medium-high heat. Add bacon; cook until crisp, about 5 minutes. Using slotted spoon, transfer bacon to paper towels.",
        "Add leeks to same skillet and sauté until tender, about 3 minutes. Add garlic, rosemary and crushed red pepper; sauté 1 minute. Add tomato mixture and cooked bacon. Simmer until tomatoes are heated through, about 4 minutes. Add arugula and simmer until wilted, about 1 minute.",
        "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, about 3 minutes. Drain.",
        "Transfer pasta to large bowl. Add goat cheese, 6 tablespoons Parmesan cheese and tomato mixture. Toss to combine. Season with salt and pepper. Serve, passing additional Parmesan separately."
    ],
    "ingredients": [
        "2 1/2 pounds plum tomatoes, seeded, chopped (about 5 cups)",
        "2 tablespoons balsamic vinegar",
        "3 tablespoons olive oil",
        "6 thick bacon slices, cut into 1/2-inch pieces",
        "2 medium leeks (white and pale green parts only), finely chopped",
        "2 tablespoons finely chopped garlic",
        "1 tablespoon chopped fresh rosemary",
        "1/2 teaspoon dried crushed red pepper",
        "5 cups coarsely chopped fresh arugula (about 6 ounces)",
        "2 9-ounce packages fresh fettuccine",
        "6 ounces soft fresh goat cheese , crumbled",
        "6 tablespoons freshly grated Parmesan cheese",
        "Additional grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "Goat Cheese",
        "Bacon",
        "Arugula",
        "Summer"
    ],
    "title": "Fettuccine with Tomatoes, Bacon, Arugula and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-tomatoes-bacon-arugula-and-goat-cheese-5636"
}
