{
    "directions": [
        "Place 1 zucchini on work surface. Using vegetable peeler and firmly holding zucchini by stem end, shave zucchini lengthwise into long ribbons. Discard scraps. Repeat with remaining zucchini. Place ribbons (about 10 cups total) in large colander set over large bowl; sprinkle with 1 teaspoon fleur de sel. Let stand 30 minutes. Rinse zucchini under cold running water; drain well. Spread on 2 large kitchen towels; roll up in towels to absorb excess water. Set aside.",
        "Combine garlic, anchovy fillets, and crushed red pepper in very large serving bowl. Using pestle or wooden spoon, crush mixture until paste forms.",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain, reserving 1/2 cup cooking liquid. Transfer pasta to bowl with garlic mixture. Add 1/3 cup oil and 1/4 cup reserved cooking liquid; toss. Add zucchini, walnuts, 1/2 cup cheese, basil, and mint; toss. Season with salt and pepper, adding more pasta cooking liquid if mixture is dry. Drizzle with additional oil. Sprinkle with zucchini flowers, if desired. Serve with remaining cheese."
    ],
    "ingredients": [
        "2 1/2 pounds small zucchini, untrimmed",
        "1 teaspoon fleur de sel or coarse kosher salt",
        "2 garlic cloves, pressed",
        "2 anchovy fillets, minced (about 1 tablespoon)",
        "1/2 teaspoon (scant) dried crushed red pepper",
        "1 pound fettuccine",
        "1/3 cup extra-virgin olive oil plus additional for serving",
        "3/4 cup walnuts, toasted, coarsely chopped",
        "1 cup freshly grated Pecorino Romano cheese, divided",
        "1/2 cup (packed) thinly sliced fresh basil",
        "1/4 cup (packed) chopped fresh mint",
        "Fresh zucchini flowers, thinly sliced (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Nut",
        "Pasta",
        "Vegetable",
        "Dinner",
        "Parmesan",
        "Walnut",
        "Zucchini",
        "Summer",
        "Noodle",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fettuccine with Walnuts, Zucchini Ribbons, and Pecorino Romano",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-walnuts-zucchini-ribbons-and-pecorino-romano-235614"
}
