{
    "directions": [
        "Place pork in a large roasting pan. Using a paring knife, make 8 evenly spaced slits in pork; slide 1 garlic clove half into each. Season pork with 2 teaspoons salt, cover with plastic wrap, and chill at least 1 hour or up to overnight.",
        "Preheat oven to 325°F. Uncover pork and roast until very tender, 3 1/2-4 hours. Let cool. Shred pork and set aside.",
        "Pulse bread in a food processor until coarse crumbs form. Heat 2 tablespoons oil in a medium skillet over medium heat. Add breadcrumbs and cook, stirring often, until golden brown, about 5 minutes. Add lemon and orange zests and red pepper flakes, and cook, stirring, just until fragrant, about 1 minute. Transfer citrus breadcrumbs to a paper towel-lined plate and let cool.",
        "Bring beans, 1/4 cup Parmesan, and 2 cups water to a boil in a small saucepan. Reduce heat and simmer until flavors meld, 5-8 minutes. Season with salt and pepper.",
        "Heat remaining 4 tablespoons oil in a large pot over medium heat. Add chopped garlic and cook, stirring, until fragrant but not browned, about 1 minute. Add greens and cook, stirring occasionally, until tender, about 5 minutes. Add beans with their cooking liquid and reserved pork.",
        "Meanwhile, cook pasta in another large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 cup pasta cooking liquid.",
        "Add pasta and 1/2 cup pasta cooking liquid to greens. Cook over medium-high heat, stirring; add more pasta cooking liquid as needed until sauce coats pasta. Stir in 1/4 cup Parmesan. Top with breadcrumbs and more Parmesan.",
        "DO AHEAD: Pork can be roasted and shredded 2 days ahead. Cover; chill. Citrus breadcrumbs can be made 1 day ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "2 1/2 pound boneless pork shoulder (Boston butt)",
        "8 garlic cloves, 4 halved, 4 finely chopped",
        "2 teaspoons kosher salt plus more",
        "1 cup torn 1\" pieces day-old crusty white bread",
        "6 tablespoons olive oil, divided",
        "1 tablespoon finely grated lemon zest",
        "1 tablespoon finely grated orange zest",
        "1/2 teaspoon crushed red pepper flakes",
        "1 15-ounce can cannellini (white kidney) beans, rinsed",
        "1/2 cup finely grated Parmesan, divided, plus more",
        "Freshly ground black pepper",
        "2 bunches turnip greens or kale, center ribs and stems removed, leaves coarsely chopped",
        "1 pound fettuccine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Leafy Green",
        "Pasta",
        "Pork",
        "Roast",
        "Dinner",
        "Boil",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fettuccine with Pork, Greens, and Beans",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-pork-greens-and-beans-51155010"
}
