{
    "directions": [
        "1. Put the cauliflower, broth, and 1 cup water in a small pot; bring to a boil over medium-high heat. Adjust the heat to maintain a simmer and cook until the cauliflower is very soft, 25 to 30 minutes. Remove from the heat and cool 5 minutes. Carefully puree cauliflower and all the liquid in a blender until very smooth; set aside.",
        "2. Meanwhile, bring a large pot of salted water to a boil and cook the pasta until al dente, 8 minutes. Drain well, reserving about 1 cup pasta cooking water.",
        "3. Heat the oil in a large skillet over medium heat. Add the garlic and cook until fragrant, about 30 seconds. Add the cauliflower puree and evaporated milk and bring to a simmer. Cook until slightly thickened, 5 minutes and season with salt and pepper. Stir in the peas until heated through, 2 minutes. Toss in the cooked pasta, Parmesan cheese and about 1/2 cup of pasta water until the noodles are coated but the sauce is still loose. Remove from the heat and toss in the butter, chopped parsley and lemon zest. (If the sauce seems thick, adjust the consistency with the remaining pasta water). Serve immediately sprinkled with chopped parsley."
    ],
    "ingredients": [
        "2 cups cauliflower florets, about 8-ounces",
        "1 cup low-sodium chicken broth",
        "8 ounces whole grain fettuccine pasta",
        "1 teaspoon extra-virgin olive oil",
        "2 cloves garlic, minced",
        "1/2 cup low-fat evaporated milk",
        "Kosher salt and freshly ground pepper",
        "3/4 cup frozen petite peas, thawed, (4 ounces)",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon unsalted butter",
        "1 tablespoon chopped fresh parsley, plus extra for garnish",
        "1 1/2 teaspoons finely grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pasta Recipes",
        "Cauliflower",
        "Vegetable",
        "Cheese",
        "Parmesan Cheese Recipes"
    ],
    "title": "Fettuccine Alfredo",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/fettuccine-alfredo-recipe2"
}
