{
    "directions": [
        "Place dried mushrooms in medium bowl. Add hot water and let soak until softened, about 30 minutes. Remove mushrooms from water, squeezing excess water back into bowl. Strain and reserve soaking liquid. Slice mushrooms, discarding stems.",
        "Heat oil in heavy large skillet over medium heat. Add bacon and cook until fat renders, stirring frequently, about 3 minutes. Pour off half of fat. Add shallots to bacon in skillet and sauté 1 minute. Add dried and fresh mushrooms and rosemary and sauté 3 minutes. Add stock and mushroom-soaking liquid. Boil until liquid is reduced to glaze, about 10 minutes. Add half and half and simmer until beginning to thicken, about 5 minutes. Remove from heat. (Can be prepared 3 days ahead. Cover and refrigerate.)",
        "Add pasta to large pot of boiling salted water. Cook until just tender but still firm to bite, stirring occasionally.",
        "Meanwhile, rewarm mushroom sauce over medium-low heat.",
        "Drain pasta. Add to sauce and stir until coated. Mix in 2/3 cup Parmesan. Season with salt and pepper. Transfer to plates. Sprinkle with parsley."
    ],
    "ingredients": [
        "1 1-ounce package dried shiitake mushrooms",
        "1 1/2 cups hot water",
        "1 tablespoon olive oil",
        "6 bacon slices, minced",
        "3 shallots, minced",
        "4 ounces fresh shiitake mushrooms or button mushrooms, sliced",
        "1/2 teaspoon dried rosemary, crumbled",
        "1 cup beef stock or canned unsalted broth",
        "1 1/4 cups half and half",
        "8 ounces fettuccine",
        "2/3 cup freshly grated Parmesan cheese (about 2 ounces)",
        "Salt and freshly ground pepper",
        "Minced fresh Italian parsley",
        "Additional freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Parmesan",
        "Bacon",
        "Winter"
    ],
    "title": "Fettuccine with Shiitake Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-shiitake-mushroom-sauce-1139"
}
