{
    "directions": [
        "Place a large pot of water over high heat. When the water is at a rolling boil, add a big pinch of salt, drop in the fettucine, and stir. Cook the pasta, stirring from time to time, according to package directions for al dente, usually about 12 minutes. Meanwhile, heat the olive oil in a large skillet over medium heat. When the oil is warm, add the garlic and sauté until golden, about 1 minute. Add the lemon zest and cook for 30 seconds longer. Increase the heat to medium-high, add the zucchini, and cook, stirring, until tender, 2 to 3 minutes. Season with salt and pepper.",
        "Remove and reserve about 1/2 cup of the cooking water, then drain the pasta and quickly toss with the zucchini, parsley, and mint. Spoon on the ricotta and toss lightly again, add small amounts of the cooking water to lighten the cheese to the consistency you like, and serve."
    ],
    "ingredients": [
        "Salt",
        "1 pound fettuccine",
        "4 tablespoons extra-virgin olive oil",
        "3 or 4 garlic cloves, finely chopped or grated",
        "Zest of 1 to 2 lemons",
        "2 medium- large or 4 small zucchini, cleaned but not peeled, and shredded",
        "Freshly ground pepper",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1/4 cup chopped fresh mint",
        "1 cup fresh whole-milk ricotta cheese, at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Herb",
        "Pasta",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Ricotta",
        "Lemon",
        "Mint",
        "Squash",
        "Zucchini",
        "Summer",
        "Healthy",
        "Noodle",
        "Parsley",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fettuccine with Shredded Zucchini, Fresh Ricotta, and Lemon Zest",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-shredded-zucchini-fresh-ricotta-and-lemon-zest-51189620"
}
