{
    "directions": [
        "Toss chicken, 1 tablespoon cilantro and 1 tablespoon oil in small bowl. Sprinkle with salt and pepper. Cover; chill 1 hour.",
        "Heat 3 tablespoons oil in large skillet over medium heat. Add garlic, onion, bell peppers and poblano and sauté until just tender, about 10 minutes. Transfer vegetables to large bowl. Add chicken to same skillet and sauté over high heat until cooked through and beginning to brown, about 4 minutes. Transfer chicken to bowl with vegetables. Add cream and chipotle chilies to skillet and boil until reduced enough to coat spoon thickly, about 4 minutes.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain; return to pot.",
        "Add chicken mixture, cream mixture and remaining 1/2 cup cilantro to pasta in pot. Toss over medium-high heat until sauce coats pasta, about 3 minutes. Stir in 1 cup cheese and toss to blend. Season with salt and pepper. Transfer to large bowl. Sprinkle with remaining cheese."
    ],
    "ingredients": [
        "3 skinless boneless chicken breast halves, cut crosswise into strips",
        "1 tablespoon plus 1/2 cup chopped fresh cilantro",
        "4 tablespoons olive oil",
        "6 garlic cloves, minced",
        "1 large red onion, thinly sliced",
        "2 large red bell peppers, seeded, thinly sliced",
        "1 large poblano chili, seeded, thinly sliced",
        "2 cups whipping cream",
        "1 tablespoon minced canned chipotle chilies",
        "1 pound fettuccine",
        "1 1/2 cups coarsely grated Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Pasta",
        "Pepper",
        "Sauté",
        "Summer"
    ],
    "title": "Fettuccine with Chicken, Red Onion and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-chicken-red-onion-and-peppers-101687"
}
