{
    "directions": [
        "Melt 1 1/2 tablespoons butter in large nonstick skillet over medium-high heat. Add breadcrumbs; sauté until golden, about 5 minutes. Mix in 3 tablespoons basil and thyme. Remove from heat.",
        "Combine mussels and 1 cup water in large pot. Cover; boil until mussels open, about 7 minutes (discard any mussels that do not open). Using tongs, transfer mussels to bowl. Tent with foil. Strain cooking liquid into small bowl.",
        "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add vegetables and sauté until crisp-tender, about 5 minutes. Transfer to bowl. Melt 2 tablespoons butter with 2 tablespoons oil in same skillet. Add garlic; sauté 30 seconds. Add shrimp, scallops and 1/2 cup basil and sauté 3 minutes. Add mussel cooking liquid; simmer until shellfish are cook through, about 3 minutes. Add vegetables; stir to heat through.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain.",
        "Pour vegetables and shellfish over pasta; toss to coat. Season with salt and pepper. Sprinkle with 1/2 cup basil. Top with mussels and breadcrumbs."
    ],
    "ingredients": [
        "3 1/2 tablespoons butter",
        "1 1/2 cups fresh white breadcrumbs",
        "3 tablespoons plus 1 cup chopped fresh basil",
        "4 teaspoons chopped fresh thyme",
        "1 pound mussels, scrubbed, debearded",
        "1 cup water",
        "3 tablespoons extra-virgin olive oil",
        "1 zucchini, halved lengthwise, slice crosswise",
        "1 yellow summer squash, halved lengthwise, sliced crosswise",
        "1 red bell pepper, cut into matchstick-size strips",
        "4 garlic cloves, minced",
        "8 ounces uncooked large shrimp, peeled, deveined",
        "8 ounces sea scallops",
        "1 pound fettuccine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sauté",
        "Steam",
        "Basil",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Thyme"
    ],
    "title": "Fettuccine with Shrimp, Scallops and Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-shrimp-scallops-and-mussels-853"
}
