{
    "directions": [
        "Heat a large skillet over medium and toast walnuts, shaking pan often, until fragrant, about 5 minutes. Transfer to a plate or bowl and let cool; reserve skillet.",
        "Pulse cooled walnuts, beet greens, garlic, parsley, lemon zest, 2 tsp. lemon juice, 3/4 tsp. salt, and 1/2 tsp. pepper in a food processor until finely chopped. With the motor running, slowly drizzle in 3/4 cup oil until a thick sauce forms. Add 2/3 cup Parmesan and pulse until well combined. You should have about 1 1/2 cups pesto.",
        "Bring a large pot of salted water to a very low simmer. The water should register 180°F on an instant-read thermometer. Set a large bowl of ice water near your work station. Crack eggs into 4 ramekins or small bowls. Transfer 1 egg to a fine-mesh strainer set over a medium bowl to drain slightly (this will help remove extra egg whites and give the poached eggs a more compact shape). Carefully lower egg in strainer into hot water until egg is completely submerged. Gently shake strainer and carefully shape egg with a slotted spoon until edges of egg white start to turn opaque, 30–60 seconds. Carefully release egg from strainer into water with slotted spoon. Cook egg, turning and shaping occasionally with slotted spoon, until egg white is opaque and firm and yolk is plump and jiggles slightly to the touch, 3–3 1/2 minutes more. Transfer egg using a slotted spoon to the ice bath. As the first egg cooks, repeat steps to poach remaining 3 eggs, but keep an eye on which egg went in first. Use a timer to avoid overcooking.",
        "Bring the pot of water to a boil and cook fettuccine, stirring occasionally, until al dente. Using tongs or a spider, transfer pasta to a colander to drain. Reserve pasta cooking liquid in pot and set aside 1 cup liquid for the pasta sauce.",
        "Heat 2 Tbsp. oil in reserved skillet over medium-high. Add asparagus and sauté until warmed through, about 2 minutes. Add 1 cup pesto and 1/2 cup pasta cooking liquid; gently simmer, stirring occasionally, until thickened. Add fettuccine and simmer, tossing occasionally, until well combined. If sauce is too loose, continue to simmer; if it's too thick, add more pasta cooking liquid to loosen and stir vigorously to combine. Season with 1/2 tsp. salt, remaining 1 tsp. lemon juice, and remaining 1/4 tsp. pepper.",
        "Meanwhile, return the pot of water to a very low simmer. Transfer eggs from ice bath to pot to reheat until warm, 30–60 seconds. Remove eggs using a slotted spoon and place on a plate rubbed with a little olive oil. Divide pasta among 4 plates and top with poached eggs and Parmesan.",
        "Pesto can be made and stored in an airtight container in the refrigerator for up to 3 days or frozen for up to 3 months."
    ],
    "ingredients": [
        "1/2 cup walnuts",
        "1 1/2 cups (packed) chopped beet greens (from 1 bunch beets)",
        "2 garlic cloves, crushed",
        "1/4 cup (packed) parsley leaves",
        "Finely grated zest of 1 lemon",
        "3 teaspoons fresh lemon juice, divided",
        "Kosher salt",
        "3/4 teaspoon freshly ground black pepper, divided",
        "Olive oil",
        "2/3 cup grated Parmesan, plus more for serving",
        "4 large eggs",
        "3/4 pound fettuccine",
        "1 bunch asparagus (about 1 pound), trimmed, shaved lengthwise into ribbons with a vegetable peeler"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Walnut",
        "Asparagus",
        "Beet",
        "Spring",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fettuccine with Asparagus, Beet Green Pesto, and Poached Egg",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-asparagus-beet-green-pesto-and-poached-egg-56389490"
}
