{
    "directions": [
        "Heat 1 tablespoon olive oil in a skillet over medium heat; cook and stir sausage until browned and crumbly, 5 to 7 minutes. Transfer sausage to a bowl.",
        "Heat 1 tablespoon olive oil in the same skillet; cook and stir mushrooms and onion until onions are softened and mushrooms are softened yet still firm, about 5 minutes. Add chicken broth and asparagus; cook and stir for 3 minutes. Season mixture with salt and pepper.",
        "Move vegetables to the edge of the skillet and add half-and-half, flour, and butter; cook and stir until a thick and smooth sauce forms, 5 to 7 minutes. Add sausage to the skillet and stir vegetables into sauce.",
        "Bring a large pot of lightly salted water to a boil. Cook fettuccine in the boiling water until tender yet firm to the bite, 1 to 3 minutes; drain.",
        "Heat remaining 1 tablespoon olive oil in a separate skillet over medium heat; cook and stir garlic until fragrant, about 30 seconds. Add zucchini noodles (zoodles) and red pepper flakes; cook and stir until tender yet firm to the bite, 5 to 7 minutes. Mix fettuccine into zoodle mixture.",
        "Divide zoodle-fettuccine mixture among serving plates and top with sausage mixture. Sprinkle Parmesan cheese over each."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 (16 ounce) package chicken Italian sausage, casings removed",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/2 cup diced onion",
        "1 cup chicken broth",
        "1/2 pound fresh asparagus, cut into 1-inch pieces",
        "salt and ground black pepper to taste",
        "1/2 cup half-and-half",
        "2 tablespoons all-purpose flour",
        "1 tablespoon butter",
        "1 (9 ounce) package fresh fettuccine (such as Buitoni®)",
        "3 cloves garlic, thinly sliced",
        "2 zucchini, cut into spirals using a spiral slicer",
        "1/4 teaspoon red pepper flakes",
        "2 tablespoons shaved Parmesan cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fettuccine and Zoodles Topped with Chicken Sausage, Asparagus, and Mushrooms",
    "url": "http://allrecipes.com/recipe/246620/fettuccine-and-zoodles-topped-with-ch/"
}
