{
    "directions": [
        "Sauté the ingredients",
        "In a large fry pan over medium-high heat, warm the olive oil. Add the pancetta and sauté until it begins to render its fat, about 1 minute. Add the onions, carrots and celery and sauté until the onions are translucent, about 5 minutes. Add the beef and cook, breaking up the meat with a wooden spoon, until it is no longer red, about 7 minutes. Transfer to a slow cooker.",
        "Add the broth and wine to the pan and increase the heat to high. Bring to a boil and deglaze the pan, stirring to scrape up the browned bits from the pan bottom. Pour the liquid into the slow cooker along with the tomatoes and stir to combine.",
        "Cook the sauce",
        "Cover and cook the sauce on high for 4 hours or on low for 8 hours according to the manufacturer’s instructions. Add the milk, stirring to combine. Cover and continue cooking for 20 minutes more. Season with salt and pepper.",
        "Cook the pasta",
        "Bring a large pot of water to a boil over high heat. Add the 2 Tbs. salt and the pasta. Cook, stirring occasionally to prevent sticking, according to the package instructions until al dente (tender but firm to the bite). Drain, return the pasta to the pot and toss gently with 2 cups of the sauce. Serve, passing the cheese at the table. Serves 4; makes about 12 cups sauce total.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Slow Cooker,",
        "by Norman Kolpas (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "2 oz. pancetta, chopped",
        "2 small yellow onions, finely chopped",
        "2 carrots, finely chopped",
        "1 celery stalk, finely chopped",
        "3 lb. ground beef",
        "2 cups beef broth",
        "1 1/2 cups dry red wine",
        "1 can (28 oz.) crushed plum tomatoes",
        "1/2 cup milk",
        "Salt and freshly ground pepper, to taste",
        "",
        "2 Tbs. salt",
        "1 lb. fettuccine",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Fettuccine Bolognese",
    "url": "http://www.williams-sonoma.com/recipe/fettuccine-bolognese.html"
}
