{
    "directions": [
        "If using dried morels, place in 2-cup measuring cup and pour enough hot water over to reach 2-cup mark. Let soak until soft, pushing down occasionally if morels rise to top, about 20 minutes. Drain, reserving soaking liquid; add enough water to measure 1 1/4 cups if needed. Cut large morels in half.",
        "Melt butter in heavy large skillet over medium-high heat. Add shallots and fresh or reconstituted morels; sauté until shallots are tender, about 6 minutes. Add asparagus and 1 1/4 cups broth (if using fresh morels) or reserved soaking liquid (if using dried morels). Bring to boil, cover, and cook 2 minutes. Stir in cream and 2 tablespoons chopped tarragon. Simmer uncovered until sauce thickens slightly, about 4 minutes. Season sauce to taste with salt and pepper.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain pasta and return to pot. Add 1/2 cup Parmesan cheese and sauce; toss. Transfer to bowl; sprinkle with remaining 1/2 tablespoon tarragon. Serve with remaining Parmesan cheese."
    ],
    "ingredients": [
        "8 ounces fresh morel mushrooms, halved if large, or 1 ounce dried morels",
        "3 tablespoons butter",
        "1 cup (packed) sliced shallots",
        "1 pound asparagus, trimmed, cut into 1 1/2-inch lengths",
        "1 1/4 cups vegetable broth (if using fresh morels)",
        "2/3 cup whipping cream",
        "2 1/2 tablespoons chopped fresh tarragon, divided",
        "12 ounces fettuccine",
        "1 cup grated Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Duck",
        "Herb",
        "Mushroom",
        "Onion",
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Spring"
    ],
    "title": "Fettuccine with Asparagus, Morels, and Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/fettuccine-with-asparagus-morels-and-tarragon-237909"
}
