{
    "directions": [
        "Heat 1/4 cup oil in a wide 6-quart heavy pot over moderately low heat until hot but not smoking, then add fideos and cook, stirring frequently and turning over, until golden brown (nests will break up), 10 to 15 minutes. Transfer pasta with a slotted spoon to a bowl.",
        "Add 2/3 cup onion and 1 teaspoon garlic to oil remaining in pot and cook, stirring occasionally, until softened, 4 to 5 minutes, then stir in tomatoes with juice, 1/2 teaspoon salt, and sugar. Increase heat to moderately high and simmer, stirring frequently, until tomatoes have broken down into a very thick paste, about 25 minutes.",
        "While sofrito simmers, cook chorizo, bay leaf, and remaining 2/3 cup onion and 1 teaspoon garlic in remaining 2 tablespoons oil in an 8-quart heavy pot over moderate heat, stirring occasionally, until onion is softened, 4 to 5 minutes. Add wine and bring to a boil, then boil 5 minutes. Add stock and remaining 1/2 teaspoon salt and return to a boil, then add mussels. Cook, tightly covered, over moderate heat, until mussels open wide, 3 to 6 minutes. (Discard any mussels that remain unopened after 6 minutes.) Transfer mussels with a slotted spoon to a bowl. Discard bay leaf.",
        "Add mussel-cooking liquid and browned fideos to sofrito and boil, uncovered, stirring frequently, until pasta is tender and has absorbed most of liquid, 12 to 15 minutes. Add mussels and 1 tablespoon parsley and cook, tossing, until mussels are heated through, 1 to 2 minutes. Serve sprinkled with remaining tablespoon parsley.",
        "*Available at some supermarkets and tienda.com (888-472-1022)."
    ],
    "ingredients": [
        "6 tablespoons extra-virgin olive oil",
        "10 ounces fideos",
        "1 1/3 cups chopped onion (1 large)",
        "2 teaspoons minced garlic",
        "2 (14- to 15-ounce) cans diced tomatoes in juice",
        "1 teaspoon salt",
        "Pinch of sugar",
        "1/2 cup finely chopped Spanish chorizo (cured spiced pork sausage; 2 oz)",
        "1 Turkish or 1/2 California bay leaf",
        "1 cup dry white wine",
        "5 cups white fish stock",
        "3 pounds mussels (preferably cultivated), scrubbed and beards removed",
        "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Pork",
        "Shellfish",
        "Meat",
        "Sausage",
        "Seafood",
        "Mussel",
        "Gourmet"
    ],
    "title": "Fideos with Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/fideos-with-mussels-231491"
}
