{
    "directions": [
        "Cut away the honeydew rind and the dark green flesh close to the rind. Cut the honeydew into 1-inch chunks. You should have 4 cups of melon.",
        "Put the melon in a blender along with the fennel, celery, cucumber, and jalapeños. Blend on low speed until almost smooth. Strain through a medium-mesh sieve, pressing on the solids to extract as much liquid as possible; discard the solids. Stir in the minced chile, lime juice, salt, and sugar. Taste and adjust seasonings. Cover tightly and refrigerate until very cold.",
        "When ready to serve, heat your grill on high until very hot.",
        "Sprinkle salt, chile flakes, and the mint all over the shrimp, then gently press in the seasonings. Drizzle a little oil all over the shrimp. Grill the shrimp, flipping once, until just opaque throughout, about 3 minutes. Skewer to serve if desired.",
        "Divide the cold soup among cold serving bowls. Serve the hot shrimp on small plates next to the bowls. Drizzle a little oil over the soup and shrimp. Garnish the soup with mint and squirt a little lime juice over the shrimp. Serve immediately."
    ],
    "ingredients": [
        "1/2 ripe honeydew, seeded",
        "1 small fennel bulb, coarsely chopped",
        "1 celery heart stalk, coarsely chopped",
        "1/2 English cucumber, peeled and coarsely chopped",
        "2 jalapeños, stemmed, seeded, and chopped",
        "1 fresh green Thai chile, stemmed, seeded, and minced",
        "3 tablespoons fresh lime juice, plus more to taste and wedges for serving",
        "1 tablespoon kosher salt, plus more to taste",
        "1 teaspoon sugar, plus more to taste",
        "Crushed red chile flakes",
        "1/4 cup packed fresh mint leaves, very thinly sliced, plus more for garnish",
        "1 pound large (16- to 20-count) shrimp, shelled and deveined",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Shellfish",
        "Appetizer",
        "Cocktail Party",
        "Backyard BBQ",
        "Melon",
        "Honeydew",
        "Seafood",
        "Shrimp",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Chile Pepper",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fiery Grilled Shrimp with Honeydew Gazpacho",
    "url": "http://www.epicurious.com/recipes/food/views/fiery-grilled-shrimp-with-honeydew-gazpacho-368610"
}
