{
    "directions": [
        "1. Heat the oven to 350°F. Line a baking sheet with parchment paper.",
        "2. Place the flour, butter, blue cheese, and a few grinds of black pepper in the bowl of a food processor and process until the dough just comes together and starts to form a ball.",
        "3. Dump the dough out onto a lightly floured surface and knead a few times to pull it together. Then roll out to a 1/8-inch-thick circle with a floured rolling pin. Cut rounds out of the dough with a floured 1-inch round cutter and transfer to the parchment-lined baking sheet. Reroll the scraps (no more than once) and cut more rounds.",
        "4. Using the back of a rounded 1/2-teaspoon measure or your knuckle, make an indentation in the center of each dough round. Spoon about 1/4 teaspoon of the fig preserves into each indentation, using your finger to push the preserves as best as possible into the indentation.",
        "5. Bake the savouries until the preserves are bubbling and the pastry is light golden on the bottom, 10 to 12 minutes. Let cool on the baking sheet for at least 10 minutes, then remove to a wire rack to finish cooling."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "8 tablespoons (1 stick) unsalted butter, at room temperature",
        "4 ounces blue cheese, crumbled",
        "Freshly ground black pepper",
        "About 3 tablespoons fig preserves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Appetizer",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Thanksgiving",
        "Valentine's Day",
        "Quick & Easy",
        "Oscars",
        "Wedding",
        "New Year's Eve",
        "Blue Cheese",
        "Fig",
        "Anniversary",
        "Birthday",
        "Shower",
        "Christmas Eve",
        "Engagement Party",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fig and Blue Cheese Savouries",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-blue-cheese-savouries-51140000"
}
