{
    "directions": [
        "Mix 1 1/4 cups warm water, sugar, and yeast in small bowl. Let stand until mixture bubbles, about 10 minutes. Combine bread flour, 3/4 cup figs, rye flour, fennel seeds, and salt in large bowl of heavy-duty mixer fitted with paddle attachment. Mix using lowest speed; gradually add yeast mixture, mixing until all flour has been incorporated (or to mix by hand, stir vigorously with wooden spoon until dough comes together). Replace paddle with dough hook and knead until smooth and elastic (or to knead by hand, transfer dough to floured work surface and knead until smooth and elastic, about 5 minutes). Place dough in oiled bowl; turn to coat. Cover with plastic wrap, then kitchen towel and let dough rise in warm draft-free area until doubled in volume, about 1 hour.",
        "Turn dough out onto work surface and knead gently until deflated. Knead in remaining 3/4 cup figs. Cut dough in half; shape each piece into 12-inch-long loaf. Brush rimmed baking sheet with oil; transfer loaves to sheet, spacing apart. Cover with plastic, then kitchen towel; let rise in warm draft-free area until almost doubled in volume, about 35 minutes.",
        "Preheat oven to 375°F. Bake bread until crust is golden and loaves sound hollow when tapped, about 45 minutes. Cool bread on rack."
    ],
    "ingredients": [
        "1 1/4 cups warm water (105°F to 115°F)",
        "1 tablespoon sugar",
        "1 envelope dry yeast (2 1/4 teaspoons)",
        "3 cups bread flour",
        "1 8-ounce package dried Calimyrna figs, chopped (about 1 1/2 cups)",
        "1 cup rye flour",
        "2 tablespoons fennel seeds",
        "1 tablespoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Bake",
        "Picnic",
        "Fig",
        "Winter",
        "Party"
    ],
    "title": "Fig and Fennel Bread",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-fennel-bread-106193"
}
