{
    "directions": [
        "Remove any stems from figs. In a saucepan combine figs with remaining filling ingredients and simmer, covered, 20 minutes, or until very tender. Transfer mixture to a food processor and blend until smooth.",
        "Brush a 9-inch-square or 10-inch round tart pan with a removable fluted rim with some butter. On a work surface arrange 1 sheet phyllo with a short side facing you and brush with some butter, On it layer 3 more sheets phyllo and more butter in same manner and line pan, pressing phyllo into pan with fingertips and leaving short sides overhanging.",
        "Repeat layering procedure with remaining phyllo and some of remaining butter and arrange in pan at a 90-degree angle to the first lining, easing to fit. Put pan on a baking sheet and roll overhanging edges under loosely (outside the pan) to form a decorative edge. Brush edge with remaining butter and spread fig mixture evenly on bottom.",
        "Preheat oven to 350°F.",
        "Peel, quarter, and core apples and cut each quarter in 3 or 4 wedges. Arrange apple wedges over fig mixture in decorative pattern and sprinkle with granulated sugar. Bake tart in middle of oven 40 minutes.",
        "In a small bowl stir together yogurt and egg.",
        "Remove tart from oven and increase oven temperature to 475°F. Pour yogurt mixture over apples and cover edge of tart with foil. Return tart to oven and bake 15 minutes, or until apples begin to brown. Cool tart in pan on a rack 30 minutes and sprinkle with almonds and confectioners' sugar."
    ],
    "ingredients": [
        "an 8-ounce package dried Calimyrna figs (about 1 cup)",
        "3/4 cup apple juice",
        "1/2 cup sugar",
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "8 sheets phyllo dough, thawed if frozen",
        "4 medium Empire, Winesap, or Jonagold apples (about 2 pounds)",
        "1/3 cup granulated sugar",
        "1/2 cup vanilla yogurt",
        "1 large egg, beaten lightly",
        "2 tablespoons natural almonds, toasted and chopped",
        "confectioners' sugar for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Fig",
        "Apple",
        "Almond",
        "Fall",
        "Gourmet"
    ],
    "title": "Fig and Apple Phyllo Tart",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-apple-phyllo-tart-10718"
}
