{
    "directions": [
        "Place figs in small bowl. Pour 1 cup boiling water over; let soak 45 minutes. Drain figs; place in small saucepan. Add wine and next 3 ingredients; bring to boil, stirring to dissolve sugar. Reduce heat to medium. Simmer until figs are tender and liquid is syrupy, stirring occasionally, about 20 minutes. Add vinegar; cook 1 minute longer. Remove pan from heat; cool.",
        "Melt butter with oil in medium skillet over medium-high heat. Add onion; sauté until beginning to soften and brown, stirring occasionally, about 4 minutes. Reduce heat to low; add vinegar and sugar, then sprinkle with coarse salt and pepper. Stir until vinegar has almost evaporated, about 1 minute. Cool. DO AHEAD: Figs and onion mixture can be made 2 hours ahead. Let stand at room temperature.",
        "Whisk ricotta, 1 tablespoon oil, and cream in medium bowl until fluffy. Season with coarse salt and pepper. Preheat broiler. Drizzle ciabatta with some olive oil and sprinkle with coarse salt and pepper. Broil bread on both sides until toasted. Transfer to serving plate. Spread 2 tablespoons ricotta mixture on each bread slice. Spoon glazed figs with some of syrup over; top with onion mixture. Sprinkle with Parmesan and oregano. Drizzle with oil and serve immediately."
    ],
    "ingredients": [
        "1/2 cup dried black Mission figs, stemmed, halved",
        "1 cup boiling water",
        "3/4 cup dry red wine",
        "2 tablespoons sugar",
        "1 small bay leaf",
        "1/8 teaspoon coarse kosher salt",
        "1 teaspoon red wine vinegar",
        "1 1/2 teaspoons butter",
        "1 1/2 teaspoons extra-virgin olive oil",
        "1 medium red onion, halved through core, cut lengthwise into 1/2-inch-thick strips",
        "2 tablespoons red wine vinegar",
        "1/2 teaspoon sugar",
        "Coarse kosher salt",
        "1 cup fresh ricotta cheese",
        "1 tablespoon extra-virgin olive oil plus additional for drizzling",
        "1 teaspoon heavy whipping cream",
        "Coarse kosher salt",
        "8 1-inch-thick slices ciabatta bread (about 4 1/2 x 2 inches)",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Appetizer",
        "Vegetarian",
        "High Fiber",
        "Oscars",
        "Dinner",
        "Ricotta",
        "Fig",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fig and Onion Bruschetta",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-onion-bruschetta-351069"
}
