{
    "directions": [
        "Pulse together flour, confectioners sugar, and salt in a food processor until combined. Add butter and process until mixture resembles fine meal. Add 3 yolks (reserving the fourth for egg wash) and process until it forms a smooth dough, 2 to 3 minutes. (Don't worry about overworking dough.) Transfer dough to a work surface and gather into a ball, then divide into 3 equal pieces. Form one third of dough into a small disk, then form remaining dough into a larger disk. Chill disks, each wrapped in plastic wrap, until firm, at least 1 hour.",
        "Simmer figs, water, sugar, and cinnamon in a 1- to 2-quart heavy saucepan, uncovered, stirring occasionally, until mixture is thickened, 2 to 3 minutes. Stir in sesame seeds (3 tablespoons) and cook, stirring, 1 minute. Remove from heat and stir in orange-flower water, then transfer filling to a bowl. Cool filling to room temperature, about 30 minutes.",
        "Put oven rack in middle position and preheat oven to 350°F. Line a baking sheet with parchment paper and place flan ring in center.",
        "Roll out larger disk of dough into an 11-inch round on a lightly floured surface with a floured rolling pin. (If dough is too firm to roll out, let stand at room temperature 5 minutes.) Fit dough into flan ring, pressing dough up side of ring (dough is very tender and tears easily; patch as needed; they will blend in during baking), then trim dough flush with top of ring. Spoon filling into crust and spread evenly.",
        "Roll out remaining disk of dough into a 9-inch round on lightly floured surface with floured rolling pin. Gently lay round over filling, then roll rolling pin over top to trim. Patch if necessary.",
        "Beat together remaining yolk and cream (1 tablespoon) in a cup with a fork and brush some of egg wash over top crust, then chill until egg wash appears darker and is slightly tacky, about 3 minutes. Brush with second coat of egg wash and chill again. Lightly score top with back of a small knife to make a decorative pattern and sprinkle with sesame seeds (1 teaspoon).",
        "Bake tart until top is golden, 30 to 35 minutes. Transfer tart on baking sheet to a rack and cool 10 minutes, then slide tart off parchment onto rack to cool. Gently remove ring.",
        "While tart bakes, stir together cream, honey, zest, and cardamom in a medium bowl and chill, covered. Just before serving, beat cream mixture with an electric mixer until it holds soft peaks.",
        "Serve tart, warm or at room temperature, with cream and oranges."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/2 cup confectioners sugar",
        "1/4 teaspoon salt",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
        "4 large egg yolks",
        "1 tablespoon heavy cream",
        "1 teaspoon sesame seeds, toasted",
        "9 ounces dried Turkish figs, stemmed and finely chopped (1 1/2 cups)",
        "1/2 cup water",
        "4 1/2 tablespoons granulated sugar",
        "3/4 teaspoon cinnamon",
        "3 tablespoons sesame seeds, toasted",
        "1 tablespoon orange-flower water (preferably Mymouné)",
        "1 cup heavy cream",
        "2 tablespoons mild honey",
        "1 1/2 teaspoons finely grated fresh orange zest",
        "1/4 teaspoon ground cardamom",
        "Special equipment: parchment paper; an 8-inch flan ring (3/4 inch high) or round tart pan",
        "Accompaniment: fresh orange sections"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fig and Sesame Tart with Cardamom Orange Cream",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-sesame-tart-with-cardamom-orange-cream-238427"
}
