{
    "directions": [
        "Roll out pastry with a floured rolling pin on a lightly floured surface into a 15- by 12-inch rectangle (3/4 inch thick) and trim edges. Halve pastry lengthwise with a pastry wheel or large knife to form 2 (15- by 6-inch) strips. Cut each strip crosswise into 7 equal rectangles (for a total of 14). Arrange rectangles in 1 layer on 2 large baking sheets and chill 20 minutes.",
        "Preheat oven to 400°F.",
        "While pastry is chilling, trim and chop 4 figs and stir together with mascarpone, ginger, sugar, and vanilla. Chill filling, covered.",
        "Cover pastry rectangles on 1 baking sheet with an inverted large metal cooling rack to lightly weight them, then bake in upper third of oven until golden and cooked through, 15 to 18 minutes. Remove rack carefully and transfer baked pastry to another rack to cool completely. Bake remaining rectangles, weighted with rack (make sure it's cooled), in same manner.",
        "While pastry is baking, cut remaining figs lengthwise into 1/4-inch-thick slices.",
        "Spread filling over 7 pastry rectangles and top with half of sliced figs, overlapping them. Dust with confectioners sugar. Cover figs with remaining pastry rectangles and top with remaining figs, overlapping them. Dust with confectioners sugar."
    ],
    "ingredients": [
        "1 frozen puff pastry sheet (from a 17 1/4-oz package), thawed",
        "26 firm-ripe fresh figs (1 1/2 lb)",
        "1 cup mascarpone cheese (8 1/2 oz)",
        "1 tablespoon finely chopped crystallized ginger, or to taste",
        "2 1/2 tablespoons sugar",
        "3/4 teaspoon vanilla",
        "Confectioners sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Fig",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fig and Gingered Mascarpone Napoleons",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-gingered-mascarpone-napoleons-105433"
}
