{
    "directions": [
        "Preheat oven to 300°F. Bring wine and figs to boil in small saucepan. Remove from heat and let stand until figs soften, about 15 minutes. Drain figs, reserving wine and figs separately.",
        "Meanwhile, heat oil in heavy large ovenproof pot over medium-high heat. Sprinkle pork with salt and pepper. Add pork to pot and cook until browned on all sides, about 8 minutes total. Transfer pork to platter.",
        "Add onion and carrot to same pot. Cover and reduce heat to medium-low. Cook until onion is golden brown, stirring occasionally, about 8 minutes. Stir in rosemary and garlic; sauté 1 minute. Add broth and reserved wine.",
        "Return pork to pot, meat side down. Bring to boil. Cover and transfer to oven. Bake until thermometer inserted into center of roast registers 150°F, adding figs during last 10 minutes of roasting, about 1 1/2 hours.",
        "Transfer pork to cutting board. Using slotted spoon, transfer figs to small bowl. Tent pork and figs with foil to keep warm. Spoon fat from surface of sauce. Bring sauce to boil. Stir butter and flour in medium bowl to blend. Whisk 1 cup sauce and mustard into butter mixture. Whisk mustard-butter mixture into sauce in pot. Boil sauce until thickened and slightly reduced, about 8 minutes. Season to taste with salt and pepper.",
        "Transfer pork to platter, surround with figs, and pour sauce over. Carve pork between rib bones."
    ],
    "ingredients": [
        "2 cups dry white wine",
        "1 8-ounce package dried Calimyrna figs, stemmed, halved lengthwise",
        "1 tablespoon olive oil",
        "1 6-rib blade-end or center-cut pork loin roast, chine bone removed, ribs cracked",
        "1 medium onion, chopped",
        "1 medium carrot, peeled, chopped",
        "1 tablespoon chopped fresh rosemary",
        "2 garlic cloves, chopped",
        "1 14-ounce can low-salt chicken broth",
        "1 tablespoon butter, room temperature",
        "1 tablespoon all purpose flour",
        "2 tablespoons Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Mustard",
        "Pork",
        "Braise",
        "Dinner",
        "Fig",
        "Rosemary",
        "White Wine",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fig and Rosemary Pot Roast",
    "url": "http://www.epicurious.com/recipes/food/views/fig-and-rosemary-pot-roast-230931"
}
