{
    "directions": [
        "In a cast-iron skillet or sauté pan over medium-high heat, add 1 tablespoon ghee or oil along with the figs and cherries and sauté for 2 minutes. Add the balsamic vinegar and Worcestershire sauce and simmer to reduce by one third, about 3 minutes. Remove from the heat.",
        "Transfer the marinade to a bowl and place in the freezer to cool for about 10 minutes.",
        "In the same bowl or a resealable zip-top bag, combine the chicken and marinade. Mix thoroughly to coat the chicken evenly, cover if using a bowl, and refrigerate for at least 2 hours, or up to 24 hours.",
        "When you are ready to eat, preheat the oven to 400°F.",
        "Transfer the chicken from the marinade to a plate. Reserve the marinade.",
        "Heat the remaining 1 tablespoon ghee or oil in an oven-safe cast-iron skillet or sauté pan over medium-high heat. Season the chicken thighs with the sea salt and cook the chicken in the hot ghee or oil until browned, about 3 minutes per side. Add the reserved marinade and bone broth and bring to a simmer. Reduce the liquid by half, about 10 minutes, turning the chicken periodically to ensure even cooking.",
        "On a baking sheet or in an oven-safe sauté pan, toss the walnuts with the olive oil, sea salt, and paprika. Spread out in an even layer and toast in the oven for about 10 minutes.",
        "Transfer the skillet or pan with the chicken to the oven and cook for 10 minutes. Remove from the oven and let sit for 10 minutes. Serve the chicken, garnished with toasted walnuts and chopped fresh parsley."
    ],
    "ingredients": [
        "2 tablespoon ghee or olive oil",
        "1/2 cup dried mission figs, diced",
        "1/2 cup dried cherries",
        "1/4 cup balsamic vinegar",
        "1 tablespoon Worcestershire sauce",
        "6 boneless, skinless chicken thighs",
        "2 tablespoons ghee or olive oil",
        "1 teaspoon sea salt",
        "1 cup Chicken Bone Broth",
        "Chopped fresh flat-leaf parsley, for garnish",
        "1/2 cup walnuts",
        "1 tablespoon olive oil",
        "1/4 teaspoon sea salt",
        "1/4 teaspoon paprika"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Chicken",
        "Fig",
        "Walnut",
        "Dinner",
        "Healthy",
        "Kid-Friendly",
        "Braise"
    ],
    "title": "Fig-Braised Chicken with Spiced Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/fig-braised-chicken-with-spiced-walnuts"
}
