{
    "directions": [
        "Arrange racks in upper and lower thirds of oven; preheat to 400°F. Line 2 rimmed baking sheets with parchment paper.",
        "Stir vinegar, honey, red pepper flakes, salt, pepper, and 1 cup water in a medium pot. Add figs and bring to a boil. Reduce heat, bring to a simmer, and cook, stirring occasionally, until figs are softened and liquid has almost evaporated and is a syrupy consistency, 7–10 minutes. Transfer figs to a plate; let cool.",
        "Beat egg with 1 Tbsp. water in a small bowl. If using a 14-ounce package with 1 sheet of pastry, roll pastry to an 18x12\" rectangle on a lightly floured surface. If using a 17-ounce package with 2 sheets of pastry, roll each sheet to a 12x9\" rectangle. Cut pastry along the 12\" side into 12 (1-inch-wide) strips. Cut each strip crosswise into pieces about 4 1/2\" long. You should have 48 (4 1/2x1\") strips pastry.",
        "Scoop a heaping 1/2 tsp. cheese and press into cut side of 1 fig half. Place fig half in the center of 1 pastry strip. Brush 1 end of pastry with egg wash and roll to enclose. Transfer seam side down to prepared sheet. Repeat with remaining cheese, figs, and pastry. Brush top of each pastry with egg wash and sprinkle with seeds, if using. Bake pastries, rotating and switching sheets top to bottom halfway through, until golden brown and puffed, 15–18 minutes.",
        "Figs can be cooked 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1/4 cup plus 2 tablespoons red wine vinegar",
        "3 tablespoons honey",
        "3/4 teaspoon crushed red pepper flakes",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "24 dried black Mission figs (medium or large), stems trimmed, halved",
        "1 large egg",
        "1 (14- or 17-ounce) box of puff pastry (preferably all-butter puff), thawed according to package directions",
        "All-purpose flour (for surface)",
        "6 1/2 ounces plain goat cheese",
        "Sesame seeds or poppy seeds (for topping; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "snack",
        "Hors D'Oeuvre",
        "Super Bowl",
        "Vegetarian",
        "Fig",
        "Phyllo/Puff Pastry Dough",
        "Goat Cheese"
    ],
    "title": "Figs-in-a-Blanket With Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/figs-in-a-blanket-with-goat-cheese"
}
