{
    "directions": [
        "In a heavy skillet heat the oil over moderately high heat until it is hot but not smoking and in it brown the filets mignons, patted dry and seasoned with salt and pepper, for 2 minutes on each side. Sauté the fillets mignons, turning them on both sides and the edges, for 4 to 6 minutes more for medium-rare meat, transfer them to a cutting board, and let them stand, covered loosely with foil, while making the sauce.",
        "In the fat remaining in the skillet cook the shallot over moderately low heat, stirring, until it is softened, add the Port and the red wine, and boil the mixture until it is reduced by two thirds. Add the broth, boil the mixture until it is reduced by half, and strain the mixture through a fine sieve into a small saucepan. Whisk in the mustard, bring the mixture to a boil, and add the beurre manié, a little at a time, whisking until the sauce is smooth. Simmer the sauce, whisking occasionally, for 2 minutes, whisk in any juices that have accumulated on the cutting board, and season the sauce with salt and pepper.",
        "Cut the filets mignons into 1/4-inch-thick slices, divide the slices among 4 plates, and spoon the sauce over them. Garnish the fillets mignons with the parsley and serve them with the red onion confit.",
        "In a heavy skillet cook the garlic and the shallot with the thyme and salt and pepper to taste in the oil over moderately low heat, stirring, until the shallot is softened. Add the red onion and cook the mixture, stirring for 5 to 10 minutes, or until the onion is very soft. Add the Port, the red wine, the sugar, and the vinegar and simmer the mixture, uncovered, for 5 to 10 minutes, or until almost all the liquid is evaporated. Stir in the parsley and salt and pepper to taste and cook the mixture, stirring, for 1 minute. The confit may be made 1 day in advance, kept covered and chilled, and reheated. Makes about 1 cup."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "four 5- to 6-ounce filets mignons (each about 1 1/2 inches thick)",
        "3 tablespoons minced shallot",
        "1/3 cup Tawny Port",
        "2/3 cup dry red wine",
        "1 cup beef broth",
        "1 1/2 teaspoons Dijon-style mustard",
        "a beurre manié made by kneading together 1 tablespoon softened unsalted butter and 1 tablespoon all-purpose flour",
        "flat-leafed parsley sprigs for garnish",
        "1 tablespoon minced garlic",
        "1/4 cup minced shallot",
        "1/2 teaspoon dried thyme, crumbled",
        "1 tablespoon olive oil",
        "2 1/2 cups thinly sliced red onion",
        "1/4 cup Tawny Port",
        "1/2 cup dry red wine",
        "1 teaspoon sugar, or to taste",
        "1 tablespoon balsamic vinegar, or to taste",
        "3 tablespoons minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Onion",
        "Sauté",
        "Quick & Easy",
        "Beef Tenderloin",
        "Port",
        "Red Wine",
        "Gourmet"
    ],
    "title": "Filets Mignons with Mustard Port Sauce with Red Onion Confit",
    "url": "http://www.epicurious.com/recipes/food/views/filets-mignons-with-mustard-port-sauce-with-red-onion-confit-11130"
}
