{
    "directions": [
        "In an 8-inch skillet, preferable cast-iron, cook bacon over moderate heat until crisp and transfer to paper towels to drain. Pour off excess fat from skillet. Crumble bacon and reserve.",
        "In skillet cook garlic in 1 tablespoon butter over moderately low heat, stirring, until softened. Add mushrooms and salt and pepper to taste and cook over moderate heat, stirring, until liquid from mushrooms starts to evaporate. Add Cognac or other brandy and boil until nearly evaporated. Stir in water, lemon juice, and Worcestershire sauce and boil until sauce is thickened slightly. Transfer sauce to a small saucepan and stir in reserved bacon and parsley. Keep sauce warm.",
        "Pat filets mignons dry with paper towels and sprinkle with salt and pepper to taste. In skillet heat remaining 1/2 tablespoon butter over moderately high heat until foam begins to subside and sauté filets mignons 4 minutes. Sear sides slightly and turn filets over. Sauté 3 to 3 1/2 minutes more for medium-rare meat. Divide filets between 2 plates and spoon sauce over them."
    ],
    "ingredients": [
        "1 slice bacon",
        "1 small garlic clove, mashed to a paste",
        "1 1/2 tablespoons unsalted butter",
        "6 white mushrooms (about 1/4 pound), sliced thin",
        "2 tablespoons Cognac or other brandy",
        "2 tablespoons water",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon Worcestershire sauce",
        "1 tablespoon minced fresh parsley leaves",
        "2 filet mignons, each about 1 inch thick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Sauté",
        "Quick & Easy",
        "Steak",
        "Bacon",
        "Brandy",
        "Winter",
        "Anniversary",
        "Gourmet"
    ],
    "title": "Filets Mignons with Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/filets-mignons-with-mushroom-sauce-10050"
}
