{
    "directions": [
        "Stir the avocado, roma tomatoes, minced shallot, jalapeno pepper, and lemon juice in a bowl. Chill in refrigerator to allow flavors to meld.",
        "Place the chicken stock in a small saucepan over medium-low heat; simmer the stock until reduced to about 1/2 cup.",
        "Heat 1/4 cup corn oil in a skillet over medium heat; cook the red bell pepper and yellow bell pepper in the hot oil until tender, 5 to 7 minutes. Stir the mushrooms into the peppers; season with the coriander seeds, sea salt, and black pepper. Add the reduced chicken stock and the water; cook and stir until the moisture has been absorbed, another 5 to 7 minutes. Transfer the mixture to a plate lined with paper towels to allow the grease to drain.",
        "Heat the olive oil in a saucepan over medium heat; cook and stir the sliced shallots in the hot oil until softened, about 3 minutes. Stir in the crushed garlic and cook another 3 minutes. Pour 3 1/2 cups water over the mixture and bring to a boil; cook at a boil until the liquid reduces to 1 cup. Strain the mixture through a fine-mesh strainer and return the strained liquid to the saucepan, keeping it over medium heat. Add the white wine vinegar and return to a boil; continue cooking at a boil until the liquid reduced to about 1/4 cup. Quickly whisk in the chilled butter until just melted, whisking constantly. Remove from the heat and keep warm while you prepare the steaks.",
        "Place a cast-iron skillet over medium-high heat and allow get hot. Heat the oil in the skillet. Cook the steaks in the hot oil until they start to firm, and are reddish-pink and juicy in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Cover the meat with two layers of aluminum foil and allow to rest in a warm area for 10 minutes.",
        "Place a mound of the bell pepper mixture into the center of each serving plate. Slice the rested steaks in half and place atop each mound. Spoon a few spoonfuls of the butter mixture onto the plate to surround the stack. Serve with the chilled guacamole and corn chips."
    ],
    "ingredients": [
        "4 small avocados, peeled and mashed",
        "3 roma (plum) tomatoes, chopped",
        "1 large shallot, minced",
        "1 jalapeno pepper, minced",
        "1/2 lemon, juiced",
        "1 cup low-sodium chicken broth",
        "1/4 cup corn oil",
        "1 red bell pepper, cut into thin strips",
        "1 yellow bell pepper, cut into thin strips",
        "1 (4 ounce) package button mushrooms, sliced thin",
        "1 teaspoon coriander seeds, crushed",
        "1 teaspoon celery seed",
        "1/4 teaspoon freshly cracked black pepper",
        "2 tablespoons water",
        "3 tablespoons corn oil",
        "3 large shallots, sliced",
        "4 cloves garlic, smashed",
        "3 1/2 cups water",
        "2 tablespoons white wine vinegar",
        "1/4 cup cold unsalted butter, cut into 1/2-inch cubes",
        "1/2 teaspoon sea salt",
        "2 tablespoons olive oil",
        "4 (6 ounce) beef tenderloin fillets, room temperature",
        "1 (16 ounce) package corn chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Filet Mignon with Bell Pepper Haystack and Fresh Guacamole Served with Corn Chips",
    "url": "http://allrecipes.com/recipe/185849/filet-mignon-with-bell-pepper-haystac/"
}
