{
    "directions": [
        "Season the filets with salt and pepper. Let stand at room temperature for 20 to 30 minutes.",
        "In a sauté pan over medium-high heat, warm 2 Tbs. of the olive oil until almost smoking. Working in batches if needed (do not overcrowd), cook the filets, turning once, until browned on both sides and an instant-read thermometer inserted into the center of the meat registers 130°F for medium-rare, about 5 minutes per side. Transfer the filets to a warmed platter and cover loosely with aluminum foil.",
        "Reduce the heat to medium and add the bacon to the pan. Cook, stirring frequently, until crisp, 8 to 10 minutes. Using a slotted spoon, transfer to a paper towel-lined plate.",
        "Warm the remaining 2 Tbs. oil in the pan, add the onion and garlic and cook, stirring frequently, until the onion is translucent, about 2 minutes. Add the mushrooms and cook until soft, about 5 minutes. Add the flour and cook, stirring frequently, for 2 minutes. Stir in the stock, Cabernet wine reduction, bacon, thyme and any accumulated meat juices. Simmer until the sauce is slightly thickened, 3 to 5 minutes.",
        "Transfer the filets to individual plates and spoon the sauce over the meat, dividing evenly. Serve immediately. Serves 4.",
        "Williams-Sonoma Kitchen.",
        "*Available at Williams-Sonoma stores."
    ],
    "ingredients": [
        "4 filets mignons, each about 6 oz. and 1 1/4\n inches thick",
        "Salt and freshly ground pepper, to taste",
        "1/4 cup extra-virgin olive oil",
        "3 thick bacon slices, cut into 1-inch dice",
        "1/2 yellow onion, chopped",
        "3 garlic cloves, minced",
        "3/4 lb. cremini mushrooms, stemmed and\n quartered",
        "2 tsp. all-purpose flour",
        "3/4 cup beef stock",
        "1/3 cup Cabernet Sauvignon wine reduction*",
        "1 tsp. minced fresh thyme"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Filets Mignons with Bourguignonne Sauce",
    "url": "http://www.williams-sonoma.com/recipe/filets-mignons-with-bourguignonne-sauce.html"
}
