{
    "directions": [
        "Combine the vinegar, soy sauce, pepper and smashed garlic in a blender and puree until smooth. Pour the mixture into a 12-inch wide, 2 1/4-inch deep nonstick skillet, stir in the bay leaves and submerge the wings in the marinade. Refrigerate for at least 2 hours and up to 6 hours.",
        "Meanwhile, make the Banana Ketchup: Heat the oil in a small saucepan over medium heat. Add the onion and cook, stirring until softened, about 5 minutes. Stir in the ginger, turmeric, allspice, garlic and jalapeno and cook, stirring until fragrant, about 1 minute. Add the tomato paste and cook, stirring until lightly caramelized, about 1 minute. Add the mashed bananas, vinegar, brown sugar, soy sauce and rum, if using, and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Scrape the sauce into a bowl, press a sheet of plastic wrap against the surface and let cool. You should have about 1 cup.",
        "Remove the skillet from the refrigerator and place over high heat. Once the marinade begins to bubble, cook the wings, gently moving them around and flipping occasionally, until cooked through, about 25 minutes. Use tongs to transfer the chicken wings to a bowl and set aside. Stir the onion into the sauce and continue cooking over high heat, stirring occasionally, until the sauce is reduced to a glaze and the onions are soft, 5 to 10 minutes. Pour the glaze and onions over the chicken wings and stir to coat evenly.",
        "Transfer the wings to a serving platter and top with parsley. Serve with banana ketchup on the side."
    ],
    "ingredients": [
        "2 cups white-wine vinegar",
        "2 cups low-sodium soy sauce",
        "2 tablespoons freshly ground black pepper",
        "2 heads garlic, cloves separated, smashed and peeled",
        "12 bay leaves",
        "4 pounds chicken wings, split at the joint, wingtips removed and discarded",
        "1 tablespoon vegetable oil",
        "1/4 cup finely chopped yellow onion",
        "1 1/2 teaspoons minced peeled ginger",
        "1/4 teaspoon ground turmeric",
        "1/8 teaspoon ground allspice",
        "1 clove garlic, minced",
        "1/2 jalapeno, stemmed, seeded and minced",
        "1 1/2 teaspoons tomato paste",
        "2 very ripe bananas, mashed until smooth (about 1 cup)",
        "1/4 cup white wine vinegar",
        "1/4 cup packed light brown sugar",
        "1 tablespoon soy sauce",
        "1 tablespoon dark rum (optional)",
        "1 large yellow onion, thinly sliced",
        "2 tablespoons thinly sliced flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian",
        "Filipino Recipes",
        "Chicken Wing",
        "Chicken",
        "Poultry Recipes",
        "Chile Peppers",
        "Vegetable",
        "Main Dish Recipes",
        "Appetizer"
    ],
    "title": "Filipino Adobo Chicken Wings",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/filipino-adobo-chicken-wings"
}
