{
    "directions": [
        "Preheat oven to 300°F. Bring 4 cups clam juice to simmer in medium saucepan; cover and keep warm. Melt 1/2 tablespoon butter with 1/2 tablespoon oil in heavy large saucepan over medium high heat. Add white onion and sauté until soft, about 3 minutes. Stir in rice. Add 1/4 cup wine; stir until almost all liquid evaporates, about 1 minute. Add 4 cups warm clam juice, 1 cup at a time, cooking until almost all liquid is absorbed between additions and stirring frequently, until rice is tender but still firm to bite and mixture is creamy, about 18 minutes.",
        "Meanwhile, heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Sprinkle salmon with salt and pepper. Add salmon to skillet and cook until brown on both sides but still medium-rare in center, about 3 minutes per side. Transfer to baking sheet and place in oven to keep warm. Add red onion and garlic to same skillet and cook until translucent, stirring often, about 3 minutes. Add remaining 1/2 cup wine. Bring to boil, then add fennel and tomatoes. Cook until fennel is crisp-tender, stirring often, about 3 minutes. Add 1/2 cup clam juice and spinach. Stir until spinach wilts, about 1 minute. Stir in remaining 2 tablespoons butter and 3 teaspoons chopped tarragon. Season to taste with salt and pepper.",
        "Stir remaining 2 teaspoons tarragon and cheese into risotto. Season with salt and pepper. Divide risotto and fennel mixture among plates. Place 1 salmon fillet on each plate; sprinkle with chives."
    ],
    "ingredients": [
        "4 1/2 cups bottled clam juice, divided",
        "2 1/2 tablespoons butter, divided",
        "2 1/2 tablespoons olive oil, divided",
        "1/2 cup chopped white onion",
        "1 cup arborio rice or medium-grain white rice",
        "3/4 cup dry white wine, divided",
        "4 6- to 8-ounce salmon fillets",
        "3/4 cup chopped red onion",
        "2 garlic cloves, minced",
        "2 medium fennel bulbs, trimmed, halved, thinly sliced crosswise",
        "3/4 cup chopped plum tomatoes (about 2 small)",
        "1 1/2 cups (packed) baby spinach leaves",
        "5 teaspoons chopped fresh tarragon, divided",
        "1/2 cup freshly grated Parmesan cheese",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Tomato",
        "Sauté",
        "Parmesan",
        "Salmon",
        "Fennel",
        "Spinach",
        "White Wine",
        "Fall",
        "Healthy"
    ],
    "title": "Fillet of Salmon with Fennel, Tomatoes, and Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/fillet-of-salmon-with-fennel-tomatoes-and-risotto-239837"
}
