{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).  Fit bottom pastry into a 9 inch pie pan. Cover pastry with pie weights or dried beans.",
        "Bake pastry in preheated oven for 7 minutes. Remove pie weights or beans immediately. Set crust aside. Do not turn off oven.",
        "Place a large skillet over medium-high heat. Add vegetable oil, then meat. Toss to coat meat with oil. Saute until meat is browned on all sides, stirring occasionally. Remove from heat and allow to sit at least 3 minutes.",
        "In a medium saucepan, melt butter or margarine over low heat. Add garlic, onion, dill, rosemary, sage, and salt. Cook mixture until onions are translucent. Add milk to pan and turn up heat to medium. When mixture comes to a boil, add 2 to 4 tablespoons of flour, depending on how thick you want the sauce to be. Cook mixture until it thickens, stirring constantly. Remove from heat.",
        "In a large bowl, mix meat with corn and green beans. Spoon mixture into baked pastry shell. Pour sauce over top. Cover with top pastry, sealing edges as best you can without breaking the edges of the bottom crust. Cut steam vents in top.",
        "Bake in preheated oven for 45 minutes, until golden brown."
    ],
    "ingredients": [
        "1 recipe pastry for a 9 inch double crust pie",
        "3 tablespoons vegetable oil",
        "6 pounds beef tenderloin, cubed",
        "1/4 cup butter",
        "2 tablespoons minced garlic",
        "1/2 onion, peeled and minced",
        "1 tablespoon chopped fresh dill weed",
        "1 tablespoon dried rosemary, crushed",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon salt",
        "1 1/2 cups milk",
        "4 tablespoons all-purpose flour",
        "1 (15 ounce) can whole kernel corn, drained",
        "1 (15 ounce) can green beans, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Filling Meat Pie",
    "url": "http://allrecipes.com/recipe/15728/filling-meat-pie/"
}
