{
    "directions": [
        "In a heavy flameproof roasting pan heat the vegetable oil over moderately high heat until it is hot but not smoking and in it brown the beef, patted dry and seasoned with salt and pepper, turning it every 2 minutes, for 10 minutes. Roast the beef in the middle of a preheated 475°F. oven for 12 to 15 minutes, or until a meat thermometer registers 130°F. for medium-rare meat, and let it cool to room temperature. The beef may be roasted 2 days in advance and kept wrapped and chilled. Slice the beef thin.",
        "Brush both sides of each bread slice lightly with some of the olive oil and on baking sheets toast the slices on both sides under a preheated broiler about 3 inches from the heat until they are golden. Rub one side of each crouton with the garlic, spread it with about 1 teaspoon of the sauce, and top the croutons with the beef. Season the beef with salt and pepper, drizzle it with the remaining sauce, and arrange the croutons on a platter garnished with the tarragon sprigs."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "a 3-pound fillet of beef, halved crosswise",
        "2 loaves of Italian bread (each about 14 inches long), cut diagonally  into 1/2-inch slices",
        "about 1/4 cup olive oil for brushing the bread",
        "2 large garlic cloves",
        "about 2 cups Roasted Onion, Caper, and Tarragon Sauce",
        "tarragon sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Garlic",
        "Herb",
        "Roast",
        "Lunch",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fillet of Beef on Garlic Croutons with Roasted Onion, Caper, and Tarragon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fillet-of-beef-on-garlic-croutons-with-roasted-onion-caper-and-tarragon-sauce-13577"
}
