{
    "directions": [
        "Soak raisins in hot tap water to cover until plump, about 20 minutes, then drain.",
        "Meanwhile, stir together warm water, yeast, and a pinch of sugar in a small bowl. Let stand until foamy, about 5 minutes. (If yeast doesn't foam, start over with new yeast.)",
        "Stir together flour, sugar, cardamom, and salt in a large bowl, then blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Stir in milk, whole egg, and yeast mixture with a wooden spoon until a soft dough forms. Turn dough out onto a well-floured surface and knead, dusting surface and hands with just enough flour to keep dough from sticking, until dough is smooth and elastic, 8 to 10 minutes.",
        "Pat dough into a 9-inch square and sprinkle with raisins. Fold dough over to enclose raisins and pinch edges to seal. Knead, dusting surface and hands lightly with flour, until raisins are distributed. (Dough will be lumpy and slightly sticky; if any raisins pop out, just push them back in.) Form dough into a ball.",
        "Put dough in a buttered large bowl and turn to coat. Cover bowl with plastic wrap and a kitchen towel and let dough rise in a draft-free place at warm room temperature until doubled, 2 to 2 1/2 hours.",
        "Punch down dough (do not knead), then halve. Cut each half into thirds and roll each piece into a 15-inch rope. Braid together 3 ropes to form a loaf, then transfer to a parchment-lined large baking sheet, tucking ends under. Make another loaf with remaining 3 ropes, arranging loaves 4 inches apart. Loosely cover with plastic wrap and let rise in a draft-free place at warm room temperature until doubled, 1 to 1 1/2 hours.",
        "Preheat oven to 350°F with rack in middle.",
        "Brush loaves with egg wash and bake until golden brown and bottoms sound hollow when tapped, 40 to 45 minutes. Transfer to a rack to cool."
    ],
    "ingredients": [
        "1 cup raisins",
        "1/4 cup warm water (105-115°F)",
        "1 (1/4-ounce) package active dry yeast (2 1/4 teaspoons)",
        "5 cups all-purpose flour",
        "2/3 cup sugar",
        "1 teaspoon ground cardamom",
        "1 1/4 teaspoons salt",
        "1 1/2 sticks cold unsalted butter, cut into small pieces",
        "1 1/4 cups warm whole milk (105-115°F)",
        "1 large egg, lightly beaten",
        "1 large egg yolk, lightly beaten with",
        "1 tablespoon water, for egg wash"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Egg",
        "Bake",
        "Vegetarian",
        "Raisin",
        "Spice",
        "Gourmet"
    ],
    "title": "Finnish Sweet Cardamom Raisin Bread",
    "url": "http://www.epicurious.com/recipes/food/views/finnish-sweet-cardamom-raisin-bread-239293"
}
