{
    "directions": [
        "Preheat oven to 350°F.",
        "Wash and coarsely chop leeks or onions. Over medium heat, add oil to a skillet and sauté leeks for several minutes, until they are no longer opaque. Add garlic and sauté for another minute. Pour in wine and reduce heat slightly to allow liquid to simmer. Stir occasionally until liquid is nearly gone. Place leeks in a food processor or blender and process to a coarse purée.",
        "Chop cooked shrimp into large dice. Flake poached fish with a fork. In a large bowl mix together tomato purée, cream, leeks, and fish. Taste and add salt and pepper, if desired. Stir in whole eggs and yolks. Add shrimp.",
        "In a separate bowl, beat egg whites until stiff peaks form, and fold into fish mixture, adding one-third or half of the whites at a time.",
        "Grease a baking pan or mold and scatter or press bread crumbs along bottom. Pour fish mixture over bread crumbs. Bake in a hot water bath or bain marie for 40 minutes. Remove from oven and let sit for 5 to 10 minutes. Slide a knife along the sides to loosen terrine from mold. Place a plate on top and invert to coax the preparation to fall away from the mold.",
        "Whisk mayonnaise, adding ketchup and mustard until all ingredients are blended. Stir in the piment d'Espelette and Armagnac or brandy. Spoon a bit of sauce over each serving of fish terrine.",
        "While the shrimp adds texture and interest to the final terrine, for those allergic to shrimp, this can be omitted without any loss of flavor.",
        "When placing the filled mold into the hot water bath in the oven, I find it is easiest and safest to first place the empty outer pan onto the oven rack, then place the filled mold into the pan, and lastly, carefully pour hot water into the outer pan until it reaches about halfway up the sides of the fish mold.",
        "On occasion, to avoid the extra steps of preparing the mold and the water bath, I have baked the terrine mixture in a pie crust, at the same oven temperature, until the crust is golden and the center is no longer liquid."
    ],
    "ingredients": [
        "3 to 4 medium leeks or 2 medium onions",
        "Olive oil",
        "2 cloves garlic, minced",
        "1/2 cup white wine",
        "1/2 pound shrimp, lightly cooked (poached)",
        "2 pounds hake or similar white fleshed fish, poached",
        "1 cup tomato purée",
        "1 cup heavy cream",
        "Salt and pepper (optional)",
        "3 whole eggs",
        "2 eggs, separated",
        "1/4 cup dry bread crumbs",
        "1/4 cup mayonnaise",
        "1/4 cup ketchup",
        "2 tablespoons mustard",
        "Pinch of piment d'Espelette, or cayenne powder",
        "1 tablespoon Armagnac or brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Fish",
        "Mustard",
        "Tomato",
        "Appetizer",
        "Bake",
        "Mayonnaise",
        "Shrimp",
        "Leek",
        "White Wine",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fish Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/fish-terrine-109502"
}
