{
    "directions": [
        "For the saffron tartar sauce: Bring the vinegar to a simmer in a small saucepan, add the saffron, remove from the heat and let steep for 5 minutes. Transfer to a small bowl and refrigerate until cool, about 10 minutes.",
        "Put the mayonnaise in a medium bowl and whisk in the onion, mustard, capers, cornichons, lemon zest, lemon juice and the cooled saffron vinegar mixture. Stir until combined and season with salt and pepper. Cover and refrigerate for at least 30 minutes and up to 8 hours to allow the flavors to meld. Stir in the parsley just before serving.",
        "For the sherry vinegar tartar sauce and chips: Whisk together the vinegar and mustard in a small bowl and season with salt and pepper. Slowly whisk in the olive oil until emulsified and stir in the tarragon. Let sit at room temperature for at least 15 minutes and up to 60 minutes before serving to allow the flavors to meld.",
        "Set a baking rack over a baking sheet and set aside. Heat the vegetable oil in a deep fryer or medium Dutch oven over medium heat until it registers 325 degrees F.",
        "Fry the potatoes, in batches, until pale golden blonde and slightly soft, about 5 minutes. Remove with a slotted spoon to the prepared baking sheet. Repeat with the remaining potatoes. Increase the heat of the oil to 365 degrees F.",
        "Fry the potatoes again, in batches, until golden brown and crispy, about 2 minutes. Drain on a plate lined with paper towels, and season immediately with more salt and the smoked paprika. Reserve the oil for frying the fish.",
        "For the fried parsley leaves: If desired for serving, fry the parsley leaves in the oil until crisp, about 30 seconds. Drain on a plate lined with a paper towel, season with salt and set aside for serving.",
        "For the fried fish: Add more oil to the the deep fryer or Dutch oven if necessary and heat to 365 degrees F. Set a baking rack over a baking sheet and set aside.",
        "Whisk together the beer, rice flour, breadcrumbs and salt and pepper until smooth, adding more beer if needed. The batter should be just thick enough to coat the back of a spoon.",
        "Whisk together the flour, cayenne and some salt and pepper on a plate. Season the halibut on both sides with salt and pepper, dredge in the seasoned flour and tap off the excess.",
        "Dip the fish in the batter and let the excess run off. Fry the fish in batches, until golden brown on both sides and cooked through, about 5 minutes. Transfer to the prepared baking sheet and season with salt. Serve with the saffron tartar sauce, sherry vinegar and tartar sauce and chips. Garnish with the fried parsley, if desired."
    ],
    "ingredients": [
        "1/4 cup white wine vinegar",
        "Pinch of saffron",
        "1 1/2 cups prepared mayonnaise",
        "1/2 small red onion, finely diced",
        "2 heaping tablespoons Dijon mustard",
        "2 tablespoons capers, drained and chopped",
        "6 cornichons, drained and finely diced",
        "Finely grated zest of 1 lemon and juice of 1/2 lemon",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup chopped fresh flat leaf parsley",
        "1/4 cup aged sherry vinegar",
        "1 tablespoon Dijon mustard",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup extra virgin olive oil",
        "2 tablespoons finely chopped fresh tarragon",
        "1 quart vegetable or canola oil",
        "4 large Russet or Idaho potatoes, skin on, cut into eight wedges",
        "1 teaspoon smoked paprika",
        "1 cup loosely packed parsley leaves, clean and completely dry",
        "Kosher salt",
        "Canola oil for frying, if necessary",
        "1 1/2 cups beer, such as Stella Artois, plus more if needed",
        "1 1/2 cups rice flour",
        "1/4 cup panko breadcrumbs",
        "Kosher salt and freshly ground black pepper",
        "1 cup all-purpose flour",
        "1/2 teaspoon cayenne pepper",
        "Six 6-ounce halibut fillets",
        "1 cup parsley leaves, optional, clean and completely dry",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fish",
        "Halibut Recipes",
        "Potato",
        "Vegetable",
        "Onion Recipes",
        "Main Dish Recipes",
        "Deep-Frying"
    ],
    "title": "Fish and Chips",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/fish-and-chips"
}
