{
    "directions": [
        "Put the onion in a small bowl and pour in enough red wine vinegar to cover well. Set aside for at least 30 minutes or up to several weeks.",
        "Pour the olive oil into a small bowl and add the ancho chile powder, oregano, cumin, chopped cilantro, and jalapeño. Mix well. Place the fish on a dish and pour the marinade over it, making sure to coat the fish well on both sides. Allow to marinate for 20 minutes.",
        "Heat a nonstick sauté pan over medium-high heat. Remove the fish from the marinade and place in the hot pan (there is no need to add more oil). Season the fish with salt. Cook the fish for 4 minutes undisturbed, then turn over, and cook for another 2 minutes. Remove the pan from the heat and flake the fish into the pan with a fork, making sure to mix in all the marinade that has stuck to the bottom of the pan. Check for seasoning and add more salt if necessary. Set aside.",
        "Place four of the tortillas on a plate and sandwich them between two slightly dampened sheets of paper towel. Microwave on high for 45 seconds. Place the warm tortillas in a towel-lined basket or plate and cover. Repeat with the remaining tortillas.",
        "To assemble the tacos, place a heaping spoonful of the marinated flaked fish onto the center of a tortilla. Top with the marinated onions. Serve accompanied by Mexican crema and salsa.",
        "Garnish with lime wedges and cilantro sprigs."
    ],
    "ingredients": [
        "1/2 red onion, thinly sliced",
        "About 1 1/2 cups red wine vinegar",
        "1/4 cup olive oil",
        "1 1/2 teaspoons ancho chile powder",
        "1 1/2 teaspoons dried oregano",
        "1/2 teaspoon ground cumin",
        "1/4 cup lightly packed fresh cilantro leaves, chopped, plus more for garnish",
        "1 jalapeño, stemmed and chopped",
        "1 pound flaky white fish (such as mahi mahi or cod), cut into 4 pieces",
        "Salt",
        "8 fresh corn tortillas",
        "Mexican crema, homemade or store-bought",
        "Fresh Tomato Salsa",
        "2 limes, cut into quarters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Marinate",
        "Sauté",
        "Super Bowl",
        "Cinco de Mayo",
        "Backyard BBQ",
        "Seafood",
        "Cod",
        "Summer",
        "Tailgating",
        "Family Reunion",
        "Party",
        "Tortillas"
    ],
    "title": "Fish Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/fish-tacos-352976"
}
