{
    "directions": [
        "Sprinkle fish with salt and pepper. Coat with flour. Heat 3/4 cup oil in heavy large skillet over high heat. Sauté fish in batches until golden brown, about 5 minutes per side. Transfer to paper towels to drain. Discard oil; wipe out skillet.",
        "Heat remaining 3/4 cup oil in same skillet over medium-high heat. Add onions and crushed red pepper. Sauté until onions are tender, about 4 minutes. Add garlic and dried rosemary; sauté 1 minute. Carefully add wine and tomato juice; simmer 2 minutes. Add chopped tomatoes and vinegar; simmer until sauce thickens slightly, about 8 minutes. Add fish; simmer until opaque in center, turning fish once, about 2 minutes. Arrange fish in single layer in 13x9x2-inch baking dish. Season sauce with salt and pepper; pour over fish. Cover and refrigerate at least 1 day and up to 2 days, turning fish once. Arrange fish and sauce on platter. Bring to room temperature. Garnish with rosemary and tomato halves, if desired."
    ],
    "ingredients": [
        "4 8-ounce red snapper fillets, each cut crosswise in half",
        "All purpose flour",
        "1 1/2 cups olive oil",
        "1 1/2 medium onions, thinly sliced",
        "1 1/2 teaspoons dried crushed red pepper",
        "8 garlic cloves, thinly sliced",
        "1 1/2 tablespoons dried rosemary",
        "1/2 cup sweet white wine (such as Muscat)",
        "3 tablespoons tomato juice",
        "1 1/2 cups chopped plum tomatoes",
        "1/2 cup plus 1 1/2 tablespoons red wine vinegar",
        "Fresh rosemary sprigs (optional)",
        "Cherry tomatoes, halved (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Marinate",
        "Sauté",
        "Rosemary",
        "Snapper",
        "Summer"
    ],
    "title": "Fish Marinated with Vinegar, Sweet Wine, Tomato, and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/fish-marinated-with-vinegar-sweet-wine-tomato-and-rosemary-106466"
}
