{
    "directions": [
        "Add enough water to large deep skillet to reach depth of 1 1/2 inches. Add unpeeled garlic cloves and bring water to simmer. Sprinkle fish with salt; add to skillet. Poach fish gently until just opaque in center, about 10 minutes. Transfer fish to plate; cool. Flake fish coarsely; discard skin. Peel and mince cooked garlic.",
        "Heat 2 tablespoons oil in large skillet over medium-high heat. Add bell peppers and sauté until beginning to soften, about 4 minutes. Add preserved lemon peel, tomato paste, paprika, ginger, cumin, black pepper, turmeric, and minced garlic. Sauté 5 minutes to blend flavors. Remove from heat; mix in cilantro, parsley, harissa, and remaining 3 tablespoons oil. Cool mixture. Gently stir in flaked fish.",
        "Cook rice noodles in large saucepan of boiling salted water until just tender, stirring occasionally, about 5 minutes. Drain; rinse under cold water to chill quickly. Cut noodles into 1-inch pieces. Stir noodles into fish mixture and season filling to taste with salt.",
        "Line 2 large rimmed baking sheets with parchment paper. Place 8-inch plate on work surface. Place 1 phyllo sheet over plate, centering plate underneath. Fold another phyllo sheet in half, brush with butter, then fold in half again and place in center of phyllo over plate. Mound 1 cup fish filling on folded phyllo; shape filling into 5-inch-diameter round. Fold 1 corner of phyllo sheet over filling. Continue to lift and fold edges of phyllo sheet over filling at 6-inch intervals, brushing each fold with melted butter and covering filling completely. Turn b'stilla onto parchment-lined baking sheet, seam side down. Brush all over with more butter.",
        "Repeat with remaining phyllo and filling, making 6 b'stillas total. DO AHEAD: Can be made 6 hours ahead. Refrigerate.",
        "Preheat oven to 400°F. Bake b'stillas until heated and pastry is golden brown, reversing sheets after 12 minutes, 18 to 20 minutes. Transfer to platter."
    ],
    "ingredients": [
        "2 large garlic cloves, unpeeled",
        "1 (1-pound) black cod fillet with skin",
        "5 tablespoons olive oil, divided",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "1 preserved lemon,* flesh scraped out and discarded, peel chopped",
        "2 tablespoons tomato paste",
        "2 teaspoons Hungarian sweet paprika",
        "2 teaspoons ground ginger",
        "2 teaspoons ground cumin",
        "1 teaspoon coarsely ground black pepper",
        "1/8 teaspoon turmeric",
        "1/4 cup chopped fresh cilantro",
        "1/4 cup chopped fresh Italian parsley",
        "1 tablespoon harissa sauce**",
        "1 bundle rice stick noodles (maifun; half of 6- to 7-ounce package)***",
        "12 (18x12-inch) sheets phyllo pastry, thawed if frozen",
        "Melted butter",
        "*Lemons that have been soaked in salt and lemon juice for several weeks; available at specialty foods stores and Middle Eastern markets, and from igourmet.com.",
        "** A spicy North African red chile paste; available at specialty foods stores and at Middle Eastern markets.",
        "*** Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Tomato",
        "Vegetable",
        "Bake",
        "Dinner",
        "Lemon",
        "Seafood",
        "Cod",
        "Bell Pepper",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fish and Vegetable B'stillas",
    "url": "http://www.epicurious.com/recipes/food/views/fish-and-vegetable-bstillas-242143"
}
