{
    "directions": [
        "Preheat the oven to 400 degrees.",
        "In a large sauté pan, heat 1 tablespoon of the olive oil and the butter over medium-high heat. When the butter foams, add the onions, stirring to coat, and season with salt and pepper. Cook for 8 to 12 minutes, stirring occasionally, until golden. Let cool.",
        "Stack two pieces of aluminum foil that are large enough to wrap the fish in on top of one another. Fold up the sides of the foil so that it resembles a little boat. Pour the remaining 2 tablespoons olive oil into the boat and spread it over the bottom. Lay the potatoes in the boat in one layer, and season with salt and pepper.",
        "With a sharp knife, make slashes in one side of the fish about 1 1/2 inches apart, going almost to the bone, and season with salt and pepper. Repeat on the other side of the fish. Lay it on top of the potatoes. Spoon the mojo verde on top of the fish. Lay the tomatoes on top of it and spoon the rest of the mojo on them. Spoon on the caramelized onions. Pour the wine around the fish.",
        "Fold the foil over to enclose the fish, crimping the edges to seal and set on a baking sheet.",
        "Roast the fish for about 1 hour, or until cooked through (carefully open the foil to check: the fish should flake easily when tested with a fork); cooking times can vary significantly depending on the thickness and type of fish. (The baked fish can be kept warm, and still retain its moisture, for up to 30 minutes if kept wrapped.)",
        "Serve with lemon wedges and, if you like, extra mojo verde on the side.",
        "Recommended wine: A wine with soft acidity and sweetness, such as a Vouvray or an American Pinot Blanc."
    ],
    "ingredients": [
        "3 tablespoons pure olive oil",
        "2 tablespoons unsalted butter",
        "2 medium red onions, sliced",
        "Kosher salt and freshly ground black pepper to taste",
        "1 pound medium red potatoes, scrubbed and cut into 1/4-inch-thick slices",
        "One 4-pound snapper, gutted, scaled, and pectoral gill cut out (but tail left on; ask your fishmonger to do this)",
        "1/4 cup Mojo Verde , plus extra for serving if desired",
        "1 pound ripe tomatoes, sliced",
        "1/4 cup dry white wine",
        "Lemon wedges for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Onion",
        "Potato",
        "Tomato",
        "Roast",
        "Snapper",
        "White Wine",
        "Healthy"
    ],
    "title": "Fish in Foil with Sweet Onions, Tomatoes, and Mojo Verde",
    "url": "http://www.epicurious.com/recipes/food/views/fish-in-foil-with-sweet-onions-tomatoes-and-mojo-verde-108200"
}
