{
    "directions": [
        "Purée cucumber, tomato, curry powder, and salt in a blender until smooth, about 30 seconds.",
        "Line a fine-mesh sieve with a dampened paper towel and set over a large glass measure, then transfer cucumber mixture to sieve and let drain until liquid measures 2/3 cup, about 20 minutes.",
        "If liquid measures less than 2/3 cup, gently squeeze paper towel over sieve until liquid totals 2/3 cup. Discard solids and transfer liquid to a 2- to 3-quart saucepan.",
        "Boil cucumber tomato water until reduced to about 1/3 cup, then remove from heat and cool to room temperature, about 30 minutes.",
        "Cut peel, including all white pith, from lemon with a sharp paring knife. Working over a bowl, cut segments free from membranes, letting segments fall into bowl, then chop segments, reserving juice in a cup.",
        "Gently toss lemon segments and reserved juice with remaining salad ingredients in a large bowl. Stir in cooled cucumber tomato water.",
        "Put oven rack in middle position and preheat oven to 500°F.",
        "Rinse fish and pat dry. Brush fillets all over with oil and season with salt and pepper.",
        "Bake fillets in 1 layer in a lightly oiled shallow baking pan until just cooked through, 4 to 8 minutes, depending on thickness of fillets.",
        "Serve tomato herb salad on top of fish."
    ],
    "ingredients": [
        "1 (1/2-lb) cucumber, peeled and chopped (1 1/2 cups)",
        "1 (1/4-lb) tomato, chopped (3/4 cup)",
        "1/4 teaspoon curry powder (preferably Madras)",
        "1/4 teaspoon salt",
        "1 lemon",
        "1 lb assorted small heirloom tomatoes, halved (larger ones quartered)",
        "1/4 cup loosely packed fresh parsley leaves",
        "2 tablespoons thinly sliced fresh basil",
        "1 tablespoon extra-virgin olive oil",
        "2 teaspoons finely chopped fresh chives",
        "1 teaspoon finely chopped fresh lemon balm (optional)",
        "1/4 teaspoon black pepper",
        "1/4 to 1/2 teaspoon sugar (to taste)",
        "1/4 teaspoon salt",
        "6 (5- to 7-oz) mild white-fleshed fish fillets such as flounder, sea bass, or snapper",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Tomato",
        "Vegetable",
        "Bake",
        "Seafood",
        "Bass",
        "Snapper",
        "Curry",
        "Cucumber",
        "Summer",
        "Healthy",
        "Gourmet"
    ],
    "title": "Fish with Curried Cucumber Tomato Water and Tomato Herb Salad",
    "url": "http://www.epicurious.com/recipes/food/views/fish-with-curried-cucumber-tomato-water-and-tomato-herb-salad-232307"
}
