{
    "directions": [
        "Place onion and jalapeños in heatproof medium bowl. Mix vinegar, lime juice, and salt in small saucepan. Bring just to boil, stirring until salt dissolves. Pour over onion and jalapeños. Let stand at room temperature at least 1 hour and up to 8 hours. (Can be made 1 week ahead. Cover and refrigerate.)",
        "Whisk all ingredients in small bowl. (Can be made 3 days ahead. Cover and refrigerate.)",
        "Preheat oven to 375°F. Lightly oil roasting pan. Char half of tomatillos, white parts of green onions, and jalapeño directly over gas flame or in broiler. Transfer charred vegetables to prepared roasting pan. Add remaining tomatillos and garlic cloves to pan. Roast until all vegetables are soft, about 12 minutes. Cool.",
        "Stem and seed jalapeño. Place all roasted vegetables, green onion tops, cilantro, and 1 tablespoon lime juice in blender. Puree until smooth, stopping to push vegetables down into blades several times. Transfer to medium bowl. Season with salt and more lime juice, if desired.",
        "Mix buttermilk, cilantro, pepper sauce, 1 teaspoon salt, and lime juice in large bowl. Add fish; toss. Cover; chill at least 1 hour and up to 3 hours.",
        "Preheat oven to 300°F. Wrap tortillas in foil; place in oven to warm. Whisk flour and remaining 2 teaspoons salt in medium bowl. Add enough oil to large skillet to reach depth of 1 inch. Heat oil until thermometer registers 350°F. Working in batches, remove fish from marinade and dredge in flour. Carefully add fish to skillet, cover partially, and fry until golden brown, turning occasionally, about 4 minutes. Transfer to paper-towel-lined baking sheet to drain, then transfer to oven to keep warm.",
        "Set up buffet with all taco fixings, along with fresh salsa and guacamole.",
        "*Green and tomato-like with a papery husk, tomatillos are available in the produce section of some supermarkets and Latin markets."
    ],
    "ingredients": [
        "1 red onion (about 12 ounces), halved lengthwise, cut thinly crosswise",
        "5 whole small jalapeños",
        "2 cups seasoned rice vinegar",
        "3 tablespoons fresh lime juice",
        "1 tablespoon coarse kosher salt",
        "1/2 cup mayonnaise",
        "1/2 cup sour cream",
        "2 tablespoons fresh lime juice",
        "1 teaspoon (packed) finely grated lime peel",
        "Pinch of salt",
        "12 ounces tomatillos,* husked, stemmed, divided",
        "4 green onions, white and green parts separated",
        "1 jalapeño chile",
        "2 garlic cloves, unpeeled",
        "1 1/4 cups (packed) fresh cilantro leaves",
        "1 tablespoon (or more) fresh lime juice",
        "2 cups buttermilk",
        "1/2 cup chopped fresh cilantro",
        "3 tablespoons hot pepper sauce",
        "3 teaspoons coarse kosher salt, divided",
        "1 tablespoon fresh lime juice",
        "2 pounds skinless halibut, sea bass, or striped bass fillets, cut into 1/2x1/2-inch strips",
        "16 corn tortillas",
        "2 cups self-rising flour",
        "Vegetable oil (for frying)",
        "Fresh salsa",
        "Guacamole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Pepper",
        "Fry",
        "Cinco de Mayo",
        "Dinner",
        "Lunch",
        "Mayonnaise",
        "Avocado",
        "Spring",
        "Summer",
        "Family Reunion",
        "Pan-Fry",
        "Tomatillo",
        "Jalapeño",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fish Taco Platter",
    "url": "http://www.epicurious.com/recipes/food/views/fish-taco-platter-233703"
}
