{
    "directions": [
        "Whisk egg yolk and 1 tablespoon vinegar in a small bowl. Whisking constantly, slowly drizzle in oil, drop by drop at first, until mayonnaise is thickened and smooth. Add remaining 1 tablespoon vinegar; season with salt and pepper. Cover and chill.",
        "DO AHEAD: Mayonnaise can be made 1 day ahead. Keep chilled.",
        "Fit a large pot with thermometer; pour in oil to measure 3\". Heat over medium-high heat until thermometer registers 375°F.",
        "Meanwhile, whisk all-purpose flour, baking powder, baking soda, 1 teaspoon kosher salt, and 1/2 teaspoon pepper in a large bowl. Whisking constantly, slowly add beer, club soda, and vinegar, adding more beer if batter is too thick (it should be the consistency of thin pancake batter).",
        "Place corn flour in a shallow bowl. Season fish with kosher salt and pepper. Dredge fish in corn flour, shaking off excess, then dip in batter, letting excess drip back into bowl. Working in batches and returning oil to 375°F between batches, fry fish until golden brown and crisp, about 2 minutes per side. Transfer to paper towel-lined baking sheet.",
        "Season fish and fries with Old Bay, sea salt, and dill; serve with malt vinegar mayonnaise and lemon wedges."
    ],
    "ingredients": [
        "1 large egg yolk",
        "2 tablespoons malt vinegar, divided",
        "1 cup vegetable oil",
        "Kosher salt, freshly ground pepper",
        "Vegetable oil (for frying; about 4 cups)",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt plus more",
        "1/2 teaspoon freshly ground black pepper plus more",
        "12 ounces (or more) chilled light lager",
        "1 cup chilled club soda",
        "1 tablespoon malt vinegar",
        "1 cup corn flour or all-purpose flour",
        "1 1/2 pounds cod, haddock or pollack, cut into long, 1 1/2\"-wide strips",
        "French fries (for serving)",
        "Old Bay seasoning, flaky sea salt (such as Maldon), and chopped fresh dill",
        "Lemon wedges (for serving)",
        "Special equipment: A deep-fry thermometer",
        "Ingredient info: Corn flour, which is more finely ground than cornmeal, is available at Latin markets, natural foods stores, and bobsredmill.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fry",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Cod",
        "Deep-Fry",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fish and Chips with Malt Vinegar Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/fish-and-chips-with-malt-vinegar-mayonnaise-51187310"
}
