{
    "directions": [
        "If using fresh yuca, remove peel and pink flesh using a vegetable peeler. Cover fresh or frozen yuca with salted cold water in a 3- to 4-quart saucepan. Bring to a boil, then simmer, covered, until yuca begins to split, 15 to 20 minutes. Transfer yuca with a slotted spoon to a cutting board, reserving water in pan. Cut into 1-inch wedges, pulling out and discarding tough core. Return yuca to cooking water and simmer, covered, until tender and completely translucent, 15 to 25 minutes more.",
        "Cover onion with boiling-hot water in a heatproof bowl and let stand 15 minutes. Drain onion and return to bowl. Add lime juice and salt, tossing to coat, and let stand at least 5 minutes before serving.",
        "Bring water, tomatoes, cilantro, cumin, and 3/4 teaspoon salt to a boil in a 3- to 4-quart heavy saucepan. Reduce heat and simmer, covered, 5 minutes. Toss fish with remaining 3/4 teaspoon salt and stir into broth. Cook, uncovered, over moderate heat, stirring occasionally, until fish is just cooked through, 3 to 5 minutes. 3Drain yuca and divide among 4 large soup bowls. Ladle fish stew over yuca and top with some of pickled onions."
    ],
    "ingredients": [
        "1 1/2 lb fresh or frozen yuca (1 large), cut crosswise into 2-inch sections for pickled onions",
        "1 medium red onion, halved lengthwise, then thinly sliced",
        "1/4 cup fresh lime juice",
        "1/2 teaspoon salt",
        "3 cups water",
        "1 lb tomatoes, coarsely chopped",
        "1 tablespoon chopped fresh cilantro",
        "1 teaspoon ground cumin",
        "1 1/2 teaspoons salt",
        "2 lb skinless tuna, bluefish, or mackerel fillets, cut into 1-inch pieces",
        "Accompaniment: lime wedges",
        "Garnish: chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Herb",
        "Onion",
        "Tomato",
        "Gourmet"
    ],
    "title": "Fish and Yuca Stew with Pickled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/fish-and-yuca-stew-with-pickled-onions-237191"
}
