{
    "directions": [
        "1. In a medium-size bowl, mix the marinade ingredients together. Cut the halibut into 1 1/2-inch-long pieces. Add the fish to the marinade and toss well. Set aside for 30 minutes.",
        "2. Bring a large pot of water to a boil. Meanwhile, in a blender, blend the pineapple sauce ingredients until smooth.",
        "3. When the water is boiling, add the vermicelli and stir. Cook until the noodles are soft but not mushy, 1 to 2 minutes. (Or just soak the noodles in a bowl of hot water for 4 to 5 minutes.) Drain well and divide among 4 plates; set aside.",
        "4. Heat a large sauté pan over high heat. When the pan is hot, add half the marinated fish and reduce heat to medium. Cook until the fish starts to brown, 30 seconds to 1 minute. Carefully turn the fish pieces over, then cook for about 20 seconds more. Add half the dill and scallions and sauté for about 20 seconds, or until the scallions are wilted.",
        "5. Divide the cooked fish, scallions, and dill over 2 of the plates of noodles.",
        "6. Repeat the cooking process with the remaining fish, scallions, and dill, then divide them over the remaining two plates.",
        "7. Drizzle 1 to 2 tablespoons of the pineapple sauce over the fish and noodles. Sprinkle with the roasted peanuts and serve immediately. Pass the extra pineapple sauce at the table."
    ],
    "ingredients": [
        "1 1/2 pounds halibut fillets",
        "8 ounces rice vermicelli noodles",
        "1 cup fresh dill, leaves picked from stems",
        "1 cup finely sliced scallions",
        "4 tablespoons chopped roasted peanuts",
        "1/2 cup canola oil",
        "2 tablespoons fish sauce (nam pla)",
        "1 teaspoon ground turmeric",
        "1/2 cup cubed fresh pineapple",
        "2 garlic cloves",
        "1 Thai chile",
        "2 teaspoons fresh lime juice",
        "1 tablespoon sugar",
        "1/2 cup fish sauce (nam pla)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Marinate",
        "Sauté",
        "Kid-Friendly",
        "Lunch",
        "Pineapple",
        "Peanut",
        "Halibut",
        "Noodle",
        "Dill",
        "Cookie",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fish Vermicelli with Fresh Dill and Pineapple Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fish-vermicelli-with-fresh-dill-and-pineapple-sauce-239756"
}
