{
    "directions": [
        "Sprinkle the shallot into a buttered shallow baking dish just large enough to hold the fish fillets in one layer, on the shallot arrange the fillets, skin sides down, and pour the wine and the clam juice over them. Sprinkle the fillets with salt and pepper to taste and bake them, covered with a buttered piece of wax paper, in the middle of a preheated 425°F. oven for 10 to 12 minutes, or until they are just cooked through. Transfer the fillets with a slotted spatula to a platter and keep them warm, covered.",
        "Strain the cooking liquid through a fine sieve into a small saucepan, add the grapefruit juice, and boil the mixture until it is reduced to about 2/3 cup. Add the cream and boil the mixture until it is reduced by half. Reduce the heat to low and whisk in the butter, 1 bit at a time, lifting the pan from the heat occasionally to let the mixture cool and adding each new bit of butter before the previous one has melted completely. (The sauce should not get hot enough to liquefy. It should be the consistency of thin hollandaise.) Whisk in the tarragon and salt and pepper to taste. With the slotted spatula transfer each fillet, skin side down, to a plate. Pour one fourth of the sauce over each fillet and arrange some of the grapefruit sections around each plate."
    ],
    "ingredients": [
        "1/4 cup minced shallot",
        "four 6- to 8-ounce white fish fillets such as red snapper or scrod",
        "1/4 cup plus 2 tablespoons dry white wine",
        "1/4 cup plus 2 tablespoons bottled clam juice",
        "2/3 cup fresh grapefruit juice",
        "1/4 cup heavy cream",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 teaspoons minced fresh tarragon leaves or 1/4 teaspoon crumbled dried, or to taste",
        "fresh grapefruit sections as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Bake",
        "Grapefruit",
        "White Wine",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Fish Fillets with Grapefruit Tarragon Beurre Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/fish-fillets-with-grapefruit-tarragon-beurre-blanc-11744"
}
