{
    "directions": [
        "Place four 14x12\" sheets of parchment paper, or heavy-duty foil if grilling, on a work surface. Divide squash among parchment sheets, arranging on one side of sheet in thin layers. Sprinkle shallots and sliced basil over, dividing equally. Scatter tomato halves around squash. Drizzle each packet with 1 tablespoons wine and 1/2 tablespoon oil (add 1/2 tablespoon water to each if grilling). Season with salt and pepper. Place a fish fillet atop each portion. Season with salt and pepper; drizzle 1/2 tablespoon oil over each.",
        "Fold parchment over mixture and crimp edges tightly to form a sealed packet. DO AHEAD: Can be made 4 hours ahead. Chill. Let stand at room temperature for 15 minutes before continuing.",
        "Preheat oven to 400°F. Place packets in a single layer on a large rimmed baking sheet. Alternatively, build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Bake or grill fish until just cooked through (a toothpick poked through the parchment will slide through fish easily), about 10 minutes. Carefully cut open packets (steam will escape). Garnish with basil leaves."
    ],
    "ingredients": [
        "2 cups very thinly sliced assorted summer squash (such as zucchini, yellow crookneck, and pattypan)",
        "1/4 cup thinly sliced shallots",
        "1/4 cup thinly sliced fresh basil, divided, plus 1/4 cup basil leaves",
        "20 cherry tomatoes, halved",
        "4 tablespoons dry white wine",
        "4 tablespoons extra-virgin olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "4 6-ounce skinless white flaky fish fillets (such as Atlantic cod or halibut)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Bake",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Basil",
        "Squash",
        "Zucchini",
        "Summer",
        "Healthy",
        "Yellow Squash",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fish Fillets with Tomatoes, Squash, and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/fish-fillets-with-tomatoes-squash-and-basil-395933"
}
