{
    "directions": [
        "Wash green and white parts of leek separately in a bowl of cold water, then lift out with a slotted spoon and pat dry. Heat 3 tablespoons oil in a 6-quart heavy pot over moderate heat until hot but not smoking, then cook leek greens, onion, celery, and carrots, stirring, until beginning to soften, about 5 minutes. Add garlic and cook, stirring, 3 minutes. Add saffron, bay leaves, and red pepper flakes and cook, stirring, 2 minutes. Add fresh tomatoes and tomato purée and cook, stirring, 4 minutes. Add wine and simmer, uncovered, until liquid is reduced by about half, about 30 minutes.",
        "Stir in stock and bring to a boil. Reduce heat and simmer, uncovered, 30 minutes. Carefully pour through a fine sieve into a bowl, then discard solids.",
        "Preheat oven to 300°F.",
        "Heat a well-seasoned ridged grill pan over moderately high heat until hot. Brush bread with remaining 2 tablespoons oil, then grill on all sides until grill marks appear. Tear bread into rough 3-inch pieces and bake on a baking sheet in middle of oven until crisp outside but soft inside, about 10 minutes. Cool croûtes.",
        "Heat butter in a 4-quart heavy saucepan over moderate heat until foam subsides, then cook white part of leek, stirring, until beginning to soften, about 2 minutes. Add fish, hot broth, and salt and bring to a simmer (fish will be cooked through). Remove from heat and stir in 1/2 cup rouille.",
        "Put croûtes in soup plates and ladle soup over. Sprinkle with oregano and parsley and serve remaining rouille on the side."
    ],
    "ingredients": [
        "1 large leek, green part coarsely chopped and white part cut into 1/4-inch pieces",
        "5 tablespoons olive oil",
        "1 medium onion, coarsely chopped",
        "2 celery ribs, coarsely chopped",
        "2 carrots, coarsely chopped",
        "3 garlic cloves, smashed",
        "1/4 teaspoon crumbled saffron threads",
        "2 bay leaves (not California)",
        "1 teaspoon dried hot red pepper flakes",
        "1 1/4 lb plum tomatoes, coarsely chopped",
        "3 tablespoons canned tomato purée",
        "2 cups dry white wine",
        "1 1/2 qt white fish stock",
        "1 (8- to 9-inch) unsliced round or oval pain au levain or sourdough loaf (1 lb), crust discarded",
        "2 tablespoons unsalted butter",
        "1 lb skinned white fish fillets such as halibut, snapper, and/or bass, cut into 1-inch cubes",
        "1 teaspoon salt",
        "2 cups rouille",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Onion",
        "Tomato",
        "Saffron",
        "Celery",
        "Carrot",
        "White Wine",
        "Winter",
        "Grill/Barbecue",
        "Simmer",
        "Gourmet"
    ],
    "title": "Fish Soup with Bread and Rouille",
    "url": "http://www.epicurious.com/recipes/food/views/fish-soup-with-bread-and-rouille-105642"
}
