{
    "directions": [
        "Heat oil in large pot over medium heat. Add onion and fennel. Sauté until onion is translucent, 8 minutes. Add stock, parsley and peel. Bring to boil. Reduce heat; cover and simmer until fennel is tender, about 5 minutes. Add tomatoes, sliced potatoes, quartered potato and saffron. Cover partially; simmer until potatoes are tender, about 12 minutes. Remove from heat.",
        "Remove quartered potato from soup. Cool slightly. Peel potato; transfer to processor.",
        "Char bell pepper over gas flame or in broiler until blackened on all sides. Enclose pepper in paper bag 10 minutes. Peel and seed pepper. Cool.",
        "Transfer bell pepper to processor with potato. Add 2 tablespoons oil and garlic. Process until smooth. With machine running, gradually blend in 4 tablespoons oil. Season with salt.",
        "Preheat broiler. Arrange bread rounds on baking sheet. Broil until crisp, about 2 minutes. (Can be made 1 day ahead. Cover soup and rouille separately; chill. Cool toasts, then store airtight at room temperature. Bring soup to simmer before continuing.)",
        "Add fish to soup. Simmer until fish is just opaque in center, 5 minutes. Spoon rouille onto 12 to 16 toasts. Ladle soup into bowls. Top each with 2 toasts. Pass remaining toasts and rouille."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1 medium onion, finely chopped",
        "1 fennel bulb, coarsely chopped",
        "8 cups fish stock or bottled clam juice",
        "1 cup chopped fresh Italian parsley",
        "2 3-inch-long strips orange peel",
        "3 pounds ripe tomatoes, peeled, coarsely chopped",
        "1 pound medium-size red-skinned potatoes, peeled, cut into 1/4-inch-thick rounds",
        "1 large red-skinned potato, quartered",
        "1 large pinch of saffron threads",
        "2 1/2 pounds lingcod fillets, cut into 1 1/2-inch pieces",
        "1 red bell pepper",
        "6 tablespoons extra-virgin olive oil",
        "3 garlic cloves",
        "1 French-bread baguette, cut into 1/4-inch-thick rounds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Tomato",
        "Bell Pepper",
        "Fall",
        "Spring",
        "Winter"
    ],
    "title": "Fish Soup with Tomatoes and Red Pepper-Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fish-soup-with-tomatoes-and-red-pepper-garlic-sauce-101625"
}
