{
    "directions": [
        "1. Peel the potatoes and cut them into strips that are 1/4 inch thick and 3 inches long.",
        "2. In a deep-sided pot, heat 3 inches of oil to 325°F. (Please remember to use caution when cooking with hot oil.) Put the potatoes in the oil. Fry until they have softened and become slightly browned but not crisp, 2 to 3 minutes.",
        "3. Remove the chips with a large slotted spoon and set them aside on paper towels.",
        "4. Increase heat until the oil reaches a temperature of 375°F. In a large mixing bowl, combine the all-purpose flour, baking powder, salt, pepper, and eggs. Pour in the soda water and whisk until the batter is smooth. Spread the rice flour on a separate plate. Dredge the fish pieces in it, then dip them into the batter, letting the excess drip off.",
        "5. Put the chips in the bottom of a fryer basket (or use a slotted spoon) and carefully submerge them in the hot oil. Carefully add the fish to the bubbling oil. Fry the fish-and-chips until crispy and brown, 4 to 5 minutes. Remove the basket and drain the fish-and-chips on paper towels; season lightly with the salt and pepper. Serve with the Aioli and Mignonette Dipping Sauce ."
    ],
    "ingredients": [
        "6 large russet potatoes",
        "Vegetable oil, for deep-frying",
        "6 cups all-purpose flour",
        "3 tablespoons baking powder",
        "1 tablespoon kosher salt, plus more for seasoning",
        "1 tablespoon freshly ground black pepper, plus more for seasoning",
        "3 large eggs, lightly beaten",
        "3 (12-ounce) cans soda water",
        "1 to 2 cups rice flour",
        "6 cod fillets, sliced diagonally into 1/2-inch-wide strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Vegetable",
        "Kid-Friendly",
        "Cod",
        "Deep-Fry",
        "Cookie"
    ],
    "title": "Fish-and-Chips",
    "url": "http://www.epicurious.com/recipes/food/views/fish-and-chips-240028"
}
