{
    "directions": [
        "1. In a large pot over moderate heat, warm the oil. Sear the fish fillets until browned on both sides, about 4 minutes total. Add the scallops, shrimp, squid, and garlic to the pan and cook, stirring very gently, until the garlic is aromatic, about 1 minute.",
        "2. Add the saffron, clams, mussels, white wine, pepper flakes, tomatoes, about half the parsley, and half the basil. Bring to a boil, then lower the heat and simmer for 2 minutes to begin cooking the seafood.",
        "3. Add the fish stock or water to make the soup as brothy as you like. Return the liquids to a boil, cover the pot with a tight-fitting lid, and simmer until the clams and mussels are completely open, 4 to 5 minutes (discard any that do not open after that time).",
        "4. Add the remaining parsley and basil, and season to taste with salt and pepper. Gently ladle the soup into bowls, preserving as many whole pieces of fish as possible."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil",
        "2 pounds firm white fish fillet, such as red snapper or sea bream",
        "1/2 pound scallops, muscle tabs removed, cut in half if large",
        "1/2 pound shrimp, cleaned and tails removed",
        "1/2 pound squid, cleaned and cut into bite-size pieces",
        "3 garlic cloves, minced",
        "1/4 teaspoon crushed saffron threads",
        "2 dozen littleneck clams, scrubbed",
        "2 dozen mussels, scrubbed and debearded",
        "1 cup dry white wine",
        "1 teaspoon dried red pepper flakes",
        "3 Roma tomatoes, peeled, seeded, and chopped",
        "1/4 cup loosely packed fresh flat-leaf parsley, coarsely chopped",
        "1/4 cup loosely packed fresh basil leaves, torn",
        "4 cups fish stock or water, as needed",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Shellfish",
        "Tomato",
        "Dinner",
        "Lunch",
        "Seafood",
        "Clam",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Squid",
        "Christmas Eve",
        "Simmer",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fish Soup (Brodo di Pesce)",
    "url": "http://www.epicurious.com/recipes/food/views/fish-soup-brodo-di-pesce-51112450"
}
