{
    "directions": [
        "In a heavy saucepan cook bacon over moderate heat, stirring, until crisp and transfer with a slotted spoon to paper towels to drain. Pour off fat and in pan cook onion, carrot, and celery in butter over moderately low heat, stirring occasionally, until softened.",
        "Sprinkle flour over mixture and cook, stirring, 3 minutes. Stir in paprika and cook, stirring, 30 seconds. Add clam juice, water, and cream and bring to a boil, stirring occasionally.",
        "While mixture is coming to a boil, peel potato and cut into 1/4-inch dice. Add potato to mixture and simmer chowder, uncovered, 12 minutes. Stir in fish and simmer until just cooked through, about 5 minutes. Stir in parsley, bacon, and salt and pepper.",
        "Serve chowder with herbed oyster crackers.",
        "Preheat oven to 350°F.",
        "In a small saucepan melt butter with thyme, rosemary, and salt and pepper to taste over moderate heat, stirring. Add crackers and toss to coat with butter. On a baking sheet arrange crackers in one layer and bake in middle of oven 10 minutes, or until deep golden.",
        "Makes 1 1/2 cups."
    ],
    "ingredients": [
        "4 slices bacon, chopped",
        "1 small onion, chopped fine",
        "1 carrot, chopped fine",
        "1 celery rib, chopped fine",
        "1 tablespoon unsalted butter",
        "2 teaspoons all-purpose flour",
        "1/2 teaspoon paprika",
        "8 ounces bottled clam juice",
        "1 cup water",
        "1/2 cup heavy cream",
        "1 russet (baking) potato (about 1/2 pound)",
        "3/4 pound firm white fish fillet such as halibut or cod, skin discarded and flesh cut into 1-inch pieces",
        "2 tablespoons minced fresh parsley leaves",
        "1 1/2 tablespoons unsalted butter",
        "1/4 teaspoon dried thyme, crumbled",
        "1/4 teaspoon dried rosemary, chopped fine",
        "1 1/2 cups packaged oyster crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Potato",
        "Bake",
        "Quick & Easy",
        "Bacon",
        "Gourmet"
    ],
    "title": "Fish Chowder with Herbed Oyster Crackers",
    "url": "http://www.epicurious.com/recipes/food/views/fish-chowder-with-herbed-oyster-crackers-13276"
}
