{
    "directions": [
        "With motor running, drop garlic into a food processor and process until finely chopped. Add onion and pulse until finely chopped. Add coriander, egg, bread crumbs, mayonnaise, cumin, and salt and pulse until combined. Add fish and pulse until coarsely chopped.",
        "Line a baking sheet with wax paper. Quickly form fish mixture into 8 (1/2-inch-thick) patties (about 3 inches in diameter), transferring to lined baking sheet as formed.",
        "Heat 3 tablespoons oil in a 12-inch nonstick skillet over moderate heat until hot but not smoking. Cook 4 cakes, turning over once, until golden brown and just cooked through (reduce heat if cakes brown too quickly), about 6 minutes total. Transfer cakes with a slotted spatula to a plate and keep warm, loosely covered with foil. Wipe out skillet and cook remaining 4 patties in remaining 3 tablespoons oil in same manner.",
        "Whisk together all mayonnaise ingredients in a small bowl until smooth.",
        "Divide fish cakes among 4 beds of greens and top with paprika lemon mayonnaise."
    ],
    "ingredients": [
        "3 garlic cloves",
        "1 cup coarsely chopped onion",
        "1/2 teaspoon ground coriander",
        "1 large egg",
        "1/3 cup fine dry bread crumbs",
        "2 tablespoons mayonnaise",
        "3/4 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1 1/2 lb skinless hake or Pacific cod fillet, cut into 2-inch pieces",
        "6 tablespoons olive oil",
        "3/4 cup mayonnaise",
        "1 teaspoon finely grated fresh lemon zest",
        "1 tablespoon fresh lemon juice",
        "Rounded 1/4 teaspoon hot paprika",
        "1/4 teaspoon salt",
        "Accompaniment: 1 (5-oz) bag baby salad greens such as herb salad, Asian mix, or mesclun"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Onion",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Fish Cakes with Paprika Lemon Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/fish-cakes-with-paprika-lemon-mayonnaise-237213"
}
