{
    "directions": [
        "Preheat the oven to 350°F. Spread the pine nuts on a baking sheet and toast in the oven, stirring occasionally, until fragrant and golden, about 8 minutes. Pour onto a plate to cool. Transfer 1/4 cup of the toasted nuts to a nut grinder or small food processor and grind or pulse until finely ground.",
        "In a frying pan, heat 2 tablespoons of the oil over medium heat. Add the onion and cook, stirring occasionally, until softened and translucent, about 8 minutes. Add the paprika, garlic, ground pine nuts, bread crumbs, and saffron, if using, and cook, stirring often, for 3 minutes. Add the tomatoes and stock and cook, stirring occasionally, until thickened, 5 to 8 minutes. Season to taste with salt and pepper. Keep warm over low heat.",
        "In a large frying pan, heat the remaining 2 tablespoons oil over medium heat. Sprinkle the fish with salt and pepper, add to the pan, and cook, turning once, until browned on both sides, about 3 minutes on each side. Pour the sauce over the fish, add the peas, if using, and simmer until the fish is opaque throughout, about 5 minutes longer. Transfer to a serving dish or individual dishes, and garnish with the remaining pine nuts and the parsley. Serve at once.",
        "You can skip the step of browning the fish, and instead poach it in the sauce. Or, you can combine the fish and the sauce in a baking dish, making sure the fish is fully covered by the sauce, and bake in a preheated in a 450°F oven until fish is tender, 10 to 12 minutes, depending on the thickness of the pieces. If baking, do not reduce the sauce too much, as some of the liquid will evaporate in the oven."
    ],
    "ingredients": [
        "1/2 cup pine nuts",
        "4 tablespoons olive oil",
        "1 large onion, finely chopped",
        "1 teaspoon sweet paprika",
        "1 tablespoon finely minced garlic",
        "1/4 cup fresh bread crumbs",
        "Pinch of saffron threads, warmed and crushed (optional)",
        "1 1/2 cups peeled, seeded, and chopped tomatoes",
        "1 cup fish stock or dry white wine",
        "Salt and freshly ground black pepper",
        "1 1/2 pounds firm white fish fillet, cut into 8 pieces",
        "1 cup English peas, cooked until tender-crisp (optional)",
        "1/4 cup chopped fresh flat-leaf parsley or mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Nut",
        "Appetizer",
        "Dinner",
        "Tree Nut",
        "Pine Nut",
        "Seafood",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Fish in Pine Nut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fish-in-pine-nut-sauce-354570"
}
