{
    "directions": [
        "For the pico de \"guyo\": Remove the thin outer layers of the onion and chop into 1/8- by 1/8-inch pieces. Chop the jalapeno in half and remove the seeds and inner membrane (use gloves when handling the jalapeno). Dice the jalapeno into small pieces. Cut the tomatoes into 1/8- by 1/8-inch pieces. Cut the lime in half and squeeze the juice into the mix. Add the salt and pepper. Let all the ingredients sit and marinate for at least 30 minutes.",
        "For the cilantro lime sauce: Mix the mayonnaise, sour cream, cilantro, lime juice, garlic powder and onion powder together and let marinate for at least 30 minutes.",
        "For the corn tortillas: Place the corn flour in a mixing bowl. Add the salt and pepper. Slowly add the water while mixing the dough with your hands until it becomes a tad bit softer than a \"play dough\" consistency. Break off the dough into twenty-four 1/4-inch round balls. Flatten the dough using a tortilla press that has been lined with a ziptop bag on each side. Remove the dough and place directly onto a skillet that has been lightly oiled and heated to 350 degrees F. When you notice the dough just beginning to show stress cracks, about 3 minutes, flip it and cook an additional 5 minutes. Remove from the heat and stack with paper towels in between each tortilla.",
        "For the blackening seasoning: Combine the oregano, thyme, smoked paprika, cayenne pepper and white pepper in a bowl and mix together.",
        "For the fish: Cut your fresh fish into small cubes about 1/4- by 1/4-inch. Sprinkle liberally with 1/2 tablespoon of the blackening seasoning. Heat the oil in a pan over medium-high heat. Add the fish to the pan and saute for 1 minute. Add the garlic to the pan and continue to saute for about 45 more seconds. Add the wine and cilantro. Finish cooking about 1 more minute.",
        "Reheat the tortillas if necessary, remove from the heat and add some lettuce, cooked fish, cilantro lime sauce and pico de \"guyo\". Serve 3 per plate. Enjoy!"
    ],
    "ingredients": [
        "1 small yellow onion",
        "1 jalapeno pepper",
        "2 plum tomatoes",
        "1 fresh lime",
        "1/4 teaspoon salt",
        "1/8 teaspoon fresh ground black pepper",
        "1/4 cup mayonnaise",
        "1/4 cup sour cream",
        "1 tablespoon chopped fresh cilantro",
        "1 tablespoon fresh lime juice",
        "1/4 tablespoon garlic powder",
        "1/4 tablespoon onion power",
        "2 cups corn flour, such as Maseca",
        "1 teaspoon salt",
        "1/4 teaspoon fresh ground black pepper",
        "1/4 cup room temperature water",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon dried thyme",
        "1/8 teaspoon smoked paprika",
        "1/8 teaspoon cayenne pepper",
        "1/8 teaspoon ground white pepper",
        "2 small fish fillets (We use tuna, but you can substitute with whatever your family's favorite fish is. Total weight should be about 1 1/2 pounds.)",
        "1 tablespoon vegetable oil",
        "1 clove garlic, minced",
        "1 tablespoon crisp chardonnay (if you have to cook with it, make it something that you will enjoy finishing your meal!)",
        "1 tablespoon chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Taco Recipes",
        "Fish",
        "Main Dish Recipes"
    ],
    "title": "Fish Tacos",
    "url": "http://www.foodnetwork.com/recipes/fish-tacos-recipe4"
}
