{
    "directions": [
        "Place the bacon in a large pot, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. In the same pot, stir in the ground beef, sausage, and beef stew meat. Cook and stir until the ground meat is crumbly, evenly browned, and no longer pink. Drain and set meat aside in a bowl. Discard any excess grease.",
        "Reduce heat to medium, then stir the onion, garlic, celery, habanero pepper, green bell pepper, and red bell pepper into the same large pot; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomato sauce and cumin, then add the beef and sausage mixture, bacon, and chicken. Stir in the diced tomatoes, cannellini beans, pinto beans, and butter beans. Season with salt and pepper. Bring to a boil over high heat, then reduce heat to low and simmer for 2 hours. Serve with a dollop of sour cream."
    ],
    "ingredients": [
        "4 slices hickory-smoked bacon",
        "3/4 pound ground beef",
        "1 pound bulk pork sausage",
        "3/4 pound cubed beef stew meat",
        "1 1/2 cups chopped onion",
        "2 cloves garlic, minced",
        "1 stalk celery, chopped",
        "1/2 habanero pepper, seeded and minced, or to taste",
        "1/2 large green bell pepper, chopped",
        "1/2 large red bell pepper, chopped",
        "1 (28 ounce) can tomato sauce",
        "1 1/2 teaspoons ground cumin",
        "2 cups cubed cooked chicken",
        "3 (14.5 ounce) cans fire-roasted diced tomatoes, with juice",
        "1 (15 ounce) can cannellini beans, rinsed and drained",
        "1 (15 ounce) can pinto beans, rinsed and drained",
        "1 (15 ounce) can butter beans, rinsed and drained",
        "salt and pepper to taste",
        "3/4 cup sour cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Five Meat Habanero Chili",
    "url": "http://allrecipes.com/recipe/212818/five-meat-habanero-chili/"
}
