{
    "directions": [
        "In a small bowl stir together the five-spice powder and 2 tablespoons of the oil, rub the mixture on the guinea hens, and season the hens with salt. In a large heavy skillet heat the remaining 2 tablespoons oil over moderately high heat until it is hot but not smoking and in it brown the hens lightly, 1 at a time. Arrange the browned hens, breast side down, in 2 roasting pans and roast them in a preheated 350°F. oven, switching the pans from one rack to the other after 30 minutes, for 50 minutes to 1 hour, or until a meat thermometer inserted in the fleshy part of the thigh registers 170°F. Transfer the hens to a cutting board and let them stand, covered loosely with foil, for 15 minutes.",
        "Skim the fat from the pan juices, divide the wine between the pans, and deglaze the pans over high heat, scraping up the brown bits. Transfer the mixture to a large saucepan, add the zest, the gingerroot, and the star anise, and boil the mixture until the liquid is reduced to about 1/3 cup. Add the broth, the water, and the soy sauce and cook the mixture at a slow boil for 5 minutes. Stir the cornstarch mixture, stir it into the zest mixture, and simmer the sauce for 2 minutes. Strain the sauce through a fine sieve into a saucepan and keep it warm.",
        "Carve the guinea hens, divide the broccoli rabe among 8 heated plates, and arrange the meat on it. Spoon some of the sauce over each serving and serve the remaining sauce separately.",
        "Trim and discard any yellow or coarse leaves and the tough stem ends from the broccoli rabe and wash the broccoli rabe well in several changes of cold water. In a steamer set over boiling water steam the broccoli rabe, covered, for 4 to 5 minutes, or until the stems are tender."
    ],
    "ingredients": [
        "3 tablespoons five-spice powder*",
        "4 tablespoons vegetable oil",
        "four 2 1/2-pound guinea hens,** rinsed and patted dry",
        "1 cup dry white wine",
        "the zest of 1 1/2 navel oranges, removed in strips with a vegetable peeler",
        "eight 1/4-inch-thick slices of fresh gingerroot, crushed lightly with the flat side of a large knife",
        "3 whole star anise*",
        "2 1/2 cups chicken broth",
        "1/2 cup water",
        "3 tablespoons soy sauce",
        "2 tablespoons cornstarch, dissolved in 2 tablespoons cold water",
        "2 1/2 pounds broccoli rabe (available at specialty produce markets and some supermarkets) or choi sum (Chinese flowering cabbage, available at Asian markets)",
        "*available at Asian markets, specialty foods shops, and some supermarkets",
        "**available at some butcher shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Leafy Green",
        "Roast",
        "Sauté",
        "Steam",
        "Spice",
        "Anise",
        "Gourmet"
    ],
    "title": "Five-Spice Roasted Guinea Hens",
    "url": "http://www.epicurious.com/recipes/food/views/five-spice-roasted-guinea-hens-13172"
}
