{
    "directions": [
        "Blend flour and salt in processor 5 seconds. Add butter; using on/off turns, cut in until coarse meal forms. Add 6 tablespoons ice water. Using on/off turns, blend until moist clumps form, adding more water by tablespoonfuls if dough is dry. Gather dough into ball. Divide in half and shape into disks. Wrap each disk in plastic; chill at least 1 hour and up to 1 day.",
        "Combine first 5 ingredients in large pot. Bring to boil. Reduce heat to medium-low, cover, and simmer until fruit is tender, stirring occasionally, about 25 minutes. Transfer mixture to bowl. Mix in flour and spices. Cool. (Can be made 1 day ahead. Cover and chill. Bring to room temperature before continuing.)",
        "Preheat oven to 400°F. Roll out 1 dough disk on lightly floured surface to 13-inch round. Line 9-inch-diameter pie dish (not deep-dish) with dough. Spoon filling into crust; dot with butter. Roll out second dough disk on lightly floured surface to 13-inch round. Drape dough over filling. Roll up overhang of both crusts together to form edge and crimp. Cut hole in center of crust to allow steam to escape; brush top (not edge) with glaze.",
        "Bake pie 15 minutes. Reduce oven temperature to 375°F. Bake pie until crust is golden, about 55 minutes longer. Cool pie on rack 30 minutes. Serve warm or at room temperature with ice cream.",
        "*A blend of ground cinnamon, cloves, fennel seeds, star anise, and peppercorns, sold in the supermarket's spice section."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/2 teaspoon salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "6 tablespoons (or more) ice water",
        "3 3/4 pounds Golden Delicious apples, peeled, halved, cored, thinly sliced",
        "2 1/4 pounds quinces, peeled, halved, cored, thinly sliced",
        "1 cup sugar",
        "1/2 cup apple cider",
        "1 teaspoon fresh lemon juice",
        "2 tablespoons all purpose flour",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon Chinese five-spice powder*",
        "2 tablespoons (1/4 stick) chilled unsalted butter, diced",
        "1 tablespoon sugar blended with 2 teaspoons whole milk (for glaze)",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Lemon",
        "Apple",
        "Quince",
        "Spring",
        "Winter",
        "Birthday",
        "Cinnamon"
    ],
    "title": "Five-Spice Apple Quince Pie",
    "url": "http://www.epicurious.com/recipes/food/views/five-spice-apple-quince-pie-109093"
}
