{
    "directions": [
        "Combine the venison and French salad dressing in a non-metallic bowl until the venison is evenly coated. Cover the bowl with plastic wrap and marinate in the refrigerator overnight.",
        "Remove the venison from the marinade, squeeze off excess, and place the venison cubes into a clean bowl. Discard the remaining marinade. Season the venison with seasoned salt, salt, and pepper; sprinkle with the flour and toss to coat.",
        "Heat the vegetable oil in a large skillet over medium-high heat. Add the venison cubes, and cook until golden brown on all sides, about 10 minutes. While the venison cubes are browning, whisk together the tomato paste and beef broth in a slow cooker until the tomato paste has dissolved. Stir in the water, brown sugar, Worcestershire sauce, mustard powder, paprika, garlic, onion soup mix, potatoes, carrots, celery, chopped onion, peas, Brussels sprouts, and the browned venison cubes.",
        "Cover and cook on Low until the venison, potatoes, and carrots are tender, 10 to 12 hours."
    ],
    "ingredients": [
        "2 pounds cubed venison",
        "1/2 (16 ounce) bottle French salad dressing (such as Wishbone®)",
        "seasoned salt to taste",
        "1 pinch salt and black pepper to taste (optional)",
        "2 tablespoons all-purpose flour",
        "1/4 cup vegetable oil",
        "1 (6 ounce) can tomato paste",
        "2 (14 ounce) cans beef broth",
        "2/3 cup water",
        "3 tablespoons brown sugar",
        "1 tablespoon Worcestershire sauce",
        "1/4 teaspoon mustard powder",
        "1/4 teaspoon paprika",
        "1 clove garlic, minced",
        "1 (1 ounce) package dry onion soup mix",
        "4 potatoes, peeled and cut into 1-inch pieces",
        "4 carrots, peeled and cut in chunks",
        "3 stalks celery, sliced",
        "1 large onion, chopped",
        "1 (10 ounce) package frozen peas, thawed",
        "1 (10 ounce) package frozen Brussels sprouts, thawed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Five Star Venison Stew",
    "url": "http://allrecipes.com/recipe/131168/five-star-venison-stew/"
}
