{
    "directions": [
        "Preheat oven to 350°F. Season ribs with 1 1/2 teaspoons salt and 1 1/4 teaspoons pepper and let sit at room temperature for 30 minutes. Rinse one carrot and one parsnip and cut into thirds (no need to peel); reserve.",
        "In a large bowl, toss short ribs with flour until evenly coated. In a large Dutch oven or other oven-safe pot over medium-high heat, heat oil. When oil is hot, add 3 or 4 short ribs and sear on all sides until browned, about 2 minutes per side. Transfer to a plate and continue working in batches to sear remaining short ribs. Pour out all but 1 tablespoon oil from Dutch oven and reduce heat to medium. Add tomato paste and five-spice powder and cook, stirring, until fragrant, 1 minute. Add wine to pot, scraping up brown bits with a wooden spoon. Bring cooking liquid to a boil, reduce to a simmer, and cook until liquid is reduced, about 10 minutes.",
        "Add reserved carrot and parsnip chunks, broth, onion, garlic, reserved cilantro stems, bay leaves, and seared short ribs. Nestle the short ribs in the cooking liquid to cover. Bring the liquid to a simmer on the stovetop, then cover and transfer to the oven to braise for 2 hours. Uncover pot and continue to braise in the oven until beef is very tender and falling off the bone, 30 to 60 minutes more.",
        "Meanwhile, set a large pot of salted water to boil. Peel and roughly chop remaining carrots and parsnips. Add cook carrots and parsnips to boiling water and cook until tender when pierced with a knife, about 15 minutes. Drain vegetables and return them to the pot. Add milk, butter, remaining 1 teaspoon salt, and nutmeg. Use an immersion blender, potato masher or a fork to blend or mash to desired consistency (it can be as smooth or chunky as you like). Taste and adjust seasoning. Place a lid on the pot and reserve until ready to serve.",
        "When short ribs are done, transfer them from cooking liquid to a plate. Set a strainer over a large bowl, and strain cooking liquid. Discard solids and pour strained cooking liquid back into Dutch oven. Set pot over medium-high heat and simmer until liquid is reduced by half and coats the back of a spoon, about 10 minutes. Taste and adjust seasoning. Gently reheat carrot-parsnip purée.",
        "Serve short ribs over carrot-parsnip purée, topped with its sauce and a sprinkling of cilantro."
    ],
    "ingredients": [
        "4 pounds English cut beef short ribs (about twelve 3-inch pieces)",
        "2 1/2 teaspoons kosher salt, divided, plus more for boiling",
        "1 1/4 teaspoons freshly ground black pepper",
        "4 medium carrots, divided (about 3/4 pound)",
        "4 medium parsnips, divided (about 3/4 pound)",
        "1 1/2 tablespoons all-purpose flour",
        "1 tablespoon high-heat vegetable oil, such as grapeseed",
        "1 tablespoon tomato paste",
        "1 1/2 tablespoons Chinese five-spice powder",
        "1 750-ml bottle dry red wine",
        "4 cups low-sodium beef broth",
        "1 small onion, cut into wedges",
        "5 garlic cloves, peeled",
        "1/4 cup cilantro leaves, stems reserved",
        "2 dried bay leaves",
        "1/2 cup whole milk",
        "2 tablespoons unsalted butter",
        "1/2 teaspoon ground nutmeg",
        "a large Dutch oven or oven-safe pot with lid"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Kid-Friendly",
        "Dinner",
        "Beef Rib",
        "Carrot",
        "Parsnip",
        "Fall",
        "Winter",
        "Healthy",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Five-Spice Short Ribs With Carrot-Parsnip Purée",
    "url": "http://www.epicurious.com/recipes/food/views/five-spice-short-ribs-with-carrot-parsnip-puree-51255880"
}
