{
    "directions": [
        "Freeze pork, wrapped in plastic wrap, until firm, 30 minutes, to facilitate slicing. Cut pork crosswise into 3/4-inch-thick slices and season with salt and pepper.",
        "Mince garlic and in a small bowl stir together with remaining sauce ingredients until combined.",
        "Halve onion lengthwise and cut into thin slices. Diagonally cut beans into 1 1/2-inch pieces. Core cabbage and cut into 1-inch pieces. Chop coriander.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 1 1/2 tablespoons peanut oil, swirling wok or skillet to coat evenly, and heat until hot but not smoking. Add onion and stir-fry until slightly softened. Add beans and stir-fry until crisp-tender, about 4 minutes. Transfer mixture to a large bowl. Add 1 tablespoon peanut oil to wok or skillet and stir-fry cabbage until crisp-tender, about 2 minutes. Add bean sprouts and stir-fry until sprouts are slightly wilted, about 30 seconds. Transfer cabbage mixture to bowl.",
        "Add 1 tablespoon peanut oil to wok or skillet and heat until just smoking. Stir-fry half of pork, separating slices, until browned and transfer to bowl. Add remaining tablespoon peanut oil and stir-fry remaining pork, transferring to bowl.",
        "Add sauce to wok or skillet and bring to a boil, stirring. Return pork-vegetable mixture to wok or skillet and stir-fry until heated through. Stir in coriander, snow-pea shoots or daikon sprouts, sesame oil, and salt and pepper to taste.",
        "Serve stir-fry over rice."
    ],
    "ingredients": [
        "a 3/4-pound piece well-trimmed boneless pork loin",
        "3 garlic cloves",
        "2 teaspoons minced peeled fresh gingerroot",
        "2/3 cup water",
        "1/4 cup soy sauce",
        "1/4 cup mango chutney such as Major Grey's",
        "1 teaspoon Chinese five-spice powder",
        "1/2 teaspoon sambal oelek (Indonesian chili paste)",
        "1 medium red onion",
        "1/2 pound fresh green beans",
        "a 3/4-pound piece green cabbage (about 1/2 medium head)",
        "1/4 cup packed coriander leaves",
        "4 1/2 tablespoons peanut oil",
        "1/2 pound fresh bean sprouts (about 2 cups)",
        "1 cup snow-pea shoots or daikon (Asian radish) sprouts",
        "2 teaspoons Asian sesame oil",
        "Accompaniment:Cooked Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pork",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Five-Spice Pork and Green Bean Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/five-spice-pork-and-green-bean-stir-fry-14491"
}
