{
    "directions": [
        "Pack the fresh bacon in the salt and sugar mixture, cover, and refrigerate for up to 4 hours. Rinse and pat dry, then cut into 1/2-inch cubes.",
        "Combine the bacon, beans, carrot, onion, garlic, apricots, bay leaves, and chile in a pressure cooker and add cold water to come an inch above the beans. Fit the pressure cooker with the lid and raise the temperature to high until it starts to whistle. Reduce to the lowest setting and cook until the beans are creamy and cooked through, roughly 25 minutes. Remove the lid and adjust the seasoning with vinegar, salt, and pepper. Alternately, bring the ingredients to a boil in a large, heavy-bottomed pot and immediately reduce the heat to a simmer. Cook, covered, until the beans are thoroughly cooked through and creamy, roughly 1 3/4 hours.",
        "Remove the large aromatic vegetables, garlic, chile, and bay leaves from the pot and discard. They've done their flavoring job. Coarsely chop the greens or tear with your hands, then fold them into the beans. Simmer for another 5 minutes, or until the greens are tender.",
        "Serve with warm crusty bread and a healthy dose of olive oil."
    ],
    "ingredients": [
        "1/4 pound fresh bacon",
        "2 cups kosher salt mixed with 2 cups sugar",
        "2 cups dried flageolet beans, soaked overnight and drained",
        "1 carrot, halved",
        "1 onion, quartered",
        "1 whole head garlic, halved widthwise",
        "1/4 cup dried apricots, roughly chopped",
        "2 bay leaves",
        "1 dried ancho chile",
        "About 2 tablespoons fino sherry vinegar",
        "Salt",
        "Freshly ground black pepper",
        "A few leaves Tuscan kale",
        "A few leaves black kale",
        "A few leaves mustard greens",
        "Good olive oil for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Side",
        "Apricot",
        "Bacon",
        "Kale",
        "Legume",
        "Fall",
        "Simmer",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Flageolets with Autumn Greens and Fresh Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/flageolets-with-autumn-greens-and-fresh-bacon-395570"
}
