{
    "directions": [
        "Mash garlic, Aleppo pepper, and 1/4 teaspoon coarse salt to paste in mortar with pestle or in small bowl with back of spoon. Whisk in remaining ingredients. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
        "Mix thyme, Aleppo pepper, 1 teaspoon coarse salt, and 1/4 teaspoon black pepper in small bowl. Rub seasoning mixture into steak; set aside. DO AHEAD: Can be made 4 hours ahead. Cover; chill. Bring to room temperature before continuing.",
        "Squeeze juice from lemon half into medium bowl of water. Cut 1/2 inch from tops of artichokes. Working with 1 artichoke at a time, break off dark outer leaves until only pale yellow leaves remain. Cut artichokes lengthwise in half; cut each half into 1/2-inch wedges. Place in lemon water to prevent browning.",
        "Place potatoes in heavy large saucepan. Add enough cold water to cover; sprinkle with salt. Bring to boil; reduce heat to medium-high and boil until potatoes are just tender, 8 to 10 minutes. Drain. Transfer to baking sheet until cool enough to handle. Halve or quarter potatoes.",
        "Drain artichokes; pat to dry well, then sprinkle with salt and pepper. Heat 2 tablespoons olive oil in heavy large skillet over medium-high heat. Add artichokes and sauté until browned, about 4 minutes. Add 1/2 cup water, thyme sprigs, and garlic. Cover skillet and simmer over medium heat until artichokes are tender, about 5 minutes. Uncover and boil until no liquid remains, stirring often, 2 to 3 minutes. Add remaining 1 tablespoon olive oil and potatoes; stir to coat. Add cream and sprinkle with salt and pepper. Cook until potatoes are heated through and browned in spots, stirring often, about 6 minutes. Season hash to taste with salt and pepper. DO AHEAD: Can be made 1 hour ahead. Let stand at room temperature.",
        "Preheat oven to 400°F. Heat peanut oil in heavy large ovenproof skillet over high heat. Add steak and cook until bottom is brown, about 2 minutes. Turn steak over; transfer to oven and roast until cooked to desired doneness, about 7 minutes for medium-rare. Transfer to work surface; tent with foil to keep warm. Let rest 10 minutes.",
        "Meanwhile, rewarm artichokepotato hash gently over medium heat. Stir in chopped chives. Thinly slice steak crosswise. Divide steak and hash among plates. Drizzle some aioli over steak. Serve, passing remaining aioli alongside."
    ],
    "ingredients": [
        "2 garlic cloves, pressed",
        "1 teaspoon Aleppo pepper",
        "1/4 teaspoon coarse kosher salt",
        "1/2 cup mayonnaise",
        "2 tablespoons extra-virgin olive oil",
        "1 teaspoon Sherry wine vinegar",
        "1 1/2 tablespoons fresh thyme leaves",
        "2 teaspoons Aleppo pepper",
        "1 teaspoon coarse kosher salt",
        "1/4 teaspoon ground black pepper",
        "1 1 1/2-to 2-pound flank steak",
        "1/2 lemon",
        "8 baby artichokes, stems trimmed",
        "1 1/4 pounds unpeeled small yellow potatoes (such as baby Dutch or Russian Banana)",
        "3 tablespoons extra-virgin olive oil, divided",
        "1/2 cup water",
        "2 fresh thyme sprigs",
        "1 garlic clove, minced",
        "2 tablespoons heavy whipping cream",
        "1 tablespoon peanut oil or vegetable oil",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Roast",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Mayonnaise",
        "Steak",
        "Artichoke",
        "Spring",
        "Pan-Fry",
        "Simmer",
        "Boil",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Flank Steak with Artichoke-Potato Hash and Aleppo-Pepper Aioli",
    "url": "http://www.epicurious.com/recipes/food/views/flank-steak-with-artichoke-potato-hash-and-aleppo-pepper-aioli-352092"
}
