{
    "directions": [
        "Butterfly the steak by cutting horizontally into the long side of the steak, through the middle, to within one-half inch of the other side. Open the steak and spread the sides out like an open book. Cover the steak with plastic wrap and pound it with a meat mallet to give it an even surface. Discard the plastic wrap.",
        "Season steak with salt and pepper. Scatter 3 tablespoons bread crumbs, parsley, currants, and pine nuts over the steak; season with cayenne pepper and red pepper flakes. Spread  slices on the steak and sprinkle Parmigiano-Reggiano cheese and remaining bread crumbs over the top.",
        "Roll up meat firmly, starting at a cut-end, and set seam-side down. Use kitchen twine to tie steak at 1-inch intervals. Season with salt.",
        "Heat olive oil in a large pot over medium-high heat. Cook steak until brown on all sides, 3 to 5 minutes per side.",
        "Pour tomato sauce, chicken broth, white wine, and bay leaf into the pot; add enough water to just cover the steak. Bring liquid to a simmer, reduce heat to low, cover pot with a lid, and braise until meat is fork-tender, 2 1/2 to 3 hours. Transfer meat to a plate to rest for 10 minutes before slicing across the grain.",
        "Increase heat to medium-high and cook liquid until it is reduced and slightly thicker, about 10 minutes. Spoon sauce over sliced beef."
    ],
    "ingredients": [
        "1 flank steak, trimmed",
        "salt and ground black pepper to taste",
        "1/4 cup dry bread crumbs, divided",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 tablespoon dried currants",
        "1 tablespoon pine nuts, or to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 pinch red pepper flakes, or to taste",
        "1 ounce thinly sliced pancetta",
        "2 tablespoons grated Parmesan-Reggiano cheese",
        "1 tablespoon olive oil, or as needed",
        "3 cups tomato sauce",
        "2 cups chicken broth",
        "3/4 cup white wine",
        "1 bay leaf",
        "water to cover"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Flank Steak Roulade",
    "url": "http://allrecipes.com/recipe/237317/flank-steak-roulade/"
}
