{
    "directions": [
        "Put steak in a large resealable plastic bag. Whisk olive oil, lemon juice, Worcestershire sauce, garlic, oregano, salt, and black pepper in a small bowl. Reserve 1/2 cup marinade for vegetables; pour remainder over steak and turn to coat. Seal bag. Chill at least 2 hours or up to 12 hours.",
        "Preheat oven to 450 degrees F (230 degrees C). Place 1 rack in center position and another 4 inches from broiler. Line a baking sheet with aluminum foil and spray with cooking spray.",
        "Toss chickpeas, tomatoes, cucumber, and red onion with reserved 1/2 cup marinade on the prepared baking sheet and spread in an even layer.",
        "Roast on center rack until vegetables begin to pucker and brown, 15 to 20 minutes.",
        "Remove baking sheet from oven and turn oven to broil. Push vegetables to the middle of the pan. Remove steak from marinade, allowing excess liquid to drip off, brush off garlic, and set on top of vegetables. Discard marinade.",
        "Broil steak on top rack, flipping once, until it begins to char and an instant-read thermometer inserted into thickest part registers 125 degrees F (52 degrees C) for rare or 135 degrees F (57 degrees F) for medium-rare, 3 to 5 minutes per side.",
        "Turn oven off and place tortillas on the bottom rack of the oven; keep in oven until warmed and slightly toasted, 1 to 2 minutes.",
        "Cover steak loosely with foil and let rest 10 minutes before slicing thinly across the grain. Fill tortillas with warm steak and vegetables; top with feta cheese and parsley."
    ],
    "ingredients": [
        "2 pounds flank steak",
        "6 tablespoons extra-virgin olive oil",
        "1/4 cup lemon juice",
        "2 tablespoons Worcestershire sauce",
        "4 cloves garlic, minced",
        "2 teaspoons dried oregano",
        "1 teaspoon kosher salt",
        "1/4 teaspoon ground black pepper",
        "cooking spray",
        "1 (15 ounce) can chickpeas, drained and rinsed",
        "1 1/2 cups cherry tomatoes",
        "1 English cucumber, chopped",
        "1 red onion, chopped",
        "12 corn tortillas",
        "1 cup crumbled feta cheese",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Flank Steak and Veggie Tacos",
    "url": "http://allrecipes.com/recipe/256106/flank-steak-and-veggie-tacos/"
}
