{
    "directions": [
        "Cut peel and white pith from grapefruit. Working over bowl to catch juices, cut between membranes to release segments. Squeeze membranes to extract juice. Place segments in medium bowl. Transfer 1/2 cup grapefruit juice to heavy small saucepan. Reserve remaining juice. Add 1 cup sugar to juice in saucepan. Gently simmer until syrup thickens, stirring until sugar dissolves, about 5 minutes. Remove from heat. Stir in mint leaves. Cover and let steep 10 minutes. Strain syrup into bowl. (Grapefruit segments, juice and syrup can be made 1 day ahead. Chill separately.)",
        "Preheat oven to 325°F. Combine 1/2 cup sugar and 2 tablespoons water in heavy small saucepan. Stir over medium heat until sugar dissolves. Increase heat and boil without stirring until deep amber, occasionally brushing down sides of pan with wet brush and swirling pan, about 8 minutes. Immediately divide caramel between six 3/4-cup custard cups. Transfer cups to 13x9x2-inch metal baking pan.",
        "Whisk 1/2 cup grapefruit juice, 1/2 cup sugar, milk, half and half, eggs, vanilla, and salt in large bowl until sugar dissolves. Divide mixture among prepared cups. Pour enough hot water into pan to come halfway up sides of cups. Bake flans until just set, about 45 minutes. Cool flans in pan 1 hour. Remove from water. Cover and chill at least 4 hours and up to 1 day.",
        "Pour mint syrup over grapefruit segments. Using small sharp knife, cut around flans to loosen. Invert 1 flan onto each of 6 plates. Spoon grapefruit segments and syrup over flans; serve."
    ],
    "ingredients": [
        "4 large pink grapefruit",
        "2 cups sugar",
        "1 cup (packed) mint leaves",
        "3/4 cup whole milk",
        "3/4 cup half and half",
        "4 large eggs",
        "1 teaspoon vanilla extract",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Kentucky Derby",
        "Grapefruit",
        "Mint",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Flan with Pink Grapefruit and Mint Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/flan-with-pink-grapefruit-and-mint-syrup-106431"
}
