{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Mix together graham cracker crumbs, 1/4 cup sugar, and 1/3 cup softened butter.  Reserve 1/4 cup of the crumb mixture for topping the pie. Press remaining crumbs into a 9-inch pie plate. Bake in preheated oven for 8 minutes.",
        "Mix 1/2 cup sugar, cornstarch, flour, and salt in a saucepan. Stir in milk gradually. Cook over medium heat, stirring, until mixture comes to a boil and thickens. Cook 2 minutes more.  Add a little of this hot mixture to beaten egg yolks, then stir yolks into hot mixture.  Cook 1 minute while stirring.",
        "Remove pan from heat. In a steady stream, pour hot milk mixture into beaten egg yolks, whisking constantly. Return custard to saucepan. Cook over medium heat, stirring constantly, until mixture thickens slightly and coats the back of a wooden spoon, about 2 minutes more. Remove from heat; stir in 1 tablespoon butter and vanilla.  Cool 15 minutes, and pour into crumb crust. Cool completely.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Beat egg whites until soft peaks form. Slowly add 1/4 cup sugar, beating until stiff and glossy. Stir in almond extract. Spread meringue over filling, and against the edge of crust to seal. Sprinkle with reserved crumbs.",
        "Bake in preheated oven just until meringue is golden, about 4 to 5 minutes. Allow pie to cool completely before serving."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs",
        "1/4 cup white sugar",
        "1/3 cup butter, softened",
        "1/2 cup white sugar",
        "2 tablespoons cornstarch",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon salt",
        "2 cups milk",
        "2 egg yolks, beaten",
        "1 tablespoon butter",
        "1 teaspoon vanilla extract",
        "3 egg whites",
        "1/4 cup white sugar",
        "1/2 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Flapper Pie I",
    "url": "http://allrecipes.com/recipe/12253/flapper-pie-i/"
}
