{
    "directions": [
        "Preheat oven to 500 degrees F (260 degrees C). Place a baking sheet in the oven until hot.",
        "Place broccoli florets in a large bowl. Stir in olive oil and salt. Using oven mitts, remove the hot baking sheet from the oven. Pour broccoli florets onto baking sheet and spread out.",
        "Bake in preheated oven about 5 minutes; turn and cook about 5 minutes more. (the florets should be somewhat browned and crunchy.) Remove from oven, and set aside.",
        "Meanwhile, heat 2 tablespoons olive oil in a large skillet over medium heat. Stir in onions, garlic, and red pepper flakes. Cook until onion is soft and translucent. Stir in sun-dried tomatoes.",
        "Turn heat up to medium high. Pour in white wine, and cook about 3 minutes. Stir in chopped tomatoes. Cook about 2 minutes, then stir in spinach, lemon juice, and feta. Turn the heat down to low, and cover until pasta is done.",
        "While the onions are cooking, bring a large pot of lightly salted water to boil. Add linguini, and cook until al dente, about 8 to 10 minutes. Drain, and stir into broccoli mixture. Top with toasted pine nuts."
    ],
    "ingredients": [
        "1 (8 ounce) package broccoli florets",
        "1 (16 ounce) package uncooked linguine pasta",
        "5 tablespoons olive oil, divided",
        "1/2 teaspoon salt",
        "1 medium onion, chopped",
        "1 clove garlic, minced",
        "1/2 teaspoon crushed red pepper flakes",
        "1/4 cup chopped sun-dried tomatoes (packed in oil)",
        "3/4 cup dry white wine",
        "1 (15 ounce) can whole peeled tomatoes, drained and chopped",
        "3 cups baby spinach",
        "1 1/2 tablespoons fresh lemon juice",
        "4 ounces feta cheese, crumbled",
        "1/4 cup pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Flash-blasted Broccoli and Feta Pasta",
    "url": "http://allrecipes.com/recipe/86967/flash-blasted-broccoli-and-feta-pasta/"
}
