{
    "directions": [
        "Cook fava beans in a medium saucepan of boiling salted water until tender, about 4 minutes. Using a mesh sieve, transfer to a colander set in a bowl of ice water. Drain and peel. Combine lemon juice, 2 Tbsp. oil, and half of fava beans in a medium bowl and lightly mash with a fork. Stir in remaining fava beans; season with kosher salt and pepper.",
        "Combine cucumbers and vinegar in a medium bowl; season with kosher salt. Let sit until slightly softened, 10–12 minutes.",
        "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill the remaining piece of dough.",
        "Transfer flatbreads to a work surface. Tear burrata into pieces and divide between flatbreads; top with fava bean mixture, cucumbers, and basil. Sprinkle with sesame seeds, sea salt, and pepper.",
        "Fava beans can be cooked 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "2 cups shelled fava beans (from about 2 pounds pods)",
        "Kosher salt",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons olive oil, plus more for grill",
        "Freshly ground black pepper",
        "2 Persian cucumbers, thinly sliced",
        "2 tablespoons unseasoned rice vinegar",
        "1/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved",
        "2 (8-ounce) balls burrata or fresh mozzarella, drained",
        "Basil leaves (for serving)",
        "1 teaspoon toasted sesame seeds",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Basil",
        "Flat Bread",
        "Cheese",
        "Cucumber",
        "Bean",
        "Appetizer",
        "Lunch",
        "Grill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Flatbread With Fava Beans, Cucumbers, and Burrata",
    "url": "http://www.epicurious.com/recipes/food/views/flatbread-with-fava-beans-cucumbers-and-burrata"
}
