{
    "directions": [
        "Place shallot and mustard seeds in a small bowl or heatproof jar. Bring sugar, 1/4 cup vinegar, 1/2 teaspoon salt, and 2 tablespoons water to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour over shallot and mustard seeds; set aside.",
        "Pound pork chops between 2 layers of plastic wrap to 1/4–1/2\" thickness; season with salt and pepper. Heat 3 tablespoons oil in a large skillet over medium-high.",
        "Working in batches if needed, cook pork chops until browned and cooked through, about 3 minutes per side. Transfer to a large plate.",
        "Reduce heat to medium-low and add mustard, honey, remaining 2 tablespoons vinegar, and a splash of water to skillet. Bring to a simmer and cook, scraping up browned bits from bottom of skillet, until liquid is slightly reduced, about 1 minute. Season with salt and pepper. Remove pan sauce from heat.",
        "Place greens in a large bowl; season with salt and pepper. Drizzle warm sauce over greens and toss to coat. Drain shallot and mustard seeds.",
        "Serve pork chops with greens topped with pickled shallot and mustard seeds and drizzled with more oil."
    ],
    "ingredients": [
        "1 medium shallot, thinly sliced into rings",
        "2 teaspoons mustard seeds",
        "2 teaspoons sugar",
        "1/4 cup plus 2 tablespoons white wine vinegar",
        "1/2 teaspoon kosher salt, plus more",
        "4 bone-in pork rib chops (about 12 ounces each)",
        "Freshly ground black pepper",
        "3 tablespoons olive oil, plus more for drizzling",
        "1 tablespoon whole grain Dijon mustard",
        "2 teaspoons honey",
        "1 bunch mustard greens, tough stems trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Pork Chop",
        "Mustard Greens",
        "Shallot"
    ],
    "title": "Flattened Pork Chops with Greens and Mustard Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/flattened-pork-chops-with-greens-and-mustard-pan-sauce-51255250"
}
