{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "In large bowl, stir together the apples, brown sugar, granulated sugar, flour, salt and lemon juice. Set aside and see how long you can keep from sneaking a slice of apple.",
        "With a rolling pin, begin rolling out the Perfect Pie Crusts into large circles. Roll the dough from the center outward. Be gentle and patient, it'll take a little time to get the dough completely rolled out.",
        "If you think the bottom is really sticking to the surface below, use a nice, sharp spatula to loosen the dough and sprinkle some extra flour on top. Then flip it over to finish rolling. Remember to roll from the center in single, outward strokes, no back-and-forth rolling.",
        "Again with a spatula, loosen and lift the dough and carefully place the circles on large baking sheets.",
        "Place half the apple mixture on one crust and the other half on the other crust. Fold over the edges of each crust so that it covers 2 to 3 inches of the apple mixture. No need to be artistic - the more rustic the better. Dot the tops of the pies with chunks of the butter.",
        "Bake until the filling is golden and bubbly, 30 to 40 minutes. If the crust appears to brown too quickly, cover the edges with aluminum foil for the remaining baking time.",
        "Allow to cool slightly, then slice into wedges with a pizza cutter. Eat 'em on the go!",
        "Combine the flour and salt in a large bowl. Add in the butter and shortening. Using a pastry cutter, gradually work the butter and shortening into the flour until the mixture resembles tiny pebbles. This step should take 3 or 4 minutes.",
        "Lightly beat the egg with a fork, and then add it to the mixture. Next, add in the cold water and vinegar. Stir the mixture together until it's just combined, and then remove half the dough from the bowl."
    ],
    "ingredients": [
        "5 Granny Smith apples, peeled and sliced",
        "1/2 cup firmly packed brown sugar",
        "1/2 cup granulated sugar",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "Juice of 1/2 lemon",
        "1 recipe Perfect Pie Crust, recipe follows",
        "6 tablespoons butter",
        "3 cups all-purpose flour, plus more for dusting",
        "1 teaspoon salt",
        "1 1/2 sticks cold butter",
        "3/4 cup vegetable shortening",
        "1 egg",
        "5 tablespoons cold water",
        "1 tablespoon distilled white vinegar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Apple Pie",
        "Apple",
        "Fruit",
        "Pie Recipes",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Baking",
        "Healthy",
        "Low Sodium"
    ],
    "title": "Flat Apple Pie with Perfect Pie Crust",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/flat-apple-pie-with-perfect-pie-crust-recipe"
}
