{
    "directions": [
        "Stir together yeast and 1/3 cup warm water in a small bowl and let stand until foamy, about 5 minutes. (If mixture doesn't foam, start over with new yeast.)",
        "Stir together flour and salt with a fork in a large bowl. Make a well in center and add yeast mixture and oil. Stir in flour, then stir in as much of remaining 1/3 cup water as needed to form a firm, moist dough.",
        "Turn dough out onto a lightly floured surface and knead until smooth, shiny, and elastic, about 10 minutes.",
        "Put dough in cleaned large bowl and cover bowl. Let rise in a draft-free place at warm room temperature until doubled, about 1 hour.",
        "Punch down dough and divide into 2 pieces. Form each piece into a ball and let stand, covered, 10 minutes.",
        "Roll out each ball on a lightly floured surface with a rolling pin into an 8-inch round (about 1/4 inch thick; if dough resists rolling out, let stand 1 to 2 minutes, then continue).",
        "Preheat oven to 400F with rack in middle.",
        "Heat a heavy medium skillet or griddle over medium-low heat until very hot, about 10 minutes. Cook rounds 1 at a time, flipping frequently to avoid scorching and to aid even cooking, until golden, about 6 minutes per round. Stack rounds and wrap in a kitchen towel (not terry cloth) to keep soft while cooling.",
        "When rounds are cool, separate into halves by cutting into bread all around edge and gently pulling rounds apart. Sandwich cheese, arugula, prosciutto, and salt and pepper to taste between halves.",
        "Put stuffed breads on a baking sheet and bake until crisp and cheese has melted, about 8 minutes. Cut into wedges and serve warm."
    ],
    "ingredients": [
        "1/4 ounce fresh (cake) yeast or 13/4 teaspoons active dry yeast",
        "2/3 cup warm water (105-115°F), divided",
        "9 ounce unbleached bread flour (about 1 3/4 cups plus 2 tablespoons)",
        "3/4 teaspoon salt",
        "1/2 tablespoon olive oil",
        "1/4 pound thinly sliced Italian Fontina, Gruyère, or Emmental cheese",
        "2 cups baby arugula",
        "6 thin prosciutto slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Bake",
        "Kid-Friendly",
        "Lunch",
        "Spring",
        "Prosciutto",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Flatbread Stuffed with Cheese and Prosciutto (_Torta al Testo_ )",
    "url": "http://www.epicurious.com/recipes/food/views/flatbread-stuffed-with-cheese-and-prosciutto-em-torta-al-testo-em-242030"
}
