{
    "directions": [
        "Line a fine-mesh sieve with cheesecloth and set over a medium bowl. Place yogurt in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2 days if you want it slightly thicker. Discard excess liquid. (Or skip this step entirely and use 1 1/2 cups store-bought labneh instead.)",
        "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Working with 1 piece of dough at a time, gently stretch to about a 10x8\" oval. Grill over direct heat, turning and rotating as needed, until bread is stiff and both sides are lightly charred, about 3 minutes total. Move to indirect heat to keep warm while you grill remaining piece of dough.",
        "Transfer both flatbreads to a work surface and spread drained yogurt over. Top with trout, radishes, dill, and chives. Sprinkle with salt and pepper and serve with lemon wedges for squeezing over.",
        "Yogurt can be drained 1 week ahead. Cover and chill."
    ],
    "ingredients": [
        "3 cups plain whole-milk yogurt",
        "Vegetable oil (for grill)",
        "1/2 Garlic-Herb Naan or 1 pound store-bought pizza dough, room temperature, halved",
        "2 (5-ounce packages) smoked trout, coarsely flaked",
        "4 radishes, trimmed, thinly sliced on a mandoline",
        "1/4 cup coarsely chopped dill",
        "2 tablespoons sliced chives",
        "Flaky sea salt",
        "Freshly ground black pepper",
        "Lemon wedges (for serving)",
        "Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Flat Bread",
        "Appetizer",
        "Summer",
        "Fish",
        "Radish",
        "Dill",
        "Yogurt",
        "Trout",
        "Grill",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Flatbread With Smoked Trout, Radishes, and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/flatbread-with-smoked-trout-radishes-and-herbs"
}
