{
    "directions": [
        "Position a rack in the center of the oven and preheat to 350 degrees F. Line a baking sheet with a silicone baking mat or parchment paper.",
        "Pulse the almonds in a food processor until finely chopped, but not pasty. Stir together the nuts, flour, zest and salt in a large bowl.",
        "Put the sugar, cream, corn syrup and butter in a small saucepan. Cook over medium heat, stirring occasionally, until mixture comes to a rolling boil and sugar is completely dissolved. Continue to boil for 1 minute. Remove from heat and stir in the vanilla, then pour mixture into almond mixture and stir just to combine. Set aside until cool enough to handle, 30 minutes.",
        "Scoop rounded teaspoons (for 3-inch cookies) or rounded tablespoons (for 6-inch cookies) of batter and roll into balls. Place on prepared baking sheet, leaving about 3 to 4 inches between each cookie since they spread.",
        "Bake 1 pan at a time, until the cookies are thin and an even golden brown color throughout, rotating pans halfway through baking time, about 10 to 11 minutes. Cool on baking sheet for 5 minutes, then transfer to racks to cool. Repeat with remaining batter. Serve.",
        "Optional chocolate topping: Put the chocolate in a medium heatproof bowl. Bring a saucepan filled with 1 inch or so of water to a very low simmer; set the bowl over, but not touching, the water. Stir the chocolate occasionally until melted and smooth. (Alternatively, put the chocolate in a medium microwave-safe bowl. Melt at 50 percent power in the microwave until soft, about 1 minute. Stir, and continue heat until completely melted, about 1 to 2 minutes more.)",
        "For sandwiches: Drop about 1/2 teaspoon chocolate onto on the flat side of half of the cookies and press together with remaining halves. Return to rack and let chocolate set.",
        "For chocolate decor: Drizzle melted chocolate over Florentines as desired. Set aside at room temperature until chocolate is set."
    ],
    "ingredients": [
        "1 3/4 cups sliced, blanched almonds (about 5 ounces)",
        "3 tablespoons all-purpose flour",
        "Finely grated zest of 1 orange (about 2 tablespoons)",
        "1/4 teaspoon fine salt",
        "3/4 cup sugar",
        "2 tablespoons heavy cream",
        "2 tablespoons light corn syrup",
        "5 tablespoons unsalted butter",
        "1/2 teaspoon pure vanilla extract",
        "2 to 4 ounces semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Christmas Cookie",
        "Christmas",
        "Holiday",
        "Baking",
        "European Recipes",
        "Sugar Cookie",
        "Sugar",
        "Nut Recipes",
        "Dairy Recipes",
        "Fruit",
        "Orange Recipes",
        "Corn Recipes",
        "Vegetable"
    ],
    "title": "Florentines (Italy)",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/florentines-italy-recipe"
}
