{
    "directions": [
        "Place beans in large pot. Add enough cold water to cover beans by 3 inches. Let stand overnight.",
        "Drain beans well. Return to pot. Add 16 cups water, 5 unpeeled garlic cloves, and celery stalk. Bring mixture to boil; reduce heat to low and simmer 1 hour 15 minutes, stirring occasionally.",
        "Meanwhile, heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add onions and 3 chopped garlic cloves and sauté until golden brown, about 10 minutes. Add tomatoes with juices, rosemary, sage, and celery salt to mixture, stirring to combine.",
        "Add vegetable mixture to bean mixture in pot. Simmer soup until beans are tender, about 45 minutes.",
        "Cook pasta in another large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well. Add cooked pasta and remaining 3 tablespoons olive oil to soup, stirring to combine. Thin soup with more water, if desired. Season soup to taste with salt and pepper and serve."
    ],
    "ingredients": [
        "1 16-ounce package dried Great Northern beans (about 2 1/2 cups)",
        "16 cups (or more) water",
        "5 garlic cloves, unpeeled, plus 3 garlic cloves, peeled, chopped",
        "1 celery stalk, cut in half",
        "5 tablespoons olive oil",
        "2 medium onions, chopped (about 3 cups)",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon chopped fresh sage",
        "1/2 teaspoon celery salt",
        "3/4 cup tubettini or elbow macaroni (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "Onion",
        "Pasta",
        "Tomato",
        "Vegetarian",
        "Fall",
        "Winter",
        "Vegan"
    ],
    "title": "Florentine White Bean Soup with Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/florentine-white-bean-soup-with-pasta-107253"
}
