{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "Wring defrosted spinach dry in a clean kitchen towel. Place turkey in a bowl and make a well in the middle of it. Add the spinach, all but 3 tablespoons of the onion, all of the garlic, 1 large egg, about 1/4 cup milk, bread crumbs, grated Parmesan, salt and pepper. Mix well. Form into 12 large balls and drizzle with extra-virgin olive oil. Arrange on a nonstick cookie sheet and roast 20 minutes, or until cooked through.",
        "While balls are in the oven, heat a small sauce pot over medium heat. Add a drizzle of extra-virgin olive oil and 2 tablespoons butter. Melt butter, add remaining finely chopped onion and cook 2 minutes then whisk in flour. Cook flour 1 minute, then whisk in 1 1/2 cups milk and 1 cup stock. Bring liquid up to a boil then stir in shredded provolone or blended Italian cheeses. Season the sauce with salt, pepper and nutmeg, turn heat to lowest setting.",
        "Place 3 balls on dinner plates and top with sauce, garnish with parsley."
    ],
    "ingredients": [
        "1 box frozen spinach, defrosted in the microwave",
        "1 1/3 pound (1 package) ground turkey breast",
        "1 medium onion, finely chopped, divided",
        "3 cloves garlic, chopped",
        "1 large egg",
        "1 3/4 cups milk, divided",
        "3/4 cup bread crumbs, 3 handfuls",
        "1/2 cup grated Parmigiano-Reggiano, 2 palm fulls",
        "Coarse salt and black pepper",
        "Extra-virgin olive oil, for drizzling",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup chicken stock",
        "1 (10-ounce) sack shredded provolone or blend of Italian cheeses, available on dairy aisle",
        "1/2 teaspoon freshly grated nutmeg, eyeball it",
        "1/4 cup parsley leaves, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Baking",
        "American",
        "Meatballs",
        "Spinach",
        "Vegetable",
        "Poultry Recipes",
        "Turkey Recipes",
        "Cheese",
        "Provolone Recipes",
        "Kid-Friendly"
    ],
    "title": "Florentine Meatballs",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/florentine-meatballs-recipe"
}
