{
    "directions": [
        "Prepare the dough by sprinkling the yeast onto 1/4 cup of warm water; set aside to soften for 5 minutes. Stir the potato flakes, milk, 1/2 cup water, white sugar, and salt together in a saucepan over medium heat until the sugar has dissolved and the mixture reaches 110 degrees F (63 degrees C). Beat the eggs in a mixing bowl until smooth, then whisk in the warm milk mixture and yeast. Stir in the flour and margarine until a dough forms. Turn out onto a floured work surface, and knead until smooth and satiny, 10 to 20 minutes.",
        "Place the dough into a greased bowl, and turn over to grease both sides of the dough. Cover, and set in a warm spot to rise until doubled, about 1 hour. Punch dough down, and knead again briefly to push out the air. Cover, and let rest 10 minutes. Meanwhile, stir 1/3 cup softened butter with the brown sugar and ground cinnamon until blended. Feel free to make extra if you like more filling in your cinnamon rolls.",
        "Once the dough has rested, turn onto a floured surface and divide in two. Stretch and roll one half into a 10x14-inch rectangle. Spread half of the cinnamon filling onto the dough, and sprinkle with half of the raisins. Roll up the dough from the narrow end, and pinch the edges together to seal. Repeat with the remaining dough and filling. Grease two baking sheets, and cut each roll into 12 pieces. Arrange the cinnamon rolls onto the prepared baking sheets. Cover, and let rise in a warm place until nearly doubled, 45 minutes to 1 hour.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Bake the cinnamon rolls in the preheated oven until light golden brown, 18 to 20 minutes. Remove from the oven, and allow to cool. Prepare the glaze by stirring the confectioners' sugar with 1 tablespoon butter, vanilla extract, and 2 tablespoons warm water until smooth. Use additional water if needed to make a pourable glaze. Pour the glaze over the cinnamon rolls while still warm."
    ],
    "ingredients": [
        "Dough:",
        "2 (.25 ounce) packages active dry yeast",
        "1/4 cup warm water (110 degrees F (43 degrees C))",
        "1/2 cup instant potato flakes",
        "1 1/2 cups milk",
        "1/2 cup water",
        "1/3 cup white sugar",
        "1 1/2 teaspoons salt",
        "2 eggs",
        "6 cups all-purpose flour",
        "1/2 cup margarine, softened",
        "Filling:",
        "1/3 cup butter, softened",
        "3/4 cup brown sugar",
        "1 1/2 tablespoons ground cinnamon",
        "1/2 cup raisins (optional)",
        "Glaze:",
        "1 1/2 cups unsifted confectioners' sugar",
        "1 tablespoon butter, softened",
        "1/8 teaspoon vanilla extract",
        "2 tablespoons warm water, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Florence's Famous Cinnamon Rolls",
    "url": "http://allrecipes.com/recipe/218495/florences-famous-cinnamon-rolls/"
}
