{
    "directions": [
        "Position the rack in the center of the oven and preheat the oven to 350 degrees F.",
        "Line a heavy large baking sheet with parchment paper. Stir the almonds, flour and zest in a medium bowl. Stir the sugar, butter, cream, and honey in a heavy medium saucepan over medium heat until the sugar dissolves. Bring the mixture to a boil. Remove the pan from the heat. Stir in the almond mixture. Cool the batter for 20 minutes, stirring occasionally. Using 2 teaspoons of batter for each cookie, spoon 8 mounds of the batter onto the prepared baking sheet, spacing evenly apart (the cookies will spread). Flatten the batter slightly with your finger.",
        "Bake the cookies until they are lacy and golden brown, about 10 minutes. Gently slide the parchment paper with the cookies onto a rack and cool completely. Transfer the cookies to paper towels. Repeat with the remaining batter, lining the baking sheets with clean parchment for each batch. (The cookies can be made up to this point 2 months ahead. Cool completely, then store airtight in the freezer. Defrost before continuing.)",
        "Stir the chocolate in a bowl set over a saucepan of simmering water until the chocolate melts. Spread the melted chocolate over the bottom of 1 cookie. Top with a second cookie, bottom side down, pressing lightly to adhere. Repeat with the remaining cookies and chocolate."
    ],
    "ingredients": [
        "2 cups sliced almonds, chopped",
        "2 tablespoons all-purpose flour",
        "2 teaspoons grated orange zest",
        "3/4 cup sugar",
        "1/2 cup (1 stick) butter, cut into pieces",
        "1/3 cup whipping cream",
        "2 tablespoons honey",
        "8 ounces bittersweet or semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "European Recipes",
        "Cookie",
        "Nut Recipes",
        "Kid-Friendly"
    ],
    "title": "Florentines",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/florentines-recipe2"
}
