{
    "directions": [
        "Preheat the oven to 400°F.",
        "Pierce the softest eye of the coconut with a metal skewer or small screwdriver and drain any liquid into a small bowl to sample—you should have about 1/2 cup liquid. (If the liquid tastes sweet, the coconut is fresh; if it tastes oily, the coconut is rancid and should be discarded.)",
        "Bake the coconut for 15 minutes then transfer to a folded towel on a work surface. Using the back of a knife or a cleaver, crack the shell open. Break the shell into large pieces and use a strong knife to carefully remove the flesh from the shell. Using a vegetable peeler, remove the brown skin then shave the coconut into thin strips—you should have about 4 cups shaved coconut. Reserve 2 cups for the ambrosia salad; wrap and freeze the remainder for another use. DO AHEAD: Coconut shavings can stored, in an airtight container, in the refrigerator up to 1 week or frozen up to 3 months.",
        "Using a serrated knife, cut the peel off the grapefruits and oranges. Cut the fruit crosswise into 1/2-inch-thick rounds then cut the rounds into bite-size pieces. Transfer to a large bowl; add the pineapple, kumquats, pomegranate seeds, 2 cups coconut shavings, 1/2 cup coconut juice, and the apple juice, and toss gently to combine. Serve at room temperature or chilled. DO AHEAD: Florida Ambrosia Salad can be prepared ahead and stored, covered, in the refrigerator up to 8 hours."
    ],
    "ingredients": [
        "1 coconut",
        "3 white pink grapefruits",
        "3 navel oranges",
        "1 pineapple, peeled, cored, and cut into 1/2-inch chunks",
        "1 pint kumquats, cut on a diagonal into 1/4-inch-thick slices",
        "1/2 cup pomegranate seeds",
        "1/2 cup unsweetened apple juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit Juice",
        "Citrus",
        "Fruit",
        "Dessert",
        "Christmas",
        "Vegetarian",
        "Buffet",
        "Grapefruit",
        "Tropical Fruit",
        "Coconut",
        "Pineapple",
        "Vegan",
        "Kumquat",
        "Pomegranate",
        "Apple Juice",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Florida Ambrosia Salad",
    "url": "http://www.epicurious.com/recipes/food/views/florida-ambrosia-salad-51126830"
}
