{
    "directions": [
        "Preheat oven to 350°F. Finely chop nuts in processor. Add ground cookies, sugar and butter and blend in using on/off turns until moist crumbs form. Press mixture firmly onto bottom and sides of 9 1/2-inch deep-dish glass pie dish. Bake crust until golden, about 10 minutes. Cool.",
        "Boil grapefruit juice and 1/4 cup sugar in heavy medium saucepan over high heat until reduced to 3/4 cup, about 15 minutes. Meanwhile, sprinkle gelatin over lime juice and let stand 10 minutes. Add gelatin mixture, white chocolate and 1/4 cup cream to grapefruit mixture and whisk over low heat until white chocolate and gelatin melt and mixture is smooth. Pour into large bowl. Refrigerate until cool but not set, whisking occasionally and scraping down sides of bowl with rubber spatula, about 2 hours.",
        "Beat cream and sugar to stiff peaks. Spoon whipped cream into pastry bag fitted with large star tip. Pipe 15 rosettes of cream around edge of pie. Place 1 lime slice rounded side up between each rosette. Fill center with chocolate curls if desired. (Can be prepared 4 hours ahead. Refrigerate.)"
    ],
    "ingredients": [
        "1 7-ounce jar roasted macadamia nuts",
        "3/4 cup ground vanilla wafer cookies",
        "1/4 cup firmly packed dark brown sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "2 cups fresh pink grapefruit juice",
        "1/4 cup plus 1 tablespoon sugar",
        "1 1/4 teaspoons unflavored gelatin",
        "1/4 cup fresh lime juice",
        "9 ounces imported white chocolate (such as Lindt or Callebaut), chopped",
        "1/4 cup whipping cream",
        "1 1/4 cups chilled whipping cream",
        "1 cup chilled whipping cream",
        "2 tablespoons sugar",
        "7 thin lime slices, cut in half",
        "8 ounces imported white chocolate (such as Callebaut), shaved into curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Grapefruit",
        "Lime",
        "Macadamia Nut",
        "Fall",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Florida Citrus Pie",
    "url": "http://www.epicurious.com/recipes/food/views/florida-citrus-pie-2651"
}
