{
    "directions": [
        "Preheat oven to 325 degrees F. Spray a 9 by 2-inch spring form pan with nonstick spray.",
        "Put the chocolate, butter, and salt in a large microwave safe bowl. Melt in the microwave on 75 percent power for 2 minutes. Stir and microwave again until completely melted, about 2 minutes more. Alternatively, put the chocolate and butter in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl on the pan without touching the water. Stir occasionally until melted.",
        "Beat the eggs and sugar with a standing or handheld mixer until light and thickened, about 8 to 10 minutes. Fold the melted chocolate into the whipped eggs until evenly combined.",
        "Pour the batter into the prepared pan and bake until a toothpick inserted into the center comes out wet but not gooey, about 1 hour and 25 minutes. Remove cake from the oven and cool on a rack.",
        "When ready to serve remove ring from spring form mold. Dust cake with confectioners' sugar or cocoa powder. Serve with whipped cream or ice cream if desired.",
        "Beat the cream and vanilla in a chilled non-reactive bowl with a whisk or an electric mixer just until they hold a loose peak. (Lift the beater from the cream and look at the shape of the peak at the end of the whisk; it should hold a lazy curve.) Sift the sugar over the cream and continue to beat just until it holds a soft peak. Take care not to over beat the cream or it will be look curdy. Serve, or refrigerate covered for up to 4 hours."
    ],
    "ingredients": [
        "12 ounces semisweet or bittersweet chocolate, chopped",
        "12 tablespoons (1 1/2 sticks) unsalted butter",
        "1/4 teaspoon fine salt",
        "6 large eggs, room temperature",
        "1 1/2 cups granulated sugar",
        "Confectioners' sugar and/or cocoa powder, for dusting",
        "Serving suggestion: Really Vanilly Whipped Cream, recipe follows, or ice cream",
        "1 cup (1/2 pint) heavy or whipping cream",
        "2 teaspoons pure vanilla paste or extract",
        "2 teaspoons confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Mixer Recipes",
        "Sugar",
        "Egg Recipes",
        "Gluten Free",
        "Holiday"
    ],
    "title": "Flourless Chocolate Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/flourless-chocolate-cake-recipe"
}
