{
    "directions": [
        "Heat oven to 350 degrees F.",
        "Wrap outside of 9-inch springform pan with aluminum foil. Line bottom of pan with parchment paper. Butter parchment paper and sides of pan.",
        "Combine 1 tablespoon instant espresso powder and 1 tablespoon hot water in bowl; set aside.",
        "Place butter and chocolate in 2-quart nonstick saucepan. Cook over medium heat, stirring occasionally, until melted. Remove from heat; stir in espresso mixture. Add sugar; beat with whisk until combined. Add 1 egg at a time, whisking after each addition. Whisk in cocoa until well mixed.",
        "Pour cake into prepared pan. Place springform pan into center of large roasting pan. Place roasting pan in oven. Fill space around springform pan slowly with hot water, to about 1 inch up sides of pan. Bake 40-45 minutes or until center of cake is set.",
        "Remove springform pan from roasting pan. Place onto cooling rack; remove foil. Cool completely.",
        "Combine 1 teaspoon instant espresso powder and 1 teaspoon hot water in bowl; set aside.",
        "Beat chilled whipping cream and 1/4 cup sugar in chilled bowl at high speed, scraping bowl often, until stiff peaks form. Stir in espresso mixture.",
        "Combine powdered sugar and edible glitter in bowl.",
        "Remove sides from springform pan; place cake onto serving plate. Place snowflake stencil on top of cake (see Recipe Tips). Lightly dust top of cake with powdered sugar mixture. Carefully remove stencil.",
        "Serve with espresso whipped cream."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/4228078.jpg",
    "ingredients": [
        "Cake:",
        "1 tablespoon instant espresso powder",
        "1 tablespoon hot water",
        "3/4 cup LAND O LAKES® Unsalted Butter",
        "6 ounces high-quality bittersweet chocolate baking bar, broken into small pieces",
        "1 cup sugar",
        "3 LAND O LAKES® Eggs",
        "1/2 cup unsweetened cocoa powder",
        "Espresso Whipped Cream:",
        "1 teaspoon instant espresso powder",
        "1 teaspoon hot water",
        "1 cup LAND O LAKES® Heavy Whipping Cream, chilled",
        "1/4 cup sugar",
        "2 tablespoons powdered sugar",
        "1/8 teaspoon extra fine edible glitter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Flourless Chocolate Espresso Cake",
    "url": "http://allrecipes.com/recipe/247003/flourless-chocolate-espresso-cake/"
}