{
    "directions": [
        "Combine brandy and dried cherries in 4-cup glass container with lid. Cover and let soak at room temperature 1 week.",
        "Bring 1 cup water and sugar to boil in medium saucepan, stirring until sugar dissolves. Remove from heat and cool syrup. Drain brandy from cherries (reserve brandy for another use). Add sugar syrup to cherries and stir to blend. Let soak at room temperature at least 2 days. DO AHEAD Can be made 2 weeks ahead. Store covered at room temperature.",
        "Position rack in center of oven and preheat to 350°F. Butter 10-inch-diameter springform pan with 2 3/4-inch-high sides. Line bottom of pan with parchment paper round. Place chocolate and 1 1/4 cups butter in medium metal bowl. Set bowl over saucepan of simmering water; stir until mixture is melted and smooth. Remove bowl from over water; cool to lukewarm, about 10 minutes.",
        "Using electric mixer, beat egg yolks and 1/2 cup sugar in large bowl until very thick and pale yellow in color, about 5 minutes. Beat in vanilla and salt. Gently fold chocolate mixture into yolk mixture. Using clean dry beaters, beat egg whites and remaining 6 tablespoons sugar in another large bowl until peaks form. Fold 1/3 of beaten whites into chocolate mixture. Fold in remaining whites in 2 additions. Transfer batter to prepared pan.",
        "Bake cake until tester inserted into center comes out with moist crumbs attached, about 45 minutes (cake will be puffed and soufflé-like while baking). Cool cake in pan on rack 15 minutes (cake will fall in center). Run knife around cake sides to loosen; press edge of cake down to make level with center. Remove pan sides and cool cake completely. DO AHEAD Can be made 1 day ahead. Cover and store at room temperature.",
        "Combine chocolate and cream in medium metal bowl. Set bowl over saucepan of simmering water and stir until chocolate is melted and mixture is smooth. Remove bowl from over water; let stand until ganache cools slightly but is still pourable, about 5 minutes.",
        "Place cooled cake on rack set over rimmed baking sheet. Pour 1/2 cup ganache over top of cake. Using offset spatula, quickly spread ganache over top and sides of cake. Freeze cake 3 minutes. Pour remaining ganache over top of cake. Working quickly but gently and grasping pan bottom and rack together, slightly tilt rack with cake from side to side, allowing ganache to flow evenly over top and down sides of cake; smooth sides with offset spatula. Press hazelnuts onto sides of cake to adhere. Chill cake until ganache is set, about 1 hour. DO AHEAD Can be made 1 day ahead. Cover with cake dome and keep refrigerated. Let stand at room temperature 45 minutes before serving.",
        "Cut cake into wedges. Garnish with whipped cream and spoon brandied cherries alongside."
    ],
    "ingredients": [
        "1 750-ml bottle brandy",
        "1 1/2 cups dried tart cherries",
        "1 cup water",
        "1 cup sugar",
        "10 ounces bittersweet or semisweet chocolate, chopped",
        "1 1/4 cups (2 1/2 sticks) unsalted butter, diced",
        "10 large egg yolks",
        "1/2 cup plus 6 tablespoons sugar",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "9 large egg whites",
        "8 ounces bittersweet or semisweet chocolate, chopped",
        "1 cup heavy whipping cream",
        "1 1/2 cups hazelnuts, toasted, coarsely chopped",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Flourless Chocolate Cake with Toasted Hazelnuts and Brandied Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/flourless-chocolate-cake-with-toasted-hazelnuts-and-brandied-cherries-237344"
}
