{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch-diameter springform pan. Line bottom of pan with parchment paper round. Wrap outside of pan tightly with 3 layers of heavy-duty foil. Combine chocolate and butter in medium metal bowl; set bowl over saucepan of simmering water. Whisk until mixture is melted and smooth. Remove bowl from over water.",
        "Whisk eggs, golden brown sugar, and 1/4 cup Frangelico in large bowl to blend. Add chocolate mixture and whisk until smooth. Stir in ground hazelnuts and 1 teaspoon coarse kosher salt. Transfer batter to prepared pan. Place springform pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of springform pan. Place in oven and tent springform pan loosely with foil. Bake until cake is set in center and top is dry to touch, about 1 1/2 hours (top of cake will remain shiny). Remove cake from roasting pan; remove foil from top and outside of pan. Cool cake in pan on rack. Chill cake until cold, about 3 hours. DO AHEAD: Can be made 3 days ahead. Cover and keep chilled.",
        "Using electric mixer, beat whipping cream and remaining 1/4 cup Frangelico in medium bowl until soft peaks form. Run knife around pan sides to loosen cake. Release pan sides. Cut cake into wedges. Transfer to plates. Top with whipped cream; sprinkle with chopped toasted hazelnuts."
    ],
    "ingredients": [
        "12 ounces 60% cacao bittersweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into chunks",
        "6 large eggs",
        "1 cup (packed) golden brown sugar",
        "1/2 cup Frangelico or other hazelnut liqueur, divided",
        "1 cup finely ground hazelnuts (ground in processor; about 5 ounces)",
        "1 teaspoon coarse kosher salt",
        "1 cup chilled heavy whipping cream",
        "Chopped toasted hazelnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Frangelico",
        "Chill",
        "Hazelnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Flourless Chocolate-Hazelnut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/flourless-chocolate-hazelnut-cake-241088"
}
