{
    "directions": [
        "Preheat oven to 350°F. Brush bottom of 10-inch-diameter springform pan generously with margarine. Blend almonds and 1/4 cup sugar in processor until almonds are finely ground. Add chocolate; blend until chocolate is finely ground, scraping sides and bottom of bowl occasionally.",
        "Whisk cocoa, orange juice, and orange peel in small bowl until smooth. Combine egg yolks and 1/2 cup plus 2 tablespoons sugar in large bowl. Scrape in seeds from vanilla bean. Using electric mixer, beat until yolk mixture is very thick, about 4 minutes. Beat in cocoa mixture. Fold in ground-almond mixture. Using clean dry beaters, beat egg whites and salt in another large bowl until soft peaks form. Gradually add 2 tablespoons sugar, beating until whites are stiff but not dry. Fold whites into chocolate batter in 3 additions. Transfer to prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 40 minutes. Cool cake completely in pan on rack. (Can be made 1 day ahead. Cover with foil; store at room temperature.)",
        "Cut around cake in pan; release sides. Cut cake into wedges. Transfer to plates. Place scoop of sorbet alongside."
    ],
    "ingredients": [
        "Pareve kosher-for-Passover margarine, melted",
        "1 1/4 cups whole almonds (6 to 7 ounces)",
        "1 cup sugar, divided",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/2 cup unsweetened cocoa powder",
        "1/2 cup orange juice",
        "2 teaspoons grated orange peel",
        "6 large eggs, separated",
        "1 vanilla bean, split lengthwise",
        "1/4 teaspoon salt",
        "Chocolate-Orange Sorbet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Passover",
        "Orange",
        "Almond",
        "Vanilla",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Flourless Chocolate-Orange Almond Cake",
    "url": "http://www.epicurious.com/recipes/food/views/flourless-chocolate-orange-almond-cake-109404"
}
