{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Butter the bottoms and sides of two 9-inch round cake pans; dust with flour, then tap out the excess.",
        "Whisk together the flour, baking powder and salt in a medium bowl; set aside.",
        "Beat the butter, granulated sugar and oil in a large bowl with an electric mixer on medium-high speed until light in color and fluffy, about 5 minutes. Beat in the eggs, 1 at a time, then beat in the vanilla until combined.",
        "Alternate folding the flour mixture and milk into the batter with a spatula, adding the flour in 3 additions and the milk in 2, starting and ending with the flour, until just smooth. Add the sprinkles and fold 3 or 4 times until just blended to prevent the colors from bleeding too much. Divide the batter evenly between the prepared pans.",
        "Bake the cakes on the same oven rack, rotating the pans about halfway if they seem to be browning unevenly, until golden on top and the centers spring back to the touch, 35 to 40 minutes. Let cool in the pans about 10 minutes, then turn out onto cooling racks and let cool completely.",
        "For the frosting: While the cakes cool, beat the butter and salt in a large bowl with an electric mixer on medium speed until smooth. Gradually beat in the confectioners' sugar. Once it's all been added, increase the speed to medium-high, and beat until white and fluffy. Beat in the vanilla until blended. Add 2 tablespoons of the milk, and beat to incorporate. Beat in the remaining milk, 1 tablespoon at a time (the frosting will be spreadable but not runny).",
        "To assemble: Place 1 cake layer right-side up on a cake plate or stand, and spread with 1 cup of the frosting. Top with the second cake layer. Frost the top and sides of the cake with the remaining frosting. Decorate the top with additional sprinkles.",
        "The cake layers can be made a day ahead; wrap the cooled layers in plastic and aluminum foil and store at room temperature overnight. You can also assemble and frost the cake the day before serving; let it stand at room temperature overnight, covered by a large bowl or cake dome (if your kitchen is very hot, chill the cake and let it stand at room temperature for at least 1 hour before serving)."
    ],
    "ingredients": [
        "1 stick (8 tablespoons) unsalted butter, at room temperature, plus more for the pans",
        "2 3/4 cups all-purpose flour, plus more for the pans (See Cook's Note)",
        "1 teaspoon baking powder",
        "1 teaspoon fine salt",
        "2 cups granulated sugar",
        "1/2 cup vegetable oil",
        "5 large eggs, at room temperature",
        "1 tablespoon pure vanilla extract",
        "1 cup milk",
        "3 tablespoons rainbow sprinkles or jimmies, plus more for decorating",
        "3 sticks (1 1/2 cups) unsalted butter, at room temperature",
        "Pinch fine salt",
        "3 1/4 cups confectioners' sugar",
        "2 teaspoons pure vanilla extract",
        "1/4 cup milk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Cake"
    ],
    "title": "Fluffy Confetti Birthday Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/fluffy-confetti-birthday-cake"
}
