{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line 12 muffin cups with paper liners.",
        "Sift flour, baking powder, baking soda, and salt together in a bowl.",
        "Beat brown sugar, peanut butter, and 2 tablespoons butter together in a bowl using an electric mixer on medium speed until creamy, about 1 minute. Beat banana, eggs, and 1 1/2 teaspoons vanilla extract into creamed peanut butter mixture until incorporated, about 1 minute.",
        "Beat flour mixture, alternating with 1/2 cup milk, into creamed peanut butter mixture until batter is well combined; pour into muffin cups.",
        "Bake in the preheated oven until a toothpick inserted in the center of a cake comes out with moist crumbs, 20 to 23 minutes. Cool cupcakes in the tin for 15 minutes before transferring to a wire rack to cool completely.",
        "Beat marshmallow fluff, 2 tablespoons butter, shortening, and 1 teaspoon vanilla extract together in a bowl using an electric mixer until smooth. Gradually beat confectioners' sugar, alternating with 2 tablespoons milk, into marshmallow mixture until desired thickness is reached; chill in refrigerator until thickened, about 15 minutes.",
        "Spread frosting over cupcakes or pipe through a pastry bag."
    ],
    "ingredients": [
        "Cupcake:",
        "1 2/3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 cup firmly packed light brown sugar",
        "5 tablespoons creamy natural peanut butter",
        "2 tablespoons unsalted butter, softened",
        "3/4 cup mashed ripe bananas",
        "2 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup milk",
        "Frosting:",
        "3/4 cup marshmallow fluff",
        "2 tablespoons unsalted butter, softened",
        "2 tablespoons vegetable shortening",
        "1 teaspoon vanilla extract",
        "1 1/2 cups confectioners' sugar, or as needed",
        "2 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fluffernutter Cupcakes",
    "url": "http://allrecipes.com/recipe/237036/fluffernutter-cupcakes/"
}
