{
    "directions": [
        "Arrange rack in middle of oven; preheat to 400°F. Whisk buttermilk powder, baking powder, salt, and sugar in a large bowl until evenly distributed and no lumps remain. Add 2 cups water and whisk to combine. Add lard and butter.",
        "Add 2 cups flour and mix with a fork until mixture resembles porridge. Using fork, press fats against side of bowl to cut into smaller, irregular, flattened pieces.",
        "Fold in remaining 1 1/2–2 cups flour by the half cup with fork until a wet dough forms. Turn out dough onto a well-floured surface. Dust top of dough with more flour. Gently fold dough into itself until it feels like a pillow and is no longer sticky. Using a floured bench scraper or butter knife, divide dough into 12 equal pieces.",
        "Working with 1 piece at a time, dip cut sides in flour and gently roll into a ball with your hands. Nestle each ball side by side in a large cast-iron skillet or on a rimmed baking sheet. Bake biscuits until lightly browned, 25–30 minutes. Brush with melted butter, if desired. Serve with honey butter.",
        "Combine honey, butter, and salt in a medium bowl. Mash with fork until just combined but not emulsified."
    ],
    "ingredients": [
        "1/2 cup buttermilk powder",
        "3 tablespoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "Pinch of sugar",
        "6 tablespoons lard or bacon fat, cut into pieces and slightly softened",
        "6 tablespoons unsalted butter, cut into pieces and slightly softened, plus more, melted, if desired",
        "3 1/2–4 cups all-purpose flour, divided, plus more",
        "1/2 cup flavorful honey (such as buckwheat)",
        "1/4 cup unsalted butter, slightly softened",
        "1/2 teaspoon sea salt or kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Biscuit",
        "Bake",
        "Breakfast",
        "New Year's Day",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fluffy Cathead Biscuits With Honey Butter",
    "url": "http://www.epicurious.com/recipes/food/views/fluffy-cathead-biscuits-with-honey-butter"
}
