{
    "directions": [
        "Place onion slices in a medium bowl. Bring vinegar, 1/3 cup sugar, 2 tsp. salt, and 1/2 cup water to a simmer in a small saucepan over medium-high heat and cook, stirring occasionally, until sugar is dissolved, about 5 minutes. Immediately pour brine over onion and let cool. Cover and chill at least 1 hour.",
        "Meanwhile, rinse rice until water runs clear (this removes surface starch and keeps rice from getting gummy). Combine rice, coconut cream, and 1 1/2 cups water in a medium saucepan, season lightly with salt, and bring to a boil. Reduce heat to low, cover, and cook until rice is tender, 15–18 minutes. Remove from heat and let sit (keep covered) 10 minutes; fluff coconut jasmine rice with a fork. Keep warm.",
        "Mix jalapeño, soy sauce, lime zest, lime juice, oil, ginger, garlic, and remaining ½ tsp. sugar in a medium bowl. Add fluke, macadamia nuts, and drained pickled red onion to jalapeño-ginger dressing; season with salt and toss gently to combine. Add cilantro and toss again.",
        "Divide rice among bowls and top with fluke mixture and pieces of nori.",
        "Red onion can be pickled 5 days ahead; keep chilled. Dressing can be made 1 day ahead; cover and chill."
    ],
    "ingredients": [
        "1 medium red onion, thinly sliced",
        "1 cup unseasoned rice vinegar",
        "1/3 cup plus 1/2 teaspoon sugar",
        "2 teaspoons kosher salt, plus more",
        "11/2 cups jasmine rice",
        "3/4 cup unsweetened coconut cream (from a 14-ounce can)",
        "1 large jalapeño, thinly sliced",
        "3 tablespoons white soy sauce",
        "1 1/2 teaspoons finely grated lime zest",
        "2 tablespoons fresh lime juice",
        "1 1/2 teaspoons toasted sesame oil",
        "1/2 teaspoon finely grated peeled ginger",
        "1 garlic clove, finely grated",
        "12 ounces fluke, cut into 3/4x1/4-inch pieces",
        "1/2 cup coarsely chopped unsalted, roasted macadamia nuts or cashews",
        "1/2 cup torn cilantro leaves with tender stems",
        "1 toasted nori sheet, torn into bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Raw",
        "Cilantro",
        "Coconut",
        "Rice",
        "Macadamia Nut",
        "Lime",
        "Jalapeño",
        "Dinner",
        "Lunch",
        "Seafood",
        "Hawaii",
        "Onion"
    ],
    "title": "Fluke Poke With Coconut Rice and Pickled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/fluke-poke-with-coconut-rice-and-pickled-onions"
}
