{
    "directions": [
        "Place flour into work bowl of a large stand mixer; add both amounts of water, 1 tablespoon olive oil, and 3/4 teaspoon salt. Mix dough using stand mixer fitted with dough hook on low speed until it forms a ball on the dough hook, 5 to 6 minutes. Dough should be soft and elastic but not sticky.",
        "Turn dough out onto a work surface and form a ball. Cover with plastic wrap and let stand on counter at room temperature for 1 hour.",
        "Lightly grease the quarter-sheet baking pan with 1 teaspoon olive oil; sprinkle with cornmeal. Dust a work surface lightly with flour.",
        "Move oven rack to center position. Preheat oven to 500 degrees F (260 degrees C).",
        "Unwrap dough and cut into quarters. Pat each quarter out on the floured work surface to a roughly rectangular shape. Roll 1 piece of dough out to about 3/8 inch thick, retaining rough rectangle shape, until dough is about 6x8 inches. Pick up dough with well-floured hands and gently stretch it, rotating as you go, until dough is almost large enough to fit over the prepared sheet pan. Pull and stretch dough so it overlaps the edge of the pan by about 1/2 inch and fasten dough edges to sheet pan edges; dough will be thin and membrane-like.",
        "Drop about 6 tablespoons of crescenza-stracchino cheese onto the stretched dough, spreading the dollops out evenly. Roll out another piece of dough as before, stretching to fit over the first dough sheet and cheese. Stretch, pull, and seal dough as before so the cheese is enclosed between the 2 sheets of dough.",
        "Roll a rolling pin over the edges of the dough to simultaneously seal the flatbread edges and cut the overlapping edges off. Roll the overlapping dough edges away from the pan so flatbread falls into the prepared pan. Press flatbread edges flat and roll slightly if desired to be sure the edges are fully sealed. Discard rolled-off dough edges.",
        "Pinch a small bit of the top dough between your thumb and forefinger and gently tear a small hole in the dough; repeat 2 or 3 more times to make a few tears in the top layer.",
        "Drizzle flatbread lightly with 2 teaspoons olive oil; sprinkle with 1/4 teaspoon coarse sea salt.",
        "Bake in the preheated oven until flatbread has many browned, blistered spots on top, bread has inflated, and the top is crusty, 6 to 7 minutes. Repeat steps to make a second flatbread using second half of dough as before. Drizzle 2nd flatbread with remaining 2 teaspoons olive oil and 1/4 teaspoon coarse sea salt. Bake second bread as before. Cut in breads into quarters and serve warm."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 cup cold water",
        "2 tablespoons cold water",
        "1 tablespoon extra-virgin olive oil",
        "3/4 teaspoon fine salt",
        "1 quarter-sheet baking pan",
        "1 teaspoon extra-virgin olive oil",
        "1 teaspoon cornmeal",
        "12 tablespoons crescenza-stracchino cheese, divided",
        "4 teaspoons extra-virgin olive oil, divided",
        "1/4 teaspoon coarse sea salt, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Focaccia di Recco",
    "url": "http://allrecipes.com/recipe/235857/focaccia-di-recco/"
}
