{
    "directions": [
        "Place warm water in processor. Add sugar. Sprinkle yeast over. Let stand until yeast dissolves and mixture is foamy, about 8 minutes. Add 1 tablespoon oil, egg, butter and 1 teaspoon salt. Process to blend. Add flour; process using on/off turns until dough forms and pulls away from sides of processor. Transfer dough to lightly floured surface. Knead until smooth and elastic, about 3 minutes. Oil large bowl. Add dough; turn to coat. Cover with clean dry cloth; let rest 15 minutes.",
        "Meanwhile, heat 2 tablespoons oil in heavy medium skillet over medium heat. Add pumpkin seeds and basil and stir until seeds begin to brown, about 5 minutes. Transfer to small bowl and cool.",
        "Knead pumpkin seed mixture into dough. Divide dough in half. Press out each dough piece on ungreased baking sheet to form 8x6-inch oval. Cover loosely with plastic wrap. Let rise until slightly puffed, about 45 minutes.",
        "Preheat oven to 450°F. Sprinkle dough with salt. Bake until focaccias are golden brown, about 15 minutes. Transfer to rack. Serve warm with olive oil for dipping."
    ],
    "ingredients": [
        "2/3 cup warm water (105°F to 115°F)",
        "1 tablespoon sugar",
        "1 teaspoon dry yeast",
        "3 tablespoons olive oil",
        "1 large egg",
        "1 tablespoon unsalted butter, melted",
        "1 teaspoon salt",
        "2 1/2 cups bread flour",
        "2/3 cup hulled pumpkin seeds",
        "2 tablespoons finely chopped fresh basil or 2 teaspoons dried",
        "Additional salt",
        "Additional olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Herb",
        "Bake",
        "Low Carb",
        "Low Fat",
        "Low Cal",
        "Basil",
        "Pumpkin",
        "Summer"
    ],
    "title": "Focaccia with Toasted Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/focaccia-with-toasted-pumpkin-seeds-4214"
}
