{
    "directions": [
        "In the bowl of an electric mixer, combine the yeast, 1/2 cup (4 fl. oz./125 ml) of the warm water and the sugar and whisk by hand until dissolved. Let stand until the mixture starts to bubble, about 5 minutes.",
        "Add the remaining 2 cups (16 fl. oz./500 ml) lukewarm water, then add 5 cups (25 oz./780 g) of the flour and the salt. Place the bowl on the mixer, attach the dough hook and knead on low speed until a dough forms and it begins to pull away from the sides. If the dough is sticky, carefully add more flour a little at a time, using up to 1 cup (5 oz./155 g) if needed. The dough is ready when it feels smooth and slightly tacky and does not stick to the sides of the bowl.",
        "Transfer the dough to a large bowl along with 3 Tbs. of the olive oil. Coat the dough on all sides with the oil. Cover with plastic wrap and let the dough rise in a warm spot until doubled in size, about 1 hour.",
        "Use the remaining 5 Tbs. olive oil to thoroughly oil a baking sheet. Punch down the dough and turn it out onto the prepared sheet. Spread out the dough until it completely covers the sheet. Let rise in a draft-free spot until doubled in size, about 30 minutes.",
        "Meanwhile, position a rack in the lower third of an oven and preheat to 400°F (200°C).",
        "Gently poke holes in the top of the dough with your fingers. Spread the pizza sauce over the dough and sprinkle with the mozzarella.",
        "Bake the pizza until the edges are firm and sound hollow when tapped and the cheese is melted, 25 to 30 minutes. Garnish the pizza with basil and Parmesan and serve immediately. Serves 8 to 10.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 Tbs. active dry yeast",
        "2 1/2 cups (20 fl. oz./625 ml) warm water (105° to 110°F/40° to 43°C)",
        "Pinch of sugar",
        "5 to 6 cups (25 to 30 oz./780 to 935 g) all-purpose flour",
        "1 Tbs. kosher salt",
        "8 Tbs. (4 fl. oz./125 ml) olive oil",
        "2 cups (16 fl. oz./500 ml) pizza sauce",
        "2 cups (8 oz./250 g) shredded mozzarella cheese",
        "Torn fresh basil leaves for serving",
        "Grated Parmesan cheese for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Focaccia Pizza",
    "url": "http://www.williams-sonoma.com/recipe/focaccia-pizza.html"
}
