{
    "directions": [
        "Combine the warm water, yeast and sugar in a small bowl. Put the bowl in a warm, not hot or cool, place until the yeast is bubbling and aromatic, at least 15 minutes.",
        "In the bowl of a mixer fitted with a dough hook, combine the flour, 1 tablespoon of kosher salt, 1/2 cup olive oil and the yeast mixture on low speed. Once the dough has come together, continue to knead for 5 to 6 minutes on a medium speed until it becomes smooth and soft. Give it a sprinkle of flour if the dough is really sticky and tacky.",
        "Transfer the dough to a clean, lightly floured surface, then knead it by hand 1 or 2 times. Again, give it another sprinkle of flour if the dough is really sticky and tacky.",
        "Coat the inside of the mixer bowl lightly with olive oil and return the dough to the bowl. Cover it with plastic wrap and put it in a warm place until the dough has doubled in size, at least 1 hour.",
        "Coat a jelly roll pan with the remaining 1/2 cup olive oil. (Chef's Note: This may seem excessive, but focaccia is an oily crusted bread. This is why it is soooooooooo delicious!).",
        "Put the dough onto the jelly roll pan and begin pressing it out to fit the size of the pan. Turn the dough over to coat the other side with the olive oil. Continue to stretch the dough to fit the pan. As you are doing so, spread your fingers out and make finger holes all the way through the dough. (Chef's Note: Yes, this is strange. But when the dough rises again it will create the characteristic craggy looking focaccia. If you do not make the actual holes in the dough, the finished product will be very smooth.)",
        "Put the dough in the warm place until it has doubled in size, about 1 hour. While the dough is rising a second time, preheat the oven to 425 degrees F.",
        "Liberally sprinkle the top of the focaccia with some coarse sea salt and lightly drizzle a little oil on top. Bake the dough until the top of the loaf is golden brown, about 25 to 30 minutes. Remove the focaccia from the oven and let it cool before cutting and serving.",
        "Oh baby!"
    ],
    "ingredients": [
        "1 3/4 cups warm water",
        "1 package active dry yeast",
        "1 tablespoon sugar",
        "5 cups all-purpose flour, plus additional for kneading",
        "1 tablespoon kosher salt, plus coarse sea salt, for sprinkling",
        "1 cup extra-virgin olive oil, divided"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Focaccia Recipes"
    ],
    "title": "Focaccia",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/focaccia-recipe"
}
