{
    "directions": [
        "Preheat the oven to 400 degrees F. Oil 1 (11 by 17-inch) baking sheet.",
        "Pour 1/4 cup olive oil in mixing bowl. Place the dough in the bowl and rub with olive oil. Let dough come to room temperature. The dough will loosen and rise slightly in bowl. On a lightly floured work surface knead the dough lightly until smooth. Roll out the dough into a rectangular shape, about 12 by 10-inches. Brush off any excess flour and transfer to the oiled baking sheet. Brush with olive oil and let rise for about 15 to 20 minutes. Press your fingers into the dough to make evenly spaced indentations, brush with the remaining olive oil and sprinkle with gray salt. Bake for about 15 to 20 minutes, the bread should be browned and crisp on the bottom. Remove from the oven and let cool to a warm room temperature.",
        "Meanwhile combine the sun-dried tomatoes, sherry vinegar, and olive oil in a blender. Blend until smooth and taste for salt and pepper.",
        "To assemble the sandwich:",
        "Slice the sheet of focaccia in half as if you are making 1 giant sandwich. Spread the top of the bread with the mayonnaise and the bottom with the sun-dried tomato dressing. Lay down a layer of each sliced meat and then a layer of provolone, followed by a layer of tomatoes. Season tomatoes with salt and pepper, top with the arugula and place the top half of the focaccia on top. Your 1 giant sandwich can now be sliced into individual sandwiches or bite sized squares."
    ],
    "ingredients": [
        "1 1/2-pound store-bought pizza or focaccia dough",
        "3/4 cup extra-virgin olive oil, divided",
        "Gray salt",
        "All-purpose flour, for dusting work surface",
        "6 ounce jar sun-dried tomatoes in oil",
        "1/4 cup sherry vinegar",
        "1/2 cup extra-virgin olive oil",
        "Salt",
        "Pepper",
        "3/4 cup mayonnaise",
        "1/2 pound thinly sliced mortadella",
        "1/2 pound thinly sliced prosciutto",
        "1/2 pound thinly sliced coppa",
        "1/2 pound thinly sliced salami",
        "3/4 pound thinly sliced provolone",
        "6 tomatoes, sliced",
        "Gray salt",
        "Freshly ground black pepper",
        "3 cups fresh arugula"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Focaccia Recipes",
        "Sandwich",
        "Arugula",
        "Vegetable",
        "Ham",
        "Meat",
        "Pork",
        "Cheese",
        "Provolone Recipes",
        "Tomato",
        "Main Dish Recipes",
        "Appetizer",
        "Lunch",
        "Recipes for Parties",
        "Pureeing Recipes"
    ],
    "title": "Focaccia \"Giana\"",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/focaccia-giana-recipe2"
}
