{
    "directions": [
        "In a large pot bring 6 quarts of unsalted water to boil. Cook pasta until al dente. Drain well. Place pasta back in the pot, add one Tablespoon of olive oil and mix to prevent the leaves from sticking together. Cover and keep warm while the sauce finishes simmering.",
        "Warm oven-safe dinner plates in a 150 degree F(65 degree C) oven.",
        "Meanwhile, in a 12 inch saute pan, heat 2 tablespoons of extra virgin olive oil over medium high heat. Add the minced garlic and saute until the aromatic oils are released - about 1 minute. Add the chopped onion and bell pepper and saute 3 minutes. Add the cubed chicken breast, dried thyme, dried basil, rubbed sage, salt, and black pepper. Cook until the chicken is no longer pink. Add the Chardonnay and Burgundy wines, and pasta sauce and heat until bubbling. Add the Portobella mushroom pieces and cook until the mixture has reduced and is thick and hot.",
        "To serve, place two large serving spoonfuls of Autumn Leaves on each warmed plate and top with a large ladle of the chicken and Portobella sauce."
    ],
    "ingredients": [
        "1 (16 ounce) package foglie d'autumn (autumn leaves) pasta",
        "1 tablespoon olive oil",
        "2 tablespoons olive oil",
        "4 cloves garlic, minced",
        "1 cup chopped onion",
        "1/2 cup chopped green bell pepper",
        "1 whole boneless, skinless chicken breast, cubed",
        "2 portobello mushrooms, cut into 1/2 inch pieces",
        "1 teaspoon dried thyme",
        "1 teaspoon dried basil",
        "1/2 teaspoon rubbed sage",
        "1/2 teaspoon kosher salt",
        "1 teaspoon ground black pepper",
        "1/4 cup Chardonnay wine",
        "1/2 cup Burgundy wine",
        "1 (32 ounce) jar spaghetti sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Foglie Chef Doogie's D'Autunno with Chicken and Portobella Mushrooms",
    "url": "http://allrecipes.com/recipe/11957/foglie-chef-doogies-dautunno-with-c/"
}
