{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Cut off ends of russet potatoes, stand potatoes on end, and peel potatoes from top to bottom with a sharp knife to make each potato into a uniform cylinder. Cut each cylinder in half crosswise to make 6 potato cylinders about 2 inches long.",
        "Place potatoes into a bowl of cold water for about 5 minutes to remove starch from outsides; pat dry with paper towels.",
        "Place a heavy oven-proof skillet (such as a cast iron skillet) over high heat. Pour in vegetable oil; heat oil until it shimmers slightly.",
        "Place potato cylinders with best-looking ends into the hot oil, lower heat to medium-high, and pan-fry potatoes until well-browned, 5 to 6 minutes. Season with salt and black pepper.",
        "Flip the potatoes onto the opposite ends. As they cook, use a paper towel held with tongs to carefully blot out the oil from the skillet. Add butter and thyme sprigs to skillet.",
        "Pick up a thyme sprig with tongs and use it to paint butter over the top of the potatoes. Cook until butter foams and foam turns from white to a pale tan color. Season with more salt and pepper. Pour chicken stock into skillet.",
        "Transfer skillet to preheated oven and cook until potatoes are tender and creamy inside, about 30 minutes. If potatoes aren't tender, add 1/4 cup more stock and let cook 10 more minutes.",
        "Place potatoes on a serving platter and spoon thyme-scented butter remaining in skillet over potatoes. Garnish with thyme sprigs. Let cool about 5 minutes before serving."
    ],
    "ingredients": [
        "3 large whole russet potatoes",
        "2 tablespoons high-heat-resistant vegetable oil, such as grapeseed oil",
        "salt and ground black pepper to taste",
        "3 tablespoons butter",
        "4 sprigs thyme, plus more for garnish",
        "1/2 cup chicken broth, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fondant Potatoes",
    "url": "http://allrecipes.com/recipe/233295/fondant-potatoes/"
}
