{
    "directions": [
        "Bring 3 cups broth to simmer in small saucepan. Reduce heat to very low; cover and keep warm. Heat olive oil in heavy medium saucepan over medium heat. Add onion; sauté until translucent, about 5 minutes. Add rice; stir 1 minute. Add wine; stir until absorbed, about 30 seconds. Add broth, 1/3 cup at a time, and simmer until rice is just tender and risotto is creamy, allowing broth to be absorbed before adding more, and stirring often, about 18 minutes. Remove from heat. Mix in 6 tablespoons Parmesan and butter. Season generously with salt and pepper. Spread risotto in 13x9x2-inch pan and cool completely.",
        "Mix 1/2 cup panko, Fontina cheese, parsley, chopped chives, and 1 egg yolk into risotto. Shape into 1 1/4-inch balls; flatten to 2-inch rounds. Arrange on rimmed baking sheet. (Can be made 2 days ahead. Cover and refrigerate.)",
        "Preheat oven to 250°F. Set another rimmed baking sheet in oven. Beat 2 eggs in shallow bowl to blend. Place 1 cup panko in another shallow bowl. Dip risotto cakes into beaten egg, then into panko to coat. Pour enough canola oil into large skillet to coat bottom; heat oil over medium-high heat. Working in batches, sauté risotto cakes until crisp and brown, about 2 1/2 minutes per side. Transfer to baking sheet in oven.",
        "Serve risotto cakes sprinkled with cheese and garnished with chives."
    ],
    "ingredients": [
        "3 cups (about) low-salt chicken broth",
        "2 tablespoons olive oil",
        "1/2 cup finely chopped onion",
        "1 cup plus 2 tablespoons arborio rice",
        "1/4 cup dry white wine",
        "6 tablespoons grated Parmesan cheese",
        "2 tablespoons (1/4 stick) butter",
        "1 1/2 cups panko (Japanese breadcrumbs), divided",
        "1/2 cup (packed) coarsely grated Fontina cheese (about 2 ounces)",
        "1/4 cup chopped fresh parsley",
        "3 tablespoons chopped fresh chives",
        "1 large egg yolk",
        "2 large eggs",
        "Canola oil (for frying)",
        "Additional grated Parmesan cheese",
        "Fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Rice",
        "Appetizer",
        "Bake",
        "Christmas",
        "Parmesan",
        "White Wine",
        "Winter",
        "Parsley",
        "Fontina",
        "Sugar Conscious",
        "Kidney Friendly"
    ],
    "title": "Fontina Risotto Cakes with Fresh Chives",
    "url": "http://www.epicurious.com/recipes/food/views/fontina-risotto-cakes-with-fresh-chives-231263"
}
