{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Working two at a time, place the chicken breasts in a gallon-size resealable plastic bag and set on a flat work surface. Pound the chicken to an even thickness with a meat mallet or the back of a small, heavy pan. Remove from the bag and repeat with the remaining chicken.",
        "Combine the flour and a pinch of salt and pepper in a shallow dish; whisk to incorporate. In a separate shallow dish, whisk the eggs. In a third shallow dish, combine the breadcrumbs, 1/4 cup Parmesan, dried basil, lemon zest, 1 tablespoon salt and 1/4 teaspoon pepper; stir to blend.",
        "Coat the chicken breasts completely with flour and shake off the excess. Dip in the eggs and then coat with the breadcrumb mixture. Place on a clean plate or tray and set aside.",
        "Heat the oil over medium heat in a large skillet. Pan-fry the chicken on both sides until crisp and golden, 3 to 4 minutes per side. Remove to a foil-lined baking sheet or casserole dish.",
        "Top each chicken breast with 1/2 cup of the marinara. Sprinkle the mozzarella and 1 cup Parmesan evenly over the top. Bake until the cheese is melted and the chicken is cooked through, 20 minutes. Top each breast with a basil leaf to serve."
    ],
    "ingredients": [
        "Four 6-ounce boneless, skinless chicken breasts, tenders removed",
        "1 cup all-purpose flour",
        "Kosher salt and ground black pepper",
        "2 eggs",
        "2 cups fine breadcrumbs",
        "1/4 cup plus 1 cup finely grated Parmesan",
        "1 tablespoon dried basil",
        "1 lemon, zested",
        "1/4 to 1/2 cup canola or grapeseed oil",
        "2 cups marinara sauce (your favorite brand or homemade)",
        "2 cups shredded mozzarella",
        "4 fresh basil leaves, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken",
        "Poultry Recipes",
        "Cheese",
        "Mozzarella Recipes",
        "Main Dish Recipes"
    ],
    "title": "Foolproof Chicken Parmesan",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/foolproof-chicken-parmesan"
}
