{
    "directions": [
        "Toss shallot, thyme, mushrooms, oil, vinegar, and salt in a medium bowl. Let sit at room temperature 1 hour.",
        "Heat oil in a large skillet over medium heat. Cook onion and garlic, stirring often, until onion is softened and just translucent and garlic is golden, about 4 minutes.",
        "Working in batches, add kale, tossing and letting it wilt slightly before adding more.",
        "Reduce heat to medium-low and cook kale, tossing often, until tender, 12–15 minutes.",
        "Mix in red pepper flakes and season with salt and pepper.",
        "Place dried mushrooms in a small bowl and cover with boiling water; let stand until rehydrated and pliable, 5–8 minutes. Drain, squeeze out excess moisture, and finely chop.",
        "Mix mushrooms, shallot, mayonnaise, lemon juice, and rosemary in a small bowl; season with salt and pepper. Cover and chill.",
        "Heat oil in a medium skillet over high heat. Drain marinated mushrooms, pat dry, and cook until deep golden brown, 6–8 minutes per side.",
        "Meanwhile, heat butter in a medium nonstick skillet over low heat and cook eggs, stirring occasionally with a heatproof spatula, until just barely set, about 4 minutes (or cook over easy, if you prefer).",
        "Heat broiler. Spread cut sides of rolls with mushroom mayo (you may have some left over). Place rolls, cut side up, on a broilerproof rimmed baking sheet. Layer bottom halves of rolls with marinated mushrooms, kale mixture, scrambled eggs, and cheese. Broil until cheese is melted.",
        "Close sandwiches and serve with hot sauce, if desired."
    ],
    "ingredients": [
        "1/2 shallot, thinly sliced",
        "1 sprig thyme",
        "4 ounces king trumpet mushrooms (about 2), sliced 1/4\" thick, lightly scored",
        "1/4 cup olive oil",
        "1/4 cup white wine vinegar",
        "1 1/2 teaspoons kosher salt",
        "2 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "2 garlic cloves, finely chopped",
        "2 large bunches kale, ribs and stems removed, leaves chopped (about 6 cups)",
        "1/2 teaspoon crushed red pepper flakes",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/4 cup dried mushrooms (such as black trumpets)",
        "1/2 shallot, very finely chopped",
        "1/2 cup mayonnaise",
        "1 tablespoons fresh lemon juice",
        "1 teaspoon very finely chopped rosemary",
        "Kosher salt",
        "Freshly ground black pepper",
        "2 tablespoons olive oil",
        "1 tablespoons unsalted butter",
        "4 large eggs",
        "4 brioche, challah, or potato rolls, split, buttered, lightly toasted",
        "4 slices Swiss cheese",
        "Green chile hot sauce (optional; for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Sandwich",
        "Egg",
        "Mushroom",
        "Vegetarian",
        "Mayonnaise",
        "Kale",
        "Swiss Cheese"
    ],
    "title": "Forager Sandwich",
    "url": "http://www.epicurious.com/recipes/food/views/forager-sandwich-51248210"
}
