{
    "directions": [
        "Place the dried bean curd in a bowl, and cover with boiling water. In a smaller bowl, place the shredded black fungus and dried black mushrooms, and cover with boiling water. Allow the bean curd, black fungus, and dried black mushrooms to soak until rehydrated, about 20 minutes.",
        "Place 3 1/4 cups of  water with rice in a saucepan. Bring to a boil over high heat, and let it boil hard for one minute. Cover with a lid, and turn heat to low. Cook on low for 5 minutes, then remove from heat (without lifting the lid). Let sit, covered, while you prepare the rest of the meal, or about 20 minutes.  Do not at any time lift the lid.",
        "In a  non-stick skillet, melt butter over medium-high heat. Scramble eggs to the dry instead of the creamy point. Dump them into a bowl, and continue to chop them into bits with the edge of a wooden spoon. You don't have to pulverize them, go for pieces about the size of your thumbnail.",
        "In one bowl, combine carrot, onion, garlic, and ginger.  In another bowl, green onions and frozen peas. Now drain all the water off the bean curd, fungus and mushrooms. The bean curd might need some tough bits removed, and the remainder cut into quarter-inch rings. The mushrooms only need slicing and the fungus is pre-sliced so no worries there. Combine bean curd and mushrooms in a third bowl.",
        "Heat wok over high heat; let the metal get smoking hot, about one minute. Add  three tablespoons of vegetable oil. Wait about 30 seconds, and tip in the bowl of carrot, onion, garlic, and ginger. Cook, stirring frequently.  The garlic's going to brown first because it has the highest sugar content, so keep an eye on it, and turn the flame down if necessary. Tip in the  bean curd, shredded fungus, and mushrooms, and cook and stir for one minute. Now look to see that your flame is set to maximum, and tip in the spring onion and the frozen peas. You don't need to cook them, just threaten them. Keep them moving, and mix in the rice. Stir in the eggs, and then season with generous, generous amounts of tamari and sesame oil, and a few twists of fresh black pepper."
    ],
    "ingredients": [
        "6 sticks dried bean curd",
        "1 tablespoon shredded black fungus",
        "7 dried black mushrooms",
        "boiling water",
        "3 1/4 cups water",
        "2 cups basmati rice",
        "1 tablespoon butter or oil",
        "4 eggs, beaten",
        "3 tablespoons vegetable oil, or as needed",
        "1 cup cubed carrots",
        "1 cup chopped yellow onion",
        "4 tablespoons minced fresh ginger root",
        "4 tablespoons minced garlic",
        "1/2 cup thinly sliced green onions",
        "1 cup frozen peas",
        "3 tablespoons tamari",
        "2 tablespoons sesame oil",
        "fresh ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Foreign Devil Fried Rice",
    "url": "http://allrecipes.com/recipe/68640/foreign-devil-fried-rice/"
}
