{
    "directions": [
        "Combine onion, liquid smoke flavoring, Worcestershire sauce, garlic, chili powder, celery seed, chipotle pepper, and salt in a bowl until marinade is smooth. Place brisket in a shallow glass dish and pour marinade over brisket. Cover dish with plastic wrap and refrigerate, 8 hours to overnight.",
        "Heat oil in a large skillet over medium-high heat. Scrape onion from the brisket, reserving onion and marinade. Cook brisket in the hot oil until browned on all sides, about 10 minutes. Transfer brisket to a slow cooker on Low.",
        "Pour marinade with onion and vinegar into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cook mixture until onion is tender and liquid is reduced by 3/4, 5 to 10 minutes.",
        "Mix vinegar-onion mixture, tomatoes, water, and bay leaves into slow cooker.",
        "Cook on Low until brisket is very tender, at least 6 hours.",
        "Strain liquids from slow cooker into a saucepan; bring to a boil. Whisk enough flour into liquid until desired gravy consistency is reached, about 5 minutes.",
        "Shred brisket with a fork and serve with gravy and tomato-onion mixture."
    ],
    "ingredients": [
        "1/4 cup chopped onion",
        "2 tablespoons liquid smoke flavoring",
        "2 tablespoons Worcestershire sauce",
        "2 cloves garlic, minced",
        "1 tablespoon chili powder",
        "1 tablespoon celery seed",
        "1 tablespoon ground chipotle pepper",
        "1 teaspoon salt",
        "2 pounds beef brisket, or more to taste",
        "2 tablespoons vegetable oil",
        "1/4 cup apple cider vinegar",
        "1 (14.5 ounce) can canned diced tomatoes",
        "1 1/2 cups water",
        "2 bay leaves",
        "1 tablespoon all-purpose flour, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fork-Tender Slow Cooker Brisket",
    "url": "http://allrecipes.com/recipe/239484/fork-tender-slow-cooker-brisket/"
}
