{
    "directions": [
        "Place tilapia fillets on plate and sprinkle with salt and hot sauce; cover and refrigerate while making cilantro cream sauce.",
        "Combine cream cheese, 2 tablespoons cilantro, mayonnaise, and yogurt in a small bowl or large measuring cup; mix well. Stir lime juice into cream sauce. Cover and refrigerate.",
        "Whisk flour, salt, garlic powder, cayenne, and pepper in a bowl until thoroughly combined; whisk in beer to make a smooth batter.",
        "Heat oil in a large, deep frying pan to 375 degrees F (190 degrees C).",
        "Remove fish from refrigerator; dip in beer batter and fry fillets 3 at a time in the hot oil, turning when golden (approximately 2 minutes on each side, depending on the thickness). Transfer to paper towels to drain; set fish on a covered plate to keep warm. Repeat with remaining fillets.",
        "Wrap tortillas in a clean kitchen towel and heat in the microwave until warm, about 20 seconds. Assemble tacos by placing a fish fillet on a warm tortilla. Top with shredded cabbage, a dollop of cilantro cream sauce, a spoonful of salsa, and a sprinkle of chopped cilantro. Serve each taco with a lime quarter for squeezing."
    ],
    "ingredients": [
        "Fish:",
        "8 (3 ounce) fillets tilapia",
        "2 teaspoons salt",
        "2 teaspoons hot pepper sauce",
        "Cilantro Cream Sauce:",
        "4 ounces cream cheese, softened",
        "2 tablespoons chopped fresh cilantro",
        "1/2 cup mayonnaise",
        "1 (5.3 ounce) container plain Greek yogurt",
        "1 tablespoon lime juice",
        "Beer Batter:",
        "1 cup flour",
        "1 teaspoon salt",
        "1 teaspoon garlic powder",
        "cayenne pepper to taste",
        "1/4 teaspoon ground black pepper",
        "1 cup dark beer",
        "3 cups peanut oil for frying",
        "For the Tacos:",
        "8 (8 inch) flour tortillas",
        "1/4 medium head cabbage, finely shredded",
        "1 (8 ounce) jar prepared salsa",
        "1/4 cup chopped fresh cilantro",
        "2 small limes, quartered"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fort Worth Fish Tacos",
    "url": "http://allrecipes.com/recipe/231814/fort-worth-fish-tacos/"
}
