{
    "directions": [
        "In the bowl of an electric mixer fitted with the paddle attachment proof the yeast with the sugar in the water for 5 minutes, or until the mixture is foamy, add the flour, the salt, 3 tablespoons of the oil, and 1/2 cup of the Parmesan, and combine the dough well. With the dough hook knead the dough for 2 minutes, or until it is soft and slightly sticky. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours, or until it is double in bulk. The dough may be made up to this point, punched down, and kept, covered and chilled, overnight. Let the dough return to room temperature before proceeding with the recipe. Press the dough evenly into a oiled jelly-roll pan, 15 1/2 by 10 1/2 by 1 inches, and let it rise, covered loosely, in a warm place for 1 hour, or until it is almost double in bulk.",
        "In a bowl stir together the remaining 1/4 cup Parmesan, the mozzarella, the Gorgonzola, the Fontina, the onion, and pepper to taste and sprinkle the mixture evenly over the dough. Drizzle the remaining 2 tablespoons oil over the cheese mixture and sprinkle the focaccia with the coarse salt. Bake the focaccia in the bottom third of a preheated 400°F. oven for 35 to 45 minutes, or until it is golden brown, let it cool in the pan on a rack, and serve it warm or at room temperature."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "1 cup lukewarm water",
        "3 1/2 cups unbleached all-purpose flour",
        "1 teaspoon table salt",
        "5 tablespoons olive oil",
        "3/4 cup freshly grated Parmesan",
        "1 cup grated whole-milk mozzarella (about 1/4 pound)",
        "1/2 cup finely crumbled Gorgonzola (about 2 ounces)",
        "1 cup grated Fontina (about 3 ounces)",
        "1 small onion, sliced thin",
        "1 teaspoon coarse salt, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Bake",
        "Blue Cheese",
        "Mozzarella",
        "Parmesan",
        "Winter",
        "Fontina",
        "Gourmet"
    ],
    "title": "Four-Cheese Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/four-cheese-focaccia-13557"
}
