{
    "directions": [
        "Preheat oven to 400°F. Melt 2 Tbsp. butter in a large skillet over medium heat. Cook onion and garlic, stirring often, until softened, about 3 minutes. Season with 1 tsp. salt and 1/2 tsp. pepper. Add both cans of tomatoes, breaking up with a wooden spoon, then increase heat to medium-high. Add 1/2 cup basil, bring to a simmer, and cook, stirring occasionally, until slightly reduced, 15–20 minutes.",
        "Cook noodles in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and transfer to a lightly oiled rimmed baking sheet.",
        "Meanwhile, melt remaining 4 Tbsp. butter in a medium saucepan over medium-low heat. Add flour and cook, stirring constantly, until foamy and nutty smelling, 1–2 minutes. Whisking constantly, gradually add milk and bring to a simmer. Cook, whisking often, until mixture coats the back of a spoon, about 3 minutes. Stir in 1/3 cup Parmesan and 1/3 cup Pecorino; season with 1/2 tsp. salt and  remaining 1/4 tsp. pepper.",
        "Mix ricotta, mozzarella, shallot, egg, 1/3 cup Parmesan, 1/2 cup basil, and remaining 1/3 cup Pecorino and 1/2 tsp. salt in a medium bowl.",
        "Spoon ricotta mixture into manicotti noodles at both ends. Spread half of tomato sauce then half of cheese sauce (keep them separate but they'll meld together) on bottom of a 13x9\" or other 3-qt. baking dish. Arrange manicotti over, then top with remaining tomato sauce, cheese sauce, and 1/3 cup Parmesan. Bake manicotti until bubbling and lightly browned on top, 30–35 minutes. Let cool 5 minutes. Top with remaining 1/4 cup basil and serve."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, divided",
        "1 medium onion, chopped",
        "2 garlic cloves, finely chopped",
        "2 teaspoons kosher salt, divided, plus more",
        "3/4 teaspoon freshly ground pepper, divided",
        "1 (28-ounce) can whole peeled tomatoes",
        "1 (14-ounce) can whole peeled or diced tomatoes",
        "1 1/4 cups (packed) basil leaves, coarsely chopped, divided",
        "8 ounces dried manicotti noodles",
        "Olive or vegetable oil (for greasing)",
        "1/4 cup all-purpose flour",
        "2 cups whole milk",
        "1 cup grated Parmesan (about 3 ounces), divided",
        "2/3 cup grated Pecorino Romano (about 2 ounces), divided",
        "1 pound fresh ricotta",
        "8 ounces fresh mozzarella, cut into 1/2\" pieces",
        "1 shallot, finely chopped",
        "1 large egg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Tomato",
        "Cheese",
        "Parmesan",
        "Ricotta",
        "Mozzarella",
        "Bake"
    ],
    "title": "Four-Cheese Manicotti",
    "url": "http://www.epicurious.com/recipes/food/views/four-cheese-manicotti"
}
