{
    "directions": [
        "In a large saucepan, melt the butter over medium high heat. Whisk in the flour and cook, stirring frequently, for 3 minutes. Slowly whisk in the milk and nutmeg. Cook over medium heat for 3-5 minutes, whisking occasionally, until slightly thickened. Season to taste with salt and pepper. Remove from heat and let cool.",
        "Heat a large Dutch oven over medium-high heat. Add the pancetta and saute, stirring frequently, for 5 minutes. Add the onion, celery and carrots and continue to cook for 6-7 minutes until softened and fragrant. Add the meats and cook, stirring frequently, until deep brown in color. Add the wine to the skillet and reduce the heat to medium low. Cook until the wine has reduced by half, about 3 minutes.",
        "Add 1/2 cup stock to the saucepan and simmer, 10 minutes, or until totally evaporated. Repeat with another 1/2 cup stock. Stir in the last 1/2 cup stock and milk. Partially cover the pot and cook for 1 hour, stirring frequently. Add the tomatoes, crushing them as they go into the pot. Cook uncovered on medium-low heat for another 45 minutes so the sauce resembles a thick, meaty stew. Season with salt and pepper.",
        "In a large baking dish, spread a thin layer of the bechamel sauce. Add a layer of pasta, then a layer of bechamel and then a layer of rag. Repeat until you have used all of your pasta. On the top layer of pasta, spread the bechamel sauce and top with Parmesan and mozzarella cheese. Cover with Reynolds Wrap(R) Aluminum Foil and bake in a preheated oven at 350 degrees F for 40-45 minutes. Remove the foil and bake another 10 minutes until golden brown. Let rest for 10 minutes before serving."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "4 tablespoons all-purpose flour",
        "2 2/3 cups milk",
        "Freshly grated nutmeg to taste",
        "Salt and freshly ground black pepper to taste",
        "2 ounces pancetta, finely chopped",
        "1 medium onion, minced",
        "1 medium celery with leaves, minced",
        "1 small carrot, minced",
        "4 ounces boneless veal shoulder or round, ground",
        "4 ounces pork loin, trimmed of fat, or ground pork",
        "8 ounces beef skirt steak, ground",
        "1 ounce thinly sliced prosciutto di Parma, chopped",
        "2/3 cup dry red wine",
        "1 1/2 cups chicken stock",
        "2 cups milk",
        "3 (18 ounce) cans plum tomatoes, drained",
        "12 no-boil lasagna noodles, or more if needed",
        "1/2 cup shredded Parmesan cheese",
        "1 cup shredded mozzarella cheese",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Four Meat Ragu Lasagna",
    "url": "http://allrecipes.com/recipe/245466/four-meat-ragu-lasagna/"
}
