{
    "directions": [
        "Put oven rack in middle position and preheat oven to 300°F. Lightly oil 2 (16- by 12-inch) sheets of parchment paper with vegetable oil and put 1 sheet, oiled side up, on a heatproof work surface.",
        "Crush cardamom pods with side of a large heavy knife and scrape out seeds, discarding pods. Coarsely crush seeds with mortar and pestle or side of heavy knife.",
        "Bring sugar, honey, corn syrup, water, crushed cardamom seeds, and salt to a boil in a 4- to 5-quart heavy pot over moderately high heat, stirring occasionally, then boil, stirring occasionally, until mixture registers 350°F on thermometer, about 9 minutes.",
        "Add nuts and cook, stirring constantly with a wooden spoon, until mixture returns to a boil, about 1 minute. Carefully pour hot caramel mixture onto parchment on work surface (use caution when pouring hot liquids) and carefully cover with remaining sheet of parchment, oiled side down. Immediately roll out mixture between parchment sheets, pressing firmly with a large wooden rolling pin to 1/4 inch thick (use caution; mixture will still be hot). If brittle hardens before it is thin enough, transfer to a large baking sheet (still between parchment sheets) and warm brittle in oven 5 minutes to soften, then continue rolling to 1/4 inch thick.",
        "Cool brittle until firm enough to hold its shape but still pliable, 2 to 5 minutes, then remove top sheet of parchment. Lightly oil blade of a large heavy knife or a pizza cutter and score surface of brittle into 1 1/2-inch squares. If brittle hardens too much to score, transfer to a large baking sheet and warm on parchment, uncovered, until surface softens, about 5 minutes, then immediately score remaining lines. Cool brittle completely, uncovered, about 30 minutes. Invert brittle and peel off bottom sheet of parchment, then break into pieces.",
        "Brittle keeps in an airtight container, layered between sheets of parchment or wax paper, at room temperature 1 month."
    ],
    "ingredients": [
        "Vegetable oil for greasing parchment paper",
        "1 teaspoon green cardamom pods (about 8 pods)",
        "2 cups sugar",
        "1/4 cup mild honey",
        "1/4 cup light corn syrup",
        "1/4 cup water",
        "3/4 teaspoon salt",
        "1 cup raw cashews, coarsely chopped (4 1/2 oz)",
        "1/2 cup shelled pistachios (not dyed red; 2 1/4 oz), coarsely chopped",
        "1/2 cup sliced almonds (preferably with skin; 2 oz)",
        "Special equipment: parchment paper; a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Nut",
        "Dessert",
        "Cocktail Party",
        "Almond",
        "Cashew",
        "Pistachio",
        "Spice",
        "Poker/Game Night",
        "Edible Gift",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fragrant Indian Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/fragrant-indian-brittle-236700"
}
