{
    "directions": [
        "Heat 2 tablespoons oil in a large heavy pot over medium heat. Add onion and garlic; cook, stirring occasionally, until softened, 5-8 minutes. Remove and discard casings from 2 sausages; add sausages to pot. Cook, breaking up with a spoon, until sausages and onions are lightly browned, about 5 minutes.",
        "Add beans and wine to pot and cook until wine is reduced by half, 8-10 minutes. Using kitchen twine, tie parsley and thyme into a bundle; add to pot along with bay leaves and broth. Cook on medium-low heat, partially covered and stirring often, until liquid thickens, 40-50 minutes. Discard bundle and bay leaves. Mix in butter and 2 tablespoons chopped herbs. Season with salt and pepper.",
        "Meanwhile, after beans have been cooking for about 25 minutes, heat remaining 1 tablespoon oil in a large skillet over medium heat. Cook remaining sausages, turning occasionally, until browned and cooked through, 15-20 minutes. Slice.",
        "Divide bean mixture among bowls. Top with sausage slices and remaining 1 tablespoon chopped herbs."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 medium onion, chopped",
        "6 garlic cloves, smashed",
        "1 1/2 pounds sweet Italian sausage links (about 6), divided",
        "2 15-ounce cans cannellini (white kidney) beans, rinsed",
        "1 cup dry white wine",
        "10 flat-leaf parsley stems",
        "10 sprigs thyme",
        "2 bay leaves",
        "2 cups low-sodium chicken broth",
        "1 tablespoon unsalted butter",
        "3 tablespoons chopped fresh herbs (such as oregano, flat-leaf parsley, and tarragon), divided",
        "Kosher salt, freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Herb",
        "Dinner",
        "Sausage",
        "White Wine",
        "Winter",
        "Thyme",
        "Parsley",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Franks and Beans",
    "url": "http://www.epicurious.com/recipes/food/views/franks-and-beans-51147430"
}
