{
    "directions": [
        "Combine water, 1 cup white sugar, honey, vanilla bean, cinnamon stick, and cardamom in a large saucepan. Bring to a simmer over medium heat. Add pears; reduce heat and simmer until pears are translucent or easily pierced with a knife, about 10 minutes. Remove from heat and cool to room temperature.",
        "Combine 1 1/2 cup flour, confectioners' sugar, and salt in a bowl. Cut in 1/2 cup plus 1 tablespoon butter until mixture is crumbly. Mix in egg yolk until dough sticks together in large clumps.",
        "Grease a 9-inch tart pan with a removable bottom. Press dough evenly into the pan. Freeze for 30 minutes. Reserve leftover dough for patching cracks.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Grease the shiny side of a piece of aluminum foil with butter; place butter-side down over the pastry. Transfer tart pan to a baking sheet.",
        "Bake in the preheated oven, using leftover dough to patch any cracks, until dough looks dry and light brown, about 20 minutes. Peel off aluminum foil; let pastry cool.",
        "Reduce oven temperature to 350 degrees F (175 degrees C).",
        "Combine 2/3 cup white sugar and 1/3 cup butter in a large bowl; beat with an electric mixer until light and fluffy. Mix in ground almonds. Add egg, egg yolk, 2 teaspoons flour, and cornstarch; beat until frangipane is smooth. Beat in almond extract and vanilla extract.",
        "Spread frangipane evenly over the pastry. Drain pear halves and dry with paper towels. Cut lengthwise into even slices. Place 1 pear half on a spatula and gently fan out slices. Place on frangipane. Repeat with remaining pear halves.",
        "Bake in the preheated oven until frangipane is firm to the touch, 40 to 45 minutes. Cool on a wire rack."
    ],
    "ingredients": [
        "Pears:",
        "4 cups water",
        "1 cup white sugar",
        "2 tablespoons honey",
        "1 vanilla bean, split lengthwise",
        "1 cinnamon stick",
        "5 pods cardamom, crushed",
        "4 Conference pears - peeled, halved, and cored",
        "Pastry:",
        "1 1/2 cups all-purpose flour",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon salt",
        "1/2 cup cold unsalted butter, cut into pieces",
        "1 tablespoon cold unsalted butter, cut into pieces",
        "1 egg yolk",
        "Frangipane:",
        "2/3 cup white sugar",
        "1/3 cup unsalted butter, at room temperature",
        "3/4 cup ground blanched almonds",
        "1 egg",
        "1 egg white",
        "2 teaspoons all-purpose flour",
        "1 teaspoon cornstarch",
        "2 teaspoons almond extract",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frangipane Pear Tart",
    "url": "http://allrecipes.com/recipe/256822/frangipane-pear-tart/"
}
