{
    "directions": [
        "In a large pot, warm 3 gallons of water to 150 degrees F (65 degrees C). Place the roasted barley and crystal malt in a nylon bag and steep in the water at that temperature for 30 minutes.",
        "Remove grains and discard. Bring the water to a boil, then turn off the heat and stir in the pale liquid malt extract. Return to a boil, add 1 ounce of the Fuggles and set a timer for 30 minutes. When the 30 minutes is up, add the remaining fuggles and set the timer for 15 minutes. When that time is up, stir in the East Kent Goldings hops and Irish moss. Let stand for 15 minutes, then cover, remove from the heat and set in an ice bath, being sure to maintain the sterility inside the pot.",
        "Pour two gallons of cold sterile water into a sanitized carbuoy. Place a large funnel over the top and fit with a sterile sieve to strain out the hops. Pour the wort you have made into the carbuoy. If the temperature is below 80 degrees F (44 degrees C), then stir in the yeast. Seal the carbuoy with a fementation lock. Ferment for 7 days.",
        "After 7 days, siphon the mixture into a secondary fermenter (another sterile carbuoy) using a sterile piece of tubing. Seal with a fermentation lock and ferment for another 14 days.",
        "Pour the beer into a large bucket and stir in corn sugar until dissolved. Siphon into sterilized bottles and cap. Store for at least 3 weeks to condition. Imbibe."
    ],
    "ingredients": [
        "3 gallons water",
        "8 ounces crystal malt",
        "4 ounces roasted barley",
        "7 pounds pale liquid malt extract",
        "1 ounce Fuggles hops",
        "1/2 ounce Fuggles hops",
        "1/2 ounce East Kent Goldings hops",
        "1/4 teaspoon Irish moss (carrageen)",
        "2 gallons cold water",
        "1 (.4 ounce) packet Irish ale yeast",
        "3/4 cup corn sugar (dextrose)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frank the Tank's Red Dragon Ale",
    "url": "http://allrecipes.com/recipe/101895/frank-the-tanks-red-dragon-ale/"
}
