{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease or line 12 muffin cups with paper liners.",
        "Mix cake mix, water, eggs, and vegetable oil together in a bowl; beat with an electric mixer until batter is smooth, about 2 minutes. Fill muffin cups with batter.",
        "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 19 to 23 minutes. Cool cupcakes in the pan for 10 minutes before transferring to a wire rack to cool.",
        "Beat shortening and butter together in a bowl using an electric mixer until smooth; add vanilla extract and mix well. Beat confectioners' sugar, alternating with milk, into butter-shortening mixture until frosting is stiff and holds its shape; mix in green food coloring until desired color is reached.",
        "Fill a piping bag, or large resealable freezer bag with a corner snipped, with frosting. Pipe frosting around the top half perimeter and top of each cupcake creating the \"head\" and \"face\"; smooth out the frosting using a small spatula, flattening the top into a square-shape for the top of his \"head.\"",
        "Pour chocolate sprinkles into a shallow bowl and dip the top of each cupcake into the sprinkles, slightly angling the cupcake to get sprinkles around the uppermost top side of the \"head\" for the \"hair.\"",
        "Press 2 dark brown chocolate pieces on the sides of each cupcake creating the \"bolts.\" Press 2 blue chocolate pieces into the top front of each cupcake creating the \"eyes.\" Put a dot of black food gel in the center of each blue candy for the \"pupil.\" Make a \"stitch\" onto the \"face\" using the red food gel."
    ],
    "ingredients": [
        "Cupcakes:",
        "1 (15.25 ounce) package yellow cake mix",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "Frosting:",
        "1 cup shortening",
        "1 cup butter, softened",
        "2 teaspoons vanilla extract",
        "8 cups confectioners' sugar",
        "1/3 cup milk",
        "3 drops green food coloring, or as desired",
        "Decorations:",
        "3 (1.75 ounce) packages chocolate sprinkles (jimmies)",
        "48 dark brown candy-coated milk chocolate pieces",
        "48 blue candy-coated milk chocolate pieces",
        "2/3 ounce black gel food coloring",
        "2/3 ounce red gel food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frankenstein Cupcakes",
    "url": "http://allrecipes.com/recipe/239197/frankenstein-cupcakes/"
}
