{
    "directions": [
        "Put ice cream in the refrigerator to soften while you make whipped cream frosting.",
        "Beat cream in a bowl using an electric mixer until stiff peaks almost form. Add white sugar, whipped cream stabilizer, vanilla extract, and green food coloring to whipped cream; beat until stiff peaks form.",
        "Scoop softened ice cream into a large bowl; stir until a uniform consistency is reached. The ice cream shouldn't be  completely melted, but firm enough to hold form. Scoop ice cream into the loaf pan and spread evenly using a spatula, trying to avoid creating air bubbles.",
        "Mix crushed cookies and melted butter together in a bowl. Pat cookie mixture the ice cream for the \"hair\"; freeze for 5 hours. Run a knife along the edges of the pan and carefully flip it upside-down over a cake platter. Return cake to the freezer until firm, at least 30 minutes.",
        "Spread whipped cream evenly over the top and sides of cake. Freeze cake until solid, about 1 hour more.",
        "Spoon hot fudge sauce onto the cake creating \"eyes\", a \"mouth\", and \"hairline\"; top hot fudge areas with sprinkles. Place 1 cookie on each side of the bottom of the cake for the \"neck bolts\". Freeze cake until ready to eat."
    ],
    "ingredients": [
        "1/2 gallon mint chocolate chip ice cream",
        "2 cups heavy whipping cream",
        "1/2 cup white sugar",
        "1 pouch whipped cream stabilizer (such as Dr. Oetker® Whip It)",
        "2 teaspoons vanilla extract",
        "1 drop green food coloring, or as desired",
        "2 cups crushed chocolate sandwich cookies (such as Oreo®)",
        "1/2 cup melted butter",
        "1 tablespoon hot fudge sauce, or as needed",
        "2 tablespoons chocolate sprinkles, or as desired",
        "2 chocolate sandwich cookies (such as Oreo®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frankenstein Ice Cream Cake",
    "url": "http://allrecipes.com/recipe/244801/frankenstein-ice-cream-cake/"
}
