{
    "directions": [
        "1. Place an oven rack in the lower-center position and preheat the oven to 350°F. Set a large V-shaped roasting rack inside a shallow roasting pan.",
        "2. Pulse the shallots, garlic, chiles, 1 teaspoon salt, and 1/2 teaspoon pepper in a food processor until finely chopped. With the food processor running, add the butter, one piece at time, and process until a paste forms.",
        "3. In a large bowl, crumble the tamales and using a fork, stir in the corn. Season with salt and pepper to taste.",
        "4. Pat the turkey dry. Using metal skewers or toothpicks, secure the neck skin to the back of the turkey, then tuck the turkey's wings behind its back.",
        "5. Stuff the tamale mixture into the turkey's cavity and tie the legs together with butcher's twine. Place the turkey in the prepared rack, breast up, and rub with the butter mixture. Cover the turkey loosely with foil and roast for 1 hour, basting with pan drippings every 20 minutes.",
        "6. Uncover and roast for 30 to 45 minutes, until the skin is well browned and an instant-read thermometer registers 175°F in the thighs and drumsticks and 165°F in the breast and stuffing.",
        "7. Transfer the turkey to a serving platter or carving board and let rest for 30 minutes to 1 hour before serving.",
        "8. Carve the turkey and serve with the tamale stuffing."
    ],
    "ingredients": [
        "4 shallots, peeled",
        "2 garlic cloves, peeled",
        "2 jalapeño chiles, stemmed and seeded",
        "Kosher salt and freshly ground black pepper",
        "8 tablespoons (1 stick) unsalted butter, cut into 8 pieces and chilled",
        "30 medium pork, chicken, or chile tamales , husks removed and discarded",
        "1 cup frozen corn, thawed",
        "One 8- to 10-pound whole turkey, giblets removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Corn",
        "Shallot",
        "Candy Thermometer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Francis Butler's Texas Tamale-Stuffed Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/francis-butlers-texas-tamale-stuffed-turkey-367529"
}
