{
    "directions": [
        "Roll out the dough 1/8- inch thick on a lightly floured surface, fit it into an 11-by 8-inch rectangular or 10-or 11-inch round tart pan with a removable fluted rim, and chill the shell while making the frangipane. In a small bowl cream together the butter and the sugar and beat in the egg, the almonds, the almond extract, the Amaretto, and the flour. Spread the frangipane evenly on the bottom of the shell and bake the tart in the middle of a preheated 375°F. oven for 20 to 25 minutes, or until the shell is pale golden. (If the frangipane begins to turn too brown, cover the tart loosely with a piece of foil.) Let the tart cool. Cut the strawberries lengthwise into 1/8-inch-thick slices, arrange the slices, overlapping, decoratively with the raspberries in rows on the frangipane, and brush them gently with the jam.",
        "In a large bowl blend the flour, the butter, the vegetable shortening, and salt until the mixture resembles meal. Add 2 tablespoons ice water, toss the mixture until the water is incorporated, adding more ice water if necessary to form a dough, and form the dough into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour."
    ],
    "ingredients": [
        "1 recipe pâte brisée (recipe follows)",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1/2 cup sugar",
        "1 large egg",
        "3/4 cup blanched almonds, ground fine",
        "1 teaspoon almond extract",
        "1 tablespoon Amaretto",
        "1 tablespoon all-purpose flour",
        "2 cups strawberries, hulled",
        "2 cups raspberries, picked over and rinsed",
        "1/4 cup strawberry or raspberry jam, melted and strained",
        "1-1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Strawberry",
        "Almond",
        "Summer",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Frangipane Tart with Strawberries and Raspberries",
    "url": "http://www.epicurious.com/recipes/food/views/frangipane-tart-with-strawberries-and-raspberries-12346"
}
