{
    "directions": [
        "In a small heavy saucepan combine prunes, porter, and honey and cook over moderate heat, stirring occasionally, until most liquid is evaporated, 10 to 15 minutes. Cool prune mixture.",
        "In a bowl whisk together cornstarch, yolks, and a pinch salt. In a heavy saucepan combine milk and sugar and bring to a bare simmer. Add hot milk mixture to yolk mixture in a stream, whisking, and return custard to pan. Bring custard to a boil over moderate heat, whisking constantly, and boil, whisking constantly, 2 minutes.",
        "Pour custard into a metal bowl set in a larger bowl of ice and cold water and cool, stirring. Stir in vanilla, cream, and prune mixture and freeze in an ice-cream maker. Makes about 1 quart.",
        "In a large bowl whisk together milk, yeast, and 1 teaspoon sugar and let stand until foamy, about 5 minutes. With an electric mixer on medium speed beat in remaining sugar, salt, yolk, and 1 cup flour until combined well and beat in butter, 1 piece at a time, adding each new piece just as previous one is incorporated. With a wooden spoon stir in 1 1/2 cups flour, adding more if necessary, until mixture forms a soft dough. On a lightly floured surface knead dough 6 minutes, or until smooth and elastic. (Alternatively, dough may be made in bowl of a standing electric mixer, attaching dough hook to knead 4 minutes.)",
        "Transfer dough to a lightly oiled bowl and let rise, covered tightly with plastic wrap, in a warm place until doubled in bulk, 1 to 1 1/2 hours. Punch down dough. Dough may be prepared up to this point 1 day ahead. Put dough in a sealable plastic bag, pressing out excess air, and chill. Bring dough to room temperature before proceeding.",
        "In a small saucepan melt butter over moderate heat and stir in sugar, milk, cinnamon, salt, and almonds. Simmer mixture 1 minute and cool to warm.",
        "Preheat oven to 375°F. Line a baking sheet with parchment paper or lightly grease it.",
        "Stretch and press dough onto baking sheet to form a 12-inch round. Spread topping evenly over dough and let rise, uncovered, in a warm place 30 minutes. Press indentations all over cake with your fingertips and bake in middle of oven 18 to 20 minutes, or until puffed and golden. Cool cake on baking sheet 10 minutes and transfer to a rack. Cake keeps, wrapped well in foil and chilled, 1 day or frozen 1 week. Reheat cake in middle of a preheated 350°F. oven 15 minutes if chilled or 20 minutes if unthawed frozen.",
        "Serve beesting cake warm with ice cream."
    ],
    "ingredients": [
        "2/3 cup warm milk (105°-115°F.)",
        "a 1/4-ounce package active dry yeast (2 1/2 teaspoons)",
        "1/3 cup sugar",
        "1/2 teaspoon salt",
        "1 large egg yolk",
        "about 2 3/4 cups all-purpose flour",
        "1 stick (1/2 cup) unsalted butter, cut into 8 pieces and softened",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/3 cup sugar",
        "2 tablespoons milk",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "3/4 cup sliced almonds",
        "Accompaniment: honey porter prune ice cream",
        "we used the soft, chocolaty honey porter made by Samuel Adams (available nationwide); but regional porters on the order of Vermont's Catamount or Oregon's Deschutes Black Butte exhibit the same qualities. Whatever you choose, avoid bitter, hoppy porters such as Sierra Nevada.",
        "1 cup pitted prunes, chopped",
        "1/2 cup porter such as Samuel Adams Honey Porter",
        "3 tablespoons honey",
        "1 tablespoon cornstarch",
        "3 large egg yolks",
        "2 cups milk",
        "1 cup sugar",
        "1 teaspoon vanilla",
        "1 cup well-chilled heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Beer",
        "Milk/Cream",
        "Dairy",
        "Dessert",
        "Bake",
        "Prune",
        "Almond",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Free-Form Beesting Cake",
    "url": "http://www.epicurious.com/recipes/food/views/free-form-beesting-cake-11385"
}
