{
    "directions": [
        "Line 2 large baking sheets with parchment. Sift powdered sugar, almond flour, and hazelnut flour (if using) into large bowl. Using electric mixer, beat egg whites, sugar, and pinch of salt in medium bowl until medium peaks form. Add egg white mixture to almond mixture; fold to incorporate. Working in 2 batches, fill pastry bag fitted with 1/4-inch-diameter plain pastry tip with batter (batter will be thin and will drip from bag). Pipe batter in 11/4-inch rounds on baking sheets, spacing 1 inch apart (cookies will spread slightly). Let rest on sheets at room temperature 20 minutes. Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 375°F. Bake cookies 5 minutes. Reduce oven temperature to 325°F. Continue to bake cookies until puffed and golden on top, about 10 minutes, reversing sheets after 5 minutes. Cool cookies on sheets on rack. Carefully peel cookies from parchment. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
        "Bring raspberries and 1 cup sugar to boil in large saucepan over high heat, stirring until sugar dissolves. Cook until berries are soft, juices thicken, and mixture measures about 1 1/2 cups, stirring frequently, 7 to 9 minutes. Measure 1/2 cup mixture; strain into small bowl. Cool strained jam and jam with seeds separately. DO AHEAD: Can be made 1 week ahead. Cover jams separately and chill.",
        "Combine egg whites, 6 tablespoons sugar, and 1/4 teaspoon salt in bowl of heavy- duty stand mixer. Set bowl over large saucepan of simmering water. Heat until candy thermometer inserted into mixture registers 140°F, stirring often, 3 to 4 minutes. Using whisk attachment, beat egg white mixture at high speed until stiff meringue forms and mixture is at room temperature, 5 to 6 minutes. With mixer running, add butter, 1 piece at a time, beating until each piece is incorporated before adding next. Beat in rose water. Add 3 tablespoons seedless jam, 1 tablespoon at a time, beating to blend well after each addition. (If buttercream looks broken or curdled, place bowl over medium heat and whisk 5 to 10 seconds to warm slightly, then remove from heat and beat again on medium speed. Repeat warming and beating as many times as needed until buttercream is smooth.)",
        "Line rimmed baking sheet with parchment. Using 1/2 teaspoon jam with seeds for each, spread jam over flat side of half of macaroons. Spoon buttercream into pastry bag fitted with 1/4-inch plain tip. Starting at outer edge of flat sides of remaining macaroons, pipe buttercream over in spiral. Gently press macaroons, jam- filled side down, onto buttercream-coated macaroons. Place on sheet. Cover; chill overnight. DO AHEAD: Can be made 2 to 3 days ahead. Store in airtight container in refrigerator. Let stand at room temperature 30 minutes before serving."
    ],
    "ingredients": [
        "2 cups powdered sugar",
        "1 cup (lightly packed) sifted almond flour, or 3/4 cup sifted almond flour and 1/4 cup sifted hazelnut flour (sifted, then measured; any coarse particles reserved for another use)",
        "1/2 cup (scant) egg whites (from about 3 large eggs)",
        "2 tablespoons plus 1/2 teaspoon sugar",
        "4 cups frozen raspberries (about 15 ounces; do not thaw)",
        "1 cup plus 6 tablespoons sugar, divided",
        "1/4 cup egg whites (from about 2 large eggs), room temperature",
        "10 tablespoons (1 1/4 sticks) unsalted butter, cut into 1-inch pieces, room temperature",
        "1/4 teaspoon (generous) rose water",
        "Pastry bag",
        "1/4-inch-diameter plain pastry tip",
        "Heavy-duty stand mixer",
        "Candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Berry",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Wedding",
        "Raspberry",
        "Tree Nut",
        "Almond",
        "Engagement Party",
        "Party",
        "Boil",
        "Candy Thermometer",
        "Kidney Friendly"
    ],
    "title": "French Macaroons with Raspberry-Rose Buttercream",
    "url": "http://www.epicurious.com/recipes/food/views/french-macaroons-with-raspberry-rose-buttercream-362972"
}
