{
    "directions": [
        "Melt the stick of butter in a large pot over medium heat. Add the onions, garlic, bay leaves, thyme, and salt and pepper and cook until the onions are very soft and caramelized, about 25 minutes. Add the wine, bring to a boil, reduce the heat and simmer until the wine has evaporated and the onions are dry, about 5 minutes. Discard the bay leaves and thyme sprigs. Dust the onions with the flour and give them a stir. Turn the heat down to medium low so the flour doesn't burn, and cook for 10 minutes to cook out the raw flour taste. Now add the beef broth, bring the soup back to a simmer, and cook for 10 minutes. Season, to taste, with salt and pepper.",
        "When you're ready to eat, preheat the broiler. Arrange the baguette slices on a baking sheet in a single layer. Sprinkle the slices with the Gruyere and broil until bubbly and golden brown, 3 to 5 minutes.",
        "Ladle the soup in bowls and float several of the Gruyere croutons on top.",
        "Alternative method: Ladle the soup into bowls, top each with 2 slices of bread and top with cheese. Put the bowls into the oven to toast the bread and melt the cheese."
    ],
    "ingredients": [
        "1/2 cup unsalted butter",
        "4 onions, sliced",
        "2 garlic cloves, chopped",
        "2 bay leaves",
        "2 fresh thyme sprigs",
        "Kosher salt and freshly ground black pepper",
        "1 cup red wine, about 1/2 bottle",
        "3 heaping tablespoons all-purpose flour",
        "2 quarts beef broth",
        "1 baguette, sliced",
        "1/2 pound grated Gruyere"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Side Dish Recipes",
        "Easy Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Comfort Food",
        "European Recipes",
        "Soup",
        "Onion Recipes",
        "Vegetable",
        "Cheese",
        "Gruyere Recipes",
        "Beef",
        "Meat",
        "Winter",
        "Caramelizing",
        "Broiling"
    ],
    "title": "French Onion Soup",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/french-onion-soup-recipe2"
}
