{
    "directions": [
        "Cook onions, thyme, bay leaves, and salt in butter in a 4- to 5-quart heavy pot over moderate heat, uncovered, stirring frequently, until onions are very soft and deep golden brown, about 45 minutes. Add flour and cook, stirring, 1 minute. Stir in wine and cook, stirring, 2 minutes. Stir in broth, water, and pepper and simmer, uncovered, stirring occasionally, 30 minutes.",
        "While soup simmers, put oven rack in middle position and preheat oven to 350°F.",
        "Arrange bread in 1 layer on a large baking sheet and toast, turning over once, until completely dry, about 15 minutes.",
        "Remove croûtes from oven and preheat broiler. Put crocks in a shallow baking pan.",
        "Discard bay leaves and thyme from soup and divide soup among crocks, then float a croûte in each. Slice enough Gruyère (about 6 ounces total) with cheese plane to cover tops of crocks, allowing ends of cheese to hang over rims of crocks, then sprinkle with Parmigiano-Reggiano.",
        "Broil 4 to 5 inches from heat until cheese is melted and bubbly, 1 to 2 minutes."
    ],
    "ingredients": [
        "2 lb medium onions, halved lengthwise, then thinly sliced lengthwise",
        "3 sprigs fresh thyme",
        "2 Turkish bay leaves or 1 California",
        "3/4 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter",
        "2 teaspoons all-purpose flour",
        "3/4 cup dry white wine",
        "4 cups reduced-sodium beef broth (32 fl oz)",
        "1 1/2 cups water",
        "1/2 teaspoon black pepper",
        "6 (1/2-inch-thick) diagonal slices of baguette",
        "1 (1/2-lb) piece Gruyère, Comte, or Emmental",
        "2 tablespoons finely grated Parmigiano-Reggiano",
        "Special equipment: 6 (8- to 10-oz) flameproof soup crocks or ramekins; a cheese plane"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Cheese",
        "Onion",
        "Bake",
        "Broil",
        "Fall",
        "Winter",
        "Swiss Cheese",
        "Gourmet"
    ],
    "title": "French Onion Soup",
    "url": "http://www.epicurious.com/recipes/food/views/french-onion-soup-236714"
}
