{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Slice the top off the whole head of garlic, sprinkle with 1 teaspoon olive oil, and season with salt. Wrap loosely in foil, and bake 45 minutes, or until the cloves are very soft. Squeeze the cloves into a small bowl, and mix with the 1/2 cup softened butter.",
        "Heat 2 tablespoons olive oil in a large pot over medium heat. Melt 2 tablespoons butter in the pot, and blend with the oil. Stir in the onions and celery root, and saute until the onions are lightly browned. Reduce heat to medium low, and mix in the beef broth, wine, and vegetable broth. Mix in the chopped garlic, and season with paprika, parsley, Cajun seasoning, salt, and pepper. Simmer, stirring occasionally, for 1 hour.",
        "Preheat the oven broiler.",
        "Spread the toasted bread slices with the garlic butter. Ladle the soup into oven safe bowls, and place the bowls on a baking sheet. Reserving remaining bread, place one slice of toasted bread on top of the soup in each bowl, and sprinkle with Swiss cheese.",
        "Broil soup 5 minutes in the preheated oven, until the Swiss cheese is melted. Cool for about 2 minutes before serving warm with remaining garlic bread."
    ],
    "ingredients": [
        "1 head garlic",
        "1 teaspoon olive oil",
        "salt to taste",
        "1/2 cup butter, softened",
        "2 tablespoons olive oil",
        "2 tablespoons butter, melted",
        "3 large sweet onions, chopped",
        "1 celeriac (celery root), chopped",
        "2 cups beef broth",
        "1 cup dry red wine",
        "2 cups vegetable broth",
        "1 head garlic cloves, chopped",
        "2 teaspoons paprika",
        "2 tablespoons dried parsley",
        "Cajun seasoning to taste",
        "salt and pepper to taste",
        "1 loaf French bread, toasted and sliced",
        "1 cup shredded Swiss cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "French Onion Soup with Celeriac",
    "url": "http://allrecipes.com/recipe/55862/french-onion-soup-with-celeriac/"
}
