{
    "directions": [
        "Clarify butter: In a small heavy saucepan melt butter over low heat. Remove pan from heat and let butter stand 3 minutes. Skim froth and pour butter through a sieve lined with a double thickness of rinsed and squeezed cheesecloth into a bowl, discarding milk solids in bottom of pan.",
        "In a large bowl whisk together eggs, milk, vanilla, and rum. Transfer half of mixture to a large shallow baking dish (about 13 by 9 by 2 inches) and soak half of bread slices 10 minutes. Turn slices over and soak 10 minutes more. In another large shallow baking dish spread half of corn flakes and coat soaked bread slices on each side, transferring to a tray. Soak and coat remaining slices with remaining egg mixture and corn flakes in same manner.",
        "Preheat oven to 250°F.",
        "In a large heavy skillet heat 2 tablespoons clarified butter over moderate heat until hot but not smoking and cook 2 or 3 slices (or as many as will fit in one layer) 3 minutes on each side, or until puffed and golden brown. Transfer French toast as cooked to a baking sheet and keep warm in oven. Cook remaining slices in remaining butter in same manner.",
        "Sprinkle French toast with cinnamon sugar and serve with accompaniments."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, cut into bits",
        "8 large eggs",
        "4 cups milk",
        "2 tablespoons vanilla extract",
        "2 tablespoons dark rum",
        "1 loaf challah (about 1 pound), cut into 1-inch-thick slices and ends discarded",
        "4 cups corn flakes",
        "cinnamon sugar made by stirring together 2 tablespoons sugar and 1/4 teaspoon cinnamon",
        "maple syrup of whipped cream",
        "pecans and/or berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Egg",
        "Breakfast",
        "Brunch",
        "Kid-Friendly",
        "Spring",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "French Toast",
    "url": "http://www.epicurious.com/recipes/food/views/french-toast-14315"
}
