{
    "directions": [
        "For the pastry, place the flour, salt, and sugar in the bowl of a food processor fitted with the steel blade. Pulse for a few seconds to combine. Add the butter and pulse 10 to 12 times, until the butter is in small bits the size of peas. With the motor running, pour the ice water down the feed tube and pulse just until the dough starts to come together. Dump onto a floured board and knead quickly into a ball. Wrap in plastic and refrigerate for at least 1 hour.",
        "Preheat the oven to 400 degrees. Line a sheet pan with parchment paper.",
        "Roll the dough slightly larger than 10x14 inches. Using a ruler and a small knife, trim the edges. Place the dough on the prepared sheet pan and refrigerate while you prepare the apples.",
        "Peel the apples and cut them in half through the stem. Remove the stems and cores with a sharp knife and a melon baller. Slice the apples crosswise in 1/4-inch-thick slices. Place overlapping slices of apples diagonally down the middle of the tart and continue making diagonal rows on both sides of the first row until the pastry is covered with apple slices. (I tend not to use the apple ends in order to make the arrangement beautiful.) Sprinkle with the full 1/2 cup sugar and dot with the butter.",
        "Bake for 45 minutes to 1 hour, until the pastry is browned and the edges of the apples start to brown. Rotate the pan once during cooking. If the pastry puffs up in one area, cut a little slit with a knife to let the air out. Don't worry! The apple juices will burn in the pan but the tart will be fine! When the tart's done, heat the apricot jelly together with the Calvados and brush the apples and the pastry completely with the jelly mixture. Loosen the tart with a metal spatula so it doesn't stick to the paper. Allow to cool and serve warm or at room temperature."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 teaspoon kosher salt",
        "1 tablespoon sugar",
        "12 tablespoons (1 1/2 sticks) cold unsalted butter, diced",
        "1/2 cup ice water",
        "4 Granny Smith apples",
        "1/2 cup sugar",
        "4 tablespoons (1/2 stick) cold unsalted butter, small-diced",
        "1/2 cup apricot jelly or warm sieved apricot jam (see note)",
        "2 tablespoons Calvados, rum, or water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Bastille Day",
        "Apple",
        "Fall",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "French Apple Tart",
    "url": "http://www.epicurious.com/recipes/food/views/french-apple-tart-363307"
}
