{
    "directions": [
        "Bring milk to simmer in small saucepan. Add butter and sugar; stir until butter melts. Pour mixture into large bowl. Add 1 cup room-temperature water and cool mixture until lukewarm (85°F to 95°F), about 10 minutes. Add yeast; stir to blend. Stir in olives, thyme and salt. Add 1 cup flour. Using wood spoon, stir until flour is incorporated. Add 3 cups flour, 1 cup at a time, and stir vigorously with wood spoon until incorporated after each addition. If necessary, add up to 1/2 cup more flour until dough is smooth and begins to pull away from sides of bowl. Oil large bowl. Transfer dough to bowl; turn to coat with oil. Cover bowl tightly with plastic wrap. For do-ahead version: Chill dough overnight. For same-day version: Let dough rise in warm draft-free area until doubled in volume, about 45 minutes (do not punch down dough).",
        "Position rack in center of oven and preheat to 500°F. Oil large baking sheet. Turn dough out onto floured work surface (to avoid deflating, do not punch down dough and do not knead dough). Divide dough into 2 equal pieces. Gently form (do not knead) each piece into baguette 15 inches long by 2 1/4 to 2 1/2 inches wide (dough will not be smooth). Transfer baguettes to prepared baking sheet, spacing evenly apart. Cover loosely with plastic wrap. Let rise in warm draft-free area until slightly puffed, about 30 minutes for refrigerated dough and 15 minutes for room-temperature dough.",
        "Brush top of each loaf lightly with egg white. Generously spray inside of oven with water (about 8 sprays); immediately place loaves in oven. Bake 10 minutes. Reduce oven temperature to 400°F and continue to bake until loaves are deep golden and sound hollow when tapped, about 35 minutes. Cool on rack."
    ],
    "ingredients": [
        "1 cup whole milk",
        "2 teaspoons butter",
        "2 teaspoons sugar",
        "1 cup water, room temperature",
        "2 teaspoons active dry yeast (for do-ahead version) or quick-rising dry yeast (for same-day version)",
        "3/4 cup chopped pitted Kalamata olives or other brine-cured black olives (about 4 ounces pitted)",
        "2 teaspoons chopped fresh thyme",
        "2 teaspoons salt",
        "4 cups (or more) all purpose flour",
        "Olive oil",
        "1 egg white, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Olive",
        "Bake",
        "Thyme"
    ],
    "title": "French Bread with Kalamata Olives and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/french-bread-with-kalamata-olives-and-thyme-104688"
}
