{
    "directions": [
        "Place the water, beef ribs, parsnips, onions, carrots, celery, bay leaves, 1 teaspoon of salt, 1 teaspoon of black pepper, and 1 tablespoon of fresh thyme into a large soup pot over medium heat, and bring to a boil. Reduce heat to a simmer, and cook, skimming and discarding the foam that forms on the top of the broth, until the broth is a rich brown color, 5 to 6 hours. Broth may be made in a slow cooker. Strain the broth, discard the ribs and vegetables, and refrigerate extra broth.",
        "Melt butter in a large heavy skillet or cast iron pan over medium-low heat, and cook the onions and garlic until caramelized and brown, about 30 minutes. Mix flour, herbes de Provence, paprika, and garlic powder together in a bowl, and sprinkle the flour mixture over the browned onions. Cook and stir 5 minutes; add salt and black pepper to taste, and mix in parsley and 1 more teaspoon of thyme.",
        "Pour in 4 cups of beef broth, white wine, sherry, and hot pepper sauce;  simmer until the flavors have blended and the soup has thickened, at least 15 minutes. More time couldn't hurt.",
        "About 15 minutes before serving time, preheat oven's broiler, and place a rack about 6 inches from the heat source.",
        "Brush the slices of French bread with flavored olive oil, and toast under the preheated broiler until well browned on each side, 1 to 2 minutes per side. Ladle soup into ovenproof soup bowls, and place a toasted bread slice on top of each bowl. Sprinkle each bread slice evenly with Gruyere cheese.",
        "Place the filled soup bowls under the broiler until the cheese is melted, bubbly, and browned, 2 to 4 minutes or as needed."
    ],
    "ingredients": [
        "12 cups water",
        "1 pound beef short ribs",
        "3 parsnips, peeled and cubed",
        "3 onions, coarsely chopped",
        "2 carrots, peeled and coarsely chopped",
        "2 stalks celery with leaves, coarsely chopped",
        "2 bay leaves",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "1 tablespoon fresh thyme",
        "1/4 cup butter",
        "4 large onions, thinly sliced",
        "3 cloves garlic, smashed",
        "1/4 cup flour, or more as needed",
        "1 teaspoon herbes de Provence",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "1 teaspoon chopped fresh parsley, or to taste",
        "1 teaspoon chopped fresh thyme, or to taste",
        "1/4 cup dry white wine",
        "2 tablespoons dry sherry",
        "1 dash hot pepper sauce (such as Tabasco®), or to taste",
        "4 thick slices French bread",
        "basil and garlic-flavored olive oil for brushing",
        "2 cups grated Gruyere cheese",
        "1 pinch sea salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "French Onion Soup with Homemade Beef Stock",
    "url": "http://allrecipes.com/recipe/218464/french-onion-soup-with-homemade-beef/"
}
