{
    "directions": [
        "Preheat the oven to 300 degrees F using the convection setting. Line 3 baking sheets with silicone mats. Measure the confectioners' sugar and almond flour by spooning them into measuring cups and leveling with a knife. Transfer to a bowl; whisk to combine.",
        "Sift the sugar-almond flour mixture, a little at a time, through a fine-mesh sieve into a large bowl, pressing with a rubber spatula to pass through as much as possible. It will take a while, and up to 2 tablespoons of coarse almond flour may be left; just toss it.",
        "Beat the egg whites, cream of tartar and salt with a mixer on medium speed until frothy. Increase the speed to medium high; gradually add the superfine sugar and beat until stiff and shiny, about 5 more minutes.",
        "Transfer the beaten egg whites to the bowl with the almond flour mixture. Draw a rubber spatula halfway through the mixture and fold until incorporated, giving the bowl a quarter turn with each fold.",
        "Add the food coloring and extract (see below). Continue folding and turning, scraping down the bowl, until the batter is smooth and falls off the spatula in a thin flat ribbon, 2 to 3 minutes.",
        "Transfer the batter to a pastry bag fitted with a 1/4-inch round tip. Holding the bag vertically and close to the baking sheet, pipe 1 1/4-inch circles (24 per sheet). Firmly tap the baking sheets twice against the counter to release any air bubbles.",
        "Let the cookies sit at room temperature until the tops are no longer sticky to the touch, 15 minutes to 1 hour, depending on the humidity. Slip another baking sheet under the first batch (a double baking sheet protects the cookies from the heat).",
        "Bake the first batch until the cookies are shiny and rise 1/8 inch to form a \"foot,\" about 20 minutes. Transfer to a rack to cool completely. Repeat, using a double sheet for each batch. Peel the cookies off the mats and sandwich with a thin layer of filling (see below).",
        "Almond-Raspberry:",
        "Tint the batter with 2 drops neon pink gel food coloring; flavor with almond extract. Fill with seedless raspberry jam (you'll need about 3/4 cup).",
        "Mint-White Chocolate:",
        "Tint the batter with 2 drops mint green gel food coloring; flavor with mint extract. For the filling, microwave 3 ounces chopped white chocolate, 2 tablespoons heavy cream and 1 tablespoon butter in 30-second intervals, stirring, until smooth. Stir in 1/4 teaspoon mint extract and 1 drop mint green gel food coloring.",
        "Blueberry Cheesecake:",
        "Tint the batter with 3 drops royal blue gel food coloring; flavor with vanilla extract. For the filling, mix 4 ounces softened cream cheese and 3 tablespoons blueberry jam.",
        "Lavendar-Honey:",
        "Tint the batter with 2 drops violet gel food coloring; flavor with almond or vanilla extract. For the filling, mix 3/4 cup mascarpone cheese, 2 tablespoons honey and 1 teaspoon ground dried lavender.",
        "Pineapple:",
        "Tint the batter with 2 drops lemon yellow gel food coloring; flavor with vanilla extract. For the filling, press 3/4 cup pineapple jam through a sieve, discarding any large pieces.",
        "Photograph by Levi Brown"
    ],
    "ingredients": [
        "1 3/4 cups confectioners' sugar",
        "1 cup almond flour",
        "3 large egg whites, at room temperature",
        "1/4 teaspoon cream of tartar",
        "Pinch of salt",
        "1/4 cup superfine sugar",
        "2 to 3 drops gel food coloring (see below)",
        "1/2 teaspoon vanilla, almond or mint extract",
        "Assorted fillings (see below)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Cookie",
        "Nut Recipes",
        "Low-Fat",
        "Diabetes-Friendly",
        "Heart-Healthy",
        "Low Calorie",
        "Low Sodium",
        "Gluten Free",
        "Low-Cholesterol"
    ],
    "title": "French Macaroons",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/french-macarons"
}
