{
    "directions": [
        "Peel, core, and cut apples into 1-inch pieces (about 4 cups). Place apples in medium saucepan; add 1/4 cup water, 3 tablespoons sugar, and lemon juice. Bring to boil, stirring occasionally until sugar dissolves. Cover; reduce heat to medium-low and simmer until apples are very tender, stirring frequently, about 12 minutes. Remove from heat. Gently mash apples with fork or potato masher until mixture is very soft but still chunky. Cool completely. DO AHEAD: Filling can be made 2 days ahead. Cover and refrigerate.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 400°F. Line 2 baking sheets with parchment paper.",
        "If using 14-ounce package (1 sheet), roll out pastry on lightly floured surface to 15-inch square. If using 16-ounce package (2 sheets), stack sheets together and roll out on lightly floured surface to 15-inch square. Cut pastry into nine 5-inch squares. Place 1 generous tablespoon filling in center of each of 8 squares (reserve remaining square for another use). Lightly brush edges of 1 pastry with beaten egg. Fold half of pastry square over filling, forming triangle. Press and pinch pastry edges with fingertips to seal tightly. Lightly brush pastry with beaten egg. Sprinkle lightly with superfine sugar, if desired. Repeat with remaining squares. Using thin, sharp knife, make 3 small slits on top of each triangle to allow steam to escape. Place triangles on prepared baking sheets. Refrigerate until firm, about 15 minutes.",
        "Bake turnovers until beginning to color, about 15 minutes. Reverse baking sheets from top to bottom. Reduce oven temperature to 350°F; continue baking until turnovers are firm and golden, 10 to 15 minutes longer. Cool at least 15 minutes before serving. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3/4 pound Granny Smith apples",
        "3/4 pound Golden Delicious apples",
        "1/4 cup water",
        "3 tablespoons sugar",
        "3/4 teaspoon fresh lemon juice",
        "1 14- to 16-ounce package all-butter frozen puff pastry (1 or 2 sheets, depending on brand), thawed",
        "1 egg, beaten to blend (for glaze)",
        "Superfine sugar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "High Fiber",
        "Back to School",
        "Frozen Dessert",
        "Apple",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "French Apple Turnovers (_Chaussons Aux Pommes_)",
    "url": "http://www.epicurious.com/recipes/food/views/french-apple-turnovers-em-chaussons-aux-pommes-em-350419"
}
