{
    "directions": [
        "In a medium saucepot over medium heat, melt 2 tablespoons of the butter. Add the cognac, onions and thyme and cook until the onions are soft and caramelized. Add the stock and continue cooking, stirring occasionally, until most of the liquid has evaporated, about 20 minutes total. Remove the thyme sprigs and set the mixture aside.",
        "In a heavy-bottomed saucepan, melt the remaining 3 tablespoons butter. Using a whisk, whisk in the flour and cook, stirring constantly, until the flour does not have a raw flavor, about 2 minutes. The mixture will bubble a bit; do not let it brown. Whisk in the milk, making sure the mixture is smooth and there are no lumps. Continue to cook and stir as the sauce thickens. Whisk in 8 ounces of the cheese until melted and bring the mixture to a boil. Add salt and white pepper to taste, lower the heat and cook, stirring, for 2 to 3 minutes more. Remove from the heat and set aside. (To cool this sauce for later use, cover it with plastic wrap to prevent a skin from forming on the top of the sauce.)",
        "Pile up the remaining 12 ounces grated cheese on some wax paper and mold the cheese back together with your hands. Roll the cheese out as if you were rolling dough. With a 4-inch ring, cut out 6 rounds. Set aside. Using the same ring, mold out 6 burgers with the ground beef, each around 3/4 inch high.",
        "Heat a grill pan over high heat. Lightly brush the pan with olive oil.",
        "Brush both sides of the burgers with olive oil. Sprinkle on a generous amount of salt and some brown sugar. Cook the burgers on the grill pan for 5 to 6 minutes on the first side. Flip the burgers, top with the cheese and cook until the cheese melts and the burgers are cooked to desired doneness, 5 to 6 minutes for medium.",
        "Butter the toasted English muffins. Spread 1 teaspoon of the Dijon mustard on the bottom halves of each muffin. Place the burgers on top and then top with a tablespoon of the sauteed onions, followed by a tablespoon of the bechamel sauce. Place the other halves of the muffins on top and serve."
    ],
    "ingredients": [
        "5 tablespoons butter, plus more for buttering muffins",
        "1/3 cup cognac",
        "4 large Spanish onions, halved lengthwise and cut into thin half-moon slices",
        "2 sprigs fresh thyme",
        "1 cup beef or chicken stock",
        "2 tablespoons flour",
        "1 1/4 cups milk, warmed",
        "20 ounces (1 1/4 pounds) grated Emmental cheese",
        "Salt and freshly ground white pepper",
        "3 pounds ground beef, a mixture of 70 percent chuck and 30 percent brisket, chilled",
        "Olive oil, for brushing",
        "Light brown sugar, for sprinkling",
        "6 large English muffins, such as Thomas', toasted",
        "Dijon mustard, for topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Burger",
        "Onion Recipes",
        "Vegetable",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "French Onion Soup Burger",
    "url": "http://www.foodnetwork.com/recipes/french-onion-soup-burger"
}
