{
    "directions": [
        "In a food processor blend together 2 1/2 cups flour, oil, yolks, and 6 tablespoons water, incorporating as much of additional 2 tablespoons water as necessary, until mixture just begins to form a ball. On a lightly floured surface knead dough, incorporating as much of additional flour as necessary, until smooth and elastic, about 8 minutes. Quarter dough and wrap 3 pieces separately in plastic wrap.",
        "Set smooth rollers of a pasta machine at widest setting. Flatten unwrapped piece of dough into a rectangle and fee through rollers. Fold rectangle in half and feed through rollers 8 more times, folding in half crosswise each time and dusting with flour as necessary to prevent sticking.",
        "Turn dial to next (narrower) setting and feed through rollers without folding. Continue to feed dough through, without folding, turning dial to make space between rollers narrower each time, until dough has been rolled through narrowest setting and is a smooth sheet, about 2 1/2 feet by 4 inches. Halve pasta sheet crosswise. Lightly brush 1 side of 1 pasta sheet with cold water and evenly arrange 1/2 cup parsley over it. Drape remaining half sheet over parsley-topped pasta sheet, gently pressing down to force out any air. Set rollers to second narrowest setting and feed filled pasta sheet between rollers. Put pasta sheet on a dry kitchen towel. Roll out and fill remaining 3 pieces dough in same manner, putting each on a dry kitchen towel.",
        "Attach ribbon pasta cutters to pasta machine and attach handle to widest cutter. Line a tray with another dry kitchen towel. Feed first pasta sheet, which will have dried slightly but should still be soft and pliable, through cutter and toss tagliatelle generously with flour. Form tagliatelle loosely into a nest and arrange on towel-lined tray. Make more tagliatelle in same manner with remaining pasta sheets. Makes about 3/4 pound.",
        "Fill a 6-quart kettle three fourths full with salted water and bring to a boil for tagliatelle.",
        "Trim mushrooms and cut stems from caps. Separately cut stems and caps into 1/4-inch-thick slices. Mince garlic. In a large skillet cook stems in 2 tablespoons oil over moderate heat, stirring occasionally, until stems are tender and liquid they give off is evaporated, about 5 minutes. With a slotted spoon transfer stems to a small bowl. In skillet cook caps in remaining 2 tablespoons oil over moderate heat, stirring occasionally, until caps are tender and liquid they give off is evaporated, about 3 minutes. Add stems, garlic, and butter and cook, stirring, 1 minute. Add wine and cook, stirring occasionally, until wine is evaporated. Season mushrooms with salt and pepper.",
        "Cook _tagliatelle_in boiling water until al dente about 1 1/2 minutes. Reserve 1/2 cup cooking water and drain tagliatelle in colander. Add tagliatelle and reserved cooking water to mushroom mixture and toss to combine.",
        "Serve tagliatelle immediately with freshly grated Parmigiano-Reggiano.",
        "*Available at specialty foods shops and by mail order from Dean & DeLuca, (800) 221-7714.",
        "**Available seasonally at many specialty food shops and by mail order from Comptoir Exotique, (888) 547-5471."
    ],
    "ingredients": [
        "2 1/2 cups '00' (Italian soft wheat) flour* or cake flour (not rising) plus additional for kneading and tossing",
        "3 tablespoons olive oil",
        "4 large egg yolks",
        "6 to 8 tablespoons water",
        "2 cups fresh flat-leafed parsley leaves",
        "1 pound fresh porcini mushrooms**",
        "3 large garlic cloves",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon unsalted butter",
        "1/2 cup dry white wine",
        "Accompaniment: freshly grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Gourmet"
    ],
    "title": "Fresh Parsley Tagliatelle with Porcini",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-parsley-tagliatelle-with-porcini-14929"
}
