{
    "directions": [
        "Prepare the filling by placing  the heavy cream, 3/4 cup sugar and 2 tablespoons coconut cream in a heavy saucepan over medium heat; bring to a simmer. Whisk together the cornstarch and 1 tablespoon coconut milk. Stir into the simmering cream until smooth; cook, stirring, for 3 minutes. Add the 1/2 cup butter and 1 cup shredded coconut; continue cooking, stirring 3 minutes longer. Cool to room temperature and then refrigerate until thickened, about 2 hours. Keep refrigerated until ready to assemble cake.",
        "Preheat the oven to 350 degrees F (175 degrees C). Grease three 9 inch round cake pans and line the bottoms with parchment paper. Grease the paper and then flour the pans lightly, tapping out any excess. Sift together the flour, baking powder and salt. Set aside.",
        "Place the 1 1/2 cups sugar and eggs in a large mixing bowl and beat with an electric mixer for 1 minute. Gradually add the 3/4 cup butter, 1 tablespoon vanilla extract and 1 cup coconut milk; continue beating for 2 minutes. Add the flour mixture and beat for 1 minute.",
        "Pour the batter evenly into the prepared cake pans. Bake in the center of the oven for 20 minutes or until a wooden toothpick inserted in the center comes out clean. Cool the cakes in the pans on a rack for 20 minutes. Unmold the cakes, carefully peel off the paper and allow to cool completely on a rack.",
        "Prepare the icing by beating together the cream cheese and 1/2 cup butter. Add 1/4 teaspoon salt, confectioners sugar, 3 tablespoons coconut milk and 1 tablespoon vanilla; beat until smooth.",
        "Prepare the syrup by placing the 1 cup sugar, 1 cup water and 1/4 teaspoon vanilla extract in a small saucepan. Bring to a boil and continue to boil, while stirring for 3 minutes. Remove from heat and brush the top of each cake layer with the syrup using a pastry brush. You don't have to use all of the syrup.",
        "Assemble the cake by placing one cake layer on a serving platter. Spread it with a layer of the reserved filling and top with another cake layer. Spread the cake with the filling and top with the remaining cake layer. Ice the top and sides of the cake and sprinkle the top with 1/2 cup shredded fresh coconut."
    ],
    "ingredients": [
        "1 1/4 cups heavy whipping cream",
        "3/4 cup white sugar",
        "2 tablespoons cream of coconut",
        "1 tablespoon cornstarch",
        "1 tablespoon coconut milk",
        "1/2 cup unsalted butter, softened",
        "1 cup grated fresh coconut",
        "3 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "1 1/2 cups white sugar",
        "4 eggs",
        "3/4 cup unsalted butter, cubed",
        "1 tablespoon vanilla extract",
        "1 cup coconut milk",
        "6 ounces cream cheese, softened",
        "1/2 cup unsalted butter, softened",
        "1/4 teaspoon salt",
        "4 cups sifted confectioners' sugar",
        "3 tablespoons coconut milk",
        "1 tablespoon vanilla extract",
        "1 cup white sugar",
        "1 cup water",
        "1/4 teaspoon vanilla extract",
        "1/2 cup shredded coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Coconut Layer Cake",
    "url": "http://allrecipes.com/recipe/16272/fresh-coconut-layer-cake/"
}
