{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Sift together flour, baking powder and soda, and salt into a bowl. Cut pineapple crosswise into 1/4-inch-thick wedges.",
        "Butter a 9-inch round cake pan (2 inches deep) lightly on side and generously on bottom of pan using 1/2 stick butter. Sprinkle all of brown sugar evenly over bottom and arrange pineapple over it, starting in center of pan and overlapping slices slightly.",
        "Beat together remaining stick butter, granulated sugar, and vanilla with an electric mixer at medium speed until light and fluffy, about 2 minutes, then add eggs 1 at a time, beating well after each addition. Reduce speed to low and add flour mixture alternately with buttermilk in batches, beginning and ending with flour and mixing just until batter is smooth.",
        "Spread batter evenly over pineapple and bake until a wooden pick inserted in center of cake comes out clean, 40 to 45 minutes. Cool 15 minutes in pan on a rack, then invert cake onto a plate and remove pan. Cool to room temperature."
    ],
    "ingredients": [
        "1 2/3 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/2 fresh pineapple, halved lengthwise, cored, and peeled",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1/2 cup packed light brown sugar",
        "2/3 cup granulated sugar",
        "1 teaspoon pure vanilla extract",
        "2 large eggs",
        "2/3 cup well-shaken buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Pineapple",
        "Vanilla",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fresh Pineapple Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-pineapple-upside-down-cake-238072"
}
