{
    "directions": [
        "HEAT the oven to 350°F. Wash the beets and dry them with a paper towel. Place the beets in a small ovenproof pan, drizzle them with the olive oil, and season with a little salt and pepper. Cover the pan with aluminum foil. Bake until the beets are tender when pierced with a paring knife, about 1 hour.",
        "ALLOW the beets to cool. Peel the beets using a small knife and cut them into a medium dice. (Be careful, as beet juice can stain counters, towels, and even your hands; you may want to wear gloves for this step.)",
        "HEAT the butter in a sauté pan over medium heat. Add the onion, season with a little salt, and cook, stirring every few minutes, until the onion is just tender, about 7 minutes. Add the white wine and cook for another minute, scraping up any browned bits stuck to the bottom of the pan.",
        "HEAT the oven to 350°F. Toss the beets and onion together and put them into the blind-baked tart shell.",
        "WHISK together the eggs and cream, season well with salt and pepper, and carefully pour over the beets and onion, letting the cream seep evenly into the beets. Dot the goat cheese all over the top of the tart. Put the tart on a baking sheet and bake it for 20 minutes. Sprinkle the chopped walnuts on top of the tart and drizzle the walnut oil over it, if using. Return the tart to the oven and bake until just set, an additional 15 to 20 minutes. Sprinkle the tart with the chopped parsley and let it rest for at least 5 minutes before serving."
    ],
    "ingredients": [
        "2 to 3 small beets",
        "1 tablespoon olive oil",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon unsalted butter",
        "1 medium onion, thinly sliced",
        "2 tablespoons dry white wine",
        "1 recipe Hamersley's Bistro Tart Dough , shaped and blind-baked according to the directions",
        "3 large eggs",
        "3/4 cup heavy cream",
        "4 ounces fresh goat cheese",
        "1 cup chopped walnuts (about 4 ounces)",
        "1 tablespoon walnut oil (optional)",
        "About 2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Cheese",
        "Egg",
        "Olive",
        "Onion",
        "Bake",
        "Lunch",
        "Goat Cheese",
        "Walnut",
        "Beet",
        "Parsley",
        "Butter",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fresh Goat Cheese, Roasted Beet, and Walnut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-goat-cheese-roasted-beet-and-walnut-tart-358319"
}
