{
    "directions": [
        "I like to begin the platter with a base of ripe, colorful, sliced melons and pineapple--for example, cantaloupe, honeydew, Galia, or Cavaillon melons, plus the new \"golden\" pineapples. Peel the outside of a whole melon, cut it in half through the stem end, and scoop out the seeds. Place the melon halves cut side down on a board, and slice them straight across into 1/2-inch-thick slices. Fan each half-melon out slightly and arrange it on the platter. Next, cut off the top and bottom of the pineapple, peel the outside, and use a sharp knife to remove the \"eyes.\" Cut the pineapple in half lengthwise and remove the core by cutting a \"V\" down the center of each half. Again, place the pineapple halves, cut side down, on a board and slice them straight across into 1/2-inch-thick slices. Fan the slices out and arrange them next to the melon on the platter.",
        "Once the base is set, you can add any kind of fruit that's available. I like to have one thing that is taller than the rest, such as a large bunch of grapes or a decoratively cut papaya, to give the platter height. Then I add raspberries, strawberries, blueberries, and fresh figs in casual but organized groups. The platter can look like a bowl of M&M's if there are too many colors scattered with no order. Visually, your eye needs to have a focal point and to be able to see each type of fruit. After all the fruit is arranged, I add flat green leaves around the outside of the fruit, to set off the colors. Use lemon and galax leaves from your florist, or fig leaves and grape leaves from your garden. Make sure they are pesticide-free and well washed.",
        "Any kind of fruit will work well on this platter. For special occasions, add persimmons, kiwi, passion fruit, Queen Anne cherries, fresh apricots, and mangos. Choose whatever is colorful and seasonal."
    ],
    "ingredients": [
        "2 small ripe melons",
        "1 \"golden\" pineapple",
        "2 bunches grapes",
        "1 pint fresh figs",
        "1 pint raspberries",
        "1 pint strawberries",
        "1 pint blueberries",
        "1 red papaya"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "American",
        "Fruit",
        "Appetizer",
        "Recipes for Parties",
        "Summer",
        "Spring"
    ],
    "title": "Fresh Fruit Platter",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/fresh-fruit-platter-recipe"
}
