{
    "directions": [
        "Combine strawberries and 2 tablespoons sugar in a bowl; cover and refrigerate until ready to serve.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Combine flour, 2 tablespoons sugar, baking powder, and salt in a bowl. Cut in butter with a knife or pastry blender until mixture resembles coarse crumbs. Whisk milk, egg yolk, and 3/4 teaspoon lemon zest in another bowl; stir into crumb mixture until dough is moistened. Turn dough out onto a lightly floured surface and knead 10 turns. Divide dough in half; pat or roll out into a 3/4-inch thick round. Transfer rounds to a baking sheet.",
        "Bake in preheated oven until golden brown, 8 to 10 minutes. Remove to cool on a wire rack for 15 minutes. Split each shortcake in half horizontally.",
        "Mix yogurt, sour cream, agave nectar, and 1/2 teaspoon lemon zest in a bowl; set aside. Beat whipping cream in another bowl until foamy. Add 1 teaspoon sugar, continuing to beat cream until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.",
        "Arrange cake bottoms on dessert plates and evenly spread with yogurt mixture. Top each cake with 1/4 of the strawberries and 1/4 of the whipped cream. Place the cake tops over the whipped cream and cover with remaining strawberries and whipped cream."
    ],
    "ingredients": [
        "1 1/2 cups sliced fresh strawberries",
        "2 tablespoons white sugar",
        "1 cup all-purpose flour",
        "2 tablespoons white sugar",
        "3/4 teaspoon baking powder",
        "1/8 teaspoon salt",
        "2 tablespoons butter",
        "3 tablespoons 2% milk",
        "1 egg yolk, beaten",
        "3/4 teaspoon lemon zest",
        "1/4 cup nonfat plain yogurt",
        "1/4 cup reduced-fat sour cream",
        "1 tablespoon agave nectar",
        "1/2 teaspoon lemon zest",
        "1/3 cup heavy whipping cream",
        "1 teaspoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Strawberry Lemon Shortcake",
    "url": "http://allrecipes.com/recipe/228835/fresh-strawberry-lemon-shortcake/"
}
