{
    "directions": [
        "Tear bread into pieces and pulse to fine crumbs in a food processor. Transfer a scant cup of crumbs to a bowl for fish cakes and reserve remaining 1 1/2 cups in a shallow bowl for coating. Pulse celery and scallions in processor until coarsely chopped, then add parsley and pulse until finely chopped. Combine celery mixture with scant cup crumbs in bowl (for fish cakes).",
        "Pulse fish in processor until finely chopped (be careful not to process to a paste). Add fish to celery-crumb mixture along with egg, 1/4 teaspoon salt, and 1/8 teaspoon pepper, stirring until combined well.",
        "Season bread crumbs in shallow bowl with remaining 1/4 teaspoon salt and 1/8 teaspoon pepper. Gently shape fish mixture into 4 (4-inch) patties (mixture will be soft) and coat well with seasoned bread crumbs. Chill, uncovered, on a wax-paper-lined large plate 10 minutes.",
        "Heat 1 1/2 tablespoons oil in a 12-inch nonstick skillet over moderate heat until hot but not smoking, then fry 2 fish cakes, turning over once, until golden brown and cooked through, 8 to 10 minutes total. Repeat with remaining 1 1/2 tablespoons oil and 2 fish cakes, wiping out skillet with a paper towel between batches."
    ],
    "ingredients": [
        "5 slices firm white sandwich bread",
        "1 large celery rib, cut into 2-inch pieces",
        "2 scallions, cut into 2-inch pieces",
        "1/4 cup loosely packed fresh flat-leaf parsley",
        "1 lb skinless cod fillet, any bones removed and fish coarsely chopped",
        "1 large egg, lightly beaten",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "3 tablespoons vegetable oil",
        "Accompaniment: tartar sauce and lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Fry",
        "Quick & Easy",
        "Cod",
        "Parsley",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fresh Cod Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-cod-cakes-107971"
}
