{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 10 inch round cake pan.",
        "Combine the egg whites and water in a large glass or metal bowl. Whip the egg whites to soft peaks in a large bowl. Continue to whip, while gradually adding sugar until egg whites can stand in stiff peaks. Continue to whip on medium speed while adding one egg yolk at a time. Combine the flour and baking powder; fold gently into the batter. Pour the batter into the prepared cake pan.",
        "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes. Cool the cake in the pan for 10 minutes before turning  out onto a wire rack to cool completely.",
        "Stir the cornstarch with the water in a small bowl to dissolve and set aside. In a medium saucepan, beat together the sweetened condensed milk and the egg yolks. Bring the mixture to a boil over medium-high heat, stirring constantly. Stir in the cornstarch mixture. When the filling thickens, remove from heat and set aside to cool.",
        "Mix together the strawberries, peaches, and blueberries in a medium bowl. Using a thread or a bread knife, slice the cooled cake in half horizontally. Spread the mixed fruit across the bottom half of the cake, pour any fruit juice over the berries to moisten the cake. Spread the cream filling over the top of the fruit. Top with the other half of the cake. Frost the cake with whipped cream or your favorite white frosting."
    ],
    "ingredients": [
        "4 egg whites",
        "6 tablespoons water",
        "2 cups white sugar",
        "4 egg yolks",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 1/2 tablespoons cornstarch",
        "1/2 cup water",
        "1 (14 ounce) can sweetened condensed milk",
        "3 egg yolks",
        "3/4 cup sliced strawberries",
        "3/4 cup sliced peaches",
        "1/2 cup blueberries",
        "2 cups whipped cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Fruit Cake",
    "url": "http://allrecipes.com/recipe/142428/fresh-fruit-cake/"
}
