{
    "directions": [
        "Drain the feta and place it in a medium bowl. Grind the spices coarsely, if desired. Heat a small skillet over high heat. Add the coriander, cumin, and caraway seeds, and shake the pan continuously until the spices start to release their aroma, about 2 minutes. Immediately transfer to a bowl and pour in the olive oil. Add a pinch of coarse salt. Swirl the spices in the oil and steep for a few minutes. Pour the mixture over the feta. You can even work it in with your hands, gently crumbling the feta, if desired.",
        "Wash and dry the herbs. Trim the stems, but leave them intact. Place the herbs on a large platter in a few fluffy piles. Place the walnuts on the platter, along with the radishes and lavash. Transfer the feta to the platter and garnish it with coarse salt.",
        "For a single serving, pick up a few stalks of herbs. Tear the flatbread into a manageable piece and stuff it with the herbs, walnuts, a small piece of cheese, and a radish or two. Fold and eat like a sandwich."
    ],
    "ingredients": [
        "8 ounces feta cheese",
        "1 tablespoon coriander seeds",
        "1 tablespoon cumin seeds",
        "1 tablespoon caraway seeds",
        "1/3 cup extra-virgin olive oil",
        "Coarse salt, such as Maldon salt, fleur de sel, or kosher salt",
        "2 bunches whole fresh herbs, in any combination: spearmint, basil, cilantro, flat-leaf parsley, tarragon, dill, chives, marjoram",
        "1 bunch scallions, quartered crosswise, roots removed",
        "2 cups walnuts (see Note below)",
        "6 radishes, trimmed and quartered",
        "Lavash or other flatbread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Herb",
        "Nut",
        "Vegetable",
        "Appetizer",
        "Vegetarian",
        "Feta",
        "Basil",
        "Tree Nut",
        "Walnut",
        "Spice",
        "Root Vegetable",
        "Radish",
        "Tarragon",
        "Chive",
        "Dill",
        "Cilantro",
        "Parsley",
        "Seed",
        "Coriander",
        "Cumin",
        "Green Onion/Scallion",
        "Advance Prep Required",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fresh Herb Platter (Sabzi Khordan)",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-herb-platter-em-sabzi-khordan-em-51155550"
}
