{
    "directions": [
        "To Make Tart Shell:  Roll out one sheet of puff pastry, and cut into a 6 x 14 inch rectangle.  Place on a baking sheet. Cut 1 inch strips from scraps to trim the edges with.  Brush cold water along a 1 inch border on each edge of the rectangle, and set strips on top to frame the edges.  Beat 1 egg, and brush onto surface of pastry.  Chill until firm, about 15 minutes; this is an important step.",
        "Heat oven to 400 degrees F (205 degrees C).  Bake shell in preheated oven until it is starting to brown, around 10 minutes.  Remove pastry from oven, and reduce heat to 375 degrees F (190 degrees C).  Press base firmly with back of a fork to collapse it.  Return to oven, and bake until golden, around 8 minutes.  Transfer to rack to cool.  This can be made up to 2 days in advance; store at room temperature in an airtight container.",
        "To Make White Chocolate Custard:  Heat milk on medium heat in heavy saucepan, stirring, until it comes to a boil.  Remove from heat. Add vanilla bean to milk, cover, and steep for 10 minutes.  Remove vanilla bean.  Meanwhile, whip yolks with sugar until thick and light colored.   Whisk in flour.  Gradually stir hot milk into the yolk mixture, stirring until smooth.  Pour into the sauce pan.  Bring to a boil over medium heat, whisking constantly, until it thickens.  Lower the heat.  Continue cooking the pastry cream, whisking constantly, until it softens slightly; this should take about 2 minutes.  Remove from heat, and fold in white chocolate.  Transfer pastry cream to small bowl, and cover with plastic wrap.  Unwrap when cool, and add creme de cacao.  This can be made 1 day in advance;  cover and refrigerate until needed.",
        "The Chambord sauce  can be made up to 2 days in advance.  Puree the defrosted raspberries in a blender.  Strain to remove the seeds, and stir in 3 tablespoons Chambord liqueur.  Keep refrigerated.",
        "When you are ready to assemble the tart, make the glaze.  In a saucepan, melt preserves over low heat.  Remove from heat, and stir in 1 tablespoon liqueur.  Use while warm.",
        "This tart is best if consumed within 3 to 4 hours of final assembly.  Brush bottom of tart with glaze, and sprinkle with half of the chopped almonds.  Spoon custard into pastry shell, and smooth.  Arrange fresh berries over top of custard, and brush with glaze.  Sprinkle remaining almonds on top.  Chill until ready to serve."
    ],
    "ingredients": [
        "1/2 (17.5 ounce) package frozen puff pastry, thawed",
        "1 egg",
        "2 cups milk",
        "1 vanilla bean (optional)",
        "6 egg yolks",
        "6 tablespoons white sugar",
        "1/4 cup all-purpose flour",
        "1/2 cup white chocolate chips",
        "2 tablespoons creme de cacao",
        "1/2 cup raspberry jam",
        "1 tablespoon Chambord (raspberry liqueur)",
        "1/4 cup toasted and chopped almonds",
        "2 cups fresh raspberries",
        "2 cups fresh blueberries",
        "2 cups fresh blackberries",
        "1 (10 ounce) package frozen raspberries, thawed",
        "3 tablespoons Chambord (raspberry liqueur)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Berry Tart with Chambord Sauce",
    "url": "http://allrecipes.com/recipe/12204/fresh-berry-tart-with-chambord-sauce/"
}
