{
    "directions": [
        "Place the water in the bowl of a stand mixer. Add the sugar, sprinkle the yeast over the water and let it bloom until bubbly, 5 to 15 minutes.",
        "In a mixing bowl, combine the all-purpose and wheat flours together with the salt and chopped rosemary. Gradually add the flour mixture to the bloomed yeast in the mixing bowl. Then add 1/2 cup of the olive oil.",
        "Using the dough hook attachment, mix the dough on medium speed until it becomes smooth and soft, 8 to 10 minutes. The dough will be very loose.",
        "Transfer the dough to a clean, floured surface and knead the dough by hand for 2 to 3 minutes.",
        "Wipe out the bowl you mixed the dough in and then coat the bowl with some olive oil. Return the dough to the oiled bowl and let it rest in a warm place, covered with a dish towel, until doubled in size, 30 to 35 minutes.",
        "Oil a 9-by-13-inch baking sheet with the remaining 1/2 cup olive oil. Spread the dough into the pan using your fingertips to create dimples into the dough. The more dimples you make, the more texture the bread will have.",
        "Using a pastry brush, oil the dough and place leaves of rosemary into some of the dimples. Top with the tomato slices and sprinkle with the Parmesan. Cover the dough again with the towel and let rest in a warm spot until doubled in size, another 30 minutes.",
        "Preheat the oven to 425 degree F and set a rack in the middle of the oven.",
        "Bake the dough until golden brown, 35 to 40 minutes."
    ],
    "ingredients": [
        "2 cups warm water (105 to 110 degrees F)",
        "1 tablespoon sugar",
        "2 packages active dry yeast",
        "4 cups all-purpose flour, plus more for dusting",
        "1 cup whole wheat flour",
        "1 1/2 tablespoons kosher salt",
        "1 teaspoon chopped fresh rosemary, finely chopped, plus leaves, for garnish",
        "1 cup olive oil, plus more for brushing",
        "8 thinly sliced rounds beefsteak tomato",
        "2 tablespoons grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Tomato Side Dish",
        "Tomato",
        "Vegetable",
        "Bread",
        "Focaccia Recipes"
    ],
    "title": "Fresh Focaccia",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/fresh-focaccia-recipe"
}
