{
    "directions": [
        "Position rack in bottom third of oven and preheat to 400°F. Line heavy large rimless baking sheet with foil. Roll out puff pastry on lightly floured work surface to 14-inch square. Cut off 1-inch-wide strips from each side of square. Brush strips with beaten egg. Place strips atop edges of pastry square, egg side down, pressing to adhere. Trim ends to fit. Transfer pastry square to prepared baking sheet. Combine almonds, 2 tablespoons sugar and flour in small bowl. Sprinkle evenly over bottom of pastry. (Can be made 3 hours ahead. Chill.)",
        "Place plums in large bowl. Add 4 tablespoons sugar; toss to coat. Arrange plums decoratively over almond mixture.",
        "Bake tart until pastry is golden brown and puffed and plums are tender, about 30 minutes. Transfer pan to rack. Using metal spatula, loosen tart from baking sheet, leaving tart on sheet.",
        "Stir preserves and water in heavy small saucepan over low heat until preserves melt. Brush over warm plums.",
        "Beat cream, sour cream and 1 tablespoon sugar in medium bowl until soft peaks form. Serve tart warm or at room temperature with sour cream topping."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "1 egg, beaten to blend",
        "1/2 cup sliced almonds, toasted",
        "7 tablespoons sugar",
        "2 tablespoons all purpose flour",
        "1 3/4 pounds red plums (such as Santa Rosa, about 8 large), pitted cut into 1/3-inch-thick wedges",
        "1/3 cup plum preserves",
        "1 tablespoon water",
        "1/2 cup chilled whipping cream",
        "1/4 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Plum",
        "Summer",
        "Sour Cream"
    ],
    "title": "Fresh Plum Tart with Sour Cream Topping",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-plum-tart-with-sour-cream-topping-2299"
}
