{
    "directions": [
        "Combine the flours and salt in a large bowl and stir well. Pour the mixture onto a clean work surface, make it into a mound, and use a spoon or your fingers to carve out a big well in the center that's big enough to hold the whole egg and egg yolks. Add the egg and yolks to the well.",
        "Use a fork, holding the tines parallel to your work surface, to break the yolks and stir the eggs in a circular motion. As you stir, you'll see flour from the walls of your well tumbling into the egg. Keep stirring, gradually incorporating the flour into the eggs and occasionally gathering the border of flour closer to the slowly expanding bright yellow center. After 4 minutes or so, you should have a very wet dough surrounded by flour. Now use your hands or a dough scraper to slowly incorporate the rest of the flour, folding and pressing until it's all incorporated.",
        "Cut the dough in half. Knead one piece at a time, keeping the other wrapped in plastic, by pressing firmly down and forward with your palm (one hand on top of the other for force), then folding the dough back onto itself, pushing down and forward again, and turning the dough and doing it all over. Keep at it until the dough is smooth like a baby's bum, 5 to 7 minutes. Kneading will prove more challenging as you work the gluten, so you might occasionally switch to the other piece of dough, wrapping the one you're not kneading in plastic and letting it relax a bit. Wrap each half in plastic wrap and let them rest for at least 20 minutes or up to 1 hour.",
        "Cut each piece of dough in half, rolling out one and keeping the other pieces you aren't working with wrapped in plastic wrap. (As you get more comfortable with the process, you might not need to halve them.)",
        "Work with one piece of dough at a time. Form the dough into a rough rectangle that's about 4 x 6 inches. Set the rollers to the widest setting and feed the dough through twice. (If the dough feels at all sticky or doesn't come cleanly from the machine, dust it with a little flour.) Set the rollers to their second widest setting and feed the dough through once. Continue in this manner until the dough has been through each setting once. This process works the gluten in the dough, giving the pasta a lovely texture. At this point, it's fine if the long sheet of dough looks ragged or uneven.",
        "Fold the sheet of pasta onto itself several times to form a rough rectangle (about 5 x 8 inches) and press firmly with your hands so the layers stick together. Set the rollers to the widest setting again. Feed the dough through once at each setting until you reach about halfway to the narrowest one. Then start feeding the dough through twice at each setting, continuing toward the narrowest one, until your dough is about 6 x 36 inches and about 1 millimeter thick. Cover the dough with a damp towel and repeat with the remaining dough.",
        "Cut the long sheets crosswise into smaller, shorter sections that are as long as you'd like your pasta to be. I like my tagliatelle to be 12 to 15 inches long. Dust each side with semolina, giving the dough a light rub, and stack the sheets neatly. Cut the stack lengthwise into 1/2-inch-wide slices. Gently toss the slices, separating them into individual noodles as you do.",
        "At this point the pasta is ready to cook, but I like to leave it on the counter or a tray for 30 minutes or so to dry out a bit. (The drier the pasta, the more time it'll take to cook and the more time you'll have to do any last-minute prep.) You can store it in a plastic storage container in the refrigerator for up to 2 days."
    ],
    "ingredients": [
        "6 1/2 ounces (about 1 cup) fine semolina flour, plus more for dusting",
        "6 1/2 ounces (about 1 cup) \"00\" or \"doppio zero\" flour, plus more for dusting",
        "1/8 teaspoon kosher salt",
        "1 large egg",
        "12 large egg yolks",
        "A hand-cranked pasta machine or a stand mixer with a pasta-roller attachment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Kid-Friendly"
    ],
    "title": "Fresh Egg Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-egg-pasta-56389513"
}
