{
    "directions": [
        "Preheat oven to 350° F. Butter and flour three 8-inch round cake pans, knocking out excess flour.",
        "Into a bowl sift together flour, baking soda, baking powder, and salt. In a small bowl whisk together mashed banana, yogurt or buttermilk, and vanilla. In a large bowl with an electric mixer beat together butter and sugar until light and fluffy and beat in eggs 1 at a time, beating well after each addition. Stir in flour and banana mixtures alternately, beginning and ending with flour mixture and stirring after each addition until just combined. (Do not overmix.)",
        "Divide batter evenly among pans, smoothing tops, and bake in upper and lower thirds of oven, switching position of pans halfway through baking, about 18 minutes total, or until layers are springy to the touch and a tester comes out clean. Cool layers in pans on racks 10 minutes. Run a thin knife around edges of pans and invert layers onto racks to cool completely. (Cake layers may be made 1 day ahead and kept, wrapped well in plastic wrap, at room temperature.)",
        "Into a large bowl sift confectioners' sugar. In another large bowl with an electric mixer beat together cream cheese and butter until light and fluffy and beat in vanilla and a pinch salt. Beat in confectioners' sugar, a little at a time, and beat frosting until smooth.",
        "Cut 2 firm-ripe bananas diagonally into thin slices. Put a cake layer on a serving plate and spread with a thin coating of frosting. Arrange one layer of banana slices on frosting, overlapping them slightly, and top with second cake layer. Spread cake layer with another thin coating of frosting and arrange 1 more layer of banana slices in same manner, cutting and using slices from third banana if necessary. Top bananas with remaining cake layer and spread remaining frosting over top and sides of cake. (Cake may be made 8 hours ahead and kept in a cake keeper at cool room temperature.)"
    ],
    "ingredients": [
        "2 1/4 cups sifted cake flour (not self-rising; sift before measuring)",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup mashed very ripe banana (about 2 large)",
        "1/4 cup plain yogurt or well-shaken buttermilk",
        "1 teaspoon vanilla",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup granulated sugar",
        "2 large eggs",
        "1 pound confectioners' sugar (about 3 3/4 cups)",
        "8 ounces cream cheese, softened",
        "1 stick (1/2 cup) unsalted butter, softened",
        "2 teaspoons vanilla",
        "2 to 3 large firm-ripe bananas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Banana",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fresh Banana Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-banana-layer-cake-14502"
}
