{
    "directions": [
        "Preheat oven to 375°F. Using electric mixer, beat cream cheese, 1/4 cup powdered sugar, and vanilla in medium bowl until fluffy. Using same beaters, beat whipping cream in another medium bowl until peaks form. Fold whipped cream into cream cheese mixture in 3 additions. Cover mousse and refrigerate.",
        "Roll out pastry sheet on lightly floured surface to 14x10 1/2-inch rectangle. Cut sheet into twelve 3 1/2-inch squares. Pierce squares all over with fork. Sift 1/4 cup powdered sugar over squares. Place squares on ungreased baking sheet. Bake 12 minutes. Using metal spatula, flatten squares and continue baking until crisp and brown, about 5 minutes longer. Cool pastry squares on sheet.",
        "Heat preserves in small saucepan until just melted. Transfer to medium bowl. Add berries and toss to coat.",
        "Place 6 pastry squares on work surface. Spread each with 1/4 cup mousse. Top with 6 to 8 berries. Cover with remaining pastry squares. Dust napoleons with remaining 1/4 cup powdered sugar. Top each with berry and mint sprig. Place napoleons on plates. Serve, passing remaining berries."
    ],
    "ingredients": [
        "6 ounces cream cheese, room temperature",
        "3/4 cup powdered sugar, divided",
        "1 teaspoon vanilla extract",
        "2/3 cup chilled whipping cream",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "1/2 cup blackberry preserves",
        "3 1/2-pint containers fresh blackberries",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Cream Cheese",
        "Blackberry",
        "Spring",
        "Summer",
        "South Carolina",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fresh Blackberry Napoleons with Cream Cheese Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-blackberry-napoleons-with-cream-cheese-mousse-231900"
}
