{
    "directions": [
        "Preheat oven to 375°F. Roll out crust dough on lightly floured surface to 13-inch round. Transfer dough to 9-inch-diameter tart pan with removable bottom. Gently press dough into tart pan; trim excess. Freeze crust 15 minutes.",
        "Place tart pan on baking sheet. Bake crust 10 minutes; pierce with toothpick if crust bubbles. Continue to bake until crust is pale golden, about 12 minutes. Cool crust on baking sheet 15 minutes. Maintain oven temperature.",
        "Blend all ingredients except plums in processor until almonds are finely ground. Spread frangipane filling in prepared crust.",
        "Place plum halves, skin side up, on work surface. Cut 1 plum half into thin parallel slices, keeping plum intact (do not cut through end). Press gently to fan slices. Repeat with remaining plum halves. Place fanned plums, skin side up, atop frangipane; press gently to anchor.",
        "Bake tart on baking sheet until frangipane is puffed and golden and plums are tender, about 30 minutes. Remove tart from baking sheet; transfer to rack.",
        "Stir apricot jam and brandy in heavy small saucepan over medium heat until mixture boils. Strain glaze into small bowl. Brush glaze generously over plums. Cool tart completely. (Tart can be prepared 8 hours ahead. Let stand at room temperature.)",
        "Push pan bottom up to free tart from pan. Cut tart into wedges and serve."
    ],
    "ingredients": [
        "Almond Crust",
        "1 cup slivered blanched almonds",
        "1/3 cup sugar",
        "5 tablespoons unsalted butter, room temperature",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1 teaspoon almond extract",
        "1 teaspoon dark rum",
        "1 teaspoon grated lemon peel",
        "5 large plums, halved, pitted",
        "2 tablespoons apricot jam",
        "2 teaspoons brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Plum",
        "Almond",
        "Brandy",
        "Summer"
    ],
    "title": "Fresh Plum Frangipane Tart",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-plum-frangipane-tart-4113"
}
