{
    "directions": [
        "Bring artichokes, 6 cups broth, and next 5 ingredients to boil in large saucepan, adding more broth if necessary to cover. Reduce heat; cover and simmer until artichoke hearts are very tender, about 50 minutes. Chill artichokes in broth mixture, uncovered, until cold, at least 2 hours and up to 1 day.",
        "Remove artichokes from broth; drain. Pull off leaves. Cut hearts into 1/3-inch cubes; place in large bowl. Mix beans, cheese, 1/4 cup chopped basil, and 2 tablespoons oil into hearts. Season with salt and pepper.",
        "Preheat oven to 400°F. Arrange bread on rimmed baking sheet. Brush with oil. Bake until beginning to crisp, about 8 minutes",
        "Spoon artichoke topping onto bread. Squeeze lemon juice over; top with basil leaf."
    ],
    "ingredients": [
        "4 artichokes, halved lengthwise, tops and stems trimmed, center leaves removed, chokes scraped out",
        "6 cups (or more) low-salt chicken broth",
        "1 cup dry white wine",
        "1/2 cup chopped carrot",
        "1/2 cup chopped onion",
        "1/2 cup chopped celery",
        "2 large fresh thyme sprigs",
        "1 cup drained rinsed canned cannellini (white kidney beans)",
        "1/2 cup grated Pecorino Romano cheese",
        "1/4 cup (packed) finely chopped fresh basil plus whole leaves for garnish",
        "2 tablespoons extra-virgin olive oil plus more for brushing",
        "8 1/3- to 1/2-inch-thick slices pain rustique or other flat country bread",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Bake",
        "Cocktail Party",
        "Parmesan",
        "Lemon",
        "Basil",
        "Artichoke",
        "White Wine",
        "Chill",
        "Healthy",
        "Boil",
        "Maryland"
    ],
    "title": "Fresh Artichoke and White Bean Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-artichoke-and-white-bean-crostini-243438"
}
