{
    "directions": [
        "Thoroughly butter the bottom and sides of an 8-inch/20-cm nonstick skillet. If 2 tablespoons/30 g are not sufficient, use more butter. Place the pan over low heat; when the butter becomes warm, add the chives or onions. Heat gently, just until they give off a little fragrance. Add the herbs and greens and, if necessary, a little more butter. Stir so that all the flavors mingle.",
        "While the greens are heating, beat the eggs, milk, flour, cheese, and a little pepper into a large bowl. Add the egg mixture to the greens and stir with a fork, taking care to avoid scraping the fork along the bottom of the pan. While working with the fork in one hand, shake the pan continuously to prevent the frittata from sticking.",
        "Once the frittata has a rather firm skin on the bottom, slide it out of the pan and onto a plate. Invert the frittata back into the pan so that the less-cooked side of the frittata is now face-down in the pan. Return to the heat and cook for 2 to 3 minutes, shaking the pan continuously to prevent sticking. The frittata is done when the bottom is firm and light chestnut-brown.",
        "Slide the frittata onto a dish for serving. If you plan to cool the frittata, cover it with a clean cloth or paper towels. Cut into wedges before serving.",
        "Variations: To make a baked omelet, preheat the oven to 300°F/150 °C. Prepare the greens as above and transfer to a buttered 8-inch/20-cm baking dish. Beat the eggs, milk, flour, cheese, and pepper in a large bowl and pour over the greens. Bake for 15 minutes, unmold onto a plate, cut into wedges, and serve.",
        "Although usually served plain, you can drape a paper-thin slice of prosciutto di San Daniele over the frittata before serving.",
        "Wine: Many wines seem to go well with this preparation, including Collio Bianco, Tocai, Sauvignon Blanc, dry Verduzzo, and dry Prosecco"
    ],
    "ingredients": [
        "2 tablespoons/30 g unsalted butter, or more if needed",
        "2 tablespoons/30 g minced chives or onions",
        "1 1/2 cups/400 g fresh herbs and greens, all carefully cleaned and dried, then torn into small pieces",
        "12 large eggs",
        "6 tablespoons/100 ml whole or low-fat milk",
        "1 tablespoon/15 g unbleached all-purpose flour",
        "2 tablespoons/30 grams grated aged or semi-aged Montasio cheese",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Herb",
        "Breakfast",
        "Brunch",
        "Bake",
        "Vegetarian",
        "Summer"
    ],
    "title": "Fresh Herb Frittata",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-herb-frittata-105264"
}
