{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a fluted tube pan.",
        "Mix 3 cups all-purpose flour, white sugar, baking soda, cinnamon, allspice, salt, cloves, and nutmeg together in a bowl.",
        "Beat eggs in a separate large bowl; add vegetable oil, buttermilk, and 1 tablespoon vanilla. Beat until smooth. Pour egg mixture into flour mixture; stir together with a large spoon. Fold apples and pecans into batter. Pour batter into the prepared pan.",
        "Bake in the preheated oven until a knife inserted in the center of the cake comes out clean, 60 to 75 minutes. Cool cake in pan.",
        "Cook and stir margarine and brown sugar together in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Add 2 tablespoons flour; stir constantly until combined. Stir in milk and 1 tablespoon vanilla. Cook and stir until thickened, 5 minutes.",
        "Invert cake onto a plastic cake carrier or container; poke holes over entire cake using a knife. Pour hot icing over entire cake. Pour any remaining icing into the center of the cake. The icing will absorb into the cake overnight."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "2 1/2 cups white sugar",
        "1 teaspoon baking soda",
        "1 tablespoon ground cinnamon",
        "1 teaspoon ground allspice",
        "1 teaspoon salt",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground nutmeg",
        "3 eggs",
        "1 cup vegetable oil",
        "1 cup buttermilk",
        "1 tablespoon pure vanilla extract",
        "4 cups sliced apples",
        "1 1/2 cups chopped pecans",
        "1/2 cup margarine",
        "1 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 tablespoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Apple Cake by MeMom",
    "url": "http://allrecipes.com/recipe/229732/fresh-apple-cake-by-memom/"
}
