{
    "directions": [
        "Combine 1/2 cup plus 1 Tbsp. all-purpose flour and 1/4 cup semolina flour in a large bowl. Add oil and 1/4 cup warm water and mix with a fork until a stiff dough forms. Turn out onto a lightly floured surface and knead until smooth and elastic, 8–10 minutes. Wrap tightly in plastic; let sit at room temperature 1 hour.",
        "Cut dough in half. Working with a piece at a time and keeping remaining dough wrapped in plastic, roll dough into a 9x3/4\" log. Cut on a diagonal into 1/2\" pieces; dust with all-purpose flour.",
        "Working with 1 piece of dough at a time, roll out between your palms to make about 3\" strands that taper at the ends. Dust pasta with semolina flour and place on a parchment-lined baking sheet. Cover with a kitchen towel until ready to use.",
        "Heat oil in large skillet over medium-high. Add sausage and cook, breaking into small pieces with a wooden spoon, until browned, about 5 minutes. Add garlic and cook, stirring, until softened, about 1 minute. Add clams and wine; cover. Cook, shaking skillet occasionally, until clams open, about 5 minutes; discard any that do not open.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, about 3 minutes. Drain, reserving 1 cup pasta cooking liquid.",
        "Add butter, parsley, pasta, and 1/2 cup pasta cooking liquid to clams. Cook, tossing and adding more cooking liquid as needed, until sauce coats pasta, about 3 minutes. Taste and season with salt."
    ],
    "ingredients": [
        "1/2 cup plus 1 tablespoon all-purpose flour, plus more",
        "1/4 cup semolina flour, plus more",
        "1/4 teaspoon olive oil",
        "2 tablespoons olive oil",
        "4 ounces hot Italian sausage, casing removed",
        "2 cloves garlic, thinly sliced",
        "1 pound Manila or littleneck clams, scrubbed",
        "1/4 cup dry white wine",
        "Kosher salt",
        "1 tablespoon unsalted butter",
        "1 tablespoon finely chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Pasta",
        "Clam",
        "Seafood",
        "Shellfish",
        "Sausage",
        "Semolina",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fresh Pasta With Clams And Hot Italian Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-pasta-with-clams-and-hot-italian-sausage"
}
