{
    "directions": [
        "For the pasta: In a food processor, pulse together the cake flour, all-purpose flour, egg yolks, olive oil, and salt. With the food processor running, gradually add the water in a steady stream until the mixture forms a ball, adding extra water, 1 tablespoon at a time, if needed. Place the dough on a floured work surface and knead for 2 minutes until smooth. Cut the dough in half and shape into discs. Wrap in plastic wrap and refrigerate for 30 minutes.",
        "For the filling: Place the drained spinach in the middle of a clean kitchen towel. Fold the towel in half and squeeze out any excess moisture. Place the spinach in a medium bowl. Add the prosciutto, ricotta cheese, Parmesan, egg yolk, olive oil, butter, salt, and pepper. Using a fork, mix until combined.",
        "On a floured work surface, roll out the chilled dough into 2 (8-inch diameter) circles. Place the filling in the center of each circle and, using a spatula, spread evenly over the dough leaving a 1/2 to 3/4-inch border of uncovered dough. In a small bowl, beat the egg and water together until smooth. Using a pastry brush, lightly brush the edges of the dough with the egg mixture. Roll the dough into logs, jellyroll style, and pinch the edges together to seal. Roll each log in the prepared cheesecloth and secure the ends with kitchen twine.",
        "Oil a baking sheet. Bring a large pot of salted water to a boil over high heat. Reduce the heat to a simmer. Lower the logs into the water and cook for 15 minutes. Using 2 pairs of tongs to hold the twine, remove the logs, one at a time, and place on the prepared baking sheet until cool enough to handle, about 10 minutes.",
        "Preheat the broiler. Butter an 8 by 8-inch glass baking dish.",
        "Remove the kitchen twine and cheesecloth. Using a sharp knife, cut each log into 12 (1/2-inch thick) slices. Fan the slices in 3 overlapping rows in the prepared baking dish. Using a pastry brush, brush the top of the slices with the melted butter and sprinkle with Parmesan. Broil until golden, 3 to 4 minutes. Serve with warm marinara sauce."
    ],
    "ingredients": [
        "1 cup cake flour",
        "1/2 cup all-purpose flour, plus extra for dusting",
        "2 egg yolks",
        "2 tablespoons extra-virgin olive oil",
        "1/2 teaspoon kosher salt",
        "1/4 to 1/2 cup water, plus extra, as needed",
        "12 ounces frozen spinach, thawed and drained",
        "3 ounces thinly sliced prosciutto, finely chopped",
        "1/2 cup whole milk ricotta cheese",
        "1/3 cup grated Parmesan",
        "1 egg yolk",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon unsalted butter, chopped, room temperature",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 egg",
        "1 tablespoon water",
        "Butter, for greasing the baking dish",
        "3 tablespoons unsalted butter, melted",
        "3 tablespoons grated Parmesan",
        "2 cups warm tomato-basil marinara sauce",
        "Special equipment: 2 double layer-thick pieces of cheesecloth, each piece 8 by 16 inches in size, 4 (6-inch) pieces kitchen twine"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Spinach",
        "Vegetable",
        "Cheese",
        "Ricotta"
    ],
    "title": "Fresh Pasta Rollatini with Spinach and Ricotta",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/fresh-pasta-rollatini-with-spinach-and-ricotta-recipe"
}
