{
    "directions": [
        "Combine 1 1/4 cups all purpose flour, 2 tablespoons sugar, 1/2 teaspoon grated lime peel and 1/4 teaspoon salt in large bowl. Add 1/2 cup chilled unsalted butter and cut in, using fingers or pastry cutter, until mixture resembles coarse meal. Beat 1 large egg yolk with 1 tablespoon water in small bowl until blended. Pour over flour mixture. Stir with fork until mixture forms moist clumps. Gather dough into ball; flatten into disk. Wrap dough in plastic and refrigerate until firm, about 30 minutes.",
        "Roll dough out on lightly floured surface to 13-inch round. Roll up dough on rolling pin and transfer to 11-inch-diameter tart pan with removable bottom. Press dough into pan; trim edges. Freeze until very firm, about 1 hour. (Can be prepared 3 days ahead. Cover with plastic wrap and keep frozen.)",
        "Preheat oven to 400°F. Line frozen crust with aluminum foil. Fill crust with dried beans or pie weights. Bake until crust is set on edges, about 12 minutes. Remove beans and foil from crust. Continue baking until crust is golden in center, about 14 minutes. Transfer crust to rack and cool completely. (Can be prepared 1 day ahead. Cover with plastic wrap and let stand at room temperature.)",
        "Combine 1 1/4 cups plus 2 tablespoons sugar, 1 cup whipping cream and 1/2 cup dry white wine in heavy medium saucepan. Whisk in 3 eggs, 2 large egg yolks and 1 tablespoon grated lime peel. Place 1 tablespoon cornstarch in small bowl. Gradually whisk in 3/4 cup fresh lime juice. Add to mixture in saucepan. Stir over medium-high until mixture comes to boil. Continue to boil 1 minute, stirring constantly. Transfer mixture to medium bowl. Cool mixture completely. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Beat remaining egg into filling. Pour filling into crust. Bake until filling is set and begins to bubble around edge, about 40 minutes. Cool completely. Refrigerate until well chilled, about 6 hours. (Can be prepared 1 day ahead. Cover with plastic wrap and keep refrigerated.)",
        "Preheat oven to 400°F. Combine 1/4 cup water and vanilla bean in heavy small saucepan. Gently simmer until vanilla bean is tender, about 1 minute. Remove vanilla bean from water and split lengthwise. Scrape seeds from bean into water; return bean to water. Add 1/4 cup sugar to water and stir over medium heat until sugar dissolves. Increase heat and boil until mixture is thick and syrupy, about 3 minutes. Remove vanilla bean from saucepan.",
        "Meanwhile, using electric mixer, beat 3 large egg whites, in large bowl until soft peaks form. Gradually add remaining 1/4 cup sugar and beat mixture until medium peaks form.",
        "Gradually beat boiling syrup into egg whites. Continue beating until stiff peaks form. Using rubber spatula, transfer meringue to pastry bag fitted with large plain or star tip. Pipe meringue atop tart in diagonal lattice design, spacing lines of meringue about 2 inches apart. Bake until meringue is golden brown, about 7 minutes. Cool completely. (Can be prepared up to 4 hours ahead; refrigerate uncovered.)",
        "Combine 2 tablespoons crème de cassis, 2 tablespoons sugar and 1/2 teaspoon grated lime peel in small saucepan. Boil mixture until sugar dissolves and mixture is syrupy, stirring constantly, about 1 minute. Cool slightly. Place berries in bowl. Pour crème de cassis mixture over. Toss to coat berries. Spoon coated berries decoratively among lattice openings. Garnish tart with mint leaves if desired."
    ],
    "ingredients": [
        "1 1/4 cups unbleached all purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon grated lime peel",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1 large egg yolk",
        "1 tablespoon cold water",
        "1 1/4 cups plus 2 tablespoons sugar",
        "1 cup whipping cream",
        "1/2 cup dry white wine",
        "4 large eggs",
        "2 large egg yolks",
        "1 tablespoon grated lime peel",
        "1 tablespoon cornstarch",
        "3/4 cup fresh lime juice",
        "1/4 cup water",
        "1 3-inch piece vanilla bean",
        "1/2 cup sugar",
        "3 large egg whites",
        "2 tablespoons fruit-flavored liqueur, such as crème de cassis, raspberry liqueur (framboise) or Grand Marnier",
        "2 tablespoons sugar",
        "1/2 teaspoon grated lime peel",
        "2 cups assorted fresh berries, such as blackberries, blueberries, raspberries, boysenberries and sliced, hulled strawberries",
        "Mint leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Lime",
        "Summer"
    ],
    "title": "Fresh Lime Tart with Meringue Lattice and Glazed Berries",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-lime-tart-with-meringue-lattice-and-glazed-berries-2378"
}
