{
    "directions": [
        "In a pot, bring the rice and water to a boil. Cover, reduce heat to low, and simmer 20 minutes.",
        "Heat the sesame oil in a skillet over medium heat, and cook 2 cloves garlic for 2 minutes, until tender. Melt the butter in the skillet. Season the beef with salt and 2 teaspoons red pepper flakes. Cook and stir the beef in the skillet 10 minutes, until evenly brown. Reserving pan drippings, transfer the cooked beef to a bowl, and coat with 3 tablespoons teriyaki sauce.",
        "Melt the remaining butter in a separate skillet over medium heat, and cook the remaining garlic 2 minutes, until tender. Remove garlic, and set aside. Stir the mushrooms and onions into the skillet, and cook until onions are tender. Mix in the cabbage, green bell pepper, red bell pepper, and yellow bell pepper. Cook 3 minutes, until tender but still crisp. Remove skillet from heat, and mix in remaining 1/2 tablespoon teriyaki sauce and 1/2 the reserved pan drippings.",
        "Heat the remaining pan drippings in the skillet over medium heat.  Mix in the remaining red pepper flakes, teriyaki sauce from the beef bowl, the reserved garlic, cornstarch, brown sugar, beef broth, and orange jam. Cook 5 minutes, until thickened. Remove garlic, and stir in the beef to coat.",
        "Serve the beef and vegetables, along with some of the skillet juices, over the cooked rice. Top with chow mein noodles, and sprinkle with mustard powder."
    ],
    "ingredients": [
        "2 cups uncooked long grain white rice",
        "1 quart water",
        "1 tablespoon light sesame oil",
        "4 cloves garlic, crushed",
        "5 tablespoons butter",
        "2 pounds flank steak, cut into thin strips",
        "salt to taste",
        "4 teaspoons red pepper flakes",
        "3 1/2 tablespoons teriyaki sauce",
        "12 ounces fresh mushrooms, sliced",
        "1 large sweet onion, sliced",
        "1/2 head cabbage, sliced into strips",
        "1 green bell pepper, cut into strips",
        "1 red bell pepper, cut into strips",
        "1 yellow bell pepper, cut into strips",
        "1 teaspoon cornstarch",
        "1 tablespoon brown sugar",
        "1/2 cup beef broth",
        "2 tablespoons orange jam",
        "1 (5 ounce) can chow mein noodles",
        "mustard powder to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Vegetable Stir-Fry with Peppery Orange Beef",
    "url": "http://allrecipes.com/recipe/61327/fresh-vegetable-stir-fry-with-peppery/"
}
