{
    "directions": [
        "Wash and hull strawberries; slice into quarters. Place half the strawberries in a saucepan. Whisk together 1/2 cup sugar, cornstarch, and a pinch of salt. Toss strawberries with sugar mixture and add 1/2 cup water. Bring mixture to a boil over medium heat, stirring frequently. Cook, stirring constantly, for 1 minute. Remove from heat and set aside.",
        "Combine 1/4 cup water and 3/4 cup sugar in a saucepan. Heat over medium-high heat until sugar dissolves; you may stir until the mixture starts to boil, but don't stir once it's boiling (see Editor's Note). Boil, uncovered, until the mixture reaches the soft ball stage: 240 degrees F (115 degrees C), or until a small amount of mixture forms a soft ball when placed in cold water.",
        "Meanwhile, combine egg whites, cream of tartar, and 1/8 teaspoon salt in the bowl of a stand mixer. Mix on medium speed until medium-stiff peaks form.",
        "When the sugar syrup reaches 240 degrees, remove it from the heat. With the mixer running on high speed, carefully pour the hot syrup in a steady stream between the beater and the side of the mixing bowl. Beat meringue mixture until cool. Stir in almond extract.",
        "Mix the cooled cooked strawberries with the remaining fresh strawberries; pour into pie shell. Spoon meringue over strawberries. Chill at least 1 hour before serving."
    ],
    "ingredients": [
        "4 cups fresh strawberries, divided",
        "1/2 cup white sugar",
        "2 tablespoons cornstarch",
        "1 pinch salt",
        "1/2 cup water",
        "1/4 cup water",
        "3/4 cup white sugar",
        "3 egg whites",
        "1/2 teaspoon cream of tartar",
        "1/8 teaspoon salt",
        "1 teaspoon almond extract",
        "1 (9 inch) prepared graham cracker crust"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Strawberry Pie II",
    "url": "http://allrecipes.com/recipe/12309/fresh-strawberry-pie-ii/"
}
