{
    "directions": [
        "Stir together turmeric, 1 1/2 cups water, and paneer and let stand 20 minutes. Drain cheese in a sieve and gently pat dry.",
        "Cook spinach in remaining 1/2 cup water in a large saucepan, covered, over moderately high heat until wilted and tender, about 2 minutes. Coarsely purée spinach, without draining, in a food processor. Mash garlic with ginger to a paste.",
        "Heat 6 tablespoons ghee in a large nonstick skillet over moderately high heat until hot but not smoking, then brown paneer in 2 batches, gently turning to avoid breaking up and transferring to a bowl as browned. Add onions and sauté, stirring, 5 minutes. Reduce heat to moderate. Add garlic paste and cook, stirring, until fragrant, about 1 minute. Add coriander, chile powder, asafetida, and cinnamon stick and cook, stirring occasionally, until onions are tender, 4 to 6 minutes. Add tomatoes and spinach purée and simmer sauce, stirring occasionally, until thickened and almost all of liquid is evaporated, 2 to 4 minutes. Gently stir in paneer and salt to taste."
    ],
    "ingredients": [
        "1/2 teaspoon turmeric",
        "2 cups water",
        "3/4 pound paneer (Indian fresh cheese), cut into 1/2-inch cubes",
        "2 bunches spinach (about 1 pound), coarse stems discarded",
        "2 garlic cloves, finely chopped",
        "2 teaspoons finely chopped peeled fresh ginger",
        "6 tablespoons ghee (this page) or vegetable oil",
        "1 1/2 cups pearl onions, blanched and peeled",
        "2 tablespoons coriander seeds, toasted, cooled, and finely ground",
        "1 teaspoon Indian red chile powder",
        "1 teaspoon asafetida powder",
        "3-inch cinnamon stick",
        "4 plum tomatoes, peeled and chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Spinach",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fresh Cheese with Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-cheese-with-spinach-102947"
}
