{
    "directions": [
        "Combine flour and semolina, then mound on a work surface (preferably wooden). Make a well in center and add eggs and 1/2 teaspoon salt to well. (Alternatively, put ingredients in a food processor.)",
        "Gradually stir enough flour into eggs (using a fork) to form a paste, pulling in flour closest to egg mixture and being careful not to make an opening in wall of well. Knead remaining flour into mixture with your hands to form a dough (it should be firm and not sticky). Knead dough until smooth and elastic, 8 to 10 minutes. (If using a processor, blend about 30 seconds total.)",
        "Cover dough with an inverted bowl and let dough rest 1 hour to make rolling easier.",
        "Divide dough into 8 pieces, then flatten each piece into a rough rectangle and cover rectangles with an inverted large bowl. Set rollers of pasta machine on widest setting.",
        "Lightly dust 1 rectangle with flour and feed through rollers. (Keep remaining dough under bowl.) Fold rectangle in half and feed it, folded end first, through rollers 7 or 8 more times, folding it in half each time and feeding folded end through. Dust with flour if necessary to prevent sticking.",
        "Turn dial to next (narrower) setting and feed dough through rollers without folding. Continue to feed dough through rollers once at each setting, without folding, until you reach the second to narrowest setting. Dough will be a smooth sheet (about 36 inches long and 4 inches wide). Cut sheet in half crosswise.",
        "Lay sheets of dough on lightly floured baking sheets to dry until leathery but still pliable, about 15 minutes. (Alternatively, lightly dust pasta sheets with flour and hang over the backs of chairs to dry.) Roll out remaining pieces of dough in same manner.",
        "Attach fettuccine blades (to cut 1/4-inch-wide strips) to pasta machine. Feed one end of driest pasta sheet (the first one you rolled out) into cutters, holding other end straight up, then catch strips from underneath machine before sheet goes completely through rollers and gently lay across floured baking sheets. (Alternatively, lightly flour strips and hang over backs of chairs.) Repeat with remaining sheets of pasta. Let pasta dry at least 5 minutes before cooking.",
        "Cook fettuccine in a pasta pot of boiling salted water (3 tablespoons salt for 6 quarts water) until tender, about 2 minutes (do not overcook). Drain."
    ],
    "ingredients": [
        "2 cups unbleached all-purpose flour",
        "2 cups semolina (sometimes called semolina flour)",
        "5 large eggs, lightly beaten",
        "Equipment: a pasta machine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Pasta Maker",
        "Egg",
        "Dinner",
        "Semolina",
        "Potluck",
        "Boil",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fresh Egg Fettucine",
    "url": "http://www.epicurious.com/recipes/food/views/fresh-egg-fettucine-351155"
}
