{
    "directions": [
        "Combine 6 cups cherries, 6 tablespoons sugar, and lemon zest in a bowl. Allow cherries to rest for 2 to 3 hours.",
        "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.",
        "Mix flour, 1/4 cup sugar, cream of tartar, baking soda, cinnamon, cardamom, and salt in a large bowl. Cut in butter with a knife or pastry blender until the mixture resembles coarse crumbs. Whisk egg and half-and-half in a small bowl; stir into the flour mixture with a fork until dough is moistened with large clumps. Add a teaspoon more half-and-half to the bowl if dough won't come together.",
        "Roll tennis ball size scoops of dough and place on prepared baking sheet. Press each ball down lightly to form 1/2-inch discs. Brush dough with egg white and sprinkle with 1 teaspoon sugar.",
        "Bake in preheated oven until golden brown, 12 to 14 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.",
        "Slice each cake in half horizontally. Layer a generous portion of halved cherries, almonds, and whipped cream between cake halves. Top with another dollop of whipped cream, almonds, and a whole cherry."
    ],
    "ingredients": [
        "6 cups Bing cherries, pitted and halved",
        "6 tablespoons white sugar",
        "2 lemons, zested",
        "2 cups all-purpose flour",
        "1/4 cup white sugar",
        "2 teaspoons cream of tartar",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cardamom",
        "1/2 teaspoon salt",
        "1/2 cup frozen butter",
        "1 egg, beaten",
        "1/2 cup cold half-and-half, or more as needed",
        "1 egg white (optional)",
        "1 teaspoon white sugar, or to taste",
        "1 cup whipped cream",
        "1 cup chopped almonds",
        "6 cherries with stems"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fresh Cherry Shortcake",
    "url": "http://allrecipes.com/recipe/222846/fresh-cherry-shortcake/"
}
