{
    "directions": [
        "Cook fresh fava beans in large pot of boiling salted water 2 minutes. Drain favas. Place in large bowl of ice water. Drain. Slip outer skin off each bean and discard skin; place beans in large bowl. (If using frozen beans, do not blanch.)",
        "Melt 1 tablespoon butter with 1 tablespoon oil in large nonstick skillet over high heat. Working in batches, add beef and sauté just until browned on both sides, about 2 minutes. Transfer beef to medium bowl.",
        "Melt remaining 1 tablespoon butter with 1 tablespoon oil in same skillet over medium heat. Add onions; sauté until tender and golden, about 15 minutes. Add fava beans; sauté 5 minutes. Remove from heat; cool 15 minutes.",
        "Meanwhile, whisk whipping cream, lemon juice, egg yolks, salt, and pepper in small bowl to blend. Stir cream mixture into fava bean mixture. Cook over medium-low heat just until sauce thickens slightly and mixture is heated through, about 6 minutes (do not boil). Add beef and stir until heated through, about 3 minutes. Transfer fricassee to rimmed platter. Sprinkle with mint."
    ],
    "ingredients": [
        "5 pounds fresh fava beans, shelled, or 5 cups frozen double-peeled fava beans (from two 16-ounce packages), thawed",
        "2 tablespoons butter, divided",
        "2 tablespoons olive oil, divided",
        "1 1 1/2-pound piece beef tenderloin, cut in half lengthwise, then crosswise into 1/2-inch-thick slices",
        "2 large onions, finely chopped",
        "1/2 cup whipping cream",
        "1/4 cup fresh lemon juice",
        "2 large egg yolks",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "2 tablespoons chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bean",
        "Beef",
        "Egg",
        "Onion",
        "Sauté",
        "Lemon",
        "Mint",
        "Winter"
    ],
    "title": "Fricassée of Beef and Fava Beans",
    "url": "http://www.epicurious.com/recipes/food/views/fricassee-of-beef-and-fava-beans-109386"
}
