{
    "directions": [
        "Cook onion and mixed greens and herbs in a large pot of boiling salted water until tender, about 2 minutes. Using a spider or tongs, transfer to a bowl of ice water and swish around in the water to cool down as quickly as possible (this helps retain the bright color). Drain and gently squeeze to remove excess liquid, then press between a double layer of paper towels to remove as much remaining liquid as possible. Reserve pot with greens cooking liquid.",
        "Process 1/4 cup sesame seeds in a food processor until finely ground. Add onion and greens mixture and 1/4 cup ricotta salata and process until a coarse paste forms. With motor running, stream in 3 Tbsp. oil and process, adding water by the tablespoonful if needed to thin, until pesto is very smooth.",
        "Heat 1/4 cup oil in a large Dutch oven or other heavy pot over medium. Add garlic and cook, stirring often, until golden brown, about 5 minutes. Add pesto and cook, stirring, until sauce looks like most of the moisture has been cooked out, about 1 minute.",
        "Meanwhile, bring reserved pot of greens cooking liquid to a boil and cook pasta, stirring occasionally, until very al dente, about 3 minutes less than package directions.",
        "Using tongs, transfer pasta to pot with pesto and add 1/2 cup pasta cooking liquid. Cook, tossing, until each strand of pasta is coated. Remove from heat, add butter, and toss to combine.",
        "Divide pasta among bowls. Top with more sesame seeds and remaining 1/4 cup ricotta salata and drizzle with oil."
    ],
    "ingredients": [
        "1/2 red onion, quartered through root end",
        "8 cups (lightly packed) torn mixed greens and tender herbs",
        "Kosher salt",
        "1/4 cup toasted sesame seeds, plus more for serving",
        "1/2 cup grated ricotta salata (salted dry ricotta), divided",
        "3 tablespoons plus 1/4 cup olive oil; plus more for drizzling",
        "8 garlic cloves, smashed",
        "12 ounces tripoline or mafaldine (wavy-edged ribbon pasta) or fusilli (spiral-shaped pasta)",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Quick & Easy",
        "Leafy Green",
        "Herb",
        "Sesame",
        "Garlic"
    ],
    "title": "Fridge-Dive Pesto Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/fridge-dive-pesto-pasta"
}
