{
    "directions": [
        "Bring potatoes, 1/4 cup kosher salt, and 8 cups water to a boil in a large saucepan and cook until potatoes are tender, about 12 minutes. Drain; let cool completely. Halve potatoes lengthwise. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Whisk egg yolk, lemon juice, and a pinch of sea salt in a small bowl. Gradually whisk in 1/2 cup olive oil until mayonnaise forms. Stir in shallot and tarragon. Season to taste with pepper. DO AHEAD: Can be made 4 hours ahead. Cover and chill.",
        "Heat remaining 1 1/2 teaspoons olive oil in a small skillet over medium-high heat. Add capers and fry, stirring often, until crisp and golden, 2-3 minutes. Using a slotted spoon, transfer capers to paper towels to drain. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature.",
        "Pour vegetable oil into a large pot to a depth of 2\". Attach a deep-fry thermometer to side of pot. Heat oil over medium heat until thermometer registers 375°F. Working in batches, fry potatoes until crisp and dark golden brown, 3-4 minutes. Drain on paper towels. Season lightly with sea salt.",
        "Arrange warm potatoes on a platter, cut side up. Spoon some mayonnaise over each; sprinkle with capers."
    ],
    "ingredients": [
        "1 pound small fingerling potatoes",
        "1/4 cup kosher salt",
        "1 large egg yolk, room temperature",
        "1 teaspoon fresh lemon juice",
        "Coarse sea salt",
        "1/2 cup plus 1 1/2 teaspoons extra-virgin olive oil",
        "1 tablespoon finely chopped shallot",
        "1/2 teaspoon finely chopped fresh tarragon",
        "Freshly ground black pepper",
        "1 1/2 tablespoons drained capers, patted dry",
        "Vegetable oil or grapeseed oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Side",
        "Fry",
        "Quick & Easy",
        "Tarragon",
        "Party",
        "Capers",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Fingerling Potatoes with Tarragon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fried-fingerling-potatoes-with-tarragon-sauce-367735"
}
