{
    "directions": [
        "Start by heating canola oil in pot over moderate heat until a deep-fat thermometer registers 380°F.",
        "While oil is heating, rinse and drain clam strips in a colander and stir together with buttermilk in a large bowl. Drain clams well in a colander set over a bowl, at least 5 minutes (reserve drained buttermilk).",
        "Stir together cornstarch, cornmeal, flour, curry powder, celery salt, cayenne, and kosher salt in a large bowl.",
        "Dredge 1 handful of drained clams in flour mixture, then shake in a large sieve over flour bowl to remove excess flour. Transfer clams, one by one, shaking them again to remove any excess flour mixture, to a baking sheet. Wash and dry lemons and cut crosswise into 1/16-inch slices. Dip 3 or 4 slices in reserved buttermilk, let excess drip off, then dredge in flour mixture, shaking off excess (don't use the sieve).",
        "Fry coated clams with coated lemon slices and 1/4 cup parsley sprigs per batch until clams are crisp and golden, about 1 1/2 minutes, then transfer with a slotted spoon to paper towels to drain. Sprinkle with kosher salt to taste. Return oil to 380°F between batches, removing any bits of fried batter with a fine sieve and coating next batch of clams and lemon slices. The batches will get progressively darker, but that won't affect the flavor.",
        "Available at Wild Edibles (212-687-4255) and many fish stores with advance notice."
    ],
    "ingredients": [
        "10 cups canola oil",
        "2 pounds clam strips (about 4 cups)",
        "1 cup buttermilk, well-shaken",
        "1 cup cornstarch",
        "1/2 cup cornmeal (preferably yellow, for color)",
        "1/3 cup unbleached all-purpose flour",
        "1 teaspoon curry powder",
        "1/2 teaspoon celery salt",
        "1/2 teaspoon cayenne",
        "1/2 teaspoon kosher salt",
        "2 lemons",
        "1 1/2 cups fresh flat-leaf parsley sprigs, well-dried and loosely packed",
        "Kosher salt, to taste",
        "Accompaniment: Lemon Coriander Aïoli"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fry",
        "Lemon",
        "Cornmeal",
        "Clam",
        "Summer",
        "Parsley",
        "Gourmet"
    ],
    "title": "Fried Clams",
    "url": "http://www.epicurious.com/recipes/food/views/fried-clams-106991"
}
