{
    "directions": [
        "Melt the butter in a small saucepan over medium heat. Add the uncooked rice, and cook until toasted, stirring occasionally. Pour in the water and bring to a boil. Reduce heat to low, cover, and cook for about 15 minutes, or until tender.",
        "While the rice is cooking, mix together the hoisin sauce, barbeque sauce, peanut butter, soy sauce, garlic, and ginger. Set aside.",
        "When the rice is done cooking, heat the sesame oil in a wok or large skillet over medium-high heat. When it begins to smoke, add the onion and fry until clear. Add the carrot, and cook for about 1 minute, then add the rice, and stir fry for about 2 minutes. Add the broccoli and peas; cook and stir for about 1 minute. Push everything to the sides of the wok, and crack the eggs into the center. Scramble until cooked through, trying to keep the raw egg from mixing with everything else. When the eggs are cooked, stir them in with the rice.",
        "Turn off the heat, and stir in about half of the sauce, tasting and adding more as desired. You may not need all of the sauce, but if you serve this with a meat it makes a good sauce for that too. Sprinkle with sesame seeds before serving."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1/2 cup uncooked white rice",
        "1 cup water",
        "1/2 cup hoisin sauce",
        "1/2 cup barbeque sauce",
        "1 tablespoon peanut butter",
        "1 1/2 teaspoons soy sauce",
        "1 clove garlic, minced",
        "1 teaspoon grated fresh ginger root",
        "2 teaspoons sesame oil",
        "1 cup chopped onion",
        "1 cup grated carrot",
        "2 cups frozen pea pods",
        "2 cups frozen chopped broccoli, thawed",
        "2 eggs",
        "1/4 cup sesame seeds, lightly toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Rice with Ginger, Hoisin, and Sesame",
    "url": "http://allrecipes.com/recipe/87955/fried-rice-with-ginger-hoisin-and-s/"
}
