{
    "directions": [
        "Cook broccoli in large saucepan of boiling salted water until crisp-tender, about 4 minutes. Using slotted spoon, transfer broccoli to bowl of ice water and cool. Drain well. Return water in saucepan to boil. Add potato; cook until tender, about 15 minutes. Drain. Transfer broccoli to food processor and blend well. Add potato and process to puree. Add 1/2 cup broth and blend well. With machine running, gradually blend in extra-virgin olive oil. Season to taste with salt and pepper. DO AHAED: Broccoli sauce can be made 1 day ahead. Cover and refrigerate.",
        "Using electric mixer, beat ricotta in large bowl until smooth. Beat in mozzarella. Form mixture into 6 rectangular dumplings, each about 3 1/2 x 2 x 3/4 inches. Place on baking sheet; cover and refrigerate 4 hours.",
        "Pour enough olive oil into very large skillet to reach depth of 3/4 inch. Heat oil to 350°F. Whisk 1 1/2 cups water, yolk, and pinch of salt in large bowl; whisk in 3/4 cup flour. Set batter aside. Place remaining 1 cup flour in medium bowl. Coat each dumpling in flour, turning to coat. Dip into batter, then fry until very pale golden, about 3 minutes per side. Using slotted spoon, transfer to paper towels to drain.",
        "Bring broccoli sauce to simmer in medium saucepan, thinning with more vegetable broth if necessary.",
        "Spoon 1/3 cup sauce into center of each of 6 plates; spread with back of spoon into round. Top each with 1 dumpling."
    ],
    "ingredients": [
        "4 cups broccoli florets",
        "1 medium russet potato, peeled, cut into 1-inch pieces",
        "1/2 cup (or more) vegetable broth",
        "1/2 cup extra-virgin olive oil",
        "1 pound fresh ricotta cheese*",
        "1 8-ounce ball whole-milk mozzarella cheese, coarsely grated",
        "Olive oil (for frying)",
        "1 1/2 cups cold water",
        "1 large egg yolk",
        "Pinch of salt",
        "1 3/4 cups all purpose flour, divided",
        "*Available at Italian markets and some cheese shops."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Cheese",
        "Dairy",
        "Potato",
        "Vegetable",
        "Fry",
        "Ricotta",
        "Broccoli"
    ],
    "title": "Fried Ricotta and Mozzarella Dumplings with Broccoli Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fried-ricotta-and-mozzarella-dumplings-with-broccoli-sauce-235851"
}
