{
    "directions": [
        "Drain preserves in a coarse sieve set over a bowl, pressing lightly on solids, and reserve syrup. Transfer drained preserves to a bowl and stir in chopped plums.",
        "Put 1 wonton wrapper on a lightly floured surface, keeping remaining wrappers covered with plastic wrap, and put a rounded teaspoon of plum mixture in center. Lightly dampen edges of wrapper with a fingertip dipped in water and fold wrapper in half to form a triangle, pressing down around filling to force out air and pressing edges together firmly to seal. Transfer to a dry kitchen towel and make 11 more ravioli in same manner.",
        "Heat 2 inches oil in a 4-quart heavy pot until it registers 375°F on deep-fat thermometer. Fry ravioli in 4 batches, turning them, until golden, about 1 1/2 minutes. Transfer as fried with a slotted spoon to paper towels to drain.",
        "Crush mint leaves in lemon juice using mortar and pestle, then transfer to a bowl. Whisk in cream and confectioners sugar and whisk until soft peaks form.",
        "Dust ravioli with confectioners sugar, drizzle plum syrup around them, and dollop mint cream on the side."
    ],
    "ingredients": [
        "2/3 cup quick plum preserves at room temperature",
        "1/3 cup finely chopped firm-ripe red or black plums",
        "12 wonton wrappers, thawed if frozen",
        "All-purpose flour for dusting",
        "About 6 cups vegetable oil",
        "10 fresh mint leaves (preferably spearmint)",
        "2 teaspoons fresh lemon juice",
        "1/2 cup chilled heavy cream",
        "1 1/2 tablespoons confectioners sugar plus additional for dusting",
        "Special equipment: a deep-fat thermometer; a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Fry",
        "Plum",
        "Mint",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fried Plum Ravioli with Mint Cream",
    "url": "http://www.epicurious.com/recipes/food/views/fried-plum-ravioli-with-mint-cream-106765"
}
