{
    "directions": [
        "Stir all ingredients in small bowl to blend. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Heat olive oil in heavy large skillet over medium-high heat. Add crushed red pepper; stir 30 seconds. Add cherry peppers (mixture may splatter); stir 30 seconds. Remove from heat. Stir in 1 teaspoon lemon juice. Season with salt and pepper.",
        "Add enough vegetable oil to another large skillet to come 1 inch up sides of pan. Heat oil to 375°F.",
        "Whisk cornmeal, flour, salt, and pepper in medium bowl to blend. Toss calamari rings and tentacles in flour mixture, shaking off excess. Working in batches, fry calamari in oil until brown and crisp, about 3 minutes. Using slotted spoon, transfer calamari to paper towels to drain. Sprinkle with salt. Transfer to large bowl.",
        "Rewarm cherry pepper mixture. Drizzle over calamari; toss to coat. Serve with rouille and lemon wedges."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons Hungarian sweet paprika",
        "1 teaspoon cayenne pepper",
        "1 large garlic clove, minced",
        "1/4 cup olive oil",
        "1 tablespoon dried crushed red pepper",
        "1/2 cup chopped seeded pickled cherry peppers",
        "1 teaspoon fresh lemon juice",
        "Vegetable oil (for frying)",
        "1 cup yellow cornmeal",
        "1 cup all purpose flour",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "2 pounds fresh or thawed frozen small calamari, bodies cleaned and cut into 1/2-inch-wide rings, tentacles reserved",
        "2 lemons, each cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Appetizer",
        "Fry",
        "Lemon",
        "Squid",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fried Calamari with Rouille, Cherry Peppers, and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/fried-calamari-with-rouille-cherry-peppers-and-lemon-230602"
}
