{
    "directions": [
        "Halve peperoncini and discard stems and seeds. Rinse and pat dry, then mince enough to measure 1/4 cup. Stir into mayonnaise in a small bowl.",
        "Rinse squid under cold running water and lightly pat dry between paper towels, leaving some moisture so rice flour will stick. Leave tentacles whole and cut bodies (including flaps, if attached) crosswise into 1/3-inch-wide rings, then reserve separately on paper towels.",
        "Heat 2 inches oil in a 4- to 5-quart heavy pot (4 inches deep; preferably cast-iron) over high heat until it registers 390°F on thermometer.",
        "Preheat oven to 200°F.",
        "While oil is heating, whisk together flour, 3/4 teaspoon salt, and 1/2 teaspoon black pepper in a shallow bowl. Have ready a medium-mesh sieve in another shallow bowl.",
        "Dredge a small handful of squid rings in flour mixture, tossing to coat well. Transfer to sieve and shake over other bowl to remove excess flour. Return excess flour to first bowl.",
        "Fry floured rings in oil, stirring to separate, until golden, about 1 minute, then transfer with a slotted spoon to dry paper towels to drain, arranging in 1 layer.",
        "Coat and fry remaining rings in about 3 more batches in same manner, returning oil to 390°F between batches. Transfer fried and drained rings to a shallow baking pan in 1 layer and keep warm, uncovered, in middle of oven.",
        "Coat and fry tentacles in 2 or 3 batches until golden, about 1 1/2 minutes per batch, returning oil to 390°F between batches and transferring as fried to paper towels, then to baking pan.",
        "Serve with peperoncini mayonnaise for dipping.",
        "*Available in the Latino section of many supermarkets, natural foods stores, Kalustyan's (800-352-3451), and The Baker's Catalogue (800-827-6836)."
    ],
    "ingredients": [
        "6 to 8 drained bottled whole green peperoncini",
        "1/2 cup mayonnaise",
        "1 pound cleaned squid, preferably small",
        "6 to 7 cups vegetable oil",
        "3/4 cup rice flour*",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Fry",
        "Cocktail Party",
        "Mayonnaise",
        "Squid",
        "Hot Pepper",
        "Gourmet"
    ],
    "title": "Fried Calamari with Peperoncini Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/fried-calamari-with-peperoncini-mayonnaise-108155"
}
