{
    "directions": [
        "Grind fennel seeds in spice mill or mortar and pestle; set aside. Heat oil in a large skillet over medium. Add onion, season with salt, and cook, stirring often, until golden and soft, 8–10 minutes. Add chiles, garlic, coriander, and reserved fennel and cook, stirring, 1 minute. Add tomatoes, crushing with your hands as you go, and juices; reduce heat and gently simmer, stirring occasionally at first and more frequently as sauce thickens, until sauce is thickened and jammy, 50–60 minutes. Let cool; discard chiles. Pulse sauce in a food processor to a coarse purée.",
        "While tomato sauce is cooking, rinse potatoes in a colander under cold water until water runs clear. Transfer to a large pot and pour in cold water to cover by 1\". Season with salt and bring to a gentle simmer; cook until potatoes are just tender, 20–25 minutes. Drain and transfer potatoes to a kitchen towel–lined rimmed baking sheet. Chill (uncovered) until cold, about 1 hour.",
        "Meanwhile, whisk egg yolk, garlic, and vinegar in a small bowl to combine. Whisking constantly, gradually drizzle in grapeseed oil and continue to whisk until aioli is thickened and emulsified. Season with salt; stir in 1 tsp. water.",
        "Fit a large pot with thermometer and pour in vegetable oil to measure 3\". Heat over medium-high until thermometer registers 325°F. Working in batches, fry potatoes until skins begin to slightly bubble around edges but do not brown, about 2 minutes. Using a slotted spoon, transfer potatoes to paper towels to drain.",
        "Reheat oil until thermometer registers 375°F. Working in batches, refry potatoes until golden brown and very crisp, about 3 minutes per batch. Transfer to fresh paper towels to drain.",
        "Toss potatoes, paprika, and cumin in a large bowl; season with salt. Serve potatoes with tomato sauce and aioli.",
        "Tomato sauce can be made 4 days ahead; cover and chill. Bring to room temperature before serving.",
        "Potatoes can be blanched 1 day ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "1/4 teaspoon fennel seeds",
        "2 tablespoons olive oil",
        "1/2 medium onion, finely chopped",
        "Kosher salt",
        "2 chipotle chiles",
        "1 large pasilla, New Mexico, or guajillo chile, seeds removed",
        "3 garlic cloves, finely chopped",
        "1/2 teaspoon ground coriander",
        "1 (28-ounce) can whole peeled tomatoes",
        "1 1/2 pounds russet potatoes, scrubbed, cut into 1-inch pieces",
        "Kosher salt",
        "1 large egg yolk",
        "1 garlic clove, finely grated",
        "1 teaspoon red wine vinegar",
        "3/4 cup grapeseed oil",
        "Vegetable oil (for frying; about 8 cups)",
        "3/4 teaspoon paprika",
        "1/4 teaspoon ground cumin",
        "A spice mill or mortar and pestle; a deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Mayonnaise",
        "Side",
        "Fry",
        "Chile Pepper",
        "Cumin",
        "Coriander",
        "Tomato",
        "Garlic",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Potatoes with Tomato-Chipotle Sauce and Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/fried-potatoes-with-tomato-chipotle-sauce-and-aioli"
}
