{
    "directions": [
        "Heat a comal (griddle) or a dry well-seasoned cast-iron skillet over moderate heat until a bead of water evaporates quickly, then roast tomatoes, tomatillos, jalapeños, and onion, turning with tongs, until charred on all sides, 10 to 15 minutes. Core roasted tomatoes. Discard stems from jalapeños and discard half of seeds from each chile.",
        "For red salsa: Coarsely purée tomatoes, 1 jalapeño, 1 garlic clove, and 1 teaspoon salt in a blender or food processor, then transfer to a bowl.",
        "For green salsa: Coarsely purée tomatillos, remaining jalapeño, remaining garlic clove, remaining teaspoon salt, cilantro, and 1/4 cup water (add more if needed for desired consistency), then transfer to a bowl.",
        "Heat 2 tablespoons oil in a small nonstick skillet over moderately low heat until hot. Gently break 2 eggs into a cup, keeping yolks intact, then pour into skillet and cook, covered, 5 minutes, or to desired doneness. Season with salt and pepper.",
        "Fry tortillas while eggs cook. Make more eggs in same manner, adding oil as needed.",
        "While each serving of eggs is cooking, heat 2 tablespoons oil in another small nonstick skillet over moderate heat until hot but not smoking. Stack 2 tortillas in skillet. Cook bottom tortilla 30 seconds on first side, then flip stack with tongs. While second tortilla cooks on bottom, turn top tortilla over with tongs, then flip stack again. Continue until both sides of both tortillas are cooked. Tortillas will soften and puff slightly, then deflate (do not let them become brown or crisp). Fry more tortillas in same manner, adding oil as needed.",
        "Put tortillas on plate, overlapping slightly, and top with eggs. Spoon a different salsa over each egg."
    ],
    "ingredients": [
        "1/2 lb plum tomatoes",
        "1/2 lb fresh tomatillos, husks discarded and tomatillos rinsed",
        "2 fresh jalapeño chiles",
        "1 (1-inch) wedge of large white onion",
        "2 garlic cloves",
        "2 teaspoons salt",
        "3 tablespoons chopped fresh cilantro",
        "1/4 to 1/2 cup water",
        "4 to 8 tablespoons corn or vegetable oil",
        "8 large eggs",
        "8 (6- to 7-inch) corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Pepper",
        "Tomato",
        "Breakfast",
        "Fry",
        "Tomatillo",
        "Tortillas",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Eggs on Corn Tortillas with Two Salsas (Huevos Divorciados)",
    "url": "http://www.epicurious.com/recipes/food/views/fried-eggs-on-corn-tortillas-with-two-salsas-huevos-divorciados-103387"
}
