{
    "directions": [
        "Cover lentils with cold water by 2 inches in a saucepan, then simmer, uncovered, until just tender, about 20 minutes.",
        "While lentils are simmering, cook bacon in a 12-inch nonstick skillet over moderate heat, stirring, until crisp, then transfer with a slotted spoon to paper towels to drain, leaving fat in skillet. Add leeks, celery, and carrot to skillet and cook, stirring, until just tender. Add vinegar and boil until most of liquid is evaporated. Remove skillet from heat and stir in tarragon, half of bacon, and salt and pepper to taste. Transfer to a bowl and keep warm, covered, reserving skillet.",
        "Drain lentils well in a large sieve. Stir into vegetable mixture and season with salt and pepper. Keep warm, covered.",
        "Wipe skillet with paper towels, then add oil and heat over moderate heat until hot but not smoking. Fry eggs in batches until whites are just set but yolks are still runny and season with salt and pepper.",
        "Divide lentil salad among 4 plates. Top with spinach, eggs, and remaining bacon."
    ],
    "ingredients": [
        "3/4 cup lentils (preferably French green lentils)",
        "6 oz thick-cut bacon, cut crosswise into 1/4-inch-thick strips",
        "2 leeks (white and pale green parts only), finely chopped",
        "2 celery ribs, finely chopped",
        "1 large carrot, finely chopped",
        "2 tablespoons red-wine vinegar, or to taste",
        "1 tablespoon finely chopped fresh tarragon",
        "1 tablespoon olive oil",
        "8 large eggs",
        "1 cup baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Breakfast",
        "Brunch",
        "Fry",
        "New Year's Day",
        "Lunch",
        "Bacon",
        "Spinach",
        "Legume",
        "Lentil",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Fried Eggs Over Warm Lentil Salad with Lardons",
    "url": "http://www.epicurious.com/recipes/food/views/fried-eggs-over-warm-lentil-salad-with-lardons-103975"
}
