{
    "directions": [
        "Make the sauce: Pour the olive oil into a large skillet set over medium-high heat. When the olive oil is hot, add the chopped garlic. Cook and stir until garlic is sizzling and fragrant, taking care not to burn it. Add the anchovies and capers, and stir until capers dissolve into the oil. Add the butter and melt it, then pour in the white wine and lemon juice. Bring to a rapid simmer, and cook until reduced by half, about 6 to 7 minutes. Keep warm.",
        "Lay four slices of bread on your work surface. Top with the sliced mozzarella, making sure the cheese does not extend over the edges of the bread, trimming to fit if necessary. Top with remaining bread, to make four sandwiches. Seal each sandwich at each corner with a toothpick (four picks per sandwich).",
        "Spread flour on a rimmed plate. Beat eggs and milk together in a wide, shallow bowl. Heat about 1/2 inch vegetable oil in a skillet over medium heat; oil is ready when a crust of bread sizzles on contact.",
        "Dredge sandwiches well in flour, making sure to coat all sides and tap off the excess. Soak the sandwiches on all sides in the egg, letting the excess egg drip back into the bowl. Carefully ease the sandwiches into the oil, and fry until they're golden brown on both sides and the cheese is melted, about 1 to 2 minutes per side. Remove the sandwiches, and drain well on paper towels. Remove the toothpicks and use a serrated knife to cut them in half on the diagonal.",
        "Return the sauce to a simmer, and stir in the parsley. Spread the sauce on four serving plates, then top with a sandwich and serve hot."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "5 garlic cloves, chopped",
        "4 anchovy fillets",
        "3 tablespoons drained tiny capers",
        "2 tablespoons unsalted butter",
        "1/2 cup dry white wine",
        "3 tablespoons lemon juice",
        "8 slices firm white bread, crusts removed",
        "12 ounces fresh mozzarella, thinly sliced",
        "All-purpose flour, for dredging",
        "2 large eggs",
        "2 tablespoons milk",
        "Vegetable oil, for frying",
        "1 tablespoon chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Mozzarella",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fried Mozzarella Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/fried-mozzarella-skewers-369029"
}
