{
    "directions": [
        "Whisk potato starch, baking powder, and 3/4 cup arepa flour in a large bowl. Whisk in 2 1/3 cups water; let sit 30 minutes to allow flour to hydrate. Place remaining 1 cup arepa flour in a shallow bowl.",
        "Meanwhile, whisk egg yolk, garlic, and lemon juice in a small bowl to combine. Whisking constantly, gradually drizzle in grapeseed oil and olive oil; whisk until sauce is thickened and emulsified. Season aioli with salt; stir in 1 tsp. water.",
        "Fit a large pot with thermometer; pour in vegetable oil to come 3\" up sides of pot. Heat over medium-high until thermometer registers 375°F.",
        "Meanwhile, cut squid. Slice bodies lengthwise along one side and open to expose interior. Cut in half crosswise (or in thirds if large). Cut each half (or third) into 1 1/2\" triangles; cut tentacles in half. Rinse; pat dry.",
        "Working in batches of 5 or 6 and returning oil to 375°F between batches, dredge squid, scallions, and lemon in arepa flour, shaking off excess; dip into batter, letting extra drip off. Fry, turning every 30 seconds or so, until golden, crisp, and puffed, about 2 minutes. Transfer to paper towels; season with salt. Top with basil and serve with aioli."
    ],
    "ingredients": [
        "2/3 cup potato starch",
        "1 1/4 teaspoons baking powder",
        "1 3/4 cups arepa flour (precooked cornmeal), divided",
        "1 large egg yolk",
        "1 garlic clove, finely grated",
        "1 teaspoon fresh lemon juice",
        "1/2 cup grapeseed oil",
        "1/4 cup olive oil",
        "Kosher salt",
        "Vegetable oil (for frying; about 8 cups)",
        "6 ounces cleaned squid, bodies and tentacles separated",
        "4 scallions, white and pale-green parts only, sliced into 3-inch pieces",
        "4 very thin lemon wheels",
        "1/3 cup torn basil leaves",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Squid",
        "Fry",
        "Deep-Fry",
        "Mayonnaise",
        "Wheat/Gluten-Free",
        "Hominy/Cornmeal/Masa",
        "Garlic",
        "Seafood",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Fried Squid With Aioli",
    "url": "http://www.epicurious.com/recipes/food/views/fried-squid-with-aioli"
}
