{
    "directions": [
        "Stir together flour and salt in a bowl, then make a well in center and add raki, lemon juice, 3/4 teaspoon oil, and water. Stir until a soft dough forms. Turn out dough onto a floured surface and knead, working in just enough additional flour to keep dough from sticking, until dough is smooth and elastic, 8 to 10 minutes. Wrap dough in plastic wrap and let stand at room temperature 1 hour.",
        "Bring water, sugar, honey, and zests to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved. Reduce heat and simmer 5 minutes. Cool syrup.",
        "Halve dough. Roll out 1 half into a roughly 18- by 11-inch (paper-thin) rectangle on floured surface with a floured rolling pin, rotating rectangle and turning over occasionally and dusting with just enough flour to keep dough from sticking. Cut rectangle lengthwise into 5 (2-inch-wide) strips using pastry wheel or a sharp knife, then transfer strips to a dry kitchen towel dusted with flour, gently stretching strips to 20 inches as you transfer them. Roll out remaining dough and make 5 more strips in same manner.",
        "Heat 1 inch oil in a deep 12-inch heavy skillet until it registers 375°F on thermometer (see cooks' note, below). Working with 1 strip at a time, carefully slip one third of strip into hot oil (holding rest of strip aloft in one hand), then, using your other hand, hook end of strip (in oil) between tines of long-handled fork. Rotate fork, tilting it upright to be perpendicular to skillet and wrapping dough into beginning of spiral. As dough in oil begins to puff, continue to gradually lower uncooked part of strip into oil, rotating fork to wrap pastry around fork in a loose spiral (this will take about 30 seconds total). Using regular fork, gently hold end of strip against spiral. Turn spiral over using both forks and fry until pale golden, about 30 seconds more. Transfer spiral to paper towels to drain. Fry remaining 9 strips in same manner. (Return oil to 375°F between spirals.)",
        "Toast walnuts and sesame seeds in a dry small skillet over moderately low heat, stirring constantly, until seeds are golden, about 3 minutes. Transfer to a bowl to cool.",
        "Reheat syrup until warm, then discard zests. Arrange spirals on a large platter and drizzle syrup over them, then sprinkle with walnut mixture."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour plus additional for kneading",
        "3/4 teaspoon salt",
        "1 tablespoon raki, ouzo, or other anise-flavored liqueur",
        "1 tablespoon fresh lemon juice",
        "About 4 cups extra-virgin olive oil",
        "1/2 cup water",
        "2 tablespoons finely chopped walnuts",
        "2 tablespoons sesame seeds",
        "1 cup water",
        "2/3 cup sugar",
        "1/2 cup mild honey",
        "2 (4- by 1-inch) strips fresh lemon zest",
        "2 (4- by 1-inch) strips fresh orange zest",
        "Special equipment: a fluted pastry wheel (optional); a deep-fat thermometer; a long-handled metal 2- or 3-prong kitchen fork; a regular stainless-steel fork"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Dessert",
        "Fry",
        "Lemon",
        "Orange",
        "Walnut",
        "Spring",
        "Honey",
        "Anise",
        "Pastry",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fried Pastry Spirals with Honey, Sesame, and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/fried-pastry-spirals-with-honey-sesame-and-walnuts-108130"
}
