{
    "directions": [
        "In a medium bowl, stir together mustard, 1/2 cup olive oil, ketchup, Worcestershire sauce, horseradish, garlic, lemon juice, onion and 2 teaspoons of green onion. Season with paprika, pepper, cayenne pepper and parsley. Gently stir in the shrimp until evenly distributed. Cover and refrigerate until needed.",
        "In a shallow bowl, whisk together the buttermilk and egg with a fork. Spread the cornmeal out on a plate. Heat 1/4 cup of olive oil in a large skillet over medium heat. Add more if needed to maintain an even coating of oil in the bottom of the skillet.",
        "Dip the tomato slices in the buttermilk and egg, then dip into the cornmeal to coat thoroughly. Fry slices in the hot oil until golden brown on each side, about 5 minutes per side. Transfer to a paper towel-lined plate and continue breading and frying the remaining tomato slices.",
        "To serve, arrange salad greens on six plates. Top each one with two slices of fried green tomato, then spoon some of the shrimp remoulade over the tomatoes and sprinkle with the remaining green onion to garnish."
    ],
    "ingredients": [
        "1/2 cup Creole mustard",
        "1/2 cup olive oil",
        "2 tablespoons ketchup",
        "1 teaspoon Worcestershire sauce",
        "2 teaspoons prepared horseradish",
        "2 cloves garlic, chopped",
        "1 tablespoon lemon juice",
        "2 teaspoons minced onion",
        "2 teaspoons chopped green onion",
        "2 teaspoons paprika",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon cayenne pepper",
        "2 teaspoons chopped fresh parsley",
        "24 cooked medium shrimp, shelled and deveined",
        "1 cup buttermilk",
        "1 egg",
        "2 cups yellow cornmeal",
        "3 large green tomatoes, sliced 1/2 inch thick",
        "1/4 cup olive oil, or as needed",
        "2 cups mixed salad greens",
        "3 tablespoons chopped green onion"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Green Tomatoes with Shrimp Remoulade",
    "url": "http://allrecipes.com/recipe/127164/fried-green-tomatoes-with-shrimp-remo/"
}
