{
    "directions": [
        "Mix long grain and wild rice mix, contents of seasoning packet, water, and 1 tablespoon butter in a saucepan and place over medium heat.",
        "Bring rice to a boil, reduce heat to low, and cover the pan; simmer until rice is tender and liquid has been absorbed, about 25 minutes. Set rice aside and keep warm.",
        "Melt 2 teaspoons butter in a saucepan over medium-low heat. Cook and stir celery, onion, and green bell pepper until tender, about 10 minutes.",
        "Mix in Worcestershire sauce, chili powder, seafood seasoning, crushed tomatoes, tomato paste with garlic, and cornstarch; stir until smoothly combined.",
        "Season with chili-garlic sauce; let the sauce simmer, stirring occasionally, while you prepare the fish.",
        "Whisk together flour, cayenne pepper, salt, and black pepper in a shallow bowl.",
        "Beat egg in a separate bowl.",
        "Place panko crumbs into another shallow bowl.",
        "Heat vegetable oil in a large skillet over medium heat.",
        "Dredge fish pieces in seasoned flour, and tap off excess flour.",
        "Dip floured fish into beaten egg, then dredge fish in panko crumbs. Tap off excess crumbs.",
        "Repeat the process, dipping each fish piece again into seasoned flour, egg, and bread crumbs.",
        "Pan-fry coated fish in hot oil until golden brown, about 2 minutes per side.",
        "Drain fish on a plate lined with paper towels.",
        "To serve, transfer long grain and wild rice to a platter; top with fish pieces, and spoon Creole sauce over the fish and around the edge of the rice."
    ],
    "ingredients": [
        "1 (6 ounce) package long grain and wild rice mix",
        "2 1/4 cups water",
        "1 tablespoon butter (optional)",
        "2 teaspoons butter",
        "1/2 cup diced celery",
        "1/2 cup diced onion",
        "1/2 cup diced green bell pepper",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons chili powder",
        "1 tablespoon seafood seasoning (such as Old Bay®)",
        "1 (15 ounce) can crushed tomatoes",
        "1 (6 ounce) can tomato paste with roasted garlic",
        "2 teaspoons cornstarch",
        "3 dashes chile-garlic sauce (such as Sriracha®), or to taste",
        "1/4 cup quick-mixing flour (such as Wondra®)",
        "2 teaspoons cayenne pepper",
        "salt and ground black pepper to taste",
        "1 egg",
        "1 cup panko bread crumbs",
        "1/2 cup vegetable oil for frying, or as needed",
        "2 (4 ounce) fillets fresh catfish - cut in half crosswise, then cut lengthwise into 1-inch wide strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Creole Catfish",
    "url": "http://allrecipes.com/recipe/220110/fried-creole-catfish/"
}
