{
    "directions": [
        "Fill a pot with lightly salted water and bring to a rolling boil over high heat. Stir in the macaroni, and return to a boil. Cook, uncovered, stirring occasionally, until the macaroni is cooked through but still firm to the bite, about 7 minutes. Drain. Stir in the 2 tablespoons butter, the 1/4 cup milk, and the cheese packet from the package.",
        "While the macaroni is still hot, stir in the Cheddar cheese, pimento cheese spread, and Italian cheese blend, and continue to stir until melted. Place the macaroni and cheese mixture in a container and refrigerate until firm, about 4 hours.",
        "Line a baking sheet with parchment paper. Remove the macaroni mixture from the refrigerator, and, using a cookie scoop, scoop into balls. Place mac balls on the prepared baking sheet and freeze for at least 2 hours.",
        "Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Whisk the bread crumbs with the paprika, chili powder, black pepper, sugar, and cayenne in a shallow dish; set aside. Beat the eggs with the 3 tablespoons milk in a small bowl. Remove the mac balls from the freezer, coat in the egg wash, and then dredge in breading.",
        "Fry the mac balls in small batches until golden brown, 3 to 5 minutes. Drain briefly on a paper towel-lined plate; serve hot."
    ],
    "ingredients": [
        "1 (7.25 ounce) package macaroni and cheese mix",
        "2 tablespoons butter",
        "1/4 cup milk",
        "1 cup shredded Cheddar cheese",
        "3/4 cup pimento cheese spread",
        "1 cup shredded Italian cheese blend",
        "2 cups Italian seasoned bread crumbs",
        "1/2 teaspoon paprika",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon salt",
        "1 pinch cayenne pepper, or to taste",
        "4 eggs",
        "3 tablespoons milk",
        "4 cups peanut oil for frying, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Mac and Cheese Balls",
    "url": "http://allrecipes.com/recipe/186033/fried-mac-and-cheese-balls/"
}
