{
    "directions": [
        "Place the mussels in a large pot over high heat and add the wine, if using. Cover and let the mussels steam for about 5 minutes, shaking the pot and stirring every now and then, until the shells open. Throw away the ones that stay closed. Shuck the mussels and discard the shells. Cover and refrigerate until needed, up to 3 hours.",
        "Add salt and Aleppo pepper to the mussels, dust with about 2 tablespoons cornstarch,and toss to coat lightly. Heat about 2 inches of olive oil in a skillet over medium-high heat. Mix the remaining 1 cup cornstarch, the flour, and the baking powder in a bowl. Add the ouzo and sparkling water, whisking to incorporate. It should be runny. If too thick, add a little more sparkling water.",
        "When the oil is very hot (about 350°F), dip a few mussels at a time in the batter,remove with tongs, and fry, turning them as they turn deep golden, about 1 minute total. Transfer to a plate lined with a double layer of paper towels to drain.",
        "Serve with lemon quarters and skordalia."
    ],
    "ingredients": [
        "35 to 40 large mussels, cleaned under running water (about 3 pounds)",
        "1 cup dry white wine (optional)",
        "Sea salt",
        "Good pinch of Aleppo or Maras pepper or hot red pepper flakes, to taste",
        "1 cup plus 2 tablespoons cornstarch",
        "Olive oil or olive and sunflower oil for frying",
        "11/ 2 cups all-purpose flour",
        "11/ 2 teaspoons baking powder",
        "1 cup ouzo (see Note)",
        "1/ 2 cup sparkling water, or more as needed",
        "2 lemons, quartered",
        "Vali's Skordalia or Roasted Garlic Skordalia"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Garlic",
        "Olive",
        "Pepper",
        "Fry",
        "Steam",
        "Lemon",
        "Mussel"
    ],
    "title": "Fried Mussels in Ouzo Batter",
    "url": "http://www.epicurious.com/recipes/food/views/fried-mussels-in-ouzo-batter-355950"
}
