{
    "directions": [
        "Pulse together sauce ingredients in a food processor until smooth.",
        "If using fresh yuca, trim ends and cut crosswise into 3-inch pieces, then peel, removing waxy brown skin and pinkish layer underneath.",
        "Cover yuca (fresh or frozen) with cold salted water by 1 inch in a 4-quart pot. Bring to a boil, then reduce heat and simmer until yuca is tender when pierced with a wooden skewer, 15 to 20 minutes. Transfer with a slotted spoon to several layers of paper towels to drain, then cool 5 minutes. Cut yuca lengthwise into 1/8-inch-wide wedges, discarding thin woody core. (If there are pieces that have white parts to them, return them to barely simmering water and simmer until almost translucent.)",
        "Heat about 1 1/2 inches oil in a 4- to 5-quart heavy pot over moderate heat until it registers 360°F on thermometer.",
        "Fry yuca in 3 batches, turning occasionally, until golden, 3 to 5 minutes per batch. Transfer with a slotted spoon to paper towels to drain. (Return oil to 360°F between batches.) Sprinkle fries with salt and serve with cheese sauce."
    ],
    "ingredients": [
        "1/2 lb Mexican queso fresco or mild feta cheese, broken into small pieces",
        "1/2 cup half-and-half",
        "1 1/2 tablespoons bottled ajì amarillo purée (available at kitchenmarket.com)",
        "1 garlic clove, peeled and smashed",
        "1/4 teaspoon black pepper",
        "2 lb fresh yuca (cassava) or 1 1/2 lb frozen peeled yuca (not thawed)",
        "About 6 cups vegetable oil",
        "1/4 teaspoon salt",
        "Special equipment: a deep-fat thermometer",
        "Garnish: fresh lime wedges (preferably Key limes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Garlic",
        "Side",
        "Fry",
        "Vegetarian",
        "Yuca",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Yuca with Peruvian Cheese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fried-yuca-with-peruvian-cheese-sauce-235424"
}
