{
    "directions": [
        "Place carrots and chile in a small heatproof bowl. Bring vinegar, sugar, 1 teaspoon salt, and 1/2 cup water to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour over carrots and chiles; let sit at least 30 minutes. Drain, reserving 1/4 cup pickling liquid.",
        "Meanwhile, heat 1 tablespoon oil in a medium saucepan over medium-high heat. Add farro and half of garlic and cook, stirring constantly, until farro is dark brown, 8-10 minutes. Add 6 cups water and bring to a boil. Boil farro until tender but still firm to the bite, 25-30 minutes. Drain; let cool.",
        "Heat 1 tablespoon oil in a large skillet over medium-high heat. Add mushrooms and cook, tossing often, until soft and just starting to brown, 5-7 minutes. Using a slotted spoon, transfer to a plate. Add 2 tablespoons oil, then kale and remaining garlic to skillet. Cook, tossing often, until kale is wilted, about 4 minutes. Add colatura, farro, mushrooms, and pickled carrots. Cook, tossing often, until warmed through, 5-7 minutes; season with salt and pepper and reserved pickling liquid. Mix in parsley; divide among bowls.",
        "Heat remaining 1 tablespoon oil in a small nonstick skillet over medium-high heat. Crack eggs into skillet and fry until egg whites are set but yolks are still soft and runny, about 3 minutes (slightly longer for duck egg). Top farro with eggs and scallions; season with red pepper flakes. Just before serving, break up eggs and mix into farro.",
        "DO AHEAD: Carrots can be pickled 2 weeks ahead; cover and chill."
    ],
    "ingredients": [
        "2 medium carrots, peeled, chopped",
        "1 red chile, seeded, coarsely chopped",
        "1/2 cup white wine vinegar",
        "1 teaspoon sugar",
        "1 teaspoon kosher salt plus more",
        "5 tablespoons olive oil, divided",
        "1 1/2 cups semi-pearled farro",
        "2 garlic cloves, chopped, divided",
        "6 ounces maitake mushrooms, torn into 1\" pieces",
        "1/2 bunch Tuscan kale, center ribs and stems removed, torn into 1\" pieces",
        "1 tablespoon colatura (anchovy sauce) or fish sauce (nam pla or nuoc nam)",
        "Freshly ground black pepper",
        "1/2 cup fresh flat-leaf parsley leaves",
        "2 large eggs or 1 duck egg",
        "2 scallions, thinly sliced",
        "Crushed red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Mushroom",
        "Fry",
        "Dinner",
        "Lunch",
        "Kale",
        "Carrot",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fried Farro with Pickled Carrots and Runny Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/fried-farro-with-pickled-carrots-and-runny-eggs-51187150"
}
