{
    "directions": [
        "Purée cilantro, parsley, garlic, half of chiles, and 1/4 cup olive oil in a blender or food processor until very smooth; season herb oil with salt and set aside.",
        "Whisk yogurt, lemon juice, and remaining 1/4 cup olive oil in a small bowl; season with salt and set yogurt sauce aside.",
        "Place eggplants in a colander set in the sink; season with 3/4 teaspoon salt. Let sit 30 minutes to drain, then pat dry.",
        "Fit a medium pot with thermometer; pour in vegetable oil to measure 2\". Heat over medium-high heat until thermometer registers 375°.",
        "Working in batches and returning oil to 375° between batches, fry eggplants, turning often, until golden brown and tender, about 5 minutes. Using a slotted spoon, transfer eggplants to paper towels to drain; season with salt. Let cool.",
        "Combine eggplants in a large bowl with tomatoes, cucumbers, and remaining chiles; drizzle with some reserved herb oil and toss to combine. Season salad with salt.",
        "Spoon reserved yogurt sauce onto a platter, top with salad, and drizzle with more herb oil.",
        "Do ahead: Herb oil and yogurt sauce can be made 1 day ahead. Cover and chill separately."
    ],
    "ingredients": [
        "1/2 cup fresh cilantro leaves with tender stems",
        "1/2 cup fresh flat-leaf parsley leaves with tender stems",
        "1 garlic clove, chopped",
        "2 small green chiles, such as Thai, seeds removed, chopped, divided",
        "1/2 cup olive oil, divided",
        "3/4 teaspoon kosher salt, plus more",
        "3/4 cup plain whole-milk Greek yogurt",
        "1 tablespoon fresh lemon juice",
        "2 medium eggplants (about 1 1/2 pounds), cut into 1 1/2\" pieces",
        "Vegetable oil (for frying; about 2 cups)",
        "1 pound small tomatoes (about 8), cut into wedges",
        "1/2 pound Persian cucumbers (about 3), sliced",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Vegetarian",
        "Lunch",
        "Buffet",
        "Cucumber",
        "Eggplant",
        "Spring",
        "Summer",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Eggplant, Tomato, and Cucumber Salad",
    "url": "http://www.epicurious.com/recipes/food/views/fried-eggplant-tomato-and-cucumber-salad-51242130"
}
