{
    "directions": [
        "Combine rhubarb, sugar, lemon juice, honey, and water together in a saucepan over high heat; cook and stir until rhubarb softens to a pulp, 5 to 10 minutes. Add strawberries and cook until strawberries fall apart and most of the liquid is dissolved, about 5 minutes. Remove saucepan from heat and cool jam for 10 minutes.",
        "Line a baking sheet with parchment paper. Measuring out in 1/2 tablespoons, spoon 14 portions of jam and 14 portions of peanut butter onto the prepared baking sheet. Cover baking sheet with plastic wrap and freeze until fillings are solid, 3 hours to overnight.",
        "Roll dough onto a lightly floured piece of parchment paper, pressing dough together at the seams. Seal the seams together and slightly flatten dough by rolling a lightly floured rolling pin over it. Cut 28 circles out of dough using a 2-inch cookie cutter. Arrange the circles on the parchment paper.",
        "Place 1 jam and 1 peanut butter filling onto the center of 14 dough circles. Place a second circle of dough over the filling, rolling up the edges of the bottom circle and crimping together to seal. Arrange crescent pockets on a baking sheet and freeze.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Fry crescent pockets, 3 at a time, in the hot oil using a small wooden spoon to flip them continuously until golden, about 1 minute per side. Transfer pockets to a paper towel-lined plate."
    ],
    "ingredients": [
        "Jam:",
        "2 stalks fresh rhubarb, diced",
        "1/4 cup white sugar",
        "1/2 lemon, juiced",
        "2 tablespoons honey, or more to taste",
        "1 tablespoon water",
        "1/2 cup sliced strawberries, or to taste",
        "1/2 cup peanut butter",
        "2 (8 ounce) packages refrigerated crescent roll dough",
        "1 cup vegetable oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried PB & J",
    "url": "http://allrecipes.com/recipe/246278/fried-pb-j/"
}
