{
    "directions": [
        "Squeeze juice from 1 lemon half into a bowl of water, then drop same half into water.",
        "Cut off artichoke stems and discard. Cut off top 1/2 inch of 1 artichoke with a serrated knife.",
        "Bend outer leaves backward until they snap off close to base, then discard several more layers of leaves in same manner until you reach pale yellow leaves with pale green tips. Cut off green tips.",
        "Trim dark green fibrous parts from base and sides of artichoke with a small sharp knife, then rub cut surfaces with other lemon half. Drop artichoke into acidulated water. Trim remaining artichokes in same manner.",
        "Put 1 1/2 quarts water in a 3-quart saucepan and stir in 1 tablespoon oil and 1 tablespoon salt, then bring to a simmer. Remove trimmed artichokes from acidulated water with a slotted spoon, then add to simmering water. Cook, partially covered, until stem ends are tender when pierced with a small sharp knife, 12 to 14 minutes. Transfer with a slotted spoon to a cutting board and, when cool enough to handle, quarter artichokes lengthwise.",
        "Whisk together vinegar, mustard, sugar, pepper, and remaining 1/2 teaspoon salt in a small bowl or glass measure. Add remaining 6 tablespoons oil in a slow stream, whisking until combined well. Whisk in dill.",
        "Combine artichokes and raw asparagus in a bowl and toss with all but 1/4 cup of vinaigrette. Chill, covered, or let stand at room temperature until ready to serve.",
        "Whisk together matzo meal, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a shallow bowl or pie plate. Lightly beat eggs with 1/4 teaspoon salt in another shallow bowl or pie plate.",
        "Pat chicken dry and sprinkle with remaining 1/4 teaspoon each of salt and pepper. Coat chicken in egg, letting excess drip off, then dredge in matzo meal, pressing chicken into crumbs to help them adhere. Transfer chicken to a plate, arranging in 1 layer, as dredged.",
        "Heat oil in a 12-inch heavy skillet (2 to 3 inches deep) over moderately high heat until hot but not smoking. Reduce heat to moderate, then fry chicken, turning over once with 2 spatulas, until golden and just cooked through, about 14 minutes. Transfer to paper towels to drain.",
        "Divide greens among 4 plates and top with artichokes and asparagus. Serve fried chicken alongside, drizzled with some of remaining vinaigrette."
    ],
    "ingredients": [
        "1 lemon, halved",
        "8 baby artichokes",
        "7 tablespoons olive oil",
        "1 tablespoon plus 1/2 teaspoon salt",
        "2 tablespoons cider vinegar",
        "1 teaspoon coarse-grain mustar",
        "1 teaspoon sugar",
        "1/4 teaspoon black pepper",
        "3 tablespoons chopped fresh dill",
        "1/2 lb asparagus, trimmed and very thinly sliced on a long diagonal",
        "2 oz mesclun or other delicate salad greens",
        "3/4 cup matzo meal",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 large eggs",
        "4 skinless boneless chicken breast halves",
        "1 cup vegetable oil or a combination of vegetable and olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Poultry",
        "Fry",
        "Passover",
        "Pan-Fry",
        "Kosher",
        "Simmer",
        "Gourmet"
    ],
    "title": "Fried Chicken with Spring Salad",
    "url": "http://www.epicurious.com/recipes/food/views/fried-chicken-with-spring-salad-234254"
}
