{
    "directions": [
        "In a small saucepan heat butter over moderately low heat until foam subsides and stir in flour. Cook roux, stirring constantly, 2 minutes. Add milk and cream in a stream, whisking, and simmer, whisking, 2 minutes, or until sauce thickens slightly. Remove pan from heat and stir in cheese, nutmeg, and salt and pepper to taste until cheese is melted. Keep sauce warm, covered, over very low heat.",
        "Split and toast muffins. Put 2 muffin halves on each of 2 plates. In a non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté arugula with salt to taste, stirring, until just wilted. Divide arugula among muffin halves and top with prosciutto.",
        "In same skillet heat butter over moderate heat until foam subsides and crack eggs, 1 at a time, into a small bowl, adding them as they are cracked to skillet. Season eggs with salt and pepper and cook 2 minutes, or until whites are set on bottom but still runny on top. With a spatula gently turn each egg over and cook 2 minutes more, or until yolks are just set. With spatula gently transfer eggs to prosciutto and top with cheese sauce."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "1 tablespoon all-purpose flour",
        "1 cup whole milk",
        "1 tablespoon heavy cream",
        "1/2 cup coarsely grated Gruyère or Swiss cheese (about 2 ounces)",
        "a small pinch freshly grated nutmeg",
        "2 English muffins",
        "1 teaspoon olive oil",
        "3 cups packed trimmed arugula",
        "4 thin slices prosciutto",
        "1 tablespoon unsalted butter",
        "4 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Leafy Green",
        "Pork",
        "Breakfast",
        "Brunch",
        "Quick & Easy",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fried Eggs, Prosciutto, and Arugula with Cheese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fried-eggs-prosciutto-and-arugula-with-cheese-sauce-14583"
}
