{
    "directions": [
        "Cut squid bodies into 1/2-inch-thick rounds. Place all squid in large sieve set over bowl. Refrigerate at least 1 hour to drain well.",
        "Place 1 cup flour, 1 cup rice flour, soy sauce, vinegar, peanut oil, and sugar in large bowl. Gradually add 1 1/4 cups water, whisking until batter is smooth. If necessary, whisk in more water by teaspoonfuls until batter reaches heavy cream consistency. Let batter stand at least 1 hour and up to 3 hours at room temperature, whisking occasionally.",
        "Mix remaining 1/2 cup flour and 1/2 cup rice flour in large bowl. Add squid. Toss until squid is coated, separating pieces. Turn mixture into another sieve and shake off excess flour. Sprinkle squid generously with salt, tossing in sieve. Mix coated squid into batter.",
        "Pour oil into heavy large saucepan to depth of 1 1/2 inches. Attach clip-on deep-fry thermometer and heat oil over medium-high heat to 350°F to 360°F. Working in batches and stirring often with tongs to separate pieces, drop squid into oil. Fry until crisp and brown, about 4 minutes per batch. Using slotted spoon, transfer squid to paper towels. Sprinkle with salt and pepper.",
        "Combine frisée, papaya, cashews, water chestnuts, and ginger in large bowl. Add enough dressing to coat lightly. Divide salad among plates, mounding in center.",
        "Pile squid atop salad on each plate. Sprinkle with sesame seeds. Serve, passing remaining dressing separately.",
        "*Available at some supermarkets, specialty foods stores, and natural foods stores."
    ],
    "ingredients": [
        "1 1/2 pounds frozen cleaned small squid (bodies and tentacles), thawed, drained, or 1 pound fresh",
        "1 1/2 cups all purpose flour, divided",
        "1 1/2 cups rice flour,* divided",
        "2 tablespoons soy sauce",
        "1 tablespoon unseasoned rice vinegar",
        "1 teaspoon peanut oil",
        "1 teaspoon sugar",
        "1 1/4 cups (or more) water",
        "Vegetable oil (for deep-frying)",
        "4 cups (about 2 heads) frisée lettuce",
        "2 cups 1/2-inch cubes peeled seeded fresh papaya",
        "1/2 cup whole roasted salted cashews",
        "6 fresh water chestnuts, peeled, thinly sliced into rounds",
        "1/3 cup thin strips peeled fresh ginger",
        "Spicy-Sour Dressing",
        "Toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fish",
        "Ginger",
        "Appetizer",
        "Fry",
        "Papaya",
        "Squid",
        "Engagement Party",
        "Potluck",
        "Pescatarian"
    ],
    "title": "Fried Squid, Papaya, and Frisée Salad with Spicy-Sour Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/fried-squid-papaya-and-frisee-salad-with-spicy-sour-dressing-231419"
}
