{
    "directions": [
        "Thoroughly rinse the chicken, then cover all the pieces with 4 cups buttermilk and soak in the fridge overnight or up to 24 hours. When you're ready to fry the chicken, remove the bowl from the fridge and let it sit on the counter for 30 minutes, just to take off the chill.",
        "In the meantime, preheat the oven to 360 degrees F and mix up the breading. Place the flour, seasoned salt, paprika, pepper, thyme and cayenne (extra cayenne if you like heat) in a very large bowl. Stir together well.",
        "In a small bowl, combine the 1/4 cup buttermilk and the milk. Pour the milk mixture into the flour and, with a fork, gradually mix until there are little lumps throughout. This will adhere to the chicken and make for a crispier breading. If necessary, add a little more flour or milk to the bowl in order to make it slightly lumpy.",
        "Heat 1 1/2 to 2 inches of oil in a deep skillet over medium-high heat until a thermometer reaches 365 degrees F. Lower the heat slightly, if necessary, to keep the oil from getting hotter.",
        "Working in batches, thoroughly coat each chicken piece with the breading, pressing extra breading onto the chicken if necessary. Place the breaded pieces on a plate.",
        "Add the chicken to the oil 3 or 4 pieces at a time. Make sure they aren't sticking together, then cover the pan and fry for 5 to 7 minutes, checking occasionally to make sure the chicken isn't getting too brown. Turn the pieces over, cover again, and cook 3 to 5 minutes more. All the while, monitor the temperature of the oil to make sure the chicken doesn't burn.",
        "Place the chicken on a baking sheet and continue frying the rest of the chicken. When all the chicken has been fried, remove the wings and legs to a plate and keep covered. These should be cooked all the way through by now but always check, if any pink juice or meat is visible. If so, return to the hot oil for another minute or so until fully cooked. Leave the thighs and breasts on the baking sheet.",
        "Bake the thighs and breasts for 15 minutes to finish the cooking process. Sometimes I'll cut into the thicker part of one of the larger pieces, just to make sure the chicken is cooked through. If any pink juice or meat is visible, the chicken needs to continue cooking in the oven."
    ],
    "ingredients": [
        "2 cut-up fryer chickens in 16 pieces",
        "4 1/4 cups cups buttermilk",
        "5 cups all-purpose flour",
        "3 tablespoons seasoned salt, such as Lawry's",
        "2 teaspoons paprika",
        "2 teaspoons freshly ground black pepper",
        "2 teaspoons ground dried thyme",
        "1 teaspoon cayenne pepper, plus more for seasoning",
        "1/4 cup milk",
        "Canola or vegetable oil, for frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Chicken",
        "Poultry Recipes",
        "Buttermilk",
        "Dairy Recipes",
        "Main Dish Recipes",
        "Deep-Frying"
    ],
    "title": "Fried Chicken",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/fried-chicken"
}
