{
    "directions": [
        "Combine buttermilk, cayenne, garlic powder, salt, and paprika in a large bowl or large resealable plastic bag. Add chicken thighs, cover bowl or seal bag, and toss to coat. Chill at least 2 hours and up to 12 hours.",
        "Bring 4 cups salted water to a boil and gradually add grits, whisking constantly. Cook, whisking occasionally, until grits are very tender and creamy, 25–30 minutes. Add cream cheese and Parmesan; whisk until melted and incorporated; season with salt and pepper. Cover and keep warm until ready to serve.",
        "Whisk flour, cayenne, garlic powder, paprika, and 2 tsp. salt in a medium bowl.",
        "Remove chicken thighs from brine, letting excess drip off. Working in batches, dredge chicken in flour mixture, occasionally dipping your fingers in brine as you pack on flour to help create moistened, shaggy bits (the makings of a super-crisp crust); transfer to a rimmed baking sheet.",
        "Fit a large cast-iron skillet with thermometer and heat oil until thermometer registers 350°F. Working in batches and returning oil to 350°F between batches, fry chicken thighs, turning occasionally, until chicken is cooked through and coating is deep golden brown and crisp, 6–8 minutes. Transfer to a wire rack set inside a baking sheet and let sit while you cook the kale.",
        "Heat butter in a large skillet over medium-high. Add kale in large handfuls, letting it cook down slightly before adding more and tossing to coat. Season with salt and pepper and cook, tossing occasionally, until wilted and bright green, about 2 minutes. Add vinegar and 1 Tbsp. pepper jelly and toss to coat.",
        "Divide grits evenly among bowls and top with kale, fried chicken, and more pepper jelly."
    ],
    "ingredients": [
        "1 1/2 cups buttermilk",
        "1 teaspoon cayenne pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon kosher salt",
        "1 teaspoon smoked paprika",
        "1 pound skinless, boneless chicken thighs",
        "Kosher salt",
        "1 1/2 cups white grits (not instant)",
        "4 ounces cream cheese",
        "2 ounces finely grated Parmesan",
        "Freshly ground black pepper",
        "2 cups all-purpose flour",
        "1 teaspoon cayenne pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon smoked paprika",
        "2 teaspoons kosher salt, plus more",
        "2 cups vegetable oil",
        "2 tablespoons unsalted butter",
        "2 bunches kale, or Swiss chard, ribs and stems removed, leaves torn into 2\" pieces",
        "Freshly ground black pepper",
        "1 tablespoon distilled white vinegar",
        "1 tablespoon hot pepper jelly, plus more for serving",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dinner",
        "Hominy/Cornmeal/Masa",
        "Kid-Friendly",
        "Cheese",
        "Kale",
        "Leafy Green",
        "Buttermilk",
        "Parmesan",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fried Chicken Thighs with Cheesy Grits",
    "url": "http://www.epicurious.com/recipes/food/views/fried-chicken-thighs-with-cheesy-grits"
}
