{
    "directions": [
        "Mix garlic, mayonnaise, and hot pepper sauce in a small bowl; cover and chill. Toss onion, jalapeño, cabbage, pickles, and pickle juice in a large bowl to combine; cover and chill.",
        "Whisk flour, pepper, and 1/2 teaspoon salt in a shallow bowl. Pour buttermilk into another shallow bowl. Working with 1 piece at a time, dredge chicken in flour mixture, shaking off excess. Dip in buttermilk, allowing excess to drip back into bowl. Dredge again in flour mixture, shaking off excess.",
        "Pour oil into a large heavy skillet to a depth of 1/2\". Prop deepfry thermometer in oil so bulb is submerged. Heat over medium heat until thermometer registers 350°F.",
        "Fry chicken until golden brown and cooked through, about 3 minutes per side. Transfer to a wire rack set inside a baking sheet; season with salt. Spread cut sides of rolls with butter. Heat another large skillet over medium heat. Working in batches, cook rolls buttered side down until browned and crisp, about 1 minute.",
        "Spread with spicy mayo. Build sandwiches with rolls, chicken, and cabbage slaw."
    ],
    "ingredients": [
        "1 garlic clove, finely grated",
        "1/2 cup mayonnaise",
        "1 tablespoon Louisiana-style hot pepper sauce",
        "1/2 small red onion, thinly sliced",
        "1 jalapeño, thinly sliced",
        "4 cups thinly sliced cabbage",
        "1/2 cup bread-and-butter pickle slices, plus 1/4 cup pickle juice",
        "2 cups all-purpose flour",
        "1 tablespoon ground black pepper",
        "1/2 teaspoon kosher salt plus more",
        "1 cup buttermilk",
        "2 8-ounces skinless, boneless chicken breasts, halved crosswise",
        "Peanut or vegetable oil (for frying)",
        "4 white sandwich rolls",
        "2 tablespoons unsalted butter, room temperature",
        "Special equipment: A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Fry",
        "Deep-Fry",
        "Cabbage",
        "Jalapeño"
    ],
    "title": "Fried Chicken Sandwich with Slaw and Spicy Mayo",
    "url": "http://www.epicurious.com/recipes/food/views/fried-chicken-sandwich-with-slaw-and-spicy-mayo-51155290"
}
