{
    "directions": [
        "Separate the thin leafy parts of the mustard greens from the thicker stems, and set them aside in separate bowls. Place the onion, garlic, chili peppers, fennel, cumin, and coriander in the work bowl of a food processor, and pulse until the mixture becomes a paste.",
        "Heat the oil in a wok or large skillet over medium-high heat, and cook and stir the onion-garlic mixture until it releases its fragrance, about 1 minute. Stir in the beef and shrimp, and cook and stir until the beef is no longer pink and the shrimp have become opaque, about 3 minutes.",
        "Stir in the tomato paste and soy sauce, and mix together until well combined. Stir in the noodles, tossing them with the sauce, beef, and shrimp until they have begun to soften, about 5 minutes. Add the mustard green stems, then cook and stir until the stems have begun to soften and become translucent, about 3 more minutes.",
        "Stir the mustard green leafy parts into the dish, and then the bean sprouts. Cook and stir everything together until the mustard green leaves and bean sprouts are softened but still bright in color, about 3 more minutes. Sprinkle with salt to taste."
    ],
    "ingredients": [
        "3 bunches Chinese mustard greens (gai choy), cut into 1-inch lengths",
        "1 large onion, chopped",
        "15 garlic cloves, chopped",
        "10 fresh red chili peppers, chopped",
        "2/3 teaspoon ground fennel seed",
        "2/3 teaspoon ground cumin seed",
        "2/3 teaspoon ground coriander seed",
        "2 teaspoons vegetable oil",
        "1/2 pound boneless beef round steak, cut in thin slices",
        "1/2 pound uncooked medium shrimp, peeled and deveined",
        "1 tablespoon tomato paste",
        "1 tablespoon black soy sauce (siew dam)",
        "2 pounds fresh Chinese yellow noodles",
        "4 cups fresh bean sprouts",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Spicy Noodles Singapore Style",
    "url": "http://allrecipes.com/recipe/69975/fried-spicy-noodles-singapore-style/"
}
