{
    "directions": [
        "Place rice in a large bowl and cover with water. Let soak for 20 minutes; drain.",
        "Bring a large pot of water to a boil; add 1 tablespoon oil and 1 teaspoon salt. Add rice; simmer until partially cooked through and still firm, 5 to 7 minutes. Drain.",
        "Heat 1 cup oil in a large pot over medium-high heat. Add potatoes and carrot; saute until golden, about 2 minutes. Transfer to a plate. Add chicken pieces; fry until golden brown, about 5 minutes per side.",
        "Stir minced onions, tomatoes, tomato paste, ginger, curry paste, soy sauce, garlic, turmeric, chicken bouillon, remaining 1 teaspoon salt, and black pepper into the pot. Cover and simmer until flavors combine, about 5 minutes. Stir in lime juice. Add potatoes and carrot. Cook and stir, about 1 minute. Remove from heat.",
        "Place 1/3 of the rice in the bottom of another large pan. Cover with 1/2 of the chicken mixture. Continue layering remaining rice and chicken mixture. Cover and cook over very low heat until rice is tender, about 15 minutes. Transfer rice to a large serving plate.",
        "Heat 1 tablespoon oil in a large skillet over medium-high heat. Add sliced onion; cook and stir until golden brown, about 5 minutes. Stir in raisins and soy sauce; cook for 1 minute. Scatter onion garnish over rice. Top with hard-boiled eggs, lemon slices, and green onion."
    ],
    "ingredients": [
        "3 cups basmati rice",
        "1 tablespoon vegetable oil",
        "2 teaspoons salt, divided",
        "1 cup vegetable oil",
        "2 potatoes, cubed",
        "1 large carrot, cubed",
        "1 whole chicken, cut into 8 pieces",
        "2 onions, minced",
        "2 ripe tomatoes, minced",
        "2 tablespoons tomato paste",
        "2 tablespoons crushed fresh ginger root",
        "2 tablespoons green curry paste",
        "2 tablespoons soy sauce",
        "2 cloves garlic, minced",
        "1 teaspoon ground turmeric",
        "1 cube chicken bouillon (optional)",
        "1 teaspoon ground black pepper",
        "1 tablespoon lime juice",
        "Garnish:",
        "1 tablespoon vegetable oil",
        "1 onion, sliced",
        "1/2 cup raisins",
        "1 teaspoon soy sauce",
        "3 hard-boiled eggs, peeled and quartered",
        "1 large lemon, sliced",
        "1 green onion, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Chicken Biryani (Filipino-Style)",
    "url": "http://allrecipes.com/recipe/246560/fried-chicken-biryani-filipino-style/"
}
