{
    "directions": [
        "In a bowl stir together the mayonnaise, the relish, the capers, the mustard, the lemon juice, the cayenne, the cocktail sauce, and salt and pepper to taste and chill the sauce, covered.",
        "Have ready in separate shallow dishes the flour, the eggs beaten with the salt and the cayenne, and the cornmeal. Dredge each catfish fillet half in the flour, shaking off the excess, dip it in the egg mixture, letting the excess drip off, and dredge it in the cornmeal. Transfer the fish as it is coated to a wax paper-lined baking sheet. In a kettle heat 1 inch of the oil to 375°F. on a deep-fat thermometer, in it fry the fish in batches for 2 to 4 minutes on each side, or until it is cooked through and the coating is crisp, and transfer it with a slotted spatula to paper towels to drain.",
        "On the bottom halves of the rolls layer the lettuce, the tomatoes, the bacon, the fish, the sauce, and the top halves of the rolls."
    ],
    "ingredients": [
        "3/4 cup mayonnaise",
        "3 tablespoons sweet pickle relish",
        "1 1/2 tablespoons drained bottled capers, chopped fine",
        "1 tablespoon Dijon-style mustard",
        "1 tablespoon fresh lemon juice, or to taste",
        "a pinch of cayenne",
        "1 tablespoon bottled cocktail sauce, or to taste",
        "all-purpose flour seasoned with salt and pepper for dredging the fish",
        "2 large eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon cayenne",
        "cornmeal for dredging the fish",
        "four 1/2-pound catfish fillets, halved crosswise",
        "vegetable oil for deep-frying the fish",
        "8 soft sandwich rolls, split",
        "soft-leafed lettuce for the sandwiches",
        "2 tomatoes, sliced thin",
        "16 slices of lean bacon, cooked"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Fish",
        "Pork",
        "Tomato",
        "Fry",
        "Kid-Friendly",
        "Lunch",
        "Bacon",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Fried Catfish Sandwiches with Bacon, Lettuce, and Tomato",
    "url": "http://www.epicurious.com/recipes/food/views/fried-catfish-sandwiches-with-bacon-lettuce-and-tomato-11941"
}
