{
    "directions": [
        "Butter an 8-inch-square baking pan.",
        "In a heavy saucepan bring milk just to a boil with cinnamon stick and star anise and keep at a bare simmer 15 minutes. Pour hot milk through a sieve into a large glass measuring cup or heatproof pitcher.",
        "In a bowl with an electric mixer beat together 3 eggs, cornstarch, 2/3 cup sugar, and salt and add hot milk in a stream, beating until smooth. Return custard to saucepan and bring to a boil, whisking constantly. (Custard may look curdled as it begins to thicken but will become smooth as it is boiled and whisked.) Boil custard, whisking vigorously, 1 minute and remove saucepan from heat. (Custard will be very thick and smooth.)",
        "Immediately pour custard into prepared baking pan, smoothing top, and chill, surface covered with plastic wrap, until firm, about 1 1/2 hours. Cut custard into 2-inch squares.",
        "In a small bowl whisk together bread crumbs, remaining 1/4 cup sugar, and ground cinnamon. In another small bowl lightly whisk remaining 2 eggs.",
        "Have ready flour in a bowl and a tray lined with wax paper. Working with 1 custard square at a time, coat square with flour, shaking off excess, and then with egg, letting excess drip off. Coat square with bread crumb mixture, transferring as coated to tray. Chill squares, uncovered 30 minutes.",
        "In a saucepan combine water, sugar, 1/2 cup rum, and star anise and simmer, uncovered, 15 minutes. Stir in remaining tablespoon rum and lime juice and pour mixture through a sieve into a glass measuring cup or heatproof pitcher.",
        "Preheat oven to 325°F. and set a rack in a shallow baking pan.",
        "In a heavy 12- to 14-inch skillet heat 1 1/2 inches oil over moderately high heat until it registers 375°F. on a deep-fat thermometer and fry squares in 3 batches until golden, about 15 seconds on each side. Carefully transfer squares as fried with a slotted spatula to rack to drain and keep warm in oven.",
        "Onto each of 8 dessert plates pour 2 tablespoons sauce. Halve 12 custard squares diagonally and arrange 3 triangles on each plate. Garnish dessert with star fruit and star anise."
    ],
    "ingredients": [
        "2 1/2 cups milk",
        "a cinnamon stick",
        "1/4 cup star anise*",
        "5 large eggs",
        "6 tablespoons cornstarch",
        "2/3 cup plus 1/4 cup sugar",
        "1/2 teaspoon salt",
        "1 cup fine dry bread crumbs",
        "1 1/2 teaspoons ground cinnamon",
        "1 cup all-purpose flour",
        "1 1/2 cups water",
        "1 cup firmly packed light brown sugar",
        "1/2 cup plus 1 tablespoon dark rum",
        "1/4 cup star anise*",
        "fresh lime juice to taste",
        "vegetable oil for deep frying",
        "2 star fruit (also known as carambola )**, sliced thin, and 8 star anise*",
        "*available at some supermarkets",
        "**available seasonally at specialty produce markets and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Mixer",
        "Egg",
        "Dessert",
        "Fry",
        "Chill",
        "Anise",
        "Cinnamon",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fried Custard Squares with Rum Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/fried-custard-squares-with-rum-sauce-10007"
}
