{
    "directions": [
        "Pour the water into a large stock pot and stir in the salt, red pepper flakes, and chicken bouillon granules. Bring the mixture to a boil.",
        "Cook the chicken wings to the boiling water until no longer pink inside and the juices run clear, about 10 minutes.",
        "Drain the wings and set aside to cool until easy to handle, about 15 minutes.",
        "Whisk the flour, masa harina, paprika, 1 tablespoon of garlic powder, cayenne pepper, salt, and black pepper in a large bowl. Press chicken wings into the seasoned flour until lightly coated; tap off excess flour.",
        "Heat canola oil and lard in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Working in batches of about 6 wings at a time, deep-fry the wings until deep golden brown, 10 to 15 minutes. Set the wings aside to drain on paper towels.",
        "Melt the butter in a large saucepan over low heat, and whisk in the hot pepper sauce, molasses, Worcestershire sauce, and 1 teaspoon of garlic powder. Remove sauce from the heat.",
        "To serve, stir the wings into the sauce, working in batches, until coated. Transfer wings to a serving dish to serve."
    ],
    "ingredients": [
        "1 gallon water",
        "salt",
        "2 tablespoons crushed red pepper flakes",
        "2 tablespoons chicken bouillon granules",
        "2 pounds chicken wings, cut apart at joints, wing tips discarded",
        "3/4 cup all-purpose flour",
        "1/2 cup masa harina flour (Mexican corn masa mix)",
        "1 tablespoon paprika",
        "1 tablespoon garlic powder",
        "3 tablespoons ground cayenne pepper",
        "salt and ground black pepper to taste",
        "2 cups canola oil for frying",
        "2 cups lard for frying",
        "1/2 cup butter",
        "1/2 cup hot pepper sauce",
        "1/3 cup molasses",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon garlic powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fried Buffalo Wings with Spicy, Sweet, and Umami Sauce",
    "url": "http://allrecipes.com/recipe/219883/fried-buffalo-wings-with-spicy-sweet/"
}
