{
    "directions": [
        "Pour 4 cups water, the salt, and the olive oil into the saucepan, and gradually whisk in the chickpea flour until smooth. Set over medium heat, and whisk constantly as the batter slowly heats. It will thicken and eventually steam but does not need to boil. Cook and keep whisking, scraping the bottom and sides of the pan frequently, until the mixture is quite stiff and starts to pull away from the sides as you stir it, 15 to 20 minutes.",
        "Turn the batter into the oiled pan, and spread it quickly with the spatula, before it cools and sets, so it fills the pan in an even layer. Wet the spatula with water, and smooth the top of the batter. Let cool for an hour or longer, until completely firm.",
        "Cut pieces with a sharp knife, in whatever size or shape you like and in the amount you need. I cut 1 1/2-inch squares for appetizers and Sicilian-style sandwiches; 2-by-3-inch bars—at least two per person—to accompany a main course. Lift the cut pieces from the pan with a spatula (seal the remainder with plastic wrap and refrigerate for longer keeping).",
        "To fry the panelle, pour enough extra-virgin olive oil into the heavy skillet to cover the bottom with 1/8 inch of oil, and set over medium heat. When the oil is hot, lay in the panelle, leaving plenty of space between them. Fry about 3 minutes, until the underside is crisp and golden, then flip them over and brown the second side, about 2 minutes more. Set the panelle on paper towels to drain and cool for a minute, but serve while they are still warm (though they taste good at room temperature too!)."
    ],
    "ingredients": [
        "4 cups water",
        "1 teaspoon coarse sea salt or kosher salt",
        "1/2 cup extra-virgin olive oil, plus more for the baking sheet and for frying",
        "1/2 pound chickpea (garbanzo) flour",
        "A heavy-bottomed 3-quart saucepan or deep sauté pan, about 10-inch diameter; a stiff wire whisk; a rimmed baking sheet, 9 by 13 inches (a quarter-sheet), or a shallow baking pan of the same size, bottom and sides lightly brushed with olive oil; a stiff metal spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Fry",
        "Easter",
        "Vegetarian",
        "Chickpea",
        "Spring",
        "Healthy",
        "Vegan",
        "Simmer",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Fried Chickpea Polenta (_Panelle_)",
    "url": "http://www.epicurious.com/recipes/food/views/fried-chickpea-polenta-em-panelle-em-241707"
}
