{
    "directions": [
        "Combine buttermilk, hot sauce, and 2 tsp. salt in a large, shallow bowl. Add chicken, cover, and chill 2 hours.",
        "Meanwhile, combine mayonnaise and herbs in a small bowl; cover and chill until ready to use.",
        "Place cornstarch in a shallow baking dish. Combine flour, paprika, cayenne, garlic powder, black pepper, and 1 1/2 tsp. salt in another shallow baking dish. Lightly beat eggs in a shallow bowl. Remove chicken from buttermilk mixture and dredge in cornstarch, shaking off excess. Dip in egg mixture, letting excess drip back into bowl, then coat in flour mixture, shaking off excess. Repeat for a second coating. Place chicken on a lightly floured sheet tray; chill at least 15 minutes or up to 1 hour.",
        "Whisk buttermilk, mayonnaise, vinegar, pepper, honey, and 1 tsp. salt in a medium bowl. Add cabbage and carrot and toss to combine.",
        "Pour oil into a heavy-duty pot to a depth of 3/4\" and fit pot with deep-fry thermometer. Heat oil over medium-high until thermometer registers 350°F. Reduce heat to medium, then fry chicken pieces, two at a time and turning occasionally, until crispy and golden and the internal temperature registers 165°F on an instant-read thermometer, about 3 minutes. Transfer to a wire rack set inside a rimmed baking sheet; season with salt.",
        "Spread rolls on cut sides with butter. Heat a large skillet over medium. Working in batches, cook rolls, buttered side down, until browned and crisp, about 1 minute.",
        "Spread one side of bun with herbed mayonnaise. Build each sandwich with chicken, pickles, 1/4 cup slaw, and remaining bun. Serve remaining slaw alongside."
    ],
    "ingredients": [
        "1 cup buttermilk",
        "1 tablespoon hot sauce (preferably Tabasco)",
        "Kosher salt",
        "4 skinless, boneless chicken cutlets (about 1 pound)",
        "1/4 cup mayonnaise",
        "2 tablespoons mixed chopped fresh herbs (such as basil, chives, and/or tarragon)",
        "1/2 cup cornstarch",
        "1 cup all-purpose flour",
        "2 teaspoons paprika",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon freshly ground black pepper",
        "3 large eggs",
        "Canola oil (for frying)",
        "4 potato rolls (preferably Martin's)",
        "2 tablespoons unsalted butter, room temperature",
        "4 sandwich slice dill pickles, cut in half crosswise",
        "1/4 cup buttermilk",
        "1/4 cup mayonnaise",
        "3 tablespoons apple cider vinegar",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon honey",
        "Kosher salt",
        "1/4 small green cabbage, thinly sliced (about 2 cups)",
        "1 medium carrot, peeled, coarsely grated",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Kid-Friendly",
        "Lunch",
        "Cabbage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crispy Chicken Sandwich with Buttermilk Slaw and Herbed Mayo",
    "url": "http://www.epicurious.com/recipes/food/views/fried-chicken-cutlet-sandwich-with-buttermilk-slaw-and-herbed-mayo-56390155"
}
