{
    "directions": [
        "Rinse and sort the beans, discarding any broken pieces. Put in an olla or large, heavy pot, add 3 quarts water, and bring to a boil over high heat. This may take from 10 minutes in an enameled cast iron Dutch oven to 30 minutes in the traditional clay pot. When the water begins to bubble, immediately lower the heat to a gentle simmer and add the onion, garlic, and lard. Cover partially and simmer, stirring occasionally, for 1 to 2 hours. If the beans are not covered by at least 1 inch of water, add hot water. Add the epazote or cilantro, stir in the salt, and continue to simmer until the beans are almost soft, maybe 2 hours more. The centers of these beans should not be al dente.",
        "Taste and add more salt if needed, then remove the pot from the heat and spoon out and discard the onion, garlic, and herb sprigs. The beans are now ready to eat, though they will have even better flavor if allowed to sit for at least a few hours-or better yet, overnight- before reheating and serving. (They should be transferred to a storage container with the broth, covered, and stored in the refrigerator, where they will keep for at least 4 days.)",
        "Serve the beans in small bowls with plenty of the soupy broth and a dollop of the salsa, if desired. These beans can also be used to prepare other bean dishes, such as Frijoles Chinos o Fritos, Frijoles Puercos, or Frijoles Charros."
    ],
    "ingredients": [
        "1 pound dried beans (2 2/3 cups large beans or 3 cups small beans)",
        "1/4 white onion",
        "1 head garlic, outer papery skin removed and halved crosswise",
        "1 tablespoon freshly rendered pork lard or canola or safflower oil",
        "3 sprigs fresh epazote, or 6 sprigs fresh cilantro (epazote is the herb of choice for black beans)",
        "1 teaspoon sea salt",
        "Salsa Negra con Chipotles (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Side",
        "Cinco de Mayo",
        "Sugar Conscious",
        "Kidney Friendly",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Frijoles de la Olla",
    "url": "http://www.epicurious.com/recipes/food/views/frijoles-de-la-olla-51123600"
}
