{
    "directions": [
        "1. Make the croutons: Preheat oven to 350 degrees. Brush both sides of bread slices with 3 tablespoons of olive oil and season with salt and pepper. Cut into 1-inch cubes and bake croutons in oven on a baking sheet, shaking pan occasionally, until golden brown, 12 to 15 minutes.",
        "2. Remove salmon skin from fillet and reserve fillet for another use. Lightly brush half tablespoon hazelnut oil on both sides of salmon skin and place on preheated grill until crispy, about 2 minutes per side. (Alternatively, you can crisp it under a broiler.) Pat salmon skin dry with paper towels, cut into three-quarter-inch dice, and set aside.",
        "3. Combine shallots, lemon juice, sherry vinegar, ginger, garlic, half cup of hazelnut oil, salt and pepper in a small saucepan and cook the dressing over moderate heat until shallots are wilted, about 3 to 4 minutes.",
        "4. In a large bowl toss the frisee, salmon skin, and croutons with warm sherry vinegar dressing. Divide among 6 plates and serve immediately."
    ],
    "ingredients": [
        "Ten 1-inch-thick slices of French or Italian bread (3 inches in diameter)",
        "3 tablespoons olive oil",
        "Salt and pepper to taste",
        "Salmon skin (from a 2-pound salmon fillet) (We advise you make this dish only if you have plans for the rest of the salmon fillet!)",
        "Half cup plus half tablespoon hazelnut oil",
        "5 shallots, sliced thin crosswise",
        "2 teaspoons lemon juice",
        "3 tablespoons sherry vinegar",
        "2 tablespoons grated fresh ginger",
        "2 garlic cloves",
        "12 cups frisee (curly endive), torn into pieces, washed thoroughly, and spun dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Ginger",
        "Side",
        "Bake",
        "Vinegar",
        "Lemon",
        "Salmon",
        "Sherry",
        "Grill",
        "Endive",
        "Shallot",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Frisee with Crisped Salmon Skin and Warm Sherry Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/frisee-with-crisped-salmon-skin-and-warm-sherry-vinaigrette-358320"
}
