{
    "directions": [
        "Preheat oven to 350°F.",
        "Spread 3 tablespoons of oil with a brush on both sides of bread and season with salt and pepper. Cut each slice into cubes and bake croutons on a baking sheet in middle of oven until golden brown, about 10 minutes.",
        "In a saucepan boil salt pork in cold water to cover for 2 minutes and drain in a colander. Rinse salt pork under cold water and pat dry with paper towels. Heat remaining 1 tablespoon oil in a skillet over moderate heat and in it cook salt pork, stirring frequently, until browned. Remove salt pork with a slotted spoon and drain on paper towels.",
        "Pour 1/2 cup fat from skillet into a small bowl and whisk in shallots, white-wine vinegar, tarragon, garlic, and salt and pepper to taste until dressing is combined well.",
        "Fill a wide skillet with 2 inches water and add distilled vinegar. Bring liquid to a rolling boil over high heat and reduce heat to a bare simmer. Poach eggs, 3 at a time, by breaking each one into a saucer and sliding it into the water. As each egg goes in, push white back immediately toward yolk with a large slotted spoon, moving egg gently, and simmer 3 minutes. Drain eggs separately in slotted spoon, blot carefully with paper towels, and trim ragged edges of whites.",
        "In a large bowl toss together frisée, dressing, salt pork, and croutons. Divide salad among 6 plates and top with poached eggs."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "ten 1-inch-thick slices French or Italian bread",
        "1/2 pound salt pork, diced",
        "2 shallots, sliced thin",
        "3 tablespoons white-wine vinegar",
        "1 tablespoon chopped fresh tarragon leaves or 1 teaspoon dried, crumbled",
        "2 garlic cloves, minced",
        "2 teaspoons distilled white vinegar",
        "6 large eggs",
        "2 heads frisée* (French curly endive), torn into pieces (about 12 cups)",
        "*available at specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Leafy Green",
        "Brunch",
        "Poach",
        "Quick & Easy",
        "Winter",
        "Tarragon",
        "Shallot",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Frisée Salad with Poached Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/frisee-salad-with-poached-eggs-11621"
}
