{
    "directions": [
        "Tear frisée into bite-size pieces and put in a large bowl. If using slab bacon, cut lengthwise into 1/4-inch-thick slices. Cut bacon slices crosswise into 1/4-inch-thick sticks (lardons).",
        "In a heavy skillet cook bacon over moderate heat, stirring occasionally, until golden and remove skillet from heat.",
        "Have ready another skillet with 1 inch warm water. Half-fill a 4-quart saucepan with water and stir in white vinegar. Bring liquid to a bare simmer. Break each egg into a teacup. Slide 1 egg into simmering liquid and immediately push white around yolk with a slotted spoon, moving egg gently. (Egg will become oval, with yolk completely covered by white.) Add remaining 3 eggs in same manner. Simmer eggs about 1 1/2 minutes for runny yolks to about 3 minutes for firm yolks. (Serving this salad with runny—not fully cooked—yolks may be of concern if there is a problem with salmonella in your area.) Immediately transfer eggs to skillet of warm water.",
        "Reheat bacon in its skillet over moderate heat. Add shallot and cook, stirring, 1 minute. Add red-wine vinegar and boil 5 seconds. Immediately pour hot dressing over frisée and toss with salt and pepper to taste.",
        "Divide salad among 4 plates and top with drained poached eggs. Season eggs with salt and pepper and serve salad immediately."
    ],
    "ingredients": [
        "1/2 pound frisée (French curly endive)",
        "6 ounces slab bacon or thick-cut bacon slices",
        "2 tablespoons distilled white vinegar",
        "4 large eggs",
        "2 tablespoons chopped shallot",
        "3 tablespoons red-wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Pork",
        "Brunch",
        "Poach",
        "Quick & Easy",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Frisée Salad with Lardons and Poached Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/frisee-salad-with-lardons-and-poached-eggs-100876"
}
