{
    "directions": [
        "Preheat oven to 375°F. Place mushrooms in large bowl. Toss with 4 tablespoons oil. Scatter mushrooms on rimmed baking sheet. Sprinkle with coarse salt and pepper. Roast until tender, stirring occasionally, 25 to 30 minutes. Cool up to 2 hours.",
        "Place large bowl of cool water near stovetop. Pour additional water into large skillet to reach depth of 2 inches. Add 1 tablespoon lemon juice and generous sprinkling of coarse salt to skillet. Bring water to simmer over medium heat. Crack eggs, 1 at a time, into water (whites may spread). Simmer until whites are cooked through and yolks are still soft, occasionally spooning water over, about 3 minutes.",
        "Using slotted spoon, transfer eggs to bowl of cool water. Reserve skillet with poaching water. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Bring reserved skillet of water to simmer. Rewarm eggs 1 minute.",
        "Whisk remaining 2 tablespoons oil and 2 tablespoons lemon juice in another large bowl to blend. Season dressing to taste with coarse salt and pepper. Add frisée, radishes, and mushrooms and toss to coat. Divide salad among plates. Top each salad with poached egg and serve."
    ],
    "ingredients": [
        "1 1/2 pounds assorted wild mushrooms (such as chanterelles, morels, oyster, and crimini), thickly sliced",
        "6 tablespoons extra-virgin olive oil, divided",
        "Coarse kosher salt",
        "3 tablespoons fresh lemon juice, divided",
        "6 large eggs",
        "2 small heads of frisée (about 9 ounces), torn into small clumps",
        "2 bunches French breakfast radishes or other small radishes, trimmed, thinly sliced on diagonal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Mushroom",
        "Appetizer",
        "Poach",
        "Sauté",
        "Passover",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Radish",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Frisée and Wild Mushroom Salad with Poached Egg",
    "url": "http://www.epicurious.com/recipes/food/views/frisee-and-wild-mushroom-salad-with-poached-egg-358236"
}
