{
    "directions": [
        "Preheat oven to 325°F. Spray 8 x 8 x 2-inch glass baking dish with nonstick spray. Bring large pot of salted water to boil. Add Swiss chard and cook just until wilted, about 2 minutes. Drain. Finely chop chard, then place in kitchen towel and squeeze dry. Set chard aside.",
        "Heat oil in large nonstick skillet over medium-high heat. Add onion to skillet and sauté until soft, 4 to 5 minutes. Add sausage and sauté until brown and cooked through, breaking up with fork, 5 to 7 minutes. Remove from heat and cool.",
        "Whisk eggs, cream, salt, and pepper in large bowl to blend. Add chard and cooled sausage mixture, then feta; stir to blend. Transfer mixture to prepared baking dish.",
        "Bake frittata until set in center, 45 to 55 minutes. Transfer baking dish to rack and cool frittata 15 to 20 minutes. Place platter atop dish with frittata. Using oven mitts, hold baking dish and platter firmly together and invert frittata onto platter; place another platter atop frittata and invert again so that frittata is right side up. Cut frittata into 20 pieces. DO AHEAD: Can be made 1 day ahead. Place frittata pieces on rimmed baking sheet. Cover and chill. Rewarm in 325°F oven until heated through, about 10 minutes.",
        "Transfer frittata pieces to platter. Garnish each piece with parsley; serve warm or at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 12-ounce bunch Swiss chard, stems and center ribs removed",
        "1 tablespoon olive oil",
        "1 cup chopped onion",
        "8 ounces mild Italian sausages, casings removed, sausage broken into 1-inch pieces",
        "8 large eggs",
        "1/4 cup heavy whipping cream",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 cup crumbled feta cheese (about 4 1/2 ounces)",
        "Fresh Italian parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg Nog",
        "Egg",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Bake",
        "Sauté",
        "Cocktail Party",
        "Low Cal",
        "Feta",
        "Sausage",
        "Chard",
        "Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Frittata Bites with Chard, Sausage, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/frittata-bites-with-chard-sausage-and-feta-359351"
}
