{
    "directions": [
        "Preheat the oven to 450 degrees F.",
        "Drizzle olive oil over the mushrooms and asparagus on a baking sheet, sprinkle with salt and pepper and roast until a nice color is achieved, about 12 minutes. Set aside.",
        "Beat together the eggs with some salt and pepper in a bowl. (Do not over-beat; just mix until the eggs mostly come together.) Stir in the Monterey Jack, Parmesan and hot sauce and set aside.",
        "In a large ovenproof nonstick skillet, melt the butter over medium-high heat. Add the onions and cook, stirring frequently, until soft and golden brown, several minutes. Add the diced potatoes, sprinkle with salt and pepper and stir to cook for a couple of minutes. Finally, add the asparagus, mushrooms, olives and roasted red peppers and cook, stirring, until everything is hot.",
        "Make sure all the ingredients are evenly distributed across the bottom of the skillet, then pour in the egg mixture so that it evenly coats everything. Let it sit on the burner for 30 to 45 seconds to set the edges, then put the skillet in the oven. Cook, watching it carefully, until the eggs are set but not very brown on top, 10 to 12 minutes.",
        "Slide the frittata out of the skillet and onto a cutting board. Sprinkle on the basil and slice into wedges with a long serrated knife."
    ],
    "ingredients": [
        "Olive oil, for drizzling",
        "8 mushrooms, quartered",
        "6 spears asparagus, chopped",
        "Salt and freshly ground black pepper",
        "12 large eggs",
        "1/2 cup grated Monterey Jack",
        "1/4 cup grated Parmesan",
        "2 dashes hot sauce",
        "2 tablespoons butter",
        "1 medium onion, halved and sliced thin",
        "1 cold baked potato, diced",
        "1/4 cup chopped green olives with pimentos",
        "2 jarred roasted red peppers, sliced thin",
        "8 fresh basil leaves, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Frittata",
        "Egg Recipes",
        "Vegetable",
        "Cheese",
        "Appetizer"
    ],
    "title": "Frittata",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/frittata"
}
