{
    "directions": [
        "In the bowl of a food processor, combine the flour, butter, and shortening. Pulse until the mixture resembles coarse meal with some small (roughly pea-size) lumps of butter. Transfer to a large bowl.",
        "In a small bowl, stir together the sugar, salt, and 4 tablespoons ice water. Using a fork, gradually stir the ice-water mixture into the flour mixture—the dough will be in rough, rather stiff clumps. If there is unincorporated flour in the bottom of the bowl, drizzle in more ice water, 1/2 tablespoon at a time, and use the fork to gently incorporate it. Do not overwork the dough, or the pastry will be tough. Turn the dough out onto a lightly floured work surface, gather into a ball, and flatten into a roughly 1-inch-thin disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: The dough can be made ahead and stored, wrapped in plastic in the refrigerator, up to 2 days or frozen, up to 1 week; defrost in the refrigerator before proceeding.",
        "On a lightly floured surface, roll the dough into a 12-inch round then transfer to a 9-inch deep-dish pie plate. Trim the edge, leaving a 1/2-inch overhang, then fold the overhang under and crimp the edge decoratively. Using a fork, prick the bottom and sides of the pie shell all over then chill for 30 minutes. DO AHEAD: The pie shell can be assembled to this point and stored, wrapped in plastic in the refrigerator, up to 2 days, or frozen, up to 1 week; defrost in the refrigerator before continuing.",
        "Arrange a rack in the middle of the oven and preheat to 400°F.",
        "Lightly butter a 15-inch round of foil and lay it, butter-side-down, inside the chilled pie shell then gently press to line the shell snugly. Fill the pie shell with pie weights or dried beans and bake until the pastry is set and pale golden along the edge, about 15 minutes. Reduce the oven temperature to 350°F. Carefully remove the weights or beans and the foil and bake the shell until pale golden all over, 8 to 10 minutes more. Brush the entire pastry surface with the lightly beaten egg yolk, and cool completely.",
        "Arrange a rack in the lower third of the oven and preheat to 350°F.",
        "In a large bowl, combine the pecans, chocolate, and flour, and toss to combine.",
        "In the bowl of a stand mixer fitted with the paddle attachment, combine the butter and brown sugar and beat on medium speed until light and fluffy, about 5 minutes. Add the eggs, 1 at a time, beating well after each addition and scraping down the sides of the bowl as necessary. Add the corn syrup, molasses, coffee-flavored liqueur, vanilla, and salt and beat until incorporated (if the mixture appears to be separating or isn't combining, swap the paddle attachment for the whisk attachment and whisk until incorporated). Pour over the chocolate-pecan mixture and stir well to combine. Pour the mixture into the cooled pie shell and bake until a knife inserted into the center comes out clean, about 1 hour. Transfer to a wire rack to cool completely. DO AHEAD: The pie can be baked, cooled, and stored, wrapped in a double-layer of plastic and refrigerated, up to 3 days.",
        "In the bowl of a stand mixer fitted with the whisk attachment or a large mixing bowl with a handheld mixer, whip the cream, sugar, and coffee-flavored liqueur until the cream holds soft peaks.",
        "Just before serving, cut slices into the pie then warm the whole pie in a 325°F oven until just heated through, about 8 minutes. Serve slices topped with dollops of coffee whipped cream."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "6 tablespoons (3/4 stick) unsalted butter, chilled and cut into 1/2-inch pieces",
        "3 tablespoons vegetable shortening, chilled and cut into 1/2-inch pieces",
        "3/4 teaspoon sugar",
        "1/4 teaspoon kosher salt",
        "1 large egg yolk, lightly beaten",
        "4 1/2 ounces (about 1 1/2 cups) pecan halves, toasted",
        "4 1/2 ounces semisweet or bittersweet chocolate, coarsely chopped",
        "2 tablespoons all-purpose flour",
        "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, room temperature",
        "3/4 cup packed dark brown sugar",
        "4 large eggs, room temperature",
        "1/2 cup light corn syrup",
        "3 tablespoons dark molasses",
        "1 tablespoon coffee-flavored liqueur, such as Kahlúa",
        "2 teaspoons pure vanilla extract",
        "1/4 teaspoon kosher salt",
        "1 cup heavy cream",
        "3 to 4 tablespoons confectioners' sugar",
        "2 teaspoons coffee-flavored liqueur, such as Kahlúa",
        "Special equipment: Food processor, 9-inch deep-dish pie plate, pie weights or dried beans, pastry brush, stand mixer with whisk and paddle attachments."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Chocolate",
        "Nut",
        "Bake",
        "Cinco de Mayo",
        "Tree Nut",
        "Pecan"
    ],
    "title": "Frontera Grill's Chocolate Pecan Pie with Coffee Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/frontera-grills-chocolate-pecan-pie-with-coffee-whipped-cream-395110"
}
