{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an angel food tube pan. In a bowl, whisk together the flour, baking powder, and salt.",
        "In a separate large bowl, beat 2 cups of sugar with the butter and almond extract using an electric mixer on low speed until creamy; beat in the eggs on high speed for 3 minutes, scraping down the side of the bowl a few times. Beat in the flour mixture alternating with about 1/3 cup of milk at a time, and beat until smooth and creamy, 1 to 2 minutes. Pour the batter into the prepared cake pan.",
        "Bake in the preheated oven until the cake is golden brown and set, about 1 hour and 15 minutes. A toothpick inserted into the center of the cake should come out clean. Allow to cool completely.",
        "While cake is cooling, place 1 pint of strawberries and 1 cup of sugar in a saucepan over medium heat, stirring constantly, until the strawberries soften and give up their juice, 5 to 8 minutes. Mix the cornstarch and water in a small bowl, and stir the slurry into the strawberries; bring the filling to a boil, reduce heat to a simmer, and cook, stirring constantly, until thickened, about 2 minutes. Set the filling aside and allow to cool for 5 minutes.",
        "Remove cake from pan, and cut in half horizontally. Place the bottom half of the cake on a serving platter, and spread the slightly warm strawberry filling over the cake. Place the top half of the cake on top of the filling. Chill the cake in the refrigerator until the filling has set, about 1 hour.",
        "Beat the whipped cream in a chilled metal bowl with an electric mixer set on high speed, adding 1/4 cup of sugar gradually, until the cream forms stiff peaks. Spread the whipped cream over the top, sides, and into center hole of the cake; top with halved strawberries for garnish."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 cups white sugar",
        "1 cup butter, softened",
        "1 teaspoon almond extract",
        "5 eggs",
        "1 cup milk",
        "1 pint strawberries, hulled and sliced",
        "1 cup white sugar",
        "1/4 cup cornstarch",
        "1 tablespoon water",
        "1 cup chilled heavy cream",
        "1/4 cup white sugar",
        "4 strawberries, halved for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frosted Strawberry Shortcake",
    "url": "http://allrecipes.com/recipe/218002/frosted-strawberry-shortcake/"
}
