{
    "directions": [
        "Preheat oven to 250°F. Line 2 buttered baking sheets with foil or parchment paper and trace three 13- by 4-inch rectangles on foil or paper (2 on one sheet and 1 on other).",
        "In a food processor grind almonds fine with 1/2 cup sugar and cornstarch. In a large bowl with an electric mixer beat egg whites with cream of tartar and salt until they hold soft peaks. Beat in remaining 3/4 cup sugar in a slow stream, beating until meringue holds stiff, glossy peaks. Fold in almond mixture gently but thoroughly and transfer to a pastry bag fitted with a 1/2-inch plain tip. Starting along the inside edge of a rectangle, pipe meringue onto prepared foil, filling in rectangles.",
        "Bake meringue layers in upper and lower thirds of oven, switching position of sheets in oven halfway through baking, 1 to 1 1/4 hours, or until meringues are firm and dry when touched. Cool meringues on sheets on racks. Slide foil off sheets and carefully peel meringues off foil. Meringue layers may be made 1 day ahead and kept, tightly wrapped, at room temperature.",
        "Cut a piece of cardboard 2 inches bigger than meringue layers and wrap in foil.",
        "In a large bowl with an electric mixer beat together filling ingredients until mixture just holds stiff peaks.",
        "Put 1 meringue layer, smooth side down, on cardboard and with a long metal spatula spread a 1/2-inch-thick layer of filling over top. Repeat layering in same manner with another meringue and some filling and top filling with remaining meringue layer, smooth side up. Spread a thin layer of filling on top and sides of dacquoise and transfer remaining filling to a pastry bag fitted with a star tip. Pipe remaining filling decoratively around dacquoise and arrange raspberries on dacquoise. Freeze dacquoise, uncovered, until hard, about 6 hours. Dacquoise may be made 2 days ahead and frozen, wrapped in plastic wrap and foil after 6 hours.",
        "Let dacquoise stand in refrigerator 30 minutes before serving. Slicing dacquoise with an electric knife (alternatively, use a serrated knife)."
    ],
    "ingredients": [
        "1 cup shelled natural almonds (about 5 ounces), toasted lightly and cooled",
        "1 1/4 cups sugar",
        "2 1/2 teaspoons cornstarch",
        "5 large egg whites",
        "1/4 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "4 1/2 cups well-chilled heavy cream",
        "1/3 cup instant espresso powder",
        "6 tablespoons sugar",
        "2 tablespoons Kahlúa or other coffee-flavored liqueur",
        "1/2 pint raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Raspberry",
        "Almond",
        "Kahlúa",
        "Chill",
        "Gourmet"
    ],
    "title": "Frozen Almond Cappuccino Dacquoise",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-almond-cappuccino-dacquoise-10143"
}
