{
    "directions": [
        "Preheat oven to 350°F.",
        "Toss together all crust ingredients with a fork until crumbs are moistened. Press evenly onto bottom and up side of a 10-inch glass or ceramic pie plate (6-cup capacity). Bake crust in middle of oven 7 minutes, then cool on a rack.",
        "Bring cream, milk, sugar, zest, and salt to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved. Whisk yolks in a bowl until blended, then add hot cream mixture in a slow stream, whisking. Transfer custard back to saucepan and cook over moderately low heat, stirring constantly with a wooden spoon, until thick enough to coat back of spoon and registers 175 to 180°F on thermometer, 3 to 5 minutes (do not let boil).",
        "Immediately pour through a fine-mesh sieve into cleaned bowl, then stir in lemon juice. Cool custard to room temperature, stirring occasionally, then chill, its surface covered with a round of wax paper, until cold, about 3 hours. Freeze custard in ice cream maker.",
        "Spread ice cream evenly in crust and wrap pie plate in wax or parchment paper, then in plastic wrap. Freeze until firm, at least 2 hours.",
        "About 20 minutes before serving, put pie in refrigerator to soften."
    ],
    "ingredients": [
        "1 1/2 cups finely crushed gingersnap cookies (6 ounces)",
        "5 tablespoons unsalted butter, melted",
        "2 tablespoons sugar",
        "1 1/2 cups heavy cream",
        "1 cup whole milk",
        "3/4 cup plus 2 tablespoons sugar",
        "4 teaspoons finely grated fresh lemon zest",
        "1/8 teaspoon salt",
        "6 large egg yolks",
        "2/3 cup fresh lemon juice",
        "Special equipment: an instant-read thermometer; an ice cream maker",
        "Garnish: lemon slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Lemon",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Lemon Gingersnap Pie",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-lemon-gingersnap-pie-108189"
}
