{
    "directions": [
        "Tear off 2 (3-inch-wide) strips of foil and wrap each tightly around outside of a ramekin, forming a collar that extends at least 1 inch above rim. Tape overlapping ends together.",
        "Line a baking sheet with a sheet of foil, then lightly oil foil. Cook sugar with a pinch of salt in a dry 8- to 9-inch nonstick skillet over moderate heat, without stirring, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel. Immediately remove from heat and stir in nuts with a wooden spoon, then quickly pour onto baking sheet, spreading with back of spoon before praline hardens.",
        "Cool praline on baking sheet 5 minutes, then break into large pieces. Put pieces in a sealable plastic bag, then seal bag, pressing out excess air. Break praline into smaller pieces by lightly pounding and rolling with a rolling pin. Measure out 1/3 cup (serve remainder on the side).",
        "Bring sugar and water to a boil in a 1 1/2-quart heavy saucepan over moderate heat, stirring until sugar is dissolved, then wash down crystals from side of pan with a pastry brush dipped in cold water. Boil syrup, without stirring, until thermometer registers 238 to 242°F (soft-ball stage), 3 to 5 minutes.",
        "While syrup boils, beat egg whites with a pinch of salt in a bowl using an electric mixer at medium speed until foamy. Increase speed to high, then add hot syrup in a slow stream (avoid beaters and side of bowl), beating constantly, and continue to beat until meringue holds stiff glossy peaks and is cooled to room temperature, about 5 minutes. Fold praline into meringue.",
        "Whisk cream with Cognac in another bowl until it holds soft peaks, then fold into meringue gently but thoroughly. Spoon mixture into ramekins and freeze, loosely covered with plastic wrap, until firm, 2 to 3 hours. Remove foil collars before serving."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "1/3 cup sliced almonds or whole hazelnuts (1 1/2 oz), toasted and, if using hazelnuts, any loose skins rubbed off with a kitchen towel and nuts chopped",
        "1/4 cup sugar",
        "2 tablespoons water",
        "2 large egg whites at room temperature for 30 minutes",
        "1/2 cup chilled heavy cream",
        "2 tablespoons Cognac or Armagnac",
        "Special equipment: 2 (4-oz) ramekins; a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Valentine's Day",
        "Quick & Easy",
        "Frozen Dessert",
        "Cognac/Armagnac",
        "Winter",
        "Hazelnut",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Praline Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-praline-souffles-109048"
}
