{
    "directions": [
        "Preheat oven to 275°F.",
        "Draw 3 (14- by 3-inch) rectangles, about 3/4 inch apart, on parchment. Turn paper over (rectangles will be visible) and put it on a lightly buttered large baking sheet.",
        "Beat whites with a pinch of salt in a large bowl with an electric mixer at medium speed until they hold soft peaks. Beat in sugar, 1 tablespoon at a time, then increase speed to high and continue beating until whites hold stiff glossy peaks, about 4 minutes with a standing mixer or 8 to 10 minutes with a handheld. Transfer meringue to pastry bag fitted with 1/3-inch tip and fill in rectangles completely. Gently smooth tops, then bake in middle of oven until firm and very pale golden, 45 to 60 minutes. Slide meringue layers (on parchment) onto a large rack. Cool completely, then carefully peel off parchment.",
        "Melt butter with cornstarch, passion-fruit pulp, and 3/4 cup sugar in a 2-quart heavy saucepan over moderately low heat, stirring until sugar is dissolved.",
        "Whisk together whole egg and yolks in a large bowl until combined, then add butter mixture in a stream, whisking. Transfer mixture to saucepan and cook over moderately low heat, whisking constantly, until thick enough to hold mark of whisk and first bubble appears on surface, 3 to 5 minutes. Transfer curd immediately to a metal bowl set in a larger bowl of ice and cold water and cool, stirring occasionally, until cold.",
        "Beat cream with remaining 2 tablespoons sugar with electric mixer until it just holds stiff peaks. Fold 2 cups whipped cream into curd gently but thoroughly to form a mousse (for filling and icing).",
        "Transfer 3/4 cup whipped cream to a small bowl and reserve, chilled, for cream layer. Fold 1/2 cup mousse into remaining whipped cream, then transfer to cleaned pastry bag fitted with 1/8-inch tip and reserve, chilled, for decorative icing.",
        "Arrange 1 meringue layer, flat side down, on platter and spread evenly with 3/4 cup mousse. Cover with another meringue layer and spread evenly with reserved whipped cream. Cover with remaining meringue layer, flat side up, and spread remaining mousse evenly over top and sides of cake, smoothing with a cake spatula. Pipe icing decoratively on top of cake, then freeze, uncovered, until firm, at least 3 hours.",
        "About 1 hour before serving, put cake in refrigerator to soften slightly."
    ],
    "ingredients": [
        "4 large egg whites at room temperature for 30 minutes",
        "1 cup sugar",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "1/2 teaspoon cornstarch",
        "3/4 cup thawed frozen passion-fruit pulp*",
        "3/4 cup plus 2 tablespoons sugar",
        "1 whole large egg",
        "6 large egg yolks",
        "1 1/2 cups chilled heavy cream",
        "Special equipment: a 15- by 12-inch sheet of parchment paper; a pastry bag with a 1/3-inch plain tip and an 1/8-inch plain tip; a long thin platter or a foil-wrapped cardboard rectangle (at least 15 by 4 inches)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Easter",
        "Kid-Friendly",
        "Wedding",
        "Spring",
        "Passion Fruit",
        "Gourmet"
    ],
    "title": "Frozen Passion Fruit Meringue Cake",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-passion-fruit-meringue-cake-108002"
}
