{
    "directions": [
        "Bring cream, milk, sugar, and salt to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved. Whisk eggs in a bowl until blended, then add hot cream mixture in a slow stream, whisking. Transfer custard back to saucepan and cook over moderately low heat, stirring constantly with a wooden spoon, until thick enough to coat back of spoon and registers 175 to 180°F on thermometer (do not let boil).",
        "Immediately pour through a fine-mesh sieve into cleaned bowl, then stir in liqueur. Cool custard to room temperature, stirring occasionally, then chill, its surface covered with a round of wax paper, until cold, about 3 hours.",
        "Preheat oven to 350°F. Line bottom of square baking pan with wax or parchment paper.",
        "Melt chocolate with water in a small heavy saucepan over very low heat, stirring, then cool to lukewarm.",
        "Beat yolks, 1/3 cup sugar, and salt in a large bowl with an electric mixer at high speed until thick and pale, about 5 minutes in a standing mixer or about 8 minutes with a handheld. Fold in melted chocolate.",
        "Beat egg whites with cleaned beaters until they hold soft peaks. Beat in remaining 1/3 cup sugar 1 tablespoon at a time and continue to beat until whites just hold stiff peaks, about 5 minutes. Fold one third of whites into chocolate mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Spread batter evenly in baking pan and bake in middle of oven until puffed and a wooden pick or skewer inserted in center comes out with crumbs adhering, 30 to 35 minutes. Transfer pan to a rack, then cover top of cake with 2 layers of dampened paper towels and let stand 5 minutes. Remove towels and cool cake completely in pan (cake will deflate as it cools). Sift 1 1/2 tablespoons cocoa over cake, then loosen edges with a sharp knife. Invert a wax-paper-lined baking sheet over cake and invert cake onto it, then gently peel off wax paper now on top.",
        "Freeze custard in ice cream maker. Transfer ice cream to an airtight container and freeze until firm but still spreadable, about 30 minutes.",
        "Oil milk carton, then line bottom and long sides with a sheet of plastic wrap, leaving at least a 2-inch overhang.",
        "Trim cake to form a 7 1/2- by 6 1/4-inch rectangle (reserve trimmings for another use), then cut rectangle lengthwise into 5 (7 1/2- by 1 1/4-inch) strips. Using thin metal spatula, arrange 2 strips on bottom of carton, flush against each long side. Fill space between strips with ice cream (preferably using a small offset metal spatula). Arrange 1 cake strip down center of carton (on top of ice cream) and fill spaces on both sides of cake with ice cream. Arrange remaining 2 cake strips against long sides of carton (on top of ice cream) and fill space between them with ice cream. (There will be some leftover ice cream.) If ice cream becomes too soft during assembly, freeze until just firm enough to work with, about 15 minutes. Cover top with plastic wrap overhang, then freeze until dessert is hardened, at least 8 hours.",
        "To serve, unwrap overhang and invert carton onto a chilled platter, using plastic wrap to help pull cake from carton. Trim sides evenly to neaten loaf if necessary (ice cream may ooze a bit on sides), then sift remaining 1 1/2 tablespoons cocoa over top. Cut into slices with a sharp knife."
    ],
    "ingredients": [
        "1 1/2 cups heavy cream",
        "1 cup milk",
        "2/3 cup sugar",
        "1/8 teaspoon salt",
        "3 large eggs",
        "1/3 cup green crème de menthe",
        "7 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1/4 cup water",
        "6 large eggs, separated and at room temperature for 30 minutes",
        "2/3 cup sugar",
        "1/4 teaspoon salt",
        "3 tablespoons unsweetened Dutch-process cocoa powder",
        "Special equipment: an instant-read thermometer; a 9- by 9- by 2-inch baking pan; an ice cream maker; a 1/2-gallon cardboard milk or juice carton; a long thin metal spatula",
        "9- by 9- by 2-inch baking pan",
        "ice cream maker",
        "1/2-gallon cardboard milk or juice carton",
        "long thin metal spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Mint",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Mint Chocolate Checkerboard",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-mint-chocolate-checkerboard-108191"
}
