{
    "directions": [
        "Line 9 x 5 x 2 3/4-inch metal loaf pan with plastic wrap, leaving overhang. Pour 1 tablespoon cold water into small bowl. Sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Stir white chocolate in top of double boiler set over simmering water (do not allow bottom of pan to touch water) until melted. Remove chocolate from over water.",
        "Whisk egg yolks, 2 tablespoons honey, Grand Marnier and 3 tablespoons water in large metal bowl to blend. Set over saucepan of gently boiling water (do not allow bottom of bowl to touch water) and whisk until mixture thickens and thermometer registers 160°F, about 3 minutes. Remove bowl from over water; add gelatin mixture and whisk until dissolved.",
        "Stir remaining 1 tablespoon water and 4 tablespoons honey in small pan over low heat until honey dissolves. Increase heat and boil until candy thermometer reaches 220°F, tilting pan to submerge thermometer bulb, about 2 minutes.",
        "Meanwhile, using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually beat hot honey syrup into whites. Continue beating until whites are cool and very stiff, about 4 minutes. Fold white chocolate into yolk mixture; then fold whites into yolk mixture in 3 additions. Beat cream and vanilla in medium bowl until medium-firm peaks form. Fold cream and nuts into mousse. Transfer mixture to prepared pan; smooth top. Cover with plastic; freeze overnight. (Can be made 1 week ahead. Keep frozen.)",
        "Freeze oval platter 15 minutes. Uncover terrine. Place platter on pan. Invert terrine onto platter; peel off plastic. Spoon chocolate sauce onto center of plates. Slice terrine; place atop sauce. Spoon Raspberry-Fig Sauce over center of terrine slices and serve immediately."
    ],
    "ingredients": [
        "5 tablespoons cold water",
        "1 teaspoon unflavored gelatin",
        "6 ounces good-quality white chocolate (such as Baker's or Lindt),  chopped",
        "5 large eggs, separated",
        "6 tablespoons honey",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "3/4 cup chilled whipping cream",
        "1 teaspoon vanilla extract",
        "3 tablespoons almonds, toasted, finely chopped",
        "3 tablespoons walnuts, toasted, finely chopped",
        "\">Bittersweet Chocolate Sauce",
        "Raspberry-Fig Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Food Processor",
        "Chocolate",
        "Egg",
        "Nut",
        "Dessert",
        "Frozen Dessert",
        "Almond",
        "Walnut",
        "Triple Sec",
        "Honey",
        "Christmas Eve",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Frozen Nougat Terrine with Bittersweet Chocolate Sauce and Raspberry-Fig Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-nougat-terrine-with-bittersweet-chocolate-sauce-and-raspberry-fig-sauce-3001"
}
