{
    "directions": [
        "Cook bacon (in 2 batches if necessary) in a 12-inch heavy skillet over medium heat, turning once, until lightly browned on edges but still flexible, 5 to 6 minutes total per batch. Transfer to paper towels to drain.",
        "Pour off fat from skillet and arrange bacon in skillet in 1 layer. Sprinkle 1/4 cup sugar and cinnamon over bacon and cook over low heat, turning occasionally with tongs, until sugar has dissolved and then caramelized (sugar melts very slowly and burns easily; reduce heat if necessary after sugar begins to caramelize) and coats bacon, 8 to 10 minutes. (Bacon will be dark and look lacquered.) Transfer bacon with tongs to a cutting board to cool. When bacon is cool, finely chop 5 slices, leaving remaining 2 slices whole.",
        "Stir together wafer crumbs and butter, then press onto bottom and up side of pie plate. Chill pie shell.",
        "Heat remaining 1/2 cup sugar and milk in a small heavy saucepan over medium heat, stirring until sugar has dissolved. Remove from heat and whisk in peanut butter and vanilla until combined well, then transfer to a bowl and cool completely in an ice bath, stirring occasionally.",
        "Beat cream with an electric mixer until it just holds stiff peaks, then fold into peanut butter mixture with peanuts and chopped bacon gently but thoroughly. Transfer filling to pie shell, smoothing top.",
        "Cut remaining 2 bacon slices into 2-inch-long pieces and arrange in a decorative starburst shape in center of pie. Freeze pie, uncovered, until frozen hard, about 5 hours. Let pie soften slightly in refrigerator before serving, about 30 minutes."
    ],
    "ingredients": [
        "7 bacon slices (about 6 ounces)",
        "3/4 cup sugar, divided",
        "1/8 teaspoon ground cinnamon",
        "About 35 chocolate wafers, finely ground in a blender or food processor (about 2 cups crumbs)",
        "3/4 stick unsalted butter, melted",
        "1 cup milk",
        "1 cup creamy peanut butter (not natural)",
        "1/2 teaspoon pure vanilla extract",
        "1 1/4 cups chilled heavy cream",
        "1/3 cup salted roasted peanuts, finely chopped",
        "a 10-inch pie plate (6-cup capacity)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Bacon",
        "Peanut",
        "Summer",
        "Party",
        "Peanut Butter",
        "Gourmet",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Frozen Peanut Butter Pie with Candied Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-peanut-butter-pie-with-candied-bacon-358135"
}
