{
    "directions": [
        "In a heavy saucepan combine the cranberries, the sugar, and the water and bring the mixture to a boil, stirring until the sugar is dissolved. Simmer the mixture, stirring occasionally, for 5 minutes, or until it is thickened, and let it cool completely.",
        "In a small heavy saucepan combine the sugar and the water and bring the mixture to a boil, stirring until the sugar is dissolved. Boil the syrup, washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water, until it registers 248°F. on a candy thermometer and remove the pan from the heat. While the syrup is boiling, in the large bowl of an electric mixer beat the egg whites with a pinch of salt until they hold soft peaks, with the motor running add the hot syrup in a stream, beating, and beat the meringue at medium speed for 8 minutes, or until it cools to room temperature.",
        "Fold the cranberry mixture into the meringue gently but thoroughly. In another bowl with cleaned beaters beat the cream until it just holds stiff peaks and fold it into the cranberry mixture gently but thoroughly. Spoon the soufflé into a 2 1/2-quart (8-inch diameter) freezer-proof glass serving bowl, smoothing the top, and freeze the soufflé, its surface covered with plastic wrap, overnight. The souffleé may be made 3 days in advance and kept covered and frozen.",
        "In a small heavy saucepan combine the corn syrup and the sugar, bring the mixture to a boil over moderate heat, stirring until the sugar is dissolved, and boil the syrup until it is a golden caramel and registers 320°F. on a candy thermometer. While the syrup is boiling, oil lightly a 12 inch-square sheet of foil and on it arrange the cranberries in a 6-inch-wide wreath shape. Remove the pan from the heat and let the syrup cool for 30 seconds. Dip a fork into the syrup and drizzle the syrup over the cranberries, repeating this procedure until the cranberries are covered with the syrup and a solid wreath is formed. (If the syrup becomes too thick to drizzle from a fork, reheat it over moderate heat until it is the right consistency.) Let the wreath cool completely. The wreath may be made 2 hours in advance (preferably not on a damp day) and kept in a cool, dry place.",
        "Pry the wreath gently from the foil, arrange it on the soufflé, and garnish it with the mint sprigs."
    ],
    "ingredients": [
        "2 1/2 cups cranberries, picked over",
        "2/3 cup sugar",
        "2/3 cup water",
        "3/4 cup sugar",
        "1/3 cup water",
        "4 large egg whites",
        "2 1/2 cups well-chilled heavy cream",
        "1/3 cup light corn syrup",
        "1/4 cup sugar",
        "1/2 cup cranberries, picked over",
        "mint sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Christmas",
        "Cranberry",
        "Winter",
        "Gourmet"
    ],
    "title": "Frozen Cranberry Soufflé with Spun Sugar Cranberry Wreath",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-cranberry-souffle-with-spun-sugar-cranberry-wreath-10938"
}
