{
    "directions": [
        "Line a 2-qt (2-l) ring mold with plastic wrap, overhanging the edges by about 3 inches (7.5 cm).",
        "In a large heatproof bowl, whisk together the egg yolks, sugar, lemon juice, corn syrup, and lemon zest until blended. Place over (not touching) simmering water in a saucepan and whisk constantly until the mixture registers 170°F (77°C) on a candy thermometer, about 10 minutes.",
        "Remove the bowl from the heat. Using an electric mixer on high speed, beat the yolk mixture until it is cool and thickened, about 6 minutes.",
        "In a chilled bowl, using the electric mixer fitted with clean, dry beaters, beat the cream on medium-high speed until stiff peaks form. Using a rubber spatula, fold the cream into the cooled yolk mixture just until no white streaks remain. Spoon the mousse mixture into the prepared mold. Cover tightly with the overhanging plastic wrap and freeze overnight or for up to 3 days.",
        "About 1 hour before serving, place a round platter in the freezer. In a large, heavy frying pan over medium heat, stir the jam just until melted. Remove the pan from the heat and add the blueberries. Toss the berries to coat them thinly with the jam. Let cool completely, about 1 hour.",
        "Uncover the mousse. Invert the chilled platter over the mold and then, holding the mold and platter firmly together with both hands, invert them. Lift off the mold and peel off the plastic wrap. Spoon enough of the blueberries into the center of the ring to fill nicely. Garnish with mint sprigs, if using, and serve. Pass the remaining berries at the table.",
        "If you are planning to serve a frozen dessert at a dinner party, consider taking the time to clean and/or defrost the freezer in advance of the event. Some foods stored in the freezer can impart off odors or flavors into newly placed foods."
    ],
    "ingredients": [
        "8 egg yolks",
        "1 cup (8 oz/250 g) sugar",
        "2/3 cup (5 fl oz/160 ml) fresh lemon juice",
        "1/4 cup (2 fl oz/60 ml) light corn syrup",
        "2 teaspoons grated lemon zest",
        "2 cups (16 fl oz/500 ml) cold heavy (double) cream",
        "1/2 cup (5 oz/155 g) seedless raspberry jam",
        "4 cups (1 lb/500 g) blueberries",
        "Fresh mint sprigs for garnish, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Frozen Dessert",
        "Blueberry",
        "Lemon",
        "Summer",
        "Candy Thermometer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Lemon Mousse with Blueberries",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-lemon-mousse-with-blueberries-363230"
}
