{
    "directions": [
        "Finely grind cookies, chips, and sugar in processor. Add melted butter; blend until wet crumbs form. Set aside 1/2 cup crumb mixture. Press remaining crumb mixture onto bottom and 2 inches up sides of 9–inch–diameter springform pan with 2 3/4–inch–high sides.",
        "Whisk first 3 ingredients in medium metal bowl. Set over saucepan of simmering water and whisk vigorously until candy thermometer registers 175°F, about 8 minutes. Remove bowl from over water. Add spices. Using mixer, beat until thick and cool, about 5 minutes.",
        "Using electric mixer, beat whipping cream, sour cream, Grand Marnier, orange juice concentrate, and grated orange peel in large bowl until peaks form. Add egg yolk mixture and fold together. Pour 2/3 of filling into crust. Sprinkle with reserved 1/2 cup crumb mixture. Gently spoon remaining filling over. Cover; freeze overnight or up to 3 days.",
        "Whisk Port and cornstarch in large skillet to blend. Add sugar, honey, and spices. Bring mixture to boil over high heat, stirring often. Add 3 cups cranberries; cook until mixture boils and cranberries begin to pop but still hold shape, about 5 minutes. Mix in remaining 2 cups cranberries. Chill topping at least 6 hours or overnight.",
        "Release pan sides from torte. Transfer torte to platter. Spoon topping over filling. If desired, garnish torte with white chocolate curls."
    ],
    "ingredients": [
        "1 9–ounce package chocolate wafer cookies",
        "1/2 cup semisweet chocolate chips",
        "3 tablespoons sugar",
        "7 tablespoons unsalted butter, melted",
        "8 large egg yolks",
        "1 cup sugar",
        "1/4 cup water",
        "1/2 teaspoon ground nutmeg",
        "1/8 teaspoon ground allspice",
        "2 cups chilled heavy whipping cream",
        "1/2 cup chilled sour cream",
        "5 tablespoons Grand Marnier or other orange liqueur",
        "3 tablespoons frozen orange juice concentrate, thawed",
        "1 tablespoon grated orange peel",
        "1/2 cup ruby Port",
        "1 tablespoon cornstarch",
        "1 cup sugar",
        "1/4 cup honey",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground allspice",
        "1/2 teaspoon ground cinnamon",
        "5 cups fresh cranberries or frozen, partially thawed, divided",
        "White chocolate curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Fruit",
        "Dessert",
        "Christmas",
        "Cranberry",
        "Winter",
        "Kidney Friendly"
    ],
    "title": "Frozen Grand Marnier Torte with Dark Chocolate Crust and Spiced Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-grand-marnier-torte-with-dark-chocolate-crust-and-spiced-cranberries-236808"
}
