{
    "directions": [
        "Melt chocolate in coffee in a metal bowl set over a large saucepan of barely simmering water, stirring until smooth, then stir in 3 tablespoons rum. Remove bowl from heat.",
        "Beat together eggs, granulated sugar, and a pinch of salt with a handheld electric mixer in a large metal bowl until combined well. Set bowl over saucepan of simmering water and beat mixture until tripled in volume, very thick, and registers 160°F on thermometer, about 6 minutes. Remove bowl from heat, then beat in chocolate mixture. Chill until cool, about 10 minutes.",
        "Beat 1 cup cream in a bowl with cleaned beaters until it just holds stiff peaks, then fold into chocolate mixture. Divide among 8 (8-ounce) stemmed glasses and freeze, covered with plastic wrap, until set, at least 3 hours.",
        "Before serving, let parfaits stand at room temperature 15 minutes to soften slightly. While parfaits are standing, beat remaining cup cream with confectioners sugar until it just holds stiff peaks, then beat in remaining 2 teaspoons rum and spoon onto parfaits."
    ],
    "ingredients": [
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "2/3 cup strong brewed coffee",
        "3 tablespoons plus 2 teaspoons dark rum",
        "3 large eggs",
        "3/4 cup granulated sugar",
        "2 cups chilled heavy cream",
        "1 1/2 tablespoons confectioners sugar",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Rum",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Spring",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Mocha Rum Parfaits",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-mocha-rum-parfaits-108129"
}
