{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease a 10x15 jelly roll pan and line the pan with parchment. Grease the parchment and dust with the cornstarch.",
        "Beat the 6 egg whites until foamy in a large glass or metal mixing bowl. Gradually add 1 1/2 cups sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Spread the meringue mixture in the prepared pan.",
        "Whisk together the cinnamon and 1/4 cup sugar in a small bowl. Sprinkle cinnamon sugar, then almonds, evenly over the meringue mixture.",
        "Bake meringue in the preheated oven until lightly brown, 12 to 15 minutes. Remove pan from oven; turn over onto a foil-covered surface, almond side down. Set aside to cool completely. Carefully remove parchment when cool.",
        "Beat the 3 egg whites until foamy in a large glass or metal mixing bowl. Add salt, continuing to beat until stiff peaks form. Gradually beat in 1 cup sugar; then gradually beat in lemon juice and zest.",
        "In a separate bowl, beat cream until stiff peaks form. Fold whipped cream into lemon mixture.",
        "Place the filling in the center of the meringue. Using the foil to lift the meringue, fold the sides of the meringue over the filling, making a log shape. Wrap the log in foil and place in freezer for at least two hours.",
        "To serve, unwrap pavlova. Decorate with lemon slices, mint leaves and strawberries. Serve frozen."
    ],
    "ingredients": [
        "Meringue",
        "2 teaspoons cornstarch",
        "6 egg whites",
        "1 1/2 cups white sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 cup white sugar",
        "3 1/2 ounces sliced almonds",
        "Lemon Filling",
        "3 egg whites",
        "1 pinch salt",
        "1 cup white sugar",
        "1/4 cup lemon juice",
        "4 teaspoons lemon zest",
        "1 cup heavy cream",
        "1 lemon, sliced",
        "1 sprig fresh mint",
        "1 cup fresh strawberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Frozen Lemon Pavlova",
    "url": "http://allrecipes.com/recipe/165687/frozen-lemon-pavlova/"
}
