{
    "directions": [
        "Preheat oven to 350°F. Finely chop nuts and sugar in processor. Add butter and blend, using on/off turns, until moist crumbs form. Using plastic wrap as aid, press mixture onto bottom and all the way up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides, covering completely. Freeze 10 minutes. Bake crust until golden, about 10 minutes. Cool.",
        "Whisk 1 cup cream, sugar and yolks in heavy medium saucepan. Stir constantly over medium heat until candy thermometer registers 160° about 6 minutes. Strain into large bowl. Using electric mixer, beat mixture until cool and slightly thickened, about 8 minutes. Beat in pumpkin, corn syrup, rum and spices.",
        "Using electric mixer, beat remaining 1 1/2 cups cream in large bowl to medium-stiff peaks. Fold cream into pumpkin mixture. Transfer filling to crust. Cover and freeze overnight.",
        "Arrange pecans side by side atop torte, covering completely. Drizzle 1/2 cup caramel sauce over, covering nuts completely (pan will be filled to top). Freeze until caramel sets, at least 3 hours or overnight.",
        "Run sharp knife around pan sides to loosen torte. Release pan sides. Stir remaining caramel sauce in heavy small saucepan over medium heat until warm. Slice torte and serve with sauce."
    ],
    "ingredients": [
        "3 cups pecans, toasted (about 11 ounces)",
        "1/2 cup firmly packed golden brown sugar",
        "3 tablespoons butter, melted",
        "2 1/2 cups chilled whipping cream",
        "1 cup firmly packed golden brown sugar",
        "8 large egg yolks",
        "1 1/2 cups canned solid pack pumpkin",
        "1/2 cup light corn syrup",
        "3 tablespoons dark rum",
        "1 1/2 teaspoons ground ginger",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 1/2 cups pecan halves, toasted (about 5 1/2 ounces)",
        "1 17-ounce jar butterscotch caramel fudge sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dairy",
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Pumpkin",
        "Fall",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Pumpkin Mousse Torte with Caramel-Pecan Topping",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-pumpkin-mousse-torte-with-caramel-pecan-topping-554"
}
