{
    "directions": [
        "Position racks in upper and lower thirds of oven and preheat to 200°F. Line baking sheets with foil. Brush foil with margarine; dust lightly with matzo cake meal. Using electric mixer, beat whites in large bowl until soft peaks form. Gradually add sugar, beating until whites are very thick, stiff and shiny, about 5 minutes. Drop meringue onto prepared sheets by rounded tablespoonfuls, spacing 1 inch apart.",
        "Bake meringues until dry and crisp to touch and pale ivory, about 2 hours 45 minutes. Turn off oven. Cool meringues 1 hour in closed oven. Place in large resealable plastic bags and freeze.",
        "Place 6 cups frozen berries in large bowl and remaining berries in medium bowl; thaw berries. Puree 6 cups berries with their juices in blender; press through sieve into large measuring cup to yield about 2 1/2 cups puree. Transfer 1 1/4 cups puree to small bowl; chill while making egg mixture. Add remaining puree to berries in medium bowl for sauce; mix in 1/2 cup sugar. Cover; chill.",
        "Using handheld electric mixer, beat 1 1/4 cups sugar, wine and yolks in large metal bowl to blend. Set over saucepan of simmering water (do not allow bottom of bowl to touch water) and beat until mixture is very thick and thermometer registers at least 160°F, about 12 minutes. Remove from over water. Add 1 1/4 cups cold berry puree. Continue to beat until sabayon is cool, about 8 minutes.",
        "Place 1 layer of meringues on bottom of 9-inch-diameter springform pan. Pour sabayon over. Top with more meringues pressed into sabayon at slight angle and arranged in 2 concentric circles. Freeze until firm, about 6 hours. (Sauce and torte can be made 3 days ahead. Keep sauce refrigerated. Cover torte; keep frozen.)",
        "Cut around torte; remove pan sides. Cut torte into wedges. Spoon sauce over wedges and serve."
    ],
    "ingredients": [
        "Matzo cake meal",
        "6 large egg whites",
        "1 1/4 cups sugar",
        "2 1-pound bags frozen unsweetened blackberries",
        "1 3/4 cups sugar",
        "2/3 cup Passover blackberry wine",
        "8 large egg yolks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Passover",
        "Blackberry",
        "Spring",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Frozen Blackberry and Meringue Torte",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-blackberry-and-meringue-torte-103298"
}
