{
    "directions": [
        "Puree raspberries and juices in blender. Strain puree into bowl, pressing hard on fruit to release all pulp and juices. Mix 2 tablespoons corn syrup into puree. Cover and refrigerate while preparing zabaglione.",
        "Combine 8 egg yolks, sugar, Grand Marnier and orange juice concentrate in large bowl. Using electric mixer, beat yolk mixture 1 minute. Set bowl over large saucepan of simmering water and beat yolk mixture at high speed until very thick and thermometer registers 160°F, about 12 minutes.",
        "Place bowl over larger bowl filled with ice and water and cool zabaglione, whisking occasionally, about 15 minutes. Fold in 3/4 cup raspberry puree. Transfer to covered container and freeze. (Can be prepared 2 days ahead.)",
        "Stir chopped chocolate, corn syrup, 1 tablespoon water and 1/2 cup plus 3 tablespoons raspberry puree in heavy medium saucepan over low heat until chocolate melts and sauce is smooth. Cover and refrigerate. (Can be made 2 days ahead.)",
        "Preheat oven to 200°F. Line large baking sheet with foil; grease foil lightly. Using electric mixer, beat 3 egg whites and 1/4 teaspoon cream of tartar in large bowl until soft peaks form. Gradually add sugar, beating until meringue is stiff and shiny. Fold in half of toasted almonds.",
        "Drop meringue in 8 mounds onto prepared sheet. using back of spoon, make indentation in each mound. Sprinkle meringues with remaining toasted almonds. Bake 1 hour. Turn off oven, leave oven door closed and let meringues dry in oven overnight.",
        "Place meringues on platter and fill each with large scoop of zabaglione. Wrap meringues tightly and freeze at least 8 hours and up to 1 day.",
        "Rewarm chocolate sauce over low heat. Place each filled meringue on plate. Spoon warm chocolate sauce over and serve immediately."
    ],
    "ingredients": [
        "2 12-ounce bags frozen unsweetened raspberries, thawed, with juices",
        "2 tablespoons corn syrup",
        "8 large egg yolks",
        "3/4 cup sugar",
        "6 tablespoons Grand Marnier or other orange liqueur",
        "5 tablespoons frozen orange juice concentrate, thawed",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon light corn syrup",
        "1 tablespoon water",
        "3 large egg whites",
        "1/4 teaspoon cream of tartar",
        "3/4 cup sugar",
        "1 cup sliced almonds, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Citrus",
        "Dessert",
        "Raspberry",
        "Winter"
    ],
    "title": "Frozen Raspberry Zabaglione on Meringues with Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-raspberry-zabaglione-on-meringues-with-chocolate-sauce-559"
}
