{
    "directions": [
        "For souffles: Cut four 14x6-inch foil strips. Fold each in half lengthwise. Wrap 1 foil strip around each of four 3/4-cup soufflé dishes, forming collars that extend from base to above rim. Fold and crimp ends to secure.",
        "Combine chopped plums and 1/4 cup sugar in heavy medium saucepan. Simmer over medium heat until mixture turns bright red and is reduced to 1 1/2 cups, stirring often, about 8 minutes. Transfer mixture to processor; puree until smooth. Cover; chill until cold.",
        "Whisk yolks, corn syrup, butter and 1/4 cup sugar in medium metal bowl. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until candy thermometer registers 170°F, about 5 minutes. Remove bowl from over water. Mix in cardamom. Using electric mixer, beat egg mixture until cool and thick, about 5 minutes.",
        "Beat cream, vanilla and 1/4 cup sugar in large bowl until stiff peaks form. Add plum puree to cream; fold together. Fold in egg mixture. Spoon mixture into soufflé dishes, dividing equally (mixture will extend above rim of dishes). Cover with plastic; freeze overnight or up to 1 week.",
        "For sauce: Combine chopped plums and sugar in heavy medium saucepan. Simmer over medium heat until mixture turns bright red and is reduced to 1 1/3 cups, stirring often, about 10 minutes. Mix in 6 tablespoons water and cardamom. Transfer to processor and puree. Transfer sauce to bowl. Cover; chill until cold, at least 3 hours or overnight.",
        "Carefully remove foil from soufflés. Drizzle some sauce over each. Top with plum slices. Serve with remaining sauce."
    ],
    "ingredients": [
        "2 1/4 cups chopped pitted purple-fleshed plums (about 1 pound)",
        "3/4 cup sugar",
        "4 large egg yolks",
        "1/3 cup light corn syrup",
        "3 tablespoons unsalted butter",
        "1/4 teaspoon ground cardamom",
        "1 cup chilled whipping cream",
        "1 teaspoon vanilla extract",
        "2 1/4 cups chopped pitted purple-fleshed plums (about 1 pound)",
        "1/3 cup sugar",
        "6 tablespoons water",
        "1/8 teaspoon ground cardamom",
        "2 plums, halved, pitted, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dairy",
        "Egg",
        "Fruit",
        "Herb",
        "Dessert",
        "Freeze/Chill",
        "Plum",
        "Spice",
        "Summer"
    ],
    "title": "Frozen Plum Souffles with Cardamom-Plum Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-plum-souffles-with-cardamom-plum-sauce-2006"
}
