{
    "directions": [
        "Line 9x5x2 3/4-inch metal loaf pan with 2 layers of plastic wrap in each direction, leaving overhang. Sprinkle 1 1/4 cups toasted coconut over bottom of pan. Microwave 1 pint pineapple-coconut ice cream on low in two or three 10-second intervals until slightly softened. Drop ice cream by large spoonfuls over coconut in pan, then spread in even layer; freeze 15 minutes. Microwave mango sorbet on low in two or three 10-second intervals until slightly softened. Drop sorbet by large spoonfuls atop ice cream, then spread in even layer; freeze 15 minutes. Repeat with boysenberry sorbet, then remaining 1 pint ice cream. Sprinkle remaining coconut over top; press to adhere (filling will extend slightly above pan). Cover with plastic wrap overhang; freeze overnight. (Can be made 3 days ahead. Keep frozen.)",
        "Combine mango, blackberries, and sugar in medium bowl. Scrape in seeds from vanilla bean; add bean and toss. Let stand at room temperature until juices form, tossing occasionally, about 2 hours. (Can be made 4 hours ahead. Cover and chill.) Discard vanilla bean.",
        "Using plastic wrap as aid, lift terrine out of pan; remove plastic wrap. Cut terrine into 3/4-inch-thick slices. Place on plates; spoon sauce over and serve."
    ],
    "ingredients": [
        "1 7-ounce package sweetened flaked coconut, toasted, divided",
        "2 pints pineapple-coconut ice cream, divided",
        "1 pint mango sorbet",
        "1 pint boysenberry sorbet",
        "1 large mango, peeled, pitted, sliced",
        "2 1/2-pint containers blackberries",
        "1/4 cup sugar",
        "1 vanilla bean, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Graduation",
        "Frozen Dessert",
        "Blackberry",
        "Mango",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Frozen Tropical Terrine with Mango-Blackberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-tropical-terrine-with-mango-blackberry-sauce-109810"
}
