{
    "directions": [
        "Combine 3 pounds peaches, 1/2 cup sugar and brandy in heavy large saucepan. Simmer over medium heat until peaches are juicy and tender, stirring occasionally, about 5 minutes. Transfer to processor and puree until smooth. Set aside 2 1/4 cups peach puree; cool (reserve any remaining puree for another use).",
        "Cut eight 14 x 6-inch foil strips. Fold each in half lengthwise. Wrap 1 foil strip tightly around each of eight 2/3-cup soufflé dishes, forming collars that extend from base of dish to above rim. Fold and crimp ends tightly to secure.",
        "Whisk yolks, corn syrup and remaining 1 cup sugar in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water). Using handheld electric mixer, beat constantly until thermometer inserted into mixture registers 160°F, about 7 minutes. Remove bowl from over water. Continue to beat mixture until cool and thick, about 5 minutes.",
        "Beat cream and vanilla in another large bowl until soft peaks form. Add amaretto and beat until stiff peaks form. Fold peach puree into cream mixture in 3 additions. Gently fold in yolk mixture and 6 tablespoons crushed cookies. Divide mixture equally among prepared soufflé dishes (mixture will extend above rim of dishes). Sprinkle tops with remaining crushed cookies. Cover with plastic; freeze overnight and up to 3 days.",
        "Carefully remove foil from soufflés. Top soufflés with berries and peach slices, if desired, and serve immediately."
    ],
    "ingredients": [
        "3 pounds peaches (about 8 large), peeled, pitted, cut into 3/4-inch pieces",
        "1 1/2 cups sugar",
        "2 teaspoons brandy",
        "8 large egg yolks",
        "1/2 cup light corn syrup",
        "1 1/4 cups chilled whipping cream",
        "1 teaspoon vanilla extract",
        "2 tablespoons amaretto",
        "8 tablespoons crushed amaretti cookies",
        "Fresh raspberries (optional)",
        "Sliced fresh peaches (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Raspberry",
        "Peach",
        "Brandy",
        "Amaretto",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Frozen Peach and Amaretti Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-peach-and-amaretti-souffles-5627"
}
