{
    "directions": [
        "Line 9 1/4x5 1/4x2 3/4-inch loaf pan with plastic wrap, leaving long overhang. Whisk 3 whole eggs and 3 egg yolks in medium bowl to blend. Combine 1/2 cup lemon juice, 1/2 cup sugar, and butter in heavy medium saucepan. Stir over medium heat until butter melts and sugar dissolves. Gradually whisk warm lemon mixture into eggs; return to saucepan. Stir over medium heat until custard thickens, about 3 minutes (do not boil). Transfer to large bowl; whisk in 3 teaspoons lemon peel. Chill lemon custard until cold, about 30 minutes.",
        "Beat whipping cream in medium bowl until peaks form. Fold whipped cream into lemon custard in 2 additions. Spread 1/4 of lemon mousse (about 1 1/2 cups) over bottom of prepared pan. Sprinkle with 1/4 cup cookie crumbs. Repeat layering with lemon mousse and crumbs 2 more times. Top with remaining 1/4 of lemon mousse. Sprinkle with remaining 1/4 cup crumbs. Fold plastic-wrap overhang over dessert to cover completely. Freeze dessert until solid, at least 6 hours. (Can be made 2 days ahead. Keep frozen.)",
        "Mix 1/4 cup lemon juice, 5 tablespoons sugar, and 1 teaspoon lemon peel in medium bowl. Mix in two 1/2-pint baskets berries. Let stand until sugar dissolves, stirring often, about 1 hour; puree mixture in blender. Strain into another medium bowl. Mix in remaining berries. Cover sauce; chill up to 1 day.",
        "Uncover lemon mousse. Turn out onto platter. Peel off plastic. Slice and serve with blueberry sauce."
    ],
    "ingredients": [
        "3 large eggs",
        "3 large egg yolks",
        "3/4 cup fresh lemon juice",
        "1/2 cup sugar plus 5 tablespoons sugar",
        "1/4 cup (1/2 stick) unsalted butter, diced",
        "4 teaspoons grated lemon peel",
        "1 cup chilled whipping cream",
        "1 cup crumbled amaretti cookies (Italian macaroons; about 24)",
        "4 1/2-pint baskets blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Blueberry",
        "Lemon",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Frozen Lemon Mousse with Blueberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-lemon-mousse-with-blueberry-sauce-105327"
}
