{
    "directions": [
        "Line a buttered baking sheet with parchment paper or foil and on it trace 2 squares, using the top and bottom of a 9-inch-square pan as a guide (one square will be slightly larger than the other). In a large bowl with an electric mixer beat the whites with a pinch of salt until they hold soft peaks, add the sugar, 1 tablespoon at a time, beating, and beat the whites until they hold stiff, glossy peaks. Transfer the meringue to a pastry bag fitted with a 1/2-inch tip, pipe it to fill in the squares, and smooth the tops. Bake the meringues in the middle of a preheated 275°F. oven for 1 hour, or until they are firm when touched lightly and very pale golden. Remove the meringues with the parchment from the baking sheets, let them cool, and peel off the parchment carefully. With a serrated knife trim the meringue layers so that the smaller one will just fit inside the bottom of the pan and the larger will just fit inside the top of the pan. Reserve the trimmings.",
        "Oil the pan with vegetable oil and line it with plastic wrap, leaving about a 5-inch overhang all around. Put the smaller meringue layer, smooth side down, in the lined pan. Stir the reserved meringue trimmings, crumbled, into the lemon cream, pour the filling into the pan, smoothing it, and top it with the remaining meringue layer, smooth side up, pressing gently. Fold the plastic-wrap overhang over the top to enclose the cake. Freeze the cake, wrapped well, overnight, or until it is frozen solid.",
        "In a small saucepan sprinkle the gelatin over the orange-flavored liqueur, let it soften for 1 minute, and heat the mixture over low heat, stirring, until the gelatin is dissolved. In a bowl beat the cream until it just holds stiff peaks, add the gelatin mixture in a stream, beating, and beat the icing until it holds stiff peaks.",
        "Unwrap the cake and unmold it onto a serving plate, discarding the plastic wrap. Spread a thin layer of the icing on the top and sides of the cake. Transfer the remaining icing to a pastry bag fitted with a decorative tip (such as basketwork one) and pipe it over the cake. Chill the cake for no more that 1 1/2 hours, decorate it with the lemon slices and leaves, and cut it into squares with a serrated knife.",
        "In a heavy saucepan melt the butter with the sugar, the cornstarch, the lemon juice, and the zest over moderately low heat, stirring until the sugar is dissolved. In a bowl whisk together lightly the whole egg and the yolks and add the butter mixture in a stream whisking. Transfer the mixture to the pan and cook it over moderately low heat, whisking constantly, for 3 to 5 minutes, or until the curd is thick enough to hold the mark of the whisk and the first bubble appears on the surface. Transfer the curd immediately to a bowl, cover its surface with plastic wrap, and let the curd cool. Chill the curd, covered with the plastic wrap, for 1 hour, or until it is cold. Whisk the yogurt into the curd, chill the lemon cream, and serve it with berries or as a filling for frozen lemon cream meringue cake. Makes about 3 cups."
    ],
    "ingredients": [
        "4 large egg whites at room temperature",
        "1 cup sugar",
        "1 stick (1/2 cup) unsalted butter",
        "3/4 cup sugar",
        "1/2 teaspoon cornstarch",
        "1/2 cup fresh lemon juice (about 2 lemons)",
        "1 tablespoon freshly grated lemon zest",
        "1 whole large egg plus 6 large egg yolks",
        "1 cup plain yogurt",
        "1 1/2 teaspoons unflavored gelatin",
        "3 tablespoons orange-flavored liqueur",
        "1 1/2 cups heavy cream",
        "lemon slices and unsprayed lemon leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Yogurt",
        "Lemon",
        "Spring",
        "Chill",
        "Gourmet"
    ],
    "title": "Frozen Lemon Cream Meringue Cake",
    "url": "http://www.epicurious.com/recipes/food/views/frozen-lemon-cream-meringue-cake-10399"
}
