{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Mix prunes, apricots, ginger, orange zest, 1/2 teaspoon cumin, and cinnamon in a bowl; season with salt and black pepper.",
        "Open pork roast and spoon stuffing down the center; fold meat over stuffing and tie securely in several places with kitchen twine. Set roast onto a rack in a roasting pan.",
        "Combine brown sugar, flour, cider vinegar, 1 teaspoon cumin, and mustard powder into a paste; spread brown sugar mixture over the roast.",
        "Bake in the preheated oven until a meat thermometer inserted into center of stuffing reads 160 degrees F (70 degrees C), about 1 1/2 hours. Transfer roast to a serving platter and tent with aluminum foil while you make gravy.",
        "Skim fat from roasting pan and transfer defatted drippings into a small saucepan. Pour 1/2 cup water into roasting pan and scrape up and dissolve any browned bits of food into water; pour into saucepan with pan juices. Bring pan juices to a boil over medium heat. Dissolve cornstarch in 1 tablespoon water in a small bowl and whisk cornstarch mixture into pan juices, stirring constantly until thickened, about 1 minute. Strain gravy into a gravy boat. Serve gravy with roast."
    ],
    "ingredients": [
        "3/4 cup chopped pitted prunes",
        "3/4 cup chopped dried apricots",
        "1 tablespoon grated fresh ginger",
        "1 teaspoon grated orange zest",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground cinnamon",
        "salt and ground black pepper to taste",
        "1 (4 pound) boneless pork loin roast, butterflied",
        "1/4 cup packed brown sugar",
        "2 teaspoons all-purpose flour",
        "2 teaspoons cider vinegar",
        "1 teaspoon ground cumin",
        "1 teaspoon mustard powder",
        "1/2 cup water",
        "1 teaspoon cornstarch",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fruit-Stuffed Pork Loin",
    "url": "http://allrecipes.com/recipe/230418/fruit-stuffed-pork-loin/"
}
