{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "Crimp seams of puff pastry together with fingertips. Dust both sides of pastry with sugar. Using a rolling pin, roll pastry in each direction to close seams. Using a sharp pizza cutter (and tracing a small plate) cut out 2 circles of pastry. Place pastry circles on a chilled sheet pan and let cool in the refrigerator for a few minutes.",
        "Using a vegetable peeler cut wafer thin apple slices. Put apple slices in lemon-juice-spiked water.",
        "Flip pastry circles over on the sheet pans and poke them with a fork to provide an outlet for steam. Put parchment paper on the pan underneath the pastry circles. Sprinkle pastry with sugar and arrange apple slices on top.",
        "Bake in the middle of the oven for 15 to 20 minutes. Poke the crust; if it feels soft it needs more time in the oven.",
        "Microwave some apricot jam for 30 seconds. Dab (don't brush) the jam on the tarts. Cool tarts at least 4 hours and seal in a resealable plastic bag. Serve at room temperature or heat in the microwave and top with ice cream."
    ],
    "ingredients": [
        "1 sheet puff pastry, thawed",
        "Sugar, for dusting",
        "1 Granny Smith apple, peeled, cored, and quartered",
        "1 tablespoon lemon juice",
        "Apricot jam"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Healthy Dinner",
        "Healthy",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Apple",
        "Fruit",
        "Baking",
        "Pastry Recipes",
        "Apricot",
        "Low Sodium",
        "Diabetes-Friendly",
        "Low-Fat",
        "Low Calorie",
        "Low-Cholesterol",
        "Heart-Healthy",
        "Dinner Parties",
        "Recipes for Parties",
        "Recipes for Two"
    ],
    "title": "Fruit Tart",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/fruit-tart-recipe"
}
