{
    "directions": [
        "Stir the vegetable broth, candied ginger, dried cherries, dried pears, dried apples, brown sugar, kosher salt, black peppercorns, allspice berries, 3 cinnamon sticks, and 5 sage leaves together in a large stockpot until the brown sugar and salt dissolve completely; bring to a boil, reduce heat to medium-low, and cook for 1 hour, stirring occasionally.",
        "Remove the brine from heat, add the ice water, and stir to melt ice and chill the brine; refrigerate until cold, at least 2 hours. Place the still-frozen turkey into the brine and refrigerate for 3 days. On the second day of brining, turn the turkey over in the brine.",
        "On serving day (the third day of brining), preheat oven to 350 degrees F (175 degrees C). Remove the turkey from the brine and place into a roasting pan. Discard the brine.",
        "Place the onion, red apple, 1 sprig of rosemary, 2 more cinnamon sticks, and 1 sage leaf into a 5-cup microwave-safe measuring cup and fill the cup with enough water to cover. Place into microwave oven and cook on high power until hot, about 5 minutes. Pour the contents of the cup into the cavity of the turkey. Rub the skin of the turkey with the vegetable oil.",
        "Roast in the preheated oven until the turkey is golden brown and the juices run clear, 4 to 4 1/2 hours. An instant-read meat thermometer inserted into the thickest part of a thigh should read 165 degrees F (75 degrees C)."
    ],
    "ingredients": [
        "9 (14 ounce) cans vegetable broth",
        "1 1/2 cups chopped candied ginger",
        "1 1/2 cups  dried cherries",
        "4 ounces dried pears",
        "4 ounces dried apples",
        "2 1/2 cups brown sugar",
        "1 cup kosher salt",
        "2 tablespoons whole peppercorns",
        "1 teaspoon whole allspice berries",
        "3 cinnamon sticks",
        "5 leaves fresh sage",
        "1 gallon ice water",
        "1 (15 pound) frozen whole turkey, unthawed",
        "1 white onion, quartered",
        "1 red apple, cored and quartered",
        "1 sprig fresh rosemary, or to taste",
        "2 cinnamon sticks",
        "1 leaf fresh sage, or to taste",
        "3 cups water, or amount to cover",
        "1 tablespoon vegetable oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fruity Tutti Turkey Brine",
    "url": "http://allrecipes.com/recipe/219474/fruity-tutti-turkey-brine/"
}
