{
    "directions": [
        "Sprinkle the gelatin over the cold water and set aside to soften for 5 minutes.",
        "Combine 2/3 cup sugar, the rehydrated gelatin, and the mashed fruit in a saucepan. Cook to a full rolling boil, stirring constantly. Immediately remove the pan from the heat and set the bottom of the pan in cold water; cool just until the mixture mounds slightly when dropped from a spoon.",
        "Combine the egg whites, cream of tartar, and 1/3 cup sugar in a heat-proof mixing bowl. Whisk the mixture slightly, just to break up the egg whites. Set the bowl over a pot of simmering water on the stove. Heat the mixture, whisking constantly, until the egg white mixture is hot to the touch and has reached 145 degrees F (63 degrees C) on an instant-read thermometer. Immediately remove the bowl from the heat and whip with an electric mixer until the meringue forms medium-stiff glossy peaks.",
        "Use a whisk or spatula to fold the fruit mixture into the meringue. Meanwhile, whip the cream in a cold bowl until medium-stiff peaks form.",
        "The filling mixture should be no warmer than room temperature when you add the whipped cream. Add one third of the whipped cream into the filling mixture, mixing gently until combined. Fold in the remaining whipped cream and pile the filling into the cooled baked pie shell. Chill several hours until set."
    ],
    "ingredients": [
        "For the Fresh Strawberry Filling:",
        "1 (.25 ounce) package unflavored gelatin",
        "1/2 cup cold water",
        "2/3 cup white sugar",
        "1 cup mashed strawberries",
        "For the Swiss Meringue:",
        "3 egg whites",
        "1/4 teaspoon cream of tartar",
        "1/3 cup white sugar",
        "1/2 cup heavy whipping cream",
        "1 (9 inch) pie crust, baked"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fruit Chiffon Pie",
    "url": "http://allrecipes.com/recipe/12467/fruit-chiffon-pie/"
}
