{
    "directions": [
        "Preheat the oven to 200 degrees F. Combine the fruit and sugar in a blender. Add the lemon juice to taste (use 2 tablespoons for apples or bananas) and puree until smooth.",
        "Transfer the pureed fruit to a medium saucepan and bring to a simmer over medium-high heat. Reduce the heat to medium low and cook, stirring occasionally at first and then more often toward the end, until most of the liquid evaporates and the mixture is very thick, 35 to 45 minutes. Be careful: The mixture may splatter.",
        "Line a 12-by-17-inch rimmed baking sheet with a silicone mat or nonstick foil. Use an offset spatula to spread the fruit on the mat or foil into a thin layer. Bake until barely tacky, 3 hours to 3 hours, 30 minutes.",
        "Transfer the baking sheet to a rack and let the fruit leather cool completely. Peel off of the mat or foil. If the leather is still moist on the underside, return it to the oven, moist-side up, until dry, about 20 more minutes. Lay the leather smooth-side down on a sheet of wax paper and use kitchen shears to cut it into strips on the paper. Roll up the strips and store in zip-top bags for up to 1 week.",
        "Plum: 5 medium, unpeeled, chopped",
        "Peach or nectarine: 5 medium, unpeeled, chopped",
        "Apple: 3 large (Gala or Granny Smith), peeled and chopped",
        "Strawberry: 4 cups, hulled and chopped",
        "Raspberry: 5 cups",
        "Grape: 3 1/2 cups (preferably Concord), seeded if necessary",
        "Banana: 5 medium, peeled",
        "Mango: 2 large, peeled and chopped",
        "Raspberry-Vanilla: 5 cups raspberries plus the seeds from 1/2 vanilla bean",
        "Strawberry-Banana: 3 cups strawberries, hulled and chopped, plus 2 medium bananas, peeled",
        "Apple-Ginger: 3 large apples, peeled and chopped, plus 1 1/2 teaspoons grated ginger",
        "Spicy Mango: 2 large mangoes, peeled and chopped, plus 1/8 teaspoon each salt and cayenne pepper",
        "Photograph by Kang Kim"
    ],
    "ingredients": [
        "1 1/4 pounds chopped fruit (see below for suggested flavors)",
        "3/4 cup sugar",
        "1 to 2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit",
        "Sugar",
        "Snack"
    ],
    "title": "Fruit Leather Roll-Ups",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/fruit-leather-roll-ups-recipe"
}
