{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Add the peaches and cook uncovered until peel starts to come away, about 1 minute. Immediately immerse peaches in ice water for several minutes until cold to stop the cooking process. Once the peaches are cold remove from ice water; peel and discard peach skins and cut peaches into wedges.",
        "Bring water, rice, cream of coconut, and salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid is absorbed, 20 to 25 minutes. Uncover saucepan and cool rice completely.",
        "Gently rinse rice paper wrapper until cool water and lay on a flat work surface. Spoon 2 tablespoons cooked rice in a line slightly off-center on the wrapper. Spread about 1 1/2 tablespoons of plum preserves over the rice. Spread a layer of strawberry slices atop the preserves, a layer of peaches atop the strawberries, a layer of orange sections atop the peaches, a layer of grapefruit atop the oranges, and fresh mint leaves atop the grapefruit. Fold opposing edges of the wrapper to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito shape. Repeat with remaining wrappers, rice, and fruit. Cut rolls in half and serve with yogurt for dipping."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=960&h=503&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107839.jpg",
    "ingredients": [
        "2 large fresh peaches",
        "1 ¾ cups water",
        "1 cup short-grain sushi rice",
        "3 ½ tablespoons cream of coconut",
        "1 pinch salt",
        "10  rice paper wrappers",
        "1 cup plum preserves",
        "2 cups sliced fresh strawberries",
        "2 large seedless oranges, peeled and sectioned",
        "1 large grapefruit, peeled and sectioned",
        "¼ cup fresh mint leaves, or as desired",
        "1 cup vanilla yogurt, or more to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fruishi Spring Rolls",
    "url": "http://allrecipes.com/recipe/236451/fruishi-spring-rolls/"
}