{
    "directions": [
        "Combine apricots, cherries, raisins, and 1/2 cup rum in a small bowl and let sit 30 minutes to allow fruit to rehydrate. Drain, reserving rum. Sprinkle fruit with 3 Tbsp. flour and toss to coat; set aside.",
        "Preheat oven to 350°F. Thoroughly butter pan, making sure to get into all the curved or ridged places; dust pan with flour (do this even if your pan has a nonstick coating). Whisk baking powder, salt, cloves, and 3 cups flour in a medium bowl to combine. Whisk reserved rum, oil, and 1 1/4 cups sour cream in another medium bowl to combine.",
        "Using an electric mixer on high speed, beat 2 cups raw sugar and remaining 1 cup butter in a large bowl until light and fluffy, about 4 minutes. Scrape in seeds from vanilla bean; reserve pod for another use. Add egg yolks and egg one at a time, beating to blend after each addition; beat until mixture is light and very fluffy, about 4 minutes. Reduce speed to low. Add dry ingredients in 3 additions, alternating with sour cream mixture in 2 additions, beginning and ending with dry ingredients. Fold in reserved dried fruit. Scrape batter into prepared pan; smooth top. Tap pan firmly a few times on counter to force batter into edges of pan.",
        "Bake cake until golden brown and a tester inserted into the center comes out clean, 60–70 minutes. Transfer pan to a wire rack and let cake cool in pan 15 minutes. Invert cake onto a serving plate; carefully remove pan and brush warm cake with remaining 2 Tbsp. rum. Let cool completely, about 3 hours.",
        "Mix powdered sugar and remaining 2 Tbsp. sour cream in another small bowl, thinning with more sour cream if desired (the thinner the glaze, the further it will drip down the sides of the cake), until smooth. Drizzle glaze over cake, working along the center of the top of the cake for even coverage, and sprinkle with raw sugar. Let sit 10 minutes for glaze to set before slicing with a serrated knife.",
        "Cake can be baked 1 day ahead. Do not glaze. Store loosely covered at room temperature."
    ],
    "ingredients": [
        "1/2 cup chopped dried apricots",
        "1/2 cup dried tart cherries",
        "1/2 cup golden raisins",
        "1/2 cup plus 2 tablespoons gold rum, divided",
        "3 tablespoons plus 3 cups all-purpose flour, plus more for pan",
        "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
        "5 teaspoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "1/4 teaspoon ground cloves",
        "2 tablespoons vegetable oil",
        "1 1/4 cups plus 2 tablespoons (or more) sour cream",
        "2 cups raw sugar, plus more for serving",
        "1 vanilla bean, split lengthwise",
        "7 large egg yolks",
        "1 large egg",
        "1 cup powdered sugar",
        "A 12-cup Bundt pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Christmas",
        "Dried Fruit",
        "Rum",
        "Apricot",
        "Sour Cream",
        "Cherry"
    ],
    "title": "Fruity Rum Bundt Cake",
    "url": "http://www.epicurious.com/recipes/food/views/fruity-rum-bundt-cake"
}
