{
    "directions": [
        "Preheat oven to 350°F. Line 9x9x2-inch baking pan with foil. Butter foil; dust with flour. Stir chocolate and butter in heavy medium saucepan over low heat until melted and smooth. Add jam and whisk until melted. Cool slightly.",
        "Using electric mixer, beat sugar and eggs in large bowl until mixture thickens, about 6 minutes. Sift flour and baking powder over egg mixture and fold in. Gradually fold in chocolate mixture.",
        "Pour batter into pan. Bake until top of cake is slightly crusty, begins to crack and tester inserted into center comes out with moist crumbs attached, about 45 minutes. Cool 5 minutes. Gently press down any raised edges of cake to even. Cool in pan. Invert cake onto platter. Peel off foil. Trim 1/2 inch off each edge of cake.",
        "Stir cream and jam in heavy small saucepan over medium heat until jam melts; bring to boil. Remove from heat. Add chocolate and stir until melted. Let stand until cool but still spreadable, about 15 minutes.",
        "Spread glaze over top of cake. Immediately arrange berries atop glaze. Chill until glaze sets, about 10 minutes. (Can be made 1 day ahead. Cover and keep chilled.)",
        "Cut into 12 pieces and serve."
    ],
    "ingredients": [
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into small pieces",
        "1/3 cup seedless raspberry jam",
        "1 cup sugar",
        "5 large eggs",
        "1/3 cup all purpose flour",
        "1 teaspoon baking powder",
        "1/4 cup whipping cream",
        "1/4 cup seedless raspberry jam",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 6-ounce baskets fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Raspberry",
        "Chill",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fudgy Chocolate-Raspberry Bars",
    "url": "http://www.epicurious.com/recipes/food/views/fudgy-chocolate-raspberry-bars-4340"
}
