{
    "directions": [
        "Using an electric mixer on high speed, beat cream cheese and sugar in a large bowl until smooth. Add egg and vanilla and beat until smooth.",
        "Preheat oven to 350°F. Butter baking pan and line with 2 overlapping layers of parchment, leaving a 2\" overhang on all sides. Butter parchment.",
        "Whisk cornstarch, cocoa powder, coffee, and salt in a small bowl.",
        "Combine chocolate and 6 Tbsp. butter in a large heatproof bowl set over a pot of barely simmering water, stirring occasionally, until butter and chocolate are melted and smooth. Remove from heat, then stir in sugar and vanilla. Whisk in eggs, one at a time, then whisk in cornstarch mixture until smooth, about 1 minute.",
        "Transfer batter to prepared pan. Dollop cream cheese mixture over batter, then swirl into batter with a knife or spatula.",
        "Bake brownies until a toothpick inserted into the center comes out with a few moist crumbs attached, about 30 minutes. Transfer pan to a wire rack and let cool completely. Using parchment overhang, transfer brownies to a cutting board. Cut into 4 pieces lengthwise, then 4 pieces crosswise to make 16 bars.",
        "Brownies can be made 3 days ahead. Store in an airtight container at room temperature."
    ],
    "ingredients": [
        "8 ounces cream cheese, room temperature",
        "1/4 cup sugar",
        "1 large egg, room temperature",
        "1/4 teaspoon vanilla extract",
        "6 tablespoons unsalted butter, plus more for pan",
        "1/4 cup cornstarch",
        "1/4 cup unsweetened cocoa powder",
        "1 tablespoon instant coffee or espresso powder",
        "1/2 teaspoon kosher salt",
        "9 ounces semisweet chocolate, coarsely chopped",
        "1 cup sugar",
        "1 teaspoon vanilla extract",
        "3 large eggs, room temperature",
        "An 8x8x2\" baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Brownie",
        "Chocolate",
        "Cream Cheese",
        "Coffee",
        "Wheat/Gluten-Free",
        "Kid-Friendly",
        "Back to School",
        "Backyard BBQ",
        "Potluck",
        "Picnic",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fudgy Gluten-Free Cream Cheese Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/fudgy-gluten-free-cream-cheese-brownies"
}
