{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter and flour two 9-inch-diameter cake pans with 2-inch high sides. Line bottom of each pan with parchment paper round. Whisk first 7 ingredients in medium bowl. Using electric mixer, beat 1 cup butter in large bowl until fluffy. Add both sugars and beat until smooth. Add eggs 1 at a time, beating well after each addition. Beat in vanilla, then bourbon, if desired (mixture may look curdled). Add flour mixture to egg mixture in 3 additions alternately with applesauce in 2 additions, beating until blended after each addition. Stir in apples and pecans. Divide batter between cake pans; smooth tops.",
        "Bake cakes until tester inserted into center of each comes out clean, about 50 minutes. Transfer cakes to racks and cool in pans 15 minutes. Cut around pan sides to loosen cakes. Invert cakes onto racks; peel off parchment paper. Place another rack atop 1 cake and invert again so that cake is rounded side up. Repeat with second cake. Cool completely. DO AHEAD: Can be made 1 day ahead. Wrap each cake in plastic and stoer at room temperature.",
        "Using electric mixer, beat cream cheese and butter in large bowl until smooth. Beat in vanilla extract and pinch of salt. Gradually add powdered sugar, beating until frosting is smooth and creamy, about 2 minutes.",
        "Using long serrated knife, trim off rounded tops of cakes to make level; brush off any loose crumbs. Transfer 1 cake to platter, trimmed side up. Drop half of frosting (about 11/2 cups) by spoonfuls atop cake. Spread frosting evenly to edges of cake. Top with second cake, trimmed side down. Drop remaining frosting by spoonfuls onto top of cake, leaving sides of cake plain. Spread frosting to top edges of cake, swirling and creating peaks, if desired. Sprinkle with pecans. Let cake stand at room temperature 1 hour to allow frosting to set slightly. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and refrigerate. Let cake stand at room temperature at least 2 hours before serving."
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "1 3/4 teaspoons ground cinnamon",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon freshly grated nutmeg or ground nutmeg",
        "1/4 teaspoon baking soda",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 1/4 cups sugar",
        "3/4 cup (packed) golden brown sugar",
        "3 large eggs",
        "2 teaspoons vanilla extract",
        "2 tablespoons bourbon, apple brandy, or rum (optional)",
        "1 1/2 cups unsweetened applesauce",
        "2 medium Fuji or Gala apples (13 to 14 ounces total), peeled, halved, cored, cut into 1/3-inch cubes",
        "1 1/2 cups finely chopped pecans (about 6 ounces)",
        "1 8-ounce package cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 tablespoon vanilla extract",
        "Pinch of salt",
        "3 cups powdered sugar (measured, then sifted)",
        "Coarsely chopped toasted pecans (for garnish)",
        "Special equipment: 2 9-inch-diameter cake pans with 2-inch-high sides"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "High Fiber",
        "Cream Cheese",
        "Apple",
        "Pecan",
        "Spice",
        "Fall",
        "Cinnamon",
        "Potluck",
        "Nutmeg",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Fuji Apple Spice Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/fuji-apple-spice-cake-with-cream-cheese-frosting-355219"
}
