{
    "directions": [
        "Position rack in top third of oven and preheat to 425°F. Spray 8-inch-diameter cake pan with 3-inch-high sides with nonstick spray. Peel, quarter and core apples; place in bowl and set aside.",
        "Combine sugar and 6 tablespoons water in heavy medium saucepan. Stir over medium heat until sugar dissolves, occasionally brushing down sides of pan with wet pastry brush. Increase heat and boil without stirring until syrup is deep amber, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 10 minutes. Remove pan from heat. Add butter (caramel will bubble vigorously); stir to blend. Pour caramel into prepared pan. Let cool 5 minutes.",
        "Working carefully, stand apples on end in concentric circles in pan, crowding together as much as possible. Cut any remaining apple quarters into thin wedges; insert into empty spaces. Place pan directly over medium heat and bring caramel to simmer, about 2 minutes.",
        "Place pan in oven; bake until apples are tender and caramel bubbles thickly, occasionally pressing apples lightly with spatula to compact, about 1 1/2 hours.",
        "Meanwhile, unfold pastry sheet on work surface. Using 9-inch tart pan bottom as aid, cut out 9-inch round; pierce all over with fork. Chill until ready to use.",
        "Remove pan from oven. Top apples with pastry; tuck in edges. Return to oven; bake until pastry is golden, about 20 minutes. Transfer pan to rack. Cool tart completely in pan, about 3 hours.",
        "Place platter atop pan. Hold platter and pan and invert; tart will fall out onto platter. Cut into wedges and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "8 medium Fuji apples",
        "1 cup sugar",
        "6 tablespoons water",
        "1/4 cup (1/2 stick) unsalted butter",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Rosh Hashanah/Yom Kippur",
        "Apple",
        "Fall",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Fuji Apple Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/fuji-apple-tarte-tatin-103811"
}
