{
    "directions": [
        "1. If using dried rice noodles, pour enough warm water over them in a medium bowl to cover completely. Let soak until softened, about 30 minutes. Drain thoroughly. If using fresh rice noodles, run under warm water and separate strands.",
        "2. Marinate the shrimp: Stir the soy sauce, rice wine, garlic, cornstarch, and pepper together in a bowl until the cornstarch is dissolved. Toss the shrimp gently in the marinade until coated. Let stand for 10 minutes.",
        "3. Prepare the seasonings: Stir the soy sauce, chili garlic sauce, and sugar together in a bowl until the sugar is dissolved.",
        "4. Heat a wok over high heat until hot. Add the oil and swirl to coat the sides. Add the soaked or fresh rice noodles and stir-fry until the noodles are lightly browned along the edges, about 2 minutes. Scoop the noodles onto a plate and set aside.",
        "5. Add the shrimp to the wok and stir-fry until no longer pink, about 2 minutes. Add both onions and the ginger and stir-fry until fragrant, about 1 minute. Slide the noodles into the wok, scatter the bean sprouts over them, and pour in the seasonings. Toss until the mixture is heated through and the chicken is coated evenly with the seasonings, about 3 minutes.",
        "6. Stir in the peanuts, scoop the contents of the wok onto a warm serving plate, and serve."
    ],
    "ingredients": [
        "1 pound fresh or dried flat rice noodles (about 1/2 inch wide)",
        "1/2 tablespoon soy sauce or light soy sauce",
        "1 teaspoon Chinese rice wine or dry sherry",
        "1 teaspoon minced garlic",
        "1/2 teaspoon cornstarch",
        "1/8 teaspoon ground white pepper",
        "1/4 pound shrimp",
        "2 tablespoons soy sauce or 1 tablespoon each light and dark soy sauce",
        "1 teaspoon chili garlic sauce",
        "1/2 teaspoon sugar",
        "1 tablespoon vegetable oil",
        "1/2 yellow onion, thinly sliced",
        "3 green onions, trimmed and cut into 1-inch pieces",
        "1 teaspoon minced ginger",
        "1 cup bean sprouts",
        "1/4 cup roasted peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stir-Fry",
        "Peanut",
        "Shrimp",
        "Fall",
        "Noodle"
    ],
    "title": "Fun Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/fun-shrimp-108985"
}
