{
    "directions": [
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two in a large mixing bowl. Mash until no lumps remain, then refrigerate until cold.",
        "While the potatoes are cooking, place the salmon fillets into a wide, shallow pan, and cover with lightly salted water. Bring to a simmer over medium-high heat. Once simmering, reduce heat to low, and cook until the salmon flakes easily with a fork and is opaque in the center, about 10 minutes. Drain the salmon, and refrigerate until cold.",
        "Stir the bread crumbs, red pepper flakes, and garlic powder together in a bowl; set aside. Stir the eggs, onion, celery, green onion, bell pepper, parsley, and garlic into the mashed potatoes. Shred the chilled salmon with your fingers and place into the bowl with the mashed potatoes. Season to taste with salt and pepper, and gently stir the mixture until just blended. Divide into 1/4 cup portions, and shape into 1/2 inch thick patties. Carefully press the fish cakes into the seasoned bread crumbs, and place onto a plate - do not stack.",
        "Heat the butter and oil in a large skillet over medium heat. Cook the fish cakes in batches until the bread crumbs are golden brown on both sides, and the fish cakes are hot in the center, 3 to 4 minutes per side."
    ],
    "ingredients": [
        "2 potatoes, peeled and cubed",
        "2 pounds boneless salmon fillets",
        "2 cups dry bread crumbs",
        "1/2 teaspoon crushed red pepper flakes",
        "1/2 teaspoon garlic powder",
        "2 eggs",
        "1 onion, minced",
        "1/2 cup minced celery",
        "1/2 cup chopped green onions",
        "1/2 cup chopped green bell pepper",
        "1/2 cup chopped fresh parsley",
        "4 cloves garlic, minced",
        "salt and black pepper to taste",
        "1/2 cup butter",
        "1/2 cup vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Funco's Salmon Fish Cakes",
    "url": "http://allrecipes.com/recipe/180803/funcos-salmon-fish-cakes/"
}
