{
    "directions": [
        "In a small bowl, soak chiles in water and vinegar for 30 minutes. After soaking, puree in a blender or food processor until very smooth, about 5 minutes; set aside.",
        "Place sausage and ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Remove meat from pan, and set aside. In a large pot, Heat 3 to 4 tablespoons of the meat drippings over medium heat. Saute white onion, red onion, sweet onion, celery, carrots and garlic until onions are soft and translucent. Season with salt and black pepper. Stir in tomato paste, and allow to caramelize. Pour in wine to deglaze the pot, scraping up any bits stuck to the bottom.",
        "Stir in cooked meat, tomatoes, Worcestershire sauce and hot pepper sauce. Season with chili powder, cumin and parsley. Bring to a boil, then stir in blended chile mixture and honey. Carefully mix in kidney beans pinto beans without breaking them. Cover, and simmer for 3 hours. Stir and scrape the bottom every hour or so."
    ],
    "ingredients": [
        "10 dried ancho chiles - chopped, stemmed and seeded",
        "1/2 cup water",
        "1/4 cup white wine vinegar",
        "3 pounds hot Italian sausage, casings removed",
        "3 pounds ground beef",
        "1 white onion, diced",
        "1 red onion, diced",
        "1 sweet onion, diced",
        "1 cup diced celery",
        "1 cup diced carrots",
        "10 cloves garlic, sliced",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "1 (6 ounce) can tomato paste",
        "1 cup dry red wine",
        "4 (14.5 ounce) cans diced tomatoes",
        "1/4 cup Worcestershire sauce",
        "1/4 cup hot pepper sauce",
        "1 tablespoon chili powder",
        "2 teaspoons ground cumin",
        "1 tablespoon chopped fresh parsley",
        "1/2 cup honey",
        "1 (16 ounce) can kidney beans, drained",
        "1 (16 ounce) can pinto beans, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Fusion Chili",
    "url": "http://allrecipes.com/recipe/45942/fusion-chili/"
}
