{
    "directions": [
        "Place eggs in shallow bowl and beat to blend. Mix breadcrumbs, 1/3 cup parsley, 3/4 teaspoon salt and 1/2 teaspoon pepper in another shallow bowl. Dip chicken into eggs, then into crumb mixture, turning to coat completely.",
        "Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add chicken; sauté until cooked through, about 4 minutes per side. Transfer to plate. Discard oil in skillet; add 1 tablespoon oil. Add shrimp; sauté over medium-high heat until just cooked through, about 3 minutes. Using slotted spoon, transfer shrimp to plate with chicken. Add wine to skillet; boil until reduced to 1/2 cup, about 2 minutes. Add cream; boil until sauce thickens slightly, about 3 minutes. Mix in cayenne and Parmesan.",
        "Cut chicken into 1/2-inch pieces. Return chicken, shrimp and any collected juices to sauce in skillet. Stir over medium heat until heated through.",
        "Meanwhile, cook fusilli in large pot of boiling salted water until just tender but still firm to bite.",
        "Drain pasta. Add to skillet; toss to coat. Season with salt and pepper. Transfer to large bowl. Sprinkle with 2 tablespoons parsley and serve."
    ],
    "ingredients": [
        "2 eggs",
        "2 cups fresh French breadcrumbs",
        "1/3 cup plus 2 tablespoons chopped fresh parsley",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground pepper",
        "3/4 pound skinless boneless chicken breast halves",
        "4 tablespoons olive oil",
        "1/2 pound uncooked large shrimp, peeled, deveined",
        "2/3 cup dry white wine",
        "1 cup whipping cream",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup freshly grated Parmesan cheese",
        "1/2 pound fusilli"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pasta",
        "Sauté",
        "Kid-Friendly",
        "Shrimp",
        "Pan-Fry"
    ],
    "title": "Fusilli with Shrimp and Paneed Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/fusilli-with-shrimp-and-paneed-chicken-720"
}
