{
    "directions": [
        "Using sharp knife, cut deep cone-shaped incision into bottom of each cabbage; remove cores. Bring 4 quarts water and salt to boil in large saucepan. Add whole green cabbage and cook until leaves soften, about 7 minutes, turning occasionally. Transfer cabbage to colander and drain, cut side down. Gently pull off 8 leaves. If necessary, boil leaves about 3 minutes longer until leaves are soft enough to bend easily. Trim thick ribs from leaves. Repeat with whole red cabbage.",
        "Cook bacon in heavy large skillet over medium heat until crisp, stirring occasionally, about 15 minutes. Using slotted spoon, transfer bacon to paper towels. Reduce heat to medium-low. Discard all but 2 tablespoons bacon drippings from skillet. Add onions and sauté until tender and just beginning to brown, about 20 minutes. Add cream, sage and fennel seeds. Simmer over medium heat until cream thickens, stirring occasionally, about 10 minutes. Stir in bacon. Season to taste with salt and pepper.",
        "Preheat oven to 350°F. Butter heavy large baking sheet. Place 1 cabbage leaf on work surface. Spoon scant 1/4 cup onion mixture onto center of leaf. Fold bottom of leaf over filling. Fold in sides. Continue rolling to enclose filling. Repeat with remaining cabbage leaves and onion mixture. Arrange packages seam side down on prepared baking sheet. Brush tops with olive oil. Cover baking sheet with foil. (Can be prepared 1 day ahead. Refrigerate.) Bake packages until heated through, about 25 minutes."
    ],
    "ingredients": [
        "1 large whole head green cabbage",
        "1 large whole head red cabbage",
        "4 quarts water",
        "2 tablespoons salt",
        "1 pound thick-sliced bacon, cut crosswise into 1/4-inch  strips",
        "1 3/4 pounds onions (about 3 medium), thinly sliced",
        "3/4 cup whipping cream",
        "2 tablespoons plus 2 teaspoons chopped fresh sage",
        "1 teaspoon fennel seeds",
        "1/4 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Onion",
        "Pork",
        "Vegetable",
        "Side",
        "Bake",
        "Bacon",
        "Winter",
        "Cabbage",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cabbage Packages Filled with Creamed Onions, Bacon and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/cabbage-packages-filled-with-creamed-onions-bacon-and-sage-3006"
}
