{
    "directions": [
        "Soak beans in cold water to cover by 2 inches at room temperature at least 8 hours, or quick-soak (see cooks' note, below). Drain in a colander.",
        "Stick clove into onion. Bring ham hocks and 3 quarts water to a boil in a wide 6- to 7-quart heavy pot, skimming off any froth, then reduce heat and simmer, covered, 1 hour. Add beans, onion, parsley, bay leaf, thyme, and garlic and simmer, uncovered, stirring occasionally, until beans are almost tender, 40 to 50 minutes.",
        "When beans are almost done, peel potatoes and cut into 1-inch pieces. Add potatoes and cabbage to beans, then simmer, uncovered, until vegetables are very tender, 20 to 25 minutes.",
        "Remove ham hocks. When ham hocks are cool enough to handle, discard skin and bones, then cut meat into bite-size pieces. Stir into soup with salt and pepper to taste. Discard bay leaf and onion.",
        "Spread butter on both sides of bread, then toast in a 12-inch heavy skillet over moderate heat, turning over once, until golden, about 2 minutes total.",
        "Serve soup with toasts."
    ],
    "ingredients": [
        "1 cup dried white beans such as Great Northern, navy, or cannellini (7 oz), picked over and rinsed",
        "1 whole clove",
        "1 medium onion, peeled and left whole",
        "2 1/2 lb smoked ham hocks",
        "3 qt water",
        "6 fresh parsley sprigs",
        "1 Turkish or 1/2 California bay leaf",
        "1 fresh thyme sprig",
        "2 garlic cloves, finely chopped",
        "1 lb yellow-fleshed potatoes such as Yukon Gold (3 to 4 medium)",
        "1 lb cabbage, cored and cut into 1/2-inch pieces (6 cups)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "12 (1/2-inch-thick) slices from a baguette"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Potato",
        "Quick & Easy",
        "Ham",
        "Winter",
        "Cabbage",
        "Parsley",
        "Gourmet"
    ],
    "title": "Cabbage and White Bean Soup",
    "url": "http://www.epicurious.com/recipes/food/views/cabbage-and-white-bean-soup-109446"
}
