{
    "directions": [
        "A great Caesar salad gets its swagger from a great dressing. Squeamish about raw egg yolks and anchovies? Sorry. Yolks are what give richness to the emulsion, while anchovies provide a briny blast (and that whole umami thing). Here's our go-to recipe: Chop together 6 anchovy fillets packed in oil, 1 small garlic clove, and a pinch of kosher salt. Use the side of a knife blade to mash into a paste, then scrape into a medium bowl. Whisk in 2 large egg yolks*, 2 tablespoons fresh lemon juice, and 3/4 teaspoon Dijon mustard. Adding drop by drop to start, gradually whisk in 2 tablespoons olive oil, then 1/2 cup vegetable oil; whisk until dressing is thick and glossy. Whisk in 3 tablespoons finely grated Parmesan. Season with salt, freshly ground black pepper, and more lemon juice, if desired. Can be made 1 day ahead.",
        "Make your own. Tearing, not cutting, the bread ensures nooks and crannies that catch the dressing and add texture. Toss 3 cups torn 1\" pieces country bread with 3 tablespoons olive oil on a baking sheet; season with kosher salt and freshly ground black pepper. Bake at 375°F, tossing occasionally, until golden, 10-15 minutes.",
        "Use whole leaves from 3 romaine hearts to feed 6 people. They provide the ideal mix of crispness, surface area, and structure.",
        "Caesars crowned with a mound of grated Parmesan may look impressive, but all that clumpy cheese mutes the dressing. Instead, use a vegetable peeler to thinly shave a modest amount on top for little salty bursts.",
        "Skip the tongs. Use your hands to gently toss the lettuce, croutons, and dressing, then top off with the shaved Parm."
    ],
    "ingredients": [
        "6 anchovy fillets packed in oil",
        "1 small garlic clove",
        "2 large egg yolks*",
        "2 tablespoons fresh lemon juice",
        "3/4 teaspoon Dijon mustard",
        "5 tablespoons olive oil, divided",
        "1/2 cup vegetable oil",
        "3 tablespoons finely grated Parmesan",
        "3 cups torn 1\" pieces country bread",
        "3 romaine hearts",
        "Kosher salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Garlic",
        "Lunch",
        "Parmesan",
        "Lettuce",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caesar Salad",
    "url": "http://www.epicurious.com/recipes/food/views/caesar-salad-51160630"
}
