{
    "directions": [
        "Rub the bottom and sides of a very large wooden salad bowl well with garlic; discard garlic.",
        "Add romaine, croutons, and Parmigiano-Reggiano to bowl and toss lightly.",
        "Bring a small saucepan of water to a simmer over moderate heat, pierce the large end of the egg with a pushpin, then ease the egg into the simmering water. As soon as water returns to a simmer, coddle (simmer) the egg 1 minute exactly. Remove the egg to a small ramekin or bowl with a slotted spoon and set aside.",
        "Drizzle the olive oil evenly over the salad greens but do not toss.",
        "Whisk together the lemon juice, Worcestershire sauce, salt, and pepper in a small liquid measure. Drizzle over the salad and toss lightly.",
        "Break the coddled egg into the salad and again toss lightly.",
        "Taste the salad for lemon juice, salt, and pepper and adjust as needed.",
        "Set the salad bowl on the dining table and serve as a first course. It's the California way."
    ],
    "ingredients": [
        "1 large garlic clove, smashed and skin removed",
        "1 1/2 (7-ounce) packages whole romaine heart leaves, broken into 1- to 1 1/2-inch pieces, washed, and spun dry (about 10 cups broken romaine leaves)",
        "1 cup toasted croutons, homemade or store-bought",
        "1/3 cup freshly grated Parmigiano-Reggiano",
        "1 large egg, preferably pasteurized (see Cooks' notes)",
        "1/2 cup deeply fruity extra-virgin olive oil",
        "3 tablespoons freshly squeezed lemon juice, or to taste",
        "2 1/2 teaspoons Worcestershire sauce",
        "1/4 teaspoon salt, or to taste",
        "1/4 teaspoon freshly ground black pepper, or to taste",
        "Special Equipment: Large wooden salad bowl; pushpin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Lunch",
        "Salad Dressing",
        "Parmesan",
        "Lettuce",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caesar Salad",
    "url": "http://www.epicurious.com/recipes/food/views/caesar-salad-51184610"
}
