{
    "directions": [
        "Mix all ingredients in bowl. Press down on edges of cheesecake to even. Spoon topping over cheesecake. Bake 10 minutes. Transfer cheesecake to rack. Run small sharp knife around crust sides to loosen. Cool completely. Cover and chill overnight.",
        "Dip spoon into melted chocolate. Wave from side to side over cheesecake, creating zigzag lines. Release and remove sides of springform pan. Spoon whipped cream into pastry bag fitted with large star tip. Pipe rosettes of cream around cake edges. Top with coffee bean candies if desired.",
        "Finely grind cookies, sugar and espresso powder in processor. Add chocolate and chop finely. Add butter and blend until moist crumbs form. Press crumbs onto bottom and up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides.",
        "Preheat oven to 350°F. Using electric mixer, beat cream cheese and sugar in large bowl until well blended. Combine coffee liqueur and espresso powder in small saucepan. Stir over low heat until coffee dissolves. Mix in vanilla. Add to cheese mixture and beat until smooth. Add eggs 1 at a time, beating just until combined. Pour filling into 2 bowls, dividing evenly. Melt chocolate in top of double broiler over simmering water, stirring until smooth. Stir chocolate into filling in bowl. Pour coffee filling into crust. Bake until partially set and crust forms on filling, about 25 minutes. Carefully spoon chocolate filling over coffee filling. Bake cheesecake until set on edges but center 2 inches still move slightly when pan is shaken, about 30 minutes. Transfer cheesecake to rack and cool 20 minutes. Maintain oven temperature."
    ],
    "ingredients": [
        "1 9-ounce box chocolate wafer cookies, broken",
        "2 tablespoons sugar",
        "2 teaspoons instant espresso powder or instant coffee powder",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "6 tablespoons (3/4 stick) unsalted butter, melted, hot",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/4 cups sugar",
        "1/4 cup coffee liqueur",
        "3 tablespoons instant espresso powder or instant coffee powder",
        "1 tablespoon vanilla extract",
        "4 large eggs",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 1/4 cups sour cream",
        "3 tablespoons sugar",
        "2 teaspoons instant espresso powder or instant coffee powder",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped, melted",
        "Lightly sweetened whipped cream",
        "Coffee bean candies (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Liqueur",
        "Food Processor",
        "Mixer",
        "Cheese",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Chill",
        "Party",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Café con Leche and Chocolate Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/cafe-con-leche-and-chocolate-cheesecake-1894"
}
