{
    "directions": [
        "Pick over the black beans, then soak them in 8 cups of water for 6 to 8 hours. Drain them and cook in 8 cups of water until tender, about 1 hour. Drain, reserving all the cooking liquid.",
        "In a large skillet, sauté the onion in the oil until soft. Add the garlic, carrots, and celery; sauté 3 minutes. Add the bell pepper and jalapeño peppers; sauté 3 to 5 minutes longer.",
        "Combine the sautéed vegetables and cooked beans in a large pot. Add the herbs, spices, salt, lemon juice, and chocolate. Pour in about 1 1/2 cups of the reserved cooking liquid or as needed to keep the chili loose. Simmer 30 minutes, stirring occasionally.",
        "As the chili simmers, place the pumpkin seeds in a sauté pan over medium-high heat. Dry-toast them, stirring and tossing until the seeds glisten and begin to brown. Sprinkle a few drops of soy sauce on them and allow them to cool.",
        "Serve in bowls with the pumpkin seeds sprinkled on top. Add sour cream and/or grated cheese, if desired."
    ],
    "ingredients": [
        "2 1/2 cups dried black beans",
        "1 large onion, chopped",
        "2 tablespoons olive oil",
        "4 garlic cloves, minced",
        "2 large carrots, diced",
        "2 ribs celery, chopped",
        "1 red bell pepper, seeded and chopped",
        "2 to 3 jalapeño peppers, seeded and minced",
        "1 tablespoon minced fresh marjoram or 1 teaspoon dried",
        "1 tablespoon minced fresh oregano or 1 teaspoon dried Mexican",
        "1 tablespoon chili powder",
        "1 tablespoon ground cumin",
        "1/2 teaspoon cayenne",
        "1/2 teaspoon crushed coriander seeds",
        "1 1/2 teaspoons salt",
        "juice of 1/2 lemon",
        "1 ounce unsweetened chocolate",
        "1 cup raw pumpkin seeds",
        "soy sauce",
        "sour cream, optional",
        "1 1/2 cups grated Cheddar cheese, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Herb",
        "Onion",
        "Super Bowl",
        "Celery",
        "Carrot",
        "Winter",
        "Jalapeño",
        "Seed"
    ],
    "title": "Café Brenda Black Bean Vegetable Chili",
    "url": "http://www.epicurious.com/recipes/food/views/cafe-brenda-black-bean-vegetable-chili-100550"
}
