{
    "directions": [
        "Preheat grill to medium-high heat.",
        "Prick chicken breasts all over with a fork. Place chicken breasts, 1/4 cup olive oil, white wine vinegar, lemon juice, garlic and herb seasoning, ground black pepper, and chopped fresh dill in a bowl.  Stir to coat chicken breasts completely.  Let stand for 10 minutes.",
        "Remove chicken breasts from marinade, discard marinade, and grill chicken for 10 to 15 minutes on each side, or until juices run clear and an instant-read meat thermometer inserted into the thickest part of a breast reads at least 160 degrees F (70 degrees C). Remove from grill; let stand for 5 minutes. Cut chicken breasts in half.",
        "Melt butter and 2 tablespoons olive oil in a skillet over medium-high heat. Sprinkle garlic powder and salt over butter and oil. Add French bread slices to the pan and toast until golden brown on one side, about 3 minutes; remove from pan.",
        "For sandwich assembly, place one slice of French bread with toasted side down onto a serving plate. Spread mayonnaise on bread; top with a slice of tomato, salt and ground black pepper to taste, half a grilled chicken breast, and lettuce. Spread untoasted side of another slice of bread with mayonnaise and place on top to make a sandwich."
    ],
    "ingredients": [
        "2 skinless, boneless chicken breast halves",
        "1/4 cup olive oil",
        "2 tablespoons white wine vinegar",
        "lemon, juiced",
        "1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash®)",
        "1 teaspoon ground black pepper",
        "4 sprigs fresh dill, chopped",
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon salt",
        "8 thick slices French bread",
        "2 tablespoons mayonnaise, or to taste",
        "4 slices tomato",
        "4 lettuce leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cafe Style Grilled Chicken Sandwiches",
    "url": "http://allrecipes.com/recipe/223091/cafe-style-grilled-chicken-sandwiches/"
}
