{
    "directions": [
        "Bring sugar and water to a boil in a small heavy saucepan over medium heat, stirring until sugar has dissolved, then wash down any sugar crystals from side of pan with a pastry brush dipped in cold water. Boil, without stirring, swirling pan occasionally so caramel colors evenly, until dark amber.",
        "Immediately divide caramel among ramekins and swirl each ramekin to coat bottom and about halfway up side.",
        "Preheat oven to 350°F with rack in middle.",
        "Put cajeta, half-and-half, and lime zest in a heavy medium saucepan. Split vanilla bean lengthwise and scrape seeds into saucepan, then drop in pod. Bring to a simmer, stirring until smooth.",
        "Whisk together whole eggs and yolks in a large bowl. Slowly whisk in hot liquid, then strain through a fine-mesh sieve into another bowl. Ladle custard into ramekins.",
        "Bake in a hot water bath until edge is set but a quarter-size spot in center is still wobbly, 30 to 40 minutes.",
        "Remove ramekins from water and cool at least 30 minutes (custard will continue to set). Unmold just before serving. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/3 cup water",
        "1 (10-to 11-ounces) jar cajeta (goat's-milk caramel; about 3/4 cup)",
        "2 1/2 cups half-and-half",
        "1 (1-inch-wide) strip of lime zest",
        "1/2 vanilla bean",
        "3 whole large eggs",
        "4 large egg yolks",
        "Equipment: 8 (4-ounce) ramekins",
        "Accompaniment: whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Boil",
        "Ramekin",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cajeta Flan",
    "url": "http://www.epicurious.com/recipes/food/views/cajeta-flan-243272"
}
