{
    "directions": [
        "Combine the pork shoulder, liver, and 4 cups of water in a large saucepan. Bring to a boil; reduce heat to medium-low, cover, and simmer until the pork cubes are tender, about 1 1/2 hours.",
        "Bring the rice and 4 cups of water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes. Set aside.",
        "Once the pork is tender, remove from the saucepan with a slotted spoon and allow to cool a bit. While the pork is cooling, stir the green onion, chopped onion, celery, bell pepper, parsley, cilantro, and garlic into the simmering pork broth. Season with salt, cayenne pepper, black pepper, and red pepper flakes. Cook until the onion is tender. Meanwhile, grind the meat using the coarse plate of a meat grinder. Stir the ground meat into the vegetable mixture, and cook, stirring frequently until the water has nearly evaporated, about 10 minutes. Stir in the cooked rice, and set aside to cool.",
        "While the meat mixture is cooling, rinse the sausage casings inside and out with plenty of warm water. Keep the casings in a bowl of warm water until ready to stuff. Once the sausage mixture is cool enough to handle, stuff into the prepared casings using a sausage stuffer. Prick the sausage with a needle every 4 to 6 inches.",
        "Bring a large pot of salted water to a boil over high heat. Reduce the heat to keep the water at a very gentle simmer. Add the sausage and cook gently until the sausage is hot on the inside, firm to the touch, and has plumped, about 5 minutes. Serve immediately."
    ],
    "ingredients": [
        "2 1/2 pounds boneless pork shoulder, cubed",
        "1 pound pork liver, cut into pieces",
        "4 cups water",
        "2 cups uncooked white rice",
        "4 cups water",
        "1 1/4 cups green onions, chopped",
        "1 cup chopped onion",
        "1/2 cup minced celery",
        "1 red bell pepper, chopped",
        "1 cup chopped fresh parsley",
        "2 tablespoons finely chopped cilantro",
        "1 teaspoon minced garlic",
        "4 teaspoons salt",
        "2 1/2 teaspoons cayenne pepper",
        "1 1/2 teaspoons ground black pepper",
        "1/2 teaspoon red pepper flakes",
        "4 feet 1 1/2 inch diameter hog casings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cajun Boudin",
    "url": "http://allrecipes.com/recipe/173206/cajun-boudin/"
}
