{
    "directions": [
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Sprinkle both sides of chicken breast with 1/2 teaspoon Cajun seasoning, or to taste.",
        "Grill chicken breast and pork sausage on the preheated grill until browned and no longer pink inside, about 5 minutes per side. Transfer to a plate and let rest for 5 minutes. Cut chicken and sausage into bite-size pieces.",
        "Bring a large pot of lightly salted water to a boil. Cook the farfalle pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.",
        "Melt butter in a large skillet over medium heat. Cook and stir green bell pepper, red bell pepper, onion, and garlic in hot butter until slightly softened, 2 to 3 minutes. Stir chicken and sausage pieces into vegetables, reduce heat to medium-low, and pour 1 cup half-and-half into skillet. Stir to combine.",
        "Mix cornstarch into remaining 1/2 cup half-and-half in a small bowl until smooth; pour into skillet and stir until sauce simmers and thickens, about 5 minutes. Toss cooked farfalle pasta into mixture until coated; season with additional Cajun seasoning and dried basil."
    ],
    "ingredients": [
        "1 skinless, boneless chicken breast half",
        "1/2 teaspoon Cajun seasoning, or to taste",
        "1 link pork sausage with jalapeno pepper",
        "4 ounces farfalle (bow tie) pasta",
        "2 tablespoons butter",
        "1 green bell pepper, chopped",
        "1/2 red bell pepper, chopped",
        "1/2 onion, chopped",
        "1 clove garlic, chopped",
        "1 1/2 cups fat-free half-and-half, divided",
        "1 tablespoon cornstarch, or as needed",
        "1 pinch Cajun seasoning, or to taste",
        "1 pinch dried basil, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cajun Chicken and Sausage Pasta",
    "url": "http://allrecipes.com/recipe/232424/cajun-chicken-and-sausage-pasta/"
}
