{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Heat 2-inches vegetable oil in a Dutch oven or cast-iron skillet over medium-high heat until the temperature registers 350 degrees F.",
        "Whisk the flour and Creole seasoning in a shallow bowl. Add the eggs to another shallow bowl and the panko to a third shallow bowl. Dredge the shrimp in the flour, followed by the egg and finally coat with the panko, shaking off any excess in between dredges.",
        "Working in batches, fry the shrimp until golden brown, 2 1/2 to 3 minutes. Drain the shrimp on paper towel- lined plate and season with salt.",
        "Add the garlic to the melted butter and brush on the inside of each roll. Toast the rolls in the oven until golden brown and crispy, about 7 minutes.",
        "Spread the Tartar Sauce on each roll, top with lettuce leaves, tomato slices, 5 fried shrimp and some shredded cabbage.",
        "In a small bowl, mix together all of the ingredients and season with salt and pepper, to taste.;"
    ],
    "ingredients": [
        "Vegetable oil, for frying",
        "2 cups all-purpose flour",
        "3 tablespoons Creole seasoning",
        "4 eggs, whisked",
        "2 cups seasoned panko breadcrumbs (recommended: Progresso Panko Crispy Bread Crumbs Italian Style)",
        "20 large shrimp (21/25), peeled and deveined, tails removed",
        "Kosher salt",
        "2 cloves garlic, grated",
        "4 tablespoons (1/2 stick) unsalted butter, melted",
        "4 hoagie rolls, split",
        "Tartar Sauce, recipe follows",
        "Green or red leaf lettuce, for garnish",
        "1 tomato, thinly sliced",
        "1 cup shredded red cabbage",
        "1/2 cup mayonnaise",
        "2 tablespoons finely chopped cornichons",
        "2 tablespoons whole grain mustard",
        "1 tablespoon chili sauce",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon finely chopped fresh parsley",
        "Kosher salt and freshly cracked black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Cajun",
        "Sandwich",
        "Sauce Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Vegetable"
    ],
    "title": "Cajun Shrimp Po' Boys",
    "url": "http://www.foodnetwork.com/recipes/cajun-shrimp-po-boys"
}
