{
    "directions": [
        "In a 4 to 6 quart pot over medium heat, mix 4 ounces oil, tomato sauce, 8 to 12 ounces water, basil, 1/2 teaspoon ground black pepper, 1/2 teaspoon crushed red pepper flakes and 1/2 teaspoon salt. Reduce heat to medium-low after reaching a boil; stir occasionally.",
        "Season shrimp with 1/2 teaspoon salt, 1/2 teaspoon ground black pepper and 1/2 teaspoon crushed red pepper flakes; mix thoroughly and reserve.",
        "In a medium saucepan over medium-high heat, warm 1 ounce oil and add green bell pepper, red bell pepper, onion and garlic for 3 to 5 minutes; stir occasionally.",
        "Add vegetables to tomato sauce and cook over medium heat. After 3 minutes reduce heat to low and cook for 20 to 25 minutes; stir occasionally.",
        "When sauce has approximately 7 to 10 minutes to cook until completion, add seasoned shrimp to sauce; mix well. Bring heat to medium and stir occasionally.",
        "In a small dish, mix cornstarch and 1 ounce cold water; add mixture to sauce when sauce has 2 minutes left until completion and mix well.",
        "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and place in a serving bowl.",
        "Pour sauce over pasta and sprinkle with green onions; serve."
    ],
    "ingredients": [
        "1/2 cup vegetable oil",
        "8 ounces tomato sauce",
        "1 cup water",
        "1/4 teaspoon dried basil",
        "1 teaspoon ground black pepper",
        "1 teaspoon crushed red pepper flakes (optional)",
        "1 teaspoon salt",
        "1 pound small shrimp, peeled and deveined",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1/2 onion, chopped",
        "3 cloves garlic, minced",
        "2 teaspoons cornstarch",
        "1 fluid ounce cold water",
        "12 ounces spaghetti",
        "8 green onions, minced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cajun Spaghetti",
    "url": "http://allrecipes.com/recipe/19331/cajun-spaghetti/"
}
