{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Melt the butter in a small skillet over medium heat. Stir in the cayenne, oregano, pepper, thyme, mustard, and garlic. Cook for 1 minute. Use a paring knife to make several small incisions in the fat side of the meat. Stuff the slits with the spice mix, and rub the remaining mix over the surface of the meat. Sprinkle the roast with salt and pepper.",
        "Heat the olive oil in a roasting pan over medium heat. Put the roast in the pan, and surround with the carrots, red pepper, celery, and onion. Lightly salt and pepper the vegetables. Place roasting pan in preheated oven, and cook for 1 hour and 45 minutes. Increase the oven temperature to 425 degrees F, and cook for an additional 15 minutes to brown the meat. Cook until meat is 145 degrees F (63 degrees C). Remove roast from pan, and let stand 10 minutes before slicing.",
        "Place the roasting pan, with the pan juices, over medium heat. Whisk the flour into the hot drippings, and cook for 3 minutes. Pour in the chicken stock and cook, whisking occasionally, for 6 minutes. Strain sauce, and serve with the sliced pork roast."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1/2 teaspoon cayenne pepper",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon ground mustard",
        "2 cloves garlic, minced",
        "1 (4 pound) pork loin roast",
        "salt and pepper to taste",
        "1 tablespoon olive oil",
        "2 carrot, cut into 1/2 inch pieces",
        "1 red bell pepper, cut into 1/2 inch pieces",
        "1 stalk celery, cut into 1/2 inch pieces",
        "1 large onion, cut into 1/2-inch pieces",
        "3 tablespoons all-purpose flour",
        "1/2 cup chicken broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cajun Roasted Pork Loin",
    "url": "http://allrecipes.com/recipe/173906/cajun-roasted-pork-loin/"
}
