{
    "directions": [
        "To make the Cajun seasoning, in a small container with a tight-fitting lid, stir together the garlic, onion, sweet paprika, smoked paprika, cayenne, oregano, thyme, salt and black pepper. Cover and shake vigorously to mix. Use immediately, or store in a cool, dark place for up to 1 month. You will need 2 Tbs. of the seasoning for this recipe.",
        "If using wooden skewers, soak 6 to 12 skewers in water for at least 30 minutes.",
        "Bring a large saucepan three-fourths full of water to a boil over high heat. Add the potatoes and corn and cook for 5 minutes. Drain and immerse in ice water to stop the cooking.",
        "Using kitchen shears, snip open the shell along the length of the back of each shrimp. Then, using the tip of a small knife, cut a shallow groove along the length of the vein and lift it out. Thread the shrimp, sausages and vegetables onto the skewers, dividing them evenly. Place the skewers on a tray or platter and sprinkle them evenly with the Cajun seasoning. Let stand while you prepare the fire.",
        "Prepare a medium fire in a grill. Brush and oil the grill grate.",
        "Place the skewers on the grill directly over the heat. Cook, turning once with tongs, until the shrimp turn creamy white and the potatoes are tender, 3 to 5 minutes per side.",
        "Slide the shrimp, sausages and vegetables off the skewers onto a platter and serve immediately. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "Grill Master",
        ", by Fred Thompson (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "3 Tbs. granulated garlic",
        "3 Tbs. granulated onion",
        "3 Tbs. sweet paprika",
        "1 Tbs. smoked paprika",
        "1 Tbs. cayenne pepper",
        "4 tsp. dried oregano",
        "4 tsp. dried thyme",
        "3 Tbs. kosher salt",
        "3 Tbs. freshly ground black pepper",
        "",
        "6 small red-skinned potatoes, halved",
        "2 ears of corn, husks and silks removed, corn cut into rings 1 inch thick",
        "24 large shrimp in the shell, about 1 lb. total",
        "1 lb. andouille sausages, thickly sliced crosswise"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Cajun Shrimp and Sausage Skewers",
    "url": "http://www.williams-sonoma.com/recipe/cajun-shrimp-and-sausage-skewers.html"
}
