{
    "directions": [
        "Bring milk, water, chicken soup base, and smoked salt to a boil in a saucepan; slowly whisk in grits, reduce heat to low, and cover pan. Simmer until grits are tender and thick, about 20 minutes. Keep grits warm.",
        "Brown andouille sausage slices with vegetable oil in a large skillet over medium heat; remove sausage and set aside.",
        "Cook and stir green bell pepper, yellow onion, celery, and jalapeno pepper in the same skillet until onion is tender and translucent, about 10 minutes. Stir in garlic and Cajun seasoning; cook until fragrant, about 1 minute.",
        "Stir flour into the vegetables until well coated; gradually stir in fire-roasted tomatoes and white wine, cooking until the sauce begins to thicken, about 3 minutes. Reduce heat to low, stir bay leaf into the sauce, and simmer for 5 minutes; season with salt and black pepper.",
        "Mix cooked andouille sausage and shrimp into the sauce and cook, stirring often, until sausage is hot and shrimp are pink and no longer translucent, 5 to 8 minutes.",
        "Just before serving, stir Cheddar and Parmesan cheeses into grits until melted.",
        "To serve, spoon grits onto a serving plate and top with shrimp, sausage slices, and sauce. Garnish with chopped chives."
    ],
    "ingredients": [
        "2 1/4 cups 2% low-fat milk",
        "2 cups water",
        "2 teaspoons chicken soup base (paste)",
        "1/2 teaspoon smoked salt",
        "1 cup regular grits, uncooked",
        "1/2 pound andouille sausage, cut into 1/4-inch slices",
        "2 tablespoons vegetable oil",
        "3/4 cup diced green bell pepper",
        "3/4 cup diced yellow onion",
        "3/4 cup diced celery",
        "1/2 jalapeno pepper, seeded and minced",
        "1/2 teaspoon minced garlic",
        "1 teaspoon Cajun seasoning",
        "3 tablespoons all-purpose flour",
        "1 (14.5 ounce) can fire-roasted diced tomatoes, with juice",
        "1 cup dry white wine",
        "1 bay leaf",
        "1 pinch salt and ground black pepper to taste (optional)",
        "1 pound fresh large shrimp, shelled and deveined",
        "1/2 cup shredded sharp Cheddar cheese",
        "1/2 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh chives (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cajun Shrimp with Cheese Grits",
    "url": "http://allrecipes.com/recipe/220901/cajun-shrimp-with-cheese-grits/"
}
