{
    "directions": [
        "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.",
        "In a large bowl, combine the yeast mixture with the cake mix and 3 cups of the flour; stir to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.",
        "Deflate the dough and turn it out onto a lightly floured surface. Roll the dough into a 10x16 inch rectangle. spread the softened butter over the rectangle; sprinkle on brown sugar and cinnamon. Starting from one of the long sides, roll up the rectangle and cut into 1 inch wide rolls.",
        "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking pan. Pour the melted butter into a small bowl and mix the white sugar and pecans in another small bowl. Dip the top of each roll in the melted butter, then in the sugar and pecan mixture, then place the topped rolls snugly into the prepared pan. Cover the rolls with a damp cloth and let rise until doubled in volume, about 30 minutes.",
        "Bake at 375 degrees F (190 degrees C) for 20 minutes, or until rolls are golden."
    ],
    "ingredients": [
        "3 (.25 ounce) packages active dry yeast",
        "2 1/2 cups warm water",
        "1 (18.25 ounce) package white cake mix",
        "4 1/2 cups all-purpose flour",
        "1/2 cup butter, softened",
        "1/2 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1/4 cup butter, melted",
        "1/3 cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cake Mix Cinnamon Rolls",
    "url": "http://allrecipes.com/recipe/16822/cake-mix-cinnamon-rolls/"
}
