{
    "directions": [
        "In a small pot over moderate heat, combine the tomatoes, garlic, salt, and crushed red pepper. Bring to a boil then reduce the heat and simmer, uncovered, for about 20 minutes. Transfer the sauce to a blender or food processor and process until smooth. Keep warm.",
        "In a large bowl, whisk together the flour, salt, and pepper.",
        "Line a large baking sheet with paper towels. Fill a deep, heavy-bottomed medium saucepan (or deep fryer) with about 4 inches of oil, leaving at least 3 inches between the oil and the top of the saucepan. Heat the oil over moderately high heat until a deep-fry thermometer registers 375°F.",
        "While the oil is heating, in a large bowl, stir together the calamari (rings and tentacles) and eggs. Remove the calamari from the egg, shaking gently to remove any excess, then transfer to the bowl of seasoned flour and toss to coat. Remove the calamari from the flour, shaking to knock off any excess, then transfer to the paper towel–lined baking sheet.",
        "Working in batches, use a slotted metal spoon or spider to carefully place the calamari in the hot oil. Fry, flipping as needed, until golden brown, about 4 minutes. Transfer as done to the paper towel–lined baking sheet and immediately season with salt. Continue to fry the remaining calamari, returning the oil to 375°F between batches.",
        "Serve the calamari with the tomato sauce and lemon wedges on the side."
    ],
    "ingredients": [
        "2 cups whole peeled tomatoes",
        "2 cloves garlic, chopped",
        "2 tablespoons fine sea salt",
        "2 tablespoons crushed red pepper",
        "4 cups all-purpose flour",
        "4 tablespoons fine sea salt",
        "2 tablespoons freshly ground black pepper",
        "1 to 2 quarts peanut or vegetable oil for frying",
        "16 cleaned calamari (squid), bodies cut into 1/2-inch-wide rings, tentacles left whole",
        "4 large eggs, lightly beaten",
        "Lemon wedges (optional)",
        "Large baking sheet, deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Fry",
        "Seafood",
        "Squid",
        "Deep-Fry",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Calamari with Roasted Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/calamari-with-roasted-tomato-sauce-51188410"
}
