{
    "directions": [
        "1. Rinse the chicken wings under cold running water and blot them dry with paper towels. Cut the tips off the wings and discard them. Cut each wing into 2 pieces through the joint. Place the wings in a large nonreactive bowl or resealable plastic bag and add the beer. Let the wings marinate for 12 to 24 hours; the longer the wings marinate, the more pronounced the beer flavor will be.",
        "2. Place the salt, pepper, paprika, chili powder, and celery seed in a small bowl and whisk to mix. Set the rub aside.",
        "3. Drain the wings in a colander and blot them dry with paper towels, then place them in a large mixing bowl. Add the rub and toss to coat the wings evenly. Add the olive oil and toss well to mix.",
        "4. Cook the wings, following the instructions below for any of the grills, until the skin is browned and crisp and the meat is cooked through. To test for doneness, make a tiny cut in the thickest part of one of the larger wing halves: There should be no trace of red at the bone.",
        "5. Transfer the wings to a clean shallow serving bowl. Pour the butter, Sriracha, and hot sauce over them and stir to mix. Sprinkle the cilantro over the wings, if desired, and serve at once. You'll need to provide plenty of napkins.",
        "Preheat the grill; if your contact grill has a temperature control, preheat the grill to high. Place the drip pan under the front of the grill. When ready to cook, lightly oil the grill surface. Place the wings on the hot grill, then close the lid. The wings will be done after cooking 4 to 6 minutes.",
        "Preheat the grill to medium-high, then, if it does not have a nonstick surface, brush and oil the grill grate. Place the wings on the hot grate. They will be done after cooking 6 to 8 minutes per side.",
        "Preheat the grill to high; there's no need to oil the grate. Place the wings on the hot grill. The wings will be done after cooking 7 to 9 minutes per side.",
        "Rake red hot embers under the gridiron and preheat it for 3 to 5 minutes; you want a medium-high, 4 Mississippi fire. When ready to cook, brush and oil the gridiron. Place the wings on the hot grate. To prevent flare-ups, don't crowd the grill. The wings will be done after cooking 6 to 8 minutes per side.",
        "It's easy to cook chicken wings in a rotisserie basket. Use a flat rotisserie basket, if possible, and arrange the wings in it so that nothing sticks out, then close the basket tightly. The basket will hold about a dozen whole chicken wings. Place the drip pan in the bottom of the rotisserie. Attach the basket to the rotisserie spit, attach the spit to the rotisserie, and turn on the motor. If your rotisserie has a temperature control, set it to 400°F. The wings will be golden brown and cooked through after spit-roasting for 30 to 40 minutes. To test for doneness, make a tiny cut in the thickest part of one of the larger wing halves: There should be no trace of red at the bone."
    ],
    "ingredients": [
        "12 whole chicken wings (about 2 pounds)",
        "2 cups wheat beer",
        "2 teaspoons coarse salt (kosher or sea)",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon sweet paprika",
        "1 teaspoon chili powder",
        "1/2 teaspoon celery seed",
        "1 tablespoon extra-virgin olive oil",
        "Cooking oil spray",
        "4 tablespoons (1/2 stick) unsalted butter, melted",
        "1/4 cup Sriracha (Thai hot sauce)",
        "1/2 cup Crystal hot sauce or Tabasco sauce",
        "2 tablespoons chopped fresh cilantro or flat-leaf parsley (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Chicken",
        "Poultry",
        "Appetizer",
        "Super Bowl",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Sugar Conscious"
    ],
    "title": "Calgary Hot Wings",
    "url": "http://www.epicurious.com/recipes/food/views/calgary-hot-wings-231539"
}
