{
    "directions": [
        "In a small bowl toss the avocado gently with the lemon juice. Dry roast each sheet of asakusa nori over direct heat, holding it at opposite corners with tongs and waving it back and forth over the burner, for 30 seconds, or until it turns green.",
        "Lay a dry sudare (a bamboo mat used for rolling sushi and other foods) on a work surface so that the slats run horizontally. Put a piece of the nori on the sudare with a long side facing you and with dampened hands spread 1/2 cups vinegared rice onto it, leaving a 1-inch border along the top edge. Spread a small bit of the wasabi paste horizontally across the center of the rice. (Use the wasabi paste sparingly as it is very hot.) Arrange 3 avocado slices overlapping slightly in a horizontal line over the wasabi paste and top them with one sixth of the crab meat. Grasp the edges of the nori and the mat from the side facing you, lift the nori and the mat slightly, and roll the nori evenly and tightly away from you, pressing down slightly with each quarter turn. Seal the roll with a drop of water on the far edge of the nori, press the seam closed, and transfer the roll to a cutting board. Make 5 more rolls in the same manner. With a serrated knife dipped in hot water trim the ends of the rolls and cut each roll crosswise into six 1-inch sections.",
        "In a small serving bowl combine the soy sauce, the vinegar, and the rice wine.",
        "Arrange the rolls cut side up decoratively on a platter and serve them with the sauce."
    ],
    "ingredients": [
        "1 avocado, halved lengthwise, pitted, peeled and cut lengthwise into 1/8-inch slices",
        "3 tablespoons fresh lemon juice",
        "six 8 x 7-inch sheets of asakusa nori",
        "3 cups vinegared rice",
        "1 tablespoon wasabi powder, combined with 1 tablespoon cold water",
        "2 frozen Alaskan king crab legs, thawed, shelled, and thick sections halved lengthwise, or 3/4 pound frozen Alaskan king crab meat, thawed and drained",
        "1/4 cup soy sauce",
        "2 tablespoons rice wine or scotch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Cocktail Party",
        "Crab",
        "Avocado",
        "Healthy",
        "Gourmet"
    ],
    "title": "California Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/california-rolls-101544"
}
