{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).",
        "In a medium bowl, combine chopped walnuts, graham cracker crumbs, 1/4 cup sugar, and melted butter. Mix thoroughly, then press firmly into a 9 inch deep-dish pie pan. Bake in preheated oven for 8 minutes. Remove and cool.",
        "To Make Chocolate Layer: Place water in a small bowl and sprinkle gelatin over top. Set aside to soften. In a medium saucepan, mix together 3/4 cup sugar, cornstarch, and salt. Whisk in milk and cook over low heat, stirring constantly. When mixture comes to a boil, remove from heat.",
        "Place beaten egg yolks in a small bowl and gradually add 1/2 cup of hot milk mixture, whisking constantly. Whisk egg yolk mixture back into hot milk mixture. Return pan to heat and allow to boil 3 minutes, stirring constantly. Remove from heat and place 1 cup of mixture in a small bowl.",
        "Place chocolate pieces in a glass bowl and microwave at 30 second intervals, stirring at each interval, until chocolate is melted and smooth. Stir chocolate and coffee granules into separated custard. Allow this mixture to cool, then spread into bottom of crust. Place in refrigerator.",
        "To Make Rum Layer: Stir softened gelatin into remaining custard. Place a piece of plastic wrap directly on surface of custard and chill until firm.",
        "In a large glass or metal mixing bowl, beat egg whites with cream of tartar until foamy. Gradually add 1/2 cup sugar, continuing to beat until whites form stiff peaks. Whisk rum into chilled gelatin mixture, then fold in beaten egg whites. Spread mixture on top of chocolate layer. Chill pie at least 2 hours, until filling is set.",
        "Immediately before serving, whip cream until soft peaks form. Place whipped cream in a piping bag with a star tip and make 8 decorative swirls around edges of pie. Place a walnut half in the middle of each swirl. To cut pie, dip sharp knife in hot water."
    ],
    "ingredients": [
        "1 cup finely chopped walnuts",
        "1 cup graham cracker crumbs",
        "1/4 cup white sugar",
        "5 tablespoons butter, melted",
        "1/4 cup cold water",
        "1 tablespoon unflavored gelatin",
        "3/4 cup white sugar",
        "2 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "2 cups milk",
        "4 egg yolks, beaten",
        "1 cup semisweet chocolate chips",
        "2 teaspoons instant coffee granules",
        "4 egg whites",
        "1 dash cream of tartar",
        "1/2 cup white sugar",
        "2 tablespoons rum",
        "1/2 cup heavy cream",
        "8 walnut halves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "California Black Bottom Pie",
    "url": "http://allrecipes.com/recipe/17844/california-black-bottom-pie/"
}
