{
    "directions": [
        "Preheat the oven to 300 degrees F (150 degrees C).",
        "Place about 2 tablespoons of the chocolate chips into each of four 6 ounce ramekins. Place them in the microwave, and heat on full power for 30 second intervals. Stir, and continue heating until chocolate has melted. Spread to cover the sides and bottom of each ramekin.",
        "Bring a large pot of water to a boil.",
        "Meanwhile, in a saucepan, whisk together the cream, 1/4 cup sugar, and salt. Set over medium heat, and warm until steam rises from the surface. Then in a separate bowl, whisk together the egg yolks and vanilla. When the cream is hot, ladle a little bit into the egg yolks while whisking quickly. Ladle in a bit more to bring the yolks up to a high temperature without scrambling them. Whisk the yolk mixture into the rest of the cream. Ladle into the chocolate lined ramekins.",
        "Place a towel in the bottom of a baking dish, and place the filled ramekins on top of the towel. Place in the oven, and pour boiling water carefully into the baking dish until it comes half way up the sides of the ramekins. Cover the dish loosely with aluminum foil.",
        "Bake for 35 to 40 minutes in the preheated oven, just until the custard is set. Remove ramekins from the dish, and refrigerate for 4 to 6 hours.",
        "Before serving, sprinkle 1 tablespoon of sugar over the top of each creme brulee. Use a kitchen torch or your oven's broiler to caramelize the sugar. It may take 2 to 3 minutes in the broiler. Serve immediately."
    ],
    "ingredients": [
        "1/2 cup semi-sweet chocolate chips",
        "2 cups heavy cream",
        "1/4 cup white sugar",
        "1 pinch salt",
        "2 teaspoons vanilla extract",
        "5 egg yolks",
        "4 tablespoons white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cali's Sinful Creme Brulee",
    "url": "http://allrecipes.com/recipe/83905/calis-sinful-creme-brulee/"
}
