{
    "directions": [
        "Place cauliflower florets in a food processor; pulse into rice-sized pieces.",
        "Combine cauliflower \"rice\", black beans, cilantro, green onions, 1 tablespoon vegetable oil, lime juice, salt, and pepper in a microwave-safe bowl; toss until mixed. Top with Cheddar cheese.",
        "Puree chipotle peppers in adobo in a small bowl with an immersion blender.",
        "Heat remaining 1 tablespoon vegetable oil in a large skillet over medium heat. Add zucchini in an even layer; place kale on top. Cook, covered, until zucchini is lightly browned and kale starts to wilt, about 5 minutes. Stir in 1 to 3 tablespoons pureed chipotle peppers. Remove from heat and let stand, covered, allowing kale to steam, 3 to 5 minutes.",
        "Fill a saucepan with water and bring to a boil. Reduce heat, add eggs, and simmer, about 7 minutes. Remove eggs with a slotted spoon and run under cool water for 30 to 60 seconds. Peel carefully.",
        "Spoon zucchini mixture over Cheddar cheese in the bowl. Microwave until hot, 2 to 3 minutes. Top with peeled eggs and sliced avocado. Season with salt and pepper."
    ],
    "ingredients": [
        "1 head cauliflower, broken into florets",
        "1 (15 ounce) can black beans, drained and rinsed",
        "1 small bunch fresh cilantro, finely chopped",
        "2 green onions, chopped, or more to taste",
        "1 tablespoon vegetable oil",
        "1/2 lime, juiced",
        "1 pinch salt and ground black pepper to taste",
        "2 slices Cheddar cheese",
        "1 (7 ounce) can chipotle peppers in adobo sauce",
        "1 tablespoon vegetable oil",
        "1 zucchini, halved and sliced",
        "4 leaves Tuscan kale, stemmed and chopped",
        "2 eggs",
        "1 avocado, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "California/Mexican Cauliflower Rice with Avocado and Kale",
    "url": "http://allrecipes.com/recipe/254823/californiamexican-cauliflower-rice-w/"
}
