{
    "directions": [
        "Preheat oven to 375°F. Line 2 large baking sheets with aluminum foil. Brush squash flesh with 2 tablespoons oil. Place on prepared baking sheets, cut side down. Roast squash until very tender, about 1 hour. Cool 20 minutes. Remove seeds. Scoop out 6 cups squash pulp and transfer to large bowl (reserve any remaining squash for another use).",
        "Melt butter with remaining 2 tablespoons oil in heavy large pot over medium heat. Add onions, cinnamon sticks, bay leaves, salt, and pepper. Sauté until onions are soft, about 10 minutes. Add Calvados and simmer until almost all of liquid evaporates, about 1 minute. Discard cinnamon stick pieces and bay leaves. Add mixture to squash in large bowl and stir to combine. Working in batches, puree squash mixture in blender with chicken broth and evaporated milk until smooth. Strain into same pot, pressing on solids in strainer to extract as much liquid as possible.",
        "Mix sour cream, 1 tablespoon warm water, and ground cinnamon in medium bowl to blend. (Soup and cinnamon cream can be prepared 1 day ahead. Cool soup slightly, then cover and refrigerate. Cover and refrigerate cinnamon cream.)",
        "Bring soup to simmer. Ladle soup into bowls. Garnish each with dollop of cinnamon cream and serve."
    ],
    "ingredients": [
        "6 pounds butternut squash (about 2 very large), halved lengthwise",
        "4 tablespoons olive oil",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 onions, chopped",
        "2 cinnamon sticks, broken in half",
        "2 bay leaves, broken in half",
        "1 teaspoon coarse salt",
        "1/2 teaspoon ground black pepper",
        "1/2 cup Calvados (apple brandy) or brandy",
        "4 14-ounce cans low-salt chicken broth",
        "1 12-ounce can evaporated milk",
        "1/4 cup sour cream",
        "1 tablespoon warm water",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Onion",
        "Appetizer",
        "Bake",
        "Thanksgiving",
        "Butternut Squash",
        "Fall",
        "Cinnamon",
        "Calvados",
        "Sour Cream",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Calvados-Laced Squash Soup with Cinnamon and Bay Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/calvados-laced-squash-soup-with-cinnamon-and-bay-leaves-107250"
}
