{
    "directions": [
        "Pour 1 1/2 cups warm water into large bowl. Stir in yeast. Let stand until yeast dissolves, about 5 minutes. Mix in oil and salt. Add 3 3/4 cups flour, about 1/2 cup at a time, stirring until blended. Turn dough out onto floured surface. Knead until smooth and elastic, sprinkling with more flour if sticky, about 10 minutes.",
        "Place dough in oiled large bowl; turn to coat. Cover bowl with plastic wrap. Let dough rise in warm draft-free area until doubled, about 1 hour 15 minutes.",
        "Meanwhile, char bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel, seed and slice pepper. Heat olive oil in heavy large skillet over medium-high heat. Add red onions; sauté until brown, about 25 minutes. Set aside. Sauté sausage in heavy medium skillet over medium heat until cooked through, breaking into 1/2-inch pieces with spoon, about 15 minutes. Set aside. Mix both cheeses and oregano in bowl, season with salt and pepper.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 400°F. Dust 2 baking sheets with flour.",
        "Punch dough down. Knead on lightly floured surface until smooth, about 1 minute. Divide into 4 equal portions; shape each into ball. Roll out dough balls on lightly floured surface to 9-inch rounds. Spread 1/3 cup cheese mixture over half of each round, leaving 3/4-inch border. Cover cheese on each with 1/4 of onions, 1/3 cup cheese mixture, 1/4 of sausage, 1/3 cup cheese mixture, then 1/4 of bell peppers. Fold plain dough halves over filling, forming half circles. Pinch edges of dough firmly together to seal.",
        "Using spatula, transfer 2 calzones to each prepared sheet. Pierce tops in several places with small knife. Bake calzones 15 minutes. Reverse baking sheets and bake until tops of calzones are golden brown, about 15 minutes longer."
    ],
    "ingredients": [
        "1 1/2 cups warm water (105°F to 115°F.)",
        "1 envelope dry yeast",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons salt",
        "4 cups (about) all purpose flour",
        "1 large red bell pepper",
        "2 tablespoons olive oil",
        "1 1/4 pounds red onions, sliced",
        "4 sweet or spicy Italian sausages, casings removed",
        "3 cups (packed) coarsely grated mozzarella cheese (about 12 ounces)",
        "12 ounces ricotta cheese",
        "4 teaspoons dried oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pepper",
        "Pork",
        "Bake",
        "Spring"
    ],
    "title": "Calzones with Cheese, Sausage and Roasted Red Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/calzones-with-cheese-sausage-and-roasted-red-pepper-100967"
}
