{
    "directions": [
        "Heat oil in a large pot over medium-high. Cook chorizo and mushrooms, stirring occasionally, until chorizo is beginning to brown and mushrooms release their juices and then evaporate, about 10 minutes. Stir in kale, sauce, and oregano; season with salt. Cover and cook until kale is wilted, about 2 minutes. Toss to combine, then remove from heat and let cool.",
        "Line 2 rimmed baking sheets with parchment. Cut dough into 8 equal portions (each should weigh 4 oz.) and roll into balls. Working one at a time, roll out on a lightly floured surface to a 7 1/2–8\"-diameter circle. Transfer 1/2 cup filling and 1/2 cup cheese to center of circle. Using a pastry brush or your finger, brush water around edges of circle, then fold dough in half over filling to create a half moon. Using a fork, press edges to seal. Transfer to prepared sheet. Repeat with remaining dough, filling, and cheese.",
        "Whisk egg and milk in a small bowl. Brush tops of pizza pockets with egg wash.",
        "If baking immediately, preheat oven to 350°F. If freezing to bake later, freeze on baking sheets 1 hour, then transfer to resealable plastic bags and freeze up to 3 months.",
        "Bake pizza pockets on parchment-lined rimmed baking sheets until tops are golden brown, about 30 minutes for fresh and about 40 minutes for frozen.",
        "Filling can be made 1 day ahead; transfer to an airtight container and chill. Pockets can be assembled 3 months ahead; keep frozen."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "4 links fully cooked chorizo sausage (not dried, about 13 ounces), thinly sliced into coins",
        "8 ounces crimini mushrooms, thinly sliced",
        "1 large or 2 small bunches curly kale, ribs and stems removed, coarsely chopped",
        "1 1/4 cups marinara sauce",
        "1 1/2 teaspoons dried oregano",
        "3/4 teaspoon kosher salt",
        "2 pounds fresh pizza dough",
        "All-purpose flour (for rolling)",
        "1 pound shredded mozzarella (about 4 cups)",
        "1 large egg",
        "1 tablespoon milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Freezer Food",
        "Bake",
        "Dinner",
        "Kid-Friendly",
        "Pizza",
        "Mushroom",
        "Sausage",
        "Kale"
    ],
    "title": "Calzones With Chorizo and Kale",
    "url": "http://www.epicurious.com/recipes/food/views/calzones-with-chorizo-and-kale"
}
