{
    "directions": [
        "Combine chicken broth, lemon juice, lemon zest, garlic, lime juice, lime zest, peppercorns, soy sauce, ginger, fish sauce, and chile pepper in a large pot.",
        "Remove tough outer stalks from lemongrass. Halve inner stalks and cut into 3-inch peaches. Place in a resealable plastic bag and pound with a hammer until bruised.",
        "Fill bag with water and pour into the pot. Bring soup to a boil; reduce heat and simmer until flavors combine, about 20 minutes. Strain with a small mesh strainer, discarding solids. Pour strained liquid back into the pot.",
        "Stir chicken, green onions, carrot, cabbage, mung bean sprouts, Chinese mushrooms, cilantro, Thai basil, and mint into the soup. Simmer over medium heat until carrot is tender, about 10 minutes.",
        "Spoon 1 teaspoon garlic chile paste into the bottom of each serving bowl and ladle soup on top."
    ],
    "ingredients": [
        "Soup Base:",
        "4 cups chicken broth",
        "2 lemons, zested and juiced",
        "1 head garlic, minced",
        "1 lime, zested and juiced",
        "10 whole black peppercorns",
        "1 teaspoon soy sauce",
        "1 (1/2 inch) piece fresh ginger, peeled and thinly sliced",
        "4 dashes fish sauce",
        "1 dried red chile pepper",
        "4 stalks lemongrass, trimmed",
        "water",
        "8 ounces cubed cooked chicken",
        "6 green onions, thinly sliced",
        "1 carrot, cut into matchsticks, or to taste (optional)",
        "1 cup thinly sliced cabbage, or to taste (optional)",
        "1 cup mung bean sprouts, or to taste (optional)",
        "dried Chinese mushrooms, or to taste (optional)",
        "3 tablespoons chopped cilantro",
        "3 tablespoons chopped Thai basil",
        "2 tablespoons chopped mint",
        "4 teaspoons garlic chile paste, or to taste, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cambodian Lemongrass Chicken Soup",
    "url": "http://allrecipes.com/recipe/247324/cambodian-lemongrass-chicken-soup/"
}
