{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 11X17-inch baking pan with 1-inch high sides.",
        "Beat 1 1/2 cups sugar and butter together in a large bowl with an electric mixer on medium speed until light and fluffy. Beat one egg at a time into the butter mixture; beat in sour cream and 2 teaspoons vanilla extract.",
        "Sift flour, baking powder, baking soda, and salt together in a bowl. With mixer at low speed, add flour mixture to butter mixture alternately with milk just until combined. Scrape sides and bottom of bowl and finish mixing with a rubber spatula. Pour batter into prepared pan; spread to corners of pan and smooth top with a spatula.",
        "Bake in the preheated oven until a toothpick inserted near the center comes out clean, about 20 minutes. Cool cake completely, about 30 minutes. To remove cake from pan, run a paring knife between cake and pan. Cover cake pan with plate or cooling rack; invert to transfer cake onto plate.",
        "Beat cream cheese, 1/2 cup sugar, and 1 teaspoon vanilla extract together in a bowl with an electric mixer on medium speed until fluffy, about 2 minutes. Reduce mixer speed to low; slowly pour in cream. Once cream is incorporated, turn mixer speed to medium-high; beat until stiff peaks form, about 2 minutes.",
        "Spread cream cheese mixture evenly over top and sides of cake, smoothing the top. Place 2 to 3 rows of overlapping strawberry slices parallel to short sides of cake for the two red stripes of the Canada flag. Trace out a maple leaf shape in center of cake with a toothpick; use points of strawberry slices to create points of maple leaf. Cut a strip of strawberry for the leaf stem; fill in the area of the maple leaf with sliced strawberries. Refrigerate cake until ready to serve."
    ],
    "ingredients": [
        "Cake:",
        "1 1/2 cups white sugar",
        "1 cup butter, softened",
        "3 eggs, at room temperature",
        "1/2 cup sour cream, at room temperature",
        "2 teaspoons vanilla extract",
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 pinch salt",
        "1 cup milk, at room temperature",
        "Frosting:",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "2 cups heavy whipping cream",
        "Decoration:",
        "2 cups sliced fresh strawberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canadian Flag Cake",
    "url": "http://allrecipes.com/recipe/244453/canadian-flag-cake/"
}
