{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spread walnuts onto a baking sheet.",
        "Toast walnuts in the preheated oven until nuts turn golden brown and become fragrant, about 5 minutes. Watch carefully; nuts can burn quickly. Set aside to cool to room temperature.",
        "Increase oven temperature to 375 degrees F (190 degrees C).",
        "Place 3 tablespoons flour, 3 tablespoons brown sugar, and 1/2 cup cooled walnuts in a small bowl. Cut in 2 tablespoons butter using two knives or a pastry blender until mixture resembles coarse crumbs.",
        "Whisk together 2 cups flour, 2 tablespoons brown sugar, baking powder, and salt. Cut in 1/2 cup butter using two knives or a pastry blender until mixture resembles fine crumbs. Stir in remaining 1/2 cup walnuts.",
        "Whisk together 1/3 cup maple syrup and egg in a small bowl; stir into flour mixture. Gradually stir in just enough milk for the dough to leave the sides of the bowl and form a ball.",
        "Place dough on a lightly floured surface. Roll gently in flour to coat; knead lightly about 10 times. Pat into an 8-inch circle on an ungreased baking sheet. Brush with milk; sprinkle evenly with topping. Score dough circle into 8 wedges with a knife, but do not separate wedges.",
        "Bake in the preheated oven until golden brown, about 15 minutes. Remove immediately from the baking sheet, and separate the scones. Serve warm with whipped cream and maple syrup."
    ],
    "ingredients": [
        "1 cup coarsely chopped walnuts, divided",
        "Topping:",
        "3 tablespoons all-purpose flour",
        "3 tablespoons packed light brown sugar",
        "2 tablespoons cold butter",
        "Scones:",
        "2 cups all-purpose flour",
        "2 tablespoons packed light brown sugar",
        "2 teaspoons baking powder",
        "1/8 teaspoon salt",
        "1/2 cup cold butter",
        "1/3 cup maple syrup, or as needed",
        "1 egg",
        "2 tablespoons milk, or as needed",
        "1 cup whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canadian Maple Scones",
    "url": "http://allrecipes.com/recipe/234050/canadian-maple-scones/"
}
