{
    "directions": [
        "Whisk brown sugar, sea salt, 1/2 teaspoon garlic powder, onion powder, 1/2 teaspoon paprika, 1/4 teaspoon black pepper, dry mustard, and fennel seeds together in a small bowl.",
        "Pat pork loin chops dry with a paper towel. Score the meat on both sides, 1/8-inch deep in cross-hatch lines spaced 1/2-inch apart, with a sharp knife; rub spice mixture onto all sides of pork chops and into scored lines. Cover chops; refrigerate for 4 to 6 hours.",
        "Whisk maple syrup, brown mustard, pinch of garlic powder, pinch of paprika, pinch of black pepper, and cayenne pepper together in a small bowl; set aside.",
        "Coat pork chops on all sides with seasoned bread crumbs.",
        "Heat olive oil and canola oil in a large skillet over medium-high heat. Stir garlic into pan, and cook until lightly browned and fragrant, about 1 minute; remove garlic from pan and discard.",
        "Place pork chops into skillet in batches to avoid crowding; cook chops until lightly browned, 2 to 3 minutes per side. Return all pork chops to skillet; reduce heat to medium. Drizzle half the maple syrup mixture over pork chops. Turn chops and cook until glazed, 1 to 2 minutes. Drizzle remaining maple syrup mixture over pork chops; turn and cook until glazed, 1 to 2 minutes.",
        "Reduce heat to low; cover pork chops and cook until slightly pink in the center, about 5 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."
    ],
    "ingredients": [
        "Spice Rub:",
        "1 1/2 tablespoons brown sugar",
        "1 1/2 teaspoons sea salt",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon paprika",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon dry mustard",
        "1/4 teaspoon crushed fennel seeds",
        "6 boneless pork loin chops, 1/2 inch thick",
        "Glaze:",
        "1/4 cup pure maple syrup, preferably dark amber (Grade B)",
        "2 tablespoons spicy brown mustard",
        "1 pinch garlic powder",
        "1 pinch paprika",
        "1 pinch freshly ground black pepper",
        "1 pinch cayenne pepper (optional)",
        "1/2 cup seasoned bread crumbs",
        "1 tablespoon olive oil",
        "1 tablespoon canola oil",
        "1 clove clove garlic, crushed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canadian Pork Loin Chops",
    "url": "http://allrecipes.com/recipe/244346/canadian-pork-loin-chops/"
}
