{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Lightly coat a 9x13 inch pan with olive oil.",
        "Heat oil in a frying pan over medium-high  heat. Cook onions and garlic in oil until tender and semi-transparent. Stir in mushrooms, and cook until soft. Remove from heat.",
        "In a sauce pan, combine spinach and 1/4 cup water. Cover, and cook over medium heat until wilted. Drain. In a large bowl, mix together spinach, onion mixture, and ricotta cheese.",
        "In a frying pan, brown moose meat over medium-high heat, stirring frequently. When the pink color is almost gone, stir in the cocoa and brown sugar. This removes the gamey-ness. Once the meat is well browned, drain to remove excess grease. Stir in spaghetti sauce and water, and season with oregano, Italian seasoning, and salt and pepper.",
        "Ladle enough of the meat sauce into a 9x13 inch baking dish to cover the bottom in a thin layer. Arrange a single  layer of oven ready noodles over the sauce. Spread one half of the ricotta cheese mixture over the noodles, and top with some of the tomato sauce and a sprinkle of parmesan and mozzarella cheese. Repeat with remaining ingredients, ending with a generous layer of mozzarella cheese. Cover pan with aluminum foil.",
        "Bake for 45 minutes, or until lasagna is hot and bubbly."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, minced",
        "2 cloves garlic, minced",
        "4 mushrooms, sliced",
        "1 bunch spinach, washed and chopped",
        "1 (16 ounce) container ricotta cheese",
        "1 pound ground moose",
        "1/2 teaspoon unsweetened cocoa powder",
        "1/2 teaspoon brown sugar",
        "1 (24 ounce) jar spaghetti sauce",
        "3/4 cup water",
        "1 tablespoon dried oregano",
        "1 tablespoon Italian seasoning",
        "salt and ground black pepper to taste",
        "1 (9 ounce) package no-boil lasagna noodles",
        "1 1/2 cups shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canadian Moose Lasagna",
    "url": "http://allrecipes.com/recipe/136470/canadian-moose-lasagna/"
}
