{
    "directions": [
        "Line a baking sheet with parchment paper. Combine sugar and 3 tablespoons water in a large wide pot over medium heat and cook, stirring frequently, until sugar is dissolved. Continue cooking, stirring frequently, until liquid simmers briskly, top is covered with bubbles, and sugar is just starting to crystallize, about 2 minutes.",
        "Add pecans and skinned almonds; stir quickly to coat nuts evenly. Continue to stir until sugar is crystallized and very dry, about 2 minutes. Pour nuts onto prepared baking sheet; let cool slightly. Wash pot.",
        "Break up any nuts that have clumped together. Place in a sieve; shake off excess sugar. Set a clean sheet of parchment on baking sheet. Return nuts to pot; cook over medium heat, stirring frequently, until sugar starts to melt. Reduce heat to low; stir frequently until sugar is melted and nuts are nicely glazed, about 25 minutes.",
        "Remove pot from heat; stir in rosemary, butter, coriander, and cayenne. Transfer to prepared baking sheet; let cool slightly.",
        "Transfer candied nuts to a large mixing bowl, breaking up clumps. Add smoked almonds. Toss well; season to taste with salt. DO AHEAD: Nuts can be made 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 cup sugar",
        "6 ounces pecan halves (about 1 1/2 cups)",
        "6 ounces roasted skinned almonds, preferably Marcona (not in oil; about 1 1/2 cups)",
        "1/4 cup fresh rosemary leaves",
        "1 tablespoon unsalted butter",
        "2 teaspoons ground coriander",
        "1/2 teaspoon cayenne pepper",
        "4 ounces smoked almonds (about 1 cup)",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Christmas",
        "Vegetarian",
        "High Fiber",
        "Tree Nut",
        "Almond",
        "Pecan",
        "Edible Gift",
        "Coriander"
    ],
    "title": "Candied Nuts with Smoked Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/candied-nuts-with-smoked-almonds-51133440"
}
