{
    "directions": [
        "Using a sharp knife, cut a thin slice from the top and bottom of each grapefruit to reveal the flesh. From the top to the bottom, score through the outer peel and thick white pith to the flesh, spacing the cuts about 1 inch apart. Peel the grapefruits. Cut each peel section lengthwise into long strips about 1/4 inch wide. (Reserve the flesh for another use.)",
        "In a large saucepan, combine the peels with water to cover by 2 inches. Bring to a boil over high heat, then reduce the heat to medium. Simmer, uncovered, until only about 1 inch of water remains, about 1 hour. The peels will begin to soften and become translucent. Drain.",
        "When the peels are almost ready, in another saucepan, combine the 2 cups water and 1 cup of the sugar. Bring to a boil over high heat and stir to dissolve the sugar, 3 to 4 minutes. Remove from the heat and stir the drained, still-warm peels into the syrup. Let stand for 6 to 8 hours at room temperature.",
        "Return the pan to low heat, bring to a simmer, and cook until the peels have absorbed most of the syrup, about 30 minutes. During the last stages of cooking, watch carefully to prevent scorching or burning.",
        "Using a slotted spoon, transfer the peels to a sheet of waxed paper, spreading them out in a single layer. Let stand for about 12 hours to dry slightly.",
        "Place the remaining 1/2 cup sugar in a small, shallow bowl. Roll the peels, one at a time, in the sugar to coat. Arrange in a single layer on a fresh piece of waxed paper and let dry for a few hours more.",
        "Store in layers, separated by waxed paper, in an airtight container at room temperature for up to 2 months. Makes about 36 pieces.",
        "Adapted from Williams-Sonoma",
        "Holiday Entertaining,",
        "by Georgeanne Brennan (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 large grapefruits, ruby red or other variety",
        "2 cups water",
        "1 1/2 cups sugar"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Candied Grapefruit Peel",
    "url": "http://www.williams-sonoma.com/recipe/candied-grapefruit-peel.html"
}
