{
    "directions": [
        "Using 5-hole citrus zester, remove lemon peel in long thin strips. Halve lemons. Squeeze juice into medium bowl; strain. Combine 1 1/3 cups lemon juice, lemon peel strips, and 2 cups sugar in medium saucepan. Bring to simmer over medium heat, stirring until sugar dissolves. Simmer gently until liquid is slightly syrupy, about 10 minutes. Strain through sieve into bowl, reserving lemon peel and syrup separately. Transfer peel to small baking pan; add 1/3 cup sugar and toss to coat. Separate pieces with fork. Let dry 2 hours. Reserve 1/4 cup candied lemon peel strips. Coarsely chop remaining candied peel.",
        "Whisk 1 cup syrup and yolks in large bowl to blend (cover and chill remaining syrup). Bring cream, half and half and salt to simmer in medium saucepan over medium heat. Gradually whisk hot cream mixture into egg mixture. Return to saucepan. Whisk over medium heat until temperature registers 180°F, about 6 minutes (do not boil). Strain custard into large bowl. Chill until cold.",
        "Process custard in ice cream maker according to manufacturer's instructions; add chopped candied peel during last 5 minutes. Transfer ice cream to bowl. Cover and freeze 4 hours. (Syrup, candied peel and ice cream can be made 2 days ahead. Keep syrup refrigerated. Store peel airtight at room temperature. Keep ice cream frozen.)",
        "Stir 1/2 cup syrup in saucepan over medium heat until heated through. Add strawberries. Refrigerate compote at least 4 hours and up to 8 hours.",
        "Scoop ice cream into bowls. Top with compote and candied lemon strips."
    ],
    "ingredients": [
        "10 large lemons",
        "2 1/3 cups sugar",
        "8 large egg yolks",
        "4 cups whipping cream",
        "3 cups half and half",
        "1/4 teaspoon salt",
        "16 ounces strawberries, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Easter",
        "Kentucky Derby",
        "Strawberry",
        "Lemon",
        "Spring"
    ],
    "title": "Candied Lemon Peel Ice Cream with Strawberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/candied-lemon-peel-ice-cream-with-strawberry-compote-106438"
}
