{
    "directions": [
        "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the sweet potato cubes, cover, and steam until just tender, 15 to 20 minutes depending on thickness. Remove the sweet potato from the steamer and allow to cool. Transfer the cooled sweet potato to a blender. Pour in the orange juice. Cover blender, and puree until smooth. If mixture is too thick, add more orange juice, 1 tablespoon at a time, until the sweet potato is blended.",
        "Preheat the oven to 350 degrees F (175 degrees C). Line 48 muffin cups with paper muffin liners.",
        "Beat 1 cup butter, light brown sugar, and white sugar with an electric mixer in a large bowl until light and fluffy. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in 2 teaspoons of vanilla extract with the last egg, then stir in the sweet potato puree and orange zest.",
        "Sift together the flour, baking powder, cinnamon, ginger, baking soda, and salt in a bowl. Mix the flour mixture into the sweet potato mixture, 1 cup at a time, mixing until just blended. Batter will be thick. Spoon the batter into the prepared muffin tins.",
        "Bake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 18 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "To make frosting: Sift the confectioners' sugar into a large bowl; set aside. Heat the brown sugar, heavy cream, and 1/4 cup butter in a saucepan over low heat until sugar dissolves, stirring occasionally. Increase heat to medium high and bring to a boil, stirring constantly. Boil until the brown sugar mixture thickens, about 3 minutes. Remove from heat, then stir in 1/4 teaspoon of vanilla extract. Whisk the brown sugar mixture into the confectioners' sugar until smooth, 1 to 2 minutes. Allow the sugar mixture to cool and thicken before icing the cooled cupcakes."
    ],
    "ingredients": [
        "2 pounds sweet potatoes, peeled and cubed",
        "1/2 cup orange juice, or as needed",
        "1 cup butter at room temperature",
        "1 cup light brown sugar",
        "1 cup white sugar",
        "4 eggs at room temperature",
        "2 teaspoons vanilla extract",
        "1 large orange, zested",
        "3 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground ginger",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup confectioners' sugar, sifted",
        "3/4 cup packed dark brown sugar",
        "1/2 cup heavy cream",
        "1/4 cup unsalted butter",
        "1/4 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Candy'D Sweet Potato Cupcakes with Brown Sugar Icing",
    "url": "http://allrecipes.com/recipe/219673/candyd-sweet-potato-cupcakes-with-br/"
}
