{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line 24 cupcake cups with paper liners.",
        "Place cake mix in a bowl, and pour in water and vegetable oil; add 3 eggs. With electric mixer on low speed, beat the cake mix with water, oil, and eggs until thoroughly combined, about 2 minutes. Pour half the cake mix into a second bowl; divide the remaining cake mix in half, and place into 2 separate small bowls.",
        "Color the largest portion of the cake mix orange by mixing in 4 drops of red food coloring and 6 drops of yellow food coloring. Into a second, smaller bowl of cake mix, mix in 10 drops of red food coloring, 12 drops of yellow food coloring, and 6 drops of green food coloring, to color that bowl brown. Into the last remaining small bowl of cake mix, stir in 5 drops of yellow food coloring to color that bowl yellow.",
        "Spoon yellow cake batter into the bottoms of 12 prepared cupcake cups, filling them about 1/3 full. Spoon the brown batter into the bottoms of the remaining 12 prepared cupcake cups, filling them about 1/3 full. Spoon orange cupcake mix over the yellow and brown layers, filling the cupcakes about 2/3 full. Try not to jar or shake the filled cupcakes, to avoid mixing layers.",
        "Carefully place cupcakes into the preheated oven, and bake until a toothpick inserted into the center of a cupcake comes out clean, 18 to 22 minutes. Allow to cool.",
        "Frost each cooled cupcake with the white frosting; place a piece of yellow, orange, and white candy corn on top of each yellow and orange cupcake. Place a brown, orange, and white piece of candy corn on top of each brown and orange cupcake."
    ],
    "ingredients": [
        "1 (18.25 ounce) package white cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "14 drops red food coloring, or as needed - divided",
        "22 drops yellow food coloring, or as needed - divided",
        "6 drops green food coloring, or as needed",
        "2 cups prepared white frosting",
        "12 pieces of yellow, orange, and white candy corn",
        "12 pieces of brown, orange, and white candy corn"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Candy Corn Cupcakes",
    "url": "http://allrecipes.com/recipe/219293/candy-corn-cupcakes/"
}
