{
    "directions": [
        "Combine the sugar, vegetable oil, water, soy sauce, vinegar, and salt in a skillet just large enough to hold the sweet potato chunks in a single layer. Place over medium-high heat and bring to a simmer. Arrange the sweet potatoes in the pan in a single layer and cover with a circle of parchment paper to keep the surface moist. Lower the heat to maintain a very gentle simmer and cook for 2 minutes. Cover the skillet with a lid (keep the parchment in place) and cook for another 2 to 3 minutes, or until the potatoes are tender. A toothpick inserted into the thickest part of a piece should meet no resistance. If the chunks are not yet tender, add a bit more water and simmer for another minute or two. Check to make sure the sugar doesn't burn.",
        "Once the potatoes are tender, remove the lid and parchment and jiggle the skillet to allow the potato chunks to roll around in the rapidly reducing glaze (the vinegar, by the way, will keep the sugar from seizing after the glaze has cooled). After 6 minutes or so, the water and oil in the skillet will have separated and most of the water will have evaporated, enabling you to remove the lightly glazed sweet potato chunks with little or no oil clinging to them.",
        "Transfer the glazed chunks to a plate, spreading them out in a single layer. Sprinkle with the black sesame seeds. Let cool to room temperature before serving. They keep at cool room temperature for 6 to 8 hours. If you will be keeping them longer, place them in a covered container and refrigerate for up to 2 days. For optimal texture, bring the potatoes back to room temperature before serving."
    ],
    "ingredients": [
        "1/4 cup granulated or packed light brown sugar",
        "1/4 cup vegetable oil",
        "2 tablespoons water",
        "1 teaspoon soy sauce",
        "1 teaspoon rice vinegar",
        "1/2 teaspoon salt",
        "2 large Japanese-style sweet potatoes, about 1 pound total weight, unpeeled, cut ran-giri style into chunks",
        "1 to 1 1/2 tablespoons black sesame seeds, freshly dry-roasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Vegetarian",
        "Sweet Potato/Yam",
        "Healthy",
        "Soy Sauce",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Candied Sweet Potato",
    "url": "http://www.epicurious.com/recipes/food/views/candied-sweet-potato-363149"
}
