{
    "directions": [
        "Scrub the oranges, then remove the peel in quarters. To do this, cut through the peel with a sharp knife, going right around the orange, starting and finishing at the stem end, then repeat at a right angle to the first cut. Remove the peel, with the attached pith, from the fruit. Weigh out 9 ounces of peel and cut it into slices measuring about 1/4 by 2 inches.",
        "Put the orange peel slices into a large pan and cover with 8 cups of cold water. Bring to a boil and simmer for 5 minutes. Drain and return to the pan with 4 cups of cold water. Bring to a boil and simmer, covered, for 45 minutes. Add the sugar and stir until dissolved (it won’t take long). Simmer, covered, for 30 minutes. Remove from the heat and let stand for 24 hours.",
        "Bring the pan to a boil again. Add the corn syrup, if using, and boil gently, uncovered, for 30 minutes, or until all the liquid has evaporated and the orange sticks are coated with bubbling orange syrup. Remove from the heat and allow to cool. Using a pair of tongs (or your fingers), carefully remove the orange sticks and place on a wire rack with a tray underneath to catch the drips. Leave in a warm place for 24 hours, or place in a very low oven at approximately 140°F for 2 to 3 hours to dry.",
        "Break the chocolate into pieces, put into a heatproof bowl over a pan of simmering water, and leave until melted. Remove from the heat. Dip one half of each orange stick in the melted chocolate and place on a sheet of parchment or waxed paper to dry.",
        "Before dipping, the sticks will keep well for 3 to 4 months. Once they have their chocolate coating, they are best eaten within 3 weeks."
    ],
    "ingredients": [
        "4 or 5 large oranges",
        "2 1/2 cups granulated sugar",
        "1 tablespoon corn syrup (optional)",
        "7 ounces good dark chocolate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Orange",
        "Simmer",
        "Boil"
    ],
    "title": "Candied Orange Sticks",
    "url": "http://www.epicurious.com/recipes/food/views/candied-orange-sticks-363473"
}
