{
    "directions": [
        "Combine Port, figs and cloves in heavy medium saucepan and bring to boil. Reduce heat to medium-low, cover and simmer until figs soften, about 20 minutes. Cool. Discard cloves.",
        "Position rack in center of oven and preheat to 350°F. Combine vanilla wafers and hazelnuts in processor and grind finely. Add butter and process until moist crumbs form. Press crumbs onto bottom and halfway up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Freeze crust 20 minutes. Spread fig mixture onto bottom of crust.",
        "Using electric mixer, beat cream cheese and 1 1/2 cups sugar in large bowl until smooth. Add eggs 1 at a time, beating just until blended after each addition. Mix in liqueur, vanilla and peel. Spoon filling over fig mixture in crust. Gently shake pan to distribute filling.",
        "Bake cheesecake until filling is golden around the edges and center moves only slightly when pan is shaken, about 1 hour 5 minutes. Transfer to rack. Press down edges of cake to flatten if necessary. Maintain oven temperature.",
        "Combine sour cream and remaining 3 tablespoons sugar in small bowl. Spread mixture evenly over top of cake. Return to oven and bake 10 minutes. Transfer cheesecake to rack. Run small sharp knife around sides of cheesecake. Cool. Refrigerate cake overnight. (Can be prepared 2 days ahead. Keep chilled.",
        "Release pan sides from cake; transfer cake to platter. Cut 5 slices from orange. Cut each slice in half. Cut each fig lengthwise into 5 slices. Arrange orange slices, cut side toward center, around top edge of cake. Place fig slice atop each orange slice. Place hazelnuts between orange slices. Serve with sauce.",
        "Stir Port and sugar in heavy small saucepan over low heat until sugar dissolves. Increase heat to medium-high and boil until mixture is reduced to 1 cup, about 13 minutes. Mix water and cornstarch in small bowl. Whisk into Port mixture and boil until slightly thickened, stirring constantly, about 1 minute. Cool. (Can be made 2 days ahead. Cover and chill. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "1 1/2 cups tawny Port",
        "1 cup chopped dried Calimyrna figs",
        "6 whole cloves",
        "18 vanilla wafer cookies",
        "1 cup hazelnut, toasted (about 5 ounces)",
        "3 tablespoon unsalted butter, melted",
        "4 8-ounce packages of cream cheese, room temperature",
        "1 1/2 cups plus 3 tablespoons sugar",
        "4 large eggs",
        "1/4 cup Frangelico (hazelnut liqueur)",
        "2 teaspoons vanilla extract",
        "3 teaspoons grated orange peel",
        "1 cup sour cream",
        "1 orange",
        "2 dried figs",
        "10 hazelnuts",
        "2 cups tawny Port",
        "1/2 cups sugar",
        "1 tablespoon water",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Orange",
        "Fig",
        "Port",
        "Winter",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Candied Fig, Hazelnut and Orange Cheesecake with Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/candied-fig-hazelnut-and-orange-cheesecake-with-port-sauce-540"
}
