{
    "directions": [
        "Combine beans with enough water to cover by 2 inches in a 4-to 5-quart pot. Bring to a boil and boil 2 minutes, then remove from heat and let stand, covered, while you cook the pork.",
        "Bring pork and water (4 quarts) to a simmer in an 8-to 10-quart heavy pot. Skim any foam, then add bay leaves and oregano. Simmer, uncovered, 1 1/4 hours.",
        "Drain beans and add to pork mixture along with onions, garlic, rosemary, and 1 tsp each of salt and pepper. Simmer, uncovered, stirring occasionally, until beans are just tender, 35 to 45 minutes.",
        "While beans simmer, preheat oven to 475°F with rack in upper third. Toss tomatoes with oil and spread out, cut sides up, in a large 4-sided sheet pan. Stir together sugar, 1/2 teaspoon salt, and 1/2 teaspoon pepper and sprinkle over tomatoes. Roast until tomatoes begin to shrivel and caramelize on bottom, about 45 minutes.",
        "When beans are tender, scoop out about 4 cups beans with a slotted spoon and coarsely mash.",
        "Return mashed beans to stew along with tomatoes, parsley, and 1 teaspoon salt and simmer 3 minutes. Discard bay leaves and season stew with salt and pepper."
    ],
    "ingredients": [
        "2 pounds dried white beans, such as cannellini or Great Northern (4 3/4 cups), picked over and rinsed",
        "5 pounds boneless pork shoulder, trimmed and cut into 1½-inch pieces",
        "4 quarts water",
        "2 Turkish bay leaves or 1 California",
        "1 teaspoon dried oregano",
        "2 medium onions, chopped",
        "3 tablespoons finely chopped garlic",
        "4 teaspoons finely chopped rosemary",
        "1 1/2 pounds cherry tomatoes, halved",
        "2 tablespoons olive oil",
        "1 teaspoon sugar",
        "6 cups flat-leaf parsley (from 3 bunches), very coarsely chopped",
        "Accompaniment: extra-virgin olive oil for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Pork",
        "Dinner",
        "Rosemary",
        "Fall",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cannellini with Pork and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/cannellini-with-pork-and-rosemary-350926"
}
