{
    "directions": [
        "Melt butter in a saucepan over medium heat. Stir in flour, and cook until the flour turns from white to a pale beige color, 3 to 4 minutes. Whisk in the milk; cook and stir until the milk has thickened and the flour no longer tastes grainy, about 7 minutes. Remove from the heat and whisk in mozzarella cheese until melted and smooth, then whisk in parsley and egg yolks; set aside and allow to cool.",
        "Heat olive oil in a large skillet over medium heat; stir in leeks and garlic and cook until the leek has softened and turned translucent, about 4 minutes. Pour in white wine, and allow to cook until evaporated. Mix the leeks together with the eggplant, mushrooms, and ground chicken in a medium bowl. Season with rosemary, Italian seasoning, salt, and pepper; mix until evenly blended and set aside.",
        "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 2 to 3 minutes or until al dente; drain and rinse under cold running water to chill, set aside.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Spread about 1 cup of the white sauce in the bottom of a 9x13 inch glass baking dish. Assemble the cannelloni by placing a small amount of filling onto a pasta square, then rolling it into a firm cylinder. Place the cannelloni into the baking dish as you make them. Pour the remaining white sauce overtop, making sure that none of the pasta is uncovered. Sprinkle with Parmesan cheese.",
        "Bake in preheated oven until the filling has firmed and the sauce has turned bubbly and golden brown. The cannelloni will be ready when the filling reaches 165 degrees F (75 degrees C)."
    ],
    "ingredients": [
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "12 ounces shredded mozzarella cheese",
        "1/2 cup chopped Italian flat leaf parsley",
        "2 egg yolks",
        "Filling:",
        "2 tablespoons olive oil",
        "2 leeks, finely chopped",
        "2 teaspoons minced garlic",
        "1/2 cup white wine",
        "1 large eggplant, finely chopped",
        "2 portobello mushrooms, chopped",
        "1 pound ground chicken",
        "2 teaspoons minced fresh rosemary",
        "4 teaspoons Italian seasoning",
        "salt and pepper to taste",
        "1 pound fresh pasta sheets, cut into 4 inch squares",
        "1 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cannelloni Tre Sapori",
    "url": "http://allrecipes.com/recipe/139104/cannelloni-tre-sapori/"
}
