{
    "directions": [
        "Fill a large pot with water; bring to a boil. Fill a bowl with ice water. Place tomatoes into the boiling water, working in batches, 30 to 45 seconds. Remove from the boiling water; plunge into ice water. Peel off tomato skins; cut in half. Remove the seeds using your finger or a spoon. Place in a colander to drain.",
        "Heat olive oil in a skillet over medium heat; place onion into the skillet. Cook and stir until the onions become translucent, about 5 minutes.",
        "Combine tomatoes, onion, lemon juice, red wine, garlic, celery, basil, red sweet pepper, salt, bay leaves, and ground black pepper in a large pot over medium heat; cook and stir over until tomatoes break down and sauce thickens, about 10 minutes.",
        "Sterilize 8 pint-size jars and lids in boiling water for at least 5 minutes. Pack tomato sauce into hot, sterilized jars, filling to within 1/4 inch of the top. Top with clean lids and screw on rings.",
        "Fill water bath canner with water according to manufacturer's instructions. Bring to a boil and lower jars into the boiling water using a holder. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Process for 35 minutes for pints.",
        "Remove the jars from the water bath canner and place onto a cloth-covered or wood surface, several inches apart, until cool, 8 hours to overnight. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "20 pounds fresh Roma tomatoes",
        "1 tablespoon olive oil",
        "2 cups chopped onion",
        "1/4 cup lemon juice",
        "1/4 cup red wine (optional)",
        "3 cloves garlic, minced",
        "2 tablespoons chopped celery (optional)",
        "2 tablespoons minced fresh basil",
        "2 tablespoons chopped red sweet pepper",
        "2 teaspoons salt (optional)",
        "2 bay leaves",
        "1/4 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canning Pizza or Spaghetti Sauce from Fresh Tomatoes",
    "url": "http://allrecipes.com/recipe/254518/canning-pizza-or-spaghetti-sauce-from/"
}
