{
    "directions": [
        "In a large pot, mix the white vinegar, sugar, water, cinnamon, salt, and cloves together; bring the mixture to a boil, and stir until the sugar has dissolved. Stir in the beets, and simmer until tender, 15 to 20 minutes.",
        "Sterilize the jars, lids, and rings in boiling water for at least 5 minutes. Using a slotted spoon, pack the sliced beets into the hot, sterilized jars, and pour in the beet liquid to fill the jars to within 1/4 inch of the top. Run a sterilized knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 30 minutes. Add more time if you are at high altitude.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "5 1/3 cups distilled white vinegar",
        "4 cups white sugar",
        "4 cups water",
        "2 tablespoons ground cinnamon",
        "1 1/2 tablespoons salt",
        "1 tablespoon ground cloves",
        "12 pounds beets, peeled and sliced",
        "6 1-quart canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Canned Spiced Pickled Beets",
    "url": "http://allrecipes.com/recipe/218187/canned-spiced-pickled-beets/"
}
