{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease one 15 1/2 x 10 1/2 inch jelly-roll pan and line with parchment paper.",
        "Separate the eggs. In small bowl, with mixer at high speed, beat egg yolks, vanilla, and 1/4 cup granulated sugar until very thick and lemon colored, about 5 minutes. Set beaten yolk mixture aside.",
        "In large bowl, with clean beaters and with mixer at high speed, beat egg whites, cream of tartar, and salt until soft peaks for. Beating at high speed, gradually sprinkle in 1/4 cup granulated sugar until sugar dissolves and whites stand in stiff peaks.",
        "Transfer beaten egg yolks to another large bowl. With rubber spatula, gently fold beaten egg whites into beaten egg yolks, one-third at a time. Sift and fold flour, one-third at a time, into egg mixture.",
        "With metal spatula, spread batter evenly in pan. Bake at 375 degrees F (190 degrees C) for 10 minutes or until top of cake springs back when lightly touched with finger.",
        "Meanwhile, in a cup, mix 2 tablespoons orange liqueur with 1 tablespoon water and 1 tablespoon sugar until sugar dissolves.",
        "Sprinkle clean cloth towel with confectioners' sugar.  When cake is done, immediately invert hot cake onto towel. Carefully peel off parchment paper and discard. Brush cake with orange-liqueur mixture.  Starting from a long side, roll cake with towel jelly-roll fashion. Cool cake roll, seam side down, on wire rack until completely cool, about 1 hour.",
        "To Make Ricotta Filling:  In food processor, with knife blade attached, blend the ricotta cheese, cream cheese, 1/2 cup confectioners' sugar, 1/2 teaspoon vanilla and cinnamon. until smooth. Transfer filling to bowl and stir in 1/4 cup of the chocolate pieces. Cover and refrigerate filling while cake cools.",
        "Assemble Cake:  Gently unroll cooled cake.  With metal spatula, spread filling over cake almost to edges.  Starting from same long side, roll cake without towel.  Place rolled cake, seam side down, on platter.",
        "To Make Frosting:  In small bowl, with mixer at medium speed, beat whipping cream and 3 tablespoons confectioners' sugar until soft peaks form. With rubber spatula, fold in 2 tablespoons orange liqueur and 1/2 teaspoon vanilla. With metal spatula, spread whipped-cream frosting over cake. Refrigerate cake at least 2 hours before serving. Sprinkle top of cake with chopped pistachios and chocolate pieces just before serving."
    ],
    "ingredients": [
        "5 eggs, separated",
        "1 teaspoon vanilla extract",
        "1/2 cup white sugar, divided",
        "1/4 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "3/4 cup cake flour",
        "2 tablespoons orange liqueur",
        "1 tablespoon water",
        "1 tablespoon white sugar",
        "confectioners' sugar for dusting",
        "1 1/4 cups ricotta cheese",
        "4 ounces cream cheese",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon ground cinnamon",
        "1/4 cup mini semi-sweet chocolate chips",
        "3/4 cup heavy whipping cream",
        "3 tablespoons confectioners' sugar",
        "2 tablespoons orange liqueur",
        "1/2 teaspoon vanilla extract",
        "1/4 cup chopped pistachio nuts",
        "1 tablespoon white sugar",
        "1 tablespoon mini semi-sweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cannoli Cake Roll",
    "url": "http://allrecipes.com/recipe/8182/cannoli-cake-roll/"
}
