{
    "directions": [
        "Bring a large pot of salted water to a boil.",
        "Heat 1 tablespoon of the butter in a large sauté pan or Dutch oven over medium- high heat. Add the pancetta and cook, stirring frequently, until it is crisp and has rendered most of its fat, 3 to 4 minutes. Add the shallot and cook, stirring, until softened, 1 to 2 minutes. Add the remaining 2 tablespoons butter, and when it has melted, add the melon. Cook, stirring frequently, until the melon completely breaks down and forms a smooth, thick sauce, 8 to 10 minutes.",
        "Add the heavy cream, salt, pepper, and marjoram, and cook until the cream has reduced by half and the sauce has a smooth, thick consistency that coats the back of a spoon, about 3 minutes. Remove the sauce from the heat.",
        "Add the pasta to the boiling water, stir well, and cook until al dente (about 10 minutes). Drain well, reserving 1/2 cup of the pasta cooking water.",
        "Add the hot pasta and 1/4 cup of the Parmesan to the warm sauce. Return the pan to medium heat, and toss until the pasta is nicely coated with sauce and heated through. Should the sauce seem too thick, add a bit of the pasta cooking water to help toss the pasta and thin the sauce.",
        "Serve the pasta immediately, garnished with the remaining Parmesan cheese and with freshly ground black pepper."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "2 ounces sliced pancetta, diced",
        "1/4 cup minced shallot",
        "3 cups diced ripe cantaloupe (from 1 medium cantaloupe)",
        "1/2 cup heavy cream",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper, plus more for garnish",
        "1 teaspoon minced fresh marjoram leaves",
        "8 ounces spaghetti rigati, linguine, or fettucine",
        "1/2  cup freshly grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Pasta",
        "Dinner",
        "Appetizer",
        "Cantaloupe",
        "Melon",
        "Summer",
        "Milk/Cream",
        "Pork",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cantaloupe and Pancetta Cream Sauce for Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/cantaloupe-and-pancetta-cream-sauce-for-pasta"
}
