{
    "directions": [
        "In a medium bowl, beat eggs until smooth. Add milk, salt, 1/4 cup oil and flour and mix well, until mixture resembles thin pancake batter. Heat 1 tsp oil in a nonstick sauté or crepe pan over medium heat. Pour 3 tbsp batter into the pan and immediately tilt and gently rotate the pan to coat the entire bottom. Cook until the edges begin to turn brown and the top is firm to the touch. Loosen edges and flip crepe. Cook 15 to 20 seconds more and remove. Repeat for remaining crepes. To keep crepes warm, place on a plate and cover with a kitchen towel. Combine ricotta, sugar, zest, and cinnamon in a medium bowl and mix well. Place 1 crepe on a flat surface. Spread 1 heaping tbsp filling in center of crepe. Top with 2 tbsp berries and roll. Repeat for all crepes. *Canyon Ranch uses organic berries because conventionally grown ones contain high amounts of pesticides. In addition, organic berries have higher levels of flavonoids (cancer-fighting substances) than conventional ones."
    ],
    "ingredients": [
        "2 eggs",
        "1 1/2 cups skim milk",
        "1/4 tsp salt",
        "1/4 cup plus 1 tsp canola oil",
        "1 cup whole-wheat flour",
        "1 cup lowfat ricotta cheese",
        "3 tbsp powdered sugar (or 2 tbsp honey)",
        "1 tsp grated lemon zest",
        "1/2 tsp cinnamon",
        "1 1/2 cups fresh organic* berries, such as blueberries, blackberries or sliced strawberries, or a mixture of berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Breakfast",
        "Brunch",
        "Low Fat",
        "New Year's Day",
        "Ricotta",
        "Healthy",
        "Self",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Canyon Ranch Berry Fruit Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/canyon-ranch-berry-fruit-crepes-230314"
}
