{
    "directions": [
        "Whisk soy sauce, garlic, Chinese 5-spice, sugar, paprika, and chicken bouillon together in a large glass or ceramic bowl. Add pork cubes and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for at least 1 hour.",
        "Remove pork from marinade and shake off excess. Discard remaining marinade.",
        "Heat oil in a large skillet or wok over medium heat. Cook and stir pork in hot oil until browned, 4 to 7 minutes. Add water; cook and stir until water evaporates and pork is cooked through, about 2 minutes more.",
        "Bring a large pot of water to a boil. Rinse rice noodles under cold water and gently break noodles apart. Immerse noodles in boiling water until about half tender, about 30 seconds. Add bean sprouts to the water and noodles; continue cooking until tender but still firm to the bite, about 30 seconds more. Drain.",
        "Combine noodles and pork mixture together in a large serving dish. Top noodles with lettuce, green onion, basil, cilantro, and crispy chow mein."
    ],
    "ingredients": [
        "2 tablespoons soy sauce",
        "4 cloves garlic, minced, or more to taste",
        "2 teaspoons Chinese five-spice powder",
        "2 teaspoons white sugar",
        "1 teaspoon paprika",
        "1/4 teaspoon chicken bouillon granules",
        "1 1/2 pounds pork tenderloin, cut into cubes",
        "2 tablespoons vegetable oil",
        "2 tablespoons water",
        "2 pounds fresh thick Vietnamese-style rice noodles",
        "2 cups bean sprouts",
        "1 cup torn lettuce leaves",
        "1 bunch green onions, chopped",
        "1/4 cup fresh basil leaves",
        "1/4 cup fresh cilantro leaves",
        "1/4 cup crispy chow mein noodles, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cao Lau (Vietnamese Noodle Bowl)",
    "url": "http://allrecipes.com/recipe/237833/cao-lau-vietnamese-noodle-bowl/"
}
