{
    "directions": [
        "Whisk first 9 ingredients in large bowl. Stir in onion. Transfer mixture to resealable plastic bag. Add tuna and seal bag, releasing any excess air; turn to coat. Let marinate at room temperature 1 hour, turning occasionally. (Alternatively, chill 4 hours, turning occasionally, then allow to return to room temperature before continuing.)",
        "Mix parsley and other herbs in large bowl. Sprinkle with salt and pepper. Cover and chill while preparing fish.",
        "Prepare barbecue (high heat). Brush grill rack with oil. Remove tuna from bag, scraping excess marinade back into bag. Grill until grill marks appear but tuna is still rare in centers, 2 to 3 minutes per side. Transfer to plate.",
        "Pour marinade into small saucepan. Bring just to simmer.",
        "Drizzle 1 teaspoon oil and lemon juice over herb salad; toss to coat. Place 1 tuna steak on each plate. Spoon warm marinade over. Divide herb salad among plates."
    ],
    "ingredients": [
        "6 tablespoons extra-virgin olive oil",
        "1/4 cup fresh lemon juice",
        "2 tablespoons drained capers",
        "4 teaspoons liquid from capers in jar",
        "4 teaspoons finely grated lemon peel",
        "2 teaspoons finely minced fresh rosemary",
        "1 teaspoon fine sea salt",
        "Large pinch of dried crushed red pepper",
        "Pinch of sugar",
        "1 small onion, quartered through core, thinly sliced crosswise (1 scant cup)",
        "6 6-to 7-ounce 1-inch-thick tuna steaks",
        "2 cups (loosely packed) fresh Italian parsley leaves",
        "1/2 cup (loosely packed) assorted fresh herb leaves (such as tarragon, chervil, oregano, celery leaves, and marjoram)",
        "1 teaspoon extra-virgin olive oil",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Seafood",
        "Tuna",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Capers",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caper-Rosemary Tuna with Herb Salad",
    "url": "http://www.epicurious.com/recipes/food/views/caper-rosemary-tuna-with-herb-salad-242981"
}
