{
    "directions": [
        "In a metal bowl set over a pan of barely simmering water melt the chocolate with the butter and the espresso mixture, stirring until the mixture is smooth. Remove the bowl from the heat, let the mixture cool to lukewarm, and stir in the sugar and the vanilla. Stir in the eggs, 1 at a time, stirring well after each addition, stir in the flour and the salt, stirring until the mixture is just combined, and stir in the walnuts. Pour the mixture into a buttered and floured 13- by 9-inch baking pan, smooth the top, and bake the brownie layer in the middle of a preheated 350°F. oven for 22 to 25 minutes, or until a tester comes out with crumbs adhering to it. Let the brownie layer cool completely in the pan on a rack.",
        "In a bowl with an electric mixer cream together the cream cheese and the butter until the mixture is light and fluffy, add the confectioners' sugar, sifted, the vanilla, and the cinnamon, and beat the frosting until it is combined well.",
        "Spread the frosting evenly over the brownie layer and chill the brownies for 1 hour, or until the frosting is firm.",
        "In a metal bowl set over a pan of barely simmering water melt the chocolate with the butter, the cream, and the espresso mixture, stirring until the glaze is smooth, remove the bowl from the heat, and let the glaze cool to room temperature. The brownies keep, covered and chilled, for 3 days."
    ],
    "ingredients": [
        "8 ounces fine-quality bittersweet chocolate, chopped",
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into pieces",
        "2 tablespoons instant espresso powder dissolved in 1 tablespoon  boiling water",
        "1 1/2 cups sugar",
        "2 teaspoons vanilla extract",
        "4 large eggs",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup walnuts, chopped",
        "8 ounces cream cheese, softened",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1 1/2 cups confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon cinnamon",
        "6 ounces fine-quality bittersweet chocolate",
        "2 tablespoons unsalted butter",
        "1/2 cup heavy cream",
        "1 1/2 tablespoons instant espresso powder dissolved in 1 tablespoon  boiling water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Chill",
        "Gourmet"
    ],
    "title": "Cappuccino Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/cappuccino-brownies-13342"
}
