{
    "directions": [
        "Finely grind cookies, chopped chocolate, brown sugar, and nutmeg in processor. Add butter and process until crumbs begin to stick together, scraping down bowl occasionally, about 1 minute. Transfer crumbs to 10-inch-diameter springform pan with 3-inch-high sides. Wrap plastic wrap around fingers and press crumb mixture firmly up sides to within 1/2 inch of top edge, then over bottom of pan.",
        "Bring whipping cream to simmer in large saucepan. Remove from heat; add chocolate and Kahlúa. Whisk until chocolate is melted and ganache is smooth. Pour 2 cups ganache over bottom of crust. Freeze until ganache layer is firm, about 30 minutes. Reserve remaining ganache; cover and let stand at room temperature to use later for creating lattice pattern.",
        "Position rack in middle of oven and preheat to 350°F. Using electric mixer, beat cream cheese and sugar in large bowl until blended. Beat in flour. Stir rum, espresso powder, ground coffee, vanilla, and molasses in small bowl until instant coffee dissolves; beat into cream cheese mixture. Beat in eggs 1 at a time, occasionally scraping down sides of bowl.",
        "Pour filling over cold ganache in crust. Place cheesecake on rimmed baking sheet. Bake until top is brown, puffed and cracked at edges, and center 2 inches moves only slightly when pan is gently shaken, about 1 hour 5 minutes. Transfer cheesecake to rack. Cool 15 minutes while preparing topping (top of cheesecake will fall slightly). Maintain oven temperature.",
        "Whisk sour cream, sugar, and vanilla in medium bowl to blend. Pour topping over hot cheesecake, spreading to cover filling completely. Bake until topping is set, about 10 minutes. Transfer cheesecake to rack. Refrigerate hot cheesecake on rack until cool, about 3 hours.",
        "Run small sharp knife between crust and pan sides to loosen cake; release pan sides. Transfer cheesecake to platter. Spoon reserved ganache into pastry bag fitted with small star tip. Pipe 6 diagonal lines atop cheesecake, spacing 1 inch apart. Repeat in opposite direction, making lattice. Pipe rosettes of ganache around top edge of cake. Garnish with coffee beans, if desired. Chill until lattice is firm, at least 6 hours. (Can be made 4 days ahead. Wrap loosely in foil, forming dome over lattice; keep chilled.)"
    ],
    "ingredients": [
        "1 9-ounce box chocolate wafer cookies",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/2 cup (packed) dark brown sugar",
        "1/8 teaspoon ground nutmeg",
        "7 tablespoons hot melted unsalted butter",
        "1 1/2 cups whipping cream",
        "20 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup Kahlúa or other coffee-flavored liqueur",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/3 cups sugar",
        "2 tablespoons all purpose flour",
        "2 tablespoons dark rum",
        "2 tablespoons instant espresso powder or coffee crystals",
        "2 tablespoons ground whole espresso coffee beans (medium-coarse grind)",
        "1 tablespoon vanilla extract",
        "2 teaspoons mild-flavored (light) molasses",
        "4 large eggs",
        "1 1/2 cups sour cream",
        "1/3 cup sugar",
        "2 teaspoons vanilla extract",
        "Espresso coffee beans (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Milk/Cream",
        "Rum",
        "Chocolate",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Kahlúa",
        "Winter",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cappuccino-Fudge Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/cappuccino-fudge-cheesecake-106231"
}
