{
    "directions": [
        "Preheat oven to 350°F. and butter and flour an 8-inch square baking pan, knocking out excess flour.",
        "In a heavy 1 1/2-quart saucepan melt chocolate and butter with espresso mixture over low heat, stirring, until smooth and remove pan from heat. Cool mixture to lukewarm and whisk in sugar and vanilla. Add eggs, 1 at a time, whisking well until mixture is glossy and smooth. Stir in flour and salt until just combined and stir in walnuts.",
        "Spread batter evenly in pan and bake in middle of oven 22 to 25 minutes, or until a tester comes out with crumbs adhering to it. Cool brownie layer completely in pan on a rack.",
        "In a bowl with an electric mixer beat cream cheese and butter until light and fluffy. Add confectioners' sugar, vanilla, and cinnamon and beat until combined well. Spread frosting evenly over brownie layer. Chill brownies 1 hour, or until frosting is firm.",
        "In a double boiler or metal bowl set over a saucepan of barely simmering water melt chocolate and butter with cream and espresso mixture, stirring, until smooth, and remove top of double boiler or bowl from heat. Cool glaze to room temperature.",
        "Spread glaze carefully over frosting. Chill brownies, covered, until cold, at least 3 hours.",
        "Cut chilled brownies into 24 squares and remove them from pan while still cold. Serve brownies cold or at room temperature. Brownies keep, covered and chilled, in one layer, 5 days."
    ],
    "ingredients": [
        "4 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
        "1 tablespoon instant espresso powder, dissolved in 1/2 tablespoon boiling water",
        "3/4 cup sugar",
        "1 teaspoon vanilla",
        "2 large eggs",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup walnuts, chopped",
        "4 ounces cream cheese, softened",
        "3 tablespoons unsalted butter, softened",
        "3/4 cup confectioners' sugar, sifted",
        "1/2 teaspoon vanilla",
        "1/2 teaspoon cinnamon",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1 tablespoon unsalted butter",
        "1/4 cup heavy cream",
        "2 1/4 teaspoons instant espresso powder, dissolved in 1/2 tablespoon boiling water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Cappuccino Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/cappuccino-brownies-13642"
}
