{
    "directions": [
        "Bring cream and espresso beans to simmer in heavy medium saucepan. Cover, remove from heat and let steep 30 minutes. Strain into heavy small saucepan. Add chocolate; stir over low heat until smooth. Add nutmeg. (Can be made 1 day ahead. Cover and chill. Before using, stir over low heat just until melted.)",
        "Position rack in lowest third of oven and preheat to 350°F. Line 9-inch square baking pan with 2-inch-high sides with foil, overlapping sides. Butter and flour foil. Stir first 4 ingredients in heavy medium saucepan over low heat until smooth. Cool slightly. Whisk in 1 1/2 cups sugar and eggs. Stir in flour, then chopped bittersweet chocolate and nuts. Transfer to prepared pan. Bake until tester inserted into center comes out with moist crumbs attached, about 30 minutes. Cool on rack. (Can be made 8 hours ahead.)",
        "Using foil sides as aid, lift brownie from pan. Fold down foil sides. Using 3 1/4-inch round cookie cutter, cut out 4 rounds (reserve scraps for another use).",
        "Place 1 brownie on each plate. Cover with chocolate curls. Spoon warm sauce around brownies. Sift sugar over."
    ],
    "ingredients": [
        "2/3 cup whipping cream",
        "1/2 cup whole espresso coffee beans",
        "5 ounces imported white chocolate (such as Lindt), chopped",
        "1/8 teaspoon ground nutmeg",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "4 1/2 ounces unsweetened chocolate, chopped",
        "1 tablespoon instant espresso powder or instant coffee powder",
        "1/2 teaspoon ground cinnamon",
        "1 1/2 cups sugar",
        "3 large eggs",
        "3/4 cup all purpose flour",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/2 cup chopped toasted hazelnuts",
        "Bittersweet chocolate curls",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dessert",
        "Bake",
        "Winter",
        "Hazelnut"
    ],
    "title": "Cappuccino Brownies with White Chocolate-Espresso Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cappuccino-brownies-with-white-chocolate-espresso-sauce-1152"
}
