{
    "directions": [
        "Preheat oven to 350°F. Butter 9-inch-diameter springform pan. Line bottom with parchment paper. Butter parchment. Dust pan with flour. Finely grind bread in processor. Spread on baking sheet. Bake until golden, stirring occasionally, about 10 minutes. Finely grind breadcrumbs in processor. Measure 3/4 cup crumbs (reserve remainder for another use). Finely grind nuts in processor.",
        "Using electric mixer, beat 3/4 cup sugar and yolks in large bowl until thick, about 3 minutes. Beat in rum, coffee powder mixture and peel. Mix in 3/4 cup crumbs and ground nuts. Beat whites and salt in another large bowl until soft peaks form. Gradually add remaining 1/4 cup sugar and beat until stiff. Fold 1/3 of whites into batter. Fold in remaining whites in 2 additions.",
        "Spoon batter into pan. Bake cake until tester inserted into center comes out clean, about 45 minutes. Cool in pan on rack 10 minutes. Turn out cake. Peel off parchment. Turn cake over; cool on rack 15 minutes.",
        "Line baking sheet with foil. Lightly oil foil. Place cake on prepared sheet.",
        "Combine sugar and water in heavy medium saucepan. Stir over medium-low heat until sugar dissolves. Increase heat to medium-high and boil without stirring until mixture turns amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 6 minutes.",
        "Pour caramel over top of cake. Oil tip of knife. Immediately cut through caramel layer only, marking 8 serving pieces.Garnish with walnut halves. Cool completely."
    ],
    "ingredients": [
        "8 1-inch-thick slices French bread, crust trimmed, bread cut into cubes",
        "1 1/2 cups walnuts, lightly toasted",
        "1 cup sugar",
        "4 large egg yolks",
        "2 tablespoons dark rum",
        "4 teaspoons instant espresso coffee powder dissolved in 1 teaspoon water",
        "1 teaspoon grated lemon peel",
        "6 large egg whites",
        "Pinch of salt",
        "1/2 cup sugar",
        "2 tablespoons water",
        "8 walnut halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Walnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel-Glazed Walnut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-glazed-walnut-cake-1805"
}
