{
    "directions": [
        "Using electric mixer, beat butter, powdered sugar, and salt in medium bowl to blend. Add egg yolk and cream; beat until smooth. Add flour and beat just until dough comes together. Turn dough out onto lightly floured surface and knead briefly to combine. Gather dough into ball; flatten into disk. Wrap in plastic and freeze until firm, about 15 minutes.",
        "Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inchdiameter tart pan with removable bottom. Gently fit dough into pan, trimming all but 1/2 inch of overhang. Fold overhang in, forming double-thick sides. Pierce bottom of crust all over with fork. Freeze 30 minutes.",
        "Preheat oven to 350°F. Line crust with foil. Fill with dried beans or pie weights. Bake until sides are set, about 20 minutes. Remove foil with beans. Bake crust until golden, pressing with back of fork if crust bubbles, about 20 minutes longer.",
        "Meanwhile, whisk egg white in small bowl until thick and foamy.",
        "Brush hot crust lightly with some beaten egg white and place on rack to cool. Maintain oven temperature.",
        "Stir sugar and 1/4 cup water in heavy medium saucepan over low heat until sugar dissolves. Increase heat to medium-high and bring to boil, brushing down sides of pan with wet pastry brush. Cook until syrup is deep amber, swirling pan occasionally, about 9 minutes. Remove from heat and pour in juice, then cream. Whisk over low heat until smooth. Whisk in butter, honey, orange peel, vanilla, and salt. Stir in cashews, pine nuts, and walnuts.",
        "Pour filling into crust. Bake tart until filling is bubbling thickly all over, about 22 minutes. Cool tart completely on rack. DO AHEAD: Can be made 1 day ahead. Cover with foil and store at room temperature.",
        "Cut tart into wedges and serve."
    ],
    "ingredients": [
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1/4 cup powdered sugar",
        "1/4 teaspoon salt",
        "1 large egg, separated",
        "1 tablespoon heavy whipping cream",
        "1 1/2 cups all purpose flour",
        "1 cup sugar",
        "1/4 cup water",
        "1/4 cup orange juice",
        "1/2 cup heavy whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 tablespoon honey",
        "2 teaspoons finely grated orange peel",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1/2 cup roasted unsalted cashews (about 2 1/2 ounces)",
        "1/2 cup pine nuts (about 2 1/2 ounces), lightly toasted",
        "1/2 cup walnut pieces (about 2 1/2 ounces), lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Almond",
        "Cashew",
        "Pine Nut",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel-Nut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-nut-tart-351539"
}
