{
    "directions": [
        "Put the chocolate into a small heat-resistant bowl and set aside.",
        "Put the sugar, water, and lemon juice in a saucepan over medium heat and stir just until the sugar has dissolved. Put down your spoon and let the syrup come to a boil without stirring, occasionally washing down the sides of the pan with a pastry brush dipped in water. Cook the syrup until it turns a dark amber color. Swirl the pan to distribute the color and heat.",
        "Once the syrup reaches the desired color, take the pan off the heat and pour in 1/3 cup of the cream. Do this carefully, as the caramel is very hot and will bubble up when you add the cream. Once the bubbling subsides stir in the rest of the cream 1/3 cup at a time, then stir in the butter a piece at a time. Place the pan back over medium heat and stir to combine all the ingredients. Once the ingredients are all incorporated into the caramel, pour it over the chocolate. Swirl the bowl so that the chocolate is completely coated with the warm caramel, then cover and let sit for 5 minutes. With a whisk, stir the mixture slowly, starting with small circles in the middle and working your way outward, whisking a bit more briskly as you go, until you have a smooth, glossy frosting. Leave the ganache on your kitchen counter, stirring now and then to help it cool, until it reaches spreading consistency, about 3 hours. If it stiffens up too much, simply put it someplace warmer than your counter.",
        "Covered with plastic wrap at room temperature, this frosting keeps for up to 3 days."
    ],
    "ingredients": [
        "8 ounces semisweet chocolate, chopped or chips",
        "1/2 cup (3 1/2 ounces) sugar",
        "1 tablespoon water",
        "1 teaspoon lemon juice",
        "1 cup heavy cream",
        "2 tablespoons unsalted butter, cut into small cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Lemon Juice",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Chocolate Ganache",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-chocolate-ganache-51112000"
}
