{
    "directions": [
        "Mix flour, sugar, and salt in processor. Add butter and lard; using on/off turns, process until coarse meal forms. Add 2 tablespoons ice water and process until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Form dough into disk. Wrap in plastic and refrigerate 1 hour.",
        "Roll out dough on floured surface to 12-inch round. Transfer to 9-inch-diameter pie dish. Fold overhang under; crimp edges decoratively. Chill 1 hour.",
        "Preheat oven to 375°F. Bake crust until edges begin to brown, pressing crust with back of fork if bubbles form, about 15 minutes. Cool slightly. Reduce oven temperature to 350°F.",
        "Stir sugar and 2 tablespoons water in medium saucepan over medium heat until sugar dissolves. Increase heat; boil without stirring until sugar turns dark amber, occasionally swirling pan and brushing down pan sides with wet pastry brush, about 7 minutes (time will vary depending on size of pan). Remove pan from heat. Whisk in butter 1 tablespoon at a time (mixture will bubble). Stir in half and half and cream, stirring until all caramel bits dissolve.",
        "Whisk 2 whole eggs and 1 yolk in large bowl to blend. Whisk in pumpkin, cinnamon, ginger, cloves, and salt. Gradually whisk caramel mixture into pumpkin mixture.",
        "Transfer filling to crust. Bake until puffed and set in center, about 50 minutes. Cool pie on rack. Chill until cold. (Can be made 1 day ahead. Keep chilled.) Serve with Mincemeat Ice Cream."
    ],
    "ingredients": [
        "1 1/3cups all purpose flour",
        "1 tablespoon sugar",
        "1/2 teaspoon salt",
        "3 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons chilled lard, cut into 1/2-inch cubes",
        "2 tablespoons (or more) ice water",
        "2/3 cup sugar",
        "2 tablespoons water",
        "2 tablespoons unsalted butter",
        "3/4 cup half and half",
        "2/3 cup whipping cream",
        "2 large eggs",
        "1 large egg yolk",
        "1 cup canned pure pumpkin",
        "2 teaspoons ground cinnamon",
        "3/4 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "Mincemeat Ice Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Ginger",
        "Vegetable",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Cinnamon",
        "Clove",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Caramel-Pumpkin Pie with Mincemeat Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-pumpkin-pie-with-mincemeat-ice-cream-231126"
}
