{
    "directions": [
        "Line 8x8-inch baking pan with foil. Stir sugar and water in heavy small saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup is deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 7 minutes. Mix in nuts. Immediately pour mixture into prepared pan, spreading slightly. Cool completely. Peel foil off praline. Coarsely chop praline. (Can be made 1 week ahead. Store refrigerated in airtight container.)",
        "Bring cream of coconut and cocoa to simmer in heavy medium saucepan over medium-low heat, whisking until smooth. Remove from heat. Add extracts and salt; whisk to blend. Cool. (Can be made 1 day ahead. Cover and chill. Bring to room temperature before using.)",
        "Melt butter and sugar in very large skillet over medium heat, stirring until sugar dissolves. Increase heat to high. Add pineapple and sauté until golden, about 3 minutes per side. Divide pineapple among 8 sundae dishes. Top each with 1 scoop of ice cream. Top with sauce and praline."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup water",
        "1/2 cup unsalted macadamia nuts, coarsely chopped",
        "1 15-ounce can sweetened cream of coconut (such as Coco López)",
        "6 tablespoons unsweetened cocoa powder",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon coconut extract",
        "Pinch of salt",
        "3 tablespoons unsalted butter",
        "2 tablespoons (firmly packed) golden brown sugar",
        "1 small pineapple, peeled, cored, cut into 1-inch pieces",
        "2 pints vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Dessert",
        "Coconut",
        "Pineapple",
        "Summer"
    ],
    "title": "Caramelized Pineapple Sundaes with Chocolate-Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-pineapple-sundaes-with-chocolate-coconut-sauce-108316"
}
