{
    "directions": [
        "For the perfect spiced pie crust: Mix the flour, cinnamon, salt and nutmeg in a bowl. Add the butter and vegetable shortening. Work the butter into the flour using a pastry cutter until the mixture resembles tiny pebbles. Add the white vinegar, egg and 5 tablespoons cold water and stir until just combined.",
        "Form 2 equal-sized balls. Place each in a large plastic bag (do not seal) and slightly flatten with a rolling pin; this makes it much easier to roll out the crust later. After flattening, seal the bag tightly. Place in the freezer for 15 to 20 minutes to chill.",
        "Preheat the oven to 375 degrees F.",
        "Remove 1 bag of dough from the freezer (save the other dough for another use), remove the dough from the bag and place it on a lightly floured surface. Roll the dough starting at the center and working outward. Be gentle and patient; it'll take a little time to get the dough completely rolled out. If you think the bottom is really sticking to the surface below while rolling, use a metal spatula to loosen it. When fully rolled out, loosen again with a spatula and lift the pie crust into a 9-inch pie pan (or you can roll the pastry over the rolling pin, lift it onto the pie pan and unroll it). Gently press the dough against the corner of the pan and tear off any excess dough. Then tuck under the edges and go around the pie pan pinching the dough to crimp the edge.",
        "For the pie filling: In a bowl, mix the apples, lemon juice, granulated sugar, flour and salt. Set aside.",
        "For the crumb topping: Cut the butter into the flour with a pastry cutter, then add in the brown sugar, oats and salt.",
        "Add the apples to the prepared pie shell and top with the crumb topping. Bake for 1 hour, covering the edge of the crust with foil if it starts to brown too quickly. After an hour, sprinkle the chopped pecans over the pie, then bake for a further 5 minutes.",
        "Remove the pie from the oven and pour 1/2 jar (or more, if you're feeling dangerous and naughty) of caramel topping over the top. Allow to cool slightly before serving — or don't if you can't wait!"
    ],
    "ingredients": [
        "3 cups all-purpose flour, plus more for flouring",
        "1 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "1/2 teaspoon ground nutmeg",
        "1 1/2 sticks (12 tablespoons) salted butter, cut into pieces",
        "3/4 cup vegetable shortening or lard",
        "1 tablespoon distilled white vinegar",
        "1 egg, lightly beaten",
        "6 to 7 cups peeled and sliced Granny Smith apples",
        "1/2 lemon, juiced",
        "1/2 cup granulated sugar",
        "1/4 cup all-purpose flour",
        "1/4 teaspoon salt",
        "1 1/2 sticks (12 tablespoons) unsalted butter",
        "1/2 cup all-purpose flour",
        "1 cup packed brown sugar",
        "1/2 cup quick oats",
        "1/4 teaspoon salt",
        "1/2 cup pecans, chopped",
        "1/2 jar (or more) caramel topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Pie",
        "Apple",
        "Fruit",
        "Pie Recipes",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Dessert",
        "Baking",
        "Pie Crust Recipes",
        "Caramel Apple"
    ],
    "title": "Caramel Apple Pie",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/caramel-apple-pie"
}
