{
    "directions": [
        "Preheat oven to 350°F. Lightly butter and flour 9 standard (1/3-cup) muffin cups. Sift flour and next 5 ingredients twice into medium bowl. Mix 6 tablespoons lukewarm water with vanilla in small bowl. Using electric mixer, beat brown sugar and butter in large bowl until light and fluffy. Add flour mixture in 3 additions alternately with water mixture in 2 additions, beating batter until blended after each addition.",
        "Using electric mixer fitted with clean dry beaters, beat egg whites in medium bowl until soft peaks form. Gradually add 2 tablespoons sugar and beat until firm glossy peaks form. Fold 1/3 of whites into batter to lighten, then fold in remaining whites. Spoon 1/4 cup batter into each prepared muffin cup.",
        "Bake muffins until tester inserted into center comes out clean, about 17 minutes. Cool muffins in pan on rack at least 20 minutes. Remove muffins from pan and cool completely on rack. DO AHEAD: Can be made 1 day ahead. Return muffins to muffin pan; cover and store at room temperature.",
        "Melt butter in large nonstick skillet over medium heat. Sprinkle sugar over butter in skillet, then place apple slices and pear slices in single layer (if possible) atop sugar. Increase heat to medium-high and cook without stirring until fruit is golden on bottom, pressing out to single layer as fruit cooks and reduces in volume, about 8 minutes. Turn fruit over in skillet and cook until golden, about 5 minutes. Add cranberries and cook until juices in skillet are reduced by about half, about 2 minutes.",
        "Heat half and half in heavy large saucepan over medium heat just until heated through and bubbles form at edge of pan. Whisk sugar, egg yolks, and sea salt in medium bowl; whisk in cornstarch.",
        "Gradually add hot half and half to yolk mixture and whisk until blended. Return custard to same saucepan; stir over medium heat until custard boils and thickens, 2 to 3 minutes. Whisk in butter, then 2 tablespoons brandy. Remove from heat.",
        "Brush top of muffins several times with remaining 4 tablespoons brandy until absorbed. Place 1 muffin in each of 8 bowls, cups, or dessert glasses. Divide caramelized fruit among bowls. Spoon warm custard over muffins and fruit in bowls (about 1/3 cup for each). Chill at least 30 minutes. DO AHEAD: Can be made 2 hours ahead. Cover and keep chilled. Let stand at room temperature 20 minutes before serving."
    ],
    "ingredients": [
        "1 cup cake flour",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon fine sea salt",
        "6 tablespoons lukewarm water",
        "1 teaspoon vanilla extract",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "2 large egg whites, room temperature",
        "2 tablespoons sugar",
        "6 tablespoons (3/4 stick) unsalted butter",
        "3/4 cup sugar",
        "2 large Granny Smith apples (about 1 pound), peeled, quartered, cored, cut into 1/3-inch-thick slices",
        "2 small Bosc pears (12 to 14 ounces total), peeled, quartered, cored, cut into 1/3-inch-thick slices",
        "1 cup fresh or frozen cranberries",
        "2 cups half and half",
        "1/2 cup sugar",
        "4 large egg yolks",
        "1/4 teaspoon fine sea salt",
        "1 tablespoon cornstarch",
        "1 tablespoon unsalted butter",
        "6 tablespoons apple brandy (such as applejack or Calvados) or poire Williams (clear pear brandy), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Christmas",
        "High Fiber",
        "Cranberry",
        "Apple",
        "Pear",
        "Brandy",
        "Winter",
        "Cinnamon",
        "Christmas Eve",
        "Nutmeg",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Winter Fruit Custards",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-winter-fruit-custards-356892"
}
