{
    "directions": [
        "Preheat oven to 325°F. Arrange bread on large baking sheet; bake until dry, about 10 minutes. Transfer bread to large bowl. Increase temperature to 350°F.",
        "Stir sugar, syrup and water in heavy medium saucepan over low heat until sugar dissolves. Increase heat and boil without stirring until amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 12 minutes. Remove from heat. Add cider and butter. Return to low heat; stir until sauce comes to simmer. Cover pan and simmer until caramel bits dissolve, stirring occasionally, about 5 minutes. Set pan over ice; stir until caramel cools to lukewarm, about 5 minutes.",
        "Mix raisins, spices, eggs, then rum into caramel. Add to bread. Mix in white chocolate. Let stand about 10 minutes, stirring occasionally.",
        "Butter eight 3/4-cup custard cups. Divide pudding among cups. Place in large baking pan. Pour hot water into pan to come halfway up sides of cups.",
        "Bake puddings until set in center, about 30 minutes. Cool 10 minutes."
    ],
    "ingredients": [
        "5 cups 1 x 1 x 1/2-inch pieces trimmed whole wheat bread",
        "2/3 cup sugar",
        "1/3 cup light corn syrup",
        "1/3 cup water",
        "1/4 cup apple cider",
        "3 tablespoons unsalted butter",
        "1/2 cup raisins",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground coriander",
        "1 teaspoon ground ginger",
        "2 large eggs, beaten to blend",
        "1/4 cup dark rum",
        "5 ounces good-quality white chocolate, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Raisin",
        "Fall"
    ],
    "title": "Caramel, White Chocolate and Rum Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-white-chocolate-and-rum-bread-pudding-2461"
}
