{
    "directions": [
        "Mix flour, sugar, cinnamon, nutmeg and salt in processor. Add butter. Using on/off turns, process until mixture resembles coarse meal. Mix in vanilla and enough ice water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate until firm, about 2 hours.",
        "Preheat oven to 375°F. Roll dough out on floured surface to 12-inch round. Transfer dough to 9 1/2-inch-diameter tart pan with removable bottom. Fold overhang in and press, forming high-standing double-thick sides. Pierce dough all over with fork. Freeze 15 minutes.",
        "Bake crust until set but still pale in color, piercing with fork if crust bubbles, about 20 minutes. Transfer to rack; cool. Increase oven temperature to 400°F.",
        "Combine sugar and 1/4 cup water in heavy medium saucepan. Stir over medium-low heat until sugar dissolves. Increase heat. Boil without stirring until caramel is deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 9 minutes. Reduce heat to medium. Gradually whisk in cream (mixture will bubble). Stir until caramel is smooth. Add butter, honey and vanilla. Stir until well blended. Mix in all nuts.",
        "Pour caramel mixture into crust. Bake until filling bubbles all over, about 20 minutes. Cool completely on rack.",
        "Stir white chocolate in top of double boiler set over hot water just until melted and smooth. Remove from over water. Using fork, drizzle chocolate decoratively over tart. Let stand until chocolate is set, about 30 minutes. (Can be made 8 hours ahead. Let stand at room temperature.)",
        "Serve with cream, if desired."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1 teaspoon vanilla extract",
        "3 tablespoons (about) ice water",
        "1 1/4 cups sugar",
        "1/4 cup water",
        "2/3 cup whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter, cut into small pieces",
        "1 tablespoon honey",
        "1 teaspoon vanilla extract",
        "1 cup walnuts, coarsely chopped",
        "1/2 cup pecans, coarsely chopped",
        "1/2 cup slivered blanched almonds",
        "1 ounce good-quality white chocolate (such as Lindt or Baker's), chopped",
        "Whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Almond",
        "Pecan",
        "Walnut",
        "Winter"
    ],
    "title": "Caramelized Nut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-nut-tart-5741"
}
