{
    "directions": [
        "Place chocolate and salt in a large bowl; set aside. Cook egg yolks, sugar, and 1/2 cup cream in a medium saucepan over medium heat, whisking constantly, until thick enough to coat a spoon, about 4 minutes. Pour over chocolate mixture and whisk until chocolate is melted and mixture is smooth. Let cool.",
        "Using a whisk, beat remaining 1/2 cup cream in a bowl until soft peaks form. Fold into cooled chocolate mixture; cover and chill until cold, at least 2 hours.",
        "DO AHEAD: Mousse can be made 2 days ahead. Keep chilled.",
        "Preheat oven to 425°F. Lightly butter 10 cups of a standard 12-cup muffin tin or two 6-cup popover pans. Whisk eggs in a medium bowl to blend. Bring cream, milk, salt, and pepper to a simmer in a medium saucepan; whisking constantly, gradually add to eggs. Whisk in flour, then cheese (no lumps should remain).",
        "Divide batter among prepared muffin cups, fill remaining cups halfway with water, and bake 15 minutes. Reduce heat to 350°F and bake until popovers are puffed, golden brown, and crusty, 20–25 minutes longer. Turn out onto a wire rack and let cool.",
        "Just before serving, line a baking sheet with parchment paper and lightly coat with nonstick spray. Fill a large bowl with ice water. Bring sugar and 3 tablespoons water to a boil in a small saucepan over medium-high heat, stirring to dissolve sugar. Boil, brushing down sides with a damp brush and swirling pan occasionally, until mixture turns deep amber. Set the bottom of saucepan in ice water to stop the cooking and firm caramel slightly (this will make it easier to work with when dipping popovers).",
        "Working quickly and with 1 popover at a time, dip bottoms into caramel and set, caramel side down, on prepared baking sheet; let cool. (If caramel becomes too hard while dipping, reheat over medium-low heat to a workable consistency.)",
        "Once caramel has set, mix mousse with a rubber spatula to loosen. Transfer to a pastry bag fitted with a 1/4\" pastry tip. Working 1 at a time, poke holes in tops of popovers with pastry tip and fill popovers with mousse."
    ],
    "ingredients": [
        "6 ounces bittersweet chocolate (at least 70% cacao), melted, slightly cooled",
        "1/2 teaspoon kosher salt",
        "3 large egg yolks",
        "1/4 cup sugar",
        "1 cup heavy cream, divided",
        "Unsalted butter (for pans)",
        "2 large eggs",
        "1/2 cup heavy cream",
        "1/2 cup whole milk",
        "1 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "3/4 cup all-purpose flour",
        "1/2 cup grated white cheddar",
        "Nonstick vegetable oil spray",
        "1 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Oscars",
        "Cheddar",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel-Dipped Popovers with Chocolate Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-dipped-popovers-with-chocolate-mousse-51214730"
}
