{
    "directions": [
        "Preheat oven to 325°F.",
        "Bring water, 1/2 cup sugar, and fresh ginger to a boil in a 2-quart heavy saucepan, washing down any sugar crystals from side of pan with a brush dipped in cold water. Boil gently, without stirring, 6 minutes (syrup will be foamy).",
        "Transfer ginger with a slotted spoon to a small bowl. Cook syrup remaining in pan over moderate heat, undisturbed, until it becomes a deep caramel. Divide caramel among ramekins, tilting to thinly coat (caramel may not cover bottoms completely).",
        "Whisk together yolks, whole eggs, and a pinch of salt in a bowl. Bring milk, remaining 1/2 cup sugar, and cooked ginger just to a boil in cleaned pan. Add half of sweetened milk to eggs in a slow stream, whisking constantly but gently, then stir in remainder. (Excessive whisking incorporates air and will result in a custard with many holes.)",
        "Pour custard through a very fine sieve into a bowl and discard solids. Divide custard among ramekins and cover each tightly with foil. Put ramekins in a water bath and bake in middle of oven until set around edges with centers still wobbly, 40 to 45 minutes. Transfer ramekins with a slotted spatula to a rack and cool crèmes caramels to room temperature (centers will set as they cool).",
        "Serve in ramekins or inverted onto a plate. To invert, run a thin knife around edge of each ramekin. Invert a plate over each ramekin and, holding plate and ramekin tightly together, invert crème caramel onto plate"
    ],
    "ingredients": [
        "1/4 cup water",
        "1 cup sugar",
        "1/4 cup chopped peeled fresh ginger (2 ounces)",
        "4 large egg yolks",
        "2 large whole eggs",
        "2 cups whole milk",
        "Garnish: crystallized ginger",
        "Special equipment: 4 (6-ounce) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Bastille Day",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Caramel Custards with Ginger (Cremes Caramels au Gingembre)",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-custards-with-ginger-cremes-caramels-au-gingembre-104768"
}
