{
    "directions": [
        "Fill a large pot with water and bring to a boil over high heat. Stir in the lentils, bay leaves, and whole garlic cloves. Return to a boil, then reduce heat to low and simmer lentils until they are cooked but still firm, about 10 minutes. Drain well. Place lentils in a bowl; toss with olive oil, thyme, and 1 tablespoon chopped garlic. Remove bay leaves and whole garlic cloves; set aside.",
        "Heat 1 tablespoon olive in a large pot over medium heat. Stir in chili flakes, cinnamon, cumin, and coriander and cook until fragrant. Add garlic, onion, celery, zucchini, red and yellow peppers, and squash; cook 3 or 4 minutes.",
        "Mix in the lentils, tomatoes, chickpeas, and vegetable stock. Raise heat to medium-high until stew just begins to boil; reduce heat to low and cover. Simmer until squash is tender, about 20 minutes, stirring once or twice. Add the chopped parsley. Ladle into serving bowls and garnish with a dollop of yogurt, some chopped mint, and a pinch of cayenne pepper."
    ],
    "ingredients": [
        "1 cup French green lentils",
        "3 bay leaves",
        "2 whole garlic cloves",
        "3 tablespoons olive oil",
        "1 teaspoon chopped fresh thyme leaves",
        "1 tablespoon minced garlic",
        "1 tablespoon olive oil",
        "1 teaspoon crushed hot chile flakes",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 tablespoon minced garlic",
        "1 cup chopped onions",
        "1 cup chopped celery",
        "1 cup chopped zucchini",
        "1 red bell pepper, diced",
        "1 yellow bell pepper, diced",
        "1 butternut squash - peeled, seeded, and cut into 1-inch cubes",
        "1 (8 ounce) can crushed tomatoes",
        "1 (15 ounce) can chickpeas, drained",
        "4 cups vegetable stock",
        "1 cup chopped fresh flat-leaf parsley",
        "1/2 cup plain yogurt (optional)",
        "2 tablespoons chopped fresh mint (optional)",
        "1/4 teaspoon cayenne pepper (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cara's Moroccan Stew",
    "url": "http://allrecipes.com/recipe/164503/caras-moroccan-stew/"
}
