{
    "directions": [
        "Preheat the oven to 425°F. Into a bowl sift together the flour, 3 tablespoons of sugar, the baking powder, and a pinch of salt and stir in zest. In a bowl with an electric mixer beat 1 cup of the cream with the vanilla until it just holds soft peaks. Make a well in the center of the flour mixture, add the whipped cream, and with a fork combine the mixture until it just forms a dough. On a lightly floured surface knead the dough 6 times, or until it is just combined well, roll or pat it out 1/2 inch thick, and with a floured 4-inch cutter cut out a total of 6 rounds, gathering and rerolling the scraps. Brush the rounds with the additional cream or the milk and sprinkle them with the additional sugar. Bake the shortcakes on a greased baking sheet in the middle of the oven for 12 to 15 minutes, or until they are golden, transfer them with a spatula to a rack, and let them cool.",
        "In a dry heavy skillet cook 1/2 cup of the sugar over moderate heat, undisturbed, until it begins to melt and cook the sugar, stirring with a fork, until it is melted completely and turns a golden caramel. Remove the skillet from the heat and whisk in the cream carefully. Return the skillet to the heat and whisk the caramel sauce until it is smooth. In a large heavy skillet cook the apples, each peeled, cored, and cut into 8 slices, in the butter over moderately high heat, stirring, until they are browned lightly, add the remaining 1 tablespoon sugar, and cook the apples until they are soft and caramelized. Add the sauce to the apples and stir the mixture carefully.",
        "Break each shortcake in half, arrange 2 halves on each of 6 dessert plates, and spoon the apples over them."
    ],
    "ingredients": [
        "1 3/4 cups all-purpose flour",
        "3 tablespoons sugar plus additional for sprinkling the shortcakes",
        "1 tablespoon double-acting baking powder",
        "1 1/2 teaspoons freshly grated lemon zest",
        "1 cup well-chilled heavy cream plus additional cream or milk for brushing the shortcakes",
        "1 teaspoon vanilla extract",
        "1/2 cup plus 1 tablespoon sugar",
        "3/4 cup heavy cream, heated",
        "5 tart cooking apples such as Granny Smith (about 2 pounds)",
        "1/2 stick (1/4 cup) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Lemon",
        "Apple",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Apple Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-apple-shortcakes-13315"
}
