{
    "directions": [
        "Combine flour, halvah, sugar, and salt in processor. Using on/off turns, process until blended to sandy texture. Add butter. Using on/off turns, process until mixture resembles coarse meal. Whisk egg yolks and 2 tablespoons ice water in small bowl to blend. Add to flour mixture. Using on/off turns, process until moist clumps form. Gather dough into 2 balls; flatten into disks. Wrap separately in plastic. Chill 1 hour.",
        "Combine sugar and 1/2 cup water in heavy large saucepan. Stir over medium heat until sugar dissolves. Increase heat to high and boil until syrup turns deep amber or clip-on candy thermometer registers 360°F, occasionally swirling pan and brushing down sides with wet pastry brush, about 11 minutes (time will vary depending on size of pan). Remove from heat. Carefully stir in cream (mixture will bubble). Add butter and whisk until melted and smooth. Stir in pistachios. Cool until lukewarm but still pourable, about 30 minutes.",
        "Meanwhile, preheat oven to 350°F. Lightly spray 9-inch-diameter tart pan with removable bottom with nonstick spray. Roll out 1 dough disk between 2 sheets of parchment paper or waxed paper to 11-inch round (dough will be about 1/3 inch thick). Remove top paper. Invert dough into prepared pan. Remove remaining paper. Trim dough overhang. Roll out second dough disk between 2 sheets of parchment paper or waxed paper to 10-inch round. Pour filling into prepared crust. Brush edges of crust with egg white. Remove top paper from second dough disk. Invert over filling. Remove paper. Press dough around pan edges to trim and seal.",
        "Place torte on baking sheet and bake until crust is golden, about 35 minutes. Cool completely in pan. Chill overnight.",
        "Bring cream and butter just to boil in medium saucepan. Remove from heat. Add chocolate and corn syrup; whisk until smooth. Cool 5 minutes.",
        "Place rack over rimmed baking sheet. Remove sides from tart pan. Invert torte onto rack. Remove bottom of tart pan. Pour warm glaze over torte (bottom of torte becomes top). Let stand until glaze sets. (Can be made 3 days ahead. Cover and refrigerate. Let stand at room temperature 1 hour before serving.)",
        "Slice into thin wedges and serve.",
        "*A sesame confection available at delicatessens, Middle Eastern markets, supermarkets, and Italian markets."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1 cup (packed) crumbled pistachio halvah or plain halvah* (about 7 ounces)",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 large egg yolks",
        "2 tablespoons ice water",
        "2 cups sugar",
        "1/2 cup water",
        "1/2 cup heavy whipping cream",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 cup natural unsalted pistachios (about 4 ounces), toasted",
        "Nonstick vegetable oil spray",
        "1 large egg white",
        "1/2 cup heavy whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon light corn syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Pistachio",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel-Pistachio Torte with Halvah and Dark Chocolate",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-pistachio-torte-with-halvah-and-dark-chocolate-109593"
}
