{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 400°F. Roll out 1 pastry sheet on lightly floured surface to 15x12-inch rectangle. Using small sharp knife and long ruler, trim sheet to 13x10-inch rectangle. Cut in half lengthwise, forming two 13x5-inch rectangles. Pierce rectangles all over with fork; transfer to 1 ungreased baking sheet. Repeat with remaining pastry sheet, transferring to another ungreased baking sheet. Brush rectangles with melted butter; sprinkle each with 1 1/2 teaspoons sugar.",
        "Bake pastries 8 minutes. Reverse position of baking sheets and bake until pastries are golden, about 8 minutes longer. Cool pastries on sheets.",
        "Pour 3 tablespoons water into ramekin or custard cup. Sprinkle with gelatin; let soften while preparing caramel sauce.",
        "Combine sugar, corn syrup and 3/4 cup water in heavy large saucepan. Stir over medium-low heat until sugar dissolves, frequently brushing down sides of pan with wet pastry brush. Increase heat; boil without stirring until syrup turns deep golden brown, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 10 minutes. Remove from heat. Add 1 3/4 cups cream and butter (caramel will bubble up vigorously). Return to low heat; stir until any bits of caramel dissolve.",
        "Pour 1 1/2 cups caramel sauce into glass measuring cup; set aside pan of caramel sauce. Place ramekin with gelatin mixture in small skillet of simmering water. Stir until gelatin dissolves and mixture is clear, about 1 minute. Mix gelatin into measured 1 1/2 cups hot caramel; cool just to room temperature, stirring occasionally.",
        "Beat chilled whipping cream in large bowl to medium-firm peaks (do not overbeat). Gradually pour cooled caramel-gelatin mixture over cream, folding constantly but gently. Chill mousse 15 minutes.",
        "Arrange 3 pastry rectangles on large clean baking sheet; drizzle each with 2 tablespoons caramel from pan. Spread 1 cup mousse evenly over each rectangle. Chill until mousse begins to set, about 1 hour. Reserve plain pastry rectangle.",
        "Place 1 pastry layer with mousse on small baking sheet or board. Top with second layer, third layer, then plain pastry, aligning layers. Press assembled pastry lightly so that layers will adhere. Cover; chill at least 8 hours and up to 1 day. Cover and chill remaining caramel sauce in pan.",
        "Using serrated knife, cut pastry crosswise into 6 pieces. Dust napoleons with powdered sugar. Transfer to plates. Rewarm sauce over low heat just until pourable; drizzle sauce onto each plate. Garnish with berries."
    ],
    "ingredients": [
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "6 teaspoons sugar",
        "3 tablespoons plus 3/4 cup water",
        "1 envelope unflavored gelatin",
        "2 3/4 cups sugar",
        "2 tablespoons light corn syrup",
        "1 3/4 cups whipping cream, room temperature",
        "1/2 cup (1 stick) unsalted butter",
        "1 1/2 cups chilled whipping cream",
        "Powdered sugar",
        "Assorted fresh berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Valentine's Day",
        "New Year's Eve",
        "Fall",
        "Summer",
        "Winter",
        "Anniversary",
        "Engagement Party",
        "Party",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Caramel Mousse Napoleon with Caramel Sauce and Berries",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-mousse-napoleon-with-caramel-sauce-and-berries-103928"
}
