{
    "directions": [
        "Season the pork with salt and pepper. In the stovetop-safe insert of a slow cooker or in a large fry pan over medium-high heat, warm the oil. Working in batches, add the pork and brown on all sides, 7 to 8 minutes per batch. Transfer to a bowl.",
        "Add the sugar, lemon juice and water to the insert or fry pan and stir to combine. Increase the heat to high and cook, without stirring, until the mixture is a dark caramel color but not burned, about 5 minutes.",
        "Meanwhile, in a small bowl, combine the soy sauce, fish sauce, pineapple and juices, sake, coarsely ground pepper, ginger, sweet potato and green onion roots. Carefully add the soy sauce mixture to the caramel and return the mixture to a boil. Remove from the heat and stir in the pork.",
        "Transfer the insert to the slow-cooker base. If using a regular slow cooker, transfer the pork and sauce to the cooker. Cover and cook on high according to the manufacturer's instructions until the pork is tender, about 2 1/2 hours. Using a slotted spoon, transfer the pork to a warmed platter. If using a slow-cooker insert, set the insert over medium-high heat, bring the sauce to a boil and cook until thickened, 4 to 5 minutes. If using a regular slow cooker, transfer the sauce to a saucepan and boil the sauce as directed. Remove the ginger pieces and discard.",
        "Spoon the sauce over the pork and garnish with the julienned green onion. Grind additional pepper on top and serve immediately with steamed white rice. Serves 4.",
        "Adapted from a recipe by Pichet Ong, Chef, Batch, New York City, NY."
    ],
    "ingredients": [
        "2 lb. boneless pork shoulder roast, cut into 2 1/2- to 3-inch cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "1 Tbs. vegetable oil",
        "1/2 cup plus 2 Tbs. sugar",
        "1 Tbs. fresh lemon juice",
        "2 Tbs. water",
        "2 Tbs. plus 2 tsp. soy sauce",
        "2 Tbs. plus 2 tsp. fish sauce",
        "1 cup diced pineapple (1/4-inch cubes), plus residual juices",
        "1/4 cup sake",
        "1 Tbs. coarsely ground pepper",
        "2 pieces fresh ginger, each 1 inch thick, peeled",
        "1 sweet potato, about 9 1/2 oz., peeled and cut into 1/2-inch cubes",
        "2 green onions, white portion only, with root end attached",
        "1 green onion, white and green portions, julienned",
        "Steamed white rice for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Caramel-Braised Pork",
    "url": "http://www.williams-sonoma.com/recipe/caramel-braised-pork.html"
}
