{
    "directions": [
        "Blend flour, powdered sugar, salt, and ground cloves in processor. Add butter and orange peel. Using on/off turns, process until mixture resembles coarse meal. Add 2 tablespoons ice water and process until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Transfer dough to 10- to 10 1/2-inch tart pan with removable bottom. Press dough evenly onto bottom and up sides of pan. Freeze crust 25 minutes.",
        "Preheat oven to 350°F. Combine cream, both sugars, and honey in heavy medium saucepan. Bring to boil, stirring until sugar dissolves. Continue to boil until mixture darkens and thickens slightly, about 4 minutes. Remove from heat. Stir in all nuts and rose water. Spoon filling evenly into crust.",
        "Bake tart until filling is caramel brown and bubbling thickly and crust is golden, about 38 minutes. Transfer tart to rack and cool completely in pan. Carefully remove pan sides from tart. Place tart on platter. (Can be prepared 3 days ahead. Cover and store at room temperature.) Cut tart into wedges and serve at room temperature.",
        "*Available at some supermarkets, specialty foods stores, and Middle Eastern markets."
    ],
    "ingredients": [
        "1 3/4 cups all purpose flour",
        "1/3 cup powdered sugar",
        "1 teaspoon (scant) salt",
        "1/8 teaspoon ground cloves",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 teaspoon grated orange peel",
        "2 tablespoons (or more) ice water",
        "1 cup whipping cream (do not use heavy whipping cream)",
        "1/2 cup sugar",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup forest honey or other honey",
        "3/4 cup coarsely chopped walnuts, toasted (scant 4 ounces)",
        "3/4 cup sliced almonds, toasted (about 3 ounces)",
        "3/4 cup shelled unsalted natural pistachios, toasted (scant 4 ounces)",
        "1 1/2 teaspoons rose water*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Nut",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Pistachio",
        "Walnut",
        "Fall",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Pistachio, Walnut, and Almond Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-pistachio-walnut-and-almond-tart-230953"
}
