{
    "directions": [
        "Boil first 3 ingredients in pot until reduced to 4 cups, about 25 minutes.",
        "Preheat oven to 325°F. Heat oil in large Dutch oven over high heat. Add bones; sauté until well browned, turning occasionally, about 12 minutes. Transfer bones to bowl. Add onions, celery and allspice to Dutch oven. Season with salt; cook until onions are golden, stirring often, about 25 minutes. Continue cooking until onions are deep dark brown, scraping bottom of Dutch oven and stirring often, about 15 minutes more. Add garlic and thyme; sauté 5 minutes. Transfer onion mixture to large roasting pan. Add 1 cup broth mixture to Dutch oven. Bring to boil, scraping up browned bits; transfer to roasting pan.",
        "Season brisket generously with salt and pepper. Add to Dutch oven and brown over high heat, about 5 minutes per side. Place brisket, fat side up, on onion mixture in roasting pan; surround with bones. Add remaining broth mixture and tomatoes to Dutch oven; bring to boil, scraping up browned bits. Pour mixture over brisket.",
        "Cover roasting pan tightly with heavy-duty foil and place in oven. Bake until brisket is tender, about 3 hours 45 minutes. Remove foil. Cool brisket 2 hours. Refrigerate uncovered 3 hours. Cover brisket tightly and keep chilled 1 day or up to 3 days.",
        "Scrape fat from top of pan juices; discard fat. Transfer brisket to cutting board, scraping gelled juices off brisket back into roasting pan. Bring contents of roasting pan to simmer. Discard bones. Pour contents of roasting pan into coarse strainer set over large bowl. Press on solids to release as much liquid as possible. Purée solids in processor, using on/off turns. Mix enough purée into juices in bowl to form thick sauce. Add tomato paste and whisk to blend. Pour sauce into medium saucepan and simmer until heated through. Season with salt and pepper.",
        "Slice brisket thinly across grain at slight diagonal angle. Arrange slices in glass baking dish. Drizzle 1/2 cup sauce over; cover with foil.",
        "Bring large pot of salted water to boil. Add all squashes, turnips and carrots and cook until crisp-tender, about 6 minutes. Using slotted spoon, transfer to large bowl. Add potatoes to boiling water and cook until just tender, about 12 minutes. Using slotted spoon, transfer potatoes to same bowl. Add onions to boiling water and cook until almost tender, about 4 minutes. Drain and cool slightly. Peel onions; add to same bowl.",
        "Preheat oven to 350°F. Bake brisket until heated through, about 30 minutes.",
        "Meanwhile, boil margarine, honey and thyme in heavy large skillet over high heat until syrup is reduced to 1/3 cup, stirring often, about 5 minutes. Add cooked vegetables, tomatoes and asparagus; toss until heated, about 5 minutes. Season with salt and pepper.",
        "Arrange brisket on platter. Bring remaining sauce to simmer. Arrange vegetables around brisket. Serve, passing remaining sauce separately."
    ],
    "ingredients": [
        "4 cups canned low-salt chicken broth",
        "1 750-ml bottle dry white wine",
        "1/2 cup brandy",
        "1/3 cup vegetable oil",
        "2 pounds meaty beef neck bones",
        "3 1/2 pounds onions, thinly sliced",
        "4 large celery stalks, sliced",
        "1 1/2 teaspoons whole allspice",
        "6 garlic cloves, chopped",
        "2 teaspoons dried thyme",
        "1 4 1/2- to 5-pound flat-cut brisket",
        "3/4 cup chopped canned tomatoes",
        "1 tablespoon tomato paste",
        "2 1/2 pounds mixed baby vegetables (such as zucchini, crookneck and pattypan squashes, turnips, carrots and new potatoes)",
        "8 red boiling onions",
        "1/4 cup (1/2 stick) margarine",
        "1/4 cup honey",
        "1 teaspoon dried thyme",
        "10 ounces cherry tomatoes",
        "4 ounces asparagus tips or sugar snap peas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Onion",
        "Tomato",
        "Vegetable",
        "Braise",
        "Roast",
        "High Fiber",
        "Purim",
        "Brisket",
        "White Wine",
        "Kosher"
    ],
    "title": "Caramelized-Onion and Wine-Braised Brisket with Glazed Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-onion-and-wine-braised-brisket-with-glazed-vegetables-426"
}
