{
    "directions": [
        "Melt 1 tablespoon butter in heavy large pot over high heat. Add onions and thyme; sauté until onions begin to soften, about 8 minutes. Reduce heat to low; cook until onions are caramelized, stirring occasionally, about 20 minutes. Transfer onion mixture to medium bowl.",
        "Melt remaining 2 tablespoons butter in same pot over medium-high heat. Add mushrooms; sauté until soft, about 12 minutes. Add Cognac and garlic; stir 20 seconds. Stir in onion mixture, then broth and wine. Bring to boil. Reduce heat to low; simmer until onions are very tender, about 45 minutes. Discard thyme sprigs. Season soup with salt and pepper. (Can be made 1 day ahead. Cool slightly; cover and chill. Bring to simmer before serving.)",
        "Preheat broiler. Place baguette slices on large baking sheet. Spread goat cheese on baguette slices, dividing equally. Broil goat cheese croutons until cheese begins to brown in spots, about 30 seconds. Divide soup among 6 bowls. Top with croutons and serve."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "1 1/2 pounds onions, halved, thinly sliced (about 5 cups)",
        "4 fresh thyme sprigs",
        "1 1/2 pounds portobello mushrooms, stemmed, caps halved and cut crosswise into 1/4-inch-thick strips",
        "3 tablespoons Cognac or brandy",
        "3 garlic cloves, minced",
        "8 cups canned vegetable broth",
        "1 cup dry white wine",
        "18 1-inch-thick slices French-bread baguette, toasted",
        "8 ounces soft fresh goat cheese, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Cheese",
        "Mushroom",
        "Onion",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Fall",
        "Winter",
        "Anniversary",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Onion and Portobello Mushroom Soup with Goat Cheese Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-onion-and-portobello-mushroom-soup-with-goat-cheese-croutons-106175"
}
