{
    "directions": [
        "To make the caramel, in a heavy saucepan over medium-high heat, combine the sugar, water and salt. Cook until the mixture bubbles vigorously and turns a golden amber color, 6 to 8 minutes. Stir the sugar with a wooden spoon during the first 2 minutes of cooking; do not stir after this point, instead swirling the pan to ensure even cooking. Watch the caramel very carefully, as it will go from amber-colored to burned in a few seconds.",
        "Remove the pan from the heat and immediately add the cream very carefully; the mixture will bubble and splatter, so protect your hands and arms with heavy oven mitts and use a long-handled wooden spoon. Stir until the caramel is smooth and well blended. Let cool to room temperature, then cover and refrigerate until cold.",
        "To make the crepe batter, combine the eggs, milk, flour, melted butter, salt, vanilla and confectioners’ sugar in a blender. Blend on high speed until the mixture is well combined, about 30 seconds. Transfer the batter to a bowl, cover and refrigerate for 30 minutes.",
        "In a crepe pan or 10-inch (25-cm) nonstick fry pan over medium heat, melt the butter and swirl to coat the pan evenly. Lift the pan at a slight angle and pour 1/3 cup (3 fl. oz./80 ml) of the batter into the center of the pan, quickly tilting the pan to spread the batter to the edges. Return the pan to the heat and cook until the crepe is golden underneath, 1 to 2 minutes. Using a spatula, flip the crepe over and cook until golden on the second side, 1 to 2 minutes longer. Transfer the crepe to a plate and cover with a piece of parchment paper. Repeat with the remaining batter, stacking the crepes on the plate with parchment between each layer. Let the crepes cool to room temperature.",
        "To assemble the cake, transfer the cooled caramel mixture to a bowl of a stand mixer fitted with the whisk attachment. Mix on high until the mixture becomes lighter in color and texture and holds stiff peaks, about 5 minutes.",
        "Center a crepe on a serving platter and spread with 3 to 4 Tbs. of the caramel cream. Center another crepe on top of the first and spread with another 3 to 4 Tbs. of the caramel cream. Repeat with the remaining crepes and caramel cream, finishing with a crepe. Wrap the crepe cake in plastic wrap and chill for at least 4 hours and up to 1 day.",
        "Let the cake sit at room temperature for 1 hour before serving. Top with whipped cream and berries, cut into slices and serve immediately. Serves 8 to 10.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "For the caramel:",
        "1 cup (8 oz./250 g) granulated sugar",
        "1/4 cup (2 fl. oz./60 ml) water",
        "Pinch of salt",
        "4 cups (32 fl. oz./1 l) heavy cream",
        "For the crepe batter:",
        "4 eggs",
        "4 cups (32 fl. oz./1 l) milk",
        "2 1/4 cups (11 1/2 oz./360 g) all-purpose flour",
        "2 Tbs. unsalted butter, melted",
        "1 tsp. salt",
        "1 tsp. vanilla extract",
        "1/2 cup (2 oz./60 g) confectioners’ sugar",
        "For finishing:",
        "1 tsp. unsalted butter",
        "Lightly sweetened whipped cream for garnish (optional)",
        "Fresh berries for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Caramel Crepe Cake",
    "url": "http://www.williams-sonoma.com/recipe/caramel-crepe-cake.html"
}
