{
    "directions": [
        "Heat milk, zest, and ginger until hot and remove from heat. Let stand 25 minutes, then reheat.",
        "Whisk together egg, sugar, flour, and a pinch of salt until smooth. Pour milk through a sieve into a bowl, discarding solids. Gradually whisk hot milk into egg mixture, then transfer to a small saucepan.",
        "Cook over moderately low heat, stirring constantly, until thickened enough to coat the back of a wooden spoon and a thermometer registers 170°F, 3 to 5 minutes. (Do not let boil.) Pour custard through a fine sieve into a bowl and cover surface with plastic wrap to prevent a skin from forming. Chill until cold.",
        "Preheat broiler.",
        "Cut 8 (1/4-inch-thick) slices from middle of pineapple, reserving remainder for another use.",
        "Lightly oil a shallow heavy baking pan and arrange pineapple rounds in 1 layer. Sprinkle with sugar and broil 4 inches from heat, rotating pan if necessary for even browning, until caramelized, 7 to 8 minutes. Cool pineapple.",
        "Place 1 pineapple round on each dessert plate. Make a cut in each remaining round from edge to center. Working with 1 round at a time and holding round perpendicular to plate, gently twist cut edges away from each other and prop on top of pineapple on plate.",
        "Spoon crème anglaise around pineapple and sprinkle with crystallized ginger."
    ],
    "ingredients": [
        "1 cup 1% milk",
        "4- by 1-inch strip fresh orange zest",
        "3 (1/4-inch-thick) slices peeled fresh ginger, smashed",
        "1 large egg",
        "2 tablespoons sugar",
        "1 1/2 teaspoons all-purpose flour",
        "3 1/2-lb ripe pineapple (preferably extra-sweet), peeled but not cored",
        "1/2 tablespoon sugar",
        "1 tablespoon julienned crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Ginger",
        "Dessert",
        "Broil",
        "Pineapple",
        "Gourmet"
    ],
    "title": "Caramelized Pineapple with Ginger Crème Anglaise",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-pineapple-with-ginger-creme-anglaise-102752"
}
