{
    "directions": [
        "Whisk egg yolks, sugar and flour in medium bowl to blend well. Bring half and half to simmer in heavy medium saucepan. Slowly whisk hot half and half into egg mixture. Return egg mixture to same saucepan and cook until mixture boils and thickens, whisking constantly. Transfer mixture to medium bowl. Add chocolate and orange peel and stir until mixture is smooth. Press plastic wrap onto surface of pastry cream to prevent skin from forming. Cool completely. (Pastry cream can be prepared 1 day ahead. Refrigerate. Bring to room temperature before continuing.)",
        "Preheat oven to 300°F. Butter 11x17-inch jelly roll pan. Line with parchment. Butter and flour parchment. Coarsely grind toasted almonds with flour in processor. Using electric mixer, beat yolks with 5 tablespoons brown sugar in medium bowl until slowly dissolving ribbons form when beaters are lifted. Stir in orange peel and vanilla extract. Using clean dry beaters, beat whites with cream of tartar and salt in large bowl until soft peaks form. Gradually add remaining 5 tablespoons brown sugar and beat until stiff but not dry. Fold whites into yolk mixture. Gently fold in almond mixture.",
        "Spread batter evenly in prepared pan. Bake until toothpick inserted into center comes out clean, about 30 minutes. Run small sharp knife around pan sides if necessary to loosen cake. Slide cake on parchment onto rack. Cool.",
        "Slide cake on parchment onto work surface. Loosen cake from parchment using knife as aid. Sift powdered sugar over cake. Invert onto cookie sheet. Sprinkle with powdered sugar and invert onto another parchment sheet.",
        "Using electric mixer, beat butter in large bowl until light and fluffy. Beat in Grand Marnier. Add pastry cream 1/4 cup at a time, beating after each addition until just blended.",
        "Spread half of buttercream over cake, leaving 1/2-inch border. Starting at 1 long side, roll up cake jelly roll fashion. Arrange seam side down on parchment. Set aside 1/2 cup buttercream; spread remaining buttercream over cake. Cut 2 inches off each end of cake, cutting on diagonal. Transfer cake to platter. Attach ends to top of cake, forming branches. Spread reserved 1/2 cup buttercream over cake ends and seams. Cover and refrigerate at least 1 hour to firm buttercream. (Cake can be prepared 1 day ahead. Cover and refrigerate. Let cake stand at room temperature 20 minutes before serving.)",
        "Arrange pine twigs on cake and on platter. Garnish with cranberries.",
        "Cook 1/2 cup sugar and 2 tablespoons water in heavy small saucepan over low heat, stirring until sugar dissolves. Transfer to top of double boiler. Add cranberries. Cover berry mixture and place over simmering water. Cook 45 minutes, stirring occasionally. Remove from over water. Let cranberry mixture stand at room temperature overnight.",
        "Place remaining 1/2 cup sugar on plate. Drain cranberries well. Add to sugar and turn to coat. Let dry at least 30 minutes. (Can be prepared 3 days ahead. Cover and refrigerate.)"
    ],
    "ingredients": [
        "6 large egg yolks",
        "1/3 cup firmly packed dark brown sugar",
        "2 tablespoons all purpose flour",
        "1 1/2 cups half and half",
        "8 ounces imported white chocolate (such as Lindt), chopped",
        "1 1/2 teaspoons grated orange peel",
        "1 1/2 cups toasted sliced almonds",
        "2 tablespoons unbleached all purpose flour",
        "6 large eggs, separated",
        "10 tablespoons firmly packed dark brown sugar",
        "1 teaspoon grated orange peel",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon cream of tartar",
        "1/8 teaspoon salt",
        "Powdered sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "Pine twigs",
        "1 cup sugar",
        "2 tablespoons water",
        "1/2 cup cranberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Cranberry",
        "Orange",
        "Almond",
        "Triple Sec",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel-Orange Bûche de Noël",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-orange-buche-de-noel-1089"
}
