{
    "directions": [
        "1. In the medium saucepan, whisk the sugar with the water so there are no sugar clumps. Cook over medium heat until the sugar is dissolved and the water looks clear, 2 to 3 minutes. Turn the heat up to medium-high and brush down the side of the saucepan with the pastry brush dipped in water. (This prevents any sugar from sticking to the side of the pan and forming crystals.) Have the cream in a measuring cup with a spout right near your stovetop where you can reach it.",
        "2. With the heat still at medium-high, continue to cook. Do not stir the caramel anymore at this point. After about 15 minutes, you'll notice the bubbles getting bigger and slower just before the caramel begins to turn color.",
        "3. As soon as the caramel turns a medium tan color, remove the pan from the heat. The bubbles will subside a little, so it will be easier for you to check the color.* Watch carefully and as soon as it turns a dark tan, slowly pour in a couple of tablespoons of the cream. Stand back a little and be careful - the cream will cause the hot caramel to bubble up. Stir the cream into the caramel with the heat-proof spatula. Once the caramel stops sputtering, stir in more cream. Continue to pour in the remaining cream but stop again at any time if it sputters.",
        "4. Let the caramel sauce cool to room temperature. Refrigerate in a covered container for up to 3 weeks. If there is any hard caramel sticking to the pan, fill it with water and bring it to a boil. Allow to cool before cleaning the pan."
    ],
    "ingredients": [
        "Medium saucepan",
        "Pastry brush",
        "Wooden spoon or heat-proof rubber spatula",
        "Oven mitts",
        "1 1/2 cups granulated sugar",
        "1/2 cup water",
        "1 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Dessert",
        "Fourth of July",
        "Kid-Friendly",
        "Backyard BBQ",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Birthday",
        "Shower",
        "Engagement Party",
        "Party"
    ],
    "title": "Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-sauce-366050"
}
