{
    "directions": [
        "1. Preheat the oven to 325°F. Grease a baking sheet, preferably rimmed.",
        "2. In a medium saucepan, combine sugar and 1/2 cup of water. Heat over medium heat until mixture begins to simmer, about 3 minutes. Cover the pan and continue to simmer, allowing steam from cooking mixture to wash down the sides of the pan. Remove cover and continue to simmer until the mixture turns golden, 7 to 8 minutes. Immediately remove from the stove, and, to avoid mixture bubbling over, carefully pour cream in a slow, steady stream into the pan; do not stir. Return the pot to the stove, reduce heat to low, and, using a wooden spoon, gently stir mixture until cream is completely incorporated.",
        "3. Transfer the caramel to a medium heat-proof bowl, add the nuts, and stir to coat the nuts evenly. Transfer the mixture to a baking sheet, spreading it evenly, and bake until dark brown, 12 to 15 minutes. Cool the brittle to room temperature and chop mixture coarsely using a food processor, a cleaver or by hand.",
        "4. Cut the log into twenty 1/2-inch rounds, press one cut side of each round into the brittle, and arrange the rounds 2 inches apart on all sides on a parchment-lined or nonstick cookie sheet or sheets.",
        "5. Bake until golden brown, 15 to 20 minutes. Remove the cookies with a spatula and cool on a wire rack."
    ],
    "ingredients": [
        "1 cup sugar",
        "1 cup heavy cream",
        "1 pound macadamia pieces, or whole nuts, roughly chopped",
        "1 chilled log of butter shortbread cookie dough"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Mixer",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Macadamia Nut",
        "Fall",
        "Winter",
        "Edible Gift",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Macadamia Nut Crunch",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-macadamia-nut-crunch-236617"
}
