{
    "directions": [
        "Place coffee filter in strainer set over medium bowl. Bring 1 1/2 cups water to boil in heavy medium saucepan. Mix in coffee and tea. Turn off heat; cover and let steep 5 minutes. Strain mixture through coffee filter. Stir in Cognac. Cool completely.",
        "Whisk yolks, cream, 4 tablespoons sugar, and salt in medium metal bowl to blend. Set bowl over saucepan of simmering water and whisk until mixture is thick and thermometer registers 160°F, about 5 minutes. Remove from over water. Place over larger bowl of ice and water. Cool quickly, whisking often, about 5 minutes.",
        "Stir mascarpone in large bowl to loosen texture. Fold in cooled yolk mixture in 3 additions, then fold in Cognac. Beat whites in medium bowl until soft peaks form. Add 2 tablespoons sugar and beat until stiff but not dry; fold into sabayon in 3 additions. Cover; chill up to 1 day.",
        "Combine pineapple, sugar, and salt in large nonstick skillet. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar melts and syrup forms. Continue cooking until syrup is absorbed and pineapple is dry and golden, stirring occasionally, about 10 minutes; cool completely.",
        "Cover bottom of 13x9x2-inch glass baking dish with layer of ladyfingers. Brush with coffee flavoring. Spread with half of sabayon (about 3 cups). Scatter half of pineapple over. Repeat with ladyfingers, flavoring, sabayon, and pineapple. Cover; chill overnight.",
        "Sprinkle tiramisù generously with grated chocolate and garnish with fresh pineapple, if desired. Cut into squares or spoon onto plates and serve.",
        "*An Italian cream cheese; sold at many supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "1 1/2 cups water",
        "6 tablespoons freshly ground French roast coffee (about 1 1/2 ounces)",
        "3 tablespoons black tea leaves (scant 1/2 ounce)",
        "3 tablespoons Cognac or other brandy",
        "8 large egg yolks",
        "1/2 cup heavy whipping cream",
        "6 tablespoons sugar, divided",
        "1/4 teaspoon salt",
        "2 8-ounce containers mascarpone cheese*",
        "2 tablespoons Cognac or other brandy",
        "4 large egg whites",
        "4 cups 1/4- to 1/3-inch cubes cored peeled fresh pineapple (from 1 large)",
        "1/4 cup sugar",
        "1/8 teaspoon salt",
        "1/2 vanilla bean, split lengthwise",
        "4 3-ounce packages soft ladyfingers (sponge-cake variety)",
        "Grated bittersweet chocolate",
        "Thin fresh pineapple triangles for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Tea",
        "Cheese",
        "Egg",
        "Dessert",
        "Pineapple",
        "Cognac/Armagnac",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Fresh Pineapple Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-fresh-pineapple-tiramisu-239811"
}
