{
    "directions": [
        "Preheat oven to 400°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until golden brown, stirring occasionally, about 15 minutes. Transfer to large bowl; cool.",
        "Melt butter in heavy large skillet over medium-high heat. Add onions and sauté 10 minutes. Add rosemary; sauté until onions are golden brown, about 10 minutes longer. Add celery and sauté until beginning to soften, about 5 minutes. Add chestnuts and stir to blend. Transfer onion mixture to medium bowl. Mix in parsley. Add broth to skillet and bring to boil, scraping up any browned bits. Add to onion mixture. (Bread and onion mixture can be made 1 day ahead. Cover separately. Store bread at room temperature; refrigerate onion mixture.) Stir onion mixture into bread. Season with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill main cavity with cool stuffing. Butter glass baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 20 minutes.",
        "Preheat oven to 350°F. Butter 13 x 9 x 2-inch glass baking dish. Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down, and bake until heated through, about 30 minutes."
    ],
    "ingredients": [
        "1 pound country-style French bread or regular French bread, crust trimmed, cut into 1/2-inch cubes",
        "6 tablespoons (3/4 stick) butter",
        "2 large onions, chopped",
        "2 tablespoons chopped fresh rosemary",
        "3 celery stalks, chopped",
        "1 7- to 8-ounce jar vacuum-packed steamed chestnuts, quartered (about 2 cups)",
        "1/2 cup chopped fresh parsley",
        "1 cup canned low-salt chicken broth",
        "2 eggs, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Rosemary",
        "Fall",
        "Chestnut",
        "Parsley",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Caramelized Onion and Chestnut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-onion-and-chestnut-stuffing-100464"
}
