{
    "directions": [
        "Preheat the oven to 350 degrees F and place a rack in the center of the oven. Grease a 12-cup Bundt pan with cooking spray.",
        "Stir to combine the muscovado sugar and butter, then set aside. In a large bowl whisk to combine the granulated sugar and cinnamon. Coat 10 to 12 pieces of the dough in the cinnamon-sugar mixture and place the pieces in the bottom of the prepared pan. Sprinkle in 1/4 cup of the cashews. Drizzle with one-quarter of the butter mixture. Repeat the layering process two more times, and finish with a layer of the coated dough drizzled with the butter. Bake for 45 minutes.",
        "Cool the bread slightly, about 5 minutes, then turn out onto a plate or platter. Serve with coffee ice cream.",
        "In a large bowl, whisk to combine the flour, sugar, salt and yeast. In a medium saucepan, heat the milk and butter just until the butter melts. Stir the liquid into the flour mixture. Stir in the egg and mix until a shaggy dough forms. Turn the dough onto a work surface and knead until it is smooth and elastic, 5 to 8 minutes. Grease a large bowl with butter. Transfer the butter to the prepared bowl and cover with plastic wrap. Let rise in a warm, draft-free place until doubled in size, about 1 hour 15 minutes."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1 1/4 cups muscovado sugar",
        "1 cup (2 sticks) unsalted butter, melted",
        "1 cup granulated sugar",
        "1 teaspoon ground cinnamon",
        "3/4 cup roughly chopped cashews, toasted",
        "2 pounds Dinner Roll Dough, recipe follows, cut into about 40 pieces",
        "Coffee ice cream, for serving",
        "4 cups all-purpose flour",
        "2 tablespoons sugar",
        "1 1/4 teaspoons salt",
        "Two 1/4-ounce packages rapid-rise yeast",
        "1 cup whole milk",
        "1/4 cup unsalted butter, plus more for greasing",
        "1 egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bread",
        "Nut Recipes",
        "Dairy Recipes",
        "Dessert"
    ],
    "title": "Caramel and Cashew Pull-Apart Bread with Coffee Ice Cream",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/caramel-and-cashew-pull-apart-bread-with-coffee-ice-cream"
}
