{
    "directions": [
        "Whisk yolks, sugar and cup water in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until mixture thickens and candy thermometer registers 170°F., about 4 minutes. Remove bowl from over water. Scrape seeds from vanilla bean into egg mixture. Using electric mixer, beat until mixture is cool and thick, about 5 minutes. Mix in peel.",
        "Beat cream in another large bowl until soft peaks form. Add Grand Marnier; beat until stiff peaks form. Fold into cooled mousse mixture. Cover; freeze until firm, at least 6 hours or overnight. (Can be made 1 week ahead. Keep frozen.)",
        "Brush six 3/4-cup custard cups with some melted butter. Place 1 phyllo sheet on work surface (cover remaining phyllo with plastic wrap, then damp kitchen towel). Brush phyllo sheet with melted butter. Top with second phyllo sheet. Brush with melted butter. Cut phyllo stack into six 5-1/2 to 6-inch squares. Press 1 square stack, buttered side down, into each cup. Repeat buttering, stacking and cutting with remaining 2 phyllo sheets. Press 1 square stack, buttered side down, atop first stack in each cup, positioning corners at different angles and extending over edges of cups. Brush phyllo with butter. (Can be made 4 hours ahead. Let stand at room temperature.)",
        "Preheat broiler. Stir preserves in small saucepan over medium-low heat until melted. Arrange nectarine slices on baking sheet. Brush generously with some of apricot preserves. Broil just until glaze bubbles, moving baking sheet if necessary for even broiling, about 2 minutes. Cool nectarines on baking sheet. Combine almond paste, yolk, 1 tablespoons butter, flour and vanilla in processor. Process until smooth.",
        "Preheat oven to 375°F. Divide almond filling among phyllo cups (layer will be thin). Place cups on baking sheet. Bake until filling is set and phyllo is golden, about 10 minutes. Cool 15 minutes.",
        "Gently remove phyllo cups from custard cups; place on plates. Melt preserves over low heat. Arrange nectarine slices atop almond filling. Brush with preserves. Place scoop of frozen mousse alongside."
    ],
    "ingredients": [
        "6 large egg yolks",
        "2/3 cup sugar",
        "1/4 cup water",
        "1 vanilla bean, split lengthwise",
        "2 teaspoons grated orange peel",
        "2 cups chilled whipping cream",
        "1/4 cup Grand Marnier or other orange liqueur",
        "1/2 cup (1 stick) unsalted butter, melted",
        "4 sheets fresh phyllo pastry or frozen, thawed",
        "1 cup apricot preserves",
        "3 5-to-6 ounce nectarines, pitted, thinly sliced",
        "1/3 cup almond paste (about 4 ounces), crumbled",
        "1 large egg yolk",
        "1 1/2 tablespoons unsalted butter, room temperature",
        "1 1/2 tablespoons all purpose flour",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Broil",
        "Freeze/Chill",
        "Frozen Dessert",
        "Orange",
        "Nectarine",
        "Almond",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Nectarine-Almond Phyllo Cups with Frozen Orange Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-nectarine-almond-phyllo-cups-with-frozen-orange-mousse-4247"
}
