{
    "directions": [
        "Pulse flour, powdered sugar, and salt in a food processor to combine. Add butter and pulse to work in just until mixture is the texture of coarse meal with a few pea-size pieces of butter remaining.",
        "Beat egg yolks with 1 tablespoon water in a small bowl just to combine. With the motor running, gradually pour into food processor. Process until dough starts to come together in large pieces.",
        "Using lightly floured fingers, press dough about 1\" up sides and then evenly into bottom of springform pan, making sides slightly thicker than bottom. Use a floured flat, straight-sided measuring cup or glass to compact and smooth dough; freeze until solid, 15–20 minutes.",
        "Preheat oven to 350°F. Prick bottom of dough in a few places with a fork and bake until golden all over, 20–25 minutes. Transfer pan to a wire rack. (Leave oven on if you're not making the crust ahead and are making the filling next).",
        "Crust can be baked 1 day ahead. Let cool; store tightly wrapped at room temperature.",
        "Bring honey and 1 tablespoon water to a simmer in a small saucepan over low heat, swirling pan often, until mixture is darkened in color and nutty smelling, about 2 minutes. Add granulated sugar, heavy cream, butter, corn syrup, salt, and vanilla and carefully stir until mixture is smooth. Increase heat to medium; bring to a boil. Cook, swirling pan, until caramel is slightly darkened in color and thick enough to coat a spoon, 5–8 minutes. Remove from heat, add nuts and seeds to caramel, and stir to coat.",
        "Scrape filling into warm or roomtemperature crust, pushing to the edges to evenly fill. Bake until filling is deep golden brown and caramel is bubbling, 25–30 minutes. Let cool.",
        "Tart can be made 1 day ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/4 cup powdered sugar",
        "1/2 teaspoon kosher salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "2 large egg yolks",
        "1/4 cup honey",
        "1/4 cup granulated sugar",
        "1/4 cup heavy cream",
        "4 tablespoons unsalted butter",
        "2 tablespoons light corn syrup",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon vanilla extract",
        "2 cups mixed unsalted, roasted nuts (such as pecans, hazelnuts, peanuts, pistachios, and/or sliced almonds)",
        "1/3 cup unsalted, roasted seeds (such as pumpkin and/or sunflower)",
        "A 9\"-diameter springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Kid-Friendly",
        "High Fiber",
        "Fall",
        "Seed"
    ],
    "title": "Caramelized-Honey Nut and Seed Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-honey-nut-and-seed-tart-56390106"
}
