{
    "directions": [
        "Preheat oven to 350°F. Generously butter every other cup in 12-cup muffin pan. Place 1 phyllo rectangle on work surface; cover remaining phyllo with damp cloth to prevent drying. Brush rectangle with melted butter; sprinkle with 1/2 tablespoon sugar. Place second phyllo rectangle atop first; brush with butter and sprinkle with 1/2 tablespoon sugar. Repeat 3 more times; top with 1 more rectangle and brush with butter, making stack of 6 rectangles. Using small sharp knife and 6-inch-diameter plate as guide, cut out two 6-inch round stacks. Press each stack into 1 buttered muffin cup. Repeat entire procedure 2 more times, making 4 more phyllo cups (6 total). Bake cups until golden and crisp, about 15 minutes. Carefully lift cups, twisting slightly to loosen; place on rack. Cool completely. (Can be made 2 days ahead. Store airtight at room temperature.)",
        "Whisk 1/2 cup sugar and cornstarch in heavy medium saucepan to blend. Gradually whisk in milk, then yolks. Scrape in seeds from vanilla bean; add bean. Whisk over medium heat until pastry cream thickens and boils, about 6 minutes. Strain pastry cream into small bowl; press plastic wrap directly onto surface. Chill until cold, at least 3 hours and up to 2 days.",
        "Preheat broiler. Place phyllo cups on small baking sheet. Spoon 1/3 cup pastry cream into each cup. Overlap 5 or 6 banana slices atop pastry cream in each cup. Sprinkle bananas with additional sugar. Broil pastries until sugar topping caramelizes, turning sheet for even browning, about 2 minutes. Transfer cups to plates. Scoop sorbet alongside."
    ],
    "ingredients": [
        "9 phyllo pastry sheets (each about 17x13 inches), stacked and halved crosswise, forming eighteen 8 1/2x13-inch rectangles",
        "1/2 cup (1 stick) unsalted butter, melted",
        "8 tablespoons (about) sugar",
        "1/2 cup sugar",
        "3 1/2 tablespoons cornstarch",
        "2 cups whole milk",
        "4 large egg yolks",
        "1/2 vanilla bean, split lengthwise",
        "3 large firm but ripe bananas, peeled, sliced thinly on diagonal",
        "Additional sugar",
        "Chocolate sorbet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cocktail Party",
        "Kid-Friendly",
        "Banana",
        "Vanilla",
        "Fall",
        "Shower",
        "Engagement Party",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Bananas and Vanilla Cream in Phyllo Cups",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-bananas-and-vanilla-cream-in-phyllo-cups-103927"
}
