{
    "directions": [
        "Place a rack in lower third of oven; preheat to 350°. Roll out 1 disk of dough on a lightly floured surface to a 14\" round. Transfer to a 9\"-diameter pie dish. Lift up edge and let dough slump down into dish. Trim, leaving about 1\" overhang. Fold overhang under. Freeze 15 minutes.",
        "Meanwhile, roll out second disk of dough on a lightly floured surface until about 1/8\" thick. Cut into 1/4\"-thick strips. Transfer to a parchment&151;lined baking sheet. If dough is soft, chill until just pliable. Working with 3 strips at a time, braid dough, returning braids to baking sheet as you go. Chill until just pliable.",
        "Beat 1 egg in a small bowl. Brush edge of dough in dish and bottom sides of braids with egg. Arrange braids along edge, trimming and gently pressing sections together as you go. Freeze 15 minutes.",
        "Line dough with parchment paper or foil, leaving some overhang. Fill with pie weights or dried beans. Bake until crust is dry around edge, 25-30 minutes. Remove parchment and weights and brush entire crust with egg. Bake until crust is dry and set, 10-15 minutes. Let cool.",
        "Meanwhile, cook garlic in a medium saucepan of boiling salted water until beginning to soften, about 3 minutes; drain. Wipe saucepan dry and heat oil in pan over medium-high. Add garlic and cook, stirring occasionally, until cloves start to turn golden brown, about 2 minutes. Add vinegar and 1 cup water and bring to a boil. Reduce heat and simmer until garlic is tender, 10-12 minutes. Add maple syrup, rosemary, and thyme, and season with salt and pepper.",
        "Cook, stirring occasionally, until liquid is syrupy and coats garlic, about 5 minutes. Scatter cheese over crust; top with spinach. Whisk crème fraîche, cream, and remaining eggs in a medium bowl; season with salt and pepper. Pour over spinach. Add garlic with any syrup. Bake until custard is set and golden brown in spots, 35–40 minutes. Let cool on a wire rack."
    ],
    "ingredients": [
        "All-Butter Pie Dough",
        "All-purpose flour (for surface)",
        "5 large eggs",
        "3 heads of garlic, cloves peeled",
        "Kosher salt",
        "1 tablespoon olive oil",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon pure maple syrup",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh thyme",
        "Freshly ground black pepper",
        "6 ounces sharp white cheddar cheese, grated (about 2 cups)",
        "2 cups baby spinach",
        "3/4 cup crème fraîche",
        "3/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Lunch",
        "Cheddar",
        "Spinach",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Garlic, Spinach, and Cheddar Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-garlic-spinach-and-cheddar-tart-51263670"
}
