{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 375°F.",
        "Reserve 2 tablespoons almonds and evenly spread remaining almonds on a baking sheet, then toast in upper third of oven until golden, 5 to 8 minutes. Remove from oven.",
        "Increase oven temperature to 400°F. 3Toss apple wedges with lemon juice and 1/4 teaspoon cinnamon in a large bowl.",
        "Cook 1 tablespoon butter with honey and granulated sugar in a deep 12-inch heavy skillet over moderately high heat, stirring constantly and carefully with a wooden spoon (mixture will foam), until mixture is deep golden, about 6 minutes.",
        "Carefully add apples (caramel will harden, then liquefy), stirring gently from bottom of skillet to coat apples with caramel, and cook, uncovered, stirring occasionally, until apples are tender, about 10 minutes. Drain apples in a colander set over a large bowl, reserving caramel. Transfer apples to another bowl and stir in toasted almonds. Pour caramel through a fine-mesh sieve into a 2-quart heavy saucepan and discard any solids. Simmer briskly until liquid is reduced to a thick glaze (about 1/3 cup), 5 to 10 minutes. Keep slightly warm or at room temperature.",
        "Stir together confectioners sugar and remaining 3/4 teaspoon cinnamon and transfer to a fine-mesh sieve or a sifter.",
        "Brush springform pan with some of remaining butter. Cover stack of phyllo with plastic wrap and a dampened kitchen towel. Keeping remaining phyllo covered, lay 1 sheet on a work surface and brush with butter, then dust lightly with cinnamon sugar. Lift buttered phyllo and gently fit into pan with ends overhanging. Rotate pan slightly, then butter and sugar another sheet and place in pan. (Sheets should not align.) Repeat with 7 more sheets, rotating pan each time so overhang of sheets covers entire rim.",
        "Spread apple mixture evenly in phyllo shell and smooth top.",
        "Brush remaining sheet phyllo with butter and dust with some of cinnamon sugar and lay over filling, gently crumpling sheet slightly to fit in pan. Bring edges of overhanging bottom sheets up and over filling and top sheet to enclose. (Phyllo should look rustic, but avoid tall peaks, as they can burn.) Brush top with remaining butter and sprinkle with reserved almonds. Sift cinnamon sugar generously over pastis and bake in lower third of oven until top is golden brown, 30 to 40 minutes.",
        "Increase oven temperature to 425°F and continue baking until top is deep golden brown and shiny, about 15 minutes. (Some edges may get very dark). Cool pastis in pan on a rack 5 minutes. Remove side of pan carefully and cool pastis 5 minutes. Transfer to a platter and cut into wedges with a serrated knife. Serve warm or at room temperature with caramel sauce."
    ],
    "ingredients": [
        "3/4 cup sliced blanched almonds",
        "8 Gala apples (3 1/2 lb), peeled, cored, and cut into 1/4-inch wedges",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon cinnamon",
        "1 stick (1/2 cup) unsalted butter, melted",
        "1/2 cup honey",
        "1/2 cup granulated sugar",
        "1/2 cup confectioners sugar",
        "10 (17- by 12-inch) phyllo sheets (from 1 package), thawed if frozen",
        "Special equipment: a 9- to 9 1/2-inch (24-cm) springform pan",
        "Accompaniment: vanilla ice cream or whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Almond",
        "Fall",
        "Winter",
        "Honey",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Apple Pastis",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-apple-pastis-231011"
}
