{
    "directions": [
        "Heat 3 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook onions with 1/2 teaspoon salt and 1/4 teaspoon pepper, uncovered, stirring occasionally, until softened and beginning to brown, about 10 minutes. Reduce heat to moderate and continue to cook, stirring occasionally, until tender and golden, about 15 minutes more. Reduce heat to low and continue to cook, stirring occasionally, until very soft and deep golden brown, about 15 minutes more. Remove from heat and cool to warm, about 10 minutes.",
        "Put oven rack in middle position and preheat oven to 475°F.",
        "While onions cool, coat pizza dough with 1 tablespoon oil in a 17- by 12-inch shallow baking pan and stretch and press dough to cover bottom (dough may be resistant to stretching at first, but it will soon relax). Spread onions evenly over dough. Toss mushrooms with 1/4 teaspoon salt, 1/8 teaspoon pepper, and remaining tablespoon oil in a bowl, then spread evenly over onions. Crumble cheese evenly over mushrooms.",
        "Bake pizza until underside of dough is golden and cheese is beginning to brown, 14 to 16 minutes."
    ],
    "ingredients": [
        "5 tablespoons extra-virgin olive oil",
        "1 1/2 lb onions (3 large), thinly sliced",
        "1 lb frozen pizza dough, thawed",
        "6 oz fresh cremini mushrooms, trimmed and thinly sliced",
        "1 (5-oz) package Boursin garlic-herb cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Mushroom",
        "Onion",
        "Brunch",
        "Bake",
        "Super Bowl",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Fall",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized-Onion Pizza with Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-onion-pizza-with-mushrooms-233981"
}
