{
    "directions": [
        "Preheat an oven to 400ºF. Line a baking sheet with aluminum foil.",
        "Place the squash halves, cut side up, on the prepared baking sheet. Drizzle with 1 Tbs. of the olive oil and season with salt and pepper. Roast until the squash is tender when pierced with a fork, 55 to 60 minutes. When the squash is cool enough to handle, using a spoon, scoop out the flesh and place in the bowl of a food processor. Process until the squash is smooth and pureed, stopping the processor to scrape down the sides of the bowl as needed. Transfer to a bowl.",
        "Place 2 mini ceramic pizza stones in the lower third of the oven and increase the oven temperature to 500ºF.",
        "In a large nonstick sauté pan over medium heat, warm 2 Tbs. of the olive oil. Add the onions and cook, stirring occasionally, until caramelized, about 35 minutes, adding the water halfway through cooking. Season with salt and pepper. Transfer to a separate bowl.",
        "In the same pan over medium-high heat, cook the sausage until well browned, about 8 minutes, using a wooden spoon to crumble it into small pieces. Transfer to a separate bowl.",
        "On a lightly floured work surface, roll out the pizza dough into two 10-inch rounds. Transfer 1 round to a floured pizza peel. Top the dough with 1/2 cup of the butternut squash puree and half",
        "each",
        "of the Gruyère, caramelized onions and sausage. Transfer the pizza to one of the pizza stones and bake until the crust is crisp and the cheese is bubbly, 13 to 15 minutes. Meanwhile, assemble and bake the second pizza.",
        "While the pizzas are baking, in a small saucepan over medium heat, warm the canola oil. Working in 2 batches, add the sage leaves and fry until crisp, 1 to 2 minutes. Transfer to a paper towel-lined plate to drain and sprinkle lightly with salt.",
        "Remove the pizzas from the oven and scatter the fried sage leaves on top. Sprinkle with the Parmigiano-Reggiano and drizzle with olive oil. Cut the pizzas into slices and serve immediately. Makes two 10-inch pizzas.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1 small butternut squash, about 1 3/4 lb., halved lengthwise and seeds removed",
        "3 Tbs. extra-virgin olive oil, plus more for drizzling",
        "Kosher salt and freshly ground pepper, to taste",
        "2 yellow onions, halved and cut into 1/4-inch-thick slices",
        "1/3 cup water",
        "8 oz. sweet Italian sausage, casings removed",
        "All-purpose flour for dusting",
        "1 batch Thin Crust Pizza Dough",
        "5 oz. Gruyère cheese, shredded",
        "1/4 cup canola oil",
        "24 fresh sage leaves",
        "2 Tbs. grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Caramelized Onion and Gruyère Pizza",
    "url": "http://www.williams-sonoma.com/recipe/caramelized-onion-and-gruyere-pizza.html"
}
