{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13 inch baking pan.",
        "Sift the flour before measuring then resift with the 1 cup of the packed brown sugar.",
        "Add the butter or margarine, eggs, milk, salt, baking powder and 1 teaspoon of the vanilla to the flour mixture and beat on medium high speed of an electric mixer for 2 to 3 minutes. (Use the whisk attachment for best results.)  Spread batter into the prepared pan.",
        "Bake at 350 degrees F (175 degrees C) for 30 minutes or until a cake tester comes out clean. Remove cake from oven and place on a wire rack for 10 minutes then remove pan and place cake on a serving dish. Once cake is cooled completely frost with Caramel Icing.",
        "To Make Caramel Icing: In a saucepan over medium heat stir the 2 remaining cups of brown sugar, and the cream until the sugar is dissolved. Cover and cook for 3 minutes. Uncover and cook without stirring till a candy thermometer reads 238 to 240 degrees F (113 to 115 degrees C). Stir in the remaining butter with a wooden spoon. Remove the icing from the heat and let cool to 110 degrees F (55 degrees C). Add the remaining 1 teaspoon vanilla. Beat the icing until it is thick and creamy. If it becomes heavy, thin it out with cream until the right consistency appears. Spread over the top of the cooled cake and top with chopped pecans."
    ],
    "ingredients": [
        "1 3/4 cups all-purpose flour",
        "1 cup packed brown sugar",
        "1/2 cup butter, softened",
        "2 eggs",
        "1/2 cup milk",
        "1/2 teaspoon salt",
        "1 3/4 teaspoons baking powder",
        "1 teaspoon vanilla extract",
        "2 cups packed brown sugar",
        "1 cup heavy whipping cream",
        "3 tablespoons butter",
        "1 teaspoon vanilla extract",
        "1/4 cup chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Caramel Cake I",
    "url": "http://allrecipes.com/recipe/7815/caramel-cake-i/"
}
