{
    "directions": [
        "Peel, halve, and core pears.",
        "In a 9- to 10-inch ovenproof non-stick skillet or well-seasoned cast-iron skillet heat butter over moderate heat until foam subsides and stir in sugar (sugar will not be dissolved). Arrange pears, cut sides up, in skillet, with side parts at rim of skillet. Sprinkle pears with cinnamon and cook without stirring until sugar mixture forms a deep golden caramel. (This can take as little as 10 minutes or as much as 25, depending on skillet and stove.) Cool pears completely in skillet.",
        "Preheat oven to 425°F.",
        "On a lightly floured surface with a floured rolling pin roll out dough into an 11-inch round (about 1/8 inch thick) and arrange over caramelized pears. Tuck edge around pears. Bake tart in middle of oven until pastry is golden brown, 30 to 35 minutes.",
        "Have ready a rimmed serving plate slightly larger than skillet. As soon as tart has finished baking, invert plate over skillet and, wearing oven mitts and keeping plate and skillet firmly pressed together, invert tart onto plate. (This is a bit scary, but it works!)",
        "Serve tart at room temperature or chilled with whipped cream or ice cream."
    ],
    "ingredients": [
        "2 pounds firm-ripe Bosc pears (3 to 5)",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup sugar",
        "1/2 teaspoon cinnamon",
        "Pastry Dough",
        "Accompaniment: sweetened whipped cream or vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pear",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramelized Upside-Down Pear Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-upside-down-pear-tart-14504"
}
