{
    "directions": [
        "Preheat oven to 400°F.",
        "Between 2 sheets of wax paper roll out dough into a 14-inch round (about 1/8 inch thick). Transfer dough to a baking sheet and chill 10 minutes. Lift top sheet of wax paper from dough and gently replace on top (this will facilitate removal of paper later). Flip dough over, discarding wax paper now on top, and carefully invert dough into an 11-inch tart pan with a removable fluted rim. Lightly press dough up side of rim, using pieces from overhang to patch any holes. Chill shell 30 minutes, or until firm.",
        "Line shell with foil, folding over edge to cover pastry entirely, and fill with pie weights or raw rice. Bake shell on a baking sheet in middle of oven 35 minutes and carefully remove foil and weights or rice. If bottom of crust still has patches of translucent undercooked dough, return shell to oven without foil and weights or rice and bake until pastry is completely cooked and golden, 3 to 5 minutes more. Cool shell in pan on a rack.",
        "Reduce temperature to 350°F.",
        "Coarsely chop nuts. In a 3-quart heavy saucepan melt butter with brown sugar and honey, stirring, and simmer 1 minute. Stir in nuts and cream. Simmer mixture 1 minute and pour into shell. Bake tart on baking sheet in middle of oven 30 minutes, or until filling is a few shades darker. Cool tart in pan on rack.",
        "Chop chocolate and in a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Cool chocolate slightly and transfer to a pastry bag fitted with a #3 plain tip (slightly smaller than 1/8 inch). (Alternatively, transfer chocolate to a small heavy-duty sealable plastic bag. Squeeze chocolate into one corner of bag and with scissors cut a tiny slice off corner to form a small hole.) Pipe thin lines of chocolate over tart in a back and forth motion to form stripes. Tart may be made 2 days ahead and chilled, covered.",
        "Serve caramel tart chilled or at room temperature with ice cream and tuiles."
    ],
    "ingredients": [
        "all-butter pastry dough",
        "3 cups pie weights or raw rice for weighting shell",
        "1 1/2 cups pecans (about 6 ounces)",
        "1 1/2 cups walnuts (about 6 ounces)",
        "1 stick (1/2 cup) unsalted butter",
        "1 cup packed light brown sugar",
        "1/2 cup honey",
        "1/2 cup heavy cream",
        "2 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "ginger ice cream",
        "cinnamon nutmeg tuiles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Pecan",
        "Walnut",
        "Fall",
        "Honey",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Nut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-nut-tart-15701"
}
