{
    "directions": [
        "Peel and core pears and cut into 1/4-inch dice. With a knife halve vanilla bean lengthwise and scrape seeds into a small bowl. In a dry 5-quart heavy kettle cook sugar over moderately low heat, stirring slowly with a fork (to help sugar melt evenly), until melted and pale golden. Cook caramel, without stirring, gently swirling kettle, until deep golden. Remove kettle from heat and carefully add pears and vanilla bean pod and seeds (mixture will vigorously steam and caramel will harden). Cook mixture over moderate heat, stirring occasionally, until caramel is dissolved and pears are tender but still hold their shape, about 15 minutes. Drain pear mixture in a sieve set over a bowl and reserve any pear juices for sauce. Discard vanilla bean pod.",
        "Preheat oven to 375°F.",
        "Butter bread slices on 1 side. Using 12 slices of bread, cut 6 bread rounds to fit in bottoms of six 2/3-cup charlotte molds or ramekins and cut 6 rounds the same size as tops of molds or ramekins. Discard crusts from remaining 8 bread slices and cut slices into 1 1/4-inch-wide strips. Put bottom rounds, buttered sides down, in molds or ramekins and arrange strips vertically, buttered sides against insides of molds or ramekins, slightly overlapping and pressing them gently to adhere. Trim any overhang flush with rims. Divide pear mixture among molds or ramekins and top with remaining rounds, buttered sides up, pressing gently. Charlottes may be made up to this point 3 hours ahead and chilled, covered.",
        "Bake charlottes on a baking sheet in middle of oven until bread is golden, about 25 minutes.",
        "In a dry 5-quart heavy kettle cook sugar over moderately low heat, stirring slowly with a fork (to help sugar melt evenly), until melted and pale golden. Cook caramel, without stirring, gently swirling kettle, until deep golden. Remove kettle from heat and carefully add cream, butter, and any reserved pear juices (mixture will vigorously steam and caramel will harden). Simmer mixture, stirring, until caramel is dissolved and stir in poire William. Invert charlottes onto 6 plates and spoon sauce over them."
    ],
    "ingredients": [
        "6 firm-ripe Bosc pears (about 2 3/4 pounds)",
        "1/2 vanilla bean",
        "2 tablespoons sugar",
        "1 stick (1/4 cup) unsalted butter, softened",
        "20 slices firm white sandwich bread (from about two 1-pound loaves)",
        "1 cup sugar",
        "3 tablespoons heavy cream",
        "3 tablespoons unsalted butter",
        "3 tablespoons poire William (French pear brandy)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Eau de Vie",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caramel Pear Charlottes with Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/caramel-pear-charlottes-with-caramel-sauce-15754"
}
