{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add onions and sauté until slightly softened, about 5 minutes. Reduce heat to medium-low and cook until onions are deep brown and begin to crisp slightly, stirring often, about 40 minutes. Add garam masala; stir 1 minute. Transfer to small bowl and cool completely. Mix in crème fraîche. Season to taste with salt and pepper. Cover and refrigerate at least 2 hours. Do ahead Can be made 2 days ahead. Keep refrigerated.",
        "Finely chop enough cilantro leaves to measure 2 tablespoons. Chop enough cilantro stems to measure 3 tablespoons. Combine oil and garlic in heavy small saucepan; cook over medium heat until oil begins to bubble around garlic, about 5 minutes. Add chopped cilantro stems. Remove from heat and let steep 10 minutes. Strain oil into small bowl; discard solids in strainer.",
        "Preheat oven to 350°F. Cut each pita bread round horizontally in half. Cut each round into 6 wedges. Place pita wedges on 2 rimmed baking sheets; drizzle with cilantro-garlic oil and toss gently to coat. Arrange pita wedges in single layer; bake 5 minutes. Sprinkle with chopped cilantro leaves and bake until pita wedges are crisp and golden, about 5 minutes longer. Cool. Do ahead Can be made 1 day ahead. Store airtight at room temperature. Sprinkle dip with chives; place on platter. Surround with pita crisps."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "3 cups chopped sweet onions (such as Vidalia or Maui; about 2 medium)",
        "1 1/2 teaspoons garam masala",
        "1 8-ounce container crème fraîche or sour cream (1 cup)",
        "1/2 bunch fresh cilantro",
        "1/4 cup extra-virgin olive oil",
        "2 garlic cloves, crushed",
        "6 pita breads",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Garlic",
        "Onion",
        "Bake",
        "Sauté",
        "Cocktail Party",
        "Vegetarian",
        "Chill",
        "Sour Cream",
        "Cilantro"
    ],
    "title": "Caramelized-Onion Dip with Cilantro-Garlic Pita Crisps",
    "url": "http://www.epicurious.com/recipes/food/views/caramelized-onion-dip-with-cilantro-garlic-pita-crisps-236164"
}
