{
    "directions": [
        "Arrange racks in lower and upper thirds of oven; preheat to 350°F. Line 2 baking sheets with parchment paper. Whisk first 4 ingredients in a medium bowl. Combine 1/2 cup sugar and pecans in a food processor; pulse until coarse meal forms. Using an electric mixer, beat butter and vanilla in a medium bowl until creamy, 2-3 minutes. Add nut mixture; beat to blend. Add dry ingredients; blend well (dough will be moist but still crumbly). Transfer to a work surface; knead to form a ball, about 4 turns.",
        "Measure 1 rounded tablespoon of dough; form into a ball, then roll into a 1 1/2\"-long log. Gently bend into a crescent shape, pinching ends to taper (cookies may crack slightly). Repeat with remaining dough, spacing about 1\" apart on prepared sheets.",
        "Bake, rotating sheets halfway through baking, until bottoms are golden, 12-15 minutes. Sift remaining 1 cup powdered sugar into a shallow wide bowl. Working in batches of about 8 cookies each, roll warm cookies gently in powdered sugar to coat. Transfer to a wire rack to let cool. Roll or dust cooled cookies with powdered sugar. DO AHEAD: Can be made 5 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "3/4 teaspoon ground cardamom",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt",
        "1 1/2 cups powdered sugar, divided",
        "1 cup pecans",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 tablespoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dessert",
        "Bake",
        "Christmas",
        "Low Cal",
        "Low Sodium",
        "Spice",
        "Edible Gift",
        "Cinnamon",
        "Christmas Eve",
        "Cardamom",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cardamom Crescents",
    "url": "http://www.epicurious.com/recipes/food/views/cardamom-crescents-368951"
}
