{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Oil springform pan and dust with matzo meal, knocking out excess.",
        "Pulse almonds in a food processor with 1/2 cup matzo meal, 1/4 teaspoon salt, and cardamom until finely ground. (Be careful not to pulse to a paste.)",
        "Beat yolks in a large bowl with an electric mixer at medium-high speed until smooth, then add 3/4 cup sugar, 1 tablespoon at a time, beating, and beat until mixture is very thick and pale, 2 to 3 minutes. Stir in nut mixture, then apples. Beat whites and remaining 1/4 teaspoon salt in another bowl with cleaned beaters at medium speed until they hold soft peaks. Add remaining 1/4 cup sugar, a little at a time, beating, and beat until whites just hold stiff peaks. Stir one fourth of whites into yolk mixture to lighten, then fold in remaining whites gently but thoroughly. Scrape batter into pan and rap pan once on work surface to eliminate any large air bubbles.",
        "Bake cake until puffed, browned, and top springs back when touched, 40 to 45 minutes. Transfer to a rack and cool completely in pan (cake will sink slightly in center). Run a knife around edge of cake to loosen, then remove side of pan.",
        "Grind sugar in coffee/spice grinder until powdered, then stir together with potato starch in a bowl. Sift some of sugar over cake before serving and reserve remainder for another use."
    ],
    "ingredients": [
        "Vegetable oil for greasing pan",
        "1/2 cup matzo meal (not cake meal), plus additional for dusting",
        "1 cup slivered almonds (4 1/2 oz), toasted and cooled",
        "1/2 teaspoon salt",
        "Scant 1/2 teaspoon ground cardamom",
        "5 large eggs, separated, at room temperature for 30 minutes",
        "1 cup granulated sugar",
        "2 Granny Smith apples, peeled and coarsely grated",
        "1/3 cup granulated sugar",
        "1/2 teaspoon potato starch",
        "Special equipment: a 9- to 9 1/2-inch (24-cm) springform pan; an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Passover",
        "Apple",
        "Almond",
        "Spice",
        "Spring",
        "Kosher",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Cardamom Apple Almond Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cardamom-apple-almond-cake-231812"
}
