{
    "directions": [
        "Whisk together yogurt, sugar, and vanilla in a small bowl until sugar is dissolved. Put water in a very small saucepan and tilt pan so that water is on one side, then sprinkle gelatin and cardamom evenly over water. Let stand 1 minute to soften. Heat mixture over low heat, stirring, until gelatin is dissolved, about 30 seconds. Whisk hot gelatin into yogurt until combined well. Pour yogurt into ramekin and chill, covered, until set, about 1 1/2 hours.",
        "While yogurt is chilling, cut peel and white pith from orange with a sharp knife. Working over a small bowl, cut segments free from membranes from half of orange, letting segments fall into bowl, then squeeze 1 tablespoon juice from remaining half of orange and, if necessary, from membranes.",
        "Bring orange juice, honey, and cinnamon to a simmer in cleaned very small saucepan, stirring, then simmer until reduced to about 1 tablespoon, about 1 minute. Add orange segments to syrup, gently stirring to coat. Cool to room temperature, about 10 minutes.",
        "Run a thin knife around edge of ramekin to loosen pudding, then dip ramekin into a bowl of hot water 30 seconds and invert pudding onto a plate. Spoon syrup over pudding and arrange orange around side."
    ],
    "ingredients": [
        "1/2 cup plain whole-milk yogurt",
        "1 1/2 tablespoons sugar",
        "1/4 teaspoon vanilla",
        "2 teaspoons water",
        "1/2 teaspoon unflavored gelatin (from 1 envelope)",
        "Pinch ground cardamom",
        "1 navel orange",
        "1 tablespoon mild honey (preferably orange blossom)",
        "Small pinch cinnamon",
        "Special equipment: a 1-cup ramekin (4 inches across and about 2 inches deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Orange",
        "Chill",
        "Healthy",
        "Honey",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cardamom Yogurt Pudding with Orange and Cinnamon Honey Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/cardamom-yogurt-pudding-with-orange-and-cinnamon-honey-syrup-109474"
}
