{
    "directions": [
        "Whisk together the flour, 1 tablespoon curry powder, and 1 teaspoon of salt in a mixing bowl. Mix in the vegetable shortening until the mixture resembles cornmeal. Stir in the egg and water until the dough is no longer crumbly. Wrap with plastic wrap, and refrigerate while preparing the filling.",
        "Heat the vegetable oil in a large skillet over medium heat. Cook and stir the onion, green onion, garlic, and jalapeno peppers until the onion has softened and turned translucent, about 5 minutes. Stir in the ground beef, and cook until browned and crumbly, about 15 minutes. Drain excess fat from the pan, then stir in the thyme, 2 teaspoons curry powder, 1 teaspoon salt, black pepper, and the 1 1/2 cups of water. Bring to a simmer, cover, and cook until the water has evaporated. Transfer the beef mixture to a food processor, sprinkle in the bread crumbs, and process until the mixture has become a paste.",
        "Preheat an oven to 400 degrees F (200 degrees C). Line two baking sheets with parchment paper.",
        "Roll out the dough on a lightly floured surface to just under 1/4-inch thick. Cut 20 6-inch circles out of the dough. Divide the beef mixture among half of the circles, mounding in the center. Place the unfilled circles over the filling, and use a fork to seal the edges closed. Arrange on the baking sheets.",
        "Bake in the preheated oven until golden brown and hot on the inside, about 25 minutes."
    ],
    "ingredients": [
        "Dough:",
        "3 cups all-purpose flour",
        "1 tablespoon curry powder",
        "1 teaspoon salt",
        "1 cup vegetable shortening",
        "1 egg, beaten",
        "3 tablespoons water",
        "Filling:",
        "1/4 cup vegetable oil",
        "1 onion, chopped",
        "3 green onions, chopped",
        "1 clove garlic, minced",
        "2 tablespoons chopped pickled jalapeno peppers",
        "1 pound ground beef",
        "1 teaspoon dried thyme",
        "2 teaspoons curry powder",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 1/2 cups water",
        "1/2 cup bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Caribbean Meat Pockets",
    "url": "http://allrecipes.com/recipe/214956/caribbean-meat-pockets/"
}
