{
    "directions": [
        "Using electric mixer, beat butter until smooth. Beat in sugar. Gradually beat in brandy. (Can be prepared 1 week ahead. Cover and refrigerate. Bring to room temperature before serving.)",
        "Mix currants, candied cherries, prunes, orange peel, cinnamon, ginger, nutmeg and salt in large bowl. Pour rum over and stir to blend. Let stand 30 minutes.",
        "Mix breadcrumbs, sugar and flour in medium bowl. Add to dried fruit mixture and stir to blend. Cover and let stand at room temperature overnight.",
        "Generously butter 2-quart pudding mold with lid. Mix almonds and baking powder in medium bowl. Whisk melted butter, eggs, milk, vanilla extract and almond extract in large bowl. Stir in almond mixture. Stir butter mixture into dried fruit mixture. Spoon batter into prepared pudding mold. Smooth top. Cover pudding mold with lid.",
        "Place pudding mold on rack in large pot. Add enough boiling water to pot to come halfway up sides of mold. Cover pot and steam pudding over medium-low heat until tester inserted into center comes out clean, adding more boiling water to pot if necessary, about 2 hours. Transfer mold to rack and cool 5 minutes. Turn out pudding. (Can be made 1 week ahead. Cool. Wrap tightly in plastic and refrigerate. To reheat pudding, unwrap and return to buttered mold; cover mold. Place mold on rack in large pot. Add enough hot water to pot to come halfway up sides of mold. Cover pot and steam pudding over medium-low heat until heated through, about 45 minutes. Transfer mold to rack. Let stand 5 minutes. Turn out pudding.)",
        "Transfer pudding to platter. Serve warm with brandy butter."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 cup powdered sugar",
        "5 tablespoon brandy",
        "1 2/3 cups dried currants (about 8 ounces)",
        "3/4 cup candied cherries or other chopped dried fruit such as apricots or figs (about 4 ounces)",
        "3/4 cup pitted prunes, chopped (about 4 ounces)",
        "1/4 cup chopped candied orange peel",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 teaspoon ground ginger",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "1/2 cup dark rum",
        "3 cups fresh white breadcrumbs",
        "1/2 cup (packed) golden brown sugar",
        "6 tablespoons all purpose flour",
        "1/4 cup finely chopped almonds",
        "1/2 teaspoon baking powder",
        "1/2 cup (1 stick) unsalted butter, melted, cooled slightly",
        "3 large eggs",
        "1/4 cup milk",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Fruit",
        "Dessert",
        "Steam",
        "Christmas",
        "Currant",
        "Prune",
        "Cherry",
        "Almond",
        "Spice",
        "Brandy",
        "Winter",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Caribbean Christmas Pudding with Brandy Butter",
    "url": "http://www.epicurious.com/recipes/food/views/caribbean-christmas-pudding-with-brandy-butter-932"
}
