{
    "directions": [
        "Mix together the paprika, curry powder, cumin, allspice, ginger, coriander, salt, black pepper, fennel, and cayenne pepper in a bowl; set the spice mix aside.",
        "In a bowl, lightly toss the mango, pineapple, red bell pepper, black beans, red onion, and cilantro in a bowl; pour lime juice over the mango mixture, and toss again. Cover the bowl, and refrigerate until chilled, at least 30 minutes.",
        "Whisk together the egg and milk in a bowl. In a separate shallow bowl, stir the panko crumbs with coconut. Stir about 1 tablespoon of the spice mix, or to taste, into the panko crumb mixture.",
        "Heat olive oil in a skillet over medium heat. Dip tilapia fillets into the egg mixture, then press gently into the panko crumb mixture to coat both sides of fillets. Brush off any loose crumbs, then lay the fillets into the hot oil. Pan-fry until the fish is opaque inside and golden brown outside, 3 to 5 minutes per side or as needed. Serve with mango salsa."
    ],
    "ingredients": [
        "Fish Spice:",
        "1 tablespoon paprika",
        "2 teaspoons curry powder",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons ground allspice",
        "1 teaspoon ground ginger",
        "1 teaspoon ground coriander",
        "3/4 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground fennel seed (optional)",
        "1/8 teaspoon cayenne pepper (optional)",
        "Mango Salsa:",
        "1 mango - peeled, seeded and diced",
        "1 cup chopped fresh pineapple",
        "1/2 red bell pepper, chopped",
        "1/2 cup black beans, rinsed and drained (optional)",
        "1/2 red onion, finely chopped",
        "3 tablespoons chopped fresh cilantro",
        "3 tablespoons fresh lime juice",
        "1 egg",
        "1/3 cup milk",
        "1 cup panko bread crumbs",
        "1 tablespoon dried unsweetened coconut, or to taste (optional)",
        "1 tablespoon olive oil, or as needed",
        "5 (4 ounce) fillets tilapia"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Caribbean Fish With Mango Salsa",
    "url": "http://allrecipes.com/recipe/218348/caribbean-fish-with-mango-salsa/"
}
