{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Nest 2 large aluminum turkey-roasting pans together for strength. Rinse and pat the turkey dry with paper towels, and place turkey into the doubled pans.",
        "Place the sausage into a large skillet over medium heat, and cook until browned and crumbly, breaking it up into chunks as it cooks. Place the sausage with the pan drippings into a large mixing bowl.",
        "Mix in the dry stuffing mix, green onion, parsley flakes, 1/2 cup of softened butter, sage, salt, and black pepper until thoroughly combined, then moisten the stuffing with the chicken broth. If stuffing seems dry, mix in water, about 1 tablespoon at a time, until stuffing is desired consistency.",
        "Lightly stuff the main and neck cavities with the stuffing; place any extra stuffing into a baking dish, and cover with foil. Refrigerate the pan of stuffing. Generously rub the outside of the turkey with 1/4 cup of softened butter, or as needed; sprinkle the turkey with salt. Cover the turkey with foil.",
        "Roast in the preheated oven until the turkey drumstick twists easily in the socket and the juices run clear, about 4 hours. Check the level of pan drippings, and remove excess drippings if needed. Roast turkey an additional 1 hour and recheck and remove drippings if necessary; bake an additional 30 minutes, and uncover the turkey.",
        "Heat the oven's broiler. Broil the turkey, basting often, until golden brown, about 15 more minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read 180 degrees F (80 degrees C). About 2 hours before serving time, bake the pan of dressing if desired."
    ],
    "ingredients": [
        "1 (18 pound) whole turkey, neck and giblets removed",
        "1 (16 ounce) package sage pork sausage (such as Bob Evans®)",
        "2 (14 ounce) packages dry herb-flavored stuffing mix (such as Pepperidge Farm Herb Seasoned Stuffing®)",
        "2 bunches green onion, chopped (green part only)",
        "1 cup dried parsley flakes",
        "1/2 cup butter, softened",
        "1 1/2 tablespoons dry rubbed sage",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 (32 ounce) cans chicken broth",
        "1/4 cup water, or as needed (optional)",
        "1/4 cup butter, softened, or as needed",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carl's Turkey Stuffing",
    "url": "http://allrecipes.com/recipe/219612/carls-turkey-stuffing/"
}
