{
    "directions": [
        "Heat 2 Tbsp. oil in a Dutch oven or other large heavy pot over medium-low. Add shallots and sliced fennel and season with salt. Cook, stirring occasionally, until vegetables are very soft and just beginning to take on color, 20 minutes. Add fennel seeds, paprika, and cayenne, if using, and cook, stirring often, until incorporated and very fragrant, about 1 minute. Add tomatoes, crushing them with your hands as you go, season with salt and pepper, and bring to a simmer. Cook, stirring occasionally, until tomatoes are beginning to fall apart, 25–35 minutes.",
        "Transfer tomato mixture to a blender, add butter and 1 1/2 cups of water, and purée, adding more water if too thick, until smooth (or use an immersion blender directly in the pot). Taste and season with salt and pepper; return to pot. Keep warm, stirring occasionally, over low heat.",
        "Heat 2 Tbsp. oil in a medium skillet, preferably cast-iron, over medium-low. Fry 2 slices of bread until deep golden brown, about 2 minutes per side. Transfer to paper towels. Add 1 Tbsp. oil to skillet and repeat with another 2 slices of bread. Repeat with remaining 1 Tbsp. oil and remaining bread. Season with sea salt. Halve toast and serve with soup.",
        "Soup can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "6 tablespoons olive oil, divided",
        "6 medium shallots, thinly sliced",
        "1 medium fennel bulb, thinly sliced",
        "Kosher salt",
        "1 teaspoon fennel seeds",
        "2 teaspoons smoked paprika",
        "1/4 teaspoon cayenne pepper (optional)",
        "2 (28-ounce) cans whole peeled San Marzano tomatoes",
        "Freshly ground black pepper",
        "3 tablespoons unsalted butter",
        "6 slices thick country-style bread",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Kid-Friendly",
        "Quick and Healthy",
        "Fennel",
        "Dinner",
        "Winter"
    ],
    "title": "Carla's Tomato Soup",
    "url": "http://www.epicurious.com/recipes/food/views/carlas-tomato-soup"
}
