{
    "directions": [
        "In a small bowl, combine the salt and pepper. Season the pork roast generously with the mixture.",
        "In a large fry pan over medium-high heat, warm the olive oil. Add the pork and cook, turning frequently until browned on all sides, about 10 minutes. Transfer to a platter and set aside.",
        "Pour off all but a thin layer of fat in the pan. Add the onion and garlic and sauté just until they begin to soften, 1 to 2 minutes. Add the beer and deglaze the pan, stirring and scraping up the browned bits from the pan bottom with a wooden spoon.",
        "Oven method: Preheat an oven to 350°F. Transfer the pork to a large Dutch oven and pour in the beer mixture. Add the orange and lime zests and juices and the oregano. Cover and cook until the pork is very tender, about 2 1/2 hours.",
        "Slow-cooker method: Transfer the pork to a slow cooker and pour in the beer mixture. Add the orange and lime zests and juices and the oregano. Cover and cook according to the manufacturer's instructions until the pork is very tender, about 5 hours on high or 10 hours on low.",
        "Transfer the pork to a carving board and cover loosely with aluminum foil. Using a large, shallow spoon or a ladle, skim as much fat as possible from the surface of the cooking liquid. Using a large, sharp knife and a fork, coarsely cut and shred the pork into small bite-size pieces.",
        "Arrange the meat on a warmed platter or individual plates, moisten it lightly with the cooking juices, and serve immediately with the tortillas, lime wedges, chopped onion, salsa and cilantro. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "Essentials of Slow Cooking,",
        "by Melanie Barnard, Charles Pierce & Denis Kelly (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "2 tsp. salt",
        "1 tsp. freshly ground pepper",
        "1 boneless pork shoulder roast, 3 to 4 lb.",
        "1/4 cup olive oil",
        "1 yellow onion, finely chopped",
        "2 garlic cloves, minced",
        "1 1/2 cups Mexican lager-style beer",
        "Grated zest and juice of 1 large orange",
        "Grated zest and juice of 1 lime",
        "1 Tbs. dried oregano",
        "Warm corn or flour tortillas",
        "Lime wedges",
        "Chopped yellow onion",
        "Hot or mild salsa",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Carnitas",
    "url": "http://www.williams-sonoma.com/recipe/carnitas.html"
}
