{
    "directions": [
        "Stir together cayenne pepper, paprika, black pepper, cumin, onion powder, garlic powder, allspice, thyme, and 1/4 cup olive oil in a large bowl until evenly mixed. Smear the flat iron steaks with this paste, then wrap with plastic wrap, or place into a resealable plastic bag. Marinate in refrigerator for 6 hours.",
        "Prepare avocado salad by gently mixing cubed avocado, green onion, red bell pepper, red onion, cilantro, and tomatoes. Drizzle with lime juice and olive oil; season to taste with salt and pepper. Cover and refrigerate until ready to use.",
        "Preheat an outdoor grill for medium-high heat and lightly oil grate.",
        "Grill flat iron steaks until cooked to desired degree of doneness, or to an internal temperature of 135 degrees F (57 degrees C) for medium-rare, about 4 minutes per side. Remove from grill and allow to rest for 5 to 10 minutes. While the steaks are resting, cut each baguette into three pieces, then halve the pieces horizontally. Toast bread, cut-side down on grill until golden brown. Turn baguettes over, and place sliced cheese on the cut sides; allow cheese to melt.",
        "To assemble sandwiches, thinly slice the flat iron steaks across the grain, and pile onto baguettes. Top with avocado salad before serving."
    ],
    "ingredients": [
        "2 tablespoons cayenne pepper",
        "6 tablespoons paprika",
        "3 tablespoons ground black pepper",
        "1 tablespoon ground cumin",
        "3 tablespoons onion powder",
        "3 tablespoons garlic powder",
        "1 tablespoon ground allspice",
        "1 tablespoon ground dried thyme",
        "1/4 cup olive oil",
        "4 pounds flat iron steaks",
        "3 avocados - peeled, pitted, and cubed",
        "1/4 cup chopped green onions",
        "1 large red bell pepper, diced",
        "1 red onion, diced",
        "1/4 cup chopped cilantro",
        "2 tomatoes, seeded and chopped",
        "1/4 cup fresh lime juice",
        "2 tablespoons olive oil",
        "sea salt and ground black pepper to taste",
        "2 (1 pound) French baguettes",
        "1/2 pound thinly sliced Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carne Asada Steak Sandwich with Avocado Salad",
    "url": "http://allrecipes.com/recipe/149972/carne-asada-steak-sandwich-with-avoca/"
}
