{
    "directions": [
        "Combine first 8 ingredients in heavy large saucepan. Simmer over medium heat 5 minutes. Remove from heat, cover, and let stand 2 hours.",
        "Place handful of torn newspaper in bottom of charcoal chimney. Top with 30 charcoal briquettes. Remove top rack from grill. Place chimney on lower grill rack. Light newspaper; let charcoal burn until ash is gray, about 30 minutes.",
        "Open bottom grill vent. Turn hot charcoal onto 1/2 of bottom rack. Using metal spatula, spread charcoal to cover approximately 1/3 of rack. Fill 2 small foil loaf pans halfway with water and place next to charcoal on bottom rack. Sprinkle 1 cup chips over coals.",
        "Place top rack on grill. Arrange pork shoulder halves on top rack above loaf pans. Cover grill with lid, positioning top vent directly over pork. Place stem of meat thermometer in top vent with gauge on outside and tip near roast (thermometer should not touch meat or grill rack); leave in place during cooking. Use top and bottom vents to maintain temperature between 250°F and 325°F, opening vent wider to increase heat and closing to decrease heat. Leave other vents closed. Check temperature every 20 minutes.",
        "Cook pork 3 hours. About once an hour, light more charcoal in chimney set on bricks or cement to replenish charcoal in grill. Add 12 hot ash-tinged briquettes and 1 cup drained wood chips when cooking temperature drops below 250°F. Using sharp knife, make several crosswise slashes in meat (do not cut through). Brush with some of sauce. Cover and continue cooking pork until meat thermometer inserted into center of pork registers 165°F, about 2 1/2 hours longer, adding additional hot briquettes and chips as necessary to maintain temperature and basting occasionally with sauce.",
        "Transfer pork to cutting board; remove any tough rind. Chop meat into bite-size pieces. Transfer meat to large bowl and add enough sauce to moisten. Arrange bun bottoms on work surface. Top buns with pork; cover with tops. Serve, passing additional sauce."
    ],
    "ingredients": [
        "4 cups apple cider vinegar",
        "1 cup ketchup",
        "1/4 cup Worcestershire sauce",
        "3 tablespoons (packed) golden brown sugar",
        "2 tablespoons Dijon mustard",
        "2 tablespoons salt",
        "1 tablespoon dried crushed red pepper",
        "2 teaspoons black pepper",
        "1 10-pound bag charcoal briquettes",
        "6 cups (about) hickory-wood chips, soaked in cold water 30 minutes, drained",
        "2 untrimmed boneless pork shoulder halves (Boston butt; about 7 pounds)",
        "12 hamburger buns, split"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Pork",
        "Vinegar",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Carolina Chopped Pork Barbecue Sandwiches with Spicy Vinegar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/carolina-chopped-pork-barbecue-sandwiches-with-spicy-vinegar-sauce-108296"
}
