{
    "directions": [
        "Spray the inside of a slow cooker with cooking spray.",
        "Put the onions in the slow cooker. Make slits in the pork roast and insert\nthe garlic cloves. Rub salt, pepper, brown sugar, and red pepper flakes into\nthe meat. Place the pork in the slow cooker fat side up and pour in the\nvinegar and apple cider. Cover and cook on low for at least 10 hours and up\nto 12 hours, until the meat is falling-apart tender.",
        "Transfer the meat to a large bowl and shred it with two forks. Set aside.",
        "Pour 2 cups of the pan juices into a measuring cup; discard any leftover juices still in the pot. Let cool and skim off any visible fat. Pour this liquid into a saucepan. Add the water, ketchup, cider vinegar, brown sugar, Worcestershire sauce, chili powder, paprika, dry mustard, and red pepper flakes. Bring to a boil and simmer, uncovered, for 10 minutes. Season with salt and pepper. Return the shredded pork to the slow cooker and add 1 cup of the sauce mixture (more if you like it wet). Give it a stir and set the slow cooker to warm until ready to serve.",
        "Serve the pork straight from the slow cooker with a slotted spoon, along\nwith buns, slaw, and hot sauce. Serve the additional sauce on the side."
    ],
    "ingredients": [
        "2 large onions, sliced",
        "5-pound boneless pork shoulder roast",
        "6 cloves garlic, smashed",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons brown sugar",
        "1 1/2 teaspoons dried red pepper flakes",
        "1 cup cider vinegar",
        "1 cup apple cider or apple juice",
        "2 cups cooking liquid (reserved from the slow-cooked pork)",
        "1/2 cup water",
        "1/4 cup ketchup",
        "1/4 cup cider vinegar",
        "2 teaspoons brown sugar",
        "1 1/2 teaspoons Worcestershire sauce",
        "1 1/2 teaspoons chili powder",
        "1 teaspoon paprika",
        "1 teaspoon dry mustard powder",
        "1/4 teaspoon red pepper flakes",
        "Salt and black pepper",
        "Buns, slaw, and hot sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Sandwich",
        "Grill/Barbecue",
        "North Carolina"
    ],
    "title": "Carolina-Style Pork BBQ Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/carolina-style-pork-bbq-sandwiches"
}
