{
    "directions": [
        "Blend first 4 ingredients in blender until aniseed is finely chopped, abut 1 minutes. Strain dressing into medium bowl, pressing hard on seeds in strainer; discard seeds. Whisk in orange peel and honey. Season with salt and pepper.",
        "Steam cauliflower until crisp-tender, about 6 minutes. transfer to medium bowl. Steam carrots until tender but still bright in color, about 8 minutes. Transfer to another bowl. Steam beets until tender, adding more water to pot if needed, about 15 minutes. Transfer to another bowl. Cool all vegetables completely.",
        "Mix 1/2 cup dressing into cauliflower. Mix 1/4 cup dressing into beets. (Dressing and marinated vegetables can be made ahead. Cover separately and chill up to 1 day. Bring to room temperature before continuing.)",
        "Rinse and dry beet greens. Arrange on platter as base for salad. Drain dressing from vegetables. Overlap carrots around edge of platter. Arrange cauliflower in ring within carrots. Mound beets in center. Drizzle with some of remaining dressing. Serve salad with pita breads and any remaining dressing."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons olive oil",
        "6 tablespoons white wine vinegar",
        "3 tablespoons frozen orange juice concentrate, thawed",
        "2 tablespoons aniseed",
        "1 tablespoon (packed) grated orange peel",
        "1 tablespoon honey",
        "1 large cauliflower (about 2 1/2 pounds), separated into large florets",
        "4 large carrots (about 1 1/2 pounds), peeled, cut on diagonal into 1/4-inch-thick slices",
        "5 medium beets, peeled,each cut into 6 wedges, beet greens reserved",
        "Warm pita breads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Steam",
        "Vegetarian",
        "Cauliflower",
        "Beet",
        "Carrot",
        "Winter",
        "Honey",
        "Anise"
    ],
    "title": "Carrot, Cauliflower and Beet Salad with Orange-Anise Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cauliflower-and-beet-salad-with-orange-anise-dressing-4574"
}
