{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Butter and flour a 9-inch round and 3-inch deep cake pan. Line the bottom with parchment paper. Set aside.",
        "Put the carrots into a large mixing bowl and set aside.",
        "Put the flour, baking powder, baking soda, spices, and salt in the bowl of a food processor and process for 5 seconds. Add this mixture to the carrots and toss until they are well-coated with the flour.",
        "In the bowl of the food processor combine the sugar, brown sugar, eggs, and yogurt.",
        "With the processor still running drizzle in the vegetable oil. Pour this mixture into the carrot mixture and stir until just combined. Pour into the prepared cake pan and bake on the middle rack of the oven for 45 minutes. Reduce the heat to 325 degrees F and bake for another 20 minutes or until the cake reaches 205 to 210 degrees F in the center.",
        "Remove the pan from the oven and allow cake to cool 15 minutes in the pan. After 15 minutes, turn the cake out onto a rack and allow cake to cool completely. Frost with cream cheese frosting after cake has cooled completely.",
        "8 ounces cream cheese",
        "2 ounces unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "9 ounces powdered sugar, sifted, approximately 2 cups",
        "In the bowl of a stand mixer with paddle attachment, combine the cream cheese and butter on medium just until blended. Add the vanilla and beat until combined. With the speed on low, add the powdered sugar in 4 batches and beat until smooth between each addition.",
        "Place the frosting in the refrigerator for 5 to 10 minutes before using.",
        "Yield: approximately 2 cups"
    ],
    "ingredients": [
        "Unsalted butter, for the pan",
        "12 ounces, approximately 2 1/2 cups, all-purpose flour, plus extra for pan",
        "12 ounces grated carrots, medium grate, approximately 6 medium",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon freshly ground nutmeg",
        "1/2 teaspoon salt",
        "10 ounces sugar, approximately 1 1/3 cups",
        "2 ounces dark brown sugar, approximately 1/4 cup firmly packed",
        "3 large eggs",
        "6 ounces plain yogurt",
        "6 ounces vegetable oil",
        "Cream Cheese Frosting, recipe follows"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Carrot Cake",
        "Cake",
        "Carrot Recipes",
        "Vegetable",
        "Easter Desserts",
        "Easter",
        "Holiday",
        "Baking",
        "Food Processor",
        "Cheese",
        "Cream Cheese Recipes",
        "Sugar",
        "Egg Recipes",
        "Dairy Recipes"
    ],
    "title": "Carrot Cake",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/carrot-cake-recipe"
}
