{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Line two 9-inch round cake pans with parchment and lightly coat with cooking spray.",
        "Spread the pecans on a rimmed baking sheet and toast until light brown and fragrant, 7 minutes. Set aside 12 pecan halves to decorate the finished cake; chop the remaining pecans. Set aside 1 cup of the chopped pecans to use in the batter; reserve the rest for decorating the finished cake.",
        "Whisk together the flour, baking powder, cinnamon, nutmeg and 1 teaspoon salt in a medium bowl.",
        "Whisk together the eggs and granulated sugar in a large bowl until smooth, about 1 minute. Whisk in the oil until well combined. Add the grated carrots, vanilla and 1 cup chopped pecans, and mix well. Add the dry ingredients, and stir until just combined. Divide the batter evenly between the prepared pans.",
        "Bake until a toothpick inserted in the center comes out clean and the cakes are nicely browned, about 30 minutes. Let cool on a cooling rack for 10 minutes. Loosen the edges with a spatula, turn the cakes out and let cool completely, right-side up, on the cooling rack, about 2 hours. Remove the parchment before frosting.",
        "For the frosting: Beat the cream cheese and butter in the bowl of a stand mixer fitted with a paddle attachment, scraping down the side as necessary, until smooth, about 2 minutes. Add the confectioners' sugar, vanilla and 1/2 teaspoon salt; gradually increase the mixer speed to medium-high, and beat until the sugar is incorporated and the frosting is fluffy and smooth, about 3 minutes. With the mixer on medium-high, add the cream a few drops at time until it's all incorporated. Continue beating for 1 more minute until the frosting is slightly lighter in color and creamy.",
        "To assemble: Place one of the cake layers on a serving plate, and spread 1 cup of the frosting over the top. Top with the other layer, and use the remaining frosting to frost the top and sides of the cake. Arrange the 12 whole pecans on top of the cake like the numbers on a clock face, and sprinkle the remaining chopped pecans in between."
    ],
    "ingredients": [
        "Cooking spray",
        "2 cups pecan halves",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon plus 1 teaspoon baking powder",
        "1 1/2 teaspoons cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "Kosher salt",
        "4 large eggs",
        "2 cups granulated sugar",
        "1 cup vegetable oil",
        "3 cups finely grated carrots (about 1 pound carrots)",
        "2 teaspoons pure vanilla extract",
        "1 pound cream cheese, cut into cubes, at room temperature",
        "2 sticks unsalted butter, cut into cubes, at room temperature",
        "2 1/2 cups confectioners' sugar",
        "1 teaspoon pure vanilla extract",
        "Kosher salt",
        "1/4 cup heavy cream, cold"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cream Cheese Recipes",
        "Frosting Recipes",
        "Carrot Cake",
        "Cake",
        "Carrot Recipes",
        "Vegetable",
        "Baking",
        "Dessert",
        "Nut Recipes"
    ],
    "title": "Carrot Cake with Cream Cheese Frosting",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/carrot-cake-with-cream-cheese-frosting"
}
