{
    "directions": [
        "Whisk flour, brown sugar, baking powder, 1 teaspoon cinnamon, baking soda, and 3/4 teaspoon kosher salt together in a large bowl.",
        "Combine milk, crushed pineapple, and egg in a small bowl. Stir into the flour mixture. Add melted butter; mix until a soft dough forms. Fold in carrots and coconut.",
        "Heat at least 2 inches of oil in a large pot to 350 degrees F (175 degrees C). Line a wire rack or baking sheet with paper towels.",
        "Scoop a few tablespoons of dough into the hot oil using a small ice cream scoop. Fry donut holes until golden brown, about 1 minute per side. Transfer donut holes to the paper towels using a slotted spoon; let drain and cool slightly. Repeat with remaining dough.",
        "Whisk white sugar and remaining 1/2 teaspoon cinnamon in a shallow bowl. Roll donut holes in sugar mixture.",
        "Beat cream cheese and 1 tablespoon butter together in a bowl until smooth. Beat in confectioners' sugar until dip is well-blended and fluffy. Stir in vanilla extract and 1 pinch salt. Serve donut holes with cream cheese dip."
    ],
    "ingredients": [
        "Donut Holes:",
        "2 cups all-purpose flour",
        "1/2 cup brown sugar",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons ground cinnamon, divided",
        "1 teaspoon baking soda",
        "3/4 teaspoon kosher salt",
        "1/4 teaspoon ground nutmeg",
        "1 cup whole milk",
        "1/2 cup drained crushed pineapple",
        "1 egg",
        "1/4 cup butter, melted",
        "1 cup grated carrots, packed",
        "1/2 cup sweetened flaked coconut",
        "vegetable oil for cooking",
        "1/3 cup white sugar",
        "Cream Cheese Dip:",
        "1/2 cup cream cheese, softened",
        "1 tablespoon butter, softened",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carrot Cake Donut Holes with Cream Cheese Dip",
    "url": "http://allrecipes.com/recipe/246608/carrot-cake-donut-holes-with-cream-ch/"
}
