{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch tube pan.",
        "In a small saucepan, combine the butter and milk. Warm until butter has melted, but do not boil. In a medium bowl, beat the eggs with 1/2 teaspoon of salt and 2 cups sugar. Stir in the warmed milk and butter and vanilla.  Combine the flour and baking soda; stir into the batter just until blended. Pour into the prepared pan.",
        "Bake for 55 minutes in the preheated oven, or until a knife inserted into the crown of the cake comes out clean. Cool in the pan for at least 15 minutes before removing and placing on a wire rack to cool completely.",
        "In a mixing bowl fitted with a whisk attachment, combine the cream cheese, sugar, vanilla and salt. Beat at medium speed until smooth. Pour the heavy cream in a slow steady stream while the mixture is whipping until the mixture has fluffed up and can hold a stiff peak. Don't let it get grainy looking though. Scrape the bottom of the bowl with a spatula occasionally to remove any lumps.",
        "Slice the cooled cake horizontally into three layers. Arrange strawberries on the bottom layer with the top ends facing outward. Fill in the remaining space with more berries. Spoon some of the whipped cream over the berries and spread evenly. Place another layer of cake on top and repeat the process. Place the top layer on the cake and cover with the remaining cream. Arrange remaining berries over the cream."
    ],
    "ingredients": [
        "1 cup butter",
        "1 1/4 cups milk",
        "4 eggs",
        "1/2 teaspoon salt",
        "2 cups white sugar",
        "2 1/4 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon vanilla extract",
        "2 quarts fresh strawberries, halved lengthwise",
        "2 (8 ounce) packages cream cheese, at room temperature",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "2 cups heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carry Cake with Strawberries and Whipped Cream",
    "url": "http://allrecipes.com/recipe/111377/carry-cake-with-strawberries-and-whip/"
}
