{
    "directions": [
        "Preheat the oven to 350°F. Butter and flour two 8-inch round cake pans and line the bottoms with parchment paper (to ensure that the cake will not stick), or place liners in 2 muffin pans for 24 cupcakes. Set aside.",
        "Place the dried coconut in a cup of warm water to soften and set it aside for 15 minutes.",
        "Place the carrots in a food processor and pulse on and off for 1 minute. Then add the pineapple and pulse until the carrots are cut into very small pieces and the pineapple is pureed, 1 to 2 minutes.",
        "In a large bowl, sift together the dry ingredients. Add the brown sugar and use a whisk to break up any lumps.",
        "Drain the coconut and place it in a medium bowl. Add the oil, vanilla extract, eggs, and carrot-pineapple mixture, and whisk to combine.",
        "Add the wet ingredients into the dry, mixing with a rubber spatula to incorporate but not overmix. When the batter is almost mixed, stir in the additions, if using. Pour the batter into the prepared pans.",
        "Bake for 55 minutes, or until the tops are a very golden brown and a tester inserted in the center comes out clean. (It may look as if the cake is too well done, but it takes a while to bake because it's so dense.) For cupcakes, the baking time is 35 to 40 minutes.",
        "Let the cakes cool in the pans for 10 minutes. Then invert them onto a wire rack and let them cool completely.",
        "Fill and frost the cake with the Cream Cheese-Lemon Zest Frosting (for added oomph, add 1/2 tablespoon minced fresh ginger to the frosting).",
        "Fill and frost the cake with cream cheese frosting and let chill. Tint 1/2 cup frosting lemon yellow, and use the 10 tip to pipe 5 dots in a circle to create simple buttercup flowers. Then combine any remaining yellow frosting with some additional cream cheese frosting and tint it leaf green. I use tip #67, which pipes small fern stems. Pipe the center stamen with cream cheese frosting and chill to set."
    ],
    "ingredients": [
        "1/3 cup dried shredded organic unsweetened coconut",
        "About 1 pound organic farm-fresh carrots, peeled and cut into 2-inch Lengths (3 cups)",
        "1 cup chopped organic pineapple",
        "1 1/2 cups organic all-purpose flour",
        "1/2 cup organic whole wheat pastry flour",
        "1 1/2 cups organic cane sugar",
        "2 teaspoons baking soda",
        "2 1/4 teaspoons organic ground cinnamon",
        "Pinch of freshly grated organic nutmeg",
        "1 teaspoon salt",
        "1/2 cup dark-brown sugar",
        "3/4 cup organic canola oil",
        "1 tablespoon organic vanilla extract",
        "3 organic eggs",
        "Cream Cheese-Lemon Zest Frosting",
        "3/4 cup chopped toasted organic walnuts",
        "1/2 cup organic golden raisins, plumped in warm water for 20 minutes and drained",
        "1/2 tablespoon minced fresh organic ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Easter",
        "Kid-Friendly",
        "Back to School",
        "Cream Cheese",
        "Lemon",
        "Raisin",
        "Coconut",
        "Walnut",
        "Carrot",
        "Birthday",
        "Organic",
        "Healthy",
        "Potluck",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Carrot Cake with Cream Cheese-Lemon Zest Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cake-with-cream-cheese-lemon-zest-frosting-353969"
}
