{
    "directions": [
        "Preheat oven to 425°. Whisk ricotta and cream in a small bowl; season with salt and pepper.",
        "Heat 2 tablespoons oil in a large skillet over medium-high. Cook onion, stirring occasionally, until soft and starting to brown, about 5 minutes. Add carrots and cook, tossing occasionally, 2 minutes; season with salt and pepper and set aside.",
        "Lightly roll out pastry on parchment paper just to smooth out creases. Transfer on paper to a baking sheet. Lightly score a 1\" border around pastry. Brush with egg; bake until golden and slightly puffed, 10-15 minutes.",
        "Remove from oven and spread ricotta mixture over pastry, staying within border. Scatter reserved onion and carrots over top. Bake until carrots are tender, onion is starting to caramelize, and pastry is golden brown and baked through, 30-35 minutes. Let cool.",
        "Just before serving, toss herbs and remaining 1 tablespoon oil in a bowl; season with salt and pepper. Scatter over tart.",
        "Do ahead: Tart can be baked 6 hours ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "2 cups ricotta",
        "1/4 cup heavy cream",
        "Kosher salt, freshly ground pepper",
        "3 tablespoons olive oil, divided",
        "1 small onion, thinly sliced",
        "4 large carrots (about 8 ounces), scrubbed, thinly sliced into coins",
        "1 package frozen puff pastry, thawed",
        "1 large egg, beaten to blend",
        "1/2 cup coarsely chopped fresh chives",
        "2 tablespoons small dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Kid-Friendly",
        "Carrot",
        "Spring",
        "Chive",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrot Tart with Ricotta and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-tart-with-ricotta-and-herbs-56389377"
}
