{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 2-inch-high sides. Sift first 5 ingredients into medium bowl. Beat eggs, oil, sugars, marmalade and juice in large bowl until blended. Stir in dry ingredients. Fold in carrots and nuts. Divide batter between cake pans. Bake until tester inserted into centers comes out clean, about 40 minutes. Transfer cakes to racks; cool 15 minutes. Turn out cakes onto racks; cool completely.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Add 3/4 cup marmalade, butter and orange peel and beat just until smooth. If necessary, cover and chill until firm enough to spread.",
        "Place 1 cake on plate. Spread with 1/4 cup marmalade. Spread 1 cup frosting over. Top with second cake. Spoon 2 cups frosting into pastry bag fitted with large star tip. Spread remaining frosting smoothly over top and sides of cake.",
        "Pipe frosting in 4 parallel lines atop cake, spacing evenly. Pipe 5 lines atop cake in opposite direction, forming lattice. Press 1 cup nuts onto sides of cake. Pipe ring of frosting around top edge of cake. Stir 1/4 cup marmalade to loosen; spoon some into 1 row of lattice diamonds. Spoon some of remaining nuts into next row of diamonds. Repeat, alternating marmalade and nuts, filling rows completely. (Can be made 2 days ahead. Cover with cake dome and chill.)"
    ],
    "ingredients": [
        "2 cups unbleached all purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "4 large eggs",
        "3/4 cup vegetable oil",
        "3/4 cup sugar",
        "2/3 cup packed golden brown sugar",
        "1/2 cup orange marmalade",
        "1/2 cup orange juice",
        "3 cups (lightly packed) grated peeled carrots",
        "3/4 cup chopped toasted walnuts",
        "4 8-ounce packages cream cheese, room temperature",
        "2 cups powdered sugar",
        "1 1/4 cups (about) orange marmalade",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "2 teaspoons grated orange peel",
        "1 1/4 cups finely chopped toasted walnuts (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Fruit",
        "Nut",
        "Vegetable",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Orange",
        "Walnut",
        "Carrot",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrot Cake with Marmalade Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cake-with-marmalade-cream-cheese-frosting-1825"
}
