{
    "directions": [
        "Position the oven racks in the center and lower third of the oven. Preheat oven to 350 degrees F (175 degrees C). Fill a roasting pan halfway with water and place in the lower rack in the oven. Spray the inside of a 9-inch springform pan with cooking spray.",
        "Beat three 8-ounce packages cream cheese in a bowl using an electric mixer on high speed until fluffy; reduce speed to medium-low. Add white sugar and beat 2 minutes. Beat 4 eggs, 1 at a time, into cream cheese mixture, beating well before adding the next egg. Beat sour cream and vanilla extract into cream cheese mixture until smooth; add 3 tablespoons flour and beat until cheesecake mixture is smooth.",
        "Beat brown sugar and canola oil together in a separate bowl using an electric mixer on medium speed until smooth. Add 1 egg and beat for 2 minutes; reduce speed to low. Add 1 cup flour, cinnamon, baking powder, and salt and beat until batter is combined. Fold carrots and walnuts into batter.",
        "Spread carrot cake batter in the prepared pan; top with cheesecake mixture. Place pan on the rack above the roasting pan with water in the oven.",
        "Bake in the preheated oven until cheesecake is set, about 1 hour 10 minutes, covering top of pan with aluminum foil if browning too quickly. Cool for 10 minutes.",
        "Run a knife around the edge of pan to loosen cake; cool to room temperature in pan on a wire rack. Refrigerate at least 8 hours. Remove the outside of the springform pan.",
        "Beat confectioners' sugar, 4 ounces cream cheese, and almond extract together in a bowl using an electric mixer until frosting is smooth. Spread frosting on top of cheesecake layer."
    ],
    "ingredients": [
        "cooking spray",
        "Cheesecake:",
        "3 (8 ounce) packages cream cheese, at room temperature",
        "1 cup white sugar",
        "4 eggs",
        "1 cup sour cream",
        "1/2 teaspoon vanilla extract",
        "3 tablespoons all-purpose flour",
        "Carrot Cake:",
        "3/4 cup packed dark brown sugar",
        "2/3 cup canola oil",
        "1 egg",
        "1 cup all-purpose flour",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup grated carrots",
        "1/3 cup chopped walnuts",
        "Frosting:",
        "2 cups confectioners' sugar",
        "4 ounces cream cheese",
        "1 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carrot Cake Cheesecake",
    "url": "http://allrecipes.com/recipe/242024/carrot-cake-cheesecake/"
}
