{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Heat a dry 12-inch heavy skillet (not nonstick) over medium-high heat until hot, about 2 minutes. Meanwhile, pat steaks dry and sprinkle all over with 1/2 teaspoon each of salt and pepper (total).",
        "Add vegetable oil to hot skillet, swirling to coat bottom, then brown steaks, turning once, about 4 minutes total. Transfer steaks to a small shallow baking pan and roast in oven 5 minutes. Transfer to a cutting board and cool about 30 minutes.",
        "While steaks cool, cut carrots lengthwise into 42 (1-inch-wide) ribbons (less than 1/16 inch thick) with an adjustable-blade slicer or a vegetable peeler.",
        "Cook ribbons in a pot of boiling salted water (2 tablespoons salt for 4 quarts water), uncovered, until just tender, about 3 minutes. Transfer with a slotted spoon to an ice bath to stop cooking. Carefully drain, then pat ribbons dry.",
        "Whisk together basil, parsley, mustard, shallots, capers, and garlic in a small bowl, then add oil in a slow stream, whisking until emulsified.",
        "Trim fat and gristle from steaks, then cut each lengthwise into 3 (3/4- to 1-inch-wide) strips.",
        "Place a sushi mat with slats running crosswise or a 9-inch square of parchment paper on a work surface. Arrange 6 to 8 carrot ribbons side by side lengthwise, following slats and slightly overlapping, to form a 6-inch square.",
        "Spread about 1 tablespoon of mustard sauce evenly across bottom half of carrot square, then lay 1 strip of steak across carrots 1 inch from edge nearest you. Roll up carrots and beef tightly, using sushi mat as an aid.",
        "Transfer beef roll, seam side down, to a cutting board, then trim ends and cut crosswise into about 10 (1/2-inch) pieces. Make and cut 5 more rolls. Turn pieces upright to serve."
    ],
    "ingredients": [
        "2 (1-inch-thick) boneless beef top loin (strip) steaks (about 1 1/4 pounds total)",
        "1 tablespoon vegetable oil",
        "1 pound large carrots (2 to 4), trimmed to 6 inches long",
        "3 tablespoons chopped basil",
        "3 tablespoons chopped flat-leaf parsley",
        "3 tablespoons Dijon mustard",
        "2 tablespoons minced shallot",
        "1 tablespoon drained capers, finely chopped",
        "1 garlic clove, minced",
        "3 tablespoons extra-virgin olive oil",
        "Garnish: flaky sea salt such as Maldon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "Sauté",
        "Cocktail Party",
        "Basil",
        "Carrot",
        "Parsley",
        "Capers",
        "Gourmet"
    ],
    "title": "Carrot-Beef Sushi with Caper-Basil Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-beef-sushi-with-caper-basil-mustard-240976"
}
