{
    "directions": [
        "Preheat oven to 400°F. Spread almonds on a rimmed baking sheet and bake until lightly toasted, about 5 minutes. Let cool.",
        "Meanwhile, cook carrots, orange juice, 4 Tbsp. butter, 1 Tbsp. sugar, 1 tsp. salt, 1 tsp. vinegar, 1/4 tsp. allspice, and 1 1/2 cups water in a large skillet over medium-high heat, stirring occasionally, until crisp-tender, 10–12 minutes. Using a slotted spoon, transfer carrots to a plate, reserving liquid in skillet, and let cool.",
        "Transfer 1/4 cup almonds to a small bowl; set aside. Process 1 tsp. salt, 1/4 tsp. pepper, and remaining almonds, 1 Tbsp. sugar and 1/4 tsp. allspice in a food processor until finely chopped. Add eggs, ricotta, thyme, orange zest, and remaining 4 Tbsp. butter and process until smooth.",
        "Gently roll pastry to an 18x13” rectangle on a lightly floured sheet of parchment. Transfer with parchment to a rimmed baking sheet. Using a sharp knife, lightly score a 1/2\" border around pastry (for a decorative border, make small shallow diagonal cuts within that border).",
        "Spread egg mixture evenly within border of pastry, then arrange carrots over in a geometric pattern. To create a chevron (zigzag) pattern, form 6 carrots into 3 even \"V\" shapes so points are touching the long border of the crust. Fill with additional rows of \"V\" shapes, cutting carrots to fit as needed.",
        "Bake tart until filling is puffed and golden brown, about 25 minutes. Transfer to a cutting board and let cool slightly.",
        "Meanwhile, heat reserved carrot-cooking liquid in skillet over high; cook, stirring, until reduced to a thick syrup, about 10 minutes. Brush top of tart with syrup while still warm. Cut into 12–16 pieces.",
        "Whisk oil and remaining 1 tsp. vinegar, 1/4 tsp. salt, and 1/8 tsp. pepper in a medium bowl. Add shallot, carrot tops, and reserved almonds and toss to combine. Arrange over tart to serve."
    ],
    "ingredients": [
        "1 1/2 cups sliced almonds (about 5 1/2 ounces)",
        "2 pounds rainbow or orange carrots, peeled, cut into 3 1/2x1/4–1/2\" sticks; plus 1 cup coarsely chopped tops",
        "1 teaspoon finely grated orange zest",
        "1/2 cup fresh orange juice",
        "1/2 cup (1 stick) unsalted butter, divided",
        "2 tablespoons sugar, divided",
        "2 1/4 teaspoons kosher salt, divided",
        "2 teaspoons red wine vinegar, divided",
        "1/2 teaspoon ground allspice, divided",
        "1/4 teaspoon plus 1/8 teaspoon freshly ground black pepper, divided",
        "2 large eggs",
        "1 1/4 cups whole-milk ricotta",
        "2 tablespoons thyme leaves",
        "1 (14–17-ounce) package frozen puff pastry, preferably all-butter, thawed",
        "All-purpose flour (for dusting)",
        "1 tablespoon olive oil",
        "1 small shallot, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fall",
        "Carrot",
        "Tart",
        "Appetizer",
        "Hors D'Oeuvre",
        "Ricotta",
        "Almond",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Carrot Tart With Ricotta and Almond Filling",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-tart-with-ricotta-and-almond-filling"
}
