{
    "directions": [
        "Preheat the oven to 400°F.",
        "Pound the garlic with a healthy pinch of salt in a mortar until you have a wet, fairly smooth paste. (You can also do this on a cutting board, chopping and mashing and chopping and mashing until you're satisfied.) Put the paste in a large mixing bowl. Add the cumin, coriander, chilies, and 1/4 cup of the olive oil and stir well, then add the carrots and toss well so they're coated with the oil and spices. Sprinkle on 3 healthy pinches of salt, crushing the grains with your fingers as you add them, and toss again.",
        "Put the carrots in a large shallow baking dish in one layer. Scrape out the extra garlic, spices, and oil from the bowl and spread evenly on top of the carrots. Pour 1/4 cup water into an empty spot in the casserole (you don't want to wash off the tasty oily stuff) and tilt the dish so the water spreads across the bottom.",
        "Cover the dish tightly with foil and put it in the oven. Cook the carrots for 25 minutes. Take off the foil and keep cooking until the carrots are lightly browned, and about as tender and creamy as avocado flesh, but not so soft that they threaten to fall apart, about 35 minutes more.",
        "While the carrots are roasting, segment the orange as you would a lemon. Squeeze the membranes into a small bowl to release the juice. Set it aside.",
        "When the carrots are done, take the dish out of the oven and let it sit until the carrots have cooled a bit but are still warm.",
        "Meanwhile, take the avocados from the fridge. Halve them lengthwise, remove the pits, and peel the halves. Cut the flesh lengthwise into slices about the same size as the carrots—the slices should be sturdy enough that they don't break up when you toss them.",
        "Put the avocado slices in a large mixing bowl and add the reserved orange juice, the lemon juice, the remaining 2 tablespoons olive oil, and a healthy pinch or two of salt. Toss gently and well with your hands. Push the avocado to one side of the bowl. Add the carrots a handful at a time, scraping and tossing them in the beautiful green liquid in the bowl before adding the next handful. Make sure to scrape out and add all the garlicky spices left in the baking dish. Toss it all together gently, being careful not to break the avocado slices.",
        "Stack the carrots, avocado, and orange segments on a platter or in a serving bowl so they're facing this way and that. Top with the cilantro and serve right away."
    ],
    "ingredients": [
        "4 medium garlic cloves, smashed and peeled",
        "Maldon or another flaky sea salt",
        "1 1/2 teaspoons cumin seeds, toasted and ground",
        "1 1/2 teaspoons coriander seeds, toasted and ground",
        "1 to 1 1/2 teaspoons crumbled dried pequin chilies or red pepper flakes",
        "1/4 cup plus 2 tablespoons extra virgin olive oil",
        "30 or so similarly sized (each about the size of your pointer finger) young carrots, not peeled, 1/2 inch of the green tops left on",
        "3 tennis-ball-sized oranges",
        "3 ripe Hass avocados, chilled",
        "2 tablespoons freshly squeezed lemon juice",
        "A handful of small, delicate cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Side",
        "Vegetarian",
        "Lunch",
        "Avocado",
        "Carrot",
        "Spring",
        "Healthy",
        "Vegan",
        "Cumin",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Carrot, Avocado, and Orange Salad",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-avocado-and-orange-salad-395054"
}
