{
    "directions": [
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans. Line bottom of pans with waxed paper. Butter and flour paper; tap out excess flour. Whisk flour, baking soda, salt and cinnamon in medium bowl to blend. Whisk sugar and oil in large bowl until well blended. Whisk in eggs 1 at a time. Add flour mixture and stir until blended. Stir in carrots, walnuts and ginger. Divide batter between prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 40 minutes. Cool cakes in pans 15 minutes. Turn out onto racks. Peel off waxed paper; cool cakes completely.",
        "Using electric mixer, beat cream cheese and butter in large bowl until light and fluffy. Add powdered sugar and beat at low speed until well blended. Beat in maple syrup. Chill until just firm enough to spread, 30 minutes.",
        "Place 1 cake layer on platter. Spread with 3/4 cup icing. Top with second layer. Spread remaining icing over entire cake. Arrange walnut halves around top edge. (Can be made 1 day ahead. Cover with cake dome; chill. Let stand at room temperature 30 minutes before serving.)"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "2 cups sugar",
        "1 1/4 cups canola oil",
        "4 large eggs",
        "3 cups grated peeled carrots",
        "1 1/4 cups coarsely chopped walnuts",
        "2 tablespoons minced peeled ginger",
        "10 ounces cream cheese (such as Philadelphia), room temperature",
        "5 tablespoons unsalted butter, room temperature",
        "2 1/2 cups powdered sugar",
        "1/4 cup pure maple syrup",
        "12 walnut halves (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Carrot",
        "Fall",
        "Maple Syrup",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrot Cake with Maple-Cream Cheese Icing",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cake-with-maple-cream-cheese-icing-102155"
}
