{
    "directions": [
        "Preheat the oven to 350 degrees F. Grease and line two 8\" cake pans (or one deep pan). Sift the flour and baking powder together into a large bowl and mix in the spices.",
        "Using an electric mixer, whisk together the muscovado (or brown) sugar, sunflower oil, and eggs until smooth. With a large metal spoon, fold in the grated carrots and chopped walnuts, then fold in the flour and spices until evenly combined.",
        "Spoon the mixture into the prepared cake pan(s), set on a baking tray, and bake until a skewer inserted into the center comes out clean; test after 25 minutes for layer cake; 40 minutes for a deep cake. Leave to cool in the pan(s) on a wire rack.",
        "For the frosting, pare a few shreds of lime zest with a zester and set aside; grate the rest of the zest and squeeze the juice from one half. In a bowl, beat the mascarpone with the softened butter, sugar, grated lime zest, and the lime and lemon juices. Taste. I like a good sharp topping, so sometimes add more lime, sometimes more lemon juice.",
        "Sandwich the layers together with some of the mascarpone mixture, (or cut a deep cake into two layers). Spread the frosting over the top of the cake and smooth it down the sides to cover completely, then ruffle the surface. Either refrigerate or serve immediately, topped with the reserved zest. I like it a little cold, so that the frosting has set slightly.",
        "Add snowdrops in season!"
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "2 level teaspoons baking powder",
        "1 teaspoon ground cinnamon, preferably freshly ground",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon freshly grated nutmeg",
        "1 cup light muscovado or light brown sugar",
        "2/3 cup (scant) sunflower oil",
        "2 organic large eggs",
        "2 1/2 cups coarsely grated organic carrots",
        "3/4 cup shelled walnuts, roughly chopped",
        "1 lime",
        "1 cup (scant) mascarpone",
        "6 tablespoons (3/4 stick) unsalted butter, softened",
        "3/4 cup unrefined confectioners' sugar",
        "juice of 1/2 lemon, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Cheese",
        "Citrus",
        "Dairy",
        "Fruit",
        "Vegetable",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Lime",
        "Root Vegetable",
        "Carrot",
        "Anniversary",
        "Birthday",
        "Shower",
        "Advance Prep Required",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrot Cake with Lime and Mascarpone Topping",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cake-with-lime-and-mascarpone-topping-358574"
}
