{
    "directions": [
        "Mix soy sauce, 1/4 cup vegetable oil, miso paste, brown sugar, white wine, and red pepper flakes together in a bowl to make marinade.",
        "Place salmon fillets in a shallow dish. Add enough marinade to cover, reserving the remaining marinade. Marinate in the refrigerator, about 10 minutes.",
        "Preheat oven to 450 degrees F (230 degrees C). Lightly oil a cast iron skillet or grill pan and place in the oven while it preheats. (A countertop induction oven can be used in place of the oven. Preheat on the medium-high grill setting.)",
        "Remove salmon from marinade, reserving the marinade, and place skin-side up on the hot cast iron skillet; cook until bottom of salmon is lightly browned, 2 to 3 minutes. Flip salmon and continue cooking until fish flakes easily with a fork, 8 to 10 minutes more. (For the countertop induction oven, add salmon to grill pan, reserving marinade, and cook, skin-side down, for 1 1/2 minutes. Flip salmon and cook until fish flakes easily with a fork, 2 1/2 to 3 minutes.)",
        "Pour reserved marinade into a saucepan and heat until boiling; remove from heat.",
        "Place potatoes in a large pot and cover with salted cold water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and return potatoes to the pot.",
        "Heat milk and 2 tablespoons butter together in a saucepan; bring to a simmer. Pour milk mixture over potatoes, a few tablespoons at a time, and mash using a potato masher until potatoes are desired chunkiness.",
        "Heat olive oil in a large skillet over medium heat. Add green beans and garlic; cook and stir until beans turn bright green and are lightly browned in places, about 5 minutes; stir in 1 teaspoon butter, salt, and pepper.",
        "Serve mashed potatoes and green beans alongside salmon. Drizzle reserved cooked marinade over the top."
    ],
    "ingredients": [
        "1/3 cup reduced-sodium soy sauce",
        "1/4 cup vegetable oil",
        "1/4 cup white miso paste",
        "1/4 cup brown sugar",
        "1 tablespoon dry white wine, or to taste",
        "1 pinch red pepper flakes",
        "2 (3 ounce) fillets salmon fillets",
        "1 pound purple potatoes, cut into small chunks",
        "1/4 cup 2% milk, or to taste",
        "2 tablespoons butter, softened, or to taste",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "1/2 pound French green beans, trimmed",
        "1 clove garlic, chopped",
        "1 teaspoon butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carrie's Salmon with Purple Pureed Potatoes and French Green Beans",
    "url": "http://allrecipes.com/recipe/255320/carries-salmon-with-purple-pureed-po/"
}
