{
    "directions": [
        "Preheat oven to 325°F. Lightly butter 13x9x2-inch baking pan. Line bottom with waxed paper; butter paper. Using electric mixer, beat oil and both sugars in large bowl until well blended. Add eggs 1 at a time, beating well after each addition. Beat in orange juice and peel. Sift flour, baking soda, baking powder, cinnamon, ginger, nutmeg and salt into large bowl; add to sugar mixture and beat to blend. Stir in carrots and raisins.",
        "Pour batter into prepared pan. Bake until tester inserted into center of cake comes out clean, about 55 minutes. Transfer pan to rack. Cool cake 15 minutes. Turn cake out onto rack. Remove waxed paper and cool. (Can be prepared 1 day ahead. Wrap tightly in plastic and store at room temperature.)",
        "Using electric mixer, beat cream cheese and butter in large bowl until light. Beat in orange juice and 2 teaspoons orange peel. Add sugar; beat until smooth. Refrigerate until thick enough to spread, about 30 minutes.",
        "Using serrated knife, cut cake horizontally into 2 equal layers. Place 1 cake layer on platter. Spread with 1 1/2 cups frosting. Top with remaining cake layer. Using icing spatula, spread remaining frosting in thick decorative swirls over top and side of cake. (Carrot cake can be prepared 2 days ahead. Cover with cake dome and refrigerate.) Serve cake cold or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups vegetable oil",
        "1 cup (packed) golden brown sugar",
        "1 cup sugar",
        "4 large eggs",
        "1/3 cup orange juice",
        "1 tablespoon grated orange peel",
        "2 cups all purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "3 cups finely grated peeled carrots",
        "1 cup raisins",
        "2 8-ounce package cream cheese, room temperature",
        "1 cup (2 sticks) unsalted butter",
        "6 tablespoons orange juice",
        "2 teaspoons grated orange peel",
        "5 cups powdered sugar, sifted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Orange",
        "Raisin",
        "Carrot",
        "Fall",
        "Birthday"
    ],
    "title": "Carrot-Orange Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-orange-cake-with-cream-cheese-frosting-904"
}
