{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Beat cake mix, water, vegetable oil, and eggs together in a bowl using an electric mixer on low speed, about 30 seconds; increase speed to medium and beat until batter is evenly mixed, scraping sides of bowl as needed. Pour batter into the prepared baking dish.",
        "Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 31 to 36 minutes. Cool cake in pan for 10 minutes before removing to a wire rack to cool completely. Keep oven at 350 degrees F (175 degrees C).",
        "Beat milk and pudding mix together in a bowl until evenly combined and thickened; beat in cream cheese until filling is smooth. Fold whipped topping into filling.",
        "Spread almonds and coconut onto a baking sheet.",
        "Bake in the preheated oven until toasted and fragrant, 5 to 10 minutes.",
        "Cut cake into bite-size pieces; spread 1 layer, 1-cube deep, into a trifle dish or glass bowl. Spoon a layer of filling, about the same depth as cake layer, over cake layer. Sprinkle a layer of almonds, coconut, and toffee bits over filling. Repeat layering with remaining ingredients."
    ],
    "ingredients": [
        "Cake:",
        "1 (15.25 ounce) package carrot cake mix",
        "1 cup water",
        "2/3 cup vegetable oil",
        "3 eggs",
        "Filling:",
        "2 1/2 cups milk",
        "1 (5 ounce) package instant vanilla pudding mix",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed",
        "Topping:",
        "1 cup chopped almonds",
        "1 cup shredded coconut",
        "1 cup toffee baking bits (such as Heath®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Carrot Cake Trifle",
    "url": "http://allrecipes.com/recipe/237701/carrot-cake-trifle/"
}
