{
    "directions": [
        "1. Preheat the oven to 350°F. Lightly spray a 13 x 9 x 2-inch baking pan with cooking spray. Sprinkle 2 tablespoons flour in the pan, shaking so the flour adheres to the sides and bottom. Shake out any excess flour.",
        "2. In a medium mixing bowl, using an electric mixer on medium speed, beat the egg whites, sugars, applesauce, 1/2 cup milk, the oil, and 1 1/2 teaspoons vanilla for 1 minute, or until combined.",
        "3. In a medium bowl, stir together the whole-wheat flour, remaining 1 1/4 cups all-purpose flour, cinnamon, baking powder, and allspice. Gradually add the flour mixture to the egg white mixture while beating on medium speed for about 1 minute, or until blended.",
        "4. Stir in the carrots, pineapple with liquid, and raisins. Pour into the pan, lightly smoothing the top.",
        "5. Bake for 35 to 40 minutes, or until a wooden toothpick inserted in the center comes out clean. Transfer to a cooling rack and let cool for at least 1 1/2 hours before frosting.",
        "6. In a medium mixing bowl, using an electric mixer on medium speed, beat together the frosting ingredients except the pecans for 1 minute, or until smooth. Spread on the cooled cake. Sprinkle with the pecans. Serve the same day for peak flavor and texture.",
        "7. Cover any leftovers and refrigerate for up to three days."
    ],
    "ingredients": [
        "Cooking spray",
        "2 tablespoons all-purpose flour",
        "4 large egg whites",
        "1/2 cup sugar",
        "1/2 cup firmly packed light brown sugar",
        "1/2 cup unsweetened applesauce",
        "1/2 cup fat-free milk",
        "1 tablespoon canola or corn oil",
        "1 1/2 teaspoons vanilla extract",
        "1 1/4 cups whole-wheat flour",
        "1 1/4 cups all-purpose flour",
        "1 tablespoon ground cinnamon",
        "2 teaspoons baking powder",
        "1/4 teaspoon ground allspice",
        "1 1/2 cups grated carrots",
        "1 8-ounce can crushed pineapple in its own juice, undrained",
        "1/2 cup raisins",
        "2 cups unsifted confectioners' sugar",
        "2 ounces low-fat brick- type cream cheese, softened (don't use fat free)",
        "2 teaspoons fat-free milk",
        "1/2 teaspoon vanilla extract",
        "1/4 cup finely chopped pecans or walnuts (dry-roasted preferred)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Dairy",
        "Dessert",
        "Bake",
        "Low Sodium",
        "Cream Cheese",
        "Root Vegetable",
        "Carrot",
        "Healthy",
        "Party",
        "Advance Prep Required",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrot Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/carrot-cake-with-cream-cheese-frosting-51172410"
}
