{
    "directions": [
        "Combine almonds and oil in a small saucepan over medium heat; cook, swirling often, until almonds are just golden, about 4 minutes. Using a slotted spoon, transfer almonds to a blender; let almonds and oil cool. Pulse almonds until finely chopped. With motor running, slowly add cooking oil, vinegar, sugar, and 1/4 cup water and process, adding water as needed, until just thinner than peanut butter; season with salt.",
        "Bring vinegar, sugar, coriander, salt, and red pepper flakes to a boil in a small saucepan; reduce heat and simmer, stirring, until sugar is dissolved, about 3 minutes. Add carrots and let cool.",
        "Heat oil in a large skillet over medium-high heat. Add carrots; cook, turning often, until golden and tender, 5-8 minutes. Add garlic and butter; cook, tossing, until garlic is golden, about 2 minutes. Season with salt and pepper.",
        "Spoon almond purée onto plates and top with pickled carrots, sautéed carrots, cilantro, mint, and sesame seeds."
    ],
    "ingredients": [
        "1/2 cup whole blanched almonds",
        "1/4 cup olive oil",
        "1/4 teaspoon white wine vinegar",
        "Pinch of sugar",
        "Kosher salt",
        "1/2 cup white wine vinegar",
        "2 tablespoons sugar",
        "1 teaspoon coriander seeds",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon crushed red pepper flakes",
        "4 small carrots, scrubbed, 2 thinly sliced lengthwise, 2 thinly sliced crosswise",
        "2 tablespoons olive oil",
        "12 small carrots, scrubbed",
        "2 garlic cloves, crushed",
        "1 tablespoon unsalted butter",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon fresh cilantro leaves",
        "1 tablespoon fresh mint leaves",
        "2 teaspoons toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Side",
        "Sauté",
        "Vegetarian",
        "Tree Nut",
        "Almond",
        "Carrot",
        "Healthy",
        "Entertaining",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Carrots with Almond Purée",
    "url": "http://www.epicurious.com/recipes/food/views/carrots-with-almond-puree-51178970"
}
