{
    "directions": [
        "1. Place the cashew nuts in a bowl. Pour boiling water over them to cover, and soak for 1 hour. Drain the nuts, put them in the container of an electric blender or food processor, and reduce them to a fine paste (adding a little milk or water if the paste begins to clog).",
        "2. Grease a 9-inch-square baking pan, or mark and grease a 9-inch-square section of a cookie sheet.",
        "3. Heat a non-stick frying pan (at least 9 inches in diameter) over medium heat for 2 minutes. Add the nut paste and the sugar. Reduce heat to medium-low and cook, stirring and scraping the sides and bottom of the pan constantly with a flat spatula for 20 minutes or until the fudge is thick and sticky. Stir in the butter.",
        "4. Pour the fudge into the greased pan or onto the greased square of cookie sheet. Spread it evenly by patting it gently with the spatula. Let it cool thoroughly.",
        "5. When cool, brush the top with the rose water, and let it dry briefly. Press the silver foil over the fudge, and cut 1 1/2-inch-square or diamond-shaped pieces, using a knife dipped in cold water.",
        "Note: This fudge keeps well, if stored tightly sealed, at room temperature for 3 weeks and for several months in the refrigerator."
    ],
    "ingredients": [
        "2 cups raw cashew nuts (1/2 pound)",
        "3/4 cup sugar",
        "1 tablespoon butter",
        "2 teaspoons rose water",
        "3 three-inch-square pieces of silver foil (vark, optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Blender",
        "Food Processor",
        "Nut",
        "Dessert",
        "Kid-Friendly",
        "Diwali",
        "Cashew",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cashew Nut Fudge",
    "url": "http://www.epicurious.com/recipes/food/views/cashew-nut-fudge-230905"
}
