{
    "directions": [
        "Spray 11-inch-diameter tart pan with removable bottom with nonstick spray. Blend flour, sugar, cocoa, and salt in processor 5 seconds. Add butter and blend until moist sandy texture forms. Add 1 1/2 tablespoons ice water and blend until dough comes together. Press dough evenly onto bottom and up sides of prepared pan. Chill crust 30 minutes.",
        "Preheat oven to 350°F. Place crust on baking sheet. Bake crust until dry-looking and slightly puffed, about 18 minutes. Cool crust on rack completely. Maintain oven temperature.",
        "Bring brown sugar, cream, maple syrup, and ginger to boil in heavy medium saucepan over medium-high heat, whisking gently until sugar dissolves. Attach candy thermometer to side of pan. Adjust heat to maintain low boil; cook until thermometer registers 222°F, whisking occasionally, about 8 minutes. Mix in cashews and coconut. Cool 20 minutes.",
        "Place chopped chocolate in small microwave-safe bowl. Cook at medium setting in 15-second intervals until soft and beginning to melt. Stir until completely melted and smooth. Brush enough chocolate over inside of crust to coat completely. Freeze crust until chocolate is cold and hard, about 15 minutes (reserve remaining melted chocolate for garnish).",
        "Pour filling into crust. Place tart on rimmed baking sheet. Bake until filling is beginning to darken on top and is bubbling thickly, about 35 minutes. Transfer tart to rack. Cool completely. Remelt reserved chocolate in microwave. Drizzle chocolate over tart in lacy pattern. (Can be made 1 day ahead. Cover; store at room temperature.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/4 cups all purpose flour",
        "2/3 cup sugar",
        "1/2 cup unsweetened cocoa powder",
        "1/4 teaspoon (generous) salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, diced",
        "1 1/2 tablespoons ice water",
        "1 cup (packed) dark brown sugar",
        "1 cup heavy whipping cream",
        "1/3 cup pure maple syrup",
        "1 1/2 tablespoons finely chopped peeled fresh ginger",
        "1 9.25-ounce can (about 2 cups) lightly salted roasted cashews",
        "1 cup flaked sweetened coconut",
        "5 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Coconut",
        "Cashew",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cashew-Coconut Tart in Chocolate Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cashew-coconut-tart-in-chocolate-crust-233183"
}
