{
    "directions": [
        "In large bowl, combine lentils and enough water to cover by 2 inches. Cover and refrigerate at least 6 hours. Drain lentils and transfer to small saucepan. Add 3 cups cold water, place over moderate heat, and bring to boil. Cover, reduce heat to moderately low and simmer gently until lentils are completely tender, about 45 minutes. Drain and let cool.",
        "In large bowl, combine lentils and enough water to cover by 2 inches. Cover and refrigerate at least 6 hours. Drain lentils and transfer to small saucepan. Add 3 cups cold water, place over moderate heat, and bring to boil. Cover, reduce heat to moderately low and simmer gently until lentils are completely tender, about 45 minutes. Drain and let cool.",
        "In medium saucepan over moderately low heat, heat oil until hot but not smoking. Add onion and garlic and sauté until onion is translucent and garlic is fragrant, 5 to 7 minutes. Add carrots and sauté until beginning to soften, about 5 additional minutes. Stir in lentils, tofu, cashews, basil, oregano, cumin, salt, pepper flakes, and ground pepper. Reduce heat to low, cover, and cook 15 minutes. Keep warm.",
        "Preheat oven to 200° F. Fold each chard leaf in half along central stem and slice away lower, thickest part of stem. (Leaf will remain connected at top but not at bottom.)",
        "In wide, shallow, covered pan, bring 1 inch water to boil. Set steamer basket in pan and carefully layer chard leaves inside. Steam until tender and flexible, about 5 minutes. Transfer chard to kitchen towel-lined plate to drain.",
        "Arrange 1 leaf on work surface, overlapping slit sides slightly. Spoon 1/2 cup filling onto center of leaf and fold in top and bottom of leaf to cover filling. Starting on one side, roll up leaf as for burrito. Place seam-side down on baking sheet in oven to keep warm. Repeat with remaining leaves and filling. Serve burritos warm."
    ],
    "ingredients": [
        "1/2 cup dried French green lentils",
        "1 teaspoon olive oil",
        "1 medium onion, peeled and finely diced (about 1 1/2 to 2 cups)",
        "2 cloves garlic, minced",
        "1 cup carrots, finely diced (2 medium or 3 small carrots)",
        "6 ounces firm tofu, rinsed, patted dry, and diced (about 1 cup)",
        "1/2 cup (2 1/2 ounces) raw whole cashews",
        "2 tablespoons fresh basil leaves, finely chopped or 1 1/2 teaspoons dried",
        "2 tablespoons fresh oregano leaves, finely chopped or 1 1/2 teaspoons dried",
        "1 teaspoon ground cumin",
        "1/2 teaspoon sea salt",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/4 teaspoon freshly ground black pepper",
        "6 large, unblemished Swiss chard leaves, trimmed plus extras in case of breakage",
        "Special equipment: large collapsible steamer basket"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Leafy Green",
        "Onion",
        "Soy",
        "Vegetable",
        "Sauté",
        "Steam",
        "Lentil",
        "Healthy",
        "Chard"
    ],
    "title": "Cashew Chard \"Burritos\"",
    "url": "http://www.epicurious.com/recipes/food/views/cashew-chard-burritos-236646"
}
