{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "To Make Pan di Spagna (Sponge Cake): Have the following ingredients at room temperature for at least one hour before baking; 6 eggs, lemon juice, orange zest, and sherry.",
        "Separate 6 eggs and set the egg whites aside. Beat egg yolks until thick and lemon colored. Beat in sugar, lemon juice, orange zest, and sherry or 1 teaspoon almond extract. Beat until foamy.",
        "Sift flour 3 times and fold into eggs yolks gently but thoroughly.  Beat egg whites until foamy, add salt, and beat until stiff but not dry.  Fold into yolks.  Pour batter into one ungreased 9 inch spring form pan.",
        "Bake at 350 degrees F (175 degrees C) for 50 to 60 minutes. Test by pressing lightly with finger tip, if cake springs back at once it is done. Leave cake in pan to cool, and invert on a wire rack.",
        "Once cake is completely cool slice into 3 layers and sprinkle layers with rum.",
        "To Make Filling: Crush ricotta very finely with hands or a potato masher, add 1/2 cup confectioner's sugar and beat for about 3 minutes until creamy.  Stir in 6 tablespoons rum, grated sweet chocolate, chopped candied cherries, cinnamon and toasted almonds.",
        "Spread  ricotta filling over sponge cake layers, using half-inch of filling on each layer. Leave the top and sides of cake plain.",
        "To Make Frosting: Cream butter with 1 cup sifted confectioners' sugar.  Beat the 2 egg whites until stiff and gradually beat into the egg whites the remaining 1 1/2 cups confectioners' sugar. Fold egg whites into the butter mixture and add fold in 1 teaspoon almond extract.",
        "Cover sides and top cake evenly with frosting. Store in refrigerator until ready to serve. Serves 10."
    ],
    "ingredients": [
        "6 eggs",
        "1/2 cup white sugar",
        "1 1/2 tablespoons lemon juice",
        "1 1/2 tablespoons orange zest",
        "2 tablespoons sherry",
        "1 cup cake flour",
        "1/2 teaspoon salt",
        "1 1/2 pounds ricotta cheese",
        "6 tablespoons rum",
        "1/2 cup confectioners' sugar",
        "2 (1 ounce) squares sweet chocolate, grated",
        "1/4 cup candied cherries, chopped",
        "1/2 teaspoon ground cinnamon",
        "1/2 cup chopped toasted almonds",
        "1/4 cup butter",
        "2 1/2 cups confectioners' sugar",
        "2 egg whites",
        "1 teaspoon almond extract",
        "1/4 cup rum",
        "1/4 cup confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cassata alla Siciliana (Sicilian Cream Tart)",
    "url": "http://allrecipes.com/recipe/7343/cassata-alla-siciliana-sicilian-crea/"
}
