{
    "directions": [
        "1. Bring the chicken broth to a boil in a large saucepot and add the beans and bacon. Return the mixture to a simmer and cook, stirring occasionally, until the beans are nearly tender, about 40 minutes.",
        "2. Add the sausage, onions, garlic, and 1 bouquet garni. Return the mixture to a simmer and cook until the sausage is cooked through and the bacon is fork tender, about 30 minutes. Remove and reserve the sausage and bacon. Remove and discard the onions, garlic, and bouquet garni.",
        "3. Season the beans with salt to taste continue to simmer until the beans are tender, about 20 to 25 minutes. Strain the beans, reserve them, and return the cooking liquid to the pot. Continue to simmer until the liquid reduces by 1/2 and is beginning to thicken, about 30 minutes. Reserve the sauce for later use.",
        "4. Season the pork and lamb with salt and pepper. Heat the oil in a casserole or Dutch oven over medium-high heat until it starts to shimmer. Sear the pork and lamb in the oil on all sides, turning as necessary, until deep brown. Transfer the meat to a pan and keep warm.",
        "5. Add the leeks, carrots, and parsnips to the casserole and sauté, stirring occasionally, until the leeks are golden brown, about 15 minutes. Add the garlic and cook until aromatic, about 1 minute. Add the flour and cook, stirring frequently, until the mixture is pasty, about 5 minutes.",
        "6. Add the wine and 3 cups of broth to the casserole, whisking or stirring until smooth. Stir in the tomatoes and the remaining bouquet garni. Return the seared meats to the casserole, along with any juices they may have released, and the duck confit. Add more broth if necessary to keep the meat completely moistened. Bring to a slow simmer over medium-low heat.",
        "7. Preheat the oven to 350 degrees F. Cover the casserole and braise the meat in the oven, skimming the surface as necessary, until the meats are fork tender, about 1 hour.",
        "8. Peel the reserved sausage and slice it 1/4 inch thick. Slice the reserved bacon 1/4 inch thick. Add the sliced sausage and bacon to the casserole. Cover the meat with a layer of the reserved beans. Add the duck confit in a layer, topped with the second half of the beans. Pour the sauce from the beans over the cassoulet. Toss together the bread crumbs and parsley and sprinkle in an even layer over the cassoulet.",
        "9. Turn the oven down to 300 degrees F and bake the cassoulet, uncovered, periodically basting the crust with the juices that bubble up at the sides of the casserole, until it is heated through and a good crust has formed, 1 1/2 to 2 hours. Let the cassoulet rest for 15 minutes before serving. Serve in heated bowls."
    ],
    "ingredients": [
        "12 cups chicken broth",
        "3 cups dry navy beans, presoaked",
        "1 lb slab bacon, sliced 1/4-inch thick",
        "1 lb garlic sausage",
        "2 small yellow onions, peeled and left whole",
        "3 garlic cloves",
        "2 bouquets garnis (see note)",
        "Salt as needed",
        "1 1/2 lb boneless pork loin, cut into large cubes",
        "1 1/2 lb boneless lamb shoulder or leg, cut into large cubes",
        "Freshly ground black pepper as needed",
        "6 tbsp olive oil",
        "1 cup diced leeks",
        "1 cup sliced carrots",
        "1 cup sliced parsnips",
        "1 tsp minced garlic",
        "1/4 cup all-purpose flour",
        "1/3 cup dry white wine",
        "6 cups beef broth",
        "1 cup chopped plum tomatoes",
        "1 3/4 lb duck confit",
        "1 1/2 cups bread crumbs",
        "2 tbsp chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Lamb",
        "Onion",
        "Bastille Day",
        "Dinner",
        "Bacon",
        "Carrot",
        "Parsnip",
        "Winter",
        "Family Reunion",
        "Boil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cassoulet",
    "url": "http://www.epicurious.com/recipes/food/views/cassoulet-357149"
}
