{
    "directions": [
        "Cover beans with cold water by 2 inches in a bowl and soak at room temperature at least 8 and up to 24 hours, or quick-soak (see cooks' note, below). Drain well in a colander.",
        "Make a bouquet garni by wrapping parsley, bay leaf, cloves, peppercorns, and 2 sprigs thyme in cheesecloth and tying with kitchen string, then put in a 5- to 6-quart heavy pot along with pork shoulder and water (4 quarts). Simmer, uncovered, skimming froth occasionally, 1 1/4 hours.",
        "Add beans, onions, carrot, and chopped garlic and simmer, uncovered, stirring occasionally, until beans are just tender, about 45 minutes.",
        "While beans simmer, put oven rack in middle position and preheat oven to 375°F. Straddle roasting pan across 2 burners and heat 1 tablespoon oil in roasting pan over moderately high heat until hot but not smoking, then brown duck legs, turning occasionally to brown skin and meat all over, about 10 minutes. Transfer duck legs with tongs to a platter as browned.",
        "Pour off all but 2 tablespoons fat from roasting pan, then reduce heat to moderately low and cook halved garlic cloves, stirring, until fragrant, about 1 minute. Remove from heat.",
        "Drain bean and pork mixture in a colander set over a large bowl (discard bouquet garni). Stir salt and pepper into broth in bowl and reserve.",
        "Spread bean and pork mixture in roasting pan (with garlic halves), then nestle duck legs, skin sides up, in mixture. Add remaining 3 sprigs thyme and 6 cups reserved broth (liquid should come up around base of duck legs; reserve remaining broth, covered and chilled, for reheating if making dish ahead, or for another use). Bake, uncovered, 30 minutes.",
        "While cassoulet bakes, heat remaining tablespoon oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking. If necessary, halve sausage crosswise to fit in skillet, then brown, turning occasionally, about 3 minutes. Transfer to a cutting board and cool slightly. When sausage is cool enough to handle, halve pieces lengthwise, then cut crosswise into 1/2-inch-thick slices.",
        "Nestle sausage into cassoulet and bake, uncovered, 30 minutes more. Let stand 10 minutes. Gently stir beans, mashing some with back of spoon, to thicken broth before serving.",
        "Cook garlic in oil in cleaned 10-inch skillet over moderate heat, stirring, until fragrant, about 1 minute. Add bread crumbs, salt, and pepper and cook, stirring, until crumbs are crisp and golden, about 3 minutes. Transfer to a small bowl and stir in parsley.",
        "Serve cassoulet with crumb topping."
    ],
    "ingredients": [
        "1 1/2 lb dried white beans such as Great Northern or cannellini (3 2/3 cups), picked over and rinsed",
        "2 sprigs fresh parsley",
        "1 Turkish or 1/2 California bay leaf",
        "2 whole cloves",
        "1/2 teaspoon black peppercorns",
        "5 sprigs fresh thyme",
        "1 1/2 lb boneless pork shoulder, cut into 1/2-inch-thick slices",
        "4 qt water",
        "2 onions, chopped",
        "1 carrot, cut into 1/2-inch pieces",
        "2 tablespoons finely chopped garlic plus 2 cloves, halved",
        "2 tablespoons olive oil",
        "8 confit duck legs",
        "1 tablespoon salt",
        "3/4 teaspoon black pepper",
        "1 lb saucisson à l'ail or other fully cooked garlic pork sausage (not cured or dried), casing removed",
        "1 tablespoon minced garlic",
        "2 tablespoons olive oil",
        "1 1/2 cups coarse fresh bread crumbs (from a baguette)",
        "1/2 teaspoon salt",
        "1/8 teaspoon black pepper",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Special equipment: cheesecloth; kitchen string; a 17- by 11-inch heavy roasting pan or 7-qt shallow flameproof casserole dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Duck",
        "Garlic",
        "Pork",
        "Poultry",
        "Casserole/Gratin",
        "Sausage",
        "Fall",
        "Party",
        "Parsley",
        "Gourmet"
    ],
    "title": "Cassoulet",
    "url": "http://www.epicurious.com/recipes/food/views/cassoulet-233971"
}
