{
    "directions": [
        "1. To make the filling, quickly whisk together 4 tablespoons of the milk with the flour. The slurry will be somewhat thick, so whisk thoroughly to make it smooth. Press out any lumps with a flexible spatula, if necessary.",
        "2. Whisk in the rest of the milk and transfer the mixture to a 2-quart heavy-bottom saucepan. Bring to a simmer over medium heat, whisking constantly. Once bubbles that burp steam form, remove the pot from the heat and continue to stir for another 30 seconds.",
        "3. Cover the milk mixture with plastic wrap pressed directly against the surface. Cool for 15 to 30 minutes.",
        "4. Meanwhile, combine the butter, sugar, citrus oil, and vanilla in the bowl of an electric mixer fitted with the paddle attachment and beat on high speed for up to 5 minutes.",
        "5. Add the milk mixture and continue to beat on high speed until the filling is smooth, another 5 minutes. Beat in the ricotta cheese 1 tablespoon at a time.",
        "6. Preheat the oven to 335°F and place the rack in the middle position. Line the bottoms of three 9-by-2- inch round pans with parchment.",
        "7. Measure the flour, cornstarch, baking powder, and salt into one bowl, and the milk and vanilla into a separate bowl. Whisk each to combine.",
        "8. In the standing mixer fitted with the wire whip attachment, beat the egg whites on high speed to a stiff peak. Drizzle in 1 cup of the sugar while the mixer is running. Scoop the meringue into a large bowl and set aside.",
        "9. Lightly wipe the mixer bowl and replace the wire whip with the paddle attachment. Cream the butter with the remaining 1 cup of sugar on low speed.",
        "10. Add the egg yolks one at a time. Scrape the sides of the bowl all the way to the bottom using a flexible spatula and mix on low speed until the ingredients are thoroughly combined.",
        "11. Alternately add the dry and wet ingredients about a quarter at a time without pausing between additions.",
        "12. Stop the mixer and gently fold the meringue into the batter with a flexible spatula. Pour the mixture evenly into the prepared pans and bake for 27 to 30 minutes, or until the cake bounces back when lightly pressed and a wooden skewer inserted in the center comes out clean.",
        "13. Cool the cakes for 2 minutes, then run an offset spatula around the edges and invert the cakes onto a flat surface. They will be very fragile, so handle them with care.",
        "14. Assemble the extravagant cake by adding about 1 cup each of the fresh strawberries and the ricotta filling between the layers. Cover the outside of the cake with the whipped cream. Add more fresh strawberries around the edge of the cake if you like."
    ],
    "ingredients": [
        "2 ounces (1/4 cup) all-purpose flour",
        "1 cup milk",
        "8 ounces (2 sticks) unsalted butter",
        "8 ounces (1 cup) superfine granulated sugar",
        "1/2 teaspoon citrus oil (pure orange or lemon oil)",
        "1 teaspoon vanilla extract",
        "1/4 cup ricotta cheese",
        "9 ounces (1 3/4 cups) all-purpose flour",
        "2 teaspoons cornstarch",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3/4 cup milk",
        "1 teaspoon vanilla extract",
        "6 eggs, separated",
        "16 ounces (2 cups) superfine granulated sugar, divided",
        "8 ounces (2 sticks) unsalted butter",
        "1 pint fresh strawberries, washed, hulled, and sliced",
        "4 cups whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Cheese",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Vegetarian",
        "Ricotta",
        "Strawberry",
        "Birthday",
        "Party",
        "Advance Prep Required",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cassata Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cassata-cake-359950"
}
