{
    "directions": [
        "Preheat oven to 450°F. Coat a large rimmed baking sheet with 1 Tbsp. oil. Trim cauliflower stalk and place head stalk side down on a cutting board. Slice cauliflower lengthwise into 1/2\" slices.",
        "Arrange cauliflower slices and any stray pieces in a single layer on prepared baking sheet. Drizzle with 1 Tbsp. oil and season with salt and pepper. Roast until underside is deeply browned, 20–25 minutes. Turn cauliflower over, season with salt and pepper, and continue to roast until other side is dark brown and crisp, 15–20 minutes longer.",
        "Meanwhile, melt butter in a small skillet over medium. Add pumpkin seeds, bring to a simmer, and cook, swirling pan occasionally, until pumpkin seeds are toasted and butter is browned and smells nutty, 6–8 minutes. Remove from heat and add red pepper flakes; let cool 10 minutes. Add chopped cilantro and lime juice; season with salt and pepper.",
        "Arrange cauliflower on a serving platter and drizzle with dressing. Serve topped with cilantro leaves."
    ],
    "ingredients": [
        "2 tablespoons olive oil, divided",
        "1 large head of cauliflower",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons unsalted butter",
        "1/4 cup raw shelled pumpkin seeds",
        "1/2 teaspoon crushed red pepper flakes",
        "1/4 cup chopped fresh cilantro, plus leaves with tender stems for serving",
        "1 tablespoon fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cauliflower",
        "Seed",
        "Side",
        "Kid-Friendly",
        "Vegetable",
        "Vegetarian",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cauliflower With Pumpkin Seeds, Brown Butter, and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-with-pumpkin-seeds-brown-butter-and-lime"
}
