{
    "directions": [
        "Wash leek well in a bowl of cold water, then lift out and drain. Blanch leek and cauliflower in a 4- to 5-quart pot of boiling salted water , uncovered, 1 minute. Drain in a sieve and transfer to a bowl of cold water to stop cooking. Drain well.",
        "Bring stock and water to a boil in a 2- to 3-quart saucepan and keep stock at a bare simmer, covered.",
        "Heat 2 tablespoons butter in a 4-quart heavy pot over moderately high heat until foam subsides, then sauté cauliflower and leek, stirring, 2 minutes. Add rice and cook, stirring, 1 minute. Add 1 cup simmering stock and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding stock, about 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding the next, until rice is just tender and creamy looking, 20 to 25 minutes. (There may be leftover broth.)",
        "Remove from heat and stir in cheese, remaining tablespoon butter, and salt and pepper to taste. Thin with a little remaining stock as desired and serve immediately.",
        "*Available at Italian markets, some specialty foods shops, and www.esperya.com."
    ],
    "ingredients": [
        "1 medium leek (white and pale green parts only), finely chopped",
        "1 medium head cauliflower (2 pounds), cut into 1-inch-wide florets",
        "3 1/2 cups chicken stock or canned low-sodium broth (28 ounces)",
        "1 1/2 cups water",
        "3 tablespoons unsalted butter",
        "1 cup Carnaroli rice* (6 3/4 ounces)",
        "1 1/2 ounces finely grated Parmigiano-Reggiano (3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Parmesan",
        "Cauliflower",
        "Leek",
        "Simmer",
        "Gourmet"
    ],
    "title": "Cauliflower and Leek Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-and-leek-risotto-108665"
}
