{
    "directions": [
        "Position rack in center of oven; preheat to 425°F. Toss cauliflower with 1 tablespoon olive oil in large bowl. Spread on large rimmed baking sheet, spacing apart. Sprinkle with salt and pepper. Roast 15 minutes; turn florets over. Continue roasting until tender, about 25 minutes longer. Cool cauliflower, then thinly slice. Drizzle with truffle oil; toss. Reduce oven temperature to 350°F.",
        "Press pie crust onto bottom and up sides of 9-inch-diameter tart pan with removable bottom. Line pie crust with foil; fill with pie weights. Bake crust 20 minutes. Remove foil and pie weights; bake until crust is golden, about 5 minutes, pressing crust with back of fork if bubbles form. Cool crust. Maintain oven temperature.",
        "Heat remaining 1 1/2 tablespoons olive oil in heavy large skillet over medium heat. Add onion; sprinkle with salt and pepper. Cook until onion is deep golden brown, stirring occasionally, about 40 minutes. Cool slightly. DO AHEAD Can be made 1 day ahead. Store crust at room temperature. Cover and chill cauliflower and onion separately.",
        "Brush bottom and sides of crust with mustard. Spread onion in crust. Arrange cauliflower evenly over. Set tart on rimmed baking sheet. Whisk eggs and next 4 ingredients in medium bowl. Stir in Gruyère. Pour mixture over filling in tart pan; sprinkle with Parmesan. Bake until tart is golden and center is set, about 40 minutes. Transfer to rack; cool 15 minutes before serving."
    ],
    "ingredients": [
        "1 small head of cauliflower (about 1 pound), cored, cut into 1-inch florets",
        "2 1/2 tablespoons olive oil, divided",
        "1 tablespoon truffle oil*",
        "1 refrigerated pie crust",
        "1 large onion, halved lengthwise, thinly sliced",
        "1 tablespoon Dijon mustard",
        "2 large eggs",
        "1 (7- to 8-ounce) container mascarpone cheese (Italian cream cheese)*",
        "1/2 cup whipping cream",
        "1/4 teaspoon ground white pepper",
        "Pinch of ground nutmeg",
        "1 cup grated Gruyère cheese",
        "3/4 cup grated Parmesan cheese",
        "*Available at some supermarkets, specialty foods stores, and Italian markets nationwide."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Onion",
        "Vegetable",
        "Appetizer",
        "Side",
        "Bake",
        "Lunch",
        "Cauliflower",
        "Potluck",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cauliflower and Caramelized Onion Tart",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-and-caramelized-onion-tart-237335"
}
