{
    "directions": [
        "Preheat oven to 250°F. Using sharp heavy knife and starting at top center of cauliflower head, cut two 1-inch-thick slices of cauliflower, cutting through stem end. Set cauliflower steaks aside.",
        "Cut enough florets from remaining cauliflower head to measure 3 cups. Combine florets, 1 1/2 cups water, and milk in medium saucepan, and sprinkle with salt and pepper. Bring to boil and cook until cauliflower florets are very tender, about 10 minutes. Strain, reserving 1 cup cooking liquid. Spread florets on large rimmed baking sheet, and bake 10 minutes until slightly dry. Transfer florets to blender. Add reserved 1 cup cooking liquid and puree until smooth. Return puree to same saucepan and increase oven temperature to 350°F.",
        "Heat 2 tablespoons vegetable oil in heavy large ovenproof skillet over medium-high heat. Brush cauliflower steaks with additional oil and sprinkle with salt and pepper. Add cauliflower steaks to skillet and cook until golden brown, about 2 minutes per side. Transfer skillet to oven and bake cauliflower steaks until tender, about 10 minutes.",
        "Rewarm cauliflower puree over medium heat. Divide puree between 2 plates; top each with cauliflower steak."
    ],
    "ingredients": [
        "1 1 1/2-pound head of cauliflower",
        "1 1/2 cups water",
        "1 cup whole milk",
        "2 tablespoons vegetable oil plus additional for brushing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Side",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Cauliflower",
        "Winter",
        "Healthy",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cauliflower Steaks with Cauliflower Purée",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-steaks-with-cauliflower-puree-241351"
}
