{
    "directions": [
        "Toss cauliflower and 1/4 tsp. salt in a large microwave-safe bowl. Cover with plastic wrap, pierce plastic with a knife a few times to vent, and microwave on high 10 minutes. Carefully remove plastic and transfer cauliflower to a colander. Let cool to room temperature, then transfer to a large bowl.",
        "Meanwhile, cook milk, cream cheese, curry powder, mustard, and remaining 1 tsp. salt in a medium saucepan over medium heat, stirring constantly, until smooth, about 4 minutes. Let cool to room temperature, about 30 minutes. Add cauliflower and toss to combine. Add mozzarella and 6 oz. cheddar and toss to combine—mixture should be cool enough so cheese doesn't melt. Transfer cauliflower mixture to freezer-to-oven-safe baking dish or dishes.",
        "If baking immediately, preheat oven to 350°F. Cover dish with foil and bake casserole until heated through and just beginning to bubble, about 45 minutes for large dish, or about 30 minutes for small dishes. Remove foil and sprinkle cheddar over. Heat broiler and broil until top is browned and bubbling, 2–5 minutes.",
        "If freezing to bake later, cover dish with an airtight lid or double layer of plastic wrap and freeze up to 3 months. To cook, preheat oven to 350°F. Cover dish with foil and bake casserole 45 minutes for large dish, or 30 minutes for small dishes. Remove foil and stir well with a rubber spatula. Continue to bake, uncovered, until just bubbling and heated through, 10–15 minutes more. Sprinkle cheddar over. Heat broiler and broil until top is browned and bubbling, 2–5 minutes.",
        "To cook individually portioned frozen casseroles in the microwave, partially cover and microwave on high 4 minutes. Uncover, stir, and microwave at 1-minute intervals until heated through, 4–5 minutes more.",
        "Top with chives, if using, before serving.",
        "Casserole(s) can be assembled 1 day ahead; cover and chill, or freeze up to 3 months."
    ],
    "ingredients": [
        "8 cups coarsely chopped cauliflower (about 2 pounds)",
        "1 1/4 teaspoons kosher salt, divided",
        "1 1/2 cups whole milk",
        "6 ounces cream cheese",
        "1 1/2 teaspoons curry powder",
        "1 teaspoon Dijon mustard",
        "6 ounces mozzarella, shredded (about 1 1/4 cups)",
        "6 ounces sharp cheddar, shredded (about 1 1/4 cup), plus more for sprinkling",
        "1 tablespoon finely chopped chives (optional)",
        "1 (2-quart) or 4 (2-cup) freezer-to-oven-safe baking dishes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Freezer Food",
        "Macaroni and Cheese",
        "Cauliflower",
        "Wheat/Gluten-Free",
        "Cheese",
        "Milk/Cream",
        "Dinner",
        "Vegetarian"
    ],
    "title": "Cauliflower \"Mac 'n' Cheese\" Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-mac-n-cheese-casserole"
}
