{
    "directions": [
        "Stir 1/4 cup water, 2 tablespoons butter, and salt together in a pot; bring to a simmer. Reduce heat to medium and whisk flour into butter mixture until a paste-like dough forms, 2 to 3 minutes. Transfer dough to a bowl to cool, 5 to 10 minutes. Whisk egg into cooled dough until completely incorporated. Refrigerate until chilled, at least 30 minutes.",
        "Melt 2 tablespoons butter in a pot over medium-low heat. Cook and stir onion, garlic, and a pinch of salt in hot butter until onion is soft and translucent, 5 to 10 minutes. Add cauliflower, 2 cups water, and chicken stock. Bring to a simmer and cook until cauliflower is tender, about 30 minutes.",
        "Puree soup using an immersion/stick blender until smooth. Stir cream, nutmeg, cayenne, and a pinch of salt into soup. Reduce heat to low to keep soup warm while making the fritters.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Fold crumbled blue cheese into chilled fritter batter until cheese is coated with dough. Spoon dough into a teaspoon and transfer to a second teaspoon to form a fritter. Drop fritters into oil and cook in the preheated oil until the outside is golden brown and cheese is melted on the inside, 2 to 3 minutes. Ladle soup into bowls and top with fritters and chives."
    ],
    "ingredients": [
        "Fritter Dough:",
        "1/4 cup water",
        "2 tablespoons butter",
        "1 pinch salt",
        "1/4 cup flour",
        "1 egg",
        "Soup:",
        "2 tablespoons butter",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "salt to taste",
        "1 head cauliflower, broken into florets",
        "2 cups water",
        "2 cups chicken stock",
        "1/2 cup heavy cream",
        "1 pinch ground nutmeg, or more to taste",
        "1 pinch cayenne pepper, or more to taste",
        "2 ounces cold firm blue cheese, crumbled",
        "2 cups vegetable oil for frying",
        "1 tablespoon chopped fresh chives, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cauliflower Soup with Blue Cheese Fritters",
    "url": "http://allrecipes.com/recipe/237640/cauliflower-soup-with-blue-cheese-fri/"
}
