{
    "directions": [
        "Set a coffee filter in a glass; set aside. Blanch chives for 10 seconds in a medium saucepan of boiling salted water. Transfer to a medium bowl of ice water to cool. Squeeze chives dry; coarsely chop and place in a blender. Add 3/4 cup oil; purée until smooth. Pour through coffee filter; let drain for 3 hours at room temperature, or overnight in refrigerator (do not press on solids). DO AHEAD: Can be made 1 week ahead. Cover; chill. Bring to room temperature before using.",
        "Preheat oven to 400°F. Line a rimmed baking sheet with parchment paper. Brush bread slices (or toss bread cubes) with 1 tablespoon olive oil; toss with rosemary sprigs. Transfer to prepared sheet; bake until crisp, about 12 minutes. Let cool completely. Discard rosemary sprigs. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Preheat oven to 350°F. Place whole cauliflower head in a large baking dish, rub with 4 tablespoons butter, and season with salt. Add 1/2 cup water to dish. Bake uncovered, tenting with foil if cauliflower begins to brown, until a knife inserted into the core meets no resistance, about 1 1/2 hours. Remove cauliflower from oven; let cool. Coarsely chop and set aside.",
        "Melt 2 tablespoons butter in a large saucepan over medium-low heat. Add onion; cook, stirring occasionally, until onion is soft and translucent, about 15 minutes. Add cauliflower and 4 cups water. Simmer until cauliflower is very soft, about 10 minutes. Let cool slightly. Working in batches, purée in a blender until very smooth. DO AHEAD: Can be made 2 days ahead. Cover; chill.",
        "Return soup to pot and bring to a simmer, adding more water if too thick. Season with salt. Remove from heat and whisk in remaining 6 tablespoons butter and cream. Serve warm in shallow bowls. Rest crostini on edge of each bowl or scatter croutons over; drizzle with chive oil."
    ],
    "ingredients": [
        "2 1-ounce bunches chives",
        "Kosher salt",
        "3/4 cup plus 1 tablespoon olive oil",
        "8 thin slices cut from Finnish rye bread (for crostini) or 4 slices pumpernickel bread, cut into 1/3\" cubes (for croutons)",
        "2 sprigs rosemary",
        "1 large head of cauliflower (about 2 pounds), leaves discarded",
        "12 tablespoons (1 1/2 sticks) unsalted butter, softened, divided",
        "Kosher salt",
        "1 large onion, minced",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Appetizer",
        "Vegetarian",
        "Cauliflower",
        "Fall",
        "Winter",
        "Chive",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cauliflower Soup with Chive Oil and Rye Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-soup-with-chive-oil-and-rye-crostini-367712"
}
