{
    "directions": [
        "Pulse carrots and cauliflower in a food processor (or grate carrot on smallest holes and cauliflower on largest holes of a box grater) until rice-like in texture. Transfer to a large heatproof bowl and toss with 1 Tbsp. oil and 1/4 tsp. salt. Cover with plastic wrap and microwave on high 3 minutes. Carefully remove plastic wrap and let cool slightly.",
        "Meanwhile, mix cheeses, garlic, chives, pepper, 1/2 cup panko, and remaining 1/2 tsp. salt in a medium bowl. Stir in carrot mixture until well combined.",
        "Spray a rimmed baking sheet with nonstick spray. Using your hands, roll tablespoonfuls of carrot mixture into tater-tot shapes. Transfer to prepared sheet, then chill at least 10 minutes.",
        "Place flour in a shallow baking dish. Mix remaining 1 cup panko and 4 Tbsp. oil in another shallow dish. Lightly beat eggs in a shallow bowl. Working in batches, toss tots in flour, then dredge in egg, shaking off excess, then coat in panko mixture. Return to baking sheet and chill at least 10 minutes or up to 1 hour.",
        "Arrange a rack in center of oven and preheat to 425°F. Set a wire rack inside a rimmed baking sheet. Spray with nonstick spray, then transfer tots to rack. Bake tots until deep golden brown and cheese is melted (check by piercing a tot with a paring knife), 22–25 minutes. Serve immediately with ketchup.",
        "For extra-crispy tots, fill a large, deep-sided skillet with 1\" vegetable oil and heat over medium to 350°F. Working in batches, fry tots, flipping halfway through, until golden brown and crispy, about 2 minutes per batch. Using a slotted spoon, transfer to a paper towel-lined platter or baking sheet. Serve immediately with ketchup.",
        "Tot mixture can be formed but not breaded 1 day ahead; cover loosely with plastic and chill."
    ],
    "ingredients": [
        "2 medium carrots (about 8 1/2 ounces), peeled, coarsely chopped",
        "8 ounces cauliflower florets",
        "5 tablespoons vegetable oil, divided",
        "3/4 teaspoon kosher salt, divided",
        "1/2 cup shredded Parmesan (about 1 ounce)",
        "1/2 cup shredded sharp cheddar (about 1 ounce)",
        "1 garlic clove, finely chopped",
        "3 tablespoons chopped chives",
        "1/4 teaspoon freshly ground black pepper",
        "1 1/2 cups panko (Japanese breadcrumbs), divided",
        "Nonstick vegetable cooking spray",
        "1 cup all-purpose flour",
        "3 large eggs",
        "Ketchup, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "snack",
        "Vegetarian",
        "Carrot",
        "Cauliflower",
        "Kid-Friendly",
        "Healthy",
        "Super Bowl",
        "Cheese",
        "Side"
    ],
    "title": "Cauliflower-Carrot Cheesy Tots",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-carrot-cheesy-tots"
}
