{
    "directions": [
        "Preheat oven to 375°F.",
        "Peel potatoes and transfer to a bowl of cold water. Cut 2 potatoes lengthwise into 1/8- to 1/16-inch-thick slices with slicer, then stack slices in piles of 6. Cut out as many cloverleafs as possible from each stack, pressing cutter through stacks, and toss with half of melted butter in a bowl. Arrange chips in 1 layer in a large shallow baking pan (1 inch deep) and season very lightly with salt.",
        "Bake in middle of oven until edges are pale golden, 10 to 15 minutes, then turn chips over with a metal spatula and bake until golden all over, 5 to 10 minutes more, checking frequently after 5 minutes and transferring chips as baked to a rack to cool.",
        "While first batch is baking, slice and cut shapes from remaining 2 potatoes. Toss with remaining butter and bake in another shallow baking pan.",
        "Cook cauliflower in a 3-quart saucepan of  until very tender, 5 to 7 minutes, and drain in a colander. Purée cauliflower in a food processor until smooth, then transfer to a bowl and whisk in sour cream and salt. Just before serving, stir in chives (if using).",
        "Top potato chips with 1 teaspoon cauliflower purée and 1/2 teaspoon caviar, then garnish with chives."
    ],
    "ingredients": [
        "4 large russet (baking) potatoes (2 pounds total)",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "2 cups chopped cauliflower",
        "1/3 cup sour cream",
        "1/4 teaspoon salt",
        "2 tablespoons finely chopped fresh chives (optional)",
        "150 grams caviar (5 ounces; preferably osetra), chilled",
        "Special equipment: a Japanese Benriner or other adjustable-blade slicer; a 1 1/2- to 2-inch cloverleaf or other small decoratively shaped cookie cutter",
        "Garnish: fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Vegetable",
        "Bake",
        "Cocktail Party",
        "New Year's Eve",
        "Cauliflower",
        "Chive",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Cauliflower Purée and Caviar on Cloverleaf Potato Chips",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-puree-and-caviar-on-cloverleaf-potato-chips-108152"
}
