{
    "directions": [
        "Cook cauliflower with coriander seeds in a 4- to 5-quart pot of simmering salted water, uncovered, until tender, 9 to 11 minutes. Transfer cauliflower with a slotted spoon to a bowl of ice and cold water to stop cooking. Drain well in a colander, then discard any seeds clinging to cauliflower and pat cauliflower dry.",
        "Lightly mash half of florets in a bowl with a fork and gently stir in remaining florets. Whisk together eggs, flour, chervil (if using), parsley, mint, chives, salt, pepper, and nutmeg in a large bowl until combined, then stir in all of cauliflower.",
        "Heat 1/2 tablespoon oil in a 10-inch heavy nonstick skillet over moderately high heat until hot but not smoking. Working in batches of 6, drop rounded teaspoons of cauliflower mixture into skillet, patting each lightly with back of spoon to flatten into a 1 1/2- to 2-inch round. Fry, turning over once, until golden and cooked through, about 2 minutes per batch, and transfer to platters. Add more oil to skillet between batches as needed.",
        "Top each fritter with a piece of salmon and 1/4 teaspoon crème fraîche. Serve warm.",
        "*Available at specialty foods shops and some supermarkets"
    ],
    "ingredients": [
        "1 small head cauliflower (1 3/4 pounds), cut into short 1/2-inch-wide florets",
        "1 teaspoon coriander seeds",
        "2 large eggs",
        "2 tablespoons all-purpose flour",
        "1 tablespoon chopped fresh chervil (optional)",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon chopped fresh mint",
        "1 tablespoon chopped fresh chives",
        "1 teaspoon salt",
        "1/8 teaspoon black pepper",
        "Pinch of freshly grated nutmeg",
        "1 to 2 tablespoons olive oil",
        "2 ounces thinly sliced smoked salmon, torn into 40 small pieces",
        "1/4 cup crème fraîche*",
        "Garnish: fresh chervil or chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fry",
        "Cocktail Party",
        "Mint",
        "Salmon",
        "Cauliflower",
        "Fall",
        "Chive",
        "Gourmet"
    ],
    "title": "Cauliflower Fritters",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-fritters-108653"
}
