{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Toss cauliflower with oil, kosher salt, and pepper in a bowl. Spread in 1 layer in a shallow (1-inch-deep) baking pan and roast, turning over with tongs halfway through roasting, until golden brown and tender, 20 to 25 minutes total. Transfer cauliflower with a slotted spoon to paper towels to drain, then carefully pour oil from baking pan through a fine-mesh sieve into a small bowl.",
        "While cauliflower roasts, bring hominy and cream just to a simmer in a 1- to 1 1/2-quart heavy saucepan over moderate heat, then remove from heat and let stand, uncovered, stirring occasionally, 20 minutes.",
        "Meanwhile, heat butter and 2 tablespoons strained oil in a 3-quart heavy saucepan over moderate heat until foam subsides, then cook ham (if using), stirring, 2 minutes. Add onion and bell peppers and cook, stirring, until softened, 4 to 5 minutes. Stir in garlic, red pepper flakes, and bay leaf and cook, stirring, 1 minute. Add vinegar and stock and simmer briskly, uncovered, until liquid is reduced by about half, 12 to 15 minutes.",
        "Stir in hominy mixture and corn and simmer, uncovered, 2 minutes. Add cauliflower and salt to taste and simmer, stirring once or twice, until heated through, about 2 minutes. Stir in parsley."
    ],
    "ingredients": [
        "1 medium head cauliflower (2 pounds), cut into 1-inch-wide florets",
        "1/2 cup olive oil",
        "1/2 teaspoon kosher salt",
        "1/8 teaspoon black pepper",
        "1 (15-oonce) can white hominy, rinsed and drained",
        "1 cup heavy cream",
        "2 tablespoons unsalted butter",
        "2 tablespoons finely chopped country or serrano ham (optional)",
        "1/2 cup diced (1/4 inch) onion",
        "1/2 cup diced (1/4 inch) green bell pepper",
        "1/2 cup diced (1/4 inch) red bell pepper",
        "2 tablespoons minced garlic",
        "1/8 teaspoon dried hot red pepper flakes",
        "1 Turkish or 1/2 California bay leaf",
        "2 tablespoons cider vinegar",
        "1 cupchicken stock or low-sodium broth",
        "1/2 cup fresh corn (from 1 small ear) or thawed frozen corn",
        "1/4 cup chopped fresh flat-leaf parsley",
        "Garnish: thinly sliced scallions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Vegetable",
        "Side",
        "Roast",
        "Cauliflower",
        "Corn",
        "Bell Pepper",
        "Fall",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Gourmet"
    ],
    "title": "Cauliflower Maque Choux",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-maque-choux-108693"
}
