{
    "directions": [
        "Special equipment: a pizza stone and peel or two rimless baking sheets",
        "Place a pizza stone or rimless baking sheet in the oven; preheat to 475 degrees F.",
        "Add the cauliflower to a food processor; pulse until finely ground, about the consistency of couscous. Pour the cauliflower onto a clean kitchen towel (I like flour sack towels for this) and squeeze out as much liquid as possible.",
        "To a large bowl, add the cauliflower, Parmesan, Italian seasoning, garlic, salt, some black pepper and the egg. Mix until the mixture holds together when pinched.",
        "Line a pizza peel or a second rimless baking sheet with parchment paper; liberally brush with olive oil. Spread the cauliflower mixture into a 12-inch-wide circle on the parchment. Slide the parchment onto the preheated pizza stone or baking sheet. Bake until the cauliflower crust is barely golden and darker at the edges, about 15 minutes.",
        "Remove the crust from the oven, sprinkle with the mozzarella and spread the marinara sauce over the top (this keeps the crust dry). Slide the pizza back onto the pizza stone or baking sheet and bake until bubbly and browned in spots, about 4 minutes.",
        "Scatter the basil over the top. Slice and serve."
    ],
    "ingredients": [
        "1 small head cauliflower, chopped (5 to 6 cups)",
        "1 cup grated Parmesan",
        "1/2 teaspoon dried Italian seasoning",
        "1 clove garlic, minced",
        "1/2 teaspoon kosher salt",
        "Freshly ground black pepper",
        "1 egg",
        "1 1/2 cups shredded low-moisture mozzarella",
        "1/2 cup marinara sauce",
        "1/4 cup fresh basil leaves, torn"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pizza Recipes",
        "Cauliflower",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Cauliflower Crust Pizza",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/cauliflower-crust-pizza"
}
