{
    "directions": [
        "Preheat the oven to 450 degrees F; place oven racks in the top and bottom positions. Line two baking sheets with parchment.",
        "For the dipping sauce: Whisk the buttermilk, mayonnaise, sour cream and vinegar in a medium bowl until smooth. Add the chives, parsley, dill, garlic powder, 1/4 teaspoon salt and some pepper; whisk to combine. Cover and chill while you make the cauliflower.",
        "For the cauliflower: Whisk the flour, paprika, garlic powder and 1 teaspoon salt in a large bowl. In a spouted measuring cup, stir together the buttermilk and 1/2 cup water. Whisk the buttermilk mixture into the flour to make a smooth, thick batter.",
        "Add the cauliflower to the batter and toss well to coat. Transfer the cauliflower to the prepared baking sheets, shaking excess batter back into the bowl. Arrange the florets on the baking sheets so they don't touch. Bake until the batter is set, about 15 minutes.",
        "Meanwhile, melt the butter with the hot sauce in a small saucepan over low heat. When the cauliflower has baked for 15 minutes and the batter is set, drizzle with half of the hot sauce mixture, then turn over the florets and drizzle with the rest of the hot sauce mixture.",
        "Set the oven to broil. Broil the cauliflower until tender and the coating is crispy, 2 to 3 minutes. Let cool briefly before serving with the dipping sauce. Serve carrot sticks, celery sticks, bell pepper strips and cucumber slices alongside."
    ],
    "ingredients": [
        "1/3 cup buttermilk",
        "1/3 cup mayonnaise",
        "1/3 cup sour cream",
        "1 tablespoon cider vinegar",
        "2 tablespoons chopped fresh chives",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon chopped fresh dill",
        "1/4 teaspoon garlic powder",
        "Kosher salt and freshly ground black pepper",
        "1 cup all-purpose flour",
        "1 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "Kosher salt",
        "1/2 cup buttermilk",
        "1 medium head cauliflower, broken into 1 1/2-inch florets",
        "2 tablespoons unsalted butter",
        "3/4 cup hot sauce, such as Frank's Red Hot",
        "Serving suggestions: carrot sticks, celery sticks, bell pepper strips and cucumber slices"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cauliflower",
        "Vegetable",
        "Buttermilk",
        "Dairy Recipes",
        "Appetizer",
        "Snack",
        "Recipes for Parties",
        "Super Bowl",
        "Tailgate Party"
    ],
    "title": "Cauliflower Hot Wings with Buttermilk Ranch Dipping Sauce",
    "url": "http://www.foodnetwork.com/recipes/ayesha-curry/cauliflower-hot-wings-with-buttermilk-ranch-dipping-sauce"
}
