{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Grease a shallow 9 inch baking dish or pie pan.",
        "To make crust: Use a cheese cloth to squeeze extra liquid from the grated potatoes. In a medium size mixing bowl, combine potato, onion, egg, salt and flour. Transfer the mixture to the prepared pie pan, and pat it down with a rubber spatula or your fingertips. Bake for 30 minutes. Brush the crust with oil, and bake for another 10 minutes. Remove crust from oven, and reduce the oven's temperature to 350 degrees F (175 degrees C).",
        "To make the filling: In a large frying pan over a high heat, heat the oil until hot. Reduce the temperature to medium and saute onion, garlic, basil, thyme, salt, pepper and paprika in the hot oil; cook for 8 to 10 minutes. Stir the cauliflower into the pan and cook for 15 minutes.",
        "Spread 1/2 of the cheese onto the potato crust. Spoon the vegetables on top of the cheese. Sprinkle the remaining cheese over the sauteed vegetables. Beat the milk and eggs together in a small bowl, and then pour over the vegetables and cheese. Sprinkle paprika over the mixture.",
        "Bake for 35 to 40 minutes, or until the custard is set and the top of the pie is slightly browned."
    ],
    "ingredients": [
        "2 cups shredded potatoes",
        "1/4 cup grated onion",
        "1 egg, beaten",
        "1 teaspoon salt",
        "1 tablespoon all-purpose flour",
        "1 1/2 tablespoons olive oil",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "salt and pepper to taste",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried thyme",
        "1 head cauliflower, coarsely chopped",
        "1 1/2 cups shredded Cheddar cheese",
        "2 eggs, beaten",
        "1/4 cup milk",
        "1/4 teaspoon paprika"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cauliflower Cheese Pie",
    "url": "http://allrecipes.com/recipe/15370/cauliflower-cheese-pie/"
}
