{
    "directions": [
        "Remove leaves and trim stem end of cauliflower, leaving core intact. Place cauliflower core side down on a work surface. Using a large knife, slice cauliflower into four 1/2\" \"steaks\" from center of cauliflower (some florets will break loose; reserve). Finely chop enough loose florets to measure 1/2 cup. Transfer chopped florets to a small bowl and mix with olives, sun-dried tomatoes, 1 tablespoon oil, parsley, and lemon juice. Season relish with salt and pepper.",
        "Preheat oven to 400°. Heat 1 tablespoon olive oil in a large heavy ovenproof skillet over medium-high heat. Working in 2 batches, cook cauliflower steaks until golden brown, about 2 minutes per side, adding tablespoon oil to pan between batches. Transfer steaks to a large rimmed baking sheet. Reserve skillet. Roast cauliflower until tender, about 15 minutes.",
        "Meanwhile, return skillet to medium-high heat and add garlic cloves and tomatoes, one cut side down. Cook until tomatoes are browned; turn tomatoes over and transfer skillet to oven with cauliflower. Roast garlic and tomatoes until tender, about 12 minutes.",
        "Transfer garlic, tomatoes, and 1/2 tablespoon oil to a blender; purée until smooth. Season with salt and pepper. Divide tomato sauce among plates. Place 1 cauliflower steak on each plate; spoon relish over. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 large head of cauliflower",
        "1/2 cup pitted oil-packed black olives, finely chopped",
        "3 sun-dried tomatoes, thinly sliced",
        "3 1/2 tablespoons olive oil, divided, plus more",
        "2 tablespoons chopped flat-leaf parsley",
        "1 teaspoon fresh lemon juice",
        "Kosher salt and freshly ground black pepper",
        "3 garlic cloves",
        "2 plum tomatoes, cored, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "Cauliflower",
        "Winter",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cauliflower Steaks with Olive Relish and Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-steaks-with-olive-relish-and-tomato-sauce-380585"
}
