{
    "directions": [
        "Heat 2 tablespoons oil in heavy large saucepan over medium heat. Add onion and garlic. Sauté until onion is soft, about 5 minutes. Add cauliflower, broth, and cream. Bring soup to boil. Reduce heat to low, partially cover, and simmer gently until cauliflower is tender, about 18 minutes. Puree soup in small batches in blender until smooth. Return to same saucepan. Season soup with kosher salt and white pepper. Do ahead Can be made 1 day ahead. Cool slightly. Cover and chill. Rewarm before serving.",
        "Blanch leek in small saucepan of boiling salted water 1 minute; drain. Place some of leek in center of each bowl. Heat remaining 1 tablespoon oil in medium skillet over high heat. Sprinkle scallops with salt and pepper. Sear until brown and just opaque in center, about 1 1/2 minutes per side. Place 1 scallop on leek in each bowl; top scallop with caviar. Ladle soup around scallop, drizzle with 1 teaspoon lemon oil, and sprinkle with chives."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "1 cup chopped white onion",
        "1 garlic clove, sliced",
        "3 3/4 cups (1/2- to 3/4-inch pieces cauliflower (from 1 large head)",
        "1 1/2 cups low-salt chicken broth",
        "1 1/2 cups whipping cream",
        "Coarse kosher salt",
        "Freshly ground white pepper",
        "1 leek (white and pale green parts only), cut into 1/8-inch-thick rounds",
        "6 sea scallops, patted dry",
        "1 (30-gm) jar American white sturgeon caviar (about 1 ounce)",
        "6 teaspoons purchased lemon-infused grapeseed oil",
        "Finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Onion",
        "Sauté",
        "Dinner",
        "Scallop",
        "Cauliflower",
        "Chive",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cauliflower Soup with Seared Scallops, Lemon Oil, and American Caviar",
    "url": "http://www.epicurious.com/recipes/food/views/cauliflower-soup-with-seared-scallops-lemon-oil-and-american-caviar-236185"
}
