{
    "directions": [
        "Parboil the cauliflower not more than 10 minutes; it should still be firm. Set it aside to cool.",
        "In a food processor, finely chop the onion and parsley together. Drain well. Crush garlic with a mortar and pestle, or with the bottom of a drinking glass.",
        "While onion mixture is draining, combine the flour, salt, pepper, cumin, allspice, cinnamon, cloves, and nutmeg in a large mixing bowl. Sprinkle the dry yeast over the flour. Combine the crushed garlic with the warm water, then pour the mixture over the flour. Mix well, cover, and set the dough aside for 10 minutes to allow it time to rise.",
        "Combine vegetable oil with olive oil and begin heating in a large saucepan (oil should be 1/2 inch deep).  Bring to a temperature of 365 degrees F (180 degrees C).",
        "Beat the eggs until they are frothy and light. Quickly fold them into the dough, then add the cauliflower, onions, and parsley. If the consistency of batter is too runny, add flour; if too thick, add water. The consistency should be similar to thick pancake batter -- not too runny and not too thick.",
        "Gently slide a spoonful of the batter into the oil, and spread it out flat. Cook 3 to 4 patties at a time over a medium-high heat, turning until they are golden brown. Remove the patties with a slotted spoon, and let them drain on paper towels."
    ],
    "ingredients": [
        "1 head cauliflower, broken into small florets",
        "1 onion",
        "7 sprigs fresh parsley",
        "5 cloves garlic",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "1 teaspoon ground allspice",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground nutmeg",
        "1 teaspoon active dry yeast",
        "1 cup warm water",
        "1/4 cup vegetable oil",
        "1/4 cup olive oil",
        "4 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cauliflower Fritters",
    "url": "http://allrecipes.com/recipe/18218/cauliflower-fritters/"
}
