{
    "directions": [
        "In 10- to 12-quart pot, bring salted water to boil. Plunge in 2 lobsters headfirst, then boil, covered, 10 (for 1 1/4-pound lobsters) to 11 minutes (for 1 1/2-pound lobsters) from time they enter water. Transfer with tongs to sink to drain. Return water to boil, and cook remaining lobsters in same manner.",
        "When lobsters are cool enough to handle, remove meat from tails and claws. Discard or reserve for another use tomalley, any roe, and shells, and wipe off any coagulated white albumin from meat. Cut meat into 3/4-inch pieces and chill, covered, at least 1 hour.",
        "Bring large pot salted water to boil. Add cavatelli and boil until cavatelli float to surface, about 8 minutes. Drain, then immediately plunge cavatelli into ice water to stop cooking. Transfer to large bowl, add 2 tablespoons olive oil, and toss to coat.",
        "In heavy large sauté pan over moderately high heat, heat remaining 2 tablespoons olive oil until hot but not smoking. Add shallots and garlic and sauté until translucent, about 1 minute. Add chicken stock, peas, parsley, thyme, chives, pasta, Mascarpone, and lobster. Stir to combine, then simmer until lobster is heated through, about 1 to 1 1/2 minutes. Sprinkle with salt and serve immediately."
    ],
    "ingredients": [
        "5 (1 1/4- to 1 1/2-pound) live lobsters or 2 pounds cooked lobster meat",
        "1 pound frozen cavatelli pasta",
        "1/4 cup extra-virgin olive oil",
        "2 shallots, finely chopped",
        "2 cloves garlic, finely chopped",
        "1/2 cup chicken stock or low-sodium chicken broth",
        "8 ounces fresh or frozen peas*",
        "1/4 cup fresh flat-leaf parsley, chopped",
        "1 1/2 tablespoons fresh thyme, chopped",
        "1 1/2 tablespoons fresh chives, chopped",
        "1/2 cup Mascarpone",
        "1 tablespoon kosher salt",
        "*If using fresh peas, simmer, uncovered, in salted water until just tender, 1 to 2 minutes. Drain, then immediately plunge peas into ice water to stop cooking. Drain again and pat dry. If using frozen peas, do not thaw before using."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Shellfish",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Seafood",
        "Lobster",
        "Fall",
        "Anniversary",
        "Potluck",
        "Boil",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cavatelli Pasta with Lobster, Spring Peas, and Mascarpone",
    "url": "http://www.epicurious.com/recipes/food/views/cavatelli-pasta-with-lobster-spring-peas-and-mascarpone-350394"
}
