{
    "directions": [
        "Prepare barbecue (high heat) using hardwood lump charcoal. When charcoal is orange, spread out in even layer on lower grill rack. Use newspaper to fan excess ash from coals. Sprinkle steaks generously with coarse sea salt and cracked peppercorns. Arrange steaks in single layer directly atop hot embers and grill until cooked to desired doneness, 4 to 5 minutes per side for medium-rare. Using long tongs, transfer steaks to plate. Using natural-bristle brush, remove any embers and loose ash from steaks. Tent steaks with foil and let rest 10 minutes.",
        "Add oil to 12-inch-diameter cast-iron skillet. Place skillet directly atop embers in grill. When oil begins to smoke, add chiles and all remaining ingredients to skillet. Sprinkle with salt and pepper; sauté until vegetables begin to brown, 2 to 5 minutes, depending on heat remaining from embers. Using oven mitts as aid, carefully lift skillet from barbecue. Season pan-fry with salt and pepper. Pour over steaks and serve."
    ],
    "ingredients": [
        "Hardwood lump charcoal (not briquettes)",
        "4 1 1/4-inch-thick porterhouse steaks or New York strip steaks (each about 16 ounces)",
        "Coarse sea salt",
        "Coarsely cracked whole black peppercorns",
        "1/3 cup extra-virgin olive oil",
        "2 fresh poblano chiles, seeded, cut into 2 x 1/4-inch strips",
        "2 red bell peppers, cut into strips",
        "1 yellow bell pepper, cut into strips",
        "1 cup coarsely chopped fresh cilantro",
        "2 large shallots, thinly sliced",
        "Special equipment: 12-inch-diameter cast-iron skillet; Kettle-style charcoal grill; Natural-bristle pastry brush",
        "Ingredient info: Fresh poblano chiles (often called pasillas) are available at some supermarkets and at Latin markets.",
        "Test-kitchen tip: Hardwood lump charcoal is made from pure wood (with no additives or fillers). As the name suggests, this type of charcoal comes in irregularly shaped lumps, unlike the uniformly shaped charcoal briquettes. Look for hardwood lump charcoal at natural foods stores, grill shops, and online at sites such as kindlin.com and wickedgoodcharcoal.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Dinner",
        "Steak",
        "Bell Pepper",
        "Grill",
        "Grill/Barbecue",
        "Pan-Fry",
        "Chile Pepper"
    ],
    "title": "Caveman Porterhouse with Poblano Pan-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/caveman-porterhouse-with-poblano-pan-fry-359730"
}
