{
    "directions": [
        "In a bowl beat cream cheese until fluffy. Quarter eggs and with back of a spoon force through a coarse sieve into cream cheese. Add scallion and stir well. Filling may be made 1 day ahead and chilled, covered. Bring filling to room temperature before proceeding.",
        "On a work surface arrange 2 egg sheets, side by side and overlapping by 1 inch. Put a dab of filling between sheets where they overlap (to act as glue) and press sheets together gently. Spread 1/2 cup filling on overlapping egg sheets, leaving about a 1/2-inch border on each long side. Fold in border of long side nearest you and tightly roll up sheets jelly-roll fashion into one 11-inch-long roll. Wrap egg sheet roll in plastic wrap and chill 1 hour, or until firm. Make 3 more egg sheet rolls with remaining egg sheets and filling in same manner. Egg sheet rolls may be made 1 day ahead and chilled, wrapped well.",
        "Discard plastic wrap and trim ends of egg sheet rolls. Cut rolls crosswise into 3/4-inch pieces. Arrange pieces, cut ends up, on a platter and top each with about 1/4 teaspoon caviar.",
        "In a bowl dissolve cornstarch in water and whisk in eggs and salt until smooth. Brush a non-stick skillet measuring 6 inches across bottom lightly with oil and heat over moderately high heat until hot but not smoking. Half-fill a 1/4-cup measure with egg mixture. Remove skillet from heat and pour in 1/8 cup egg mixture, swirling skillet to coat evenly. Return skillet to heat and cook egg sheet until set, 10 to 15 seconds. Loosen edges of egg sheet with a heatproof rubber spatula and turn sheet over. Cook egg sheet until set, 5 to 10 seconds more, and slide onto a plate. Make more egg sheets with remaining mixture in same manner, brushing skillet lightly with oil each time. Egg sheets may be made 1 day ahead and chilled, wrapped in plastic wrap. Makes 8 or 9 egg sheets."
    ],
    "ingredients": [
        "8 ounces cream cheese, softened",
        "2 hard-cooked large eggs",
        "1 cup finely chopped scallion greens (from about 1 large bunch)",
        "1 teaspoon cornstarch",
        "1 tablespoon cold water",
        "4 large eggs, beaten lightly",
        "1/4 teaspoon salt",
        "vegetable oil for brushing skillet",
        "2 ounces beluga or sevruga caviar*",
        "*available at some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Fish",
        "Onion",
        "Cocktail Party",
        "Fall",
        "Gourmet"
    ],
    "title": "Caviar, Cream Cheese, Scallion, and Egg Towers",
    "url": "http://www.epicurious.com/recipes/food/views/caviar-cream-cheese-scallion-and-egg-towers-13071"
}
