{
    "directions": [
        "Put 1/2 cup sour cream in a paper-towel-lined sieve set over a bowl, then let drain, covered with plastic wrap and chilled, 3 hours.",
        "Stir together remaining 1/4 cup sour cream, eggs, onion, butter, dill, zest, salt, pepper, and 1 tablespoon chives until combined well.",
        "Invert bottom of springform pan (so that turned-up edge is underneath for easy removal of tart) and close side of pan around bottom. Spread egg mixture evenly in pan with offset spatula, smoothing top. Cover surface with plastic wrap, pressing gently, and chill until firm, at least 3 hours.",
        "Spread drained sour cream evenly over egg mixture with offset spatula.",
        "Gently spread half of caviar on several sheets of paper towels to absorb excess cuttlefish ink. Carefully lift caviar from paper towels and spread on top of egg mixture (be careful not to smash caviar). Repeat method with remaining caviar. Serve cut into wedges and sprinkled with remaining chives, if desired."
    ],
    "ingredients": [
        "3/4 cup sour cream",
        "8 hard-boiled large eggs, finely chopped",
        "1/2 cup finely chopped onion (1 medium)",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "2 tablespoons finely chopped fresh dill",
        "2 teaspoons finely grated fresh lemon zest",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "3 tablespoons finely chopped fresh chives",
        "7 oz black lumpfish caviar (see cooks' note below)",
        "Special equipment: a 9-inch nonstick springform pan; a small offset spatula",
        "Accompaniments: lemon wedges; 16 thin slices whole-wheat toast, buttered, then halved or quartered diagonally"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fish",
        "Appetizer",
        "No-Cook",
        "Cocktail Party",
        "Quick & Easy",
        "Sour Cream",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Caviar Tart",
    "url": "http://www.epicurious.com/recipes/food/views/caviar-tart-233529"
}
