{
    "directions": [
        "1. To make the stuffing: Preheat the oven to 250°F. Heat the oil in a large skillet over medium-low heat. Add the bacon and fry until it is cooked through but still a little pink and soft. Remove the bacon from the skillet (leave the oil and fat in the skillet) and, when cool enough to handle, chop it fine.",
        "2. While the skillet is still hot, add the onions and place over low heat. Cook, stirring frequently, about 2 minutes. Add the mushrooms and bacon and raise the heat to medium. Season to taste with salt and pepper: Cover the skillet and cook for 15 minutes. Transfer the stuffing to an ovenproof dish and keep warm in the oven.",
        "3. Meanwhile, make the pancakes: Grate the potatoes on the large holes of a box grater or with the grating disk of a food processor. Roll the potatoes in a clean kitchen towel and wring out any excess moisture. Transfer the potatoes to a bowl and stir in the egg, bread crumbs, and salt and pepper to taste.",
        "4. To cook the pancakes, pour the oil into the skillet and place over medium heat. When the oil is very hot but not smoking, pour a scant 1/4 cup of batter and spread it out with a spatula until it is about 6 inches in diameter. Cook until the bottom is golden brown, about 3 minutes, then flip and cook the other side until browned and the pancake is slightly crispy, about 3 minutes more. Transfer the pancake to a plate and place in the oven to keep warm. Repeat until all the batter is used.",
        "5. To serve, place 1/4 cup of the stuffing mixture on each pancake and then fold over. Put a dollop of sour cream on the side."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "2 slices bacon",
        "2 large onions, diced",
        "6 white mushrooms, thinly sliced",
        "1 teaspoon kosher salt",
        "Freshly ground black pepper",
        "5 to 6 medium russet potatoes (about 2 pounds), scrubbed clean",
        "1 large egg",
        "1 tablespoon dry bread crumbs",
        "Kosher salt and freshly ground black pepper",
        "1 to 2 tablespoons vegetable oil",
        "1/2 cup sour cream, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Potato",
        "Side",
        "Fry",
        "Thanksgiving",
        "Bacon",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cecylia Roznowska's Potato Pancakes Stuffed with Bacon, Mushrooms, and Onion",
    "url": "http://www.epicurious.com/recipes/food/views/cecylia-roznowskas-potato-pancakes-stuffed-with-bacon-mushrooms-and-onion-367531"
}
