{
    "directions": [
        "In a small heavy saucepan simmer maple syrup, gingerroot, 3 tablespoons lemon juice, soy sauce, garlic, and salt and pepper to taste until reduced to about 1 cup, about 30 minutes, and let cool. (Maple glaze may be made 2 days ahead and chilled, covered. Bring maple glaze to room temperature before proceeding.)",
        "Preheat oven to 350° F. If using cedar plank, lightly oil and heat in middle of oven 15 minutes; or lightly oil a shallow baking pan large enough to hold salmon.",
        "Arrange scallion greens in one layer on plank or in baking pan to form a bed for fish.",
        "In another small saucepan heat half of glaze over low heat until heated through to use as a sauce. Stir in remaining tablespoon lemon juice. Remove pan from heat and keep sauce warm, covered.",
        "Put salmon, skin side down, on scallion greens and brush with remaining glaze. Season salmon with salt and pepper and roast in middle of oven until just cooked through, about 20 minutes if using baking pan or about 35 if using plank.",
        "Cut salmon crosswise into 6 pieces. On each of 6 plates arrange salmon and scallion greens on a bed of mashed potatoes. Drizzle salmon with warm sauce."
    ],
    "ingredients": [
        "1 cup pure maple syrup",
        "2 tablespoons finely grated peeled fresh gingerroot",
        "4 tablespoons fresh lemon juice",
        "3 tablespoons soy sauce",
        "1 1/2 teaspoons minced garlic",
        "2 1/2-pound center-cut salmon fillet with skin",
        "Greens from 1 bunch scallions",
        "Mustard Mashed Potatoes, to serve",
        "An untreated cedar plank (about 17x10 1/2\") if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Ginger",
        "Onion",
        "Roast",
        "Dinner",
        "Lemon",
        "Seafood",
        "Salmon",
        "Healthy",
        "Maple Syrup",
        "Soy Sauce",
        "Simmer",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Cedar Planked Salmon With Maple Glaze and Mustard Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/cedar-planked-salmon-with-maple-glaze-and-mustard-mashed-potatoes-14473"
}
