{
    "directions": [
        "1. Prepare an indirect fire in your grill with a hot fire on one side and no fire on the other. For a charcoal grill, soak 1 cup wood chips or corncobs in water for at least 30 minutes and place directly on the hot coals when ready to plank. For a gas grill, place 1/2 cup dry wood chips or corncobs in a smoker box (or wrap chips in aluminum foil and poke holes in the foil) and place over direct heat in the back of the grill.",
        "2. In the cavity of each fish, place 2 sprigs each of tarragon, dill, and parsley, and 2 stems of chives. Season with salt and pepper. Place 2 fish on each plank.",
        "3. Brush the cut sides of the lemons and onions with olive oil.",
        "4. When you see the first wisp of smoke, place the planks on the indirect side of the grill. Set the onion and lemon halves, cut side down, directly on the grate over the fire and close the lid.",
        "5. Check the lemons after 2 or 3 minutes. If they have nice grill marks, remove them from the grill. The onions will take an additional 10 to 15 minutes and may be turned after the first 10 to 12 minutes. When they are nicely charred, remove them from the grill, too. Close the lid and continue to cook the fish until it is opaque and begins to flake when tested with a fork, 45 to 60 minutes total.",
        "6. Fillet the char and serve on a platter with the lemon and onion halves.",
        "Oven Smoke-Planking: Preheat the oven to 400°F. Place 1/2 cup dry wood chips or corncobs in a small metal pan on the bottom rack of the oven and let smolder for about 15 minutes before planking. Place the herb-stuffed planked fish in the middle of the oven. Oven smoke-plank for 45 to 60 minutes, or until the fish is opaque and begins to flake when tested with a fork. Garnish with lemon wedges. (Omit the onions.)"
    ],
    "ingredients": [
        "4 whole Arctic char (about 1 pound each), cleaned",
        "8 sprigs fresh tarragon",
        "8 sprigs fresh dill",
        "8 sprigs fresh flat-leaf parsley",
        "8 stems fresh chives",
        "Salt and freshly ground white pepper",
        "Olive oil for brushing",
        "4 lemons, halved",
        "4 medium-size red onions, peeled and halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Seafood",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Advance Prep Required",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cedar-Planked Char with Wood-Grilled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/cedar-planked-char-with-wood-grilled-onions-359609"
}
