{
    "directions": [
        "If using duck leg, peel off skin and reserve. Remove meat from bones, discarding bones, and shred meat.",
        "Cut reserved duck skin into thin strips and in a small non-stick skillet cook over moderate heat until fat is rendered and skin is crisp and golden brown. Transfer cracklings with a slotted spoon to paper towels to drain and season with salt.",
        "With a sharp knife peel celery root and cut into 1/2-inch cubes. Thinly slice shallots and chop celery ribs.",
        "In an 8-quart heavy kettle cook vegetables in butter with salt and pepper to taste over moderately high heat, stirring, until golden, about 6 minutes. Add water and boil, uncovered, until celery root is very tender, about 15 minutes.",
        "In a blender purée mixture in batches (use caution when blending hot liquids) until smooth, transferring to a large saucepan. Stir in lemon juice and, if necessary, more water to reach desired consistency. Season soup with salt and pepper and keep warm.",
        "In a non-stick skillet heat duck meat over moderate heat, stirring, just until hot and season with salt and pepper.",
        "In a bowl whisk cream just until stiff peaks form.",
        "Serve bisque topped with duck meat, cracklings, and a dollop of whipped cream."
    ],
    "ingredients": [
        "1 duck leg confit (about 1/2 pound) if desired",
        "a 1 1/2-pound celery root (sometimes called celeriac)",
        "1/2 pound shallots (about 6 large)",
        "2 celery ribs",
        "1/2 stick (1/4 cup) unsalted butter",
        "8 cups water",
        "1 tablespoon fresh lemon juice, or to taste",
        "1/4 cup chilled heavy cream if desired, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Citrus",
        "Dairy",
        "Duck",
        "Poultry",
        "Vegetable",
        "Fall",
        "Gourmet"
    ],
    "title": "Celery Root Bisque with Duck Confit and Cracklings",
    "url": "http://www.epicurious.com/recipes/food/views/celery-root-bisque-with-duck-confit-and-cracklings-14493"
}
