{
    "directions": [
        "1. Wash the celery under cold running water, then peel the outside of the stalks using a swivel-blade vegetable peeler. Seek to remove all the strings that you possibly can. Cut the celery into skinny strips 2 to 3 inches long and no more than 1/4 inch wide. (I'd rather you did this by hand, but if you must use the food processor, insert the large shredding disk and cut the celery into pieces short enough to fit horizontally inside the processor's feed tube.) You want to end up with about 1 1/2 cup.",
        "2. Peel the avocado, split it in half, cut it lengthwise into sections, then cut it into thin slices no more than 1/2 inch wide.",
        "3. Split a large red pepper in half along its creases, save one half for cooking or for other salads, wash the other under cold running water, scoop away the seeds and white pith. Cut it into 1/4-inch dice, yielding approximately 2/3 cup diced pepper.",
        "4. Combine the celery, avocado, bell pepper, and black olives in a ceramic or glass bowl, sprinkle liberally with salt, add the vinegar, olive oil, and several grindings of pepper. Toss thoroughly, being careful not to mash the avocado too much."
    ],
    "ingredients": [
        "2 or 3 medium celery stalks",
        "1 small or 1/2 large ripe avocado",
        "1/2 red bell pepper",
        "1/3 cup black olives, pitted and cut in two pieces",
        "Fine sea salt",
        "1 tablespoon red wine vinegar",
        "3 tablespoons extra virgin olive oil",
        "Black pepper ground fresh from the mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Pepper",
        "Vegetable",
        "Appetizer",
        "Side",
        "No-Cook",
        "Quick & Easy",
        "Avocado",
        "Celery",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Celery, Avocado, and Bell Pepper Salad with Black Olives",
    "url": "http://www.epicurious.com/recipes/food/views/celery-avocado-and-bell-pepper-salad-with-black-olives-231456"
}
