{
    "directions": [
        "Melt the butter in a large pot over medium heat. Stir in the garlic, shallot, and onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the celeriac, carrot, celery, potato, and 1 cup of the vegetable broth; cook and stir until the vegetables are heated, about 5 minutes before pouring in the remaining broth. Season with the pepper, tarragon, sage, thyme, and parsley; gently stir the pears into the mixture; bring to a boil. Reduce heat to medium-low; cover and simmer until the vegetables are tender, about 20 minutes.",
        "Remove the soup from the heat and allow to cool for 10 minutes; stir the cream into the soup. Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot. Season to taste with salt and pepper before serving."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "1 clove garlic, minced",
        "1 shallot, minced",
        "1 onion, chopped",
        "4 celeriac (celery roots), peeled and cubed",
        "1 carrot, chopped",
        "3 stalks celery, chopped",
        "1 large potato, peeled and cubed",
        "8 cups vegetable broth",
        "1 teaspoon crushed black peppercorns",
        "1 teaspoon dried tarragon",
        "1 teaspoon crumbled dried sage",
        "1 tablespoon dried thyme leaves",
        "1 tablespoon dried parsley",
        "3 pears - peeled, cored, and chopped",
        "1/2 cup heavy cream (optional)",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Celeriac and Pear Soup",
    "url": "http://allrecipes.com/recipe/213182/celeriac-and-pear-soup/"
}
