{
    "directions": [
        "Halve leeks lengthwise, then coarsely chop. Wash leeks in a bowl of cold water, agitating them, then lift out onto paper towels and pat dry.",
        "Cook bacon in a 4-quart heavy pot over moderate heat, turning occasionally, until crisp, 6 to 8 minutes. Transfer to paper towels.",
        "Pour off all but 2 teaspoons fat from pot, then add oil and cook leeks over moderate heat, stirring occasionally, until softened, about 6 minutes. Add celery root and cook, stirring, 2 minutes. Add water and broth and bring to a boil, then reduce heat and simmer, uncovered, until celery root is very tender, 35 to 40 minutes.",
        "While soup simmers, thinly slice apple lengthwise into 1/8-inch-thick slices with slicer, working around core, then cut slices into 1/8-inch matchsticks with a knife. Gently toss with celery and celery leaves.",
        "Purée soup in batches in a blender until smooth (use caution when blending hot liquids), transferring to a bowl. Return soup to cleaned pot. (If soup is too thick, thin with 1/2 to 3/4 cup water.) Stir in salt, pepper, and half-and-half and cook over moderately low heat, stirring occasionally, until warm. Season with salt, then divide among 4 bowls and top with apple-celery mixture and coarsely crumbled bacon."
    ],
    "ingredients": [
        "3 medium leeks (3/4 lb), white and pale green parts only",
        "3 bacon slices (2 oz)",
        "1 tablespoon olive oil",
        "1 1/2 lb celery root, peeled with a knife and cut into 1/2-inch pieces",
        "3 cups water",
        "1 3/4 cups reduced-sodium chicken broth",
        "1 Granny Smith apple",
        "3/4 celery rib, very thinly sliced on a long diagonal (1/2 cup)",
        "1/3 cup inner celery leaves",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 cup half-and-half",
        "Special equipment: an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Appetizer",
        "Sauté",
        "Quick & Easy",
        "Apple",
        "Bacon",
        "Celery",
        "Leek",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Celery-Root Soup with Bacon and Green Apple",
    "url": "http://www.epicurious.com/recipes/food/views/celery-root-soup-with-bacon-and-green-apple-233784"
}
