{
    "directions": [
        "Peel outer strings from 4 celery ribs with a paring knife. Cut peeled celery into 2-inch lengths, then use slicer to julienne enough celery to measure 2 cups, reserving all trimmings. Transfer julienned celery to a bowl and chill.",
        "Cut enough of trimmings and remaining ribs into 1/4-inch slices to measure 2 cups. Add celery slices (not julienne) and water to a small saucepan and simmer, covered, until tender, about 5 minutes. Remove from heat and add parsley, stirring until wilted.",
        "Transfer blanched celery slices, parsley, and any remaining liquid to a blender and purée until smooth, about 2 minutes, then force through a medium-mesh sieve into a bowl, pressing on and discarding solids. Stir 1/4 teaspoon salt and a pinch of pepper into celery coulis and set bowl in a larger bowl of ice and cold water.",
        "Heat 1 cup oil in a 10-inch skillet over moderately high heat until hot but not smoking, then fry bread, stirring constantly, until golden brown, 15 to 20 seconds. Immediately transfer croutons with a slotted spoon to paper towels to drain, then sprinkle with celery salt. Cool croutons to room temperature.",
        "Whisk together vinegar, pepper, remaining 1/4 teaspoon salt, and remaining tablespoon oil in a large bowl until blended, then add celery julienne and croutons, tossing to coat.",
        "Spoon about 2 tablespoons celery coulis onto each of 4 plates and pile salad alongside."
    ],
    "ingredients": [
        "7 large celery ribs",
        "1/4 cup water",
        "1/4 cup loosely packed fresh flat-leaf parsley leaves",
        "1/2 teaspoon salt",
        "1 cup plus 1 tablespoon extra-virgin olive oil",
        "2/3 cup diced (1/4 inch) firm white sandwich bread or baguette",
        "1/4 teaspoon celery salt",
        "1 teaspoon red-wine vinegar",
        "1/8 teaspoon black pepper",
        "Special equipment: a Japanese Benriner or other adjustable-blade slicer with julienne attachment",
        "Accompaniment: soft crumbly goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetable",
        "No-Cook",
        "Vegetarian",
        "Celery",
        "Winter",
        "Gourmet"
    ],
    "title": "Celery Salad",
    "url": "http://www.epicurious.com/recipes/food/views/celery-salad-109002"
}
