{
    "directions": [
        "Add celery root to a large pot of boiling salted water. Reduce heat to medium-low and simmer until tender, 11-13 minutes. Using a slotted spoon, transfer celery root to a large bowl. Return water to a boil; repeat with kohlrabi, then potatoes, cooking each separately until tender, 14-16 minutes for kohlrabi and 10-12 minutes for potatoes; add to bowl with celery root.",
        "Meanwhile, bring apple and 2 tablespoons water to a boil in a small saucepan. Cover and cook over medium-high heat, stirring occasionally, until apple falls apart, 6-8 minutes, adding water by tablespoonfuls if dry.",
        "Working in batches, pass celery root, kohlrabi, potatoes, and apple through a potato ricer into a large bowl. Pass mixture through ricer again if a smoother texture is desired. Stir in butter. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Transfer to a microwave-safe bowl, cover, and chill. Rewarm in microwave in 30-second intervals until heated through. Transfer to a large serving bowl. Garnish with chervil sprigs."
    ],
    "ingredients": [
        "2 pounds celery root (celeriac), peeled, cut into 3/4\" cubes",
        "Kosher salt",
        "1 1/2 pounds kohlrabi, peeled, cut into 1/2\" cubes",
        "1 pound russet potatoes, peeled, cut into 1\" cubes",
        "1 Granny Smith apple (1/2 pound), peeled, cored, cut into 1\" cubes",
        "2 tablespoons (1/4 stick) unsalted butter",
        "Freshly ground black pepper",
        "Fresh chervil sprigs",
        "Special equipment: A potato ricer or food mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "Low Sodium",
        "Dinner",
        "Apple",
        "Celery",
        "Fall",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Celery Root, Kohlrabi, and Apple Purée",
    "url": "http://www.epicurious.com/recipes/food/views/celery-root-kohlrabi-and-apple-puree-368251"
}
