{
    "directions": [
        "Cut celery ribs crosswise into thirds. Beginning at 1 end of each piece of celery, make lengthwise cuts about 1/8 inch apart, cutting through to cutting board and stopping 1/4 inch from other end (so that pieces stay whole). Transfer as cut to a bowl of ice and cold water.",
        "Trim stem end of each radish to create a flat surface. Stand 1 radish stem-end down and make vertical cuts at 1/8-inch intervals into (but not all the way through) radish, stopping about 1/4 inch above stem end. Rotate radish 90 degrees and make vertical cuts in same manner to form a crosshatch pattern, keeping radish intact. Transfer to ice water. Repeat with remaining radishes.",
        "Chill celery and radishes, covered in ice water, until ends of celery curl, at least 1 hour.",
        "Trim endive and separate leaves. Keep chilled, covered, until ready to serve.",
        "Mash anchovies and garlic to a paste with salt and pepper using a mortar and pestle (or mince and mash with a large heavy knife and transfer to a bowl). Stir in vinegar with pestle (or a whisk), then add oil in a slow stream, stirring (or whisking) vigorously until dressing is emulsified.",
        "Drain celery and radishes and pat dry. Serve vegetables with individual ramekins of dressing for dipping.",
        "*Puntarelle is available by mail order from Lucio Gomiero's European Vegetable Specialties Farms, radicchio.com."
    ],
    "ingredients": [
        "8 large celery ribs, strings discarded and ribs halved lengthwise",
        "1 bunch small radishes",
        "1 Belgian endive",
        "8 flat anchovy fillets, chopped (1 1/2 tablespoons)",
        "1 small garlic clove, chopped",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 tablespoon white-wine vinegar",
        "6 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "No-Cook",
        "Celery",
        "Radish",
        "Endive",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Celery, Radishes, and Endive with Anchovy Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/celery-radishes-and-endive-with-anchovy-dressing-107790"
}
