{
    "directions": [
        "Melt butter in heavy large pot over medium heat. Add celery root, apples, and onion. Cook until apples and some of celery root are translucent (do not brown), stirring often, about 15 minutes. Add 4 cups broth. Cover and bring to simmer. Reduce heat to medium-low; simmer covered until celery root and apples are soft, stirring occasionally, about 25 minutes. Remove from heat; cool slightly.",
        "Working in batches, puree soup in blender until smooth, adding more broth by 1/4 cupfuls to thin to desired consistency. Return soup to pot. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Refrigerate uncovered until cold, then cover and keep refrigerated.",
        "Puree chives, grapeseed oil, and pinch of salt in blender until smooth.",
        "Preheat oven to 375°F. Arrange pancetta slices in single layer on rimmed baking sheet. Roast until pancetta is browned and crispy, about 18 minutes. Transfer to paper towels to drain. Crumble pancetta. DO AHEAD: Chive oil and pancetta can be made 2 hours ahead. Let stand at room temperature.",
        "Rewarm soup over medium heat. Divide soup among bowls. Sprinkle pancetta crumbles over each serving. Drizzle each bowl with chive oil."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) butter",
        "4 cups 1/2-inch cubes peeled celery root (from one 1 1/4-pound celery root)",
        "3 cups 1/2-inch cubes peeled cored Granny Smith apples (from about 2 medium)",
        "1 1/2 cups chopped onion (about 1 large)",
        "4 cups (or more) low-salt chicken broth",
        "1/2 cup chopped chives",
        "1/2 cup grapeseed oil",
        "Pinch of salt",
        "3 ounces thinly sliced pancetta (Italian bacon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Apple",
        "Bacon",
        "Celery",
        "Fall",
        "Winter",
        "Chive"
    ],
    "title": "Celery Root and Apple Soup",
    "url": "http://www.epicurious.com/recipes/food/views/celery-root-and-apple-soup-239846"
}
