{
    "directions": [
        "1. In a food processor or blender, or with an electric mixer, combine the cheeses, onion, and salt. Add the eggs and beat until smooth. Beat in the butter, 1 tablespoon at a time. Stir in enough of the semolina to produce a firm dough. (Getting the moisture level right so that the batter holds together in your hand is the tricky part.) Cover and refrigerate for at least 2 hours or overnight. (The semolina absorbs moisture from the batter and firms it.)",
        "2. Bring a large pot of lightly salted water to a gentle boil. Using 2 moistened soup spoons or your hands moistened with water, form the batter into 1 1/2-inch balls.",
        "3. Drop the dumplings in the water in batches and stir gently to prevent sticking. Reduce the heat and simmer, uncovered, until they expand and rise to the surface, about 15 minutes. Using a slotted spoon, transfer to a bowl. Serve warm. To keep warm or reheat, place in a 200°F oven.",
        "In the dumpling batter, omit the onion and add 3 to 5 tablespoons sugar and, if desired, 1 to 2 teaspoons grated lemon zest. Press a deep indentation into the cheese balls, fill with about 1/4 teaspoon lekvar (prune butter) or other jam (about 1/4 cup total), and press the dough around the filling to enclose. Cook as above. Serve with sweetened whipped cream, cinnamon sugar, or jam.",
        "Omit the onion and substitute 1/2 to 3/4 cup fine-grind yellow cornmeal for the semolina."
    ],
    "ingredients": [
        "1 3/4 cups (14 ounces) pot or soft goat cheese",
        "1/4 cup (2 ounces) cream cheese or mascarpone, softened",
        "1/4 cup grated onion",
        "1 teaspoon table salt or 2 teaspoons kosher salt",
        "2 large eggs, lightly beaten",
        "2 tablespoons unsalted butter, softened",
        "About 3/4 cup semolina flour, farina (not quick-cooking), or matza meal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Appetizer",
        "Hanukkah",
        "Quick & Easy",
        "Cream Cheese",
        "Goat Cheese",
        "Kosher",
        "Shavuot",
        "Boil",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Central European Cheese Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/central-european-cheese-dumplings-233357"
}
