{
    "directions": [
        "In a large heavy pot, heat the oil or fat until very hot. Add the onions, lower the heat to medium, and cook, stirring occasionally, until lightly golden, about 10 minutes. Add the potatoes and carrots and cook, stirring occasionally, for 10 minutes.",
        "Stir in the tomatoes, then add the cumin, chile, salt, and pepper and stir well. Add 2 cups of the boiling water or stock and bring to a boil. Let boil vigorously for several minutes, then stir in the dal. Once the mixture has again returned to the boil, lower the heat, cover, and simmer until the mung beans are tender, 30 to 40 minutes, stirring every 10 minutes or so to prevent sticking. Add more boiling water or stock if necessary.",
        "When the beans are done, stir in the cooked rice. The mixture should be moist; add a little hot water or stock if necessary. Taste for seasoning. Serve hot, garnished with sprigs of fresh mint (if available) and accompanied by plain yogurt.",
        "Alternative: An Uzbek version of this stew includes lamb: Cut 1/2 pound lean lamb into small cubes. Add the meat several minutes after you begin sautéing the onions. You may wish to increase the salt and pepper."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil or rendered lamb fat",
        "2 cups coarsely chopped onions (about 3 medium onions)",
        "2 medium potatoes, cubed",
        "2 medium carrots, coarsely chopped",
        "1 pound (about 4 medium) ripe tomatoes, coarsely chopped",
        "1 teaspoon cumin seed, ground",
        "3/4 teaspoon dried chile pepper flakes or crumbled dried red chile",
        "2 teaspoons salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 to 3 cups boiling water or mild stock",
        "1 cup mung dal, soaked overnight in water to cover",
        "2 1/2 cups cooked long-grain white rice (or 1 cup uncooked rice, cooked while mung beans cook)",
        "Sprigs of mint (optional)",
        "2 to 3 cups plain yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Potato",
        "Rice",
        "Tomato",
        "Vegetable",
        "Stew",
        "Vegetarian",
        "Yogurt",
        "Fall",
        "Healthy"
    ],
    "title": "Central Asian Rice and Bean Stew",
    "url": "http://www.epicurious.com/recipes/food/views/central-asian-rice-and-bean-stew-15774"
}
