{
    "directions": [
        "Thinly slice lamb and beef, then finely dice. Transfer to a bowl and add onion and cilantro.",
        "Grind cumin with mortar and pestle or in grinder and stir into meat mixture. Chill, covered,2 hours.",
        "Blend flour, salt, and eggs in a food processor until crumbly. With motor running, add water and blend until dough just begins to form a ball. Knead dough on a lightly floured surface until smooth and elastic, about 3 minutes. Wrap dough in wax paper and let stand at room temperature 30 minutes.",
        "Halve dough and rewrap 1 half. Roll out remaining half on a lightly floured surface with a lightly floured rolling pin into a 14-inch round, about 1/8 inch thick.",
        "Cut out rounds (about 16) with cutter and cover rounds with wax paper. Discard scraps. Stir salt and pepper into filling. Lay a clean kitchen towel on a work surface and dust with flour.",
        "Keeping remaining rounds covered, hold 1 round in palm of your hand and put a scant tablespoon of filling in center. Moisten edge of round with a finger dipped in water and fold round in half to form a half-moon, pinching edges together to seal. Put on flour-dusted towel. Repeat with rest of rounds, then with other half of dough.",
        "Cook dumplings in 2 batches in a large pot of boiling salted water, turning occasionally, until tender, about 15 minutes per batch. Transfer with a slotted spoon to plates and serve immediately."
    ],
    "ingredients": [
        "1 (1/4-lb) piece boneless lamb shoulder",
        "1 (1/4-lb) piece boneless chuck",
        "1 medium onion (6 oz), finely chopped",
        "1/4 cup finely chopped fresh cilantro",
        "1/2 teaspoon cumin seeds, toasted",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 cups all-purpose flour plus additional for dusting",
        "1/2 teaspoon salt",
        "2 large eggs",
        "1/4 cup plus 1 tablespoon water",
        "Special equipment: a mortar and pestle or an electric coffee/spice grinder; a 3-inch round cutter",
        "Accompaniments: melted butter; sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Beef",
        "Lamb",
        "Onion",
        "Appetizer",
        "Quick & Easy",
        "Spring",
        "Cilantro",
        "Boil",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Central Asian Beef and Lamb Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/central-asian-beef-and-lamb-dumplings-109193"
}
