{
    "directions": [
        "Bring 1 quart salted water to a boil and add 2 tablespoons of the lime juice. Scoop in the shrimp, cover and let the water return to the boil. Immediately remove from the heat, set the lid askew and pour off all the liquid. Replace the cover and let the shrimp steam off the heat for 10 minutes. Spread out the shrimp in a large glass or stainless steel bowl to cool completely. Peel and devein the shrimp if you wish: One by one lay the shrimp on your work surface, make a shallow incision down the back and scrape out the (usually) dark intestinal tract. Toss the shrimp with the remaining 1/2 lime juice, cover and refrigerate for about an hour.",
        "In a small strainer, rinse the onion under cold water, then shake off the excess liquid. Add to the shrimp bowl along with the cilantro, ketchup, hot sauce, optional olive oil, cucumber and/or jícama and avocado. Taste and season with salt, usually about 1/2 teaspoon. Cover and refrigerate if not serving immediately.",
        "Spoon the ceviche into sundae glasses, martini glasses, or small bowls: garnish with sprigs of cilantro and slices of lime. Serve with tostadas, tortilla chips or saltines to enjoy alongside.",
        "The ceviche is best made the day it is served. The flavorings can be added to the shrimp a few hours in advance."
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons fresh lime juice",
        "1 generous pound unpeeled smallish shrimp (I prefer the ones that are 41/50 count to a pound)",
        "1/2 medium white onion, chopped into 1/4 inch pieces",
        "1/3 cup chopped fresh cilantro, plus several sprigs for garnish",
        "N/A fresh cilantro sprigs",
        "1/2 cup ketchup",
        "1 to 2 tablespoons vinegary Mexican bottled hot sauce (such as Tamazula, Valentina or Búfalo, the latter being on the sweet side)",
        "About 2 tablespoons olive oil, preferably extra-virgin (optional, but recommended to smooth out sharpness)",
        "1 cup diced peeled cucumber or jícama (or 1/2 cup of each)",
        "1 small ripe avocado, peeled, pitted and cubed",
        "Salt",
        "Several lime slices for garnish",
        "Tostadas or tortilla chips, store-bought or homemade or saltine crackers for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Marinate",
        "Cinco de Mayo",
        "Lime",
        "Shrimp",
        "Avocado",
        "Cucumber",
        "Summer",
        "Chill",
        "Healthy",
        "Jícama",
        "Cilantro",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Ceviche de Camaron: Shrimp Ceviche \"Cocktail\"",
    "url": "http://www.epicurious.com/recipes/food/views/ceviche-de-camaron-shrimp-ceviche-cocktail-104995"
}
