{
    "directions": [
        "Combine first 7 ingredients in medium saucepan. Bring to boil. Remove from heat; cover and let steep 15 minutes to develop flavor.",
        "Preheat oven to 325°F. Place six 3/4-cup custard cups or ramekins in 13x9x2-inch metal baking pan. Pour cream mixture through fine strainer into medium bowl. Discard solids in strainer.",
        "Whisk egg yolks, brown sugar, and orange peel in 4-cup measuring cup to blend well. Gradually whisk in cream mixture. Pour custard into custard cups, dividing equally (cups will not be full). Pour enough hot water into baking pan to come halfway up sides of custard cups. Cover baking pan with foil. Pierce foil in several places with skewer to allow steam to escape.",
        "Bake custards until softly set (centers will move slightly when cups are shaken gently), about 30 minutes. Remove custards from water. Cool on rack. Chill until cold, about 4 hours. (Can be made 1 day ahead. Cover; keep chilled.)",
        "Beat whipping cream and sugar in medium bowl until soft peaks form. Place dollop of whipped cream atop each pot de crème and serve."
    ],
    "ingredients": [
        "1 cup whipping cream",
        "1 cup whole milk",
        "1 tablespoon loose English Breakfast tea or Jasmine tea",
        "1 cinnamon stick",
        "8 whole cardamom pods",
        "6 whole cloves",
        "3 1/4-inch-thick rounds of peeled fresh ginger",
        "4 large egg yolks",
        "1/2 cup (packed) golden brown sugar",
        "1/4 teaspoon grated orange peel",
        "1 cup chilled whipping cream",
        "2 teaspoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Spice",
        "Fall",
        "Winter",
        "Cinnamon",
        "Clove",
        "Ramekin",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chai Pots de Crème",
    "url": "http://www.epicurious.com/recipes/food/views/chai-pots-de-creme-106125"
}
