{
    "directions": [
        "Preheat oven to 350 degrees F. Lightly spray a 9-inch springform pan with cooking spray. Stir together graham crackers and brown sugar in a small bowl, then drizzle with oil and stir. Add just enough milk to make crumbs stick together. Press very firmly into bottom of pan. Bake 10 minutes. Keep oven at 350 degrees F.",
        "Meanwhile, blend cheesecake-batter ingredients in a blender until completely smooth and no bits of cashew remain, giving blender a rest every minute or so and scraping down sides with a rubber spatula. Batter should be completely smooth and not grainy: This takes about 1 minute with a high-powered blender (such as Vitamix) or about 5 minutes with a standard blender.",
        "Spray inside springform pan (above baked crust) with cooking spray. Pour in batter and jiggle to spread evenly over crust. Bake until top is lightly puffed and edges are golden, 45 to 50 minutes.",
        "Cool to room temperature on a rack, about 1 hour. Chill, covered, at least 3 hours or, even better, overnight.",
        "Slice cake with a thin, sharp knife dipped in water. Dollop each slice with whipped topping, dust with cinnamon, and sprinkle with candied ginger."
    ],
    "ingredients": [
        "1 1/2 cups crushed vegan graham crackers",
        "1/4 cup packed brown sugar",
        "3 tablespoons coconut oil, melted",
        "2 tablespoons non-dairy milk (such as rice, soy, or almond)",
        "Cheesecake:",
        "1 (12 ounce) package extra-firm silken tofu, drained",
        "1/2 cup raw cashews, soaked in water 1 to 2 hours, drained",
        "1/2 cup mashed ripe banana",
        "1/4 cup fresh lemon juice",
        "2 tablespoons coconut oil, room temperature",
        "2 teaspoons vanilla extract",
        "2/3 cup sugar",
        "4 teaspoons cornstarch",
        "2 teaspoons ground cardamom",
        "2 teaspoons ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cloves",
        "Topping:",
        "2 cups vegan whipped topping",
        "1/2 teaspoon ground cinnamon",
        "4 teaspoons finely chopped candied ginger"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chai Spice Cheesecake",
    "url": "http://allrecipes.com/recipe/256014/chai-spice-cheesecake/"
}
