{
    "directions": [
        "Heat oven to 350°F with rack in middle. Generously butter baking dish.",
        "Roast pecans in a pie or cake pan until fragrant and insides are pale golden, 8 to 10 minutes. Let cool, then coarsely chop.",
        "Divide bread between 2 large baking sheets and bake, switching position of sheets halfway through baking, until golden, 15 to 25 minutes.",
        "Meanwhile, heat oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then cook sausage, stirring and breaking up lumps, until browned, about 5 minutes. Transfer sausage to a very large bowl.",
        "Add butter to skillet and heat over medium heat until foam subsides. Add onions, celery, garlic, allspice, and 1/2 teaspoon each of salt and pepper, and cook, stirring occasionally, until beginning to brown lightly, 12 to 15 minutes. Add vegetables to sausage with bread, cherries, and pecans, and toss to mix well.",
        "In a medium bowl, whisk eggs, then whisk in stock, cream, and parsley, and pour over stuffing. Stir stuffing well, then spread it out in baking dish. Chill if turkey is more than 1 hour from being done.",
        "When turkey is done, increase oven temperature to 425°F. Cover stuffing tightly with foil and bake until hot throughout, 20 to 25 minutes. Remove foil and bake until top is golden brown and crisp, about 10 minutes more."
    ],
    "ingredients": [
        "1 cup (4 ounces) pecans",
        "1 (1-pound) challah loaf (or other egg bread), cut into 1-inch cubes (about 12 cups)",
        "1 tablespoon olive oil",
        "1 pound bulk sausage meat (usually sold in a tube)",
        "1 stick (1/2 cup) unsalted butter, cut into tablespoon pieces",
        "3 medium onions, chopped",
        "4 large celery ribs, chopped",
        "3 garlic cloves, minced",
        "1/2 teaspoon allspice",
        "Salt",
        "Freshly ground black pepper",
        "3/4 cup dried tart (Morello) cherries (4 ounces; see Cooks' note:s)",
        "4 large eggs",
        "1 1/2 cups turkey stock or reduced-sodium chicken broth",
        "1 cup heavy cream",
        "3/4 cup coarsely chopped flat-leaf parsley",
        "Special equipment: 3 1/2- to 4-quart shallow ceramic or glass baking dish (or two 2-quart shallow baking dishes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Cherry",
        "Sausage",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Challah, Sausage, and Dried Cherry Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/challah-sausage-and-dried-cherry-stuffing-51138030"
}
