{
    "directions": [
        "Whisk Champagne, sugar, yolks and corn syrup in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk constantly until mixture has tripled in volume and candy thermometer registers 160°F., about 10 minutes. Remove from over water. Using electric mixer, beat zabaglione until completely cool, about 5 minutes.",
        "Beat cream to soft peaks in medium bowl. Fold cream into cooled zabaglione. Chill until ready to use. (Can be prepared 1 day ahead. Cover and keep refrigerated. Stir lightly to lessen texture before serving.)",
        "Using small sharp knife, cut off peel and white pith from oranges. Working over bowl, cut between membranes to release orange segments. (Oranges can be prepared 6 hours ahead. Cover; refrigerate.)",
        "Using tip of vegetable peeler, cut out eyes from pineapple; discard eyes. Dice pineapple. Combine pineapple, quartered strawberries, kiwis and pear in large bowl. Mix in oranges.",
        "Spoon fruit into 6 stemmed glasses. Pour 1 tablespoon Champagne over fruit in each goblet. Top fruit with zabaglione. Garnish each serving with whole strawberry and serve immediately."
    ],
    "ingredients": [
        "1 cup dry Champagne or other sparkling wine",
        "3/4 cup powdered sugar",
        "5 large egg yolks",
        "2 tablespoons light corn syrup",
        "6 tablespoons chilled whipping cream",
        "2 large oranges",
        "1/2 small pineapple, peeled, cored",
        "1 basket strawberries, hulled, quartered",
        "2 kiwis, peeled, sliced into rounds",
        "1 pear, peeled, cored, diced",
        "6 tablespoons chilled dry Champagne",
        "6 whole strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Dessert",
        "Strawberry",
        "Orange",
        "Pear",
        "Kiwi",
        "Pineapple",
        "Sparkling Wine",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Champagne Zabaglione with Fresh Fruit Compote",
    "url": "http://www.epicurious.com/recipes/food/views/champagne-zabaglione-with-fresh-fruit-compote-1281"
}
