{
    "directions": [
        "Using a small, sharp knife, cut an X in the rounded side of each chestnut. In a small saucepan over high heat, bring 2 cups (16 fl oz/500 ml) water to a boil. Add the chestnuts. Reduce the heat to low, cover, and simmer until the nuts are tender, about 30 minutes. Drain the chestnuts and, while they are still hot, remove both the hard outer shell and the thin, brown inner skin.",
        "Using a small, sharp, knife, carefully trim away the roots from the onions without cutting into the ends. Cut a shallow cross into the stem end of each onion to prevent it from telescoping during cooking. In a saucepan over high heat, combine the onions with water to cover and bring to a boil. Reduce the heat to medium and simmer, uncovered, until barely tender, 8-10 minutes. Drain, let cool slightly, and then slip off the peels. Set aside. Preheat the oven to 350°F (180°C).",
        "If the mushrooms are small, leave them whole; if they are large, slice them thickly. In a large sauté pan over high heat, melt half of the butter. Add half of the mushrooms and sauté until softened, 3-5 minutes. Transfer to a bowl. Repeat with the remaining butter and mushrooms and add to the bowl.",
        "Add the cooked chestnuts and onions and the chopped thyme to the mushrooms. Pour in enough broth to moisten the mixture and season with salt and pepper. Transfer to a baking dish. Bake until heated through, about 15 minutes. Serve right away.",
        "The most common chanterelles are golden and trumpet shaped and have a subtle apricot taste. Other members of the chanterelle family include white, red, and yellow foot chanterelles and the black trumpet mushroom. At the market, select chanterelles with firm, fleshy caps and no sign of dampness."
    ],
    "ingredients": [
        "1 lb (500 g) chestnuts (see note, above)",
        "1 lb (500 g) pearl or cipollini onions",
        "2 lb (1 kg) chanterelle or cremini mushrooms",
        "1/2 cup (4 oz/125 g) unsalted butter",
        "2 tablespoons chopped fresh thyme",
        "1/2 cup (4 fl oz/125 ml) chicken broth, or as needed",
        "Salt and ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Side",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Chestnut",
        "Christmas Eve",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chanterelles with Chestnuts and Pearl Onions",
    "url": "http://www.epicurious.com/recipes/food/views/chanterelles-with-chestnuts-and-pearl-onions-363231"
}
