{
    "directions": [
        "Combine all ingredients in small bowl.",
        "Do ahead: Can be made 2 days ahead. Store airtight at room temperature.",
        "Combine first 8 ingredients in blender; blend until almost smooth. Add 1/4 of parsley, 1/4 of cilantro, and 1/4 of mint; blend until incorporated. Add remaining herbs in 3 more additions, pureeing until almost smooth after each addition.",
        "Do ahead: Can be made 3 hours ahead. Cover; chill.",
        "Let beef stand at room temperature 1 hour.",
        "Prepare barbecue (high heat). Pat beef dry with paper towels; brush with oil. Sprinkle all over with spice rub, using all of mixture (coating will be thick). Place beef on grill; sear 2 minutes on each side. Reduce heat to medium-high. Grill uncovered until instant-read thermometer inserted into thickest part of beef registers 130°F for medium-rare, moving beef to cooler part of grill as needed to prevent burning, and turning occasionally, about 40 minutes. Transfer to platter; cover loosely with foil and let rest 15 minutes. Thinly slice beef crosswise. Serve with chimichurri sauce.",
        "*Available at specialty foods stores and from tienda.com."
    ],
    "ingredients": [
        "2 tablespoons dark brown sugar",
        "1 tablespoon sweet smoked paprika*",
        "1 tablespoon coarse kosher salt",
        "1 1/2 teaspoons chipotle chile powder or ancho chile powder",
        "1 teaspoon ground black pepper",
        "3/4 cup olive oil",
        "3 tablespoons Sherry wine vinegar or red wine vinegar",
        "3 tablespoons fresh lemon juice",
        "3 garlic cloves, peeled",
        "2 medium shallots, peeled, quartered",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon dried crushed red pepper",
        "3 cups (packed) stemmed fresh parsley",
        "2 cups (packed) stemmed fresh cilantro",
        "1 cup (packed) stemmed fresh mint",
        "1 3 1/2-pound beef tenderloin",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Beef",
        "Garlic",
        "Mint",
        "Summer",
        "Grill/Barbecue",
        "Cilantro",
        "Parsley"
    ],
    "title": "Char-Grilled Beef Tenderloin with Three-Herb Chimichurri",
    "url": "http://www.epicurious.com/recipes/food/views/char-grilled-beef-tenderloin-with-three-herb-chimichurri-235342"
}
