{
    "directions": [
        "Combine the onion, celery, carrot, prosciutto, parsley, garlic and cayenne pepper in a pot with about 8 cups of water. Season the water with salt and boil for 5 minutes to allow the flavors to infuse. Add the octopus and reduce the heat to medium-low. Simmer gently for about 1 hour or until the octopus is tender when gently pierced with a knife. Cool the octopus in the braising liquid at room temperature until cool enough to handle.",
        "Remove the octopus from the braising liquid and drain well. Heat a cast-iron skillet or a flat griddle over high heat until it is very hot. Season the octopus with olive oil, salt and pepper. Grill the octopus until it is caramelized and crusted on all sides, about 3 to 5 minutes. Transfer the charred octopus to a cutting board and cut each tentacle on the bias into 4 slices.",
        "Place the octopus slices in the center of 4 plates and garnish with arugula and 3 to 4 slices of the peach. Drizzle 1 tablespoon of aged balsamic vinegar over and around the octopus, and finish each dish with a squeeze of lemon juice. Serve immediately."
    ],
    "ingredients": [
        "1/2 small onion, peeled and quartered",
        "1 small celery stalk, sliced on the bias",
        "1/2 small carrot, peeled and sliced on the bias",
        "1 3-ounce piece prosciutto",
        "2 fresh Italian parsley sprigs",
        "3 garlic cloves, cut in half",
        "1/2 teaspoon cayenne pepper",
        "8 cups water, approx.",
        "2 pounds octopus, head removed and tentacles separated",
        "2 tablespoons olive oil",
        "-fine sea salt and freshly ground black pepper",
        "1/2 cup baby arugula",
        "1 peach, halved, pitted, and thinly sliced",
        "4 tablespoons aged (at least 8 years) balsamic vinegar",
        "1 lemon, cut in half"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Vinegar",
        "Peach",
        "Octopus",
        "Arugula",
        "Summer",
        "Healthy",
        "Prosciutto",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Charred Octopus with Peach, Arugula and Aged Balsamic",
    "url": "http://www.epicurious.com/recipes/food/views/charred-octopus-with-peach-arugula-and-aged-balsamic-362230"
}
