{
    "directions": [
        "1. In a medium bowl, stir together the olives, herbs, onion, vinegar, and oil. Set aside.",
        "2. Spread the quinoa flour out on a large plate. Beat the egg white in a small bowl. Combine the quinoa with the oregano and red pepper flakes and spread it out on a second large plate. Coat each slice of feta with quinoa flour, dip it in the egg white, and then coat it in the quinoa mixture, pressing down to adhere. Add enough oil to a large skillet to reach 1/2 inch/1.25 centimeters up the sides of the skillet. Heat the oil over medium-high heat until shimmering. Cook the feta until the quinoa is crisp and the cheese looks melted, about 2 minutes per side. With tongs or a spatula, carefully transfer the feta onto a cutting board. Cut each slice crosswise into roughly 1 inch/2.5-centimeter pieces.",
        "3. Adjust an oven rack to the uppermost position and set the broiler to high (don't adjust the rack if you have a broiler drawer). Remove and discard any of the lettuce's outermost leaves that are damaged. Cut each head in half lengthwise. Line 2 rimmed baking sheets with foil. Arrange the lettuce halves, cut side up, on the baking sheets. Season them with salt and pepper and drizzle them with olive oil. Turn them cut side down.",
        "4. Broil one of the baking sheets of lettuce until it begins to char, 1 to 3 minutes. Remove it from the oven, turn the lettuce halves cut side up, and broil until charred, 1 to 3 minutes longer. Set the baking sheet on a cooling rack and repeat with the second tray.",
        "5. Divide the lettuce among 8 plates. Top each lettuce half with a 1/4 cup of quinoa, roasted tomatoes, and cucumber slices. Stir the vinaigrette to recombine it and spoon some over each salad. Top with the feta and serve with pepperoncini and lemon wedges."
    ],
    "ingredients": [
        "1/2 cup (2 ounces /60 grams) Kalamata olives, finely chopped",
        "1/2 cup parsley, dill, and mint, chopped",
        "1/4 cup red onion, finely chopped",
        "1/4 cup (2 ounces/60 milliliters) red wine vinegar",
        "6 tablespoons (3 ounces/90 milliliters) extra-virgin olive oil",
        "1/4 cup (1 ounce/30 grams) quinoa flour",
        "1 large egg white",
        "1 cup (6 ounces/180 grams) Basic Quinoa or Pilaf-Style Quinoa",
        "1 teaspoon dried oregano",
        "1 teaspoon red pepper flakes",
        "8 ounces/225 grams feta cheese, drained and cut into 3/4-inch/2-centimeter slices",
        "Vegetable oil for frying",
        "4 heads romaine lettuce, washed and dried",
        "Salt and freshly ground black pepper",
        "Extra-virgin olive oil",
        "2 cups (12 ounces/360 grams) Skillet-Toasted Quinoa or Pilaf-Style Quinoa, warmed",
        "1 1/4 cups Sweet and Tangy Roasted Tomatoes",
        "1 English cucumber, scrubbed, ends trimmed, and cut into 1/2-inch/1.25-centimeter half moons",
        "Pepperoncini",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Low Cal",
        "Wheat/Gluten-Free",
        "Dinner",
        "Lunch",
        "Salad Dressing",
        "Healthy",
        "Low Cholesterol",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Charred Romaine Greek Salad With Quinoa-Crusted Feta",
    "url": "http://www.epicurious.com/recipes/food/views/charred-romaine-greek-salad-with-quinoa-crusted-feta-56389585"
}
