{
    "directions": [
        "Preheat oven to 350°F. Brush eggplant on all sides with oil, season with salt and pepper, and roast, cut side down, on a rimmed baking sheet until lightly browned and softened, 30–40 minutes. Let cool.",
        "Meanwhile, heat a dry medium cast-iron skillet over high. Cook broccoli florets, tossing occasionally, until surfaces are blackened, 10–15 minutes. Transfer to a large plate; let cool.",
        "Toss chiles, sugar, and 1 tsp. salt in a small bowl. Let sit until juices release, 12–15 minutes. Add white wine vinegar.",
        "Meanwhile, toast coriander seeds in a dry small skillet, tossing often, until fragrant, about 4 minutes; let cool. Finely grind in a spice mill or with a mortar and pestle. Transfer to a small bowl and whisk in rice vinegar, 1/4 cup oil, 1 Tbsp. lemon juice, and 2 Tbsp. water; season vinaigrette with salt and pepper.",
        "Scoop eggplant flesh into a food processor; discard skin. Add malt vinegar, agave, tahini, and remaining 2 Tbsp. lemon juice. With motor running, stream in remaining 1/4 cup oil; process until smooth. Season eggplant purée with salt and pepper.",
        "Toss charred broccoli, broccoli stems, and vinaigrette in a large bowl. Serve over eggplant purée topped with cashews, cilantro, and drained chiles."
    ],
    "ingredients": [
        "1 medium eggplant, cut in half lengthwise",
        "1/2 cup olive oil, divided, plus more for brushing",
        "1 teaspoon kosher salt, plus more",
        "Freshly ground black pepper",
        "2 bunches broccoli, florets separated from stems, stems peeled and shaved lengthwise on a mandoline",
        "2 Fresno chiles, halved lengthwise, thinly sliced",
        "1 tablespoon sugar",
        "1/2 cup white wine vinegar",
        "2 tablespoons coriander seeds",
        "1/4 cup seasoned rice vinegar",
        "3 tablespoons fresh lemon juice, divided",
        "2 tablespoons malt vinegar",
        "1 tablespoon agave nectar",
        "1 tablespoon tahini",
        "1/2 cup unsalted, roasted cashews, chopped",
        "1/4 cup cilantro leaves with tender stems",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Broccoli",
        "Chile Pepper",
        "Cashew",
        "Salad",
        "Side",
        "Quick and Healthy",
        "High Fiber",
        "Low Fat",
        "Kid-Friendly",
        "Eggplant",
        "Vegetarian",
        "Vegan",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Charred Broccoli Salad with Eggplant Purée",
    "url": "http://www.epicurious.com/recipes/food/views/charred-broccoli-salad-with-eggplant-puree"
}
