{
    "directions": [
        "In a large mixing bowl, combine the sugar, fish sauce, honey, and pepper. Mix until the sugar has dissolved. Add the bashed spring onion, garlic, and sliced pork neck.",
        "Coat the pork well then enclose the flavors with the vegetable oil. Let the mixture marinate in the refrigerator for 2 hours or overnight, for a better result.",
        "Preheat a grill on medium to high heat. Thread the pork onto the skewers and char grill on medium to high heat for 1 to 2 minutes on each side, or until brown and cooked through.",
        "Divide the cooked vermicelli noodle among 4 to 6 bowls, add the mint, perilla leaves, Vietnamese mint, cucumber, and bean sprouts, then add 1 to 2 pork skewers to each bowl.",
        "Dress each bowl with 2 tablespoons of dipping fish sauce, a teaspoon of spring onion oil, and sprinkle fried Asian shallots and crushed peanuts on top.",
        "Combine the fish sauce, vinegar, sugar, and water in a saucepan and place on medium heat. Stir well and cook until just before boiling point is reached, then allow to cool. To serve, finely chop the garlic and chile and stir through with the lime juice."
    ],
    "ingredients": [
        "2 tablespoons sugar",
        "4 tablespoons fish sauce",
        "1 tablespoon honey",
        "1 teaspoon freshly ground black pepper",
        "6 spring onions (white part only), finely sliced, and pounded in mortar and pestle to a paste",
        "2 cloves garlic, finely diced",
        "18 ounces pork neck, finely sliced across the grain into 1/8-inch thick pieces",
        "2 tablespoons vegetable oil",
        "9 ounces cooked rice vermicelli noodle",
        "5 fresh mint leaves, sliced",
        "5 fresh perilla leaves, sliced",
        "5 fresh Vietnamese mint leaves, sliced",
        "1 Lebanese cucumber, halved and sliced",
        "2 handfuls bean sprouts",
        "4 tablespoons spring onion oil",
        "1/2 cup Dipping Fish Sauce, recipe follows",
        "4 tablespoons fried red Asian shallots (see Cook's Note)",
        "4 tablespoons crushed roasted peanuts",
        "3 tablespoons fish sauce",
        "3 tablespoons white vinegar",
        "2 tablespoons sugar",
        "4 ounces or 1/2 cup water",
        "2 cloves garlic",
        "1 chile, chopped",
        "2 tablespoons fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian",
        "Vietnamese Recipes",
        "Meat",
        "Pork",
        "Noodles"
    ],
    "title": "Char Grilled Pork Neck with Vermicelli Noodles: Bun Thit Nuong",
    "url": "http://www.foodnetwork.com/recipes/char-grilled-pork-neck-with-vermicelli-noodles-bun-thit-nuong-recipe"
}
