{
    "directions": [
        "Take your steaks out of the fridge 30 minutes before you want to start grilling, so they can come to room temperature. Prepare the charcoal grill to medium-high heat on one side of your grill, and medium-low heat on the other. You will need just a few briquettes on the cooler side of the grill to maintain the low heat. (If using a gas grill, heat one side of the grill to medium-high heat and the other to low.)",
        "When the grill is hot and ready to go, brush the grill grates with some olive oil. Season the steaks generously with salt and pepper. Place the steaks on the hot side of the grill for 3 to 4 minutes, then flip and grill for another 4 minutes. Once the steaks have a nice caramelized crust, move them to the cooler part of the grill, and continue cooking for 6 to 7 minutes for medium rare, or 8 to 9 minutes for medium. Remove the steaks from grill, and tent loosely with foil to keep warm. Let the steaks rest for 5 minutes, so the juices can redistribute throughout the meat. Spread steaks with the roasted shallot and herb butter.",
        "GINA: Roasting the shallot gives it a deep, sweet flavor, and the lemon zest lightens the whole thing up. This butter would also be an excellent topping for fish or chicken.",
        "Preheat the oven to 350 degrees F. Place the shallot on a square of foil, drizzle lightly with olive oil, and season with salt and pepper. Fold up the foil into a little packet, and place in the oven for 1 hour. Let cool completely. Pulse the roasted shallot and remaining ingredients in a food processor until combined but still coarse. Scrape the butter onto a piece of plastic wrap, spread it across lengthwise, and roll into a log. Twist the ends to seal. Place in the fridge to firm up for at least 35 minutes before serving."
    ],
    "ingredients": [
        "Olive oil",
        "Four 12-ounce rib-eye steaks, bone in, about 1 1/2 inch thick",
        "Kosher salt and freshly ground black pepper",
        "1 recipe roasted shallot and herb butter (recipe follows)",
        "1 medium shallot, peeled",
        "1 tablespoon olive oil",
        "Kosher salt and freshly ground black pepper",
        "1 stick salted butter, room temperature",
        "1 tablespoon finely chopped fresh parsley",
        "1 tablespoon finely chopped fresh basil",
        "1 tablespoon finely chopped fresh tarragon",
        "1 teaspoon grated lemon zest",
        "Pinch of crushed red-pepper flakes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Steak",
        "Grilling",
        "Steak",
        "Shallot Recipes",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Char-Grilled Rib Eye with Roasted Shallot and Herb Butter",
    "url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/char-grilled-rib-eye-with-roasted-shallot-and-herb-butter-recipe"
}
