{
    "directions": [
        "In medium saucepan, combine banana chunks and enough cold water to cover by 1/2 inch. Set over high heat, bring to boil, lower heat, and simmer 30 minutes.",
        "Place conch in colander and scald by pouring boiling water over. Drain and place in medium, nonreactive bowl. Immediately stir in remaining ingredients and refrigerate until ready to use. Allow to marinate at least 1 hour before serving.",
        "Cut squid tubes in half lengthwise to form 2 rectangles. Score inside of each lengthwise with sharp knife, making parallel shallow cuts close together. In medium, nonreactive bowl, combine squid, olive oil, chiles, and garlic and refrigerate until ready to use, at least 1 hour.",
        "Drain bananas and mash. In medium, nonreactive bowl, stir together bananas with remaining ingredients. Mix well, then refrigerate until ready to use, at least 1 hour.",
        "Preheat grill to high. Grill tomatoes until blistered and slightly charred, about 6 minutes. (Alternatively, broil approximately 15 minutes.) Cool, then remove blackened skin, cut tomatoes into quarters, and remove seeds.",
        "In blender or food processor, pur&eauce;e tomatoes, garlic, and chile. Stir in shado beni, onion, olive oil, salt, and pepper. Refrigerate until ready to use.",
        "Preheat grill to high. Remove squid from marinade and sprinkle with salt and pepper. Grill just until opaque, about 1 minute per side. (Alternatively, broil several minutes per side.)",
        "Divide mashed bananas among 8 plates; top each mound with 1/8 of conch. (Alternatively, use 4-inch ring mold to shape bananas and conch into neat circle on each plate. Remove mold.) Spoon 1/8 of tomato coulis around each mound, and top each with 4 to 5 pieces squid."
    ],
    "ingredients": [
        "2 small green bananas, peeled and cut into small chunks",
        "2 ounces frozen or fresh, cleaned conch, finely diced (about 1/2 cup) (see Tips, below)",
        "2 tablespoons diced red onion",
        "1/2 celery stalk, diced",
        "1/4 cup diced red bell pepper",
        "1/4 cup diced yellow bell pepper",
        "1/4 cup diced green bell pepper",
        "1 pimiento pepper, seeded and diced",
        "1/4 Scotch bonnet chile, seeded and minced (wear rubber gloves)",
        "1/2 scallion (green and white parts), finely chopped",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons fresh lime juice",
        "2 tablespoons extra virgin olive oil",
        "12 each squid tubes and tentacles",
        "1/4 cup olive oil",
        "2 dried red cayenne chiles, minced",
        "1/2 clove garlic, mashed to paste with mortar and pestle",
        "1/2 small red onion, diced (about 6 tablespoons)",
        "3 scallions (white and green parts), chopped",
        "2 cloves garlic, mashed to paste with mortar and pestle",
        "1/4 cup extra virgin olive oil",
        "1/4 cup fresh lime juice",
        "1/4 teaspoon salt",
        "Pinch freshly ground black pepper",
        "2 1/2 medium beefsteak tomatoes",
        "1 clove garlic, minced",
        "1/4 Scotch bonnet chile, seeded and minced (wear rubber gloves)",
        "1/2 teaspoon chopped fresh shado beni (See Tips, below)",
        "1 1/2 teaspoons diced onion",
        "1 1/2 teaspoons olive oil",
        "1/8 teaspoon salt",
        "Pinch freshly ground black pepper",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Tomato",
        "Breakfast",
        "Lime",
        "Fig",
        "Banana",
        "Squid",
        "Bell Pepper",
        "Hot Pepper",
        "Grill/Barbecue",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Charred Squid and Conch Buljol with \"Soused\" Green Figs and Tomato Chokha Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/charred-squid-and-conch-buljol-with-soused-green-figs-and-tomato-chokha-coulis-234500"
}
