{
    "directions": [
        "Season steak generously with kosher salt and black pepper on both sides. Sprinkle 1 tablespoon cornstarch lightly over both sides.",
        "Heat 2 tablespoons oil in a skillet over high heat. Sear steak halves until surface is browned and crusty, 3 to 4 minutes per side. Transfer steaks to a plate, reserving juices in the skillet. Let cool completely.",
        "Mix oyster sauce, sherry, soy sauce, and ketchup together in a bowl. Whisk in chicken broth and 1 1/2 teaspoon cornstarch.",
        "Place broccoli florets in a bowl. Drizzle 1 tablespoon oil and some of the reserved juices on top; toss to coat.",
        "Preheat oven to 500 degrees F (260 degrees C). Line a rimmed baking sheet with foil; spread broccoli florets on top, stem-side down.",
        "Roast broccoli florets in the preheated oven until charred, 10 to 12 minutes.",
        "Cut steak halves into 2 or 3 pieces with the grain. Slice each piece against the grain into 1/8-inch slices.",
        "Pour 2 teaspoons vegetable oil into the skillet used to brown the steak; heat over medium-high heat. Add 3 cloves minced garlic; let sizzle for just 30 seconds. Stir steak, broccoli, and oyster sauce mixture into the skillet. Cook and stir until steak is heated through, broccoli is barely tender, and sauce thickens slightly, 3 to 5 minutes."
    ],
    "ingredients": [
        "Beef:",
        "1 pound skirt steak, cut in half across the grain",
        "kosher salt and freshly ground black pepper to taste",
        "1 tablespoon cornstarch",
        "2 tablespoons vegetable oil",
        "Sauce:",
        "1/4 cup oyster sauce",
        "3 tablespoons dry sherry",
        "1 tablespoon soy sauce, or more to taste",
        "2 teaspoons ketchup",
        "1/2 cup chicken broth",
        "1 1/2 teaspoons cornstarch, or more to taste",
        "Final Assembly:",
        "1 pound bite-size broccoli florets",
        "1 tablespoon vegetable oil",
        "2 teaspoons vegetable oil",
        "3 cloves minced garlic",
        "1 pinch cayenne pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Charred Broccoli Beef",
    "url": "http://allrecipes.com/recipe/256889/charred-broccoli-beef/"
}
