{
    "directions": [
        "Using an electric mixer on high speed, beat goat cheese and salt in a small bowl until creamy; gradually beat in 1/2 cup water. Transfer to a shallow baking dish, cover, and freeze for at least 6 hours. DO AHEAD: Ice can be made 1 week ahead. Keep frozen.",
        "Cook pears in a dry cast-iron skillet over medium heat, turning occasionally, until well charred and just softened, 15-20 minutes. Let cool. Core, coarsely chop, and transfer to a food processor; purée until smooth. Transfer purée to a medium bowl and freeze until completely solid, at least 6 hours. DO AHEAD: Pear sorbet can be made 1 week ahead. Keep frozen.",
        "Preheat oven to 170°F. Toast juniper berries in a small, dry skillet over medium heat, stirring often, until fragrant, about 3 minutes. Let cool. Finely grind in spice mill.",
        "Using an electric mixer on medium speed, beat egg whites in a medium bowl until frothy. With motor running, gradually beat in powdered sugar. Increase speed to high; beat until stiff peaks form, 8-10 minutes. Fold in juniper. Spread meringue in a thin layer on a silicone baking mat or parchment paper-lined large baking sheet.",
        "Bake until meringue is completely hard and dry in the center, about 4 hours. Let cool, then break into large pieces. DO AHEAD: Meringue can be made 2 days ahead; store airtight at room temperature.",
        "Let pear sorbet sit at room temperature until soft enough to scoop, about 1 hour. Spoon sorbet onto plates and top with meringue pieces. Using a fork, scrape goat cheese until it forms powdery snow; sprinkle over meringue."
    ],
    "ingredients": [
        "4 ounces fresh goat cheese, crumbled",
        "1/2 teaspoon kosher salt",
        "4 large Bosc pears, unpeeled, halved",
        "4 juniper berries",
        "2 large egg whites",
        "1/3 cup powdered sugar",
        "Special equipment: A spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Freeze/Chill",
        "Vegetarian",
        "Feta",
        "Pear",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Charred Pear Sorbet with Goat Cheese \"Snow\"",
    "url": "http://www.epicurious.com/recipes/food/views/charred-pear-sorbet-with-goat-cheese-snow-51143880"
}
