{
    "directions": [
        "Preheat oven to 450°F. Place chicken in a large bowl and season with salt. Add garlic, 2 Tbsp. lemon juice, and 2 Tbsp. oil and toss to combine. Let sit at room temperature at least 30 minutes or cover and chill up to 12 hours. Remove chicken from marinade, draining off any excess; discard marinade. Set chicken aside.",
        "Prick sweet potato all over with a fork and roast on a small foil-lined rimmed baking sheet until tender, about 1 hour. Let sit until cool enough to handle.",
        "Once potato comes out of the oven, start cooking the chicken. Heat 1 Tbsp. oil in a large skillet, preferably cast iron, over medium-high. Cook chicken, skin side down, until skin is very brown (it should get very dark; as long as you don’t smell it outright burning it will be all the better with some char), about 5 minutes. Transfer to oven and roast, keeping skin side down, until cooked through, 18–22 minutes. About 1 minute before removing chicken from oven, toss rosemary sprigs into skillet. Place chicken, skin side up, on a plate along with rosemary sprigs. Set skillet over medium-high. Cook orange slices just until golden and slightly softened, about 30 seconds per side. Transfer to plate with chicken.",
        "Toss chickpeas, olives, and feta with remaining 2 Tbsp. oil and remaining 1 Tbsp. lemon juice in a large bowl; season chickpea salad with salt.",
        "Tear open sweet potato and arrange big sections of flesh on a large platter. Place chicken, along with any accumulated juices, around sweet potato, then top with orange slices, chickpea salad, and rosemary leaves. Squeeze orange wedges over everything when at the table."
    ],
    "ingredients": [
        "4 skin-on, bone-in chicken thighs",
        "Kosher salt",
        "4 garlic cloves, finely grated",
        "3 tablespoons fresh lemon juice, divided",
        "5 tablespoons olive oil, divided",
        "1 large or 2 medium sweet potatoes, scrubbed",
        "3 large sprigs rosemary",
        "1 blood orange, thinly sliced, plus wedges for squeezing",
        "1 (15-ounce) can chickpeas, rinsed",
        "1/2 cup Castelvetrano olives, pitted",
        "3 ounces feta, crumbled (about  1/2 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Sweet Potato/Yam",
        "Chickpea",
        "Feta",
        "Orange",
        "Healthy",
        "Rosemary",
        "Olive",
        "Lemon Juice",
        "Dinner",
        "Winter",
        "Wheat/Gluten-Free"
    ],
    "title": "Charred Chicken With Sweet Potatoes and Oranges",
    "url": "http://www.epicurious.com/recipes/food/views/charred-chicken-with-sweet-potatoes-and-oranges"
}
