{
    "directions": [
        "Combine garlic, jalapeno, cumin, cilantro, lime juice, sugar and oil in a mixing bowl. Whisk until well combined and transfer to a plastic gallon-size zip top bag, add flank steak and marinate under refrigeration for 1 to 4 hours.",
        "Assemble tomatoes, cheese and lettuce leaves on a platter.",
        "Preheat grill to medium-high heat and place 8-inch cast iron pan directly on the grill or over side burner set to medium-high heat.",
        "Remove steak from marinade, pat dry and season with salt and pepper as desired. Grill steak for 6 to 8 minutes per side or to desired doneness. Remove and allow steak to rest 5 minutes before slicing into 1/2-inch thick slices.",
        "Meanwhile, coat preheated cast iron pan with non-stick spray. Add corn, red onion and poblano peppers; saute for 6 to 8 minutes or until corn has nice char marks and peppers are tender crisp. At the same time, coat Mission(R) Soft Taco Flour Tortillas with non-stick spray and grill on each side no more than 30 seconds.",
        "Immediately place sliced steak on top of corn mixture in cast iron pan and serve sizzling hot."
    ],
    "ingredients": [
        "4 Mission® Soft Taco Flour Tortillas",
        "2 cloves garlic, minced",
        "1/2 jalapeno pepper, minced",
        "1/2 teaspoon ground cumin",
        "1/4 cup cilantro, chopped",
        "2 limes, juiced",
        "1 teaspoon sugar",
        "2 tablespoons olive oil",
        "1 (12 ounce) flank steak",
        "1/2 cup heirloom tomatoes, cut into large chunks",
        "1 tablespoon crumbled cotija cheese",
        "4 Bibb lettuce leaves",
        "Salt and pepper as needed",
        "1 cup corn, fresh cut from cob, or frozen sweet corn kernels",
        "1/2 cup red onion, diced",
        "1 poblano pepper, cut into strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Charred Corn and Heirloom Tomato Steak Fajitas from Mission®",
    "url": "http://allrecipes.com/recipe/237010/charred-corn-and-heirloom-tomato-stea/"
}
