{
    "directions": [
        "Mix shallot and lemon juice in a small bowl. Whisk egg yolk, garlic, kosher salt, cayenne, and 2 teaspoons water in a medium bowl. Whisking constantly, gradually drizzle in vegetable oil, drop by drop at first, until aioli is thickened and smooth. Gently mix in buttermilk, crème fraîche, and shallot mixture; season with kosher salt and black pepper.",
        "Prepare grill for medium-high heat.",
        "Toss half of snap peas with 1 tablespoon olive oil in a medium bowl; season with kosher salt and black pepper. Set a wire rack or grill basket on grill grate and grill peas on rack, turning occasionally, until lightly charred, about 4 minutes; return to bowl.",
        "Cut raw peas in half crosswise on a diagonal and toss with grilled peas along with remaining 1 tablespoon olive oil; season with black pepper. Spoon some aioli on a platter and top with snap peas, chiles, and sea salt. (Reserve remaining buttermilk aioli for another salad, or use it as a dip.)",
        "Do ahead: Buttermilk aioli can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 small shallot, finely chopped",
        "2 tablespoons fresh lemon juice",
        "1 large egg yolk",
        "1 garlic clove, finely grated",
        "1/4 teaspoon kosher salt, plus more",
        "Pinch of cayenne pepper",
        "1/2 cup vegetable oil",
        "2 tablespoons buttermilk",
        "2 tablespoons crème fraîche",
        "Freshly ground black pepper",
        "1 1/2 pound sugar snap peas, untrimmed, divided",
        "2 tablespoons olive oil, divided",
        "1 tablespoon thinly sliced drained oil-packed Calabrian chiles",
        "Flaky sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Sugar Snap Pea"
    ],
    "title": "Charred Sugar Snap Peas with Buttermilk Aioli",
    "url": "http://www.epicurious.com/recipes/food/views/charred-sugar-snap-peas-with-buttermilk-aioli-51241900"
}
