{
    "directions": [
        "Let the chateaubriand stand at room temperature for about 30 minutes before roasting.",
        "Preheat an oven to 450°F. Oil a flat roasting rack and place it in a roasting pan just large enough to hold the chateaubriand.",
        "Remove the silver skin and most of the surface fat from the chateaubriand. Using kitchen twine, tie at 2-inch intervals along the length of the meat.",
        "Break each dried mushroom into 2 or 3 pieces, and remove and discard the hard stems. In a spice grinder, combine the mushrooms and peppercorns and process until finely ground. Pour into a small bowl and add the salt, olive oil and the 1 Tbs. Marsala. Stir well to form a paste. If needed, add a little more Marsala to make the mixture stick together. Press the mushroom mixture evenly over the surface of the chateaubriand. Transfer to the prepared pan.",
        "Roast until an instant-read thermometer inserted into the center of the meat registers 125° to 130°F for rare to medium-rare, 30 to 35 minutes. If the mushroom crust seems to be overbrowning, place a small piece of aluminum foil over the top of the roast during the last few minutes of roasting time.",
        "Transfer the meat to a warmed platter and tent with foil. Let rest for 10 minutes.",
        "Meanwhile, make the sauce: In a fry pan over medium-high heat, melt the butter. When it begins to foam, add the fresh mushrooms and sauté until they release their liquid, 2 to 3 minutes. Reduce the heat to medium-low, add the green onions and cook for 2 minutes. Add the Marsala, demi-glace, salt and pepper and stir to combine. Cook for 2 minutes more to blend the flavors. When ready to serve, add any accumulated juices from the platter and the lemon juice and heat through gently.",
        "Transfer the chateaubriand to a carving board and remove the strings. Cut across the grain into slices 1/2 inch thick. Fan the slices on a warmed platter or warmed individual plates and drizzle with a few drops of truffle oil. Spoon the mushrooms and sauce alongside the meat and serve immediately. Serves 2.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Roasting",
        ", by Rick Rodgers, Melanie Barnard & Bob & Colleen Simmons (Oxmoor House, 2004)."
    ],
    "ingredients": [
        "1 chateaubriand, 1 to 1 1/4 lb.",
        "6 dried shiitake mushrooms, about 1/4 oz. total",
        "1/4 tsp. peppercorns",
        "1/4 tsp. kosher salt",
        "2 Tbs. extra-virgin olive oil",
        "1 Tbs. dry Marsala, or as needed",
        "2 Tbs. unsalted butter",
        "1/2 lb. fresh shiitake mushrooms, brushed  clean, stems removed and caps cut   into slices 1/4 inch thick (about 2 cups)",
        "3 or 4 green onions, white portion only,   thinly sliced",
        "1/4 cup dry Marsala",
        "2 tsp. beef demi-glace",
        "Kosher salt and freshly ground pepper, to taste",
        "1 tsp. fresh lemon juice",
        "White truffle oil for drizzling (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chateaubriand with Shiitake Mushroom Rub",
    "url": "http://www.williams-sonoma.com/recipe/chateaubriand-with-shiitake-mushroom-rub.html"
}
