{
    "directions": [
        "Melt butter in a large skillet over medium heat. Add chopped bacon and onions; cook and stir until the bacon is crisp and the onions are browned, 6 to 8 minutes. Remove bacon and onions to a small dish, reserving about 2 tablespoons of the bacon fat for frying the pierogi.",
        "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and mash until smooth. Allow to cool for 10 minutes. Season with salt, black pepper, and cayenne pepper. Stir in 1 egg and farmer's cheese. Cover and refrigerate until chilled, about 30 minutes.",
        "Beat 1 egg with 1 tablespoon water in a bowl for the egg wash.",
        "Place 2 to 3 wonton wrappers at a time on a lightly floured work surface. Brush the edges lightly with the egg wash. Place about 2 tablespoons of filling in the center of each wrapper. Fold each pierogi in half and lightly press the edges together to seal.",
        "Bring a pot of salted water to a boil and cook pierogi in the boiling water until they float, 2 to 3 minutes. Drain.",
        "Transfer pierogi to the skillet with reserved bacon drippings in batches and cook over medium heat until lightly browned, about 2 minutes per side. Transfer to a bowl, toss with the bacon and onions, and serve garnished with sour cream and chives."
    ],
    "ingredients": [
        "2 teaspoons butter",
        "4 slices bacon, chopped",
        "2 tablespoons bacon drippings",
        "1/2 yellow onion, diced",
        "5 medium Yukon Gold potatoes, peeled and halved",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper",
        "1 large egg",
        "1 1/2 cups farmer’s cheese, or any cheese blend",
        "1 large egg",
        "1 tablespoon water",
        "50 wonton wrappers, or as needed",
        "1 cup sour cream",
        "1/4 cup chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheater Pierogi",
    "url": "http://allrecipes.com/recipe/229273/cheater-pierogi/"
}
