{
    "directions": [
        "Preheat oven to 375°F.",
        "Bring water to a boil with butter and salt in a 3-quart heavy saucepan over high heat, then reduce heat to moderate. Add flour all at once and cook, stirring vigorously with a wooden spoon, until mixture pulls away from side of pan, about 2 minutes. Remove from heat and cool slightly, about 3 minutes, then add 4 eggs 1 at a time, beating well after each addition (batter will appear to separate but will then become smooth). Mixture should be glossy and just stiff enough to hold soft peaks and fall softly from a spoon. If batter is too stiff, beat remaining egg in a small bowl and add to batter 1 teaspoon at a time, beating and then testing batter until it reaches proper consistency. Stir in cheese and dill.",
        "Line 2 large baking sheets with parchment or lightly butter sheets. Fill pastry bag with batter and pipe 15 (1-inch-diameter) mounds (or spoon level tablespoons) 1 inch apart onto each sheet. Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until puffed, golden, and crisp, about 30 minutes total. Make more puffs in same manner. Serve warm."
    ],
    "ingredients": [
        "1 cup water",
        "1 stick (1/2 cup) unsalted butter, cut into tablespoon pieces",
        "1/2 teaspoon salt",
        "1 cup all-purpose flour",
        "4 to 5 large eggs",
        "6 oz extra-sharp Cheddar (preferably yellow), finely grated (1 1/2 cups)",
        "2 tablespoons finely chopped fresh dill",
        "Special equipment: parchment paper (optional); a pastry bag fitted with 1/2-inch plain tip (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Herb",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Quick & Easy",
        "Summer",
        "Gourmet"
    ],
    "title": "Cheddar Dill Puffs",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-dill-puffs-108377"
}
