{
    "directions": [
        "Preheat oven to 425°F.",
        "Stir together sour cream and water until smooth. Sift together flour, baking powder, baking soda, and salt into a bowl, then blend in butter with your fingertips or a pastry blender until there are no longer any lumps. Add Cheddar and toss, then stir in thinned sour cream with a fork until just combined.",
        "Drop dough in 6 evenly spaced mounds on a buttered baking sheet and bake in middle of oven until pale golden and cooked through, 15 to 20 minutes. Transfer biscuits to a rack to cool slightly.",
        "Peel potatoes and cut into 1/3-inch dice. Cook in a pot of boiling salted water until just tender, 8 to 10 minutes, then drain in a colander.",
        "While potatoes are boiling, cook onions in butter in a deep 12-inch nonstick skillet over moderate heat, stirring occasionally, until softened and beginning to brown, about 5 minutes. Add bell peppers and cook, stirring, until crisp-tender, about 5 minutes.",
        "Add corned beef, potatoes, salt, and pepper and cook over high heat, stirring occasionally, until hash is browned and crisp, about 15 minutes. Stir in parsley.",
        "Split biscuits and spoon hash and salsa onto bottom halves. Put tops on biscuits."
    ],
    "ingredients": [
        "1 cup sour cream",
        "3/4 cup water",
        "3 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 1/2 teaspoons salt",
        "3 tablespoons cold unsalted butter, cut into bits",
        "6 oz sharp Cheddar, coarsely grated (1 1/2 cups)",
        "2 lb yellow-fleshed potatoes such as Yukon Gold",
        "2 onions, coarsely chopped",
        "3/4 stick (6 tablespoons) unsalted butter",
        "2 red bell peppers, coarsely chopped",
        "1 lb (1/8-inch-thick) slices cooked corned beef, cut crosswise into 1/8-inch-wide strips",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 cup minced fresh flat-leaf parsley",
        "Accompaniment:tomatillo salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Beef",
        "Cheese",
        "Potato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Sauté",
        "St. Patrick's Day",
        "New Year's Day",
        "Cheddar",
        "Winter",
        "Pastry",
        "Gourmet"
    ],
    "title": "Cheddar Shortcakes with Corned Beef Hash",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-shortcakes-with-corned-beef-hash-106159"
}
