{
    "directions": [
        "Prepare a medium-hot fire in a grill.",
        "To make the fries, put the potatoes in a bowl, add water to cover and let soak for 30 minutes.",
        "Preheat a Philips air fryer to 360°F (182°C).",
        "Drain the potatoes and rinse well. Place on a towel-lined baking sheet and pat dry, removing as much moisture as possible. Transfer to a bowl, add the oil and toss to coat.",
        "Place the potatoes in the fry basket and insert into the air fryer. Cook for 5 minutes, then increase the temperature to 390°F (199°C). Pull out the basket and, using tongs, toss and stir the potatoes. Return the basket to the fryer. Continue cooking until the potatoes are cooked through and golden brown on the outside, about 15 minutes more, opening the basket 2 or 3 times during cooking to toss and stir them.",
        "While the fries are cooking, make the burgers. Divide the ground beef into eight 3-oz. (90-g) portions and shape each into a ball. Using a stuffed hamburger press according to the manufacturer’s instructions, make 4 burgers, stuffing each with a quarter of the cheese. Season the burgers with salt and pepper.",
        "Grill the burgers, turning once, until medium-rare, about 4 minutes per side, or until cooked to your preferred doneness. Grill the buns, cut side down, until lightly toasted, 1 to 2 minutes. Spread the cut sides of the buns with the burger sauce, then place the burgers on the buns along with the lettuce and onion.",
        "Transfer the potatoes to a bowl, sprinkle with French fry seasoning and toss to coat evenly. Serve the burgers with the fries alongside. Serves 2.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1 large russet potato, peeled and cut into 3/8-by-3/8-inch (1-by-1-cm) batons",
        "1 1/2 tsp. canola oil",
        "Chili French Fry Seasoning, to taste",
        "3/4 lb. (375 g) ground beef",
        "2 oz. (60 g) sharp cheddar cheese, grated",
        "Kosher salt and freshly ground pepper",
        "2 hamburger buns",
        "Chipotle Burger Bomb Sauce for serving",
        "Butter lettuce leaves for serving",
        "Sliced red onion for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Cheddar-Stuffed Burgers with Air-Fried French Fries",
    "url": "http://www.williams-sonoma.com/recipe/cheddar-stuffed-burgers-with-air-fried-french-fries.html"
}
