{
    "directions": [
        "Cook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble the bacon and set aside.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Cover and bring the water to a boil. Add the asparagus, cover, and steam until bright green but still crunchy, about 5 minutes. Remove asparagus and set aside.",
        "In a large bowl, whisk together eggs, milk, dry mustard, salt, and pepper until smooth and well combined.",
        "Grease a 9x13-inch baking dish. Layer the bread slices into the bottom of the dish, cutting and fitting extra slices as needed to fill spaces. Sprinkle 1 cup of Cheddar cheese over the bread, followed by the diced onion. Arrange asparagus spears and red bell pepper in a layer over the onion. Sprinkle crumbled bacon over the red bell pepper; top with another layer of bread slices, cutting and filling in spaces as before. Pour the egg-milk mixture evenly over the casserole, and refrigerate overnight.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake the casserole for 50 minutes; sprinkle 1 cup shredded Cheddar cheese over the top of the casserole, return to the oven, and bake until the cheese is melted and bubbling and a knife inserted into the center of the casserole comes out clean, 10 to 15 more minutes."
    ],
    "ingredients": [
        "1 pound bacon",
        "1 pound fresh asparagus, trimmed",
        "8 eggs",
        "2 cups milk",
        "1/4 teaspoon dry mustard powder",
        "1/2 teaspoon salt",
        "1/8 teaspoon pepper",
        "1 (1 pound) loaf sliced bread, crusts removed",
        "1 cup shredded Cheddar cheese",
        "1/4 cup diced onion",
        "1/2 red bell pepper, diced",
        "1 cup shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheddar-Bacon-Asparagus Strata",
    "url": "http://allrecipes.com/recipe/213643/cheddar-bacon-asparagus-strata/"
}
