{
    "directions": [
        "Prepare barbecue (medium-high heat): Arrange onion rounds on baking sheet. Brush with oil; sprinkle with 3/4 teaspoon coarse salt and pepper. Transfer onion rounds (still intact) to grill rack; close cover. Cook until grill marks appear, about 4 minutes per side. Reduce heat or move onions to cooler part of grill. Close cover; cook until onions are tender, about 10 minutes. Transfer to medium bowl. Toss with vinegar. DO AHEAD: Can be made 3 days ahead. Cover; chill.",
        "Mix ketchup, chiles, adobo sauce, and 2 teaspoons vinegar in small bowl. Season with salt and more vinegar, if desired. do a h e a d Can be made 3 days ahead. Cover and chill.",
        "Shape beef into six 1/2-inch thick patties. Sprinkle patties on both sides with coarse salt and pepper. Prepare barbecue (medium-high heat). Place burgers on grill. Close cover; cook burgers until bottoms start to darken and juices rise to surface, about 3 minutes. Turn burgers; cook to desired doneness, about 3 minutes longer for medium-rare. Top with onions and cheese. Close cover; cook until cheese melts. Place muffin bottoms on plates; spread with ketchup. Top with burgers, tomatoes, if desired, spinach, and muffin tops. Serve, passing remaining ketchup separately.",
        "*Dried, smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "1 pound red onions, cut crosswise into 1/3- to 1/2-inch-thick rounds",
        "Olive oil",
        "3/4 teaspoon coarse kosher salt",
        "1/2 teaspoon coarsely ground black pepper",
        "2 tablespoons balsamic vinegar",
        "1 cup ketchup",
        "1 1/2 teaspoons chopped chipotle chiles from canned chipotles in adobo* plus 2 tablespoons adobo sauce from can",
        "2 teaspoons (or more) balsamic vinegar",
        "2 1/4 pounds ground beef (15% to 20% fat)",
        "Coarse kosher salt",
        "6 thick slices sharp cheddar cheese",
        "6 large English muffins or hamburger buns, split, cut sides grilled",
        "6 tomato slices (optional)",
        "2 cups fresh spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Fourth of July",
        "Backyard BBQ",
        "Vinegar",
        "Cheddar",
        "Ground Beef",
        "Hot Pepper",
        "Summer",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Cheddar Burgers with Balsamic Onions and Chipotle Ketchup",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-burgers-with-balsamic-onions-and-chipotle-ketchup-242711"
}
