{
    "directions": [
        "Sprinkle the yeast over 3 cups of warm water in a small bowl and stir in the sugar. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam.",
        "Combine 4 cups of flour and the salt in a large bowl. Stir in the yeast to form a soft dough. Set aside for 15 minutes to let the flour absorb the liquid. Add the flour 1 cup at a time, mixing until until the dough is very smooth. (If the dough is too stiff to mix by hand, turn it out onto a lightly floured surface and knead in the remaining flour.) Let the dough rest for an additional 15 minutes.",
        "Seed the chiles, if desired, and puree the chipotle peppers in adobo. Cut the softened cream cheese into cubes. Knead the chipotle puree, cubed cream cheese, Cheddar cheese, and the grated Parmesan cheese into the dough until fully incorporated.",
        "Place the dough in an oiled bowl and turn to coat. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 40 minutes. Punch the dough down and knead it a few times. Cover and let rise again until doubled, about 30 minutes.",
        "Place a pizza stone in the oven on a middle rack. Preheat the oven to 450 degrees F (230 degrees C). Lightly dust a pizza peel or the back of a baking tray with cornmeal.",
        "Use a serrated knife to divide the dough into four equal pieces. Shape the loaves into round balls, and place the balls on the cornmeal-dusted peel. Cover with a damp cloth and let rise for 10-20 minutes.",
        "Slide the loaves off the peel or baking sheet onto the hot baking stone and bake until the bread is golden and the loaves sound hollow when tapped on the bottom, about 20 to 30 minutes."
    ],
    "ingredients": [
        "1 tablespoon active dry yeast",
        "3 cups warm water",
        "1 teaspoon white sugar",
        "9 cups all-purpose flour",
        "1 tablespoon salt",
        "1/2 (7 ounce) can chipotle peppers in adobo sauce",
        "1 (8 ounce) package cream cheese, softened",
        "1 pound Cheddar cheese, cubed",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup cornmeal for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheddar Chipotle Bread on a Pizza Stone",
    "url": "http://allrecipes.com/recipe/157365/cheddar-chipotle-bread-on-a-pizza-sto/"
}
