{
    "directions": [
        "Into a bowl sift together the flour, the baking powder, and a pinch of salt, add the butter, and blend the mixture until it resembles coarse meal. Stir in the Cheddar and add the milk, stirring, to form a soft sticky dough. On a floured surface pat the dough out into a 6-inch square and cut out 4 rounds with a 2 3/4-inch round cutter dipped in flour. Put 2 of the rounds on top of the remaining 2 rounds, press them together gently, and bake the biscuits on a buttered baking sheet in the middle of a preheated 425°F. oven for 15 minutes, or until they are pale golden (Makes 2 large biscuits).",
        "While the biscuits are baking, in a large skillet heat the butter over moderate heat, swirling the skillet, until it just begins to turn golden brown, slide the eggs carefully into the skillet, and cook them, basting them with the butter, until the yolks are just set and the whites are slightly crisp around the edges. Halve the biscuits horizontally, arrange a ham slice, folding it, on each lower half, and top it with an egg. Drizzle the butter over the eggs, sprinkle the eggs with the scallion, and top them with the upper biscuit halves. Serve the sandwiches hot."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1 tablespoon cold unsalted butter, cut into bits",
        "2/3 cup grated sharp Cheddar",
        "2 tablespoons milk",
        "1 tablespoon unsalted butter",
        "2 large eggs",
        "2 slices of imported ham",
        "sliced scallion for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Breakfast",
        "Bake",
        "Quick & Easy",
        "Cheddar",
        "Ham",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Cheddar Biscuits with Fried Eggs, Ham, and Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-biscuits-with-fried-eggs-ham-and-brown-butter-10554"
}
