{
    "directions": [
        "Position rack just above center of oven and preheat to 425°F. Line heavy large baking sheet with parchment paper. Cook bacon in heavy large skillet over medium heat until crisp and brown. Transfer bacon to paper towels to drain, then chop coarsely.",
        "Combine flour, baking powder, baking soda, and salt in processor; blend 5 seconds. Add butter cubes. Blend until coarse meal forms, about 30 seconds. Transfer flour mixture to large bowl. Add cheddar cheese, fresh chives, and chopped bacon; toss to blend. Gradually add buttermilk, stirring to moisten evenly (batter will feel sticky).",
        "Using lightly floured hands, drop generous 1/2 cup batter for each biscuit onto prepared baking sheet, spacing batter mounds about 2 inches apart.",
        "Bake biscuits until golden and tester inserted into center comes out clean, 18 to 20 minutes. Brush biscuits lightly with melted butter. Let cool 10 minutes. Serve biscuits warm or at room temperature with honey, if desired."
    ],
    "ingredients": [
        "6 thick-cut bacon slices",
        "3 3/4 cups bread flour",
        "1 1/2 tablespoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 1/4 teaspoons salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes, plus melted butter for brushing",
        "2 1/2 cups (packed) coarsely grated sharp cheddar cheese (about 12 ounces)",
        "1/3 cup chopped fresh chives",
        "1 3/4 cups chilled buttermilk",
        "Honey (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Food Processor",
        "Brunch",
        "Side",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Father's Day",
        "Cheddar",
        "Bacon",
        "Chive",
        "Butter",
        "Buttermilk",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cheddar, Bacon, and Fresh Chive Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-bacon-and-fresh-chive-biscuits-357231"
}
