{
    "directions": [
        "Stir together yeast and 1 tablespoon warm water in a small bowl; let mixture stand until foamy, about 5 minutes. (If it doesn't foam, discard and start over with new yeast.)",
        "Mix together flour, salt, oil, yeast mixture, and remaining 1 3/4 cups warm water in bowl of mixer at low speed until a soft dough forms. Increase speed to medium-high and beat 3 minutes more. Add jalapeño, 1 1/2 cups Cheddar, and 1/2 cup Parmigiano-Reggiano and mix until combined.",
        "Scrape dough down side of bowl (all around) into center, then sprinkle lightly with flour. Cover bowl with a clean kitchen towel (not terry cloth) to keep a crust from forming and let dough rise in a draft-free place at warm room temperature until doubled in bulk, 2 to 2 1/2 hours. (Alternatively,let dough rise in bowl in refrigerator 8 to 12 hours.)",
        "Turn dough out onto a well-floured surface and gently form into a roughly 11- by 8-inch rectangle with floured hands.",
        "Fold dough in thirds (like a letter) with floured hands (dough will be sticky), pressing along seam of each fold to seal.",
        "Put dough, seam side down, in an oiled 9- by 5-inch loaf pan. Cover pan with same clean kitchen towel and let dough rise in a draft-free place at warm room temperature until dough completely fills pan and rises above it slightly, 1 to 1 1/4 hours.",
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Brush loaf with egg, then sprinkle remaining 2 tablespoons Cheddar and remaining 1/4 cup Parmigiano-Reggiano down center of loaf.",
        "Bake until bread is golden and sounds hollow when tapped on bottom, 50 minutes to 1 hour. Run a knife around edge of pan to loosen loaf, then remove from pan to test for doneness.",
        "Return bread (not in pan) to oven and turn on its side, then bake 10 minutes more to crisp crust. Cool completely on a rack, about 1 1/2 hours."
    ],
    "ingredients": [
        "1 teaspoon active dry yeast (less than a 1/4-ounce package)",
        "1 3/4 cups plus 1 tablespoon warm water (105-115°F)",
        "4 cups all-purpose flour plus additional for dusting",
        "1 1/2 teaspoons salt",
        "1/4 cup olive oil",
        "3 tablespoons chopped fresh jalapeño, including seeds and ribs, plus 2 tablespoons chopped fresh jalapeño, without seeds and ribs (from 3 medium total)",
        "5 ounces coarsely grated extra-sharp Cheddar (1 1/2 cups plus 2 tablespoons)",
        "1 1/2 ounces finely grated Parmigiano-Reggiano (3/4 cup)",
        "1 large egg, beaten with a pinch of salt",
        "Special equipment: a stand mixer fitted with paddle attachment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Cheese",
        "Dairy",
        "Egg",
        "Pepper",
        "Side",
        "Bake",
        "Cheddar",
        "Jalapeño",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly"
    ],
    "title": "Cheddar Jalapeño Bread",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-jalapeno-bread-237667"
}
