{
    "directions": [
        "Blend together flour, butter, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps.",
        "Drizzle evenly with 8 tablespoons (1/2 cup) ice water and gently stir with a fork (or pulse in processor) until incorporated.",
        "Squeeze a small handful: If it doesn't hold together, add more ice water, 1 tablespoon at a time, stirring (or pulsing) until incorporated, then test again. (Do not overwork mixture, or pastry will be tough.)",
        "Turn out mixture onto a work surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute butter. Gather dough together with scraper and press into 2 balls, one slightly bigger than the other, then flatten into disks. Chill each disk, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Peel potato and cut into 1/4-inch dice (3/4 cup). Steam potato in a steamer set over boiling water, covered, until just cooked through, about 3 minutes. Transfer to a plate to cool.",
        "Cook onion in butter in a 10-inch heavy skillet over moderately low heat, stirring, until softened, 8 to 10 minutes. Transfer to plate to cool.",
        "Whisk together 2 eggs, cream, thyme, salt, and pepper in a large bowl until combined well. Stir in potato, onion, and cheese.",
        "Whisk remaining egg in a small bowl and reserve for egg glaze.",
        "Put oven rack in middle position and put a large baking sheet on it, then preheat oven to 425°F.",
        "Roll out larger piece of dough into a 13-inch round on a lightly floured surface with a lightly floured rolling pin and fit into tart pan. Spoon filling evenly into pie shell and brush some of egg glaze on rim of shell.",
        "Roll out smaller piece of dough into a 12-inch round in same manner, then cover pie with it. Trim edges of pie, leaving a 1/2-inch overhang, then press edges together and crimp decoratively.",
        "Brush top of pie lightly with some of remaining egg glaze. Cut several steam vents in top crust with a small sharp knife.",
        "Bake pie on hot baking sheet until golden brown, 35 to 40 minutes. Cool on a rack at least 15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 cups unbleached all-purpose flour",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "1/2 teaspoon fine sea salt",
        "8 to 10 tablespoons ice water",
        "1 medium boiling potato (5 oz)",
        "2 cups finely chopped onion (1 large)",
        "2 tablespoons unsalted butter",
        "3 large eggs",
        "1/4 cup heavy cream",
        "1 teaspoon finely chopped fresh thyme or 1/2 cup finely chopped fresh parsley",
        "1/4 teaspoon fine sea salt",
        "1/4 teaspoon black pepper",
        "9 oz good-quality white Cheddar, coarsely grated (2 1/2 cups)",
        "Special equipment: a pastry or bench scraper; a 9-inch tart pan or pie plate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Onion",
        "Potato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cheddar Cheese and Onion Pie",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-cheese-and-onion-pie-231167"
}
