{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "In a medium ovenproof pot, heat the olive oil over medium heat. Add the chopped onion and cook until translucent, about 3-5 minutes. Add garlic and Italian seasoning and cook until fragrant, about 1 minute. Pour in the can of tomatoes. Add about 1 cup of water to the pot. Bring the soup to a simmer and then immediately turn the heat down to low. Cook the soup, uncovered, for about 10-15 minutes, until slightly thickened and very fragrant.",
        "Transfer the soup, in batches if necessary, to a blender and pulse until very smooth, allowing steam to escape while you process (or use an immersion blender and blend the soup in the pot). Return the pureed soup to the pot. Add salt. Mix in additional water, as needed, if the soup is too thick. Set aside.",
        "For the Dumplings: In a medium bowl, mix together the flour, baking powder, salt and black pepper. Add cheese and mix until evenly distributed. Pour in the buttermilk and mix until the dough is combined and wet. Using a tablespoon or ice cream scoop, drop balls of dough into the soup.",
        "Cover the pot with Reynolds Wrap(R) Aluminum Foil and transfer to the oven. Bake for 20-25 minutes, until the dumplings are cooked and fluffy.",
        "Garnish each soup bowl pepper and a sprinkling of parsley."
    ],
    "ingredients": [
        "Soup:",
        "1 tablespoon olive oil",
        "1/2 yellow onion, roughly chopped",
        "2 cloves garlic, minced",
        "1 teaspoon dried Italian seasoning",
        "1 (28 ounce) can crushed tomatoes",
        "2 cups water, divided",
        "2 teaspoons salt",
        "Dumplings:",
        "3/4 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly cracked black pepper, plus more to taste",
        "1/4 cup shredded sharp Cheddar cheese",
        "1/2 cup buttermilk, shaken",
        "2 tablespoons chopped fresh Italian parsley",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheddar Dumpling Tomato Soup",
    "url": "http://allrecipes.com/recipe/245460/cheddar-dumpling-tomato-soup/"
}
