{
    "directions": [
        "Position rack in center of oven and preheat to 450°F. Mix flour, baking powder, sugar, mustard and salt in large bowel to blend. Add butter and shortening; rub with fingertips until mixture resembles coarse meal. Whisk milk, chives, and dill in medium bowl. Pour into dry ingredients; stir until moist dough forms. Mix in 2 cups cheese.",
        "Turn dough out onto floured surface; knead lightly to distribute cheese evenly. Roll out dough to generous 1/2-inch thickness. Using floured 2 1/2 inch cookie cutter, cut into biscuits. Gather scraps; roll out to generous 1/2-inch thickness and cut out additional biscuits.",
        "Transfer biscuits to heavy large ungreased baking sheet. Top with 1/2 cup cheese. Bake until biscuits are golden, about 15 minutes. Transfer to platter. Serve warm or at room temperature. (Can be made 6 hours ahead. Let stand at room temperature. If desired, wrap biscuits in foil and rewarm in 350°F. oven for 5 minutes.)"
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "4 1/2 teaspoons baking powder",
        "1 tablespoon sugar",
        "1 1/2 teaspoons dry mustard",
        "1 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces",
        "1/4 cup chilled vegetable shortening, cut into pieces",
        "1 cup plus 2 tablespoons milk",
        "1/4 cup chopped fresh chives or green onions",
        "3 tablespoons (packed) chopped fresh dill or 1 tablespoon dried dillweed",
        "2 1/2 cups lightly packed grated extra-sharp cheddar cheese (about 8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Breakfast",
        "Brunch",
        "Side",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Chive",
        "Dill",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheddar Cheese Biscuits with Dill and Chives",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-cheese-biscuits-with-dill-and-chives-831"
}
