{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Blend Cheddar, flour, and cayenne in a food processor until combined well. Add butter and blend until dough starts to clump, about 30 seconds. Turn out onto work surface and gently knead until combined well. Using palms of your hands, roll dough into a 3/4-inch-thick rope (about 20 inches long). Cut rope into 24 equal pieces and press each piece onto bottom and halfway up side of a muffin cup.",
        "Bake until golden and slightly puffed in centers, about 10 minutes. Cool in pan on a rack 10 minutes, then invert onto rack to cool completely. Leave oven on.",
        "Toss grapes with salt, pepper, and 1 teaspoon oil in a bowl, then roast on a foil-lined baking sheet until shriveled, about 25 minutes. Cool to room temperature on sheet on a rack.",
        "Toss together grapes, olives, celery, onion, jalapeño, garlic, zest, vinegar, pine nuts, and remaining 2 tablespoons oil. Spoon relish onto cheese crisps and serve immediately."
    ],
    "ingredients": [
        "1 cup coarsely grated extra-sharp Cheddar (preferably white)",
        "1/2 cup all-purpose flour",
        "1/8 teaspoon cayenne",
        "2 tablespoons unsalted butter, softened",
        "1 lb seedless red grapes, stemmed and halved lengthwise (3 cups)",
        "1/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "2 tablespoons plus 1 teaspoon olive oil",
        "1/2 cup finely chopped pitted green olives (2 1/2 oz)",
        "1/4 cup finely chopped celery",
        "1/4 cup finely chopped red onion",
        "1/2 teaspoon finely chopped fresh jalapeño chile",
        "1/2 teaspoon minced garlic",
        "1/2 teaspoon finely grated fresh orange zest",
        "1 tablespoon red wine vinegar",
        "1/3 cup pine nuts (1 3/4 oz), toasted",
        "Special equipment: a nonstick mini muffin tin with 24 (1/8-cup) cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Olive",
        "Onion",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Cheddar",
        "Pine Nut",
        "Celery",
        "Fall",
        "Jalapeño",
        "Grape",
        "Gourmet"
    ],
    "title": "Cheddar Crisps with Roasted Grape Relish",
    "url": "http://www.epicurious.com/recipes/food/views/cheddar-crisps-with-roasted-grape-relish-232777"
}
