{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Cook bacon (in batches, if necessary) in a 12-inch ovenproof nonstick skillet over medium heat, turning, until crisp, about 8 minutes. Transfer bacon to paper towels to drain. Remove skillet from heat and pour off all but 1 tablespoon bacon fat.",
        "Bring a saucepan of salted water to a boil. Break each ramen noodle block into 4 pieces and cook, stirring occasionally, until just tender, about 3 minutes. Drain noodles in a colander and rinse under cold water.",
        "Heat bacon fat in skillet over medium-high heat until shimmering. Add noodles, spreading them evenly to cover bottom of skillet. Cook noodles, pressing on them occasionally with a slotted spatula, until underside is golden brown, 3 to 6 minutes. Slide ramen cake onto a large plate, invert a second plate over top, then flip cake over (so cooked side is now on top). Add 1 tablespoon oil to skillet. Slide ramen cake back into skillet and cook over medium-high heat, pressing it occasionally, until underside is golden brown, 3 to 5 minutes. Remove skillet from heat.",
        "Sprinkle cheese evenly over ramen cake and transfer skillet to oven. Bake until cheese is melted, 5 to 10 minutes. Slide ramen cake onto a cutting board and cut into 4 wedges.",
        "Wipe out skillet. Heat butter and remaining 1/2 tablespoon oil in skillet over medium heat. Crack eggs into skillet and cook to desired doneness, 2 to 3 minutes for runny yolks. Serve each ramen wedge with a fried egg and 2 slices bacon."
    ],
    "ingredients": [
        "8 slices bacon",
        "2 (3 ounce) packages ramen noodles (flavor packets discarded)",
        "1 1/2 tablespoons vegetable oil, divided",
        "1 cup shredded Cheddar cheese",
        "1 tablespoon butter",
        "4 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheddar Ramen Noodle Wedge with Fried Eggs",
    "url": "http://allrecipes.com/recipe/254695/cheddar-ramen-noodle-wedge-with-fried/"
}
