{
    "directions": [
        "Preheat oven to 425° with rack in middle.",
        "Cook mushrooms, garlic, 1/4 teaspoon salt, and 1/8 teaspoon pepper in oil and 1 tablespoon butter in a 4-quart heavy saucepan over medium heat, stirring occasionally, until mushrooms are softened, about 3 minutes. Add wine and simmer briskly 2 minutes. Transfer mushroom mixture to a large bowl and stir in chicken. (Set aside saucepan.)",
        "Bring milk to a bare simmer in a medium saucepan. Melt remaining 4 tablespoons butter in 4-quart saucepan over medium-low heat. Add flour and cook roux, whisking constantly, 3 minutes. Add hot milk in a slow stream, whisking constantly. Add thyme, 3/4 teaspoon salt, and 1/2 teaspoon pepper and simmer, whisking occasionally, until thickened, 5 to 6 minutes. Remove from heat and reserve 1 cup sauce. Stir parmesan into sauce remaining in pan, then stir into mushroom filling.",
        "Pour half of reserved plain sauce into baking pan, spreading evenly to coat bottom. Add 3 lasagne sheets, overlapping slightly, and one third of mushroom filling, spreading evenly, then sprinkle one fourth of Gruyère over top. Repeat 2 times. Top with remaining 3 lasagne sheets and remaining plain sauce, spreading evenly. Sprinkle with remaining Gruyère.",
        "Cover with foil, tenting slightly to prevent foil from touching top of lasagne but sealing all around edge, and bake 30 minutes. Remove foil and bake until cheese is golden, about 15 minutes more. Let lasagne stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 (10-ounce) package cremini or white mushrooms, thinly sliced",
        "3 garlic cloves, minced",
        "1 tablespoon olive oil",
        "5 tablespoons unsalted butter, divided",
        "1/2 cup dry white wine",
        "1/2 roast chicken, skin discarded, meat shredded (about 2 1/4 cups), and carcass reserved for stock",
        "3 1/2 cups whole milk",
        "1/4 cup all-purpose flour",
        "2 teaspoons thyme leaves",
        "3/4 cup grated Parmigiano-Reggiano",
        "12 Barilla no-boil egg lasagne noodles (less than a 9-ounce package)",
        "1 1/2 cups coarsely grated Gruyère (3 ounces)",
        "Equipment: an 8-inch square baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Mushroom",
        "Pasta",
        "Father's Day",
        "Dinner",
        "Parmesan",
        "Party",
        "Potluck",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cheesy Chicken and Mushroom Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/cheesy-chicken-and-mushroom-lasagne-351914"
}
