{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 11x13-inch baking dish.",
        "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain. Transfer to a bowl, add processed cheese cubes, and let stand until cheese partially melts.",
        "Place ground beef in a skillet over medium heat, break meat apart with a spatula, and sprinkle with garlic powder, onion powder, salt, and black pepper. Cook and stir until beef is browned and crumbly, about 10 minutes. Drain excess grease.",
        "Stir Cheddar cheese soup, sour cream, Parmesan cheese, and onion together in a bowl; gently fold macaroni and processed cheese mixture into soup mixture. Stir in milk until thoroughly combined. Mix ground beef into macaroni mixture and spread into prepared baking dish. Top casserole with slices of American cheese and sprinkle cracker crumbs on top. Cover casserole with aluminum foil.",
        "Bake in the preheated oven until casserole is bubbling, about 20 minutes; remove foil and bake until top is golden brown, about 10 more minutes."
    ],
    "ingredients": [
        "2 1/2 cups elbow macaroni",
        "1 (8 ounce) package processed cheese (such as Velveeta®), cubed",
        "1 pound ground beef",
        "1 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1 pinch salt and ground black pepper to taste",
        "1 (10.75 ounce) can  condensed Cheddar cheese soup (such as Campbell's®)",
        "1 (8 ounce) carton sour cream",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup chopped onion",
        "1/4 cup milk",
        "8 slices American cheese (such as Kraft®)",
        "1 (8 ounce) package buttery round crackers (such as Ritz®), crushed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheesy Macaroni and Hamburger Casserole",
    "url": "http://allrecipes.com/recipe/230284/cheesy-macaroni-and-hamburger-cassero/"
}
