{
    "directions": [
        "Make the crust: Preheat the oven to 350 degrees F. Pulse the graham crackers and butter cookies in a food processor until finely ground; drizzle in the melted butter and pulse to combine. Press the crumb mixture into the bottom and about 1 inch up the side of a 9-inch springform pan. Bake until golden, about 10 minutes, then transfer to a rack and let cool completely. Reduce the oven temperature to 300 degrees F.",
        "Make the filling: Beat the cream cheese and sugar in a large bowl with a mixer on medium-high speed until smooth and slightly fluffy, about 3 minutes. Beat in the eggs, one at a time, then beat in the lemon juice and vanilla. Pour the batter into the prepared crust. Transfer to the oven and bake until the edges are set but the center still jiggles slightly, 1 hour to 1 hour, 10 minutes. Turn off the oven and keep the cheesecake in the oven with the door ajar, 20 minutes. Remove from the oven and run a knife around the edge of the cake to loosen. Transfer to a rack; let cool completely, then refrigerate until set, at least 4 hours or overnight.",
        "Make the lemon curd: Finely grate the ginger; put in a fine-mesh sieve set over a bowl and press with a rubber spatula to extract the juice.",
        "Whisk the eggs, sugar and cream in a small nonreactive saucepan until combined. Add the lemon juice and ginger juice and cook over medium heat, whisking constantly, until thick and bubbly, about 6 minutes. Remove from the heat and whisk in the butter until melted. Strain the curd through a fine-mesh sieve set over a bowl, pressing it through with a rubber spatula; let cool. Refrigerate until ready to use.",
        "Spread the curd over the cheesecake and refrigerate until set, about 30 minutes. Remove the springform ring and slice. Serve with strawberries.",
        "Photograph by Johnny Miller"
    ],
    "ingredients": [
        "8 whole graham crackers, broken into pieces",
        "1 1/2 cups lightly crushed butter cookies",
        "5 tablespoons unsalted butter, melted",
        "3 8-ounce packages cream cheese, at room temperature",
        "1 cup sugar",
        "3 large eggs",
        "2 tablespoons fresh Meyer lemon juice (from about 1 lemon)",
        "1 1/2 teaspoons vanilla extract",
        "1 4-inch piece ginger, peeled",
        "1/2 cup sugar",
        "1 tablespoon heavy cream",
        "1/2 cup fresh Meyer lemon juice (from about 4 lemons)",
        "2 tablespoons cold unsalted butter, cut into small pieces",
        "Sliced strawberries, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit",
        "Lemon Recipes"
    ],
    "title": "Cheesecake With Meyer Lemon-Ginger Curd",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/cheesecake-with-meyer-lemon-ginger-curd-recipe"
}
