{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.",
        "Place cherries in a bowl; stir in sugar. Set aside.",
        "Mix 2 tablespoons grapeseed oil, 1 teaspoon cinnamon, nutmeg, salt, and pepper together in a gallon-size resealable plastic bag. Place acorn wedges into bag; shake to evenly coat with oil and spices. Place slices in a single layer on prepared baking sheet.",
        "Bake in preheated oven for 20 minutes; turn wedges. Continue to bake until golden brown, about 20 additional minutes.",
        "Meanwhile, heat a saucepan over medium-high heat. Add sliced almonds and toast until fragrant, shaking pan to flip almonds, 1 or 2 minutes. Remove pan from heat. Transfer almonds to a bowl; sprinkle with 1/2 teaspoon cinnamon.",
        "Heat 1 teaspoon grapeseed oil in the same saucepan over medium heat; slowly add cherry/sugar mix. Heat through over medium heat. Remove from heat and carefully add brandy. Place pan back on heat and simmer until nearly all the liquid has evaporated, stirring frequently, about 4 minutes. Add chicken broth, orange peel, and dried cranberries. Bring to a simmer and reduce again by half, stirring frequently, 5 to 7 minutes.",
        "Add cold, sliced butter and vanilla. Swirl pan until butter melts.",
        "Place acorn slices on a serving plate; pour cherry sauce over squash, and sprinkle with toasted almonds. Garnish with a mint sprig."
    ],
    "ingredients": [
        "8 ounces fresh or frozen cherries, pitted",
        "2 teaspoons white sugar",
        "Squash:",
        "1 acorn squash - cut in half lengthwise, peeled, seeded and cut into 12 wedges",
        "2 tablespoons grapeseed oil",
        "1 teaspoon cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/4 teaspoon salt",
        "1/4 teaspoon pepper",
        "2 tablespoons sliced almonds",
        "1/2 teaspoon ground cinnamon",
        "Cherry Sauce:",
        "1 teaspoon grapeseed oil",
        "1 ounce brandy",
        "1/2 cup Swanson® Unsalted Chicken Stock",
        "1 teaspoon minced dried orange peel",
        "1/4 cup dried cranberries",
        "2 tablespoons cold butter, cut into small pieces",
        "1/2 teaspoon vanilla extract",
        "1 sprig fresh mint (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheeky Cherry Acorn Squash",
    "url": "http://allrecipes.com/recipe/244656/cheeky-cherry-acorn-squash/"
}
