{
    "directions": [
        "Bring 4 1/2 cups water to a gentle simmer in a medium saucepan. Crack an egg into a small bowl, then gently slide egg into water. Repeat with remaining eggs, waiting until whites are opaque before adding the next one (about 30 seconds apart). Poach until whites are set but yolks are still runny, about 3 minutes. Using a slotted spoon, transfer eggs to paper towels as they are done; set aside.",
        "Fish out any wispy pieces of cooked egg with slotted spoon; discard. Bring same saucepan of water to a boil and add a couple pinches of salt. Whisking constantly, gradually add grits. Reduce heat to low, cover saucepan, and cook grits, whisking occasionally and scraping bottom to prevent sticking, until tender, thick, and creamy, 25–40 minutes, depending on coarseness.",
        "Meanwhile, cook bacon in a medium skillet over medium-low heat, stirring often, until bacon is crisp, 8–10 minutes. Transfer bacon to a small bowl with slotted spoon. Combine chile and vinegar in another small bowl.",
        "Pour off all but 2 Tbsp. fat from skillet; cook shallot, stirring often, until softened, about 3 minutes. Add chard in batches, letting it wilt slightly before adding more, and cook, tossing, until completely wilted, about 3 minutes. Remove from heat and season with salt, pepper, and some chile-soaking vinegar.",
        "Remove grits from heat and season with salt and lots of pepper. Add butter, then gradually add cheese, whisking until melted and combined; thin with a bit more water if too thick.",
        "Divide grits among bowls; top with chard, poached eggs, bacon, and chiles. Season eggs with salt and pepper."
    ],
    "ingredients": [
        "4 large eggs, room temperature",
        "Kosher salt",
        "1 cup white grits (not instant)",
        "4 ounces bacon, coarsely chopped",
        "1 Fresno or other red chile, thinly sliced into rings",
        "1 tablespoon Sherry vinegar or red wine vinegar",
        "1 large shallot, finely chopped",
        "8 cups torn Swiss chard leaves (from 1 large bunch)",
        "Freshly ground black pepper",
        "2 tablespoons unsalted butter",
        "6 ounces cheddar, coarsely grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Bacon",
        "Cheddar",
        "Cheese",
        "Egg",
        "Chile",
        "Chard",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cheesy Grits With Poached Eggs, Greens, and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/cheesy-grits-with-poached-eggs-greens-and-bacon"
}
