{
    "directions": [
        "Cook cauliflower in large pot of boiling salted water until crisp-tender, about 5 minutes. Using large sieve, transfer cauliflower to bowl. Add tomatoes to pot; cook 1 minute. Remove from water; peel and dice tomatoes. Reserve pot of water.",
        "Melt 2 tablespoons butter in large skillet over medium-high heat. Add cauliflower; sauté until beginning to brown, about 5 minutes. Add tomatoes and green onions. Cook 1 minute to blend flavors. Remove from heat. Season with coarse salt and pepper.",
        "Melt 2 tablespoons butter in large saucepan over medium-low heat. Add flour and stir 2 minutes. Gradually whisk in cream. Cook until sauce thickens, whisking occasionally, about 4 minutes. Add 2 cups Comté cheese; whisk until melted and sauce is smooth. Whisk in 1/2 cup Parmesan, then crème fraîche and mustard. Season with salt and pepper. Remove from heat.",
        "Return reserved pot of water to boil. Add pasta and cook until tender but still firm to bite, stirring occasionally. Drain; return pasta to same pot. Stir in cauliflower mixture and sauce.",
        "Butter 13x9x2-inch glass baking dish. Spoon in half of pasta mixture; sprinkle with 1/2 cup Comté cheese. Top with remaining pasta mixture and 1/2 cup Comté cheese. Melt remaining 1 tablespoon butter in small skillet. Add breadcrumbs and toss to coat. Remove from heat; mix in 1/4 cup Parmesan. Sprinkle crumbs over pasta. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 350°F. Bake pasta uncovered until heated through and bubbling, about 35 minutes.",
        "*Sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 1 1/2- to 1 3/4-pound head of cauliflower, cored, cut into 1-inch florets",
        "2 large heirloom tomatoes",
        "5 tablespoons butter, divided",
        "1/2 cup thinly sliced green onions",
        "Coarse kosher salt",
        "2 tablespoons all purpose flour",
        "1 cup heavy whipping cream",
        "3 cups coarsely grated Comté cheese (or half Gruyère and half Fontina; about 9 ounces), divided",
        "3/4 cup Parmigiano-Reggiano, finely grated Parmesan cheese, divided",
        "1 cup crème fraîche*",
        "1 tablespoon whole grain Dijon mustard",
        "10 ounces penne (3 1/2 cups)",
        "1 cup fresh breadcrumbs (from crustless French bread ground in processor)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Pasta",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Cauliflower",
        "Potluck",
        "Fontina",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheesy Baked Penne with Cauliflower and Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/cheesy-baked-penne-with-cauliflower-and-creme-fraiche-350111"
}
