{
    "directions": [
        "Whisk egg in medium bowl until frothy. Mix in all cheeses, tomatoes, thyme, marjoram, and pepper. Cover and chill until ready to use, up to 1 day.",
        "Stack phyllo sheets. Using sharp knife or shears, cut sheets in half lengthwise, making sixteen 5- to 6-inch-wide pastry strips. Place 1 strip on work surface (keep remaining strips covered with plastic wrap and damp towel to prevent drying). Brush entire strip with oil. Place 1 heaping tablespoon cheese filling in center of strip, 1 inch in from 1 short pastry edge. Shape filling into 3-inch-long log, parallel to short edge. Fold short edge, then sides of pastry, over filling. Continue to roll up, enclosing filling completely. Brush all over with oil; place on rimmed baking sheet. Repeat with remaining phyllo strips and filling. Can be made 1 day ahead. Cover and refrigerate.",
        "Preheat oven to 350°F. Bake rolls uncovered until filling is heated through and pastry is golden, about 18 minutes. Transfer to platter; serve hot."
    ],
    "ingredients": [
        "1 large egg",
        "3/4 cup (packed) grated aged kefalotyri cheese (3 ounces)",
        "3/4 cup (packed) grated kasseri cheese (3 ounces)",
        "1/4 cup (packed) finely crumbled feta cheese (3 ounces)",
        "2 tablespoons finely chopped drained oil-packed sun-dried tomatoes",
        "2 teaspoons fresh thyme leaves",
        "1 teaspoon chopped fresh marjoram",
        "1/4 teaspoon ground white or black pepper",
        "8 sheets phyllo pastry (about 12x14 inches), thawed if frozen",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Tomato",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheese, Herb, and Sun-Dried Tomato Phyllo Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-herb-and-sun-dried-tomato-phyllo-rolls-235140"
}
