{
    "directions": [
        "Preheat oven to 375°F. Line a rimmed baking sheet with parchment paper.",
        "Sprinkle each half of squash with 1/4 tsp. salt, then place facedown on prepared sheet. Trim 1/4\" from top of garlic head to expose cloves. Place head on a sheet of foil, drizzle oil over, then wrap tightly to enclose. Transfer to baking sheet. Bake until interior of squash is fork-tender and garlic is very soft, 30–50 minutes, depending on size of squash. Let cool slightly.",
        "Carefully unwrap garlic. Let cool slightly, then squeeze pulp out onto a cutting board. Finely chop.",
        "Heat cream cheese, milk, and chopped garlic in a medium saucepan over medium, stirring occasionally, until smooth. Season with salt and pepper; set aside.",
        "Using a fork, scrape squash crosswise to pull strands from shells into a large bowl; reserve shells. Toss squash with cream cheese mixture, salami, spinach, tomatoes, Parmesan, red pepper flakes, if using, and 1 cup mozzarella until combined. Stuff squash mixture back into shells and top with remaining 1/2 cup mozzarella.",
        "Transfer shells to oven and bake until squash mixture is bubbling and lightly browned, about 25 minutes.",
        "Squash boats can be assembled (but not baked) 1 day ahead. Store in an airtight container and chill."
    ],
    "ingredients": [
        "2 small or 1 large spaghetti squash (3–3 1/2 pounds), halved lengthwise, seeded",
        "Kosher salt",
        "1 head garlic",
        "1 tablespoon olive oil",
        "8 ounces cream cheese",
        "1 cup whole milk",
        "Freshly ground black pepper",
        "6 ounces salami, preferably Soppressata, sliced into 1/4-inch strips",
        "5 ounces baby spinach (about 4 packed cups)",
        "1/2 cup marinated sundried tomatoes (about 2 ounces), coarsely chopped",
        "1/4 cup finely grated Parmesan (about 1/2 ounce)",
        "1/2 teaspoon crushed red pepper flakes (optional)",
        "1 1/2 cups shredded mozzarella (about 6 ounces), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Squash",
        "Wheat/Gluten-Free",
        "Kid-Friendly",
        "Winter",
        "Cheese",
        "Cream Cheese",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cheesy Baked Spaghetti Squash Boats With Salami, Sundried Tomatoes, and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/cheesy-baked-spaghetti-squash-boats-with-salami-sundried-tomatoes-and-spinach"
}
