{
    "directions": [
        "Start the dough",
        "Be sure an adult is nearby to help.",
        "The warm water must be between 115°F and 125°F. Use the thermometer to check the temperature. Pour the water into the large bowl. Sprinkle the yeast over the water and let stand until the yeast becomes foamy, about 5 minutes.",
        "Add 3 tablespoons of the cornmeal, 2 tablespoons of the olive oil, 1 teaspoon salt, and 1/2 cup of the flour to the bowl with the yeast.",
        "Mix the dough",
        "Using the wooden spoon, beat until the mixture is smooth.",
        "Add the remaining flour, 1/2 cup at a time, beating after each addition, until a soft dough forms. You might not need to add every bit of the flour.",
        "Sprinkle a work surface lightly with a little flour. Tip the dough out of the bowl onto the surface and get ready to knead.",
        "Knead the dough",
        "Dust your hands with flour. Using the heel of one hand, push the top half of the dough away from you. Then, fold the top half of the dough back toward you. Rotate the dough a quarter turn.",
        "Repeat these same movements, continuing to push, fold, and rotate the dough until it feels smooth and springy, about 10 minutes. While you knead, occasionally dust the work surface with flour to prevent sticking. Gather the dough into a ball.",
        "Let the dough rise",
        "Wash the large bowl and oil it lightly with 1/2 tablespoon of the olive oil.",
        "Put the dough in the bowl, flip it around in the bowl to coat it with the oil, and cover the bowl with plastic wrap.",
        "Note where the top of the dough is on the bowl. You can even mark it on the outside with a piece of tape if you like. Set the bowl in a warm place and let the dough rise until it has doubled in size, 4560 minutes.",
        "Get ready to bake",
        "Place an oven rack as low as possible in the oven. Preheat the oven to 450°F.",
        "Sprinkle the baking sheets with the remaining 12 tablespoons cornmeal, coating the surface evenly.",
        "Smack the dough",
        "Wipe off your work surface and dust it with a little flour.",
        "Sink your fist into the risen dough to deflate it and then gather the dough into a ball. Tip the dough out of the bowl onto the work surface.",
        "Using the rolling pin, smack the dough firmly all over 4 or 5 times. Rotate the dough a half turn and smack it again 4 or 5 times. Flip the dough over and repeat. (Smacking the dough will make it easier to work with.) Divide the dough in half.",
        "Shape the pizza rounds",
        "Using your hands, roll, press, and stretch one half of the dough into a 12-inch circle. Slide your hands under the round and lift it onto a prepared baking sheet. Pinch up the outer edge to make a ridge.",
        "Using your fingers, rub 1 tablespoon of the oil all over the dough round. Sprinkle half of the mozzarella over the pizza. Top it with half of the tomato slices and sprinkle with 1 tablespoon of the grated Parmesan cheese, some salt and pepper, and a few fresh basil leaves.",
        "Bake the pizza",
        "Slide the baking pan into the oven and bake until the crust is browned and the cheese is bubbling, about 15 minutes. While the first pizza is baking, shape the second pizza dough round, place it on the other baking sheet, and add the toppings.",
        "Ask an adult to help you remove the first pizza from the oven. Then, put the second pizza in the oven to bake.",
        "Using the metal spatula, slide the first pizza onto the cutting board. Using the pizza cutter, cut into wedges and serve.",
        "Variations:",
        "Pineapple & Ham Pizza",
        "Follow the recipe for Cheese Pizza but reduce the olive oil to 2 1/2 tablespoons. Instead of spreading olive oil over the dough round, use a spoon to spread 1 cup tomato sauce or pasta sauce over the dough round. Replace the tomato slices and basil leaves with 1 cup each ham strips and fresh or canned pineapple cut into 1/2-inch chunks. Bake the pizza as directed.",
        "Pepperoni Pizza",
        "Follow the recipe for Cheese Pizza but reduce the olive oil to 2 1/2 tablespoons. Instead of spreading olive oil over the dough round, use a spoon to spread 1 cup tomato sauce or pasta sauce over the dough round. Replace the tomato slices and basil leaves with 1/4 pound thinly sliced pepperoni. Bake the pizza as directed.",
        "Pepperoni Pizza",
        "Follow the recipe for Cheese Pizza but reduce the olive oil to 2 1/2 tablespoons. Instead of spreading olive oil over the dough round, use a spoon to spread 1 cup tomato sauce or pasta sauce over the dough round. Replace the tomato slices and basil leaves with 1/4 pound thinly sliced pepperoni. Bake the pizza as directed.",
        "Adapted from Williams-Sonoma",
        "Fun Food,",
        "by Stephanie Rosenbaum (Simon & Schuster, 2006)."
    ],
    "ingredients": [
        "1 cup warm tap water",
        "1 package dry yeast",
        "4 to 5 tablespoons cornmeal",
        "4 1/2 tablespoons olive oil",
        "1 teaspoon salt, plus more for sprinkling",
        "2 1/2 cups all-purpose flour, plus more for  kneading",
        "4 cups shredded mozzarella cheese",
        "4 large tomatoes, cored and thinly sliced",
        "2 tablespoons grated Parmesan cheese",
        "Freshly ground pepper, to taste",
        "16 to 20 fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Cheese Pizza",
    "url": "http://www.williams-sonoma.com/recipe/cheese-pizza.html"
}
