{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Place potatoes directly on oven rack and bake until tender when pierced with fork, about 1 hour 15 minutes. Transfer to platter and let stand until cool enough to handle. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Cut potatoes horizontally in half. Using spoon, scoop out pulp, leaving 1/3-inch-thick shell. Transfer potato pulp to medium bowl and mash; mix in cheese, melted butter, cilantro, green onion, chile, and sesame seeds. Season potato mixture generously with salt and pepper; divide among potato shells.DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Combine first 6 ingredients in processor. Using on/off turns, blend until mixture is finely chopped. Add yogurt, oil, and lemon juice and process until smooth puree forms. Transfer to small bowl. Season to taste with salt and pepper. DO AHEAD: Can be made 6 hours ahead. Cover and refrigerate.",
        "Remove top rack from grill. Place disposable aluminum baking pan in center of bottom rack (if using 2-burner gas grill, place pan on 1 side of burner). Add enough water to pan to reach depth of 1 inch.",
        "Prepare barbecue (medium heat). If using charcoal grill, light briquettes in chimney and pour half onto rack on each side of disposable pan. If using 3-burner gas grill, light burners on left and right, leaving center burner off. If using 2-burner gas grill, light burner on side opposite disposable pan. Return top rack to grill. Place sheet of foil on grill rack above unlit burner; brush with vegetable oil.",
        "Place sesame seeds on small plate. Place half of yogurt-spice paste in shallow bowl and reserve. Spread remaining yogurt-spice paste over top of potato filling in each potato half. Sprinkle with half of sesame seeds. Dip bottom of each potato half into reserved spice paste, then dip into remaining sesame seeds. Place potatoes atop foil on grill rack above disposable pan. Cover barbecue and grill until potatoes are heated through and bubbling in center, 25 to 30 minutes. Transfer potatoes to platter and serve.",
        "A thick yogurt; sold at some supermarkets and at specialty foods stores (such as Trader Joe's and Whole Foods markets) and Greek markets. If unavailable, place regular yogurt in cheesecloth-lined strainer set over large bowl. Cover and chill overnight to drain."
    ],
    "ingredients": [
        "3 large unpeeled russet potatoes (each about 16 ounces), scrubbed",
        "1 cup (packed) coarsely grated Monterey Jack cheese (about 4 ounces)",
        "2 tablespoons (1/4 stick) butter, melted",
        "2 tablespoons chopped fresh cilantro",
        "1 green onion, finely chopped",
        "1 serrano chile, seeded, minced",
        "1 tablespoon sesame seeds",
        "Coarse kosher salt",
        "2 garlic cloves, coarsely chopped",
        "2 teaspoons chopped peeled fresh ginger",
        "2 teaspoons sweet or hot paprika",
        "1 teaspoon salt",
        "1 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1/2 cup plain whole-milk Greek-style yogurt*",
        "4 teaspoons vegetable oil",
        "2 teaspoons fresh lemon juice",
        "1/2 cup sesame seeds (about 2.6 ounces)",
        "Special equipment: disposable 11 3/4 x 8 1/2 x 1 1/4-inch aluminum baking pan (for drips)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Vegetarian",
        "Yogurt",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Monterey Jack",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cheese-Stuffed Potatoes with Yogurt-Spice Paste and Sesame Seed Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-stuffed-potatoes-with-yogurt-spice-paste-and-sesame-seed-crust-353833"
}
