{
    "directions": [
        "Whisk mayonnaise and barbecue sauce in small bowl to blend. Cover and chill.",
        "Mix ground chuck with 1 teaspoon salt and 1/2 teaspoon pepper just to blend (do not overmix). Form mixture into six 1 1/2-inch-thick patties. Cover and let stand at room temperature 30 minutes.",
        "Prepare barbecue (medium-high heat). Run 1 metal skewer horizontally through center of each onion slice. Brush onion slices lightly with oil to coat. Rub chiles with oil. Transfer onions and chiles to barbecue. Grill onions until softened and browned, about 5 minutes per side. Remove skewers from onions. Chop onions; transfer to small bowl. Char chiles until blackened on all sides. Enclose chiles in paper bag 10 minutes. Peel, seed, and chop chiles. Mix into onions. Season onions and chiles to taste with salt and pepper.",
        "Sprinkle burgers with salt and pepper. Grill burgers until cooked to desired doneness, about 4 minutes per side for medium. Top each burger with 2 cheese slices during last minute of cooking. Place bottom halves of rolls on work surface. Divide chile-onion mixture among rolls. Place cheeseburgers atop chile-onion mixture. Spread 1 tablespoon mayonnaise-barbecue sauce over cheese, cover with bun tops, and serve, passing remaining sauce."
    ],
    "ingredients": [
        "1/2 cup mayonnaise",
        "1/2 cup prepared barbecue sauce",
        "2 1/4 pounds freshly ground beef chuck",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 metal skewers",
        "3 1/2-inch-thick onion slices",
        "Vegetable oil",
        "3 poblano chiles*",
        "12 thin slices cheddar cheese, room temperature",
        "6 onion rolls or sesame-seed hamburger buns, split"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Onion",
        "Mayonnaise",
        "Cheddar",
        "Hot Pepper",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Cheeseburgers with Charred Green Chiles and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/cheeseburgers-with-charred-green-chiles-and-onions-109698"
}
