{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out dough into a 13-inch round on a lightly floured surface with a floured rolling pin. Fit dough into tart pan, without stretching, letting excess dough hang over edge. Fold overhang inward and press against side of pan to reinforce edge. Prick bottom all over with a fork. Chill until firm, about 30 minutes.",
        "Line shell with foil or parchment paper and fill with pie weights. Bake until pastry is set and pale golden along rim, 20 to 25 minutes.",
        "Carefully remove foil and weights and bake shell until deep golden all over, 15 to 20 minutes more. Put tart pan in a shallow baking pan. Leave oven on.",
        "Mince garlic and mash to a paste with salt using side of a large knife.",
        "Discard seeds, ribs, and stems from chiles, then pat dry if necessary and cut into 1/3-inch-wide strips.",
        "Whisk together eggs, milk, crema, onion, garlic paste, and pepper in a large bowl until just combined, then pour into baked tart shell.",
        "Sprinkle cheese and chiles over custard (chiles will sink slightly) and bake until custard is just set, 50 to 60 minutes. (Center will jiggle slightly; filling will continue to set as it cools.)",
        "Transfer quiche in pan to a rack to cool at least 20 minutes before serving.",
        "To remove side of tart pan, center a large can under pan and let side of pan drop. Serve warm or at room temperature."
    ],
    "ingredients": [
        "pastry dough",
        "1 large garlic clove",
        "3/4 teaspoon salt",
        "1 lb poblano chiles (about 4 large),\nroasted and peeled",
        "6 large eggs",
        "1 cup whole milk",
        "1/2 cup Mexican crema or heavy cream",
        "2 tablespoons finely grated white onion (using small teardrop holes of a box grater)",
        "1/2 teaspoon black pepper",
        "1/2 lb Monterey Jack cheese, coarsely grated (2 1/2 to 3 cups)",
        "a 9-inch (2-inch deep) round fluted tart pan with removable bottom; pie weights or raw rice",
        "pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Pepper",
        "Brunch",
        "Bake",
        "Cinco de Mayo",
        "Lunch",
        "Monterey Jack",
        "Gourmet"
    ],
    "title": "Cheese and Chile Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-and-chile-quiche-235751"
}
