{
    "directions": [
        "Char poblano chilies over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel chilies. Using small sharp knife, carefully slit chilies open along 1 side. Remove seeds, leaving stems attached.",
        "Mix shrimp and next 6 ingredients in medium bowl. Season to taste with salt and pepper. Fill chilies with shrimp mixture, dividing equally. Pull up sides of chilies to enclose filling. Place stuffed chilies on baking sheet. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Bake chilies uncovered until heated through and cheeses melt, about 15 minutes. Spoon 3 tablespoons Red Bell Pepper Sauce onto each of 8 plates. Place 1 stuffed chili atop sauce on each. Garnish with basil leaves, if desired, and serve.",
        "Fresh green chilies, also known as pasillas; available at Latin American markets and some supermarkets"
    ],
    "ingredients": [
        "8 large poblano chilies* (each about 3 ounces)",
        "8 ounces peeled deveined cooked shrimp, coarsely chopped",
        "2/3 cup soft fresh goat cheese (about 4 ounces), room temperature",
        "1/2 cup (packed) grated Panela cheese or Monterey Jack cheese",
        "1/4 cup chopped red bell pepper",
        "2 tablespoons chopped shallot",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped fresh basil",
        "Red Bell Pepper Sauce",
        "Fresh basil leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pepper",
        "Shellfish",
        "Appetizer",
        "Roast",
        "Christmas",
        "Low Carb",
        "Goat Cheese",
        "Shrimp",
        "Winter",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cheese- and Shrimp-Stuffed Roasted Poblanos with Red Bell Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-and-shrimp-stuffed-roasted-poblanos-with-red-bell-pepper-sauce-107461"
}
