{
    "directions": [
        "Preheat the oven to 375 degrees F. Coat a baking sheet with nonstick spray.",
        "Place a large saute pan over medium heat and add oil. Once the oil is hot, add the onion, jalapeno, garlic, green onions and saute until tender, about 3 minutes. Season with salt and pepper.",
        "In a large bowl, combine the chicken, cheese, cream cheese, sauteed mixture and hot sauce together.",
        "Whisk the egg in a small bowl. Set aside. Sprinkle flour on your work surface and unroll the pie dough.",
        "Roll out each round to a 13-inch circle. Cut each crust into eight 4-inch circles with a biscuit cutter. You can knead the scraps and then roll out, if necessary. Spoon about 1 heaping tablespoon of the chicken mixture into the center of each round. Brush the edges with the egg wash and fold each circle in half. Gently press on the top of the empanada to release any air. Seal the edges with a fork and brush the top with the remaining egg wash. Sprinkle with chile powder. Bake until golden brown, about 20 minutes.",
        "Serve the chicken empanadas with the Chili Lime Dipping Sauce.",
        "Combine the yogurt, chipotle and lime zest and juice in a bowl."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 small red onion, finely chopped",
        "1 jalapeno, finely diced, seeded and ribs removed",
        "2 cloves garlic, minced",
        "3 green onions, thinly sliced",
        "Kosher salt and freshly ground pepper",
        "1 1/2 cups shredded then diced cooked chicken breasts (from leftover chicken)",
        "1 cup shredded Monterey and Cheddar cheese blend",
        "4 ounces cream cheese, diced",
        "Dash of hot sauce",
        "1 egg",
        "Flour, for rolling",
        "One 15-ounce package refrigerated pie dough",
        "1 tablespoon chipotle chile powder",
        "Chili Lime Dipping Sauce, recipe follows",
        "1 cup Greek yogurt",
        "1 chipotle pepper (canned in adobo sauce), minced",
        "Juice and zest of 1 lime"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "Pastry Recipes",
        "Empanada Recipes",
        "Sauce Recipes",
        "Jalapeno Recipes",
        "Vegetable",
        "Cheese",
        "Recipes for Parties",
        "Tailgate Party"
    ],
    "title": "Cheesy Chicken Empanadas",
    "url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/cheesy-chicken-empanadas-recipe"
}
