{
    "directions": [
        "In blender, combine milk and eggs. Add flour and salt and blend at low speed until smooth, less than 1 minute. Let batter stand 1/2 hour.",
        "Have ready large plate or platter. Place skillet over moderately high heat, brush lightly with some melted butter, and heat until butter just begins to smoke. Pour 1/4 to 1/3 cup batter into pan, tilting to spread into thin, even layer. Cook until crêpe begins to \"blister,\" edges curl slightly away from skillet, and underside is lightly browned, about 1 to 2 minutes. Use flexible spatula to flip crêpe out of skillet and onto plate, cooked side up.",
        "Repeat with remaining batter, brushing skillet lightly with melted butter before cooking each crêpe. Stack crêpes, cooked side down, on plate and let cool.",
        "In large bowl, mash together farmer and cottage cheeses until blended. Add egg yolk, melted butter, sugar, and salt, and mix until combined.",
        "Place 1 crêpe, cooked side up, on a plate. Place 2 tablespoons filling in center, and fold up bottom to cover filling. Fold down top, then flip over and fold in sides. Flip over again and place on a large plate. Repeat with remaining crêpes and filling. (Can be made up to 1 day ahead; cover and chill until ready to fry.)",
        "In large saucepan, combine 3 cups blueberries, sugar, and cornstarch. Set over moderately low heat and stir gently until sugar dissolves. Raise heat to moderately high and boil, stirring occasionally, 3 minutes. Remove from heat and gently stir in remaining blueberries.",
        "Heat 1 tablespoon butter in iron skillet over moderately high heat. Add 3 blintzes and fry until golden brown on both sides, about 1 to 2 minutes per side. Repeat with remaining blintzes. Serve hot with sauce."
    ],
    "ingredients": [
        "1 1/2 cups whole milk",
        "6 large eggs",
        "1 1/2 cups all-purpose flour",
        "3/8 teaspoon salt",
        "2 tablespoons butter, melted",
        "1 1/2 cups (12 ounces) farmer cheese",
        "1/2 cup (4 ounces) large-curd cottage cheese (4% milk fat)",
        "1 egg yolk",
        "1 tablespoon unsalted butter, melted",
        "1 tablespoon sugar",
        "salt",
        "4 1/2 cups fresh blueberries (from 5 half-pint containers, picked over)",
        "3/4 cup sugar",
        "1 1/2 teaspoons cornstarch",
        "4 tablespoons butter",
        "Iron skillet or crêpe pan",
        "Flexible metal or plastic spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Egg",
        "Brunch",
        "Dessert",
        "Sauté",
        "Kid-Friendly",
        "Quick & Easy",
        "Rosh Hashanah/Yom Kippur",
        "Blueberry",
        "Shavuot",
        "Cottage Cheese",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheese Blintzes with Blueberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-blintzes-with-blueberry-sauce-232828"
}
