{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Set an oven rack in the center position of the oven. Prepare a 13x9-inch baking dish with cooking spray.",
        "Heat oil in a skillet over medium-high heat. Saute spinach in hot oil until wilted, 2 to 3 minutes; season with salt and pepper to taste.",
        "Beat milk, eggs, 1 teaspoon salt, and freshly ground black pepper together in a bowl until smooth.",
        "Line the bottom of the prepared baking dish with half the baguette slices. Spread about half the sausage cubes and half the sauteed spinach over the bread layer. Sprinkle 3 ounces Cheddar cheese, 3 ounces mozzarella cheese, and 1/4 cup scallions over the sausage and spinach. Pour 1 cup of the milk mixture over everything. Arrange remaining bread in a layer over the ingredients in the baking dish. Repeat layering of sausage, spinach, Cheddar cheese, mozzarella cheese, and green onions, respectively. Pour remaining milk mixture over the dish to soak ingredients completely.",
        "Cover dish with plastic wrap. Weigh plastic wrap down with 3 soup cans to keep top of strata immersed in liquid. Let sit at room temperature for 15 minutes.",
        "Bake in preheated oven until set in the center, about 50 minutes. Switch oven to Broil and continue cooking until the top of the strata begins to puff and turn brown in spots, about 5 minutes more. Let strata cool 8 to 10 minutes before serving."
    ],
    "ingredients": [
        "vegetable oil cooking spray",
        "1 tablespoon vegetable oil",
        "1 pound spinach",
        "1 pinch salt and ground black pepper to taste",
        "1 quart milk",
        "12 eggs",
        "1 teaspoon salt",
        "freshly ground black pepper, or to taste",
        "1 sourdough baguette, sliced",
        "1 pound soy sausages, cut into cubes",
        "6 ounces shredded extra-sharp Cheddar cheese",
        "6 ounces shredded low-fat mozzarella cheese",
        "1/2 cup thinly sliced scallions"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheesy Brunch Strata with Soy Sausage and Spinach",
    "url": "http://allrecipes.com/recipe/241949/cheesy-brunch-strata-with-soy-sausage/"
}
