{
    "directions": [
        "Lightly coat an 8x8x2\" baking pan with nonstick spray; line with plastic wrap, leaving a generous overhang.",
        "Mix crumbs, butter, and salt in a medium bowl until it resembles moist sand. Press evenly onto bottom of pan. Cover; chill.",
        "Place 2 tablespoons. cold water in a small saucepan; sprinkle gelatin over. Let stand until gelatin is soft, 5-10 minutes.",
        "Using an electric mixer on medium-high speed, beat sugar, butter, and salt in a medium bowl until light and fluffy, about 5 minutes. With motor running, add cream cheese 1 piece at a time, occasionally scraping down sides of bowl. Beat in crème fraîche, orange juice, and lime juice.",
        "Gently heat gelatin over lowest heat, stirring constantly, just until gelatin dissolves. Scrape gelatin into cream cheese mixture; beat to blend. Fold in whipped cream just to incorporate. Pour mixture over crust; smooth top. Chill until set, about 3 hours. DO AHEAD: Cheesecake can be made 3 days ahead. Cover and keep chilled, or freeze airtight for up to 2 weeks.",
        "Cook first 3 ingredients, 1 tablespoon mint, lime juice, and 1 tablespoon water in a small saucepan over low heat until raspberries are soft and juices are released, 2-3 minutes. Transfer to a small bowl. Cover with plastic wrap and chill foratleast1hourandupto1day.",
        "Using plastic wrap overhang, lift cheese-cake from pan and place on a flat surface. Cut into pieces; place on plates. Spoon candied raspberries over; drizzle with sauce and garnish with mint."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup shortbread cookie crumbs made from 6 ounces shortbread cookies (such as Walkers), finely ground in a food processor",
        "2 tablespoons unsalted butter, melted",
        "Pinch of fine sea salt",
        "1 teaspoon unflavored gelatin",
        "2/3 cup sugar",
        "8 tablespoons (1 stick) unsalted butter, cut into 8 pieces, room temperature",
        "Pinch of fine sea salt",
        "10 ounces cream cheese, cut into 10 pieces, room temperature",
        "1/4 cup crème fraîche or sour cream",
        "1/4 cup fresh orange juice",
        "1 tablespoon fresh lime juice",
        "1 cup heavy cream, beaten to soft peaks",
        "1 6-ounce container fresh raspberries",
        "1/4 cup sugar",
        "1 tablespoon minced peeled ginger",
        "1 tablespoon thinly sliced fresh mint leaves plus more for garnish",
        "1 teaspoon fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Ginger",
        "Dessert",
        "Cream Cheese",
        "Raspberry",
        "Lime",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cheesecake with Ginger-Lime Candied Raspberries",
    "url": "http://www.epicurious.com/recipes/food/views/cheesecake-with-ginger-lime-candied-raspberries-51104800"
}
