{
    "directions": [
        "For the crust: Preheat the oven to 350 degrees F. Wrap 3 layers of foil around the outside of a 9-inch-diameter springform pan with 3-inch-high sides. Butter the pan.",
        "Combine the graham crackers, sugar and salt in a food processor and pulse until crumbly. Add the butter and pulse until moistened. Press the crumb mixture evenly onto the bottom and 1 1/2 inches up the sides of the prepared pan. Bake just until golden brown, about 15 minutes. Let cool completely.",
        "Reduce the oven temperature to 325 degrees F.",
        "For the filling: In an electric mixer fitted with the paddle attachment, beat the cream cheese on medium speed until fluffy. Add the sugar and vanilla and beat until combined. Add the eggs 1 at a time, mixing well after each addition. Add the sour cream and mix until smooth, about 35 seconds. Pour the filling into the cooled crust.",
        "Set the cheesecake in a large baking pan. Add enough hot water to the baking pan to come 1 inch up the sides of the cheesecake pan. Bake until almost set (the center will move slightly when the pan is gently shaken) but not puffed, about 1 hour. Let cool at room temperature for 2 hours. Cover loosely with plastic wrap and refrigerate until completely cooled, preferably overnight or for at least 6 hours.",
        "For the pomegranate sauce: Combine the pomegranate juice and sugar in a saucepan and cook over high heat until reduced to 1/2 cup, about 15 minutes. Let cool. Add the pomegranate seeds and mix to combine.",
        "Pour the pomegranate sauce on top of the cooled cheesecake and serve."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter, melted and cooled, plus more for buttering the pan",
        "12 graham crackers",
        "1/4 cup granulated sugar",
        "1/4 teaspoon salt",
        "Four 8-ounce packages cream cheese, at room temperature",
        "1 1/4 cups granulated sugar",
        "1/2 teaspoon vanilla extract",
        "4 large eggs",
        "1/2 cup sour cream",
        "2 cups pomegranate juice",
        "1/4 cup granulated sugar",
        "1/2 cup fresh pomegranate seeds"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit",
        "Pomegranate Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Dessert"
    ],
    "title": "Cheesecake with Pomegranate Sauce",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/cheesecake-with-pomegranate-sauce"
}
