{
    "directions": [
        "Blend milk, matzo meal, eggs, oil, and salt in a blender until smooth. Let batter stand 30 minutes.",
        "Stir batter before using. Lightly brush a 10-inch nonstick skillet with oil and heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in 1/3 cup batter, immediately tilting and rotating skillet to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Return skillet to heat and cook crêpe until top is set and edge and bottom are golden, about 1 minute. Remove skillet from heat and loosen edge of crêpe with a flexible heatproof spatula. Quickly invert skillet over a plate to release crêpe. Make 11 more crêpes in same manner, brushing skillet lightly with oil for each and stacking crêpes on plate as cooked.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cook asparagus in a wide 4- to 5-quart pot of boiling salted water , uncovered, until just tender, about 5 minutes. Transfer asparagus with a slotted spoon to a cutting board to cool. Cut off and reserve tips, then finely chop stalks.",
        "Stir together cottage cheese, chopped stalks, dill, egg, pepper, and salt.",
        "Put 1 crêpe, paler side up, on a work surface and spread a scant 1/3 cup of filling in a horizontal line just below center of crêpe, leaving a 3/4-inch border at each end. Fold in sides of crêpe over ends of filling, then, beginning at bottom, roll up to enclose filling. Transfer, seam side down, to a lightly buttered 15- by 10-inch shallow baking pan. Fill and transfer remaining 11 crêpes in same manner.",
        "Bake blintzes, covered with foil, until filling is hot, 30 to 35 minutes.",
        "Heat butter in a 10- to 12-inch skillet over moderate heat until foam subsides. Add scallions and cook, stirring, until tender, about 5 minutes. Stir in asparagus tips, salt, and pepper and cook, stirring, until asparagus is heated through, 1 to 2 minutes. Remove from heat and stir in dill. Spoon topping over blintzes."
    ],
    "ingredients": [
        "2 1/2 cups whole milk",
        "1 1/3 cups matzo meal",
        "4 large eggs",
        "1/4 cup vegetable oil plus additional for brushing skillet",
        "1/2 teaspoon salt",
        "1 pound medium asparagus, trimmed",
        "3 cups small-curd cottage cheese (4% milkfat; 24 ounces)",
        "1/4 cup finely chopped fresh dill",
        "1 large egg, lightly beaten",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter",
        "2 bunches scallions, trimmed and cut into 1-inch pieces",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 tablespoons chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Egg",
        "Bake",
        "Passover",
        "Vegetarian",
        "Asparagus",
        "Spring",
        "Kosher",
        "Cottage Cheese",
        "Dill",
        "Gourmet"
    ],
    "title": "Cheese Matzo Blintzes with Asparagus and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-matzo-blintzes-with-asparagus-and-dill-109305"
}
