{
    "directions": [
        "Position a rack in the upper third of the oven; preheat to 425 degrees F. Put the squash, cut-side up, in a large microwave-safe dish with 1 tablespoon water; dot with 1 tablespoon butter and season with salt and pepper. Cover with plastic wrap and pierce with a knife to vent. Microwave until tender, about 15 minutes.",
        "Meanwhile, heat the remaining 2 tablespoons butter in a large pot or Dutch oven over medium heat. Add the onion; cook, stirring, until softened, about 5 minutes. Add the garlic and cook 1 minute. Add the flour and cook, stirring, 3 minutes. Whisk in the milk until smooth, then bring to a simmer and cook until thickened, about 5 minutes. Add the cheese, stirring to melt. Add the nutmeg, 3/4 teaspoon salt and a few grinds of pepper. Stir in the rice and spinach.",
        "Transfer the squash to a rimmed baking sheet and fill with the rice mixture. Sprinkle with more cheese and bake until lightly browned, about 15 minutes. Top with parsley.",
        "Photograph by Charles Masters"
    ],
    "ingredients": [
        "2 small acorn squash, halved lengthwise and seeded",
        "Kosher salt and freshly ground pepper",
        "3 tablespoons unsalted butter",
        "1/2 onion, finely chopped",
        "2 cloves garlic, minced",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 cup shredded cheddar cheese (about 4 ounces), plus more for topping",
        "1/4 teaspoon ground nutmeg",
        "2 cups cooked brown rice",
        "1 10-ounce package frozen chopped spinach, thawed and squeezed dry",
        "Chopped fresh parsley, for topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Brown Rice",
        "Rice Recipes",
        "Acorn Squash",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Cheesy Rice-Stuffed Acorn Squash",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/cheesy-rice-stuffed-acorn-squash"
}
