{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Place beef strips in a shallow dish and cover with Worcestershire sauce. Turn to coat both sides. Let marinate at room temperature as you prepare the filling.",
        "Melt butter in a large skillet over medium heat. Add onion and cook until softened and starting to brown, about 3 minutes. Add bell pepper and mushrooms. Cook stirring frequently 3 additional minutes.",
        "Transfer beef strips from Worcestershire sauce to a cutting board; season with salt and pepper. Place a thin layer of cheese down the length of each beef strip. Add a layer of the vegetable mix down the length of each strip. Top each strip with another layer of cheese.",
        "Starting at the end nearest you carefully roll each beef strip over the filling all the way to the end and place in a baking sheet seam side down. Secure with a toothpick if necessary.",
        "Bake in preheated oven to desired doneness, about 15 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove from the oven and let rest 5 minutes.",
        "Prepare Idahoan Signature™ Russets Mashed Potatoes according to package directions. Heat gravy in a saucepan over medium heat.",
        "Cut each cheesesteak roll into slices prior to serving; top with gravy. Serve with Idahoan Signature™ Russets Mashed Potatoes."
    ],
    "ingredients": [
        "1 1/2 pounds skirt steak, trimmed and cut into 4-inch wide strips",
        "1/2 cup Worcestershire sauce",
        "1 tablespoon butter",
        "1 medium yellow onion, chopped",
        "1/2 green bell pepper, seeded and chopped",
        "3 whole button mushrooms, chopped",
        "salt and pepper to taste",
        "2 cups shredded mozzarella cheese, divided",
        "1 (10.25 ounce) can beef gravy",
        "1 (9.74 ounce) package Idahoan Signature™ Russets Mashed Potatoes"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheesesteak Roll-Ups",
    "url": "http://allrecipes.com/recipe/255426/cheesesteak-roll-ups/"
}
