{
    "directions": [
        "Place cheesecake in freezer until partially frozen, about 3 to 4 hours.",
        "Using your cookie cutters, press out mini cheesecakes and place on a cookie sheet lined with waxed paper. To smooth the sides of the cheesecake, you may dip a small knife into hot water. Place cakes in the refrigerator.",
        "In a medium saucepan, heat jam, sugar, cream cheese, and lemon juice over medium heat until sugar is dissolved and ingredients are fully combined. Once dissolved, whisk ingredients to combine. Let mixture come to a rapid boil and continue cooking for 5 minutes; the mixture should coat the back of a spoon. Let cool for 2 to 3 minutes and then strain. Pour glaze over cheesecakes and let set. For a professional look, transfer glaze to a squeeze bottle and pipe a star shape over cheesecakes.",
        "Place icing in a large resealable plastic bag fitted with a star tip. Pipe icing over cheesecakes. Garnish with strawberries and mint."
    ],
    "ingredients": [
        "1 store-bought plain-flavored cheesecake",
        "1 (12-ounce) jar strawberry jam",
        "3 tablespoons sugar",
        "2 ounces cream cheese",
        "1 tablespoon fresh lemon juice",
        "1 (1-pound) jar store-bought icing (any flavor or color you desire)",
        "Fresh strawberries, for garnish",
        "Fresh mint leaves, for garnish",
        "Special Equipment: round or square cookie cutters, star tip"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Fruit Cheesecake",
        "Fruit",
        "Fruit Dessert Recipes",
        "Strawberry Cheesecake",
        "Strawberry",
        "American",
        "Cheese",
        "Cream Cheese Recipes",
        "Dairy Recipes",
        "Cocktail Party",
        "Recipes for Parties",
        "Outdoor Party",
        "Dinner Parties",
        "Spring"
    ],
    "title": "Cheesecake Petit Fours with Creamy Strawberry Glaze",
    "url": "http://www.foodnetwork.com/recipes/sandra-lee/cheesecake-petit-fours-with-creamy-strawberry-glaze-recipe"
}
