{
    "directions": [
        "Preheat oven to 300°F. Butter a shallow 13x9\" baking dish and a large piece of foil. Place 9 cups bread in a large bowl.",
        "Heat oil in a large skillet over medium-high. Cook sausage, stirring occasionally and breaking into small pieces with a wooden spoon, until browned and cooked through, 7–10 minutes. Transfer to bowl with bread.",
        "Place onions, celery, sage, and 2 Tbsp. butter in same skillet; season with salt and pepper. Cook, stirring often, until onions are golden brown and soft, 10–12 minutes. Add wine and cook, stirring occasionally, until almost completely evaporated, about 5 minutes; scrape into bowl with bread and sausage.",
        "Whisk eggs and broth in a medium bowl until smooth, then pour over bread mixture. Pour in half-and-half and add 3 cups cheese; toss to combine. Season with salt and pepper. Transfer to prepared baking dish and cover with foil, buttered side down. Bake until a paring knife inserted into the center comes out hot, 40–50 minutes .",
        "Heat broiler. Uncover stuffing and top with remaining cheese. Broil until top is golden and bubbling, about 4 minutes. Let sit at least 10 minutes and up to 30 before serving.",
        "Stuffing can be assembled 1 day ahead; cover with foil and chill. Stuffing can be baked (but not broiled) 3 hours ahead. Store tightly wrapped at room temperature until ready to broil."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, plus more",
        "1 medium boule sourdough, cut into 1-inch pieces (9–10 cups), dried out overnight",
        "2 tablespoons olive oil",
        "1 pound sweet or spicy Italian sausage, casings removed",
        "2 large onions, finely chopped",
        "3 celery stalks, chopped",
        "1/4 cup finely chopped sage",
        "Kosher salt, freshly ground pepper",
        "1 cup dry white wine",
        "2 large eggs, beaten to blend",
        "1 cup low-sodium chicken broth",
        "2 cups half-and-half",
        "1 pound aged cheddar, grated (about 5 cups), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Stuffing/Dressing",
        "Side",
        "Cheese",
        "Cheddar",
        "Celery",
        "Sage",
        "Sourdough",
        "Sausage",
        "Milk/Cream",
        "White Wine"
    ],
    "title": "Cheesy Sausage and Sage Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/cheesy-sausage-and-sage-stuffing"
}
