{
    "directions": [
        "In a large bowl proof the yeast in 1/4 cup lukewarm water for 5 minutes, or until it is foamy. In a small saucepan melt the butter, add the milk, and heat the mixture to lukewarm. Stir the milk mixture into the yeast mixture, add the unbeaten eggs, the sugar, and the salt, combining the mixture well, and stir in 4 cups of the flour. Add 1 cup of the remaining flour, combine the dough well, and add enough of the remaining 1/2 cup flour to form a soft but smooth and elastic dough. Knead the dough on a lightly floured surface for 3 minutes, form it into a ball, and put it in a lightly buttered bowl, turning it to coat it with the butter. Let the dough rise, covered, in a warm place for 2 hours, punch it down, and let it rise again, covered, for 1 hour. Halve the dough and form the halves into balls. Put the halves in lightly buttered bowls, turning them to coat them with the butter, and let the dough rise, covered, in a warm place for 1 hour.",
        "On a work surface roll out 1 ball of the dough into an oval about 16 by 13 inches and sprinkle half of the mozzarella and half the brick cheese on a lengthwise half of the dough. Fold the other half of the dough over the cheese and seal the edges of the dough well, pinching them together. Transfer the dough to one half of a large buttered baking sheet, prick the top all over with a fork, and brush it lightly with half of the beaten egg. Make a second loaf with the remaining dough and cheese in the same manner and transfer it to the other half of the baking sheet. Prick the top of the dough all over with a fork and brush it lightly with the remaining beaten egg. Bake the breads in the middle of a preheated 400°F. oven for 20 to 25 minutes, or until they are golden brown."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1 1/4 cups milk",
        "2 large eggs, unbeaten, plus 1 large egg, beaten lightly",
        "1/4 cup sugar",
        "1 1/2 teaspoons salt",
        "5 to 5 1/2 cups unbleached all-purpose flour",
        "1 pound whole milk mozzarella, cut into 1/4-inch dice",
        "1 pound brick cheese or Münster, cut into 1/4-inch dice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Dairy",
        "Egg",
        "Bake",
        "Mozzarella",
        "Gourmet"
    ],
    "title": "Cheese Bread Zuder",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-bread-zuder-10537"
}
