{
    "directions": [
        "Toss Cantal and Romano cheeses in medium bowl to blend. Stir in crème fraîche, 3 tablespoons chives, 2 tablespoons parsley, and lemon peel. Season filling to taste with salt and pepper.",
        "Line large baking sheet with plastic wrap. Place 1 wonton wrapper on work surface. Place 1 heaping teaspoon cheese mixture in center of wrapper. Brush edges with egg white, fold over to enclose cheese filling, and press edges to seal. Transfer to prepared baking sheet. Repeat with remaining wonton wrappers and filling. (Can be made ahead. Cover with layer of plastic, then layer of foil; refrigerate up to 6 hours or freeze up to 1 week.)",
        "Boil broth and butter in heavy small saucepan until reduced to 3/4 cup, about 5 minutes. Whisk in remaining 1 tablespoon chives and 1 tablespoon parsley. Season to taste with salt and pepper. Cover to keep warm.",
        "Working in batches, cook ravioli in large pot of boiling salted water until just tender, about 3 minutes. Using slotted spoon, transfer ravioli to serving bowl. Ladle warm broth mixture over ravioli and serve immediately."
    ],
    "ingredients": [
        "2 3/4 cups coarsely grated Cantal or sharp white cheddar cheese",
        "1 1/4 cups finely grated pecorino Romano cheese",
        "1/3 cup crème fraîche or sour cream",
        "4 tablespoons chopped fresh chives",
        "3 tablespoons chopped fresh Italian parsley",
        "2 teaspoons finely grated lemon peel",
        "50 wonton wrappers",
        "1 large egg white, beaten just to loosen",
        "1 cup low-salt beef broth",
        "4 tablespoons butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Herb",
        "Cheddar",
        "Parmesan",
        "Lemon",
        "Fall",
        "Chive",
        "Parsley"
    ],
    "title": "Cheese Ravioli with Herbs in Meat Broth",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-ravioli-with-herbs-in-meat-broth-107124"
}
