{
    "directions": [
        "Roast chiles on their sides on racks of gas burners (1 or 2 per burner) over medium-high heat, turning with tongs, until skins are blistered and slightly charred, 4 to 6 minutes. (Or broil on rack of a broiler pan about 2 inches from heat.) Immediately transfer to a large bowl and cover, then let stand 20 minutes.",
        "Purée all sauce ingredients except oil with 11/4 teaspoons salt in a blender until smooth, then strain through a medium-mesh sieve into a bowl, pressing on solids, then discarding them.",
        "Heat oil in a deep 12-inch heavy skillet or heatproof casserole (preferably one that can go to the table) over medium-high heat until it shimmers. Carefully pour in sauce and simmer gently, stirring occasionally, 10 minutes (sauce should still be thin). Season with salt.",
        "Carefully rub off skins from chiles, leaving stems attached. Cut a slit lengthwise in each chile with kitchen shears, then carefully cut out seedpod (including attached ribs) without tearing chile (hotter chiles smell stronger when cut). Wipe chiles clean with a paper towel if necessary.",
        "Stuff chiles with cheese and enclose filling by overlapping slit slightly if possible, then transfer to a plate. (Use a toothpick to mark any hotter chiles if desired.)",
        "Heat 1/2 inch oil in another 12-inch heavy skillet over medium heat until it registers 360°F on thermometer.",
        "While oil heats, beat egg whites with 1/8 teaspoon salt using an electric mixer until they just hold stiff peaks. Whisk yolks with 1/8 teaspoon salt in a large bowl, then gently fold in whites.",
        "Put flour in a fine-mesh sieve and dust chiles, turning them to lightly coat all sides.",
        "When oil is ready, dip chiles, 1 at a time (hold chile by stem), in egg coating, spooning it over chile to cover completely, then fry, turning once, until golden on all sides (lap oil over any lighter areas), 4 to 5 minutes. Transfer chiles with a slotted spoon to paper towels to drain.",
        "Meanwhile, reheat sauce over low heat. Lay chiles in sauce to serve."
    ],
    "ingredients": [
        "4 large fresh poblano chiles (1 pound)",
        "1/2 pound Monterey Jack cheese, coarsely grated (2 1/2 cups)",
        "1 1/2 pounds tomatoes, coarsely chopped",
        "1 cup water",
        "1/4 cup chopped white onion",
        "2 large garlic cloves",
        "1 tablespoon distilled white vinegar",
        "1 teaspoon sugar",
        "1 teaspoon dried oregano (preferably Mexican)",
        "2 tablespoons corn oil or other vegetable oil",
        "2 to 3 cups corn oil or other vegetable oil",
        "4 large eggs, separated",
        "1/4 cup all-purpose flour",
        "Equipment: a deep-fat thermometer",
        "Accompaniment: white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Tomato",
        "Fry",
        "Roast",
        "Vegetarian",
        "Quick & Easy",
        "Hot Pepper",
        "Gourmet"
    ],
    "title": "Cheese-Stuffed Poblanos with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-stuffed-poblanos-with-tomato-sauce-239958"
}
