{
    "directions": [
        "Heat the oven to 350 degrees F. Combine the panko and half of the cheese. Set aside.",
        "Heat the stock, milk, bay leaf and thyme in a medium saucepan over medium-low heat until steaming. Keep warm while you prepare the vegetables. (You can skip infusing the liquid with the herbs if you like, but it does need to be warmed so it doesn't make lumpy gravy when you add it to the flour.)",
        "Heat the butter in a large ovenproof and flame-proof casserole or skillet over medium heat. Add the onion and celery. Cook until the onion is soft and translucent, 3 to 5 minutes. Add the mushrooms and season with salt and pepper; cook until tender, stirring occasionally, 3 to 5 minutes. Add the garlic and cook until fragrant, 45 to 60 seconds. Add the flour and stir to combine. (The mixture will be dry.)",
        "Remove the bay leaf and thyme from the stock mixture. Whisk the stock into the flour and vegetables. Add the remaining cup of cheese and stir until smooth. Add the rice and stir to combine. Add the sour cream, cayenne and nutmeg; stir until smooth. Place the 6 pieces of chicken in the casserole and snuggle them into the rice. Cover with a tight-fitting lid and transfer to the oven. Bake until the rice is tender and the liquid has been absorbed, about 40 minutes.",
        "Meanwhile, place the broccoli in a microwave-safe bowl with 1/4 cup of water. Cover and microwave until the broccoli is just tender and bright green, about 2 minutes, depending on the strength of your microwave. Drain the broccoli and keep warm.",
        "Once the rice is tender and the liquid has been absorbed, remove the casserole from the oven and stir in the broccoli. (It's easiest if you transfer the chicken to a plate first, then stir in the broccoli, then pop the chicken back on top.) Smooth the top and sprinkle with the reserved panko-cheese mixture. Return to the oven and bake until the topping is golden brown, about 15 minutes longer. Place the casserole on a rack to cool slightly before serving."
    ],
    "ingredients": [
        "1 cup panko breadcrumbs",
        "2 cups extra-sharp Cheddar cheese, grated (about 8 ounces)",
        "2 cups homemade chicken stock or canned reduced-fat low-sodium chicken broth",
        "2 cups 2-percent or whole milk",
        "1 bay leaf, preferably fresh",
        "1 thyme sprig",
        "4 tablespoons (1/2 stick) unsalted butter",
        "1 onion, chopped",
        "1 stalk celery, diced",
        "8 ounces sliced cremini mushrooms",
        "Coarse kosher salt and freshly ground black pepper",
        "2 cloves garlic, chopped",
        "1/4 cup all-purpose flour",
        "2 cups long-grain rice",
        "3/4 cup sour cream",
        "Pinch of cayenne pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "3 boneless skinless chicken breasts, halved, or 6 boneless skinless thighs (about 1 1/2 pounds)",
        "1 pound broccoli crown, chopped into small florets"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Casserole",
        "Rice Recipes",
        "Chicken",
        "Poultry Recipes",
        "Broccoli",
        "Vegetable",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Cheesy Broccoli, Chicken and Rice Casserole",
    "url": "http://www.foodnetwork.com/recipes/cheesy-broccoli-chicken-and-rice-casserole"
}
