{
    "directions": [
        "Stir flour, sugar and salt in large bowl. Whisk eggs, milk, butter and vanilla in medium bowl to blend. Add to dry ingredients and whisk until smooth.",
        "Spray with vegetable oil spray and heat over medium-low heat. Pour 2 tablespoons crepe batter into pan and swirl pan to coat bottom thinly. Cook until edge of crepe is light brown, about 1 minute. Loosen edges of crepe gently with spatula. Carefully turn crepe over. Cook until beginning to brown in spots, about 30 seconds. Transfer crepe to plate. Place paper towel atop crepe. Repeat with remaining batter, spraying pan with vegetable oil spray as needed and covering each crepe with paper towel, forming total of 16 crepes.",
        "Mix farmer cheese and cream cheese in large bowl to blend. Stir in sugar, egg yolks, vanilla extract and ground cardamom.",
        "Place 1 crepe on work surface. Place 2 tablespoons filling 3-inch-long log just below center. Fold bottom of crepe over filling. fold sides in. Roll crepe up, enclosing filling completely. Transfer blintz to plastic-lined dish. Repeat with remaining filling and crepes.(Can be made 1 day ahead. Cover; chill overnight)",
        "Simmer orange juice and honey in heavy medium skillet over medium heat until reduced by half, about 4 minutes. Add rhubarb and stir until just tender, about 3 minutes. Transfer to large bowl. Stir in vanilla extract and ground cardamom. Cover and refrigerate. (Can be prepared 6 hours ahead. Keep chilled.) Stir in strawberries.",
        "Preheat oven to 200°F. Melt 2 tablespoons unsalted butter in large nonstick skillet over medium-low heat. Place 5 blintzes, seam side down, in skillet. Cook until golden brown and crisp, about 5 minutes per side. Transfer blintzes to baking sheet; keep warm in oven. Repeat with remaining 4 tablespoons butter and 11 blintzes in 2 more batches. Place blintzes on plates. Sprinkle with powdered sugar."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 tablespoon sugar",
        "Pinch of salt",
        "3 large eggs, room temperature",
        "1 cup whole milk, room temperature",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1 teaspoon vanilla extract",
        "Nonstick vegetable oil spray",
        "1/2 pound farmer cheese,* room temperature",
        "4 ounces cream cheese, room temperature",
        "3 tablespoons sugar",
        "2 large egg yolks",
        "1/4 teaspoon vanilla extract",
        "1/4 teaspoon ground cardamom",
        "1 cup orange juice",
        "2/3 cup honey",
        "4 cups 1/3-inch-thick slices trimmed rhubarb (1 1/2 pounds untrimmed)",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cardamom",
        "3 cups sliced hulled strawberries",
        "6 tablespoons (3/4 stick) unsalted butter",
        "Powdered sugar",
        "*Available at specialty food stores, cheese shops and some supermarkets across the country."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Cream Cheese",
        "Strawberry",
        "Spring",
        "Pan-Fry",
        "Honey",
        "Rhubarb",
        "Shavuot",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheese Blintzes with Strawberry-Rhubarb Compote",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-blintzes-with-strawberry-rhubarb-compote-5849"
}
