{
    "directions": [
        "Preheat oven to 250°F.",
        "Toss tomatoes with oil and arrange, cut sides up, in 1 layer in a shallow (1-inch-deep) baking pan. Bake in middle of oven until slightly shriveled but not completely dried or browned, about 1 1/4 hours. Transfer pan to a rack to cool.",
        "Stir together goat cheese, cream, pumpkin seeds, basil, salt, and pepper in a bowl and fold in half of oven-dried tomatoes.",
        "Spoon 1 rounded tablespoon of this filling into each blossom and twist ends of petals gently to close. Chill, covered, until ready to fry.",
        "Purée vinegar, shallot, oil, pepper, and salt in a blender until smooth and emulsified.",
        "Slice squash paper-thin (lengthwise) using slicer, then overlap squash slices decoratively on 4 plates to cover surface.",
        "Heat 2 inches of oil in a 3-quart saucepan to 350°F on thermometer.",
        "Set a bowl in a larger bowl of ice and cold water, then whisk together flour and salt in smaller bowl. Then whisk in sparkling water until combined well.",
        "Working in batches of 3, coat blossoms in batter, lifting each out by its stem and letting excess drip off, then fry, turning, until batter is crisp (it will not brown), 1 to 1 1/2 minutes. Transfer blossoms as fried with a slotted spoon to paper towels, drain, then season with salt.",
        "Drizzle vinaigrette over squash slices, then arrange 3 fried blossoms in middle of each plate. Sprinkle remaining oven-dried tomatoes, pumpkin seeds, and basil around blossoms and season with salt and pepper."
    ],
    "ingredients": [
        "3 cups small cherry tomatoes (1 lb; preferably Sungold), halved lengthwise",
        "2 teaspoons olive oil",
        "3 oz mild fresh goat cheese (6 tablespoons) at room temperature",
        "1 tablespoon heavy cream",
        "2 tablespoons chopped green (hulled) pumpkin seeds, toasted until they puff",
        "1/4 cup chopped fresh basil (preferably Thai)",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon black pepper",
        "12 male squash blossoms with stems (not with baby zucchini), stems trimmed to 1 inch",
        "1 tablespoon rice vinegar (not seasoned)",
        "1 tablespoon minced shallot",
        "2 tablespoons mild extra-virgin olive oil",
        "1/8 teaspoon black pepper",
        "3/4 teaspoon kosher salt",
        "1 lb assorted baby summer squash, stems discarded",
        "6 cups vegetable oil (preferably canola or grapeseed)",
        "1 cup all-purpose flour",
        "1/2 teaspoon kosher salt",
        "1 cup chilled sparkling water",
        "2 tablespoons green (hulled) pumpkin seeds, toasted until they puff",
        "1/3 cup small basil leaves (preferably Thai) or sliced larger leaves",
        "Special equipment: a mandoline or similar manual slicer such as a Japanese (Benriner); a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Fry",
        "Goat Cheese",
        "Basil",
        "Squash",
        "Seed",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cheese-Stuffed Squash Blossoms with Shaved Baby Squash and Toasted Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-stuffed-squash-blossoms-with-shaved-baby-squash-and-toasted-pumpkin-seeds-105585"
}
