{
    "directions": [
        "If using cottage cheese, place in center of kitchen towel, gather towel around cheese and squeeze to remove excess moisture. Measure 2 1/2 cups packed cottage cheese (reserve remainder for another use). Combine 1 1/4 pounds hoop cheese or 2 1/2 cups packed dry cottage cheese and sugar in processor; blend well. Add eggs and salt; process until almost smooth, scraping down sides of bowl occasionally. Transfer to bowl. Cover and refrigerate. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Combine 1 1/2 cups water and eggs in blender. Add flour, sugar and salt. Blend on lowspeed until very smooth, stopping occasionally to scrape down sides of container. Pour batter into medium bowl. Let stand at room temperature at least 1 hour and up to 2 hours, stirring occasionally.",
        "Heat 10-inch nonstick skillet over high heat. Brush very lightly with oil. Transfer 3 tablespoons batter to small cup. Working quickly, pour batter into center of skillet; tilt and shake skillet to spread batter into 7-inch round. Reduce heat to medium-high and cook crepe until bottom is speckled brown, about 45 seconds. Loosen sides of crepe with spatula and turn out onto paper towel, cooked side up. Cover with paper towel. Repeat with remaining batter, brushing pan occasionally with oil and layering crepes between paper towels.",
        "Place 1 crepe cooked side up on work surface. Place 1/4 cup filling in 3-inch-long log just below center. Fold bottom of crepe over filling. Fold sides in. Roll crepe up, enclosing filling completely. Transfer blintz to plastic-lined platter. Repeat with remaining filling and crepes. (Can be prepared ahead. Cover and chill overnight or freeze up to 1 month. Do not thaw frozen blintzes before cooking.)",
        "Combine all berries, sugar and lemon peel in large bowl. Let stand at room temperature until berries defrost, sugar dissolves and juices form in bowl, stirring occasionally, about 1 1/2 hours.",
        "Strain berry mixture thoroughly, reserving juices. Place cornstarch in heavy medium saucepan. Gradually add reserved juices to cornstarch, whisking until smooth. Whisk over high heat until syrup boils and is thick and clear, about 2 minutes. Transfer to bowl. Cool 15 minutes. Mix berries into syrup. Adjust tartness with lemon juice. (Can be prepared 3 hours ahead. Cover and chill.)",
        "Pour oil into 2 large nonstick skillets to depth of scant 1/8 inch; heat over medium-low heat until hot. Place blintzes seam down in skillets. Cook until bottoms are brown and crisp, shaking pans gently and moving blintzes occasionally to prevent sticking, about 6 minutes (for frozen blintzes, cover skillet for first 6 minutes). Using spatula, turn blintzes over; cook until blintzes are brown and crisp and blintzes feel firm when lightly pressed, about 5 minutes. Transfer to paper towel-lined platter. Place 2 blintzes on each plate. Spoon compote over blintzes. Top with sour cream. Sprinkle with lemon peel."
    ],
    "ingredients": [
        "1 1/4 pounds hoop cheese or 2 pounds nonfat cottage cheese",
        "1/2 cup plus 1 tablespoon sugar",
        "2 extra-large eggs",
        "1/2 teaspoon (scant) salt",
        "1 1/2 cups water",
        "3 extra-large eggs",
        "1 1/2 cups sifted all purpose flour",
        "1 tablespoon sugar",
        "3/4 teaspoon salt",
        "Vegetable oil",
        "2 1/2 cups frozen unsweetened boysenberries (about 11 ounces)",
        "2 1/2 cups frozen unsweetened blueberries (about 11 ounces)",
        "1 12-ounce basket strawberries, hulled, halved",
        "1 cup sugar",
        "1 teaspoon grated lemon peel",
        "1 1/2 tablespoons cornstarch",
        "Fresh lemon juice (optional)",
        "Vegetable oil",
        "Sour cream",
        "Lemon peel strips (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Berry",
        "Cheese",
        "Brunch",
        "Vegetarian",
        "Rosh Hashanah/Yom Kippur",
        "Shavuot",
        "Cottage Cheese"
    ],
    "title": "Cheese Blintzes with Three-Berry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/cheese-blintzes-with-three-berry-compote-2815"
}
