{
    "directions": [
        "Melt the butter in a large skillet over medium-high heat. Stir in the asparagus, 3 minced cloves of garlic, red onion, red wine vinegar, soy sauce, chicken broth, 1 teaspoon garlic salt, 1 tablespoon garlic herb seasoning blend, and 1 teaspoon black pepper. Cover and simmer until the asparagus is tender, stirring once, about 10 minutes. Remove from heat and set aside.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Season both sides of the steaks with the remaining 2 teaspoons garlic salt, 1 teaspoon black pepper, and 1 tablespoon garlic and herb seasoning blend. Spread the Dijon mustard evenly on one side of each steak, then top with the remaining 2 minced cloves of garlic. Divide the sauerkraut evenly over the steaks, then arrange 3 to 4 pieces of asparagus on top. Spread 3 torn slices American cheese over the asparagus, then spoon about 3 tablespoonfuls of the cream of mushroom soup on top. Roll each steak up like a jelly roll and place in a casserole dish. Distribute the remaining asparagus spears around the rolled steaks.",
        "Place the remaining cream of mushroom soup, sour cream, Parmesan cheese, and 1 slice American cheese into a blender. Cover, and puree until smooth. Pour the soup mixture over the steaks and asparagus. Cover the casserole dish with aluminum foil.",
        "Bake in the preheated oven until the meat is beginning to firm, and is hot and slightly pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C)."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "2 bunches fresh asparagus spears, cut in half crossways",
        "3 cloves garlic, minced",
        "1/2 red onion, chopped",
        "1 teaspoon red wine vinegar",
        "1 teaspoon soy sauce",
        "1/2 cup chicken broth",
        "1 teaspoon garlic salt, or to taste",
        "1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash®)",
        "1 teaspoon ground black pepper",
        "3 (1/2 pound) beef cube steaks (tenderized beef round)",
        "2 teaspoons garlic salt, or to taste",
        "1 teaspoon ground black pepper",
        "1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash®)",
        "3 tablespoons Dijon mustard",
        "2 cloves garlic, minced",
        "1/2 cup sauerkraut, drained",
        "3 slices American cheese, torn into pieces",
        "1 (10.75 ounce) can condensed cream of mushroom soup, divided",
        "1/2 cup sour cream",
        "2 tablespoons grated Parmesan cheese",
        "1 slice American cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cheesy Asparagus Beef Roll-Ups",
    "url": "http://allrecipes.com/recipe/216946/cheesy-asparagus-beef-roll-ups/"
}
