{
    "directions": [
        "Place chicken in large (9-quart) stock pot, pour in water, and drop in bay leaf and single clove. Bring to simmer over medium-low heat. As foam rises to the top of the broth, skim and discard with a ladle. Add peeled garlic cloves, cover pot, and simmer on low for 1 hour.",
        "Remove chicken from pot, and allow to cool for a few minutes. When cool enough to handle, remove all meat from the bones, and set the chicken meat aside. Pour stock into a bowl and set aside.",
        "In a large oven-safe pot or Dutch oven over medium heat, melt butter, and cook and stir carrots, celery, onion, and mushrooms until the vegetables start to become tender, about 10 minutes. Season with salt, white pepper, cayenne pepper, black pepper and paprika. Mix in flour, stirring to coat vegetables with flour, about 5 minutes. Add half of reserved stock, and stir with the vegetables and flour to form a very thick sauce. Stir in remaining stock until sauce is smooth; reduce heat to a simmer, and cook uncovered for 45 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Stir milk into the sauce, and gently mix in the reserved chicken meat, herbes de Provence, tarragon, and rosemary. Bring stew back to a simmer, and cook for 10 more minutes. Pop open the can of biscuits, separate, and place biscuits on top of stew.",
        "Bake in the preheated oven until the biscuits are golden brown and the stew is bubbling, about 20 minutes. Place lid on the pot or Dutch oven, and return to oven; bake until biscuits are cooked through, about 15 more minutes. Test biscuits for doneness by pulling apart a biscuit near the middle of the stew to see if it's cooked through."
    ],
    "ingredients": [
        "1 (4 pound) whole chicken, rinsed",
        "2 quarts water",
        "1 large bay leaf",
        "1 whole clove",
        "4 cloves garlic, peeled",
        "1/2 cup butter",
        "3 carrots, cut into 1/2-inch pieces",
        "3 ribs celery, cut into 1/2-inch pieces",
        "1 large onion, cut into 1/2-inch pieces",
        "6 mushrooms, quartered",
        "2 teaspoons salt",
        "1 teaspoon ground white pepper",
        "1 teaspoon cayenne pepper",
        "1 teaspoon ground black pepper",
        "1 teaspoon paprika",
        "1/2 cup all-purpose flour",
        "1/2 cup milk",
        "1 tablespoon herbes de Provence",
        "3 tablespoons fresh tarragon, chopped",
        "2 tablespoons fresh rosemary, chopped",
        "1 (10 ounce) can refrigerated biscuit dough"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Chicken and Biscuits",
    "url": "http://allrecipes.com/recipe/219163/chef-johns-chicken-and-biscuits/"
}
