{
    "directions": [
        "To begin the starter, mix together 1 1/4 cups flour, 1 1/2 cups water, 1/2 teaspoon malt and 1/2 teaspoon of honey. Mix well, cover and leave at room temperature for 24 hours. Repeat the process for days 2 and three.",
        "On day four, add to the starter: 7 1/2 cups of flour, 4 1/4 cups of water and 2 teaspoons of malt. Mix well, cover and keep at room temperature for 24 hours. Repeat this process the next day,  BUT only let the dough sit for 5 hours, then refrigerate it. Be aware that your starter will stay usable for 5 days. After this period, you will have to refresh the starter by taking 2 pounds of the batter and starting again from day 4.",
        "At last, the starter is complete and now we can make the bread! In a large bowl or in the bowl of a 5 quart stand  mixer, combine 2 1/2 cups of the starter, 5 1/8 cups of bread flour, 1 1/2 cups water, 1/4 cup gluten, 2 teaspoons malt and 4 teaspoons of salt. Mix everything together into a uniform dough. Turn the dough out onto a floured surface and knead until elastic, about 15 minutes. In an electric mixer, it should take about 9 minutes. For more experienced bread bakers, the dough should pass the windowpane test: Stretch the dough between your fingers till you have a very thin membrane, if the dough is elastic enough the membrane will not break or tear apart. Cover the bowl with a towel and let rest for 30 minutes.",
        "Divide the dough into two equal pieces and form into rounds. Cover again and let rest for 1 hour.",
        "Grease any pans you wish to use. Give the loaves their final shape - loaves, baguettes or round and place onto the prepared pans. Let the loaves rise until double in size. Spritz with water occasionally to keep from drying. Preheat the oven to 475 degrees F (240 degrees C).  Spray loaves generously with water.",
        "Bake for about 45 minutes, or until the loaf makes a hollow sound when tapped on the bottom. If after 20 minutes the loaves appear to be taking on too much color, reduce the temperature to 425 degrees F (220 degrees C). After baking, cool loaves on a wire rack. BON APPETIT!"
    ],
    "ingredients": [
        "Days 1, 2, and 3:",
        "1 1/4 cups all-purpose flour",
        "1 1/2 cups water",
        "1/2 teaspoon malt powder",
        "1/2 teaspoon honey",
        "Days 4 and 5:",
        "7 1/2 cups bread flour",
        "4 1/4 cups water",
        "2 teaspoons malt powder",
        "",
        "Sourbread Recipe:",
        "2 1/2 cups sourdough starter",
        "5 1/8 cups bread flour",
        "1 1/2 cups water",
        "1/4 cup gluten",
        "2 teaspoons malt powder",
        "4 teaspoons salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef Filip's Sourbread",
    "url": "http://allrecipes.com/recipe/24418/chef-filips-sourbread/"
}
