{
    "directions": [
        "Place flour in mixing bowl with dry yeast, salt, honey, olive oil, and warm water. Whisk together for about 5 minutes. This will be a very thin batter-like dough. Cover and let rise 1 1/2 hours. Dough should be bubbly. Stir with a ladle to eliminate the bubbles.",
        "Generously oil a cast-iron skillet with olive oil off heat. Pour batter in a squeeze bottle or zip-top bag with a bottom corner snipped. Slowly pour the batter into the skillet starting from the center of the pan and working in circles toward the edge. Try to avoid mixing batter with the oil. If small bubbles of oil appear on the surface, use the tip of a paring knife to gently stir them into the dough.",
        "Place pan over medium-high heat. Wait for the dough to form bubbles over the entire top surface and the crust starts to dry out a bit. Flip over and continue cooking one side and the next. The bubbly side should be dry and achieve a golden brown color; the bottom should be well browned, about 4 to 5 minutes total per side. Doneness times will depend on how thickly the batter was poured. Remove from heat.",
        "Spread with pizza sauce and top with your favorite pizza toppings: mozzarella cheese, grated Parmigiano-Reggiano cheese, pepperoni, etc. Try to avoid topping too heavily.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Place pizza under broiler until toppings are cooked, 3 to 4 minutes."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 (.25 ounce) package active dry yeast (2 1/4 teaspoons)",
        "1 teaspoon kosher salt",
        "1 1/2 teaspoons honey",
        "1 tablespoon olive oil, plus more to oil pan",
        "2 cups warm water (105 degrees F/41 degrees C)",
        "Pizza sauce",
        "Favorite pizza toppings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pourable Pizza",
    "url": "http://allrecipes.com/recipe/254280/chef-johns-pourable-pizza/"
}
