{
    "directions": [
        "Combine garlic, 1/2 teaspoon smoked paprika, and a pinch of salt in a mortar and pestle or food processor; process until smooth. Mix in mayonnaise, sherry vinegar, tomato paste, 1/4 teaspoon chipotle chile powder, and cayenne pepper until combined. Cover and refrigerate dipping sauce.",
        "Mix 1 tablespoon salt, black pepper, 1/2  teaspoon smoked paprika, and 1/2  teaspoon chipotle chile powder together in a small bowl. Set spice blend aside.",
        "Pour water into a large saucepan and stir 1 tablespoon salt, 1 teaspoon smoked paprika, cumin, and bay leaves into water. Bring to a boil, reduce heat to low, and cover; simmer for 10 minutes.",
        "Stir potatoes into water-paprika mixture, bring to a boil, and simmer until potatoes are tender but not fully cooked, 4 to 5 minutes. The tip of a paring knife should easily insert into the center of a potato cube. Drain potatoes and transfer to a wire rack to cool completely, about 45 minutes.",
        "Heat vegetable oil in a large cast iron skillet or Dutch oven to 350 degrees F (175 degrees C). Add cooled potato cubes and cook, stirring frequently, until golden brown, 5 to 6 minutes. Transfer potatoes to a baking sheet lined with  paper towels to cool slightly. Toss in a bowl with spice blend and serve with dipping sauce."
    ],
    "ingredients": [
        "Dipping Sauce:",
        "1 clove garlic, minced, or more to taste",
        "1/2 teaspoon smoked paprika",
        "1 pinch salt",
        "1 cup mayonnaise",
        "1 tablespoon sherry vinegar, or more to taste",
        "1 teaspoon tomato paste",
        "1/4 teaspoon ground chipotle peppers",
        "1 pinch cayenne pepper, or more to taste",
        "Spice Blend:",
        "1 tablespoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground chipotle peppers",
        "2 quarts cold water",
        "1 tablespoon salt",
        "1 teaspoon smoked paprika",
        "1 teaspoon ground cumin",
        "2 bay leaves",
        "2 pounds russet potatoes, peeled and cut into 1-inch cubes",
        "2 cups vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Patatas Bravas",
    "url": "http://allrecipes.com/recipe/230569/chef-johns-patatas-bravas/"
}
