{
    "directions": [
        "Place tomato slices onto a rack over a paper towel. Sprinkle with 1 teaspoon salt and let slices stand for 15 minutes for the salt to draw out extra juices.",
        "Mix cornmeal and bread crumbs together in a bowl; stir in 1/2 teaspoon salt, black pepper, and cayenne pepper to taste. Beat eggs with milk in a separate bowl. Place flour into a third bowl.",
        "Pat tomato slices dry with paper towels. Lay slices, one at a time, into flour; flip to coat both sides and let slices rest in the flour for about 30 seconds. Remove each slice and dip in egg mixture, then into cornmeal mixture, coating both sides of each slice thoroughly. Spread crumbs onto all sides and into tomato crevices with a fork. Rest tomatoes on rack for 10 minutes to let coating set.",
        "Combine sweet pickle relish, mayonnaise, and hot sauce in a small bowl to make the remoulade sauce.",
        "Place a large nonstick skillet over medium heat; heat vegetable oil with butter until butter melts, bubbles, and makes a sizzling sound. Fry tomatoes in the hot butter-oil mixture until tomato slices are slightly soft and coating is golden brown, 3 to 4 minutes per side. Use a spatula and a fork to flip.",
        "Transfer fried green tomatoes to a serving platter and serve with remoulade sauce."
    ],
    "ingredients": [
        "4 (1/2 inch) slices green tomato",
        "1 teaspoon salt",
        "3/4 cup cornmeal",
        "3/4 cup bread crumbs",
        "1/2 teaspoon salt",
        "freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "2 eggs",
        "2 tablespoons milk",
        "1 cup all-purpose flour",
        "3 tablespoons vegetable oil",
        "1 tablespoon butter",
        "Quick Remoulade Sauce:",
        "2 tablespoons sweet pickle relish",
        "2 tablespoons mayonnaise",
        "2 teaspoons hot sauce, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Fried Green Tomatoes",
    "url": "http://allrecipes.com/recipe/233658/chef-johns-fried-green-tomatoes/"
}
