{
    "directions": [
        "Melt 1 1/3 tablespoon butter with olive oil in a large saucepan over medium-high heat; cook mushrooms in the hot butter-oil mixture, stirring often, until browned on the edges, 15 to 20 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Combine 2 teaspoons softened butter with garlic in a small bowl; butter a 9x13-inch baking dish with garlic butter.",
        "Spread 1/3 the potatoes into the bottom of the prepared baking dish in a layer; season with salt, black pepper, 1/2 the thyme leaves, and 1/2 the cooked mushrooms. Sprinkle almost half the sottocenere cheese over potatoes, reserving about 3 tablespoons for the top. Layer next 1/3 the potatoes over cheese, season with salt and black pepper, remaining 1/2 thyme leaves, 1/2 the remaining cheese, remaining mushrooms, and last layer of potatoes. Season potatoes with more salt and black pepper. Pour chicken stock and cream over the top. Sprinkle with more salt and black pepper and reserved 3 tablespoons of sottocenere cheese. Cover dish loosely with aluminum foil; tent the foil a little so it doesn't touch the potatoes.",
        "Bake in the preheated oven until potatoes are bubbly, about 45 minutes. Remove foil and cook until top is browned, about 15 more minutes. Let cool slightly before serving."
    ],
    "ingredients": [
        "1 1/3 tablespoons butter",
        "1 tablespoon olive oil",
        "5 cups sliced mushrooms",
        "2 teaspoons butter, softened",
        "1 clove garlic, minced (optional)",
        "5 russet potatoes, peeled and very thinly sliced",
        "salt and freshly ground black pepper to taste",
        "1 teaspoon minced fresh thyme, divided",
        "6 ounces sottocenere (Italian semi-soft truffle cheese), shredded",
        "1 cup chicken stock",
        "2 cups heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Truffled Potato Gratin",
    "url": "http://allrecipes.com/recipe/235414/chef-johns-truffled-potato-gratin/"
}
