{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Generously season lamb shanks with salt and black pepper.",
        "Heat vegetable oil in a large Dutch oven over medium-high heat. Place lamb shanks in the Dutch oven, cook, turning, until browned on all sides, about 10 minutes. Transfer shanks to a plate. Drain off remaining oil and fat so only 1 tablespoon remains in the Dutch oven.",
        "Stir onion, garlic, and a pinch of salt into the Dutch oven; decrease heat to medium-low and cook, stirring, until onions are softened and translucent, about 5 minutes. Add tomato paste, chipotle chile powder, ancho chile powder, and ground cinnamon; stir to combine.",
        "Pour 1 cup chicken broth over onion mixture. Increase heat to high; when liquid boils, place lamb shanks in Dutch oven. Cover and cook in the preheated oven for 90 minutes.",
        "Remove Dutch oven and stir in jalapeno pepper, red bell pepper and 1/2 cup chicken stock; bring to a boil on the stovetop. Return pan to the oven and cook, uncovered, until lamb shanks are fork tender, about 20 minutes. Transfer lamb to plate.",
        "Place Dutch oven on the stovetop over high heat; bring liquid to a boil and cook, skimming off any foam, until liquid is reduced and thickened, about 5 minutes. Stir in cilantro; season with salt and pepper to taste. Spoon sauce over lamb shanks and serve."
    ],
    "ingredients": [
        "4 lamb shanks",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1 onion, sliced",
        "4 cloves garlic, sliced",
        "1 pinch salt",
        "1 teaspoon tomato paste",
        "1 teaspoon chipotle chile powder",
        "1 teaspoon ancho chile powder",
        "1/4 teaspoon ground cinnamon",
        "1 cup chicken broth",
        "3 jalapeno peppers, seeded and sliced",
        "1 red bell pepper, seeded and sliced",
        "1/2 cup chicken broth",
        "1/4 cup chopped cilantro",
        "1 pinch salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Braised Lamb Shanks",
    "url": "http://allrecipes.com/recipe/222192/chef-johns-braised-lamb-shanks/"
}
