{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Take two pieces of parchment paper, fold in half, and cut a half-circle starting at each crease. They should look similar to a heart-shape when unfolded. Coat each piece of parchment with olive oil on both sides.",
        "Place potatoes in a saucepan and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.",
        "Bring a pot of lightly salted water to a boil. Add asparagus, and cook uncovered until slightly tender, about 5 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the asparagus is cold, drain well, and set aside.",
        "Place 1 salmon fillet, half the asparagus, and half the potatoes in the middle of one side of a prepared parchment paper. Sprinkle with salt and pepper and drizzle with extra-virgin olive oil. Fold other half of circle over and seal parchment edge by making overlapping folds around the edge. At the end, fold the last crease in the opposite direction of the rest to ensure it seals. Repeat with the second piece of prepared parchment and remaining ingredients. Place pouches on a baking sheet.",
        "Bake in the preheated oven for 15 minutes. Remove from oven and allow to sit for 5 minutes before cutting open parchment. The salmon is done when it flakes easily with a fork."
    ],
    "ingredients": [
        "parchment paper",
        "1 teaspoon olive oil, or more if needed",
        "6 small potatoes",
        "10 spears asparagus",
        "2 (8 ounce) skinless, boneless, center-cut salmon fillets",
        "salt and ground black pepper to taste",
        "1 teaspoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Salmon in Parchment",
    "url": "http://allrecipes.com/recipe/223154/chef-johns-salmon-in-parchment/"
}
