{
    "directions": [
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "Melt 1/4 cup butter in a 12-inch cast iron skillet over medium-low heat. Stir in brown sugar, pineapple juice, and dark rum. Cook over medium-low heat until sugar is dissolved and mixture is bubbling, about 5 minutes.",
        "Remove from heat and spread pineapple slices in a layer over the brown sugar mixture, completely covering the mixture. Set skillet aside.",
        "Melt 1/2 cup butter in small skillet over low heat until the butter begins to brown and release a nutty fragrance, about 5 minutes. Watch carefully, butter burns easily. Remove from heat and let cool for 10 minutes.",
        "Whisk together flour, cardamom, salt, baking powder, and white sugar in a large bowl. Whisk in egg and cold milk until just combined. Pour in melted butter and stir to mix thoroughly.",
        "Pour batter over the pineapple slices in the skillet; spread evenly to cover.",
        "Bake in preheated oven until the cake begins to bubble around the edges, the top is browned, and a toothpick inserted into the center comes out clean, about 30 to 35 minutes. Let cool in the skillet for 10 minutes.",
        "Loosen the cake from the skillet by running a knife around the inside edge of the cake. Invert a large plate over the top of the skillet and flip over, releasing the cake to show the pineapple slices on top."
    ],
    "ingredients": [
        "1/4 cup butter",
        "3/4 cup light brown sugar",
        "1 tablespoon pineapple juice",
        "1 tablespoon dark rum (optional)",
        "1/2 small fresh pineapple - peeled, cored, and sliced",
        "1/2 cup butter",
        "1 1/2 cups all-purpose flour",
        "1/8 teaspoon ground cardamom",
        "1/2 teaspoon salt",
        "2 teaspoons baking powder",
        "1/2 cup white sugar",
        "1 egg",
        "1/2 cup cold milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pineapple Upside-Down Cake",
    "url": "http://allrecipes.com/recipe/220596/chef-johns-pineapple-upside-down-cak/"
}
