{
    "directions": [
        "Place potato in microwave and cook on high setting until cooked through, about 7 minutes depending on the size of the potato.",
        "Split potato and remove flesh. Push flesh through strainer using the back of a wooden spoon in order to achieve a granular texture. Add a pinch of salt and let cool for about 10 minutes. Pour in beaten egg and stir, using the tines of a fork and trying not to mash the potato. Add about 1/3 cup flour and continue gently stirring gently with the tines of a fork until mixture starts to come together. You may need another pinch or two of flour. Fold mixture with a spatula until dough forms a mass, adding flour as needed. Using your fingers, knead dough gently to form ball, about 10 seconds.",
        "Shape dough into a fat log shape on a floured surface. Cut into 4 pieces. Gently roll each piece using your fingertips to form the \"snake\" or a long rope of dough, starting from the center and rolling toward the end until dough is about 1/2 inch thick. Cut each rope of dough into 1/2-inch pieces.",
        "Roll each 1/2-inch piece quickly down the back of a fork's tines to form ridges.",
        "Heat sauce in a skillet while you cook the gnocchi.",
        "Bring a large pot of salted water to a boil. Reduce heat so water continues to simmer. Add gnocchi to water. As soon as they float to the surface after half a minute or so, cook for an additional 14 seconds. Transfer cooked gnocchi with a slotted spoon to the pan with the sauce. Stir until coated.",
        "Serve topped with grated cheese."
    ],
    "ingredients": [
        "1 large russet potato",
        "1 egg, beaten",
        "1/2 cup all-purpose flour, plus more as needed",
        "1 cup marinara sauce, heated, or more as needed, divided",
        "Freshly grated Parmigiano-Reggiano cheese, for serving"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Potato Gnocchi",
    "url": "http://allrecipes.com/recipe/255020/chef-johns-potato-gnocchi/"
}
