{
    "directions": [
        "Place black beans into a large bowl, cover with water, and soak overnight. Drain beans.",
        "Place drained beans in heavy pot with 2 quarts of water. Bring to a simmer over medium-high heat. Reduce heat to low and simmer until beans are cooked but very firm, 1 1/2 to 2 hours.",
        "Stir chopped dried beef into pot with beans. Add bay leaf and pork chop bones, stir and simmer on low heat for another 2 hours.",
        "Cook bacon in large dry skillet over medium heat until not quite crisp. Add linguica and Italian sausage links; cook, stirring often, until meats are brown, about 10 minutes. Remove browned meat, reserving accumulated fat in skillet. Slice Italian sausage into chunks.",
        "Brown onion and garlic in reserved drippings in the skillet over medium heat until onion is translucent and soft, stirring to deglaze the pan, about 5 minutes. Season with cumin, coriander, cayenne pepper, salt, and black pepper; add 1 tablespoon chopped Italian parsley. Cook and stir until parsley has wilted, about 2 minutes.",
        "Stir onion-spice mixture into pot with beans. Add cooked bacon, linguica sausage, Italian sausage, and pork chop chunks. Pour in enough water so meats are just covered with liquid. Increase heat to medium-high and bring to a simmer. Reduce heat to medium-low and cook uncovered until beans are very soft and liquid begins to thicken, about 1 hour, stirring occasionally. If beans begin to look dry, add more water.",
        "Heat olive oil in a skillet. Add bread crumbs and cook and stir until crumbs are toasted. Stir in 2 tablespoons Italian parsley and grated orange zest.",
        "When beans are cooked, ladle stew into bowls and top with the toasted crumb mixture."
    ],
    "ingredients": [
        "1 pound dry black beans",
        "2 quarts water, plus more as needed",
        "3 ounces dried beef, chopped",
        "1 bay leaf",
        "2 smoked pork chops, cut into large chunks, bones reserved",
        "4 ounces bacon, coarsely chopped",
        "12 ounces linguica sausage, cut into large chunks",
        "2 (4 ounce) links Italian sausage",
        "1 onion, chopped",
        "6 cloves garlic, minced",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1 pinch cayenne pepper, or to taste",
        "salt and ground black pepper to taste",
        "1 tablespoon chopped Italian parsley",
        "For the crumbs:",
        "1 tablespoon olive oil",
        "1/2 cup dry bread crumbs",
        "2 tablespoons chopped Italian parsley",
        "2 teaspoons grated orange zest"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Brazilian Feijoada",
    "url": "http://allrecipes.com/recipe/232437/chef-johns-brazilian-feijoada/"
}
