{
    "directions": [
        "Place chicken thighs in bowl of a food processor. Add breadcrumbs, kosher salt, paprika, pepper, seafood seasoning, and cayenne pepper. Drizzle in hot sauce and melted butter. Pulse on and off until mixture becomes a course paste with very few big chunks, about 18 pulses.",
        "Line a rimmed baking sheet with a silicon mat. Scoop out 24 portions of the chicken mixture with a small ice-cream scoop and place on mat. Cover sheet with plastic wrap. Refrigerate until thoroughly chilled. (Or place pan in freezer for 15 minutes.)",
        "Line a rimmed baking sheet with parchment paper.",
        "Place cornstarch, self-rising flour, and salt into a quart-size zip-top plastic bag. Shake bag to mix thoroughly. Place 3 or 4 scoops of chilled chicken mixture into the bag; shake gently to coat and place on parchment-lined pan. Repeat with the rest of the nuggets. Shape them into flattened ovals, about 5/8-inch thick. Refrigerate pan overnight or until starch on surface is absorbed, flipping over once while they're in the fridge.",
        "Heat oil in a deep-fryer or large saucepan to 300 degrees F (150 degrees C).",
        "Fry nuggets in batches for 1 minute. Drain on a rack over a baking sheet; chill about 1 hour or until you're ready to serve them.",
        "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Fry the nuggets a second time in batches for 2 minutes. Drain on rack."
    ],
    "ingredients": [
        "1 1/2 pounds skinless, boneless chicken thighs",
        "2 tablespoons fine dry breadcrumbs",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon paprika",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon seafood seasoning (such as Old Bay®)",
        "1/2 teaspoon cayenne pepper",
        "1 tablespoon Buffalo-style hot pepper sauce (such as Frank's® RedHot)",
        "1 tablespoon melted butter",
        "Starch Coating:",
        "1/2 cup cornstarch",
        "1/3 cup self-rising flour",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Buffalo Chicken Nuggets",
    "url": "http://allrecipes.com/recipe/257073/chef-johns-buffalo-chicken-nuggets/"
}
