{
    "directions": [
        "Heat olive oil in a large saucepan over medium heat. Cook and stir sausage, mushrooms, onions, salt, and black pepper in hot oil until vegetables are softened and sausage is browned, 6 to 7 minutes.",
        "Stir chopped chicken to sausage mixture; cook and stir over medium-high heat until browned, about 5 minutes. Pour in wine and cook, stirring to remove any browned bits off the bottom of the pan, until most of the wine is evaporated, 2 to 3 minutes. Add tomatoes, chicken broth, and cream; simmer for 30 minutes. If needed, add water to create a thick sauce.",
        "Stir peppers, olives, and garlic into sauce. Continue to simmer until thickened, 15 to 20 minutes. Season with salt and pepper to taste and stir in parsley.",
        "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until nearly cooked, about 11 minutes. Drain.",
        "Combine sauce and cooked pasta, stir in cheese, cover and set aside until pasta has absorbed the sauce, 1 to 2 minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "4 ounces hot Italian ground sausage meat",
        "1 cup sliced mushrooms",
        "1 onion, sliced",
        "salt and ground black pepper to taste",
        "1 1/2 pounds skinless, boneless chicken thighs, roughly chopped",
        "1/2 cup Marsala wine",
        "1 (28 ounce) can whole Italian plum tomatoes (such as San Marzano), crushed",
        "1 cup chicken broth",
        "1/2 cup heavy whipping cream",
        "1/2 cup water, or as needed",
        "1 1/2 cups chopped hot and sweet peppers",
        "1/2 cup pitted and chopped kalamata olives",
        "3 cloves garlic, minced",
        "1/4 cup chopped Italian flat leaf parsley",
        "1 pound rigatoni",
        "1/2 cup grated Parmigiano-Reggiano or Romano cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Chicken Riggies",
    "url": "http://allrecipes.com/recipe/229455/chef-johns-chicken-riggies/"
}
