{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Oil a large roasting pan with vegetable oil. Place celery, onions, and carrots in the pan. Drizzle tomato paste over the vegetables; toss together. Arrange chicken wings and beef shanks on the vegetables.",
        "Bake in preheated oven 45 minutes. Turn chicken and beef pieces. Continue roasting until mixture is very well browned and even a bit charred here and there, another 30 to 40 minutes.",
        "Transfer mixture to a large stock pot along with pan juices. Add 6 quarts cold fresh water, bay leaf, and peppercorns. Bring to a simmer over high heat; reduce heat to low to maintain a gentle simmer with small bubbles and very little movement. Simmer until meat is falling off the bone and flavor is extracted from the chicken and beef, 12 to 14 hours. Remove from heat.",
        "Strain out all solids. Return pot to heat and bring to a simmer over medium-high heat. Reduce to about 2 quarts, or by 50 percent. Strain liquid though a strainer into a container; press down solids in strainer to extract all the liquid.",
        "Bring to room temperature before covering; refrigerate.  When demi-glace has solidified, gently use a spatula to scrape off any fat that has collected at the top."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=undefined",
    "ingredients": [
        "1 tablespoon vegetable oil",
        "3 ribs celery, chopped",
        "2  onions, chopped (including skins)",
        "2  carrots, chopped",
        "3 tablespoons tomato paste",
        "5 pounds whole chicken wings",
        "3 (1 inch thick) slices beef shank",
        "6 quarts cold water",
        "1  bay leaf",
        "½ teaspoon whole black peppercorns"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Cheater Demi-Glace",
    "url": "http://allrecipes.com/recipe/254275/chef-johns-cheater-demi-glace/"
}