{
    "directions": [
        "Heat vegetable oil in a skillet over medium heat. Cook duck legs in the hot oil, skin-side down, until duck legs are browned and skillet contains rendered duck fat, about 10 minutes on the skin side. Flip and cook 3 to 4 minutes on the meat side. Remove duck legs from skillet, leaving rendered duck fat in the skillet.",
        "Whisk 1 cup flour into the duck fat, adding enough vegetable oil to make the flour mixture a thick and smooth roux. Turn heat to medium-low and cook the roux, stirring constantly, until it turns a rich reddish-brown color, about 40 minutes. Whisk 2 more tablespoons flour into roux and cook for 2 minutes.",
        "Whisk chicken broth into roux, 1 cup at a time, until all broth has been incorporated. Remove roux mixture from heat.",
        "Brown andouille sausage in a large Dutch oven over medium heat, about 8 minutes; stir in onion, peppers, celery, and 4 green onions, cooking until onion is translucent, about 10 minutes. Stir thyme, bay leaf, black pepper, and cayenne pepper into sausage mixture, followed by diced tomatoes. Stir to combine.",
        "Place smoked ham hock into the center of the sausage and vegetables. Pour roux mixture over ham hock along with enough water to cover. Place duck legs into mixture. Bring to a simmer, turn heat to low, and cover with a lid set at an angle to let steam out. Simmer slowly, stirring occasionally until duck and ham hock meat are tender, about 4 hours. Skim as much fat as possible off the top as it simmers.",
        "Remove duck and ham hock to a bowl and let cool. Stir pickled okra into gumbo. Pick meat from duck legs and pork hock and return meat to the gumbo. Simmer gumbo for 45 more minutes.",
        "Turn heat to medium-high, bring gumbo to a boil, and stir in shrimp and crawfish tails. Cook until shrimp and crawfish tails are bright pink, about 3 minutes. Stir in 1 tablespoon green onion, taste and adjust seasoning, and serve."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil, or more as needed",
        "2 duck legs",
        "1 cup all-purpose flour",
        "2 tablespoons all-purpose flour",
        "6 cups chicken broth",
        "1 pound andouille sausage, thickly sliced",
        "1 large onion, chopped",
        "1 cup diced peppers",
        "1 cup chopped celery",
        "4 green onions, chopped",
        "1/2 teaspoon dried thyme",
        "1 bay leaf",
        "1 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1 cup diced fresh tomatoes",
        "1 smoked ham hock",
        "2 cups water, or as needed",
        "1 cup pickled okra, rinsed and sliced",
        "1 pound gulf shrimp",
        "1 pound crawfish tail meat",
        "1 tablespoon chopped green onion (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Duck, Sausage, and Shrimp Gumbo",
    "url": "http://allrecipes.com/recipe/235356/chef-johns-duck-sausage-and-shrimp/"
}
