{
    "directions": [
        "Trim ends of eggplant; peel, leaving stripes of skin intact. Cut eggplant in half lengthwise and slice crosswise into 1/4-inch slices. Transfer to a large bowl. Add sliced zucchini to bowl. Toss eggplant and zucchini with 2 tablespoons kosher salt and let sit until water begins to release, about 15 minutes.",
        "Whisk olive oil, garlic, chili flakes, and dried oregano together in a bowl.",
        "Rinse salt from veggies in a colander with fresh water. Set aside to drain well.",
        "Place vinegar and water into a saucepan. Bring to a boil over high heat. Place drained vegetables into pan. Cook covered until softened and translucent, about 5 minutes, turning after the first minute. Remove from heat; transfer to a strainer reserving the cooking liquid.",
        "Place cooked eggplant and zucchini into large bowl. Add chopped roasted peppers, 1/4 cup of the vinegar cooking liquid, freshly chopped Italian parsley and fresh oregano. Pour in garlic oil mixture. Stir gently but thoroughly with a spatula. Cover with plastic wrap and refrigerate for at least 6 hours.",
        "Before serving, drizzle vegetable oil over the mixture."
    ],
    "ingredients": [
        "1 large eggplant",
        "1 large zucchini, halved lengthwise, then sliced lengthwise 1/4 inch thick",
        "2 tablespoons kosher salt",
        "2 cloves finely crushed garlic",
        "1/2 cup olive oil",
        "1/2 teaspoon crushed red pepper flakes, or to taste",
        "1/4 teaspoon dried oregano",
        "1 cup white wine vinegar",
        "2/3 cup water",
        "3/4 cup peeled and sliced roasted sweet and/or hot peppers",
        "1 tablespoon freshly chopped Italian parsley",
        "1 tablespoon chopped fresh oregano",
        "Kosher salt and freshly ground black pepper, to taste",
        "2 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Eggplant Escabeche",
    "url": "http://allrecipes.com/recipe/255281/chef-johns-eggplant-escabeche/"
}
