{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Line two baking sheets with parchment paper or silicone baking mats.",
        "Heat currants and coffee liqueur in a saucepan over low heat until it begins to simmer, about 2 minutes. Remove from heat and set aside.",
        "Combine unsweetened chocolate, bittersweet chocolate, and butter in bowl. Place bowl on top of a saucepan filled with 1-inch of water set over low heat. Stir chocolate mixture occasionally until melted, about 5 minutes. Remove from heat and set aside.",
        "Mix flour, black pepper, baking powder, salt, cinnamon, and cayenne pepper in large bowl and set aside.",
        "Whisk sugar and eggs in a small bowl until light, fluffy, and pale yellow, about 5 minutes. Slowly whisk in vanilla and melted chocolate mixture.",
        "Fold flour mixture into sugar and chocolate mixture until combined.",
        "Stir in dark chocolate chips and liqueur-soaked currants.",
        "Drop spoonfuls of cookie dough 2 inches apart onto prepared baking sheets.",
        "Bake in the preheated oven until cookies are almost set, about 12 minutes.",
        "Remove from the oven and leave on baking sheets to cool, 5 minutes.",
        "Transfer to cooling rack and allow to finish cooling, 5 minutes."
    ],
    "ingredients": [
        "1/2 cup dried currants",
        "2 tablespoons coffee flavored liqueur (such as Kahlua®)",
        "4 ounces unsweetened chocolate",
        "2 ounces bittersweet chocolate",
        "3 tablespoons unsalted butter",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon cayenne pepper",
        "3/4 cup sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1 cup dark chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Chili Chocolate Cookies",
    "url": "http://allrecipes.com/recipe/221149/chef-johns-chili-chocolate-cookies/"
}
