{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Mix rosemary, garlic, and olive oil in a bowl. Rub standing rib roast with mixture and season liberally with kosher salt and black pepper.",
        "Heat an 11-inch cast-iron skillet over medium-high heat until skillet is very hot. Brown standing rib roast on all sides in the hot skillet, 3 to 5 minutes per side. Remove meat from skillet. Cook and stir carrots, celery, and onions in the hot skillet until slightly browned; stir beef broth into vegetables. Place roast on top of vegetables in skillet.",
        "Roast meat in the preheated oven until an instant-read meat thermometer inserted into the middle reads 120 degrees F (49 degrees C), about 2 1/2 hours.",
        "Transfer roast from skillet to a serving platter, retaining pan drippings and vegetables; let rest at least 30 minutes before slicing.",
        "About 15 minutes before serving, combine red wine with dried cherries in a saucepan over medium heat; bring to a boil and reduce heat to low. Simmer until cherries have absorbed all the wine, about 10 minutes, stirring occasionally; remove from heat.",
        "Melt butter in a separate saucepan over medium heat and whisk flour into hot butter to make a paste. Strain reserved pan juices into cherries using a fine mesh strainer. Bring cherry sauce with pan juices to a boil. Stir flour paste into sauce, reduce heat to low, and simmer until thickened, about 5 minutes. Season sauce with salt and black pepper. Serve sauce with roast."
    ],
    "ingredients": [
        "4 sprigs fresh rosemary, chopped",
        "4 cloves garlic, chopped",
        "2 tablespoons olive oil",
        "1 (6 pound) standing beef rib roast",
        "kosher salt and ground black pepper to taste",
        "3 carrots, chopped",
        "3 ribs celery, chopped",
        "2 small onions, chopped",
        "2 cups low-sodium beef broth",
        "2 cups Cabernet Sauvignon wine",
        "4 ounces dried cherries",
        "2 2/3 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef James Holiday Prime Rib with Cabernet and Dried Cherry Sauce",
    "url": "http://allrecipes.com/recipe/230813/chef-james-holiday-prime-rib-with-cab/"
}
