{
    "directions": [
        "Stir espresso and 2 tablespoons Marsala wine together in a shallow bowl.",
        "Whisk egg yolks, 2 tablespoons plus 1 teaspoon sugar, and 1 tablespoon Marsala wine together in the top of a double boiler over simmering water, until thick, pale yellow, and creamy, 5 to 6 minutes.",
        "Whisk egg yolk mixture, mascarpone cheese, vanilla extract, and salt together in a bowl until completely smooth.",
        "Beat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Gently stir and fold 1/2 the egg whites into egg yolk mixture; fold in remaining 1/2 egg whites.",
        "Place 1 heaping spoonful mascarpone mixture into a single-serving cup or glass. Dip 2 ladyfinger cookie halves briefly in espresso mixture and turn 3 to 4 times to coat. Place cookie halves in the bottom of the glass on top of mascarpone.",
        "Fill the glass halfway with mascarpone mixture. Dip 5 ladyfinger halves in the espresso mixture and place vertically along the inside of the glass, dipping and placing more ladyfinger halves as necessary to fit the glass. Place 2 dipped ladyfinger halves horizontally on top of the mascarpone mixture. Fill glass to the top with mascarpone mixture. Repeat for the second serving glass.",
        "Wrap both glasses in plastic wrap and refrigerate for at least 8 hours or overnight. Remove plastic wrap and dust tops with cocoa powder and grated chocolate."
    ],
    "ingredients": [
        "1/2 cup brewed espresso",
        "3 tablespoons Marsala wine, divided",
        "2 eggs, separated",
        "2 tablespoons white sugar",
        "1 teaspoon white sugar",
        "3/4 cup mascarpone cheese",
        "1/2 teaspoon vanilla extract",
        "1 pinch salt",
        "10 ladyfinger cookies, broken in half, or more as needed",
        "1 tablespoon cocoa powder",
        "1/2 ounce dark chocolate, grated"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Tiramisu",
    "url": "http://allrecipes.com/recipe/236604/chef-johns-tiramisu/"
}
