{
    "directions": [
        "Preheat oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Place red bell peppers with cut sides down onto the prepared baking sheet. Cook under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place the blackened peppers into a bowl and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Remove and discard skins.\n                                    Watch Now",
        "Bring a large pot of lightly salted water to a boil. Add Fresno and habanero chiles and cook uncovered over medium heat until vegetables start to soften, about 3 minutes; drain and set aside to cool. Remove seeds and membranes from chiles (wear gloves); set aside.\n                                    Watch Now",
        "Shake coriander and caraway seeds in a skillet over medium heat until you start to smell the spice, about 2 minutes. Use a mortar and pestle to crush toasted seeds; add cumin, mint, and salt, and crush until finely ground. Transfer spices to a blender and add roasted bell peppers, chiles, garlic, lemon juice, and vegetable oil; puree until smooth. Drizzle in extra-virgin olive oil at the end, blending for only a few seconds.\n                                    Watch Now"
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/5097975.jpg",
    "ingredients": [
        "2 red bell peppers, halved and seeded",
        "6 Fresno chile peppers",
        "1 habanero pepper",
        "2 tablespoons vegetable oil",
        "1/4 teaspoon caraway seeds, or more to taste",
        "1/4 teaspoon coriander seeds, or more to taste",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon dried mint",
        "1 teaspoon kosher salt, or to taste",
        "4 garlic cloves, peeled",
        "1 lemon, juiced",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Harissa Sauce",
    "url": "http://allrecipes.com/recipe/223301/chef-johns-harissa-sauce/"
}