{
    "directions": [
        "Place 1 cup tarragon, shallots, and peppercorns in a saucepan. Pour in white wine vinegar, white wine, and water. Place over medium-high heat and bring to a simmer; stir. Reduce heat to medium-low to maintain a gentle simmer and reduce liquid to about 3 tablespoons, 20 to 30 minutes. Remove from heat. Strain into a bowl through a fine mesh strainer, pressing vegetable/herb mixture to extract as much liquid as possible.",
        "Place 1/4 cup chopped tarragon and capers in a mortar. Mash with a pestle about 1 minute. Add 1 tablespoon cold butter. Mash and pound with pestle until ingredients are thoroughly combined in a solid mass. Transfer to a piece of plastic wrap; wrap and chill.",
        "Place egg yolks in a stainless steel (flameproof) mixing bowl; add 3 tablespoons tarragon/shallot reduction; whisk together. Add cold butter cubes. Place bowl over low to medium heat whisking constantly until sauce thickens, as you hold the bowl with a kitchen towel. After butter melts continue whisking; mixture will turn a lighter yellow color after 8 to 10 minutes. When mixture is nice and thick, reduce heat to low and stir in compound butter broken into chunks. Continue whisking. Remove from heat. Season with salt, cayenne pepper, and black pepper."
    ],
    "ingredients": [
        "Reduction:",
        "1 cup fresh tarragon leaves, coarsely chopped",
        "1/2 cup thinly sliced shallots",
        "1 teaspoon whole black peppercorns",
        "1/2 cup white wine vinegar",
        "1/2 cup white wine",
        "1/3 cup water",
        "Compound Butter:",
        "1/4 cup chopped fresh tarragon",
        "1 teaspoon drained capers",
        "1 tablespoon cold unsalted butter",
        "Bearnaise:",
        "2 large egg yolks",
        "3 tablespoons tarragon-vinegar reduction",
        "8 tablespoons cold unsalted butter",
        "1 tablespoon caper-tarragon compound butter",
        "salt and cayenne pepper to taste",
        "freshly ground black pepper (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Bearnaise Sauce",
    "url": "http://allrecipes.com/recipe/256569/chef-johns-bearnaise-sauce/"
}
