{
    "directions": [
        "Place slices of beef on a work surface, Season both sides with kosher salt and pepper. Spread one side with mustard. Place bacon strips on the mustard and sprinkle with paprika. Arrange onion slices cross-wise on the beef. Then evenly space 3 pickle slices across each slice of beef. Keep about an inch of the narrowest end of the beef slice free of toppings to facilitate rolling it up.",
        "Roll each slice of meat, beginning from the wider of the two short ends, working to keep all ingredients inside the roll. Rolls should be nice and tight. Secure the rolls (seam side down) with 3 loops of butcher's twine, one in the middle and one at each end. Trim excess string.",
        "Heat vegetable oil over medium-high heat in a large saucepan. Cook beef, turning and browning well on all sides, about 8 minutes. Remove meat from pan. Reduce heat to medium-low. Melt butter in the pan; whisk in the flour, cooking for about 1 minute. Pour in cold beef broth and whisk vigorously to combine. Raise heat to medium-high and simmer until sauce begins to thicken, about 1 minute.",
        "Transfer beef rolls to pan along with accumulated juices. Reduce heat to very low. Simmer gently, covered, turning rolls every 20 minutes or so, until beef is tender, about 1 1/2 hours. When the tip of a sharp knife can easily be inserted into the beef roll, the meat is done.",
        "Transfer meat to dish to allow it to rest. Raise heat to high and bring cooking liquid to a simmer to thicken slightly to make a gravy, about 1 minute. Serve rouladen with gravy."
    ],
    "ingredients": [
        "2 (6 ounce) (1/4 inch thick) slices of beef round",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 tablespoons Dijon mustard",
        "4 strips bacon",
        "paprika, or to taste",
        "1/2 onion, sliced into half-rings and separated",
        "6 dill pickle spears",
        "1 tablespoon vegetable oil",
        "Gravy:",
        "2 tablespoons butter",
        "1/4 cup all-purpose flour",
        "3 cups beef broth",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Beef Rouladen",
    "url": "http://allrecipes.com/recipe/244200/chef-johns-beef-rouladen/"
}
