{
    "directions": [
        "Dissolve yeast and 1/2 teaspoon sugar in warm water in a large bowl. Let stand until the yeast softens and begins to form a creamy foam, about 10 minutes.",
        "Whisk 3/4 cup sugar, eggs, oil, anise extract, lemon zest, lemon extract, salt, and anise seed together in a bowl.",
        "Pour egg mixture, melted butter, and milk into yeast mixture and stir to combine. Add 4 cups flour, 1 cup at time, stirring after each addition.",
        "Turn dough out onto a floured surface and knead until smooth and elastic, adding remaining 1/2 cup flour as necessary, 5 to 6 minutes.",
        "Coat a large bowl with oil. Place dough in bowl and turn to coat. Place a damp cloth over the bowl, place bowl in the oven with the oven light on, and let rise until doubled in size, 12 hours or overnight.",
        "Line 2 baking sheets with silicone baking mats or parchment paper.",
        "Punch dough down and divide into four equal portions. Divide each portion into three ropes. Braid each set of three dough ropes to form four small braided loaves. Transfer loaves to prepared baking sheets, 2 per sheet, and let rise until doubled in size, about 2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake bread in the preheated oven until the tops are golden and the bottom of the loaves sound hollow when tapped, 20 to 25 minutes."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1/2 teaspoon white sugar",
        "1/4 cup warm water (100 degrees F/38 degrees C)",
        "3/4 cup white sugar",
        "4 eggs",
        "2 tablespoons vegetable oil",
        "1 1/2 tablespoons anise extract",
        "1 tablespoon lemon zest",
        "1 1/2 teaspoons lemon extract",
        "1 1/4 teaspoons salt",
        "1 teaspoon anise seed",
        "6 tablespoons melted butter",
        "1/4 cup milk",
        "4 1/2 cups all-purpose flour, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Easter Bread",
    "url": "http://allrecipes.com/recipe/236803/chef-johns-easter-bread/"
}
