{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Bring a large pot of generously salted water to a boil. Add the vegetables, and cook uncovered for 3 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the vegetables are cold, drain well, and set aside.",
        "Cook garlic and butter in a large skillet over medium heat until garlic starts sizzling, about 3 minutes.",
        "Stir in chicken broth, heavy cream, thyme, nutmeg, and cayenne pepper; cook until mixture begins to simmer, about 5 minutes.",
        "Coat a 9x13-inch baking dish with olive oil and spread vegetables evenly over the oil.",
        "Pour broth and cream mixture over vegetables and top with half of the grated Parmigiano-Reggiano cheese.",
        "Cover baking dish loosely with aluminum foil, place on a baking sheet, and bake in the preheated oven for 40 minutes.",
        "Remove baking dish from the oven and top with remaining Parmigiano-Reggiano. Bake uncovered until vegetables are browned, bubbling, and tender, about an additional 30 minutes.",
        "Remove from the oven and let rest for 20 minutes."
    ],
    "ingredients": [
        "2 Yukon Gold potatoes, scrubbed and sliced 1/8-inch thick with peel",
        "1 turnip, peeled and sliced 1/8-inch thick",
        "1 rutabaga, peeled and sliced 1/8-inch thick",
        "1 small celery root, peeled and sliced 1/8-inch thick",
        "1 parsnip, peeled and sliced 1/8-inch thick",
        "salt, to taste",
        "3 cloves garlic, minced",
        "2 tablespoons butter",
        "1 1/4 cups chicken broth",
        "1 cup heavy cream",
        "1 tablespoon chopped fresh thyme",
        "1 pinch ground nutmeg",
        "1 pinch cayenne pepper",
        "2 teaspoons olive oil",
        "1/4 cup finely grated Parmigiano-Reggiano cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Root Vegetable Gratin",
    "url": "http://allrecipes.com/recipe/221998/chef-johns-root-vegetable-gratin/"
}
