{
    "directions": [
        "Lay a game hen breast side-down on a work surface; use kitchen shears or a sharp knife to cut the backbone out of the game hen, cutting through each side of the bone from top to bottom. Remove the backbone. Use a sharp knife to slice through the cartilage of the breastbone. Flip game hen breast side-up, flatten bird lightly with your hands, and twist the wing tips underneath the wings. Repeat for remaining game hen.",
        "Place white wine vinegar, vegetable oil, rosemary, orange juice, garlic, egg, Calabrian chili sauce, orange zest, kosher salt, and anchovy fillet into a blender. Pulse several times to combine; blend until marinade is smooth and creamy.",
        "Place game hens into a resealable heavy plastic bag and pour in marinade. Squeeze out air, seal bag, and refrigerate at least 4 hours but preferably 8 hours to overnight.",
        "Preheat grill for medium heat and lightly oil the grate.",
        "Remove game hens from marinade, reserving marinade. Dry birds on paper towels. Season breast sides with salt.",
        "Place game hens with breast sides down onto the preheated grill and cook until skin shows browned grill marks, about 5 minutes; rotate hens 45 degrees and grill 5 more minutes to make crosshatch grill marks.",
        "Flip game hens onto their backs, brush with reserved marinade, and grill with the lid on for 5 minutes. Brush hens with more marinade. Repeat, cooking 5 minutes, then brushing with more marinade, until game hens are deep golden brown and an instant-read meat thermometer inserted into the thickest part of a thigh reads 160 degrees F, about 35 more minutes. Flip hens breast sides down, brush once more with marinade, and cook with lid closed until marinade has glazed onto chicken, about 5 more minutes.",
        "Transfer hens to a serving platter, let rest for about 5 minutes, and serve."
    ],
    "ingredients": [
        "2 Cornish game hens",
        "1 cup white wine vinegar",
        "1/2 cup vegetable oil",
        "2 tablespoons fresh rosemary leaves",
        "2 tablespoons fresh orange juice",
        "4 cloves garlic, peeled",
        "1 egg",
        "1 tablespoon Calabrian hot chili sauce, or more to taste",
        "2 teaspoons grated orange zest",
        "1 1/2 teaspoons kosher salt",
        "1 anchovy fillet"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Calabrian Chicken",
    "url": "http://allrecipes.com/recipe/235567/chef-johns-calabrian-chicken/"
}
