{
    "directions": [
        "Stir pork, green onion, garlic, ginger, soy sauce, fish sauce, dry sherry, sriracha sauce, and sesame oil together in a large bowl until well-combined. Cover the bowl with plastic wrap and refrigerate meat mixture until chilled, 30 minutes to 1 hour.",
        "Heat vegetable oil over medium-high heat. Saute mushrooms in hot oil until golden and fragrant, about 10 minutes. Pour chicken stock over mushrooms; bring broth to a simmer.",
        "Place wonton wrappers on a flat work surface and drop about 1/2 teaspoon pork mixture into the center of each wonton. Brush egg white onto the border of each wrapper. Take the bottom corner and fold it up to the top corner to form a triangle and press edges with fingers to seal. Hold opposite ends of the triangle, center-tip facing down. Gently push down on meat pocket to form a flat base and fold triangle points together to form a tortellini shape.",
        "Stir bok choy into mushroom broth and return broth to a simmer. Add wontons to broth; cook until wontons are wrapper firms and meat is cooked through, 3 to 5 minutes."
    ],
    "ingredients": [
        "Wonton Filling:",
        "1 pound ground pork",
        "3 green onions, minced",
        "3 cloves garlic, crushed",
        "1 1/2 tablespoons freshly grated ginger",
        "1 tablespoon soy sauce",
        "1 tablespoon fish sauce",
        "1 tablespoon dry sherry",
        "1 teaspoon sriracha sauce",
        "1/4 teaspoon sesame oil",
        "Broth:",
        "2 teaspoons vegetable oil, or as needed",
        "4 ounces fresh shiitake mushrooms, stems removed and caps thinly sliced",
        "1 1/2 quarts chicken stock",
        "1 (10 ounce) package wonton wrappers, or as needed",
        "1 egg white, beaten",
        "1 head bok choy, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pork Wonton Soup",
    "url": "http://allrecipes.com/recipe/238589/chef-johns-pork-wonton-soup/"
}
