{
    "directions": [
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Fill a saucepan with 1/2-inch water; bring to a boil. Carefully place cold eggs into saucepan, cover the saucepan with a lid, reduce heat to medium-high, and cook until eggs yolks are soft, about 6 minutes. Remove from heat and pour cold water over eggs to halt the cooking process. Cool eggs to room temperature in cold water; peel and dry eggs on paper towels.",
        "Mix sausage, mustard, nutmeg, and cayenne pepper together in a bowl. Shape into 6 equal-size balls.",
        "Lay a piece of plastic wrap on a flat work surface. Place 1 ball of sausage mixture into the center of the plastic wrap, fold the plastic wrap over sausage, and flatten into an 1/8-inch thick oval shape. Pull plastic wrap back and place 1 egg in the center of the sausage. Pick up plastic wrap, moisten fingertips, and press sausage around egg to cover completely, sealing sausage around egg. Repeat with remaining eggs and sausage.",
        "Place bread crumbs in a shallow bowl. Pour flour into another shallow bowl. Beat remaining 2 eggs in another shallow bowl.",
        "Gently press eggs into flour to coat; shake off excess flour. Dip eggs into the beaten egg, then press into bread crumbs. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded eggs onto a plate.",
        "Working in batches, cook eggs in the preheated oil until golden, 5 to 6 minutes. Transfer to a wire rack to cool, at least 5 minutes."
    ],
    "ingredients": [
        "oil for frying",
        "6 cold large eggs",
        "21 ounces bulk Italian sausage",
        "1/4 teaspoon dry mustard",
        "1 pinch freshly grated nutmeg",
        "1 pinch cayenne pepper",
        "1 cup panko bread crumbs, or as needed",
        "1/2 cup all-purpose flour, or as needed",
        "2 eggs, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Scotch Eggs",
    "url": "http://allrecipes.com/recipe/242018/chef-johns-scotch-eggs/"
}
