{
    "directions": [
        "Bring a large saucepan of salted water and to a boil; add russet potatoes to boiling water and cook until very tender, about 20 minutes. Drain well. Mash in 3 tablespoons butter until thoroughly combined. Season with nutmeg, salt, black pepper, and cayenne pepper to taste. Mash 1/2 cup milk into potato mixture until smooth.",
        "Drizzle olive oil in a large Dutch oven over medium-high heat, add spinach, and season with a big pinch of salt. Cook, stirring occasionally, until spinach has wilted, about 1 minute. Transfer to a bowl lined with paper towels to wick away excess moisture.",
        "Heat 3 tablespoons butter and flour in a saucepan over medium heat; whisk mixture to a smooth paste. Cook, stirring constantly, until mixture has a nutty smell and is slightly browned, about 2 minutes. Add chopped garlic; whisk until fragrant, 10 to 20 seconds.",
        "Whisk 1 cup cold milk into flour mixture; cook until thickened. Whisk in remaining 1 cup milk and lemon zest. Bring white sauce to a gentle simmer, whisking constantly; season with salt. Turn heat to very low and keep sauce warm.",
        "Preheat oven to 375 degrees F (190 degrees C). Grease an 8x12-inch casserole dish with 1 tablespoon butter.",
        "Season buttered pan with salt, black pepper, and cayenne pepper. Lay boneless cod fillets into the pan in a single layer. Season tops of fillets with more salt, black pepper, and cayenne pepper. Spread spinach evenly over fish and drizzle with lemon juice. Spoon white sauce over spinach; give casserole dish several taps and shakes to eliminate bubbles.",
        "Drop mashed potatoes by heaping spoonfuls over the casserole and spread smoothly to cover. Place dish onto a rimmed baking sheet to catch spills.",
        "Bake in the preheated oven until bubbling, about 40 minutes. Turn on oven's broiler and broil until potato crust has a golden brown top, about 2 minutes. Fish should flake easily. Let stand 10 minutes before serving. Garnish with a sprinkle of chives."
    ],
    "ingredients": [
        "For potato crust:",
        "3 russet potatoes, peeled and cut into chunks",
        "3 tablespoons butter",
        "1 pinch freshly grated nutmeg",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1/2 cup milk",
        "For the spinach:",
        "2 teaspoons olive oil",
        "12 ounces baby spinach leaves",
        "For the sauce:",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "2 cloves garlic, minced",
        "2 cups cold milk, divided",
        "2 teaspoons lemon zest",
        "For the rest:",
        "1 tablespoon butter",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "2 pounds boneless cod fillets",
        "1/2 lemon, juiced",
        "1 tablespoon chopped fresh chives for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Fisherman's Pie",
    "url": "http://allrecipes.com/recipe/232750/chef-johns-fishermans-pie/"
}
