{
    "directions": [
        "Heat 2 tablespoons olive oil in a skillet over medium-high heat. Cook and stir diced onion with 1 teaspoon salt until onion is slightly translucent, about 5 minutes. Add eggplant, reduce heat to medium, and cook and stir until eggplant is opaque and softened, 3 to 5 minutes more.",
        "Stir garlic, 1 teaspoon black pepper, cumin, cinnamon, and oregano into eggplant mixture; cook and stir until fragrant, about 1 minute. Add tomato paste; cook and stir until heated through, about 2 minutes. Transfer mixture to a plate and cool completely. Cover plate with plastic wrap and refrigerate until chilled, at least 15 minutes.",
        "Whisk 1 1/2 tablespoons olive oil and flour together in a saucepan over medium-high heat until golden and bubbling, 2 to 3 minutes. Pour milk into butter-flour mixture, whisking constantly as it simmers and forms a smooth, thick sauce, 3 to 5 minutes. Season with nutmeg, a pinch black pepper, and a pinch cayenne pepper. Remove from heat and stir Parmesan cheese into milk mixture until melted.",
        "Combine lamb, chilled eggplant mixture, and a pinch of salt together in a bowl. Form into four patties and place on a plate. Cover the plate with plastic wrap and refrigerate until just before cooking.",
        "Place tomato slices in a shallow bowl. Season tomatoes with chopped mint, a pinch of salt, and a pinch of black pepper. Pour rice vinegar over the top and toss to coat.",
        "Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Cook burgers until slightly pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium.",
        "Spread desired amount of cheese sauce onto both sides of each hamburger bun. Place burger on bottom bun, place 2 tomato slices atop the burger, and place top half of the bun over the tomatoes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 yellow onion, diced",
        "1 teaspoon salt",
        "2 cups diced eggplant",
        "3 cloves garlic, crushed",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon cumin",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon dried oregano",
        "2 teaspoons tomato paste",
        "1 1/2 tablespoons olive oil",
        "2 tablespoons flour",
        "1 cup cold milk",
        "1 pinch ground nutmeg",
        "1 pinch cayenne pepper",
        "1 pinch freshly ground black pepper",
        "1/2 cup grated Parmesan cheese",
        "1 pound ground lamb",
        "salt to taste",
        "8 slices tomato",
        "1 tablespoon chopped fresh mint",
        "1 tablespoon rice vinegar",
        "1 tablespoon olive oil, or as needed",
        "4 hamburger buns, split and toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Lamb Moussaka Burger",
    "url": "http://allrecipes.com/recipe/236861/chef-johns-lamb-moussaka-burger/"
}
