{
    "directions": [
        "Place yeast into the work bowl of a stand mixer and add 1 cup warm water and 1 cup flour. Whisk together and let stand 15 to 20 minutes for mixture to rise and make a loose sponge. Mixture will bubble and foam.",
        "Pour 1 1/2 tablespoons olive oil and salt into sponge; add 1 3/4 cup flour. Mix at low speed, using a dough hook attachment, until dough is soft, supple, and slightly sticky. If dough sticks to the sides of the bowl, add up to 1/4 cup more flour, a little at a time.",
        "Knead dough with machine on low speed until slightly springy and still soft, 5 to 6 minutes. Turn dough out onto a floured work surface and form into a ball.",
        "Wipe inside of bowl with 1/4 teaspoon olive oil. Turn dough around in bowl to cover with a thin film of oil; cover bowl with foil and let sit until dough has doubled in size, about 2 hours.",
        "Remove dough from bowl and place onto a floured work surface. Lightly pat into a flat shape about 1 inch thick. Use a knife to cut dough into 8 pieces.",
        "Form each piece into a small round ball with a smooth top, pulling dough from the sides and tucking the ends underneath the bottom.",
        "Cover dough balls with lightly oiled plastic wrap and let rest for 30 minutes.",
        "Sprinkle a small amount of flour on a work surface and top of a dough ball; gently pat dough ball flat with your fingers, forming a flat, round bread about 1/4 inch thick. Let dough round rest for 5 minutes. Repeat with remaining dough balls.",
        "Brush a cast-iron skillet with remaining 3/4 teaspoon olive oil and place over medium-high heat. Lay pita bread into hot skillet and cook until bread begins to puff up and bottom has brown spots and blisters, about 3 minutes. Flip, cook 2 more minutes, and flip back onto original side to cook for about 30 more seconds. Pita bread will begin to puff up and fill with hot air. Stack cooked breads on a plate; when cool enough to handle, break breads in half and open the pocket inside for stuffing."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (90 to 100 degrees F/32 to 38 degrees C)",
        "1 cup all-purpose flour",
        "1 1/2 tablespoons olive oil",
        "1 3/4 teaspoons salt",
        "1 3/4 cups all-purpose flour, or more as needed",
        "1 teaspoon olive oil, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pita Bread",
    "url": "http://allrecipes.com/recipe/232719/chef-johns-pita-bread/"
}
