{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Grind salt, black pepper, cumin, rosemary, fennel, red pepper flakes, and oregano to a coarse powder using a mortar and pestle. Add 2 cloves garlic and mash to a paste. Mix in brown sugar, wine vinegar, and 1 tablespoon olive oil; stir until paste is thoroughly combined.",
        "Place pork chunks into a large roasting pan and spoon paste over meat; toss until meat coated.",
        "Bake pork in the preheated oven for 1 hour; flip pork chunks and continue cooking until outside of meat has a browned crust, about 30 more minutes. Set aside and keep warm.",
        "Pour 1 tablespoon olive oil into a skillet, place over medium heat, and add 2 sliced cloves of garlic; cook until garlic begins to sizzle, 1 minute. Stir beans into skillet and season with salt and red pepper flakes to taste; cook and stir until beans are heated through and coated with oil, 3 to 4 minutes. Pour in lemon juice and chicken stock and bring to a simmer. Mix arugula leaves into bean mixture and cook just until leaves are bright green, about 1 minute. Turn off heat and let mixture stand to allow arugula to wilt, about 1 more minute.",
        "Place wilted arugula into the bottom of a serving bowl and top with beans and a chunk of caramelized pork; drizzle juices over meat to serve."
    ],
    "ingredients": [
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon fennel seeds",
        "1/2 teaspoon red pepper flakes",
        "1/2 teaspoon dried oregano",
        "2 cloves garlic, sliced",
        "1 1/2 tablespoons brown sugar",
        "1 tablespoon wine vinegar",
        "1 tablespoon olive oil",
        "4 pounds boneless pork shoulder roast, cut into large pieces",
        "1 tablespoon olive oil",
        "2 cloves garlic, sliced",
        "1 (14 ounce) jar cannellini beans, drained and rinsed",
        "salt to taste",
        "1 pinch red pepper flakes, or to taste",
        "1 lemon, juiced",
        "2 tablespoons chicken stock",
        "1 large bunch of fully grown arugula leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pork and Beans and Greens",
    "url": "http://allrecipes.com/recipe/234537/chef-johns-pork-and-beans-and-greens/"
}
