{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil.",
        "Beat eggs in a small, shallow bowl. Mix flour, salt, black pepper, and cayenne pepper in a large shallow dish. Pour bread crumbs in another large shallow dish.",
        "Top one slice of eggplant with 1/4 slice provolone cheese, 3 slices salami, and 1/4 slice provolone cheese. Place an equally-sized slice of eggplant on top. Repeat with remaining eggplant slices, cheese, and salami.",
        "Gently press each eggplant sandwich into the seasoned flour to coat; shake off excess. Dip both sides of each sandwich into beaten egg, then press into bread crumbs. Place on the prepared baking sheet while you bread the remaining eggplant sandwiches.",
        "Drizzle 1 teaspoon olive oil in a circle about 3 inches in diameter onto the foil; place a breaded eggplant sandwich onto the oiled area. Sprinkle about 1 teaspoon Parmigiano-Reggiano cheese over the sandwich. Repeat with remaining 3 sandwiches, drizzling an area on the foil with olive oil, placing a sandwich onto the oil, and topping with Parmesan cheese. Drizzle tops of each sandwich with 1 teaspoon olive oil.",
        "Bake in the preheated oven for 10 minutes. Flip sandwiches and sprinkle 1 teaspoon Parmigiano-Reggiano cheese onto the top. Bake until browned and a paring knife inserts easily into the eggplant, 8 to 10 more minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "2 eggs",
        "1/2 cup all-purpose flour, or more as needed",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or more to taste",
        "1 cup dry bread crumbs",
        "8 slices of eggplant, cut 3/8 inch thick",
        "2 slices provolone cheese, cut into quarters",
        "12 thin slices salami",
        "2 2/3 tablespoons olive oil, divided",
        "2 2/3 tablespoons finely grated Parmigiano-Reggiano cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Baked Eggplant Sandwiches",
    "url": "http://allrecipes.com/recipe/231010/chef-johns-baked-eggplant-sandwiches/"
}
