{
    "directions": [
        "Place pork roast on a work surface. Use a sharp knife to make a lengthwise cut about 1 inch from the edge of the meat, slicing down but not cutting through. Open the meat flat along the cut. Keeping the knife parallel to the cutting board, continue to slice the roast open so you can unroll it into a large, flat piece. (You can also ask your butcher to butterfly the roast for you.) When the meat is unrolled, make small slashes through any connective tissue or extra-thick parts so the roast is as even in thickness as possible.",
        "Drizzle cut surface with 2 teaspoons olive oil. Rub oil into meat and generously season with 2 teaspoons kosher salt, black pepper, sage, rosemary, orange zest, garlic, and crushed fennel seeds. Press seasonings in firmly with your hand, roll up the pork roast, and tie the roast in several places with kitchen twine.",
        "Place the pork roast on a rack, set the rack on a plate, and sprinkle meat with remaining 1 teaspoon salt. Refrigerate the roast uncovered overnight to dry-age.",
        "Preheat oven to 450 degrees F (230 degrees C). Lightly oil a baking dish and place roast into dish. Rub meat with 2 teaspoons olive oil.",
        "Bake in the preheated oven until outside is seared, 15 minutes. Reduce oven heat to 250 degrees F (120 degrees C) and continue to roast until an instant-read meat thermometer inserted into the center of the roast reads 145 degrees F (65 degrees C), about 1 hour more. Loosely cover roast with foil and let rest for 10 minutes. Slice thinly to serve.",
        "Mash anchovy fillet in a small bowl and add red pepper flakes, white wine vinegar, and Italian parsley. Stir to combine. Serve drizzled on pork."
    ],
    "ingredients": [
        "1 (2 1/2 pound) boneless pork shoulder blade roast",
        "olive oil",
        "1 tablespoon kosher salt, divided",
        "1 tablespoon freshly ground black pepper",
        "2 tablespoons chopped fresh sage leaves",
        "2 tablespoons chopped fresh rosemary",
        "1 orange, zested",
        "6 cloves garlic, minced",
        "2 teaspoons fennel seeds, lightly crushed",
        "2 teaspoons olive oil",
        "Vinegar sauce:",
        "1/2 anchovy fillet",
        "1 teaspoon red pepper flakes, or to taste",
        "1/4 cup white wine vinegar",
        "1/4 cup chopped Italian parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Porchetta",
    "url": "http://allrecipes.com/recipe/235180/chef-johns-porchetta/"
}
