{
    "directions": [
        "Combine 1 1/2 cups boiling water, 3/4 cup brown sugar, 1/2 cup plus 1 tablespoon coarse kosher salt, black pepper, allspice, cloves, and bay leaf together in a large container; stir until the sugar and salt are dissolved. (See Cook's Note to substitute table salt.)",
        "Place celery, onion, and garlic in a blender. Add 2 cups cold water and puree until smooth. Pour celery mixture into kosher salt mixture and stir to combine. Add 1 quart of water, or more as needed, to make a total of 2 quarts of brine. Place pork chops in brine, cover, and refrigerate for 2 days.",
        "Combine 1/4 cup brown sugar, Dijon mustard, and cayenne pepper together in a small bowl and set glaze aside.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Remove pork chops from brine and pat dry; discard used brine. Cut shallow slits along the sides of each pork chop, about 1/4 inch deep. Cut a crisscross pattern in the top of each pork chop, creating small 1-inch triangles.",
        "Heat oil in a large, oven-proof skillet over high heat. Cook chops in the hot oil until browned, about 2 minutes on each side. Brush the crisscrossed top of each pork chop with about 1 tablespoon of glaze. Insert 3 whole cloves in the top of each pork chop.",
        "Transfer skillet to the preheated oven and roast pork chops until golden brown and slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove pork chops to a plate and discard cloves.",
        "Using a small butane hand torch, brown the tops of the pork chops by making short passes over the tops with the flame not quite touching."
    ],
    "ingredients": [
        "Brine:",
        "1 1/2 cups boiling water",
        "3/4 cup packed brown sugar",
        "1/2 cup kosher salt",
        "1 tablespoon kosher salt",
        "1 teaspoon finely ground black pepper",
        "1 teaspoon ground allspice",
        "1/2 teaspoon ground cloves",
        "1 bay leaf",
        "2 cups chopped celery",
        "1/2 yellow onion, chopped",
        "3 cloves garlic, peeled",
        "2 cups water",
        "1 quart water, or as needed",
        "4 (1 1/2 inches thick) boneless center-cut pork loin chops",
        "Glaze:",
        "1/4 cup packed brown sugar",
        "2 tablespoons Dijon mustard",
        "1 pinch cayenne pepper, or more to taste",
        "1 tablespoon vegetable oil",
        "12 whole cloves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Mini Christmas Hams",
    "url": "http://allrecipes.com/recipe/230566/chef-johns-mini-christmas-hams/"
}
