{
    "directions": [
        "Combine peanut butter, lime juice, and 1 teaspoon Asian chile pepper sauce in a small bowl; stir until thoroughly combined.",
        "Mix carrot, cucumber, and jalapeno pepper in a bowl; stir in fish sauce and rice vinegar. Set aside.",
        "Mix garlic, coconut milk, cumin, turmeric, and 1 teaspoon Asian chile pepper sauce in a bowl. Add bread crumbs and soy sauce to the mixture. Stir in ground chicken and basil until thoroughly combined. Mixture will be soft.",
        "Break off a small piece of chicken mixture and fry in a nonstick skillet over medium heat until chicken is browned and no longer pink. Taste the little cooked piece and season the raw chicken mixture to taste with salt and cayenne pepper. Do not eat raw chicken mix.",
        "Spoon 1/4 the chicken mixture into skillet, forming it into a patty shape, and cook until bottom of patty is browned, about 5 minutes. Flip patty and cook until other side is browned and chicken mixture is no longer pink inside, about 5 more minutes. Repeat with remaining chicken to make 3 more patties.",
        "Spread about 1 teaspoon of peanut spread onto each bun half; top bun bottoms with a chicken patty, about 1/4 cup of the carrot slaw, and 1 tablespoon of cilantro leaves. Place tops of buns on burgers to serve."
    ],
    "ingredients": [
        "2 tablespoons peanut butter",
        "1 teaspoon lime juice",
        "1 teaspoon Asian chile pepper sauce (such as sambal oelek), or to taste",
        "1/2 cup carrots cut into thin matchsticks",
        "1/2 cup cucumber cut into thin matchsticks",
        "2 tablespoons jalapeno peppers cut into thin matchsticks",
        "1 tablespoon seasoned rice vinegar",
        "2 teaspoons fish sauce",
        "3 cloves garlic, minced",
        "1 1/2 tablespoons coconut milk",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon ground turmeric",
        "1 teaspoon Asian chile pepper sauce (such as sambal oelek)",
        "1 tablespoon dry bread crumbs",
        "2 teaspoons soy sauce",
        "1 pound ground chicken",
        "2 tablespoons chopped fresh basil",
        "salt",
        "1 pinch cayenne pepper, or to taste",
        "1/4 cup cilantro leaves",
        "4 hamburger buns"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Chicken Satay Burger",
    "url": "http://allrecipes.com/recipe/236032/chef-johns-chicken-satay-burger/"
}
