{
    "directions": [
        "Rinse soaked beans and drain.",
        "Pour broth into a large pot. Add chopped pancetta, bones from duck confit, and the drained beans. Tie bay leaves, peppercorns, thyme sprigs, and garlic into a small square of cheesecloth to create the bouquet garni; add to the pot. Stir. Bring to a simmer over high heat; skim foamy scum that forms, if desired. Reduce heat to low until beans are almost tender, 30 to 45 minutes.",
        "Sprinkle pork pieces with salt and pepper. Heat oil in a skillet over medium-high heat; brown the pork pieces, 3 to 5 minutes. Transfer to a bowl. Add sausage to the skillet and cook in the same oil, turning until nicely browned on all sides, 3 to 4 minutes. Cut sausages in half and transfer to bowl with pork pieces.",
        "Remove fat and skin from duck confit and add them to the same skillet. Cook over medium heat until fat is rendered, about 3 minutes. Transfer all fat and browned pieces from the skillet to a mixing bowl. Add melted butter. Stir in bread crumbs and chopped parsley; stir until mixture looks like damp sand. Mix in about 1/4 to 1/2 cup broth.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place onions, carrots, and celery in the same skillet used to brown the meats; add pinch of salt. Cook and stir over medium heat until onions are translucent and mixture turns golden, 5 to 7 minutes. Stir in tomato paste; cook and stir until tomato paste starts to caramelize and stick to the bottom of the pan, 3 or 4 minutes. Pour in white wine; cook and stir until most of the wine evaporates, 5 or 6 minutes. Remove from heat.",
        "Drain beans over a large bowl to retain all the cooking liquid. Remove bones and bouquet garni.",
        "Place drained beans in large shallow baking dish or cast iron skillet (about 12 inches in diameter and 3 inches deep). Stir in cooked vegetables and about 1 cup broth. Add pork pieces and distribute evenly among the beans. Top with the shredded duck confit. Nestle the sausage halves into the bean mixture.",
        "Ladle cooking liquid into the baking dish until beans are nearly submerged. Spread bread crumb mixture evenly over the top but don't press into the liquid. Use your fingertips to make gentle indentations on the crumb surface for better browning.",
        "Bake in preheated oven until most of the liquid has been absorbed, about 2 hours. Remove from oven and create a small \"well\" in the center of the cassoulet crust. Ladle about 1/2 cup of the cooking liquid (or as needed) into the well to rehydrate mixture. Use a fork to gently poke into the cassoulet to ensure the liquid is fairly evenly distributed but try not to disturb the crusty surface.",
        "Continue baking until cassoulet surface is crispy and caramelized, the meat is fork tender, and the beans are creamy and tender, about 30 to 45 more minutes.",
        "Serve in large bowls with a spoonful or 2 of hot cooking liquid. Top with chopped fresh parsley."
    ],
    "ingredients": [
        "Beans and Cooking Liquid:",
        "1 pound Tarbais beans, or other white beans, soaked overnight",
        "3 quarts seasoned chicken stock or broth",
        "4 ounces pancetta, cut into 1/4-inch dice",
        "2 bay leaves",
        "1 teaspoon black peppercorns",
        "6 sprigs thyme",
        "6 unpeeled garlic cloves, cut in half",
        "Reserved bones from duck confit and pork, if available",
        "Other Meat:",
        "12 ounces fresh pork shoulder or chop, cut into 2-inch pieces",
        "Salt and freshly ground black pepper",
        "1 tablespoon vegetable oil",
        "1 1/2 pounds Toulouse sausages, or other garlic pork sausage",
        "2 duck leg confit",
        "Veggies:",
        "1 cup diced onion",
        "1/2 cup diced carrot",
        "1/2 cup diced celery",
        "1/4 cup tomato paste",
        "3/4 cup white wine",
        "1 teaspoon salt",
        "Crumb Topping:",
        "2 cups plain dry bread crumbs",
        "1/2 cup chopped Italian parsley, plus more for garnish",
        "2 tablespoons rendered duck fat",
        "2 tablespoons melted butter",
        "1/4 cup cooking liquid"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Cassoulet",
    "url": "http://allrecipes.com/recipe/246668/chef-johns-cassoulet/"
}
