{
    "directions": [
        "Place shrimp shells into a saucepan with bay leaf and 1 pinch of smoked paprika over medium-low heat; cook and stir shells until they turn pink, about 5 minutes. Pour in water, bring to a simmer, reduce heat to low, and simmer shrimp stock for 20 to 25 minutes.",
        "Mix lemon juice, ketchup, brown sugar, ground chipotle pepper, 1/2 teaspoon smoked paprika, garlic, 1 pinch of salt, and cayenne pepper in a bowl.",
        "Strain shrimp stock into a bowl; discard shells and bay leaf. Whisk shrimp stock into ketchup mixture and set aside.",
        "Heat vegetable oil in a large skillet over high heat until small wisps of smoke rise from the skillet. Cook shrimp in the hot oil until bottom sides of shrimp are seared and browned, about 3 minutes. Stir in shrimp stock mixture and cook until shrimp are opaque, about 3 minutes. Transfer shrimp to a bowl using a slotted spoon, leaving sauce in skillet.",
        "Bring sauce to a boil and cook until sauce has reduced and thickened, 3 to 4 minutes. Stir in cold butter, turn off heat, and let residual heat of pan melt butter. Stir until butter has incorporated into sauce and sauce is slightly thickened.",
        "Stir shrimp into sauce and toss with chives. Serve shrimp with sauce."
    ],
    "ingredients": [
        "1/2 pound raw shrimp, peeled and deveined - shells reserved",
        "1 bay leaf",
        "1 pinch smoked paprika",
        "1 cup water",
        "1/2 lemon, juiced",
        "1/4 cup ketchup",
        "1 tablespoon brown sugar",
        "1/2 teaspoon ground dried chipotle pepper",
        "1/2 teaspoon smoked paprika",
        "1 clove garlic, minced",
        "salt to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 1/2 tablespoons vegetable oil",
        "1 tablespoon cold unsalted butter",
        "1 tablespoon minced fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Deviled Shrimp Ragu",
    "url": "http://allrecipes.com/recipe/235360/chef-johns-deviled-shrimp-ragu/"
}
