{
    "directions": [
        "Heat 2 teaspoons vegetable oil in a large, heavy pot over high heat; brown beef shank slice in hot oil until seared and browned on both sides, about 3 minutes per side. Add onion, carrot, celery, water, bay leaf, 3 cloves peeled garlic, and black peppercorns; bring mixture to a simmer. Reduce heat to low and simmer until meat falls off the bone and stock turns brown in color, 4 to 5 hours. Add more water if beef stock level gets below about 5 cups.",
        "Place beef short ribs into freezer until firm and very cold, about 15 minutes. Cut meat into cubes and return to freezer until almost frozen, about 30 more minutes.",
        "Whisk egg with parsley, 2 cloves garlic, and cream in a bowl. Stir in bread crumbs and 1/4 cup Parmigiano-Reggiano cheese.",
        "Place partially-frozen beef cubes into food processor and pulse with with 1/3 teaspoon salt and 1/8 teaspoon black pepper until beef is coarsely ground, 5 to 10 pulses. Pulse in bread crumb mixture until mixture is finely ground, about 5 more pulses. Transfer meat to a bowl, cover with plastic wrap, and refrigerate.",
        "Strain beef stock into a large soup pot, discarding beef and vegetables. Mix chicken broth into beef stock and whisk in tomato paste. Bring broth mixture to a simmer and season with salt and black pepper to taste. Stir kale into broth; simmer kale until tender, about 15 minutes.",
        "Scoop 2-teaspoon portions of the meat mixture and roll into meatballs.",
        "Pour pastina into the simmering soup, cook for 5 minutes, and gently add meatballs. Simmer until meatballs are cooked through and tender, about 15 minutes. Serve in bowls garnished with a pinch of black pepper or a sprinkle of shredded Parmigiano-Reggiano cheese."
    ],
    "ingredients": [
        "Beef Stock:",
        "2 teaspoons vegetable oil",
        "1 thick slice meaty beef shank with bone",
        "1/3 cup coarsely chopped onion",
        "1/3 cup coarsely chopped carrot",
        "1/3 cup coarsely chopped celery",
        "2 quarts water",
        "1 bay leaf",
        "3 cloves garlic, peeled",
        "1/4 teaspoon whole black peppercorns",
        "10 ounces boneless beef short ribs",
        "Meatballs:",
        "1/2 beaten egg",
        "1 tablespoon chopped fresh parsley",
        "2 cloves garlic, minced",
        "2 tablespoons heavy whipping cream",
        "1/2 cup soft bread crumbs",
        "1/4 cup shredded Parmigiano-Reggiano cheese",
        "1/3 teaspoon salt, or to taste",
        "1/8 teaspoon freshly ground black pepper",
        "1 quart chicken broth",
        "1 teaspoon tomato paste",
        "salt and freshly ground black pepper to taste",
        "1 bunch kale, stems removed and leaves coarsely chopped",
        "1/3 cup pastina (tiny star-shaped pasta) or other tiny pasta",
        "1 pinch freshly ground black pepper to taste (optional)",
        "1 teaspoon shredded Parmigiano-Reggiano cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Italian Wedding Soup",
    "url": "http://allrecipes.com/recipe/235366/chef-johns-italian-wedding-soup/"
}
