{
    "directions": [
        "Cook and stir bread crumbs with 2 tablespoons olive oil in a skillet over medium heat until bread crumbs are crispy and toasted, 2 to 5 minutes. Transfer breadcrumbs to a bowl to cool.",
        "Grind saffron threads with a mortar and pestle; pour white wine into mortar and stir to combine.",
        "Bring a large pot of lightly salted water to a boil. Cook bucatini in boiling water, stirring occasionally until almost cooked through but firm to the bite, 10 to 11 minutes. Drain, reserving 1/2 cup of the pasta water.",
        "Heat remaining olive oil in large skillet over medium heat. Cook and stir onion and fennel with a pinch of salt in hot oil until onion is soft, about 10 minutes.",
        "Stir raisins, garlic, and anchovy fillet into onion mixture; cook and stir until heated through, about 1 minute.",
        "Pour saffron-wine into skillet; cook until wine is almost evaporated, about 2 minutes. Pour 1 ladleful reserved pasta water into skillet and bring to a simmer. Stir pine nuts and red pepper flakes into sauce; simmer until flavors combine and sauce is reduced, about 5 minutes.",
        "Stir bucatini and sardines into wine mixture; increase heat to high, and cook, stirring frequently and adding more reserved pasta water as necessary, until sauce and pasta are heated through, about 5 minutes. Remove from heat. Ladle into bowls and top with fennel fronds and toasted bread crumbs."
    ],
    "ingredients": [
        "3/4 cup dry bread crumbs",
        "6 tablespoons extra-virgin olive oil, divided",
        "1 pinch saffron",
        "1/4 cup white wine",
        "1/2 pound bucatini pasta",
        "1 cup diced yellow onion",
        "1 cup diced fennel bulb",
        "salt to taste",
        "1/4 cup golden raisins",
        "2 cloves garlic, minced",
        "1 anchovy fillet",
        "2 (4 ounce) cans sardines packed in oil, drained and crumbled",
        "1/4 cup toasted pine nuts",
        "1 pinch red pepper flakes",
        "3 tablespoons chopped fennel fronds, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Pasta con le Sarde",
    "url": "http://allrecipes.com/recipe/241081/chef-johns-pasta-con-le-sarde/"
}
