{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Set the cooked rice aside.",
        "Cook onion and olive oil over medium heat until onion begins to soften, about 5 minutes. Transfer half of cooked onion to a large bowl and set aside.",
        "Stir marinara sauce, beef broth, balsamic vinegar, and red pepper flakes into the skillet; cook and stir for 1 minute.",
        "Pour sauce mixture into a 9x13-inch baking dish and set aside.",
        "Combine ground beef, Italian sausage, diced tomatoes, Italian parsley, garlic, salt, black pepper, and cayenne pepper into bowl with reserved onions; mix well. Stir in cooked rice and Parmigiano Reggiano. Stuff green bell peppers with beef and sausage mixture.",
        "Place stuffed green bell pepper halves in the baking dish over tomato sauce; sprinkle with remaining Parmigiano-Reggiano, cover baking dish with aluminum foil, and bake in the preheated oven for 45 minutes.",
        "Remove aluminum foil and bake until the meat is no longer pink, the green peppers are tender and the cheese is browned on top, an addition 20 to 25 minutes."
    ],
    "ingredients": [
        "1 cup uncooked long grain white rice",
        "2 cups water",
        "Sauce:",
        "1 onion, diced",
        "1 tablespoon olive oil",
        "2 cups marinara sauce",
        "1 cup beef broth",
        "1 tablespoon balsamic vinegar",
        "1/4 teaspoon crushed red pepper flakes",
        "Peppers:",
        "1 pound lean ground beef",
        "1/4 pound hot Italian pork sausage, casing removed",
        "1 (10 ounce) can diced tomatoes",
        "1/4 cup chopped fresh Italian parsley",
        "4 cloves garlic, minced",
        "2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1 pinch ground cayenne pepper",
        "4 large green bell peppers, halved lengthwise and seeded",
        "1 cup finely grated Parmigiano-Reggiano cheese, plus more for topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Stuffed Peppers",
    "url": "http://allrecipes.com/recipe/222002/chef-johns-stuffed-peppers/"
}
