{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Stir peaches, 1/2 cup sugar, and salt together in a bowl. Let sit for 20 to 30 minutes. Strain accumulated juices into a saucepan and return strained peaches to bowl.",
        "Bring juices in saucepan to a boil; reduce heat to medium-high, and cook until mixture thickens to a syrup, 5 to 10 minutes.",
        "Whisk 1/2 cup sugar, flour, and cornstarch together in a bowl. Stir lemon juice, cayenne pepper, and cinnamon into peaches; add flour mixture and toss to coat. Pour peach syrup over peach mixture and stir.",
        "Roll out half the pastry to fit a 10-inch pie plate. Place bottom crust in pie plate. Pour peach filling into pie shell, tap pie plate against a surface to settle filling, and dot with butter.",
        "Roll remaining crust into an 11-inch circle and cut into 1-inch strips using a paring knife or pastry wheel.",
        "Lay 5 strips of pie crust over the top of the pie. Weave remaining pastry dough strips through to form a lattice top. Fold the ends of the lattice strips under the bottom crust and crimp the crust. Brush cream over the top and sprinkle with 1 tablespoon sugar.",
        "Bake in the preheated oven until browned and bubbling, about 1 hour 15 minutes. Cool completely before slicing."
    ],
    "ingredients": [
        "3 pounds fresh freestone peaches, peeled and sliced",
        "1 cup white sugar, divided",
        "1 tiny pinch salt",
        "1/4 cup all-purpose flour",
        "1 tablespoon cornstarch",
        "1 teaspoon lemon juice",
        "1 pinch cayenne pepper",
        "1 pinch ground cinnamon",
        "1 pastry for a 10-inch double crust pie",
        "1 1/2 tablespoons butter, cut into tiny pieces",
        "1 tablespoon heavy whipping cream, or to taste",
        "1 tablespoon white sugar, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Peach Pie",
    "url": "http://allrecipes.com/recipe/239145/chef-johns-peach-pie/"
}
