{
    "directions": [
        "Season pork cubes with salt and black pepper.",
        "Heat vegetable oil in a pot over high heat. Working in batches, cook and stir pork in hot oil until browned on all sides, 5 to 10 minutes. Transfer pork to a bowl and reduce heat to medium.",
        "Melt butter in the pot. Cook and stir onion with a pinch of salt in hot butter until onion is softened and translucent, 7 to 10 minutes. Add garlic; saute until fragrant, about 30 seconds.",
        "Stir flour into onion mixture; cook and stir until flour is completely incorporated, about 2 minutes. Add bay leaf and caraway seed; cook for 2 minutes more. Pour beer into onion mixture. Cook and stir until thickened, 1 to 3 minutes.",
        "Stir pork, chicken broth, carrots, and celery into beer mixture; bring to simmer. Stir 1/4 cup parsley and balsamic vinegar into stew, reduce heat to medium-low, and simmer until pork is fork-tender, about 2 hours.",
        "Bring a large pot of lightly salted water to a boil. Add the Brussels sprouts and cook uncovered until almost tender, about 5 minutes. Drain.",
        "Stir Brussels sprouts into stew and simmer until heated through, about 5 minutes. Season with salt and pepper to taste. Divide mashed potatoes between 6 bowls. Ladle stew over potatoes and top each with a pinch of parsley."
    ],
    "ingredients": [
        "1 (2 1/2 pound) boneless pork shoulder, cut into 2-inch cubes",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1 tablespoon butter",
        "1 large onion, chopped",
        "2 cloves garlic, minced",
        "1 tablespoon all-purpose flour",
        "1 bay leaf",
        "3/4 teaspoon caraway seed",
        "1 (12 fluid ounce) bottle dark beer (such as Guinness®)",
        "2 cups chicken broth",
        "3 carrots, cut into 1-inch pieces",
        "2 stalks celery, cut into 1-inch pieces",
        "1/4 cup chopped fresh flat-leaf parsley",
        "3 tablespoons balsamic vinegar",
        "12 Brussels sprouts, halved",
        "3 cups mashed potatoes, or as needed",
        "1 teaspoon chopped fresh flat-leaf parsley, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Irish Pork Stew",
    "url": "http://allrecipes.com/recipe/236988/chef-johns-irish-pork-stew/"
}
