{
    "directions": [
        "Melt butter over medium-high heat and cook until it turns golden brown, 2 to 3 minutes. Add apples and cook over medium-high heat until apples just begin to soften around the edges, 3 to 4 minutes. Sprinkle in 1 tablespoon sugar and continue cooking another 2 minutes. Remove from heat. Drain in a strainer; let cool to room temperature.",
        "Whisk flour, baking powder, salt, cinnamon, ginger, and nutmeg together in a mixing bowl until well combined.",
        "Whisk egg, 1/4 cup sugar, and melted butter together in a separate mixing bowl. Add cooled apple pieces and sparkling apple cider; add the flour mixture. Stir just until flour is incorporated.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Spoon about 2 tablespoons batter per fritter, into hot oil, slightly flattening them out. Cook in batches. Fry on one side until small bubbles appear on the surface, about 2 minutes. Carefully flip fritters over and fry the other side until richly browned, about 2 more minutes.",
        "Transfer with a slotted spoon to a paper-towel-lined plate to drain grease. Cool slightly before glazing.",
        "Whisk powdered sugar and cinnamon in a mixing bowl. Add enough apple cider, 1 teaspoon at a time, to form a smooth glaze that is just runny enough to drizzle over fritters."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "2 large Granny Smith apples - peeled, cored and cut into 1/4-inch dice",
        "1 tablespoon white sugar",
        "1 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon ground nutmeg",
        "1 large egg",
        "1/4 cup white sugar",
        "1 tablespoon melted butter",
        "1/2 cup sparkling apple cider",
        "2 cups vegetable oil for frying",
        "Glaze:",
        "1/2 cup confectioners' sugar, or more as needed",
        "1 tablespoon sparkling apple cider, or as needed to make glaze"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Apple Fritters",
    "url": "http://allrecipes.com/recipe/255631/chef-johns-apple-fritters/"
}
