{
    "directions": [
        "Place chicken in a Dutch oven. Add water, carrot, celery, onion, 3 sprigs of thyme, and bay leaf. Bring to a boil, cover, reduce heat to low, and simmer for 1 hour. Remove chicken from dutch oven and transfer to a bowl; set aside to cool.",
        "Increase heat and bring the stock to a simmer. Skim off any chicken fat that appears on top of the stock and reserve in a bowl. Combine 2 to 3 tablespoons of the reserved fat with flour in a small bowl; stir to make a paste, adding more flour if needed. Add the chicken fat and flour mixture to the stock. Reduce heat and simmer for 15 minutes.",
        "Remove chicken meat from the carcass and add to the stock. Season with salt, black pepper, and cayenne pepper to taste. Continue simmering for 10 to 15 minutes.",
        "Whisk creme fraiche, milk, 2 teaspoons of thyme leaves, and eggs together in a large bowl. Stir in self-rising flour until almost entirely incorporated; do not overmix.",
        "Scoop large dollops of dumpling mixture on top of the chicken stock. Increase heat slightly to medium-high. Cover and simmer until dumplings appear light and fluffy, and a toothpick inserted into the center comes out clean, 10 to 15 minutes. Serve garnish with thyme sprigs."
    ],
    "ingredients": [
        "1 (3 to 3 1/2 pound) whole chicken",
        "2 1/2 quarts cold water",
        "1 large carrot, cubed",
        "1 stalk celery, chopped",
        "1 onion, chopped",
        "3 sprigs fresh thyme",
        "1 bay leaf",
        "2 tablespoons all-purpose flour, or as needed",
        "salt and freshly ground black pepper to taste",
        "1/2 teaspoon cayenne pepper, or more to taste",
        "1/2 cup creme fraiche",
        "1/2 cup milk",
        "2 teaspoons chopped fresh thyme leaves",
        "2 eggs",
        "2 cups self-rising flour",
        "4 sprigs thyme, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Chicken and Dumplings",
    "url": "http://allrecipes.com/recipe/223048/chef-johns-chicken-and-dumplings/"
}
