{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until almost crisp, 5 to 7 minutes. Remove from heat and transfer bacon to a dish, leaving drippings in the skillet.",
        "Whisk 1/4 cup water, cream, lemon juice, and Worcestershire sauce together in a bowl.",
        "Stir 4 cups water, butter, and 1 teaspoon salt together in a pot; bring to a boil. Whisk grits into pot, bring to a simmer, reduce heat to low, and cook until grits are creamy, 20 to 25 minutes. Remove from heat and stir white Cheddar cheese into grits.",
        "Place shrimp in a large bowl and season with Cajun seasoning, 1/2 teaspoon salt, black pepper, and a pinch of cayenne pepper.",
        "Heat skillet with bacon drippings over high heat. Cook shrimp in hot bacon fat in a single layer for 1 minute. Turn shrimp and add jalapeno; cook until fragrant, about 30 seconds. Stir cream mixture, bacon, green onion, and garlic to shrimp mixture; cook and stir, adding water as necessary to thin the sauce, until shrimp are cooked through, 3 to 4 minutes. Remove from heat and stir in parsley.",
        "Ladle grits into a bowl and top with shrimp and sauce."
    ],
    "ingredients": [
        "4 slices bacon, cut into 1/4-inch pieces",
        "1/4 cup water",
        "2 tablespoons heavy whipping cream",
        "2 teaspoons lemon juice",
        "1 dash Worcestershire sauce",
        "4 cups water",
        "2 tablespoons butter",
        "1 teaspoon salt",
        "1 cup white grits",
        "1/2 cup shredded white Cheddar cheese",
        "1 pound shrimp, peeled and deveined",
        "1/2 teaspoon Cajun seasoning",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper",
        "1 pinch cayenne pepper",
        "1 tablespoon minced jalapeno pepper",
        "2 tablespoons minced green onion",
        "3 cloves garlic, minced",
        "1 tablespoon chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chef John's Shrimp and Grits",
    "url": "http://allrecipes.com/recipe/236806/chef-johns-shrimp-and-grits/"
}
