{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 450°F. Stir brown sugar, cornstarch, and salt in large nonstick skillet; stir in 1/2 cup water. Stir over medium heat until sugar and cornstarch dissolve. Add cherries; bring to boil, scraping sides of skillet and stirring frequently. Reduce heat to medium-low; simmer until mixture thickens, about 2 minutes. Remove from heat. Stir in lime juice and lime peel. Transfer filling to 11x7x2-inch glass baking dish. Place dish on rimmed baking sheet.",
        "Whisk flour, 1/4 cup sugar, baking powder, and salt in medium bowl. Whisk crème fraîche, vanilla, and lime peel in small bowl. Add crème fraîche mixture to dry ingredients; stir with fork just until dough begins to come together. Turn dough out onto floured surface and knead just until dough holds together, about 6 turns. Gather dough into round; pat out to 1/2-inch thickness. Using 3-inch biscuit cutter or cookie cutter dipped in flour, cut out rounds. Gather dough scraps together; pat out to 1/2-inch thickness and cut out more dough rounds for a total of 6. Transfer rounds to another rimmed baking sheet; brush tops lightly with milk, then sprinkle with remaining 1 tablespoon sugar.",
        "Place cherries on baking sheet in bottom third of oven and biscuits in top third of oven. Bake until cherries are bubbling and biscuits are golden, about 17 minutes.",
        "Divide warm cherries among 6 bowls; top each with 1 biscuit and serve."
    ],
    "ingredients": [
        "1/2 cup (packed) golden brown sugar",
        "4 teaspoons cornstarch",
        "Pinch of salt",
        "1/2 cup water",
        "6 cups whole pitted fresh Bing cherries or other dark sweet cherries (about 2 3/4 pounds whole unpitted cherries)",
        "1 tablespoon fresh lime juice",
        "3/4 teaspoon finely grated lime peel",
        "1 3/4 cups unbleached all purpose flour",
        "1/4 cup plus 1 tablespoon sugar",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "1 cup crème fraîche or sour cream",
        "1 1/2 teaspoons pure vanilla paste or 2 teaspoons vanilla extract",
        "1/4 teaspoon finely grated lime peel",
        "1 tablespoon (about) milk",
        "Ingredient tip: Vanilla paste is more concentrated and slightly thicker than vanilla extract, and includes the seeds of the vanilla bean. It's available at specialty foods stores and online from thespicehouse.com and amazon.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "High Fiber",
        "Graduation",
        "Father's Day",
        "Backyard BBQ",
        "Lime",
        "Cherry",
        "Summer",
        "Shower",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Lime Cobbler with Vanilla Créme Fraîche Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-lime-cobbler-with-vanilla-creme-fraiche-biscuits-242517"
}
