{
    "directions": [
        "Position rack in center of oven; preheat to 350°F. Combine 1/4 cup butter with brown sugar and vinegar in 10- to 11-inch ovenproof skillet with 2-inch-high sides. Stir over medium heat until butter melts and sugar dissolves, about 2 minutes. Increase heat to high; add cherries and bring to boil. Remove from heat.",
        "Whisk flour, cornmeal, baking powder, and salt in medium bowl to blend. Using electric mixer, beat 1/2 cup butter in large bowl. Add sugar; beat until pale and fluffy, about 3 minutes. Beat in egg yolks and vanilla. Add flour mixture alternately with milk in 2 additions each, beating just until blended and occasionally scraping down sides of bowl. Using clean dry beaters, beat egg whites in another medium bowl until foamy. Add cream of tartar and beat until whites are stiff but not dry. Using rubber spatula, fold 1/4 of whites into batter to lighten slightly. Fold in remaining whites in 3 additions (batter will be thick). Spoon batter over cherries in skillet, then spread evenly with offset spatula to cover cherries.",
        "Bake cake until top is golden brown and tester inserted into center comes out clean, about 45 minutes. Cool in skillet on rack 5 minutes. Run spatula around edges of cake to loosen. Place large serving platter upside down atop skillet. Using pot holders or oven mitts, firmly hold platter and skillet together and invert. Leave skillet atop cake 5 minutes. Remove skillet. If necessary, rearrange any cherries that may have become dislodged. Let cake cool at least 45 minutes. Cut cake into wedges and serve slightly warm or at room temperature."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, divided",
        "1/4 cup (packed) dark brown sugar",
        "2 teaspoons balsamic vinegar",
        "3 cups whole pitted fresh Bing cherries or other dark sweet cherries (about 21 ounces whole unpitted cherries)",
        "1 1/4 cups all purpose flour",
        "1/4 cup yellow cornmeal (preferably stone-ground medium grind)",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 cup sugar",
        "2 large eggs, separated",
        "3/4 teaspoon vanilla extract",
        "1/2 cup whole milk",
        "1/4 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Picnic",
        "Graduation",
        "Father's Day",
        "Backyard BBQ",
        "Cherry",
        "Cornmeal",
        "Summer",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Cornmeal Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-cornmeal-upside-down-cake-242516"
}
