{
    "directions": [
        "Combine all ingredients in heavy medium saucepan. Stir over medium heat until sugar dissolves and mixture boils. Reduce heat to medium-low and simmer until jam is thick, stirring often, about 22 minutes. Transfer to small bowl. Cover and chill up to 3 days.",
        "Preheat oven to 325°F. Butter 9-inch-diameter springform pan. Line bottom with parchment; butter parchment. Blend almond paste and sugar in processor until mixture resembles fine meal, about 1 minute. Add butter and vanilla and blend well, occasionally scraping down sides of bowl. Blend in eggs 1 at a time. Using on/off turns, blend in flour, baking powder and salt (do not overmix). Transfer batter to prepared pan. Place pan on baking sheet; bake cake until tester inserted into center comes out clean and top is golden, about 1 hour 10 minutes. Cool cake in pan on rack. Cover; let stand at room temperature 1 day.",
        "Whisk 1/2 cup sugar and cornstarch in heavy medium saucepan to blend. Beat in yolks and vanilla. Gradually whisk in half and half. Stir over medium heat until custard thickens and boils. Transfer to bowl. Press plastic wrap directly onto surface; chill 1 day.",
        "Cut around pan sides to loosen cake; release pan sides. Cut cake horizontally into 3 layers; discard parchment. Spoon thin layer of custard over bottom of 3- to 3 1/2-quart trifle bowl. Trim 1 cake layer to fit, if necessary; place in bowl. Spread with 1/3 of custard. Mix chopped cherries into jam. Spoon 1/3 of jam mixture atop custard; spread to edge of bowl so that jam shows. Top with second cake layer, half of remaining custard and half of remaining jam mixture; spread to edge of bowl. Top with third cake layer. Spread with remaining custard, then jam mixture.",
        "Beat whipping cream and powdered sugar until stiff peaks form. Transfer to pastry bag fitted with star tip. Pipe cream in center of trifle. Pipe rosettes around edge; top rosettes with whole cherries. Sprinkle trifle with almonds. Cover; chill at least 3 hours and up to 1 day."
    ],
    "ingredients": [
        "2 cups fresh cherries (about 12 ounces), pitted, coarsely chopped",
        "1 cup sugar",
        "1/4 cup water",
        "1 7-ounce package almond paste, cut into small pieces",
        "1 1/4 cups sugar",
        "1 1/4 cups (2 1/2 sticks) unsalted butter, cut into pieces",
        "2 teaspoons vanilla extract",
        "6 large eggs",
        "1 cup all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup sugar",
        "2 tablespoons cornstarch",
        "6 large egg yolks",
        "2 teaspoons vanilla extract",
        "2 cups half and half",
        "3 cups fresh cherries (about 18 ounces), pitted, coarsely chopped",
        "1 cup chilled whipping cream",
        "1/4 cup powdered sugar",
        "Cherries with stems",
        "Slivered almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cherry",
        "Almond",
        "Summer"
    ],
    "title": "Cherry-Almond Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-almond-trifle-101672"
}
