{
    "directions": [
        "Combine all the filling ingredients in a medium sauce pan over medium-low heat and stir until sugar dissolves. Turn heat up to medium and allow to simmer, stirring occasionally until mixture thickens and most of the liquid evaporates. Remove from heat and allow mixture to cool to room temperature.",
        "Purée the mixture in a food processor or blender and then place the mixture on a non-stick surface such as silpat*. Place another silpat on top and then roll the filling until it is 1/2 inch thick and 12 inches long. Place in freezer until firm (approximately 3 hours).",
        "When firm, cut into 1 1/2 inch wide strips and then return to freezer.",
        "In a medium bowl, combine the flour and baking soda. Mix well with a wire whisk and then set aside.",
        "In a large mixer with palette attachment, combine butter and sugar and mix at medium speed. Add the honey, egg, and vanilla extract and beat at medium speed until smooth. Scrape down the sides of the bowl and then add flour to the mixture. Blend at low speed until just combined, being careful not to overmix. Wrap in plastic wrap and refrigerate for 1 hour.",
        "Preheat oven at 325°F. Roll out the dough between two sheets of parchment paper so that it is 1/8-inch thick and 12-inches long. Return to refrigerator for 30 minutes. Remove from refrigerator and cut 5-inch strips in the dough and place a cherry bar in the center, using the parchment paper to wrap the dough around the cherry bar. Have the dough overlap in the center. If the dough becomes too soft, return to the refrigerator for 20 minutes. Flip the bar over onto a parchment lined sheet pan so that the seam is on the bottom and will disappear when it bakes. Bake for 20-22 minutes, or until dough begins to turn a light gold color. Remove from oven and let cool. When strips reach room temperature, cut each one into 8 pieces with a thin, sharp knife and serve.",
        "Place the vanilla ice cream and extract into a blender. With the motor running, add the milk and heavy cream until it is thoroughly mixed. Garnish the glasses with cherry purée reduction and a mint sprig and then pour the shake into a glass with a straw, and serve immediately with the cherry newton.",
        "*Siplats are non-stick baking sheets, sold in gourmet shops."
    ],
    "ingredients": [
        "1 cup cherry purée",
        "1/2 vanilla bean",
        "1/2 cup sugar",
        "1 cup dried cherries",
        "1 1/2 cups flour",
        "1 teaspoon baking soda",
        "1/4 cup softened butter",
        "1/4 cup light brown sugar",
        "1/4 cup honey",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1/2 cup milk",
        "1/2 cup heavy cream",
        "1 pint vanilla ice cream",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Blender",
        "Mixer",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Cherry"
    ],
    "title": "Cherry Newtons and Vanilla Milkshakes",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-newtons-and-vanilla-milkshakes-101881"
}
