{
    "directions": [
        "Combine mayonnaise, basil, and lemon juice in processor. Blend until smooth (some basil bits will remain). Season mayonnaise with salt and pepper. Transfer to small bowl, cover, and refrigerate. (Can be made 2 days ahead. Keep refrigerated.)",
        "Rinse 2 mini muffin pans (12 cups per pan) with cold water; shake off excess water. Mix tomatoes, garlic, and oil in medium bowl; sprinkle with salt and pepper. Let stand 15 minutes. Arrange 4 tomato quarters in bottom of each prepared muffin cup.",
        "Bring 2 1/2 cups water and salt to boil in heavy large saucepan over medium-high heat. Gradually whisk in polenta. Reduce heat to medium and cook until polenta thickens, whisking almost constantly, about 10 minutes. Reduce heat to low and continue to cook until polenta is tender, whisking often, about 15 minutes longer. Whisk in cheese and butter. Season polenta to taste with pepper.",
        "Spoon enough polenta into muffin cups to cover tomatoes and fill cups. Using wet fingertips, press polenta firmly to compact. Cover pans with waxed paper; let stand until polenta is firmly set, at least 30 minutes and up to 2 hours.",
        "Cut around each tartlet to loosen. Turn over muffin pans, releasing tartlets. Arrange, tomato side up, on platter. Top each with dollop of basil mayonnaise. Serve, passing remaining mayonnaise.",
        "*Sold at Italian markets, natural foods stores, and some supermarkets. If unavailable, substitute an equal amount of regular yellow cornmeal, and cook mixture for about half the time."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "3/4 cup (lightly packed) torn fresh basil leaves (from 1 large bunch)",
        "1 tablespoon fresh lemon juice",
        "24 small cherry tomatoes, quartered",
        "2 garlic cloves, minced",
        "1 tablespoon olive oil",
        "2 1/2 cups water",
        "1 teaspoon coarse kosher salt",
        "1/2 cup (3 ounces) polenta (coarse cornmeal)*",
        "1/3 cup (packed) grated Parmesan cheese",
        "1 tablespoon unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Quick & Easy",
        "Basil",
        "Cornmeal",
        "Summer",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry Tomato Polenta Tartlets with Basil Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-tomato-polenta-tartlets-with-basil-mayonnaise-108429"
}
