{
    "directions": [
        "Preheat oven to 350° F.",
        "In a food processor pulse almonds until ground. Add chocolate wafer cookies and grind fine. Add butter, sugar, almond extract, and salt and pulse until combined well. Transfer mixture to a 9-inch springform pan and press evenly onto bottom and 1 inch up side. Bake crust in middle of oven 10 minutes and transfer to a rack to cool. Crust may be made 3 days ahead and kept, covered, at room temperature.",
        "In a very small bowl sprinkle gelatin over water and let stand about 1 minute to soften. In a heavy saucepan bring cherries, sugar, and lemon juice to a boil, stirring. Remove pan from heat and reserve 1/2 cup juice for filling. To mixture remaining in pan add gelatin mixture and almond extract and stir until gelatin is dissolved.",
        "In a bowl with an electric mixer beat cream cheese with sugar until smooth. Beat in flour and add eggs 1 at a time, beating after each addition. Beat in sour cream, vanilla, and reserved cherry juice until combined well.",
        "Pour filling into crust and bake in middle of oven 50 minutes. (Cake will not be set in center but will set as it cools.) Transfer cake in pan to a rack to cool completely. Chill cake, loosely covered, 1 hour. Remove side of pan and transfer cake to a plate. Spread topping evenly over cake. Chill cake, loosely covered, at least 2 hours and up to 3 days."
    ],
    "ingredients": [
        "3/4 cup blanched whole almonds, toasted lightly",
        "20 thin chocolate wafer cookies",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/3 cup sugar",
        "1/2 teaspoon almond extract",
        "1/4 teaspoon salt",
        "3/4 teaspoon unflavored gelatin",
        "1 tablespoon water",
        "3 cups pitted picked-over fresh tart cherries (about 2 pints)",
        "1/4 cup plus 2 tablespoons sugar",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon almond extract",
        "two 8-ounce packages cream cheese, softened",
        "1 cup sugar",
        "3 tablespoons all-purpose flour",
        "3 large eggs",
        "an 8-ounce container sour cream",
        "2 teaspoons vanilla",
        "1/2 cup cherry juice reserved from making topping"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Cherry",
        "Almond",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Cherry Cheesecake with Chocolate Almond Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-cheesecake-with-chocolate-almond-crust-14135"
}
