{
    "directions": [
        "Preheat the oven to 375°F and lightly grease a 9 in/24cm diameter ring cake tin with butter.",
        "Mix all the dry ingredients together in a large bowl. Pour over the melted butter and mix in the eggs. Spoon the batter into the pre-greased tin and smooth down.",
        "Remove the pits from the cherries—you can do this with a cherry pitter or by just pulling them apart and popping the pits out with your fingers. I like to do this over the cake tin, so that any juice drips onto the cake and adds color. Drop the pitted cherries onto the batter and sprinkle the top of the cake with the remaining 1 1/2 tbsp/20g of sugar and the roughly chopped pistachios. Bake in the center of the oven for 25–30 minutes, then turn the cake around and bake for a further 8–10 minutes, until the cake between the cherries goes all golden.",
        "Allow the cake to cool in the tin, as it needs time to settle, then gently remove by running a knife around the edges. Covered well, it will keep in the fridge for up to a week (not much chance of that happening), but for the best flavor, allow it to return to room temperature before eating."
    ],
    "ingredients": [
        "1/2 cup/100g sugar, plus 1 1/2 tbsp/20g for the topping",
        "1/3 cup/90g light brown sugar",
        "1 1/4 cup/180g ground almonds",
        "1/4 cup/30g ground pistachios",
        "1/2 cup/45g desiccated coconut",
        "1/3 cup plus 1 tbsp/50g self-rising flour (preferably Gold Medal brand)",
        "A pinch of salt",
        "1 1/4 tsp ground mahleb",
        "10 tbsp/150g butter, melted",
        "3 large eggs",
        "2 cups/300g cherries",
        "Scant 1/2 cup/50g roughly chopped pistachios, for the topping"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "High Fiber",
        "Cherry",
        "Coconut",
        "Almond",
        "Pistachio",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry, Pistachio & Coconut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-pistachio-coconut-cake-56389614"
}
