{
    "directions": [
        "Preheat oven to 350°F. Lightly butter and flour 10-inch springform pan. Sift first 5 ingredients into medium bowl. Using electric mixer, beat butter and 1 cup sugar in large bowl until well blended. Add eggs 1 at a time, beating well after each addition. Blend in vanilla extract. Transfer 2 tablespoons dry ingredients to small bowl. On low speed, beat half of remaining dry ingredients into butter mixture, then mix in sour cream and lemon peel. Beat in remaining half of dry ingredients. Mix cherries into reserved 2 tablespoons dry ingredients; fold cherries into batter.",
        "Spoon batter into prepared pan; smooth top with spoon. Bake until tester inserted into center of cake comes out clean, about 30 minutes. Transfer cake to rack and cool 10 minutes.",
        "Meanwhile, using small sharp knife, scrape seeds from vanilla bean into small bowl. Mix in 1 tablespoon sugar, rubbing with fingertips to distribute seeds. Add powdered sugar and rub again.",
        "Sift vanilla sugar over hot cake and cool. Cut around pan sides to loosen cake; remove pan sides. (Can be made 1 day ahead. Cover; let stand at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground nutmeg",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 cup plus 1 tablespoon sugar",
        "2 large eggs, room temperature",
        "2 teaspoons vanilla extract",
        "2/3 cup sour cream",
        "1 teaspoon grated lemon peel",
        "1 cup canned pitted sweet cherries, halved, drained",
        "1/2 vanilla bean, split lengthwise",
        "2 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cherry",
        "Vanilla",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Vanilla Tea Cake with Vanilla Sugar",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-vanilla-tea-cake-with-vanilla-sugar-106341"
}
