{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Sprinkle the short ribs with salt and pepper. Heat a heavy cast-iron pot or Dutch oven over medium heat until it just begins to give off wisps of smoke; drizzle in about 1 1/2 tablespoon of olive oil. Sear 3 ribs in the hot oil until golden brown on all sides. Heat pot until smoking hot again, drizzle in 1 1/2 tablespoon of olive oil, and sear the remaining ribs as before. Transfer ribs to a plate and set aside. Discard used oil.",
        "Place remaining 1 tablespoon of olive oil in the pot over medium heat, and stir in the onion, celery, carrots, and fennel. Sprinkle with a pinch of salt, and cook until the vegetables are soft and the onions are translucent, stirring frequently, about 8 minutes. Pour in the Burgundy wine; scrape and dissolve all the browned flavor bits from the bottom of the pot. Bring the mixture to a boil, and cook until the liquid is reduced by half, about 10 minutes. Stir in rosemary, thyme, bay leaves, and demi-glace; stir well. Mix in the chicken stock, cherry cola, and balsamic vinegar. Push the short ribs into the vegetable mixture so they are about halfway covered; spread cherries over the ribs. Pour any meat juices over the cherries, bring the short ribs to a boil over medium heat, and cover.",
        "Place the covered pot into the preheated oven, and cook until the meat is tender and falling off the bones, 3 1/2 to 4 hours.",
        "Remove the ribs to a serving platter. Skim fat from the cherry sauce, and strain all the cherries, vegetables, and juices through a fine-mesh sieve into a bowl. Discard the solids, and return the liquid back to the pot. Bring to a boil, and cook the sauce over medium heat until thickened, about 10 minutes, stirring frequently; whisk in butter. Serve sauce over the short ribs."
    ],
    "ingredients": [
        "3 pounds beef short ribs, trimmed",
        "salt and ground black pepper to taste",
        "4 tablespoons olive oil, divided",
        "1 onion, chopped",
        "2 stalks celery, chopped",
        "2 carrots, chopped",
        "1 bulb fennel, sliced",
        "1 cup Burgundy wine",
        "3 sprigs fresh rosemary",
        "8 sprigs fresh thyme",
        "3 bay leaves",
        "2 1/2 tablespoons beef demi-glace",
        "4 cups chicken stock",
        "1 cup cherry cola",
        "1/3 cup balsamic vinegar",
        "2 cups pitted frozen tart cherries, thawed",
        "1 tablespoon butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cherry Balsamic Short Ribs",
    "url": "http://allrecipes.com/recipe/216524/cherry-balsamic-short-ribs/"
}
