{
    "directions": [
        "Punch down dough. Coat a large rimmed baking sheet (about 16x12\") with 1 tablespoon oil. Press dough evenly into pan, leaving a 1 1/2\" border. Loosely cover with plastic wrap or a kitchen towel; let rise in a warm, draft-free area until puffed but not doubled in size, 45-50 minutes.",
        "Meanwhile, bring cherry syrup and granulated sugar to a boil in a small saucepan, stirring to dissolve sugar. Reduce heat to medium; simmer, stirring occasionally, until mixture is reduced to 1/3 cup, 8-10 minutes. Transfer to a small bowl; let cool completely.",
        "Arrange a rack in middle of oven and preheat to 400°F. Using your fingertips, press dimples all over dough surface. Drizzle dough with remaining 2 tablespoons oil. Scatter cherries over, pressing them gently into dough. Drizzle reduced syrup over, allowing it to pool into nooks and crannies. Sprinkle almonds over, then raw sugar. Let rise until dough is doubled in size, 15-20 minutes.",
        "Bake until focaccia is golden brown, 20-23 minutes. Let cool in pan on a wire rack for at least 15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "Master Sweet Dough",
        "3 tablespoons extra-virgin olive oil, divided",
        "2 cups drained pitted tart cherries in light syrup (such as Morello) plus 1 cup syrup (from a 24-28-oz. jar)",
        "3 tablespoons granulated sugar",
        "3/4 cup sliced almonds (with or without skins)",
        "1/3 cup raw sugar",
        "Ingredient info: Tart cherries in light syrup can be found at some supermarkets and at Middle Eastern markets and sahadis.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Breakfast",
        "Brunch",
        "Bake",
        "Christmas",
        "Easter",
        "Mother's Day",
        "Cherry",
        "Almond",
        "Edible Gift",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Almond Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-almond-focaccia-395051"
}
