{
    "directions": [
        "Press preserves through fine strainer into heavy medium saucepan. Add cream and bring to simmer. Remove from heat. Add chocolate and whisk until melted and smooth. (Can be made 2 days ahead. Cover; chill. Rewarm before serving.)",
        "Preheat oven to 350°F. Butter 11 x 7-inch metal baking pan. Stir chopped chocolate and butter in heavy small saucepan over low heat until melted and smooth; remove from heat. Whisk sugar, eggs and vanilla in medium bowl until blended; whisk in chocolate mixture. Sift in flour, baking powder and salt; stir to blend. Mix in dried cherries and chocolate chips, then preserves. Spread batter in prepared pan.",
        "Bake brownies until tester inserted into center comes out with some moist crumbs still attached, about 35 minutes. Cool completely in pan on rack.",
        "Cut brownies into 8 rectangles. Cut rectangles diagonally in half, forming triangles. Spoon warm sauce onto 8 plates. Place 2 brownie triangles atop sauce on each plate. Sift powdered sugar over. Garnish with chocolate-dipped cherries."
    ],
    "ingredients": [
        "1/3 cup cherry preserves",
        "3/4 cup whipping cream",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "5 tablespoons unsalted butter",
        "3/4 cup sugar",
        "2 large eggs",
        "1/2 teaspoon vanilla extract",
        "2/3 cup all purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup dried tart cherries (about 3 1/2 ounces)",
        "1/3 cup semisweet chocolate chips",
        "1/4 cup cherry preserves",
        "Powdered sugar",
        "Chocolate-dipped Cherries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer"
    ],
    "title": "Cherry-Fudge Brownies with Chocolate Sauce and Chocolate-Dipped Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-fudge-brownies-with-chocolate-sauce-and-chocolate-dipped-cherries-101674"
}
