{
    "directions": [
        "Preheat oven to 350°F. Butter sides of 9-inch-diameter cake pan with 2-inch-high sides. Melt 1/4 cup butter in same pan set over low heat. Add brown sugar; whisk until well blended, about 2 minutes. Remove from heat. Spread mixture over bottom of pan. Arrange cherries, cut side down, in single layer in bottom of pan and press lightly to adhere. Set aside.",
        "Mix flour, baking powder and salt in medium bowl. Using electric mixer, beat 1 cup sugar and butter in large bowl until creamy. Mix in egg yolks 1 at a time, beating well after each addition. Beat in 1 teaspoon vanilla. Mix in dry ingredients alternately with milk.",
        "Using electric mixer fitted with clean dry beaters, beat egg whites and cream of tartar in another large bowl until stiff but not dry. Stir 1/4 of whites into cake batter to lighten. Using rubber spatula, gently fold remaining whites into batter. Spoon batter atop cherries in pan. Bake cake until deep golden on top and tester inserted into center comes out clean, about 55 minutes. Cool cake in pan on rack 15 minutes.",
        "Whip cream, powdered sugar and 1/2 teaspoon vanilla in bowl to soft peaks.",
        "Run small knife around edges of pan to loosen cake. Place platter over cake and invert onto platter. Let stand 5 minutes. Remove pan. Serve cake warm or at room temperature with whipped cream. (Cake and whipped cream can be made 6 hours ahead. Cover cake and let stand at room temperature. Cover and chill whipped cream.)"
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "3/4 cup (packed) golden brown sugar",
        "14 ounces cherries, halved, pitted",
        "1 1/2 cups all purpose flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 large eggs, separated",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup whole milk",
        "1/4 teaspoon cream of tartar",
        "1 cup chilled whipping cream",
        "1 1/2 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-upside-down-cake-4064"
}
