{
    "directions": [
        "About one hour before smoking, make the dry rub.  Combine all ingredients in small bowl; mix well. Pat ribs dry with paper towels; generously coat both sides of ribs with rub. Set aside at room temperature for 1 hour.",
        "Meanwhile, make the glaze.  Combine all ingredients except cherry preserves in medium saucepan; bring to a boil over medium-high heat.  Reduce heat and simmer 20 minutes until slightly thickened, stirring frequently. Remove from heat; stir in preserves. Set aside to cool.",
        "Heat charcoal or gas grill for indirect cooking at 250 to 300 degrees F. Add drained wood chips, if using.",
        "Place the ribs, meaty side down, over a drip pan and cook for 2 hours spraying both sides of ribs with apple juice every 20 to 30 minutes. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.",
        "Remove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil.  Return wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.",
        "Remove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with glaze. Cook for about 5 minutes until the glaze is set. Turn ribs and repeat with more glaze.",
        "Serve ribs with remaining glaze."
    ],
    "ingredients": [
        "Dry Rub:",
        "1/4 cup light brown sugar",
        "1 tablespoon kosher salt",
        "1 tablespoon paprika",
        "1 teaspoon chipotle chile powder",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 teaspoon black pepper",
        "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup apple juice, in a spray bottle",
        "Glaze:",
        "1 1/2 cups ketchup",
        "1/2 cup light brown sugar",
        "1/2 cup distilled white vinegar, plus",
        "1 tablespoon distilled white vinegar",
        "1/3 cup water, plus",
        "1 tablespoon water",
        "1 1/2 teaspoons Worcestershire sauce",
        "1 1/2 teaspoons chili powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon chipotle chile powder",
        "1/4 teaspoon black pepper",
        "1/3 cup cherry preserves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cherry-Chipotle Glazed Back Ribs",
    "url": "http://allrecipes.com/recipe/242369/cherry-chipotle-glazed-back-ribs/"
}
