{
    "directions": [
        "Soak cherries in cassis in small bowl at least 4 hours or overnight. Drain; pat dry.",
        "Grind 3 tablespoons almonds in mini processor until finely ground. Finely chop remaining almonds.",
        "Whisk all purpose flour, whole wheat flour, and salt in medium bowl. Using electric mixer, beat butter and sugar in large bowl until creamy, about 2 minutes. Add ground almonds; beat until well blended, about 1 minute. Beat in flour mixture on low speed just to blend.",
        "Scrape dough out onto sheet of parchment or waxed paper. Using paper as aid, form dough into 81/2x13/4-inch log. Brush dough all over with egg (except for ends). Scatter chopped almonds on sheet of plastic wrap. Roll log in almonds to coat. Wrap in plastic wrap and chill at least 2 hours. DO AHEAD: Dough can be made 2 days ahead. Keep refrigerated. Cover and chill cherries.",
        "Preheat oven to 350°F. Let dough stand at room temperature 10 minutes. Unwrap dough and cut into 3/8-inch-thick slices. Place cookies on large ungreased baking sheet, spacing 1 inch apart. Place 1 cherry in center of each cookie.",
        "Bake 10 minutes. Press cherries into cookies (cookies will have softened). Rotate baking sheet in oven and bake until cookies are lightly golden and slightly puffed, about 18 minutes longer. Cool cookies on sheet on rack 5 minutes. Transfer cookies to rack to cool completely. DO AHEAD: Cookies can be made 2 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "24 dried tart cherries (about 1 1/2 ounces)",
        "1/3 cup crème de cassis (black-currant liqueur)",
        "1/2 cup raw almonds with skins, divided",
        "1/2 cup all purpose flour",
        "1/2 cup whole wheat flour",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup powdered sugar, sifted",
        "1 large egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dessert",
        "Bake",
        "Christmas",
        "Picnic",
        "Valentine's Day",
        "Low Cal",
        "Dried Fruit",
        "Cherry",
        "Tree Nut",
        "Almond",
        "Shower",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry Almond Shortbread Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-almond-shortbread-cookies-350132"
}
