{
    "directions": [
        "Whisk all ingredients except butter in a medium bowl until no lumps of sugar remain. Rub butter into oat mixture with your fingertips until it's completely incorporated. If butter begins to soften while mixing, chill mixture to firm it up, about 15 minutes (cold butter ensures a flaky, tender crumble). Cover and chill crumble up to 5 days ahead.",
        "Preheat oven to 350°F. Line a rimmed baking sheet with foil; lightly coat with nonstick spray (for easy cleanup in case the pie bubbles over) and set aside. Line pie dish with crust and crimp edges decoratively. Place pie dish on prepared baking sheet.",
        "Combine cherries and remaining 5 ingredients in a large bowl. Using a rubber spatula, gently mix until cherries are coated and mixture is evenly distributed.",
        "Pour cherries into pie crust and top evenly with crumble. Bake until pie crust and center of crumble are deep golden brown and juices from cherries are bubbling and look thickened, 1 1/4-1 1/2 hours. (The juices will begin to ooze out of crust and onto foillined sheet.) Let pie cool for at least 2 hours at room temperature to allow filling to set properly. (Cutting into the pie before it's set will result in a runny filling.) Cover and let stand up to 1 day at room temperature."
    ],
    "ingredients": [
        "1/2 cup old-fashioned oats",
        "1/4 cup all-purpose flour",
        "1/4 cup (packed) light brown sugar",
        "1/4 cup sliced almonds",
        "1/2 teaspoon kosher salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2\" pieces",
        "Nonstick vegetable oil spray",
        "1 pie crust, homemade or store-bought",
        "3 24.7-ounce jars pitted sour cherries in syrup, drained well (about 6 cups)",
        "3/4 cup sugar",
        "1/4 cup bourbon",
        "3 tablespoons cornstarch",
        "2 tablespoons fresh orange juice",
        "1 tablespoon finely grated orange zest",
        "Special equipment: A 9\" pie dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Almond",
        "Oat",
        "Spirit",
        "Whiskey",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Bourbon Pie",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-bourbon-pie-51108280"
}
