{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Soak wooden pop sticks in water.",
        "Place the cherries into a saucepan, and stir in white sugar, cornstarch, water, and almond extract. Stirring constantly, bring the mixture to a boil over medium heat, and cook until thick, about 2 minutes. Remove from heat and let cool.",
        "On a floured surface, unroll the pie crusts, and roll each crust out to an 11-inch circle. Cut each crust into 18 rectangles about 1 1/2-inch by 2 inches.",
        "Place 18 squares onto the prepared baking sheet about 1 inch apart, and place a wooden pop stick onto each square so that about 1 inch of the stick is on the dough rectangle. Spoon about 1 teaspoon of the cherry filling into center of each dough rectangle. Top each tart with a second rectangle of dough, and crimp the edges of the little tarts with a fork. Press dough around stick to help hold the stick in place.",
        "Bake in the preheated oven until the tarts are lightly browned at the edges, 10 to 12 minutes. Allow to cool.",
        "Make the glaze by stirring confectioners' sugar with milk and vanilla extract until smooth and pourable (not thin). Spread a coating of glaze over each tart, and sprinkle the tarts with candy sprinkles. Allow the glaze to set for several hours before serving."
    ],
    "ingredients": [
        "12 wooden pop sticks",
        "1 cup pitted tart red cherries, chopped",
        "3 tablespoons white sugar",
        "2 tablespoons cornstarch",
        "2 tablespoons water",
        "1/2 teaspoon almond extract",
        "1 (15 ounce) package prepared pie crusts",
        "1/2 cup confectioners' sugar",
        "1 tablespoon milk, or as needed",
        "1/4 teaspoon vanilla extract",
        "1 teaspoon multicolored candy sprinkles"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cherry Tart Pops",
    "url": "http://allrecipes.com/recipe/219127/cherry-tart-pops/"
}
