{
    "directions": [
        "Preheat the oven to 375°F. Line the bottom of a buttered 9- by 2-inch round cake pan with a round of wax paper, butter the paper, and dust the pan with flour, knocking out the excess. Working over a bowl pit 1 pound of the cherries, reserving any juice.",
        "In a food processor grind fine the almonds with the flour, the baking powder, and the salt. In a bowl with an electric mixer cream the butter with 3/4 cup of the granulated sugar until the mixture is light and fluffy, add the egg yolks, 1 at a time, beating well after each addition, and stir in the flour mixture, the vanilla, the almond extract, and the reserved cherry juice.",
        "In another bowl with the electric mixer, beaters cleaned, beat the egg whites until they just hold stiff peaks, stir one fourth of them into the batter to lighten it, and fold in the remaining whites gently but thoroughly. Turn the batter into the pan, smoothing the top, arrange the cherries evenly on it, pressing them into the batter slightly, and sprinkle them with the remaining 1 tablespoon granulated sugar. Bake the cake in the middle of the oven for 30 to 35 minutes, or until a tester comes out clean, and let it cool in the pan on a rack for 10 minutes. Invert the cake onto the rack, invert a cake plate over it, and invert the cake onto the plate. Dust the cake with the confectioners' sugar and garnish it with the additional cherries. Serve the cake warm or at room temperature."
    ],
    "ingredients": [
        "1 pound sour cherries (about 3 cups) plus additional for garnish if desired",
        "1/4 pound blanched whole almonds",
        "1 cup plus 2 tablespoons all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "1/4 teaspoon salt",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "3/4 cup plus 1 tablespoon granulated sugar",
        "3 large eggs, separated",
        "1 teaspoon vanilla",
        "1/4 teaspoon almond extract",
        "confectioners' sugar for dusting the cake"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cherry",
        "Almond",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry Almond Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-almond-cake-12287"
}
