{
    "directions": [
        "Heat 2/3 cup whipping cream and 2 tablespoons butter in heavy medium saucepan over medium heat until butter melts. Remove from heat. Add chocolate; let stand 1 minute. Whisk until chocolate melts and sauce is smooth. Mix in vanilla extract. Cool sauce to room temperature, stirring occasionally, about 30 minutes.",
        "Line bottom of 9 x 5 x 2 1/2-inch metal loaf pan with parchment paper, leaving overhang on long sides. Using back of spoon, spread 1 pint ice cream over bottom of prepared pan. Sprinkle evenly with 1 cup cookie crumbs. Spread another 1 pint ice cream over cookie crumbs. Freeze until ice cream is firm, about 20 minutes. Spread with 3/4 cup sauce; freeze 20 minutes. Spread with remaining 1 pint ice cream; sprinkle with 1 cup cookie crumbs, pressing crumbs into ice cream to adhere. Cover pan and freeze ice cream cake until very firm, at least 4 hours. (Can be prepared 5 days ahead. Keep cake frozen. Cover and refrigerate remaining sauce. Store remaining 1 cup crumbs airtight at room temperature.)",
        "Stir remaining sauce in heavy medium saucepan over low heat until warmed through; pour into small pitcher or bowl. Cut around pan sides to loosen cake. Turn cake out onto platter. Peel off parchment. Sprinkle top of cake with remaining 1 cup crumbs.",
        "Cut cake crosswise into slices. Serve immediately with warm sauce."
    ],
    "ingredients": [
        "2/3 cup whipping cream",
        "2 tablespoons unsalted butter",
        "10 ounces imported milk chocolate, chopped",
        "1 teaspoon vanilla extract",
        "3 pints cherry or cherry-vanilla ice cream, softened slightly",
        "3 cups coarsely crushed amaretti cookies (about 9 ounces) or almond macaroons"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Cherry",
        "Almond",
        "Summer",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Cherry-Almond Ice Cream Cake with Milk Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-almond-ice-cream-cake-with-milk-chocolate-sauce-101956"
}
