{
    "directions": [
        "Combine cherries and sugar in heavy large saucepan; toss to coat. Let stand until juices form, about 2 hours. Bring to boil; reduce heat to medium-low and simmer until liquid thickens slightly, about 12 minutes. Remove from heat; mix in brandy. Transfer 1 cup cherry mixture to small bowl; reserve for use in ice cream. Mix preserves into remaining cherry mixture in saucepan; reserve for sauce. Chill both cherry mixtures separately at least 2 hours. (Can be prepared 2 days ahead. Cover and keep refrigerated.)",
        "Pour half and half into heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to boil. Remove from heat; steep 30 minutes. Whisk sugar and yolks in medium bowl to blend well. Bring half and half to simmer. Gradually whisk hot half and half into yolk mixture. Return mixture to same saucepan. Stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 4 minutes (do not boil). Remove from heat. Mix in whipping cream and vanilla. Refrigerate until cold, stirring occasionally, about 2 hours.",
        "Using ice cream maker, process custard until almost firm, following manufacturer's instructions; add reserved 1 cup cherry mixture. Process until ice cream firms, about 15 minutes longer. Transfer to container; cover and freeze. (Can be made 2 days ahead. Keep frozen.)",
        "Scoop ice cream into bowls. Top with reserved sauce and serve."
    ],
    "ingredients": [
        "4 cups fresh cherries (about 1 1/2 pounds), pitted, coarsely chopped",
        "1 cup sugar",
        "1/4 cup cherry-flavored brandy or brandy",
        "1/3 cup cherry preserves",
        "2 cups half and half",
        "1 vanilla bean, split lengthwise",
        "3/4 cup sugar",
        "6 large egg yolks",
        "1 cup chilled whipping cream",
        "1 tablespoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Cherry",
        "Vanilla",
        "Brandy",
        "Summer",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry-Vanilla Bean Ice Cream with Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-vanilla-bean-ice-cream-with-cherry-sauce-101668"
}
