{
    "directions": [
        "Position rack in top third of oven and preheat to 425°F. Unroll dough on heavy large baking sheet; pull to about 12x8-inch rectangle, pinching any tears to seal. Fold over edge of dough to make border.",
        "Heat large skillet over high heat 2 minutes. Add oil, then tomatoes; sprinkle with salt and pepper. Sauté until tomatoes are charred and beginning to break down, about 5 minutes. Transfer to large bowl. Mix in garlic, fennel, and crushed red pepper. Using back of fork, crush tomatoes in bowl, leaving large chunks intact. Season mixture with salt and pepper. Toss cheeses and chopped basil in medium bowl.",
        "Sprinkle cheese mixture evenly over dough, right up to border. Spoon on tomato mixture in dollops, leaving some cheese uncovered. Bake pizza until crust is crisp and brown, 25 to 30 minutes.",
        "Loosen pizza with metal spatula and slide onto board. Garnish with basil leaves."
    ],
    "ingredients": [
        "1 13.8-ounce tube refrigerated pizza dough",
        "1 tablespoon extra-virgin olive oil",
        "1 12-ounce bag cherry tomatoes, stemmed",
        "1 garlic clove, pressed",
        "1/2 teaspoon fennel seeds, coarsely crushed in plastic bag",
        "1/4 teaspoon dried crushed red pepper",
        "1 4-ounce ball fresh mozzarella in water (ovoline), diced",
        "4 ounces whole-milk mozzarella, diced",
        "1/3 cup chopped fresh basil leaves plus small leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Mozzarella",
        "Basil",
        "Healthy",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cherry Tomato Pizza Margherita",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-tomato-pizza-margherita-357889"
}
