{
    "directions": [
        "In a large bowl, combine flour and salt. Cut in the cold shortening until pea-sized (you may use the paddle of a stand mixer for this step, or pulse in a food processor, then transfer to a bowl). Stir in water until mixture forms a ball. Divide dough in half and shape into balls. Wrap in plastic and refrigerate for at least 1 hour or overnight.",
        "On a lightly floured work surface, roll out half the dough to fit a 9-inch pie plate. Place bottom crust in pie plate, loosely cover with plastic, and refrigerate.",
        "Whisk together sugar and cornstarch in a saucepan; add cherries and toss to coat. Let stand for about 10 minutes to draw out the cherry juices.",
        "Preheat oven to 475 degrees F (245 degrees C). Place a baking sheet in the oven to preheat.",
        "Bring cherry filling to a boil over medium heat, stirring constantly. Lower the heat and simmer for 1 minute or until the juices thicken and become translucent (filling will thicken further as it cools). Remove from heat and stir in the butter and almond extract. Mix thoroughly and allow to cool to room temperature.",
        "Roll out second crust and cut into lattice strips or decorative shapes. When filling is cool, pour into bottom pie shell. Cover filling with top crust or cutouts and crimp edges.",
        "Reduce oven to 375 degrees F (190 degrees C) and place pie on hot baking sheet.",
        "Bake in the preheated oven until crust is golden brown and filling is bubbly, 45 to 55 minutes. Let pie cool and set several hours before slicing."
    ],
    "ingredients": [
        "Crust:",
        "2 cups all-purpose flour",
        "1 cup shortening, chilled",
        "1/2 cup cold water",
        "1 pinch salt",
        "Filling:",
        "1 1/8 cups white sugar",
        "3 1/2 tablespoons cornstarch",
        "2 pounds sour cherries, pitted",
        "1 tablespoon butter",
        "1/4 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cherry Pie IV",
    "url": "http://allrecipes.com/recipe/26316/cherry-pie-iv/"
}
