{
    "directions": [
        "If using frozen cherries, thaw, reserving juices. Simmer cherries, 1/2 cup sugar, and liqueur in a 2- to 3-quart heavy saucepan, uncovered, stirring occasionally, until cherries are soft, about 5 minutes. Whisk together cornstarch and water until combined, then whisk into cherry mixture and boil 1 minute. Transfer to a shallow bowl and chill, uncovered, 1 hour.",
        "Pulse 1 cup almonds in a food processor until finely ground (do not pulse to a paste). Transfer to a bowl and stir in wafer crumbs and butter with a fork until combined well. Pat crumb mixture evenly onto bottom and 1 1/2 inches up side of buttered springform pan, then freeze while making filling, about 30 minutes.",
        "Beat egg whites with remaining 1/3 cup sugar, cream of tartar, and a pinch of salt in a medium metal bowl set over a saucepan of simmering water using a handheld electric mixer at medium-high speed until whites just hold soft peaks and instant-read thermometer registers 170°F, about 5 minutes. Remove bowl from saucepan and continue to beat whites until they just hold stiff peaks, about 2 minutes more.",
        "Beat cream with Marsala in another bowl at medium speed until it just holds stiff peaks. Fold in ground amaretti and half of whites gently but thoroughly. Fold in remaining whites and pour into crust in pan, smoothing top.",
        "Drain cherries in a sieve set over a bowl and reserve juices. Scatter cherries evenly over top of tortoni, then swirl cherries into tortoni with tip of a sharp knife for a marbled effect. Sprinkle top of tortoni with remaining 1/2 cup toasted sliced almonds and freeze, loosely covered, until firm, at least 4 hours.",
        "Let stand in pan at room temperature 10 minutes to soften slightly before serving. Carefully remove side of pan, then cut tortoni into wedges and serve with cherry juices."
    ],
    "ingredients": [
        "2 1/4 cups fresh or frozen (not thawed) pitted sour cherries (3/4 lb)",
        "1/2 cup plus 1/3 cup sugar",
        "2 tablespoons Di Saronno Amaretto or other almond-flavored liqueur",
        "1 1/2 teaspoons cornstarch",
        "1 tablespoon cold water",
        "1 1/2 cups sliced almondstoasted and cooled completely",
        "1 1/4 cups fine vanilla-wafer crumbs (from about 40 wafers)",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "4 large egg whites",
        "1/2 teaspoon cream of tartar",
        "1 1/3 cups chilled heavy cream",
        "2 tablespoons sweet Marsala wine or sweet Sherry",
        "3/4 cup coarsely ground amaretti cookies (from about 20 one-inch cookies)",
        "Special equipment: a 9- to 9 1/2-inch springform pan; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cherry",
        "Almond",
        "Amaretto",
        "Marsala",
        "Summer",
        "Gourmet"
    ],
    "title": "Cherry Tortoni",
    "url": "http://www.epicurious.com/recipes/food/views/cherry-tortoni-108367"
}
