{
    "directions": [
        "1. Combine all the ingredients in a blender and mix until a thin batter forms. Chill the batter for at least 1 hour before using. It can be stored in the refrigerator for up to 24 hours.",
        "2. Heat an 8-inch nonstick sauté pan over medium heat. Brush the bottom and sides of the pan with some of the melted butter reserved for this purpose.",
        "3. Stir the chilled batter. Add about 2 tablespoons of batter to the pan while swirling it. This ensures a thin layer of the batter all over the pan. You want thin crêpes. Let the crêpe cook for about 30 seconds or until it gets lightly golden. Tuck in the sides with a rubber spatula. Using a spatula or even your hands (careful!), quickly flip the crêpe over and finish cooking. The first crêpe is usually a test one, so don't worry if it sticks. Transfer it to a plate and repeat with the rest of the batter. Stack all the crêpes. They should not stick together.",
        "4. At this point, you can fill them with anything or freeze them, stacked and tightly wrapped, for up to 1 month.",
        "1. In a medium sauté pan, heat the olive oil over medium heat. Add the cloves of garlic and gently let the garlic infuse the oil for 1 to 2 minutes; then remove it. Do not burn the garlic.",
        "2. Add the mushrooms and thyme. Cook for another couple of minutes, until soft and slightly caramelized. Season with the salt and pepper. Remove from the heat and add the crème fraîche.",
        "3. Add about 2 tablespoons of filling and a sprinkle of parsley to each crêpe and roll them up. Serve immediately."
    ],
    "ingredients": [
        "2 eggs, at room temperature",
        "1 cup (100 g) chestnut flour",
        "1 cup (250 ml) whole milk, at room temperature",
        "1 tablespoon finely chopped fresh parsley",
        "1/4 teaspoon salt",
        "Pinch of freshly grated nutmeg",
        "1/4 stick (2 tablespoons or 30 g) unsalted butter, melted, plus more melted butter for the pan",
        "3 tablespoons olive oil",
        "2 cloves garlic, peeled",
        "8 ounces (225 g) exotic mushrooms, such as cremini, oyster, and shiitake",
        "4 sprigs thyme",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 tablespoons crème fraîche or whole-milk sour cream",
        "1 tablespoon finely chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Brunch",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chestnut Crêpes with Creamy Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-crepes-with-creamy-mushrooms-51126400"
}
