{
    "directions": [
        "Blend chestnuts, 2 tablespoons water, and 1 tablespoon butter in processor until paste forms. Transfer mixture to small bowl. DO AHEAD: Can be made 2 days ahead. Cover and refrigerate.",
        "Coat inside of 14-cup soufflé dish (about 8 1/4 inches wide and 3 3/4 inches deep) with remaining 2 tablespoons butter. Sprinkle dish with 1/4 cup sugar and tilt to coat bottom and sides evenly.",
        "Whisk 1/4 cup milk, egg yolks, 4 tablespoons sugar, cornstarch, and salt in medium bowl to blend. Bring remaining 13/4 cups milk and 4 tablespoons sugar to simmer in heavy large saucepan. Gradually whisk hot milk mixture into yolk mixture. Return custard to same pan. Stir over medium heat until custard thickens and boils, about 3 minutes. Remove from heat. Add chestnut paste, Armagnac, and vanilla and whisk to blend well (some small pieces of chestnut paste will remain). DO AHEAD: Soufflé base can be made 2 hours ahead. Press plastic wrap onto surface; let stand at room temperature.",
        "Position rack just below center of oven and preheat to 400°F. Beat egg whites and cream of tartar in large bowl until soft peaks form. Gradually add remaining 6 tablespoons sugar, beating until stiff but not dry. Fold whites into soufflé base in 3 additions. Transfer batter to prepared dish. Place souffléon small baking sheet. DO AHEAD: Can be made 1 hour ahead; let stand at room temperature. Bake soufflé until puffed and just firm to touch in center, about 50 minutes. Serve immediately with sauce.",
        "Peeled cooked chestnuts; sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 7.25-to 7.41-ounce jar whole steamed chestnuts or vacuum-packed roasted chestnuts*",
        "2 tablespoons water",
        "3 tablespoons unsalted butter, room temperature, divided",
        "1/4 cup sugar (for coating soufflé dish) plus 14 tablespoons sugar, divided",
        "2 cups whole milk, divided",
        "4 large egg yolks",
        "3 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "2 tablespoons Armagnac, Cognac, or other brandy",
        "1 teaspoon vanilla extract",
        "1 cup egg whites (about 8 large)",
        "1/8 teaspoon cream of tartar",
        "Bittersweet Chocolate Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Cognac/Armagnac",
        "Chestnut",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chestnut-Armagnac Soufflé with Bittersweet Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-armagnac-souffle-with-bittersweet-chocolate-sauce-350760"
}
