{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Butter a 2 1/2- to 3-quart shallow baking dish.",
        "Spread bread cubes in a large shallow baking pan (1 inch deep) and bake in lower third of oven until completely dry, 25 to 30 minutes. Cool in pan on a rack 10 minutes. (Leave oven on.)",
        "While bread bakes, cook bacon in a 12-inch heavy skillet over moderately high heat, stirring, until crisp, about 10 minutes, then transfer with a slotted spoon to a large bowl.",
        "Pour off and discard all but 2 tablespoons bacon fat from skillet, then sauté onions in fat over moderately high heat, stirring and scraping up brown bits, until softened, about 10 minutes. Add celery and sauté, stirring, 3 minutes, then transfer vegetables to bowl with bacon.",
        "Cook sausage and liver (if using) in skillet, stirring and breaking up sausage with a fork, until meat is no longer pink, 8 to 10 minutes, then transfer with slotted spoon to onion mixture.",
        "Pour off any remaining fat from skillet. Add Cognac (off heat), then deglaze skillet by simmering over moderate heat, stirring and scraping up any brown bits, 1 minute, and add to sausage mixture.",
        "Increase oven temperature to 375°F.",
        "Soak bread cubes in half-and-half in a bowl, tossing frequently, until liquid is absorbed, about 15 minutes. Gently squeeze excess liquid from bread, then stir bread into sausage mixture, discarding remaining half-and-half. Stir together stock and eggs and add to stuffing, then stir in chestnuts, herbs, salt, and pepper until combined well.",
        "Transfer stuffing to baking dish and cover with foil, then bake in upper third of oven 20 minutes. Remove foil and bake until top is crisp, about 20 minutes more."
    ],
    "ingredients": [
        "1 (1 1/4-pound) loaf country-style bread, crust discarded and bread cut into 3/4-inch cubes (8 cups)",
        "1/2 pound sliced bacon, cut crosswise into 1/2-inch pieces",
        "3 medium onions, coarsely chopped",
        "3 celery ribs, coarsely chopped",
        "1 pound bulk pork sausage",
        "1 turkey liver (optional), coarsely chopped",
        "1/4 cup Cognac or other brandy",
        "1 1/2 cups half-and-half",
        "1 cup turkey stock or low-sodium chicken broth",
        "2 large eggs",
        "1 (14- to 15-oz) jar peeled cooked whole chestnuts, coarsely crumbled (3 cups)",
        "1/4 cup coarsely chopped fresh flat-leaf parsley",
        "1 1/2 teaspoons dried sage, crumbled",
        "1 teaspoon dried thyme, crumbled",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bacon",
        "Sausage",
        "Cognac/Armagnac",
        "Fall",
        "Sage",
        "Chestnut",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut and Sausage Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-and-sausage-stuffing-108758"
}
