{
    "directions": [
        "Preheat oven to 350°F.",
        "Using chestnut knife or sharp paring knife, make large X on flat side of each chestnut through shell but not meat. Soak chestnuts in bowl of warm water to cover by 2 inches for 15 minutes, then drain well. Arrange chestnuts in 1 layer in shallow baking pan, then roast in middle of oven until shells curl away at X mark, about 15 minutes. Wearing protective gloves, peel away shells from chestnuts while still hot. In large pot boiling water, blanch chestnuts 2 minutes, then drain. Using kitchen towel, rub chestnuts to remove skins. Coarsely chop and reserve.",
        "In large stock pot over moderately high heat, heat butter until melted. Add garlic, shallots, leeks, and celery and sauté until very soft, about 8 minutes. Add thyme, bay leaf, and chestnuts. Cook, stirring occasionally until chestnuts are golden brown and aromatic, about 10 minutes. Add white wine and bring to boil, then reduce until no liquid remains, 15 to 18 minutes. Add 3/4 cup sherry and bring to boil, then reduce until almost no liquid remains, about 10 minutes. Add stock and bring to boil. Reduce heat to moderately low and continue cooking until chestnuts fall apart very easily, about 1 1/2 hours (If chestnuts are not completely cooked, the finished soup will be gritty.) Remove from heat and remove thyme and bay leaf. Stir in remaining 1/2 cup sherry and honey. Working in batches, transfer to blender and blend until smooth. Strain through fine-mesh strainer into clean pot. Stir in salt and pepper and keep warm.",
        "In heavy 2-quart pot over moderately high heat, bring truffle juice to boil, then lower heat and reduce by 1/4, about 5 minutes. Add butter and sherry and continue cooking until butter is melted, about 30 seconds. Remove from heat and whisk until frothy, about 2 minutes. (Alternatively, use hand blender to froth.) Stir in chives, salt, and pepper.",
        "Divide soup evenly among 10 shallow soup bowls. Place 1 tablespoon truffle garnish in center of each bowl. Serve immediately."
    ],
    "ingredients": [
        "1 3/4 pounds fresh chestnuts*",
        "6 tablespoons (3/4 stick) unsalted butter",
        "2 cloves garlic, finely chopped",
        "3 medium shallots, thinly sliced",
        "1 leek, white part only, thinly sliced",
        "2 stalks celery, chopped",
        "2 whole sprigs thyme",
        "1 fresh bay leaf",
        "2 1/4 cups white wine",
        "1 1/4 cups fino sherry",
        "2 quarts plus 2 cups chicken stock or low-sodium chicken broth",
        "1/3 cup honey",
        "2 teaspoons fine sea salt",
        "3/4 teaspoon freshly ground black pepper",
        "2/3 cup truffle juice**",
        "10 tablespoons (1 1/4 sticks) unsalted butter",
        "1/4 cup fino sherry",
        "4 teaspoons chives, minced",
        "1/2 teaspoon sea salt",
        "1/4 teaspoon freshly ground black pepper",
        "*If fresh chestnuts are unavailable, frozen will work. Avoid using sweetened jarred chestnuts.",
        "**Canned truffles are pressure-cooked during the canning process, creating a small amount of truffle-infused liquid, or truffle juice. If unavailable, substitute 2/3 cup finely chopped truffles mixed with 2 tablespoons chicken stock or low-sodium chicken broth."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Mushroom",
        "Nut",
        "Poultry",
        "Vegetable",
        "Roast",
        "Sauté",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Winter",
        "Chestnut",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut and Sherry Soup with Truffle Garnish",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-and-sherry-soup-with-truffle-garnish-240483"
}
