{
    "directions": [
        "Preheat oven to 325° F.",
        "In a large shallow baking pan toast bread in middle of oven until just dry, 15 to 20 minutes. Halve onions lengthwise and cut each half into 8 wedges. In a large heavy skillet cook onions in butter over moderate heat, stirring occasionally, until golden brown, about 25 minutes.",
        "If using canned chestnuts, rinse and drain. In a saucepan simmer vacuum-packed or canned chestnuts in 2 cups broth 15 minutes. Remove pan from heat and stir in currants. Let mixture stand 5 minutes.",
        "Chop parsley. In a large bowl toss together bread, onions, chestnut mixture, remaining 1 1/2 cups broth, herbs, and salt and pepper to taste and cool completely. Stuffing may be made up to this point 1 day ahead and chilled, covered. Bring stuffing to room temperature before proceeding.",
        "Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
        "In a shallow baking dish bake stuffing in preheated 325° F. oven 45 minutes (for moist stuffing, bake covered entire time; for less moist stuffing with a slightly crisp top, uncover halfway through baking time).",
        "Garnish stuffing with parsley."
    ],
    "ingredients": [
        "10 cups 1/4-inch dice seven-grain bread (about 1 pound)",
        "2 large onions",
        "1 stick (1/2 cup) unsalted butter",
        "3/4 pound vacuum-packed or canned whole chestnuts",
        "3 1/2 cups chicken broth",
        "1 cup dried currants",
        "1 cup packed fresh flat-leafed parsley leaves",
        "1 teaspoon chopped fresh sage leaves",
        "1/2 teaspoon chopped fresh thyme leaves",
        "Garnish if desired: chopped fresh flat-leafed parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Currant",
        "Chestnut",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut, Onion, and Currant Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-onion-and-currant-stuffing-14453"
}
