{
    "directions": [
        "Soak beans in cold water to cover by 2 inches in a bowl at room temperature at least 8 hours, or quick-soak (see cooks' note, below). Drain well in a colander.",
        "Cook pancetta, onion, and garlic in oil in a wide 6- to 8-quart heavy pot over moderate heat, stirring occasionally, until browned, about 8 minutes. Add tomatoes with juice, beans, broth, water, cheese rind, salt, and pepper and simmer, uncovered, until beans are tender, 45 minutes to 1 hour. Discard cheese rind and stir in chestnuts.",
        "Transfer 2 cups soup to a blender and purée until smooth (use caution when blending hot liquids), then return to pot. Stir in kale and simmer, uncovered, stirring occasionally, until leaves are tender, 10 to 15 minutes. Stir in thyme."
    ],
    "ingredients": [
        "1/2 pound dried white beans such as cannellini, Great Northern, or navy (about 1 1/4 cups), picked over and rinsed",
        "1/4 pound thinly sliced pancetta, chopped",
        "1 large onion, chopped",
        "3 garlic cloves, finely chopped",
        "3 tablespoons extra-virgin olive oil",
        "1 (14-ounce) can whole tomatoes in juice, drained, reserving juice, and chopped",
        "3 1/2 cups low-sodium chicken broth (28 fluid ounces)",
        "2 cups water",
        "1 piece Parmigiano-Reggiano rind (roughly 3 by 2 by 1/2 inch)",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon black pepper",
        "1 1/2 cups bottled peeled cooked whole chestnuts (8 ounces), halved",
        "1/2 pound cavolo nero or regular green kale, stems and center ribs discarded and leaves torn into bite-size pieces",
        "2 teaspoons chopped fresh thyme",
        "Accompaniment: grated Parmigiano-Reggiano",
        "Garnish: Parmigiano-Reggiano shavings; extra-virgin olive oil for drizzling; black pepper; fresh thyme sprigs; whole chestnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Bean",
        "Leafy Green",
        "Tomato",
        "Lunch",
        "Bacon",
        "Kale",
        "Winter",
        "Healthy",
        "Chestnut",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chestnut and Kale Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-and-kale-soup-108875"
}
