{
    "directions": [
        "Preheat oven to 325° F. and butter a 4-quart baking dish.",
        "In a shallow baking pan arrange bread pieces in one layer and bake in middle of oven, stirring occasionally, until pale golden, about 20 minutes. Transfer bread to a large bowl.",
        "In a large skillet cook bacon over moderate heat, stirring occasionally, until crisp and transfer with a slotted spoon to bread. To fat in skillet add butter, onions, celery, and rosemary and cook over moderately low heat, stirring occasionally, until vegetables are softened. Add chestnuts and cook, stirring, 1 minute. Add mixture to bread, tossing well, and stir in parsley and salt and pepper to taste. Transfer dressing to baking dish. Dressing may be made 1 day ahead and chilled, covered.",
        "Drizzle dressing with stock or broth and bake, covered, in oven 1 hour. Uncover dressing and bake 30 minutes more. (Dressing may be baked with turkey.)"
    ],
    "ingredients": [
        "6 cups torn bite-size pieces crusty country-style bread (about 1/2 pound)",
        "6 bacon slices, chopped",
        "4 tablespoons unsalted butter",
        "2 onions, chopped",
        "4 celery ribs, chopped",
        "1 tablespoon fresh rosemary leaves, minced",
        "1 pound fresh chestnuts*, shelled and peeled and chopped coarse or 3/4 pound vacuum-packed whole chestnuts*, chopped coarse (about 2 cups)",
        "1/2 cup packed fresh flat-leafed parsley leaves, washed, spun dry, and minced",
        "2 cupsturkey giblet stock or chicken broth",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bacon",
        "Fall",
        "Chestnut",
        "Parsley",
        "Gourmet"
    ],
    "title": "Chestnut and Bacon Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-and-bacon-dressing-13421"
}
