{
    "directions": [
        "Preheat oven to 350°F.",
        "Using chestnut knife or sharp paring knife, make large X on flat side of each chestnut through shell but not meat. Soak chestnuts in bowl of warm water to cover by 2 inches for 15 minutes, then drain well. Arrange chestnuts in 1 layer in shallow baking pan, then roast in middle of oven until shells curl away at X mark, about 15 minutes. Wearing protective gloves, peel away shells from chestnuts while still hot. In large pot boiling water, blanch chestnuts 2 minutes, then drain. Using kitchen towel, rub chestnuts to remove skins. Coarsely chop and reserve. Leave oven on.",
        "Butter 9- by 13-inch casserole dish with 1 tablespoon butter.",
        "On foil-lined baking sheet, toast bread in 350°F oven, tossing occasionally, until lightly browned, about 15 minutes. Place in large mixing bowl and set aside. Leave oven on.",
        "In heavy, large skillet over moderately high heat, melt 4 tablespoons butter. Add mushrooms and sauté, stirring, until golden brown, 7 to 8 minutes. Add another 2 tablespoons butter and heat until melted. Add onion and celery, and sauté until translucent, 6 to 7 minutes.",
        "Add mushroom mixture plus parsley and thyme to bread and gently stir to combine.",
        "In heavy, small pot over moderate heat bring chicken stock to gentle boil. Pour into bread mixture and gently toss to combine. Stir in egg, salt, and pepper. Transfer to casserole dish. The stuffing can be prepared up to this point and kept, covered and refrigerated, up to four hours. Bake until golden brown and heated through, about 30 minutes. Serve hot."
    ],
    "ingredients": [
        "1/3 pound fresh chestnuts*",
        "8 tablespoons (1 stick) unsalted butter",
        "2 1/2 cups sandwich bread, such as rye, sourdough, or pumpernickel, crust removed and cut into 1-inch cubes",
        "2 1/2 cups wild mushrooms",
        "1 medium onion, diced",
        "4 stalks celery, diced",
        "2/3 cup fresh parsley, coarsely chopped",
        "3 tablespoons plus 1 teaspoon fresh thyme leaves",
        "1 1/2 to 2 cups chicken stock or low-sodium chicken broth",
        "2 large eggs, lightly beaten",
        "1 tablespoon fine sea salt",
        "2 teaspoons freshly ground black pepper",
        "*If fresh chestnuts are unavailable, frozen will work. Avoid using sweetened jarred chestnuts."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Thanksgiving",
        "Dinner",
        "Stuffing/Dressing",
        "Fall",
        "Winter",
        "Chestnut",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut and Wild Mushroom Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-and-wild-mushroom-stuffing-240486"
}
