{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 375°F.",
        "Spread chestnuts in 1 layer in a large shallow baking pan, then roast in oven until dry and slightly darkened, about 20 minutes.",
        "While chestnuts roast, wash leeks in a bowl of cold water, agitating them, then lift out and drain well.",
        "Heat oil and butter in a 5- to 6-quart heavy pot over moderately high heat until foam subsides, then sauté leeks, onion, celery, carrots, and bay leaves, stirring occasionally, until vegetables are pale golden, 8 to 10 minutes. Add chestnuts and tamari and cook, stirring, until most of liquid is evaporated, 1 to 2 minutes. Add water (2 1/2 quarts) and salt and simmer, uncovered, stirring occasionally, until vegetables are tender, about 30 minutes. Remove from heat and stir in parsley and sage. Discard bay leaves.",
        "Purée soup in 3 batches in a blender until smooth (use caution when blending hot liquids), transferring to a bowl. Pour purée through a medium-mesh sieve into cleaned pot, pressing hard on and then discarding solids. Bring soup to a simmer and stir in Sherry, pepper, and salt to taste, then remove from heat.",
        "Heat oil and butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then cook bread cubes with sage, turning occasionally, until croutons are golden, 6 to 10 minutes. Add chestnuts and cook, stirring, 2 minutes. Transfer to a large bowl and toss with sea salt.",
        "Ladle soup into bowls and sprinkle each serving with about 1/3 cup topping."
    ],
    "ingredients": [
        "2 (7 1/2-oz) jars peeled cooked whole chestnuts, rinsed and drained (2 2/3 cups)",
        "2 large leeks (white and pale green parts only), coarsely chopped (1 1/4 cups)",
        "1 tablespoon olive oil",
        "1 tablespoon unsalted butter",
        "1 large onion, coarsely chopped (2 cups)",
        "2 celery ribs, coarsely chopped (1 1/4 cups)",
        "2 medium carrots, coarsely chopped (1 cup)",
        "1 1/2 Turkish bay leaves or 1 California",
        "1 tablespoon tamari or soy sauce",
        "2 1/2 qt water",
        "2 teaspoons salt, or to taste",
        "1/3 cup chopped fresh flat-leaf parsley",
        "1 teaspoon chopped fresh sage",
        "2 tablespoons medium-dry Sherry or Madeira",
        "1/2 teaspoon black pepper",
        "2 tablespoons olive oil",
        "2 tablespoons unsalted butter",
        "1/2 sourdough loaf, crust discarded and bread cut into 1/4-inch cubes (4 cups)",
        "1 teaspoon chopped fresh sage",
        "2 (7 1/2-oz) jars peeled cooked whole chestnuts, chopped (2 2/3 cups)",
        "1 teaspoon flaky sea salt (preferably Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Herb",
        "Nut",
        "Appetizer",
        "Thanksgiving",
        "Vegetarian",
        "Fall",
        "Healthy",
        "Sage",
        "Chestnut",
        "Gourmet"
    ],
    "title": "Chestnut Soup with Sourdough Sage Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-soup-with-sourdough-sage-croutons-232967"
}
