{
    "directions": [
        "Spread the bread out on a baking sheet and let dry overnight.",
        "Preheat an oven to 375°F. Butter a 13-by-9-inch baking dish.",
        "In a large fry pan over medium heat, melt the butter. Add the onion and celery and sauté, stirring occasionally, until tender and translucent, 2 to 3 minutes. Using a slotted spoon, transfer to a large bowl.",
        "In the same pan, brown the sausage and beef, stirring and crumbling with a fork, until cooked through, about 10 minutes. Using the slotted spoon, transfer the meat to the bowl with the onion mixture.",
        "In another large bowl, toss the bread with the milk until well blended. Let stand, stirring occasionally, until the milk is absorbed and the bread is evenly moistened, 6 to 8 minutes.",
        "Add the onion-meat mixture, the chestnuts, parsley and thyme to the bowl with the bread. Season with salt and pepper and stir to mix well.",
        "Transfer the dressing to the prepared baking dish and bake until browned and crispy, 1 1/4 to 1 1/2 hours. Serves 10 to 12.",
        "Note:",
        "If desired, you can pack the dressing loosely in the body and neck cavities of the turkey. Secure the neck flap with kitchen string or pin it to the back with toothpicks or trussing pins. Tying the legs together will help hold the stuffing in the body cavity. For turkeys weighing 16 lb. or less, add 30 minutes to the total roasting time. For turkeys weighing more than 16 lb., add 1 hour to the total roasting time."
    ],
    "ingredients": [
        "1-lb. loaf French bread, torn into small  &nbsp pieces",
        "3 Tbs. unsalted butter",
        "1 yellow onion, chopped",
        "1 celery stalk, chopped",
        "1/2 lb. well-seasoned fresh bulk pork sausage",
        "1/4 lb. ground lean beef",
        "4 cups milk",
        "1 jar (14.8 oz.) prepared French chestnuts,  &nbsp chopped",
        "3 Tbs. chopped fresh flat-leaf parsley",
        "1 tsp. chopped fresh thyme (optional)",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chestnut and Sausage Dressing",
    "url": "http://www.williams-sonoma.com/recipe/chestnut-and-sausage-dressing.html"
}
