{
    "directions": [
        "Put wild rice in a fine-mesh sieve and rinse it under cold running water, swishing rice with your hand until water runs clear. Transfer rice to a medium bowl and add water to cover. Pour off any black bits or floating kernels, and then pour rice back into sieve to drain.",
        "Cook rices separately: Combine wild rice with 1/4 teaspoon salt and 1 cup water in a small saucepan. Bring to a simmer, cover, reduce heat to low, and steam until rice is tender and curling into a C shape, 20-25 minutes.",
        "At the same time, combine basmati rice, 1/2 teaspoon salt, and 13/4 cups water in another small saucepan. Bring to a simmer, cover, reduce heat to low, and steam until rice is tender, 25 minutes.",
        "Combine rices in a large bowl and cover.",
        "Cook the vegetable base: Heat butter in a large skillet over medium heat. Add celery and onion and cook, stirring often, until vegetables are limp but still bright, about 10 minutes. Add garlic and thyme and cook, stirring, for 5 minutes.",
        "Pour over rices, scraping the pan for the juices, and stir to combine. Add pistachios, chestnuts, and parsley and mix thoroughly."
    ],
    "ingredients": [
        "1/2 cup natural wild rice",
        "Fine sea salt",
        "1 cup basmati rice",
        "6 tablespoons (3/4 stick) salted butter",
        "2 cups diced celery (from 5 stalks)",
        "2 cups diced yellow onion (from 1 large)",
        "3 garlic cloves, minced",
        "2 teaspoons minced fresh thyme",
        "1/2 cup shelled salted pistachios, crushed",
        "8 ounces cooked chestnuts, roughly chopped",
        "2 tablespoons minced fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Christmas",
        "Easter",
        "Thanksgiving",
        "Kid-Friendly",
        "Mother's Day",
        "Father's Day",
        "Stuffing/Dressing",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chestnut, Wild Rice, and Pistachio Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-wild-rice-and-pistachio-dressing-51238070"
}
