{
    "directions": [
        "Coarsely chop chestnuts.",
        "Cook pancetta in 3 tablespoons butter in a large heavy saucepan over moderate heat, stirring, until crisp on edges, about 5 minutes. Add onion and garlic and cook, stirring, until onion is softened. Add chestnuts and water and simmer, stirring, until liquid is reduced by half. Discard garlic.",
        "Transfer mixture to a bowl and mash to a coarse paste with a fork. Peel half of apple and cut enough of peeled half into 1/4-inch dice to measure 3 tablespoons. Reserve remaining (unpeeled) apple. Stir diced peeled apple into chestnut mixture with parmesan, parsley, and salt and pepper to taste.",
        "Put 1 won ton wrapper on a work surface, keeping remaining wrappers in plastic wrap, and mound 1 scant tablespoon of filling in center. Lightly brush edges of wrapper with water and top with a second wrapper, pressing down around filling to force out air. Trim excess dough with cutter and seal edges well, pressing them together with your fingertips. Transfer ravioli to a dry kitchen towel, then make more in same manner.",
        "Cut enough of unpeeled apple into 1/4-inch dice to measure 3 tablespoons and toss with lemon juice.",
        "Heat remaining 4 tablespoons butter in a large heavy skillet over moderate heat until foam subsides and butter begins to turn brown. Stir in sage and cook, stirring, until sage is crisp and butter is golden brown. Season with salt and pepper.",
        "Add ravioli to a 6-quart pot of salted boiling water, then cook at a slow boil, stirring gently occasionally, until tender, 3 to 5 minutes. Carefully transfer ravioli with a slotted spoon to a colander to drain. Slide ravioli into sage butter and cook over moderate heat, stirring gently, 1 minute.",
        "Sprinkle ravioli with unpeeled apple and season with pepper."
    ],
    "ingredients": [
        "1 cup roasted, shelled, and skinned chestnuts; see how to roast fresh chestnuts ; (1/2 lb in shell or 7 oz bottled whole)",
        "2 oz sliced pancetta or bacon, finely chopped",
        "7 tablespoons unsalted butter",
        "1/4 cup finely chopped onion",
        "1 large garlic clove, smashed",
        "1/4 cup water",
        "1 Granny Smith apple",
        "2 tablespoons finely grated parmesan",
        "1 tablespoon finely chopped fresh flat-leaf parsley",
        "48 won ton wrappers (12-oz package)",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon finely chopped fresh sage",
        "Special equipment: a 2 3/4-inch round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Nut",
        "Pasta",
        "Appetizer",
        "Fall",
        "Sage",
        "Chestnut",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut Ravioli with Sage Browned Butter",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-ravioli-with-sage-browned-butter-104234"
}
