{
    "directions": [
        "Cook bacon in heavy large skillet over medium-high heat until brown and crisp. Using slotted spoon, transfer bacon to large bowl. Pour off all but 2 tablespoons drippings from skillet. Add onions and celery to drippings in skillet. Cover and cook over medium heat until vegetables are soft, stirring occasionally, about 12 minutes. Add vegetables to bacon; mix in apples, thyme, and sage, then chestnuts. (Can be made 1 day ahead. Cover and chill. Reheat to lukewarm before continuing.)",
        "Add corn bread stuffing mix to chestnut mixture. Mix in 1 3/4 cups broth. Drizzle with butter.",
        "Loosely fill main cavity and neck cavity of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 cup to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover dish with buttered foil, buttered side down. Bake stuffing in dish — alongside turkey or while turkey is resting — until heated through, about 25 minutes. Uncover stuffing in dish. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish. Add enough extra broth to stuffing to moisten (3/4 cup to 1 1/4 cups). Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "1/2 pound thick-cut bacon slices, cut crosswise into 1/2-inch-wide strips",
        "4 cups chopped onions",
        "3 cups chopped celery",
        "1 cup chopped dried apples",
        "1 tablespoon chopped fresh thyme",
        "1 1/2 teaspoons dried rubbed sage",
        "2 7.4-ounce jars roasted whole chestnuts, coarsely broken",
        "8 cups dried corn bread stuffing mix (from two 16-ounce packages)",
        "1 3/4 cups (or more) low-salt chicken broth",
        "2 tablespoons (1/4 stick) butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Pork",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Apple",
        "Bacon",
        "Corn",
        "Fall",
        "Chestnut",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chestnut, Bacon, Dried Apple, and Corn Bread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/chestnut-bacon-dried-apple-and-corn-bread-stuffing-107290"
}
