{
    "directions": [
        "Prepare pork tenderloin first (recipe below).",
        "While pork is resting, prepare Idahoan(R) Baby Reds(R) Flavored Mashed Potatoes following package instructions.",
        "Blend in chevre cheese while potatoes are still warm.",
        "Stir in mint and peas. Garnish with a few baby mint leaves.",
        "For the pork tenderloin:  Mix together the garlic powder, chili powder, Italian seasonings, pepper and salt. Rub the seasonings all over the tenderloin. Or, season to taste with another flavoring of your choice. Heat a gas grill, turning all the burners to high until the grill is fully heated, 10 to 15 minutes.",
        "Put the pork on the hot grill grate. Close the lid and grill for 7 minutes. Turn the pork over, close the lid, and grill for another 6 minutes.",
        "Turn off the heat (keep the lid closed) and continue to cook the pork for another 5 minutes. At this point, an instant-read thermometer inserted into the middle of the thickest end of the tenderloin should read 145 degrees  to 150 degrees F. (If not, close the lid and let the pork continue to roast in the residual grill heat.)",
        "Remove the pork from the grill and let rest for 5 minutes before carving. Cut across the grain into 1/2-inch slices and serve immediately.",
        "To prepare in oven: Preheat oven to 375 degrees F.",
        "Place prepared roast in a foil lined shallow baking dish. Cook for 30 minutes, then test with an instant read thermometer to reach 145 to 150 degrees F.",
        "When pork is done, wrap in foil and let rest 10 minutes.",
        "Cut across the grain into 1/2-inch slices, place three pieces on skewer and serve on top of the Idahoan Chevre Mashed Potatoes with Peas. Use drippings from the roast to drizzle on the roast when serving."
    ],
    "ingredients": [
        "1 (4 ounce) package Idahoan® Baby Reds Flavored Mashed Potatoes",
        "4 ounces chevre cheese",
        "1 tablespoon fresh mint, chopped",
        "1 cup baby peas, thawed and warmed",
        "Mint leaves for garnish",
        "Pork Tenderloin:",
        "1 (1 pound) pork tenderloin",
        "2 teaspoons garlic powder",
        "1 teaspoon chili powder",
        "1 tablespoon Italian seasoning",
        "1 teaspoon ground black pepper",
        "1 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chevre Mashed Potatoes with Peas and Grilled Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/239326/chevre-mashed-potatoes-with-peas-and/"
}
