{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 large baking sheets with parchment. Place almonds in center of third (unlined) rimmed baking sheet, forming 1/4-inch-thick layer.",
        "Finely grind almond paste, 1 cup sugar, and cinnamon in processor. Add egg whites; process until well blended. Transfer dough to large resealable plastic bag. Press dough down into 1 corner of bag. Using scissors, snip off corner, leaving 1/2-inch opening. Working in batches, squeeze dough from bag in 2 1/2-inch-long strips atop almonds on sheet. Sprinkle some of loose almonds on sheet over strips; carefully roll strips in almonds to coat lightly (dough will be soft and sticky). Transfer cookies to prepared baking sheets, spacing apart.",
        "Bake cookies until light golden brown, reversing position of sheets halfway through baking, about 12 minutes. Let cookies stand on sheets 5 minutes; transfer to rack. Sift powdered sugar over cookies.",
        "Simmer jam in heavy small saucepan over medium heat until jam is bubbling thickly, about 30 seconds. Cool.",
        "Spread 1/4 to 1/2 teaspoon jam over bottom of 1 cookie. Top with second cookie, bottom side down. Transfer sandwich to plate. Repeat with remaining cookies and jam. DO AHEAD: can be made 3 weeks ahead. Store airtight in freezer. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups sliced almonds",
        "1 7-ounce tube almond paste, lightly crumbled",
        "1 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 cup egg whites (about 2 large)",
        "Powdered sugar",
        "1/3 cup seedless raspberry jam",
        "Ingredient info: Tubes of almond paste are available in the baking aisle of most supermarkets and at specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Christmas",
        "Kid-Friendly",
        "Low Cal",
        "Almond",
        "Low Cholesterol",
        "Christmas Eve",
        "Jam or Jelly"
    ],
    "title": "Chewy Almond-Raspberry Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chewy-almond-raspberry-sandwich-cookies-362571"
}
