{
    "directions": [
        "In a medium bowl, whisk together the flour, oats, coconut, baking soda, and salt.",
        "In a stand mixer fitted with the paddle attachment, cream the butter, brown sugar, and granulated sugar on medium-high speed fluffy and yellow.",
        "Add the vanilla and the eggs, one at a time, beating after each addition for 30 seconds.",
        "Reduce the speed to medium-low and add the flour mixture in three parts, beating for about 10 seconds after each addition. Add the chocolate chips and mix until just combined.",
        "Cover the bowl with plastic wrap and refrigerate for at least 30 minutes or overnight. Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.",
        "Scoop out portions of dough the size of golf balls, roll them between your palms loosely, and place them 2 inches apart on the baking sheet (you’ll need to bake the cookies in several batches). Bake for 14 minutes, or until the cookies are set around the edges. Halfway through baking, remove the pan from the oven and drop it onto a heat-safe flat surface, such as the open oven door (this deflates the cookies, creating a deliciously chewy center and crisp edges—in other words . . . perfect!). Immediately return the cookies to the oven, rotating the pan 180 degrees, and complete baking, until the center resists light pressure but is still somewhat soft.",
        "Let the cookies cool on the baking sheet for 5 minutes, then transfer them to a wire rack to cool completely. Repeat to make the rest of the cookies.",
        "To store extra dough and make future cookie baking a breeze, roll out balls and freeze them on a cookie sheet. Once they’re set, transfer them to a resealable freezer bag or airtight container and keep them frozen for up to 3 months. Let the dough balls sit out at room temperature for 15 minutes before baking as usual."
    ],
    "ingredients": [
        "1/2 cup whole wheat flour",
        "1 cup quick-cooking rolled oats",
        "1 cup unsweetened shredded coconut",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "1 stick (4 ounces) unsalted butter, at room temperature",
        "1/2 cup packed light brown sugar",
        "1/4 cup granulated sugar",
        "1 teaspoon pure vanilla extract",
        "1 large egg, at room temperature, plus 1 egg yolk",
        "1/2 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Cookies",
        "Dessert",
        "Chocolate",
        "Coconut",
        "Oat",
        "Bake"
    ],
    "title": "Chewy Coconut–Chocolate Chip Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chewy-coconut-chocolate-chip-cookies"
}
