{
    "directions": [
        "Mix first 9 ingredients in medium bowl. Place 1 chicken thigh on work surface. Fill area where bone was removed with 2 tablespoons stuffing. Wrap chicken thigh around filling and tie with kitchen string to hold together. Repeat with remaining chicken thighs and stuffing. Sprinkle generously with salt and pepper.",
        "Heat olive oil in heavy large skillet over medium-high heat. Add pancetta; sauté until light brown and fat is rendered, about 5 minutes. Transfer pancetta to paper towels to drain. Add chicken to drippings in skillet; cook until golden on all sides, about 10 minutes. Transfer to plate. Add onion and garlic to skillet; sauté until tender, about 10 minutes. Return pancetta to skillet. Add wine; boil until mixture is reduced to 2 cups, about 12 minutes. Add broth, tomatoes, bay leaf, basil, and chicken thighs; bring to boil. Reduce heat; simmer uncovered until chicken is cooked through, about 35 minutes. (Can be made 1 day ahead. Cool slightly. Chill until cold, then cover and keep chilled. Rewarm over medium heat before continuing.)",
        "Transfer chicken to bowl; cover to keep warm. Simmer sauce in skillet until slightly thickened and reduced to 4 cups, about 10 minutes. Season with salt and pepper.",
        "Meanwhile, cook noodles in large pot of boiling salted water until just tender but still firm to bite. Drain. Transfer noodles to large platter. Top with chicken and sauce and serve."
    ],
    "ingredients": [
        "4 ounces (about 1 link) sweet Italian sausage, casing removed, meat crumbled",
        "1/2 cup fresh breadcrumbs from crustless day-old French bread",
        "1/2 cup freshly grated Parmesan cheese (about 1 1/2 ounces)",
        "1 large shallot, minced",
        "1 large egg",
        "2 tablespoons chopped fresh parsley",
        "2 teaspoons chopped fresh thyme",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "8 large skinless boneless chicken thighs (about 2 1/2 pounds total)",
        "2 tablespoons olive oil",
        "1/4 cup chopped pancetta or bacon",
        "3/4 cup finely chopped onion",
        "6 garlic cloves, minced",
        "1 750-ml bottle Chianti or other dry red wine",
        "3 cups canned low-salt chicken broth",
        "2 cups canned crushed tomatoes in puree",
        "1 bay leaf",
        "1 teaspoon dried basil",
        "1 pound egg noodles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Chicken",
        "Pasta",
        "Poultry",
        "Braise",
        "Sauté",
        "Dinner",
        "Sausage",
        "Red Wine",
        "Winter",
        "Noodle",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chianti-Braised Stuffed Chicken Thighs on Egg Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/chianti-braised-stuffed-chicken-thighs-on-egg-noodles-106217"
}
