{
    "directions": [
        "Place the chicken in a large bowl. Season liberally with pepper and grey salt. Toss with fennel seed and smoked paprika. Sprinkle the masa harina or flour over the chicken and toss to coat.",
        "Heat a cast iron pot or Dutch oven over medium-high heat. Add 1/4 cup olive oil, when it begins to smoke, add the chicken, leaving the excess flour or masa harina in the bowl. Spreading the chicken evenly so it covers the bottom of the pot in 1 layer. (You may have to cook the chicken in batches to do this, adding more olive oil as necessary.)",
        "Leave the chicken alone, without turning it, so the meat will brown and caramelize, about 5 minutes per side. The chicken has a lot of moisture in it, so a good amount of steam will come from the pan before it is caramelized. As it browns, turn each piece with tongs. Once all sides are caramelized, remove the meat from the pan with a slotted spoon, leaving juices in the pot.",
        "Over medium heat, add another 1/4 cup of olive oil to pan along with the onions and garlic, cook until onions soften and caramelize, about 5 minutes. Add the jalapenos, cook until softened, about 2 minutes. Add the tomato paste, chili powder and thyme, stir to combine. Add wine, bring to a simmer, then add the chicken stock, diced tomatoes and cooked chicken. Stir to incorporate everything, season with salt. Simmer until chicken is wonderfully tender, about 45 minutes.",
        "Add the white beans, zucchini, poblano, red pepper and scallions. Bring to a simmer and cook until vegetables are tender, about 10 to 15 minutes. Stir in basil. Serve immediately or cool and store in the refrigerator for up to 3 days. To serve, sprinkle with grated Parmesan and drizzle with olive oil."
    ],
    "ingredients": [
        "3 pounds chicken thighs, skin and bones removed, cut into 3/4-inch chunks",
        "Freshly ground black pepper, to taste",
        "Grey salt",
        "4 teaspoons fennel seeds",
        "2 teaspoons smoked paprika",
        "1 cup masa harina or all purpose flour",
        "1/2 cup extra-virgin olive oil, plus additional as needed to cook the chicken and for garnish",
        "4 red onions, minced",
        "6 cloves garlic, minced",
        "2 green jalapeno peppers (with seeds), diced",
        "2 red jalapeno peppers (with seeds), diced",
        "1/4 cup tomato paste",
        "6 tablespoons chili powder",
        "1 tablespoon minced fresh thyme leaves",
        "2 cups white wine",
        "4 cups chicken stock",
        "1 (12-ounce) can diced tomato in juices",
        "2 (15-ounce) cans white beans, rinsed and drained or 4 cups cooked white beans",
        "3 zucchini, cut into 3/4-inch pieces",
        "1 poblano pepper, diced",
        "1 orange or red bell pepper, diced",
        "1 bunch scallions, sliced",
        "1/2 cup torn basil leaves",
        "Grated Parmesan, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Bean Chili",
        "Beans and Legumes",
        "Chili",
        "Chicken Chili",
        "American",
        "Southwestern",
        "White Chicken Chili",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Zucchini Recipes",
        "Jalapeno Recipes",
        "Recipes for Parties",
        "Super Bowl",
        "Tailgate Party",
        "Sauteing Recipes"
    ],
    "title": "Chiarello Chicken and White Bean Chili With Veggies",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/chiarello-chicken-and-white-bean-chili-with-veggies-recipe"
}
