{
    "directions": [
        "Sift the flour, 5 tablespoons sugar, and salt into a large bowl, and make a well in the center. Whisk together the eggs, butter, olive oil, wine, rum, and lemon zest in a separate bowl until smooth; pour into the flour mixture. Stir together until a dough forms, then knead on a lightly floured work surface until smooth and elastic, about 10 minutes. Place into a lightly oiled bowl, cover with plastic wrap, and set aside for 1 hour.",
        "While the dough rests, stir together 5 cups white sugar, cocoa powder, cinnamon, and cornstarch in a large saucepan. Slowly pour in the milk, whisking constantly. Stir in the vanilla. Add the unsweetened chocolate, and bring to a simmer over medium heat, stirring constantly. Simmer for 5 minutes, stirring constantly, then remove from the heat and allow the sauce to cool to room temperature.",
        "Transfer the dough to a lightly floured work surface. Roll with a well-floured rolling pin to a thickness of 1/8 of an inch. Use a sharp knife to cut the dough into 2x5 inch rectangles. Alternately, pinch off an egg-sized piece of dough and roll it through a pasta machine. Repeat with the remaining dough.",
        "Heat oil in deep-fryer to 375 degrees F (190 degrees C).",
        "Fry the Chiacchiere a few at a time until golden brown; remove and drain on a paper towel-lined plate. To serve, pour the cooled Sanguinaccio sauce into a bowl, and sprinkle with chocolate chips to garnish. Place the fried Chiacciere onto a serving platter and sprinkle with confectioner's sugar to serve."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "5 tablespoons white sugar",
        "1 pinch salt",
        "2 eggs",
        "3 tablespoons butter, melted",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons dry white wine",
        "2 tablespoons rum",
        "1 teaspoon grated lemon zest",
        "5 cups white sugar",
        "1 cup unsweetened cocoa powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 cups cornstarch",
        "1 quart whole milk",
        "1 teaspoon vanilla extract",
        "13 (1 ounce) squares unsweetened chocolate",
        "1 quart vegetable oil for frying",
        "1/2 cup miniature semisweet chocolate chips",
        "1/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chiacchiere with Sanguinaccio",
    "url": "http://allrecipes.com/recipe/160475/chiacchiere-with-sanguinaccio/"
}
