{
    "directions": [
        "Heat oven to 375 degrees F.",
        "Wash the turkey, inside and out, and dry well. Coat inside and outside with olive oil. Season turkey on the outside with salt and pepper, pressing it in to adhere. Place 2 rosemary sprigs, 1 thyme sprig, 1 sage sprig, 1 oregano sprig and lemon halves inside the cavity of the turkey. Place cooling rack or roasting rack in bottom of large roasting pan. Place turkey on rack, and arrange carrots, celery and remaining herbs on bottom of pan around turkey. Pour 4 cups (1 carton) chicken broth and water over vegetables and herbs.",
        "Roast until an instant-read thermometer (inserted deep into the thigh but away from the bone) reads 165 degrees F and juices in the thigh run clear when pierced with a fork, about 2 to 2 1/2 hours, basting with pan broth every 30 minutes. Remove turkey from the pan and let rest for 15 minutes before carving. Strain and reserve pan juices, and discard vegetables.",
        "While turkey is resting, make the gravy. In a medium heavy saucepan, cook flour and butter over medium heat for 3 to 4 minutes, or until a blond roux is formed. Add pan juices and 4 cups (1 carton) of chicken broth; heat to boiling over high heat. Reduce the heat and let simmer until thickened and ready to serve.",
        "Carve turkey as desired, and serve with gravy."
    ],
    "ingredients": [
        "1 (12 pound) whole turkey",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 sprigs fresh rosemary",
        "2 sprigs fresh thyme",
        "2 sprigs fresh sage",
        "2 sprigs fresh oregano",
        "1 lemon, halved",
        "2 carrots, halved",
        "4 stalks celery, halved",
        "2 (32 ounce) cartons Progresso® chicken broth",
        "4 cups water",
        "3/4 cup all-purpose flour",
        "3/4 cup butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chiarello's Herb Roasted Turkey",
    "url": "http://allrecipes.com/recipe/215610/chiarellos-herb-roasted-turkey/"
}
