{
    "directions": [
        "Add the chicken to a large stockpot, cover with water and add a large pinch of salt. Bring to a boil and cook until tender, about 30 minutes. Remove the chicken from the pot and set aside to cool. When cool enough to handle, shred the chicken and set aside. Reserve 3 1/3 cups of the broth (1 cup is for the chicken gravy, supplement with boxed stock if you don't have enough.)",
        "Preheat the oven to 350 degrees F. Spray a 13- by 9-inch baking dish with cooking spray.",
        "In a large saucepan, combine 2 1/3 cups of the reserved broth, the Chicken Gravy, green chiles, onions, garlic, sour cream, cumin, salt and pepper. Bring the mixture to a boil, stirring constantly. Remove from the heat.",
        "Spread 1 cup of the mixture into the prepared baking dish. Arrange a layer of 6 tortillas over the mixture, and then top with 1 cup shredded chicken and 1/2 cup of the Cheddar. Repeat this layer three more times, ending with cheese. Spread any remaining mixture over the cheese. Make sure all of the tortillas are covered or they will get very hard during baking. Bake uncovered for 30 minutes.",
        "Melt the butter in a medium saucepan and whisk in the flour to make a roux. Cook over medium heat, whisking constantly, until the mixture bubbles and the flour turns light brown in color. Gradually whisk in the stock and milk and continue to stir while cooking over medium heat. When the mixture thickens, after about 5 minutes, whisk in some salt and pepper."
    ],
    "ingredients": [
        "4 boneless, skinless chicken breasts",
        "Salt",
        "Chicken Gravy, recipe follows",
        "1 cup canned green chiles, chopped and drained",
        "1 medium onion, finely chopped",
        "1 clove garlic, minced",
        "1 cup sour cream",
        "1/2 teaspoon cumin",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "Cooking spray",
        "Twenty-four 6-inch corn tortillas",
        "3 cups shredded Cheddar",
        "6 tablespoons butter",
        "6 tablespoons all-purpose flour",
        "1 cup chicken stock",
        "1 cup milk",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Casserole",
        "Casserole",
        "Chicken",
        "Poultry Recipes",
        "Cheddar",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Chicken Tortilla Casserole",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/chicken-tortilla-casserole-recipe"
}
