{
    "directions": [
        "Cut out and reserve wings and backbone from chicken. Cut breast in half through bone, then cut off legs and cut to separate into thighs and drumsticks (for a total of 6 serving pieces, not including wings and backbone). Pat chicken pieces dry and sprinkle with 1 teaspoon salt.",
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over medium heat until it shimmers, then brown chicken breasts, skin sides down, without turning, 5 minutes. Transfer to a plate. Brown thighs and legs, turning once, 8 to 10 minutes, transferring to plate. Brown wings and backbone in same manner.",
        "Cook shallots in butter with remaining tablespoon oil in a 5- to 6-quart heavy pot over medium heat, stirring frequently, until soft, 8 to 10 minutes. Add garlic, ginger, turmeric, and paprika and cook, stirring, 3 minutes.",
        "Add chicken with any juices from plate, saffron (if using), and 1/2 teaspoon salt to shallot mixture and turn chicken to coat. Add water and bring to a boil, covered, then cook at a bare simmer, covered, 30 minutes.",
        "Turn chicken and add orange preserves, cinnamon stick, thyme, cilantro sprigs, and apricots. Simmer, covered, 10 minutes. Uncover and simmer until chicken is very tender, 10 to 15 minutes more.",
        "Heat oil in a small heavy skillet over medium heat until it shimmers, then stir in pine nuts, turmeric, paprika, and cayenne (if using) and cook, stirring frequently, until nuts are lightly browned, 1 to 2 minutes (watch carefully; they burn easily). Transfer to a small bowl.",
        "Transfer chicken to a platter and keep warm, covered. If sauce is not thick, boil, stirring occasionally, until reduced to about 1 cup. Discard herb sprigs, cinnamon stick, wings, and backbone. Stir in chopped cilantro and spoon sauce over chicken. Sprinkle with nuts.",
        "Chateau Reynella McLaren Vale Grenache '04"
    ],
    "ingredients": [
        "1 whole chicken (about 3 1/2 pound)",
        "2 tablespoons extra-virgin olive oil, divided",
        "3 large shallots, finely chopped (1 cup)",
        "1 tablespoon unsalted butter",
        "2 garlic cloves, minced",
        "1 tablespoon grated peeled ginger",
        "1/4 teaspoon turmeric",
        "1/4 teaspoon sweet paprika",
        "Pinch of saffron threads (optional)",
        "1 cup water",
        "2 tablespoons blood-orange preserves or bitter-orange marmalade",
        "1 (2-inch) cinnamon stick",
        "1 thyme sprig",
        "2 cilantro sprigs",
        "6 dried apricots, chopped",
        "1 tablespoon finely chopped cilantro or flat-leaf parsley",
        "1 tablespoon olive oil",
        "1/4 cup pine nuts",
        "1/4 teaspoon turmeric",
        "1/4 teaspoon sweet paprika",
        "Pinch of cayenne (optional)",
        "Garnish: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Ginger",
        "Dinner",
        "Orange",
        "Apricot",
        "Pine Nut",
        "Spice",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chicken Tagine with Apricots and Spiced Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tagine-with-apricots-and-spiced-pine-nuts-241506"
}
