{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "Season chicken on both sides with salt and pepper. Dredge each breast in the flour and tap off excess, then dip in the egg and let excess drip off, then dredge on both sides in the bread crumbs.",
        "Divide the oil between 2 large saute pans and heat over high heat until almost smoking. Add 2 chicken breasts to each pan and cook until golden brown on both sides, about 2 minutes per side. Transfer to a baking sheet and top each breast with some Tomato Sauce, a few slices of the mozzarella, salt and pepper, and a tablespoon of Parmesan. Bake in the oven until the chicken is cooked through and the cheese is melted, about 5 to 7 minutes. Remove from the oven and garnish with basil or parsley leaves.",
        "Heat olive oil in a medium saucepan over medium heat. Add onions and garlic and cook until soft. Add pureed tomatoes with their juices, crushed tomatoes, tomato paste, 1 cup water, bay leaf, parsley, Cubano pepper, and bring to a boil. Season, to taste, with salt and pepper. Reduce heat and cook until slightly thickened, about 30 minutes."
    ],
    "ingredients": [
        "4 boneless, skinless chicken breasts, pounded thin",
        "Salt and freshly ground black pepper",
        "2 cups all-purpose flour, seasoned with salt and pepper",
        "4 large eggs, beaten with 2 tablespoons water and seasoned with salt and pepper",
        "2 cups panko bread crumbs",
        "1 cup vegetable oil or pure olive oil",
        "Tomato Sauce, recipe follows",
        "1 pound fresh mozzarella, thinly sliced",
        "1/4 cup freshly grated Parmesan",
        "Fresh basil or parsley leaves, for garnish",
        "2 tablespoons olive oil",
        "1 large Spanish onion, finely chopped",
        "4 cloves garlic, smashed with some kosher salt to make a paste",
        "Two 28-ounce cans plum tomatoes and their juices, pureed in a blender",
        "One 16-ounce can crushed tomatoes",
        "1 small can tomato paste",
        "1 bay leaf",
        "1 small bunch Italian parsley",
        "1 Cubano chile pepper, chopped",
        "Salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "European Recipes",
        "Poultry Recipes",
        "Chicken",
        "Cheese",
        "Mozzarella Recipes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Chicken Parmigiana",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/chicken-parmigiana-recipe"
}
