{
    "directions": [
        "For the chicken: Melt the butter in a pot over medium-high heat and add the olive oil. Sprinkle the chicken with salt and pepper. In 2 batches, brown the chicken on both sides and remove to a clean plate.",
        "In the same pot, add the diced carrots, celery and onions. Stir and cook for 3 to 4 minutes over medium-low heat. Stir in the ground thyme and turmeric, then pour in the chicken broth. Stir to combine, then add the browned chicken. Cover the pot and simmer for 20 minutes.",
        "For the dumplings: While the chicken is simmering, make the dough for the dumplings. Sift together the flour, cornmeal, baking powder and salt in a bowl, then add 1 1/2 cups of the half-and-half, stirring gently to combine. Set aside.",
        "Remove the chicken from the pot and set aside on a plate. Use 2 forks to remove the chicken from the bones. Shred the chicken, then add it back to the pot. Mix together the remaining 1/2 cup half-and-half and flour, then add it to the pot and stir to combine.",
        "Drop tablespoons of dumpling dough into the simmering pot. Add the minced parsley if using. Cover the pot and continue to simmer for 15 minutes. Check the seasoning; add salt if needed. Allow to sit for 10 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "1 whole chicken, cut into pieces (cut-up fryer)",
        "Salt and freshly ground black pepper",
        "1/2 cup finely diced carrots",
        "1/2 cup finely diced celery",
        "1 medium onion, finely diced",
        "1/2 teaspoon ground thyme",
        "1/4 teaspoon turmeric",
        "6 cups low-sodium chicken broth",
        "1 1/2 cups all-purpose flour",
        "1/2 cup yellow cornmeal",
        "1 heaping tablespoon baking powder",
        "1 teaspoon kosher salt",
        "2 cups half-and-half",
        "2 tablespoons all-purpose flour",
        "2 tablespoons minced fresh parsley, optional",
        "Salt, as needed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken and Dumpling",
        "Chicken",
        "Poultry Recipes"
    ],
    "title": "Chicken and Dumplings",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-and-dumplings"
}
