{
    "directions": [
        "Bring a large pot of lightly salted water to a rolling boil. Cook the penne pasta uncovered in the boiling water, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain, set aside, and keep warm.",
        "Heat the olive oil in a large skillet over medium-high heat; add the chicken to the skillet and season with salt, pepper, and garlic salt. Cook and stir for about 2 minutes; remove the chicken and set aside. Cook and the garlic and onion in the oil remaining in the skillet until the onion becomes translucent, about 3 minutes. Stir in the asparagus, sun-dried tomatoes, and beef broth; reduce heat to medium-low. Cook until the asparagus is bright green and starting to become tender, about 5 minutes. Return the chicken to the skillet and stir in the artichoke hearts. Cook and stir until hot, about 3 minutes.",
        "Gently fold the pasta into the chicken and vegetables, cover the skillet, and turn off the heat. Allow the mixture to sit until the pasta has absorbed any excess broth, about 5 minutes. Mix butter into the pasta mixture until butter melts and coats the pasta; sprinkle with Parmesan cheese to serve."
    ],
    "ingredients": [
        "1 (12 ounce) package uncooked penne pasta",
        "2 tablespoons olive oil",
        "2 cups cooked, shredded chicken",
        "salt and black pepper to taste",
        "1 pinch garlic salt, or to taste",
        "2 tablespoons minced garlic",
        "1 small onion, diced",
        "1 bunch fresh asparagus, trimmed and cut into 2-inch pieces",
        "3 ounces chopped sun-dried tomatoes (not oil-packed)",
        "2/3 cup reduced-sodium beef broth",
        "1 (14 ounce) can artichoke hearts, drained and quartered",
        "2 tablespoons butter",
        "1 tablespoon grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Penne with Asparagus, Sun-dried Tomatoes, and Artichoke Hearts",
    "url": "http://allrecipes.com/recipe/213650/chicken-penne-with-asparagus-sun-dri/"
}
