{
    "directions": [
        "Sprinkle chicken with salt and pepper. Coat with flour. Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add half of chicken to skillet and sauté until golden brown, about 10 minutes. Transfer to large pot. Repeat with 1 tablespoon oil and remaining chicken.",
        "Heat 2 tablespoons oil in same skillet over medium-high heat. Add onions and garlic; sauté until onions are tender, about 5 minutes. Transfer to pot with chicken. Heat 1 tablespoon oil in same skillet over medium-high heat. Add Anaheim chilies and green bell peppers. Sauté until tender, about 4 minutes. Transfer to pot with chicken. Heat 1 tablespoon oil in same skillet. Sauté half of corn until tender, about 2 minutes. Transfer to pot with chicken. Repeat with remaining 1 tablespoon oil and corn.",
        "Add chicken broth, tomatillos, oregano, chili powder, cumin, paprika and cinnamon sticks to pot. Bring liquid to boil. Reduce heat and simmer until mixture thickens and flavors blend, stirring occasionally, about 2 hours. (Can be prepared 1 day ahead. Refrigerate until cool. Cover and keep refrigerated. Rewarm over medium heat before continuing.)",
        "Mix cilantro into chili. Transfer to large serving bowl. Garnish with tortilla chips and serve."
    ],
    "ingredients": [
        "3 pounds skinless boneless chicken thighs, cut into 1/2-inch pieces",
        "5 tablespoons all purpose flour",
        "7 tablespoons olive oil",
        "3 cups chopped onions",
        "3 tablespoons chopped garlic",
        "1 1/2 cups chopped fresh Anaheim chilies* (about 4)",
        "2 green bell peppers, cut lengthwise into 1/4-inch-thick strips",
        "5 cups frozen corn kernels, thawed",
        "6 cups canned low-salt chicken broth",
        "12 tomatillos,** husked, coarsely chopped",
        "2 tablespoons chopped fresh oregano or 1 tablespoon dried",
        "2 tablespoons chili powder",
        "1 tablespoon ground cumin",
        "1 teaspoon paprika",
        "2 cinnamon sticks",
        "1 cup chopped fresh cilantro",
        "Tortilla chips",
        "*Also known as California chilies. Available at Latin American markets and many supermarkets.",
        "**A green tomato-like vegetable with a paper-thin husk. Available at Latin American markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Herb",
        "Pepper",
        "Poultry",
        "Super Bowl",
        "Spice",
        "Corn",
        "Hot Pepper",
        "Tomatillo"
    ],
    "title": "Chicken Chili Verde",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-chili-verde-3012"
}
