{
    "directions": [
        "Bring all ingredients to boil in large pot. Reduce heat; simmer uncovered until chicken is cooked through, about 30 minutes. Transfer chicken to bowl; cover to keep warm. Reserve chicken broth in pot; spoon off fat from surface.",
        "Heat heavy large skillet over medium-low heat. Add pepitas; stir frequently until seeds puff and begin to pop, about 15 minutes (do not brown). Transfer to dish; cool. Set aside 2 tablespoons pepitas for garnish. Working in batches, finely grind remaining pepitas with peppercorns in spice mill or coffee grinder.",
        "Puree tomatillos, next 5 ingredients, and 1/2 cup reserved chicken broth in blender until almost smooth. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add tomatillo mixture and simmer until sauce is thick and reduced to 1 cup, stirring frequently, about 5 minutes.",
        "Heat remaining 4 tablespoons oil in heavy large pot over medium heat. Add ground pepita mixture. Stir constantly until mixture resembles very coarse paste and begins to color in spots, about 9 minutes. Add tomatillo mixture; stir 1 minute. Add 2 cups reserved chicken broth and bring to boil. Reduce heat to medium-low and simmer until sauce is thick, stirring constantly, about 3 minutes longer. Season sauce to taste with salt. Spoon some sauce onto platter. Top with chicken. Spoon remaining sauce over. Garnish with reserved 2 tablespoons pepitas."
    ],
    "ingredients": [
        "5 cups water",
        "6 chicken thighs with skin and bones",
        "1/4 large white onion",
        "3 garlic cloves, halved",
        "3 large fresh cilantro sprigs",
        "1 teaspoon fine sea salt",
        "1 2/3 cups shelled pepitas (pumpkin seeds)",
        "6 whole black peppercorns",
        "12 ounces tomatillos, husked, rinsed, coarsely chopped",
        "1/4 cup chopped white onion",
        "1/4 cup chopped fresh cilantro",
        "3 medium serrano chiles, chopped with seeds",
        "2 garlic cloves, chopped",
        "1 teaspoon fine sea salt",
        "6 tablespoons corn oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Low/No Sugar",
        "Cinco de Mayo",
        "Hot Pepper",
        "Spring",
        "Healthy",
        "Tomatillo",
        "Cilantro",
        "Seed",
        "Simmer"
    ],
    "title": "Chicken in Green Pumpkin-Seed Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-green-pumpkin-seed-sauce-108053"
}
