{
    "directions": [
        "For the chicken and marinade: Sprinkle the chicken pieces with salt and pepper. Combine the yogurt with the paprika, coriander, cumin, cayenne, lemon zest, cinnamon, garlic and ginger in a mixing bowl. Mix together well then pour into a resealable plastic bag. Add chicken pieces and shake around to coat all the pieces evenly. Place in the refrigerator and marinate for 1 hour.",
        "Heat a grill to high. Wipe down the grates with an oil-blotted paper towel to create a nonstick surface. Remove the chicken from the marinade and wipe off any excess. Grill the chicken pieces until well-marked, 3 to 4 minutes per side. Remove to a plate and set aside.",
        "For the sauce: Set a Dutch oven over medium heat. (Alternatively, you can cook in a pressure cooker. Simply cut the cooking time in half and cook over medium heat with medium pressure.) Coat with the oil and add the butter. Add the garlic and onions. Cook until translucent and fragrant, 3 to 4 minutes. Add the tomato paste, paprika and garam masala. Cook for 2 to 3 minutes to toast the spices and cook the tomato paste. Add the crushed tomatoes, vinegar and grilled chicken pieces. Stir well and simmer until the chicken is tender, 25 to 30 minutes. Finish the sauce with the heavy cream. Season with salt and pepper. Garnish with the cilantro.",
        "Wine paring for meal: dry Riesling or sparkling wine"
    ],
    "ingredients": [
        "1 whole chicken (3 to 4 pounds), cut into 10 pieces",
        "Kosher salt and freshly cracked black pepper",
        "1 cup plain yogurt",
        "2 tablespoons smoked paprika",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "2 teaspoons cayenne pepper",
        "1 teaspoon lemon zest",
        "1/2 teaspoon ground cinnamon",
        "3 cloves garlic, minced",
        "One 1-inch piece ginger, peeled and grated",
        "2 tablespoons vegetable oil",
        "2 tablespoons unsalted butter",
        "2 cloves garlic, minced",
        "1 large onion, sliced",
        "1 tablespoon tomato paste",
        "1 tablespoon smoked paprika",
        "2 teaspoons garam masala",
        "One 14.5-ounce can fire-roasted diced tomatoes, such as Muir Glen",
        "1 tablespoon red wine vinegar",
        "1/2 cup heavy cream",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Indian Recipes",
        "Sauce Recipes",
        "Dairy Recipes"
    ],
    "title": "Chicken Tikka Masala",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/chicken-tikka-masala-recipe"
}
