{
    "directions": [
        "Combine chicken wings, broth, sliced carrots, onions, thickly sliced celery, sliced parsnips, thickly sliced leeks, 1 1/2 cups parsley, 1 1/2 tablespoons thyme, peppercorns, allspice, and bay leaves in 14- to 16-quart pot. Bring to simmer over high heat. Add chicken breast halves, skin side down, and push to submerge. Simmer until chicken breasts are just cooked through, turning once and adjusting heat to maintain gentle simmer, 20 to 25 minutes.",
        "Transfer chicken breasts to rimmed baking sheet; continue to simmer broth. Cool chicken 20 minutes. Remove skin and pull all meat from bones (reserve skin and bones). Tear meat into bite-size pieces. Transfer meat to large bowl; cover and chill.",
        "Add skin and bones from breast halves to simmering broth. Increase heat and cook broth at active simmer 1 hour 15 minutes. Strain broth into another large pot. If necessary, boil until reduced to 19 to 20 cups richly flavored broth. Discard chicken and vegetable mixture strained from broth. Cool broth 2 hours. DO AHEAD: Can be made 2 days ahead. Chill uncovered until cold, then cover and keep refrigerated.",
        "Spoon fat from top of broth into saucepan. Heat just until melted. Pour fat into small bowl; return 6 tablespoons to pan. Add flour; blend until roux is smooth.",
        "Bring broth in pot to simmer. Whisk 4 cups broth into roux and whisk over medium heat until mixture is smooth and comes to boil, about 5 minutes. Set aside.",
        "Add cubed carrots and parsnips to remaining broth in pot; add thinly sliced celery and leeks. Cover pot. Simmer until vegetables are tender, about 10 minutes. Whisk in roux mixture. Add chicken pieces and dumplings, then 2/3 cup parsley, 11/2 tablespoons thyme, and chives. Simmer to heat through; season with salt and pepper.",
        "Ladle soup into large shallow bowls."
    ],
    "ingredients": [
        "7 1/2 pounds chicken wings",
        "6 1/2 quarts low-salt chicken broth (preferably organic)",
        "8 large carrots, thickly sliced, plus 2 cups 1/2-inch cubes",
        "3 large onions, peeled, quartered",
        "6 large celery stalks, thickly sliced, plus 2 1/2 cups 1/2-inch-thick slices",
        "4 large parsnips, thickly sliced, plus 2 1/2 cups 1/2-inch cubes",
        "2 whole medium leeks, halved lengthwise, rinsed, thickly sliced crosswise, plus 2 1/2 cups 1/2-inch-thick slices of white and pale green parts",
        "1 1/2 cups plus 2/3 cup chopped fresh Italian parsley",
        "3 tablespoons chopped thyme, divided",
        "1 1/2 teaspoons whole black peppercorns",
        "8 large whole allspice",
        "3 fresh bay leaves",
        "3 1/2 to 3 3/4 pounds large chicken breast halves with skin and bones (4 to 5)",
        "6 tablespoons all purpose flour",
        "Fresh-Herb Dumplings",
        "1/2 cup chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Low Fat",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Fall",
        "Winter",
        "Healthy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken, Vegetable, and Dumpling Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-vegetable-and-dumpling-soup-361259"
}
