{
    "directions": [
        "Preheat the oven to 375 degrees F. Butter a 3-quart casserole dish.",
        "Bring a large pot of generously salted water to a boil. Add the egg noodles and cook until al dente, about 4 minutes. Strain.",
        "Meanwhile, heat 2 tablespoons of the butter in a large Dutch oven or pot over medium-high heat. Add the mushrooms and cook, stirring occasionally, until browned all over, about 3 minutes. Season with 1/2 teaspoon salt and a few grinds of pepper. Transfer to a small bowl and set aside.",
        "Lower the heat to medium and melt the remaining 4 tablespoons butter in the Dutch oven. Whisk in the flour to form a loose paste. Stir in the onions, carrots, celery and thyme and season with 1/2 teaspoon salt and a few grinds of pepper. Cook for 5 minutes to soften, then add the wine. Whisk for 30 seconds, then add the chicken broth and heavy cream. Bring to a boil, reduce heat and simmer for 10 minutes. Remove the thyme sprigs; fold in the noodles, mushrooms, chicken and parsley and season with salt and pepper. Transfer to the buttered casserole dish and top with the Gouda.",
        "Bake until bubbly and brown on top, 40 to 45 minutes."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, plus more for greasing dish",
        "Kosher salt",
        "12 ounces extra-wide egg noodles",
        "10 ounces white mushrooms, halved or quartered",
        "Freshly ground pepper",
        "1/3 cup all-purpose flour",
        "1 1/2 cups frozen pearl onions, thawed",
        "1 medium carrot, halved lengthwise and sliced thinly across",
        "1 large stalk celery, sliced thinly",
        "2 sprigs fresh thyme",
        "1/2 cup dry white wine or vermouth",
        "4 cups chicken broth",
        "1 cup heavy cream",
        "2 cups shredded rotisserie chicken, skin and bones discarded",
        "2 tablespoons chopped parsley",
        "1 cup shredded Gouda (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Casserole",
        "Casserole",
        "Chicken",
        "Poultry Recipes",
        "Noodles",
        "Main Dish Recipes"
    ],
    "title": "Chicken Noodle Casserole",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-noodle-casserole"
}
