{
    "directions": [
        "Combine dried porcini and 1 cup hot water in small bowl; let stand until porcini are soft, about 20 minutes. Drain porcini, reserving liquid.",
        "Melt 3 tablespoons butter in heavy large pot over medium-high heat. Add fresh mushrooms and garlic; sauté until mushrooms are browned, about 8 minutes. Add porcini, porcini soaking liquid (leaving any sediment behind), broth, wine, prosciutto, lemon peel, thyme, 1 teaspoon salt, and 1/2 teaspoon pepper. Reduce heat to medium-low; simmer uncovered 20 minutes to blend flavors. Whisk cornstarch mixture to combine and add to skillet; stir until mixture thickens slightly, about 1 1/2 minutes. Season sauce to taste with more salt and pepper, if desired. (Can be prepared 1 day ahead. Cool slightly, then cover and refrigerate.)",
        "Preheat oven to 425°F. Melt 6 tablespoons butter in small saucepan; remove from heat. Place 1 phyllo sheet on work surface (cover remainder with sheet of plastic wrap, then damp towel). Brush phyllo sheet with some of melted butter. Using both hands, gently scrunch buttered phyllo sheet into loose ball, about 2 1/2 to 3 inches in diameter; set on work surface. Repeat with remaining phyllo sheets and melted butter.",
        "Bring mushroom sauce to boil. Mix in chicken and parsley. Transfer mixture to 13x9x2-inch glass or ceramic baking dish. Cover hot filling with phyllo balls. Sprinkle Parmesan over. Bake 15 minutes. Reduce oven temperature to 350°F; bake until phyllo is golden and chicken is cooked through, about 20 minutes longer."
    ],
    "ingredients": [
        "1 1/2-ounce package dried porcini mushrooms",
        "1 cup hot water",
        "9 tablespoons butter, divided",
        "1 pound assorted fresh mushrooms (such as crimini, stemmed shiitake, and button mushrooms), sliced",
        "3 garlic cloves, minced",
        "2 cups low-salt chicken broth",
        "3/4 cup Riesling or other fruity white wine",
        "2 ounces thin prosciutto slices, cut into thin strips",
        "2 teaspoons grated lemon peel",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 tablespoons cornstarch mixed with 1/2 cup water",
        "12 sheets fresh phyllo pastry or frozen, thawed",
        "2 pounds skinless boneless chicken thighs, excess fat removed, thighs quartered",
        "2 tablespoons chopped fresh Italian parsley",
        "1/2 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Poultry",
        "Bake",
        "Casserole/Gratin",
        "Winter",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Chicken and Mushroom Pie with Phyllo-Parmesan Crust",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-mushroom-pie-with-phyllo-parmesan-crust-231598"
}
