{
    "directions": [
        "Pick over the chickpeas, discarding any misshapen peas or grit, rinse well, and soak overnight in water to cover. The next day, drain the chickpeas and put them in a saucepan with water to cover by 2 inches. Tie together 4 of the garlic cloves, the onion, and the bay leaf in a piece of cheesecloth and add the sachet to the pan. Add the optional ham hock only if you will not be adding salt cod later, and then bring to a boil over high heat. Reduce the heat to low and simmer uncovered, adding 2 teaspoons salt (less if using the ham hock) after the first 10 minutes of cooking, until the chickpeas are tender, about 1 hour. Remove the pan from the heat, and remove the sachet from the pan. Leave the chickpeas in their cooking liquid. Discard the ham bone. Untie the sachet, discard the bay leaf, and reserve the garlic and onion.",
        "Place the spinach in a saucepan with only the rinsing water clinging to its leaves and cook over medium heat, stirring and turning constantly with tongs, until wilted, 5 to 6 minutes. Drain well in a sieve, pressing with the back of a spoon. If the leaves seem stringy or too big, you can chop them a bit more. Set aside.",
        "Heat the oil in a small sauté pan over medium-high heat. Add the bread and the remaining 3 uncooked garlic cloves and fry, turning as needed, until golden, 4 to 5 minutes. Transfer to a blender or small processor, add the saffron, and pulse until pulverized. Add the onion and garlic reserved from the chickpeas, the cumin, paprika, and 1 cup of the chickpea cooking liquid and purée until smooth.",
        "Add the purée and the spinach to the cooked chickpeas along with the salt cod or the ham, whichever you are using. Place the mixture over low heat, stir well, and bring to a simmer. If it seems dry, add a little water as needed so the stew is spoonable. Season to taste with salt and lots of pepper. Taste and balance the seasoning with vinegar.",
        "Transfer to a serving dish. If serving with the optional eggs, top with the fried eggs and serve hot, or with the hard-boiled eggs and serve warm."
    ],
    "ingredients": [
        "1/2 pound (1 generous cup) dried chickpeas",
        "7 cloves garlic, peeled",
        "1 onion, peeled",
        "1 bay leaf",
        "1 small ham hock (optional)",
        "Salt",
        "About 1 1/4 pounds spinach, tough stems removed, rinsed, and coarsely chopped (about 10 loosely packed cups or 1 pound after trimming)",
        "2 tablespoons olive oil",
        "1 slice country bread, crust removed",
        "Generous pinch of saffron threads, warmed and crushed",
        "1 teaspoon cumin seeds, toasted in a dry pan until fragrant and finely ground",
        "2 teaspoons sweet smoked paprika",
        "1/2 cup coarsely flaked cooked salt cod (optional)",
        "1/4 cup diced cooked ham if using ham hock or 1/2 cup if not using hock (optional)",
        "Salt and freshly ground black pepper",
        "Dash of sherry vinegar, as needed",
        "4 eggs, fried sunny-side up, or 2 hard-boiled eggs, peeled and chopped (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Vegetable",
        "Appetizer",
        "Side",
        "Sauté",
        "Dinner",
        "Spinach",
        "Legume",
        "Chickpea",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chickpeas with Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/chickpeas-with-spinach-354552"
}
