{
    "directions": [
        "Preheat oven to 350°F. Pound chicken between sheets of waxed paper to thickness of 1/4 inch using meat mallet. Pat chicken dry. Combine cheese, green onions and basil in small bowl. Season with salt and pepper. Spread cheese mixture lengthwise over half of each chicken piece. Tuck short ends in. Roll chicken up, starting at one long side, into tight cylinders. Tie ends with string to secure. Dip chicken in egg, allowing excess to drip into bowl. Roll in breadcrumbs, shaking off excess. (Can be prepared 4 hours ahead. Refrigerate.)",
        "Place chicken in 8-inch square baking dish. Pour 2 tablespoons melted butter over. Bake until cooked through, about 20 minutes.",
        "Meanwhile, melt 1/4 cup butter in heavy large skillet over medium heat. Add mushrooms and sauté until tender, about 8 minutes. Add wine and boil 3 minutes. Add stock and boil until liquid is reduced by half, about 6 minutes. Remove from heat and swirl in 4 tablespoons cold butter 1 piece at a time. Season sauce with salt and freshly ground pepper. Remove string from chicken. Cut rolls crosswise into 1/2-inch-thick rounds. Fan on plates. Serve immediately, passing sauce separately."
    ],
    "ingredients": [
        "4 boneless chicken breast halves, skinned",
        "1/2 cup fresh goat cheese (such as Montrachet) (about 4 ounces)",
        "2 green onions, thinly sliced",
        "3 basil leaves, shredded or 1 teaspoon dried, crumbled",
        "Salt and freshly ground pepper",
        "1 egg, beaten to blend",
        "1/2 cup dry breadcrumbs",
        "2 tablespoons (1/4 stick) unsalted butter melted",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 pound mushrooms, sliced",
        "1/4 cup dry white wine",
        "2/3 cup chicken stock or canned low-salt broth",
        "4 tablespoons chilled unsalted butter (1/2 stick), cut into 4 pieces",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Bake",
        "Goat Cheese",
        "Basil",
        "White Wine",
        "New York"
    ],
    "title": "Chicken Breasts Stuffed with Goat Cheese and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-stuffed-with-goat-cheese-and-basil-2749"
}
