{
    "directions": [
        "Heat 1 tablespoon olive oil in large pot over medium-high heat. Add chicken wings; brown well, stirring often, about 20 minutes. Add shallots; saut\u2029 4 minutes. Add wine; bring to boil. Add broth; bring to boil. Reduce heat and simmer until liquid is reduced to 2 cups, about 25 minutes. Strain sauce into medium saucepan. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 450°F. Sprinkle roasting chicken inside and out with salt and pepper. Place thyme and garlic in cavity. Run fingers between skin and meat on breast to loosen. Arrange truffle slices under skin or spread truffle sauce under skin. Rub 1 teaspoon truffle oil over skin. Place chicken in roasting pan.",
        "Toss potatoes, mushrooms, bacon and 2 tablespoons olive oil in large bowl. Sprinkle with salt and pepper. Spoon mixture around chicken. Roast chicken until juices run clear when thickest part of thigh is pierced, stirring vegetables occasionally, about 1 hour 15 minutes. Transfer chicken to platter. Mix peas into vegetable mixture; stir to heat through.",
        "Bring sauce to simmer. Reduce heat to low. Add 1 teaspoon truffle oil, then butter and whisk just until butter melts. Season with salt and pepper. Spoon vegetables onto plates. Serve with chicken and sauce.",
        "*Black truffles and black truffle sauce are available at specialty foods stores.",
        "**Available at Italian markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 pound chicken wings",
        "4 shallots, sliced",
        "1 cup dry white wine",
        "4 cups canned low-salt chicken broth",
        "1 6- to 7-pound roasting chicken",
        "8 fresh thyme sprigs",
        "6 garlic cloves",
        "12 slices black truffle or 2 teaspoons black truffle sauce*",
        "2 teaspoons white truffle oil**",
        "1 1/2 pounds Yukon Gold potatoes, peeled, cut into ‟-inch pieces",
        "1 pound shiitake mushrooms, stemmed",
        "3 thick bacon slices, cut into 1/2-inch pieces",
        "1 cup frozen peas, thawed",
        "2 tablespoons (1/4 stick) butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Chicken",
        "Mushroom",
        "Potato",
        "Poultry",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Bacon",
        "Winter",
        "Simmer"
    ],
    "title": "Chicken with Truffles, Wild Mushrooms and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-truffles-wild-mushrooms-and-potatoes-102867"
}
