{
    "directions": [
        "Lay each chicken breast flat onto a work surface. Cut a 2-inch slit in the side of each breast with a small sharp knife; work the knife in the slit to make a pocket. Fill each pocket with a slice of Swiss cheese and ham and secure with a toothpick.",
        "Mix 1 tablespoon flour with paprika in a shallow bowl; place bread crumbs in a separate bowl. Pour 1/2 cup milk in another shallow bowl. Dip chicken in milk, press into flour mixture to coat, and shake off the excess flour. Dip into beaten egg and press into bread crumbs.",
        "Heat 2 tablespoons butter and olive oil in a large skillet over medium-high heat; fry chicken until browned on all sides, about 10 minutes. Reduce heat to low and continue frying until chicken is no longer pink in the center and juices run clear, about 15 minutes per side.",
        "Bring 3/4 cup milk to a boil in a saucepan.",
        "Melt 1 1/2 tablespoon butter over medium heat in another skillet. Whisk 1 1/2 tablespoons flour in melted butter until thickened, 5 to 10 minutes. Pour milk a little at a time to the flour mixture, whisking constantly until all milk is used. Add onion, bay leaf, and clove; bring to a boil. Reduce heat to low and simmer until thickened, stirring occasionally, about 10 minutes. Remove and discard onion, bay leaf, and clove. Stir shredded Swiss cheese into the sauce until melted; season with salt, pepper, and nutmeg. Serve sauce over chicken."
    ],
    "ingredients": [
        "2 skinless, boneless chicken breast halves",
        "2 slices Swiss cheese",
        "2 thin slices smoked ham",
        "1 tablespoon all-purpose flour",
        "1/3 teaspoon paprika",
        "1 cup bread crumbs",
        "1/2 cup milk",
        "1 egg, beaten",
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "3/4 cup milk",
        "1 1/2 tablespoons butter",
        "1 1/2 tablespoons all-purpose flour",
        "1/4 onion, sliced",
        "1 bay leaf",
        "1 whole clove",
        "2 ounces shredded Swiss cheese",
        "salt and ground black pepper to taste",
        "1 pinch ground nutmeg, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Cordon Bleu with Mornay Sauce",
    "url": "http://allrecipes.com/recipe/228593/chicken-cordon-bleu-with-mornay-sauce/"
}
