{
    "directions": [
        "In a small bowl stir together marinade ingredients. Add chicken to marinade, turning it to coat. Marinate chicken at room temperature while preparing vegetables. Cut onion and bell pepper into 1/4-inch dice. Trim snow peas and cut crosswise into 1/4-inch slices. Rinse black beans and mince.",
        "Remove chicken from marinade and pat dry. Discard marinade. In a heavy non-stick skillet heat 1/2 tablespoon corn or safflower oil over moderately high heat until hot but not smoking and sauté chicken until browned on bottom, about 4 minutes. Turn chicken over and cook over moderate heat 6 minutes, or until just cooked through. Transfer chicken to a plate and cool completely. Recipe may be prepared up to this point 1 day ahead and ingredients chilled separately in sealable plastic bags.",
        "Cut chicken into 1/2-inch cubes.",
        "In a small bowl stir together seasoning liquid ingredients.",
        "Spread rice in a shallow baking pan and separate grains with a fork.",
        "In a deep 12-inch heavy non-stick skillet heat remaining 2 tablespoons corn or safflower oil over moderately high heat until hot but not smoking and stir-fry black beans, garlic, and gingerroot 20 seconds, or until fragrant. Add onion and bell pepper and stir-fry 2 minutes. Add snow peas, chicken, and rice and cook, stirring frequently, 2 to 3 minutes, or until heated through. Stir seasoning liquid and add to fried rice, tossing to coat evenly."
    ],
    "ingredients": [
        "3 tablespoons soy sauce",
        "2 tablespoons minced garlic",
        "1 teaspoon Asian sesame oil",
        "2 skinless boneless chicken breast halves (about 3/4 pound total)",
        "1 red onion",
        "1 large red bell pepper",
        "1/2 pound snow peas",
        "3 tablespoons fermented black beans",
        "2 1/2 tablespoons corn or safflower oil",
        "1 tablespoon chicken broth",
        "3 tablespoons soy sauce",
        "1 1/2 tablespoons Chinese rice wine or sake",
        "1 1/2 teaspoons sugar",
        "5 cups chilled Chinese-style white or brown rice",
        "2 tablespoons minced garlic",
        "2 tablespoons minced peeled fresh gingerroot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Chicken",
        "Rice",
        "Side",
        "Stir-Fry",
        "Spring",
        "Sugar Snap Pea",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chicken Fried Rice with Fermented Black Beans",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fried-rice-with-fermented-black-beans-101078"
}
