{
    "directions": [
        "Preheat oven to 450°F. and oil a 13-by 9-inch shallow baking pan.",
        "Mince and mash 2 garlic cloves to a paste with salt. In a small bowl whisk together garlic paste, lemon juice, and 2 tablespoons oil with salt and pepper to taste. In pan make 2 beds of overlapping lemon slices and put a chicken breast half, skin side up, on each bed. Brush chicken generously with some of the garlic lemon mixture and season with salt and pepper.",
        "Quarter potatoes and in a bowl toss with tomatoes, remaining 5 whole garlic cloves, and remaining tablespoon oil until coated well. Arrange vegetables around chicken and sprinkle chicken with olives and rosemary.",
        "Roast chicken and vegetables in middle of oven 15 minutes and brush with remaining garlic lemon mixture. Roast chicken 10 to 15 minutes more, or until a meat thermometer registers 175°F. and chicken is cooked through.",
        "Discard lemon slices and serve chicken with vegetables, spooning any pan juices over them."
    ],
    "ingredients": [
        "7 garlic gloves",
        "1/4 teaspoon salt",
        "2 teaspoons fresh lemon juice",
        "3 tablespoons olive oil",
        "1 large lemon, sliced thin",
        "1 whole chicken breast with skin and bone (about 1 pound), halved",
        "1 pound small red potatoes (about 2 inches in diameter), washed well",
        "4 plum tomatoes halved, lengthwise",
        "10 Kalamata or other brine-cured black olives, pitted and sliced thin lengthwise",
        "1 tablespoon fresh rosemary leaves or 1 teaspoon dried crumbled rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Olive",
        "Potato",
        "Tomato",
        "Roast",
        "Lemon",
        "Rosemary",
        "Gourmet"
    ],
    "title": "Chicken Roasted with Tomatoes, Potatoes, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-roasted-with-tomatoes-potatoes-and-olives-11802"
}
