{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the lasagna noodles, and return to a boil. Cook, uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain.",
        "Spray a skillet with cooking spray, and place over medium heat. Sprinkle chicken breasts with seasoned salt and pepper, and place in the skillet. Cover and cook until the meat is barely pink, 5 to 8 minutes, then turn the chicken over and cook, covered, until the chicken is cooked through, an additional 5 to 8 minutes. Remove chicken, and cool in refrigerator about 20 minutes. Cut cooled chicken into bite-size cubes.",
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.",
        "In a bowl, mix the shredded Swiss cheese, broccoli, and chicken together. In another bowl, whisk together the cream of chicken soup, cream of mushroom soup, and chicken broth until well combined. Sprinkle the crushed rosemary over the soup mixture.",
        "To assemble, spread 1/3 of the soup mixture over the bottom of the prepared baking dish, and lay 4 lasagna noodles over the soup, overlapping the noodles slightly. Top the noodles with half the chicken-broccoli mixture. Spoon 1/3 of the soup mixture over the chicken and broccoli, then top with the remaining lasagna noodles. Finish with a layer of the remaining chicken-broccoli mixture and the remaining 1/3 of the soup mixture. Cover the dish with foil.",
        "Bake in the preheated oven until the broccoli is tender and the casserole is bubbling, 50 to 60 minutes. Let rest 10 minutes before serving."
    ],
    "ingredients": [
        "8 lasagna noodles",
        "4 skinless, boneless chicken breast halves",
        "1 pinch seasoned salt, or to taste",
        "1 pinch ground black pepper, or to taste",
        "8 ounces shredded Swiss cheese",
        "1 (8 ounce) package frozen broccoli cuts, thawed and drained",
        "2 (10.5 ounce) cans cream of chicken soup",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "10 fluid ounces chicken broth",
        "2 teaspoons crushed dried rosemary"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Divan Lasagna",
    "url": "http://allrecipes.com/recipe/214580/chicken-divan-lasagna/"
}
