{
    "directions": [
        "Purée first 6 ingredients and 3/4 teaspoon salt in a blender until smooth. Add 1/4 cup cilantro leaves and jalapeño and blend briefly to combine. Transfer 1/2 cup marinade to a small bowl; cover and chill for serving (return to room temperature before using). Place remaining marinade in a resealable plastic bag; add chicken, seal bag, and turn to coat. Chill for at least 3 hours or overnight (the longer it marinates, the more flavorful it will be).",
        "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Holding 2 skewers parallel to each other and 1/2\" apart, thread 1 piece of chicken onto skewers, then 1 apricot half. Repeat with 1 more chicken piece and 1 more apricot half (using 2 skewers helps hold the meat and fruit together, preventing them from twirling around when skewers are turned on the grill). Repeat with remaining skewers, chicken, and apricots for a total of 12, each holding 2 pieces of chicken and 2 apricot halves. Season with salt and pepper. Brush apricots with some marinade from bag; discard remaining marinade.",
        "Grill skewers on one side until chicken is well browned, 3-4 minutes. Turn and grill until other side is well browned, 3-4 minutes longer. Move to a cooler part of grill. Cover grill and cook until chicken is cooked through, about 2 minutes longer. Transfer to a serving platter; sprinkle with cilantro sprigs and peanuts and drizzle with reserved marinade. Serve with lime wedges alongside for squeezing over."
    ],
    "ingredients": [
        "3/4 cup canned light unsweetened coconut milk",
        "1/2 cup plain Greek yogurt",
        "1/2 cup smooth peanut butter",
        "1/4 cup fresh lime juice (about 2 limes)",
        "2 teaspoons (packed) light brown sugar",
        "2 garlic cloves",
        "3/4 teaspoon kosher salt plus more for seasoning",
        "1/4 cup (loosely packed) cilantro leaves plus sprigs for garnish",
        "2 tablespoons coarsely chopped jalapeño (about 1 large; with seeds for more heat)",
        "1 pound skinless, boneless chicken thighs or breasts, cut into twenty-four 1\" chunks",
        "12 firm ripe small apricots, halved, pitted",
        "Freshly ground black pepper",
        "1/4 cup unsalted, dry-roasted peanuts, coarsely chopped",
        "Lime wedges",
        "Ingredient info: Look for canned light unsweetened coconut milk at Indian, Latin, and Southeast Asian markets and many supermarkets.",
        "Special equipment: Twenty-four 6\" bamboo skewers (soak in water for 1 hour before using)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Poultry",
        "Kid-Friendly",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Apricot",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Peanut Butter",
        "Wheat/Gluten-Free",
        "Soy Free"
    ],
    "title": "Chicken-Apricot Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-apricot-skewers-51108510"
}
