{
    "directions": [
        "Pat chicken dry and sprinkle with salt and pepper. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken, turning over once, about 6 minutes total, and transfer to a plate. Sauté onions, garlic, and bay leaves in fat remaining in skillet, stirring frequently, until onions are softened, 4 to 5 minutes. Add chorizo and paprika and cook, stirring, 1 minute. Add olives, raisins, wine, and broth and bring to a boil, stirring and scraping up any brown bits. Return chicken to skillet along with any juices accumulated on plate, then reduce heat to moderately low and simmer chicken, covered, turning over once, until tender, 25 to 30 minutes total.",
        "Transfer chicken to a clean plate. (Sauce in skillet should be the consistency of heavy cream; if it's not, briskly simmer until slightly thickened, about 5 minutes.) When chicken is cool enough to handle, discard skin and bones and coarsely chop meat. Stir chicken into sauce and discard bay leaves. Season with salt and pepper, then cool filling, uncovered, about 30 minutes.",
        "Form dough into a ball, then wrap in oiled plastic wrap (oiled side in) and let stand at room temperature 30 minutes.",
        "Put oven rack in middle position and preheat oven to 400°F. Grease a 15- by 10-inch shallow baking pan (1 inch deep) with 1 tablespoon oil.",
        "Divide dough in half, then roll out 1 half (keep remaining dough covered with plastic wrap) on a floured surface with a floured rolling pin into a 15- by 10-inch rectangle and transfer to baking pan. Spread filling evenly over dough, leaving a 1-inch border, and moisten border with water. Roll out remaining dough in same manner, then arrange over filling and press edges together to seal. Roll edges in and press to form a decorative rim. Make a 1-inch hole (a steam vent) in center of empanada.",
        "Bake empanada 15 minutes, then brush crust with 3/4 tablespoon oil and bake until crust is golden brown, 20 to 25 minutes more. Remove from oven and brush empanada with remaining 3/4 tablespoon oil. Cool 10 minutes in pan on a rack, then slide empanada onto rack using a wide metal spatula and cool to warm.",
        "Cut empanada into squares and serve warm or at room temperature."
    ],
    "ingredients": [
        "3 whole chicken legs, including thighs (2 to 2 1/4 pounds total)",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "4 1/2 tablespoons extra-virgin olive oil",
        "2 large onions, halved lengthwise, then cut lengthwise into 1/4-inch-wide strips",
        "2 large garlic cloves, minced",
        "2 Turkish bay leaves or 1 California",
        "1/3 cup finely diced Spanish chorizo (cured spiced pork sausage; 1 1/2 oz; casings discarded if desired)",
        "1/2 teaspoon Spanish smoked paprika (not hot)",
        "1/4 cup chopped pitted green olives",
        "1/4 cup golden raisins",
        "1/2 cup dry white wine",
        "1/2 cup reduced-sodium chicken broth",
        "1 pound frozen pizza dough, thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Olive",
        "Pork",
        "Poultry",
        "Appetizer",
        "Side",
        "Bake",
        "Sauté",
        "Dinner",
        "Raisin",
        "Sausage",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chicken Empanada with Chorizo, Raisins, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-empanada-with-chorizo-raisins-and-olives-231377"
}
