{
    "directions": [
        "Cut celery into 2-inch pieces. With food processor running, drop in celery and garlic and finely chop. Stop motor and add chicken, 1/2 tablespoon soy sauce, sesame oil, and 1/8 teaspoon each of salt and pepper. Pulse until just combined.",
        "Put 2 wrappers on a dry surface, keeping remaining wrappers in package, and lightly brush edges with water. Mound a rounded teaspoon filling in center of each wrapper. Fold in half, into triangles or half-moons, and pinch edges tightly to seal. Make 18 more dumplings in same manner.",
        "Chop enough celery leaves to measure 1 1/2 tablespoons and stir together with remaining 3 tablespoons soy sauce and vinegar.",
        "Heat vegetable oil in a 12-inch nonstick skillet over medium-high heat until hot, then arrange dumplings, slightly overlapping, in a spiral pattern and fry until bottoms are pale golden, 2 to 3 minutes. Add water, tilting skillet to distribute, then cover tightly with lid and cook until liquid has evaporated and bottoms of dumplings are crisp and golden, 6 to 7 minutes. (Use a spatula to loosen and lift edges to check bottoms; replace lid and continue cooking if necessary, checking after 1 to 2 minutes.) Remove lid and invert a large plate with a rim over skillet. Holding plate and skillet tightly together, invert dumplings onto plate. Serve immediately, with dipping sauce."
    ],
    "ingredients": [
        "1 1/2 medium celery ribs, leaves reserved",
        "2 garlic cloves",
        "1/4 pound ground dark meat chicken",
        "3 1/2 tablespoons low-sodium soy sauce, divided",
        "1/4 teaspoon Asian sesame oil",
        "20 wonton or gyoza wrappers",
        "1 tablespoon rice vinegar (not seasoned)",
        "2 tablespoons vegetable oil",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Garlic",
        "Appetizer",
        "Steam",
        "Quick & Easy",
        "New Year's Eve",
        "Celery",
        "Pan-Fry",
        "Party",
        "Potluck",
        "Soy Sauce",
        "Sesame Oil",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chicken and Celery Pot Stickers",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-celery-pot-stickers-358116"
}
