{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "For the salsa:",
        "On a baking tray, roast tomatillos, onion, garlic and jalapenos for 12 to 15 minutes. Transfer the roasted vegetables and any juices on the bottom of the tray to a food processor. Add the cumin, salt, cilantro, and lime juice and pulse mixture until well combined but still chunky.",
        "For the enchiladas:",
        "Meanwhile heat a 2 count of olive oil in a medium saucepan over medium heat. Add the onion and cook until soft and caramelized - this should take 5 to 7 minutes. Add the garlic and cumin then cook for a further minute. Sprinkle on the flour and stir to ensure the flour doesn't burn then gradually add the chicken stock to make a veloute. Continue stirring over a low simmer until the flour cooks and the liquid thickens. Turn off the heat, add half of the roasted tomatillo chile salsa, some additional fresh chopped cilantro and fold in the shredded chicken meat. Season, to taste, with salt and pepper.",
        "Change the temperature of the oven to 350 degrees F and begin assembling the dish. Take a large baking dish and smear the bottom with some of the reserved tomatillo salsa. Now take the flour tortillas and briefly flash them over the stove-top flame (or put them briefly under the broiler if using an electric stove). Using a shallow bowl, coat each tortilla lightly with the reserved salsa mix. Put a scoop of the shredded chicken-enchilada mix on top of the tortilla followed by a sprinkle of the shredded cheese. Fold the tortilla over the filling and roll like a cigar to enclose it. Using a spatula place the tortillas in the baking dish and continue to do the same with all the tortillas. Finally pour over some more of the salsa and top with the remaining shredded cheese. Bake uncovered for about 30 minutes until bubbly and cracked on top. Garnish, cilantro and tomato.",
        "Serve hot with Spicy Black Beans and Yellow Rice, the remaining tomatillo salsa, sour cream and fresh guacamole, if desired.",
        "In a large pot, soak beans overnight covered in water by 2 inches. Drain and set aside.",
        "In the same pot, heat the olive oil. Add the onion, jalapeno pepper, garlic, and bay leaf and cook until the vegetables begin to soften, about 5 minutes. Add the beans and cover with water by about 1-inch. Bring to a boil, reduce the heat, cover, and simmer for 1 to 1 1/2 hours, or until the beans are tender. Remove the bay leaf and discard. Taste the beans and season with salt and pepper.",
        "Put all the ingredients into a heavy-bottomed pot, stir well, and bring to a boil over medium-high heat. Reduce the heat to a simmer, cover, and cook over low heat until the rice has absorbed the water, about 15 to 20 minutes. Remove from the heat and let sit, covered, for 5 minutes. Discard the garlic and bay leaf, fluff with a fork, and serve."
    ],
    "ingredients": [
        "1 pound tomatillos, husked",
        "1 white onion, peeled, sliced, quartered or whole",
        "4 garlic cloves",
        "2 jalapenos",
        "2 teaspoons ground cumin",
        "1 teaspoon salt",
        "1/2 cup chopped cilantro leaves",
        "1/2 lime, juiced",
        "Extra-virgin olive oil",
        "1/2 medium onion, diced",
        "3 garlic cloves, chopped",
        "1 1/2 teaspoon ground cumin",
        "1/4 cup all-purpose flour",
        "2 cups chicken stock, store-bought",
        "Chopped cilantro leaves",
        "1 deli roasted chicken (about 3 pounds), boned, meat shredded",
        "Salt",
        "Freshly ground black pepper",
        "10 large flour tortillas",
        "1/2 pound Monterey Jack cheese, shredded",
        "2 cups sour cream",
        "Chopped tomatoes and cilantro leaves, for garnish",
        "Spicy Black Beans, recipe follows",
        "Yellow Rice, recipe follows",
        "Guacamole, optional",
        "2 cups (about 1 pound) dried black beans, picked over, soaked overnight",
        "3 tablespoons extra-virgin olive oil",
        "1/2 medium onion, diced",
        "1 jalapeno pepper, chopped",
        "2 cloves garlic, chopped",
        "1 bay leaf",
        "Kosher salt",
        "freshly ground black pepper",
        "2 cups long-grain rice",
        "4 cups water",
        "2 cloves garlic, smashed",
        "1 tablespoon turmeric",
        "1 teaspoon kosher salt",
        "1 bay leaf"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Mexican Chicken",
        "Enchilada",
        "Cinco de Mayo",
        "Holiday"
    ],
    "title": "Chicken Enchiladas with Roasted Tomatillo Chile Salsa",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/chicken-enchiladas-with-roasted-tomatillo-chile-salsa-recipe"
}
