{
    "directions": [
        "Melt 4 tablespoons butter in heavy large skillet over medium heat. Add onion and sauté until just beginning to soften, about 6 minutes. Remove from heat. Add breadcrumbs, parsley, thyme, lemon juice and lemon peel and stir gently to blend. Season stuffing generously with salt and pepper. Cool. (Can be prepared 6 hours ahead. Cover and refrigerate.)",
        "Preheat oven to 400°F. Pat chicken dry with paper towels. Spoon stuffing into cavity of chicken. Tie legs together to hold shape. Rub remaining 2 tablespoons butter over outside of chicken. Sprinkle chicken lightly with salt and pepper. Pour oil into heavy large roasting pan. Place chicken in pan. Arrange 6 bacon slices over chicken. Arrange potatoes around chicken.",
        "Roast chicken and potatoes 45 minutes. Reduce oven temperature to 375°F. Starting at 1 short end of each remaining bacon slice, roll up into cylinders. Secure with toothpicks. Arrange bacon rolls and sausages around chicken. Remove bacon slices from atop chicken; reserve for garnish. Continue roasting chicken until meat thermometer inserted into thickest part of thigh registers 180°F and potatoes are tender, about 45 minutes longer. Transfer chicken, potatoes, sausages and bacon rolls to platter. Tent chicken with aluminum foil to keep warm.",
        "Pour off all but 3 tablespoons drippings from roasting pan. Finely chop chicken liver. Add liver and onion to drippings in roasting pan and sauté over medium heat until onion begins to turn golden, about 3 minutes. Sprinkle with flour and stir 2 minutes. Gradually stir in wine and remaining 1 cup Chicken Giblet Stock. Simmer until thickened to sauce consistency, about 5 minutes. Season with salt and pepper.",
        "Garnish chicken with reserved bacon slices. Pass gravy and jelly separately."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) butter",
        "1 medium onion, finely chopped",
        "6 cups (loosely packed) fresh white breadcrumbs",
        "3 tablespoons chopped fresh parsley",
        "2 teaspoons chopped fresh thyme or 3/4 teaspoon dried thyme",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon grated lemon peel",
        "1 5-pound roasting chicken (liver, heart, gizzard and neck reserved)",
        "2 tablespoons vegetable oil",
        "14 thick-cut bacon slices",
        "8 medium-size white-skinned potatoes (about 4 pounds), peeled, quartered",
        "8 small pork breakfast sausages",
        "1 small onion, chopped",
        "2 tablespoons all purpose flour",
        "2 cups Chicken Giblet Stock",
        "1/2 cup dry red wine",
        "Red currant jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Poultry",
        "Roast",
        "Bacon",
        "Sausage",
        "Winter",
        "Thyme"
    ],
    "title": "Chicken with Parsley and Thyme Stuffing and Roasted Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-parsley-and-thyme-stuffing-and-roasted-potatoes-1941"
}
