{
    "directions": [
        "In a skillet cook the onion in 1 tablespoon of the oil over moderately low heat until it is softened, add the zucchini, and cook the mixture, stirring, for 1 minute, or until the zucchini is tender. Stir in the red pepper, the goat cheese, and salt and pepper to taste and cook the mixture, stirring, until cheese is melted. Transfer the mixture to a small bowl and let it cool slightly.",
        "With your fingers make a pocket for the filling in each chicken breast half by separating in skin from the meat, being careful not to tear the skin and keeping the skin attached along most of the edge. Stuff each pocket with half the filling with a small spoon, packing it and pulling the skin to cover the filling completely, and secure the pockets with wooden picks if desired. In a large skillet heat the remaining 1 tablespoon oil over moderately high heat until it is hot but not smoking and in it sauté the chicken, beginning with the skin side up, for 2 minutes on each side. Reduce the heat to moderate, cook the chicken for 9 minutes on each side, or until it is cooked through, and divide it between 2 plates. Pour off the fat from the skillet, to the skillet add the broth, and boil the broth, scraping up the brown bits, for 30 seconds. Strain the sauce and pour it around the chicken."
    ],
    "ingredients": [
        "1/4 cup minced onion",
        "2 tablespoons olive oil",
        "1/2 cup firmly packed coarsely grated unpeeled scrubbed zucchini,;squeezed dry in a paper towel",
        "2 tablespoons minced drained bottled roasted red pepper or pimiento",
        "1 ounce of soft mild goat cheese, crumbled",
        "1 whole boneless chicken breast (with skin), halved",
        "1/2 cup chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Sauté",
        "Quick & Easy",
        "Goat Cheese",
        "Bell Pepper",
        "Zucchini",
        "Gourmet"
    ],
    "title": "Chicken Breasts Stuffed with Zucchini, Roasted Red Pepper, and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-stuffed-with-zucchini-roasted-red-pepper-and-goat-cheese-12368"
}
