{
    "directions": [
        "Pat chicken dry and season with salt and black pepper. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken, turning once, about 6 minutes total. (Chicken will not be cooked through.) Transfer with tongs to a plate.",
        "Add garlic, tomatoes, and red pepper flakes to skillet and sauté, stirring, until garlic is pale golden, about 1 minute. Add wine and boil, stirring and scraping up brown bits, until reduced by half, about 1 minute. Add chicken broth and bring to a boil, covered.",
        "Add chicken to skillet with any juices accumulated on plate and simmer, covered, until just cooked through, 4 to 5 minutes. Transfer chicken with tongs to a platter and keep warm, loosely covered with foil. Stir cream and 2 tablespoons basil into sauce in skillet and bring just to a simmer.",
        "Transfer sauce to a deep heatproof bowl or 1-quart glass measure and purée with an immersion blender until almost smooth. (Alternatively, blend sauce in a standing blender. Use caution when blending hot liquids.) If necessary, add water to thin to desired consistency, then season with salt and pepper.",
        "Serve sauce over chicken and sprinkle with remaining 2 tablespoons basil."
    ],
    "ingredients": [
        "4 boneless skinless chicken breast halves (1 1/2 pound total)",
        "1 tablespoon olive oil",
        "4 garlic cloves, minced",
        "1/4 cup drained sun-dried tomatoes (packed in oil; 1/2 ounce), patted dry and coarsely chopped",
        "3/4 teaspoon dried hot red pepper flakes",
        "1/4 cup dry white wine",
        "3/4 cup chicken broth",
        "1/4 cup heavy cream",
        "1/4 cup thinly sliced fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Chicken",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Basil",
        "White Wine",
        "Fall",
        "Simmer",
        "Gourmet",
        "California"
    ],
    "title": "Chicken with Sun-Dried Tomato Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-sun-dried-tomato-cream-sauce-107198"
}
