{
    "directions": [
        "Purée all ingredients except chicken in a blender until spices are well ground.",
        "Put chicken in a large bowl, or divide between 2 large sealable plastic bags, and add yogurt mixture, stirring or turning to coat. Marinate chicken, covered and chilled (turning occasionally if using bags), at least 4 hours.",
        "Soak skewers in water 30 minutes. While skewers are soaking, bring chicken to room temperature.",
        "Preheat broiler and brush a broiler pan lightly with oil.",
        "Divide chicken among skewers (about 5 cubes per skewer), leaving an 1/8-inch space between cubes, and arrange about 5 skewers across pan. Broil chicken about 4 inches from heat, turning over once, until browned in spots and just cooked through, 9 to 12 minutes total.",
        "Transfer cooked skewers to a large platter and, if desired, cover loosely with foil to keep warm. Broil remaining chicken in same manner. Remove chicken from skewers and serve warm or at room temperature."
    ],
    "ingredients": [
        "3/4 teaspoon cumin seeds, toasted",
        "3/4 teaspoon coriander seeds, toasted",
        "2 cups whole-milk yogurt",
        "4 garlic cloves, chopped",
        "1 (1 1/2-inch) piece fresh ginger, peeled and chopped",
        "3 tablespoons vegetable oil plus additional for greasing pan",
        "2 tablespoons fresh lime juice",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon ground turmeric",
        "1/2 teaspoon garam masala (Indian spice mixture)",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon cayenne",
        "5 pounds skinless boneless chicken breasts, cut into 1 1/2-inch cubes",
        "Special equipment: 20 (12-inch) wooden skewers",
        "Accompaniments: mango and red pepper chutney and mint raita",
        "Garnish: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Ginger",
        "Broil",
        "Marinate",
        "Yogurt",
        "Diwali",
        "Lime",
        "Spice",
        "Gourmet"
    ],
    "title": "Chicken Tikka",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tikka-109308"
}
