{
    "directions": [
        "Pat chicken dry and season with salt. Heat 2 tablespoons oil in a 10- to 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown chicken in batches, without crowding, turning once, 6 to 8 minutes total (add remaining 2 tablespoons oil as needed between batches). Transfer to a bowl as browned.",
        "Reduce heat to moderate and brown sausage in 4 batches in fat remaining in skillet, turning, 3 to 4 minutes. Transfer to a paper-towel-lined bowl as browned.",
        "Pour off all but about 1 tablespoon fat from skillet, then cook onions, celery, and bell pepper in skillet over moderate heat, stirring occasionally, until onions are golden brown and softened, about 8 minutes. Add garlic and cook, stirring, 1 minute. Add 1 cup stock and cook, stirring, 1 minute. Transfer mixture to a wide 8-quart heavy pot and add chicken, water, tomatoes, cayenne (if using), and remaining cup stock. Simmer, partially covered, until chicken is tender, about 30 minutes.",
        "Preheat oven to 325°F.",
        "Transfer chicken with tongs to a clean bowl and measure cooking liquid with vegetables, adding additional water as necessary to measure 7 cups. If over 7 cups, boil to reduce.",
        "Stir rice into cooking liquid (in pot). Arrange chicken over rice (do not stir), then bring to a boil over high heat, uncovered, without stirring. Bake, covered, in middle of oven until rice is tender and most of liquid is absorbed, about 30 minutes. Remove from heat and let jambalaya stand, covered, 10 minutes. Gently stir in scallion greens, sausage, and salt to taste.",
        "Available at specialty foods shops and Citarella (212-874-0383)."
    ],
    "ingredients": [
        "5 1/2 pounds chicken pieces (drumsticks, thighs, and breast halves with skin and bones)",
        "4 tablespoons vegetable oil",
        "1 1/2 pounds andouille* or other spicy smoked pork sausage, cut crosswise into 1/4-inch-thick slices",
        "3 medium onions, chopped",
        "2 celery ribs, chopped",
        "1 green bell pepper, chopped",
        "4 large garlic cloves, finely chopped",
        "2 cups chicken stock or broth",
        "1 1/2 cups water",
        "1 (14- to 16-ounce) can whole tomatoes in juice, drained and chopped",
        "1/4 teaspoon cayenne (optional)",
        "2 1/2 cups long-grain white rice, rinsed and drained well",
        "1 cup thinly sliced scallion greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Tomato",
        "Bake",
        "Mardi Gras",
        "Sausage",
        "Bell Pepper",
        "Fall",
        "Gourmet"
    ],
    "title": "Chicken and Sausage Jambalaya",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-sausage-jambalaya-107196"
}
