{
    "directions": [
        "Heat 2 tablespoons oil in heavy medium saucepan over medium-high heat. Add onion and garlic; sauté until tender, about 5 minutes. Add apple juice, red wine, vinegar, rosemary, thyme and crushed red pepper; bring to boil. Reduce heat; simmer until mixture is reduced to 1 1/2 cups, stirring occasionally, about 20 minutes. Strain mixture into small saucepan; discard solids. Add cream and simmer until reduced to sauce consistency, about 12 minutes.",
        "Meanwhile heat 2 teaspoons oil in heavy medium skillet over medium heat. Add pear slices; sauté until tender and golden brown, about 8 minutes. (Sauce and pears can be prepared 2 hours ahead. Cover separately and refrigerate. Rewarm pears over medium-low heat before serving.)",
        "Heat remaining 1 tablespoon oil in heavy large skillet over medium-high heat. Sprinkle chicken with salt and pepper. Add to skillet and sauté until cooked through and golden brown on both sides, about 4 minutes per side. Add Marsala and bring to boil. Stir in reserved sauce, turning chicken once to coat. Cook until heated through, about 2 minutes longer.",
        "Divide chicken among 4 plates. Spoons some sauce around chicken on each plate. Garnish with pear slices."
    ],
    "ingredients": [
        "3 tablespoons plus 2 teaspoons vegetable oil",
        "1/2 cup chopped onion",
        "1 tablespoon minced garlic",
        "2 cups apple juice",
        "1/2 cup red wine",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons dried rosemary",
        "1 teaspoon fresh thyme or 1/2 teaspoon dried",
        "Pinch of dried crushed red pepper",
        "1/2 cup whipping cream",
        "1 Bosc pear, quartered, cored, thinly sliced",
        "4 skinless boneless chicken breast halves",
        "1/4 cup Marsala"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Fruit",
        "Sauté",
        "Low Sodium",
        "Apple",
        "Pear",
        "Rosemary",
        "Marsala",
        "Red Wine",
        "Fall"
    ],
    "title": "Chicken with Sauteed Pears and Rosemary Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-sauteed-pears-and-rosemary-sauce-5845"
}
