{
    "directions": [
        "Preheat an oven to 400°F with a baking pan on the lower middle rack.",
        "Pat the chicken dry with paper towels. Rub the butter all over the chicken, making sure to give the back a good coating. Season generously with salt and pepper, inside and out. Position the wing tips behind the back and tie the legs together. Place the chicken, breast side up, on the preheated pan. Roast for 30 minutes.",
        "Meanwhile, stir the juice from 1/2 lemon into the stock in a small saucepan. Heat over medium-low heat until steaming, then pop in the garlic. Pull from the heat and keep in a warm spot. (I leave it on top of the hot stove, but with the burner off.) After 30 minutes are up for the chicken, pour 1 cup of the liquid into the baking pan, holding back the garlic, and roast for 30 minutes more.",
        "Cut the juiced lemon half into wedges; keep the other half for the relish.",
        "Pull the baking pan from the oven. Sprinkle the couscous around the chicken. Pour the remaining liquid onto the couscous and tuck in the lemon wedges and soaked garlic. Return the baking pan to the oven and continue to roast until both the chicken and the couscous are cooked through, around 30 minutes. If the liquid is absorbed before the couscous is cooked, add more liquid, a half cup at a time, as needed.",
        "Let the baking pan stand for 10 minutes while you make the relish. Squeeze the (now) roasted garlic into a small skillet. Add the oil and set the pan over medium heat. When the oil is hot, add the anchovies and red pepper flakes. Cook, stirring and breaking up the anchovies and garlic, until they've turned into a grungy paste, 2 to 3 minutes. Add the capers to the pan, and cook for 1 minute more. Stir in the juice from the second half of the lemon, along with the raisins and half of the parsley. Reduce the heat and simmer for 2 minutes, then check for seasoning. Remove the chicken to a board and carve as you'd like. Fluff the couscous with a fork, then arrange the cut chicken on top. Scatter the rest of the parsley over the whole baking pan of chicken and couscous, and serve with the relish."
    ],
    "ingredients": [
        "1 whole chicken, about 4 pounds",
        "1 tablespoon butter, softened",
        "Medium-grain kosher salt and freshly ground black pepper",
        "1 lemon",
        "Approximately 2.5 cups chicken stock or water",
        "4 cloves garlic, with loose paper removed but unpeeled",
        "8 ounces large pearl couscous (see Note)",
        "1/4 cup extra-virgin olive oil (it needn't be an expensive one but should taste good)",
        "2 to 4 anchovy fillets, rinsed if salt-packed",
        "Generous pinch of crushed red pepper flakes",
        "1 1/2 tablespoons capers, rinsed if packed in salt, drained if packed in brine",
        "2 tablespoons golden raisins or dried currants",
        "A couple of handfuls of flat-leaf parsley, chopped",
        "Pickled caperberries, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Kid-Friendly",
        "Dinner",
        "Couscous",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken and Couscous with a Punchy Relish",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-couscous-with-a-punchy-relish-56389470"
}
