{
    "directions": [
        "Heat 3 tablespoons olive oil in a large heavy pot over medium heat. Add almonds and stir until golden brown, about 3 minutes; transfer to paper towels. Place 1/3 cup almonds in a blender or food processor. Set aside remaining almonds for garnish. Add bread cubes and garlic to same pot. Cook, stirring frequently, until bread is golden brown and crisp, 4-5 minutes. Using a slotted spoon, transfer to blender. Add broth, Sherry, 1/2 teaspoon pepper, saffron, if using, and a large pinch of salt; process until almost smooth. Set aside.",
        "Heat remaining 1 tablespoon olive oil in same pot over medium-high heat. Season chicken with salt and pepper. Add to pot and cook, turning down heat if needed to prevent burning, until chicken is golden brown on all sides, about 12 minutes total (this step is just to brown the skin). Transfer chicken to a plate.",
        "Add onion to pot; cook, stirring often, until onion is caramelized around edges, about 6 minutes. Add sauce and chicken to pot, pushing down chicken to submerge. Bring sauce to a simmer, cover, and reduce heat to low. Simmer until chicken is just cooked through, about 20 minutes. Season to taste with salt and pepper.",
        "Divide chicken and sauce among bowls. Garnish each serving with reserved almonds and chopped parsley."
    ],
    "ingredients": [
        "4 tablespoons olive oil, divided",
        "1/2 cup slivered almonds",
        "2 cups 1/2\" cubes crustless white bread",
        "4 garlic cloves",
        "2 cups low-sodium chicken broth",
        "2/3 cup dry Sherry or white wine",
        "1/2 teaspoon freshly ground black pepper plus more for seasoning",
        "1/2 teaspoon saffron threads (optional)",
        "Kosher salt",
        "4 chicken legs (thigh and drumstick)",
        "1 onion, minced",
        "1 tablespoon chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Garlic",
        "Nut",
        "Poultry",
        "Vegetable",
        "Sauté",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Almond"
    ],
    "title": "Chicken in Garlic-Almond Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-garlic-almond-sauce-51117260"
}
