{
    "directions": [
        "1. Combine 2 tablespoons of the curry powder and the salt in a bowl. Add the chicken and turn to coat the meat evenly. Set aside for 30 minutes.",
        "2. Heat the oil in a medium pot over moderate heat. Add the shallot, garlic, chili paste and the remaining 1 tablespoon curry powder, and stir until fragrant, about 10 seconds. Add the chicken and cook until the edges of the pieces are golden, 3 to 4 minutes. Add the fish sauce, sugar, lemongrass, ginger and chicken stock. Bring to a boil, then reduce the heat. Add the carrots and cook for 10 minutes. Add the coconut milk, onion and sweet potato and cook until the vegetables are tender, about 15 minutes. Transfer to a serving bowl, garnish with Asian basil, cilantro and scallions, and serve."
    ],
    "ingredients": [
        "3 tablespoons curry powder, preferably Three Golden Bells brand",
        "1/2 teaspoon salt, or to taste",
        "2 pounds skinless chicken thighs",
        "2 tablespoons vegetable oil",
        "1 tablespoon chopped shallot",
        "2 teaspoons minced garlic",
        "2 teaspoons ground chili paste or dried chili flakes, or to taste",
        "3 tablespoons fish sauce",
        "1 tablespoon sugar",
        "2 lemongrass stalks, cut into 3-inch pieces and bruised with the flat side of a knife",
        "1 (1-inch) piece ginger, peeled, cut into 3 slices and bruised with the flat side of a knife",
        "1 1/2 cups fresh chicken stock or store-bought low-sodium chicken broth",
        "3 carrots, peeled, cut on the diagonal into 2/3-inch pieces",
        "1 1/2 cups unsweetened coconut milk or cow's milk",
        "1 yellow onion, cut into wedges",
        "1 medium sweet potato (about 1 pound), peeled and cut into 1-inch cubes",
        "1/2 cup Asian basil leaves, cut in half",
        "8 sprigs cilantro, cut into 2-inch pieces",
        "2 scallions, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Ginger",
        "Onion",
        "Potato",
        "Sauté",
        "Lunar New Year",
        "Curry",
        "Carrot",
        "Sweet Potato/Yam",
        "Lemongrass"
    ],
    "title": "Chicken Curry with Sweet Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-curry-with-sweet-potatoes-233843"
}
