{
    "directions": [
        "Place a soup pot over medium heat and coat with the oil. Add the onion, garlic, carrots, celery, thyme and bay leaf. Cook and stir for about 6 minutes, until the vegetables are softened but not browned. Pour in the chicken stock and bring the liquid to a boil. Add the noodles and simmer for 5 minutes until tender. Fold in the chicken, and continue to simmer for another couple of minutes to heat through; season with salt and pepper. Sprinkle with chopped parsley before serving.",
        "Place the chicken and vegetables in a large stockpot over medium heat. Pour in only enough cold water to cover (about 3 quarts); too much will make the broth taste weak. Toss in the thyme, bay leaves, and peppercorns, and allow it to slowly come to a boil. Lower the heat to medium-low and gently simmer for 1 to 1 1/2 hours, partially covered, until the chicken is done. As it cooks, skim any impurities that rise to the surface; add a little more water if necessary to keep the chicken covered while simmering.",
        "Carefully remove the chicken to a cutting board. When its cool enough to handle, discard the skin and bones; hand-shred the meat into a storage container.",
        "Carefully strain the stock through a fine sieve into another pot to remove the vegetable solids. Use the stock immediately or if you plan on storing it, place the pot in a sink full of ice water and stir to cool down the stock. Cover and refrigerate for up to one week or freeze."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1 medium onion, chopped",
        "3 garlic cloves, minced",
        "2 medium carrots, cut diagonally into 1/2-inch-thick slices",
        "2 celery ribs, halved lengthwise, and cut into 1/2-inch-thick slices",
        "4 fresh thyme sprigs",
        "1 bay leaf",
        "2 quarts chicken stock, recipe follows",
        "8 ounces dried wide egg noodles",
        "1 1/2 cups shredded cooked chicken",
        "Kosher salt and freshly ground black pepper",
        "1 handful fresh flat-leaf parsley, finely chopped",
        "1 whole free-range chicken (about 3 1/2 pounds), rinsed, giblets discarded",
        "2 carrots, cut in large chunks",
        "3 celery stalks, cut in large chunks",
        "2 large white onions, quartered",
        "1 head of garlic, halved",
        "1 turnip, halved",
        "1/4 bunch fresh thyme",
        "2 bay leaves",
        "1 teaspoon whole black peppercorns"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Noodle Soup",
        "Chicken",
        "Poultry Recipes",
        "American",
        "Soup",
        "Celery",
        "Vegetable",
        "Egg Noodle Recipes",
        "Noodles",
        "Carrot Recipes",
        "Turnip Recipes",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Chicken Noodle Soup",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/chicken-noodle-soup-recipe0"
}
