{
    "directions": [
        "Whisk lemon juice and mustard in small bowl. Gradually whisk in 2 tablespoons oil. Stir in drained capers and chopped tarragon. Season dressing to taste with salt and pepper.",
        "Preheat broiler. Place remaining 2 tablespoons olive oil in large bowl. Stir in ground fennel seeds. Add asparagus spears to bowl and toss to coat lightly. Arrange asparagus in single layer at 1 short end of large rimmed baking sheet. Add shallots to same bowl; toss to coat with oil mixture. Arrange in center of same rimmed baking sheet. Add chicken to same bowl; toss to coat. Using tongs, transfer chicken to same rimmed baking sheet, arranging in single layer at opposite end of sheet. Sprinkle vegetables and chicken with salt and pepper.",
        "Broil chicken and vegetables 4 minutes. Turn chicken cutlets and asparagus spears over; toss shallots. Broil until chicken is cooked through and asparagus and shallots are brown in spots, watching carefully to avoid burning, about 4 minutes. Divide chicken cutlets among plates; top with shallots. Arrange asparagus spears alongside. Drizzle mustard dressing over chicken and serve."
    ],
    "ingredients": [
        "1 tablespoon fresh lemon juice",
        "1 1/2 teaspoons Dijon mustard",
        "4 tablespoons extra-virgin olive oil, divided",
        "2 teaspoons drained capers",
        "1 1/2 teaspoons chopped fresh tarragon",
        "1 1/4 teaspoons fennel seeds, ground in spice mill or in mortar with pestle",
        "1 pound medium asparagus spears, trimmed",
        "2 cups sliced shallots (about 12 ounces)",
        "1 1/4 pounds 1/4- to 1/3-inch-thick chicken cutlets (about 8)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Asparagus",
        "Shallot",
        "Capers",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken Cutlets with Asparagus, Capers, and Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-cutlets-with-asparagus-capers-and-shallots-357352"
}
