{
    "directions": [
        "Whisk flour, 1/4 cup yogurt, 1 1/4 tsp. salt, and 2 cups plus 1 Tbsp. water in a medium bowl; set aside.",
        "Heat 1 Tbsp. oil in a large skillet over medium-high. Add lamb, cumin, red pepper, and 1/4 tsp. salt and cook, breaking up with a wooden spoon and stirring often, until browned, about 4 minutes. Transfer to a medium bowl with a slotted spoon, leaving fat in skillet.",
        "Add 2 Tbsp. oil to skillet, then add eggplant and remaining 1 tsp. salt. Cook, stirring occasionally, until browned on all sides, about 5 minutes. Add garlic and cook until lightly browned and fragrant, about 1 minute. Add raisins and wine and cook, stirring, until heated through, about 1 minute. Add tomatoes and their juices, pine nuts, lamb mixture, and 1/4 cup water. Reduce heat to medium and let simmer, stirring occasionally, until most of the juices have evaporated, about 15 minutes.",
        "Meanwhile, swirl remaining 1 tsp. oil in an 8\" nonstick skillet, then wipe it out with paper towels so there's just a sheen of oil coating skillet, then heat over medium-high. Whisk flour mixture to loosen, then pour about 1/3 cup into skillet. Immediately swirl to coat pan with batter, as if you’re making a crepe, and cook until bottom is browned, about 1 minute. Flip and cook until browned, 30 seconds more. Transfer to a clean plate and cover with a towel to keep warm. Repeat with remaining batter, using greased paper towels to prepare pan before each, until you have at least 8 pancakes. (The batter can yield 11–12 pancakes, but you might have a few you'll need to discard—or nibble as a snack as you cook.)",
        "Spoon lamb filling onto pancakes. Top with yogurt and greens and serve with lemon wedges alongside.",
        "Pancake batter can be made 2 days ahead; cover and chill. Pancakes can be made 3 days ahead; transfer to resealable plastic bags and chill, or freeze up to 1 month. Reheat in skillet before serving."
    ],
    "ingredients": [
        "2 1/4 cups chickpea flour",
        "1/4 cup plain yogurt, plus more for serving",
        "2 1/2 teaspoons kosher salt, divided",
        "3 tablespoons plus 1 teaspoon olive oil, divided",
        "1/2 pound ground lamb",
        "1 1/2 teaspoons ground cumin",
        "1/4 teaspoon crushed red pepper flakes",
        "1 (1-pound) eggplant, cut into 1\" cubes",
        "3 garlic cloves, thinly sliced",
        "1/4 cup golden raisins",
        "1/4 cup red wine",
        "1 (15-ounce) can diced tomatoes",
        "1/4 cup toasted pine nuts",
        "Baby greens, such as arugula, kale, or spinach, and lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wheat/Gluten-Free",
        "Taco",
        "Chickpea",
        "Yogurt",
        "Lamb",
        "Ground Lamb",
        "Eggplant",
        "Raisin",
        "Red Wine",
        "Tomato",
        "Pine Nut",
        "Dinner"
    ],
    "title": "Chickpea Crêpe \"Tacos\" With Eggplant and Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/chickpea-crepe-tacos-with-eggplant-and-lamb"
}
