{
    "directions": [
        "Preheat oven to 275°F. Season chicken legs with salt and pepper on both sides and nestle into a 1 1/2-quart baking dish. Arrange shallots, garlic, and 6 thyme sprigs around chicken and pour oil over. Bake until chicken is cooked through and tender and shallots and garlic have started to caramelize, 2–2 1/2 hours.",
        "Meanwhile, cook potatoes in a medium pot of boiling salted water until tender, 15–20 minutes. Drain and set aside.",
        "Remove chicken from oven. Pour off infused oil, reserving 5 tablespoons (save remaining oil for another use). Heat 2 tablespoons infused oil in a large skillet over medium-high. Carefully transfer chicken to skillet, arranging skin side down. Cook, undisturbed, until skin is golden brown and crisp, about 5 minutes. Return chicken to dish, placing skin side up.",
        "Heat 2 tablespoons infused oil in same skillet (no need to wipe it out) and add potatoes and remaining 2 thyme sprigs. Using the back of a wooden spoon or spatula, lightly crush potatoes to flatten slightly. Season with salt and pepper and cook, tossing occasionally, until potatoes are well browned and crisp on all sides (some pieces will fall off and get extra-brown; you want this!), 8–10 minutes. Transfer to a medium bowl.",
        "Toss escarole in another medium bowl with lemon zest, lemon juice, and 1 tablespoon infused oil; season with salt and pepper.",
        "Serve chicken in baking dish (with all those shallots and garlic) with escarole and potatoes alongside.",
        "Chicken can be cooked (but not crisped) 2 days ahead; reheat in low oven before crisping. Potatoes can be boiled 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "2 chicken legs (thigh and drumstick)",
        "Kosher salt, freshly ground pepper",
        "2 large shallots, unpeeled, quartered",
        "1 head of garlic, unpeeled, halved crosswise",
        "8 sprigs thyme, divided",
        "1 1/2 cups olive oil",
        "10 ounces fingerling potatoes",
        "1 small head of escarole, leaves torn into bite-size pieces",
        "1 tablespoon finely grated lemon zest",
        "2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Chicken-Leg Confit With Potatoes and Escarole",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-leg-confit-with-potatoes-and-escarole-56390118"
}
