{
    "directions": [
        "In a medium saucepan combine water, chicken, yellow onion, cloves, and 1 teaspoon salt and bring water to a boil. Poach chicken, covered, over moderately low heat until cooked through, about 15 minutes. Remove pan from heat and cool chicken in cooking liquid to room temperature. Discard poaching liquid, yellow onion, cloves, and chicken skin and bones. Tear meat into bite-size pieces.",
        "Cut each potato in half. In a saucepan combine potatoes, remaining teaspoon salt, and water to cover by 1 inch and bring water to a boil. Cook potatoes 10 minutes, or until tender. Transfer potatoes with a slotted spoon to a colander and rinse under cold water to stop cooking. In same boiling water cook green beans 3 to 5 minutes, or until crisp-tender, and drain in colander with potatoes.",
        "In a small saucepan combine dried tomatoes and water to cover and bring water to a boil. Simmer tomatoes 2 minutes, or until softened, and drain. Set tomatoes aside until cool enough to handle and cut into thin strips.",
        "In a large bowl combine chicken, potatoes, green beans, tomatoes, and remaining ingredients except lettuces and toss to combine well. Season salad with salt and pepper and serve over lettuces."
    ],
    "ingredients": [
        "3 cups water",
        "1 whole chicken breast with skin and bones (about 1 1/4 pounds)",
        "1 yellow onion, sliced",
        "10 whole cloves",
        "2 teaspoons salt",
        "1 1/4 pounds small red potatoes",
        "1/2 pound green beans, trimmed and halved",
        "1/2 cup dried tomatoes (about 2 ounces), not packed in oil",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped coarse",
        "1/2 medium red onion, cut lengthwise into thin strips",
        "3 tablespoons fresh lemon juice",
        "1 tablespoon minced fresh rosemary leaves",
        "1 teaspoon dried oregano, crumbled",
        "1 tablespoon extra-virgin olive oil",
        "3 cups assorted lettuces such as red oak leaf, red romaine, and Lollo rosso*",
        "*available at specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gourmet"
    ],
    "title": "Chicken, Potato, and Green Bean Salad",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-potato-and-green-bean-salad-13050"
}
