{
    "directions": [
        "Boil juice, honey, and soy sauce in heavy medium saucepan until reduced to 2/3 cup, about 20 minutes. Mix in grated peel and chipotle chiles.",
        "Whisk first 9 ingredients in 13x9x2-inch glass baking dish to blend. Add chicken; turn to coat with marinade. Cover; chill at least 2 hours and up to 1 day, turning occasionally.",
        "Spray grill rack with nonstick spray and prepare barbecue (medium-low heat). Remove chicken from marinade; discard marinade. Sprinkle chicken lightly with salt. Grill chicken until cooked through, turning and repositioning occasionally for even cooking, about 20 minutes. Brush chicken all over with glaze; grill 2 minutes longer on each side. Transfer chicken to platter. Serve, passing remaining glaze separately.",
        "*Chipotle chiles are dried, smoked jalapeños canned in a spicy tomato sauce, which is sometimes called adobo. They are available at some supermarkets, specialty foods stores, and Latin markets."
    ],
    "ingredients": [
        "2 cups fresh tangerine juice",
        "5 tablespoons honey",
        "1/4 cup soy sauce",
        "2 tablespoons finely grated tangerine peel or orange peel",
        "2 teaspoons minced canned chipotle chiles in adobo sauce*",
        "1 cup fresh tangerine juice or orange juice",
        "1/3 cup chopped fresh parsley",
        "1/3 cup chopped fresh cilantro",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons minced peeled fresh ginger",
        "3 tablespoons unseasoned rice vinegar",
        "2 tablespoons olive oil",
        "2 tablespoons finely grated tangerine peel or orange peel",
        "1 teaspoon coarse kosher salt",
        "1 2 3/4- to 3-pound chicken, quartered, backbone removed",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Poultry",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill/Barbecue",
        "Honey",
        "Tangerine",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chicken with Tangerine, Honey, and Chipotle Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-tangerine-honey-and-chipotle-glaze-232383"
}
