{
    "directions": [
        "Add the olive oil to a skillet over high heat. Throw in the onions and peppers and cook until the peppers have a few dark brown/black areas, 3 to 4 minutes. Remove and set aside. Add the Perfect Grilled Chicken to the skillet and heat over medium-high heat until warmed through. Dice into cubes and set aside.",
        "Sizzle 1/2 tablespoon of the butter in a separate skillet or griddle over medium heat and lay a flour tortilla in the skillet. Then build the quesadillas by laying grated cheese on the bottom tortilla, and then arranging the chicken and cooked peppers over it. Top with a little more grated cheese and top with a second tortilla.",
        "When the tortilla is golden on the first side, carefully flip the quesadilla to the other side, adding another 1/2 tablespoon butter to the skillet at the same time. Continue cooking until the second side is golden. Repeat with the remaining tortillas and fillings.",
        "Cut each quesadilla into wedges and serve with Pico de Gallo.",
        "Mix together the olive oil, honey, mustard, salt, thyme, oregano and lemon juice in a large shallow container.",
        "Pound the chicken breasts to uniform thickness and add them to the marinade. Cover and marinate in the fridge for at least 8 hours.",
        "Heat a grill pan over medium-high heat. Grill the chicken in batches until golden brown on the first side, 4 to 5 minutes. Flip and cook until golden brown on the other side and cooked all the way through, another 4 to 5 minutes. Let the chicken cool.",
        "Transfer the chicken to freezer bags individually and in pairs, so it's easy to defrost the exact amount you need. Yield: 24 servings",
        "Slice 2 of the jalapenos in half. With a spoon, scrape out the seeds. (If you like things spicy, leave in some of the white membranes.) Dice the jalapenos very finely; you want a hint of heat and jalapeno flavor, but you don't want to cause any fires. Now dump the jalapenos, cilantro, tomatoes and onions in a bowl.",
        "Slice the lime in half and squeeze the juice from half the lime into the bowl. Sprinkle with salt, and stir together until combined. Be sure to taste the pico de gallo and adjust the seasonings, adding salt or more diced jalapeno if needed."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 large onion, halved and cut into slices",
        "1 green bell pepper, seeded and sliced into strips",
        "1 red bell pepper, seeded and sliced into strips",
        "1 yellow bell pepper, seeded and sliced into strips",
        "2 pounds Perfect Grilled Chicken (thawed if frozen), recipe follows",
        "6 tablespoons butter, for frying",
        "12 large flour tortillas",
        "2 1/2 cups grated cheese (Monterey Jack is the best)",
        "Pico de Gallo, for serving, recipe follows",
        "2 cups olive oil",
        "6 tablespoons honey",
        "3 heaping tablespoons Dijon mustard",
        "1 tablespoon salt",
        "2 teaspoons ground thyme",
        "2 teaspoons ground oregano",
        "Juice of 12 lemons",
        "24 boneless, skinless chicken breasts",
        "2 to 3 jalapenos",
        "2 cups fresh cilantro leaves, roughly chopped",
        "12 Roma tomatoes (slightly under ripe is fine), diced",
        "3 yellow or red onions, diced",
        "1 lime",
        "Salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Quesadilla",
        "Cheese",
        "Chicken",
        "Poultry Recipes",
        "Bell Peppers",
        "Vegetable",
        "Appetizer"
    ],
    "title": "Chicken Quesadillas",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-quesadillas"
}
