{
    "directions": [
        "Crisp bacon in a large Dutch oven over medium heat; transfer to a paper towel–lined plate.",
        "Place flour in a shallow bowl. Season chicken with salt and pepper and dredge in flour. Working in batches, cook chicken, skin side down, in same pot over medium heat until deep golden brown and crisp (do not turn), 12–15 minutes. Transfer to a plate.",
        "Working in 2 batches, cook mushrooms in same pot, seasoning with salt and pepper and stirring occasionally, until brown, 5–8 minutes. Transfer to a bowl. Add onion and garlic to pot; cook, stirring occasionally, until onion is soft and translucent, 5–8 minutes.",
        "Add wine to pot; simmer until reduced by half, about 5 minutes. Add chicken, bacon, thyme, bay leaves, and broth; season with salt and pepper. Bring to a boil, reduce heat, and gently simmer, partially covered, skimming occasionally, until chicken is falling off the bone, 2–2 1/2 hours. Add mushrooms and simmer until flavors meld, 10–15 minutes; season with salt and pepper.",
        "Bring a medium pot of salted water to a boil. Whisk flour, baking powder, nutmeg, pepper, and 3/4 teaspoons salt in a medium bowl. Whisk in eggs and milk (batter will be slightly lumpy). Reduce heat until water is at a strong simmer. Drop teaspoonfuls of batter into water; cook until dumpling are cooked through and doubled in size, about 5 minutes. Remove with slotted spoon; add to stew just before serving.",
        "DO AHEAD: Stew (without dumplings) can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "6 ounces slab bacon, cut into 1/4\" pieces",
        "1/4 cup all-purpose flour",
        "4 chicken legs (drumsticks with thighs; about 2 pounds)",
        "Kosher salt, freshly ground pepper",
        "1 1/2 pounds mixed mushrooms",
        "1 medium onion, chopped",
        "6 garlic cloves, crushed",
        "1/4 cup dry white wine",
        "6 sprigs thyme",
        "2 bay leaves",
        "8 cups low-sodium chicken broth",
        "3/4 teaspoons kosher salt, plus more",
        "1 cup all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon freshly grated nutmeg",
        "1/8 teaspoon freshly ground black pepper",
        "2 large eggs",
        "1/4 cup whole milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Mushroom",
        "Poultry",
        "Braise",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken and Dumplings with Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-dumplings-with-mushrooms-51214640"
}
