{
    "directions": [
        "Bring first 5 ingredients to boil in large pot. Reduce heat; simmer gently until chicken is cooked through, about 30 minutes. Cool chicken in broth 30 minutes, then transfer chicken to bowl and cool completely (reserve broth for another use).",
        "Cook carrots in pot of boiling salted water until crisp-tender, about 6 minutes. Using slotted spoon, transfer carrots to another bowl. Add potatoes to same pot and boil until tender, about 35 minutes. Drain. Cool potatoes, then peel and cut into 3/4-inch cubes; add to bowl with carrots.",
        "Preheat oven to 200°F. Bring Ancho-Guajillo Chile Sauce to simmer in large saucepan. Reduce heat to low and keep warm. Heat 3 tablespoons oil in large skillet over medium heat. Place 1/2 cup warm chile sauce in medium bowl. Dip chicken pieces into sauce to coat, allowing excess to drip back into bowl. Add chicken pieces to skillet and fry until heated through, about 5 minutes per side. Transfer chicken to rimmed baking sheet and keep warm in oven.",
        "Pour 1/4 cup oil into same skillet; heat over medium-high heat. Add potatoes and carrots; sauté until heated through, about 6 minutes. Using slotted spoon, transfer potatoes and carrots to 13x9x2-inch baking dish. Season with salt. Keep warm in oven. Heat 1/2 cup oil in same skillet over medium heat. Quickly dip 1 tortilla into warm chile sauce to coat, then carefully slide tortilla into hot oil (mixture will splatter). Cook 10 seconds per side. Using tongs, transfer tortilla to baking sheet; fold tortilla in half. Keep warm in oven. Repeat.",
        "Place 2 tortillas on each plate. Top with some of warm chile sauce, then potatoes and carrots. Sprinkle with cheese, sliced onion, radishes, and jalapeños; top with crema. Arrange 2 lettuce leaves alongside. Place chicken atop lettuce and serve.",
        "*Cultured Mexican cream with a slightly nutty flavor and consistency of thin sour cream."
    ],
    "ingredients": [
        "6 cups water",
        "6 chicken thighs with skin and bones",
        "1 small white onion, quartered",
        "6 garlic cloves, halved",
        "3/4 teaspoon fine sea salt",
        "3 carrots, peeled, diced",
        "3 medium red-skinned potatoes",
        "Ancho-Guajillo Chile Sauce",
        "1 cup (about) corn oil",
        "12 5- to 6-inch-diameter corn tortillas",
        "1 cup crumbled queso fresco",
        "1 cup sliced white onion",
        "1/3 cup thinly sliced radishes",
        "3 pickled jalapeño chiles, halved",
        "6 tablespoons crema mexicana* or sour cream",
        "12 romaine lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Sauté",
        "Super Bowl",
        "Cinco de Mayo",
        "Carrot",
        "Radish",
        "Spring",
        "Healthy",
        "Jalapeño",
        "Sour Cream",
        "Tortillas"
    ],
    "title": "Chicken, Potato, and Carrot Enchiladas with Ancho-Guajillo Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-potato-and-carrot-enchiladas-with-ancho-guajillo-chile-sauce-108054"
}
