{
    "directions": [
        "Stir together ground cinnamon, ginger, turmeric, pepper, 1 teaspoon salt, and 2 tablespoons oil in a large bowl. Add chicken and turn to coat well.",
        "Heat butter and 1 tablespoon oil in base of tagine (or in skillet), uncovered, over moderate heat until hot but not smoking, then brown half of chicken, skin sides down, turning over once, 8 to 12 minutes. Transfer to a plate. Brown remaining chicken in same manner, adding any spice mixture left in bowl.",
        "Add onion and remaining 1/4 teaspoon salt to tagine and cook, uncovered, stirring frequently, until soft, about 8 minutes. Add garlic and cook, stirring occasionally, 3 minutes. Tie cilantro and parsley into a bundle with kitchen string and add to tagine along with 1/2 cup water, chicken, and any juices accumulated on plate. Reduce heat and simmer, covered, 30 minutes.",
        "While chicken cooks, bring honey, remaining cup water, cinnamon stick, and apricots to a boil in a 1- to 2-quart heavy saucepan, then reduce heat and simmer, uncovered, until apricots are very tender (add more water if necessary). Once apricots are tender, simmer until liquid is reduced to a glaze, 10 to 15 minutes.",
        "While apricots cook, heat remaining 1/4 cup oil in a small skillet over moderate heat and cook almonds, stirring occasionally, until just golden, 1 to 2 minutes. Transfer with a slotted spoon to paper towels to drain.",
        "Ten minutes before chicken is done, add apricot mixture to tagine. Discard herbs and cinnamon stick, then serve chicken sprinkled with almonds on top."
    ],
    "ingredients": [
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon turmeric",
        "1/2 teaspoon black pepper",
        "1 1/4 teaspoons salt",
        "3 tablespoons plus 1/4 cup olive oil",
        "1 (3-lb) chicken, cut into 6 pieces, wings and backbone discarded",
        "1 tablespoon unsalted butter",
        "1 medium red onion, halved, then sliced 1/4 inch thick",
        "4 garlic cloves, finely chopped",
        "5 fresh cilantro",
        "5 sprigs fresh flat-leaf parsley",
        "1 1/2 cups water",
        "2 tablespoons mild honey",
        "1 (3-inch) cinnamon stick",
        "1/2 cup dried Turkish apricots, separated into halves",
        "1/3 cup whole blanched almonds",
        "Special equipment: a 10- to 12-inch tagine or heavy skillet; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Apricot",
        "Almond",
        "Spice",
        "Cilantro",
        "Parsley",
        "Simmer",
        "Gourmet"
    ],
    "title": "Chicken Tagine with Apricots and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tagine-with-apricots-and-almonds-234649"
}
