{
    "directions": [
        "In a large skillet cook the onions in 2 tablespoons of the butter over moderate heat, stirring, until they are softened and transfer them to a food processor. In the skillet melt 2 tablespoons of the remaining butter over moderately high heat until the foam subsides and in it sauté the chicken livers, patted dry and seasoned with salt and pepper, stirring, for 2 minutes, or until they are browned on the outside but still pink within. Transfer the livers to the food processor. Add the Port to the skillet, bring it to a boil, and deglaze the skillet, scraping up the brown bits, for 1 minute. Add the Port to the food processor with the remaining 4 tablespoons butter, softened, the allspice, the lemon juice, and salt and pepper to taste, purée the mixture until it is smooth, and force it through a fine sieve into a bowl. Line an oiled 1 1/2-quart terrine or straight-sided dish with plastic wrap and pour the pâté, covered, for 5 hours, or until it is firm. The pâté may be made 4 days in advance and kept covered and chilled. Invert the pâté onto a plate, discarding the plastic wrap, and smooth the top and sides. Spread the preserves on the top and serve the pâté with the toast points or water biscuits."
    ],
    "ingredients": [
        "3 large onions (about 3/4 pound), chopped",
        "1 stick (1/2 cup) unsalted butter",
        "1 pound chicken livers, trimmed",
        "1/4 cup Tawny Port",
        "1/4 teaspoon allspice",
        "1 tablespoon fresh lemon juice",
        "1/3 cup fig preserves (available at specialty foods shops and some  supermarkets), chopped fine",
        "toast points or water biscuits as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Onion",
        "Poultry",
        "Appetizer",
        "Fig",
        "Port",
        "Winter",
        "Gourmet"
    ],
    "title": "Chicken Liver Pâté with Fig Preserves",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-liver-pate-with-fig-preserves-13539"
}
