{
    "directions": [
        "Using meat mallet, lightly pound chicken between sheets of waxed paper to thickness of 1/2 inch. Mix 2 tablespoons oil, lime juice, garlic, salt and pepper in large glass baking dish. Add chicken and turn to coat. Cover and refrigerate at least 30 minutes or up to 1 hour.",
        "Preheat oven to 350°F. Wrap tortillas in foil. Heat in oven until warmed through, about 10 minutes. Turn oven off. Leave tortillas in oven.",
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add onion and sauté 3 minutes. Add bell peppers and sauté until vegetables are tender-crisp, about 4 minutes. Season with salt and pepper. Transfer vegetables to large bowl and tent with foil to keep warm. Do not clean skillet.",
        "Heat 1 tablespoons oil in same skillet over medium-high heat. Remove chicken from marinade; discard marinade. Add chicken to skillet and sauté until cooked through, about 3 minutes per side. Season with salt and pepper. Cut chicken into 1-inch-wide strips. Combine with vegetables. Divide vegetable and chicken mixture among plates. Serve passing tortillas, Chipotle Pico de Gallo and sour cream separately."
    ],
    "ingredients": [
        "4 skinless boneless chicken breast halves",
        "5 tablespoons vegetable oil",
        "1/4 cup fresh lime juice",
        "1 tablespoon minced garlic",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground pepper",
        "8 6-inch diameter flour tortillas",
        "1 large red onion, sliced",
        "1 large red bell pepper, cut into 3/4-inch-wide strips",
        "1 large yellow or green bell pepper, cut into 3/4-inch-wide strips",
        "Sour Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Pepper",
        "Marinate",
        "Sauté"
    ],
    "title": "Chicken and Bell Pepper Fajitas",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-bell-pepper-fajitas-1522"
}
