{
    "directions": [
        "Preheat oven to 375°F. Peel the onion and cut into eights, trim, wash, and slice the leek, peel and slice the garlic. Place a large ovenproof casserole pan over medium heat. Finely slice the pancetta, pick and finely chop the rosemary leaves, then place both in the pan with 1 tablespoon of oil and the bay leaves. Stir regularly for 2 minutes, then add the garlic, followed by the onion and leek. Cook for 10 minutes, stirring regularly.",
        "Meanwhile, chop the squash or sweet potato (wash first) into bite-sized chunks, leaving the skin on and discarding any squash seeds. I like to cut the stalk and face off the mushrooms because it looks nice—just add the trimmings straight to the pan, along with the whole mushrooms and chopped squash or sweet potato. Remove and discard the chicken skin and add the chicken to the pan. Pour in the wine and let it reduce slightly, then add the tomatoes and break them up with a wooden spoon. Half-fill each can with water, swirl about, pour into the pan, and mix it all together. Pit the olives, then poke them into the stew. Bring to a gentle simmer, then transfer to the oven to cook for 1 hour, or until thick, delicious, the chicken falls off the bone, and the squash or sweet potato is lovely and tender. Season to perfection, then serve with bread to mop up that tasty sauce."
    ],
    "ingredients": [
        "1 onion",
        "1 leek",
        "4 cloves of garlic",
        "2 slices of smoked pancetta",
        "2 sprigs of fresh rosemary",
        "Olive oil",
        "2 fresh bay leaves",
        "1/2 a butternut squash or sweet potatoes (1 1/4 lbs)",
        "3 1/2 ounces chestnut or cremini mushrooms",
        "2 (12-oz cans) of plum tomatoes",
        "1 cup Chianti or other good red wine",
        "4 chicken thighs, bone in",
        "8 black olives (with pits)",
        "7 ounce whole-grain bread with seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Butternut Squash",
        "Kid-Friendly",
        "Mushroom",
        "Tomato",
        "Bread",
        "Healthy",
        "Low Fat",
        "HarperCollins"
    ],
    "title": "Chicken & Squash Cacciatore, Mushrooms, Tomatoes, Olives, Bread",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-squash-cacciatore-mushrooms-tomatoes-olives-bread"
}
