{
    "directions": [
        "Stir together sugar, wine, soy sauce, oyster sauce, and water in a medium bowl, then set aside.",
        "Cut chicken through bones into 1-inch pieces with a cleaver. Add chicken to a 4-quart pot of boiling water and simmer briskly, uncovered, 5 minutes. Drain chicken in a colander and when cool enough to handle remove any skin, excess fat, and tiny bone shards.",
        "Heat vegetable oil in a wok over moderately high heat until hot but not smoking, then stir-fry ginger and garlic until golden, 1 to 2 minutes, and transfer to a plate with a slotted spoon. Add half of chicken to wok and stir-fry until golden, about 2 minutes, then transfer to plate with ginger and garlic. Stir-fry remaining chicken with chestnuts until golden, about 2 minutes. Return chicken, ginger, and garlic from plate to wok, then add soy mixture. Cover wok and cook chicken over moderate heat until sauce is reduced by half, about 25 minutes. Remove lid and cook over moderately high heat, stirring frequently, until sauce is thickened and just coats chicken, 5 to 10 minutes. Remove from heat and stir in sesame oil. Serve sprinkled with scallion."
    ],
    "ingredients": [
        "3 tablespoons coarsely crushed yellow rock sugar (sometimes labeled \"yellow rock candy\")",
        "3 tablespoons Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "2 tablespoons dark mushroom soy sauce",
        "1/2 tablespoon oyster sauce",
        "2 cups water",
        "2 1/4 pounds whole chicken legs (including thighs; about 2 large)",
        "2 tablespoons vegetable oil",
        "1 (1-inch) piece fresh ginger, peeled and cut crosswise into 1/8-inch-thick slices",
        "1 large garlic clove, smashed",
        "16 frozen shelled and blanched chestnuts (3 ounces), thawed",
        "1 teaspoon Asian sesame oil",
        "2 tablespoons chopped scallion"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Chicken",
        "Ginger",
        "Stir-Fry",
        "Dinner",
        "Lunar New Year",
        "Chestnut",
        "Sesame",
        "Soy Sauce",
        "Gourmet",
        "Dairy Free",
        "Peanut Free"
    ],
    "title": "Chicken with Chestnuts",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-chestnuts-108668"
}
