{
    "directions": [
        "Place a large piece of plastic wrap on a clean surface. Place a piece of the steak on the plastic wrap and top with a second piece of plastic wrap. Using the textured side of a meat mallet, tenderize the steak until it is very thin. Flip and repeat on the other side. Repeat with the remaining pieces of meat. Season generously with salt and pepper. Set aside.",
        "Place 4 cups of the flour in a large bowl or shallow dish. Combine the eggs and 1/4 cup of the milk in a separate bowl. Heat the oil in a large skillet over medium heat. Flick some flour into the oil; when it sizzles the oil is hot enough. Dredge the steak in the flour, coating both sides and shaking off excess. Dip in the milk and then again in the flour. Fry the steak, a few pieces at a time, until the edges turn golden brown, 3 to 4 minutes per side. Transfer to a paper towel-lined plate.",
        "Pour the cooking grease into a heatproof bowl or measuring cup. Without cleaning the skillet, return it to the stove over medium-low heat. Add 1/4 cup of the drippings to the skillet, scraping up all the brown bits on the bottom of the pan with a wooden spoon. When the oil is hot, whisk in the remaining 1/4 cup flour until the flour begins to brown, about 2 minutes. Slowly add the remaining 2 cups milk, whisking constantly until the gravy begins to thicken, 5 to 7 minutes. Season with salt and pepper. Transfer the fried steak to a serving plate and drizzle with the gravy."
    ],
    "ingredients": [
        "3 pounds round steak, thinly sliced into 3-inch pieces",
        "Salt and ground black pepper",
        "4 1/4 cups all-purpose flour",
        "5 large eggs, lightly beaten",
        "2 1/4 cups whole milk",
        "3 cups vegetable oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Gravy",
        "Steak",
        "Egg Recipes",
        "Dairy Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Chicken Fried Steak and Gravy",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/chicken-fried-steak-and-gravy"
}
