{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Place the biscuits 1 to 2 inches apart on an ungreased baking sheet.",
        "Bake in the preheated oven until the biscuits are golden brown, 13 to 17 minutes. Remove biscuits to cool, and set aside. Cut meat from the rotisserie chicken into bite-size pieces, and set aside.",
        "Heat the olive oil in a skillet over medium heat. Stir in the onion, carrots, mushrooms, salt, and black pepper. Cook and stir until the onion has softened, the carrots are tender, and the mushrooms have released their liquid, about 7 minutes. Stir in the red bell pepper and cook for 2 more minutes. Remove from heat and set aside.",
        "Melt the butter in a saucepan over medium heat. Whisk in the flour to form a thick paste. Continue cooking, whisking constantly, until the flour has lost its raw smell, about 5 minutes. Whisk in the white wine, increase the heat to medium-high, and simmer for 1 minute. Whisk in the chicken broth and whipping cream and bring the sauce to a boil. Reduce the heat, stir in the shredded chicken, and simmer for 7 minutes.",
        "Pour the chicken mixture into the skillet containing the vegetables and adjust the heat to medium. Add the asparagus and cook until the asparagus pieces are tender, about 4 minutes. Stir in the peas and tarragon and mix well.",
        "Place a split biscuit on each plate and pour the chicken mixture over the biscuits."
    ],
    "ingredients": [
        "1 (10 ounce) can large refrigerated flaky biscuits",
        "1 (3 pound) rotisserie-roasted chicken",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1 cup shredded carrots",
        "1 cup fresh mushrooms",
        "salt and ground black pepper to taste",
        "1/2 red bell pepper, sliced into thin strips",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "1/2 cup white wine",
        "4 cups chicken broth",
        "1 cup heavy whipping cream",
        "1/2 pound fresh asparagus, trimmed and cut into 1 inch pieces",
        "1 cup frozen petite peas, thawed",
        "1 tablespoon chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken a la Queen",
    "url": "http://allrecipes.com/recipe/216876/chicken-a-la-queen/"
}
