{
    "directions": [
        "On a plate, stir together the flour, the 1 tsp. salt and the 1/2 tsp. pepper. One at a time, turn the chicken breasts in the flour mixture, gently shaking off the excess.",
        "In a large fry pan over medium-high heat, melt 1 1/2 Tbs. of the butter with 1 1/2 Tbs. of the olive oil. Working in batches if necessary, add the chicken breasts and cook, turning once, until golden on both sides, about 5 minutes total. Transfer to a plate.",
        "Add the shallots and pancetta to the pan and sauté over medium-high heat until lightly browned, 2 to 3 minutes. Add 2 cups of the Marsala, increase the heat to high and cook, stirring, until the wine is reduced and thickened, 7 to 10 minutes. Add the broth and oregano and return to a boil.",
        "Stovetop method: Transfer the chicken to a large Dutch oven and add the Marsala mixture. Cover the pot, set over low heat and cook until the chicken is opaque throughout and very tender, about 30 minutes. Meanwhile, in a large fry pan over high heat, melt the remaining 1 1/2 Tbs. butter with the remaining 1 1/2 Tbs. olive oil. Add the mushrooms and sauté until the edges begin to brown, about 5 minutes. Stir in the mascarpone, bring to a boil, and season generously with salt and pepper. Add the mushroom mixture and the remaining 1/4 cup Marsala to the Dutch oven. Cover and continue cooking until the chicken is cooked through and the sauce has thickened, about 30 minutes more.",
        "Slow-cooker method: Transfer the chicken to a slow cooker and add the Marsala mixture. Cover and cook according to the manufacturer's instructions until the chicken is opaque throughout and very tender, about 2 1/2 hours on high or 5 hours on low. About 30 minutes before the chicken is done, in a large fry pan over high heat, melt the remaining 1 1/2 Tbs. butter with the remaining 1 1/2 Tbs. olive oil. Add the mushrooms and sauté until the edges begin to brown, about 5 minutes. Stir in the mascarpone, bring to a boil, and season generously with salt and pepper. Add the mushroom mixture and the remaining 1/4 cup Marsala to the slow cooker. Cover and continue cooking until the chicken is cooked through and the sauce has thickened, about 20 minutes more.",
        "Spoon the mushrooms and sauce over the chicken, garnish with the chives and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Essentials of Slow Cooking,",
        "by Melanie Barnard, Charles Pierce & Dennis Kelly (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "3 Tbs. all-purpose flour",
        "1 tsp. salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to taste",
        "6 boneless, skinless chicken breast halves, each about 6 oz.",
        "3 Tbs. unsalted butter",
        "3 Tbs. olive oil",
        "4 shallots, minced",
        "1/4 lb. pancetta, diced",
        "2 1/4 cups Marsala",
        "1 cup chicken broth",
        "2 tsp. dried oregano",
        "1/2 lb. cremini or button mushrooms, brushed clean, stems removed and caps cut into slices 1/4 inch thick",
        "1/2 cup mascarpone",
        "3 Tbs. finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chicken Marsala",
    "url": "http://www.williams-sonoma.com/recipe/chicken-marsala.html"
}
