{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Cook manicotti in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 to 10 minutes. Drain.",
        "Place chicken and bay leaf into a saucepan and pour in enough water to cover; bring to a boil, cover saucepan, reduce heat to medium, and simmer until chicken is no longer pink in the center, about 20 minutes. Remove chicken from saucepan and place on a work surface to cool. Discard cooking water, skin, and bones. Finely chop chicken.",
        "Heat 1 tablespoon butter in a saucepan over medium heat; cook and stir mushrooms, 1/3 cup chopped onion, salt, basil, thyme, and paprika until mushrooms are tender, 5 to 10 minutes. Remove saucepan from heat and cool.",
        "Mix mushroom mixture, eggs, Parmesan cheese, and chicken together in a bowl.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x7-inch baking dish.",
        "Heat 2 tablespoons butter in a saucepan over medium heat; cook and stir 1/4 cup chopped onion until tender, 5 to 10 minutes. Stir flour into onion until dissolved; add milk. Cook and stir mixture until sauce is bubbling and thickened, about 5 minutes. Stir wine into sauce; add mozzarella cheese and stir until cheese is melted.",
        "Stuff the cooked manicotti with chicken mixture and arrange filled pasta in the prepared baking dish. Pour cheese sauce over pasta. Cover dish with aluminum foil.",
        "Bake in the preheated oven until cooked through, 25 to 30 minutes."
    ],
    "ingredients": [
        "1 (8 ounce) package manicotti shells",
        "2 bone-in chicken breast halves",
        "1 bay leaf",
        "water to cover",
        "1 tablespoon butter",
        "1/2 cup chopped fresh mushrooms",
        "1/3 cup finely chopped onion",
        "1/2 teaspoon salt",
        "1/4 teaspoon crushed dried basil",
        "1/4 teaspoon crushed dried thyme",
        "1/8 teaspoon paprika",
        "2 eggs, beaten",
        "1/2 cup grated Parmesan cheese",
        "Sauce:",
        "2 tablespoons butter",
        "1/4 cup chopped onion",
        "2 cups milk",
        "3 tablespoons all-purpose flour",
        "1/4 cup dry white wine",
        "1 cup shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken and Mushroom Manicotti",
    "url": "http://allrecipes.com/recipe/240765/chicken-and-mushroom-manicotti/"
}
