{
    "directions": [
        "Place spinach in large bowl; mix in chicken, 1 egg and next 10 ingredients.",
        "Beat remaining egg in small bowl. Place 1 egg roll wrapper on work surface; cut in half diagonally. Brush edges with beaten egg. Spoon heaping 1 tablespoon chicken filling into center of each half. Fold egg roll wrappers over filling, forming small triangles. Press edges together to seal. Repeat with remaining egg roll wrappers and filling. (Potstickers can be prepared ahead. Arrange in single layer on foil-lined baking sheet; cover with plastic wrap. Refrigerate up to 6 hours or freeze up to 3 days. If frozen, thaw potstickers before continuing with recipe.)",
        "Whisk plum sauce, 3/4 cup water and Sherry in small bowl to blend. Set aside.",
        "Heat 3 tablespoons vegetable oil in large nonstick skillet over medium heat. Working in batches, fry 4 potstickers at a time until brown on both sides, about 1 1/2 minutes per side. Transfer to paper-towel-lined plate to drain. Repeat with remaining potstickers in 5 more batches, adding 3 tablespoons vegetable oil (or more if necessary) per batch.",
        "Heat 5 tablespoons reserved plum-sauce mixture in another large skillet over medium heat. Add 4 potstickers and cook until chicken filling is cooked through, turning once, about 3 minutes. Transfer to platter. Repeat with remaining plum-sauce mixture and potstickers in 5 more batches. Serve potstickers immediately with Mint-Chili Sauce."
    ],
    "ingredients": [
        "1 10-ounce package frozen chopped spinach, thawed, squeezed dry",
        "3/4 pound ground chicken",
        "2 large eggs",
        "1 cup chopped green onions",
        "1/3 cup chopped cilantro",
        "1 1/2 tablespoons finely chopped peeled fresh ginger",
        "2 garlic cloves, minced",
        "1 tablespoon soy sauce",
        "2 teaspoons chili-garlic sauce*",
        "1 1/2 teaspoons oriental sesame oil",
        "1 teaspoon grated lemon peel",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "12 egg roll wrappers",
        "1 cup Chinese plum sauce",
        "3/4 cup water",
        "2 tablespoons dry Sherry",
        "18 tablespoons (about) vegetable oil",
        "Mint-Chili Sauce",
        "*Chili-garlic sauce is available at Asian markets and in the Asian foods section of many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Appetizer",
        "Cilantro"
    ],
    "title": "Chicken and Herb Potstickers with Mint-Chili Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-herb-potstickers-with-mint-chili-sauce-101967"
}
