{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Spread 1/4 cup almonds on a baking sheet and toast in oven until golden, 8 to 10 minutes.",
        "Meanwhile, finely grind remaining 1/2 cup almonds in a food processor about 1 minute (don't grind to a paste).",
        "Pat chicken dry and sprinkle with 1/2 teaspoon salt.",
        "Heat a dry 12-inch heavy skillet over moderate heat, then toast ground almonds, cinnamon stick, oregano, and bay leaves, stirring constantly, until almonds are pale golden, about 2 minutes. Transfer to a bowl and wipe skillet clean.",
        "Heat oil in skillet over high heat until hot but not smoking, then sauté chicken, turning over once, until golden, about 5 minutes total. Transfer chicken to a plate.",
        "Add bacon to skillet and cook over moderate heat, stirring, until bacon begins to render fat and turn golden, about 1 minute. Add onion and garlic and cook, stirring occasionally, until golden, about 3 minutes. Stir in ground- almond mixture and chicken broth and boil, scraping up brown bits, 1 minute. Stir in pepper and remaining 1/2 teaspoon salt. Add chicken, turning to coat, then reduce heat to moderate and simmer, covered, until chicken is just cooked through, about 5 minutes. Stir in parsley and sliced almonds. Discard cinnamon stick and bay leaves. Serve chicken with sauce spooned on top."
    ],
    "ingredients": [
        "3/4 cup sliced almonds",
        "6 skinless boneless chicken breast halves (2 lb total)",
        "1 teaspoon salt",
        "1 (3-inch) cinnamon stick",
        "1 teaspoon dried oregano (preferably Mexican), crumbled",
        "2 Turkish bay leaves or 1 California",
        "2 tablespoons vegetable oil",
        "3 bacon slices, chopped",
        "1 cup chopped onion (1 medium)",
        "1 tablespoon chopped garlic (2 to 3 cloves)",
        "1 cup low-sodium chicken broth or water",
        "1/2 teaspoon black pepper",
        "1 tablespoon chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Nut",
        "Poultry",
        "Bake",
        "Sauté",
        "Quick & Easy",
        "Bacon",
        "Almond",
        "Spring",
        "Cinnamon",
        "Potluck",
        "Simmer",
        "Gourmet"
    ],
    "title": "Chicken in Almond Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-almond-sauce-109208"
}
