{
    "directions": [
        "In a large, heavy saucepan over medium-high heat, warm the olive oil. Add the onion, chilies, ginger and cumin seeds and sauté until the onion is tender, about 6 minutes. Add the chickpeas with their liquid, tomatoes with their juices, lime juice, 1/2 tsp. of the garam masala and the turmeric. Bring to a boil, then reduce the heat and simmer for 5 minutes to blend the flavors.",
        "Add the cauliflower, potatoes and the 1 cup water and simmer, stirring occasionally, until the potatoes are tender, about 15 minutes, adding more water if the mixture becomes dry. Stir in the remaining 1/4 tsp. garam masala. Season with salt and pepper.",
        "Divide the rice among 4 warmed shallow bowls. Spoon the curry over the top, sprinkle with the cilantro and serve immediately. Serves 4.",
        "Quick Tips:",
        "Garam masala, an aromatic Indian spice blend, can be found in the spice section of most supermarkets. It’s a terrific seasoning to have on hand in the cupboard to add flavor to chicken, fish, potatoes and sweet potatoes. This stew reheats well, so it can be served again a night or two later. Canned chickpeas are a versatile staple; they are great in salads, stews and soups.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "1 Tbs. olive oil",
        "1 large yellow onion, finely chopped",
        "2 serrano chilies, chopped",
        "1 piece fresh ginger, about 6 inches long and 1 inch in diameter, peeled and minced",
        "1 tsp. cumin seeds",
        "2 cans (each 15 oz.) chickpeas, with liquid",
        "1 can (14.5 oz.) diced tomatoes, with juices",
        "1 Tbs. fresh lime juice",
        "3/4 tsp. garam masala",
        "Rounded 1/4 tsp. ground turmeric",
        "1/2 head large cauliflower, cut into 1-inch florets",
        "2 Yukon Gold potatoes, cut into 1/2-inch pieces",
        "1 cup water, plus more as needed",
        "Coarse kosher salt and freshly ground pepper, to taste",
        "Cooked rice for serving (optional)",
        "1/3 cup minced fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chickpea, Cauliflower and Potato Curry",
    "url": "http://www.williams-sonoma.com/recipe/chickpea-cauliflower-and-potato-curry.html"
}
