{
    "directions": [
        "Combine broth, chicken pieces, neck, gizzard and heart in large pot. Bring to boil. Reduce heat; cover partially and simmer until chicken is cooked through, about 20 minutes. Using tongs, remove chicken pieces and giblets from broth. Cool slightly. Remove skin from breasts and leg-thigh pieces. Cut enough chicken meat to measure 1 cup. Reserve remaining cooked chicken for another use. Strain broth into large bowl. Chill broth until fat solidifies on surface, about 6 hours. (Broth can be made 2 days ahead. Keep chilled.) Scrape fat from surface of broth and discard.",
        "Melt butter in heavy large pot over medium-low heat. Add onions, carrots, celery, garlic, and thyme. Cover; cook until vegetables soften, stirring occasionally, about 10 minutes. Add broth and bring to boil. Reduce heat; simmer until vegetables are almost tender, about 15 minutes. Add saffron. (Can be made 1 day ahead. Cover; chill. Bring to boil before continuing.) Add noodles; simmer 5 minutes. Add 1 cup chicken and corn; simmer until noodles are tender, about 5 minutes. Add parsley and celery. Season with salt and pepper."
    ],
    "ingredients": [
        "9 cups canned low-salt chicken broth",
        "1 3-pound cut-up chicken; neck, gizzard and heart reserved",
        "3 tablespoons butter",
        "2 cups chopped onions",
        "1 cup diced peeled carrots",
        "3/4 cup diced celery",
        "2 large garlic cloves, minced",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon crumbled saffron threads",
        "2 ounces dried wide egg noodles",
        "1 cup frozen corn kernels",
        "2 tablespoons minced fresh parsley",
        "2 tablespoons minced celery leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Garlic",
        "Herb",
        "Onion",
        "Poultry",
        "Vegetable",
        "Thanksgiving",
        "Spice",
        "Saffron",
        "Celery",
        "Corn",
        "Carrot",
        "Fall",
        "Noodle"
    ],
    "title": "Chicken, Corn, and Noodle Soup with Saffron",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-corn-and-noodle-soup-with-saffron-2762"
}
