{
    "directions": [
        "Sauté sausage in heavy large pot over medium heat until brown, about 4 minutes. Transfer to large bowl. Sprinkle chicken with salt and pepper. Add chicken to pot and cook until browned, about 3 minutes per side. Transfer chicken to bowl with sausage. Pour off all but 1 tablespoon pan drippings.",
        "Add onions and bell peppers to pot; sauté until golden brown, about 15 minutes. Add garlic, oregano, thyme and paprika; sauté 2 minutes. Return sausage, chicken and any accumulated juices to pot. Add tomatoes with juices, chicken broth and wine. Bring to boil. Reduce heat; cover and simmer until chicken is cooked through, about 25 minutes.",
        "Uncover pot. Add olives and simmer until chicken is very tender and liquid is reduced to thin sauce consistency, about 40 minutes. Add shrimp and simmer just until cooked through, about 5 minutes longer. Season to taste with salt and pepper. (Stew can be prepared 1 day ahead. Refrigerate until cold, then cover tightly and refrigerate. Before serving, rewarm over medium-low heat.)"
    ],
    "ingredients": [
        "1 pound andouille sausage,* cut into rounds",
        "6 large chicken thighs (about 2 1/4 pounds)",
        "3 cups chopped onions",
        "2 1/3 cups chopped green bell peppers",
        "1 1/4 cups chopped red bell pepper",
        "6 large garlic cloves, chopped",
        "3 tablespoons chopped fresh oregano",
        "2 tablespoons chopped fresh thyme",
        "1 tablespoon paprika",
        "1 28-ounce can diced tomatoes with juices",
        "1 14 1/2-ounce can low-salt chicken broth",
        "1 cup dry white wine",
        "3/4 cup sliced pimiento-stuffed green olives",
        "1 pound uncooked large shrimp, peeled, deveined",
        "*A smoked pork and beef sausage, available at specialty foods stores. Hot links, smoked bratwurst, kielbasa or smoked Hungarian sausage can be substituted."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Olive",
        "Onion",
        "Tomato",
        "Stew",
        "Sausage",
        "Shrimp",
        "Bell Pepper",
        "White Wine",
        "Winter"
    ],
    "title": "Chicken, Shrimp and Sausage Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-shrimp-and-sausage-stew-3079"
}
