{
    "directions": [
        "Lay chiles on their sides on racks of gas burners, then turn flames on moderately high. Roast chiles, turning with tongs, until skins are blistered, 4 to 6 minutes. (Or broil chiles on rack of a broiler pan about 2 inches from heat, turning them, 8 to 10 minutes.) Transfer chiles immediately to a large sealable plastic bag and seal. Let steam 10 minutes, then peel or rub off skins and discard stems, seeds, and ribs. Rinse chiles and pat dry, then cut into 1/4-inch-thick strips.",
        "Pat chicken dry and season with salt and pepper. Heat 1/2 tablespoon oil in a heavy skillet over moderately high heat until hot but not smoking, then sauté chicken, skin or skinned sides down, until golden, 4 to 5 minutes. Turn chicken over and sauté 2 minutes more. Reduce heat to moderately low, then pour off excess fat and cook chicken, covered, until just cooked through, 10 to 15 minutes.",
        "While chicken is cooking, heat remaining tablespoon oil in a 10-inch nonstick skillet over moderate heat, then cook onion, stirring, until softened, 5 to 7 minutes. Add chiles and salt to taste and cook, stirring, 5 minutes. Add crème fraîche and cook, stirring, until just heated through (if using sour cream, do not let boil). Season sauce with salt and pepper.",
        "Drizzle chicken with any pan juices and serve with sauce."
    ],
    "ingredients": [
        "1/2 pound fresh poblano chiles (2 to 3)",
        "2 boneless chicken breast halves (1 1/2 pounds total), with or without skin",
        "1 1/2 tablespoons olive oil",
        "1 medium white onion, halved lengthwise, then sliced lengthwise 1/4 inch thick",
        "1/4 cup crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dairy",
        "Pepper",
        "Poultry",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Summer",
        "Gourmet"
    ],
    "title": "Chicken Breasts with Poblano Chile Strips and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-with-poblano-chile-strips-and-cream-106892"
}
