{
    "directions": [
        "In a small bowl, soak the saffron in the warm water for 10 minutes.",
        "In a food processor, combine the onions, the 1/2 cup cilantro, 1/2 cup parsley and 2 Tbs. of the lemon juice. Add the cumin, ginger, turmeric, the saffron and its soaking liquid and the salt. Process to a pulpy puree. Transfer to a large resealable plastic bag. Add the garlic and 3 Tbs. of the olive oil. Add the chicken thighs, seal the bag and massage to coat the chicken with the mixture. Refrigerate for at least 8 hours or up to 24 hours.",
        "Put the olives in a large, heavy fry pan and add water to cover. Set over medium-high heat and bring to a simmer, then simmer for 5 minutes. Drain the olives and set aside. Thoroughly dry the pan.",
        "In the same pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the lemon slices and sear until browned, 3 to 5 minutes. Transfer to a plate. Add the remaining 2 Tbs. olive oil to the pan. Remove the chicken from the marinade, shaking off the excess and reserving the marinade. Working in batches, sear the chicken, skin side down, until golden brown, 5 to 6 minutes. Transfer to another plate.",
        "Pour the broth into the pan, stirring to scrape up the browned bits from the pan bottom. Stir in the reserved marinade and add the chicken and any juices. Bring to a boil, then cover and reduce the heat to medium-low. Simmer until the chicken is opaque throughout, about 40 minutes.",
        "Add the olives, the reserved lemon slices and the remaining 2 Tbs. lemon juice to the pan with the chicken. Cover and simmer until the chicken is falling-off-the-bone tender, 10 to 15 minutes.",
        "Garnish the stew with chopped cilantro and parsley and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "1/4 tsp. saffron threads",
        "2 Tbs. warm water",
        "2 large yellow onions, chopped",
        "1/2 cup (3/4 oz./20 g) coarsely chopped fresh cilantro, plus\n  more for garnish",
        "1/2 cup (3/4 oz./20 g) coarsely chopped fresh flat-leaf parsley,\n  plus more for garnish",
        "4 Tbs. (2 fl. oz./60 ml) fresh lemon juice",
        "1 tsp. ground cumin",
        "1/2 tsp. ground ginger",
        "1/2 tsp. ground turmeric",
        "1 tsp. salt",
        "2 large garlic cloves, crushed",
        "6 Tbs. olive oil",
        "6 bone-in, skin-on chicken thighs",
        "1 1/2 cups (8 oz./250 g) cracked green olives",
        "2 preserved lemons, thinly sliced",
        "1/2 cup (4 fl. oz./125 ml) chicken broth"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chicken Tagine with Preserved Lemons and Olives",
    "url": "http://www.williams-sonoma.com/recipe/chicken-tagine-lemons-and-olives.html"
}
