{
    "directions": [
        "Using a sharp knife, cut all peel and white pith from lemons; discard. Working over a medium bowl, cut between membranes to release segments into bowl; squeeze in juice from membranes and discard membranes. Strain juice into another bowl.",
        "Combine segments, 1 tablespoon strained lemon juice (reserve remaining juice for another use), cucumber, 2 tablespoons scallions, and chile in a small bowl; mix well. Stir in sugar; season salsa with salt and set aside.",
        "Place chicken in a medium bowl and season with salt and pepper. In a mini-processor or blender, purée 1/4 cup cilantro, yogurt, vegetable oil, garlic, coriander, and turmeric. Pour marinade over chicken; toss to coat. Let marinate at room temperature for 20 minutes. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature for 30 minutes before continuing.",
        "Preheat broiler. Thread 4 pieces of chicken onto each skewer and transfer to a foil-lined baking sheet. Broil, turning once and watching closely to prevent burning, until browned and cooked through, about 8 minutes. (Alternatively, grill skewers over medium-high heat on a gas grill or over medium heat on a charcoal grill.) Transfer skewers to plates. Spoon Meyer lemon salsa over chicken. Garnish with remaining 2 tablespoons cilantro and 1 tablespoon scallions."
    ],
    "ingredients": [
        "8 Meyer lemons",
        "1/2 cup finely chopped English hothouse cucumber",
        "3 tablespoons thinly sliced scallions, divided",
        "1 serrano chile (with seeds), finely chopped",
        "Pinch of sugar",
        "1 Kosher salt",
        "1 1/2 pounds skinless, boneless chicken thighs, cut into 1 1/2\" pieces",
        "1 Freshly ground black pepper",
        "1/4 cup plus 2 tablespoons chopped fresh cilantro",
        "1/4 cup plain whole-milk yogurt",
        "1 tablespoon vegetable oil",
        "2 garlic cloves, coarsely chopped",
        "1 teaspoon cracked coriander seeds",
        "1 teaspoon turmeric (optional)",
        "Special equipment: 12 metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Fruit",
        "Poultry",
        "Broil",
        "Low Fat",
        "Low Sodium",
        "Dinner",
        "Lunch",
        "Lemon",
        "Cucumber",
        "Winter",
        "Healthy",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Skewers with Meyer Lemon Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-skewers-with-meyer-lemon-salsa-380587"
}
