{
    "directions": [
        "Put oven rack in middle position and preheat oven to 500°F.",
        "Heat oil in a 12-inch heavy skillet over moderate heat until hot but not smoking. While oil is heating, sprinkle chicken with 1 teaspoon salt and 1/2 teaspoon pepper, then dredge, 1 piece at a time, in 3/4 cup flour (total), knocking off excess. Brown in 4 batches, turning over occasionally, until golden, 5 to 6 minutes per batch. Transfer to a platter as browned.",
        "Stir together carrots, onions, garlic, cream, wine, lemon juice, mustard, thyme, bay leaf, and remaining teaspoon salt and 1/2 teaspoon pepper in a 5- to 6-quart heavy pot, then bring to a gentle boil over moderate heat, stirring occasionally. Add chicken (chicken will not be completely submerged) and partially cover pot, then braise in oven 25 minutes.",
        "Reduce oven temperature to 350°F and braise 20 minutes more. Transfer chicken to a clean platter and keep warm, loosely covered with foil.",
        "Pour cooking liquid through a sieve into a bowl, discarding solids, then stir in water. Melt butter in a 2 1/2- to 3-quart heavy saucepan over moderately low heat, then whisk in remaining 2 tablespoons flour and cook roux, whisking constantly, 3 minutes. Add cooking liquid in a fast stream, whisking vigorously, then cook at a bare simmer, whisking constantly, 5 minutes.",
        "Serve chicken with sauce."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "1 (3 1/2- to 4-lb) free-range chicken, cut into 8 serving pieces",
        "2 teaspoons salt",
        "1 teaspoon black pepper",
        "3/4 cup plus 2 tablespoons all-purpose flour",
        "3 carrots, chopped",
        "2 onions, chopped",
        "5 garlic cloves, chopped",
        "2 cups heavy cream",
        "1 1/4 cups dry white wine",
        "1/4 cup fresh lemon juice",
        "1/4 cup Dijon mustard",
        "1 teaspoon fresh thyme leaves",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 cup water",
        "3 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Mustard",
        "Poultry",
        "Braise",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Lemon",
        "White Wine",
        "Winter",
        "Simmer",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Fricassée with Lemon Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fricassee-with-lemon-mustard-sauce-109106"
}
