{
    "directions": [
        "To Make Sauce: Melt butter in a small saucepan over medium heat. Blend in salt, pepper and flour, then stir in the milk and Romano cheese. Simmer, stirring constantly, until thickened. Remove from heat, cover and set aside.",
        "To Make the Garlic Butter: Melt the butter in a small saucepan over medium heat. Blend in the garlic, rosemary, and salt. Cook, stirring constantly, until garlic is tender but not browned. Remove from heat, cover and set aside.",
        "To Make the Dough: Pour the warm water into a small bowl and stir in the yeast until dissolved. Allow to rest until yeast foams, about 5 minutes. Mix the vegetable oil, sugar, salt, rosemary, and garlic powder together in a mixing bowl. Stir in the yeast mixture, and gradually stir in the flour. Gather into a loose ball and knead until a smooth ball forms. Cover, and let rest 1/2 hour.",
        "Preheat oven to 400 degrees F (200 degrees C). Season the roasted chicken with rosemary, thyme, poultry seasoning, garlic powder and salt. Chop or shred and reserve.",
        "To Assemble the Pizza: Spread dough out on prepared pizza stone. Top with cooled garlic butter, covering entire crust. Next spread with Alfredo Sauce (if necessary, warm to spreading consistency), leaving crust edges. Top with chicken, turning to coat with sauce.",
        "Bake in preheated oven for 20 minutes, or until bottom crust is lightly browned. Remove from oven and let set for 2 to 3 minutes before cutting."
    ],
    "ingredients": [
        "SAUCE",
        "4 tablespoons butter",
        "1/4 teaspoon salt",
        "1 dash ground black pepper",
        "4 tablespoons all-purpose flour",
        "1 cup milk",
        "3/4 cup grated Romano cheese",
        "GARLIC BUTTER",
        "2 tablespoons butter",
        "1 clove garlic, minced",
        "1 pinch dried rosemary",
        "1 pinch salt",
        "DOUGH",
        "1 cup warm water",
        "1 (.25 ounce) package instant yeast",
        "2 tablespoons vegetable oil",
        "1 tablespoon white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon dried rosemary",
        "1/4 teaspoon garlic powder",
        "3 cups all-purpose flour",
        "2 boneless chicken breast halves, roasted",
        "1/4 teaspoon dried rosemary",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon poultry seasoning",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Alfredo Pizza",
    "url": "http://allrecipes.com/recipe/25189/chicken-alfredo-pizza/"
}
