{
    "directions": [
        "Place chicken thighs, skin side down, on work surface. Using sharp knife, cut each thigh lengthwise along each side of bone, forming 2 pieces of meat (some meat may remain on bones); reserve bones.",
        "Heat oil in heavy large pot over medium-high heat. Sprinkle chicken and bones with salt and pepper. Working in batches, sauté in pot until brown, about 6 minutes per batch. Transfer to bowl. Add sausage to pot and sauté until brown, about 5 minutes. Using slotted spoon, transfer to bowl with chicken. Add carrots and onions to pot and sauté until onions are tender and golden, about 10 minutes. Stir in 1/4 cup marjoram, garlic, lemon peel, and crushed red pepper; sauté 2 minutes. Add wine and boil until reduced by half, about 3 minutes. Stir in tomatoes with juices and broth; bring to boil. Add chicken, bones, sausage, and any accumulated juices from bowl. Reduce heat, cover, and simmer until chicken is cooked through, about 35 minutes.",
        "Using slotted spoon, transfer chicken and sausage to bowl; discard bones. Boil liquid in pot until reduced to 3 cups, about 20 minutes. Stir in remaining 1/4 cup marjoram. Season to taste with salt and pepper. Return chicken and sausage to pot. (Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated. Rewarm over medium heat before serving.) Spoon ragù over Campanelle Pasta with Parsley Butter."
    ],
    "ingredients": [
        "9 chicken thighs with skin and bones (about 4 pounds), well trimmed",
        "2 tablespoons olive oil",
        "1 pound chicken andouille sausage or other fully cooked spicy smoked sausage, cut into 1/2-inch-thick rounds",
        "3 medium carrots, peeled, diced",
        "2 large onions, chopped",
        "1/2 cup chopped fresh marjoram (from about 2 large bunches)",
        "6 garlic cloves, minced",
        "1 teaspoon grated lemon peel",
        "1/4 teaspoon dried crushed red pepper",
        "1 cup dry white wine",
        "2 14 1/2-ounce cans diced tomatoes in juice",
        "2 cups low-salt chicken broth",
        "Campanelle Pasta with Parsley Butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Chicken",
        "Pork",
        "Poultry",
        "Sauté",
        "Stew",
        "Sausage",
        "White Wine",
        "Winter",
        "Simmer"
    ],
    "title": "Chicken and Andouille Sausage Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-andouille-sausage-ragu-107676"
}
