{
    "directions": [
        "In a mixing bowl, toss together the chicken, celery, scallions and herbs. Set aside.",
        "In a small bowl, whisk together the mayonnaise, lemon juice, mustard, salt and pepper to taste. Add to the chicken and mix gently until combined. Refrigerate until ready to serve.",
        "Put the parsley, thyme, onion, carrot, celery, and chicken breasts in a medium saucepan. Cover with the broth, and bring just to a boil. Lower the heat to very low and cover. Poach the chicken for 20 minutes or until firm to the touch. Remove the pan from the heat, uncover, cool the chicken in the liquid for 30 minutes.",
        "Transfer the chicken to a cutting board and reserve the liquid. Bone and skin the chicken and cut the meat into 1 inch cubes. Discard the bones and skin.",
        "Strain the broth and store, covered, in the refrigerator for 3 days or freeze for later use. Remove any fat from the surface of the broth before using."
    ],
    "ingredients": [
        "4 cups diced poached chicken, recipe follows",
        "1 stalk celery, cut into 1/4-inch dice",
        "4 scallions, trimmed and thinly sliced or 1/4 cup sweet onion cut into 1/4-inch dice",
        "1 1/2 teaspoons finely chopped fresh tarragon or fresh dill",
        "2 tablespoons finely chopped parsley",
        "1 cup prepared or homemade mayonnaise",
        "2 teaspoons strained freshly squeezed lemon juice",
        "1 teaspoon Dijon mustard",
        "2 teaspoons kosher salt",
        "Freshly ground black pepper",
        "10 sprigs parsley",
        "2 sprigs fresh thyme",
        "1 small onion, halved",
        "1 small carrot, halved",
        "1 stalk celery, halved",
        "3 pounds chicken breasts halves, on the bone and fat trimmed",
        "5 to 6 cups chicken broth, homemade or low-sodium canned"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "American",
        "Chicken Salad",
        "Holiday",
        "Memorial Day Recipes",
        "Outdoor Party",
        "Recipes for Parties"
    ],
    "title": "Chicken Salad",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-salad-recipe"
}
