{
    "directions": [
        "Place the chicken cutlets flat on the work surface. Sprinkle the chicken with salt and pepper. Lay 1 slice of prosciutto atop each chicken cutlet.",
        "Squeeze the frozen spinach to remove the excess water. Season the spinach with salt and pepper. In a small bowl, toss the spinach with 1 tablespoon of oil to coat.",
        "Arrange an even, thin layer of spinach atop the prosciutto slices. Sprinkle the Parmesan evenly over each. Beginning at the short tapered end, roll up each chicken cutlet as for a jellyroll. Secure with a toothpick.",
        "Heat the remaining 2 tablespoons of oil in a heavy large skillet over high heat. Add the chicken and cook just until golden brown, about 2 minutes per side. Add the chicken broth and lemon juice, and scrape the browned bits off the bottom of the pan with a wooden spoon. Bring the liquid to a boil. Reduce the heat to medium. Cover and simmer until the chicken is just cooked through, about 8 to 10 minutes. Transfer the chicken to a platter. Simmer the cooking liquid over high heat until it is reduced to about 2/3 cup, about 5 minutes. Season the cooking liquid with salt and pepper, to taste. Remove toothpicks from the chicken. Drizzle the reduced cooking liquid over the chicken and serve immediately."
    ],
    "ingredients": [
        "6 (3-ounce) chicken cutlets, pounded to evenly flatten",
        "Salt and freshly ground black pepper",
        "6 paper-thin slices prosciutto",
        "1 (10-ounce) box frozen chopped spinach, thawed",
        "3 tablespoons olive oil",
        "1/4 cup grated Parmesan",
        "1 (14-ounce) can low-salt chicken broth",
        "2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Italian",
        "European Recipes",
        "Meat",
        "Cheese",
        "Vegetable",
        "Spinach",
        "Poultry Recipes",
        "Chicken",
        "Main Dish Recipes",
        "Low-Fat",
        "Gluten Free",
        "Low-Cholesterol",
        "Diabetes-Friendly",
        "Low Calorie",
        "Heart-Healthy"
    ],
    "title": "Chicken Saltimbocca",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/chicken-saltimbocca-recipe"
}
