{
    "directions": [
        "Preheat oven to 350F with rack in middle.",
        "Pat chicken dry and sprinkle with 1 teaspoon salt and a rounded 3/4 teaspoon pepper. Heat oil with 1 tablespoon butter in a wide 3 1/2- to 5-quart heavy ovenproof pot over medium-high heat until foam subsides, then brown chicken in 2 batches, turning once, about 10 minutes total per batch. Transfer to a plate.",
        "Meanwhile, wash leeks and pat dry.",
        "Pour off fat from pot, then cook leeks, shallot, and 1/4 teaspoon salt in remaining 2 tablespoons butter, covered, over medium-low heat, stirring occasionally, until leeks are pale golden, 5 to 7 minutes. Add chicken, skin sides up, with any juices from plate, carrots, and wine and boil until liquid is reduced by half, 3 to 4 minutes. Cover pot and braise chicken in oven until cooked through, 20 to 25 minutes.",
        "While chicken braises, peel potatoes, then generously cover with cold water in a 2- to 3-quart saucepan and add 1 1/2 teaspoons salt. Bring to a boil, then simmer until potatoes are just tender, about 15 minutes. Drain in a colander, then return to saucepan. Add parsley and shake to coat.",
        "Stir crème fraîche into chicken mixture and season with salt, pepper, and lemon juice, then add potatoes."
    ],
    "ingredients": [
        "1 whole chicken (about 3 1/2 pound), backbone discarded and chicken cut French style into 8 pieces (see cooks' note, below)",
        "1 tablespoon vegetable oil",
        "3 tablespoons unsalted butter, divided",
        "4 medium leeks (white and pale green parts only), finely chopped (2 cups)",
        "2 tablespoons finely chopped shallot",
        "4 medium carrots, halved diagonally",
        "1 cup dry white wine (preferably Alsatian Riesling)",
        "1 1/2 pound small (2-inch) red potatoes",
        "2 tablespoons finely chopped flat-leaf parsley",
        "1/2 cup crème fraîche or heavy cream",
        "Fresh lemon juice to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Potato",
        "Braise",
        "Dinner",
        "Leek",
        "Carrot",
        "White Wine",
        "Oktoberfest",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken in Riesling",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-riesling-241725"
}
