{
    "directions": [
        "Preheat oven to 450°F. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add cipolline, carrots, celery, and garlic. Sprinkle with salt and pepper. Sauté until vegetables are lightly browned, about 8 minutes. Transfer to heavy large pot; push vegetables to sides.",
        "Heat 2 tablespoons oil in same skillet over medium-high heat. Sprinkle chicken generously with salt and pepper. Add to skillet and brown on all sides, turning often with wooden spoons, about 10 minutes. Place chicken, breast side up, in center of vegetable mixture in pot. Arrange fresh herbs, lemon peel, and prunes around chicken. Tuck cabbage wedges around chicken.",
        "Pour off fat from skillet. Add broth and wine to skillet and bring to boil, scraping up browned bits; pour over and around chicken. Drizzle remaining 1/2 cup oil over. Cover pot with large piece of heavy-duty aluminum foil, sealing tightly around rim. Place lid on pot to cover tightly. Roast chicken and vegetables until cooked through, about 55 minutes. Let stand covered 10 minutes.",
        "Transfer chicken to center of large shallow bowl. Using tongs, place vegetables and aromatics around chicken. Season pan juices to taste with salt and pepper; pour over chicken."
    ],
    "ingredients": [
        "3/4 cup extra-virgin olive oil, divided",
        "16 small cipolline, shallots, or boiling onions, peeled, trimmed",
        "5 long slender carrots, peeled, cut into 2-inch lengths",
        "4 celery stalks, cut into 2-inch lengths",
        "3 whole heads of garlic, papery outside removed, cloves separated, unpeeled",
        "1 4-pound chicken (preferably organic), rinsed, patted dry, legs tied together to hold shape",
        "6 fresh thyme sprigs",
        "6 fresh Italian parsley sprigs",
        "3 fresh rosemary sprigs",
        "1 tablespoon grated lemon peel",
        "16 pitted prunes",
        "1/2 small green cabbage, cut into 4 wedges with some core on each",
        "1 cup low-salt chicken broth",
        "1/2 cup Alsatian Riesling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Poultry",
        "Vegetable",
        "Roast",
        "Sauté",
        "Christmas",
        "Dinner",
        "Lunch",
        "Prune",
        "Spring",
        "Winter",
        "Cabbage",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chicken in Riesling with Prunes and Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-riesling-with-prunes-and-cabbage-234144"
}
