{
    "directions": [
        "In a large ovenproof skillet toss together the shallots, the garlic, 2 tablespoons of the oil, the bell peppers, the chopped rosemary, the potatoes, and salt and pepper to taste. Rub the chicken with the remaining 1 teaspoon oil, the lemon juice, and salt and pepper to taste and arrange it, skin side up, on top of the vegetable mixture. Roast the chicken and the vegetables in the upper third of a preheated 450°F oven for 20 minutes, reduce the temperature to 357°F., and roast the chicken and the vegetables for 15 minutes more, or until the chicken is cooked through and the potatoes are tender. Transfer the chicken and the vegetables with a slotted spoon to a heated platter, stir the broth into the skillet, scraping up the brown bits, and boil the mixture for 1 minute. Strain the liquid through a sieve over the chicken and garnish the chicken with the rosemary sprigs."
    ],
    "ingredients": [
        "3 large shallots, peeled, blanched in boiling water for 2 minutes, and halved lengthwise",
        "2 garlic cloves, minced",
        "2 tablespoons plus 1 teaspoon olive oil",
        "1/2 red bell pepper, cut into 1-inch pieces",
        "1/2 yellow bell pepper, cut into 1-inch pieces",
        "1 tablespoon finely chopped fresh rosemary leaves or 1 tablespoon crumbled dried, plus, if desired, rosemary sprigs for garnish",
        "3/4 pound small red potatoes, scrubbed and halved or, if large, quartered",
        "1 whole chicken breast (about 1 1/2 pounds), halved",
        "1 tablespoon fresh lemon juice",
        "1/2 cup chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Roast",
        "Quick & Easy",
        "Rosemary",
        "Bell Pepper",
        "Winter",
        "Shallot",
        "Gourmet"
    ],
    "title": "Chicken Roasted with Potatoes, Peppers, and Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-roasted-with-potatoes-peppers-and-shallots-11654"
}
