{
    "directions": [
        "Combine chicken, celery, 1 teaspoon salt, and black pepper in a saucepan. Pour enough water into the saucepan to cover the ingredients completely. Bring water to a boil and cook until the chicken is no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken to a cutting board to cool. Cut cooled chicken into bite-sized pieces. Discard water and celery.",
        "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9x13-inch casserole dish with cooking spray.",
        "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes; drain. Transfer noodles to a large bowl; add chicken and toss to combine.",
        "Bring milk to a simmer in a large saucepan over medium heat; keep at a simmer until needed.",
        "Melt butter in a large saucepan over medium-high heat. Whisk flour into the melted butter in small amounts, assuring each addition is integrated before adding more; cook and stir the flour mixture until you have a blonde roux, 5 to 10 minutes. Slowly pour milk into the flour mixture while continually stirring; bring to a boil and cook for 10 minutes. Stir 2 teaspoons salt, garlic powder, and nutmeg into the milk mixture; pour over the noodle mixture and stir to coat.",
        "Spread bread crumbs into the bottom of the prepared casserole dish. Pour the noodle mixture over the bread crumbs. Sprinkle Parmesan cheese over the noodle mixture. Drizzle olive oil over the Parmesan cheese.",
        "Bake in preheated oven until filling is bubbly and top layer of noodles are a crispy golden brown, 45 minutes to 1 hour."
    ],
    "ingredients": [
        "2 large chicken breasts",
        "1 stalk celery, cut into chunks",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 (8 ounce) package extra wide egg noodles",
        "4 cups milk",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 teaspoons salt",
        "1/2 teaspoon garlic powder",
        "1/8 teaspoon ground nutmeg",
        "1/4 cup bread crumbs",
        "1/2 cup Parmesan cheese",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Negresco",
    "url": "http://allrecipes.com/recipe/231123/chicken-negresco/"
}
