{
    "directions": [
        "Slice the ends off the zucchini and discard. Using a mandoline or carefully with a sharp knife, slice the zucchini lengthwise into very thin slices. Stack the slices and cut lengthwise into 1/4-inch-wide ribbons.",
        "Heat 1 tablespoon of the oil in large nonstick skillet over medium heat. Add half the garlic and cook for 30 seconds. Add the zucchini ribbons, cover, stirring occasionally, and cook until the zucchini is just tender, about 3 minutes. Transfer to a bowl.",
        "Heat 1 tablespoon of the oil in the skillet over medium-high heat. Season the chicken with 1/4 teaspoon salt and the black pepper and cook until cooked through, 2 to 3 minutes per side. Transfer the chicken to a plate and tent with foil to keep warm.",
        "Cook the pasta al dente according to the directions on the package. Reserve 1/2 cup of the pasta water. Drain the pasta and return it to the pasta pot.",
        "Meanwhile, make the sauce. Combine the flour and low-fat milk, stirring until the flour is dissolved. Heat the remaining 1 tablespoon oil in the skillet over medium-high heat. Add the remaining garlic and cook for 30 seconds. Add the milk-flour mixture and cook, stirring constantly, until the mixture begins to boil. Reduce the heat to low and cook, stirring, for 2 minutes more. Add the evaporated skim milk, the remaining 1/2 teaspoon salt, and the cheese and cook, stirring, until the cheese is melted, about 1 minute.",
        "Add 1 cup of the sauce, the zucchini, and 3 tablespoons of the parsley to the pasta in the pot and toss to combine. Add a little of the reserved pasta water as necessary to loosen the sauce.",
        "To serve, place 2 cups of the pasta mixture on each plate. Top with a piece of chicken. Drizzle with the remaining sauce and garnish with the remaining parsley."
    ],
    "ingredients": [
        "2 medium zucchini (about 8 ounces each)",
        "3 tablespoons olive oil",
        "2 garlic cloves, minced",
        "4 pieces thinly sliced skinless boneless chicken breast cutlets (1 pound total)",
        "3/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "12 ounces fettuccine pasta, preferably whole wheat",
        "1 tablespoon all-purpose flour",
        "1 cup cold low-fat (1%) milk",
        "1/2 cup evaporated skim milk (not condensed milk)",
        "3/4 cup freshly grated Parmesan cheese",
        "1/4 cup finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Chicken",
        "Dairy",
        "Pasta",
        "Poultry",
        "Dinner",
        "Parmesan",
        "Squash",
        "Zucchini",
        "Summer",
        "Healthy",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken Alfredo with Zucchini Ribbons",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-alfredo-with-zucchini-ribbons-51182610"
}
