{
    "directions": [
        "Use a fork to prick the chicken breasts all over on both sides. Arrange the chicken breasts on a large sheet of plastic wrap, spacing them apart from one another, then cover with a second large sheet of plastic wrap. Using the smooth side of a meat mallet or a rolling pin, beat the chicken until the breasts are an even 1/2- to 3/4-inch thickness.",
        "In a small bowl, whisk together the yogurt, 1 tablespoon peanut oil, lime juice, and garlic. Add the pounded chicken, and rub the marinade over the meat. Set the chicken aside while you make the sauce.",
        "In a small bowl, whisk together the coriander, cumin, cardamom, nutmeg, paprika, cayenne, and grated ginger. In a heavy, wide 4-quart pot or sauté pan over moderately high heat, melt the butter. Add the onion and sauté, stirring occasionally, until light brown and caramelized, about 5 minutes. (Note that because they are sautéed so quickly over moderately high heat, the onions will not caramelize evenly.) Reduce the heat to moderate then stir in the spice and ginger mixture. Add the tomato purée, water, heavy cream, and salt, and bring the sauce to a boil. Reduce the heat to gently simmer the sauce, uncovered, until thickened slightly, about 10 minutes. DO AHEAD: The sauce can be prepared ahead and refrigerated, in an airtight container, up to 3 days.",
        "Heat a heavy 11- to 12-inch griddle or skillet over moderately high heat until very hot and add 1/2 tablespoon of peanut oil. Working in two batches, cook the chicken breasts, turning them a few times and lowering the heat if the chicken chars too quickly, until just cooked through and browned well on both sides, 6 to 8 minutes total. Transfer the chicken as cooked to a cutting board. Wipe the griddle or skillet clean with a paper towel and cook the remaining chicken, adding the remaining 1/2 tablespoon peanut oil between batches.",
        "When all the chicken is cooked, cut it into 1 1/2-inch pieces. Add the chicken to the simmering sauce and continue to gently simmer it, stirring occasionally, for 5 minutes. Remove the pan from the heat, stir in the black pepper and chopped cilantro, and season with salt. DO AHEAD: Chicken tikka masala can be prepared ahead, cooled, uncovered, and refrigerated, covered, up to 3 days.",
        "Transfer the chicken to a serving dish and garnish with additional cilantro sprigs. Serve with naan, and/or if desired with Basmati Rice ."
    ],
    "ingredients": [
        "1 1/2 pounds boneless, skinless chicken breasts (3 to 4 breast halves total)",
        "1/4 cup plain whole-milk Greek-style yogurt",
        "2 tablespoons peanut oil",
        "2 teaspoons fresh lime or lemon juice",
        "1 large clove garlic, minced",
        "1 tablespoon ground coriander",
        "1 1/2 teaspoons ground cumin",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon ground nutmeg",
        "1 1/2 teaspoons paprika",
        "1/2 teaspoon cayenne",
        "1 tablespoon grated peeled fresh ginger (from 1-inch piece)",
        "4 tablespoons (1/2 stick) unsalted butter",
        "1 large white onion, finely chopped",
        "1 1/2 cups canned tomato purée (see Cook's Notes for a fresh-tomato alternative)",
        "3/4 cup water",
        "1/2 cup heavy cream or half-and-half",
        "1 1/4 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 cup chopped fresh cilantro plus additional sprigs for garnish",
        "Naan (Indian flatbread) and/or cooked Basmati Rice",
        "Equipment: Meat mallet or rolling pin, Microplane"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Chicken Tikka Masala",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tikka-masala-51171400"
}
