{
    "directions": [
        "Bring broth to boil in Dutch oven over medium heat. Add fennel; cook 7 minutes. Add chicken and carrot; simmer until fennel, chicken and carrot are tender, about 10 minutes. Pour into strainer set over bowl; reserve broth for another use.",
        "Melt butter in heavy large saucepan over medium-high heat. Add flour; stir 2 minutes. Gradually add milk and whisk until sauce thickens, about 4 minutes. Add lemon juice, fennel seeds and 1/2 teaspoon salt. Add chicken mixture and ham. Season with salt and pepper. Divide filling among eight 1 1/4-cup soufflé dishes or glass custard cups. Cool completely.",
        "Roll out pie crust on flour surface to 1/8-inch thickness. Cut out 8 rounds, each measuring 1/2 to 1 inch larger in diameter than soufflé dishes, gathering dough and rerolling as necessary. Cut out leaf decorations from dough scraps, if desired. Lay 1 dough overhang firmly to adhere to sides and top rim of dish. If using, brush bottom side of cutouts with water and place on dough; cut slits in dough for steam to escape. (Can be made 1 day ahead. Cover each with plastic; chill.)",
        "Preheat oven to 375°F. Place pies on large baking sheet. Brush crusts with glaze. Bake until pies heated through and crusts are golden, about 40 minutes.",
        "Combine flour and salt in processor and blend. Add butter and shortening and process, using on/off turns, until mixture resembles coarse meal. Add 4 tablespoons water; blend in. Add enough additional water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and chill until cold, at least 1 hour or up to 1 day. Makes 8 small cups."
    ],
    "ingredients": [
        "5 cups canned low-salt chicken broth",
        "2 small fennel bulbs, trimmed, halved lengthwise, triangular core discarded, thinly sliced",
        "1 3/4 pounds skinless boneless chicken breast halves, cut into 1-inch pieces",
        "1/2 cup diced carrot",
        "5 tablespoons unsalted butter",
        "5 tablespoons all purpose flour",
        "2 1/2 cups milk (do not use nonfat or low-fat)",
        "3 tablespoons fresh lemon juice",
        "2 teaspoons fennel seeds, crushed",
        "1/2 teaspoon (or more) salt",
        "1/4 pound thinly sliced country ham, cut into matchstick-size strips",
        "3 cups sifted all purpose flour",
        "3/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
        "4 1/2 tablespoons chilled vegetable shortening, cut into pieces",
        "6 tablespoons (about) ice water",
        "1 egg white, beaten to blend (glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pork",
        "Poultry",
        "Vegetable",
        "Bake",
        "Winter"
    ],
    "title": "Chicken, Ham and Fennel Pot Pies",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-ham-and-fennel-pot-pies-2478"
}
