{
    "directions": [
        "To prepare the chicken, in a heavy Dutch oven, stir together the orange juice, lime juice, and achiote paste until the achiote paste is smooth. Add the onion, garlic, and oregano and mix well. Add the chicken thighs and turn to coat evenly. Sprinkle the chicken with salt.",
        "Cover, place over medium heat, bring to a simmer, then reduce the heat to low and cook, stirring occasionally, until the sauce has thickened and the chicken is opaque throughout when pierced with a knife tip, about 40 minutes. Uncover and continue to simmer until the sauce is very thick and the chicken begins to fall apart and catch on the bottom of the pan, about 10 minutes.",
        "Remove from the heat and let cool slightly, then shred the chicken. Season with salt and pepper.",
        "To make the radish slaw, in a small bowl, combine the radishes, green onions, cilantro, and lime juice and toss to mix. Season with salt.",
        "Pour oil to a depth of 1 inch (2.5 cm) into a deep, heavy frying pan and warm over medium-high heat until almost smoking. One at a time, add the tortillas and cook, turning once with tongs, until crisp and golden, 1-2 minutes. As each tortilla is ready, transfer it to paper towels to drain, then sprinkle lightly with salt.",
        "Arrange 2 tortillas side by side on each individual plate. Top the tortillas with the chicken, dividing it equally, and then spoon the radish slaw evenly over the chicken. Top the tostadas evenly with the cheese and the avocado slices and serve."
    ],
    "ingredients": [
        "fresh orange juice, 2/3 cup (5 fl oz/150 ml)",
        "fresh lime juice, 3 tbsp",
        "achiote paste, 3 tbsp",
        "yellow onion, 1 small, chopped",
        "garlic, 2 cloves, chopped",
        "dried oregano, 1/2 tsp",
        "boneless, skinless chicken thighs, 2 lb (1 kg)",
        "kosher salt and freshly ground pepper",
        "radishes, 2 1/2 cups (about 18) trimmed, halved, and thinly sliced",
        "green onions, 2, thinly sliced",
        "fresh cilantro, 1/3 cup (1/2 oz/15 g) chopped",
        "fresh lime juice, 1 tbsp",
        "corn oil, for frying",
        "corn tortillas, 12, each 4 inches (10 cm) in diameter",
        "cotija cheese, 3 oz (90 g), crumbled",
        "avocados, 2 large, halved, pitted, peeled, and sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Braise",
        "Dinner",
        "Lunch",
        "Avocado",
        "Root Vegetable",
        "Radish",
        "Tortillas",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken Tostadas with Radish Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tostadas-with-radish-slaw-51166400"
}
