{
    "directions": [
        "Preheat oven to 325°F. Heat extra-virgin olive oil in heavy large ovenproof pot over medium-high heat. Sprinkle chicken with salt and pepper. Working in 2 batches, sauté chicken until golden, about 4 minutes per side. Transfer chicken to platter. Add prosciutto, sliced garlic, and chopped rosemary to same pot. Stir 1 minute. Add dry white wine, chicken broth, and crushed tomatoes with puree. Bring to boil, scraping up browned bits. Boil 5 minutes. Return chicken to pot, arranging in single layer. Return to boil. Cover pot and place in oven. Bake until chicken breasts are cooked through, about 20 minutes. Remove chicken breasts. Continue baking until drumsticks and thighs are cooked through, about 10 minutes longer. Remove pot from oven. Return chicken breasts to pot. (Can be prepared 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated.)",
        "Bring chicken mixture to simmer. Transfer chicken to platter; tent with foil. Boil until sauce is reduced to 2 cups and coats back of spoon, about 5 minutes. Season sauce to taste with salt and pepper. Pour sauce over chicken. Garnish with rosemary sprigs and serve."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "3 large chicken breast halves with ribs and skin, cut crosswise in half",
        "3 chicken drumsticks with skin",
        "3 chicken thighs with skin",
        "1 cup 1/4-inch cubes prosciutto (about 5 ounces)",
        "6 garlic cloves, thinly sliced",
        "2 tablespoons chopped fresh rosemary",
        "1 1/4 cups dry white wine",
        "1 cup low-salt chicken broth",
        "1 cup canned crushed tomatoes with added puree",
        "Fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Tomato",
        "Low Carb",
        "Quick & Easy",
        "Rosemary",
        "White Wine",
        "Fall",
        "Prosciutto",
        "Simmer"
    ],
    "title": "Chicken with Prosciutto, Rosemary, and White Wine",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-prosciutto-rosemary-and-white-wine-107151"
}
