{
    "directions": [
        "Bring a large pot of water to a boil, and salt generously. Add the pasta, and boil according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil.",
        "Meanwhile, slice the chicken into 1/4-inch-thick strips, and lay them on a plate or a sheet of waxed paper. Season with salt and pepper.",
        "Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high and add the chicken in 1 layer. Cook, without moving the pieces, until the underside has browned, 1 to 2 minutes. Flip the pieces, and cook until browned and fully cooked through, 2 to 3 minutes more. Transfer the chicken to a medium bowl.",
        "Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce just warm.",
        "Whisk the Parmigiano-Reggiano into the sauce. Add the chicken and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls."
    ],
    "ingredients": [
        "Kosher salt",
        "12 ounces fettuccine",
        "Olive oil, for tossing",
        "12 ounces boneless, skinless chicken breast (about 2)",
        "Freshly ground black pepper",
        "1 stick (8 tablespoons) unsalted butter",
        "2 cups heavy cream",
        "2 pinches freshly grated nutmeg",
        "1 1/2 cups freshly grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Alfredo",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Chicken Fettuccine Alfredo",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-fettuccine-alfredo"
}
