{
    "directions": [
        "Layer two 15-inch sheets of heavy-duty foil and fold them together around the edges to create one sheet. Repeat to make a second double-layered sheet of foil. Bend the edges of one of the sheets up 2 inches and crimp the corners so it can hold liquid.",
        "In order, layer these ingredients on the bent sheet of foil: olive oil, onion, jalapeno, bell pepper, chicken, 1/4 teaspoon salt, 1 teaspoon pepper, the garlic, cilantro, cheeses, lime juice and tequila. Place the second double-layered foil sheet on top of the ingredients and fold the top and bottom sheets together on all sides. Make sure the package is not leaking, then refrigerate until ready to cook.",
        "Preheat the oven to 250 degrees F or a grill to medium and place the foil packet in the oven or on the grill. Cook 10 minutes; flip and cook 10 more minutes. Slice the bag open and top with the tomatoes, cilantro and parmesan cheese. Serve on the warmed rolls.",
        "Photograph by Andrew McCaul"
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 cup julienned red onion",
        "1 tablespoon minced jalapeno pepper",
        "1/2 cup julienned roasted red bell pepper",
        "1 rotisserie chicken, skin removed and meat shredded",
        "Sea salt and freshly ground pepper",
        "1 tablespoon chopped garlic",
        "2 tablespoons chopped fresh cilantro, plus more for topping",
        "4 ounces cream cheese",
        "1/4 cup grated parmesan cheese, plus more for topping",
        "1 1/4 cups grated mozzarella cheese",
        "1/4 cup fresh lime juice",
        "3 ounces tequila",
        "1/4 cup diced Roma tomatoes, for topping",
        "4 sourdough rolls, warmed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Sandwich",
        "Jalapeno Recipes",
        "Vegetable"
    ],
    "title": "Chicken-Tequila Tailgate Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/chicken-tequila-tailgate-sandwiches-recipe"
}
