{
    "directions": [
        "In a small bowl, add the apricot preserves and mayonnaise and stir to combine. Slice the Perfect Grilled Chicken into strips.",
        "To build the sandwich, spread both slices of bread with the apricot-mayonnaise spread. On one half, lay a slice of cheese, the chicken strips, sage, red onion slices and the second slice of cheese. Put on the top piece of bread and spread softened butter on both sides of the sandwich.",
        "Grill the sandwich in a hot panini maker until golden and crisp. (If you do not have a panini maker, you can grill the sandwich in a skillet, laying another heavy skillet on top of the sandwich to press it together. Turn to grill the other side in the same way.)",
        "Mix together the olive oil, honey, mustard, salt, thyme, oregano and lemon juice in a large shallow container.",
        "Pound the chicken breasts to uniform thickness and add them to the marinade. Cover and marinate in the fridge for at least 8 hours.",
        "Heat a grill pan over medium-high heat. Grill the chicken in batches until golden brown on the first side, 4 to 5 minutes. Flip and cook until golden brown on the other side and cooked all the way through, another 4 to 5 minutes. Let the chicken cool.",
        "Transfer the chicken to freezer bags individually and in pairs, so it's easy to defrost the exact amount you need."
    ],
    "ingredients": [
        "2 tablespoons apricot preserves",
        "2 tablespoons mayonnaise",
        "1 piece Perfect Grilled Chicken (thawed if frozen), recipe follows",
        "2 slices good, thick sourdough bread",
        "2 slices provolone cheese",
        "4 fresh sage leaves",
        "1/4 red onion, sliced very thin",
        "2 tablespoons butter, softened",
        "2 cups olive oil",
        "6 tablespoons honey",
        "3 heaping tablespoons Dijon mustard",
        "1 tablespoon salt",
        "2 teaspoons ground thyme",
        "2 teaspoons ground oregano",
        "Juice of 12 lemons",
        "24 boneless, skinless chicken breasts"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Panini Recipes",
        "Apricot",
        "Fruit",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Chicken Apricot Panini",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-apricot-panini"
}
