{
    "directions": [
        "Heat the butter and olive oil in a large stockpot over medium heat. When the butter begins to foam, add the carrots, onion, celery, garlic, and mushrooms. Sauté the vegetables, stirring occasionally, until golden brown, about 10 minutes.",
        "Add the white wine and stir, then add the herbs, peppercorns, chicken bones, and water and bring just to a simmer. Turn the heat to low, skim off any impurities that have risen to the surface (don't stir or the stock will be cloudy), and simmer, uncovered for 2 1/2 hours.",
        "Strain the stock first through a colander, then through a fine-mesh strainer (or cheesecloth-lined colander) into a stainless steel bowl or container. Chill the stock in an ice-water bath. (This not only kills harmful bacteria, it prevents you from having to put steaming-hot stock into your refrigerator — and inadvertently heating it and its contents.) Then refrigerate until chilled, or, preferably, overnight.",
        "Skim any fat from the top of the stock, and transfer to airtight containers. The stock will keep for 3 days in the refrigerator, or you can freeze it for up to 6 months."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "1 tablespoon virgin olive oil",
        "3 large carrots, peeled and roughly chopped",
        "1 large onion, roughly chopped",
        "3 large stalks celery, roughly chopped",
        "1 head garlic, cut horizontally in half",
        "8 ounces mushrooms, roughly chopped",
        "1 cup dry white wine",
        "6 sprigs thyme",
        "6 sprigs Italian parsley",
        "6 basil leaves",
        "2 bay leaves, broken in half",
        "1 tablespoon black peppercorns, toasted",
        "3 to 4 pounds chicken bones, wings, backs, and/or necks",
        "10 to 12 cups water, or enough to cover"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Herb",
        "Mushroom",
        "Vegetable",
        "White Wine",
        "Chill",
        "Simmer"
    ],
    "title": "Chicken Stock",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-stock-108211"
}
