{
    "directions": [
        "In a bowl with an electric mixer cream the butter, add the sugar, and beat the mixture until it is light and fluffy. Add the egg white and the salt and beat the mixture at low speed for 5 seconds, or until it is just combined. (The mixture will be lumpy.) Add the cornmeal, the flour, and the Parmesan and stir the mixture until it is just combined. Transfer the mixture to a small bowl and chill it, covered, for at least 4 hours or overnight. Arrange rounded teaspoons of the mixture 3 inches apart on buttered baking sheets and with a fork dipped in cold water flatten them carefully to form 2-inch rounds. Bake the wafers in batches in the middle of a preheated 425°F. oven for 5 to 6 minutes, or until the edges are golden brown, with a spatula transfer the wafers immediately to racks, and let them cool.",
        "In a 9-inch cast-iron skillet heat the oil over moderately high heat until it is hot but not smoking and in it brown the chicken, patted dry and seasoned with salt and pepper, in batches, transferring it as it is browned to a bowl. To the fat remaining in the skillet add butter and the flour and cook the roux over moderately low heat, stirring constantly, until it is the color of peanut butter. Stir in the onion, the bell pepper, and the celery and cook the mixture, stirring occasionally, until the vegetables are softened. Add the broth, the tomatoes, the chili powder, and the chicken with any juices that have accumulated in the bowl, simmer the stew, covered, for 15 to 20 minutes, or until the chicken is cooked through, and stir in the corn. Transfer the chicken to a work surface and let it cool until it can be handled. Cut the chicken into bite-size pieces and stir it into the stew. The stew may be prepared up to this point 1 day in advance and kept covered and chilled. Stir in the scallion greens and the basil, season the stew with salt and pepper, and serve it in bowls topped with the corn wafers."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "2 teaspoons sugar",
        "1 large egg white",
        "1/2 teaspoon salt",
        "3 tablespoons yellow cornmeal",
        "1 tablespoon all-purpose flour",
        "2 tablespoons freshly grated Parmesan",
        "1 tablespoon vegetable oil",
        "2 whole boneless chicken breasts (about 2 pounds)",
        "1 tablespoon unsalted butter",
        "3 tablespoons all-purpose flour",
        "1 small onion, chopped fine",
        "1 small green bell pepper, chopped fine",
        "1 rib of celery, chopped fine",
        "1 1/4 cups chicken broth",
        "4 fresh or canned plum tomatoes, chopped",
        "1 teaspoon chili powder",
        "1 cup fresh corn kernels including the pulp scraped from the cobs (cut from about 2 ears of corn)",
        "1/2 cup thinly sliced scallion greens",
        "1/4 cup loosely packed fresh basil leaves, chopped fine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Tomato",
        "Vegetable",
        "Bake",
        "Stew",
        "Corn",
        "Summer",
        "Gourmet"
    ],
    "title": "Chicken and Corn Stew with Corn Wafers",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-corn-stew-with-corn-wafers-12315"
}
