{
    "directions": [
        "Butter 4-quart oval baking dish. Place chicken breasts in heavy large pot. Add just enough broth to cover chicken. Bring broth to boil; reduce heat to low. Cover pot and simmer until chicken is just cooked through, skimming surface occasionally, about 20 minutes. Using tongs, transfer chicken to plate and cool.",
        "Add carrots and turnips to chicken broth in pot. Simmer uncovered until vegetables are just tender, about 10 minutes. Using slotted spoon, transfer vegetables to prepared baking dish. Add turnip greens to broth and cook just until wilted, about 1 minute. Using slotted spoon, transfer greens to colander; drain well. Add to vegetables in baking dish.",
        "Strain broth; reserve 4 cups. Remove skin and bones from chicken. Cut meat into 1/2- to 3/4-inch pieces. Add chicken to vegetables in baking dish.",
        "Melt butter in same pot over medium heat. Add leeks, shallots and thyme. Sauté until tender, about 8 minutes. Add flour and stir 2 minutes. Stir in 4 cups broth and white wine. Increase heat to high and bring to boil, stirring constantly. Add cream and boil until sauce thickens enough to coat spoon, whisking frequently, about 6 minutes. Season with salt and pepper. Pour gravy over mixture in dish. Stir to blend. Cool 45 minutes. (Filling can be made 1 day ahead. Cover and refrigerate.)",
        "Position 1 rack in top third of oven and place baking sheet on bottom rack in oven; preheat to 400deg;F. Roll out crust dough on parchment paper to 15x10 1/2-inch rectangle. Using paper as aid, turn dough over onto filling. Trim dough overhang; tuck dough edge inside dish. Roll out dough scraps to 1/4-inch thickness. Cut out leaf shapes. Brush bottom of cutouts with water and place on crust; cut slits in crust to allow steam to escape.",
        "Place pot pie on top rack and bake until crust is golden and gravy is bubbling, about 50 minutes. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "4 pounds chicken breasts with skin and bones",
        "4 to 6 cups canned low-salt chicken broth",
        "3 large carrots, peeled, cut into 1/2-inch pieces",
        "1 pound turnips, peeled, cut into 1/2-inch pieces",
        "1 large bunch turnip greens (about 8 to 10 ounces), center stem cut away, leaves cut into 1-inch pieces",
        "1/4 cup (1/2 stick) butter",
        "3 medium leeks (white and pale green parts only), sliced",
        "2 large shallots, minced",
        "2 tablespoons minced fresh thyme",
        "1/2 cup all purpose flour",
        "1/2 cup dry white wine",
        "1/2 cup whipping cream",
        "Herb Crust"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Poultry",
        "Vegetable",
        "Bake",
        "Dinner",
        "Casserole/Gratin",
        "Carrot",
        "Turnip",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken and Fall Vegetable Pot Pie",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-fall-vegetable-pot-pie-102378"
}
