{
    "directions": [
        "In a large pot, place the chicken legs, bay leaves, tarragon, peppercorns, parsley stalks, white wine, and 2 celery stalks. Halve two of the onions and two of the carrots and add to the pan, then pour in enough cold water to cover the legs (about 2 quarts). Cover the pan and bring to a boil, then reduce to a simmer and cook, with the lid half on, for 25 minutes, or until juices in the legs run clear.",
        "Remove the chicken legs from the pan and set aside, but keep the stock simmering. Meanwhile, chop the remaining onions, carrot, and celery into small chunks.",
        "In a large saucepan over low heat, heat the butter, add the chopped vegetables and a pinch of salt, and sweat for 6 to 8 minutes. Meanwhile, strip the chicken from the bones and set aside. Place the bones, skin, and trimmings back in the simmering stock pot and continue to simmer.",
        "Add the mushrooms and garlic to the pan with the chopped vegetables and turn up the heat to brown all the ingredients, 3 to 4 minutes. Stir in the flour and cook gently for a minute. Strain the stock into a measuring cup and measure out 3 1/3 cups (you can freeze any extra). Add nearly all of the stock and the soy sauce to the pan of vegetables, stirring it in slowly until it comes back to a simmer and thickens. Add a little more stock if it is still too thick- it should be thick enough to coat the back of a spoon. Chop the parsley leaves and add to the pan, along with the chicken. Stir in the cream, then taste and adjust seasoning as needed."
    ],
    "ingredients": [
        "8 chicken legs",
        "3 bay leaves",
        "1 teaspoon dried tarragon",
        "15 black peppercorns",
        "1-ounce bunch fresh parsley, leaves and stems separated",
        "3/4 cup plus 1 tablespoon dry white wine",
        "4 celery stalks, trimmed",
        "4 medium onions, peeled",
        "6 medium carrots, peeled",
        "about 1 tablespoon butter",
        "3/4 pound crimini mushrooms, quartered",
        "2 garlic cloves, crushed",
        "4 heaping tablespoons all-purpose flour",
        "a dash of soy sauce",
        "3 tablespoons heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Chicken",
        "Herb",
        "Poultry",
        "Dinner",
        "Simmer",
        "Boil",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Chicken with White Wine and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-white-wine-and-herbs-51119210"
}
