{
    "directions": [
        "Heat 1 tablespoon butter in a large skillet over medium-high heat. Cook the sausage until golden, about 2 minutes. Season the chicken with salt and pepper, then toss with the flour in a bowl; add to the skillet and cook until browned but not cooked through, about 3 minutes.",
        "Add the onion, peppers, garlic, 1/2 teaspoon salt, and pepper to taste and cook 3 minutes. Add the wine, scraping up any browned bits; bring to a boil and cook until slightly reduced, about 1 minute. Add the broth and bring to a gentle simmer. Cover and cook until the sausage and chicken are cooked through, about 5 minutes.",
        "Transfer the chicken, sausage and vegetables to a platter with a slotted spoon. Increase the heat to high and stir the parsley and cherry peppers and their liquid into the skillet; boil until reduced by one-third, 2 to 3 minutes. Remove from the heat and stir in the remaining 1 tablespoon butter. Pour the sauce over the chicken mixture.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "3/4 pound sweet or hot Italian sausage, cut into chunks",
        "3/4 pound skinless, boneless chicken breasts, cut into chunks",
        "Kosher salt and freshly ground pepper",
        "1 tablespoon all-purpose flour",
        "1 small onion, chopped",
        "2 Italian green frying peppers, cut into 1-inch pieces",
        "3 cloves garlic, roughly chopped",
        "1/2 cup dry white wine",
        "3/4 cup low-sodium chicken broth",
        "1/4 cup roughly chopped fresh parsley",
        "2 jarred pickled cherry peppers, chopped, plus 2 tablespoons liquid from the jar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy",
        "Italian",
        "Sausage Recipes"
    ],
    "title": "Chicken, Sausage and Peppers",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-sausage-and-peppers-recipe"
}
