{
    "directions": [
        "Quick-soak black-eyed peas.",
        "Chop onion and mince garlic. Cut mushrooms into 1/4-inch-thick slices.",
        "In a 4-quart heavy kettle cook onion and garlic in 1 tablespoon oil over moderate heat, stirring occasionally, until onion is softened. Add mushrooms and thyme and cook, stirring, until mushrooms are tender and liquid from mushrooms is evaporated. Stir in Sherry and simmer 1 minute. Transfer mixture to a bowl.",
        "Pat chicken dry and cut crosswise into 1/2-inch-thick slices. Season chicken with salt and pepper. In kettle heat remaining tablespoon oil over moderately high heat until hot but not smoking and cook chicken, stirring, until browned. Add flour, stirring to coat chicken evenly. Add broth and bring to a boil, stirring. Stir in mushroom mixture and peas and simmer, covered, 20 minutes, or until peas are tender.",
        "While mixture is simmering, discard coarse stems from spinach and cut leaves crosswise into 1/4-inch-wide strips.",
        "Stir spinach, cream, mustard, and salt and pepper to taste into fricassee and simmer, stirring, 2 minutes."
    ],
    "ingredients": [
        "1 cup dried black-eyed peas",
        "1 medium onion",
        "2 garlic cloves",
        "10 ounces white mushrooms",
        "2 tablespoons olive oil",
        "1/2 teaspoon dried thyme",
        "1/4 cup dry Sherry",
        "4 skinless boneless chicken breast halves (about 1 1/2 pounds total)",
        "2 tablespoons all-purpose flour",
        "2 1/4 cups chicken broth",
        "1 pound spinach",
        "1/2 cup heavy cream",
        "1 tablespoon Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Chicken",
        "Dairy",
        "Leafy Green",
        "Mushroom",
        "Mustard",
        "High Fiber",
        "Winter",
        "Gourmet"
    ],
    "title": "Chicken Fricassée with Black-Eyed Peas and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fricassee-with-black-eyed-peas-and-spinach-14612"
}
