{
    "directions": [
        "In a medium bowl, toss the chicken with the scallion whites, about half the garlic and ginger, the soy sauce, sugar, 1 teaspoon of the cornstarch, 1 teaspoon of the salt, the sherry, and the sesame oil. Marinate at room temperature for 15 minutes. Mix the remaining cornstarch with 1/3 cup water.",
        "Heat a large nonstick skillet over high heat. Add 1 tablespoon of the oil and heat. Add the broccoli stems, and stir-fry for 30 seconds. Add the florets and the remaining garlic, ginger, 2 tablespoons of water, and season with 1/4 teaspoon salt, and pepper. Stir-fry until the broccoli is bright green but still crisp, about 2 minutes. Transfer to a plate.",
        "Get the skillet good and hot again, and then heat 2 more tablespoons oil. Add the chicken and chili flakes if using. Stir-fry until the chicken loses its raw color and gets a little brown, about 3 minutes. Add the hoisin sauce, return the broccoli to the pan and toss to heat through. Stir in the reserved cornstarch mixture and bring to a boil to thicken. Add more water if need to thin the sauce, if necessary. Taste and season with salt and pepper, if you like. Mound the stir-fry on a serving platter or divide among 4 plates and garnish with sesame seeds; serve with rice."
    ],
    "ingredients": [
        "1 pound chicken breast (about 2 breasts), cubed",
        "3 scallions, whites only, thinly sliced on an angle",
        "2 cloves garlic, minced",
        "1-inch piece peeled fresh ginger, minced",
        "1 tablespoon soy sauce",
        "2 tablespoons sugar",
        "1 tablespoon, plus 1 teaspoon cornstarch",
        "1 1/4 teaspoons salt",
        "1 tablespoon dry sherry",
        "1 tablespoon dark sesame oil",
        "About 1/3 cup water",
        "3 tablespoons vegetable oil",
        "5 to 6 cups broccoli, trimmed sliced stalks and medium florets (keep the 2 cuts separate)",
        "3/4 to 1 teaspoon red chili flakes, optional",
        "1 tablespoon hoisin sauce",
        "Garnish: toasted sesame seeds, optional",
        "Serving suggestion: Jasmine rice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy",
        "Wok Recipes",
        "Asian",
        "Broccoli",
        "Vegetable",
        "Low-Fat",
        "Low Calorie",
        "Marinating Recipes",
        "Stir-Frying Recipes"
    ],
    "title": "Chicken and Broccoli Stir-fry",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-and-broccoli-stir-fry-recipe"
}
