{
    "directions": [
        "Flatten the chicken breasts between sheets of wax paper until they are slightly less than 1/4 inch thick, arrange them skin side down, and halve them lengthwise. With the cut side of the breast facing you arrange 1 of the scallions parallel to the cut side, flank the section with a line of the red pepper slices, and beginning with the cut side roll up the chicken. Trim the ends of the scallion and transfer the cylinder seam side down to a large baking dish. Make 7 more cylinders in the same manner.",
        "In a small bowl combine the soy sauce, the vinegar, and the sugar and stir the marinade until the sugar is dissolved.",
        "Pour the marinade over the cylinders, turn the cylinders carefully to coat them with it, and let them marinate for 20 minutes. Remove the cylinders, 1 at a time, from the marinade and wrap each one securely in Saran Wrap. (The cylinders may be made up to 1 day ahead and kept wrapped in the plastic wrap and chilled.) In a kettle steam the cylinders on a rack set over boiling water, covered for 5 minutes, oruntil they are firm to the touch, let them cool, and chill them for at least 2 hours or overnight. Peel off the plastic wrap trim the ends diagonally and cut the cylinders diagonally into 1-inch pieces. Turn the cylinders cut side up and arrange them decoratively on platter."
    ],
    "ingredients": [
        "2 large whole chicken breasts, skinned, boned, and halved",
        "8 scallions",
        "a 6 1/2-ounce bottle roasted red peppers, drained and cut into 1/3-inch slices",
        "1/4 cup soy sauce",
        "2 tablespoons rice vinegar",
        "2 teaspoons superfine granulated sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pepper",
        "Steam",
        "Cocktail Party",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Chicken, Scallion, and Red Pepper Cylinders",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-scallion-and-red-pepper-cylinders-101549"
}
