{
    "directions": [
        "1. In a 3-quart saucepan bring 2 quarts water to a boil over high heat. When the water comes to a rolling boil, add the noodles. Return to a rolling boil and boil according to package directions until al dente. Carefully pour the noodles into a colander and rinse several times with cold water. Drain the noodles, shaking well to remove excess water. Return the noodles to the unwashed pot, add the sesame oil, and toss until well combined. Set aside.",
        "2. Put the chicken in a shallow bowl and add the ginger, 1 teaspoon of the rice wine, cornstarch, 1 tea- spoon of the soy sauce, 1/4 teaspoon of the salt, and pepper. In a small bowl combine the remaining 1 tablespoon rice wine and 1 tablespoon soy sauce.",
        "3. Heat a 14-inch flat-bottomed wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in 1 tablespoon of the peanut oil, add the red pepper flakes, then, using a metal spatula, stir-fry 10 seconds or until the pepper flakes are fragrant. Push the pepper flakes to the sides of the wok, carefully add the chicken mixture and spread it evenly in one layer in the wok. Cook undisturbed 1 minute, letting the chicken begin to sear. Stir-fry 30 seconds or until the chicken begins to brown. Add the cabbage and mushrooms and stir-fry 1 minute or until the cabbage is just wilted but the chicken is not cooked through. Transfer the chicken and vegetables to a plate.",
        "4. Swirl the remaining 1 tablespoon peanut oil into the wok. Add the noodles and stir-fry 15 seconds. Restir the soy sauce mixture, swirl it into the wok, add the scallions and chicken mixture, and sprinkle on the remaining 3/4 teaspoon salt. Stir-fry 1 to 2 minutes or until chicken is cooked through and noodles are heated through."
    ],
    "ingredients": [
        "12 ounces fresh Chinese thick, round egg noodles",
        "2 teaspoons sesame oil",
        "12 ounces skinless, boneless chicken thigh, cut into 1/4-inch-thick bite-sized slices",
        "1 tablespoon finely shredded ginger",
        "1 teaspoon plus 1 tablespoon Shao Hsing rice wine or dry sherry",
        "1 teaspoon cornstarch",
        "1 teaspoon plus 1 tablespoon soy sauce",
        "1 teaspoon salt",
        "1/4 teaspoon ground white pepper",
        "2 tablespoons peanut or vegetable oil",
        "1/4 teaspoon red pepper flakes",
        "3 cups thinly sliced Napa cabbage (about 5 ounces)",
        "4 ounces fresh shiitake mushrooms, stems removed and caps thinly sliced (about 2 cups)",
        "1/2 cup finely shredded scallions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Chicken",
        "Ginger",
        "Mushroom",
        "Poultry",
        "Side",
        "Stir-Fry",
        "Dinner",
        "Lunar New Year",
        "Family Reunion",
        "Noodle",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chicken Lo Mein with Ginger Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-lo-mein-with-ginger-mushrooms-388609"
}
