{
    "directions": [
        "Place chiles in a small heatproof bowl, add boiling water to cover, and let soak until softened, 25-30 minutes.",
        "Drain chiles, reserving soaking liquid. Purée chiles, shallots, garlic, ginger, cilantro stems, coriander, turmeric, curry powder, and 2 tablespoons soaking liquid in a food processor, adding more soaking liquid by tablespoonfuls, if needed, until smooth.",
        "Heat oil in a large heavy pot over medium heat. Add khao soi paste; cook, stirring constantly, until slightly darkened, 4-6 minutes. Add coconut milk and broth. Bring to a boil; add chicken. Reduce heat and simmer until chicken is fork-tender, 20-25 minutes. Transfer chicken to a plate. Let cool slightly; shred meat.",
        "Meanwhile, cook noodles according to package directions.",
        "Add chicken, 3 tablespoons fish sauce, and sugar to soup. Season with salt or more fish sauce, if needed. Divide soup and noodles among bowls and serve with toppings."
    ],
    "ingredients": [
        "4 large dried New Mexico or guajillo chiles, stemmed, halved, seeded",
        "2 medium shallots, halved",
        "8 garlic cloves",
        "1 2\" piece ginger, peeled, sliced",
        "1/4 cup chopped cilantro stems",
        "1 tablespoon ground coriander",
        "1 tablespoon ground turmeric",
        "1 teaspoon curry powder",
        "2 tablespoons vegetable oil",
        "2 14-ounce cans unsweetened coconut milk",
        "2 cups low-sodium chicken broth",
        "1 1/2 pounds skinless, boneless chicken thighs, halved lengthwise",
        "1 pound Chinese egg noodles",
        "3 tablespoons (or more) fish sauce (such as nam pla or nuoc nam)",
        "1 tablespoon (packed) palm sugar or light brown sugar",
        "Kosher salt",
        "Sliced red onion, bean sprouts, cilantro sprigs, crispy fried onions or shallots, chili oil, and lime wedges (for serving)",
        "Ingredient info: Dried chiles are available at Latin markets; Chinese egg noodles and chili oil are available at Asian markets. All can be found at many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Dinner",
        "Lunch",
        "Noodle",
        "Chile Pepper",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Khao Soi",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-khao-soi-51149110"
}
