{
    "directions": [
        "Place guajillo chiles in medium saucepan; add enough water to cover generously and bring to boil. Reduce heat and simmer until soft, about 15 minutes. Drain; reserve cooking liquid. Place chiles in processor; add 1/4 cup reserved cooking liquid and 4 tablespoons oil and puree until smooth. Transfer chile sauce to bowl; season with salt and pepper.",
        "Reserve 6 tablespoons chile sauce for sandwiches. Brush remaining sauce all over chicken; sprinkle with salt and pepper. Heat remaining 1 tablespoon oil in large nonstick skillet over medium-high heat. Add chicken and cook until cooked through, 6 to 7 minutes per side. Let chicken rest 5 minutes, then slice thinly crosswise.",
        "Mix lettuce, onion, and jalape&nitilde;os in medium bowl; add 1/4 cup reserved jalape&nitilde;o juice to slaw and toss. Spread reserved chile sauce over cut sides of bread. Top bottom halves with chicken, then cheese, then some slaw. Cover with top halves of bread and serve with remaining slaw alongside."
    ],
    "ingredients": [
        "4 large dried guajillo chiles or dried New Mexico chiles, stemmed, seeded",
        "5 tablespoons olive oil, divided",
        "4 skinless boneless chicken breast halves",
        "3 cups thinly sliced romaine hearts",
        "1 cup thinly sliced red onion",
        "1 7-ounce can pickled sliced jalapeños (jalapeños en escabèche), drained, 1/4 cup juice reserved",
        "4 6- to 7-inch-long French baguette pieces, halved horizontally, toasted",
        "8 ounces Cotija or feta cheese, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Chicken",
        "Quick & Easy",
        "High Fiber",
        "Hot Pepper",
        "Tailgating",
        "Poker/Game Night",
        "Pan-Fry",
        "Jalapeño",
        "Lettuce",
        "Sandwich Theory",
        "Picnic"
    ],
    "title": "Chicken Sandwiches with Chiles, Cheese and Romaine Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-sandwiches-with-chiles-cheese-and-romaine-slaw-350089"
}
