{
    "directions": [
        "Season beef with a pinch of salt and black pepper. Heat vegetable oil in a heavy pot over high heat. Cook and stir beef in hot oil until browned, 5 to 8 minutes.",
        "Stir garlic, vinegar, oregano, 1 1/2 teaspoons salt, thyme, rosemary, 1 teaspoon black pepper, bay leaf, and red pepper flakes into beef. Pour enough chicken broth into beef mixture to cover the meat by 1 inch and bring to a simmer.",
        "Cover pot with a lid, reduce heat to low, and simmer until meat is fork-tender, 1 to 1 1/2 hours.",
        "Transfer meat with a strainer or slotted spoon to a separate pot; pour about 1/4 cup of meat broth into pot. Use a wooden spoon to gently break meat into smaller chunks. Cover pot with a lid or aluminum foil and keep warm.",
        "Skim excess grease from top of broth remaining in the first pot; season with salt and pepper to taste. Cover pot with a lid or aluminum foil and keep broth warm.",
        "Lay halves of a roll out on a work surface and spoon 2 to 3 tablespoons meat broth over each half. Top bottom half of roll with a generous portion of meat and a spoonful of pickled vegetables. Place tops on sandwich. Repeat with remaining buns, broth, meat, and pickled vegetables to make 3 more sandwiches.",
        "Spoon hot meat broth into ramekins and top each ramekin with 1/2 teaspoon parsley. Serve sandwiches with hot broth for dipping."
    ],
    "ingredients": [
        "1 1/2 pounds boneless beef chuck, cut into 2-inch pieces",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "6 cloves garlic, sliced",
        "2 tablespoons white vinegar",
        "1 tablespoon dried oregano",
        "1 1/2 teaspoons salt, or to taste",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1 teaspoon freshly ground black pepper",
        "1 bay leaf",
        "1/4 teaspoon red pepper flakes, or to taste",
        "3 cups chicken broth, or as needed",
        "4 ciabatta rolls, sliced in half",
        "1 cup chopped giardiniera (pickled Italian vegetables)",
        "2 teaspoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicago-Inspired Italian Beef Sandwich",
    "url": "http://allrecipes.com/recipe/236322/chicago-inspired-italian-beef-sandwic/"
}
