{
    "directions": [
        "Lightly oil an 8- by 4-inch loaf pan (6-cup capacity) and line with parchment paper, leaving a 2-inch overhang at each end.",
        "Whisk together water, chickpea flour, sea salt, and 2 tablespoons oil in a 2 1/2- to 3-quart heavy saucepan until smooth, then cook over moderate heat, stirring constantly with a wooden spoon (to prevent lumps from forming), until very thick and mixture pulls away from side of pan, 20 to 25 minutes. Transfer mixture to loaf pan, smoothing top. Cool, uncovered, then chill, surface of mixture covered with plastic wrap, until firm, at least 3 hours.",
        "Lift chickpea block out of pan using parchment and transfer to a work surface. Gently flip over block and discard parchment, then pat dry. Cut block crosswise into 1/4-inch-thick slices for panelle.",
        "Preheat oven to 300°F.",
        "Heat 1/2 inch oil (about 2 cups) in a deep 10-inch heavy skillet until it registers 375°F on thermometer, then fry panelle in 5 batches, carefully turning occasionally with tongs, until golden and puffed, 3 to 5 minutes per batch, and transfer to paper towels to drain. Keep warm on a baking sheet in oven while frying remaining batches.",
        "Arrange panelle on a platter and sprinkle with parsley and cheese. Serve immediately."
    ],
    "ingredients": [
        "3 cups water",
        "2 cups chickpea flour (see note)",
        "1 teaspoon coarse sea salt (preferably Sicilian)",
        "2 1/4 to 2 1/2 cups olive oil",
        "1/4 cup chopped fresh flat-leaf parsley",
        "2 tablespoons finely grated Parmigiano-Reggiano",
        "Parchment paper; a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Appetizer",
        "Fry",
        "Cocktail Party",
        "Vegetarian",
        "Chickpea",
        "Chill",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chickpea Fritters (_Panelle_)",
    "url": "http://www.epicurious.com/recipes/food/views/chickpea-fritters-231982"
}
