{
    "directions": [
        "For the marinade: In a blender, combine the olive oil, chili powder, Worcestershire, cumin, red pepper flakes, garlic and lime juice. Next add the sugar, salt and pepper and blend the marinade until it's totally combined and smooth.",
        "For the meat: Place the chicken and beef in separate 2-quart baking dishes or large resealable plastic storage bags. Pour the marinade over the chicken and beef and rub the marinade all over the meat. Give your hands a good wash, and then cover the dishes with plastic wrap and let them marinate in the fridge for 4 to 6 hours.",
        "For the pico de gallo: Chop the tomatoes, jalapenos and onion into a very small dice. (Leave the seeds in your jalapenos for a hotter pico. Adjust the amount of jalapenos to your preferred temperature.) Next, chop up a nice-sized bunch of cilantro. Just remove and discard the long leafless stems before chopping. No need to remove the leaves from the stems completely. Place all of these ingredients together in a bowl and give it a good stir. Squeeze the juice of half a lime into the bowl. Add salt to taste and stir again.",
        "For the fajita vegetables: Throw the onions and bell peppers into a bowl and toss with the olive oil and some salt and pepper.",
        "When ready to cook, preheat the grill to high heat.",
        "Cook the chicken on both sides until completely cooked through (or to an internal temperature of 165 degrees F), about 4 minutes per side. Remove it to a platter to rest for 5 to 10 minutes.",
        "Grill the beef on both sides until completely cooked through, about 5 minutes in total. Remove it to a platter to rest for 5 to 10 minutes.",
        "Tip the fajita vegetables into a grill basket and grill until cooked, tossing occasionally, about 10 minutes.",
        "To put it all together: Pile the veggies on a platter. Slice the chicken and beef.",
        "For the fixins: Wrap the tortillas in foil and warm through on the grill. Serve the chicken, beef and veggies with the warm tortillas, Fiesta Beans, grated cheese, sour cream, lime wedges and pico de gallo.",
        "Place the beans in a large bowl and cover them with cold water. Set them aside and let them soak for 5 to 6 hours or overnight.",
        "Drain and rinse the beans, and then place them in a large pot. Add the garlic, green, orange and red bell peppers and the onions. Cover them with about an inch of water, and then add the ham hock or bacon. Next add the chili powder, cumin, salt and pepper. Stir to combine, and then bring the mixture to a boil. Reduce the heat to low and simmer the beans until tender, about 2 hours. Check the liquid level about halfway through the cooking process; if you'd prefer the beans to be less soupy, you can ladle off about a third of the cooking liquid."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "1/4 cup chili powder",
        "3 tablespoons Worcestershire sauce",
        "1 tablespoon ground cumin",
        "1/2 teaspoon red pepper flakes",
        "3 cloves garlic, minced",
        "Juice of 3 limes",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "3 pounds boneless, skinless chicken breasts",
        "3 pounds skirt steak",
        "5 plum (Roma) tomatoes",
        "3 jalapeno peppers",
        "1/2 large (or 1 small) onion",
        "1 bunch fresh cilantro",
        "1/2 lime",
        "Salt",
        "2 medium onions, halved and sliced",
        "1 green bell pepper, seeded and sliced into strips",
        "1 orange bell pepper, seeded and sliced into strips",
        "1 red bell pepper, seeded and sliced into strips",
        "1 yellow bell pepper, seeded and sliced into strips",
        "2 tablespoons olive oil",
        "Salt and freshly ground black pepper",
        "30 to 40 flour tortillas",
        "Fiesta Beans, recipe follows",
        "1 pound grated Cheddar cheese",
        "One 8-ounce container sour cream",
        "5 limes, sliced into wedges",
        "2 pounds dried pinto beans",
        "6 cloves garlic, minced",
        "2 green bell peppers, seeded and diced",
        "2 orange bell peppers, seeded and diced",
        "2 red bell peppers, seeded and diced",
        "1 onion, diced",
        "1 ham hock (or 6 slices thick-cut bacon, cut into pieces)",
        "1 tablespoon chili powder",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "1 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Chicken",
        "Chicken",
        "Grilling",
        "Poultry Recipes",
        "Fajita Recipes",
        "Beef",
        "Meat",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Chicken and Beef Fajitas",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-and-beef-fajitas"
}
