{
    "directions": [
        "Preheat the oven to 425°F.",
        "In a large bowl, toss the rutabaga and sweet potato with 2 tablespoons of the oil and season with salt and pepper. Spread evenly over a baking sheet (or divide it between two baking sheets if needed) and roast for 25 to 30 minutes, until tender.",
        "Meanwhile, toss the pearl onions with the vinegar and 1/2 teaspoon of the remaining oil and season with salt and pepper. Spread the onions evenly over a baking sheet and roast for 12 to 15 minutes, until tender.",
        "Put the remaining 1/2 tablespoon oil in a medium skillet over medium heat. Add the mushrooms and sauté until tender, 5 to 7 minutes, then add the kale and wilt it slightly, about 2 minutes. Remove all the vegetables from the pans into one large bowl, and set aside.",
        "Dust the chicken lightly with flour and season with salt and pepper. Place a large cast-iron skillet over a medium heat and add the oil. Pan-fry the chicken until browned and cooked through, about 30 minutes, turning occasionally and adjust the heat as needed.",
        "Reduce the heat and add the butter. Add the thyme, rosemary, and garlic and sauté until the garlic is browned and aromatic, 4 to 6 minutes. Slowly pour in the flour, whisking constantly to form a paste and taking care not to let it burn, about 2 minutes. Slowly pour in the warm chicken stock, whisking until the mixture is smooth and slightly thickened, about 3 minutes. Season with salt and pepper, remove the herbs and garlic, set aside.",
        "In a large bowl, whisk together the flour, cornmeal, and salt. Toss in the butter and place in the freezer for 1 hour. Transfer to a food processor and pulse until the butter is the size of small peas. Still pulsing, drip in ice water until the mixture begins to cling together; do not overprocess. Remove and shape the dough into a disk. Wrap the dough in plastic wrap and let it rest in the refrigerator for at least 6 hours or overnight.",
        "Remove the dough from the refrigerator. Lightly flour a work surface, and roll dough to 1/4 inch thickness, tracing the outline of your baking dish on a piece of parchment paper and trimming the dough 1/2 inch smaller than the outline. (This is not a sealed potpie; the partially prebaked crust will not completely cover the dish, which lets the filling bubble up along the sides.) Score the dough, place it in the freezer, and chill for 1 hour.",
        "Preheat the oven to 350°F.",
        "Cut each thigh into 6 pieces and add the chicken to the vegetable mixture along with the pan gravy, stirring to combine. Transfer the mixture to a 10-inch round baking dish.",
        "With the dough still on the parchment paper, transfer to a cookie sheet and bake for 15–20 minutes, rotating the crust every 5 minutes so it browns evenly, until the crust begins to crisp and becomes lightly browned. Remove the crust from the pan and place it on top of the chicken and vegetable mixture. Return to the oven and bake until hot and bubbly, 15 to 20 minutes. Cool slightly and serve."
    ],
    "ingredients": [
        "1 large rutabaga, peeled and diced",
        "1 large sweet potato, peeled and diced",
        "3 tablespoons olive oil",
        "Kosher salt and freshly ground black pepper",
        "1 cup pearl onions",
        "1 tablespoon balsamic vinegar",
        "3/4 cup oyster mushrooms, torn into pieces",
        "1 cup chopped kale (about 5 large leaves)",
        "4 large boneless skin-on chicken thighs",
        "1 tablespoon all-purpose flour",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon canola oil",
        "1 tablespoon unsalted butter",
        "1 sprig fresh thyme",
        "1 sprig fresh rosemary",
        "2 whole garlic cloves, peeled and crushed with the side of a knife",
        "2 cups warm chicken stock",
        "1 1/4 cups all-purpose flour",
        "1/4 cup fine-ground cornmeal",
        "1 teaspoon kosher salt",
        "1/2 cup (1 stick) unsalted butter, diced",
        "6 tablespoons ice water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Mushroom",
        "Kid-Friendly",
        "Cornmeal",
        "Kale",
        "Sweet Potato/Yam",
        "Rutabaga",
        "HarperCollins"
    ],
    "title": "Chicken Thigh Potpie",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-thigh-potpie-56390147"
}
