{
    "directions": [
        "Fill large bowl with water. Squeeze juice from 1 lemon into water; add lemon halves. Tear outer leaves from 1 artichoke until only pale green leaves remain. Cut top 3/4 inch from top; trim end of stem. Cut in half lengthwise. Rub cut sides of artichoke with lemon half; transfer to bowl with lemon water. Repeat with remaining artichokes.",
        "Bring 6 cups water, 2 tablespoons flour, 2 teaspoons salt, and bay leaf to boil in large saucepan. Add artichoke halves and cook until just tender, about 5 minutes. Drain.",
        "Melt butter with oil in heavy large deep skillet over medium heat. Sprinkle chicken with salt and pepper. Dredge chicken in flour, shaking off excess. Cook chicken until golden brown, about 4 minutes per side. Transfer chicken to plate. Add mushrooms, carrots, and shallots to skillet. Sprinkle with salt and pepper. Sauté until vegetables begin to soften, about 4 minutes. Add 1 tablespoon thyme and garlic; sauté 1 minute. Add wine; bring to boil. Add broth and artichokes; bring to boil.",
        "Return chicken to skillet, reduce heat to medium low, cover, and simmer 20 minutes. Turn chicken, cover, and simmer until cooked through, about 15 minutes longer. Transfer chicken and vegetables to platter. Whisk crème fraîche into sauce in skillet; bring to boil. Season with salt and pepper. Pour sauce over chicken, sprinkle with remaining 1 tablespoon thyme, and serve."
    ],
    "ingredients": [
        "1 1/2 lemons",
        "12 baby artichokes",
        "6 cups water",
        "2 tablespoons all purpose flour plus additional for dredging",
        "2 teaspoons salt",
        "1 bay leaf",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "4 chicken thighs",
        "4 chicken drumsticks",
        "4 ounces fresh morel mushrooms",
        "2 medium carrots, peeled, thinly sliced",
        "2 large shallots, thinly sliced",
        "2 tablespoons chopped fresh thyme, divided",
        "1 garlic clove, minced",
        "1/4 cup dry white wine",
        "1/2 cup low-salt chicken broth",
        "1/4 cup crème fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Chicken",
        "Dairy",
        "Garlic",
        "Herb",
        "Mushroom",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Artichoke",
        "Spring",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken and Artichoke Fricassée with Morel Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-artichoke-fricassee-with-morel-mushrooms-237905"
}
