{
    "directions": [
        "Preheat grill for medium heat and lightly oil the grate.",
        "Place chicken between 2 sheets of heavy plastic on a work surface. Firmly pound chicken with the smooth side of a meat mallet to a 1/2-inch thickness.",
        "Cook chicken breasts on preheated grill until no longer pink in the center and the juices run clear, 2 to 3 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Shred chicken; season with seasoned salt.",
        "Heat olive oil and butter in a skillet over medium heat. Add onion, bell pepper, and mushrooms; cook and stir until browned, 5 to 7 minutes. Stir in chicken; cook until heated through.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler, or preheat a toaster oven.",
        "Spread chicken mixture on the bottom half of each hoagie roll. Lay 2 pieces of provolone cheese side-by-side over chicken mixture.",
        "Place hoagie rolls under broiler or in toaster oven and cook until provolone cheese is melted and bread is crunchy, 2 to 3 minutes.",
        "Spread 1 teaspoon mayonnaise on top half of each hoagie roll. Top each half with 2 tomato slices and 1/2 of the lettuce. Fold halves together and roll each hoagie tightly in foil, using a knife to push any filling back inside. Set aside for flavors to blend, 1 to 2 minutes."
    ],
    "ingredients": [
        "2 skinless, boneless chicken breast halves",
        "1 teaspoon seasoned salt",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1/2 large onion, sliced",
        "1/2 green bell pepper, sliced",
        "2 fresh mushrooms, sliced",
        "2 fresh hoagie rolls, split lengthwise",
        "4 slices provolone cheese",
        "2 teaspoons mayonnaise, or to taste",
        "4 slices tomato, or to taste",
        "4 leaves lettuce, shredded, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Cheese Steak",
    "url": "http://allrecipes.com/recipe/246298/chicken-cheese-steak/"
}
