{
    "directions": [
        "1. Pour 12 cups of cold water into a large stockpot, and throw in the chicken parts and celery. Bring to a boil. While water is heating, rub the inside of the whole chicken with salt.",
        "2. Add the chicken to the pot, cover, reduce heat, and simmer for 30 minutes. Test chicken with a fork to see if it's tender and fully cooked; then remove it from the pot, and set aside on a large platter. Leave chicken parts in the pot.",
        "3. Add onion, carrot, parsnip, salt, and pepper. Let soup simmer for 1 hour and 15 minutes.",
        "4. When chicken cools, remove skin and bones and cut into bite-sized pieces. You can add it to the soup, just before serving, or save it for chicken salad.",
        "5. Strain the soup, and discard everything solid except for the carrot.",
        "6. Drop in the dill for a minute before serving and remove. Add salt and pepper to taste. Slice carrot and toss into soup. Also add the chicken pieces if desired. Other options: Add cooked noodles, rice, kasha, or matzo balls."
    ],
    "ingredients": [
        "1 pound chicken parts",
        "2 stalks celery, including leafy tops, cut into 3-inch pieces",
        "1 whole chicken, thoroughly rinsed",
        "Salt to rub inside chicken",
        "1 large whole onion, unpeeled (find one with a firm, golden-brown peel)",
        "1 large whole carrot, peeled",
        "1 medium whole parsnip, peeled",
        "2 teaspoons salt",
        "1/4 teaspoon pepper",
        "1 bunch of dill, cleaned and tied with a string",
        "Note: The Deli's recipe calls for both a whole chicken plus 1 pound of chicken parts. You can, however, use just 1 large chicken and cut off both wings, the neck, and a leg to use as parts."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Poultry",
        "Vegetable",
        "Passover",
        "Low/No Sugar",
        "Carrot",
        "Parsnip",
        "Spring",
        "Kosher",
        "Dill",
        "Simmer"
    ],
    "title": "Chicken Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-soup-108014"
}
