{
    "directions": [
        "1. Simmer the potato in a small pot of salted water until just tender, 8 to 10 minutes, then drain and set aside.",
        "2. Heat the oil in a large skillet over medium heat. When it shimmers, add the onion and cook, stirring occasionally, until translucent, 2 to 3 minutes. Add the carrot, celery, and raw chicken, season with salt and pepper to taste, and raise the heat to medium-high. Cook until the vegetables are softened and the chicken is just about cooked, 3 to 5 minutes.",
        "3. Sprinkle the flour over everything, stir, and cook for 1 minute. Add the broth, thyme, and reserved potatoes, and simmer for 2 minutes more. Transfer the mixture to a bowl and refrigerate until cool, 15 to 30 minutes. Remove the pie crusts from the refrigerator so they can soften slightly.",
        "4. When the filling is cool, preheat oven to 425°F and set the racks in the upper and lower thirds of oven. Grease or line two baking sheets.",
        "5. On a lightly floured work surface, roll out 1 pie crust into a rough rectangle (don't roll it too thin or the handpies will fall apart). Use a sharp knife or pizza cutter to square off the rounded edges, then cut the dough into 4 equal pieces.",
        "6. Place about 1/4 cup of filling slightly off-center on 1 piece of dough, then fold the dough over to form a rectangle. Crimp the edges together with a fork, and prick the top a few times for steam to escape. Carefully transfer pie to the prepared baking sheets. Repeat with remaining pie crust and filling.",
        "7. Brush each pie lightly with the egg wash, then bake until golden brown, 20 to 25 minutes."
    ],
    "ingredients": [
        "1 medium potato, peeled and chopped into 1/4 inch pieces\nSubstitute 1/2 cup thawed frozen corn kernels here, if you prefer. Add with the carrot and celery in Step 2.",
        "1 tablespoon vegetable oil",
        "1 small onion, finely chopped",
        "1 carrot, quartered lengthwise and chopped",
        "1 celery rib, halved lengthwise and chopped",
        "4 ounces boneless, skinless chicken breast or thighs, chopped\nGot some cooked chicken? Add it with the potatoes in step 3 instead.",
        "Salt and pepper",
        "1 tablespoon all-purpose flour",
        "1/2 cup chicken broth",
        "1/2 teaspoon fresh thyme leaves",
        "2 unbaked pie crusts, either store bought or homemade (not pie shells)",
        "1 egg, beaten with 1 tablespoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Bake",
        "Sauté",
        "Kid-Friendly",
        "Dinner",
        "Chill",
        "Advance Prep Required",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken (Pot) Handpies",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-pot-handpies-51100030"
}
