{
    "directions": [
        "Dredge chicken parts in seasoned flour, shaking off excess, and put on a rack.",
        "In a large heavy kettle melt butter with oil over moderately high heat until foam subsides and brown chicken in batches (do not crowd), transferring it to a plate as done, about 5 minutes on each side.",
        "Stir in leeks and shallots and cook 3 minutes, scraping the bottom and stirring occasionally. Stir in carrots, celery, bay leaf, and thyme and cook 3 minutes. Stir in broth, cider, and chicken and bring liquid to a boil. Reduce heat and simmer, covered partially, until chicken is cooked through, 10 to 15 minutes.",
        "Into a bowl sift together flour, cornmeal, baking powder, and salt and stir in dill. With a fork stir in half-and-half until dough is just blended.",
        "With a large soup spoon scoop out 12 dumplings and arrange over chicken mixture. Simmer chicken and dumplings, covered, 9 minutes. Sprinkle in peas and cook until dumplings are done, about 3 minutes more. (Dumplings are done when a wooden pick inserted in center comes out clean.) Discard bay leaf."
    ],
    "ingredients": [
        "4 pounds chicken parts",
        "1 cup all-purpose flour, seasoned with salt and pepper",
        "2 tablespoons unsalted butter",
        "1 tablespoon vegetable oil",
        "6 leeks (white and pale green parts only), sliced thin crosswise and washed thoroughly (about 2 cups)",
        "6 shallots, sliced thin (about 1 cup)",
        "6 carrots, peeled, halved lengthwise, and sliced",
        "2 celery ribs with leaves, sliced",
        "1 small bay leaf",
        "1/2 teaspoon dried thyme, crumbled",
        "3 1/2 cups low-salt chicken broth",
        "1/2 cup apple cider or juice",
        "1 1/2 cups all-purpose flour",
        "1/2 cup yellow cornmeal",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "2 tablespoons minced fresh dill",
        "1 cup plus 3 tablespoons half-and-half",
        "1 cup green peas, defrosted if frozen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dairy",
        "Onion",
        "Braise",
        "Kid-Friendly",
        "Leek",
        "Pea",
        "Carrot",
        "Winter",
        "Shallot",
        "Gourmet"
    ],
    "title": "Chicken and Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-dumplings-11622"
}
