{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with olive oil or non-stick cooking spray.",
        "Prepare the croutons by spreading bread cubes over prepared baking sheet. Lightly spray cubes with oil or cooking spray and bake for 20 minutes or until golden brown. Remove from oven and cool.",
        "Prepare the dressing by whisking together the sour cream, mayonnaise, lemon juice, mustard, honey, rosemary, salt and pepper. Cover and refrigerate until ready to serve.",
        "Prepare the salad by placing the chicken in a pan and cover with water. Bring just to a boil, cover and reduce the heat to medium-low. Cook 10 minutes, or until chicken is cooked through.  Remove from heat, drain and cool; dice or pull into shreds.",
        "Combine the chicken with the celery, raisins and lemon peel.",
        "When ready to serve, stir together the lemon juice and olive oil. Tear the lettuce into small pieces and toss with the lemon and oil mixture.  Divide between plates and top with the chicken salad. Garnish with onion rings, a sprinkling of pine nuts and the croutons."
    ],
    "ingredients": [
        "1 1/2 cups cubed French bread",
        "1/2 cup sour cream",
        "1/3 cup mayonnaise",
        "2 tablespoons lemon juice",
        "2 teaspoons Dijon-style prepared mustard",
        "2 teaspoons honey",
        "1 tablespoon chopped fresh rosemary",
        "1/8 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 pound skinless, boneless chicken breasts",
        "2 stalks celery, chopped",
        "1/3 cup golden raisins",
        "1 tablespoon lemon zest",
        "6 leaves romaine lettuce",
        "6 leaves Radicchio, raw",
        "2 teaspoons lemon juice",
        "1 teaspoon olive oil",
        "3 slices red onion",
        "1/3 cup pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Salad With Pine Nuts and Raisins",
    "url": "http://allrecipes.com/recipe/16103/chicken-salad-with-pine-nuts-and-rais/"
}
