{
    "directions": [
        "In a 4- to 5-quart heavy kettle combine water, broth, chicken breast and leg, peppercorns, and bay leaf and bring to a boil. Simmer mixture, covered, until breast is just cooked through, about 12 minutes, and transfer breast with tongs to a bowl. Simmer mixture 5 minutes more, or until leg is just cooked through, and transfer leg with tongs to bowl. When chicken is cool enough to handle, remove meat in large pieces, discarding skin and bones, and put in a large bowl. Pour broth through a fine sieve into a bowl and return to cleaned kettle. Trim fennel stalks flush with bulbs, discarding stalks, and halve bulbs lengthwise. Thinly slice fennel crosswise and cut carrots into 1/2-inch-thick slices. Peel potato and cut into 1/2-inch cubes. Thinly slice onion. Simmer vegetables in broth until just tender, 8 to 10 minutes, and with a slotted spoon add to chicken. Measure out 2 cups stock and reserve remainder for another use. Mince garlic and finely chop parsley. Add garlic, parsley, and fennel seeds to chicken mixture.",
        "In a heavy saucepan melt butter over moderately low heat and stir in flour. Cook roux, stirring, 3 minutes and whisk in 2 cups stock in a stream. Bring mixture to a boil, whisking, and simmer sauce, whisking, 5 minutes. Season sauce with salt and pepper and pour over chicken mixture, stirring gently to combine. Filling may be made 1 day ahead and cooled completely before being chilled, covered. Reheat filling before proceeding. Spoon filling into a 12-inch (10-cup) round baking dish.",
        "Preheat oven to 450°F.",
        "Chop bacon and in a heavy skillet cook over moderate heat, stirring, until crisp. Transfer bacon with a slotted spoon to paper towels to drain, reserving 1 tablespoon bacon fat, and mince.",
        "Into a bowl sift together flour, baking powder, and salt. Add cream, bacon, and reserved fat and with a fork stir until mixture just forms a dough. Gather dough into a ball and on a lightly floured surface with a floured rolling pin roll out into a 12 1/2-inch round (about 1/2 inch thick). Trim dough to create a 12-inch round and with a large knife cut dough into 12 wedges. Arrange wedges on filling in overlapping pairs. In a small bowl whisk together yolk and milk and lightly brush onto crust.",
        "Bake pie in middle of oven until crust is puffed and golden and filling is bubbling, 20 to 25 minutes. Serve pie warm."
    ],
    "ingredients": [
        "4 cups water",
        "1 3/4 cups chicken broth",
        "1 large whole chicken breast (about 1 pound)",
        "1 chicken leg (about 1/2 pound)",
        "1 teaspoon black peppercorns",
        "1 bay leaf",
        "2 small fennel bulbs (sometimes called anise; about 1 pound)",
        "3 carrots",
        "1 medium boiling potato",
        "1 medium onion",
        "2 garlic cloves",
        "1/2 cup packed fresh flat-leafed parsley leaves",
        "3/4 teaspoon fennel seeds",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup all-purpose flour",
        "6 bacon slices",
        "2 3/4 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1 1/3 cups heavy cream",
        "1 large egg yolk",
        "1 tablespoon whole milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Vegetable",
        "Bake",
        "Bacon",
        "Fennel",
        "Winter",
        "Potluck",
        "Simmer",
        "Gourmet"
    ],
    "title": "Chicken and Fennel Pie with Bacon-Biscuit Crust",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-fennel-pie-with-bacon-biscuit-crust-15721"
}
