{
    "directions": [
        "1. Combine all the ingredients except the wine in a large bowl and freeze for 20 to 30 minutes. Measure the wine and put that in the freezer too. If your grinder attachment is metal, freeze that as well, and also your mixing bowl. Set up your grinder, remove the chicken mixture from the freezer, and grind it through a small or medium die into the freezing-cold mixing bowl. Return the meat to the freezer for 10 minutes and set up your stand mixer.",
        "2. Remove the sausage mixture from the freezer and mix it with the paddle attachment on medium high for 60 seconds or so, adding the very cold white wine as you do. Paddling will distribute the seasonings and give the sausage a good bind help hold together rather then crumble. In order to be sure the seasoning is right, fry a small portion of the sausage (put the mixing bowl in the fridge while you cook the test piece). Taste the test piece. If you think the mix needs more salt, pepper, sage or ginger add it and repaddle it. You can do this as often as you like till you get the seasoning just so.",
        "3. Wrap the sausage in plastic wrap in the shape of a cylinder, about 2-1/2 inches/7.5 centimeters in diameter. Put the wrapped sausage in a plastic bag. It will last a good week in the fridge (thanks to the salt); it can be frozen for 3 months (the longer you freeze it, though, the more chance it has of getting freezer burn or picking up unpleasant freezer odors, so label the bag with the date and don't forget about it)."
    ],
    "ingredients": [
        "1 1/2 pound/675 grams chicken thigh meat, diced and thoroughly chilled",
        "225 grams schmaltz, frozen (or a scant cup if you don't have a scale, but shame on you)",
        "1 tablespoon/10-12 grams kosher salt",
        "3/4 cup roughly chopped fresh sage",
        "2 large garlic cloves, finely minced",
        "2 tablespoons finely chopped ginger",
        "1 teaspoon freshly ground pepper",
        "1/2 cup/120 milliliters dry white wine, chilled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chicken",
        "Passover",
        "White Wine",
        "Sage"
    ],
    "title": "Chicken Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-sausage-51150210"
}
