{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Lay the chicken breast between 2 pieces of plastic wrap. Using the flat side of a meat mallet, gently pound the chicken to 1/4-inch thickness. Remove the top sheet of plastic and lay 2 slices of prosciutto neatly over the top to cover the breast and sprinkle a quarter of the cheese over the prosciutto. Tuck in the sides of the breast and roll up tight like a jellyroll inside the plastic wrap. Squeeze the log gently to seal and twist both ends tight to form a nice log. Repeat with remaining chicken.",
        "Season the flour with salt and pepper. Mix the bread crumbs with thyme, garlic and kosher salt, pepper, and melted butter. The butter will help the crust brown. Beat together the eggs and season so the flour, the eggs and the crumbs are all seasoned.",
        "Remove the plastic wrap. Lightly dust the chicken with flour, dip in the egg mixture and gently coat in the bread crumbs. Lightly coat a baking pan with olive oil and carefully transfer the roulades onto it. Bake for 20 to 25 minutes until browned and cooked through.",
        "Cut into pinwheels and serve on top of Brussels Sprout Hash with Chicken Jus and Cranberry Chutney, if desired."
    ],
    "ingredients": [
        "4 chicken breasts skinless and boneless",
        "4 thin slices prosciutto di Parma",
        "1/2 pound Gruyere, grated",
        "1/4 cup all-purpose flour",
        "Kosher salt and freshly ground black pepper",
        "1 cup panko bread crumbs",
        "4 sprigs fresh thyme, leaves only",
        "1 clove garlic, peeled and finely minced",
        "2 tablespoons unsalted butter, melted",
        "2 eggs",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Cordon Bleu",
        "Egg Recipes",
        "Cheese",
        "Gruyere Recipes",
        "Chicken",
        "Poultry Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Chicken Cordon Bleu",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/chicken-cordon-bleu-recipe2"
}
