{
    "directions": [
        "Preheat the oven to 400 degrees F. Spray a rimmed baking sheet with cooking spray.",
        "Pour the flour onto a dinner plate. In a shallow bowl, whisk together the milk, egg and a few dashes of hot sauce. Place the cornflakes, seasoned with 1 teaspoon of House Seasoning, on a second dinner plate.",
        "Season the steaks with the remaining teaspoon of House Seasoning. Dredge them in the flour, patting off any excess, then dip into the egg mixture, letting any excess drip off. Finally, dredge them in the crushed cornflakes, pressing lightly to help the flakes adhere.",
        "Place the steaks on the prepared baking sheet. Spray the tops of the steaks lightly with extra cooking spray. Bake until cooked through, about 15 minutes.",
        "Meanwhile, in a small cup, mix the cornstarch with 1 tablespoon of the beef broth and stir until the cornstarch is dissolved. In a small saucepan, combine the cornstarch mixture with the remaining beef broth and the half-and-half. Bring to a boil over medium-high heat, stirring frequently. Let the gravy boil, stirring constantly, until thickened, about 2 minutes. Season generously with pepper and serve the steaks smothered in the gravy.",
        "The Lady's House Seasoning: Combine 1 cup salt, 1/4 cup freshly ground black pepper and 1/4 cup garlic powder. Store in an airtight container for up to 6 months.",
        "Store in an airtight container for up to 6 months.",
        "Photograph by Kat Teutsch"
    ],
    "ingredients": [
        "Cooking spray",
        "1/4 cup all-purpose flour",
        "1/4 cup 1 percent milk",
        "1 large egg, lightly beaten",
        "Hot sauce, to taste",
        "3 cups cornflakes, crushed",
        "2 teaspoons The Lady's House Seasoning (see below)",
        "4 cube steaks (4 ounces each)",
        "1 tablespoon cornstarch",
        "1/2 cup low-sodium beef broth",
        "1/4 cup fat-free half-and-half (or use low-fat)",
        "Freshly ground black pepper, to taste",
        "Combine 1 cup salt",
        "1/4 cup freshly ground black pepper and 1/4 cup garlic powder"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Gravy",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Chicken-Fried Steak With Cream Gravy",
    "url": "http://www.foodnetwork.com/recipes/bobby-deen/chicken-fried-steak-with-cream-gravy-recipe"
}
