{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Melt butter in a saucepan over medium heat; stir cream cheese into hot butter until it begins to melt, about 5 minutes. Season with salt, onion powder, and black pepper. Whisk warm milk gradually into cream cheese until smooth; stir in 1 1/2 cup Swiss cheese. Bring sauce to a simmer, stirring constantly, until cheese has melted and sauce has thickened, 5 to 10 minutes. Remove from heat.",
        "Spread 3/4 cup of cheese sauce into bottom of a 9x9-inch baking dish. Arrange 1/3 of the lasagna noodles over the sauce and spread half the cooked chicken and half the ham over the noodles. Pour 1 cup sauce over chicken and ham. Repeat layers starting with half the remaining lasagna noodles, remaining chicken, remaining ham, and 1 more cup of cheese sauce. Finish by layering remaining lasagna noodles, remaining sauce, 1/2 cup Swiss cheese, and bread crumbs; sprinkle top with Italian seasoning. Cover dish with aluminum foil.",
        "Bake in the preheated oven until casserole is bubbling, about 25 minutes. Remove foil and continue to bake until crumbs are browned, about 10 more minutes. Let casserole stand 5 to 10 minutes before serving."
    ],
    "ingredients": [
        "1 (8 ounce) package lasagna noodles",
        "1/2 cup butter",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 teaspoon salt",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon ground black pepper",
        "1 1/2 cups shredded Swiss cheese",
        "1 3/4 cups warm milk",
        "2 1/2 cups cooked chicken, chopped",
        "8 ounces deli ham, chopped",
        "1/2 cup shredded Swiss cheese",
        "1/2 cup bread crumbs",
        "1 pinch Italian seasoning, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Cordon Bleu Lasagna",
    "url": "http://allrecipes.com/recipe/230779/chicken-cordon-bleu-lasagna/"
}
