{
    "directions": [
        "In a large bowl, stir together the yogurt, 2 tsp. of the ginger, half of the garlic and 1 tsp. of the garam masala. Season well with salt and pepper. Add the chicken to the bowl and toss to coat thoroughly. Cover and let marinate in the refrigerator for 30 minutes.",
        "Preheat a broiler. Coat a baking sheet lightly with cooking spray. Remove the chicken from the marinade and arrange in a single layer on the prepared pan. (Discard the marinade.) Slip under the broiler about 3 inches (7.5 cm) from the heat source and broil until the chicken is opaque throughout and has blackened spots in several places, about 8 minutes. Set aside.",
        "Meanwhile, make the masala sauce: In a large saucepan over medium-high heat, warm the olive oil. Add the onion and sauté until translucent, about 5 minutes. Add the remaining 2 tsp. ginger and the remaining garlic and sauté just until soft, about 1 minute. Add the remaining 1 tsp. garam masala, the chili powder and paprika, and season with salt and pepper. Cook, stirring constantly, just long enough to toast the spices, about 1 minute. Add the tomatoes with their juices, tomato paste and cream and bring to a simmer, stirring to mix well. Add the chicken and peas, nestle them in the sauce and return to a simmer. Cook gently just until the chicken and peas are warmed through, about 5 minutes. Taste and adjust the seasoning with salt and pepper. Garnish with cilantro and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Chicken Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "1/2 cup (4 oz./125 g) plain whole-milk yogurt",
        "4 tsp. peeled and grated fresh ginger",
        "4 garlic cloves, minced",
        "2 tsp. garam masala",
        "Kosher salt and freshly ground pepper",
        "3 boneless, skinless chicken breasts, about 1 1/2 lb. (750 g) total",
        "2 Tbs. olive oil",
        "1/2 yellow onion, thinly sliced",
        "1/2 tsp. chili powder",
        "1/4 tsp. paprika",
        "1 can (14 1/2 oz./455 g) chopped tomatoes",
        "2 tsp. tomato paste",
        "1/2 cup (4 fl. oz./125 ml) heavy cream",
        "1/4 cup (1 1/2 oz./45 g) thawed frozen peas",
        "Chopped fresh cilantro for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chicken Tikka Masala",
    "url": "http://www.williams-sonoma.com/recipe/chicken-tikka-masala.html"
}
