{
    "directions": [
        "Preheat the oven to 400 degrees F. Bring 1 1/2 cups water to a boil in a pot and season with salt. Add the cauliflower, cover and steam until just tender, 7 to 8 minutes. Drain and cut into florets. Meanwhile, bring another pot of salted water to a boil and cook the noodles to just shy of al dente, about 5 minutes. Drain. Heat 4 tablespoons butter in a large skillet over medium heat. Add the mushrooms and cook until tender and browned. Add the garlic and shallots and cook, stirring, for 2 to 3 minutes. Add the flour and cook, whisking, for 1 minute. Deglaze with the sherry, stirring and scraping up any browned bits with a wooden spoon. Whisk in the chicken stock and bring to a boil. Reduce the heat to a simmer and cook for a few minutes, then stir in the heavy cream. Season with salt, pepper and a few grates of nutmeg. Combine the cauliflower, noodles, chicken and sauce. Transfer to a casserole dish. Melt the remaining 4 tablespoons butter in small pan, then drizzle over the panko in a bowl and toss to combine. Add the Parmigiano-Reggiano and toss. Sprinkle the breadcrumbs over the casserole. Bake until hot, bubbling and golden, 40 to 45 minutes. Sprinkle with the parsley. Divide among plates. Cook's Note: The unbaked casserole (without the breadcrumbs) can be covered and refrigerated for a make-ahead meal.",
        "Put the chicken in a very large stockpot or divide between 2 pots if necessary. Add the peppercorns, garlic, bay leaves, carrots, celery, lemons, onions and herb bundle and sprinkle with salt. Add enough water to cover the chicken. Bring to a boil, then reduce the heat to low and cook at a rolling simmer for 1 1/2 hours. Remove the chicken from the liquid and let cool. Strain the stock. (You should have 5 to 6 quarts stock.) Remove the skin and bones from the chicken, and shred the meat using your hands or 2 forks."
    ],
    "ingredients": [
        "Kosher salt",
        "1 small head cauliflower",
        "8 ounces extra-wide egg noodles",
        "1 stick (8 tablespoons) butter",
        "8 ounces assorted fresh mushrooms or white mushrooms, sliced",
        "4 cloves garlic, finely chopped",
        "1 large or 2 medium shallots, finely chopped",
        "3 tablespoons all-purpose flour",
        "1/2 cup dry sherry",
        "2 cups chicken stock",
        "1 cup heavy cream",
        "Freshly ground pepper",
        "Freshly grated nutmeg",
        "3 to 4 cups shredded Poached Chicken Breasts, recipe follows",
        "1 cup panko",
        "1 cup grated Parmigiano-Reggiano",
        "1/4 cup chopped fresh flat-leaf parsley",
        "4 whole bone-in, skin-on chicken breasts (for all white meat) or 3 whole 4-pound chickens (for a mix of white and dark meat)",
        "1 tablespoon whole black peppercorns",
        "8 cloves garlic, smashed",
        "4 large bay leaves",
        "4 carrots, coarsely chopped",
        "4 stalks celery, coarsely chopped",
        "2 lemons, sliced",
        "2 onions, quartered",
        "Herb bundle of fresh parsley, rosemary and thyme tied with kitchen string",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Casserole Recipes",
        "Casserole",
        "Easy Recipes",
        "Easy Chicken Recipes",
        "Chicken",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Chicken Casserole",
        "Mushroom",
        "Vegetable",
        "Cauliflower"
    ],
    "title": "Chicken Tetrazzini Casserole with Cauliflower",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/chicken-tetrazzini-casserole-with-cauliflower-recipe"
}
