{
    "directions": [
        "Combine first 3 ingredients in heavy large pot and bring to boil. Reduce heat to medium, cover and simmer until parsnips are tender, about 5 minutes. Using slotted spoon, transfer parsnips to small bowl. Add potatoes and apples to same pot. Cover; simmer until very tender, about 20 minutes. Remove from heat. Using slotted spoon, transfer potatoes and apples to large bowl; add 3 tablespoons butter. Mash until almost smooth. Season with salt and pepper. Pour broth mixture from pot into medium bowl; reserve pot.",
        "Sprinkle chicken with salt, pepper and 4 teaspoons thyme; dust with flour. Melt remaining 2 tablespoons butter in reserved pot over medium-high heat. Add half of chicken. Sauté until brown and cooked through, turning with tongs, about 5 minutes. Using slotted spoon, transfer sautéed chicken to 11x7x2-inch glass baking dish. Repeat with remaining chicken. Top with parsnips, remaining 2 teaspoons thyme and peas. Return broth mixture to same pot; add brandy and whipping cream. Boil over medium-high heat until sauce is reduced to 1 1/4 cups, scraping up browned bits, about 3 minutes. Season with salt and pepper. Spoon over chicken. Cover with potato-apple mixture. (Can be prepared 1 day ahead. Refrigerate until cold, then cover and keep refrigerated.)",
        "Preheat oven to 350°F. Bake casserole uncovered until potato topping is crusty and chicken filling is heated through, about 35 minutes (about 45 minutes if refrigerated)."
    ],
    "ingredients": [
        "3 cups canned low-salt chicken broth",
        "1 cup apple cider or apple juice",
        "8 ounces parsnips, peeled, cut into 1/2-inch cubes",
        "1 3/4 pounds Yukon Gold potatoes, peeled, cut into 1/2-inch cubes",
        "3/4 pound Golden Delicious apples (about 2 large), peeled, cored, cut into 1/2-inch cubes",
        "5 tablespoons butter",
        "8 skinless boneless chicken thighs, cut into 1-inch pieces",
        "6 teaspoons minced fresh thyme",
        "2 tablespoons all purpose flour",
        "1 cup frozen peas, thawed",
        "1/3 cup brandy",
        "1/3 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Potato",
        "Poultry",
        "Bake",
        "Sauté",
        "Dinner",
        "Casserole/Gratin",
        "Apple",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Normande with Mashed Apples and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-normande-with-mashed-apples-and-potatoes-103009"
}
