{
    "directions": [
        "Heat the oil in a large saucepan over medium-high heat until hot. Sprinkle the chicken with 1/4 teaspoon each salt and pepper and add to the hot oil. Cook, stirring, until the chicken is no longer pink on the outside but is not cooked through, about 2 minutes. Transfer to a bowl with a slotted spoon, reserving the oil in the pan.",
        "Stir in the squash, celery and onions and cook, stirring occasionally, until the onions are soft, about 5 minutes. Add the broth, dill sprigs and 3 cups water. Bring to a boil, and then reduce the heat to medium to maintain a steady simmer. Simmer until a knife easily pierces through the squash, about 15 minutes.",
        "Meanwhile, whisk together the flour, baking soda, 1/4 teaspoon salt and 1/8 teaspoon pepper in a small bowl. With your fingertips, cut the butter into the flour until the mixture forms coarse crumbs. Stir in the milk just until a dough forms.",
        "Stir the chicken and peas into the broth and bring to a simmer. Drop the dough into the simmering broth by teaspoons, spacing them evenly to make about 16 dumplings. Cover and simmer on medium low for 5 minutes. Uncover and simmer until the dumplings are cooked through, about 3 minutes. Discard the dill sprigs. Top with chopped dill and serve."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 pound boneless, skinless chicken breasts, cut into 1-inch chunks",
        "Kosher salt and freshly ground black pepper",
        "One 20-ounce package peeled and diced butternut squash",
        "4 stalks celery, finely chopped",
        "1 medium onion, finely chopped",
        "2 cups lower-sodium chicken broth",
        "2 sprigs dill plus 2 tablespoons chopped fresh dill",
        "1/2 cup white whole wheat flour",
        "1 teaspoon baking soda",
        "1 tablespoon cold unsalted butter, cut up",
        "1/4 cup lowfat (1-percent) milk",
        "1 cup frozen peas, thawed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Chicken and Dumpling",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Low-Fat",
        "High Fiber",
        "Low Calorie"
    ],
    "title": "Chicken and Dumplings",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-and-dumplings-recipe"
}
