{
    "directions": [
        "Remove the tenderloin from each chicken breast half. Fillet each chicken breast half into 2 slices. Pound each piece of chicken, including the tenderloins, to 1/4-inch thickness. Place chicken in a bowl and pour in enough milk to completely cover chicken; soak for 30 minutes.",
        "Mix bread crumbs, Pecorino Romano cheese, and parsley together in a bowl. Remove chicken from milk and dredge through bread crumb mixture until each piece is evenly coated.",
        "Heat olive oil in a large skillet over medium heat; cook chicken in the hot oil until lightly browned, 2 to 3 minutes per side.",
        "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a baking dish.",
        "Transfer chicken to the prepared baking dish, reserving 1 tablespoon olive oil in the skillet. Sprinkle salt and pepper over chicken. Place 1 slice lemon onto each chicken piece.",
        "Pour wine into the skillet with reserved olive oil; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add white wine and chicken broth and boil until reduced by half, 5 to 10 minutes. Pour wine mixture over chicken and drizzle brandied orange liqueur over each.",
        "Bake in the preheated oven until chicken is no longer pink in the center and sauce is bubbling, 20 to 25 minutes."
    ],
    "ingredients": [
        "4 large skinless, boneless chicken breast halves",
        "1 cup milk, or as needed",
        "1 cup bread crumbs",
        "1 cup grated Pecorino Romano cheese",
        "2 tablespoons chopped fresh parsley",
        "1 cup olive oil",
        "salt and ground black pepper to taste",
        "1 lemon, thinly sliced",
        "1 cup white wine",
        "1 cup chicken broth",
        "1/4 cup lemon juice",
        "1 ounce brandy-based orange liqueur (such as Grand Marnier®), or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Francesa",
    "url": "http://allrecipes.com/recipe/241716/chicken-francesa/"
}
