{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Rinse chickens inside and out and pat dry. Stir together salt and pepper, then sprinkle over chickens inside and out. Put 1 tablespoon softened butter evenly under skin of each breast, then rub remaining tablespoon butter over skin of each. Arrange chickens in a 17- by 12-inch shallow heavy baking pan and roast, switching position of chickens and rotating pan halfway through roasting to help cook evenly, until thermometer inserted into fleshy part of each thigh (do not touch bone) registers 170°F, about 1 hour. Cool completely, about 1 hour.",
        "Discard skin and bones from chickens, then coarsely shred meat and transfer to a large bowl.",
        "Stir together mayonnaise, yogurt, zest, lemon juice, fennel seeds, salt, pepper, and basil, then pour over chicken in bowl. Add chopped fennel and stir to combine. Season with salt and pepper.",
        "Serve chicken salad in rolls."
    ],
    "ingredients": [
        "3 whole chickens",
        "4 teaspoons salt",
        "3/4 teaspoon black pepper",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 1/4 cups mayonnaise",
        "1/2 cup plain yogurt",
        "1 teaspoon finely grated fresh lemon zest",
        "1/4 cup fresh lemon juice",
        "1 1/2 teaspoons fennel seeds, toasted and cooled, then lightly crushed",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "1 cup chopped fresh basil",
        "3cups chopped fennel bulb (sometimes called anise; from 2 to 3 medium bulbs, stalks discarded)",
        "12 rolls or buns",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Citrus",
        "Herb",
        "Vegetable",
        "Roast",
        "Yogurt",
        "Lunch",
        "Fennel",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken and Fennel Salad Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-fennel-salad-sandwiches-235020"
}
