{
    "directions": [
        "Soak chickpeas in water to cover by 2 inches for 8 to 12 hours, then drain.",
        "Cut an X in bottom of each tomato. Blanch tomatoes in a saucepan of boiling water 10 seconds, then transfer with a slotted spoon to a bowl of ice and cold water. Peel, seed, and dice tomatoes.",
        "Toast peppercorns and cumin seeds in a small dry heavy skillet over moderate heat, stirring, until fragrant and cumin seeds are a shade darker. Cool completely, then finely grind in grinder.",
        "Heat 2 tablespoons olive oil in a wide 6- to 7-quart heavy pot over moderate heat until hot but not smoking. Add bacon and cook, stirring, until just browned, about 3 minutes. Add 2 tablespoons butter and heat until foam subsides, then stir in garlic and jalapeños and cook, stirring, 1 minute.",
        "Increase heat to moderately high and stir in celery, bell pepper, poblano, onion, carrot, and fennel, then cook, uncovered, stirring frequently, until vegetables are browned, about 20 minutes. Stir in tomatoes, bay leaves, and ground spices and cook, stirring, 1 minute. Add Sherry and deglaze by boiling, scraping up any brown bits from bottom of pot, until most of liquid is evaporated, about 2 minutes.",
        "Add chickpeas and stock and simmer, uncovered, stirring occasionally, until chickpeas are tender and liquid is thick and saucelike, 1 1/2 to 2 hours.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Prick chorizo links several times with a fork, then brown in remaining 2 teaspoons olive oil in an ovenproof large heavy skillet over moderate heat, turning, about 10 minutes. Transfer to a plate and chill, uncovered, until cold and firm, 10 to 15 minutes. Slice chorizo into 1/4-inch-thick rounds and chill, covered.",
        "Pat chicken dry and sprinkle with salt and pepper. Heat remaining tablespoon butter in cleaned skillet over moderately high heat until foam subsides, then sear chicken, skin side down, until skin is crisp and browned, about 5 minutes. Turn chicken over, then drizzle with extra-virgin olive oil and place a rosemary sprig on each piece. Transfer skillet to oven and roast until chicken is just cooked through, 12 to 15 minutes. Remove from oven and let stand 10 minutes, then discard rosemary, skin, and bones and shred meat. Keep loosely covered.",
        "When stew is thickened, stir in chicken and chorizo and simmer until sausage is cooked through, about 5 minutes. Discard bay leaves. Divide stew among 6 to 8 bowls and top each serving with 2 or 3 thin wedges of cheese.",
        "*Available at Latino markets.",
        "**Available at cheese shops, Murray's Cheese Shop (888-692-4339; murrayscheese.com), and Cowgirl Creamery (866-433-7834; cowgirlcreamery.com)."
    ],
    "ingredients": [
        "1 pound dried chickpeas (2 1/2 cups), picked over",
        "2 medium tomatoes",
        "1 tablespoon black peppercorns",
        "1 tablespoon cumin seeds",
        "2 tablespoons plus 2 teaspoons olive oil",
        "2 ounces slab bacon, rind discarded and bacon cut into 1/4-inch dice",
        "3 tablespoons unsalted butter",
        "5 garlic cloves, minced",
        "2 tablespoons fresh jalapeño chiles (about 3), seeded and minced",
        "2 large celery ribs, cut into 1/4-inch dice",
        "1 red bell pepper, cut into 1/4-inch dice",
        "1 fresh poblano chile, ribs and seeds discarded and chile cut into 1/4-inch dice",
        "1 medium red onion, cut into 1/4-inch dice",
        "1 large carrot, cut into 1/4-inch dice",
        "1 small fennel bulb (sometimes called anise), stalks cut off and discarded and bulb cut into 1/4-inch dice",
        "2 Turkish bay leaves or 1 California",
        "1/2 cup sweet Spanish Sherry",
        "10 cups chicken stock (page 314), or 7 cups low-sodium chicken broth plus 3 cups water",
        "3/4 pound fresh chorizo* links (spiced Mexican pork sausage)",
        "1 1/2 pound chicken thighs with skin and bones (about 4; preferably organic)",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon extra-virgin olive oil",
        "4 fresh rosemary sprigs",
        "1 (8-ounce) wheel Cowgirl Creamery Mt. Tam**, or other soft mild triple-crème cow's-milk cheese such as Explorateur, at room temperature",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Cheese",
        "Chicken",
        "Stew",
        "Bacon",
        "Sausage",
        "Fennel",
        "Chickpea",
        "Hot Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Chickpea, Chorizo, and Chicken Stew with Mt. Tam Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/chickpea-chorizo-and-chicken-stew-with-mt-tam-cheese-230761"
}
