{
    "directions": [
        "Preheat oven to 350°F. Place tomatoes, cut side up, on rimmed baking sheet. Brush tomatoes with oil. Mix parsley, basil, rosemary, and thyme in bowl. Sprinkle half of herb mixture over tomatoes. Season to taste with salt and pepper. Roast tomatoes until tender and slightly brown around edges, about 1 hour 15 minutes. Sprinkle with remaining herbs.",
        "Heat 2 tablespoons oil in heavy large saucepan over medium-high heat. Add onions and fennel and sauté until onions are translucent, about 6 minutes. Add chicken broth and boil until mixture is reduced to 3 1/2 cups, about 13 minutes. Add spinach and olives to broth and cook 1 minute. Strain through fine sieve; discard solids. Season broth to taste with salt and pepper. Cover to keep warm.",
        "Brush chicken with 2 tablespoons oil; sprinkle with salt and pepper. Heat heavy large skillet over medium-high heat; add chicken and cook until golden brown, about 5 minutes per side. Reduce heat to medium and sauté until chicken is cooked through, about 4 minutes longer.",
        "Spoon mashed potatoes onto center of each of 6 plates, dividing equally. Top with tomatoes, then chicken. Spoon broth around potatoes on each plate."
    ],
    "ingredients": [
        "9 large plum tomatoes, halved lengthwise",
        "1/4 cup olive oil",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh basil",
        "1 1/2 teaspoons chopped fresh rosemary",
        "1 1/2 teaspoons chopped fresh thyme",
        "4 tablespoons olive oil",
        "2 cups chopped onion",
        "1 1/2 cups chopped fresh fennel bulb",
        "3 1/2 cups low-salt chicken broth",
        "1 cup (packed) finely chopped fresh spinach",
        "1 cup chopped Kalamata olives (about 4 1/2 ounces)",
        "6 boneless chicken breast halves with skin",
        "Garlic Mashed Potatoes with Chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Olive",
        "Potato",
        "Tomato",
        "Roast",
        "Sauté",
        "Spinach",
        "Fall",
        "Healthy"
    ],
    "title": "Chicken and Mashed Potatoes with Herb-Roasted Tomatoes and Olive Broth",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-mashed-potatoes-with-herb-roasted-tomatoes-and-olive-broth-108577"
}
