{
    "directions": [
        "Special equipment: 7-quart pressure cooker",
        "Put the hen and 3 teaspoons of the salt in a 7-quart pressure cooker. Add water just to cover the hen. Do not fill above the cooker's \"maximum fill\" line, or 2/3 full. Cover and lock the lid. Bring to pressure over high heat, approximately 20 minutes.",
        "Reduce the heat to low, so that you barely hear hissing from the pot. Cook for 45 minutes.",
        "Release the pressure using the cooker's release device (read the manual!) or cool the cooker by running cold water over the lid for 5 minutes. Open carefully. Remove the hen from the broth and set aside to cool. The meat should be tender and falling away from the bone. Once the hen is cool enough to handle, pull the meat from the bones in small pieces, cover and set aside. Discard the skin and bones.",
        "Set a cheesecloth-lined colander in a shallow, wide, 6-quart pot and strain the broth, discarding the solids. Taste and season the broth with additional salt, if needed.",
        "Put 1/2 cup of the broth, the butter, and remaining 1/2 teaspoon of salt in a 2-quart saucier, set over high heat, and bring to a boil. As soon as it boils, add all of the flour at once and stir with a wooden spoon until the mixture starts to come together, approximately 1 minute. Decrease the heat to low and continue stirring until the mixture forms a ball and is no longer sticky, approximately 3 minutes. Transfer the mixture to a medium bowl and mix, on low speed, for 5 minutes with an electric hand mixer. Beat until cool and there is no more steam rising. Continue to mix on low, and add the eggs, 1 at a time, making sure each is completely incorporated before adding another. You may need to stop occasionally and scrape down the sides of the bowl. Before adding the last egg, check the mixture for consistency: It should tear slightly as it falls from the beater, creating a \"V\" shape. Transfer the dough to a 1-gallon resealable plastic bag. Cut off 1 corner of the bag to make a quarter-sized opening.",
        "Bring the broth to a slight simmer over medium heat. Pipe 1-inch of the mixture and cut with kitchen shears directly over the broth. Repeat with the remaining batter. Cook, covered, until the dumplings are cooked through, about 8 to 10 minutes. Turn off the heat, add the meat and wait for 2 to 3 minutes before serving. Serve in bowls with freshly ground black pepper."
    ],
    "ingredients": [
        "5 to 5 1/2 pound stewing hen giblets removed",
        "3 1/2 teaspoons kosher salt, divided",
        "7 to 9 cups water",
        "3 tablespoons unsalted butter",
        "2 3/4 ounces all-purpose flour",
        "2 large eggs, at room temperature",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Soup",
        "Chicken and Dumpling",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Chicken and Dropped Dumplings",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/chicken-and-dropped-dumplings-recipe"
}
