{
    "directions": [
        "Heat 3/4 cup oil in heavy large saucepan over medium-high heat. Add onions and sauté 3 minutes. Add all bell peppers, garlic, thyme, and sugar; sauté 5 minutes. Reduce heat to medium-low. Cover and cook until vegetables are very soft, stirring occasionally, about 15 minutes longer. Drain confit and cool; discard cooking oil. Season to taste with salt and pepper.",
        "Puree 1/2 cup bell pepper mixture, lemon juice, and 5 tablespoons olive oil in blender until smooth. Season sauce to taste with salt and pepper. (Bell pepper confit and sauce can be made 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 400°F. Heat remaining 2 tablespoons olive oil in large ovenproof skillet over medium-high heat. Sprinkle chicken with salt and pepper. Coat in flour; shake off excess. Sauté chicken in skillet until golden, about 1 minute per side. Transfer skillet to oven and bake chicken until cooked through, turning once, about 12 minutes.",
        "Meanwhile, rewarm bell pepper confit over medium heat. Stir sauce over low heat just until heated through. Spoon bell pepper confit onto 4 plates.",
        "Slice chicken diagonally and place atop bell peppers. Drizzle sauce around chicken and serve."
    ],
    "ingredients": [
        "3/4 cup plus 7 tablespoons olive oil",
        "2 medium onions, thinly sliced",
        "2 red bell peppers, very thinly sliced",
        "1 yellow bell pepper, very thinly sliced",
        "6 garlic cloves, minced",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon sugar",
        "1/4 cup fresh lemon juice",
        "4 skinless boneless chicken breast halves",
        "3/4 cup all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Bake",
        "Sauté",
        "Dinner",
        "Lime",
        "Bell Pepper",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chicken and Bell Pepper with Onion Confit",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-bell-pepper-with-onion-confit-105555"
}
