{
    "directions": [
        "Puree the first 7 ingredients, 3 tablespoons oil, and 2 tablespoons sugar in blender. Place chicken in resealable plastic bag. Add lemongrass marinade and seal; turn to coat. Refrigerate overnight.",
        "Preheat oven to 450°F. Heat 2 tablespoons oil in large ovenproof skillet over medium-high heat. Remove chicken from marinade and season with salt. Add chicken, skin side down, to skillet. Cook until golden brown and crisp, about 8 minutes. Turn skin side up; transfer skillet to oven. Roast until chicken is cooked through, about 25 minutes.",
        "Meanwhile, heat 1 tablespoon oil in medium skillet over medium-high heat. Add onion; sauté until golden brown, about 5 minutes. Add green beans, bell pepper, soy sauce, rice vinegar, and 1 1/2 teaspoons sugar and cook until beans are tender and liquid reduces enough to coat beans, about 5 minutes. Divide between 2 plates. Top with chicken.",
        "*Available at Asian markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "4 6-inch-long pieces lemongrass, cut crosswise into 1/2-inch pieces",
        "10 garlic cloves",
        "5 shallots, quartered",
        "4 serrano chilies, cut into 1/2-inch pieces",
        "1/2 cup water",
        "2 teaspoons salt",
        "1 1/2 teaspoons fish sauce (nam pla)*",
        "6 tablespoons olive oil",
        "2 tablespoons plus 1 1/2 teaspoons sugar",
        "1 2 1/2-pound chicken, cut in half, backbone removed",
        "1/2 onion, sliced",
        "5 ounces Chinese long beans, or regular green beans, cut into 2-inch pieces",
        "1/2 red bell pepper, diced",
        "2 tablespoons soy sauce",
        "1 1/2 tablespoons seasoned rice vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Marinate",
        "Roast",
        "Sauté",
        "Dinner",
        "Hot Pepper",
        "Lemongrass",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Chicken Roasted with Lemongrass and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-roasted-with-lemongrass-and-garlic-107930"
}
