{
    "directions": [
        "Filling: Heat oil over medium-high heat in a large skillet. Saute onions and garlic until onions are soft and translucent, about 4 minutes. Add spices, stir to mix fully, and cook for 2 to 3 minutes. Add black beans and chicken and season with salt and pepper, to taste. Cook until black beans are heated through, about 5 minutes, then remove from heat and let mixture cool fully. Add cilantro and stir well. Preheat the oven to 375 degrees F. Lay out a sheet of puff pastry on a lightly floured surface. Flour the top of the dough and roll out the puff pastry until it is about 1/16-inch thick and about 12 inches by 16 inches. Trim edges to size, if necessary. Cut 4-inch strips crosswise and lengthwise making 12 (4 by 4-inch) squares. Make sure the squares are well floured and stack them in a little pile. To form empanadas: Fill a little dish with some room temperature water. Imagine each square you work with is separated in half by a diagonal. Place a couple tablespoons of filling in the top half. Dip a finger into the water and moisten the edges of the top half with water. Fold the bottom half to meet the edges of the top half. Use a fork to pinch and seal the edges. Lightly brush the tops with vegetable oil. Place finished pockets on a nonstick baking sheet and bake about 12 to 14 minutes, or until golden brown and puffy.",
        "In a medium bowl, combine the chopped tomatoes, pineapple, garlic, jalapeno and scallions. Mix well. Add lime juice, sugar, and salt, to taste. Toss well. Serve with the Chicken Empanadas."
    ],
    "ingredients": [
        "2 cloves garlic, pressed",
        "1/4 cup vegetable oil",
        "1 small onion, finely chopped",
        "1 teaspoon ground cumin",
        "1 1/2 teaspoon dried oregano",
        "1/4 teaspoon cayenne pepper",
        "1 (15-ounce) can black beans, drained and rinsed well",
        "1 1/2 cups finely shredded cooked chicken",
        "Kosher salt and black pepper",
        "1/2 cup packed fresh cilantro leaves",
        "1 package prepared puff pastry",
        "Flour, for rolling out pastry",
        "About 1/4 cup vegetable oil, for brushing",
        "Tomato and Pineapple Salsa Fresca, recipe follows",
        "1 pound ripe tomatoes (about 3 medium), roughly chopped",
        "1 (14.5-ounce) can pineapple pieces, juice strained",
        "1 clove garlic, roughly chopped",
        "1 small jalapeno, seeded and finely minced",
        "3 scallions, finely sliced into 1/8-inch rounds",
        "1 lime, juiced",
        "2 pinches superfine sugar",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "Mexican Chicken",
        "Empanada Recipes",
        "Tomato",
        "Vegetable",
        "Beans and Legumes",
        "Jalapeno Recipes",
        "Fruit",
        "Pineapples"
    ],
    "title": "Chicken and Bean Puff Pastry Empanadas",
    "url": "http://www.foodnetwork.com/recipes/dave-lieberman/chicken-and-bean-puff-pastry-empanadas-recipe"
}
