{
    "directions": [
        "Combine 7 cups broth, chicken and saffron in heavy large pot. Bring to boil. Reduce heat; cover and simmer until chicken is cooked through, about 30 minutes. Transfer chicken to large bowl and cool briefly; reserve broth. Remove skin and bones from chicken. Cut chicken into 3/4-inch cubes; place in 15x10x2-inch (4 quart) glass baking dish.",
        "Bring broth to boil. Add carrots and celery; cook until crisp-tender, about 5 minutes. Using slotted spoon, transfer to dish with chicken. Add green onions, peas, ham, onion and parsley to chicken.",
        "Spoon fat off top of broth. Measure broth, adding more if necessary for 6 1/2 cups. Melt butter in heavy large saucepan over medium heat. Ad flour; stir 2 minutes. Gradually whisk in broth. Boil until thick and smooth, whisking constantly, about 8 minutes. Season with salt and pepper. Add to chicken. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.)",
        "Position rack in center of oven and preheat to 400°F. Whisk milk, egg and butter to blend in large bowl. Add remaining ingredients. Drop batter by tablespoonfuls over filling.",
        "Bake cobbler until topping is firm and golden brown, about 35 minutes."
    ],
    "ingredients": [
        "7 cups (or more) canned low-salt chicken broth",
        "3 to 3 1/2 pounds chicken breast halves with skin and bones",
        "1/8 teaspoon crushed saffron threads",
        "2/3 cup diced carrots",
        "2/3 cup diced celery",
        "1 cup chopped green onions",
        "1 cup frozen petit peas, thawed",
        "1/4 pound smoked ham, chopped",
        "2/3 cup chopped onion",
        "3 tablespoons chopped parsley",
        "1/2 cup (1 stick) unsalted butter",
        "3/4 cup all purpose flour",
        "1 1/4 cups milk",
        "1 egg",
        "2 tablespoons (1/4 stick) butter, melted",
        "1 cup all purpose flour",
        "1 cup yellow cornmeal",
        "1/2 cup grated sharp cheddar cheese",
        "2 tablespoons chopped parsley",
        "4 teaspoons baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Dairy",
        "Onion",
        "Poultry",
        "Bake",
        "Dinner",
        "Cornmeal",
        "Pea",
        "Carrot",
        "Green Onion/Scallion",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken and Green Onion Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-green-onion-cobbler-271"
}
