{
    "directions": [
        "Cook greens in large pot of boiling salted water until tender, 5 to 10 minutes. Drain; rinse under cold water. Squeeze dry; chop greens finely. DO AHEAD: Greens can be made 1 day ahead. Cover and chill.",
        "Sprinkle chicken with salt and pepper. Melt 1 tablespoon butter in heavy medium skillet over high heat. Add chicken; sauté until golden brown, 2 to 3 minutes, then transfer to bowl.",
        "Add remaining 1 tablespoon butter to same skillet and melt over low heat. Add flour and whisk 1 minute (do not brown). Pour in cream. Increase heat and bring to boil, whisking until sauce is thick and smooth, about 2 minutes. Whisk in broth, then stir in greens and nutmeg. Season with salt and pepper.",
        "Preheat oven to 400°F. Butter 9-inch-diameter glass pie dish. Add eggs to mixture with greens. Stir gently, partially breaking yolks and whites. Spread mixture in prepared dish. Push chicken pieces down into mixture. Sprinkle breadcrumbs over. Drizzle with olive oil.",
        "Bake gratin until top is golden brown and eggs are cooked, about 18 minutes."
    ],
    "ingredients": [
        "1 pound dandelion greens, Swiss chard, or mustard greens (about 1 1/4 bunches), tough bottom stems removed",
        "8 ounces skinless boneless chicken breast halves, cut into 1/2-inch cubes",
        "2 tablespoons (1/4 stick) butter, divided",
        "1 tablespoon all purpose flour",
        "3/4 cup heavy whipping cream",
        "1/4 cup low-salt chicken broth",
        "1/8 teaspoon ground nutmeg",
        "2 large eggs",
        "3/4 cup fresh breadcrumbs made from crustless French bread",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Casserole/Gratin",
        "Spring",
        "Family Reunion",
        "Mustard Greens",
        "Breadcrumbs",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken and Spring Green Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-spring-green-gratin-352555"
}
