{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Using a skewer or fork, pierce squash in several places. Place  whole squash on a baking sheet; roast for 45 minutes. Turn squash over and roast for an additional 10 minutes. Set aside to cool.",
        "Heat olive oil in a large skillet over medium-high heat. Cook and stir onion, garlic, green bell pepper, paprika, salt, caraway seeds and ground black pepper in the hot oil until onion is soft and translucent, about 5 minutes. Remove from skillet and set aside, leaving olive oil in pan.",
        "Reduce heat to medium and cook chicken breasts in the same skillet until browned, the juices run clear, and meat is no longer pink inside, turning once, about 10 minutes per side. Remove chicken breasts and slice on the diagonal. Return chicken and onion mixture to the pan; stir in tomatoes. Bring chicken mixture to a simmer.",
        "Slice squash in half and scoop out seeds with a spoon. Using a fork, scrape spaghetti-like strands of squash from the peels. Combine squash with chicken and vegetables, increase heat, and bring to a boil. Reduce heat to low and simmer to combine flavors, about 10 minutes. Stir in sour cream if desired."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1704&h=892&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2651452.jpg",
    "ingredients": [
        "1 (3 pound) spaghetti squash",
        "2 tablespoons olive oil",
        "1  onion, thinly sliced",
        "2 cloves garlic, minced",
        "1  green bell pepper, diced",
        "2 tablespoons paprika",
        "1 teaspoon salt",
        "1 teaspoon caraway seeds",
        "ground black pepper to taste",
        "3  skinless, boneless chicken breast halves",
        "1 (14.5 ounce) can whole peeled tomatoes, drained",
        "½ cup sour cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Paprika with Spaghetti Squash",
    "url": "http://allrecipes.com/recipe/230832/chicken-paprika-with-spaghetti-squash/"
}