{
    "directions": [
        "For the marinade: In a large bowl, mix together the marinade ingredients. Add the chicken and toss to coat. Marinate at least 30 minutes, or in the refrigerator up to overnight.",
        "For the sauce: When you're ready to make the curry, place a large skillet over medium heat and add the olive oil and butter. When the butter has melted, add the Ginger-Garlic Paste and serrano peppers. Saute until lightly browned around the edges. Add the tomato paste and cook until the tomato has darkened in color, about 3 minutes. Add the garam masala and the paprika and saute for about 1 minute to draw out their flavors.",
        "Add the tomatoes, salt, and 1 cup water. Bring to a boil, turn down to a simmer, and cook until thickened, about 20 minutes. You may need more water depending on how much liquid the tomatoes give off.",
        "Meanwhile, fire up your grill. When it is nice and hot, lightly brush it with oil. Place the chicken on the grill, shaking off some of the excess marinade. Cook until it's charred, about 2 minutes on each side. (Don't worry that the chicken will still be a little uncooked, it finishes cooking in the sauce).",
        "Pour the sauce into a blender or food processor, or use an immersion blender, and process until smooth. Pour back into the skillet and bring back up to a boil. Add the chicken and fenugreek leaves, if using. Take the heat down to a simmer and cook for about 10 minutes. Add the cream and stir through. Garnish with minced fresh cilantro, and serve over rice, with naan, or a crusty piece of bread!",
        "Throw the garlic, ginger, and canola oil in a mini-food processor and let it go until it forms a semi-smooth paste. There will still be tiny little pieces in there, but overall, it should resemble a paste.",
        "Save what you don't use in a small glass jar. It should last in the fridge for 2 to 3 weeks. It's a delicious addition to marinades, pasta sauces, stir fry sauces, slow-cooker recipes, gravy etc. We always had a jar of this stuff in our fridge growing up."
    ],
    "ingredients": [
        "1 cup plain yogurt, whisked until smooth",
        "3 tablespoons Ginger-Garlic Paste, recipe follows (or 1 tablespoon grated fresh ginger and 3 cloves garlic put through a garlic press or finely minced)",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pound boneless, skinless chicken thighs, poked with a fork, and cut into large bite-sized chunks",
        "2 teaspoons olive oil",
        "3 tablespoons butter",
        "1/3 cup Ginger-Garlic Paste, recipe follows (or 6 cloves garlic and 2-inch thumb ginger minced)",
        "2 serrano peppers, minced (seeds removed if you don't want it spicy)",
        "2 tablespoons tomato paste",
        "1 teaspoon garam masala",
        "2 teaspoons paprika",
        "8 Roma tomatoes, diced",
        "1 1/2 teaspoons kosher salt",
        "1 to 2 cups water",
        "Oil, for grilling",
        "1 tablespoon dried fenugreek leaves (optional)",
        "1/2 cup heavy cream",
        "Minced fresh cilantro, for garnish",
        "Cooked rice, naan, or crusty piece of bread, for serving",
        "1/2 cup cloves garlic, whole",
        "1/2 cup fresh ginger, peeled, cut into 1/2-inch slices",
        "1/4 cup canola oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Chicken Curry",
        "Curry Recipes",
        "Indian Recipes",
        "Gravy",
        "Sauce Recipes",
        "Tomato",
        "Vegetable"
    ],
    "title": "Chicken in Creamy Tomato Curry: Chicken Tikka Masala",
    "url": "http://www.foodnetwork.com/recipes/aarti-sequeira/chicken-in-creamy-tomato-curry-chicken-tikka-masala-recipe2"
}
