{
    "directions": [
        "Place chicken and 12 cups water in a large pot. Cut green tops from scallions; add to pot. Cut a small nub off ginger; set aside. Cut remaining ginger into quarters (do not peel) and halve shallots; toss ginger, shallots, and peppercorns into pot. Set aside a handful of basil and submerge the rest in pot; bring to a boil. As liquid heats, skim off any foam, but try not to remove too much fat (you’ll use it later). As soon as liquid is boiling, reduce heat and gently simmer until chicken is cooked through, about 15 minutes for legs and 20 minutes for breasts (an instant-read thermometer inserted into the center of a piece should register 155°F; temperature will continue to rise off heat). Transfer to a plate; let cool.",
        "Meanwhile, strain stock into a large bowl (you’ll have about 10 cups). Use a large spoon or ladle to skim off any fat from surface into a small bowl; set aside. Measure out 2 1/2 cups stock. Reserve remaining stock for another use.",
        "Rinse rice in a sieve, stirring with your fingers until liquid runs mostly clear. Shake off excess water and transfer to a medium nonstick skillet. Add reserved 2 1/2 cups stock and bring to a boil over medium-high, about 4 minutes. Reduce heat, cover skillet, and simmer until rice is tender and liquid is mostly absorbed, 8–10 minutes.",
        "Drizzle reserved chicken fat around edge of pan (do not stir). Increase heat to medium-high and cook rice, uncovered, until underside is golden and crisp, 10–12 minutes. If pan seems dry, drizzle vegetable oil around edge of rice as needed. The goal is an evenly browned bottom with tender rice on top.",
        "While rice is crisping, cut scallion whites into thin rounds and finely grate remaining piece of ginger.",
        "Pull chicken meat off bones and shred; discard skin and bones. Divide rice and chicken among bowls; add some avocado, scallions, grated ginger, and reserved basil to each. Serve with lime wedges, hot sauce, soy sauce, sesame oil, and vinegar as desired."
    ],
    "ingredients": [
        "2 skin-on, bone-in chicken breasts",
        "2 chicken legs (thigh and drumstick)",
        "2 bunches scallions",
        "1 (2-inch) piece fresh ginger",
        "2 medium shallots",
        "1 teaspoon black peppercorns",
        "1 bunch Thai basil or regular basil",
        "2 cups sushi rice",
        "1–2 tablespoons vegetable oil (optional)",
        "Sliced avocado, lime wedges, hot sauce, soy sauce, toasted sesame oil, and/or black vinegar (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Avocado",
        "Poach",
        "Dinner",
        "Lunch",
        "Ginger",
        "Basil",
        "Green Onion/Scallion"
    ],
    "title": "Chicken With Crispy Rice",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-crispy-rice"
}
