{
    "directions": [
        "Preheat oven to 450°F. Arrange chicken breasts in single layer in jelly roll pans or baking pans. Brush both sides with soy sauce and olive oil. Sprinkle both sides with pepper. Arrange skin side up. Roast until just cooked through, about 20 minutes. Cool slightly. Skin and bone chicken; reserve drippings in pans. Cut chicken into 1/2-inch-wide strips. Return to pans and turn to coat with drippings. Cool. Transfer chicken meat and drippings to large bowl. Set aside.",
        "Cook beans in large pot of boiling salted water until crisp-tender, about 5 minutes. Drain. Refresh with cold water. Drain well. (Can be prepared 1 day ahead. Cover chicken and beans separately and refrigerate.)",
        "Combine mustard and vinegar in medium bowl. Gradually whisk in oil. Add shallots and 2 tablespoons thyme. (Can be prepared 1 day ahead. Store dressing at room temperature.)",
        "Add beans, dressing and walnuts to chicken and toss to coat. Season with salt and pepper. Line platter with kale. Top with salad. Sprinkle with cheese and additional thyme and serve."
    ],
    "ingredients": [
        "18 large chicken breast halves (about 9 pounds)",
        "1/4 cup plus 2 tablespoons soy sauce",
        "1/4 cup plus 2 tablespoons olive oil",
        "Freshly ground pepper",
        "3 pounds green beans, trimmed and halved crosswise",
        "3 tablespoons Dijon mustard",
        "3 tablespoons balsamic vinegar or 2 1/2 tablespoons red wine vinegar",
        "1 cup olive oil",
        "3 tablespoons minced shallots",
        "2 tablespoons minced fresh thyme",
        "3 cups coarsely chopped walnuts (about 12 ounces)",
        "Salt",
        "Ornamental kale or red leaf lettuce",
        "6 ounces goat cheese, crumbled",
        "Additional minced fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Chicken",
        "Nut",
        "Vegetable",
        "Goat Cheese",
        "Walnut",
        "Green Bean",
        "Kale",
        "Summer"
    ],
    "title": "Chicken, Green Bean and Goat Cheese Salad",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-green-bean-and-goat-cheese-salad-2037"
}
