{
    "directions": [
        "Separate garlic cloves and peel. Pat chicken pieces dry and season with salt and pepper.",
        "In a 12-inch flameproof casserole or heavy skillet with a lid heat oil over moderately high heat until hot but not smoking and brown chicken in batches, without crowding, transferring to a bowl. Pour off fat from casserole or skillet. In casserole or skillet arrange chicken, skin sides up, in one layer. Add Cognac and heat over moderately low heat until warm. Carefully ignite Cognac and heat, shaking casserole or skillet occasionally, until flames have subsided.",
        "Add stock, garlic, and rosemary. Squeeze juice from lemon half, discarding any seeds, into chicken mixture and add lemon half. Simmer mixture, covered, 25 minutes, or until breast pieces are just cooked through. Transfer breast pieces with tongs to a deep platter and keep warm, covered. Simmer remaining chicken, covered, 5 to 10 minutes more, or until tender and cooked through, and transfer with tongs to platter.",
        "Remove lemon half, squeezing any liquid into casserole or skillet, and discard lemon and rosemary. In a blender purée cooking liquid with garlic (use caution when blending hot liquids) and pour through a sieve into casserole or skillet. Boil liquid until reduced to about 1 cup and stir in cream and salt and pepper to taste. Return chicken to casserole or skillet and simmer until heated through, about 3 minutes.",
        "Transfer chicken to platter and pour sauce over it."
    ],
    "ingredients": [
        "1 large head garlic",
        "a 3- to 4-pound chicken, cut into 8 serving pieces",
        "2 tablespoons olive oil",
        "1/4 cup Cognac",
        "3 cupschicken stock *",
        "three 6- to 7-inch-long fresh rosemary sprigs",
        "1/2 lemon",
        "1/2 cup heavy cream",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Poultry",
        "Spring",
        "Gourmet"
    ],
    "title": "Chicken with Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-garlic-sauce-14987"
}
