{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Combine panko, paprika, poultry seasoning, and salt and pepper in a shallow dish; set aside.",
        "Place the chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 3/8 inch. Place a slice of Cheddar cheese and a slice of coppa ham on the center of each chicken breast, then fold the chicken over the filling and secure with kitchen string. Dip each rolled chicken breast into the beaten egg, then into the seasoned panko until evenly coated.",
        "Heat the butter and olive oil in a large skillet over medium-high heat. Pan fry the coated chicken breasts until browned on all sides, 7 to 10 minutes. Transfer the browned chicken breasts in a baking dish.",
        "Bake the chicken breasts in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Arrange another slice of white Cheddar cheese over each chicken breast and return to the oven. Bake until the cheese has melted, about 5 minutes.",
        "Meanwhile, pour the white wine and chicken bouillon granules into the skillet used to cook the chicken. Cover and simmer over low heat until reduced, about 30 minutes. Mix the cornstarch and heavy cream in a bowl; slowly whisk the cornstarch mixture into the wine mixture. Continue cooking and stirring until the sauce has thickened, about 3 minutes. Serve the chicken topped with the cream sauce."
    ],
    "ingredients": [
        "1/3 cup panko bread crumbs",
        "1 teaspoon paprika",
        "1 teaspoon poultry seasoning (such as Poultry Magic®), or to taste",
        "salt and pepper to taste",
        "6 skinless, boneless chicken breast halves",
        "6 slices white Cheddar cheese (such as Tillamook®)",
        "6 thin slices coppa ham",
        "1 egg, well beaten",
        "3 tablespoons butter",
        "3 tablespoons olive oil",
        "6 slices white Cheddar cheese (such as Tillamook®)",
        "1/2 cup dry white wine, or more as needed",
        "1 teaspoon chicken bouillon granules",
        "2 tablespoons cornstarch",
        "1 1/2 cups heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Cordon Bleu a la Kerry",
    "url": "http://allrecipes.com/recipe/216752/chicken-cordon-bleu-a-la-kerry/"
}
