{
    "directions": [
        "Cook farro in medium saucepan of boiling salted water until just tender, 20 to 25 minutes. Drain; cool.",
        "Meanwhile, heat 1 tablespoon oil in heavy medium skillet over medium-high heat. Sprinkle chicken with salt and pepper. Add chicken to skillet; cook until golden brown and cooked through, about 8 minutes per side. Cool, then cut into 1/2- to 3/4-inch cubes. Cook green beans in large saucepan of boiling salted water until crisp-tender, about 4 minutes. Drain. Rinse under cold water to cool; drain. Transfer beans to kitchen towel; pat dry.",
        "Mix farro, chicken, and green beans in large bowl; add corn and green onions.",
        "Combine remaining 2 tablespoons oil, marjoram, and 1/2 teaspoon coarse salt in small bowl. Press with back of spoon to release flavor. Whisk in vinegar, shallot, and mustard. Pour over salad in bowl; toss to coat. Season to taste with salt and pepper. DO AHEAD: Salad can be made 1 day ahead. Cover and chill.",
        "Divide chilled or room-temperature salad among plates. Sprinkle with goat cheese.",
        "Available at specialty foods stores, natural foods stores, and Italian markets."
    ],
    "ingredients": [
        "1/2 cup semi-pearled farro* or spelt berries",
        "3 tablespoons extra-virgin olive oil, divided",
        "8 ounces skinless boneless chicken breast halves",
        "12 ounces green beans, trimmed, cut into 1 1/2-inch pieces",
        "2 cups fresh yellow corn kernels (cut from 2 to 3 ears of corn)",
        "3 green onions, thinly sliced (about 3/4 cup)",
        "1 tablespoon minced fresh marjoram",
        "1/2 teaspoon coarse kosher salt",
        "2 tablespoons white wine vinegar",
        "2 tablespoons minced shallot",
        "1 teaspoon Dijon mustard",
        "4 ounces fresh goat cheese, crumbled (about 1 1/4 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Vegetable",
        "Picnic",
        "Low Cal",
        "High Fiber",
        "Graduation",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Corn",
        "Green Bean",
        "Summer",
        "Chill",
        "Healthy",
        "Party",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken, Green Bean, Corn, and Farro Salad with Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-green-bean-corn-and-farro-salad-with-goat-cheese-354298"
}
