{
    "directions": [
        "Preheat large, heavy skillet over medium high heat.",
        "Set steaks on to a waxed paper lined work surface and cover with another piece of waxed paper. Pound steaks to 1/4-inch thick. Pull steaks off work surface and set to the side. Line work surface with more waxed paper. Pour 1/2 cup flour into 2 piles on opposite sides of the work space. Add cornmeal, paprika, salt and pepper to 1 pile of flour. Beat eggs and water in a pie plate or shallow dish.",
        "Cut steaks into 4 portions and coat in flour, eggs, then seasoned flour and cornmeal.",
        "Add 2 tablespoons oil to hot pan and cook 2 steaks at a time. Brown steaks about 2 minutes per side, or until cooked and remove from the pan. Add 2 tablespoons more oil and repeat with remaining 2 steaks. Remove steaks to serving platter and pour off all but 2 to 3 tablespoons of drippings. Add 2 tablespoons flour to drippings and cook 2 minutes. Whisk in broth and season with salt and pepper. Whisk half and half or cream into gravy. When gravy bubbles, remove from heat.",
        "Serve steaks and warm biscuits with gravy on top."
    ],
    "ingredients": [
        "1 1 /2 pounds (1/2-inch thick) round steak",
        "1 cup plus 2 tablespoons flour",
        "1/3 cup cornmeal, eyeball it",
        "1 teaspoon sweet paprika",
        "1 teaspoon salt, 1/3 palm full",
        "1/2 teaspoon ground pepper, eyeball it",
        "2 eggs beaten",
        "2 tablespoons water, 2 splashes",
        "4 tablespoons vegetable oil",
        "1 1/4 cups beef broth or stock",
        "1/4 cup half-and-half or cream, 2 turns of the pan",
        "1 package bake-off biscuits, prepared according to package directions",
        "Waxed paper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Gravy",
        "Steak",
        "Meat",
        "Poultry Recipes",
        "Beef",
        "Cornmeal",
        "Grain Recipes",
        "Dairy Recipes"
    ],
    "title": "Chicken Fried Steaks and Creamed Pan Gravy with Biscuits",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/chicken-fried-steaks-and-creamed-pan-gravy-with-biscuits-recipe"
}
