{
    "directions": [
        "Into a bowl sift together the flour, the baking powder, the baking soda, the salt, and the sugar. add the dill and the shortening, and blend the mixture until it resembles meal. Stir in the sour cream and the milk and stir the mixture until it just forms a soft but sticky dough. On a floured surface roll or pat out the dough 1/2 inch thick and with a 3 1/2-inch cookie cutter cut out 6 rounds. Bake the rounds on an ungreased baking sheet in the middle of a preheated 425°F. oven for 15 to 17 minutes, or until they are golden.",
        "In a skillet cook the mushrooms in 1 tablespoon of the butter over moderate heat, stirring occasionally, until they give off their liquid and reserve the mixture. In a large saucepan melt the remaining 3 tablespoons butter over moderate heat and in it cook the shallot until it is softened. Add the flour and cook the roux, stirring, for 5 minutes. Add the broth in a stream, stirring, and cook the mixture, stirring, for 5 minutes. Add the cream and boil the mixture, stirring occasionally, for 10 minutes. Add the peas, the lemon juice, the salt, the dill, the chicken, the ham, the reserved mushroom mixture, and pepper to taste and simmer the mixture for 10 minutes, or until the chicken is heated through.",
        "Arrange a biscuit, heated and split, on each of the 6 dinner plates, spoon some of the fricassee over the bottom half, and cover it with the top half of the biscuit."
    ],
    "ingredients": [
        "1 3/4 cups all-purpose flour",
        "2 teaspoons double-acting baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon sugar",
        "2 tablespoons finely chopped dill",
        "4 tablespoons cold vegetable shortening",
        "2/3 cup sour cream",
        "1/4 cup milk",
        "1/4 pound mushrooms, sliced",
        "1/2 stick (1/4 cup) unsalted butter",
        "3 tablespoons minced shallot",
        "1/4 cup all-purpose flour",
        "3 cups chicken broth",
        "3/4 cup heavy cream",
        "1 10-ounce package frozen peas, thawed",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon salt",
        "2 1/2 tablespoons finely chopped fresh dill",
        "4 cups bite-size pieces cooked chicken",
        "1/4 pound cooked ham, cut into cubes (about 3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Bake",
        "Ham",
        "Pea",
        "Winter",
        "Sour Cream",
        "Dill",
        "Gourmet"
    ],
    "title": "Chicken and Dill Fricassée with Sour Cream Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-dill-fricassee-with-sour-cream-shortcakes-10296"
}
