{
    "directions": [
        "In medium bowl, combine chiles and cold water to cover. Soak until softened, about 30 minutes. Drain and blot dry. Set aside.",
        "In dry medium skillet over moderate heat, toast coriander, cumin, and fennel seeds and cinnamon stick until fragrant but not burned, 4 to 5 minutes. Transfer to spice grinder or mortar and pestle and process to fine powder.",
        "In mortar and pestle, food processor, or blender, combine spice powder, soaked chiles, macadamia nuts, shallots, ginger, garlic, turmeric, and 2 tablespoons water. Purée until mixture becomes smooth paste.",
        "Cut off and discard top of each lemongrass stalk, leaving 6-inch stalk, then smash stalks with side of large heavy knife. Cut each stalk into 1-inch pieces.",
        "In large saucepan over moderate heat, heat oil. Add rempah and sauté, stirring frequently, until thickened, darker, and very aromatic, about 5 minutes. Sprinkle chicken pieces with salt and add to pan. Sauté chicken, stirring occasionally, until opaque, about 5 minutes.",
        "Add lemongrass and coconut milk and bring to boil. Reduce heat to moderately low and simmer, uncovered, stirring occasionally, until chicken is just cooked through, 35 to 40 minutes. (If sauce separates during cooking, stir in water, 1 tablespoon at a time, to bring sauce back together.)",
        "Transfer chicken to serving bowl and sprinkle with coconut. Serve rice and lime wedges alongside."
    ],
    "ingredients": [
        "10 dried guajillo or New Mexico chiles (about 2 1/2 ounces total), wiped clean, stemmed, and seeded",
        "2 tablespoons whole coriander seeds",
        "4 1/2 teaspoons whole cumin seeds",
        "2 teaspoons whole fennel seeds",
        "1 (1-inch) cinnamon stick",
        "1/4 cup whole macadamia nuts (8 to 10 nuts), plus 1/4 cup, chopped, for optional garnish",
        "8 shallots, coarsely chopped (about 1 1/4 cups)",
        "4 1/2 teaspoons ginger, minced (from about 1 1/2-inch knob)",
        "8 cloves garlic, roughly chopped",
        "2 tablespoons ground turmeric",
        "3 stalks fresh lemongrass, root ends trimmed and 1 or 2 outer layers discarded",
        "1/4 cup vegetable oil",
        "2 whole (3-pound) chickens, each cut into 8 pieces, then breasts cut in half",
        "2 tablespoons kosher salt",
        "2 (15 1/2-ounce) cans unsweetened coconut milk",
        "1/2 cup unsweetened shredded coconut, toasted",
        "Double recipe Steamed White Rice",
        "8 lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Sauté",
        "Dinner",
        "Coconut",
        "Macadamia Nut",
        "Potluck",
        "Lemongrass",
        "Simmer",
        "Chile Pepper",
        "Coffee Grinder",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken Curry",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-curry-350992"
}
