{
    "directions": [
        "Preheat the oven to 350 degrees F. Grease a 9-by-13-inch baking dish with 1 tablespoon butter.",
        "Put the ham on a paper towel-lined plate and microwave for about 3 minutes to reduce the moisture content. Mix together the Swiss and Monterey Jack cheese in a bowl.",
        "Put about a third of chicken in a layer in the bottom of the prepared baking dish. Top with half the ham. Sprinkle over 1/4 cup of the mixed cheese. Repeat 1 more time, then finish with a layer of chicken.",
        "Melt the remaining 5 tablespoons butter in a skillet over medium heat. Put the panko in a bowl, pour in half of the melted butter, mix well and set aside.",
        "Add the flour to the remaining butter in the skillet and cook for 2 to 3 minutes, whisking out any lumps. Whisk in the milk, broth, Dijon and cayenne and let it cook until it begins to thicken. Remove from the heat and stir in 1 cup of the cheese until melted. Season with salt and pepper.",
        "Pour the sauce over the casserole. Sprinkle over the remaining 1 cup cheese, then the panko mix. Bake until the top is browned and the casserole is bubbling, 25 to 30 minutes."
    ],
    "ingredients": [
        "6 tablespoons salted butter",
        "2 cups small-cubed ham",
        "1 1/4 cups grated Swiss cheese",
        "1 1/4 cups grated Monterey Jack cheese",
        "4 cooked boneless, skinless chicken breasts, cut into cubes",
        "1/2 cup panko breadcrumbs",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "1 cup chicken broth",
        "2 tablespoons Dijon mustard",
        "1/2 teaspoon cayenne",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Casserole",
        "Casserole",
        "Chicken",
        "Poultry Recipes",
        "Chicken Cordon Bleu",
        "Cheese"
    ],
    "title": "Chicken Cordon Bleu Casserole",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-cordon-bleu-casserole"
}
