{
    "directions": [
        "In a large saucepan over medium heat, warm the oil. Add the onion and cook, stirring occasionally, until the onion is soft and translucent, about 4 minutes. Add the garlic and ginger and continue cooking until fragrant, about 1 minute. Add the 1 of the jalapeños, the star anise and cinnamon and stir to combine. Add the chicken broth and bring to a boil. Reduce the heat to a simmer, add the chicken to the liquid and cook until the chicken is cooked through, 20 to 25 minutes.",
        "Using tongs, remove the chicken from the liquid and transfer to a plate. Let cool slightly, then carefully remove the skin from the chicken and discard. Remove the meat from the bones and, using a fork, shred the meat into bite-sized pieces. Discard the bones.",
        "Trim the zucchini and, using the fine shredder blade of a spiralizer according to the manufacturer’s instructions, cut the zucchini into long strands, using scissors to cut the strands every 3 to 4 rotations. Repeat with the daikon and watermelon radishes.",
        "Add the shredded chicken, spiralized vegetables and soy sauce to the broth and stir to combine. Cook just until the vegetables are warmed through, about 2 minutes. Serve immediately with mint, lime wedges and the remaining jalapeño slices alongside. Serves 6.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 Tbs. vegetable oil",
        "1 yellow onion, thinly sliced",
        "2 garlic cloves, minced",
        "2-inch (5-cm) piece fresh ginger, peeled and minced",
        "2 jalapeño chiles, thinly sliced",
        "1 star anise pod",
        "1 tsp. ground cinnamon",
        "8 cups (64 fl. oz./2 l) chicken broth",
        "2 bone-in, skin-on chicken breasts (about 1 1/2 lb./750 g)",
        "2 zucchini",
        "1 daikon radish, peeled",
        "2 watermelon radishes, peeled",
        "1 Tbs. soy sauce",
        "Fresh mint leaves for serving",
        "Lime wedges for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chicken Pho with Radish and Zucchini Noodles",
    "url": "http://www.williams-sonoma.com/recipe/chicken-pho-with-radish-and-zucchini-noodles.html"
}
