{
    "directions": [
        "Bring 2 cups of water with 1 teaspoon salt to a boil in a pot; cook the chicken in the boiling water until until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Reserving the liquid, remove the chicken and allow to cool before removing the meat from the bones and shredding with two forks. Discard the skin and bones.",
        "While the chicken cools place the shiitake mushrooms in a bowl and pour enough warm water over them to cover completely; allow to soak until pliable, about 30 minutes. Remove from the water, slice, and set aside. Place the bean thread noodles in the water and add more warm water if needed to cover; allow to soak until soft, about 10 minutes. Drain. Cut the noodles if desired.",
        "Heat the olive oil in a skillet over medium heat; cook and stir the onion and garlic until softened, about 5 minutes. Add the achiote powder and continue to cook and stir until the mixture is well coated with the red-orange color. Stir the shredded chicken meat, sliced shiitake mushrooms, and fish sauce into the mixture; season with salt and pepper to taste. Allow the mixture to cook about 5 minutes before pouring the reserved liquid from cooking the chicken and the chicken broth into the mixture. Bring to a boil for 5 minutes. Add the noodles and cook another 5 minutes. Garnish with the green onion to serve."
    ],
    "ingredients": [
        "2 cups water",
        "1 teaspoon salt",
        "1 pound chicken legs",
        "1 ounce dried shiitake mushrooms",
        "8 ounces bean thread noodles (cellophane noodles)",
        "3 tablespoons olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 1/2 teaspoons achiote powder",
        "1 tablespoon fish sauce",
        "salt and pepper to taste",
        "2 (14.5 ounce) cans chicken broth",
        "2 green onions, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Sotanghon",
    "url": "http://allrecipes.com/recipe/212931/chicken-sotanghon/"
}
