{
    "directions": [
        "Bring chicken bones, broth, carrot, onion, celery, garlic, peppercorns, bay leaf, and cloves to a boil in a 3- to 4-quart heavy saucepan, then simmer, partially covered, skimming froth, 30 minutes.",
        "Pour stock through a large sieve into a bowl, discarding solids, and return to saucepan. Measure stock: If more than 2 cups, boil until reduced. Keep warm, covered.",
        "Put oven rack in middle position and preheat oven to 350°F. Butter a shallow 3-quart glass or ceramic baking dish.",
        "Heat 3 tablespoons butter in a large heavy skillet over moderately high heat until foam subsides, then sauté mushrooms with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring, until liquid mushrooms give off is evaporated and mushrooms begin to turn golden, about 8 minutes.",
        "Melt remaining 3 tablespoons butter in a 2- to 3-quart heavy saucepan over low heat, then add flour and cook roux, whisking, 3 minutes. Add warm stock in a fast stream, whisking constantly, and bring to a boil. Reduce heat and simmer, whisking occasionally, 5 minutes. Add cream, Sherry, remaining 1/4 teaspoon salt, and remaining 1/8 teaspoon pepper and simmer over low heat, whisking occasionally, 10 minutes. Stir in truffle butter (if using).",
        "Cook spaghetti in a large pot of >boiling salted water until al dente, then drain well.",
        "Toss together spaghetti, mushrooms, and half of sauce in a large bowl, then transfer to baking dish. Stir together chicken meat and remaining sauce in same large bowl. Make a depression in spaghetti, then spoon chicken into it and sprinkle dish with cheese.",
        "Bake until sauce is bubbling and top is lightly browned, about 30 minutes. Serve immediately.",
        "*Available at some specialty foods shops and D'Artagnan (800-327-8246)."
    ],
    "ingredients": [
        "1 to 1 1/2 pound chicken bones (from 2 cooked chickens), broken into 2- to 3-inch pieces",
        "4 cups low-sodium chicken broth",
        "1 carrot, thinly sliced",
        "1 medium onion, coarsely chopped",
        "2 celery ribs, cut into 1-inch pieces",
        "2 garlic cloves, smashed",
        "5 whole black peppercorns",
        "1 Turkish or 1/2 California bay leaf",
        "2 whole cloves",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3/4 pound mushrooms, thinly sliced",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 tablespoons all-purpose flour",
        "1 cup heavy cream",
        "3 tablespoons medium-dry Sherry",
        "2 tablespoons truffle butter* (optional)",
        "1/2 lb spaghetti",
        "2 pounds chicken meat (from 2 cooked chickens), torn into 1-inch pieces",
        "1 ounce freshly grated Parmigiano-Reggiano (1/2 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Pasta",
        "Bake",
        "Super Bowl",
        "Kid-Friendly",
        "Parmesan",
        "Fall",
        "Potluck",
        "Gourmet"
    ],
    "title": "Chicken Tetrazzini",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tetrazzini-108730"
}
