{
    "directions": [
        "1. The day before, using 4 cloves of the garlic and 2 tablespoons of salt prepare the chickens as directed below under Basic Method For Preparing Poultry, then marinate both chickens and livers in 1 teaspoon of salt, the remaining 2 cloves of garlic, sliced thin, the spices, and the oil. Refrigerate, covered.",
        "2. The next day, place the chickens, livers, and marinade in the casserole. Add 1/2 cup of the grated onion, the saffron, herbs, and 2 cups water. Bring to a boil, cover, and simmer 30 minutes, turning the chickens often in the sauce.",
        "3. While the chickens are cooking, rinse and pit the olives. (If they seem a little bitter, cover with cold water, bring to a boil, and drain.) Set aside.",
        "4. Remove the chicken livers from the casserole and mash them fine. Return to the casserole with the remaining grated, drained onions. (This will give a good deal of heftiness to the sauce.) Add water, if necessary. Continue cooking 20 minutes, partially covered.",
        "5. Rinse the preserved lemons (discarding the pulp, if desired) and quarter. Add the olives and preserved lemon quarters to the sauce when the chickens are very tender and the flesh falls easily from the bone. Continue cooking 5 to 10 minutes, uncovered.",
        "6. Transfer the chickens to a serving dish and spoon the olives and lemons around them. Cover and keep warm. By boiling rapidly, uncovered, reduce the sauce to 1 1/2 cups. Add the juice of 2 fresh lemons to the sauce in the pan. Add more salt (and more lemon juice, if desired) to taste. Pour the sauce over chickens and serve at once.",
        "The timing in the recipe includes these steps:",
        "1. Wash the chickens or other poultry in salted water and drain. Pound 4 cloves garlic and 2 tablespoons salt into a paste. Rub the paste into the cavity and flesh of the poultry, at the same time pulling out excess fat from under the skin and from the neck and rump ends. Pull out the thin translucent membrane from under the skin of the breast. Rinse the poultry well under running water until it no longer smells of garlic. (The garlic is used to rid the poultry of any bitterness that might spoil a sauce; it also brings out its flavor, much like MSG.) Drain the poultry well.",
        "2. If you suspect that your poultry is tasteless on account of \"scientific breeding,\" use a method invented by Janet Jaidi to improve its taste: Rub it with the spices to be used in the recipe, a little butter and oil, and marinate it overnight. (If you do this, remember that you may have to readjust the spicing of your sauce at the end.)",
        "3. If you are using whole poultry, it must be trussed. Trussing poultry is easy: clip off the wing tips and discard; slip the ends of the legs into a horizontal incision made just about the rump (turkeys often come this way), or slip the legs into incisions made on the lower sides of the breast.",
        "Note: When stuffing turkeys or squabs or chickens, do not wash with garlic or salt.",
        "•Wolfert recommends using organic free-range chicken for its noticeably superior maximum flavor and moist texture. Free-range poultry is available at health food stores, an increasing number of supermarkets, and at dartagnan.com.\n•Like many Moroccan clay-pot dishes, this chicken can be prepared in a slow cooker with very good results. Wolfert recommends Rival's Versaware model because the crock pot can be removed and used on the stovetop or in the oven (available at rivalproducts.com)."
    ],
    "ingredients": [
        "2 to 3 chickens, whole or quartered, with their livers",
        "6 cloves garlic, peeled",
        "Salt",
        "1 teaspoon ground ginger",
        "1 teaspoon sweet paprika",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground black pepper",
        "1/4 cup salad oil",
        "2 1/2 cups grated onion, drained",
        "1/4 teaspoon pulverized saffron (mixed with turmeric, if desired)",
        "1/2 cup mixed, chopped fresh herbs (green coriander and parsley)",
        "1 1/2 cups ripe \"green-brown\" olives, such as Royal-Victorias",
        "2 preserved lemon",
        "2 to 3 fresh lemons",
        "Large bowl",
        "Paring knife",
        "6-quart casserole with cover",
        "Strainer, if necessary",
        "Small mixing bowl"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Chicken",
        "Citrus",
        "Olive",
        "Poultry",
        "Lemon"
    ],
    "title": "Chicken with Lemons and Olives Emshmel",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-lemons-and-olives-emshmel-231572"
}
