{
    "directions": [
        "1. Heat the butter in a wide, heavy-bottomed sauté pan until it begins to melt and foam. Season the chicken with salt and pepper. Add the breasts to the pan and brown them on one side, 6 to 8 minutes. Turn them over and cook them until well browned on the other side, about 6 more minutes. The chicken is done when it is firm to the touch and the juices run clear. Transfer the chicken to a plate and cover with foil to keep warm.",
        "2. Add the shallots to the same pan and sauté until softened but not browned, about 2 minutes. Lower the heat, move the pan away from the flame, lean away from it, and carefully pour in the brandy, taking care not to let it flame. (If it does flame, cover with a pot lid until the brandy cooks out.) Continuing to be mindful of potential flare-ups, return the pan to the stove and let the brandy evaporate over low heat.",
        "3. Add the wine to the pan, raise the heat to high, and bring it to a boil. Whisk in the mustard and let reduce for 1 minute. Pour in the broth and cook for 2 to 3 minutes more.",
        "4. Stir in the cream and bring just to a boil. Stir in the chives. Return the chicken breasts to the pan and simmer gently until the stock has reduced and thickened slightly, 4 to 5 minutes.",
        "5. To serve, put 1 chicken breast in the center of each of 4 plates and spoon some sauce over the top.",
        "Your Nightly Specials\nInstead of chicken, use small beefsteaks or pork loin chops. Cooking time will vary based on thickness and desired doneness, but will be about 2 minutes more per side than the chicken.",
        "For a spicier sauce, add 1 teaspoon hot, dry, English mustard to the sauce along with the Dijon."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "Four 8-ounce skinless, boneless chicken breasts, slightly pounded, and flattened",
        "Fine sea salt and freshly ground pepper",
        "3 tablespoons chopped shallots",
        "1/2 cup brandy, apple brandy, pear brandy, or Kentucky bourbon",
        "1/2 cup dry white wine",
        "3 tablespoons Dijon mustard",
        "1 1/2 cups homemade chicken stock, or store-bought low sodium chicken broth",
        "1/2 cup heavy cream",
        "3 tablespoons minced fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Mustard",
        "Poultry",
        "Sauté",
        "Wheat/Gluten-Free",
        "Dinner",
        "Chive",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Breasts with Chive and Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-with-chive-and-mustard-sauce-232200"
}
