{
    "directions": [
        "Rub chicken with salt and let stand at room temperature 30 minutes.",
        "While chicken stands, gently mash tamarind with hot water in a bowl using your fingertips until pulp is softened, then force with a rubber spatula through a medium-mesh sieve into a small bowl, discarding solids. Pulse shallots, chiles, ginger, and turmeric with cumin and coriander in a food processor until finely chopped. Lightly smash lemongrass stalks with bottom of a heavy skillet.",
        "Stir together coconut milk, tamarind purée, shallot mixture, lemongrass, galangal, and palm sugar in a 6- to 7-quart wide heavy pot. Add chicken and bring to a simmer over moderately high heat, stirring frequently, then reduce heat and gently simmer, partially covered, until very tender, 40 to 45 minutes. Transfer chicken with tongs to a bowl and simmer sauce, uncovered, stirring frequently, until thickened and reduced to about 4 cups, 20 to 25 minutes. Remove from heat and let stand 5 minutes, then skim off any fat if desired. Discard lemongrass and season sauce with salt. Add chicken and stir to coat."
    ],
    "ingredients": [
        "3 pound chicken drumsticks and thighs",
        "2 teaspoons salt",
        "2 rounded tablespoons tamarind from a pliable block",
        "1/2 cup hot water",
        "1 cup chopped shallots (4 large)",
        "10 (5 1/2-inch) fresh Holland red chiles, sliced crosswise (1 cup), including seeds",
        "1 tablespoon chopped peeled fresh ginger",
        "2 teaspoons chopped peeled turmeric (fresh or thawed frozen) or 1 teaspoon ground turmeric",
        "1 teaspoon ground cumin",
        "2 teaspoons ground coriander",
        "2 fresh lemongrass stalks, 1 or 2 outer leaves and all but lower 6 inches discarded",
        "6 cups well-stirred canned unsweetened coconut milk (48 fl oz; not low-fat)",
        "1 (1-inch) piece galangal (fresh or thawed frozen), sliced crosswise",
        "2 teaspoons packed dark palm sugar or dark brown sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Milk/Cream",
        "Chicken",
        "Braise",
        "Spice",
        "Hot Pepper",
        "Shallot",
        "Lemongrass",
        "Gourmet"
    ],
    "title": "Chicken in Spicy Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-spicy-coconut-sauce-234647"
}
