{
    "directions": [
        "In a large heavy skillet heat the oil over moderately high heat until it is hot but not smoking and in it cook the chicken breasts, patted dry and seasoned with salt and pepper, skin sides down, for 3 to 4 minutes, or until they are golden. Turn the breasts and cook them over moderate heat, covered, for 7 to 8 minutes more, or until they are cooked through. Transfer the breasts to a platter and keep them warm. To the skillet add the garlic, the shallot, and the 2 thyme sprigs (or the dried thyme if using) and cook the mixture, stirring, until the shallot is softened. Add the vinegar, boil the mixture until the vinegar is almost evaporated, and add the mushrooms. Cook the mixture over moderate heat, stirring, for 1 minute, add the wine, and boil the mixture until the wine is almost evaporated. Add 1 1/4 cups of the broth and the scallions and simmer the mixture for 1 minute. In a small bowl whisk together the remaining 1/4 cups broth and the arrowroot and add the mixture to the skillet with the tomatoes and the fresh thyme leaves. Simmer the sauce, stirring, for 1 minute, or until it is thickened, stir in any juices that have accumulated around the chicken, and add salt and pepper to taste. Transfer a chicken breast to each of 6 dinner plates, spoon some of the sauce over each breast, and garnish each serving with 1 of the additional thyme sprigs."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "3 whole boneless chicken breasts, halved",
        "1 tablespoon minced garlic",
        "1/2 cup minced shallot",
        "2 thyme sprigs plus 1 tablespoon fresh thyme leaves, or 1 teaspoon dried thyme, crumbled",
        "2 tablespoons white-wine vinegar",
        "1/4 pound fresh shiitake mushrooms, stems discarded and the mushrooms sliced",
        "1/2 cup dry white wine",
        "1 1/2 cups chicken broth",
        "2 bunches of scallions, dark green parts reserved for another use and the scallions split lengthwise and cut crosswise into 1-inch pieces (about 1 cup)",
        "2 1/2 teaspoons arrowroot",
        "3 plum tomatoes, seeded and diced fine",
        "6 additional thyme sprigs for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Poultry",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "White Wine",
        "Thyme",
        "Gourmet"
    ],
    "title": "Chicken Breasts with Scallions, Shiitake Mushrooms, and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-with-scallions-shiitake-mushrooms-and-tomatoes-11904"
}
