{
    "directions": [
        "Put a drizzle of oil into a large sauté pan on a high heat. Use scissors to snip the bacon into bite-size pieces. Add them to the pan once hot and fry for a couple of minutes, stirring every so often, until they are browned.",
        "While the bacon cooks, season the chicken pieces well with salt and pepper.",
        "Remove the bacon from the pan, leaving the fat behind, and set aside to drain on paper towels. Put the chicken in, top side down, reduce the heat to medium and leave to cook for about 4 minutes.",
        "Meanwhile, trim and finely slice the green onions (both the green and the white bits) and mushrooms and peel and finely chop the garlic. Run your fingers down the length of the rosemary stalks to release their leaves and finely chop them too. Set everything aside.",
        "The chicken pieces should now be golden brown underneath, so flip them over and leave to cook on the other side for about 3 minutes.",
        "Once the chicken is golden brown, turn down the heat to low and add the prepared mushrooms, garlic and rosemary, along with the tomatoes, Madeira (or red or white wine or stock), harissa paste or tomato purée and oregano, and crumble in the bay leaf.",
        "Give it a good stir and then leave to bubble away for 15–20 minutes, stirring from time to time so that it does not stick to the bottom.",
        "When the chicken dish is about halfway through cooking, add the reserved cooked bacon and green onions, then put the kettle on. Use the boiled water to cook the pasta in a large saucepan according to the package's instructions. Once it is cooked, drain the pasta and then return it to the pan with the lid on to keep warm if necessary.",
        "Check to see if the chicken is cooked—if the juices run clear, it is ready. Taste the sauce, adding a little sugar and/or a pat of butter if the sauce is still a bit acidic from the tomatoes. Add a drizzle of water if the sauce is too thick and let it bubble away for a bit longer if too thin.",
        "Divide the pasta among four plates, top with a piece of chicken breast or two thighs, spoon some sauce over and scatter with some ripped-up basil or parsley leaves, if using."
    ],
    "ingredients": [
        "Vegetable oil",
        "4 strips of bacon",
        "4 skinless, boneless chicken breasts or 8 skinless, boneless chicken thighs",
        "Salt and freshly ground black pepper",
        "1 bunch of green onions",
        "5 ounces cremini or black poplar mushrooms",
        "2 garlic cloves",
        "2 sprigs of fresh rosemary",
        "2 (14-ounce cans) of chopped tomatoes",
        "A good glug (about 1/2 cup) of Madeira (or red or white wine or chicken stock)",
        "1 tablespoon harissa paste (you can get it from most supermarkets) or 3 tablespoons tomato purée",
        "Pinch of dried oregano",
        "1 dried bay leaf",
        "11 ounces of your favorite pasta (I love to use penne or rigatoni)",
        "1–2 teaspoons sugar (optional)",
        "Pat of butter (optional)",
        "Small handful of fresh basil or parsley leaves (optional)",
        "Large sauté pan, scissors, kettle, large saucepan with lid, colander"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pasta",
        "Tomato",
        "Kid-Friendly",
        "Dinner",
        "Low Cholesterol",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Cacciatore with Harissa, Bacon, and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-cacciatore-with-harissa-bacon-and-rosemary-56390037"
}
