{
    "directions": [
        "Place the chickens, onions, carrots, celery, parsnips, parsley, thyme, dill, garlic, and seasonings in a 16- to 20-quart stockpot. Add 7 quarts of water and bring to a boil. Simmer, uncovered, for 1 hour. Remove 2 of the chickens and allow to cool slightly. Remove the breast meat from both chickens and set aside. Return the remaining chicken and carcasses to the pot and continue simmering, uncovered, for 3 more hours. Strain the entire contents of the pot through a colander and chill. Remove the surface fat, then reheat the stock as follows, or pack in containers and freeze.",
        "To serve the soup, return the stock to the pot and reheat, adding the diced carrots, celery, dill, and parsley. Shred the reserved chicken breast meat into large pieces and add to the stock. Simmer over low heat for 5 minutes to cook the vegetables and reheat the chicken. Season, to taste, and serve as is, or ladle each serving over 2 warm Matzo Balls.",
        "Whisk together the egg yolks, chicken stock, chicken fat, parsley, and salt. Stir in the matzo meal. In the bowl of an electric mixer with a whisk attachment, whip the egg whites with a pinch of salt until they are stiff. Whisk them into the matzo mixture until it is smooth. Refrigerate for at least 15 minutes, or until the mixture is thick.",
        "Form balls the size of golf balls by shaping them with 2 spoons, rolling them with your hands, or scooping them with a small ice cream scoop. Drop them into simmering chicken stock and cook for 30 minutes, or until fully cooked and puffed, turning once. Remove and serve hot in chicken soup."
    ],
    "ingredients": [
        "3 (5-pound) roasting chickens",
        "3 large yellow onions, unpeeled and quartered",
        "6 carrots, unpeeled and halved",
        "4 stalks celery with leaves, cut into thirds",
        "4 parsnips, unpeeled and cut in half (optional)",
        "20 sprigs fresh parsley",
        "15 sprigs fresh thyme",
        "20 sprigs fresh dill",
        "1 head garlic, unpeeled and cut in half crosswise",
        "2 tablespoons kosher salt",
        "2 teaspoons whole black peppercorns",
        "4 cups 1/4-inch-diced carrots",
        "4 cups 1/4-inch-diced celery",
        "1/4 cup minced fresh dill",
        "1/4 cup minced fresh parsley",
        "Matzo Balls, (see recipe)",
        "4 extra-large eggs, separated",
        "1/2 cup good chicken stock",
        "1/4 cup rendered chicken fat, melted",
        "1/2 cup minced fresh parsley",
        "2 teaspoons kosher salt, plus more for egg whites",
        "1 cup matzo meal"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Chicken Soup",
        "Soup",
        "Carrot Soup",
        "Vegetable Soup",
        "Carrot Recipes",
        "Vegetable",
        "Celery"
    ],
    "title": "Chicken Soup",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/chicken-soup-recipe"
}
