{
    "directions": [
        "Combine the onions, carrots, chilies, ginger, bay leaves, peppercorns, and water in a medium pot and bring to a boil over high heat. Reduce the heat to medium, add the chicken thighs, and simmer, uncovered, for 15 minutes. Add the chicken breasts and simmer for another 10 minutes, or until the chicken is cooked through.",
        "While the chicken is simmering, toast the peanuts in a small dry sauté pan over medium heat until golden brown and fragrant. Let cool, then grind 1 cup of the toasted peanuts in a blender to a smooth paste. Set aside.",
        "Using tongs, remove the chicken from the cooking liquid and set aside. Using a slotted spoon, transfer the vegetables to a food processor; discard the bay leaves. Puree the vegetables until smooth. Set the broth aside.",
        "Heat the oil in a large sauté pan over medium heat. When it begins to shimmer, add the potatoes and sauté until they are golden brown, about 10 minutes. Add the chicken pieces and brown them on all sides, about 10 minutes. Remove the pan from the heat.",
        "Stir the vegetable puree into the broth and bring to a boil. Add the peanut puree and the remaining cup of whole peanuts and whisk until well combined. Add the tomatoes, chicken, and potatoes and simmer until heated through, about 5 minutes.",
        "Remove from the heat and season with the salt. Add the spinach and stir until the spinach is wilted.",
        "Serve with Yellow Rice."
    ],
    "ingredients": [
        "2 medium white onions, sliced",
        "2 carrots, peeled and cut into 1-inch pieces",
        "2 Scotch bonnet chilies, cut in half, seeds and ribs removed",
        "One 3-inch piece ginger, peeled and sliced",
        "2 bay leaves",
        "6 white peppercorns",
        "4 cups water",
        "4 boneless, skinless chicken thighs, each cut into 4 pieces",
        "4 boneless, skinless chicken breasts, each cut into 4 pieces",
        "2 cups unsalted peanuts",
        "3 tablespoons olive oil",
        "2 baking potatoes, peeled and cut into 2-inch cubes",
        "4 tomatoes, cut into quarters, or 2 cups roughly chopped canned tomatoes",
        "1 teaspoon salt",
        "1 pound spinach, tough stems removed, washed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Chicken",
        "Onion",
        "Potato",
        "Ramadan",
        "Dinner",
        "Peanut",
        "Spinach",
        "Healthy",
        "Simmer",
        "Boil"
    ],
    "title": "Chicken-Peanut Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-peanut-stew-354649"
}
