{
    "directions": [
        "Heat olive oil in heavy medium saucepan over medium-low heat. Add onion and chilies; cook until onion is translucent, stirring occasionally, about 8 minutes. Add chili powder and cumin; stir 30 seconds. Add beans and lime juice. Cook until heat through, stirring and mashing beans slightly with spoon, about 4 minutes. (Can be prepared 1 day ahead. Cover and chill.)",
        "Heat oil in heavy large skillet over high heat. Add chicken and sprinkle with salt and pepper. Stir until almost cooked through, about 3 minutes. Add chili powder and cumin and stir until cooked through, about 30 seconds. Remove from heat.",
        "Combine first 3 ingredients in large bowl.",
        "Add oil to depth of 1/4 inch to heavy medium skillet. Heat over medium-high heat until just beginning to smoke. Add tortilla and cook until crisp, abut 30 seconds per side. Drain on paper towels. Repeat with remaining tortillas.",
        "Add 1/4 cup olive oil to salad; toss Season with salt and pepper. Add 1 tablespoon lime juice; toss. Rewarm beans over medium-low heat, stirring and thinning slightly with water. Place 1 tortilla on each plate. Spread with beans. Sprinkle with cheese. Top with salad, then chicken, salsa and cilantro."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 red onion, chopped",
        "2 large jalapeño chilies, seeded but not deveined, minced",
        "1 teaspoon chili powder",
        "1/2 teaspoon ground cumin",
        "2 16-ounce cans black beans, rinsed, drained",
        "2 tablespoons fresh lime juice",
        "2 tablespoons olive oil",
        "1 1/2 pounds boneless chicken breasts, skinned, cut into 3/4-inch pieces",
        "1 1/2 teaspoon chili powder",
        "3/4 teaspoon ground cumin",
        "4 cups sliced romaine lettuce",
        "1 medium head radicchio, sliced",
        "1/2 cup fresh cilantro leaves",
        "Vegetable oil",
        "6 corn tortillas",
        "1/4 cup olive oil",
        "1 tablespoon fresh lime juice",
        "2 tablespoons (about) water",
        "1/2 pound goat cheese, crumbled",
        "Avocado Salsa",
        "6 fresh cilantro springs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Chicken",
        "Herb",
        "Goat Cheese",
        "Summer"
    ],
    "title": "Chicken, Black Bean and Goat Cheese Toastadas",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-black-bean-and-goat-cheese-toastadas-4498"
}
