{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place each chicken breast between two sheets of plastic wrap, and pound to 1/2-inch thick. Dip each breast into lightly beaten eggs, then into bread crumbs, coating evenly.",
        "Heat 2 tablespoons of oil in a large skillet over medium heat. Cook chicken breasts until golden brown, about 7 minutes on each side. Reduce heat if they brown too quickly; they need to be cooked through. Remove from heat and place on plate lined with paper towels. Wipe crumbs from skillet.",
        "Heat remaining 1 tablespoon of oil in the skillet over medium heat. Add onions and stir until softened, about 5 minutes. Add the garlic, stir for 1 minute. Pour in the tomato sauce. Season with salt and pepper and simmer, uncovered, for 10 minutes, stirring occasionally.",
        "Arrange bottom halves of 6 hoagies on one baking sheet, the tops on another, all with cut sides up. Spread about a tablespoon of tomato sauce onto each hoagie top and bottom, reserving the remainder. Place a cooked chicken breast onto each bottom half. Spoon the remaining tomato sauce over each breast and top with the artichoke hearts and one slice each of mozzarella and tomato. Sprinkle with the grated Parmesan cheese.",
        "Bake on the bottom rack of the oven for 3 minutes or until the cheese begins to melt. Then place the sheet with the hoagie tops on an upper rack and bake until edges are golden, 3 to 4 minutes, being careful not to let them burn. Remove both sheets from the oven. Place a top on each bottom to form 6 sandwiches."
    ],
    "ingredients": [
        "6 boneless skinless chicken breast halves",
        "2 eggs, lightly beaten",
        "1 1/2 cups bread crumbs",
        "3 tablespoons olive oil, divided",
        "1 small onion, diced",
        "2 cloves garlic, chopped",
        "1 (10 ounce) can tomato sauce",
        "1/2 teaspoon salt",
        "3/4 teaspoon black pepper",
        "6 hoagie rolls, split lengthwise",
        "1 (12 ounce) jar artichoke hearts, drained",
        "6 slices mozzarella cheese",
        "6 slices red tomato",
        "1/2 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken, Artichoke Heart, and Parmesan Sandwiches",
    "url": "http://allrecipes.com/recipe/139947/chicken-artichoke-heart-and-parmesa/"
}
