{
    "directions": [
        "Preheat oven to 400°F. Heat oil in large ovenproof skillet over medium heat. Sprinkle chicken leg-thigh pieces with salt and pepper. Add chicken to skillet and cook until golden brown, about 5 minutes per side. Add 1-inch pieces of celery, onion, and carrot, and bay leaf. Cook until vegetables begin to soften, stirring occasionally, about 8 minutes. Add wine and stir 1 minute, scraping up browned bits. Add broth, cover, and braise in oven until chicken is tender, about 40 minutes.",
        "Transfer chicken to plate. Strain broth into medium bowl, pressing on solids to release liquid. Discard solids in strainer. Remove meat from leg-thigh chicken pieces and transfer to bowl. Discard skin and bones. DO AHEAD: Broth and chicken can be made 1 day ahead. Cover broth and chicken separately and refrigerate.",
        "Cook sugar snap peas and chopped celery in large saucepan of boiling salted water until crisp-tender, about 1 minute. Using slotted spoon, transfer vegetables to bowl of ice water to cool. Cook baby carrots in same water until crisp-tender, about 5 minutes. Using slotted spoon, transfer to same bowl of ice water to cool. Cook pearl onions in same water until tender, about 8 minutes. Using slotted spoon, transfer to bowl of ice water to cool. Trim root end of onions; peel. Transfer sugar snap peas, celery, baby carrots, and pearl onions to medium bowl. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Melt butter in heavy very large skillet or large pot over medium-high heat. Sprinkle chicken breast pieces with salt and pepper; add chicken to skillet and sauté 2 minutes. Sprinkle with flour and stir over medium-low heat until chicken is just cooked through, about 8 minutes. Stir in reserved chicken leg-thigh meat, chicken broth, sugar snap peas, celery, carrots, pearl onions, cream, parsley, and thyme. Stir until vegetables are warm and sauce thickens slightly, about 5 minutes. Season chicken and vegetables to taste with salt and pepper. Stir in dumplings and simmer until dumplings are warmed through, about 1 minute."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "4 whole leg-thigh chicken pieces",
        "2 celery stalks, cut into 1-inch pieces",
        "1 onion, cut into 1-inch pieces",
        "1 large carrot, peeled, cut into 1-inch pieces",
        "1 bay leaf",
        "1/2 cup dry white wine",
        "4 cups low-salt chicken broth",
        "1 cup sugar snap peas, trimmed",
        "1/2 cup chopped celery",
        "1 cup baby carrots",
        "12 pearl onions",
        "3 tablespoons butter",
        "4 skinless boneless chicken breast halves, cut into 1-inch cubes",
        "3 tablespoons all purpose flour",
        "1/4 cup whipping cream",
        "1 tablespoon chopped fresh Italian parsley",
        "1 teaspoon chopped fresh thyme",
        "Parsley dumplings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Dairy",
        "Onion",
        "Vegetable",
        "Sauté",
        "White Wine",
        "Fall",
        "Simmer"
    ],
    "title": "Chicken with Vegetables and Parsley Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-vegetables-and-parsley-dumplings-235873"
}
