{
    "directions": [
        "Heat olive oil in a large pot over medium-high heat, and cook and stir the chicken until lightly browned but still pink inside, about 5 minutes. Set chicken aside. Reduce heat to medium, and melt the butter in the same pot; cook and stir the leek and onion just until starting to brown, about 8 minutes. Stir in the garlic, and cook until fragrant, about 1 minute, then stir in the carrot and celery. Cook the vegetables for 1 or 2 more minutes, and stir in the mushrooms; cook, stirring often, until the mushrooms have released their liquid and the juice begins to dry up, about 10 minutes.",
        "Pour in the white wine, and scrape pot to loosen and dissolve the brown flavor bits left in the bottom. Stir in the stock, and bring the mixture to a simmer. Season to taste with salt and black pepper.",
        "Knot a short piece of kitchen twine tightly around the sprigs of thyme, rosemary, tarragon, oregano, parsley, and bay leaves to make a tidy package, and place the herb bouquet into the pot.",
        "Mix in the chicken pieces, cover the pot, and allow to simmer very gently until the chicken is cooked through, about 30 minutes. Do not boil. For a thicker stew, whisk flour with water in a small bowl, and whisk into the simmering sauce; allow to thicken, about 3 minutes. Remove herb bundle before serving in bowls."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 skinless, boneless chicken breast halves - cut into 1 inch cubes",
        "1 tablespoon butter",
        "1 leek, halved lengthwise and thinly sliced crosswise",
        "1 small onion, diced",
        "3 spring onions, finely sliced",
        "2 cloves garlic, smashed",
        "1 carrot, thickly sliced",
        "2 stalks celery, strings peeled, finely diced",
        "1 (16 ounce) package fresh mushrooms, quartered",
        "1/2 cup white wine",
        "2 cups chicken stock",
        "salt and ground black pepper to taste",
        "2 sprigs fresh thyme",
        "2 sprigs fresh rosemary",
        "2 sprigs fresh tarragon",
        "2 sprigs fresh oregano",
        "2 sprigs fresh parsley",
        "2 bay leaves",
        "2 tablespoons all-purpose flour (optional)",
        "3 tablespoons water (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Mushroom Stew",
    "url": "http://allrecipes.com/recipe/219125/chicken-mushroom-stew/"
}
