{
    "directions": [
        "In a saute pan over high heat, add canola oil. Saute red onions and bell peppers until translucent. Add ginger, garlic, bamboo shoots, celery, chicken, and cook for 5 minutes over medium heat. Deglaze pan with soy sauce. Cool mixture.",
        "In large bowl combine cabbage, carrots and chicken mixture.",
        "In medium saucepan, heat rice bran oil to 350 degrees F. Oil needs to be deep enough to keep egg roll from touching bottom of pan. Add more oil, if needed.",
        "To roll egg rolls, layout egg roll skin with corner facing you, place approximately 1/12th of mixture on roll and place 2 pieces of avocado on top of mixture. Fold corner over mixture, and then fold outside corners over the mixture, making a roll, 4 to 5-inches wide. Roll firmly, being careful not to tear wrapper, and seal the final edge with egg wash.",
        "Dredge the egg roll in egg wash, allow excess to drain off and submerge egg roll in oil. Fry until golden brown, about 3 to 4 minutes. Drain on sheet tray lined with a cooling rack."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "1/2 cup finely minced red onion",
        "1/4 cup finely minced red bell peppers",
        "2 tablespoons minced ginger",
        "1 tablespoon minced garlic",
        "1/4 cup sliced bamboo shoots",
        "1/4 cup finely chopped celery",
        "2 cups chopped chicken breast",
        "1/4 cup soy sauce",
        "1 cup julienned green cabbage",
        "1/2 cup shredded carrots",
        "4 cups rice bran oil or canola oil",
        "12 egg roll wrappers",
        "2 avocados, sliced into 24 pieces",
        "1 egg mixed with 1 tablespoon milk",
        "Jarred sweet chili sauce, for dipping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian Appetizer",
        "Appetizer",
        "Asian",
        "Cabbage Recipes",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Avocado",
        "Sauteing Recipes"
    ],
    "title": "Chicken Avocado Egg Rolls",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/chicken-avocado-egg-rolls-recipe"
}
