{
    "directions": [
        "Toss chicken with curry powder, salt, and pepper in a medium bowl.",
        "Heat 2 Tbsp. oil in a large skillet (at least 12\" in diameter) over medium-high. Add onion and cook, stirring, until softened, about 2 minutes.",
        "Purée coconut milk, ginger, and garlic in a blender until very smooth.",
        "Add chicken and coconut milk mixture to skillet and cook, tossing occasionally, until chicken is cooked through and sauce has thickened, 7-10 minutes.",
        "Meanwhile, if using, heat 2 tsp. oil in a small skillet over medium. Add cashews and mustard seeds and cook, stirring, until fragrant and lightly browned, 2–3 minutes. Immediately transfer mixture including the oil to a small bowl.",
        "Fold spinach into chicken mixture and cook until wilted, about 1 minute. Divide among 4 bowls. Top with cilantro and cashew mixture, if using. Serve with rice or naan alongside."
    ],
    "ingredients": [
        "2 pounds boneless, skinless chicken breasts or thighs (about 4 breasts or 7 thighs), cut into 1\" cubes",
        "2 1/2 teaspoons mild curry powder",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons virgin coconut or vegetable oil (plus 2 teaspoons; optional)",
        "1/2 medium onion, chopped",
        "1 (14-ounce) can coconut milk (preferably full-fat)",
        "1 (2 1/2\") piece ginger, peeled",
        "4 garlic cloves, peeled",
        "1/4 cup raw cashews, chopped (optional)",
        "1 1/2 teaspoons yellow and/or black mustard seeds (optional)",
        "5 ounces baby spinach",
        "Cilantro leaves with tender stems and cooked rice or naan (Indian flatbread; for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Curry",
        "Dinner",
        "Quick & Easy",
        "Chicken",
        "Coconut",
        "Ginger",
        "Cashew",
        "Spinach",
        "Garlic",
        "Takeout at Home"
    ],
    "title": "Coconut Chicken Curry in a Hurry",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-coconut-curry-in-a-hurry"
}
