{
    "directions": [
        "For the fresh mozzarella: Prepare a bowl of salted warm water and a separate bowl of salted ice water. In the salted warm water, soften the mozzarella curd and pull and shape into a ball. Drop into the salted ice bath to cool. Set aside and pat dry. Slice and let dry on a paper-towel-lined plate.",
        "For the tomato sauce: Heat the oil in a medium saucepan over medium heat. Add the onions and cook until soft, about 4 minutes. Add the garlic and red pepper flakes and cook for 30 seconds. Increase the heat to high and add the tomatoes and oregano if using. Season with salt and pepper. Cook, stirring occasionally, until slightly thickened, about 15 minutes. Taste for seasoning (adding a pinch of sugar if needed) and stir in the basil.",
        "For the chicken: Preheat the oven to 425 degrees F. Place a baking rack over a baking sheet and set aside.",
        "Put the breadcrumbs, flour and beaten eggs in separate shallow dishes and sprinkle with salt and pepper. Sprinkle each chicken breast on both sides with salt and pepper. Dredge each breast in the flour and tap off any excess, then dip in the egg wash and let the excess drip off. Finally, dredge in the breadcrumbs. Transfer the breasts to a baking sheet or large plate.",
        "Heat 1/4 cup of the oil in a large saute pan over high heat until it begins to shimmer. Cook 2 breasts at a time in the hot oil until golden brown on both sides, about 3 minutes per side. Transfer the breasts to the baking rack on the baking sheet. Repeat with the remaining chicken breasts and oil. Place in the oven to cook further for a couple minutes, then remove and set aside.",
        "Change the oven setting to broil.",
        "For the arugula salad: Dress the arugula in a large bowl with the lemon juice, extra virgin olive oil, salt and pepper and toss together.",
        "Top each chicken breast with some tomato sauce and mozzarella slices. Broil until the chicken is cooked through and the cheese has melted, 1 to 3 minutes.",
        "Place some arugula salad on each plate next to a chicken piece. Garnish with freshly grated Parmesan, chopped basil and parsley sprigs."
    ],
    "ingredients": [
        "Kosher salt",
        "8 ounces fresh mozzarella curd",
        "2 tablespoons olive oil",
        "1 small Spanish onion, finely diced",
        "2 cloves garlic, finely chopped",
        "Pinch of red pepper flakes",
        "One 28-ounce can crushed tomatoes",
        "1 teaspoon finely chopped fresh oregano, optional",
        "Kosher salt and freshly ground black pepper",
        "Pinch of sugar, if needed",
        "3 tablespoons chopped fresh basil",
        "2 cups breadcrumbs",
        "2 cups all-purpose flour, for dredging",
        "4 large eggs, beaten",
        "Kosher salt and freshly ground black pepper",
        "Four 6-ounce boneless, skinless chicken breasts, pounded thinly between pieces of waxed paper or plastic wrap",
        "1/2 cup canola oil",
        "2 cups fresh arugula",
        "1/2 lemon, juiced",
        "Extra virgin olive oil, as needed",
        "Kosher salt and freshly ground black pepper",
        "Freshly grated Parmesan, for garnish",
        "Chopped fresh basil, for garnish",
        "Fresh parsley leaves, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Mozzarella Recipes",
        "Chicken",
        "Poultry Recipes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Chicken Parmesan",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/chicken-parmesan"
}
