{
    "directions": [
        "In a small bowl, stir together the garlic and butter until well combined. Set aside. Place a chicken breast half on a work surface with the thick side facing to the right (if you're right-handed), and place your left hand down on the chicken breast. Using a very sharp knife, carefully cut the chicken breast from the thick side to about 1/2 inch from the edge of the thin side, in a horizontal cut. Open the cut chicken breast and spread it out like an open book. Using a meat mallet, gently pound the butterflied chicken breast out until it's an even thickness.",
        "Place the flour into a shallow dish, and dredge each chicken breast on both sides with flour. Melt the garlic butter in a large skillet over medium heat until it stops foaming, and cook each chicken breast until golden brown on both sides, 6 to 8 minutes per side. Sprinkle each breast with salt and pepper. Remove the chicken breasts to a platter, and keep warm.",
        "Cook and stir the mushrooms in the same skillet as the chicken until the mushrooms have absorbed the remaining butter in the skillet and have begun to turn brown at the edges. Stir in capers, lemon juice, white wine, and chicken demi-glace, and stir to combine. Reduce to a simmer. Adjust salt and pepper again, and stir the parsley into the sauce.",
        "Remove the chicken breasts to plates, and serve the sauce over the chicken. Garnish each serving with a lemon slice."
    ],
    "ingredients": [
        "1 clove garlic, pressed",
        "1/4 cup butter, softened",
        "2 skinless, boneless chicken breast halves",
        "1/2 cup all-purpose flour",
        "salt and ground black pepper to taste",
        "4 ounces sliced mushrooms",
        "20 capers, or to taste",
        "2 tablespoons lemon juice",
        "1/4 cup white wine",
        "2 tablespoons chicken-flavored demi-glace, or to taste",
        "1 teaspoon chopped fresh parsley, or to taste",
        "2 lemon slices"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Scallopini",
    "url": "http://allrecipes.com/recipe/215619/chicken-scallopini/"
}
