{
    "directions": [
        "Heat oil in large nonstick skillet over medium-high heat. Add poblano chiles; sauté until beginning to soften, about 3 minutes. Add chicken, cumin, and chili powder; sprinkle with salt and pepper. sauté until chicken is almost cooked through, 2 to 3 minutes. Mix in taco sauce; cook 1 minute. Stir in corn; sauté until heated through, about 1 minute. Season to taste with salt and pepper. Remove from heat; cover to keep warm.",
        "Working with 1 tortilla at a time, heat tortillas over open flame or electric burner until beginning to soften and brown in spots, about 15 seconds per side. Spoon chicken mixture in strip down center of each tortilla; top with cheese and cilantro. Fold in sides of tortilla over filling; roll up, enclosing filling.",
        "*Often called pasillas; available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "3 medium-size fresh poblano chiles,* seeded, chopped (about 1 1/2 cups)",
        "1 1/2 pounds skinless boneless chicken breast halves or cutlets, cut crosswise into 1/2-inch-thick strips",
        "1 3/4 teaspoons ground cumin",
        "1 3/4 teaspoons chili powder",
        "3/4 cup bottled red taco sauce",
        "2 cups frozen mixed white and yellow corn kernels, thawed, patted dry",
        "6 burrito-size flour tortillas",
        "2 cups (packed) grated four-cheese Mexican blend or queso fresco (about 8 ounces)",
        "1 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pepper",
        "Sauté",
        "Super Bowl",
        "Kid-Friendly",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Corn",
        "Poker/Game Night",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken Burritos with Poblano Chiles and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-burritos-with-poblano-chiles-and-corn-241890"
}
