{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F.",
        "Pat chicken dry and sprinkle with 3/4 teaspoon salt and 1/4 teaspoon pepper.",
        "Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté chicken, turning over once, until browned, about 8 minutes total.",
        "Transfer chicken with tongs to a small shallow baking pan, reserving fat in skillet. Bake until just cooked through, about 8 minutes.",
        "While chicken bakes, add remaining 2 tablespoons oil to skillet and cook garlic over moderate heat, stirring, until pale golden, 1 to 2 minutes. Add wine and tomato paste and simmer, stirring and scraping up any brown bits, 3 minutes.",
        "Sprinkle shrimp with remaining 1/4 teaspoon each of salt and pepper, then add to wine mixture and cook, stirring, until opaque, 1 to 2 minutes. Transfer one third of shrimp to a blender, along with enough sauce to blend, and purée until smooth. Stir purée into remaining sauce in skillet. Add cream, lemon juice, and any juices in baking pan and cook over moderately low heat until whole shrimp are just cooked through, about 1 minute.",
        "Serve chicken topped with sauce and sprinkled with chives."
    ],
    "ingredients": [
        "4 small skinless boneless chicken breast halves (1 1/4 lb total)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 cup olive oil",
        "1 tablespoon finely chopped garlic",
        "3/4 cup dry white wine",
        "2 tablespoons tomato paste",
        "3/4 lb peeled rock shrimp* or peeled medium shrimp",
        "1/4 cup heavy cream",
        "1/2 tablespoon fresh lemon juice, or to taste",
        "1 tablespoon chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Sauté",
        "Quick & Easy",
        "Shrimp",
        "White Wine",
        "Chive",
        "Gourmet"
    ],
    "title": "Chicken Breasts with Rock-Shrimp Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-breasts-with-rock-shrimp-sauce-232485"
}
