{
    "directions": [
        "Put the potatoes in a pot of salted cold water and bring to a boil. Cook until just tender, about 20 minutes. Drain and let cool, but do not peel. Cut in half and set aside.",
        "Preheat the broiler. Cut a small slice off both ends of each lemon, then cut in half crosswise. Arrange the lemons, flesh side up, in a flameproof non-reactive baking dish, brush with olive oil, and season with salt and pepper. Broil 6 inches or more from the heat until browned and soft, about 10 minutes. Let cool. Squeeze the lemon halves over a sieve suspended over a bowl. Push and stir the pulp through the sieve with a rubber spatula or wooden spoon. Discard the lemon shells.",
        "Preheat the oven to 450°F. Season the chicken with salt and pepper. Heat the remaining 1/4 cup olive oil in a large ovenproof saut\u2029 pan over medium-high heat until hot. Add the chicken, lower the heat to medium, and cook, turning once, until brown on both sides, about 5 minutes. Remove to a platter.",
        "Return the pan to medium-high heat, add the potatoes, season with salt and pepper, and cook, stirring and tossing, until brown all over, about 5 minutes. Drain off the excess oil. Arrange the chicken breasts on top of the potatoes and place in the oven to reheat and cook through, about 10 minutes. When done,remove the chicken to a platter and put the pan with the potatoes over medium-high heat. Toss well so the pan juices are absorbed into the potatoes. Scrape the potatoes out of the pan onto the platter around the chicken.",
        "Return the pan to medium-high heat and add the garlic. Sauté briefly until light brown. Immediately add the reserved roasted lemon juice (this final flash of heat will cook off any residual acid flavor), stock, rosemary, and parsley. Stir and scrape up all the browned bits that cling to the bottom and sides of the pan. Season to taste with salt and pepper. If the sauce tastes too lemony, stir in the optional butter. Pour the sauce over the chicken and potatoes and serve immediately."
    ],
    "ingredients": [
        "1-1/2 pounds small new potatoes such as Red Bliss",
        "2 large lemons",
        "Extra-virgin olive oil for brushing on lemons, plus 1/4 cup Gray salt and freshly ground pepper",
        "4 boneless chicken breast halves, skin on",
        "1 tablespoon minced garlic",
        "1 cup double-strength chicken stock, or 2 cups canned low-salt chicken broth boiled until reduced by half",
        "1 teaspoon finely chopped fresh rosemary",
        "1 tablespoon finely chopped fresh flat-leaf parsley",
        "1 tablespoon unsalted butter (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Herb",
        "Poultry",
        "Roast",
        "Sauté",
        "Lemon",
        "Rosemary",
        "Healthy"
    ],
    "title": "Chicken with Roasted Lemon and Rosemary Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-roasted-lemon-and-rosemary-sauce-104857"
}
