{
    "directions": [
        "Heat vegetable oil in heavy large Dutch oven over medium heat. Sprinkle chicken pieces with salt and pepper. Add chicken to pot in batches and cook until light brown, about 5 minutes per side. Transfer chicken to bowl. Pour off fat from pot and discard.",
        "Add butter to same pot and melt over medium heat. Add sliced parsnips, carrots, leeks and potatoes and stir to coat. Cook 8 minutes, stirring occasionally. Add flour and stir 2 minutes. Gradually mix in chicken broth. Increase heat and bring to boil. Return chicken to same pot. Add 1 tablespoon tarragon and bay leaf. Reduce heat, cover and simmer until chicken and vegetables are cooked through, turning chicken occasionally, about 30 minutes.",
        "Using tongs, transfer chicken pieces to large shallow bowl and tent with foil. Add whipping cream to pot; increase heat and simmer until liquids thicken to sauce consistency, about 10 minutes. Discard bay leaf. Mix in remaining 1 tablespoon tarragon. Season stew to taste with salt and pepper. Spoon sauce and vegetables over chicken and serve."
    ],
    "ingredients": [
        "2 tablespoons vegetables oil",
        "1 4-pound chicken, cut into 8 pieces",
        "3 tablespoons butter",
        "4 parsnips, peeled, sliced",
        "3 large carrots, peeled, thinly sliced",
        "3 medium leeks (white and pale green parts only), halved lengthwise, sliced",
        "1 pound baby new potatoes, thickly sliced",
        "3 tablespoons all purpose flour",
        "3 cups canned chicken broth",
        "2 tablespoons minced fresh tarragon or 2 teaspoons dried",
        "1 bay leaf",
        "1/4 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Potato",
        "Vegetable",
        "Stew",
        "Winter"
    ],
    "title": "Chicken and Mixed Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-mixed-vegetable-stew-1115"
}
