{
    "directions": [
        "Special equipment: a deep-fry thermometer",
        "For the fried chicken: Thoroughly rinse the chicken, then cover all the pieces with 1 3/4 cups of buttermilk. Soak in the fridge overnight or up to 24 hours.",
        "When you're ready to fry the chicken, remove the bowl from the fridge and let it sit on the counter for 30 minutes to take off the chill.",
        "In the meantime, preheat the oven to 360 degrees F and mix the breading. Put the flour, seasoned salt, paprika, pepper, thyme and cayenne (extra cayenne if you like heat) in a very large bowl and stir together well.",
        "In a small bowl, combine the milk and remaining 1/4 cup buttermilk. Pour into the flour mixture and, with a fork, gradually mix until there are little lumps throughout. This will adhere to the chicken and make for a crispier breading. If necessary, add a little more flour or milk to the bowl in order to make it slightly lumpy.",
        "Heat 1 1/2 to 2 inches of vegetable oil in a deep skillet over medium-high heat until a deep-fry thermometer registers 365 degrees F. Lower the heat slightly, if necessary, to keep the oil from getting hotter.",
        "Working in batches, thoroughly coat each chicken piece with the breading, pressing extra breading onto the chicken if necessary. Place the breaded pieces on a plate.",
        "Add the chicken to the oil 3 or 4 pieces at a time. Make sure they aren't sticking together, then cover the skillet and fry for 5 to 7 minutes, checking occasionally to make sure the chicken isn't getting too brown. Turn the pieces over, cover again and cook 3 to 5 minutes more. All the while, monitor the temperature of the oil to make sure the chicken doesn't burn. Transfer the fried chicken pieces to a baking sheet (they will not be completely cooked through) and continue frying the rest of the chicken.",
        "Bake the thighs for 15 minutes to finish the cooking process. Sometimes I'll cut into the thicker part of one of the larger pieces, just to make sure the chicken is cooked through. (If any pink juice or meat is visible, the chicken needs to continue cooking in the oven.) Cover and keep warm.",
        "For the waffles: Preheat the waffle iron to the regular setting. Sift together the flour, sugar, baking powder and salt in a bowl.",
        "In a separate bowl, whisk together the milk, vanilla and 2 egg yolks. Pour over the dry ingredients and very gently stir until halfway combined. Pour in the melted butter and chopped jalapenos and continue mixing very gently until combined.",
        "In a separate bowl (or using a mixer), beat the 4 egg whites with a whisk until stiff. Slowly fold them into the batter, stopping short of mixing them all the way through.",
        "Scoop the batter into your waffle iron in batches and cook according to the manufacturer's directions (lean toward being a little deep golden and crisp!). Keep warm.",
        "For the sauce: Pour the pancake syrup and bourbon in a small pot and bring to a boil. Turn down the heat and simmer for 3 to 4 minutes. Turn off the heat and whisk in the butter 1 tablespoon at a time, then the cayenne.",
        "To serve: Place 2 chicken thighs on top of a waffle. Pour the warm sauce over everything and serve immediately."
    ],
    "ingredients": [
        "8 boneless, skin-on chicken thighs",
        "2 cups buttermilk",
        "2 1/2 cups all-purpose flour, plus more if needed",
        "1 tablespoon seasoned salt, such as Lawry's",
        "1 teaspoon paprika",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon ground dried thyme",
        "1/2 teaspoon cayenne pepper, plus more if needed",
        "1/4 cup milk, plus more if needed",
        "Vegetable oil, for frying",
        "2 cups all-purpose flour",
        "1/4 cup sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon kosher salt",
        "1 1/2 cups milk",
        "1 tablespoon vanilla extract",
        "4 large egg whites plus 2 large egg yolks",
        "8 tablespoons (1 stick) salted butter, melted",
        "1 to 2 jalapenos, chopped",
        "1 cup pancake syrup",
        "1/4 cup bourbon",
        "4 tablespoons (1/2 stick) salted butter",
        "1/4 teaspoon cayenne pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Waffle Recipes",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Brunch",
        "Deep-Frying"
    ],
    "title": "Chicken and Waffles",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chicken-and-waffles"
}
