{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Place the bread in the bowl of a food processor and process until fine crumbs are formed, about 25 to 30 seconds. Put the crumbs on a baking sheet and bake for 12 minutes, until golden. (You will wind up with about 1 1/3 cups toasted crumbs.)",
        "In a medium bowl, toss the crumbs with oregano, garlic powder, paprika, 1/4 teaspoon salt and 1/4 teaspoon pepper. In another bowl, whisk the egg whites and milk together. In a third bowl stir together the flour, and the remaining 1/4 teaspoon salt and 1/4 teaspoon black pepper. Dip each piece of chicken, 1 piece at a time, in flour, shaking off excess, then egg, then bread crumbs, shaking off excess.",
        "Increase oven temperature to 400 degrees. Place breaded breasts in a glass baking dish and spray on each side with cooking spray, about 5 seconds total per side. Bake breasts until cooked though and crumbs are browned, about 15 minutes. Top with marinara sauce, mozzarella and parmesan and return to oven for an additional 10 minutes, until cheese is bubbling.",
        "Excellent source of: Protein, Vitamin A, Riboflavin, Niacin, Vitamin B6, Vitamin C, Calcium, Iron, Phosphorus, Selenium",
        "Good source of: Thiamin, Vitamin B12, Pantothenic Acid, Iodine, Magnesium, Manganese, Potassium, Zinc"
    ],
    "ingredients": [
        "4 slices whole-wheat bread (1-ounce each)",
        "1 teaspoon dried oregano",
        "1/2 teaspoon garlic powder",
        "4 teaspoons paprika",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 egg whites",
        "1/2 cup skim milk",
        "1/2 cup all-purpose flour",
        "4 (6 ounce) skinless boneless chicken breast halves, pounded to 1/2-inch thickness",
        "Olive oil cooking spray",
        "1 jar good-quality marinara sauce (about 3 1/2 cups)",
        "3/4 cup (3 ounces) shredded part-skim mozzarella cheese",
        "2 tablespoons (1/2-ounce) shredded Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy Dinner",
        "Healthy",
        "Italian",
        "Cheese",
        "Mozzarella Recipes",
        "Parmesan Cheese Recipes",
        "Heart-Healthy"
    ],
    "title": "Chicken Parmesan",
    "url": "http://www.foodnetwork.com/recipes/ellie-krieger/chicken-parmesan-recipe"
}
