{
    "directions": [
        "Preheat oven to 450°F. Combine tomatoes, 2 tablespoons oil, and herbes de Provence in a large bowl. Season with salt and pepper; toss to coat. Heat 1 tablespoon oil in a large heavy ovenproof skillet until oil shimmers. Carefully add tomatoes to pan (oil may spatter). Transfer skillet to oven and roast, turning once, until tomatoes burst and give up some of their juices, about 15 minutes. Transfer to a medium bowl and drizzle with Worcestershire sauce.",
        "Meanwhile, season chicken all over with 1 teaspoon salt and pepper. Heat 2 tablespoons oil in a large ovenproof skillet over medium-high heat. Sear chicken on both sides until golden brown, 6-8 minutes. Transfer pan to oven and roast chicken until cooked through, 8-10 minutes. Transfer chicken to a cutting board and let rest for at least 5 minutes.",
        "Add remaining 1 tablespoon oil to same skillet; heat over medium heat. Add shallot and cook, stirring often, until fragrant, about 1 minute. Deglaze pan with vinegar, scraping up browned bits from bottom of pan; add tomatoes and their juices and simmer until sauce is just beginning to thicken, about 1 minute. Season sauce to taste with salt and pepper.",
        "Slice chicken; divide among plates. Spoon tomatoes and sauce over; garnish with herbs."
    ],
    "ingredients": [
        "1 1/2 pounds cherry tomatoes or other small tomatoes on the vine",
        "6 tablespoons olive oil, divided",
        "2 tablespoons herbes de Provence",
        "1 teaspoon kosher salt plus more",
        "Freshly ground black pepper",
        "1 tablespoons Worcestershire sauce",
        "1 pound skinless, boneless chicken breasts",
        "1 small shallot, minced",
        "2 tablespoons red wine vinegar",
        "3 tablespoons flat-leaf parsley leaves",
        "3 tablespoons fresh tarragon leaves",
        "Ingredient info: Herbes de Provence, a dried herb mixture, can be found at specialty foods stores and in the spice section of most supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Tomato",
        "Vegetable",
        "Roast",
        "Kid-Friendly",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Healthy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken with Herb-Roasted Tomatoes and Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-herb-roasted-tomatoes-and-pan-sauce-51108240"
}
