{
    "directions": [
        "For saté: Combine first 5 ingredients in large glass baking dish, Stir until sugar dissolves. Add shrimp, chicken and beef; stir to coat. Cover; chill 30 minutes to 1 hour.",
        "Remove shrimp, chicken and beef from marinade. Thread on separate skewers, using about 3 shrimp per skewer and 2 beef or chicken pieces per skewer. Place on platter. (Can be prepared 2 hours ahead. Cover and chill.)",
        "Prepare barbecue (medium-high heat) or preheat broiler. Grill skewered meats until cooked through, about 3 minutes per side. Line large platter with banana leaves. Place sauce in bowl in center of platter. Surround with skewers. Garnish with lime and flowers, if desired, and serve.",
        "Place peanut butter in heavy medium saucepan. Gradually mix in chicken broth. Add all remaining ingredients except lime peel. Stir over medium heat until smooth and thick, about 6 minutes. (Can be prepared 3 days ahead. Cover and refrigerate. Before serving, stir over medium heat until hot, thinning with water if necessary.) Pour sauce into bowl and garnish with lime peel. Makes about 3 cups."
    ],
    "ingredients": [
        "1 cup teriyaki sauce",
        "4 garlic cloves, minced",
        "3 tablespoons fresh lime juice",
        "2 1/2 tablespoons minced fresh ginger",
        "2 tablespoons brown sugar",
        "24 medium uncooked shrimp, peeled, deveined",
        "1 1/4 pounds boneless skinless chicken breasts, cut into 1/2-inch-wide strips",
        "1 1/4 pounds beef skirt steak, cut into 3x1/2-inch strips, or filet mignon, cut into 3 x 1/2 x 1/4-inch strips",
        "36 (about) bamboo skewers, soaked in water 30 minutes",
        "Banana leaves or ornamental kale",
        "Lime slices",
        "1 cup creamy peanut butter (do not use old-fashioned style or freshly ground)",
        "1 14 1/2-ounce can chicken broth",
        "1/4 cup fresh lime juice",
        "3 tablespoons brown sugar",
        "2 tablespoons plus 1 teaspoon soy sauce",
        "2 tablespoons chopped peeled fresh ginger",
        "1/2 teaspoon dried crushed red pepper",
        "Lime peel julienne",
        "Hibiscus or gardenia flowers (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Chicken",
        "Appetizer",
        "Marinate",
        "Kid-Friendly",
        "Peanut",
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Chicken, Shrimp and Beef Sates with Peanut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-shrimp-and-beef-sates-with-peanut-sauce-2382"
}
