{
    "directions": [
        "Break up tamarind, then add to boiling-hot water (1/2 cup) in a heatproof bowl and soak 15 minutes. Mash tamarind with a fork until pulp is dissolved, then pour tamarind mixture through a fine-mesh sieve into a small bowl, pressing hard on solids to extract as much liquid as possible. Discard solids.",
        "Heat a dry 10-inch heavy skillet (preferably cast-iron) over moderately low heat until hot, about 2 minutes, then toast coriander and cumin seeds, stirring constantly, 2 minutes. Add 12 curry leaves and toast, stirring constantly, until leaves curl and darken, 3 to 4 minutes. Add 4 chiles and toast, stirring constantly, until a shade darker, 1 to 2 minutes. Transfer to a plate and cool completely, then finely grind in grinder.",
        "Pat chicken dry and sprinkle with 1 teaspoon salt. Heat 2 tablespoons oil in a wide 6-quart heavy pot over moderately high heat until hot but not smoking, then brown chicken in 2 batches, skin sides down first, turning over once, about 8 minutes per batch. Transfer to a plate.",
        "Pour off all but 2 tablespoons fat from pot, then cook onions over moderate heat, stirring occasionally, until edges are golden, 5 to 8 minutes. Reduce heat to moderately low, then add ground-spice mixture, garlic, turmeric, and remaining teaspoon salt and cook, stirring frequently (to prevent scorching), about 3 minutes. Add coconut milk and tamarind liquid and simmer, stirring, until any coconut-milk solids are dissolved, about 1 minute. Add chicken, skin sides up, in 1 layer (chicken will not be completely covered with liquid) and simmer, covered, until chicken is just cooked through, about 15 minutes.",
        "While chicken simmers, cook green beans in an 8-quart pot of boiling salted water until crisp-tender, 3 to 4 minutes. Drain and transfer to a bowl of ice water to stop cooking. Drain well.",
        "When chicken is done cooking, transfer with tongs to a cutting board, reserving sauce in pot, and halve each chicken breast diagonally through bone. Put chicken in a deep serving dish and keep warm, covered with foil. Add green beans to coconut sauce and simmer until just tender, about 1 minute.",
        "While beans simmer, heat remaining tablespoon oil in 10-inch heavy skillet over moderate heat until hot but not smoking. Add mustard seeds, then cover skillet and cook until seeds make popping sounds, about 5 seconds. Remove lid, then add remaining 15 curry leaves and 2 chiles and cook, stirring, until leaves crackle and chiles darken slightly, about 5 seconds. Pour hot oil mixture over coconut sauce and beans, then stir to combine. Season with salt, then spoon sauce and beans around chicken. Discard whole chiles if desired."
    ],
    "ingredients": [
        "2 tablespoons tamarind (not concentrate) from a pliable block",
        "1/2 cup boiling-hot water",
        "2 tablespoons coriander seeds",
        "1 1/2 teaspoons cumin seeds",
        "27 fresh curry leaves*",
        "6 (3-inch-long) dried hot Indian red chiles",
        "6 chicken breast halves with skin and bones (5 lb total)",
        "2 teaspoons salt",
        "3 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Vegetable",
        "Dinner",
        "Coconut",
        "Curry",
        "Green Bean",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken and Green Bean Coconut Curry",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-green-bean-coconut-curry-231996"
}
