{
    "directions": [
        "For the satay: Whisk together the coconut milk, vegetable oil, lime juice, brown sugar, ginger, fish sauce, soy sauce, curry powder and garlic in a medium bowl.",
        "Cut each chicken breast on the diagonal into 6 strips. Flatten the strips to a 1/4-inch thickness with the back of a chef's knife or meat mallet. Put the strips in a large resealable plastic bag and pour in the marinade. Marinate in the refrigerator, at least 2 hours and up to 6 hours.",
        "For the peanut sauce: Meanwhile, heat the peanut oil in a small saute pan over medium-low heat until hot. Add the onion and jalapeno and cook until softened and fragrant, about 5 minutes. Add the garlic and ginger and cook for 20 seconds. Then add the coconut milk, peanut butter and curry paste. Increase the heat to medium and whisk until the mixture comes together, 2 to 3 minutes. Turn off the heat and whisk in the lime juice, soy sauce and fish sauce. If the sauce separates before you are ready to serve, whisk it until it emulsifies and use immediately.",
        "Preheat a grill for cooking over medium-high heat. Drain the chicken from the marinade and pat it dry. Thread the chicken onto the skewers. Grill, turning once, until the chicken is cooked through and lightly charred in places, 2 to 3 minutes per side. Serve with the peanut sauce for dipping."
    ],
    "ingredients": [
        "1/3 cup coconut milk",
        "3 tablespoons vegetable oil",
        "2 tablespoons lime juice",
        "2 tablespoons light brown sugar",
        "1 tablespoon grated fresh ginger",
        "1 tablespoon fish sauce",
        "1 tablespoon low-sodium soy sauce",
        "1 teaspoon curry powder",
        "2 cloves garlic, roughly chopped",
        "2 boneless skinless chicken breasts (about 1 pound)",
        "1 1/2 tablespoons peanut oil",
        "1/4 cup finely chopped yellow onion",
        "1/2 jalapeno pepper, ribs and seeds removed, finely chopped",
        "4 cloves garlic, minced",
        "1 1/2 tablespoons grated fresh ginger",
        "1 cup coconut milk (shake the can well before using)",
        "3/4 cup creamy peanut butter",
        "2 tablespoons store-bought Thai red curry paste",
        "6 tablespoons freshly squeezed lime juice",
        "2 tablespoons low-sodium soy sauce",
        "1 teaspoon fish sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Chicken",
        "Chicken",
        "Grilling",
        "Poultry Recipes",
        "Peanut Butter Fudge",
        "Appetizer"
    ],
    "title": "Chicken Satay with Peanut Sauce",
    "url": "http://www.foodnetwork.com/recipes/chicken-satay-with-peanut-sauce"
}
