{
    "directions": [
        "Bring water with chicken to a boil in a wide 6-quart heavy pot, skimming froth. Add thyme sprigs, bay leaf, peppercorns, and 1 teaspoon salt, then reduce heat and simmer, uncovered, 10 minutes.",
        "While chicken simmers, peel carrots and parsnips, then cut each carrot and parsnip crosswise into 3 equal lengths. Halve or quarter thicker pieces lengthwise so pieces are roughly the same size. Add to chicken along with onion, celery, and garlic and simmer, uncovered, until parsnips are tender, 10 to 15 minutes more. Transfer carrots and parsnips with a slotted spoon to a large bowl, then continue to simmer chicken until tender, 5 to 10 minutes. Transfer chicken with tongs to a bowl, then pour broth through a sieve into another large bowl. Let chicken and broth cool, uncovered, 15 minutes.",
        "Chill broth, uncovered, until fat rises to top and solidifies, about 4 hours.",
        "Meanwhile, tear chicken into bite-size pieces, discarding skin, bones, and remaining solids in sieve. Chill chicken with carrots and parsnips, covered, about 4 hours.",
        "Remove and reserve 1/4 cup solidified fat from stock. (If you have less than 1/4 cup fat, add butter.) Melt fat in a wide 4-quart heavy saucepan over moderately low heat, then add flour and cook roux, stirring constantly, 3 minutes (do not brown). Stir in chicken broth. Bring to a boil, stirring constantly, then reduce heat slightly and simmer briskly, uncovered, stirring occasionally, until reduced to about 2 1/2 cups, 30 to 50 minutes. Add milk and cream, then simmer until reduced to about 3 1/2 cups, 10 to 15 minutes. Stir in chicken with vegetables, remaining 1/2 teaspoon salt (or to taste), and vinegar and sugar to taste and cook, stirring gently (avoid breaking up vegetables), until heated through. Stir in dill."
    ],
    "ingredients": [
        "2 qt water",
        "6 large chicken thighs (with skin and bones; about 2 3/4 lb total)",
        "4 sprigs fresh thyme",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 teaspoon whole white peppercorns",
        "1 1/2 teaspoons salt, or to taste",
        "1 lb carrots (about 6 medium)",
        "1 lb parsnips (about 3 large)",
        "1 onion, peeled and halved",
        "1 celery rib, cut crosswise into 3 pieces",
        "3 garlic cloves, peeled",
        "1 to 3 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "1 cup whole milk",
        "1/2 cup heavy cream",
        "1 tablespoon white-wine vinegar, or to taste",
        "1/2 teaspoon sugar, or to taste",
        "2/3 cup chopped fresh dill, or to taste",
        "Accompaniment: boiled potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dairy",
        "Garlic",
        "Herb",
        "Onion",
        "Vegetable",
        "Summer",
        "Gourmet"
    ],
    "title": "Chicken Fricassée with Creamy Sweet-and-Sour Dill Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fricassee-with-creamy-sweet-and-sour-dill-sauce-1222175"
}
