{
    "directions": [
        "Put garbanzo beans into a large container; add enough cool water to cover by several inches. Soak beans 8 hours to overnight. Drain and rinse before using.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.",
        "Halve both the red bell pepper and green bell pepper from top to bottom. Remove and discard the stem, seeds, and ribs. Arrange pepper halves with cut sides down onto the prepared baking sheet.",
        "Roast peppers under the preheated broiler until their skins have blackened and blistered, 5 to 8 minutes; transfer to a bowl and tightly seal bowl with plastic wrap to steam the peppers as they cool until the skins are loosened, about 20 minutes. Remove and discard skins. Slice peppers.",
        "Heat canola oil in a pot over medium heat. Cook and stir potatoes in hot oil until browned, about 10 minutes; add chorizo and continue to cook and stir until chorizo is hot, 3 to 5 minutes more. Stir peppers, onion, garlic cloves, paprika, and salt into the potato mixture; cook, stirring infrequently, until the onion softens, about 10 minutes more.",
        "Stir soaked garbanzo beans into the mixture. Pour sherry over everything. Bring the mixture to a simmer, reduce heat to medium-low, place a cover on the pot, and cook at a simmer until the beans are tender, 10 to 15 minutes."
    ],
    "ingredients": [
        "1/2 pound dry garbanzo beans",
        "1 red bell pepper",
        "1 green bell pepper",
        "1 tablespoon canola oil",
        "4 red potatoes, cut into 1/2-inch cubes",
        "9 ounces Spanish-style chorizo, cut into 1/2-inch cubes",
        "1 yellow onion, cut into large chunks",
        "8 cloves garlic, or more to taste",
        "1 teaspoon paprika",
        "1/2 teaspoon salt, or more to taste",
        "1/4 cup dry sherry, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chickpeas and Chorizo",
    "url": "http://allrecipes.com/recipe/239571/chickpeas-and-chorizo/"
}
