{
    "directions": [
        "In a flameproof casserole heat the oil and 1 tablespoon of the butter over moderately high heat until the foam subsides, in it brown the chicken, patted dry and seasoned with salt, and transfer the chicken with a slotted spoon to a plate. Pour off the fat from the casserole, add the remaining 2 tablespoons butter, and in it cook the celery, the onion, and the garlic over moderately low heat, stirring occasionally, until vegetables are softened. Add the apples, cored and chopped, and cook the mixture, stirring occasionally, for 5 minutes. Add the bell pepper, the curry powder, the cinnamon, and the cumin and cook the mixture, stirring, for 1 minute. Stir in the flour and cook the mixture over moderate heat, stirring, for 3 minutes. Add the broth and the chicken with any juices that have accumulated on the plate, bring the liquid to a boil, and cook the chicken mixture, covered, at a bare simmer for 15 to 20 minutes, or until the chicken is cooked through and tender. Transfer the chicken with a slotted spoon to a serving plate, boil the vegetable mixture, stirring, for 3 to 5 minutes, or until it is thickened slightly, and season the sauce with salt and pepper. Pour the sauce over the chicken and top it with the parsley. Serve the curry with the rice and the chutney.",
        "In a large saucepan bring 5 quarts water to a boil with the salt. Sprinkle in the rice, stirring until the water returns to a boil, and boil it for 10 minutes. Drain the rice in a large colander and rinse it. Set the colander over a large saucepan of boiling water and steam the rice, covered with a kitchen towel and the lid, for 15 minutes, or until it is fluffy and dry."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "3 tablespoons salted butter",
        "a 3 1/2-pound chicken, cut into serving pieces",
        "2 ribs of celery, chopped fine",
        "1 large onion, chopped fine",
        "2 garlic cloves, minced",
        "2 Granny Smith apples",
        "1 red bell pepper, chopped",
        "1 tablespoon curry powder",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon ground cumin",
        "2 tablespoons all-purpose flour",
        "2 cups chicken broth",
        "finely chopped fresh parsley leaves for garnish",
        "steamed rice (recipe follows) as an accompaniment",
        "1 tablespoon salt",
        "2 cups unconverted long-grain rice",
        "apple ginger chutney as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Rice",
        "Steam",
        "Apple",
        "Curry",
        "Fall",
        "Gourmet"
    ],
    "title": "Chicken and Apple Curry",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-apple-curry-13208"
}
