{
    "directions": [
        "Stir cumin in a small dry skillet over medium heat until toasted, about 2 minutes. Remove from heat; add vinegar and garlic. Let stand for 30 seconds. Transfer to a blender; add oil and next 3 ingredients. Purée. Season with salt.",
        "Heat 2 tablespoons oil in a large heavy nonstick skillet over medium heat. Season chicken with salt. Working in 2 batches and adding 1 tablespoon oil between batches, cook chicken in single layers until browned on both sides and just cooked through, 2-3 minutes per side. Transfer to a plate and tent with foil to keep warm.",
        "Remove pan from heat; add 1/4 cup water. Stir, scraping up browned bits. Whisk in 1/4 cup vinaigrette. Scrape sauce into a bowl.",
        "Melt butter with 1 tablespoon oil in same skillet over medium-low heat. Add garlic and cook until just beginning to brown, 1-2 minutes. Discard garlic. Working in 3 batches and adding more oil as needed, add kale to skillet and toss until wilted, 1-2 minutes per batch. Transfer to a large bowl. Season lightly with salt. Cover to keep warm.",
        "Add freekeh and lentils to same skillet. Increase heat; stir until warm, 2-3 minutes.",
        "Spoon pilaf onto plates. Top with chicken. Whisk juices from plate with chicken into sauce; drizzle over chicken and pilaf. Top with kale."
    ],
    "ingredients": [
        "2 tablespoons cumin seeds",
        "1/2 cup Sherry vinegar",
        "2 small garlic cloves, minced",
        "1/2 cup extra-virgin olive oil",
        "2 tablespoons finely chopped Hunza raisins",
        "2 teaspoons whole grain mustard",
        "2 teaspoons fresh lemon juice",
        "Kosher salt",
        "4 tablespoons (or more) olive oil, divided",
        "1 1/2 pounds skinless, boneless chicken breasts, cut into 1/2\"-thick cutlets",
        "Kosher salt",
        "1 tablespoon unsalted butter",
        "1 garlic clove, smashed",
        "1 pound kale, large center ribs and stems removed, torn into pieces",
        "1 cup cooked freekeh",
        "1 cup cooked lentils"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Poultry",
        "Sauté",
        "Low Cal",
        "Low Sodium",
        "Dinner",
        "Kale",
        "Legume",
        "Lentil",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken With Kale and Freekeh-Lentil Pilaf",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-kale-and-freekeh-lentil-pilaf-380589"
}
