{
    "directions": [
        "In a kettle heat the oil over moderately high heat until it is hot but not smoking and in it brown the chicken, patted dry, in batches, transferring it as it is browned to a bowl. Pour off and discard all but about 3 tablespoons of the oil and in the remaining oil cook the onion and the mushrooms over moderate heat, stirring occasionally, until the onion is golden. Add the garlic and cook the mixture, stirring, for 1 minute. Add the tomatoes with the juice, the wine, the chicken with any juices that have accumulated in the bowl, the anchovy paste, and the orégano and simmer the mixture, covered, stirring occasionally and breaking up the tomatoes, for 30 to 35 minutes, or until the chicken is tender. The chicken mixture may be made 2 days in advance, cooled to room temperature, and kept covered and chilled. Reheat the chicken mixture before serving.",
        "In kettle of boiling salted water cook the fusilli for 10 to 12 minutes, or until it is al dente, drain it well, and in a large bowl toss it with the chicken mixture. Sprinkle the chicken cacciatora with the parsley."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "a 3 1/2-pound chicken, cut into serving pieces",
        "1 onion, chopped fine",
        "1/2 pound mushrooms, sliced thin",
        "1 garlic clove, minced",
        "a 28-ounce can plum tomatoes including the juice",
        "1/2 cup dry red wine",
        "2 flat anchovy fillets, rinsed, patted dry, and mashed to a paste",
        "1 teaspoon dried orégano, crumbled",
        "1 pound fusilli (corkscrew-shaped pasta)",
        "1/2 cup minced fresh parsley leaves if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fish",
        "Mushroom",
        "Pasta",
        "Tomato",
        "Sauté",
        "Kid-Friendly",
        "Gourmet"
    ],
    "title": "Chicken Cacciatora with Fusilli",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-cacciatora-with-fusilli-10380"
}
