{
    "directions": [
        "Cook potatoes in a microwave on high heat until soft, about 15 minutes.",
        "Place carrots and green beans into a medium saucepan of boiling water, and cook to soften, about 5 minutes.",
        "In a large skillet, heat oil over medium heat. Dip chicken strips into beaten egg, coat in bread crumbs, and cook in hot oil until golden brown on both sides. Remove to paper towels to cool. Then cut chicken strips into cubes.",
        "Cut softened potatoes into cubes. Place potato cubes, carrots, green beans, and chicken cubes into a large bowl. Gently stir in sour cream and mustard; season with adobo, and salt and pepper to taste.",
        "Lightly sprinkle a baking sheet with flour. Unroll crescent roll dough from one can onto a baking sheet; pinch the perforations together to form a single sheet of dough. Repeat with the remaining roll; lay it out beside the first sheet of dough and pinch to connect the two together. The dough should now be about 12 inches long and 7 inches wide. Roll out the dough until it is about 20 inches long and 12 inches wide.",
        "Preheat oven to 350 degrees F (175 degrees C). Spoon the filling directly down the center of the dough, leaving 1-inch margins at the top and bottom and 3-inch margins at the sides. With scissors, cut 1-inch strips from the margins of the two long sides (6 strips in all). At the top and bottom, fold the dough in about 1 inch. Then take one strip and lay it across the filling from corner to corner. Pinch to seal. Lay across another strip from the opposite corners. Repeat until all of the strips are braided across the dough. Brush the top with egg wash.",
        "Bake in a preheated oven until golden brown, about 20 minutes."
    ],
    "ingredients": [
        "2 (10 ounce) cans refrigerated crescent rolls",
        "4 small white potatoes with skin",
        "1/2 pound fresh green beans, cut into 1 inch pieces",
        "3 medium carrots, peeled and chopped",
        "3 tablespoons vegetable oil",
        "2 skinless, boneless chicken breast halves - cut into 2 inch pieces",
        "2 eggs, beaten",
        "1 cup dry bread crumbs",
        "1 (16 ounce) container sour cream",
        "2 tablespoons country Dijon-style mustard",
        "1 teaspoon adobo seasoning",
        "1 pinch salt and black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Crescent Braid",
    "url": "http://allrecipes.com/recipe/40201/chicken-crescent-braid/"
}
