{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes. Drain and transfer pasta to a bowl; stir in butter.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Season chicken with 1 pinch Italian seasoning and black pepper; place in a baking dish.",
        "Broil chicken in the oven until no longer pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into bite-size pieces.",
        "Heat olive oil in a large skillet over medium-high heat; cook and stir sun-dried tomatoes and garlic until garlic is softened, about 2 minutes.",
        "Stir chicken broth and cornstarch together in a bowl until dissolved; stir into sun-dried tomato mixture. Mix artichoke heart juice, vodka, and lemon juice into chicken broth mixture; simmer until thickened, about 2 minutes. Reduce heat to medium and stir in artichoke hearts, chicken, 1 teaspoon Italian seasoning, parsley, and oregano; simmer until heated through, about 5 minutes.",
        "Stir pasta and 1/4 cup feta cheese into chicken-artichoke mixture and simmer until pasta is warmed and feta cheese is melted, 2 to 3 more minutes. Remove skillet from heat. Sprinkle mixture with remaining 1/4 cup feta cheese; stir."
    ],
    "ingredients": [
        "1 (8 ounce) package penne pasta",
        "1 tablespoon butter",
        "1 pound skinless, boneless chicken breast halves",
        "1 pinch Italian seasoning, or more to taste",
        "1 pinch ground black pepper to taste (optional)",
        "1 tablespoon olive oil",
        "8 sun-dried tomatoes, cut in thin strips",
        "2 cloves garlic, chopped",
        "1 (10.75 ounce) can low-sodium chicken broth",
        "1 tablespoon cornstarch",
        "1 (14 ounce) jar marinated artichoke hearts, drained and quartered, 1/4 cup liquid reserved",
        "1/4 cup vodka",
        "2 tablespoons lemon juice",
        "1 teaspoon Italian seasoning",
        "1 teaspoon dried parsley",
        "1/2 teaspoon dried oregano",
        "1/2 cup crumbled feta cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken and Artichoke in Lemon Vodka Sauce",
    "url": "http://allrecipes.com/recipe/235255/chicken-and-artichoke-in-lemon-vodka/"
}
