{
    "directions": [
        "For the casserole: Heat a few inches of water to a low boil, add salt and the green beans and cook 3 to 4 minutes to tender-crisp, drain.",
        "Heat the EVOO in a large, deep skillet over medium to medium-high heat, add the mushrooms and lightly brown them, 7 to 8 minutes. Add the butter, shallots and garlic, season with salt, pepper and thyme, and stir 2 to 3 minutes more. Add the flour, stir a minute, add the wine, stir in the stock and thicken. Add the cream and Boursin and reduce the heat to simmer. Add the green beans and chicken and thicken a bit; stir in the tarragon.",
        "Transfer into a casserole dish and cool. Cover and refrigerate for a make-ahead meal.",
        "To reheat: Bring back to room temp. Bake at 375 degrees F until bubbly, 50 to 60 minutes; top with homemade or store-bought Fried Onions.",
        "Place the chicken in a large stockpot. Add the celery, carrot, onion, garlic, lemon, bay leaf, peppercorns and the herb bundle; season with salt. Cover the chicken with water and bring to a boil; reduce the heat to a low, rolling simmer. Simmer 60 to 75 minutes, then cool the chicken in its stock. Strain the stock. Remove the chicken in large pieces from the skin and bones. Cut half of the meat into bite-size chunks. Thinly slice or pull the remaining meat.",
        "Heat 2 to 3 inches of frying oil to 365 degrees F in a countertop fryer or in a deep medium pot over medium to medium-high heat. Separate the onion rings and soak in the buttermilk. Toss a few rings at a time into the flour and fry until crisp; drain on paper towels and repeat with the remaining onions."
    ],
    "ingredients": [
        "Salt",
        "1 1/2 pounds green beans, trimmed and cut into thirds",
        "1 tablespoon EVOO",
        "1/2 pound button mushrooms, sliced",
        "4 tablespoons butter",
        "2 large shallots, chopped",
        "3 to 4 cloves garlic, chopped",
        "Pepper",
        "2 tablespoons chopped fresh thyme",
        "4 tablespoons flour",
        "1/2 cup dry white wine",
        "2 cups chicken stock/poaching liquid from Poached Chicken, recipe follows",
        "1 cup cream or half-and-half",
        "1 wheel Boursin (5.4 ounces) or other garlic-and-herb cheese",
        "1 1/2 pounds cooked pulled or sliced Poached Chicken, recipe follows",
        "2 to 3 tablespoons fresh chopped tarragon or 1 tablespoon dried tarragon",
        "Fried Onions, homemade or store-bought, recipe follows",
        "One 4- to 5-pound chicken",
        "2 ribs celery, coarsely chopped",
        "1 carrot, peeled and coarsely chopped",
        "1 onion, peeled and quartered",
        "2 cloves garlic, crushed",
        "1 lemon, sliced",
        "1 large fresh bay leaf",
        "1 teaspoon whole black peppercorns",
        "Herb bundle of parsley, rosemary and thyme tied with a string",
        "Salt",
        "Frying oil",
        "1 small to medium onion, very thinly sliced",
        "1 cup buttermilk",
        "1 cup flour, aggressively seasoned with salt, pepper and paprika"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Green Bean Casserole",
        "Beans and Legumes",
        "Casserole",
        "Green Bean",
        "Chicken Casserole",
        "Chicken",
        "Poultry Recipes",
        "Make Ahead",
        "Onion Recipes",
        "Vegetable",
        "Cheese",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Chicken and Green Bean Casserole",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/chicken-and-green-bean-casserole"
}
