{
    "directions": [
        "In a large bowl, whisk together the sherry and cornstarch. Add the ginger, then add the chicken pieces and stir to coat. Set aside.",
        "Heat the oil in a wok or a 12-inch skillet over high heat until it reaches 350 degrees on a deep-fat thermometer. The rice sticks cook almost instantly, so have a slotted spoon and paper towels ready before you start. Take a handful of rice sticks, break into 2- to 3-inch pieces, and drop into the hot oil. They should puff immediately and become opaque—remove them as soon as they do to prevent burning and drain on the paper towels. Repeat, bringing the oil back to 350 degrees before you add more rice sticks, until all of them are cooked.",
        "Pour off all but 2 tablespoons of the oil and return the pan to the heat. When the oil is shimmering, add the chicken, broccoli, and almonds and cook, stirring frequently, until the chicken is lightly browned all over, about 3 minutes.",
        "Add the kecap manis and chicken stock and bring to a boil, stirring. Reduce the heat to medium-low, cover, and simmer until the chicken is cooked through and the broccoli is tender, 3 to 4 minutes; add a little more stock if the mixture becomes too dry.",
        "Divide the chicken and broccoli among the plates, top with the crispy noodles, and serve."
    ],
    "ingredients": [
        "1 tablespoon dry sherry",
        "1 tablespoon cornstarch",
        "1 tablespoon grated peeled fresh ginger",
        "2 pounds boneless, skinless chicken breasts, cut into 1-inch chunks",
        "1 cup vegetable oil",
        "4 ounces thin rice sticks or rice noodles",
        "1 1/2 pounds broccoli (1-2 heads), cut into small florets, stalks reserved for another use",
        "1/2 cup skinless almonds or raw cashews",
        "3/4 cup kecap manis or 3/4 cup soy sauce mixed with 1/4 cup packed dark brown sugar",
        "3/4 cup Chicken Stock , plus more if needed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Nut",
        "Stir-Fry",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Almond",
        "Broccoli",
        "Noodle"
    ],
    "title": "Chicken & Broccoli with Crispy Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-broccoli-with-crispy-noodles-51155000"
}
