{
    "directions": [
        "Combine the onion, garlic, salt, and water in a saucepan and bring to a boil. Add the chicken breasts, bay leaves, and oregano and decrease the heat to a simmer. Cook the chicken, partially covered, for 35 minutes, or until cooked through. To check for doneness, slit the chicken in half to make sure the interior is no longer pink.",
        "Allow the chicken to cool in the broth. When cool enough to handle, remove the chicken from the pan. Strain and reserve the broth. Shred the chicken by hand by pulling apart the fibers of the chicken with your fingers and set aside.",
        "Combine the tomatillos, jalapeños, cilantro, garlic, and water in a blender and purée until well blended.",
        "Heat the oil in a sauté pan over medium heat.",
        "When the oil is hot, add the onion and sauté until the onion is limp and translucent, about 8 minutes. Add the tomatillo mixture. Season with salt and pepper. Cook for about 5 minutes, or until the sauce thickens.",
        "Add the shredded chicken to the sauce and stir to coat. Allow to cook for 3 more minutes. Check the seasoning and adjust if needed. Set aside.",
        "Bring a large pot of water to a boil then remove from heat. Add the corn husks, making sure to submerge them under water, and cover the pot. Soak the corn husks in the pot for 20 minutes. They should be soft and flexible, and take on a deep beige color. Remove the corn husks from the water and wrap them in a damp paper towel until you are ready to use them.",
        "To make the masa, combine the masa harina with 2 cups of the reserved chicken broth and mix well. The masa should have the consistency of a stiff dough. Set aside.",
        "Put the lard in a mixing bowl. Beat the lard with an electric mixer until light and fluffy, about 1 minute. Add half of the masa and beat until well blended. Add the 3 tablespoons of the reserved chicken broth and the remaining masa and continue beating until a teaspoon of the dough dropped into a cup of cold water floats, about 10 minutes. If after 15 minutes of constant beating your dough does not float, move on (despite it not floating, the dough will be fine).",
        "Sprinkle the baking powder and the salt over the dough and mix in well.",
        "Place a corn husk lengthwise in front of you with the wide side closest to you. Spread 2 tablespoons of the dough all over the bottom half (wide side) of the corn husk, leaving about a 1-inch-wide border on the left and right sides.",
        "Place 2 heaping tablespoons of the filling lengthwise down the center of the dough. Pick up the two long sides of the cornhusk and unite them. Allow the dough to surround the filling by pinching together the corn husk where the dough comes together. Roll both sides of the corn husks in the same direction over the tamal. Fold down the empty top section of the cornhusk and secure it by tying a thin strip of corn husk around the tamal (the top will be open).",
        "Repeat this process until all the corn husks or tamal dough are used up.",
        "Create a tamal steamer by crumpling a large piece of aluminum foil into a large ball. Place the foil ball in the center of a large saucepan and arrange the tamales \"standing up\" around it. You can stand tamales in front of each other; just make sure that the open end of the tamal is facing upward.",
        "Pour in 1/2 inch of water. Cover tightly with a lid and simmer for 40 minutes.",
        "Serve warm accompanied by Mexican crema."
    ],
    "ingredients": [
        "1 onion, halved",
        "2 cloves garlic, crushed",
        "1/2 teaspoon salt",
        "5 cups water",
        "1 pound (about 3 breasts) boneless, skinless chicken breasts",
        "2 bay leaves",
        "1 teaspoon dried oregano",
        "8 tomatillos, husks removed, rinsed, and quartered",
        "2 to 3 jalapeños, stemmed and halved",
        "1 cup lightly packed fresh cilantro, tender stems and leaves",
        "1 clove garlic",
        "2 tablespoons water",
        "1 tablespoon olive oil",
        "1 onion, sliced",
        "Salt and black pepper",
        "About 30 corn husks",
        "2 1/2 cups masa harina (cornmeal for tamales; Maseca brand is recommended)",
        "2 cups plus 3 tablespoons chicken broth (reserved from poaching chicken)",
        "3/4 cup fresh lard or solid vegetable shortening",
        "1 teaspoon baking powder",
        "2 teaspoons salt",
        "Mexican crema, homemade or store-bought"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poach",
        "Steam",
        "Cinco de Mayo",
        "Dinner",
        "Cornmeal",
        "Corn",
        "Tomatillo",
        "Jalapeño",
        "Cilantro",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken Tamales with Tomatillo-Cilantro Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tamales-with-tomatillo-cilantro-sauce-356251"
}
