{
    "directions": [
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Season chicken with salt and pepper. Add to skillet; sauté until cooked through, about 6 minutes per side. Transfer chicken to platter (do not clean skillet). Tent chicken with foil.",
        "Heat 2 tablespoons oil in same skillet over medium-high heat. Add onion and oregano; sauté until onion softens, about 10 minutes. Using tongs, transfer onion to plate. Reduce heat to medium. Add endive to skillet and sauté until beginning to brown, turning occasionally, about 5 minutes. Add radicchio. Cover skillet and cook until radicchio begins to brown and endive softens, about 5 minutes. Return onion to skillet. Sprinkle vegetables with sugar. Stir until sugar melts, about 1 minute. Transfer vegetables to plate.",
        "Add vinegar to skillet; boil until slightly thickened, scraping up any browned bits, about 2 minutes. Add chicken to skillet; turn to coat with glaze. Arrange chicken on platter. Arrange vegetables around chicken. Drizzle remaining glaze from skillet over vegetables. Top with parsley."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "4 skinless boneless chicken breast halves",
        "1 large red onion, cut into 1/2-inch-thick slices, separated into rings",
        "1 teaspoon chopped fresh oregano or 1/2 teaspoon dried",
        "6 medium-size heads Belgian endive, trimmed, halved lengthwise",
        "1 medium-size head radicchio, cut into 8 wedges",
        "1 tablespoon dark brown sugar",
        "1/2 cup balsamic vinegar",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Sauté",
        "Vinegar",
        "Endive"
    ],
    "title": "Chicken with Endive, Radicchio and Balsamic Vinegar Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-with-endive-radicchio-and-balsamic-vinegar-glaze-1673"
}
