{
    "directions": [
        "Cook potatoes and squash in large pot of boiling water until almost tender, about 12 minutes. Drain and cool slightly. Cut vegetables into 3/4-inch dice. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Divide butter between 2 heavy large skillets and melt over medium heat. Divide onions between skillets and cook until golden brown, stirring occasionally, about 10 minutes. Increase heat to high. Divide chicken, potatoes and squash between skillets and cook until vegetables are golden brown, stirring frequently, about 6 minutes. Divide artichoke hearts, cream, Parmesan and 2 tablespoons tarragon between skillets. Boil until cream thickens and coats hash well and chicken is cooked through, stirring frequently, about 3 minutes. Season to taste with salt and pepper. Garnish hash with tarragon sprigs, if desired, and serve."
    ],
    "ingredients": [
        "2 1/4 pounds white- or red-skinned potatoes, peeled, quartered lengthwise",
        "1 1 1/2-pound butternut squash, peeled, halved, seeded, each half cut lengthwise into 3 pieces",
        "3 tablespoons butter",
        "3 onions, chopped",
        "3/4 pound skinless boneless chicken thighs, cut into 3/4-inch pieces",
        "3/4 pound skinless boneless chicken breasts, cut into 3/4-inch pieces",
        "2 9-ounce package frozen artichoke hearts, cooked according to package directions",
        "1 cup whipping cream",
        "1 cup freshly grated Parmesan cheese (about 3 ounces)",
        "2 tablespoons chopped fresh tarragon or 2 teaspoons dried",
        "Fresh tarragon sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Potato",
        "Poultry",
        "Vegetable",
        "Sauté",
        "Artichoke",
        "Butternut Squash"
    ],
    "title": "Chicken, Potato, Squash and Artichoke Hash",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-potato-squash-and-artichoke-hash-1332"
}
