{
    "directions": [
        "Melt 6 tablespoons butter in a large skillet over medium high heat. Season chicken with salt and pepper and add to skillet. Cook until halfway done and golden brown on both sides, about 4 to 7 minutes each side. When browned, remove chicken to a 9x13 inch baking dish. Set skillet aside, reserving drippings.",
        "In a separate skillet, melt the 2 remaining tablespoons of butter over medium high heat and saute mushrooms. Add 1/4 cup of the wine and stir; let reduce over low heat for 5 minutes. Set mushrooms and drippings aside, keeping warm.",
        "Preheat oven to 375  degrees F (190 degrees C).",
        "Add cream of chicken soup and cream of mushroom soup to reserved chicken/drippings skillet. Mix soups well with drippings, making sure no lumps remain. Slowly add cream, stirring constantly, then add remaining 1/2 cup wine; season with rosemary and thyme.  Adjust amount of wine as needed to make a nice, thick gravy consistency. Let mixture simmer over medium heat until bubbly, then add reserved mushroom mixture and stir together.",
        "Pour soup/mushroom mixture over chicken in baking dish, cover and bake in preheated oven for 30 to 45 minutes.",
        "About 15 minutes before serving chicken,  bring a large pot of lightly salted water to a boil. Add linguine and cook for 8 to 10 minutes or until al dente; drain. Serve chicken breasts and sauce over the hot cooked pasta."
    ],
    "ingredients": [
        "8 tablespoons butter, divided",
        "4 skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "6 ounces button mushrooms, sliced",
        "3/4 cup Marsala wine, divided",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "3/4 cup heavy cream",
        "1/2 teaspoon chopped fresh rosemary",
        "1/4 teaspoon chopped fresh thyme",
        "1 (12 ounce) package uncooked linguine pasta"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Danielle",
    "url": "http://allrecipes.com/recipe/23850/chicken-danielle/"
}
