{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. Place a tagine or heavy-bottom cast-iron pot over medium-heat heat with the olive oil. Season the chicken liberally with salt and pepper. Working in batches, sear the chicken in the pot until deep golden brown on all sides, 5 to 6 minutes total. Reserve seared chicken on a plate.",
        "3. Add the onions to the pot and cook, stirring occasionally, until light golden brown, 3 to 4 minutes. Add the garlic and ginger to the pot and continue cooking, until aromatic, about 2 minutes. Add the stock, cumin, and saffron to the pot, and bring the liquid to a boil. Return the chicken to the pot along with any juices that accumulated while it rested.",
        "4. Cover the tagine or pot with a tight-fitting lid and bake until the chicken has cooked through, about 15 minutes (or, the chicken can be simmered over medium-low heat on the stovetop for the same amount of time until cooked through).",
        "5. When the chicken has cooked through, add the olives, parsley, and lemons to the pot. Reserve warm over low heat until ready to serve.",
        "1. Preheat the oven to 350°F. Place dry couscous on a sheet pan and toast until pale golden brown and aromatic, about 15 minutes. Set aside.",
        "2. In a medium pot over high heat, bring the chicken stock, cinnamon, turmeric, and red pepper to a boil. Add the couscous, stir to combine, and cover with a tight-fitting lid. Remove the pot from the heat and let rest for 10 minutes.",
        "3. Fluff the couscous with a fork. Remove and discard the cinnamon stick. Serve warm with the prepared tagine."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 large chicken (about 3 pounds), cut into 8 pieces",
        "Kosher salt and freshly ground black pepper",
        "15 cipollini onions, blanched and peeled",
        "2 garlic cloves, peeled and thinly sliced",
        "1/2-inch piece ginger, finely chopped",
        "1 cup chicken stock or canned low-sodium broth",
        "1 teaspoon ground cumin",
        "1/4 teaspoon saffron",
        "1/2 cup picholine olives, pitted",
        "1/4 cup flat-leaf parsley, chopped",
        "1/2 preserved lemon, seeded and chopped",
        "1 1/2 cups couscous",
        "1 1/2 cups chicken stock",
        "1-inch cinnamon stick",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon crushed red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Onion",
        "Bake",
        "Dinner",
        "Couscous",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken Tagine with Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tagine-with-couscous-51121540"
}
