{
    "directions": [
        "If using curing salt, combine with 2 tsp. kosher salt in a small bowl. Sprinkle livers with salt mixture and chill, uncovered, 1 1/2–2 hours. Rinse and pat dry with paper towels.",
        "Heat oil in a large saucepan over high. Arrange livers in a single layer in saucepan and cook until browned on both sides but still rare in the center, about 45 seconds per side. Transfer to a paper towel–lined plate.",
        "Reduce heat to medium-low and cook shallots and garlic in same saucepan, stirring often, until shallots are translucent, about 3 minutes. Add bay leaves, thyme, white pepper, cinnamon, cloves, and vinegar and simmer, stirring, until liquid is almost completely evaporated, about 1 minute. Add wine and simmer, swirling pan often, until liquid is almost completely evaporated, about 2 minutes. Repeat with brandy, then add cream and bring to a simmer. Cook until reduced by half, about 5 minutes. Pluck out bay leaves; discard. Let mixture cool slightly.",
        "Blend cream mixture and livers in a blender until smooth, about 2 minutes. With motor running, add butter a piece at a time, blending until smooth before adding more. Strain mousse into a large measuring glass; season with kosher salt. Carefully pour into jars, dividing evenly, and cover with plastic wrap, pressing directly onto surface. Chill until set, at least 4 hours.",
        "Combine 2 Tbsp. vinegar and an ice cube in a small bowl; sprinkle gelatin over top.",
        "Heat honey in a small saucepan over medium-high, swirling often, until nearly black, bubbling, and just starting to smoke, about 5 minutes. Remove from heat and add remaining 2 Tbsp. vinegar, whisking until smooth. Add gelatin mixture and whisk until dissolved. Strain gelée into a small measuring glass and let cool.",
        "Carefully pour gelée over chilled chicken liver mousse, dividing evenly. Chill until gelée is set, at least 4 hours.",
        "Let mousse sit at room temperature 30 minutes before serving with toast.",
        "Mousse can be made 3 days ahead. Keep chilled.\nMousse can be topped with gelée 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "1/2 teaspoon pink curing salt (optional)",
        "2 teaspoons kosher salt, plus more",
        "8 ounces fresh chicken livers, sinews removed, patted dry",
        "2 tablespoons vegetable oil",
        "2 medium shallots, chopped",
        "1 garlic clove, crushed",
        "2 bay leaves",
        "1 teaspoon thyme leaves",
        "1/2 teaspoon freshly ground white pepper",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 cup sherry vinegar",
        "1/4 cup red wine",
        "1/4 cup brandy",
        "1 cup heavy cream",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "4 tablespoons apple cider vinegar, divided",
        "1/4 teaspoon unflavored powdered gelatin",
        "1/4 cup honey",
        "Toast points or crackers (for serving)",
        "2 shallow (8-oz.) jars or ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Appetizer",
        "Hors D'Oeuvre",
        "Honey",
        "Cocktail Party"
    ],
    "title": "Chicken Liver Mousse With Burnt Honey Gelée",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-liver-mousse-with-burnt-honey-gelee"
}
