{
    "directions": [
        "Place figs, Port, and 1 bay leaf in medium bowl. Cover and let figs marinate at room temperature overnight.",
        "Sprinkle chicken with salt and pepper. Wrap 3 pieces ham around each piece of chicken, securing with metal lacing pins or toothpicks. Melt 3 tablespoons butter in large pot. Add chicken and cook until browned on all sides, about 6 minutes total. Transfer to plate. Add shallots and garlic to pot. Sauté until beginning to brown, about 3 minutes. Add 2 bay leaves, tomatoes, celery, and coriander; sauté 5 minutes. Add 1/4 cup Port from fig marinade. Return chicken to pot. Add 2 cups chicken broth. Cover and simmer until chicken is cooked through, adding more broth if too dry and turning chicken occasionally, about 35 minutes.",
        "Meanwhile, transfer remaining Port from fig marinade to small saucepan. Boil until slightly thickened, about 5 minutes. Remove from heat and add figs; cover and set aside.",
        "Transfer chicken to platter. Boil sauce until reduced slightly, about 4 minutes. Stir in remaining 1 tablespoon butter. Pour sauce over chicken. Serve with figs in Port sauce."
    ],
    "ingredients": [
        "12 ripe black Mission figs",
        "1 1/4 cups ruby Port",
        "3 bay leaves, divided",
        "1 3 1/2-pound chicken, cut into 2 legs, 2 thighs, and 2 breasts with wings attached",
        "18 slices Serrano ham or prosciutto (about 12 ounces)",
        "4 tablespoons (1/2 stick) butter, divided",
        "1 cup chopped shallots",
        "3 garlic cloves, chopped",
        "3 plum tomatoes, seeded, chopped",
        "1 celery stalk, chopped (about 3/4 cup)",
        "2 teaspoons ground coriander",
        "2 cups (or more) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Tomato",
        "Sauté",
        "High Fiber",
        "Fig",
        "Port",
        "Fall",
        "Winter",
        "Prosciutto",
        "Shallot"
    ],
    "title": "Chicken Fricassée with Figs and Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fricassee-with-figs-and-port-sauce-239795"
}
