{
    "directions": [
        "1. Preheat the oven to 400°F.",
        "2. In a heavy-bottom large stockpot over medium-high heat, add the oil. Season the chicken thighs with salt and black pepper. Working in batches, add the chicken to the hot oil and brown on both sides, 5 to 6 minutes total. Remove the browned chicken to a plate and reserve.",
        "3. To the same pot add the onion, garlic, nutmeg, mace, cinnamon, cloves, and saffron, and sauté them until they are soft and lightly golden, 5 to 6 minutes. Add 2 cups of chicken stock to the pot and scrape up any brown pieces sticking to the bottom of the pan. Add the chicken back into the pot with any juices, and add more stock as needed to bring the liquids up to the chicken without submerging it. Bring the liquids to a boil. Cover the pot with a tight-fitting lid and place in the oven until the chicken is cooked through and very tender, 15 to 20 minutes.",
        "4. Once the chicken is cooked, remove it to a plate and let it cool. Shred the cooled chicken into small, bite-size pieces. Reserve for assembly.",
        "5. Place the pot of braising liquid over medium heat and reduce the liquids to about 1 cup. Add the butter, brown sugar, parsley, cilantro, and eggs to the pot and cook, stirring constantly, until the eggs are scrambled. Remove from the heat and reserve for assembly.",
        "1. Preheat the oven to 400°F. Brush a paella pan or skillet lightly with olive oil.",
        "2. Lay out, one by one, 10 sheets of phyllo dough onto the pan, brushing each with a little olive oil before placing the next layer on.",
        "3. Spread the shredded chicken in a layer in the center of the phyllo, leaving plenty of space for the edges to fold up. Spread the egg mixture over the chicken and top with the almonds.",
        "4. Fold the overhanging phyllo dough over the filling to enclose it in a pocket inside the skillet. Brush the top lightly with olive oil and bake until the pastry is crisp and golden brown, 10 to 15 minutes.",
        "5. Garnish the finished b'steeya with powdered sugar and cinnamon. Cut into wedges and serve warm."
    ],
    "ingredients": [
        "3 tablespoons extra virgin olive oil, plus more for puff pastry",
        "2 pounds boneless, skinless chicken thighs",
        "Kosher salt and freshly ground black pepper",
        "1 large onion, peeled and finely chopped",
        "2 cloves garlic, peeled and minced",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground mace",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon saffron threads",
        "2 to 3 cups chicken stock, or canned low-sodium broth, as needed",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/4 cup brown sugar",
        "3 tablespoons flat-leaf parsley, chopped",
        "3 tablespoons cilantro, chopped",
        "8 large eggs, lightly beaten",
        "Olive oil, as needed",
        "10 sheets phyllo dough, defrosted if frozen",
        "1 cup almonds, toasted and coarsely chopped",
        "Powdered sugar, as needed",
        "Ground cinnamon, as needed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Egg",
        "Appetizer",
        "Bake",
        "Spice",
        "Cinnamon",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chicken-Filled Pastry (B'steeya)",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-filled-pastry-bsteeya-51121560"
}
