{
    "directions": [
        "Preheat the broiler to high.",
        "In a large bowl, mix together the breadcrumbs, milk and 1 tablespoon Marsala. Leave to soak for 5 minutes. Add the chicken, pecorino, egg, parsley, 1/2 teaspoon of the salt and the pepper. With your hands, gently mix together the ingredients until just combined. Form the mixture into tablespoon-size balls and place on an oiled baking sheet. Broil for 5 minutes, or until the meatballs are beginning to brown and are just barely cooked through. Remove from the oven and set aside.",
        "In a straight-sided skillet, heat 1 tablespoon of the olive oil over medium-high heat. Add the mushrooms and cook, stirring with a wooden spoon, until the mushrooms are brown on all sides, about 5 minutes. Add the shallots and the remaining 1/2 teaspoon salt and cook for another 2 minutes. Lower the heat to medium and stir in the flour and the remaining 1 tablespoon olive oil. Add the 1/3 cup Marsala and stir until the mixture is smooth. Whisk in the chicken broth and simmer for 5 minutes. Add the meatballs to the sauce and simmer for an additional 5 minutes to let the flavors blend. Serve hot, garnished with grated pecorino."
    ],
    "ingredients": [
        "1/4 cup panko breadcrumbs",
        "2 tablespoons milk, room temperature",
        "1/3 cup plus 1 tablespoon Marsala wine",
        "1 pound ground white meat chicken",
        "1/4 cup grated pecorino, plus extra for serving",
        "1 large egg, beaten",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "2 tablespoon extra-virgin olive oil",
        "8 ounces cremini mushrooms, sliced",
        "1 large shallot, minced",
        "1 1/2 teaspoons flour",
        "1 1/4 cups low-sodium chicken broth"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatball Appetizer",
        "Appetizer",
        "Meatballs",
        "Mushroom",
        "Vegetable",
        "Chicken",
        "Poultry Recipes"
    ],
    "title": "Chicken Marsala Meatballs",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/chicken-marsala-meatballs"
}
