{
    "directions": [
        "Mix flour and salt in processor. Add butter and cheese; blend until moist clumps form. Shape dough into 6-inch-long log. Wrap; chill while making chicken and filling.",
        "Place all ingredients in large pot; bring to boil. Reduce heat; simmer until chicken is cooked through, about 45 minutes. Transfer chicken to large bowl; cool. Discard skin and bones. Cut meat into 1-inch pieces; return to bowl. Strain cooking liquid into large saucepan. Boil until reduced to 3 cups stock, about 1 hour.",
        "Heat 1 tablespoon oil in large skillet over medium heat. Add peppers and onion; cook until soft, about 6 minutes. Transfer to bowl with chicken. Heat 2 tablespoons oil in same skillet over medium-high heat. Add mushrooms; sauté until just brown, about 4 minutes. Add to bowl with chicken; mix in next 4 ingredients.",
        "Melt butter in large saucepan over medium heat. Add flour; whisk 2 minutes. Gradually whisk in 3 cups stock, then milk, cream and beef base; bring to boil. Season sauce with salt and pepper. Stir 3 cups sauce into chicken mixture (reserve remaining sauce for another use).",
        "Cut prepared dough crosswise into 6 equal pieces. Roll out pieces to 7-inch rounds on lightly floured surface. Divide filling among six 2-cup soufflé dishes. Cover each dish with 1 dough round. Press overhang to side of dish to adhere. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 350°F. Brush top of each dough round with egg glaze; cut 3 slits in each for steam to escape. Bake pies until crust is golden brown and filling is heated through, about 45 minutes.",
        "*Sold at specialty foods stores and in the soup section of many supermarkets"
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1/2 teaspoon salt",
        "1 cup (2 sticks) unsalted butter, cut into pieces, room temperature",
        "1 8-ounce package cream cheese, cut into pieces, room temperature",
        "1 3 1/2-pound whole chicken",
        "12 cups water",
        "2 large onions, quartered",
        "2 large carrots, coarsely chopped",
        "1 large leek, sliced",
        "12 small thyme sprigs",
        "1 bay leaf",
        "3 tablespoons olive oil",
        "2 red bell peppers, cut into strips",
        "1 large onion, chopped",
        "8 ounces shiitake mushrooms, stemmed, caps sliced",
        "4 ounces green beans, boiled 1 minute, cut into 1-inch pieces",
        "3/4 cup chopped green onions",
        "1/2 cup drained oil-packed sun-dried tomatoes, chopped",
        "1 tablespoon chopped rosemary",
        "1/2 cup (1 stick) unsalted butter",
        "1/2 cup plus 2 tablespoons all purpose flour",
        "1 cup milk",
        "1/4 cup whipping cream",
        "4 1/2 teaspoons beef base* or other concentrated beef-flavored broth*",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Vegetable",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese"
    ],
    "title": "Chicken and Vegetable Pot Pies with Cream Cheese Crust",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-vegetable-pot-pies-with-cream-cheese-crust-104683"
}
