{
    "directions": [
        "Heat 5 tablespoons butter in a 2-quart heavy saucepan over moderate heat until foam subsides. Whisk in flour and cook roux, whisking, until pale golden, about 2 minutes. Gradually add milk and broth, whisking, and bring to a boil, whisking. Reduce heat and simmer gently, whisking frequently, until velouté sauce is silky and thick, about 25 minutes. Reserve 1/2 cup sauce for topping.",
        "Cook shallot in remaining tablespoon butter in a 10-inch heavy skillet over moderate heat, stirring, until softened, 2 to 3 minutes. Add mushrooms and cook, stirring, until lightly browned, about 4 minutes. Stir into velouté sauce along with chicken and Sherry.",
        "Cut tips from asparagus and set aside. Cut enough stalks into 1/4-inch pieces to measure 1 cup, reserving remainder for another use. Cook tips in a saucepan of boiling salted water until crisp-tender, 2 to 4 minutes. Transfer to a bowl of ice and cold water with a slotted spoon. Scoop out tips and drain on paper towels, then reserve for topping. Cook and drain chopped asparagus in same manner and stir into velouté sauce with salt and pepper to taste.",
        "Sift together flour, salt, nutmeg, and pepper to taste into a bowl. Whisk together milk, whole egg, and yolk in a small bowl, then gradually whisk into flour mixture. Force batter through a fine sieve into a bowl.",
        "Heat a dry 7- to 8-inch nonstick skillet over moderately high heat until hot, then brush very lightly with some melted butter. Spoon about 2 tablespoons batter into skillet, tilting to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is lightly browned, 6 to 10 seconds, then loosen crêpe with a spatula and flip. Cook until just cooked through, about 20 seconds, and transfer to a plate. Make 15 more crêpes in same manner, brushing skillet with melted butter as needed and stacking crêpes on plate.",
        "Preheat oven to 350°F.",
        "Spread 1/4 cup filling across center of 1 crêpe and roll into a cylinder. Transfer, seam side down, to buttered baking dish, then assemble more crêpes in same manner, fitting them snugly. Bake in middle of oven 15 minutes.",
        "Stir together yolk, 2 tablespoons cream, and reserved 1/2 cup sauce until smooth. Beat remaining 3 tablespoons cream with a whisk until it holds soft peaks, then fold into yolk mixture.",
        "Spoon topping over crêpes and broil 5 to 6 inches from heat until lightly browned, about 2 minutes.",
        "Heat butter in skillet, then add reserved asparagus tips and toss until warm.",
        "Put 2 crêpes on each of 8 plates and top with asparagus tips."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) unsalted butter",
        "1/4 cup all-purpose flour",
        "1 1/4 cups whole milk",
        "1 1/4 cups chicken broth",
        "1/4 cup chopped shallot",
        "1/2 cup chopped mushrooms",
        "2 cups finely chopped cooked chicken (9 oz)",
        "3 tablespoons medium-dry Sherry",
        "1 lb thin asparagus, trimmed",
        "3/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "Pinch of freshly grated nutmeg",
        "1 1/4 cups whole milk",
        "1 whole large egg",
        "1 large egg yolk",
        "1 tablespoon unsalted butter, melted",
        "1 large egg yolk",
        "5 tablespoons chilled heavy cream",
        "1 tablespoon unsalted butter",
        "Special equipment: a 3-quart flameproof ceramic or enameled shallow baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Asparagus",
        "Spring",
        "Gourmet"
    ],
    "title": "Chicken Crepes with Asparagus and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-crepes-with-asparagus-and-mushrooms-105117"
}
