{
    "directions": [
        "Combine garlic, ginger, turmeric, garam masala, coriander, and cumin in a small bowl. Whisk yogurt, salt, and half of spice mixture in a medium bowl; add chicken and turn to coat. Cover and chill 4-6 hours. Cover and chill remaining spice mixture.",
        "Heat ghee in a large heavy pot over medium heat. Add onion, tomato paste, cardamom, and chiles and cook, stirring often, until tomato paste has darkened and onion is soft, about 5 minutes. Add remaining half of spice mixture and cook, stirring often, until bottom of pot begins to brown, about 4 minutes.",
        "Add tomatoes with juices, crushing them with your hands as you add them. Bring to a boil, reduce heat, and simmer, stirring often and scraping up browned bits from bottom of pot, until sauce thickens, 8-10 minutes.",
        "Add cream and chopped cilantro. Simmer, stirring occasionally, until sauce thickens, 30-40 minutes.",
        "Meanwhile, preheat broiler. Line a rimmed baking sheet with foil and set a wire rack inside sheet. Arrange chicken on rack in a single layer. Broil until chicken starts to blacken in spots (it will not be cooked through), about 10 minutes.",
        "Cut chicken into bite-size pieces, add to sauce, and simmer, stirring occasionally, until chicken is cooked through, 8-10 minutes. Serve with rice and cilantro sprigs.",
        "DO AHEAD: Chicken can be made 2 days ahead. Cover; chill. Reheat before serving."
    ],
    "ingredients": [
        "6 garlic cloves, finely grated",
        "4 teaspoons finely grated peeled ginger",
        "4 teaspoons ground turmeric",
        "2 teaspoons garam masala",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cumin",
        "1 1/2 cups whole-milk yogurt (not Greek)",
        "1 tablespoon kosher salt",
        "2 pounds skinless, boneless chicken breasts, halved lengthwise",
        "3 tablespoons ghee (clarified butter) or vegetable oil",
        "1 small onion, thinly sliced",
        "1/4 cup tomato paste",
        "6 cardamom pods, crushed",
        "2 dried chiles de árbol or 1/2 teaspoon crushed red pepper flakes",
        "1 28-ounce can whole peeled tomatoes",
        "2 cups heavy cream",
        "3/4 cup chopped fresh cilantro plus sprigs for garnish",
        "Steamed basmati rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Tomato",
        "Yogurt",
        "Dinner",
        "Spice",
        "Hot Pepper",
        "Cilantro",
        "Chile Pepper",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken Tikka Masala",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tikka-masala-51154870"
}
