{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "For the tomato sauce: In a large pot, heat the oil over medium-high heat. Add the garlic, carrots and onion and saute until the vegetables are soft, approximately 5 minutes. Season with salt and pepper. Add the tomato sauce and bring to a simmer. Cover and simmer on low heat until thick, about 20 minutes.",
        "For the crust: Meanwhile, in a bowl, whisk together the chickpea flour, garlic powder, salt and 2/3 cup water. In a 7 1/2-inch round nonstick pan, heat the olive oil over medium heat and pour the \"dough\" into the pan (about 1/8 inch thick). Cook the \"dough\" until the edges start to brown, approximately 3 minutes. Flip the crust over like a pancake and cook on the other side for another 3 minutes. Transfer the crust to a baking sheet.",
        "To finish the tomato sauce, put the sauce into a food processor and process until smooth.",
        "For the pizza topping: Brush the olive oil over the chickpea crust. Spread a thin layer of the tomato sauce over the crust, leaving a 1/2-inch border. Sprinkle on the grated provolone, covering the tomato sauce. Place the chicken sausage slices on top.",
        "Bake until the cheese is melted and bubbling, 10 to 15 minutes."
    ],
    "ingredients": [
        "2 teaspoons olive oil",
        "2 garlic cloves, chopped",
        "1 carrot, chopped",
        "1/2 small onion, chopped",
        "Sea salt and freshly ground black pepper",
        "One 8-ounce can tomato sauce or 8 ounces crushed tomatoes",
        "2/3 cup chickpea flour",
        "2 teaspoons garlic powder",
        "1/2 teaspoon salt",
        "2 teaspoons olive oil",
        "1/2 teaspoon olive oil",
        "1 cup grated provolone cheese",
        "3 ounces chicken sausage (about 1 link), cut into 1/4-inch slices"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pizza Dough",
        "Pizza Recipes",
        "Cheese",
        "Provolone Recipes",
        "Beans and Legumes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes",
        "Diabetes-Friendly",
        "Low-Carb",
        "Low Calorie",
        "Gluten Free"
    ],
    "title": "Chickpea Crust Pizza",
    "url": "http://www.foodnetwork.com/recipes/chickpea-crust-pizza"
}
