{
    "directions": [
        "Bring 3 cups water and lentils to boil in heavy medium saucepan. Reduce heat to medium-low, cover and simmer until lentils are tender, but still retain shape, about 20 minutes. Drain well. Transfer lentils to large bowl. Mix in 1 tablespoon lemon juice and 1 tablespoon oil. Cover and refrigerate.",
        "Rub chicken breasts on both sides with curry powder. Season with salt and pepper. Heat 1 teaspoon olive oil in heavy large skillet over medium-high heat. Add chicken breasts to skillet and cook until golden brown and cooked through, about 5 minutes per side. Transfer chicken to plate and refrigerate until well chilled.",
        "Add chicken broth to same skillet and bring to boil. Add cauliflower and peas and cook over high heat until vegetables are crisp-tender and most of liquid has evaporated, about 5 minutes. Add mixture to lentils.",
        "Cut chicken into 1/2-inch cubes and add to lentils along with any accumulated juices. Mix in diced tomatoes, diced cucumber, sliced green onions, sour cream and chopped fresh mint. Season salad to taste with salt and pepper. cover and refrigerate until well chilled, about 2 hours. (Salad can be prepared 1 day ahead. Keep refrigerated.",
        "Toss watercress with remaining 2 tablespoons lemon juice and 2 tablespoons oil. Season to taste with salt and pepper. Mix pear into chicken salad. Mound chicken salad in center of 4 plates. Surround with watercress. Garnish salad with tomato wedges and mint sprigs and serve."
    ],
    "ingredients": [
        "3 cups water",
        "2/3 cup dried lentils",
        "3 tablespoons fresh lemon juice",
        "3 tablespoons plus 1 teaspoon olive oil",
        "2 large skinless boneless chicken breast halves",
        "2 teaspoons (generous) curry powder",
        "2/3 cup canned low-salt chicken broth",
        "1 cup cauliflower florets",
        "3/4 cup fresh or frozen peas",
        "2 small tomatoes, seeded, diced",
        "1 1/4 cups diced English hothouse cucumber",
        "2 green onions, sliced",
        "3 tablespoons sour cream",
        "2 tablespoons chopped fresh mint",
        "2 large bunches watercress, trimmed",
        "1 Asian pear* or Bartlett pear, peeled, cored, diced",
        "1 large tomato, cut into wedges",
        "Fresh mint sprigs",
        "Asian pears are also called Chinese pears and apple pears. Available in the produce section of many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Tomato",
        "Lunch",
        "Mint",
        "Curry",
        "Cucumber",
        "Lentil",
        "Pea",
        "Spring",
        "Summer",
        "Chill",
        "Healthy",
        "Asian Pear",
        "Watercress"
    ],
    "title": "Chicken Salad with Lentils, Peas and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-salad-with-lentils-peas-and-mint-407"
}
