{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Working in batches, add chicken and cook until brown on all sides, about 8 minutes per batch; transfer browned chicken to large bowl. Pour off all but 2 tablespoons drippings from pot. Add onions to pot and sauté over medium heat until golden, about 8 minutes. Add garlic and sauté 1 minute. Add wine and 1/4 cup marjoram and simmer until wine evaporates, about 4 minutes. Return chicken to pot. Arrange vegetables over chicken. Pour chicken broth over. Cover and bring to boil. Reduce heat and simmer until chicken is cooked through and vegetables are tender, about 30 minutes.",
        "Using slotted spoon, carefully transfer chicken and vegetables to large clean bowl. Boil liquid in pot until reduced to 3 cups, about 10 minutes. Mix cream and cornstarch in medium bowl. Stir into liquid in pot. Simmer until thickened to sauce consistency, about 5 minutes. Return chicken and vegetables to pot. (Can be made 2 days ahead. Cool slightly, then refrigerate uncovered until cold. Cover and keep refrigerated.) Bring stew to simmer, stirring gently. Add remaining 2 tablespoons marjoram and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "12 chicken thighs, well trimmed",
        "2 cups chopped onions",
        "6 garlic cloves, chopped",
        "1 cup dry white wine",
        "1/4 cup plus 2 tablespoons chopped fresh marjoram",
        "2 large boiling potatoes, peeled, each cut into 12 pieces",
        "3 large carrots, peeled, cut into 1/2-inch-thick rounds",
        "2 large parsnips, peeled, cut into 1/2-inch-thick rounds",
        "2 medium rutabagas, peeled, cut into 1 1/2-inch pieces",
        "2 medium turnips, peeled, cut into 1 1/2-inch pieces",
        "5 cups canned low-salt chicken broth",
        "3/4 cup whipping cream",
        "2 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Garlic",
        "Onion",
        "Potato",
        "Stew",
        "Carrot",
        "Parsnip",
        "Turnip",
        "White Wine",
        "Fall",
        "Winter",
        "Rutabaga"
    ],
    "title": "Chicken and Root Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-root-vegetable-stew-105683"
}
