{
    "directions": [
        "Combine raisins and vinegar in small bowl; set aside. Cook onions in large saucepan of boiling water 5 minutes. Drain; cool slightly. Trim and peel onions.",
        "Preheat oven to 350°F. Heat 3 tablespoons oil in heavy large ovenproof pot over medium-low heat. Add onions and sauté until golden, about 10 minutes; transfer to large bowl. Sprinkle chicken with salt and pepper. Add 1 tablespoon oil to same pot. Working in batches, add chicken to pot and cook over medium-high heat until golden brown, about 5 minutes per side. Add chicken to bowl with onions. Add tomatoes with juices, broth, wine, coriander, honey, allspice, and 1 teaspoon pepper to pot. Bring to boil, scraping up any browned bits. Return chicken and onions to pot. Stir in bay leaves, orange peel, cinnamon stick and oregano. Cover tightly and bake until chicken is cooked through, about 1 hour.",
        "Stir raisin mixture and remaining 2 tablespoons oil into stew. Season with salt and pepper. Transfer to shallow bowl."
    ],
    "ingredients": [
        "1/2 cup raisins or dried currants",
        "3 tablespoons red wine vinegar",
        "2 pounds small boiling onions",
        "6 tablespoons extra-virgin olive oil",
        "6 chicken leg-thigh pieces, cut apart",
        "1 28-ounce can diced tomatoes in juice",
        "1 cup canned low-salt chicken broth",
        "1/2 cup dry white wine",
        "1 tablespoon ground coriander",
        "1 teaspoon honey",
        "1 teaspoon ground allspice",
        "1 teaspoon coarsely ground black pepper",
        "2 bay leaves",
        "Peel of 1 small orange, removed in strips using vegetable peeler",
        "1 cinnamon stick",
        "1 teaspoon dried oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Onion",
        "Tomato",
        "Sauté",
        "Stew",
        "Currant",
        "Raisin",
        "Spring"
    ],
    "title": "Chicken, Onion, and Raisin Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-onion-and-raisin-stew-106484"
}
