{
    "directions": [
        "Cook the onions in the oil over medium-low heat for 10 to 15 minutes, until translucent. Add the garlic and cook for 1 more minute. Add the bell peppers, chili powder, cumin, red pepper flakes, cayenne, and salt. Cook for 1 minute. Crush the tomatoes by hand or in batches in a food processor fitted with a steel blade (pulse 6 to 8 times). Add to the pot with the basil. Bring to a boil, then reduce the heat and simmer, uncovered, for 30 minutes, stirring occasionally.",
        "Preheat the oven to 350 degrees F.",
        "Rub the chicken breasts with olive oil and place them on a baking sheet. Sprinkle generously with salt and pepper. Roast the chicken for 35 to 40 minutes, until just cooked. Let cool slightly. Separate the meat from the bones and skin and cut it into 3/4-inch chunks. Add to the chili and simmer, uncovered, for another 20 minutes. Serve with the toppings, or refrigerate and reheat gently before serving."
    ],
    "ingredients": [
        "4 cups chopped yellow onions (3 onions)",
        "1/8 cup good olive oil, plus extra for chicken",
        "1/8 cup minced garlic (2 cloves)",
        "2 red bell peppers, cored, seeded, and large-diced",
        "2 yellow bell peppers, cored, seeded, and large-diced",
        "1 teaspoon chili powder",
        "1 teaspoon ground cumin",
        "1/4 teaspoon dried red pepper flakes, or to taste",
        "1/4 teaspoon cayenne pepper, or to taste",
        "2 teaspoons kosher salt, plus more for chicken",
        "2 (28-ounce) cans whole peeled plum tomatoes in puree, undrained",
        "1/4 cup minced fresh basil leaves",
        "4 split chicken breasts, bone in, skin on",
        "Freshly ground black pepper",
        "Chopped onions, corn chips, grated cheddar, sour cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Chicken Chili",
        "Chili",
        "American",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Lunch",
        "Low-Fat",
        "Low Calorie",
        "Sauteing Recipes",
        "Roasting"
    ],
    "title": "Chicken Chili",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/chicken-chili-recipe"
}
