{
    "directions": [
        "Fill large bowl with water; squeeze in juice from lemon. Working with 1 artichoke at a time, break off enough outer leaves to expose pale green leaves. Trim dark green areas off stem and base. Quarter artichoke lengthwise; trim artichoke quarters to 1 1/2-inch lengths. Scrape out choke; drop quarters into lemon water.",
        "Heat 1/4 cup oil in heavy large skillet over medium-high heat. Add onions and sauté until translucent, about 5 minutes. Add next 7 ingredients and 6 tablespoons each parsley, dill, and mint; sauté 3 minutes longer. Scrape contents of skillet into heavy large pot; reserve skillet.",
        "Sprinkle chicken with salt and pepper. Heat 2 tablespoons oil in same skillet over medium-high heat. Add 1/3 of chicken and sauté until golden, about 3 minutes per side. Transfer to pot with onion mixture. Repeat with remaining chicken in 2 more batches, adding more oil by tablespoonfuls if needed. Add broth to skillet; bring to boil, scraping up browned bits. Transfer broth to pot; add fennel and carrots. Drain artichokes and add to pot.",
        "Bring tagine to boil. Cover, reduce heat to medium-low, and simmer until chicken is almost tender, about 20 minutes. Uncover and simmer until chicken and all vegetables are tender, about 15 minutes longer. Using slotted spoon, transfer chicken and vegetables to large bowl. Boil sauce until reduced enough to coat spoon, about 10 minutes. Season with salt and pepper. Return chicken and vegetables to sauce. (Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep refrigerated.)",
        "Rewarm tagine over medium heat. Transfer to large bowl. Sprinkle with 2 tablespoons each of parsley, dill, and mint."
    ],
    "ingredients": [
        "1 lemon, halved",
        "6 medium artichokes, stems trimmed to 1/2 inch",
        "1/2 cup (about) olive oil",
        "1 pound onions, chopped",
        "8 large garlic cloves, chopped",
        "3 tablespoons (packed) grated lemon peel",
        "1 tablespoon ground coriander",
        "2 teaspoons Hungarian sweet paprika",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons ground ginger",
        "1/4 teaspoon cayenne pepper",
        "8 tablespoons chopped fresh parsley",
        "8 tablespoons chopped fresh dill",
        "8 tablespoons chopped fresh mint",
        "4 pounds skinless boneless chicken thighs, trimmed of excess fat",
        "4 cups low-salt chicken broth",
        "3 fresh fennel bulbs, trimmed, bulbs quartered vertically",
        "5 large carrots (about 1 1/2 pounds), peeled, cut into 1-inch lengths"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Roast",
        "Passover",
        "Mint",
        "Artichoke",
        "Fennel",
        "Carrot",
        "Spring",
        "Kosher",
        "Dill",
        "Parsley"
    ],
    "title": "Chicken Tagine with Spring Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-tagine-with-spring-vegetables-107931"
}
