{
    "directions": [
        "Preheat the oven to 450˚F. Place a wire rack on a baking sheet lined with foil, and set it aside.",
        "Put the flour in a shallow dish. Put the panko in another shallow dish. In a medium bowl, whip the egg whites until they are very foamy but not quite holding peaks. Dredge the steaks in the flour, shaking off any excess. Dip them in the egg whites to coat. Then dredge the steaks in the panko, coating them evenly.",
        "Place the steaks on the wire rack and spray them with cooking spray. Season the steaks with salt and pepper to taste, and roast until they are golden brown and crispy, 8 to 10 minutes.",
        "Meanwhile, heat a large nonstick saute pan over high heat. When the pan is hot, add the sausage and stir it to break it up. Cook the sausage until it is just done about 4 minutes.",
        "While the sausage is cooking, whisk the chicken broth into the cornstarch in a small bowl.",
        "Add the cornstarch mixture to the sausage and bring it to a simmer. When the gravy has thickened slightly (after about 2 minutes), remove the pan from the heat.",
        "Stir the yogurt into the gravy. Season it with salt and pepper to taste. Pour the hot gravy over the steaks, and serve immediately."
    ],
    "ingredients": [
        "1 cup whole-wheat flour",
        "2 cups whole-wheat panko breadcrumbs, such as lan's All-Natural",
        "3 large egg whites",
        "Four 3-ounce portions lean filet mignon, pounded about 1/3 inch thick",
        "Nonstick cooking spray",
        "Salt and freshly ground black pepper",
        "One 6-ounce link hot Italian turkey sausage, casing removed",
        "1 cup low-fat,low-sodium chicken broth",
        "1 tablespoon cornstarch",
        "1/2 cup nonfat Greek yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Yogurt",
        "Low Cal",
        "Dinner",
        "Steak",
        "Poultry Sausage",
        "Healthy",
        "Sugar Conscious"
    ],
    "title": "Chicken-Fried Steak with Sausage Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fried-steak-with-sausage-gravy-363443"
}
