{
    "directions": [
        "To make the filling: Preheat the oven to 375 degrees F. Spray a large shallow casserole dish, or 6 individual casserole dishes with cooking spray. Season the chicken with 1/4 teaspoon each salt and pepper. In a large nonstick skillet, heat 2 teaspoons of the oil over a medium-high heat. Add the chicken to the pan and cook for 5 minutes, stirring occasionally. Transfer the chicken with its juices to a bowl. . Add 2 more teaspoons of oil to the same pan and heat it over a medium-high heat. Add the onions, carrots and celery and cook until the vegetables begin to soften, about 3 minutes. Add the green beans, garlic and remaining salt and pepper and cook for 2 minute more. Add the milk. Stir the flour into the broth until it is completely dissolved and add to the pan. Cook, stirring, until the mixture comes to a boil. Reduce the heat to medium-low and cook for 2 minutes more. Return the chicken with its juices back to the pan. Add the peas and thyme and stir to combine. Season with salt and pepper, to taste. Spoon the mixture into the baking dish or individual dishes.",
        "To make the crust: Put the whole-wheat flour, all-purpose flour, baking powder, baking soda and salt into a food processor and pulse a few times to combine. Add the butter and pulse about 12 times, or until pebble sized pieces are formed. Add the buttermilk then oil to the food processor and pulse until just moistened. Do not over mix. Drop the batter in 6 mounds on top of the chicken mixture (1 mound on each individual dish, if using) spreading the batter out slightly. Bake until filling is bubbling and the biscuit topping is golden brown, about 20 minutes.",
        "Excellent source of: Protein, Fiber, Vitamin A, Riboflavin, Niacin, Vitamin B6, Vitamin C, Vitamin K, Manganese, Phosphorus, Potassium, Selenium Good source of: Thiamin, Vitamin B12, Folate, Pantothenic Acid, Calcium, Iodine, Iron, Magnesium, Zinc"
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "3/4 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 pounds boneless, skinless chicken breasts, cut into 1/2-inch chunks",
        "4 teaspoons olive oil",
        "1 medium onion, chopped",
        "2 medium carrots, chopped",
        "2 celery stalks, chopped",
        "1/2 pound green beans, trimmed and chopped into 1/2-inch pieces",
        "2 cloves garlic, minced",
        "1 1/2 cups lowfat milk",
        "1/4 cup all-purpose flour",
        "1 cup low-sodium chicken broth",
        "1 cup peas, thawed if frozen",
        "1 1/2 tablespoons fresh thyme leaves",
        "1/2 cup whole-wheat flour",
        "1/4 cup all-purpose flour",
        "3/4 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "3 tablespoons cold unsalted butter, cut into small pieces",
        "2 tablespoons canola oil",
        "1/2 cup lowfat buttermilk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Healthy",
        "Biscuit",
        "Pot Pie Recipes",
        "Buttermilk",
        "Dairy Recipes",
        "Celery",
        "Vegetable",
        "Beans and Legumes",
        "Pea Recipes",
        "Carrot Recipes"
    ],
    "title": "Chicken and Biscuit Pot Pie",
    "url": "http://www.foodnetwork.com/recipes/ellie-krieger/chicken-and-biscuit-pot-pie-recipe"
}
