{
    "directions": [
        "Preheat oven to 350°F. Grind cilantro stems, garlic, chopped ginger, and peppercorns in mini processor to paste. Heat oil in large ovenproof pot over medium-low heat. Add paste; sauté until beginning to color, about 7 minutes. Add rice wine, increase heat, and boil 2 minutes. Stir in oyster sauce, yellow bean sauce, and sugar, then add broth. Add chicken pieces to pot. Bring soup to simmer. Cover and place in oven until chicken is tender, about 50 minutes. Remove soup from oven and let stand, covered, 10 minutes.",
        "Transfer chicken pieces to plate. Remove skin and bones. Cut chicken into bite-size pieces. Return chicken pieces to soup. Season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and refrigerate. Spoon off fat, if desired, and rewarm soup over low heat before continuing.",
        "Ladle soup and some chicken into 8 bowls. Garnish with strips of fresh ginger, green onions, and chile rings."
    ],
    "ingredients": [
        "12 long fresh cilantro stems",
        "6 garlic cloves, peeled",
        "1 2-inch piece peeled fresh ginger, chopped, plus matchstick-size strips for garnish",
        "10 white peppercorns",
        "3 tablespoons vegetable oil",
        "1/2 cup Chinese rice wine",
        "6 tablespoons oyster sauce",
        "6 tablespoons yellow bean sauce",
        "1/4 cup sugar",
        "8 cups low-salt chicken broth",
        "4 large organic or free-range chicken thighs with skin and bones, rinsed",
        "4 large organic or free-range chicken drumsticks, rinsed",
        "Chopped green onions",
        "Red jalapeño chile rings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Chicken",
        "Ginger",
        "Bake",
        "Low Cal",
        "Fall",
        "Winter",
        "Simmer"
    ],
    "title": "Chicken and Ginger Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-ginger-soup-241847"
}
