{
    "directions": [
        "Position rack in bottom third of oven and preheat to 350°F. Cook bacon in very large pot over medium-high heat until brown but not yet crisp, stirring often, 8 to 10 minutes. Add smoked sausage, andouille, and tasso. Sauté until meats start to brown in spots, about 10 minutes. Add onions, celery, and bell peppers. Cook until vegetables begin to soften, stirring occasionally, 10 to 12 minutes. Mix in chicken. Cook until outside of chicken turns white, stirring often, 5 to 6 minutes. Mix in paprika, thyme, chili powder, and 1/4 teaspoon cayenne. Cook 1 minute. Add diced tomatoes with chiles and broth; stir to blend well. Add more cayenne, if desired. Mix in rice.",
        "Bring jambalaya to boil. Cover pot. Place in oven and bake until rice is tender and liquids are absorbed, 45 to 48 minutes. Uncover pot. Mix chopped green onions into jambalaya; sprinkle jambalaya with chopped parsley and serve."
    ],
    "ingredients": [
        "12 ounces applewood-smoked bacon, diced",
        "1 1/2 pounds smoked fully cooked sausage (such as linguiça), halved lengthwise, cut crosswise into 1/2-inch-thick semi-circles",
        "1 pound andouille sausages, quartered lengthwise, cut crosswise into 1/2-inch cubes",
        "1/2 pound tasso or smoked ham (such as Black Forest), cut into 1/2-inch cubes",
        "1 1/2 pounds onions, chopped (4 to 5 cups)",
        "2 large celery stalks, chopped",
        "1 8-to 10-ounce red bell pepper, coarsely chopped",
        "1 8-to 10-ounce green bell pepper, coarsely chopped",
        "6 large skinless boneless chicken thighs, cut into 1- to 11/2-inch pieces",
        "2 tablespoons paprika",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chili powder",
        "1/4 teaspoon (or more) cayenne pepper",
        "3 10-ounce cans diced tomatoes and green chiles",
        "2 1/2 cups beef broth",
        "3 cups (19 to 20 ounces) long-grain white rice",
        "8 green onions, chopped (about 2 cups)",
        "Chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "High Fiber",
        "Mardi Gras",
        "Dinner",
        "Ham",
        "Sausage",
        "Bell Pepper",
        "Party",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chicken and Sausage Jambalaya",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-sausage-jambalaya-364172"
}
