{
    "directions": [
        "Tomato sauce: Heat the oil in a large nonstick skillet over medium heat. Add the onion and cook until softened and lightly browned, about 5 minutes. Add the garlic and cook until fragrant, about 1 to 2 minutes. Add the tomatoes, vinegar, salt, and red pepper flakes; bring to a boil. Reduce the heat and simmer, covered, until the flavors are blended and the sauce begins to thicken slightly, about 10 minutes. Remove from the heat; stir in the basil.",
        "Chicken: Preheat the oven to 425 degrees F. Spray a 9 by 13-inch baking dish with cooking spray. Sprinkle the cutlets with the salt. Lightly beat the egg whites in a medium bowl. Combine the bread crumbs and Parmesan on a sheet of waxed paper. Spread the flour on another sheet of waxed paper. Working with 1 piece of chicken at a time, dip both sides into the flour, shaking off excess. Dip each piece into the egg whites, shaking off excess, and then press both sides into the breading to coat.",
        "Heat the oil in a large nonstick skillet over medium-high heat. Add the chicken (in batches, if necessary) and cook until browned, 3 to 4 minutes. Transfer the chicken, in 1 layer, to the baking dish. Spoon the sauce over the chicken then sprinkle with the cheese. Bake, covered loosely with a tent of foil, until the cheese is melted and the sauce is bubbly, about 12 to 15 minutes.",
        "Food Network Kitchens created this lightened-up recipe from a user submission. Click here to see the original recipe."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 small yellow onion, chopped (1/2 cup)",
        "2 to 3 cloves garlic, minced",
        "1 (28-ounce) can crushed tomatoes, preferably organic",
        "1 tablespoon balsamic vinegar",
        "Salt to taste",
        "1/4 teaspoon red pepper flakes",
        "1/4 cup chopped fresh basil leaves",
        "Nonstick cooking spray",
        "4 thin chicken cutlets (about 1 1/4 pounds total)",
        "Salt to taste",
        "2 large egg whites",
        "6 tablespoons dry Italian bread crumbs",
        "2 tablespoons grated Parmesan",
        "3 tablespoons all-purpose flour",
        "4 to 5 teaspoons olive oil",
        "1/2 cup part-skim shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Healthy",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Mozzarella Recipes"
    ],
    "title": "Chicken Parmesan",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chicken-parmesan-recipe2"
}
