{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "Melt the butter in a large saute pan over medium heat. Cook the onions, carrots, and celery with salt and pepper, to taste, until the carrots soften, about 10 minutes. Add the garlic and thyme and cook for an additional minute, stirring frequently. Add the flour and cook off the raw flavor, about 1 minute more. Turn up the heat to medium-high and deglaze the pan with the wine. Whisk in the stock and Dijon mustard. Add the peas and chicken and cook on a very low simmer until the sauce thickens up into a gravy, 5 to 10 minutes. Remove from the heat and set aside.",
        "On a lightly floured surface, unfold the pastry dough and cut into 4 even squares (cut once horizontally and once vertically). Gently roll out each square, increasing the size of the square by about 20 percent. Place the squares on a baking sheet and spoon the chicken mixture in the center. Fold the squares diagonally to create triangles. Pinch the edges together to create turnovers (use a little water if needed to bind). Press the edges with a fork to create a decorative border. Whisk the egg with a splash of water and brush the turnovers with the egg wash. Cut a small slit in the top to allow the steam to escape during baking. Bake the turnovers until golden brown, about 30 minutes. Let cool at least 10 minutes before serving as the insides will be very hot."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1/2 onion, chopped",
        "1 carrot, chopped",
        "1 stalk celery, chopped",
        "Kosher salt and freshly ground black pepper",
        "2 cloves garlic, minced",
        "2 teaspoons dried thyme",
        "1 tablespoon flour, plus more for dusting",
        "1/2 cup white wine",
        "1 cup chicken stock",
        "1 teaspoon Dijon mustard",
        "1/2 cup frozen peas",
        "1 1/2 cups cubed or shredded cooked chicken",
        "1 sheet frozen puff pastry, thawed",
        "1 egg"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Baking",
        "Healthy",
        "Pot Pie Recipes",
        "Diabetes-Friendly"
    ],
    "title": "Chicken Pot Pie Turnovers",
    "url": "http://www.foodnetwork.com/recipes/melissa-darabian/chicken-pot-pie-turnovers-recipe"
}
