{
    "directions": [
        "Mix 1/4 cup lemon juice, 2 tablespoons parsley, lemon peel and minced garlic in large glass baking dish. Whisk in 6 tablespoons oil. Season to taste with salt and pepper. Add chicken. Turn to coat. Cover and refrigerate chicken overnight, turning once.",
        "Preheat oven to 400°F. Remove chicken from marinade. Pat chicken dry with paper towels. Sprinkle with salt and pepper. Heat 1 tablespoon oil in heavy large ovenproof pot over medium-high heat. Working in batches, cook chicken until brown on all sides, about 10 minutes. Transfer chicken to large bowl.",
        "Add carrots, sliced garlic and oregano to pot. Sauté over medium-high heat until garlic is tender, about 2 minutes. Add wine and remaining 1/4 cup lemon juice. Bring to boil, scraping up browned bits from bottom. Simmer until liquid is reduced by half, about 5 minutes. Add chicken stock. Return chicken to pot. Place pot in oven. Bake uncovered until chicken is cooked through, turning chicken occasionally, about 35 minutes.",
        "Using slotted spoon, transfer chicken, carrots and sliced garlic to large bowl. Tent with foil to keep warm.",
        "Boil cooking liquid over medium-high heat until reduced to 3 cups, about 10 minutes. Remove from heat. Pour 1 cup reduced cooking liquid into small bowl. Set aside.",
        "Return cooking liquid remaining in pot to simmer. Add mustard greens. Cook until greens are tender, about 2 minutes. Stir in green onions, dill, Dijon mustard and remaining 1 tablespoon parsley. Cover and keep warm.",
        "Whisk lemon juice and cornstarch in another small bowl to blend. Whisk egg yolks in medium bowl to blend. Using electric mixer, beat egg whites and pinch of salt in medium stainless steel bowl until soft peaks form. Fold in egg yolks, then lemon juice mixture. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk until mixture thickens, about 3 minutes. Gradually add reserved 1 cup cooking liquid, whisking constantly, until mixture thickens, about 3 minutes (do not boil). Add sauce to mustard greens; stir to combine. Season to taste with salt and pepper.",
        "Pour sauce and mustard greens over chicken and serve."
    ],
    "ingredients": [
        "1/2 cup fresh lemon juice",
        "3 tablespoons chopped fresh parsley",
        "1 1/2 teaspoons grated lemon peel",
        "1 1/2 teaspoons minced garlic",
        "7 tablespoons olive oil",
        "2 3 1/2-pound chickens, each cut into 8 pieces",
        "2 cups chopped peeled carrots",
        "4 large garlic cloves, thinly sliced",
        "1 1/2 teaspoons dried oregano",
        "1 cup dry white wine",
        "3 1/2 cups chicken stock or canned low-salt chicken broth",
        "2 bunches mustard greens, trimmed, cut into 1/2-inch-wide strips",
        "3 green onions, chopped",
        "2 tablespoons chopped fresh dill",
        "2 tablespoons Dijon mustard",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon cornstarch",
        "2 large eggs, separated",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mustard",
        "Bake",
        "Marinate",
        "Lemon",
        "Fall",
        "Mustard Greens"
    ],
    "title": "Chicken Fricassée with Carrots, Mustard Greens and Avgolemono Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-fricassee-with-carrots-mustard-greens-and-avgolemono-sauce-5682"
}
