{
    "directions": [
        "Preheat oven to 325°F. If using peanuts, blend in a food processor until they form a butter, 2 to 3 minutes. Put fresh or jarred peanut butter in a bowl and gradually whisk in 1 1/2 cups water.",
        "Pat chicken dry and season with salt. Heat oil in an ovenproof 4- to 5-quart heavy pot (with a tight-fitting lid, for use later) over moderately high heat until hot but not smoking, then brown chicken, uncovered, in 3 or 4 batches, without crowding, about 6 minutes. Transfer chicken to a bowl as browned. Pour off all but about 2 tablespoons fat from pot, then add onion and bell pepper and sauté, stirring occasionally, until onion begins to brown, about 4 minutes. Add garlic and sauté, stirring, 1 minute.",
        "Stir in peanut butter mixture, remaining 1 1/2 cups water, tomatoes with juice, cayenne (to taste), salt, and chicken with any juices accumulated in bowl and bring to a simmer. Cover pot with lid, then braise chicken in middle of oven until tender, 45 minutes to 1 hour. Transfer chicken with tongs to a large (4-quart) serving dish and keep warm, covered.",
        "Stir potatoes and turnips into sauce and simmer on top of stove, uncovered, until vegetables are tender, 15 to 20 minutes. Transfer cooked vegetables with a slotted spoon to serving dish.",
        "Simmer sauce, uncovered, stirring, until reduced to about 4 cups, about 5 minutes. Remove from heat and stir in spinach, then let stand, partially covered, until spinach is wilted, 2 to 3 minutes. Season with salt if necessary, then spoon over chicken."
    ],
    "ingredients": [
        "1 1/2 cups unsalted roasted peanuts (1/2 lb) or 1 cup \"all natural\" creamy peanut butter",
        "3 cups water",
        "4 1/2 to 5 1/2 lb chicken pieces such as drumsticks, thighs, and breast halves",
        "2 tablespoons vegetable oil",
        "1 medium onion, chopped",
        "1 red bell pepper, chopped",
        "3 garlic cloves, finely chopped",
        "1 (14- to 16-oz) can diced tomatoes including juice",
        "1 to 1 1/2 teaspoons cayenne",
        "2 teaspoons salt",
        "1 1/2 lb sweet potatoes (2 medium), peeled and cut into 1-inch pieces",
        "4 medium turnips (1 lb), peeled if desired, halved horizontally, and cut into 3/4-inch wedges",
        "1 lb spinach, coarse stems discarded",
        "Accompaniment: white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Nut",
        "Poultry",
        "Vegetable",
        "Braise",
        "Wheat/Gluten-Free",
        "Ramadan",
        "Dinner",
        "Peanut",
        "Bell Pepper",
        "Turnip",
        "Sweet Potato/Yam",
        "Winter",
        "Party",
        "Gourmet",
        "Dairy Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chicken and Vegetables Braised in Peanut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-and-vegetables-braised-in-peanut-sauce-106049"
}
