{
    "directions": [
        "Combine 3 tablespoons oil and next 7 ingredients in large bowl. Cover; refrigerate overnight, stirring occasionally. Using tongs, remove chicken from marinade. Place chicken on paper towels and pat dry; sprinkle with salt. Reserve marinade.",
        "Heat remaining 3 tablespoons oil in heavy large pot over medium-high heat. Add chicken breasts, skin side down, and cook until brown, about 3 minutes per side; transfer to plate. Add thighs to same pot, skin side down; cook until first side is brown, about 3 minutes. Sprinkle with flour. Turn over and cook until second side is brown, about 3 minutes. Add reserved marinade, 1 cup chicken stock and beef stock; bring to boil. Reduce heat to medium-low, cover and simmer until chicken thighs are almost tender, about 20 minutes. Add chicken breasts. Cover and simmer until all chicken is tender and cooked through, about 12 minutes.",
        "Transfer chicken to large skillet. Boil sauce in pot until thick enough to coat spoon, about 15 minutes. Season sauce with salt and pepper; strain sauce over chicken. (Can be made 1 day ahead. Cool chicken slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm over low heat before serving.)",
        "Melt butter in heavy medium skillet over medium-high heat. Add carrots and parsnips and sauté 3 minutes, tossing to coat with butter. Add remaining 1/3 cup chicken stock; bring to boil. Reduce heat to medium-low, cover and simmer until vegetables are just tender, about 10 minutes. Uncover; simmer until juices thicken to glaze, about 3 minutes.",
        "Mound Wilted Greens in center of 4 plates. Top each with 1 chicken thigh, 1 chicken breast and red wine sauce, then carrots and parsnips, and serve."
    ],
    "ingredients": [
        "6 tablespoons olive oil",
        "4 boneless chicken breast halves with skin",
        "4 chicken thighs with skin and bone",
        "2 cups dry red wine",
        "1 1/4 cups chopped onions",
        "6 large fresh thyme sprigs",
        "3 garlic cloves, minced",
        "2 teaspoons whole black peppercorns",
        "1 tablespoon all purpose flour",
        "1 1/3 cups chicken stock or canned low-salt chicken broth",
        "1 cup beef stock or canned beef broth",
        "2 tablespoons (1/4 stick) butter",
        "12 baby carrots, peeled",
        "2 medium parsnips (about 8 ounces), peeled, cut into 3x1/2x1/2-inch sticks",
        "Wilted Greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Chicken",
        "Poultry",
        "Vegetable",
        "Marinate",
        "Dinner",
        "Root Vegetable",
        "Carrot",
        "Parsnip",
        "Red Wine",
        "Fall",
        "Winter",
        "Anniversary",
        "Simmer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chicken in Red Wine Sauce with Root Vegetables and Wilted Greens",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-in-red-wine-sauce-with-root-vegetables-and-wilted-greens-103907"
}
