{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper. Arrange chicken on the baking sheet.",
        "Bake chicken in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Dice chicken and place in a bowl; add ranch mix and stir until coated.",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving bacon grease in the skillet. Crumble bacon into small pieces.",
        "Heat reserved bacon grease in the skillet; cook and stir bell pepper until slightly tender, 2 to 3 minutes. Add chicken, 1 jar Alfredo sauce, milk, and garlic; cook and stir until heated through, about 5 minutes.",
        "Bring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.",
        "Pour 1/2 the jar of remaining Alfredo sauce into a casserole dish; top with 1/2 of the penne, 1/2 of the chicken mixture, 1 1/2 cup mozzarella cheese, and 1/2 of the bacon. Repeat layering with remaining ingredients in the same order ending with 1 cup mozzarella cheese and bacon on top.",
        "Bake in the preheated oven until casserole is bubbling and cheese is lightly browned, about 30 minutes."
    ],
    "ingredients": [
        "2 pounds skinless, boneless chicken breasts",
        "1 (1 ounce) package dry ranch dressing mix (such as Hidden Valley Ranch®)",
        "1 pound bacon",
        "1 green bell pepper, chopped (optional)",
        "2 (15 ounce) jars Alfredo sauce, divided",
        "1/3 cup milk",
        "2 cloves garlic, minced",
        "1 (16 ounce) package penne pasta",
        "4 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken Bacon Ranch Casserole",
    "url": "http://allrecipes.com/recipe/256528/chicken-bacon-ranch-casserole/"
}
