{
    "directions": [
        "Stir potatoes, carrots, onion, celery, mushrooms, garlic, thyme, sage, salt, and black pepper together in a 4-quart slow cooker. Sprinkle tapioca over vegetable mixture and place chicken thighs into the cooker. Pour chicken broth over chicken and vegetables.",
        "Cover, set cooker to Low, and cook until vegetables and chicken are tender and sauce has thickened, 6 to 7 hours. If preferred, set cooker to High and cook 3 to 3 1/2 hours.",
        "About 30 minutes before serving time, preheat oven to 450 degrees F (230 degrees C).",
        "Stir biscuit mix and Cheddar cheese in a bowl until thoroughly combined; mix in milk. Turn dough out onto a floured work surface and knead 10 times. Roll dough out into a 1/2-inch thick circle and cut out biscuits with a floured 3-inch biscuit cutter. Reroll scraps as needed. Arrange biscuits onto an ungreased baking sheet.",
        "Bake biscuits in the preheated oven until golden brown, 10 to 12 minutes.",
        "While biscuits are baking, remove chicken thighs from slow cooker and let stand until cool enough to handle. Strip meat off the bones and coarsely chop; discard bones. Return chicken meat to the slow cooker; stir in peas and cream cheese until cream cheese has melted and sauce is creamy. Cook for 10 more minutes. Serve with Cheddar biscuits."
    ],
    "ingredients": [
        "2 cups chopped red potatoes",
        "1 cup coarsely chopped carrots",
        "1/2 cup coarsely chopped onion",
        "1/2 cup coarsely chopped celery",
        "1 (4 ounce) can sliced mushrooms, drained",
        "2 cloves garlic, minced",
        "1/2 teaspoon crushed dried thyme",
        "1/2 teaspoon crumbled dried sage",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 tablespoons quick-cooking tapioca, crushed",
        "1 pound bone-in chicken thighs, skin removed",
        "1 cup chicken broth",
        "1 2/3 cups baking mix",
        "1/2 cup shredded Cheddar cheese",
        "1/2 cup milk",
        "1 cup frozen peas",
        "1 (3 ounce) package cream cheese, cubed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chicken and Cheddar Biscuits",
    "url": "http://allrecipes.com/recipe/229096/chicken-and-cheddar-biscuits/"
}
