{
    "directions": [
        "Put a chicken cutlet between 2 pieces of plastic wrap and, using a rolling pin or the flat side of a meat mallet, pound it out about 1/4 inch thick. Season all over with some salt and pepper. Repeat with the remaining 3 cutlets.",
        "Whisk the eggs in a large shallow bowl. Spread the panko in another large shallow bowl and stir in the grated Parmesan, Italian seasoning and basil. Have a large tray ready nearby. Dip a cutlet in the egg to coat all over, letting the excess drip off, and then press both sides into the panko, coating well. Set aside on the tray and repeat with the remaining 3 cutlets. Refrigerate the cutlets for 20 minutes.",
        "Set a large skillet over medium-high heat, add some canola oil and heat until hot (you can check by dropping in a little bit of the panko mixture; it should sizzle). Add 2 chicken cutlets and cook until the bottoms are golden brown, about 2 minutes. Flip and cook until the other sides are golden brown and the chicken is cooked through, about 2 more minutes. Transfer each cutlet to a dinner plate.",
        "Carefully pour out and discard any remaining oil and crumbs in the skillet. Heat some more canola oil and cook the 2 remaining chicken cutlets. Top each cutlet with some Spicy Arugula and Parmesan shavings. Put a lemon wedge on each plate and serve.",
        "Put the lemon juice, shallots, Dijon mustard and some salt and pepper in a small bowl. Slowly whisk in the olive oil. Taste and adjust the seasoning as needed.",
        "Put the arugula in another bowl. Drizzle some of the dressing around the sides of the bowl. Toss to lightly coat the arugula; taste and season with additional salt and pepper if needed."
    ],
    "ingredients": [
        "4 chicken cutlets, 4 to 5 ounces each",
        "Kosher salt and freshly ground black pepper",
        "2 large eggs",
        "2 cups panko breadcrumbs",
        "1/4 cup grated Parmesan, plus Parmesan shavings, for serving",
        "2 teaspoons Italian seasoning",
        "1/2 teaspoon dried basil",
        "Canola oil, for frying",
        "Spicy Arugula, recipe follows",
        "Lemon wedges, for serving",
        "1 1/2 tablespoons freshly-squeezed lemon juice (about 1/2 lemon)",
        "1 tablespoon chopped shallots",
        "Heaping 1/2 teaspoon Dijon mustard",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup extra-virgin olive oil",
        "4 ounces arugula"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Arugula",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Chicken Cutlets with Spicy Arugula",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/chicken-cutlets-with-spicy-arugula"
}
