{
    "directions": [
        "Heat a large pot of water to a boil. Salt the water and add orzo pasta. Cook to al dente.",
        "Preheat a large nonstick skillet over medium-high heat and add extra-virgin olive oil, 2 turns of the pan. Season chicken liberally with salt and pepper and add to the hot skillet. Cook the chicken for 5 to 6 minutes on each side. Remove the chicken from the pan and cover with foil to keep warm.",
        "Return the skillet to the heat, turn heat back a bit, and add the butter. Once the butter melts add the mushrooms and brown stirring occasionally for about 4 to 5 minutes. Once the mushrooms are brown season with salt and pepper then add the garlic, thyme and shallots. Cook stirring occasionally for about 2 minutes or until the shallots are wilted. Sprinkle the flour into the pan and cook 2 minutes more. Whisk in the stock, balsamic vinegar and the cream. Turn the heat up to high and simmer for about 2 minutes or until thickened. Slice the chicken on an angle. Add the parsley and the chicken back to the skillet to heat up, about 1 minute.",
        "To serve, pile orzo on dinner plates and top with the sliced chicken and sauce."
    ],
    "ingredients": [
        "Salt",
        "1/2 pound orzo pasta",
        "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
        "4 boneless, skinless chicken breasts, 6 ounces",
        "Pepper",
        "2 tablespoons butter",
        "12 cremini or baby portobello mushrooms, sliced",
        "12 shiitake mushrooms, stems removed and sliced",
        "12 white mushrooms, sliced",
        "2 large cloves garlic, chopped",
        "1 tablespoon thyme leaves, a couple of sprigs, chopped",
        "2 large shallots, thinly sliced",
        "2 tablespoons all-purpose flour",
        "1 1/2 cups chicken stock",
        "1 tablespoon balsamic vinegar, eyeball it",
        "3 tablespoons heavy cream or half-and-half, a couple turns of the pan",
        "1/4 cup chopped flat-leaf parsley, a generous handful"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Pasta Recipes",
        "Easy Recipes",
        "Pasta Recipes",
        "Easy Chicken Recipes",
        "Chicken",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Skillet Recipes",
        "Shallot Recipes",
        "Vegetable",
        "Dairy Recipes",
        "Mushroom"
    ],
    "title": "Chicken with Wild Mushroom and Balsamic Cream Sauce",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/chicken-with-wild-mushroom-and-balsamic-cream-sauce-recipe"
}
