{
    "directions": [
        "Whisk mayonnaise, crème fraîche, buttermilk, parsley, lemon juice, Maggi, garlic powder, onion powder, and 1/2 tsp. pepper in a medium bowl to combine. Season sauce with salt.",
        "Place flour in a shallow bowl. Lightly beat eggs in another shallow bowl to blend. Place panko in a third shallow bowl; season all three with salt and black pepper. Working one at a time, season cutlets with salt and pepper, then dredge in flour, shaking off excess. Transfer to bowl with egg and turn to coat, letting excess drip off. Coat with panko, pressing to adhere.",
        "Heat oil in a large skillet over medium. Working in 2 batches, cook cutlets, shaking pan occasionally, until golden brown and cooked through, about 2 minutes per side. Transfer to a wire rack; season with salt.",
        "Toss cucumber, radishes, vinegar, sugar, and a pinch of salt in a medium bowl to combine; taste and adjust seasoning with more vinegar, sugar and/or salt as needed.",
        "Drizzle cutlets with sauce, top with vegetables, then drizzle with a little more sauce. Sprinkle with Aleppo-style pepper."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/2 cup crème fraîche",
        "1/4 cup buttermilk",
        "1/2 cup finely chopped parsley",
        "1 tablespoon fresh lemon juice",
        "1 1/2 teaspoons Maggi seasoning sauce",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon freshly ground black pepper, plus more",
        "Kosher salt",
        "3/4 cup all-purpose flour",
        "3 large eggs, room temperature",
        "11/2 cups panko (Japanese breadcrumbs)",
        "4 small skinless, boneless chicken breasts, pounded 1/4 inch thick",
        "1/2 cup vegetable oil",
        "1/2 English hothouse cucumber, thinly sliced lengthwise",
        "4 red radishes, trimmed, sliced",
        "1 tablespoon distilled white vinegar",
        "Pinch of sugar",
        "Aleppo-style pepper (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fry",
        "Cucumber",
        "Radish",
        "Buttermilk",
        "Herb",
        "Dinner"
    ],
    "title": "Chicken Milanesa With Maggi Ranch Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chicken-milanesa-with-maggi-ranch-sauce"
}
