{
    "directions": [
        "1. On Thursday night, soak the white or red beans and chickpeas in cold water to cover.",
        "2. On Friday morning, in a large heavy pot, sauté the onions in the vegetable oil until translucent. Then add the brown sugar and the water and carefully caramelize the onions over very low heat. Turn off the heat until the remaining ingredients are prepared.",
        "3. Drain the beans and scatter them on top of the onions.",
        "4. Cut the fat from the brisket, dice the fat, and set it aside. Rinse the rice in cold water and then drain; repeat twice more. Season the rice with 1/2 teaspoon salt and a few grinds of black pepper and dot with about 4 tablespoons of cubed beef fat. Place the rice in the center of a sheet of cheesecloth and enclose it loosely, so that the rice can expand. Tie with a thin strip of cheesecloth or twine and set aside.",
        "5. Season the frika, bulgur, or barley with 1/2 teaspoon salt and a few grinds of black pepper, dot with about 4 tablespoons of cubed beef fat, and put it in another piece of cheesecloth. Tie it up loosely.",
        "6. Add the beef bones to the onions in the pot. Set the brisket on top, then the 2 bags of grains, the kishke, pearl onions, potatoes, and eggs. Sprinkle with additional salt to taste, pepper, baharat, and soup powder. Add water to cover, cover the pot, and ring to a boil. Then transfer to a preheated 200-degree oven to cook overnight or put the pot on a blech (a heated asbestos pad which many Jewish cooks use to keep Sabbath dishes warm) over low heat and leave until ready to serve.",
        "•For this dish, Nathan prefers the texture and flavor of dried chickpeas and beans to canned.\n•Baharat, an Eastern Mediterranean spice blend, generally includes paprika, hot pepper, black pepper, cumin, coriander, cinnamon, allspice, nutmeg, cardamom, cloves, and salt. It is available at Middle Eastern markets. If you can't find it, Nathan recommends using your favorites from the list above, being sure to include pepper.\n•\"This dish can easily be made in a slow cooker,\" says Nathan. \"Sauté the onions and place them in the cooker, then add the drained beans and other ingredients. Leave the dish to cook throughout the day or overnight.\""
    ],
    "ingredients": [
        "1 1/2 cups white or red kidney beans",
        "1 1/2 cups chickpeas",
        "2 large onions, chopped",
        "2 tablespoons vegetable oil",
        "1/2 cup light-brown sugar",
        "1/4 cup water",
        "4-pound beef brisket, with fat",
        "1 cup long-grain rice",
        "1 teaspoon salt",
        "Freshly ground pepper to taste",
        "1 cup parched wheat (frika), bulgur, or barley",
        "4-5 beef soup bones",
        "1 pound kishke",
        "1 pound pearl onions",
        "5 medium potatoes, peeled and halved",
        "6 large eggs in the shell",
        "2 tablespoons baharat, or to taste",
        "4-5 teaspoons beef soup powder or 4 beef bouillon cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Potato",
        "Vegetable",
        "Dinner",
        "Meat",
        "Chickpea",
        "Kosher",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chief of Staff Cholent (Hebronite Hamim)",
    "url": "http://www.epicurious.com/recipes/food/views/chief-of-staff-cholent-hebronite-hamim-231758"
}
