{
    "directions": [
        "Simmer mushroom in water in a small saucepan, covered, 15 minutes. Add kombu and barely simmer, covered, 5 minutes. Remove from heat and let stand, covered, 5 minutes. Strain through a fine-mesh sieve into a large glass measure, pressing on and discarding solids. Return 2 cups liquid (add water if necessary) to saucepan. Add soy sauce, mirin, ponzu, sugar, and 1/4 teaspoon salt and bring to a boil, stirring until sugar has dissolved. Remove from heat. Stir in sesame oil, then cool in pan in a large ice bath.",
        "Blanch sugar snaps in a large pot of unsalted boiling water until crisp-tender, about 2 minutes. Transfer with a slotted spoon to a large colander set in ice bath to stop cooking. Lift colander to drain. Transfer sugar snaps to a bowl. Meanwhile, return water to a boil. Blanch spinach until just wilted, about 30 seconds, then cool and drain in same manner. Squeeze out excess water. Add to sugar snaps.",
        "Return water to a boil.",
        "Add noodles and cook according to package directions, stirring occasionally, until tender. Drain in colander and rinse with cold water. Cool in ice bath until very cold (add more ice to water as necessary). Drain well.",
        "Carefully drain tofu and pat dry. Cut into 3/4-inch cubes.",
        "Whisk sauce, then pour 1 1/2 cups sauce into a large bowl. Add noodles, sugar snaps, spinach, and half of scallions and toss. Serve in shallow bowls, topped with tofu, remaining scallions, and ginger. Drizzle with some of remaining sauce and serve remainder on the side."
    ],
    "ingredients": [
        "1 large dried shiitake mushroom",
        "2 1/2 cups water",
        "8 (1-inch) pieces kombu (dried kelp)",
        "1/2 cup soy sauce (preferably Japanese)",
        "1/4 cup mirin (Japanese sweet rice wine)",
        "3 tablespoons ponzu sauce (not containing dashi)",
        "1 tablespoon sugar",
        "1 tablespoon Asian sesame oil",
        "1 pound sugar snap peas, thinly sliced",
        "10 ounces baby spinach (16 cups)",
        "1 pound dried soba noodles",
        "1 (14- to 18-ounce) package silken tofu",
        "1 cup thinly sliced scallions, divided",
        "2 tablespoons thin matchsticks of peeled ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pasta",
        "Tofu",
        "Spinach",
        "Summer",
        "Chill",
        "Healthy",
        "Vegan",
        "Sesame",
        "Soy Sauce",
        "Sugar Snap Pea",
        "Simmer",
        "Gourmet"
    ],
    "title": "Chilled Soba with Tofu and Sugar Snap Peas",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-soba-with-tofu-and-sugar-snap-peas-242834"
}
