{
    "directions": [
        "Adjust oven rack to middle position; heat oven to 450 degrees. Set a large, heavy-duty roasting pan over 2 burners on medium heat.",
        "Pour 2 Tbs. oil into a medium bowl. Add half the meat; coat. Generously sprinkle with salt, pepper, and 1 Tb. cumin. Repeat entire process with rest of meat.",
        "Increase heat under roasting pan to medium-high. Add half the meat; cook until a solid brown crust forms on one side, 4 to 5 minutes. Turn over; cook until a crust again forms, 4 to 5 minutes. Transfer meat to a soup pot. Brown remaining meat; add to soup pot. Set roasting pan aside. Add 2 1/2 cups water to the soup pot and cover with heavy-duty foil, pressing down so foil is concave and touches the meat. Seal foil around the top of the pot so it is airtight; place lid on pot. Heat until you hear pan juices bubble. Set pot in oven. Cook, without checking, 90 minutes (meat should be very tender). Carefully remove from oven and let cool. Shred pork and beef into bite-size pieces, discarding pork bones. Measure meat juices, then add enough water to equal 12 cups.",
        "Meanwhile, in a medium skillet over low heat, slow-toast chili powder, oregano and remaining 4 teaspoons cumin, stirring constantly, until spices are fragrant and darker in color; be careful not to burn. Set roasting pan over two burners on medium-high heat; add remaining 1/4 cup oil. Add onions; saute until soft, 7 to 8 minutes. Add spices, tomatoes, meat and juices. Simmer until flavors are unified, 1 to 1 1/2 hours. Add garlic, chocolate and optional beans; simmer 5 minutes. Serve."
    ],
    "ingredients": [
        "2 (2 pound) flat, boneless beef chuck roasts, patted dry",
        "8 country-style pork ribs, patted dry",
        "1/2 cup vegetable oil or other flavorless oil",
        "Salt and freshly ground black pepper",
        "2 tablespoons ground cumin",
        "1 cup mild chili powder",
        "4 teaspoons dried oregano",
        "4 teaspoons ground cumin",
        "4 large onions, diced",
        "2 (28 ounce) cans crushed tomatoes",
        "1 (16 ounce) can crushed tomatoes",
        "12 garlic cloves, minced",
        "2 ounces bittersweet chocolate, coarsely chopped",
        "4 (15.5 ounce) cans pinto or kidney beans, rinsed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chili With Pulled Beef & Pork for a Crowd",
    "url": "http://allrecipes.com/recipe/76929/chili-with-pulled-beef-pork-for-a-c/"
}
