{
    "directions": [
        "In a food processor purée the tomatoes and force the purée through a fine sieve into a saucepan, pressing hard on the solids. In a small bowl stir together the cornstarch and the broth and stir the mixture into the tomato purée. Bring the mixture to a boil, stirring, remove the pan from the heat, and stir in the lemon juice, the sugar, the whole basil leaves, and salt and pepper to taste. Let the soup cool and chill it, covered, for at least 8 hours. The soup may be made 2 days in advance and kept covered and chilled.",
        "Discard the whole basil leaves, ladle the soup into 6 bowls, and garnish each serving with a dollop of the sour cream and some of the chopped basil. Drizzle the soup with the oil and serve it with the toasts.",
        "In a small skillet cook the garlic in the oil over moderate heat, stirring, until it begins to turn golden, brush the bread wedges with the oil, and on a baking sheet bake them in the middle of a preheated 375°F. oven for 10 minutes, or until they are golden. Sprinkle the toasts with the salt and break them in half. Makes 12 toasts."
    ],
    "ingredients": [
        "2 1/2 pounds (about 6) tomatoes, cored and cut into chunks",
        "1 tablespoon cornstarch",
        "1/2 cup beef broth",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon sugar",
        "10 whole fresh basil leaves plus 1/3 cup chopped fresh basil leaves for garnish",
        "sour cream for garnish",
        "extra-virgin olive oil for drizzling the soup",
        "as an accompaniment",
        "1 large garlic clove, minced or forced through a garlic press",
        "1/4 cup olive oil",
        "a French baguette, cut lengthwise into 6 long wedges",
        "coarse salt to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Tomato",
        "Bake",
        "Lunch",
        "Basil",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Chilled Tomato Basil Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-tomato-basil-soup-12304"
}
