{
    "directions": [
        "Remove the chorizo from its casing by splitting 1 end and squeezing out the meat. In a large heavy-bottomed high-sided saute pan, fry the chorizo in the oil until it is grainy but still soft, about 4 minutes, stirring frequently with a wooden spoon to break up the meat and prevent a crust from forming on the bottom of the pan. Set aside and keep hot.",
        "In a large stockpot over medium-high heat, stir the salsa with a wooden spoon until hot and sputtering. Add half the tortilla chips and stir to coat with the salsa, then cook until beginning to soften, about 3 minutes. Add the rest of the tortilla chips, stir to coat with the salsa, and cook until beginning to soften, about 3 to 5 additional minutes. There should be a nice mix of very soft and still slightly crunchy chips when the chiliqueles are finished. Remove from the heat and use a slotted spoon or tongs to heap generous portions into each of 4 bowls. While still piping hot, top with the grated Cheddar and Montery Jack cheeses, chorizo, a dollop of sour cream, and a sprinkling of red onion and cilantro. Serve hot with Guacamole on the side.",
        "In a medium stock pot, place the tomatoes, onion, jalapeno, and garlic and cover with 2 quarts water. Bring to a boil over high heat and let cook 5 to 8 minutes, until the vegetables are very soft. Transfer with a slotted spoon to a blender and puree until smooth with the cilantro and salt. If the salsa is too thick (it should have the consistency of a very thick soup), add a little of the cooking liquid. Check seasoning and add additional salt, if necessary, and pepper, to taste.",
        "In a large high-sided saute pan over medium heat, bring the oil to 350 degrees F. Fry the chips in small batches until crisp and lightly golden, about 2 to 3 minutes. (They will continue to darken while resting.) With tongs or a metal frying ladle, transfer the chips to a large bowl lined with paper towels. Season with the salt and paprika while still warm. Repeat with the remaining chips."
    ],
    "ingredients": [
        "6 ounces Mexican-style pork chorizo (recommended: Reynaldo's)",
        "1 tablespoon vegetable oil",
        "3 cups Stovetop Salsa, recipe follows",
        "Tortilla Chips, recipe follows",
        "4 ounces Cheddar, grated",
        "4 ounces Monterey Jack, grated",
        "1/2 cup sour cream",
        "1 small red onion, finely diced",
        "1/4 cup chopped fresh cilantro leaves",
        "6 Roma tomatoes",
        "1 large yellow onion, root removed, peeled, and halved",
        "1 jalapeno, stemmed",
        "2 cloves garlic, peeled",
        "1 teaspoon salt",
        "1 cup loosely packed fresh cilantro leaves and stems",
        "1 teaspoon salt",
        "Freshly ground black pepper",
        "3 cups canola oil",
        "36 corn tortillas, cut into 8 wedges",
        "Salt",
        "Sweet paprika"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Brunch Recipes",
        "Brunch",
        "Easy Lunch Recipes",
        "Lunch",
        "Skillet Recipes",
        "Chorizo",
        "Sausage Recipes",
        "Cheddar",
        "Cheese",
        "Jalapeno Recipes",
        "Vegetable",
        "Tomato",
        "Recipes for Parties",
        "Super Bowl"
    ],
    "title": "Chilaquiles with Chorizo",
    "url": "http://www.foodnetwork.com/recipes/chiliqueles-with-chorizo-recipe"
}
