{
    "directions": [
        "First cut out in thin cardboard: a side wall, 4 1/2 x 8 inches; an end wall, 4 1/2x5 inches;  a triangular gable, 4 1/2x3x3 inches; and a roof rectangle, 4 1/2x9 inches.  Tape the rectangular end wall piece to the triangular gable piece: match the long side of the triangle, 4 1/2 inches, to one of the 4 1/2 inch sides of the end wall.",
        "In a large bowl, cream butter and sugar until light and fluffy.  Stir in lemon zest, lemon juice, and molasses.  Gradually beat in 2 eggs.  Sift the flour, baking powder, and spices together; stir into creamed mixture.  Wrap dough in parchment paper, and refrigerate for 1 hour.",
        "Turn out dough onto a lightly floured surface. Divide into 6 portions, 2 slightly larger than the others.  On a lightly floured surface, roll out the 4 smaller pieces to approximately the size of the side wall and the end wall with gable templates; cut out two of each.  Roll out remaining dough, and cut into two rectangular roof pieces. Transfer gingerbread onto greased baking trays.",
        "In a preheated 375 degree F (190 degrees C) oven, bake gingerbread for 10 minutes, or until crisp. When removing from the oven, leave the gingerbread on the baking trays for a few minutes to set, then transfer to wire racks.  Leave out overnight to harden.",
        "In a large bowl, lightly whisk 2 egg whites. Gradually beat in approximately 5 cups confectioners' sugar. The icing should be smooth and stand in firm peaks. Spread or pipe a 9 inch line of icing onto a cake board, and press in one of the side walls so that it sticks firmly and stands upright.  If necessary, spread  or pipe a little extra icing along either side to help support it.  Take an end wall and ice both the side edges.  Spread or pipe a line of icing on the board at a right angle to the first wall, and press the end wall into position.  Repeat this process with the other two walls until they are all in position.  Leave the walls to harden together for at least two hours before putting on the roof.  Spread or pipe a thick layer of icing on top of all the walls, and fix the roof pieces in position; the roof should overlap the walls to make the eaves.  Pipe or spread a little icing along the crest of the roof to hold the two pieces firmly together.  Leave overnight to set firmly.",
        "When ready to decorate, make the remaining icing.  In a large bowl, lightly whisk 4 egg whites, and mix in remaining confectioners' sugar as before.   Use this to make snow on the roof, and to stick various candies for decoration. Finish with a fine dusting of sifted confectioners' sugar."
    ],
    "ingredients": [
        "3/4 cup butter",
        "7/8 cup packed light brown sugar",
        "1 teaspoon lemon zest",
        "1 1/2 tablespoons lemon juice",
        "1/2 cup molasses",
        "2 eggs",
        "3 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 tablespoon ground ginger",
        "2 teaspoons ground allspice",
        "6 egg whites",
        "4 (16 ounce) packages confectioners' sugar, sifted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Children's Gingerbread House",
    "url": "http://allrecipes.com/recipe/9446/childrens-gingerbread-house/"
}
