{
    "directions": [
        "Bring orange juice, chipotles, and vinegar to a boil in a 1- to 1 1/2-quart heavy saucepan, then reduce heat and simmer, stirring occasionally, until reduced to a generous 1/3 cup, 15 to 20 minutes. Remove from heat and cool.",
        "While sauce cools, prepare charcoal or gas grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "While grill heats, stir together coriander, cumin, chili powder, black pepper, and kosher salt in a shallow bowl. Brush tuna on all sides with 1 tablespoon oil (total), then coat all sides evenly with spice mixture.",
        "Grill tuna on lightly oiled rack, uncovered, turning to brown all sides, until browned on outside but still rare in center, 8 to 10 minutes total. Let tuna stand 10 minutes.",
        "While tuna stands, heat tortillas on grill, turning over once, until warm, about 1 minute, and keep warm, wrapped in foil.",
        "Toss jicama with cilantro, lime juice, remaining tablespoon oil, and salt and pepper to taste in a small bowl. Halve, pit, and peel avocado, then cut into 1/2-inch-thick slices.",
        "Put a tortilla on each of 4 plates. Divide arugula, jicama, and avocado among tortillas, arranging evenly down center of each. Slice tuna 1/4 inch thick and divide among tacos. Drizzle chipotle sauce evenly over tuna and roll up tacos to enclose filling."
    ],
    "ingredients": [
        "1 cup fresh orange juice",
        "1 tablespoon minced canned chipotles in adobo (including sauce)",
        "1 tablespoon distilled white vinegar",
        "1 1/2 teaspoons ground coriander",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons chili powder",
        "1 1/2 teaspoons cracked black pepper",
        "1 1/2 teaspoons kosher salt",
        "3/4 lb (1 1/2-inch-thick) sushi-grade tuna steak",
        "2 tablespoons olive oil",
        "4 (9- to 10-inch) flour tortillas",
        "1 cup matchstick (1/8-inch-thick) pieces of jicama (from 1 small jicama, peeled)",
        "1/4 cup coarsely chopped fresh cilantro",
        "2 tablespoons fresh lime juice",
        "1 firm-ripe California avocado",
        "1 cup loosely packed arugula, coarse stems discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pepper",
        "Vinegar",
        "Tuna",
        "Summer",
        "Grill/Barbecue",
        "Cilantro",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Chile-Crusted Tuna Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/chile-crusted-tuna-tacos-108386"
}
