{
    "directions": [
        "For the tomatillo salsa: Preheat the oven to 400 degrees F.",
        "Toss the tomatillos, garlic, jalapenos and onion with the oil in a medium bowl and season with salt and pepper. Spread on a baking sheet in an even layer and roast, turning a few times, until soft and lightly golden brown, about 25 minutes.",
        "Put the roasted vegetables in a blender, add the lime juice and process until smooth. Add the cilantro and pulse a few times until just incorporated.",
        "For the burgers: Shape the beef into four 1-inch-thick burgers. Use your thumb to press a good divot in the center of each. Season the burgers generously on both sides with salt and pepper. Add 2 teaspoons of the oil to a large cast-iron skillet and heat until smoking. Cook the burgers until golden brown on both sides and cooked to medium doneness, about 4 minutes per side. Just before the second side is done, top each burger with 2 slices of Monterey jack, add a splash of water to the skillet, cover immediately and cook 20 seconds to completely melt the cheese. Set aside.",
        "Heat remaining 2 tablespoons of the oil in a large nonstick skillet over medium-high heat until it begins to sizzle. Crack the eggs into 4 small bowls or ramekins. Slip the eggs into the skillet, season with salt and pepper and cook until the whites are firm and completely cooked but the yolks are still soft and just set up, about 2 minutes.",
        "Put the burgers on the bottom buns. Top with a few spoonsful of the tomatillo salsa, an egg, a bit more salsa, some crumbled chips, some Cotija, a few jalapeno slices and the bun tops."
    ],
    "ingredients": [
        "8 tomatillos, husks removed, rinsed and dried",
        "3 cloves garlic, chopped",
        "2 jalapeno or serrano chiles, chopped",
        "1 small red or white onion, chopped",
        "2 tablespoons canola oil",
        "Kosher salt and freshly ground black pepper",
        "Juice of 2 limes",
        "1/4 cup chopped fresh cilantro",
        "1 1/2 pounds 80/20 ground chuck",
        "Kosher salt and freshly ground black pepper",
        "2 teaspoons plus 2 tablespoons canola oil",
        "8 slices Monterey jack cheese",
        "4 large eggs",
        "2 tablespoons canola oil",
        "4 sesame seed burger buns, lightly toasted",
        "1 1/2 cups tortilla chips, crumbled",
        "1/2 cup Cotija cheese",
        "1/4 cup sliced pickled jalapenos"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Burger",
        "Salsa",
        "Tomatillos",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Chilaquiles Burgers",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/chilaquiles-burgers"
}
