{
    "directions": [
        "Toast all ingredients in heavy medium skillet over medium heat until spices darken slightly in color and start to pop, stirring occasionally, about 7 minutes. Cool in skillet. Transfer to spice mill and grind finely.",
        "Heat oil in heavy large pot over medium-high heat. Add celery, onion, and carrots. Sauté until vegetables soften slightly, about 8 minutes. Add ginger and garlic and sauté 3 minutes. Add bell peppers and fennel. Stir 2 minutes to coat. Add tomatoes; cook until tomatoes soften and break down, stirring often, about 8 minutes. Add broth and bring soup to boil. Reduce heat to medium; simmer until all vegetables are tender, about 25 minutes. Add ground spice mix; return soup to boil. Remove from heat; cover and steep 20 minutes.",
        "Place coarse sieve over large bowl. Working with 2 cups at a time, strain soup into bowl, pressing liquid and most of solids through sieve. Season soup to taste with hot pepper sauce, salt, and pepper. Refrigerate soup until cold, at least 3 hours. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Ladle soup into 8 shallow bowls. Divide crabmeat among bowls. Garnish with radish slices and chives."
    ],
    "ingredients": [
        "1 tablespoon cumin seeds",
        "1 tablespoon coriander seeds",
        "1 tablespoon fennel seeds",
        "1 teaspoon yellow mustard seeds",
        "1 teaspoon black peppercorns",
        "6 tablespoons extra-virgin olive oil",
        "2 cups chopped celery",
        "1 1/2 cups chopped onion",
        "1 cup chopped carrots",
        "1/4 cup chopped peeled fresh ginger (from about 3-inch-long piece)",
        "6 garlic cloves, chopped",
        "1 pound red bell peppers, chopped",
        "1 3/4 cups chopped fresh fennel bulb",
        "3 pounds plum tomatoes, diced (about 8 cups)",
        "5 1/4 cups vegetable broth",
        "2 teaspoons (about) hot pepper sauce",
        "1 pound fresh crabmeat, picked over",
        "Thinly sliced radishes",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Ginger",
        "Onion",
        "Tomato",
        "Sauté",
        "Crab",
        "Celery",
        "Fennel",
        "Bell Pepper",
        "Carrot",
        "Chill",
        "Seed"
    ],
    "title": "Chilled Indian-Spiced Tomato Soup with Crabmeat",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-indian-spiced-tomato-soup-with-crabmeat-108549"
}
