{
    "directions": [
        "Bring beets and water to a boil in an 8-quart pot, covered, then reduce heat slightly and cook at a low boil until tender, 30 to 40 minutes. Transfer beets with a slotted spoon to a bowl, reserving liquid in pot. Add carrots, cabbage, celery root, bay leaf, dill sprigs, salt, and pepper to liquid in pot and briskly simmer, partially covered, over moderate heat until vegetables are tender, about 30 minutes. Add vinegar and sugar, stirring until sugar is dissolved, then pour soup through a sieve lined with a dampened paper towel or cheesecloth into a large bowl, discarding solids (you will have about 7 cups broth; if you have less, add enough water to bring total to 7 cups).",
        "While vegetables cook, peel beets and coarsely grate using large holes of a box grater.",
        "Slowly whisk 1 cup broth into sour cream in a bowl until blended, then add to soup along with grated beets, chives, and chopped dill. Cool soup completely, uncovered, then chill, covered, until cold, at least 2 hours. Season with salt and pepper before serving."
    ],
    "ingredients": [
        "1 3/4 lb beets without greens (5 or 6 medium; 2 3/4 lb including greens), scrubbed well",
        "12 cups water",
        "3 medium carrots, coarsely chopped",
        "1/2 medium green cabbage, cored and coarsely chopped (2 cups)",
        "1/2 celery root (sometimes called celeriac), peeled and coarsely chopped (1 1/2 cups)",
        "1 Turkish or 1/2 California bay leaf",
        "4 large sprigs fresh dill plus 1/4 cup chopped",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/2 cup cider vinegar, or to taste",
        "1/3 cup sugar, or to taste",
        "1 cup sour cream",
        "1/4 cup chopped fresh chives",
        "Accompaniment: sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Dairy",
        "Herb",
        "Vegetable",
        "Appetizer",
        "Lunch",
        "Beet",
        "Chill",
        "Healthy",
        "Sour Cream",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chilled Beet Soup with Sour Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-beet-soup-with-sour-cream-236363"
}
