{
    "directions": [
        "Bring 2 1/2 cups water, ginger, sugar, and chiles to a boil in a 2-quart saucepan, stirring until sugar is dissolved. Reduce heat and briskly simmer for 10 minutes. Stir in mint, then remove pan from heat. Cover pan with a lid and let stand for 15 minutes. Strain ginger-mint tea through a fine-mesh sieve into a large liquid measuring cup or bowl.",
        "Sprinkle gelatin over remaining 1/2 cup water in cleaned saucepan and let stand for 1 minute to soften. Heat mixture over medium heat, stirring, until gelatin is dissolved, then stir mixture into ginger-mint tea until combined well.",
        "Measure liquid, and if it's less than 2 1/2 cups, add more water. If it's more, don't worry. Let mixture cool for 30 minutes, then divide among six (6- to 8-ounce) serving glasses. Chill jellies in a small baking pan, tops of glasses covered with a sheet of paper towel secured by plastic wrap, until set, at least 4 hours.",
        "Beat cream with sugar in a bowl with an electric mixer until it just holds soft peaks. Top jellies with cream, candied ginger, and mint sprigs."
    ],
    "ingredients": [
        "3 cups water",
        "1 cup thinly sliced fresh ginger (about 4 ounces; no need to peel)",
        "1/2 cup sugar",
        "1 to 2 tablespoons chopped serrano or jalapeño chiles, including seeds (see Cooks' notes)",
        "1 cup fresh mint leaves",
        "2 1/4 teaspoons unflavored gelatin (almost one 1/4-ounce packet)",
        "1 cup chilled heavy cream",
        "2 tablespoons confectioners' sugar",
        "Thinly sliced candied ginger",
        "Mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ginger",
        "Dessert",
        "Mint",
        "Hot Pepper",
        "Summer",
        "Chile Pepper",
        "Gourmet",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chile-Ginger-Mint Jellies",
    "url": "http://www.epicurious.com/recipes/food/views/chile-ginger-mint-jellies-51137430"
}
