{
    "directions": [
        "Melt the butter in a large skillet over medium heat; cook the onion, garlic, oregano, cumin, salt, and pepper in the melted butter until the onion is golden brown, 5 to 7 minutes. Add the ground pork and cook until completely browned, 7 to 10 minutes more; drain the fat from the skillet. Stir the eggs, raisins, and olives into the mixture. Whisk the water and cornstarch together in a small bowl; pour into the skillet and stir until the liquid thickens. Remove from heat and set aside.",
        "Whisk the milk and melted shortening together in a bowl until evenly blended. Stir the flour and salt together in a separate large bowl. Pour the wet mixture into the dry and whisk until well mixed into a dough. Set aside to rest for 10 minutes.",
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Place the dough onto a lightly-floured board and roll to about 1/8-inch thick; cut into circles with a round cookie cutter or glass. Drop equal portions of the pork mixture into the center of each circle. Fold each circle in half and press edges with a fork to seal. Brush the tops of the empanadas with beaten egg.",
        "Bake in the preheated oven until golden brown, about 25 minutes."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 large onion, chopped",
        "1 teaspoon minced garlic",
        "1 teaspoon dried oregano",
        "1 teaspoon cumin",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 pound ground pork",
        "3 hard-cooked eggs, chopped",
        "1 cup raisins",
        "1 cup chopped black olives",
        "1 cup water",
        "1 teaspoon cornstarch",
        "1 cup lukewarm milk",
        "1 cup shortening, melted",
        "5 cups all-purpose flour",
        "2 teaspoons salt",
        "2 eggs, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chilean Empanada",
    "url": "http://allrecipes.com/recipe/185584/chilean-empanada/"
}
