{
    "directions": [
        "Preheat broiler.",
        "Carefully cut a lengthwise slit in each chile and stuff with some Cheddar. Combine flour, salt, and pepper and dredge chiles.",
        "In a large saucepan, heat 1/2 inch shortening to 375°F. on a deep-fat thermometer. Fold yolks into egg whites. Working with 2 chiles at a time, using a slotted spoon, dip chiles into eggs and fry, turning occasionally, until golden, no more than a couple of minutes. With a slotted spoon transfer chiles (careful — they are delicate!) to paper towels to drain.",
        "Arrange chiles on a flameproof plate and sprinkle with sharp Cheddar. Broil chiles just long enough to melt cheese and serve immediately, accompanied by salsa if desired.",
        ":",
        "Using a long-handled fork, char peppers over an open flame or on a rack set over an electric burner, turning, until skins are blackened, 4 to 6 minutes. (Alternatively, broil peppers on rack of a broiler pan under a preheat broiler about 2 inches from heat,turning every 5 minutes, 15 to 20 minutes, or until skins are blistered and charred.) Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Keeping peppers whole, peel them, starting at blossom end. Cut off tops and discard seeds and ribs."
    ],
    "ingredients": [
        "eight to ten 7-inch green chiles (Anaheims, poblanos, or Big Jims)*, roasted and peeled, seeds intact, stems attached (procedure follows)",
        "3/4 pound grated mild Cheddar (about 3 cups)",
        "1/2 cup all-purpose flour",
        "2 1/2 teaspoons salt",
        "1/2 teaspoon freshly ground black pepper",
        "vegetable shortening for frying",
        "4 large egg yolks, beaten",
        "4 large egg whites, beaten until foamy",
        "1/4 pound grated sharp Cheddar (about 1 cup)",
        "Accompaniment: prepared salsa (optional)",
        "*available at Hispanic markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pepper",
        "Appetizer",
        "Broil",
        "Fry",
        "Vegetarian",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Chiles Rellenos",
    "url": "http://www.epicurious.com/recipes/food/views/chiles-rellenos-13120"
}
