{
    "directions": [
        "Cook tomatillos in large pot of boiling salted water until olive-green color, about 5 minutes. Drain and transfer to blender. Add onion, jalapeño, and garlic and process tomatillo sauce until smooth.",
        "Heat 1 tablespoon oil in skillet over medium heat. Add sauce and bring to boil. Reduce heat and simmer until slightly thickened, stirring occasionally, about 5 minutes. Stir in cilantro. Season with salt and pepper. Cool to room temperature. (Can be made 1 day ahead. Chill. Bring to room temperature before using.)",
        "Prepare barbecue (medium-high heat). Toss shrimp with remaining 2 tablespoons oil in large bowl. Add ground chili, onion powder, and garlic powder; toss to combine. Sprinkle shrimp with salt and pepper. Grill shrimp until just cooked through, about 2 minutes per side.",
        "Spoon about 3 tablespoons tomatillo sauce into center of each of 6 plates. Arrange shrimp atop sauce. Sprinkle with queso fresco.",
        "Tomatillos (green tomato-like vegetables with paper-thin husks), ground New Mexican chilies, and queso fresco (also known as queso blanco) are available at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "1 pound tomatillos,* husked",
        "1 onion, coarsely chopped",
        "1 tablespoon minced seeded jalapeño chili",
        "1 garlic clove, crushed",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons chopped cilantro",
        "24 jumbo shrimp, peeled, deveined, tails left intact",
        "2 tablespoons ground mild chili (such as ancho or New Mexican*)",
        "1 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "Queso fresco* or feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Shellfish",
        "Tomato",
        "Low Carb",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Chili-Glazed Shrimp with Tomatillo-Cilantro Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chili-glazed-shrimp-with-tomatillo-cilantro-sauce-106836"
}
