{
    "directions": [
        "Prepare barbecue (medium heat). Grill eggplant until skin is charred and flesh is soft, about 6 minutes per side. Grill bell pepper until brown in spots, turning frequently, about 10 minutes. Transfer eggplant and pepper to bowl. Cover with foil and let stand 30 minutes. Peel, seed and dice red bell pepper. Set aside.",
        "Scoop eggplant from skin and transfer flesh to blender; discard skin. Stir cumin in heavy small skillet over low heat until lightly toasted, about 2 minutes. Add cumin to blender; then add yogurt, milk, olive oil, 1 tablespoon mint and garlic. Blend until very smooth. Season to taste with salt and pepper. Transfer soup to large bowl. Mix in 1 1/2 cups broth. Cover and refrigerate until chilled, about 1 hour. (Bell pepper and soup can be prepared 1 day ahead. Cover separately and refrigerate. Before serving, thin soup with more vegetable broth, if desired.)",
        "Mix bell pepper, remaining 1 tablespoon mint and olives in small bowl. Ladle eggplant soup into bowls. Sprinkle with bell pepper mixture; serve."
    ],
    "ingredients": [
        "1 large eggplant (about 1 1/4 pounds), cut lengthwise in half",
        "1 large red bell pepper",
        "2 teaspoons ground cumin",
        "2 cups plain low-fat yogurt",
        "1 cup low-fat (1%) milk",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons chopped fresh mint",
        "3 garlic cloves, peeled",
        "1 1/2 cups (or more) canned vegetable broth",
        "6 Kalamata olives or other brine-cured black olives, pitted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Olive",
        "Pepper",
        "Vegetable",
        "Appetizer",
        "Vegetarian",
        "Yogurt",
        "Lunch",
        "Mint",
        "Eggplant",
        "Bell Pepper",
        "Fall",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chilled Eggplant Soup with Red Bell Pepper and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-eggplant-soup-with-red-bell-pepper-and-olives-103758"
}
