{
    "directions": [
        "In a blender or food processor, combine the tomatoes, onion, and garlic and blend until smooth. For a smooth sauce, push through a fine-mesh strainer if needed.",
        "In a large skillet, over moderate heat, melt the butter. Add the tomato caldillo mixture and fry, stirring occasionally, until it changes color and reduces slightly.",
        "Just before serving, gently warm the crema Mexicana in a saucepan, then whisk in the tomato caldillo mixture, bring to a simmer, and season to taste with salt.",
        "In a medium saucepan, bring 1 quart of water to a boil, along with the piloncillo, thyme, oregano, and bay leaf.",
        "Heat a comal or cast-iron skillet over low heat and dry-roast the chiles until just tender. Transfer to the boiling water, then turn off the heat and let the chiles soak for 3 to 4 minutes. Remove the chiles from the water and using a small, sharp knife, make a lengthwise slit down one side of each. Carefully remove the seeds and, if possible, the skin. (The stem of the chile should remain attached, so if the skin is difficult to peel, leave it on.) Season the insides of the chiles with salt, then stuff with the cheese, dividing it equally.",
        "In a large sauté pan, over moderately low heat, melt the butter. Add the chiles and cook, flipping gently, to melt the cheese.",
        "Spoon the caldillo con crema onto a platter or individual plates, top with the chiles, and serve immediately."
    ],
    "ingredients": [
        "1 pound Roma tomatoes, diced",
        "1 medium onion",
        "2 cloves garlic",
        "1 1/2 tablespoons unsalted butter",
        "1 cup crema Mexicana or sour cream",
        "Kosher salt to taste",
        "3 tablespoons grated piloncillo (Mexican brown sugar)",
        "1 sprig fresh thyme",
        "1 sprig fresh oregano, preferably Mexican",
        "1 bay leaf",
        "6 fresh ancho chiles",
        "Kosher salt",
        "1 pound Asadero or Jack cheese, grated or cut into cubes",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Sauté",
        "Dinner",
        "Lunch",
        "Chile Pepper",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chiles Anchos Rellenos de Queso (Cheese-Filled Ancho Chiles)",
    "url": "http://www.epicurious.com/recipes/food/views/chiles-anchos-rellenos-de-queso-cheese-filled-ancho-chiles-51110430"
}
