{
    "directions": [
        "Preheat oven to 400°F. In a medium bowl, whisk together 2 tablespoons oil, vinegar, soy sauce, 2 grated garlic cloves, ginger, chile paste, and 1/4 teaspoon salt. Place pork in a large resealable plastic bag and pour marinade over, tossing to coat. Marinate for 30 minutes at room temperature.",
        "In a small bowl, whisk together remaining 1 grated garlic clove, fish sauce, lime, honey, chile pepper, peanuts, and 1 tablespoon water. Set aside.",
        "On a rimmed baking sheet, toss Brussels sprouts with 1 1/2 tablespoons oil and 1/2 teaspoon salt. Roast 15 minutes, then toss. Continue to roast until browned and cooked through, 10 to 15 minutes more. Transfer to a large bowl and toss with 2 tablespoons of the vinaigrette. Taste and add more vinaigrette, if desired.",
        "Meanwhile, heat a large skillet with 2 tablespoons oil over medium-high heat. Remove pork from marinade (reserve marinade) and sear on 3 sides until lightly browned, about 3 minutes per side. Turn tenderloins onto their fourth side and add broth to pan. Transfer skillet to oven and roast pork, basting occasionally, until internal temperature reaches 140°F for medium rare or 145°F for medium, 10 to 13 minutes more (temperature will rise by about 10 degrees after cooking). Transfer pork to cutting board and let rest 5 minutes, and reserve skillet.",
        "Add reserved marinade to the skillet and reduce over medium heat, stirring and scraping up the browned bits, until thickened to a pan sauce that coats the back of a spoon, 3 to 5 minutes. Remove from heat and whisk in butter. Taste and adjust seasoning.",
        "To serve, slice pork and drizzle with pan sauce. Spoon Brussels sprouts onto plate, sprinkle with mint, and serve additional pan sauce on side.",
        "Do ahead: Chile marinade and fish sauce vinaigrette can be made one day in advance."
    ],
    "ingredients": [
        "5 1/2 tablespoons vegetable oil, such as grapeseed, divided",
        "2 tablespoons rice wine vinegar",
        "1 1/2 tablespoons soy sauce",
        "3 garlic cloves, finely grated, divided",
        "2 teaspoons finely grated ginger",
        "1 1/2 tablespoon hot chile paste, such as sambal oelek",
        "3/4 teaspoon kosher salt",
        "Two 1-pound pork tenderloins",
        "2 tablespoons fish sauce",
        "2 tablespoons lime juice",
        "1/2 teaspoon honey",
        "1/2 to 1 red Thai chile pepper, very thinly sliced",
        "1 1/2 tablespoons finely chopped roasted unsalted peanuts",
        "1 1/2 pounds Brussels sprouts, trimmed and halved",
        "3/4 cup low-sodium chicken broth or water",
        "1 tablespoon butter",
        "1 tablespoon roughly chopped mint",
        "Large oven-safe skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Dinner",
        "Mint",
        "Pork Tenderloin",
        "Peanut",
        "Brussel Sprout",
        "Soy Sauce",
        "Chile Pepper",
        "Tree Nut Free"
    ],
    "title": "Chile-Marinated Pork With Vietnamese Brussels Sprouts",
    "url": "http://www.epicurious.com/recipes/food/views/chile-marinated-pork-with-vietnamese-brussels-sprouts-51248500"
}
