{
    "directions": [
        "To make the pico de gallo, in a bowl, stir together the tomatoes, onion, cilantro, jalapeño and lime juice. Season with salt. Let stand at room temperature for at least 1 hour to allow the flavors to blend. The salsa will keep in an airtight container in the refrigerator for up to 3 days.",
        "About 1 hour before you are ready to begin grilling, remove the roast from the refrigerator. Season the roast on all sides with the chili powder, garlic salt and a generous amount of pepper.",
        "Prepare a charcoal or gas grill for smoking over medium heat; the temperature inside the grill should be 350° to 375°F. If using charcoal, bank the lit coals on either side of the grill bed, leaving a strip in the center without heat. Place a drip pan in the center strip and fill the pan with water. Add about 2 cups of the wood chips to the fire just before grilling. If using gas, fill the smoker box with up to 2 cups of the wood chips, then preheat the grill. Turn off 1 or more of the burners to create a cooler zone. Brush and oil the grill grate.",
        "Place the roast on the grill over the direct-heat area and sear, turning as needed, until browned but not charred on all sides, 15 to 20 minutes total. Move the roast to the indirect-heat area, cover the grill, and cook for about 45 minutes for medium-rare or 1 hour for medium, adding the remaining wood chips after about 30 minutes. Tri-tip roasts come in different shapes—some are squat, and some are more rounded—so cooking times will vary. Remove the roast when an instant-read thermometer inserted into the thickest part of the meat registers 130°F for medium-rare or 135°F for medium.",
        "Transfer the roast to a cutting board, cover loosely with aluminum foil and let rest for 15 minutes. Slice very thinly against the grain, capturing any released juices, and arrange on a platter. Pour any accumulated juices over the top and serve immediately with the pico de gallo. Serves 6 to 8 with leftovers.",
        "Adapted from Williams-Sonoma",
        "Grill Master",
        ", by Fred Thompson (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "3 large ripe tomatoes, chopped",
        "1/2 cup diced red onion",
        "1/2 cup minced fresh cilantro",
        "1 jalapeño chili, seeded and diced",
        "Juice of 3 limes",
        "Kosher salt, to taste",
        "1 tri-tip roast, about 3 lb.",
        "1 Tbs. chili powder",
        "1 tsp. garlic salt",
        "Freshly ground pepper, to taste",
        "About 4 cups wood chips, soaked in water, beer or apple cider for 30 minutes"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chili-Rubbed Smoked Tri-Tip",
    "url": "http://www.williams-sonoma.com/recipe/chili-rubbed-smoked-tri-tip.html"
}
