{
    "directions": [
        "1. Rinse the shrimp under cold running water, then blot them dry with paper towels.",
        "2. Place the chile powder, garlic salt, coriander, oregano, cumin, and pepper in a mixing bowl and whisk to mix. Add the shrimp and toss to coat. Stir in the olive oil. Let the shrimp marinate in the refrigerator, covered, for 30 minutes to 1 hour.",
        "3. Cook the shrimp, following the instructions below for any of the grills, until just cooked through. When done the shrimp will turn pinkish white and will feel firm to the touch.",
        "4. Spoon the Avocado and Corn Salsa into 4 large martini glasses or serving bowls. Drape 4 of the hot shrimp over the edge of each glass or bowl and serve at once. Or for a cold shrimp cocktail, let the cooked shrimp cool to room temperature. Refrigerate the shrimp, covered, until they are chilled before serving them with the salsa. The cooked shrimp can be refrigerated for up to 2 days.",
        "Preheat the grill; if your contact grill has a temperature control, preheat the grill to high. Place the drip pan under the front of the grill. When ready to cook, lightly oil the grill surface. Place the marinated shrimp on the hot grill, then close the lid. The shrimp will be done after cooking 1 to 3 minutes.",
        "Place the grill pan on the stove and preheat it to high over medium heat. When the grill pan is hot a drop of water will skitter in the pan. When ready to cook, lightly oil the ridges of the grill pan. Place the marinated shrimp in the hot grill pan. They will be done after cooking 1 to 3 minutes per side.",
        "Preheat the grill to high, then, if it does not have a nonstick surface, brush and oil the grill grate. Place the marinated shrimp on the hot grate. They will be done after cooking 1 to 3 minutes per side.",
        "Preheat the grill to high; there's no need to oil the grate. Place the marinated shrimp on the hot grill. They will be done after cooking 2 to 4 minutes per side.",
        "Rake red hot embers under the gridiron and preheat it for 3 to 5 minutes; you want a hot, 2 to 3 Mississippi fire. When ready to cook, brush and oil the gridiron. Place the marinated shrimp on the hot grate. They will be done after cooking 1 to 3 minutes per side."
    ],
    "ingredients": [
        "16 jumbo shrimp (about 1 1/2 pounds), peeled and deveined",
        "1 tablespoon ancho chile powder",
        "1 1/2 teaspoons garlic salt",
        "1 teaspoon ground coriander",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "Avocado and Corn Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Marinate",
        "Backyard BBQ",
        "Shrimp",
        "Spice",
        "Avocado",
        "Corn",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chile-Rubbed Shrimp with Avocado Corn Cocktail",
    "url": "http://www.epicurious.com/recipes/food/views/chile-rubbed-shrimp-with-avocado-corn-cocktail-231540"
}
