{
    "directions": [
        "Preheat oven to 400°F. Place the ancho chiles and boiling water in a bowl and allow to stand for 10–15 minutes or until soft. Drain and roughly chop the chiles, reserving the liquid. Set aside.",
        "Place the breadcrumbs and milk in a large bowl and mix well to combine. Set aside for 5 minutes or until the milk is absorbed. Add the beef, egg, garlic, cilantro, coriander seeds, salt and pepper and mix well to combine. Using wet hands, roll tablespoon-portions of the mixture into balls.",
        "Heat 1 tablespoon of the oil in a large, shallow, heavy-based ovenproof saucepan over medium heat. Cook the meatballs in batches, turning frequently, for 5–7 minutes or until browned. Remove the meatballs from the pan and set aside. Add 1 tablespoon of the oil, onion and extra garlic to the pan and cook for 5–7 minutes or until lightly golden. Add the tomato paste, sugar and vinegar and cook for 1 minute. Add the beef stock, tomatoes, beans, reserved chopped chile, reserved soaking liquid, paprika, salt and pepper. Bring to a boil, return the meatballs to the pan and transfer to the oven. Bake for 15–20 minutes or until the sauce is reduced and the meatballs are cooked through.",
        "Place the chorizo in a food processor and process until finely chopped. Heat the remaining oil in a medium non-stick frying pan over high heat. Add the chorizo and cook, stirring frequently, for 5–6 minutes or until golden and crispy. Serve the meatballs with steamed rice and top with the crispy chorizo and sour cream."
    ],
    "ingredients": [
        "1 ounce dried ancho or other large dried red chiles",
        "1/2 cup boiling water",
        "1 cup fresh white breadcrumbs",
        "1/3 cup milk",
        "1 pound ground beef",
        "1 egg",
        "2 cloves garlic, crushed",
        "1/2 cup cilantro leaves, finely chopped",
        "2 teaspoons ground coriander seeds",
        "Sea salt and cracked black pepper",
        "1/4 cup extra-virgin olive oil",
        "1 yellow onion, finely chopped",
        "2 cloves garlic, crushed",
        "2 tablespoons tomato paste",
        "1 tablespoon brown sugar",
        "1 tablespoon malt vinegar",
        "1/2 cup beef stock",
        "2 (14-ounce) cans chopped tomatoes",
        "2 (14-ounce) cans black beans, drained and rinsed",
        "1 tablespoon smoked paprika",
        "2 (3 1/2-ounce) dried chorizos, skin removed and roughly chopped",
        "Steamed rice and sour cream, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Kid-Friendly",
        "Dinner",
        "Ground Beef",
        "Sausage"
    ],
    "title": "Chili Meatballs in Black Bean and Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chili-meatballs-in-black-bean-and-tomato-sauce-56390071"
}
