{
    "directions": [
        "Heat oil in heavy large saucepan over medium heat. Add onions and sauté until soft, stirring often, about 10 minutes. Add leek and sauté 5 minutes. Add vegetable broth and bring to boil. Reduce heat to low, cover, and simmer 10 minutes. Allow broth to cool uncovered 15 minutes.",
        "Place 3 cups watercress in blender. Pour half of warm broth mixture over watercress and blend until smooth.",
        "Add half and half and blend until combined. Transfer soup to bowl. Puree remaining broth mixture in blender until smooth; stir into soup in bowl. If more watercress flavor is desired, puree 1/2 cup watercress with 2 cups soup in same blender. Repeat with more watercress, if desired. Season soup to taste with salt and pepper. Cover and chill until cold, at least 4 hours. (Can be made 1 day ahead. Keep refrigerated.)",
        "Whisk crème fraîche, white and pale green parts of green onions, and all remaining ingredients in small bowl. (Can be made 1 day ahead. Cover and chill.)",
        "Divide soup among 6 shallow bowls. Drizzle with green onion cream; sprinkle with sliced dark green onion tops."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 medium onions, thinly sliced",
        "1 large leek (white and pale green parts only), thinly sliced",
        "4 cups vegetable broth",
        "1 large bunch or 2 medium bunches watercress, thick stems removed (about 4 cups)",
        "1 cup half and half",
        "1/4 cup crème fraîche",
        "2 green onions, thinly sliced, dark green part reserved for garnish",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons grated lemon peel",
        "1/4 teaspoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Leafy Green",
        "Onion",
        "Vegetable",
        "Appetizer",
        "Sauté",
        "Vegetarian",
        "Low Cal",
        "Spring",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chilled Watercress Soup with Onion Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-watercress-soup-with-onion-cream-234411"
}
