{
    "directions": [
        "1. Prepare the Moho Sauce: Mix the garlic and onion in a small bowl with the cumin, salt, and pepper. Place the oil in a small, heavy saucepan over low heat. Add the onion mixture and cook, stirring, for 10 minutes or until translucent. Add the lime juice and vinegar, then simmer over medium-low heat for 5 minutes. (Makes 2/3 cup.)",
        "2. Halve the sea bass fillets crosswise (into 8-ounce pieces).",
        "3. In a shallow bowl, whisk the lime juice with 3 tablespoons of the olive oil, salt, pepper, and garlic. Add the fish and coat well. Marinate for 15 minutes. Remove and pat dry.",
        "4. Preheat the oven to 450°F.",
        "5. With a very sharp knife, score the skin side of the fish twice diagonally to prevent curling.",
        "6. Place the remaining 2 tablespoons of olive oil in a nonstick skillet. Sear the fish, skin-side down, over medium heat, holding the fillets down with a spatula until the skin is crispy and golden brown.",
        "7. Remove fish to an ovenproof dish or skillet and bake in the oven for 8 to 10 minutes, or until cooked through.",
        "8. Meanwhile, set the Moho Sauce over very low heat and gently heat through.",
        "9. Peel and slice the avocado in half lengthwise, remove the pit and slice each half into thin slices lengthwise.",
        "10. To serve, place a fish fillet in the center of each of 4 dinner plates. Spoon 1 to 2 tablespoons of Moho Sauce atop each fillet. Fan 3 or 4 slices of avocado atop each serving and sprinkle with chopped cilantro. Place a bowl of the extra cilantro and a bowl of Moho Sauce on the table."
    ],
    "ingredients": [
        "4 large cloves of garlic, peeled and thinly sliced lengthwise",
        "1/4 cup thinly slivered onion",
        "1/2 teaspoon ground cumin",
        "Salt and freshly ground black pepper, to taste",
        "3 tablespoons extra-virgin olive oil",
        "6 tablespoons fresh lime juice",
        "1/2 teaspoon white-wine vinegar",
        "2 fillets of Chilean sea bass (about 1 pound each)",
        "4 tablespoons fresh lime juice",
        "5 tablespoons extra-virgin olive oil",
        "Salt and freshly ground black pepper, to taste",
        "2 large cloves of garlic, peeled and pressed",
        "1 ripe avocado, for serving",
        "3/4 cup coarsely chopped fresh cilantro leaves, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Vegetable",
        "Bake",
        "Quick & Easy",
        "Bass",
        "Spring",
        "Parade"
    ],
    "title": "Chilean Sea Bass Moho and More",
    "url": "http://www.epicurious.com/recipes/food/views/chilean-sea-bass-moho-and-more-106705"
}
