{
    "directions": [
        "Preheat oven to broil. Place peppers on a baking sheet and place in oven. Allow skin to blacken and blister, turning the chile peppers until all sides are done. (Note: Do not overcook.) When they are done, place them in a paper bag and seal. Set aside for about 15 minutes. take them out of the bag and peel the skin off each one under running water. Remove the stems and seeds, then chop.",
        "Meanwhile, heat corn oil in a Dutch oven over medium heat. Squeeze chorizo out of casings into the hot oil. With a wooden spoon, break up the sausage, and cook about 4 minutes. Remove sausage, and set aside. Stir onion into oil, and cook until soft and translucent, about 5 minutes.",
        "Remove charred skin from roasted peppers and rinse under cool water. Remove the stems and discard the seeds, if desired; coarsely chop.",
        "Stir garlic into pan and cook for 1 minute. Stir in poblano peppers, and heat through 1 minute.",
        "Increase the heat to high, and stir in tomatoes with liquid, black beans, cooked chorizo, water, macaroni, salt, pepper, and oregano. Bring to a low boil. Reduce heat to low; cover, and cook, stirring occasionally, until the macaroni is al dente, about 15 minutes. Serve in bowls garnished with sour cream or queso anejo."
    ],
    "ingredients": [
        "2 fresh poblano chile peppers",
        "1/2 tablespoon corn oil",
        "1 pound chorizo sausage",
        "1 medium onion, chopped",
        "2 cloves garlic, minced",
        "1 (28 ounce) can diced tomatoes with juice",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 cup water",
        "1/2 pound macaroni",
        "3/4 teaspoon salt, or to taste",
        "1/4 teaspoon black pepper, or to taste",
        "1/2 tablespoon dried Mexican oregano",
        "4 tablespoons sour cream (optional)",
        "1/4 cup Queso añejo (aged Mexican cheese) (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chili Mac, Mexican Style",
    "url": "http://allrecipes.com/recipe/88507/chili-mac-mexican-style/"
}
