{
    "directions": [
        "Mix all ingredients in blender until smooth. Season with salt and pepper.",
        "Do ahead: Can be made 1 day ahead. Cover and chill. Stir before using.",
        "Combine all ingredients in blender; blend until smooth. Do ahead: Can be made 2 hours ahead. Cover; let stand at room temperature.",
        "Prepare barbecue (medium heat). Make crosswise slits in each fillet, cutting to within 1/4 inch of bottom and spacing slits about 3/4 inch apart. Brush glaze over top and into slits. Place orange slices in slits. Sprinkle fish with ground cumin, salt, and pepper. Place fish, orange side up, on grill; cover and cook until fish is opaque, about 8 minutes. Using wide spatula, carefully transfer fish to platter. Let rest several minutes. Spoon avocado sauce onto plates, spreading slightly. Arrange 1 fillet over sauce on each plate and serve.",
        "*Chipotle chiles are dried, smoked jalapeños canned in adobo sauce. They are available at some supermarkets, at specialty foods stores, and at Latin markets.",
        "**Green and tomato-like with a papery husk, tomatillos are sold in the produce section of some supermarkets and at Latin markets."
    ],
    "ingredients": [
        "6 tablespoons fresh orange juice",
        "6 tablespoons honey",
        "1 1/2 teaspoons minced canned chipotle chiles*",
        "1 garlic clove, coarsely chopped",
        "1/4 teaspoon ground cinnamon",
        "1 large avocado, halved, pitted, peeled",
        "2 medium tomatillos (about 4 ounces), husked, rinsed, coarsely chopped**",
        "1/4 cup fresh orange juice",
        "1/4 teaspoon (or more) hot pepper sauce",
        "6 5-ounce halibut fillets (each about 1 inch thick)",
        "1 orange with skin, cut lengthwise in half, thinly sliced crosswise",
        "Ground cumin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Garlic",
        "Herb",
        "High Fiber",
        "Orange",
        "Halibut",
        "Avocado",
        "Summer",
        "Grill/Barbecue",
        "Tomatillo"
    ],
    "title": "Chile-Glazed Halibut with Avocado-Tomatillo Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chile-glazed-halibut-with-avocado-tomatillo-sauce-235337"
}
