{
    "directions": [
        "Pour olive oil into a large pot, set over medium heat, and add leeks to hot oil. Season leeks with a pinch of salt. Cook, stirring often, until leeks are soft, 5 to 6 minutes. Pour chicken broth into leeks; bring to a boil. Season with black pepper and cayenne pepper.",
        "Stir peas into boiling broth mixture and add 2 mint leaves. Bring back to a boil and cook until peas are bright green and have started to soften, 5 to 6 minutes.",
        "Turn off heat; use a slotted spoon to transfer vegetables into a large blender, leaving liquid in pot. Pour half the liquid from the pot into the blender, place a folded towel on the blender lid, and pulse a few times to chop vegetables.  Blend at high speed to puree vegetables. Add remaining liquid from pot to blender and liquefy the soup until smooth.",
        "Pour soup from blender into a fine mesh strainer set over a bowl and use a spatula to push soup through the strainer, leaving the tough fibrous material behind.",
        "Cool soup to room temperature, cover with plastic wrap, and refrigerate until thoroughly chilled, about 3 hours.",
        "Season cold soup with salt and adjust cayenne pepper. Ladle soup into a serving bowl. Spoon creme fraiche into a plastic squeeze bottle and squeeze the creme fraiche over the top of the soup in a loose spiral. Use a skewer to pull the spiral into flower petal shapes, starting from the middle and quickly pulling the skewer through the creme to make pointed petal shapes. Serve garnished with strips of fresh mint."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 cup leeks - halved lengthwise and chopped",
        "1 pinch salt",
        "4 cups chicken broth",
        "ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 pound sugar snap peas, ends and strings removed",
        "2 fresh mint leaves",
        "1 tablespoon creme fraiche",
        "2 fresh mint leaves, cut into very fine strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chilled Sugar Snap Pea Soup",
    "url": "http://allrecipes.com/recipe/232791/chilled-sugar-snap-pea-soup/"
}
