{
    "directions": [
        "Arrange chicken breasts, skinned side down, on a cutting board. Remove fillet strip from each breast and reserve for another use.",
        "In a small bowl whisk together tomato paste, chili powder, water, vinegar, and garlic paste. In a shallow baking dish large enough to hold chicken in one layer coat chicken with chili paste. Marinate chicken, covered and chilled, at least 1 hour and up to 24.",
        "Prepare grill.",
        "With a serrated knife cut off stem end of tomatoes and cut each tomato into three 1/4-inch-thick slices. Arrange 1 tomato slice and 1 rosemary sprig on wide end of skinned side of 1 chicken breast and fold narrow end over to sandwich tomato and rosemary. Thread a skewer through ends of chicken breast and then through folded side, letting pointed end of skewer extend about 1-1/2 inches beyond chicken breast. Stuff remaining chicken with remaining tomatoes and rosemary and thread with remaining skewers in same manner.",
        "Grill chicken on an oiled rack set 5 to 6 inches over glowing coals until cooked through, about 8 minutes on each side.",
        "Serve chicken warm or at room temperature."
    ],
    "ingredients": [
        "3 skinless boneless whole chicken breasts (about 2 pounds), halved",
        "3 tablespoons tomato paste",
        "2 tablespoons chili powder",
        "3 tablespoons water",
        "1 tablespoon seasoned rice vinegar",
        "2 garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "2 firm vine-ripened tomatoes (each about 3 inches in diameter)",
        "6 fresh rosemary sprigs",
        "six 10-inch wooden skewers, soaked in water 1 hour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Tomato",
        "Low Fat",
        "Quick & Easy",
        "Rosemary",
        "Summer",
        "Gourmet"
    ],
    "title": "Chili-Rubbed Chicken with Rosemary and Tomato",
    "url": "http://www.epicurious.com/recipes/food/views/chili-rubbed-chicken-with-rosemary-and-tomato-12182"
}
