{
    "directions": [
        "Using kitchen shears, cut open guajillo and ancho chiles along one side; place seeds in large bowl; set aside. Open chiles and place flat in a large dry skillet over medium heat. Cook, turning once, until lightly puffed and toasted, about 4 minutes. Add chiles de árbol and cumin seeds; toast until fragrant, about 1 minute. Transfer to bowl with chile seeds, add 4 cups boiling water, and let soak until softened, about 10 minutes.",
        "Purée chile mixture with soaking liquid, onion, and garlic in a blender.",
        "Combine beer, brown sugar, 1 bunch oregano, 1 cup salt, 3 cups chile paste, and 8 cups water in a very large stock pot. Add turkey, cover, and chill at least 12 hours and up to 14 hours.",
        "Remove turkey from brine; pat dry. Place, breast side up, on a rack set in a large roasting pan. Mix remaining 2 1/2 teaspoon salt into remaining 1 1/2 cups chile paste. Working from neck end of turkey, gently loosen skin from breasts and rub under skin and all over outside of bird. Chill turkey at least 8 hours and up to 12 hours.",
        "Preheat oven to 375°F. Stuff turkey with onion, garlic, and remaining bunch of oregano; tie legs together with kitchen twine. Add broth and 2 cups water to pan and roast turkey 30 minutes. Reduce oven temperature to 325°F and roast, basting every 30–40 minutes with melted butter, adding more broth or water as needed to maintain some liquid in pan, and tenting with foil if turkey browns too quickly, until an instant-read thermometer inserted into thickest part of thigh registers 165°F, 2 1/2–3 hours longer.",
        "Transfer turkey to a platter; tent with foil. Let rest at least 30 minutes before carving.",
        "Meanwhile, strain pan drippings into a measuring cup. Let sit 30 minutes, then skim fat from surface. Bring to a boil in a medium saucepan; reduce heat and simmer until reduced to 1 cup. Stir in lime juice.",
        "Garnish turkey as desired and serve with pan sauce alongside."
    ],
    "ingredients": [
        "10 dried guajillo chiles",
        "6 dried ancho chiles",
        "8 dried chiles de árbol",
        "2 tablespoons cumin seeds",
        "1 small onion, chopped",
        "1 head of garlic, cloves peeled, crushed",
        "6 12-ounce cans pale lager (such as Tecate or Budweiser)",
        "1/2 cup (packed) light brown sugar",
        "2 bunches oregano, divided",
        "1 cup plus 2 1/2 teaspoon kosher salt",
        "1 12–14-pound turkey, giblets and neck removed",
        "1 large onion, quartered",
        "1 head of garlic, halved",
        "2 cups (or more) low-sodium chicken broth",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/4 cup fresh lime juice",
        "Lime wedges and fresh chiles and herbs (for garnish; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Hot Pepper",
        "Fall",
        "Winter",
        "Christmas Eve",
        "Chile Pepper",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chile-Rubbed Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/chile-rubbed-turkey-51198910"
}
