{
    "directions": [
        "Combine 1 cup flour, 3/4 cup cornmeal and 1 teaspoon salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Blend in water by tablespoonfuls until mixture forms moist clumps. Gather dough into ball; flatten into disk. Wrap dough in plastic and refrigerate 1 hour. (Can be prepared 1 day ahead. Keep refrigerated. Let dough soften slightly at room temperature before using.)",
        "Preheat oven to 375°F. Lightly butter 11-inch-diameter tart pan with removable bottom. Press dough onto bottom and up sides of prepared pan; trim to fit, reserving scraps. Place pan on heavy baking sheet. Bake until crust is set and edges begin to brown, about 20 minutes. If crust cracks, gently press small bits of reserved dough into cracks. Transfer pan to rack and cool.",
        "Char chilies over gas flame or under broiler until blackened on all sides. Seal in paper bag and let stand 10 minutes. Peel, seed and chop chilies.",
        "Preheat oven to 375°F. Sprinkle Gruyère and mozzarella over bottom of crust. Sprinkle chilies over cheese. Combine eggs, cream, goat cheese, butter, salt and pepper in processor; blend well. Pour into crust. Sprinkle with Colby cheese.",
        "Bake tart until filling is golden brown and set, about 25 minutes. Transfer to rack and cool slightly. (Can be prepared 8 hours ahead. Cover and refrigerate. Bring to room temperature before serving.) Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "3/4 cup blue cornmeal* or yellow cornmeal",
        "1 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "4 tablespoons (about) ice water",
        "3 large fresh poblano** or New Mexico chilies",
        "1 cup grated Gruyère cheese",
        "1 cup grated mozzarella cheese",
        "4 large eggs",
        "3/4 cup whipping cream",
        "3/4 cup crumbled soft fresh goat cheese (such as Montrachet), room temperature",
        "1/4 cup ( 1/2 stick) butter, room temperature",
        "3/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 cup grated Colby cheese",
        "*Blue cornmeal is available at natural foods stores and some specialty foods stores.",
        "**A fresh green chili, often called a pasilla, available at Latin American markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Egg",
        "Bake",
        "Cornmeal",
        "Hot Pepper",
        "Winter",
        "Seattle",
        "Washington"
    ],
    "title": "Chile Relleno Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chile-relleno-tart-2982"
}
