{
    "directions": [
        "In a large sauté pan over medium-high heat, combine the ground beef, salt and sugar and cook, stirring, until browned, about 10 minutes. Drain the meat and transfer to a slow cooker.",
        "In the same pan over medium heat, warm the olive oil. Add the flour and cook, stirring, 2 to 3 minutes; do not allow it to brown. Add the onion and sauté for 5 minutes. Add the garlic, chili powder, pepper and oregano and cook, stirring occasionally, until fragrant, 3 to 4 minutes. Add the tomatoes with their juices and cook for 7 to 10 minutes, then pour the mixture into the slow cooker. Add the stock and cornmeal. Cover and cook for 6 hours on high or 8 hours on low. After the chili is cooked, skim off any fat from the surface.",
        "Preheat an oven to 375°F.",
        "Prepare the corn bread batter according to the package instructions. Divide the chili evenly among 8 ovenproof bowls. Top each with a scant 1/2 cup of the batter. Using a small offset spatula, spread the batter over the center two-thirds of the chili, being careful not to mix the batter with the chili. Place the bowls on a baking sheet and bake until a toothpick inserted into the center of the corn bread comes out clean, 25 to 30 minutes. Serve immediately. Serves 8.",
        "Williams-Sonoma Kitchen",
        "*Available in our retail stores."
    ],
    "ingredients": [
        "5 lb. ground beef",
        "1 Tbs. salt",
        "3 Tbs. sugar",
        "1⁄4 cup olive oil",
        "5 Tbs. all-purpose flour",
        "1 yellow onion, chopped",
        "5 garlic cloves, minced",
        "1⁄2 cup Urban Accents Rio Grande chili powder*",
        "Freshly ground pepper, to taste",
        "2 tsp. dried oregano",
        "1 can (28 oz.) chopped tomatoes with juices",
        "3 cups chicken stock",
        "1⁄4 cup cornmeal",
        "1 package Buckeye corn bread mix*"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chili en Crôute",
    "url": "http://www.williams-sonoma.com/recipe/chili-en-croute.html"
}
