{
    "directions": [
        "Preheat the oven to 350°F.",
        "In a small skillet over a medium heat, toast the star anise and fennel seed. Move the pan across the heat, letting the spices gently roll inside. Do that for about 3 to 4 minutes or until you begin to smell the toasting spices. Transfer into a spice mill or a coffee grinder. Add 5 of the chiles and grind until finely ground. Season the brisket with salt and pepper, rub with the spice blend, cover, and refrigerate while continuing with the recipe.",
        "Put the remaining 7 chiles in a bowl and cover with the boiling water. Set aside and let soak until the chiles have softened, about 30 minutes. When soft, reserve the chiles and 1 cup of the reconstituting water. Discard the rest of the water. In a blender, liquefy the chiles, the 1 cup reserved soaking water, and the sherry vinegar. Set aside.",
        "In a large Dutch oven, heat the olive oil over high heat and sear the brisket in the hot oil on all sides until well browned, about 5 minutes per side. Remove the brisket from the pan and set aside. Add the onions to the pan and sauté until they become translucent, about 3 minutes. Stir in the tomatoes, stock, and chile mixture and bring to a boil. Remove the pan from the heat, add the brisket, cover, and braise in the oven until fork tender, 3 1/2 to 4 hours, skimming occasionally to remove excess fat.",
        "When done, slice and serve hot with the braising liquid alongside.",
        "The hot climate of southern Oregon produces one of my very favorite Spanish varietals, Tempranillo, which loves meat braised with tomatoes, ground chiles, and spices. The black-fruit flavors of this grape and the tannins stand up well to the braised beef. Two Oregon wineries, Abacela and Dominio IV, produce fine examples of this grape varietal. A companion choice would be a French Rhône wine from Chapoutier: Châteauneuf-du-Pape, Saint Joseph, or Crozes-Hermitage. These wines have spice, smoke, and lingering tannins that speak to all the flavors of the brisket. —K.P."
    ],
    "ingredients": [
        "1 star anise",
        "1 teaspoon fennel seed",
        "12 pasilla chiles, seeded",
        "4 pounds beef brisket, trimmed of excess fat and silver skin",
        "Kosher salt and freshly ground black pepper",
        "3 cups boiling water",
        "1/4 cup sherry vinegar",
        "3 tablespoons extra-virgin olive oil",
        "1 medium onion, cut into fine dice",
        "3 ripe tomatoes, grated on the largest holes of a box grater, or 1 (14-ounce) can canned crushed tomatoes with juice",
        "2 cups chicken stock"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Tomato",
        "Super Bowl",
        "Backyard BBQ",
        "Dinner",
        "Brisket",
        "Fall",
        "Winter",
        "Tailgating",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chile-Braised Beef Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/chile-braised-beef-brisket-350804"
}
