{
    "directions": [
        "Using a large knife, separate greens and stems from beets. Thoroughly wash greens and stems; set aside. Scrub beets, transfer to a medium pot, and cover with 1\" water. Cover pot and bring to a boil. Reduce heat to medium, uncover, and cook until beets are tender when pierced with a knife, about 10 minutes. Drain beets; discard cooking liquid. Let cool.",
        "Meanwhile, chop beet greens and stems. Transfer to a large pot and add 1/2 tsp. salt and 4 cups water. Bring to a boil, then reduce heat to medium and simmer, without boiling, until greens are tender, about 5 minutes. Let cool to room temperature, about 30 minutes.",
        "Peel and coarsely grate beets, preferably wearing gloves. Add to pot with cooled greens. Gently stir in cucumbers, pickle, pickle brine, buttermilk, sour cream, and scallions. Season with salt and pepper.",
        "Cover pot and chill soup at least 30 minutes. Adjust seasonings, if desired. Divide soup among bowls; top with eggs and dill.",
        "Soup can be made 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1 pound beets with greens (about 2 medium beets)",
        "Kosher salt",
        "2 Kirby cucumbers, peeled, coarsely grated (about 1 cup)",
        "1 kosher dill pickle, coarsely grated (about 1/2 cup), plus 1/2 cup pickle brine",
        "1 1/2 cups buttermilk or kefir (preferably low- or full-fat)",
        "3/4 cup sour cream",
        "2 tablespoons chopped scallions",
        "Freshly ground black pepper",
        "4 hard-boiled eggs, halved",
        "4 teaspoons finely chopped dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Summer",
        "Freeze/Chill",
        "Beet",
        "Egg",
        "Sour Cream",
        "Dill",
        "Dinner",
        "Lunch",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chilled Beet Soup With Buttermilk, Cucumbers, and Dill (Chlodnik)",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-beet-soup-with-buttermilk-cucumbers-and-dill-chlodnik"
}
