{
    "directions": [
        "Heat butter and oil in a large pot over medium-high heat. Add onion and garlic and cook, stirring often, until softened and beginning to brown, about 5 minutes. Add corn; season with salt and pepper. Cook, stirring occasionally, until corn is softened and beginning to brown, 6-8 minutes.",
        "Add thyme sprigs and 5 cups water to pot. Bring corn mixture to a boil, reduce heat, and simmer until corn is very soft, 6-8 minutes longer; discard thyme sprigs.",
        "Working in batches, purée corn mixture in a blender until smooth (or use an immersion blender in the pot). Strain through a fine-mesh sieve into a large bowl, pressing on solids; discard solids. Transfer soup to a large bowl, cover, and chill until cold, at least 2 hours.",
        "Pour water into a large pot to a depth of 1\"; bring to a boil and salt generously. Add lobsters, cover, and cook until bright red, 8-10 minutes. Transfer lobsters to a rimmed baking sheet and let cool.",
        "Crack lobster shells, pick meat from tail and claws, and cut into bite-size pieces (you should have about 2 cups meat).",
        "Whisk shallot, lemon juice, and mustard in a medium bowl. Gradually whisk in 2 tablespoons oil; season dressing with kosher salt and pepper. Add lobster meat, 3 tablespoons celery leaves, and 1 tablespoon tarragon; toss gently to coat. Cover and chill until cold, about 1 hour.",
        "Divide soup among bowls and top with lobster salad and tarragon and celery leaves. Drizzle with oil and season with sea salt and pepper.",
        "DO AHEAD: Lobster can be cooked and picked 1 day ahead. Cover and chill. Soup and lobster salad can be made 8 hours ahead. Keep chilled. Toss lobster meat with celery leaves, tarragon, and dressing just before serving."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1 garlic clove, finely chopped",
        "6 cups corn kernels (from 6 ears)",
        "Kosher salt, freshly ground pepper",
        "2 sprigs thyme",
        "Kosher salt",
        "2 1 1/4-pound live lobsters",
        "1/2 small shallot, finely chopped",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon Dijon mustard",
        "2 tablespoons extra-virgin olive oil plus more for drizzling",
        "Freshly ground black pepper",
        "3 tablespoons coarsely chopped celery leaves plus more for garnish",
        "1 tablespoon coarsely chopped fresh tarragon plus leaves for garnish",
        "Flaky sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Shellfish",
        "Lunch",
        "Seafood",
        "Lobster",
        "Corn",
        "Summer",
        "Chill",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chilled Corn Soup with Lobster Salad",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-corn-soup-with-lobster-salad-51179090"
}
