{
    "directions": [
        "In 2-cup glass measuring cup, stir together 1/2 cup warm water (105°F to 115°F) and sugar. Sprinkle yeast over and stir, then let stand until foamy, about 5 minutes. Stir in flour, cover with plastic wrap, and let stand at room temperature until sponge rises to top of measuring cup, 20 to 30 minutes. Uncover and stir mixture down.",
        "In bowl of electric mixer fitted with paddle attachment, beat butter and sugar until fluffy, about 5 minutes. Add salt and zest and beat until combined. Add 3 eggs, 1 at time, beating well after each addition. Add sponge and beat until combined. Add 2 cups flour and mix at low speed until combined. Add remaining 1 cup flour, remaining 1 egg, brandy, and vanilla and mix at low speed until smooth.",
        "Increase speed to medium and beat dough until smooth and elastic, about 5 minutes. Add cherries, dark and golden raisins, and candied fruit, and mix at low speed until incorporated.",
        "Lightly butter clean, large bowl. Turn dough out onto work surface and form into ball. Transfer dough to bowl and turn to coat with oil. Cover bowl snugly with plastic wrap and let rise in warm, draft-free area until doubled in volume, about 1 hour.",
        "Line 8-inch diameter (at top) flowerpot with foil and lightly grease foil. (Alternatively, lightly grease 9-inch diameter springform pan with 3-inch-high sides.) Turn dough out onto work surface and knead 1 minute, then transfer to pot or pan. Cover with plastic wrap and let rise in warm, draft-free area until doubled in volume, about 1 hour.",
        "Arrange rack in lower third of oven and preheat to 375°F. Remove plastic wrap from dough in pan and transfer pan to oven. Bake 20 minutes, then lay sheet of foil loosely on top of loaf. Continue baking until bread is nicely puffed and golden-brown, about 25 to 30 minutes more. Cool in pan on rack 10 minutes, then unmold and cool completely before slicing and eating."
    ],
    "ingredients": [
        "Pinch of sugar",
        "1 (1/4-ounce) packet active dry yeast (2 1/4 teaspoons)",
        "3/4 cup unbleached all-purpose flour",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/3 cup sugar",
        "1/2 teaspoon salt",
        "Finely grated zest of 1 orange or lemon",
        "4 large eggs, room temperature",
        "3 cups unbleached all-purpose flour",
        "1 1/2 teaspoons brandy",
        "1 1/2 teaspoons pure vanilla extract",
        "1/2 cup dried or glacéed cherries",
        "1/3 dark raisins",
        "1/3 cup golden raisins",
        "1/3 cup candied ginger or lemon or orange peel",
        "1 tablespoon unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Citrus",
        "Bake",
        "Christmas",
        "Dried Fruit",
        "Raisin",
        "Brandy",
        "Winter"
    ],
    "title": "Chilean Christmas Bread",
    "url": "http://www.epicurious.com/recipes/food/views/chilean-christmas-bread-236732"
}
