{
    "directions": [
        "In a small saucepan combine 1/3 cup water, the soy sauce, the mirin, the broth, the sake, the sugar, and a pinch of salt, bring the liquid to a boil, and add the scallion greens. Chill the sauce until it is cold.",
        "On an oiled rack set about 4 inches over glowing coals or in an oiled ridged grill pan heated over moderately high heat grill the chicken breasts, seasoned with salt and pepper, for 8 minutes on each side, or until they are cooked through. Transfer the chicken to a cutting board and let it cool. In a kettle of boiling water boil the somen for 3 minutes, or until they are al dente, drain them, and rinse them under cold water until they are cold. Divide the noodles among 4 plates, forming bunches of the noodles by wrapping them around the hand and overlapping them on each plate. Surround the noodles with mounds of the carrot, the radish, the cucumber, and the snow peas. Cut the chicken into thin slices and divide it among the plates, fanning out the slices. Serve the noodles with the sauce for dipping or pouring over them."
    ],
    "ingredients": [
        "1/2 cup soy sauce",
        "1/3 cup mirin (sweet wine, available at Asian markets and some supermarkets)",
        "1/3 cup chicken broth",
        "2 tablespoons sake",
        "1/2 teaspoon sugar",
        "2 tablespoons thinly sliced scallion greens",
        "2 whole skinless boneless chicken breasts (about 1-1/2 pounds), halved",
        "10 ounces dried thin somen (wheat noodles, available at Asian markets some supermarkets, and some health food stores)",
        "3/4 cup finely shredded carrot",
        "3/4 cup very thinly sliced cucumber",
        "3/4 cup snow peas, blanched for 1 minute in boiling water and cut into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Chicken",
        "Pasta",
        "Cucumber",
        "Carrot",
        "Sake",
        "Summer",
        "Chill",
        "Grill/Barbecue",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Chilled Japanese Noodles with Grilled Chicken and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-japanese-noodles-with-grilled-chicken-and-vegetables-12375"
}
