{
    "directions": [
        "Pat the meat dry with a paper towel and season with the salt and pepper. Heat 2 tablespoons of the oil in a large stew pot or Dutch oven over medium-high heat. Sear the meat, in small batches, until well browned, adding more oil to the pan if needed. Transfer meat to a bowl and reserve.",
        "Discard all but 2 tablespoons of the oil from the pan. Saute the onions over medium heat for 10 minutes, scraping up the browned bits with a wooden spoon from the bottom of the pan. Add the garlic and saute for 2 minutes more. Stir in the chili powders, cumin, and oregano and cook for 2 minutes. Whisk in 5 cups of the stock. Add the meat and any accumulated juices to the pot. Bring to a gentle simmer. Season the chili with salt and pepper to taste, and stew the meat with a cover slightly ajar until almost tender, about 3 hours.",
        "In a food processor or blender puree half of the beans with the remaining stock. Add the bean mixture to the chili along with the whole beans. Simmer for 1 hour more or until the meat is tender. Season with salt and pepper to taste and serve with rice and selections of condiments, like sour cream, chopped cilantro, shredded cheddar, minced fresh or sliced pickled jalapenos."
    ],
    "ingredients": [
        "2 1/2 pounds beef chuck, cut into 1 inch cubes",
        "2 1/2 pounds pork shoulder, cut into 1 inch cubes",
        "1 tablespoon kosher salt plus more to taste",
        "Freshly ground black pepper",
        "1/3 to 1/2 cup olive oil",
        "2 large Spanish onions, chopped",
        "10 large cloves garlic, minced",
        "1/4 cup New Mexico red chile powder",
        "2 tablespoons ancho chile powder",
        "1 tablespoon ground cumin",
        "2 teaspoons oregano, crushed (preferably Mexican)",
        "6 cups beef or chicken broth, homemade or low-sodium canned (see note)",
        "Two 15 1/2-ounce cans pinto beans, drained and rinsed",
        "Serving suggestions: White rice, sour cream, chopped cilantro (fresh coriander), shredded cheddar, minced fresh or pickled jalapeno peppers"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Chili",
        "Beef",
        "Chili",
        "Meat",
        "Dutch Oven",
        "American",
        "Southwestern",
        "Cheese",
        "Pork",
        "Cheddar",
        "Dairy Recipes",
        "Jalapeno Recipes",
        "Vegetable",
        "Rice Recipes",
        "Grain Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Holiday",
        "Pureeing Recipes"
    ],
    "title": "Chili con Carne",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chili-con-carne-recipe"
}
