{
    "directions": [
        "Place chicken in a large pot with the halved onion, two carrots, one stalk celery, and 1 clove garlic, and cover with water. Boil until done. Slice meat into bite-sized pieces.",
        "In a large skillet over medium heat, saute onion and garlic until soft, then add chicken, raisins, brown sugar, 4 ounces walnuts, pepper and bay leaves. Mix together and saute for 3 to 5 minutes, then stir in vinegar, cilantro and tomato paste; reduce heat to low and let all simmer for 15 minutes. Remove from heat and let cool.",
        "Preheat oven to 250 degrees F (120 degrees C).  Cut a slit in each chile pepper along one side, lengthwise, so that they can be reconstructed after they are stuffed. Stuff each chile pepper with cooled chicken mixture and place in preheated oven to keep warm.",
        "To Make Sauce: In a large saucepan over medium heat, combine the cream cheese, goat cheese, sour cream, 8 ounces walnuts, nutmeg and granulated sugar. Heat, stirring, for 5 to 7 minutes. When blended together, pour sauce over warm chile peppers and garnish with fresh chopped cilantro."
    ],
    "ingredients": [
        "1 (4 pound) whole chicken, cut into pieces",
        "1 onion, halved",
        "2 carrots, peeled",
        "1 stalk celery",
        "1 clove garlic, peeled",
        "12 fresh poblano chile peppers - cleaned, roasted and peeled",
        "1 white onion, chopped",
        "3 cloves garlic, chopped",
        "4 ounces raisins",
        "4 ounces brown sugar",
        "4 ounces walnuts",
        "1/4 teaspoon ground black pepper",
        "4 bay leaves",
        "1 tablespoon distilled white vinegar",
        "1/2 cup chopped fresh cilantro",
        "3 tablespoons tomato paste",
        "4 (8 ounce) packages cream cheese",
        "8 ounces soft goat cheese",
        "1 cup sour cream",
        "8 ounces walnuts",
        "1/2 teaspoon ground nutmeg",
        "3/4 teaspoon white sugar",
        "1/2 bunch cilantro, finely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chiles en Nogada (Stuffed Poblano Chile Peppers)",
    "url": "http://allrecipes.com/recipe/17239/chiles-en-nogada-stuffed-poblano-chi/"
}
