{
    "directions": [
        "Melt coconut oil over medium heat in a large pot. Add onion, ginger, tumeric, and 1/2 tsp. salt and cook, stirring occasionally, until onion is translucent, 8–10 minutes.",
        "Break corn cobs in half and add to pot along with corn kernels, potato, coconut milk, lime zest, and 1 1/2 cups water. Bring to a boil over high heat, then reduce to a simmer and cook until potato is tender, 20–25 minutes.",
        "Discard corn cobs and lime zest, then transfer soup to a blender. Add 1/2 tsp. salt and purée until smooth. Let cool to room temperature. Transfer to a large bowl and chill, covered, at least 2 hours.",
        "Meanwhile, preheat oven to 350°F. Spread coconut flakes on a small rimmed baking sheet and toast, tossing occasionally, until golden, about 5 minutes; transfer to a plate.",
        "Stir lime juice into soup and adjust seasonings, thinning with water, if needed. Divide soup among bowls, then top with toasted coconut, avocado, and cilantro. Serve with lime wedges alongside.",
        "Soup can be made 4 days ahead. Cover and chill."
    ],
    "ingredients": [
        "2 tablespoons virgin coconut oil",
        "1 medium onion, finely chopped",
        "1 (1/2\") piece ginger, peeled, finely chopped (about 1 1/2 teaspoons)",
        "1/4 teaspoon ground turmeric",
        "1 teaspoon kosher salt, divided, plus more to taste",
        "6 ears of corn, kernels cut off (about 5 1/2 cups), cobs reserved",
        "1 Yukon Gold potato (about 5 ounces) peeled, cut into 1/2\" cubes",
        "1 (14-ounce) can coconut milk",
        "2 (2\") strips lime zest",
        "1/2 cup unsweetened coconut flakes",
        "2 tablespoons fresh lime juice",
        "Diced avocado, cilantro leaves with tender stems, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Onion",
        "Kid-Friendly",
        "Coconut",
        "Corn",
        "Summer",
        "Vegan"
    ],
    "title": "Chilled Coconut Corn Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-coconut-corn-soup-56390010"
}
