{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over medium heat. Add onion, carrot, garlic, and thyme; sauté until vegetables are tender, stirring occasionally, about 10 minutes. Add 4 cups stock and wine; bring to boil. Add mussels; cover and cook until mussels open, about 5 minutes (discard any mussels that do not open). Using slotted spoon, transfer mussels to large bowl; cool slightly. Remove mussels from shells; cover and refrigerate until ready to use. Strain stock mixture and any accumulated mussel liquid into medium bowl; discard vegetables.",
        "Heat remaining 3 tablespoons oil in heavy large skillet over medium heat. Add zucchini; sauté until tender but not brown, about 20 minutes. Add 2 1/2 cups strained stock. Bring to boil. Cool slightly. Puree zucchini soup in batches in blender until smooth. Transfer to large saucepan; mix in cream. Thin with more strained stock, if desired. Reserve any remaining stock for another use. Season with salt and pepper. Refrigerate until cold, about 4 hours. (Soup and mussels can be made 6 hours ahead. Cover separately; keep chilled.)",
        "Divide zucchini soup among 6 bowls. Top each with mussels, dividing equally. Sprinkle with mint."
    ],
    "ingredients": [
        "5 tablespoons olive oil",
        "1 large onion, chopped",
        "1 large carrot, chopped",
        "3 garlic cloves, minced",
        "3 fresh thyme sprigs",
        "4 cups chicken stock or canned low-salt chicken broth",
        "2 cups dry white wine",
        "2 1/4 pounds fresh mussels, scrubbed, debearded",
        "2 1/4 pounds zucchini, trimmed, cut into 1/2-inch pieces (about 7 cups)",
        "1/2 cup whipping cream",
        "1/4 cup chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mint",
        "Mussel",
        "Zucchini",
        "Spring",
        "Chill"
    ],
    "title": "Chilled Cream of Zucchini Soup with Mussels and Fresh Mint",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-cream-of-zucchini-soup-with-mussels-and-fresh-mint-105067"
}
