{
    "directions": [
        "In a large saucepan, cover the tomatoes with water and cook until they change color and their skins begin to peel. Remove the tomatoes from the water and let cool, reserving the cooking liquid. Once cool enough to handle, peel the tomatoes. Transfer to a blender or food processor, add the onion and garlic, and blend until smooth.",
        "In a large skillet, heat the oil until hot but not smoking. Add the tomato sauce and fry, stirring occasionally, until it changes color and is fully cooked.",
        "Add the bay leaf and enough of the reserved tomato cooking liquid to make a fairly thin sauce, then season to taste with salt. Keep hot until ready to serve.",
        "Using fireproof tongs, roast the chiles over an open flame until the skin is completely blistered. Transfer to a plastic bag (or place in a bowl and cover with plastic wrap) and let steam for 10 to 15 minutes to loosen the skins. Once they are cool enough to handle, peel the chiles and discard the skins. Using a small, sharp knife, make a lengthwise slit down one side of each chile and carefully remove the seeds. Stuff the chiles with cheese, dividing it evenly.",
        "Place all but 1 tablespoon of the flour in a small, shallow bowl. Carefully dredge the stuffed chiles in the flour, coating lightly and shaking off any excess.",
        "In a separate bowl, beat the 3 egg whites until soft peaks form. Carefully fold in the egg yolks, along with the reserved 1 tablespoon of flour, and season with salt.",
        "In a large skillet over moderate heat, heat the canola oil until hot but not smoking. Holding the flour-dusted chiles by their stems, dip them in the egg batter and then carefully lay them in the hot oil. Using a spatula or spoon, baste the chiles with the hot oil. Once the bottoms are golden brown, turn with a spatula and brown the other side. Transfer to a wire rack or paper towel–lined plate to drain.",
        "Serve the poblanos covered with the caldillo sauce and accompanied by rice and refried beans."
    ],
    "ingredients": [
        "2 pounds Roma tomatoes",
        "1 medium onion, thinly sliced",
        "2 cloves garlic",
        "2 tablespoons canola oil",
        "1 bay leaf",
        "Kosher salt",
        "4 fresh poblano chiles",
        "12 ounces Asadero, Chihuahua, or other semisoft melting cheese, cut into small cubes",
        "1/2 cup all-purpose flour",
        "3 large eggs, separated",
        "1 1/2 cups canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Tomato",
        "Vegetarian",
        "Cinco de Mayo",
        "Dinner",
        "Lunch",
        "Chile Pepper",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chiles Poblanos Rellenos de Queso (Poblano Chiles Stuffed with Cheese)",
    "url": "http://www.epicurious.com/recipes/food/views/chiles-poblanos-rellenos-de-queso-poblano-chiles-stuffed-with-cheese-51110420"
}
