{
    "directions": [
        "Remove flaps from squid sacs if attached, reserving them, and cut sacs crosswise into 1/4-inch-thick rings. Cut reserved flaps into 1/4-inch-thick strips and halve tentacles lengthwise if large. Remove tough muscle from side of each scallop if necessary.",
        "Have ready a large bowl of ice and cold water. In a large saucepan of boiling salted water cook shrimp 1 minute, or until pink and just cooked through, and transfer with a slotted spoon to ice water to stop cooking.",
        "Add scallops to boiling water and cook at a bare simmer 2 minutes, or until just cooked through. Transfer scallops with slotted spoon to ice water to stop cooking.",
        "Add squid to boiling water and cook 20 to 30 seconds, or until just opaque. Drain squid in a colander and transfer to ice water to stop cooking.",
        "Drain seafood well in colander and transfer to a bowl. Chill seafood, covered, until cold, at least 2 hours, and up to 1 day.",
        "In a blender blend together herbed oil ingredients on high speed 1 minute. Pour oil through a fine sieve into a bowl, pressing hard on solids, and discard solids. Herbed oil may be made 2 days ahead and chilled, covered. One hour before serving, toss seafood with lemon slices and lemon juice. Divide seafood among 12 bowls and drizzle with herbed oil. Sprinkle salads with sea salt and serve additional sea salt on the side."
    ],
    "ingredients": [
        "1 pound cleaned squid",
        "1 pound small sea scallops",
        "1 pound medium shrimp (about 25), shelled, leaving tail and connecting shell segment intact",
        "3/4 cup extra-virgin olive oil",
        "3/4 cup coarsely chopped fresh flat-leafed parsley leaves (wash and dry  before chopping)",
        "1/2 cup chopped fresh chives (wash and dry before chopping)",
        "1 tablespoon chopped fresh rosemary leaves",
        "1/2 teaspoon table salt",
        "2 lemons, sliced thin",
        "fresh lemon juice to taste",
        "coarse sea salt to taste plus additional for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Low/No Sugar",
        "Buffet",
        "Rosemary",
        "Scallop",
        "Shrimp",
        "Squid",
        "Chill",
        "Healthy",
        "Chive",
        "Parsley",
        "Boil",
        "Gourmet"
    ],
    "title": "Chilled Seafood Salad with Herbed Olive Oil and Sea Salt",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-seafood-salad-with-herbed-olive-oil-and-sea-salt-13619"
}
