{
    "directions": [
        "Preheat the oven to 450°F.",
        "In a small bowl, whisk the coconut oil, syrup, cinnamon, and salt. Put the potato and peaches in 2 separate bowls. Pour three quarters of the syrup mixture over the sweet potato and one-quarter over the peaches and toss. Spread the potato in an even layer in a large baking dish and roast for 10 minutes. Toss the potato and roast for 5 minutes more. Add the onion and roast for 15 minutes. Toss the potato and onion, add the peaches in an even layer, and roast 10 minutes, or until the potato and onion are fork tender and the peaches have caramelized.",
        "Pat the chicken dry and season both sides liberally with salt and pepper. Heat the oil in a large skillet over medium-high heat and arrange the chicken thighs inside (cast iron works really well to get a nice crispy crust). Brown the chicken on one side, giving the chicken time to unstick itself from the pan surface and form a good, crispy coating, about 10 minutes (you can give it some help with your tongs or spatula if needed). Flip the chicken thighs and brown for 6 to 10 minutes, or until you can insert a knife to the bone and no red liquid emerges.",
        "Lower heat to medium-low and spoon a quarter of the chile jam over each thigh. Melt the jam over the chicken and on all sides, using tongs to flip and swirl the thighs in the pan. Cook for 1 to 2 minutes to allow the jam to form a glaze. Remove the thighs to a serving plate and spoon the glaze on top. Scrape up any bits sticking to the bottom of the pan—these will be the crispiest and the first to go!",
        "Just before serving, squeeze fresh lemon juice over the chicken to brighten its flavors and heighten the sweetness and spice. Serve with Caramelized Sweet Potatoes and Peaches."
    ],
    "ingredients": [
        "1 tablespoon organic coconut oil, melted",
        "2 tablespoons pure maple syrup, room temperature (if it is cold, the coconut oil will solidify on contact)",
        "1/2 teaspoon ground cinnamon",
        "Iodized salt",
        "1 medium sweet potato, scrubbed and cut into 1-inch chunks",
        "2 medium peaches, pitted and sliced into 4 wedges each",
        "1 medium sweet onion, peeled and quartered",
        "4 skinless, bone-in chicken thighs",
        "Sea salt",
        "Fresh-cracked black pepper",
        "4 tablespoons chile jam (some of my favorites: Hell Fire Pepper Jelly from Jenkins Jellies or INNA Jam’s Plenty Spicy Jalapeño for heat seekers)",
        "Juice of 1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dinner",
        "Summer",
        "Chicken",
        "Peach",
        "Sweet Potato/Yam",
        "Chile Pepper",
        "Onion"
    ],
    "title": "Chile Jam Chicken With Caramelized Sweet Potatoes and Peaches",
    "url": "http://www.epicurious.com/recipes/food/views/chile-jam-chicken-with-caramelized-sweet-potatoes-and-peaches"
}
