{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Heat a large non-stick skillet over medium-high heat. Add 1 tablespoon canola oil to coat the bottom of the pot. Add the ground turkey to the hot oil and brown, breaking it up as it cooks. Drain meat into a colander and reserve. To the same skillet which has a little residual fat from cooking the turkey, add the onions and cook over medium heat until soft; then add the garlic and cook until soft. Stir in the chili powder and cumin. Add the chiles and their juices and the tomatoes and their juices. Add the meat back to the pan and stir until combined. Reduce heat to low and simmer for 20 minutes or until thick. Season with salt, to taste, and pepper.",
        "In a medium bowl, combine Cheddar and cream cheese; set aside. Line a casserole dish with half the tortillas and ladle half of the meat mixture over. Cover with half of the cheese mixture. Top with half of the green onions. Repeat layers 1 more time. Bake for 45 minutes or until bubbling. Let stand for 5 minutes before serving."
    ],
    "ingredients": [
        "1 tablespoon canola oil",
        "1 pound lean ground turkey",
        "2 red onions, chopped",
        "4 cloves garlic, smashed and chopped",
        "1 1/2 teaspoons chili powder",
        "1/4 teaspoon cumin powder",
        "1 (4-ounce) can diced green chiles, not drained",
        "1 (15-ounce) can tomatoes with green chiles, not drained",
        "Salt",
        "1 teaspoon freshly ground pepper",
        "2 cups shredded low-fat Cheddar",
        "1 pint light cream cheese",
        "8 (6-inch) corn tortillas",
        "1 bunch green onions, sliced",
        "1/4 cup shredded low-fat mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Casserole Recipes",
        "Casserole",
        "Easy Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy",
        "Cheddar",
        "Cheese",
        "Poultry Recipes",
        "Turkey Recipes",
        "Tomato",
        "Vegetable",
        "Low-Fat",
        "Low Calorie",
        "Sauteing Recipes"
    ],
    "title": "Chilaquiles",
    "url": "http://www.foodnetwork.com/recipes/chilaquiles"
}
