{
    "directions": [
        "Into a bowl sift together the flour, the baking powder, the baking soda, and the salt, add the butter, and blend the mixture until it resembles coarse meal. Stir in the Cheddar and the chilies, add the sour cream, and stir the mixture until it just forms a soft but not sticky dough. Knead the dough gently 6 times on a lightly floured surface, roll or pat it out 1/2 inch thick, and with a 3 1/2-inch cookie cutter cut out 6 rounds. Bake the rounds on an ungreased baking sheet in the middle of a preheated 425°F. oven for 15 to 17 minutes, or until they are golden.",
        "In a kettle cook the onions in the oil over moderately low heat, stirring occasionally, until they are softened, add the garlic and the carrots, and cook the mixture, stirring, for 1 minute. Add the chuck and cook it over moderate heat, stirring and breaking up any lumps, for 10 minutes, or until it is no longer pink. Add the chili powder, the cumin, the paprika, the oregano, and the red pepper flakes and cook the mixture, stirring, for 1 minute. Add the tomato sauce, the broth, and the vinegar, bring the mixture to a boil, and simmer it, covered, stirring occasionally, for 50 minutes to 1 hour, or until the meat is tender. Add the kidney beans, the bell peppers, and salt and black pepper to taste and simmer the mixture, uncovered, for 15 minutes, or until the bell peppers are tender.",
        "Arrange a biscuit, heated and split, on each of the 6 dinner plates, spoon the chili con carne over the bottom half, and cover it with the top half of the biscuit."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 teaspoons double-acting baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 tablespoons cold unsalted butter, cut into bits",
        "1/4 pound sharp Cheddar, grated coarse (about 1 1/2 cups)",
        "four 2-inch pickled jalapeño chilies, seeded and minced (wear rubber gloves)",
        "1 cup sour cream",
        "2 large onions, chopped (about 3 cups)",
        "1/4 cup vegetable oil",
        "1 tablespoon minced garlic",
        "2 carrots, sliced thin",
        "3 pounds boneless beef chuck, ground coarse in batches in a food processor or by the butcher",
        "1/4 cup chili powder",
        "1 tablespoon ground cumin",
        "2 tablespoons paprika",
        "1 tablespoon crumbled dried oregano",
        "1 tablespoon dried hot red pepper flakes, or to taste",
        "two 8-ounce cans tomato sauce",
        "1 1/4 cups beef broth",
        "3 tablespoons cider vinegar",
        "a 19-ounce can kidney beans, rinsed and drained",
        "2 green bell peppers, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Cheese",
        "Tomato",
        "Bake",
        "Super Bowl",
        "Cheddar",
        "Bell Pepper",
        "Winter",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Chili con Carne with Chili Cheddar Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/chili-con-carne-with-chili-cheddar-shortcakes-10299"
}
