{
    "directions": [
        "Halve and pit the avocados. Set aside half an avocado for the salsa. Put the remaining avocado flesh in a blender with the buttermilk, yogurt, cilantro, garlic, chile, and cumin. Blend until smooth. Taste and add more chile if desired, and then blend again. Transfer to a bowl and stir in enough cold water to thin the soup to a pleasing consistency, about 1/2 cup. Stir in the lime juice, or more to taste, and season with salt. Chill thoroughly.",
        "Just before serving, prepare the salsa: In a bowl, stir together the tomato, onion, cilantro, chile, and garlic. Cut the reserved avocado half into 1/4-inch dice and fold it in gently, and then season to taste with salt and lime juice and stir again gently to avoid mashing the avocado.",
        "If the soup has thickened in the refrigerator, whisk in ice water to thin it to the desired consistency. Taste for seasoning. Divide among 6 bowls. Top each serving with a spoonful of salsa and serve."
    ],
    "ingredients": [
        "2 large ripe but firm avocados",
        "1 1/2 cups buttermilk",
        "1 1/2 cups plain yogurt",
        "2 heaping tablespoons chopped cilantro",
        "1 large clove garlic, thinly sliced",
        "1/2 serrano or jalapeño chile, seeds removed for less heat if desired, or more to taste",
        "1/2 teaspoon toasted and ground cumin seeds",
        "1 tablespoon freshly squeezed lime juice",
        "Kosher or sea salt",
        "1 large plum (Roma) tomato, halved lengthwise, seeded, and cut into 1/4-inch dice",
        "1/4 cup finely minced white onion",
        "2 heaping tablespoons chopped cilantro",
        "1/2 serrano or jalapeño chile, seeds removed for less heat if desired, finely minced",
        "1 small clove garlic, finely minced",
        "Kosher or sea salt",
        "Freshly squeezed lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Low Fat",
        "Kid-Friendly",
        "Yogurt",
        "Lunch",
        "Avocado",
        "Healthy",
        "Low Cholesterol",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chilled Avocado and Yogurt Soup with Tomato Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/chilled-avocado-and-yogurt-soup-with-tomato-salsa-56389458"
}
