{
    "directions": [
        "In a heavy kettle (at least 5 quarts) combine short ribs, water, soy sauce, Scotch, and sugar and bring to a boil. Reduce to a simmer and skim froth. Add gingerroot, 5 scallions, flattened with the side of a large knife, garlic, cinnamon, aniseed, and pepper flakes and simmer, covered, 2 hours, or until rib meat is tender. Let ribs cool, uncovered, in broth 30 minutes and transfer with a slotted spoon to a cutting board. Chop meat, discarding fat and bones.",
        "Strain broth through a fine sieve into a large saucepan and add chopped meat. If finishing and serving soup immediately, spoon off fat. For best results, chill soup, covered, overnight and discard fat.",
        "Add turnips and simmer, covered 10 minutes. Add noodles and simmer, covered, stirring occasionally, until tender, about 7 minutes. Soup may be prepared up to this point 2 days ahead (cool uncovered before chilling covered). Reheat gently.",
        "Slice remaining 3 scallions thin and stir into soup. Stir in sesame oil (if using)."
    ],
    "ingredients": [
        "2 1/2 pounds beef short ribs, cut between bones into pieces",
        "7 cups water",
        "1/3 cup soy sauce",
        "1/4 cup Scotch or medium-dry Sherry",
        "1 tablespoon sugar",
        "six 1/4-inch-thick diagonal slices fresh gingerroot",
        "8 scallions, trimmed",
        "3 large garlic cloves, chopped",
        "a 3-inch cinnamon stick",
        "1 teaspoon aniseed",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/2 pound turnips, peeled and cut into 3/4-inch cubes",
        "6 ounces egg noodles",
        "1 teaspoon Asian (toasted) sesame oil if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Scotch",
        "Beef",
        "Ginger",
        "Pasta",
        "Turnip",
        "Anise",
        "Cinnamon",
        "Clove",
        "Gourmet"
    ],
    "title": "Chinese Beef Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-beef-noodle-soup-11526"
}
