{
    "directions": [
        "Rinse and drain water chestnuts and coarsely chop. Diagonally cut snow peas into 1/2-inch-wide pieces and chop scallions. Separate lettuce leaves.",
        "In a bowl with your hands mix turkey, 1 teaspoon honey, 1 tablespoon each soy sauce, vinegar, and garlic, and 2 tablespoons gingerroot until just combined. Marinate turkey mixture 15 minutes.",
        "In a small bowl whisk together Worcestershire sauce, water, sugar, cornstarch, and remaining teaspoon honey, 3 tablespoons soy sauce, and 2 tablespoons vinegar. In a wok or large non-stick skillet heat vegetable oil over moderately high heat until hot but not smoking and saut\u2029 turkey mixture, stirring and breaking up lumps, until just cooked through, about 3 minutes. With a slotted spoon transfer turkey mixture to cleaned bowl. In wok or skillet stir-fry remaining tablespoon each garlic and gingerroot 15 seconds. Add water chestnuts and stir-fry 15 seconds. Add turkey mixture, soy-sauce mixture, snow peas, and scallions and stir-fry until sauce is thickened and snow peas are tender, about 3 minutes. Remove wok or skillet from heat and stir in sesame oil and salt and pepper to taste.",
        "Serve turkey mixture, mint, and cilantro on lettuce leaves accompanied by rice."
    ],
    "ingredients": [
        "an 8-ounce can water chestnuts",
        "1/2 cup snow peas",
        "4 scallions",
        "3 heads Bibb lettuce",
        "1 pound lean ground turkey",
        "2 teaspoons honey",
        "4 tablespoons soy sauce",
        "3 tablespoons seasoned rice vinegar",
        "2 tablespoons minced garlic",
        "3 tablespoons finely grated peeled fresh gingerroot",
        "1 tablespoon Worcestershire sauce",
        "1/2 cup water",
        "1 1/2 tablespoons sugar",
        "2 teaspoons cornstarch",
        "2 teaspoons vegetable oil",
        "1/2 teaspoon Asian sesame oil",
        "1 cup packed fresh mint sprigs",
        "1 cup packed fresh cilantro sprigs",
        "2 cups cooked white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "turkey",
        "Mint",
        "Cilantro",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Chinese Turkey in Jade",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-turkey-in-jade-101067"
}
