{
    "directions": [
        "Cut the beef across the grain into 1/4-inch slices. In a bowl, combine 2 Tbs. of the tamari and 3/4 tsp. of the sugar and stir to dissolve. Mix in half of the green onions, 1 1/2 tsp. of the sesame oil and a generous amount of black pepper. Add the beef and stir to coat. Set aside.",
        "In a food processor, combine the peanut butter, ginger, vinegar, red pepper flakes, the remaining 3 Tbs. tamari, the remaining green onions, 1 Tbs. of the sesame oil and the remaining 1 tsp. sugar. Add the hot water and process until well blended to make a sauce.",
        "Meanwhile, bring a large pot of salted water to a boil over high heat. Add the spaghetti and stir well. Cook, stirring frequently, until al dente, about 8 minutes. Drain, rinse briefly with cold water and drain well. Place in a warmed bowl. Add the remaining 1 Tbs. sesame oil and stir to coat. Stir in the bell pepper and sauce to taste. Stir to coat the noodles, then season with salt and black pepper.",
        "In a large, heavy fry pan over high heat, warm the vegetable oil. Working in batches, sear the beef in a single layer, about 20 seconds per side. Transfer to a cutting board and cut each piece in half lengthwise. Divide the noodles among 4 bowls, top with the beef and sprinkle with the cilantro. Serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free,",
        "by Kristine Kidd (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "3/4 lb. boneless beef top sirloin, trimmed, halved lengthwise\n  and partially frozen",
        "5 Tbs. gluten-free tamari",
        "1 3/4 tsp. sugar",
        "4 green onions, minced",
        "1 1/2 tsp. plus 2 Tbs. Asian sesame oil",
        "Freshly ground black pepper, to taste",
        "1/3 cup creamy old fashioned-style peanut butter",
        "2 Tbs. minced fresh ginger",
        "2 Tbs. balsamic vinegar",
        "1/2 tsp. red pepper flakes",
        "1/4 cup hot water",
        "Kosher salt, to taste",
        "10 oz. gluten-free spaghetti, such as Schar",
        "1 large red bell pepper, halved lengthwise and seeded, then\n  halved crosswise and cut into very thin slices",
        "1 Tbs. vegetable oil",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chinese-Style Peanut Noodles with Seared Beef",
    "url": "http://www.williams-sonoma.com/recipe/chinese-peanut-noodles-with-beef.html"
}
