{
    "directions": [
        "Whisk soy sauce, olive oil, hoisin sauce, and rice vinegar in large bowl to blend. Let dressing stand at room temperature while preparing noodles.",
        "Place sliced snow peas and bell pepper strips in medium bowl. Bring kettle or large saucepan of water to boil. Pour boiling water over snow pea mixture and let soak 10 seconds. Drain well. Rinse mixture with cold water and drain again. Place egg noodles in large bowl. Bring kettle or large saucepan of water to boil, then pour boiling water over noodles; stir noodles to separate. Let noodles soak 10 seconds. Drain well. Rinse noodles with cold water; drain again.",
        "Add snow pea mixture, egg noodles, smoked duck, cilantro leaves, green onion, and jalapeño to bowl with dressing. Toss well to coat. Divide noodle mixture among plates and serve.",
        "* Hoisin sauce is available in the Asian foods section of many supermarkets and at Asian markets.",
        "** Fresh Chinese egg noodles are available in the refrigerated section of Asian markets."
    ],
    "ingredients": [
        "2 tablespoons soy sauce",
        "2 tablespoons olive oil",
        "1 tablespoon hoisin sauce*",
        "1 tablespoon unseasoned rice vinegar",
        "3 1/2 ounces snow peas or sugar snap peas, thinly sliced lengthwise (about 1 1/2 cups)",
        "1 red bell pepper, cut into matchstick-size strips",
        "1 17-ounce (425-gram) package thin fresh Chinese egg noodles**",
        "1 pound smoked duck, turkey, or chicken, cut into 3x1/4-inch strips",
        "1/2 cup fresh cilantro leaves",
        "2 tablespoons thinly sliced green onion",
        "1 tablespoon thinly sliced jalapeño chile with seeds (preferably red)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Duck",
        "Poultry",
        "Vegetable",
        "Picnic",
        "Low Fat",
        "High Fiber",
        "Dinner",
        "Legume",
        "Potluck",
        "Noodle",
        "Sugar Snap Pea",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chinese Egg Noodles with Smoked Duck and Snow Peas",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-egg-noodles-with-smoked-duck-and-snow-peas-354302"
}
