{
    "directions": [
        "1. Using kitchen shears, cut through the shrimp shells two-thirds of the length down the back of the shrimp. Remove the legs and devein the shrimp, leaving the shells and tails on. In a medium bowl toss the shrimp with the lime juice for a few seconds. Rinse the shrimp, drain, and set on a plate lined with paper towels. With more paper towels pat the shrimp dry. In a small bowl combine the ketchup, rum, soy sauce, and ground white pepper.",
        "2. Heat a 14-inch flat-bottomed wok or 12-inch skillet over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in the oil, add the garlic and ginger, then, using a metal spatula, stir-fry 10 seconds or until the aromatics are fragrant. Push the aromatics to the sides of the wok, carefully add the shrimp and spread them evenly in one layer in the wok. Cook undisturbed 1 minute, letting the shrimp begin to sear. Sprinkle on the salt and stir-fry 30 seconds or until the shrimp begin to turn orange. Add the tomatoes, bell peppers, and onions and stir-fry 1 minute or until the shrimp have turned almost totally orange. Swirl the ketchup mixture into the wok and stir-fry 1 minute or until the shrimp are just cooked through and the sauce coats the shrimp. Stir in the cilantro."
    ],
    "ingredients": [
        "1 pound large shrimp",
        "Juice of 1/2 lime",
        "3 tablespoons ketchup",
        "3 tablespoons dark Jamaican rum",
        "2 teaspoons soy sauce",
        "1/4 teaspoon ground white pepper",
        "2 tablespoons peanut or vegetable oil",
        "1 tablespoon minced garlic",
        "1 tablespoon minced ginger",
        "1/2 teaspoon salt",
        "1 medium ripe tomato, cut into thin wedges",
        "1 large green bell pepper, cut into thin strips",
        "1 small onion, cut into thin wedges",
        "1 tablespoon finely chopped cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Wok",
        "Shellfish",
        "Stir-Fry",
        "Dinner",
        "Lunar New Year",
        "Seafood",
        "Shrimp",
        "Spirit",
        "Family Reunion",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Chinese Trinidadian Stir-Fried Shrimp with Rum",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-trinidadian-stir-fried-shrimp-with-rum-388610"
}
