{
    "directions": [
        "Peel broccoli stems with a vegetable peeler, then, keeping stems separate, cut stems, leaves, and florets diagonally into 1-inch pieces. Cook stem pieces in an 8-quart pot of (unsalted) boiling water 1 minute, then add leaves and florets and cook, stirring occasionally, until stems are crisp-tender, about 2 minutes more. Drain in a colander and rinse under cold running water to stop cooking. Drain broccoli well.",
        "Stir together chicken broth, cornstarch, sesame oil, sugar, salt, pepper, and 2 1/2 tablespoons rice wine in a bowl until combined well.",
        "Heat wok over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add 2 1/4 teaspoons oil, swirling it around wok. Add crabmeat and stir-fry 30 seconds. Add remaining 2 tablespoons rice wine, then stir-fry 30 seconds more and transfer to a bowl.",
        "Add remaining 2 1/4 teaspoons oil to wok and heat until it begins to smoke. Add scallion and ginger and stir-fry until fragrant, about 10 seconds. Stir sauce, then add to wok and simmer, stirring occasionally, until thickened, 1 to 2 minutes. Add broccoli and crabmeat, then toss lightly to combine and transfer to a platter. Serve immediately.",
        "*Available at Asian markets and ethnicgrocer.com."
    ],
    "ingredients": [
        "1 pound Chinese broccoli (1 large bunch; sometimes called Chinese kale)",
        "1 cup reduced-sodium chicken broth",
        "2 teaspoons cornstarch",
        "1 1/2 teaspoons Asian sesame oil",
        "1 teaspoon sugar",
        "3/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "4 1/2 tablespoons Chinese rice wine* or sake",
        "4 1/2 teaspoons canola or corn oil",
        "1/2 pound jumbo lump crabmeat, picked over and slightly flaked",
        "3 tablespoons minced scallion (white part only)",
        "2 tablespoons minced peeled fresh ginger",
        "Special equipment: a well-seasoned 14-inch flat-bottomed wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Leafy Green",
        "Shellfish",
        "Side",
        "Stir-Fry",
        "Quick & Easy",
        "Seafood",
        "Crab",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chinese Broccoli with Crabmeat",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-broccoli-with-crabmeat-231510"
}
