{
    "directions": [
        "1. In a large zippered plastic bag, combine the sugar, star anise, cinnamon, pepper, salt, wine, pineapple juice, soy sauces, and sesame oil. Seal the bag and shake to mix. Add the pork, seal and toss the bag back and forth to coat the pork slices. Refrigerate for at least 1 hour or, for best results, overnight.",
        "2. Soak a handful of mesquite chips or cinnamon sticks in a bowl of water. Heat the grill.",
        "3. While waiting for the grill to get hot, remove the pork from the refrigerator. Thread 4 to 5 pieces of pork onto each skewer. Repeat with the remaining pork. Transfer the remaining marinade to a bowl and set aside.",
        "4. Rake the hot coals into a mound on one side of the grill. Spray the pork generously with vegetable oil and lay the skewers on the rack directly over the hot coals. Sear the meat for a minute or two. Baste with the marinade and turn the skewers over. Repeat once or twice, or until the outside is slightly charred. Baste with the marinade and move the skewers to the empty side of the grill.",
        "5. Sprinkle the soaked mesquite or cinnamon sticks over the charcoal. Cover the grill and grill-smoke. Be sure to open the air vents in the top of the grill cover. Uncover the grill and baste the meat every 3 minutes, until the pork is cooked through, 11 to 12 minutes in all.",
        "6. Cool for 5 minutes before removing the pork from the skewers. Slice into thin bite-sized pieces and serve."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "1 star anise",
        "1 teaspoon cinnamon",
        "1 teaspoon freshly ground white pepper",
        "1/2 teaspoon sea salt",
        "1/4 cup Chinese rice wine (Shaoxing) or dry vermouth",
        "One 6-ounce can pineapple juice",
        "1 tablespoon dark soy sauce",
        "1 tablespoon soy sauce",
        "1 teaspoon sesame oil",
        "2 pounds pork tenderloin, sliced lengthwise into 1 1/2-inch-wide strips",
        "8 metal skewers",
        "Vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Pork Tenderloin",
        "Summer",
        "Grill/Barbecue",
        "Anise",
        "Cinnamon",
        "Sesame",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Chinese Barbecued Pork",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-barbecued-pork-107049"
}
