{
    "directions": [
        "With a cleaver or heavy chef's knife cut chicken into large pieces. Cut chicken through bones into 2-inch pieces. In a large kettle of boiling water blanch chicken 1 minute. In a colander drain chicken and rinse under cold water.",
        "With flat side of cleaver or knife lightly smash gingerroot and scallions. In cleaned kettle bring 10 cups water to a boil with chicken, gingerroot, scallions, rice wine or Sherry and simmer, uncovered, skimming froth occasionally, 2 hours. Pour broth through colander lined with triple thickness of cheesecloth into a large heatproof bowl, reserving chicken for another use. Broth may be made 3 days ahead, cooled completely, uncovered, and chilled, covered.",
        "In cleaned kettle bring broth to a boil. Add noodles and boil, stirring occasionally, 2 minutes. Stir in spinach and simmer, stirring once or twice, until spinach turns bright green and is just tender, about 3 minutes. Stir in chives and salt and pepper to taste and simmer 1 minute."
    ],
    "ingredients": [
        "a 3 1/2- to 4-pound chicken",
        "8 thin slices fresh gingerroot",
        "1 bunch scallions, cut crosswise into thirds",
        "10 cups water",
        "3/4 cup Chinese rice wine or medium-dry Sherry",
        "2 ounces dried rice-stick noodles (rice vermicelli)",
        "1/2 pound fresh spinach, coarse stems discarded and leaves washed, drained, and chopped coarse (about 4 packed cups)",
        "3/4 cup thinly sliced fresh garlic chives or regular fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Leafy Green",
        "Onion",
        "Pasta",
        "Poultry",
        "Lunar New Year",
        "Winter",
        "Gourmet"
    ],
    "title": "Chinese Chicken Noodle Soup with Spinach and Garlic Chives",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-chicken-noodle-soup-with-spinach-and-garlic-chives-14117"
}
