{
    "directions": [
        "In a shallow, medium bowl toss the chicken pieces with the soy sauce and wine. Let stand while you make the sauce.",
        "Using a vegetable peeler, remove 4 lengthwise strips of zest from 1 orange—each strip should be about 3/4 inch wide and 3 1/2 to 4 inches long. Arrange the zest in one layer between paper towels and microwave on high in 20-second increments until dry and brittle but not browned, 60 to 80 seconds total. Let the zest cool then finely chop it. If desired, use a Microplane to remove some of the remaining zest from the orange and reserve it for garnish. (If desired, zest the second orange for additional garnish.)",
        "Squeeze enough juice from both oranges to measure 1/2 cup. In a small bowl, whisk together the juice and 2 teaspoons cornstarch until the cornstarch is dissolved.",
        "In a 10-inch skillet, heat 1 tablespoon oil over moderate heat until hot but not smoking. Add the garlic, ginger, crushed red pepper, and dried orange zest and stir-fry until golden, about 30 seconds. Add the soy sauce, wine, vinegar, and sugar and stir until the sugar dissolves, about 5 seconds. Stir the orange juice–cornstarch mixture then add it to the skillet. Bring the sauce to a boil, stirring, then reduce the heat to low and simmer, uncovered, for 1 minute. Remove the skillet from the heat and set it aside while you fry the chicken.",
        "Line a large rimmed baking sheet with paper towels.",
        "In a 10-inch cast-iron skillet, heat 1/2 inch of oil until a deep-fry thermometer registers 365°F. Meanwhile, coat half of the chicken, a couple pieces at a time, in cornstarch, making sure they are well coated and gently knocking off any excess, then transfer to a plate. Carefully add all the coated chicken to the hot oil, spacing the pieces apart from each other. Fry the chicken, turning it once or twice, until deep golden, about 5 minutes. While frying, adjust the heat as necessary to keep the oil at 365°F. Using a metal spider or a slotted spoon, transfer the chicken as done to the paper-towel-lined baking sheet. Continue to coat and fry the remaining chicken in the same manner, returning the oil to 365°F between batches.",
        "Once the chicken is fried, place the skillet of reserved orange sauce over moderately low heat and bring it to a simmer, stirring and thinning the sauce with a little water if necessary. Add the chicken, and stir until thoroughly coated in sauce.",
        "Transfer the chicken to a serving dish and garnish with the scallions, and, if desired, the red chile slices and the freshly grated orange zest. Serve immediately with rice."
    ],
    "ingredients": [
        "1 pound boneless, skinless chicken thighs, patted dry and cut into 1 1/2-inch pieces",
        "1 teaspoon soy sauce",
        "1 teaspoon Chinese Shaoxing wine or dry sherry",
        "1/2 cup cornstarch",
        "About 2 cups canola oil for frying",
        "2 oranges",
        "2 teaspoons cornstarch",
        "1 tablespoon canola oil",
        "2 cloves garlic, minced",
        "2 teaspoons minced peeled fresh ginger (from 1-inch piece)",
        "1/8 to 1/4 teaspoon crushed red pepper",
        "1 tablespoon low-sodium soy sauce",
        "1 teaspoon Chinese Shaoxing wine or dry sherry",
        "1 teaspoon rice vinegar (not seasoned) or cider vinegar",
        "2 tablespoons sugar",
        "Thinly sliced scallion greens, for garnish",
        "Thinly sliced fresh red chile, for garnish (optional)",
        "Cooked rice for serving",
        "Equipment: 10-inch cast-iron skillet or other high-sided skillet (at least 2 inches deep), deep-fry thermometer, Microplane (for optional garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fry",
        "Quick & Easy",
        "Dinner",
        "Orange",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chinese Orange Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-orange-chicken-51168000"
}
