{
    "directions": [
        "Whisk the sugar and milk together in a large mixing bowl until the sugar is dissolved. Stir in the yeast, and let stand until a frothy layer forms on the milk, about 10 minutes. Stir in the flour, most of the beaten eggs (reserve about 1 tablespoon of egg in a small bowl for later), vegetable oil, and salt, mixing well until thoroughly combined.",
        "Turn the dough out onto a well-floured work surface, and knead until smooth and elastic, about 10 minutes. The dough should be slightly sticky. Place the dough into a large oiled bowl, cover with a damp cloth or plastic wrap, place the bowl in a warm spot, and let rise until doubled, 2 to 3 hours.",
        "Line a baking sheet with parchment paper.",
        "Remove the dough from the bowl, and knead it briefly to punch down, about 1 minute. Roll the dough out into a rope, and cut it into 12 equal-sized pieces. Roll each piece into a ball, and use your fingers to flatten each ball into a disc about 5 to 6 inches in diameter.",
        "Place about 2 tablespoons of your favorite bun filling in the center of the dough circle, and bring the edges of the dough up over the filling. Pinch and twist the top together to seal in the filling. Make sure there are no open spots. Place each filled bun seam-side down on the parchment paper while you finish making the rest of the buns. Cover the filled buns with plastic wrap, and let them rise for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Beat the 1 tablespoon of reserved beaten egg with the water to make an egg wash, and brush the top of each bun with the egg mixture. Sprinkle each bun with a few sesame seeds, and bake in the preheated oven until the tops are browned and shiny, turning the baking sheet around halfway through baking, for 20 to 30 minutes. Serve warm."
    ],
    "ingredients": [
        "1/2 cup white sugar",
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "1 tablespoon active dry yeast",
        "4 cups bread flour",
        "2 eggs, beaten (divided)",
        "6 tablespoons vegetable oil",
        "2 teaspoons salt",
        "2 teaspoons water",
        "1 teaspoon sesame seeds for garnish (divided) (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chinese Sweet Bun Dough",
    "url": "http://allrecipes.com/recipe/133909/chinese-sweet-bun-dough/"
}
