{
    "directions": [
        "In a bowl, combine the black rice, oranges, orange juice, pumpkin seeds, orange zest, salt, and chipotle. Gently mix in the avocado. Add more salt, if needed.",
        "Place a lettuce cup on each plate and spoon the salad into the lettuce cups. Garnish with orange wedges, if you wish.",
        "A very high-quality Chinese black rice is distributed by Lotus Foods under the registered trademark name \"Forbidden Black Rice.\" This rice bleeds beet­red when you rinse it and, once cooked, ends up a striking deep burgundy. It holds its shape very well and is pleasantly chewy. With a subtle sweetness and a rich taste, it's a stunning rice that has everything going for it. Put it high on your list of rices to try.",
        "Rinse the rice. Combine the rice, water, and salt (if using) in a heavy Dutch oven or saucepan. Over high heat, bring to a boil. Skim off any foam floating on the surface. Cover, reduce the heat, and simmer until the rice is tender, 30 to 35 minutes. Quickly drain off any excess water. Return the rice to the hot pot, cover, and let sit for 5 minutes."
    ],
    "ingredients": [
        "2 cups cooked Basic Chinese Black Rice (see note below)",
        "2 cups diced peeled oranges",
        "1/4 cup freshly squeezed orange juice",
        "1/4 cup raw, unsalted pumpkin seeds, toasted",
        "1 1/2 teaspoons grated orange zest",
        "1/4 teaspoon salt, plus more to taste",
        "1/8 teaspoon ground chipotle",
        "1 ripe Hass avocado, peeled, pitted, and cut into 1/2-inch dice",
        "4 large lettuce cups or leaves",
        "Unpeeled orange wedges, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Fruit",
        "Rice",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Orange",
        "Avocado",
        "Vegan",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chinese Black Rice, Orange, and Avocado Salad",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-black-rice-orange-and-avocado-salad-51195410"
}
