{
    "directions": [
        "Cook chopped pork in a wok over medium heat. After 3 minutes of cooking add chopped shrimp if desired. Cook until pork is no longer pink. Drain, season with salt and set aside to cool.",
        "Mix together green onions, ginger, soy sauce, rice wine, oil, sugar, and pepper. Stir in minced meat.  Stir in water and mix thoroughly.  Chill in freezer for 2 hours, or in refrigerator overnight to firm up and blend flavors.",
        "Prepare dough for Chinese Steamed Buns.",
        "Shape dough into balls.  Roll each out into a circle, (like Won-Ton wrappers).  Put 1 tablespoonful of prepared meat mixture in the center of each circle, and wrap dough around filling.  Place seams down onto wax paper squares.   Let stand until doubled, about 30 minutes.",
        "Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling.  Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns.  At least 2 inches space should be left between steam-plate and the wok.  Cover wok with lid.  Steam buns over boiling water for 15 to 20 minutes.",
        "REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked."
    ],
    "ingredients": [
        "8 ounces chopped pork",
        "1 (4 ounce) can shrimp, drained and chopped",
        "1 teaspoon salt",
        "2 green onions",
        "1 tablespoon chopped fresh ginger root",
        "1 tablespoon light soy sauce",
        "1 tablespoon rice wine",
        "1 tablespoon vegetable oil",
        "1 tablespoon white sugar",
        "ground black pepper to taste",
        "2 1/2 tablespoons water",
        "1 recipe Chinese Steamed Buns"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chinese Steamed Buns with Meat Filling",
    "url": "http://allrecipes.com/recipe/7031/chinese-steamed-buns-with-meat-fillin/"
}
