{
    "directions": [
        "Stir chicken, soy sauce, Sherry, and 1 tablespoon sesame oil in medium bowl to blend. Let stand 20 minutes or refrigerate up to 2 hours.",
        "Whisk garlic, tahini, ginger, sugar, vinegar, and chili sauce in small bowl.",
        "Heat remaining 1 tablespoon sesame oil in heavy large pot over medium-high heat. Add cabbage and green onions and sauté until cabbage is tender, about 5 minutes. Add broth and bring to boil. Add chicken with marinade and tahini-garlic mixture. Reduce heat to low and simmer until chicken is cooked through, about 5 minutes. (Can be made 1 day ahead. Cool slightly; cover and refrigerate. Bring to simmer before continuing.)",
        "Cook noodles in large pot of boiling salted water until tender, about 5 minutes. Drain. Add to soup in pot. Stir in half of cilantro. Season soup with salt and pepper. Sprinkle with remaining cilantro.",
        "Sold at Middle Eastern markets, natural foods stores and some supermarkets.",
        "** Available at Asian markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "1 pound skinless boneless chicken breast halves, cut crosswise into thin strips",
        "3 tablespoons soy sauce",
        "2 tablespoons dry Sherry",
        "2 tablespoons oriental sesame oil",
        "3 garlic cloves, minced",
        "3 tablespoons tahini (sesame seed paste)*",
        "2 tablespoons minced peeled fresh ginger",
        "1 tablespoon sugar",
        "1 tablespoon seasoned rice vinegar",
        "1 1/2 teaspoons chili-garlic sauce**",
        "4 cups chopped Napa cabbage (from 1 head)",
        "6 green onions, thinly sliced",
        "8 cups canned low-salt chicken broth",
        "1 14-ounce package fresh yakisoba noodles or Chinese pan-fry noodles",
        "1/2 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Onion",
        "Pasta",
        "Poultry",
        "Dinner",
        "Lunch",
        "Winter",
        "Cabbage",
        "Noodle",
        "Sesame"
    ],
    "title": "Chinese Chicken Noodle Soup with Sesame and Green Onions",
    "url": "http://www.epicurious.com/recipes/food/views/chinese-chicken-noodle-soup-with-sesame-and-green-onions-106192"
}
