{
    "directions": [
        "Place the warm water in a large bowl, and sprinkle the yeast over the top. Stir in 1 cup of the flour, and mix thoroughly. Cover with a cloth, and let stand until bubbles appear, about 20 minutes.",
        "Dissolve sugar and shortening in boiling water, and allow to cool to lukewarm. Stir into the yeast mixture along with the remaining flour. When the dough becomes too stiff to stir, turn out onto a lightly floured surface, and knead until smooth, about 10 minutes. Coat a large bowl with sesame oil, and place the dough inside. Turn over to coat, and cover the bowl with a damp cloth. Let rise in a warm place until doubled in size.",
        "Heat 2 tablespoons of oil in a wok over medium-high heat. Add green onions and garlic, and stir-fry for about 30 seconds. Add pork, and fry for a minute, then stir in the soy sauce, oyster sauce, and sugar. Dissolve cornstarch in 2 tablespoons of water, then stir the mixture into the pork. Cook, stirring constantly until the pork is coated with a thickened glaze. Remove to a bowl, and allow to cool.",
        "Remove the dough from the bowl, and roll it out into one long log. Slice the log into 1 inch pieces. Flatten each piece into a 3 inch circle using the palm of your hand or a rolling pin. Place 2 tablespoons of the pork filling onto the center of each circle, and gather up the edges around the filling and pinch together to close the bun. Place each bun seam side down onto a square of aluminum foil. Cover with a towel, and let rise for about 1 hour.",
        "Bring a couple inches of water to boil in a wok. Place a few buns at a time in a steamer, such as a bamboo steamer for a wok, or a fitted steam tray. Cover, and steam buns over briskly boiling water for 10 minutes. Repeat with remaining buns."
    ],
    "ingredients": [
        "1 (.25 ounce) envelope active dry yeast",
        "1 cup lukewarm water",
        "4 1/2 cups all-purpose flour",
        "1/4 cup white sugar",
        "2 tablespoons shortening or vegetable oil",
        "1/2 cup boiling water",
        "2 tablespoons sesame oil",
        "2 tablespoons vegetable oil",
        "1 green onion, thinly sliced",
        "1 clove garlic, minced",
        "1/2 pound Asian barbequed pork, cubed",
        "2 tablespoons light soy sauce",
        "2 tablespoons oyster sauce",
        "1 tablespoon white sugar",
        "1 tablespoon cornstarch",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chinese Steamed Buns with Barbecued Pork Filling",
    "url": "http://allrecipes.com/recipe/70830/chinese-steamed-buns-with-barbecued-p/"
}
