{
    "directions": [
        "Whisk together the eggs, 2 teaspoons of cornstarch, water, and 1/4 teaspoon of salt in a bowl, and let stand for 25 minutes.",
        "Mix the pork, water chestnuts, green onions, 1 teaspoon cornstarch, ginger, 1/2 teaspoon sugar, 1/2 teaspoon salt, and toasted sesame oil in a bowl, kneading the mixture till well-combined. Cover the bowl with plastic wrap, and let rest in refrigerator until needed.",
        "To make wrappers, spray a nonstick skillet with cooking spray and heat over medium heat. Slowly pour about 1 tablespoon of the egg mixture into the skillet, and tilt the skillet to spread the batter, forming a flat circle about 3 inches in diameter. Let the egg wrapper cook until firm on the bottom but still moist on top, about 1 minute. Stack the finished egg wrappers on a wax-paper-lined plate as you finish them, and let cool.",
        "Stir together the chicken broth, soy sauce, sherry, 1/4 teaspoon salt, 1/2 teaspoon sugar, and black pepper in a saucepan, and heat to a simmer over medium-low heat.",
        "Place about 1 teaspoon of the pork filling into the center of each wrapper, fold the wrapper over to make a half-moon shape, and gently press the wrapper together to seal. Drop the filled dumplings into the seasoned chicken broth and simmer them until the filling is cooked through, 10 to 15 minutes. Serve with broth."
    ],
    "ingredients": [
        "4 eggs",
        "2 teaspoons cornstarch",
        "1 teaspoon water",
        "1/4 teaspoon salt",
        "3 ounces ground pork",
        "3 water chestnuts, minced",
        "1 1/2 teaspoons finely chopped green onions",
        "1 teaspoon cornstarch",
        "1/2 teaspoon finely shredded fresh ginger",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon toasted sesame oil",
        "3/4 cup chicken broth",
        "1 tablespoon soy sauce",
        "1/2 teaspoon dry sherry",
        "1/4 teaspoon salt",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chinese Egg Dumplings",
    "url": "http://allrecipes.com/recipe/82204/chinese-egg-dumplings/"
}
