{
    "directions": [
        "Preheat oven to 350°F. Rub beets with 1 teaspoon olive oil and season with 1/4 teaspoon salt. Roast on a baking sheet until tender, about 50 to 60 minutes. Let cool, then peel. Cut the beets into medium chunks and set aside.",
        "Toast the cumin seeds in a dry skillet until fragrant, 1 to 2 minutes, then grind into a powder, preferably with a mortal and pestle.",
        "In a small sauté pan over medium low heat, heat 2 teaspoons olive oil and sweat garlic and shallot until tender, 4 to 5 minutes.",
        "In a blender or a food processor, combine the beets, 1/4 cup olive oil, 1/2 teaspoon salt, cumin, garlic, shallot, yogurt, and lime. Continue pulsing until very smooth. This recipe yields about 2 cups.",
        "Spoon borani into a serving bowl. Sprinkle with feta, sesame seeds, and finishing sea salt and drizzle with extra virgin olive oil. Serve with baguette or crackers."
    ],
    "ingredients": [
        "3 medium chioggia or candy striped beets",
        "1/4 cup plus 3 teaspoons extra virgin olive oil, divided",
        "3/4 teaspoon kosher salt, divided",
        "1/2 teaspoon cumin seeds",
        "1 clove garlic, thinly sliced",
        "1/2 medium shallot, thinly sliced",
        "1 cup whole milk Greek yogurt",
        "2 tablespoons lime juice",
        "2 ounces fresh goats milk feta, crumbled (about 1/4 cup)",
        "1 tablespoon sesame seeds, toasted",
        "fleur de sel or Jacobsen salt, more for serving",
        "grilled or toasted baguette or seeded crackers, for serving",
        "a mortar and pestle or a spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Yogurt",
        "Feta",
        "Beet",
        "Lime Juice",
        "Cumin"
    ],
    "title": "Chioggia Beet Borani with Feta and Toasted Sesame Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/chioggia-beet-borani-with-feta-and-toasted-sesame-seeds-51243230"
}
