{
    "directions": [
        "To grill the pork loin, preheat a grill over high heat, or to roast, preheat the oven to 400ºF.",
        "Combine the kiwis, blueberries, cilantro onion, and vinegar in a large bowl. Add 1/4 teaspoon of the salt and toss well. Set the salsa aside.",
        "Place the paprika or chipotle chile powder on a plate along with the turmeric, cumin, the remaining 3/4 teaspoon salt, and the black pepper. Roll the pork loin in the spice mixture to coat. Drizzle the pork with the oil.",
        "Grease the grill with grapeseed oil. Adjust the grill flame setting to medium to medium-low.",
        "Place the loin on the grill and cook, turning often, until no longer translucent inside and cooked through, or until it registers 145ºF on an instant-read thermometer, 20–25 minutes. Let the loin rest for 5 minutes before slicing, then serve with the salsa.",
        "Place the pork in a 7-by-11–inch baking dish and roast on the lower rack, uncovered, for 35–40 minutes until cooked through and no longer pink in the center, and it registers 145ºF on an instant-read thermometer. Let the loin rest for 5 minutes before slicing, then serve with the salsa."
    ],
    "ingredients": [
        "2 kiwis, peeled and diced",
        "1 pint blueberries, chopped",
        "1/2 cup cilantro leaves, chopped",
        "1/4 cup  minced red onion",
        "2 tablespoons balsamic vinegar",
        "1 teaspoon salt",
        "3/4 teaspoon paprika or chipotle chile powder",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon freshly ground black pepper",
        "One (2-pound) center-cut pork loin",
        "2 tablespoons grapeseed oil, plus more for the grill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Pork",
        "Roast",
        "Grill",
        "Kiwi",
        "Blueberry",
        "Cilantro",
        "Summer",
        "Dinner",
        "Spring",
        "Wheat/Gluten-Free",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chipotle Pork Loin with Blueberry–Kiwi Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-pork-loin-with-blueberrykiwi-salsa"
}
