{
    "directions": [
        "In a bowl toss together cheeses and cornstarch.",
        "Rub inside of a heavy 3- to 4-quart saucepan with garlic halves, leaving garlic in pan, and add wine and lemon juice. Bring liquid just to a boil and stir in cheese mixture by handfuls. Bring mixture to a bare simmer over moderate heat, stirring, and stir in kirsch, nutmeg, chilies, and pepper to taste. Transfer fondue to a fondue pot and set over a low flame.",
        "Stir in fried shallots, scallions, and/or bacon if using and serve fondue with accompaniments for dipping. (Stir fondue often to keep combined.)",
        "In a heavy 10- to 12-inch skillet cook shallots in oil moderately high heat, stirring, until golden brown. Transfer shallots with a slotted spoon to paper towels to drain and season with salt. Makes about 2/3 cup."
    ],
    "ingredients": [
        "1/2 pound finely diced Gruyère cheese (about 2 cups)",
        "1/2 pound finely diced Emmenthal cheese (about 2 cups)",
        "1 1/2 tablespoons cornstarch",
        "2 large garlic cloves, halved",
        "1 1/3 cups dry white wine",
        "1 tablespoon fresh lemon juice",
        "2 to 3 tablespoons kirsch",
        "freshly nut nutmeg to taste if desired",
        "3 canned whole chipotle chilies in adobo*, or to taste, minced (about 1 1/2 tablespoons)",
        "fried shallots, thinly sliced scallion greens, and/or crumbled cooked bacon for stirring into fondue is desired",
        "1 1/2 cups thinly sliced shallots (about 8 large)",
        "4 tablespoons vegetables oil",
        "assorted cooked vegetables such as broccoli, carrots, pearl onions, and potatoes",
        "bread sticks",
        "cubes of day-old French, Italian, or sourdough bread",
        "*available at Hispanic markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Cocktail Party",
        "Hot Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Chipotle Cheese Fondue",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-cheese-fondue-11485"
}
