{
    "directions": [
        "Place the vinegar, onion, garlic, salt and water in a large pot over high heat and bring to a boil. Add the ribs, reduce the heat to medium and cover with a lid. Simmer for 30–40 minutes or until the ribs are tender.",
        "While the ribs are cooking, make the chipotle glaze. Mix to combine the chipotle chiles, onion flakes, Tabasco, cocoa powder, maple syrup, sugar and salt.",
        "Remove the ribs from the cooking liquid and place in a large deep-sided tray or pan. While the ribs are still hot, rub the chipotle glaze evenly over the ribs to coat. Cover with plastic wrap and refrigerate for 30 minutes until cool or overnight.",
        "Preheat oven to 425°F. Place the ribs on wire racks set over 2 rimmed baking sheets lined with parchment paper. Roast for 20 minutes, brushing with glaze every 5 minutes, until golden and caramelized. Serve with lime wedges, pickled jalapeño peppers and the Corn and Jalapeño Chile Flatbreads, if desired."
    ],
    "ingredients": [
        "2 cups white wine vinegar",
        "1 yellow onion, quartered",
        "1 head of garlic, halved crosswise",
        "2 tablespoons table salt",
        "10 1/2 cups water",
        "4 1/2 pounds (4 racks) American-style pork ribs",
        "Lime wedges and pickled jalapeño peppers, to serve",
        "Corn and Jalapeño Chile Flatbreads, to serve, optional",
        "1 (7-ounce) can chipotle chiles in adobo sauce",
        "2 tablespoons onion flakes",
        "1 tablespoon Tabasco sauce",
        "1 tablespoon Dutch cocoa powder",
        "1/2 cup maple syrup",
        "1/2 cup dark brown sugar",
        "1 tablespoon sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Pork Rib",
        "Hot Pepper",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chipotle-Glazed Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-glazed-ribs-56390072"
}
