{
    "directions": [
        "For the salsa: Heat the canola oil in a medium heavy-bottomed skillet over medium-high heat. Add the tomatoes, garlic and onions and saute until golden brown, 10 minutes. Add the chipotles and saute for another minute.",
        "Add the skillet ingredients along with 1 tablespoon salt and 1 teaspoon black pepper to a blender and process until smooth. Return the mixture to the skillet and cook over medium-low heat for 5 minutes; season with additional salt and pepper. Keep warm.",
        "For the tortilla chips: Heat 2 inches of oil in a large, low Dutch oven until a deep-fry thermometer inserted in the oil registers 375 degrees F. While heating, stack the tortillas and cut the stack into 8 triangles.",
        "Working in batches, fry the tortilla triangles until crisp and golden in color, about 2 minutes per side. Remove the chips from the oil and drain on a paper towel-lined baking sheet; season with salt.",
        "Add the tortilla chips to the skillet with the warm salsa, making sure all the chips are fully coated in the salsa. Transfer to a serving dish. Top with fried eggs if desired, and sprinkle with the queso fresco. Garnish with thinly sliced red onions, Mexican crema and chopped cilantro."
    ],
    "ingredients": [
        "3 tablespoons canola oil",
        "10 Roma tomatoes (about 2 1/4 pounds), roughly chopped",
        "2 cloves garlic, roughly chopped",
        "1/2 yellow onion, roughly chopped",
        "2 canned chipotle chiles in adobo sauce",
        "Salt and freshly ground black pepper",
        "Vegetable oil, for frying",
        "Sixteen 6-inch corn tortillas",
        "Salt",
        "6 fried eggs, for serving, optional",
        "1/4 cup crumbled queso fresco",
        "Thinly sliced red onions, for garnish",
        "Mexican crema, for garnish",
        "Chopped fresh cilantro, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salsa",
        "Chile Peppers",
        "Vegetable",
        "Tomato",
        "Appetizer",
        "Main Dish Recipes",
        "Deep-Frying"
    ],
    "title": "Chipotle Chilaquiles",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/chipotle-chilaquiles"
}
