{
    "directions": [
        "Marinate the steak",
        "Place the steak on a plate, brush both sides with the 2 Tbs. olive oil, and season both sides generously with salt and pepper. Let stand for 30 minutes.",
        "Make the dressing and corn salsa",
        "Meanwhile, in a blender, combine the chipotle chilies, the 1/4 cup olive oil, half of the lime juice, the vinegar, garlic, water, 1/4 tsp. of the salt and a pinch of pepper. Process until smooth.",
        "In a bowl, toss together the corn, radishes, tomatoes, cilantro, the remaining lime juice and the remaining 1/4 tsp. salt.",
        "Cook the steak and assemble the salad",
        "Prepare a medium-hot fire in a grill. Alternatively, preheat a stovetop grill pan over medium-high heat.",
        "Place the steak on the grill rack or in the grill pan and cook, turning every 4 minutes, about 8 minutes total per side for medium-rare. Transfer the steak to a cutting board and let stand for 5 to 10 minutes. Cut the steak on the diagonal across the grain into thin slices. Arrange the lettuce on individual plates and top with the steak and corn salsa. Drizzle with the dressing and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Salad,",
        "by Brigit L. Binns (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1 boneless sirloin or rib-eye steak, about 1 1/4 lb. and 1 1/2 inches thick",
        "2 Tbs. plus 1/4 cup olive oil",
        "Salt, to taste, plus 1/2 tsp.",
        "Freshly ground pepper, to taste",
        "1/4 cup canned chipotle chilies in adobo, with sauce",
        "Juice of 2 limes",
        "1 Tbs. white wine vinegar",
        "1 large garlic clove, sliced",
        "1 Tbs. water",
        "Kernels from 2 ears of corn (about 2 cups)",
        "6 radishes, chopped",
        "4 plum tomatoes, chopped",
        "1/4 cup minced fresh cilantro",
        "2 heads romaine lettuce, pale inner leaves only, torn into bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chipotle Beef and Corn Salad",
    "url": "http://www.williams-sonoma.com/recipe/chipotle-beef-and-corn-salad.html"
}
