{
    "directions": [
        "Combine coffee, chile powder, 2 tsp. salt, 1 tsp. brown sugar, and 1/2 tsp. coriander in a wide shallow bowl. Coat steaks evenly with rub. Let rest at room temperature 1–2 hours.",
        "Prepare a grill for medium-high heat or heat grill pan over medium-high; oil grate or pan. Grill steaks, turning occasionally, until lightly charred and an instant-read thermometer inserted into the center registers 120°F, 8–10 minutes for medium-rare. Transfer to a cutting board; let rest at least 15 minutes before thinly slicing.",
        "Meanwhile, lightly brush corn and tomatoes with oil. Grill, turning often, until tender and charred in spots, 5–10 minutes for tomatoes and 10–15 minutes for corn. Let cool slightly. Transfer tomatoes to a large bowl. Cut kernels from cobs and transfer to bowl with tomatoes.",
        "Whisk lime juice and remaining 3 Tbsp. oil, 1 tsp. salt, 1/2 tsp. brown sugar, and 1/2 tsp. coriander in a small bowl. Pour over tomatoes and corn. Add romaine, pickled onions, cheese, and 1/2 cup cilantro and toss to combine. Top with sliced steak and more cilantro."
    ],
    "ingredients": [
        "2 teaspoons finely ground coffee",
        "1 teaspoon chipotle chile powder",
        "3 teaspoons kosher salt, divided",
        "1 1/2 teaspoons brown sugar, divided",
        "1 teaspoon ground coriander, divided",
        "2 (8–10-ounce) New York strip steaks",
        "3 tablespoons olive oil, plus more for brushing",
        "2 ears of corn, husked",
        "1 pint cherry tomatoes",
        "3 tablespoons fresh lime juice (from about 2 limes)",
        "2 heads of romaine hearts, torn (about 8 cups)",
        "3/4 cup Pickled Onions",
        "1/2 cup crumbled Cotija or feta cheese (about 2.5 ounces)",
        "1/2 cup coarsely chopped cilantro, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Salad",
        "Coffee",
        "Chile Pepper",
        "Cheese",
        "Cilantro",
        "Lettuce",
        "Coriander",
        "Corn",
        "Grill",
        "Lime Juice",
        "Flaming Hot Summer"
    ],
    "title": "Chipotle-Coffee Steak Salad With Grilled Corn and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-coffee-steak-salad-with-grilled-corn-and-tomatoes"
}
