{
    "directions": [
        "Stir together the chipotle chile powder, garlic powder, salt, and cracked black pepper in a shallow bowl. Brush the tilapia fillets with the canola oil, and press into the spice mixture to coat, and set aside. Make the salsa by stirring together the mango, jalapeno, red onion, 1 clove garlic, cilantro, and lime juice in a separate bowl, and set aside. Make the aioli by stirring together the chipotle puree, 1 clove garlic, and mayonnaise in a small bowl, and set aside.",
        "Bring the black beans and 2 cloves of garlic to a simmer in a saucepan with a pinch of salt. Cover, and cook over low heat for 20 minutes. Meanwhile, heat a large skillet over medium-high heat, and cook the tilapia until opaque in the center, and crispy on both sides, about 7 minutes. Heat the tortillas in a skillet over medium heat, and keep warm.",
        "To serve, place the tortillas on a plate, spoon on some Spanish rice and black beans. Top with some of the coleslaw mix, hot tilapia, and a spoonful of the mango-cilantro salsa. Top with a dollop of chipotle aioli to serve."
    ],
    "ingredients": [
        "3 tablespoons chipotle chile powder",
        "1 teaspoon garlic powder",
        "1 tablespoon salt",
        "1 tablespoon cracked black pepper",
        "1 pound tilapia fillets, cut in half lengthwise",
        "1/4 cup canola oil",
        "1 mango - peeled, seeded and diced",
        "1 jalapeno pepper, seeded and minced",
        "1 small red onion, finely chopped",
        "1 clove garlic, minced",
        "1 bunch cilantro, chopped",
        "1 tablespoon lime juice",
        "1 tablespoon pureed chipotle peppers in adobo sauce",
        "1 clove garlic, minced",
        "1/4 cup mayonnaise",
        "2 (15 ounce) cans black beans, rinsed and drained",
        "2 cloves garlic, minced",
        "1 pinch salt",
        "3 cups hot cooked Spanish rice",
        "8 (6 inch) whole wheat tortillas",
        "1 (8.5 ounce) package coleslaw mix"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chipotle Tilapia Tacos with Mango-Cilantro Salsa",
    "url": "http://allrecipes.com/recipe/161462/chipotle-tilapia-tacos-with-mango-cil/"
}
