{
    "directions": [
        "Heat your grill to medium-high",
        "Whisk together the honey, chipotle puree, 1 tablespoon of the mustard, 1 tablespoon of the ancho powder, 1 teaspoon salt, and 2 tablespoons of the oil in a small bowl. Divide the glaze evenly between 2 bowls, one small, the other large.",
        "Stir together the remaining 3 tablespoons of ancho powder with the coriander, cumin, and paprika in a small bowl.",
        "Rinse the chicken wings under cold water and pat dry with paper towels. Cut the tips off the wings and discard (or freeze and use for making chicken stock). Cut each wing into 2 pieces through the joint.",
        "Place the chicken wings in a large bowl, add the spice rub and the remaining 2 tablespoons oil, and toss to coat. Season with salt and pepper and place the wings on the grill in an even layer. Grill until golden brown and slightly charred, 4 to 5 minutes. Reduce the heat of the grill to medium, turn the wings over, and close the lid of the grill. Continue grilling until just cooked through, 15 to 20 minutes longer, brushing with the small bowl of glaze every few minutes and turning once during the last 10 minutes of cooking.",
        "Transfer the wings to the large bowl, brush with the reserved glaze, and toss to coat. Transfer to a platter and sprinkle with the sesame seeds and green onions."
    ],
    "ingredients": [
        "1 cup honey",
        "2 to 3 tablespoons pureed canned chipotle chiles in adobo",
        "2 tablespoons Dijon mustard",
        "4 tablespoons ancho chile powder",
        "Kosher salt and freshly ground black pepper",
        "4 tablespoons canola oil",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cumin",
        "2 teaspoons Spanish paprika",
        "3 pounds chicken wings",
        "2 tablespoons sesame seeds, toasted",
        "3 green onions, white and green parts, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Cinco de Mayo",
        "Backyard BBQ",
        "Grill",
        "Grill/Barbecue",
        "Honey",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chipotle-Honey–Glazed Chicken Wings with Toasted Sesame Seeds and Green Onion",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-honey-glazed-chicken-wings-with-toasted-sesame-seeds-and-green-onion-363309"
}
