{
    "directions": [
        "Preheat broiler.",
        "Soak ancho chiles in boiling water (1 cup), 5 minutes.",
        "While chiles soak, broil tomatoes, onion slice, and garlic on a foil-lined rimmed baking sheet 3\"-4\" from heat, turning once, until lightly charred, 5-7 minutes.",
        "Drain chiles, discarding soaking liquid, and add to blender with tomatoes, onion, garlic, chipotles with sauce, cumin, 1/2 teaspoon salt, and cold water (2 tablespoons). Purée until smooth.",
        "Preheat oven to 350°F. Wrap 2 stacks of tortillas in foil; warm in oven while finishing filling.",
        "Cook potatoes in a 3- to 4-quart pot of well-salted boiling water until just tender but not falling apart, 5-7 minutes. Drain.",
        "Coarsely grind chicken in a meat grinder or food processor (or use pre-ground meat).",
        "Heat oil in a 12\" heavy skillet over medium-high heat until it shimmers. Add chile purée (it will splatter) and cook, stirring, 4 minutes (sauce will thicken).",
        "Add ground chicken and cook, stirring and breaking up clumps, 1 minute. Cover skillet and reduce heat; simmer, stirring occasionally, until chicken is cooked through, about 4 minutes.",
        "Gently stir in potatoes and reheat.",
        "Serve chicken and potatoes with warm tortillas and accompaniments."
    ],
    "ingredients": [
        "2 dried ancho chiles, stemmed, seeded, and torn into pieces",
        "1 cup boiling water",
        "1/2 pound small (about 2\" diameter) tomatoes",
        "1 (1/2\"-thick) slice from middle of a large white onion",
        "3 garlic cloves, peeled",
        "1 tablespoon chopped canned chipotle chiles in adobo, including some of adobo",
        "1/2 teaspoon ground cumin",
        "2 tablespoons cold water",
        "12 fresh corn tortillas",
        "1 (1/2-pound) Yukon Gold potato, peeled and cut into 1/2\" cubes",
        "1 pound chilled skinless boneless chicken thighs, cut into roughly 1 1/2\" pieces",
        "2 tablespoons olive oil",
        "guacamole (or use store-bought), crumbled queso fresco or ricotta salata, sliced radishes, lime wedges, cilantro sprigs, tomato salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Potato",
        "Tomato",
        "Broil",
        "Sauté",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Tortillas",
        "Chile Pepper",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chipotle Chicken Tacos with Potatoes and Guacamole",
    "url": "http://www.epicurious.com/recipes/food/views/chipotle-chicken-tacos-with-potatoes-and-guacamole-51174420"
}
