{
    "directions": [
        "Stir together yeast, 1/4 cup milk, and sugar in a large bowl until sugar is dissolved, then let stand until foamy, about 10 minutes. (If yeast doesn't foam, discard and start over.) Add 1 1/4 cups milk and rice flour, whisking until smooth. Cover bowl with plastic wrap and let sponge rise in a warm place until bubbly, about 1 hour.",
        "Meanwhile, whisk together yolks, sour cream, 2 tablespoons butter, and remaining cup milk in a bowl.",
        "Whisk yolk mixture into bubbly sponge, then add all-purpose flour and sea salt, whisking until smooth. Stir in chives.",
        "Beat egg whites in a bowl with an electric mixer until they just hold stiff peaks, then fold into batter. Let stand 30 minutes.",
        "Put a buttered large baking sheet in oven and preheat oven to 200°F.",
        "Brush some of remaining butter onto bottom of a 10-inch nonstick skillet and heat over moderate heat until hot but not smoking. Add 1 cup batter and cook until underside is lightly browned and surface is covered with holes, about 2 minutes. Turn over with a wide spatula and cook until golden on bottom and puffed, about 1 minute more. Brush top with some melted butter, then transfer to buttered baking sheet. Cover loosely with foil and keep warm in middle of oven. Make 5 more blini in same manner (you'll have 2 extra), stacking them on baking sheet in 2 piles with sheets of foil between blini."
    ],
    "ingredients": [
        "1 (1/4-ounce) package active dry yeast (2 1/2 teaspoons)",
        "2 1/2 cups warm whole milk (100–110°F)",
        "1 teaspoon sugar",
        "2/3 cup rice flour",
        "3 large eggs, separated",
        "1/4 cup sour cream",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "1 2/3 cups all-purpose flour",
        "1 teaspoon fine sea salt",
        "1/3 cup chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Cocktail Party",
        "Vegetarian",
        "Pan-Fry",
        "Chive",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Chive Blini",
    "url": "http://www.epicurious.com/recipes/food/views/chive-blini-107020"
}
