{
    "directions": [
        "Heat a 12-inch heavy skillet (not nonstick; preferably cast-iron) over medium heat until hot, then brown ears of corn, in batches if necessary. Cut kernels from cobs and set aside. Put cobs and silk into a medium pot. Remove skin, bone, and tendons from turkey (reserve meat) and add to cobs along with water, 1 onion quarter, and 1 teaspoon salt, then simmer briskly until liquid is reduced to about 3 cups, 30 to 40 minutes. Strain broth through a sieve into a bowl, discarding solids.",
        "Cut turkey meat into 1/2-inch pieces.",
        "Coarsely chop remaining onion, then cook in butter with 1/4 teaspoon each of salt and pepper in skillet over medium heat, stirring occasionally, until softened, 4 to 5 minutes. Stir in okra and cook, stirring occasionally, until tender, 5 to 10 minutes. Sprinkle flour over vegetables and cook, stirring, 1 minute. Stir in corn broth and milk. Bring to a boil, stirring, then boil over medium heat, stirring occasionally, until slightly thickened, about 2 minutes.",
        "Stir in corn kernels and turkey, then gently simmer until heated through, 1 to 2 minutes.",
        "Preheat oven to 450°F with rack in middle.",
        "Sift together flour, baking powder, baking soda, and 1 teaspoon each of salt and pepper into a bowl. Stir in chives. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk and stir with a fork until a dough just forms (dough will be moist).",
        "Turn out dough onto a well-floured surface, lightly dust dough with flour, and knead gently 6 to 8 times. Roll out dough on a floured surface with a floured rolling pin into a 12- by 6-inch rectangle (1 inch thick), reflouring surface if necessary. Cut into 8 (3-inch) squares with a floured knife. Transfer biscuits with a metal spatula to an ungreased baking sheet, arranging 2 inches apart.",
        "Bake until golden, 12 to 15 minutes, then transfer to a rack to cool to warm. Halve biscuits horizontally and put each bottom half in a shallow bowl. Spoon stew over biscuit bottoms and cover with tops."
    ],
    "ingredients": [
        "4 ears corn, shucked, discarding husks but reserving silk",
        "1 pound smoked turkey leg",
        "5 cups water",
        "1 large onion, quartered, divided",
        "1/2 stick unsalted butter",
        "1 pound small okra",
        "3 1/2 tablespoons all-purpose flour",
        "1 cup whole milk",
        "3 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 1/4 teaspoons baking soda",
        "1/4 cup finely chopped chives",
        "1 1/4 sticks cold unsalted butter, cut into bits",
        "1 1/2 cups well-shaken buttermilk",
        "Garnish: finely chopped chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "turkey",
        "Bake",
        "Backyard BBQ",
        "Dinner",
        "Corn",
        "Summer",
        "Okra",
        "Chive",
        "Party",
        "Potluck",
        "Simmer",
        "Boil",
        "Buttermilk",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chive Shortcakes with Smoky Corn and Okra Stew",
    "url": "http://www.epicurious.com/recipes/food/views/chive-shortcakes-with-smoky-corn-and-okra-stew-354520"
}
