{
    "directions": [
        "Bring whipping cream to simmer in heavy medium saucepan; remove from heat. Add chopped chocolate; whisk until smooth.",
        "Preheat oven to 350°F. Grind cookies in processor until coarse crumbs form. Add butter and blend until crumbs cling together and are evenly moistened. Press crumb mixture over bottom and up sides of 9-inch-diameter glass pie dish. Bake crust until slightly puffed and darker, about 10 minutes. Cool crust on rack. Combine cherries, sugar and brandy, if desired, in heavy medium saucepan. Stir over medium heat until sugar dissolves and mixture comes to boil. Reduce heat; simmer until thick syrup forms, stirring often, about 10 minutes. Remove from heat. Mix in almond extract. Cool to room temperature.",
        "Place ice cream in large bowl. Fold in cherry mixture and chocolate chips. Pack ice cream mixture into prepared crust. Cover pie and freeze. (Sauce and pie can be prepared 3 days ahead. Cover and refrigerate sauce. Keep pie frozen.)",
        "Rewarm sauce over low heat. Cut pie into wedges; serve with sauce."
    ],
    "ingredients": [
        "1 cup whipping cream",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "30 chocolate wafer cookies (about 7 ounces), broken into pieces",
        "5 tablespoons unsalted butter, cut into 1/2-inch cubes",
        "3/4 pound fresh Bing cherries, pitted, coarsely chopped",
        "1/4 cup sugar",
        "1 tablespoon brandy (optional)",
        "1/8 teaspoon almond extract",
        "1 quart purchased vanilla ice cream, slightly softened",
        "1/2 cup (about 3 ounces) miniature semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer"
    ],
    "title": "Chocolate-Cherry Ice Cream Pie with Hot Fudge Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cherry-ice-cream-pie-with-hot-fudge-sauce-105186"
}
