{
    "directions": [
        "Whisk flour, cocoa powder, kosher salt, and baking soda in a medium bowl. Using an electric mixer on high speed, beat butter, brown sugar, and vanilla until light and fluffy, about 4 minutes. Reduce speed to low and gradually add dry ingredients; mix just to combine, then mix in egg white. Fold in chocolate and pistachios.",
        "Divide dough into 4 pieces. Roll each piece into an 8\"–long log about 1 1/2\" in diameter, pushing dough together if it feels crumbly. Wrap tightly in parchment paper and chill until firm, at least 4 hours. (The colder your dough, the easier it will be to slice.)",
        "Place racks in lower and upper thirds of oven; preheat to 350°F. Working with 1 log of dough at a time and using a serrated knife, cut logs into 1/4\"–thick rounds and transfer to 2 parchment-lined baking sheets, spacing 1/2\" apart.",
        "Sprinkle cookies with sea salt and bake, rotating baking sheets halfway through, until set around edges and centers look dry, 10–12 minutes. Transfer to wire racks and let cool.",
        "MAKE AHEAD: Cookie dough can be made 1 month ahead; freeze instead of chilling. Slice frozen logs into rounds just before baking."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoons baking soda",
        "1 1/2 cups (2 1/2 sticks) unsalted butter, room temperature",
        "1 1/2 cups (lightly packed) light brown sugar",
        "1 teaspoon vanilla extract",
        "1 large egg white",
        "5 ounces bittersweet or semisweet chocolate, chopped",
        "1 cup unsalted, shelled raw pistachios, coarsely chopped",
        "Flaky sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Tree Nut",
        "Pistachio",
        "Edible Gift",
        "Christmas Eve",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Pistachio Sablés",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pistachio-sables-51205610"
}
