{
    "directions": [
        "Preheat the oven to 350°F. Place 10 to 12 1/2-pint glass canning jars on a rimmed baking sheet, evenly arranged with space between them. (If you have a Silpat liner, place it under the jars to prevent them from sliding around.)",
        "To make the cakes, in a mixer fitted with a whisk attachment, beat the butter until smooth. Add the brown sugar and eggs and mix until fluffy, about 2 minutes. Add the vanilla, cocoa, baking soda, and salt and mix until combined. Add half of the flour, then half of the sour cream, and mix until combined. Repeat with the remaining flour and sour cream. Drizzle in the coffee and mix until smooth. The batter will be thin, like heavy cream.",
        "Pour the batter into the jars, filling them halfway. Bake until the tops of the cakes are firm to the touch, about 25 minutes.*",
        "To make the topping, melt the butter in a medium saucepan over medium heat, then add the brown sugar and 1?2 cup water and stir with a wooden spoon until the sugar is dissolved, 2 to 3 minutes. Remove the pan from the heat and stir in the powdered sugar until combined, then return to the heat and bring to a boil. Stir in the nuts.",
        "Pour the praline topping over the cakes to cover, working quickly, because the praline hardens quickly as it cools. Let the cakes cool completely if they aren't already, before screwing on jar lids.**",
        "Do-Aheads",
        "*The cakes can be made ahead, cooled, covered, and kept at room temperature for 2 days or in the refrigerator for up to 4 days.",
        "**The finished cakes will keep for up to 4 days at room temperature."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) unsalted butter, softened",
        "1 1/2 cups packed light brown sugar",
        "2 large eggs",
        "1 teaspoon pure vanilla extract",
        "6 tablespoons unsweetened cocoa powder",
        "1 1/2 teaspoons baking soda",
        "1/4 teaspoon salt",
        "1 1/2 cups sifted cake flour",
        "2/3 cup sour cream",
        "2/3 cup brewed coffee (I just use the morning's leftover coffee)",
        "2 tablespoons unsalted butter",
        "3/4 cup firmly packed light brown sugar",
        "1/2 cup water",
        "1 cup powdered sugar",
        "1/2 cup pecan halves or pieces",
        "Ten to twelve 1/2-pint canning jars",
        "Rimmed baking sheet or roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Picnic",
        "Backyard BBQ",
        "Pecan",
        "Edible Gift",
        "Party",
        "Sour Cream",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Praline Cake in a Jar",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-praline-cake-in-a-jar-363313"
}
