{
    "directions": [
        "Combine butter, sugar and salt in a bowl. Beat in egg, then flour, 1/4 cup at a time, until you get a shaggy dough (it holds together loosely, but it's not smooth or elastic). Dust a surface with flour, transfer dough to surface and, with lightly floured fingers, knead once or twice until a sticky dough forms. Wrap in plastic wrap; refrigerate at least 40 minutes. Divide dough in half; reserve half for Raspberry Marzipan Tarts or freeze, well-wrapped, for another use. Heat oven to 350°F. Divide remaining dough into 4 pieces and, with lightly floured fingertips, press 1 piece into each of 4 fluted 3-inch tart pans, working dough up the sides evenly. (If dough tears on the bottom, smooth dough over hole to close it up.) Prick pastry along bottom with a fork several times. Gently press a small square of foil into each pastry shell (do not press down hard) and top each with 1 tablespoon uncooked rice or dried beans (to prevent pastry from puffing up). Place on a baking sheet; bake 10 minutes. Remove foil and rice from pastry shells; discard. Return crust to oven. Cook until golden, about 9 minutes more. Cool completely.",
        "Beat cream with vanilla and granulated sugar until stiff. Beat in half of banana, mashed well, then fold in chocolate. Divide filling among crusts; refrigerate 1 hour. Scatter brown sugar evenly on the bottom of a small nonstick pan, then slice remaining banana half into pan. Heat on low. When banana slices start to sizzle, stir to coat with sugar. When banana slices become translucent around edges, flip them over. Cook until slices are browned and caramelized on both sides. Top each tart with 3 banana slices and serve."
    ],
    "ingredients": [
        "4 tablespoons butter, softened",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "1 large egg",
        "3/4 cup all-purpose flour, plus extra for rolling crust",
        "4 fluted 3-inch tart pans",
        "4 tablespoons uncooked rice or dried beans",
        "3 tablespoon heavy cream",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon granulated sugar",
        "1 medium banana, halved crosswise",
        "3 tablespoon chocolate chips, melted",
        "2 teaspoon packed brown sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Banana",
        "Vanilla",
        "Healthy",
        "Self",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Banana Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-banana-tarts-238650"
}
