{
    "directions": [
        "Position a rack in the lower third of the oven. Preheat the oven to 325 degrees. Grease a 6-cup tube pan thoroughly. If using an 8x2-inch round cake pan, line the bottom with a circle of parchment paper.",
        "In a large mixing bowl, thoroughly mix the flour, sugar, cocoa powder, baking soda, and salt for 60 seconds on low speed with the electric mixer. Add the butter, eggs, oil, vanilla, and 2 tablespoons of the water. Beat on low speed just until all of the dry ingredients are moist.",
        "Turn the mixer to medium speed and beat for 1 minute. Scrape the bottom and sides of the bowl. Add 3 tablespoons water and beat for 20 seconds on medium speed.  Scrape the bowl and add the remaining 3 tablespoons water.  Beat for 20-30 seconds until the batter is smooth.  Fold in the chocolate chips. Scrape the batter into the pan and spread it evenly.",
        "Bake 35-40 minutes (do not open the oven for the first 30 minutes) or until a toothpick inserted into a cakey place in the center of the cake comes out clean (except for melted chocolate chips).",
        "Set the pan on a rack to cool for ten minutes.  Invert the cake onto rack (turn the round cake right side up) to cool completely.",
        "To make the glaze, start by placing the chocolate chips in a medium bowl.  Bring the cream and salt to a simmer in a medium saucepan.  Pour the cream over the chocolate.  Wait 60 seconds to soften the chocolate, and then stir until the chocolate is entirely melted and the mixture is smooth.  Cool to thicken slightly.  Pour glaze over cooled cake and let set at room temperature."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 cup sugar, plus",
        "2 tablespoons sugar",
        "1/2 cup Ghirardelli Unsweetened Cocoa Powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "6 tablespoons unsalted butter, very soft but not melted",
        "2 tablespoons flavorless vegetable oil (such as canola or safflower)",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup cool water",
        "1/2 cup Ghirardelli Semi-Sweet Mini Chips",
        "For the Glaze:",
        "1 cup Ghirardelli Semi-Sweet Mini Chips",
        "2/3 cup heavy cream",
        "2 tiny pinches salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Chip Bundt Cake",
    "url": "http://allrecipes.com/recipe/219083/chocolate-chip-bundt-cake/"
}
