{
    "directions": [
        "In a heavy 2-quart saucepan combine the brown sugar, the corn syrup, the butter, the vinegar, and the water, bring the mixture to a boil over moderate heat, stirring and washing down any sugar crystals clinging to the side with a brush dipped in cold water, until the sugar is dissolved, and boil the syrup, undisturbed, until it is deep golden and a candy thermometer 290°F. Stir in the vanilla, pour the mixture into a buttered 13- by 9-inch metal baking pan, tilting the pan and spreading mixture with a wooden spoon, and let the toffee cool completely.",
        "In the top of a double boiler set over barely simmering water melt the chocolate chips, stirring until the chocolate is smooth, and spread the chocolate evenly over the toffee. Sprinkle the cashews evenly over the chocolate, pressing them gently into it, and chill the confection for 30 minutes, or until the chocolate is firm. With a thin knife loosen the confection from the pan and, using the knife as a lever, remove it in one piece from the pan. Cut or break the toffee into serving pieces. The toffee keeps, separated by sheets of wax paper in an airtight container lined with wax paper, in a cool dry place for 2 weeks."
    ],
    "ingredients": [
        "1 1/4 cups firmly packed light brown sugar",
        "1/4 cup light corn syrup",
        "5 tablespoons unsalted butter, cut into bits",
        "1 tablespoon cider vinegar",
        "1/4 cup water",
        "1 teaspoon vanilla",
        "1 cup semisweet chocolate chips",
        "3/4 cup finely chopped roasted and salted cashews"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Chocolate",
        "Nut",
        "Dessert",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Cashew Toffee",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cashew-toffee-13545"
}
