{
    "directions": [
        "Mix flour, baking soda, and salt in a bowl until thoroughly combined. With an electric mixer or stand mixer, beat together the butter, 3/4 cup shortening, sugar, and brown sugar in a large bowl until fluffy; beat in the eggs, 1/4 cup milk, and 1 1/2 teaspoons of peppermint extract. Gradually beat in the flour mixture, about 1 cup at a time, until the mixture forms a soft dough. Divide the dough into 4 pieces, cover, and chill for 1 hour in refrigerator.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "To make filling, melt 1 3/4 cups of milk chocolate chips with 2 tablespoons of vegetable shortening in the top of a double boiler over hot (not boiling) water. Stir the mixture until very smooth, and remove the filling from the heat to cool and slightly thicken.",
        "Remove one piece of cookie dough from refrigerator at a time, and working on a floured surface, roll the cookie dough out 1/8-inch thick, and cut out 120 hearts (total) with a 2 1/2-inch heart-shaped cookie cutter. Place half the hearts onto ungreased baking sheets. Carefully spread those hearts with about a teaspoon of the chocolate filling, avoiding the edges, and top each with another heart cookie. Gently pinch the edges of both cookies together to enclose the filling.",
        "Bake in the preheated oven for 10 minutes; let cool for 1 minute on the baking sheets before removing to finish cooling on racks.",
        "For peppermint drizzle, mix together the confectioners' sugar, 1 drop of peppermint extract (to taste), red food coloring to your desired shade of pink or red, and milk as needed in a bowl to make a smooth, thin icing. For chocolate drizzle, melt 1/4 cup of milk chocolate chips with 2 teaspoons of vegetable shortening over hot (not boiling) water in a double boiler; stir and heat until the mixture is thin enough to drip in strings from a spoon.",
        "Drizzle each cooled cookie with a little peppermint drizzle on one side, and a little chocolate drizzle on the other. Let the cookies stand so the drizzle sets, about 30 minutes."
    ],
    "ingredients": [
        "Cookies:",
        "4 1/2 cups all-purpose flour",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 cup butter",
        "3/4 cup vegetable shortening",
        "3/4 cup white sugar",
        "3/4 cup packed brown sugar",
        "2 eggs",
        "1/4 cup milk",
        "1 1/2 teaspoons peppermint extract",
        "Filling:",
        "1 3/4 cups milk chocolate chips",
        "2 tablespoons vegetable shortening",
        "Peppermint Drizzle:",
        "1 cup sifted confectioners' sugar",
        "1 drop peppermint extract, or to taste",
        "1 drop red food coloring, or as needed",
        "1/4 teaspoon milk, or as needed",
        "Chocolate Drizzle:",
        "1/4 cup milk chocolate chips",
        "2 teaspoons vegetable shortening"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Filled Peppermint Valentine Heart Cookies",
    "url": "http://allrecipes.com/recipe/213189/chocolate-filled-peppermint-valentine/"
}
