{
    "directions": [
        "Preheat oven to 350°F.",
        "Beat together butter and brown sugar in a bowl with an electric mixer at medium speed until pale and fluffy, about 2 minutes with a standing mixer or 3 minutes with a handheld. Reduce speed to low and mix in flour and salt just until a dough forms. Pat two thirds of dough evenly over bottom of a buttered 8- by 2-inch square metal baking pan. Bake crust in middle of oven until edge is golden, about 12 minutes. While crust is baking, work almonds into remaining dough with your hands until crumbs form, then reserve for topping. Cool crust in pan on a rack.",
        "Dissolve espresso powder in vanilla in a small cup. Beat together cream cheese and sugar with cleaned beaters at medium-high speed until creamy, about 2 minutes, then add egg and espresso mixture and beat well. Stir in chocolate chips.",
        "Pour filling onto cooled crust and crumble topping evenly over filling. Bake in middle of oven until edges are golden, about 30 to 35 minutes. Cool completely in pan on rack. Cut into 16 bars."
    ],
    "ingredients": [
        "1 1/4 sticks (1/2 cup plus 2 tablespoons) unsalted butter, softened",
        "2/3 cup packed dark brown sugar",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup whole almonds, toasted and coarsely chopped",
        "1 1/2 teaspoons instant-espresso powder or instant coffee",
        "1 1/2 teaspoons vanilla",
        "3 oz cream cheese, softened",
        "1/4 cup granulated sugar",
        "1 large egg",
        "3/4 cup semisweet chocolate chips (4 1/2 oz)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Almond",
        "Gourmet",
        "California",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Almond Bars",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-almond-bars-107826"
}
