{
    "directions": [
        "Scald cream in heavy medium saucepan over medium heat. Remove pan from heat. Add chocolate and whisk until melted and smooth. Pour filling into large bowl. Refrigerate until filling is very thick but still spreadable, stirring occasionally, about 1 1/2 hours.",
        "Bring sugar, water and chopped prunes to boil in heavy small saucepan over medium heat, stirring until sugar dissolves. Boil 1 minute. Remove from heat. Add Cognac. Cover and let mixture steep 1 hour. Strain, reserving prunes and syrup separately.",
        "Position rack in center of oven and preheat oven to 350°F. Butter 11x17 1/2-inch cookie sheet with 1-inch-high sides. Line cookie sheet with parchment. Butter parchment and dust with flour, tapping out excess.",
        "Sift first 5 ingredients into medium bowl. Using electric mixer, cream 1/2 cup plus 2 tablespoons butter in large bowl. Gradually beat in sugar (mixture will be grainy). Add eggs 1 at a time, beating well after each addition. Mix in melted unsweetened chocolate and prunes reserved from syrup. Stir in flour mixture alternately with buttermilk, beginning and ending with dry ingredients and scraping down sides of bowl. Transfer batter to prepared pan, spreading evenly. Bake until tester inserted in center comes out clean, about 25 minutes.",
        "Dust parchment sheet with cocoa powder. Run knife around edges of pan to loosen cake. Cool cake in pan on rack 15 minutes. Turn cake out onto prepared parchment sheet. Peel parchment off cake bottom. Cool completely.",
        "Trim 1/2 inch off each short edge of cake. Cut remainder of cake into three 5x10 1/2-inch rectangles (there will be some cake left over). Place 1 cake layer onto 4 1/2x10-inch cardboard rectangle. Brush cake with 3 tablespoons syrup. Spread 3/4 cup filling over. Place second cake layer atop filling. Brush with 3 tablespoons syrup. Spread 3/4 cup filling over. Top with third cake layer. Brush with 3 tablespoons syrup. Spread 1 cup filling over top and sides of cake to coat. Chill cake until coating is firm, 45 minutes.",
        "Heat remaining filling in heavy small saucepan over low heat. Add 1/4 cup butter and whisk until butter melts and mixture is smooth. Chill until glaze is slightly thickened but still pourable, stirring occasionally, about 15 minutes.",
        "Transfer cake on cardboard base to rack set over large piece of foil. Pour glaze over top and sides of cake, smoothing sides only. Let stand 15 minutes.",
        "Melt milk chocolate in heavy small saucepan over low heat, stirring constantly. Pour chocolate into small parchment cone. Cut off tip to form small opening. Pipe chocolate lines 1/2 inch apart crosswise over top of cake. Starting at 1 short edge 3/4 inch from long edge, draw tip of small sharp knife through chocolate lines to second short edge. Starting at second short edge 3/4 inch from first line, draw knife tip through lines in opposite direction. Continue drawing knife tip through chocolate lines, spacing drawn lines 3/4 inch apart and reversing direction each time, creating chevron pattern.",
        "Transfer cake to platter. Spoon all glaze left on foil into pastry bag fitted with 1/4-inch (no. 3) star tip. Pipe shell pattern unto platter around base of cake. Refrigerate 1 hour. (Can be prepared 2 days ahead. Cover cake loosely and refrigerate. Bring cake to room temperature before serving.)"
    ],
    "ingredients": [
        "2 1/2 cups whipping cream",
        "1 1/4 pounds bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup sugar",
        "1/3 cup water",
        "1/2 cups finely chopped pitted prunes (about 3 ounces)",
        "1/4 cup Cognac, Armagnac or other brandy",
        "1 3/4 cups unbleached all purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "3/4 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup plus 2 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "2 cups sugar",
        "3 large eggs, room temperature",
        "1 ounce unsweetened chocolate, melted",
        "1 1/4 cups buttermilk, room temperature",
        "Unsweetened cocoa powder",
        "1/4 cup (1/2 sticks) unsalted butter, cut into pieces",
        "2 ounces imported milk chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Birthday",
        "Engagement Party",
        "Party"
    ],
    "title": "Chocolate Marquise",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-marquise-1864"
}
