{
    "directions": [
        "Preheat oven to 350°F. Line 2 large rimmed baking sheets with aluminum foil or parchment paper. Combine chopped walnuts, flour, toasted coconut, baking powder, and salt in medium bowl and stir until well blended.",
        "Combine butter, chopped unsweetened chocolate, and 1 cup chocolate chips in heavy medium saucepan. Stir over low heat until butter and chocolate are melted and smooth. Remove saucepan from heat.",
        "Whisk instant coffee crystals and vanilla extract in medium bowl until coffee crystals dissolve. Add sugar and eggs. Using electric mixer, beat until mixture thickens, about 2 minutes. Beat in melted chocolate mixture, then chopped walnut mixture. Stir in remaining 1 cup chocolate chips and peanut butter chips. Mound 2 tablespoons dough for each cookie onto prepared baking sheets, spacing 2 inches apart.",
        "Bake cookies until puffed and cracked but still soft in center, about 15 minutes. Let cookies cool on sheets 10 minutes. Using spatula, transfer cookies to rack and cool. (Can be made 2 days ahead. Store in airtight container at room temperature.)"
    ],
    "ingredients": [
        "3/4 cup chopped walnuts",
        "1/2 cup plus 2 tablespoons all purpose flour",
        "1/2 cup sweetened flaked coconut, lightly toasted",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "6 ounces unsweetened chocolate, chopped",
        "2 cups semisweet chocolate chips (about 12 ounces), divided",
        "4 teaspoons instant coffee crystals",
        "1 tablespoon vanilla extract",
        "1 1/2 cups sugar",
        "4 large eggs",
        "1/2 cup peanut butter chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Coffee",
        "Mixer",
        "Chocolate",
        "Nut",
        "Bake",
        "Kid-Friendly",
        "Back to School",
        "Peanut",
        "Walnut",
        "New Jersey"
    ],
    "title": "Chocolate-Peanut Butter Chip Fudge Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-peanut-butter-chip-fudge-cookies-109278"
}
