{
    "directions": [
        "Put the dark chocolate chips in a large heatproof bowl. In another large bowl, whisk together the eggs and brown sugar until well combined.",
        "In a medium saucepan, bring the cream, milk, brandy, orange zest, vanilla seeds, salt, and granulated sugar to a boil; stir until the sugar is dissolved. Pour the hot liquid over the dark chocolate chips and whisk until melted and smooth. While whisking constantly, pour the dark chocolate mixture into the eggs, mixing until combined. Add the bread and toss gently to coat. Transfer the bread mixture to the refrigerator and cool to room temperature. Stir in the chocolate chips and dried cherries. Cover and refrigerate overnight.",
        "Position a rack in the center of the oven and preheat to 350 degrees F. Put eight 4-ounce ramekins on a baking sheet and lightly coat them with cooking spray.",
        "Stir the bread pudding mixture to evenly distribute the chocolate chips and cherries. Divide the mixture among the prepared ramekins. Sprinkle a little Turbinado sugar over the top of each pudding and bake until puffed and set, about 30 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2/3 cup (about 4 ounces) dark chocolate chips",
        "5 large eggs",
        "5 tablespoons packed dark brown sugar",
        "1 cup heavy cream",
        "1 cup whole milk",
        "2 tablespoons brandy",
        "Finely grated zest of 1/4 orange",
        "Seeds of 1/2 vanilla bean",
        "1/4 teaspoon fine sea salt",
        "5 tablespoons granulated sugar",
        "6 slices soft white bread, cut into 1/2-inch cubes",
        "1/2 cup (about 3 ounces) milk chocolate chips",
        "1/2 cup dried cherries",
        "Nonstick cooking spray",
        "1 tablespoon Turbinado sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Bread Pudding",
        "Cherry",
        "Fruit",
        "Chocolate"
    ],
    "title": "Chocolate-Dried Cherry Bread Pudding",
    "url": "http://www.foodnetwork.com/recipes/chocolate-dried-cherry-bread-pudding"
}
