{
    "directions": [
        "In a metal bowl set over a pan of barely simmering water melt chocolate, stirring until smooth, and cool.",
        "Spread hazelnuts in a shallow baking pan and toast in oven until they begin to turn pale golden, 7 to 10 minutes. Cool hazelnuts completely. Discard any hazelnut skins that rub off easily and transfer nuts to food processor. Add 3 tablespoons sugar and grind mixture fine.",
        "In a large bowl with an electric mixer beat together butter and remaining 2/3 cup sugar until light and fluffy. Add yolks, 1 at a time, beating well after each addition, and beat in vanilla, salt, and melted chocolate. Beat in hazelnut mixture until combined well.",
        "In another large bowl with cleaned beaters beat whites with a pinch salt until they just hold stiff peaks. Whisk about one-fourth whites into chocolate mixture to lighten and fold in remaining whites gently but thoroughly. Spread batter evenly in springform pan and bake in middle of oven 45 to 55 minutes, or until a tester comes out with crumbs adhering. Cool torte completely in pan on a rack and remove side of pan. Invert torte onto a serving plate and discard wax paper.",
        "Put chocolate in a small metal bowl. In a small saucepan bring cream to a boil and pour over chocolate. Stir glaze just until completely smooth and let stand until thickened slightly, about 20 minutes.",
        "Spread glaze evenly over top and side of torte. With a small icing spatula or butter knife make parallel lines through glaze across top to create a design. Garnish top and bottom edge of torte with chopped hazelnuts and let torte stand until glaze is set, about 2 hours.",
        "Serve torte with whipped cream or ice cream."
    ],
    "ingredients": [
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 cup hazelnuts (about 4 ounces)",
        "2/3 cup plus 3 tablespoons sugar",
        "1 stick (1/2 cup) unsalted butter, softened",
        "5 large eggs, separated",
        "1 teaspoon vanilla",
        "3/4 teaspoon salt",
        "Preheat oven to 375°F. Butter an 8 1/2-inch springform pan and line bottom with a round of wax paper. Butter paper and dust pan with flour, knocking out excess.",
        "6 ounce fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1/2 cup heavy cream",
        "Garnish: finely chopped toasted hazelnuts",
        "Accompaniment: whipped cream or vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Chocolate Hazelnut Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-torte-10876"
}
