{
    "directions": [
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans with 2-inch-high sides. Line bottom of pans with parchment paper. Butter parchment. Dust pans with flour; tap out excess.",
        "Sift 2 2/3 cups flour, baking soda and salt into medium bowl. Combine cocoa and espresso powder in another medium bowl. Whisk boiling water, then buttermilk and vanilla into cocoa mixture. Using electric mixer, beat sugar, butter and shortening in large bowl until fluffy. Beat in eggs 1 at a time. Add dry ingredients alternately with buttermilk mixture in 3 additions each. Beat batter until smooth, about 2 minutes. Divide between prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 35 minutes. Cool in pans on racks 10 minutes. Cut around pan sides to loosen cakes. Turn cakes out onto racks. Peel off paper. Cool completely. Chill cakes 1 hour.",
        "Meanwhile, prepare the Chocolate-Raspberry Frosting. Place 1 cake layer on work surface. Place 8-inch-diameter cake pan or plate atop cake. Using serrated knife, cut around cake pan, trimming to form 8-inch-diameter cake. Repeat with second cake layer. Transfer cake trimmings to processor; grind finely. Place in bowl. Mix in cookie crumbs.",
        "Using serrated knife, cut each cake horizontally in half. Using 9-inch tart pan bottom as aid, transfer 1 cake layer, cut side up, to platter. Spread 1 1/2 tablespoons raspberry jam over. Spread 1/2 cup frosting over jam. Repeat layering 2 more times, using 1 cake layer, 1 1/2 tablespoons jam and 1/2 cup frosting for each layer. Top with fourth cake layer, cut side down. Spread remaining frosting over top and sides of cake. Press crumb mixture generously onto frosting on top and sides of cake. Arrange raspberries in concentric circles atop cake. (Can be prepared 1 day ahead. Cover with cake dome and refrigerate. Let cake stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2 2/3 cups cake flour",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "2/3 cup unsweetened cocoa powder (preferably Dutch-process)",
        "1 teaspoon instant espresso powder",
        "2/3 cup boiling water",
        "1 1/3 cups buttermilk",
        "2 teaspoons vanilla extract",
        "2 cups sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup vegetable shortening, room temperature",
        "2 extra-large eggs",
        "Chocolate-Raspberry Frosting",
        "10 chocolate wafer cookies, finely crushed (6 tablespoons)",
        "4 1/2 tablespoons seedless raspberry jam",
        "2 6-ounce baskets fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Raspberry",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Layer Cake with Chocolate-Raspberry Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-layer-cake-with-chocolate-raspberry-frosting-100505"
}
