{
    "directions": [
        "Line large baking sheet with parchment paper. Whisk flour, baking powder, and salt in medium bowl to blend. Using electric mixer, beat sugar and butter in large bowl to blend. Beat in eggs 1 at a time, then Grand Marnier and orange peel. Add flour mixture and beat until blended. Stir in pecans and chocolate. Gather dough together; divide in half. Wrap in plastic and freeze 20 minutes to firm.",
        "Position rack in center of oven; preheat to 350°F. Using floured hands, form each dough piece into 14-inch-long, 2 1/2-inch-wide log. Transfer logs to prepared baking sheet, spacing 2 inches apart. Bake until light golden, about 30 minutes. Transfer parchment with logs to rack. Cool 20 minutes. Reduce oven temperature to 300°F.",
        "Place 1 log on cutting board. Using serrated knife, cut log on diagonal into 1/2-inch-thick slices. Stand slices upright on baking sheet. Repeat with remaining log.",
        "Bake biscotti until dry to touch and pale golden, about 30 minutes. Cool completely on rack. (Can be made 1 week ahead. Store in airtight container.)"
    ],
    "ingredients": [
        "2 cups plus 2 tablespoons all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "3/4 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 large eggs",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "1 tablespoon grated orange peel",
        "1 cup pecans, lightly toasted, coarsely chopped",
        "6 ounces bittersweet (not unsweetened) chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Nut",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Picnic",
        "Halloween",
        "Orange",
        "Pecan",
        "Fall",
        "Winter",
        "Shower",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Orange Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-biscotti-108470"
}
