{
    "directions": [
        "Pulse cocoa, 1 Tbsp. malted milk powder (if using), and two-thirds of Oreos in a food processor until coarsely ground with no large pieces remaining. With motor running, gradually add butter; process, scraping sides once, until mixture resembles wet sand (do not overprocess). Press mixture very firmly into bottom and 1 1/2\" up sides of springform pan. Freeze until firm, 20–25 minutes.",
        "Meanwhile, peel away sides of containers from ice cream. Cut ice cream into 2\" pieces and place in a medium bowl. Let sit until slightly softened, about 5 minutes, then stir with a wooden spoon or large rubber spatula until the consistency of thick cake batter. Break remaining Oreos into large pieces; fold into ice cream along with mints.",
        "Scrape ice cream into crust; smooth top. Freeze until hard, at least 1 day.",
        "Just before serving, place chocolate, corn syrup, salt, and remaining 1 Tbsp. malted milk powder (if using) in a medium bowl. Bring cream to a simmer in a small saucepan; pour over chocolate. Let sit until chocolate is melted, about 5 minutes; whisk until smooth. Pour over tart and spread to edges. Freeze until ganache is firm to the touch, 10–15 minutes. Cut tart into wedges with a hot dry knife to serve (run knife under hot water and wipe dry between slices).",
        "Tart (without ganache) can be made 1 week ahead. Once solid, wrap in plastic; keep frozen."
    ],
    "ingredients": [
        "3 tablespoons unsweetened cocoa powder",
        "2 tablespoons malted milk powder, divided (optional)",
        "1 (14.3-ounce) package Oreos, divided",
        "3 tablespoons unsalted butter, melted",
        "2 pints green mint chip ice cream",
        "15 Andes crème de menthe thins or 8 After Eight mint chocolate thins",
        "4 ounces bittersweet or semisweet chocolate, chopped",
        "1 tablespoon light corn syrup",
        "Pinch of kosher salt",
        "1/2 cup heavy cream",
        "A 9-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Frozen Dessert",
        "Dessert",
        "Summer",
        "No-Cook",
        "Mint",
        "Chocolate",
        "Tart",
        "Ice Cream",
        "Pie"
    ],
    "title": "Chocolate Grasshopper Ice Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-grasshopper-ice-cream-tart"
}
