{
    "directions": [
        "Pulse cocoa, brown sugar, kosher salt, baking powder, and 2 1/2 cups flour in a food processor to combine. Add butter and pulse until largest pieces are pea-size.",
        "Beat egg yolks, sour cream, and vanilla extract in a small bowl until smooth. With the motor running, stream sour cream mixture into food processor and process until dough forms a ball around the blade. Turn out dough onto a surface and knead several times until it is smooth and homogenous. Divide in half and form into 3/4\"-thick disks. Wrap in plastic and chill until firm, about 2 hours.",
        "Place racks in upper and lower thirds of oven and preheat to 350°F. Let 1 disk of dough sit at room temperature until slightly softened, about 5 minutes.",
        "Roll out dough on a lightly floured sheet of parchment paper, shifting often on sheet and dusting with more flour as needed to keep from sticking, to a 12\" square. Using a small offset spatula, spread half of Nutella over dough in a thin layer. Sprinkle half of nuts, 1 Tbsp. demerara sugar, and 1/2 tsp. sea salt over Nutella. Roll up dough to make a log, using parchment paper to help. Repeat with remaining dough, Nutella, nuts, 1 Tbsp. demerara sugar, and 1/2 tsp. sea salt.",
        "Slice logs 1\" thick and transfer to parchment-lined baking sheets, spacing 1 1/2\" apart. Brush tops with egg and sprinkle lightly with more sea salt. Bake rugelach until centers are set and tops are firm to the touch, 25–30 minutes; let cool.",
        "Dough can be made 1 month ahead. Freeze."
    ],
    "ingredients": [
        "1/2 cup unsweetened cocoa powder",
        "1/4 cup (packed) light brown sugar",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon baking powder",
        "2 1/2 cups all-purpose flour, plus more",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
        "2 large egg yolks",
        "1/3 cup sour cream",
        "1 teaspoon vanilla extract",
        "1 (13-ounce) jar Nutella, divided",
        "1 1/2 cups finely chopped pistachios, pecans, and/or walnuts, divided",
        "2 tablespoons demerara sugar, divided",
        "1 teaspoon flaky sea salt, divided, plus more",
        "1 large egg, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Christmas",
        "Kid-Friendly",
        "Cookies",
        "Pistachio",
        "Chocolate",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Nut Rugelach",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-nut-rugelach"
}
