{
    "directions": [
        "Preheat oven to 350°F.",
        "In a bowl stir together crumbs, butter, and sugar and press on bottom and side of a 10-inch (1 1/2-quart) pie plate. Bake crust in middle of oven until crisp, 15 to 20 minutes, and cool on a rack.",
        "In a metal bowl set over barely simmering water melt chocolates, stirring, until smooth and remove bowl from heat. In a heavy saucepan (about 3 quarts) whisk together sugar, cornstarch, salt, and egg yolks until combined well and add milk in a stream, whisking. Bring milk mixture to a boil over moderate heat, whisking, and simmer, whisking, until thick, about 1 minute. Force custard through a fine sieve into a bowl and whisk in melted chocolate, butter, and vanilla until smooth. Cover surface of filling with plastic wrap and cool completely.",
        "Pour filling into crust and chill pie, covered, at least 6 hours or overnight.",
        "In a bowl with an electric mixer beat cream to soft peaks. Beat in sugar and beat cream just to stiff peaks. Spoon whipped cream decoratively onto pie and sprinkle with grated chocolate."
    ],
    "ingredients": [
        "2 cups vanilla wafer crumbs (about 45 wafers)",
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "1/3 cup sugar",
        "5 ounces fine-quality bittersweet chocolate, chopped",
        "4 ounces unsweetened chocolate, chopped",
        "1 cup sugar",
        "1/2 cup cornstarch",
        "3/4 teaspoon salt",
        "6 large egg yolks",
        "4 1/2 cups milk",
        "3 tablespoons unsalted butter, cut into bits and softened",
        "1 1/2 teaspoons vanilla",
        "1 cup well-chilled heavy cream",
        "1 1/2 tablespoons sugar, or to taste",
        "grated bittersweet chocolate for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Gourmet"
    ],
    "title": "Chocolate Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cream-pie-11680"
}
