{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 9-inch layer cake pans, and line with parchment paper. Whisk together flour, baking powder, salt, baking soda, and 6 tablespoons of cocoa powder in a bowl until thoroughly combined.",
        "In a large mixing bowl, mash the butter with the white sugar until blended, then mix in the eggs, one at a time, mixing the egg in before adding the next one. Stir in 1 teaspoon of vanilla extract, then mix in mashed bananas and buttermilk, alternating with the flour mixture in three additions. Add in just enough buttermilk to make a workable batter (bananas may vary in moisture content). Pour the batter into the prepared cake pans.",
        "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 25 to 30 minutes. Cool in the pans for about 10 minutes before turning out onto racks to finish cooling.",
        "In a bowl, mash the cream cheese and 3 tablespoons of butter until thoroughly combined; mix in 1 teaspoon of vanilla extract. Gradually beat in confectioners' sugar and 1/4 cup cocoa powder, and beat in milk, a little at a time, until the frosting is smooth and spreadable.",
        "Place a cake layer onto a cake plate, and frost the layer with about 1/3 of the frosting; top the layer with a layer of sliced bananas. Place the second layer onto the cake, and frost top and sides with remaining 2/3 of the frosting. Top cake with decorative slices of banana, if desired."
    ],
    "ingredients": [
        "2 1/4 cups unsifted all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "3/4 teaspoon baking soda",
        "6 tablespoons unsweetened cocoa powder",
        "3/4 cup butter at room temperature",
        "1 1/2 cups white sugar",
        "2 eggs at room temperature",
        "1 teaspoon vanilla extract",
        "1 cup very ripe bananas, mashed",
        "1/2 cup buttermilk, or as needed",
        "1 (3 ounce) package cream cheese, softened",
        "3 tablespoons butter, softened",
        "1 teaspoon vanilla extract",
        "2 cups confectioners' sugar",
        "1/4 cup unsweetened cocoa powder",
        "2 tablespoons milk, or as needed",
        "2 ripe bananas, thinly sliced (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Banana Layer Cake",
    "url": "http://allrecipes.com/recipe/217160/chocolate-banana-layer-cake/"
}
