{
    "directions": [
        "Place the yeast, instant coffee, cocoa, four, sugar, ricotta cheese, butter, eggs, milk and chocolate hazelnut spread into the bread machine in the order suggested by the manufacturer. Set the machine for DOUGH and press the START button. At the beep- or at the end of the second knead, add the chocolate chips and pecans.",
        "Grease a large baking sheet. Form the dough into two thick logs about 3 1/2 inches wide and 12 inches long. Cover and let rise until double, about 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C). Bake biscotti for 40 to 45 minutes, until edges begin to brown. Cool on wire racks. Using a sharp serrated knife, slice the logs into 1/2 inch wide slices. Lay the slices cut side down on the baking sheet. Bake for 5 minutes, turn and bake 5 minutes more, until dry. Do not brown.",
        "When the biscotti are completely cool, make the chocolate dip. In a small saucepan, heat cream until scalding hot but not boiling. Remove from heat and stir in the semisweet chocolate until smooth. Allow to cool slightly. Dip biscotti halfway into the chocolate and set onto waxed paper to dry. Store in an airtight container. Do not refrigerate. These will keep for several weeks."
    ],
    "ingredients": [
        "1 tablespoon active dry yeast",
        "1 tablespoon instant coffee granules",
        "1/4 cup unsweetened cocoa powder",
        "3 cups all-purpose flour",
        "1/3 cup white sugar",
        "1/2 cup ricotta cheese",
        "1/4 cup unsalted butter",
        "2 eggs",
        "1/3 cup milk, scalded and cooled",
        "1/4 cup chocolate hazelnut spread",
        "1/2 cup chopped pecans",
        "1/2 cup semisweet chocolate chips",
        "3/4 cup heavy cream",
        "9 ounces semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Pecan Biscotti",
    "url": "http://allrecipes.com/recipe/25768/chocolate-pecan-biscotti/"
}
