{
    "directions": [
        "Line a 9x9-inch square pan with parchment paper. Place 1/2 cup of butter into the top half of a double boiler, and melt over simmering water. Stir in the sugar and cocoa powder until the mixture is smooth and the sugar has dissolved. Whisk in the beaten egg and gently cook, whisking constantly, until the mixture thickens up, about 1 minute. Remove the double boiler top from the heat, and stir in the cookie crumbs until very well mixed. Press the crust into the prepared dish, and refrigerate until chilled, at least 30 minutes.",
        "In a mixing bowl, beat together 1/2 cup of butter with the vanilla pudding powder and cream with an electric mixer until the mixture is fluffy. Slowly beat in the confectioners' sugar, and continue beating until the mixture is very creamy and pale yellow, about 2 minutes. Spread the filling over the crust, and return to the refrigerator for at least 30 more minutes.",
        "Melt semisweet chocolate chips with vegetable oil in the top of a double boiler over hot water, and stir until the mixture is very smooth. Remove the chocolate mixture from the heat, allow to cool slightly, and pour over the vanilla layer. Use a spatula to spread the chocolate completely over the vanilla layer. Place the dish in the refrigerator to cool until the chocolate loses its gloss but is not completely hard, about 30 minutes.",
        "With a sharp knife, cut into 5 rows by 5 rows (25 squares), return to refrigerator, and chill at least 15 minutes to overnight. Serve cold."
    ],
    "ingredients": [
        "1/2 cup butter",
        "1/4 cup white sugar",
        "1/4 cup cocoa powder",
        "1 egg, beaten",
        "1 1/4 cups crushed chocolate cream-filled sandwich cookies (such as OREO® Cookies)",
        "1/2 cup butter",
        "2 tablespoons instant vanilla pudding mix",
        "3 tablespoons heavy cream",
        "2 cups confectioners' sugar",
        "1 cup semisweet chocolate chips",
        "1 tablespoon vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Cookie Nanaimo Bars",
    "url": "http://allrecipes.com/recipe/213582/chocolate-cookie-nanaimo-bars/"
}
