{
    "directions": [
        "Bring cream and sugar to simmer in saucepan, whisking to dissolve sugar. Remove from heat. Add chocolate; let stand 1 minute. Whisk until smooth. Whisk in peanut butter. Chill uncovered overnight.",
        "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with parchment paper. Sift first 4 ingredients into medium bowl. Using electric mixer, beat butter and peanut butter in large bowl until blended. Beat in sugar. Beat in eggs, 1 at a time, then vanilla. At low speed, beat in flour mixture in 4 additions alternately with buttermilk in 3 additions.",
        "Divide batter among pans and spread evenly. Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes 5 minutes. Turn out onto racks; peel off parchment. Cool cakes completely.",
        "Using electric mixer, beat cream cheese, 1 1/4 cups powdered sugar, butter, and vanilla in large bowl to blend. Whisk whipping cream and 3/4 cup powdered sugar in bowl until mixture holds medium-firm peaks. Fold into cream cheese mixture in 3 additions; chill until firm but spreadable, about 1 hour.",
        "Place 1 cake layer, bottom side up, on 9-inch tart pan bottom. Spread with half of filling. Place another layer, bottom side up, on work surface. Spread with remaining filling; place atop first layer. Top with remaining cake layer, bottom side up.",
        "Spread frosting over top and sides of cake. (Can be made 1 day ahead. Cover with cake dome; chill. Let stand at room temperature 2 hours before continuing.) Press candy and peanuts onto top of cake."
    ],
    "ingredients": [
        "2 1/4 cups heavy whipping cream",
        "1/2 cup (packed) golden brown sugar",
        "12 ounces bittersweet or semisweet chocolate, finely chopped",
        "1/2 cup old-fashioned (natural) chunky peanut butter",
        "2 1/2 cups all purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1/2 cup old-fashioned (natural) chunky peanut butter",
        "1 pound golden brown sugar",
        "4 large eggs",
        "1 teaspoon vanilla extract",
        "1 cup buttermilk",
        "1 1/2 8-ounce packages cream cheese, room temperature",
        "2 cups powdered sugar, divided",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "3/4 cup chilled heavy whipping cream",
        "Butterfinger candy bars, coarsely chopped",
        "Glazed peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Peanut",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Peanut Butter Cake with Cream Cheese and Butterfinger Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-peanut-butter-cake-with-cream-cheese-and-butterfinger-frosting-231746"
}
