{
    "directions": [
        "Transfer the oven rack to the lowest level. Preheat oven to 325°F. Sift 1 cup sugar with flour, cocoa, and salt; set aside. Using an electric mixer set at medium-high speed, whip egg whites, lemon juice, and vanilla in a medium-sized bowl until peaks form. Set mixer to high speed and whip in remaining 1/2 cup sugar until semistiff peaks form (do not overbeat). With a plastic spatula, slowly fold in the remaining dry ingredients, 1/4 cup at a time, until flour mix disappears. Scoop batter into a 10\" ungreased tube pan and spread evenly. Bake until cake springs back when touched, 45 to 55 minutes. Remove from oven, invert cake pan, and place upside down on a cooling rack. Thoroughly wash and dry berries. Combine berries, nectar, and honey in a small bowl. Mix slowly, being careful not to crush the berries. In a separate bowl, combine yogurt and syrup until blended. Remove cake gently from pan and cut into 8 slices. Serve each slice with fruit and a dollop of maple yogurt."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1 cup unbleached all-purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "12 egg whites (or 1 1/2 cups prepackaged egg whites)",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon vanilla extract",
        "4 cups fresh strawberries",
        "4 cups fresh raspberries",
        "1/4 cup peach nectar",
        "1 tablespoon honey",
        "1 cup plain lowfat yogurt",
        "2 tablespoons maple syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Low Fat",
        "Yogurt",
        "Raspberry",
        "Strawberry",
        "Peach",
        "Summer",
        "Healthy",
        "Maple Syrup",
        "Self",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Angel Food Cake with Fruit and Maple Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-angel-food-cake-with-fruit-and-maple-yogurt-230816"
}
