{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Lightly spray a 10x15 inch jellyroll pan and line with parchment paper. Sift flour with baking powder and salt and set aside.",
        "In a large mixing bowl, beat the eggs on high for several minutes until they are very pale and fluffy. Gradually add in the sugar, beating 1 to 2 minutes more or until very thick. Gently, but thoroughly, fold in the flour mixture.",
        "Melt the chocolate in a small saucepan over low heat. In a small bowl, combine the 2 tablespoons of water with the 2 tablespoons coffee liqueur and the remaining 2 tablespoons sugar and the baking soda, then gradually stir into the melted chocolate until smooth.  Quickly, but thoroughly, fold chocolate mixture into batter.",
        "Pour batter into prepared 10x15 inch pan. Bake at 350 degrees F (175 degrees C) for 18 to 20 minutes, or until a toothpick inserted into the cake comes out clean. Lightly sift an even layer of confectioners sugar over a cloth napkin or tea towel (do not use Terry-cloth). Flip the cake out of its pan onto the prepared cloth as soon as it comes from the oven. Carefully peel away parchment paper. Lightly dust top of cake with confectioners sugar, then trim away crisp edges. Starting with one of the short sides of the cake, immediately roll the cake up in the cloth, jellyroll style, and cool thoroughly on a rack.",
        "For the Filling and Frosting:   In a small saucepan over low heat, melt the chocolate. Remove from heat and let cool to lukewarm. In a medium bowl, beat the cream cheese with the confectioners sugar until smooth, then blend in the vanilla extract and coffee liqueur. Blend in the melted chocolate. Unroll the cake and spread about 1/3 of the filling evenly over the surface. Roll the cake back up.",
        "Arrange cake roll on serving tray, then frost generously, swiping with an icing spatula to form the long 'bark line' design. Swipe ends of cake in a circular motion to simulate the tree-rings of a cut log. Decorate log as desired with holly leaves and berries, mushrooms and snow."
    ],
    "ingredients": [
        "2/3 cup all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "5 eggs",
        "3/4 cup white sugar",
        "2 (1 ounce) squares unsweetened chocolate",
        "2 tablespoons water",
        "2 tablespoons coffee-flavored liqueur",
        "2 tablespoons white sugar",
        "1/4 teaspoon baking soda",
        "confectioners' sugar for dusting",
        "4 (1 ounce) squares semisweet baking chocolate",
        "1 (8 ounce) package cream cheese, softened",
        "3 cups confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon coffee flavored liqueur"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Decadence Yule Log",
    "url": "http://allrecipes.com/recipe/15704/chocolate-decadence-yule-log/"
}
