{
    "directions": [
        "Bring cream to simmer in heavy medium saucepan over medium heat. Add chocolate and stir just until melted and smooth. Add butter and stir until melted. Remove from heat. Stir in Grand Marnier and orange peel. Pour mixture into 8x8x2-inch glass baking dish. Refrigerate until mixture is firm enough to shape, about 1 hour 30 minutes.",
        "Line baking sheet with foil. Using scant 2 tablespoonfuls for each truffle, spoon 16 mounds of chocolate mixture onto prepared sheet. Using 2 serving teaspoons to form eggs and holding 1 teaspoon in 1 hand and second teaspoon in other hand, scoop 1 mound of chocolate from the first spoon to the second. Scoop chocolate from 1 spoon to the other several times, running spoon over surface of mounded chocolate to smooth oval as much as possible. Using palms of hands, roll chocolate mound into egg shape, smoothing surface as much as possible (surface will not be completely smooth). Place on plate. Repeat with remaining chocolate mounds. Refrigerate chocolate eggs until firm, about 45 minutes. Working in batches and using table knife or fingers, smooth surface of chocolate eggs again, if necessary. Chill until firm, about 15 minutes. Sift cocoa powder over chocolate eggs, covering completely. Cover and refrigerate. (Can be made 3 days ahead. Keep refrigerated.)"
    ],
    "ingredients": [
        "1/2 cup whipping cream",
        "12 ounces semisweet chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 tablespoons plus 2 teaspoons Grand Marnier or other orange liqueur or orange juice",
        "4 teaspoons grated orange peel",
        "Unsweetened cocoa powder (preferably Dutch-process)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Liqueur",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Easter",
        "Orange",
        "Spring"
    ],
    "title": "Chocolate-Orange Easter-Egg Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-easter-egg-truffles-104974"
}
