{
    "directions": [
        "Preheat oven to 350°F. Toast sunflower seeds on a rimmed baking sheet, stirring halfway through, until golden brown, about 5 minutes. Let cool.",
        "Meanwhile, heat chopped bittersweet chocolate and white chocolate in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until melted. Remove from heat and let sit, stirring occasionally, until cool, 10–15 minutes.",
        "Finely grind sunflower seeds in spice mill. Transfer to a medium bowl and add flour, cocoa powder, baking powder, kosher salt, and baking soda; whisk to combine. Using an electric mixer on high speed, beat butter, granulated sugar, and brown sugar in a large bowl until very light and fluffy, about 5 minutes. Add eggs one at a time, beating well after each addition before adding the next. Beat until mixture is very light and fluffy, about 2 minutes. Reduce speed to low and add melted chocolate mixture, followed by dry ingredients; beat just until combined. Mix in coconut and both chocolate chips with a rubber spatula.",
        "Using a 2\" cookie scoop or 1/4-cup measuring cup, portion out dough onto parchment-lined baking sheets, spacing at least 2\" apart (these are large cookies; you probably won’t fit more than 8 per sheet). Flatten cookies slightly with your palm and sprinkle with sea salt. Bake, rotating baking sheets halfway through, until cookies are just barely set around edges but still wet-looking in the center (they will seem underdone, but you don’t want to overbake), 15–20 minutes. Let cool on baking sheets 5 minutes, then transfer to wire racks and let cool completely.",
        "Dough can be made 1 day ahead; cover and chill. Bring to room temperature before portioning. Cookies can be baked 2 days ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "1/2 cup raw sunflower seeds",
        "8 ounces bittersweet or semisweet chocolate, chopped",
        "4 ounces white chocolate, chopped",
        "1 3/4 cups plus 2 tablespoons all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon baking soda",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "3/4 cup granulated sugar",
        "3/4 cup (packed) light brown sugar",
        "2 large eggs, room temperature",
        "1 cup unsweetened coconut flakes",
        "1 cup semisweet chocolate chips",
        "1/2 cup white chocolate chips",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Bake",
        "Chocolate",
        "Coconut",
        "Seed",
        "Michigan",
        "Dessert",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double and By Double I Mean Triple Chocolate Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-sunflower-seed-coconut-cookies"
}
