{
    "directions": [
        "Preheat oven to 350°F. Butter an 8 1/2-inch springform pan (2 inches deep) or other cake pan with same dimensions and line bottom with a round of wax paper. Butter paper and dust pan with flour, knocking out excess flour.",
        "In a food processor pulse praline until ground fine. Reserve 1/4 cup ground praline and transfer remaining praline to a bowl. In food processor pulse chocolate until finely ground and add to bowl of praline.",
        "In a bowl with an electric mixer cream together butter, salt, and 1/4 cup sugar until light and fluffy. Beat in yolks, 1 at a time, beating well after each addition, and beat in vanilla. Stir in praline chocolate mixture (mixture will be very thick).",
        "In another bowl with cleaned beaters beat whites until foamy and add a pinch salt and remaining 1/4 cup sugar in a steam, beating until meringue just holds stiff peaks. Fold one third meringue into yolk mixture to lighten and fold in remaining meringue gently but thoroughly. Pour batter into pan and smooth top.",
        "Bake tort in middle of oven 45 to 55 minutes, or until it begins to pull away from side of pan. Cool torte in pan on a rack (torte will fall slightly and continue to set as it cooks) and remove from pan. Torte may be made 1 day ahead and chilled, covered. Bring torte to room temperature before serving.",
        "In a bowl with an electric mixer beat cream until it just holds soft peaks. Stir in Frangelico and half of reserved praline.",
        "Top torte with whipped cream and sprinkle with remaining reserves praline. Serve torte immediately."
    ],
    "ingredients": [
        "1 recipeHazelnut Praline",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped coarse",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1 teaspoon salt",
        "1/2 cup sugar",
        "4 large eggs, separated",
        "1 teaspoon vanilla extract",
        "1 cup well-chilled heavy cream",
        "2 tablespoons Frangelico (hazelnut-flavored liqueur)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Frangelico",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Chocolate Hazelnut Praline Torte with Frangelico Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-praline-torte-with-frangelico-whipped-cream-14285"
}
