{
    "directions": [
        "Bring milk, cream, and 1/2 cup sugar to a boil in a 3-quart heavy saucepan. Remove from heat, then stir in ginger and let steep, covered, 15 minutes. Meanwhile, whisk together yolks and remaining 1/2 cup sugar. Add milk mixture to yolk mixture in a slow stream, whisking, then transfer custard to saucepan. Cook over low heat, stirring constantly with a wooden spoon, until custard is thick enough to coat back of spoon and registers 175 to 180°F on an instant-read thermometer (do not let boil).",
        "Pour custard through a fine-mesh sieve into a metal bowl, discarding solids, and chill, its surface covered with wax paper, until cold, about 1 1/2 hours. Freeze in ice cream maker, then transfer to an airtight container and put in freezer to harden, at least 4 hours.",
        "Bring cream and butter to a boil in a 1-quart saucepan. Pour hot cream over chocolate in a bowl and let stand 1 minute. Whisk ganache until smooth, then chill, covered, until firm, about 1 hour.",
        "Lightly brush 1 side of each of 6 wonton wrappers with beaten egg, then put 1 1/2 teaspoons chocolate ganache in center of each. Fold filled wontons in half to form triangles, pressing gently around filling to eliminate any air bubbles and sealing edges with more egg. (If there are any pockets of air, wontons may burst when fried.) Make 6 more wontons in same manner. Freeze filled wontons on a wax-paper-lined tray until firm, about 20 minutes.",
        "Heat oil in a 4-quart heavy saucepan over moderate heat until it registers 365°F on deep-fat thermometer. Fry wontons, 3 at a time, turning once, until golden brown, about 1 1/2 minutes total. Transfer with a slotted spoon to paper towels to drain. (Return oil to 365°F between batches.) Dust with confectioners sugar and serve wontons warm with ice cream."
    ],
    "ingredients": [
        "2 cups whole milk",
        "1 cup heavy cream",
        "1 cup granulated sugar",
        "3 tablespoons chopped peeled fresh ginger (from a 4-inch piece)",
        "7 large egg yolks",
        "1/3 cup heavy cream",
        "1 teaspoon unsalted butter",
        "3 ounces fine-quality semisweet or bittersweet chocolate, chopped",
        "12 wonton wrappers",
        "1 large egg, lightly beaten",
        "5 cups vegetable oil",
        "Garnish: confectioners sugar",
        "Special equipment: an ice cream maker; a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Egg",
        "Ginger",
        "Dessert",
        "Fry",
        "Frozen Dessert",
        "Gourmet"
    ],
    "title": "Chocolate Wontons with Ginger Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-wontons-with-ginger-ice-cream-107231"
}
