{
    "directions": [
        "Combine flour and sugar in processor. Add butter and cut in, using on/off turns, until mixture resembles coarse meal. Add 2 tablespoons cream and vanilla extract. Using on/off turns, blend until moist clumps form, adding more cream by tablespoonfuls if dough is dry. Gather dough together. Press dough over bottom and up sides of 11-inch-diameter tart pan with removable bottom. (Can be made 1 day ahead. Cover and chill. Let stand at room temperature 30 minutes before filling.)",
        "Preheat oven to 350°F. Combine all nuts in processor; chop coarsely, using on/off turns. Whisk corn syrup, brown sugar, and melted butter in large bowl to blend. Whisk in eggs and vanilla and almond extracts. Mix in chocolate chips, then nuts. Transfer filling to prepared crust.",
        "Bake tart until firmly set in center and top is deep golden brown, about 50 minutes. Cool tart in pan on rack 30 minutes. Push up pan bottom to release tart. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/4 cup sugar",
        "1/2 cup (1 stick) plus 1 tablespoon chilled salted butter, cut into 1/2-inch pieces",
        "2 tablespoons (or more) chilled whipping cream",
        "1 1/2 teaspoons vanilla extract",
        "3/4 cup whole almonds (about 4 1/2 ounces), toasted, cooled",
        "3/4 cup hazelnuts (about 4 ounces), toasted, husked, cooled",
        "3/4 cup walnuts (about 3 1/2 ounces), toasted, cooled",
        "3/4 cup light corn syrup",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup (1/2 stick) salted butter, melted, cooled",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Almond",
        "Walnut",
        "Winter",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate and Mixed Nut Tart in Cookie Crust",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-and-mixed-nut-tart-in-cookie-crust-106229"
}
