{
    "directions": [
        "Stir sugar and water in heavy large saucepan over medium heat until sugar dissolves. Mix in corn syrup and lemon juice. Increase heat and boil without stirring until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally. Remove from heat. Pour in cream (mixture will bubble up). Stir over low heat until caramel is melted and smooth. Increase heat; boil until sauce is reduced to 1 2/3 cups, stirring often, about 4 minutes. Remove from heat. Mix in pecans and bourbon. (Can be made 1 day ahead. Cover and chill. Rewarm before using.)",
        "Preheat oven to 350°F. Combine milk, cream and sugar in heavy large saucepan over medium-high heat. Stir until sugar dissolves and mixture comes to boil. Remove from heat. Add chocolate; stir until smooth. Beat eggs and vanilla in large bowl to blend. Gradually whisk in chocolate mixture. Add bread cubes. Let stand until bread absorbs some of custard, stirring occasionally, about 30 minutes.",
        "Transfer mixture to 13x9x2-inch glass baking dish. Cover with foil. Bake until set in center, about 45 minutes. Uncover; cool at least 15 minutes.",
        "Serve pudding warm or at room temperature with warm sauce."
    ],
    "ingredients": [
        "1 1/4 cups sugar",
        "1/2 cup water",
        "1/4 cup light corn syrup",
        "1 tablespoon fresh lemon juice",
        "1 1/4 cups whipping cream",
        "1 cup chopped pecans, toasted",
        "2 tablespoons bourbon",
        "2 cups milk (do not use low-fat or nonfat)",
        "2 cups whipping cream",
        "1 cup sugar",
        "8 ounces semisweet chocolate, chopped",
        "8 large eggs",
        "1 tablespoon vanilla extract",
        "1 1-pound unsliced egg bread, crusts trimmed, cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Chocolate",
        "Dessert",
        "Bake",
        "Pecan"
    ],
    "title": "Chocolate Bread Pudding with Bourbon-Pecan Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-bread-pudding-with-bourbon-pecan-caramel-sauce-759"
}
