{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F. Butter and flour baking pan, knocking out excess flour.",
        "Pour boiling-hot water over dried fruit in a small bowl and soak 20 minutes, then drain well in a sieve.",
        "Stir together flour, baking soda, salt, and cinnamon in another bowl.",
        "Beat together melted butter, sugar, eggs, and vanilla in a large bowl with an electric mixer at high speed until creamy, about 1 minute. Reduce speed to low, then add flour mixture and mix until just combined. Mix in dried fruit, almonds, and chocolate.",
        "Spread batter evenly in baking pan and bake until golden brown and a wooden pick or skewer inserted in center comes out clean, 25 to 30 minutes. Cool completely in pan on a rack. Run a thin knife around edges of pan to loosen blondie, then cut blondie into roughly 3-inch squares."
    ],
    "ingredients": [
        "1 cup boiling-hot water",
        "1 cup dried cranberries (5 oz)",
        "1 cup dried tart cherries (5 oz)",
        "1 cup golden raisins (5 oz)",
        "2 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "3/4 teaspoon cinnamon",
        "2 sticks (1 cup) unsalted butter, melted and cooled",
        "2 cups sugar",
        "3 large eggs",
        "1 1/2 teaspoons vanilla",
        "1 cup whole almonds with skins (6 oz), toasted and very coarsely chopped",
        "8 oz fine-quality bittersweet chocolate (not unsweetened; preferably 60 to 70% cacao), coarsely chopped",
        "Special equipment: a 17- by 12-inch shallow baking pan (1 inch deep)",
        "Accompaniment: eggnog ice cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Quick & Easy",
        "Cranberry",
        "Raisin",
        "Cherry",
        "Almond",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chock-Full Blondie Squares",
    "url": "http://www.epicurious.com/recipes/food/views/chock-full-blondie-squares-233291"
}
