{
    "directions": [
        "Using vegetable peeler, remove orange part of peel from orange in long strips. Cut peel lengthwise into 1/8-inch-wide strips. Stir 3/4 cup sugar and 3/4 cup water in heavy small saucepan over medium-low heat until sugar dissolves. Bring to boil. Reduce heat and simmer 2 minutes. Add orange peel; simmer 15 minutes.",
        "Place remaining 1/4 cup sugar in small bowl. Using slotted spoon, remove peel from syrup and transfer to sugar. Toss to coat. Cool, tossing occasionally. Cover bowl and let stand at room temperature overnight. (Can be made 2 days ahead. Keep covered.)",
        "Preheat oven to 350°F. Bring milk, cream, Grand Marnier, vanilla, and grated orange peel to boil in heavy medium saucepan. Remove from heat. Add chocolate and stir until melted and smooth. Whisk yolks and sugar in medium bowl until pale yellow, about 2 minutes. Whisk egg mixture into chocolate mixture. Strain into 2-cup measuring cup.",
        "Divide mixture between two 8-ounce custard cups. Place cups in small baking dish. Add enough water to baking dish to come halfway up sides of cups. Cover dish tightly with foil. Bake until custard is set, about 40 minutes. Remove cups from water in dish. Place in refrigerator uncovered until cool. Cover with plastic wrap and refrigerate until cold, about 6 hours. (Can be made 2 days ahead. Keep refrigerated.) Top with whipped cream, garnish with candied orange peel, and serve."
    ],
    "ingredients": [
        "1 orange",
        "1 cup sugar, divided",
        "3/4 cup water",
        "2/3 cup whole milk",
        "1/2 cup whipping cream",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "1 teaspoon vanilla extract",
        "1 teaspoon finely grated orange peel",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "4 large egg yolks",
        "3 tablespoons sugar",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Dairy",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "New Year's Eve",
        "Orange",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Orange Pots de Crème with Candied Orange Peel",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-pots-de-creme-with-candied-orange-peel-231610"
}
