{
    "directions": [
        "Combine cream and sugar in heavy small saucepan. Stir over medium-high heat until mixture comes to boil. Remove from heat. Add chocolate and stir until chocolate melts and sauce is smooth. Mix in brandy and vanilla. (Can be prepared 2 days ahead. Cover and chill.)",
        "Preheat oven to 375°F. Butter 9-inch-diameter cake pan with 1 1/2- inch-high sides; dust with flour. Combine 2 cups flour, 3 tablespoons sugar, baking powder, baking soda and salt in large bowl; whisk to blend. Add butter and rub in with fingertips until mixture resembles coarse meal. Add chopped chocolate. Gradually add 2/3 cup buttermilk, stirring with fork until dough forms.",
        "Transfer dough to cake pan; press gently to level top. Brush dough with 2 tablespoons buttermilk, then sprinkle with 2 tablespoons sugar. Bake biscuit until cooked through and golden on top, about 25 minutes. Cool biscuit in pan on rack (biscuit will be 1 to 1 1/2 inches high.)",
        "Reserve 8 berries for garnish. Slice remaining berries into large bowl. Add 4 tablespoons sugar and toss to coat; let stand until berries begin to release juices, about 30 minutes. Combine whipping cream, vanilla and 1 tablespoon sugar in medium bowl. Whip to soft peaks. Cover and chill cream until ready to serve.",
        "Rewarm sauce over low heat, stirring often. Cut around pan sides to loosen biscuit. Turn biscuit out onto work surface. Using long serrated knife, carefully cut biscuit in half horizontally. Using large spatula as aid, place biscuit bottom on platter. Spoon sliced berries with their juices over. Drizzle with some chocolate sauce. Spoon all but 1/2 cup whipped cream over; cover with biscuit top. Drop reserved whipped cream in dollops onto biscuit. Garnish with reserved whole strawberries. Cut into wedges and serve, passing remaining chocolate sauce separately."
    ],
    "ingredients": [
        "2/3 cup whipping cream",
        "2 tablespoons (packed) golden brown sugar",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon brandy",
        "1 teaspoon vanilla extract",
        "2 cups all purpose flour",
        "5 tablespoons sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into small pieces",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2/3 cup plus 2 tablespoons buttermilk",
        "2 pounds strawberries, hulled",
        "5 tablespoons sugar",
        "1 1/3 cups chilled whipping cream",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Berry",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Strawberry",
        "Summer"
    ],
    "title": "Chocolate Strawberry Shortcake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-strawberry-shortcake-2256"
}
