{
    "directions": [
        "Position rack in center of oven; preheat to 375°F. Toast pistachios on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, 5–6 minutes. Let cool slightly, then coarsely chop.",
        "Meanwhile, butter ramekins, making upward strokes up the sides with a pastry brush. Sprinkle with sugar, tilting to coat completely and tapping out any excess. Arrange prepared ramekins on baking sheet.",
        "Combine chocolate and jam in a medium heatproof bowl set over a saucepan of barely simmering water (do not let bowl touch water); stir constantly until chocolate is melted and mixture is smooth, 1–2 minutes. Remove bowl from heat. Stir in egg yolk and 1/4 tsp. salt.",
        "Beat egg whites and a pinch of salt in the bowl of a stand mixer fitted with the whisk attachment on medium speed until frothy, about 2 minutes. Gradually add 1/2 cup sugar, 1 Tbsp. at a time, and beat until medium peaks form, 6–7 minutes.",
        "Using a rubber spatula, fold one-quarter of the beaten egg whites into chocolate mixture to lighten. Fold in remaining egg whites in 2 batches. Divide batter among prepared ramekins, filling completely.",
        "Transfer baking sheet with ramekins to oven and bake soufflés until puffed and tops feel firm to the touch, 18–20 minutes.",
        "Meanwhile, using an electric mixer on medium-low speed, beat cream in a large bowl until soft peaks form. Dollop soufflés with cream, top with chopped pistachios, and serve immediately."
    ],
    "ingredients": [
        "1/4 cup unsalted, shelled raw pistachios",
        "Unsalted butter (for ramekins)",
        "1/2 cup sugar, plus more for ramekins",
        "6 ounces high-quality bittersweet chocolate, chopped",
        "1/4 cup high-quality raspberry jam or jelly",
        "1 large egg yolk",
        "1/4 teaspoon kosher salt, plus more",
        "6 large egg whites, room temperature",
        "1/2 cup heavy cream",
        "4 (6-ounce) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soufflé/Meringue",
        "Chocolate",
        "Dessert",
        "Pastry",
        "Raspberry",
        "Pistachio",
        "Egg",
        "Milk/Cream",
        "Wheat/Gluten-Free",
        "Valentine's Day",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Raspberry Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-raspberry-souffle"
}
