{
    "directions": [
        "Preheat oven to 225°. Line 2 heavy large baking sheets with parchment paper. Using small bowl or can as guide, trace three 4-inch-diameter circles on parchment on each baking sheet; turn parchment over (circles will show through). Brush parchment with melted butter. Whisk powdered sugar and 2 tablespoons sugar in small bowl to blend. Using electric mixer, beat egg whites and salt in large bowl until foamy and beginning to hold soft peaks. Slowly beat in 1/2 cup sugar; continue beating until whites are stiff and shiny. Fold in powdered sugar mixture, then chocolate. Spoon meringue by generous 1/2 cupfuls into center of each circle. Using back of spoon, spread meringue to edge of circle and indent center to form shallow bowl.",
        "Bake meringues until crisp, about 1 hour 30 minutes. Place baking sheets on racks; cool completely. (Meringues can be prepared 4 days ahead. Store airtight at room temperature.)",
        "Bring cream, water and sugar to boil in medium saucepan over medium heat, stirring to dissolve sugar. Reduce heat to low; add chocolate. Whisk until melted. Remove from heat; stir in extract. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm sauce over low heat before using.)",
        "Place 1 meringue in center of each plate. Top with scoops of ice cream. Drizzle with chocolate sauce. Sprinkle with chopped candies. Serve immediately."
    ],
    "ingredients": [
        "Melted unsalted butter",
        "2/3 cup powdered sugar",
        "2 tablespoons plus 1/2 cup sugar",
        "1/2 cup egg whites (from about 4 large eggs)",
        "1/8 teaspoon salt",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "1/4 cup whipping cream",
        "1/4 cup water",
        "2 tablespoons sugar",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 teaspoon peppermint extract",
        "1 1/2 pints chocolate ice cream or peppermint stick ice cream",
        "1/2 cup chopped red-and-white-striped hard peppermint candies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Chip Meringues with Ice Cream, Peppermint Candies and Chocolate-Mint Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-chip-meringues-with-ice-cream-peppermint-candies-and-chocolate-mint-sauce-104525"
}
