{
    "directions": [
        "Preheat oven to 350°F. Oil or butter a 9- by 2-inch round springform pan and line bottom with a round of parchment paper or foil.",
        "In a double boiler or a bowl set over a saucepan of barely simmering water melt chocolates and butter, stirring until smooth. Remove top of double boiler or bowl from heat and stir in bourbon or rum.",
        "In a food processor pulse pecans with 3/4 cup sugar until finely ground. Transfer mixture to a bowl and stir in flour.",
        "In another bowl with an electric mixer beat whites with salt at medium speed until white, opaque, and beginning to hold their shape. Gradually add remaining 3/4 cup sugar, beating at high speed until whites hold soft (not stiff), slightly glossy peaks. Stir in pecan mixture with a spatula until well blended and fold in chocolate mixture until no streaks remain (batter will deflate).",
        "Pour batter into pan and smooth top. Bake cake in middle of oven 50 minutes, or until a tester inserted into center comes out clean. Run a thin knife around edge of cake to loosen and invert cake onto a rack to cool completely.",
        "Remove parchment or foil and transfer cake to a platter. Cake may be wrapped in plastic wrap and chilled 1 week or frozen 1 month. Bring cake to room temperature before serving.",
        "Just before serving, dust cake with confectioners' sugar."
    ],
    "ingredients": [
        "2 ounces semisweet chocolate, chopped coarse",
        "2 ounces unsweetened chocolate, chopped coarse",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "2 tablespoons bourbon or dark rum",
        "1 1/2 cups pecans (about 6 ounces)",
        "1 1/2 cups sugar",
        "3/4 cup all-purpose flour",
        "1 cup egg whites (from 7 to 8 large eggs)",
        "1/4 teaspoon salt",
        "confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Pecan",
        "Gourmet"
    ],
    "title": "Chocolate Pecan Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pecan-cake-14007"
}
