{
    "directions": [
        "Mix first 3 ingredients in heavy large saucepan. Cook over medium heat until mixture appears somewhat pasty, stirring constantly, about 12 minutes. Remove from heat. Mix in 1 1/2 teaspoons vanilla extract and 1/4 teaspoon almond extract. Spread out coconut mixture on large baking sheet. Refrigerate until cold, about 45 minutes.",
        "Preheat oven to 300°F. Line another baking sheet with parchment. Press 1/4 cup coconut mixture into pyramid shape (about 1 1/2 inches high). Place on prepared sheet. Repeat with remaining coconut mixture. Bake cookies until golden, about 30 minutes. Transfer cookies to rack and cool.",
        "Set cookies on rack over rimmed baking sheet. Stir chocolate and cream in heavy medium saucepan over medium heat until melted and smooth. Remove from heat. Mix in remaining 1/4 teaspoon vanilla extract. Spoon glaze over cookies, covering almost completely and allowing chocolate to drip down sides. Refrigerate until glaze sets, at least 2 hours. (Can be made 1 day ahead. Transfer cookies to airtight container and keep refrigerated.)"
    ],
    "ingredients": [
        "3 cups (lightly packed) sweetened shredded coconut",
        "3/4 cup sugar",
        "3/4 cup egg whites (about 6 large)",
        "1 3/4 teaspoons vanilla extract",
        "1/4 teaspoon almond extract",
        "9 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "6 tablespoons heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Dessert",
        "Bake",
        "Coconut",
        "Almond",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Covered Coconut Macaroons",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-covered-coconut-macaroons-107101"
}
