{
    "directions": [
        "Line a lightly greased 15- by 10 1/2-inch jelly-roll pan with foil and grease the foil. Line the foil with wax paper and grease the paper. In the top of a double boiler set over barely simmering water melt the chocolate with 1/4 cup water, stirring until the mixture is smooth, and let the mixture cool for 10 minutes. In a large bowl with an electric mixer beat the egg yolks with 1/3 cup of the sugar for 5 minutes, or until the mixture is thick and pale and ribbons when the beaters are lifted, and beat in the chocolate mixture and the vanilla. In another large bowl beat the egg whites with the salt until they are frothy, add the cream of tartar, and beat the whites until they hold soft peaks. Add the remaining 1/3 cup sugar, a little at a time, and beat the whites until they just hold stiff peaks. Stir one fourth of the whites into the chocolate mixture and fold in the remaining whites gently but thoroughly. Pour the batter into the prepared pan and spread it evenly with a metal spatula. Bake the cake in the middle of a preheated 350°F. oven for 12 to 15 minutes, or until it is puffed and just set. Let the cake cool completely in the pan on a rack. (The cake will be puffed when it comes out of the oven but will sink as it cools.)",
        "In a small saucepan sprinkle the gelatin over 2 tablespoons cold water and let it soften for 5 minutes. Heat the mixture over moderately low heat, stirring, until the gelatin is dissolved, and let it cool for 5 minutes. In a bowl combine the cream, the espresso powder, and the cinnamon and beat the mixture until it holds soft peaks. Add the confectioners' sugar, sifted, and the gelatin mixture, beat the mixture until it holds stiff peaks, and chill the filling, covered, for 10 minutes.",
        "In a small bowl stir together the cocoa powder and the confectioners' sugar and sift about half of the mixture evenly over the cake. Cover the cake with a sheet of wax paper, invert a baking sheet over the paper, and invert the cake onto the baking sheet. Peel off the foil and wax paper carefully and mound the filling lengthwise down the center, leaving a 1-inch border at each end. With a long side facing you and using the wax paper as an aid, roll up the cake jelly-roll fashion, keeping it wrapped in the wax paper. (The cake will crack but it will still hold together.) Chill the cake, wrapped in the wax paper, on the baking sheet for at least 1 hour and up to 2 hours. Transfer the cake to a platter, remove the wax paper, and trim the ends on the diagonal. The chocolate roll can be prepared up to this point 1 day in advance and kept covered loosely and chilled. Sift the remaining cocoa mixture over the cake.",
        "In a chilled small bowl beat the cream with the espresso powder, the cinnamon, and the confectioners' sugar, sifted, until it just holds stiff peaks, transfer the mixture to a pastry bag fitted with a small flute tip, and pipe it decoratively on and around the cake roll. Garnish the roll with the chocolate coffee beans."
    ],
    "ingredients": [
        "7 ounces semisweet chocolate, chopped",
        "6 large eggs, separated",
        "2/3 cup sugar",
        "1 teaspoon vanilla",
        "1/4 teaspoon salt",
        "1/4 teaspoon cream of tartar",
        "1 teaspoon unflavored gelatin",
        "1 cup well-chilled heavy cream",
        "2 tablespoons instant espresso powder",
        "1/8 teaspoon cinnamon",
        "1/4 cup confectioners' sugar",
        "1 1/2 tablespoons unsweetened cocoa powder",
        "1 1/2 tablespoons confectioners' sugar",
        "1/3 cup well-chilled heavy cream",
        "2 teaspoons instant espresso powder",
        "a pinch of cinnamon",
        "1 tablespoon confectioners' sugar",
        "5 chocolate coffee beans (available at specialty foods shops) if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Gourmet"
    ],
    "title": "Chocolate Roll with Cappuccino Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-roll-with-cappuccino-cream-11035"
}
