{
    "directions": [
        "In a heavy saucepan stir together the egg whites, the sugar, the salt, the vanilla, and the coconut, sift in the flour, and stir the mixture until it is combined well. Cook the mixture over moderate heat, stirring constantly, for 5 minutes, increase the heat to moderately high, and cook the mixture, stirring constantly, for 3 to 5 minutes more, or until it is thickened and begins to pull away from the bottom and side of the pan. Transfer the mixture to a bowl, let it cool slightly, and chill it, its surface covered with plastic wrap, until it is just cold. Drop heaping teaspoons of the dough 2 inches apart onto buttered baking sheets and bake the macaroons in batches in the middle of a preheated 300°F. oven for 20 to 25 minutes, or until they are pale golden. Transfer the macaroons to a rack and let them cool.",
        "In a small metal bowl set over a pan of barely simmering water melt the chocolate, stirring until it is smooth, remove the bowl from the heat, and dip the macaroons, 1 at a time, into the chocolate, coating them halfway and letting any excess drip off. Transfer the macaroons as they are dipped to a foil-lined tray and chill them for 30 minutes to 1 hour, or until the chocolate is set. The macaroons keep, chilled and separated by layers of wax paper, in an airtight container for 3 days. (If the macaroons are made in advance, let them stand at room temperature for 20 minutes before serving.)"
    ],
    "ingredients": [
        "4 large eggs whites",
        "1 1/3 cups sugar",
        "1/2 teaspoon salt",
        "1 1/2 teaspoons vanilla",
        "2 1/2 cups sweetened flaked coconut",
        "1/4 cup plus 2 tablespoons all-purpose flour",
        "8 ounces fine-quality bittersweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Coconut",
        "Gourmet"
    ],
    "title": "Chocolate-Dipped Coconut Macaroons",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-dipped-coconut-macaroons-11607"
}
