{
    "directions": [
        "Spray a 9x4 1/2 x 3\" loaf pan with nonstick spray. Line with plastic wrap, leaving a 2\" overhang; set aside. Whisk egg whites and sugar in a medium heatproof bowl set over a medium saucepan of simmering water until sugar dissolves and egg whites are warm (but not hot), about 5 minutes. Remove from heat. Using an electric mixer, beat on medium-high speed until cool, tripled in volume, and stiff peaks form, about 8 minutes. (If egg whites look grainy, you've gone too far.)",
        "Stir chocolate and butter in a large heatproof bowl over same saucepan of simmering water until melted and smooth; remove from heat; let cool slightly.",
        "Beat cream in another medium bowl until medium-stiff peaks form (cream should be soft and pillowy; peaks will just fall onto themselves). Using a rubber spatula, gently fold egg whites into warm chocolate. Fold in whipped cream. (Stop folding as soon as mixture becomes one smooth texture and light brown color.) Scrape semifreddo into prepared pan; smooth top. Cover tightly and freeze until firm, 3-4 hours. DO AHEAD: Semifreddo can be made 5 days ahead. Keep tightly wrapped and frozen.",
        "Bring first 5 ingredients to a boil in a small saucepan. Remove from heat and cover. Let steep for 15 minutes.",
        "Place chocolate in a medium heatproof bowl; set aside. Strain milk mixture through a fine-mesh sieve into a medium bowl; return to saucepan. Bring to a boil. Gradually pour milk mixture over chocolate, stirring until melted and smooth. Stir in tequila, if using. DO AHEAD: Sauce can be made 2 days ahead. Let cool completely. Cover and chill. Gently rewarm before continuing.",
        "Combine cream, sugar, and cinnamon in a medium bowl; scrape in seeds from vanilla bean; discard bean. Using an electric mixer, beat until soft peaks form.",
        "Uncover semifreddo and invert onto a platter. Lift pan and discard plastic wrap. Using a knife dipped in hot water and wiped dry, cut semifreddo into clean slices. Transfer to plates. Garnish with cinnamon whipped cream and warm chile-chocolate sauce, if desired. Sprinkle almonds over."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 large egg whites",
        "1/2 cup sugar",
        "4 ounces semisweet or bittersweet chocolate (do not exceed 61% cacao)",
        "2 tablespoons unsalted butter, room temperature",
        "1 cup chilled heavy cream",
        "3/4 cup whole milk",
        "1 chile de árbol",
        "1 cinnamon stick",
        "1 whole star anise",
        "1 tablespoon (firmly packed) light brown sugar",
        "6 ounces semisweet or bittersweet chocolate (do not exceed 61 % cacao), chopped",
        "1 tablespoon tequila (optional)",
        "1 cup chilled heavy cream",
        "1 tablespoon sugar",
        "1/4 teaspoon ground cinnamon",
        "1/2 vanilla bean, split lengthwise",
        "1/4 cup whole almonds, toasted, coarsely crushed",
        "Ingredient info: Chiles de źrbol can be found at some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chocolate",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Vegetarian",
        "Low Sodium",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Semifreddo with Chile-Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-semifreddo-with-chile-chocolate-sauce-51104810"
}
