{
    "directions": [
        "Preheat oven to 350°F. Butter bottom of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Line pan bottom with parchment.",
        "Using electric mixer, beat butter in medium bowl until light. Add 1/2 cup sugar; beat until fluffy. Add yolks 1 at a time, beating after each addition. Mix in vanilla. Add flour, mix just until blended. Mix in pecans and chocolate. Using electric mixer fitted with clean dry beaters, beat egg whites in large bowl until soft peaks form. Gradually add 1/2 cup sugar; beat until stiff but not dry. Fold whites into yolk mixture in 3 additions.",
        "Transfer batter to pan. Bake until tester inserted into center comes out clean, about 55 minutes. Cool on rack 15 minutes. Run knife around sides of pan to loosen. Release pan sides. Cool.",
        "Combine all ingredients in top of double boiler set over simmering water (do not allow pan to touch water). Stir until smooth. Cool until lukewarm but still pourable, about 45 minutes. Meanwhile, prepare filling.",
        "Combine cream, sugar and bourbon in medium bowl; beat until stiff peaks form.",
        "Using serrated knife, cut cake into 3 layers. Place bottom layer on plate. Spread half of cream filling over. Top with second layer. Spread remaining filling over. Top with remaining layer, cut side down. Slowly pour glaze over cake, allowing some to drip down sides of cake. Garnish cake with pecan halves. Chill until glaze sets, about 30 minutes."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 cup sugar",
        "6 large egg yolks",
        "1/2 teaspoon vanilla extract",
        "1/2 cup cake flour",
        "1 1/2 cups pecans, toasted, finely chopped",
        "2 ounces unsweetened chocolate, grated",
        "8 large egg whites",
        "5 ounces semisweet chocolate, chopped",
        "1 ounce unsweetened chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter",
        "1 tablespoon light corn syrup",
        "1 cup chilled whipping cream",
        "3 tablespoons sugar",
        "1 1/2 tablespoons bourbon",
        "12 pecan halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Pecan",
        "Party"
    ],
    "title": "Chocolate Pecan Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pecan-layer-cake-284"
}
