{
    "directions": [
        "Combine first 5 ingredients in heavy medium saucepan. Stir over low heat until both sugars dissolve. Increase heat and boil until large bubbles break on surface and sauce drops thickly from spoon, stirring constantly, about 2 minutes. Remove from heat; whisk in cream and vanilla (mixture may bubble vigorously). (Can be made 3 days ahead. Cover; chill. Rewarm slightly over low heat before using.)",
        "Preheat oven to 350°F. Line two 9-inch-diameter cake pans with 1 1/2-inch-high sides with parchment paper; butter paper. Sift flour, baking soda and salt into small bowl. Using electric mixer, beat butter and both sugars in large bowl until well blended. Add egg and vanilla and beat until smooth. Beat in flour mixture. Stir in chocolate chips. Drop half of dough by large spoonfuls into each prepared pan; spread evenly. Bake cookies until light golden, about 18 minutes. Cool cookies in pans on racks. Carefully turn out cookies; peel off parchment.",
        "Place 1 cookie, top side up, in 9-inch springform pan with 2 3/4-inch-high sides. Drizzle 1/4 cup sauce over. Spread evenly with ice cream; drizzle with 1/2 cup sauce. Top with remaining cookie, top side up; press gently to adhere. Drizzle with 2 tablespoons sauce. Cover pan and freeze ice cream cake at least 5 hours. Cover and chill remaining sauce. (Cake and sauce can be prepared 3 days ahead.)",
        "Cut around cake with small knife to loosen. Release pan sides. Let cake stand until ice cream is slightly softened, about 20 minutes. Rewarm butterscotch sauce over low heat. Cut cake into wedges; serve with sauce."
    ],
    "ingredients": [
        "3/4 cup (packed) dark brown sugar",
        "1/2 cup dark corn syrup",
        "6 tablespoons (3/4 stick) unsalted butter, diced",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1/2 cup whipping cream",
        "1 teaspoon vanilla extract",
        "1 1/2 cups all purpose flour",
        "3/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, room temperature",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1 1/2 cups semisweet chocolate chips (about 9 ounces)",
        "3 pints chocolate or vanilla ice cream, slightly softened"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Super Bowl",
        "Kid-Friendly",
        "Frozen Dessert",
        "Spring",
        "Summer"
    ],
    "title": "Chocolate-Chip Ice-Cream-Sandwich Cake with Butterscotch Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-chip-ice-cream-sandwich-cake-with-butterscotch-sauce-104842"
}
