{
    "directions": [
        "In a 1 1/2-quart heavy saucepan combine apricots, granulated sugar, and water and simmer, covered, 15 minutes. Remove lid and simmer mixture, stirring and mashing apricots, until excess liquid is evaporated and filling is thickened. Stir in vanilla.",
        "Preheat oven to 350°F. and grease and flour an 8-inch-square baking pan, knocking out excess flour.",
        "In a shallow baking pan toast pecans in middle of oven until golden brown, 8 to 10 minutes, and cool. In a food processor pulse pecans, flour, brown sugar, and salt until pecans are coarsely chopped. Add chocolate chips and butter and pulse until pecan mixture resembles coarse crumbs.",
        "Press about half of chocolate chip mixture onto bottom of prepared baking pan and spread evenly with apricot filling. Crumble remaining chocolate chip mixture evenly over apricot filling, pressing it down slightly, and bake confection in middle of oven 1 hour, or until golden. Cool confection completely in pan on a rack. Sprinkle confection with confectioners' sugar and cut into 16 bars."
    ],
    "ingredients": [
        "6 ounces dried apricots (about 1 cup firmly packed), chopped fine",
        "1/4 cup granulated sugar",
        "3/4 cup water",
        "1 teaspoon vanilla extract",
        "1 1/3 cups pecans (about 4 ounces)",
        "1 cup all-purpose flour",
        "2/3 cup firmly packed light brown sugar",
        "1/2 teaspoon salt",
        "2/3 cup semisweet chocolate chips",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "confectioners' sugar for sprinkling bars"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Apricot",
        "Pecan",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Chip Apricot Bars",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-chip-apricot-bars-10136"
}
