{
    "directions": [
        "Position rack in bottom third of oven and preheat to 325°F. Generously butter and flour 12-cup angel food cake pan. Combine toasted pecans, chopped dried figs, prunes, dates, orange juice concentrate, Grand Marnier and grated orange peel in large bowl. Let stand 30 minutes, stirring occasionally.",
        "Sift flour, cocoa, cinnamon, baking powder, baking soda and salt into medium bowl. Combine brown sugar and 6 ounces chocolate in processor and chop into small pieces.",
        "Using electric mixer, beat butter and cream cheese in large bowl to blend. Add chocolate mixture and beat until fluffy. Beat in eggs 1 at a time. Beat in prune butter. Stir in 1/4 of dry ingredients. Mix in fruit mixture and remaining dry ingredients in 3 additions each.",
        "Transfer batter to prepared pan. Bake cake until tester inserted near center with a few moist crumbs attached, about 1 hour 55 minutes. Cool 5 minutes. Turn pan over onto rack; let stand 5 minutes. Lift off pan; cool cake completely. Wrap cake in plastic and store at room temperature 2 days.",
        "Melt butter in heavy medium saucepan over low heat. Add chocolate; stir until melted and smooth. Whisk in orange juice concentrate.",
        "Place cake on rack. Spread some of chocolate glaze thickly over top and sides of cake. Refrigerate 15 minutes. Spread remaining chocolate glaze over cake, covering completely. Sprinkle with chopped candied fruit peel, if desired. Refrigerate cake 30 minutes to set glaze. (Fruitcake can be prepared 3 weeks ahead. Wrap cake in plastic and refrigerate.)"
    ],
    "ingredients": [
        "2 1/2 cups large pecan pieces, toasted",
        "1 cup (packed) chopped dried black Mission figs",
        "1 cup (packed) chopped pitted prunes",
        "1 cup (packed) chopped pitted dates",
        "1/2 cup frozen orange juice concentrate, thawed",
        "1/4 cup Grand Marnier or other orange liqueur",
        "2 tablespoons grated orange peel",
        "3 cups all purpose flour",
        "3/4 cup (packed) unsweetened cocoa powder",
        "2 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "1 1-pound box dark brown sugar",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "4 ounces cream cheese, room temperature",
        "4 large eggs, room temperature",
        "3/4 cup purchased prune butter",
        "1/2 cup plus 2 tablespoons (1 1/4 sticks) unsalted butter",
        "1 pound bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "6 tablespoons orange juice concentrate, thawed",
        "Chopped candied fruit peel (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Mixer",
        "Chocolate",
        "Citrus",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Orange",
        "Prune",
        "Date",
        "Fig",
        "Pecan",
        "Winter"
    ],
    "title": "Chocolate-Orange Fruitcake with Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-fruitcake-with-pecans-945"
}
