{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter springform pan, then lightly dust with cocoa powder, knocking out excess.",
        "Stir together boiling-hot water, espresso powder, vanilla, and baking soda in a bowl, then add dates, mashing lightly with a fork, and steep until liquid cools to room temperature, about 10 minutes.",
        "Whisk together spelt flour, cocoa powder, baking powder, and salt in another bowl. Beat together butter and brown sugar with an electric mixer at medium-high speed until pale and fluffy. Add eggs 1 at a time, beating until just combined. Beat in date mixture (batter will look curdled), then reduce speed to low and add flour mixture, mixing until just combined.",
        "Spoon batter into springform pan, smoothing top, and bake until a wooden pick or skewer inserted into center comes out clean, about 50 minutes to 1 hour. Cool cake in pan on a rack 5 minutes, then remove side of pan and cool cake on rack. Serve cake warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) unsalted butter, softened, plus additional for pan",
        "3/4 cup unsweetened Dutch-process cocoa powder plus additional for dusting pan and cake",
        "1 cup boiling-hot water",
        "1 1/2 tablespoons instant-espresso powder",
        "1 1/2 teaspoons vanilla",
        "1 teaspoon baking soda",
        "1/2 lb Medjool dates (12 to 14), pitted and coarsely chopped (1 1/2 cups)",
        "2 cups spelt flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "1 cup packed dark brown sugar",
        "2 large eggs",
        "Special equipment: a 9-inch springform pan",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "High Fiber",
        "Date",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Espresso Spelt Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-espresso-spelt-cake-232816"
}
