{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Dust pan with cocoa powder. Tap out excess. Wrap outside of pan with heavy-duty foil.",
        "Place prunes in small bowl. Pour 1 cup prune juice over. Set aside to macerate 15 minutes.",
        "Melt margarine in heavy medium saucepan over low heat. Add chocolate and whisk until smooth. Remove from heat. Add 3/4 cup cocoa powder and whisk until smooth. Mix in walnuts and prune mixture. Cool to lukewarm.",
        "Using electric mixer, beat eggs, yolks, sugar and salt in large bowl at medium speed until well blended and just beginning to foam, about 1 minute. Add chocolate mixture and stir until well blended. Transfer batter to prepared springform pan. Set springform pan into large baking pan. Pour enough hot water into baking pan to come halfway up sides of springform pan. Set baking pan in oven and bake cake until top looks dry and crusty and tester inserted into center comes out with some moist crumbs attached, about 1 hour 5 minutes. Cool cake in pan on rack 30 minutes. Place in refrigerator uncovered and chill overnight.",
        "Bring juice and margarine to boil in heavy medium saucepan over medium heat. Remove from heat. Add chocolate and whisk until smooth. Cool until thick but still pourable, stirring occasionally, about 45 minutes.",
        "Line baking sheet with foil. Dip walnuts halfway into glaze. Arrange on prepared sheet and refrigerate until chocolate is set.",
        "Meanwhile, using small sharp knife, cut around sides of cake to loosen. Release pan sides. Set cake on rack. Pour glaze over cake and spread to coat completely. Arrange walnuts, chocolate half at outer edge, around top cake. Refrigerate until glaze is completely set, at least 3 hours. (Can be prepared 3 days ahead. Cover loosely with foil or cake dome and keep refrigerated.) Cut cake into wedges and serve."
    ],
    "ingredients": [
        "Unsweetened cocoa powder",
        "1 1/2 cups diced pitted prunes (about 8 ounces)",
        "1 cup prune juice",
        "1 cup (2 sticks) unsalted margarine",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup unsweetened cocoa powder",
        "1 cup coarsely chopped toasted walnuts (about 4 ounces)",
        "8 large eggs, room temperature",
        "2 large egg yolks",
        "1 3/4 cups sugar",
        "Pinch of salt",
        "1 cup prune juice",
        "1/4 cup (1/2 stick) unsalted margarine",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "24 walnut halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Passover",
        "Prune",
        "Walnut",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate, Walnut and Prune Fudge Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-walnut-and-prune-fudge-torte-1632"
}
