{
    "directions": [
        "Preheat oven to 375°F with rack in middle.",
        "Toast nuts in a small baking pan in oven until centers are golden, 12 to 15 minutes. Wrap in a kitchen towel and cool to warm, then rub off any loose skins. Chop nuts.",
        "Whisk together flour, cocoa, baking powder, and salt.",
        "Beat together butter and sugar in a large bowl with an electric mixer until pale and fluffy, then beat in egg and rum. At low speed, mix in flour mixture in 3 batches just until a dough forms. Stir in nuts.",
        "Divide dough in half and form each half into a 5-inch square. Wrap in plastic and chill until firm, at least 1 hour.",
        "Preheat oven to 375°F with racks in upper and lower thirds. Line 2 large baking sheets with parchment paper.",
        "Roll out 1 piece of dough between 2 sheets of parchment into an 11-to 12-inch square. Freeze on a tray until firm, about 20 minutes.",
        "Remove top sheet of parchment and cut out shapes with cookie cutters, arranging them 1/2 inch apart on baking sheets.",
        "Bake cookies, switching position and rotating sheets halfway through, until firm and tops are slightly cracked, 8 to 12 minutes total. Transfer cookies to racks to cool completely.",
        "Repeat with remaining dough (cool baking sheets and line with fresh parchment). Reroll scraps once for extra cookies if desired."
    ],
    "ingredients": [
        "1 cup hazelnuts (5 ounces)",
        "1 1/2 cups all-purpose flour",
        "3/4 cup unsweetened cocoa powder (not Dutch-process)",
        "1 1/4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 1/2 sticks unsalted butter, softened",
        "1 1/4 cups sugar",
        "1 large egg",
        "1 tablespoon dark rum",
        "Equipment: decorative cookie cutters (about 3 inches)",
        "Garnish:"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Rum",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Valentine's Day",
        "Hazelnut",
        "Christmas Eve",
        "Engagement Party",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Hazelnut Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-cookies-350933"
}
