{
    "directions": [
        "Bring all ingredients to boil in heavy small saucepan, stirring until sugar dissolves. Continue boiling 1 minute. Cool completely. (Can be prepared up to 2 days ahead. Cover and store at room temperature.)",
        "Combine 8 ounces walnuts, 6 ounces chocolate, dates, sugar and cinnamon in processor. Coarsely chop using on/off turns. Transfer filling to medium bowl. Mix in egg.",
        "Position rack in center of oven and preheat to 350°F. Lightly butter 13 x 9 x 2-inch metal baking pan. Place 1 phyllo sheet on work surface (keep remainder covered with plastic and damp towel to prevent drying). Brush phyllo with butter. Top with second phyllo sheet and brush with butter. Arrange sheets buttered side up and lengthwise in prepared pan, covering bottom and ends of pan. Brush another phyllo sheet with butter. Fold phyllo in half forming 8 x 12-inch rectangle and brush with butter. Repeat with 2 more phyllo sheets. Place 3 folded phyllo sheets in bottom of pan, buttered side up. Sprinkle half of filling over. Butter another phyllo sheet and fold in half. Butter top and place atop filling. Sprinkle remaining filling over. Repeat buttering and folding with 3 more phyllo sheets. Place atop filling. Butter last 2 phyllo sheets. Place lengthwise in pan, tucking in sides and ends of top and bottom sheets to enclose filling completely.",
        "Carefully cut through top layers of phyllo (do not cut through to filling) to form twenty-four 2-inch squares. Pour any remaining butter over. Bake until top is golden brown, about 45 minutes. Immediately spoon syrup over baklava. Cool completely. Cover and let stand at room temperature overnight.",
        "Melt 2 ounces chocolate and 1 tablespoon butter in heavy small saucepan. Dip walnut halves halfway into chocolate; shake off excess. Place on waxed paper and refrigerate until chocolate is set, about 30 minutes. (Can be prepared 1 day ahead. Cover walnuts with waxed paper.) Cut baklava into squares to platter. Place chocolate-dipped walnut half atop each square. Serve with whipped cream if desired."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/2 cup water",
        "Pinch of ground allspice",
        "Pinch of ground ginger",
        "Pinch of ground cloves",
        "8 ounces (about 2 cups) walnuts",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, cut into 1/2-inch pieces",
        "6 ounces (about 1 cup) whole pitted dates",
        "2 tablespoons sugar",
        "1 tablespoon ground cinnamon",
        "1 egg, beaten to blend",
        "11 sheets frozen phyllo pastry (about 1/2 pound), thawed",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon unsalted butter",
        "24 walnut halves",
        "Whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Ramadan",
        "Date",
        "Walnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Date-Nut Baklava",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-date-nut-baklava-1154"
}
