{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Butter the sides of two 9-inch cake pans and line the bottoms of the pans with 9-inch parchment paper.",
        "Beat unsalted butter and sugar in a large mixing bowl with an electric mixer until light and fluffy, about 5 minutes.",
        "Stir flour, baking powder, and salt in a bowl; set aside.",
        "Whisk egg whites, milk, and coconut extract in a separate bowl.",
        "Thoroughly mix about 1/3 of the flour mixture into the creamed butter and sugar; stir in half the egg white-milk mixture. Repeat twice more, ending with final 1/3 of flour mixture; stir to make a smooth batter.",
        "Pour batter into prepared cake pans and smooth tops with a spatula.",
        "Bake in the preheated oven until lightly browned and a toothpick inserted into the center of a cake comes out clean, 25 to 30 minutes.",
        "Cool cakes in pans on racks for about 5 minutes before turning out onto racks to cool completely. Peel parchment paper from cakes.",
        "Stir sweetened condensed milk, 1/4 cup heavy cream, and vanilla extract together in a bowl; stir in 3/4 cup flaked coconut. Refrigerate until chilled, about 1 hour.",
        "Bring 1/2 cup heavy cream to a simmer over low heat; gradually stir in chocolate until thoroughly melted and the mixture is thick and smooth. Allow to cool to lukewarm.",
        "Place a cake layer onto a serving platter; top with the condensed milk-coconut mixture. Place second cake layer over the coconut filling. Spread warm chocolate mixture evenly over top and sides of cake with a thin spatula.",
        "Toss 1 cup flaked coconut in a bowl with food coloring until coconut is evenly colored; sprinkle coconut over chocolate topping to serve."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3000&h=1571&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F829672.jpg",
    "ingredients": [
        "¾ cup unsalted butter, softened",
        "1 ½ cups white sugar",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "¼ teaspoon salt",
        "6  egg whites",
        "¾ cup milk",
        "2 teaspoons coconut extract",
        "1 (14 ounce) can sweetened condensed milk",
        "¼ cup heavy whipping cream",
        "1 teaspoon vanilla extract",
        "¾ cup sweetened flaked coconut",
        "½ cup heavy whipping cream",
        "8 ounces semisweet chocolate, chopped",
        "1 cup sweetened flaked coconut",
        "2 drops food coloring, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Coconut Cream Cake",
    "url": "http://allrecipes.com/recipe/220939/chocolate-coconut-cream-cake/"
}