{
    "directions": [
        "Mix first 3 ingredients in small bowl. Using electric mixer, beat butter, brown sugar and vanilla in medium bowl until creamy. Add flour mixture and stir with fork until coarse crumbs form. Gather dough into ball; flatten into disk. Wrap in plastic; chill until beginning to firm, about 20 minutes.",
        "Divide dough into 4 equal pieces. Press 1 dough piece evenly over bottom and up sides of each 4 1/2-inch-diameter tartlet pan with removable bottom. Freeze 20 minutes.",
        "Meanwhile, preheat oven to 350°F. Line crusts with foil; fill with dried beans or pie weights. Bake crusts until set, about 20 minutes. Remove foil and beans (some crust may stick to foil). Bake until crusts feel dry, about 5 minutes longer. Transfer to rack; cool completely.",
        "Combine cream and butter in medium saucepan. Stir over low heat until butter melts. Add chocolate; stir until melted. Whisk in Cognac. Cool filling 15 minutes.",
        "Spoon enough filling into each crust to fill (about 1/2 cup for each); reserve remaining filling. Refrigerate tartlets and remaining filling overnight.",
        "Line small baking sheet with foil. Form remaining filling into balls, using generous rounded 1/2 teaspoonful for each. Place on prepared sheet. Freeze 15 minutes. Roll each truffle in chopped pecans, coating completely. Freeze until truffles are firm, about 1 hour.",
        "Let tartlets stand at room temperature 15 minutes. Place paper in lattice pattern atop 1 tartlet. Sift cocoa over. Remove strips. Repeat with remaining tartlets. Garnish each with 3 truffles."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/4 cup plus 2 tablespoons unsweetened cocoa powder",
        "Pinch of salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup packed golden brown sugar",
        "1 1/2 teaspoons vanilla extract",
        "1 1/4 cups whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3 tablespoons Cognac or brandy",
        "2/3 cup finely chopped toasted pecans",
        "4 1/2-inch-wide by 5-inch-long paper strips",
        "Unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Pecan",
        "Cognac/Armagnac",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Cognac Truffle Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cognac-truffle-tartlets-546"
}
