{
    "directions": [
        "Position rack in center of oven and preheat to 400&;amp;deg;F. Brush two 8-inch-diameter cake pans with melted butter. Line bottoms with parchment paper. Brush parchment generously with butter. Reserving remaining butter.",
        "Place hazelnuts on small cookie sheet; place almonds on another small cookie sheet. Toast in oven until nuts are brown and fragrant, stirring occasionally, about 10 minutes for almonds and 14 minutes for hazelnuts. Cool. Gather hazelnuts in dish towels. Rub in towel to remove husks. Transfer hazelnuts and almonds to large bowl. Reduce oven temperature to 300°F.",
        "Add figs, apricots, citron, orange and lemon peels to nuts in large bowl. Combine flour, 3/4 cup cocoa powder and spices in small bowl. Add to nuts.",
        "Combine sugar, honey and remaining melted butter in heavy medium saucepan. Stir over medium heat until mixture is smooth and sugar is mostly dissolved, about 5 minutes. Bring to boil. Continue cooking until candy thermometer registers 248&;deg;F. (firm-ball stage). Immediately pour over mixture. Stir to combine thoroughly.",
        "Divide batter between prepared pans, using back of buttered spoon to spread evenly. Bake until tops and edges just begin to brown and tops feel dry, about 1 1/4 hours. Cool slightly on wire rack. Run small sharp knife around edges of pans to loosen cakes. Turn cakes out onto work surface; peel off parchment. Cool cakes completely.",
        "Arrange cakes top sides up on 8-inch cardboard rounds. Spread half of chocolate over each. Refrigerate until chocolate is set, about 1 hour.",
        "Brush tops of cakes with cocoa powder. Wrap tightly in plastic wrap, then wrap decoratively with colored cellophane. Tie ribbon with gift tag around cellophane to secure. (Panforte can be prepared up to 1 month ahead. Store at cool room temperature.)"
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 1/2 cups hazelnuts (about 7 1/2 ounces)",
        "1 cup whole unblanched almonds (about 5 ounces)",
        "1 1/2 cups lightly packed chopped dried Calimyrna figs (about 9 ounces)",
        "1 1/2 cups lightly packed chopped dried apricots (about 9 ounces)",
        "1 cup diced candied citron (about 5 ounces)",
        "2 tablespoons grated orange peel",
        "1 tablespoon grated lemon peel",
        "3/4 cup unbleached all purpose flour",
        "3/4 cup unsweetened cocoa powder (preferably Dutch-process)",
        "1 1/2 teaspoons ground cinnamon",
        "1 scant teaspoon ground nutmeg",
        "1 scant teaspoon ground coriander",
        "1/4 teaspoon pepper",
        "1/4 teaspoon ground cloves",
        "1 cup plus 2 tablespoons sugar",
        "1 cup plus 2 tablespoons honey",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate,melted",
        "Additional unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Nut",
        "Bake",
        "Christmas",
        "Lemon",
        "Orange",
        "Fig",
        "Apricot",
        "Almond",
        "Spice",
        "Winter",
        "Edible Gift",
        "Honey",
        "Hazelnut",
        "Christmas Eve"
    ],
    "title": "Chocolate-Hazelnut Panforte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-panforte-2869"
}
