{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line two 9 inch pans with parchment paper. Cut 9 inch circles, so bottoms will be smooth. Springform pans are preferred.",
        "Melt 2 squares chocolate in saucepan over low heat. Set aside.",
        "In a medium bowl, sift together cake flour, 1 1/2 cup sugar, baking powder, 1 teaspoon salt and soda.",
        "In a large bowl, with electric mixer, blend 1/2 cup shortening, 1 1/4 cup evaporated milk and 1 teaspoon vanilla. Add flour mixture and beat with mixer 2 minutes at medium speed.",
        "Add 2 eggs and mix until eggs are just blended. Add the melted 2 squares of chocolate (drizzle in while blending). Beat 1 minute at medium speed. Divide batter into two 9 inch pans.",
        "Melt remaining 2 squares of unsweetened chocolate. Drizzle melted chocolate in ring shape onto batter, about 1 to 2 inches from edge. Using a butter knife or thin spatula, swirl chocolate into pinwheel pattern with a large circular motion. Don't swirl too much as you want chunks to remain. Press knife or spatula all the way to bottom of pan as you swirl.",
        "Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until a toothpick inserted into center of cake comes out clean. Cool completely.",
        "To make the filling:  Melt 1 square of chocolate. In a large bowl, combine 2/3 cup shortening, 1/3 cup sugar, 1/4 cup evaporated milk 1/4 teaspoon salt, 1 teaspoon vanilla and water. Add melted chocolate and beat on high speed for 10 minutes.",
        "Using a long  serrated knife, divide each cooled cake into 2 layers. Spread filling between layers. Use prettiest pinwheel layer as top layer."
    ],
    "ingredients": [
        "4 (1 ounce) squares unsweetened chocolate",
        "1 3/4 cups sifted cake flour",
        "1 1/2 cups white sugar",
        "2 tablespoons baking powder",
        "1 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 teaspoon vanilla extract",
        "1 1/4 cups evaporated milk",
        "2 eggs",
        "1/2 cup shortening",
        "1 (1 ounce) square unsweetened chocolate",
        "2/3 cup shortening",
        "1/2 cup white sugar",
        "1/4 cup evaporated milk",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Pinwheel Cake",
    "url": "http://allrecipes.com/recipe/8354/chocolate-pinwheel-cake/"
}
