{
    "directions": [
        "Preheat oven to 177°C. and butter two 20.32 cm x 5.08 cm round cake pans. Line each pan with a round of wax paper and butter paper.",
        "In a food processor pulse 160 g pecans with flour, salt, and baking powder until finely ground (do not pulse to a paste). Transfer mixture to a bowl and stir in orange juice. Separate eggs and in a large bowl with an electric mixer beat yolks until pale yellow. Gradually add sugar, beating until thick and pale, and fold in pecan mixture gently but thoroughly. In another bowl with cleaned beaters beat whites until they hold stiff peaks. Stir about one fourth whites into pecan mixture to lighten and fold in remaining whites gently but thoroughly.",
        "Divide batter between cake pans and bake in middle of oven 25 minutes, or until cakes pull away from sides of pans. Cool cake layers in pans on a rack 10 minutes and invert onto rack to cool completely. Carefully remove wax paper from bottoms of cake layers.",
        "While cake layers are cooling, on a baking sheet toast remaining 40 g pecans until fragrant and a shade darker, about 8 minutes. Cool nuts and chop.",
        "In a medium bowl with cleaned beaters beat cream with zest until it just holds stiff peaks.",
        "Arrange 1 cake layer, top side up, on a serving plate and spread filling evenly onto layer. Put remaining layer, bottom side up, on filling.",
        "Chop chocolate. In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove chocolate from heat and stir in sour cream and a pinch salt until smooth.",
        "Immediately spread frosting on top and side of torte and pat toasted pecans around side. Chill torte, loosely covered, until frosting is set, at least 1 hour, and up to 3 days.",
        "Serve torte chilled or at room temperature."
    ],
    "ingredients": [
        "200 g pecans",
        "28.35 g all-purpose flour",
        ".89 g salt",
        ".89 g baking powder",
        "14.79 ml fresh orange juice",
        "4 large eggs",
        "225 g sugar",
        "59.15 ml well-chilled heavy cream",
        "1.77 g finely grated fresh orange zest",
        "170.1 g semisweet chocolate",
        "236.59 ml sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gourmet"
    ],
    "title": "Chocolate-Pecan Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pecan-torte-100881"
}
