{
    "directions": [
        "Grind hazelnuts with 1 tablespoon sugar in processor until mixture forms paste. Melt chocolate in small metal bowl set over saucepan of simmering water, stirring until smooth. Remove from over water.",
        "Whisk egg yolks, 2 tablespoons water, Frangelico and 2 tablespoons sugar in large metal bowl to blend. Set bowl over same saucepan of simmering water and whisk constantly until thick ribbons form when whisk is lifted and thermometer inserted into mixture registers 160°F, about 6 minutes. Cool mixture slightly. Fold in chocolate and hazelnut paste.",
        "Using electric mixer, beat egg whites and pinch of salt in large bowl until soft peaks form. Stir remaining 2 tablespoons sugar and 3 tablespoons water in very small saucepan over medium heat until sugar dissolves. Increase heat and boil until thermometer inserted into mixture registers 220°F, about 4 minutes. Gradually add hot syrup to whites, beating until firm peaks form and whites are cool. Fold into chocolate mixture in 2 additions.",
        "Beat 1/2 cup whipping cream in medium bowl until soft peaks form. Fold into mousse. Spoon mousse into 4 goblets, dividing equally. Chill mousse at least 1 hour and up to 1 day. Garnish each serving with whipped cream and toasted hazelnuts."
    ],
    "ingredients": [
        "1/2 cups hazelnuts (about 2 ounces), toasted, husked",
        "5 tablespoons sugar",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3 large eggs, separated",
        "5 tablespoons water",
        "2 tablespoons Frangelico (hazelnut liqueur) or brandy",
        "Pinch of salt",
        "1/2 cup chilled whipping cream",
        "Additional whipped cream",
        "Additional toasted hazelnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Valentine's Day",
        "Spirit",
        "Frangelico",
        "Chill",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Hazelnut Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-mousse-1069"
}
