{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Line 2 baking sheets with silicone baking mats.",
        "Stir water, butter, 1 teaspoon white sugar, and salt together in a pot; bring to a simmer. Add flour and stir with a wooden spoon until mixture pulls away from the sides of the pot and forms a thick, paste-like dough. Remove from heat and let cool for 10 to 15 minutes.",
        "Stir eggs into dough one at a time, mixing until egg is completely incorporated after each addition. Transfer 2/3 the dough to a large resealable plastic bag. Cut corner of the bag away, about 1/2-inch wide, to form an opening through which to pipe the dough.",
        "Pipe 8 tapered ovals of dough onto the prepared baking sheet to form the 'swan bodies', pulling up at the tapered end to form the 'tail/wingtips'.",
        "Bake in preheated oven until golden brown, 20 to 25 minutes.",
        "While the 'swan bodies' are baking, fill a smaller bag with with the remaining 1/3 the dough; cut a small tip from the corner. Pipe out S-shapes to form the swan 'necks'. At the top of each S, pipe out more dough to form the swan 'heads'.",
        "When the 'bodies' are halfway cooked, bake the 'necks' in the oven together with the swan 'bodies' oven until golden brown, 10 to 12 minutes.",
        "Turn off the oven, open the oven door slightly, and let pastries cool completely.",
        "Cut the top 1/3 off of each swan body horizontally, from fatter end to tapered end. Cut each top in half to form the 'wings'.",
        "Place chocolate in a heat-proof bowl. Bring 4 ounces heavy cream to a boil in a small saucepan. Pour hot cream over chocolate and whisk until chocolate is completely melted and ganache is shiny and smooth. Spoon or pipe chocolate ganache into the base of each swan 'body'.",
        "Beat 1 cup cold cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Add 1 tablespoon sugar and vanilla extract, continuing to beat until stiff peaks form. Transfer whipped cream into a piping bag with a star tip.",
        "Pipe cream to fill each swan 'body', piping up and out the top to resemble swan 'feathers'. Place 'wings' on each side of the 'body' sticking up out of the cream, and place 'neck' in the base of each swan. Refrigerate until chilled. Dust with confectioners' sugar."
    ],
    "ingredients": [
        "Pâte à Choux (Cream Puff Dough):",
        "1/2 cup water",
        "1/4 cup unsalted butter",
        "1 teaspoon white sugar",
        "1 pinch salt",
        "1/2 cup all-purpose flour",
        "2 eggs",
        "Ganache:",
        "4 ounces dark chocolate, chopped",
        "4 ounces heavy whipping cream",
        "Cream:",
        "1 cup cold heavy whipping cream",
        "1 tablespoon white sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon confectioners' sugar, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Cream Puff Swans",
    "url": "http://allrecipes.com/recipe/237598/chocolate-cream-puff-swans/"
}
