{
    "directions": [
        "Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.",
        "In a medium bowl, whisk together the flour, salt and baking soda, then set aside.",
        "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter with the brown sugar and granulated sugar on medium speed until light and fluffy, 3 to 5 minutes. Add 2 teaspoons of the vanilla extract and the eggs and blend until incorporated. Lower the speed to a stir, add the flour and mix until just combined. Then stir in 2 cups of the chocolate chips until incorporated.",
        "Drop the dough in teaspoon-size balls 2-inches apart onto the prepared baking sheets. Bake until the cookies are golden and crisp, 12 to 15 minutes. Cool the cookies for 5 minutes in the pan and then transfer to a wire rack to cool completely.",
        "Whip the heavy cream, confectioners' sugar and the remaining 1 tablespoon vanilla until medium peaks form. Place about 1/4 cup of the whipped cream in a 9-inch circle on a cake plate and then cover the whipped cream with some cookies. Layer 1 cup whipped cream over the cookies and arrange another layer of cookies over the top. Repeat the layers three more times, finishing with a layer of cream. Sprinkle the remaining 1/2 cup chocolate chips over the top. Refrigerate the cake until the cookies soften, at least 4 hours or up to overnight.",
        "Slice into wedges to serve."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "2 sticks (1 cup) unsalted butter, at room temperature",
        "1 cup packed light brown sugar",
        "1 cup granulated sugar",
        "1 tablespoon plus 2 teaspoons vanilla extract",
        "2 large eggs, at room temperature",
        "2 1/2 cups semisweet mini chocolate chips",
        "3 cups heavy cream",
        "1/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Chocolate Chip Cookie",
        "Cookie",
        "Dairy Recipes",
        "Dessert"
    ],
    "title": "Chocolate Chip Cookie Icebox Cake",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/chocolate-chip-cookie-icebox-cake"
}
