{
    "directions": [
        "Place a rack in middle of oven and preheat to 350°. Toast pecans on a rimmed baking sheet, tossing occasionally, until fragrant and darkened, 10–15 minutes (you want them well toasted). Let cool, then coarsely chop.",
        "Roll out dough on a lightly floured surface into a 13\" round. Transfer to pan. Lift up edge and allow dough to slump down into pan; trim excess. Prick dough in a few places with a fork to prevent bubbles. Cover with parchment paper or heavy-duty foil, leaving overhang. Fill with pie weights or dried beans.",
        "Place pan on a rimmed baking sheet and bake until crust is just golden and dry around the edge, 10–15 minutes. Remove pie weights and parchment and bake until golden brown and surface looks dry, 10–15 minutes longer. Transfer pan to a wire rack and let crust cool.",
        "Meanwhile, cook sugar and corn syrup in a medium pot over medium heat, stirring occasionally, until dark amber, 8–10 minutes. Remove from heat and, whisking, gradually add cream and bourbon, if using. Add chocolate, butter, and kosher salt, stirring until chocolate and butter are melted; stir in pecans. Scrape filling into crust; sprinkle with sea salt. Let sit at room temperature at least 1 hour before slicing.",
        "Do ahead: Tart can be baked 3 days ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "2 cups pecans",
        "Basic Tart Dough",
        "All-purpose flour (for surface)",
        "1 1/4 cups sugar",
        "1/4 cup light corn syrup",
        "1/4 cup heavy cream",
        "2 tablespoons bourbon (optional)",
        "1 ounce bittersweet chocolate, coarsely chopped",
        "2 tablespoons unsalted butter, cut into pieces",
        "1 teaspoon kosher salt",
        "Flaky sea salt (such as Maldon)",
        "A 10\"-diameter tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kid-Friendly",
        "Pecan"
    ],
    "title": "Chocolate-Caramel Pecan Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-caramel-pecan-tart-51255580"
}
