{
    "directions": [
        "Preheat an oven to 350 degrees F.",
        "Spread the hazelnuts in a single layer in a shallow pan and place them in the preheated oven, turning every now and again, until lightly toasted and the skins begin to blister, 15 to 18 minutes. Remove from the oven and let cool for 10 minutes. Then, working in batches, rub them between the palms of your hands until the skins loosen and fall away. (This will take some time and not every bit of skin will rub off.) Chop the hazelnuts coarsely.",
        "Using a nut mill, blender, or a food processor fitted with the metal blade, grind the hazelnuts to a fine powder. (If the nuts do become oily, pass them through a sieve to break up any lumps.) Place in a large mixing bowl and stir in the sugar.",
        "Add the butter, cocoa, honey, and vanilla and mix thoroughly with a wooden spoon. Add the egg whites, a little at a time, mixing well after each addition. Add only enough of the whites for the dough to take on the consistency of a loose paste or spritz cookie dough. Do not worry if all of the egg whites are not used.",
        "Line 2 baking sheets with parchment paper or grease them with butter. Spoon the hazelnut mixture into a pastry bag fitted with a No. 6 star tip. Pipe out rosettes 1 inch in diameter onto the prepared sheets, spacing the rosettes about 1 1/2 inches apart. You should have about 60 rosettes in all. Let the rosettes sit, uncovered, at room temperature overnight.",
        "Preheat an oven to 375 degrees F.",
        "Bake the cookies in the preheated oven until firm to the touch but still moist inside, 8 to 10 minutes. When they are done they will not brown and may even look undercooked, so you must test by touch. Remove to wire racks to cool completely.",
        "Meanwhile, melt the chocolate in the top pan of a double boiler placed over simmering water. Remove from the heat and let cool to room temperature, stirring occasionally. Gently turn half of the cookies top sides down on a flat surface and spread about 1/2 teaspoon chocolate on each of the upturned bottoms. As each cookie is coated, press a plain cookie onto the chocolate, bottom side down, to form a \"sandwich\". Lay the cookies on their sides on a tray or flat plate and refrigerate for 15 minutes to set the chocolate. Store in a covered container, at room temperature, for up to 1 week."
    ],
    "ingredients": [
        "3 cups whole raw hazelnuts",
        "2 cups sugar",
        "2 tablespoons unsalted butter, melted plus additional unsalted butter for baking sheets, optional",
        "1/2 cup Dutch-process unsweetened cocoa powder, sieved",
        "1 tablespoon honey",
        "2 teaspoons vanilla extract",
        "4 or 5 egg whites, at room temperature",
        "3 ounces semisweet chocolate"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Baking",
        "European Recipes",
        "Candy Recipes and Ideas",
        "Nut Recipes",
        "Pureeing Recipes",
        "Kid-Friendly"
    ],
    "title": "Chocolate-Hazelnut Smooches: Baci D'Alassio",
    "url": "http://www.foodnetwork.com/recipes/chocolate-hazelnut-smooches-baci-dalassio-recipe"
}
