{
    "directions": [
        "Blend together the flour, cocoa powder, and salt in a bowl. Using the metal blade in a food processor, pulse the butter and the powdered sugar together until combined. Add the flour and cocoa mixture to the food processor bowl and pulse until the mixture resembles coarse meal. Add the egg and pulse until incorporated. Dump the dough onto a piece of plastic wrap or into a plastic bag and gently knead until the dough holds together. Flatten into a 6-inch disk, cover with plastic wrap (or close plastic bag), and refrigerate for 30 minutes (until just firm enough to roll). Roll out dough into a 1/8-inch-thick circle between 2 lightly floured sheets of plastic wrap. Fit dough into ungreased tart pan. Patch any holes or rips by pressing in scraps of extra dough with your fingers. Trim excess dough so that there's 1/8 inch of dough above the top edge of the tart pan (to account for shrinkage while baking). Chill for 1 hour before baking.",
        "Put oven rack in middle position and preheat oven to 375°F. Lightly prick shell all over with a fork. If using pie weights: Line shell with parchment and fill with pie weights. Bake until pastry deepens in color (but does not brown), about 12 minutes. Remove parchment and bake for another 2 to 3 minutes more. If not using pie weights: Bake until pastry deepens in color (but does not brown), about 12 minutes. Check after the first 5 minutes; if center of tart puffs up, gently push down with the back of a spoon. Cool completely in the tart pan on a rack, about 20 minutes.",
        "Bring corn syrup, 3/4 cup sugar, and 2 tablespoons water to a boil in a 1 1/2- to 2-quart heavy saucepan over moderate heat, stirring until sugar is dissolved. Boil mixture, without stirring, swirling pan occasionally, until it melts into a deep golden caramel, 7 to 9 minutes. Remove saucepan from heat and add butter, vinegar, and a pinch of salt, swirling pan until butter is melted. Add 1/3 cup cream and vanilla and simmer, stirring, 1 minute (sauce will be golden brown). Cool sauce to warm.",
        "While sauce is cooling, sprinkle gelatin over remaining 2 tablespoons water in a small saucepan and let stand 1 minute to soften, then heat over low heat until dissolved. Stir into butterscotch sauce and cool to room temperature.",
        "Beat egg whites with a pinch of salt in a large bowl with an electric mixer until they hold soft peaks, then add remaining tablespoon sugar and continue to beat until whites just hold stiff glossy peaks. Fold in butterscotch sauce gently but thoroughly. Beat remaining cream with cleaned beaters until it just holds stiff peaks, then fold into butterscotch mixture gently but thoroughly. Gently pour chiffon into cooled pastry shell, letting it mound, and chill, uncovered, until set, at least 2 hours.",
        "Cook pecans in butter with salt in a small heavy skillet over moderate heat, stirring frequently, until golden, about 5 minutes. Remove from heat and cool nuts completely.",
        "Let tart stand at room temperature, about 30 minutes. Just before serving, sprinkle cooled nuts over top of tart."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "1 stick (8 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup powdered sugar",
        "1 large egg, beaten",
        "3 tablespoons light corn syrup",
        "3/4 cup plus 1 tablespoon sugar",
        "1/4 cup water",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 teaspoon cider vinegar",
        "1 1/3 cups chilled heavy cream",
        "1 1/2 teaspoons vanilla",
        "2 teaspoons unflavored gelatin (from 1 envelope)",
        "3 large egg whites",
        "1 cup chopped pecans (3 1/2 ounces)",
        "1 tablespoon unsalted butter",
        "1/8 teaspoon salt",
        "Special equipment: a 9-inch tart pan (1 inch deep) with a removable bottom; pie weights or raw rice (optional); a pastry or bench scraper (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vinegar",
        "Pecan",
        "Fall",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate Lovers' Butterscotch Chiffon Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-lovers-butterscotch-chiffon-tart-234017"
}
