{
    "directions": [
        "Preheat oven to 325°F. Butter an 8-inch round cake pan (about 2 inches deep) and line bottom with a round of parchment paper or foil.",
        "In medium saucepan bring water and sugar to a simmer over moderate heat, stirring occasionally. Add butter and simmer, stirring occasionally, until melted. Remove pan from heat and add chocolate, swirling pan to submerge chocolate in hot syrup. Let chocolate stand in syrup 3 minutes and whisk until smooth.",
        "In a large bowl whisk together eggs, coffee, rum, and cinnamon. Add chocolate mixture, whisking until well combined, and pour into cake pan.",
        "Put cake in pan in larger pan and add enough water to reach halfway up side of cake pan. Bake cake in middle of oven 45 minutes, or until slightly firm to the touch. Cool cake completely in pan on rack.",
        "Cake may be kept in pan, wrapped in plastic wrap, and chilled 1 week or frozen 1 month. Thaw cake completely before proceeding.",
        "Run a thin knife around pan to loosen cake and put pan on hot stove burner for 3 to 4 seconds. Invert cake onto a plate and remove parchment or foil. Bring cake to room temperature.",
        "In a bowl with an electric mixer or whisk beat cream with sugar and cinnamon until it just holds stiff peaks.",
        "Just before serving, spread cream over top of cake or spoon onto plates alongside individual pieces."
    ],
    "ingredients": [
        "1/3 cup of water",
        "1/3 cup sugar",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "12 ounces semisweet or bittersweet chocolate (not unsweetened), chopped coarse",
        "6 large eggs",
        "1/3 cup strong brewed coffee",
        "2 tablespoons dark rum if desired",
        "1/2 teaspoon cinnamon",
        "1 cup well-chilled heavy cream",
        "2 tablespoons sugar",
        "1 teaspoon cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Chill",
        "Gourmet"
    ],
    "title": "Chocolate Mousse Cake with Cinnamon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-mousse-cake-with-cinnamon-cream-14010"
}
