{
    "directions": [
        "Preheat oven to 350°F. Butter bottom and sides of an 8-inch square metal baking pan, then dust with cocoa powder, knocking out excess.",
        "Finely grind nuts in a food processor with flour, sugar, and salt.",
        "Melt butter in a 2-quart saucepan, then remove from heat. Add chocolate and whisk until smooth. Add eggs 1 at a time, whisking until smooth. Stir in nut flour until just combined.",
        "Spread batter evenly in baking pan and bake in middle of oven until top is firm and dry and a tester inserted into center comes out with crumbs adhering, 15 to 20 minutes. Cool completely in pan on a rack, at least 2 hours.",
        "Lightly beat yolks in a bowl. Bring cream with salt just to a boil in a small heavy saucepan, then add half of it to yolks in a slow stream, whisking constantly. Whisk yolk mixture into remaining cream and cook over low heat, whisking, until slightly thickened and an instant-read thermometer registers 170°F (do not let boil).",
        "Remove from heat and add chocolate, whisking until smooth. Pour ganache over hazelnut base in pan, smoothing top with offset spatula, and chill, covered, until firm, at least 5 hours.",
        "Cut into squares with a warmed thin knife, wiping off knife after each cut, and remove from pan while still cold.",
        "Serve truffles cold or at room temperature."
    ],
    "ingredients": [
        "Unsweetened cocoa powder for dusting",
        "1 cup hazelnuts, toasted , loose skins rubbed off with a kitchen towel, and cooled",
        "3/4 cup all-purpose flour",
        "1/2 cup sugar",
        "1/2 teaspoon salt",
        "1/2 stick ( 1/4 cup) unsalted butter",
        "6 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "2 large whole eggs",
        "2 large egg yolks",
        "1 cup heavy cream",
        "1/8 teaspoon salt",
        "12 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "Special equipment: a small metal offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Edible Gift",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Chocolate Hazelnut Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-truffles-105924"
}
