{
    "directions": [
        "Preheat oven to 350°F. Line bottom of a buttered 9-inch cake pan (2 inches deep) or springform pan with a round of wax paper. Butter paper and dust pan with flour, knocking out excess.",
        "In food processor pulse almonds with 1 tablespoon sugar until just ground fine. (Do not grind to point when oil is released.)",
        "In a bowl with an electric mixer cream butter with 1/4 cup remaining sugar until light and fluffy. Beat in yolks, 1 at a time, beating well after each addition, and beat in zest and kirsch. Stir almond sugar and chocolate into yolk mixture (mixture will be very thick). In another bowl with cleaned beaters beat whites until foamy and add a pinch salt and remaining 3 tablespoons sugar in a stream, beating until whites just hold stiff peaks. Fold one third whites into yolk mixture to lighten and fold in remaining whites gently but thoroughly. Pour batter into prepared pan and smooth top.",
        "Bake torte in middle of oven 45 to 55 minutes, or until it begins to pull away from side of pan. (Torte will fall slightly and continue to set as it cools.) Cool torte in pan on a rack and remove from pan. Torte may be made 1 day ahead and chilled, covered. Let torte come to room temperature before serving.",
        "Sprinkle torte with confectioners' sugar and serve with whipped cream and compote.",
        "In a small saucepan simmer all ingredients, covered, 5 minutes. Remove pan from heat and let mixture stand, covered, 10 minutes. Remove cover and cool completely. Compote may be made 2 days ahead and chilled, covered. Let compote come to room temperature before serving. Serves 6."
    ],
    "ingredients": [
        "3/4 cup whole blanched almonds (about 4 ounces), toasted lightly and cooled",
        "1/2 cup sugar",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "4 large eggs, separated",
        "1/2 teaspoon freshly grated orange zest",
        "1 tablespoon kirsch",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), broken into pieces and ground fine in a food processor",
        "Garnish: confectioners' sugar",
        "Accompaniments",
        "sweetened whipped cream",
        "sour cherry compote",
        "1 cup dried sour cherries, preferably unsweetened* (about 5 ounces)",
        "1/2 cup kirsch",
        "1/2 cup water",
        "3/4 cup cherry jam or preserves (about 7 ounces)",
        "1 cinnamon stick, broken in half",
        "a 3-inch strip orange zest",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Fall",
        "Gourmet"
    ],
    "title": "Chocolate Almond Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-almond-torte-13095"
}
