{
    "directions": [
        "Heat oven to 350°. Toast almonds on a small baking sheet for 10 minutes, stirring occasionally. Remove from oven; reduce heat to 325°. Coat an 8-inch springform pan with cooking spray. Wrap outside of pan in foil to prevent seepage. Process chocolate wafers and almonds in a food processor until fine crumbs. Sprinkle 2 to 3 tablespoon crumbs onto bottom of pan (just enough to coat bottom lightly). Shake pan to distribute evenly. Reserve remaining crumbs.",
        "Purée ricotta in a food processor until smooth, about 1 minute. Add cream cheese, sugar, sour cream, egg, egg whites, almond extract, flour and salt; puree until smooth. Whisk amaretto, if desired (or same amount of hot water), 2 tablespoon hot water, cocoa powder and espresso powder in a bowl until well combined. Stir in chocolate chips. Stir 1 cup plain filling into chocolate mixture. Set aside. Pour remaining plain filling into prepared pan. Drizzle chocolate filling in a circular pattern over plain filling. Using a knife, make circular strokes to create swirls in the plain filling. Add 1 inch hot water to a shallow baking pan; place springform pan in baking pan. Bake until cheesecake is firm around the edge and slightly soft in the center, 45 to 55 minutes. Run a knife around inside of pan. Remove foil; let cool on a rack. Chill 6 hours or overnight before removing sides of pan. Press reserved crumbs onto side of cheesecake."
    ],
    "ingredients": [
        "2 tablespoon slivered blanched almonds",
        "Vegetable oil cooking spray",
        "6 chocolate wafers",
        "15 ounces (1 3/4 cups) part-skim ricotta",
        "8 ounces lowfat cream cheese, room temperature",
        "1 cup sugar",
        "1/2 cup lowfat sour cream",
        "1 large whole egg",
        "2 egg whites",
        "1/4 teaspoon almond extract (or to taste)",
        "2 tablespoon all-purpose flour",
        "1/4 teaspoon salt",
        "2 tablespoon amaretto (if desired)",
        "3 tablespoon unsweetened cocoa powder",
        "1/2 teaspoon instant-espresso powder",
        "3 tablespoon bittersweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Low Fat",
        "Cream Cheese",
        "Ricotta",
        "Almond",
        "Amaretto",
        "Chill",
        "Healthy",
        "Sour Cream",
        "Self"
    ],
    "title": "Chocolate Marble Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-marble-cheesecake-241488"
}
