{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray.  Sift together the flour, cocoa powder, baking soda, and salt.",
        "In a mixing bowl, beat together 3 cups of sugar with canola oil with an electric mixer on low speed until the mixture is smooth; add 3 eggs one at a time, and beat again to combine. Beat in zucchini and vanilla until well combined. Beat the flour mixture into the sugar mixture by fourths, alternating with 1/4 cup of buttermilk after every portion of flour mixture. Mix the batter for 1 minute on medium-high speed, and pour the batter into the prepared baking pan.",
        "In a bowl, mix together the cream cheese and 1/4 cup of sugar until thoroughly combined, then mix in 1 egg until the cream cheese mixture is smooth. Spoon dollops of the cream cheese here and there over the cake batter, and swirl the cream cheese mixture through the batter with a table knife to make a marbled effect. Sprinkle the milk chocolate and semisweet chocolate chips over the cake.",
        "Bake in the preheated oven until a toothpick inserted into the chocolate portion of the center of the cake comes out with moist crumbs, 25 to 30 minutes. Cool on a rack."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "3 cups white sugar",
        "1 1/2 cups canola oil",
        "3 eggs",
        "3 cups grated zucchini",
        "1 teaspoon vanilla extract",
        "1 cup buttermilk",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1 egg",
        "1/2 cup milk chocolate chips",
        "1/2 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Swirl Zucchini Sheet Cake",
    "url": "http://allrecipes.com/recipe/215416/chocolate-swirl-zucchini-sheet-cake/"
}
