{
    "directions": [
        "In a small bowl let the prunes macerate in the Armagnac for at least 2 hours, or until they have absorbed most of the liquid. In a metal bowl set over a pan of barely simmering water combine the chocolate and the butter and heat the mixture, stirring occasionally, until the chocolate is melted and the mixture is smooth. Remove the bowl from the heat, stir in the prune mixture and the grated zest, and let the mixture cool completely. In a bowl with an electric mixer beat the heavy cream until it just holds stiff peaks, whisk about one fourth of it into the chocolate mixture, and fold in the remaining cream gently but thoroughly.",
        "Line an oiled 5- to 6-cup terrine or loaf pan with plastic wrap and pour the chocolate mixture into it, smoothing the top. Cover the terrine with plastic wrap and chill it overnight. Remove the plastic wrap from the top of the terrine, invert the terrine onto a plate, and peel off the remaining plastic wrap. Pour 1/4 cup of the Armagnac crème anglaise onto each of 8 dessert plates, cut the marquise into 3/4-inch slices with a sharp knife, and arrange a slice on each plate. Garnish the desserts with the candied orange zest.",
        "In a small heavy saucepan combine the half-and-half and the vanilla bean, bring the half-and-half just to a boil, and remove the pan from the heat. In a bowl whisk together the eggs and the sugar until the mixture is combined well and add the scalded half-and-half mixture in a slow stream, whisking. Transfer the mixture to a heavy saucepan and cook it over moderately low heat, stirring constantly with a wooden spoon, until it thickens (175°F. on a candy thermometer), but do not let it boil. Strain the crème anglaise through a fine sieve into a metal bowl set in a larger bowl of ice and cold water, let it cool, stirring, and stir in the Armagnac. Chill the sauce, covered, for at least 2 hours, or until it is very cold. The sauce may be made 2 days in advance and kept covered and chilled. Makes 2 cups.",
        "In a small heavy saucepan combine the zest and the liqueur, simmer the mixture until the liquid is just evaporated, and spread the zest on a sheet of wax paper, separating the pieces with a fork. Let the zest cool completely. The candied zest may be made 2 days in advance and kept between sheets of wax paper in an airtight container. Makes about 1/2 cup."
    ],
    "ingredients": [
        "1/2 pound pitted prunes, chopped fine (about 1 1/2 cups)",
        "1/2 cup Armagnac",
        "1 pound fine-quality bittersweet chocolate, chopped",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "1 1/2 teaspoons freshly grated orange zest",
        "1 cup well-chilled heavy cream",
        "2 cups Armagnac",
        "crème anglaise",
        "candied orange zest (recipe follows) for garnish",
        "2 cups half-and-half",
        "1 vanilla bean, split lengthwise",
        "2 large eggs",
        "1/2 cup sugar",
        "2 tablespoons Armagnac, or to taste",
        "2/3 cup julienne strips of fresh orange zest (removed with a zester)",
        "2/3 cup Cointreau or other clear orange liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Prune",
        "Cognac/Armagnac",
        "Triple Sec",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate and Prune Marquise with Armagnac Crème Anglaise",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-and-prune-marquise-with-armagnac-creme-anglaise-10764"
}
