{
    "directions": [
        "Set oven rack in lower middle position; preheat to 325°F. Spray disposable aluminum baking pan with nonstick spray. Press 18x12-inch sheet aluminum foil over bottom and up long sides of pan, leaving overhang on each long side. Spray foil with nonstick spray. Whisk flour, baking powder, and salt in small bowl. Stir both chocolates and 10 tablespoons butter in medium saucepan over medium-low heat until melted and smooth; remove from heat. Whisk sugar and vanilla, then eggs into chocolate mixture. Whisk until glossy and smooth, about 1 minute. Add dry ingredients and whisk just to blend.",
        "Pour batter into prepared pan. Bake until tester inserted into center comes out with some moist crumbs attached, about 24 minutes. Cool completely in pan on rack.",
        "Using electric mixer, beat room temperature cream cheese and next 3 ingredients in medium bowl until smooth. Spread cream cheese frosting over brownies. Sprinkle nuts or coconut over. DO AHEAD Chocolate brownies can be made 1 day ahead. Cover and chill. Using foil overhang for handles, remove brownies from pan. Cut into 18 squares; serve cold or at room temperature."
    ],
    "ingredients": [
        "1 (13x9x1-inch) disposable aluminum baking pan",
        "Nonstick vegetable oil spray",
        "2/3 cup all purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "4 ounces bittersweet or semisweet chocolate, chopped",
        "2 ounces unsweetened chocolate, chopped",
        "10 tablespoons (11/4 sticks) unsalted butter",
        "1 1/4 cups sugar",
        "2 teaspoons vanilla extract",
        "3 large eggs",
        "1 (8-ounce) package cream cheese, room temperature",
        "2/3 cup powdered sugar",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "1 1/2 teaspoons finely grated orange peel",
        "1/2 cup toasted pistachios, toasted sweetened flaked coconut, or untoasted sweetened flaked coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Kid-Friendly",
        "Halloween",
        "Orange",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Brownies with Orange Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-brownies-with-orange-cream-cheese-frosting-238813"
}
