{
    "directions": [
        "Bring cream and butter to a simmer in a 3- to 4-quart heavy saucepan, then reduce heat to low. Whisk in chocolate until smooth and remove from heat. Transfer ganache to a bowl and chill, covered, stirring every 30 minutes, until thickened but spreadable, about 2 hours. (If ganache becomes too stiff, let stand at room temperature until slightly softened.)",
        "Preheat oven to 350°F. Butter cake pans and line bottom of each with a round of parchment or wax paper. Butter paper and dust pans with flour, knocking out excess flour.",
        "Pulse chestnuts with flour, baking soda, and salt in a food processor until finely ground.",
        "Beat butter and brown sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes in a standing mixer or about 6 minutes with a handheld. Add eggs 1 at a time, beating well after each addition, then beat in vanilla (mixture will look a little separated). Reduce speed to low and add flour mixture and sour cream alternately in 3 batches, beginning and ending with flour and mixing until just combined.",
        "Divide batter evenly among pans and bake in middle of oven until pale golden and springy to the touch, about 30 minutes. Cool cakes in pans on racks, then invert onto racks and remove parchment.",
        "Melt butter and chocolate in a double boiler or a metal bowl set over a saucepan of barely simmering water, stirring until smooth, and stir in Cognac. Transfer to a bowl and chill, covered, stirring occasionally, until thickened to the consistency of softened butter, about 1 hour. (If mixture becomes too stiff, let stand at room temperature until softened.)",
        "Beat cream in a bowl with cleaned beaters until it just holds soft peaks, then chill, covered, while beginning to assemble torte.",
        "Put 1 cake layer on cardboard round on a rack set in a shallow baking pan (1 inch deep). Spread 1/2 cup ganache evenly over top of layer and sprinkle with all of chopped marrons glacés. Top marrons glacés with another 1/4 cup ganache and cover with another cake layer.",
        "Beat egg whites with a pinch of salt using cleaned beaters at medium-high speed until they just hold soft peaks. Add sugar and beat at high speed until whites just hold stiff peaks. Stir whipped cream into chocolate Cognac mixture, then stir in one third of whites to lighten. Fold in remaining whites gently but thoroughly. Spoon mousse immediately onto cake layer (it sets quickly), spreading evenly, then top with third cake layer. Chill torte, covered, until mousse layer is firm, about 1 hour. Keep remaining ganache at a spreadable consistency at room temperature, chilling, covered, if it becomes too soft.",
        "Reserve 1 1/4 cups ganache in a metal bowl, then spread remainder over top and side of torte to seal in crumbs. Chill until firm, about 1 hour.",
        "Set bowl of reserved ganache over a saucepan of barely simmering water, stirring until ganache reaches a pourable consistency. Remove bowl from heat and cool 5 minutes. Pour ganache evenly over top of torte, making sure it coats all of side. Shake rack gently to smooth glaze (let excess drip into baking pan). Transfer cake on cardboard to a cake stand or plate using 2 large heavy metal spatulas and chill until set. Garnish just before serving."
    ],
    "ingredients": [
        "2 cups heavy cream",
        "1/2 stick (1/4 cup) unsalted butter",
        "16 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "6 marrons glacés (candied chestnuts), finely chopped",
        "9 oz bottled whole shelled roasted chestnuts (1 1/2 cups)",
        "2 cups cake flour (not self-rising)",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/2 cups packed light brown sugar",
        "4 large eggs",
        "1 teaspoon vanilla",
        "3/4 cup sour cream",
        "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
        "8 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "5 tablespoons Cognac",
        "3/4 cup chilled heavy cream",
        "2 large egg whites",
        "1/4 cup granulated sugar",
        "Garnish: caramelized chestnuts",
        "Special equipment: 3 (8-inch) round cake pans; an 8-inch round of cardboard, covered with foil if not wax-coated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Christmas",
        "Cognac/Armagnac",
        "Winter",
        "Chill",
        "Chestnut",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Chocolate Chestnut Torte with Chocolate Cognac Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-chestnut-torte-with-chocolate-cognac-mousse-107439"
}
