{
    "directions": [
        "Spray the interior of the egg molds with nonstick vegetable spray. Place the cornstarch in a fine-mesh sieve and lightly dust the interior of the mold, coating evenly. Tap out the excess cornstarch. Set aside.",
        "Place 1/4 cup plus 1 tablespoon of the corn syrup in a heatproof bowl. Set aside.",
        "In a heavy-bottomed saucepan, combine the sugar, the remaining 1/4 cup corn syrup, and 1/2 cup of the water. Clip a thermometer to the side of the pan, and place the pan over medium heat, stirring frequently, until the mixture registers 110°F.",
        "While the sugar mixture is heating, combine the gelatin with the remaining 1/4 cup water in the top half of a double boiler. Place over (not touching) boiling water in the bottom pan and heat, stirring occasionally, for a few minutes, or until the gelatin has melted or \"bloomed.\" Do not allow the mixture to boil.",
        "Pour the hot sugar mixture and the bloomed gelatin into the bowl of corn syrup. Using a wire whisk, beat for about 5 minutes, or until fluffy. Beat in the flavored oil.",
        "Spoon an equal portion of the mixture into each of the prepared molds. Clips the molds together so that the two halves will come together to form an egg shape. Set aside for 8 hours or up to overnight, until very firm.",
        "When set, unclip the molds. The whole egg shapes can be easily tapped from the molds.",
        "Fill a pastry bag fitted with a plain fine tip or a cornet (see tips, below) with tempered chocolate. Decorate the eggs in any design you wish—a child's name, flowers and leaves, or an Easter bunny are just a few ideas. (Or, working with one at a time, place an egg on a dipping fork and dip the entire egg in chocolate, allowing the excess to drip off.) Place on a parchment paper–lined baking sheet to set until the chocolate hardens completely. The eggs should be eaten within 24 hours."
    ],
    "ingredients": [
        "1/4 cup cornstarch",
        "1/2 cup plus 1 tablespoon light corn syrup",
        "1 1/2 cups sugar",
        "3/4 cup water",
        "3 tablespoons unflavored powdered gelatin",
        "2 or 3 drops concentrated natural oil such as peppermint or orange",
        "4 ounces bittersweet chocolate, tempered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Chocolate",
        "Dessert",
        "Easter",
        "Candy Thermometer",
        "Double Boiler",
        "Marshmallow",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chocolate Marshmallow Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-marshmallow-eggs-357689"
}
