{
    "directions": [
        "To make the cake: Preheat the oven to 350 degrees F. Oil 3 (10-inch) cake pans and line the bottom with parchment paper. Alternately, oil the pans and then flour them.",
        "In the bowl of an electric mixer, combine the brown sugar and oil. Turn on the mixer to a low speed and mix in the eggs. Let the sugar, oil, and eggs mix while sifting together the flour, baking powder, soda, and salt in a separate bowl. Set this mixture aside.",
        "In another small bowl, mix the vanilla into the milk and set this aside as well. Bring the water to a boil and pour over the cocoa and whisk it until it is smooth. To the egg mixture, alternately add the flour mixture and the milk mixture beginning and ending with flour. With the mixer off, scrape down the sides of the bowl after each addition. With the mixture at a low speed add the cocoa. Scrape down the sides of the bowl and pour this mixture into the prepared cake pans. Bake the cake for approximately 15 minutes or until tester comes out clean. When cake layers have cooled, remove from pans and refrigerate until cold.",
        "To make the frosting: In an electric mixing bowl place the soft butter and beat it on a low speed while adding powdered sugar. When all the sugar is mixed in, turn off the mixer and scrape down the sides of the bowl. Add in the vanilla and salt and let the mixer beat for 5 to 7 minutes on a medium speed. Fill and frost the cake and refrigerate it for 10 to 20 minutes to set up the frosting.",
        "To make the ganache: In a heatproof bowl, place the chocolate chips and the corn syrup. Bring the heavy cream to a full boil. Pour the cream over the chocolate and whisk it until smooth then set it aside.Pour ganache over the top of the cake and, with a cake spatula, smooth the top of the cake and allow ganache to spill over the sides. Refrigerate for 20 minutes or longer.",
        "Serve the cake cold or allow it to come to room temperature before serving."
    ],
    "ingredients": [
        "3 cups packed brown sugar",
        "3/4 cup canola oil",
        "3 eggs",
        "2 2/3 cups flour",
        "2 1/4 teaspoons baking powder",
        "2 1/4 teaspoons baking soda",
        "1 1/2 teaspoons salt",
        "1 tablespoon vanilla extract",
        "1 1/2 cups milk",
        "1 1/2 cups water",
        "1 1/8 cups cocoa powder",
        "1 1/2 pounds sweet butter, soft",
        "3 cups sifted powdered sugar",
        "2 tablespoons vanilla extract",
        "1 pinch salt",
        "1 1/4 cups semisweet chocolate chips",
        "3/4 tablespoon light corn syrup",
        "3/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dessert",
        "American",
        "Dairy Recipes",
        "Recipes for Parties",
        "Holiday"
    ],
    "title": "Chocolate Fudge Cake with Vanilla Buttercream Frosting and Chocolate Ganache Glaze",
    "url": "http://www.foodnetwork.com/recipes/chocolate-fudge-cake-with-vanilla-buttercream-frosting-and-chocolate-ganache-glaze-recipe"
}
