{
    "directions": [
        "Pulse cocoa powder, sugar, salt, and 1 1/4 cups flour in a food processor to combine. Add butter; pulse until mixture resembles coarse meal. Beat egg yolk and 3 tablespoons ice water in a small bowl; add to flour mixture and pulse until dough just comes together. Form into a 3/4\"-thick disk, wrap tightly in plastic, and chill until firm, at least 2 hours.",
        "Preheat oven to 350°F. Roll out dough on a lightly floured surface to a 12\" round. Transfer to tart pan; lift up edges and let dough slump down into pan, then gently press into edge of pan. Trim dough, leaving about a 1\" overhang. Fold in overhang; press to adhere. Prick bottom with a fork. Chill in freezer 15 minutes.",
        "Line pie with parchment paper or heavy-duty foil, leaving a 1 1/2\" overhang. Fill with pie weights or dried beans. Place on a rimmed baking sheet and bake until crust is dry around the edges, about 30 minutes.",
        "Remove parchment and weights and bake until crust is firm and looks dry all over, 5–10 minutes longer. Transfer pan to a wire rack and let crust cool.",
        "DO AHEAD: Dough can be made 2 days ahead; keep chilled. Crust can be baked 1 day ahead; store tightly wrapped at room temperature.",
        "Preheat oven to 350°F. Toast almonds on a rimmed baking sheet, stirring occasionally, until slightly darkened, 6–8 minutes. Let cool.",
        "Bring almonds, maple sugar, maple syrup, salt, and 1/4 cup water to a boil in a medium saucepan. Reduce heat and cook, stirring often, until mixture turns mahogany, about 5 minutes.",
        "Remove pot from heat and stir vigorously until almonds are coated with crystallized sugar (they will look sandy). Spread out on a parchment-lined baking sheet; let cool, then coarsely chop.",
        "DO AHEAD: Nuts can be candied 2 weeks ahead. Store airtight at room temperature.",
        "Combine chocolate and butter in a large heatproof bowl. Bring cream, honey, and salt to a boil in a small saucepan, whisking to dissolve honey. Pour cream mixture over chocolate mixture; let stand 2 minutes. Whisk until chocolate is melted and mixture is smooth. Pour filling into crust and chill until set, at least 4 hours.",
        "Top tart with maple almonds just before serving.",
        "DO AHEAD: Tart can be made 2 days ahead; cover and keep chilled. Bring to room temperature before serving."
    ],
    "ingredients": [
        "2 tablespoons unsweetened cocoa powder",
        "2 tablespoons sugar",
        "3/4 teaspoon kosher salt",
        "1 1/4 cups all-purpose flour, plus more for rolling",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1 large egg yolk",
        "1/2 cup raw almonds",
        "1/2 cup maple sugar or (packed) brown sugar",
        "1 tablespoon pure maple syrup",
        "1/4 teaspoons kosher salt",
        "10 ounces bittersweet chocolate (at least 70% cacao), chopped",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
        "1 1/2 cups heavy cream",
        "3 tablespoons honey",
        "1/2 teaspoon kosher salt",
        "Special equipment: A 9\"-diameter tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Valentine's Day",
        "Tree Nut",
        "Almond",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-on-Chocolate Tart with Maple Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-on-chocolate-tart-with-maple-almonds-51215040"
}
