{
    "directions": [
        "Preheat the oven to 350 degrees F. Line cupcake pans with paper liners.",
        "In the bowl of an electric mixer fitted with a paddle attachment, cream the butter and two sugars on high speed until light and fluffy, approximately 5 minutes. Lower the speed to medium, add the eggs one at a time, then add the vanilla and mix well. In a separate bowl, whisk together the buttermilk, sour cream and coffee. In another bowl, sift together the flour, cocoa, baking soda and salt. On low speed, add the buttermilk mixture and the flour mixture alternately in thirds to the mixer bowl, beginning with the buttermilk mixture and ending with the flour mixture. Mix only until blended. Fold the batter with a rubber spatula to be sure it's completely blended.",
        "Divide the batter among the cupcake pans (one rounded standard ice cream scoop per cup is the right amount). Bake in the middle of the oven for 20 to 25 minutes, until a toothpick comes out clean. Cool for 10 minutes, remove from the pans and allow to cool completely before frosting.",
        "Frost each cupcake with the peanut butter icing and sprinkle with chopped peanuts if desired.",
        "Place the confectioners' sugar, peanut butter, butter, vanilla and salt in the bowl of an electric mixer fitted with a paddle attachment. Mix on medium-low speed until creamy, scraping down the bowl with a rubber spatula as you work. Add the cream and beat on high speed until the mixture is light and smooth."
    ],
    "ingredients": [
        "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature",
        "2/3 cup granulated sugar",
        "2/3 cup light brown sugar, packed",
        "2 extra-large eggs, at room temperature",
        "2 teaspoons pure vanilla extract",
        "1 cup buttermilk, shaken, at room temperature",
        "1/2 cup sour cream, at room temperature",
        "2 tablespoons brewed coffee",
        "1 3/4 cups all-purpose flour",
        "1 cup good cocoa powder",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon kosher salt",
        "Kathleen's Peanut Butter Icing, recipe follows",
        "Chopped salted peanuts, to decorate, optional",
        "1 cup confectioners' sugar",
        "1 cup creamy peanut butter",
        "5 tablespoons unsalted butter, at room temperature",
        "3/4 teaspoon pure vanilla extract",
        "1/4 teaspoon kosher salt",
        "1/3 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cupcake",
        "Chocolate",
        "Cupcake",
        "Baking",
        "Dessert",
        "Peanut Butter Fudge"
    ],
    "title": "Chocolate Cupcakes and Peanut Butter Icing",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/chocolate-cupcakes-and-peanut-butter-icing"
}
