{
    "directions": [
        "Preheat oven to 350°F.",
        "In a baking pan toast nuts in one layer in middle of oven 10 minutes, or until almonds are lightly colored and hazelnut skins are blistered. Wrap nuts in a kitchen towel and let steam 1 minute. Rub nuts in towel to remove any loose hazelnut skins (do not worry about skins that do not come off) and cool completely.",
        "Line a baking sheet with foil. In a small heavy saucepan bring sugar and water to a boil, stirring until sugar is dissolved. Boil syrup, without stirring, washing down any sugar crystals that cling to side of pan with a pastry brush dipped in cold water, until it begins to turn golden. Swirl pan until syrup is deep golden and remove from heat. Stir in nuts and pour praline onto baking sheet, spreading evenly. Cool praline completely and break into pieces. Transfer praline to a sealable plastic bag and with a rolling pin coarsely crush.",
        "Preheat oven to 300°F. Generously butter a 9-inch round cake pan (at least 2 inches deep) and line bottom with wax or parchment paper. Butter paper and dust pan with flour, knocking out excess.",
        "Finely chop chocolate. In a small saucepan combine cocoa powder, butter, oil, and water. Bring mixture to a boil, stirring until smooth, and remove pan from heat. Add chocolate and sugar, whisking until smooth, and transfer to a bowl. Cool chocolate mixture completely and whisk in egg. Sift flour and baking powder over chocolate mixture and whisk until just combined. Whisk in buttermilk and pour batter into cake pan, spreading evenly. Bake cake in middle of oven 45 to 50 minutes, or until a tester comes out clean, and cool in pan on a rack 5 minutes. Run a thin knife around edge of pan and invert cake onto rack. Discard paper. Cool cake completely and transfer to a plate. In a bowl stir together mascarpone and sugar. Spread mixture over top of cake and generously sprinkle with praline."
    ],
    "ingredients": [
        "1/2 cup whole blanched almonds",
        "1/2 cup hazelnuts",
        "3/4 cup sugar",
        "1/4 cup water",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1/3 cup unsweetened cocoa powder (not Dutch process)",
        "5 tablespoons unsalted butter",
        "1/3 cup vegetable oil",
        "2/3 cup water",
        "1 cup plus 2 tablespoons sugar",
        "1 large egg",
        "1 1/4 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/3 cup well-shaken buttermilk",
        "8 ounces mascarpone cheese (about 1 cup) at room temperature",
        "1 1/2 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Almond",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Chocolate Cake with Mascarpone and Praline",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cake-with-mascarpone-and-praline-101524"
}
