{
    "directions": [
        "Preheat the oven to 325 degrees F. Line a few sheet pans with parchment paper.",
        "In a bowl set over simmering water, melt the butter, 6 ounces of the chocolate chips, and the unsweetened chocolate, stirring occasionally, until just melted. Remove from the heat and cool for 15 minutes.",
        "In the bowl of an electric mixer fitted with the paddle attachment, beat the eggs, espresso powder, and vanilla until combined. Add the sugar, raise the speed to medium-high, and beat for 2 minutes, until the batter is thick and falls back on itself in a ribbon. Set aside.",
        "With the mixer on low, slowly add the chocolate mixture to the egg mixture. Combine the 1/3 cup of flour, baking powder, and salt in a small bowl and fold it into the chocolate mixture with a rubber spatula. In another bowl, combine the walnuts, pecans, peanut butter chips, the remaining 6 ounces of chocolate chips, and the tablespoon of flour and fold it into the chocolate mixture. With 2 soup spoons, drop rounded mounds of batter 1 inch apart onto the prepared sheet pans. Bake for 15 minutes exactly. Cool on the baking sheets."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "12 ounces semisweet chocolate chips, divided",
        "2 ounces unsweetened chocolate",
        "2 extra-large eggs",
        "1 tablespoon instant espresso powder, such as Medaglia d'Oro",
        "2 teaspoons pure vanilla extract",
        "3/4 cup sugar",
        "1/3 cup plus 1 tablespoon all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon kosher salt",
        "1 cup whole walnut halves (not chopped)",
        "1 cup whole pecan halves (not chopped)",
        "2/3 cup peanut butter chips, such as Reese's"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Peanut Butter Fudge",
        "Chocolate"
    ],
    "title": "Chocolate Peanut Butter Globs",
    "url": "http://www.foodnetwork.com/recipes/chocolate-peanut-butter-globs"
}
