{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking dish.",
        "Stir 1/2 cup brown sugar and 1 1/2 teaspoons cinnamon together in a small bowl. Stir dark brown sugar, walnuts, and 1 teaspoon sugar together in another bowl. Whisk flour, baking soda, baking powder, and salt together in third bowl.",
        "Beat butter and white sugar together in a large bowl with an electric mixer until creamy. Mix sour cream into butter mixture. Add eggs one at a time, thoroughly beating each egg into the butter mixture before adding the next. Add vanilla with the last egg.",
        "Stir flour mixture into butter mixture; add chocolate chips and stir until batter is well-combined. Pour 1/2 of the batter into the prepared baking dish. Sprinkle the brown sugar-cinnamon mixture over the top of the batter. Pour remaining batter over the top. Spread walnut mixture evenly over the top of the batter to cover the entire surface of the cake.",
        "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 35 to 40 minutes. Cool in the baking dish."
    ],
    "ingredients": [
        "Swirl Filling:",
        "1/2 cup brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "Topping:",
        "1/2 cup dark brown sugar, or more to taste",
        "1/2 cup chopped walnuts, or more to taste",
        "1 teaspoon ground cinnamon, or more to taste",
        "Cake:",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup butter, softened",
        "1 cup white sugar",
        "1 cup sour cream",
        "3 eggs, room temperature",
        "1 tablespoon vanilla extract",
        "3/4 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Chip Sour Cream Coffee Cake",
    "url": "http://allrecipes.com/recipe/237505/chocolate-chip-sour-cream-coffee-cake/"
}
