{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease three 9-inch round baking pans.",
        "Combine 8 ounces baking chocolate and 2 tablespoons cream in a saucepan over low heat; cook and stir until chocolate is melted, about 5 minutes. Set aside to cool.",
        "Beat 1 cup butter, white sugar, and brown sugar together in a bowl using an electric mixer until creamy; mix in sour cream, 1 cup coffee, eggs, and vanilla extract. Slowly beat in melted chocolate mixture until combined.",
        "Mix flour, baking soda, baking powder, and salt together in a bowl; beat flour mixture into butter mixture until well combined and smooth. Pour batter into the 3 prepared baking pans.",
        "Bake in the preheated oven until a toothpick inserted in the center of a cake comes out clean, 20 to 30 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Heat 1/2 cup cream and 4 ounces baking chocolate together in a saucepan over medium heat, stirring constantly, until chocolate is melted, about 5 minutes. Remove saucepan from heat and stir in 1/3 cup coffee. Refrigerate mixture until completely cooled, about 30 minutes.",
        "Beat confectioners' sugar and 1 cup butter into cooled chocolate mixture in a large bowl until fluffy; add more confectioners' sugar until desired consistency is reached.",
        "Place 1 cake on a serving platter; spread icing on top of cake. Repeat layering with remaining cake and icing; spread icing on top and sides of entire layered cake."
    ],
    "ingredients": [
        "8 (1 ounce) squares baking chocolate",
        "2 tablespoons heavy whipping cream",
        "1 cup butter, softened",
        "1 cup white sugar",
        "1 cup brown sugar",
        "3/4 cup cocoa powder",
        "1 cup sour cream",
        "1 cup cold coffee",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "Chocolate Buttercream Icing:",
        "1/2 cup heavy whipping cream",
        "4 (1 ounce) squares baking chocolate",
        "1/3 cup cold coffee",
        "2 cups confectioners' sugar, or more as needed",
        "1 cup butter, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Lover's Cake with Chocolate Buttercream Icing",
    "url": "http://allrecipes.com/recipe/232882/chocolate-lovers-cake-with-chocolate/"
}
