{
    "directions": [
        "Boil apricot nectar in heavy medium saucepan over high heat until reduced to 1 cup, about 5 minutes. Pour reduced nectar into large bowl. Cool to 120°F. to 125°F. Whisk in flour, sugar, milk powder and yeast. Cover tightly with plastic wrap and let rise in warm draft-free area until double in volume, about 30 minutes.",
        "Generously butter 12-cup kugelhupf pan. Using electric mixer, cream butter with sugar in large bowl until fluffy. Beat in eggs and egg yolks 1 at a time. Beat in apricot brandy, salt, vanilla and ginger. Combine yeast and 2 tablespoons hot water in small bowl and stir until yeast dissolves. Mix yeast mixture and sponge into butter mixture. Gradually mix in 3 cups flour. Combine chocolate, apricots, brown sugar and cinnamon in medium bowl. Mix into dough.",
        "Spoon dough into prepared pan. Cover tightly with plastic wrap and clean kitchen towel. Let stand in warm draft-free area until dough rises just to top of pan, about 3 hours.",
        "Position rack in center of oven and preheat to 350°F. Bake kugelhupf until deep brown and cracking on top and tester inserted in center comes out clean, about 48 minutes. Cool on rack 20 minutes. Turn out onto rack and cool completely. (Can be prepared 1 day ahead. Return to pan, cover tightly and store at room temperature.)",
        "Stir chocolate and 2 tablespoons cream in heavy small saucepan over low heat until chocolate melts and mixture is smooth. Cool. Beat remaining 2 cups cream and sugar in large bowl until soft peaks form. Add brandy and continue beating until stiff peaks form. Pour chocolate mixture over cream and fold together until whipped cream is lightly streaked with chocolate. Transfer to serving bowl; chill. (Can be prepared 8 hours ahead.)",
        "Place kugelhupf on platter. Lightly sift powdered sugar over. Cut into wedges. Serve, passing whipped cream separately if desired."
    ],
    "ingredients": [
        "1 1/2 cups apricot nectar",
        "1 1/2 cups sifted all purpose flour",
        "1/4 cup sugar",
        "1/4 cup nonfat dry milk powder",
        "1 envelope fast-rising dry yeast",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 cup sugar",
        "2 large eggs",
        "3 large egg yolks",
        "3 tablespoons apricot-flavored brandy or apricot nectar",
        "1 1/4 teaspoons salt",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground ginger",
        "1 envelope fast-rising dry yeast",
        "2 tablespoons hot water (120°F. to 125°F.)",
        "3 1/2 cups sifted all purpose flour",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "6 ounces moist dried apricots, quartered",
        "2 tablespoons firmly packed golden brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "Powdered sugar",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 cups plus 2 tablespoons whipping cream",
        "2 tablespoons sugar",
        "3 tablespoons apricot-flavored brandy or apricot nectar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Apricot",
        "Brandy",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Apricot Kugelhupf",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-apricot-kugelhupf-1158"
}
