{
    "directions": [
        "Preheat oven to 350 degrees F. Grease bottoms of three 8- or 9-inch-round cake pans; line with a parchment or wax paper circle. Grease parchment, then coat lightly with small amount of cocoa, tapping out excess.",
        "Sift flour,  cup cocoa, baking soda and salt together into a large bowl. Combine buttermilk, coffee and vanilla extract in small bowl.",
        "Beat butter in large mixer bowl until smooth. Beat in sugar until smooth and creamy. Beat in eggs one at a time, beating well after each addition. Scrape down sides of bowl with rubber spatula; beat again. Alternately add flour mixture in three additions with the buttermilk mixture in two additions, beginning and ending with flour mixture. Scrape down sides of bowl; beat again. Pour batter evenly into prepared pans.",
        "Bake for 20 to 25 minutes or until wooden pick inserted in center comes out clean. Cool in pans on wire racks for 10 minutes. Invert each layer onto wire rack; remove parchment paper, then invert right-side-up. Cool completely.",
        "To assemble: Level (trim tops off) the cakes if desired using a serrated knife. Place a dollop of frosting in the center of a cake pedestal or serving platter so the cake won't slip. Tear four strips of parchment paper and place in a square around the outer 3 inches of pedestal (this will help prevent getting the frosting on the pedestal). Place one cake layer over dollop of frosting. Spread about 1 cup frosting over top; sprinkle top evenly with about 1/4 cup chopped Crunch bar. Top with another cake layer; spread with about 1 cup frosting. Sprinkle with remaining chopped Crunch bar. Top with third cake layer.  Cover the top and sides with a thin layer of frosting (this is the \"crumb coat\"; it doesn't have to be perfect). Refrigerate for 15 minutes, then cover with the remaining frosting. With hands, press chopped Butterfinger around sides of cake. After the frosting has set, gently remove strips of parchment paper. Cut cake into slices for serving."
    ],
    "ingredients": [
        "3/4 cup NESTLE® TOLL HOUSE® Baking Cocoa, plus extra for coating pans",
        "2 1/4 cups cake flour",
        "2 teaspoons baking soda",
        "1 teaspoon fine salt",
        "1 1/4 cups buttermilk, at room temperature",
        "1/2 cup brewed coffee or water",
        "2 teaspoons vanilla extract",
        "1 cup unsalted butter, at room temperature",
        "2 cups superfine sugar",
        "4 large eggs, at room temperature",
        "2 (16 ounce) containers prepared chocolate frosting, or more if needed",
        "1 (1.55 ounce) bar NESTLE® CRUNCH® Candy Bars, finely chopped (or more if needed)",
        "24 pieces NESTLE® BUTTERFINGER® Bites Candy, finely chopped (or more if needed)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Buttermilk Layer Cake",
    "url": "http://allrecipes.com/recipe/232055/chocolate-buttermilk-layer-cake/"
}
