{
    "directions": [
        "Whisk together flour, brown sugar, cocoa powder, and salt in a bowl.",
        "Melt chocolate and butter in a metal bowl set over a saucepan of barely simmering water, stirring occasionally, until smooth. Remove bowl from heat and stir in eggs, zest, and flour mixture until just combined. (Dough will be soft.)",
        "Roll out dough between parchment sheets into an 8-inch round (1/2 inch thick). Transfer round (still in parchment) to a large baking sheet and chill until firm, at least 1 hour, or freeze at least 30 minutes.",
        "Preheat oven to 350°F.",
        "Remove top sheet of parchment paper and replace it loosely. Flip over paper-enclosed round and discard paper now on top. Cut out about 20 cookies with cookie cutter and arrange about 1 inch apart on a buttered large baking sheet. Reroll scraps between parchment sheets and cut out 12 more cookies (chill or freeze dough as needed if it becomes too soft to handle).",
        "Bake cookies in middle of oven until matte (dough will start out shiny and turn dull), about 10 minutes, then transfer with a spatula to a rack to cool completely. (Cookies will have a fudgy consistency.)",
        "Beat cream and sugar with an electric mixer until it just holds stiff peaks. Top each cookie with 1/2 teaspoon cream and a piece of orange."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "2/3 cup packed dark brown sugar",
        "2 tablespoons unsweetened cocoa powder",
        "1/2 teaspoon salt",
        "7 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "1/2 stick (1/4 cup) unsalted butter, cut into pieces",
        "2 large eggs",
        "2 teaspoons finely grated fresh orange zest",
        "1/2 cup chilled heavy cream",
        "1 teaspoon sugar",
        "4 navel orange segments, membranes discarded from each and fruit cut into 1/4-inch pieces",
        "Special equipment: 2 (12-inch-long) sheets of parchment paper; a 1 1/2-inch round fluted cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Orange",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Orange Petits Fours",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-petits-fours-108003"
}
