{
    "directions": [
        "1. Preheat oven to 375°F. Grease 3 mini-muffin tins with nonfat cooking spray.",
        "2. In a large bowl, whisk together the sugar, oil, and 2 teaspoons of the vanilla. Add the eggs one at a time, whisking well after each, then add the buttermilk or yogurt. Whisk in the zucchini, lemon zest, and half the orange zest.",
        "3. In a medium bowl, combine the flour, cocoa, baking soda, salt, and cinnamon, whisking to aerate. Stir half the flour mixture into the egg mixture, then the other half. Fold in the nuts (if using) and distribute the batter evenly into the muffin tins.",
        "4. Bake on the center rack until springy but firm to the touch and lightly browned around the edges, about 30 minutes. Cool in the pans for about 10 minutes, then remove and let cool completely.",
        "5. To make the icing, blend the cheese and butter in the bowl of a food processor until they are well combined and no lumps remain. Add the confectioners' sugar, orange juice, and the remaining vanilla and orange zest, and process until smooth.",
        "6. Ice the muffins with a knife (or forgo the icing if you'd like to convert these muffins from an after-dinner treat to a healthy breakfast). Serve the same day or store in the refrigerator for up to 3 days."
    ],
    "ingredients": [
        "2 cups granulated sugar",
        "3/4 cup canola or vegetable oil",
        "2 1/2 teaspoons vanilla extract",
        "3 large eggs",
        "1/3 cup buttermilk or plain yogurt",
        "2 1/4 cups shredded zucchini",
        "Zest of 1 lemon, finely grated",
        "Zest (finely grated) and juice of 1 orange",
        "2 1/2 cups all-purpose flour",
        "1/2 cup cocoa powder",
        "11/2 teaspoons baking soda",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 cup chopped pecans or walnuts (optional)",
        "8 ounces Neufchâtel or cream cheese, at room temperature",
        "3 ounces unsalted butter, at room temperature",
        "1/3 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Chocolate",
        "Dairy",
        "Egg",
        "Nut",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Yogurt",
        "Summer",
        "Cookie",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Zucchini Mini-Muffins",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-zucchini-mini-muffins-239164"
}
