{
    "directions": [
        "Preheat oven to 350°F. Line fourteen 1/2-cup muffin cups with foil baking cups and lightly spray foil with cooking spray.",
        "Chop chocolate. In a double boiler or in a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring occasionally. Remove top of double boiler or bowl from heat. In a deep narrow bowl with an electric mixer beat eggs until thick, pale, and doubled in volume (10 to 15 minutes with a hand-held mixer and about 5 minutes with a standing electric mixer). Fold eggs into chocolate gently but thoroughly. In another bowl with cleaned beaters beat cream until it forms soft peaks and beat in Amaretto until just combined. Fold cream mixture into chocolate mixture until just combined.",
        "Fill each baking cup with batter. Put muffin cups in 2 large baking pans and add enough hot water to pans to reach halfway up sides of muffin cups. Bake cakes in upper and lower thirds of oven 15 minutes, or until they are risen and just firm (do not overbake). Remove pans from oven and cool cakes in muffin cups in water baths. Remove muffin cups from baths. Chill cakes in muffin cups 30 minutes and freeze, covered, 1 hour.",
        "Chop chocolate. In a small saucepan bring cream to a boil. Remove pan from heat and add chocolate. Let mixture stand, stirring occasionally, until chocolate is melted and ganache is smooth.",
        "Set a large rack over a shallow baking pan. Carefully remove cakes from muffin cups and peel foil from frozen cakes, arranging cakes upside down on rack. Spoon ganache over cakes, letting excess drip down sides. If necessary, pour excess ganache in baking pan back into saucepan and continue to spoon it over cakes. Chill cakes, uncovered, until firm.",
        "Serve cakes with ice cream and/or coulis."
    ],
    "ingredients": [
        "fourteen 2 1/2-inch foil bake cups (muffin liners)",
        "vegetable cooking-oil spray",
        "8 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "3 large eggs",
        "1 1/4 cups heavy cream",
        "3 tablespoons Di Saronno Amaretto (almond-flavored liqueur)",
        "5 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1/2 cup plus 2 tablespoons heavy cream",
        "Accompaniment: ice cream and/or fresh fruit coulis"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Amaretto",
        "Double Boiler",
        "Gourmet"
    ],
    "title": "Chocolate Gateaux",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-gateaux-15751"
}
