{
    "directions": [
        "Whisk yolks and sugar in medium bowl to blend. Bring cream, half and half, cinnamon stick, vanilla bean and ground cinnamon to boil in heavy medium saucepan. Gradually whisk cream into yolks; return to saucepan. Stir over medium heat until custard thickens, about 7 minutes (do not boil). Mix in extract and rum. Chill.",
        "Strain custard. Process in ice cream maker according to manufacturer's instructions. Freeze in covered container.",
        "Melt chocolate in top of double boiler over simmering water. Set aside. Beat yolks and sugar in medium bowl to blend. Bring half and half, cream, honey, cocoa and salt to boil in heavy medium saucepan. Gradually whisk cream mixture into yolk mixture; return to same saucepan. Stir over medium heat until custard thickens, about 10 minutes (do not boil). Whisk in melted chocolate, then tequila and vanilla. Chill.",
        "Process mixture in ice cream maker according to manufacturer's instructions. Freeze in covered container.",
        "Bring cream to boil in medium saucepan. Remove from heat. Add chocolate and vanilla; whisk until smooth. (Ice creams and sauce can be made 3 days ahead. Cover sauce and chill. Rewarm sauce before using.)",
        "Preheat broiler. Arrange bananas on baking sheet. Brush with butter. Broil until brown, about 4 minutes.",
        "Place some warm sauce, then 1 tablespoon nuts into each ice cream goblet. Top with 1 scoop of each ice cream then bananas and more sauce and nuts."
    ],
    "ingredients": [
        "3 large egg yolks",
        "1/2 cup sugar",
        "1 1/2 cups whipping cream",
        "3/4 cup half and half",
        "1 cinnamon stick",
        "1 2-inch piece vanilla bean, split lengthwise",
        "1/4 teaspoon ground cinnamon",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 teaspoons light rum",
        "5 ounces bittersweet(not unsweetened) or semisweet chocolate, chopped",
        "3 large egg yolks",
        "1/4 cup sugar",
        "1 1/2 cups half and half",
        "1 cup whipping cream",
        "1/4 cup honey",
        "3 tablespoons unsweetened cocoa powder",
        "Pinch of salt",
        "3 tablespoons gold tequila",
        "1/4 teaspoon vanilla extract",
        "3/4 cup whipping cream",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon vanilla extract",
        "4 bananas, cut lengthwise in half and crosswise into thirds",
        "Melted butter",
        "1 1/2 cups chopped pecans, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Tequila",
        "Ice Cream Machine",
        "Chocolate",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Banana",
        "Pecan",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Tequila Sundaes",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-tequila-sundaes-765"
}
