{
    "directions": [
        "Boil tawny Port in heavy large saucepan until reduced to 10 tablespoons, about 15 minutes. Set reduced Port aside.",
        "Preheat oven to 350°F. Butter 9-inch square baking pan with 2-inch-high sides. Line bottom with parchment. Butter parchment. Dust pan with flour; tap out excess. Melt chocolate and butter in heavy medium saucepan over medium-low heat, stirring constantly until smooth. Pour into large bowl. Cool slightly. Whisk in 4 tablespoons of reduced Port, ground nuts and cocoa. Using electric mixer, beat eggs and sugar in another large bowl until mixture whitens and triples in volume, about 6 minutes. Add chocolate mixture and fold together.",
        "Pour batter into prepared pan. Bake until top forms crust and cracks, and tester inserted into center comes out with moist crumbs attached, about 55 minutes. Transfer cake to rack and cool 30 minutes. Press down on crusty portion of top to even. Run small sharp knife around cake sides to loosen. Cool 2 hours. Turn cake out onto 7-inch cardboard square. Peel off parchment.",
        "Bring cream, corn syrup and remaining 6 tablespoons reduced Port to simmer in heavy medium saucepan. Reduce heat to low. Add chocolate and whisk until smooth. Let stand until cool but still spreadable, whisking occasionally, about 5 minutes.",
        "Place cake on platter. Spread chocolate icing over top and sides of cake, forming waves in icing atop cake. Press chopped hazelnuts onto sides and 1/2 inch over top edge to cake. Alternate husked and unhusked hazelnuts atop cake along chopped hazelnut border. Refrigerate cake at least 4 hours. (Cake can be prepared 1 day ahead.) Cut cake into slices and serve."
    ],
    "ingredients": [
        "2 1/4 cups tawny Port",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "1 cup ground toasted hazelnuts (about 3 1/2 ounces)",
        "1/2 cup unsweetened cocoa powder",
        "5 large eggs",
        "1 cup sugar",
        "6 tablespoons whipping cream",
        "2 tablespoons light corn syrup",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup finely chopped toasted hazelnuts",
        "1/2 cup husked toasted hazelnuts",
        "1/2 cup unhusked toasted hazelnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Hazelnut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-cake-1895"
}
