{
    "directions": [
        "Preheat oven to 400°F. Line large baking sheet with parchment paper. Whisk cream, chocolate syrup, vanilla and dissolved espresso powder in small bowl.",
        "Blend flour, 1/2 cup sugar, cocoa, baking powder and salt in processor. Add 1/4 cup chilled butter; process until mixture resembles fine meal. Add chocolate-cream mixture and blend, using on/off turns, until moist clumps form.",
        "Turn dough out onto work surface. Gather dough into ball; divide into 6 equal pieces. Using lightly floured hands, form each piece into 2-inch-high, 2-inch-diameter mound. Place on prepared baking sheet, spacing shortcakes 3 inches apart (shortcakes will spread). Brush tops of shortcakes with melted butter. Sprinkle each with 1 teaspoon sugar.",
        "Bake shortcakes until tester inserted into center comes out with some moist crumbs attached, about 15 minutes. Cool on sheet. (Can be made 6 hours ahead. Let stand at room temperature. Rewarm in 350°F oven about 5 minutes before continuing.)",
        "Cut shortcakes horizontally in half. Whisk banana liqueur into warm Fudge Sauce. Spoon scant 1/3 cup warm sauce onto each of 6 plates. Place bottoms of shortcakes onto sauce. Top with scoop of ice cream. Spoon strawberries over. Add shortcake tops and serve."
    ],
    "ingredients": [
        "2/3 cup whipping cream",
        "1/4 cup chocolate syrup (such as Hershey's)",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon instant espresso powder dissolved in 1 tablespoon hot water",
        "1 1/2 cups unbleached all purpose flour",
        "1/2 cup plus 6 teaspoons sugar",
        "1/3 cup unsweetened cocoa powder (preferably Dutch-process)",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "3 tablespoons banana liqueur or brandy",
        "Fudge Sauce",
        "Vanilla ice cream",
        "Strawberries in Liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Strawberry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Shortcakes with Vanilla Ice Cream, Strawberries and Fudge Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-shortcakes-with-vanilla-ice-cream-strawberries-and-fudge-sauce-100488"
}
