{
    "directions": [
        "Preheat oven to 350°F. Stir 1/2 cup sugar and 1/2 cup water in heavy small saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 5 minutes. Carefully pour caramel into 5-cup ring mold. Using pastry brush, quickly brush caramel up sides of mold. Cool.",
        "Whisk 1 cup milk and cocoa in large bowl until cocoa dissolves. Whisk in remaining 2 cups milk, 2/3 cup sugar, rum, egg yolks and eggs. Stir in amaretti cookies. Pour custard into caramel-lined mold.",
        "Place mold in large roasting pan. Add enough warm water to roasting pan to come halfway up sides of mold. Cover pan and ring mold with foil and bake 20 minutes. Remove foil and bake until crust forms on top of custard and center 1 inch still moves when mold is gently shaken, about 35 minutes (do not overbake or custard will curdle). Transfer mold to rack and cool completely. Cover and chill overnight.",
        "Using small sharp knife, cut oranges between membranes to release segments. Run knife around sides of mold. Place plate atop mold. Invert custard onto plate, shaking gently to loosen and letting caramel run over custard. Remove mold. Arrange fruit in center of custard."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "1/2 cup water",
        "3 cups whole milk",
        "2/3 cup unsweetened cocoa powder",
        "2/3 cup sugar",
        "1/4 cup dark rum",
        "4 large egg yolks",
        "2 large eggs",
        "1 cup coarsely chopped amaretti cookies (Italian macaroons)",
        "2 large navel oranges, peel and white pith removed",
        "2 1/2 cups assorted berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Citrus",
        "Dessert",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Chocolate-Amaretti Custard with Fresh Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-amaretti-custard-with-fresh-fruit-4011"
}
