{
    "directions": [
        "Preheat oven to 325°F. Butter and flour 9-inch-diameter cake pan with 2-inch-high sides. Using electric mixer, beat 1 cup sugar, almond paste and butter in large bowl to blend. Add yolks, extract and salt and beat 1 minute. On low speed, beat in flour alternately with milk in 3 additions each. Mix in coconut. Using electric mixer fitted with clean dry beaters, beat whites in large bowl to soft peaks. Gradually beat in remaining 1/4 cup sugar and beat until stiff but not dry. Fold whites into batter.",
        "Pour batter into prepared pan. Bake until tester inserted into center comes out clean, about 1 hour. Cool cake in pan on rack 20 minutes. Run small sharp knife around sides to loosen cake. Turn out cake onto rack; cool completely.",
        "Bring cream of coconut and butter to simmer in heavy medium saucepan over low heat. Add white chocolate; stir until melted. Pour into bowl and cool. Add cream cheese and beat until smooth. Mix in coconut. Chill until spreadable, about 30 minutes.",
        "Bring 3/4 cup cream and corn syrup to simmer in heavy medium saucepan. Add chocolate and stir until melted and smooth. Cool until just pourable, about 15 minutes.",
        "Using serrated knife, cut cake horizontally in half. Place 1 cake layer cut side up on plate. Spread filling over. Top with second cake layer cut side down. Pour half of glaze over top of cake, spreading with spatula to cover sides and smooth top (reserve remaining glaze for sauce). Press almonds around sides and in 1-inch border around top edge of cake. Refrigerate cake until glaze sets, about 1 hour. (Can be made 1 day ahead. Cover cake with cake dome; chill. Chill remaining glaze. Let cake stand 2 hours at room temperature before continuing.)",
        "Mix reserved glaze and remaining 1/4 cup cream in saucepan. Stir over low heat until sauce is heated through. Slice cake; serve with sauce."
    ],
    "ingredients": [
        "1 1/4 cups sugar",
        "3 1/2 ounces almond paste, broken into pieces",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "4 large eggs, separated",
        "1 teaspoon imitation coconut extract",
        "1/4 teaspoon salt",
        "1 1/2 cups all purpose flour",
        "1/2 cup milk",
        "1 cup sweetened shredded coconut",
        "1/2 cup canned cream of coconut (such as Coco Lopez)",
        "1/4 cup (1/2 stick) unsalted butter",
        "3 ounces imported white chocolate (such as Lindt), chopped",
        "2 tablespoons cream cheese, room temperature",
        "3/4 cup sweetened shredded coconut",
        "1 cup whipping cream",
        "3 tablespoons light corn syrup",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "Sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Coconut",
        "Almond",
        "Party"
    ],
    "title": "Chocolate-Glazed Coconut-Almond Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-glazed-coconut-almond-cake-1151"
}
