{
    "directions": [
        "To make sauce: stir 1 1/4 cups sugar and water in heavy large saucepan over medium heat until sugar dissolves. Mix in corn syrup and lemon juice. Increase heat and boil without stirring until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally. Remove from heat; pour in 1 1/4 cups cream (mixture will bubble up), stir over low heat until caramel is melted and smooth. Increase heat and boil until sauce is reduced to 1 2/3 cups, stirring often, about 4 minutes. Remove from heat; mix in pecans and bourbon.",
        "To make pudding: preheat oven to 350 degrees F (175 degrees C).",
        "Combine milk, 2 cups cream, and 1 cup sugar in heavy large saucepan over medium high heat, stir until sugar dissolves and mixture comes to boil. Remove from heat, add chocolate, and stir until smooth.",
        "Beat eggs and vanilla in large bowl to blend. Gradually whisk in chocolate mixture; add bread cubes and let stand until bread absorbs some of the custard, stirring occasionally, about 30 minutes. Transfer mixture to a 13x9x2-inch glass baking dish. Cover with foil.",
        "Bake at 350 degrees F (175 degrees C) until set in center, about 45 minutes. Serve pudding warm or at room temperature with warm sauce."
    ],
    "ingredients": [
        "1 1/4 cups white sugar",
        "1/2 cup water",
        "1/4 cup light corn syrup",
        "1 tablespoon lemon juice",
        "1 1/4 cups heavy whipping cream",
        "1 cup chopped toasted pecans",
        "2 tablespoons bourbon",
        "2 cups whole milk",
        "2 cups heavy whipping cream",
        "1 cup white sugar",
        "8 (1 ounce) squares semisweet chocolate",
        "8 eggs",
        "1 tablespoon vanilla extract",
        "1 pound egg bread, sliced into 1 inch pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Bread Pudding with Bourbon Pecan Sauce",
    "url": "http://allrecipes.com/recipe/9374/chocolate-bread-pudding-with-bourbon/"
}
