{
    "directions": [
        "Preheat oven to 350°. Butter mold and dust with sugar, knocking out excess.",
        "Stir together ground almonds, chocolate, and spices in a bowl. Beat yolks with 1/4 cup sugar in another bowl with an electric mixer until thick and pale, then beat in zest.",
        "Beat whites with salt with cleaned beaters in a large bowl until they just hold soft peaks. Gradually beat in remaining 1/4 cup sugar and beat until whites just hold stiff peaks.",
        "Stir one third of whites into yolk mixture to lighten, then fold in remaining whites in 2 more batches. Fold in ground almond mixture.",
        "Pour batter into mold and bake in middle of oven until golden and a tester comes out clean, about 45 minutes. Cool cake in mold on a rack 10 minutes, then invert onto rack and cool completely.",
        "Melt chocolate with 1 tablespoon butter in a small heavy saucepan over very low heat, stirring. Remove from heat and add remaining 5 tablespoons butter, 1 tablespoon at a time, stirring until smooth. Transfer icing to a bowl and chill, covered, until slightly thickened and spreadable, about 30 minutes.",
        "Spread icing over cake with a small metal spatula. Stick points of almonds into cake in straight rows, following ridges, to resemble a porcupine. Chill cake until icing is set, at least 1 hour. Transfer cake to a platter and bring to room temperature before serving."
    ],
    "ingredients": [
        "1/2 cup sugar plus additional for dusting",
        "1 3/4 cups whole unblanched almonds (9 ounces), finely ground",
        "3 ounces fine-quality bittersweet (not unsweetened) or semisweet chocolate, coarsely grated",
        "Pinch of ground cloves",
        "Pinch of ground cinnamon",
        "Pinch of ground allspice",
        "5 large egg yolks",
        "2 teaspoons finely grated fresh lemon zest",
        "4 large egg whites",
        "1/2 teaspoon salt",
        "3 ounces fine-quality bittersweet or semisweet chocolate, chopped",
        "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
        "1/3 cup slivered blanched almonds",
        "Special equipment: a 12-inch-long metal Rehrucken mold"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Almond",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Almond Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-almond-torte-104433"
}
