{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Spray 10-inch-diameter cake pan with 2-inch-high sides with nonstick vegetable spray. Line bottom of pan with parchment paper; spray paper. Combine dried pears, 3/4 cup water and 1/3 cup sugar in heavy small saucepan. Simmer mixture over medium-low heat until pears are tender and liquid is syrupy, about 18 minutes. Transfer mixture to processor. Add pear brandy and purée until mixture forms thick paste. Set pear purée aside.",
        "Stir chocolate and butter in heavy medium saucepan over medium-low heat until smooth. Add pear purée, almonds and flour. Stir to blend well. Transfer mixture to large bowl.",
        "Using electric mixer, beat egg yolks in medium bowl until foamy. Gradually add 1/2 cup sugar, beating until mixture is very pale and thick, about 5 minutes. Using clean dry beaters, beat egg whites in large bowl until soft peaks form. Gradually add remaining 1/2 cup sugar to egg whites and beat until medium-stiff peaks form. Fold egg yolk mixture into chocolate mixture in 3 additions. Stir 1/4 of egg whites into chocolate mixture to lighten. Fold in remaining whites in 3 additions.",
        "Pour batter into prepared pan. Cover with foil, sealing foil around pan edges and tenting center to allow torte to rise while baking. Place cake pan in large roasting pan. Add enough hot water to roasting pan to come halfway up sides of cake pan. Bake torte until top and sides are set and firm to touch and tester inserted into center comes out with moist crumbs attached, about 1 hour 45 minutes. Transfer pan to rack. Cool 20 minutes. Run knife around pan sides to loosen torte. Invert torte onto 10-inch-diameter tart pan bottom. Peel off parchment. Cool completely. (Can be made 1 day ahead. Cover loosely; chill.)",
        "Stir first 4 ingredients in heavy small saucepan over medium-low heat until smooth.",
        "Line baking sheet with foil. Place rack on baking sheet. Transfer torte atop tart pan bottom to rack. Pour 1/2 cup glaze over torte. Using icing spatula and working quickly, smooth glaze over top and sides, covering evenly. Freeze torte until glaze is set, about 10 minutes. Pour remaining glaze over torte and spread over top and sides until smooth. Freeze torte just until glaze is firm, about 15 minutes. (Torte can be made 1 day ahead. Cover and chill. Let torte stand at room temperature 30 minutes before serving.)",
        "Using spatula, transfer torte to platter. If desired, press tip of small sharp knife into 1 gold leaf sheet; gently peel off 1-inch free-form piece. Using knife as aid, carefully press gold leaf onto torte. Repeat with remaining gold leaf, spacing pieces decoratively."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3/4 cup chopped dried pears (about 4 ounces)",
        "3/4 cup water",
        "1 1/3 cups sugar",
        "3 tablespoons poire Williams (clear pear brandy) or brandy",
        "9 ounces semisweet chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter",
        "1/3 cup finely ground almonds",
        "1/4 cup all purpose flour",
        "6 large eggs, separated",
        "8 ounces semisweet chocolate, chopped",
        "3/4 cup whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 tablespoon poire Williams (clear pear brandy) or brandy",
        "2 3 3/4-inch square sheets edible gold leaf* (optional)",
        "*Gold leaf sheets can be found at some cookware stores and at specialty art-supply stores. Or they can be ordered by mail from Easy-Leaf, 6001 Santa Monica Boulevard, Los Angeles, CA 90038; (323) 469-0856"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Christmas",
        "Vegetarian",
        "Pear",
        "Almond",
        "Brandy",
        "Eau de Vie",
        "Winter",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Glazed Chocolate Pear Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-glazed-chocolate-pear-torte-5747"
}
