{
    "directions": [
        "Preheat oven to 350°F. Butter 10-inch-diameter springform pan; line bottom with parchment paper round. Stir chocolate in metal bowl set over saucepan of simmering water until melted and smooth. Cool slightly. Using electric mixer, beat sugar and butter in large bowl 2 minutes. Beat in egg yolks, Grand Marnier, orange peel, and vanilla. Stir in lukewarm chocolate. Add flour and salt; stir to blend. Using clean dry beaters, beat egg whites in another large bowl until peaks form. Fold whites into chocolate mixture in 3 additions. Transfer batter to prepared springform pan.",
        "Bake cake until top is dry and cracked and tester inserted into center comes out with a few moist crumbs attached, about 45 minutes. Cool cake in pan on rack (top will fall slightly). DO AHEAD: Can be made 1 day ahead. Cool completely; cover and let stand at room temperature.",
        "Place chocolate and butter in medium metal bowl. Bring cream to boil in small saucepan. Pour hot cream over chocolate mixture; stir until mixture is melted and smooth.",
        "Run thin knife around inside of cake pan; remove pan sides. Invert cake onto 10-inch removable tart pan bottom or cardboard round. Place on rack set in rimmed baking sheet. Remove cake pan bottom and parchment. Pour icing over cake and spread to cover top and sides (any icing that drips onto baking sheet can be reused). Chill until glaze sets, about 30 minutes. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and chill. Let stand at room temperature 1 hour before serving.",
        "Cut into wedges and serve."
    ],
    "ingredients": [
        "10 ounces bittersweet chocolate, chopped",
        "1 cup sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "6 large eggs, separated",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "1 tablespoon finely grated orange peel",
        "2 teaspoons vanilla extract",
        "1/2 cup all purpose flour",
        "1/4 teaspoon salt",
        "7 ounces bittersweet chocolate, chopped",
        "7 tablespoons unsalted butter, cut into 1-inch cubes, room temperature",
        "2/3 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Grand Marnier Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-grand-marnier-cake-239839"
}
