{
    "directions": [
        "Preheat oven to 350°F. Spray 9-inch-diameter cake pan with 2-inch-high sides with nonstick spray. Line bottom with parchment round. Whisk flour, cocoa powder, baking soda, and salt in medium bowl. Whisk sugar, honey, eggs, and vanilla in large bowl to blend. Whisk in oil, then half of dry ingredients. Whisk in buttermilk, then remaining dry ingredients. Pour into prepared pan. Bake cake until tester inserted into center comes out clean, about 55 minutes (cake will dome). Cool 10 minutes. Invert onto rack; remove parchment. Turn over; cool cake completely on rack. DO AHEAD Can be made 1 day ahead. Store airtight at room temperature.",
        "Cut cake in half horizontally. Place bottom half of cake on cardboard round, tart pan bottom, or springform pan bottom.",
        "Place 1 tablespoon water in small bowl. Sprinkle gelatin over. Let stand 10 minutes to soften gelatin. Bring 1/4 cup cream to boil in small saucepan. Remove from heat and stir in gelatin mixture. Cool to room temperature, stirring often, about 5 minutes.",
        "Meanwhile, using electric mixer, beat remaining 1 cup cream, sour cream, and honey in medium bowl until peaks form. Beat gelatin mixture, then grated chocolate into whipped cream mixture. Immediately spread filling over bottom half of cake, leaving 1/2-inch border at edges. Place top half of cake atop filling, pressing gently to spread filling just to edge of cake. Cover and chill cake overnight.",
        "Place chocolate in large measuring cup. Bring cream and honey to boil in heavy small saucepan, stirring to blend. Pour hot cream mixture over chocolate in cup; stir until smooth. Let cool 5 minutes.",
        "Place rack on rimmed baking sheet. Transfer cake to rack. Pour glaze over cake, allowing glaze to drip down sides. Use spatula to spread glaze over sides. Pat nuts onto sides of cake. Chill 1 hour to set glaze. DO AHEAD Can be made 1 day ahead. Keep refrigerated."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 1/4 cups all purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 cup sugar",
        "1/2 cup honey",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "3/4 cup vegetable oil",
        "1 1/2 cups buttermilk",
        "1 tablespoon water",
        "1 teaspoon unflavored gelatin",
        "1 1/4 cups heavy whipping cream, divided",
        "1/2 cup sour cream",
        "3 tablespoons honey",
        "1/2 cup finely grated bittersweet chocolate (about 1 ounce)",
        "10 ounces bittersweet chocolate, chopped",
        "1 cup heavy whipping cream",
        "1/2 cup honey",
        "1 cup pecans, toasted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Winter",
        "Chill",
        "Honey",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate-Honey Dome Cake with Chocolate-Honey Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-honey-dome-cake-with-chocolate-honey-glaze-237916"
}
