{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease a 10x14-inch baking pan with butter.",
        "Mix pecans, dark chocolate, 3/4 cup sugar, and cinnamon in a bowl. Trim phyllo dough to fit prepared baking pan. Layer 8 sheets of phyllo dough in prepared baking pan, brushing each sheet with melted butter; sprinkle with 2 cups pecan mixture. Spread butter on 4 more sheets of phyllo and layer over pecans; sprinkle with 2 more cups pecans. Repeat layers with 4 more sheets of phyllo and remaining pecans. Pour any leftover butter over baklava.",
        "Cut through the top few layers of phyllo lengthwise, leaving bottom layer intact, to create 4 long rows. Make evenly-spaced zigzag cuts along each row to create small triangles, again leaving bottom layer of phyllo intact.",
        "Bake in preheated oven until phyllo dough is golden brown and flaky, about 1 hour; immediately finish cutting through to bottom layer of baklava.",
        "Bring orange juice, honey, water, 1/2 cup sugar, and lemon juice to a boil in a saucepan; reduce heat to medium and simmer until thickened, about 20 minutes. Pour sauce over baklava.",
        "Melt remaining 2 ounces chocolate and 1 teaspoon butter in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Drizzle chocolate over baklava. Cover and refrigerate until ready to serve."
    ],
    "ingredients": [
        "1 pound pecans, finely chopped",
        "8 ounces dark chocolate (such as Callebaut®), finely chopped",
        "3/4 cup white sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1 pound phyllo dough, thawed",
        "1 1/4 cups unsalted butter, melted",
        "3/4 cup orange juice",
        "1/2 cup honey",
        "1/2 cup water",
        "1/2 cup white sugar",
        "2 tablespoons lemon juice",
        "2 ounces semisweet chocolate",
        "1 teaspoon butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Baklava",
    "url": "http://allrecipes.com/recipe/229997/chocolate-baklava/"
}
