{
    "directions": [
        "Sprinkle the gelatin on top of 2 tablespoons water; set aside. Separate the eggs. Lightly beat the egg yolks.",
        "In a small saucepan, heat chocolate, 1/4 cup sugar, 2 tablespoons water, and coffee; stir constantly until melted.  Add softened gelatin to the saucepan, and heat until completely dissolved. Remove pan from heat, and gradually pour chocolate mixture into beaten egg yolks, whisking constantly. Return the custard to the pan. Cook over medium-low heat, stirring constantly, until mixture thickens slightly. Remove from heat, and stir in 1 teaspoon vanilla. Transfer to a bowl and allow to cool to room temperature.",
        "When chocolate mixture has cooled, beat egg whites to soft peaks. Gradually add 2 tablespoons sugar, and beat until stiff but not dry. Fold whipped egg whites into chocolate mixture. Whip 1/2 cup cream until stiff, and fold into chocolate mixture. Spoon into pie crust and refrigerate.",
        "To Make Topping: Add cocoa and confectioners' sugar to 1 cup whipping cream. Chill mixture 30 minutes, then whip until stiff. Stir in almond extract and 1/2 teaspoon vanilla extract. Top the pie with this chocolate whipped cream. Chill pie several hours or overnight until set. Filling with be a little soft."
    ],
    "ingredients": [
        "1 (9 inch) pie shell, baked",
        "1 cup semisweet chocolate chips",
        "1/4 cup white sugar",
        "4 tablespoons water",
        "1 teaspoon unflavored gelatin",
        "1 tablespoon instant coffee powder",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup heavy whipping cream",
        "2 tablespoons white sugar",
        "2 tablespoons unsweetened cocoa powder",
        "2 tablespoons confectioners' sugar",
        "1 cup heavy whipping cream",
        "1/2 teaspoon almond extract",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Mousse Pie",
    "url": "http://allrecipes.com/recipe/12121/chocolate-mousse-pie/"
}
