{
    "directions": [
        "Spoon the chocolate-hazelnut spread into your blender. Add the chopped chocolate. Set your ramekins/cocottes/teacups/glasses on a baking sheet.",
        "In a medium saucepan, whisk together the milk, heavy cream, sugar, salt and egg yolks over medium heat. Cook, stirring constantly, 8 to 10 minutes; I like to use a flat-bottomed wooden spatula so that I can make sure the eggs aren't catching on the bottom and cooking. Cook until the custard thickens, resembling something like very thick paint. It should register between 175 and 180 degrees F on an instant-read thermometer. Another test: the custard should coat the back of the spatula, and when you draw a line across the back of the spatula with your (clean!) finger, the line should hold and maintain its edges without running. Remove from the heat immediately.",
        "Now, pour the warm custard through a strainer into the blender. Let it sit 5 minutes to melt the chocolate. Add the Sriracha, espresso powder if using and vanilla extract. Then, put the lid on the blender, hold down with a thick kitchen towel, and blend on low, then high, until smooth and combined, scraping down the sides if necessary. Taste for seasoning.",
        "Pour the custard into your containers, tapping them against the rim of the baking sheet to remove air bubbles. Pop them in the fridge and chill until the custards are set, 2 to 3 hours.",
        "Top with whipped cream or creme fraiche, some grated chocolate and minced hazelnuts. A little sea salt would be nice too."
    ],
    "ingredients": [
        "1 cup chocolate-hazelnut spread, such as Nutella",
        "3 ounces dark or semisweet chocolate (70 percent and over), chopped",
        "1 1/2 cups whole milk",
        "1 cup heavy cream",
        "1/4 cup granulated sugar",
        "3/4 teaspoon kosher salt",
        "6 large egg yolks",
        "1 1/2 to 2 teaspoons Sriracha sauce",
        "1/2 teaspoon instant espresso powder, optional",
        "1/2 teaspoon vanilla extract",
        "Whipped cream or creme fraiche, for topping",
        "Cocoa or grated chocolate, for dusting",
        "Minced hazelnuts, for garnishing",
        "Sea salt, for garnishing"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate",
        "Nut Recipes",
        "Dessert",
        "Pureeing Recipes"
    ],
    "title": "Chocolate-Hazelnut Pots De Creme",
    "url": "http://www.foodnetwork.com/recipes/aarti-sequeira/chocolate-hazelnut-pots-de-creme-recipe"
}
