{
    "directions": [
        "Preheat oven to 400° F. Butter a 15- by 10 1/2-inch jelly-roll pan and line with wax paper or parchment paper. Butter and flour paper, knocking out excess flour.",
        "In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth, and remove double boiler or pan from heat.",
        "In a bowl with an electric mixer beat yolks, sugar, zest, and salt until thick, pale, and mixture forms a ribbon when beaters are lifted. Beat in melted chocolate until just combined. In another bowl with cleaned beaters beat whites until they just hold soft peaks. Stir one fourth whites into chocolate mixture to lighten and fold in remaining whites gently but thoroughly. Pour batter into jelly-roll pan, spreading evenly with a spatula, and bake in middle of oven 10 minutes, or until cake is springy to the touch. Cool cake in pan, covered with a dampened kitchen towel.",
        "With a sharp knife cut peel and pith from tangerines or oranges and cut sections free from membranes. In a bowl with an electric mixer beat cream with liqueur until it just holds stiff peaks and fold in fruit sections until just combined.",
        "Put a large sheet of foil (about 20 by 15 inches) on a work surface and lightly dust with cocoa powder. Invert cake onto foil and gently peel off paper. Spoon cream mixture evenly onto cake. Beginning with a short side and using foil as a guide, roll up roulade jelly-roll fashion and transfer to a platter, seam side down.",
        "Lightly dust roulade with cocoa powder. Roulade may be made 1 day ahead and chilled, loosely covered."
    ],
    "ingredients": [
        "6 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "5 large eggs, separated",
        "1/2 cup sugar",
        "1 tablespoon finely grated fresh orange zest",
        "1/2 teaspoon salt",
        "5 tangerines or 3 navel oranges",
        "1 cup heavy cream",
        "3 tablespoons orange liqueur such as Triple Sec",
        "Dutch-process cocoa powder for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Tangerine",
        "Gourmet"
    ],
    "title": "Chocolate Tangerine Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-tangerine-roulade-14079"
}
