{
    "directions": [
        "Preheat oven to 400°F.",
        "Butter inside of soup plates, then coat well with some superfine sugar, knocking out excess. Chill plates.",
        "Melt chocolate in a double boiler or a metal bowl set over a saucepan of barely simmering water, stirring until smooth. Remove bowl from pan.",
        "Beat together yolks and Cognac in a large bowl with an electric mixer at high speed until yolks are thick, pale, and form a ribbon when beaters are lifted (about 4 minutes with a standing mixer or 7 minutes with a hand-held). Mix in chocolate at low speed.",
        "Beat whites with salt in another large bowl with cleaned beaters at medium speed until they just hold soft peaks. Gradually add remaining 2 tablespoons sugar, beating at medium speed, then beat at high speed until whites just hold stiff peaks.",
        "Stir one third of whites into chocolate mixture to lighten, then fold in remaining whites gently but thoroughly in 2 batches.",
        "Divide among soup plates and put 2 plates on each of 2 large baking sheets. Bake soufflés in upper and lower thirds of oven until puffed and set, 12 to 14 minutes (soufflés on top rack may finish cooking first).",
        "Lightly dust soufflés with cocoa and serve with accompaniments."
    ],
    "ingredients": [
        "2 tablespoons superfine granulated sugar plus additional for coating soup plates",
        "4 ounces Valrhona Caraïbe bittersweet (66%) chocolate, finely chopped",
        "6 large egg yolks",
        "1/2 tablespoon Cognac",
        "7 large egg whites",
        "3/4 teaspoon salt",
        "Unsweetened cocoa powder for dusting",
        "Special equipment: 4 (1 1/2- to 2-cup) ovenproof soup plates",
        "Accompaniments: Pistachio Ice Cream , Warm Chocolate Sauce , and Caramelized Nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Bastille Day",
        "Cognac/Armagnac",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-souffles-104770"
}
