{
    "directions": [
        "Finely grind nuts and sugar in processor. Add egg whites and blend well. DO AHEAD Can be made 3 days ahead. Transfer to small bowl, cover, and refrigerate.",
        "Preheat oven to 350°F. Butter 8-inch-diameter springform pan. Line pan bottom with parchment paper; butter paper. Place chocolate in medium metal bowl set over saucepan of simmering water and stir until chocolate is melted and smooth. Remove from over water. Cool chocolate to lukewarm.",
        "Measure 1/3 cup pistachio paste and transfer to small bowl (cover and reserve for another use). Place remaining pistachio paste in large bowl; add butter. Using electric mixer, beat until blended. Beat in egg yolks, then melted chocolate. Using clean dry beaters, beat egg whites with salt in another large bowl until soft peaks form. Gradually add 2 tablespoons sugar, beating until firm peaks form. Sift brown sugar over and fold in. Using flexible rubber spatula, fold egg-white mixture into chocolate mixture in 4 additions; transfer batter to prepared pan.",
        "Bake torte until center is slightly puffed and tester inserted into center comes out with some batter still attached, about 1 hour. Cool torte completely in pan on rack. DO AHEAD Can be made 1 day ahead. Cover and let stand at room temperature.",
        "Bring cream to simmer in small saucepan. Remove from heat; add chocolate and whisk until smooth. DO AHEAD Can be made 1 day ahead. Chill. Rewarm before using.",
        "Cut torte into wedges; place on plates. Pour warm ganache over. Sprinkle with pistachios and serve."
    ],
    "ingredients": [
        "12 ounces shelled unsalted natural pistachios (untoasted; about 2 2/3 cups)",
        "2 tablespoons sugar",
        "2 large egg whites",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "6 large eggs, separated",
        "1/4 teaspoon salt",
        "2 tablespoons sugar",
        "2 tablespoons (packed) golden brown sugar",
        "2 cups heavy whipping cream",
        "15 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "Chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Pistachio",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Pistachio Torte with Warm Chocolate Ganache",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pistachio-torte-with-warm-chocolate-ganache-236543"
}
