{
    "directions": [
        "Preheat oven to 375°F. Whisk flour, cocoa, sugar, and salt in large bowl to blend. Add butter; rub in with fingertips until mixture resembles coarse meal. Whisk yolks in small bowl to blend; add to flour mixture. Stir until moist clumps form. Gather dough into ball; press over bottom and up sides of 11-inch-diameter tart pan with removable bottom. Bake crust until set, about 15 minutes. Cool while preparing filling. Reduce oven temperature to 350°F.",
        "Blend corn syrup, sugar, and butter in medium bowl. Whisk in eggs, vanilla, and salt. Stir in 1/2 cup chocolate chips, 3/4 cup coconut, and pecans. Pour filling into prepared crust.",
        "Bake tart until filling is set and golden brown on top, about 40 minutes. Place tart on rack. Sprinkle remaining 1/2 cup chocolate chips evenly around edge of warm tart. Let stand just until chips soften, about 5 minutes. Using small spatula, spread chocolate to form 1-inch border around edge of tart. Sprinkle chocolate border with remaining 3 tablespoons coconut. Cool completely. (Can be made 1 day ahead. Cover loosely with foil; let stand at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "6 tablespoons unsweetened cocoa powder",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 large egg yolks",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 large egg yolks",
        "1 cup light corn syrup",
        "3/4 cup (packed) golden brown sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "3 large eggs",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "1 cup (6 ounces) miniature semisweet chocolate chips",
        "3/4 cup plus 3 tablespoons shredded unsweetened coconut",
        "1 1/2 cups (about 7 ounces) pecan halves, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Coconut",
        "Pecan",
        "Fall"
    ],
    "title": "Chocolate and Coconut Pecan Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-and-coconut-pecan-tart-105844"
}
