{
    "directions": [
        "In a small saucepan boil the jam, stirring, for 3 minutes and let it cool. In a bowl with an electric mixer cream the butter with the granulated sugar until the mixture is light and fluffy, beat in the egg yolks, the cinnamon, the zest, and the salt, and beat the mixture until it is smooth. Add the flour and beat the dough until it is just combined. Beat in the hazelnuts and the chocolate.",
        "Preheat the oven to 375°F. Press lightly more than half the dough onto the bottom and up the side of an 11-inch tart pan with a removable fluted rim. Roll out the remaining dough between 2 sheets of wax paper into a round slightly thicker than 1/8 inch and freeze the round in the paper on a baking sheet for 15 minutes. Spread the jam evenly on the tart shell to within 1/4 inch of the edge. Remove the top sheet of wax paper from the round of dough, with a pastry wheel or sharp knife cut the round into 1/2-inch-wide strips, and, using a long metal spatula, arrange the strips in a lattice pattern over the jam. Trim the ends of the strips at the edge of the pan and with the remaining dough press a 1/4-inch-thick rim over the ends of the strips. Bake the Linzertorte in the middle of the oven for 25 to 30 minutes, or until it is browned lightly, and let it cool in the pan on a rack. The Linzertorte may be made 3 days in advance and kept covered loosely and chilled. Remove the rim of the pan, dust the edge of the Linzertorte with the confectioners' sugar, and serve the Linzertorte with the whipped cream."
    ],
    "ingredients": [
        "a 12-ounce jar (about 1 cup) seedless raspberry jam",
        "1 3/4 sticks (14 tablespoons)unsalted butter, softened",
        "1/2 cup granulated sugar",
        "3 large egg yolks",
        "1 teaspoons cinnamon",
        "1 teaspoon freshly grated lemon zest",
        "1/2 teaspoon salt",
        "2 cups all-purpose flour",
        "1 1/2 cups hazelnuts, toasted and skinned and ground fine in a food processor",
        "3 ounces semisweet chocolate (not unsweetened), ground fine in a food processor",
        "confectioners' sugar for dusting the torte",
        "whipped cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Raspberry",
        "Winter",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Chocolate Linzertorte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-linzertorte-10972"
}
