{
    "directions": [
        "Whisk 1/2 cup plus 2 tablespoons sugar, cornstarch, and 1/4 teaspoon salt in medium saucepan to blend. Add 1/2 cup milk and egg yolks; whisk until smooth. Whisk in remaining 2 cups milk. Bring mixture to boil over medium-high heat, whisking constantly. Boil 1 minute, whisking constantly. Remove pan from heat; add chocolate chips and butter. Whisk pudding until melted and smooth. Stir in vanilla.",
        "Divide pudding evenly among 6 dessert cups or wineglasses. Place plastic wrap directly onto surface of each, covering pudding completely. Chill until cold, at least 3 hours. DO AHEAD: can be made up to 1 day ahead. Keep chilled.",
        "Using electric mixer, beat whipping cream, Grand Marnier, orange peel, and remaining 1 tablespoon sugar in medium bowl until peaks form. DO AHEAD: Can be made 2 hours ahead. Cover and chill.",
        "Uncover puddings. Spoon dollop of whipped cream over each and serve."
    ],
    "ingredients": [
        "1/2 cup plus 3 tablespoons sugar, divided",
        "2 tablespoons cornstarch",
        "2 1/2 cups whole milk, divided",
        "2 large egg yolks",
        "1 1/2 cups bittersweet chocolate chips (do not exceed 61% cacao) or semisweet chocolate chips",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/4 teaspoon vanilla extract",
        "3/4 cup chilled whipping cream",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "1/4 teaspoon finely grated orange peel",
        "Test-kitchen tip: If you don't have orange liqueur on hand, skip the orange peel and use another liqueur. Kahlúa or amaretto would work well in this recipe."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Valentine's Day",
        "High Fiber",
        "Orange",
        "Chill",
        "Boil",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Puddings with Orange Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-puddings-with-orange-whipped-cream-364092"
}
