{
    "directions": [
        "Position rack in center of oven; preheat to 350°F. Line bottom of 9-inch round cake pan with 2-inch-high sides with parchment paper. Butter and flour sides of pan and parchment. Sift flour, baking soda, and salt into medium bowl. Whisk 2/3 cup sugar and cocoa in another medium bowl to blend; add 1/3 cup buttermilk and vanilla and whisk until smooth. Using electric mixer, beat butter in large bowl until fluffy. Add 2/3 cup sugar; beat until well blended. Beat in egg and egg yolk. Add buttermilk-cocoa mixture; beat to blend. Beat in flour mixture in 3 additions alternately with 1/3 cup buttermilk in 2 additions. Transfer batter to pan.",
        "Bake cake until tester inserted into center comes out clean, about 40 minutes. Cool cake in pan on rack 30 minutes. Cut around pan sides. Invert cake onto plate. Peel off parchment paper.",
        "Stir espresso powder and vanilla in small bowl until espresso dissolves. Stir chocolate in top of double boiler set over simmering water until melted and smooth. Remove from over water; cool. Using electric mixer, beat butter in large bowl until fluffy. Add espresso mixture and corn syrup; blend well, scraping down sides of bowl occasionally. Beat in melted chocolate, then powdered sugar in 3 additions. If frosting is very soft, freeze until firm enough to spread, stirring occasionally, about 10 minutes.",
        "Spoon 2/3 cup frosting into pastry bag fitted with medium star tip. Slice cake in half horizontally. Place bottom layer on 8-inch cardboard round or 8-inch tart pan bottom. Spread 1 cup frosting over bottom cake layer. Top with second cake layer. Spread remaining frosting over top and sides of cake. Reserve 24 almond slices. Press remaining almonds onto sides of cake. Pipe 12 frosting rosettes around top edge of cake, spacing evenly. Place 2 almond slices in each rosette. (Can be made 1 day ahead. Cover; chill. Let stand at room temperature 2 hours before serving.)"
    ],
    "ingredients": [
        "1 1/4 cups cake flour",
        "3/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 1/3 cups sugar",
        "1/3 cup unsweetened cocoa powder",
        "2/3 cup buttermilk",
        "1 teaspoon vanilla extract",
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1 large egg",
        "1 large egg yolk",
        "1 tablespoon instant espresso powder or coffee crystals",
        "2 teaspoons vanilla extract",
        "10 ounces semisweet chocolate, chopped",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 tablespoon light corn syrup",
        "2 cups powdered sugar, sifted",
        "1 cup sliced almonds, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Birthday",
        "Double Boiler",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Layer Cake with Mocha Frosting and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-layer-cake-with-mocha-frosting-and-almonds-104734"
}
