{
    "directions": [
        "Preheat oven to 400°F. Line baking sheet with parchment. Whisk first 5 ingredients in large bowl. Using electric mixer, beat cream and vanilla in medium bowl until firm peaks form. Stir cream into flour mixture until moist clumps form. Transfer mixture to lightly floured surface and knead gently until dough forms ball, about 10 turns. Pat dough out to 3/4-inch thickness. Using 3-inch cutter, cut out biscuits. Gather dough, pat out again, and cut out total of 6 biscuits. Place biscuits on prepared baking sheet.",
        "Bake biscuits until toothpick inserted into centers comes out clean, about 15 minutes. Transfer to rack; cool. DO AHEAD Can be made 6 hours ahead. Let stand at room temperature.",
        "Stir strawberries, 6 tablespoons powdered sugar, and next 4 ingredients in medium bowl. Cover and chill at least 1 hour and up to 2 hours.",
        "Using electric mixer, beat chilled whipping cream, sour cream, and remaining 2 tablespoons powdered sugar until soft peaks form. Place 1 biscuit on each of 6 plates. Place large spoonful of berries with juices atop biscuits. Top with whipped cream. Pass remaining berries alongside."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "1/2 cup sugar",
        "1 tablespoon baking powder",
        "1/8 teaspoon salt",
        "1 cup chilled whipping cream",
        "1/2 teaspoon vanilla extract",
        "2 pounds small strawberries, hulled, quartered (about 3 1/2 cups)",
        "8 tablespoons powdered sugar, divided",
        "1/4 cup fresh orange juice",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "1/2 teaspoon finely grated orange peel",
        "Pinch of salt",
        "1/2 cup chilled whipping cream",
        "1/2 cup chilled sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Berry",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Strawberry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-strawberry-shortcakes-238533"
}
