{
    "directions": [
        "Grease three 9 inch cake pans.  Line bottoms with parchment paper.  Preheat oven to 375 degrees F (190 degrees C).",
        "In a small pan over low heat, combine 1cup chocolate chips and 1/4 cup water.  Stir until chocolate chips have melted, and mixture is smooth. Allow to cool to room temperature.",
        "Sift together flour, soda and 1/4 teaspoon salt. Set aside.",
        "In a large bowl, cream the butter or margarine with the sugar. Add vanilla.  Add eggs one at a time, beating well after each addition.  Beat in chocolate mixture.  Stir flour mixture into creamed mixture alternately with buttermilk.  Blend until smooth. Divide batter into three 9 inch pans, and smooth tops.",
        "Bake for 25 minutes, or until pick inserted in center comes out clean.  Cool cakes in pans for 10 to 15 minutes, then invert on wire racks; turn right side up to cool completely.",
        "Place 1 cake layer upside down on cake platter.  Spread with 1/2 inch layer chocolate whipped cream.  Repeat with another cake layer.  Top with remaining cake layer.  Frost with remaining cream.",
        "To Make Chocolate Whipped Cream Frosting:  In small saucepan over low heat stir 1 cup chocolate chips, honey, 2 tablespoons water and 1/8 teaspoon salt until chocolate is melted and mixture is smooth; cool completely.  In medium bowl beat cream until it holds its shape.  Gradually fold about 3 large tablespoons cream into chocolate mixture, then fold chocolate mixture into remaining whipped cream until blended."
    ],
    "ingredients": [
        "1 cup semisweet chocolate chips",
        "1/4 cup water",
        "2 1/4 cups cake flour",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "3/4 cup butter, softened",
        "2 teaspoons vanilla extract",
        "1 3/4 cups white sugar",
        "3 eggs",
        "1 cup buttermilk",
        "1 cup semisweet chocolate chips",
        "1/4 cup honey",
        "2 tablespoons water",
        "1/8 teaspoon salt",
        "2 cups heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Buttermilk Cake",
    "url": "http://allrecipes.com/recipe/7646/chocolate-buttermilk-cake/"
}
