{
    "directions": [
        "Preheat oven to 350°F. and butter a 10-cup bundt pan or other tube pan.",
        "In a food processor pulse hazelnuts until finely ground.",
        "In a double boiler or a bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove top of double boiler or bowl from heat and cool chocolate slightly.",
        "In a large bowl with an electric mixer beat butter with 1/2 cup sugar until light and fluffy and beat in chocolate. Add yolks, one at a time, beating well after each addition. Stir in hazelnuts and flour.",
        "In another bowl with cleaned beaters beat whites with salt at medium speed until white, opaque, and beginning to hold their shape. Gradually add remaining 1/2 cup sugar, beating at high speed until whites hold soft (not stiff), slightly glossy peaks.",
        "Stir one fourth whites into chocolate mixture to lighten and fold in remaining whites gently but thoroughly until no streaks remain.",
        "Pour batter into pan and smooth top. Bake cake in middle of oven 35 to 45 minutes, or until a tester comes out clean. Invert cake onto a rack. After 5 minutes remove pan but leave cake on rack until cooled completely. With cake on rack set over a pan (to catch the drips), pour chocolate glaze over cake, allowing it to drip down outside and center.",
        "While glaze is still wet (to avoid cracking), transfer cake to a platter. When glaze is set, cover cake loosely with plastic wrap or keep under cake dome at room temperature until ready to serve.",
        "If cake is kept more than 1 day (before or after serving), it should be wrapped in plastic wrap and frozen. Bring cake to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups hazelnuts (7 to 8 ounces)",
        "8 ounces semisweet chocolate, chopped coarse",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 cup sugar",
        "8 large eggs, separated",
        "1 cup all-purpose flour",
        "1/4 teaspoon salt",
        "Chocolate Glaze"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Winter",
        "Hazelnut",
        "Party",
        "Potluck",
        "Gourmet"
    ],
    "title": "Chocolate Hazelnut Pound Cake with Chocolate Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-pound-cake-with-chocolate-glaze-14008"
}
