{
    "directions": [
        "Bring cream and butter to boil in heavy large saucepan. Reduce heat to medium; stir until butter melts. Add chocolate; whisk until melted and smooth. Remove from heat. Whisk in sour cream, liqueur and orange peel. Pour into 9x13-inch baking dish. Refrigerate mixture until firm enough to hold shape, about 1 hour.",
        "Line 4 large cookie sheets with foil; sift powdered sugar over 2 sheets and cocoa powder over 2 sheets. Using 3/4-ounce ice cream scoop (1 1/2 tablespoons), scoop truffle mixture, mounding slightly, and release onto sugar-dusted sheet. Repeat to form total of 28 large truffles on sugar-dusted sheets and 28 on cocoa-dusted sheets. Using 1/4-ounce ice cream scoop (1 1/2 teaspoons), scoop truffle mixture and release onto sugar-dusted sheet. Repeat to form total of 10 small truffles on sugar-dusted sheets and 10 on cocoa-dusted sheets. Freeze truffles 10 minutes.",
        "Roll each truffle on sugar-dusted sheets in sugar, then roll between palms of hands into smooth round and set onto clean cookie sheet. Roll each truffle on cocoa-dusted sheets in cocoa, then roll between palms of hands into smooth round and set onto same cookie sheets as sugar-dusted truffles. Freeze 1 hour.",
        "Line 2 cookie sheets with foil. Melt white chocolate in top of double boiler over simmering water, stirring until candy thermometer registers 115°F. Remove from over water. Submerge 1 large sugar-dusted truffle in white chocolate, tilting pan if necessary. Using long fork, lift truffle from chocolate. Tap fork gently against side of pan (if necessary) to remove excess chocolate. Using knife as aid, slide truffle off fork and onto clean foil-lined cookie sheet. Wipe fork clean. Repeat process with all remaining sugar-dusted truffles. Freeze for 15 minutes.",
        "Reheat remaining white chocolate to 115°F. over simmering water. Repeat dipping process to give truffles a double coating of white chocolate.",
        "Melt bittersweet chocolate in top of clean double boiler over simmering water, stirring until candy thermometer registers 115°F. Dip spoon into bittersweet chocolate and wave quickly white chocolate-coated truffles, creating zigzag lines. Refrigerate truffles.",
        "Line 2 more cookie sheets with foil. Using dipping process described above, dip cocoa-dusted truffles into bittersweet chocolate, dipping each truffle only once. Immediately top each with candied violet. Refrigerate truffles 1 hour. (Can be prepared 3 weeks ahead. Cover and chill truffles and remaining melted bittersweet chocolate separately.)",
        "Remelt remaining bittersweet chocolate. Brush melted bittersweet chocolate in 2-inch-wide strip down length of cone. Wrap waxed paper around cone, covering completely and pressing against chocolate to adhere. Place cone on platter. Holding toothpick at sharp angle, press 2/3 of toothpick into cone near base. Press 1 large truffle onto toothpick. Repeat with more toothpicks and remaining large truffles, alternating dark and white truffles and attaching in spiral design toward top of cone. Begin attaching small truffles 4 inches from top of cone and continue to cover completely. (Can be prepared 1 day ahead. Cover and chill.) Press rose leaves between truffles on cone, covering any spaces. Press toothpicks into roses and attach to leaves between truffles."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons whipping cream",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "2 1/4 pounds bittersweet (not unsweetened) or semisweet chocolate,chopped",
        "3/4 cup sour cream",
        "6 tablespoons orange liqueur",
        "1 1/2 tablespoons grated orange peel",
        "1 1/2 cups powdered sugar",
        "1 1/2 cups unsweetened cocoa powder",
        "1 3/4 pounds imported white chocolate (such as Lindt), chopped",
        "1 1/2 pounds bittersweet (not unsweetened) chocolate, chopped",
        "38 candied violets (optional)*",
        "*Available at specialty foods store.",
        "1 12-inch styrofoam cone*",
        "Rose leaves and miniature white roses or other small flowers",
        "*Styrofoam cones are available at most floral and party supply stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Christmas",
        "Wedding",
        "Orange"
    ],
    "title": "Chocolate Truffle Croquembouche",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-truffle-croquembouche-2831"
}
