{
    "directions": [
        "Preheat the oven to 350°F. Line two cupcake pans with 24 baking cups.",
        "Place the cocoa powder in the bowl of a stand mixer with the paddle attachment and pour the hot coffee over. Mix on low speed until a thick paste forms and the mixture stops steaming, about 1 minute.",
        "Increase the mixer speed to medium. In a 4-cup measuring cup, combine the buttermilk, oil, vanilla, egg, egg yolk, and salt and mix lightly with a fork, ensuring yolks are broken. Slowly pour into the mixer bowl.",
        "Stop the mixer, detach the paddle, and scrape the bottom of the bowl well to loosen any caked-on cocoa. Reattach the paddle and turn the mixer to medium, letting it run for 1 minute. Stop mixer again.",
        "Sift together the flour, sugar, baking powder, and baking soda and add to the batter. Mix on low speed til just combined. Remove the bowl and paddle and use paddle attachment to scrape down the sides of the bowl, ensuring everything is mixed.",
        "Scoop the batter into prepared baking cups, filling them two thirds of the way.",
        "Bake in the middle of the oven for 20 to 25 minutes, rotating the pans halfway through. The cupcakes are done when the centers spring back when you touch them.",
        "Remove cupcakes from oven. Let cool completely.",
        "Prepare master recipe for buttercream . Once butter is added, add the peanut butter and salt and mix on high to combine. Taste for seasoning. If desired, add more peanut butter, 1 tablespoon at a time, or a pinch more salt. Continue until, after tasting, your eyes roll into the back of your head.",
        "Place the chocolate in a bowl, and shake the bowl back and forth until the chocolate flattens out on top.",
        "Heat the cream and sea salt in a medium saucepan until it comes to a boil.",
        "Immediately pour the hot cream mixture over chocolate, and let sit for two minutes to allow chocolate to melt.",
        "Using a heatproof spatula, stir the cream and chocolate together until completely smooth.",
        "Allow to cool slightly before drizzling on the cupcakes. The ganache should not be hot to the touch; it should still be liquid. If it cools completely and becomes solid, microwave it on 50 percent power in 20-second intervals, stirring between each, until desired consistency is reached.",
        "Fill a pastry bag fitted with a plain tip with the peanut buttercream, and pipe onto each chocolate cupcake. Put the cupcakes into the refrigerator so the buttercream hardens, about 20 minutes.",
        "Pulse the pretzels and peanuts in a food processor until they're coarse crumbs. Alternately, place in a strong zip-top bag and repeatedly smack the bag with a rolling pin, a heavy skillet, or anything else you find enjoyable. Place the crumbs in a pie dish or baking pan.",
        "Remove the cupcakes from the refrigerator and gently roll the sides of the buttercream in the pretzel mixture. Pour a handful of the mixture over the top of each cupcake and lightly pack on with hand. Shake off any excess and set aside.",
        "Drizzle ganache across each cupcake."
    ],
    "ingredients": [
        "3/4 cup cocoa powder",
        "2/3 cup scalding-hot coffee",
        "2/3 cup buttermilk",
        "1/3 cup canola or grapeseed oil",
        "1 teaspoon pure vanilla extract",
        "1 large egg",
        "1 large egg yolk",
        "1/2 teaspoon kosher salt",
        "1 1/3 cups all purpose flour",
        "1 3/4 cups sugar",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "One recipe French Buttercream",
        "1/2 cup all-natural peanut butter",
        "1 teaspoon kosher salt",
        "1/4 cup chopped semisweet chocolate",
        "1/4 cup heavy cream",
        "pinch sea salt",
        "1 1/2 cups salted pretzels, such as rods or other thick varieties",
        "3/4 cup roasted peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Birthday",
        "Peanut Butter"
    ],
    "title": "Chocolate Peanut Butter Pretzel Cupcakes",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-peanut-butter-pretzel-cupcakes-51196410"
}
