{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.",
        "Gently melt the chocolate in a small saucepan over very low heat, and allow to cool for about 5 minutes. Stir the butter and sugar together in a large bowl, and mix in the chocolate, molasses, eggs, and vanilla extract.",
        "Sift 5 cups of flour with the cinnamon, cloves, baking powder, and salt in a bowl. Gradually stir the flour mixture into the chocolate mixture by cupfuls, alternating each addition of flour with about 2 tablespoons of coffee, until all the coffee is incorporated. Dough should be soft but not runny. Add more flour if needed to make a soft dough, but cookies will be dry if the dough is too stiff. Use a small scoop or melon baller to form 1-inch balls, and place them on the prepared baking sheets.",
        "Bake in the preheated oven until the cookies are set and just beginning to brown at the edges, about 10 minutes. Let cool on sheets for about 1 minute before removing to continue cooling on a rack until slightly warm,  8 to 10 minutes.",
        "To make frosting, stir together confectioners' sugar, cream, and 1 teaspoon of vanilla extract in a bowl until smooth. Frost the cookies while they're still a little warm. Sprinkle with red or green sugar sprinkles."
    ],
    "ingredients": [
        "1 cup chopped dark chocolate",
        "1 cup butter, softened",
        "1 1/2 cups white sugar",
        "1/2 cup molasses",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "5 cups all-purpose flour, or as needed",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "2 teaspoons baking powder",
        "1 pinch salt",
        "1 cup brewed coffee, cooled",
        "2 cups confectioners' sugar",
        "2 tablespoons heavy cream",
        "1 teaspoon vanilla extract",
        "2 teaspoons red sugar sprinkles (optional)",
        "2 teaspoons green sugar sprinkles (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Coffee Molasses Cookies",
    "url": "http://allrecipes.com/recipe/212838/chocolate-coffee-molasses-cookies/"
}
