{
    "directions": [
        "Combine sugar, 1 1/2 cups water, and Frangelico in heavy large wide saucepan. Stir over medium heat until sugar dissolves. Bring to boil. Add pears (liquid will not cover pears completely). Cover and simmer until pears are tender when pierced with knife, turning occasionally, about 12 minutes. Using slotted spoon, transfer pears to medium bowl. Boil cooking liquid in pan until syrupy and reduced to generous 3/4 cup, about 5 minutes. Pour syrup over pears and cool slightly. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 350°F. Generously butter 12-cup nonstick Bundt pan, then spray with nonstick spray. Dust pan lightly with flour. Whisk 2 cups flour and next 5 ingredients in medium bowl to blend. Combine sugar, molasses, olive oil, and eggs in large bowl; whisk until well blended. Add dry ingredients and stir to blend. Mix in hot coffee, then chocolate and crystallized ginger (most of chocolate will melt). Transfer batter to prepared pan.",
        "Bake cake until tester inserted near center comes out clean and cake begins to pull away from sides of pan, 55 to 60 minutes. Transfer pan to rack; cool cake in pan 20 minutes. Turn cake out onto rack and cool at least 1 hour. DO AHEAD: Can be made 1 day ahead. Cool completely. Cover with cake dome or wrap in foil and store at room temperature. If desired, uncover cake and place on oven-proof platter and rewarm in 350°F oven for 15 minutes before serving.",
        "Combine all ingredients in large bowl. Using electric mixer, beat until peaks form. DO AHEAD: Can be made 4 hours ahead. Cover and chill.",
        "Cut warm or room-temperature gingerbread into 10 slices and transfer 1 slice to each of 10 plates. Place 1 pear half alongside each. Drizzle with pear syrup and top with coffee whipped cream."
    ],
    "ingredients": [
        "1 3/4 cups (packed) raw sugar or (packed) golden brown sugar",
        "1 1/2 cups water",
        "1/3 cup Frangelico (hazelnut liqueur)",
        "5 small firm but ripe pears, peeled, halved lengthwise, cored",
        "Nonstick vegetable oil spray",
        "2 cups all purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon coarse kosher salt",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground ginger",
        "1 cup sugar",
        "1 cup robust-flavored (dark) molasses",
        "1 cup mild-flavored olive oil",
        "3 large eggs",
        "1 cup freshly brewed coffee",
        "1 cup chopped bittersweet (60% cocoa) chocolate (5 to 6 ounces)",
        "1/4 cup chopped crystallized ginger",
        "1 cup chilled whipping cream",
        "3 tablespoons powdered sugar",
        "1 teaspoon instant coffee crystals"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Chocolate",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "High Fiber",
        "Pear",
        "Hazelnut",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Coffee Gingerbread with Hazelnut Poached Pears",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-coffee-gingerbread-with-hazelnut-poached-pears-350813"
}
