{
    "directions": [
        "Place foil cups on baking sheet. Stir bittersweet chocolate in medium metal bowl set over saucepan of simmering water (do not allow bottom of bowl to touch water) until chocolate melts and candy thermometer registers 115°F. Remove from over water. Using 1-inch-wide pastry brush, coat insides of foil cups with enough chocolate to coat thickly to top edge of cups (rewarm chocolate over simmering water as necessary to maintain temperature). Reserve remaining bittersweet chocolate. Place cups on baking sheet and refrigerate until firm, about 30 minutes.",
        "Bring cream to simmer in heavy small saucepan. Reduce heat to low; add white chocolate and stir until melted and smooth. Remove from heat. Whisk in extract, then sour cream. Cool to barely lukewarm, about 10 minutes. Mix in 1/4 cup crushed peppermint candies.",
        "Spoon enough white chocolate mixture into center of each chocolate cup to fill to within 1/8 inch of top (about 1 level teaspoonful per cup). Refrigerate until filling sets, about 30 minutes.",
        "Rewarm remaining melted bittersweet chocolate to 115°F in bowl set over barely simmering water. Spoon enough chocolate (about 1 teaspoon) over filling in each cup to cover completely. Tap on counter to level. Top each with candied violet, green candy decor, or crushed peppermint candies. Chill cups until firm, about 1 hour. (Can be made 2 weeks ahead; refrigerate in single layer in airtight container. Let stand at room temperature at least 30 minutes and up to 1 hour before serving.)",
        "Available at cake and candy supply stores and specialty foods stores."
    ],
    "ingredients": [
        "34 1 1/4-inch round foil petit four cups*",
        "16 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/4 cup whipping cream",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), coarsely chopped",
        "1 teaspoon peppermint extract",
        "1 tablespoon sour cream",
        "1/4 cup coarsely crushed red-and-white-striped hard peppermint candies",
        "Candied violets, green candy decors, or coarsely crushed hard peppermint candies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Christmas",
        "Winter",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Mint Truffle Cups",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-mint-truffle-cups-107518"
}
