{
    "directions": [
        "Preheat oven to 350 degrees  F. Line 13 x 9-inch baking pan with foil. Lightly grease.",
        "Combine flour, baking powder and salt in small bowl.",
        "Melt butter and semi-sweet morsels in large, microwave-safe bowl on 100% (HIGH) power for 45 seconds.  Microwave at additional 15-second intervals, stirring vigorously after each interval until morsels are melted.  Stir in sugar, eggs and vanilla extract. Gradually stir in flour mixture.  Fold in 1 cup DelightFulls morsels and almonds.  Spread into prepared baking pan.  Sprinkle 1/4 cup DelightFulls morsels over top.",
        "Bake for 30 minutes or until wooden pick near center comes out slightly sticky.  Cool completely in pan on wire rack.  Lift out by foil edges to cutting board.  Carefully remove foil.  Cut into bars.  Store in airtight  container.",
        "To serve, coarsely chop remaining 1/4 cup DelightFulls Morsels.  Spoon 1 teaspoon of Cream Cheese Topping onto each brownie bar.  Sprinkle with chopped DelightFulls morsels.",
        "Cream Cheese Topping: Whisk together 1/3 less fat cream cheese (Neufchatel) and powdered sugar in small bowl until creamy."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "3/4 teaspoon salt",
        "1/2 cup butter",
        "1 cup NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels",
        "1 1/4 cups granulated sugar",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "1 1/2 cups NESTLE® TOLL HOUSE® Delightfulls Cherry Flavored Morsels, divided",
        "1/2 cup toasted slivered almonds",
        "Cream Cheese Topping:",
        "4 ounces 1/3-less-fat cream cheese (Neufchatel), softened",
        "2/3 cup powdered sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Almond Brownies with Cherry Flavored Filled DelightFulls™",
    "url": "http://allrecipes.com/recipe/239565/chocolate-almond-brownies-with-cherry/"
}
