{
    "directions": [
        "Preheat oven to 350°F. Butter 8\" square baking pan; set aside. Toss hazelnuts, chocolate, cinnamon, and 1/4 cup sugar in a bowl.",
        "Whisk flour, baking powder, baking soda, and salt in a medium bowl. Using an electric mixer on high speed, beat butter and remaining 3/4 cup sugar in a large bowl until light and fluffy, about 3 minutes. Beat in vanilla. Add eggs one at a time, beating to blend between additions and occasionally scraping down sides of bowl. With mixer on low speed, add dry ingredients in 3 additions, alternating with yogurt in 2 additions, beginning and ending with dry ingredients.",
        "Pour half of batter into prepared pan and smooth top; top with half of hazelnut mixture. Spoon remaining batter over and smooth top; top with remaining hazelnut mixture. Bake cake until top is golden brown and a tester inserted into the center comes out clean, 40–45 minutes. Transfer pan to a wire rack; let cake cool in pan before turning out.",
        "DO AHEAD: Cake can be made 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature, plus more for pan",
        "1/2 cup blanched hazelnuts, chopped",
        "2 ounces bittersweet chocolate, chopped",
        "3/4 teaspoons ground cinnamon",
        "1 cup sugar, divided",
        "2 cups all-purpose flour",
        "3/4 teaspoons baking powder",
        "1/2 teaspoons baking soda",
        "1/4 teaspoons kosher salt",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "1 cup plain whole Greek yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Yogurt",
        "Shower",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Cinnamon Coffee Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cinnamon-coffee-cake-51193740"
}
