{
    "directions": [
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line pan bottoms with waxed paper. Using vegetable peeler, remove peel from oranges in strips. Coarsely chop peel in processor, stopping occasionally to scrap down sides of bowl. Add 1/3 cup sugar and blend until peel is minced. Add marmalade and puree. Using electric mixer, cream butter with pureed mixture and vanilla in large bowl until light and fluffy. Beat in remaining 1 cup sugar. Add eggs 1 at a time, beating well after each addition. Sift dry ingredients into small bowl. Mix dry ingredients into batter alternately with orange juice.",
        "Divide batter between prepared pans. Bake cakes until tops are golden brown and tester inserted in centers comes out clean, about 38 minutes. Cool cakes in pans on racks 10 minutes. Run sharp knife around pan sides to loosen cakes. Turn cakes out onto racks; cool. Peel off paper.",
        "Bring cream and butter to simmer in heavy large saucepan. Reduce heat to low. Add chopped chocolate and stir until melted. Mix in remaining ingredients. Pour ganache into large bowl. Freeze until very thick but still spreadable, stirring frequently, about 1 hour 15 minutes.",
        "Melt marmalade in heavy small saucepan over low heat. Remove from heat. Mix in Grand Marnier.",
        "Cut each cake into 2 layers. Place 1 layer on plate. Brush with 1/4 of glaze. Spread 1 cup ganache over. Top with second cake layer. Brush with 1/4 of glaze. Spread 3/4 cup ganache over. Top with 1 1/2 baskets berries (about 2 1/2 cups). Spread 1/2 cup ganache over third cake layer. Invert, chocolate side down, over berries. Brush with 1/4 of glaze. Spread 1 cup ganache over. Top with fourth cake layer. Brush with remaining glaze. Spread 3/4 cup ganache over top of cake. Spoon 1 cup ganache into pastry bag fitted with medium star top. Spread remaining ganache over sides of cake, drawing icing spatula up to create vertical lines. Pipe decorative border of ganache around top and bottom edges of cake. Freeze cake 20 minutes. Arrange remaining berries atop cake, covering completely. (Can be prepared 1 day ahead. Cover cake loosely with plastic wrap and refrigerate.)",
        "Garnish cake with mint sprigs. Serve cake at room temperature."
    ],
    "ingredients": [
        "2 medium oranges",
        "1 1/3 cups sugar",
        "1/4 cup orange marmalade",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "4 large eggs, room temperature",
        "2 1/2 cups cake flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "3/4 cup orange juice",
        "2 1/2 cups whipping cream",
        "9 tablespoons unsalted butter",
        "30 ounces bittersweet (not unsweetened) or semisweet chocolate,chopped",
        "7 tablespoons Grand Marnier or orange juice",
        "3 tablespoons thawed frozen orange juice concentrate",
        "2 tablespoons minced orange peel",
        "6 tablespoons orange marmalade",
        "6 tablespoons Grand Marnier or orange juice",
        "3 1/2 1/2-pint baskets of raspberries (or 5 1/4 cups frozen unsweetened raspberries, thawed, drained",
        "Mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Raspberry",
        "Orange",
        "Triple Sec"
    ],
    "title": "Chocolate-Orange Decadence",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-decadence-2890"
}
