{
    "directions": [
        "Preheat oven to 275°F. Line 2 large baking sheets with parchment paper. Place egg whites in large bowl; scrape in seeds from vanilla bean. Using electric mixer, beat egg whites until soft peaks form. Gradually add sugar, beating until meringue is very thick (similar to marshmallow creme), about 5 minutes. Fold in coconut, then almonds. Drop batter by rounded tablespoonfuls onto prepared sheets, spacing mounds 1 1/2 inches apart.",
        "Bake macaroons until pale beige outside and dry-looking (insides will still be soft), about 25 minutes. Transfer baking sheets to racks; cool macaroons completely. Transfer macaroons to work surface; re-line pans with clean parchment.",
        "Place chocolate in top of double boiler over simmering water. Stir chocolate until smooth; remove from over water. Dip bottom of 1 macaroon into melted chocolate to depth of 1/4 inch. Place on prepared sheet, chocolate side down. Repeat dipping with remaining macaroons. Chill until chocolate is firm, about 1 hour. (Can be made 3 days ahead. Cover and keep refrigerated. Let macaroons stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "5 large egg whites",
        "1/2 vanilla bean, split lengthwise",
        "1 1/3 cups sugar",
        "4 cups long-shred unsweetened coconut (about 6 ounces), lightly toasted",
        "3/4 cup slivered almonds, toasted, cooled, ground",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Passover",
        "Coconut",
        "Almond",
        "Vanilla",
        "Spring",
        "Kosher",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate-Dipped Macaroons",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-dipped-macaroons-107951"
}
