{
    "directions": [
        "Preheat oven to 350°F.",
        "In a food processor pulse biscuits or crackers until finely ground. Melt butter and in a large bowl stir together with crumbs, coconut, and salt until combined. Firmly press crumb mixture evenly onto bottom of a 9-inch square baking pan and bake in middle of oven until golden, about 15 minutes. Cool crust completely in pan on a rack.",
        "Chop chocolate. In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove top of double boiler or bowl from heat and cool chocolate 15 minutes.",
        "In a small bowl lightly beat yolks. In a saucepan heat cream over moderate heat until it just boils and whisk 1/2 cup into yolks, whisking constantly. Add mixture to remaining cream and cook over moderate heat, whisking, until an instant-read thermometer registers 160°F. Whisk custard into chocolate until just smooth and pour evenly over crust, smoothing top with a small metal offset spatula or rubber spatula. Chill confection, covered, at least 4 hours, or until firm. With a sharp thin knife cut confection into 36 squares. (Squares keep, layered between sheets of wax paper in an airtight container and chilled, 1 week.)",
        "Using star shapes cut out of parchment paper as a stencil, dust squares with confectioners' sugar."
    ],
    "ingredients": [
        "13 small (2-inch) wheatmeal biscuits such as Carr's or ten 5- by 2 1/2-inch graham crackers",
        "3/4 stick (6 tablespoons) unsalted butter",
        "2 cups sweetened flaked coconut (about 5 ounces)",
        "1/4 teaspoon salt",
        "12 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "2 large egg yolks",
        "1 cup heavy cream",
        "confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Coconut",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Coconut Squares",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-coconut-squares-14552"
}
