{
    "directions": [
        "Place a rack in the middle of the oven and preheat to 350 degrees F. Butter and flour the bundt pan.",
        "Sift the flour, cocoa, and salt into a medium bowl. Whisk the eggs, yolks, vanilla, and espresso powder together in a bowl and set aside.",
        "In a heavy-duty mixer, beat the butter with the paddle attachment, on medium speed for 1 minute, or until smooth. Gradually pour in the sugar, 1/4 cup at a time, until the butter begins to lighten, about 3 minutes. Scrape down the sides of the bowl with a rubber spatula and beat, on medium-high, until light and fluffy, about 4 minutes more.",
        "Adjust the mixer's speed to its lowest setting. Add 1/2 of the flour mixture and mix until completely absorbed before adding the rest. Scrape down the sides of the mixer then beat on medium-high for 30 seconds more.",
        "Adjust again to low speed and add half the egg mixture, mix until blended and smooth. Add the remaining egg mixture and beat until almost blended. Remove the bowl from the mixer, and fold in the chocolate by hand. Take care not to over mix the batter.",
        "Spoon the batter into the prepared pan and smooth the top with a spatula. Bake until a toothpick inserted into the center comes out clean, about 1 hour and 10 minutes.",
        "Cool the cake in the pan, on a rack for 10 minutes. Turn the cake out of the pan, and cool right side up on a rack. If not serving the same day, wrap in plastic wrap and store at room temperature. Glaze just before serving. Cake can be frozen for 1 month.",
        "For the glaze: Put all the ingredients in a microwave-safe bowl or glass measuring cup. Melt at 50 percent power in the microwave until soft, about 1 minute. Stir, and continue heat until completely melted, about 1 minute more. Remove from the microwave and whisk until fully combined, smooth and glossy. While warm, pour glaze over cooled cake and do not spread. Serve as desired."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "3/4 cup Dutch-processed cocoa powder",
        "1/2 teaspoon salt",
        "8 large eggs, at room temperature",
        "2 egg large yolks, at room temperature",
        "1 tablespoon pure vanilla extract",
        "2 teaspoons instant espresso powder",
        "12 ounces unsalted butter (3 sticks), room temperature",
        "2 1/2 cups sugar",
        "6 ounces bittersweet chocolate, roughly chopped",
        "6 ounces bittersweet or semisweet chocolate, finely chopped",
        "8 tablespoons unsalted butter (1 stick)",
        "1 tablespoon honey"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dessert",
        "Mixer Recipes",
        "American",
        "Egg Recipes",
        "Sugar",
        "Birthday Party",
        "Recipes for Parties",
        "Holiday",
        "Microwave Recipes"
    ],
    "title": "Chocolate Pound Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/chocolate-pound-cake-recipe"
}
