{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter 2 (9- by 2-inch) round cake pans and line bottom of each with a round of wax paper. Butter paper and dust pans with flour, knocking out excess.",
        "Whisk together hot water and cocoa powder in a bowl until smooth, then whisk in milk and vanilla.",
        "Whisk together flour, baking soda, and salt in another bowl.",
        "Beat together butter and brown sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, 3 to 5 minutes. Add eggs 1 at a time, beating well after each addition. Reduce speed to low and add flour and cocoa mixtures alternately in batches, beginning and ending with flour mixture (batter may look curdled).",
        "Divide batter between cake pans, smoothing tops. Bake until a wooden pick or skewer comes out clean and edges of cake begin to pull away from sides of pans, 25 to 35 minutes total. Cool layers in pans on racks 10 minutes, then invert onto racks, removing wax paper, and cool completely.",
        "Put 1 cake layer, rounded side up, on a cake stand or platter and, using offset spatula, spread top with about 1 cup buttercream. Top with remaining cake layer, rounded side down, and frost side and top of cake with 2 cups buttercream.",
        "For each color (you can make up to 5), transfer 3 tablespoons buttercream to a separate small bowl and tint with food coloring. Snip off 1 corner of each plastic bag to create a 1/4-inch opening, then spoon each color of buttercream into a bag, pressing out excess air. Twist each bag firmly just above buttercream, then decoratively pipe colored buttercream onto cake. Chill cake until buttercream is set, about 30 minutes.",
        "Just before serving, arrange 6 to 8 mini cupcakes on top of cake in 1 layer, then stack remaining mini cupcakes on top.",
        "*Wilton Paste Food Coloring available at wilton.com."
    ],
    "ingredients": [
        "1 cup boiling-hot water",
        "3/4 cup unsweetened cocoa powder",
        "1/2 cup whole milk",
        "1 teaspoon vanilla",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "Rounded 1/2 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "2 cups packed dark brown sugar",
        "4 large eggs at room temperature for 30 minutes",
        "4 cups vanilla buttercream",
        "Various food colorings*",
        "Special equipment: a metal offset spatula; several small sealable plastic bags (not pleated)",
        "Garnish: vanilla mini cupcakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "Kid-Friendly",
        "Wedding",
        "Vanilla",
        "Spring",
        "Winter",
        "Birthday",
        "Gourmet"
    ],
    "title": "Chocolate Cake with Vanilla Buttercream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cake-with-vanilla-buttercream-109040"
}
