{
    "directions": [
        "Stir 1/2 cup water and sugar in heavy medium saucepan over medium heat until sugar dissolves and syrup comes to boil. Add cherries. Remove mixture from heat; cool 30 minutes. Mix in kirsch. Cover and refrigerate 1 day.",
        "Using electric mixer, beat butter in large bowl until fluffy. Add sugar and beat until smooth. Beat in egg and vanilla. Sift flour, cocoa, and salt over; beat to blend. Using moistened fingertips, press dough over bottom and up sides of 11-inch-diameter tart pan with removable bottom. Cover and chill at least 1 hour and up to 1 day.",
        "Preheat oven to 350°F. Drain cherries, reserving cherry syrup. Sprinkle cherries in crust. Combine eggs, corn syrup, butter, vanilla, and salt in large bowl. Add sugar and 1/4 cup cherry syrup; beat to blend. Mix in chocolate. Pour filling into crust.",
        "Bake tart until set in center, about 1 hour. Cool on rack 30 minutes. (Can be made 1 day ahead. Cover; store at room temperature.) Release tart from pan. Dust with powdered sugar and cocoa. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup water",
        "1/2 cup sugar",
        "1 cup (packed) dried Bing (sweet) cherries",
        "1/3 cup kirsch (clear cherry brandy)",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup sugar",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "2 cups all purpose flour",
        "5 tablespoons unsweetened cocoa powder",
        "1/2 teaspoon salt",
        "3 large eggs",
        "1/3 cup dark corn syrup",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon (scant) salt",
        "1/2 cup sugar",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "Powdered sugar",
        "Unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Cherry",
        "Kirsch"
    ],
    "title": "Chocolate-Cherry Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cherry-tart-107113"
}
