{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch bundt pan.",
        "To Make Filling: Beat egg white with 1 teaspoon vanilla until soft mounds form. Add 1/2 cup sugar gradually, beating until stiff peaks form. Stir in coconut and 1 tablespoon flour. Set filling aside.",
        "Dissolve the cocoa in the hot coffee. Separate the three eggs, setting the yolks aside. Beat the egg whites until soft mounds form. Gradually beat in 1/2 cup sugar until meringue stands in medium-stiff peaks.",
        "Combine the sour cream and the baking soda. Beat remaining 1 1/4 cups of the sugar, shortening, egg yolks, salt, 1 teaspoon vanilla and 1/2 of the of the cocoa mixture until light and creamy, about 4 minutes. Stir in 2 cups flour, the sour cream mixture, and the remaining cocoa mixture; blend well.",
        "Fold about 1/3 of the beaten egg whites into the batter to lighten it; gently fold in remaining egg whites.",
        "Turn 1/2 of the chocolate batter into the prepared pan. Place 1/2 of the coconut mixture on top. Cover with the remaining chocolate batter, then the remaining coconut mixture.",
        "Bake in preheated oven until a tester inserted in the center of the cake comes out clean, 55 to 65 minutes. Let cake cool completely before removing from pan and icing.",
        "To Make Icing: Combine 2 cups sugar and 1/4 cup cocoa powder; transfer to a saucepan. Add butter, corn syrup, and milk. Bring to boil over medium heat, stirring frequently, and let boil for 1 minute. Do not overcook! Remove from heat, let cool, and stir in 1 teaspoon vanilla. Beat icing until it is at a soft, spreading consistency; glaze cake."
    ],
    "ingredients": [
        "Filling:",
        "1 egg white",
        "2 teaspoons vanilla extract",
        "1/2 cup white sugar",
        "2 cups shredded coconut",
        "1 tablespoon all-purpose flour",
        "Cake:",
        "1/2 cup unsweetened cocoa powder",
        "3/4 cup hot, brewed coffee",
        "3 eggs",
        "1 3/4 cups white sugar, divided",
        "1 teaspoon baking soda",
        "1/2 cup sour cream",
        "1/2 cup shortening",
        "1 teaspoon salt",
        "2 cups sifted all-purpose flour",
        "Icing:",
        "2 cups white sugar",
        "4 tablespoons unsweetened cocoa powder",
        "1/2 cup butter",
        "1/4 cup corn syrup",
        "1/2 cup milk",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Macaroon Cake",
    "url": "http://allrecipes.com/recipe/7971/chocolate-macaroon-cake/"
}
