{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans.",
        "Sift together the flour, baking soda, salt, 1 cup white sugar, and 1/2 cup cocoa. Add mayonnaise, 1 teaspoon vanilla, and water. Beat with and electric mixer on medium speed for 3 to 4 minutes. Pour batter into prepared pans.",
        "Bake at 350 degrees F (175 degrees C) for 25 minutes. Turn oven off, remove cake layers and allow to cool for 10 minutes in pans. Invert 1 layer onto a serving plate and the other layer onto a cooling rack. Top layer on plate with enough unwrapped mints to fully cover top. Return cake to oven for 3 to 5 minutes to soften chocolate mints, then spread evenly with a spatula. Top with second cake layer and allow to cool before frosting.",
        "To Make Fudge Frosting: Combine 6 tablespoons cocoa, 2 cups white sugar, 2/3 cup milk, 1/2 cup butter, and a pinch of salt in a saucepan over medium high heat. Stirring constantly bring mixture to a boil and reduce heat to low, allowing mixture to boil gently for 3 minutes without stirring.",
        "Remove from heat and let cool for 3 minutes before beating in 1 teaspoon vanilla extract. Beat with an electric mixer until just barely thick enough to spread without running off the cake. Spread over top of cooled cake."
    ],
    "ingredients": [
        "1/2 cup unsweetened cocoa powder",
        "1 cup white sugar",
        "2 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/4 teaspoon salt",
        "1 cup water",
        "1 cup mayonnaise",
        "1 teaspoon vanilla extract",
        "1 (4.5 ounce) package chocolate covered thin mints",
        "6 tablespoons unsweetened cocoa powder",
        "2 cups white sugar",
        "2/3 cup milk",
        "1/2 cup butter",
        "1 pinch salt",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Mint Mayonnaise Cake",
    "url": "http://allrecipes.com/recipe/7601/chocolate-mint-mayonnaise-cake/"
}
