{
    "directions": [
        "1. Preheat the oven to 350°F and grease a 10-inch springform pan with butter or oil.",
        "2. In a large mixing bowl, whisk together the flour, cocoa powder, baking soda, baking powder, and salt. In a food processor, process the sugar and butter until creamy (you can also do this by hand, armed with a sturdy spatula). Add the vanilla, coffee granules, and eggs, mixing well between each addition.",
        "3. Reserve a cup of the flour mixture and add the rest to the egg mixture. Mix until just combined; the batter will be thick.",
        "4. Add the zucchini and chocolate chips to the reserved flour mixture and toss to coat. Fold into the batter and blend with a wooden spoon—don't overmix. Pour into the prepared cake pan and level the surface with a spatula.",
        "5. Bake for 40 to 50 minutes, until a knife inserted in the center comes out clean.",
        "Transfer to a rack to cool for 10 minutes, run a knife around the pan to loosen the cake, and unclasp the sides of the pan. Let cool to room temperature before serving.",
        "Sprinkle with confectioners' sugar, glaze with melted chocolate, or decorate with a few slices of raw zucchini (you don't have to eat them, though)."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter at room temperature, or 1/2 cup extra virgin olive oil, plus 1 pat butter or teaspoon olive oil for greasing",
        "2 cups all-purpose flour",
        "1/2 cup unsweetened Dutch-process cocoa powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon fine sea salt",
        "1 cup (packed) light brown sugar",
        "1 teaspoon pure vanilla extract",
        "1 teaspoon instant coffee granules",
        "3 large eggs",
        "2 cups unpeeled grated zucchini, from about 1 1/2 medium zucchini (keep the remaining 1/2 zucchini for optional garnish)",
        "1 cup good-quality bittersweet chocolate chips",
        "Confectioners' sugar or melted bittersweet chocolate (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Egg",
        "Dessert",
        "Bake",
        "Vanilla",
        "Zucchini",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate and Zucchini Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-and-zucchini-cake-355911"
}
