{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter four 3/4-cup custard cups or soufflé dishes. Dust with flour; tap out excess. Line bottom of cups with parchment paper rounds. Place on rimmed baking sheet.",
        "Stir chocolate in top of double boiler set over simmering water until melted and smooth. Using on/off turns, blend almonds, amaretti, cinnamon, and salt in processor until finely ground. Transfer to medium bowl. Add butter, sugar, and eggs to processor; mix until blended and smooth, occasionally scraping down sides of bowl, about 3 minutes. Add cookie mixture and melted chocolate. Using on/off turns, process just until blended. Divide batter among custard cups. Bake until tops of tortes are dry and puffed and tester inserted into centers comes out with moist crumbs attached, about 30 minutes. Transfer cups to rack; cool 15 minutes. Run small knife around edges of cups to release tortes. Turn tortes out onto rack and turn right side up; cool. (Can be made 3 days ahead. Wrap in plastic and store at room temperature.)",
        "Beat together cream, sugar, and almond extract in medium bowl until cream holds peaks. (Can be made 4 hours ahead; refrigerate.)",
        "Place 1 torte on each of 4 plates. Top with dollop of whipped cream, sprinkle with crumbled amaretti, and serve."
    ],
    "ingredients": [
        "4 ounces semisweet chocolate, chopped",
        "3/4 cup sliced almonds, toasted",
        "12 1 1/2-inch-diameter amaretti cookies (Italian macaroons), about 2.6 ounces total",
        "1/4 teaspoon cinnamon",
        "Pinch of salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup sugar",
        "3 large eggs",
        "3/4 cup chilled whipping cream",
        "1 1/2 teaspoons powdered sugar",
        "1/2 teaspoon almond extract",
        "2 amaretti cookies, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Almond",
        "Spring",
        "Birthday",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Chocolate-Amaretti Tortes",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-amaretti-tortes-109273"
}
