{
    "directions": [
        "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with waxed paper. Butter waxed paper. Combine chocolate, 1 cup water and espresso powder in heavy small saucepan. Stir over low heat until chocolate melts and mixture is smooth. Remove from heat. Cool completely, stirring occasionally.",
        "Using electric mixer, beat brown sugar and butter in large bowl until light and fluffy. Add eggs 1 at a time, beating well after each addition. Add chocolate mixture and vanilla and beat until blended. Sift four, baking soda, baking powder and salt into medium bowl. Add dry ingredients to butter mixture alternately with sour cream in 3 additions, beginning with dry ingredients and beating well after each addition.",
        "Divide batter equally among prepared pans. Bake cakes until tester inserted into center comes out clean, about 30 minutes. Cool cakes in pans on racks 10 minutes. Using small knife, cut around sides of pans to loosen cakes. Turn cakes out onto racks. Remove waxed paper; cool completely.",
        "Combine sugar and 1/4 cup water in heavy medium saucepan. Stir over low heat until sugar dissolves. Increase heat to high and boil without stirring until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling occasionally, about 10 minutes. Remove from heat. Carefully add cream (mixture will bubble vigorously). Place pan over medium low heat and stir until caramel bits melt, about 5 minutes. Stir in coconut and 1 cup almonds. Cool filling until thick enough to spread, stirring occasionally, about 45 minutes.",
        "Melt butter and chocolate in heavy small saucepan over low heat, stirring until smooth. Transfer to large bowl. Stir in vanilla. Whisk in 1 cup powdered sugar and 1/4 cup sour cream. Whisk in remaining powdered sugar and sour cream.",
        "Place 1 cake layer on platter. Spread half of filling evenly over top, leaving 1/2-inch border. Top with second cake layer. Spread with remaining filling, leaving 1/2-inch boarder. Top with remaining cake layer. Spread frosting over sides and top of cake. Press 2 cups sliced almonds onto sides of cake. Using pastry spatula, swirl frosting on top of cake decoratively. (Can be made 1 day ahead. Cover with cake dome; store at room temperature.)"
    ],
    "ingredients": [
        "4 ounces unsweetened chocolate, chopped",
        "1 cup water",
        "1 tablespoon instant espresso powder or coffee powder",
        "2 1/4 cups (packed) dark brown sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "2 cups cake flour",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "1 cup sugar",
        "1/4 cup water",
        "1 cup whipping cream",
        "1 cup sweetened flaked coconut (about 2 1/2 ounces), toasted",
        "1 cup thinly sliced almonds (about 4 ounces), toasted",
        "1/2 cup (1 stick) unsalted butter",
        "3 ounces unsweetened chocolate, chopped",
        "1/2 teaspoon vanilla extract",
        "2 cups powdered sugar, sifted",
        "1/2 cup sour cream",
        "2 cups sliced almonds (about 8 ounces), toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kid-Friendly",
        "Coconut",
        "Almond",
        "Fall",
        "Birthday",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Cake with Caramel-Coconut-Almond Filling",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cake-with-caramel-coconut-almond-filling-906"
}
