{
    "directions": [
        "Preheat oven to 350°F. Butter 15 x 10 x 1-inch jelly-roll pan. Line bottom with waxed paper, allowing 1-inch overhang on short sides. Butter paper. Lightly dust paper and pan with flour; tap out excess. Using electric mixer, beat egg whites in large bowl until foamy. Add cream of tartar and beat until soft peaks form. Gradually add 6 tablespoons sugar, beating until stiff peaks form. Set aside.",
        "Beat egg yolks, 1/3 cup cocoa powder and remaining 6 tablespoons sugar in another large bowl until thick, about 2 minutes. Stir 1/4 of whites into yolk mixture to lighten. Fold in remaining whites. Gently spread batter in prepared pan.",
        "Bake until cake springs back when pressed in center, about 15 minutes. Transfer pan to rack. Cool completely. Sift remaining 1 tablespoon cocoa powder over cake. Line baking sheet with foil. Invert cake onto sheet. Peel off paper.",
        "Place 2 tablespoons boiling water in small bowl. Sprinkle gelatin over. Let soften 10 minutes. Heat 1/4 cup cream in small saucepan over medium-low heat just until warm. Add to gelatin mixture; stir until gelatin dissolves. Using electric mixer, beat remaining 1 1/4 cups chilled cream, powdered sugar, orange peel and vanilla in large bowl until soft peaks form. Add gelatin mixture. Beat until stiff peaks form.",
        "Spread filling over cake, leaving 1-inch border on sides. Using foil as aid and starting at 1 long side of cake, gently roll up cake, enclosing filling. Arrange roll, seam side down, on platter. Cover tightly and refrigerate until filling is set, at least 8 hours or overnight.",
        "Bring cream to simmer in heavy medium saucepan. Remove from heat. Add chocolate, corn syrup and liqueur. Stir until mixture is smooth. Let ganache stand until cool and thick.",
        "Whisk ganache just until soft peaks form (do not overmix). Spread ganache over roll. Using tines of fork, draw lines through ganache to represent tree bark. (Roll can be made 1 day ahead. Tent with foil and refrigerate.)",
        "Sift powdered sugar over roll. Surround with chocolate truffles."
    ],
    "ingredients": [
        "6 large eggs, separated",
        "1/4 teaspoon cream of tartar",
        "12 tablespoons sugar",
        "1/3 cup plus 1 tablespoon unsweetened cocoa powder, sifted",
        "2 tablespoons boiling water",
        "1 teaspoon unflavored gelatin",
        "1 1/2 cups chilled whipping cream",
        "1/4 cup powdered sugar",
        "1 teaspoon grated orange peel",
        "1/2 teaspoon vanilla extract",
        "1/2 cup whipping cream",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 tablespoons light corn syrup",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "Powdered sugar",
        "10 to 12 purchased chocolate truffles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Christmas",
        "Orange",
        "Chill"
    ],
    "title": "Chocolate-Orange Bûche de Noël",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-buche-de-noel-5768"
}
