{
    "directions": [
        "Blend together cream, milk, and mint in a blender just until minutest is finely chopped.",
        "Bring cream mixture to a boil in a heavy medium saucepan, then let stand off heat 5 minutes. Whisk together egg yolks and sugar, then slowly add cream mixture, whisking to combine. Return mixture to saucepan and cook over medium heat, stirring constantly with a wooden spatula, until custard thickens slightly and registers 175°F on an instant-read thermometer (do not let boil).",
        "Immediately strain custard thourough a fine-mesh sieve set over a metal bowl, pressing on and then discarding solids. Quick-chill custard by setting bowl in a larger bowl of ice and cold water and stirring occasionally until cold, about 20 minutes.",
        "Freeze custard in ice cream maker.",
        "Lightly oil terrine, then line long sides and bottom with a sheet of parchment paper, leaving at least 2 inches of overhang on each side.",
        "Pack terrine with ice cream, smoothing top with offset spatula, then cover with parchment overhang. Freeze until completely firm, at least 3 hours. make chocolate coating while terrine is freezing: Finely chop chocolate (preferably in a food processor).",
        "Bring water, cream, sugar, and cocoa to a boil in a small heavy saucepan, whisking until sugar is dissolved. Remove from heat and stir in crème de menthe and chocolate, stirring gently with whisk until chocolate is melted and smooth. Cool to room temperature (chocolate should still be liquid; do not chill), about 20 minutes.",
        "Put a 12- by 9-inch piece of parchment on a small baking sheet (if using other than 12- by 2- by 2-inch terrine, adjust dimensions of parchment accordingly), holding it down with dabs of chocolate under each corner. Spread chocolate evenly over parchment with cleaned offset spatula, leaving a 1/2-inch border on all sides. Chill on baking sheet until set, about 1 hour.",
        "Remove terrine from freezer and open flaps of parchment. Run a hot knife along short sides to loosen, then invert terrine onto a sheet of plastic wrap. Remove mold and discard parchment. Remove terrine from plastic wrap and arrange lengthwise on its side on set chocolate so that bottom of ice cream is 1 1/2 inches from a long edge of chocolate. Roll up ice cream tightly in coating (still on parchment) until edges of chocolate meet, then press together so that excess chocolate and parchment are standing up like a seam (you will trim it off later).",
        "Immediately freeze terrine until chocolate is firm, at least 1 hour. Starting from seam, peel parchment off both sides of terrine. Trim excess chocolate from seam with kitchen shears and trim open ends with a knife. Invert terrine onto a platter and peel parchment off top."
    ],
    "ingredients": [
        "1 1/2 cups heavy cream",
        "2/3 cup whole milk",
        "1 cup packed fresh mint leaves",
        "4 large egg yolks",
        "2/3 cup sugar",
        "3 1/2 ounces fine-quality bittersweet chocolate (preferably 70% cacao)",
        "1/3 cup water",
        "1/4 cup heavy cream",
        "3 tablespoons sugar",
        "1/4 cup unsweetened Dutch-process cocoa powder",
        "1 tablespoon crème de menthe or 1 tablespoon sugar",
        "Equipment: an ice cream maker; a 12- by 2- by 2-inch metal terrine mold or a 3-cup rectangular terrine or loaf pan; a small offset spatula",
        "12- by 2- by 2-inch metal terrine mold or a 3-cup rectangular terrine or loaf pan",
        "small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Egg",
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Mint",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Covered Mint Ice Cream Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-covered-mint-ice-cream-terrine-238970"
}
