{
    "directions": [
        "Line 2 rimmed baking sheets with parchment paper. Stir sugar and 1/3 cup water in a small saucepan over medium-low heat until sugar dissolves. Increase heat and cook without stirring, occasionally swirling pan and brushing down sides with a wet pastry brush, until amber in color, 7-8 minutes. Stir in hazelnuts, then pour onto 1 prepared sheet, separating nuts. Let cool.",
        "Transfer candied nuts to a food processor. Add hazelnut oil and purée until smooth to make praline paste.",
        "Combine both chocolates and 3 tablespoons praline paste in a medium metal bowl (reserve remaining praline paste for praline mousse layer). Set bowl over a saucepan of simmering water and stir until chocolate is melted and mixture is smooth. Remove from heat and stir in salt, then cereal. Spread out in a thin layer (about 1/8\") on second prepared baking sheet. Chill until set, about 30 minutes.DO AHEAD: Can be made 1 day ahead. Cover and keep chilled. Cover and chill remaining praline paste.",
        "Preheat oven to 375°F. Line a 17x11x1\" sheet pan with parchment paper; butter paper. Sift flour and cocoa powder into a medium bowl and set aside. Separate 4 eggs, placing yolks in a large bowl and whites in a medium bowl. Using an electric mixer, beat yolks with 1/2 cup sugar on medium speed until thick and light yellow, about 3 minutes. Beat in 4 whole eggs, one at a time, blending well between additions.",
        "Using clean, dry beaters, beat egg whites with remaining 1/2 cup sugar and corn syrup until slightly thickened and frothy, about 2 minutes. Add egg-white mixture to egg-yolk mixture and beat to blend. Add flour-cocoa powder mixture; fold just to blend. Spread out evenly on prepared baking sheet.",
        "Bake until a tester inserted into center of cake comes out clean, about 15 minutes. Let cool completely. Invert cake onto a large cutting board or baking sheet and peel off parchment. Brush cake all over with brandy. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Bring cream to a boil in a small saucepan. Purée hot cream, hazelnut butter, and salt in a food processor. Let cool to room temperature. With machine running, add butter, 1 tablespoon at a time, puréeing until smooth between additions. DO AHEAD: Can be made 1 day ahead. Cover and chill. Return to room temperature before using.",
        "Combine chocolate, praline paste, and butter in a medium bowl. Bring 3/4 cup cream to a boil in a small saucepan; pour over chocolate mixture. Let stand for 1 minute, then stir until melted and smooth. Beat remaining 1 cup chilled cream until soft peaks form. Fold whipped cream into chocolate mixture. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Spread nut ganache over cake and chill in freezer until set, about 15 minutes. Spread mousse over ganache and chill in freezer until set, about 15 minutes. Cut cake crosswise into thirds; stack layers on top of each other. Trim edges, then spread Chocolate Glaze epi:recipelinkover top and sides of cake. Freeze until set, about 1 hour. Place in refrigerator and chill overnight. DO AHEAD: Can be made 2 days ahead. Tent with foil and keep chilled. </epi:recipelink>",
        "Let cake stand at room temperature for 30 minutes before serving. Break up praline chocolate crunch into large shards and arrange on top of cake. Garnish with roasted hazelnuts."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1 1/2 cups blanched hazelnuts, toasted",
        "1 teaspoon hazelnut or vegetable oil",
        "4 ounces dark chocolate (do not exceed 72% cacao), chopped",
        "4 ounces high-quality milk chocolate (such as Lindt or Scharffen Berger), chopped",
        "1/4 teaspoon kosher salt",
        "1 3/4 cups puffed rice cereal or crushed cornflakes",
        "Unsalted butter (for parchment paper)",
        "1 cup all-purpose flour",
        "1 cup natural unsweetened cocoa powder",
        "8 large eggs",
        "1 cup sugar, divided",
        "2 tablespoons corn syrup",
        "1/2 cup brandy or orange liqueur",
        "1/2 cup heavy cream",
        "1/2 cup hazelnut butter (or ground roasted hazelnuts)",
        "Pinch of kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3 1/2 ounces dark chocolate (do not exceed 72% cacao), chopped",
        "1 cup hazelnut praline paste (reserved from praline chocolate crunch)",
        "5 tablespoons unsalted butter, room temperature, cubed",
        "1 3/4 cups chilled heavy cream, divided",
        "Chocolate Glazeepi:recipelink</epi:recipelink>",
        "1/4 cup roasted hazelnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Birthday",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Hazelnut Cake with Praline Chocolate Crunch",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-hazelnut-cake-with-praline-chocolate-crunch-367752"
}
