{
    "directions": [
        "Blend the flour, cornmeal, 3/4 cup pine nuts, 1/4 cup sugar, and salt in a food processor until finely ground. Add the butter and pulse, just until the dough forms. Press the dough over the bottom and about 2 inches up the sides of an 11-inch-diameter tart pan with a removable bottom. Refrigerate until the dough is firm, about 30 minutes.",
        "Preheat the oven to 350 degrees F.",
        "Line the tart dough with aluminum foil and fill with pie weights or dried beans. Bake the tart shell in the lower third of the oven until just set, about 25 minutes. Carefully remove the foil and pie weights. Bake the shell until golden, about 10 minutes longer. Cool completely.",
        "Combine the remaining 3/4 cup of sugar with 1/2 cup water in a small saucepan. Bring to a boil, stirring until the sugar dissolves. Cool the sugar syrup slightly.",
        "In a double boiler, melt the chocolate over very softly simmering water.",
        "Pulse the ricotta cheese and cream cheese in a food processor until smooth. Add the egg and egg yolks, 1 at a time, and process until smooth. Add the melted chocolate and process until combined. With the machine running, add the sugar syrup in a thin steady stream and process until smooth.",
        "Pour the custard into the tart shell and bake until the filling is almost set, about 30 minutes or until the custard has set. Scatter the remaining 3/4 cup toasted pine nuts on top of the filling. Let the tart cool completely before serving.",
        "The tart can be wrapped in plastic and refrigerated for up to 3 days. Return the tart to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "2 tablespoons cornmeal",
        "3/4 cup pine nuts, plus 3/4 cup, toasted (about 8 ounces in total)",
        "1/4 cup sugar, plus 3/4 cup",
        "Pinch salt",
        "1 stick (4 ounces) unsalted butter, melted and cooled slightly",
        "1/2 cup water",
        "8 ounces semisweet chocolate chips (about 1 1/3 cups)",
        "3/4 cup ricotta cheese",
        "3 ounces cream cheese, at room temperature",
        "1 large egg",
        "3 large egg yolks"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "Chocolate Pie",
        "Chocolate",
        "Pie Recipes",
        "Baking",
        "Food Processor",
        "European Recipes",
        "Dairy Recipes",
        "Cheese",
        "Ricotta",
        "Sugar",
        "Grain Recipes",
        "Cornmeal",
        "Cream Cheese Recipes"
    ],
    "title": "Chocolate-Ricotta Pie",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/chocolate-ricotta-pie-recipe"
}
