{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups with shortening using a paper towel and dust with about 1 teaspoon flour or line with paper liners.",
        "Combine 1 1/2 cups flour, white sugar, cocoa powder, baking soda, and salt in the bowl of a stand mixer. Beat 1 cup cold water, olive oil, orange juice, and vanilla extract into flour mixture on medium-low speed until batter is just combined, about 2 minutes. Fold orange zest into batter. Pour batter into prepared muffin cups, 2/3-full.",
        "Bake in the preheated oven until a toothpick inserted into a cupcake comes out clean, about 20 minutes. Transfer cupcakes to a wire rack to cool completely, about 30 minutes.",
        "Beat butter in a bowl using an electric mixer in medium speed until fluffy, about 1 minute. Slowly pour confectioners' sugar into creamed butter and beat until incorporated, about 2 minutes. Beat pudding mix into butter mixture until just combined. Add water, 1 tablespoon at a time, until desired consistency of icing is reached. Ice the cooled cupcakes; garnish with grated chocolate."
    ],
    "ingredients": [
        "1 teaspoon shortening, or as needed",
        "1 teaspoon all-purpose flour, or as needed",
        "Cake:",
        "1 1/2 cups all-purpose flour, sifted",
        "1 cup white sugar",
        "3 tablespoons cocoa powder",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup cold water",
        "1/3 cup olive oil",
        "2 tablespoons orange juice",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon grated orange zest",
        "Icing:",
        "1/2 cup unsalted butter",
        "2/3 cup confectioners' sugar, sifted",
        "2 tablespoons instant pistachio pudding mix",
        "2 tablespoons cold water",
        "1 ounce dark chocolate, grated"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate-Orange Cupcakes with Pistachio Buttercream",
    "url": "http://allrecipes.com/recipe/234715/chocolate-orange-cupcakes-with-pistac/"
}
