{
    "directions": [
        "Bring milk to simmer in heavy medium saucepan. Remove from heat. Combine sugar and cornstarch in large bowl. Beat egg yolks into sugar mixture. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk over medium heat until mixture boils and thickens, about 1 minute. Remove from heat; add chocolate, butter and vanilla and whisk until mixture is smooth. Transfer filling to medium bowl. Cool, stirring occasionally. Gently press plastic wrap directly onto surface of filling; cover and chill until cold, at least 3 hours.",
        "Preheat oven to 325°F. Butter 17 1/4 x 11 1/2 x 1-inch jelly roll pan. Line pan with parchment paper. Sift first 6 ingredients into large bowl. Whisk coffee, buttermilk, oil, eggs and vanilla in medium bowl. Add liquid ingredients to dry ingredients; mix just until combined. Transfer batter to prepared pan, spreading evenly. Bake cake until tester inserted into center comes out clean, about 20 minutes. Cool cake completely in pan on rack. Using small knife, cut around edges of pan. Turn cake out onto work surface. Peel off parchment. Trim tough edges. Cut cake crosswise into three 5x10 1/2-inch pieces. (Filling and cake can be made ahead. Keep filling refrigerated up to 2 days. Wrap cake layers in plastic and refrigerate up to 1 day.)",
        "Place 1 cake layer on platter. Spread half of filling over top. Top with second cake layer. Spread remaining filling over. Top with third cake layer. Pour lukewarm glaze over top and sides of cake, covering completely. Smooth sides with spatula. Refrigerate 2 hours. (Can be prepared 1 day ahead; cover and keep refrigerated.)"
    ],
    "ingredients": [
        "1 1/2 cups milk (do not use low-fat or nonfat)",
        "1/2 cup sugar",
        "3 1/2 tablespoons cornstarch",
        "5 large egg yolks",
        "6 ounces milk chocolate, chopped",
        "1 tablespoon butter",
        "1 teaspoon vanilla extract",
        "1 1/2 cups sugar",
        "1 1/3 cups all purpose flour",
        "2/3 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup strong fresh-brewed coffee",
        "3/4 cup buttermilk",
        "6 tablespoons vegetable oil",
        "2 large eggs, beaten to blend",
        "1 teaspoon vanilla extract",
        "Chocolate Glaze"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Vanilla",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Layer Cake with Chocolate Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-layer-cake-with-chocolate-glaze-5249"
}
