{
    "directions": [
        "Toss fresh or frozen cherries and any juices with granulated sugar and almond extract in a bowl and let stand at least 2 hours. Drain cherries, reserving 1/2 cup cherry juices.",
        "Preheat oven to 350°F. Butter and flour a 13- by 9-inch metal baking pan, knocking out excess flour. Whisk hot water and cocoa powder in a small bowl until smooth, then whisk in reserved cherry juices and vanilla.",
        "Sift together flour, baking soda, and salt into another bowl.",
        "Beat together butter and brown sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, about 3 minutes, then add eggs 1 at a time, beating well after each addition. Add flour mixture and cocoa mixture alternately in batches, beginning and ending with flour mixture and mixing at low speed until blended (batter may look curdled).",
        "Stir in cherries and chocolate chips and pour batter into pan, smoothing top. Bake in middle of oven until a wooden pick inserted in center comes out clean, 35 to 40 minutes. Cool cake completely in pan on a rack, then cut into squares. Just before serving, dust with confectioners sugar."
    ],
    "ingredients": [
        "3 cups fresh or frozen (not thawed) pitted sour cherries (1 lb)",
        "2/3 cup granulated sugar",
        "1 teaspoon almond extract",
        "1 cup boiling-hot water",
        "3/4 cup unsweetened cocoa powder (not Dutch-process)",
        "1 teaspoon vanilla",
        "2 cups all-purpose flour",
        "1 1/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/4 cups packed dark brown sugar",
        "4 large eggs",
        "1 cup semisweet chocolate chips",
        "Garnish: confectioners sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Berry",
        "Chocolate",
        "Dessert",
        "Bake",
        "Picnic",
        "Quick & Easy",
        "Cherry",
        "Almond",
        "Summer",
        "Edible Gift",
        "Gourmet"
    ],
    "title": "Chocolate Cherry Cake Squares",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cherry-cake-squares-108368"
}
