{
    "directions": [
        "Cut a circle of parchment paper to fit inside mouth of a heavy large pot. Combine wine, sugar, vanilla bean, canela, anise seeds, and lemon zest in pot over medium heat. Cook, stirring, until sugar dissolves. Add pears and enough water to cover, 3 to 4 cups. Place parchment paper over pears to keep them submerged, and bring liquid to gentle simmer. Simmer until pears are just tender, about 12 minutes. Remove pears, discarding liquid, cool completely, and refrigerate until chilled.",
        "Melt butter or margarine in medium skillet over medium heat. Add pecans and cook, stirring, until lightly toasted, about 2 minutes. Add chopped apricots and cook, stirring, 1 minute more. Add brown sugar and cook mixture, stirring constantly, until light syrup develops, about 1 more minute. Remove from heat and cool.",
        "Stuff pecan mixture into hollowed pears, packing tightly. Refrigerate until chilled.",
        "Line baking sheet with parchment paper. Melt butter or margarine in small saucepan. Remove from heat and stir in chocolate.",
        "Remove pears from refrigerator and dip into chocolate sauce, tilting and swirling pan to coat bottom half of each pear.",
        "Place on parchment paper-lined baking sheet and refrigerate until chocolate is set.",
        "In metal bowl whisk together egg yolks, wine, sugar, and chile powder until well combined. Set bowl over saucepan of simmering water and cook mixture, whisking constantly, until foamy and thick enough that strokes leave a clear path, about 4 to 5 minutes. Remove bowl from over water.",
        "Ladle sabayon into 6 shallow bowls. Place 1 pear in each bowl. Garnish with fresh mint and berries."
    ],
    "ingredients": [
        "1 bottle full-bodied red wine such as Zinfandel",
        "1/2 cup sugar",
        "1 vanilla bean, split lengthwise",
        "3-inch stick canela (see Tips, below)",
        "1 teaspoon anise seeds",
        "1 tablespoon finely grated lemon zest",
        "6 whole Anjou pears, peeled, cored, and hollowed (see Tips, below)",
        "Parchment paper",
        "2 tablespoons unsalted butter or margarine",
        "1/2 cup pecans, chopped",
        "1/2 cup dried apricots, chopped",
        "1 tablespoon light brown sugar",
        "4 tablespoons unsalted butter or margarine",
        "1/2 cup semisweet chocolate, chopped",
        "4 large egg yolks",
        "3/4 cup dry white wine",
        "2 tablespoons sugar",
        "1/8 teaspoon chile powder",
        "2 pints fresh raspberries",
        "Six mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Dessert",
        "Poach",
        "Passover",
        "Pear",
        "Apricot",
        "Pecan",
        "Spring",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate-Covered Poached Pears with Apricot-Pecan Stuffing and Chile Sabayon",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-covered-poached-pears-with-apricot-pecan-stuffing-and-chile-sabayon-231941"
}
