{
    "directions": [
        "Preheat oven to 325°F.",
        "Put chocolate in a small metal bowl. In a heavy saucepan heat 1/2 cup cream over moderately high heat until it just comes to a boil and pour over chocolate. Let chocolate stand until softened and whisk mixture until smooth.",
        "In a bowl whisk together yolks, whole egg, and granulated sugar and whisk in chocolate mixture. In pan heat remaining 1 1/4 cups cream and milk until mixture just comes to a boil. Add milk mixture to egg mixture in a stream, whisking, and whisk in Grand Marnier and zest. Skim off any froth.",
        "Divide custard among eight 1/2-cup flameproof ramekins set in a roasting pan and add enough hot water to pan to reach halfway up sides of ramekins. Bake custards in middle of oven until they are just set but still tremble slightly, about 40 minutes. Remove ramekins from pan and cool custards. Chill custards, covered loosely with plastic wrap, at least 4 hours or overnight.",
        "Set broiler rack so that custards will be 2 to 3 inches from heat and preheat broiler.",
        "Sift brown sugar evenly over custards and broil custards until sugar is melted and caramelized, about 2 minutes. (Alternatively, raw sugar may be sprinkled over custards and caramelized with a blowtorch.) Chill custards 20 minutes."
    ],
    "ingredients": [
        "4 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 3/4 cups heavy cream",
        "6 large egg yolks",
        "1 whole large egg",
        "1/2 cup granulated sugar",
        "1 3/4 cups milk",
        "2 tablespoons Grand Marnier",
        "1 teaspoon freshly grated orange zest",
        "1/4 cup firmly packed light brown sugar or raw sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Orange Crème Brûlée",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-creme-brulee-13066"
}
