{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cut out 4 rounds of parchment paper to fit just inside bottom of each mold, then set rounds aside. Melt 2 tablespoons butter, then brush molds with some of it. Line bottom of each mold with a round of parchment and brush parchment with some melted butter. Chill molds 5 minutes (to set butter), then brush parchment and side of each mold with more melted butter. Chill molds 5 minutes more. Dust molds with flour, knocking out excess, and set aside.",
        "Simmer cranberries and 1/4 cup bourbon in a small saucepan over low heat until cranberries are tender and bourbon is absorbed, about 5 minutes. Remove from heat.",
        "Melt chocolate and remaining stick butter in a small heavy saucepan over low heat, stirring constantly, until smooth. Remove from heat and cool 10 minutes.",
        "Pulse pecans with flour (2 tablespoons) in a food processor until finely ground, being careful not to process to a paste.",
        "Beat together yolks and brown sugar in a large bowl with an electric mixer at medium speed until thick and pale, about 2 minutes. Add chocolate mixture and beat until just combined, then stir in pecan mixture and cranberries.",
        "Beat whites with a pinch of salt in another bowl using cleaned beaters until they just hold stiff peaks. Fold one third of whites into chocolate mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Divide batter among molds (they will be very full), then put molds in a shallow baking pan and bake until a wooden pick or skewer inserted into center of a cake comes out with tip wet and remainder of pick dry, about 25 minutes. (Batter will rise above rims but will not spill over.) Transfer cakes to a rack and cool in molds 30 minutes. (Cakes will continue to set as they cool.)",
        "Beat cream with confectioners sugar and remaining 2 teaspoons bourbon in a small bowl using cleaned beaters until it just holds soft peaks.",
        "Remove side from each mold, then slide each cake from bottom onto a dessert plate, discarding parchment. Lightly dust each cake with confectioners sugar and serve with a dollop of bourbon whipped cream."
    ],
    "ingredients": [
        "1 1/4 sticks (10 tablespoons) unsalted butter",
        "2 tablespoons all-purpose flour plus additional for dusting molds",
        "1 cup dried cranberries (4 1/2 oz)",
        "1/4 cup plus 2 teaspoons bourbon",
        "7 oz fine-quality bittersweet chocolate (not more than 60% cacao if marked), chopped",
        "1/4 cup pecans, toasted and cooled",
        "3 large eggs, separated",
        "1/2 cup packed light brown sugar",
        "1/2 cup chilled heavy cream",
        "1 teaspoon confectioners sugar plus additional for dusting",
        "Special equipment: parchment paper; 4 (4- by 1 1/4-inch) tartlet molds with removable bottoms or 4 (8-oz) ramekins (4 inches across and 1 1/4 inches deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Pecan",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Cranberry Cakes with Bourbon Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cranberry-cakes-with-bourbon-whipped-cream-236426"
}
