{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Grease a 10-inch fluted tube pan (such as a Bundt(R)) and coat inside of pan with unsweetened cocoa powder.",
        "Beat cream cheese, confectioners' sugar, 1 egg, and Irish cream liqueur in a bowl until smooth and creamy. Set aside.",
        "Beat chocolate cake mix, chocolate pudding mix, 3 eggs, and vegetable oil in a separate bowl until batter is thick and smooth. Slowly beat Irish stout beer into the batter.",
        "Spoon 1/3 of the cake batter into the prepared pan; layer the Irish cream filling on top. Spoon remaining cake batter over the filling.",
        "Bake in the preheated oven until a toothpick inserted into the cake comes out clean, 40 to 50 minutes.",
        "Loosen the edges of the cake from the pan with a thin spatula; let cake rest in pan 15 minutes. Invert pan over a wire rack to release cake and allow to cool completely on the rack.",
        "While cake is cooling, melt butter in a saucepan over medium heat and stir in white sugar and Irish whiskey. Bring to a boil, stirring to dissolve sugar, reduce heat to low, and simmer until thickened, about 10 minutes.",
        "Transfer cake to a serving platter. Generously brush whiskey glaze over cooled cake several times and allow glaze to soak into cake."
    ],
    "ingredients": [
        "1 tablespoon unsweetened cocoa powder",
        "2 (8 ounce) packages cream cheese, softened",
        "1/4 cup confectioners' sugar",
        "1 egg",
        "6 tablespoons Irish cream liqueur",
        "1 (18.25 ounce) package chocolate cake mix without pudding",
        "1 (3.9 ounce) package instant chocolate pudding mix",
        "3 eggs",
        "1/2 cup vegetable oil",
        "1 (12 fluid ounce) can or bottle Irish stout beer (such as Guinness®)",
        "2 tablespoons butter",
        "1 cup white sugar",
        "1/2 cup Irish whiskey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Irish Car Bomb Cake",
    "url": "http://allrecipes.com/recipe/220459/chocolate-irish-car-bomb-cake/"
}
