{
    "directions": [
        "Preheat oven to 350¡F. Spray two 9-inch-diameter cake pans with 2-inch-high sides with nonstick spray. Using electric mixer, beat 1 1/2 cups oil and eggs in large bowl until well blended and thick, about 2 minutes. Add flour, sugar, cocoa powder, baking soda and salt; beat at low speed to blend. Increase speed; beat 1 minute longer (batter will be very thick). Stir in carrots, coconut and orange peel, then orange pieces. Divide batter between prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 40 minutes. Cool cakes in pans 10 minutes. Turn out onto racks; cool completely.",
        "Stir chocolate chips in heavy medium saucepan over very low heat until melted and smooth. Remove from heat and cool to lukewarm. Spoon 1/3 cup chocolate into small bowl and reserve for decoration. Beat margarine and sugar in medium bowl until fluffy. Beat in remaining melted chocolate and orange juice concentrate.",
        "Place 1 cake layer on platter. Spread with 2/3 cup frosting. Top with second cake layer. Spread remaining frosting over top and sides of cake. Arrange additional orange segments around top edge of cake. Rewarm 1/3 cup reserved chocolate to pourable consistency if necessary. Drizzle orange segments with chocolate. (Can be prepared 1 day ahead. Cover with cake dome and refrigerate.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups vegetable oil",
        "4 large eggs",
        "2 1/2 cups all purpose flour",
        "2 1/4 cups sugar",
        "2/3 cup unsweetened cocoa powder",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "2 cups finely shredded peeled carrots (about 10 ounces)",
        "1 cup (packed) sweetened flaked coconut",
        "1 1/2 teaspoons grated orange peel",
        "1 11-ounce can mandarin oranges, drained, cut into 1/2-inch pieces",
        "2 1/2 cups semisweet chocolate chips (about 15 ounces)",
        "1 cup (2 sticks) unsalted nondairy (pareve) margarine, room temperature",
        "1/3 cup powdered sugar",
        "1/4 cup frozen orange juice concentrate, thawed",
        "Additional canned mandarin orange segments, drained, patted very dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Hanukkah",
        "Vegetarian",
        "Rosh Hashanah/Yom Kippur",
        "Orange",
        "Coconut",
        "Carrot",
        "Kosher"
    ],
    "title": "Chocolate-Orange Carrot Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-orange-carrot-cake-5792"
}
