{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Combine heavy cream, vanilla bean, and salt in a saucepan over medium heat. Heat until surface of cream begins to shimmer, about 5 minutes. Remove from heat and take out vanilla bean.",
        "Whisk egg yolks, 3/4 cup plus 2 tablespoons white sugar, and cocoa together in a large bowl until well-blended. Pour hot cream over egg mixture a little at a time, stirring constantly, until all cream is incorporated and custard is smooth. Strain custard into a large glass measuring cup.",
        "Arrange eight 6-ounce ramekins in a roasting pan. Pour custard into ramekins. Pour enough warm water into the pan to come halfway up the sides of the ramekins. Cover pan loosely with aluminum foil.",
        "Bake in the preheated oven until custard is firm around the edges, but still wobbly in the center, about 1 hour. Remove from oven and let cool to room temperature, about 1 hour.",
        "Cover ramekins with plastic wrap and refrigerate until chilled, about 3 hours.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Remove ramekins from refrigerator and blot any liquid on the surface with a paper towel. Arrange ramekins on a baking sheet. Top each custard with 1 tablespoon of brown sugar, spreading evenly to the edges.",
        "Broil in the preheated oven until sugar is melted and crisp, 30 seconds to 2 minutes. Cool briefly, about 5 minutes, before serving."
    ],
    "ingredients": [
        "4 cups heavy whipping cream",
        "1 vanilla bean, split in half lengthwise",
        "1/4 teaspoon salt",
        "8 egg yolks",
        "3/4 cup white sugar",
        "2 tablespoons white sugar",
        "1/2 cup cocoa powder",
        "Topping:",
        "1/2 cup brown sugar, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Creme Brulee",
    "url": "http://allrecipes.com/recipe/246084/chocolate-creme-brulee/"
}
