{
    "directions": [
        "In a baking dish toast 2/3 cup of the coconut in the middle of a preheated 350°F. oven until it just begins to color, transfer it to a small bowl, and let it cool.",
        "In a metal bowl set over a saucepan of simmering water melt the chocolate and the butter with the rum, stirring, until the mixture is smooth and remove the bowl from the heat. In a bowl whisk together the yolks, 2 tablespoons of the sugar, the flour, and the salt until the mixture is smooth and whisk in the chocolate mixture and the remaining (untoasted) 1/3 cup coconut. In another bowl with an electric mixer beat the whites until they hold soft peaks and beat in the remaining 2 tablespoons sugar until the whites just hold stiff peaks. Stir half the whites into the chocolate mixture and fold in the remaining whites gently but thoroughly. Pour the mixture into a buttered 7- or 8-inch springform pan, bake the cake in the middle of a preheated 350°F. oven for 40 to 45 minutes, or until it is set and the top is puffed and cracked, and let it cool in the pan on a rack. (The cake will fall as it cools.)",
        "Remove the side of the pan from the cake and spread the frosting on the side of the cake. Holding the cake in one hand over the bowl of toasted coconut, with the other hand press the coconut onto the frosting, letting the excess fall back into the bowl.",
        "The cake may be made 1 day in advance and kept covered loosely and chilled.",
        "In a bowl with an electric mixer cream the butter, add the rum, the salt, and the confectioners' sugar, and beat the frosting until it is light and fluffy."
    ],
    "ingredients": [
        "1 cup sweetened flaked coconut",
        "4 ounces semisweet chocolate, broken into pieces",
        "5 tablespoons unsalted butter",
        "3 tablespoons light or golden rum",
        "4 large eggs, separated",
        "1/4 cup sugar",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 tablespoon light or golden rum",
        "1/4 teaspoon salt",
        "2/3 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Picnic",
        "Coconut",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Coconut Rum Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-coconut-rum-cake-10534"
}
