{
    "directions": [
        "Position 1 rack in center and 1 rack in top third of oven and preheat to 325°F. Using handheld electric mixer, beat sugar and butter in very large bowl until well blended. Beat in eggs 1 at a time just until blended. Mix in orange peel, baking soda and salt. Add 3 cups flour, hazelnuts and dried cherries; stir until well blended. Add 3 cups flour, 1 cup at a time, stirring until well incorporated.",
        "Transfer dough to floured work surface. Divide into 4 equal pieces. Knead each piece until dough holds together well. Form each piece into 9-inch-long by 3-inch-wide log. Place 2 logs on each of 2 large ungreased baking sheets, spacing about 3 inches apart (logs will spread during baking). Bake until logs are golden and feel firm when tops are gently pressed, switching and rotating baking sheets halfway through baking, about 55 minutes. Cool logs on baking sheets 15 minutes. Maintain oven temperature.",
        "Using long wide spatula, transfer logs to cutting board. Using serrated knife, cut warm logs crosswise into 1/2-inch-thick slices. Arrange slices cut side down on 2 baking sheets. Bake biscotti 10 minutes. Turn biscotti over; bake until light golden, about 10 minutes longer. Transfer to racks and cool completely.",
        "Stir chocolate in large bowl set over saucepan of boiling water until melted and smooth. Remove from over water. Dip 1 cut side of each biscotti into melted chocolate to about 1/4-inch depth. Gently shake off excess chocolate. Place biscotti, chocolate side up, on baking sheets. Refrigerate until chocolate is firm, about 35 minutes. Dip pastry brush in cocoa, then lightly brush cocoa over chocolate on each biscotti. (Can be made ahead. Store in airtight containers up to 4 days, or wrap in foil and freeze in resealable plastic bags up to 3 weeks.)"
    ],
    "ingredients": [
        "3 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "4 large eggs",
        "4 teaspoons grated orange peel",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "6 cups all purpose flour",
        "2 1/2 cups hazelnuts (about 9 ounces), toasted, husked, coarsely chopped",
        "1 3/4 cups dried tart cherries (about 8 1/2 ounces)",
        "1 1/2 pounds bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "Unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Valentine's Day",
        "Vegetarian",
        "Orange",
        "Cherry",
        "Hazelnut",
        "Party",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Dipped Cherry-Hazelnut Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-dipped-cherry-hazelnut-biscotti-5797"
}
