{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Butter six 3/4-cup soufflé dishes; dust with sugar. Place on baking sheet. Whisk 1/2 cup cream and 1 tablespoon amaretto in medium bowl to soft peaks. Refrigerate whipped cream.",
        "Stir 1/2 cup cream and chocolate in medium bowl set over saucepan of simmering water until melted and smooth. Remove from over water. Whisk in yolks 1 at a time, blending well after each addition. Whisk in 2 tablespoons amaretto and both extracts. Using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually add 3 tablespoons sugar, beating until stiff but not dry. Fold whites into chocolate mixture in 2 additions. Spoon enough batter into each soufflé dish to fill dish halfway. Sprinkle each with 1/2 tablespoon amaretti cookies. Top with remaining soufflé batter. Sprinkle each with 1/2 tablespoon amaretti cookies.",
        "Bake soufflés until puffed and set, about 13 minutes. Dust each with powdered sugar. Accompany soufflés with whipped cream. Serve immediately.",
        "*Available at Italian markets and some supermarkets nationwide."
    ],
    "ingredients": [
        "1 cup chilled whipping cream",
        "3 tablespoons amaretto",
        "6 ounces semisweet chocolate, chopped",
        "3 large egg yolks",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "5 large egg whites",
        "3 tablespoons sugar",
        "6 tablespoons crushed amaretti cookies (Italian macaroons)*",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Almond",
        "Vanilla",
        "Amaretto",
        "Winter",
        "Pastry"
    ],
    "title": "Chocolate-Amaretto Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-amaretto-souffles-104730"
}
