{
    "directions": [
        "Boil dried tart cherries and orange juice in heavy small saucepan until all liquid is absorbed, stirring often, about 8 minutes. Remove pan from heat; cool completely.",
        "Line 9x9x2-inch metal baking pan with foil, extending over sides of pan. Finely grind cookies and almonds in processor; add butter and process until moist crumbs form. Press crumbs onto bottom of foil-lined pan. Place in freezer.",
        "Mix chocolate ice cream, chopped chocolate, and cherry mixture in medium bowl. Spoon over crust; smooth top. Freeze 30 minutes. Top with raspberry sorbet; smooth top. Freeze 30 minutes. Mix pistachio ice cream and orange peel in another medium bowl. Spoon over sorbet; smooth top (ice cream will come all the way up to top of pan). Cover and freeze until firm, at least 4 hours or overnight.",
        "Using foil as aid, lift ice cream cake from pan; peel off foil. Use spatula dipped into hot water to smooth sides of cake. Transfer cake to platter. Garnish top of cake with chocolate curls or amaretti cookies dipped halfway into room-temperature Hot Fudge Sauce. Cut cake into squares. Serve with Hot Fudge Sauce.",
        "Soften the ice cream and sorbet in the microwave on high in two to three 10-second intervals until just soft enough to spread.\n*Light, airy Italian almond macaroons that are available at some supermarkets and Italian markets."
    ],
    "ingredients": [
        "1/2 cup dried tart cherries",
        "1/2 cup orange juice",
        "1 5.5-ounce package amaretti cookies*",
        "1/4 cup almonds, toasted",
        "5 tablespoons unsalted butter, melted",
        "1 1/2 pints chocolate ice cream, softened",
        "1 3-ounce bar imported milk chocolate, chopped",
        "1 1/2 pints raspberry sorbet, softened",
        "1 1/2 pints pistachio ice cream, softened",
        "1 tablespoon grated orange peel",
        "Chocolate curls or additional amaretti cookies",
        "Hot Fudge Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Raspberry",
        "Cherry",
        "Almond",
        "Pistachio",
        "Summer",
        "Birthday",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Chocolate-Cherry, Pistachio, and Raspberry Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cherry-pistachio-and-raspberry-ice-cream-cake-231745"
}
