{
    "directions": [
        "Position 1 rack in center and 1 rack in bottom third of oven and preheat to 350°F. Butter one 5-inch-diameter cake pan with 2-inch-high sides, one 8-inch-diameter cake pan with 2-inch-high sides and one 12-inch-diameter cake pan with 2-inch-high sides. Dust pans with flour; line bottoms with parchment. Combine 1/3 cup orange juice and 2 ounces unsweetened chocolate in heavy small saucepan. Stir mixture over medium-low heat until chocolate melts. Remove from heat. Gradually mix in 1 2/3 cups orange juice.",
        "Sift 3 cups flour, 2/3 cup cocoa, 2 teaspoons baking soda, 1 teaspoon salt and 1/2 teaspoon baking powder into medium bowl. using electric mixer, beat 1 cup (2 sticks) butter and 3 cups sugar in large bowl until blended (mixture will look grainy). Add 4 eggs, 1 at a time, beating to blend after each. Beat in 1 tablespoon orange peel and 1 tablespoon vanilla extract. Add dry ingredients alternately with orange juice mixture in 3 additions each, beating well after each addition. Mix in 1 cup chocolate chips.",
        "Transfer 1 cup plus 2 tablespoons batter to prepared 5-inch pan, 3 cups batter to prepared 8-inch pan and remaining batter (about 6 cups) to 12-inch pan. Place 5-inch and 8-inch pans on center rack of oven. Place 12-inch pan on lower rack of oven. Bake cakes until tester inserted into center comes out clean, about 35 minutes. Transfer cakes in pans to racks and cool completely.",
        "Mark 4-inch diameter circle on one 6-inch-diameter cardboard cake round. Cut out marked circle. Mark 7-inch-diameter circle on one 8-inch-diameter cardboard cake round. Cut out marked circle. Mark 11-inch-diameter circle on one 12-inch-diameter cardboard cake round. Cut out marked circle. Cut around sides of 5-inch-cake to loosen. Place 4-inch cardboard over pan. Hold cardboard and pan together; turn cake out onto cardboard. Peel off parchment.Wrap cakes on its cardboard in foil. Repeat turning out, peeling off parchment and wrapping cakes in foil, using 7-inch cardboard for 8-inch cake and 11-inch cardboard for 12-inch cake.",
        "Using remaining ingredients, make 1 more batch of cake batter and bake 3 more cake layers as described above. Cool cakes in pans. Cover cakes in pans tightly with foil. (Can be prepared ahead. Let stand at room temperature up to 1 day or double-wrap all cake layers and freeze up to 1 week. Bring cake layers to room temperature before using.)",
        "Place first 12-inch cake on its cardboard on work surface. Spread 2 3/4 cups ganache over top of cake and all the way to edge. Spread 2/3 cup jam over ganache, leaving 1/2-inch chocolate border at edge. Drop 1 3/4 cups white chocolate frosting by spoonfuls over jam. Gently spread frosting over jam, leaving 1/2-inch chocolate border at edge. Rub some cocoa powder over second 12-inch cardboard. Cut around sides of second 12-inch cake to loosen. Place cardboard, cocoa side down, over pan. Turn cake out onto cardboard. Peel off parchment. Carefully slide cake off cardboard and onto filling on first 12-inch cake. Refrigerate.",
        "Place first 8-inch cake on its cardboard on work surface. Spread 1 cup ganache over top all the way to edge. Spread 1/4 cup jam over, leaving 1/2-inch chocolate border at edge. Drop 1 cup white chocolate frosting by spoonfuls over jam. Gently spread frosting over jam, leaving 1/2-inch chocolate border at edge. Rub some cocoa over second 8-inch cardboard. Cut around sides of second 8-inch cake to loosen. Place cardboard, cocoa side down, over pan. Turn cake out onto cardboard. Peel off parchment. Slide cake off cardboard and onto filling on first 8-inch cake. Refrigerate.",
        "Place first 5-inch cake on its cardboard on work surface. Spread 1/2 cup ganache over top of cake and all the way to edge. Spread 2 tablespoons jam over, leaving 1/2-inch chocolate border at edge. Drop 1/3 cup white chocolate frosting by spoonfuls over jam. Gently spread frosting over jam, leaving 1/2-inch chocolate border at edge. Rub cocoa over second 6-inch cardboard. Cut around sides of second 5-inch cake to loosen. Place cardboard, cocoa side down, over pan. Turn cake out onto cardboard. Peel off parchment. Slide cake off cardboard and onto filling on first 5-inch cake. Chill all cakes 1 hour to set filling.",
        "Place 12-inch tiered cake on its cardboard on revolving cake stand. Spread 2 2/3 cups frosting over top and sides of cake as a first coat.",
        "Refrigerate cake.",
        "Place 8-inch tiered cake on its cardboard on cake stand. Spread 1 1/4 cups frosting over top and sides of cake as a first coat. Refrigerate cake.",
        "Place 5-inch tiered cake on its cardboard on cake stand. Spread 3/4 cup frosting over top and sides of cake as a first coat. Refrigerate all cakes until first coats of frosting set, about 1 hour. (Cakes can be made to this point up to 1 day ahead; cover and keep refrigerate.)",
        "Prepare second batch of frosting, using remaining frosting ingredients and following directions for first batch. Spoon 2 cups frosting into pastry bag fitted with small star tip.",
        "Place 12-inch cake on its cardboard on large flat platter. Place platter on cake stand. Using icing spatula, spread 2 1/2 cups frosting over top and sides of cake; smooth top. Using filled pastry bag, pipe decorative border around top edge of cake. Refrigerate cake on platter.",
        "Place 8-inch cake on its cardboard on cake stand. Using icing spatula, spread 1 1/2 cups frosting over top and sides of cake; smooth top. Using pastry bag, pipe decorative border around top edge of cake. Refrigerate cake on its cardboard.",
        "Place 5-inch cake on its cardboard on cake stand. Using icing spatula, spread 3/4 cup frosting over top and sides of cake; smooth top. Using pastry bag, pipe decorative border around top edge of cake, spooning more frosting into bag if necessary. Refrigerate cake on its cardboard.",
        "Keep all cakes refrigerated until frosting sets, about 2 hours. (Can be prepared 2 days ahead. Cover loosely; keep refrigerated.)",
        "Place 12-inch cake on platter on work surface. Press 1 wooden dowel straight down into and completely through center of cake. Mark dowel 1/4 inch above top of frosting. Remove dowel and cut with serrated knife at marked point. Cut 4 more dowels to same length. Press 1 cut dowel back into center of cake. Press remaining 4 cut dowels into cake, positioning 3 1/2 inches inward from cake edges and spacing evenly.",
        "Place 8-inch cake on its cardboard on work surface. Press 1 dowel straight down into and completely through center of cake. Mark dowel 1/4 inch above top of frosting. Remove dowel and cut with serrated knife at marked point. Cut 3 more dowels to same length. Press 1 cut dowel back into center of cake. Press remaining 3 cut dowels into cake, positioning 2 1/2 inches inward from edges and spacing evenly. Using large metal spatula as aid, place 8-inch cake on its cardboard atop dowels in 12-inch cake, centering carefully. Gently place 5-inch cake on its cardboard atop dowels in 8-inch cake, centering carefully.",
        "Using citrus stripper, cut long strips of orange peel from oranges. Cut strips into long segments. To make orange peel coils, wrap peel segment around handle of wooden spoon; gently slide peel off handle so that peel keeps coiled shape. Garnish cake with orange peel coils, ivy or mint sprigs, and some berries. (Assembled cake can be made up to 8 hours ahead. Let stand at cool room temperature.)",
        "Remove top and middle cake tiers. Remove dowels from cakes. Cut top and middle cakes into slices. To cut 12-inch cake: Starting 3 inches inward from edge and inserting knife straight down, cut through from top to bottom to make 6-inch-diameter circle in center of cake. Cut outer portion of cake into slices; cut inner portion into slices and serve with strawberries."
    ],
    "ingredients": [
        "4 cups orange juice, room temperature",
        "4 ounces unsweetened chocolate, finely chopped",
        "6 cups sifted cake flour",
        "1 1/3 cups unsweetened cocoa powder",
        "4 teaspoons baking soda",
        "2 teaspoon salt",
        "1 teaspoon baking powder",
        "2 cups (4 sticks) unsalted butter, room temperature",
        "6 cups sugar",
        "8 large eggs, room temperature",
        "2 tablespoons (packed) grated orange peel",
        "2 tablespoons vanilla extract",
        "2 cups miniature semisweet chocolate chips (about 12 ounces)",
        "2 6-inch-diameter cardboard cake rounds",
        "2 8-inch-diameter cardboard cake rounds",
        "2 12-inch-diameter cardboard cake rounds",
        "Chocolate-Strawberry-Ganache",
        "White Chocolate Frosting",
        "1 1/4 cups (about) strawberry jam",
        "Unsweetened cocoa powder",
        "1 11-inch-diameter revolving cake stand (optional)",
        "9 12-inch-long, 1/4-inch-diameter wooden dowels",
        "3 oranges",
        "Decorative ivy or fresh mint sprigs, rinsed, patted dry",
        "5 1-pint baskets strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Citrus",
        "Dessert",
        "Bake",
        "Wedding",
        "Summer"
    ],
    "title": "Chocolate-Strawberry-Orange Wedding Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-strawberry-orange-wedding-cake-2248"
}
