{
    "directions": [
        "Stir cheryy juices and sugar in medium saucepan over medium heat until sugar dissolves. Increase heat; boil 5 minutes. Add cherries; return to boil. Refrigerate until cold. (Can be made 3 days ahead. Cover; keep chilled.)",
        "Place chocolate in medium metal bowl set over saucepan of barely simmering water (do not let bottom of bowl touch water). Whisk constantly until very thick and thermometer registers 160°F, about 5 minutes.",
        "Beat cream in medium bowl to soft peaks. Gently fold chocolate, then cream into egg mixture. Spoon chocolate parfait into 8 pilsner glasses or goblets. Freeze.",
        "Combine eggs yolk and sugar in small metal bowl. Set over saucepan of barely simmering water (do not allow bottom of bowl to touch water.) Whisk constantly until mixture is very thick and thermometer registers 160°F, about 5 minutes. Transfer mixture to large bowl. Beat with electric mixture until cool and very fluffy, about 5 minutes.",
        "Place cream in medium bowl. Scrape seeds from vanilla bean; beat to soft peaks. Fold cream into egg mixture. spoon vanilla parfait atop chocolate parfait. Cover; freeze 4 hours or up to 3 days.",
        "Spoon cherry sauce atop parfaits."
    ],
    "ingredients": [
        "1 1/2 pounds frozen unsweetend cherries, thawed, juices reserved",
        "1/2 cup sugar",
        "7 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 large eggs",
        "3 large egg yolks",
        "1/3 cup sugar",
        "1 1/2 cups chilled whipping cream",
        "2 large eggs",
        "3 large egg yolks",
        "1/3 cup sugar",
        "1 1/2 cup chilled whipped cream",
        "1 vanilla bean, split lenghtwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Cherry",
        "Vanilla"
    ],
    "title": "Chocolate and Vanilla Parfaits with Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-and-vanilla-parfaits-with-cherry-sauce-100164"
}
