{
    "directions": [
        "Whisk almond flour and rice flour in a medium bowl. In the bowl of a stand mixer, on medium speed, beat butter, granulated sugar, powdered sugar, and salt until light and fluffy, about 2 minutes. Reduce speed to low and beat in egg yolk, then dry ingredients.",
        "Roll out dough between 2 sheets of parchment paper to 1/4\" thick. Using parchment, slide dough onto a baking sheet and chill until firm, 30–40 minutes.",
        "Preheat oven to 350°F. Peel away top layer of parchment paper from dough and punch out rounds with cutter; transfer cookies to another parchment-lined large baking sheet, spacing at least 1\" apart. (You should have 36 cookies; if desired, gather scraps and save for another use.)",
        "Bake cookies until edges are golden but centers are still pale, 10–12 minutes. Let cool on baking sheets.",
        "Line another rimmed baking sheet with foil and set a wire rack inside. Transfer cooled cookies to rack.",
        "Pulse strawberries in a food processor until finely ground. Pass through a fine-mesh sieve into a small bowl to remove larger pieces; set strawberry powder aside.",
        "Place 1/4 cup cold water in a small bowl and sprinkle gelatin over top; let sit until gelatin is softened, 10–15 minutes.",
        "Beat egg whites, salt, and 2 tsp. granulated sugar in the bowl of a stand mixer fitted with the whisk attachment on medium-high speed to soft peaks.",
        "Heat corn syrup, remaining 1/2 cup granulated sugar, and 3 Tbsp. water in a small saucepan over medium-low, stirring with a heatproof spatula until sugar is dissolved. Fit saucepan with thermometer and bring syrup to a boil; cook, brushing down sides of saucepan with a wet pastry brush to dissolve any crystals, until thermometer registers 242°F. Working quickly through the next few steps, immediately remove syrup from heat and add gelatin mixture, stirring with spatula just until melted. With mixer on medium speed, gradually stream syrup into egg whites, aiming for the space between the sides of the bowl and the whisk. Increase speed to high and beat until marshmallow is very light, thick, and glossy and the sides of the bowl feel cool to the touch, 10–12 minutes. Beat in reserved strawberry powder.",
        "Transfer marshmallow mixture to a disposable pastry bag and snip a 1\" opening off the end (or use a resealable plastic bag and cut off 1 corner). Position end of piping bag 1/2\" from surface of cookie, holding bag perpendicular; applying even pressure, begin slowly piping (do not move the bag). Pipe until marshmallow has expanded to the diameter of the cookie, then slowly lift the tip upward to create a soft peak. (Imagine a tall Hershey’s Kiss shape about 2\" high.) When all the cookies have been topped with marshmallow, chill uncovered on baking sheet until marshmallow is set, 2–2 1/2 hours. (Loosely cover at this point and chill up to 12 hours if desired.)",
        "Heat chocolate and oil in a heatproof bowl set over a saucepan of barely simmering water (do not let water touch bottom of bowl), stirring until chocolate is melted and incorporated. Let cool slightly.",
        "Drizzle a level tablespoon of chocolate mixture over each marshmallow cookie, coating completely. Sprinkle with pearl and/or sanding sugar if desired.",
        "Once all cookies have been coated, use a small offset spatula to nudge at the base across the rack to remove any drips. Chill until chocolate is set, at least 30 minutes. Decorate with luster dust if desired."
    ],
    "ingredients": [
        "3/4 cup almond flour or meal",
        "2/3 cup rice flour",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 cup granulated sugar",
        "1/3 cup powdered sugar",
        "1/2 teaspoon kosher salt",
        "1 large egg yolk",
        "1 (1.2-ounce) bag freeze-dried strawberries",
        "1 envelope unflavored powdered gelatin (about 2 1/2 teaspoons)",
        "2 large egg whites",
        "1/2 teaspoon kosher salt",
        "2 teaspoon plus 1/2 cup granulated sugar",
        "2 tablespoon light corn syrup",
        "12 ounces semisweet or bittersweet chocolate, chopped",
        "2 tablespoon virgin coconut oil",
        "Pearl sugar and/or red sanding sugar (for serving; optional)",
        "Red luster dust (for serving; optional)",
        "A 1–1 1/4-inch–diameter cookie cutter; candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Marshmallow",
        "Almond",
        "Strawberry",
        "Christmas",
        "Chocolate",
        "Wheat/Gluten-Free",
        "Bake",
        "Dessert"
    ],
    "title": "Chocolate-Covered Marshmallow Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-covered-marshmallow-cookies"
}
