{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease and flour four 8-inch round cake pans.",
        "Mix the flour, baking soda, and salt in a bowl. In a large bowl, cream together the butter and sugar. Beat in eggs one at a time. Alternately beat in flour mixture and buttermilk until smooth.",
        "Place unsweetened chocolate in a small bowl. Pour the boiling water over the chocolate, and stir until melted. Mix chocolate, vanilla, and lemon juice into the buttermilk batter. Divide batter evenly into the prepared cake pans.",
        "Bake 15 minutes in the preheated oven, or until a toothpick inserted in the center comes out clean. Cool 10 minutes in pans, then turn out onto wire racks to cool completely.",
        "Caramel Filling: Mix the butter, confectioners' sugar, vanilla, lemon juice, superfine sugar, and milk in a heavy saucepan. Stirring constantly, bring to a boil, and cook until temperature reaches 225 degrees F (110 degrees C) on a candy thermometer. Remove saucepan from heat, and set in a large bowl filled with ice water. Beat filling with an electric mixer until spreadable. At first this seems to be just hot, hard work, but the filling will suddenly start to thicken as it begins to cool. Transfer filling to a clean bowl, and it will continue to cool as you frost the top of each cake layer. Stack the frosted layers atop each other."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup butter",
        "2 cups white sugar",
        "4 eggs",
        "1 cup buttermilk",
        "4 1/2 (1 ounce) squares unsweetened chocolate",
        "1/2 cup boiling water",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon lemon juice",
        "1 1/8 cups butter",
        "3 cups confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon lemon juice",
        "2 cups superfine sugar",
        "1 cup milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Lizzie Cake with Caramel Filling",
    "url": "http://allrecipes.com/recipe/72953/chocolate-lizzie-cake-with-caramel-fi/"
}
