{
    "directions": [
        "Sift together the flour and cocoa powder into a bowl. Set aside.",
        "In the bowl of an electric mixer fitted with the flat beater, beat together 8 Tbs. (1 stick) of the butter, the confectioners’ sugar, egg yolk and vanilla until just smooth and creamy. Add the flour mixture and beat until a dough forms. Do not overwork. Transfer the dough to a work surface, shape into a rectangle and wrap with plastic wrap. Refrigerate for at least 1 hour or up to overnight.",
        "Remove the dough from the refrigerator. On a lightly floured work surface, roll out the dough into a 13-by-10-inch rectangle. Transfer to an 11-by-8-inch tart pan with a removable bottom. Press the dough into the bottom and up the sides of the pan. Cut off any overhanging dough and prick the dough in several places with a fork. Refrigerate for at least 30 minutes or up to 1 hour.",
        "Preheat an oven to 350°F.",
        "Line the dough with parchment paper and fill with pie weights. Bake until the sides are cooked through and the base is almost cooked through and slightly flaky, 25 to 30 minutes. Remove the pie weights and parchment and continue to cook until the base is dry and set, about 8 minutes. Transfer the pan to a wire rack and let cool.",
        "In a saucepan over medium-high heat, combine the water, granulated sugar and corn syrup. Cook, stirring occasionally, until the sugar turns into a deep amber-colored caramel, about 10 minutes. Remove from the heat and, very carefully and slowly, pour in 1/2 cup plus 2 Tbs. of the cream (the mixture will spatter). Add the remaining 8 Tbs. (1 stick) butter, 1 piece at a time, stirring until smooth. Pour the caramel filling into the cooled tart shell and let cool, then refrigerate until firmly set, at least 30 minutes.",
        "Put the chocolate in a heatproof bowl. In a small saucepan over medium-high heat, bring the remaining 1 1/2 cups cream to a boil and pour it over the chocolate. Let stand for 2 minutes, then whisk until smooth. Pour the chocolate ganache over the caramel and refrigerate until set, at least 30 minutes. Remove the tart from the refrigerator 10 minutes before serving. Garnish with fleur de sel. Serves 8.",
        "Tart pan variations:",
        "This tart can just as easily be made in a 9-inch round tart pan. Or, if you are feeling adventurous, make tartlets by dividing the crust, caramel filling and ganache among six 4 1/2-inch round tartlet pans with removable bottoms.",
        "Adapted from Williams-Sonoma",
        "Cooking for Friends,",
        "by Alison Attenborough and Jamie Kimm (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "16 Tbs. (2 sticks) unsalted butter, cut into pieces",
        "1/2 cup plus 1 Tbs. confectioners’ sugar",
        "1 egg yolk",
        "1 tsp. vanilla extract",
        "1/2 cup water",
        "2 cups granulated sugar",
        "1/4 cup light corn syrup",
        "2 cups plus 2 Tbs. heavy cream",
        "10 oz. semisweet chocolate, chopped",
        "Fleur de sel for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Chocolate Caramel Tart",
    "url": "http://www.williams-sonoma.com/recipe/chocolate-caramel-tart.html"
}
