{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 350°F. Line 2 baking sheets with parchment paper. Sift first 5 ingredients into large bowl. Whisk eggs and vanilla in medium bowl to blend. Using electric mixer, beat eggs and melted butter into dry ingredients. Stir in cranberries and almonds.",
        "Turn dough out onto floured surface. Using floured hands, divide dough into 3 equal pieces. Shape each into 8x2x3/4-inch log. Place 2 logs on 1 baking sheet, spacing evenly, and 1 log on second sheet.",
        "Bake logs 12 minutes. Reverse position of baking sheets. Bake logs until firm and dry to touch, about 12 minutes longer. Remove from oven. Reduce oven temperature to 325°F.",
        "Transfer logs to work surface. Using serrated knife, cut hot logs diagonally into 1/2-inch-thick slices. Place slices, cut side down, on same baking sheets. Bake biscotti until dry and slightly darker, about 10 minutes. Transfer to racks; cool.",
        "If desired, stir white chocolate in bowl set over saucepan of barely simmering water until smooth. Remove from over water. Dip biscotti 1 at a time into chocolate, holding cookie at angle and coating 1 inch of each. Return to same baking sheets. Chill until chocolate is set, about 20 minutes. (Can be made 3 days ahead. Arrange between sheets of waxed paper in airtight containers; store at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3/4 cup sugar",
        "1/2 cup unsweetened cocoa powder",
        "2 teaspoons baking soda",
        "1/8 teaspoon salt",
        "3 large eggs",
        "2 teaspoons vanilla extract",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 cup dried cranberries",
        "1 cup sliced almonds",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Cranberry",
        "Almond",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate, Almond, and Dried Cranberry Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-almond-and-dried-cranberry-biscotti-104737"
}
