{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Wrap the outside of a 10-inch springform pan with aluminum foil.",
        "Mix the chocolate graham cracker crumbs, 3 tablespoons sugar, and the butter in a bowl until thoroughly combined; press into the bottom of the springform pan.",
        "Bake the crust in the preheated oven for 10 minutes. Remove the pan from the oven. Turn the oven's heat up to 350 degrees F (175 degrees C).",
        "In a mixing bowl, beat the cream cheese for a few seconds with an electric mixer set on medium speed until fluffy and smooth. Beat in 3/4 cup sugar and the flour until the mixture is smooth; beat in the eggs, one at a time, followed by the milk and vanilla extract. Beat the cream cheese filling until very smooth and well combined, about 3 minutes.",
        "Spoon 2/3 of the cream cheese filling into the springform pan in an even layer over the crust. Melt 3 ounces of chocolate chips over low heat in a saucepan, stirring constantly until smooth, and mix in the remaining third of the filling. Pour the chocolate filling in a swirl pattern over the white filling; use a table knife to cut through the filling and swirl it into a decorative marble design.",
        "Place the springform pan into a roasting pan and add enough water to the roasting pan to reach 1 inch deep. Place the springform pan with the roasting pan water bath into the oven and bake until the filling is set, 40 to 45 minutes.",
        "When finished baking, remove the springform pan from the water bath and set the pan onto a cooling rack for 10 minutes; remove foil from around the pan. Loosen the edge of the cheesecake from the pan with a thin, sharp knife. Release the spring from the pan, remove the ring, and allow the cheesecake to cool for 15 more minutes. Wrap the cheesecake in plastic wrap and refrigerate until cold, at least 2 hours.",
        "To make frosting, melt 8 ounces of chocolate chips in a saucepan over low heat, stirring until smooth, and mix in the sour cream until smooth and well combined. Frost the cheesecake with the frosting and refrigerate 10 minutes to set the frosting before serving. Refrigerate leftovers."
    ],
    "ingredients": [
        "1 cup chocolate graham cracker crumbs",
        "3 tablespoons white sugar",
        "1/4 cup butter, melted",
        "3 (8 ounce) packages cream cheese, softened",
        "3/4 cup white sugar",
        "2 tablespoons all-purpose flour",
        "3 eggs at room temperature",
        "2 tablespoons milk",
        "2 teaspoons pure vanilla extract",
        "3 ounces semi-sweet chocolate chips",
        "8 ounces semi-sweet chocolate chips",
        "2/3 cup sour cream at room temperature"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Frosted Marble Cheesecake",
    "url": "http://allrecipes.com/recipe/218892/chocolate-frosted-marble-cheesecake/"
}
