{
    "directions": [
        "Cut off a 1/2-inch slice from top and bottom of each orange to expose fruit, then score orange peel from top to bottom at 1/3-inch intervals, cutting through pith, with a sharp knife. Pull off each strip of peel, including pith, with your fingers and put in a 2- to 3-quart heavy saucepan. (Reserve fruit for another use.) Fill pan with water, then add 1/4 teaspoon salt and bring to a boil. Boil, uncovered, 10 minutes, then drain peels in a sieve. Repeat procedure with more cold water and remaining 1/4 teaspoon salt, then set peels aside. (If peels are not very tender, repeat procedure a third time.)",
        "Put a sheet of parchment paper or wax paper on a baking sheet and set baking sheet on a rack.",
        "Bring granulated sugar and water (1/4 cup) to a boil in cleaned saucepan over moderately high heat, stirring and brushing any crystals from side of pan with pastry brush dipped in cold water until sugar is dissolved.",
        "Add peels to syrup in pan and cook, stirring frequently, until most of syrup is absorbed by peels, 4 to 5 minutes. Transfer peels to lined baking sheet, separating strips. Let dry until only slightly sticky, at least 1 hour. make macaroons: Put oven rack in middle position and preheat oven to 325°F. Butter a large baking sheet and put almonds in a shallow bowl.",
        "Blend together almond paste, egg white, and salt in a food processor until smooth, then transfer dough to a small bowl or a sheet of wax paper. Transfer slightly rounded teaspoonfuls of dough, a few at a time, to almonds and turn to coat completely, then transfer to baking sheet as coated, arranging balls about 1 inch apart.",
        "Bake until tops are pale golden and undersides are golden, 20 to 25 minutes. Transfer to a rack to cool.",
        "Finely chop chocolate (preferably in a food processor) and transfer to a small bowl.",
        "Bring cream, butter, and Cognac to a simmer in a 1/2- to 1-quart saucepan over moderate heat. Remove from heat and add chocolate, stirring until melted and smooth. Transfer to fondue pot and set over candle flame or to small warmed bowl (chocolate will stay warm enough for dipping for about 20 minutes without candle).",
        "Arrange raspberries, orange peel, and macaroons on a plate (use wooden picks for raspberries) and serve with fondue."
    ],
    "ingredients": [
        "2 navel oranges",
        "1/2 to 3/4 teaspoon salt",
        "1/2 cup granulated sugar",
        "1/4 cup water",
        "Butter for greasing baking sheet",
        "1/2 cup sliced blanched almonds (1 1/4 oz)",
        "1/2 cup pure almond paste (5 oz; not marzipan)",
        "1 large egg white",
        "1/8 teaspoon salt",
        "3 oz fine-quality bittersweet chocolate (no more than 64% cacao if marked)",
        "1/4 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1 tablespoon Cognac or other brandy",
        "Special equipment: a pastry brush; a small fondue pot with tea candle or a small warmed bowl (fill with hot water to warm, then dry); wooden picks or skewers",
        "Accompaniment: 1/2 pint raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Valentine's Day",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Fondue with Candied Orange Peel, Raspberries, and Almond Macaroons",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-fondue-with-candied-orange-peel-raspberries-and-almond-macaroons-237187"
}
