{
    "directions": [
        "Mix Milk Crumbs and Ovaltine in small bowl. Place white chocolate in small microwave-safe bowl. Heat in microwave in 15-second intervals just until melted, stirring occasionally. Drizzle chocolate over Milk Crumb mixture; toss to coat.",
        "Place first 4 ingredients in medium bowl; set aside. Combine cream, corn syrup, and sugar in heavy medium saucepan. Bring to boil, stirring until sugar dissolves. Pour cream mixture over chocolate mixture in bowl. Let stand 1 minute, then stir until smooth. Whisk until sauce is glossy, about 1 minute. DO AHEAD: Can be made 1 week ahead. Cool completely. Cover and chill. Rewarm just until pourable before using.",
        "Preheat oven to 350°F. Coat three 8-inch cake pans with nonstick spray. Line bottom of each pan with parchment round; coat parchment with nonstick spray. Place chocolate in small microwave-safe bowl. Melt in microwave in 15-second intervals just until melted, stirring occasionally. Set aside. Sift flour, cocoa powder, baking powder, and coarse salt into medium bowl. Combine butter, sugar, and corn syrup in large bowl of stand mixer fitted with paddle attachment; beat on medium-high speed until fluffy and pale, about 2 minutes. Scrape down sides of bowl. Add eggs; beat on low speed to incorporate, then increase speed to medium-high and beat until mixture is fluffy, about 2 minutes. Scrape down sides of bowl. Add melted chocolate. Beat until blended, about 1 minute. Add buttermilk, oil, and vanilla; beat on medium-high speed until pale brown, about 2 minutes. Add dry ingredients; beat on low speed just until blended, about 45 seconds. Divide batter among pans; smooth tops.",
        "Bake cakes until tester inserted into center comes out clean, about 20 minutes. Cool completely in pans on racks.",
        "Stir milk and Ovaltine in small bowl. Invert 1 cake from pan onto flat plate or tart pan bottom; peel off parchment. Place cake, top side down, in 8-inch springform pan. Brush cake with generous 2 1/2 tablespoons Ovaltine-milk mixture. Let Ovaltine-milk mixture soak into cake. Drizzle 1/3 cup malt-fudge sauce over cake; spread evenly over top. Sprinkle 1/2 cup chocolate-malt crumbs over sauce. Drizzle 1/3 cup malt-fudge sauce over crumbs. Scatter 1 cup mini marshmallows over. Using kitchen torch, toast marshmallows. Repeat with second cake layer, Ovaltine-milk mixture, malt-fudge sauce, chocolate-malt crumbs, malt-fudge sauce, and marshmallows. Remove third cake from pan; peel off parchment. Place cake, top side down, atop marshmallows on second cake layer. Brush with remaining Ovaltine-milk mixture (assembled cake will rise well above edge of pan). Cover cake with plastic wrap; chill overnight. Cover and chill fudge sauce.",
        "Run thin knife around sides of pan to release cake. Remove pan sides. Place cake (still on springform pan bottom) on plate. Rewarm sauce just until pourable. Pour over top of cake, allowing sauce to drip over edges. Mound handful of marshmallows in center of cake. Using kitchen torch, toast marshmallows. Sprinkle remaining malt crumbs over cake. Let cake stand at room temperature 3 hours before serving.",
        "Cut cake into wedges and serve."
    ],
    "ingredients": [
        "2/3 cup Milk Crumbs",
        "6 tablespoons Ovaltine Chocolate Malt Mix",
        "1 1/2 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
        "1 1/3 cups Ovaltine Chocolate Malt Mix",
        "4 ounces bittersweet chocolate (70% to 72% cacao), chopped",
        "1 teaspoon mild-flavored (light) molasses",
        "Pinch of coarse kosher salt",
        "1/2 cup heavy whipping cream",
        "1/2 cup light corn syrup",
        "1/4 cup sugar",
        "Nonstick vegetable oil spray",
        "2 ounces bittersweet chocolate (70% to 72% cacao), chopped",
        "1 3/4 cups all purpose flour",
        "3/4 cup unsweetened cocoa powder",
        "2 teaspoons baking powder",
        "1 teaspoon coarse kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2 1/4 cups sugar",
        "3 tablespoons light corn syrup",
        "3 large eggs",
        "3/4 cup buttermilk",
        "1/3 cup vegetable oil",
        "1 teaspoon vanilla extract",
        "1/2 cup whole milk",
        "3 tablespoons Ovaltine Classic Malt Mix",
        "2 cups mini marshmallows",
        "Stand mixer with paddle attachment",
        "3 8-inch cake pans with 1 1/2-inch sides",
        "8-inch springform pan",
        "Kitchen torch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "High Fiber",
        "Birthday",
        "Marshmallow"
    ],
    "title": "Chocolate-Malt Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-malt-cake-360731"
}
