{
    "directions": [
        "Preheat oven to 350°F. and butter and flour a 9-inch square baking pan, knocking out excess flour.",
        "In a double boiler or metal bowl set over a saucepan of barely simmering water melt chocolate, stirring, until smooth and remove top of double boiler or bowl from heat. Cool chocolate to room temperature.",
        "In a large bowl with an electric mixer beat butter and sugar until light and fluffy and beat in eggs, 1 at a time, beating well after each addition, and vanilla. Into a small bowl sift together flour, baking powder, and salt and beat into butter mixture just until blended well.",
        "Divide batter between 2 bowls. Whisk peanut butter into batter in 1 bowl. Whisk melted chocolate into batter in other bowl and stir in chopped chocolate or chocolate chips.",
        "Spread peanut-butter batter evenly in pan. Drop chocolate batter by large spoonfuls onto peanut-butter batter and spread carefully to form an even layer. Bake brownies in middle of oven 35 to 40 minutes, or until a tester comes out with crumbs adhering to it. Cool brownies completely in pan on a rack before cutting into 16 squares. Brownies keep, layered between sheets of wax paper in an airtight container at cool room temperature,5 days."
    ],
    "ingredients": [
        "2 ounces unsweetened chocolate, chopped",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 1/4 cups sugar",
        "3 large eggs",
        "1 teaspoon vanilla",
        "2/3 cup all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup chunky peanut butter",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped fine, or 1/2 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Peanut",
        "Poker/Game Night",
        "Party",
        "Gourmet"
    ],
    "title": "Chocolate Peanut-Butter Layer Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-peanut-butter-layer-brownies-13635"
}
