{
    "directions": [
        "Preheat oven to 350°F. Butter 9-inch square metal baking pan. Line bottom with parchment paper. Butter parchment. Whisk first 6 ingredients in medium bowl to blend.",
        "Mix warm water and baking soda in small bowl until baking soda dissolves. Using electric mixer, beat sugar, butter, molasses, eggs, and fresh ginger in large bowl until well blended. Add dry ingredients in 3 additions, alternating with water mixture in 2 additions, beating until just combined. Pour batter into prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 30 minutes. Cool on rack 20 minutes. Run knife around edge of cake to loosen. Invert cake onto rack; cool. Peel off parchment.",
        "Bring first 3 ingredients to simmer in medium saucepan. Remove from heat. Add chocolate and vanilla; stir until smooth. Let stand until cool but still pourable, about 20 minutes.",
        "Place cake on rack set atop baking sheet. Reserve 1/2 cup glaze. Pour remaining glaze over cake, spreading with spatula to coat top and sides. Chill cake and reserved glaze until reserved glaze is just firm enough to pipe, about 1 hour.",
        "Transfer reserved glaze to pastry bag fitted with 1/4-inch plain tip. Pipe 5 diagonal lines atop cake, spacing evenly. Cluster crystallized ginger atop lines. (Can be made 1 day ahead. Cover and refrigerate. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "1 3/4 cups all purpose flour",
        "2 teaspoons ground ginger",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "1 cup warm water",
        "1/2 teaspoon baking soda",
        "3/4 cup (packed) golden brown sugar",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1/3 cup mild-flavored (light) molasses",
        "2 large eggs",
        "1 tablespoon grated peeled fresh ginger",
        "1/2 cup whipping cream",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "2 tablespoons light corn syrup",
        "8 ounces semisweet chocolate, chopped",
        "1 teaspoon vanilla extract",
        "1/4 cup chopped crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Winter",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Covered Gingerbread Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-covered-gingerbread-cake-107512"
}
