{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9x13-inch pan with butter and flour.",
        "Beat cake mix, chocolate milk, canola oil, eggs, and espresso powder together in a large bowl with an electric hand mixer on a low speed until dry ingredients are moistened. Increase speed to medium and continue beating another 2 minutes; pour into prepared pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Remove cake from the oven and allow it to cool in the pan until it is no longer hot to the touch. While the cake is still warm, poke lots of holes all over the cake with a small skewer or a fork.",
        "Whisk sweetened condensed milk, half-and-half, evaporated milk, and 3 tablespoons cocoa powder together in a bowl until cocoa is mostly incorporated into the liquid; slowly pour the milk mixture evenly over the cake. Allow the cake to cool completely as the liquid soaks into it.",
        "Sift confectioners' sugar and cocoa powder together in a bowl.",
        "Beat heavy whipping cream in a stand mixer on medium speed for about 1 minute. While continuing to mix, add sugar-and-cocoa mixture to the cream in 2 batches, allowing the first to incorporate before adding the second. Increase mixer speed to medium-high; beat until soft peaks form and the cream is thickened and spreadable. Spread chocolate whipped cream on the cake to serve."
    ],
    "ingredients": [
        "1 (18.25 ounce) package Swiss chocolate cake mix (such as Duncan Hines®)",
        "1 1/4 cups chocolate milk",
        "1/2 cup canola oil",
        "3 eggs",
        "1 teaspoon instant espresso powder",
        "1 (14 ounce) can sweetened condensed milk",
        "3/4 cup half-and-half",
        "3/4 cup evaporated milk",
        "3 tablespoons unsweetened cocoa powder",
        "1 cup confectioners' sugar",
        "1/2 cup unsweetened cocoa powder",
        "3 cups heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Tres Leches Cake",
    "url": "http://allrecipes.com/recipe/229054/chocolate-tres-leches-cake/"
}
