{
    "directions": [
        "Position a rack in the center of the oven and preheat to 425 degrees F. Line a large rimmed baking sheet with parchment paper.",
        "Blend the chestnuts, sugar and salt in a food processor until the chestnuts are finely ground. Add the rum, cocoa, cinnamon, cloves and ginger. Blend until the filling is almost smooth, scraping down the work bowl as necessary. Add the chocolate chips and pulse until combined. (Can be made 2 days in advance).",
        "Working with 1 pie crust at a time, unroll the pie crusts on a work surface and, using a 3-inch round cutter, cut out 10 rounds from each crust. Brush the pastry rounds with the beaten egg to cover. Drop 1 generous teaspoon of the filling into the center of each round. Fold half of the dough over the filling and seal to make a half-circle shape. Brush the top of the tortelli with the beaten egg. Place on the prepared baking sheet and bake until golden brown and crisp, 15 to 17 minutes.",
        "Transfer to a rack and cool to room temperature. Dust with powdered sugar and serve."
    ],
    "ingredients": [
        "1 cup steamed or roasted chestnuts from a jar (about 6 ounces; not water chestnuts)",
        "1/3 cup sugar",
        "Pinch kosher salt",
        "2 tablespoons amber rum",
        "2 teaspoons unsweetened cocoa powder",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/8 teaspoon ground ginger",
        "1/4 cup (about 1 1/2 ounces) mini semisweet chocolate chips",
        "3 to 4 purchased refrigerated pie crusts (from two 14.1-ounce packages), at room temperature",
        "1 large egg, beaten to blend",
        "Powdered sugar, for dusting"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Christmas Cookie",
        "Christmas",
        "Holiday",
        "Baking",
        "Dessert",
        "Nut Recipes"
    ],
    "title": "Chocolate-Chestnut Tortelli (Christmas Cookies)",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/chocolate-chestnut-tortelli-christmas-cookies-recipe"
}
