{
    "directions": [
        "Preheat oven to 250 degrees F (125 degrees C). Line three baking sheets with parchment paper. With a pencil, draw 5 circles 9 inches in diameter on the parchment paper. It is best to trace around a cake pan or large saucepan.",
        "In a large clean bowl, whip the egg whites until soft peaks form. Gradually add the 3/4 cup plus 2 tablespoons of white sugar and beat until stiff peaks form. Sift together the 3/4 cup confectioners' sugar, cinnamon and corn starch, toss them together with the ground hazelnuts, then carefully fold them into the egg white mixture. Divide the mixture evenly between the 5 circles, and spread the meringue out to the edge of the drawn circle.",
        "Bake for 3 to 4 hours in the preheated oven, until the meringue is completely dried out. Cool on wire racks.",
        "Melt the semi-sweet chocolate over a double boiler until smooth. Spread over parchment paper or waxed paper into a 12x10 inch rectangle. When chocolate is set, cut the rectangle crosswise into 10-1 inch strips. Cut 8 of the strips into thirds. Cut the remaining strips into fourths. Set aside.",
        "To make the filling, whip the heavy whipping cream with the 1 tablespoon of confectioners' sugar until stiff. Spread whipped cream over all of the meringue layers. Using one of your prettiest plates, stack the layers on top of one another. Use 2/3 of the remaining whipped cream to spread around the outside edge of the cake.  Put the rest of the whipped cream into a pastry bag and pipe rosettes around the edge. Place the 24 long chocolate strips vertically around the sides of the cake. Arrange the remaining pieces of chocolate on the top in the design of your choice. Dust the cake with cocoa powder for a dramatic finish, and serve as soon as possible, as the meringue will soak up moisture from the whipped cream."
    ],
    "ingredients": [
        "6 egg whites",
        "7/8 cup white sugar",
        "3/4 cup sifted confectioners' sugar",
        "1/2 teaspoon ground cinnamon",
        "1 tablespoon cornstarch",
        "3/4 cup ground hazelnuts",
        "4 (1 ounce) squares semisweet chocolate, chopped",
        "1 1/4 cups heavy whipping cream",
        "1 tablespoon sifted confectioners' sugar",
        "1 teaspoon unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chocolate Cinnamon Hazelnut Meringue Cake",
    "url": "http://allrecipes.com/recipe/15876/chocolate-cinnamon-hazelnut-meringue/"
}
