{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Bring large pot of water to a boil and add the baking soda. Drop in the hazelnuts, bring back to a boil, and blanch 10 seconds. Drain hazelnuts in a colander, then spread out on a baking sheet in a single layer. Place in oven and roast 8 to 10 minutes until light brown. Remove from oven, place a kitchen towel over the pan, and allow to cool completely.",
        "Rub cooled hazelnuts between your palms; the skins should slip right off. Set aside 50 whole hazelnuts. Grind the rest very fine in a food processor fitted with the metal blade and set aside.",
        "Place sugar and heavy cream in a medium pot and bring to a boil. Add the chopped chocolate, let sit for 2 minutes, then whisk until smooth. Whisk in the butter. Pour the ganache into the bowl of an electric mixer and allow to cool until set. Fit the machine with a paddle and beat the set ganache on medium speed until aerated and fluffy, about 2 minutes. Beat in the reserved ground hazelnuts and the liqueur if using. Beat well to thoroughly combine.",
        "Load mixture into a pastry bag fitted with a 1/2-inch plain tip. Line a baking sheet with parchment or waxed paper. Pipe out 1/2-inch balls. On top of each ball, press in one of the reserved whole toasted hazelnuts until it is halfway buried. Place pan in refrigerator to chill completely.",
        "To coat, place tempered chocolate in a medium bowl. Line 2 baking sheets with parchment or waxed paper. Get yourself 2 forks. Place one nut-topped ball on the prongs of one fork, nut up. Lower the fork into the melted chocolate, covering completely. Lift fork up, pause 3 seconds to allow excess chocolate to drip off, then run bottom of fork along top of bowl to remove excess chocolate. Place fork on paperlined pan and use second fork to push off the candy while you withdraw the first fork (it's easier than it sounds). Keep the nut up at all times. Repeat with remaining centers. If it's warm out, place the finished candies in the refrigerator to set; otherwise they will set at cool room temperature (65 degrees).",
        "Both of these candies make great Christmas presents packed into little boxes or baskets. They are involved but can be done easily in large batches. One day of work can yield many gifts. You can make a double of triple batch of truffle ganache and divide it, beating different flavorings into different parts."
    ],
    "ingredients": [
        "6 ounces whole hazelnuts",
        "2 teaspoons baking soda",
        "1/4 cup sugar",
        "1 cup heavy cream",
        "1 pound bittersweet chocolate, chopped finely",
        "2 tablespoon unsalted butter",
        "2 tablespoons Amaretto or other nut liqueur, or dark rum (optional)",
        "1 pound tempered chocolate for dipping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Christmas Candy",
        "Candy Recipes and Ideas",
        "Christmas",
        "Holiday",
        "Christmas Cookie",
        "Baking",
        "Dessert",
        "Healthy",
        "Make Ahead",
        "Food Processor",
        "Mixer Recipes",
        "Nut Recipes",
        "Dairy Recipes",
        "Low Calorie",
        "Diabetes-Friendly",
        "Heart-Healthy",
        "Low-Fat",
        "Low Sodium",
        "Low-Cholesterol",
        "Roasting"
    ],
    "title": "Chocolate Hazelnut Smooches",
    "url": "http://www.foodnetwork.com/recipes/chocolate-hazelnut-smooches-recipe"
}
