{
    "directions": [
        "Line 9 x 5 x 2 1/2-inch metal loaf pan with plastic wrap, leaving 3-inch overhang on all sides. Using small flexible spatula, quickly spread softened cherry vanilla ice cream evenly over bottom and up sides of prepared pan. Freeze until firm, about 30 minutes. Sprinkle 1/4 cup chopped almonds, then maraschino cherries over ice cream in bottom of pan. Spread softened chocolate-chocolate chip ice cream over, filling pan completely. Freeze until ice cream is firm, about 1 hour.",
        "Bring 1 1/2 cups cream and corn syrup to simmer in medium saucepan. Remove from heat. Add both chocolates and whisk until smooth. Whisk in both extracts. Cool ganache to room temperature, whisking occasionally, about 45 minutes.",
        "Spread 2/3 cup chocolate ganache over top of ice cream. Freeze until chocolate is very firm, about 2 hours.",
        "Rewarm chocolate ganache over low heat just until fluid if necessary. Cool to room temperature (mixture will thicken slightly). Line baking sheet with waxed paper. Run small knife around sides of loaf pan to loosen ice cream loaf. Invert loaf onto prepared sheet; peel off plastic wrap. Working quickly and using small flexible spatula, spread 1 cup chocolate ganache over top and sides of ice cream loaf, covering ice cream completely and forming 1/4-inch-thick coating (reserve remaining ganache). Sprinkle remaining 3/4 cup chopped almonds over top and sides of chocolate-covered ice cream loaf. Freeze until chocolate is firm, about 1 hour. (Can be made 1 week ahead. Cover tartufo with plastic wrap and keep frozen. Refrigerate remaining ganache.)",
        "Add remaining 1/4 cup cream to ganache and rewarm over low heat to use as sauce. Cut tartufo into 1/2-inch-thick slices. Cut each slice diagonally in half, forming 2 triangles. Place 2 triangles on each plate. Drizzle with warm ganache"
    ],
    "ingredients": [
        "2 pints cherry vanilla ice cream, softened slightly",
        "1 cup almonds, toasted, chopped",
        "3 tablespoons chopped drained maraschino cherries",
        "1 1/2 pints chocolate-chocolate chip ice cream, softened slightly",
        "1 3/4 cups whipping cream",
        "1/4 cup light corn syrup",
        "24 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "6 ounces semisweet chocolate, chopped",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Cherry",
        "Almond",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Cherry Ice Cream Tartufo",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cherry-ice-cream-tartufo-100504"
}
