{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Stir together all crust ingredients. Press over bottom and up side of a 9-inch pie plate. Bake until set, 12 to 15 minutes, then cool.",
        "Melt chocolate in a large bowl.",
        "Stir together cornstarch and 2 tablespoons brown sugar in a small bowl.",
        "Whisk together whole eggs and yolks in another bowl, then whisk in cornstarch mixture.",
        "Stir together milk, cream, salt, and remaining brown sugar in a heavy medium saucepan and bring just to a boil over medium heat. Pour half of milk mixture into egg mixture in a slow stream, whisking, then pour egg mixture into remaining milk mixture. Bring to a boil over medium-low heat, whisking constantly, then boil, whisking, 1 minute. Remove from heat and whisk in butter and vanilla. Strain through a fine-mesh sieve into melted chocolate and whisk to combine.",
        "Transfer hot filling to crust and chill, its surface covered with parchment, until filling is cold, about 3 hours.",
        "Beat cream with confectioners sugar and cinnamon using an electric mixer until it holds stiff peaks. Spoon over chilled filling.",
        "Hold chocolate in your hands (or microwave on low power in 10-second intervals) until surface softens slightly. Using a vegetable peeler (preferably Y-shaped), \"peel\" large chocolate curls onto a paper towel. If curls are too brittle or don't form easily, rewarm chocolate just until surface softens.",
        "Sprinkle curls on pie."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter, melted",
        "1 1/2 cups cinnamon graham cracker crumbs (from about twelve 5-by 21/2-inch crackers)",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "6 ounces fine-quality bittersweet chocolate (no more than 60% cacao if marked)",
        "2 tablespoons cornstarch",
        "1/3 cup packed light brown sugar, divided",
        "2 whole large eggs",
        "2 large egg yolks",
        "2 cups whole milk",
        "1/2 cup heavy cream",
        "1/8 teaspoon salt",
        "1/2 stick unsalted butter, cut into tablespoons",
        "1 teaspoon pure vanilla extract",
        "1 1/2 cups chilled heavy cream",
        "5 tablespoons confectioners sugar",
        "1/2 teaspoon cinnamon",
        "1 (3-to 4-inch-thick) chunk bittersweet chocolate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Chill",
        "Cinnamon",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Cinnamon Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-cinnamon-cream-pie-350613"
}
