{
    "directions": [
        "Preheat oven to 350°F. Coat 9-inch glass pie dish with margarine. Whisk first 3 ingredients in small bowl. Combine 1 pound chocolate and 6 tablespoons margarine in large microwave-safe bowl.",
        "Microwave in 20-to 30-second intervals until smooth, stirring often. Set aside to cool.",
        "Beat eggs in large bowl 1 minute. Add sugar and vanilla. Beat until thick and pale yellow, 3 to 4 minutes. Beat in orange peel, then chocolate mixture. Reduce speed to low; beat in dry ingredients. Transfer batter to pie dish; place on rimmed baking sheet.",
        "Place baking sheet with pie in oven. Bake pie until cracked on top and tester inserted into center comes out with moist crumbs attached, 45 to 50 minutes. Cool to room temperature (center will fall).",
        "Combine 1 ounce chopped chocolate and 1 tablespoon margarine in microwave-safe bowl. Microwave in 15-second intervals until glaze is smooth, stirring often.",
        "Drizzle glaze over pie. Sprinkle with almonds. DO AHEAD: Can be made 1 day ahead. Chill until cold. Tent with foil; chill.",
        "Toss berries, sugar, and orange peel in medium bowl to blend. Chill until ready to serve, up to 4 hours.",
        "Cut pie into wedges; place on plates. Serve with strawberries and sabayon."
    ],
    "ingredients": [
        "1/4 cup almond meal or very finely ground almonds",
        "1/4 cup matzo cake meal",
        "1/4 teaspoon salt",
        "1 pound plus 1 ounce bittersweet chocolate (do not exceed 61% cacao), chopped",
        "6 tablespoons (3/4 stick) plus 1 tablespoon unsalted pareve margarine",
        "3 large eggs",
        "3/4 cup sugar",
        "1 tablespoon vanilla extract",
        "1 tablespoon finely grated orange peel",
        "Sliced almonds, lightly toasted",
        "1 1/4 pounds strawberries, hulled, sliced",
        "2 tablespoons sugar",
        "1 teaspoon finely grated orange peel",
        "Orange-champagne sabayon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Champagne",
        "Microwave",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Passover",
        "High Fiber",
        "Strawberry",
        "Orange",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Chocolate Truffle Pie with Orange-Champagne Sabayon and Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-truffle-pie-with-orange-champagne-sabayon-and-strawberries-364650"
}
