{
    "directions": [
        "In large nonreactive mixing bowl, whisk together egg yolks and sugar.",
        "Open can of Guinness and slowly pour into 4-cup measuring cup, pouring down side of cup to reduce foaming. Pour half of Guinness (about 7/8 cup) into heavy-bottomed 3-quart saucepan. Add 2 1/4 cups cream and whisk to combine. Set over medium heat and heat, whisking occasionally, until bubbles just begin to form at edges. Remove from heat, add chocolate, and whisk until smooth.",
        "Slowly pour hot chocolate mixture into eggs, whisking constantly to prevent curdling. Return mixture to saucepan and set over moderately low heat. Cook, whisking constantly, until mixture thickens and coats back of spoon, about 15 minutes. (Pudding will look separated.) Pour into blender and blend on high for 1 minute. Divide pudding among glasses, leaving at least 1 inch of space at top of each. Cover with plastic wrap and refrigerate until chilled and set.",
        "Meanwhile, pour remaining Guinness into small saucepan and bring to boil over medium heat. Reduce heat to moderately low and simmer, uncovered, until reduced to 1 tablespoon, about 20 minutes. Pour syrup into small bowl and let cool.",
        "Beat remaining cream until soft peaks form. Add Guinness syrup and beat until combined. Divide cream among 6 glasses of pudding and serve."
    ],
    "ingredients": [
        "8 large egg yolks",
        "1 cup sugar",
        "One 14.9-ounce can Guinness Draught",
        "3 cups heavy cream",
        "7 ounces high-quality bittersweet (70 to 72% cacao) chocolate, finely chopped",
        "Special equipment: Six 8-ounce old-fashioned glasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "St. Patrick's Day",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate Guinness Goodness",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-guinness-goodness-234304"
}
