{
    "directions": [
        "For the best chocolate sheet cake: Preheat the oven to 350 degrees F. Use an 18-by-13-inch sheet cake pan. Cut parchment paper to fit the pan and spray each side with baking spray.",
        "In a mixing bowl, combine the flour, granulated sugar and salt. In a saucepan, melt the butter. Add the cocoa to the butter and stir together. Add 1 cup boiling water to the pan and then allow the mixture to boil for 30 seconds. Pour over the flour mixture, and stir lightly to cool.",
        "Pour the buttermilk into a bowl and add the baking soda, vanilla and beaten eggs. Stir the buttermilk mixture into the butter/flour mixture. Pour into the prepared cake pan and bake for 20 minutes. Let the cake cool completely.",
        "Cut the cooled cake into circles with a 2 1/2-inch biscuit cutter, and then lay the circles on another sheet pan with a wire rack; set this pan in the fridge to make sure there is no warmth to the cake at all. (The frosting is so light and fluffy, the coolness will help keep it all together.)",
        "For the white frosting: In a small saucepan, whisk the flour into the milk and heat, stirring constantly, until it thickens. You want it to be very thick--thicker than cake mix, more like a brownie mix. Remove from the heat and let cool to room temperature. If in a hurry, place the saucepan over ice in the sink for about 10 minutes or so until the mixture cools. It must be completely cool before you use it in the next step. Stir in the vanilla.",
        "While the mixture is cooling, cream the butter and granulated sugar together until light and fluffy. You don't want any sugar graininess left. Then add the completely cooled milk/flour mixture and beat the living daylights out of it. If it looks separated, you haven't beaten it enough! Beat it until it all combines and resembles whipped cream. Grab a spoon and taste this wonderful goodness. If there is any left after your taste test, spread it on a cooled chocolate cake.",
        "For the ganache: Heat the cream until very hot. Add the vanilla, and then pour over the chocolate pieces. Stir to completely melt.",
        "To assemble: Place the white frosting into a frosting bag. Squeeze the frosting onto one circle of cake. Press a second circle on top. Using a ladle, pour ganache over the cake, allowing the chocolate to run over the sides. Place 3 cherries on the center. Repeat the process with each cake. Chill the cakes until ready to serve!"
    ],
    "ingredients": [
        "Baking spray, for spraying parchment",
        "2 cups all-purpose flour",
        "2 cups granulated sugar",
        "1/4 teaspoon salt",
        "2 sticks (1 cup) butter",
        "4 heaping tablespoons cocoa",
        "1/2 cup buttermilk",
        "1 teaspoon baking soda",
        "1 teaspoon vanilla",
        "2 eggs, beaten",
        "5 tablespoons all-purpose flour",
        "1 cup milk",
        "1 teaspoon vanilla",
        "2 sticks (1 cup) butter",
        "1 cup granulated sugar (not powdered sugar!)",
        "3 cups heavy cream",
        "2 teaspoons vanilla",
        "24 ounces semisweet chocolate, broken into pieces",
        "1 jar maraschino cherries"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dessert",
        "Frosting Recipes"
    ],
    "title": "Chocolate Devils",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chocolate-devils"
}
