{
    "directions": [
        "Line the bottom of a greased 9-inch springform pan with wax paper, grease the paper, and dust the pan with flour, knocking out the excess. In a food processor purée the chestnuts with the butter and the rum, scraping down the sides, until the mixture is smooth. Add the chocolate and blend the mixture until it is combined well. With the motor running, add the yolks, 1 at a time, and transfer the mixture to a large bowl. In a bowl with an electric mixer beat the whites with the salt until they hold soft peaks, add the sugar, a little at a time, beating, and beat the meringue until it holds stiff peaks. Whisk about one fourth of the meringue into the chocolate mixture to lighten it and fold in the remaining meringue gently but thoroughly. Pour the batter into the prepared pan, smooth the top, and bake the torte in the middle of a preheated 350°F. oven for 45 to 55 minutes, or until a tester comes out with crumbs adhering to it and the top is cracked. Let the torte cool in the pan on a rack for 5 minutes, remove the side of the pan, and invert the torte onto another rack. Remove the bottom of the pan, reinvert the torte onto a rack, and let it cool completely. (The torte will fall as it cools.)",
        "Put the chocolate in a small bowl, in a saucepan bring the cream to a boil, and pour it over the chocolate. Stir the mixture until the chocolate is melted and the glaze is smooth and stir in the rum. Dip each candied chestnut halfway into the glaze to coat it partially, transfer the chestnuts to a foil-covered tray, and let them set.",
        "Invert the torte onto a rack set on wax paper, pour the glaze over it, smoothing the glaze with a spatula and letting the excess drip down the side, and let the torte stand for 2 hours, or until the glaze is set. Transfer the torte carefully to a serving plate and garnish it with the coated chestnuts.",
        "In a chilled bowl with chilled beaters beat the cream until it holds soft peaks, beat in the sugar and the rum, and beat the mixture until it holds stiff peaks. Fold in the chopped candied chestnuts.",
        "Serve the torte with the whipped cream."
    ],
    "ingredients": [
        "3/4 pound (about 2 cups) canned or vacuum-packed whole chestnuts, rinsed, drained  well, and patted dry if using canned",
        "1 stick (1/2 cup) unsalted butter, softened",
        "4 tablespoons dark rum",
        "10 ounces fine-quality bittersweet chocolate, chopped and melted",
        "6 large eggs, separated",
        "1/4 teaspoon salt",
        "1/2 cup sugar",
        "6 ounces fine-quality bittersweet chocolate, chopped fine",
        "1/2 cup heavy cream",
        "1 tablespoon dark rum",
        "8 marrons glacés (candied chestnuts, available at specialty foods shops)",
        "1 cup well-chilled heavy cream",
        "1 tablespoon sugar, or to taste",
        "1 tablespoon dark rum if desired",
        "3/4 cup chopped marrons glacés"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Rum",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Chestnut",
        "Gourmet"
    ],
    "title": "Chocolate Chestnut Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-chestnut-torte-13203"
}
