{
    "directions": [
        "Preheat oven to 350°F. Grease tart pan with butter. Pulse cookies and salt in a food processor until cookies are finely ground. With the motor running, slowly pour in melted butter and process until well combined.",
        "Using a measuring cup, firmly press cookie mixture into bottom and up sides of tart pan. Bake crust until firm, about 10 minutes. Transfer pan to a wire rack and let cool 15 minutes.",
        "Using an electric mixer on medium-high speed, beat corn syrup, cream cheese, butter, vanilla, and salt in a large bowl, scraping down sides of bowl as needed, until combined, 1–2 minutes. Add powdered sugar and beat on low 1–2 minutes, then increase speed to medium and beat until incorporated, 1–2 minutes more. Transfer 1/2 cup filling to a medium bowl. Transfer remaining filling to a pastry or large resealable plastic bag; this is the \"egg white\" filling.",
        "Add yellow and red food coloring a few drops at a time to filling in bowl to match the color of an orange egg yolk. Transfer “yolk” filling to another pastry or large resealable plastic bag.",
        "Heat both chocolates in a medium heatproof bowl set over a medium saucepan of barely simmering water (do not let water touch bowl), stirring with a spatula, until chocolate is melted.",
        "Meanwhile, heat cream in a small pot over medium, stirring occasionally, until warmed through and small bubbles start to appear on the surface.",
        "Add salt to melted chocolate, then remove from heat and gradually whisk in cream until incorporated. Whisk in butter, then corn syrup, until smooth and combined.",
        "Pour 1 1/2 cups ganache into cooled crust; reserve remaining ganache in bowl. Chill filled crust until set, about 30 minutes.",
        "Snip off ends of pastry bags to create a 3/8\" hole. Pipe “yolk” filling in a tight spiral in the center of the tart to create an orange “yolk” about 3\" wide and 1/2\" thick. Pipe \"egg white\" filling around “yolk” in a tight spiral, about 1/2\" thick, leaving about a 1/2\" ring of chocolate showing around “egg white” filling at the edges of tart.",
        "Set bowl with ganache over a pot of barely simmering water; heat ganache, stirring, until it pours easily. Pour over filling until covered; do not overfill. Chill until set, at least 3 hours. Let sit at room temperature 15 minutes before serving.",
        "Tart can be made 1 day ahead. Chill until set, then cover loosely with plastic wrap."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter, melted, plus more for pan",
        "6 ounces chocolate wafer cookies (about 28 cookies), coarsely crumbled",
        "Pinch of kosher salt",
        "1/2 cup light corn syrup",
        "1/4 cup cream cheese, room temperature",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces, room temperature",
        "2 teaspoons vanilla extract",
        "1/8 teaspoon kosher salt",
        "3 cups powdered sugar",
        "5–6 drops yellow food coloring",
        "1–2 drops red food coloring",
        "12 ounces milk chocolate, chopped",
        "6 ounces semisweet chocolate, chopped",
        "2 cups heavy cream",
        "Pinch of kosher salt",
        "3 tablespoons unsalted butter, cut into small pieces, room temperature",
        "1 tablespoon light corn syrup",
        "A 9\" tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Easter",
        "Tart",
        "Candy",
        "Chocolate",
        "Cream Cheese",
        "Dessert",
        "Bake",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate “Creme Egg” Tart",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-creme-egg-tart"
}
