{
    "directions": [
        "Combine the flour, cocoa powder, baking powder, cinnamon and salt in a bowl. Whisk together and set aside.",
        "In the bowl of an electric mixer, cream the butter and brown sugar until fluffy. Add the vanilla and egg and beat until combined. Add the flour/cocoa mixture in 2 or 3 batches, mixing well after each addition. Place the dough into a large resealable plastic bag and flatten slightly with your hand. Seal the bag and refrigerate for 2 hours.",
        "To bake the cookies, preheat the oven to 350 degrees F. Line a baking sheet with parchment paper or a silicone baking mat. Dust a work surface with cocoa powder.",
        "Remove the dough from the bag and place on the cocoa powder-dusted surface for 5 to 10 minutes. Roll out to 1/4-inch thickness and cut with a heart cutter. You'll need to consolidate and re-roll the dough as you go. Place on the prepared baking sheet and bake until set but not browning at all, about 12 minutes. Allow to cool completely.",
        "To decorate the cookies with stenciled letters, Pink Buttercream or melted chocolate: Stencil some of the cookies with the alphabet stencils to spell out things like \"Love You\" and \"Be Mine.\" Place the stencils on the cooled cookies and lay pieces of scrap paper on any areas of exposed cookie. Lightly sift powdered sugar over the stencils. Carefully remove the paper and stencils with tweezers, being careful not to drop powdered sugar as you remove them. Use a tiny brush to correct \"errors.\"",
        "For the remaining cookies, frost with Pink Buttercream if desired, or drizzle with melted white chocolate. Arrange on a platter or in a basket and deliver to your sweetie! (Don't stack the cookies.)",
        "Add the powdered sugar, butter, heavy cream and food coloring to the bowl of an electric mixer and cream together until light and fluffy."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1/4 cup unsweetened cocoa powder, plus more for dusting",
        "1 teaspoon baking powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 cup firmly packed brown sugar",
        "1 1/2 teaspoons vanilla extract",
        "1 large egg",
        "Powdered sugar, for decorating",
        "Pink Buttercream, recipe follows, optional",
        "Melted white chocolate, for drizzling, optional",
        "4 cups powdered sugar",
        "2 sticks (1 cup) unsalted butter, softened",
        "1/4 cup heavy cream",
        "3 drops red liquid food coloring"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Baking",
        "Dessert"
    ],
    "title": "Chocolate Message Cookies",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chocolate-message-cookies"
}
