{
    "directions": [
        "Remove peel from oranges (orange part only) in strips using vegetable peeler. Finely chop enough peel to measure 2 teaspoons and set aside for cookie batter. Blanch remaining peel in small saucepan of boiling water 2 minutes. Drain. Return blanched orange peel strips to saucepan. Add 1/2 cup sugar and water and bring to boil, stirring frequently. Boil 5 minutes. Drain; reserve syrup for another use.",
        "Sprinkle 2 tablespoons sugar on plate. Arrange orange peel strips atop sugar. Sprinkle with remaining 2 tablespoons sugar. Let stand 15 minutes. Remove peel from sugar. Finely chop enough peel to measure 2 tablespoons; reserve remainder for another use.",
        "Preheat oven to 350&;amp;deg;F. Line 2 heavy large cookie sheets with foil. Lightly butter foil. Combine first 4 ingredients in heavy small saucepan. Cook over medium heat just until sugar dissolves, stirring constantly. Add 2 teaspoons minced unsugared peel, 2 tablespoons chopped sugared orange peel, almonds, flour and ginger. Bring mixture to boil, stirring frequently.",
        "Drop 1 level tablespoon mixture (mixture will be runny) onto prepared cookie sheet. Repeat 5 more times, spacing cookies about 3 inches apart. Repeat procedure with second cookie sheet. Bake cookie until edges are pale golden, brown, about 8 minutes (cookies will spread). Remove cookie sheets from oven. Using 3-inch round cookie cutter, push cookie sides in to reshape cookies into 3-inch rounds. Slide foil off sheets. Cool cookies on foil. Turn foil over. Carefully peel off cookies. Line same cookie sheets with new foil. Repeat with remaining batter.",
        "Line 2 cookie sheets with foil. Melt chocolate in top of double boiler over simmering water, stirring occasionally until smooth. Remove from over water. Dip 1 cookie halfway into chocolate; shake off excess chocolate. Place cookie on prepared sheet. Repeat with remaining cookies. Refrigerate until chocolate sets, about 30 minutes. Remove cookies from foil. (Can be prepared 2 weeks ahead. Refrigerate in airtight container between sheets of waxed paper. Let cookies stand 20 minutes at room temperature before serving.)"
    ],
    "ingredients": [
        "3 oranges",
        "1/2 cup plus 4 tablespoons sugar",
        "1/2 cup water",
        "1/2 cup plus 2 tablespoons whipping cream",
        "1/2 cup sugar",
        "1/4 cup firmly packed golden brown sugar",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2/3 cup lightly toasted sliced almonds",
        "1/4 cup all purpose flour",
        "2 tablespoons finely chopped crystallized ginger",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate,chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Citrus",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Orange",
        "Almond"
    ],
    "title": "Chocolate-Dipped Orange and Ginger Florentines",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-dipped-orange-and-ginger-florentines-2866"
}
