{
    "directions": [
        "Preheat oven to 350°F. Pulse gingersnaps, pecans, brown sugar, and salt in a food processor until finely ground. Add butter and pulse until dough sticks together when pressed. Transfer to pie pan and press evenly into bottom and up sides with a flat measuring cup. Bake crust until golden brown, 8-10 minutes. Let cool completely.",
        "Spread pecans and pumpkin seeds on a rimmed baking sheet. Toast in 350°F oven until warmed through and lightly fragrant, 5 minutes; let cool.",
        "Meanwhile, heat butter, chocolate, and cream in a heatproof bowl set over a saucepan of simmering water (bottom of bowl should not touch water), stirring, until melted and smooth, about 5 minutes. Let cool slightly.",
        "Whisk eggs and brown sugar in a large bowl until frothy. Whisk in salt and 1/4 cup molasses until smooth, then slowly add chocolate mixture, whisking constantly, until combined. Stir in half of toasted pecans and pumpkin seeds. Pour mixture into prepared crust. Arrange remaining pecans and pumpkin seeds evenly over filling.",
        "Bake pie until filling is set around the edges but jiggles slightly in the center when shaken, 25–30 minutes.",
        "Meanwhile, whisk remaining 1 Tbsp. molasses and 1 tsp. water in a small bowl.",
        "Remove pie from oven and transfer to a wire rack. Using pastry brush, immediately brush surface with molasses mixture to glaze; let cool before serving.",
        "Pie can be made 1 day ahead; store at room temperature."
    ],
    "ingredients": [
        "20 gingersnaps (about 4 1/2 ounces)",
        "3/4 cup raw pecans (about 3 ounces)",
        "1 tablespoon (packed) light brown sugar",
        "1/8 teaspoon kosher salt",
        "3 tablespoons cold unsalted butter, cut into pieces",
        "1 1/2 cups pecan halves (about 6 ounces)",
        "1/2 cup raw pumpkin seeds",
        "6 tablespoons unsalted butter",
        "3 ounces unsweetened chocolate, coarsely chopped",
        "1/4 cup heavy cream",
        "4 large eggs",
        "1/2 cup (packed) light brown sugar",
        "1/2 teaspoon kosher salt",
        "1/4 cup plus 1 tablespoon molasses",
        "A 9\" pie pan (not deep dish), pastry brush"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Thanksgiving",
        "Kid-Friendly",
        "Pecan",
        "Seed",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Chocolate, Pecan, and Pumpkin Seed Pie With Gingersnap Crust",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-pecan-and-pumpkin-seed-pie-with-gingersnap-crust-56390158"
}
