{
    "directions": [
        "Preheat oven to 350°F. and lightly oil a 9 1/2- by 2-inch springform pan.",
        "In a bowl stir together crust ingredients until combined well and press onto bottom of pan. Bake crust in middle of oven 15 minutes, or until pale golden, and cool in pan on a rack.",
        "In a saucepan heat cream, chocolate, and corn syrup over moderately high heat, stirring occasionally, until chocolate is melted and mixture just comes to a boil. Remove pan from heat and stir in butter, one piece at a time, until smooth. Pour mixture over crust in pan and chill, until firm, about 3 hours.",
        "In a saucepan cook sugar and water over moderately high heat, stirring occasionally, until sugar is melted. Simmer syrup, undisturbed, until a candy thermometer registers 240°F. In a bowl with an electric mixer beat yolks until smooth. Add hot syrup in a stream, beating on high speed until thickened and cooled. Reduce speed to medium and beat in butter, a little at a time. Beat in Kahlúa and chocolate until combined well. Spread buttercream over chocolate layer and chill until firm, about 3 hours.",
        "Run a knife around edge of pan and carefully remove side of pan."
    ],
    "ingredients": [
        "1/2 cup graham cracker crumbs",
        "1/2 cup finely chopped walnuts",
        "1 cup finely chopped almonds",
        "1/2 cup sugar",
        "1 stick (1/2 cup) unsalted butter, melted",
        "2 cups heavy cream",
        "16 ounces semisweet chocolate, chopped coarse",
        "2 tablespoons light corn syrup",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "1 1/2 cups sugar",
        "1/2 cup water",
        "6 large egg yolks",
        "3 sticks (1 1/2 cups) unsalted butter, softened",
        "1/2 cup Kahlúa",
        "4 ounces semisweet chocolate, chopped, melted, and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Almond",
        "Kahlúa",
        "Gourmet"
    ],
    "title": "Chocolate Kahlua Fantasy Cake",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-kahlua-fantasy-cake-11826"
}
