{
    "directions": [
        "For the crust: Place an oven rack in the middle of the oven and preheat to 325 degrees F.",
        "Spray the pan with vegetable oil cooking spray. Lay a 6-by-18-inch piece of parchment paper in the pan, allowing the excess paper to overhang the sides. Spray the parchment paper lightly with vegetable oil cooking spray.",
        "Blend the biscotti, butter, cocoa powder and brown sugar in a food processor until the mixture forms moist crumbs. Firmly press the crumbs onto the bottom of the pan. Bake for 15 minutes. Cool the crust completely, about 25 minutes.",
        "Spread the jam in an even layer over the crust using a spatula.",
        "For the filling: Place the chocolate in a small bowl over a saucepan of barely simmering water. Stir occasionally until the chocolate is melted and smooth.",
        "Beat the cheese, sour cream, eggs, granulated sugar and vanilla until smooth, using a whisk, in a medium bowl. Pour the batter over the cooled crust. Randomly spoon the melted chocolate over the batter. Swirl the chocolate into the batter, using the tip of a knife. Bake until light golden and the center of the filling jiggles slightly when the pan is gently shaken, about 40 minutes. Transfer the baking dish to a wire rack and cool for 1 hour. Cover the pan with plastic and refrigerate for at least 6 hours or preferably overnight until firm.",
        "Run a thin spatula around the sedges of the pan to loosen the filling. Cut the bars into 1 1/2-by-2-inch bars using a damp knife. Serve at room temperature."
    ],
    "ingredients": [
        "Vegetable oil cooking spray",
        "8 plain or almond biscotti, broken into 1-inch pieces (5 to 6 ounces)",
        "5 tablespoons unsalted butter, chopped into 1/2-inch pieces, chilled",
        "1/4 cup unsweetened cocoa powder",
        "1/4 packed cup dark brown sugar",
        "1/2 cup raspberry jam or preserves, such as Bonne Maman",
        "1/2 cup semisweet chocolate chips, such as Ghirardelli",
        "1 cup mascarpone, at room temperature (8 ounces)",
        "1 cup sour cream, at room temperature (8 ounces)",
        "5 large eggs, at room temperature",
        "1/2 cup granulated sugar",
        "1 1/2 teaspoons pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Fruit",
        "Raspberry Recipes",
        "Chocolate",
        "Cheese"
    ],
    "title": "Chocolate-Raspberry Mascarpone Bars",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/chocolate-raspberry-mascarpone-bars-recipe"
}
