{
    "directions": [
        "Add 1 stick of the butter to a medium skillet over medium heat. Allow it to melt and bubble up for 3 to 4 minutes, swirling the skillet to keep the butter moving around. When the butter is a medium golden brown, remove from the heat (it will continue browning in the skillet over the next 30 seconds or so!). Pour the butter (and any solids in the bottom) into a heatproof bowl and allow it to cool completely, about 30 minutes. Meanwhile, allow the other stick of butter to soften.",
        "Preheat the oven to 375 degrees F. Line a baking sheet with a silicone baking mat.",
        "In a large bowl with an electric mixer, cream the softened stick of butter together with the brown sugar and granulated sugar until it¿s nice and combined. Add the vanilla and eggs and beat until smooth, scraping the bowl if necessary to make sure everything is incorporated. With the mixer on medium low, very slowly drizzle in the cooled melted butter, making sure to add all the darker brown solids. Scrape the bowl and mix again until everything is combined, 20 to 30 seconds.",
        "In a separate bowl, combine the flour, coffee granules, baking soda and salt. Stir together, then add it to the butter mixture in 3 increments, mixing on low after each until it¿s totally incorporated. Scrape the bowl and beat for a few more seconds. Stir in the chocolate chunks and the pecans if using.",
        "In batches, scoop the cookie dough by heaping teaspoons onto the prepared baking sheet. Press extra chocolate chunks into the tops of each cookie if desired. Refrigerate the scooped cookies for 15 minutes, then bake until golden brown, 9 to 10 minutes. Remove from the oven, then transfer the cookies to a cooling rack. Repeat with the rest of the dough.",
        "Serve!"
    ],
    "ingredients": [
        "1 cup (2 sticks) salted butter",
        "1 cup packed brown sugar",
        "1/2 cup granulated sugar",
        "1 tablespoon vanilla",
        "2 large eggs",
        "2 cups plus 2 rounded tablespoons all-purpose flour",
        "2 heaping teaspoons instant coffee granules",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "8 ounces good semisweet chocolate, chopped into chunks, plus additional chunks for topping, optional",
        "1/2 cup finely chopped pecans, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Baking",
        "Dessert",
        "Coffee Recipes"
    ],
    "title": "Chocolate Chunk Cookies",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/chocolate-chunk-cookies"
}
