{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter and flour 9-inch-diameter springform pan with 2 3/4-inch-high sides. Shake out excess flour. Line bottom of pan with parchment paper; butter paper.",
        "Combine 1/2 cup whole almonds and 2 tablespoons sugar in processor. Using on/off turns, grind nuts finely. Transfer mixture to large bowl. Combine remaining 1/2 cup whole almonds and vegetable oil in processor. Process until mixture is thick and pasty (consistency will be similar to that of peanut butter), scraping bowl frequently, about 3 minutes.",
        "Stir butter and 1/2 cup whipping cream in heavy large saucepan over medium heat until butter melts and mixture simmers. Remove from heat. Add chocolate and whisk until smooth. Stir in both almond mixtures. Cool slightly.",
        "Using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually add 1/3 cup sugar and beat until stiff peaks form. Beat egg yolks in another large bowl until very pale and thick, about 5 minutes. Gradually beat chocolate mixture into egg yolks. Fold in egg whites in 3 additions.",
        "Pour batter into prepared pan. Bake cake until sides crack and puff and tester inserted into center comes out with moist batter attached, about 35 minutes. Transfer cake to rack. Cool cake to room temperature, about 2 hours (center will fall slightly as cake cools.) (Can be prepared 4 days ahead. Cover and refrigerate.)",
        "Beat chilled cream, amaretto and remaining 2 tablespoons sugar in large bowl until soft peaks form.",
        "Run small sharp knife around pan sides to loosen cake. Release pan sides. Dust cake with powdered sugar. Sprinkle toasted almond slices around top edge of cake. Serve chilled or at room temperature with whipped cream."
    ],
    "ingredients": [
        "1 cup (about 5 ounces) whole almonds, toasted, cooled",
        "4 tablespoons plus 1/3 cup sugar",
        "2 tablespoons vegetable oil",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "1/2 cup whipping cream",
        "1 pound bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "6 large eggs, separated, room temperature",
        "1 cup chilled whipping cream",
        "2 tablespoons amaretto or 1 teaspoon almond extract",
        "Powdered sugar",
        "1/2 cup almond slices, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Amaretto",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chocolate-Almond Soufflé Torte",
    "url": "http://www.epicurious.com/recipes/food/views/chocolate-almond-souffle-torte-3095"
}
