{
    "directions": [
        "In large bowl, combine chickpeas and enough cold water to cover by 2 inches. Refrigerate at least 8 hours or overnight, then drain and rinse thoroughly under running water.",
        "In 6- to 8-quart saucepan, combine chickpeas and 5 cups water. Bring to boil, then reduce heat to moderate and simmer, uncovered, until chickpeas are tender but not mushy, about 2 1/2 hours. Raise heat to high and boil until all but 1/2 inch of water has evaporated. Remove from heat and set aside.",
        "In large saucepan over moderate heat, heat oil. Add cumin seeds and sauté until they begin to sizzle, about 30 seconds. Add onions and sauté until golden brown, about 15 to 20 minutes. Add tomatoes, chile powder, cumin, and salt and simmer, stirring frequently, until sauce thickens slightly, about 2 to 3 minutes. Stir in chickpeas and 1/2 cup cilantro, cover, and simmer until thick sauce forms, about ten minutes. Pour into serving dish and garnish with remaining cilantro, sliced onions, and sliced tomatoes."
    ],
    "ingredients": [
        "1 pound dried chickpeas (garbanzo beans; 2 1/2 cups), picked over",
        "2 tablespoons vegetable oil",
        "1 teaspoon cumin seeds",
        "1 large onion, sliced, plus extra thin slices for garnishing",
        "4 medium tomatoes, chopped, plus thin slices for garnishing",
        "1 1/2 teaspoons chile powder (see Tip, below)",
        "1 1/4 teaspoons ground cumin",
        "1 teaspoon salt",
        "1/2 cup fresh cilantro, finely chopped, plus extra for garnishing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Side",
        "Vegetarian",
        "Diwali",
        "Ramadan",
        "Spice",
        "Chickpea",
        "Vegan",
        "Cilantro",
        "Simmer",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cholay",
    "url": "http://www.epicurious.com/recipes/food/views/cholay-235950"
}
