{
    "directions": [
        "Put the fish in a large bowl, add 1 tablespoon of the lime juice and the salt, and toss well. Put the flour in another large bowl, add the fish, and toss very well to evenly coat the fish.",
        "Pour 3 inches of canola oil into a Dutch oven or medium pot and heat the oil over medium-high heat until it reaches 375°F on a deep-fry thermometer. Working in batches to avoid crowding the oil, shake off a little flour from the fish, then add the fish to the oil and fry until the pieces are lightly golden brown and crispy, about 2 minutes per batch. Transfer the fried fish to a paper towel to drain.",
        "When the fish is just cool enough to handle, put it in a large bowl and add the onions, cilantro, chiles, Worcestershire sauce, olive oil, and the remaining 2 tablespoons of lime juice. Toss and mix well with your hands or a spoon, breaking up the strips into small pieces as you do. Season to taste with more lime juice, chiles, and salt.",
        "Serve alongside tortillas and lime wedges, topped with avocado slices and Fresh Green Salsa."
    ],
    "ingredients": [
        "1 pound skinless boneless cod, flounder, or tilapia fillets, cut into approximately 3-by-1/2-inch strips",
        "3 tablespoons freshly squeezed lime juice, plus more to taste",
        "1 teaspoon kosher salt",
        "All-purpose flour, for frying",
        "Canola or vegetable oil, for frying",
        "1 cup finely diced white onions",
        "1 cup chopped cilantro",
        "2 fresh serrano or jalapeño chiles, finely chopped (including seeds), plus more to taste",
        "5 teaspoons Worcestershire sauce",
        "2 tablespoons extra-virgin olive or vegetable oil",
        "Warm corn tortillas, lime wedges, avocado slices, and Fresh Green Salsa , for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Quick & Easy",
        "Cinco de Mayo",
        "Dinner",
        "Lunch",
        "Cod",
        "Healthy",
        "Low Cholesterol",
        "Tortillas",
        "Lime Juice",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Chopped Fried-Fish Tacos (Tacos de salpicón de pescado)",
    "url": "http://www.epicurious.com/recipes/food/views/chopped-fried-fish-tacos-tacos-de-salpicon-de-pescado-56389521"
}
