{
    "directions": [
        "Stir together garlic cloves, 1 tablespoon oyster sauce, soy sauce, salt, and 1/2 teaspoon cornstarch in a bowl. Stir in pork and marinate 15 minutes.",
        "Keep cut vegetables separate. Heat a wok over high heat until a bead of water dropped onto cooking surface evaporates immediately. Drizzle 1 teaspoon vegetable oil around side of wok, then stir-fry celery, seasoning with salt, until crisp-tender, about 2 minutes. Transfer celery to a large bowl. Reheat wok and stir-fry each remaining vegetable separately in same manner (but allow only 1 minute for bean sprouts), adding 1 teaspoon oil to wok before each batch and seasoning with salt. When stir-frying bok choy, begin with ribs, then add leaves and 1 tablespoon water after 1 minute. Transfer each vegetable as cooked to bowl with celery.",
        "Stir together chicken broth, 1 teaspoon oyster sauce, and 1 teaspoon cornstarch.",
        "Reheat wok over high heat until a bead of water evaporates immediately. Drizzle 1 tablespoon vegetable oil around side of wok, then stir-fry pork until just cooked through, about 2 minutes.",
        "Return all vegetables to wok and toss. Make a well in center, then stir broth mixture and add to well. Bring sauce to a boil, undisturbed, then stir to combine with pork and vegetables. Serve immediately, with cooked rice."
    ],
    "ingredients": [
        "2 garlic cloves, minced",
        "1 tablespoon plus 1 teaspoon oyster sauce",
        "1/2 tablespoon soy sauce",
        "1 teaspoon salt",
        "1 1/2 teaspoon cornstarch",
        "1 pound pork tenderloin, cut crosswise into 1/8-inch-thick strips",
        "2 celery ribs diagonally cut into 1/4-inch-thick slices",
        "6 oz snow peas diagonally cut into 1/4-inch-thick slices",
        "1/2 lb bok choy, cut into 1/4-inch-thick slices (leaves and ribs separately)",
        "1/4 lb mushrooms cut into 1/4-inch-thick slices",
        "1 onion, halved lengthwise and into 1/4-inch-thick strips",
        "1 green bell pepper cut into 1/4-inch-thick strips, then halved crosswise",
        "1/4 lb mung bean sprouts, rinsed and drained",
        "1 (5-oz) can sliced water chestnuts",
        "1 (5-oz) can sliced bamboo shoots",
        "1/4 cup chicken broth",
        "Vegetable oil",
        "Water",
        "Salt and pepper to taste",
        "N/A pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Vegetable",
        "Stir-Fry",
        "Dinner",
        "Bok Choy",
        "Sugar Snap Pea",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "No Sugar Added"
    ],
    "title": "Chop Suey",
    "url": "http://www.epicurious.com/recipes/food/views/chop-suey-106261"
}
