{
    "directions": [
        "Cut avocados all the way around with a sharp knife. Scoop out the pit, then spoon avocado flesh away from skin into a food processor. Add the juice of 1 lime, a couple of pinches salt, sour cream and chipotles in adobo. Pulse guacamole until smooth. Transfer to a serving bowl.",
        "Heat a 12-inch nonstick skillet over medium high heat. Brown chorizo 2 to 3 minutes, then remove from pan. Add oil, garlic, then shrimp. Season shrimp with salt and pepper and cook shrimp until pink, 2 or 3 minutes. Transfer shrimp to a cutting board and coarsely chop.",
        "Add a drizzle of oil to the pan and a large tortilla. Cook tortilla 30 seconds, then turn. Cover 1/2 of the tortilla with a couple of handfuls of cheese. Arrange a layer of chorizo and shrimp over the cheese and fold tortilla over. Press down gently with a spatula and cook tortilla a minute or so on each side to melt cheese and crisp. Remove quesadilla to large cutting board and repeat with remaining ingredients. Cut each quesadilla into 5 wedges and transfer to plates with your spatula. Top wedges of quesadillas with liberal amounts of smoky guacamole."
    ],
    "ingredients": [
        "2 ripe Haas avocados",
        "1 lime, juiced",
        "A couple pinches salt",
        "1/4 cup sour cream, 3 rounded tablespoonfuls",
        "2 chipotle peppers in adobo, available in cans on specialty food aisle in Mexican section",
        "1/2 pound chorizo sausage, sliced thin on an angle",
        "1 tablespoon extra virgin olive oil, plus some for drizzling",
        "1 clove garlic, cracked away from skin and crushed",
        "12 large shrimp, peeled and deveined, tails removed, ask for easy-peels at fish counter",
        "Salt and freshly ground black pepper",
        "4 (12- inch) flour tortillas",
        "1/2 pound, 2 cups, shredded pepper Jack cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southwestern",
        "Quesadilla",
        "Fruit",
        "Lime Recipes",
        "Shellfish Recipes",
        "Meat",
        "Pork",
        "Vegetable",
        "Avocado",
        "Sausage Recipes",
        "Chorizo",
        "Shrimp",
        "Dairy Recipes",
        "Main Dish Recipes",
        "Appetizer",
        "Recipes for Parties",
        "Super Bowl"
    ],
    "title": "Chorizo and Shrimp Quesadillas with Smoky Guacamole",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/chorizo-and-shrimp-quesadillas-with-smoky-guacamole-recipe"
}
