{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F. Lightly oil a 13- by 9-inch baking pan or dish.",
        "Finely chop white and green parts of scallions and reserve separately.",
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook onions, garlic, white parts of scallions, 3/4 teaspoon salt, and 1/4 teaspoon pepper, stirring occasionally, until onions are golden, about 6 minutes. Add chorizo and cook, stirring occasionally, until just beginning to brown and release oil, about 4 minutes. Reduce heat to moderate, then stir in potatoes and cover skillet. Cook, stirring occasionally, until potatoes are tender, about 10 minutes. Transfer mixture to a large bowl and cool slightly.",
        "Whisk together eggs, sour cream, cheese, scallion greens, and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper in a bowl, then pour into baking pan. Sprinkle potato mixture over eggs (some potatoes will stick out). Bake until custard is set, about 20 minutes. Cool in pan on a rack to warm or room temperature. Trim 1/2 inch off each side, then cut tortilla into 1 1/2- by 1-inch rectangles."
    ],
    "ingredients": [
        "1 bunch scallions",
        "2 tablespoons extra-virgin olive oil",
        "2 medium onions, chopped (1 1/2 cups)",
        "4 garlic cloves, finely chopped",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "6 oz Spanish chorizo (cured spiced pork sausage), cut into 1/4-inch dice",
        "1 1/2 lb yellow-fleshed potatoes such as Yukon Gold (about 4 medium), peeled and cut into 1/4-inch dice",
        "9 large eggs",
        "3/4 cup sour cream",
        "5 oz Manchego or white Cheddar, coarsely grated (2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Pork",
        "Potato",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Cheddar",
        "Sausage",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Chorizo and Potato Spanish Tortilla Bites",
    "url": "http://www.epicurious.com/recipes/food/views/chorizo-and-potato-spanish-tortilla-bites-236695"
}
