{
    "directions": [
        "Combine turkey, salt, garlic powder, chili powder, smoked and sweet paprika, cumin, coriander, oregano, chipotle pepper, cinnamon, cloves, and apple cider vinegar in a mixing bowl. Mix well. Refrigerate for at least 1 hour for flavors to blend.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a large baking sheet with parchment paper.",
        "Cut squash in half lengthwise, scoop out seeds and brush cut sides with olive oil. Place squash cut-side down on prepared baking sheet.",
        "Roast in preheated oven until squash is soft, 40 to 45 minutes. Set aside and keep warm.",
        "Heat a saucepan over medium-high heat. Add chilled chorizo mixture. Cook and stir, breaking up lumps, until cooked through and browned, 8 to 10 minutes. Add onion and cook for an additional 5 minutes, or until onion becomes translucent, stirring constantly. Add garlic and cook an additional 2 to 3 minutes. Stir in chili powder, salt, and cumin.",
        "Stir in beans, corn, diced green chilies, and tomatoes; cover and simmer 4 to 5 minutes.",
        "Fluff spaghetti squash strands with a fork, keeping them in the shells.",
        "Increase oven temperature to 400 degrees F (200 degrees C).",
        "Divide sauce among 4 squash halves. Top each half with 1/4 cup of cheese. Return to baking sheet and bake until cheese is melted 5 to 6 minutes. Garnish with fresh cilantro."
    ],
    "ingredients": [
        "Turkey Chorizo:",
        "1 pound lean ground turkey",
        "3/4 teaspoon salt",
        "1 teaspoon garlic powder",
        "1 1/2 teaspoons chili powder",
        "1 teaspoon smoked paprika",
        "1 teaspoon sweet paprika",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon dried Mexican oregano",
        "1/2 teaspoon dried chipotle chili pepper",
        "1/4 teaspoon cinnamon",
        "1/8 teaspoon ground cloves",
        "2 tablespoons cider vinegar",
        "Spaghetti Squash:",
        "2 (2 1/2 pound) spaghetti squash, halved and seeded",
        "1 tablespoon olive oil",
        "1/2 cup white onion, finely chopped",
        "1 clove garlic, minced",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cumin",
        "3/4 cup black beans, rinsed and drained",
        "1/2 cup fire-roasted frozen corn",
        "1/4 cup canned mild diced green chilies",
        "1 (14.5 ounce) can Hunt's® Fire Roasted Diced Tomatoes, undrained",
        "1 cup shredded queso Chihuahua or Mexican blend cheese",
        "1/4 cup fresh cilantro, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chorizo-Stuffed Spaghetti Squash",
    "url": "http://allrecipes.com/recipe/256308/chorizo-stuffed-spaghetti-squash/"
}
