{
    "directions": [
        "Heat a dry heavy skillet (preferably cast-iron) over moderate heat until hot, then toast chiles, pressing down with tongs and turning occasionally, about 1 minute. Transfer to a bowl. Toast garlic in skillet, turning occasionally, until softened and slightly charred, about 5 minutes, then transfer to bowl. Toast cumin in skillet, stirring, until fragrant and a few shades darker, about 30 seconds, then transfer to a blender along with tomatoes and salt. Discard stems and seeds from chiles and add to blender. Peel garlic and add to blender. Purée until smooth.",
        "Preheat oven to 325°F.",
        "Peel potatoes and cut crosswise into 1/8-inch-thick slices. Cook potatoes in a 2- to 3-quart saucepan of boiling salted water until just tender but not falling apart, about 8 minutes, then drain in a colander. Arrange slices, overlapping, in oiled baking dish.",
        "Cook onion in oil in a large heavy skillet over moderate heat, stirring, until softened, about 5 minutes. Add chorizo and cook, stirring, until chorizo is heated through, about 5 minutes. Spoon mixture evenly over potatoes and top with 1 cup sauce, spreading evenly.",
        "Whisk together eggs, cream, salt, and pepper until combined well and slowly pour into dish. Bake in middle of oven until custard is just set in center, 35 to 45 minutes.",
        "Let stand 5 to 10 minutes before cutting. Serve remaining chile sauce on the side."
    ],
    "ingredients": [
        "1/2 oz dried New Mexican chiles (2 to 3)",
        "2 garlic cloves, left unpeeled",
        "1 teaspoon cumin seeds",
        "1 (14- to 15-oz) can stewed tomatoes including juice",
        "3/4 teaspoon salt",
        "1 lb large boiling potatoes",
        "1 onion, finely chopped",
        "1 tablespoon olive oil",
        "1/2 lb hot or sweet Spanish chorizo (spiced cured pork sausage), finely chopped",
        "8 large eggs",
        "1 1/2 cups heavy cream",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: a shallow 2- to 2 1/2-quart ceramic or glass baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Pepper",
        "Potato",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Sausage",
        "Gourmet"
    ],
    "title": "Chorizo and Potato Egg Custard with New Mexican Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/chorizo-and-potato-egg-custard-with-new-mexican-chile-sauce-107973"
}
