{
    "directions": [
        "Toss onions and generous sprinkle of salt in medium bowl. Mix in lime juice. Set aside to marinate, tossing occasionally.",
        "Meanwhile, place yam in microwave-safe bowl. Add splash of water. Cover; cook on high until tender, 3 to 4 minutes.",
        "Sauté chorizo in large nonstick skillet over medium-high heat until cooked through, breaking into small pieces with fork, about 5 minutes. Transfer chorizo to bowl. Spoon off all but 1 tablespoon fat from skillet. Add chiles to skillet. Cover and cook until tender, stirring occasionally, about 4 minutes. Drain yam; transfer to skillet. Add chorizo and toss 1 minute to rewarm filling.",
        "Cook 1 tortilla at a time directly over gas flame or in skillet until heated, 10 to 15 seconds per side.",
        "Arrange tortillas on work surface. Spoon filling in strip down center of each. Top with cheese, onions, and sprinkle of lime marinade. Fold in sides of tortillas.",
        "Often called pasillas; available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "2 cups paper-thin slices red onions",
        "2 tablespoons fresh lime juice",
        "2 cups 1/2-inch-thick sticks peeled yam (red-skinned sweet potato)",
        "12 to 14 ounces fresh chorizo sausages (about 3), casings removed",
        "2 fresh poblano chiles,* halved, seeded, cut into thin strips",
        "8 7- to 8-inch-diameter flour tortillas",
        "1 cup crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Feta",
        "Lime",
        "Sausage",
        "Sweet Potato/Yam",
        "Tortillas",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Chorizo, Poblano and Yam Fajitas with Lime-Marinated Red Onions",
    "url": "http://www.epicurious.com/recipes/food/views/chorizo-poblano-and-yam-fajitas-with-lime-marinated-red-onions-350963"
}
