{
    "directions": [
        "Place beans in a large pot and cover with water by 3\". Bring to a boil; boil for 2 minutes. Remove from heat, cover, and let stand for 1 hour.",
        "Drain beans. Add fresh water to cover by 3\". Bring to a boil; reduce heat to medium and simmer, uncovered, until beans are just tender but not mushy, 1 1/2-2 hours (time will vary depending on size and age of beans). Drain, reserving 1 cup bean broth.",
        "Preheat oven to 450°F. Heat 2 tablespoons oil in a large heavy pot over medium heat. Add chorizo and cook, turning occasionally, until golden all over, 7-8 minutes. Transfer chorizo to a plate and set aside.",
        "Place 2 tablespoons oil, leek, and onion in same pot. Season with salt and pepper; cook, stirring occasionally, until vegetables are softened and light golden, about 5 minutes. Add garlic and anchovies; stir 1 minute to break down anchovies. Add tomato paste and paprika; stir constantly until paste is caramelized, about 2 minutes. Add reserved 1 cup bean broth, beans, chicken broth, and next 4 ingredients; bring to a boil.",
        "Cover and bake until beans are very tender, about 30 minutes. Add chorizo (and any accumulated juices) to pot, pressing to submerge. Bake until liquid is reduced and slightly thickened, 40-45 minutes longer.",
        "Meanwhile, heat 3 tablespoons oil in a large skillet. Add bread- crumbs and cook, stirring often, until golden and crisp, about 10 minutes. Season with salt and pepper.",
        "Sprinkle breadcrumbs over beans and drizzle with remaining 3 tablespoons oil. Bake cassoulet until breadcrumbs are browned and liquid is bubbling, about 15 minutes. Let sit for 15 minutes. Sprinkle parsley and lemon zest over just before serving."
    ],
    "ingredients": [
        "3 cups dried gigante, corona, or large lima beans",
        "4 tablespoons extra-virgin olive oil, divided, plus more for drizzling",
        "8 fresh Spanish chorizo or hot Italian sausage links (About 2 pounds)",
        "1 leek (white and pale-green parts only), cut into 1/4\"-thick rounds",
        "1 small yellow onion, finely chopped",
        "Kosher salt and freshly ground black pepper",
        "5 garlic cloves, thinly sliced",
        "3 anchovy fillets packed in oil, drained, chopped (optional)",
        "1 tablespoon tomato paste",
        "1 1/2 teaspoons smoked paprika",
        "3 cups low-salt chicken broth",
        "1 28-ounce can whole tomatoes, drained, crushed with your hands",
        "7 sprigs thyme",
        "2 bay leaves",
        "2 sprigs rosemary",
        "6 tablespoons extra-virgin olive oil, divided",
        "2 cups fresh coarse breadcrumbs (from three 1/2\"-thick slices white sandwich bread)",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup chopped flat-leaf parsley",
        "1 teaspoon finely grated lemon zest",
        "Ingredient info: Fresh Spanish chorizo, a link sausage that's milder than Mexican chorizo, can be found at specialty foods stores, Spanish markets, and latienda.com (try hot or mild). Smoked paprika is available at most supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Dinner",
        "Meat",
        "Party",
        "Potluck",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Chorizo and Gigante Bean Cassoulet",
    "url": "http://www.epicurious.com/recipes/food/views/chorizo-and-gigante-bean-cassoulet-394692"
}
