{
    "directions": [
        "Position rack in center of oven; preheat to 375°F. Butter two 9-inch-diameter cake pans. Line bottom of pans with waxed paper. Butter and flour waxed paper; tap out excess flour.",
        "Blend 2 cups walnuts and flour in processor until walnuts are finely ground. Add breadcrumbs, orange peel, spices and salt. Using on/off turns, process just until blended.",
        "Using electric mixer, beat eggs in large bowl until frothy. Gradually beat in 1 cup sugar and brown sugar. Continue beating until mixture is thick and triples in volume, about 6 minutes.",
        "Fold flour mixture and melted lukewarm butter alternately into egg mixture, beginning and ending with flour mixture (do not overmix or batter will deflate). Divide batter between prepared cake pans; smooth tops. Bake cakes until golden and tester inserted into center comes out clean, about 25 minutes. Transfer pans to racks; cool 5 minutes. Invert cakes onto racks; cool completely. Remove waxed paper.",
        "Toss cranberries with remaining 1/2 cup sugar in small bowl to coat. Transfer berries to plate. Cover and freeze. (Can be prepared ahead. Wrap each cake layer separately in plastic. Freeze cake layers and sugarcoated cranberries up to 1 week.)",
        "Place 1 cake layer on platter. Spread with 1 cup frosting. Top with second cake layer. Spread remaining frosting over top and sides of torte. Press remaining 3/4 cup walnuts onto torte sides. Arrange poached pears in concentric circles atop torte. (Torte can be frosted 1 day ahead. Cover torte; chill. Let torte stand 30 minutes at room temperature before serving.)",
        "Rewarm cranberry puree in small saucepan over medium heat. Brush some puree over pears. Transfer remaining puree to bowl.",
        "Garnish torte with frozen sugarcoated cranberries. Serve torte with puree."
    ],
    "ingredients": [
        "2 3/4 cups chopped toasted walnuts",
        "1 cup all purpose flour",
        "1/2 cup plain dry breadcrumbs",
        "2 teaspoons grated orange peel",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "6 large eggs",
        "1 1/2 cups sugar",
        "1/2 cup (packed) golden brown sugar",
        "1 cup (2 sticks) unsalted butter, melted, lukewarm",
        "1/2 cup fresh or frozen cranberries",
        "Cream Cheese-Orange Frosting",
        "Poached Pears with Cranberry Puree"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Cheese",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Cranberry",
        "Orange",
        "Pear",
        "Walnut",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Christmas Cranberry, Pear and Walnut Torte with Cream Cheese-Orange Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/christmas-cranberry-pear-and-walnut-torte-with-cream-cheese-orange-frosting-102694"
}
