{
    "directions": [
        "Soak cherries, mango, cranberries, currants, and citron in 1/4 cup rum for at least 24 hours. Cover tightly, and store at room temperature.",
        "Preheat oven to 325 degrees F (165 degrees C).  Butter a 6x3 inch round pan, and line with parchment paper.",
        "In a large bowl, cream together butter and brown sugar until fluffy. Beat in egg. Whisk together flour, baking soda, salt, and cinnamon; mix into butter and sugar in three batches, alternating with molasses and milk. Stir in soaked fruit and chopped nuts. Scrape batter into prepared pan.",
        "Bake in preheated oven for 40 to 45 minutes. Cool in the pan for 10 minutes, then sprinkle with 2 tablespoons rum.",
        "Cut out one piece parchment paper and one piece cheesecloth, each large enough to wrap around the cake. Moisten cheesecloth with 1 tablespoon rum. Arrange cheesecloth on top of parchment paper, and unmold cake onto it. Sprinkle top and sides of cake with remaining rum. Wrap the cheesecloth closely to the surface of the cake, then wrap with paper. Place in an airtight tin, and age for at least 10 weeks. If storing longer, douse with additional rum for every 10 weeks of storage."
    ],
    "ingredients": [
        "1/8 cup chopped dried cherries",
        "1/8 cup chopped dried mango",
        "1/4 cup dried cranberries",
        "1/4 cup dried currants",
        "2 tablespoons chopped candied citron",
        "1/4 cup dark rum",
        "1/2 cup butter",
        "1/4 cup packed brown sugar",
        "1 egg",
        "1/2 cup all-purpose flour",
        "1/8 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons milk",
        "1/4 cup unsulfured molasses",
        "1/4 cup chopped pecans",
        "1/4 cup dark rum, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Christmas Fruitcake",
    "url": "http://allrecipes.com/recipe/9267/christmas-fruitcake/"
}
