{
    "directions": [
        "Preheat oven to 300°F. Generously butter 8-cup pudding mold, metal bowl, or soufflé dish and sprinkle with sugar. Combine milk, butter, and 1/2 cup sugar in heavy medium pot. Scrape in seeds from vanilla bean; add bean. Simmer gently over medium-low heat until sugar dissolves and mixture is fragrant, stirring occasionally, about 8 minutes (do not boil). Remove pot from heat; cover and let steep 15 minutes. Remove vanilla bean. Whisk eggs in large bowl to blend. Gradually whisk in hot milk mixture.",
        "Whisk flour, cinnamon, nutmeg, baking soda, and salt in very large bowl to blend. Add croissant pieces, prunes, raisins, almonds, and lemon peel. Toss until croissant pieces are evenly coated and mixture is well blended. Pour milk mixture over. Let soak 10 minutes.",
        "Transfer croissant mixture to prepared baking dish, pressing to pack mixture into dish. Cover dish with plastic wrap and place in roasting pan. Pour enough hot water into roasting pan to come halfway up sides of baking dish. Cover roasting pan with heavy-duty aluminum foil. Oven-steam pudding until custard is set and pudding is puffed, about 2 hours. Carefully remove aluminum foil (steam will be released). Transfer covered pudding to rack and cool 1 hour. (Pudding can be made 1 day ahead. Cover and refrigerate. Resteam in 300°F oven 45 minutes to heat through before serving.)",
        "Whisk sour cream, brown sugar, and orange peel in medium bowl to blend. Cover and refrigerate at least 30 minutes. (Can be made 1 day ahead. Keep refrigerated.)",
        "Remove plastic wrap from warm pudding. Invert onto rimmed platter. Pour brandy over pudding. Carefully ignite brandy. When flames subside, slice pudding into wedges and serve with dollop of sour cream and brown sugar sauce."
    ],
    "ingredients": [
        "3 cups whole milk",
        "1/2 cup (1 stick) unsalted butter",
        "1/2 cup sugar",
        "1 vanilla bean, split lengthwise",
        "6 large eggs",
        "1/4 cup all purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon baking soda",
        "1/8 teaspoon salt",
        "8 croissants (about 1 pound), torn into 3/4-inch pieces",
        "1 cup pitted prunes, chopped",
        "1 cup raisins, chopped",
        "1/2 cup coarsely chopped almonds",
        "1 tablespoon grated lemon peel",
        "2 cups sour cream",
        "1/2 cup (packed) golden brown sugar",
        "1 tablespoon grated orange peel",
        "1/2 cup brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Prune",
        "Raisin",
        "Brandy",
        "Winter",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Christmas Croissant Pudding with Sour Cream and Brown Sugar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/christmas-croissant-pudding-with-sour-cream-and-brown-sugar-sauce-108980"
}
