{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Process graham crackers in a food processor to make crumbs; pulse 1 teaspoon sugar, ginger, 1/4 teaspoon nutmeg, and 1/4 teaspoon cinnamon with crumbs once or twice to combine. With processor running, drizzle butter into crumbs just to incorporate. Press graham cracker mixture into the bottom of a 9-inch spring form pan.",
        "Bake crust in the preheated oven for 10 minutes; cool on wire rack.",
        "Beat cream cheese in a large bowl with an electric mixer on medium speed until smooth. Stir 3/4 cup sugar, flour, 1/4 teaspoon nutmeg, 1/4 teaspoon cinnamon, and cloves in a bowl. Beat sugar mixture into cream cheese until smooth; beat in egg. Slowly beat eggnog into cream cheese mixture, followed by vanilla extract. Pour cream cheese filling into spring form pan over the crust. Tap pan lightly on a work surface to release air bubbles.",
        "Bake in the oven for 1 hour.",
        "Spread sour cream over filling. Return to oven and bake 5 more minutes.",
        "Cool in pan on a rack until cool to the touch, about 30 minutes, before refrigerating to chill thoroughly. Sprinkle with ground nutmeg to taste before serving."
    ],
    "ingredients": [
        "Crust:",
        "8 whole graham crackers",
        "1 teaspoon white sugar",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1/4 cup butter, melted",
        "Filling:",
        "4 (8 ounce) packages cream cheese, room temperature",
        "3/4 cup white sugar",
        "1/4 cup all-purpose flour",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1 pinch ground cloves",
        "1 egg",
        "1 3/4 cups prepared eggnog",
        "1 teaspoon vanilla extract",
        "1 (8 ounce) carton sour cream",
        "1 pinch ground nutmeg, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Christmas Eggnog Cheesecake",
    "url": "http://allrecipes.com/recipe/230445/christmas-eggnog-cheesecake/"
}
