{
    "directions": [
        "Pat tenderloin dry and rub with celery salt and black pepper. Cut bacon into 1 1/2-inch pieces. In a heavy kettle just large enough to hold tenderloin cook bacon over moderate heat, stirring occasionally, until crisp and transfer with a slotted spoon to a small bowl. Pour off all but 1 tablespoon bacon fat. Increase heat to moderately high and brown tenderloin on all sides, about 5 minutes total. With tongs transfer tenderloin to a plate.",
        "To kettle add wine, bacon, and rosemary and boil mixture 1 minute. Return tenderloin to kettle and cook at a bare simmer, covered, turning occasionally, 25 minutes, or until an instant-read thermometer inserted diagonally 2 inches into center of beef registers 125°F. for medium-rare. With tongs transfer tenderloin to a cutting board and let stand 10 minutes.",
        "While tenderloin is standing, cut bell pepper into 1/4-inch dice. With a slotted spoon discard bacon from cooking liquid. Add bell pepper and demiglace to cooking liquid and boil sauce over moderate heat until slightly thickened and reduced to about 1 1/3 cups.",
        "Cut tenderloin into 1/4-inch-thick slices and arrange on a platter. Spoon some of sauce over tenderloin and garnish with rosemary sprigs. Serve remaining sauce on the side."
    ],
    "ingredients": [
        "a 2-pound center-cut beef tenderloin roast (chateaubriand), trimmed and tied",
        "1 teaspoon celery salt",
        "1 teaspoon coarsely crushed black pepper",
        "2 bacon slices",
        "2/3 cup dry red wine",
        "1 1/2 teaspoons minced fresh rosemary leaves",
        "1 red bell pepper",
        "1 1/3 cups beef or veal demiglace*",
        "Garnish: fresh rosemary sprigs",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Christmas",
        "Beef Tenderloin",
        "Bacon",
        "Red Wine",
        "Winter",
        "Gourmet",
        "Maryland"
    ],
    "title": "Christmas Châteaubriand",
    "url": "http://www.epicurious.com/recipes/food/views/christmas-chateaubriand-15804"
}
