{
    "directions": [
        "Slice the jelly rolls into 1-inch pieces. Line a glass trifle bowl with the sliced jelly rolls. Drizzle 1/2 cup of sherry over the jelly roll slices. Toss the raspberries with 1 tablespoon of sugar or to taste and spoon over the jelly roll slices.",
        "In a bowl, whisk together the egg, egg yolks, and 1/2 cup of sugar until smooth; whisk in the flour until thoroughly combined and free of lumps. Pour milk and half-and-half into a saucepan; heat over medium heat until the milk mixture is steaming hot but not simmering. Whisk about 1/4 cup of the hot milk mixture into the egg mixture until smooth; repeat, whisking the hot milk in thoroughly each time, until you have whisked in about 3/4 cup of the hot milk mixture. Whisk the milk-egg mixture back into the steaming milk in the saucepan. Reduce heat to low. Whisking constantly, heat the sauce until it is thickened and just at the point of simmering (do not boil sauce), 3 to 4 minutes. Whisk in vanilla extract, 2 tablespoons of sherry, and butter. Allow the sauce to cool for about 10 minutes, whisking often to avoid lumps.",
        "Pour the custard over the raspberries in the trifle bowl, cover bowl with plastic wrap, and refrigerate until thoroughly chilled and set, at least 2 hours. Garnish with dollops of whipped cream, more raspberries, and chocolate shavings if desired."
    ],
    "ingredients": [
        "1 (5.9 ounce) package individual jelly-filled roll cakes",
        "1/2 cup sherry",
        "2 pints fresh raspberries",
        "1 tablespoon white sugar, or to taste",
        "1 egg",
        "2 egg yolks",
        "1/2 cup white sugar",
        "1/3 cup all-purpose flour",
        "2 cups milk",
        "1/2 cup half-and-half cream",
        "1/2 teaspoon vanilla extract",
        "2 tablespoons sherry",
        "1 tablespoon butter",
        "whipped cream (optional)",
        "fresh raspberries (optional)",
        "chocolate curls (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Christmas Trifle",
    "url": "http://allrecipes.com/recipe/218803/christmas-trifle/"
}
