{
    "directions": [
        "Preheat oven to 375°F. Butter and flour four 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line pans with waxed paper. Sift first 4 ingredients into medium bowl. Beat butter and 1 1/2 cups sugar in large bowl until smooth. Beat in vanilla. Beat in flour mixture in 3 additions alternately with milk in 2 additions. Using clean dry beaters, beat whites in another large bowl until soft peaks form. Gradually add remaining 1/2 cup sugar, beating until whites are stiff but not dry. Fold 1/3 of whites into butter mixture. Fold in remaining whites in 2 additions. Divide batter among pans (batter will be about 1/2 inch deep).",
        "Bake cakes until tester inserted into center comes out clean, about 20 minutes. Turn cakes out onto racks; peel off paper. Cool completely.",
        "Mix bourbon, cherries and apricots in small bowl. Cover; let stand at room temperature until most of bourbon is absorbed and fruit softens, at least 3 hours and up to 1 day.",
        "Using electric mixer, beat yolks and sugar in medium bowl until mixture falls in heavy ribbon when beaters are lifted, about 5 minutes. Beat in butter. Transfer yolk mixture to heavy medium saucepan. Stir over medium-low heat until thermometer registers 160°F and mixture is thick, about 15 minutes. Remove from heat; mix in nuts, coconut and fruit mixture. Chill until cold, about 4 hours. Mix in chocolate. (Cake layers and filling can be made 1 day ahead. Wrap cakes; store at room temperature. Cover filling; chill.)",
        "Place 1 cake layer on platter. Spread with 1/3 of filling. Repeat layering of cake and filling 2 more times. Top with final cake layer, pressing slightly.",
        "Chill cake.",
        "Beat cream cheese and 1/4 cup powdered sugar in medium bowl until smooth. Beat in bourbon and vanilla. Beat cream and 1/2 cup powdered sugar in large bowl until soft peaks form. Add cream cheese mixture to whipped cream; beat until stiff enough to spread.",
        "Spread frosting over top and sides of cake. If desired, place pecans around edge of cake. Using rolling pin, flatten apricot halves between sheets of plastic wrap. Cut out leaf shapes. Arrange on cake. (Can be made 2 days ahead. Cover with cake dome; chill.)"
    ],
    "ingredients": [
        "3 1/4 cups sifted all purpose flour",
        "3 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 cups sugar",
        "1 teaspoon vanilla extract",
        "1 cup whole milk",
        "8 large egg whites",
        "3/4 cup bourbon",
        "3/4 cup dried tart cherries",
        "3/4 cup finely chopped dried apricots",
        "8 large egg yolks",
        "1 1/3 cups sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 cup pecans, toasted, chopped",
        "1 cup sweetened flaked coconut",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 1/2 (3-ounce) packages cream cheese, room temperature",
        "3/4 cup powdered sugar",
        "3 tablespoons bourbon",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups chilled whipping cream",
        "Pecan halves (optional)",
        "Dried apricot halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Apricot",
        "Cherry",
        "Pecan",
        "Winter",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Christmas Lane Cake",
    "url": "http://www.epicurious.com/recipes/food/views/christmas-lane-cake-102695"
}
