{
    "directions": [
        "Preheat oven to 350°F. Mix first 5 ingredients in medium bowl. Add butter; stir until moist clumps form. Press mixture over bottom and 1 inch up sides of 10-inch-diameter springform pan. Bake crust until just set, about 5 minutes. Set aside. Reduce oven temperature to 325°F.",
        "Beat cream cheese and sugar in large bowl until blended. Beat in eggs 1 at a time, blending well after each addition. Beat in both extracts. Pour half of mixture into prepared crust; sprinkle with toffee pieces. Pour remaining mixture over. Bake until edges are puffed but center is barely set, about 55 minutes.",
        "Mix sour cream, sugar and vanilla in medium bowl until smooth. Pour topping over hot cheesecake. Bake cake until topping is just set, about 5 minutes. Transfer to rack; cool 10 minutes. Run knife between cake and pan sides. Chill cake uncovered overnight.",
        "Remove pan sides and place cake on platter. Garnish top with candies."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs (from about 5 ounces graham crackers)",
        "1/2 cup toasted almonds, finely chopped",
        "1/2 cup English toffee bits (such as Skor)",
        "2 tablespoons (packed) dark brown sugar",
        "1/4 teaspoon salt",
        "6 tablespoons unsalted butter, melted",
        "4 8-ounce packages cream cheese, room temperature",
        "1 cup (packed) dark brown sugar",
        "4 large eggs",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon almond extract",
        "8 ounces chocolate-covered English toffee (such as Skor or Heath bars), cut into 1/2-inch pieces",
        "1 16-ounce container sour cream",
        "1/2 cup sugar",
        "1 teaspoon vanilla extract",
        "Assorted candies (such as gumdrops and holiday M&M’s)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Christmas Cheesecake with English Toffee Filling",
    "url": "http://www.epicurious.com/recipes/food/views/christmas-cheesecake-with-english-toffee-filling-104513"
}
