{
    "directions": [
        "The day before serving, remove the roast from the package, and dry thoroughly with paper towels. Set the roast on a baking sheet, and place in refrigerator overnight. Remove from refrigerator 1 hour before cooking time to allow meat to reach room temperature. Rub the roast all over with horseradish and Dijon mustard. In a bowl, mix together the kosher salt, black pepper, thyme, and garlic powder; sprinkle the spice mix over the roast.",
        "Preheat oven to 450 degrees F (230 degrees C). Place the celery, carrot, and onion pieces into the bottom of a roasting pan. Place the roast on top of the vegetables.",
        "Roast in the preheated oven for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and roast until the meat is browned and an instant-read meat thermometer inserted into the thickest part of the roast reads 130 to 135 degrees F (54 to 57 degrees C) for medium-rare. Remove from oven, transfer roast to a platter, and cover with a tent of aluminum foil. Allow to rest for 30 minutes. Temperature of the meat will rise about 10 degrees during resting time.",
        "To make au jus sauce, skim excess fat from the pan drippings in the roasting pan. Place the pan over a burner set to medium heat, and stir in the beef base and 1 1/2 cup of water. Bring to a boil, scraping and dissolving any brown flavor bits from the bottom of the pan. Strain out and discard the vegetables. Combine the cornstarch and 1 teaspoon of water in a small bowl, and whisk the mixture into the sauce. Allow the sauce to thicken slightly (sauce will be thin), pour into a gravy boat, and serve with roast."
    ],
    "ingredients": [
        "1 (6 pound) boneless prime rib roast",
        "2 tablespoons prepared horseradish",
        "2 tablespoons Dijon mustard",
        "2 teaspoons kosher salt",
        "2 teaspoons coarsely ground black pepper",
        "2 teaspoons dried thyme",
        "2 teaspoons garlic powder",
        "2 stalks celery, cut into 2-inch pieces",
        "1 carrot, cut into 2-inch pieces",
        "1 small unpeeled onion, quartered and separated",
        "2 teaspoons concentrated beef base (paste)",
        "1 1/2 cups water",
        "1 teaspoon cornstarch",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Christmas Prime Rib",
    "url": "http://allrecipes.com/recipe/219587/christmas-prime-rib/"
}
