{
    "directions": [
        "1. Heat 1 tablespoon of the olive oil in a large pot or Dutch oven over medium-high heat. Add ground beef and cook, breaking up the beef, until nicely browned, about 8 minutes. Remove the ground beef with a slotted spoon and set aside in a large bowl or place. Pour another tablespoon of oil into the pot; when hot, add the stew meat and cook until nicely browned on all side, about 8 minutes. Remove the stew meat with a slotted spoon and add it to the ground beef. Pour off the fat and any accumulated juices from the pot.",
        "2. Heat the remaining 1 tablespoon oil. Add the onion and pepper, and cook until slightly softened, about 4 minutes. Return the meats to the pot and add the tomatoes, tomato sauce, kidney beans, black beans, sugar, Worcestershire, vinegar, chili powder, basil, cumin, salt, and bay leaves. Stir well to mix, breaking up the whole tomatoes with the back of a wooden spoon. Bring to a boil, reduce the heat to a simmer, and cook, covered, until the stew meat is soft, about 2 hours. Remove and discard the bay leaves. Divide the chili among 8 bowls and serve warm, with chips on the side, if you like."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 pound ground beef",
        "1 pound beef stew meat, cut into 1/2 inch chunks",
        "1 large onion, coarsely chopped",
        "1 medium green bell pepper, ribs and seeds removed, coarsely chopped",
        "One 28-ounce can whole plum tomatoes, drained",
        "One 8-ounce can tomato sauce",
        "One 15 1/2 ounce can red kidney beans, rinsed and drained",
        "One 15 1/2 ounce can black beans, rinsed and drained",
        "3 tablespoons packed light brown sugar",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons red wine vinegar",
        "1 tablespoon chili powder",
        "2 teaspoons dried basil",
        "2 teaspoons ground cumin",
        "2 teaspoons kosher salt",
        "2 bay leaves",
        "Tortilla chips, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Beef",
        "Tomato",
        "Stew",
        "Kid-Friendly",
        "Dinner",
        "Meat",
        "Winter"
    ],
    "title": "Chunky Red Chili",
    "url": "http://www.epicurious.com/recipes/food/views/chunky-red-chili-51206840"
}
