{
    "directions": [
        "In a medium sauce pan, stir together water, cornmeal and salt. Bring the mixture to a boil, stirring constantly, until it thickens. Remove from heat and stir in the molasses and shortening. Set aside to cool.",
        "In a large bowl, dissolve the yeast in the warm water. Let sit until creamy, about ten minutes. Add the cornmeal mixture and the whole wheat flour; blend well. Add the bread flour 1/2 cup at a time, stirring well after each addition. When the dough comes together, turn it out onto a lightly floured surface. Knead until smooth and elastic, about 10 minutes. Place the dough in a lightly oiled bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Turn dough out onto a lightly floured surface and flatten. Place 1/3 of the cheese cubes on the flattened dough and fold the dough up to enclose the cubes. Do this twice, until all of the cheese is incorporated into the dough. You may have to let the dough rest for a few minutes between folding. Divide the dough into two equal pieces and form each piece into a round. Place the rounds on lightly greased baking sheets, cover with plastic wrap and let rise until nearly doubled; about 45 minutes.",
        "Divide the dough into two equal pieces and form each piece into a round. Place the rounds on lightly greased baking sheets, cover with plastic wrap and let rise until nearly doubled; about 45 minutes. Preheat the oven to 350 degrees F (175 degrees C).",
        "Bake in the preheated oven for 45 to 55 minutes or until golden brown and the bottom of the loaf sounds hollow when tapped."
    ],
    "ingredients": [
        "1 3/4 cups water",
        "1/2 cup cornmeal",
        "2 teaspoons salt",
        "1/2 cup molasses",
        "2 tablespoons shortening",
        "1 (.25 ounce) package active dry yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "1 cup whole wheat flour",
        "3 1/2 cups bread flour",
        "1 pound processed American cheese, cubed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chunk o' Cheese Bread",
    "url": "http://allrecipes.com/recipe/17249/chunk-o-cheese-bread/"
}
