{
    "directions": [
        "Mix lemon juice, basil, 1 tablespoon onion powder, and salt in a large bowl; toss the shrimp, grouper, and tilapia in the marinade. Remove fish fillets and allow shrimp to continue to marinate.",
        "Heat 1 tablespoon olive oil in a large skillet over high heat and cook grouper and tilapia fillets just until outsides are white, about 3 minutes. Remove fish with a slotted spoon. Cook and stir shrimp in the same skillet until firm and white on the outside, 3 to 5 minutes, sprinkling shrimp with black pepper and 1 more tablespoon onion powder as they cook.",
        "Heat 1 tablespoon olive oil in a large soup pot; cook and stir onion and garlic until onion is translucent and beginning to brown, about 8 minutes.",
        "Transfer shrimp to the soup pot and mix in potatoes, carrots, zucchinis, sweet corn, and cilantro. Stir in water to cover and bring soup to a boil; simmer over medium-low heat until potatoes and carrots are tender, about 30 minutes. Stir in skim milk and coconut cream. Gently mix in grouper and tilapia fillets, bring chowder to a boil, and reduce heat to low. Simmer chowder until fish are no longer translucent and break apart into chunks, about 10 more minutes.",
        "For a thicker chowder, scoop up about 1/2 cup of soup into a small bowl and whisk whole wheat flour into liquid until smooth. Stir the flour mixture into chowder and let simmer until thickened, about 5 more minutes."
    ],
    "ingredients": [
        "1/2 lemon, juiced",
        "1 tablespoon dried basil",
        "1 tablespoon onion powder",
        "1 teaspoon salt",
        "1 1/2 pounds uncooked medium shrimp, peeled and deveined - thawed if frozen",
        "1 pound grouper fillets, thawed if frozen",
        "1 pound tilapia fillets, thawed if frozen",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon ground black pepper",
        "1 tablespoon onion powder",
        "1 tablespoon extra-virgin olive oil",
        "3 cups chopped onion",
        "10 cloves garlic, diced",
        "7 cups peeled, cubed potatoes",
        "3 carrots, sliced",
        "2 zucchinis, sliced",
        "1 cup canned sweet corn kernels, drained",
        "1 cup chopped fresh cilantro",
        "2 quarts water, or as needed to cover",
        "2 cups skim milk",
        "1/3 cup unsweetened coconut cream",
        "1 tablespoon whole wheat flour, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Chunky Fish and Shrimp Chowder",
    "url": "http://allrecipes.com/recipe/223417/chunky-fish-and-shrimp-chowder/"
}
