{
    "directions": [
        "Soak beans in cold water to cover by 2 inches in a bowl at room temperature at least 8 hours, or quick-soak (see cooks' note, below). Drain in a colander.",
        "Pat shanks dry and sprinkle with pepper and 1 teaspoon salt. Heat oil in a wide 6- to 8-quart heavy pot over moderately high heat until hot but not smoking, then brown shanks (in batches if necessary), turning, about 6 minutes total, and transfer with tongs to a bowl.",
        "Cook onion in fat remaining in pot over moderate heat, stirring, until golden, about 5 minutes. Add garlic and cook, stirring, 1 minute. Add browned meat along with any juices accumulated in bowl, carrots, 8 cups water, beef broth, and remaining 1/2 teaspoon salt and simmer, covered, until meat is very tender, about 1 1/2 hours.",
        "Remove shanks with a slotted spoon and transfer to a cutting board. When cool enough to handle, cut meat into 1-inch pieces, discarding bones, and return meat to soup.",
        "Meanwhile, simmer lima beans in remaining 4 cups water in a 4-quart saucepan, covered, until just tender, 20 to 30 minutes. Drain in colander.",
        "Peel potatoes and cut into 1-inch cubes, then add to soup with lima beans and tomatoes with their juice and simmer, covered, until potatoes are tender, about 15 minutes. Add cabbage and green beans and simmer, uncovered, until tender, about 5 minutes."
    ],
    "ingredients": [
        "1/2 lb dried large lima beans (about 1 cup), picked over and rinsed",
        "3 lb meaty crosscut beef shanks (also called beef shins; 2 inches thick), trimmed of excess fat",
        "1/4 teaspoon black pepper",
        "1 1/2 teaspoons salt",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "2 garlic cloves, chopped",
        "3 carrots, halved lengthwise, then cut diagonally into 1 1/2-inch pieces",
        "12 cups water",
        "3 1/2 cups low-sodium beef broth (28 fl oz)",
        "1 lb yellow-fleshed potatoes such as Yukon Gold",
        "1 (14-oz) can diced tomatoes in juice",
        "1/4 lb Savoy cabbage, tough stems discarded and leaves coarsely chopped",
        "1/4 lb green beans, trimmed and cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Tomato",
        "Vegetable",
        "Beef Shank",
        "Lima Bean",
        "Carrot",
        "Winter",
        "Cabbage",
        "Potluck",
        "Gourmet"
    ],
    "title": "Chunky Beef and Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/chunky-beef-and-vegetable-soup-109018"
}
