{
    "directions": [
        "In a large heavy skillet cook the shallot, the onion, and the garlic in the butter over moderate heat, stirring, until the vegetables are golden. Stir in the sage, the cloves, the raisins, the apricots, and salt and pepper to taste and cook the mixture, stirring, for 1 minute. Stir in the wine and boil the mixture until the liquid is evaporated. Remove the skillet from the heat and stir in the bread cubes, the hazelnuts, and salt and pepper to taste. Let the mixture cool before stuffing the hens.",
        "Divide the stuffing among the cavities of the hens, packing the cavities loosely. Truss the hens, sprinkle them with salt and pepper, and arrange them so that they do not touch on the rack of a large, foil-lined broiler pan. Brush the hens with the butter and roast them in the upper third of a preheated 400°F. oven for 1 hour.",
        "While the hens are roasting, in a small saucepan combine the lemon juice, the chutney, and salt and pepper to taste, bring the glaze just to a boil, stirring, and in a blender or food processor purée it. Brush the hens with the glaze, roast them for 15 to 25 minutes more, or until they are golden brown and cooked through, and discard the trussing string.",
        "Toast the hazelnuts in one layer in a baking pan in a preheated 350°F. oven for 10 to 15 minutes, or until they are colored lightly and the skins blister. Wrap the nuts in a kitchen towel and let them steam for 1 minute. Rub the nuts in the towel to remove as much of the skins as possible and let them cool."
    ],
    "ingredients": [
        "1 large shallot, minced",
        "1 onion, minced",
        "1 garlic clove, minced",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3/4 teaspoon crumbled dried sage",
        "1/8 teaspoon ground cloves",
        "1/3 cup golden raisins",
        "1/2 cup chopped dried apricots",
        "1/2 cup dry white wine",
        "4 cups cubed stale homemade-type white bread (about 8 slices), toasted",
        "3/4 cup skinned, lightly toasted hazelnuts, (procedure follows), chopped fine",
        "6 Cornish hens, each weighing about 1 1/4 pounds, rinsed and patted dry",
        "1/2 sticks (1/4 cup) unsalted butter, melted and cooled",
        "1/3 cup fresh lemon juice",
        "an 8 1/2-ounce jar mango chutney (about 3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Roast",
        "Dried Fruit",
        "Raisin",
        "Sage",
        "Hazelnut",
        "Clove",
        "Shallot",
        "Gourmet"
    ],
    "title": "Chutney-Glazed Cornish Hens with Hazelnuts and Dried-Fruit Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/chutney-glazed-cornish-hens-with-hazelnuts-and-dried-fruit-stuffing-11580"
}
