{
    "directions": [
        "Combine cipollini onions, vinegar, and salt in a food processor or blender; puree until nearly smooth. Set aside for 1 hour.",
        "Heat olive oil in a large skillet over medium-high heat; cook and stir onion, red bell pepper, and goat horn peppers in the hot oil until onion softens and begins to turn golden, 7 to 8 minutes. Remove onion mixture to a plate. Cook and stir coppa ham, soppressata, pork loin, and mortadella in the same skillet until warmed through and lightly browned, about 5 minutes.",
        "Spread each ciabatta roll with 1 tablespoon garlic basil spread, 1 tablespoon garlic roasted tomato sauce, 1 tablespoon artichoke aioli, and 1 tablespoon cipollini onion mixture. Top with 1/4 pound mozzarella cheese. Evenly distribute the soppressata mixture among the 4 sandwiches and top with equal amounts of the bell pepper mixture.",
        "Arrange sandwiches on a baking sheet and bake in the preheated oven until the cheese is melted and the bread is toasted, 3 to 4 minutes."
    ],
    "ingredients": [
        "1 pound cipollini onions, peeled and sliced in half",
        "2 tablespoons balsamic vinegar",
        "1 teaspoon salt",
        "1 tablespoon olive oil",
        "1 onion, sliced",
        "1 red bell pepper, sliced",
        "2 goat horn peppers, sliced",
        "1/2 pound thinly sliced coppa ham",
        "1/2 pound thinly sliced soppressata salami",
        "1/2 pound sliced deli roast pork loin",
        "1/2 pound sliced mortadella",
        "4 ciabatta sandwich rolls, sliced horizontally",
        "1/4 cup garlic basil spread (see footnote for recipe link)",
        "1/4 cup garlic roasted tomato spread (see footnote for recipe link)",
        "1/4 cup artichoke aioli (see footnote for recipe link)",
        "1 pound shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ciabatta Sandwich",
    "url": "http://allrecipes.com/recipe/230847/ciabatta-sandwich/"
}
