{
    "directions": [
        "To Make Sponge: In a small bowl stir together 1/8 teaspoon of the yeast and the warm water and let stand 5 minutes, or until creamy. In a bowl stir together yeast mixture, 1/3 cup of the water, and 1cup of the bread flour. Stir 4 minutes, then over bowl with plastic wrap. Let sponge stand at cool room temperature for at least 12 hours and up to 1 day.",
        "To Make Bread: In a small bowl stir together yeast and milk and let stand 5 minutes, or until creamy. In bowl of a standing electric mixer fitted with dough hook blend together milk mixture, sponge, water, oil, and flour at low speed until flour is just moistened; add salt and mix until smooth and elastic, about 8 minutes. Scrape dough into an oiled bowl and cover with plastic wrap.",
        "Let dough rise at room temperature until doubled in bulk, about 1 1/2 hours. (Dough will be sticky and full of air bubbles.) Turn dough out onto a well-floured work surface and cut in half. Transfer each half to a parchment sheet and form into an irregular oval about 9 inches long. Dimple loaves with floured fingers and dust tops with flour. Cover loaves with a dampened kitchen towel. Let loaves rise at room temperature until almost doubled in bulk, 1 1/2 to 2 hours.",
        "At least 45 minutes before baking ciabatta, put a baking stone on oven rack in lowest position in oven and preheat oven to 425  F (220 degrees C).",
        "Transfer 1 loaf on its parchment to a rimless baking sheet with a long side of loaf parallel to far edge of baking sheet. Line up far edge of baking sheet with far edge of stone or tiles, and tilt baking sheet to slide loaf with parchment onto back half of stone or tiles. Transfer remaining loaf to front half of stone in a similar manner. Bake ciabatta loaves 20 minutes, or until pale golden. Cool loaves on a wire rack."
    ],
    "ingredients": [
        "For Sponge (Biga):",
        "1/8 teaspoon active dry yeast",
        "2 tablespoons warm water (110 degrees F/45 degrees C)",
        "1/3 cup warm water",
        "1 cup bread flour",
        "For Bread:",
        "1/2 teaspoon active dry yeast",
        "2 tablespoons warm milk (110 degrees F/45 degrees C)",
        "2/3 cup warm water",
        "1 tablespoon olive oil",
        "2 cups bread flour",
        "1 1/2 teaspoons salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ciabatta",
    "url": "http://allrecipes.com/recipe/6749/ciabatta/"
}
