{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter 2 (8- by 2-inch) round cake pans and dust with flour, knocking out excess.",
        "Whisk together flour (1 1/2 cups), baking powder, cinnamon, salt, nutmeg, cloves, and allspice in a medium bowl.",
        "Combine apple cider and lemon juice in a small measuring cup.",
        "Beat butter in a large bowl with an electric mixer at medium-high speed until light and fluffy, then add brown sugar and beat until combined. Add eggs 1 at a time, beating well after each addition (mixture will look curdled).",
        "Reduce speed to low and add flour mixture and cider mixture alternately in 3 batches, beginning and ending with flour mixture and mixing until just combined.",
        "Divide batter between cake pans (batter will form a thin layer) and rap pans on work surface once to release any large air bubbles.",
        "Bake cake layers until they begin to pull away from sides of pans and a wooden pick or skewer inserted in center of each cake layer comes out clean, 25 to 30 minutes.",
        "Cool cake layers in pans on racks 5 minutes, then run a thin knife around edge of each layer and invert layers onto racks. Cool completely, at least 1 hour.",
        "Whisk together sugar, cornstarch, and salt in a 2-quart heavy saucepan. Whisk in cider, then bring to a boil over moderate heat, whisking constantly, and boil, whisking constantly, 1 minute (mixture will be very thick). Transfer to a metal bowl and set in a larger bowl of ice and cold water, then stir occasionally until cool, about 30 minutes.",
        "Beat butter in a large bowl with cleaned beaters at medium-high speed until light and fluffy, then add one third of cider mixture and beat until incorporated. Add remaining cider mixture and continue beating until smooth.",
        "When cakes are cool, arrange 1 layer flat side up on a flat serving plate or cake stand and spread top with 3/4 cup buttercream. Top with remaining cake layer flat side up. Frost top and side of cake with remaining buttercream. Chill 2 hours before serving (to firm up buttercream)."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened, plus additional for greasing",
        "1 1/2 cups all-purpose flour plus additional for dusting",
        "2 teaspoons baking powder",
        "3/4 teaspoon cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground allspice",
        "2/3 cup apple cider (not filtered)",
        "2 teaspoons fresh lemon juice",
        "1 cup packed light brown sugar",
        "3 large eggs at room temperature for 30 minutes",
        "3/4 cup sugar",
        "3 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "3/4 cup apple cider (not filtered)",
        "2 1/2 sticks (1 1/4 cups) unsalted butter, softened"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Mixer",
        "Dessert",
        "Bake",
        "Apple",
        "Spice",
        "Fall",
        "Cinnamon",
        "Clove",
        "Party",
        "Nutmeg",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cider Spice Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cider-spice-cake-230776"
}
