{
    "directions": [
        "Simmer 1 quart apple cider, salt, allspice, and bay leaves in 20-quart pot 5 minutes, stirring often. Cool completely. Add remaining 3 quarts cider and 4 quarts water. Place turkey in brine. Cover and refrigerate overnight.",
        "Drain turkey and rinse. Arrange on several layers of paper towels in roasting pan. Refrigerate uncovered overnight.",
        "Simmer all ingredients in large saucepan 30 minutes. Strain sage broth into bowl.",
        "Boil cider in saucepan until reduced to 1/4 cup, about 15 minutes. Whisk in butter. Cool completely.",
        "Set rack at lowest position in oven; preheat to 350°F. Remove paper towels from roasting pan. Pat main and neck cavities of turkey dry; stuff loosely with stuffing. Place turkey in pan, tuck wings under, and tie legs together loosely.",
        "Roast turkey 1 hour. Brush with some of glaze. Roast until beginning to brown, about 1 hour. Cover with foil. Roast until thermometer inserted into thickest part of thigh registers 175°F, brushing with glaze every 30 minutes and adding up to 1 cup water to pan if drippings begin to burn, about 3 hours longer. Transfer turkey to platter; tent with foil. Let stand 30 minutes.",
        "Pour pan juices into large measuring cup. Spoon off fat. Reserve 3 tablespoons fat and degreased juices. Pour sage broth into roasting pan. Bring to boil, scraping up browned bits. Combine flour, sage leaves, and reserved 3 tablespoons fat in heavy large saucepan; stir over medium heat 1 minute. Whisk in broth from roasting pan and reserved pan juices. Add applejack and cream and boil until gravy thickens slightly, whisking often, about 4 minutes. Season with salt and pepper. Strain into sauceboat. Serve turkey with gravy."
    ],
    "ingredients": [
        "4 quarts apple cider, divided",
        "1 1/2 cups kosher salt",
        "1/4 cup whole allspice",
        "8 bay leaves",
        "4 quarts cold water",
        "1 20-pound turkey (neck and gizzard reserved)",
        "2 cups low-salt chicken broth",
        "1/2 onion, quartered",
        "1 celery stalk, cut into 4 pieces",
        "8 fresh sage leaves",
        "2 cups apple cider",
        "1/2 cup (1 stick) unsalted butter",
        "8 cups Apple, Sausage, and Parsnip Stuffing with Fresh Sage",
        "3 tablespoons all purpose flour",
        "2 tablespoons fresh sage leaves",
        "1/4 cup applejack brandy or Calvados",
        "1/4 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Brine",
        "Sage",
        "Calvados"
    ],
    "title": "Cider-Brined-and-Glazed Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/cider-brined-and-glazed-turkey-233148"
}
