{
    "directions": [
        "Bring brown sugar, 1 cup salt, 2 bay leaves, 1 tablespoon coriander seeds, 1 teaspoon peppercorns, and 2 cups water to a boil in a medium saucepan. Reduce heat and simmer, stirring occasionally, until sugar and salt dissolve, about 4 minutes. Transfer brine to a large bowl and add cider and 2 cups ice. Let cool.",
        "Place pork and brine in a large (2-gallon) resealable plastic bag. Seal bag and chill at least 8 hours.",
        "Remove pork from brine and pat dry with paper towels. Let sit at room temperature 1 hour.",
        "Toss potatoes and onions with 4 tablespoons oil in a large roasting pan or on a large rimmed baking sheet; season with salt and pepper and set aside.",
        "Place rack in lower third of oven and preheat to 425°F. Using the side of a chef's knife, crush remaining 2 tablespoons coriander seeds. Season pork with salt and pepper and rub all over with crushed coriander. Heat remaining 1 tablespoon oil in a large skillet over medium-high heat. Cook pork until browned on all sides, 8–10 minutes.",
        "Transfer pork to roasting pan and nestle in among vegetables. Tuck remaining 6 bay leaves under kitchen twine over top of pork. Wrap bone tips with foil to prevent burning and roast, turning vegetables halfway through, until an instant-read thermometer inserted in the center of pork registers 140°F, 60–75 minutes.",
        "Remove foil from bones and transfer pork to a cutting board; let rest 30 minutes before slicing between ribs into chops.",
        "DO AHEAD: The pork can be brined 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "1 cup (packed) light brown sugar",
        "1 cup kosher salt plus more",
        "8 bay leaves, divided",
        "3 tablespoons coriander seeds, divided",
        "1 teaspoon black peppercorns plus more freshly ground",
        "1 quart unfiltered apple cider",
        "1 8-bone pork loin roast (about 5 pounds), chine bone removed, rib bones frenched, tied with kitchen twine",
        "6 Yukon Gold potatoes (about 2 pounds), unpeeled, quartered",
        "4 medium red and/or yellow onions, halved, stem ends intact",
        "5 tablespoons olive oil, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Potato",
        "Roast",
        "Christmas",
        "Dinner",
        "Fall",
        "Winter",
        "Christmas Eve",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cider-Brined Pork Roast with Potatoes and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/cider-brined-pork-roast-with-potatoes-and-onions-51193660"
}
