{
    "directions": [
        "Bring 2 quarts cider, 1 cup salt, and the next 10 ingredients to a boil in a very large (16-quart) pot, stirring to dissolve salt and sugar. Let cool to room temperature. Stir in 1 1/2 gallons cold water. Add turkey to brine and press down to submerge. Cover; refrigerate overnight.",
        "Remove turkey from brine and pat dry with paper towels; discard brine. Season lightly inside and out with salt and pepper. Place turkey, breast side up, on a rack set in a large heavy roasting pan and tie legs together with kitchen twine. Let stand at room temperature for 1 hour.",
        "Preheat oven to 375°F. Combine the remaining 1 cup of cider and 3 cups water in roasting pan. Scatter apples around. Brush turkey with butter. Flip breast side down.",
        "Roast turkey, breast side down, basting occasionally, for 1 hour. Using paper towels, flip turkey. Roast, basting occasionally, until an instant-read thermometer inserted into thickest part of thigh registers 165°F, 1-1 1/2 hours longer. transfer turkey to a platter. Let rest for at least 20 minutes before carving.",
        "Meanwhile, strain the juices from the roasting pan into a saucepan, reserving apples. Simmer over medium heat until juices have thickened, about 10 minutes. Serve the cider jus alongside the turkey and apples and garnish with extra star anise pods and cinnamon sticks."
    ],
    "ingredients": [
        "2 quarts plus 1 cup apple cider",
        "1 cup kosher salt plus more",
        "1 cup soy sauce",
        "1/2 cup (packed) light brown sugar",
        "16 whole black peppercorns",
        "8 whole star anise pods plus more for garnish",
        "6 garlic cloves, smashed",
        "6 scallions, white parts only, trimmed, split lengthwise",
        "6 1/4\"-thick slices unpeeled ginger",
        "5 dried shiitake mushrooms",
        "2 3\"-4\" cinnamon sticks plus more"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Cinnamon",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Cider-Brined Turkey with Star Anise and Cinnamon",
    "url": "http://www.epicurious.com/recipes/food/views/cider-brined-turkey-with-star-anise-and-cinnamon-368272"
}
