{
    "directions": [
        "In blender, combine olive oil, ginger, tarragon, orange juice, zest, salt, and pepper and purée until smooth. In large bowl, combine marinade and pheasant and toss to coat. Cover and refrigerate overnight or up to 48 hours.",
        "In very large Dutch oven over moderately high heat, heat olive oil until hot but not smoking. Remove pheasant pieces from marinade, scraping off excess, and sprinkle with salt and 1/2 teaspoon pepper. Working in batches, sear pheasant pieces until well browned, about 5 minutes per side. Transfer to paper towel-lined platter to drain.",
        "Preheat oven to 325°F. Skim off all but 1 tablespoon oil from pan, leaving browned bits at bottom, and set pan over moderately low heat. Add butter and heat until melted. Stir in onions, bay leaf, fennel seeds, salt, remaining 1/2 teaspoon pepper, and sugar. Cook, stirring occasionally, until onions are well caramelized, 30 to 40 minutes.",
        "Return pheasant to pot. Add chicken broth, cider, and wine. (Liquid should cover half of pheasant pieces. Add more chicken broth if necessary.) Raise heat to high and bring liquid to simmer. Add apples, cover, and transfer pot to oven. Braise, turning pheasant pieces occasionally, until meat is cooked through and tender, 45 minutes to 1 hour.",
        "Using tongs or slotted spoon, transfer pheasant to platter and cover with foil to keep warm. Set pot over high heat and bring pan juices to boil. Boil, uncovered, until sauce is well reduced and thickened, about 25 minutes. Taste and add additional salt and pepper, if necessary.",
        "Bring medium pot of water to boil. Add pearl onions and boil, uncovered, 1 minute. Drain and run under cold water until cool enough to handle; slip off skins.",
        "In small skillet over moderately high heat, heat oil until hot but not smoking. Add onions, apples, sugar, salt, and pepper and stir to combine. Sear, shaking pan occasionally, until onions and apples are dark golden, about 10 minutes. Stir in apple cider, scraping up any browned bits in pan. Reduce heat to low, cover, and cook until onions are fork tender, about 2 minutes more.",
        "Spoon some of sauce over pheasant and garnish with onions, apples, and chopped tarragon. Serve additional sauce alongside."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "5 tablespoons fresh ginger, peeled and roughly chopped",
        "3 tablespoons fresh tarragon leaves, whole",
        "1/2 cup freshly squeezed orange juice (from 1 1/2 oranges)",
        "3 tablespoons finely grated orange zest (from 1 1/2 oranges)",
        "Large pinch kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "3 (3-pound) pheasants, each rinsed inside and out, patted dry, cut into 6 pieces",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon unsalted butter",
        "3 large yellow onions, halved and thinly sliced (about 6 cups)",
        "1 bay leaf",
        "1 teaspoon fennel seeds",
        "1 teaspoon table salt",
        "Pinch sugar",
        "2 to 3 cups low-sodium chicken broth, plus additional, if necessary",
        "2 cups apple cider",
        "1 cup dry white wine",
        "3 Granny Smith apples, peeled, cored, and diced",
        "10 ounces pearl onions, root ends trimmed",
        "1 tablespoon extra-virgin olive oil",
        "1 Granny Smith apple, peeled, cored, and cut into 1-inch cubes",
        "2 teaspoons sugar",
        "Pinch kosher salt",
        "Pinch freshly ground black pepper",
        "3 tablespoons apple cider",
        "Fresh tarragon leaves, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fruit",
        "Onion",
        "Braise",
        "Marinate",
        "Thanksgiving",
        "Orange",
        "Apple",
        "White Wine",
        "Fall",
        "Winter",
        "Tarragon"
    ],
    "title": "Cider-Braised Pheasant with Pearl Onions and Apples",
    "url": "http://www.epicurious.com/recipes/food/views/cider-braised-pheasant-with-pearl-onions-and-apples-236322"
}
