{
    "directions": [
        "Position rack in bottom third of oven and preheat to 325°F. Combine first 5 ingredients in small saucepan. Add 1/2 teaspoon cinnamon; bring liquid to boil. Set liquid aside.",
        "Mix 2 quartered apples, onion, thyme, sage leaves and 1/4 teaspoon cinnamon in large bowl.",
        "Rinse turkey inside and out; pat dry. Sprinkle main cavity with salt and pepper. Spoon apple mixture into main cavity. Tuck wing tips under turkey; tie legs together loosely. Place turkey in large roasting pan. Rub turkey breast and legs with butter. Pour half of basting liquid over turkey. Sprinkle with salt and pepper.",
        "Roast turkey 30 minutes. Pour remaining basting liquid over turkey. Roast 2 hours, basting frequently with pan juices and adding 1 cup (or more) water to pan if juices have evaporated. Add all apple slices to pan juices around turkey. Cover turkey loosely with foil to keep from browning too quickly. Continue to roast until apples are tender, turkey is deep brown and thermometer inserted into thickest part of thigh registers 175°F, basting frequently with pan juices, about 1 hour 30 minutes longer.",
        "Transfer turkey to platter. Tent loosely with foil; let stand 30 minutes (internal temperature of turkey will increase 5 to 10 degrees).",
        "Using slotted spoon, transfer apples from pan juices to bowl. Pour pan juices into 4-cup measuring cup. Spoon off fat and discard. Add enough chicken broth to pan juices to measure 4 cups. Transfer broth mixture to large saucepan; simmer 5 minutes. Add reserved apples; simmer 2 minutes. Mix apple cider and cornstarch in small bowl. Whisk into gravy. Boil until gravy thickens, about 2 minutes. Season to taste with salt and pepper.",
        "Discard mixture from turkey cavity. Serve turkey with gravy."
    ],
    "ingredients": [
        "1 cup apple cider",
        "1/4 cup Calvados or applejack (apple brandy)",
        "1/4 cup soy sauce",
        "2 tablespoons apple cider vinegar",
        "2 teaspoons dried rubbed sage",
        "3/4 teaspoon ground cinnamon",
        "10 Golden Delicious apples, peeled, cored, 2 cut into quarters, 8 cut into 8 slices each",
        "1 large onion, sliced",
        "6 fresh thyme sprigs",
        "8 large sage leaves",
        "1 15- to 16-pound turkey",
        "1/4 cup (1/2 stick) butter, room temperature",
        "1 cup (or more) water",
        "2 cups (about) canned low-salt chicken broth",
        "1/4 cup apple cider",
        "2 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Fruit",
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Apple",
        "Winter",
        "Calvados"
    ],
    "title": "Cider-Basted Turkey with Roasted Apple Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/cider-basted-turkey-with-roasted-apple-gravy-104498"
}
