{
    "directions": [
        "Bring 4 cups cider, salt, allspice, and bay leaf to boil in large saucepan, stirring to dissolve salt. Cool completely. Place pork in 13x9x2-inch glass baking dish. Pour brine over. Cover; refrigerate overnight.",
        "Melt 2 tablespoons butter in heavy large skillet over medium-low heat. Add leeks; sauté until tender, about 7 minutes. Add cream and simmer until slightly thickened, about 3 minutes. Season to taste with salt and pepper. (Creamed leeks can be made 1 day ahead. Cover and chill.)",
        "Melt remaining 2 tablespoons butter in large nonstick skillet over medium heat. Add apples and sauté 10 minutes. Add sugar and sauté until apples are golden, about 6 minutes longer. Add stock, then Calvados and remaining 1/4 cup cider. Simmer until liquid thickens slightly and apples are tender, stirring occasionally, about 5 minutes. Set aside. Prepare barbecue (medium heat) or preheat broiler. Drain pork. Rinse under cold water; pat dry. Brush pork with oil. Grill or broil to desired doneness, about 5 minutes per side for medium.",
        "Meanwhile, rewarm leeks, thinning with 1 to 3 tablespoons water if necessary. Bring apples to simmer. Spoon leeks onto plates. Top with pork, then apples."
    ],
    "ingredients": [
        "4 1/4 cups apple cider",
        "3 tablespoons coarse salt",
        "6 allspice berries",
        "1 bay leaf",
        "4 10-ounce bone-in center-cut pork rib chops",
        "4 tablespoons (1/2 stick) butter",
        "5 large leeks (white and pale green parts only), thinly sliced",
        "1 cup whipping cream",
        "1 1/2 pounds Granny Smith apples, peeled, cored, halved, each half cut into 4 wedges",
        "2 tablespoons sugar",
        "1/2 cup chicken stock or canned low-salt chicken broth",
        "1/3 cup Calvados",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Liqueur",
        "Milk/Cream",
        "Pork",
        "Broil",
        "Sauté",
        "Dinner",
        "Apple",
        "Leek",
        "Fall",
        "Brine",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cider-Brined Pork Chops with Creamed Leeks and Apples",
    "url": "http://www.epicurious.com/recipes/food/views/cider-brined-pork-chops-with-creamed-leeks-and-apples-105545"
}
