{
    "directions": [
        "Arrange rack in upper third of oven; preheat to 450°F. Season chicken all over with 1 tsp. salt and 1/2 tsp. pepper, then rub with 1/4 cup mustard, making sure to get mustard under skin.",
        "Heat 2 Tbsp. oil in a large heatproof high-sided skillet or heavy braising pan over medium-high. Sear chicken, skin side down, until golden-brown, about 8 minutes. Turn chicken, then arrange apples and onion around chicken. Add wine and 1 cup cider, then transfer to oven and roast until an instant-read thermometer inserted into thickest part of thigh registers 165°F, about 20 minutes.",
        "Meanwhile, heat remaining 1/2 cup cider, 1 Tbsp. oil, and 1/2 tsp. salt in a large pot over medium; add kale, cover, and cook until wilted. Continue to cook, stirring occasionally, until kale is tender, about 5 minutes. Using slotted spoon, divide kale among plates.",
        "Transfer chicken, apples, and onion to plates with a slotted spoon. Heat remaining liquid in skillet over high. Add cream and remaining 1 tsp. mustard and bring to a boil. Cook, whisking constantly, until sauce is thickened, about 5 minutes. Remove from heat and stir in lemon juice.",
        "Spoon sauce alongside chicken and kale. Garnish with tarragon, if desired."
    ],
    "ingredients": [
        "4 chicken legs (thigh and drumstick; about 3 pounds)",
        "1 1/2 teaspoons kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 cup plus 1 teaspoon country-style Dijon mustard",
        "3 tablespoons vegetable oil",
        "2 pink-skinned apples, cut into 1/2\" wedges",
        "1/2 medium red onion, cut into 1/2\" wedges",
        "1 cup dry white wine",
        "1 1/2 cups fresh apple cider, divided",
        "1 large or 2 small bunches curly kale (about 1 pound), stemmed, torn into pieces",
        "1/4 cup heavy cream",
        "1 teaspoon fresh lemon juice",
        "3 tablespoons tarragon leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Quick and Healthy",
        "Braise",
        "Chicken",
        "Kale",
        "Apple",
        "White Wine",
        "Tarragon",
        "Fall",
        "Wheat/Gluten-Free",
        "Winter",
        "Mustard"
    ],
    "title": "Cider-Braised Chicken With Apples and Kale",
    "url": "http://www.epicurious.com/recipes/food/views/cider-braised-chicken-with-apples-and-kale"
}
