{
    "directions": [
        "Bring salt, brown sugar, peppercorns, coriander seeds, mustard seeds, thyme, bay leaves, 2 cups apple cider, and 2 cups water to a low boil in a medium saucepan over medium heat. Cook, whisking, until sugar and salt dissolve, about 4 minutes. Transfer brine to a large bowl and add remaining 2 cups apple cider and 2 cups ice. Let cool to room temperature.",
        "Place pork and brine in a large resealable plastic bag; turn to coat. Seal and chill at least 8 hours.",
        "Remove pork from brine and pat dry with paper towels. Let sit at room temperature 1 hour.",
        "Place rack in lower third of oven; preheat to 400°F.",
        "Season pork all over with salt and pepper. Heat oil in a large skillet over medium-high. Sear pork, turning occasionally, until browned on all sides (including ends), 10–12 minutes.",
        "Meanwhile, combine mustard, brown sugar, syrup, and thyme in a medium bowl.",
        "Pour apple cider into a large roasting pan or glass baking dish. Transfer pork, fat side up, to pan. Brush all over with mustard mixture. Roast pork, basting every 15 minutes, until an instant-read thermometer inserted into the center registers 140°F, 50–70 minutes.",
        "Transfer to a cutting board and let rest at least 15 minutes before slicing.",
        "Pork can be brined up to 24 hours ahead. Keep chilled in plastic bag."
    ],
    "ingredients": [
        "1 cup kosher salt",
        "1/2 cup (packed) light brown sugar",
        "2 tablespoons black peppercorns",
        "2 tablespoons coriander seeds, lightly crushed",
        "2 tablespoons mustard seeds",
        "12 thyme sprigs",
        "2 bay leaves",
        "4 cups apple cider, divided",
        "1 (5-pound) boneless pork loin (tied if desired)",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons vegetable oil",
        "1/2 cup country Dijon mustard",
        "1/3 cup (packed) light brown sugar",
        "2 tablespoons maple syrup",
        "2 tablespoons thyme leaves",
        "2 cups apple cider"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Easter",
        "Pork",
        "Mustard",
        "Brine",
        "Roast",
        "Coriander",
        "Dinner",
        "Spring",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cider-Brined, Mustard-Glazed Pork Loin",
    "url": "http://www.epicurious.com/recipes/food/views/cider-brined-mustard-glazed-pork-loin"
}
