{
    "directions": [
        "Season both sides of pork cheeks with salt and pepper. Sprinkle with flour and press it into the meat to coat thoroughly.",
        "Heat clarified butter in a pan over medium-high heat. Sear meat on both sides until richly browned, adjusting heat lower if necessary. When cheeks are browned, reduce heat to medium. Transfer cheeks to a plate to rest.",
        "Remove all but 2 tablespoons fat from the skillet. Add onions, carrots, and celery to skillet. Cook and stir until softened and sweet, seasoning with a pinch of salt. Add vinegar and stir to deglaze the pan. Pour in the cider and chicken stock. Bring to a simmer. Add sage and rosemary. Reduce heat to low and transfer cheeks back to pan. Cover. Cook until fork tender but not falling apart, 2 to 3 hours depending on the size of the pork cheeks. Transfer to a plate.",
        "Bring liquid to a boil over high heat, skimming off fat as it rises to the surface. Reduce volume of liquid by about 60 to 70%. Sauce will start to thicken up. Taste for salt and season as needed. Transfer cheeks back to liquid. Continue to cook over medium-low heat until cheeks are heated through and tender and sauce is thick enough to coat cheeks."
    ],
    "ingredients": [
        "8 (4 ounce) pork cheeks",
        "salt and freshly ground black pepper to taste",
        "1/2 cup all-purpose flour for dredging, or as needed",
        "2 tablespoons clarified butter",
        "2 tablespoons apple cider vinegar",
        "2 cups hard apple cider",
        "2 cups homemade or low-sodium chicken broth",
        "1 teaspoon finely chopped fresh sage leaves",
        "1 teaspoon finely chopped fresh rosemary leaves",
        "1 small yellow onion, diced",
        "1 small carrot, diced",
        "1 rib celery, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cider-Braised Pork Cheeks",
    "url": "http://allrecipes.com/recipe/247095/cider-braised-pork-cheeks/"
}
