{
    "directions": [
        "1. Remove the pork from the refrigerator and let stand at room temperature while the oven preheats. Preheat the oven to 450°F. Place a large rimmed baking sheet in the oven and heat until very hot.",
        "2. To cook the vegetables and apples: In a large bowl, toss the sweet potatoes, apples, fennel, and rosemary with the olive oil to coat. Season with salt and pepper. Carefully remove the baking sheet from the oven and spread the vegetables and apples on it. Roast, turning the ingredients over halfway through, for about 15 minutes, or until the potatoes are nicely browned and tender.",
        "3. Meanwhile, cook the pork: Season the pork with salt and pepper. Heat a large heavy skillet over medium-high heat. Add the olive oil, then add the chops to the skillet and cook for about 5 minutes per side, or until golden brown and barely pink when pierced in the center with the tip of a small sharp knife. Transfer to a platter (reserving the oil in the skillet) and let stand for 5 minutes.",
        "4. Pour off all but 1 teaspoon of the oil from the skillet, leaving the brown bits in the pan. Return the pan to medium-low heat, add the apple cider, and bring to a simmer, scraping up the brown bits with a wooden spoon. Whisk in the mustard and simmer for about 2 minutes to reduce the liquid slightly. Remove from the heat and whisk in the butter to lightly thicken the sauce. Season to taste with salt and pepper.",
        "5. Divide the sweet potato mixture among four dinner plates. Place a pork chop alongside the vegetables on each plate. Drizzle with the pan sauce and serve."
    ],
    "ingredients": [
        "4 boneless pork loin chops (each about 7 ounces and 1 inch thick)",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons olive oil",
        "1 cup apple cider or apple juice",
        "1 tablespoon Dijon mustard",
        "2 tablespoons unsalted butter, cut into 2 pieces",
        "1 pound red-skinned sweet potatoes (yams), peeled and cut lengthwise in half, then cut crosswise into 2-inch pieces",
        "2 Pink Lady or Fuji apples, cored and cut lengthwise into eighths",
        "1 large fennel bulb, trimmed and cut lengthwise into eighths",
        "2 sprigs of fresh rosemary, cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Apple",
        "Pork Chop",
        "Sweet Potato/Yam",
        "Fall",
        "Apple Juice",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cider-Dijon Pork Chops with Roasted Sweet Potatoes and Apples",
    "url": "http://www.epicurious.com/recipes/food/views/cider-dijon-pork-chops-with-roasted-sweet-potatoes-and-apples-51163600"
}
