{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Wash rice in several changes of cold water in a bowl until water is almost clear. Soak rice in cold water 30 minutes, then drain well in a sieve.",
        "Spread coconut in a shallow baking pan and toast in oven, stirring occasionally, until pale golden, 10 to 12 minutes. Cool completely.",
        "Cook ginger and jalapeño in 1 tablespoon oil in a 4-quart heavy pot over moderate heat, stirring, until chile is softened, about 2 minutes. Add rice and cook, stirring, until fragrant, about 2 minutes. Stir in water and 1/2 teaspoon salt and bring to a boil, covered. Reduce heat to low and cook, covered, until rice is tender and water is absorbed, 12 to 15 minutes.",
        "Remove from heat and let stand, covered, 5 minutes. Fluff rice with a fork and transfer to a large bowl.",
        "While rice cooks, pulse together coconut, cilantro, scallions, and remaining 2 tablespoons oil and 1/2 teaspoon salt in a food processor until finely chopped.",
        "Add cilantro mixture to cooked rice and stir gently until combined well."
    ],
    "ingredients": [
        "3 cups basmati rice (20 ounces)",
        "3/4 cup sweetened flaked coconut",
        "1 tablespoon finely chopped peeled fresh ginger",
        "1 tablespoon finely chopped fresh jalapeño including seeds (from 1 chile)",
        "3 tablespoons vegetable oil",
        "4 cups water",
        "1 teaspoon salt",
        "2 cups packed fresh cilantro sprigs",
        "4 scallions, chopped (1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ginger",
        "Rice",
        "Side",
        "Coconut",
        "Jalapeño",
        "Cilantro",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cilantro Coconut Rice",
    "url": "http://www.epicurious.com/recipes/food/views/cilantro-coconut-rice-109333"
}
