{
    "directions": [
        "Stir milk and vinegar together in a bowl; set aside until milk \"sours\", about 5 minutes.",
        "Mix flour, white sugar, baking powder, baking soda, and salt together in a separate bowl. Whisk egg, 2 tablespoons melted butter, and 1 1/2 teaspoons vanilla extract into milk mixture. Slowly pour milk mixture into flour mixture while whisking constantly until batter is just moistened and evenly mixed. Lumps are fine.",
        "Combine brown sugar, 1/4 cup melted butter, and cinnamon in a small bowl. Place a 1-quart resealable bag into a glass or cup. Pour cinnamon mixture into the bag; refrigerate until filling is as thick as toothpaste, about 10 minutes.",
        "Mix 1/4 cup softened butter and cream cheese together in a microwave-safe bowl; heat in microwave for 40 seconds. Stir mixture with a whisk or fork until smooth. Continue heating in microwave and stirring until mixture is completely melted. Stir confectioners' sugar and 1/2 teaspoon vanilla extract into cream cheese mixture until icing is smooth.",
        "Heat a griddle or skillet over medium heat and spray with cooking spray. Pour about 2/3 cup batter into the center of griddle. Cook pancake until bubbles start to appear, 2 to 3 minutes. Cut 1 corner off the center of the bag with filling. Swirl filling over pancake, leaving enough space around edges that filling doesn't touch the griddle.",
        "Flip pancake and cook until other side is lightly browned, 2 to 3 minutes. Drizzle icing over pancake. Repeat with remaining ingredients, spraying the griddle with cooking spray between each pancake."
    ],
    "ingredients": [
        "Pancakes:",
        "3/4 cup milk",
        "2 tablespoons white distilled vinegar",
        "1 cup all-purpose flour",
        "2 tablespoons white sugar",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 egg",
        "2 tablespoons butter, melted",
        "1 1/2 teaspoons vanilla extract",
        "Cinnamon Swirl Filling:",
        "5 1/2 tablespoons packed brown sugar",
        "1/4 cup butter, melted",
        "1 1/2 teaspoons ground cinnamon",
        "Cream Cheese Icing:",
        "1/4 cup butter, softened",
        "2 ounces cream cheese, at room temperature",
        "3/4 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "cooking spray"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cinnamon Roll Pancakes",
    "url": "http://allrecipes.com/recipe/244767/cinnamon-roll-pancakes/"
}
