{
    "directions": [
        "Line an 8x8\" baking pan, preferably metal, with plastic wrap, leaving generous overhang on all sides and let chill in freezer 10 minutes.",
        "Meanwhile, blend cream, cinnamon, a pinch of kosher salt, 1/2 cup almond butter, and 1/2 cup brown sugar in a blender, adding 1–2 Tbsp. water if mixture is too thick or looks broken, until smooth and thick but pourable.",
        "Peel away sides of containers from ice cream. Cut ice cream into 2\" pieces and place in a medium bowl. Let sit until slightly softened, about 5 minutes, then stir with a wooden spoon or large rubber spatula until the consistency of thick cake batter. Scrape almond-butter mixture into bowl with ice cream and fold several times with a rubber spatula to create a marbled effect (do not overmix; you want defined ribbons running through). Scrape into prepared baking pan and spread out into an even layer. Smooth top, then bring plastic up and over ice cream. Freeze until hard, about 12 hours.",
        "Line 2 rimmed baking sheets with parchment paper and place in freezer. (Freeze at least 15 minutes before using to ensure they are properly chilled.) Remove baking pan with ice cream from freezer. Use edges of plastic to unmold ice cream and place on a cutting board; peel off plastic. Use a dry hot knife (run under hot water and wipe dry between slices) to cut ice cream into a 6x4 grid to make 24 bars (if ice cream starts to soften, freeze again until firm before proceeding). Place bars on chilled baking sheet, spacing evenly; freeze until firm, 40–45 minutes.",
        "Whisk coconut oil, a pinch of kosher salt, remaining 1 cup almond butter, and remaining 1/2 cup brown sugar in a small bowl until smooth. Working one at a time and using a fork, dip ice cream bars into coconut-oil mixture, allowing excess to drip back into bowl, then place on remaining chilled baking sheet and immediately sprinkle with pretzels and sea salt. Return ice cream to freezer from time to time while you work if it becomes too soft.",
        "Freeze bars until ice cream and nut-butter shells are hard, at least 1 hour, before serving.",
        "Bars can be made 1 week ahead. Once frozen solid, wrap in plastic; keep frozen."
    ],
    "ingredients": [
        "1/4 cup heavy cream",
        "2 teaspoons ground cinnamon",
        "Kosher salt",
        "1 1/2 cups natural almond or other nut butter, divided",
        "1 cup (packed) light brown sugar, divided",
        "2 pints vanilla ice cream",
        "1 cup virgin coconut oil, melted",
        "2/3 cup chopped pretzel sticks",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Frozen Dessert",
        "Dessert",
        "Ice Cream",
        "Cinnamon",
        "Almond",
        "Summer",
        "Kid-Friendly"
    ],
    "title": "Cinnamon Swirl Vanilla Ice Cream Bars",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-swirl-vanilla-ice-cream-bars"
}
