{
    "directions": [
        "In a medium saucepan, bring milk, 1/2 cup cider, butter, 1 tablespoon Stevia In The Raw, and 1/2 teaspoon salt to a boil.",
        "Immediately add flour and cinnamon and stir vigorously with a wooden spoon on the heat until mixture comes together. Continue stirring until dough is smooth and pulls away from sides of pan.",
        "Transfer dough to bowl or stand mixer and cool 10 minutes, stirring occasionally. Add eggs one at a time, stirring to completely incorporate each egg before adding the next. Dough should be smooth and shiny. Stir in apples. Set aside.",
        "In a small saucepan, combine Sugar In The Raw(R), 1/4 cup Stevia In The Raw, and 1/4 cup water. Cook, stirring, over medium-high heat until sugar dissolves. Increase heat to high and cook syrup until deep amber colored, swirling pan as needed to prevent burning.",
        "Remove from heat and slowly add 1/3 cup cider. Stir until smooth. If caramel seems runny, simmer to reduce until thickened and syrupy. Stir in vanilla and 1/2 teaspoon salt. Set aside.",
        "In a large heavy pot or deep skillet, heat oil to 365 degrees F.",
        "Drop tablespoons of dough into oil in batches of 8 and cook until golden all over.",
        "Remove with a slotted spoon and drain on paper towels.",
        "Repeat with remaining dough.",
        "To serve, drizzle beignets with caramel sauce and sprinkle with cinnamon."
    ],
    "ingredients": [
        "1/2 cup 2% milk",
        "1/2 cup apple cider",
        "1/2 cup unsalted butter, cubed",
        "1 tablespoon Stevia In The Raw®",
        "1/2 teaspoon salt",
        "1 cup all-purpose flour",
        "1 teaspoon ground cinnamon",
        "4 eggs",
        "1 granny smith apple, cored and finely diced",
        "1/2 cup Sugar In The Raw®",
        "1/4 cup Stevia In The Raw®",
        "1/4 cup water",
        "1/3 cup apple cider",
        "1 teaspoon vanilla",
        "1/2 teaspoon salt",
        "4 cups vegetable oil for frying",
        "1 teaspoon cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cinnamon Apple Beignets with Caramel Sauce",
    "url": "http://allrecipes.com/recipe/256469/cinnamon-apple-beignets-with-caramel/"
}
