{
    "directions": [
        "1. Preheat the oven to 350°F with the rack in the middle position, and line a rimmed baking sheet with parchment paper.",
        "2. In a large bowl, combine the almond flour, baking soda, and fine sea salt. Use your hands or a pastry cutter to work the pieces of cold butter into the dry ingredients until a crumbly mixture is produced. Then, mix the cinnamon into the almond flour mixture.",
        "3. In a separate bowl, thoroughly whisk together the eggs, apple cider vinegar, and honey.",
        "4. Make a well in the middle of the dry ingredients, and pour the egg mixture into it.",
        "5. Gently mix with a spatula until a wet, chunky dough forms, and then throw in the apple. Combine the ingredients with your hands, and form a ball of dough.",
        "6. On a sheet of parchment paper or a nonstick surface, gently flatten the ball with your hand. The round of dough should be about 3/4 inch thick. Using a pastry cutter or a sharp knife, cut the dough into 6 equal-sized wedges, and arrange them on the parchment-lined baking sheet.",
        "7. Bake for 20 to 25 minutes, rotating the tray halfway through. The scones are ready when they're golden brown, and an inserted toothpick comes out clean. Transfer the scones onto a wire rack to cool slightly before serving.",
        "This isn't just another subpar substitute for the real thing. It's BETTER than scones made with wheat flour!",
        "In the mood for Dark Chocolate Cherry Scones instead? Follow the same recipe, but leave out the cinnamon and apple. Add 1 teaspoon of vanilla extract in step 3. Then, in step 5, add 3 ounces of super dark chocolate, cut into bite-size chunks, and 1/4 cup of dried cherries."
    ],
    "ingredients": [
        "3 cups blanched almond flour",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon fine sea salt",
        "4 tablespoons butter, as cold as possible (preferably frozen), cut into small pieces",
        "1 teaspoon ground cinnamon",
        "2 large eggs",
        "2 tablespoons apple cider vinegar",
        "2 tablespoons honey",
        "1 small Granny Smith or Fuji apple, peeled, cored, and cut into thin tiles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Apple",
        "Almond",
        "Healthy",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cinnamon Apple Scones",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-apple-scones-51217030"
}
