{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 24 cupcake cups or line with paper liners.",
        "Melt 1/2 cup unsalted butter in a saucepan over low heat; stir brown sugar and 2 tablespoons cinnamon into butter until brown sugar has dissolved and cinnamon syrup is hot, about 2 minutes. Set aside.",
        "Sift cake flour with baking powder and salt into a bowl. Whisk milk, egg whites, egg, 1/4 teaspoon vanilla extract, and almond extract together in a separate bowl. Mix 1/2 cup butter at room temperature with white sugar in a large bowl, using an electric mixer until pale yellow and creamy, about 5 minutes. Gradually beat flour mixture into creamed butter mixture, alternating with milk mixture, until batter is well blended. Continue beating for 2 more minutes.",
        "Beat cold cream with an electric mixer and clean beaters in a chilled glass or metal bowl until the cream is fluffy and holds soft peaks, about 4 minutes; fold whipped cream into batter. Divide batter among the prepared cupcake cups, filling them about 2/3 full.",
        "Spoon 1 teaspoon of cinnamon syrup into batter in each cupcake cup. Set remaining cinnamon syrup aside.",
        "Bake cupcakes in the preheated oven until lightly browned and a toothpick inserted into the center of a cupcake comes out with moist crumbs, about 16 minutes. Remove cupcakes from pans and let cool upside down on racks.",
        "Place saucepan with remaining cinnamon syrup over medium heat, stir in pecans, and bring mixture to a low boil. Immediately remove from heat and pour pecan mixture out onto a wooden cutting board. Let pecan mixture cool completely and chop the pecan candy finely.",
        "Beat 1/4 cup butter at room temperature with an electric mixer in a bowl until soft and creamy; beat in cream cheese until blended. Add confectioners' sugar and a drop of vanilla extract and continue to beat on high speed until frosting is fluffy, at least 5 minutes.",
        "Frost cooled cupcakes with frosting and decorate each with a pinch of chopped pecan candy and a sprinkle of cinnamon."
    ],
    "ingredients": [
        "Cinnamon syrup:",
        "1/2 cup unsalted butter",
        "1/2 cup brown sugar",
        "2 tablespoons ground cinnamon",
        "Cake batter:",
        "2 1/2 cups sifted cake flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 cup whole milk at room temperature",
        "2 large egg whites at room temperature",
        "1 egg at room temperature",
        "1/4 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1/2 cup unsalted butter at room temperature",
        "1 1/2 cups white sugar",
        "1/2 cup cold heavy whipping cream",
        "1 cup chopped pecans",
        "Cream cheese frosting:",
        "1/4 cup unsalted butter at room temperature",
        "1 (8 ounce) package cream cheese at room temperature",
        "1 1/2 cups confectioners' sugar",
        "1 drop vanilla extract",
        "1 teaspoon ground cinnamon for sprinkling, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cinnabon® Cupcakes",
    "url": "http://allrecipes.com/recipe/231832/cinnabon-cupcakes/"
}
