{
    "directions": [
        "Whisk first 6 ingredients in large bowl to blend. Add butter. Mash with back of fork until coarse meal forms. Using fingertips, work dough until smooth; shape into disk. Wrap in plastic and chill until firm but not hard, about 30 minutes.",
        "Position rack in center of oven; preheat to 325°F. For wedges, shape dough into 2 disks. Place on 2 heavy baking sheets; cover with plastic. Flatten to 10-inch rounds. Remove plastic. Brush with glaze. Sprinkle with chopped pecans, then raw sugar; press to adhere. For round cookies, shape dough into 1-inch balls; arrange on 2 heavy baking sheets, spacing 2 inches apart. Cover smooth-bottomed glass with plastic. Using glass, press each dough ball to 2-inch round. Cut with scalloped cookie cutter, if desired. Brush with glaze; top with pecan half and sprinkle with raw sugar.",
        "Bake cookies, 1 sheet at a time, until golden, about 30 minutes for large rounds and 22 minutes for small rounds. Cool large rounds on sheets 10 minutes, then cut each into 16 wedges. Cool all cookies completely on sheets. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.",
        "*Also called turbinado or demerara sugar; available at most supermarkets and at natural food stores."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/4 cup sugar",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup cornstarch",
        "1 1/4 teaspoons ground cinnamon",
        "1/4 teaspoon salt",
        "1 cup (2 sticks) unsalted butter, cut into 1/2-inch cubes, room temperature",
        "1 large egg white, beaten to blend with 1 tablespoon water (for glaze)",
        "1 1/2 cups chopped toasted pecans for wedges, or 36 pecan halves for round cookies",
        "Raw sugar*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Pecan",
        "Cinnamon",
        "Christmas Eve",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cinnamon Pecan Shortbread",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-pecan-shortbread-350831"
}
