{
    "directions": [
        "Whisk first 3 ingredients in medium bowl to blend. Using electric mixer, beat butter and brown sugar in large bowl to blend well. Add dry ingredients; beat just until dough forms clumps. Stir in nuts. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 2 hours and up to 1 day. Soften slightly at room temperature before rolling out, if necessary.",
        "Line 3 large baking sheets with parchment paper. Roll out dough on floured surface to 1/8-inch thickness. Dip 3-inch-long crescent-shaped cookie cutter in flour to coat; cut out cookies. Arrange cookies 1 inch apart on prepared baking sheets. Gather dough scraps and reroll. Cut out additional cookies. Refrigerate cookies on sheets 20 minutes.",
        "Meanwhile, preheat oven to 300°F. Bake cookies 1 sheet at a time until pale golden and firm to touch, about 25 minutes. Transfer cookies to racks and cool.",
        "Stir chocolate in top of double boiler over barely simmering water until smooth. Remove from over water. Cool chocolate 10 minutes. Place racks with cookies over rimmed baking sheets. Dip spoon into melted chocolate; wave back and forth over cookies to decorate with zigzag pattern. Chill cookies until chocolate is firm, about 20 minutes. (Can be made 5 days ahead. Store airtight between sheets of waxed paper at room temperature.)"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon (generous) salt",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2/3 cup (packed) golden brown sugar",
        "1/2 cup walnuts, toasted, finely chopped",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Bake",
        "Walnut",
        "Winter",
        "Cinnamon"
    ],
    "title": "Cinnamon, Brown Sugar, and Walnut Shortbread Crescents",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-brown-sugar-and-walnut-shortbread-crescents-108974"
}
