{
    "directions": [
        "Combine milk and butter in glass measuring cup. Microwave on high until butter melts and mixture is just warmed to 120°F to 130°F, 30 to 45 seconds. Pour into bowl of stand mixer fitted with paddle attachment. Add 1 cup flour, sugar, egg, yeast, and salt. Beat on low speed 3 minutes, stopping occasionally to scrape down sides of bowl. Add 21/2 cups flour. Beat on low until flour is absorbed and dough is sticky, scraping down sides of bowl. If dough is very sticky, add more flour by tablespoonfuls until dough begins to form ball and pulls away from sides of bowl. Turn dough out onto lightly floured work surface. Knead until smooth and elastic, adding more flour if sticky, about 8 minutes. Form into ball.",
        "Lightly oil large bowl with nonstick spray. Transfer dough to bowl, turning to coat. Cover bowl with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 2 hours.",
        "Mix brown sugar and cinnamon in medium bowl.",
        "Punch down dough. Transfer to floured work surface. Roll out to 15x11-inch rectangle. Spread butter over dough, leaving 1/2-inch border. Sprinkle cinnamon sugar evenly over butter. Starting at 1 long side, roll dough into log, pinching gently to keep it rolled up. With seam side down, cut dough crosswise with thin sharp knife into 18 equal slices (each about 1/2 to 3/4 inch wide).",
        "Spray two 9-inch square glass baking dishes with nonstick spray. Divide rolls between baking dishes, arranging cut side up (there will be almost no space between rolls). Cover baking dishes with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until almost doubled in volume, 40 to 45 minutes.",
        "Position rack in center of oven and preheat to 375°F. Bake rolls until tops are golden, about 20 minutes. Remove from oven and invert immediately onto rack. Cool 10 minutes. Turn rolls right side up.",
        "Combine cream cheese, powdered sugar, butter, and vanilla in medium bowl. Using electric mixer, beat until smooth. Spread glaze on rolls. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup whole milk",
        "3 tablespoons unsalted butter",
        "3 1/2 cups (or more) unbleached all purpose flour, divided",
        "1/2 cup sugar",
        "1 large egg",
        "2 1/4 teaspoons rapid-rise yeast (from 2 envelopes yeast)",
        "1 teaspoon salt",
        "Nonstick vegetable oil spray",
        "3/4 cup (packed) golden brown sugar",
        "2 tablespoons ground cinnamon",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "4 ounces cream cheese, room temperature",
        "1 cup powdered sugar",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cake",
        "Microwave",
        "Breakfast",
        "Brunch",
        "Bake",
        "Mother's Day",
        "Cream Cheese",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cinnamon Rolls with Cream Cheese Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-rolls-with-cream-cheese-glaze-241631"
}
