{
    "directions": [
        "Butter the bread slices on one side, using half the butter. Arrange them buttered side up on a broiling rack and sprinkle cinnamon sugar over each. Watching carefully, broil a few seconds, until sugar bubbles up. Cut each slice into 4 triangles. Smear the remaining butter inside the baking dish, and fill with the toast triangles, sugar side up.",
        "Make a custard sauce or crème anglaise* with the eggs, yolks, sugar, milk and vanilla, and pour half through a sieve over the toast. Let soak 5 minutes, then sieve on the remaining custard.",
        "Place the dish in a roasting pan and set in the lower-middle of a preheated 350°F. oven. Pour boiling water into the pan to come halfway up the baking dish. Bake for 25 to 30 minutes, keeping the water bath at just below the simmer. It is done when a skewer plunged into the custard an inch from the side comes out clean.",
        "Serve hot, at room temperature, or cold, accompanied with a fruit sauce or cut-up fresh fruits. (It will keep 2 days in the refrigerator.)",
        "Whisk the eggs in a 2-quart stainless-steel saucepan, adding the sugar by spoonfuls. Continue whisking for 2 to 3 minutes, until the yolks are thick and pale yellow and \"form the ribbon.\" By dribbles at first, stir in the hot milk. Set over medium heat, stirring slowly and continuously with a wooden spoon, reaching all over the bottom of the pan as the custard gradually heats and thickens'do not let it come near the boil. If it seems to be getting too hot, lift pan up, then continue as the sauce thickens. You are almost there when surface bubbles begin to disappear and you may see a whiff of steam arise."
    ],
    "ingredients": [
        "4 tablespoons softened unsalted butter",
        "6 or 7 slices white sandwich bread, crusts left on",
        "1/4 cup sugar mixed with 2 tsp ground cinnamon",
        "5 \"large\" eggs",
        "5 egg yolks",
        "3/4 cup sugar",
        "3 3/4 cups hot milk",
        "1 1/2 tablespoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Brunch",
        "Dessert",
        "Bake",
        "Cinnamon"
    ],
    "title": "Cinnamon Toast Flan (a Bread Pudding)",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-toast-flan-a-bread-pudding-104785"
}
