{
    "directions": [
        "Preheat oven to 400°F. Mix walnuts, 4 tablespoons sugar and cinnamon in small bowl. Mix Bisquick and 2 tablespoons sugar in large bowl; add buttermilk and egg and stir until sticky dough forms.",
        "Turn dough out onto work surface sprinkled with Bisquick; knead 6 to 8 turns until smooth. Roll out dough to 12x9-inch rectangle. Spread 2 tablespoons butter over, then sprinkle with walnut-sugar mixture, leaving 1-inch border on all sides. Starting at 1 long side, roll up jelly-roll style. Press roll to flatten slightly. Transfer, seam side down, to ungreased baking sheet.",
        "Using sharp knife, make crosswise cuts 3/4 of the way into roll along 1 long side, spacing cuts 1 inch apart. Shape roll into ring, with cuts facing outward; pinch ends together to seal. Turn cut slices to lie almost on their sides.",
        "Bake cake until deep golden brown and baked through, about 25 minutes. Cool 10 minutes on sheet.",
        "Stir 2 tablespoons butter in small saucepan over medium heat until golden brown, about 3 minutes. Remove from heat. Stir in powdered sugar, 5 teaspoons milk and vanilla, adding more milk by teaspoonfuls if icing is too thick. Drizzle icing over warm cake. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup (scant) finely chopped walnuts",
        "6 tablespoons sugar",
        "2 teaspoons ground cinnamon",
        "3 cups Bisquick (buttermilk baking mix)",
        "3/4 cup buttermilk",
        "1 large egg",
        "4 tablespoons (1/2 stick) unsalted butter, room temperature",
        "3/4 cup powdered sugar",
        "5 teaspoons (or more) whole milk",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Nut",
        "Breakfast",
        "Bake",
        "Walnut",
        "Fall",
        "Cinnamon"
    ],
    "title": "Cinnamon-Walnut Coffee Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cinnamon-walnut-coffee-cake-102191"
}
