{
    "directions": [
        "In a heavy kettle (at least 5 quarts) cook garlic in oil over moderate heat, stirring, until pale golden. Add onion and cook, stirring, until softened. Add pepper flakes and bell pepper and cook, stirring, until softened. Add vinegar and boil until evaporated. Add wine, oregano, and bay leaf and simmer 5 minutes. Stir in tomato purée and tomato paste and bring to a boil.",
        "Add crabs and clams and simmer, covered, 15 to 20 minutes, checking often and transferring clams as they open with tongs to a bowl (discard unopened ones).",
        "Transfer crabs with tongs to a cutting board and remove top shells, adding any crab liquid to soup. Halve or quarter crabs (depending on size) and reserve, with any additional liquid, in a bowl.",
        "Add shrimp, scallops, and fish to soup and simmer, covered, 5 minutes, or until seafood is just cooked through. Stir in gently crabs, their liquid, and clams and sprinkle with parsley."
    ],
    "ingredients": [
        "4 garlic cloves, minced",
        "1/4 cup olive oil",
        "1 medium onion, chopped fine",
        "1/2 teaspoon dried hot red pepper flakes",
        "1 green bell pepper, chopped",
        "1 tablespoon red-wine vinegar",
        "1 1/2 cups dry white wine",
        "1 teaspoon dried oregano, crumbled",
        "1 bay leaf",
        "a 28-to 32-ounce can whole tomatoes including juice, puréed coarse",
        "1 tablespoon tomato paste",
        "2 pounds live hard-shelled crabs",
        "12 small hard-shelled clams, scrubbed well",
        "1/2 pound medium shrimp, shelled, leaving tails and first joint intact",
        "1/2 pound sea scallops",
        "1 pound scrod or other white fish fillet, cut into 1-inch pieces",
        "2 tablespoons minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Herb",
        "Tomato",
        "Clam",
        "Crab",
        "Scallop",
        "Shrimp",
        "Spice",
        "Gourmet"
    ],
    "title": "Cioppino",
    "url": "http://www.epicurious.com/recipes/food/views/cioppino-11527"
}
