{
    "directions": [
        "Cook garlic, onions, bay leaf, oregano, and red pepper flakes with salt and pepper in oil in an 8-quart heavy pot over moderate heat, stirring, until onions are softened, about 5 minutes. Stir in bell pepper and tomato paste and cook, stirring, 1 minute. Add wine and boil until reduced by about half, 5 to 6 minutes. Add tomatoes with their juice, clam juice, and broth and simmer, covered, 30 minutes. Season with salt and pepper.",
        "While stew is simmering, hack crab leg through shell into 2- to 3-inch pieces with a large heavy knife. Add crab pieces and clams to stew and simmer, covered, until clams just open, 5 to 10 minutes, checking every minute after 5 minutes and transferring opened clams to a bowl with tongs or a slotted spoon. (Discard any unopened clams after 10 minutes.) Lightly season fish fillets, shrimp, and scallops with salt and add to stew, then simmer, covered, until just cooked through, about 5 minutes. Discard bay leaf, then return clams to pot and gently stir in parsley and basil.",
        "Serve cioppino immediately in large soup bowls."
    ],
    "ingredients": [
        "4 large garlic cloves, minced",
        "2 medium onions, finely chopped",
        "1 Turkish bay leaf or 1/2 California bay leaf",
        "1 teaspoon dried oregano, crumbled",
        "1 teaspoon dried hot red pepper flakes",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/4 cup olive oil",
        "1 green bell pepper, cut into 1/4-inch dice",
        "2 tablespoons tomato paste",
        "1 1/2 cups dry red wine",
        "1 (28- to 32-ounces) can whole plum tomatoes, drained, reserving juice, and chopped",
        "1 cup bottled clam juice",
        "1 cup chicken broth",
        "1 (1-pound) king crab leg, thawed if frozen",
        "18 small (2-inch) hard-shelled clams (1 1/2 pound) such as littlenecks, scrubbed",
        "1 pound skinless red snapper or halibut fillets, cut into 1 1/2-inch pieces",
        "1 pound large shrimp (16 to 20), shelled (tails and bottom segment of shells left intact) and deveined",
        "3/4 pound sea scallops, tough muscle removed from side of each if necessary",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "3 tablespoons finely chopped fresh basil",
        "Garnish: shredded fresh basil leaves and small whole leaves",
        "Accompaniment: focaccia or sourdough bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Dinner",
        "Snapper",
        "Clam",
        "Scallop",
        "Shrimp",
        "Red Wine",
        "Parsley",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cioppino",
    "url": "http://www.epicurious.com/recipes/food/views/cioppino-106263"
}
