{
    "directions": [
        "Heat oil in a large heavy pot over medium heat. Add onion and cook, stirring occasionally, until softened, 8-10 minutes. Add garlic, basil, oregano, and red pepper flakes; stir until fragrant, about 3 minutes. Remove pot from heat and add wine. Return pot to heat, bring to a boil, and cook until wine is reduced by half, about 4 minutes. Add tomatoes with juices, crushing with your hands as you add them.",
        "Cook, stirring occasionally, until thickened, 15-20 minutes. Add clam juice, parsley, bay leaves, and 8 cups water; season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors meld, 10-15 minutes more. Discard parsley sprigs and bay leaves. DO AHEAD: Broth can be made 2 days ahead. Let cool slightly; chill until cold. Cover and keep chilled. Reheat before continuing.",
        "Heat oil in a large heavy pot over medium heat. Add shallot; stir often until softened, about 3 minutes. Add garlic; stir until fragrant, about 1 minute. Remove from heat; add mussels and wine. Set over medium-high heat, cover, and cook, stirring occasionally, until shells open (discard any that do not open), about 4 minutes.",
        "Add reserved broth; bring to a simmer. Add fish and shrimp. Cover; cook just until opaque, about 4 minutes. Stir in butter; season with salt and pepper. Divide among bowls; top with parsley. Serve with toast."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "4 garlic cloves, chopped",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "1/2 teaspoons crushed red pepper flakes",
        "1 cup dry white wine",
        "1 28-ounce can whole peeled tomatoes",
        "2 8-ounce bottles clam juice",
        "4 sprigs flat-leaf parsley",
        "2 bay leaves",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons olive oil",
        "1 medium shallot, finely chopped",
        "2 garlic cloves, thinly sliced",
        "2 pounds any mix of mussels (debearded), clams, or cockles, scrubbed",
        "1/4 cup dry white wine",
        "1 pound firm skinless white fish fillets (such as sea bass), cut into 1\" pieces",
        "1 pound large shrimp, peeled, deveined, tails left intact",
        "1/4 cup (1/2 stick) unsalted butter, cut into 1/2\" cubes",
        "Kosher salt, freshly ground pepper",
        "Flat-leaf parsley leaves (for serving)",
        "Toasted country bread, rubbed with garlic and olive oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Garlic",
        "Shellfish",
        "Tomato",
        "Dinner",
        "Seafood",
        "Mussel",
        "Shrimp",
        "White Wine",
        "Simmer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cioppino",
    "url": "http://www.epicurious.com/recipes/food/views/cioppino-51149290"
}
