{
    "directions": [
        "Toast fennel seeds in a small skillet over medium heat until fragrant, about 2 minutes. Finely grind in a spice mill; set aside. Heat oil in a large heavy pot over medium-high heat. Add onion, fennel, garlic, bay leaves, oregano, and red pepper flakes. Season with salt and pepper. Cover, and cook, stirring occasionally, until onion and fennel are soft, about 12 minutes.",
        "Stir in ground fennel seeds, tomatoes with juices, wine, clam juice, and 1 cup water. Cover, bring to a boil, reduce heat to medium-low, and cook, stirring often, until flavors meld, about 15 minutes. Stir in fish, mussels, and shrimp and bring to a simmer. Cover and cook for 2 minutes. Add squid, cover, and cook until mussels open and seafood is cooked through, about 5 minutes (discard mussels that do not open). Serve with bread."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds",
        "3 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "1 small (or 1/2 large) fennel bulb, finely chopped",
        "4 garlic cloves, coarsely chopped",
        "3 bay leaves",
        "1 teaspoon dried oregano",
        "1/2 teaspoon crushed red pepper flakes",
        "Kosher salt and freshly ground black pepper",
        "1 28-ounce can whole peeled tomatoes, crushed by hand, juices reserved",
        "1 1/2 cups dry white wine",
        "1 8-ounce bottle clam juice",
        "1 pound skinless fillets haddock or U.S. Pacific cod, cut into 1\" pieces",
        "1 pound mussels, scrubbed, debearded",
        "1 pound large uncooked shrimp, peeled and deveined, or frozen king crab legs, thawed",
        "1 pound cleaned squid, thawed if frozen, bodies cut into 1/2\" rings, tentacles left whole",
        "Country-style bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Shellfish",
        "Tomato",
        "Low Fat",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Seafood",
        "Mussel",
        "Shrimp",
        "Squid",
        "Healthy",
        "Simmer",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cioppino",
    "url": "http://www.epicurious.com/recipes/food/views/cioppino-368957"
}
