{
    "directions": [
        "Mince 2 of the garlic cloves. In a large pot over medium heat, heat oil. Add onion, fennel, celery, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook, stirring occasionally, until softened, 6 to 8 minutes. Add the minced garlic and red-pepper flakes. Continue to cook, stirring constantly, until garlic is golden and fragrant, 1 to 2 minutes more.",
        "Reduce heat to medium-low and add squid. Cook, stirring occasionally, until squid is opaque and tender and the released juices reduce, 15 to 20 minutes. Add tomato paste and oregano and cook, stirring, 1 minute.",
        "Add wine, raise heat to medium-high, and cook until cooking liquid is reduced by half, 5 to 7 minutes. Add tomatoes with their juice, bay leaves, clam juice, and stock. Bring to a boil, reduce to a simmer, and cook, covered, 30 minutes. Stir in 1/4 teaspoon each salt and pepper. Taste and adjust seasoning.",
        "Meanwhile, in a small bowl, mix the butter, 1 tablespoon parsley, lemon zest, and 1/4 teaspoon salt together. Cut remaining garlic clove in half and rub the cut sides on the toasts. Spread the flavored butter on the toasts.",
        "When ready to serve, heat the pot to medium and add clams, cover, and cook for 3 minutes. Stir in the shrimp and mussels. Arrange the fish on top of the stew, cover, and simmer until shellfish opens and fish and shrimp are firm and opaque, about 5 minutes more. Discard bay leaves and stir in remaining 2 tablespoons parsley.",
        "Serve cioppino immediately in large soup bowls with gremolata toasts alongside."
    ],
    "ingredients": [
        "3 garlic cloves, divided",
        "2 tablespoons extra-virgin olive oil",
        "3/4 cup finely chopped onion",
        "1/2 cup packed sliced fennel",
        "1/4 cup finely chopped celery",
        "1 teaspoon kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper, divided",
        "1/2 teaspoon red-pepper flakes",
        "1/2 pound cleaned squid, bodies sliced into 1/2-inch rings, tentacles halved lengthwise if large",
        "1/2 tablespoon tomato paste",
        "1 teaspoon dried oregano",
        "1 cup dry white wine",
        "1 15-ounce can crushed tomatoes",
        "2 bay leaves",
        "1 8-ounce bottle clam juice",
        "1 1/2 cups seafood stock or vegetable broth",
        "1/2 stick (4 tablespoons) unsalted butter, room temperature",
        "3 tablespoons chopped flat-leaf parsley, divided",
        "1/2 teaspoon lemon zest",
        "1 baguette, sliced and toasted",
        "1 pound littleneck clams, soaked in water for 1 hour",
        "1/2 pound medium tail-on shrimp, peeled and deveined",
        "1 pound mussels, scrubbed and de-bearded",
        "1/2 pound skinless flaky white fish such as bass, halibut, hake, or cod, cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Soup/Stew",
        "Fish",
        "Shellfish",
        "Seafood",
        "Clam",
        "Mussel",
        "Shrimp",
        "Squid"
    ],
    "title": "Cioppino Seafood Stew With Gremolata Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/cioppino-seafood-stew-with-gremolata-toasts-51248830"
}
