{
    "directions": [
        "Heat oven to 425°F with rack in lowest position. Discard any excess fat from inside turkey cavity. Pat dry inside and out.",
        "Stir together butter, sage, lemon zest, 1 teaspoon salt, and 1/2 teaspoon pepper in a small bowl. Grate enough zest from orange to measure 1 teaspoon and add to butter mixture. Halve orange lengthwise and save one half for another use. Cut remaining half into wedges.",
        "Starting at wider, thicker end of breast, gently slide an index finger between skin and flesh of breast to loosen skin, leaving skin attached to breast at other end (be careful not to tear skin). Push butter mixture evenly under skin on both sides of breast, and massage skin from outside to distribute butter evenly.",
        "Put turkey on V rack in roasting pan and sprinkle all over with 3/4 teaspoon salt (if using a kosher turkey, see the Cooks' notes) and 1/4 teaspoon pepper. Put orange and red onion wedges in area between rack and breast. Add 1 cup water to pan and roast turkey 30 minutes.",
        "Reduce oven temperature to 350°F. Rotate breast 180 degrees and baste with pan juices, then roast 30 minutes.",
        "Rotate breast again 180 degrees, and baste with pan juices. Tent breast loosely with foil and continue to roast until an instant-read thermometer inserted into thickest part of breast (test both sides, close to but not touching bone) registers 165°F, 25 to 40 minutes longer. (Baste with juices once more; if pan becomes completely dry, add 1/2 cup water.) (Total roasting time: about 1 1/2 hours.)",
        "Transfer turkey to a platter, reserving juices in pan. Let turkey stand, uncovered, 25 minutes. Discard orange and onion wedges.",
        "Pour pan juices through a fine-mesh sieve into 1-quart glass measure (do not clean roasting pan), then skim off and discard fat. (If using a fat separator, pour pan juices through sieve into separator and let stand until fat rises to top, 1 to 2 minutes. Carefully pour pan juices from separator into measure, discarding fat.)",
        "Position roasting pan across 2 burners, then add 1 cup water and deglaze roasting pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour through sieve into glass measure containing pan juices. Add enough turkey stock to pan juices to bring total to 2 1/4 cups (if stock is congealed, heat to liquefy).",
        "Melt butter in a 1 1/2- to 2-quart heavy saucepan over medium-low heat and whisk in flour. Cook roux, whisking, 3 minutes. Add stock mixture in a stream, whisking constantly to prevent lumps, then bring to a boil, whisking occasionally. Stir in any turkey juices accumulated on platter and simmer 5 minutes. Season gravy with salt and pepper."
    ],
    "ingredients": [
        "1 (5- to 6- pound) turkey breast, at room temperature for 1 hour",
        "1 stick (1/2 cup) unsalted butter, well softened",
        "1/4 cup finely chopped fresh sage leaves",
        "1 teaspoon grated lemon zest",
        "Salt",
        "Freshly ground black pepper",
        "1 navel orange",
        "1/2 medium red onion, cut into wedges",
        "1 1/2 to 2 cups brown turkey stock or low-sodium chicken broth",
        "2 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "Special equipment: Flameproof roasting pan (not glass) with a V-rack; instant-read thermometer; 1-quart glass measure"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Lemon",
        "Orange",
        "Sage",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Citrus-Sage Roast Turkey Breast with Gravy: Small Crowd",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-sage-roast-turkey-breast-with-gravy-small-crowd-51137810"
}
