{
    "directions": [
        "Melt butter with oil in heavy large pot over medium heat. Add shallots and sauté until soft, about 4 minutes. Add rice, sprinkle with 1 teaspoon salt, and stir until rice starts to become translucent, 3 to 4 minutes. Add wine and cook until absorbed, stirring often, about 3 minutes. Add 1/2 cup broth and simmer, stirring often, until absorbed, about 3 minutes. Continue to add broth, 1/2 cup at a time, until risotto is creamy and rice is tender, stirring often and allowing broth to be absorbed each time before adding more, about 25 minutes total.",
        "Remove risotto from heat. Mix in fennel pollen and all citrus peels. Season with pepper and more salt, if desired. Spread risotto out on large rimmed baking sheet and cool completely, about 1 hour.",
        "Place cheese in small bowl. Beat eggs and milk in medium bowl. Place panko in another medium bowl. Using wet hands, shape 1 heaping tablespoonful risotto into ball; enclose 1 cheese cube in rice. Dip rice ball into egg mixture, then into crumbs to coat. Place on clean rimmed baking sheet. Repeat with remaining risotto, cheese, and coating. Cover with plastic wrap and chill on sheet at least 6 hours and up to 1 day.",
        "Preheat oven to 300°F. Place large rimmed baking sheet in oven. Pour enough oil into heavy large saucepan to reach depth of 1 1/2 inches. Attach deep-fry thermometer to side of pan. Heat oil over medium-high heat to 340°F to 350°F. Add 4 to 5 arancine at a time; fry until golden brown and crisp, adjusting heat to maintain temperature, about 5 minutes. Transfer to baking sheet in oven to keep warm.",
        "Mound arancine on platter. Garnish with citrus wedges, if desired, and serve hot.",
        "A spice extracted from wild fennel plants; available at specialty foods stores and from zingermans.com.",
        "** Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons extra-virgin olive oil",
        "1/2 cup finely chopped shallots (about 2 large)",
        "1 1/2 cups arborio rice (about 10 ounces)",
        "1 teaspoon salt",
        "3/4 cup dry white wine",
        "4 1/2 to 5 cups low-salt chicken broth, divided",
        "1 teaspoon fennel pollen* or freshly ground fennel seeds",
        "1 teaspoon finely grated orange peel",
        "3/4 teaspoon finely grated lemon peel",
        "1/2 teaspoon finely grated lime peel",
        "30 (about) 1/2-inch cubes Brinata, Etorki, or other young sheep's-milk cheese",
        "3 large eggs",
        "1/4 cup whole milk",
        "3 cups panko (Japanese breadcrumbs)** or fresh breadcrumbs made from crustless French bread",
        "6 cups vegetable oil (about; for deepfrying)",
        "Orange, lemon, and/or lime wedges (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Egg",
        "Rice",
        "Cocktail Party",
        "Oscars",
        "Lemon",
        "Deep-Fry",
        "Engagement Party",
        "Party",
        "Georgia"
    ],
    "title": "Citrus Arancine with Pecorino Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-arancine-with-pecorino-cheese-354832"
}
