{
    "directions": [
        "1. Preheat the oven to 350°F. Lightly grease a 9-inch springform pan with the oil and dust with potato starch.",
        "2. Sift the cake meal and potato starch together over a piece of foil and set aside.",
        "3. In the bowl of an electric mixer, beat the egg yolks on medium speed for 3 minutes, until golden yellow and thick. Add the sugar slowly. Continue to beat 3 minutes more.",
        "4. With the mixer on low, gradually add the orange juice, lemon juice, orange zest, and lemon zest. Add the vanilla and almond extract. Gradually add the matzo meal mixture to the batter. Mix gently until well blended.",
        "5. In a clean bowl, beat the egg whites with the whisk attachment of the electric mixer until foamy. Add the salt and beat until the whites hold glossy peaks. Gently fold the egg whites into cake batter with a spatula. Pour the batter into the springform pan and bake for about 50 minutes, or until a cake tester comes out clean. Cool the cake in the pan, then loosen the sides. Cool completely.",
        "6. Cut the cake into 12 wedges, or carefully slice the cake in half horizontally with a serrated knife and cut into 6 wedges to make 12 total wedges.",
        "7. Toss the strawberries with the orange juice and sugar 30 minutes before serving the cake. Spoon the strawberries over each cake wedge and serve."
    ],
    "ingredients": [
        "Potato starch (for dusting cake pan)",
        "2 teaspoons vegetable oil",
        "1/2 cup matzoh cake meal",
        "3/4 cup potato starch",
        "8 extra-large eggs, separated, at room temperature",
        "1 cup sugar",
        "1/4 cup orange juice",
        "Juice of 1 large lemon",
        "1 teaspoon freshly grated orange zest",
        "1 teaspoon freshly grated lemon zest",
        "1 1/2 teaspoons pure vanilla extract",
        "1/2 teaspoon almond extract",
        "1/4 teaspoon salt",
        "3 pints strawberries, stemmed, washed, and thinly sliced",
        "1/2 cup orange juice",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Mixer",
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Passover",
        "Strawberry",
        "Lemon",
        "Orange",
        "Spring",
        "Kosher"
    ],
    "title": "Citrus Sponge Cake with Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-sponge-cake-with-strawberries-104864"
}
