{
    "directions": [
        "Bring onion, garlic, bay leaf, salt, brown sugar, coriander seeds, fennel seeds, peppercorns, and 2 cups water to a boil in a medium saucepan. Reduce heat and simmer, stirring, until salt and sugar are dissolved. Remove from heat and add 2 cups cold water. Transfer brine to a large heatproof bowl or jar. Squeeze orange and lemon juice into brine and add citrus halves and thyme. Chill until cool.",
        "Place pork in a large resealable plastic bag and add brine. Seal bag, pressing out air, and chill at least 12 hours.",
        "Do ahead: Brine can be made 2 days ahead; cover and keep chilled. Pork can be brined 24 hours ahead; keep chilled.",
        "Remove pork from brine, brushing off any spices. Let stand at room temperature 1 hour before grilling.",
        "Toast coriander and fennel seeds in a small skillet over medium heat, tossing occasionally, until fragrant, about 2 minutes. Let cool, then finely grind in mortar and pestle or spice mill; combine in a small bowl with brown sugar, salt, pepper, and paprika.",
        "Prepare grill for 2-zone heat (for a charcoal grill, bank coals on 1 side of grill; for a gas grill, leave 1 or 2 burners off) and oil grate. Pat pork dry and rub all over with dry rub. Grill over direct heat, bone side up, until lightly charred, about 5 minutes. Turn pork and grill, bone side down, until lightly charred, about 5 minutes more.",
        "Transfer pork to cooler side of grill, bone side up; cover grill. Grill pork, turning occasionally, until an instant-read thermometer inserted into the center of loin registers 145°, 45–60 minutes. (The internal temperature of grill should be 400°; add more charcoal or adjust heat as needed.)",
        "Transfer pork to a cutting board, tent loosely with foil, and let rest 20 minutes. Cut loin from ribs, and slice loin; cut between ribs. Serve with Peach Mustard.",
        "Do ahead: Dry rub can be made 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1/2 medium onion, chopped",
        "2 garlic cloves, peeled, crushed",
        "1 bay leaf",
        "1/2 cup kosher salt",
        "1/4 cup (packed) light brown sugar",
        "1 teaspoon coriander seeds",
        "1 teaspoon fennel seeds",
        "1 teaspoon black peppercorns",
        "1 orange, halved",
        "1 lemon, halved",
        "4 sprigs thyme",
        "1 5-pound center-cut bone-in pork loin, chine bone removed",
        "1 tablespoon coriander seeds",
        "1 tablespoon fennel seeds",
        "1/4 cup (packed) light brown sugar",
        "2 tablespoons kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "1 tablespoon paprika",
        "Vegetable oil (for grilling)",
        "Peach Mustard ( for serving)",
        "Mortar and pestle or spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lemon",
        "Pork Tenderloin",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Thyme",
        "Coriander"
    ],
    "title": "Citrus-Brined Pork Loin with Peach Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-brined-pork-loin-with-peach-mustard-51239860"
}
