{
    "directions": [
        "Heat oven to 425°F with rack in lowest position. Discard any excess fat from inside turkey cavity. Pat dry inside and out.",
        "Stir together butter, sage, lemon zest, 1 teaspoon salt, and 1/2 teaspoon pepper in a small bowl. Grate enough zest from orange to measure 1 teaspoon and add to butter mixture. Quarter orange lengthwise and reserve.",
        "Starting at (smaller) neck cavity, gently slide an index finger between skin and flesh of breast to loosen skin (be careful not to tear skin). Push butter mixture evenly under skin on both sides of breast, and rub skin from outside to distribute butter evenly.",
        "Sprinkle 1 teaspoon salt and 1/4 teaspoon pepper in turkey cavities.",
        "Stuff neck cavity (smaller cavity) with a few orange and onion wedges, then fold neck skin under body and secure with metal skewers.",
        "Stuff larger cavity with remaining onion and orange wedges, then tie drumsticks together with kitchen string and tuck wings under body.",
        "Put turkey on rack in roasting pan and sprinkle skin all over with 1 1/2 teaspoons salt (if you are using a kosher turkey, see the Cooks' note) and 1/2 teaspoon pepper. Add 1 cup water to pan and roast turkey 30 minutes at 425°F.",
        "Reduce oven temperature to 350°F. Rotate turkey 180 degrees and roast 30 minutes. Rotate turkey again 180 degrees and baste with pan juices. Tent turkey loosely with foil and continue to roast, rotating and basting with juices every 30 minutes (if pan becomes completely dry, add 1/2 cup water) until an instant-read thermometer inserted into fleshy part of thighs and thickest part of breasts (test both sides, close to but not touching bone) registers at least 165°F, about 1 1/2 to 2 hours more. (Total roasting time will be 2 1/2 to 3 hours.)",
        "Carefully tilt turkey so juices in large cavity run into pan. Transfer turkey to a platter, reserving juices in pan. Let turkey stand, uncovered, 30 minutes. Discard onions and oranges from large cavity and wait to discard onions and oranges in smaller cavity until they are accessible during carving.",
        "Pour pan juices through a fine-mesh sieve into 2-quart glass measure (do not clean roasting pan), then skim off and discard fat. (If using a fat separator, pour pan juices through sieve into separator and let stand until fat rises to top, 1 to 2 minutes. Carefully pour pan juices from separator into measure, discarding fat.)",
        "Position roasting pan across 2 burners, then add 1 cup water and deglaze roasting pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour through sieve into measure containing pan juices. Add enough turkey stock to pan juices to bring total to 4 cups (if stock is congealed, heat to liquefy).",
        "Melt butter in a 3-quart heavy saucepan over medium-low heat and whisk in flour. Cook roux, whisking, 3 minutes. Add stock mixture in a stream, whisking constantly to prevent lumps, then bring to a boil, whisking occasionally. Stir in any turkey juices accumulated on platter and simmer, stirring occasionally, 5 minutes. Season gravy with salt and pepper."
    ],
    "ingredients": [
        "1 (13- to 15-pound) turkey at room temperature 1 hour, any feathers and quills removed with tweezers or needle-nose pliers, and neck and giblets removed and reserved for giblet stock or another use if desired",
        "1 stick (1/2 cup) unsalted butter, well softened",
        "1/4 cup finely chopped fresh sage leaves",
        "1 teaspoon grated lemon zest",
        "Salt",
        "Freshly ground black pepper",
        "1 navel orange",
        "1 medium red onion, cut into wedges",
        "3 to 4 cups brown turkey stock, giblet stock, or low-sodium chicken broth",
        "1/2 stick (1/4 cup) unsalted butter",
        "6 tablespoons all-purpose flour",
        "Salt",
        "Freshly ground black pepper",
        "Special equipment: 2 small metal skewers; kitchen string; large flameproof roasting pan (not glass) with a flat rack; instant-read thermometer; 2-quart glass measure"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Lemon",
        "Orange",
        "Fall",
        "Sage",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Citrus-Sage Roast Turkey with Gravy: Large Crowd",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-sage-roast-turkey-with-gravy-large-crowd-51137800"
}
