{
    "directions": [
        "Mix hot water and kosher salt in a 54-quart cooler, stirring until the salt dissolves. Mix in vegetable broth, honey, and orange juice. Pour in the ice cubes, place the turkey into the brine with breast side up, and close the cooler lid. Place the cooler in a cold place and let the turkey marinate overnight or up to 12 hours. Brine temperature must stay colder than 40 degrees F (4 degrees C).",
        "Remove turkey from brine, discard brine, and dry the turkey thoroughly with paper towels. Mix vegetable oil with poultry seasoning in a bowl, and rub the turkey with the mixture. Place apple, celery, onion, and orange pieces into the cavity of the turkey.",
        "Preheat an outdoor grill to 400 degrees F (205 degrees C) for indirect heat and lightly oil the grate. Build a 'smoke bomb' by placing about 1 cup of hickory or cherry wood chips into the middle of a 12x12-inch doubled piece of aluminum foil. Gather up the edges of the foil to make a pouch and leave the pouch open at the top. Set the smoke bomb directly onto the coals if grilling with charcoal, or onto the flame bar of a gas grill.",
        "Set the turkey onto the grill in position for indirect heat, insert a probe thermometer into the thickest part of the turkey breast, not touching a bone, and close the grill. Set the probe thermometer for 160 degrees F (70 degrees C).",
        "Grill turkey for 1 hour and check the bird; if skin is already golden brown, cover the breast, legs, and wings with aluminum foil. Replace the smoke bomb with a new one; close cover and continue to grill until probe thermometer registers 160 degrees F (70 degrees C), 2 to 3 more hours. Remove the fruit and vegetable pieces from the cavity, cover turkey with aluminum foil, and let rest for 1 hour before carving."
    ],
    "ingredients": [
        "1 gallon hot water",
        "1 pound kosher salt",
        "2 quarts vegetable broth",
        "2 (8 ounce) jars honey",
        "1 cup orange juice",
        "1 (7 pound) bag of ice cubes",
        "1 (15 pound) whole turkey, neck and giblets removed",
        "1/4 cup vegetable oil",
        "1 teaspoon poultry seasoning",
        "1 Granny Smith apple, cored and cut into large chunks",
        "1 stalk celery, cut into chunks",
        "1 small onion, cut into chunks",
        "1 orange, quartered"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Citrus Honey Brined Smoked Turkey",
    "url": "http://allrecipes.com/recipe/228530/citrus-honey-brined-smoked-turkey/"
}
