{
    "directions": [
        "Lightly beat yolk with milk in a small bowl (reserve white for egg wash).",
        "Pulse together flour, sugar, and salt in a food processor. Add butter and pulse until mixture resembles coarse meal with some roughly pea-size butter lumps. Add yolk mixture and pulse just until dough begins to gather into a ball. Press dough into a ball, then flatten into a 6-inch disk. Chill, wrapped in plastic wrap, at least 1 hour.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Let dough soften slightly at room temperature before rolling out, about 20 minutes.",
        "Roll out dough between sheets of plastic wrap into a 12-inch round. Discard top sheet and invert dough into tart pan (discard remaining plastic wrap). Fit dough into pan, pushing edge of dough to 1/8 inch above rim. Trim dough and save scraps to repair any cracks in partially baked shell.",
        "Freeze shell until firm, about 10 minutes.",
        "Line shell with parchment paper or foil and fill with pie weights.",
        "Bake until edge is golden and bottom is set, about 20 minutes, then carefully remove pie weights and parchment (or foil; gently prick any bubbles with a fork to release air) and bake until bottom is pale golden, 10 to 15 minutes more. Quickly repair any cracks in shell with scraps, then immediately brush hot pastry all over with some egg white. Leave oven on.",
        "Whisk together all filling ingredients until combined well. Put tart shell (in tart pan) on a baking sheet and transfer to oven. Carefully pour filling into shell and put a pie shield or foil strips over rim of pastry to prevent burning.",
        "Bake tart until filling is barely set but trembles slightly in center when gently shaken, 20 to 25 minutes. Cool completely in pan on a rack, about 45 minutes. (Filling will continue to set as it cools.)"
    ],
    "ingredients": [
        "1 large egg, separated",
        "1 tablespoon milk",
        "1 1/4 cups plus 2 tablespoons all-purpose flour",
        "4 teaspoons sugar",
        "1/8 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "4 large eggs",
        "1 1/2 cups sugar",
        "2 teaspoons finely grated (with a rasp) fresh orange zest",
        "1 1/2 teaspoons finely grated (with a rasp) fresh lemon zest",
        "1/2 cup fresh orange juice",
        "1/2 cup fresh lemon juice",
        "1/4 cup heavy cream",
        "Special equipment: a 9 1/2-inch round fluted tart pan with removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Citrus Tart",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-tart-232823"
}
