{
    "directions": [
        "Preheat oven to 450°F. Line a large rimmed baking sheet with foil. Combine 1/4 cup cilantro, lime juice, garlic, 3 teaspoons cumin, and 1/2 teaspoon paprika in a small bowl. Season with salt and pepper. Pour 1/2 cup of marinade into a resealable plastic bag. Add tofu. Seal bag; shake to coat. Let marinate at room temperature, turning occasionally, for 10-15 minutes.",
        "Meanwhile, transfer remaining marinade to a blender. Add 1/4 cup cilantro, 2 tablespoons oil, and honey; purée until smooth. Season sauce with salt and pepper.",
        "Combine onion and peppers in a large bowl. Toss with remaining 2 tablespoons oil, 1/2 teaspoon cumin, and 1/4 teaspoon paprika. Season with salt and pepper.",
        "Drain tofu. Season both sides with salt and pepper and place in a single layer on one side of prepared sheet. Spread vegetables in a single layer opposite tofu.",
        "Roast, stirring vegetables occasionally, until vegetables are tender and tofu is lightly browned, 20-25 minutes.",
        "Divide among plates. Drizzle with sauce. Garnish with remaining 1/4 cup cilantro."
    ],
    "ingredients": [
        "3/4 cup chopped fresh cilantro, divided",
        "2/3 cup fresh lime juice",
        "1/4 cup minced garlic",
        "3 1/2 teaspoons ground cumin, divided",
        "3/4 teaspoon smoked paprika, divided",
        "Kosher salt, freshly ground pepper",
        "1 1-pound block medium (not firm) tofu, cut into 1/2\"-thick slices",
        "4 tablespoons extra-virgin olive oil, divided",
        "1 tablespoon honey",
        "1 medium red onion, cut into 1/4\"-thick rounds",
        "3 red bell peppers, cored, seeded, cut into 1/4\"-thick slices",
        "Ingredient info: Smoked paprika is available at many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pepper",
        "Roast",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "Low Sodium",
        "Tofu",
        "Bell Pepper",
        "Healthy",
        "Low Cholesterol",
        "Lime Juice"
    ],
    "title": "Citrus-Marinated Tofu with Onions and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-marinated-tofu-with-onions-and-peppers-394665"
}
