{
    "directions": [
        "Whisk 4 1/2 tablespoons ice water and yolk in small bowl to blend. Blend flour, oats, brown sugar, lemon peel and salt in processor 30 seconds. Add butter and shortening and process until coarse meal forms. Add yolk mixture and process using on/off turns until moist clumps form. Gather dough together; divide into 2 pieces, 1 slightly larger than the other. Flatten into disks; wrap each in plastic and chill 1 hour or up to 1 day. Let soften slightly at room temperature before rolling.",
        "Preheat oven to 375°F. Roll out larger dough disk on floured surface to 12-inch round. Transfer dough to 9-inch-diameter glass pie dish. Fold overhang under, forming double-thick rim. Crimp, forming high-standing rim. Freeze 15 minutes.",
        "Line crust with foil. Fill with dried beans or pie weights. Bake 10 minutes. Remove foil and beans. Continue to bake until crust is set and looks dry, about 8 minutes. Cool to room temperature. Maintain oven temperature.",
        "Roll out remaining dough disk on floured surface to 12-inch round. Cut into 1/2-inch-wide strips.",
        "Mix 1 cup sugar, cornstarch, orange peel and nutmeg in large bowl. Add all berries and preserves and toss to blend.",
        "Mound filling in crust. Place dough strips atop pie, forming lattice; trim excess. Gently press strip ends to crust. Brush lattice with glaze. Sprinkle with 1 tablespoon sugar.",
        "Place pie on baking sheet. Bake until crust is golden brown and filling bubbles thickly in center, covering edges with foil collar if browning too quickly, about 1 hour 15 minutes. Cool on rack. Serve lukewarm or at room temperature edges with aluminum foil collar if browning too quickly, about 1 hour 15 minutes. Transfer pie to rack and cool. Serve pie lukewarm or at room temperature."
    ],
    "ingredients": [
        "4 1/2 tablespoons ice water",
        "1 large egg yolk",
        "2 1/4 cups all purpose flour",
        "1/3 cup old-fashioned oats",
        "1/4 cup (packed) golden brown sugar",
        "1 tablespoon grated lemon peel",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1/4 cup chilled vegetable shortening, cut into pieces",
        "1 cup plus 1 tablespoon sugar",
        "2 1/2 tablespoons cornstarch",
        "2 teaspoons grated orange peel",
        "1/4 teaspoon ground nutmeg",
        "1 3/4 cups fresh raspberries",
        "1 1/2 cups fresh blueberries",
        "3/4 cup fresh blackberries",
        "1/4 cup blueberry preserves",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Lemon",
        "Orange",
        "Oat",
        "Summer",
        "Chill"
    ],
    "title": "Citrus-Scented Mixed Berry Pie with Oatmeal Lattice Crust",
    "url": "http://www.epicurious.com/recipes/food/views/citrus-scented-mixed-berry-pie-with-oatmeal-lattice-crust-4309"
}
