{
    "directions": [
        "Remove the tough side muscles from scallops, if necessary; slice scallops in half horizontally.",
        "Fill a 1-quart saucepan 3/4 full with salted water and bring it to a boil. Add scallops and reduce heat to a bare simmer. Poach scallops until just cooked through, about 1 minute. Use a slotted spoon to transfer the scallops to a bowl of ice water to stop the cooking process.",
        "Return the water to a boil and poach shrimp in the same manner, transferring them to a bowl of ice water after they become opaque inside and turn pink, 2 to 3 minutes.",
        "Drain the scallops and shrimp well and pat dry; place them in a glass or ceramic bowl and pour in lime juice and orange juice. Cover and refrigerate for 30 minutes.",
        "Pour off most of the juice from the seafood (just leave it moist) and mix in orange zest, red onion, red and yellow bell peppers, tomato, chile pepper, cilantro, salt, cumin, and cayenne pepper. Refrigerate an additional 30 minutes. Just before serving, gently mix in avocado and drizzle the ceviche with olive oil. Serve in martini glasses or stemmed margarita glasses."
    ],
    "ingredients": [
        "1/2 pound sea scallops",
        "1/2 pound shrimp, peeled and deveined",
        "1/2 cup fresh lime juice",
        "2 tablespoons fresh orange juice",
        "1 tablespoon grated orange zest",
        "1/2 cup halved, thinly sliced red onion",
        "1 finely chopped red bell pepper",
        "1 finely chopped yellow bell pepper",
        "1 cup diced seeded tomato",
        "1 small serrano chile pepper, seeded and minced",
        "1/2 cup coarsely chopped fresh cilantro",
        "kosher salt to taste",
        "1/8 teaspoon ground cumin",
        "1/8 teaspoon cayenne pepper (optional)",
        "1 avocado, diced",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "City Ceviche",
    "url": "http://allrecipes.com/recipe/223259/city-ceviche/"
}
