{
    "directions": [
        "Wash leeks well in a bowl of cold water, then lift out and drain well.",
        "Bring 1 cup fresh water to a boil in a 5-quart heavy pot, then add clams and cook over moderately high heat, covered, until clams are fully open, checking every minute after 5 minutes and transferring clams with a slotted spoon to a bowl as they fully open. (Discard any clams that have not opened after 8 minutes.) Pour cooking liquid through a fine-mesh sieve into another bowl.",
        "Remove cooked clams from shells, discarding shells. Coarsely chop clams and transfer to a bowl, then coarsely chop raw oysters and transfer to another bowl. Pour reserved oyster liquor through sieve into bowl with clam cooking liquid.",
        "Cook bacon in cleaned pot over moderate heat, stirring, until crisp, about 6 minutes, then transfer bacon with a slotted spoon to paper towels to drain. Add butter to pot and when foam subsides, cook onion, leeks, celery, and bay leaf, stirring occasionally, until vegetables are softened, 12 to 15 minutes.",
        "While vegetables are cooking, peel potatoes and cut into 1/2-inch cubes. Add wine to softened vegetables and boil until reduced by half, 1 to 2 minutes. Add potatoes, clam cooking liquid, and bottled clam juice. (If potatoes aren't fully covered with liquid, add more clam juice or water.) Simmer, covered, until potatoes are tender, 20 to 25 minutes.",
        "Purée 2 cups soup in a blender until very smooth (use caution when blending hot liquids) and return to pot. Add cream, salt, pepper, Old Bay, and cayenne and cook at a bare simmer, stirring, until soup is heated through (do not let boil). Add clams and oysters and cook, stirring, just until oyster pieces begin to curl, 1 to 2 minutes. Remove from heat and discard bay leaf, then stir in parsley. Serve topped with crumbled bacon."
    ],
    "ingredients": [
        "3 medium leeks (white and pale green parts only), quartered lengthwise and cut crosswise into 1/3-inch-thick slices",
        "1 cup water",
        "40 small (2-inch) hard-shelled clams (4 pounds) such as littlenecks, scrubbed well",
        "30 medium or large oysters, shucked and liquor reserved",
        "3 bacon slices, cut crosswise into 1/2-inch-wide strips",
        "2 tablespoons unsalted butter",
        "1 large onion, chopped",
        "5 celery ribs, cut into 1/3-inch dice",
        "1 Turkish or 1/2 California bay leaf",
        "2 pounds russet (baking) potatoes (4 medium)",
        "1/2 cup dry white wine",
        "2 1/2 cups bottled clam juice or water",
        "1 cup heavy cream",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon Old Bay seasoning",
        "1/8 teaspoon cayenne, or to taste",
        "1/2 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Potato",
        "Lunch",
        "Bacon",
        "Clam",
        "Oyster",
        "Leek",
        "White Wine",
        "Winter",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Clam and Oyster Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/clam-and-oyster-chowder-108719"
}
