{
    "directions": [
        "Carefully open the clams, discarding the top shells, and drain the clam liquid into a small mixing bowl. Set aside. Loosen the clams from the bottom shells but do not remove them. Pour the salt onto a baking sheet so that it is at least 1/2-inch deep and arrange the clams in their half-shells in the salt.",
        "In a 10- to 12-inch sauté pan, heat the oil over medium heat until smoking. Add the onion, garlic, and bell pepper and cook 6 to 7 minutes, until softened and light golden brown. Add the bread crumbs and continue cooking another 3 minutes, until they are light golden brown as well. Remove the mixture from the heat, season with salt and pepper, and cool. Stir in the oregano and the reserved clam liquid.",
        "Preheat the broiler. Pack about 2 teaspoons of the crumb mixture loosely into each clam shell. (Remember that the clam, not the stuffing, is the most important part of this dish; stuffing should surround and enhance the clam, not overpower it.)",
        "Place the clams under the broiler and heat through, about 1 1/2 to 2 minutes, just until the crumb mixture is deep golden brown; you're not really cooking the clam. Drizzle with a drop of olive oil, and serve."
    ],
    "ingredients": [
        "24 medium littleneck clams, scrubbed",
        "3 cups kosher salt",
        "4 tablespoons extra-virgin olive oil, plus extra for drizzling",
        "1 medium red onion, cut into 1/8-inch dice",
        "4 garlic cloves, thinly sliced",
        "1 red bell pepper, cut into 1/8-inch dice",
        "1 cup fresh bread crumbs",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Appetizer",
        "Broil",
        "Sauté",
        "Christmas",
        "Seafood",
        "Clam",
        "Bell Pepper",
        "Fall",
        "Christmas Eve",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Clams With Oregano and Bread Crumbs (*Vongole Origanate*)",
    "url": "http://www.epicurious.com/recipes/food/views/clams-with-oregano-and-bread-crumbs-em-vongole-origanate-em-107537"
}
