{
    "directions": [
        "Toss beans in a medium bowl with a drizzle of oil; season with salt and pepper. Set aside.",
        "Halve fennel and remove fronds (don’t toss the fronds!). Thinly slice one half of fennel and transfer to a medium bowl along with fronds. Place a damp paper towel directly on fennel to help prevent browning and set aside. Finely chop remaining half of fennel, then thinly slice garlic.",
        "Heat 1/4 cup oil in a large heavy pot over medium. Add chopped fennel, garlic, and rosemary sprig and cook, stirring often, until fennel is translucent and tender but still has some bite, about 5 minutes.",
        "While that’s happening, remove 2 wide strips of zest from lemon with a vegetable peeler. Halve lemon and pick out seeds. Coarsely chop parsley.",
        "Add clams and lemon zest to pot, squeeze in juice from a lemon half, cover pot, and cook until some clams start to open, 5–7 minutes. Toss and stir clams; use a slotted spoon to transfer any open ones to a medium bowl. Cover pot and cook until remaining clams open, checking sporadically and transferring them to bowl as they are done, 7–9 minutes; discard any clams that don’t open. Add reserved seasoned beans to pot and stir to combine; loosen sauce with water if it looks too tight. Return clams to pot, add half of parsley, and toss well.",
        "Add remaining parsley to bowl with reserved sliced fennel and squeeze remaining lemon half over. Season fennel-herb salad with salt and pepper and toss to coat. Drizzle with a very small amount of oil and toss again.",
        "Serve clams topped with salad and toasted bread for dipping into sauce."
    ],
    "ingredients": [
        "1 (15-ounce) can baby lima or cannellini beans or other medium white beans, rinsed",
        "1/4 cup olive oil, plus more for drizzling",
        "Kosher salt, freshly ground pepper",
        "1 fennel bulb",
        "3 garlic cloves",
        "1 sprig rosemary",
        "1 lemon",
        "Handful of parsley leaves",
        "36 littleneck or Manila clams, scrubbed",
        "4 thick slices country-style bread, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Clam",
        "Seafood",
        "Shellfish",
        "Bean",
        "Fennel",
        "Steam",
        "Lemon",
        "Dinner"
    ],
    "title": "Clams in White Bean Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/clams-in-white-bean-sauce"
}
