{
    "directions": [
        "In a kettle cook the bacon over moderately low heat until it is crisp and transfer it with tongs to paper towels to drain. Pour off all but 2 tablespoons of the fat, add the butter, and in the fat cook the onion, stirring occasionally, until it is softened and lightly golden. Add the flour and cook the roux, stirring, for 3 minutes. Add the cream, the milk, the reserved clam liquor, and the Worcestershire sauce and cook the mixture, stirring, for 5 minutes, or until it is thickened. Add the potatoes, the clams, the thyme, the parsley, the lemon juice, the bacon, crumbled, and salt and pepper to taste and combine the mixture well.",
        "Divide the dough in half. Roll out one piece of the dough 1/8 inch thick on a lightly floured surface, fit it into a 10-inch (1 1/2 quart capacity) pie plate, and trim the dough, leaving a 1-inch overhang. Pour the filling into the shell. Roll out the remaining dough 1/8 inch thick, arrange it over the filling, and crimp the edge decoratively. Brush the top crust with the egg wash and bake the potpie in the lower third of a preheated 400°F. oven for 35 minutes, or until the crust is golden."
    ],
    "ingredients": [
        "6 slices of lean bacon",
        "2 tablespoons unsalted butter",
        "1 onion, chopped fine",
        "3 tablespoons all-purpose flour",
        "1 cup heavy cream",
        "1 cup milk",
        "1 pint shucked hard-shell clams, chopped coarse, reserving 1/4 cup of the liquor",
        "1/4 teaspoon Worcestershire sauce",
        "3 boiling potatoes, cooked, peeled, and cut into 1/2-inch cubes",
        "1/4 teaspoon dried thyme, crumbled",
        "2 tablespoons finely chopped fresh parsley leaves",
        "1 teaspoon fresh lemon juice",
        "2 recipes pâte brisée",
        "an egg wash made by beating 1 large egg with 2 teaspoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Potato",
        "Shellfish",
        "Bake",
        "Bacon",
        "Seafood",
        "Clam",
        "Fall",
        "Summer",
        "Gourmet"
    ],
    "title": "Clam, Potato, and Bacon Potpie",
    "url": "http://www.epicurious.com/recipes/food/views/clam-potato-and-bacon-potpie-10290"
}
