{
    "directions": [
        "Rinse clams in a strainer to remove any sand.",
        "Heat the olive oil in a large pot (5-quart) over medium to low heat. Add the diced onions, stirring often, until the onions are translucent, about 5 minutes.",
        "Add the sausage and garlic, red pepper flakes, and fennel. Cook until sausage is no longer pink, about 2 minutes. Drain oil.",
        "Increase the heat to medium high. Pour in the wine and bring to a boil until it has reduced to about 3 tablespoons, approximately 5 minutes.",
        "Stir in the Classico(R) Tomato & Basil sauce and bring to a quick boil. Add the clams, cover, and cook until clam shells open, 8 to 10 minutes. Check often to avoid overcooking.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Mix together remaining 2 tablespoons olive oil, 2 cloves minced garlic, salt, and cracked pepper. Brush mixture on both sides of the baguette slices.  Arrange slices on a baking sheet.",
        "Bake until its golden brown, 8 to 10 minutes.",
        "Ladle the clams and sauce into bowls; top with fresh parsley and shaved parmesan cheese.  Serve with the crostini."
    ],
    "ingredients": [
        "48 littleneck clams, scrubbed and rinsed",
        "4 tablespoons olive oil, divided",
        "1/4 cup Vidalia onion, diced",
        "3/4 pound bulk hot Italian sausage",
        "8 large cloves garlic, minced, divided",
        "1/4 teaspoon crushed red pepper flakes, or to taste",
        "1 teaspoon fennel seed",
        "1 cup dry white wine",
        "1 (24 ounce) jar Classico® Tomato and Basil Sauce",
        "2 tablespoons minced fresh flat-leaf parsley",
        "2 tablespoons shaved Parmesan cheese",
        "Crostini:",
        "1 French baguette, sliced into 1/4 inch rounds",
        "Cracked black pepper",
        "Coarse sea salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Clams and Sausage in Spicy Marinara with Crostini",
    "url": "http://allrecipes.com/recipe/238621/clams-and-sausage-in-spicy-marinara-w/"
}
