{
    "directions": [
        "Bring garlic and 4 cups water to a boil in a medium saucepan. Drain. Repeat process twice more. On final turn, do not drain; reduce heat and simmer until garlic is tender, 20-30 minutes. Drain; reserve garlic.",
        "Cook clams and 1/4 cup water in a large pot over medium-high heat, covered, stirring occasionally, until clams open, about 5 minutes (discard any clams that do not open); transfer to a large bowl. Strain clam cooking liquid through a fine-mesh sieve into a small bowl. Remove clams from shells and coarsely chop. Place in a medium bowl, cover, and chill.",
        "Purée reserved garlic, 1/2 cup clam cooking liquid, and 2 tablespoons oil in a blender, adding more cooking liquid by the tablespoonful, until smooth and creamy.",
        "Preheat oven to 500°F. Cook bacon in a medium skillet over medium heat until fat renders and bacon is slightly crisp, about 5 minutes; transfer to a paper towel-lined plate.",
        "Cut pizza dough in half. Working with 1 piece at a time and keeping other piece covered with a damp towel or plastic wrap, gently stretch dough into 12\"-14\" rounds and transfer to lightly oiled baking sheets. Spread dough with garlic purée and top with Pecorino, clams, and bacon. Bake pizzas until cheese is melted and crust is brown and crisp, 10-15 minutes. Drizzle with oil and top with parsley and red pepper flakes."
    ],
    "ingredients": [
        "2 heads of garlic, separated into cloves, peeled",
        "24 littleneck clams, scrubbed",
        "2 tablespoons olive oil plus more",
        "8 ounces thick-cut bacon, sliced crosswise 1/4\" thick",
        "1 pound prepared pizza dough, room temperature",
        "1 ounce Pecorino, finely grated (about 1/2 cup)",
        "Fresh flat-leaf parsley leaves and crushed red pepper flakes (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Bake",
        "Dinner",
        "Lunch",
        "Bacon",
        "Seafood",
        "Clam",
        "Party",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Clam and Bacon Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/clam-and-bacon-pizza-51187020"
}
