{
    "directions": [
        "Preheat oven to 500°F. Fill a large bowl with boiling water. Place a baking sheet over; dust with flour. Place dough on baking sheet; cover loosely with plastic wrap and let sit for 10 minutes to soften. Flip dough; cover and let sit 10 minutes longer.",
        "Meanwhile, drain clams, reserving liquid. Cook bacon in a 12\" cast-iron skillet over medium heat, stirring occasionally, until lightly browned, 4-5 minutes. Transfer bacon to a paper towel-lined plate. Add garlic and shallot to drippings in skillet and cook, stirring occasionally, until softened, about 2 minutes. Stir in chard and 1/2 cup reserved clam liquid and cook, stirring, until chard is just wilted, about 2 minutes. Season to taste with salt and pepper. Stir in butter, vinegar, and as many clams as you'd like. Transfer mixture to a medium bowl.",
        "Wipe out skillet and heat over medium-high heat until very hot. Roll out dough on a lightly floured surface to a 12\" round. Sprinkle skillet with cornmeal and transfer dough to skillet. Brush top of dough with oil. Cook, shaking pan occasionally and turning pan to avoid hot spots, until bottom of dough is golden and crispy, 6-8 minutes.",
        "Spread chard mixture over dough. Bake until crust is golden and cooked through, 6-8 minutes. Scatter bacon and cheese over; cook just until cheese is melted, 2-3 minutes longer."
    ],
    "ingredients": [
        "All-purpose flour (for dusting)",
        "1 1-pound store-bought pizza dough",
        "1 10-ounce can whole baby clams",
        "2 slices thick-cut bacon (2 ounces), cut into 1\"-wide pieces",
        "3 garlic cloves, thinly sliced",
        "2 tablespoons minced shallot",
        "1 1-pound bunch Swiss chard, center stalks removed, leaves torn",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon unsalted butter, cut into 1/2\" cubes",
        "1 tablespoon white wine vinegar",
        "1/2 teaspoon yellow cornmeal",
        "1 tablespoon good-quality extra-virgin olive oil",
        "1/2 cup finely grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Bacon",
        "Clam",
        "Chard",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Clam, Chard, and Bacon Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/clam-chard-and-bacon-pizza-388658"
}
