{
    "directions": [
        "Cut off chicken wing tips, reserving them for another use (such as stock). Arrange wings in one layer in a 13- by 9-inch glass baking dish and sprinkle them evenly with 1/2 cup kosher salt. Turn wings over and sprinkle with 1/2 cup more salt. Chill wings 2 hours.",
        "In a colander rinse wings under cold running water and drain. Arrange wings in one layer in baking dish and thinly slice onions. Arrange onions over wings and pour buttermilk over onions. Chill wings, covered, at least 12 hours and up to 1 day.",
        "Discard onions and in colander drain wings. Have ready an 18-inch sheet of wax paper. In a large shallow bowl whisk together flour, peppercorns, cayenne, and remaining 2 tablespoons salt. Working with no more than 2 wings at a time, dredge wings evenly in flour mixture and shake off excess. Arrange wings flat sides up and a few inches apart on wax paper and let stand 15 minutes. Generously sprinkle remaining flour mixture over wings, patting it to adhere, and let stand 15 minutes more.",
        "Have ready a rack set over a baking pan. In each of two 10- to 11-inch heavy skillets melt 1 cup shortening and 4 tablespoons butter over high heat just until butter begins to turn golden. To each skillet add 8 or 9 wings, flat sides down, and reduce heat to moderately high. Cook wings, covered, until deep golden, 8 to 10 minutes. Turn wings and cook, uncovered, until deep golden, about 8 minutes. With tongs transfer wings to rack set over pan to drain."
    ],
    "ingredients": [
        "3 pounds chicken wings (16 to 18)",
        "1 cup plus 2 tablespoons coarse salt",
        "2 onions",
        "3 cups buttermilk",
        "2 cups all-purpose flour",
        "2 teaspoons cracked black peppercorns",
        "1 teaspoon cayenne",
        "2 cups vegetable shortening",
        "1 stick (1/2 cup) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Appetizer",
        "Fry",
        "Kid-Friendly",
        "Summer",
        "Gourmet"
    ],
    "title": "Claritha's Fried Chicken Wings",
    "url": "http://www.epicurious.com/recipes/food/views/clarithas-fried-chicken-wings-15307"
}
