{
    "directions": [
        "In a small bowl, whisk together flour and sugar. Set aside.",
        "In a small bowl, mix milk and cream. Chill until needed.",
        "Place the apples in a medium bowl. Add the lemon juice and toss with a spatula until the apples are well coated.",
        "Place the granulated sugar, brown sugar, tapioca starch, cornstarch, Chinese five-spice powder, and salt in a small bowl and whisk to combine. Pour the dry ingredients into the bowl of apples and mix until the apples are again well coated. Set aside to macerate for at least 25 minutes.",
        "Place a colander over a medium bowl and transfer the macerated apples to the colander, making sure to scrape down the side of the bowl to get all the juices, sugars, and starches. Let the apples drain for 25 minutes.",
        "Pour the drained juice into a small saucepan, scraping down the side and bottom of the bowl to get every drop. Bring the apple juice to a boil over medium-high heat, stirring constantly. Reduce heat and continue to boil the apple juice gently until it thickens, about 2 minutes. Remove from the heat and set aside to cool. Once it is room temperature, chill the saucepan in the refrigerator for about 20 minutes.",
        "Sprinkle Crust Dust into the empty pie shell. Pour in the apples, making sure to scrape out any dry ingredients or juices that stick to the side of the bowl. Make a well in the middle of the apples and pour in the thickened apple juice. Gently smooth the pie filling with a spatula and dot with the butter. Finish the pie with the second crust, following Epi's double-crust pie instructions, then freeze for at least 20 minutes.",
        "Preheat the oven to 400°F (200°C).",
        "Brush the top of pie with Pie Wash and bake for 45 minutes to 1 hour, rotating 180 degrees every 20 minutes, until the crust is dark golden brown and the juices are bubbling thickly through the vents. Cool for at least 2 hours before slicing."
    ],
    "ingredients": [
        "1/2 teaspoon all-purpose flour",
        "1/2 teaspoon sugar",
        "1 tablespoon whole milk",
        "1 tablespoon heavy cream",
        "1 double-crust All-Butter Pie Dough shell",
        "8 cups (960 grams) apples, peeled and chopped into bite-sized pieces (roughly 1 inch long by 3/4-inch thick [2.5cm by 19mm])",
        "1 tablespoon (16 grams) lemon juice",
        "3/4 cup (150 grams) granulated sugar",
        "3 tablespoons (45 grams) dark brown sugar",
        "1 tablespoon plus 1 teaspoon (10 grams) tapioca starch",
        "1 tablespoon (9 grams) cornstarch",
        "1 teaspoon (2 grams) Chinese five-spice powder",
        "1/2 teaspoon (1.5 grams) kosher salt",
        "1 tablespoon (14 grams) unsalted butter, cut into small pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Apple",
        "Fall",
        "Tapioca",
        "Anise",
        "Cinnamon",
        "Bake",
        "Dessert"
    ],
    "title": "Classic Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/classic-apple-pie"
}
