{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "For the meatballs: In a large bowl, combine the breadcrumbs, Parmesan, basil, parsley, milk, ketchup if using, tomato paste, salt, pepper, eggs, garlic and onions. Using a wooden spoon, stir to blend. Add the ground turkey and sausage meat. Using fingers, gently mix all the ingredients until thoroughly combined.",
        "Using a 1-ounce cookie scoop or a small ice cream scoop, form the meat mixture into 1 1/2-inch balls (22 to 24 meatballs). Place the meatballs on a heavy nonstick baking sheet, spacing apart. Drizzle with olive oil and bake until cooked through, 15 minutes.",
        "For the tomato sauce: Heat the olive oil in a large deep skillet with 2-inch-high sides over medium-high heat. Add the garlic, onions, salt and pepper. Cook for 5 to 6 minutes. Add 1/2 cup of the basil, the fennel, oregano and crushed tomatoes. Bring to a simmer. Cook over medium heat until the sauce thickens slightly, stirring occasionally, 15 to 20 minutes. Stir in the remaining 1/4 cup basil. Adjust the seasoning with more salt and pepper if desired.",
        "Add the meatballs to the tomato sauce and simmer until the meatballs are heated through, about 10 minutes. Thin the sauce with chicken stock, 1/4 cup at a time, if needed.",
        "Serve with grated Parmesan alongside."
    ],
    "ingredients": [
        "1 cup plain breadcrumbs",
        "1/2 cup finely grated Parmesan, plus more for serving",
        "1/4 cup chopped fresh basil",
        "1/4 cup chopped fresh Italian parsley",
        "1/4 cup whole milk, at room temperature",
        "1 tablespoon ketchup, optional",
        "1 tablespoon tomato paste",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 large eggs, at room temperature",
        "2 cloves garlic, minced",
        "1 small onion, finely chopped",
        "1 pound ground dark turkey meat",
        "1 pound spicy Italian turkey sausage links, casings removed",
        "Extra-virgin olive oil, for drizzling",
        "1/4 cup extra-virgin olive oil",
        "3 large cloves garlic, smashed and peeled",
        "1 large onion, finely chopped 1 teaspoon kosher salt, plus more to season",
        "1/2 teaspoon freshly ground black pepper, plus more to season",
        "3/4 cup chopped fresh basil",
        "2 teaspoons finely ground fennel seeds",
        "2 teaspoons dried oregano",
        "Two 28-ounce cans crushed tomatoes",
        "1/2 cup low-sodium chicken broth, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Meatball",
        "Italian",
        "Meatballs",
        "Sausage Recipes",
        "Poultry Recipes",
        "Turkey Recipes"
    ],
    "title": "Classic Italian Turkey Meatballs",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/classic-italian-turkey-meatballs-recipe"
}
