{
    "directions": [
        "Char, peel, and prep the ginger and onion: Use medium heat on a gas or electric coil burner, medium-hot heat on an outdoor grill or barbecue, or the broil setting in an oven (have the rack in the top or second position). Regardless, let the skin get a little splotchy with black; use tongs to occasionally rotate the ginger and onion (or shallot) and to grab and discard any flyaway skin. When working indoors, turn on the exhaust fan and open a window. To steady the aromatics on the stove, use a small grilling rack, heavy-duty broiling rack, or oven-safe cooling rack.",
        "Monitor the aromatics because they char at different rates due to their uneven size and shape. After 10 to 15 minutes, they’ll have softened slightly and become sweetly fragrant. Bubbling at the root or stem ends may happen. You do not have to blacken the entire surface. Remove from the heat and let cool for about 10 minutes.",
        "Remove the charred skin from the cooled onions or shallots, and as needed, rinse under running water to dislodge stubborn dark bits. Trim off and discard the blackened root and stem ends; halve or quarter each and set aside.",
        "Use a vegetable peeler or the edge of a teaspoon to remove the ginger skin. Rinse under warm water to remove blackened bits. Halve the ginger lengthwise, cut into chunks, then bruise lightly (use the broad side of a knife or a meat mallet). Set aside to add to the stockpot.",
        "When shopping, select firm, solid onions or shallots. If using shallots, big ones endure the charring best. Choose ginger that’s relatively straight; side knobs and little branches make it harder to char and peel. To avoid feeling rushed, char and peel the aromatics a day in advance and refrigerate; cut and bruise before using. Set aside.",
        "Wield a heavy cleaver or knife suitable for chopping bones to whack the bones and parts: Break them partway or all the way through to expose the marrow, making the cuts at 1 1/2-inch (3.75 cm) intervals. Work efficiently, with the flatter side of each part facing down. Direct the action from your wrist (not elbow). Imagine vanquishing a foe.",
        "Switch attention to the whole chicken. Look in the body cavity for the neck, heart, gizzard, and liver. If included, add the neck (first give it a few whacks), heart, and gizzard to the parts bowl; the liver may dirty and impart an off flavor, so save it for something else.",
        "Since wings tend to fall off during cooking, detach each one: bend it back (like a long arm stretch) and cut off at the shoulder/armpit joint. Whack each wing a few times and add to the parts bowl. Set the wingless bird aside.",
        "To achieve a clear broth, parboil and rinse the chicken parts; use a medium stockpot, about 12-quart (12 l) capacity. After rinsing off the impurities, quickly scrub the pot, and return the parts to it. Add the wingless chicken, breast side up. Pour in the water and make sure the chicken is submerged. Partially cover and bring to a boil over high heat. Uncover and lower the heat to gently simmer.",
        "Use a ladle or skimmer to remove scum that rises to the top. Add the ginger and onions, plus the coriander seeds, cloves, cilantro, rock sugar, and salt. Readjust the heat to gently simmer uncovered.",
        "After 25 minutes, the wingless chicken should be cooked; its flesh should feel firm yet still yield a bit to the touch. Use tongs to grab and transfer the chicken to a large bowl. Flush it with cold water, drain well, then set aside for 15 to 20 minutes to cool. Meanwhile, keep the broth simmering.",
        "When the chicken can be handled, use a knife to remove each breast half and the whole legs (thigh and drumstick). Don’t cut these pieces further, or they’ll lose their succulence. Set on a plate to cool completely, then cover, and refrigerate for up to 3 days or freeze for up to 3 months; bring to room temperature for bowl assembly.",
        "Return the leftover carcass and remaining bony bits to the stockpot. Adjust the heat to gently simmer for 1 1/2 hours longer. Total simmering time is roughly 2 1/4 hours, depending on the chicken’s cooling time.",
        "When done, let rest for 20 minutes to settle the impurities and further concentrate the flavor. Skim some fat from the broth, then use a slotted spoon to remove most of the bony parts, dumping them into a bowl for refuse. Strain the broth through a muslin-lined mesh strainer positioned over a large pot. Discard the solids. You should yield about 4 quarts (4 l).",
        "If using the broth right away, season it with the fish sauce and extra salt. When making the broth ahead, partially cover the unseasoned broth, let cool, then refrigerate for up to 3 days or freeze for up to 3 months; reheat and season before using.",
        "About 30 minutes before serving, ready ingredients for the bowls. Soak dried noodles in hot water until pliable and opaque; drain, rinse, then let drain well. If using fresh noodles, untangle or separate them, and snip as needed. Divide them among 8 soup bowls.",
        "Prep the chicken, discarding the skin, if you want. Set aside. Place the onion, green onion, and cilantro in separate bowls and line them up with the noodles and pepper for a pho assembly line.",
        "Bring the broth to a simmer over medium heat. At the same time, fill a pot with water and bring to a rolling boil for the noodles.",
        "For each bowl, place a portion of the noodles in a noodle strainer or mesh sieve and dunk in the boiling water. When the noodles are soft, 5 to 60 seconds, pull the strainer from the water, shaking it to let water drain back into the pot. Empty the noodles into a bowl. Top with chicken, then add the onion, green onion, and cilantro. Finish with pepper.",
        "Taste and check the broth flavor again, adjust if desired, then raise the heat and bring it to boil. Ladle about 2 cups (480 ml) of broth into each bowl. Serve immediately with extras at the table."
    ],
    "ingredients": [
        "Chubby 4-inch (10 cm) section ginger, unpeeled",
        "1 pound (450 g) yellow onion, unpeeled",
        "3 pounds (1.35 kg) chicken parts, such as backs, necks, wings, feet, and drumsticks",
        "1 (4-lb | 1.8-kg) whole chicken, rinsed and patted dry",
        "5 quarts (5 l) water",
        "2 tablespoons coriander seeds",
        "4 whole cloves",
        "1 small bunch (1 oz | 30 g) cilantro",
        "1/2 ounce (15 g) Chinese yellow rock sugar",
        "1 1/2 tablespoons fine sea salt",
        "About 3 tablespoons fish sauce",
        "1 1/4 pounds (565 g) dried narrow flat rice noodles, or 2 pounds (900 g) fresh pho noodles",
        "Cooked chicken from the broth, cut or torn into bite-size pieces about 1/4-inch (6-mm) thick",
        "1/2 medium (3 oz | 90 g) yellow or red onion, thinly sliced against the grain and soaked in water for 10 minutes",
        "3 or 4 thinly sliced green onions, green parts only",
        "1/2 cup (.35 oz | 10 g) chopped fresh cilantro, leafy tops only",
        "Pepper (optional)",
        "Optional extras: Garnish Plate for 8, Ginger Dipping Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Noodle",
        "Winter",
        "Dinner",
        "Ginger",
        "Coriander",
        "Cilantro"
    ],
    "title": "Classic Chicken Pho (*Phở Gà*)",
    "url": "http://www.epicurious.com/recipes/food/views/classic-chicken-pho-ph-ga"
}
