{
    "directions": [
        "Preheat the oven to 300 degrees F. Lay the bread slices in one layer (it's OK if they overlap a little) on a baking sheet. Bake the slices (to dry them out a little) for 6 minutes, then flip and bake for 6 minutes more. Set aside to cool. Reduce the oven temperature to 200 degrees F.",
        "Whisk together the eggs, half-and-half, granulated sugar, cinnamon, vanilla and salt in a large casserole dish.",
        "Heat a large nonstick skillet over medium-low to medium heat. Place 2 slices of bread in the egg mixture. Let the bread completely soak in the egg mixture on both sides, about 30 seconds to 1 minute total, checking after 15 seconds. (Bread should feel heavy and soaked through but hold its shape without breaking apart.) Melt a tablespoon of butter in the skillet and add the 2 soaked slices; cook until the outside is golden brown and crisp and the inside is cooked through, 4 to 5 minutes per side. You will need to watch and adjust the temperature between medium and medium-low if the bread is browning too quickly or not browning fast enough. Keep finished French toast slices warm on a rack nested in a rimmed baking sheet in the oven. Repeat with the remaining slices.",
        "Serve with a dusting of confectioners' sugar and drizzle of maple syrup."
    ],
    "ingredients": [
        "8 slices Texas Toast or other 3/4-inch-sliced white bread",
        "8 large eggs",
        "1 1/2 cups half-and-half",
        "3 tablespoons granulated sugar",
        "2 teaspoons ground cinnamon",
        "2 teaspoons pure vanilla extract",
        "1/8 teaspoon kosher salt",
        "4 tablespoons butter",
        "Confectioners' sugar, for serving",
        "Maple syrup, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "French Toast Recipes",
        "Egg Recipes"
    ],
    "title": "Classic French Toast",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/classic-french-toast"
}
