{
    "directions": [
        "To make the marinade, in a bowl, stir together the olive oil, vinegar, lemon juice, rosemary, sugar, garlic and pepper. Use immediately, or cover and refrigerate for up to 1 day before using.",
        "Measure and set aside 1/4 cup of the marinade. Place the beef cubes in a large sealable plastic bag and pour in the remaining marinade. Seal the bag, squish the marinade around the meat, and marinate at room temperature for 1 hour or preferably overnight in the refrigerator.",
        "About 30 minutes before you are ready to begin grilling, remove the beef from the refrigerator. Discard the marinade. In a bowl, combine the mushrooms, onions, zucchini and oil and toss to coat. Season with salt and pepper. If using wooden skewers, soak 6 to 12 skewers in water for 30 minutes.",
        "Prepare a hot fire in a grill. Brush and oil the grill grate.",
        "Thread the beef and vegetables onto the skewers, dividing them evenly and starting and ending with a cube of meat, until the skewers are full. Thread any leftover vegetables onto a separate skewer.",
        "Place the skewers on the grill directly over the heat and brush with some of the reserved marinade. Cook for 3 to 4 minutes, then turn the skewers and brush with more marinade. (Tongs are perfect for turning the kabobs.) Continue cooking for 3 to 4 minutes more for medium-rare. The vegetables should be cooked but firm, and the meat should give easily when pressed.",
        "Brush the skewers with the marinade a final time, then transfer to a platter and let rest for about 5 minutes. Slide the beef and vegetables off the skewers onto the platter and serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Grill Master,",
        "by Fred Thompson (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "3/4 cup olive oil",
        "1/3 cup red wine vinegar",
        "1/4 cup fresh lemon juice",
        "1 Tbs. finely chopped fresh rosemary",
        "2 tsp. sugar",
        "1 garlic clove, pressed",
        "1/2 tsp. freshly ground pepper",
        "",
        "1 lb. top sirloin, cut into 1-inch cubes",
        "12 cremini mushrooms",
        "2 small red onions, each cut into 6 wedges",
        "1 zucchini, halved lengthwise and cut into 12 half-moons",
        "2 Tbs. canola oil",
        "Kosher salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Classic Beef Kabobs",
    "url": "http://www.williams-sonoma.com/recipe/classic-beef-kabobs.html"
}
