{
    "directions": [
        "Heat oil in a large heavy pot over medium-high heat. Add onions, celery, and carrots. Saute until soft, 8-10 minutes. Add beef, veal, and pancetta; saute, breaking up with the back of a spoon, until browned, about 15 minutes. Add wine; boil 1 minute, stirring often and scraping up browned bits. Add 2 1/2 cups stock and tomato paste; stir to blend. Reduce heat to very low and gently simmer, stirring occasionally, until flavors meld, 1 1/2 hours. Season with salt and pepper.",
        "Bring milk to a simmer in a small saucepan; gradually add to sauce. Cover sauce with lid slightly ajar and simmer over low heat, stirring occasionally, until milk is absorbed, about 45 minutes, adding more stock by 1/4-cupfuls to thin if needed. DO AHEAD: Ragu can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm before continuing.",
        "Bring a large pot of water to a boil. Season with salt; add pasta and cook, stirring occasionally, until 1 minute before al dente. Drain, reserving 1/2 cup pasta water. Transfer ragu to a large skillet over medium-high heat. Add pasta and toss to coat. Stir in some of the reserved pasta water by tablespoonfuls if sauce seems dry. Divide pasta among warm plates. Serve with Parmesan."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "2 medium onions, finely chopped (about 1 1/2 cups)",
        "2 celery stalks, finely chopped (about 1 cup)",
        "2 carrots, peeled, finely chopped (about 3/4 cup)",
        "6 ounces ground beef (85% lean)",
        "6 ounces ground veal",
        "3 ounces thinly sliced pancetta, finely chopped",
        "1/2 cup dry red wine",
        "3 cups (about) beef stock or chicken stock, divided",
        "3 tablespoons tomato paste",
        "Kosher salt and freshly ground black pepper",
        "1 cup whole milk",
        "1 pound tagliatelle or fettuccine (preferably fresh egg)",
        "Finely grated Parmesan (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pasta",
        "High Fiber",
        "Father's Day",
        "New Year's Day",
        "Dinner",
        "Lunch",
        "Meat",
        "Winter",
        "Poker/Game Night",
        "Potluck",
        "Noodle",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Classic Ragu Bolognese",
    "url": "http://www.epicurious.com/recipes/food/views/classic-ragu-bolognese-365181"
}
