{
    "directions": [
        "Position a rack in the lower third of an oven. Place a pizza stone on the rack and preheat the oven to 450ºF. Let the stone heat for 45 to 60 minutes.",
        "Place a large sheet of parchment paper on a pizza peel or large rimless baking sheet and place the dough in the center. Coat your fingers with olive oil and press the dough from the center outward into a 12-inch round with a slightly raised edge. If the dough springs back, cover it with a clean kitchen towel and let it rest for a few minutes, then continue. The thinner the dough is, the crisper the crust will be. Cover the dough round with a clean kitchen towel and let rise for 15 minutes. Meanwhile, in a small bowl, stir together the tomato sauce and the 1 Tbs. pizza seasoning.",
        "Brush the raised edge of the dough with a light coating of olive oil. Spread the dough evenly with the tomato sauce, leaving a 1/2-inch border. Sprinkle the mozzarella over the sauce, then top with the pepperoni and Parmigiano-Reggiano. Sprinkle lightly with pizza seasoning. Carefully slide the pizza-topped parchment paper onto the hot pizza stone. Bake until the crust is golden brown and the cheese is bubbling, 9 to 12 minutes.",
        "Using the pizza peel or rimless baking sheet, remove the pizza from the oven, transfer it to a cutting board and let stand for 2 minutes. Cut the pizza into slices and serve immediately. Makes one 12-inch pizza; serves 2 to 4.",
        "Adapted from a recipe by Williams-Sonoma."
    ],
    "ingredients": [
        "1 ball Thin Crust Pizza Dough",
        "Olive oil as needed",
        "3/4 cup purchased or homemade tomato sauce",
        "1 Tbs. pizza seasoning, plus more for sprinkling (optional)",
        "2 oz. low-moisture whole-milk mozzarella cheese, shredded",
        "2 oz. thinly sliced pepperoni (see note above)",
        "2 oz. Parmigiano-Reggiano cheese, shaved with a vegetable peeler"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Classic Pepperoni Pizza (Pizza Seasoning)",
    "url": "http://www.williams-sonoma.com/recipe/classic-pepperoni-pizza.html"
}
