{
    "directions": [
        "Combine potatoes, potato water, butter, sugar, salt and hot water in large mixing bowl.  Stir until butter melts; set aside and let cool.  Combine yeast and 1/2 cup warm water in small bowl. Let rest 5 minutes. Add eggs, 2 cups flour and yeast mixture to potato mixture. Beat until well mixed. Continue adding flour, 1 cup at a time until soft dough forms.",
        "Knead on a lightly floured surface until smooth and elastic (about 4 to 6 minutes), OR knead with electric mixer using dough hook. Place in a greased bowl, turning to coat. Cover.",
        "Let rise in a warm, draft free area about 1 hour, until doubled in size.  Punch dough down; divide in half.",
        "Roll one portion of dough on a lightly floured surface to a 12 x 18-inch rectangle.  Spread with half the butter.  Combine sugar and cinnamon; sprinkle half of the mixture over surface.    Roll up tightly lengthwise, sealing edges.  Cut into 12 slices.  Place in greased 13 x 9-inch pan.  Repeat with remaining dough.  Cover.",
        "Let rise 30 to 45 minutes until nearly doubled.",
        "Bake in preheated 350 degrees F oven for 25 to 30 minutes.",
        "Cool for 15 minutes.  Combine icing ingredients and drizzle over rolls."
    ],
    "ingredients": [
        "Rolls:",
        "1 cup mashed potatoes",
        "1 cup reserved potato water",
        "3/4 cup butter OR margarine",
        "3/4 cup sugar",
        "2 teaspoons salt",
        "1 cup hot water",
        "2 envelopes Fleischmann's® Active Dry Yeast",
        "1/2 cup warm water (100 to 110 degrees F)",
        "2 eggs",
        "8 1/2 cups all-purpose flour, or more if needed",
        "Filling:",
        "1/2 cup butter OR margarine, softened",
        "1 cup sugar",
        "1 1/2 teaspoons Spice Islands® Ground Saigon Cinnamon",
        "Icing:",
        "3 cups powdered sugar",
        "6 tablespoons butter OR margarine, softened",
        "1 teaspoon Spice Islands® 100% Pure Bourbon Vanilla Extract",
        "5 tablespoons milk, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Classic Cinnamon Rolls",
    "url": "http://allrecipes.com/recipe/215379/classic-cinnamon-rolls/"
}
