{
    "directions": [
        "Rinse the cabbage, and then quarter the heads lengthwise. Place the pieces in a large pot or bucket, and sprinkle 1 tablespoon of the salt over them. Set aside for 1 hour.",
        "Rinse the cabbage under cold running water, and pat it dry. Cut the cabbage into 1-inch pieces, put them in a large bowl, and toss with the remaining 3 tablespoons salt. Let sit for 2 hours. The salt will draw out moisture from the cabbage.",
        "Drain off the accumulated liquid and lightly rinse the cabbage. In a large bowl, combine the cabbage with all the remaining ingredients, and toss well. Transfer the mixture to a large crock and push the mixture down to force the liquid to rise to the top, somewhat submerging the cabbage in its spicy surroundings. Cover it with a lid and store it in a cool, dark place for 3 days to ferment and mature.",
        "Once the kimchi is tasting all kinds of yummy, transfer it to clean jars (I like quarts), cap them, and store in the fridge (which will inhibit further fermentation) for up to a month or process according to the jar manufacturer's directions to store on the shelf for up to 9 months."
    ],
    "ingredients": [
        "6 pounds Napa cabbage",
        "4 tablespoons kosher salt",
        "2 tablespoons light brown sugar",
        "1/3 cup minced garlic",
        "1/3 cup minced fresh ginger",
        "1/4 cup hot smoked paprika (pimentón)",
        "1/4 cup Korean chile powder",
        "1 tablespoon crushed red pepper flakes",
        "2 tablespoons freshly squeezed lime juice",
        "1/2 cup Asian fish sauce",
        "1/2 cup brine shrimp (available in a jar at Asian food stores), finely chopped",
        "2 bunches scallions, cut into 1/2-inch pieces (about 12 scallions)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Low Fat",
        "Low Cal",
        "Healthy",
        "Cabbage",
        "Green Onion/Scallion"
    ],
    "title": "Classic Cabbage Kimchi",
    "url": "http://www.epicurious.com/recipes/food/views/classic-cabbage-kimchi-56389571"
}
