{
    "directions": [
        "Preheat oven to 275°. Line a small roasting pan with foil. Mix cumin, garlic powder, and smoked paprika in a small bowl. Rub spice mix all over pork. Sprinkle with salt and pepper. Place pork in pan and cover with sliced onion. Pour 1/2 cup water in the bottom of pan. Cover pan tightly with foil and roast until meat is very tender, 5-6 hours. Let pork rest until cool enough to handle.",
        "Using 2 forks, shred pork into bite-size pieces. Skim fat from juices in roasting pan; reserve meat. DO AHEAD: Can be made 2 days ahead. Cover and chill pork and juices separately.",
        "Heat oil in a large pot over medium-low heat. Add onion and sauté until translucent, about 5 minutes. Add garlic and cook, stirring often, until fragrant, about 2 minutes. Add the diced fresh tomatoes and stir until softened, about 2 minutes longer. Stir in broth and next 5 ingredients. Bring to a boil and reduce heat to low. Cover; simmer, stirring occasionally, for 30 minutes.",
        "Add reserved pork to posole. Simmer uncovered 30 minutes longer for flavors to meld. Season to taste with salt and pepper, adding reserved juices from roast pork, if desired. Divide among bowls, garnish with shredded cheese, cilantro, and lime wedges, and serve with flour tortillas."
    ],
    "ingredients": [
        "1 tablespoon ground cumin",
        "1 teaspoon garlic powder",
        "1 teaspoon smoked paprika",
        "1 2-pound boneless pork shoulder (Boston butt)",
        "Kosher salt and freshly ground black pepper",
        "1/2 red onion, sliced",
        "1/4 cup vegetable oil",
        "1/2 red onion, chopped",
        "3 garlic cloves, minced",
        "2 plum tomatoes, diced",
        "6 cups low-salt chicken broth",
        "1 28-ounce can undrained pinto beans",
        "1 28-ounce can white hominy, drained",
        "1 28-ounce can diced tomatoes with juices, puréed in blender until smooth",
        "1 tablespoon oregano (preferably Mexican)",
        "2 teaspoons ground cumin",
        "Kosher salt and freshly ground black pepper",
        "Shredded mild cheddar",
        "Chopped fresh cilantro",
        "Lime wedges",
        "Flour tortillas",
        "Ingredient info: Smoked paprika and hominy are sold in most supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Pork",
        "Tomato",
        "Low Cal",
        "Dinner",
        "Lunch",
        "Meat",
        "Legume",
        "Hominy/Cornmeal/Masa",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Classic Posole",
    "url": "http://www.epicurious.com/recipes/food/views/classic-posole-380590"
}
