{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease two 8-inch round cake pans and line with parchment paper.",
        "Beat 3/4 cup butter and white sugar together in a large bowl with an electric mixer until pale and creamy, about 2 minutes. Add eggs one a time, mixing well between each addition. Add 1 teaspoon vanilla extract; beat briefly until well-blended in the batter. Continue beating batter until bubbles appear on the surface, about 2 minutes more.",
        "Sift flour, baking powder, and salt into the bowl. Gently fold with a spoon just until smooth. Divide the batter evenly between the prepared pans, smoothing the tops with a cake spatula.",
        "Bake in the preheated oven until cakes are golden brown and a toothpick inserted into the center comes out clean, about 20 minutes. Cool in the pans for 5 minutes before inverting onto a wire rack to cool completely, about 30 minutes.",
        "Beat confectioners' sugar, 1/4 cup butter, and 1 teaspoon vanilla extract together in a bowl to make a smooth buttercream.",
        "Place one cake layer, flat-side up, on a serving platter. Spread buttercream evenly onto the cake with a spatula. Spread raspberry jam in an even layer over the buttercream, right to the edges. Place second layer, flat-side down, over the filling."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter, softened, divided",
        "Cake:",
        "3/4 cup unsalted butter, softened, plus additional for greasing",
        "3/4 cup white sugar",
        "3 eggs, at room temperature",
        "1 teaspoon vanilla extract",
        "1 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "Filling:",
        "1/3 cup confectioners' sugar",
        "1/4 cup unsalted butter, softened",
        "1 teaspoon vanilla extract",
        "1/3 cup seedless raspberry jam"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Classic Victoria Sponge Cake",
    "url": "http://allrecipes.com/recipe/246591/classic-victoria-sponge-cake/"
}
