{
    "directions": [
        "To make the dressing, in a bowl, stir together the mayonnaise, ketchup, parsley, relish, onion and Worcestershire sauce until blended. Season with salt and pepper. Cover and refrigerate until ready to serve.",
        "Preheat an oven to 425°F. Line a rimmed baking sheet with aluminum foil.",
        "Arrange the bread slices in a single layer on the prepared sheet. Toast in the oven, turning the slices once or twice, until they are lightly browned, about 5 minutes total. While the toasted bread is still warm, spread each slice with butter.",
        "Spread a generous amount of the dressing on the buttered sides of 4 bread slices. Divide the corned beef and sauerkraut evenly among the slices. Top evenly with the cheese. Top each with one of the remaining bread slices, buttered side down, and press down gently.",
        "Arrange the sandwiches on the baking sheet and bake until they are heated through and the cheese starts to melt, 5 to 7 minutes. If the tops are not sufficiently browned, turn on the broiler and briefly broil the sandwiches. Cut the sandwiches in half, place on individual plates and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Essentials of Breakfast and Brunch,",
        "by Georgeanne Brennan, Elinor Klivans, Jordan Mackay and Charles Pierce (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/4 cup ketchup",
        "1 Tbs. chopped fresh flat-leaf parsley",
        "2 Tbs. green pickle relish",
        "1 Tbs. grated yellow onion",
        "1 tsp. Worcestershire sauce, or to taste",
        "Salt and freshly ground pepper, to taste",
        "8 slices rye bread with caraway seeds",
        "2 Tbs. unsalted butter, softened",
        "1 lb. sliced corned beef",
        "1 cup drained sauerkraut",
        "4 to 8 slices Gruyère cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Classic Reuben",
    "url": "http://www.williams-sonoma.com/recipe/classic-reuben.html"
}
