{
    "directions": [
        "In a bowl, combine the ground beef chuck, beef sirloin, salt and pepper and lightly mix together by hand until just combined. Do not overmix. Divide the beef mixture into 4 equal portions and form each into a patty about 3/4 inch thick.",
        "Prepare a medium fire in a grill. Oil the grill rack. Grill the burgers, turning once, for about 6 minutes total for medium-rare, or about 10 minutes total for medium.",
        "Meanwhile, prepare the topping of choice: For the herbed mayonnaise and tomato topping, in a small bowl, stir together the mayonnaise, lemon juice, thyme, chives and basil. Season with salt and pepper. Transfer the burgers to a cooler part of the grill while you grill the buns, cut side down, until toasted, about 1 minute. Spread the cut sides of the buns with the herbed mayonnaise. Place the burgers on the bottoms of the buns. Top with the tomatoes, avocados, lettuce, red onion and the tops of the buns.",
        "For the grilled onion and Gorgonzola topping, cut the focaccia slab into 3-inch squares and split the squares horizontally. Set aside. Brush the onion slices on both sides with the olive oil and season well with salt and pepper. Alongside the burgers but on a hotter part of the grill, grill the onions, turning once, until nicely charred, 2 to 4 minutes per side. Crumble the cheese on the burgers during the last 1 to 2 minutes of cooking. Serve the burgers on the focaccia, topped with the onions.",
        "For the barbecue sauce and bacon topping, place the cheese slices on the burgers during the last 1 to 2 minutes of cooking. While the burgers are cooking, in a small saucepan over medium-low heat, warm the barbecue sauce. Spread the cut sides of the rolls with the sauce. Place the burgers on the bottoms of the buns. Top each with 2 bacon slices and the tops of the buns. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Cooking for Friends,",
        "by Alison Attenborough and Jamie Kimm (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "3/4 lb. ground beef chuck",
        "3/4 lb. ground beef sirloin",
        "1 tsp. sea salt",
        "1/2 tsp. freshly ground pepper",
        "1/2 cup mayonnaise",
        "1/2 tsp. fresh lemon juice",
        "1/4 tsp. finely chopped fresh thyme",
        "1/4 tsp. snipped fresh chives",
        "1/4 tsp. finely chopped fresh basil",
        "Sea salt and freshly ground pepper, to taste",
        "4 brioche buns, split",
        "2 heirloom tomatoes, sliced 1/4 inch thick",
        "2 avocados, peeled, pitted and sliced",
        "4 Boston lettuce leaves",
        "4 thin red onion slices (optional)",
        "1 focaccia bread slab, about 6 inches square",
        "2 Maui onions, sliced 1/2 inch thick",
        "1/4 cup olive oil",
        "Sea salt and freshly ground pepper, to taste",
        "1/2 lb. Gorgonzola cheese",
        "4 slices Vermont cheddar cheese",
        "1/2 cup barbecue sauce",
        "4 Kaiser rolls, split",
        "8 bacon slices, cooked"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Classic Beef Burgers",
    "url": "http://www.williams-sonoma.com/recipe/classic-beef-burgers.html"
}
