{
    "directions": [
        "Whisk together vinegar, sugar, and salt in a small bowl until sugar and salt are dissolved, then add oil in a slow stream, whisking until emulsified. Season with pepper.",
        "Cut off tops and bottoms from clementines to expose fruit, then, resting fruit on a cutting board, remove peel, including all white pith, by cutting off vertical strips with a sharp paring knife. Cut segments free from inner membranes.",
        "Halve endives lengthwise, then cut out and discard cores. Cut endives diagonally into 1/2-inch-wide strips and put in a large salad bowl.",
        "Separate celery leaves from ribs and cut ribs diagonally into very thin slices, then add leaves and ribs to endives along with olives, onions, parsley, and clementine segments. Whisk dressing, then gently toss salad with enough dressing to coat."
    ],
    "ingredients": [
        "2 tablespoons red-wine vinegar",
        "1 teaspoon sugar, or to taste",
        "1/2 teaspoon salt, or to taste",
        "1/4 cup extra-virgin olive oil",
        "1 3/4 pounds clementines (7 to 11)",
        "2 pounds Belgian endives (6 to 8)",
        "4 pale inner ribs of celery, including leaves",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and cut lengthwise into slivers",
        "1 cup drained cocktail (pickled) onions (5 ounces), quartered",
        "3/4 cup loosely packed fresh flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Leafy Green",
        "Olive",
        "Appetizer",
        "No-Cook",
        "Vegetarian",
        "Orange",
        "Winter",
        "Vegan",
        "Endive",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Clementine, Olive, and Endive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/clementine-olive-and-endive-salad-231352"
}
