{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). (Set countertop conduction oven to Combo 2.) Line a rimmed baking sheet with aluminum foil, extending it up the sides.",
        "Arrange bacon in a single layer on the foil (slight overlapping is okay as bacon will shrink). Place in preheated oven and cook until your desired level of doneness is reached, 10 and 20 minutes. (For countertop induction oven, cook bacon 8 to 10 minutes.) Transfer bacon to a paper-towel lined plate to drain and reserve bacon fat.",
        "Place Greek yogurt in a bowl. Cut 1 cucumber in half and grate half into the yogurt. Stir in minced garlic, white pepper, and kosher salt to make tzatziki sauce.",
        "Slice the remaining cucumber into thin slices and set aside.",
        "Heat a large skillet over medium heat. Add sausage; cook and stir until browned, 5 to 8 minutes. Transfer to a bowl. Drain grease.",
        "Transfer bacon fat to skillet over medium heat. Add pita rounds; toast until golden brown, about 30 seconds per side. Drain on paper towels.",
        "Top each pita with bacon and sausage. Layer tzatziki sauce, spring mix, Roma tomatoes, cucumber slices, and onion on each pita.",
        "Heat 1 tablespoon oil in a small skillet. Crack in 1 egg; cook until set but still soft, about 1 1/2 minutes per side. Place egg on top of layered pita. Repeat with remaining oil and eggs. Season with salt and pepper."
    ],
    "ingredients": [
        "1 pound thick-cut bacon, cut into 2-inch squares",
        "Tzatziki Sauce:",
        "2 cups plain Greek yogurt",
        "2 cucumbers, peeled",
        "3 cloves garlic, minced",
        "2 teaspoons ground white pepper",
        "kosher salt to taste",
        "1 1/2 pounds breakfast sausage, crumbled",
        "4 pita bread rounds",
        "1 (16 ounce) bag spring mix greens",
        "3 Roma tomatoes, diced",
        "1 white onion, thinly sliced",
        "1/2 cup olive oil, divided",
        "8 eggs",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cliff's Greek Breakfast Pitas",
    "url": "http://allrecipes.com/recipe/255330/cliffs-greek-breakfast-pitas/"
}
