{
    "directions": [
        "Beat 3 cups confectioners' sugar, cream cheese, lemon juice, and 1 teaspoon vanilla extract together in a large bowl using an electric mixer until frosting is smooth. Cover bowl with plastic wrap and refrigerate while preparing cake.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking pan.",
        "Beat brown sugar and butter together in a large bowl using an electric mixer until smooth; beat in eggs, 1 at a time, until smooth. Stir 2 tablespoons ginger, 1 teaspoon vanilla extract, and salt into brown sugar-butter mixture until incorporated.",
        "Beat flour and baking powder into brown sugar-butter mixture until batter is smooth; fold in 3/4 cup dried cranberries and white chocolate chips. Pour batter into the prepared baking pan, spreading evenly.",
        "Bake in the preheated oven until cake is lightly browned and a toothpick inserted in the center comes out clean, about 30 minutes. Cool cake completely, 4 hours to overnight. Remove frosting from refrigerator 1 hour before frosting the cake.",
        "Spread frosting evenly over cake; sprinkle with 1/4 cup dried cranberries and 2 tablespoons ginger.",
        "Whisk 1/2 cup confectioners' sugar and cream together in a bowl until smooth; drizzle over frosted cake. Cover cake with plastic wrap and refrigerate until chilled, about 2 hours.",
        "Cut cake in half lengthwise and each half into 8 equal rectangles. Cut each rectangle in half diagonally, creating 16 triangle-shaped bars."
    ],
    "ingredients": [
        "Frosting:",
        "3 cups confectioners' sugar",
        "1/2 (8 ounce) package cream cheese, softened",
        "1 tablespoon lemon juice",
        "1 teaspoon vanilla extract",
        "Cake:",
        "1 cup packed dark brown sugar",
        "3/4 cup butter, softened",
        "3 eggs",
        "2 tablespoons minced candied ginger",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "3/4 cup chopped sweetened dried cranberries (such as Craisins®)",
        "1 cup white chocolate chips",
        "Topping:",
        "1/4 cup chopped sweetened dried cranberries (such as Craisins®)",
        "2 tablespoons minced candied ginger",
        "1/2 cup confectioners' sugar",
        "1 tablespoon heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Clone of a Cranberry Bliss Bar",
    "url": "http://allrecipes.com/recipe/235195/clone-of-a-cranberry-bliss-bar/"
}
