{
    "directions": [
        "Place warm milk in a small bow and sprinkle the yeast over the top; stir and set aside. In a large bowl, stir together the flour, 2 tablespoons sugar and salt. Cut in the butter until lumps are no larger than peas. Stir in the yeast mixture and eggs to form a dough. Shape dough into a ball, place in a greased bowl, cover and refrigerate overnight.",
        "Preheat the oven to 300 degrees F (150 degrees C). Divide dough into 2 pieces. Roll each piece out into a 10 inch square. Cut into 14 strips. Wrap each strip in an overlapping spiral around the length of a greased wooden clothes pin. You can roll the pastry in sugar at this point if you like. Place covered clothes pins 2 inches apart onto ungreased cookie sheets.",
        "Bake for 20 minutes in the preheated oven, until golden brown. Carefully remove clothespins while cookies are still warm and place cookies on a wire rack to cool completely.",
        "To make the filling: In a medium bowl, stir together the ricotta cheese and 1/4 cup of white sugar. Fold in the beaten egg whites until evenly distributed. Gently fold in the candied cherries, walnuts and chocolate chips. Spoon into a pastry bag fitted with a large tip and pipe the filling into the cookies. Serve immediately after filling.."
    ],
    "ingredients": [
        "1 1/2 teaspoons active dry yeast",
        "1/4 cup warm milk",
        "2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "3/4 cup butter",
        "2 eggs, beaten",
        "1 (15 ounce) container ricotta cheese",
        "1/4 cup white sugar",
        "2 egg whites, stiffly beaten",
        "1 cup chopped red and green candied cherries",
        "1/4 cup chopped walnuts",
        "1/2 cup semisweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Clothespin Cookies III",
    "url": "http://allrecipes.com/recipe/25809/clothespin-cookies-iii/"
}
