{
    "directions": [
        "Stir together warm water, yeast, and 1 tablespoon sugar in a small bowl until yeast is dissolved, then let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Melt 3/4 stick butter in a small saucepan, then add milk and heat to lukewarm. Stir together yeast mixture, remaining 2 tablespoons sugar, butter mixture, bread flour, and salt in a bowl with a wooden spoon until combined well, then stir in 1 1/2 cups all-purpose flour, or enough to make a slightly sticky dough.",
        "Butter a large bowl. Knead dough on a lightly floured surface, kneading in more all-purpose flour as needed to keep dough from sticking, until smooth and elastic, about 10 minutes (dough will still be slightly sticky). Form dough into a ball and put in buttered bowl, turning to coat. Let dough rise, bowl covered tightly with plastic wrap, in a draft-free place at warm room temperature until doubled in bulk, about 1 hour.",
        "Butter 18 muffin cups with remaining 2 tablespoons butter.",
        "Turn out dough onto a lightly floured surface and divide into thirds. Working with 1 piece at a time (keep remaining portions covered with plastic wrap), cut off tablespoon pieces of dough and form pieces into balls. Put 3 balls into each buttered muffin cup. Let rolls rise, loosely covered with a kitchen towel (not terry cloth), in draft-free place at warm room temperature until almost doubled in bulk, 30 to 40 minutes.",
        "While rolls rise, put oven rack in middle position and preheat oven to 400°F.",
        "Brush rolls lightly with egg wash and sprinkle with seeds. Bake until golden, 15 to 20 minutes. Serve warm."
    ],
    "ingredients": [
        "3 tablespoons warm water (105–115°F)",
        "1 (1/4-ounce) package active dry yeast (2 1/2 teaspoons)",
        "3 tablespoons sugar",
        "1 stick (1/2 cup) unsalted butter",
        "1 cup whole milk",
        "2 cups bread flour",
        "1 1/2 teaspoons salt",
        "1 1/2 to 2 cups all-purpose flour",
        "1 large egg, lightly beaten with 2 teaspoons water",
        "About 1 tablespoon poppy seeds and/or toasted sesame seeds for sprinkling",
        "Special equipment: 2 muffin pans with a total of at least 18 (1/2-cup) muffin cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Thanksgiving",
        "Poppy",
        "Gourmet"
    ],
    "title": "Cloverleaf Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/cloverleaf-rolls-108787"
}
