{
    "directions": [
        "For the blue cheese dressing: In a bowl, whisk together the mayonnaise, buttermilk, sour cream and Worcestershire until smooth. Stir in the blue cheese crumbles, chives, salt and pepper. Taste and add more seasoning if needed. Cover and refrigerate for at least 2 hours before serving; the flavors deepen as it chills!",
        "For the chicken: Heat a grill pan or heavy skillet over medium-high heat. Drizzle on a small amount of olive oil.",
        "Salt and pepper the chicken, then grill until totally done, 2 to 3 minutes per side. Remove from the pan and set aside to cool.",
        "For the salad: Arrange the Bibb, romaine and iceberg lettuce in a large bowl or on a large platter in 3 separate sections. Arrange the bacon, tomatoes, eggs and avocados in different piles. Pile the blue cheese crumbles in the center, scatter over the scallions and sprinkle the whole salad with a little black pepper.",
        "Drizzle the blue cheese dressing all over the salad and serve."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/2 cup buttermilk",
        "1/2 cup sour cream",
        "3 dashes Worcestershire sauce",
        "4 ounces blue cheese crumbles",
        "2 tablespoons chopped chives",
        "1 dash salt, plus more if needed",
        "1/2 teaspoon freshly ground black pepper, plus more if needed",
        "Olive oil, for drizzling",
        "Salt and freshly ground black pepper",
        "2 boneless, skinless chicken breasts, sliced in half down the middle (you should be left with 4 very thin breast-shaped pieces)",
        "2 heads Bibb lettuce, cored and leaves separated",
        "2 heads romaine lettuce, chopped",
        "1 head iceberg lettuce, cut into chunks",
        "1 pound crispy-fried thin bacon",
        "8 ounces red grape tomatoes, halved",
        "6 hard-boiled eggs, peeled and sliced",
        "2 avocados, diced",
        "1/3 cup blue cheese crumbles",
        "3 scallions, chopped",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salad Dressing Recipes",
        "Cobb Salad",
        "Blue Cheese",
        "Cheese",
        "Egg Recipes",
        "Chicken",
        "Poultry Recipes",
        "Bacon Recipes",
        "Meat",
        "Lettuce Recipes",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Cobb Salad with Blue Cheese Dressing",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/cobb-salad-with-blue-cheese-dressing"
}
