{
    "directions": [
        "1 To make the vinaigrette, combine the vinegar, salt, and pepper in a blender. With the machine running, gradually add the oil. Add the shallots and pulse briefly to combine. Pour into a serving bowl and set aside.",
        "2 Pound each chicken breast half between 2 heavy duty plastic bags with a flat meat pounder to an even 1/2-inch thickness. Season with the salt and pepper. Heat the oil in a large nonstick skillet over medium high heat. Add the chicken and cook, turning halfway through cooking, until golden brown on both sides, about 6 minutes. Add ¼ cup water, reduce the heat to medium-low, and cover. Simmer until the chicken feels firm when pressed in the center, about 8 minutes. Uncover, increase the heat to high, and cook until the liquid is evaporated and the chicken is sizzling, about 1 minute. Transfer chicken to a carving board and let cool. Cut the chicken into bite-sized pieces.",
        "3 Spread the lettuce on a large platter. Top with the chicken, tomatoes, avocados, bacon, hard-boiled eggs, and blue cheese arranged in rows. Serve immediately, with the vinaigrette passed on the side."
    ],
    "ingredients": [
        "1/4 cup balsamic vinegar",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "3/4 cup extra-virgin olive oil",
        "2 tablespoons minced shallots",
        "2 8-ounce skinless, boneless chicken breast halves",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 teaspoons extra-virgin olive oil",
        "2 8-ounce romaine hearts, washed, dried, and torn into bite-sized pieces",
        "2 large ripe tomatoes, seeded and diced",
        "2 ripe avocados, pitted, peeled, and diced",
        "8 strips turkey bacon, cooked and coarsely chopped",
        "2 hard-boiled eggs, coarsely chopped",
        "1 cup (4 ounces) crumbled reduced-fat blue cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Egg",
        "Fourth of July",
        "Super Bowl",
        "Father's Day",
        "Lunch",
        "Vinegar",
        "Blue Cheese",
        "Bacon",
        "Fall",
        "Spring",
        "Summer",
        "Shallot"
    ],
    "title": "Cobb Salad with Balsamic Shallot Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/cobb-salad-with-balsamic-shallot-vinaigrette-365112"
}
