{
    "directions": [
        "Preheat oven to 325°F.",
        "Stir together espresso powder and water until powder is dissolved.",
        "Cook 1/2 cup sugar with a pinch of salt in a 1 1/2- to 2-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel.",
        "Remove caramel from heat and whisk in espresso (mixture will steam and bubble vigorously). Once bubbles begin to subside, immediately divide mixture among ramekins, tilting to coat bottoms, and let stand until hardened, about 10 minutes.",
        "While caramel hardens, bring coconut milk and whole milk just to a simmer over moderate heat, stirring, then remove from heat. Whisk together whole eggs, yolks, salt, and remaining 2/3 cup sugar in a large bowl, then add warm milk mixture in a stream, whisking. Pour custard through a fine-mesh sieve into a 1-quart glass measure.",
        "Divide custard among ramekins. Arrange ramekins on towel in a small roasting pan lined with a folded kitchen towel (bottom only). Bake custards in a hot water bath, uncovered, in middle of oven until custards are set around edges but still tremble slightly in centers, about 1 1/4 hours.",
        "Run a thin knife around side of each flan to loosen, then transfer ramekins to a rack and cool completely. Chill, covered, until cold, at least 4 hours.",
        "To unmold, invert small plates over ramekins and invert flans onto plates."
    ],
    "ingredients": [
        "2 1/2 teaspoons instant-espresso powder",
        "3 tablespoons water",
        "2/3 cup plus 1/2 cup sugar",
        "1 (13- to 14-oz) can unsweetened coconut milk, stirred well",
        "1 1/4 cups whole milk",
        "3 whole large eggs",
        "2 large egg yolks",
        "1/8 teaspoon salt",
        "Special equipment: 6 (6-oz) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Coconut",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Flans with Coffee Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-flans-with-coffee-caramel-108369"
}
