{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Grease and flour three 8-inch round cake pans.",
        "Stir cake mix, 1 cup water, vegetable oil, eggs, and 1 teaspoon coconut extract together in a bowl until moistened; beat with an electric mixer on medium speed for 2 minutes.",
        "Pour batter evenly into the prepared cake pans.",
        "Bake in preheated oven until the cakes are lightly browned and a toothpick inserted into the center of a cake comes out clean, about 25 minutes.",
        "Let cakes cool in pans for 10 minutes; remove cakes from pans to finish cooling on racks, at least 30 minutes.",
        "Beat butter with an electric mixer on low in a large bowl until creamy and smooth. Beat in 2 1/2 teaspoons coconut extract.",
        "Beat 1 cup confectioners' sugar into butter mixture until thoroughly combined; beat in 1 tablespoon heavy cream. Continue to beat in confectioners' sugar, 1 cup at a time, alternating with 1 tablespoon cream, until the confectioners' sugar and cream have been incorporated and the frosting is smooth and creamy.",
        "With a long serrated knife, level the tops of the 3 cakes. Place 1 cake onto a serving platter; frost the top of the cake with about 1/4 of the frosting. Sprinkle with about 1/3 cup flaked coconut.",
        "Place second cake layer on top of the first, and frost and sprinkle with coconut as before. Place third layer on top of the second; frost top and sides with remaining frosting. Lightly press 1/3 cup of coconut evenly into sides of cake.",
        "Place 1 cup of remaining coconut into a resealable plastic bag, add 1/2 teaspoon water and the green food coloring, and seal bag. Shake and press bag to mix food coloring with coconut, tinting it light green. Remove to paper towel to dry.",
        "Spread the green coconut over the top of the cake; place colored jelly beans in the middle and press lightly to secure."
    ],
    "ingredients": [
        "1 (18.25 ounce) box yellow cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1 teaspoon coconut extract",
        "1 cup butter at room temperature",
        "6 cups confectioners' sugar",
        "2 1/2 teaspoons coconut extract",
        "6 tablespoons heavy whipping cream",
        "2 cups sweetened flaked coconut, or as needed - divided",
        "2 drops green food coloring",
        "1/2 teaspoon water",
        "5 jelly beans in assorted colors, or as desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coconut Easter Cake",
    "url": "http://allrecipes.com/recipe/220936/coconut-easter-cake/"
}
