{
    "directions": [
        "In a large pot over medium heat, heat the ghee or oil. Add the ginger, shallot, rosemary, garlic, and sea salt and sweat the mixture for 10 minutes, stirring occasionally.",
        "Add the white wine and stir to deglaze the pan. Simmer for 5 minutes to cook off the alcohol. Add the beets, coconut milk, bone broth, and white wine vinegar, cover, and let simmer for 45 minutes.",
        "Prepare a bowl of ice water.",
        "Using a slotted spoon, remove the beets from the pot and transfer to the ice bath to cool. Once the beets are cool to the touch, use your hands or a paper towel to remove the skins. Discard the skins and roughly chop the beets. Return the beets to the pot and simmer the mixture for 10 minutes more.",
        "Using an immersion blender, blend the mixture right in the pot until smooth. Alternatively, transfer the mixture to a blender or food processor and blend until smooth. Season with additional sea salt to taste if needed. Serve immediately, garnished with a couple of orange segments and a bit of the zest.",
        "The soup can be refrigerated for up to 1 week, or frozen for up to 6 months."
    ],
    "ingredients": [
        "1 tablespoon ghee or olive oil",
        "1 large thumb-size piece fresh ginger, peeled and chopped",
        "1 small shallot, peeled and chopped",
        "3 sprigs fresh rosemary",
        "3 garlic cloves, smashed",
        "1 teaspoon sea salt, plus more as needed",
        "1/2 cup white wine",
        "2 pounds whole beets, greens removed",
        "1 cup coconut milk",
        "3 cups Chicken Bone Broth",
        "1 tablespoon white wine vinegar",
        "1 small orange, segmented",
        "Finely grated zest of 1 small orange"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Coconut",
        "Soup/Stew",
        "Beet",
        "Ginger",
        "Kid-Friendly",
        "Healthy"
    ],
    "title": "Coconut, Beet, and Ginger Soup",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-beet-and-ginger-soup"
}
