{
    "directions": [
        "Remove tough outer layers from lemongrass. Finely grate bottom third of 1 stalk and set aside; discard the rest of the stalk. Trim and discard top third of remaining stalk, then bruise stalk by giving it a few whacks against a cutting board (this helps release the essential oils). Tie it in a loose knot; set aside.",
        "Pulse reserved grated lemongrass with shallot, garlic, ginger, red pepper flakes, turmeric, and 2 Tbsp. water in a food processor, adding a splash or two of water if needed, until a paste forms.",
        "Heat oil in a large skillet over medium. Season chicken with salt and pepper and cook, skin side down, until skin is lightly browned and crisp, 8–10 minutes. Transfer to a plate.",
        "Cook spice paste in same skillet, stirring, until very fragrant, about 5 minutes (it will begin to darken slightly as the water evaporates and the paste begins to fry in the fat left behind).",
        "Add kaffir lime leaves (if using), cinnamon, cardamom, star anise, coconut milk, coconut sugar, and reserved knotted lemongrass to skillet. Bring to a simmer, add chicken, and cook, turning pieces occasionally and scraping bottom of skillet often, until chicken is falling-apart tender and coconut milk has broken (the fat will separate from the liquid and start to brown the chicken and other aromatics), about 1 1/2 hours.",
        "Toast shredded coconut in a dry small skillet over medium heat, tossing occasionally, until golden brown, about 5 minutes. Let cool.",
        "Arrange chicken on a platter and spoon any braising liquid over. Top with cilantro, chives, and toasted coconut."
    ],
    "ingredients": [
        "2 lemongrass stalks",
        "1 large shallot, chopped",
        "4 garlic cloves",
        "1 (2-inch) piece ginger, peeled, thinly sliced",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon ground turmeric",
        "1 tablespoon vegetable oil",
        "4 chicken legs, drumsticks and thighs separated",
        "Kosher salt, freshly ground pepper",
        "4 kaffir lime leaves (optional)",
        "1 (3-inch) cinnamon stick",
        "4 cardamom pods, cracked",
        "2 star anise pods",
        "1 (15-ounce) can unsweetened coconut milk",
        "1 teaspoon coconut sugar or light brown sugar",
        "1/4 cup unsweetened shredded coconut",
        "Chopped cilantro and chives (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Curry",
        "Coconut",
        "Dinner",
        "Braise",
        "Spice",
        "Cardamom",
        "Anise",
        "Cinnamon",
        "Lemongrass",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Coconut Chicken Curry With Turmeric and Lemongrass",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-chicken-curry-with-turmeric-and-lemongrass"
}
