{
    "directions": [
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with parchment. Butter parchment; dust pans with flour. Sift flour, baking powder, ground ginger, baking soda, salt and ground cinnamon into medium bowl. Using electric mixer, cream unsalted butter and sugar in large bowl until fluffy. Beat in eggs 1 at a time. Add unsulfured molasses, grated orange peel and vanilla extract and beat 1 minute at high speed until well blended. Mix in dry ingredients alternately with buttermilk, beginning and ending with dry ingredients. Fold in shredded coconut and crystallized ginger.",
        "Divide batter between prepared pans. Bake until cakes begin to pull away from sides of pans, about 30 minutes. Cool in pans on rack 5 minutes. Invert cakes onto racks. Remove parchment and cool completely.",
        "Using electric mixer, beat cream cheese and butter until smooth. Mix in orange peel and vanilla. Beat in sugar. Mix in ginger.",
        "Place 1 cake layer on platter, flat side down. Spread with some of icing. Sprinkle with 3/4 cup coconut. Top with second layer, flat side up. Spread remaining icing over top and sides of cake. Arrange remaining coconut around top edge of cake. (Can be prepared 1 day ahead. Chill until icing is set; wrap lightly with plastic and refrigerate. Bring to room temperature.) Place fruit around base of cake."
    ],
    "ingredients": [
        "2 cups plus 3 tablespoons sifted unbleached all purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon ground ginger",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon salt",
        "3/4 teaspoon ground cinnamon",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "3/4 cup sugar",
        "2 eggs",
        "1/2 cup plus 2 tablespoons light unsulfured molasses",
        "2 tablespoons grated orange peel",
        "1 teaspoon vanilla extract",
        "3/4 cup buttermilk",
        "1 cup shredded sweetened coconut, toasted",
        "1/2 cup diced crystallized ginger (about 2 1/2 ounces)",
        "8 ounces cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 tablespoons grated orange peel",
        "1 teaspoon vanilla extract",
        "1 1-pound box powdered sugar",
        "1/3 cup minced crystallized ginger (scant 2 ounces)",
        "1 cup shredded sweetened coconut, toasted",
        "Tropical fruit such as pineapple, papaya and mango, cut into bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Coconut",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Spice Cake",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-spice-cake-2376"
}
