{
    "directions": [
        "1. Combine the lime juice, garlic, agave or sugar, and salt in a large bowl and whisk to blend. Keep whisking as you drizzle in the oil until it is completely incorporated; set aside.",
        "2. Place a colander on a plate next to the stove and have a pair of tongs or a spider skimmer handy.",
        "3. Combine the coconut milk and water in a medium saucepan and bring to a boil. Add the noodles and cook for exactly 3 minutes (best to use a timer). Use the skimmer or tongs to lift them out (leaving the pot on the heat) and transfer them to the colander. (They will be noticeably al dente.) Shake the colander over the plate to drain and dry the noodles, then transfer them directly to the marinade in the bowl. Turn and lift with tongs and/or a fork to get them coated.",
        "4. Return the colander to the plate (emptied of any water) near the stove. Add the green beans to the simmering water-coconut milk mixture. Cook them for about 5 minutes, or until just tender. Use the skimmer or tongs to lift them into the colander to drain. You can save the coconut broth to make a little soup snack for yourself.",
        "5. Add the green beans (it's OK if they're still hot) along with the Pickled Red Onions to the noodle mixture, mixing gently until combined. (Use a fork to grab the onions, leaving their liquid behind.)",
        "6. Let the salad cool to room temperature, then add the cucumber and carrot. Cover and chill until serving time; the optimal marinating-chilling time is about 2 hours.",
        "7. Stir in the mango, mint, and most of the cashews shortly before serving. Serve topped with the remaining cashews and any combination of the Enhancements.",
        "Minced jalapeño scattered through * Touch of lime zest mixed in to give it more zing * Lime wedges * Toasted unsweetened coconut on top * Minced fresh basil (regular or Thai) and/or cilantro on top * Chili paste or Sriracha on the side"
    ],
    "ingredients": [
        "2 tablespoons fresh lime juice",
        "1/4 teaspoon minced or crushed garlic",
        "Up to 2 teaspoons agave nectar or sugar",
        "1/2 teaspoon salt",
        "2 tablespoons grapeseed or peanut oil",
        "3/4 cup reduced-fat coconut milk (half a 14- to 15-ounce can)",
        "3 cups water",
        "4 ounces medium-thin rice noodles",
        "1/3 pound slender green beans, trimmed and halved either lengthwise or crosswise",
        "1/2 cup Pickled Red Onions",
        "1 small (6-inch) cucumber (peeled if the skin is bitter), diced",
        "1 medium carrot, coarsely grated",
        "1 ripe, sweet mango, peeled, pitted, and cut into 1/2-inch dice, or 1 heaping cup diced defrosted frozen mango",
        "About 10 fresh mint leaves, cut into thin strips",
        "1 cup lightly toasted cashews, chopped or whole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Dinner",
        "Tropical Fruit",
        "Mango",
        "Vegan",
        "Noodle",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Coconut-Mango Rice Noodle Salad",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-mango-rice-noodle-salad-51196610"
}
