{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "In the bowl of an electric mixer fitted with a paddle attachment, cream the butter and sugar until light and fluffy, about 5 minutes. With the mixer running on low, add the eggs one at a time, scraping down the bowl after each addition. Add the vanilla and almond extracts and mix well.",
        "In a separate bowl, sift together the flour, baking powder, baking soda and salt. In three parts, alternately add the dry ingredients and the buttermilk to the batter, beginning and ending with the dry. Mix until just combined. Fold in 7 ounces coconut.",
        "Line a muffin pan with paper liners. Fill each cup to the top with batter. Bake for 25 to 35 minutes, until the tops are brown and a toothpick comes out clean. Allow to cool in the pan for 15 minutes. Remove to a baking rack and cool completely.",
        "Make the cream cheese icing: In the bowl of an electric mixer fitted with a paddle attachment, blend together the cream cheese, butter, and vanilla and almond extracts. Add the confectioners' sugar and mix until smooth.",
        "Frost the cupcakes with the cream cheese icing and sprinkle with the remaining coconut.",
        "Photograph by Quentin Bacon"
    ],
    "ingredients": [
        "3/4 pound unsalted butter, at room temperature",
        "2 cups sugar",
        "5 extra-large eggs, at room temperature",
        "1 1/2 teaspoons pure vanilla extract",
        "1 1/2 teaspoons pure almond extract",
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup buttermilk",
        "14 ounces sweetened, shredded coconut",
        "1 pound cream cheese, at room temperature",
        "1 teaspoon pure vanilla extract",
        "1/2 teaspoon pure almond extract",
        "1 1/2 pounds confectioners' sugar, sifted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cupcake",
        "Coconut Recipes",
        "Fruit",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Coconut Cupcakes With Cream Cheese Icing",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/coconut-cupcakes-with-cream-cheese-icing-recipe"
}
