{
    "directions": [
        "Have all the ingredients at room temperature.",
        "Position a rack in the lower third of an oven and preheat to 350°F. Grease and flour three 8-inch round cake pans; tap out excess flour.",
        "To make the cake, over a sheet of waxed paper, sift together the flour, baking powder and salt; set aside.",
        "In a small bowl, stir together the milk and vanilla; set aside.",
        "In the bowl of an electric mixer fitted with the flat beater, beat the butter on medium speed until creamy and smooth, 1 to 2 minutes. Add the sugar and lime zest and continue beating until light and fluffy, about 5 minutes, stopping the mixer occasionally to scrape down the sides of the bowl. Add the eggs one at a time, beating well after each addition.",
        "Reduce the speed to low and add the flour mixture in three additions, alternating with the milk mixture and beginning and ending with the flour. Beat each addition just until incorporated, stopping the mixer occasionally to scrape down the sides of the bowl.",
        "Spoon the batter into the prepared pans, spreading the batter evenly. Bake until the cakes begin to pull away from the sides of the pans and a toothpick inserted into the center comes out clean, 25 to 30 minutes. Transfer the pans to a wire rack and let the cakes cool in the pans for 15 minutes, then turn them out onto the rack and let cool completely.",
        "Meanwhile, make the frosting: In the bowl of an electric mixer, using a handheld whisk, beat together the egg whites, sugar, corn syrup and salt just until combined, about 30 seconds. Place the bowl over but not touching simmering water in a saucepan and whisk until the sugar dissolves and the mixture is hot, 2 to 3 minutes.",
        "Set the bowl on the mixer fitted with the whisk attachment and beat on medium speed for 3 minutes. Add the vanilla and beat until the outside of the bowl is cool and medium-firm peaks form, 2 to 3 minutes. Using a rubber spatula, fold in 1 cup of the coconut just until incorporated.",
        "Place one cake layer, top side down, on a serving plate. Using an icing spatula or a knife, spread some of the frosting evenly on top. Place a second layer, top side down, on the first layer and spread some of the frosting evenly on top. Place the remaining layer, top side down, on the second layer. Spread the remaining frosting over the top and sides of the cake. Press the remaining 1 1/2 cups coconut onto the top and sides. Refrigerate the cake for 30 minutes before serving to set the frosting."
    ],
    "ingredients": [
        "3 1/4 cups cake flour",
        "1 Tbs. baking powder",
        "3/4 tsp. salt",
        "1 3/4 cups milk",
        "1 Tbs. vanilla extract",
        "16 Tbs. (2 sticks) unsalted butter",
        "2 cups sugar",
        "1 Tbs. finely chopped lime zest",
        "4 eggs",
        "4 egg whites",
        "1 1/3 cups sugar",
        "1/2 cup light corn syrup",
        "1/8 tsp. salt",
        "1 tsp. vanilla extract",
        "2 1/2 cups sweetened shredded coconut"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Coconut-Lime Cake",
    "url": "http://www.williams-sonoma.com/recipe/coconut-lime-cake.html"
}
