{
    "directions": [
        "Preheat oven to 350°F.",
        "Pulse cookie crumbs, coconut, and butter in a food processor until coconut is finely ground, then press evenly onto bottom and up side of tart pan. Bake in middle of oven until golden, about 16 minutes, then cool completely in pan on a rack.",
        "Stir together milk and cornstarch until well blended.",
        "Bring heavy cream and cream of coconut to a boil in a heavy saucepan over moderate heat, whisking occasionally. Whisk cornstarch mixture, then add to cream in a stream, whisking. Boil custard, whisking constantly, 1 minute. Remove from heat and immediately whisk in eggs and coconut extract.",
        "Pour custard into cooled crust and smooth top. Cover custard with a round of wax paper (to prevent a skin from forming) and cool to room temperature, about 1 hour. Chill tart until set, at least 4 hours.",
        "Beat together cream, sour cream, and sugar with an electric mixer until it just holds stiff peaks. Remove wax paper from tart and spread cream evenly over tart."
    ],
    "ingredients": [
        "7 1/2 oz shortbread cookies such as Lorna Doone, finely ground (2 cups)",
        "1 1/4 cups sweetened flaked coconut (3 oz)",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "1 cup whole milk",
        "5 tablespoons cornstarch",
        "1 cup heavy cream",
        "1 cup well-stirred canned cream of coconut (not coconut milk) such as Coco López",
        "2 large eggs, lightly beaten",
        "1/2 teaspoon coconut extract",
        "1 cup chilled heavy cream",
        "1/4 cup sour cream",
        "1 teaspoon sugar",
        "Special equipment: a 9-inch round fluted tart pan (1 inch deep) with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Coconut",
        "Chill",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cream-tart-107997"
}
