{
    "directions": [
        "Remove tough outer layers from lemongrass. Trim off top third of stalk; discard. Bruise remaining stalk by whacking a few times against a cutting board. Transfer lemongrass to a small saucepan and add shallot, garlic, ginger, oil, and salt and bring to a gentle simmer over medium heat. Cook, reducing heat as needed to keep at a low boil, until shallot is soft and just beginning to turn golden around edges, 15–20 minutes. Remove from heat and add chiles and red pepper flakes, pushing down with a spoon and stirring occasionally until chiles soften slightly. Purée in a blender until chiles are broken down to small flecks (be careful not to overprocess). Transfer to a small bowl; stir in peanuts and fish sauce.",
        "To make them easier to slice, freeze ribs just until very firm around edges, 20–30 minutes.",
        "Meanwhile, remove tough outer layers from lemongrass. Finely grate bottom third of stalk; discard remainder or freeze for another use. Combine lemongrass, garlic, ginger, coconut milk, fish sauce, brown sugar, lime juice, and turmeric in a large resealable plastic bag. Slice short ribs lengthwise against the grain into 1/4\"-thick strips and add to bag. Seal bag, pressing out air, and chill at least 2 hours and up to 2 days.",
        "Prepare a grill for medium-high heat; oil grates. Remove beef from marinade, letting excess drip off. Thread onto 6–8 skewers, folding back and forth in accordion style; season lightly with salt. Grill, turning once, until browned and just cooked through, about 5 minutes. Serve beef with peanut-chile oil.",
        "Peanut-chile oil can be made 1 week ahead. Cover and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "1 lemongrass stalk",
        "1 large shallot, chopped",
        "2 garlic cloves, chopped",
        "1 (1-inch) piece ginger, peeled, chopped",
        "1/2 cup vegetable oil",
        "1/2 teaspoon kosher salt",
        "4 guajillo or New Mexico chiles or 2 ancho chiles, seeds removed, flesh torn",
        "1 teaspoon crushed red pepper flakes",
        "1/4 cup crushed salted, roasted peanuts",
        "2 teaspoons fish sauce",
        "1 1/4 pounds boneless beef short ribs",
        "1 lemongrass stalk",
        "2 garlic cloves, finely grated",
        "1 (2-inch) piece ginger, peeled, finely grated",
        "3/4 cup unsweetened coconut milk",
        "2 tablespoons fish sauce",
        "2 tablespoons light brown sugar",
        "1 tablespoon fresh lime juice",
        "1 teaspoon ground turmeric",
        "Vegetable oil (for grill)",
        "Kosher salt",
        "8 (8–12-inch-long) metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Skewer",
        "Beef",
        "Coconut",
        "Lemongrass",
        "Ginger",
        "Lime Juice",
        "Chile Pepper",
        "Peanut",
        "Garlic",
        "Shallot",
        "Summer"
    ],
    "title": "Coconut-Marinated Short Rib Kebabs With Peanut-Chile Oil",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-marinated-short-rib-kebabs-with-peanut-chile-oil"
}
