{
    "directions": [
        "Position rack in middle of oven; preheat to 350°F. Spread coconut in a single layer on a rimmed baking sheet and toast until golden brown and aromatic, 3–5 minutes. Let cool 5 minutes.",
        "Meanwhile, coat a 13x9\" pan with nonstick spray. Dust with flour, tapping out any excess.",
        "Whisk toasted coconut, baking powder, salt, and 1 3/4 cups flour in a medium bowl. Mix coconut oil, vanilla, and 2/3 cup coconut milk in another medium bowl.",
        "Cream sugar and butter in the bowl of a stand mixer fitted with the paddle attachment at medium speed, occasionally scraping down sides of bowl, until pale and fluffy, 3–4 minutes. Add eggs, one at a time, beating to blend after each addition. Reduce mixer speed to low and beat in dry ingredients in 3 additions, alternating with coconut milk mixture in 2 additions, beginning and ending with dry ingredients. Pour batter into prepared pan, smoothing top with a spatula.",
        "Bake cake until top is set and golden brown and a tester inserted into the center comes out clean, 25–30 minutes.",
        "Mix key lime zest, juice, and remaining 2/3 cup coconut milk in a small bowl (it's okay if mixture separates slightly; it will be absorbed by cake). Using a skewer, poke holes every 2\" into warm cake. Slowly pour key lime zest mixture over cake. Transfer pan to a wire rack and let cake cool completely.",
        "Pour water into a medium pot to a depth of 2\". Bring to a simmer over medium heat. Place butter in a large bowl.",
        "Whisk egg yolks and sugar in a heatproof medium bowl. Whisk in key lime zest and juice. Set bowl on saucepan, making sure bottom does not touch water. Cook, whisking occasionally, until mixture is thick enough to coat the back of a spoon and an instant-read thermometer registers 175°F, 3–4 minutes.",
        "Strain egg yolk mixture through a fine-mesh sieve over butter, then stir with a rubber spatula until smooth. Place a piece of plastic wrap directly on key lime curd and chill at least 30 minutes.",
        "Using an electric mixer on medium speed, beat cream in a large bowl until stiff peaks form. Gently fold in chilled key lime curd and key lime zest. Spread cream on cooled cake with a spatula, then chill 30 minutes to set cream.",
        "Meanwhile, preheat oven to 350°F. Spread coconut flakes in a single layer on rimmed baking sheet and toast, tossing halfway through, until crispy and golden, 5–7 minutes. Let cool.",
        "When ready to serve, sprinkle toasted coconut flakes over cake.",
        "Lime curd can be made 1 week ahead. Store in an airtight container and chill, or freeze up to 4 months."
    ],
    "ingredients": [
        "1 1/2 cups unsweetened shredded coconut",
        "Nonstick vegetable oil spray",
        "1 3/4 cups cake flour, plus more for pan",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon kosher salt",
        "1/3 cup virgin coconut oil, melted",
        "1 1/2 teaspoons vanilla extract",
        "1 1/3 cups canned unsweetened coconut milk, divided",
        "1 1/2 cups sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3 large eggs",
        "1 tablespoon finely grated key lime zest",
        "1/3 cup fresh key lime juice (from about 6 key limes)",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces, room temperature",
        "3 large egg yolks",
        "1/2 cup sugar",
        "1 teaspoon finely grated key lime zest",
        "1/4 cup fresh key lime juice (from about 4 key limes)",
        "1 1/2 cups cold heavy cream",
        "1 teaspoon finely grated key lime zest",
        "1 cup unsweetened coconut flakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coconut",
        "Lime",
        "Lime Juice",
        "Easter",
        "Dessert",
        "Bake",
        "Birthday",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut-Key Lime Sheet Cake",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-key-lime-sheet-cake"
}
