{
    "directions": [
        "If using an oven (rather than a slow cooker or pressure cooker) for the chicken, preheat to 350°F (180°C).",
        "To make the chicken, season the chicken all over with salt and pepper. In a large fry pan, Dutch oven or stovetop pressure cooker over medium-high heat, or in an electric pressure cooker set on the sauté setting according to the manufactuer’s instructions, warm the oil. In batches, brown the chicken on all sides, 8 to 10 minutes per batch.",
        "If using a pressure cooker, return all the chicken to the pressure cooker and add the sauce and 3/4 to 1 3/4 cups (180 to 430 ml) water to reach the minimum fill line. Lock the lid, cook on high pressure for 35 to 40 minutes, then release the pressure according to the manufacturer’s instructions.",
        "If using a slow cooker, transfer the chicken to a slow cooker insert and add the sauce. Cover and cook on high until the meat is fork-tender, about 1 1/2 hours.",
        "If using an oven, return all the chicken to the pot, add the sauce and 1 cup (8 fl. oz./250 ml) water, and bring to a simmer. Cover the pot tightly with aluminum foil, then cover with the lid. Transfer to the oven and cook until the meat is fork-tender, 1 1/2 to 2 hours.",
        "About 30 minutes before the rice is done, make the rice: In a stovetop pressure cooker over medium heat or an electric pressure cooker set on the sauté setting according to the manufacturer’s instructions, warm the oil. Add the onion and sauté until soft and translucent, about 4 minutes. Add the cinnamon, cardamom, turmeric and saffron and cook until fragrant, about 30 seconds. Add the rice, cinnamon stick and cardamom pods, stir to combine and continue cooking until the spices are lightly toasted, about 3 minutes. Add 2 cups (16 fl. oz./500 ml) water, the tomatoes and 2 tsp. salt and stir to combine. Lock the lid into place and cook on high pressure for 5 minutes. Release the steam according to the manufacturer’s instructions. Remove the lid, tilting it away from you to allow the residual steam to escape. Stir in the peas and season with salt and pepper.",
        "Using tongs, remove the chicken from the braising sauce and set aside to cool slightly. Using two forks, carefully shred the chicken into bite-size pieces, removing and discarding the skin and bones. Skim any excess fat from the top of the braising sauce and stir the chicken pieces back into the sauce.",
        "To serve, divide the rice among 4 bowls. Spoon the chicken and braising sauce on top of the rice, garnish with coconut flakes and mint leaves and serve immediately. Serves 4.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 lb. (1 kg) bone-in, skin-on chicken thighs or breasts, or a combination",
        "Kosher salt and freshly ground pepper",
        "2 Tbs. vegetable oil",
        "1 jar coconut curry chicken braising sauce",
        "2 Tbs. vegetable oil",
        "1 yellow onion, diced",
        "1 tsp. ground cinnamon",
        "1/2 tsp. ground cardamom",
        "1/2 tsp. ground turmeric",
        "5 saffron threads",
        "1 1/2 cups (10 oz./315 g) basmati rice",
        "1 cinnamon stick",
        "4 cardamom pods",
        "1 can (14-oz./440 g) diced tomatoes",
        "Kosher salt and freshly ground pepper",
        "1 1/2 cups (7 1/2 oz./235 g) frozen peas, thawed",
        "Toasted coconut flakes for garnish",
        "Fresh mint leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Coconut Curry Chicken with Basmati Pilaf",
    "url": "http://www.williams-sonoma.com/recipe/coconut-curry-chicken-with-basmati-pilaf.html"
}
