{
    "directions": [
        "Preheat oven to 200°F. Line 3 large baking sheets with parchment paper. Using 3 1/4- to 3 1/2-inch-diameter biscuit cutter or bowl as guide, heavily trace 9 circles on each of 2 parchment-lined baking sheets. On third parchment-lined baking sheet and using same guide, trace 10 semicircles. Turn parchment paper over so that marked side is down (circles and semicircles will show through).",
        "Whisk 1 1/2 cups sugar and cocoa powder in medium bowl to blend. Using electric mixer, beat egg whites, 1 1/2 teaspoons vanilla and cream of tartar in large bowl until soft peaks form, about 1 1/2 minutes. Gradually add sugar-cocoa mixture and beat until very stiff and glossy, about 4 minutes.",
        "Cut off 1/3 to 1/2 inch from 1 corner of 1-gallon resealable plastic bag. Scoop enough meringue into bag to fill 3/4 full. Twist bag shut above meringue and hold firmly closed while piping. Pipe small dot of meringue under parchment in each corner of baking sheets. Press parchment onto dots to anchor. To form basket bottoms: Starting in center of each marked circle on 1 baking sheet, pipe meringue in continuous spiral to fill circles completely. Pipe 12 marble-size balls atop edge of each circle. To form basket sides: On second baking sheet, pipe meringue atop edge of traced circles to form rings. Pipe 12 marble-size meringue balls atop each ring, spacing about 1/3 to 1/2 inch apart. To form basket handles: On third sheet, pipe meringue atop outline of semicircles.",
        "Bake meringues until firm and dry to touch, about 2 hours. Turn off oven; let meringues stand in closed oven overnight to dry completely. (Can be made 3 days ahead. Store airtight in single layer at room temperature.)",
        "Toss nectarine slices with crème de cassis in medium bowl. Beat whipping cream, remaining 6 tablespoons sugar and 1 1/2 teaspoons vanilla in large bowl until peaks form.",
        "Place 1 meringue bottom on each of 8 plates. Place 1 meringue side atop each bottom. Spoon dollop of whipped cream into center of each basket. Top with spoonful of nectarine slices, then a few raspberries and blackberries. Repeat with another layer of cream, nectarines, and berries. Dip ends of 1 meringue handle into whipped cream and attach to 1 basket; repeat with remaining handles. Sift powdered sugar over baskets. Garnish with mint sprigs and serve."
    ],
    "ingredients": [
        "1 1/2 cups plus 6 tablespoons sugar",
        "3 tablespoons unsweetened cocoa powder",
        "6 large egg whites",
        "3 teaspoons vanilla extract",
        "1/2 teaspoon (scant) cream of tartar",
        "4 nectarines, pitted, thinly sliced, slices halved crosswise",
        "2 tablespoons crème de cassis (black currant-flavored liqueur)",
        "1 1/2 cups chilled whipping cream",
        "1 1/2-pint basket fresh raspberries",
        "1 1/2-pint basket fresh blackberries",
        "Powdered sugar",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Chocolate",
        "Egg",
        "Fruit",
        "Dessert",
        "Nectarine",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cocoa Meringue Baskets with Nectarines, Berries, and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/cocoa-meringue-baskets-with-nectarines-berries-and-cream-105179"
}
