{
    "directions": [
        "Combine first 3 ingredients in heavy large saucepan. Scrape in seeds from vanilla bean halves; add bean. Bring to simmer over medium heat, stirring until piloncillo dissolves. Remove from heat. Cover and steep 30 minutes.",
        "Whisk egg yolks in large bowl. Gradually whisk in coconut milk mixture. Return to same saucepan. Stir over medium-low heat until slightly thickened and thermometer registers 160°F, about 4 minutes. Cool custard 1 hour, then chill at least 2 hours or cover and chill up to 1 day.",
        "Whisk rum into custard. Remove vanilla bean halves. Process custard in ice cream maker according to manufacturer's instructions. Transfer to container. Cover and freeze at least 6 hours and up to 2 days (ice cream will not get very hard).",
        "Preheat oven to 375°F. Line baking sheet with parchment paper. Using small plate as guide, cut out 6-inch round from each tortilla. Cut each round into 6 triangles. Reassemble into rounds on prepared sheet.",
        "Grind coconut and 1 teaspoon sugar in processor. Beat egg white in small bowl until foamy. Brush some egg white all over each reassembled tortilla. Sprinkle each evenly with 2 teaspoons sugar, then 2 tablespoons ground coconut mixture.",
        "Bake tortillas until crisp and topping is golden, about 20 minutes. Cool. Break triangles apart. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
        "Working with 1 mango at a time, stand mango on its side. Cut off rounded cheek from each side of pit. Using vegetable peeler, remove skin from cheeks and rest of mango. Cut all mango flesh into small dice. Place in medium bowl. Add berries, mint, and 2 tablespoons sugar; toss gently to blend salsa. Use immediately or cover and refrigerate up to 2 hours.",
        "Scoop ice cream into center of shallow bowls. Top or surround ice cream scoops with fruit salsa. Garnish with coconut chips and serve.",
        "Available at many supermarkets and at Indian, Southeast Asian, and Latin markets.",
        "** Mexican raw sugar shaped into hard cones (smaller chunks are sometimes labeled panocha); sold at Latin markets."
    ],
    "ingredients": [
        "3 cups canned unsweetened coconut milk* (preferably organic)",
        "1 cup finely crushed piloncillo** cones",
        "1/8 teaspoon coarse kosher salt",
        "1 vanilla bean, halved lengthwise",
        "3 large egg yolks",
        "1 tablespoon dark rum",
        "4 7-inch-diameter flour tortillas",
        "1 cup sweetened flaked coconut",
        "9 teaspoons plus 2 tablespoons sugar, divided",
        "1 large egg white",
        "2 large mangoes (about 1 pound each)",
        "2 cups quartered hulled strawberries (from one 1-pound container)",
        "1 tablespoon chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Ice Cream Machine",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Hanukkah",
        "High Fiber",
        "Frozen Dessert",
        "Strawberry",
        "Coconut",
        "Mango",
        "Tortillas",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut-Piloncillo Ice Cream with Coconut Tortilla Chips and Fruit Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-piloncillo-ice-cream-with-coconut-tortilla-chips-and-fruit-salsa-356318"
}
