{
    "directions": [
        "Preheat oven to 325°F. Lightly coat a 9\" pie pan with nonstick spray. Mix egg white, coconut, sugar, butter, and salt with a rubber spatula in a large bowl until evenly combined and the consistency of a stiff paste. Using your hands, press mixture evenly onto bottom and up sides of pie pan. Bake until edges are golden brown and bottom is set and just barely golden, 15–20 minutes. Transfer pie pan to a wire rack (leave oven on to toast almonds and coconut) and let crust cool. Brush crust with melted chocolate.",
        "Bring lime zest, pandan leaf (if using), milk, and coconut milk to a simmer in a medium saucepan. Cover and let sit off heat 30 minutes.",
        "Meanwhile, toast almonds on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 8–10 minutes. Let cool. Toast coconut on same baking sheet, tossing once, until edges are golden, about 4 minutes.",
        "Stir almonds into melted chocolate in a small bowl. Spread in an even layer on a sheet of parchment paper. Sprinkle toasted coconut over chocolate almonds and chill until firm, 8–10 minutes. Coarsely chop, then cover and chill.",
        "Pluck out lime zest and pandan leaf from milk mixture; discard. Return milk mixture to a simmer. Whisk egg yolks, cornstarch, salt, and 1/2 cup sugar in a medium bowl to combine. Whisking constantly, gradually add 1/2 cup milk mixture to egg mixture. Whisking constantly, add egg mixture to milk mixture in saucepan and cook over medium heat until mixture is thickened and bubbling (it will look like thick pudding). Remove from heat and whisk in butter and lime juice.",
        "Scrape custard into crust and press a piece of plastic wrap against surface. Chill until set, about 2 hours.",
        "Just before serving, whip cream and remaining 2 tablespoons sugar in a small bowl to medium-stiff peaks. Spoon over custard, leaving about a 1\" border, and swirl decoratively. Scatter chocolatealmond mixture around perimeter.",
        "Pie (without whipped cream) can be made 3 days ahead; keep chilled."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 large egg white",
        "1 3/4 cups unsweetened shredded coconut",
        "1/4 cup sugar",
        "2 tablespoons unsalted butter, room temperature",
        "1/4 teaspoon kosher salt",
        "2 ounces bittersweet chocolate, melted, slightly cooled",
        "2 wide strips lime zest",
        "1 pandan leaf (optional)",
        "1 3/4 cups whole milk",
        "3/4 cup unsweetened coconut milk",
        "1/4 cup raw skin-on almonds, coarsely chopped",
        "2 tablespoons unsweetened shredded coconut",
        "2 ounces bittersweet chocolate, melted, slightly cooled",
        "3 large egg yolks",
        "1/4 cup cornstarch",
        "1/4 teaspoon kosher salt",
        "1/2 cup plus 2 tablespoons sugar",
        "2 tablespoons chilled unsalted butter",
        "1 teaspoon fresh lime juice",
        "1 1/2 cups heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Coconut",
        "Healthy",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Cream Pie with Macaroon Press-In Crust",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cream-pie-with-macaroon-press-in-crust-56389556"
}
