{
    "directions": [
        "Heat 3 tablespoon vegetable oil in a skillet over medium heat. Fry 1 clove garlic and 1 chopped green onion in the hot oil 30 to 60 seconds. Add the mushrooms, tomatoes, salt, and 1/2 tablespoon lime juice and cook until the tomatoes are soft, 3 to 5 minutes; set aside.",
        "Bring a pot of water to a boil; add the carrots and cook until fork tender, 5 to 7 minutes; drain and set aside.",
        "Heat another 3 tablespoons of vegetable oil in a large saucepan, cook the other clove of garlic in the hot oil 30 to 60 seconds. Add the cumin, coriander seed, and turmeric; cook another 1 to 2 minutes, allowing the spices to slightly burn on the bottom of the pan. Stir in the jalapeno pepper, 2 chopped green onions, 1/2 teaspoon salt, 1 1/2 tablespoon lime juice and the tomato mixture in with the spice mixture, scraping the bottom of the pan with a spatula to loosen the spices. Whisk in the coconut milk; simmer 6 minutes.",
        "Add the cooked shrimp, carrots, and peas to the soup and stir; simmer until hot, 3 to 5 minutes. Submerge the vermicelli pasta in the soup and allow to cook until the pasta is softened, 5 to 7 minutes more. Garnish with chopped cilantro."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "1 clove garlic, crushed",
        "1 green onions, chopped",
        "5 fresh mushrooms, chopped",
        "3 tomatoes - blanched, peeled, and chopped",
        "1/2 teaspoon salt",
        "1/2 tablespoon fresh lime juice",
        "3 large carrots, chopped",
        "3 tablespoons vegetable oil",
        "1 clove garlic, crushed",
        "1 teaspoon ground cumin",
        "1 teaspoon coriander seed",
        "1 teaspoon ground turmeric",
        "1 fresh jalapeno pepper, sliced",
        "2 green onions, chopped",
        "1/2 teaspoon salt",
        "1 1/2 tablespoons fresh lime juice",
        "1 (13.5 ounce) can coconut milk",
        "1/2 (8 ounce) can peas, drained",
        "2 cups cooked, peeled, and deveined shrimp",
        "1 (5 ounce) package vermicelli pasta",
        "1 sprig fresh cilantro, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coconut Milk Shrimp Soup",
    "url": "http://allrecipes.com/recipe/159895/coconut-milk-shrimp-soup/"
}
