{
    "directions": [
        "Preheat oven to 300°F. Butter six 3/4-cup custard cups (3 1/2 by 2 1/2inches) or a 1-quart shallow baking dish and coat with sugar, knocking out excess sugar.",
        "In a baking pan spread coconut evenly and toast until pale golden, 18 to 20 minutes. Cool coconut in pan on a rack. Toasted coconut may be made 2 days ahead and kept in an airtight container at room temperature.",
        "In a saucepan melt butter over moderately low heat and whisk in flour. Cook roux, stirring, 3 minutes and whisk in coconut milk. Bring mixture to a boil, whisking constantly, and simmer, whisking occasionally, 3 minutes. Remove pan from heat and whisk in lemon juice, coconut extract, vanilla, and 2 tablespoons sugar. Transfer mixture to a large bowl and cool mixture, its surface covered with a buttered round of wax paper. Chill coconut mixture until cold, at least 2 hours, and up to 2 days.",
        "Preheat oven to 350°F.",
        "With a wooden spoon beat coconut mixture to loosen. In a large bowl with an electric mixer beat whites with cream of tartar and a pinch salt until they just hold soft peaks. Gradually add remaining 4 tablespoons sugar, beating until whites just hold stiff peaks. Stir one fourth whites into coconut mixture to lighten and fold in remaining whites and three fourths toasted coconut gently but thoroughly.",
        "Pour soufflé mixture into custard cups or baking dish and sprinkle with remaining toasted coconut. Run tip of a knife around edges of soufflés to aid rising. Bake soufflés in lower third of oven until puffed and golden brown, 18 to 20 minutes if using custard cups or 20 to 25 minutes if using baking dish.",
        "Chop chocolate. In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth. Remove top of double boiler or bowl from heat and stir in cream until combined well.",
        "Chocolate sauce keeps, covered and chilled, 1 week.",
        "Top soufflés with sauce and serve immediately."
    ],
    "ingredients": [
        "6 tablespoons sugar plus additional for coating custard cups",
        "a 7-ounce package sweetened flaked coconut (2 2/3 cups)",
        "1 1/2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 cup canned unsweetened 14% to 15% fat coconut milk (preferably Goya brand)",
        "2 teaspoons fresh lemon juice",
        "3/4 teaspoon coconut extract",
        "1/2 teaspoon vanilla",
        "5 large egg whites",
        "1/4 teaspoon cream of tartar",
        "4 1/2 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Coconut",
        "Winter",
        "Chill",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Souffles with Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-souffles-with-chocolate-sauce-15815"
}
