{
    "directions": [
        "Adjust oven racks to lowest and lower-middle positions, and heat oven to 325 degrees. Spray 48 mini-muffin cups with vegetable cooking spray.",
        "Mix 1/2 cup of the sugar and graham cracker crumbs in a small bowl. Working in 4 batches, lay 12 cut egg roll wrap squares on work surface. Brush wrappers with melted butter on both sides, and roll each piece in the graham cracker mixture to coat, shaking off excess. Use fingers to fit wrappers in prepared muffin tins to form a cup.",
        "Place 2 muffin tins each on oven racks and bake, switching tin positions after 10 minutes, until golden and crisp, 15 to 18 minutes. Immediately remove tarts from tins and place on a wire rack to cool.  Repeat with remaining wraps. (Cooled tart shells can be stored in an airtight tin for up to 1 week.)",
        "Scatter coconut in an 8-inch baking pan. Bake on lower-middle rack, stirring every 5 minutes until evenly golden brown, about 15 minutes. For the filling, whisk cornstarch and remaining 2/3 cup sugar in a medium saucepan. Whisk in yolks, immediately followed by the milks. Turn heat to medium and cook, stirring frequently at first, then constantly as mixture starts to thicken, 8 to 10 minutes. Continue to cook, stirring constantly, for 1 minute longer. Stir in vanilla, remaining 2 Tbs. of butter and 1/2 cup of the toasted coconut. Put plastic wrap directly over the surface to prevent a skin from forming, let cool, then refrigerate. (Filling can be refrigerated up to 2 days.)",
        "When ready to assemble, arrange tart shells on a serving tray. Spoon a tablespoon of filling into each shell, sprinkle with toasted coconut, and serve."
    ],
    "ingredients": [
        "1/2 cup sugar, plus",
        "2/3 cup sugar",
        "1/2 cup graham cracker crumbs",
        "12 egg roll wraps, stacked and cut into 48 squares",
        "6 tablespoons butter, melted, plus",
        "2 tablespoons butter for custard",
        "3/4 cup sweetened coconut flakes",
        "1/4 cup cornstarch",
        "5 large egg yolks, lightly beaten",
        "2 cups whole milk",
        "1 (5 ounce) can evaporated milk",
        "2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coconut Cream Tarts",
    "url": "http://allrecipes.com/recipe/129031/coconut-cream-tarts/"
}
