{
    "directions": [
        "Preheat oven to 300°F. Line rimmed baking sheet with parchment paper. Whisk egg white, sugar, vanilla, and salt in medium bowl to blend. Add coconut shavings and toss until evenly moistened. Spread coconut mixture evenly on prepared baking sheet. Bake until coconut is light golden and beginning to crisp, stirring and turning frequently, about 22 minutes. Cool on baking sheet. DO AHEAD: Can be made 2 days ahead. Store in airtight container at room temperature.",
        "Combine light coconut milk, regular coconut milk, sugar, shredded coconut, rice, and 3/4 teaspoon salt in heavy large saucepan. If using vanilla bean, scrape in seeds from bean; add bean to saucepan. Bring mixture to simmer over medium heat, stirring occasionally. Adjust heat so that mixture is barely simmering; cover partially and cook until liquid is slightly translucent and pudding is thickened to consistency of loose oatmeal, stirring and scraping bottom and sides of pan frequently, about 45 minutes. Remove vanilla bean, if using, or stir in vanilla extract.",
        "Divide pudding among ten 3/4-cup ramekins or dessert glasses. DO AHEAD: Can be made 6 hours ahead. Cover and refrigerate. If desired, rewarm in microwave just until heated through before serving.",
        "Sprinkle crispy coconut over puddings. Serve warm or at room temperature.",
        "* Available at specialty foods stores and natural foods stores.\n** Available at many supermarkets and at Indian, Southeast Asian, and Latin markets."
    ],
    "ingredients": [
        "1 large egg white",
        "3 tablespoons sugar",
        "1/2 teaspoon vanilla extract",
        "Pinch of salt",
        "2 1/2 cups unsweetened coconut shavings* (coconut chips; about 4 ounces)",
        "2 14-ounce cans light unsweetened coconut milk**",
        "1 14-ounce can regular unsweetened coconut milk**",
        "2/3 cup sugar",
        "2/3 cup unsweetened shredded coconut*",
        "2/3 cup short-grain or long-grain rice (such as arborio or jasmine)",
        "3/4 teaspoon salt",
        "1/2 vanilla bean, split lengthwise or 2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Dessert",
        "Vegetarian",
        "Coconut",
        "Summer",
        "Winter",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Rice Puddings with Crispy Coconut",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-rice-puddings-with-crispy-coconut-241119"
}
