{
    "directions": [
        "Preheat oven to 350°F. Butter two 8-inch-diameter cake pans with 2-inch-high sides; dust with flour. Place round of parchment paper in each pan.",
        "Sift cake flour, baking powder, and salt into medium bowl. Mix milk, vanilla extract, and coconut extract in small bowl.",
        "Beat butter and 1 cup sugar in large bowl until well blended. Beat in flour mixture alternately with milk mixture in several batches, beginning and ending with flour mixture and beating just to blend after each addition.",
        "With clean dry beaters, beat egg whites in another large bowl until soft peaks form. Gradually add remaining 1/2 cup sugar and beat until stiff but not dry peaks form. Fold egg whites into batter in 3 additions.",
        "Divide batter between prepared pans. Bake until tester inserted into center of cakes comes out clean, about 35 minutes.",
        "Meanwhile, combine condensed milk and coconut cream in medium bowl.",
        "Remove cakes from oven and let cool 5 minutes. Poke holes all over top of each cake layer with skewer. Pour coconut cream mixture by half cupfuls over cakes, allowing mixture to be absorbed before adding more. Cool completely in pans.",
        "Stir 1/3 cup mint, sugar, and 3 tablespoons water in small saucepan over low heat until sugar dissolves. Cook just until bubbles appear. Cover and remove from heat; let steep 30 minutes.",
        "Strain syrup into large bowl, pressing on mint. Cool completely. Add 1 1/2 cups chilled whipping cream to syrup and beat until firm peaks form. Turn cakes out of pans onto separate plates. Peel off parchment.",
        "Spread 1 cup mint whipped cream on 1 cake layer. Top with second cake layer. Spread remaining mint whipped cream over top and sides of cake. Sprinkle with sweetened coconut. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and refrigerate."
    ],
    "ingredients": [
        "2 3/4 cups cake flour",
        "4 teaspoons baking powder",
        "3/4 teaspoon salt",
        "1 cup whole milk",
        "1 teaspoon vanilla extract",
        "1 teaspoon coconut extract (optional)",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 1/2 cups sugar, divided",
        "4 large egg whites",
        "1 14-ounce can sweetened condensed milk",
        "1 14-ounce can coconut cream",
        "1/3 cup chopped fresh mint leaves",
        "1/4 cup sugar",
        "3 tablespoons water",
        "1 1/2 cups heavy whipping cream, chilled",
        "Sweetened flaked coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Bake",
        "Coconut",
        "Mint",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Mint Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-mint-cream-cake-243444"
}
