{
    "directions": [
        "Discard crust from bread and cut enough bread into 1/2-inch cubes to measure 6 cups. In a large baking pan dry bread, uncovered, at room temperature 12 hours. (Alternatively, dry bread in a 250°F oven 1 hour.)",
        "Butter a 1 1/2-quart shallow baking dish.",
        "Drain pineapple well. Chop pecans and toast golden. In a bowl toss together bread, pineapple, and half of pecans and transfer to baking dish. In bowl whisk together eggs, sugar, milk, cream, and vanilla and pour slowly and evenly over bread mixture. Chill pudding, covered, at least 1 hour and up to 1 day.",
        "Preheat oven to 350°F.",
        "Sprinkle remaining pecans over pudding. Cut butter into bits and dot pudding with it. Bake pudding in middle of oven 20 minutes. Remove pudding from oven and drop walnut-size mounds of coconut decoratively on top. Bake pudding until coconut is golden brown, about 20 minutes more.",
        "In a small bowl stir together cornstarch and bourbon. In a small heavy saucepan bring cream, milk, sugar, and a pinch salt to a boil, stirring until sugar is dissolved. Whisk cornstarch mixture and whisk into cream mixture. Boil sauce gently, whisking, 1 minute, or until thickened. Keep sauce warm, covered.",
        "Serve pudding warm or at room temperature with sauce."
    ],
    "ingredients": [
        "3/4 pound baguette",
        "1 cup canned crushed pineapple",
        "1 cup pecans",
        "3 large eggs",
        "3/4 cup sugar",
        "1 cup milk",
        "1 1/2 cups heavy cream",
        "1 teaspoon vanilla",
        "2 tablespoons unsalted butter",
        "1 cup sweetened flaked coconut",
        "2 tablespoons cornstarch",
        "1/3 cup bourbon",
        "1 cup heavy cream",
        "1 cup milk",
        "1/4 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Mardi Gras",
        "Coconut",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Creole Bread Pudding with Bourbon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-creole-bread-pudding-with-bourbon-sauce-14569"
}
