{
    "directions": [
        "Position 1 rack in center and 1 rack in bottom third of oven and preheat to 200°F. Line 2 heavy large baking sheets with foil. Cut out one 4x2-inch cardboard or paper rectangle. Using toothpick or wooden skewer, gently outline 11 rectangles on each sheet of foil, spacing 1 inch apart (do not pierce foil).",
        "Sift first 7 ingredients into medium bowl. Using electric mixer, beat egg whites and cream of tartar in large bowl until soft peaks form. Add 2 tablespoons sugar and beat whites until firm and glossy. Beat in remaining 9 tablespoons sugar 1 tablespoon at a time, beating well after each addition. Continue to beat until very thick and stiff peaks form, about 3 minutes. Fold in spice mixture in 3 additions.",
        "Working in batches, transfer meringue to pastry bag fitted with 1/4-inch-diameter plain tip. Starting at 1 short end of each outlined rectangle, pipe meringue in crosswise lines to fill rectangles completely. Bake until dry and crisp, reversing baking sheets after 1 hour, about 2 hours.",
        "Remove baking sheets from oven. Transfer foil with meringues to racks; cool. Peel foil from meringues. (Can be made up to 4 days ahead. Layer meringues between sheets of waxed paper in airtight container. Store at room temperature.)",
        "Bring 1/2 cup cream to boil in heavy medium saucepan. Remove from heat. Add chocolate and whisk until smooth. Cool completely, whisking occasionally, about 20 minutes.",
        "Using electric mixer, beat 1 1/2 cups cream in large bowl until soft peaks form. Fold in chocolate mixture in 4 additions.",
        "Line baking sheet with foil. Spread 2 tablespoons chocolate cream atop 1 meringue, leaving 1/2-inch border around edges. Top with second meringue. Repeat layering with 2 tablespoons chocolate cream and third meringue. Place meringue stack on prepared baking sheet. Repeat layering with 2 tablespoons chocolate cream and third meringue. Place meringue stack on prepared baking sheet. Repeat with 15 more meringues and chocolate cream to make 6 meringue stacks total.",
        "Place remaining 4 meringues in plastic bag and close tightly. Using rolling pin, finely crush meringues. Place meringue crumbs in shallow dish.",
        "Spread enough remaining chocolate cream around sides (not tops) of meringue stacks to cover. (Reserve any remaining chocolate cream for another use.) Coat sides with meringue crumbs. Refrigerate pastries at least 1 hour. (Can be made 1 day ahead. Cover and keep chilled.)",
        "Sift cocoa powder and powdered sugar evenly over pastries and serve."
    ],
    "ingredients": [
        "1 cup powdered sugar",
        "3 tablespoons unsweetened cocoa powder",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "3/4 cup egg whites (5 to 6 large)",
        "1/2 teaspoon cream of tartar",
        "11 tablespoons sugar",
        "1/2 cup whipping cream",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "1 1/2 cups chilled whipping cream",
        "1 tablespoon unsweetened cocoa powder",
        "1 tablespoon powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Spice"
    ],
    "title": "Cocoa-Spice Meringues with Chocolate Cream",
    "url": "http://www.epicurious.com/recipes/food/views/cocoa-spice-meringues-with-chocolate-cream-3097"
}
