{
    "directions": [
        "1. In a small saucepan, combine the milk, coconut milk, and vanilla and bring to a gentle simmer over medium-low heat. Stir in the tapioca, decrease the heat to low, and cook, stirring occasionally, for about 30 minutes, or until the tapioca is softened. The tapioca will become translucent and will no longer have a white center when it is fully cooked.",
        "2. Meanwhile, put the pineapple (either fresh or canned with juice) and the apple juice concentrate in a medium saucepan and bring to a boil over medium-high heat. Using a small paring knife, split the vanilla bean in half lengthwise, and scrape the seeds into the juice.",
        "3. Decrease the heat to medium-low and simmer the juice and fruit for 20 to 25 minutes, or until the juice becomes thick and syrupy. It will thicken up and boil a little slower as it reduces. Watch out that it does not over-boil or burn; you may need to decrease the heat as it thickens. Remove from the heat and strain the pineapple from the juice. Put the pineapple in a bowl and refrigerate until chilled.",
        "4. Remove the tapioca from the heat and stir in the reduced juice and the salt. Transfer the tapioca mixture to a bowl, cover lightly with plastic wrap, and refrigerate until it cools completely, at least 3 hours or up to overnight.",
        "5. Right before serving, fold about half of the diced mango and the lime juice into the tapioca. Divide the pudding evenly into clear glasses. Fold the remaining mango into the reserved chopped pineapple. Spoon the fruit on top of the pudding to cover in an even layer. Garnish with a little grated lime zest. Serve immediately."
    ],
    "ingredients": [
        "480 g/2 cups whole milk",
        "One 380-g/13.5-oz can unsweetened coconut milk",
        "2 tsp vanilla extract",
        "80 g/1/2 cup small pearl tapioca",
        "1/4 pineapple, peeled, cored, and cut into small dice, or one 225-g/8-oz can pineapple chunks, in their own juices, chopped into smaller pieces",
        "One 335-g/12-oz can frozen apple juice concentrate, thawed",
        "1 vanilla bean",
        "1/4 tsp kosher salt",
        "1 large or 2 small mangoes, peeled, pitted, and diced",
        "Finely grated zest and juice of 1 lime"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Vegetarian",
        "Kid-Friendly",
        "Low/No Sugar",
        "Coconut",
        "Mango",
        "Spring",
        "Summer",
        "Healthy",
        "Apple Juice",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Tapioca With Pineapple, Mango, And Lime",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-tapioca-with-pineapple-mango-and-lime-56389471"
}
