{
    "directions": [
        "Blend flour, sugar, and salt in processor. Add butter and shortening; using on/off turns, cut in until mixture resembles coarse meal. Drizzle 4 tablespoons ice water over mixture. Process just until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic. Chill 1 hour.",
        "Roll out dough between 2 sheets of plastic wrap to 14-inch round. Transfer dough to 9-inch-diameter glass pie dish. Fold overhang under. Crimp edges decoratively. Pierce bottom of crust all over with fork. Freeze crust 15 minutes. (Can be made 1 day ahead. Keep frozen.)",
        "Preheat oven to 375°F. Line crust with aluminum foil. Fill with pie weights or dried beans. Bake 20 minutes. Remove weights and foil. Bake until golden and set, about 10 minutes. Cool. (Crust can be made 1 day ahead. Wrap tightly with plastic wrap. Let stand at room temperature.)",
        "Whisk 1/2 cup sugar, eggs, egg yolk, and flour in medium bowl. Bring milk and coconut to simmer in medium saucepan over medium heat. Gradually add hot milk mixture to egg mixture, whisking constantly. Return to same saucepan; cook until pastry cream thickens and boils, stirring constantly, about 4 minutes. Remove from heat. Mix in vanilla and coconut extracts. Transfer pastry cream to medium bowl. Press plastic wrap directly onto surface to prevent formation of skin. Chill until cold, at least 2 hours and up to 1 day. Transfer filling to crust. Cover; chill overnight.",
        "Toast coconut in heavy small skillet over medium heat until lightly browned, stirring occasionally, about 3 minutes. Cool completely.",
        "Using electric mixer, beat cream, sugar, and coconut extract in medium bowl until peaks form. Spread whipped cream all over top of filling. Sprinkle evenly with toasted coconut. (Can be prepared 4 hours ahead. Cover and refrigerate.) Serve cold."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 tablespoon sugar",
        "1/2 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into small pieces",
        "3 tablespoons chilled solid vegetable shortening, cut into small pieces",
        "4 tablespoons (or more) ice water",
        "1/2 cup sugar",
        "2 large eggs",
        "1 large egg yolk",
        "3 tablespoons all purpose flour",
        "1 1/2 cups whole milk",
        "1 1/2 cups sweetened flaked coconut",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon coconut extract",
        "2/3 cup sweetened flaked coconut",
        "1 1/4 cups chilled whipping cream",
        "2 tablespoons sugar",
        "1/8 teaspoon coconut extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Coconut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cream-pie-107115"
}
