{
    "directions": [
        "Soak the quinoa in a bowl filled with cold water for 5 minutes, then drain using a fine mesh strainer, and rinse with running water. Set the strainer aside so the quinoa can drain, then bring 3 1/2 cups of water and 1 tablespoon of salt to a boil in a saucepan. Stir in the quinoa, cover, and reduce the heat to medium-low. Simmer until the quinoa has absorbed the liquid and is tender, about 15 minutes. Set aside, and keep warm.",
        "Melt the coconut oil in a large saucepan over medium heat. Add the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomatoes, and cook for 5 minutes more. Pour in the water and coconut milk, and add the molasses, coconut powder, cinnamon, curry powder, and ground coriander. Bring to a simmer over medium-high heat, then stir in the lentils, and cook until just tender, 10 to 15 minutes. Stir frequently as the lentils cook to keep them from sticking. Be careful not to overcook them, as they will quickly loose shape and become a paste.",
        "Once the lentils are done, season to taste with salt and pepper, and stir in the chopped cilantro. Serve the lentil stew over a bed of quinoa."
    ],
    "ingredients": [
        "2 cups quinoa",
        "3 1/2 cups water",
        "1 tablespoon salt",
        "2 tablespoons coconut oil",
        "1 small onion, chopped",
        "6 cloves garlic, minced",
        "5 large tomatoes, chopped",
        "1 cup water",
        "1 (14 ounce) can coconut milk",
        "1 tablespoon molasses",
        "1/4 cup coconut powder",
        "1 (4 inch) cinnamon stick",
        "3 tablespoons curry powder",
        "2 tablespoons ground coriander",
        "2 cups red lentils",
        "salt and pepper to taste",
        "1 bunch fresh cilantro, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coconut-Curry Lentil Stew Served over Quinoa",
    "url": "http://allrecipes.com/recipe/166485/coconut-curry-lentil-stew-served-over/"
}
