{
    "directions": [
        "Bring butter, brown sugar, and corn syrup to a boil over moderate heat, stirring. Add flour and cook, stirring constantly, until dough is slightly thickened, about 1 minute. Stir in coconut and cool to room temperature, about 45 minutes.",
        "Preheat oven to 375°F. Crumple foil to form a solid cone (about 6 inches long and 3 inches across widest part) for shaping cookies.",
        "Drop 2 (1-tablespoon) portions of dough 6 inches apart on a buttered baking sheet and pat each into a 5-inch round with your fingertips. Bake in middle of oven until golden, 6 to 8 minutes (cookies will spread to about 6 inches).",
        "Let cookies stand on baking sheet until just firm enough to hold their shape, about 2 minutes. Gently loosen cookies from baking sheet with offset spatula, then turn over so smooth sides are facing up. Roll 1 cookie onto cone and cool on cone until cookie holds cone shape, about 15 seconds, then carefully slip off onto a rack to cool completely. Shape remaining cookie in same manner. (If cookies become too brittle to roll onto cone, return baking sheet to oven for a few seconds to soften.) Make and shape more cookies with remaining dough.",
        "Put 3 small scoops ice cream into each cone and put cones on plates."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup packed light brown sugar",
        "3 tablespoons light corn syrup",
        "1/4 cup all-purpose flour",
        "1/2 cup sweetened flaked coconut",
        "Accompaniment: passion-fruit ice cream",
        "Garnish: sliced star fruit",
        "Special equipment: a small metal offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Coconut",
        "Summer",
        "Passion Fruit",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Tuile Cones with Passion-Fruit Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-tuile-cones-with-passion-fruit-ice-cream-106601"
}
