{
    "directions": [
        "Heat oven to 325°F with racks in upper and lower third. Line 2 large baking sheets with parchment paper.",
        "Stir together coconut, sugar, flour, and salt until combined well, then add egg whites and almond extract and stir until combined well.",
        "Pack dough in a teaspoon measure, preferably with offset spatula, scraping it level, then use spatula to remove dough from teaspoon in a single mound. Arrange mounds, rounded side up, 1 inch apart, on baking sheets.",
        "Bake until just springy to the touch and bottoms are pale golden, 8 to 12 minutes, switching position of sheets halfway through baking.",
        "Remove cookies from oven and sprinkle while still hot with edible glitter, if using. Cool cookies on baking sheet 1 minute, and transfer to racks to cool completely.",
        "Whisk together lime zest and juice, sugar, cornstarch, and salt in a 2-quart heavy saucepan until cornstarch is dissolved, then whisk in butter. Bring to a simmer over moderately high heat, whisking constantly, then reduce heat and continue to simmer briskly, whisking constantly, 1 minute. Remove pan from heat.",
        "Lightly beat yolks in a small bowl, then slowly add 1/4 cup lime mixture, whisking. Add yolk mixture to remaining lemon mixture, whisking, then cook over low heat, whisking constantly, until curd is thick enough to hold marks of whisk, 1 to 2 minutes. Transfer to a bowl, then cover surface with wax paper and chill until cold, about 1 hour.",
        "Transfer lime curd to plastic bag and press out excess air. Snip a 1/8-inch opening in bottom corner of bag, then twist bag firmly just above curd.",
        "Put 1 cookie, flat side up, on work surface and pipe about 1/2 teaspoon lime curd onto cookie, then top with another cookie, flat side down, to form a sandwich. Make more sandwiches in same manner."
    ],
    "ingredients": [
        "1 (14-ounce) bag (5 1/3 cups) sweetened flaked coconut",
        "1/2 cup sugar",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "4 large egg whites",
        "1/4 teaspoon pure almond extract",
        "1 tablespoon lime zest",
        "3/4 cup fresh lime juice (from about 6 limes)",
        "3/4 cup sugar",
        "2 1/2 tablespoons cornstarch",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, cut into pieces",
        "4 large egg yolks",
        "1 drop green food coloring, if desired",
        "Edible gold or silver glitter or clear sanding sugar (optional)",
        "Special equipment: Small offset spatula (optional, but very helpful); edible gold or silver glitter; a heavy-duty resealable plastic bag (not pleated)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Bake",
        "Christmas",
        "Lime",
        "Coconut",
        "Edible Gift",
        "Christmas Eve",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Macaroon Sandwiches with Lime Curd",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-macaroon-sandwiches-with-lime-curd-51142230"
}
