{
    "directions": [
        "Heat 1 tablespoon butter in large nonstick skillet over medium-high heat. Add onions; sauté until golden, about 2 minutes. Reduce heat to low and sauté until onions are just tender, about 8 minutes. Transfer onions to bowl. Heat 1 tablespoon butter in same skillet over medium-high heat. Add okra; sauté until crisp-tender, about 3 minutes. Add okra to bowl with onions. Heat 1 tablespoon butter in same skillet over medium-high heat. Add eggplants; sprinkle with salt and pepper. Sauté eggplants until brown on cut surfaces and just tender, about 6 minutes. Add eggplant to onions. Melt remaining 2 tablespoons butter in same skillet. Add carrots. Sauté until carrots begin to soften, about 3 minutes. Add tomatoes and stir to blend; add to vegetable mixture in bowl. Reserve skillet for sauce.",
        "Heat butter in reserved skillet over medium-high heat. Add chopped onions and sauté until golden, about 14 minutes. Reduce heat to medium. Add ginger and garlic; sauté 1 minute. Add curry leaves, mustard seeds, turmeric, fenugreek, and cayenne; sauté 1 minute. Add vegetable mixture and 1 teaspoons salt. Add coconut milk and bring to simmer. Reduce heat to medium-low and simmer uncovered until vegetables are just tender, stirring occasionally, about 8 minutes. Mix in lime juice. Season to taste with salt and pepper.",
        "Transfer curry to bowl. Serve over basmati rice or Savory Semolina.",
        "*Also known as kari patta; available at Indian markets.",
        "**Sold at specialty foods stores, Indian and Asian markets, and adrianascaravan.com. If unavailable, substitute brown mustard seeds.",
        "***Available at Indian and Middle Eastern markets."
    ],
    "ingredients": [
        "5 tablespoons Clarified Butter , divided",
        "12 pearl onions, blanched 1 minute,peeled",
        "10 fresh okra pods",
        "6 Indian eggplants (each about 3 inches long) or 4 Asian eggplants, trimmed, each quartered lengthwise",
        "2 large carrots (about 10 ounces), peeled, cut on diagonal into 1/4-inch-thick ovals",
        "1 1/2 pounds tomatoes, cored, cubed",
        "5 tablespoons Clarified Butter",
        "1 pound white onions, chopped",
        "1 tablespoon minced peeled fresh ginger",
        "1 large garlic clove, chopped",
        "2 1/2 teaspoons chopped fresh or frozen curry leaves* (about 16 leaves)",
        "1 1/2 teaspoons black mustard seeds**",
        "1 teaspoon turmeric",
        "1/2 teaspoon fenugreek seeds***",
        "1/2 teaspoon cayenne pepper",
        "1 1/2 to 2 teaspoons coarse kosher salt",
        "3 1/2 cups canned unsweetened coconut milk (preferably organic)",
        "1/4 cup fresh lime juice",
        "Basmati rice or Savory Semolina"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "High Fiber",
        "Lime",
        "Coconut",
        "Curry",
        "Eggplant",
        "Okra"
    ],
    "title": "Coconut-Vegetable Curry",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-vegetable-curry-240116"
}
