{
    "directions": [
        "Preheat oven to 350°F. Blend first 4 ingredients in processor until sticky crumbs form. Press crumbs onto bottom and up sides of 9-inch-diameter metal pie pan. Freeze 10 minutes.",
        "Bake crust until golden brown, about 10 minutes. Cool. Freeze crust.",
        "Whisk 1 cup cream of coconut, egg yolks and lemon juice in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until candy thermometer registers 160°F, about 3 minutes. Remove bowl from over water. Using electric mixer, beat mixture until cool and thick, about 5 minutes.",
        "Combine whipping cream, extract and remaining cream of coconut in another large bowl. Beat until soft peaks form. Fold cream mixture and 1 cup toasted coconut into egg mixture. Freeze until softly set, stirring occasionally, about 3 hours.",
        "Spoon filling into crust, mounding slightly. Cover and freeze overnight. (Can be prepared 1 week ahead. Keep frozen.)",
        "Run small knife around sides of pan. Arrange pineapple atop pie in overlapping circles. Brush with preserves. Sprinkle with 1 tablespoon toasted coconut."
    ],
    "ingredients": [
        "1 cup (packed) sweetened flaked coconut, toasted",
        "1 cup graham cracker crumbs",
        "3 tablespoons butter, melted",
        "1 large egg white",
        "1 15-ounce can cream of coconut (such as Coco López)",
        "6 large egg yolks",
        "2 tablespoons fresh lemon juice",
        "2 cups chilled whipping cream",
        "1/2 teaspoon imitation coconut extract",
        "3 tablespoons dark rum",
        "1 cup plus 1 tablespoon sweetened flaked coconut, toasted",
        "1 pineapple, peeled, halved lengthwise, cored, thinly sliced crosswise",
        "1/4 cup apricot preserves, stirred to loosen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Apricot",
        "Coconut",
        "Pineapple",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut-Rum Pie with Pineapple",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-rum-pie-with-pineapple-4225"
}
