{
    "directions": [
        "Preheat oven to 350°F. Spread 1/2 cup flaked coconut on rimmed baking sheet. Bake until light golden, stirring once, 10 to 12 minutes.",
        "Whisk 3/4 cup sugar and egg yolks in medium bowl to blend. Mix cream, coconut milk, toasted coconut, and remaining 1/2 cup sweetened flaked coconut in heavy large saucepan. Bring just to simmer over medium-high heat, whisking occasionally. Gradually whisk hot cream mixture into yolk mixture. Stir in rum and 1/2 teaspoon salt. Strain custard through fine strainer into medium pitcher, pressing on solids. Divide among eight 2/3- to 3/4-cup ramekins or custard cups.",
        "Place ramekins in large roasting pan. Fill pan with enough hot water to come halfway up sides of ramekins. Bake custards until edges are set but centers move slightly when dishes are gently shaken, 45 to 50 minutes. Remove custards from water. Chill custards uncovered until cold, then cover and chill overnight.",
        "Sprinkle 1 teaspoon sugar over each custard. Using kitchen torch, heat sugar until melted and deep amber. (Alternatively, preheat broiler. Place ramekins on rimmed baking sheet and broil until sugar melts and turns deep amber, 1 to 2 minutes.) Chill until sugar hardens, about 15 minutes. DO AHEAD: Can be made 1 hour ahead. Keep chilled.",
        "Sold at many supermarkets and at Indian, Southeast Asian, and Latin markets."
    ],
    "ingredients": [
        "1 cup sweetened flaked coconut, divided",
        "3/4 cup plus 8 teaspoons sugar",
        "7 large egg yolks",
        "1 3/4 cups heavy whipping cream",
        "1 14-ounce can unsweetened coconut milk*",
        "2 tablespoons Malibu rum or other coconut-flavored rum",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Dessert",
        "Bake",
        "Coconut",
        "Simmer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Crème Brûlée",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-creme-brulee-357489"
}
