{
    "directions": [
        "Whisk flour, cocoa and baking powder in small bowl to blend. Using electric mixer, beat butter, 1 cup sugar and 1/2 cup powdered sugar in large bowl until well blended. Beat in egg, then peanut butter and vanilla. Add dry ingredients; beat until well blended. Divide dough into 4 pieces; flatten each into disk. Wrap dough in plastic; chill overnight.",
        "Position 1 rack in center and 1 rack in bottom third of oven and preheat to 375°F. Butter 2 baking sheets. Sprinkle work surface generously with additional sugar. Place 1 dough disk atop sugar on work surface (dough will be soft; keep remainder refrigerated). Sprinkle top of dough with additional sugar. Roll out dough to generous 1/4-inch thickness, sprinkling with additional sugar as needed to prevent sticking.",
        "Using 3-inch heart-shaped cookie cutter, cut out cookies. Transfer cookies to prepared baking sheets, spacing 2 inches apart. Using small heart-shaped or round cookie cutter, make 1 hole in center of half of cookies. Gather dough scraps; reshape into disk and refrigerate. Bake cookies until puffed and beginning to crack on top, about 7 minutes. Using spatula, transfer cookies to rack; cool completely. Repeat rolling, cutting and baking with remaining dough disks and scraps. (Can be made 2 days ahead. Store between layers of waxed paper in airtight container.)",
        "Stir chopped milk chocolate in top of double boiler over barely simmering water until melted and smooth. Remove chocolate from over water. Sift additional powdered sugar over cookies with hole. Place 1 solid cookie, bottom side up, on work surface. Spread 1 teaspoon melted chocolate over. Spoon 1 scant teaspoon strawberry jelly atop chocolate in center. Immediately top with cookie with hole, placing hole over jelly and pressing gently to adhere (cookies are very tender). (Can be prepared 1 day ahead. Store in single layer in airtight container and refrigerate. Cookies may soften slightly.)"
    ],
    "ingredients": [
        "2 cups unbleached all purpose flour",
        "1/2 cup unsweetened cocoa powder (preferably Dutch-process)",
        "1/2 teaspoon baking powder",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup sugar",
        "1/2 cup powdered sugar",
        "1 large egg",
        "1 cup creamy peanut butter (do not use old-fashioned style or freshly ground)",
        "2 teaspoons vanilla extract",
        "Additional sugar",
        "12 ounces imported milk chocolate (such as Lindt), finely chopped",
        "Additional powdered sugar",
        "1 cup (about) strawberry jelly, whisked to loosen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kid-Friendly",
        "Peanut",
        "Winter",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cocoa-Peanut Butter Heart-Shaped Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/cocoa-peanut-butter-heart-shaped-sandwich-cookies-100494"
}
