{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and sugar on high speed until light and fluffy, about 5 minutes. With the mixer on low speed, add the eggs, 1 at a time, scraping down the bowl after each addition. Add the vanilla and almond extracts and mix well.",
        "In a separate bowl, sift together the flour, baking powder, baking soda, and salt. In 3 parts, alternately add the dry ingredients and the buttermilk to the batter, beginning and ending with the dry. Mix until just combined. Fold in 7 ounces of coconut.",
        "Line a muffin pan with paper liners. Fill each liner to the top with batter. Bake for 25 to 35 minutes, until the tops are brown and a toothpick comes out clean. Allow to cool in the pan for 15 minutes. Remove to a baking rack and cool completely.",
        "Meanwhile, make the frosting. In the bowl of an electric mixer fitted with the paddle attachment, on low speed, cream together the cream cheese, butter, and vanilla and almond extracts. Add the confectioners' sugar and mix until smooth.",
        "Frost the cupcakes and sprinkle with the remaining coconut."
    ],
    "ingredients": [
        "3/4 pound (3 sticks) unsalted butter, room temperature",
        "2 cups sugar",
        "5 extra-large eggs at room temperature",
        "1 1/2 teaspoons pure vanilla extract",
        "1 1/2 teaspoons pure almond extract",
        "3 cups flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1 cup buttermilk",
        "14 ounces sweetened, shredded coconut",
        "1 pound cream cheese at room temperature",
        "3/4 pound (3 sticks) unsalted butter, room temperature",
        "1 teaspoon pure vanilla extract",
        "1/2 teaspoon pure almond extract",
        "1 1/2 pounds confectioners' sugar, sifted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Mixer Recipes",
        "Cupcake",
        "Cheese",
        "Cream Cheese Recipes",
        "Coconut Recipes",
        "Fruit",
        "Buttermilk",
        "Dairy Recipes",
        "Sugar",
        "Egg Recipes"
    ],
    "title": "Coconut Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/coconut-cupcakes-recipe"
}
