{
    "directions": [
        "Preheat oven to 350°F and butter 2 (8-inch) square cake pans (2 inches deep).",
        "Sift flour with salt into a bowl.",
        "Heat eggs and sugar in large metal bowl set over a pot of simmering water, gently whisking constantly, until lukewarm.",
        "Remove bowl from heat and add vanilla, then beat with an electric mixer at medium-high speed until thick and pale and tripled in volume (about 5 minutes with a standing mixer or 10 minutes with a hand held). Sift flour and salt over eggs in 2 batches, folding gently but thoroughly after each batch. Fold in melted butter until combined. Divide batter evenly between cake pans, smoothing tops.",
        "Bake cakes in middle of oven until a tester comes out clean and cakes are golden, about 15 minutes. Cool in pans on racks 5 minutes, then invert onto racks to cool completely.",
        "Stir together filling ingredients in a heavy saucepan until cornstarch is dissolved. Bring to a boil, stirring constantly, then simmer, stirring, 3 minutes. Cool filling completely, stirring occasionally.",
        "Bring water and sugar to a boil in a small heavy saucepan, stirring until sugar is dissolved. Remove from heat and stir in rum. Transfer to a small bowl and chill until ready to use.",
        "Trim edges of cakes if necessary and cut each horizontally in half with a long serrated knife to form a total of 4 thin layers. Put 1 cake layer, cut side up, on a cake plate and brush top with some rum syrup, then spread half of pineapple filling over it. Top with another cake layer and brush with syrup, then spread with about 2/3 cup butter cream. Top with a third cake layer and brush with syrup, then spread remaining pineapple over it. Top with fourth layer, cut side down, and brush with remaining syrup. Frost sides and top of cake with remaining butter cream, then coat with coconut."
    ],
    "ingredients": [
        "1 cup cake flour (not self-rising)",
        "1/2 teaspoon salt",
        "6 large eggs at room temperature",
        "1 cup sugar",
        "2 teaspoons vanilla",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "1 (20-ounce) can crushed pineapple, including juice",
        "2 tablespoons sugar",
        "1 tablespoon cornstarch",
        "1 teaspoon fresh lemon juice",
        "2/3 cup water",
        "1/4 cup sugar",
        "3 tablespoons light rum",
        "Coconut buttercream",
        "3 1/2 cups fresh coconut shavings (see how to crack and shave fresh coconut ) or 2 2/3 cups sweetened flaked coconut (7-oz package)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Coconut",
        "Pineapple",
        "Spring",
        "Birthday",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Pineapple Cake",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-pineapple-cake-104903"
}
