{
    "directions": [
        "Stir peppercorns and coriander in small skillet over medium heat until spices are darker in color,about 5 minutes. Transfer toasted spices to spice grinder; grind finely. Place in small bowl; mix in remaining ingredients. DO AHEAD: Can be made 1 week ahead. Cover and let stand at room temperature.",
        "Heat oil in large pot over medium heat. Add onions and sage; sprinkle with salt and pepper. Sauté10 minutes. Add 1 1/2 cups water; cover and cook until onions are soft, about 15 minutes. Uncover; continue to cook until onions are beginning to brown and water has evaporated, about 30 minutes.",
        "Meanwhile, preheat oven to 300°F. Sprinkle spice rub on large sheet of foil. Roll pork in rub, pressing to coat (some of rub will be leftover). Set pork on rack in large roasting pan. Top pork with 1/3 of onions; scatter remaining onions around pork in pan.",
        "Roast pork and onions until onions are deep brown, stirring occasionally, about 3 hours. Transfer onions from pan to medium bowl. Continue to roast pork until very tender and thermometer inserted into center registers 165°F, about 2 1/2 hours longer. Transfer pork to platter. Rewarm onions in microwave at 10 second intervals and season with salt and pepper; spoon around pork.",
        "Seghesio 2005 Sangiovese (Sonoma, $25). Its hints of spice and dark fruit flavors are a slam-dunk with pork."
    ],
    "ingredients": [
        "1/2 tablespoon whole white peppercorns",
        "1/2 tablespoon whole coriander seeds",
        "2 tablespoons plus 3/4 teaspoon ground cinnamon",
        "2 tablespoons coarse sea salt (preferably gray crystals)",
        "1 tablespoon plus 2 1/4 teaspoons unsweetened cocoa powder",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "6 tablespoons extra-virgin olive oil",
        "3 3/4 to 4 pounds onions, thinly sliced",
        "1 1/2 tablespoons chopped fresh sage",
        "1 1/2 cups water",
        "1 5-pound pork shoulder butt with bone"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Onion",
        "Pork",
        "Roast",
        "High Fiber",
        "Spice",
        "Fall",
        "Healthy"
    ],
    "title": "Cocoa and Spice Slow-Roasted Pork with Onions",
    "url": "http://www.epicurious.com/recipes/food/views/cocoa-and-spice-slow-roasted-pork-with-onions-240744"
}
