{
    "directions": [
        "Bring 8 cups water to a boil in a 2-quart saucepan and add tapioca, stirring constantly. Gently boil, stirring occasionally, until tapioca is almost completely translucent, 40 minutes to 1 1/2 hours, depending on size of tapioca.",
        "Remove from heat and let tapioca stand, covered, until completely translucent, 45 minutes to 1 1/2 hours, depending on size.",
        "While tapioca is standing, bring sugar, a pinch of salt, and remaining 1/4 cup water to a simmer in a small heavy saucepan, stirring until sugar is dissolved. Simmer syrup until slightly thickened, about 5 minutes.",
        "Scoop out 3/4 cup (total) of thick layer of coconut cream from tops of cans (reserving remainder for another use) and whisk into syrup until combined well. Chill syrup until cold, about 1 hour.",
        "Add 3 cups cold water to translucent tapioca, then drain in a sieve. Transfer tapioca to a large bowl filled halfway with cold water, swirl, and then drain in sieve. (This removes excess starch.)",
        "Spoon 3 tablespoons syrup into each of 4 glasses (there will be some left over), then divide fruit and tapioca among them. Top with shaved ice.",
        "*Available at Asian markets and Uwajimaya (800-889-1928)."
    ],
    "ingredients": [
        "8 1/4 cups water",
        "2/3 cup large (3/4- to 1/4-inch) pearl tapioca (not quick-cooking)",
        "1/2 cup grated or crumbled dark palm sugar (4 oz)*",
        "2 (13- to 14-oz) cans unsweetened coconut milk (do not shake)",
        "2 firm-ripe mangoes (1 1/2 lb total), peeled, pitted, and cut into 1/4-inch pieces",
        "1 lb firm-ripe papaya (preferably red), peeled, seeded, and cut into 1/4-inch pieces",
        "1/2 pineapple, peeled, cored, and cut into 1/4-inch pieces",
        "2 cups shaved ice",
        "Garnish: fresh coconut shavings, toasted",
        "Special equipment: an ice shaver, preferably manual"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Frozen Dessert",
        "Coconut",
        "Mango",
        "Summer",
        "Tapioca",
        "Gourmet"
    ],
    "title": "Coconut and Palm Sugar Syrup with Tapioca, Tropical Fruit, and Shaved Ice",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-and-palm-sugar-syrup-with-tapioca-tropical-fruit-and-shaved-ice-105432"
}
