{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "Grease a 10-inch cake pan and set aside. To the bowl of a mixer fitted with a whip attachment, add all the ingredients and mix until just combined. Scrape down the sides of the bowl with a rubber spatula to ensure even mixing. Slowly increase the speed to the highest setting and whip for 10 minutes. The cake batter will double in volume. Pour batter into the prepared pan. Bake for 35 to 40 minutes, until firm when touched, or when a toothpick that has been inserted into the center comes out clean.",
        "Turn the cake onto a cooling rack and let it rest in the pan until cool enough to remove. Run a pairing knife around the edge to loosen the cake and then invert it onto the rack. When completely cool, slice the cake in half. Frost the bottom layer and then position the second layer directly on top. Frost the top of the cake and the sides until cake is completely covered.",
        "In a stainless steel bowl, whisk together the egg whites and sugar until combined. Place the bowl with the egg white mixture over a pan of simmering water, creating a double boiler. Be careful that the bowl does not touch the water. Heat the egg white mixture until it is very warm to the touch.",
        "Pour mixture into the bowl of an electric mixer fitted with a whip attachment and whip on the highest setting until the mixture is thick and fluffy, about 10 to 15 minutes. Once the mixture has reached full volume, reduce the speed to medium; add all of the shortening and then add the butter, 1 chunk at a time. Return the mixer to the highest setting and continue to whip until all the butter and shortening are incorporated and the mixture is smooth and creamy. Transfer to a plastic container until ready to use."
    ],
    "ingredients": [
        "9 eggs",
        "2 cups sugar",
        "1 cup fluid flex* (high-ratio liquified cake shortening)",
        "3/4 cups coconut milk",
        "2 1/4 cups cake flour",
        "1 1/2 tablespoons baking powder",
        "1 1/2 teaspoons salt",
        "1/3 cup coconut rum",
        "2 cups coconut flakes",
        "Swiss Meringue Buttercream, recipe follows",
        "1 cup egg whites (extra-large eggs)",
        "2 cups granulated sugar",
        "1/4 cup shortening",
        "1/2 cup unsalted butter (1 stick), cut into chunks"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Rum Cake",
        "Cake",
        "Rum Recipes",
        "Coconut Cake",
        "Coconut Recipes",
        "Fruit",
        "Baking",
        "Dessert",
        "American",
        "Egg Recipes"
    ],
    "title": "Coconut Cake",
    "url": "http://www.foodnetwork.com/recipes/coconut-cake-recipe"
}
