{
    "directions": [
        "Combine flour, coconut oil, 2 tablespoons sugar, and salt in the bowl of a stand mixer fitted with the paddle attachment; mix until mixture forms large crumbles. Pour in ice water in a steady stream and continue to mix until dough comes together, about 30 seconds.",
        "Transfer dough to a large sheet of plastic wrap. Form into a disc and wrap tightly. Chill for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Press 3/4 of the dough into the bottom of a broiler-safe pie plate.",
        "Bake in the preheated oven until golden brown, about 30 minutes. Let crust cool completely.",
        "Combine 2 cups sugar, coconut cream, eggs, egg yolks, lemon zest and juice, butter, and salt in a saucepan over medium-low heat. Cook, whisking constantly, until curd thickens and coats the back of a wooden spoon, 10 to 12 minutes. Pour into a bowl and refrigerate until set, 20 to 30 minutes.",
        "Beat egg whites, 1/2 cup sugar, salt, and cream of tartar in a glass, metal, or ceramic bowl until stiff, glossy peaks form, 6 to 7 minutes.",
        "Pour chilled curd into the cooled crust. Dollop big spoonfuls of meringue all over the curd.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Broil in the preheated oven until meringue is lightly browned, about 2 minutes. Chill pie until set, 3 to 24 hours."
    ],
    "ingredients": [
        "Crust:",
        "2 cups all-purpose flour",
        "1 cup solid coconut oil",
        "2 tablespoons white sugar",
        "1 pinch salt",
        "1/4 cup ice water",
        "Curd Filling:",
        "2 cups white sugar",
        "1 cup coconut cream",
        "3 eggs",
        "3 egg yolks",
        "3 lemons, zested and juiced",
        "3 tablespoons butter, softened",
        "1 pinch salt",
        "Meringue:",
        "3 egg whites",
        "1/2 cup white sugar",
        "1 pinch salt",
        "1 pinch cream of tartar (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coconut and Lemon Cream Pie",
    "url": "http://allrecipes.com/recipe/256694/coconut-and-lemon-cream-pie/"
}
