{
    "directions": [
        "Bring 3 cups water to boil in heavy medium saucepan. Add rice; reduce heat to medium and simmer uncovered until very tender, about 18 minutes. Drain if necessary. Whisk 1/2 cup plus 1 tablespoon sugar, eggs, egg yolks, cornstarch, and vanilla in large bowl to combine. Bring whole milk, coconut milk, remaining 1/2 cup plus 1 tablespoon sugar, and salt to boil in heavy medium saucepan. Pour over sugar-egg mixture, whisking constantly. Strain mixture back into saucepan and bring to boil over medium heat. Whisk gently until slightly thickened. Remove from heat. Fold in cooked rice and coconut. Pour into bowl, pressing plastic wrap onto surface, and refrigerate until cold, about 4 hours. (Can be prepared up to 1 day ahead. Keep refrigerated.) Stir in cream.",
        "Preheat oven to 350°F. Line large rimmed baking sheet with parchment paper. Toss coconut, flour, both sugars, and salt in large bowl to combine. Using fingertips, rub butter into mixture until clumps form. Spread mixture on baking sheet, patting down slightly. Bake until golden brown, about 20 minutes. Cool. Break crumble into bite-size pieces.",
        "Toss pineapple and mango in bowl to combine. Spoon 1/4 cup rice pudding into each of 6 wineglasses. Top each with 1/4 cup fruit mixture. Sprinkle each with 2 tablespoons macaroon crumble. Repeat with remaining pudding and fruit mixture (reserve remaining pudding for another use). Sprinkle each parfait with 2 tablespoons macaroon crumble and serve.",
        "Unsweetened coconut milk is available at Indian, Southeast Asian, and Latin American markets and many supermarkets."
    ],
    "ingredients": [
        "3 cups water",
        "1 cup basmati rice",
        "1 cup plus 2 tablespoons sugar",
        "2 large eggs",
        "2 large egg yolks",
        "3 tablespoons cornstarch",
        "4 teaspoons vanilla extract",
        "1 1/2 cups whole milk",
        "1 cup canned unsweetened coconut milk*",
        "1 teaspoon salt",
        "1 cup shredded coconut, toasted",
        "1 cup whipping cream",
        "1 1/2 cups sweetened flaked coconut",
        "2/3 cup all purpose flour",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "3/4 teaspoon salt",
        "4 1/2 tablespoons chilled unsalted butter, diced",
        "2 cups chopped peeled fresh pineapple",
        "1 cup chopped peeled pitted fresh mango"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Rice",
        "Dessert",
        "Coconut",
        "Mango",
        "Pineapple",
        "Summer",
        "Chill",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Rice Pudding Parfaits with Mango and Pineapple",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-rice-pudding-parfaits-with-mango-and-pineapple-106977"
}
