{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Lightly butter cake pan and line bottom with a round of parchment paper. Lightly butter parchment, then flour pan.",
        "Whisk together flour (1 1/4 cups), baking powder, and salt.",
        "Whisk together whole eggs and yolks, sugar, and vanilla in a large bowl. Gradually whisk in flour mixture until combined, then whisk in butter until just combined. Pour into cake pan and rap pan on counter to expel air bubbles.",
        "Bake until golden brown and cake starts to pull away from side of pan, about 45 minutes. Cool in pan on a rack 10 minutes. (Leave oven on.) Invert cake onto rack (discard parchment) and cool 10 minutes more. Generously brush top and side of warm cake with cream of coconut, allowing it to soak in before brushing on more. Cool completely.",
        "Pierce softest eye of coconut with a small screwdriver, then drain and discard liquid. Bake coconut in a shallow baking pan 15 minutes. (Leave oven on.) Break shell with a hammer, then pry flesh from shell with screwdriver.",
        "Thinly shave enough coconut with slicer to measure 2 cups and toss with confectioners sugar, then spread in 1 layer on a baking sheet. Bake until just dry but not golden (some tips may color), 5 to 10 minutes. (Shave and bake remaining coconut with more confectioners sugar to serve on the side, or freeze for another use.) Cool coconut completely. (It will crisp as it cools.)",
        "Beat together cream cheese, cream of coconut, rum, vanilla, and 2 tablespoons cream with an electric mixer until smooth, then beat in confectioners sugar. Icing should be smooth and slightly runny; stir in remaining tablespoon cream if necessary.",
        "Smooth icing over top of cooled cake, allowing some to drip over side, then top with coconut slivers."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "4 large eggs plus 3 large yolks",
        "1 1/2 cups sugar",
        "1 teaspoon pure vanilla extract",
        "1 1/2 sticks unsalted butter, melted and cooled",
        "3/4 cup well-stirred sweetened cream of coconut such as Coco López",
        "1 medium coconut",
        "2 teaspoons confectioners sugar",
        "3 tablespoons cream cheese, softened",
        "3 tablespoons well-stirred sweetened cream of coconut",
        "1 tablespoon dark rum",
        "3/4 teaspoon pure vanilla extract",
        "2 to 3 tablespoons heavy cream",
        "1/2 cup confectioners sugar",
        "Equipment: a 9-inch round cake pan (2 inches deep); an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Dessert",
        "Coconut",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Rum Cake",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-rum-cake-240000"
}
