{
    "directions": [
        "Preheat oven to 350°F. Generously butter 9-inch-diameter cake pan with 2-inch-high sides; dust pan with flour, shaking out excess. Sift 1 3/4 cups flour, baking powder, and sea salt into medium bowl. Stir in unsweetened shredded coconut and set aside. Using electric mixer, beat sugar, butter, and orange peel in large bowl until light and fluffy. Add eggs 1 at a time, beating well after each addition. Beat in vanilla. Add flour mixture in 3 additions alternately with coconut milk in 2 additions, beating just until blended after each addition. Fold in half of bittersweet chocolate pieces. Spread batter evenly in prepared cake pan. Sprinkle remaining chocolate pieces over batter, then sprinkle with sweetened flaked coconut.",
        "Bake cake until golden and tester inserted into center comes out clean, tenting with sheet of foil if coconut atop cake is browning too quickly, 60 to 70 minutes. Transfer cake to rack and cool in pan 45 minutes.",
        "Whisk powdered sugar, 2 tablespoons unsweetened coconut milk, and vanilla in small bowl to blend well, adding more coconut milk by 1/2 teaspoonfuls until mixture is thin enough to drizzle over cake.",
        "Carefully run small knife around sides of cake to loosen. Invert cake onto platter, then carefully invert again onto another platter, coconut side up. Using small spoon, drizzle powdered sugar mixture decoratively over cake. Cool cake completely on platter. DO AHEAD Cake can be made up to 1 day ahead. Cover cake and let stand at room temperature.",
        "Cut cake into wedges and serve with vanilla ice cream.",
        "Available at specialty foods stores and natural foods stores.",
        "** Sold at many supermarkets and at Indian, Southeast Asian, and Latin markets. If unavailable, use 1 cup half and half mixed with 1/2 teaspoon imitation coconut extract."
    ],
    "ingredients": [
        "1 3/4 cups all purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon fine sea salt",
        "1 cup unsweetened shredded coconut*",
        "3/4 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 teaspoons (packed) finely grated orange peel",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1 cup canned unsweetened coconut milk**",
        "6 ounces bittersweet chocolate bars (do not exceed 61% cacao), broken into 1/2-inch irregular pieces, divided",
        "1/2 cup sweetened flaked coconut",
        "3/4 cup powdered sugar",
        "2 tablespoons (or more) canned unsweetened coconut milk**",
        "1/2 teaspoon vanilla extract",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Valentine's Day",
        "Vegetarian",
        "New Year's Day",
        "Tropical Fruit",
        "Coconut",
        "Winter",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Cake with Chocolate Chunks and Coconut Drizzle",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cake-with-chocolate-chunks-and-coconut-drizzle-356929"
}
