{
    "directions": [
        "Preheat oven to 350°F. Butter 11x17-inch jelly roll pan. Line with parchment. Finely grind coconut and flour in processor. Using electric mixer, beat yolks and 1/4 cup sugar in large bowl until pale yellow and slowly dissolving ribbon forms when beaters are lifted, about 5 minutes. Stir in lemon peel. Using clean dry beaters, beat whites and salt in another bowl until medium peaks form. Gradually beat in remaining 1/4 cup sugar and beat until stiff but not dry. Fold whites into yolk mixture in 2 additions. Gently fold in coconut mixture. Spread batter evenly into prepared pan. Bake until toothpick inserted into center comes out clean, about 15 minutes. Run small sharp knife around pan sides to loosen cake. Slide cake on parchment onto rack; cool. (Can be made 1 day ahead. Return cake to pan. Cover with plastic; store at room temperature.)",
        "Bring first 3 ingredients to simmer in heavy medium saucepan. Whisk yolks and flour in bowl to blend. Gradually whisk in some of hot cream mixture. Return mixture to saucepan and stir over medium heat until custard boils and thickens, about 2 minutes. Pour mixture into bowl. Cool to lukewarm. Add butter and whisk until smooth. Whisk in rum and coconut extract. Cover and chill until very thick but still spreadable, about 1 hour. Slide cake on parchment onto work surface. Run long sharp knife between cake and parchment to loosen.",
        "Spread filling over cake, leaving 3/4-inch border. Starting at 1 long side, roll up cake jelly roll style. Transfer to platter seam side down. (Can be prepared 8 hours ahead. Cover and refrigerate.)",
        "Whip cream, sour cream, rum, sugar, lemon peel and vanilla in medium bowl to stiff peaks. Spread frosting over cake. Press coconut onto sides of cake, leaving 2-inch-wide strip without coconut down center. Decorate center strip with lemon."
    ],
    "ingredients": [
        "1 1/2 cups sweetened shredded coconut, toasted",
        "1/4 cup all purpose flour",
        "6 large eggs, separated, room temperature",
        "1/2 cup sugar",
        "1 1/2 teaspoons grated lemon peel",
        "1/8 teaspoon salt",
        "1 cup canned sweetened cream of coconut (such as Coco Lopez)",
        "1 cup whipping cream",
        "1/2 teaspoon grated lemon peel",
        "5 large egg yolks",
        "2 tablespoons all purpose flour",
        "9 tablespoons unsalted butter",
        "1 tablespoon white rum",
        "1/4 teaspoon imitation coconut extract",
        "1 cup chilled whipping cream",
        "1/4 cup sour cream",
        "3 tablespoons white rum",
        "2 tablespoons sugar",
        "1/2 teaspoon grated lemon peel",
        "1/2 teaspoon vanilla extract",
        "1 cup sweetened shredded coconut, toasted",
        "8 thin lemon slices, cut into quarters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Dessert",
        "Bake",
        "Coconut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut-Rum Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-rum-roulade-2654"
}
