{
    "directions": [
        "In a heavy 1-quart saucepan stir curry powder into about 1 tablespoon coconut milk until dissolved. Stir in 1 teaspoon lime juice, salt, and remaining coconut milk and simmer over moderately low heat 10 minutes, or until thickened.",
        "Remove tough muscle from side of each scallop if necessary. If using sea scallops, cut into 1/2-inch pieces. Add scallops to coconut milk mixture and poach at a bare simmer until just cooked through but still tender, 2 to 3 minutes. Remove pan from heat and cool mixture. Transfer scallops with poaching liquid to a small bowl. Scallops may be poached 1 day ahead and chilled, covered.",
        "Cut pears crosswise into 1/4-inch-thick rounds and discard seeds and core. Cut rounds into 1-inch wedges and in a small bowl toss with remaining lime juice. Macerate pears, covered and chilled, at least 15 minutes and up to 3 hours.",
        "Just before serving, cut kumquats crosswise into thin slices and arrange pear wedges, drained, on plates. Top each wedge with 1 kumquat slice, 1 coriander leaf, and 1 piece of scallop coated with poaching liquid."
    ],
    "ingredients": [
        "1 teaspoon curry powder",
        "1 cup canned unsweetened coconut milk*, stirred well",
        "1/4 cup fresh lime juice, or to taste",
        "1/2 teaspoon salt, or to taste",
        "1/2 pound bay or sea scallops",
        "2 Asian pears**",
        "8 to 10 kumquats**",
        "about 40 fresh coriander leaves, washed well and spun dry",
        "*available at Asian markets and some specialty foods",
        "**available at specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Shellfish",
        "Appetizer",
        "Cocktail Party",
        "Quick & Easy",
        "Pear",
        "Coconut",
        "Fall",
        "Kumquat",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Coconut Curry Scallop, Kumquat, and Asian Pear Canapes",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-curry-scallop-kumquat-and-asian-pear-canapes-13039"
}
