{
    "directions": [
        "Pulse salt, sugar, and 1 1/4 cups flour in a food processor until well combined. Add butter and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining, about 10 seconds. With the motor running, add 1/4 cup ice water and process until dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers; if it's very crumbly, add more ice water, 1 Tbsp. at a time (2 Tbsp. maximum), and process to combine (do not overprocess).",
        "Turn out dough onto a lightly floured surface and form into a rough ball. Knead a few times, then roll into a ball. Flatten ball to a disc with smooth edges (no cracks), cover with plastic wrap, and chill at least 1 hour or up to overnight.",
        "Position rack in bottom of oven; preheat to 350°F. Roll out chilled dough on a lightly floured surface to a 13\" round. Wrap dough loosely around floured rolling pin, then release into pie pan. Lift up edges and allow dough to slump down into dish. Trim edges to leave a 1\" overhang and crimp as desired. Freeze dough at least 15 minutes or chill, covered, up to 24 hours.",
        "Line crust with parchment or foil and fill with baking beans or weights. Bake crust, rotating halfway through, 20 minutes. Remove weights, pierce bottom of crust all over with a fork, and continue to bake until very light brown and dry, about 10 minutes more. Let cool.",
        "Preheat oven to 350°F. Spread coconut flakes on a rimmed baking sheet and toast, stirring once or twice, until golden brown and fragrant, 8–10 minutes. Let cool.",
        "Heat 1 3/4 cups milk in a small saucepan until almost boiling. Add 1 1/2 cups toasted coconut, stir, and cover. Let steep 1 hour. (Now would be a great time to roll out and bake the pie crust.)",
        "Strain toasted-coconut milk through a fine-mesh sieve into a large saucepan; discard solids (you should have about 1 1/2 cups milk; add more milk if necessary). Add canned coconut milk and bring to a simmer over medium-high heat. Remove from heat.",
        "Pour remaining 3/4 cup cold milk into a small bowl and sprinkle gelatin over. Let sit 10 minutes. Whisk egg yolks, sugar, cornstarch, and salt in a large bowl. Add gelatin mixture and whisk until smooth.",
        "Whisking constantly, slowly pour half of the coconut milk mixture in a thin stream into egg mixture. (A wet towel under bowl with egg mixture will help stabilize it.) Pour everything back into saucepan and heat over medium-high. Cook, whisking constantly, until mixture is thickened and starts to bubble, then continue to cook about 1 minute more so it doesn't taste starchy.",
        "Strain through a fine-mesh sieve into a clean large bowl. Add butter and vanilla and stir to combine. Press plastic wrap against surface of mixture and chill until cool, 2 1/2–3 hours. (You can speed up the process by stirring from time to time or placing bowl with filling in a large bowl of ice water.)",
        "Using an electric mixer on medium-high speed, whip cream to medium peaks in a medium bowl. Working in 3 batches, gently fold cream into pie filling until just incorporated. Sprinkle half of the remaining toasted coconut into bottom of prepared pie shell. Carefully spoon filling over coconut, mounding it in the middle and making decorative swirls with the back of a spoon. Chill at least 2 more hours to set.",
        "When ready to serve, garnish pie with remaining toasted coconut.",
        "Pie can be made 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon sugar",
        "1 1/4 cups all-purpose flour, plus more for surface",
        "1/2 cup (1 stick) cold unsalted butter, cut into cubes",
        "3 cups unsweetened coconut flakes",
        "2 1/2 cups whole milk, divided",
        "2 1/4 cups coconut milk (not low-fat)",
        "1 (1/4-ounce) envelope powdered unflavored gelatin (about 1 tablespoon)",
        "7 large egg yolks",
        "1 cup sugar",
        "6 tablespoons cornstarch",
        "1/2 teaspoon kosher salt",
        "1 tablespoon unsalted butter",
        "1 tablespoon vanilla paste or extract",
        "1 1/2 cups heavy cream",
        "A 9\" pie pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Dessert",
        "Coconut",
        "Milk/Cream",
        "Vanilla",
        "Bake",
        "Chill",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Coconut Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cream-pie"
}
