{
    "directions": [
        "Preheat oven to 350°F. In a baking pan toast nuts in one layer in middle of oven until golden, about 10 minutes, and cool. Finely chop 2/3 cup nuts. Coarsely chop remaining 2/3 cup nuts and reserve. Cut butter into pieces.",
        "In a bowl with a pastry blender or in a food processor blend or pulse together finely chopped nuts, flour, sugar, and butter until mixture resembles coarse meal. Add yolks and blend dough until it begins to come together but is still crumbly. Press dough in bottom and up side of an 11-inch tart pan with a removable bottom. Chill crust 30 minutes.",
        "Preheat oven to 375°F.",
        "Bake crust in middle of oven until golden, about 25 minutes, and transfer to a rack to cool completely.",
        "In a small bowl sprinkle gelatin over rum to soften 5 minutes. In a bowl whisk together yolks, sugar, and a pinch salt. In a large saucepan bring coconut milk to a boil and remove pan from heat. Gradually whisk half of coconut milk into yolk mixture and whisk back into pan with remaining coconut milk. Cook custard over moderate heat, whisking constantly, until thickened and a thermometer registers 170°F, about 12 minutes (do not let custard boil). Remove pan from heat and add gelatin mixture, whisking until gelatin is dissolved. Transfer custard to a bowl to cool and chill, stirring frequently, until thickened but not set, about 30 minutes.",
        "Beat cream until it just holds soft peaks and fold gently into custard. Pour filling into crust. Chill tart until filling is set, about 4 hours.",
        "Remove rim of pan and sprinkle tart with coconut and reserved nuts."
    ],
    "ingredients": [
        "1 1/3 cups salted macadamia nuts (about 7 ounces)",
        "1 stick (1/2 cup) cold unsalted butter",
        "1 1/2 cups all-purpose flour",
        "1/4 cup sugar",
        "2 large egg yolks",
        "1 1/2 teaspoons unflavored gelatin",
        "2 tablespoons dark rum",
        "8 large egg yolks",
        "1/2 cup plus 2 tablespoons sugar",
        "2 cups well-stirred canned unsweetened coconut milk",
        "1 cup well-chilled heavy cream",
        "3/4 cup sweetened flaked coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Coconut",
        "Macadamia Nut",
        "Chill",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Coconut Cream Tart with Macadamia Nut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-cream-tart-with-macadamia-nut-crust-15821"
}
