{
    "directions": [
        "Line bottom of each tart pan with a round of parchment or wax paper.",
        "Finely grind 1/3 cup almonds with sugar in a food processor (reserve remaining almonds for filling), then add bread crumbs and pulse until combined. Drizzle butter over crumbs and pulse until evenly moistened. Divide mixture among tart pans and press evenly over bottom and up side of each tart pan. Chill tart shells while making filling.",
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Pierce softest eye of coconut with a metal skewer or small screwdriver and drain liquid through a sieve into a bowl and reserve. (If it tastes sweet, the coconut is fresh; if it tastes off, the coconut is rancid and should be discarded.) Bake coconut 15 minutes, then cool until it can be handled.",
        "Reduce oven temperature to 350°F.",
        "Break shell of coconut with a hammer or back of a heavy cleaver, then remove flesh with point of a strong knife, levering it out carefully. Remove brown skin with a sharp knife or vegetable peeler. Shred coconut in cleaned food processor fitted with medium-size shredding disk or hand-grate with medium-size teardrop holes of a box grater. Measure 2 1/2 cups loosely packed coconut and reserve. Transfer remaining coconut to a shallow baking pan and toast in oven, stirring occasionally, until golden, 8 to 10 minutes. Cool in pan on a rack and reserve for garnish. Leave oven on.",
        "While coconut toasts, bring reserved coconut liquid, cream, and sugar to a simmer in a 1 1/2- to 2-quart heavy saucepan over moderate heat, stirring until sugar is dissolved. Simmer, uncovered, stirring frequently, until reduced to about 1 cup, 25 to 35 minutes. Transfer to a large bowl, then stir in reserved 2 1/2 cups untoasted coconut, yolks, vanilla, and reserved toasted almonds (2/3 cup) until combined well.",
        "Put tart pans on a large baking sheet, then spoon coconut filling evenly into shells, stirring filling in between additions to get even amounts of solids and liquid and bake until filling is set and golden brown, 25 to 30 minutes. Cool tarts on a rack.",
        "Wearing rubber gloves, cut a 1/2-inch slice off both ends of each pear, then make a 1/2-inch-deep incision with a paring knife down side of each pear. Peel off rind, starting from incision, and discard. Coarsely chop flesh, then purée in cleaned food processor. Force pur&eacut;e through a medium-mesh sieve into a bowl using a rubber spatula.",
        "Bring 1 cup purée and 3 tablespoons sugar to a simmer in cleaned 1 1/2- to 2-quart heavy saucepan, stirring, then simmer briskly, stirring frequently, until reduced to 1/2 cup, 10 to 12 minutes. Transfer cooked purée to a bowl, then cool to room temperature and stir in uncooked purée. Season to taste with lime juice, additional sugar, and orange liqueur (if using).",
        "Using tip of a paring knife, loosen edge of 1 tart crust from pan, then invert tart into your hand, removing pan, and transfer tart, right side up, to a serving plate, then repeat with remaining tarts. Serve tarts topped with dollops of crema and sprinkled with toasted coconut, then spoon sauce around tarts."
    ],
    "ingredients": [
        "1 cup slivered blanched almonds (1/4 lb), toasted and cooled",
        "1/4 cup sugar",
        "2 cups fine fresh bread crumbs (from 6 to 7 slices firm white sandwich bread)",
        "5 tablespoons unsalted butter, melted for filling",
        "1 fresh brown coconut (1 1/2 lb)",
        "1 cup heavy cream",
        "2/3 cup sugar",
        "3 large egg yolks, lightly beaten",
        "1 teaspoon vanilla (preferably Mexican)",
        "1 3/4 lb fresh red prickly pears (also called cactus pears; about 8)",
        "3 tablespoons sugar, or to taste",
        "1 to 2 teaspoons fresh lime juice",
        "2 teaspoons orange liqueur such as Cointreau (optional)",
        "1/2 cup crema (thick Mexican cream), crme frache, or sour cream thinned with 1 teaspoon milk",
        "Special equipment: 6 (4-inch) fluted tart pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Pear",
        "Coconut",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coconut Tarts with Prickly Pear Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-tarts-with-prickly-pear-sauce-235986"
}
