{
    "directions": [
        "In a saucepan bring 2 cups water to a boil with the sugar, stirring until sugar is dissolved, add tea bags, and let steep, covered for 15 minutes. Discard tea bags.",
        "With an ice pick or a skewer, test the three eyes of the coconut to find the weakest one and pierce it to make a hole. Drain the liquid and reserve it. Bake the coconut in a preheated 400°F. oven for 15 minutes, break it with a hammer, and remove the flesh from the shell, levering it out carefully with the point of a strong knife. Cut the coconut meat into small pieces and in a blender grind it in small batches, transferring it as it is ground to a bowl. Return the ground coconut to the blender.",
        "Strain the reserved coconut liquid through a fine sieve into a large measure and add enough water to measure 2 cups liquid. In a saucepan bring the liquid to a boil, add it to the ground coconut, and blend the mixture for 1 minute. Let the coconut mixture cool, strain it through a large sieve lined with a double thickness of cheesecloth into a bowl, pressing hard on the solids, and squeeze the coconut in the cheesecloth to extract as much of the milk as possible.",
        "Stir the tea into the coconut milk with the food coloring, if using, and chill the mixture, covered until it is cold. Freeze the mixture in an ice cream freezer according the manufacturer's instructions and store the sorbet in freezer containers. The sorbet may be made 5 days in advance and kept frozen, covered. let sorbet stand in the refrigerator for 30 minutes or microwave it at 30% power for 1 minute to soften slightly before serving."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "2 bags peppermint herbal tea",
        "1 large coconut without any cracks and containing liquid",
        "2 or 3 drops of green food coloring if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Frozen Dessert",
        "Coconut",
        "Mint",
        "Vegan",
        "Gourmet"
    ],
    "title": "Coconut Mint Sorbet",
    "url": "http://www.epicurious.com/recipes/food/views/coconut-mint-sorbet-11499"
}
