{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Wash leek in a bowl of water, then lift out and drain well. Cook leek, carrot, and celery in butter in a 2- to 3-quart heavy saucepan over moderate heat, stirring frequently, until tender, about 7 minutes. Add flour and cook, stirring, 1 minute. Stir in milk, 1/4 teaspoon salt, and 1/8 teaspoon pepper. Bring sauce to a boil, stirring, then reduce heat and simmer, stirring occasionally, 4 minutes. (Sauce will be thick.) Remove pan from heat.",
        "Whisk together flour, baking powder, and salt in a bowl. Blend in butter cubes with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in milk and dill with a fork until mixture just comes together.",
        "Gather dough into a ball, then turn out onto a lightly floured surface and knead 2 or 3 times. Roll out with a floured rolling pin into an 8-inch square (1/2 inch thick), then cut out 4 biscuits using cutter.",
        "Sprinkle cod with remaining 1/2 teaspoon salt and 1/8 teaspoon pepper. Bring sauce to a simmer and stir in fish, then divide among ramekins. Top each ramekin with a biscuit, then brush biscuits with melted butter. Arrange ramekins in a shallow baking pan and bake until sauce is bubbling and biscuits are golden, 12 to 15 minutes.",
        "*Available at Bridge Kitchenware (800-274-3435)."
    ],
    "ingredients": [
        "1 medium leek (white and pale green parts only), cut into 1/2-inch pieces",
        "1/2 cup finely diced carrot",
        "1/4 cup finely diced celery",
        "3 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 1/2 cups whole milk",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 1/4 pounds skinless cod or scrod fillet, cut into 3/4-inch chunks",
        "1 1/2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "3/4 teaspoon salt",
        "7 1/2 tablespoons cold unsalted butter, cut into 1/2-inch cubes, plus 1 tablespoon, melted",
        "1/2 cup plus 1 tablespoon whole milk",
        "2 1/2 tablespoons chopped fresh dill",
        "Special equipment: a 3 1/2-inch round cookie/biscuit cutter; 4 (4- to 5-inch-wide) 8- to 10-ounce ramekins*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bake",
        "Cod",
        "Leek",
        "Carrot",
        "Winter",
        "Dill",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Cod Potpies with Dill Biscuit Crusts",
    "url": "http://www.epicurious.com/recipes/food/views/cod-potpies-with-dill-biscuit-crusts-230756"
}
