{
    "directions": [
        "Heat oven to 425°F. Pulse bread in a food processor until coarse crumbs form. Heat 2 tablespoons oil in a large ovenproof skillet over medium-high heat. Add breadcrumbs. Cook, stirring often, until golden and crisp, about 3 minutes; season with salt and pepper. Transfer mixture to a bowl, add parsley and oregano; toss to combine. Wipe out skillet.",
        "Heat 1 tablespoon oil in same skillet over medium-high heat. Add shallot and chorizo and cook, stirring often, until chorizo is just crisp, about 2 minutes. Transfer to a bowl and mix in vinegar; season with salt and pepper. Wipe out skillet.",
        "Heat remaining 1 tablespoon oil in same skillet over medium-high heat. Season cod with salt and pepper and cook until bottom side begins to turn opaque, about 3 minutes. Transfer skillet to oven and roast until fish is cooked through, about 5 minutes longer.",
        "Serve cod topped with chorizo mixture and toasted breadcrumbs.",
        "DO AHEAD: Breadcrumbs can be made 8 hours ahead. Store airtight at room temperature. Toss with herbs just before serving."
    ],
    "ingredients": [
        "2 3/4\"-thick slices country-style bread, crusts removed",
        "4 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon fresh oregano leaves",
        "1 small shallot, thinly sliced",
        "2 ounces smoked Spanish chorizo, halved, thinly sliced",
        "2 tablespoons Sherry or red wine vinegar",
        "4 6-ounce pieces skinless cod or halibut fillets",
        "Ingredient info: Smoked Spanish chorizo is available at Spanish markets, specialty foods stores, and online sources."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Dinner",
        "Sausage",
        "Seafood",
        "Cod",
        "Breadcrumbs",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cod with Chorizo and Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/cod-with-chorizo-and-breadcrumbs-51179210"
}
