{
    "directions": [
        "Heat oil in heavy medium skillet over medium heat. Add tomatoes and sugar. Stir until tomatoes are very tender and mixture is thick, about 15 minutes. Season tomato compote with salt and pepper.",
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms and chopped shallots. Sauté until liquid evaporates and mushrooms begin to brown, about 8 minutes. Cool completely.",
        "Using electric mixer, beat 5 tablespoons butter in large bowl until light. Beat in egg, then parsley, 1 tablespoon thyme, 1 teaspoon salt and 1/2 teaspoon pepper. Mix in breadcrumbs and mushroom mixture.",
        "Preheat oven to 450°F. Sprinkle sliced garlic, sliced shallots and remaining 1 teaspoon thyme over bottom of 15 x 10 x 2-inch glass baking dish. Add fish stock, then fish fillets. Sprinkle fish with salt and pepper. Spoon breadcrumb mixture atop fish, covering tops of fish completely and pressing slightly to adhere. (Can be prepared 8 hours ahead. Cover tomato compote and fish separately and refrigerate. Rewarm compote over medium-low heat before serving.)",
        "Bake fish until opaque in center, about 15 minutes. Transfer to broiler. Broil just until topping is crisp and golden, about 1 minute.",
        "Using slotted spatula, transfer fish to plates. Transfer cooking liquid to another medium skillet. Bring cooking liquid to simmer over medium heat. Add remaining 1 tablespoon butter and whisk just until melted and well blended. Season sauce to taste with salt and pepper. Spoon sauce around fish. Spoon dollop of tomato compote alongside and serve fish immediately."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 pound tomatoes, peeled, seeded, coarsely chopped",
        "1/2 teaspoon sugar",
        "8 tablespoons (1 stick) butter, room temperature",
        "8 ounces fresh mushrooms, chopped (about 3 cups)",
        "1/4 cup chopped shallots",
        "1 large egg",
        "6 tablespoons chopped fresh parsley",
        "1 tablespoon plus 1 teaspoon chopped fresh thyme",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 cups fresh breadcrumbs made from French bread",
        "4 garlic cloves, thinly sliced",
        "2 shallots, thinly sliced",
        "1 cup fish stock or bottled clam juice",
        "4 6-ounce cod, orange roughy or red snapper fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Mushroom",
        "Tomato",
        "Bake"
    ],
    "title": "Cod with Mushroom-Herb Crust and Tomato Compote",
    "url": "http://www.epicurious.com/recipes/food/views/cod-with-mushroom-herb-crust-and-tomato-compote-5678"
}
