{
    "directions": [
        "Finely grate zest from lemons; set aside. Using a sharp knife, cut peel and white pith from lemons; discard. Working over a medium bowl, cut between membranes to release segments into bowl and squeeze membranes to release juices; discard membranes and any seeds. Set lemon segments aside.",
        "Combine onion and 1 teaspoon salt in a small bowl. Let sit 10 minutes. Squeeze onion to remove any excess liquid; add to bowl with lemon segments. Add olives, capers, reserved lemon zest, and 3/4 cup oil; season with salt and pepper and toss to combine. Cover relish and chill at least 4 hours.",
        "Preheat oven to 250°F. Bring relish to room temperature.",
        "Place cod in a large shallow baking dish or roasting pan and drizzle with remaining 1/2 cup oil. Add chiles and turn fish to coat; season with salt. Roast until just cooked through, 30–40 minutes.",
        "Transfer fish to a platter. Mix parsley into relish and spoon over fish.",
        "DO AHEAD: Relish (without parsley) can be made 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "2 lemons",
        "1/2 small red onion, very thinly sliced into rings",
        "1 teaspoon kosher salt plus more",
        "1/2 cup Castelvetrano or other brined green olives (about 24), coarsely chopped",
        "2 tablespoons drained capers, chopped",
        "1 1/4 cups olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "8 6-ounce pieces skinless cod fillets",
        "2 dried red chiles, stemmed, or 1/4 teaspoons crushed red pepper flakes",
        "1/4 cup fresh flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Onion",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Lemon",
        "Cod",
        "Healthy",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cod with Lemon, Green Olive, and Onion Relish",
    "url": "http://www.epicurious.com/recipes/food/views/cod-with-lemon-green-olive-and-onion-relish-51193850"
}
