{
    "directions": [
        "Preheat the oven to 350°F. Spread the tomato sauce in the bottoms of 4 individual gratin dishes or in the bottom of a shallow baking dish just large enough to hold 8 cannelloni in one layer. In a saucepan melt the butter over moderately low heat, whisk in the flour, and cook the roux, whisking, for 3 minutes. Add the milk in a stream, whisking, simmer the béchamel, whisking constantly, for 2 minutes, and season it with salt and pepper. Transfer the béchamel to a bowl and let it cool, covered. In a pan of hot water let the sheets of lasagne soak for 10 to 15 minutes, or until they are softened. To the béchamel add the cod, the Swiss chard with roasted pepper, the chopped basil, and salt and pepper to taste and combine the mixture well.",
        "If using the square lasagne sheets halve each sheet to form 2 rectangles. Working with 1 rectangle at a time, spread about 1/3 cup of the cod mixture lengthwise down the center of each sheet, beginning with a long side roll up the sheet to enclose the filling, leaving both ends open, and arrange 2 cannelloni, seam sides down, in each dish, spooning some of the tomato sauce over them. Bake the cannelloni, covered with foil, in the middle of the oven for 230 to 25 minutes, or until they are heated through, garnish them with the basil sprigs, and serve them with the Parmesan."
    ],
    "ingredients": [
        "2 cups Spicy Tomato Sauce",
        "3 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "1 cup milk",
        "4 large square or 8 small rectangular sheets of instant (no-boil) lasagne",
        "2 cups flaked cooked cod (such as from Roast Cod with Potatoes, Onions and Olives",
        "1 1/2 cups Swiss Chard with Roasted Pepper",
        "1/3 cup chopped fresh basil leaves plus basil sprigs for garnish",
        "Freshly grated Parmesan as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Bake",
        "Cod",
        "Bell Pepper",
        "Chard",
        "Gourmet"
    ],
    "title": "Cod Cannelloni with Swiss Chard and Roasted Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/cod-cannelloni-with-swiss-chard-and-roasted-pepper-14442"
}
