{
    "directions": [
        "Stir together water, coffee, kosher salt, brown sugar, and Insta Cure in storage tub until solids are dissolved, about 3 minutes, then add molasses and stir until dissolved. Add ice and stir until cure is cold (ice may not melt completely; keeping liquid cold slows salt absorption).",
        "Add duck to cure and weight down with a large plate (to keep submerged). Chill, tub covered with a lid or plastic wrap, 6 hours.",
        "Rinse duck and pat dry, then discard brine.",
        "Prepare grill and cold-smoke duck followingprocedure for grilling and cold-smoking chicken legs . (Duck will not be cooked.)",
        "Cool duck completely, uncovered, then chill, wrapped in plastic wrap until ready to thinly slice and fry (seeduck breast bacon and frisée salad recipe )."
    ],
    "ingredients": [
        "4 cups cold water",
        "2 cups freshly brewed strong coffee",
        "1 cup kosher salt",
        "1/2 cup packed dark brown sugar",
        "2 1/2 tablespoons Insta Cure No.1 (curing salt)",
        "1/4 cup molasses (regular or robust, not blackstrap)",
        "3 cups ice cubes",
        "6 Pekin (sometimes called Long Island) duck breast halves with skin (about 7 oz each)",
        "Special equipment: a 1- to 2-gallon plastic storage tub; a 22 1/2-inch kettle grill with a lid and a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 6 cups hardwood sawdust (3/4 lb; not from treated wood; see Shopping List, page 162); charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Breakfast",
        "Brunch",
        "Side",
        "Meat",
        "Bacon",
        "Summer",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee and Molasses Cured Duck Breast Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-and-molasses-cured-duck-breast-bacon-232189"
}
