{
    "directions": [
        "Cook sugar in a dry small nonstick skillet over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel, 2 to 3 minutes.",
        "Remove pan from heat, then immediately stir in Rice Krispies and quickly transfer to springform pan, spreading evenly over bottom and smoothing top with back of a small spoon. (If using pie plate, press crust up side of plate slightly.)",
        "Sprinkle chopped chocolate evenly over warm crust to melt, then spread melted chocolate with back of spoon to cover crust. Cool until chocolate is hardened.",
        "Dissolve instant coffee in 2 tablespoons milk in a small bowl, then stir in gelatin and let stand.",
        "Whisk together cornstarch and remaining 1· cups milk in a 1 1/2- to 2-quart heavy saucepan and bring to a simmer over low heat, stirring constantly (this will take about 15 minutes; 1% milk curdles easily if heated too quickly). Continue to simmer, stirring, 2 minutes.",
        "Remove from heat, then add gelatin mixture, chocolate, brown sugar, and rum, whisking until smooth, about 1 minute. Transfer mixture to a metal bowl set in a larger bowl of ice and cold water. Cool filling, whisking constantly (so gelatin doesn't set unevenly), just to room temperature, 3 to 5 minutes, then pour over crust in pan. Chill, covered, until set, about 3 hours.",
        "Beat cream with brown sugar using an electric mixer until it just holds stiff peaks. Dissolve instant coffee in rum and fold into cream.",
        "Spread evenly over chilled custard, then run a thin sharp knife around edge of \"pie\" and remove side of pan."
    ],
    "ingredients": [
        "1/4 cup granulated sugar",
        "1 1/2 cups Rice Krispies, partially crushed",
        "1/2 ounces fine-quality bittersweet chocolate (not unsweetened), finely chopped (1 1/2 tablespoons)",
        "2 teaspoons instant-coffee granules or powder",
        "2 cups 1% milk",
        "1/2 teaspoon unflavored gelatin",
        "3 tablespoons cornstarch",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "1/4 cup packed light brown sugar",
        "2 teaspoons dark rum",
        "1/3 cup well-chilled heavy cream",
        "1 teaspoon packed light brown sugar",
        "1/4 teaspoon instant-coffee granules or powder",
        "1 teaspoon dark rum",
        "Garnish: bittersweet chocolate shavings (about 1/2 oz, shaved with a vegetable peeler from a bar of chocolate)",
        "Special equipment: a 7-inch springform pan or an 8- to 9-inch pie plate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Rum",
        "Chocolate",
        "Dessert",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Coffee Toffee \"Pie\"",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-toffee-pie-106285"
}
