{
    "directions": [
        "Whisk cream, 1/4 cup hot water, and espresso powder in heavy small saucepan to blend. Bring to simmer over medium heat. Remove from heat. Add chocolate and stir until melted and smooth. Stir in cinnamon. (Sauce can be made 3 days ahead. Cover and refrigerate. Rewarm sauce over low heat just until pourable before using.)",
        "Mix butter, sugar, and cinnamon in small bowl to blend. Spread butter mixture evenly over tortillas. Cut each tortilla into 8 wedges. Place wedges on 2 baking sheets, buttered side up, spacing apart. (Can be prepared 8 hours ahead. Cover with foil; let stand at room temperature.)",
        "Preheat oven to 400°F. Bake tortillas uncovered until crisp, puffed, and golden, about 8 minutes. Remove from oven.",
        "Place large scoop of ice cream in each of 8 dessert glasses. Drizzle warm chocolate sauce over. Stand 4 tortilla crisps in each glass. Garnish with mint sprigs, if desired, and serve."
    ],
    "ingredients": [
        "1/2 cup whipping cream",
        "1/4 cup hot water",
        "2 1/2 teaspoons instant espresso powder",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 teaspoon ground cinnamon",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "2 tablespoons sugar",
        "2 teaspoons ground cinnamon",
        "4 8-inch-diameter flour tortillas",
        "1 1/2 quarts coffee ice cream",
        "Fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Christmas",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee Ice Cream and Mexican Chocolate Sundaes with Cinnamon-Sugar Tortilla Crisps",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-ice-cream-and-mexican-chocolate-sundaes-with-cinnamon-sugar-tortilla-crisps-107531"
}
