{
    "directions": [
        "Preheat oven to 350°F.",
        "Toast nuts in a shallow baking pan in middle of oven until skins are split and nuts are golden, 10 to 12 minutes. Wrap nuts in a kitchen towel and rub to remove skins (not all skins will come off), then cool. Finely chop 1/3 cup nuts and reserve.",
        "Finely grind remaining 1/3 cup whole nuts with cornstarch and 1 teaspoon sugar in a food processor (do not allow to become a paste). Transfer to a bowl and stir in 1/4 cup sugar.",
        "Reduce oven to 250°F.",
        "Cover 2 baking sheets with foil. Using cutter or cardboard template as a guide, trace 6 hearts on each sheet with pointed end of a toothpick (for a total of 12). Brush foil lightly with oil.",
        "Beat egg whites and a pinch of salt with an electric mixer until foamy, then add cream of tartar and continue to beat until whites hold soft peaks. Gradually add 1/2 cup sugar, beating until whites just hold stiff, glossy peaks. Fold in ground-nut mixture gently but thoroughly and transfer meringue to pastry bag.",
        "Staying within traced lines, pipe 4 solid hearts and 2 hearts with a heart-shaped space in center on each baking sheet (there may be meringue left over). Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until dry and pale golden, 1 to 1 1/4 hours. Cool 10 minutes, then carefully peel meringues off foil and transfer to a rack to cool completely.",
        "Stir together espresso powder and 1 teaspoon warm water until dissolved.",
        "Bring remaining 1/4 cup warm water and remaining 1/2 cup sugar to a boil in a very small heavy saucepan over moderate heat, covered, stirring occasionally until sugar is dissolved. Boil, uncovered, washing down sugar crystals from side of pan with a pastry brush dipped in water, until candy thermometer registers 238°F or a drop of syrup forms a soft ball when dropped into a cup of cold water.",
        "When syrup reaches boil, start beating yolks in a bowl with electric mixer until thick and pale.",
        "When syrup reaches soft-ball stage, slowly pour it in a thin stream down side of bowl into yolks, beating constantly. Continue to beat at high speed until cool to the touch. (It is important that mixture is properly cooled before proceeding.)",
        "With mixer at high speed, add butter 1 piece at a time, beating well after each addition until incorporated, then beat in dissolved espresso. Continue to beat buttercream until fluffy.",
        "Spread 1 tablespoon buttercream evenly over each solid heart. Top each of 4 solid hearts with another solid heart, buttercream sides up, then top each stack with an open heart. Spread about 1 tablespoon buttercream around sides of each heart, then coat sides with reserved chopped hazelnuts.",
        "Chill hearts 30 minutes, then let stand at room temperature 15 minutes before serving with coulis."
    ],
    "ingredients": [
        "2/3 cup hazelnuts",
        "1 teaspoon cornstarch",
        "1 1/4 cups plus 1 teaspoon sugar",
        "3 large egg whites at room temperature",
        "Pinch of cream of tartar",
        "4 teaspoons instant-espresso powder",
        "1/4 cup plus 1 teaspoon warm water",
        "4 large egg yolks at room temperature",
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into pieces and softened",
        "Accompaniment: raspberry coulis",
        "Special equipment: a 3 1/2-inch heart-shaped cutter or a 3 1/2-inch heart-shaped cardboard template; a pastry bag fitted with a 3/8-inch plain tip; and a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Winter",
        "Hazelnut",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee Dacquoise Hearts",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-dacquoise-hearts-104656"
}
