{
    "directions": [
        "Preheat oven to 350°F. Grind nuts with ground cookies and toffee in processor. Add 5 tablespoons butter; blend until nuts are finely chopped. To moisten crumbs, if necessary, blend in 1 tablespoon butter. Using plastic wrap as aid, press mixture onto bottom an dup sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Freeze 15 minutes.",
        "Bake crust until golden, about 12 minutes. Freeze crust.",
        "Bring cream and corn syrup to simmer in heavy medium saucepan. Remove from heat. Add chocolate; whisk until melted and smooth. Cool to room temperature.",
        "Whisk sugar, yolks, 1/3 cup water and espresso powder in large metal bowl. Set bowl over saucepan of simmering water (do not allow bowl to touch water); whisk until candy thermometer registers 160°F, about 3 minutes. Remove bowl from over water. Add nutmeg. Using electric mixer, beat egg mixture until cool and thick, about 5 minutes.",
        "Beat 2 1/2 cups cream, liqueur and vanilla in another large bowl until stiff peaks form. Fold cream mixture and toffee into egg mixture. Spoon half of mousse into crust. Drizzle 1/4 cup ganache over. Using tip of knife, swirl mixtures together. Carefully spoon remaining mousse over; smooth top. Cover and freeze torte overnight. Cover remaining ganache; chill.",
        "Rewarm remaining ganache over low heat, whisking just until slightly softened but not melted. If necessary, let stand until firm enough to pipe. Spoon ganache into pastry bag fitted with star tip. Run sharp knife around torte pan sides. Release pan sides. Pipe ganache in lattice design atop torte. Pipe ganache in star shapes around border. Garnish with almonds. (Can be prepared 1 week ahead. Freeze until lattice sets, then cover and keep frozen.)"
    ],
    "ingredients": [
        "1 cup almonds, toasted",
        "1 1/2 cups ground sugar cookies (such as Pepperidge Farms Bordeaux; about 6 3/4 ounces)",
        "1/2 cup coarsely chopped chocolate-covered English toffee (such as Skor or Heath bar; about 3 ounces)",
        "5 to 6 tablespoons butter, melted, hot",
        "1/2 cup whipping cream",
        "2 tablespoons dark corn syrup",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup plus 2 tablespoons sugar",
        "6 large egg yolks",
        "1/3 cup water",
        "3 tablespoons instant espresso powder",
        "1/2 teaspoon ground nutmeg",
        "2 1/2 cups chilled whipping cream",
        "2 tablespoons coffee liqueur",
        "1 teaspoon vanilla extract",
        "1 1/2 cups coarsely chopped chocolate-covered English toffee (such as Skor or Heath bar; about 9 ounces)",
        "20 (about) whole almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Almond",
        "Summer",
        "Chill"
    ],
    "title": "Coffee-Toffee Crunch Torte",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-toffee-crunch-torte-4226"
}
