{
    "directions": [
        "Stir 12 ounces white chocolate in medium metal bowl set over saucepan of barely simmering water (do not allow bottom of bowl to touch water) until melted and smooth and candy thermometer registers 110°F. (chocolate will feel warm to touch). Remove from over water. Mix in espresso powder, ground espresso beans and spices. Add crème fraîche, whipping cream, liqueur and vanilla; whisk until blended (mixture may appear curdled). Freeze until firm enough to hold shape, whisking occasionally, about 25 minutes.",
        "Line 2 baking sheets with foil. Using about 1 tablespoon espresso mixture for each truffle, spoon mixture in mounds on 1 sheet. Freeze truffles until just firm but still malleable, about 15 minutes. Quickly press or roll each mound into irregular ball. Return to freezer on sheet.",
        "Stir remaining 12 ounces white chocolate in medium metal bowl set over saucepan of barely simmering water (do not allow bottom of bowl to touch water) until melted and smooth and candy thermometer registers 110°F. Remove from over water. Drop 1 truffle into chocolate. Using fork, turn to coat. Lift truffle from chocolate on fork tines, allowing excess to drip back into bowl. Using knife as aid, slide truffle off fork onto second foil-lined sheet, being careful to keep truffle upright. Top with 1 candied violet or 1 espresso bean. Repeat with remaining truffles and chocolate, rewarming chocolate as necessary to maintain temperature of 110°F. Chill truffles until coating is firm, about 30 minutes. (Can be made 2 weeks ahead. Chill in airtight container.) Let stand 20 minutes at room temperature before serving."
    ],
    "ingredients": [
        "24 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "5 teaspoons instant espresso powder",
        "1 tablespoon ground espresso beans",
        "3/4 teaspoon ground nutmeg",
        "3/4 teaspoon ground cinnamon",
        "1/4 cup crème fraîche or sour cream",
        "1 tablespoon whipping cream",
        "1 tablespoon coffee liqueur",
        "1/2 teaspoon vanilla extract",
        "24 candied violets or whole espresso beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Coffee",
        "Liqueur",
        "Chocolate",
        "Freeze/Chill",
        "Christmas",
        "Spice",
        "Edible Gift"
    ],
    "title": "Coffee-Spice White Chocolate Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-spice-white-chocolate-truffles-5738"
}
