{
    "directions": [
        "Stir together yeast and warm water in a small bowl until yeast is dissolved. Let stand until foamy, about 5 minutes. (If yeast doesn't foam, discard and start over with new yeast.)",
        "Mix together flour, milk, butter, yolks, sugar, salt, cinnamon, and yeast mixture in mixer at low speed until a soft dough forms. Increase speed to medium-high and beat 3 minutes more.",
        "Scrape dough down side of bowl (all around) into center, then sprinkle lightly with flour (to keep a crust from forming). Cover bowl with a clean kitchen towel (not terry cloth) and let dough rise in a draft-free place at warm room temperature until doubled in bulk, 1 1/2 to 2 hours. (Alternatively, let dough rise in bowl in refrigerator 8 to 12 hours.)",
        "Turn dough out onto a lightly floured surface and roll out with a lightly floured rolling pin into a 12-inch round (1/2 inch thick). Cut out as many rounds as possible with 3-inch cutter, then cut a hole in center of each round with 1-inch cutter and transfer doughnuts to a lightly floured large baking sheet. Cover doughnuts with a clean kitchen towel and let rise in a draft-free place at warm room temperature until slightly puffed, about 30 minutes (45 minutes if dough was cold when cutting out doughnuts). Do not reroll scraps.",
        "Heat 2 1/2 inches oil in a deep 4-quart heavy pot until it registers 350°F on thermometer. Fry doughnuts, 2 at a time, turning occasionally with a wire or mesh skimmer or a slotted spoon, until puffed and golden brown, about 2 minutes per batch. Transfer to paper towels to drain. (Return oil to 350°F between batches.)",
        "Stir together boiling-hot water and espresso powder in a medium bowl until powder is dissolved, then stir in confectioners sugar, corn syrup, vanilla, and salt until smooth.",
        "Dip doughnuts into glaze, turning to coat well, then put on a rack set in a shallow baking pan (to catch any drips). While glaze is wet, sprinkle doughnuts with sanding sugar (if using). Let stand until glaze is set, about 20 minutes."
    ],
    "ingredients": [
        "1 (1/4-oz) package active dry yeast (2 1/2 teaspoons)",
        "2 tablespoons warm water (105–115°F)",
        "3 1/4 cups all-purpose flour plus additional for sprinkling and rolling out dough",
        "1 cup whole milk at room temperature",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "3 large egg yolks",
        "2 tablespoons sugar",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon cinnamon",
        "About 10 cups vegetable oil for deep frying",
        "1/4 cup boiling-hot water",
        "5 teaspoons instant-espresso powder or instant-coffee granules",
        "1 1/2 cups confectioners sugar",
        "1 tablespoon light corn syrup",
        "1/4 teaspoon pure vanilla extract",
        "1/4 teaspoon salt",
        "About 1/4 cup sanding sugar (optional)",
        "Special equipment: a stand mixer fitted with paddle attachment; a 3-inch and a 1-inch round cookie cutter; a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Dairy",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Fry",
        "Deep-Fry",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee-Glazed Doughnuts",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-glazed-doughnuts-236708"
}
