{
    "directions": [
        "Preheat oven to 300°F. Heat oil in heavy large pot over medium-high heat. Sprinkle short ribs with salt and pepper. Working in batches, add ribs to pot and cook until browned, about 4 minutes per side. Transfer to platter.",
        "Add onion, red bell pepper, and jalapeño to drippings in pot. Reduce heat to medium, cover, and cook until onion is tender, stirring occasionally, about 6 minutes. Stir in garlic and sauté uncovered 1 minute. Add brown sugar, ancho chile powder, oregano, and cumin; stir 15 seconds. Stir in coffee, tomatoes with juice, and tomato paste. Bring to boil, scraping up browned bits. Return ribs and any juices to pot; bring to boil.",
        "Cover and bake until meat is very tender, about 1 hour 45 minutes. Spoon fat from surface of sauce. Season sauce to taste with salt and pepper. (Can be prepared 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and refrigerate. Rewarm, covered, over medium heat before continuing.)",
        "Transfer ribs to platter. Spoon sauce over and sprinkle with chopped cilantro.",
        "*Available in the spice section of most supermarkets and at Latin markets."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "5 pounds 1-inch-thick flanken-style short ribs",
        "1 large onion, chopped",
        "1 large red bell pepper, chopped",
        "1 large jalapeño, seeded, finely chopped",
        "6 garlic cloves, chopped",
        "2 tablespoons dark brown sugar",
        "1 1/2 tablespoons ancho chile powder*",
        "2 teaspoons dried oregano",
        "1 1/4 teaspoons ground cumin",
        "2 cups strong freshly brewed coffee (not espresso or dark roast)",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1 tablespoon tomato paste",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Tomato",
        "Braise",
        "Beef Rib",
        "Bell Pepper",
        "Hot Pepper",
        "Fall",
        "Jalapeño"
    ],
    "title": "Coffee-Braised Short Ribs with Ancho Chile",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-braised-short-ribs-with-ancho-chile-230930"
}
