{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 325°F. Mix flour, brown sugar, ground coffee, ginger, cinnamon, cardamom, and salt in processor 5 seconds. Add butter; using on/off turns, process until moist clumps begin to form. Gather dough into ball. Divide dough equally between two 9-inch- diameter tart pans with removable bottom. Press dough firmly and evenly onto bottom of each tart pan.",
        "Bake shortbread 25 minutes. Reverse position of pans and continue to bake until shortbread is golden brown and firm around edges but center is still just slightly soft, about 20 minutes longer. Cool shortbread in pans 5 minutes. Remove pan sides. Cut warm shortbread in each pan into 12 wedges. Cool completely.",
        "Mix powdered sugar, 2 teaspoons water, and vanilla in small bowl, adding more water by 1/4 teaspoonfuls, if necessary, for spreadable glaze. Using offset spatula, spread glaze thinly over cookies, leaving 1/2- inch border at edges. Sprinkle crystallized ginger over. Let stand until glaze is set, about 1 hour. Do ahead can be made 3 weeks ahead. Store airtight in freezer. Bring to room temperature before serving."
    ],
    "ingredients": [
        "2 3/cups all purpose flour",
        "3/4 cup (packed) dark brown sugar",
        "2 tablespoons plus 2 teaspoons ground coffee beans",
        "2 teaspoons ground ginger",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground cardamom",
        "1/2 teaspoon salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup powdered sugar",
        "2 teaspoons (or more) water",
        "1 teaspoon vanilla extract",
        "6 tablespoons chopped crystallized ginger",
        "Special equipment: 2 9-inch-diameter tart pans with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Low Cal",
        "Cinnamon",
        "Christmas Eve",
        "Cardamom"
    ],
    "title": "Coffee-Spice Shortbread with Crystallized Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-spice-shortbread-with-crystallized-ginger-362592"
}
