{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 8- or 9-inch cake pans, and dust with flour. In a large bowl, stir together the flour, white sugar, and salt until thoroughly combined.",
        "Melt 1 cup of butter in a small saucepan; in a bowl, stir together 3 tablespoons of instant coffee with the boiling water until the coffee has dissolved. Pour the coffee mixture into the melted butter, bring to a boil over medium heat, and stir for about 10 seconds; set the butter-coffee mixture aside to cool.",
        "Mix the buttermilk, eggs, vanilla extract, and baking soda in a bowl until the baking soda has dissolved. Mix the cooled coffee mixture into the flour mixture, then gently stir in the buttermilk mixture. Pour the batter into the prepared cake pans.",
        "Bake in the preheated oven until the cakes are browned, and a toothpick inserted into the center of each cake comes out clean, about 20 minutes. Allow the cakes to cool in the pans for about 10 minutes before cooling completely on racks.",
        "Mix 3/4 cup of softened butter, confectioners' sugar, 1 tablespoon of instant coffee, and cream in a mixing bowl with an electric mixer on High speed until the frosting is light and creamy; mix in additional cream, 1 teaspoon at a time, if needed to whip frosting to spreadable texture. Frost the cooled cake layers."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "2 cups white sugar",
        "1/4 teaspoon salt",
        "1 cup butter",
        "3 tablespoons instant coffee granules",
        "1 cup boiling water",
        "1/2 cup buttermilk",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1 teaspoon baking soda",
        "3/4 cup butter, softened",
        "3 cups confectioners' sugar",
        "1 tablespoon instant coffee granules, or more to taste",
        "2 tablespoons heavy cream, plus more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Coffee Cake. Literally.",
    "url": "http://allrecipes.com/recipe/217915/coffee-cake-literally/"
}
