{
    "directions": [
        "Stir 1 cup sugar, 1/3 cup water, and corn syrup in heavy medium saucepan over low heat until sugar dissolves. Increase heat and boil without stirring until caramel is deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 7 minutes. Working quickly, pour caramel into eight 3/4-cup custard cups. Tilt and rotate each cup to coat sides and bottom.",
        "Stir milk, ground coffee, cardamom, and 1/2 cup sugar in heavy medium saucepan over medium heat until sugar dissolves and mixture simmers. Remove pan from heat; let mixture steep 1 hour.",
        "Preheat oven to 350°F. Whisk egg yolks, whole eggs, and remaining 1/2 cup sugar in large bowl to blend. Return milk mixture to simmer; gradually whisk into egg mixture. Line sieve with several layers of moistened cheesecloth; strain custard into bowl, then divide among caramel-lined cups. Arrange cups in 13x9x2-inch metal baking pan. Pour enough hot water into baking pan to come halfway up sides of cups. Cover pan loosely with foil.",
        "Bake flans 20 minutes. Lift foil to allow steam to escape. Replace foil. Bake flans until softly set in center, lifting foil every 10 minutes, about 35 minutes longer. Remove flans from water. Chill flans 4 hours; cover and chill overnight.",
        "Run knife around flans. Turn out onto plates. Serve with crème fraîche."
    ],
    "ingredients": [
        "2 cups sugar",
        "1/3 cup water",
        "1 teaspoon light corn syrup",
        "4 cups whole milk",
        "1/4 cup finely ground espresso beans",
        "1 tablespoon whole green cardamom pods, each cracked slightly",
        "6 large egg yolks",
        "2 large eggs",
        "Orange Crème Fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Winter"
    ],
    "title": "Coffee-Cardamom Flans with Orange Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-cardamom-flans-with-orange-creme-fraiche-107724"
}
