{
    "directions": [
        "Stir sugar and water in heavy small saucepan over low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep golden brown, occasionally washing down sides of pan with wet pastry brush, about 9 minutes. Add cream (mixture will bubble up). Reduce heat to very low. Stir until caramel dissolves completely and mixture is smooth. Add butter, chocolate and espresso powder and stir until smooth. (Sauce can be prepared 2 days ahead. Cover and refrigerate.)",
        "Whisk sugar and yolks in medium bowl until thick, about 1 minute. Add flour and beat until well blended. Combine half and half and espresso powder in heavy medium saucepan. Scrape in vanilla seeds; add pod. Bring just to simmer over medium heat. Gradually whisk hot half and half mixture into egg mixture. Return egg mixture to same saucepan and cook until mixture is very thick and boils, whisking constantly. Pour mixture into medium bowl. Remove vanilla pod. Add chocolate and whisk until smooth. Press plastic wrap directly on surface of filling to prevent skin from forming; cool completely.",
        "Whisk filling until smooth. Beat chilled whipping cream in another medium bowl until stiff peaks form. Fold whipped cream into filling in 2 additions. Cover and chill at least 2 hours. (Can be prepared 8 hours ahead.)",
        "Position rack in center of oven and preheat to 425°F. Stack 2 cookie sheets. Line top cookie sheet with parchment. Trace 8 1/2-inch-diameter circle on parchment, using cake pan as guide. Turn parchment over. Butter circle lightly and dust with flour.",
        "Combine milk, butter, sugar, espresso powder and salt in heavy medium saucepan. Bring just to boil over medium heat, stirring until butter melts and sugar dissolves. Add flour and cook 3 minutes, stirring vigorously with wooden spoon (mixture will form ball). Remove from heat. Make well in center of dough. Break 1 egg into well. Using wooden spoon, beat rapidly until egg is incorporated and dough is smooth, about 1 minute. Repeat with second egg. Beat third egg to blend in small bowl. Reserve 1 tablespoon egg for glaze. Add remaining beaten egg to dough and beat until smooth.",
        "Fit pastry bag with 3/4-inch star tip (no. 7). Transfer warm dough to bag. Pipe 3/4-inch-wide ring over traced circle on parchment. Pipe second ring inside first, making certain batter adheres to inside of first ring. Pipe third ring atop center of first two rings. Brush lightly with reserved egg glaze. Sprinkle with sliced almonds.",
        "Bake pastry 2 minutes. Reduce oven temperature to 375°F. and bake until pastry is golden brown and firm to touch, about 40 minutes longer. Turn off heat. Leave pastry in oven 5 minutes. Remove from oven. Carefully remove pastry from parchment. Using serrated knife, cut pastry in half horizontally. Arrange cut sides up on rack (pastry will appear moist and slightly doughy inside). Cool completely.",
        "Fit clean pastry bag with 3/4-inch (no. 7) star tip. Transfer filling to bag. Place pastry bottom on platter. Pipe filling into pastry in large circular mounds. Set top of pastry over filling. Dust lightly with powered sugar. Gently heat sauce in heavy small saucepan. Mix in rum. Using serrated knife, cut pastry into wedges. Serve, passing sauce separately."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup water",
        "1/2 cup whipping cream",
        "1 tablespoon unsalted butter",
        "1/2 ounce bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 teaspoon instant espresso powder or instant coffee granules",
        "1/2 cup sugar",
        "4 large egg yolks",
        "1/4 cup unbleached all purpose flour",
        "1 1/2 cups half and half",
        "4 teaspoons instant espresso powder or instant coffee granules",
        "1/2 vanilla bean, split lengthwise",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup chilled whipping cream",
        "1/2 cup milk (do not use lowfat or nonfat)",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces",
        "2 tablespoons sugar",
        "1 1/2 teaspoons instant espresso powder or instant coffee granules",
        "Pinch of salt",
        "1/2 cup unbleached all purpose flour",
        "3 large eggs",
        "1/3 cup sliced almonds",
        "Powdered sugar",
        "2 tablespoons dark rum"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Anniversary",
        "Chill",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee and Chocolate Paris-Brest with Warm Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-and-chocolate-paris-brest-with-warm-caramel-sauce-1866"
}
