{
    "directions": [
        "Stir 4 cups water, coffee, 1/2 cup coarse salt, and sugar in large bowl until salt and sugar dissolve. Add syrup and next 3 ingredients; stir until ice melts. Add ribs. Place plate atop ribs to keep submerged. Cover and chill 4 to 6 hours. Drain ribs; discard marinade. DO AHEAD: Drained ribs can be made 2 days ahead. Cover and chill.",
        "Preheat oven to 325°F. Sauté bacon in heavy large wide ovenproof pot over medium heat until beginning to brown. Using slotted spoon, transfer bacon to plate. Increase heat to medium-high. Sprinkle ribs with salt and pepper. Working in batches, cook ribs until browned on all sides, about 7 minutes per batch. Transfer to large plate. Add onions, shallots, garlic, and jalapeño to pot. Reduce heat to medium, cover, and cook until vegetables are soft, stirring occasionally, about 10 minutes. Add coffee and broth; stir, scraping up browned bits. Add chili sauce and all remaining ingredients; bring to boil. Add bacon and ribs, cover, and transfer to oven. Braise until meat is tender, about 2 hours 15 minutes. DO AHEAD: Can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Rewarm in 325°F oven until heated through, about 20 minutes, before continuing.",
        "Transfer ribs to plate; tent with foil to keep warm. Spoon fat from surface of sauce. Boil sauce until reduced to 2 cups, about 5 minutes. Pour sauce over ribs."
    ],
    "ingredients": [
        "4 cups water",
        "3 cups chilled strong brewed coffee",
        "1/2 cup coarse kosher salt",
        "3 tablespoons plus 2 teaspoons (packed) dark brown sugar",
        "1/4 cup pure maple syrup",
        "2 tablespoons chopped fresh rosemary",
        "2 tablespoons plus 1 teaspoon Worcestershire sauce",
        "2 cups ice cubes",
        "4 pounds bison (often labeled buffalo) short ribs, cut between ribs to separate",
        "1/4 cup chopped bacon (about 1 1/2 ounces)",
        "2 cups chopped onions",
        "1/2 cup chopped shallots",
        "6 garlic cloves, chopped",
        "1 small jalapeño chile, seeded, chopped",
        "1 cup strong brewed coffee",
        "1 cup low-salt chicken broth",
        "1/4 cup chili sauce (such as Heinz) or ketchup",
        "2 tablespoons Dijon mustard",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Braise",
        "Marinate",
        "Dinner",
        "Buffalo",
        "Bacon",
        "Winter",
        "Jalapeño",
        "Maple Syrup",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Coffee-Marinated Bison Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-marinated-bison-short-ribs-241342"
}
