{
    "directions": [
        "Press raspberries through fine sieve into small bowl. Press jam through same sieve into raspberry puree; discard seeds. Stir to blend well. Cover and chill overnight.",
        "Combine 3/4 cup cream, white chocolate and coffee crystals in heavy medium saucepan. Stir over low heat just until chocolate melts, coffee dissolves and mixture is smooth. Remove from heat. Let stand until cool and thick, whisking occasionally, about 1 1/2 hours.",
        "Using electric mixer, beat 1 3/4 cups cream in large bowl until firm peaks form. Fold large spoonful of whipped cream into chocolate mixture to lighten. Fold chocolate mixture into whipped cream in 4 additions. Cover and refrigerate frosting until very firm, about 6 hours. (Can be prepared 1 day ahead; keep chilled.)",
        "Preheat oven to 350°F. Line three 9-inch diameter cake pans with 1 1/2-inch-high sides with parchment. Butter and flour parchment. Combine nuts, flour, 1/4 cup sugar, coffee crystals and salt in processor. Blend until nuts are finely ground.",
        "Using electric mixer, beat yolks and 1/2 cup sugar in large bowl until very thick, about 5 minutes. Beat in water and vanilla. Stir in flour mixture. Using clean dry beaters, beat egg whites in large bowl until soft peaks form. Gradually add 1/2 cup sugar, beating until stiff but not dry. Fold into yolk mixture in 3 additions.",
        "Transfer batter to prepared pans. Bake cakes until tester inserted into center comes out clean, about 18 minutes. Cool cakes in pans on racks. Cut around pan sides to loosen cakes. Turn cakes out; peel off parchment.",
        "Place 1 cake on platter and second cake on piece of foil. Spread 1/3 cup filling over each; let stand 20 minutes to set up. Spread 1 cup frosting over each. Lift cake off foil; place atop cake on platter. Top with third cake. Spread remaining frosting over sides and top of torte. (Can be prepared 1 day ahead. Cover with cake dome and refrigerate.)",
        "Garnish torte with fresh berries, if desired. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 cup frozen unsweetened raspberries, thawed, drained",
        "1 cup raspberry jam",
        "2 1/2 cups chilled whipping cream",
        "10 ounces good-quality white chocolate (such as Lindt or Bakers), chopped",
        "1 cup hazelnuts, toasted, husked",
        "1 cup sifted all purpose flour",
        "1 1/4 cups sugar",
        "1 teaspoon instant coffee crystals",
        "1/4 teaspoon salt",
        "6 large eggs, separated",
        "1/4 cup water",
        "1 teaspoon vanilla extract",
        "Fresh raspberries (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Berry",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Raspberry",
        "Fall",
        "Birthday",
        "Hazelnut",
        "Party"
    ],
    "title": "Coffee, Hazelnut and Raspberry Torte",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-hazelnut-and-raspberry-torte-1066"
}
