{
    "directions": [
        "Butter large piece of foil. Stir sugar, honey, and 1 tablespoon water in heavy small saucepan over low heat until sugar dissolves. Increase heat to high; boil without stirring until syrup turns deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 4 minutes. Remove from heat. Immediately stir in almonds. Pour mixture onto prepared foil. Cool completely. Chop praline into 1/2-inch pieces.",
        "Line 9x5x23/4-inch metal loaf pan with plastic. Stir vanilla ice cream, 2 tablespoons brandy, and orange peel in bowl. Fold in cookies. Spoon half of ice cream mixture into prepared pan. Cover and freeze pan and remaining vanilla ice cream mixture separately until almost firm.",
        "Stir coffee ice cream, 2 tablespoons brandy, and ground coffee in another bowl. Fold in chopped praline. Spoon half of coffee ice cream mixture atop vanilla ice cream in loaf pan. Top with remaining vanilla ice cream mixture, then coffee ice cream mixture. Cover with plastic and freeze until firm, about 4 hours. (Can be made 2 days ahead. Keep frozen.)",
        "Remove torte from loaf pan. Cut into 1-inch-thick slices and serve with oranges."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "2 tablespoons honey",
        "1 tablespoon water",
        "3/4 cup slivered almonds, toasted",
        "3 cups vanilla ice cream, slightly softened",
        "4 tablespoons brandy",
        "1 tablespoon grated orange peel",
        "1 cup chopped butter cookies",
        "3 cups coffee ice cream, slightly softened",
        "1 tablespoon freshly ground coffee beans",
        "Honey-Brandy Oranges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Nut",
        "Dessert",
        "Frozen Dessert",
        "Almond",
        "Brandy",
        "Summer",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee and Turron Ice Cream Torte with Honey-Brandy Oranges",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-and-turron-ice-cream-torte-with-honey-brandy-oranges-107168"
}
