{
    "directions": [
        "Mix all ingredients in small bowl. DO AHEAD: Can be made 1 week ahead. Store airtight at room temperature.",
        "Cook bacon in large skillet until crisp. Transfer to paper towels to drain. Break in half. Gently mix chuck and sirloin in large bowl. Form meat into 8 patties, each 3 1/2 to 4 inches in diameter and 1/3 to 1/2 inch thick. Using thumb, make slight indentation in center of each burger. DO AHEAD: Burgers and bacon can be prepared 8 hours ahead. Cover separately and chill.",
        "Prepare barbecue (medium-high heat). Sprinkle 1 teaspoon coffee rub on top side of each burger. Place burgers, rub side down, on grill rack. Grill until slightly charred, about 4 minutes; turn.",
        "Place 2 bacon slice halves atop each burger. Cook 3 minutes.",
        "Top each with 1 cheese slice. Cover and cook until cheese melts, about 1 minute longer. Place burgers atop bottom halves of buns. Top with onion slices and tomato slices. Spoon dollop of Texas Barbecue Sauce over. Cover with bun tops and serve, passing additional sauce alongside.",
        "Beer is a natural pairing for a burger. Keep the southern theme going by pouring a Texas brew. We like the caramel sweetness and mild hoppy flavor of Shiner Bock ($8 per six-pack)."
    ],
    "ingredients": [
        "1 tablespoon freshly ground coffee",
        "2 teaspoons (packed) golden brown sugar",
        "2 teaspoons freshly ground black pepper",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon fine sea salt",
        "8 slices applewood-smoked bacon",
        "1 pound ground chuck (preferably grass-fed)",
        "1 pound ground sirloin (preferably grass-fed)",
        "8 slices smoked provolone, smoked caciocavallo, or smoked Gouda cheese (about 8 ounces)",
        "8 potato-bread hamburger buns",
        "8 slices red onion",
        "8 slices tomato",
        "Texas Barbecue Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Gouda",
        "Ground Beef",
        "Bacon",
        "Grill",
        "Grill/Barbecue",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Coffee-Rubbed Cheeseburgers with Texas Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-rubbed-cheeseburgers-with-texas-barbecue-sauce-353870"
}
