{
    "directions": [
        "Put oven rack in middle position and preheat oven to 250°F. Brush loaf pans lightly with oil, then line bottom and sides with foil, pressing corners to help adhere.",
        "Sift together flour, cinnamon, salt, cloves, and nutmeg into a large bowl.",
        "Toss currants and raisins with 2 tablespoons flour mixture in a bowl. Stir together coffee and baking soda in a small bowl until dissolved.",
        "Beat together with butter and sugar in a large bowl with an electric mixer at medium-high speed until light and fluffy, 5 to 7 minutes. Add eggs, 2 at a time, beating well after each addition, and beat in molasses. Reduce speed to low, then add flour mixture and coffee mixture alternately in batches, beginning and ending with flour mixture and mixing until just smooth. Fold in dried fruit mixture.",
        "Divide batter between loaf pans and smooth tops by gently rapping bottom of each pan against counter.",
        "Bake until a wooden pick or skewer inserted in center of each cake comes out clean, 2 3/4 to 3 1/4 hours (cakes may sink slightly in center). Cool pans on racks 10 minutes, then loosen foil from sides of pans with knife and turn out cakes onto racks. Peel off foil and cool cakes completely, about 3 hours."
    ],
    "ingredients": [
        "3 1/2 cups plus 2 tablespoons all-purpose flour",
        "2 teaspoons cinnamon",
        "1 teaspoon salt",
        "1 teaspoon ground cloves",
        "1 teaspoon freshly grated nutmeg",
        "1 lb dried currants (3 1/3 cups)",
        "1 lb raisins (3 cups)",
        "1 cup lukewarm strong coffee",
        "1 teaspoon baking soda",
        "2 sticks (1 cup) unsalted butter, softened",
        "2 cups packed light brown sugar",
        "4 large eggs",
        "1 cup molasses (not robust or blackstrap)",
        "Special equipment: 2 (9- by 5- by 3-inch) loaf pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Egg",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Raisin",
        "Winter",
        "Molasses",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee Fruitcake",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-fruitcake-232819"
}
