{
    "directions": [
        "Bring 2 cups cream and milk to boil in heavy medium saucepan. Remove from heat. Whisk egg yolks, molasses and sugar to blend in large bowl. Gradually whisk in hot cream mixture. Return mixture to saucepan and stir over medium-low heat until mixture thickens and leaves path on back of spoon when finger is drawn across, about 12 minutes; do not boil or mixture will curdle. Remove from heat. Mix in instant coffee and remaining 1 cup cream. Refrigerate coffee custard until well chilled. (Can be prepared 2 days ahead.)",
        "Process coffee custard in ice cream maker according to manufacturer's instructions. Freeze custard mixture until firm. (Coffee-molasses ice cream can be prepared 1 week ahead.)",
        "Position rack in center of oven and preheat to 350°F. Butter large cookie sheet. Line another large cookie sheet with waxed paper. Combine molasses, sugar and salt in heavy medium saucepan. Boil 1 minute. Remove from heat. Add pecans and stir to coat well. Spread pecans on buttered cookie sheet. Bake until pecans are just beginning to brown, about 10 minutes. Immediately transfer pecans to waxed paper-lined cookie sheet and separate with 2 forks. Cool completely. (Molasses-glazed pecans can be prepared 1 week ahead. Store at room temperature in airtight container.)",
        "Scoop coffee-molasses ice cream into dishes. Top with molasses-glazed pecans and serve immediately."
    ],
    "ingredients": [
        "3 cups whipping cream",
        "1 cup milk (do not use lowfat or nonfat)",
        "6 egg yolks",
        "3/4 cup light unsulfured molasses",
        "1/4 cup sugar",
        "2 tablespoons instant coffee granules",
        "1/4 cup light unsulfured molasses",
        "1/4 cup sugar",
        "Pinch of salt",
        "2 cups (about 8 ounces) pecan halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Pecan",
        "Summer",
        "Molasses"
    ],
    "title": "Coffee-Molasses Ice Cream with Molasses-Glazed Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-molasses-ice-cream-with-molasses-glazed-pecans-1472"
}
