{
    "directions": [
        "Position rack in center of oven; preheat to 325°F. Generously butter two 9-inch cake pans with 2-inch-high sides; dust with flour, tapping out any excess. Line bottom of pans with parchment paper.",
        "Sift 2 cups cake flour, cocoa, baking soda, and salt into medium bowl. Using electric mixer, beat butter in large bowl until smooth. Add brown sugar and beat until well blended, about 2 minutes. Add eggs 1 at a time, beating well after each addition. Mix in vanilla. Add flour mixture in 3 additions alternately with buttermilk in 2 additions, beating just until blended after each addition. Gradually add hot espresso-water mixture, beating just until smooth.",
        "Divide batter between pans; smooth tops. Bake cakes until tester inserted into center comes out clean, about 40 minutes. Cool cakes in pans on rack 15 minutes. Run small knife around sides of pans to loosen cakes. Invert cakes onto racks; lift pans off cakes and remove parchment. Place wire rack atop each cake; invert again so top side is up. Cool completely. DO AHEAD: Can be made 1 day ahead. Wrap each cake in plastic and store at room temperature.",
        "Sift cocoa powder into large bowl; add espresso powder. Bring 1 cup cream to boil in small saucepan. Slowly pour cream over cocoa mixture, whisking until cocoa is completely dissolved, about 1 minute. Add 1/2 cup cream and sugar; stir until sugar dissolves. Chill until cold, at least 2 hours. DO AHEAD: Can be made 1 day ahead. Cover; keep chilled.",
        "Add mascarpone to chilled cocoa mixture. Using electric mixer, beat on low speed until blended and smooth. Increase speed to medium-high; beat until mixture is thick and medium-firm peaks form when beaters are lifted, about 2 minutes (do not overbeat or mixture will curdle).",
        "Using pastry brush, brush off crumbs from cakes. Place 1 cake layer, top side up, on platter. Spoon 13/4 cups frosting in dollops over top of cake. Using offset spatula, spread frosting to edges. Top with second cake layer, top side up, pressing to adhere. Spread thin layer of frosting over top and sides of cake. Chill 10 minutes. Using offset spatula, spread remaining frosting over top and sides of cake, swirling decoratively. Top with chocolate curls, if desired. DO AHEAD: Can be made 1 day ahead. Cover with cake dome; chill. Let stand at room temperature 20 minutes before serving.",
        "*An Italian cream cheese; sold at many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "2 cups cake flour",
        "3/4 cup natural unsweetened cocoa powder",
        "1 1/2 teaspoons baking soda",
        "3/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2 cups (packed) golden brown sugar",
        "3 large eggs",
        "11/2 teaspoons vanilla extract",
        "1 cup buttermilk",
        "4 teaspoons instant espresso powder dissolved in 3/4 cup hot water",
        "1/3 cup natural unsweetened cocoa powder",
        "1 tablespoon instant espresso powder",
        "1 1/2 cups chilled heavy whipping cream, divided",
        "1 1/3 cups sugar",
        "2 8-ounce containers chilled mascarpone cheese*",
        "Bittersweet chocolate curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Birthday",
        "Shower",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coffee-Chocolate Layer Cake with Mocha-Mascarpone Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/coffee-chocolate-layer-cake-with-mocha-mascarpone-frosting-352096"
}
