{
    "directions": [
        "Roast corn on rack of gas burner over high heat, turning occasionally with tongs, until kernels are charred in spots, 4 to 5 minutes. (Alternatively, heat a dry well-seasoned cast-iron skillet and roast corn over moderately high heat, turning occasionally, about 10 minutes.) Transfer corn to a cutting board and, when cool enough to handle, cut kernels from cob with a sharp knife, then cut cob into thirds.",
        "Bring kernels, cob pieces, 4 cups water, garlic, salt, and 1/2 cup onion to a boil in a 3-quart saucepan and boil until liquid is reduced to about 3 cups, about 20 minutes. Remove from heat and cool, uncovered. Discard cob pieces.",
        "Purée corn mixture along with chile and remaining 3/4 cup onion in a blender, then pour through a fine-mesh sieve into a bowl, pressing hard on and then discarding solids. Return broth to cleaned blender.",
        "Quarter, pit, and peel 1 avocado, then add to blender with 2 tablespoons lime juice and purée until smooth. Transfer soup to a bowl and cover surface with plastic wrap. Cover bowl with plastic wrap and chill soup at least 1 hour.",
        "Purée cilantro, oil, and salt in cleaned blender, scraping down sides of blender several times. Pour oil into cleaned fine-mesh sieve set over a bowl and let drain 15 minutes (do not press on solids). Discard solids.",
        "Halve and pit remaining avocado and scoop small balls from flesh with melon-ball cutter, then toss gently with remaining tablespoon lime juice in a bowl.",
        "Whisk together crema and remaining 2 tablespoons water in a small bowl until smooth.",
        "Season soup with salt and ladle into 6 shallow soup bowls. Divide avocado balls among bowls, then drizzle with crema and cilantro oil."
    ],
    "ingredients": [
        "1 fresh or frozen ear of corn, shucked",
        "4 cups plus 2 tablespoons water",
        "1 garlic clove, smashed",
        "1 1/2 teaspoons salt",
        "1 1/4 cups chopped white onion",
        "1 fresh serrano chile, stemmed and coarsely chopped (including seeds)",
        "2 firm-ripe California avocados (1 to 1 1/4 lb total)",
        "3 tablespoons fresh lime juice",
        "1/4 cup crema or sour cream",
        "1 cup coarsely chopped fresh cilantro",
        "1/4 cup olive oil",
        "1/2 teaspoon salt",
        "Special equipment: a 3/4-inch melon-ball cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fruit",
        "Herb",
        "Vegetable",
        "Freeze/Chill",
        "Avocado",
        "Corn",
        "Summer",
        "Chill",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Cold Avocado Corn Soup With Cilantro Oil",
    "url": "http://www.epicurious.com/recipes/food/views/cold-avocado-corn-soup-with-cilantro-oil-231993"
}
