{
    "directions": [
        "In a heavy stainless steel or enameled kettle steam the mussels in the wine covered over high heat shaking the kettle once or twice, for 4 to 6 minutes, or until the shells have opened. Discard any unopened shells. Transfer the mussels with a slotted spoon to jelly-roll pans, reserving the mussel liquor, discard the top shells, and release the the mussels from the bottom shells, leaving them in the shells. Chill the mussels, covered loosely with dampened paper towels and wrapped in plastic wrap, for at least 2 hours or overnight. Strain the reserved mussel liquor through a fine sieve lined with a double thickness of rinsed and squeezed cheesecloth into a small bowl.",
        "In a large stainless steel or enameled skillet cook the onions in the oil over moderate, stirring, until they are softened, add the garlic, and cook the mixture, stirring, stirring until the garlic is softened. Add the cumin and cook the mixture over moderately low heat, stirring, for 1 minute. Add the tomatoes and 3/4 cup of the strained mussel liquor, bring the liquid to a boil, and simmer the mixture, stirring for 10 minutes, or until it is thickened slightly. Stir in the chili peppers, the scallion, and salt and pepper to taste, let the sauce cool, and stir in the minced coriander.",
        "Spoon the sauce over the mussels, arrange the mussels decoratively on platters, and garnish the platters with the coriander leaves if desired. (The mussels with the sauce may be prepared up to 1 day ahead and kept covered and chilled.)"
    ],
    "ingredients": [
        "4 pounds mussels, cleaned",
        "1/2 cup dry white wine",
        "2 onions, minced",
        "1/2 cup olive oil",
        "4 garlic cloves, minced",
        "2 teaspoons ground cumin",
        "2 pounds tomatoes, peeled, seeded and chopped fine or two 35-ounce cans Italian plum tomatoes, drained well and chopped fine",
        "four 4-inch fresh green hot chili peppers, seeded and minced wearing rubber gloves",
        "1/4 cup minced scallion",
        "1/4 cup minced fresh coriander"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Shellfish",
        "Tomato",
        "Steam",
        "Cocktail Party",
        "Mussel",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Cold Mussels with Tomato Coriander Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cold-mussels-with-tomato-coriander-sauce-101562"
}
