{
    "directions": [
        "Boil 2 cups water, star anise, ginger, and zest in a 1-quart saucepan, covered, 5 minutes, then cool infusion, uncovered, to room temperature, about 30 minutes.",
        "Stir together kosher salt, Insta Cure, and remaining 4 cups water in storage tub until solids are dissolved, about 3 minutes, then add brown sugar, soy sauce, hoisin sauce, and cooled infusion (with solids). Add ice and stir until cure is cold (ice may not melt completely; keeping liquid cold slows salt absorption).",
        "Add chicken to cure and weight down with a large plate (to keep submerged). Chill, tub covered with a lid or plastic wrap, 4 to 6 hours.",
        "Rinse chicken and pat dry, then discard brine.",
        "Open vents on bottom of grill and on lid. Remove lid and top rack from grill, then center disposable roasting pan on lower rack and add 1 1/2 cups sawdust to pan.",
        "Light 6 charcoal briquettes in chimney starter. When briquettes are fully lit (covered completely with gray ash and glowing), transfer with tongs to sawdust, spacing evenly.",
        "When sawdust begins to smolder, replace top rack and arrange chicken legs on rack about 1 inch apart. Cover grill with lid, then insert thermometer into a vent hole in lid to monitor air temperature, which should be 80 to 120°F. (If temperature rises above 120°F, remove 1 or more briquettes or uncover grill slightly until temperature falls. If temperature falls below 80°F or sawdust stops burning, light 1 more briquette and add to sawdust.)",
        "Smoke chicken, adding 1 1/2 cups sawdust to roasting pan and stirring with tongs every 1 1/2 hours to ignite unburned sawdust, 6 hours. (Chicken will not be cooked.)",
        "Put oven rack in middle of oven and preheat oven to 350°F. Lightly oil an 11- by 17-inch roasting pan. Transfer smoked chicken, skin sides up, to pan and bake until the thickest part of a thigh registers 170°F on thermometer, about 25 minutes. Cool completely, uncovered, then chill, wrapped in plastic wrap, until ready to serve."
    ],
    "ingredients": [
        "6 cups cold water",
        "4 whole star anise",
        "6 (1/8-inch-thick) slices fresh ginger",
        "1 (3- by 1/2-inch) strip fresh orange zest",
        "1 cup kosher salt",
        "2 1/2 tablespoons Insta Cure No. 1 (curing salt)",
        "1/2 cup packed dark brown sugar",
        "1/4 cup soy sauce",
        "1/4 cup hoisin sauce",
        "3 cups ice cubes",
        "5 whole chicken legs (with thighs attached; 3 lb)",
        "Special equipment: a 1- to 2-gallon plastic storage tub; a 22 1/2-inch kettle grill with a lid and a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 6 cups hardwood sawdust (3/4 lb; not from treated wood); charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Bake",
        "Summer",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Cold-Smoked Chicken Legs in a Chinese Cure",
    "url": "http://www.epicurious.com/recipes/food/views/cold-smoked-chicken-legs-in-a-chinese-cure-232188"
}
