{
    "directions": [
        "In a saucepan of boiling salted water cook shrimp until just cooked through, 1 to 2 minutes, and drain. Let shrimp cool and cut into 1/4-inch pieces.",
        "In a small bowl toss carrot with scallion greens, vinegar, and salt and pepper to taste.",
        "Fill a small shallow baking pan or cake pan with warm water. Working with 4 sheets rice paper at a time, immerse them in water and let stand until very pliable, about 45 seconds. Carefully arrange soaked sheets in a single layer on paper towels to drain. Working with 1 soaked sheet at a time and keeping remaining sheets covered with dampened paper towels, put sheet on a clean dry work surface and arrange about 1 tablespoon coriander leaves in a horizontal line across bottom, leaving a 1-inch border on bottom edge and on each side. Top coriander with about 2 tablespoons shrimp pieces and top shrimp with about 1 tablespoon carrot mixture. Sprinkle about 1 tablespoon lettuce, about 1 tablespoon sprouts, and salt and pepper to taste over carrot mixture. Roll up filling tightly in sheet, folding in 2 sides of sheet to completely enclose filling, and continue rolling.",
        "Make more spring rolls in same manner with remaining 3 soaked sheets. Transfer assembled rolls to a tray and cover with dampened paper towels. Repeat procedure with remaining 8 rice paper sheets and filling ingredients. Tightly cover tray with plastic wrap (keeping dampened paper towels directly on spring rolls). Spring rolls may be made 6 hours ahead and chilled.",
        "Just before serving, with a serrated knife cut spring rolls in half diagonally. Arrange spring rolls on a platter and garnish with coriander sprigs. Serve spring rolls with cashew dipping sauce.",
        "In a food processor blend cashews with oil, scraping down sides, until mixture forms a paste. Add remaining ingredients and salt and pepper to taste and blend until smooth. Dipping sauce may be made 4 days ahead and kept chilled, covered. Return dipping sauce to room temperature before serving. Makes about 1 1/2 cups."
    ],
    "ingredients": [
        "1 pound large shrimp (about 15), shelled and deveined",
        "3/4 cup finely shredded carrot",
        "1/4 cup finely chopped scallion greens",
        "1 teaspoon rice vinegar, or to taste",
        "twelve 6 1/2-inch rounds of rice paper*",
        "3/4 cup fresh coriander leaves",
        "3/4 cup finely shredded Bibb lettuce",
        "3/4 cup alfalfa sprouts",
        "Garnish: coriander sprigs",
        "1 cup unsalted roasted cashews (about 1/4 pound)",
        "1 tablespoon vegetable oil",
        "3/4 cup plain yogurt",
        "2 garlic cloves, minced",
        "1 tablespoon fresh lemon juice, or to taste",
        "1 tablespoon soy sauce, or to taste",
        "cayenne to taste",
        "*available at Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Nut",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Cocktail Party",
        "Yogurt",
        "Cashew",
        "Shrimp",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free"
    ],
    "title": "Cold Shrimp and Vegetable Spring Rolls with Cashew Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cold-shrimp-and-vegetable-spring-rolls-with-cashew-dipping-sauce-12047"
}
