{
    "directions": [
        "Heat 4 tablespoons oil in heavy large pot over medium heat. Add onions, carrots, finely chopped garlic and bay leaf. Cover; cook until carrots are tender, stirring occasionally, about 10 minutes. Add tomatoes. Cover; cook until tomatoes release juices, about 10 minutes. Uncover; cook until juices evaporate, stirring often, about 20 minutes. Add broth and chopped thyme. Partially cover pot and simmer until mixture is reduced to 6 cups, stirring occasionally, about 10 minutes longer.",
        "Cool soup slightly. Discard bay leaf. Puree half of soup in blender. Stir into soup in pot. Season with salt and pepper. Chill uncovered until cold, then cover. (Can be made 1 day ahead. Keep chilled.)",
        "Prepare barbecue (medium heat). Place smoke chips in 8x6-inch foil packet with open top. Set packet atop coals about 5 minutes before grilling. Brush 1 tablespoon oil over both sides of bread slices. Grill bread until lightly browned, about 2 minutes per side. Rub garlic clove halves over bread. Cut bread into 3/4-inch cubes.",
        "Divide cold soup among bowls. Top with croutons. Garnish with thyme."
    ],
    "ingredients": [
        "5 tablespoons olive oil (preferably extra-virgin)",
        "2 cups finely chopped onions",
        "3/4 cup finely chopped peeled carrots",
        "2 1/2 teaspoons finely chopped garlic",
        "1 bay leaf",
        "3 pounds ripe tomatoes, halved, seeded, chopped (about 5 cups)",
        "3 cups canned low-salt chicken broth",
        "3 tablespoons finely chopped fresh thyme or 1 tablespoon dried",
        "1 cup hickory smoke chips, soaked in water 30 minutes, drained",
        "3 3/4-inch-thick slices sourdough bread",
        "1 garlic clove, halved",
        "Fresh thyme sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Herb",
        "Onion",
        "Tomato",
        "Freeze/Chill",
        "Summer",
        "Chill"
    ],
    "title": "Cold Tomato-Thyme Soup with Grilled Garlic Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/cold-tomato-thyme-soup-with-grilled-garlic-croutons-2141"
}
