{
    "directions": [
        "Preheat the oven to 350ºF. Grease a 10-inch round cake pan.",
        "Place the lard and brown sugar in the bowl of a stand mixer fitted with the paddle attachment. Mix on low speed to combine, and then increase the speed to high to cream them together. Mix until the mixture becomes smooth and a very light brown, scraping down the sides of the bowl as needed; this takes about 20 minutes.",
        "Meanwhile, whisk together the flour, cornmeal, baking powder, baking soda, salt, ginger, cinnamon, nutmeg, and cloves in a large bowl. In a separate large bowl, whisk together the apple butter, buttermilk, and bourbon.",
        "Once the lard-sugar mixture is ready, reduce the speed to medium and add the eggs and egg yolk, one at a time, until incorporated. Add the flour mixture in thirds, alternating with the apple butter mixture, mixing only until the batter is smooth each time.",
        "Pour the batter into the prepared cake pan and bake for 40 to 45 minutes, until a toothpick inserted in the center comes out dry. Turn out of pan onto a rack to cool while you make the syrup.",
        "Combine the sorghum and cream in a heavy-bottomed saucepan, and bring to a boil. Then reduce the heat to low and simmer for 10 minutes. Whisk until well blended.",
        "Transfer the cake to a serving plate. Poke holes throughout the top of the cake with a fork, and slowly pour the syrup all over the cake until it has been absorbed. Serve slightly warm."
    ],
    "ingredients": [
        "1/4 pound leaf lard, cut into large cubes, at room temperature, plus a little to grease the pan",
        "1 cup packed light brown sugar",
        "3/4 cup plus 2 tablespoons all-purpose flour",
        "3/4 cup plus 1 tablespoon stone-ground white cornmeal",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "1 1/2 tablespoons ground ginger",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground cloves",
        "1 cup apple butter",
        "1 cup whole buttermilk",
        "2 tablespoons bourbon",
        "2 large eggs",
        "1 large egg yolk",
        "1 cup sorghum syrup",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Molasses",
        "Buttermilk",
        "Bake",
        "Cornmeal",
        "Spice",
        "Ginger",
        "Cinnamon",
        "Clove",
        "Nutmeg"
    ],
    "title": "Colin Perry’s Sorghum and Apple Sticky Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/colin-perrys-sorghum-and-apple-sticky-pudding"
}
