{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch glass baking dish.",
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.",
        "Heat the vegetable oil in a large skillet over medium heat; cook the sausage in the hot oil for 5 minutes. Add the white onions and green onions; cook another 5 minutes. Stir in the tomato, cumin, and thyme. Season with salt and pepper. Reduce heat to low and simmer 10 minutes.",
        "Place the bread cubes in a bowl; pour the milk over the bread making sure to wet each piece.",
        "Arrange about half of the potato slices into the bottom of the prepared dish. Spread the sausage mixture over the potatoes. Top with succeeding layers of the sliced eggs, about half of the moistened bread, the mozzarella cheese, the remaining potato slices, the remaining moistened bread, and finally the Parmesan cheese.",
        "Bake in the preheated oven until heated completely, about 30 minutes."
    ],
    "ingredients": [
        "6 large potatoes, peeled and sliced",
        "2 tablespoons vegetable oil",
        "6 links pork sausage links, sliced",
        "1/4 cup diced white onion",
        "1/4 cup chopped green onion",
        "1/2 cup diced fresh tomato",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground dried thyme",
        "salt and pepper to taste",
        "3 slices white sandwich bread, cut into 1-inch pieces",
        "1/2 cup milk",
        "1 cup shredded mozzarella cheese",
        "1 cup grated Parmesan cheese",
        "2 tablespoons vegetable oil",
        "6 hard-boiled eggs, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Colombian Turmada Potatoes (Papa Turmada)",
    "url": "http://allrecipes.com/recipe/182113/colombian-turmada-potatoes-papa-turm/"
}
