{
    "directions": [
        "Mix first 5 ingredients in processor. Add shortening and cut in until mixture resembles coarse meal. Blend in enough buttermilk by tablespoons to form dough that begins to clump together. Gather dough into ball; divide in half. Flatten each half into disk. Wrap each disk in plastic and chill 45 minutes. (Can be made 1 day ahead.)",
        "Position rack in lowest third of oven and preheat to 375°F. Coarsely chop cranberries with sugar and pumpkin pie spice in processor. Transfer mixture to large bowl. Add apples, currants and flour and toss well.",
        "Roll out 1 dough disk between sheets of waxed paper to 13-inch round. Peel off top sheet of paper; invert dough into 9 1/2-inch-diameter deep-dish glass pie dish. Peel off paper. Fold under overhanging dough to form double-thick edge. Crimp edge. Roll out remaining dough disk on lightly floured surface to 1/8-inch-thick round. Using 3-inch-long leaf cookie cutter, cut out leaves. Using knife, mark veins in leaves. Slightly mound filling in pie dish. Arrange leaves around edge of pie and all over top, overlapping decoratively. Brush pastry all over with buttermilk.",
        "Place pie on baking sheet. Bake 45 minutes. Cover pie with foil and continue baking until juices bubble thickly and crust browns, about 35 minutes more. Transfer pie to rack and cool 1 hour. Serve warm or at room temperature with ice cream."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "3/4 cup yellow cornmeal",
        "5 tablespoons sugar",
        "1 1/4 teaspoons pumpkin pie spice",
        "1/2 teaspoon salt",
        "3/4 cup plus 2 tablespoons solid vegetable shortening, room temperature",
        "6 tablespoons (about) buttermilk",
        "1 cup fresh cranberries",
        "1 cup plus 2 tablespoons sugar",
        "2 teaspoons pumpkin pie spice",
        "3 pounds Pippin apples, peeled, cored, cut into 1/2-inch thick slices",
        "1/2 cup dried currants",
        "5 tablespoons all purpose flour",
        "Buttermilk",
        "Rum raisin ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Currant",
        "Apple",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Colonial Times Apple-Cranberry Pie with Cornmeal Crust",
    "url": "http://www.epicurious.com/recipes/food/views/colonial-times-apple-cranberry-pie-with-cornmeal-crust-827"
}
