{
    "directions": [
        "Put chicken in a 6- to 8-quart pot and add water, broth, onion, guascas, and 1 1/2 teaspoons salt. Bring to a boil, skimming foam, then reduce heat and simmer, covered, until chicken is cooked through, 30 to 40 minutes. Transfer to a plate to cool slightly (reserve broth).",
        "Add papas criollas to reserved broth (if using russet potatoes, peel and coarsely grate first) and simmer, uncovered, stirring occasionally, until potatoes are falling apart and beginning to thicken broth (mash if necessary), 20 to 30 minutes.",
        "Meanwhile, peel Yukon Golds and boiling potatoes and cut into 1-inch pieces, then add to pot and simmer, covered, stirring occasionally, until almost tender, 10 to 15 minutes.",
        "Add corn, 1/4 cup cilantro, and 1 teaspoon coarsely ground black pepper and simmer, covered, until corn is tender, 5 to 10 minutes.",
        "While corn cooks, coarsely shred chicken, discarding skin and bones.",
        "Add chicken to stew and cook, stirring occasionally, until heated through. Season with salt.",
        "Serve stew with crema, capers, avocados, and remaining 1/2 cup cilantro, each in separate bowls (or add them to stew in pot just before serving)."
    ],
    "ingredients": [
        "1 whole chicken (about 3 1/2 pounds)",
        "2 quarts water",
        "2 cups reduced-sodium chicken broth",
        "1 large white onion, chopped",
        "1 tablespoon dried guascas or oregano",
        "1 pound papas criollas (thawed if frozen), quartered, or russet (baking) potatoes",
        "1 pound Yukon Gold potatoes",
        "1 pound boiling potatoes",
        "3 ears corn, cut into 1-inch rounds, or 2 cups kernels (10 ounces)",
        "3/4 cup chopped cilantro, divided",
        "1 cup crema, or 1/2 cup heavy cream mixed with 1/2 cup sour cream",
        "1/4 cup drained capers",
        "3 (6- to 8-ounces) firm-ripe avocados, cut into cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Chicken",
        "Potato",
        "Stew",
        "Dinner",
        "Lunch",
        "Corn",
        "Root Vegetable",
        "Cilantro",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Colombian Chicken, Corn, and Potato Stew",
    "url": "http://www.epicurious.com/recipes/food/views/colombian-chicken-corn-and-potato-stew-239925"
}
