{
    "directions": [
        "Melt half the butter in a large heavy pot over medium-high heat; add mushrooms and season with salt. Cook and stir mushrooms until softened and beginning to brown, 5 to 10 minutes. Pour 2 tablespoons white wine over the mushrooms; cook and stir until the wine reduces in volume, about 2 minutes more.",
        "Stir kale with the mushrooms, season with salt, and place a lid on the pot; cook until the kale has wilted, about 5 minutes.",
        "Stir chicken and cranberries with the kale mixture; season with salt and pepper. Transfer the mixture to a large bowl and return the pot to medium-high heat.",
        "Melt remaining butter in the pot; add leeks and season with salt. Saute leeks until softened, 2 to 3 minutes. Stir rice and thyme with the leeks to coat the rice in butter; cook and stir until fragrant, 2 to 3 minutes.",
        "Pour 2 cups chicken broth into the pot; cook, stirring occasionally, until the broth has mostly absorbed into the rice and a spoon dragged through the rice leaves a trail, about 8 minutes; repeat process twice more with remaining broth.",
        "Stir water and chicken drippings together in a bowl. Stir 2 cups of the mixture into the pot; cook, stirring occasionally, until the broth has mostly absorbed into the rice and a spoon dragged through the rice leaves a trail, about 8 minutes; repeat process twice more with remaining mixture, cooking until the mixture is creamy and the rice is plump and remains firm to the bite. Remove and discard thyme sprig. Season rice mixture with salt and pepper.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Stir about 2/3 of the kale mixture into the rice mixture; spread into a large baking dish and top with remaining kale mixture.",
        "Bake in preheated oven until heated through, about 15 minutes."
    ],
    "ingredients": [
        "1/2 cup butter, divided",
        "1 pound mushrooms, thinly sliced",
        "kosher salt to taste",
        "6 tablespoons white wine, divided",
        "1 1/2 bunches lacinato kale",
        "2 cups chopped roasted chicken",
        "1 cup dried cranberries",
        "freshly ground black pepper to taste",
        "2 large leeks (white and pale green parts only), thinly sliced",
        "2 cups short-grain brown rice",
        "1 sprig fresh thyme",
        "4 cups low-sodium chicken broth, divided",
        "6 cups water",
        "1/4 cup drippings from a roast chicken"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Comforting Chicken, Cranberry, and Mushroom Risotto",
    "url": "http://allrecipes.com/recipe/241424/comforting-chicken-cranberry-and-mu/"
}
