{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "Pat the beef dry with a paper towel. Season the roast all over with 1 tablespoon salt and 1 1/2 teaspoons pepper. Dredge the whole roast in flour, including the ends. In a large Dutch oven, heat 2 tablespoons olive oil over medium heat. Add the roast and sear for 4 to 5 minutes, until nicely browned. Turn and sear the other side and then turn and sear the ends. This should take 4 to 5 minutes for each side. Remove the roast to a large plate.",
        "Add 2 tablespoons olive oil to the Dutch oven. Add the carrots, onions, celery, leeks, garlic, 1 tablespoon salt, and 1 1/2 teaspoons pepper and cook over medium heat for 10 to 15 minutes, stirring occasionally, until tender but not browned. Add the wine and Cognac and bring to a boil. Add the tomatoes, chicken stock, bouillon cube, 2 teaspoons salt, and 1 teaspoon pepper. Tie the thyme and rosemary together with kitchen string and add to the pot. Put the roast back into the pot, bring to a boil, and cover. Place in the oven for 2 1/2 hours, until the meat is fork tender or about 160 degrees F internally. Turn the heat down to 250 degrees F after about an hour to keep the sauce at a simmer.",
        "Remove the roast to a cutting board. Remove the herb bundle and discard. Skim off as much fat as possible from the sauce. Transfer half the sauce and vegetables to a blender or a food processor fitted with the steel blade and puree until smooth. Pour the puree back into the pot, place on the stovetop over low heat, and return the sauce to a simmer. Place 2 tablespoons flour and the butter in a small bowl and mash them together with a fork. Stir into the sauce and simmer for 2 minutes, stirring until thickened. Taste for seasonings. Remove the strings from the roast, and slice the meat. Serve warm with the sauce spooned over it."
    ],
    "ingredients": [
        "1 (4 to 5-pound) prime boneless beef chuck roast, tied",
        "Kosher salt and freshly ground black pepper",
        "All-purpose flour",
        "Good olive oil",
        "2 cups chopped carrots (4 carrots)",
        "2 cups chopped yellow onions (2 onions)",
        "2 cups chopped celery (4 stalks)",
        "2 cups chopped leeks, white and light green parts (2 to 4 leeks)",
        "5 large garlic cloves, peeled and crushed",
        "2 cups good red wine, such as Burgundy",
        "2 tablespoons Cognac or brandy",
        "1 (28-ounce) can whole plum tomatoes in puree",
        "1 cup chicken stock, preferably homemade",
        "1 chicken bouillon cube",
        "3 branches fresh thyme",
        "2 branches fresh rosemary",
        "1 tablespoon unsalted butter, at room temperature"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Celery",
        "Vegetable",
        "Beef",
        "Meat",
        "Carrot Recipes",
        "Sauteing Recipes"
    ],
    "title": "Company Pot Roast",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/company-pot-roast-recipe"
}
