{
    "directions": [
        "To prepare the pesto, heat the olive oil in a sauté pan or skillet and sauté the onion, garlic, and jalapenos over medium heat for 5 minutes. Add the turmeric, stir well, and sauté for another 2 minutes.",
        "Transfer the mixture to a food processor, add the queso blanco, and pulse until smooth. Refrigerate.",
        "To prepare the sofrito, heat the olive oil in a large sauté pan or skillet. Add the onion, bell peppers, and garlic, and sauté over medium heat for about 15 minutes, stirring frequently. Stir in the tomato paste and remove the pan from the heat.",
        "Place the corn kernels in a large mixing bowl and stir in the sofrito mixture. Add the cornmeal and cornstarch and mix well. Place small batches of the corn mixture into a food processor or blender and purée until smooth.",
        "Return the purée to the mixing bowl and add the sugar and salt. With a wooden spoon, fold in the ground conch.",
        "Lay 2 of the reserved corn husks end to end. Place 1/2 cup of the conch filling in a cylinder shape in the middle of the husks. Roll up the husks and tie each end with butcher's twine. Repeat for the remaining tamales.",
        "Bring a large stockpot of salted water to a boil. Add the tamales, lower the heat, and keep at a gentle boil for 1 hour. Drain, and let the tamales cool slightly. Cut the square of cheese into a star (or other) shape and set it on a serving plate. Set the warm tamales, still in their leaves, on the cheese. Place the chilled pesto on the side, garnish with the parsley and olives, and serve."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "3 tablespoons diced onion",
        "1 tablespoon minced garlic",
        "2 jalapeño chiles, seeded, deveined, and sliced",
        "1 tablespoon ground turmeric",
        "8 ounces queso blanco or Muenster cheese, cut into 1-inch chunks",
        "1/4 cup extra virgin olive oil",
        "1/2 onion, cut into 1/2-inch dice",
        "1/2 red bell pepper, seeded and cut into 1/2-inch dice",
        "1/2 green bell pepper, seeded and cut into 1/2-inch dice",
        "4 cloves garlic, minced",
        "3 tablespoons tomato paste",
        "7 to 8 cups fresh corn kernels (from 15 ears), husks reserved",
        "1/2 cup fine yellow cornmeal",
        "1/2 cup cornstarch",
        "2 tablespoons sugar",
        "Salt to taste",
        "1 pound fresh conch, ground",
        "1 large 1/2-inch-thick slice queso blanco or Muenster cheese (optional)",
        "1 pound whole mixed olives (such as kalamata, niçoise, and alphonso)",
        "1 bunch fresh parsley, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Pepper",
        "Shellfish",
        "Tomato",
        "Sauté",
        "Cornmeal",
        "Corn",
        "Spring",
        "Boil"
    ],
    "title": "Conch Tamales with Jalapeño-Cheese Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/conch-tamales-with-jalapeno-cheese-pesto-107565"
}
