{
    "directions": [
        "In the bowl of a food processor, pulse 2 1/2 cups flour, salt, and sugar. Add butter and shortening and pulse until coarse, pea-sized crumbs form, about 10 seconds. With the machine running, add 5 tablespoons ice water and process until the dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers: If it is very crumbly, add more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.",
        "Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine. Divide the dough into two equally sized balls. Flatten dough balls into discs with smooth edges (no cracks), cover with plastic wrap, and refrigerate at least 1 hour or overnight.",
        "Meanwhile, stir together grapes and sugar in a large pot. Cook over medium-high heat, stirring occasionally, until the mixture comes to a boil. Continue to cook until grapes are broken down and juice has thickened, about 20 minutes more.",
        "Place a fine-mesh sieve over a large bowl and strain grape mixture into the bowl, pressing on the solids to release all the liquid. Discard solids in strainer. Return strained grape mixture to pot and add pears (reserve bowl). Cook until liquid releases and thickens but pears still retain their shape, 15 to 20 minutes more, depending on ripeness of pears. Gently stir in the cornstarch, lemon juice, and salt and pour grape-pear filling into the bowl and let cool while you roll out the dough.",
        "On a lightly floured surface, roll out one disc of dough into a 13-inch round. Roll the dough loosely around the rolling pin, and then unfurl it into the 9-inch pie pan. Gently lift and settle the dough into the pan. Trim the excess dough using scissors, leaving a 1-inch overhang. Tuck the edge of the dough under itself, and then crimp as desired. Chill at least 30 minutes.",
        "Roll out the other disc of dough on a lightly floured surface to 1/4-inch thickness. Use the cookie cutter to cut as many shapes as possible from the rolled-out dough as possible (re-rolling scraps if desired). Transfer shapes to a baking sheet and chill at least 30 minutes.",
        "Preheat the oven to 375°F with one rack on the bottom rung and one rack in the center of oven. Place a rimmed baking sheet on the bottom rack to preheat.",
        "Pour filling into chilled pie shell (do not overfill). Brush the edge of the pie and the cut shapes on the baking sheet with the beaten egg and sprinkle with coarse sugar. Arrange the cut shapes on top of the filling, working in a spiral fashion and overlapping slightly, allowing some of the filling to peek through. Chill pie for 30 minutes.",
        "Bake pie on preheated rimmed baking sheet on bottom rack of oven. After 30 minutes, rotate baking sheet and move it to the center rack of oven. Bake until crust is golden brown and juices are bubbling, 25 to 35 minutes more (cover the crust edge with foil or a pie shield if it starts to brown too much). Transfer pie to a wire rack and cool completely before slicing, about 3 hours. Pie will keep up to 2 days, loosely covered with foil, at room temperature."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour, plus more for rolling",
        "1 teaspoon salt",
        "1 1/2 tablespoons granulated sugar",
        "1 stick (8 tablespoons) unsalted butter, cut into small pieces and frozen for 15 minutes",
        "1/2 cup chilled solid vegetable shortening, cut into pieces and refrigerated for 15 minutes",
        "1 large egg, beaten",
        "Coarse sugar, for sprinkling",
        "1 pound concord grapes (about 4 cups grapes)",
        "3/4 cup granulated sugar",
        "3 1/2 pounds medium-ripe Anjou or Bosc pears, peeled, quartered, cored, and cut into 1/4-inch slices (about 7 pears)",
        "1/4 cup cornstarch",
        "2 tablespoons lemon juice",
        "1/4 teaspoon kosher salt",
        "9-inch pie pan, a 1 1/2- to 2-inch cookie cutter, preferably leaf-shaped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Concord Grape and Pear Pie",
    "url": "http://www.epicurious.com/recipes/food/views/concord-grape-and-pear-pie-51257290"
}
