{
    "directions": [
        "To prepare the filling, melt the butter in a large sauté pan or skillet over high heat. Add the onion, celery, and green bell peppers. Cook until the vegetables are tender, about 3 minutes. Stir in the garlic and Creole seasoning, and cook until the garlic is fragrant, about 1 minute. Sprinkle the flour over the vegetables and stir constantly, about 2 minutes, until slightly thickened. Add the diced tomatoes, tomato sauce, chicken broth, and bay leaf. Stir and bring to a simmer. Reduce the heat to medium, cover the pan with a lid, and cook for 5 minutes. Add the shrimp and heat through, about 2 minutes. Remove the bay leaf and pour the filling into an 8-by-8-inch square or round baking dish. Set aside in a warm area, while preparing the topping.",
        "To prepare the topping, preheat the oven to 375°F. Put the butter and sugar in the bowl of a stand mixer fitted with a paddle attachment. Whip on medium speed until light and fluffy, about 2 minutes. Incorporate the eggs one at a time and mix until smooth. Add the green chiles, creamed corn, red and green bell peppers, the flour, cornmeal, baking powder, and salt. Mix on low speed until the mixture forms a soft batter.",
        "Carefully dollop the corn bread batter over the filling. Using an offset metal spatula, spread the batter smoothly across the top of the casserole, forming a thin layer. Place the baking dish on a baking sheet in the center of the oven. Bake until the topping is golden brown and the filling is bubbling around the edges, about 40 minutes. Remove from the oven to a cooling rack. Cut through the corn bread with a small knife. Scoop 6 to 8 generous portions of the filling and the corn bread into large soup bowls or onto plates."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "1 medium onion, chopped",
        "2 stalks celery, thinly sliced",
        "1/2 green bell pepper, chopped",
        "2 cloves garlic, minced",
        "1 tablespoon Creole seasoning",
        "2 tablespoons flour",
        "One 14-ounce can diced tomatoes",
        "1/2 cup tomato sauce",
        "1 cup chicken broth",
        "1 bay leaf",
        "8 ounces bay shrimp",
        "1/2 cup (1 stick) unsalted butter at room temperature",
        "2 teaspoons granulated sugar",
        "2 eggs at room temperature",
        "1/4 cup peeled and diced mild green chiles, fresh or canned (drained)",
        "1/2 cup corn kernels",
        "1/2 cup canned cream-style corn",
        "2 tablespoons finely chopped red bell pepper",
        "2 tablespoons finely chopped green bell pepper",
        "1/2 cup all-purpose flour",
        "1/2 cup yellow cornmeal",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Side",
        "Bake",
        "Dinner",
        "Lunch",
        "Seafood",
        "Shrimp",
        "Fall",
        "Tailgating",
        "Potluck",
        "Chile Pepper",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Confetti Corn Bread\u0096Crusted Shrimp in Creole Filling",
    "url": "http://www.epicurious.com/recipes/food/views/confetti-corn-bread-crusted-shrimp-in-creole-filling-355390"
}
