{
    "directions": [
        "Set a fine-mesh strainer over a small bowl. Press tofu through strainer into bowl. Stir in white soy sauce. Cover and chill. DO AHEAD:Can be made 4 hours ahead. Keep chilled.",
        "Set a medium-mesh strainer over a medium bowl. Halve melons horizontally. Scrape seeds, strings, and juices from center of each melon half into strainer. Press lightly on mixture in strainer to release juices. Discard solids in strainer. Reserve juices.",
        "Using a small melon baller, scoop out 18 balls from 1 melon half. Place melon balls in a small bowl; season lightly with sea salt and vinegar and gently toss. Let stand at room temperature for 30 minutes. Drain; transfer to a small bowl and reserve.",
        "Meanwhile, cut rind from remaining 3 melon halves and cut flesh into 2\" pieces. Melt butter in a large pot over medium-low heat. Add onion and cook, stirring frequently, until onion is translucent but not browned, about 10 minutes. Cut a parchment-paper round just large enough to cover surface of soup in pot. Add melon pieces with reserved juices to pot. Cover pot with parchment-paper round. Simmer, stirring occasionally, until melon is soft but not mushy and an instant-read thermometer inserted into melon reads 150°, about 15 minutes. Let cool slightly.",
        "Working in batches, purée soup in a blender until smooth. Set a fine-mesh strainer over a large bowl. Strain soup. Season to taste with sea salt. Cover and chill, along with serving bowls, until cold, about 4 hours.",
        "Ladle soup into chilled bowls. Spoon 1 heaping teaspoons of the tofu mixture into center. Top with a few toasted almonds and 3 melon balls. Drizzle almond oil over and garnish with fresh herbs."
    ],
    "ingredients": [
        "4 ounces (about 1/2 cup) silken tofu",
        "1/4 cup white soy sauce",
        "2 very ripe 3-pound melons (such as Cavaillon and Charentais)",
        "Sea salt",
        "Sherry vinegar",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1 medium white onion, halved, thinly sliced",
        "1/4 cup lightly toasted Marcona almonds",
        "1/4 cup almond oil, preferably extra-virgin cold-pressed",
        "Fresh herbs, such as chervil sprigs or micro basil",
        "White soy sauce, also known as white shoyu, is lighter in color and flavor than standard soy sauce. It can be purchased at Asian markets and from amazon.com. Marcona almonds are Spanish almonds that are usually sold roasted and salted. Find them at specialty foods stores, natural foods stores, and latienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fruit",
        "Herb",
        "Nut",
        "Onion",
        "Soy",
        "Appetizer",
        "Easter",
        "Fourth of July",
        "Melon",
        "Almond",
        "Tofu",
        "Family Reunion",
        "Shower",
        "Party",
        "Soy Sauce",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cool Melon Soup",
    "url": "http://www.epicurious.com/recipes/food/views/cool-melon-soup-366714"
}
