{
    "directions": [
        "Preheat the oven to 250 degrees F.",
        "Heat the olive oil in a large Dutch oven. Add the bacon and cook over medium heat for 8 to 10 minutes, until lightly browned. Remove the bacon to a plate with a slotted spoon.",
        "Meanwhile, lay the chicken out on paper towels and pat dry. Liberally sprinkle the chicken on both sides with salt and pepper. When the bacon is removed, brown the chicken pieces in batches in a single layer for about 5 minutes, turning to brown evenly. Remove the chicken to the plate with the bacon and continue to brown until all the chicken is done. Set aside.",
        "Add the carrots, onions, 2 teaspoons salt, and 1 teaspoon pepper to the pan and cook over medium heat for 10 to 12 minutes, stirring occasionally, until the onions are lightly browned. Add the garlic and cook for 1 more minute. Add the Cognac and put the bacon, chicken, and any juices that collected on the plate into the pot. Add the wine, chicken stock, and thyme and bring to a simmer. Cover the pot with a tight fitting lid and place in the oven for 30 to 40 minutes, until the chicken is just not pink. Remove from the oven and place on top of the stove.",
        "Mash 1 tablespoon of butter and the flour together and stir into the stew. Add the frozen onions. In a medium saute pan, add the remaining 1 tablespoon of butter and cook the mushrooms over medium-low heat for 5 to 10 minutes, until browned. Add to the stew. Bring the stew to a simmer and cook for another 10 minutes. Season to taste. Serve hot."
    ],
    "ingredients": [
        "2 tablespoons good olive oil",
        "4 ounces good bacon or pancetta, diced",
        "1 (3 to 4-pound) chicken, cut in 8ths",
        "Kosher salt and freshly ground black pepper",
        "1/2 pound carrots, cut diagonally in 1-inch pieces",
        "1 yellow onion, sliced",
        "1 teaspoon chopped garlic",
        "1/4 cup Cognac or good brandy",
        "1/2 bottle (375 ml) good dry red wine such as Burgundy",
        "1 cup good chicken stock, preferably homemade",
        "10 fresh thyme sprigs",
        "2 tablespoons unsalted butter, at room temperature, divided",
        "1 1/2 tablespoons all-purpose flour",
        "1/2 pound frozen small whole onions",
        "1/2 pound cremini mushrooms, stems removed and thickly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken Stew",
        "Chicken",
        "Poultry Recipes",
        "Stew Recipes",
        "European Recipes",
        "Carrot Recipes",
        "Vegetable",
        "Bacon Recipes",
        "Meat",
        "Mushroom",
        "Main Dish Recipes"
    ],
    "title": "Coq Au Vin",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/coq-au-vin-recipe4"
}
