{
    "directions": [
        "Preheat oven to 400°F. Set racks in the upper and lower thirds of the oven. In a large bowl, pat the chicken dry with paper towels. Add 1 tablespoon oil and toss to coat. Season chicken all over with 1 teaspoon salt, 1/2 teaspoon pepper, and coriander. Rub in seasoning and set aside at room temperature.",
        "In a large bowl, whisk together 2 tablespoons oil, miso paste, vinegar, soy sauce, honey, and 1/2 teaspoon each salt and pepper. Add vegetables and garlic cloves to the bowl and toss to coat. Transfer to a rimmed baking sheet, place on the upper rack of the oven, and roast until softened and browned, 40 to 45 minutes, tossing a few times during roasting. Peel garlic and discard skins.",
        "Meanwhile, heat a large skillet over medium-high heat with 1 tablespoon oil. Once hot, add half the chicken thighs skin side down. Cook until skin is golden brown, 6 to 8 minutes. Remove from skillet and place skin side up on a second rimmed baking sheet. Repeat with remaining chicken thighs, reserving skillet with fat after cooking. Transfer baking sheet to lower rack of oven and roast until the chicken's internal temperature reaches 165°F, 12 to 15 minutes more.",
        "Discard stems from reserved beet and turnip greens; wash and roughly chop the leaves. Pour out all but 2 teaspoons of oil from the skillet and place the pan over medium-high heat. Add the greens to the pan with 2 tablespoons water and 1/4 teaspoon salt and cook, tossing, until wilted, 1 to 2 minutes. Transfer roasted vegetables to a serving bowl, add the sautéed greens, and toss to combine. Taste and adjust seasoning. Serve chicken thighs with vegetables and lime wedges."
    ],
    "ingredients": [
        "8 skin-on, bone-in chicken thighs (about 2 1/2 pounds)",
        "4 tablespoons vegetable oil (such as grapeseed), divided",
        "1 3/4 teaspoons kosher salt, divided",
        "1 teaspoon freshly ground black pepper, divided",
        "1 tablespoon ground coriander",
        "3 tablespoons white or yellow miso paste",
        "2 tablespoons rice wine vinegar",
        "1 tablespoon soy sauce",
        "2 teaspoons honey",
        "1 pound total carrots, parsnips, and/or celery root, peeled and cut into 3/4-inch pieces",
        "3/4 pound small-to-medium golden or red beets with fresh greens, peeled and cut into 1/2-inch wedges, greens reserved",
        "3/4 pound small-to-medium turnips with fresh greens, peeled and cut into 1/2-inch wedges, greens reserved",
        "1 medium red onion, peeled, root trimmed, cut lengthwise into 1/2-inch wedges",
        "6 garlic cloves, unpeeled",
        "1 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Carrot",
        "Parsnip",
        "Turnip",
        "Honey",
        "Soy Sauce",
        "Quick and Healthy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Coriander Chicken Thighs with Miso-Glazed Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/coriander-chicken-thighs-with-miso-glazed-root-vegetables-51248820"
}
