{
    "directions": [
        "In blender, purée oil and chervil until chervil pieces are very small, 2 to 3 minutes. Strain through fine-mesh sieve into small bowl, pressing on solids to extract all oil. Set aside.",
        "In medium saucepan over moderate heat, warm oil. Add onion, carrot, celery, and garlic and sauté, stirring frequently, until vegetables begin to soften, about 7 minutes (adjust heat as necessary to keep vegetables from browning). Add stock and corn cobs, raise heat to moderately high, and bring to simmer. Lower heat to moderate and simmer, uncovered, 45 minutes, adding stock if most of the liquid evaporates. Remove from heat. Using slotted spoon, remove vegetables and corn cobs and discard. Add corn kernels to stock, raise heat to moderately high, and bring to simmer. Lower heat to moderate and simmer, uncovered, 15 minutes.",
        "In medium heavy skillet over moderate heat, heat oil until hot but not smoking. Add potatoes and sauté, scraping up browned bits every few minutes, until tender and golden brown, about 15 minutes. Remove from heat, stir in salt, pepper, and chives, and keep warm.",
        "Remove from heat and let cool slightly, then purée mixture in blender until very smooth, about 2 minutes. Strain through mesh sieve into large bowl, pressing on solids to extract all liquid. If sauce is too thick to pour, stir in a small amount of additional stock. Stir in salt and pepper and keep warm.",
        "In small bowl, stir together coriander, salt, and chile powder. Rinse scallops and pat dry, then sprinkle both sides with coriander mix. In medium heavy skillet heat oil until hot but not smoking. Add scallops and sear until lightly browned and cooked to desired doneness, 2 to 3 minutes per side for medium rare.",
        "To serve, divide corn sauce among four plates. Top each pool of sauce with 1 tablespoon potato hash and 2 scallops. Drizzle with 1 teaspoon chervil oil and garnish with chervil sprigs."
    ],
    "ingredients": [
        "1/2 cup canola oil",
        "1/2 packed cup fresh chervil* leaves",
        "1 tablespoon canola oil",
        "1 small white onion, chopped (about 1 1/2 cups)",
        "1 carrot, chopped (about 3/4 cup)",
        "1 celery stalk, chopped (about 1/2 cup)",
        "2 garlic cloves, halved",
        "6 cups chicken or vegetable stock or low-sodium broth, plus additional for thinning sauce",
        "Kosher salt to taste",
        "1/8 teaspoon freshly ground black pepper",
        "3 cups fresh corn kernels (from 2 to 3 ears), cobs reserved",
        "2 tablespoons canola oil",
        "1 small russet potato, peeled and cut into 1/4-inch dice (about 1 cup)",
        "1/2 small sweet potato, peeled and cut into 1/4-inch dice (about 3/4 cup)",
        "1/8 teaspoon kosher salt",
        "Scant 1/8 teaspoon freshly ground black pepper",
        "1 tablespoon fresh chives, chopped",
        "2 tablespoons ground coriander",
        "1 teaspoon kosher salt",
        "1/4 teaspoon chile powder",
        "8 large sea scallops",
        "1 tablespoon canola oil",
        "4 fresh chervil sprigs, for garnish",
        "*If chervil is unavailable, fresh flat-leaf parsley leaves may be substituted. Extra chervil (or parsley) oil will keep, covered, at room temperature 3 days. Try it in salad dressings or drizzled over fish, chicken breasts, or steamed vegetables."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Garlic",
        "Herb",
        "Onion",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Healthy"
    ],
    "title": "Coriander-Crusted Scallops with Chive Potato Hash and Sweet Corn Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coriander-crusted-scallops-with-chive-potato-hash-and-sweet-corn-sauce-238303"
}
