{
    "directions": [
        "Whisk 1 3/4 cups flour and salt in medium bowl to blend. Combine 3/4 cup lukewarm water and sugar in bowl of heavy-duty mixer fitted with paddle attachment. Sprinkle yeast over. Let stand until mixture is foamy, about 15 minutes.",
        "Add 1 tablespoon olive oil to yeast mixture; beat until blended. Add flour mixture and beat until soft, very sticky dough forms.",
        "Using rubber spatula, scrape dough out onto generously floured work surface and knead until dough is smooth, adding more flour by tablespoonfuls as needed for soft but still slightly sticky dough, about 5 minutes. Gather dough together and place in oiled bowl; brush dough lightly with olive oil. Cover bowl with plastic wrap, then kitchen towel and let dough rise in warm draft-free area until doubled in volume, about 1 hour.",
        "Combine cumin seeds and coriander seeds in small dry skillet. Stir over medium heat until aromatic and lightly toasted, about 2 minutes. Transfer to mortar or spice mill and crush seeds coarsely.",
        "Line 2 baking sheets with parchment paper. Turn dough out onto floured surface. Divide dough into 10 equal pieces. Roll each piece into ball. Cover with plastic wrap and let rest on floured work surface 15 minutes. Using fingers, dimple each ball, then press and stretch each into 3 1/2- to 4-inch round. Place dough rounds on prepared baking sheets, spacing apart. Brush each round lightly with olive oil. Sprinkle cumin-coriander mixture and parsley over each; press lightly to adhere. Cover with plastic wrap and let rise 30 minutes.",
        "Prepare barbecue (medium heat) or heat heavy large skillet (preferably cast-iron) over medium heat. Using metal spatula, transfer flatbreads, plain side down, to grill or skillet (work in batches if using skillet) and cook until lightly browned in spots and cooked through, about 4 minutes per side. Transfer to platter.",
        "Do ahead: Can be made 1 day ahead. Cool completely. Enclose in foil and store at room temperature. Rewarm in foil packet in 350°F oven until heated through, about 8 minutes.",
        "Serve warm."
    ],
    "ingredients": [
        "1 3/4 cups (or more) all purpose flour",
        "1 1/2 teaspoons coarse kosher salt",
        "3/4 cup lukewarm water (95°F to 100°F)",
        "1 1/2 teaspoons sugar",
        "1 1/2 teaspoons active dry yeast",
        "3 tablespoons (about) extra-virgin olive oil, divided",
        "1 teaspoon cumin seeds",
        "1 teaspoon coriander seeds",
        "1 tablespoon chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Side",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Coriander and Cumin Flatbread",
    "url": "http://www.epicurious.com/recipes/food/views/coriander-and-cumin-flatbread-235805"
}
