{
    "directions": [
        "Combine carrots, 3 cups water and 3/4 teaspoon salt in medium saucepan. Bring to boil. Reduce heat to low. Cover and cook until carrots are very tender, about 30 minutes. Drain; reserve cooking liquid. Transfer carrots to processor. Puree until smooth. Add cream and ginger and process to blend. Transfer puree to heavy small saucepan. Add enough reserved cooking liquid to puree to form consistency of thick sauce. Season sauce to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm before serving.)",
        "Coarsely grind coriander seeds in spice grinder or blender. Sprinkle pork with salt and pepper. Press coriander onto pork, coating completely. Heat 1 tablespoon oil in each of 2 heavy large nonstick skillets over medium-high heat. Add 1 pork tenderloin to 1 skillet and 2 pork tenderloins to second skillet. Brown pork on all sides and cook until thermometer inserted into center registers 155°F, about 25 minutes.",
        "Transfer pork to cutting board. Let rest 5 minutes. Cut pork into 1-inch-thick slices. Spoon sauce onto plates. Top with pork and serve."
    ],
    "ingredients": [
        "1 pound carrots, peeled, cut into 1-inch pieces",
        "1/3 cup whipping cream",
        "1 tablespoon finely grated peeled fresh ginger",
        "1/4 cup whole coriander seeds",
        "3 pork tenderloins (about 3 pounds total), trimmed",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pork",
        "Vegetable",
        "Dinner",
        "Meat",
        "Spice",
        "Root Vegetable",
        "Carrot",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Coriander Pork Tenderloin with Carrot-Ginger Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/coriander-pork-tenderloin-with-carrot-ginger-sauce-103001"
}
