{
    "directions": [
        "Place beans and next 5 ingredients in processor; blend to chunky puree.",
        "Heat oil in heavy large saucepan over medium heat. Add bean mixture and 1/2 cup reserved bean liquid. Stir over medium- low heat until warmed through, adding more bean liquid if dry, about 5 minutes. Season with coarse salt and freshly ground black pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Rewarm before using.",
        "Brush fennel slices with 1 1/2 tablespoons oil; sprinkle with salt and pepper. Heat heavy large skillet over medium-high heat. Add fennel slices. Sear until lightly browned and crisp-tender, 2 to 3 minutes per side. Transfer to plate. Cut into strips. Reserve skillet.",
        "Using rolling pin, flatten chicken between sheets of plastic wrap to 1/4- to 1/3-inch-thick cutlets. Spread out coriander seeds on sheet of foil. Sprinkle chicken with salt and pepper; coat with coriander seeds.",
        "Heat 4 1/2 tablespoons oil in reserved skillet over medium-high heat. Working in batches, if necessary, add chicken to skillet. Sauté until cooked through, about 3 minutes per side. Transfer to work surface. Cool 5 minutes. Cut chicken in half lengthwise, then crosswise into 1/3-inch-wide strips.",
        "Top each tostada shell with beans, lettuce, radishes, fennel, chicken and cilantro sprig. Serve with lime wedges."
    ],
    "ingredients": [
        "2 15-ounce cans pinto beans (preferably organic), liquid drained and reserved",
        "1/2 cup chopped white onion",
        "2 tablespoons dried oregano",
        "2 garlic cloves, peeled",
        "2 teaspoons minced canned chipotle chiles in adobo",
        "1 teaspoon ground cumin",
        "1 tablespoon extra-virgin olive oil",
        "Coarse kosher salt",
        "1 large fresh fennel bulb, trimmed, cut through core into 1/3-inch-thick slices (some slices will separate)",
        "6 tablespoons safflower oil, divided",
        "4 skinless boneless chicken breast halves",
        "1/3 cup coriander seeds (about 1 ounce), coarsely crushed in plastic bag",
        "6 purchased corn tostada shells",
        "3 cups thinly sliced romaine lettuce",
        "6 radishes, trimmed, thinly sliced",
        "6 fresh cilantro sprigs",
        "Lime wedges",
        "Ingredient info: Chipotle chiles are often sold in a spicy tomato sauce called adobo. They're available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Sauté",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Fennel",
        "Healthy",
        "Coriander",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Coriander Chicken Tostadas with Refried Beans and Grilled Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/coriander-chicken-tostadas-with-refried-beans-and-grilled-fennel-362970"
}
