{
    "directions": [
        "Preheat oven to 425°F. Combine flour, cornmeal, sugar, baking powder, baking soda, salt, and pepper in a large bowl. Using your hands, work butter into flour until pieces are chickpea-size. Add buttermilk and mix just to blend.",
        "Drop dough by heaping 1/4-cupfuls into an 8\" cast-iron skillet, spacing about 1\" apart. Bake, rotating skillet once, until biscuits are puffed, golden brown, and cooked through, 12–15 minutes.",
        "While biscuits are baking, heat oil in a medium skillet over medium. Add chorizo, breaking up any large pieces with a spatula. Cook, stirring occasionally, until chorizo is browned and crisp, 8–10 minutes. Transfer to a small bowl with a slotted spoon.",
        "Whisk flour into drippings in skillet and cook, whisking constantly, until roux is very smooth and starting to turn a light golden brown, about 5 minutes. Gradually add milk, whisking constantly until incorporated. Reduce heat to medium-low and cook gravy, whisking constantly, until thickened, 5–8 minutes. Stir half of chorizo into gravy; season with salt, pepper, and hot sauce.",
        "Spoon some gravy over hot biscuits and top with avocado, scallions, radishes, cilantro, Cotija (if using), remaining chorizo, and more hot sauce. Serve remaining gravy alongside."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "3/4 cup cornmeal",
        "1 tablespoon sugar",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "1/4 teaspoon black pepper, freshly ground",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "3/4 cup buttermilk",
        "1 tablespoon vegetable oil",
        "1 pound fresh chorizo, casings removed",
        "3 tablespoons all-purpose flour",
        "2 1/2 cups whole milk",
        "Kosher salt, freshly ground pepper",
        "Hot sauce",
        "1 avocado, sliced",
        "4 scallions, thinly sliced",
        "2 radishes, thinly sliced",
        "1/2 cup cilantro leaves with tender stems",
        "1/2 cup Cotija cheese or queso fresco (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Biscuit",
        "Cornmeal",
        "Lunch",
        "Kid-Friendly",
        "Buttermilk",
        "Avocado",
        "Dinner",
        "Quick & Easy",
        "Sausage",
        "Green Onion/Scallion",
        "Cheese",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cornmeal Biscuits with Chorizo Gravy and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-biscuits-with-chorizo-gravy-and-scallions"
}
