{
    "directions": [
        "Cook bacon in heavy large skillet over medium heat until crisp. Using slotted spoon, transfer to paper towels and drain. Pour off all but 2 tablespoons drippings from skillet. Add 1 tablespoon oil to drippings in skillet. Add corn and onion; sauté over medium heat until onion is golden, about 5 minutes. Remove from heat.",
        "Combine buttermilk, egg and 1/4 cup goat cheese in large bowl; whisk to blend. Add cornmeal, baking powder, salt, baking soda and cayenne and mix well. Stir in corn mixture. Heat 1 tablespoon oil in heavy large skillet over medium heat. Working in batches, drop batter by generous tablespoonfuls into skillet. Cook until bottom of each corn cake is brown, about 1 minute. Turn corn cakes and cook until second side is brown, about 1 minute. Transfer to baking sheet. Repeat with remaining batter, adding more oil to skillet as needed. (Can be prepared 2 hours ahead. Let corn cakes and bacon stand at room temperature. Before serving, rewarm cakes on baking sheet in 400°F oven until heated through, about 5 minutes.)",
        "Arrange corn cakes on platter. Top each with generous 1/2 teaspoon goat cheese. Sprinkle with bacon and green onions and serve."
    ],
    "ingredients": [
        "5 thick bacon slices, cut into 1/2-inch pieces",
        "4 tablespoons (about) vegetable oil",
        "1 10-ounce package frozen corn kernels, thawed",
        "1 cup chopped onion",
        "3/4 cup buttermilk",
        "1 large egg",
        "5 ounces soft fresh goat cheese (such as Montrachet), crumbled",
        "1 cup yellow cornmeal",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon cayenne pepper",
        "Chopped green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Side",
        "Fry",
        "Goat Cheese",
        "Bacon",
        "Corn",
        "Summer",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn Cakes Topped with Goat Cheese and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/corn-cakes-topped-with-goat-cheese-and-bacon-104299"
}
