{
    "directions": [
        "Break corn cobs in half and place in large pot. Add chicken broth, 1 cup water, cilantro stems, and 1/2 teaspoon salt to pot. Bring to boil. Reduce heat and simmer 25 minutes. Strain liquid into 4-cup measuring cup; discard solids in strainer. Add enough additional water to corn broth to measure 4 cups.",
        "Melt butter in heavy large saucepan over medium-low heat. Add onion; saut until tender and translucent, about 8 minutes. Add garlic, jalapeño, ancho chile powder, and lime peel; stir 1 minute. Remove from heat.",
        "Reserve 1/3 cup crabmeat for garnish. Combine 2 cups corn kernels and 1 cup corn broth in blender; puree until almost smooth. Add to saucepan with onion mixture. Add remaining 3 cups corn broth and 1 1/2 cups corn kernels; bring to simmer. Add remaining crabmeat, 1 teaspoon lime juice, and 1/3 cup chopped cilantro leaves. Season to taste with salt, pepper, and more lime juice, if desired.",
        "Ladle soup into bowls. Top each serving with some of reserved crabmeat. Sprinkle each with remaining chopped cilantro leaves and Crispy Tortilla Strips and serve."
    ],
    "ingredients": [
        "3 1/2 cups fresh corn kernels (cut from about 6 medium ears of corn), divided, corn cobs reserved",
        "4 cups low-salt chicken broth",
        "1 cup (or more) water",
        "1 small bunch fresh cilantro, stems cut off and reserved, leaves chopped",
        "1/2 teaspoon salt",
        "2 tablespoons (1/4 stick) unsalted butter or olive oil",
        "1 1/2 cups chopped onion",
        "2 garlic cloves, minced",
        "1 1/2 teaspoons minced seeded jalapeño chile",
        "1/4 teaspoon ancho chile powder or regular chili powder",
        "1 teaspoon finely grated lime peel",
        "12 ounces lump crabmeat, picked over",
        "1 teaspoon (or more) fresh lime juice",
        "Crispy Tortilla Strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Fish",
        "Herb",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Dinner",
        "Seafood",
        "Crab",
        "Corn",
        "Summer",
        "Tortillas",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn and Crab Soup with Crispy Tortilla Strips",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-crab-soup-with-crispy-tortilla-strips-235580"
}
