{
    "directions": [
        "Cook first 4 ingredients in heavy large skillet over high heat until charred in spots but still firm, turning occasionally, about 5 minutes. Transfer to processor; using on/off turns, chop coarsely. Add all remaining ingredients. Blend to coarse puree. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill.)",
        "Selecting the largest and cleanest husks, place half of husks in large bowl; fill bowl with warm water. Weigh husks down with plate; soak husks until soft, separating occasionally, about 2 hours. Form 36 ties by tearing several husks into 1/2-inch-wide strips.",
        "Char chilies directly over gas flame or under broiler until blackened on all sides. Place in medium bowl; cover tightly with plastic. Let stand 10 minutes. Peel, seed, and chop chilies.",
        "To make dough, blend Masa Harina, butter, sugar, and 1 teaspoon salt in processor until coarse meal forms. Add broth and blend in (mixture will be crumbly). Transfer masa mixture to large bowl. Blend 2 1/2 cups corn, 1 cup cheese, baking powder, pepper, and 1 1/4 teaspoons salt in processor until coarse puree forms. Stir puree, then 2 1/2 cups corn into masa.",
        "For each tamale, open 1 large softened husk. Place 1/3 cup tamale dough in center of husk. Make depression in center of dough; fill with 1 tablespoon chilies, then 1 tablespoon cheese. Using moistened fingertips, press dough over filling to cover; shape filled dough into 3-inch-long log parallel to 1 long edge of husk. Fold 1 long side of husk over filling and roll up to enclose. Tie ends of filled husks tightly with husk strips.",
        "Add enough water to large pot containing steamer insert to reach bottom of insert. Layer tamales in steamer insert. Bring water to boil; cover pot. Steam until tamales are firm, removing insert and adding boiling water to pot to maintain water level as needed, about 1 hour. (Can be made 1 day ahead. Cool slightly. Refrigerate. Before serving, re-steam 45 minutes to heat through.) Serve tamales in husks with salsa."
    ],
    "ingredients": [
        "12 tomatillo, husked, rinsed well",
        "1 small onion, quartered",
        "6 large garlic cloves, peeled",
        "2 to 3 serrano chilies, stemmed",
        "2 ripe avocados, peeled, diced",
        "1/2 cup chopped fresh cilantro",
        "2 tablespoons fresh lime juice",
        "1 6-ounce package dried corn husks",
        "1 pound large poblano chilies",
        "2 cups Masa Harina (corn tortilla mix)",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "3 tablespoons sugar",
        "2 1/4 teaspoons salt",
        "1/2 cup canned low-salt chicken broth",
        "5 cups frozen baby white corn kernels (about 25 ounces), thawed",
        "3 cups (packed) coarsely grated sharp cheddar cheese",
        "1 teaspoon baking powder",
        "1/8 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pepper",
        "Steam",
        "Cheddar",
        "Avocado",
        "Corn",
        "Tomatillo",
        "Cilantro"
    ],
    "title": "Corn, Cheese, and Chili Tamales with Tomatillo-Avocado Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/corn-cheese-and-chili-tamales-with-tomatillo-avocado-salsa-105538"
}
