{
    "directions": [
        "Rinse the corned beef and put it in a large Dutch oven or a heavy pot. Add enough cold water to cover by 1 inch (2.5 cm). Bring to a boil over medium-high heat, skimming off any foam that rises to the surface. Add the cloves, mustard seed, peppercorns, coriander seed and bay leaves. Reduce the heat to medium-low, cover and simmer gently until almost tender, 2 1/2 to 3 hours.",
        "Add the potato to the pot and return the liquid to a simmer. Cook until the brisket and potato are fully tender, about 30 minutes longer. Transfer the corned beef and potato to a carving board and let cool completely. (The corned beef and potato can be prepared, covered and refrigerated up to 1 day ahead.)",
        "Slice the corned beef across the grain, trimming any excess fat. Coarsely chop enough corned beef to measure 2 1/2 cups (15 oz./470 g). Save the remaining corned beef for another use. Peel the cooked potato and shred it on the large holes of a box grater. In a food processor fitted with the chopping blade, pulse the corned beef and potatoes until the beef is finely chopped.",
        "Meanwhile, in a large fry pan, preferably cast iron, over medium-low heat, warm 1 Tbs. of the olive oil. Add the onion and cook, stirring frequently, until caramelized and golden brown, 15 to 20 minutes. Transfer the onion to a bowl.",
        "In the same fry pan over medium heat, warm the remaining 1 Tbs. olive oil. Add the chile and cover. Cook, uncovering to stir occasionally, until tender, about 6 minutes. Add the chile and onion to the beef mixture and mix. Season with salt and pepper.",
        "In the same fry pan, melt the butter over medium heat. Divide the corned beef mixture into 6 portions, and shape each portion into a thick patty. Place the patties in the pan and press them gently with a metal spatula. Cook until the undersides are crisp and browned, about 5 minutes. Using the spatula, flip the patties over, press gently with the spatula, and cook until the other sides are browned, about 5 minutes more.",
        "Place each patty on a plate or in a shallow bowl and top each serving with 2 poached or fried eggs. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Breakfast Comforts",
        ", by Rick Rodgers (Weldon Owen, 2010)"
    ],
    "ingredients": [
        "1 corned beef brisket, about 2 1/3 lb. (1 kg)",
        "1 tsp. whole cloves",
        "1 tsp. yellow mustard seed",
        "1 tsp. black peppercorns",
        "1 tsp. coriander seed",
        "2 bay leaves",
        "1 large russet potato, about 12 oz. (375 g), scrubbed but unpeeled",
        "2 Tbs. olive oil",
        "1 small yellow onion, chopped",
        "1 poblano chile, seeded and chopped",
        "Kosher salt and freshly ground pepper",
        "2 Tbs. unsalted butter",
        "12 poached or fried eggs"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Corned Beef Hash with Caramelized Onions and Chiles",
    "url": "http://www.williams-sonoma.com/recipe/corned-beef-hash-with-caramelized-onions-and-chiles.html"
}
