{
    "directions": [
        "Preheat oven to 325°F. Butter a 15 1/2- by 11- by 1-inch jelly-roll pan and line bottom and sides with parchment paper. Evenly butter parchment paper.",
        "Chop enough scallions to measure 3/4 cup. Chop basil. In a large bowl whisk together eggs, heavy cream, and salt until combined well. Pour custard into jelly-roll pan and bake in middle of oven 8 minutes. Rotate jelly-roll pan and continue to bake custard until set, 8 to 10 minutes more.",
        "While custard is baking, in a heavy skillet heat butter over moderately low heat and cook scallions, stirring occasionally, until softened, 2 to 3 minutes. Cut cream cheese into small pieces and add to scallions with corn and salt and pepper to taste. Cook mixture, stirring, until corn is heated through and cream cheese is melted, 2 to 3 minutes.",
        "Spread corn mixture evenly on top of hot egg sheet, leaving a 1-inch border on all sides. Sprinkle basil over corn mixture. With a long side facing you and using parchment as an aid, roll up egg sheet jelly-roll fashion and carefully transfer to a platter.",
        "Carefully cut roulade into 16 slices (each about 3/4 inch thick) and serve warm or at room temperature with yellow tomato coulis and Black Forest ham slices."
    ],
    "ingredients": [
        "parchment paper",
        "1 bunch scallions",
        "1 cup packed fresh basil leaves",
        "6 large eggs",
        "2 cups heavy cream",
        "1/2 teaspoon salt",
        "2 tablespoons unsalted butter",
        "1/4 cup (2 ounces) cream cheese",
        "Yellow Tomato Coulis",
        "sliced Black Forest ham"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Basil",
        "Ham",
        "Corn",
        "Summer",
        "Gourmet"
    ],
    "title": "Corn and Basil Egg Roulade with Yellow Tomato Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-basil-egg-roulade-with-yellow-tomato-coulis-15185"
}
