{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 425°F. Cook onions in small saucepan of boiling water 2 minutes; drain. Cool slightly; trim and peel. Place onions, carrots, parsnips, and rutabagas in single layer on large rimmed baking sheet. Drizzle 1/3 cup oil over and sprinkle generously with salt and pepper; toss to coat. Place mushrooms and garlic on another rimmed baking sheet; drizzle with remaining 1/3 cup oil, sprinkle with salt and pepper, and toss to coat. Roast root vegetables until tender and brown around edges, stirring every 15 minutes, about 1 hour. Roast mushrooms and garlic until tender, stirring once, about 30 minutes. Place root vegetables and mushrooms in large bowl. Place garlic in small bowl; mash with fork until pureed. Add pureed garlic, thyme, rosemary, and sage to vegetables; toss to coat. Season to taste with salt and pepper. DO AHEAD: Vegetable mixture can be made 1 day ahead. Cool vegetables, cover, and chill. Bring mixture to room temperature before continuing.",
        "Place cornbread cubes on large rimmed baking sheet. Let bread cubes stand at room temperature to dry slightly, about 1 hour.",
        "Preheat oven to 375°F. Butter 13x9x2- inch oval baking dish. Add cornbread cubes to vegetables; toss to distribute evenly. Add eggs; toss to coat. Drizzle with melted butter; toss to coat. Add broth and stir to combine (mixture will be very moist). Transfer mixture to prepared dish.",
        "Bake dressing uncovered until lightly browned and crisp around edges, about 45 minutes."
    ],
    "ingredients": [
        "1 10-ounce bag pearl onions",
        "2 1/2 cups 1/2-inch-thick diagonal slices peeled carrots (about 3/4 pound)",
        "2 1/2 cups 1/2-inch-thick diagonal slices peeled parsnips (about 3/4 pound)",
        "2 cups 1/2-inch cubes peeled rutabagas (about 3/4 pound)",
        "2/3 cup olive oil, divided",
        "1 pound crimini (baby bella) mushrooms, stemmed, caps halved",
        "6 large garlic cloves, peeled",
        "2 teaspoons dried thyme",
        "2 teaspoons dried crushed rosemary",
        "1 1/2 teaspoons dried rubbed sage",
        "6 cups 1/2-inch cubes Cornbread for Dressing",
        "3 large eggs, beaten to blend",
        "3 tablespoons unsalted butter, melted",
        "1 1/2 cups low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Stuffing/Dressing",
        "Cornmeal",
        "Root Vegetable",
        "Carrot",
        "Parsnip",
        "Fall",
        "Rutabaga",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cornbread Dressing with Roasted Fall Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/cornbread-dressing-with-roasted-fall-vegetables-240386"
}
