{
    "directions": [
        "Preheat oven to 325°F. Stir 2 cups shelled pumpkin seeds in heavy medium skillet over medium heat until seeds are golden and beginning to pop, about 8 minutes. Set aside. Butter 15x10x2-inch glass baking dish. Melt 3/4 cup butter in heavy large skillet over medium heat. Add chopped onions, chopped celery, dried thyme, dried marjoram and crumbled dried sage. Sauté until vegetables are almost tender, about 12 minutes. Remove onion mixture from heat; cool.",
        "Combine corn bread pieces, white bread pieces, quartered apricots and pumpkin seeds in very large bowl. Add onion mixture, 1/2 cup chopped parsley and pepper and stir to blend well. (Can be prepared 1 day ahead. Cover and refrigerate. Bring bread-onion mixture to room temperature before continuing.)",
        "Whisk eggs, broth and 2 teaspoons salt in medium bowl to blend. Stir into bread-onion mixture. Spoon dressing into prepared baking dish. Cover tightly with foil. Bake dressing 40 minutes. Uncover and bake until dressing is cooked through and top is golden brown, about 50 minutes longer.",
        "*Pumpkin seeds are also known as pepitas. They are available at Latin American markets, natural foods stores and many supermarkets nationwide."
    ],
    "ingredients": [
        "2 cups shelled pumpkin seeds* (about 10 ounces)",
        "3/4 cup (1 1/2 sticks) unsalted butter",
        "4 cups finely chopped onions",
        "2 cups finely chopped celery",
        "1 teaspoon dried thyme",
        "1 teaspoon dried marjoram",
        "1 teaspoon crumbled dried sage leaves",
        "Green Onion Corn Bread , cooled, cut into 3/4-inch pieces (about 12 cups)",
        "1 15-ounce loaf white country-style bread, crusts trimmed, cut into 3/4-inch pieces (about 6 cups)",
        "1 pound dried apricots, quartered",
        "1/2 cup chopped fresh parsley",
        "1 1/2 teaspoons ground black pepper",
        "5 large eggs",
        "4 3/4 cups canned low-salt chicken broth",
        "2 teaspoons salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Apricot",
        "Pumpkin",
        "Fall",
        "Seed",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Corn Bread, Apricot and Toasted Pumpkin-Seed Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/corn-bread-apricot-and-toasted-pumpkin-seed-dressing-104311"
}
