{
    "directions": [
        "Heat oil in heavy large saucepan over medium-high heat. Add shallots, tomatoes and garlic; Sauté 8 minutes. Add wine, thyme and bay leaf. Boil until liquid is reduced by half, about 5 minutes. Add beef broth, 2 cups chicken broth and caraway seeds. Bring to boil. Reduce heat; simmer 45 minutes, stirring often. Strain sauce into heavy medium saucepan, pressing on solids. Boil until reduced to 2 cups, about 15 minutes. Dissolve cornstarch in 1 tablespoon broth; add to sauce. Boil until slightly thickened, stirring often, about 5 minutes. Season with salt and pepper.",
        "Tie caraway in cheesecloth square. Melt butter in heavy large skillet over medium-high heat. Add cabbage and onion. Sauté until cabbage begins to wilt, about 3 minutes. Add broth and caraway bundle. Simmer until liquid evaporates, stirring often, about 5 minutes. Discard caraway bundle. Stir in prosciutto. Season with salt and pepper.",
        "Preheat oven to 450°F. Season hens with salt and pepper. Place on baking sheet. Drizzle with oil. Roast 10 minutes. Reduce oven temperature to 375°F.; continue roasting until cooked through, about 30 minutes.",
        "Bring sauce to simmer. Rewarm cabbage over low heat, stirring often. Divide couscous among plates. Top with cabbage, then game hens. Spoon sauce over."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "6 shallots, sliced",
        "2 plum tomatoes, seeded, chopped",
        "2 garlic cloves, sliced",
        "1/2 cup dry white wine",
        "2 large fresh thyme sprigs",
        "1 small bay leaf",
        "2 cups canned unsalted beef broth",
        "2 cups plus 1 tablespoon canned low-salt chicken broth",
        "2 teaspoons caraway seeds",
        "1 teaspoon cornstarch",
        "2 teaspoons caraway seeds",
        "1 tablespoon butter",
        "1/4 head savoy cabbage, cored, sliced",
        "1/2 onion, thinly sliced",
        "1/2 cup canned low-salt chicken broth",
        "2 ounces thinly sliced prosciutto, cut into thin strips",
        "2 1 1/4- to 1 1/2-pound Cornish game hens, quartered",
        "1 tablespoon olive oil",
        "1 cup couscous, cooked according to package directions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Poultry",
        "Vegetable",
        "Roast",
        "Dinner",
        "Cabbage",
        "Seed",
        "Caraway",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cornish Hens with Caraway Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/cornish-hens-with-caraway-cabbage-273"
}
