{
    "directions": [
        "If using thawed frozen lobster tails, cook in pot of boiling water until almost cooked through, about 6 minutes. Drain. Cool. Using kitchen shears, cut lobster shells open. Remove lobster meat; cut into bite-size pieces. Discard shells.",
        "Purée 4 cups corn with 1 1/4 cups broth in processor until almost smooth.",
        "Sauté bacon in large pot over medium heat until crisp, about 5 minutes. Transfer bacon to paper towels. Pour off and discard all but 3 tablespoons drippings from pot. Add onions to pot; sauté until light golden, about 5 minutes. Add remaining 4 cups corn; sauté 3 minutes. Add carrots, celery, and cayenne; sauté until vegetables soften slightly, about 5 minutes. Add clam juice and 1 3/4 cups broth; simmer 10 minutes. Stir in corn puré and whipping cream; simmer 5 minutes. Season with salt and pepper. (Lobster, bacon, and soup can be prepared 1 day ahead. Cover and chill lobster and bacon separately. Cool soup slightly; chill uncovered until cold, then cover and keep chilled. Bring bacon to room temperature and bring soup to simmer before continuing.) Remove soup from heat; stir in sour cream.",
        "Melt butter in medium nonstick skillet over medium heat. Add lobster meat and sauté just until heated through, about 2 minutes. Ladle soup into bowls. Garnish each serving with lobster pieces, bacon, and chives and serve."
    ],
    "ingredients": [
        "2 10-ounce frozen uncooked lobster tails, thawed, or 1 pound freshly cooked lobster meat, cut into bite-size pieces",
        "8 cups frozen yellow corn kernels (about 2 1/4 pounds), thawed",
        "3 cups low-salt chicken broth",
        "8 bacon slices, chopped",
        "2 cups chopped onions",
        "3/4 cup peeled finely diced carrots",
        "2/3 cup finely diced celery",
        "1/4 teaspoon cayenne pepper",
        "3 cups bottled clam juice",
        "1 1/2 cups whipping cream",
        "6 tablespoons sour cream",
        "2 tablespoons (1/4 stick) butter",
        "3 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Dairy",
        "Shellfish",
        "Vegetable",
        "Bacon",
        "Lobster",
        "Corn",
        "Winter"
    ],
    "title": "Corn and Lobster Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-lobster-chowder-107469"
}
