{
    "directions": [
        "Heat 2 tablespoons oil in heavy medium skillet over medium heat. Add almonds; sauté until golden, about 8 minutes. Turn almonds out onto paper towels and drain. (Can be made 2 days ahead. Store airtight at room temperature.)",
        "Heat remaining 1 tablespoon oil in heavy large pot over medium-high heat. Add onions and sauté until beginning to brown, about 10 minutes. Add game hens, 2 cups water, chopped parsley, ginger, cinnamon, nutmeg, and cloves and bring to boil. Reduce heat to medium-low. Cover and simmer until game hens are cooked through, turning once, about 35 minutes. Using tongs, transfer game hen pieces to bowl.",
        "Degrease pan juices. Add honey, dried fruit, and raisins and simmer until fruit is tender, about 15 minutes. Return hen pieces to sauce. Season to taste with salt and pepper. (Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated.) Rewarm game hens in sauce over medium-low heat. Transfer to large platter. Sprinkle with almonds."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1/2 cup blanched almonds",
        "2 medium onions, thinly sliced",
        "2 1 3/4-pound Cornish game hens, quartered",
        "2 cups water",
        "1/2 cup finely chopped fresh parsley",
        "2 tablespoons minced peeled fresh ginger",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "1/2 cup honey",
        "1 cup mixed dried fruit (such as pitted dates, pitted prunes, and apricots), halved if large",
        "1/3 cup raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Braise",
        "Sauté",
        "Dried Fruit",
        "Almond",
        "Fall",
        "Honey",
        "Parsley"
    ],
    "title": "Cornish Game Hens with Dried Fruit and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/cornish-game-hens-with-dried-fruit-and-honey-105525"
}
