{
    "directions": [
        "Melt the butter in a saucepan with the chopped onion. Add the celery, celery tops, and thyme. Sauté the sausages gently or broil them. Add the salt and pepper to the crumbs and mix with the onion-celery mixture, the sausages, and the Madeira. Add more melted butter or some of the rendered sausage fat, if needed. Taste for seasonings. Stuff the turkey lightly.",
        "1. Omit sausages and add 1 cup whole kernel corn and 1/2 cup finely chopped green chiles (or 1 cup, if you like the taste of chiles). Substitute 1/2 cup cognac for the Madeira.",
        "2. Omit sausages. Sauté 1/2 pound sausage meat with the onions, breaking it up well. Add to the stuffing with 1 cup pecans.",
        "3. Omit sausages. Add 1 1/2 cups finely shredded Smithfield ham to the stuffing. Sauté the onions in ham fat instead of butter.",
        "4. Omit sausages. Add 2 cups crisp crumbled bacon to the stuffing. Sauté onions in bacon fat.",
        "5. Omit sausages and celery. Add 2 cups coarsely chopped Smithfield ham and 2 cups coarsely chopped roasted and salted peanuts. If peanuts are not to your liking, you may substitute toasted and salted filberts.",
        "6. If you like oysters in a stuffing, add about 2 dozen oysters with their liquor."
    ],
    "ingredients": [
        "1/4 pound (or more) butter",
        "1 1/4 cups finely chopped onion",
        "1 cup finely diced celery",
        "1/2 cup chopped celery tops",
        "1 1/2 teaspoons thyme",
        "1 pound small link sausages or chipolatas, lightly browned",
        "1 tablespoon salt or more, to taste",
        "1 1/2 teaspoons freshly ground black pepper",
        "6-8 cups coarse corn bread crumbs",
        "3/4 cup Madeira"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Sausage",
        "Cornmeal",
        "Celery",
        "Fortified Wine",
        "Fall",
        "House & Garden"
    ],
    "title": "Corn Bread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/corn-bread-stuffing-20020"
}
