{
    "directions": [
        "Preheat oven to 350°F. Spread 6 cups corn on 2 rimmed baking sheets. Roast until crisp and light brown, stirring occasionally, about 20 minutes. Cool.",
        "Heat 1 tablespoon oil in heavy medium skillet over medium-high heat. Add remaining 3 cups corn, green and red jalapeño chilies, and garlic; sauté until corn is crisp-tender, about 2 minutes. Stir in cilantro. Keep warm.",
        "Sprinkle fish with salt and pepper. Dust with flour to coat. Beat egg whites in shallow bowl until foamy. Dip fish into whites. Press fish into roasted corn to coat on both sides. Heat 2 tablespoons oil in large skillet over medium-high heat. Add fish; sauté until opaque in center, about 2 minutes per side. Divide corn-chili mixture among 4 plates; top with fish.",
        "Meanwhile, stir remaining 2 tablespoons oil and achiote paste in medium bowl to blend. Add shrimp and toss to coat. Heat heavy medium skillet over medium-high heat. Add shrimp mixture and sauté until shrimp are just opaque in center, about 4 minutes. Season with salt and pepper. Spoon shrimp around fish.",
        "*A paste made from achiote seeds. Available at Latin American markets."
    ],
    "ingredients": [
        "9 cups fresh corn kernels (cut from about 9 large ears)",
        "5 tablespoons corn oil",
        "1 teaspoon minced seeded green jalapeño chili",
        "1 teaspoon minced seeded red jalapeño chili",
        "1 garlic clove, minced",
        "3 tablespoons chopped fresh cilantro",
        "8 3-ounce red snapper fillets",
        "All purpose flour",
        "4 large egg whites",
        "1 teaspoon achiote paste*",
        "1/2 pound uncooked medium shrimp, peeled, deveined"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Shellfish",
        "Roast",
        "Sauté",
        "Dinner",
        "Seafood",
        "Snapper",
        "Shrimp",
        "Corn",
        "Summer",
        "Jalapeño",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn-Crusted Red Snapper with Achiote Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/corn-crusted-red-snapper-with-achiote-shrimp-103882"
}
