{
    "directions": [
        "Preheat oven to 450°F.",
        "Heat bacon fat in a 10-inch cast-iron skillet in middle of oven 5 minutes.",
        "While fat heats, whisk together cornmeal, flour, baking powder, and salt in a large bowl. Whisk together egg and milk in a small bowl, then add to dry ingredients, stirring just until combined.",
        "Carefully remove hot skillet from oven and stir scallions into hot fat (they will sizzle). Stir fat with scallions and melted butter into batter until just combined, then pour batter into hot skillet. Bake in middle of oven until a tester comes out clean, about 10 minutes. Turn corn bread out onto a rack and cool 15 minutes. (Leave oven on.)",
        "Cut corn bread into 3/4-inch cubes and spread in 1 layer in a shallow baking pan. Bake in upper third of oven until edges are golden, about 10 minutes, then cool in pan on a rack.",
        "Roast red and yellow bell peppers on racks of gas burners over high heat, turning with tongs, until skins are blackened, 10 to 12 minutes (or broil peppers on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes). Transfer peppers to a bowl and cover tightly with plastic wrap, then let stand 20 minutes.",
        "When cool enough to handle, peel peppers, discarding stems and seeds, and cut into 1-inch pieces.",
        "Whisk together vinegars, kosher salt, and black pepper in a large bowl, then add oil in a slow stream, whisking. Add tomatoes, onion, and olives to vinaigrette, tossing to coat, and marinate 10 to 15 minutes.",
        "Add roasted peppers, cucumbers, basil, mint, parsley, and croutons to bowl and toss."
    ],
    "ingredients": [
        "1/4 cup bacon fat (rendered from cooking 6 ounces bacon)",
        "1 1/2 cups stone-ground yellow cornmeal",
        "1/2 cup unbleached all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1 large egg",
        "1 cup whole milk",
        "3 scallions, minced",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "1 red bell pepper",
        "1 yellow bell pepper",
        "3 tablespoons red-wine vinegar",
        "2 tablespoons Sherry vinegar",
        "1 1/2 teaspoons kosher salt, or to taste",
        "1/4 teaspoon black pepper",
        "3/4 cup extra-virgin olive oil",
        "6 tomatoes (3 pounds), halved crosswise, seeded, and cut into 1-inch pieces",
        "1 small red onion, quartered lengthwise and thinly sliced crosswise",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and halved",
        "2 Kirby cucumbers, peeled, halved lengthwise, seeded, and cut crosswise into 1/4-inch-thick slices",
        "1/2 cup loosely packed fresh basil leaves",
        "1/2 cup loosely packed fresh mint leaves",
        "1/2 cup loosely packed fresh flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Olive",
        "Tomato",
        "Side",
        "Bake",
        "Roast",
        "Vinegar",
        "Cornmeal",
        "Cucumber",
        "Bell Pepper",
        "Summer",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn Bread Panzanella",
    "url": "http://www.epicurious.com/recipes/food/views/corn-bread-panzanella-107223"
}
