{
    "directions": [
        "Fill a large bowl with ice and cold water, and set it aside.",
        "In a 4- to 6-quart Dutch oven, or other heavy-bottomed pot with a tight-fitting lid, combine the chopped tomatoes, wine, water, onions, peppercorns, and tarragon sprigs. Bring to a boil over high heat, uncovered; then reduce the heat to a simmer and cook for 15 minutes.",
        "Raise the heat to high, add the lobster to the pot, and cover the pot immediately with a heavy, tightfitting lid. Steam the lobster for 13 minutes, until it is bright red and the long feelers are easily removed from their sockets. Immediately plunge the lobster into the bowl of ice water, and let it cool for 5 minutes.",
        "Remove the lobster from the ice water and set it on a rimmed baking sheet. Using kitchen shears, remove the lobster meat from the tail and claws. Use a knife to chop the lobster meat into bite- size pieces. You should have about 1 cup; set it aside.",
        "In a medium non-reactive mixing bowl, combine the shallot, vinegar, lemon juice, and lemon zest. Whisk in the 1/3 cup extra-virgin olive oil, 1/2 teaspoon salt, and the cayenne. Add the corn kernels and mix together. Set aside for 10 minutes.",
        "Cut the tiniest heirloom tomatoes in half, and quarter the larger ones. Add the tomatoes to the corn mixture. Add the lobster, tarragon, and parsley, and mix gently to combine.",
        "In a medium bowl, gently mix the Bibb lettuce leaves with the remaining 1/2 teaspoon extra-virgin olive oil, and season them lightly with salt and black pepper. Stack 2 lettuce leaves on each of four plates. Divide the lobster salad evenly among the lettuce cups, and serve immediately."
    ],
    "ingredients": [
        "2 cups roughly chopped ripe tomatoes",
        "2 cups dry white wine",
        "1/2  cup water",
        "1 cup thinly sliced onions",
        "3 black peppercorns",
        "2 sprigs fresh tarragon",
        "1 (1 1/2-pound) lobster",
        "2 tablespoons minced shallot or red onions",
        "2 tablespoons champagne vinegar or white wine vinegar",
        "2 tablespoons freshly squeezed lemon juice",
        "1/2  teaspoon grated lemon zest",
        "1/3  cup plus 1/2 teaspoon extra-virgin olive oil",
        "1/2 teaspoon salt, plus more for seasoning",
        "1/8 teaspoon cayenne pepper",
        "1 1/4 cups Silver Queen (or other regional variety) fresh corn kernels (from about 2 ears)",
        "1 pint mixed tiny heirloom tomatoes, such as cherry, cherub, grape, or pear, of different colors and sizes",
        "2 tablespoons chopped fresh tarragon leaves",
        "1 tablespoon chopped fresh parsley leaves",
        "8 Bibb lettuce leaves, rinsed and patted dry",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Emeril Lagasse",
        "Corn",
        "Salad",
        "Summer",
        "Lobster",
        "Tomato",
        "Seafood",
        "Shellfish",
        "Dinner",
        "Lunch",
        "Tarragon",
        "Steam",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Corn, Tomato, and Lobster Salad",
    "url": "http://www.epicurious.com/recipes/food/views/corn-tomato-and-lobster-salad"
}
