{
    "directions": [
        "In a large heavy skillet cook onion in oil over moderate heat, stirring, until golden. Stir in sauerkraut and apple and cook, stirring, 5 minutes. Stir in water and salt and pepper to taste and transfer to a bowl. Mixture keeps, covered and chilled, 1 week.",
        "Preheat broiler.",
        "Butter one side of bread slices. On a baking sheet set 4 inches from heat broil both side of bread until toasted lightly. Rub buttered side of each toast with garlic. Arrange 4 toasts, garlic side up, on a baking sheet and divide pickle and corned beef among them. Top beef with onion mixture and cheese and broil under broiler about 4 inches from heat until cheese is melted. Top sandwiches with remaining toasts, garlic side down, and halve.",
        "Serve sandwiches with mustard.",
        "In a kettle combine beef with cold water to cover by 2 inches and bring water just to a boil, skimming froth. Simmer beef, covered, 3 hours, or until tender. Remove kettle from heat and let beef stand in cooking liquid 20 minutes. Transfer beef to work surface and trim fat. Use beef as part of a boiled dinner and/or for making corned beef on rye and/or corned beef hash. Corned beef keeps, covered and chilled, 4 days."
    ],
    "ingredients": [
        "3 cups thinly sliced onion",
        "2 tablespoons vegetable oil",
        "3/4 cup drained sauerkraut",
        "1/2 Granny Smith apple, grated coarse",
        "3 tablespoons water",
        "unsalted butter, softened, for buttering bread",
        "8 large 1/2-inch-thick slices rye bread",
        "1 large garlic clove, halved",
        "1 large dill pickle, sliced paper-thin",
        "3/4 pound thinly sliced chilled cooked corned beef (about half a cooked 3 1/2-pound corned beef; recipe follows)",
        "1 cup coarsely grated Swiss cheese",
        "mustard as an accompaniment",
        "a 3-to 4-pound corned beef brisket"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Quick & Easy",
        "Brisket",
        "Spring",
        "Swiss Cheese",
        "Gourmet"
    ],
    "title": "Corned Beef on Rye with Caramelized Onions and Sauerkraut",
    "url": "http://www.epicurious.com/recipes/food/views/corned-beef-on-rye-with-caramelized-onions-and-sauerkraut-11514"
}
