{
    "directions": [
        "Preheat oven to 350°F. Arrange crumbled corn bread on rimmed baking sheet. Bake corn bread until lightly toasted, stirring occasionally, about 15 minutes. Transfer to large bowl.",
        "Cook bacon in heavy large skillet over medium heat until crisp, about 10 minutes. Using slotted spoon, transfer bacon to paper towels to drain. Add butter to drippings in skillet and melt over medium heat. Add onion, celery, bell pepper and sage. Sauté until vegetables are tender, about 15 minutes. Cool slightly. (Bread, bacon and vegetable mixture can be prepared 1 day ahead. Cover separately. Store bread at room temperature; refrigerate bacon and vegetables.)",
        "Add bacon, vegetable mixture and Spiced Pecans to corn bread. Season with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill main turkey cavity with stuffing. Add enough broth to remaining stuffing to moisten lightly (about 1/4 to 1/2 cup, depending on amount of remaining stuffing). Generously butter glass or ceramic baking dish. Spoon remaining stuffing into dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 30 minutes. Uncover stuffing. Bake until top is just crisp and golden, about 15 minutes.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch square glass or ceramic baking dish. Add enough broth to stuffing to moisten (about 3/4 cup to 1 1/2 cups.) Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down; bake until heated through, about 30 minutes. Uncover and bake until top is crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "epi:recipeLink id=\"102487\"<buttermilk corn=\"\" bread=\"\">/epi:recipeLink<, very coarsely crumbled</buttermilk>",
        "8 bacon slices, coarsely chopped",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups finely chopped celery",
        "1 cup chopped green bell pepper",
        "3 tablespoons chopped fresh sage",
        "epi:recipeLink id=\"102488\"<spiced pecans=\"\">/epi:recipeLink<</spiced>",
        "4 large eggs, beaten to blend",
        "1 cup (about) canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Pork",
        "Side",
        "Bake",
        "Thanksgiving",
        "Dinner",
        "Cornmeal",
        "Fall",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn Bread and Spiced-Pecan Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/corn-bread-and-spiced-pecan-stuffing-102486"
}
