{
    "directions": [
        "In a large bowl whisk together the buttermilk, the zest, the lemon juice, the oil, the shallots, the thyme, 1 teaspoon of the salt, and 1 teaspoon of the cayenne, add the chicken, stirring to coat it with the marinade, and let it marinate, covered and chilled, stirring occasionally, for 3 hours or overnight.",
        "Preheat the oven to 425°F. In another large bowl combine the cornmeal, the bread crumbs, the Parmesan, the parsley, the remaining 1 teaspoon salt, the paprika, and the remaining 1/2 teaspoon cayenne. Remove the chicken from the marinade with a slotted spoon, letting the excess marinade drip off, dip it in the egg wash, and dredge it in the cornmeal mixture, shaking off the excess. Arrange the chicken in one layer on a rack and let it dry for 30 minutes. (The chicken may be prepared up to this point 6 hours in advance and kept covered loosely and chilled.) Arrange the chicken, skin side up, in one layer in a lightly oiled jelly-roll pan, drizzling the butter over it, and bake it in the middle of the oven for 35 minutes, or until it is crisp and golden. Transfer the chicken to paper towels to drain. Serve the chicken warm or at room temperature."
    ],
    "ingredients": [
        "3/4 cup buttermilk",
        "1 teaspoon freshly grated lemon zest",
        "1/3 cup fresh lemon juice",
        "1/4 cup olive oil",
        "2 shallots, minced",
        "1 tablespoon fresh thyme leaves",
        "2 teaspoons salt",
        "1 1/2 teaspoons cayenne",
        "a 3-pound chicken, cut into 8 pieces",
        "3/4 cup yellow cornmeal",
        "1/2 cup fine dry bread crumbs",
        "1/4 cup freshly grated Parmesan",
        "2 tablespoons minced fresh parsley leaves",
        "1/2 teaspoon paprika",
        "an egg wash made by beating 2 large eggs with 2 tablespoons cold water and 1 tablespoon fresh lemon juice",
        "3 tablespoons unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Bake",
        "Marinate",
        "Parmesan",
        "Lemon",
        "Cornmeal",
        "Fall",
        "Gourmet"
    ],
    "title": "Cornmeal-Crusted Oven-Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-crusted-oven-fried-chicken-12731"
}
