{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Grease a large baking dish or roasting pan. Prepare the cornbread mix according to package directions, bake, and let cool.",
        "Remove the cooled cornbread from the pan, and crumble it into a large bowl. Mix in the bread stuffing mix, 1 large onion, 2 stalks of celery, 4 cups of chicken meat, and both cans of condensed soup. Stir in 2 cartons of chicken broth or as needed to moisten the dry ingredients. Stir in the eggs, melted butter, and salt and pepper.",
        "Lightly pack the mixture into the prepared pan, and bake in the preheated oven until the top is golden brown, 45 minutes to 1 hour.",
        "To make gravy, place 2 cups of cooked chicken meat, 1 cup of chopped onion, 1 cup of chopped celery, 4 cups of chicken broth, and the hard-cooked eggs in a large saucepan over medium-low heat, and simmer, stirring occasionally, until the vegetables are tender and the broth has reduced slightly, about 45 minutes. Mix the cornstarch with water to make a paste, and stir into the gravy. Bring back to a simmer, and cook until thickened, about 5 minutes, stirring occasionally. Serve over stuffing casserole."
    ],
    "ingredients": [
        "1 (19 ounce) package white cornbread mix (such as Martha White® - White Cornbread Mix)",
        "1/2 (14 ounce) package herb-seasoned stuffing mix (such as Pepperidge Farm® Cubed Herb Seasoned Stuffing)",
        "1 large onion, chopped",
        "2 stalks celery, chopped",
        "4 cups cooked chicken, cut into bite-size pieces",
        "1 (26 ounce) can condensed cream of chicken soup",
        "1 (10.75 ounce) can condensed cream of celery soup",
        "2 (16 ounce) cartons chicken broth, or as needed",
        "6 eggs, beaten",
        "1 cup melted butter",
        "salt and pepper to taste",
        "2 cups cooked chicken, cut into bite-size pieces",
        "1 cup chopped onion",
        "1 cup chopped celery",
        "4 cups chicken broth, or more as needed",
        "4 hard-cooked eggs, chopped",
        "2 1/2 tablespoons cornstarch, or as needed",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cornbread Dressing With Gravy",
    "url": "http://allrecipes.com/recipe/212469/cornbread-dressing-with-gravy/"
}
