{
    "directions": [
        "In bowl of a standing electric mixer (or a large bowl if kneading by hand) stir together lukewarm water, sugar, yeast, and 1 cup cornmeal and let stand until foamy about 5 minutes. In another bowl stir together flour and salt and gradually stir enough flour mixture into cornmeal mixture to form a soft dough. With dough hook knead dough, adding any remaining flour mixture if dough is too sticky, 5 minutes, or until smooth and elastic. (Alternatively, dough may be kneaded on a floured surface with floured hands until smooth and elastic, 10 to 15 minutes.)",
        "Put dough in an oiled deep bowl, turning to coat with oil. Cover bowl loosely and let dough rise in a warm place 2 hours, or until doubled in bulk. (Alternatively, dough may be allowed to rise, covered, in refrigerator overnight.)",
        "Punch down dough and divide into 4 pieces. Roll each piece between hands to form a 14-inch loaf and put 2 loaves on each of 2 large baking sheets. With a knife or kitchen scissors make eight to ten 2-inch-long diagonal cuts down length of each loaf and pull open to make decorative holes (exaggerate openings as they will become smaller during rising and baking).",
        "Cover loves loosely and let rise in a warm place until doubled in bulk, about 45 minutes.",
        "Preheat oven to 400°F.",
        "Sprinkle loaves with remaining 2 tablespoons cornmeal and bake in upper and lower thirds of oven 25 minutes, or until golden, switching baking sheets between upper and lower oven racks halfway through baking. Cool loaves on racks."
    ],
    "ingredients": [
        "2 cups lukewarm water",
        "1/4 cup firmly packed light brown sugar",
        "two 1/4-ounce packages (about 1 tablespoon plus 2 teaspoons) active dry yeast",
        "1 cup plus 2 tablespoons yellow cornmeal",
        "about 4 3/4 cups bread flour",
        "5 teaspoons salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Bake",
        "Cornmeal",
        "Gourmet"
    ],
    "title": "Cornmeal Harvest Loaves",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-harvest-loaves-10181"
}
