{
    "directions": [
        "Prepare barbecue (medium-high heat). Brush 1 ear of corn with oil, then sprinkle with coarse salt, black pepper, and cayenne pepper. Grill corn until cooked through and slightly charred, turning occasionally, about 14 minutes. Set grilled corn aside.",
        "Cut kernels off 3 remaining ears of corn. Place kernels in large bowl; reserve cobs.",
        "Using coarse side of box grater, grate any milky juices from 3 reserved cobs into medium bowl. Coarsely grate ear of grilled corn, then any milky juices from cob into same medium bowl.",
        "Melt 1 tablespoon butter in heavy large saucepan over medium heat. Add tasso and sauté until almost crisp, 4 to 5 minutes. Add shallots, poblano chile, celery, thyme, and garlic. Sauté until celery is translucent, about 4 minutes. Add corn kernels; sauté 3 minutes. Add tomatoes with juices and grilled corn with juices. Cover, reduce heat to low, and simmer 8 minutes. Mix in 2 tablespoons butter. Season with salt and pepper. Sprinkle with green onions."
    ],
    "ingredients": [
        "4 ears of corn (preferably bicolored), shucked, divided",
        "Olive oil",
        "Coarse kosher salt",
        "Cayenne pepper",
        "3 tablespoons butter, divided",
        "1/4 cup (1 ounce) matchstick-size strips tasso or Black Forest ham",
        "1/2 cup sliced shallots",
        "1/4 cup diced seeded fresh poblano chile",
        "1/4 cup chopped celery",
        "1 tablespoon chopped fresh thyme",
        "1 large garlic clove, thinly sliced",
        "3 cups diced seeded red tomatoes",
        "3 green onions, thinly sliced",
        "Ingredient info: Tasso is an intensely flavored Cajun-style smoked meat. It's available at some supermarkets and specialty foods stores. Fresh poblano chiles (often called pasillas) are sold at some supermarkets and specialty foods stores, at farmers' markets, and at Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Side",
        "Sauté",
        "High Fiber",
        "Backyard BBQ",
        "Ham",
        "Grill",
        "Grill/Barbecue",
        "Shallot",
        "Chile Pepper",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn and Tasso Maque Choux",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-tasso-maque-choux-359753"
}
