{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Butter 2 baking sheets.",
        "Spread challah bread cubes onto prepared baking sheets. Drizzle cubes with 2 tablespoons olive oil and season with salt and pepper.",
        "Bake bread in the preheated oven until toasted and lightly browned, 5 to 7 minutes. Transfer toasted cubes to a large bowl.",
        "Reduce oven temperature to 350 degrees F (175 degrees C). Butter a baking dish with 2 tablespoons unsalted butter.",
        "Cut corn kernels from the cob into a large bowl. Scrape corn juices from the cob into the bowl with the kernels.",
        "Heat 2 teaspoons olive oil in large skillet over medium heat. Cook and stir onion and garlic in hot oil until soft, 5 to 10 minutes. Add corn, pinch salt, and pinch pepper; cook and stir until corn softens, about 2 minutes.",
        "Stir corn mixture together with toasted bread cubes.",
        "Whisk cream, vegetable stock, Parmesan cheese, eggs, 2 tablespoons parsley, pinch salt, and pinch pepper together in a bowl. Pour cream mixture into bread mixture and stir until completely combined. Transfer bread mixture to the prepared baking dish.",
        "Bake stuffing in the preheated oven until stuffing is cooked through and the top is toasted, 20 to 25 minutes.",
        "Melt 2 tablespoons butter in a small skillet over medium heat. Cook whole sage leaves in hot butter until butter is slightly brown and sage leaves are crispy, 1 to 2 minutes. Transfer leaves to a paper towel to drain. Crumble sage leaves and remaining 2 tablespoons parsley over stuffing."
    ],
    "ingredients": [
        "1 (1 pound) loaf challah bread, cut into large cubes",
        "2 tablespoons extra-virgin olive oil",
        "salt and ground black pepper to taste",
        "2 tablespoons unsalted butter",
        "3 ears corn",
        "2 teaspoons extra-virgin olive oil",
        "1 small onion, diced",
        "4 cloves garlic, minced",
        "1/2 cup heavy whipping cream",
        "1/2 cup vegetable stock",
        "1/2 cup grated Parmesan cheese",
        "2 eggs, beaten",
        "1/4 cup chopped fresh parsley, divided",
        "2 tablespoons butter",
        "4 fresh whole sage leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Corn and Challah Stuffing with Fried Sage",
    "url": "http://allrecipes.com/recipe/234990/corn-and-challah-stuffing-with-fried/"
}
