{
    "directions": [
        "Heat milk and water to lukewarm (105°F. to 115°F.) in small saucepan. Pour into large bowl. Mix in sugar and yeast. Let stand 10 minutes.",
        "Stir flour, cornmeal and salt in medium bowl to blend. Stir into yeast mixture. Mix in buttermilk and egg yolks. Cover with plastic and let stand in warm area until very spongy, about 2 hours.",
        "Using electric mixer, beat egg whites in another medium bowl until stiff but not dry. Gently fold into cornmeal mixture in 2 additions.",
        "Preheat oven to 250°F. Brush large nonstick skillet with 1 teaspoon oil. Heat over medium-high heat. Working in batches and brushing with additional oil as necessary, drop batter by tablespoonfuls into skillet, spreading gently to 2-inch rounds. Cook until golden on bottoms and bubbles begin to break on surface, about 2 minutes. Using spatula, turn blini over; cook until golden, about 1 minutes. Arrange in single layer on large baking sheets. Keep warm in oven.",
        "Mix all ingredients except yogurt in medium bowl to blend. Season with salt and pepper. (Blini and salsa can be made 8 hours ahead. Cool blini. Cover blini and salsa separately and chill. Reheat blini uncovered in 350°F. oven about 10 minutes before serving.)",
        "Spread small amount of yogurt over blini. Divide salsa over blini. Arrange on platters and serve warm."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons low-fat milk",
        "2 tablespoons water",
        "1/4 cup sugar",
        "1 teaspoon dry yeast",
        "3/4 cup unbleached all purpose flour",
        "2/3 cup yellow cornmeal",
        "1 teaspoon salt",
        "1/2 cup buttermilk",
        "2 large eggs, separated",
        "5 teaspoons (about) vegetable oil",
        "2 cups frozen corn, thawed, drained",
        "1 1/2 pounds tomatoes, seeded, chopped",
        "1/2 small red onion, finely chopped",
        "6 tablespoons chopped fresh cilantro",
        "2 jalapeño chilies, seeded, minced",
        "1 tablespoon balsamic vinegar",
        "1/2 cup nonfat plain yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Tomato",
        "Cocktail Party",
        "Vegetarian",
        "Yogurt",
        "Cinco de Mayo",
        "Cornmeal",
        "Corn",
        "Summer",
        "Winter",
        "Pan-Fry",
        "Healthy",
        "Jalapeño"
    ],
    "title": "Cornmeal Blini with Tomato-Corn Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-blini-with-tomato-corn-salsa-1225"
}
