{
    "directions": [
        "Melt 1 tablespoon butter in a large pan over medium-low heat. Add leeks and cook, stirring occasionally, until leek is softened (do not allow to brown), about 6 minutes. Add salt and pepper to taste; add rice and cook, stirring, until grains look slightly translucent, about 5 minutes.",
        "Pour in wine and cook, stirring, until wine has all been absorbed, about 2 minutes.",
        "Add a ladleful of chicken stock to the rice mixture and cook, stirring constantly, until rice has absorbed all of the stock. Add another ladleful of stock, stirring, until rice has absorbed the liquid. Continue adding stock, one ladleful at a time, always allowing rice to absorb it before adding another. When about 3 cups of the stock has been added, stir in corn and roasted red peppers. Continue cooking, adding the remaining stock, a ladleful at a time, until all of the stock is incorporated, corn is tender, and rice is creamy and tender, about 30 to 40 minutes total.",
        "Remove risotto from heat and stir in the Parmesan and remaining tablespoon of butter. Cover and let stand for 5 minutes.",
        "With whisk or electric mixer, beat cream at high speed until it holds stiff peaks. Uncover the risotto and stir vigorously. Season with salt and pepper to taste. Before serving, stir in the chives and then gently fold in cream."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, divided",
        "1 leek, white and light green parts only, diced",
        "1 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "1 cup Arborio rice",
        "1/2 cup dry white wine",
        "6 cups Swanson® Unsalted Chicken Stock, divided, heated",
        "1 1/2 cups corn kernels, fresh or frozen (thawed)",
        "1/4 cup roasted red pepper, chopped",
        "1 cup grated Parmesan cheese",
        "1/4 cup whipping cream",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Corn Risotto with Roasted Red Pepper",
    "url": "http://allrecipes.com/recipe/245107/corn-risotto-with-roasted-red-pepper/"
}
