{
    "directions": [
        "Preheat the oven to 450 degrees F. Grease a 9-by-13-inch baking dish with oil. Fill the bottom of the dish with one layer of the potatoes (about 4 cups). Drizzle the potatoes with 1 tablespoon of the oil. Bake until hot and crisp, about 20 minutes. Let cool for 15 minutes.",
        "Meanwhile, heat the remaining 2 tablespoons oil in a large skillet over medium-high heat. Add the onions and red and green peppers. Season with 1/2 teaspoon salt and a few grinds of black pepper. Cook, stirring occasionally, until the vegetables have softened and started to brown, about 6 minutes. Add the corned beef, and cook for 2 minutes more. Let cool.",
        "Whisk together the eggs, milk, mustard, hot sauce, 1/2 teaspoon salt and 1/4 teaspoon ground black pepper in a large bowl.",
        "Sprinkle 1/2 cup of the Cheddar over the potatoes in the casserole dish. Layer the vegetable-beef mixture over the Cheddar. Pour the egg mixture into the dish and top with the remaining cup of Cheddar. (The casserole can be assembled up to this point and refrigerated overnight. Remove from the refrigerator 30 minutes before baking.)",
        "Preheat the oven to 350 degrees F. Top the casserole with the remaining potatoes (about 2 cups). Bake until the egg mixture is set and the top is lightly golden brown, 50 to 60 minutes. Let cool for 15 minutes before serving warm or at room temperature."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, plus more for greasing the baking dish",
        "6 cups frozen potato tots, from a 32-ounce bag (about 28 ounces)",
        "1 small yellow onion, finely chopped",
        "1 red bell pepper, finely chopped",
        "1 green bell pepper, finely chopped",
        "Kosher salt and freshly ground black pepper",
        "1/2 pound sliced deli corned beef, cut into 1/2-inch pieces",
        "8 large eggs",
        "1 1/2 cups whole milk",
        "3/4 teaspoon dry mustard",
        "4 dashes hot sauce, or to taste",
        "1 1/2 cups shredded Cheddar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Potato Casserole",
        "Vegetable Casserole",
        "Casserole",
        "Potato",
        "Vegetable",
        "Breakfast Casserole",
        "Beef",
        "Meat",
        "Egg Recipes",
        "Cheddar",
        "Cheese",
        "Main Dish Recipes",
        "Holiday"
    ],
    "title": "Corned Beef Hash Brown Casserole",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/corned-beef-hash-brown-casserole"
}
