{
    "directions": [
        "Using electric mixer, beat butter, brown sugar, and lemon peel in large bowl until fluffy, about 3 minutes. Beat in egg yolk, lemon juice, and vanilla.",
        "Whisk flour, cornmeal, cinnamon, and salt in another bowl to blend. Beat dry ingredients into butter mixture in 2 additions. Gather dough into ball, wrap tightly in plastic; chill for at least 30 minutes and up to 2 days.",
        "Preheat oven to 350°F. Line large rimmed baking sheet with parchment paper. Whisk egg white in small bowl until frothy. Place 1/2 cup sugar in another small bowl. Form dough into 11/2-inch balls. Roll each in egg white, then drop into sugar, tossing to coat. Place balls on prepared sheet, spacing 2 inches apart. Using thumb, make deep indentation in center of each (if edges crack, push together to smooth).",
        "Bake cookies 12 minutes. Remove from oven. Using wet thumb, immediately press indentation of each cookie again to reshape. Bake cookies until lightly browned and set at edges, about 10 minutes longer. Remove from oven and immediately press indentation of each cookie again. Cool cookies completely on sheet.",
        "Spoon jam into thumbprint of each cookie. Arrange on platter."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup (packed) golden brown sugar",
        "1 teaspoon (packed) finely grated lemon peel",
        "1 large egg, separated",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1 1/4 cups all purpose flour",
        "1/2 cup yellow cornmeal",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/2 cup sugar",
        "Summer Strawberry Jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cornmeal",
        "Summer",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cornmeal Thumbprint Cookies with Summer Strawberry Jam",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-thumbprint-cookies-with-summer-strawberry-jam-234744"
}
