{
    "directions": [
        "Whisk first 3 ingredients in large bowl. Using back of fork, cut in butter and shortening until mixture resembles coarse meal. Add 3 tablespoons ice water. Toss until dough comes together in moist clumps, adding more water by teaspoonfuls if dough is dry. Shape dough into disk. Wrap; chill at least 30 minutes.",
        "Preheat oven to 400°F. Spray 9-inch-diameter glass pie dish with nonstick spray. Place large piece of parchment paper on work surface. Place dough in center; cover with second sheet of parchment. Roll out dough to 12-inch round. Peel off top parchment. Using bottom parchment as aid, turn dough over into prepared pie dish. Carefully peel off remaining parchment. Fit crust into dish, sealing any tears. Fold excess dough under and crimp edges, forming highstanding rim. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Cook bacon in large skillet over medium-high heat until crisp. Using slotted spoon, transfer bacon to paper towels to drain. Pour off all but 1 1/2 tablespoons drippings. Add onion and pepper to skillet. Sauté until almost tender, about 8 minutes. Add corn; sauté until very tender, about 3 minutes longer.",
        "Whisk next 6 ingredients in large bowl to blend. Mix in green onions, then corn mixture. Sprinkle bacon, then cheese over bottom of crust. Pour in egg mixture.",
        "Bake pie until filling is golden and just set in center, about 55 minutes. Let pie cool at least 30 minutes and up to 1 hour. Serve slightly warm."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "3/4 cup fine-grind whole grain cornmeal",
        "1/2 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons chilled solid vegetable shortening (preferably with no trans fats), diced",
        "3 to 4 tablespoons ice water",
        "Nonstick vegetable oil spray",
        "1/2 pound bacon, coarsely chopped",
        "1 1/2 cups chopped sweet onion (such as Vidalia or Maui)",
        "1 cup chopped red bell pepper",
        "1 12-ounce package frozen corn kernels (2 1/2 cups), thawed, patted dry",
        "1 1/2 cups half and half",
        "3 large eggs",
        "1 teaspoon dried thyme",
        "1/2 teaspoon salt",
        "1/2 teaspoon Worcestershire sauce",
        "1/4 teaspoon freshly ground black pepper",
        "1 cup chopped green onions",
        "1 1/2 cups (packed) coarsely grated Gruyère cheese (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Brunch",
        "Bake",
        "Lunch",
        "Bacon",
        "Cornmeal",
        "Corn",
        "Swiss Cheese",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn and Bacon Pie",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-bacon-pie-241369"
}
