{
    "directions": [
        "Whisk flour, cornmeal, chili powder, and salt in 13x9x2-inch baking dish to blend. Pat trout dry with paper towels. Sprinkle trout cavities with salt and pepper. Coat trout with cornmeal mixture. Heat 2 tablespoons oil in each of 2 heavy large skillets over medium-high heat. Add 2 trout to each skillet and cook until trout are opaque in center and crisp on outside, about 4 minutes per side. Transfer trout to plates.",
        "Wipe out 1 skillet, then heat remaining 2 tablespoons oil in skillet over medium-high heat. Add onion, garlic, and serrano chili. Sauté until onion is tender, about 2 minutes. Add tomatoes, clam juice, lemon juice, and honey. Cook just until liquids begin to simmer, about 2 minutes. Remove skillet from heat. Stir in tarragon. Season salsa to taste with salt and pepper.",
        "Spoon salsa over trout. Sprinkle with pumpkin seeds and serve.",
        "*Ancho chili powder is available in the spice section of most supermarkets."
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "1/3 cup yellow cornmeal",
        "1 tablespoon ancho chili powder*",
        "1 teaspoon salt",
        "4 12- to 14-ounce whole trout, boned, scaled, heads and tails intact",
        "6 tablespoons olive oil",
        "1/2 cup chopped red onion",
        "4 garlic cloves, minced",
        "2 teaspoons minced seeded serrano chili",
        "1 1/2 pounds yellow or red tomatoes (preferably vine-ripened), seeded, cut into 1/2-inch pieces",
        "3 tablespoons bottled clam juice",
        "2 tablespoons fresh lemon juice",
        "2 teaspoons honey",
        "1 tablespoon chopped fresh tarragon",
        "1/4 cup shelled pumpkin seeds (pepitas), lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Tomato",
        "Sauté",
        "Lemon",
        "Cornmeal",
        "Trout",
        "Hot Pepper",
        "Pumpkin",
        "Winter",
        "Pan-Fry",
        "Simmer"
    ],
    "title": "Cornmeal-Crusted Trout with Warm Tomato and Tarragon Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-crusted-trout-with-warm-tomato-and-tarragon-salsa-107631"
}
