{
    "directions": [
        "In a medium 10-inch skillet over medium heat, melt butter. Cook until onion softens, 3 to 5 minutes, stirring occasionally. Remove from heat. Set aside 1 tablespoon corn for aioli. In the same skillet, combine remaining corn and chiles with cooked onions. Remove skillet from heat.",
        "In a medium mixing bowl, combine flour, baking powder, salt, and pepper. In a large bowl, whisk together milk and eggs. Gradually whisk flour mixture into milk mixture just until smooth. Stir in corn and chiles mixture and crabmeat. Cover and refrigerate 10 minutes.",
        "Meanwhile, make aioli by combining the mayonnaise, lemon juice, zest, garlic and reserved corn in a small mixing bowl. Chill until ready to serve.",
        "Remove the corn crab batter from the refrigerator. Add enough oil to skillet so it reaches about 1/4 inch deep; heat over medium-high heat. Carefully drop 6 to 7 mounds of batter by tablespoon into hot oil. Cook until golden brown, about 1 to 2 minutes per side. Transfer fritters to paper towels and repeat with remaining batter. Serve with lemon aioli. Sprinkle with chopped parsley."
    ],
    "ingredients": [
        "Fritters:",
        "1 tablespoon unsalted butter",
        "1 small white onion, finely chopped",
        "1 (11 ounce) can corn, drained, divided",
        "1 (4.5 ounce) can chopped green chiles, drained",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon kosher salt",
        "1/2 teaspoon cracked black pepper",
        "2/3 cup whole milk",
        "2 large eggs",
        "1 (6 ounce) can crab meat, drained",
        "1/4 cup vegetable oil for frying, or as needed",
        "1/4 cup chopped fresh parsley for garnish",
        "Lemon Aioli:",
        "2/3 cup mayonnaise",
        "1/2 teaspoon lemon zest",
        "3 tablespoons lemon juice",
        "1 clove garlic, minced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Corn and Crab Fritters with Lemon Aioli",
    "url": "http://allrecipes.com/recipe/245882/corn-and-crab-fritters-with-lemon-aio/"
}
