{
    "directions": [
        "Broil the jalapeños on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 20 minutes, or until the skins are blistered and charred. Transfer the jalapeños to a bowl and let them stand, covered tightly, until they are cool enough to handle. Wearing rubber gloves, peel the jalapeños, cut off the tops, and discard all but 1 teaspoon of the seeds. In a blender puree the jalapeños with the seeds, the oil, the lime juice, the water, the garlic, the parsley, and salt to taste. The puree may be made 3 days in advance and kept covered and chilled.",
        "In a kettle cook the onion and the celery in the oil over moderate heat, stirring, until the celery is softened, add the broth, the water, the potatoes, peeled and cut into 3/8-inch cubes, and the ham, and simmer the mixture for 10 minutes. Stir in the corn and the thyme and simmer the chowder for 5 minutes, or until the potatoes are tender. In a blender or food processor purée 2 cups of the chowder and stir the purée into the remaining chowder.",
        "Serve the chowder with a small dollop of the jalapeño and parsley puree swirled into it."
    ],
    "ingredients": [
        "5 fresh jalapeño chilies",
        "1/4 cup olive oil",
        "1 1/2 tablespoons fresh lime juice",
        "1 tablespoon water",
        "1 garlic clove, minced",
        "1 cup packed fresh parsley leaves",
        "1 onion, chopped fine",
        "2 ribs of celery, chopped fine",
        "2 tablespoons vegetable oil",
        "2 cups chicken broth",
        "2 1/2 cups water",
        "1 1/2 pounds boiling potatoes",
        "1/2 pound ham steak if desired, cut into 3/8-inch cubes",
        "4 cups fresh corn kernels including the pulp scraped from the cobs (cut from about 6 ears of corn)",
        "2 teaspoons fresh thyme leaves, minced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Herb",
        "Potato",
        "Broil",
        "Vegetarian",
        "Lunch",
        "Corn",
        "Jalapeño",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn Chowder with Roasted Jalapeño and Parsley Purée",
    "url": "http://www.epicurious.com/recipes/food/views/corn-chowder-with-roasted-jalapeno-and-parsley-puree-12312"
}
