{
    "directions": [
        "Heat oil in large pot over medium-high heat. Add onions; sauté until golden, about 10 minutes. Add mushrooms; sauté until tender, about 10 minutes. Add sage, thyme, garlic, and cumin; stir 1 minute. Add squash, beans, tomatoes with juice, and 1/2 cup water; bring to boil. Reduce heat to medium, cover, and simmer 8 minutes. Uncover and simmer until vegetables are tender and most of liquid has evaporated but mixture is still very moist, about 12 minutes. Season filling generously with salt and pepper. (Can be made 1 day ahead. Cool slightly. Cover; chill.)",
        "Preheat oven to 350°F. Butter 15x10x2-inch glass baking dish. Mix Masa Harina, cornmeal, salt, and baking powder in large bowl. Whisk 4 1/4 cups water, 6 tablespoons melted butter, eggs, and egg yolk in another large bowl to blend. Stir egg mixture into Masa Harina mixture. Stir in cheese and parsley, adding more water by tablespoonfuls as needed to form thick moist dough.",
        "Transfer 4 cups dough to prepared baking dish. Place large piece of plastic wrap atop dough. Using plastic as aid, press dough evenly over bottom and 3/4 of the way up sides of dish; peel off plastic. Spoon filling into dough in dish, spreading evenly. Spoon remaining dough in small dollops atop filling. Using offset spatula, gently spread dollops evenly over filling to cover. Press top and bottom dough together at edges to seal, enclosing filling. (Can be made 1 day ahead. Cover; chill.)",
        "Brush top of casserole with 4 tablespoons melted butter. Bake until dough is light golden and casserole is heated through, about 1 hour (or about 1 hour 15 minutes if chilled). Cool 10 minutes. Cut into squares; serve with Ancho Mole."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "2 1/2 cups chopped onions",
        "1 1/4 pounds assorted wild mushrooms (such as oyster, chanterelle, and portobello), coarsely chopped",
        "1 1/2 tablespoons chopped fresh sage",
        "4 teaspoons chopped fresh thyme",
        "3 large garlic cloves, chopped",
        "2 1/2 teaspoons ground cumin",
        "4 cups 1/2-inch cubes seeded peeled butternut squash (about 2 1/2 pounds)",
        "2 cups drained rinsed black beans (from two 15-ounce cans)",
        "2 cups diced tomatoes in juice (from two 14 1/2-ounce cans)",
        "1/2 cup water",
        "4 cups Masa Harina (corn tortilla mix)",
        "2/3 cup yellow cornmeal",
        "2 1/4 teaspoons salt",
        "3/4 teaspoon baking powder",
        "4 1/4 cups (or more) water",
        "10 tablespoons (1 1/4 sticks) butter, melted, divided",
        "2 large eggs",
        "1 large egg yolk",
        "2 cups (packed) coarsely grated extra-sharp white cheddar cheese (about 8 ounces)",
        "3 tablespoons finely chopped fresh Italian parsley",
        "Ancho Mole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mushroom",
        "Vegetable",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Squash",
        "Butternut Squash",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Cornbread Casserole and Butternut Squash, Mushrooms, and Ancho Mole",
    "url": "http://www.epicurious.com/recipes/food/views/cornbread-casserole-and-butternut-squash-mushrooms-and-ancho-mole-233151"
}
