{
    "directions": [
        "Beat together butter and sugars in a large bowl with an electric mixer until pale and fluffy. Beat in egg, vanilla, baking powder, salt, cinnamon, and cardamom. Add flour and cornmeal and stir with a wooden spoon until just blended.",
        "Halve dough and pat into 2 disks (dough will be very soft). Chill, wrapped in plastic wrap, at least 4 hours.",
        "Preheat oven to 350°F.",
        "Roll out 1 piece of dough between 2 sheets of wax paper to 1/4 inch thick. Remove top sheet of wax paper and cut 3 cookies with fluted cutter, leaving cutouts in place. Replace wax paper. Roll out remaining piece of dough and cut 3 more cookies in same manner. Chill both pieces of dough until firm, about 15 minutes.",
        "Carefully transfer cookies to an ungreased large baking sheet and keep chilled. Reroll scraps between 2 sheets wax paper and cut out 2 more cookies (for a total of 8; you'll have 2 extra in case of breakage). Transfer to baking sheet with other cookies.",
        "Bake cookies in upper third of oven until edges are golden brown, about 20 minutes. Transfer to a rack and dust with confectioners sugar.",
        "Melt butter in a large nonstick skillet over moderately high heat, then add brown sugar and lemon juice and cook, stirring, until smooth, about 1 minute. Add fruit and bourbon (if using) and sauté, stirring occasionally, until fruit is tender, about 5 minutes (sauce will be red). Remove from heat.",
        "Place 1 cookie on each of 6 dessert plates and dust again with confectioners sugar. Spoon some warm fruit topping over each cookie, then top with a scoop of ice cream."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/3 cup granulated sugar",
        "1/3 cup packed light brown sugar",
        "1 large egg",
        "1/2 teaspoon vanilla",
        "1/2 teaspoon baking powder",
        "3/4 teaspoon salt",
        "3/4 teaspoon cinnamon",
        "3/4 teaspoon ground cardamom",
        "1 cup all-purpose flour",
        "1/2 cup yellow cornmeal",
        "Confectioners sugar for dusting",
        "1 tablespoon unsalted butter",
        "1/4 cup packed light brown sugar",
        "1/2 tablespoon fresh lemon juice",
        "3 firm-ripe nectarines, thinly sliced",
        "4 firm-ripe red plums, thinly sliced",
        "2 tablespoons bourbon (optional)",
        "Accompaniment: butter pecan ice cream",
        "Special equipment: a 3 1/2- to 4-inch fluted round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Nectarine",
        "Plum",
        "Cornmeal",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cornmeal-Cookie Sundaes with Warm Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-cookie-sundaes-with-warm-fruit-105248"
}
