{
    "directions": [
        "Whisk mayonnaise and Dijon mustard in small bowl. Set aside.",
        "Heat vegetable oil in large nonstick skillet over medium heat. Add cabbage, sliced onion, crushed coriander seeds, and celery seeds; sprinkle with salt and freshly ground black pepper and sauté until wilted and crisp-tender, about 6 minutes. Stir in white wine vinegar and sugar. Sauté until all liquid is absorbed, about 30 seconds. Transfer to medium bowl; set aside. Wipe out skillet and reserve.",
        "Place slices of rye bread on work surface. Divide white cheddar cheese among 4 bread slices; top with corned beef, dividing meat slices equally. Divide cabbage mixture over corned beef. Spread 1 teaspoon mayonnaise mixture over each remaining bread slice; place rye bread slices atop cabbage, mayonnaise side down. Spread 1 teaspoon mayonnaise mixture over each top bread slice.",
        "Heat same skillet over medium heat. Add 2 corned beef sandwiches, mayonnaise side down. Spread some of remaining mayonnaise mixture over top bread slices. Cook sandwiches covered until golden brown and cheddar cheese melts, about 2 minutes per side. Repeat with remaining corned beef sandwiches and serve."
    ],
    "ingredients": [
        "1/4 cup mayonnaise",
        "2 teaspoons Dijon mustard",
        "2 teaspoons vegetable oil",
        "1 8-ounce package shredded green cabbage (about 3 cups)",
        "1 cup thinly sliced onion",
        "2 teaspoons coriander seeds, coarsely crushed in resealable plastic bag with mallet",
        "1 teaspoon celery seeds",
        "2 tablespoons white wine vinegar",
        "1 teaspoon sugar",
        "8 slices rye bread",
        "4 ounces sliced sharp white cheddar cheese",
        "12 ounces thinly sliced corned beef"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Quick & Easy",
        "High Fiber",
        "St. Patrick's Day",
        "Lunch",
        "Mayonnaise",
        "Cheddar",
        "Cabbage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Corned Beef Sandwiches with Pickled Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/corned-beef-sandwiches-with-pickled-cabbage-363990"
}
