{
    "directions": [
        "Combine first 6 ingredients in large saucepan. Stir over medium heat until sugar dissolves. Add pears and bring syrup to boil, turning pears occasionally. Reduce heat to medium-low, cover, and simmer until pears are tender, about 20 minutes. Chill pears uncovered in syrup until cold, at least 3 hours. DO AHEAD Can be made 2 days ahead. Cover and keep chilled.",
        "Preheat oven to 325°F. Butter and flour 9x5x3-inch metal loaf pan. Whisk flour and cornmeal in medium bowl to blend. Using electric mixer, beat butter in large bowl until light and fluffy. Gradually beat in sugar, then salt. Drizzle in beaten eggs by tablespoonfuls, beating constantly, then beat in vanilla. Add dry ingredients in 3 additions, beating just to blend after each addition. Transfer batter to prepared pan.",
        "Bake cake until brown on top and tester inserted into center comes out clean, about 1 hour 15 minutes. Cool cake in pan 15 minutes. Turn cake out onto rack and cool completely. DO AHEAD Can be made 1 day ahead. Wrap in foil and store at room temperature.",
        "Bring 1 cup sugar and 1/2 cup water to simmer in medium saucepan over medium-high heat, stirring until sugar dissolves. Add rosemary sprigs. Simmer until syrup reduces slightly, swirling pan occasionally, about 5 minutes. Using tongs, transfer rosemary sprigs to rack and drain. Cover and reserve rosemary syrup.",
        "Pour baker's sugar into shallow bowl. Add drained rosemary sprigs to sugar, 1 at a time, turning to coat thickly. Place on paper towels. Dry at least 1 hour. DO AHEAD Can be made 1 day ahead. Let sprigs and syrup stand at room temperature.",
        "Cut dark ends off cake. Cut eight 1/2- to 3/4-inch-thick cake slices. Cut each slice diagonally in half. Arrange 2 halves on each plate. Drain pears. Stand 1 pear on each plate. Drizzle each dessert with reserved rosemary syrup and garnish with candied rosemary sprig. Serve, passing remaining syrup separately."
    ],
    "ingredients": [
        "3 cups water",
        "2 cups sugar",
        "1 cup dry or off-dry Riesling",
        "3 fresh rosemary sprigs",
        "1 vanilla bean, split lengthwise",
        "1/4 teaspoon whole black peppercorns",
        "8 Forelle pears or other small pears, peeled, stems left intact",
        "1 cup all purpose flour",
        "1 cup yellow cornmeal",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 1/3 cups sugar",
        "1/4 teaspoon salt",
        "5 large eggs, beaten to blend in medium bowl",
        "1 teaspoon vanilla extract",
        "1 cup sugar",
        "1/2 cup water",
        "8 (4-inch-long) fresh rosemary sprigs",
        "Baker's sugar or other superfine sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Rosemary",
        "Cornmeal",
        "Vanilla",
        "White Wine",
        "Fall",
        "Winter",
        "Chill",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cornmeal Pound Cake with Rosemary Syrup, Poached Pears, and Candied Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-pound-cake-with-rosemary-syrup-poached-pears-and-candied-rosemary-236542"
}
