{
    "directions": [
        "*Cook's note: Brisket should be prepared through the brining stage, but not cooked.",
        "Place the corned beef, pepper, allspice, bay leaves and salt into a large 8-quart pot along with 3-quarts of water. Cover and set over high heat. Bring to a boil, decrease the heat to low and cook, at a low simmer for 2 1/2 hours.",
        "After 2 1/2 hours add the carrots, onions, potatoes and celery. Return to a simmer and cook uncovered for 15 minutes. After 15 minutes, add the cabbage and cook for an additional 15 to 20 minutes until the potatoes and cabbage are tender. Remove the bay leaves and serve immediately.",
        "Place the water into a large 6 to 8 quart stockpot along with salt, sugar, saltpeter, cinnamon stick, mustard seeds, peppercorns, cloves, allspice, juniper berries, bay leaves and ginger. Cook over high heat until the salt and sugar have dissolved. Remove from the heat and add the ice. Stir until the ice has melted. If necessary, place the brine into the refrigerator until it reaches a temperature of 45 degrees F. Once it has cooled, place the brisket in a 2-gallon zip top bag and add the brine. Seal and lay flat inside a container, cover and place in the refrigerator for 10 days. Check daily to make sure the beef is completely submerged and stir the brine.",
        "After 10 days, remove from the brine and rinse well under cool water. Place the brisket into a pot just large enough to hold the meat, add the onion, carrot and celery and cover with water by 1-inch. Set over high heat and bring to a boil. Reduce the heat to low, cover and gently simmer for 2 1/2 to 3 hours or until the meat is fork tender. Remove from the pot and thinly slice across the grain.",
        "Yield: 6 to 8 servings",
        "Prep Time: 20 minutes",
        "Cook Time: approximately 3 hours",
        "Inactive Prep Time: 10 days"
    ],
    "ingredients": [
        "2 to 2 1/2 pound Corned-Beef Brisket*, recipe follows",
        "1 tablespoon coarsely ground black pepper",
        "1 teaspoon ground allspice",
        "2 bay leaves",
        "2 teaspoons kosher salt",
        "1/2 pound diced carrots, approximately 4 small",
        "1/2 pound diced onions, approximately 2 small",
        "1 pound potatoes, peeled and chopped, approximately 3 medium",
        "1/4 pound diced celery, approximately 2 stalks",
        "1 small head cabbage, chopped, approximately 2 pounds",
        "2 quarts water",
        "1 cup kosher salt",
        "1/2 cup brown sugar",
        "2 tablespoons saltpeter",
        "1 cinnamon stick, broken into several pieces",
        "1 teaspoon mustard seeds",
        "1 teaspoon black peppercorns",
        "8 whole cloves",
        "8 whole allspice berries",
        "12 whole juniper berries",
        "2 bay leaves, crumbled",
        "1/2 teaspoon ground ginger",
        "2 pounds ice",
        "1 (4 to 5 pound) beef brisket, trimmed",
        "1 small onion, quartered",
        "1 large carrot, coarsely chopped",
        "1 stalk celery, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Vegetable",
        "Cabbage Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Corned Beef and Cabbage",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/corned-beef-and-cabbage-recipe"
}
