{
    "directions": [
        "Brine the meat: In a saucepan over high heat, heat the water, kosher salt, curing salt, brown sugar, and pickling spice, stirring until the salt is dissolved. Add the ice water. Place the beef in a 2-gallon ziptop bag. Place the bag in a stockpot and pour the brine into it, over the meat. Seal the bag, squeezing as much air out of it as possible so the meat remains completely submerged. Refrigerate the beef in the bag for 10 days.",
        "Rinse the beef: Remove the beef from the brine; discard the brine. Thoroughly rinse the beef under cold running water, removing all of the spices, and blot it dry on paper towels.",
        "Season the beef with the rub: Combine all of the rub ingredients in a small bowl. Spread the rub over the beef with your hands, covering all surfaces, and place the beef in a 2-gallon zip-top bag; seal the bag, squeezing out as much of the air as possible. Place the bag on a baking dish and refrigerate for a week, turning the bag over once a day. This is known as dry brining—you will notice each day that more liquid leaches from the beef.",
        "Cook the beef: On the day you wish to serve the beef, place it in a large pot with all of the accumulated juices in the bag. Add water as needed to cover the meat and bring to a boil over high heat. Lower the heat to medium, cover the pot, and let the beef simmer for 3 hours, until fork tender but not falling apart.",
        "Present the dish: Spoon the warm parsley sauce into a small bowl. Drain the beef and transfer it to a cutting board. Let it rest for 15 minutes and then slice it 1/2 inch thick, cutting lengthwise, against the grain. Arrange the meat on a serving platter or individual plates; serve with the sauce on the side, along with your chosen side dishes."
    ],
    "ingredients": [
        "2 quarts water",
        "3/4 cup kosher salt",
        "1 tablespoon pink curing salt, such as sel rose or Insta Cure #1*",
        "1/2 cup light brown sugar",
        "3 tablespoons prepared pickling spice",
        "2 quarts ice water",
        "1 (5-pound) beef brisket, with the deckle intact",
        "3 large fresh bay leaves, torn into small pieces",
        "9 cloves garlic, crushed",
        "3 tablespoons yellow mustard seed",
        "2 tablespoons coarsely ground black pepper",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground cayenne pepper",
        "1/4 teaspoon ground coriander",
        "2 cups warm Parsley Sauce",
        "*Available at www.sausagemaker.com"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "St. Patrick's Day",
        "Meat",
        "Brisket",
        "Boil",
        "Advance Prep Required"
    ],
    "title": "Corned Beef",
    "url": "http://www.epicurious.com/recipes/food/views/corned-beef-51225210"
}
