{
    "directions": [
        "Cook corn in four cups of water. Remove corn, strain water of corn silk, and reserve cooking water.",
        "Cut kernels from cobs and reserve the corn. Return cobs to cooking water, simmer till water reduces to half. Then remove cobs and reserve water.",
        "Scrape cobs with dull knife to extract all the corn milk and reserve this liquid.",
        "Sauté onions, garlic, and jalapeño in olive oil in nonstick skillet. Don't let them brown.",
        "Add reserved corn kernels and corn milk to vegetables, then toss and cook on low heat for 2 minutes. Puree half of this mix in a blender or food processor.",
        "Add puree and remaining corn-vegetable mix to reduced corn water. Then add lime juice and clam broth, to taste.",
        "Cook bacon until crisp, drain, and cut into ribbons.",
        "Sauté scallop quarters quickly in bacon fat till slightly browned. Don't overcook.",
        "Reheat soup. Add scallops and bacon to mixture in the corn water. Season with ground pepper and salt, to taste. Add more lime or clam juice if necessary.",
        "Serve in bowls with minced cilantro or basil sprinkled on top."
    ],
    "ingredients": [
        "6 ears corn",
        "4 cups water (reserve water after the corn has cooked)",
        "2 tsp olive oil for vegetables",
        "2 medium yellow onions, chopped",
        "3 cloves garlic, minced",
        "1 jalapeño pepper, seeded and minced",
        "Juice of half a lime",
        "Clam broth, to taste",
        "2 slices bacon",
        "6 large sea scallops, quartered",
        "Salt and freshly ground black pepper",
        "1 tbsp chopped cilantro or basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Pork",
        "Shellfish",
        "Vegetable",
        "Side",
        "Sauté",
        "Quick & Easy",
        "Bacon",
        "Scallop",
        "Corn",
        "Fall",
        "Simmer",
        "Boil",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Corn Soup with Sautéed Scallops and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/corn-soup-with-sauteed-scallops-and-bacon-234219"
}
