{
    "directions": [
        "Prepare grill and if using bamboo skewers soak in water 30 minutes.",
        "Shuck corn and cut crosswise into twenty-four 1-inch pieces. Cut pork into thirty-two 1-inch pieces. Thread 3 pieces corn and 4 pieces pork onto each skewer. In a small bowl whisk together 1 tablespoon vinegar, 4 1/2 teaspoons oil, red pepper flakes, and salt and divide red pepper mixture between 2 small bowls (to prevent the potential contamination caused by uncooked meat juices). Brush kebabs with red pepper mixture from 1 bowl and grill on a lightly oiled rack set 5 to 6 inches over glowing coals, turning occasionally, until pork is cooked through, 15 to 20 minutes. With a clean brush coat kebabs with red pepper mixture from other bowl.",
        "While kebabs are grilling, trim and halve green beans. Cut potatoes into 1/8-inch-thick slices and finely chop rosemary. In a steamer arrange potatoes and layer green beans on top. Steam potatoes and green beans over boiling water, covered, until potatoes are tender, 6 to 8 minutes. In a large bowl whisk together remaining tablespoon vinegar, remaining 2 teaspoons oil, rosemary, garlic, and salt and pepper to taste. Add hot vegetables and toss to combine.",
        "Serve kebabs with vegetables."
    ],
    "ingredients": [
        "eight 10-inch metal or bamboo skewers",
        "4 large ears fresh corn",
        "2 pork tenderloins (1 1/2 pounds total)",
        "2 tablespoons red-wine vinegar",
        "6 1/2 teaspoons extra-virgin olive oil",
        "2 teaspoons dried hot red pepper flakes",
        "1 teaspoon salt",
        "1 pound green beans",
        "1/2 pound boiling potatoes",
        "2 teaspoons fresh rosemary leaves",
        "2 teaspoons minced garlic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Steam",
        "Low Fat",
        "Backyard BBQ",
        "Rosemary",
        "Pork Tenderloin",
        "Corn",
        "Green Bean",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Corn and Pork Kebabs with Rosemary Green Beans and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/corn-and-pork-kebabs-with-rosemary-green-beans-and-potatoes-14228"
}
