{
    "directions": [
        "Preheat oven to 300°. Divide cornbread between 2 baking sheets. Bake, tossing occasionally, until brown in spots, 40-45 minutes.",
        "Meanwhile, cook sausage in a skillet over medium-high heat, breaking up with a spoon, until dark brown, 6-8 minutes. Using a slotted spoon, transfer sausage to a bowl; let cool.",
        "Reduce heat to medium and heat 8 tbsp butter in same skillet. Add fennel, celery, scallions, and garlic and cook, stirring, until vegetables are tender, about 15 minutes. Add pears and wine, increase heat to medium-high, and cook, stirring occasionally, until wine is almost completely evaporated, about 5 minutes.",
        "Increase oven temperature to 400°. Butter a 13\" x 9\" baking dish. Combine sausage, fennel mixture, parsley, marjoram, thyme, sage, and 1 1/2 cups broth in a large bowl. Add cornbread and toss; season with salt and pepper. Let sit 10 minutes, then add remaining 1/2 cup broth and toss, adding more broth if needed (bread should be moist but not soggy). Add eggs and mix gently to combine. Transfer dressing to prepared baking dish and dot with remaining 2 tbsp butter.",
        "Cover dressing with foil and bake until heated through, about 30 minutes. Remove foil and bake until top is golden and crisp, 20-30 minutes longer. Serve topped with fennel fronds."
    ],
    "ingredients": [
        "8 cups 1/2\" cubes Easy Cornbread",
        "1 lb breakfast sausage, casings removed",
        "10 tbsp unsalted butter, divided, plus more",
        "1 medium fennel bulb, chopped, plus fronds",
        "4 celery stalks, chopped",
        "8 scallions, white and pale-green parts, sliced",
        "2 garlic cloves, finely chopped",
        "2 Bosc or Comice pears, peeled, chopped",
        "1/2 cup dry white wine (such as Sauvignon Blanc)",
        "2 tbsp finely chopped fresh flat-leaf parsley",
        "1 tbsp chopped fresh marjoram or oregano",
        "1 tbsp chopped fresh thyme",
        "1 tsp dried sage leaves",
        "2 cups (or more) chicken broth, divided",
        "Kosher salt",
        "freshly ground pepper",
        "3 large eggs, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Appetizer",
        "Pear",
        "Sausage",
        "Fennel"
    ],
    "title": "Cornbread, Sausage, and Fennel Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/cornbread-sausage-and-fennel-dressing-51256710"
}
