{
    "directions": [
        "Cool corn bread completely. Cover and let stand at room temperature overnight.",
        "Combine raisins and tequila in large saucepan. Simmer 5 minutes. Remove from heat. Let stand until most of tequila is absorbed, stirring occasionally, about 2 hours. Drain well.",
        "Char chilies over gas flame or in broiler until blackened on all sides. Enclose in paper bag; let stand 10 minutes. Peel, seed and chop chilies.",
        "Melt butter in large skillet over medium heat. Add chopped chilies, onions, thyme, marjoram and sage. Cook until onions just begin to color, stirring occasionally, about 10 minutes. (Bread, raisins and chili mixture can be made 1 day ahead. Cover separately. Store bread and raisins at room temperature; chill chili mixture.)",
        "Crumble corn bread into large bowl. Add raisins, chili mixture, sourdough bread cubes and pine nuts. Toss to blend. Season stuffing to taste with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill main turkey cavity with stuffing. Add enough broth to remaining stuffing to moisten lightly (about 1/4 to 1/2 cup, depending on amount of remaining stuffing). Generously butter glass or ceramic baking dish. Spoon remaining stuffing into dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 30 minutes. Uncover stuffing. Bake until top is just crisp and golden, about 15 minutes.",
        "Preheat oven to 350°F. Generously butter 8-inch square glass or ceramic baking dish. Add enough broth to stuffing to moisten (about 3/4 cup to 1 1/2 cups.) Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down; bake until heated through, about 30 minutes. Uncover and bake until top is crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "Easy Corn Bread",
        "1 cup raisins",
        "1/3 cup tequila",
        "2 large poblano chilies*",
        "6 tablespoons (3/4 stick) butter",
        "2 cups chopped onions",
        "1 1/2 tablespoons chopped fresh thyme",
        "3/4 teaspoon dried marjoram, crumbled",
        "3/4 teaspoon dried rubbed sage",
        "1/2 1-pound round loaf sourdough bread, crust trimmed, cut into 1/2-inch cubes (about 4 cups)",
        "3/4 cup pine nuts, lightly toasted",
        "2 large eggs, beaten to blend",
        "1 1/4 cups (about) canned low-salt chicken broth",
        "*Fresh green chilies, often called pasillas, available at Latin American markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Pepper",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Pine Nut",
        "Hot Pepper",
        "Fall",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Corn Bread, Green Chili and Pine Nut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/corn-bread-green-chili-and-pine-nut-stuffing-102491"
}
