{
    "directions": [
        "Preheat oven to 350°F. Butter 9 x 5x 2 1/2-inch metal loaf pan. Dust with cornmeal; tap out excess. Scrape seeds from vanilla bean into heavy medium saucepan; add bean. Add milk, butter, lemon peel and salt. Bring to simmer, stirring until butter melts. Remove from heat. Gradually whisk in 1 cup cornmeal. Transfer to medium bowl. Mix in honey and 3 tablespoons sugar. Cool to just lukewarm, stirring occasionally, about 10 minutes. Discard vanilla bean. Whisk in yolks.",
        "Using electric mixer, beat egg whites in large bowl until foamy. Sprinkle remaining 2 tablespoons sugar over whites and beat until medium-soft peaks form. Gently fold whites into cornmeal mixture in 2 additions. Pour batter into prepared pan.",
        "Bake cake until top cracks and tester inserted into center comes out with a few moist crumbs attached, about 45 minutes. Cool cake in pan on rack (cake will fall in center). Turn out onto plate. Using sharp serrated knife, cut cake into 3/4-inch-thick slices. Place 1 slice on each plate. Top with Black Cherry Compote."
    ],
    "ingredients": [
        "Yellow cornmeal",
        "1/2 vanilla bean, split lengthwise",
        "2 cups fresh goat's milk or whole milk",
        "1/4 cup (1/2 stick) unsalted butter",
        "1 teaspoon grated lemon peel",
        "3/4 teaspoon salt",
        "1 cup yellow cornmeal",
        "1/4 cup honey",
        "5 tablespoons sugar",
        "4 large eggs, separated",
        "Black Cherry Compote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cornmeal Cake with Black Cherry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-cake-with-black-cherry-compote-101606"
}
