{
    "directions": [
        "Position rack in center of oven; preheat to 425°F. Melt 1 tablespoon butter in nonstick skillet over medium heat. Add green onions and sauté 2 minutes to soften slightly. Remove from heat.",
        "Blend flour, cornmeal, sugar, baking powder, salt, and baking soda in processor. Add 1/2 cup chilled butter; cut in using on/off turns until mixture resembles coarse meal. Add cheese; cut in using on/off turns. Transfer flour mixture to large bowl. Whisk 1 egg in glass measuring cup. Add enough buttermilk to egg to measure 1 cup; stir in green-onion mixture and chipotles. Make well in center of dry ingredients. Pour buttermilk mixture into well; mix just until evenly moistened.",
        "Turn dough out onto generously floured surface. Knead gently just until dough holds together, about 10 turns. Pat out on generously floured surface to 3/4-inch-thick round. Using 3-inch round cutter, cut out biscuits. Transfer to ungreased baking sheet, spacing 1 inch apart. Gather dough scraps; pat out to 3/4-inch thickness and cut out additional biscuits. Brush biscuits with egg glaze.",
        "Bake biscuits until golden, tester inserted into center comes out clean, and biscuits feel firm, about 18 minutes. Cool on rack 5 minutes. Serve warm.",
        "*Available at some supermarkets, specialty foods stores, and Latin markets."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "3/4 cup (packed) chopped green onions",
        "1 1/2 cups all purpose flour",
        "1/2 cup yellow cornmeal",
        "2 tablespoons sugar",
        "2 1/2 teaspoons baking powder",
        "3/4 teaspoon coarse kosher salt",
        "1/2 teaspoon baking soda",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 1/2 cups (packed) coarsely grated yellow extra-sharp cheddar cheese",
        "1 large egg",
        "3/4 cup (about) buttermilk",
        "1 tablespoon finely minced canned chipotle chiles in adobo*",
        "1 egg, beaten with 1 tablespoon whipping cream (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Cheese",
        "Pepper",
        "Breakfast",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Cheddar",
        "Cornmeal",
        "Hot Pepper",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cornmeal Biscuits with Cheddar and Chipotle",
    "url": "http://www.epicurious.com/recipes/food/views/cornmeal-biscuits-with-cheddar-and-chipotle-234118"
}
