{
    "directions": [
        "Position 1 rack in top third of oven and second rack in bottom third of oven and preheat to 375°F. Mix 1 1/2 cups chopped beet greens, pancetta and juniper berries in medium bowl. Season to taste with salt and pepper. Fill hen cavities with pancetta mixture, dividing equally. Tie hen legs together. Place hens in heavy large roasting pan. Rub 1 tablespoon olive oil over hens. Sprinkle hens with salt and pepper. (Can be prepared 8 hours ahead. Cover and refrigerate.)",
        "Roast hens on bottom rack in oven until golden and juices run clear when thickest part of thigh is pierced, about 1 hour 15 minutes.",
        "Meanwhile, toss chopped beets with remaining 2 tablespoons olive oil on heavy large baking sheet. Season with salt and pepper. Arrange beets in single layer. Roast beets on top rack in oven until tender and beginning to caramelize, stirring occasionally, about 45 minutes.",
        "Transfer hens to plates. Remove string. Scrape up any browned bits from bottom of roasting pan. Pour pan juices through sieve into 2-cup glass measuring cup. Spoon fat off top of pan juices.",
        "Spoon beets around hens. Drizzle pan juices around hens and serve."
    ],
    "ingredients": [
        "4 medium beets with greens, beets peeled and cut into 1/2-inch pieces, greens finely chopped",
        "1/2 pound 1/4-inch-thick pancetta,* finely chopped",
        "1 tablespoon juniper berries, coarsely chopped",
        "4 1 1/2- to 1 3/4-pound Cornish game hens, giblets removed",
        "3 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Game",
        "Poultry",
        "Roast",
        "Christmas",
        "Dinner",
        "Bacon",
        "Beet",
        "Winter",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cornish Game Hens with Pancetta, Juniper Berries and Beets",
    "url": "http://www.epicurious.com/recipes/food/views/cornish-game-hens-with-pancetta-juniper-berries-and-beets-103010"
}
