{
    "directions": [
        "Place fresh masa or masa harina mixture in large bowl. Add warm water to dough by tablespoonfuls as needed, kneading until dough is soft, smooth, and pliable but not sticky. Shape 3 tablespoons dough into ball for each tortilla and arrange on sheet of foil; cover with plastic wrap to prevent drying.",
        "Place 1 large griddle or skillet over medium-low heat; place second large griddle or skillet over medium-high heat. Cut two 8-inch rounds from 1 heavy-duty resealable plastic bag. Place 1 plastic round on bottom half of tortilla press; place 1 dough ball in center. Top with second plastic round. Close press, flattening dough to 5-inch round (about 1/8 inch thick). If tortilla thickness is uneven, lift dough round in plastic and rotate 180 degrees. Press tortilla lightly to even out.",
        "Peel off top sheet of plastic. Use bottom plastic round to transfer tortilla to 1 hand with part of tortilla dangling off; peel off plastic round. Hold hand with tortilla over cooler griddle. Let dangling portion of tortilla catch at front half of griddle and slowly sweep hand backward, easing tortilla onto griddle without wrinkling. Cook tortilla until it looks slightly dry at edges and starts to release from griddle surface, about 45 seconds. Lift tortilla with fingers and place, uncooked side down, on hotter griddle. Cook until brown spots appear on bottom, about 1 minute. On same griddle, turn tortilla over again. Cook until bottom browns and parts of tortilla puff up, about 1 minute longer. Transfer tortilla to cloth-lined basket and cover with cloth or wrap tortilla in large sheet of foil and keep warm in 250°F oven. Repeat with remaining dough balls, adding tortillas to basket or foil packet. (Tortillas can be made 2 hours ahead. Wrap in aluminum foil. Rewarm in 300°F oven 15 minutes.)"
    ],
    "ingredients": [
        "2 cups freshly ground corn masa dough for tortillas (about 17 ounces), or make masa dough with 1 3/4 cups masa harina (corn tortilla mix; about 8 1/2 ounces) mixed with 1 cup plus 2 tablespoons warm water",
        "Warm water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cinco de Mayo",
        "Pan-Fry",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Corn Tortillas",
    "url": "http://www.epicurious.com/recipes/food/views/corn-tortillas-108029"
}
