{
    "directions": [
        "Preheat oven to 425°F. Roll out pastry to 1/8-inch thickness, then cut it into a 12-inch-wide circle. Place on a baking sheet lined with parchment paper. Refrigerate until ready to use.",
        "a large sauté pan over medium-high heat, heat 2 tablespoons oil. Add onion, celery, chard stems, 1/4 teaspoon salt, and a hearty grind of black pepper and cook until softened, about 5 minutes. Add chard leaves, garlic, and sage and cook until chard leaves are wilted, about 5 minutes more. Transfer vegetable mixture to a large bowl and stir in mint, parsley, feta, Pecorino, pine nuts, lemon zest, and 3 tablespoons of the ricotta. Set aside to cool, about 10 minutes.",
        "Toss the squash ribbons (if using) with remaining 1 teaspoon oil. Spread vegetable mixture onto the pastry, leaving 1 1/4-inch border. Dollop remaining ricotta on the vegetable mixture and top with squash ribbons. Roll the pastry edges up around the side of the filling and pinch edges together to form a secure edge around the tart. Brush pastry with beaten egg and refrigerate for 10 minutes.",
        "Bake tart until pastry is golden and cooked through at the bottom, 25 to 30 minutes. Remove from oven and drizzle with a bit of olive oil. Cut into wedges and serve warm or at room temperature."
    ],
    "ingredients": [
        "12 ounces all-butter puff pastry, thawed if frozen",
        "2 tablespoons plus 1 teaspoon olive oil, divided, plus more for drizzling",
        "1/2 small red onion, thinly sliced (about 3/4 cup)",
        "3 celery stalks with leaves, thinly sliced (about 3/4 cup)",
        "1 bunch Swiss chard (about 8 ounces) or mix of other greens like kale, beet tops, turnip tops, or spinach, stemmed, leaves coarsely chopped, and stalks sliced 1/2-inch thick",
        "Salt",
        "Freshly ground black pepper",
        "2 garlic cloves, peeled and thinly sliced",
        "2 teaspoons chopped sage",
        "2 tablespoons torn mint leaves",
        "2 tablespoons chopped Italian parsley",
        "1/2 cup crumbled feta",
        "1/2 cup finely grated Pecorino",
        "2 tablespoons pine nuts, lightly toasted",
        "Grated zest of 1 lemon",
        "6 tablespoons fresh ricotta, divided",
        "12 wide, long ribbons of peeled butternut squash",
        "1 egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Feta",
        "Pine Nut",
        "Butternut Squash",
        "Chard",
        "Picnic"
    ],
    "title": "Corsican Greens Pie with Butternut Squash and Three Cheeses",
    "url": "http://www.epicurious.com/recipes/food/views/corsican-greens-pie-with-butternut-squash-and-three-cheeses-51253450"
}
