{
    "directions": [
        "Make spice sachet by wrapping together in cheesecloth the cinnamon sticks, coriander seeds, cloves, peppercorns, bay leaves, and cardamom pods. Tie with kitchen string.",
        "In heavy, large pot over high heat, stir together 4 cups water, tomatoes, garlic, ginger, cilantro stems, 1 teaspoon salt, and spice sachet. Bring to boil, then reduce heat and simmer, uncovered, until reduced by 1/3, about 30 minutes. Strain through fine-mesh sieve into large clean pot, reserving solids. Discard spice sachet. Measure 1 cup of strained liquid in pot and transfer to blender. Add reserved solids and pureé until smooth. Strain through fine-mesh sieve back into pot with liquid.",
        "Place pot over high heat and bring to simmer, about 5 minutes. Stir in ground pepper and remaining 1/4 teaspoon salt. Serve immediately, topping each portion with chopped cilantro leaves."
    ],
    "ingredients": [
        "2 whole cinnamon sticks",
        "1 teaspoon whole coriander seeds",
        "1/2 teaspoon whole cloves (about 11 cloves)",
        "1/8 teaspoon whole black peppercorns (about 10 peppercorns), lightly crushed",
        "2 fresh bay leaves (or 4 dried)",
        "2 green cardamom pods",
        "6 medium tomatoes, quartered and seeded (about 3 pounds total)",
        "6 cloves garlic, coarsely chopped",
        "1 (3/4-inch) knob fresh ginger, peeled and coarsely chopped (about 1 tablespoon)",
        "1/2 large bunch fresh cilantro, stems reserved and leaves finely chopped (about 1/4 cup)",
        "1 1/4 teaspoons fine sea salt",
        "1/4 teaspoon freshly ground black pepper",
        "Special equipment: 1 (3-inch) square cheesecloth; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Ginger",
        "Tomato",
        "Sauté",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "Dinner",
        "Lunch",
        "Spice",
        "Healthy",
        "Vegan",
        "Cilantro",
        "Fat Free",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Country-Style Tomato and Cilantro Broth",
    "url": "http://www.epicurious.com/recipes/food/views/country-style-tomato-and-cilantro-broth-240798"
}
