{
    "directions": [
        "Trim any excess fat from the ribs and cut into approximately 5-inch-long pieces. Lightly season the ribs with salt and pepper.",
        "Heat a large sauté pan on the stovetop over medium-high heat. Add the oil, then the ribs, and brown well on all sides. (To avoid overcrowding the pan, you may have to do this in batches.)",
        "While the ribs are searing, spray the inside of the slow cooker with cooking spray. Add the ketchup, cola, tomato paste, garlic, brown sugar, chili sauce, bourbon, cider vinegar, sorghum syrup, Worcestershire sauce, chili powder, and cayenne. Stir well. Add the ribs to the slow cooker, layering the larger, fattier ribs on the bottom. Make sure all the ribs are covered in sauce. Cover and cook on low for at least 8 hours and up to 9 hours, until the meat is fall-off-the-bone tender.",
        "Transfer the ribs to a platter and keep warm. Pour the leftover sauce into a small saucepan and cook over medium heat for 10 to 15 minutes, until it is reduced and slightly thickened. Skim off any visible fat, season with salt and pepper, and serve the sauce over the ribs."
    ],
    "ingredients": [
        "4 to 5 pounds bone-in pork country-style ribs",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon vegetable oil",
        "1 1/2 cups ketchup",
        "1/2 cup cola (not diet)",
        "3 tablespoons tomato paste",
        "2 cloves garlic, minced",
        "2 tablespoons brown sugar",
        "2 tablespoons American spicy ketchup-based sauce (such as Heinz brand chili sauce) or homemade chili sauce",
        "2 tablespoons good-quality bourbon",
        "2 tablespoons cider vinegar",
        "1 tablespoon sorghum syrup or light molasses",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon chili powder",
        "1/4 teaspoon cayenne pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork Rib",
        "Pork",
        "Grill/Barbecue",
        "Slow Cooker"
    ],
    "title": "Country-Style Pork Ribs With Bourbon and Coke BBQ Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/country-style-pork-ribs-with-bourbon-and-coke-bbq-sauce"
}
