{
    "directions": [
        "Set rack at lowest position in oven and preheat to 350°F. Boil Cognac until reduced to 1/2 cup, about 1 1/2 minutes. Cool.",
        "Melt butter in heavy medium skillet over medium heat. Add onion and saut&é until soft and translucent but not brown, about 8 minutes.",
        "Combine ground pork and chopped bacon in large bowl. Using fork or fingertips, mix together until well blended.",
        "Add sautéed onion, garlic, 2 1/2 teaspoons salt, thyme, allspice, and pepper to bowl with pork mixture and stir until incorporated. Add eggs, cream, and reduced Cognac. Stir until well blended.",
        "Line 9x5x3-inch metal loaf pan with bacon slices, arranging 8 slices across width of pan and 3 slices on each short side of pan and overlapping pan on all sides. Using hands, lightly and evenly press half of meat mixture (about 3 1/4 cups) onto bottom of pan atop bacon slices. Arrange ham strips over in single layer. Top with remaining meat mixture.",
        "Fold bacon slices over, covering pâté. Cover pan tightly with foil. Place pan in 13x9x2-inch metal baking pan and transfer to oven. Pour boiling water into baking pan to come halfway up sides of loaf pan. Bake pâté until a thermometer inserted through foil into center registers 155°F, about 2 hours 15 minutes.",
        "Remove loaf pan from baking pan and transfer to rimmed baking sheet. Place heavy skillet or 2 to 3 heavy cans atop pâté to weigh down. Chill overnight. Do Ahead Can be made 4 days ahead.",
        "Place loaf pan with pâté in larger pan of hot water for about 3 minutes. Invert pâté onto platter; discard fat from platter and wipe clean. Cut pâté crosswise into 1/2-inch slices.",
        "Tiny French pickles; available at specialty foods stores."
    ],
    "ingredients": [
        "3/4 cup Cognac",
        "3 tablespoons unsalted butter",
        "1 cup minced onion",
        "2 1/2 pounds ground pork",
        "12 ounces bacon (8 to 10 slices), finely chopped, plus 14 bacon slices (for lining pan)",
        "plus 14 bacon slices",
        "3 garlic cloves, pressed",
        "2 1/2 teaspoons salt",
        "2 1/2 teaspoons dried thyme",
        "1 1/2 teaspoons allspice",
        "1 teaspoon freshly ground black pepper",
        "2 large eggs, lightly beaten",
        "1/3 cup whipping cream",
        "1 6-ounce piece ham steak, cut crosswise into 1/4-inch-thick strips",
        "Coarse sea salt",
        "Cornichons*",
        "Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Appetizer",
        "Bake",
        "Bastille Day",
        "Dinner",
        "Bacon",
        "Ham",
        "Cognac/Armagnac",
        "Candy Thermometer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Country Pâté (Pâté de Campagne)",
    "url": "http://www.epicurious.com/recipes/food/views/country-pate-em-pate-de-campagne-em-350966"
}
