{
    "directions": [
        "Preheat oven to 375°F. Place cherries in bowl; cover with boiling water. Let stand until soft, about 15 minutes. Drain.",
        "Cut bottom crust and short ends off bread; discard. Cut remaining bread with crust into 1-inch cubes (10 cups loosely packed). Place in large bowl. Add oil, thyme, and garlic; toss. Spread out on large rimmed baking sheet. Sprinkle with salt and pepper. Bake until golden and slightly crunchy, stirring often, about 20 minutes. Return to same large bowl.",
        "Melt butter in large skillet over medium-high heat. Add next 4 ingredients. sauté until vegetables are soft, about 10 minutes. Mix in parsley and cherries. DO AHEAD Bread cubes and vegetable mixture can be made 1 day ahead. Cover separately. Store bread at room temperature. Chill vegetables.",
        "Preheat oven to 375°F. Butter 11x7x2-inch glass baking dish. Stir vegetables and nuts into bread cubes. Add hot broth, tossing to coat. Mix in cheese. Transfer to dish. Cover with buttered foil, buttered side down. Bake until heated through, about 25 minutes. Uncover and bake until top is brown, about 25 minutes longer, and serve."
    ],
    "ingredients": [
        "1/2 cup dried tart cherries",
        "1 (1-pound) loaf crusty country-style white bread",
        "1/4 cup olive oil",
        "4 teaspoons chopped fresh thyme",
        "1 large garlic clove, minced",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups thinly sliced celery",
        "1 1/4 cups chopped smoked ham (preferably from 2 meaty ham hocks)",
        "1 cup finely chopped green bell pepper",
        "1/3 cup chopped fresh parsley",
        "1/2 cup toasted husked hazelnuts, coarsely chopped",
        "1 3/4 cups low-salt chicken broth or turkey stock, heated",
        "4 ounces chilled fresh goat cheese, crumbled into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Goat Cheese",
        "Cherry",
        "Fall",
        "Thyme",
        "Hazelnut",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Country Bread Stuffing with Smoked Ham, Goat Cheese, and Dried Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/country-bread-stuffing-with-smoked-ham-goat-cheese-and-dried-cherries-236495"
}
