{
    "directions": [
        "Place coriander seeds, fennel seeds, cumin seeds, black peppercorns, cloves, cardamom seeds, and cinnamon stick in small dry skillet. Stir over medium heat until fragrant and slightly darker in color, 5 to 6 minutes. Remove from heat; cool. Finely grind spices in spice mill or in mortar with pestle. Transfer to small bowl; add turmeric and cayenne.",
        "Heat 3 tablespoons oil in heavy large deep pot over medium-high heat. Add cauliflower florets; sprinkle with coarse kosher salt and sauté until beginning to soften and brown in spots, 6 to 7 minutes. Transfer to medium bowl.",
        "Add remaining 2 tablespoons oil and half of chicken to same pot; sprinkle with coarse kosher salt and sauté until chicken is light brown on all sides, about 6 minutes. Transfer chicken to large bowl. Repeat with remaining chicken.",
        "Add white parts of green onions, finely grated ginger, and minced garlic to same pot; reduce heat to medium and sauté until fragrant, about 1 minute. Add ground spice mixture; stir 15 seconds. Stir in 1 1/2 cups chicken broth and bring to boil, scraping up any browned bits. Add crushed tomatoes; reduce heat to medium-low, cover, and simmer 15 minutes. Stir in dried cherries and peanut butter; return chicken and any accumulated juices to pot. Cover and simmer 10 minutes. Add sautéed cauliflower to pot; cover and simmer until chicken is cooked through and cauliflower is tender, adding more chicken broth by 1/4 cupfuls if mixture is dry, about 10 minutes longer. Season with coarse salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep refrigerated. Rewarm over medium heat before continuing.",
        "Add frozen peas to stew and simmer until heated through, about 5 minutes. Ladle stew into bowls. Sprinkle each serving with green onion tops and toasted coconut shavings and serve.",
        "Strips of unsweetened coconut (also called coconut chips); available at some supermarkets and at many natural foods stores and from melissas.com."
    ],
    "ingredients": [
        "1 1/2 teaspoons coriander seeds",
        "1 teaspoon fennel seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon whole black peppercorns",
        "3 whole cloves",
        "1/4 teaspoon cardamom seeds (from 3 whole green cardamom pods)",
        "1 1/2-inch piece cinnamon stick",
        "1/2 teaspoon turmeric",
        "1/4 teaspoon (scant) cayenne pepper",
        "5 tablespoons peanut oil or vegetable oil, divided",
        "1 small head of cauliflower, trimmed, cut into 1-inch florets (about 4 cups)",
        "Coarse kosher salt",
        "2 pounds skinless boneless chicken thighs, trimmed, cut into 1- to 2-inch pieces",
        "1 bunch green onions, dark green and white parts chopped separately",
        "1 tablespoon finely grated peeled fresh ginger",
        "2 garlic cloves, minced",
        "1 1/2 cups (or more) low-salt chicken broth",
        "1 2/3 cups crushed tomatoes with added puree (from 28-ounce can)",
        "1/3 cup dried cherries, finely chopped",
        "1 tablespoon smooth peanut butter",
        "1 1/2 cups frozen petite peas (9 to 10 ounces; do not thaw)",
        "1/3 cup coconut shavings,* lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Tomato",
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Spice",
        "Cauliflower",
        "Legume",
        "Pea",
        "Healthy",
        "Clove",
        "Cardamom"
    ],
    "title": "Country Captain with Cauliflower and Peas",
    "url": "http://www.epicurious.com/recipes/food/views/country-captain-with-cauliflower-and-peas-357529"
}
