{
    "directions": [
        "Preheat oven to 400 degrees F. In a small saucepan over medium-low heat, melt the butter. Once the butter has melted, whisk in the flour, creating a roux. Allow the roux to cook for 1-2 minutes. Whisk in the milk, nutmeg, salt and pepper. The roux will thicken as it cooks into a bechamel. Once it becomes thick enough to coat the back of a spoon, take off the heat. Set aside.",
        "On a lightly floured surface, roll out the thawed puff pastry until 1/8 inch thick. Cut one sheet of puff pastry into 3 equal pieces longwise. Cut each piece in half crosswise, creating 6 equal pieces. Line a baking sheet with a piece of Reynolds Wrap(R) Aluminum Foil. Place the pastry on the lined baking sheet and brush the edges of the pastry with the egg wash.",
        "On one half of the piece of puff pastry, sprinkle 1 tablespoon of cheese and top with a slice of country ham. Spread 1 tablespoon of the bechamel over the ham. Repeat with another layer of cheese and ham, and finish with one tablespoon of bechamel. Fold the remaining half of the pastry over the filling. Crimp with edges with the tines of a fork. Brush the tops with the egg wash. Cut slits on the top of the pastry to allow the steam to escape the hand pie as it bakes. Repeat with the rest of the pastry.",
        "Bake the hand pies for 20-25 minutes, or until golden brown on top. Immediately place on a wire rack to cool."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "4 tablespoons all-purpose flour",
        "2 cups whole milk",
        "1 pinch ground nutmeg",
        "Salt and pepper to taste",
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "1 egg, slightly beaten",
        "2 cups grated white Cheddar cheese",
        "12 slices thinly sliced country ham, halved",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Country Ham and Cheddar Mini Hand Pies",
    "url": "http://allrecipes.com/recipe/244895/country-ham-and-cheddar-mini-hand-pie/"
}
