{
    "directions": [
        "Season chicken with thyme, kosher salt, and black pepper.",
        "Heat oil in a 5-quart Dutch oven over high heat. Place chicken pieces, skin-side down, in hot oil and cook until golden brown, 2 to 5 minutes. Transfer chicken to a plate; drain and discard oil.",
        "Reduce heat to medium and add bacon to the Dutch oven. Cook and stir until bacon is browned and crispy, 7 to 10 minutes. Transfer bacon to a paper towel-lined plate.",
        "Cook and stir onion, celery, bell peppers, and garlic in the Dutch oven over medium heat until soft, about 10 minutes. Add chopped tomatoes, 3/4 cup reserved tomato liquid, currants, raisins, curry powder, butter, bay leaves, salt, and black pepper; bring to a simmer, reduce heat to medium-low, cover the Dutch oven with a lid, and simmer until sauce is thickened, about 30 minutes.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Return chicken to Dutch oven and spoon sauce over the top. Cover the Dutch oven with a lid.",
        "Bake in the preheated oven until chicken is tender, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).",
        "Press 1/2 cup rice into a small bowl and invert onto a plate to remove. Set 2 pieces of chicken on rice and spoon sauce over the top. Repeat with remaining rice, chicken, and sauce. Garnish each with currants, peanuts, and parsley."
    ],
    "ingredients": [
        "1 whole whole chicken, cut into 8 pieces",
        "1 teaspoon ground thyme",
        "kosher salt and freshly ground black pepper to taste",
        "1/4 cup canola oil",
        "6 slices applewood smoked bacon, chopped",
        "1 large yellow onion, diced small",
        "3 ribs celery, chopped",
        "2 green bell peppers, chopped",
        "4 cloves garlic, minced",
        "1 (28 ounce) can whole peeled tomatoes, drained and chopped, liquid reserved",
        "1/4 cup dried currants, plus more for garnish",
        "1/4 cup golden raisins, or to taste",
        "3 tablespoons Madras curry powder",
        "2 tablespoons unsalted butter",
        "2 bay leaves",
        "2 cups cooked basmati rice",
        "2 tablespoons peanuts, or to taste",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Country Captain Chicken with Rice",
    "url": "http://allrecipes.com/recipe/241741/country-captain-chicken-with-rice/"
}
