{
    "directions": [
        "Pound steaks between 2 sheets of plastic to 1/8\" thick. Pat dry with paper towels.",
        "Combine cornstarch, 1/4 tsp. salt, and 1/4 tsp. pepper in a wide shallow bowl or dish. Combine garlic powder, 1 cup flour, 1 tsp. lemon zest, 1 1/2 tsp. salt, and 1/4 tsp. pepper in another wide shallow bowl or dish. Lightly beat eggs in another wide shallow bowl.",
        "Dip steak in seasoned cornstarch, then in eggs, letting excess drip back into bowl. Coat in flour mixture, shaking off excess. Dip in eggs and flour mixture again for a second coating. Transfer steak to a lightly floured baking sheet; chill 1–3 hours.",
        "Meanwhile, place potatoes in a medium pot; add cold water to cover by 1\". Season with salt, bring to a boil, and cook until potatoes are fork-tender, 12–15 minutes; add green beans during the last 3 minutes of cooking and cook until crisp-tender. Drain potatoes and beans and transfer to a large bowl of ice water; chill until cold, about 3 minutes. Transfer to a clean dish towel or paper towels and pat dry.",
        "Whisk sour cream, buttermilk, lemon juice, honey, 1 Tbsp. chives, 1/4 tsp. salt, and remaining 1 tsp. lemon zest and 1/4 tsp. pepper in a small bowl. Gently stir in cheese.",
        "Pour oil into a large heavy skillet to come halfway up the sides; fit with thermometer. Heat over high until thermometer registers 325°F. Working in batches, fry steaks until deep golden brown, about 3 minutes per side. Transfer to paper towels, season with salt, then thinly slice into strips.",
        "Toss lettuce, potatoes, beans, and dressing in a large bowl. Arrange on a platter. Top with steak and remaining 1 Tbsp. chives."
    ],
    "ingredients": [
        "12 ounces top round steak, cut into 2 pieces",
        "1/2 cup cornstarch",
        "Kosher salt",
        "3/4 teaspoon freshly ground black pepper, divided",
        "1/2 teaspoon garlic powder",
        "1 cup all-purpose flour, plus more for pan",
        "2 teaspoons finely grated lemon zest, divided",
        "3 large eggs",
        "1/2 pound small golden new potatoes",
        "1/2 pound green beans, trimmed",
        "6 tablespoons sour cream",
        "1/4 cup buttermilk",
        "2 teaspoons fresh lemon juice",
        "1/4 teaspoon honey",
        "2 tablespoons chopped chives, divided",
        "1/4 cup crumbled blue cheese",
        "Canola oil (for frying)",
        "2 heads of Little Gem lettuce or baby romaine hearts, torn into bite-size pieces (about 6 cups)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Salad",
        "Fry",
        "Blue Cheese",
        "Green Bean",
        "Potato",
        "Lettuce",
        "Dinner",
        "Flaming Hot Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Country Fried Steak Salad With Blue Cheese Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/country-fried-steak-salad-with-blue-cheese-dressing"
}
