{
    "directions": [
        "Preheat oven to 400°F. Spray 2 large rimmed baking sheets with nonstick spray. Place half of bread pieces in large bowl. Add 3 tablespoons oil and toss to coat, then add 1/2 cup Parmesan cheese, and toss. Spread bread in single layer on 1 prepared sheet. Repeat with remaining bread, 3 tablespoons oil, and 1/2 cup cheese; spread on second sheet. Bake bread until golden, stirring occasionally, about 10 minutes. Cool on sheets. Transfer to very large bowl.",
        "Melt 1/4 cup butter with remaining 2 tablespoons oil in heavy large pot over medium-high heat. Add onions, celery, and bell peppers; sauté until vegetables begin to brown and are almost tender, about 15 minutes. Add chopped garlic, rosemary, and oregano; stir 1 minute. Add raisins and pine nuts; stir 2 minutes. Transfer to bowl with bread. Stir 1/2 cup basil and remaining 1/2 cup Parmesan into stuffing. Season generously with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill neck and main cavities of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 15x10x2-inch glass baking dish, depending on recipe. Add enough extra broth to stuffing to moisten (3/4 cup to 1 1/4 cups). Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer.",
        "Sprinkle remaining 1/4 cup basil over stuffing and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 14.5-ounce loaves country-style white sourdough bread, crusts trimmed, bread cut into 3/4-inch pieces (about 16 cups)",
        "8 tablespoons olive oil",
        "1 1/2 cups freshly grated Parmesan cheese (about 4 1/2 ounces)",
        "1/4 cup (1/2 stick) butter",
        "2 very large red onions, coarsely chopped (about 1 1/2 pounds)",
        "3 1/2 cups coarsely chopped celery",
        "2 large red bell peppers, coarsely chopped",
        "8 garlic cloves, chopped",
        "4 teaspoons chopped fresh rosemary",
        "4 teaspoons dried oregano",
        "3/4 cup raisins",
        "3/4 cup pine nuts, toasted",
        "1/2 to 3/4 cup thinly sliced fresh basil",
        "4 large eggs, beaten to blend",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Parmesan",
        "Raisin",
        "Pine Nut",
        "Fall",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Country-Bread Stuffing with Parmesan, Raisins, and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/country-bread-stuffing-with-parmesan-raisins-and-pine-nuts-105803"
}
