{
    "directions": [
        "Finely shred brisket and transfer to a bowl, then mix with mustard and Worcestershire sauce until combined well.",
        "Roast poblanos on their sides on racks of gas burners over medium-high heat, turning with tongs, until skins are blistered and slightly charred, 4 to 6 minutes. (Or broil on rack of a broiler pan about 2 inches from heat.) Immediately transfer to a large bowl and cover tightly, then let stand 10 minutes. Carefully rub off skins from poblanos. Cut open lengthwise and remove stems and seeds, including attached ribs. Wipe poblanos clean with a paper towel if necessary, then cut into 1/4-inch dice and transfer to a large bowl.",
        "Peel potato, rutabaga, and apple and cut into 1/2-inch cubes, then cook in 1/2 stick butter with 3/4 teaspoon salt and 1/4 teaspoon pepper in a 12-inch heavy skillet over medium heat, stirring occasionally, until golden in spots and just tender, 10 to 12 minutes. Transfer to bowl with poblanos.",
        "Cook onion in 3 tablespoons butter with 1/2 teaspoon salt and 1/4 tsp pepper in same skillet, stirring occasionally, until golden, about 8 minutes. Add bell pepper and cook, stirring occasionally, until just tender, 6 to 8 minutes more. Transfer to bowl with poblano mixture. Stir brisket into hash until combined.",
        "Preheat oven to 250°F with rack in middle.",
        "Heat 1 tablespoon butter in a 12-inch nonstick skillet over medium-high heat until foam subsides. Add half of hash to skillet and cook, turning portions occasionally, until browned and crisp in spots, 12 to 14 minutes. Transfer to a large (17-by 11-inch) 4-sided sheet pan and keep warm in oven. Cook remaining hash in same manner in 1 tablespoon butter. Transfer to sheet pan in oven.",
        "Rinse and wipe out skillet. Fry eggs in 2 batches with 1 tablespoon butter per batch over medium heat. Serve eggs over hash."
    ],
    "ingredients": [
        "Braised beef brisket",
        "1/4 cup Dijon mustard",
        "3 tablespoons Worcestershire sauce",
        "2 medium fresh poblano chiles (1/2 pound total)",
        "1 medium Yukon Gold potato (1/2 pound)",
        "1 medium rutabaga (1/2 pound)",
        "1 medium Fuji or Gala apple",
        "1 stick plus 3 tablespoons unsalted butter, divided",
        "1 small white onion, finely chopped",
        "1 medium red bell pepper, cut into 1/2-inch pieces",
        "6 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Potato",
        "Brunch",
        "Dinner",
        "Brisket",
        "Bell Pepper",
        "Rutabaga",
        "Chile Pepper",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Country Hash",
    "url": "http://www.epicurious.com/recipes/food/views/country-hash-355553"
}
