{
    "directions": [
        "In a shallow bowl, stir together the flour, cornstarch, onion powder, garlic powder, salt, black pepper, and cayenne pepper until thoroughly mixed. Remove 1/3 cup of the flour mixture, and set aside. Gently press the cube steaks into the remaining flour mixture in the bowl until well coated on both sides.",
        "Heat butter and olive oil in a large skillet over medium heat until the foam subsides on the butter. Gently pan-fry the steaks until the coating is browned, about 4 minutes per side. Turn only once. Remove the steaks to a platter.",
        "Spread the onions out into the skillet with the remaining oil and butter, and cook over medium heat until the onions are translucent, 5 to 7 minutes, stirring often. Sprinkle the reserved flour mixture over the onions; cook and stir for 1 more minute, then pour in the beef stock and milk. Bring the mixture to a boil, stirring constantly until the gravy is thickened. Scrape the pan well to dissolve any flavor bits left in the bottom. Return the browned steaks to the gravy mixture, then push them down into the gravy. Cover the skillet, reduce heat to low, and simmer until the steaks are very tender, about 45 minutes, stirring occasionally."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "2 tablespoons cornstarch",
        "1 1/4 teaspoons onion powder",
        "1 1/4 teaspoons garlic powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "4 (4 ounce) beef cube steaks",
        "2 tablespoons unsalted butter",
        "2 tablespoons olive oil",
        "3 very large sweet onions (such as Vidalia®), thinly sliced",
        "2 cups beef stock",
        "1 cup milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Country Fried Steaks with Sweet Onion Gravy",
    "url": "http://allrecipes.com/recipe/215789/country-fried-steaks-with-sweet-onion/"
}
