{
    "directions": [
        "Pat lamb dry. Heat oil in a 7- to 8-quart heavy pot over moderately high heat until hot but not smoking, then brown lamb in 3 batches, transferring to a bowl.",
        "Add onions to pot and cook, stirring occasionally, until golden, about 10 minutes. Stir in lamb with any juices that have accumulated in bowl, tomatoes, tomato juice, salt, black pepper, chile, herbs, and saffron and simmer, covered, 1 1/2 hours.",
        "Stir in carrots, turnips, bell peppers, and pumpkin and simmer, covered, 30 minutes. Stir in zucchini and chickpeas and simmer, covered, until zucchini is tender, 20 to 25 minutes.",
        "Pour 1 cup broth from pot into a small heavy saucepan and add tomato paste, whisking until smooth. Simmer, stirring, until thick, about 10 minutes, then stir in paprika, rose petals, and cayenne.",
        "Bring water to a boil with butter and salt in a 4-quart heavy saucepan. Stir in couscous, cover, and remove from heat. Let stand 5 minutes, then fluff with a fork. Mound couscous on a platter and top with stew, using a slotted spoon. Serve broth and tomato sauce on the side."
    ],
    "ingredients": [
        "2 lb boneless lamb shoulder, trimmed and cut into 1 1/2-inch cubes",
        "1/4 cup olive oil",
        "3 large onions, thinly sliced",
        "8 large tomatoes (4 1/2 lb), peeled, quartered, and seeded",
        "4 cups canned tomato juice",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "1 fresh habanero or cayenne chile, finely chopped, including seeds",
        "1 teaspoon dried thyme",
        "1 teaspoon dried oregano",
        "1/2 teaspoon dried rosemary",
        "1 bay leaf (not California)",
        "Pinch of saffron threads",
        "4 carrots, sliced 1/2 inch thick",
        "4 turnips, peeled and cut into 1/2-inch-wide wedges",
        "3 red or green bell peppers, cut into 1/2-inch pieces",
        "1 lb pumpkin or butternut squash, peeled, seeded, and cut into 1/2-inch cubes",
        "1 1/2 lb zucchini, halved lengthwise and sliced crosswise 1 1/2 inches thick",
        "1 (19-oz) can chickpeas (about 2 cups), rinsed, drained, and skins slipped off",
        "2 tablespoons tomato paste",
        "1/2 teaspoon paprika",
        "1 tablespoon crushed dried rose petals (pesticide-free; optional)*",
        "1/2 teaspoon cayenne, or to taste",
        "4 cups water",
        "2 tablespoons unsalted butter",
        "1 teaspoon salt",
        "2 (10-oz) boxes quick-cooking couscous (3 1/2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Lamb",
        "Onion",
        "Tomato",
        "Stew",
        "Chickpea",
        "Bell Pepper",
        "Carrot",
        "Turnip",
        "Pumpkin",
        "Zucchini",
        "Winter",
        "Couscous",
        "Gourmet"
    ],
    "title": "Couscous with Lamb Stew",
    "url": "http://www.epicurious.com/recipes/food/views/couscous-with-lamb-stew-105503"
}
