{
    "directions": [
        "Combine 1 1/4 cups chicken broth and 2 tablespoons butter in a saucepan. (Set aside remaining chicken broth.) Bring to a boil over medium heat. Stir in couscous, cover, and remove from heat. Let stand until liquid is absorbed, about 10 minutes. Fluff couscous with a fork.",
        "In a frying pan over medium heat, melt the remaining 3 tablespoons butter. Cook onion and garlic in butter until tender, about 5 minutes. Remove pan from heat, and stir in currants, pine nuts, cooked couscous, and cinnamon. Season to taste with salt and pepper. Toss the mixture with as much of the reserved chicken stock as needed to hold together slightly.",
        "Preheat the oven to 350 degrees F (180 degrees C). Lightly oil a roasting pan or large baking dish.",
        "Reserve about 1/3 cup stuffing to sprinkle over the chops. Stuff each chop generously with stuffing, and insert toothpicks to keep the chops closed. Place the pork chops in an oiled roasting pan just large enough to hold them comfortably, and coat each generously with the marmalade. Sprinkle with the reserved stuffing, and press stuffing lightly into the marmalade so that it will stick to the chops.",
        "Bake in the preheated oven until the chops are browned on the outside, but just slightly pink in the center, about 40 to 45 minutes. Transfer the pork chops to warmed individual plates, remove the toothpicks, and serve hot."
    ],
    "ingredients": [
        "1 1/2 cups reduced-sodium chicken broth, divided",
        "5 tablespoons butter, divided",
        "3/4 cup dry couscous",
        "1 small onion, finely chopped",
        "2 cloves garlic, minced",
        "1/2 cup currants",
        "1/2 cup pine nuts",
        "1/8 teaspoon ground cinnamon",
        "salt and freshly ground black pepper",
        "6 boneless pork loin chops, butterflied",
        "1/2 cup orange marmalade"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Couscous-Stuffed Pork Chops",
    "url": "http://allrecipes.com/recipe/133638/couscous-stuffed-pork-chops/"
}
