{
    "directions": [
        "Place the potatoes in a bowl; toss with the salt and pepper until the potatoes are well coated. Heat the oil in a heavy oven-safe skillet and drop in the potatoes carefully, a few at a time.",
        "Flip potatoes several times with tongs during cooking to ensure even browning.",
        "About halfway through cooking, add the onion and mix while cooking. When they're done, the potatoes should be crispy. Sprinkle on the rosemary leaves. Spoon out unwanted oil, if you wish.",
        "While potatoes are cooking, in a nonstick pan, saute the Italian sausage over medium-high heat for a few minutes, or until it is no longer pink.",
        "Add the sausage to the potatoes and onion. Mix it very well and break eggs (sunny side up) into the pan; add few dashes of salt to season eggs. Try to go in between the potatoes, allowing the egg whites to go all around and under potatoes and sausage; try not to break egg yolks. Once the egg whites are getting almost cooked, turn on the broiler to high, and set a baking rack in the middle of the oven.",
        "Place the pan under the broiler and let it cook for a minute or two, just so the egg whites are completely cooked; the yolks may be still a little runny/soft. If you do not like runny/soft eggs just let them cook under broiler longer. Sprinkle chopped chives or scallions on at the end and dig in!"
    ],
    "ingredients": [
        "1 pound new potatoes (red, yellow, purple)",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons vegetable oil",
        "1/4 onion, sliced",
        "1/2 tablespoon minced fresh rosemary leaves",
        "6 ounces ground mild Italian sausage",
        "5 large organic eggs",
        "Garnish:",
        "Chives or scallions, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cowboy Skillet: New Potato Medley, Italian Sausage & Eggs",
    "url": "http://allrecipes.com/recipe/255098/cowboy-skillet-new-potato-medley-it/"
}
