{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F. Generously butter bottom and sides of a 13- by 9-inch baking dish.",
        "Cook sausage in a 12-inch heavy skillet over moderately high heat, stirring frequently and breaking up any large lumps with a fork, until browned, about 10 minutes. Pour off fat from skillet, then cool sausage to room temperature.",
        "Cut half of bread into 1-inch-thick slices and reserve remaining half for another use. Pulse butter (1/2 stick) and garlic in a food processor until smooth. Spread a thin layer of garlic butter on both sides of each bread slice, arranging bread in 1 layer in bottom of baking dish. Sprinkle sausage on top.",
        "Whisk together eggs, milk, salt, and pepper in a large bowl until frothy, then whisk in scallions and half of cheese. Pour egg mixture over sausage (bread will float to the top), pushing down on bread with a spatula to help it absorb liquid. Sprinkle with remaining cheese.",
        "Bake, tightly covered with a large sheet of buttered foil (buttered side down), 30 minutes, then carefully remove foil and bake until top is slightly puffed and custard is set in center, about 20 minutes more. Transfer baking dish to a rack and let stand 10 minutes. Cut into 12 squares and serve immediately."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter, softened, plus additional for greasing baking dish",
        "1 (1-lb) package bulk breakfast sausage (not links)",
        "1 (15-inch-long) loaf Italian bread (about 4 inches wide)",
        "1 garlic clove, chopped",
        "2 dozen large eggs",
        "1 cup whole milk",
        "2 teaspoons salt",
        "1 teaspoon black pepper",
        "1 large bunch scallions",
        "1/4 lb sharp Cheddar, coarsely grated (1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Onion",
        "Breakfast",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Cheddar",
        "Sausage",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Cowboy Christmas Breakfast",
    "url": "http://www.epicurious.com/recipes/food/views/cowboy-christmas-breakfast-233570"
}
