{
    "directions": [
        "Finely grind fennel seeds in grinder, then whisk together with salt, pepper, and lemon juice in a small bowl. Add 1 tablespoon oil in a slow stream, whisking until combined.",
        "Shave fennel bulb with slicer crosswise into paper-thin slices until you have enough to measure 1 packed cup. (Halve bulb lengthwise if too large for slicer.) Toss with 2 teaspoons vinaigrette in another small bowl.",
        "Toss crabmeat with chives and 1 tablespoon vinaigrette in a third small bowl.",
        "Put each metal ring in center of a salad plate. Divide crab mixture between them, pressing down on it lightly with your fingertips.",
        "Toss lettuces with fennel mixture and divide between rings, pressing slightly without flattening tops.",
        "Drizzle remaining vinaigrette and remaining tablespoon oil around plates. Remove rings before serving."
    ],
    "ingredients": [
        "1/2 teaspoon fennel seeds",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 1/2 tablespoons fresh lemon juice",
        "2 tablespoons mild extra-virgin olive oil",
        "1 small fennel bulb (sometimes labeled \"anise\"; 6 to 8 oz), stalks cut off and discarded",
        "1/4 lb jumbo lump crabmeat (about 1/2 cup), picked over",
        "2 teaspoons chopped fresh chives",
        "1 cup baby lettuces (preferably red, such as amaranth, lolla rossa, and red basil) or mâche (lamb's lettuce)",
        "Special equipment: an electric coffee/spice grinder; an adjustable-blade slicer; 2 (3-inch) metal entremet (pastry) rings at least 2 inches high or 2 clean empty cans with top and bottom removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Leafy Green",
        "Herb",
        "No-Cook",
        "Valentine's Day",
        "Gourmet"
    ],
    "title": "Crab and Fennel Salad",
    "url": "http://www.epicurious.com/recipes/food/views/crab-and-fennel-salad-237183"
}
