{
    "directions": [
        "Whisk flour, 1 egg, salt, and baking powder together in a bowl; Add butter-flavored shortening into flour mixture and combine by hand until mixture resembles coarse crumbs. Stir ice water into the mixture, adding enough so the dough just holds together. Form dough into a ball, wrap in waxed paper, and refrigerate 30 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Generously flour a large sheet of waxed paper and roll the dough out to an even circle about 11 inches across; fit crust into a 9-inch pie dish. Press edges of dough gently over rim of crust.",
        "Bake the crust in the preheated oven until lightly browned, 6 to 7 minutes.",
        "Reduce oven heat to 375 degrees F (190 degrees C).",
        "Heat butter in a large skillet over medium heat; cook and stir mushrooms, green onions, and red bell pepper in the hot butter until vegetables soften, about 7 minutes; stir in garlic and cook a few minutes more. Season vegetables with salt and black pepper.",
        "Whisk cream, eggs, celery salt, and hot sauce together in a bowl until thoroughly combined; stir crabmeat and mushroom mixture into egg mixture. Crumble about 3/4 of the herb cheese spread into the bottom of the crust and pour crabmeat mixture over the cheese spread. Crumble remaining herb cheese spread into crabmeat filling and spread Italian cheese blend over the top.",
        "Bake in the oven until crabmeat filling is set and cheese topping is lightly golden brown, 30 to 35 minutes."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 egg",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking powder",
        "1/2 cup butter-flavored shortening",
        "3 tablespoons ice water, or as needed",
        "2 tablespoons butter",
        "8 cremini mushrooms, thinly sliced",
        "4 green onions, chopped",
        "1/2 red bell pepper, diced",
        "1/4 teaspoon minced garlic",
        "salt and ground black pepper to taste",
        "1 cup heavy whipping cream",
        "3 eggs",
        "1 pinch celery salt",
        "3 dashes hot pepper sauce (such as Frank's RedHot®), or to taste",
        "1 (8 ounce) can lump crabmeat, drained",
        "1/2 (5.2 ounce) package garlic and herb cheese spread (such as Boursin®)",
        "3/4 cup shredded Italian cheese blend"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crab and Mushroom Quiche",
    "url": "http://allrecipes.com/recipe/229199/crab-and-mushroom-quiche/"
}
