{
    "directions": [
        "Cut kernels off corn cobs. Set kernels aside. Combine cobs, broth, and cream in heavy large saucepan. Simmer 5 minutes. Remove from heat.",
        "Heat oil in heavy large pot over medium-high heat. Add bacon and sauté until crisp, about 8 minutes. Transfer bacon to paper towels to drain. Pour off all but 3 tablespoons pan drippings; add onion, leeks, celery, and fennel seeds to pot. Sauté until vegetables are crisp-tender, about 4 minutes. Stir in potatoes. Discard cobs from cream mixture; strain cream mixture into potato mixture. Simmer until potatoes are almost tender, stirring occasionally, about 10 minutes. Stir in corn kernels. Simmer chowder until potatoes are tender, about 5 minutes longer.",
        "Meanwhile, melt butter in heavy large skillet over medium heat. Add mushrooms and sauté until tender, about 5 minutes. Stir in Sherry and thyme. Add mushroom mixture to chowder. Season to taste with salt and pepper.",
        "Sauté crabmeat in same large skillet over medium-low heat just until heated through, about 3 minutes. Divide crabmeat, reserved bacon, and parsley among bowls. Ladle chowder over and serve."
    ],
    "ingredients": [
        "6 ears fresh yellow corn",
        "4 cups low-salt chicken broth",
        "3 cups whipping cream",
        "2 tablespoons olive oil",
        "7 bacon slices, cut crosswise into 1/4-inch-wide strips",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups finely chopped leeks (white and pale green parts only; about 2 medium)",
        "3/4 cup finely chopped celery",
        "1 teaspoon fennel seeds",
        "1 3/4 pounds white-skinned potatoes, peeled, cut into 1/2-inch cubes",
        "2 tablespoons (1/4 stick) butter",
        "6 ounces fresh chanterelle mushrooms, thickly sliced",
        "2 tablespoons dry Sherry",
        "1 teaspoon fresh thyme leaves",
        "1 pound fresh crabmeat",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mushroom",
        "Pork",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Stew",
        "Crab",
        "Fall",
        "Winter",
        "Simmer"
    ],
    "title": "Crab-and-Corn Chowder with Bacon and Chanterelle Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/crab-and-corn-chowder-with-bacon-and-chanterelle-mushrooms-107620"
}
