{
    "directions": [
        "Turn on broiler. Whisk together oil and vinegar in a bowl. Season with salt and pepper; set aside. Place asparagus on a baking sheet with sides and spray with cooking spray; roll each spear until fully coated in oil. Broil asparagus 8 to 10 minutes or until spears begin to brown. Remove from baking sheet and set aside to cool. Meanwhile, combine shallots and tomatoes in a bowl. Season with salt and pepper; set aside. In a separate bowl, combine crabmeat, cucumbers and chives. Season with salt and pepper; set aside. Place bell peppers in a separate bowl; drizzle with 2 teaspoons reserved vinaigrette; set aside. In a separate bowl, combine yogurt, lime juice and cilantro. Season with salt and pepper; set aside. Chop asparagus into 1-inch pieces. Place tomato mixture on the bottom of each of 4 plates. Top with a layer of the crab; add a layer of peppers (save some for garnish), then asparagus. Top each with 1 1/2 teaspoons yogurt dressing. Sprinkle with peppers. Spoon remaining vinaigrette over salad."
    ],
    "ingredients": [
        "3 tablespoon extra-virgin olive oil",
        "2 tablespoon aged balsamic vinegar",
        "Sea salt",
        "Coarsely ground black pepper",
        "12 spears asparagus, ends trimmed 2 inches",
        "Vegetable oil cooking spray",
        "2 shallots, minced",
        "8 heirloom tomatoes, seeded and diced",
        "2 cups crabmeat, chopped",
        "2 cucumbers, seeded and diced",
        "2 tablespoon finely chopped chives",
        "2 cups diced red, yellow or purple bell peppers",
        "2 tablespoon nonfat plain yogurt",
        "Juice of half a lime",
        "2 tablespoon minced fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Herb",
        "Onion",
        "Pepper",
        "Vegetable",
        "Broil",
        "Yogurt",
        "Summer",
        "Healthy",
        "Self"
    ],
    "title": "Crab with Asparagus and Heirloom Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/crab-with-asparagus-and-heirloom-tomatoes-236044"
}
