{
    "directions": [
        "Make the crab cakes: Place half of the cracker crumbs in a large bowl. Drizzle in the egg, then stir in the mayonnaise, Worcestershire sauce, lemon juice, parsley, celery leaves, celery seeds, mustard powder, chili powder, 1/2 teaspoon salt, and pepper to taste. Gently fold in the crabmeat. Form into six 3-inch-wide patties (about 1/2 cup crab mixture each). Spread the remaining cracker crumbs on a plate; press the crab cakes in the crumbs on both sides and around the edges. Transfer to a baking sheet. Cover and refrigerate until firm, 2 to 6 hours.",
        "Make the sauce: Mix the mayonnaise, lemon juice, pickles, Worcestershire sauce, hot sauce and scallions in a small bowl. Season with salt and pepper. Cover and refrigerate until ready to serve.",
        "Position a rack in the upper third of the oven and preheat to 450 degrees F. Brush the crab cakes with the 6 tablespoons melted butter and bake until golden, 15 to 20 minutes.",
        "Meanwhile, make the salad: Gently toss the lettuce, endive, tomatoes, celery, scallions, chervil and parsley in a large bowl; drizzle with the olive oil, season with salt and pepper and toss again. Serve with the crab cakes and sauce.",
        "Photograph by Anna Williams"
    ],
    "ingredients": [
        "24 saltine crackers, crushed into coarse crumbs (about 1 cup)",
        "1 large egg, beaten",
        "1/2 cup mayonnaise",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon fresh lemon juice",
        "1 tablespoon minced fresh parsley",
        "1 tablespoon minced celery leaves",
        "1/4 teaspoon celery seeds",
        "1 teaspoon mustard powder",
        "1/4 teaspoon chili powder",
        "Kosher salt and freshly ground pepper",
        "1 pound jumbo lump crabmeat, picked over",
        "6 tablespoons unsalted butter, melted",
        "1 cup mayonnaise",
        "Juice of 1/2 lemon",
        "3 tablespoons minced dill pickles",
        "1 tablespoon Worcestershire sauce",
        "1/2 teaspoon hot sauce",
        "2 scallions, minced",
        "Kosher salt and freshly ground pepper",
        "1 large head Boston lettuce, cut into chunks",
        "4 heads red or regular endive, quartered lengthwise",
        "1 cup cherry tomatoes, halved",
        "4 inner stalks celery, leaves coarsely chopped, stems diced",
        "4 scallions, halved lengthwise and cut into 1 1/2-inch pieces",
        "1/2 cup fresh chervil, tarragon and/or dill (leaves and tender stems)",
        "1/2 cup fresh parsley leaves",
        "1/4 cup extra-virgin olive oil",
        "Kosher salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Crab Salad",
        "Crab Recipes",
        "Salad Recipes",
        "Shellfish Recipes"
    ],
    "title": "Crab Cakes With Herb Salad",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/crab-cakes-with-herb-salad-recipe"
}
