{
    "directions": [
        "Cover mushrooms with hot water by 1 inch in a bowl and soak 20 minutes (mushrooms will expand). Drain in a fine-mesh sieve and rinse thoroughly, then drain again. Trim off and discard any hard parts from mushrooms, then finely chop. (You should have about 3 tablespoons.)",
        "Stir together mushrooms, pork, crabmeat, beaten whole egg, cilantro, ginger, scallion, garlic, and salt in a bowl until combined well.",
        "Line a tray with wax paper. Put a double thickness of paper towels on a work surface and fill a shallow baking pan with warm water. Discard any rice-paper wedges with holes. Soak 1 wedge in warm water until pliable, 30 seconds to 1 minute, then carefully transfer to paper towels, arranging it with curved side of wedge nearest you.",
        "Put 1 tablespoon filling in middle of curved side about 1/2 inch from edge and shape filling horizontally into a 2 3/4-inch log. Fold left and right corners of wedge over filling, overlapping slightly and aligning bottom edges. (Wedge will resemble an open envelope.)",
        "Dab top corner with some yolk, then tightly roll up wedge away from you, making sure ends stay tucked inside. (Be sure to roll up wedges tightly or air pockets will prevent rolls from browning evenly when fried.) Put roll, seam side down, on tray and loosely cover with plastic wrap. Make more rolls in same manner, transferring to tray and arranging 1/2 inch apart. Keep loosely covered until ready to fry.",
        "Heat about 1 inch of oil in a 5- to 6-quart pot over moderately high heat until it registers 365°F on thermometer. Fry rolls in batches of 5 or 6, keeping rolls apart during first minute of frying to prevent sticking and stirring occasionally, until golden brown and cooked through, 5 to 6 minutes. Transfer as fried with a slotted spoon to paper towels to drain. (Return oil to 365°F between batches.)",
        "*Found in Asian markets and adrianascaravan.com."
    ],
    "ingredients": [
        "1/2 oz dried wood ear mushrooms (about 2)",
        "6 oz ground fatty pork (from shoulder)",
        "1/4 lb jumbo lump crabmeat, picked over",
        "1 whole large egg, lightly beaten, plus 1 large egg yolk, lightly beaten separately",
        "1/4 cup chopped fresh cilantro",
        "1 tablespoon finely grated peeled fresh ginger",
        "1 scallion, finely chopped",
        "2 small garlic cloves, finely chopped",
        "Rounded 1/4 teaspoon salt",
        "30 Vietnamese rice-paper wedges*",
        "About 6 cups peanut or vegetable oil",
        "Special equipment: a deep-fat thermometer",
        "Accompaniment: nuoc cham dipping sauce ."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Ginger",
        "Mushroom",
        "Pork",
        "Appetizer",
        "Fry",
        "Cocktail Party",
        "Oscars",
        "Crab",
        "Summer",
        "Cilantro",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crab-and-Pork Spring Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/crab-and-pork-spring-rolls-234983"
}
