{
    "directions": [
        "Prepare grill (moderately high heat).",
        "Brush corn with olive oil. Grill ears until kernels soften and develop grill marks, about 15 minutes. Remove from heat. When cool enough to handle, use large knife to cut kernels from cobs. Set aside.",
        "In heavy, large pot over moderate heat, sauté bacon until crisp, about 14 to 16 minutes. Add onions, garlic, shallots, celery, and bay leaves and sauté until translucent, about 7 to 9 minutes. Add butter and heat until melted, less than 1 minute. Using wooden spoon, stir in flour and cook, stirring constantly, until smooth, about 3 minutes. Lower heat to moderately low and continue to cook, stirring constantly, until paste is color of peanut butter, about 6 minutes.",
        "Whisk in milk and cream, then add potatoes. Raise heat to high and bring to simmer, then reduce heat to moderately low and simmer, uncovered, until soup thickens and potatoes are tender, about 17 to 19 minutes.",
        "Stir in maple syrup, thyme, basil, and chives. Gently stir in crab meat, corn, salt, and pepper. Serve immediately."
    ],
    "ingredients": [
        "4 ears corn, shucked",
        "2 tablespoons olive oil",
        "1 pound bacon, diced",
        "2 medium onions, diced (about 2 cups)",
        "8 cloves garlic, minced",
        "4 shallots, minced",
        "2 stalks celery, diced",
        "2 dried bay leaves",
        "1/2 cup (1 stick) unsalted butter",
        "1 cup all-purpose flour",
        "4 cups whole milk",
        "2 cups heavy cream",
        "2 cups Yukon gold potatoes, peeled and diced (about 2 large potatoes)",
        "3 tablespoons maple syrup (1 1/2 ounces)",
        "2 tablespoons fresh thyme leaves (from about 4 sprigs)",
        "2 tablespoons fresh basil leaves, chopped",
        "2 tablespoons fresh chives, chopped",
        "1 pound fresh lump crab meat, picked over",
        "1 tablespoon kosher salt",
        "2 tablespoons freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Potato",
        "Shellfish",
        "Christmas",
        "Thanksgiving",
        "Bacon",
        "Seafood",
        "Crab",
        "Corn",
        "Fall",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Crab-Corn Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/crab-corn-chowder-236463"
}
