{
    "directions": [
        "Mix garlic, 1 teaspoon salt, and turmeric in bowl. Place crab on rimmed baking sheet; smear garlic mixture over. Cover; chill 2 hours.",
        "Heat medium skillet over medium heat. Add chiles and next 7 ingredients; stir until toasted, about 3 minutes. Transfer to spice grinder; cool. Add coconut to skillet and stir until light brown, about 5 minutes; cool. Add 1/3 cup coconut to spices in grinder; blend well. Add remaining coconut, 1/3 cup at a time, grinding finely.",
        "Heat oil in large deep skillet over medium heat. Add onions; saute until golden, about 20 minutes. Add crabs and coconut-spice mixture; reduce heat to low. Cook until heated, tossing with tongs, about 5 minutes. Add coconut milk and 1/2 cup water; bring to simmer. Cover; simmer 15 minutes, turning often. Transfer crab to platter. Serve with lime wedges and rice.",
        "*This bright red chile is available at some supermarkets, specialty foods stores, and Latin markets.",
        "**Sold at some supermarkets, specialty foods stores, and natural foods stores."
    ],
    "ingredients": [
        "4 garlic cloves, pressed",
        "1 teaspoon salt",
        "1/2 teaspoon ground turmeric",
        "2 cooked Dungeness crabs (4 1/2 pounds total), cleaned, cracked, each cut into 8 pieces",
        "5 dried chiles de árbol*",
        "8 whole black peppercorns",
        "5 whole cloves",
        "1 teaspoon coriander seeds",
        "1 teaspoon aniseed",
        "1 teaspoon cumin seeds",
        "1/2 cinnamon stick",
        "1/8 teaspoon ground nutmeg",
        "1 cup unsweetened shredded coconut**",
        "1/4 cup vegetable oil",
        "2 1/2 cups finely chopped onions",
        "1 cup canned unsweetened coconut milk**",
        "1/2 cup water",
        "Lime wedges",
        "Steamed rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Shellfish",
        "Dinner",
        "Coconut",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Crab Sauté with Spicy Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crab-saute-with-spicy-coconut-sauce-237094"
}
