{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F. Line a baking sheet with foil.",
        "Pulse avocado with mayonnaise, lime juice, salt, sugar, and one fourth of chile in a food processor until chile is finely chopped. Add milk and purée until smooth. Add more chile if desired, processing until smooth. Transfer sauce to a bowl and chill, covered.",
        "Stir together crabmeat, mayonnaise, chives, lemon juice, mustard, pepper, and 1 tablespoon panko in a large bowl until blended well, then chill, covered.",
        "Melt butter in a medium nonstick skillet over moderate heat, then cook garlic, stirring, until golden and fragrant, about 2 minutes. Add herbes de Provence, salt, and remaining 7 tablespoons panko and cook, stirring, until golden brown, about 6 minutes. Transfer crumbs to a plate to cool. Discard garlic.",
        "Divide crabmeat mixture into 4 mounds on a sheet of wax paper. Form 1 mound into a patty, then carefully turn patty in crumb mixture to coat top and bottom. Transfer to a baking sheet and repeat with remaining 3 mounds, then sprinkle remaining crumbs on top of crab cakes. Bake until heated through, about 15 minutes. Serve crab cakes with sauce."
    ],
    "ingredients": [
        "1/2 ripe medium California avocado, pitted and peeled",
        "1 tablespoon low-fat mayonnaise",
        "1 tablespoon fresh lime juice",
        "1/4 teaspoon salt",
        "1/4 teaspoon sugar",
        "1 fresh jalapeño or serrano chile (including seeds), stemmed and quartered lengthwise",
        "1/4 cup fat-free (skim) milk",
        "1 pound jumbo lump crabmeat, picked over and coarsely shredded",
        "3 tablespoons low-fat mayonnaise",
        "1/4 cup minced fresh chives",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon Dijon mustard",
        "1/4 teaspoon black pepper",
        "1/2 cup panko (Japanese bread crumbs)",
        "1 tablespoon unsalted butter",
        "2 garlic cloves, smashed",
        "1/2 teaspoon herbes de Provence or 1/4 teaspoon dried thyme",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Shellfish",
        "Bake",
        "Low Fat",
        "Crab",
        "Avocado",
        "Healthy",
        "Chive",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Crab Cakes with Spicy Avocado Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crab-cakes-with-spicy-avocado-sauce-109310"
}
