{
    "directions": [
        "Cut skin from mango and cut flesh into julienne strips. Pick over crab meat to remove any bits of cartilage and shell and in a bowl stir together with lime juice, brown sugar, and salt to taste. If using wasabi powder, in a small bowl stir together with 2 teaspoons water and let stand, covered, 10 minutes to make wasabi paste.",
        "Cut nori sheets in half lengthwise. On a work surface put a sushi mat (see above note) with bamboo strips of mat parallel to front of work surface. (Alternatively, use a 9-inch square of heavy-duty foil as a mat.) Put 1 nori piece on mat with a short side lined up with edge of mat that is closest to you. Spread 1/4 teaspoon wasabi paste across bottom edge of nori and top with 5 or 6 mint leaves so that some stick out on each side. Top mint leaves evenly with a heaping tablespoon crab mixture and 2 or 3 mango strips. Beginning with a short side and using mat as a guide, roll up nori tightly (use mat to help tighten roll). Seal seam with a little water and with a sharp knife cut roll crosswise into 3 pieces. Make more rolls in same manner. Nori rolls may be made 3 hours ahead and chilled, covered."
    ],
    "ingredients": [
        "1/2 firm-ripe mango",
        "1 pound jumbo lump crab meat",
        "2 tablespoons fresh lime juice",
        "1 tablespoon packed light brown sugar",
        "2 tablespoons wasabi powder* or wasabi paste*",
        "ten 8 x 7 1/2-inch sheets toasted nori*",
        "1 cup packed fresh mint leaves",
        "*available at Asian markets and some specialty foods shops and supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Shellfish",
        "Appetizer",
        "No-Cook",
        "Cocktail Party",
        "Picnic",
        "Lunch",
        "Tropical Fruit",
        "Mango",
        "Mint",
        "Seafood",
        "Crab",
        "Summer",
        "Healthy",
        "Gourmet",
        "Fat Free",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crab, Mango, and Mint Nori Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/crab-mango-and-mint-nori-rolls-100728"
}
