{
    "directions": [
        "Mix all ingredients in large bowl to blend. Cover and chill at least 1 hour or overnight to develop flavors.",
        "Mix mayonnaise, mustard, lemon peel and hot pepper sauce in medium bowl to blend. Mix in crabmeat. Season to taste with salt and pepper. Shape crab mixture into six 2 1/4-inch-diameter patties, using 1/4 cup mixture for each. Place fritters on baking sheet. Cover and refrigerate at least 3 hours.",
        "Cut all peel and white pith from grapefruits. Using small sharp knife, cut between membranes to release segments. Repeat with oranges. Chill segments until ready to serve.",
        "Place panko in shallow dish. Cost each fritter with panko, pressing to adhere. Pour oil into heavy large skillet to depth of 1/2 inch and heat to 350°F. Cook fritters in batches until brown and heated through, about 2 minutes per side. Drain fritters on paper towels.",
        "Fan avocado slices and grapefruit and orange segments on plates. Drizzle 1 tablespoon sauce over each plate. Top each with 1 fritter. Sprinkle cilantro and chives over and serve."
    ],
    "ingredients": [
        "1/2 cup fresh lime juice",
        "6 tablespoons fish sauce (nam pla)",
        "1/4 cup pure maple syrup",
        "3 jalapeño chillies, seeded, chopped",
        "2 garlic cloves, chopped",
        "1/4 cup mayonnaise",
        "1 tablespoon Dijon mustard",
        "1/2 teaspoon grated lemon peel",
        "8 ounces fresh crabmeat, drained",
        "2 grapefruits",
        "2 oranges",
        "1 1/2 cupspanko (japanese breadcrumbs)",
        "2 firm but ripe avocados, halved, pitted, peeled, sliced",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Fry",
        "Lime",
        "Crab",
        "Avocado"
    ],
    "title": "Crab Fritters with Spicy Lime Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crab-fritters-with-spicy-lime-sauce-4279"
}
