{
    "directions": [
        "Place the 2 tablespoons butter, 2 tablespoons oil, onion, celery, red and yellow bell peppers, parsley, capers, hot pepper sauce, Worcestershire sauce, crab boil seasoning, salt, and pepper in a large saute pan over medium-low heat and cook until the vegetables are soft, approximately 15 to 20 minutes. Cool to room temperature. In a large bowl, break the lump crabmeat into small pieces and toss with the bread crumbs, mayonnaise, mustard, and eggs. Add the cooked mixture and mix well. Cover and chill in the refrigerator for 30 minutes. Shape into bite-sized crab cakes.",
        "Heat the butter and olive oil for frying over medium heat in a large saute pan. Add the crab cakes and fry for 4 to 5 minutes on each side, until browned. Drain on paper towels; keep them warm in a 250 degree oven and serve hot."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "2 tablespoons olive oil",
        "3/4 cup small diced red onion (1 small onion)",
        "1 1/2 cups small diced celery (4 stalks)",
        "1/2 cup small diced red bell pepper (1 small pepper)",
        "1/2 cup small diced yellow bell pepper (1 small pepper)",
        "1/4 cup minced fresh flat-leaf parsley",
        "1 tablespoon capers, drained",
        "1/4 teaspoon hot pepper sauce (recommended: Tabasco)",
        "1/2 teaspoon Worcestershire sauce",
        "1 1/2 teaspoons crab boil seasoning (recommended: Old Bay)",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 pound lump crabmeat, drained and picked to remove shells",
        "1/2 cup plain dry bread crumbs",
        "1/2 cup good mayonnaise",
        "2 teaspoons Dijon mustard",
        "2 extra-large eggs, lightly beaten",
        "For frying",
        "4 tablespoons unsalted butter",
        "1/4 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Crab Cake",
        "Celery",
        "Vegetable",
        "Crab Recipes",
        "Shellfish Recipes",
        "Appetizer",
        "Lunch",
        "Recipes for Parties"
    ],
    "title": "Crab Cakes",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/crab-cakes-recipe"
}
