{
    "directions": [
        "Make Crab Stuffing:  Heat 2 tablespoons olive oil in a large skillet. Saute onion, green onion, garlic, celery, and green pepper until tender. Stir in shrimp stock, crab meat, bread crumbs, and Cajun seasoning. Remove from heat, and set aside.",
        "Prepare Peppercorn Sauce:  In a small saucepan over medium heat, combine beef broth and cracked black pepper. Simmer until reduced to 1 cup, stirring frequently. Add1 ounce whiskey and 1 cup cream. Continue simmering until reduced to 1 cup. Remove from heat, and set aside.",
        "Prepare Steaks:  Slice a pocket into the side of each steak, and stuff generously with crab stuffing. Wrap bacon around side, and secure with toothpicks. Season to taste with salt and pepper; set aside. Heat olive oil in a large cast iron skillet over medium heat. Saute garlic and shallot for 1 minute. Stir in mushrooms, and saute until tender. Remove mushroom mixture, and set aside.",
        "Place steaks in skillet, and cook to desired doneness. Remove from skillet, and keep warm. Deglaze skillet with 1 ounce whiskey. Reduce heat, and stir in peppercorn sauce and Dijon mustard. Add mushroom mixture, and reduce sauce until thickened. Remove toothpicks and bacon from steaks, and arrange steaks on a plate. Top with sauce."
    ],
    "ingredients": [
        "CRAB STUFFING:",
        "2 tablespoons olive oil",
        "1 teaspoon minced onion",
        "1 teaspoon minced green onion",
        "1 teaspoon minced garlic",
        "1 teaspoon minced celery",
        "1 teaspoon minced green bell pepper",
        "2 tablespoons shrimp stock or water",
        "1 (6 ounce) can crab meat, drained",
        "2 tablespoons bread crumbs",
        "1 teaspoon Cajun seasoning",
        "PEPPERCORN SAUCE",
        "1 1/4 cups beef broth",
        "1 teaspoon cracked black pepper",
        "1 fluid ounce whiskey",
        "1 cup heavy cream",
        "STEAKS:",
        "4 (6 ounce) filet mignon steaks",
        "4 slices bacon, cooked lightly",
        "salt and cracked black pepper to taste",
        "1 tablespoon olive oil",
        "1 clove garlic, minced",
        "1 teaspoon minced shallot",
        "1 cup crimini mushrooms, sliced",
        "1 fluid ounce whiskey",
        "1 teaspoon Dijon mustard"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crab-Stuffed Filet Mignon with Whiskey Peppercorn Sauce",
    "url": "http://allrecipes.com/recipe/46815/crab-stuffed-filet-mignon-with-whiske/"
}
