{
    "directions": [
        "Heat 1/4 cup olive oil in heavy large wide pot over medium-high heat. Add crab shells and sauté until fragrant, about 10 minutes. Add 10 cups water and next 8 ingredients; bring to boil. Reduce heat to medium-low. Simmer until broth is reduced to 12 cups, about 30 minutes. Strain broth through sieve lined with cheesecloth. Cool. Spoon fat from top of broth.",
        "Char red bell peppers over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel and seed peppers. Transfer peppers to blender. Add 2 tablespoons butter. Puree until mixture is smooth.",
        "Melt 3 tablespoons butter in heavy large pot over medium heat. Add flour and cook until mixture is golden brown, stirring occasionally, about 2 minutes. Gradually whisk in broth, then red pepper purée. Bring soup to boil. Simmer until flavors blend and soup thickens slightly, about 10 minutes. Season to taste with salt and pepper. (Soup can be made 1 day ahead. Cover and refrigerate.)",
        "Add reserved crabmeat and 1/2 cup chopped parsley to soup. Simmer just until crabmeat is heated through, about 2 minutes. Ladle soup into bowls. Spoon dollop of crème fraîche atop each. Garnish with parsley sprigs and serve."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 1 1/2-pound cooked whole crabs, meat removed, shells coarsely broken, meat and shells reserved",
        "10 cups water",
        "1 750-ml bottle of dry white wine",
        "3 cups bottled clam juice",
        "4 celery stalks, chopped",
        "3 carrots, chopped",
        "2 onions, chopped",
        "1 cup chopped fresh parsley",
        "2 fresh thyme sprigs",
        "2 bay leaves",
        "2 red bell peppers",
        "5 tablespoons butter, room temperature",
        "3 tablespoons all purpose flour",
        "1/2 cup chopped fresh Italian parsley",
        "10 tablespoons crème fraîche or sour cream",
        "Fresh Italian parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pepper",
        "Shellfish",
        "Crab",
        "Summer"
    ],
    "title": "Crab and Roasted Red Bell Pepper Soup",
    "url": "http://www.epicurious.com/recipes/food/views/crab-and-roasted-red-bell-pepper-soup-101705"
}
