{
    "directions": [
        "Preheat oven to 400°F. Place 1 phyllo sheet on work surface; cover remaining phyllo. Brush phyllo sheet with melted butter. Top with second phyllo sheet and brush with butter. Repeat layering 1 more time. Top with fourth phyllo sheet. Cut phyllo stack into 12 squares. Arrange squares on large baking sheet. Bake until golden, about 6 minutes. Cool completely.",
        "Mix crabmeat and next 4 ingredients in large bowl. Season to taste with salt and pepper. Set aside.",
        "Mix cream, mustard and sour cream in small bowl to blend. Season with salt and pepper. (Can be made 1 day ahead. Store phyllo squares in airtight container. Cover crab mixture and mustard sauce separately and refrigerate.)",
        "Mix cucumber, dill and olive oil in medium bowl. Season with salt and pepper. Let stand 30 minutes.",
        "Place 1 phyllo square in center of each of 4 plates. Top each with 1/4 cup crab mixture, then 1/4 cup cucumber. Drizzle 1 teaspoon chutney over each. Repeat layering with phyllo square, crab mixture, cucumber and chutney. Top each with third phyllo square. Drizzle mustard sauce around stacks."
    ],
    "ingredients": [
        "4 sheets phyllo pastry",
        "1/4 cup (1/2 stick) butter, melted",
        "8 ounces flaked crabmeat",
        "1/2 cup finely chopped red onion",
        "1/3 cup mayonnaise",
        "1/4 cup chopped fresh chives",
        "1 tablespoon fresh lime juice",
        "1/4 cup whipping cream",
        "2 tablespoons Dijon mustard",
        "2 tablespoons sour cream",
        "1/2 English hothouse cucumber, cut into matchstick-size strips",
        "1 tablespoon chopped fresh dill",
        "1 tablespoon olive oil",
        "8 teaspoons mango chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Mustard",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Cocktail Party",
        "Oscars",
        "Seafood",
        "Crab",
        "Cucumber",
        "Fall",
        "Shower",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crab and Cucumber Pastries with Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crab-and-cucumber-pastries-with-mustard-sauce-4803"
}
