{
    "directions": [
        "In a small stockpot, heat the oil over medium heat. Saute the artichokes, sausage and onions until lightly colored, about 5 minutes. Add 12 cups (3 quarts) water, the potatoes, crab boil spice mix, salt, hot sauce, pepper, bay leaves and jalapenos. Cover the pot and bring to a boil. Reduce the heat, add the corn and cover. Cook until the corn is tender, about 10 minutes. Add the crab and cook about 7 minutes. Strain the boil through a colander. Plate immediately on a large serving dish. Garnish with sliced green onions or your favorite fresh herb. Serve with the Garlic Bread.",
        "Position an oven rack in the top of the oven and preheat the broiler.",
        "In a small bowl, mix the butter together with the Parmesan, parsley, garlic and scallions; add hot sauce, salt and pepper to taste. Spread the butter mixture on both halves of the baguette. Place on a sheet pan and toast under the broiler, about 2 minutes."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "1 pound baby artichokes (about 8 small), trimmed and halved",
        "10 ounces andouille sausage, cut into 1-inch rounds",
        "1 1/2 cups cippolini onions, peeled and halved",
        "1 pound small red potatoes",
        "3 tablespoons crab boil spice mix, such as Zatarain's",
        "1 tablespoon kosher salt",
        "1 teaspoon hot sauce, such as Crystal",
        "1 teaspoon ground black pepper",
        "3 bay leaves",
        "1 jalapeno, diced",
        "2 ears of corn (about 1 pound), cut into thirds",
        "3 pounds live crab, purged in water to remove any debris",
        "3 green onions, sliced, for garnish (or your favorite fresh herb)",
        "Garlic Bread, recipe follows",
        "2 sticks butter, softened",
        "1 tablespoon Parmesan",
        "1 tablespoon finely chopped fresh parsley",
        "2 cloves garlic, minced",
        "1 scallion, minced",
        "Hot sauce",
        "Salt and freshly cracked black pepper",
        "1 French baguette, sliced horizontally"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Andouille Sausage",
        "Sausage Recipes",
        "Crab Recipes",
        "Shellfish Recipes",
        "Main Dish Recipes"
    ],
    "title": "Crab Boil",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/crab-boil-recipe"
}
