{
    "directions": [
        "Bring the vegetable stock to a boil. Add the white wine and lower to a simmer.",
        "In a large, heavy-based saucepan or Dutch oven, heat 2 tablespoons butter over medium-high heat. Add the onion, lower the heat to medium, and cook, stirring occasionally, until tender, about 7 minutes. Add the garlic and cook for another 2 minutes. Add the rice and cook, stirring well to coat the rice, for about a minute. Add about 1 cup of the hot stock and stir gently with long, slow strokes until most of the liquid is absorbed. Add another cup of stock and cook, stirring, until almost all of that stock has been absorbed. Continue cooking the rice in this way until you've used about 3 cups of the stock. Season the rice with salt and pepper to taste at any time during the cooking.",
        "Add the peas, scallions, and about 1 1/2 cups of the hot stock and continue to cook, stirring, until most of the liquid has been absorbed. Taste the rice. If it is still very hard, add more stock and continue to cook until it is almost but not quite tender. Add the remaining butter, crabmeat, chopped mint, lemon zest, Parmesan cheese, and another cup of liquid. Cook, stirring, until the crabmeat is heated through, most of the liquid is absorbed, and the rice is plump, chewy, and just slightly firm to the bite. Divide the risotto among warm bowls and garnish with mint leaves, if you wish."
    ],
    "ingredients": [
        "5 to 6 cups vegetable stock or water",
        "1 cup dry white wine",
        "3 to 4 tablespoons unsalted butter",
        "1 small onion, finely chopped",
        "3 garlic cloves, finely chopped",
        "1 1/2 cups Arborio rice",
        "Kosher salt and freshly ground black pepper",
        "3 cups fresh or frozen peas",
        "1 bunch scallions, white parts and 2 inches of the green tops, cut into thin rounds",
        "6 to 8 ounces fresh crabmeat, preferably lump crabmeat",
        "4 to 6 leaves of fresh mint, roughly chopped, plus a few whole leaves for garnish",
        "1 teaspoon grated lemon zest",
        "About 1/4 cup Parmesan cheese, preferably Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Cheese",
        "Rice",
        "Shellfish",
        "Mother's Day",
        "Dinner",
        "Mint",
        "Seafood",
        "Crab",
        "Pea",
        "Simmer",
        "Boil",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crabmeat Risotto with Peas and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/crabmeat-risotto-with-peas-and-mint-358316"
}
