{
    "directions": [
        "To make sauce, combine all ingredients in a medium bowl and whisk well. Cover and hold in refrigerator.",
        "To make crab cakes, combine mayonnaise, egg, red onion and parsley in a large bowl, stirring well with a fork.",
        "Add crab, 1 cup bread crumbs, mustard, salt, pepper, paprika and cayenne. Stir until combined; the mixture will be fairly loose and wet.",
        "Shape mixture into 8 patties of equal size. Coat each patty in remaining bread crumbs to make a crust.",
        "In a large skillet, heat oil over medium heat and cook patties for about 8 minutes, turning just once about halfway through cooking, just until uniformly golden brown.",
        "Meanwhile, brush hamburger buns with melted butter and toast at 400 degrees F just until they begin to brown at edges.",
        "To serve, place patty on each bun, top with remoulade sauce and desired trimmings. Serve with extra sauce and lemon wedges on the table."
    ],
    "ingredients": [
        "8 Ball Park® Hamburger Buns",
        "1 tablespoon butter, melted, or more as needed",
        "Remoulade Sauce:",
        "3/4 cup mayonnaise",
        "3 tablespoons chopped green onion",
        "1 tablespoon grainy mustard",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "2 teaspoons ketchup",
        "2 teaspoons white wine vinegar",
        "1 teaspoon prepared horseradish",
        "1 teaspoon garlic granules",
        "2 dashes hot pepper sauce (such as Tabasco®), or to taste",
        "salt and pepper to taste",
        "Crab Cakes:",
        "1/4 cup mayonnaise",
        "1 large egg, beaten",
        "1 1/2 teaspoons minced red onion",
        "1/2 tablespoon minced Italian parsley",
        "2 (6 ounce) cans crabmeat, drained, picked clean",
        "2 cups fine bread or cracker crumbs, divided",
        "3 teaspoons seafood seasoning (such as Old Bay®)",
        "1/2 teaspoon sea salt",
        "2 tablespoons ground black pepper",
        "2 tablespoons vegetable oil",
        "Trimmings to include lettuce, tomato and onion, as desired, plus lemon wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crab Cakes with Remoulade Sauce",
    "url": "http://allrecipes.com/recipe/256908/crab-cakes-with-remoulade-sauce/"
}
