{
    "directions": [
        "In a medium bowl place cracked wheat and pour hot water, (does not need be boiling), over wheat.  Add melted margarine, molasses, honey, nonfat milk, flax seed and sunflower seeds and mix well. Cool to lukewarm and stir in the sourdough starter.",
        "With a large wooden spoon start stirring in the flours, 1 cup at a time, beginning with the whole wheat then the bread flour. When dough is stiff enough to work, turn out onto a floured surface and knead a good 10 to 12 minutes, working in as little of the remaining flour as necessary.",
        "When smooth and elastic, shape dough into a ball and put it into a greased bowl, turning to coat all sides.  Cover, place in a warm, draft-free spot, and let rise until doubled in bulk, about 1 1/2 hours, punch down risen dough and set aside again to rise in a warm spot until doubled, about 1 hour.",
        "When the second rising is complete, punch down the dough and shape into two loaves.  Place dough in two well-greased 9x5 inch loaf pans, cover and let rise again until doubled in bulk, or until the dough reaches the tops of the pans, about 1 hour.  Brush tops with an egg wash, made by whisking one tablespoon water into one whole egg until well blended.",
        "Bake in a preheated 375 degree (190 degrees C) oven for 30 minutes, after 15 minutes rotate pans and spray with cold water, continue baking until the loaves test done by the hollow sound made when tapped on the top and bottom.  Cool on racks in the pans for 10 minutes, then turn out onto the racks to cool completely."
    ],
    "ingredients": [
        "3/4 cup cracked wheat",
        "1 cup hot water",
        "1/4 cup margarine, melted",
        "2 tablespoons molasses",
        "2 tablespoons honey",
        "3/4 cup nonfat milk",
        "1/2 cup flax seed",
        "1/2 cup raw sunflower seeds",
        "2 1/2 cups sourdough starter",
        "2 cups whole wheat flour",
        "3 1/2 cups bread flour",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cracked Wheat Sourdough Bread",
    "url": "http://allrecipes.com/recipe/7225/cracked-wheat-sourdough-bread/"
}
