{
    "directions": [
        "Combine all ingredients except vanilla in heavy large saucepan. Cook over medium heat until mixture thickens, stirring occasionally, about 5 minutes. Cool slightly. Transfer to processor. Add vanilla. Puree until smooth. Strain into medium bowl. Cover with plastic. Refrigerate at least 6 hours.",
        "Spray 10-inch-diameter springform pan with 2 3/4-inch-high sides with nonstick spray. Wrap outside of pan with 2 layers of heavy-duty foil. Blend cookies, sugar and cinnamon in processor. Add butter; blend until moist clumps form. Press crumb mixture onto bottom and up sides of pan. Chill crust while preparing filling.",
        "Position rack in center of oven and preheat to 350°F. Using electric mixer, beat cream cheese in large bowl until fluffy. Beat in sugar. Beat in eggs 1 at a time. Mix in sour cream, whipping cream and vanilla.",
        "Transfer 1/3 of filling to prepared crust. Dollop 1/3 of cranberry puree atop filling. Repeat layering of filling and puree 2 more times. Using knife, swirl puree through filling, creating marbled design.",
        "Place springform pan in large roasting pan. Pour enough boiling water into roasting pan to come halfway up sides of springform pan. Bake until cheesecake puffs around edges, about 1 hour 15 minutes. Turn off oven. Let cake stand in oven 1 hour, leaving oven door ajar.",
        "Transfer cake to rack. Run knife around pan sides to loosen cake. Cool completely. Remove foil from pan sides. Cover cake and chill overnight. (Can be made 2 days ahead. Keep refrigerated.)",
        "Remove pan sides. Serve cake with Cranberry-Raspberry Compote."
    ],
    "ingredients": [
        "2 cups fresh cranberries or frozen, thawed",
        "2/3 cup sugar",
        "2/3 cup fresh orange juice",
        "2 tablespoons grated orange peel",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "4 teaspoons vanilla extract",
        "Nonstick vegetable oil spray",
        "2 3/4 cups finely ground butter biscuit cookies or butter cookies",
        "2 tablespoons sugar",
        "1 teaspoon ground cinnamon",
        "1/2 cup (1 stick) unsalted butter, melted",
        "4 8-ounce packages cream cheese, room temperature",
        "1 cup sugar",
        "4 large eggs",
        "1 cup sour cream",
        "1/2 cup whipping cream",
        "1 tablespoon vanilla extract",
        "Cranberry-Raspberry Compote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Cranberry",
        "Orange",
        "Fall",
        "Chill",
        "Sour Cream"
    ],
    "title": "Cranberry Swirl Cheesecake with Cranberry-Raspberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-swirl-cheesecake-with-cranberry-raspberry-compote-5742"
}
