{
    "directions": [
        "Rinse pan with water and shake dry. Line bottom and sides of pan with plastic wrap, pressing into bottom and corners of pan to smooth. (Water helps the plastic wrap adhere.)",
        "Quarter and core pears, then cut into 1/2-inch pieces. (Do not peel.)",
        "Bring pears, cranberries, water, 2 3/4 cups sugar, butter, and cinnamon stick to a boil in a 4- to 6-quart heavy pot over moderately high heat, stirring occasionally. Reduce heat to low and simmer, covered, stirring occasionally, until cranberries burst and pears are tender, about 10 minutes.",
        "Remove and discard cinnamon stick, then carefully transfer hot mixture to a food processor and purée until smooth, about 1 minute. (Mixture will be thick). Force through a medium-mesh sieve back into same pot, pressing on solids with back of a spoon and discarding solids.",
        "Put a plate in freezer to chill.",
        "Bring cranberry mixture to a boil over high heat and add pectin. Reduce heat to moderate and cook, stirring frequently, until very thick and pastelike, about 45 minutes. To test, remove from heat, then drop a teaspoonful on chilled plate and chill in freezer 1 minute. Tilt plate: Mixture should remain in a firm mound and not run. If mixture runs, continue cooking and stirring and repeat test every 5 minutes.",
        "Remove from heat and immediately pour mixture into prepared pan. Gently tap sides of pan to smooth top and eliminate any air bubbles.",
        "Cool to room temperature, at least 1 hour, then cover surface directly with plastic wrap and chill until firm, at least 2 hours and up to 1 week.",
        "Unmold fruit mixture onto a cutting board and remove plastic wrap. Cut into 1-inch squares using a sharp knife. (For easier cutting, rinse knife with hot water, then dry it between cuts.)",
        "Just before serving, spread remaining cup sugar in a shallow bowl and coat squares on all sides."
    ],
    "ingredients": [
        "3 firm-ripe Comice or Bartlett pears (1 1/2 lb total)",
        "1 (12-oz) bag fresh or frozen cranberries",
        "1 cup water",
        "3 3/4 cups sugar",
        "2 tablespoons unsalted butter",
        "1 (3-inch) cinnamon stick",
        "2 (3-oz) packages Certo liquid pectin (not powdered)",
        "Special equipment: an 8-inch square baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Dessert",
        "Thanksgiving",
        "Kid-Friendly",
        "Cranberry",
        "Pear",
        "Fall",
        "Chill",
        "Cinnamon",
        "Gourmet",
        "Fat Free",
        "Kidney Friendly"
    ],
    "title": "Cranberry Pear Fruit Jellies",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-pear-fruit-jellies-231009"
}
