{
    "directions": [
        "Butter 3 baking sheets. Combine dried sweetened cranberries and orange juice in small bowl. Let stand until dried cranberries soften slightly, stirring occasionally, about 30 minutes.",
        "Whisk all purpose flour, ground cinnamon, baking powder, ground ginger, baking soda, and salt in medium bowl until just blended.",
        "Position rack in center of oven and preheat to 350°F. Using electric mixer, beat room-temperature butter and golden brown sugar in large bowl until smooth. Add 1 egg, minced ginger, vanilla extract, and grated orange peel and beat until well blended, about 2 minutes. Beat in flour-spice mixture. Stir in chopped walnuts, chopped pistachios, coarsely chopped fresh or frozen cranberries, and dried cranberries with any juices that have accumulated.",
        "Drop cookie dough by rounded tablespoonfuls onto prepared baking sheets, spacing tablespoonfuls about 1 1/2 inches apart. Bake cookies, 1 baking sheet at a time, until golden and almost firm to touch in center, about 18 minutes. Cool cookies on baking sheets 5 minutes. Transfer to racks; cool cookies completely. (Cookies can be made 2 days ahead. Store cookies in airtight container at room temperature.)"
    ],
    "ingredients": [
        "2 cups (packed) dried sweetened cranberries (about 10 ounces)",
        "1/3 cup orange juice",
        "2 cups all purpose flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking powder",
        "3/4 teaspoon ground ginger",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup (packed) golden brown sugar",
        "1 large egg",
        "1 tablespoon minced peeled fresh ginger",
        "2 teaspoons vanilla extract",
        "1 1/2 teaspoons grated orange peel",
        "3/4 cup chopped walnuts",
        "3/4 cup chopped unsalted natural pistachios",
        "1/2 cup coarsely chopped fresh or frozen cranberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Berry",
        "Citrus",
        "Nut",
        "Bake",
        "Christmas",
        "Cranberry",
        "Pistachio",
        "Walnut",
        "Winter",
        "Cinnamon"
    ],
    "title": "Cranberry-Orange Drop Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-orange-drop-cookies-107524"
}
