{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "In the bowl of an electric mixer fitted with a paddle attachment, mix 4 cups of flour, 1/4 cup sugar, the baking powder, salt and orange zest. Add the cold butter and mix at the lowest speed until the butter is the size of peas. Combine the eggs and heavy cream and, with the mixer on low speed, slowly pour into the flour and butter mixture. Mix until just blended. The dough will look lumpy! Combine the dried cranberries and 1/4 cup of flour, add to the dough, and mix on low speed until blended.",
        "Dump the dough onto a well-floured surface and knead it into a ball. Flour your hands and a rolling pin and roll the dough 3/4-inch thick. You should see small bits of butter in the dough. Keep moving the dough on the floured board so it doesn't stick. Flour a 3-inch round plain or fluted cutter and cut circles of dough. Place the scones on a baking pan lined with parchment paper. Collect the scraps neatly, roll them out, and cut more circles.",
        "Brush the tops of the scones with egg wash, sprinkle with sugar, and bake for 20 to 25 minutes, until the tops are browned and the insides are fully baked. The scones will be firm to the touch. Allow the scones to cool for 15 minutes and then whisk together the confectioners' sugar and orange juice, and drizzle over the scones."
    ],
    "ingredients": [
        "4 cups plus 1/4 cup all-purpose flour",
        "1/4 cup sugar, plus additional for sprinkling",
        "2 tablespoons baking powder",
        "2 teaspoons kosher salt",
        "1 tablespoon grated orange zest",
        "3/4 pound cold unsalted butter, diced",
        "4 extra-large eggs, lightly beaten",
        "1 cup cold heavy cream",
        "1 cup dried cranberries",
        "1 egg beaten with 2 tablespoons water or milk, for egg wash",
        "1/2 cup confectioners' sugar, plus 2 tablespoons",
        "4 teaspoons freshly squeezed orange juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Mixer Recipes",
        "Scone Recipes",
        "Sugar",
        "Fruit",
        "Orange Recipes",
        "Dairy Recipes",
        "Egg Recipes",
        "Cranberry",
        "Brunch"
    ],
    "title": "Cranberry Orange Scones",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/cranberry-orange-scones-recipe"
}
