{
    "directions": [
        "In a saucepan stir together the brown sugar, the cornstarch, the zest, and the juice and add the cranberries, the raisins and the salt. Bring the mixture to a boil, and simmer it, stirring for 5 minutes, or until the berries have just burst. Transfer the filling to a bowl and chill it covered, for 2 hours, or until it is cold. The filling may be made 2 days in advance and kept covered and chilled.",
        "In a bowl stir together the flour, the sugar, the baking powder, and the salt, add the butter, and blend the mixture until it resembles meal. In a small bowl whisk together the egg and the water and add the mixture to the flour mixture, stirring with a fork until the mixture forms a dough. Dust the dough with flour and chill it, wrapped in wax paper , for 1 hour.",
        "Preheat the oven to 425°F. Roll out the dough into a 12-inch round on a lightly floured surface and transfer it to a baking sheet. Spoon the filling onto the center of the dough, spreading it into an 8-inch circle, and fold the edges of the dough over it, leaving the center of the filling uncovered. Brush the dough with the egg wash and bake the tart in the middle of the oven, covering the exposed filling loosely with foil after 10 minutes, for 15 to 20 minutes, or until the pastry is golden. Let the tart cool completely on the baking sheet on a rack."
    ],
    "ingredients": [
        "3/4 cup firmly packed light brown sugar",
        "1 tablespoon cornstarch",
        "1 teaspoon freshly grated orange zest",
        "1/4 cup fresh orange juice",
        "2 cups cranberries, picked over",
        "1 cup golden raisins, soaked in hot water for five minutes and drained",
        "1/4 teaspoon salt",
        "1 1/4 cups all-purpose flour",
        "3 tablespoons sugar",
        "1/4 teaspoon double-acting baking powder",
        "1/8 teaspoon salt",
        "3/4 stick (6 tablespoons) cold, unsalted butter, cut into bits",
        "1 large egg",
        "1 tablespoon water",
        "an egg wash made by beating 1 egg with 1 tablespoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Orange",
        "Raisin",
        "Gourmet"
    ],
    "title": "Cranberry Raisin Tart",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-raisin-tart-10824"
}
