{
    "directions": [
        "Preheat oven to 350°F. Pulse cookies in a food processor until very finely ground (you should have about 1 cup). Add pecans; pulse until finely ground. Add butter and brown sugar; pulse to combine. Transfer to a deep 9\" pie dish. Using a measuring cup, press firmly onto bottom and up sides of dish. Bake until firm and slightly darkened in color, 10–15 minutes. If crust slides down sides, gently press back up. Let cool.",
        "Bring 12 oz. cranberries, 1 cup granulated sugar, and 1/4 cup water to a boil in a large saucepan over medium-high. Reduce heat; simmer until cranberries burst and most of the liquid evaporates, 12–15 minutes. Let cool. Purée in a blender until very smooth.",
        "Cook purée, eggs, egg yolks, lemon zest, lime juice, salt, 1/2 cup sugar, and 1 tsp. lime zest in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring with a rubber spatula and scraping down sides of bowl often, until curd thickens and coats spatula, 8–10 minutes. Let cool until just warm.",
        "Using an electric mixer on medium-high, beat curd, adding butter a piece at a time and incorporating after each addition, until curd looks lighter in color and texture, about 5 minutes. Scrape into crust and chill until firm, about 2 hours.",
        "Bring 1/2 cup granulated sugar and 1/2 cup water to a simmer in a small saucepan over medium heat, stirring to dissolve sugar. Add remaining 4 oz. cranberries and cook until barely starting to soften, about 1 minute. Using a slotted spoon, transfer cranberries to a wire rack set inside a rimmed baking sheet. Chill until no longer sticky, 20–30 minutes.",
        "Toss remaining 1/2 cup granulated sugar and 1 tsp. lime zest in a small bowl. Toss cranberries in lime sugar. Top pie with cranberries; serve with whipped cream.",
        "Crust can be baked 1 day ahead. Store tightly wrapped at room temperature.\nPie (without topping) can be made 2 days ahead. Cover once filling is firm and keep chilled. Let sit at room temperature 2 hours before serving."
    ],
    "ingredients": [
        "4 ounces gingersnap cookies (about 16 if using Nabisco)",
        "1 cup pecans",
        "4 tablespoons unsalted butter, melted",
        "3 tablespoons light brown sugar",
        "1 (12-ounce) package fresh (or frozen, thawed) cranberries, plus 4 ounces (about 1 1/4 cups) for serving",
        "2 1/2 cups granulated sugar, divided",
        "3 large eggs",
        "2 large egg yolks",
        "1 teaspoon finely grated lemon zest",
        "2 teaspoons finely grated lime zest, divided",
        "1/2 cup fresh lime juice",
        "Pinch of kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, cut into pieces",
        "Whipped cream (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Christmas",
        "Dessert",
        "Cranberry",
        "Lime",
        "Lime Juice",
        "Pie",
        "Ginger"
    ],
    "title": "Cranberry-Lime Pie",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-lime-pie"
}
