{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Spray 9x5x3-inch metal loaf pan with nonstick spray. Whisk both flours, cornmeal, sugar, salt, and baking powder in large bowl. Whisk buttermilk, melted butter, maple syrup, eggs, and extract in medium bowl. Add buttermilk mixture to flour mixture; stir just until blended. Stir in 3/4 cup chopped pecans and cranberries. Spoon batter into pan. Arrange pecan halves in row down center of batter.",
        "Bake bread until top is golden brown and paring knife inserted into center of bread comes out clean, tenting bread loosely with foil if browning too quickly, about 1 hour 10 minutes. Cool in pan on rack 20 minutes. Turn out onto rack; cool.",
        "A LITTLE AHEAD: Can be made 1 day ahead. Wrap bread in foil and store at room temperature.",
        "FURTHER AHEAD: Can be made and then frozen up to 2 weeks ahead. Wrap in foil, then place in resealable plastic bag.",
        "*White whole wheat flour is milled from 100 percent hard white wheat. It contains all of the germ and bran (and nutritional value) of regular whole wheat, but has a naturally lighter color and milder flavor. It's available at some supermarkets and specialty foods stores and from kingarthurflour.com."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup unbleached all purpose flour",
        "1 cup white whole wheat flour or regular whole wheat flour*",
        "1 cup medium-grind whole grain cornmeal or regular cornmeal",
        "1/2 cup sugar",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons baking powder",
        "1 1/4 cups buttermilk",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/2 cup pure maple syrup",
        "2 large eggs",
        "1/2 teaspoon maple extract",
        "3/4 cup chopped pecans plus 10 pecan halves for garnish",
        "3/4 cup dried cranberries (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Brunch",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "New Year's Day",
        "Cranberry",
        "Dried Fruit",
        "Cornmeal",
        "Fall",
        "Winter",
        "Edible Gift",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry-Cornmeal Quick Bread",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-cornmeal-quick-bread-240419"
}
