{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Finely grind shortbread cookies and toasted hazelnuts in processor. Add melted unsalted butter and process until moist clumps form. Press crumb mixture onto bottom of prepared springform pan. Bake until crust is pale golden, about 8 minutes. Cool completely. Maintain oven temperature.",
        "In top of double boiler set over barely simmering water, stir white chocolate until melted. Remove pan from over water.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until blended and smooth. Add sour cream and Frangelico and beat until well blended. Beat in eggs 1 at a time. Beat in melted white chocolate.",
        "Pour filling into prepared crust. Bake cake until top is golden and puffed and center is set, about 1 hour 10 minutes. Cool in pan on rack (cake will fall in center). Refrigerate until cold.",
        "Dissolve 1 teaspoon cornstarch in 1 teaspoon Frangelico in small bowl; set aside. Combine 1 cup cranberries, 1 cup sugar and 3/4 cup water in heavy medium saucepan. Stir over medium heat until sugar dissolves and mixture boils, about 5 minutes. Add remaining 2 cups cranberries, grated lemon peel and cornstarch mixture. Simmer until cranberries just begin to pop and mixture thickens, about 5 minutes. Cool. Cover and refrigerate until mixture gels. (Cheesecake and cranberry topping can be made 2 days ahead. Keep chilled.)",
        "Run small sharp knife around sides of springform pan to loosen cake. Remove pan sides. Smooth sides of cheesecake with knife. Transfer cheesecake to platter. Transfer cranberries to strainer and drain well, reserving any syrup. Spoon cranberries evenly atop cheesecake. Cut cheesecake into wedges and serve, passing any reserved cranberry syrup separately."
    ],
    "ingredients": [
        "5 1/2 ounces shortbread cookies",
        "1/2 cup hazelnuts, toasted, husked",
        "1 tablespoon unsalted butter, melted",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "3 8-ounce packages cream cheese, room temperature",
        "6 tablespoons sugar",
        "1 cup sour cream",
        "3 tablespoons Frangelico (hazelnut liqueur)",
        "4 large eggs",
        "1 teaspoon cornstarch",
        "1 teaspoon Frangelico (hazelnut liqueur)",
        "3 cups fresh cranberries (one 12-ounce package)",
        "1 cup sugar",
        "3/4 cup water",
        "1 teaspoon grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Cranberry",
        "Winter"
    ],
    "title": "Cranberry-Glazed White Chocolate Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-glazed-white-chocolate-cheesecake-4545"
}
