{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "Fold the dough round in half and then in quarters and transfer to a 9-inch (23-cm) pie dish. Unfold and gently press the dough into the bottom and sides of the dish. Trim the edges and flute decoratively. Transfer to the freezer for 15 minutes.",
        "Bake the chilled pie shell until lightly golden brown, about 15 minutes. Transfer to a wire rack and let cool while you prepare the filling. Leave the oven on.",
        "To make the filling, in a saucepan over medium heat, combine the cranberries, brown sugar, lemon juice and salt. Cook until the berries start to burst and break down, about 10 minutes. Transfer to a blender or food processor and carefully puree until smooth, adding a few tablespoons of water if necessary to create a smooth puree.",
        "Pour the cranberry mixture through a fine-mesh sieve into a clean saucepan. Stir in the butter, eggs, egg yolks and vanilla. Cook over medium-low heat, whisking constantly, until the mixture thickens, about 10 minutes. Pour the mixture into the piecrust and return to the oven. Cook until the filling is set, about 10 minutes. Transfer the pie a wire rack and let cool to room temperature, then chill for at least 2 hours or up to overnight.",
        "While the pie is chilling, make the garnish, if using. Line a baking sheet with parchment paper. Using a vegetable peeler, remove the zest from one of the lemons in large, wide strips, leaving as much of the bitter white pith on the fruit as you can. Cut the zest into matchstick-size strips. Reserve the zested lemon for another use. Working with the second lemon, using a sharp knife or a mandoline, very thinly slice the lemon, discarding the seeds.",
        "In a wide saucepan over medium-high heat, bring the water and granulated sugar to a simmer. Add the strips of zest to the pan and simmer, stirring occasionally, until the zest is softened, about 10 minutes. Use a skimmer to transfer the zest to the prepared baking sheet to drain.",
        "Add the lemon slices to the saucepan with the sugar syrup. Simmer until the slices are tender and somewhat translucent, about 10 minutes. Using the skimmer, transfer the slices to the baking sheet in a single layer to drain. Let cool to room temperature. The zest and lemon slices can be stored, covered, in the refrigerator for up to 3 days.",
        "When ready to serve the pie, in a large bowl, using a whisk or an electric mixer, whisk the cream until slightly thickened. Add the sugar, orange zest and vanilla and continue beating until soft peaks form.",
        "To assemble the pie, spoon the whipped cream on top of the chilled pie. Garnish with the candied lemon zest and lemon slices and serve immediately. Serves 8.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1 rolled-out round basic pie dough",
        "4 1/2 cups (18 oz./560 g) fresh or frozen cranberries",
        "1 1/2 cups (12 oz./375 g) firmly packed light brown sugar",
        "Juice of 1 lemon",
        "Pinch of salt",
        "12 Tbs. (1 1/2 sticks) (6 oz./180 g) unsalted butter, at room temperature",
        "4 whole eggs plus 6 egg yolks",
        "1 tsp. vanilla extract",
        "2 lemons",
        "1 cup (8 fl. oz./250 ml) water",
        "1 cup (8 oz./250 g) granulated sugar",
        "1 cup (8 fl. oz./250 ml) heavy cream",
        "3 Tbs. granulated sugar",
        "Grated zest of 1 orange",
        "1/2 tsp. vanilla extract"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Cranberry Curd Pie with Citrus Whipped Cream",
    "url": "http://www.williams-sonoma.com/recipe/cranberry-curd-pie-with-citrus-whipped-cream.html"
}
