{
    "directions": [
        "Preheat an oven to 275 degrees F (135 degrees C).  Spread the pecans onto a baking sheet, and toast until the nuts start to turn golden brown and become fragrant, about 45 minutes. Watch the nuts carefully as they bake, because they burn quickly. Once toasted, set the nuts aside to cool.",
        "Cover the cranberries with hot water, and allow to soak while you are making the dough.",
        "Mix the all-purpose flour and bread flour with the water in the bowl of a stand mixer or a mixing bowl, and combine to make a rough dough. Cover the bowl with plastic wrap, and allow to rest for 30 minutes.",
        "Mix in the sourdough starter and salt, and knead until the dough is smooth and elastic, 3 to 5 minutes if using the stand mixer, or 9 to 11 minutes by hand.",
        "Drain the cranberries and knead them into the dough, along with the pecans. Knead another 1 or 2 more minutes, to fully incorporate them into the dough. Lightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, 4 to 6  hours.",
        "Do not punch down dough. Scrape the risen dough onto a lightly floured work surface, and form into a round loaf. Let rest for 10 minutes. Shape the dough into a round or oblong loaf, place the loaf on a sheet of parchment paper, lightly dust with flour, and let rise until it nearly doubles in size, 1 to 2 more hours.",
        "Preheat oven to 400 degrees F (200 degrees C). If using a baking or pizza stone, let it heat in the oven at least 45 minutes before baking.",
        "Brush the top of the loaf with water, and make shallow cuts in the loaf with a sharp knife. Place the loaf and parchment paper into the oven, on top of a baking sheet or stone, and bake until brown and the loaf sounds hollow when tapped, 30 to 35 minutes. Remove the loaf to a cooling rack, brush with melted butter, and let cool for at least 1 hour before slicing."
    ],
    "ingredients": [
        "3/4 cup coarsely chopped pecans",
        "3/4 cup dried cranberries",
        "1 1/2 cups all-purpose flour",
        "1 1/2 cups bread flour",
        "1 cup water (75 to 85 degrees F)",
        "3/4 cup sourdough starter*",
        "1 1/2 teaspoons salt",
        "1 tablespoon melted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cranberry Pecan Bread",
    "url": "http://allrecipes.com/recipe/206682/cranberry-pecan-bread/"
}
