{
    "directions": [
        "In a sauté pan coated lightly with oil over high heat, sauté onions and lemongrass until soft, about 5 minutes. Season with kosher salt and freshly ground black pepper and check for flavor. Add cranberries and sugar and deglaze with naturally brewed rice vinegar. Reduce by 75 percent or until liquid is absorbed. Check again for seasoning. (When cool, you can transfer to a container and store in fridge for up to two weeks.)",
        "In a large bowl, mix crab, cream cheese, cooled cranberry mixture and chives. Season with kosher salt and freshly ground black pepper and check for flavor.",
        "Lay out 4 to 6 skins, lightly brush the edges with egg wash and place a small mound of the mix in the middle. Top with second skin and press firmly to seal. This is very important so the rangoons do not burst and leak. Repeat until filling is gone. Preheat a large sauté pan coated with 1/4-inch of oil over medium-high heat. Add as many rangoons as pan can hold in one layer. Shallow fry until golden brown, flip and fry other side until golden brown. Transfer rangoons to plate lined with paper towels. Arrange on platter and garnish with dollops of cranberry-mixture and reserved chives.",
        "Serve with [dim sum dipper and cranberry-teriyaki glaze .](/recipes/food/views/236607)"
    ],
    "ingredients": [
        "Grapeseed or canola oil for cooking",
        "2 red onions, cut into 1/2-inch dice",
        "2 tablespoons minced lemongrass, white part only",
        "Kosher salt and freshly ground black pepper, to taste",
        "2 cups dried cranberries, such as Craisins, chopped",
        "1/2 cup sugar",
        "2 cups naturally brewed rice vinegar",
        "3 pounds picked, fresh crab meat (snow, blue)",
        "3/4 pound cream cheese, softened",
        "1/2 cup chopped chives, 2 tablespoons reserved for garnish",
        "1 package thin square wonton skins, defrosted (at least 60-count)",
        "2 eggs mixed with 1/4 cup water",
        "Accompaniments: dim sum dipper and cranberry-teriyaki glaze ."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Fish",
        "Fruit",
        "Herb",
        "Onion",
        "Appetizer",
        "Fry",
        "Sauté",
        "Christmas",
        "Cocktail Party",
        "Cranberry",
        "Seafood",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cranberry-Crab Rangoon",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-crab-rangoon-236606"
}
