{
    "directions": [
        "Mix first 4 ingredients in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add cream cheese and pulse 3 times to combine. Blend in enough ice water by tablespoonfuls until moist clumps form. Gather dough into ball; flatten into disk. Transfer to lightly floured surface. Roll out dough to 15-inch round. Transfer dough to 11- to 12-inch-diameter tart pan with removable bottom. Fold in excess dough to form double-thick sides. Transfer tart pan to freezer and chill crust for 1 hour.",
        "Preheat oven to 350°F. Line crust with foil; fill with dried beans or pie weights. Bake until sides are set, about 15 minutes. Remove foil and beans and bake until crust is firm, about 20 minutes. Transfer tart pan to rack; let crust cool completely in pan.",
        "Using electric mixer, beat cream cheese and butter in large bowl until light. Beat in powdered sugar, then remaining ingredients.",
        "Spread cream cheese filling evenly in crust. Refrigerate until filling sets, about 2 hours.",
        "Combine first 6 ingredients in medium saucepan over high heat. Boil 2 minutes. Add cranberries. Return to boil. Boil 1 minute. Transfer glaze to bowl and cool completely.",
        "Spoon glaze over filling. Cover and refrigerate until firm, about 4 hours. (Can be prepared 1 day ahead. Keep refrigerated.) Garnish tart with orange peel."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "2/3 cup yellow cornmeal",
        "1 teaspoon sugar",
        "Pinch of salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2/3 cup cream cheese, chilled, cut into 1/2-inch pieces",
        "3 tablespoons (about) ice water",
        "8 ounces cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 cup powdered sugar",
        "1 tablespoon plus 2 teaspoons Cointreau or other orangeliqueur",
        "1 tablespoon plus 1 teaspoon tequila",
        "1 tablespoon (packed) grated orange peel",
        "1/4 teaspoon salt",
        "3/4 cup sugar",
        "1/3 cup frozen orange juice concentrate",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 tablespoons Cointreau or other orange liqueur",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground allspice",
        "2 cups fresh cranberries",
        "Orange peel strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tequila",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Cranberry",
        "Orange",
        "Cornmeal",
        "Fall"
    ],
    "title": "Cranberry-Tequila Cream Cheese Tart with Cornmeal Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-tequila-cream-cheese-tart-with-cornmeal-crust-3015"
}
