{
    "directions": [
        "Preheat oven to 350°F. and butter and flour a 9- by 2-inch round cake pan.",
        "Spread hazelnuts in a shallow baking pan and toast in oven until they begin to turn pale golden, 7 to 10 minutes. Cool hazelnuts completely. Discard any hazelnut skins that rub off easily. Increase oven temperature to 400°F.",
        "Peel and core pear. Chop pear coarse and in a bowl toss with cranberries and 1/4 cup sugar.",
        "In a food processor grind nuts with remaining 3/4 cup sugar, flour, and salt until fine.",
        "In a bowl with an electric mixer beat whites with a pinch salt until they just hold stiff peaks and fold in nut mixture gently but thoroughly. Fold in butter and vanilla (the batter will deflate) and spread batter evenly in cake pan. Arrange fruit mixture evenly over batter and bake in middle of oven 40 to 45 minutes, or until a tester comes out clean.",
        "Cool cake in pan on a rack 5 minutes and invert onto a plate. Cool cake, fruit side up, on rack until ready to serve.",
        "Sprinkle cake with confectioners' sugar and serve warm or at room temperature with whipped cream or ice cream."
    ],
    "ingredients": [
        "1 cup hazelnuts (about 4 ounces)",
        "1 medium firm-ripe pear",
        "1 cup fresh or frozen cranberries, rinsed and picked over",
        "1 cup sugar",
        "2/3 cup all-purpose flour",
        "3/4 teaspoon salt",
        "6 large egg whites",
        "1 stick (1/2 cup) unsalted butter, melted and cooled",
        "1 1/2 teaspoons vanilla",
        "confectioners' sugar for sprinkling",
        "Accompaniment: whipped cream or vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cranberry",
        "Pear",
        "Fall",
        "Hazelnut",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry Pear Hazelnut Financier",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-pear-hazelnut-financier-10805"
}
