{
    "directions": [
        "In large bowl, combine 1-1/2 cups flour, sugar, undissolved yeast, and salt. Heat milk, butter, and water until very warm (120 degrees  to 130 degrees F). Gradually add to flour mixture; beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add eggs and 1/2 cup flour; beat 2 minutes at high speed, scraping bowl occasionally. With spoon, stir in enough remaining flour to make stiff batter. Cover tightly with plastic wrap; refrigerate 2 to 24 hours.",
        "Cranberry filling: In medium saucepan, combine chopped cranberries, 1/2 cup sugar, and 1 1/2 teaspoons grated orange peel; bring to boil over medium heat. Reduce heat; simmer, stirring frequently, for 5 minutes or until very thick. Remove mixture from heat, and let cool.",
        "Remove dough from refrigerator. Punch dough down. Remove to lightly floured surface. Roll to 21 x 12-inch rectangle. Spread Cranberry Filling over dough to within 1/2 inch of edges. Fold crosswise in thirds, to enclose filling, making a 12 x 7-inch rectangle. Press edges to seal. Cut dough into 12 (1-inch) strips. Holding ends of each strip, twist three times. Pinch together ends of each twisted strip to form wreaths; place on greased baking sheets. Cover; let rise in warm, draft-free place until almost doubled in size, about 30 to 45 minutes.",
        "Bake at 400 degrees F for 12 to 15 minutes or until done, switching positions of sheets halfway through baking time for even browning. Remove wreaths from baking sheets; let cool on wire racks. Frost wreaths with Powdered Sugar Icing, if desired.",
        "Powdered Sugar Frosting: In bowl, combine powdered sugar, 4 to 5 teaspoons evaporated milk, and 1/2 teaspoon SPICE ISLANDS Pure Vanilla Extract. Stir until smooth"
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "1/4 cup sugar",
        "1 envelope Fleischmann's® Active Dry or RapidRise Yeast",
        "1 teaspoon salt",
        "3/4 cup evaporated milk",
        "1/4 cup butter or margarine",
        "1/4 cup water",
        "2 eggs",
        "Cranberry Filling:",
        "1 cup finely chopped cranberries",
        "1/2 cup sugar",
        "1 1/2 teaspoons grated orange peel",
        "Powdered Sugar Frosting (optional):",
        "1 cup powdered sugar, sifted",
        "4 teaspoons evaporated milk, or as needed",
        "1/2 teaspoon Spice Islands® Pure Vanilla Extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cranberry Wreaths",
    "url": "http://allrecipes.com/recipe/228886/cranberry-wreaths/"
}
