{
    "directions": [
        "Pulse almonds with 1/4 cup flour until finely ground (be careful not to grind to a paste).",
        "Beat together butter and brown sugar with an electric mixer at medium speed until pale and fluffy, about 3 minutes. Reserve 1 tablespoon beaten egg, chilled, for egg wash and beat remaining egg into butter mixture, then add vanilla and almond extracts, beating well. At low speed, mix in almond mixture, zest, salt, and remaining 1 3/4 cups flour until mixture just forms a dough.",
        "Halve dough and form each half into a 5- to 6-inch disk. Wrap disks separately in plastic wrap and chill until firm, at least 30 minutes.",
        "Bring cranberries, orange juice, marmalade, brown sugar, and 1/4 teaspoon salt to a boil in a heavy medium pot, stirring, then simmer, uncovered, until some of cranberries burst and mixture is slightly thickened, about 5 minutes. Cool filling quickly by spreading it in a shallow baking pan and chilling until lukewarm, about 15 minutes.",
        "Preheat oven to 375°F with a foil-lined large baking sheet on middle rack. Generously butter springform pan.",
        "Roll out 1 piece of dough between sheets of parchment paper into a 12-inch round (dough will be very tender). Remove top sheet of paper and invert dough into springform pan. (Dough will tear easily but can be patched together with your fingers.) Press dough over bottom and up side of pan, trimming dough to reach 1/2 inch up side of pan. Chill shell.",
        "Roll out remaining dough into a 12-inch round in same manner. Remove top sheet of paper, then cut dough into 10 (1/3-inch-wide) strips with pastry wheel and slide (still on wax paper) onto a tray. Freeze strips until firm, about 10 minutes.",
        "Spread filling in chilled shell and arrange 5 strips 1 inch apart on filling. Arrange remaining 5 strips 1 inch apart diagonally across first strips to form a lattice with diamond-shaped spaces. Trim edges of all strips flush with edge of shell. Brush lattice top with reserved beaten egg and sprinkle crostata with granulated sugar.",
        "Bake crostata in pan on hot baking sheet until pastry is golden and filling is bubbling, 50 to 60 minutes. (If pastry is too brown after 30 minutes, loosely cover crostata with foil.) Cool crostata completely in pan on a rack, 1 1/2 to 2 hours (to allow juices to thicken)."
    ],
    "ingredients": [
        "1/8 cup whole raw almonds (1/4 pound), toasted and cooled",
        "2 cups all-purpose flour, divided",
        "1 1/4 sticks unsalted butter, softened",
        "1/2 cup packed light brown sugar",
        "1 large egg, lightly beaten, divided",
        "1/2 teaspoon pure vanilla extract",
        "1/8 teaspoon pure almond extract",
        "2 teaspoons grated lemon zest",
        "1/2 teaspoon salt",
        "2 1/2 cups fresh or frozen cranberries (10 ounces)",
        "1/4 cup fresh orange juice",
        "1/2 cup sweet orange marmalade",
        "1/2 cup packed light brown sugar",
        "1 tablespoon granulated sugar",
        "Equipment: a 9-inch springform pan; a pastry wheel or pizza cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Berry",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Tree Nut",
        "Almond",
        "Fall",
        "Winter",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry Almond Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-almond-crostata-240565"
}
