{
    "directions": [
        "Blend together flour, butter, shortening, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle 3 tablespoon ice water evenly over mixture and gently stir with a fork (or pulse) until incorporated.",
        "Squeeze a small handful: If dough doesn't hold together, add more ice water, 1/2 tablespoon at a time, stirring until incorporated. Do not overwork dough or pastry will be tough.",
        "Turn out dough onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all dough together (using a pastry scraper if you have one) and form into a 5-inch disk. If dough is sticky, dust lightly with additional flour. Chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Stir together flour, brown sugar, cinnamon, and salt in a bowl. Blend in butter with your fingertips until large clumps form, then stir in pecans. Chill until ready to use.",
        "Stir together apples, cranberries, brown sugar, flour, cinnamon, salt, and lemon juice in a large bowl.",
        "Preheat oven to 425°F with rack in lower third.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round, then fit into pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp decoratively. Transfer fruit filling to pie shell and dot with butter. Loosely cover with foil and bake until apples droop slightly, about 30 minutes.",
        "Reduce oven temperature to 375°F. Sprinkle crumble topping over filling and bake, uncovered, until crumble is browned, filling is bubbling, and apples are tender, 45 minutes to 1 hour more. Cool completely, 2 to 3 hours."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "3/4 stick cold unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons cold vegetable shortening (trans-fat-free)",
        "Rounded 1/4 teaspoon salt",
        "3 to 4 tablespoons ice water",
        "3/4 cup all-purpose flour",
        "1/4 cup packed light brown sugar",
        "1/2 teaspoon cinnamon",
        "1/8 teaspoon salt",
        "1/2 stick unsalted butter, cut into 1/2-inch pieces",
        "1/2 cup pecans, coarsely chopped",
        "2 pounds Gala apples (about 5), peeled, cored, and thinly sliced",
        "8 ounces fresh or frozen (not thawed) cranberries",
        "1/2 cup packed light brown sugar",
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "2 1/2 tablespoons fresh lemon juice",
        "1/2 stick unsalted butter, cut into 1/2-inch pieces",
        "Equipment: a 9 1/2-inch glass deep-dish pie plate (6-cup capacity)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Apple",
        "Fall",
        "Cinnamon",
        "Butter",
        "Gourmet"
    ],
    "title": "Cranberry-Apple Crumble Pie",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-apple-crumble-pie-355964"
}
