{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "To Make Crust: In a medium bowl, combine graham cracker crumbs, 2 tablespoons white sugar, and chopped pecans. Mix well, then stir in melted butter or margarine. Mix until ingredients are thoroughly combined. Press mixture into pan. Bake in preheated oven for 8 to 10 minutes, until lightly browned. Cool to room temperature.",
        "To Make Cream Cheese Filling: In medium mixing bowl, whip cream cheese until fluffy. Mix in confectioners' sugar. Scrape sides of bowl. Add vanilla extract. Add orange liqueur if desired. Mix well.",
        "In a separate bowl, beat whipping cream until soft peaks form. Fold into cream cheese mixture. Spoon filling into cooled crust. Cover with plastic wrap or aluminum foil and chill at least 3 hours.",
        "To Make Cranberry Topping: In a medium saucepan, combine cranberries, 1 cup white sugar, and 1 tablespoon water. Cook over medium heat, stirring constantly, until mixture comes to a full boil and cranberries begin to pop. Remove from heat. Mix cornstarch and 2 tablespoons water together in a small bowl, until smooth, then stir into cranberry mixture. Return pan to heat. Cook until mixture boils and thickens, stirring constantly. Remove from heat and cool to room temperature.",
        "Spread cranberry topping over cream cheese filling. Chill pie thoroughly before serving."
    ],
    "ingredients": [
        "1 1/4 cups graham cracker crumbs",
        "2 tablespoons white sugar",
        "1/3 cup chopped pecans",
        "6 tablespoons butter, melted",
        "1 (8 ounce) package cream cheese, softened",
        "1/3 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "2 tablespoons orange liqueur  (optional)",
        "1 cup heavy whipping cream",
        "2 1/2 cups cranberries",
        "1 cup white sugar",
        "1 tablespoon water",
        "3 tablespoons cornstarch",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cranberry Cream Pie II",
    "url": "http://allrecipes.com/recipe/15576/cranberry-cream-pie-ii/"
}
