{
    "directions": [
        "In a large heavy skillet melt 2 tablespoons of the butter over moderately high heat until the foam subsides and in it sauté the apples, peeled and grated coarse, stirring, for 5 minutes. Stir in the cranberries and the sugar and cook the mixture over moderate heat, stirring, for 5 minutes, or until the cranberries burst. Stir in the apricots, the pecans, and the cinnamon and let the filling cool. The filling may be made 1 day in advance and kept covered and chilled.",
        "Preheat oven to 425°F. In a small saucepan melt the remaining 6 tablespoon butter. On a work surface arrange two 20-inch-long sheets of wax paper with the long sides overlapping slightly and facing you. Put 1 sheet of the phyllo on the wax paper, brush it with some of the butter, and sprinkle it with 2 teaspoons of the bread crumbs. On this, layer, brush, and sprinkle 4 more sheets of the phyllo in the same manner and lay the sixth sheet of phyllo on top.",
        "Spread the filling in a 3-inch-wide strip, mounding it on the phyllo 4 inches above the near long side, leaving in a 2-inch border at each end. Using the wax paper as a guide, lift the bottom 4 inches of the pastry over the filling, fold in the ends, and roll up the strudel tightly. Transfer the strudel carefully, seam side down, to a lightly buttered baking sheet, brush it with remaining butter, and bake it in the lower third of the oven for 25 minutes, or until it is golden. Let the strudel cool to warm on the baking sheet on a rack. The strudel may be made 1 day in advance and kept covered loosely and chilled. Reheat the strudel in a preheated 400°F. oven for 15 minutes. Serve strudel warm, cut into 1-inch slices with a serrated knife, with the ice cream."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter",
        "2 Golden Delicious apples",
        "3/4 pound fresh cranberries, picked over",
        "3/4 cup plus 2 tablespoons sugar",
        "1/4 pound dried apricots, chopped (about 1/2 cup)",
        "1/2 cup pecans, toasted lightly and chopped",
        "1 1/4 teaspoons cinnamon",
        "six 18-by-14-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened kitchen towel",
        "10 teaspoons fine dry bread crumbs",
        "vanilla ice cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Apple",
        "Apricot",
        "Pecan",
        "Gourmet"
    ],
    "title": "Cranberry Apricot Pecan Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-apricot-pecan-strudel-10809"
}
