{
    "directions": [
        "Preheat oven to 350°F.",
        "Line a 15- by 10-inch shallow baking pan (1 inch deep) with foil, leaving a 2-inch overhang on the 2 short sides. Butter all 4 sides (but not bottom).",
        "Blend flour, brown sugar, and salt in a food processor, then add butter and pulse until mixture begins to form small (roughly pea-size) lumps. Sprinkle into baking pan, then press down firmly all over with a metal spatula to form an even layer. Bake in middle of oven until golden and firm to the touch, 15 to 17 minutes, then cool in pan on a rack.",
        "Melt butter in a 3-quart heavy saucepan over moderate heat and stir in sugar, corn syrup, and salt. Boil over moderately high heat, stirring occasionally, until caramel registers 245°F on thermometer, about 8 minutes. Carefully stir in cranberries, then boil until caramel returns to 245°F. Remove from heat and stir in vanilla, then stir in pecans until well coated. Working quickly, spread caramel topping over base, using a fork to distribute nuts and berries evenly. Cool completely.",
        "Lift bars in foil from pan and transfer to a cutting board. Cut into 6 crosswise strips, then 6 lengthwise strips to form 36 bars.",
        "Melt half of chocolate in top of a double boiler or a metal bowl set over a saucepan of barely simmering water, stirring until smooth. Remove bowl from heat and add remaining chocolate, stirring until smooth. Transfer chocolate to a small heavy-duty sealable plastic bag. Seal bag and snip off a tiny piece of 1 corner to form a small hole, then pipe chocolate decoratively over bars. Let stand at room temperature until chocolate sets, about 1 hour."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 cup packed light brown sugar",
        "1/2 teaspoon salt",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "2 sticks (1 cup) unsalted butter",
        "1 2/3 cups granulated sugar",
        "1/4 cup light corn syrup",
        "1/2 teaspoon salt",
        "1 1/2 cups fresh or frozen cranberries (not thawed; 63/4 oz), coarsely chopped",
        "1 teaspoon vanilla",
        "3 cups pecans (12 oz), toasted and cooled , then coarsely chopped",
        "2 oz fine-quality bittersweet chocolate (not unsweetened), very finely chopped",
        "Special equipment: a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Cranberry",
        "Pecan",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry Turtle Bars",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-turtle-bars-105743"
}
