{
    "directions": [
        "Preheat oven to 350°F. Coat bottom and sides of cake pan with nonstick spray. Line bottom with parchment paper; coat paper with spray. Whisk flour and next 5 ingredients in a medium bowl and set aside. Pulse cranberries in a food processor until finely chopped but not puréed; set aside.",
        "Stir sugar, brown sugar, and oil in another medium bowl to blend. Add eggs one at a time, stirring to blend between additions. Whisk in sour cream, orange zest, lemon zest, and vanilla.",
        "Whisk in dry ingredients in 3 additions, alternating with cider in 2 additions and whisking to blend. Fold in chopped cranberries. Scrape batter into prepared pan; smooth top.",
        "Bake, rotating pan halfway through, until a tester inserted into center of cake comes out almost clean,1 hour—1 hour 10 minutes. Transfer pan to a wire rack; let cake cool in pan for 15 minutes. Run a thin knife around inside of pan to release cake; turn out cake onto rack. Peel off parchment paper, then flip cake and let cool for 20 minutes.",
        "Whisk powdered sugar, lemon zest, lemon juice, and salt in a small bowl. Spread glaze over warm cake, allowing it to drip down sides. Let stand until glaze becomes crackly, about 1 hour. Serve at room temperature. DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature.",
        "Serve cake with Citrus-Cranberry Compote , if desired."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups all-purpose flour",
        "3/4 teaspoon ground cinnamon",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon ground cardamom",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "2 cups (8 ounces) fresh (or frozen, thawed) cranberries",
        "2/3 cup sugar",
        "2/3 cup (packed) dark brown sugar",
        "1/2 cup grapeseed oil or other neutral vegetable oil",
        "2 large eggs",
        "1/2 cup sour cream",
        "1 tablespoon freshly grated orange zest",
        "2 teaspoon freshly grated lemon zest",
        "1 teaspoon vanilla extract",
        "1/3 cup apple cider",
        "1 cup powdered sugar",
        "2 teaspoons freshly grated lemon zest",
        "3 tablespoons strained fresh lemon juice",
        "1/8 teaspoon kosher salt",
        "citrus-cranberry compote ; optional)",
        "Special equipment: An 8\"-square cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Dessert",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Fall",
        "Winter",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry Spice Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-spice-cake-368253"
}
