{
    "directions": [
        "In a saucepan combine the cranberries, the pear, the brown sugar, the dried fruit, the zest, the cinnamon stick, the cranberry juice cocktail, the vanilla, and a pinch of salt and simmer the mixture for 10 minutes. Strain the mixture through a sieve into a bowl, reserving the solids, and transfer the cranberry liquid to a shallow dish. Line a 1 1/2-quart soufflé dish with plastic wrap and trim enough of the bread slices to cover the bottom and the side of the dish. Soak the trimmed slices in the cranberry liquid and line the bottom and the side of the soufflé dish with them.",
        "Discard the zest and the cinnamon stick from the reserved cranberry solids and add the solids to the soufflé dish. Trim enough of the remaining bread slices to cover the cranberry solids, soak the trimmed slices in the cranberry liquid, and top the cranberry solids with them. Cover the pudding with plastic wrap, put a plate on top of the plastic wrap, and weight the pudding with three 1-pound cans. Chill the pudding, weighted, for at least 12 hours and up to 1 day. Invert the pudding onto a serving plate, discarding the plastic wrap, and serve it, cut into wedges, with the whipped cream."
    ],
    "ingredients": [
        "a 12-ounce bag of fresh cranberries, picked over",
        "1 firm ripe-pear, peeled, cored, and chopped fine",
        "3/4 cup firmly packed light brown sugar",
        "1/2 cup dried sour cherries (available at specialty foods shops) or golden raisins",
        "1/3 cup finely chopped dried apricots",
        "two 2-inch strips of lemon zest removed with a vegetable peeler",
        "a 3-inch cinnamon stick",
        "2 cups cranberry juice cocktail",
        "1/4 teaspoon vanilla",
        "about 10 slices of homemade-type white bread, crusts removed",
        "lightly sweetened whipped cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Thanksgiving",
        "Cranberry",
        "Pear",
        "Apricot",
        "Cherry",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry Winter Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-winter-pudding-10825"
}
