{
    "directions": [
        "Whisk lime juice and cornstarch in heavy medium saucepan. Whisk in sugar and yolks, then add butter. Whisk constantly over medium heat until mixture simmers and thickens, about 8 minutes. Strain into small bowl. Mix in lime peel. Cover; chill overnight.",
        "Finely grind flour, sugar, almonds, and salt in processor. Add butter and vanilla; cut in, using on/off turns, until mixture just forms soft moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic. Refrigerate 1 hour. Press dough onto bottom and up sides of 11-inch-diameter tart pan with removable bottom. Using thumb, press dough up sides to extend 1/8 inch above rim of pan. Freeze crust 30 minutes.",
        "Preheat oven to 350°F. Bake crust until golden brown, pressing with back of spoon if crust bubbles, about 25 minutes. Transfer to rack and cool completely.",
        "Whisk 1/4 cup water and cornstarch in heavy large saucepan to blend. Add sugar, honey, and five-spice powder, if desired. Stir over medium-high heat until mixture comes to boil. Add cranberries; cook until mixture boils and berries just begin to pop but still maintain shape, occasionally stirring gently, about 5 minutes. Cool completely (mixture will thicken).",
        "Stir chocolate in top of double boiler over simmering water until melted and smooth. Remove from over water; whisk in sour cream and vanilla. Cool completely.",
        "Spread white chocolate cream into crust; freeze 15 minutes. Spoon curd over; spread evenly. Spoon cranberry topping by tablespoonfuls over, then spread carefully to cover completely. Cover and chill overnight. (Can be made 2 days ahead. Keep refrigerated.)",
        "Remove pan sides; transfer tart to platter. Sprinkle chocolate curls around edge of tart. Garnish with lime twists.",
        "*A blend of star anise, cinnamon, cloves, fennel seeds, and pepper available in the spice section of most supermarkets"
    ],
    "ingredients": [
        "1/2 cup fresh lime juice",
        "1/2 teaspoon cornstarch",
        "3/4 cup sugar",
        "6 large egg yolks",
        "1/2 cup (1 stick) unsalted butter, cut into 8 pieces",
        "2 1/2 teaspoons grated lime peel",
        "1 1/4 cups all purpose flour",
        "1/2 cup powdered sugar",
        "1/3 cup whole almonds, toasted, cooled",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 teaspoon vanilla extract",
        "1/4 cup water",
        "1 1/2 teaspoons cornstarch",
        "2/3 cup sugar",
        "3 tablespoons honey",
        "1 1/2 teaspoons Chinese five-spice powder* (optional)",
        "1 12-ounce bag (3 cups) fresh cranberries or frozen, partially thawed",
        "5 ounces white chocolate, chopped",
        "1/2 cup plus 2 tablespoons sour cream",
        "1/2 teaspoon vanilla extract",
        "White chocolate curls",
        "8 thin lime twists"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Cranberry",
        "Lime",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry-Lime Tart",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-lime-tart-108931"
}
