{
    "directions": [
        "Preheat oven to 325°F. Finely grind cookies and chocolate in processor. Add butter; blend until moist clumps form. Using plastic wrap as aid, press crumb mixture onto bottom and 1 1/4 inches up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake until set, about 8 minutes. Cool completely.",
        "Increase oven temperature to 350°F. Wrap 2 layers of heavy-duty foil around bottom and up sides of springform pan. Using electric mixer, beat cream cheese and sugar in large bowl until light. Beat in flour. Beat in eggs, 1 at a time, just until blended. Beat in orange peel and vanilla.",
        "Pour filling into crust. Place springform pan in large roasting pan. Fill roasting pan with enough hot water to come halfway up sides of springform pan. Bake until filling is just set in center but still moves slightly, about 55 minutes. Remove cake from water bath; transfer to rack and cool completely, about 4 hours. Cover and chill overnight.",
        "Stir sugar and water in medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium; add cornstarch mixture and bring to simmer. Add cranberries; cook until beginning to pop, stirring often, about 3 minutes. Stir in orange peel. Cool completely. Cover and chill overnight. (Cheesecake and cranberry mixture can be made 2 days ahead. Keep refrigerated.)",
        "Run knife around top edge of cheesecake to loosen. Release pan sides. Top cheesecake with cranberry mixture. Chill until set, about 1 hour."
    ],
    "ingredients": [
        "1 9-ounce box chocolate wafer cookies, broken",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "5 tablespoons unsalted butter, melted",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/2 cups sugar",
        "3 tablespoons all purpose flour",
        "4 large eggs",
        "2 teaspoons grated orange peel",
        "1 teaspoon vanilla extract",
        "1/2 cup sugar",
        "3 tablespoons water",
        "1 teaspoon cornstarch dissolved in 1 tablespoon water",
        "2 cups fresh cranberries",
        "1/2 teaspoon grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Cheese",
        "Chocolate",
        "Citrus",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Cranberry",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry-Orange Cheesecake with Chocolate Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-orange-cheesecake-with-chocolate-crust-107513"
}
