{
    "directions": [
        "Bring cranberries, sugar, wine, rosemary, and 2 2/3 cups water to a boil in a 6- to 8-quart pot, stirring until sugar is dissolved, then reduce heat and simmer, partially covered, stirring occasionally, until all berries have burst, 8 to 10 minutes. Pour into a large colander lined with dampened paper towels and set in a deep bowl, then let stand until all juices have drained through, 10 to 15 minutes, and discard solids. If you have more than 4 cups cranberry liquid, boil in a small saucepan until reduced; if less, add water to bring total to 4 cups.",
        "Stir together gelatin and remaining cup water in a clean small saucepan and let stand 1 minute to soften. Heat over moderate heat, stirring, until gelatin is dissolved. Stir gelatin mixture into cranberry liquid until combined. Pour cranberry mixture into lightly oiled mold (see cooks' note, below), skimming off any foam. Cool to room temperature, then cover with plastic wrap and chill until firmly set, at least 12 hours.",
        "To unmold, run tip of a thin knife between edge of mold and jelly. Tilt mold sideways and tap side of mold against a work surface, turning it, to evenly break seal and loosen cranberry jelly. Keeping mold tilted, invert a plate over mold, then invert cranberry sauce onto plate."
    ],
    "ingredients": [
        "4 (12-ounce) bags fresh or frozen cranberries (14 cups; do not thaw)",
        "3 cups sugar",
        "2 cups dry white wine",
        "2 (5-inch) fresh rosemary sprigs",
        "3 2/3 cups cold water",
        "1 tablespoon plus 2 teaspoons unflavored gelatin (from three 1/4-ounce envelopes)",
        "Special equipment: a 6-cup nonreactive mold (see cooks' note, below) or glass loaf pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Wine",
        "Berry",
        "Herb",
        "Thanksgiving",
        "Cranberry",
        "White Wine",
        "Fall",
        "Gourmet"
    ],
    "title": "Cranberry Rosemary Wine Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-rosemary-wine-jelly-233010"
}
