{
    "directions": [
        "Stir nuts in dry skillet over medium heat until toasted, about 5 minutes. Cool.",
        "Mix 3 1/2 cups bread flour and next 3 ingredients in bowl of heavy-duty stand mixer fitted with paddle attachment. Warm milk in small saucepan over low heat until instant-read thermometer inserted into milk registers 95°F. Add oil; remove from heat. Add milk mixture and 1 egg to flour mixture. Mix on low speed until wet coarse ball forms, about 1 minute. Add nuts and cranberries. Replace paddle attachment on mixer with dough hook. Mix dough on low speed until smooth, elastic, and slightly tacky, adding more flour by tablespoonfuls as needed, about 4 minutes. Transfer dough to floured surface; knead 2 minutes.",
        "Lightly oil large bowl. Shape dough into ball; place in prepared bowl, turning to coat with oil. Cover with plastic wrap; let dough rise at room temperature until almost doubled in volume, 1 3/4 to 2 hours.",
        "Line large rimmed baking sheet with parchment paper. Transfer dough to unfloured surface; divide into 12 equal pieces. Using cupped hand, roll and rotate 1 dough piece firmly on work surface until dough piece pops up into cupped hand as smooth round ball, about 6 rotations. (This will make dough ball as smooth as possible; if necessary, wipe work surface with damp paper towel to help create traction.) Repeat with remaining dough pieces.",
        "Transfer rolls to prepared baking sheet, spacing apart. Spray rolls with nonstick spray. Cover loosely with plastic wrap; let rise at room temperature until 1 1/2 times original size, about 1 1/2 hours. Brush rolls with egg glaze; sprinkle with raw sugar. Let rise 15 minutes longer.",
        "Meanwhile, position rack in center of oven and preheat to 425°F.",
        "Place rolls in oven; reduce oven temperature to 400°F and bake 7 minutes. Rotate baking sheet; bake rolls until golden and slightly firm to touch, about 8 minutes longer. Cool completely on rack. DO AHEAD: Wrap in foil, then enclose in resealable plastic bag and freeze up to 2 weeks. Thaw rolls at room temperature. If desired, rewarm rolls wrapped in foil in 350°F oven about 10 minutes.",
        "Also called turbinado or demerara sugar; available at most supermarkets."
    ],
    "ingredients": [
        "1 cup coarsely chopped walnuts",
        "3 1/2 cups (or more) bread flour",
        "1 tablespoon (packed) golden brown sugar",
        "1 1/2 teaspoons quick-rising dry yeast (from one 1/4-ounce envelope)",
        "1 1/2 teaspoons salt",
        "1 1/2 cups whole milk",
        "2 tablespoons vegetable oil plus additional for coating bowl",
        "1 large egg",
        "1 cup sweetened dried cranberries",
        "Nonstick vegetable oil spray",
        "1 large egg, beaten to blend (for glaze)",
        "Raw sugar*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Breakfast",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Low Fat",
        "Low Cal",
        "Cranberry",
        "Dried Fruit",
        "Walnut",
        "Healthy",
        "Low Cholesterol",
        "Christmas Eve",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cranberry-Nut Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/cranberry-nut-rolls-355806"
}
