{
    "directions": [
        "Pound chicken breasts until flat.  Place in a bowl, immerse in Worcestershire sauce, and refrigerate.",
        "Melt 1/2 cup butter in a large, cast iron skillet.  Saute onion, celery, bell pepper, and garlic in butter for 15 minutes over medium heat, until vegetables are tender.  Add the crawfish to the pan, and saute for an additional 4 to 5 minutes.  Season with salt and pepper. Transfer mixture to a bowl, and set aside.",
        "Add 1/2 cup butter to the pan, and melt over medium-high heat.  Dredge each chicken breast in the flour, and brown in the butter on one side only.  Keep the chicken in the pan only long enough to brown, do not cook.  The butter may begin to burn during this process.  If it does, simply pour it out and add more.",
        "Place chicken, brown side down, on a flat surface.  Spoon stuffing onto breasts, and wrap the breast ends up until they touch.  Secure ends with a toothpick. Place stuffed breasts into a baking dish.",
        "Pour cream, remaining 1 cup butter, mushrooms, and green onions into a sauce pan, and heat gently for 5 minutes.  Pour over chicken breasts.  Place crabmeat in mounds on top of chicken.  Cover the entire dish with foil.",
        "Bake in a preheated 375 degree F (190 degree C) oven for 45 minutes, or until chicken is cooked."
    ],
    "ingredients": [
        "8 skinless, boneless chicken breast halves",
        "1 cup Worcestershire sauce",
        "2 cups unsalted butter",
        "1 cup diced onion",
        "1 cup diced celery",
        "1/2 cup diced green bell pepper",
        "3 tablespoons minced garlic",
        "1 pound cooked and peeled crawfish tails, coarsely chopped",
        "salt",
        "black pepper",
        "1 cup all-purpose flour",
        "1 pint heavy whipping cream",
        "12 ounces fresh oyster mushrooms, stemmed and sliced",
        "2 cups fresh lump crabmeat",
        "1 cup diced green onion"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crawfish Stuffed Chicken Breasts",
    "url": "http://allrecipes.com/recipe/28004/crawfish-stuffed-chicken-breasts/"
}
