{
    "directions": [
        "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Stir the breakfast sausage into the skillet, and cook until crumbly and no longer pink. Meanwhile, place the Monterey Jack, Cheddar, Muenster, and cream cheeses in a large saucepan over medium-low heat. Once melted, stir in the crumbled bacon, breakfast sausage, and chopped  crawfish tails. Set aside.",
        "Remove the stems from the jalapenos, and cut a slit lengthwise down one side. Wear gloves while handling the jalapenos (trust me, I learned the hard way). Remove the seeds through the slit. Hold the seeded jalapenos lengthwise between your thumb and forefinger, and stuff with the meat and cheese mixture (you remembered the gloves, right?). Place the stuffed jalapenos onto a dish, and freeze overnight or until solid.",
        "Heat oil in deep-fryer to 375 degrees F (190 degrees C). Whisk together the flour, paprika, white pepper, and garlic salt in a bowl until combined, then quickly whisk in the beer until a batter has formed.",
        "Use a skewer to stab a frozen jalapeno, then dip it into the batter until coated. Place the jalapeno in the hot oil, and hold for a few seconds just below the surface, before twisting out the skewer. This will help keep the jalapeno from sticking to the bottom of the pan. Cook until golden brown all over, then remove and drain on a paper towel lined plate. Repeat with remaining jalapenos."
    ],
    "ingredients": [
        "8 ounces bacon",
        "8 ounces bulk lean breakfast sausage",
        "24 large jalapeno peppers",
        "1 cup shredded Monterey Jack cheese",
        "1 cup shredded Cheddar cheese",
        "4 ounces cream cheese, softened",
        "1 cup shredded Muenster cheese",
        "1 pound cooked and peeled crawfish tails, coarsely chopped",
        "1 quart vegetable oil for frying",
        "2 cups all-purpose flour",
        "1/2 teaspoon paprika",
        "1/2 teaspoon white pepper",
        "1 teaspoon garlic salt",
        "1 1/2 cups beer, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crawfish-Stuffed Jalapenos",
    "url": "http://allrecipes.com/recipe/160481/crawfish-stuffed-jalapenos/"
}
