{
    "directions": [
        "Preheat oven to 400°F.",
        "On a lightly floured surface roll out 1 pastry sheet 1/8 inch thick (about 15 by 11 inches) and with a 4-inch round cutter cut out 6 rounds. Roll out second pastry sheet and cut out 6 more rounds in same manner. Roll out remaining pastry sheet and cut out 4 more rounds in same manner. (There will be a total of 16 rounds.) Transfer 8 rounds to a large baking sheet. With a 2 1/2-inch round cutter cut out and discard centers from remaining 8 rounds to make rings. Prick rounds on baking sheet with a fork and brush lightly with some egg wash, being careful not to let wash run over edges. Center pastry rings on rounds, pressing together lightly to adhere. Brush tops of rings lightly with some egg wash, being careful not to let wash run over edges.",
        "Bake pastry shells in middle of oven until golden, about 9 minutes, and transfer to a rack. With a paring knife carefully cut out and remove pastry centers to form cavities. Pastry shells may be made 2 days ahead and kept in airtight containers. Reheat pastry shells in middle of a 400°F. oven until warm before serving.",
        "In a heavy skillet cook onion and bell pepper in butter, covered, over moderately low heat, stirring occasionally, until softened but not browned. Sprinkle flour over onion and bell pepper and cook, stirring, 3 minutes. Stir in tomatoes and reserved purée, water, and cayenne and simmer, stirring, until thickened slightly, about 1 minute. Stir in crawfish and heat mixture over moderate heat until just hot. Etouffße may be prepared up to this point 2 days ahead, cooled completely, uncovered, and chilled, covered. Reheat etouffée before proceeding. Stir in scallions and salt to taste.",
        "In a large bowl whisk together vinegar and salt and pepper to taste and whisk in oil in a stream until emulsified. Add mesclun and toss well.",
        "Spoon etouffée into warm pastry shells and arrange mesclun around shells."
    ],
    "ingredients": [
        "1 onion, chopped fine",
        "1 green bell pepper, chopped fine",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 tablespoon all-purpose flour",
        "a 1-pound can whole tomatoes in purée, drained, reserving 2 tablespoons purée, and chopped fine",
        "1/2 cup water",
        "1/4 teaspoon cayenne, or to taste",
        "a 1-pound bag frozen crawfish tail meat (preferably Louisiana), thawed",
        "1/2 cup thinly sliced scallion greens",
        "4 teaspoons white-wine vinegar",
        "1/3 cup olive oil",
        "8 cups mesclun (mixed baby greens, about 3/4 pound), rinsed and spun dry",
        "8 puff pastry shells",
        "3 puff pastry sheets (from two 17 1/4-ounce packages frozen puff pastry sheets), thawed",
        "an egg wash made by beating 1 large egg with 1 teaspoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Leafy Green",
        "Onion",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Mardi Gras",
        "Bell Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Crawfish Tomato étouffée in Puff Pastry Shells",
    "url": "http://www.epicurious.com/recipes/food/views/crawfish-tomato-etouffee-in-puff-pastry-shells-11373"
}
