{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.",
        "In a large saucepan over medium-low heat, cook and stir the mushrooms and onion until the mushrooms are soft and have given up their liquid, about 5 minutes. Stir in the sherry, bring to a boil, and simmer until the onions are tender, 2 to 3 more minutes. Sprinkle flour over the mixture, and cook, stirring constantly until thick. Gradually mix  in 2/3 cup milk to make a creamy gravy, stirring constantly to avoid burning. Mix in 1 can of cream of mushroom soup and the dry stuffing, bring to a simmer, and cook until the stuffing mix is moist, about 5 minutes.",
        "Melt butter over medium heat in a large skillet until no longer foamy, and pan-fry the chops until browned but not cooked through, about 5 minutes per side. Transfer the chops to the prepared baking dish. Stir water into the skillet, bring to a boil, and scrape and dissolve any flavor bits left in the skillet. Let the mixture boil until reduced by half, about 10 minutes. Pour the skillet drippings into the stuffing mix, and mix thoroughly.",
        "Scoop up generous amounts of stuffing and mound on each chop. Whisk together 1 can of cream of mushroom soup with 1/2 soup can of milk, and pour the soup mixture over each chop to cover.",
        "Bake in the preheated oven until chops are tender and cooked through, about 20 minutes. An instant-read thermometer inserted into the center of a chop should read at least 165 degrees F (74 degrees C)."
    ],
    "ingredients": [
        "1/2 pound sliced fresh mushrooms, or more to taste",
        "1 onion, chopped",
        "1/4 cup dry sherry, or to taste",
        "2 tablespoons all-purpose flour, or as needed",
        "2/3 cup milk, or as needed",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (14 ounce) package dry bread stuffing mix",
        "1/4 cup butter",
        "6 boneless pork chops",
        "1/2 cup water",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 (10.75 ounce) can milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crazy Good Stuffing and Baked Chops",
    "url": "http://allrecipes.com/recipe/214765/crazy-good-stuffing-and-baked-chops/"
}
