{
    "directions": [
        "In a large saucepan over high heat, bring the water, milk, and salt to a boil. Add the polenta in a slow, steady stream, stirring continuously with a wooden spoon until incorporated.",
        "Continue stirring to prevent lumps from forming. Reduce the heat so the mixture bubbles occasionally.",
        "Cook, stirring and scraping the bottom and sides of the pan, until the polenta is thick and starts to pull away from the sides of the pan, 35 to 40 minutes.",
        "Remove from the heat. Stir in the butter, a few cubes at a time, then stir in the cheese. Keep warm over very low heat.",
        "Heat grapeseed oil in a large saute pan over medium heat. Add the sausages and cook following cooking instructions indicated on the packaging, or until no longer pink in the center, about 8 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Transfer the sausages to a plate.",
        "Add the bell peppers and onion to the pan and cook, stirring occasionally, until browned and tender, about 10 minutes.",
        "Stir in the pasta sauce and crushed red pepper flakes. Bring to a simmer and return the sausages to the pan. Cover and cook for 10 minutes, then remove from the heat. Slice sausages before serving.",
        "To serve, place a mound of polenta onto a plate, and top with the sausage and arrabbiata sauce."
    ],
    "ingredients": [
        "Polenta:",
        "2 1/2 cups water",
        "1/2 cup milk",
        "1 teaspoon salt",
        "1 cup Italian polenta",
        "2 tablespoons unsalted butter",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "Arrabbiata Sauce and Sausages:",
        "2 tablespoons grapeseed oil or olive oil",
        "1 (19 ounce) package Italian sausage links",
        "2 large bell peppers, seeded and sliced into 1/2-inch thick rings",
        "1 medium sweet onion, cut into 1/2-inch slices",
        "1 (24 ounce) jar Classico® Tomato and Basil Sauce",
        "1/4 teaspoon crushed red pepper flakes, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Polenta with Arrabbiata Sausage Ragout",
    "url": "http://allrecipes.com/recipe/238618/creamy-polenta-with-arrabbiata-sausag/"
}
