{
    "directions": [
        "Heat 1/3 cup of the coconut milk in a large saucepan over medium-high heat. Add the onion and salt and cook while stirring until onion is softened, about 5 minutes. Stir in the ginger, curry paste, and garlic and cook while stirring until well combined and fragrant, about 1 minute.",
        "Add the carrots, 2 3/4 cups of broth, the lime juice, the 15 large cilantro sprigs, and the remaining coconut milk and bring to a boil over high heat. Reduce heat to low and simmer, covered, until the carrots are very tender, about 30 minutes. Remove the cilantro sprigs and puree soup in batches in a blender, using the hot fill line as a guide.",
        "Transfer the pureed soup to a clean saucepan and place over low heat. Stir in 1/4 cup of the chia seeds and simmer uncovered until chia seeds are fully hydrated and soup reaches desired consistency, about 20 minutes, stirring occasionally. (Note: If soup becomes thicker than you desire, stir in additional vegetable broth by the tablespoon to reach ideal consistency.) Taste and adjust seasonings, garnish with the remaining 1 teaspoon of chia seeds and small cilantro sprigs, and serve."
    ],
    "ingredients": [
        "1 (13.5-ounce) can coconut milk",
        "1 medium yellow onion, chopped",
        "3/4 teaspoon sea salt",
        "2 teaspoons peeled, grated fresh ginger",
        "2 teaspoons Thai yellow or red curry paste",
        "1 clove garlic, peeled and chopped",
        "12 ounces baby carrots, quartered lengthwise",
        "2 3/4 cups low-sodium vegetable broth, plus more as needed",
        "2 tablespoons freshly squeezed lime juice (from about 1 lime)",
        "15 large cilantro sprigs plus 5 small cilantro sprigs",
        "1/4 cup plus 1 teaspoon black or white chia seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Kid-Friendly",
        "Lunch",
        "Coconut",
        "Carrot",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Creamy Chia Coconut Ginger-Carrot Soup",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-chia-coconut-ginger-carrot-soup-51250210"
}
