{
    "directions": [
        "Preheat oven to 350°F. Spread breadcrumbs on rimmed baking sheet. Bake until lightly toasted, about 10 minutes.",
        "Sauté bacon in large skillet over medium heat until crisp. Using slotted spoon, transfer bacon to paper towels. Transfer 2 tablespoons bacon drippings to heavy large pot; reserve for creamed corn. Discard remaining drippings.",
        "Place flour in medium bowl. Sprinkle with salt and pepper. Separate red onion slices into rings and toss in flour to coat lightly. Heat 1/2 cup oil in same large skillet over medium-high heat. Working in batches, add onion rings to skillet and cook until golden brown, adding more oil as needed, about 2 minutes per side. Transfer onion rings to paper towels. Mix breadcrumbs, bacon, onion rings, and half of green onions in clean medium bowl. Sprinkle topping with salt and pepper.",
        "Butter 13x9x2-inch glass baking dish. Add butter to pot with reserved bacon drippings; melt over medium-high heat. Add chopped onion; sauté until light golden and beginning to soften, about 6 minutes. Add frozen corn; sauté 5 minutes. Add milk and cream; bring to boil. Gradually stir in grits and cayenne pepper. Reduce heat and simmer until mixture thickens slightly, about 3 minutes. Remove from heat. Stir in cheese and remaining green onions. Season with salt and pepper. Transfer creamed corn to prepared dish. (Topping and corn can be made 1 day ahead. Cover separately and chill.)",
        "Preheat oven to 350°F. Bake gratin uncovered 25 minutes. Sprinkle topping over; bake until topping is slightly crisp and creamed corn thickens and is heated through, about 20 minutes longer."
    ],
    "ingredients": [
        "1 1/2 cups fresh breadcrumbs made from crustless French bread",
        "6 bacon slices, chopped",
        "1/3 cup all purpose flour",
        "1 large red onion, thinly sliced into rounds",
        "1/2 cup (or more) vegetable oil",
        "10 green onions, chopped",
        "2 tablespoons (1/4 stick) butter",
        "1 large onion, chopped",
        "8 cups frozen corn kernels (about 2 pounds 6 ounces)",
        "2 cups whole milk",
        "1 cup whipping cream",
        "3 tablespoons quick-cooking grits",
        "1/4 teaspoon cayenne pepper",
        "1 cup (packed) coarsely grated Monterey Jack cheese (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Casserole/Gratin",
        "Bacon",
        "Corn",
        "Fall",
        "Monterey Jack",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Creamed Corn Gratin with Fried Onion Rings and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-corn-gratin-with-fried-onion-rings-and-bacon-108827"
}
