{
    "directions": [
        "1. Melt the butter in a soup pot over medium heat. Add the onion, celery, basil, and cloves; cook, stirring occasionally, until the onion is limp, about 5 minutes. Stir in the flour, then add the tomatoes, baking soda, and stock. Bring to a boil, lower the heat, and simmer, partially covered, for 20 minutes. Let cool briefly, then puree in a blender until smooth",
        "2. Preheat the oven to 400°F. Return the soup to the pot, add the milk, and season with salt. If the soup is too thick, thin it with additional milk or stock. If the tomato flavor isn't as rich as you'd like (if the tomatoes were packed in water instead of puree), deepen it by stirring in a little tomato paste.",
        "3. For the toasts, combine the yolk, if you're using it, with the mustard and cayenne, then stir in the cheese. Whisk the white until it holds soft peaks and fold it into the mixture along with the scallion. Spread the mixture on the toasted bread and bake until puffed and golden, about 5 minutes, while you reheat the soup. Serve the soup piping hot, with a piece of cheese toast, cut in half on the diagonal, and fresh pepper ground into each bowl."
    ],
    "ingredients": [
        "2 1/2 tablespoons butter",
        "1 small onion, chopped",
        "1 celery rib, chopped",
        "1 1/2 teaspoons dried basil, crumbled between your fingers",
        "Pinch of ground cloves",
        "2 tablespoons flour",
        "Two 15-ounce cans diced tomatoes in puree or juice",
        "Pinch of baking soda",
        "2 1/2 cups vegetable stock or water",
        "1 1/2 cups milk",
        "Sea salt and freshly ground pepper",
        "Tomato paste if needed",
        "1 egg, separated, or 1 egg white only",
        "1 teaspoon Dijon mustard",
        "Pinch of cayenne",
        "1 cup grated sharp Cheddar cheese",
        "1 teaspoon minced scallion or shallot",
        "4 slices sandwich bread, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Cheese",
        "Dairy",
        "Egg",
        "Mustard",
        "Onion",
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "Cheddar",
        "Basil",
        "Celery",
        "Fall",
        "Winter",
        "Shallot",
        "Simmer"
    ],
    "title": "Cream of Tomato Soup with Souffléed Cheese Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-tomato-soup-with-souffleed-cheese-toasts-355878"
}
