{
    "directions": [
        "In a Dutch oven or large pasta pot, cook pasta according to package directions. Drain pasta water, rinse and return to pot. Set aside.",
        "In a saucepan over medium-low heat, saute shallots and garlic in olive oil until softened and fragrant, about 3 to 4 minutes. Season with a hefty pinch of salt and pepper. Add flour, coating shallot and garlic to start a roux. Slowly pour in Almond Breeze, whisking constantly until smooth, and bring mixture to a simmer. Let cook for an additional 5 to 8 minutes, or until thickened. Add lemon juice and nutritional yeast, and season with salt and pepper, to taste.",
        "Transfer to a blender and puree until smooth. Blending will help the sauce thicken.",
        "While sauce is cooking, pulse pesto ingredients in a blender or food processor, scraping down the sides with a rubber spatula, until mixture is smooth. Season to taste, and set aside.",
        "To finish, combine sauce, 1/2 cup of the kale almond pesto and pasta, and stir until well mixed. Serve on plates or in deep bowls, and garnish with extra Parmesan cheese and basil."
    ],
    "ingredients": [
        "1 (16 ounce) package linguine pasta",
        "2 tablespoons olive oil",
        "2 large shallots, thinly sliced",
        "2 cloves garlic, minced",
        "3 tablespoons all-purpose flour",
        "2 cups Original Unsweetened Almond Breeze Almondmilk",
        "1/2 lemon, juiced",
        "1 tablespoon nutritional yeast (optional)",
        "Salt and pepper, to taste",
        "Grated Parmesan cheese, for serving",
        "Chopped fresh basil, for serving",
        "Kale Almond Pesto:",
        "1 small bunch kale, stems removed, roughly chopped",
        "1/2 cup fresh basil",
        "1/2 cup olive oil",
        "1/2 cup roasted salted almonds",
        "1/2 cup grated Parmesan cheese",
        "2 cloves garlic",
        "1 lemon, zested and juiced",
        "Salt and pepper, to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Pesto Pasta with Almond Breeze",
    "url": "http://allrecipes.com/recipe/255669/creamy-pesto-pasta-with-almond-breeze/"
}
