{
    "directions": [
        "Heat olive oil over medium heat in a large, heavy-bottomed pot or Dutch oven. Add the bacon and cook and stir until most of the fat is rendered, and the bacon is lightly browned but still slightly limp, about 5 minutes. Remove the bacon with a slotted spoon to a small bowl; do not drain. Pour off any excess bacon fat in the pan, according to your taste.",
        "Stir the onion into the pot, season with salt and pepper, and cook and stir over medium-high heat until onion is translucent. Sprinkle in the sugar, then stir in the vinegar-stand back or you'll get a nose full! Scrape up the delicious brown bits from the bottom of the pan. Add the cabbage, stirring well to combine.",
        "Cook, uncovered, until cabbage is reduced and starts to soften, 6 to 8 minutes. Stir in apples, stock, and coriander seeds. Cover, reduce heat to medium low, and cook for at least 30 minutes, stirring occasionally. Add more stock as needed, and continue cooking until the cabbage is soft, but not falling apart.",
        "Just before serving, remove the cover and stir in the bacon with its juices. Cook over medium-high heat until any remaining liquid is reduced to a syrup and the mixture is piping hot, about 5 minutes. Remove from heat, stir in nutmeg, and fold in the sour cream. Your digestive tract will thank you."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "6 slices bacon, chopped",
        "1 large onion, chopped",
        "salt and pepper to taste",
        "1 tablespoon white sugar, or to taste",
        "2 tablespoons cider vinegar",
        "1 head green cabbage, cored and chopped",
        "2 large Granny Smith apples - peeled, cored and thickly sliced",
        "1/2 cup chicken stock, or as needed",
        "1/2 teaspoon coriander seeds",
        "1 pinch nutmeg",
        "1/2 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Cabbage with Apples and Bacon",
    "url": "http://allrecipes.com/recipe/173459/creamy-cabbage-with-apples-and-bacon/"
}
