{
    "directions": [
        "Melt 3 tablespoons butter in heavy large saucepan over medium-high heat. Add leeks and potatoes; sauté until leeks are tender, about 4 minutes. Add chicken broth. Bring to simmer. Reduce heat to medium-low. Cover; simmer until potatoes are tender, stirring occasionally, about 20 minutes. Remove from heat. Add chopped watercress. Cover; let stand until watercress wilts, about 5 minutes.",
        "Working in batches, puree soup in blender. Return soup to saucepan. Whisk in sour cream. Thin soup with milk to desired consistency. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and refrigerate.) Stir soup over low heat just until heated through (do not boil).",
        "Melt remaining 1 tablespoon butter with oil in large skillet over medium-high heat. Add scallops to skillet and cook until golden brown and just cooked through, about 2 minutes per side. Sprinkle scallops with salt and pepper.",
        "Ladle soup into bowls. Place 1 scallop atop soup in each bowl. Garnish with watercress sprigs and serve."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) butter",
        "6 medium leeks (white and pale green parts only), chopped",
        "2 russet potatoes, peeled, cut into 1-inch pieces (about 41/2 cups)",
        "1 49-ounce can low-salt chicken broth",
        "2 bunches watercress, trimmed, coarsely chopped (about 3 cups)",
        "2/3 cup sour cream",
        "1 cup (about) whole milk",
        "1 tablespoon vegetable oil",
        "10 jumbo sea scallops",
        "Watercress sprigs (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Dairy",
        "Leafy Green",
        "Shellfish",
        "Sauté",
        "Scallop",
        "Winter",
        "Watercress"
    ],
    "title": "Cream of Watercress Soup with Pan-Seared Scallops",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-watercress-soup-with-pan-seared-scallops-102637"
}
