{
    "directions": [
        "Prepare and bake cake mix according to manufacturers instructions for two 9 inch layers.",
        "While the cake is baking, make the filling. Put milk into a saucepan over medium heat. whisk together the sugar, salt and cornstarch, stir into the milk. Add the egg, and bring the mixture to a boil, stirring constantly. When the mixture thickens, remove from heat and stir in the butter and vanilla. Pour into a dish. Place plastic wrap directly onto the surface of the pudding, and refrigerate until cool.",
        "Make the frosting after the cake and pudding are cooled. To make the frosting,  combine the heavy cream, sugar and vanilla. Whip until stiff.",
        "Using a  serrated knife, cut each cake layer in half horizontally. spread the filling between the layers. Frost with the whipped cream frosting. using a vegetable peeler, carve chocolate curls off of the chocolate bar directly onto the cake. If this does not work well for you, you can use a cheese grater to shave the chocolate, then sprinkle over the cake. Refrigerate the cake for at least 3 hours.",
        "To make the sauce, pour the cherry juice into a small saucepan. Bring to a boil over high heat, then dissolve the cornstarch in 1/4 cup of water, and stir into the boiling cherry juice. Cook and stir until the sauce returns to a boil, thickens, and clears. Stir the cherries into the sauce. Serve warm or cold."
    ],
    "ingredients": [
        "1 (18.25 ounce) package white cake mix",
        "2 cups milk",
        "1/2 cup white sugar",
        "1/8 teaspoon salt",
        "2 tablespoons cornstarch",
        "1 egg, beaten",
        "1 tablespoon butter",
        "1 1/2 tablespoons vanilla extract",
        "1 pint heavy cream",
        "1 teaspoon vanilla extract",
        "1/4 cup white sugar",
        "2 (1 ounce) squares semisweet chocolate",
        "1 (15 ounce) can pitted Bing cherries, juice reserved",
        "1 tablespoon cornstarch",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cream Cake with Bing Cherry Sauce",
    "url": "http://allrecipes.com/recipe/17542/cream-cake-with-bing-cherry-sauce/"
}
