{
    "directions": [
        "Cook onion in butter in a 5- to 6-quart heavy pot over medium-low heat, stirring, until softened. Add corn, heavy cream, and 6 cups stock and bring to a boil.",
        "Wrap parsley, thyme, bay leaves, and peppercorns in cheesecloth and tie with string to make a bouquet garni. Add to pot with 1 teaspoon salt and 1/2 teaspoon pepper and simmer, covered, 45 minutes.",
        "Discard bouquet garni, then purée corn mixture in batches in a blender until smooth (use caution when blending hot liquids), about 2 minutes per batch. Strain soup as puréed through a fine-mesh sieve into a large heavy saucepan, pressing on and then discarding solids.",
        "Return soup to a simmer, stirring occasionally, and keep warm over low heat. Thin with additional stock if necessary.",
        "Trim mushrooms, discarding any dark gills and tough stems, then slice or tear into bite-size pieces.",
        "Heat 2 tablespoons butter in a 10-inch heavy skillet over medium heat until foam subsides, then cook mushrooms, stirring, until tender and golden, about 8 minutes. Season with salt and pepper.",
        "Transfer mushrooms to a bowl and melt remaining 1 1/2 tablespoons butter in skillet. Meanwhile, toss shrimp with 1/4 teaspoon each of salt and pepper. Cook shrimp in butter, turning occasionally, until barely cooked through, 3 to 4 minutes. Return mushrooms to skillet and cook, stirring, 1 minute. Remove from heat and stir in chives and salt and pepper to taste.",
        "Mound shrimp and mushrooms in shallow bowls, then add soup and top each serving with a dollop of crème fraîche."
    ],
    "ingredients": [
        "1/2 cup finely chopped onion",
        "3 tablespoons unsalted butter",
        "1 (7 1/2-ounce) box Cope's toasted dried sweet corn",
        "1 cup heavy cream",
        "6 to 7 cups chicken stock or reduced-sodium chicken broth",
        "3 flat-leaf parsley sprigs",
        "1 thyme sprig",
        "2 Turkish bay leaves or 1 California",
        "4 black peppercorns",
        "3/4 pound mixed fresh wild mushrooms",
        "3 1/2 tablespoons unsalted butter, divided",
        "3/4 pound medium shrimp in shell, peeled, leaving tail fan attached, and deveined",
        "1/4 cup finely chopped chives",
        "About 3/4 cup crème fraîche",
        "Equipment: cheesecloth; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mushroom",
        "Lunch",
        "Shrimp",
        "Corn",
        "Chive",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cream of Cope's Corn Soup with Shrimp and Wild Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-copes-corn-soup-with-shrimp-and-wild-mushrooms-241191"
}
