{
    "directions": [
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble bacon when cool; set aside. Reserve 1 tablespoon of bacon drippings.",
        "Melt butter with drippings in a saucepan over medium heat.",
        "Cook and stir celery and onion in the saucepan until onion is translucent, about 4 minutes.",
        "Whisk flour into the mixture and cook for 1 minute.",
        "Whisk in chicken broth and bring to a boil.",
        "Add potato and chopped asparagus stalks, reserving the asparagus tips for later. Season with salt and ground black pepper.",
        "Reduce heat and simmer for 20 minutes.",
        "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Cook and stir mushrooms and asparagus tips in the same skillet used for bacon until mushrooms give up their liquid, 5 to 8 minutes. Season with salt and ground black pepper, if needed.",
        "Stir mushrooms, asparagus tips, and half-and-half cream to pureed soup. Cook until thoroughly heated.",
        "Garnish soup with crumbled bacon."
    ],
    "ingredients": [
        "3 slices bacon",
        "1 tablespoon bacon drippings",
        "1/4 cup butter",
        "3 stalks celery, chopped",
        "1 onion, diced",
        "3 tablespoons all-purpose flour",
        "6 cups chicken broth",
        "1 potato, peeled and diced",
        "1 pound fresh asparagus, tips set aside and stalks chopped",
        "salt and ground black pepper to taste",
        "1 (8 ounce) package sliced fresh mushrooms",
        "3/4 cup half-and-half cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cream of Asparagus and Mushroom Soup",
    "url": "http://allrecipes.com/recipe/220091/cream-of-asparagus-and-mushroom-soup/"
}
