{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "Place the parsnips and carrots into a mixing bowl, and sprinkle with 1 tablespoon olive oil. Toss to coat the vegetables with oil, then season to taste with salt and pepper. Spread the vegetables evenly over a baking sheet.",
        "Roast in the preheated oven until the parsnips are tender and golden brown, about 30 minutes.",
        "Heat the remaining 1 tablespoon of olive oil in a large saucepan over medium heat. Stir in the onion and celery. Cook and stir until the vegetables have softened and the onion is beginning to turn golden brown, about 7 minutes. Reduce the heat to low, and stir in the butter, garlic, brown sugar, and the roasted parsnips and carrots. Continue to cook and stir until all of the vegetables are very tender and beginning to brown, about 10 minutes.",
        "Season with the ginger, cardamom, allspice, nutmeg, and cayenne pepper; stir for 1 minute. Pour in the chicken stock, and bring to a boil over medium-high heat. Reduce heat to medium-low, partially cover, and simmer gently until all of the vegetables are very tender, about 15 minutes.",
        "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Stir in the milk and cream. Return to a simmer over medium-low heat. Season to taste with salt and pepper before serving."
    ],
    "ingredients": [
        "2 pounds parsnips, peeled and cut into 1/2 inch pieces",
        "3 carrots, peeled and cut into 1/2-inch pieces",
        "1 tablespoon olive oil",
        "sea salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "1 large onion, diced",
        "3 stalks celery, diced",
        "1 tablespoon butter",
        "3 cloves garlic, minced",
        "1 tablespoon brown sugar",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon cayenne pepper",
        "4 cups chicken stock",
        "1 cup whole milk",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Roasted Parsnip Soup",
    "url": "http://allrecipes.com/recipe/154833/creamy-roasted-parsnip-soup/"
}
