{
    "directions": [
        "Combine chicken, 1 cup water, garlic and bay leaf in large saucepan. Cover and simmer just until chicken is cooked through, turning once, about 15 minutes. Transfer chicken to plate; cool. Shred chicken. Pour cooking liquid into measuring cup, adding more water to measure 1 cup if necessary. Reserve cooking liquid.",
        "Whisk flour and cornstarch in heavy large saucepan. Add 1 cup milk; whisk until smooth. Stir in 1 cup milk, tarragon, salt, nutmeg and reserved 1 cup chicken cooking liquid. Stir over medium heat until mixture thickens and boils, about 5 minutes. Add wine; stir until mixture is very thick, about 2 minutes longer. Remove from heat. Stir in shredded chicken and spinach. (Can be made 1 day ahead. Cover and chill. Rewarm over medium-low heat, stirring frequently, before continuing.)",
        "Preheat oven to 400°F. Oil 11 x 7 x 2-inch glass baking dish. Cook fettuccine in large pot of boiling salted water until just tender but still firm to bite. Drain. Return to pot. Add mushrooms and chicken mixture; toss. Season with salt and pepper. Transfer to prepared baking dish.",
        "Heat oil in small nonstick skillet over medium-high heat. Add breadcrumbs; stir 1 minute. Sprinkle over casserole. Bake until casserole bubbles and breadcrumbs are golden, about 20 minutes. Let stand 10 minutes. Sprinkle with Parmesan."
    ],
    "ingredients": [
        "1pound skinless boneless chicken breast halves",
        "1 1/2 cups (about) water",
        "2 large garlic cloves, minced",
        "1 bay leaf",
        "1/3 cup all purpose flour",
        "2 tablespoons cornstarch",
        "2 cups low-fat (1%) milk",
        "1 teaspoon dried tarragon",
        "1 teaspoon salt",
        "1/8 teaspoon ground nutmeg",
        "1/4 cup dry white wine",
        "1 10-ounce package frozen spinach, thawed, squeezed dry",
        "8 ounces spinach fettuccine",
        "8 ounces mushrooms, sliced",
        "1 1/2 teaspoons olive oil",
        "3/4 cup coarse fresh breadcrumbs from French bread",
        "1/4 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dairy",
        "Leafy Green",
        "Mushroom",
        "Pasta",
        "Poultry",
        "Bake",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Casserole/Gratin",
        "Spinach",
        "Winter",
        "Potluck",
        "Noodle"
    ],
    "title": "Creamy Chicken-Noodle Casserole with Spinach and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-chicken-noodle-casserole-with-spinach-and-mushrooms-4993"
}
