{
    "directions": [
        "Adjust oven rack to lower-middle position and heat oven to 375 degrees. Spray a 9-inch square metal baking pan with cooking spray. Fold a 17-inch length of heavy-duty foil to 8 1/2 inches wide and fit in the pan bottom and up 2 sides, so you can use the foil overhang as a handle to pull the baked cake from the pan.",
        "Topping: Use hands to thoroughly mix ingredients in a medium bowl, pressing together to form large clumps; set aside.",
        "Cream cheese filling: Beat cream cheese and sugar with an electric mixer until thoroughly mixed. Beat in egg and vanilla until smooth; set aside.",
        "Cake: Mix flour, baking powder, baking soda and salt in a medium bowl; set aside.",
        "Beat butter and sugar with an electric mixer set on medium-high until light and fluffy. Beat in egg until smooth. Beat in half the dry ingredients, then the remaining yogurt. Beat until ingredients are fully incorporated.",
        "Spread batter evenly over prepared pan. Spread cream cheese filling over batter. Dollop fruit filling (or sprinkle chocolate chips) over cream cheese filling. Finally, sprinkle evenly with crumble topping, pressing on it lightly to adhere.",
        "Bake until batter is fully set and topping is golden brown, about 45 minutes. Transfer pan to a wire rack to cool for 5 minutes. Run a thin-bladed knife around the sides, then use foil handles to pull cake from pan onto the wire rack. Cool to room temperature and serve. Can be covered with foil and stored at room temperature for one day."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/16122.jpg",
    "ingredients": [
        "Crumble topping:",
        "3/4 cup all-purpose flour",
        "1/2 cup dark brown sugar",
        "1/2 teaspoon ground cinnamon",
        "6 tablespoons butter, melted but not hot",
        "Optional:",
        "1/2 cup of your choice - coarsely chopped nuts (walnuts, pecans, almonds), old-fashioned oatmeal or sweetened flaked coconut",
        "Optional cream cheese filling:",
        "8 ounces softened cream cheese",
        "1/2 cup sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "Coffeecake batter:",
        "1 1/2 cups all-purpose bleached flour",
        "1 1/4 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "5 tablespoons butter, at room temperature",
        "1/2 cup sugar",
        "1 egg",
        "1/4 cup plain low-fat yogurt",
        "Optional fruit (or chocolate) filling:",
        "1/2 cup of your choice - raspberry or strawberry jam; peach, cherry, or pineapple preserves; apple butter; orange marmalade or mini chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cream Cheese-Filled Coffeecake With Fruit Preserves and Crumble Topping",
    "url": "http://allrecipes.com/recipe/85272/cream-cheese-filled-coffeecake-with-f/"
}