{
    "directions": [
        "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. Drain potatoes and reserve 2 1/2 cups of potato water. Chop 2 sweet potatoes and Yukon Gold potato when cool enough to handle; reserve remaining sweet potato for a later step.",
        "Heat olive oil in a large pot over medium heat; cook and stir celery and sweet onion in the hot oil until onion begins to brown, about 10 minutes. Stir 1 chopped sweet potato, chopped Yukon Gold potato, and garlic into mixture. Cook and stir until garlic begins to turn golden, about 8 minutes. Stir corn and 1 chopped sweet potato into onion and celery mixture. Cover pot and cook for 5 minutes, stirring occasionally.",
        "Pour reserved 2 1/2 cups drained potato cooking water into mixture. Place remaining sweet potato and ginger into a food processor and pulse several times to chop; puree and stir into vegetables. Stir soy milk, vegetable broth, parsley, rosemary, sea salt, black pepper, and bay leaf into mixture and bring soup to a boil. Reduce heat to low and simmer 5 minutes.",
        "Whisk flour into soup, stir until thickened, and remove soup from heat."
    ],
    "ingredients": [
        "3 small sweet potatoes, peeled",
        "1 Yukon Gold potato, peeled",
        "2 tablespoons olive oil",
        "1 cup chopped celery",
        "1/2 cup chopped sweet onion",
        "2 cloves garlic, minced",
        "2 cups corn kernels",
        "1 teaspoon chopped fresh ginger (optional)",
        "2 cups soy milk",
        "1 cup vegetable broth",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon dried rosemary (optional)",
        "1 teaspoon sea salt",
        "1 teaspoon ground black pepper",
        "1 bay leaf",
        "1 pinch cayenne pepper (optional)",
        "1/4 cup all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Vegan Sweet Potato and Corn Chowder",
    "url": "http://allrecipes.com/recipe/231184/creamy-vegan-sweet-potato-and-corn-ch/"
}
