{
    "directions": [
        "Position an oven rack in the top position, and preheat the oven to 375 degrees F.",
        "Beat the cream cheese, mozzarella, sour cream, mayonnaise, Parmesan, 2 tablespoons of the breadcrumbs and 1/2 teaspoon salt in a large bowl with an electric mixer on medium high until smooth. Cover and refrigerate until ready to add the shrimp.",
        "Melt 2 tablespoons butter in a large skillet over medium-low heat. Add the shrimp, garlic, 1/4 teaspoon salt and the red pepper flakes, and cook, stirring frequently, until the shrimp just start to turn pink, about 2 minutes. Add the wine, bring to a simmer and cook until the shrimp are pink and cooked through, about 2 minutes (there will be some liquid left in the skillet). Remove the skillet from the heat, and let the shrimp cool completely.",
        "Meanwhile, mix together the parsley, the remaining 2 tablespoons breadcrumbs and 1 tablespoon melted butter, the lemon zest and a pinch of salt in a small bowl.",
        "Stir the shrimp, pan sauce and cream cheese mixtures together to combine; transfer to a 2-quart baking dish. (The dip and breadcrumb mixture can be covered and refrigerated overnight separately at this point.) Sprinkle the breadcrumb mixture over the dip, and bake until hot and bubbly, 15 to 20 minutes. Switch the oven to broil, and cook until the top is golden brown, 1 to 3 minutes. Let rest for a few minutes, then serve hot with bread and/or crackers."
    ],
    "ingredients": [
        "8 ounces cream cheese, at room temperature",
        "1 cup shredded part-skim mozzarella",
        "1 cup sour cream",
        "1/2 cup mayonnaise",
        "1/2 cup grated Parmesan",
        "4 tablespoons plain dried breadcrumbs",
        "Kosher salt",
        "2 tablespoons unsalted butter, plus 1 tablespoon melted unsalted butter",
        "1 pound large peeled and deveined shrimp, tails discarded, cut into 1/4-inch pieces",
        "6 cloves garlic, thinly sliced",
        "Large pinch crushed red pepper flakes",
        "1/2 cup dry white wine",
        "1/2 cup fresh parsley leaves, finely chopped",
        "1 teaspoon lemon zest",
        "Slices of crusty bread and/or crackers, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dip",
        "Shellfish Recipes",
        "Shrimp",
        "Appetizer",
        "Holiday"
    ],
    "title": "Creamy Shrimp Scampi Dip",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/creamy-shrimp-scampi-dip"
}
