{
    "directions": [
        "Bring chicken stock, whipping cream, butter and garlic to boil in heavy large saucepan. Gradually whisk in corn grits. Return to boil, whisking constantly. Reduce heat to low. Simmer uncovered until grits thicken, whisking often, about 15 minutes.",
        "Melt 1/4 cup butter in heavy large skillet over medium-high heat. Add shallots and garlic and sauté until tender, about 4 minutes. Add shrimp and sauté 2 minutes. Using slotted spoon, transfer shrimp to large bowl. Add white wine to skillet and boil until reduced to glaze, about 5 minutes. Add drained diced tomatoes and half of prosciutto and simmer until slightly thickened, about 2 minutes. Add parsley, chives and sautéed shrimp and simmer until shrimp are warmed through, about 2 minutes. Thin sauce with some of reserved tomato juices, if desired. Season to taste with salt and pepper.",
        "Spoon corn grits into shallow bowls. Top each serving with shrimp-prosciutto-tomato mixture, dividing equally. Garnish with remaining prosciutto strips and serve immediately.",
        "*Corn grits, also known as polenta, are available at Italian markets, natural foods stores and some supermarkets. If unavailable, substitute 1 cup regular yellow cornmeal and cook about 8 minutes."
    ],
    "ingredients": [
        "4 1/4 cups chicken stock or canned low-salt chicken broth",
        "3/4 cup whipping cream",
        "6 tablespoons (3/4 stick) butter",
        "1 garlic clove, minced",
        "1 cup corn grits* (such as Arrowhead Mills)",
        "1/4 cup (1/2 stick) butter",
        "1/3 cup finely chopped shallots",
        "1 large garlic clove, minced",
        "2 pounds uncooked large shrimp, peeled, deveined",
        "1/2 cup dry white wine",
        "1 14 1/2-ounce can diced tomatoes in juice, drained, juice reserved",
        "4 ounces prosciutto, cut into thin strips (about 1 cup)",
        "1/4 cup chopped fresh parsley",
        "1/4 cup chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Sauté",
        "Shrimp",
        "Prosciutto",
        "Chive",
        "Parsley",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Creamy Shrimp Grits with Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-shrimp-grits-with-prosciutto-104183"
}
