{
    "directions": [
        "Squeeze juice from 1 lemon half into a large bowl of water, then drop same half into water.",
        "Cut off stem of 1 artichoke, then trim 1/4 inch from end of stem to expose inner core. Trim sides of stem down to pale inner core, then rub with other lemon half. Drop stem into acidulated water.",
        "Cut off top inch of same artichoke with a serrated knife. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until you reach pale yellow leaves with pale green tips. Cut off green tips.",
        "Trim dark green fibrous parts from base and sides of artichoke with a sharp paring knife, then rub cut surfaces with lemon half.",
        "Cut artichoke into 8 wedges, then cut out fuzzy choke and purple leaves with paring knife. Rub all cut surfaces with lemon half, then drop artichoke into acidulated water. 3Prepare remaining artichokes in same manner.",
        "Peel Jerusalem artichokes with a sharp paring knife and cut into 1/4-inch-thick slices.",
        "Cook Jerusalem artichokes, onion, and garlic in butter in a 4-quart heavy pot over moderately low heat, covered, stirring occasionally, 5 minutes. Drain regular artichokes and add to pot along with salt. Cook, covered, stirring occasionally, until Jerusalem artichokes are crisp-tender, about 5 minutes. Add wine and boil, uncovered, until reduced by half, about 3 minutes. Add broth and simmer, covered, until vegetables are very tender, 20 to 25 minutes.",
        "Purée soup in batches in a blender until very smooth, about 2 minutes (use caution when blending hot liquids). Return soup to pot and stir in cream and pepper to taste. Reheat soup, stirring."
    ],
    "ingredients": [
        "1 lemon, halved",
        "1 1/2 lb artichokes (2 or 3)",
        "1/2 lb Jerusalem artichokes",
        "1 cup chopped onion",
        "1 tablespoon chopped garlic",
        "3 tablespoons unsalted butter",
        "3/4 teaspoon salt",
        "1/2 cup dry white wine",
        "3 1/2 cups chicken broth",
        "3/4 cup heavy cream",
        "Garnish: sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Onion",
        "Appetizer",
        "Artichoke",
        "White Wine",
        "Winter",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Cream of Artichoke and Jerusalem Artichoke Soup",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-artichoke-and-jerusalem-artichoke-soup-106241"
}
