{
    "directions": [
        "Roast the chiles over an open flame or close up under a preheated broiler, turning them regularly, until evenly blackened and blistered, about 5 minutes for open flame, 10 minutes for the broiler. Place in a bowl, cover with kitchen towel and cool until handleable. Rub off the blackened skin, pull out the seed pod and scrape out the seeds. Rinse briefly to remove any stray seeds and bits of blackened skin. Cut into 1/4-inch pieces.",
        "Measure the olive oil into a rice cooker and add the onion. Set the lid in place and cook, stirring from time to time, for about 10 minutes or until the rice cooker turns to \"keep warm\" mode—the onions should be translucent and beginning to brown. If using a pressure cooker, cook the onion in it.",
        "Add the rice to the rice cooker and stir it with the onion for a minute. Stir in the broth, roasted chiles and salt (1/2 teaspoon if using salted broth, 1 teaspoon if using unsalted broth). If making the smoky red chile version, stir in the chipotle, canning liquid and paprika. If making the garlicky tomato version, stir in the rehydrated tomatoes and roasted garlic.",
        "For all versions, cover the rice cooker, once again turn it to \"cook\" and let the rice cook for 10 minutes. Stir the mixture thoroughly, re-cover and cook for 10 minutes more. (For the pressure cooker, set over medium heat, time 7 minutes once full pressure is reached, then do a quick release.) Turn off the rice cooker. The rice will look soupy, but the grains should be cooked through and firm; the creamy rice will thicken considerably as you finish the recipe. (If you're craving a bit more richness, stir in a couple tablespoons melted butter or olive oil.)",
        "If making the herby green chile version, stir in the herbs (or Green Chile Adobo).",
        "Stir in the beans and cheese, then taste and add a little more salt if it needs it. Serve in warm, shallow bowls or pasta bowls, sprinkled with a little extra cheese.",
        "Set a large (10-inch) skillet over medium heat and lay in 1/2 head of garlic (separated into cloves but not peeled) and 4 to 5 fresh serrano chiles (stems removed). Roast, turning regularly, until soft and browned in spots, about 10 minutes for the chiles and 15 for the garlic. Cool, slip off the garlic's husks and give it all a rough chop (no need to remove the chile seeds). In a blender or food processor, combine the garlic and chiles with 1 large bunch cilantro, 1 large bunch flat-leaf parsley, 1 cup olive oil and 2 generous teaspoons salt. Process, stopping to scrape down the sides if necessary, until nearly smooth (it should look a little like pesto)."
    ],
    "ingredients": [
        "2 medium fresh poblano peppers (for the red chile version, choose red poblanos, red Anaheim/New Mexicos, red pimentos or red bell peppers)",
        "3 tablespoons olive oil",
        "1 medium white onion, cut into 1/4-inch pieces",
        "1 cup medium-grain rice (you can use Arborio or any other risotto-appropriate rice here)",
        "3 cups chicken or vegetable broth (2 cups if using a pressure cooker)",
        "Salt",
        "1 to 2 canned chipotle chiles en adobo, stemmed, seeded and finely chopped",
        "2 tablespoons chipotle canning sauce",
        "1 tablespoon paprika, preferably smoky Spanish paprika",
        "1/2 15-ounce can white beans, drained",
        "1/4 cup chopped sundried tomatoes, rehydrated for 15 minutes in about 1/4 cup white wine, beer or water",
        "4 unpeeled garlic cloves, roasted in a dry skillet over medium heat for about 15 minutes until soft, peeled and finely chopped",
        "1/2 15-ounce can black beans, drained",
        "3/4 cup chopped fresh herbs (I usually use half cilantro, half parsley) OR 1/4 cup Green Chile Adobo (recipe below)",
        "1/3 cup grated Mexican queso añejo or other garnishing cheese such as Romano or Parmesan",
        "1/2 15-ounce can white (aka Cannellini, Navy or Great Northern) beans, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Rice",
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Hot Pepper",
        "Healthy"
    ],
    "title": "Creamy Rice and Beans in Three Classic Flavors",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-rice-and-beans-in-three-classic-flavors-56389506"
}
