{
    "directions": [
        "In a kettle cook the onion, the celery, and the garlic in the oil over moderately low heat, stirring, until the onion is softened, add the fennel seeds, the clam juice, the Tabasco, the mushrooms, the potatoes, peeled and cut into 3/4-inch pieces, the thyme, and the basil, and simmer the mixture for 15 minutes, or until the potatoes are barely tender. In a small bowl whisk together the cream and the cornstarch, whisk the mixture into the potato mixture, and boil the mixture, whisking, for 1 minute. Stir the monkfish, the scallops, the shrimp, the parsley, and salt and pepper to taste and transfer the mixture to a 3-quart oval baking dish.",
        "On a floured surface roll out the puff pastry into an oval to fit the dish and brush the edge of the dish with water. Arrange the pastry over the edge of the dish and roll the rolling pin over the edge of the dish to cut the pastry. Bake the potpie in the middle of a preheated 425°F. oven for 17 to 20 minutes, or until the crust is puffed and golden brown. To serve, cut the crust into 8 pieces, arrange 1 piece on each of 8 heated dinner plates, and divide the filling among the plates."
    ],
    "ingredients": [
        "1 onion, minced",
        "1 rib of celery, sliced thin",
        "2 teaspoons minced garlic",
        "2 tablespoons olive oil",
        "1/2 teaspoon fennel seed",
        "1 cup bottled clam juice",
        "a 14-ounce can tomatoes including the juice",
        "a dash of Tabasco",
        "1/4 pound mushrooms, cut into eighths",
        "1 pound boiling potatoes",
        "1/2 teaspoon dried thyme, crumbled",
        "1/2 teaspoon crumbled dried basil",
        "1/2 cup heavy cream",
        "3 tablespoons cornstarch",
        "1 1/2 pounds monkfish fillets, cut into 1-inch pieces",
        "1/2 pound sea scallops, halved crosswise",
        "1/2 pound shrimp, shelled",
        "2 tablespoons finely chopped fresh parsley leaves",
        "1 sheet of frozen puff pastry, thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Mushroom",
        "Potato",
        "Tomato",
        "Bake",
        "Scallop",
        "Shrimp",
        "Winter",
        "Gourmet"
    ],
    "title": "Creamy Monkfish, Tomato, and Shellfish Potpie with Puff Pastry Crust",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-monkfish-tomato-and-shellfish-potpie-with-puff-pastry-crust-10292"
}
