{
    "directions": [
        "In a bowl with a pastry blender or in a food processor blend or pulse flour, sugar, and salt to combine and add butter and cream cheese, blending or pulsing until mixture resembles coarse crumbs. In a small bowl stir together yolk and vanilla and add to flour mixture, blending or pulsing just until mixture begins to come together (do not overmix). Gather dough into a ball and flatten into a disk. Chill dough, wrapped in plastic wrap, at least 1 hour and up to 2 days.",
        "Preheat oven to 375° F.",
        "Halve dough. On a lightly floured cool surface knead half of dough (keeping other half wrapped and chilled) 2 or 3 times to make it less crumbly. Roll out dough 1/4 inch thick and with a 3-inch cutter cut out as many rounds as possible. Transfer rounds with a metal spatula to a large baking sheet, arranging about 1/2 inch apart. Reroll scraps and cut out more rounds. Put 1 teaspoon filling in center of each round and fold up edges to form triangular cookies resembling a tricornered hat, pinching corners together and leaving filling exposed. (Pinch dough tightly enough so seams are no longer visible and sides are taut enough to prevent cookies from leaking filling as they bake.)",
        "Bake hamantaschen in middle of oven 20 minutes, or until pale golden. Cool hamantaschen on baking sheet 5 minutes and transfer to racks to cool completely. Make more hamantaschen with remaining dough and filling in same manner. Hamantaschen keep in an airtight container at room temperature 5 days."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/4 cup sugar",
        "1/8 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "4 ounces (1/2 cup) cream cheese, cut into bits",
        "1 large egg yolk",
        "1 teaspoon vanilla",
        "2/3 cup filling such as apricot jam, Date Orange Filling , Apple Raisin Filling , prune lekvar, or poppy-seed filling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Purim",
        "Cream Cheese",
        "Jam or Jelly",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cream Cheese Hamantaschen",
    "url": "http://www.epicurious.com/recipes/food/views/cream-cheese-hamantaschen-13708"
}
