{
    "directions": [
        "Melt 1/2 cup butter in a heavy-bottomed stock pot or dutch oven over medium-high heat. Cook and stir the leek, carrot, and celery in the melted butter until tender, 5 to 7 minutes.",
        "As the vegetables cook, melt 1/2 cup butter in a skillet over medium heat. Make a roux by cooking and stirring the flour into the butter until just a little golden, just enough to cook off the flour taste. This is not a heavy gumbo roux.",
        "Stir the tarragon, thyme, bay leaf, tomato paste, and cayenne pepper to the vegetable mixture; stir to distribute evenly. Pour the brandy over the mixture; cook and stir until the heat cooks off most of the brandy, 2 to 3 minutes. Pour 1 cup of the fish stock over the mixture.",
        "Pour the hot mixture into a blender, filling the pitcher no more than halfway. Hold the lid of the blender in place with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the mixture moving before leaving it on to puree. Puree in batches until smooth and pour back into the stock pot. Alternately, you can use a stick blender and puree the mixture in the pot without using the blender.",
        "Stir in the roux and 1 cup more of the fish stock to the pureed mixture; return to heat, stirring well.",
        "Blend the diced tomatoes and about 3/4 of the crawfish tails together in a blender until smooth; stir into the stock pot. Add the remaining fish stock; stir. Bring the mixture to a boil, reduce heat to medium-low, and simmer another 2 to 3 minutes. Stir the heavy cream through the liquid; return to a simmer, but do not allow to come to a boil. Season with the salt and white pepper. Serve hot in bowls garnished with the remaining crawfish tails and the paprika."
    ],
    "ingredients": [
        "1/2 cup butter",
        "1 leek, minced",
        "1 large carrot, minced",
        "1 cup minced celery",
        "1/2 cup butter",
        "1/2 cup all-purpose flour, or more if needed",
        "2 tablespoons chopped fresh tarragon",
        "2 tablespoons chopped fresh thyme",
        "1 bay leaf",
        "2 tablespoons tomato paste",
        "1/2 teaspoon ground cayenne pepper",
        "1/2 cup brandy",
        "3 1/2 cups fish stock, divided",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (16 ounce) package crawfish tails, divided",
        "3 cups heavy cream",
        "1 teaspoon salt, or to taste",
        "1 teaspoon white pepper",
        "2 tablespoons paprika, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Crawfish Bisque",
    "url": "http://allrecipes.com/recipe/214458/creamy-crawfish-bisque/"
}
