{
    "directions": [
        "Bring 1/4 cup water to boil in large pot. Add half of spinach to pot; toss until wilted but still bright green, about 3 minutes. Add remaining spinach and toss until just wilted. Transfer spinach to strainer set over large bowl. Press on spinach to release all liquid. Transfer spinach to work surface; coarsely chop. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Melt butter in heavy medium saucepan over medium heat. Add onion, bay leaf, dried chile, and peppercorns; sauté until onion is soft but not brown, about 3 minutes. Whisk in flour and salt. Cook until mixture is pale gold and has nutty aroma, whisking constantly, about 3 minutes. Gradually whisk in milk. Boil until thick, stirring constantly, about 2 minutes. Strain béchamel sauce into medium bowl.",
        "Heat cream in heavy medium saucepan over medium heat until just simmering. Add béchamel; whisk until mixture is smooth and begins to simmer. Add spinach and stir until heated through. Season to taste with salt and pepper."
    ],
    "ingredients": [
        "1/4 cup water",
        "4 6-ounce bags baby spinach leaves",
        "2 tablespoons (1/4 stick) butter",
        "1/3 cup chopped onion",
        "1 bay leaf",
        "1/2 dried small red chile, such as Japones or de árbol",
        "1/4 teaspoon black peppercorns",
        "1/4 cup all purpose flour",
        "1/4 teaspoon salt",
        "1 1/4 cups whole milk",
        "1/2 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Leafy Green",
        "Onion",
        "Pepper",
        "Side",
        "Sauté",
        "Thanksgiving",
        "Quick & Easy",
        "Spinach",
        "Hot Pepper",
        "Fall",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Creamed Spinach Deluxe",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-spinach-deluxe-234150"
}
