{
    "directions": [
        "Preheat the oven to 350°F. Set aside an 8 x 4-inch loaf pan (4-cup capacity), 10-inch round cake pan, or twelve 4-ounce ramekins. Have ready a heatproof dish or pan at least 3 inches deep that is large enough to hold the pan or ramekins comfortably.",
        "To make the caramel, combine the sugar in a small pan with the water and bring to a boil over medium heat, watching carefully until the mixture thickens to look like a syrup, bubbles quickly, and turns a rich caramel color. Quickly pour the hot caramel into the cake pan (or ramekins) and swirl to coat the bottom(s) and sides evenly before the mixture hardens. Set aside and let cool while you make the flan.",
        "To make the flan, combine the whole milk and condensed milk in a saucepan. Add the rum, star anise, cinnamon sticks, aniseed, vanilla and almond extracts, vanilla beans and the seeds, nutmeg, and salt. Bring barely to a boil, reduce the heat to low, and simmer gently for 2 to 3 minutes. Add the chocolate, stirring with a wooden spoon to help it melt and blend. Remove from the heat and let the spiced chocolate mixture cool to room temperature. When the mixture is cool, remove the vanilla bean, cinnamon sticks, and star anise with a fork or slotted spoon.",
        "Meanwhile, preheat the oven to 335°F. Set up a hot water bath by having ready a kettle of boiling water and a baking dish large enough to hold the cake pan (or ramekins).",
        "With a wooden spoon, beat the cream cheese in a large mixing bowl until softened. Beat in the yolks and whole eggs, one at a time, using a whisk or electric mixer. Slowly add the cooled chocolate mixture, whisking to blend completely. Strain the mixture through a medium-mesh strainer into the caramel-coated cake pan or ramekins. Place the pan or ramekins in the reserved larger baking dish, slide into the oven, and carefully pour in enough hot water to come halfway up the outside of the cake pan or ramekins.",
        "Bake the large flan for about 1 hour; bake the ramekins for 30 to 40 minutes. Don't expect the custard to be completely set in the center. Remove from the oven, lift from the water bath, and let cool to room temperature. Refrigerate in the pan for at least 3 hours before turning the flan out onto a platter (or individual dishes). Serve with the Hibiscus Sauce."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/4 cup water",
        "4 1/2 cups fresh whole milk",
        "1 (14-ounce) can sweetened condensed milk",
        "1/4 cup aged dark rum",
        "6 star anise pods",
        "2 (3-inch) sticks true cinnamon (see above)",
        "1 teaspoon aniseed",
        "1 teaspoon pure vanilla extract, preferably Mexican",
        "1 teaspoon bitter almond extract",
        "2 plump Mexican vanilla beans, split lengthwise, seeds scraped and reserved",
        "Pinch of freshly grated nutmeg",
        "1/8 teaspoon salt",
        "6 ounces dark chocolate, preferably Cluizel Concepción (66% cacao), finely chopped",
        "6 ounces cream cheese, warmed to room temperature",
        "6 large egg yolks",
        "2 whole large eggs",
        "Hibiscus Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cream Cheese",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamy Chocolate-Cheese Flan with Hibiscus Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-chocolate-cheese-flan-with-hibiscus-sauce-51202810"
}
