{
    "directions": [
        "Preheat oven to 400 degrees F. Cook pasta according to package directions. Drain and rinse with cold water; drain and set aside.",
        "For sauce, in a medium saucepan cook onion in hot butter over medium heat for 4 minutes or until tender but not brown. Stir in flour and salt. Add milk all at once. Cook and stir until thickened and bubbly. Remove from heat; set aside.",
        "For filling, in a medium bowl combine Grilled & Ready(R) Grilled Chicken Breast Strips, ham, egg yolk, the 1/2 teaspoon nutmeg, 1 cup of the Parmesan cheese and the ricotta cheese. Pour about 1/2 cup of the sauce into a buttered 2-quart rectangular baking dish; spread in a thin layer over bottom of dish.",
        "Use a pastry tube fitted with the largest tip to pipe the filling into the cooked manicotti. (Or carefully spoon about 1/3 cup of the filling into each shell.) Arrange the filled manicotti in the baking dish in a single layer. Pour the remaining sauce over the manicotti. Sprinkle the remaining 1/4 cup Parmesan cheese over the sauce.",
        "Bake, uncovered, for 20 minutes or until manicotti are light golden and heated through. Let stand 5 to 10 minutes before serving. If desired, garnish with a sprinkling of ground nutmeg and parsley."
    ],
    "ingredients": [
        "8 dried manicotti shells",
        "1/4 cup finely chopped onion",
        "1/4 cup butter",
        "3 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "2 cups whole milk",
        "1 (6 ounce) package Tyson® Grilled and Ready® Fully Cooked Refrigerated Grilled Chicken Breast Strips, finely chopped",
        "1/2 cup chopped cooked ham",
        "1 egg yolk",
        "1/2 teaspoon ground nutmeg",
        "1 1/4 cups grated Parmesan cheese",
        "1 (15 ounce) container ricotta cheese",
        "Ground nutmeg (optional)",
        "Fresh flat-leaf parsley (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Chicken Manicotti",
    "url": "http://allrecipes.com/recipe/236057/creamy-chicken-manicotti/"
}
