{
    "directions": [
        "Place beans in heavy large saucepan. Add enough water to pan to cover beans by 4 inches. Let beans soak overnight at room temperature.",
        "Drain and rinse beans; return to same saucepan. Add 8 cups water, 1 tablespoon oil, smashed garlic clove, rosemary, and bay leaf. Bring to boil. Reduce heat to medium-low, partially cover, and simmer until beans are just tender, 1 to 11/2 hours. Season to taste with salt. (Can be prepared 2 days ahead. Cool slightly, cover, and chill.)",
        "Drain beans, reserving cooking liquid. Discard rosemary sprig and bay leaf. Heat remaining 2 tablespoons oil in heavy large pot over medium heat. Add onion, carrot, and celery. Sprinkle with salt and pepper. Sauté until vegetables are beginning to soften, about 10 minutes. Add chopped garlic and 1 teaspoon thyme; sauté 2 minutes. Add 2 cups reserved bean cooking liquid, 4 cups chicken broth, and beans. Bring to boil; reduce heat to medium and simmer uncovered until vegetables are tender, about 25 minutes. Cool soup 10 minutes. Meanwhile, sauté chorizo in heavy large skillet over medium-high heat until cooked through, breaking up lumps with back of spoon, about 5 minutes. Transfer chorizo to paper towels to drain.",
        "Using slotted spoon, remove 1 1/2 cups bean mixture from soup; reserve. Working in batches, puree remaining soup in blender until smooth. Return puree to pot. Stir in reserved whole-bean mixture, remaining 1 1/2 teaspoons thyme, chorizo, and cream. (Can be made 1 day ahead. Chill uncovered until cold. Cover and keep chilled.) Rewarm soup over medium heat, thinning with more broth if desired. Season with salt and pepper. Divide soup among bowls and serve."
    ],
    "ingredients": [
        "1 pound dried cannellini or Great Northern beans (generous 2 cups)",
        "8 cups water",
        "3 tablespoons extra-virgin olive oil, divided",
        "3 garlic cloves; 1 smashed, 2 chopped",
        "1 large fresh rosemary sprig",
        "1 bay leaf",
        "1 large onion, coarsely chopped (about 2 cups)",
        "1 large carrot, coarsely chopped (about 1 cup)",
        "1 large celery stalk, coarsely chopped (about 3/4 cup)",
        "2 1/2 teaspoons finely chopped fresh thyme, divided",
        "4 cups (or more) low-salt chicken broth",
        "1 pound fresh chorizo link sausages, casings removed",
        "1/4 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Bean",
        "Sauté",
        "Sausage",
        "Celery",
        "Carrot",
        "Winter"
    ],
    "title": "Creamy White Bean and Chorizo Soup",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-white-bean-and-chorizo-soup-233903"
}
