{
    "directions": [
        "Bring a medium pot of water to a boil; add asparagus (make sure water covers asparagus). Cook 5 minutes. Drain, reserving 1 cup asparagus water. Remove 16 asparagus tips; cut in half lengthwise; set aside. Heat butter in a medium saucepan over low heat until melted. Cook onion, leek and celery, covered, stirring occasionally, until soft but not brown, 10 to 16 minutes. Add salt. Add broth; bring to a simmer. Cook, partially covered, 8 minutes. Purée broth mixture, asparagus (not tips) and reserved asparagus water in a blender, in 2 batches. (Remove center part of blender lid to prevent hot liquid from bubbling over. Instead, hold a folded dish towel over hole in cap.) Return pureed soup to pot; heat until it just reaches a simmer. Season with pepper and, if desired, nutmeg. Cover; remove from heat. In a small pan, toast pine nuts over medium-low heat, shaking pan occasionally, until nuts are fragrant and browned in some spots, about 6 minutes. Season nuts with salt. Divide soup among 4 bowls; top each with 8 asparagus-tip halves and toasted pine nuts."
    ],
    "ingredients": [
        "1 pound asparagus, cut into 1-inch pieces",
        "1 1/2 teaspoons butter",
        "1 small onion, coarsely chopped",
        "1/2 leek, trimmed of all but 1 inch of dark-green top, sliced",
        "1 celery stalk, sliced",
        "1/4 teaspoon salt",
        "2 3/4 cups low-sodium chicken broth",
        "White pepper",
        "Pinch of nutmeg (optional)",
        "1 tablespoon pine nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Nut",
        "Onion",
        "Vegetable",
        "Low Cal",
        "Dinner",
        "Lunch",
        "Pine Nut",
        "Asparagus",
        "Celery",
        "Healthy",
        "Self",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Creamy Asparagus Soup",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-asparagus-soup-238645"
}
