{
    "directions": [
        "Brush melted butter over bottom (not sides) of 9-inch-diameter tart pan with removable bottom. Blend flour, almonds, sugar, and salt in processor until nuts are finely ground. Add 6 tablespoons diced butter. Blend until mixture resembles coarse meal. Add yolk. Blend until dough comes together in moist clumps. Press dough evenly onto bottom and up sides of pan. Pierce dough all over with fork. Freeze until firm, at least 30 minutes. DO AHEAD: Can be made 1 day ahead. Keep frozen.",
        "Preheat oven to 400°F. Bake crust until deep golden brown (crust will puff slightly), about 18 minutes. Transfer crust to rack and cool completely.",
        "Place 2 teaspoons water in small cup. Sprinkle gelatin over. Let stand until gelatin softens, 10 to 12 minutes.",
        "Whisk yolks, sugar, cornstarch, and orange peel in medium bowl to blend. Bring milk to simmer in heavy medium saucepan over medium heat. Gradually whisk hot milk into yolk mixture. Return to same saucepan. Whisk until custard thickens and boils, about 2 minutes. Remove from heat. Add gelatin mixture and whisk until dissolved and custard is smooth.",
        "Transfer custard to another medium bowl. Let cool to room temperature, stirring occasionally, about 30 minutes (custard will be very thick).",
        "Beat cream in medium bowl until peaks form. Whisk custard until smooth. Fold whipped cream into custard in 3 additions. Transfer filling to crust. Chill tart until filling sets, at least 3 hours and up to 8 hours.",
        "Cut 1/3 inch off top and bottom of each orange. Stand 1 orange on flat end. Cut off all peel and pith, following contour of fruit. Working over bowl, cut between membranes, releasing orange segments.",
        "Gently slide tip of small knife between crust and sides of pan to loosen crust. Push up tart pan bottom, releasing tart.",
        "Cut tart into wedges. Transfer to plates. Arrange several orange segments atop each wedge of tart; drizzle with honey and serve."
    ],
    "ingredients": [
        "Melted butter for pan plus 6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "3/4 cup all purpose flour",
        "3/4 cup whole almonds, toasted, cooled",
        "1/4 cup sugar",
        "3/4 teaspoon (scant) salt",
        "1 large egg yolk",
        "2 teaspoons water",
        "1/4 teaspoon plain unflavored gelatin",
        "3 large egg yolks",
        "1/4 cup sugar",
        "4 1/2 teaspoons cornstarch",
        "1/2 teaspoon finely grated orange peel",
        "1 cup whole milk",
        "1/2 cup chilled heavy whipping cream",
        "3 oranges",
        "Honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "High Fiber",
        "Orange",
        "Almond",
        "Chill",
        "Honey",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Cream Tart with Oranges, Honey, and Toasted-Almond Crust",
    "url": "http://www.epicurious.com/recipes/food/views/cream-tart-with-oranges-honey-and-toasted-almond-crust-357275"
}
