{
    "directions": [
        "In a kettle melt the butter over moderately low heat and in it cook the onion, the carrots, and the celery, stirring occasionally, until the vegetables are softened.",
        "Add the wine and cook the mixture for 3 minutes. Add the flour and cook the roux, stirring, for 3 minutes. Add the broth in a stream and bring the sauce to a boil, whisking. In a bowl whisk together the cream and the yolks, whisk about 1/2 cup of the sauce into the bowl to temper the cream mixture, and add the cream mixture, in a stream, to the sauce. Cook the mixture over moderately low heat, whisking, until it is thickened (do not let it boil) and stir in the turkey, the rosemary, and salt and pepper to taste.",
        "In a bowl whisk together the flour, the baking powder, the salt, the rosemary, the parsley, and pepper to taste, add the milk, and stir in the batter until it is just combined.",
        "Drop the batter by spoonfuls into 6 or 8 mounds (do not let the liquid boil), simmer the dumplings, uncovered, for 10 minutes, and simmer them, covered, for 10 minutes more.",
        "Drop the batter by spoonfuls into 6 or 8 mounds onto the simmering turkey mixture ( do not let the liquid boil), simmer the dumplings, uncovered, for 10 minutes, and simmer them, covered, for 10 minutes more."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 onion, minced",
        "4 carrots, cut in 2-inch julienne strips (about 2 cups)",
        "2 ribs of celery, cut into 2-inch julienne strips (about 1 cup)",
        "1/3 cup dry white wine",
        "2 tablespoons all-purpose flour",
        "3 cups chicken broth",
        "3/4 cup heavy cream",
        "2 large egg yolks",
        "4 cups bite-size pieces cooked turkey",
        "3/4 teaspoon finely chopped fresh rosemary or 1/2 tablespoon crumbled dried",
        "1 cup all-purpose flour",
        "1 1/2 teaspoons double-acting baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon crumbled dried rosemary",
        "1 tablespoon minced fresh parsley leaves",
        "1/2 cup milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Rosemary",
        "Gourmet"
    ],
    "title": "Creamy Rosemary Turkey and Vegetable Potpie with Herbed Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-rosemary-turkey-and-vegetable-potpie-with-herbed-dumplings-10303"
}
