{
    "directions": [
        "Using electric mixer, beat unsalted butter and egg yolks in large bowl until fluffy. Beat in sugar. Beat in flour and salt just until blended, adding water by tablespoonfuls if dough is dry. Transfer dough to lightly floured work surface. Gather dough together. Shape dough into ball; flatten into disk. Wrap dough in plastic and refrigerate 1 hour. Soften dough slightly at room temperature before rolling out.",
        "Whisk eggs, sugar, cream, lemon juice, and grated lemon peel in medium metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk slowly but constantly until mixture thickens and instant-read thermometer inserted into mixture registers 160°F, about 20 minutes. Remove bowl from over water. Cool mixture to room temperature, whisking occasionally.",
        "Preheat oven to 350°F. Roll out dough on lightly floured surface to 13-inch round. Transfer dough to 10-inch-diameter tart pan with removable bottom. Fold in dough edges, forming double-thick sides. Freeze crust 15 minutes. Line crust with foil; fill with pie weights or dried beans. Bake 15 minutes. Remove pie weights. Bake until crust is golden and cooked through, about 30 minutes longer. Cool crust in pan on rack.",
        "Spread filling evenly in crust. Chill overnight to allow filling to set."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 large egg yolks",
        "1 tablespoon sugar",
        "2 1/4 cups unbleached all purpose flour",
        "1/4 teaspoon salt",
        "3 tablespoons (about) water",
        "5 large eggs",
        "1 cup sugar",
        "3/4 cup heavy whipping cream",
        "2/3 cup fresh lemon juice",
        "3 tablespoons grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Bake",
        "Lemon",
        "Spring",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamy Lemon Tart",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-lemon-tart-106503"
}
