{
    "directions": [
        "Bring clam juice and wine to simmer in heavy large pot. Add clams, then mussels to pot. Cover; cook until shellfish begin to open, about 2 minutes for mussels and about 8 minutes for clams. Using slotted spoon, transfer shellfish to large bowl as they open. Discard any that do not open after 12 minutes. Reserve liquid in pot.",
        "Add shrimp shells to cooking liquid. Cover and simmer over low heat 10 minutes, stirring occasionally. Strain liquid into 4-cup glass measuring cup. Discard solids.",
        "Melt butter in clean large pot over low heat. Add leek. Cover; cook until leek is tender, stirring occasionally, about 10 minutes. Add potato and celery root. Pour in reserved cooking liquid, leaving any sediment in measuring cup. Add Calvados. Bring to simmer. Cover and simmer until potato is almost tender, stirring occasionally, about 5 minutes. Stir in shrimp and scallops. Cover; simmer 2 minutes.",
        "Whisk crème fraîche, egg yolks and lemon juice in small bowl to blend. Stir into stew. Return clams and mussels to pot. Cover and cook without boiling until shrimp and scallops are just cooked through, stirring occasionally, about 5 minutes. Season with salt and pepper. Divide among bowls. Sprinkle parsley over."
    ],
    "ingredients": [
        "2 1/2 cups bottled clam juice",
        "1 1/2 cups dry white wine",
        "12 littleneck clams, scrubbed",
        "12 mussels, scrubbed, debearded",
        "3/4 pound uncooked large shrimp, peeled, deveined, shells reserved",
        "1/4 cup (1/2 stick) butter",
        "1 cup finely chopped leek (white and pale green parts only)",
        "1 medium potato, peeled, cut into 1/2-inch pieces",
        "1 cup chopped peeled celery root",
        "1/3 cup Calvados",
        "3/4 pound bay scallops",
        "1/2 cup crème fraîche",
        "3 large egg yolks",
        "2 teaspoons fresh lemon juice",
        "1/4 cup chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Dairy",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Stew",
        "Dinner",
        "Seafood",
        "Clam",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Root Vegetable",
        "Fall"
    ],
    "title": "Creamy Shellfish and Root Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-shellfish-and-root-vegetable-stew-4673"
}
