{
    "directions": [
        "Butter 8x8x2-inch glass baking dish. Melt 1 tablespoon butter in large nonstick skillet over medium-high heat. Add mushrooms; sauté until juices have cooked away, about 10 minutes. Transfer mushrooms to large bowl.",
        "Melt 1 tablespoon butter in same skillet over medium-high heat. Add onions; sauté until brown and tender but still holding shape, about 6 minutes. Add to bowl with mushrooms. Melt 1 tablespoon butter in same skillet over medium heat. Add brussels sprouts; sauté until browned, about 10 minutes. Add 1/2 cup broth to skillet. Cover and simmer until brussels sprouts are tender, stirring often, about 10 minutes. Uncover and cook until liquid evaporates, about 1 minute. Add to bowl with mushrooms.",
        "Melt 1 tablespoon butter in same skillet over medium heat. Add garlic and thyme; sauté 1 minute. Add flour and stir 1 minute. Gradually add remaining 2 cups broth and cream and bring to boil, whisking often. Boil until reduced to 1 1/4 cups, about 8 minutes. Mix sauce into vegetables in bowl. Season with salt and pepper. Transfer vegetables to prepared dish. (Can be made 3 days ahead. Cover and chill.)",
        "Preheat oven to 375°F. Melt 1 tablespoon butter in small saucepan. Mix in breadcrumbs and cheese. Sprinkle crumb mixture over vegetables. Bake uncovered until vegetables are heated through and topping is golden, about 35 minutes."
    ],
    "ingredients": [
        "5 tablespoons butter",
        "1 pound oyster mushrooms, cut into 1-inch-wide pieces",
        "15 ounces frozen whole petite onions (about 2 1/2 cups; do not thaw)",
        "1 pound small brussels sprouts (about 4 cups), trimmed, halved",
        "2 1/2 cups low-salt chicken broth",
        "2 garlic cloves, minced",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 1/2 tablespoons all purpose flour",
        "2/3 cup whipping cream",
        "1 cup fresh breadcrumbs made from crustless French bread",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Onion",
        "Vegetable",
        "Sauté",
        "Thanksgiving",
        "Casserole/Gratin",
        "Parmesan",
        "Fall",
        "Brussel Sprout"
    ],
    "title": "Creamed Mushrooms, Onions, and Brussels Sprouts",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-mushrooms-onions-and-brussels-sprouts-108828"
}
