{
    "directions": [
        "1. The dough. Measure the flour, butter, and shortening (or lard) into a bowl or a food processor fitted with the metal blade. Quickly work the fats into the flour with a pastry blender or pulse the food processor until the flour looks a little damp (not powdery) but tiny bits of fat are still visible. If using the food processor, transfer the mixture to a bowl.",
        "Mix together the sugar, salt and 2 tablespoons of ice water. Using a fork, little by little work the ice-water mixture into the flour mixture. The dough will be in rough, rather stiff clumps; if there is unincorporated flour in the bottom of the bowl, sprinkle in a little more ice water and use the fork to work it together. Press the dough together into a flat disk, wrap in plastic, and refrigerate at least 1 hour.",
        "On a lightly floured surface, roll the dough into a 12-inch circle. Transfer to a 9-inch glass pie pan (I find it easiest to roll the dough onto the rolling pin, then unroll it onto the pie pan). Decoratively crimp the edge and trim the excess dough. Refrigerate 30 minutes.",
        "2. Prebaking the crust. Heat the oven to 400 degrees. Lightly oil a 15-inch piece of foil and lay it, oiled-side down, into the crust (heavy duty foil is too stiff to work here); press down to line the crust snugly. Fill with beans or pie weights and bake about 15 minutes, until beginning to brown around the edges. Reduce the oven temperature to 350 degrees. Carefully remove the beans (or weights) and foil, return the crust to the oven and bake 8 to 10 minutes, until it no longer looks moist. (If it bubbles at this point, gently press it down with the back of a spoon.) Brush the beaten egg yolk over the crust, then let cool completely.",
        "3. The Filling. Crack the eggs into a large bowl; measure in the lime zest, sugar and masa harina or flour, and beat by hand until thoroughly combined. Stir in the thick cream, lime juice, orange juice and orange liqueur.",
        "4. Baking the pie. Pour the filling into the prebaked pie shell, set in the lower third of the 350-degree oven, and bake until nearly set in the center (a knife inserted halfway between the edge and the center should come out clean), about 45 minutes.",
        "Cool slightly; serve warm, dusted with powdered sugar and with sauce dribbled around.",
        "This delicate pie is best served shortly after it is baked."
    ],
    "ingredients": [
        "1 cup (4 1/2 ounces) all-purpose flour (measured by scooping and leveling)",
        "4 tablespoons (2 ounces) chilled unsalted butter, cut into 1/2-inch bits",
        "2 tablespoons chilled vegetable shortening or rich-tasting lard, chilled, cut into 1/2-inch bits",
        "1/2 teaspoon sugar",
        "1/8 teaspoon salt",
        "1 egg yolk, beaten slightly",
        "3 large eggs, room temperature",
        "1 1/2 tablespoons finely chopped lime zest (colored rind only)",
        "2/3 cup sugar",
        "3 tablespoons masa harina or 3 tablespoons all-purpose flour",
        "1 cup plus 2 tablespoons room-temperature Thick Cream or crème fraîche",
        "6 tablespoons fresh lime juice",
        "6 tablespoons fresh orange juice",
        "1 1/2 tablespoons orange liqueur",
        "Powdered sugar, for garnish",
        "About 2 cups Crimson Prickly Pear Sauce or other fruit sauce for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Dairy",
        "Dessert",
        "Bake",
        "Lime",
        "Hominy/Cornmeal/Masa",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamy Lime Pie",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-lime-pie-105447"
}
