{
    "directions": [
        "Sprinkle about 1/4 teaspoon of the turmeric on one side of the salmon fillet and press it into the fish. Turn the fish over and repeat with the remaining 1/4 teaspoon of turmeric. Set the salmon aside as you prepare the spice paste.",
        "Combine the vinegar, chiles, salt, and nutmeg in a small bowl to make a slurry. Set the slurry aside.",
        "Fill up a medium-size bowl with cold water. Take a leaf of kale, cut along both sides of the tough rib, and discard it. Slice the leaf in half lengthwise. Repeat with the remaining leaves. Stack the leaf halves, about 6 at a time, one on top of the other, and roll them into a tight log. Thinly slice the log crosswise; you will end up with long, slender shreds. When cutting the kale, you can’t help notice how strong smelling and grassy it is (no wonder I love the smell of fresh-mowed grass in the summer). Dunk the shreds into the bowl of water to rinse off any grit, then scoop the shreds out and drain them in a colander. Repeat once or twice if the kale does not appear clean.",
        "Heat the oil in a large skillet over medium-high heat. Once the oil appears to shimmer, add the turmeric-smeared fillet to the skillet. The instant sizzle and sear will turn the salmon light brown on the underside, about 2 minutes. Turn it over and repeat with the second side, about 2 minutes. Transfer the fish to a plate. Add the garlic to the skillet and stir-fry it until light brown and aromatic, about 1 minute.",
        "Pour the vinegar-based spice slurry into the skillet and stir to mix with the garlic. Simmer, uncovered, stirring occasionally, about 2 minutes. The pungency will slap you in the face (in a good way—I promise) and the liquid will release all the browned bits of fish from the bottom of the skillet into the thin sauce.",
        "Add the kale shreds and stir to coat them evenly with the liquid. Pour 1/2 cup of water into the skillet and stir. Lower the heat to medium, cover the skillet, and stew the kale, stirring occasionally, until the shreds are tender when tested (and tasted, I hope), 5 to 8 minutes.",
        "Stir the coconut milk into the kale. Let the milk come to a boil uncovered. Add the seared salmon to the liquid, basting it to make sure it continues to poach. Cook, uncovered, scooping up the sauce and basting the fish occasionally, until it barely starts to flake, 3 to 5 minutes.",
        "Transfer the fish to a serving plate. Let the sauce boil, uncovered, stirring occasionally, until it thickens, 3 to 4 minutes. Pour the sauce over the salmon and serve.",
        "A stout bunch, dark green and spritely, Tuscan kale stands for the epitome of winter bravado. Even though it grows all through the year, we often associate kale with cold weather, that brightness among a sea of white, very much like the evergreen Christmas tree. Curly, ornamental (those tight bases of light purple leaves with a frizzy head of green), or Russian kale—all varieties work well for this recipe. Bursting with antioxidants, vitamins A and C, and iron, kale is a nutritional powerhouse among a sea of greens. Its tough leaves make it harder to cook than some greens, but with the right amount of moisture, it turns tender within about 5 minutes.",
        "To grind the chiles de árbol, pulverize them in a spice grinder (like a coffee grinder) until they are the texture of finely ground black pepper. The heat from freshly ground dried chiles is much more intense than preground cayenne.",
        "Before opening a can of coconut milk, shake it well to make sure the thick milk gets dispersed evenly. If the can sits around unopened, the thicker part usually floats to the top and congeals into a creamy mass. If shaking does nothing (usually if the can has been sitting in a cool spot, this will happen), then once you open the can, scrape the contents into a small bowl, and whisk the thicker milk with the wheylike separated liquid to create an evenly thick milk."
    ],
    "ingredients": [
        "1/2 teaspoon ground turmeric",
        "1 1/2 pounds skinless, boneless wild salmon fillet in a single piece (such as Alaskan or Copper River)",
        "1/4 cup cider vinegar",
        "4 dried red cayenne chiles (like chile de árbol), stems discarded, ground (do not remove the seeds; see Extra Credit below) or 1 teaspoon ground red pepper (cayenne)",
        "1 teaspoon coarse kosher or sea salt",
        "1/4 teaspoon ground nutmeg",
        "1 medium-size bunch fresh kale (about 8 ounces)",
        "2 tablespoons canola oil",
        "6 large cloves garlic, either thinly sliced or finely chopped",
        "1 can (13.5 to 15 ounces) unsweetened coconut milk (see Extra Credit below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Salmon",
        "Kale",
        "Fish",
        "Seafood",
        "Garlic",
        "Coconut"
    ],
    "title": "Creamy Wild Salmon With Kale",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-wild-salmon-with-kale"
}
