{
    "directions": [
        "Place the chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 1/4 inch. Whisk together the flour, paprika, cayenne pepper, salt, and black pepper in a shallow bowl. Press each chicken breast into the flour mixture on both sides. Tap off excess flour.",
        "Heat olive oil and 1 tablespoon of butter in a skillet over medium heat until the butter gives off a slightly toasted fragrance, and pan-fry the chicken until browned on both sides, about 3 minutes per side. Set aside. Melt 1 more tablespoon of butter in the skillet, and cook and stir the onion until translucent, about 5 minutes; stir in the shiitake mushrooms, oyster mushrooms, cremini mushrooms, and garlic, and cook until the mushrooms have given off their juice and begun to brown, 10 to 12 minutes.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the fettuccini, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Place the pasta into a serving dish, and toss with 2 tablespoons of butter; season to taste with salt and black pepper, and keep warm.",
        "After the mushroom juices have evaporated, pour Marsala wine into the sauce, and scrape up and dissolve any browned flavor bits in the bottom of the skillet. Turn heat to high, and stir until half the wine evaporates, about 3 minutes; stir in mascarpone, Dijon mustard, and chicken broth; cook, stirring constantly, until the sauce has thickened slightly, another 3 minutes. Reduce heat to medium-low; return cooked chicken breasts to the sauce. Cook until the chicken juices run clear and the sauce has thickened, about 5 minutes. Stir in parsley. Serve with buttered fettuccine."
    ],
    "ingredients": [
        "4 skinless, boneless chicken breast halves",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon paprika",
        "1/4 teaspoon cayenne pepper",
        "salt and freshly ground black pepper (optional)",
        "2 tablespoons olive oil",
        "2 tablespoons butter, divided",
        "1 sweet onion, chopped",
        "1 cup shiitake mushrooms, cut in half",
        "1 cup fresh oyster mushrooms, cut in half",
        "1 cup cremini mushrooms, cut in half",
        "1 (12 ounce) package dry fettuccine pasta",
        "2 tablespoons butter",
        "2 tablespoons minced garlic",
        "3/4 cup Marsala wine",
        "1 (8 ounce) container mascarpone cheese",
        "2 tablespoons Dijon mustard",
        "1 cup chicken broth",
        "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Chicken Marsala Fettuccine",
    "url": "http://allrecipes.com/recipe/217003/creamy-chicken-marsala-fettuccine/"
}
