{
    "directions": [
        "Preheat oven to 350°F. Butter and flour 13x9x2-inch metal cake pan. Sprinkle 1/2 cup almonds and 1/2 cup pecans over bottom of pan. Combine cake mix, 1 1/4 cups water, oil, and eggs in large bowl. Using electric mixer, beat at low speed until mixture is moistened, about 30 seconds. Beat at medium speed 2 minutes. Pour batter into pan.",
        "Melt butter in medium saucepan over medium-low heat. Gradually stir in powdered sugar (mixture will form clumps); stir in cream cheese. Whisk until smooth, about 1 minute. Pour cream cheese mixture in large ribbons atop cake batter in pan. Using knife, swirl mixture into batter (do not overmix).",
        "Bake cake until tester inserted into center (in cake part only) comes out clean, about 50 minutes (bottom of cake will be very moist). Cool cake in pan on rack. Sprinkle remaining 1/2 cup almonds and 1/2 cup pecans over cake.",
        "Mix sugar and cocoa in medium bowl. Bring milk and butter to simmer in heavy medium saucepan. Reduce heat to medium-low; add powdered sugar mixture and whisk until melted. Add chocolate chips and whisk until smooth. Mix in vanilla.",
        "Drizzle warm icing over cake. Let stand until set, about 2 hours. Drizzle caramel topping over. (Can be made 1 day ahead. Cover; store at room temperature.)"
    ],
    "ingredients": [
        "1 cup sliced almonds, lightly toasted",
        "1 cup chopped pecans, lightly toasted",
        "1 18.25-ounce box German chocolate cake mix",
        "1 1/4 cups water",
        "1/3 cup vegetable oil",
        "3 large eggs",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3 1/2 cups powdered sugar",
        "1 8-ounce package cream cheese, cut into pieces, room temperature",
        "1 3/4 cups powdered sugar",
        "2 tablespoons unsweetened cocoa powder",
        "5 tablespoons whole milk",
        "1/4 cup (1/2 stick) unsalted butter",
        "3/4 cup semisweet chocolate chips",
        "1 teaspoon vanilla extract",
        "1/2 cup purchased caramel-flavored topping or dulce de leche topping"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Almond",
        "Pecan",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cream Cheese Turtle Cake",
    "url": "http://www.epicurious.com/recipes/food/views/cream-cheese-turtle-cake-107106"
}
