{
    "directions": [
        "Bring rice and 1 1/2 cup water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is almost tender and the liquid has been absorbed, 15 to 20 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 9x13-inch baking dishes.",
        "Cook beef in a large skillet over medium heat, breaking it up as it cooks, until crumbly and browned, about 10 minutes. Drain excess grease and stir in onion and garlic until thoroughly combined. Stir taco seasoning and 1 cup water into the mixture, bring to a boil, and reduce heat to low; simmer 5 minutes to thicken. Gently stir in rice. Cook, stirring often, until liquid is absorbed. Mix refried beans, cottage cheese, and 1 cup Cheddar cheese into the filling and stir until fully combined.",
        "Spread about 1/2 cup of filling in a line down the center of each tortilla and roll tortillas; place 5 tortillas with seam sides down into bottom of each prepared baking dish.",
        "Mix enchilada sauce with sour cream in a bowl and pour half the sauce down the center of each pan of enchiladas; sprinkle tops with 1 cup Cheddar cheese.",
        "Bake in the preheated oven until the cheese topping is melted and the filling is hot, 20 to 25 minutes."
    ],
    "ingredients": [
        "1 cup white rice",
        "1 1/2 cups water",
        "1 pound ground beef",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 (1.25 ounce) package taco seasoning",
        "1 cup water",
        "1 (16 ounce) can refried beans",
        "1 cup cottage cheese",
        "1 cup shredded Cheddar cheese",
        "10 (8 inch) flour tortillas",
        "1 (7.75 ounce) can red enchilada sauce",
        "1 cup sour cream",
        "1 cup shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Cheddar Beef Enchiladas",
    "url": "http://allrecipes.com/recipe/227993/creamy-cheddar-beef-enchiladas/"
}
