{
    "directions": [
        "Cook bacon and chicken: Cook bacon in a large heavy skillet (preferably cast-iron) over moderate heat, stirring, until crisp. Transfer bacon with a slotted spoon to paper towels, then pour off all but about 1 1/2 tablespoons fat from skillet.",
        "Pat chicken dry and season with salt and pepper. Add to skillet with bacon fat and cook over moderately high heat, turning several times, until nicely crusted and just cooked through, 8 to 10 minutes. Transfer to a plate and cool. Tear chicken into bite-size pieces.",
        "Prepare corn and sauce while chicken is cooking: Gently simmer corn and milk in a heavy saucepan until corn is crisp-tender, about 5 minutes. Pour through a sieve into a bowl and reserve corn and milk separately.",
        "Melt butter in same saucepan over moderately low heat. Add flour and cook roux, stirring, 3 minutes. Gradually whisk in cream, then reserved warm milk, pepper, and salt. Bring to a boil, whisking, then simmer, whisking, 3 minutes. Stir in tomatoes, chicken, and corn. Keep warm, covered, over very low heat.",
        "Make polenta: Bring water with salt to a boil. Gradually whisk in polenta and cook over moderately high heat, whisking, 5 minutes. Stir in cheeses.",
        "Divide polenta among 6 shallow bowls. Stir basil into chicken mixture and spoon over polenta. Sprinkle with bacon."
    ],
    "ingredients": [
        "6 bacon slices, cut into 1/2-inch pieces",
        "1 lb skinless boneless chicken breast halves",
        "2 cups fresh corn",
        "1 cup milk",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 1/4 cups heavy cream",
        "1/2 teaspoon black pepper",
        "1 teaspoon kosher salt",
        "3 large plum tomatoes, seeded and finely diced",
        "6 cups water",
        "2 1/2 teaspoons kosher salt",
        "1 1/2 cups instant polenta",
        "1/2 lb Fontina cheese (preferably Italian), diced",
        "1/2 cup finely grated parmesan",
        "1/4 cup chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Chicken",
        "Poultry",
        "Tomato",
        "Quick & Easy",
        "Bacon",
        "Cornmeal",
        "Corn",
        "Winter",
        "Gourmet"
    ],
    "title": "Creamed Chicken with Corn and Bacon Over Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-chicken-with-corn-and-bacon-over-polenta-5917"
}
