{
    "directions": [
        "Melt butter over medium heat in Dutch oven. Add onion; cook and stir 3 to 4 minutes or until onion is translucent. Add potatoes, 5 1/2 cups water, 1 1/2 tablespoons Diamond Crystal(R) Kosher Salt, bay leaves and thyme. Bring to a boil; reduce heat and simmer 5 to 10 minutes or until potatoes are very tender.",
        "Cook bacon in large skillet over medium heat until browned and crisp. Remove bacon from skillet with slotted spoon; drain on paper towels. Pour off bacon drippings, reserving 2 tablespoons for kale.",
        "Heat reserved 2 tablespoons bacon drippings over medium heat. Add kale; cook and stir for 1 minute. Slowly add 1/2 cup water; cook and stir until liquid evaporates. Stir in 1/4 teaspoon Diamond Crystal(R) Kosher Salt and 1/4 teaspoon pepper. Remove from heat.",
        "Remove and discard bay leaves and thyme from soup. With slotted spoon, remove potatoes and onion to blender or food processor. Carefully process (in batches) until chopped, adding hot liquid as needed until smooth. Return pureed mixture to remaining hot liquid in Dutch oven. Over medium heat, blend in cream and remaining 1/4 teaspoon pepper. Heat thoroughly. Add additional salt and pepper to taste.",
        "Spoon kale around side of shallow serving dishes. Spoon soup into bowls; sprinkle with bacon.",
        "Garnish with diced apples tossed with lemon juice, if desired."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 medium yellow onion, diced",
        "1 1/2 pounds russet potatoes, peeled and diced",
        "6 cups water, divided",
        "1 1/2 tablespoons Diamond Crystal® Kosher Salt",
        "2 bay leaves",
        "2 large sprigs fresh thyme",
        "8 slices bacon, diced",
        "1 bunch kale, large stems discarded, leaves thinly sliced",
        "1/4 teaspoon Diamond Crystal® Kosher Salt",
        "1/2 teaspoon coarsely ground pepper, divided",
        "1 cup whipping cream",
        "1 red apple (Braeburn, Gala, Fuji), cored, diced, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy and Crunchy Potato Soup",
    "url": "http://allrecipes.com/recipe/239037/creamy-and-crunchy-potato-soup/"
}
