{
    "directions": [
        "1. Preheat the oven to 350°F. Butter a 10-inch square baking dish.",
        "2. Bring a large pot of salted water to a boil. Add the kale and cook until tender, about 5 minutes. Drain in a colander, rinse with cold water, and drain well again. Place the kale in clean kitchen towels or paper towels and squeeze out the excess liquid. Put the kale in a large bowl.",
        "3. Pour the milk into a medium saucepan and bring to a simmer over low heat.",
        "4. Melt the butter in a medium saucepan over medium-high heat. Add the onion and cook until soft, about 4 minutes. Add the garlic and cook for 30 seconds. Whisk in the flour and cook until smooth and light blonde in color, about 1 minute. Slowly whisk in the warm milk, raise the heat to high, and cook, whisking constantly, until thickened and the flour taste has cooked out, about 5 minutes. If the mixture becomes too thick, add a little more milk.",
        "5. Strain the sauce over the kale. Add the nutmeg, season with salt and pepper, and mix gently to combine. Scrape the mixture into the baking dish and bake in the oven until light golden brown on top and just warmed through, about 15 minutes.",
        "6. Remove from the oven and top with the crispy shallots . Let rest for 10 minutes before serving."
    ],
    "ingredients": [
        "3 pounds kale, stems and ribs removed, coarsely chopped",
        "3 1/2 cups whole milk, or more if needed",
        "3 tablespoons unsalted butter, plus more for the baking dish",
        "1 medium Spanish onion, finely diced",
        "3 cloves garlic, finely chopped",
        "3 tablespoons all-purpose flour",
        "1/8 teaspoon freshly grated nutmeg",
        "Kosher salt and freshly ground black pepper",
        "Crispy Shallots"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Side",
        "Thanksgiving",
        "Kale",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Shallot",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Creamed Kale with Crispy Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-kale-with-crispy-shallots-367471"
}
