{
    "directions": [
        "Preheat oven to 350°F. Stir sugar and 1/2 cup water in heavy medium saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep amber, occasionally brushing down sides of pan with wet pastry brush and swirling pan. Immediately pour caramel into 9x5x3-inch glass baking dish, tilting and rotating dish to coat bottom and 2 inches up sides with caramel. Cool.",
        "Using electric mixer, beat cream cheese in large bowl until smooth. Gradually beat in sweetened condensed milk, then eggs and yolk. Add evaporated milk, vanilla, salt, and remaining 1/2 cup water; beat to blend. Pour custard into caramel-lined dish. Place dish in 13x9x2-inch metal baking pan. Add enough hot water to pan to come 1 1/2 inches up sides of dish. Bake until knife inserted into center of flan comes out clean, about 1 hour. Remove flan from water bath. Refrigerate uncovered until cool, then cover and refrigerate overnight.",
        "Run small sharp knife around flan to loosen. Firmly hold dish and platter together and invert, shaking gently to unmold flan onto platter. Scrape caramel syrup from dish over flan. Slice flan and serve."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1 cup water, divided",
        "1 8-ounce package cream cheese, room temperature",
        "1 14-ounce can sweetened condensed milk",
        "5 large eggs",
        "1 large egg yolk",
        "1 cup canned evaporated milk",
        "1 teaspoon vanilla extract",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Cheese",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Cream Cheese",
        "Vanilla",
        "Shower",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cream Cheese Flan",
    "url": "http://www.epicurious.com/recipes/food/views/cream-cheese-flan-234359"
}
