{
    "directions": [
        "Position racks in top and bottom thirds of oven and preheat to 500°F. Stack 7 pastry sheets on each of 2 large baking sheets. Bake until top pastry sheets are dry and crisp but not brown, about 45 seconds. Working quickly, transfer top pastry sheets to another large baking sheet and cool (pastry may break). Repeat baking and removing top sheets from each stack every 45 seconds. Reduce oven temperature to 350°F.",
        "Arrange half of phyllo in bottom of 13 x 9 x 2-inch glass baking dish, breaking phyllo to fit into dish as necessary. Reserve 2 tablespoons almonds and 2 tablespoons raisins. Sprinkle remaining almonds and raisins over pastry. Cover with remaining pastry, breaking into pieces and pressing to fit into dish. Combine milk, sugar and butter in heavy medium saucepan. Stir over medium heat until sugar dissolves and butter melts. Remove pan from heat. Mix in cream and orange flower water. Pour milk mixture over phyllo (phyllo will shrink as it absorbs milk mixture). Sprinkle with cinnamon, then pistachios and reserved almonds and raisins.",
        "Bake until pudding puffs and center is set, about 45 minutes or less Serve hot."
    ],
    "ingredients": [
        "14 sheets fresh phyllo pastry or frozen, thawed (about 1/2 pound)",
        "1/2 cup whole blanched almonds (about 3 ounces)",
        "1/2 cup raisins",
        "3 cups milk (do not use low-fat or nonfat)",
        "1 cup sugar",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 cup whipping cream",
        "2 teaspoons orange flower water",
        "1/2 teaspoon ground cinnamon",
        "1/2 cup coarsely chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Raisin",
        "Almond",
        "Pistachio",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamy Phyllo, Raisin and Nut Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-phyllo-raisin-and-nut-pudding-392"
}
