{
    "directions": [
        "Fill a large pot with lightly-salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the bow tie pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has nearly cooked through, but is still firm to the bite, about 10 minutes. Drain well, and rinse with cold water in a colander set in the sink. While the pasta is boiling, cook the prosciutto in a small skillet over medium heat until crisp. Drain on a paper towel-lined plate, and set aside.",
        "Make the dressing by whisking together the mayonnaise, sour cream, milk, garlic, lemon zest and juice, lemon pepper, paprika, and red pepper flakes; season to taste with salt and pepper. Place the drained pasta into a large mixing bowl and pour 3/4 of the dressing overtop; reserve the remaining dressing. Add the peas, cranberries, grapes, green onion, water chestnuts, and Parmesan cheese; stir until the salad is evenly coated with the dressing. Cover and refrigerate at least an hour, or until ready to serve.",
        "Toss the salad with the remaining dressing, oregano, and thyme to serve."
    ],
    "ingredients": [
        "1 1/2 pounds farfalle (bow tie) pasta",
        "1/2 cup prosciutto, diced",
        "1/2 cup mayonnaise",
        "1/2 cup sour cream",
        "1/3 cup 2% low-fat milk",
        "2 cloves garlic, minced, or more to taste",
        "1 lemon, zested and juiced",
        "1 pinch lemon pepper",
        "1 pinch paprika",
        "1 pinch red pepper flakes, or to taste",
        "salt and ground black pepper to taste",
        "2 (6 ounce) packages frozen peas, thawed",
        "3/4 cup dried cranberries",
        "3/4 cup seedless grapes, halved",
        "1/2 cup green onions, chopped",
        "1 (5 ounce) can water chestnuts, drained and diced",
        "1/2 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh oregano",
        "1 1/2 teaspoons chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Bow Tie Pasta Salad with Prosciutto, Peas, Grapes, and Dried Cranberries",
    "url": "http://allrecipes.com/recipe/173888/creamy-bow-tie-pasta-salad-with-prosc/"
}
