{
    "directions": [
        "Bring milk, cloves, and bay leaf to a boil in a small saucepan; reduce heat to low and simmer for 15 minutes to let flavors meld. Strain into a medium bowl; discard solids. Cover milk and keep warm.",
        "Meanwhile, place onions in a large skillet (at least 12\"). Add water to half-cover the onions (about 1 cup). Add 1 tablespoon butter, 1 teaspoon salt, and sugar. Cook over medium-high heat, stirring occasionally, until liquid has evaporated and onions are golden brown, about 12 minutes. Gently transfer onions to a large plate.",
        "Melt remaining 2 tablespoons butter in same skillet over medium heat; add flour and whisk to combine. Cook, stirring occasionally and scraping up browned bits from bottom of pan, for 1 minute. Whisk in reserved milk, adding 1/4-cupful at a time. Cook, stirring constantly, until thickened and bubbly. Stir in remaining 1/2 teaspoon salt, pepper, and nutmeg. Add peas and onions; stir until heated through. Gently fold in crème fraîche."
    ],
    "ingredients": [
        "2 cups whole milk",
        "3 whole cloves",
        "1 bay leaf",
        "1 pound pearl onions (about 2 cups), peeled, trimmed, or 1 pound frozen pearl onions, thawed",
        "3 tablespoons unsalted butter, divided",
        "1 1/2 teaspoons kosher salt, divided",
        "1 teaspoon sugar",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "2 1-pound bags frozen peas, thawed",
        "1/4 cup crème fraîche, whole-milk, Greek yogurt, or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Onion",
        "Vegetable",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Legume",
        "Pea",
        "Fall",
        "Low Cholesterol",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamed Peas and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-peas-and-onions-51123040"
}
