{
    "directions": [
        "Combine porcini mushrooms and 3 cups hot water in medium bowl. Let stand until porcini mushrooms soften, about 15 minutes.",
        "Using slotted spoon, transfer porcini mushrooms to heavy large saucepan. Add porcini soaking liquid to saucepan, leaving any sediment behind in bowl. Add vegetable stock and chestnuts to same saucepan. Bring to boil. Reduce heat, cover and simmer 20 minutes to blend flavors. Working in batches, puree soup in blender until smooth. Return soup to saucepan. Add cream and 1 tablespoon Sherry. Bring soup to simmer. Season soup to taste with salt and pepper. (Can be prepared 1 day ahead. Cool slightly. Refrigerate. Rewarm over medium heat before continuing.)",
        "Melt butter in large nonstick skillet over medium heat. Add shallots, carrot and rutabaga; sauté until tender and beginning to brown, about 15 minutes. Remove from heat. Stir in 1 tablespoon Sherry. Season with salt and pepper.",
        "Ladle soup into bowls. Top with vegetables and serve.",
        "*Porcini mushrooms are available at Italian markets, specialty foods stores and many supermarkets nationwide."
    ],
    "ingredients": [
        "1/3 cup dried porcini mushrooms (about 1/2 ounce)*",
        "3 cups hot water",
        "2 cups vegetable stock or canned vegetable broth",
        "2 1/4 cups peeled roasted chestnuts (about 1 1/4 pounds) or jarred chestnuts (about 12 ounces), coarsely chopped",
        "1/2 cup whipping cream",
        "2 tablespoons dry Sherry",
        "2 tablespoons (1/4 stick) butter",
        "2 large shallots, finely chopped",
        "1 medium carrot, finely chopped",
        "1 small rutabaga, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mushroom",
        "Vegetable",
        "Sauté",
        "Root Vegetable",
        "Winter",
        "Chestnut"
    ],
    "title": "Creamy Chestnut-Mushroom Soup with Sauteed Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-chestnut-mushroom-soup-with-sauteed-root-vegetables-102638"
}
