{
    "directions": [
        "Heat oil in a large saucepan over medium-low. Add onions, celery, and garlic and cook, stirring often and adding a splash or so of water if the bottom of pan gets too brown, until golden brown, 30–40 minutes. Season with salt and pepper. Add cashews, sugar, red pepper flakes, and 3 cups water and bring mixture to a simmer. Cook until vegetables are very soft and losing their structure, 10–15 minutes.",
        "Blend one-third of sugar snap peas with one-third of vegetable mixture in a blender, adding some cooking liquid from vegetable mixture as needed to thin, until very smooth, about 2 minutes. Press purée through a fine-mesh sieve into a medium saucepan; discard solids. Working in 2 batches, repeat with remaining peas and vegetable mixture, adding water as needed if you run out of cooking liquid. If soup is still very thick, thin with water until you get a velvety, pourable consistency. (You should have about 7 cups soup.)",
        "Stir vinegar into soup; season with more salt and pepper and warm over medium-low until heated through.",
        "Serve soup topped with scallions and potato chips.",
        "Soup can be made 2 days ahead. Let cool; cover and chill. Reheat over medium-low, thinning with water as needed until pourable."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 large onions, finely chopped",
        "2 celery stalks, chopped",
        "4 garlic cloves, thinly sliced",
        "Kosher salt, freshly ground pepper",
        "2 cups raw cashews",
        "2 tablespoons raw or light brown sugar",
        "1 teaspoon crushed red pepper flakes",
        "2 pounds frozen sugar snap or green peas, thawed",
        "1 tablespoon malt vinegar",
        "Thinly sliced scallions and crushed potato chips (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Summer",
        "Pea",
        "Sugar Snap Pea",
        "Cashew",
        "Nut",
        "Vegan",
        "Vegetarian",
        "Lunch",
        "Appetizer",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cream of Cashew Pea Soup",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-cashew-pea-soup"
}
