{
    "directions": [
        "Cook pears, 2 tablespoons white sugar, lemon juice, 1/4 teaspoon coarse salt, and vanilla extract in a saucepan over medium heat until pears are soft, 6 to 7 minutes. Remove from heat; cool pear mixture for 5 minutes. Transfer to a blender. Puree pear mixture and strain through a fine mesh strainer into a bowl.",
        "Whisk egg yolks and 1 cup white sugar in a bowl. Heat 2 1/2 cups cream and milk in a large saucepan over medium-low heat just until bubbles appear at the edge; do not boil. Remove cream and milk from heat and whisk egg yolk mixture into cream and milk by small amounts until all egg yolk mixture is incorporated. Return to medium heat, whisking constantly, until custard is thickened, about 8 minutes. Remove from heat and chill in refrigerator for 10 minutes. Stir strained pear mixture into custard. Transfer to a bowl, cover, and chill in refrigerator overnight.",
        "Combine corn syrup, brown sugar, unsalted butter, and 1/8 teaspoon sea salt in a heavy saucepan. Place over medium-low heat and stir until smooth; bring to a low boil. Stirring constantly, cook caramel until thickened and light golden brown, about 3 minutes; remove from heat, and let caramel cool for 5 minutes. Whisk 1/2 cup plus 2 tablespoons cream into caramel. Transfer caramel to a bowl, cover, and chill overnight.",
        "Pour custard into an ice cream maker and freeze according to manufacturer's instructions. When ice cream is softly frozen, lightly mix about 1 cup caramel into ice cream to make caramel swirls. Transfer ice cream to a bowl, cover, and freeze overnight."
    ],
    "ingredients": [
        "6 pears - peeled, cored, and chopped",
        "2 tablespoons white sugar",
        "1 teaspoon lemon juice",
        "1/4 teaspoon coarse salt",
        "1 tablespoon vanilla extract",
        "6 egg yolks",
        "1 cup white sugar",
        "2 1/2 cups heavy whipping cream",
        "1 1/2 cups whole milk",
        "1 cup light corn syrup",
        "1 cup brown sugar",
        "1/4 cup unsalted butter",
        "1/8 teaspoon sea salt, or to taste",
        "1/2 cup heavy whipping cream",
        "2 tablespoons heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Caramel-Pear Ice Cream",
    "url": "http://allrecipes.com/recipe/232423/creamy-caramel-pear-ice-cream/"
}
