{
    "directions": [
        "Whisk together 1/4 cup Italian salad dressing, Greek seasoning, and garlic in a glass or ceramic bowl. Add chicken; turn to coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 15 minutes or up to overnight.",
        "Bring a large pot of lightly salted water to a boil. Add fiddleheads, and cook until bright green, about 2 minutes. Drain in a colander and immediately immerse in ice water for several minutes until cold to stop the cooking process. Drain well and set aside.",
        "Heat vegetable oil in a skillet over medium-high heat. Remove the chicken from the marinade, discard the unused marinade, and fry chicken, turning occasionally, until golden brown on the outside and no longer pink at the center, about 15 minutes. Remove chicken from the pan, place into a serving dish, and keep warm.",
        "Stir fiddleheads into the same skillet with remaining 1/4 cup Italian salad dressing, white wine, and brown sugar. Cook and stir until fiddleheads are tender, about 7 minutes.",
        "Whisk flour and water together in a small bowl, and stir flour mixture into fiddleheads. Bring sauce to a simmer, and continue cooking until sauce thickens, about 5 minutes. Season with salt and pepper. Pour fiddleheads and sauce over chicken breasts and serve immediately."
    ],
    "ingredients": [
        "1/2 cup Italian salad dressing, divided",
        "1 teaspoon Greek seasoning",
        "3 cloves garlic, crushed",
        "4 skinless, boneless chicken breast halves",
        "2 cups fiddlehead ferns, ends trimmed",
        "1 teaspoon vegetable oil",
        "1/3 cup white wine",
        "1/4 cup brown sugar",
        "3 tablespoons all-purpose flour",
        "1 cup cold water",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Chicken and Fiddleheads",
    "url": "http://allrecipes.com/recipe/233402/creamy-chicken-and-fiddleheads/"
}
