{
    "directions": [
        "Heat oil in heavy medium saucepan over medium heat. Add parsnips and sauté until beginning to soften but not brown, about 5 minutes. Add 2 cups vegetable stock and bring to boil over medium-high heat. Reduce heat to medium; boil gently, uncovered, until parsnips are tender and stock is reduced by about half, about 35 minutes.",
        "Transfer parsnip and stock mixture to blender and puree until smooth, scraping down sides occasionally and adding more vegetable stock by tablespoonfuls if puree is very thick. Transfer to bowl. Season puree to taste with salt and pepper. do ahead Can be made 2 hours ahead. Let stand at room temperature.",
        "Bring medium saucepan of salted water to boil. Add cubed carrots, parsnips, and turnips; simmer just until tender, about 5 minutes. Drain. Transfer vegetables to bowl of ice water and let stand 10 minutes. Drain well. DO AHEAD: Vegetables can be made 2 hours ahead. Let stand at room temperature.",
        "Combine 2 1/2 cups water, rice, and 3/4 teaspoon coarse salt in medium saucepan; bring to boil. Reduce heat to low, cover, and cook until rice is tender and liquid is absorbed, about 15 minutes. Remove from heat. DO AHEAD: Can be made 2 hours ahead. Let stand uncovered at room temperature.",
        "Combine cooked rice and 1 3/4 cups vegetable stock in heavy large saucepan. Bring to simmer. Add parsnip puree and stir until heated through and well blended. Stir in blanched vegetables and cook 2 minutes longer. Season rice to taste with salt and pepper. Divide among plates and serve."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "8 ounces parsnips, peeled, cut into 1/2-inch cubes",
        "2 cups (or more) vegetable stock or vegetable broth",
        "1 cup 1/4-inch cubes peeled carrots",
        "1 cup 1/4-inch cubes peeled parsnips",
        "1 cup 1/4-inch cubes peeled turnips",
        "2 1/2 cups water",
        "1 1/4 cups basmati rice",
        "3/4 teaspoon coarse kosher salt",
        "1 1/4 cups vegetable stock or vegetable broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Root Vegetable",
        "Parsnip",
        "Winter",
        "Healthy",
        "Low Cholesterol",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Creamy Rice with Parsnip Purée and Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-rice-with-parsnip-puree-and-root-vegetables-241352"
}
