{
    "directions": [
        "Heat 1/4 inch oil in a 10-inch heavy skillet over moderate heat until hot but not smoking, then cook bread, stirring frequently, until deep golden, about 1 minute. Transfer with a slotted spoon to paper towels to drain.",
        "Tie thyme, parsley, chives, and bay leaves together with kitchen string to make a bouquet garni. Bring lentils, chestnuts, water, bouquet garni, and 1 1/2 teaspoons salt to a boil in a 3-quart heavy saucepan. Simmer, partially covered, until lentils are tender, 20 to 25 minutes. Discard bouquet garni and reserve 2 cups cooking liquid. Purée remaining soup in 2 or 3 batches in a blender (use caution when blending hot liquids), then pour through a large sieve into a large bowl, discarding solids. Whisk in enough of reserved cooking liquid to reach a thin, creamy consistency, then season with salt and pepper. (Soup will continue to thicken as it stands; keep reserved cooking liquid on hand to thin as needed.)",
        "Preheat oven to 325°F.",
        "Purée foie gras, whole eggs, yolks, and remaining teaspoon salt in a food processor until very smooth. With motor running, add 1 cup cream in a stream and blend until just combined (do not overprocess, or cream will curdle).",
        "Put soup plates on 2 large baking sheets, then divide custard among them. Bake in upper and lower thirds of oven until just set, 15 to 20 minutes (some custards will cook quicker than others; check each one). Cool to warm.",
        "Reheat soup, stirring occasionally, until very hot. Beat remaining ‚ cup cream until it just holds stiff peaks, then vigorously whisk whipped cream into soup. Pour soup over custards and sprinkle with croutons and almonds."
    ],
    "ingredients": [
        "1 to 1 1/2 cups vegetable oil",
        "4 very thin slices firm white sandwich bread, cut in 1/4-inch dice",
        "4 fresh thyme sprigs",
        "4 fresh parsley sprigs",
        "4 fresh chives",
        "2 bay leaves (not California)",
        "1 cup dried lentilles de Puy (French green lentils; 7 ounces)",
        "1/2 pound vacuum-packed chestnuts (1 1/2 cups)",
        "10 cups cold water",
        "2 1/2 teaspoons kosher salt",
        "100 gm cooked pure-goose foie gras medallions (3 1/2 ounces)",
        "2 whole large eggs",
        "2 large egg yolks",
        "1 1/2 cups heavy cream",
        "1/3 cup sliced almonds, toasted",
        "Special equipment: 6 (1 1/2-cup) ovenproof soup plates and kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Nut",
        "Poultry",
        "Bake",
        "Almond",
        "Lentil",
        "Winter",
        "Chestnut",
        "Simmer",
        "Gourmet"
    ],
    "title": "Cream of Lentil and Chestnut Soup with Foie Gras Custard",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-lentil-and-chestnut-soup-with-foie-gras-custard-104751"
}
