{
    "directions": [
        "1. Cut off the broccoli florets and use only these for the soup. Wash and drain them. To make a vivid green soup, cook the florets, uncovered, in a large amount of boiling salted water for 5 minutes, until very well cooked. Drain, refresh in cold water so that they keep their color, and drain thoroughly.",
        "2. Cut off and discard the earthy ends of the mushroom stalks. If you are using cèpes, simply wipe the caps with a cloth; wash all the other mushrooms briefly under running water.",
        "3. Cut large mushrooms into approximately 1/8-inch slices, medium-sized mushrooms into quarters, and leave small ones whole. Place in an airtight container and keep cool.",
        "4. Bring the chicken stock to a boil, pour it over the broccoli, and purée in a blender or a food processor. Pour the purée into a saucepan, add the cream, and season with salt and pepper. Strain the cream of broccoli through a fine sieve, and return it to the saucepan.",
        "5. Peel the shallot and chop it very finely. Place in an airtight container and keep cool.",
        "1. Reheat the soup.",
        "2. Heat a nonstick skillet until very hot, add the mushrooms, season with salt, and stir with a wooden spoon until the mushrooms have released all their moisture. When it has almost completely evaporated, stir in the butter and shallot. Cook for 2 minutes, stirring continuously, then scoop the mushrooms onto paper towels to drain.",
        "Pour the soup into warmed individual tureens or soup plates and pile a mound of hot mushrooms into the center."
    ],
    "ingredients": [
        "2 1/2 pounds broccoli",
        "10 ounces wild mushrooms (cèpes, chanterelles, mousserons, etc; one single variety or a mixture)",
        "3 cups chicken stock",
        "5/8 cup whipping cream",
        "Salt and freshly ground pepper",
        "1 shallot",
        "1 1/2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Chicken",
        "Mushroom",
        "Broccoli",
        "Fall"
    ],
    "title": "Cream of Broccoli Soup with Wild Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/cream-of-broccoli-soup-with-wild-mushrooms-107181"
}
