{
    "directions": [
        "Season pork chunks generously with salt and pepper. Toss to distribute seasonings evenly.",
        "Heat vegetable oil in pot over high heat. Brown pork in batches so meat isn't crowded, about 7 minutes total time per batch. Transfer pork to a plate. Cook onions in same pot; cook and stir until they start to turn translucent and edges get brown, 3 or 4 minutes. Add garlic; cook 1 minute. Stir in apple cider and apple cider vinegar.",
        "Raise heat to high. Stir in mustard and horseradish. Transfer browned pork pieces back to pot, along with accumulated juices. Pour in cream and chicken broth to cover. Add sage, thyme, rosemary, and bay leaf. Season with a pinch of salt. Bring to a simmer; reduce heat, cover, and simmer on low for 30 minutes. Add celery, carrots, black pepper and cayenne.",
        "Simmer uncovered on low until meat is tender, about 1 hour. Add green peas. Simmer another 10 minutes. Optional: for a thicker sauce, raise heat and simmer until sauce is reduced, 5 to 8 minutes.",
        "Garnish individual servings with apple strips and chopped fresh chives."
    ],
    "ingredients": [
        "2 1/2 pounds pork shoulder, cut into 2-inch chunks",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons vegetable oil",
        "1 large yellow onion, chopped",
        "3 cloves minced garlic",
        "2 tablespoons apple cider vinegar",
        "1/2 cup apple cider or apple juice",
        "2 tablespoons Dijon mustard",
        "1 tablespoon prepared horseradish",
        "1 1/4 cups heavy cream",
        "1/4 cup chicken broth or more as needed",
        "1 stalk celery, sliced",
        "1 cup sliced carrots",
        "4 sage leaves",
        "2 sprigs thyme",
        "2 small sprigs fresh rosemary",
        "1 dried bay leaf",
        "1 pinch cayenne pepper",
        "1/2 cup green peas, fresh or frozen",
        "1/4 cup matchstick-cut apple strips",
        "1 tablespoon chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Pork Stew",
    "url": "http://allrecipes.com/recipe/245361/creamy-pork-stew/"
}
