{
    "directions": [
        "Preheat the oven to 350°F. In a small bowl toss the bread cubes with the butter and salt to taste, spread them on a baking sheet, and bake them in the middle of the oven for 8 to 10 minutes, or until they are golden.",
        "In a kettle cook the spinach in the water clinging to the leaves, covered, over moderate heat, stirring once or twice, for 5 to 6 minutes, or until it is wilted, refresh it under cold water, and drain it well in a colander. Squeeze out the excess water by handfuls and in a food processor purée the spinach.",
        "In a heavy saucepan cook the shallot in the butter over moderately low heat, stirring, until it is softened, add the flour, and cook the roux, stirring, for 3 minutes. Add the milk, whisking, bring the mixture to a boil, whisking, and simmer it, whisking, for 3 minutes. Add the spinach purée, the sour cream, the nutmeg, the lemon juice, and salt and pepper to taste and heat the creamed spinach over moderately low heat, stirring, until it is heated through. Serve the creamed spinach topped with croutons."
    ],
    "ingredients": [
        "2 slices of homemade-type white bread, cut into 1/4-inch cubes",
        "1 1/2 tablespoons unsalted butter, melted",
        "2 pounds spinach (about 3 bunches), coarse stems discarded and the leaves washed well and drained",
        "1/4 cup minced shallot or onion",
        "1 1/2 tablespoons unsalted butter",
        "1 1/2 tablespoons all-purpose flour",
        "1 cup milk",
        "3 tablespoons sour cream",
        "1/2 teaspoon freshly grated nutmeg",
        "1 to 2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Side",
        "Bake",
        "Vegetarian",
        "Spinach",
        "Spring",
        "Sour Cream",
        "Simmer",
        "Boil",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Creamed Spinach with Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/creamed-spinach-with-croutons-11879"
}
