{
    "directions": [
        "Heat oil over medium-high heat in a large, deep saute pan until shimmering.",
        "Add parsnips, then onion; saute, stirring very little at first, then more frequently, until vegetables start to turn golden brown, 7 to 8 minutes.",
        "Reduce heat to low and add butter, sugar and garlic; continue cooking until all vegetables are a rich spotty caramel color, about 10 minutes longer.",
        "Add ginger, cardamom, allspice and cayenne pepper; continue to saute until fragrant, 30 seconds to 1 minute longer.",
        "Add broth; bring to a simmer over medium-high heat. Reduce heat to low and simmer, partially covered, until parsnips are tender, about 10 minutes.",
        "Using an immersion blender or traditional blender, puree until very smooth, 30 seconds to 1 minute. (If using a traditional blender, vent it either by removing the lid's pop-out center or by lifting one edge of the lid. Drape the blender canister with a kitchen towel. To 'clean' the canister, pour in a little half-and-half, blend briefly, then add to the soup.)",
        "Return to pan (or a soup pot); add enough half-and-half so the mixture is souplike, yet thick enough to float garnish. Taste, and add salt and pepper if needed. Heat through, ladle into bowls, garnish and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 1/2 pounds peeled parsnips , cut into 1-inch chunks",
        "1 large onion, cut into large dice",
        "1 tablespoon butter",
        "1 pinch sugar",
        "3 large garlic cloves, thickly sliced",
        "1 teaspoon ground ginger",
        "1/4 teaspoon cardamom",
        "1/4 teaspoon allspice",
        "1/8 teaspoon cayenne pepper",
        "3 cups chicken broth, homemade or from a carton or can",
        "1 1/2 cups half-and-half (or whole milk)",
        "Salt and freshly ground pepper, to taste",
        "Garnish: sauteed hazelnuts and dried cranberries*"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Parsnip With Ginger Soup",
    "url": "http://allrecipes.com/recipe/77939/creamy-parsnip-with-ginger-soup/"
}
