{
    "directions": [
        "Preheat the oven to 450°F.",
        "Line one baking sheet with a Silpat and a second one with parchment paper (or line both sheets with parchment if you don't have a Silpat). Set up a heavy-duty mixer with the paddle attachment.",
        "Combine the water, butter, sugar, and salt in a medium saucepan and bring to a simmer over medium-high heat. Reduce the heat to medium, add the flour all at once, and stir rapidly with a stiff heatproof or wooden spoon until the dough pulls away from the sides of the pan and the bottom of the pan is clean, with no dough sticking to it. The dough should be glossy and smooth but still damp.",
        "Enough moisture must evaporate from the dough to allow it to absorb more fat when the eggs are added. Continue to stir for about 5 minutes, adjusting the heat as necessary to prevent the dough from coloring. A thin coating will form on the bottom and sides of the pan. When enough moisture has evaporated, steam will rise from the dough and there will be the nutty aroma of cooked flour.",
        "Immediately transfer the dough to the mixer bowl and mix for a few seconds to release some of the heat from the dough. With the mixer on medium speed, add 4 eggs, one at a time, beating until each egg is completely incorporated before adding the next one; scrape down the sides of the bowl as necessary. Turn off the machine. Lift some of the dough on a rubber spatula, then turn the spatula to let it run off: It should fall off the spatula very slowly; if it doesn't move at all or is very dry and falls off in one clump, beat in the additional egg.",
        "Place the dough in a pastry bag fitted with a 1/2-inch plain tip. Pipe 15 disks (this will give you 3 extras for testing) about 1 1/2 inches across and just under 1/2 inch thick on the Silpat-lined baking sheet, leaving about 1 1/2 inches between them, as they will expand when baked. Pipe the remainder on the other sheet. (You will have about 4 dozen in all.) Bake the 15 puffs for the recipe and freeze the ones on the second baking sheet until firm, then transfer to a freezer container and freeze for another time.",
        "Bake the puffs for 10 minutes, turn the sheet around, turn the oven down to 350°F, and bake 15 minutes more. Remove one puff and break it open: It should be hollow inside and not gooey or eggy; if it is still moist, return it to the oven and check in 5 minutes. Cool the puffs completely on the baking sheet. Store in an airtight container until serving time.",
        "Preheat the oven to 300°F.",
        "Warm the chocolate sauce in a double boiler or a microwave. Warm the profiteroles on a baking sheet in the oven.",
        "Split each profiterole in half and arrange 3 on each plate. Place a small scoop of ice cream in the bottom half of each profiterole and top with the lid. Spoon the sauce over."
    ],
    "ingredients": [
        "1 cup water",
        "5 1/3 tablespoons (about 3 ounces) unsalted butter",
        "1 tablespoon plus 1 teaspoon sugar",
        "1/8 teaspoon kosher salt",
        "1 cup all-purpose flour",
        "4 to 5 large eggs",
        "1 1/2 cups Chocolate Sauce",
        "1 1/2 cups Vanilla Ice Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cream Puffs with Vanilla Ice Cream and Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/cream-puffs-with-vanilla-ice-cream-and-chocolate-sauce-231345"
}
