{
    "directions": [
        "Bring a large pot of water to a boil, and immerse the zucchini in the boiling water. Set heat to medium, and cook the zucchini until they feel slightly soft when pressed with a wooden spoon, about 20 minutes. Drain the zucchini, and set aside to cool.",
        "Heat the vegetable oil in a skillet over medium heat, and cook and stir the onion and garlic until the onion is translucent, about 5 minutes. Stir in the ground beef, and cook and stir the meat, breaking it up as it cooks, until the beef is no longer pink, about 8 minutes. Stir in the paprika, and set the beef mixture aside.",
        "Cut the zucchinis in half lengthwise, and scoop out the flesh with a spoon, leaving a 1/2-inch thick shell. Chop the scooped-out zucchini flesh, and mix into the ground beef mixture.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "In a saucepan over low heat, melt the butter and whisk in the flour until smooth. Pour in the milk, a little at a time, and bring the mixture to a simmer, whisking constantly. Whisk in white pepper, nutmeg, and salt, and stir in half the Parmesan cheese to create a smooth sauce. Mix the white sauce thoroughly with the ground beef mixture. Place the zucchini halves into a baking dish. Fill the zucchini shells with the creamy beef mixture, and sprinkle each with about 1 1/2 tablespoons of the remaining Parmesan cheese.",
        "Bake in the preheated oven until the Parmesan cheese topping begins to turn golden brown, about 15 minutes."
    ],
    "ingredients": [
        "2 large thick zucchinis, ends trimmed",
        "1 teaspoon vegetable oil",
        "1/2 onion, chopped",
        "3 cloves garlic, minced",
        "3/4 pound ground beef",
        "1/2 teaspoon ground paprika",
        "2 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "3/4 cup milk",
        "1/4 teaspoon white pepper",
        "1/4 teaspoon ground nutmeg, or to taste",
        "salt to taste",
        "3/4 cup grated Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creamy Meat-Stuffed Zucchini",
    "url": "http://allrecipes.com/recipe/215681/creamy-meat-stuffed-zucchini/"
}
