{
    "directions": [
        "Preheat the oven to 350ºF.",
        "In a large skillet, heat a glug of oil or veggie broth over medium. When the pan is hot, add the garlic and sauté until it becomes fragrant. This will take about a minute. Add the mushrooms, tamari, and thyme. Cook, stirring every minute or so, for 6 to 8 minutes or until the mushrooms release their water and a little broth starts to form.",
        "Combine the cashews and veggie broth in a high-speed blender and blend until the mixture is completely smooth. This might take up to 5 minutes, depending on the speed and power of your blender. Pour the cashew sauce into the pan with the mushrooms. Reduce the heat to medium-low and simmer for a couple minutes to let the sauce thicken, stirring frequently. Throw in the spinach and stir for another minute.",
        "Prepare the lasagna noodles according to the package instructions. Make sure to do this after your mushroom sauce is ready to go, so the noodles don't sit for too long and start sticking together.",
        "Spread a third of the marinara sauce on the bottom of an 8-by-11-inch baking dish. Add a layer of noodles. Cover the noodles with half of the mushroom cream. Add a layer of noodles. Use another third of the marinara to cover these noodles. Add the remaining mushroom cream. Add the last layer of noodles and cover it with the remaining marinara sauce.",
        "Cover the lasagna with aluminum foil and bake for 30 minutes. Remove the foil, add a sprinkle of nutritional yeast over the top, if you like, and bake for another 15 minutes. Let the lasagna rest for 5 minutes before serving."
    ],
    "ingredients": [
        "Olive, grape seed, or coconut oil, or veggie broth for sautéing",
        "3 garlic cloves, minced",
        "16 ounces mushrooms, chopped (you can use a mix of different mushrooms)",
        "1 tablespoon tamari or coconut aminos",
        "1 teaspoon dried thyme",
        "3/4 cup raw cashews, soaked for a few hours (overnight is best), drained",
        "1 cup veggie broth",
        "2 big handfuls spinach",
        "10 ounces gluten-free lasagna noodles (I use Tinkyada's brown rice version)",
        "4 cups marinara sauce, store-bought (a 32-oz jar) or homemade",
        "Nutritional yeast (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Mushroom",
        "Lasagna",
        "Pasta",
        "Tomato",
        "Spinach",
        "Dinner",
        "Casserole/Gratin"
    ],
    "title": "Creamy Vegan Mushroom Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/creamy-mushroom-lasagna"
}
