{
    "directions": [
        "Preheat oven to 425 degrees F.",
        "Combine 2 cups flour, undissolved yeast, sugar and salt in a large bowl. Add very warm water and oil; mix until well blended, about 1 minute.",
        "Gradually add enough remaining flour to make a soft dough. Dough should form a ball and will be slightly sticky. Knead** on a floured surface, adding additional flour if necessary, until smooth and elastic, about 4 minutes. Divide dough into 8 portions; cover. (If using RapidRise Yeast, let dough rise at this point for 10 minutes.)",
        "Pat each portion of dough with floured hands into an 8-inch circle on a greased baking sheet. Form a rim by pinching the edge of the dough. Add a second crust to the same baking sheet.",
        "Bake for 6 to 7 minutes, dough will be just set and only lightly browned on the bottom. Remove crusts to a wire rack to cool. Continue with remaining pizza dough. (Works best to use several baking sheets.) May use crusts immediately or place in freezer bags and freeze for up to 1 month.",
        "When ready to bake, preheat oven to 475 degrees F. Spread each crust with pizza sauce. Top with desired toppings to make Halloween designs! Repeat with remaining pizzas. Place on a baking sheet and bake for 6 to 8 minutes, until cheese is melted and lightly browned and bottom of crust is browned."
    ],
    "ingredients": [
        "Crust:",
        "3 1/4 cups all-purpose flour, or more as needed",
        "1 envelope Fleischmann's® Pizza Crust Yeast or RapidRise Yeast",
        "1 1/2 tablespoons sugar",
        "1 1/2 teaspoons salt",
        "1 1/3 cups very warm water (120 degrees to 130 degrees F)*",
        "1/3 cup Mazola® Vegetable Plus! Oil",
        "Suggested Toppings:",
        "Green, red and yellow bell peppers",
        "Mushrooms",
        "Black olives",
        "Pepperoni slices",
        "Curly leaf parsley or other fresh herbs",
        "1 pound shredded white and yellow cheeses such as mozzarella and cheddar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creepy Mini Pizzas",
    "url": "http://allrecipes.com/recipe/228887/creepy-mini-pizzas/"
}
