{
    "directions": [
        "In a small saucepan over medium heat, combine the milk and butter and heat until the butter is melted, about 5 minutes. Remove from the heat and let cool to 105° to 115°F (40° to 46°C). Add the yeast and stir until the yeast is dissolved. Let stand for 10 minutes.",
        "In the bowl of a stand mixer fitted with the dough hook, combine the 4 cups (20 oz./630 g) flour, the sugar and salt and beat on low speed until combined, about 30 seconds. Add the milk mixture and knead until the dough forms a ball, about 1 minute. Increase the speed to medium-low and knead until the dough is smooth and elastic, 4 to 5 minutes. Remove the dough from the mixer bowl, oil the inside of the bowl and return the dough to the bowl. Cover tightly with plastic wrap and let the dough rise in a warm place until doubled in volume, about 1 hour.",
        "Preheat an oven to 400°F (200°C). Line 2 baking sheets with parchment paper.",
        "Divide the dough into 3 equal portions. Set aside one portion in the oiled bowl and cover with plastic wrap. You will use this dough to create the spiders.",
        "Divide each of the remaining two portions of dough into 6 balls of equal size. Arrange the 12 balls on one of the prepared baking sheets. These will form the buns.",
        "Remove the last third of the dough from the bowl and pull off 12 pieces, each about 1/8 oz. (3.5 g), or the size or a large marble, and roll into each into a ball. These will be the spider heads.",
        "Divide the remaining dough into 48 equal pieces, each about 1/4 oz. (7 g). Use your hands to roll each piece into a thin log about 2 inches (7.5 cm) long. Each log will be used to make two spider legs.",
        "In a small, shallow bowl, whisk together the eggs and water to make an egg wash. Pour the poppy seeds into another shallow bowl.",
        "Gently dip each spider leg into the egg wash, then roll in the poppy seeds. Transfer to the second prepared baking sheet. Repeat with all spider legs, then with the spider heads.",
        "Form the spiders on top of the buns by arranging 4 of the spider legs on top of each of the 12 balls that will form the buns, draping them across the ball so that they intersect in the middle. Each piece will form 2 of the spider legs. Place a spider head in the center of the bun, where the legs intersect, and attach the head to the legs by gently inserting a toothpick. Once all the spiders have been assembled, set aside and let rise for 30 minutes more.",
        "Bake until the buns are golden and an instant-read thermometer inserted into the center of a bun registers 190°F  (88°C), 14 to 16 minutes. Transfer the buns to a wire rack, remove the toothpick and let cool completely.",
        "To make the burgers, in a bowl combine the beef, green onions, garlic, ginger and hoisin sauce. Using your hands, mix gently until well combined. Divide the mixture into 12 equal balls and shape into small patties. Season with salt and pepper.",
        "Prepare a medium-hot fire in a grill. Grill the burger patties, turning once, until they reach the desired doneness, about 3 minutes per side.",
        "In a small bowl, stir together the mayonnaise and sriracha sauce. To assemble the sliders, split each bun in half horizontally and spread the cut sides of the buns with the sriracha mayo. Place the burgers on the bottoms of the buns. Top with the top half of the bun and serve immediately. Serves 4 to 6."
    ],
    "ingredients": [
        "1 1/2 cups (12 fl. oz./375 ml) milk",
        "8 Tbs. (1 stick) (4 oz./125 g) unsalted butter, cut into 8 pieces",
        "4 1/2 tsp. active dry yeast",
        "4 cups (20 oz./630 g) all-purpose flour, plus more for dusting",
        "5 Tbs. sugar",
        "1 Tbs. kosher salt",
        "2 eggs",
        "1 tsp. water",
        "1/4 cup (1 1/2 oz./45 g) poppy seeds",
        "1 1/2 lb. (500 g) ground beef",
        "3 green onions, thinly sliced",
        "1 garlic clove, chopped",
        "2 tsp. grated fresh ginger",
        "1 Tbs. hoisin sauce",
        "Salt and freshly ground pepper, to taste",
        "1/2 cup (4 oz./125 g) mayonnaise",
        "1 Tbs. sriracha sauce"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Creepy Crawly Spider Sliders",
    "url": "http://www.williams-sonoma.com/recipe/creepy-crawly-spider-sliders.html"
}
