{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "Pour the cream into a saucepan over medium-low heat. Scrape the vanilla caviar from the vanilla bean and add it to the cream (or add the vanilla extract if using instead). Bring almost to the boil, and then turn off the heat.",
        "Place the egg yolks in a large bowl and add 3/4 cup sugar. With a whisk, mix the eggs and sugar together. Now, break out your elbow grease and take a deep breath. You're going to need to whisk the mixture like crazy for 3 or 4 minutes, until it's very light yellow in color.",
        "Place a fine mesh strainer over a large bowl. Pour the hot cream into the bowl through the strainer.",
        "To temper the egg mixture, very slowly drizzle 1 cup of the hot cream into the egg/sugar mixture, whisking constantly to prevent the eggs from cooking. Continue adding the rest of the hot cream to the bowl very slowly, whisking constantly. You can add the cream a little more rapidly as the mixture warms.",
        "Place ramekins on a rimmed baking sheet and ladle in the custard until the ramekins are three-quarters full.",
        "Place the baking sheet inside the oven, and then pour water into the baking sheet until it reaches two-thirds of the way up the ramekins.",
        "Bake until the custard is set but not brown, 35 to 40 minutes, watching carefully to avoid browning.",
        "Remove the ramekins and allow to cool. Refrigerate the custards, covered, for at least 2 hours or overnight.",
        "When you are ready to serve the dessert, sprinkle the top of each custard generously with superfine sugar. Use a kitchen torch to burn the sugar to a crisp, working quickly to avoid cooking the custard below. (You may also place the ramekins on a pan and put them right under the broiler, but you have to be careful not to affect the custard below.)",
        "Serve immediately with spoons."
    ],
    "ingredients": [
        "1 quart heavy cream",
        "1 vanilla bean, split, or 1 teaspoon pure vanilla extract",
        "10 egg yolks",
        "3/4 cup superfine sugar, plus extra for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Creme Brulee",
        "Egg Recipes",
        "Sugar"
    ],
    "title": "Creme Brulee",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/creme-brulee-recipe"
}
