{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Butter a 13x9-inch pan.",
        "Combine the flour, cornmeal, baking powder, 1 teaspoon salt, and sugar, and mix well.",
        "Whisk together 5 eggs, 6 tablespoons melted butter, and buttermilk. Add wet to dry ingredients, mixing just until incorporated. Pour into prepared pan.",
        "Bake in preheated oven until top is browned and a toothpick comes out clean, about 55 minutes. Allow to cool completely.",
        "To Make Stuffing: In a small bowl, combine the 2 tablespoons salt with the white pepper, black pepper, cayenne pepper, onion powder, oregano, thyme, basil, and bay leaves.",
        "In another bowl, combine the minced onions, green onions, parsley, red or green peppers, chili peppers, and garlic.",
        "Melt 1 cup butter in a large frying pan. Add the spices and cook for a few minutes. Add the vegetables and cook about 5 minutes. Do not allow the vegetables to brown. Add the stock and Tabasco. Stir and cook 5 minutes more. Crumble the cornbread into the skillet and mix; remove pan from heat.",
        "Whisk 7 eggs and evaporated milk; pour into stuffing mixture. Return to low heat and cook, stirring, for about 2 minutes. Remove the bay leaves. Place stuffing in a bowl; cool before stuffing turkey."
    ],
    "ingredients": [
        "Cornbread:",
        "2 cups unbleached all-purpose flour",
        "2 cups stone ground cornmeal",
        "2 tablespoons baking powder",
        "1 teaspoon salt",
        "4 tablespoons white sugar",
        "5 eggs, beaten",
        "6 tablespoons butter, melted",
        "3 cups buttermilk",
        "Stuffing:",
        "2 tablespoons salt",
        "2 teaspoons ground white pepper",
        "2 teaspoons ground black pepper",
        "2 teaspoons cayenne pepper",
        "2 teaspoons onion powder",
        "4 teaspoons dried oregano",
        "2 teaspoons dried thyme",
        "6 tablespoons chopped fresh basil",
        "4 bay leaves",
        "1 cup minced onion",
        "1 cup chopped green onions",
        "1 cup chopped parsley",
        "2 cups chopped red bell pepper",
        "2 green chile peppers, chopped",
        "2 tablespoons minced garlic",
        "1 cup butter",
        "2 cups chicken broth",
        "1 tablespoon hot pepper sauce",
        "2 cups evaporated milk",
        "7 eggs, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creole Cornbread Stuffing",
    "url": "http://allrecipes.com/recipe/13589/creole-cornbread-stuffing/"
}
