{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Rub sweet potatoes with vegetable oil and wrap in aluminum foil.",
        "Place sweet potatoes in preheated oven. Bake until soft, about 1 hour. When cool enough to handle, peel, and cut into 1-inch chunks.",
        "Season pork shanks on all sides with black pepper and cayenne pepper.",
        "Heat olive oil in a large skillet over medium-high heat. Cook shanks on all sides until nicely browned on all sides, about 10 minutes total time. Transfer the pork shanks to a slow cooker.",
        "Saute onion, celery, bell pepper, and garlic in the skillet, scraping the browned bits from the bottom. Cook over medium heat until softened, about 5 minutes.",
        "Stir in 4 cups Swanson(R) Chicken Broth and diced tomatoes; bring to a boil. Add bay leaves and thyme and continue to simmer until mixture reduces slightly, about 10 minutes. Pour mixture into slow cooker with the pork shanks. Cook on high until tender, about 6 hours. Transfer pork shanks to a platter; tent with foil to keep them warm.",
        "Remove half of the vegetables from the cooking liquid (save for another use or discard). Transfer the remaining veggies and all of the liquid to a blender or food processor. Add the cooked sweet potato chunks. Process until smooth, about 1 minute.",
        "If the mixture is too thick, add 2 tablespoons at a time of chicken broth until it is to your desired consistency for gravy.",
        "Spoon sweet potato gravy over servings of the pork shanks."
    ],
    "ingredients": [
        "2 sweet potatoes",
        "1 teaspoon vegetable oil",
        "4 pork shanks, cut in half",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup olive oil",
        "1 medium onion, chopped",
        "3 celery ribs, chopped",
        "1 small green bell pepper, chopped",
        "4 garlic cloves, minced",
        "4 cups Swanson® Chicken Broth, plus more if needed",
        "2 (14.5 ounce) cans diced tomatoes",
        "3 bay leaves",
        "1 teaspoon dried thyme",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Creole Pork Shanks with Sweet Potato Gravy",
    "url": "http://allrecipes.com/recipe/245093/creole-pork-shanks-with-sweet-potato/"
}
