{
    "directions": [
        "Sift flour, sugar, and salt. Add eggs, one at a time, and mix until no lumps remain (you may use an electric mixer at slow speed). Mix in lemon rind or vanilla, cognac, and melted butter. Slowly add milk and mix until batter is consistency of thin cream. Let it stand an hour or two before making crêpes.",
        "Heat a crêpe pan (either 6-inch or 10-inch, according to desired size of crêpes) and rub it with butter. For each crêpe, pour a little batter into the pan, tilting about to let it run over the bottom in a fairly thin layer. When lightly browned on the bottom, turn carefully and brown other side. As each crêpe is cooked, remove it to a hot platter and keep warm. Re-butter pan as needed.",
        "Bake bananas in skins in a 350&176;F. oven for 15 to 18 minutes, while preparing pastry cream. Heat sugar and Grand Marnier in a shallow, flameproof serving dish, carmelizing it slowly over very low heat. Spread each crêpe with pastry cream, topped with a halved or whole banana, according to size and sprinkle liberally with almonds. Roll up crêpes and arrange them in pan with carmelized sugar. Sprinkle with a little sugar, add a dash or so of Grand Marnier and heat through quickly in the oven or on top of the stove. Pour cognac over crêpes and ignite. Spoon juices over crêpes and serve."
    ],
    "ingredients": [
        "7/8 cup flour",
        "1/4 cup sugar",
        "1/8 teaspoon salt",
        "3 eggs",
        "1 teaspoon grated lemon rind (or a little grated vanilla bean)",
        "2 tablespoons cognac",
        "2 tablespoons melted butter",
        "1 1/2 cups milk",
        "6 large unpeeled bananas",
        "Pastry Cream",
        "1/3 cup sugar",
        "1/2 cup Grand Marnier",
        "3/4 cup blanched and shredded (or chopped) almonds",
        "1/3 cup cognac, warmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Banana",
        "Tree Nut",
        "Almond",
        "Cognac/Armagnac",
        "Triple Sec",
        "Winter",
        "House & Garden"
    ],
    "title": "Crepes Directoire",
    "url": "http://www.epicurious.com/recipes/food/views/crepes-directoire-101492"
}
