{
    "directions": [
        "Combine first 6 ingredients in blender and blend until smooth. Let stand 1 hour at room temperature. Blend again before using.",
        "Brush 8- to 9-inch-diameter nonstick skillet lightly with melted butter. Heat over medium-high heat. Pour scant 1/4 cupful batter into skillet, tilting to allow batter to coat bottom of skillet. Cook until crepe is golden on bottom, about 1 minute. Turn crepe over and cook until brown on bottom, about 45 seconds. Transfer to paper towel. Repeat with remaining batter, making about 24 crepes and stacking crepes between paper towels. Cool.",
        "Combine cajeta, milk, and butter in heavy medium saucepan. Bring to boil. Reduce heat to medium and simmer until sauce is reduced to 2 3/4 cups, about 5 minutes. Remove from heat. Stir in Cognac.",
        "Place 1 crepe on work surface. Spread with 1 tablespoon sauce. Sprinkle with 1 tablespoon chopped pecans. Fold crepe in half over filling, then in half again, forming triangle. Repeat with remaining crepes, sauce, and pecans. Arrange crepes in two 13x9x2-inch glass baking dishes. (Can be prepared 1 day ahead. Cover and chill crepes and remaining sauce separately. Rewarm sauce just until pourable before continuing.)",
        "Preheat oven to 350°F. Pour remaining sauce over crepes. Bake until heated through, about 15 minutes. Sprinkle with any remaining pecans and serve."
    ],
    "ingredients": [
        "2 1/2 cups whole milk",
        "5 large eggs",
        "1 cup all purpose flour",
        "6 tablespoons (3/4 stick) unsalted butter, melted, cooled slightly",
        "2 tablespoons sugar",
        "3/4 teaspoon salt",
        "Additional melted butter (for frying)",
        "3 cups cajeta",
        "3/4 cup whole milk",
        "3 tablespoons unsalted butter",
        "3 tablespoons Cognac or brandy",
        "2 cups pecans, toasted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Pecan",
        "Brandy",
        "Spring",
        "Pan-Fry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Crepes with Caramel Sauce and Toasted Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/crepes-with-caramel-sauce-and-toasted-pecans-108071"
}
