{
    "directions": [
        "In a large bowl, combine the granulated garlic, 1/2 teaspoon of the sea salt, and the dried oregano. Add the chicken thighs and rub the seasoning into the chicken until evenly coated; set aside. You can also cover and refrigerate the chicken thighs and marinate for 2 to 24 hours.",
        "When you're ready to cook the chicken, heat the ghee or oil in a cast-iron skillet or sauté pan over medium-heat.",
        "Remove the marinated chicken thighs from the bowl and, using paper towels, pat the chicken thighs dry. Place the chicken thighs, skin side-down, in the hot ghee or oil, spacing them evenly, and cook for 6 to 8 minutes, until the skin begins to brown. Turn the chicken thighs and brown on the opposite side for 5 minutes. Remove from the skillet and set aside.",
        "In the same skillet over medium heat, add the onion, garlic, capers, and the remaining 1/2 teaspoon sea salt. Cook for 5 minutes, stirring occasionally. Add the lemon slices.",
        "Add the white wine and deglaze the skillet, stirring to loosen any browned bits stuck to the bottom. Bring to a simmer and let cook for 5 minutes.",
        "Add the chicken broth, return the thighs to the skillet, and bring to a simmer. Simmer for 5 minutes.",
        "Add the artichoke hearts and olives and continue simmering for 10 minutes.",
        "Remove the chicken thighs from the skillet, pull the meat from the bones, and roughly chop. Add the chicken meat back into the skillet and stir to distribute evenly. To serve, scoop the stew into serving bowls and garnish with the chopped fresh oregano.",
        "The stew or any leftovers can be refrigerated for up to 1 week, or frozen for up to 6 months."
    ],
    "ingredients": [
        "1 tablespoon granulated garlic",
        "1 teaspoon sea salt",
        "1 teaspoon dried oregano",
        "2 pounds bone-in, skin-on chicken thighs",
        "2 tablespoons ghee or olive oil",
        "1/2 red onion, peeled, and chopped",
        "2 garlic cloves, minced",
        "1/4 cup capers with brine",
        "1/2 lemon, thinly sliced",
        "1/4 cup white wine",
        "3 cups Chicken Bone Broth",
        "2 cups canned artichoke hearts",
        "1 cup Kalamata olives",
        "1 1/2 teaspoons chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Soup/Stew",
        "Chicken",
        "Artichoke",
        "Olive",
        "Kid-Friendly",
        "Healthy"
    ],
    "title": "Crispy Chicken Stew With Lemon, Artichokes, Capers, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-chicken-stew-with-lemon-artichokes-capers-and-olives"
}
