{
    "directions": [
        "1. Melt 1/2 cup butter in a large skillet over medium-high heat.",
        "2. Slowly stir in sugar, stirring until sugar thoroughly dissolves and sauce turns a deep amber color, about 5-8 minutes. Pour in wine, orange juice, lemon juice, and red wine vinegar. Still stirring, bring entire mixture to boil.",
        "3. Add berries and chicken broth to sauce; continuing to boil until sauce thickens and is reduced to about 1 1/2 cups, stirring occasionally. This will take about 20-30 minutes.",
        "4. Add Cognac and maple syrup. Using the back of a spoon, mash the berries into the mixture. Set aside.",
        "5. Preheat oven to 400°F. After trimming any excess fat from the duck breasts, cut small slits in the skin (but not in the meat) of the duck. Thoroughly season breasts with salt and pepper.",
        "6. Heat a heavy ovenproof skillet over high heat. Add duck—skin-side down—and sear until lightly brown, about 5 minutes. Turn over and cook for an additional 2-3 minutes. Transfer skillet to oven and cook until duck reaches desired doneness (about 5 minutes for medium).",
        "7. As duck bakes, reheat blackberry sauce over low heat. Add last tablespoon of butter and whisk until just barely melted. Season to taste with salt and pepper.",
        "8. Spoon sauce onto plates, then place duck atop sauce. Garnish with additional sauce and blackberries if so desired."
    ],
    "ingredients": [
        "1/2 cup plus 1 tablespoon unsalted butter",
        "1/4 cup white sugar",
        "1/3 cup dry white wine: Chenin Blanc or Sauvignon Blanc",
        "1/4 cup orange juice",
        "1/4 cup lemon juice",
        "2 tablespoons red wine vinegar",
        "1 1/2 cups frozen blackberries, thawed",
        "1 3/4 cups chicken broth",
        "2 tablespoons Cognac",
        "1 tablespoon Vermont maple syrup",
        "4 (5- to 6-ounce) duck breast halves with skin",
        "Kosher salt to taste",
        "Black pepper to taste",
        "Additional blackberries for presentation"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Duck",
        "Fruit",
        "Poultry",
        "Roast",
        "Dinner",
        "Blackberry",
        "Advance Prep Required",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crispy Roast Duck with Blackberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-roast-duck-with-blackberry-sauce-51118400"
}
