{
    "directions": [
        "MIX 1/2 cup sour cream and chopped chives together in a small bowl. Refrigerate.",
        "Preheat oven to 400 degrees F.  Shred 1/2 of cheese to make about 1 cup of shreds.  Divide shreds into 8 piles, about 2-inches apart, on a silicone baking mat or parchment paper lined cookie sheet and bake about 5 minutes or until cheese melts and becomes crisp. Let cool 5 minutes and remove from baking sheet. Reduce oven temperature to 180 degrees F.",
        "Cut the remaining 4 oz. cheese into 8 1/2-inch cubes.  Form balls of mashed potato mixture, using an ice cream scoop.  Make a small hole in center of each potato ball and fill with one cube Borden® Cheese. Cover with additional mashed potato so cheese is hidden inside. Refrigerate until ready to fry.",
        "Heat oil in a large saucepan over medium-high heat to 375 degrees F. Prepare beer batter according to package directions; dip each mashed potato ball into batter, and deep-fry for about 5 minutes or until golden brown. Remove from oil, and drain on paper towel. Reheat oil to 375 degrees F between batches. Keep potato puffs warm in the holding oven.",
        "Place potato puff on a plate; top with dollop of chive cream, a few chives and the Cheddar crisp. Serve immediately."
    ],
    "ingredients": [
        "Chive Cream:",
        "3/4 cup sour cream, divided",
        "1 teaspoon finely chopped chives or green onions",
        "Cheddar Crisps:",
        "8 ounces Borden® Medium Cheddar Cheese Chunk, divided",
        "Potato Puffs:",
        "2 medium russet potatoes, peeled and chopped",
        "2 tablespoons Borden® Butter",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon seasoned salt",
        "1/8 teaspoon dry mustard",
        "1/4 teaspoon salt",
        "15 bacon strips, cooked crisp and crumbled",
        "1 cup beer batter dry mix",
        "Oil, as needed for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Cheddar Mashed Potato Puffs",
    "url": "http://allrecipes.com/recipe/255686/crispy-cheddar-mashed-potato-puffs/"
}
