{
    "directions": [
        "Preheat oven to 350°F.",
        "Toast pecans in a shallow baking pan in middle of oven, shaking occasionally, until fragrant and a few shades darker, 8 to 10 minutes. Toss immediately with 1/2 tablespoon butter and 1/8 teaspoon salt.",
        "Melt remaining 3 tablespoons butter in a well-seasoned crêpe pan or an 8-inch nonstick skillet. Blend milk, eggs, flour, remaining 1/4 teaspoon salt, and 2 tablespoons sugar in a blender until smooth. Pour in melted butter, leaving a film of butter in skillet, and blend until well combined.",
        "Heat skillet over moderately high heat until hot but not smoking. Half fill a 1/4-cup measure with batter and, holding skillet off heat, pour in batter, immediately swirling and tilting skillet to create a thin even layer. (If batter sets before skillet is coated, reduce heat slightly. Next crêpe will be better.) Return skillet to heat and cook until crêpe is golden around edges and dry in center, about 45 seconds. Flip crêpe carefully and cook until golden, about 15 seconds more. Sprinkle crêpe lightly with sugar.",
        "Make more crêpes with remaining batter, stacking them as cooked and lightly sprinkling each with sugar.",
        "Preheat broiler and butter an 8-inch round flameproof shallow baking dish.",
        "Heat dulce de leche paste and cream in a small saucepan over moderate heat, stirring, until smooth. Reduce heat and simmer until slightly thickened, about 1 minute.",
        "Fold crêpes into eighths and arrange in baking dish. Sprinkle lightly with sugar, then broil about 6 inches from heat until edges are crispy, about 45 seconds. Serve with sauce and pecans."
    ],
    "ingredients": [
        "1/3 cup pecans, coarsely chopped",
        "31/2 tablespoons unsalted butter",
        "3/8 teaspoon salt",
        "1 cup whole milk",
        "3 large eggs",
        "2/3 cup all-purpose flour",
        "2 tablespoons sugar plus additional for sprinkling",
        "3 tablespoons dulce de leche paste* or Nutella",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Nut",
        "Dessert",
        "Pecan",
        "Gourmet"
    ],
    "title": "Crispy Crepes with Dulce de Leche Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-crepes-with-dulce-de-leche-sauce-105926"
}
