{
    "directions": [
        "Preheat oven to 375°. Cut 4 potatoes into 1\" chunks and place in a medium pot. Cover with cold water by 1\". Season water generously with salt, bring to a boil over medium-high heat, and cook until potatoes are tender, 10-12 minutes. Drain well, transfer to a large bowl, and mash with a potato masher; set aside.",
        "Meanwhile, heat 2 Tbsp. oil in a large skillet over medium until shimmering. Add leeks, 1/4 tsp. salt, and 1/4 tsp. pepper and cook, stirring frequently, until softened and golden, 5-8 minutes. Add garlic and cook until fragrant, 1-2 minutes more. Remove pan from heat and let cool slightly.",
        "Grease bottom and sides of an 8x8\" baking pan with 2 Tbsp. oil. Place pan in oven for 10 minutes.",
        "Meanwhile, grate 3 potatoes and onion using the large holes of a box grater or a food processor fit with a shredding blade. Wrap potatoes and onion in a clean dishtowel or several layers of paper towels and squeeze out as much liquid as you can; add to the bowl with the mashed potatoes. Stir in sautéed leeks and garlic, eggs, 2 Tbsp. oil, 1 Tbsp. thyme, 2 tsp. salt, and 1/4 tsp. pepper; mix until well combined.",
        "Thinly slice remaining 2 potatoes and toss with remaining 1 Tbsp. oil, 1 tsp. thyme, 1/4 tsp. salt, and 1/4 tsp. pepper in a medium bowl; set aside.",
        "Carefully remove preheated pan from oven and transfer potato-onion mixture to the pan (it should sizzle when it hits the hot oil). Smooth top with a spatula. Layer potato slices over the top in a shingled fashion. Bake until golden brown and cooked through, 60-75 minutes. Heat broiler; broil kugel until crispy crust forms, 1-2 minutes, watching carefully so it does not burn. Let cool briefly, then cut into squares to serve."
    ],
    "ingredients": [
        "9 medium russet potatoes (about 4 1/2 pounds), peeled",
        "7 tablespoons vegetable oil, divided",
        "3 medium leeks, white and pale-green parts only, thinly sliced crosswise",
        "2 1/2 teaspoons kosher salt, divided, plus more",
        "3/4 teaspoon freshly ground black pepper, divided",
        "2 garlic cloves, finely chopped",
        "1 small onion",
        "4 large eggs, lightly beaten",
        "1 tablespoon plus 1 teaspoon fresh thyme leaves, divided",
        "An 8x8\" baking pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Passover",
        "Kid-Friendly",
        "Leek"
    ],
    "title": "Crispy Potato-Leek Kugel",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-potato-leek-kugel-56389339"
}
