{
    "directions": [
        "Place the eggplant cubes into a colander. Add the salt and toss well. Let the eggplant drain for 15 minutes, then rinse it lightly with water. Let the eggplant drain again in the colander.",
        "Bring a large pot of water to a boil. Add the noodles and boil them for about 5 minutes, until they are tender. Drain and rinse well with cold water. Let the noodles drain in a colander for at least 10 minutes.",
        "Combine the sherry with the cornstarch in a small bowl. Mix well and set aside.",
        "In a saucepan combine the red wine vinegar, water, ginger, sugar, imitation fish sauce, and onions. Bring the mixture to a boil, turn the heat to low and let the mixture simmer for 5 minutes.",
        "In a large skillet, preferably non-stick, heat 1 1/2 tablespoon oil over medium-high heat. Add the eggplant, and cook it for 5 minutes, stirring frequently. Add the garlic and red pepper and cook, stirring occasionally for 5 minutes more or until the eggplant softens. Add both the onion-vinegar mixture and the cornstarch-sherry mixture. Cook for 2 to 3 minutes, stirring occasionally. Keep the mixture warm.",
        "In a large non-stick skillet heat the remaining 1 1/2 tablespoons oil over medium-high heat. When the oil begins to smoke, add the noodles, then place two or three plates on top of them so that more surface area will brown. Let the noodles sit over medium-high heat for 5 minutes. When the noodles have developed a golden brown crust on the underside remove the plates, turn the noodles over with a spatula and cook them 5 minutes on the other side. Then take the pan off the heat.",
        "Add the peanuts to the eggplant mixture, and spoon it onto plates. Divide the noodles into four parts, and place them atop the vegetables and sauce. Sprinkle with mint, if you like, and serve."
    ],
    "ingredients": [
        "1 medium eggplant, cubed",
        "1 teaspoon salt",
        "16 ounces fresh Chinese wheat noodles",
        "2 tablespoons sherry",
        "1 tablespoon cornstarch",
        "1/4 cup red wine vinegar",
        "1/3 cup water",
        "1 tablespoon minced fresh ginger root",
        "1 tablespoon white sugar",
        "2 tablespoons vegetarian fish sauce",
        "2 cups sliced onion",
        "3 tablespoons canola oil",
        "4 cloves garlic, minced",
        "1 red bell pepper, julienned",
        "4 tablespoons chopped, unsalted dry-roasted peanuts",
        "1 tablespoon chopped fresh mint (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Chinese Noodles with Eggplant and Peanuts",
    "url": "http://allrecipes.com/recipe/14049/crispy-chinese-noodles-with-eggplant/"
}
