{
    "directions": [
        "Trim excess fat from duck breasts. Heat a 12-inch heavy skillet over high heat until very hot. Pat breasts dry and season with salt. Put breasts, skin sides down, in skillet and reduce heat to moderate. Cook breasts 20 minutes, or until skin is crisp and mahogany-colored, removing fat from skillet as it is rendered with a metal bulb baster (or very carefully pouring it off). Turn breasts and cook about 2 minutes for medium-rare or to desired doneness. Transfer breasts to a plate and keep warm, covered loosely.",
        "While duck breasts are cooking, peel pear and cut into 1/4-inch dice. Pour off all but about 1 tablespoon fat from skillet and sauté pear until lightly browned, about 1 minute. In a measuring cup stir together apple juice and cornstarch. To pear add Calvados or Armagnac. Stir in cornstarch mixture, peppercorns, demiglace or bouillon cube, and thyme and simmer, stirring, 2 minutes, or until slightly thickened.",
        "Serve duck breasts, sliced, with sauce spooned over them and garnish with thyme sprigs."
    ],
    "ingredients": [
        "1 1/2 pounds boneless duck breast* (4 boneless breast halves, cut from two 5 1/2- to 6-pound ducks)",
        "1 firm-ripe Bosc pear",
        "3/4 cup apple juice",
        "1/2 teaspoon cornstarch",
        "2 tablespoons Calvados or Armagnac",
        "1 tablespoon green peppercorns packed in brine, drained and crushed lightly",
        "1 tablespoon duck or veal demiglace* or 1/2 extra-large vegetarian vegetable bouillon cube",
        "1 teaspoon fresh thyme leaves or 1/4 teaspoon dried, crumbled",
        "Garnish: fresh thyme sprigs",
        "*available at many butcher shops and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Fruit",
        "Sauté",
        "Apple",
        "Pear",
        "Brandy",
        "Fall",
        "Gourmet"
    ],
    "title": "Crispy Duck Breasts with Pear and Green Peppercorn Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-duck-breasts-with-pear-and-green-peppercorn-sauce-10677"
}
