{
    "directions": [
        "Line baking sheet with plastic wrap. Arrange fish, skin side up, on sheet. Spread coarse salt generously on skin to coat completely. Chill uncovered 1 hour.",
        "Preheat oven to 475°F. Rinse salt off fish; pat until very dry. Place fish, skin side up, on work surface. Using large knife with edge of blade perpendicular to skin, scrape surface of skin to remove any moisture, wiping blade clean often. Using razor blade, score skin in 1-inch crosshatch squares. Sprinkle with pepper.",
        "Heat 1 1/2 tablespoons oil in each of 2 large ovenproof skillets over high heat. Add 2 fillets, skin side down, to each skillet. Sear until skin is crisp and brown, about 4 minutes. Place skillets in oven (do not turn fish) and roast until fish is just opaque in center, about 4 minutes.",
        "Meanwhile, heat 3 tablespoons oil in large pot over medium high heat. Add garlic and sauté 30 seconds. Add escarole and toss until beginning to wilt, about 2 minutes. Add 1 1/2 tablespoons vinegar and toss. Season with salt and pepper.",
        "Mound escarole in center of 4 plates. Top with fish, skin side up. Sprinkle with remaining 1 1/2 tablespoons vinegar."
    ],
    "ingredients": [
        "4 6-ounce 1-inch-thick fish fillets with skin (such as salmon or black sea bass)",
        "Coarse kosher salt",
        "6 tablespoons olive oil, divided",
        "2 large garlic cloves, finely chopped",
        "1 large head of escarole, coarsely chopped (about 8 cups packed)",
        "3 tablespoons Sherry wine vinegar, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Roast",
        "Sauté",
        "Low Carb",
        "High Fiber",
        "Dinner",
        "Seafood",
        "Bass",
        "Salmon",
        "Healthy",
        "Escarole",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Crispy-Skin Fish Fillets with Wilted Escarole",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-skin-fish-fillets-with-wilted-escarole-241115"
}
