{
    "directions": [
        "Whisk egg yolk, garlic, and 1 tablespoon lemon juice in a bowl until well-blended. Drizzle in 1 tablespoon olive oil and canola oil slowly, whisking constantly, until blended. Drizzle in remaining olive oil and canola oil, whisking constantly, until thick and smooth. Season with salt, pepper, and paprika. Transfer aioli to the refrigerator.",
        "Melt butter in a skillet over medium-low heat. Stir in flour to make a paste, about 1 minute. Reduce heat to low. Stir in milk gradually until sauce thickens, 2 to 3 minutes. Stir in tuna, parsley, chives, dill, 1/2 teaspoon lemon juice, lemon zest, and nutmeg. Cook and stir until mixture is the consistency of mashed potatoes, about 3 minutes. Season with salt and pepper.",
        "Spread tuna mixture in a baking dish. Cover with plastic wrap and cool in refrigerator, 2 to 3 hours or overnight.",
        "Whisk 2 eggs in a small bowl.",
        "Pour panko bread crumbs into a shallow dish.",
        "Divide chilled tuna mixture into 8 equal portions; shape into cylinders or patties with lightly moistened hands. Dip cylinders into egg wash and roll in bread crumbs to coat. Arrange on a plate and chill until firm, about 1 hour.",
        "Heat vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Fry croquettes in batches until golden brown, 5 to 8 minutes. Remove with a slotted spoon and drain on paper towels. Serve alongside aioli."
    ],
    "ingredients": [
        "Garlic Aioli:",
        "1 egg yolk, at room temperature",
        "3 large cloves garlic, minced",
        "1 tablespoon lemon juice",
        "5 tablespoons extra-virgin olive oil",
        "5 tablespoons canola oil",
        "salt and ground black pepper to taste",
        "1 pinch Spanish paprika",
        "Croquettes:",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "3/4 cup milk",
        "1 (5 ounce) can solid white albacore tuna in water (such as Bumble Bee®)",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon chopped fresh chives",
        "1 tablespoon chopped fresh dill",
        "1/2 teaspoon lemon juice",
        "1/2 teaspoon lemon zest",
        "1 dash ground nutmeg",
        "salt and ground black pepper to taste",
        "2 eggs",
        "2 cups panko bread crumbs",
        "vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Tuna Croquettes",
    "url": "http://allrecipes.com/recipe/254436/crispy-tuna-croquettes/"
}
