{
    "directions": [
        "Place pork in heavy medium saucepan. Add pinch of salt and enough cold water to cover by 1/2 inch. Bring to simmer over medium heat. Reduce heat to medium-low and simmer gently, uncovered, until meat is tender, about 1 hour 10 minutes. Cool meat in broth. Using slotted spoon, transfer meat to work surface; discard broth. Shred meat coarsely into large bowl.",
        "Place tomatoes with juices and chiles into blender and puree. Heat oil in heavy large skillet over medium-high heat. Add onion and sauté 3 minutes. Add garlic and sauté 1 minute. Add pork and sauté until browned, about 10 minutes. Mix in raisins, vinegar, pepper, and cinnamon, then tomato puree. Simmer until picadillo is thick, stirring often, about 6 minutes. Season to taste with salt. (Can be made 1 day ahead. Cover and chill. Rewarm over low heat before using.)",
        "Combine fresh masa or masa harina mixture, lard, flour, baking powder, and salt in large bowl. Knead well, adding more warm water by tablespoonfuls as needed until dough is soft, smooth, and pliable but not sticky. Divide dough into 12 equal pieces; shape into balls. Place on sheet of foil. Cover with plastic wrap to prevent drying.",
        "Flatten balls with moistened fingertips to 2 1/2x3/4-inch disks. Heat heavy large griddle or skillet over medium-high heat. Place 3 disks on griddle. Cook until outsides are light brown but insides are still soft and uncooked, about 3 minutes per side. Transfer disks to baking sheet. Repeat with remaining disks.",
        "Using greased knife, cut each disk horizontally in half; turn so uncooked sides are up. Using fingertips, flatten uncooked center of each and pinch edge of soft dough between fingertips to form 1/4- to 3/8-inch-high rim.",
        "Pour enough oil into large skillet to reach depth of 1/2 inch. Attach deep-fry thermometer and heat oil to 350°F to 360°F. Fry 4 dough shells at a time until lightly browned and crunchy outside but still tender inside, about 1 minute. Using slotted spoon, transfer shells to paper towels to drain. Spoon warm filling into each shell. Sprinkle with almonds and serve."
    ],
    "ingredients": [
        "1 pound boneless country-style pork ribs, cut into 1-inch cubes",
        "1 14.5- to 16-ounce can whole tomatoes in juice",
        "2 canned chipotle chiles, chopped",
        "2 tablespoons vegetable oil",
        "2/3 cup chopped white onion",
        "1 large garlic clove, chopped",
        "1/4 cup raisins",
        "2 teaspoons apple cider vinegar",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground cinnamon",
        "2 1/2 cups freshly ground corn masa dough for tortillas (about 26 ounces), or make masa dough with 2 1/4 cups masa harina (corn tortilla mix; about 9 ounces) mixed with 1 1/2 cups warm water",
        "2 tablespoons lard or solid vegetable shortening",
        "1/4 cup all purpose flour",
        "1 teaspoon baking powder",
        "3/4 teaspoon salt",
        "Warm water (optional)",
        "Vegetable oil (for frying)",
        "1/4 cup slivered almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Pork",
        "Tomato",
        "Fry",
        "Cocktail Party",
        "Cinco de Mayo",
        "Buffet",
        "Raisin",
        "Hot Pepper",
        "Cinnamon",
        "Hominy/Cornmeal/Masa",
        "Simmer"
    ],
    "title": "Crispy Masa Boats with Pork Picadillo",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-masa-boats-with-pork-picadillo-108019"
}
