{
    "directions": [
        "Combine potatoes, 1/4 cup salt, and 3 qt. cold water in a 5–7-qt. pot. Bring to a boil, then reduce to a simmer; cook until just fork-tender, 2–3 minutes. Drain, arrange in a single layer on a large plate, and chill until cold, about 20 minutes (handle potatoes delicately; they will be fragile until chilled).",
        "Pour oil into a wide heavy pot to a depth of 2\". Heat over medium-high until deep-fry thermometer registers 350°F.",
        "Meanwhile, coarsely crush 1 Tbsp. mustard seeds. Combine flour, cornstarch, 2 Tbsp. paprika, 1/2 tsp. pepper, 1/4 tsp. garlic powder, 1 tsp. salt, crushed mustard seeds, and remaining whole mustard seeds in a large bowl. Combine buttermilk and chilled potatoes in another large bowl. Dredge potatoes in flour mixture, then transfer to a plate as you go.",
        "Working in two batches, fry wedges, turning once halfway through, until crisp, 6–8 minutes per batch. Drain on paper towels. Transfer to a serving platter, then season with salt, pepper, paprika, and garlic powder."
    ],
    "ingredients": [
        "2 pounds russet potatoes (2-3 medium), scrubbed, cut into 1/2\"-thick wedges",
        "1/4 cup plus 1 teaspoon kosher salt, divided, plus more for serving",
        "Canola oil (for frying)",
        "2 tablespoons yellow mustard seeds, divided",
        "1 cup all-purpose flour",
        "3 tablespoons cornstarch",
        "2 tablespoons Hungarian sweet paprika, plus more for serving",
        "1/2 teaspoon freshly ground black pepper, plus more for serving",
        "1/4 teaspoon garlic powder, plus more for serving",
        "2 cups buttermilk",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Kid-Friendly",
        "Deep-Fry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Crispy Spiced Potato Wedges",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-spiced-potato-wedges-56390102"
}
