{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Sprinkle both sides of eggplant rounds generously with salt; place on baking sheet for 15 minutes to draw out moisture. Use paper towels to blot moisture from each side of the eggplant slices. Sprinkle lightly with salt and pepper.",
        "Whisk eggs in a shallow bowl. Place panko bread crumbs in a second bowl. Dip each side of the eggplant slices in the whisked eggs, then press into the panko crumbs to coat each side. Place slices on a cooling rack on a baking sheet.",
        "Spray the tops of eggplant generously with cooking spray. Bake 8 minutes in preheated oven. Turn each slice, and spray the other side with cooking spray. Bake an additional 8 to 10 minutes. Remove from oven and let cool slightly.",
        "Reduce oven temperature to 350 degrees (175 degrees C).",
        "To make the stacks: Cover a baking sheet with parchment paper. Place a large slice of eggplant on the parchment. Top with a spoonful of Ragu(R) Old World Style(R) Traditional Sauce and a slice of mozzarella. Place another slice of eggplant on the first; repeat the layering process until you have about 5 or 6 slices in a stack. Top with a generous layer of parmesan cheese.",
        "Bake stacks until the cheese has melted, 10 to 15 minutes. Remove from oven and let cool for a few minutes. Serve warm."
    ],
    "ingredients": [
        "2 large eggplants, sliced into 1/2-inch rounds",
        "Salt to draw moisture from eggplant",
        "Salt and pepper to taste",
        "4 eggs",
        "4 cups panko bread crumbs",
        "Cooking spray",
        "1 (24 ounce) jar Ragu® Old World Style® Traditional Sauce",
        "2 (8 ounce) packages mozzarella cheese, thinly sliced",
        "1 cup grated parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Eggplant Parmesan Stacks",
    "url": "http://allrecipes.com/recipe/236787/crispy-eggplant-parmesan-stacks/"
}
