{
    "directions": [
        "Diagonally score fat side of pork belly, cutting through fat but stopping at flesh and spacing about 1/4\" apart. Season pork with salt and pepper and sprinkle with 1 tablespoon brown sugar. Wrap tightly in plastic wrap and let sit at least 2 hours, or chill up to 2 days.",
        "Preheat oven to 400°F. Unwrap pork and place in the smallest baking dish you can. Add chiles de árbol, star anise, soy sauce, remaining 1 tablespoon brown sugar, and 1 1/4 cups water. Roast until most of fat has rendered, meat is tender, and top is browned and crisp, 2–2 1/2 hours.",
        "Meanwhile, toss cucumbers, scallions, red chile, and vinegar in a small bowl to combine. Mix gochujang and miso in another small bowl.",
        "Transfer pork to a cutting board; let rest 10 minutes. Pour off pan juices into a measuring glass. Skim fat from surface.",
        "Slice pork into 1/2\" slices, transfer to a platter, and pour pan juices over. Serve with lettuce for wrapping and cucumber salad, mint, kimchi (if using), and gochugang-miso mixture for topping.",
        "Pork can be cooked 2 days ahead. Let cool; cover and chill. Reheat before serving."
    ],
    "ingredients": [
        "1 (12-ounce) piece skin-on pork belly (about 4x3 1/2x1 1/4\")",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons light brown sugar, divided",
        "4 chiles de árbol",
        "2 star anise pods",
        "2 tablespoons soy sauce",
        "2 Persian or kirby cucumbers, thinly sliced",
        "2 scallions, thinly sliced",
        "1/2 red chile (such as Fresno or jalapeño), thinly sliced",
        "2 tablespoons unseasoned rice wine vinegar",
        "3 tablespoons gochujang (Korean red pepper paste)",
        "3 tablespoons white miso",
        "1 small head of lettuce (such as Little Gem or romaine hearts), torn",
        "1/2 bunch mint",
        "1/2 cup kimchi (optional)",
        "Gochujang, a mixture of miso and hot chiles, is available at Korean markets and online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Mint",
        "Cucumber",
        "Cabbage",
        "Lettuce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Crispy Pork Lettuce Wraps With Spicy Cucumbers",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-pork-lettuce-wraps-with-spicy-cucumbers-56390119"
}
