{
    "directions": [
        "Melt butter in a large heavy saucepan over low heat. Add onion and cook until tender. Stir in flour; cook and stir until smooth, about 1 minute. Reduce heat if mixture browns too quickly.",
        "Gradually add 1/2 cup of chicken broth and cook over medium heat stirring constantly until thickened and bubbly. Stir in dry mustard, salt, and chopped chicken; whisk in egg yolks.",
        "Cook over medium heat stirring constantly for 4 to 5 minutes. Remove from heat. Refrigerate 3 to 4 hours or preferably overnight.",
        "Combine remaining 1/4 cup chicken broth and hot pepper paste; stir into chilled chicken mixture.",
        "Shape chicken mixture into patties (an ice cream scoop will give you consistent size patties). Dredge patties in cracker crumbs.",
        "Pour 1/2 inch oil into skillet. Heat to 375 degrees F (190 degrees C) over medium-high heat. When oil is hot, fry the croquettes until golden brown; do not turn the croquettes until they are well browned on the first side, 4 to 5 minutes. Turn and cook the other side, 4 to 5 minutes. Fry in batches, as needed. Drain on paper towels.",
        "Melt 1/3 cup butter in a skillet over medium high heat. Add garlic and cook for 30 seconds to 1 minute, stirring constantly to prevent it from burning. Stir in flour and whisk continuously for 1 minute.",
        "Pour in the milk and herbs and continue to cook, whisking constantly, until sauce begins to thicken, about 1 minute. Ladle sauce over croquettes on serving plates."
    ],
    "ingredients": [
        "1 tablespoon LAND O LAKES® Butter",
        "1/4 cup finely chopped onion",
        "1 tablespoon all-purpose flour",
        "3/4 cup chicken broth, divided",
        "1/2 teaspoon dry mustard",
        "1/2 teaspoon salt",
        "4 cups finely chopped cooked chicken",
        "2 egg yolks, beaten",
        "1/4 teaspoon hot pepper paste",
        "1 cup cracker crumbs",
        "Canola oil for frying",
        "Garlic Butter Sauce:",
        "1/3 cup LAND O LAKES® Butter",
        "2 teaspoons minced garlic",
        "1 tablespoon all-purpose flour",
        "1 cup milk",
        "1 pinch fresh thyme",
        "1 pinch fresh oregano",
        "1 pinch fresh basil",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Chicken Croquettes with Garlic Butter Sauce",
    "url": "http://allrecipes.com/recipe/247263/crispy-chicken-croquettes-with-garlic/"
}
