{
    "directions": [
        "Preheat oven to 350°F. Generously butter cake pan; set aside.",
        "Heat 2 tablespoons butter in a large skillet over medium heat. Add garlic and cook, stirring, until golden brown, about 4 minutes; transfer to a paper towel–lined plate.",
        "Add remaining 2 tablespoons butter to skillet. Once butter is melted, add potatoes; season with salt and pepper and cook, tossing occasionally, until beginning to soften, 6–8 minutes. Add duck fat and continue to cook potatoes, tossing occasionally, until tender and golden brown in spots, 15–20 minutes longer.",
        "Transfer potatoes to prepared cake pan, pressing down firmly and evenly (this will help potatoes hold together when you turn the potato cake out). Bake potatoes until crisp on top, 12–15 minutes. Let cool 5 minutes, then invert potato cake onto a plate, season with salt and pepper, and top with parsley and reserved garlic.",
        "DO AHEAD: Potatoes can be sautéed and arranged in cake pan 6 hours ahead. Cover and chill; bake 10–15 minutes longer to warm through."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter, divided, plus more for pan",
        "6 garlic cloves, thinly sliced",
        "3 pounds small Yukon Gold potatoes, peeled, sliced 1/4\" thick",
        "Kosher salt, freshly ground pepper",
        "6 tablespoons duck fat or unsalted butter",
        "1/2 cup fresh flat-leaf parsley leaves",
        "Special equipment: An 8\"-diameter cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Potato",
        "Side",
        "Bake",
        "Sauté",
        "Christmas",
        "Easter",
        "Thanksgiving",
        "Kid-Friendly",
        "Quick & Easy",
        "Mother's Day",
        "Root Vegetable",
        "Christmas Eve",
        "Parsley",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Crispy Potato Cake with Garlic and Parsley",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-potato-cake-with-garlic-and-parsley-51193880"
}
