{
    "directions": [
        "In a kettle of salted boiling water cook the noodles until they are al dente, drain them well, and in a bowl toss them with the oils. Spread the noodles evenly in an oiled 13- by 9-inch metal baking pan, smoothing the top, and let them cool, uncovered.",
        "In a small bowl pinch the gingerroot in the Scotch, stir in the cornstarch, the shrimp, and a pinch of salt, and let the shrimp marinate for 20 minutes. Discard the gingerroot.",
        "Drain the mushrooms, reserving the soaking liquid, discard the stems, and quarter the caps. Let the soaking liquid settle, pour 1 cup of it into a bowl, discarding the remaining liquid, and stir in the cornstarch, the broth, the soy sauce, the Scotch, the sugar, and the sesame oil.",
        "Preheat the broiler. Brush the top of the noodle cake lightly with 1 tablespoon of the vegetable oil and broil it under the broiler as close to the heat as possible for 5 to 7 minutes, or until it is crisp. Invert the noodle cake onto an oiled baking sheet, brush it lightly with 1 tablespoon of the remaining vegetable oil, and broil it for 5 to 7 minutes more, or until it is crisp. Keep the noodle cake warm in a 250°F. oven.",
        "In a wok heat 4 tablespoons of the remaining vegetable oil over high heat until it just begins to smoke and in it stir-fry the shrimp mixture for 1 to 2 minutes, or until the shrimp are just cooked through. Transfer the shrimp with a slotted spoon to a sieve set over a bowl to drain and discard the oil in the wok.",
        "In the wok heat the remaining 2 tablespoons vegetable oil over high heat until it is hot but not smoking and in it stir-fry the scallion and the minced gingerroot for 15 seconds. Add the mushrooms and stir-fry the mixture for 30 seconds. Stir the broth mixture, add it to the wok, and simmer the mixture, stirring, for 1 minute. Add the shrimp and the snow peas and simmer the mixture, stirring, for 1 minute, or until the shrimp are heated through. Slide the noodle cake onto a platter, cut it into 6 servings, and pour the shrimp mixture over it."
    ],
    "ingredients": [
        "3/4 pound fresh or dried thin Asian egg noodles* or capellini",
        "1 tablespoon vegetable oil",
        "2 teaspoons Asian (toasted) sesame oil",
        "two 1/8-inch-thick slices of fresh gingerroot, flattened with the flat side of a heavy knife",
        "1 1/2 tablespoons Scotch",
        "2 teaspoons cornstarch",
        "1 pound medium shrimp (about 25), peeled, deveined, rinsed, and squeezed dry gently in a kitchen towel",
        "10 dried Chinese black mushrooms* or dried shiitake mushrooms*, soaked in 1 1/2 cups hot water for 20 minutes",
        "2 1/2 tablespoons cornstarch",
        "1 cup chicken broth",
        "3 tablespoons soy sauce",
        "2 tablespoons Scotch",
        "1 teaspoon sugar",
        "1 teaspoon Asian (toasted) sesame oil",
        "8 tablespoons vegetable oil",
        "3 tablespoons minced scallion",
        "1 1/2 tablespoons minced peeled fresh gingerroot",
        "1/2 pound snow peas, each trimmed and cut diagonally into 3 pieces",
        "*available at some Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Ginger",
        "Pasta",
        "Shellfish",
        "Stir-Fry",
        "Shrimp",
        "Fall",
        "Sesame",
        "Gourmet"
    ],
    "title": "Crispy Noodle Cake with Shrimp and Snow Peas",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-noodle-cake-with-shrimp-and-snow-peas-12720"
}
