{
    "directions": [
        "1. Line an 8-inch square baking pan with foil or parchment paper and spray with nonstick cooking spray.",
        "2. Preheat oven to 350°F.",
        "3. To prepare the kale: Thoroughly wash the kale under cold water and then remove all of the excess moisture by blotting the leaves between several layers of paper towels or spinning multiple times in a salad spinner. Transfer the kale to a parchment-lined baking sheet. Drizzle the leaves with the oil, tossing to coat the leaves.",
        "4. Bake the kale in the preheated oven for 12-17 minutes until the leaves appear paper-thin and crisp, but not browned (watch closely). Using the parchment liner, transfer the kale to a rack and cool completely, about 10 minutes.",
        "5. Meanwhile, spread the oats, pepitas, and sesame seeds on a large rimmed baking sheet. Bake in the preheated oven for 5 to 8 minutes, shaking halfway through, until golden and fragrant. Transfer to a large bowl; stir in cereal and berries. Crumble the cooled kale leaves into the bowl; gently stir to combine.",
        "6. Combine the nut or seed butter, sugar, syrup, and salt in a small saucepan. Heat over medium-low, stirring, for 4 to 5 minutes until the sugar is dissolved and the mixture is bubbly. Remove from heat and stir in the almond extract.",
        "7. Immediately pour the syrup mixture over the oats mixture, mixing with a spatula until coated.",
        "8. Transfer the mixture to the prepared pan. Place a large piece of parchment paper, wax paper, or plastic wrap (coated with nonstick cooking spray) atop the bar mixture and use it to spread, flatten, and very firmly compact the mixture evenly in the pan. Refrigerate at least 1 hour until firmly set.",
        "9. Using the liner, lift the mixture from the pan and transfer to a cutting board. Cut into 10 bars."
    ],
    "ingredients": [
        "1 large bunch kale, tough stems and center ribs removed, torn into bite-sized pieces",
        "1 tablespoon vegetable oil",
        "1 cup quick-cooking rolled oats",
        "1/3 cup pepitas (green pumpkin seeds) or sunflower seeds",
        "3 tablespoons sesame seeds",
        "1 cup unsweetened whole-grain puffed cereal (e.g., puffed wheat, quinoa, or rice)",
        "1/3 cup goji berries, dried cherries, or dried cranberries, coarsely chopped",
        "1/3 cup natural, unsweetened nut or seed butter (e.g., almond, cashew, or sunflower)",
        "1/4 cup natural cane sugar or packed organic light brown sugar",
        "1/4 cup DIY Glucose Syrup, organic light corn syrup, or brown rice syrup",
        "1/4 teaspoon fine sea salt",
        "1/4 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Low Fat",
        "Kid-Friendly",
        "Low Cal",
        "Oat",
        "Kale",
        "Healthy",
        "Seed"
    ],
    "title": "Crispy Kale Bars",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-kale-bars-51200010"
}
