{
    "directions": [
        "Line a shallow baking pan with wax paper and put pan in freezer 5 minutes. With a 1-ounce ice cream scoop (1 1/2 inches in diameter) scoop out 12 ice-cream balls and transfer to pan. Freeze balls, covered, until very hard, at least 3 hours and up to 8.",
        "Preheat oven to 350° F.",
        "While ice cream is hardening, in a baking pan toast nuts in one layer in middle of oven until golden, about 10 minutes, and cool. Finely chop nuts and transfer to a shallow bowl.",
        "Roll balls in nuts, pressing lightly, until well coated. Freeze balls, covered, until very hard, at least 1 hours and up to 8.",
        "In a bowl lightly beat eggs and in another bowl crumble cornflakes. Dip balls in egg, letting excess drip off, and roll in cornflakes to coat. Freeze balls, covered, at least 1 hours and up to 8. Reserve remaining egg and corn flakes, chilling egg.",
        "Repeat dipping and coating procedure with reserved egg and cornflakes. Freeze balls, covered, until very hard, at least 3 hours and up to 8.",
        "In a 3-quart heavy kettle heat 2 inches oil over moderate heat until a deep-fat thermometer registers 375° F. Working in batches of 2 or 3, fry balls, turning them, about 20 seconds, or until golden and crisp. With a slotted spoon transfer balls to paper towels to drain. Make sure oil returns to 375° F between batches.",
        "Dust ice-cream balls with confectioners' sugar and serve immediately with sauce."
    ],
    "ingredients": [
        "1 quart super-premium vanilla ice cream such as Häagen-Dazs",
        "1 1/2 cups macadamia nuts (about 7 ounces)",
        "3 large eggs",
        "6 cups cornflakes (about 7 ounces)",
        "about 5 cups vegetable oil for deep-frying",
        "confectioners' sugar for dusting",
        "Accompaniment:chocolate macadamia nut sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Fry",
        "Frozen Dessert",
        "Macadamia Nut",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Crispy Macadamia Nut Fried Ice-Cream Balls with Chocolate Macadamia Nut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-macadamia-nut-fried-ice-cream-balls-with-chocolate-macadamia-nut-sauce-14922"
}
