{
    "directions": [
        "Fill a large bowl with 6 cups cold water and squeeze juice from 1 lemon into bowl.",
        "Cut stems of artichokes flush with base. Bend back outer leaves of 1 artichoke until they snap off close to base, then discard several more layers of leaves in same manner until exposed leaves are pale green at top and yellow at base. Cut off pale-green top of artichoke. Carefully spread leaves and scrape out purple leaves and hairy choke with a melon baller or spoon. Trim fibrous parts from base and rub artichoke all over with a lemon half. Place in bowl of lemon water, then repeat trimming process with remaining artichokes.",
        "Drain artichokes well, stem ends up. Heat oil in a deep 2-quart saucepan over moderate heat until a deep-fat thermometer registers about 200°F, then submerge artichokes with tongs, stem ends down, in oil. Simmer until artichokes are tender, about 10 minutes. Transfer to paper towels to drain.",
        "Reheat oil over moderate heat until deep-fat thermometer registers 365°F. Spear 1 artichoke, through center of stem end, with a long kitchen fork and immerse (still on fork) into oil. Fry until leaves are open, browned, and crisp, 30 to 40 seconds. Drain well, stem end up, on paper towels and repeat frying process with remaining artichokes. Make sure oil returns to 365°F for each artichoke.",
        "Whisk together lemon juice, anchovy paste, and oil until blended. Stir in shallot, capers, and parsley and season with salt and pepper.",
        "Serve artichokes hot, warm, or at room temperature with sauce."
    ],
    "ingredients": [
        "2 lemons, halved",
        "6 (4-oz) small (not baby) artichokes",
        "4 cups olive oil",
        "1 tablespoon fresh lemon juice",
        "1/8 teaspoon anchovy paste",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon chopped shallot",
        "1 tablespoon capers, drained and chopped",
        "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Side",
        "Fry",
        "Jerusalem Artichoke",
        "Spring",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Crispy Artichoke Flowers with Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-artichoke-flowers-with-salsa-verde-103361"
}
