{
    "directions": [
        "In a small bowl combine well the spinach, the mayonnaise, the pickle, the capers, the mustard, the lemon juice, and salt and black pepper to taste and chill the tartar sauce, covered.",
        "In a large saucepan of boiling water blanch the clams for 2 minutes, drain them in a colander, and rinse them under cold water. Remove the clams from the shells, peeling off and discarding the dark membranes, rinse them briefly under cold water, and drain them well. In three separate shallow dishes have ready the flour, the eggs beaten with the salt and cayenne, and the cornmeal. Dredge the clams, 1 at a time, in the flour, shaking off the excess. Dip them in the egg mixture, letting the excess drip off, and dredge them in the cornmeal, transferring them as they are coated to a sheet of wax paper. In a kettle heat 1 inch of the oil to 375°F. on a deep-fat thermometer, in it fry the clams in 2 batches for 1 minute, or until they are crisp, and transfer them with a slotted spoon to paper towels to drain. Cut 1/4 off one end of each pita, open the pita to form a pocket, and divide the fried clams among the pita pockets. Spoon some of the tartar sauce into each pocket, spreading it over the clams."
    ],
    "ingredients": [
        "2 1/2 cups shredded well-washed spinach leaves",
        "1/2 cup mayonnaise",
        "2 tablespoons finely chopped sweet pickle",
        "2 tablespoons drained bottled capers",
        "2 teaspoons Dijon-style mustard",
        "2 teaspoons fresh lemon juice, or to taste",
        "24 soft-shelled steamer clams, scrubbed",
        "all-purpose flour for dredging the clams",
        "2 large eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon cayenne",
        "cornmeal for dredging the clams",
        "vegetable oil for deep-frying",
        "four 6-inch pita loaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Fry",
        "Lunch",
        "Mayonnaise",
        "Lemon",
        "Clam",
        "Spinach",
        "Chill",
        "Gourmet"
    ],
    "title": "Crisp-Fried Clams with Spinach Tartar Sauce in Pita Pockets",
    "url": "http://www.epicurious.com/recipes/food/views/crisp-fried-clams-with-spinach-tartar-sauce-in-pita-pockets-10475"
}
