{
    "directions": [
        "Toss fish pieces with 2 tablespoons cornstarch in medium bowl to coat. Mix flour, 3 tablespoons oil, baking powder and 1/2 teaspoon salt in small bowl. gradually add water, whisking until batter is smooth. Pour batter over fish and stir to coat. Let stand 15 minutes.",
        "Whisk remaining 1 tablespoon cornstarch, pineapple juice, sugar, vinegar, hot pepper sauce and 1/8 teaspoon salt in small bowl to blend. Heat remaining 1 tablespoon oil in heavy medium skillet over medium-high heat. Add ginger and lemon peel and stir-fry until fragrant, about 30 seconds. Add bell pepper and stir-fry just to heat through, about 30 seconds. Add pineapple juice mixture and cook until sauce is thick and clear, stirring constantly, about 1 minute.",
        "Heat 4 cups oil in wok or deep medium saucepan to 375°F. Add batter-coated fish pieces to oil in batches and fry until crisp and golden, about 4 minutes. Using slotted spoon, transfer fish to paper towel-lined dish and drain. Reheat oil if necessary between batches.",
        "Arrange fish on platter. Reheat sauce briefly, spoon over fish and serve."
    ],
    "ingredients": [
        "1 pound sea bass fillets, cut into 3/4-inch-wide slices",
        "3 tablespoons cornstarch",
        "1 cup all purpose flour",
        "4 tablespoons vegetable oil",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup water",
        "1 cup pineapple juice",
        "6 tablespoons sugar",
        "1/4 cup red wine vinegar",
        "1/4 teaspoon hot pepper sauce (such as Tabasco)",
        "1/8 teaspoon salt",
        "1 teaspoon grated peeled fresh ginger",
        "1 teaspoon grated lemon peel",
        "1 red bell pepper, cut into matchstick-size strips",
        "4 cups vegetable oil (for deep frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Fry"
    ],
    "title": "Crispy Fish with Sweet-and-Sour Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-fish-with-sweet-and-sour-sauce-1608"
}
