{
    "directions": [
        "Make the dip by combining the buttermilk ranch dressing, cucumber, milk, horseradish, wasabi, salt, and cayenne pepper into a blender. Blend on low until well mixed. Pour into a small bowl and refrigerate. The dip will thicken as it chills.",
        "Place the broth in a saucepan over medium-high heat. Add the beans, cover, and bring to a boil; reduce heat to medium and simmer until beans are bright green and tender, about 8 minutes. Immediately drain beans into a colander and rinse under cold water. Set aside to cool.",
        "Combine the beaten egg with milk in a shallow bowl. Place the flour in another shallow bowl. In a third shallow bowl, combine the bread crumbs, salt, black pepper, garlic powder, and onion powder. Working with a handful of beans at a time, dip each bean first into flour, then into the egg mixture, and then into the bread crumb mixture. Place beans on a plate until all are coated.",
        "Heat 1 1/2 inches of oil in a deep skillet (or use a deep fat fryer) over medium-high heat to 350 degrees F (175 degrees C). Fry the beans several at a time, without crowding, until golden brown. Drain on paper towels and cool. Serve with horseradish-wasabi dip."
    ],
    "ingredients": [
        "1/2 cup buttermilk ranch dressing",
        "1/4 cup peeled, seeded, and finely chopped cucumber",
        "1 tablespoon milk",
        "1 1/2 teaspoons prepared horseradish",
        "1 teaspoon wasabi powder (optional)",
        "1/8 teaspoon salt",
        "1 pinch cayenne pepper",
        "4 cups vegetable broth",
        "1/2 pound fresh green beans, trimmed",
        "1 egg, lightly beaten",
        "1 cup milk",
        "1 cup all-purpose flour",
        "1 cup dry bread crumbs",
        "3/4 tablespoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Green Beans with Horseradish-Wasabi Dip",
    "url": "http://allrecipes.com/recipe/142644/crispy-green-beans-with-horseradish-w/"
}
