{
    "directions": [
        "Sauté bacon in heavy large skillet over medium heat until brown and crisp. Using slotted spoon, transfer bacon to paper towels to drain. Add cauliflower to drippings in skillet and sauté until crisp-tender and beginning to brown, about 5 minutes. Add tomatoes, lemon juice, capers, and thyme; simmer 1 minute to blend flavors. Remove from heat.",
        "Whisk rice flour, Cream of Wheat, and herbs in large shallow bowl to blend. Sprinkle fish with salt and pepper. Coat fish on both sides with flour mixture. Heat oil in another heavy large skillet over medium-high heat. Add fish. Sauté until brown and just opaque in center, about 3 minutes per side.",
        "Rewarm cauliflower mixture over medium heat. Mix in bacon and croutons. Season to taste with salt and pepper. Spoon cauliflower mixture into center of 2 plates; top with fish.",
        "*Available at some supermarkets, specialty foods stores, and natural foods stores."
    ],
    "ingredients": [
        "4 slices thick-cut bacon, cut into 1-inch pieces",
        "2 cups small (3/4-inch) cauliflower florets",
        "10 cherry tomatoes, halved",
        "1 1/2 tablespoons fresh lemon juice",
        "1 tablespoon drained capers",
        "1/4 teaspoon chopped fresh thyme",
        "1/4 cup rice flour*",
        "1/4 cup Cream of Wheat",
        "1/4 teaspoon chopped fresh tarragon",
        "1/4 teaspoon chopped fresh thyme",
        "2 7-ounce pieces boned skate wing (or Dover sole fillets)",
        "1/4 cup canola oil",
        "2 tablespoons coarsely chopped purchased plain croutons"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Fish",
        "Pork",
        "Vegetable",
        "Sauté",
        "Lemon",
        "Bacon",
        "Cauliflower",
        "Fall",
        "Tarragon",
        "Thyme",
        "Capers"
    ],
    "title": "Crispy Skate with Cauliflower, Bacon, Capers, and Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-skate-with-cauliflower-bacon-capers-and-croutons-233702"
}
