{
    "directions": [
        "Whisk almond flour and sugar in medium bowl. Whisk egg, vanilla, and salt in another medium bowl. Whisk half of almond mixture into egg mixture. Whisk in whipping cream, then remaining almond mixture. Press plastic wrap directly onto surface of almond cream, then cover with foil and chill at least 4 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Position rack in center of oven and preheat to 350°F. Line rimmed baking sheet with parchment paper or silicone baking mat. Place stack of phyllo sheets on work surface and cover with plastic wrap, then damp kitchen towel to prevent drying. Transfer 1 phyllo sheet to prepared baking sheet (keep remaining phyllo covered). Brush phyllo sheet lightly with some of melted butter, then sprinkle evenly with scant 1 teaspoon sugar. Top with second phyllo sheet; brush with melted butter and sprinkle with scant 1 teaspoon sugar. Repeat with remaining 6 phyllo sheets, melted butter, and sugar.",
        "Spoon almond cream in dollops atop phyllo, then carefully spread evenly over, leaving 1/2-inch plain border on all sides. Using palm of hand, fan out 7 apple slices, side by side and slightly overlapping, on work surface. Using spatula, transfer fanned-out apple slices to corner of 1 short side of phyllo. Repeat fanning out 7 apple slices at a time, arranging in 2 to 3 lengthwise rows atop almond cream, spacing close together.",
        "Bake tart until apples are tender, almond cream is set, and crust is golden and crisp, about 40 minutes. Transfer baking sheet with tart to rack. Carefully run metal spatula under tart to loosen from sheet.",
        "Combine preserves and 3 tablespoons water in heavy small saucepan. Bring to simmer over medium heat, stirring to loosen. Brush preserves over apples and tart crust. Using 2 large metal spatulas, transfer tart to platter and serve warm or at room temperature.",
        "Sometimes labeled \"ground almonds\"; available at specialty foods stores and natural foods stores."
    ],
    "ingredients": [
        "1 1/4 cups almond flour or almond meal*",
        "1/4 cup sugar",
        "1 large egg",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "1/4 cup plus 1 tablespoon heavy whipping cream",
        "8 sheets fresh phyllo pastry or frozen, thawed (each about 14x9 inches)",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "2 1/2 tablespoons (about) sugar",
        "3 medium Braeburn or Gala apples (about 20 ounces total), peeled, halved, cored, each half cut into 1/8-inch-thick slices",
        "1/2 cup apricot preserves",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "High Fiber",
        "Apple",
        "Almond",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Crispy Braeburn Apple and Almond Sheet Tart",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-braeburn-apple-and-almond-sheet-tart-355206"
}
