{
    "directions": [
        "Melt chocolates with cream, liqueur, and espresso powder in a metal bowl set over a saucepan of barely simmering water or in top of a double boiler, whisking occasionally, until smooth, 6 to 8 minutes. Remove from heat and let stand at room temperature until thickened, about 2 hours.",
        "Line a 13- by 9-inch baking pan with a long sheet of foil, leaving a 1-inch overhang on each end.",
        "Melt marshmallows and butter with sugar, cocoa powder, and salt in a 2 1/2- to 3-quart heavy saucepan over low heat, stirring frequently, until smooth, 3 to 5 minutes.",
        "Remove from heat and gently stir in puffed-rice cereal. Transfer to lined baking pan, pressing mixture evenly onto bottom with dampened fingertips. Cool to room temperature, about 20 minutes, then carefully lift from pan by grasping both ends of foil. Peel off and discard foil, then cut into 1-inch squares.",
        "Spread some of ganache on half of squares, using about 1/2 teaspoon ganache each, then top with remaining squares. Reheat remaining ganache in metal bowl over barely simmering water, whisking occasionally, until loosened, then drizzle over tops of squares.",
        "Let squares stand until set, about 15 minutes."
    ],
    "ingredients": [
        "5 ounces fine-quality bittersweet chocolate (no more than 60% cacao if marked), chopped",
        "3 ounces fine-quality bittersweet chocolate (70% cacao), chopped",
        "3/4 cup heavy cream",
        "2 tablespoons Tia Maria, Kahlúa, or other coffee–flavored liqueur",
        "1 tablespoon instant-espresso powder or instant-coffee granules",
        "1/4 pound marshmallows (15 individual large marshmallows or 2 cups small)",
        "2 tablespoons unsalted butter",
        "2 tablespoons sugar",
        "2 tablespoons unsweetened cocoa powder",
        "3/4 teaspoon salt",
        "3 cups puffed-rice cereal such as Rice Krispies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Liqueur",
        "Chocolate",
        "Dessert",
        "Christmas",
        "Cocktail Party",
        "Super Bowl",
        "Kahlúa",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crisp Chocolate Marshmallow Squares",
    "url": "http://www.epicurious.com/recipes/food/views/crisp-chocolate-marshmallow-squares-236697"
}
