{
    "directions": [
        "Preheat to 425°F. Prick potatoes all over with a fork and place directly on oven rack; roast until flesh is very soft when squeezed gently and skin is crisp, 60–75 minutes. Immediately slice open lengthwise and scoop out flesh; set skins aside. Pass potato flesh through ricer onto a clean work surface. Let cool.",
        "Meanwhile, bring clams, reserved potato skins, and 1 cup water to a boil in a large pot. Cover and cook, shaking pot occasionally, until clams open, 5–8 minutes; discard any clams that do not open. Pluck clams from shells and place in a medium bowl. Cover and chill until ready to use. Pour clam cooking liquid through a fine-mesh sieve into a small bowl. Cover and chill until ready to use.",
        "Dust riced potatoes with 3/4 cup flour and sprinkle with 2 tsp. or 1 1/2 tsp. salt. Drizzle egg over, then use a fork or your fingers to gently mix ingredients until just incorporated and a smooth dough forms (be careful not to overwork or cooked gnocchi will be gluey and tough), about 3 minutes. Transfer dough to a pastry bag fitted with 1/2\" round tip. (Alternatively, use a large resealable plastic bag and snip off 1 corner.)",
        "Pipe dough onto a lightly floured surface into 24\" lengths about 1/2\" thick. Cut crosswise into 1/2\" pieces and dust lightly with flour. Arrange gnocchi in a single layer on a lightly floured rimmed baking sheet.",
        "Working in 3 batches, cook gnocchi in a large pot of simmering lightly salted water until doubled in size and they float to the top, about 3 minutes (a minute or so more if frozen). Using a slotted spoon, transfer gnocchi to a rimmed baking sheet as they are done cooking. Reserve 1 cup pasta cooking liquid.",
        "Melt a third of the butter in a large nonstick skillet over medium-high. Add one-third of gnocchi to skillet and arrange in a single layer. Cook, undisturbed, until dark brown and crisp underneath, about 5 minutes. Transfer to another rimmed baking sheet. Working in 2 batches, repeat with remaining butter and remaining gnocchi.",
        "Wipe out skillet and heat oil in skillet over medium-high. Add garlic and cook, stirring occasionally, until golden, about 2 minutes. Add clam cooking liquid and 1/2 cup pasta cooking liquid and bring to a simmer; cook, stirring occasionally, until sauce is slightly thickened, about 5 minutes.",
        "Add clams, gnocchi, and lemon juice to sauce; season with salt and pepper. Cook, gently tossing and adding more pasta cooking liquid as needed, until sauce coats gnocchi.",
        "Divide gnocchi among bowls and top with chives.",
        "Gnocchi can be formed 1 month ahead. Freeze on baking sheet until solid; transfer to resealable plastic bags. Clams can be cooked 6 hours ahead. Cover and chill clams and cooking liquid separately."
    ],
    "ingredients": [
        "2 1/2 pounds russet potatoes (about 4 large), scrubbed",
        "2 pounds littleneck clams, scrubbed",
        "3/4 cup all-purpose flour, plus more for dusting",
        "2 teaspoons Diamond Crystal or 1 1/2 teaspoons Morton kosher salt, plus more",
        "1 large egg, beaten to blend",
        "1/2 cup (1 stick) unsalted butter",
        "2 tablespoons olive oil",
        "4 garlic cloves, thinly sliced",
        "2 teaspoons fresh lemon juice",
        "Freshly ground black pepper",
        "2 tablespoons finely chopped chives",
        "A potato ricer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Potato",
        "Clam",
        "Seafood",
        "Shellfish",
        "Dinner"
    ],
    "title": "Crispy Gnocchi With Littleneck Clams",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-gnocchi-with-littleneck-clams"
}
