{
    "directions": [
        "Place pork between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound pork with the smooth side of a meat mallet to a thickness of 1/2 inch.",
        "Place pork pieces on a plate and season both sides generously with salt and black pepper. Sprinkle 2 tablespoons of flour over pork pieces, lightly coating both sides. Pour eggs over pork, turning to coat.",
        "Transfer pork pieces to a bowl filled with panko bread crumbs. Press bread crumbs firmly into the meat on both sides. Transfer breaded cutlets to a clean plate, cover with plastic and refrigerate for 15 minutes.",
        "Melt butter in a skillet over medium heat. Stir in pickles, jalapeno pepper, and green onions; cook and stir until onions have softened, about 3 minutes.",
        "Sprinkle in 1 1/2 tablespoon flour. Cook and stir for 3 minutes.",
        "Slowly stir in 2 to 3 tablespoons cold milk, whisking constantly. Stir in remaining milk, Worcestershire sauce, and black pepper. Simmer on low for 5 minutes. Taste and adjust seasoning.",
        "Heat half the vegetable oil in a large skillet over medium-high heat. Add 4 breaded pork cutlets and cook until pork is not longer pink inside, and the crust is well-browned, 4 to 5 minutes per side. Transfer to plate lined with paper towels. Sprinkle with salt. Repeat with remaining vegetable oil and pork cutlets."
    ],
    "ingredients": [
        "2 (1 1/4 pound) fully trimmed pork tenderloins, cut into 8 pieces",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons all-purpose flour, or as needed",
        "2 eggs, beaten",
        "3 cups panko bread crumbs",
        "2 tablespoons butter",
        "1/3 cup diced dill pickles",
        "1 jalapeno pepper, seeded and minced",
        "1 bunch green onions, chopped, green tops reserved",
        "1 pinch cayenne pepper, or to taste",
        "1 1/2 tablespoons all-purpose flour",
        "1 1/2 cups cold milk, or more as needed",
        "1 teaspoon Worcestershire sauce, or to taste",
        "1/4 teaspoon freshly ground black pepper, or more to taste",
        "1/2 cup vegetable oil for frying",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crispy Pork Cutlets",
    "url": "http://allrecipes.com/recipe/228045/crispy-pork-cutlets/"
}
