{
    "directions": [
        "Blend Almond Aioli, lemon juice, and garlic in a blender to combine; season with salt and pepper.",
        "Cook rice in a large saucepan of boiling salted water, stirring often to separate grains and prevent sticking, 6 minutes. Drain well and spread out on a rimmed baking sheet to cool. Transfer cooled rice to a medium bowl.",
        "Whisk egg, egg yolk, 1/2 cup tarator sauce, and 1 Tbsp. lemon juice in a small bowl to combine and add to rice. Season with salt and pepper and stir to combine; set aside.",
        "Heat 1 Tbsp. vegetable oil and 1 Tbsp. butter in a large skillet, preferably nonstick, over medium. Just as butter starts to brown, drop four 1/4-cupfuls of rice mixture into skillet and gently press down with a spatula to make 1/2\"-thick cakes. Cook cakes until edges and bottoms are golden brown and crisp, 5–7 minutes. Transfer to a wire rack (they’re only cooked on one side). Wipe out skillet and repeat process with remaining vegetable oil, butter, and rice mixture to make 4 more cakes.",
        "Toss herbs with olive oil and remaining 1 tsp. lemon juice in a clean small bowl; season with salt and pepper.",
        "Divide 1/2 cup tarator sauce among plates and top each with 2 cakes. Squeeze lemon wedges over and season with more salt. Top with herbs."
    ],
    "ingredients": [
        "Almond Aioli",
        "2 tablespoons fresh lemon juice",
        "1 garlic clove, finely grated",
        "Kosher salt, freshly ground pepper",
        "1 cup long-grain white rice (such as jasmine or basmati), rinsed",
        "Kosher salt",
        "1 large egg",
        "1 large egg yolk",
        "1 tablespoon plus 1 teaspoon fresh lemon juice",
        "Freshly ground black pepper",
        "2 tablespoons vegetable oil",
        "2 tablespoons unsalted butter",
        "1 cup mixed tender herbs (such as parsley, cilantro, and/or mint)",
        "1 teaspoon olive oil",
        "Lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetarian",
        "Garlic",
        "Almond",
        "Herb",
        "snack",
        "Dinner",
        "Wheat/Gluten-Free"
    ],
    "title": "Crispy Rice Cakes With Tarator Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-rice-cakes-with-tarator-sauce"
}
