{
    "directions": [
        "In medium bowl, whisk together crème frîache, honey, cumin, coriander, salt, and pepper. Sauce can be made up to four hours in advance, covered, and refrigerated until ready to use.",
        "Preheat oven to 300°F.",
        "Pat ribs dry and sprinkle with salt and pepper. In heavy large sauté pan over moderately high heat, heat olive oil until hot but not smoking. Working in batches, sear ribs until golden brown, 4 1/2 to 5 minutes per side. Transfer ribs as done to platter; do not wash pan.",
        "In same pan, combine onions, carrots, celery, garlic, and rosemary. Sauté, stirring often, until soft, about 15 minutes. Add red wine and bring to boil. Lower heat to moderate and continue simmering until reduced by about 10 percent, about 3 minutes. Add stock and bring to simmer. Return ribs to pan, cover, and braise in oven until desired doneness (125°F for medium-rare, about 1 hour). Transfer ribs to cutting board and let stand 15 minutes. Lower oven to 125°F.",
        "Have ready large bowl ice water. In medium saucepan over high heat, bring salted water to boil. Add peas and boil, uncovered, until tender, 2 to 3 minutes. Drain in colander, then immediately plunge colander into ice water to stop cooking. Drain again. Coarsely chop, transfer to medium bowl, add onion, and toss to combine.",
        "In small bowl, whisk together olive oil, lemon juice, salt, and pepper. Drizzle over pea-onion mixture and toss to combine.",
        "In heavy large sauté pan, heat vegetable oil until hot but not smoking. Cut racks into individual ribs.",
        "In medium bowl, whisk together flour, semolina, and Parmigiano-Reggiano.",
        "Working in batches of 6, dredge ribs in flour mixture and fry until golden and crisp, 2 to 2 1/2 minutes per side. Transfer as done to paper towel-lined plate. Keep warm in oven while frying remaining batches.",
        "Ladle sauce into middle of large platter. Pile ribs on top, then top with salad. Sprinkle with cumin, coriander, and salt and serve immediately."
    ],
    "ingredients": [
        "1 cup crème frîache",
        "1/2 cup honey",
        "1 tablespoon whole cumin seeds, toasted and finely ground using spice or coffee grinder (about 1 teaspoon ground)",
        "1 tablespoon whole coriander seeds, toasted and finely ground using spice or coffee grinder (about 1 teaspoon ground)",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "6 pounds Denver lamb ribs (lamb breast spareribs; 6 small racks)",
        "3 teaspoons kosher salt",
        "3 teaspoons freshly ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "4 onions, coarsely chopped",
        "8 carrots, coarsely chopped",
        "8 stalks celery, coarsely chopped",
        "2 heads garlic, cloves peeled and coarsely chopped (about 1/2 cup total)",
        "4 tablespoons fresh rosemary, coarsely chopped (from 12 sprigs)",
        "4 cups dry red wine",
        "1 quart veal or chicken stock or low-sodium chicken broth",
        "2 cups frozen peas (from one 10-ounce package), unthawed",
        "1 red onion, finely chopped",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons fresh lemon juice",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 cups vegetable oil",
        "1 cup all-purpose flour",
        "1 cup semolina flour (pasta flour)",
        "1/2 cup Parmigiano-Reggiano, finely grated",
        "1 tablespoon whole cumin seeds, toasted and finely ground using spice or coffee grinder (about 1 teaspoon ground)",
        "1 tablespoon whole coriander seeds, toasted and finely ground using spice or coffee grinder (about 1 teaspoon ground)",
        "1/2 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Braise",
        "Fry",
        "Super Bowl",
        "Parmesan",
        "Pea",
        "Red Wine",
        "Winter",
        "Honey",
        "Sour Cream"
    ],
    "title": "Crispy Lamb Spare Ribs with Honey Crème Fraîche and Chopped Pea Salad",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-lamb-spare-ribs-with-honey-creme-fraiche-and-chopped-pea-salad-241226"
}
