{
    "directions": [
        "Set 1 rack on each of 2 rimmed baking sheets. Using small sharp knife, cut all peel and white pith from lemon. Quarter lemon lengthwise, then thinly slice crosswise. Cover and chill lemon slices; discard peel. Mix sage, thyme, 1 teaspoon coarse salt, and 1 teaspoon ground pepper in small bowl.",
        "Trim 2 inches from tapered ends of each tenderloin; reserve for another use. Cut tenderloins crosswise into 3/4-inchthick slices. Using mallet or flat side of meat tenderizer, pound slices between 2 sheets of plastic wrap to 1/4-inch thickness. Sprinkle sage mixture over both sides of pork cutlets. Place flour in shallow bowl and place eggs in another shallow bowl. Mix breadcrumbs and cheese in another shallow bowl. Working with 1 cutlet at a time, dredge in flour, shaking off excess, then dip in egg to coat. Place in breadcrumb mixture and coat both sides, pressing to adhere. Divide between prepared racks. Chill at least 30 minutes and up to 4 hours.",
        "Preheat oven to 250°F. Add enough oil to heavy large skillet to measure depth of 1/4 inch. Heat over medium-high heat. Working in batches, cook pork until browned and cooked through, about 2 minutes per side. Transfer to another baking sheet; place in oven to keep warm.",
        "Divide cutlets among 6 plates. Sprinkle capers and lemon slices over. Mix arugula with 2 tablespoons extra-virgin olive oil and large pinch of coarse salt. Mound arugula mixture over pork and sprinkle with chopped eggs."
    ],
    "ingredients": [
        "1 lemon",
        "1 teaspoon chopped fresh sage",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon coarse kosher salt plus 1 large pinch",
        "1 teaspoon freshly ground black pepper",
        "2 large heritage pork tenderloins (2 1/2 pounds total)",
        "1/2 cup all purpose flour",
        "3 large eggs, beaten to blend",
        "3 cups fresh breadcrumbs made from crustless French bread",
        "3/4 cup freshly grated Parmesan cheese",
        "Olive oil",
        "3 tablespoons drained capers",
        "4 cups (lightly packed) arugula",
        "2 tablespoons extra-virgin olive oil",
        "4 warm or room-temperature large hard-boiled eggs, peeled, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "High Fiber",
        "Parmesan",
        "Lemon",
        "Pork Tenderloin",
        "Arugula",
        "Pan-Fry",
        "Capers"
    ],
    "title": "Crispy Pork Cutlets with Capers, Lemon, Arugula, and Chopped Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/crispy-pork-cutlets-with-capers-lemon-arugula-and-chopped-eggs-241341"
}
