{
    "directions": [
        "Stir yogurt, lemon juice, oil, and honey in a small bowl to combine; season with salt and pepper.",
        "Toss fennel, olives, oil, lemon juice, and honey in a medium bowl to combine; season with salt and pepper.",
        "Whisk cashew milk into chickpea flour in a medium bowl. Let sit until slightly thickened, 12–15 minutes. Whisk in eggs; season with salt and pepper and seasoning mix of choice, if desired.",
        "Meanwhile, heat 1 Tbsp. oil in a medium cast-iron or nonstick skillet over medium. Cook garlic, stirring occasionally, until golden, about 3 minutes. Add ginger and cook, stirring, just until fragrant, about 30 seconds. Add greens by the handful, tossing until wilted before adding more. Cook, tossing occasionally, until crisp-tender, about 5 minutes; season with salt, pepper, and a squeeze of lemon. Transfer to a plate.",
        "Wipe out skillet and heat 1 Tbsp. oil in skillet over medium-high. Cook mushrooms, undisturbed, until deeply browned, about 3 minutes. Turn and cook, tossing occasionally, until other side is deeply browned, about 5 minutes. Season with tamari to taste. Transfer to a plate.",
        "Wipe out skillet and heat remaining 1 Tbsp. oil in reserved skillet over medium-high. Pour in batter and cook, undisturbed, until bottom is deep golden brown, about 3 minutes. Turn and cook until light golden brown (edges will curl slightly), about 3 minutes.",
        "Serve cromlet in skillet or transfer to a plate. Top with wilted greens, mushrooms, yogurt sauce, and fennel and olive salad. Sprinkle with sesame seeds."
    ],
    "ingredients": [
        "1/2 cup plain whole-milk yogurt",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon olive oil",
        "1 teaspoon honey",
        "Kosher salt, freshly ground pepper",
        "1/2 small fennel bulb, very thinly sliced",
        "1/3 cup torn pitted Castelvetrano olives",
        "1 tablespoon olive oil",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon honey",
        "Kosher salt, freshly ground pepper",
        "1/4 cup cashew, almond, or hazelnut milk or water",
        "1/4 cup chickpea flour",
        "2 large eggs",
        "Seasoning mix of choice, optional (see note)",
        "Kosher salt, freshly ground pepper",
        "3 tablespoons olive oil, divided",
        "2 garlic cloves, thinly sliced",
        "1/2 teaspoon grated peeled ginger",
        "1 bunch small hardy greens (such as kale, Swiss chard, or collard), ribs and stems removed, leaves torn",
        "1 lemon wedge",
        "4 ounces maitake or oyster mushrooms, torn into large pieces",
        "1–2 teaspoons tamari soy sauce",
        "Sesame seeds (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chickpea",
        "Egg",
        "Dinner",
        "Healthy",
        "Quick and Healthy",
        "Fennel",
        "Olive",
        "Mushroom",
        "Wheat/Gluten-Free",
        "Vegetarian",
        "Yogurt",
        "Leafy Green",
        "Kale",
        "Collard Greens"
    ],
    "title": "\"Cromlet\" With Wilted Greens and Fennel and Olive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/cromlet-with-wilted-greens-and-fennel-and-olive-salad"
}
