{
    "directions": [
        "Set half of the slices of bread buttered side down, and cover them with the cheese slices, folding them back in toward the middle if they extend past the edges of the bread. Place 3 or 4 slices of the ham in an even layer over the cheese, and place the top slice of bread over the ham, buttered side up.",
        "Grill the sandwiches in a two-sided grill or on a heavy-bottomed pan, using clarified butter and turning once. Place on serving plates.",
        "Crack two eggs into two separate bowls to check that the yolks aren’t broken. In 2 6-inch non-stick skillets, melt half of the butter over medium-high heat, until it starts to bubble. Pour 1 egg into each pan, being careful not to break the yolks. Add a teaspoon of water to each pan, sprinkle the eggs with fleur de sel, and cover the pans with lids. Cook the eggs for about 3 minutes for a soft-cooked egg and 5-6 minutes if you like your eggs firm. Wipe out the skillets, and fry the other 2 eggs in the remaining butter in the same manner. Center a fried egg over each of the grilled sandwiches and sprinkle with pepper."
    ],
    "ingredients": [
        "8 slices white or whole-wheat sourdough bread",
        "8 ounces Gruyère cheese, sliced into 24-32 1/16-inch-thick slices",
        "12 ounces smoked ham, such as Black Forest, sliced into 12-16 1/16-inch-thick slices",
        "4 extra-large eggs",
        "3 tablespoons unsalted butter",
        "Fleur de sel or kosher salt, to taste",
        "Freshly cracked black pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Egg",
        "Brunch",
        "Kid-Friendly",
        "Quick & Easy",
        "Lunch",
        "Ham",
        "Swiss Cheese",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Croque Madame",
    "url": "http://www.epicurious.com/recipes/food/views/croque-madame-107184"
}
