{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "Arrange the baguette slices in a single layer on a baking sheet. Brush the tops lightly with olive oil and season with salt and pepper. Bake until crisp and golden, about 15 minutes. Remove from the oven and let cool. Leave the oven on.",
        "In a large sauté pan over medium heat, warm 2 Tbs. of the olive oil. Add the onion and a large pinch of salt and cook, stirring occasionally, until the onions are caramelized, about 20 minutes. Transfer the onions to a bowl and wipe out the pan.",
        "In the same pan over medium-high heat, warm the remaining 2 Tbs. olive oil. While the oil is heating, generously season the steak on all sides with salt and pepper. Sear the meat on all sides until browned, about 2 minutes per side. Transfer the pan to the oven and continue cooking until an instant-read thermometer inserted into the thickest part of the steak registers 125°F (52°C) for rare, 5 to 7 minutes, or until done to your liking. Cover with aluminum foil and let rest for 10 minutes, then slice very thinly against the grain.",
        "While the steak is resting, in a small bowl stir together the blue cheese and crème fraîche.",
        "To assemble, spread 2 tsp. of the blue cheese mixture on each baguette slice. Top with 1 tsp. caramelized onions and top with a slice of steak. Sprinkle with salt and pepper and garnish with herb leaves. Serves 6 to 8.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1/2 baguette, cut into slices 1/4 inch (6 mm) thick",
        "4 Tbs. (2 fl. oz./60 ml) olive oil, plus more for brushing",
        "Kosher salt and freshly ground pepper",
        "1 yellow onion, thinly sliced",
        "1/2 lb. (250 g) beef tenderloin steak",
        "1/2 cup (2 1/2 oz./75 g) crumbled blue cheese",
        "1/4 cup (2 oz./60 g) crème fraîche",
        "Leaves from fresh herb sprigs, such as thyme or parsley, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Crostini with Beef Tenderloin, Caramelized Onions and Blue Cheese",
    "url": "http://www.williams-sonoma.com/recipe/crostini-with-beef-tenderloin--caramelized-onions-and-blue-chees.html"
}
