{
    "directions": [
        "Preheat oven to 350°F.",
        "In blender, pulse basil, 1/4 cup olive oil, 1 teaspoon salt, and 1/2 teaspoon pepper until smooth. Transfer to small bowl, add shrimp, and toss to combine. Refrigerate, covered, at least 1 hour and up to 24 hours.",
        "Brush ciabatta slices on both sides with oil (about 1/4 cup total) and sprinkle with salt and pepper (about 1/2 teaspoon salt and 1/4 teaspoon pepper total). Arrange in single layer on rimmed baking sheet and bake until golden brown, 15 to 20 minutes.",
        "In heavy medium saucepan over moderately high heat, heat 1/4 cup oil until hot but not smoking. Add garlic and rosemary and sauté until golden, about 2 minutes. Add stock and beans and bring to boil, then reduce heat to moderate and simmer, uncovered, until liquid is reduced by 1/3, about 2 minutes. Transfer to blender and purée until smooth. With motor running, add 2 tablespoons oil and blend until incorporated. Blend in 1/2 teaspoon salt and 1/4 teaspoon pepper. Set purée aside.",
        "In small bowl, whisk together lemon juice, remaining 1/4 cup olive oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper.",
        "Transfer arugula to medium bowl, drizzle with olive oil–lemon juice mixture, and toss to combine.",
        "Spread about 2 tablespoons white bean mixture on each bread slice, then top each with 1/2 cup arugula and 6 shrimp halves. Drizzle 1/4 teaspoon chile-garlic sauce over each slice and serve immediately."
    ],
    "ingredients": [
        "1 cup fresh basil leaves, loosely packed",
        "1 cup plus 2 tablespoons extra-virgin olive oil",
        "2 1/2 teaspoons kosher salt",
        "1 1/4 teaspoons freshly ground black pepper",
        "24 large cooked shrimp, sliced in half lengthwise",
        "8 (1-inch-thick) slices ciabatta (from 1 large loaf)",
        "4 cloves garlic, coarsely chopped",
        "2 teaspoons fresh rosemary, coarsely chopped (from 2 sprigs)",
        "1/2 cup chicken stock or low-sodium chicken broth",
        "1 (15 ounce) can white beans, drained and rinsed",
        "2 tablespoons fresh lemon juice",
        "4 ounces arugula, coarsely chopped (about 4 cups loosely packed)",
        "2 teaspoons chile-garlic sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Bean",
        "Vegetable",
        "Sauté",
        "Super Bowl",
        "Basil",
        "Shrimp",
        "Arugula"
    ],
    "title": "Crostini with White Beans and Basil-Marinated Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/crostini-with-white-beans-and-basil-marinated-shrimp-241225"
}
