{
    "directions": [
        "Heat the broiler and broil the peppers on a baking sheet until black and blistery, turning them to cook evenly. Once they're blackened on all sides, fasten them in a plastic bag so they steam and the skin is loosened. Leave the broiler alight. When the peppers are cool, slip off their charred skins with your fingers. Don’t worry about leaving a few flecks of black — it adds flavor. Cut the peppers in half and then in strips, discarding the cores and seeds.",
        "Heat the oil in a large frying pan and fry the onions with the thyme, salt, and pepper until soft and starting to brown, 5 to 7 minutes. Stir in the garlic and cook until golden. Add the tomatoes and capers and cook, stirring often until the tomatoes are cooked and thickened, 3 to 5 minutes. Add the peppers and continue cooking until tender, 3 to 5 minutes. Taste and adjust the seasoning.",
        "Oil a baking sheet and set it aside. Toast the bread and arrange the pepper mixture on top. Slice the cheese and put the slices on the peppers. Broil the croustades on the baking sheet until the cheese is lightly browned and the edges are melted, 2 to 3 minutes. Serve warm."
    ],
    "ingredients": [
        "4 red peppers",
        "3 to 4 tablespoons olive oil",
        "2 onions, sliced",
        "2 to 3 thyme sprigs",
        "salt and pepper",
        "2 garlic cloves, crushed",
        "2 tomatoes, peeled, seeded, and chopped",
        "2 tablespoons capers, drained",
        "4 thick slices of country bread",
        "6 oz/175 g soft goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pepper",
        "Appetizer",
        "Broil",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Croustades of Red Peppers with Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/croustades-of-red-peppers-with-goat-cheese-105399"
}
