{
    "directions": [
        "Cook onions with 1 1/2 teaspoons salt in 3/4 stick butter in a 12-inch heavy skillet over moderate heat, covered, stirring occasionally, until tender, about 10 minutes. Continue to cook, uncovered, stirring frequently, until onions are pale golden, about 10 minutes more. Add sage, marjoram, and pepper and cook, stirring, 5 minutes. Add vinegar and wine and boil, stirring occasionally, until liquid is evaporated, then remove from heat.",
        "Meanwhile, cook bread crumbs and remaining teaspoon salt in remaining 3/4 stick butter in a 12-inch nonstick skillet over moderately low heat, stirring, until golden and crisp, 15 to 20 minutes.",
        "Reserve 1 cup onion mixture, covered and chilled, for sauce. Transfer remaining mixture to a large bowl and stir in ground pork, celery, and crumbs.",
        "Put 1 oven rack in lower third of oven and another on bottom of oven and preheat oven to 350°F.",
        "Stir together sage, marjoram, salt, and pepper in a small bowl, then rub over outside and bottom of roast. Put roast in a small flameproof roasting pan and mound 2 cups stuffing loosely in center, then add water to pan. Transfer remaining stuffing to a buttered 2-quart baking dish and chill until ready to bake.",
        "Roast pork in lower third of oven, covering stuffing and tips of ribs with a sheet of foil after about 30 minutes and adding more water if pan becomes dry, until thermometer inserted 2 inches into center of meat (do not touch bones) registers 155°F, 2 1/4 to 2 3/4 hours total.",
        "Bake remaining stuffing (next to or under roast, starting 30 minutes before roast is done), covered with foil, 30 minutes. Increase oven temperature to 425°F (after removing roast from oven) and continue to bake stuffing, uncovered, until top is crisp, 15 to 20 minutes more.",
        "Transfer pork to a platter and let stand 30 minutes.",
        "Transfer pan juices from roasting pan to a gravy separator or a glass measure and skim off fat. Straddle roasting pan across 2 burners, then add wine to pan and boil over high heat, stirring and scraping up brown bits, until reduced by about half, about 5 minutes. Add reserved onion mixture, broth, pan juices, and any juices on platter from roast and bring to a simmer. Restir cornstarch mixture and add to pan, whisking, then simmer 2 minutes. Add butter and swirl pan until incorporated. Season with salt and pepper.",
        "Carve pork and serve with stuffing and sauce."
    ],
    "ingredients": [
        "2 lb onions, finely chopped (6 cups)",
        "2 1/2 teaspoons salt",
        "1 1/2 sticks (3/4 cup) unsalted butter",
        "2 tablespoons chopped fresh sage",
        "1 tablespoon chopped fresh marjoram",
        "1 teaspoon black pepper",
        "1 1/2 tablespoons cider vinegar",
        "1/2 cup dry white wine",
        "1 (1-lb) piece fresh Pullman loaf, pain de mie, or country loaf, cut into 1-inch cubes, then pulsed to coarse crumbs in a food processor",
        "3/4 lb ground pork (usually comes with crown roast, see below)",
        "1 cup finely chopped celery",
        "1 teaspoon finely chopped fresh sage",
        "1 teaspoon finely chopped fresh marjoram or thyme",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 (9- to 10-lb) crown roast of pork, rib ends frenched (ground pork reserved for stuffing, above)",
        "1 1/2 cups water",
        "1/2 cup dry white wine",
        "1 1/2 cups reduced-sodium chicken broth",
        "2 teaspoons cornstarch, dissolved in 2 tablespoons water",
        "2 tablespoons cold unsalted butter",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Pork",
        "Roast",
        "Christmas",
        "Winter",
        "Gourmet"
    ],
    "title": "Crown Roast of Pork with Onion and Bread-Crumb Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/crown-roast-of-pork-with-onion-and-bread-crumb-stuffing-233258"
}
