{
    "directions": [
        "Position pork atop 9- to 10-inch-diameter tart pan bottom. Transfer to large rimmed baking sheet. Brush pork with oil. Combine salt, sugar, thyme, sage and pepper in small bowl. Rub spice mixture over pork. Cover with plastic and refrigerate overnight.",
        "Position rack in bottom third of oven and preheat to 450°F. Fill pork cavity with enough stuffing to mound in center. Cover tips of pork bones with foil. Roast pork 20 minutes. Reduce temperature to 325°F. Continue roasting until thermometer inserted into center of pork meat registers 150°F, about 1 hour 50 minutes. Remove foil from bones. Continue roasting until thermometer inserted into center of pork and stuffing registers 155°F, about 15 minutes longer. Carefully transfer roast atop tart pan bottom to platter.",
        "Add 1 cup broth to baking sheet and scrape up browned bits from bottom of baking sheet. Pour juices into 2-cup glass measuring cup; freeze 15 minutes. Spoon fat off top of pan juices. Transfer pan juices to medium saucepan. Add remaining 1/2 cup beef broth and apple cider. Bring to boil. Dissolve cornstarch into applejack in small bowl; whisk into broth mixture. Boil until gravy thickens slightly, about 3 minutes. Season with salt and pepper. Transfer gravy to sauceboat.",
        "Carve roast between bones to separate chops. Serve with stuffing and gravy."
    ],
    "ingredients": [
        "1 8-pound crown roast of pork (12 ribs)",
        "2 tablespoons vegetable oil",
        "1 teaspoon salt",
        "1 teaspoon sugar",
        "1 teaspoon dried thyme",
        "1/2 teaspoon crumbled dried sage",
        "1/2 teaspoon ground black pepper",
        "Apple and Pork Stuffing",
        "1 1/2 cups canned beef broth",
        "1 cup apple cider",
        "4 teaspoons cornstarch",
        "2 tablespoons applejack brandy or brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Marinate",
        "Roast",
        "Christmas",
        "Apple",
        "Brandy",
        "Winter"
    ],
    "title": "Crown Roast of Pork with Apple and Pork Stuffing and Cider Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/crown-roast-of-pork-with-apple-and-pork-stuffing-and-cider-gravy-5764"
}
