{
    "directions": [
        "Preheat the oven to 375 degrees F.;",
        "To french the racks of lamb:",
        "Make a cut on the fat side of the ribs, perpendicular to them, about 2 1/2-inches down from the rib ends. Cut through the fat down to the rib bones. Turn the rack on end, with the bones facing up and push a knife through the flesh between each rib, using the initial cut as a guide for the knife. Cut down the side of each rib to remove the excess fat in between each rib. Using strong kitchen twine, wrap the twine around each rib at the base, nearest the meat and pull to remove all of the remaining fat and sinew from the rib bone. Bend each rack into a semicircle (meat side in and fat side out) and using kitchen twine tie them together at the base and center, in order to hold the racks together. The rib ends should be pushed outward to create the look of a crown. Rub the lamb with the olive oil. Combine the salt, pepper, garlic, thyme and coriander and press all over the lamb. Place the roast in a Bundt pan with the center of the pan coming up through the middle of the roast. Place on the middle rack of the oven and cook for 30 to 35 minutes, until the meat reaches an internal temperature of 130 degrees F. This is approximately 8 to 12 minutes per pound. Remove from the oven, transfer the roast to a rack, cover with aluminum foil and let the meat rest for 20 minutes. While the meat is resting add the sherry vinegar, mustard and rosemary to the juices that accumulated in the Bundt pan while cooking. Stir to combine. Taste and adjust seasoning, as needed. Cut the string away from the roast and place cooked stuffing, rice or barley in the center if desired. Serve the warm sauce with the roast.;"
    ],
    "ingredients": [
        "2 racks lamb, 6 to 8 ribs each, approximately 1 1/2 to 2-pounds each",
        "1 tablespoon olive oil",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "6 cloves garlic, minced",
        "4 teaspoons fresh thyme, chopped",
        "1 1/2 teaspoons ground coriander",
        "1 to 1 1/2 tablespoons sherry vinegar",
        "1/2 to 1 teaspoon Dijon mustard",
        "1/2 to 1 teaspoon chopped fresh rosemary leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Christmas Dinner",
        "Christmas",
        "Holiday",
        "Roast Recipes",
        "Easter",
        "Lamb Recipes",
        "Meat",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Crown Roast of Lamb",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/crown-roast-of-lamb-recipe"
}
