{
    "directions": [
        "In a small bowl combine well the thyme, the salt, pepper to taste, and the oil and rub the mixture all over the pork, patted dry. Arrange the pork on an oiled round of heavy-duty foil slightly larger than the bottom of the pork in the middle of a lightly oiled shallow roasting pan and fill the center of the crown with some of the stuffing, mounding it. Roast the stuffed pork, the stuffing covered with another oiled round of foil, in a preheated 450°F. oven for 20 minutes, reduce the heat to 325°F., and roast the stuffed pork for 2 1/4 hours more, or until a meat thermometer registers 160°F., or for 2 1/2 hours more, or until a meat thermometer registers 170°F., for well-done meat. In a 2-quart shallow baking dish bake the remaining stuffing in the 325°F. oven during the last 30 minutes of the pork'1s roasting time. Transfer the pork to a platter and let it stand for 15 minutes.",
        "While the pork is standing add the wine to the roasting pan, deglaze the pan over moderately high heat, scraping up the brown bits, and strain the mixture through a fine sieve into a small saucepan. Add 1/2 cup water and boil the mixture until it is reduced to about 2/3 cup. Add the cream, boil the mixture, stirring, until it is reduced to about 3/4 cup, and whisk in the mustard and salt and pepper to taste. Discard the foil from the stuffing, arrange the parsley and the tomatoes decoratively around the pork, and serve the pork with the mustard sauce and the remaining stuffing."
    ],
    "ingredients": [
        "2 teaspoons dried thyme",
        "2 teaspoons salt",
        "1 tablespoons vegetable oil",
        "a 12-rib crown roast of fresh pork (about 6 3/4 pounds)",
        "dirty rice stuffing",
        "1/4 cup dry white wine",
        "1/4 cup heavy cream",
        "1/3 cup Creole mustard (available at many specialty foods shops)",
        "flat-leafed parsley sprigs for garnish",
        "cherry tomatoes for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mustard",
        "Pork",
        "Roast",
        "White Wine",
        "Gourmet"
    ],
    "title": "Crown Roast of Pork with Dirty Rice Stuffing and Creole Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crown-roast-of-pork-with-dirty-rice-stuffing-and-creole-mustard-sauce-11777"
}
