{
    "directions": [
        "Preheat oven to 350°F.",
        "Spread bread squares in 1 layer in a shallow baking pan and bake in middle of oven until dry and lightly toasted, about 15 minutes. Leave oven on (for roast) and cool bread.",
        "Cook onion and celery in butter in a 12-inch heavy skillet over moderate heat, stirring occasionally, until softened, 4 to 5 minutes. Stir in apples, sugar, salt, pepper, sage, thyme, nutmeg, and cinnamon. Reduce heat to low, then cook, covered, stirring, until apples are tender, about 15 minutes. Stir in bread squares, parsley, and chives.",
        "Set oven rack in lower third of oven. Sprinkle roast inside and out with salt and pepper and put in a large flameproof roasting pan. Mound stuffing in cavity. Wrap tips of rib bones with foil to prevent burning, then wrap meat below bones with overlapping bacon strips, securing them with wooden toothpicks.",
        "Roast pork in middle of oven, covering stuffing loosely with foil after 30 minutes, until an instant-read thermometer registers 155°F when inserted 2 inches into center of meat (do not touch bones), 2 1/4 to 2 3/4 hours total.",
        "Transfer roast to a carving board and let stand, loosely covered with foil, 15 to 20 minutes. (Temperature of meat will rise to 160°F; meat will be slightly pink.)",
        "Skim fat from pan drippings. Straddle pan across 2 burners and add water, then deglaze pan by boiling over high heat, stirring and scraping up brown bits. Pour through a fine sieve into a saucepan, discarding solids.",
        "Add jelly and any juices accumulated on carving board, then simmer sauce, whisking occasionally and skimming any fat that rises, until jelly is melted, about 4 minutes. Season with salt and pepper.",
        "Remove all foil from roast and carve into chops by cutting between ribs."
    ],
    "ingredients": [
        "6 slices firm white sandwich bread, cut into 1-inch squares",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1/2 cup finely chopped onion",
        "1/2 cup finely chopped celery including some leaves",
        "11/2 lb tart apples such as Granny Smith, peeled and cut into 1/4-inch-thick wedges",
        "1/3 cup sugar",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 teaspoon chopped fresh sage or 1/4 teaspoon dried sage",
        "1 teaspoon chopped fresh thyme or 1/4 teaspoon dried thyme",
        "1/4 teaspoon freshly grated nutmeg",
        "Pinch of cinnamon",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons chopped fresh chives",
        "1 (9- to 11-lb) crown roast of pork, rib ends frenched",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/3 lb sliced bacon",
        "1 1/2 cups water",
        "1/4 cup red-currant or apple jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Roast",
        "Dinner",
        "Apple",
        "Bacon",
        "Celery",
        "Fall",
        "Parsley",
        "Jam or Jelly",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crown Roast of Pork with Apple Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/crown-roast-of-pork-with-apple-stuffing-105600"
}
