{
    "directions": [
        "Blanch chives in a 2-quart pot of boiling salted water 2 seconds, then transfer with tongs to a bowl of ice and cold water to stop cooking. Drain chives in a colander and spread in 1 layer on paper towels.",
        "Stand 5 shrimp together in a tight circle, tails up and touching in center, then tie tails together with 2 or 3 chives (be careful not to break them), wrapping them about 1 inch down from top of tails. Make 5 more \"crowns\" with remaining shrimp and chives. Chill, covered, on a plate.",
        "Cook celery root in 1/2 teaspoon oil in a 6-inch nonstick skillet over moderately low heat, covered, stirring occasionally, until tender but not brown, about 4 minutes, and transfer to a bowl. Cook parsnips, turnips, and squash separately, each in 1/2 teaspoon oil in same manner, transferring to bowl with celery root. Season vegetables with salt and pepper and keep warm, covered.",
        "Whisk together warm water and one fourth of truffle butter in a 5-quart wide heavy pot over moderately low heat until just incorporated. Add remaining butter one third at a time, whisking until all butter is incorporated. Stand shrimp in butter mixture and poach at a bare simmer, covered, until just cooked through, about 10 minutes.",
        "Spoon chestnut purée into centers of 6 plates and top with crowns of shrimp. Pour 1/4 cup truffle sauce around each serving and sprinkle vegetables over plate, letting them fall around shrimp."
    ],
    "ingredients": [
        "1 bunch fresh chives",
        "30 extra-large (16 to 20 per pound) shrimp in shell without heads, peeled, leaving tail and first shell segment intact, and deveined",
        "1/2 cup diced (1/4-inch) peeled celery root",
        "2 teaspoons olive oil",
        "1/2 cup diced (1/4-inch) peeled parsnips",
        "1/2 cup diced (1/4-inch) peeled turnips",
        "1/2 cup diced (1/4-inch) seeded peeled butternut squash",
        "1/2 cup warm water",
        "1/2 pound cold black truffle butter or 2 sticks (1 cup) unsalted butter, cut into pieces",
        "Chestnut purée",
        "1 1/2 cups black truffle sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Shrimp",
        "Root Vegetable",
        "Parsnip",
        "Turnip",
        "Butternut Squash",
        "Fall",
        "Gourmet"
    ],
    "title": "Crown of Shrimp with Truffle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crown-of-shrimp-with-truffle-sauce-107207"
}
