{
    "directions": [
        "Preheat oven to 450°F. Mix 2 tablespoons butter, 1 tablespoon mustard and 1 1/2 teaspoons rosemary in bowl. Season generously with salt and pepper. Place lamb in roasting pan. Rub all over with butter mixture. Roast 15 minutes. Reduce oven temperature to 350°F. and continue roasting until thermometer inserted into lamb registers 140°F. for medium-rare, about 40 minutes. Transfer lamb to platter; let stand 15 minutes.",
        "Pour off fat from roasting pan and set pan aside. Melt 1 tablespoon butter in heavy large skillet over low heat. Add shallots and 1/2 teaspoon rosemary; sauté until shallots are tender, about 5 minutes. Add wine to roasting pan and bring to boil over high heat, scraping up any browned bits. Add wine to skillet. Add stock; boil until slightly thickened, about 6 minutes. Mix in 1/2 teaspoon mustard and mint. Season with salt and pepper.",
        "Spoon vegetables in center of and around roast. Serve, cutting lamb into chops and spooning sauce over.",
        "Place potatoes in vegetable steamer and steam 10 minutes. Add carrots and onions and steam until vegetables are almost tender, about 10 minutes longer. Add asparagus and steam until crisp-tender, about 5 minutes more.",
        "Melt butter in heavy large skillet over medium heat. Add mint and vegetables. Season with salt and pepper and stir until vegetables are coated with butter."
    ],
    "ingredients": [
        "3 tablespoons butter, room temperature",
        "1 tablespoon plus 1/2 teaspoon Dijon mustard",
        "2 teaspoons dried rosemary",
        "1 crown of lamb made from two 8-rib racks (about 4 1/2 pounds total)",
        "1 cup dry white wine",
        "2 large shallots, chopped",
        "1/4 cup chicken stock or canned unsalted broth",
        "3 tablespoons chopped fresh mint",
        "1 1/2 pounds new potatoes, halved",
        "1 baby carrot bunch, stems trimmed to 1 inch, peeled",
        "1 10-ounce basket pearl onions, peeled",
        "1 pound fresh asparagus, trimmed, cut crosswise into thirds",
        "3 tablespoons butter",
        "3 tablespoons chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Mustard",
        "Vegetable",
        "Roast",
        "Mint",
        "Asparagus",
        "Spring"
    ],
    "title": "Crown Roast of Lamb with Shallots, Mustard and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/crown-roast-of-lamb-with-shallots-mustard-and-mint-1818"
}
