{
    "directions": [
        "Whisk oil, lemon juice, and salt in a small bowl to combine; set aside.",
        "Cook pecans and oil in a small skillet over medium heat, stirring often, until nuts are darkened in color, 5–7 minutes. Let cool, then coarsely chop so you have a variety of sizes, with some pieces almost pulverized. Set aside 2 tablespoons nuts for serving.",
        "Whisk almond butter and 1 tablespoon vinaigrette in a medium bowl to combine. Add kale and massage dressing into leaves with your hands until evenly coated; season with salt and pepper.",
        "Toss fennel, zucchini, radishes, cauliflower, tomatoes, watercress, farro, and remaining pecans in a large bowl with remaining vinaigrette; season with salt and pepper. Add kale and toss to combine. Drizzle with oil and serve topped with reserved pecans."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon kosher salt",
        "1/2 cup pecans",
        "1 teaspoon olive oil",
        "2 teaspoons almond butter or natural peanut butter",
        "1/2 bunch Tuscan kale, ribs and stems removed, leaves torn (about 2 cups)",
        "Kosher salt, freshly ground pepper",
        "1/2 small fennel bulb, thinly sliced",
        "1 small zucchini, thinly sliced lengthwise on a mandoline",
        "2 breakfast radishes, thinly sliced lengthwise on a mandoline",
        "1 cup cauliflower florets, grated on the large holes of a box grater",
        "1 cup red and/or yellow grape tomatoes, halved",
        "1 cup trimmed watercress",
        "3/4 cup cooked semi-pearled farro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Side",
        "Low Fat",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Almond",
        "Pecan",
        "Cauliflower",
        "Fennel",
        "Kale",
        "Radish",
        "Zucchini",
        "Spring",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Watercress",
        "Dairy Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Crudités Salad with Farro and Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/crudites-salad-with-farro-and-pecans-56389669"
}
