{
    "directions": [
        "Cut bacon into 1\" pieces, then chop until a fine paste forms (this can also be done in a food processor).",
        "Heat vegetable oil in a medium skillet over medium. Cook bacon, stirring occasionally, until brown and crisp, about 4 minutes. Using a small fine-mesh sieve, transfer bacon to a small bowl.",
        "Working in separate batches and transferring each item to bowl with bacon as it’s done, fry aromatics until brown (about 2 minutes for everything except mushrooms and shallot, which will take about 4 minutes). Let oil cool completely.",
        "Pulse bacon, mushrooms, scallions, shallot, anchovies, chiles, garlic, ginger, cooled vegetable oil, sesame oil, and salt in a food processor until nearly smooth.",
        "Cook haricots verts in a medium pot of boiling salted water until bright green and crisp-tender, about 3 minutes (4 minutes if using green beans). Transfer to a plate and chill to stop cooking while you grill the bread.",
        "Prepare grill for medium-high heat (or heat a grill pan over medium-high). Brush both sides of bread with oil and grill until lightly charred, about 2 minutes per side.",
        "Toss carrots, fennel, and haricots verts with lime zest and lime juice in a large bowl. Transfer to a platter and scatter crushed ice over. Place grilled bread and potatoes on another platter. Serve with XO sauce for dipping.",
        "Sauce can be made 1 month ahead. Cover and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "4 slices bacon",
        "1 cup vegetable oil",
        "6 ounces shiitake mushrooms, stems removed, finely chopped (about 2 1/2 cups)",
        "2 scallions, thinly sliced",
        "1 medium shallot, finely chopped",
        "5 salt-packed anchovies, rinsed, chopped",
        "3 red Thai chiles, seeds removed, finely chopped",
        "3 garlic cloves, finely chopped",
        "1 (1-inch) piece ginger, finely chopped",
        "1/2 teaspoon toasted sesame oil",
        "1/4 teaspoon kosher salt",
        "8 ounces haricots verts or green beans, trimmed",
        "4 (3/4-inch–thick) slices country-style bread",
        "2 tablespoons olive oil",
        "2 small bunches carrots, any color, scrubbed, tops trimmed, halved if large",
        "1 fennel bulb, cut into 1/2-inch wedges",
        "1 teaspoon finely grated lime zest",
        "2 tablespoons fresh lime juice",
        "1 pound cooked fingerling potatoes, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Dip",
        "Bacon",
        "Garlic",
        "Anchovy",
        "Chile Pepper",
        "Sesame Oil",
        "Mushroom",
        "Appetizer",
        "Hors D'Oeuvre",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Crudités With Bacon XO Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crudites-with-bacon-xo-sauce"
}
