{
    "directions": [
        "Preheat oven to 375°F. Spray heavy baking sheet with vegetable oil spray. Heat 1 teaspoon sesame oil in heavy large nonstick wok or skillet over high heat. Add green onions, garlic and ginger; stir-fry 1 minute. Add spinach, mushrooms, zucchini and carrot; stir-fry until vegetables are crisp-tender and spinach wilts, about 3 minutes. Add 4 teaspoons soy sauce and stir to coat vegetables, about 30 seconds. Transfer mixture to colander and drain off liquid. Cool completely.",
        "Place egg roll wrappers on work surface. Spoon filling in 4x2-inch rectangle in center of each wrapper, dividing equally. Fold in short sides, then roll up tightly. Arrange seam side down on prepared sheet. (Can be made 6 hours ahead. Cover with plastic wrap, refrigerate. Remove plastic before continuing.) Bake until wrappers are crisp and filling is heated through, turning once about 10 minutes.",
        "Meanwhile, mix vinegar and remaining 1 Teaspoon sesame oil and 3 tablespoons soy sauce in small bowl.",
        "Transfer rolls to plates. Serve warm with dipping sauce."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 teaspoons oriental sesame oil",
        "3 tablespoons chopped green onions",
        "1 tablespoon finely chopped garlic",
        "1 tablespoon finely chopped peeled fresh ginger",
        "3 cups (packed) coarsely chopped fresh spinach",
        "4 fresh shiitake mushrooms, stemmed, caps thinly sliced",
        "2 small zucchini, cut into matchstick-size strips",
        "1 carrot, cut into matchstick-size strips",
        "4 teaspoons plus 3 tablespoons low-sodium soy sauce",
        "4 6-inch egg roll wrappers",
        "3 tablespoons rice vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Mushroom",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Vinegar",
        "Spinach",
        "Healthy",
        "Vegan",
        "Sesame"
    ],
    "title": "Crunchy Vegetable Rolls with Soy Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/crunchy-vegetable-rolls-with-soy-dipping-sauce-1227"
}
