{
    "directions": [
        "Have your GH (Grown-up Helper) turn the oven on to 375 degrees F.",
        "In a pie pan or other shallow, large dish, pour out the corn flakes. Crush the cereal up with your hands. Mix in bread crumbs, sugar, salt, pepper, and allspice - your SECRET ingredient. Do not tell anybody what your secret ingredient is - ever! If they ask how you make your special chicken toes, tell them about everything EXCEPT the secret.",
        "Drizzle about 3 tablespoons vegetable oil evenly over the breading, tossing and turning it to mix the oil all through the bread crumbs and crushed-up corn flakes. Have the GH pour the oil out slowly. A vegetable oil bottle has a big opening so, 3 tablespoons will pour out pretty quickly, probably by the time you can count to 5, so watch the GH closely and count really loudly!",
        "Have your GH cut the chicken fingers into toes, 2-inch pieces. Turn the chicken in flour, eggs and then in the special crunchy breading. Arrange the chicken toes on a nonstick baking sheet. Make your GH go and wash their hands. Place the chicken toes in the oven and cook 15 minutes or until crisp and brown all over.",
        "Mix together honey mustard and barbecue sauce in a small bowl. Serve hot chicken toes with honey mustard and barbecue sauce for dipping."
    ],
    "ingredients": [
        "1 cup corn flakes",
        "1 cup plain bread crumbs",
        "2 tablespoons brown sugar",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon ground allspice - the SECRET ingredient",
        "3 tablespoons vegetable oil",
        "1 1/2 pounds chicken breast tenders, 2 packages, cut into 2-inch pieces by GH (Grown-up Helpers)",
        "1/3 cup all-purpose flour",
        "2 eggs, beaten",
        "1/4 cup honey mustard (recommended: Gulden's)",
        "1/4 cup barbecue sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Healthy Dinner",
        "Healthy",
        "Healthy Lunch",
        "Baked Chicken",
        "Meat",
        "Corn Recipes",
        "Vegetable",
        "Egg Recipes",
        "Kid-Friendly"
    ],
    "title": "Crunchy, Oven Baked Chicken Toes",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/crunchy-oven-baked-chicken-toes-recipe"
}
