{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Spray an 11x13-inch baking dish and 2 baking sheets with cooking spray.",
        "Place eggplant slices on racks over the sink or paper towels and sprinkle both sides of slices lightly with salt. Let eggplant drain for 30 minutes, rinse, and pat dry with paper towels. Place eggplant slices on prepared baking sheets.",
        "Bake in the preheated oven until eggplant is soft, about 15 minutes.",
        "Pour beaten eggs into a shallow bowl; combine panko bread crumbs with Italian seasoning in a separate shallow bowl. Dip eggplant into beaten egg and press into panko crumbs to coat. Place breaded eggplant back on the baking sheets and spray the slices with cooking spray.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Broil eggplant slices until tops are golden brown, 2 to 3 minutes; remove slices, turn, and spray other sides with cooking spray. Broil until golden brown 2 to 3 more minutes. Remove eggplant and turn oven temperature to 350 degrees F (175 degrees C).",
        "Heat olive oil in a skillet over medium heat and cook and stir onion and garlic until onion is translucent, about 5 minutes. Stir in prepared pasta sauce and remove from heat.",
        "Spread 1/3 of the pasta sauce into bottom of the prepared baking dish. Top with half the eggplant slices, half the Italian cheese blend, and half the Parmesan cheese. Spread another 1/3 of the sauce over the layers; layer the remaining eggplant, remaining pasta sauce, Italian cheese blend, and Parmesan cheese.",
        "Bake casserole in the 350 degree oven until cheese is melted and bubbly, about 30 minutes. Let stand about 10 minutes before serving."
    ],
    "ingredients": [
        "cooking spray",
        "2 eggplants, peeled and sliced crosswise 1/4-inch thick",
        "2 teaspoons salt, or as needed",
        "4 eggs, beaten",
        "1 1/2 cups panko bread crumbs",
        "2 tablespoons dried Italian herb seasoning",
        "2 tablespoons olive oil",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "4 cups prepared pasta sauce",
        "2 cups shredded Italian cheese blend",
        "1/3 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Crunchy Eggplant Parmesan",
    "url": "http://allrecipes.com/recipe/223358/crunchy-eggplant-parmesan/"
}
