{
    "directions": [
        "1. Preheat the oven to 375°F (190°C). Lightly spray two 24-cup mini muffin pans with cooking spray or line with paper liners.",
        "2. Have ready a bowl of ice water. Bring a saucepan of lightly salted water to a boil over high heat. Add the broccoli and blanch until bright green and softened but still crisp, about 30 seconds. Using a slotted spoon, transfer immediately to the ice water to stop the cooking. When cool, drain thoroughly and pat dry. Chop coarsely and set aside.",
        "3. In a bowl, whisk together the whole eggs, egg yolks, milk, cream, salt, and pepper. (If you like, heat a small frying pan over medium-low heat, pour in about 1 tbsp of the mixture, and cook, stirring with a wooden spoon, just until soft curds form and are cooked through. Taste and adjust the seasoning.) Transfer to a large glass measuring pitcher.",
        "4. Place the prepared muffin pans on 1 or 2 rimmed baking sheets to catch any drips. Add a few small pieces of broccoli and a generous pinch of cheese to each of the cups. Pour the egg mixture over the broccoli and cheese in each cup, filling as many as you can to just below the rim. Add a small piece of broccoli and a pinch of cheese to the top of each quiche.",
        "5. Bake until the tops are puffed and just beginning to brown, about 15 minutes. Transfer to wire racks and let cool for about 5 minutes, then turn the quiches out of the pans, arrange on a platter or individual plates, and serve."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1/2 head broccoli, thick stems removed and separated into florets",
        "6 large eggs",
        "6 large egg yolks",
        "2/3 cup (5 fl oz/160 ml) whole milk",
        "2/3 cup (5 fl oz/160 ml) heavy cream",
        "1 tsp kosher salt",
        "1/2 tsp ground black pepper",
        "3/4 cup (3 oz/90 g) shredded sharp Cheddar cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Kid-Friendly",
        "Back to School",
        "Cheddar",
        "Party",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Crustless Mini Quiches",
    "url": "http://www.epicurious.com/recipes/food/views/crustless-mini-quiches-366969"
}
