{
    "directions": [
        "1. Prepare a medium-hot fire in a charcoal grill with a cover, or preheat a gas grill to medium-high.",
        "2. To make the spread, combine the relish and mustards in a small bowl and stir to blend.",
        "Set aside.",
        "3. To make the patties, combine the sirloin, garlic, chile powder, cumin, cilantro, and pepper sauce in a large bowl and season with salt and pepper. Handling the meat as little as possible to avoid compacting it, mix well. Divide the mixture into 4 equal portions and form the portions into patties to fit the buns.",
        "4. When the grill is ready, brush the grill rack with vegetable oil. Place the patties on the rack, cover, and cook, turning once, until done to preference, 5 to 7 minutes on each side for medium. Just before the patties are done, turn a second time and place a ham slice and a cheese slice on top of each patty. During the last few minutes of cooking, place the buns, cut side down, on the outer edges of the rack to toast lightly.",
        "5. To assemble the burgers, spread the pickle spread over the cut sides of the buns. On each bun bottom, place a patty. Add the bun tops and serve."
    ],
    "ingredients": [
        "1 pound freshly ground sirloin",
        "1 teaspoon minced garlic",
        "1 teaspoon chile powder",
        "1 teaspoon ground cumin",
        "2 tablespoons chopped cilantro",
        "5 dashes tabasco Pepper Sauce",
        "Kosher salt",
        "Freshly ground black pepper",
        "Vegetable oil, for brushing on the grill rack",
        "4 slices baked ham",
        "4 thick slices Monterey Jack cheese",
        "4 large sesame seed buns, split and brushed with butter",
        "1/4 cup dill pickle relish",
        "1/4 cup yellow American mustard",
        "1/4 cup spicy brown mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Mustard",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Meat",
        "Ground Beef",
        "Ham",
        "Tailgating",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Monterey Jack",
        "Cumin"
    ],
    "title": "Cuban-Style Burgers with Grilled Ham & Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-style-burgers-with-grilled-ham-cheese-355969"
}
