{
    "directions": [
        "For the pork loin: Preheat the oven to 400 degrees F. Drizzle the oil over the pork and sprinkle liberally with salt and pepper. Transfer the pork to a rack over a heavy-bottomed roasting pan. Roast the pork until a meat thermometer inserted into the thickest part of the loin reads 140 degrees F, about 1 hour. Let the pork rest for 10 minutes, and then reserve 1 1/4 pounds for the sandwich. Slice 1/4-inch thick. Reserve the remaining pork for another recipe. For the mojo spread: Add the mayonnaise, oil, cilantro, salt, garlic and lime juice to a bowl and stir until evenly combined and spreadable. For the sandwich: Heat a large, 12-inch cast-iron skillet over medium heat. Spread the top half of each of the rolls with 2 tablespoons of the mojo spread and 2 teaspoons mustard. Layer the bottom half of the rolls with pork, seasoning it with a pinch of salt. Top with the ham, cheese and pickles. Place the top half of the roll over the bottom half. Brush the skillet with the butter, place 2 sandwiches in the skillet and brush the top half with butter. Place another cast-iron pan on top of the sandwiches with a heavy can to press down. Alternatively, you can use a panini press. Cook until the bread becomes golden brown on one side, and then flip and repeat on the other side, cooking for 2 to 3 minutes per side. Cook the remaining 2 sandwiches."
    ],
    "ingredients": [
        "One 2 1/2-pound boneless pork loin roast",
        "1/4 cup olive oil",
        "Kosher salt and cracked black pepper",
        "3 tablespoons mayonnaise",
        "2 tablespoons olive oil",
        "1 tablespoon cilantro leaves, chopped",
        "1/2 teaspoon kosher salt",
        "3 cloves garlic, minced",
        "Juice of 1 lime",
        "4 Cuban or Portuguese rolls, split lengthwise",
        "3 tablespoons whole-grain mustard",
        "Pinch salt",
        "4 ounces ham, thinly sliced",
        "4 ounces Swiss cheese, sliced",
        "2 large dill pickles, thinly sliced",
        "2 to 3 tablespoons unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cuban Recipes",
        "Sandwich",
        "Cheese",
        "Ham",
        "Meat",
        "Pork",
        "Swiss Cheese Recipes",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Cuban Sandwich",
    "url": "http://www.foodnetwork.com/recipes/cuban-sandwich"
}
