{
    "directions": [
        "Pierce the pork roast all over with a small knife. Place the pork in the bottom of a large slow cooker. In a medium bowl, combine the garlic, orange juice, lime juice, olive oil, oregano, cumin and House Seasoning. Pour the mixture over the pork and rub it into the meat, turning to evenly coat it. Cover the slow cooker and cook on low for 8 to 10 hours, or on high for 4 to 6 hours, until the pork is extremely tender.",
        "Transfer the pork to a cutting board. Remove and discard the fat and use 2 forks to pull the pork into chunks. Use a large spoon to skim the fat from the surface of the liquids in the slow cooker. Return the pulled pork to the slow cooker and stir well. Taste the meat and adjust the seasoning, adding salt and pepper, if desired. Cover the slow cooker and cook on high for 15 to 30 minutes, so that the pork can further absorb the flavors of the cooking liquids while you prepare the sandwich ingredients.",
        "To assemble the sandwich, slice the loaf of bread in half horizontally. Spread a thin layer of mustard on the bottom half of the bread and then layer 1 package of the Swiss cheese, all of the pickle slices, all of the ham slices and a generous amount of pulled pork. Top the pork with the remaining 1 package of Swiss cheese and place the other half of the bread loaf on top of the Swiss cheese.",
        "Use a serrated knife to cut the loaf into approximately 6-inch (15-cm) lengths. Brush both sides of each sandwich with the melted butter and cook the sandwiches in a panini press or a hot skillet until the cheese melts and the exterior gets toasty. If you are cooking the sandwich in a hot skillet, cover the top of the sandwich with aluminum foil and place a heavy pot or cast iron skillet on top of the foil. Flip the sandwich once the bottom is toasted and toast the other side. Cut the sandwich into slices and serve hot."
    ],
    "ingredients": [
        "3 lb (1.6 kg) boneless pork butt roast, trimmed",
        "10 cloves garlic, minced",
        "1/2 cup (120 ml) freshly squeezed orange juice",
        "1/4 cup (60 ml) freshly squeezed lime juice",
        "2 tablespoons (30 ml) extra-virgin olive oil",
        "1 tablespoon (3 g) dried oregano",
        "2 teaspoons (5 g) ground cumin",
        "1/2 tablespoon (18 g) House Seasoning (see Cooks' Note)",
        "Salt and freshly ground black pepper, to taste",
        "1 (2-foot [61-cm] long) Cuban bread loaf, submarine sandwich roll, Italian bread loaf or French bread loaf",
        "Prepared yellow mustard, as needed",
        "2 (8-oz [227-g]) packages sliced Swiss cheese, divided",
        "2 cups (286 g) sliced dill pickles",
        "1 (8-oz [227-g]) package thinly sliced ham",
        "4 tablespoons (60 ml) melted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Sandwich",
        "Florida",
        "Pork",
        "Ham",
        "Swiss Cheese",
        "Pickles"
    ],
    "title": "Slow-Cooker Cuban Pulled-Pork Panini Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-pulled-pork-paninis"
}
