{
    "directions": [
        "Heat 2 tablespoons olive oil in large saucepan or Dutch oven over medium-high heat. Cook and stir pork in hot oil until lightly browned, 5 to 7 minutes.",
        "Pour 1/2 cup white wine into saucepan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.",
        "Stir 2 cups water, 5 cloves garlic, 1 tablespoon tomato paste, 1 beef bouillon cube, bay leaves, cumin, oregano, and black pepper to pork mixture. Bring mixture to a boil, reduce heat to low, partially cover the saucepan with a lid, and simmer until pork is very tender, 1 to 2 hours. Transfer pork to a bowl and reserve cooking liquid.",
        "Heat remaining olive oil in a deep pot over medium-high heat. Cook and stir chorizo and cooked pork in hot oil until lightly browned, 3 to 5 minutes.",
        "Stir onion, green pepper, and remaining minced garlic into chorizo mixture; saute until vegetables soften and onion is translucent, about 5 minutes. Add remaining white wine, olives, 1 tablespoon tomato paste, and remaining bouillon cube; cook, stirring frequently, until flavors combine, about 5 minutes more.",
        "Pulse corn and 1 1/2 cups reserved pork broth together in a blender or food processor until mixture has a thick and chunky consistency. Stir corn mixture into pork-chorizo mixture.",
        "Reduce heat to medium and stir masa harina, sugar, vinegar, and salt into pork mixture; cook, stirring occasionally, until mixture has a hearty cornmeal porridge-consistency. Season with salt and remove from heat.",
        "Make a pocket out of one corn husk and fill 3/4 full with pork mixture, leaving a top flap. Wrap another husk around the filled pocket. Fold top flap over the pocket. Tie twine length- and width-wise around the tamale several times so that packet is secure, but has room for filling to expand during cooking. Repeat with remaining husks and filling.",
        "Fill a pot with 2-inches of water; bring to a simmer. Place tamales upright in simmering water, cover the pot, and cook, adding water as necessary, until filling is hot and set, about 40 minutes. Cool tamales until completely set, at least 3 hours."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "1/4 cup olive oil, divided",
        "1 1/2 pounds boneless country-style pork ribs, cut into small pieces",
        "1 cup dry white wine, divided",
        "2 cups water",
        "10 cloves garlic, minced, divided",
        "2 tablespoons tomato paste, divided",
        "2 cubes beef bouillon (such as Knorr®)",
        "2 bay leaves",
        "1 teaspoon ground cumin",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "2 links Spanish chorizo sausage (such as Goya®), thinly sliced",
        "1 yellow onion, diced",
        "1 small green bell pepper, chopped",
        "1/2 cup pimento-stuffed green olives",
        "4 cups frozen corn, thawed",
        "1 1/2 cups masa harina",
        "2 tablespoons white sugar",
        "1 tablespoon white vinegar",
        "1 teaspoon salt, or to taste",
        "1 (8 ounce) package dried corn husks, soaked in warm water",
        "kitchen twine, cut into 12-inch lengths"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cuban Tamales",
    "url": "http://allrecipes.com/recipe/223055/cuban-tamales/"
}