{
    "directions": [
        "Whisk vegetable oil, orange juice, orange peel, honey and soy sauce in small bowl to blend. Season dressing to taste with salt and pepper. (Dressing can be prepared 1 day ahead. Cover and refrigerate.)",
        "Stir cumin seeds in heavy medium skillet over medium-high heat until seeds are fragrant and slightly darker in color, about 2 minutes. Transfer seeds to medium bowl. Add minced garlic, minced chili and salt to seeds; mash mixture with back of fork to form coarse paste. Heat olive oil in same skillet over medium-high heat until very hot, about 2 minutes. Pour hot olive oil over garlic mixture; stir to blend. Let stand 15 minutes. Whisk in orange juice and lime juice. Pour marinade into 13x9x2-inch glass baking dish and cool. Add chicken to marinade; turn to cnd cool. Add chicken to marinade; turn to coat. Cover chicken and refrigerate at least 1 hour and up to 3 hours.",
        "Combine mangoes and avocados in medium bowl. Add 6 tablespoons dressing and toss to coat.",
        "Prepare barbecue (medium-high heat). Remove chicken from marinade; discard marinade. Grill chicken until cooked through, about 5 minutes per side. Transfer chicken to work surface. Let stand 5 minutes. Cut each chicken piece crosswise into 1/3-inch-thick slices.",
        "Place lettuces in large bowl. Toss with enough dressing to coat thoroughly. Season to taste with salt and pepper; mound lettuces on 6 plates. Arrange 1 sliced chicken piece atop lettuces on each plate. Spoon mangoes and avocados alongside chicken. Sprinkle salads with cashews. Serve, passing any remaining dressing separately."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons vegetable oil",
        "3/4 cup orange juice",
        "1 tablespoon (packed) grated orange peel",
        "1 tablespoon honey",
        "1 tablespoon soy sauce",
        "2 teaspoons cumin seeds",
        "6 large garlic cloves, minced",
        "1 large serrano chili, stemmed, minced",
        "1/2 teaspoon salt",
        "3/4 cup olive oil",
        "3 tablespoons orange juice",
        "3 tablespoons fresh lime juice",
        "6 skinless boneless chicken breast halves",
        "2 large firm but ripe mangoes, peeled, pitted, cut into 1/2-inch pieces",
        "2 large avocados, peeled, pitted, cut into 1/2-inch pieces",
        "10 ounces mixed baby lettuces",
        "3/4 cup roasted salted cashews"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Marinate",
        "Low Cal",
        "Backyard BBQ",
        "Orange",
        "Mango",
        "Cashew",
        "Avocado",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Lettuce"
    ],
    "title": "Cuban-Style Grilled Mojo Chicken with Greens, Avocados and Mangoes",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-style-grilled-mojo-chicken-with-greens-avocados-and-mangoes-4267"
}
