{
    "directions": [
        "Mix all marinade ingredients in a bowl and let sit for 10 minutes.",
        "If using a flavor injector (see cooking notes), strain half the marinade into a bowl, adding the strained-out garlic to the other half of the marinade. Use the injector to take in some strained marinade, pierce the pork with the tip of the needle, and inject it into the flesh. Do this all over the meat until the strained marinade has been used up.",
        "If you are not using a flavor injector, use a long, thin knife to create deep gashes all over the flesh and pour the marinade over the pork.",
        "Place the marinated pork in a deep bowl or container. Generously season the outside of the pork with salt and pour the remaining marinade all over it, spreading the onion rings all over the top.",
        "Cover well with plastic wrap and refrigerate for at least 1 hour or up to 24 hours.",
        "Remove the pork from the marinade and place it on a platter. Transfer the marinade to a saucepan, add the onions, and bring to a boil for 2 minutes. Remove from the heat and allow to cool. Place the boiled marinade and onions in a blender and puree until smooth. The marinade is now ready to use as a basting liquid.",
        "Before heating your grill, remove the pork from the refrigerator and bring to room temperature.",
        "Heat your grill to 550°F and close the lid. Wait at least 15 minutes before lowering the temperature to 300°F. Oil the grill grates with a vegetable oil-soaked paper towel held with a long pair of tongs.",
        "If your cut has the skin still attached, begin the cooking process with the skin side up (away from the direct heat).",
        "Grill your meat about 2 1/2 hours total. Turn the meat over once when you are one quarter through with the cooking time, again when you are halfway through, and once more when three-quarters of the cooking time has elapsed. The pork is ready when it reaches an internal temperature of 150°F on the grill (it will continue to cook when it's off the heat, raising the internal temperature to the desired 160°F)."
    ],
    "ingredients": [
        "4 cups (1 quart) seville orange juice or 2 2/3 cups lime juice and 1 1/3 cup orange juice",
        "1 tablespoon ground cumin",
        "2 tablespoons dried oregano",
        "2 heads garlic, roughly chopped",
        "3 tablespoons salt",
        "1 tablespoon black pepper",
        "2 onions, cut into rings",
        "6 to 8 pounds boneless pork shoulder butt (blade roast)",
        "Salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Graduation",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cuban Grilled Pork (_Lechon Asado_)",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-grilled-pork-em-lechon-asado-em-364810"
}
