{
    "directions": [
        "Whisk first 11 ingredients in medium bowl for marinade. Place chicken in large resealable plastic bag; add marinade. Seal bag; turn several times to coat chicken. Refrigerate chicken at least 4 hours and up to 1 day, turning bag occasionally. Using tongs, transfer chicken from bag to plate, allowing excess marinade to drip back into bag. Reserve marinade.",
        "Heat 1 tablespoon oil in heavy large wide pot over medium heat. Add chorizo and sauté until beginning to brown and fat begins to render, about 3 minutes. Using slotted spoon, transfer chorizo to medium bowl. Increase heat to medium-high. Add half of chicken, skin side down, to pot. Sauté until brown, about 5 minutes per side. Transfer to plate. Repeat with remaining chicken.",
        "Pour off all but 3 tablespoons fat from pot; discard excess fat. Add chopped onions; sauté 4 minutes, scraping up any browned bits. Add chopped bell pepper and chopped garlic. Sauté until onions are translucent, about 2 minutes. Mix in rice, stirring to blend with vegetables. Add 2 1/2 cups broth, tomatoes with any juice, paprika, saffron, and reserved marinade. Bring to boil, stirring to blend. Return chicken, chorizo, and any accumulated juices to pot, pressing chicken partially into rice.",
        "Reduce heat to low, cover, and simmer 15 minutes. Arrange piquillo pepper strips over chicken pieces. Cover and continue to simmer until rice is tender and chicken is cooked through, adding more broth by 1/4 cupfuls if rice is dry, about 10 minutes longer. Season to taste with salt and pepper.",
        "Transfer rice and chicken to large shallow bowl. Garnish with cilantro and lime wedges and serve."
    ],
    "ingredients": [
        "1/4 cup fresh lime juice",
        "1/4 cup chopped fresh cilantro stems",
        "2 tablespoons olive oil",
        "1 tablespoon finely grated lime peel",
        "1 tablespoon chopped fresh thyme",
        "2 teaspoons chopped seeded jalapeño chile",
        "2 teaspoons Hungarian sweet paprika",
        "2 teaspoons ground black pepper",
        "1 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground allspice",
        "10 chicken thighs with skin and bone (about 4 1/2 pounds)",
        "1 tablespoon olive oil",
        "1/2 pound fully cooked Spanish chorizo or Portuguese linguiça sausage links, cut into 1/4-inch-thick rounds",
        "2 cups finely chopped onions",
        "1/2 cup chopped red bell pepper",
        "3 garlic cloves, chopped",
        "2 cups arborio rice or short-grain white rice",
        "2 1/2 cups (or more) low-salt chicken broth",
        "2 medium tomatoes, diced",
        "2 teaspoons Hungarian sweet paprika",
        "1/4 teaspoon saffron threads",
        "1 canned piquillo pepper or 1 whole canned pimiento, cut into thin strips",
        "1/2 cup coarsely chopped fresh cilantro",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Pepper",
        "Rice",
        "Tomato",
        "Marinate",
        "Sauté",
        "High Fiber",
        "Lime",
        "Sausage",
        "Cilantro"
    ],
    "title": "Cuban-Spiced Chicken Thighs with Chorizo and Rice",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-spiced-chicken-thighs-with-chorizo-and-rice-236875"
}
