{
    "directions": [
        "Place the watercress in a colander and rinse under cold running water to remove any grit or sand. Discard any yellowing leaves and remove the tough stems; for this salad, you want only the leaves and tender stems. Pat dry with paper towels and refrigerate while you prepare the rest of the salad.",
        "Preheat the broiler. Place the pineapple slices on a baking pan and sprinkle the sugar evenly on top of them. Broil about 4 inches from the heat source, turning once, for 10 minutes on each side, until lightly golden brown. Let cool, then cut into 1-inch cubes. Set aside.",
        "Place the garlic, olive oil, vinegar or lime juice, cumin, salt, and pepper in a small bowl and whisk to combine. Taste for seasoning. Set aside.",
        "Cut the avocado(s) lengthwise in half around the pit and remove the pit. Place the avocado halves cut side down on the work surface and slice lengthwise into 1-inch-wide wedges. Peel each segment by hand or with a paring knife, and cut into 1-inch cubes.",
        "Place the watercress in a medium bowl and toss with half the dressing. Arrange on a large platter.",
        "Add the pineapple and avocado to the same bowl and toss with the rest of the dressing. Mound the pineapple and avocado over the bed of watercress. Garnish with the slivers of red onion and serve immediately."
    ],
    "ingredients": [
        "2 bunches watercress",
        "One 2 1/2-pound pineapple, peeled, cored, and cut into four 1-inch-thick slices",
        "1 tablespoon sugar",
        "3 garlic cloves, finely chopped",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons cider vinegar or fresh lime juice",
        "1/8 teaspoon ground cumin",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 large Florida (West Indian) avocado or 2 Hass avocados",
        "1 small red onion (5 ounces) thinly slivered lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Christmas",
        "Lunch",
        "Tropical Fruit",
        "Pineapple",
        "Avocado",
        "Watercress",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cuban Avocado, Watercress, and Pineapple Salad (_Ensalada de Aguacate, Berro, y Piña_)",
    "url": "http://www.epicurious.com/recipes/food/views/cuban-avocado-watercress-and-pineapple-salad-em-ensalada-de-aguacate-berro-y-pina-em-51203230"
}
