{
    "directions": [
        "Combine cucumbers, onions, and salt together in a colander fitted over a bowl; place in the refrigerator for cucumbers and onions to drain, 8 hours to overnight.",
        "Mix vinegar, sugar, water, flour, turmeric, ginger, and black pepper in a large saucepan; bring to a boil. Cook, stirring occasionally, until mixture is thickened, about 5 minutes. Add cucumbers and onions; boil for about 10 more minutes.",
        "Sterilize jars and lids in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for about 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "7 large cucumbers, grated",
        "5 large onions, grated",
        "2 tablespoons salt, or as needed",
        "3 cups white vinegar",
        "3 cups white sugar",
        "1 cup water",
        "1/2 cup all-purpose flour",
        "1 tablespoon ground turmeric",
        "1 teaspoon ground ginger",
        "1 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cucumber and Onion Relish",
    "url": "http://allrecipes.com/recipe/232721/cucumber-and-onion-relish/"
}
