{
    "directions": [
        "Combine all of the ingredients in a small pot and bring to a boil. Take off of the heat and allow to cool.",
        "Rice volume increases 2-2 1/2 times as it cooks. Almost all the short grain rice needs to be washed before cooking, because of the starch on the surface of each grain. If you cook rice without washing, starch makes the texture and taste less palatable. The following is the procedure to prepare rice:",
        "Wash rice with care, putting rice in a big bowl and washing gently with cold running water for 10 minutes. Drain rice in a big colander and dry for 20-30 minutes. Place washed rice and water into a pot and bring to a boil. Reduce heat and cover. Allow to cook for 15 minutes or until all the water has been absorbed. Turn off heat and allow to sit for 10 minutes. Place in a large bowl and pour over Sushi Zu mixture.",
        "Place 1/2 sheet of seaweed (nori) lengthwise, shinny side down on a bamboo roller. Place approximately 3 ounces of sushi rice formed into a bar in the center of the seaweed, going lengthwise, spread rice evenly, covering entire nori except for about 1/2 inch at the top edge. Spread wasabi thinly in the center, on top of the rice, lengthwise from one and to the other. Sprinkle sesame seeds on top of rice, if desired. Then place a couple strips of cut cucumber in the center to fill the length of the roll.",
        "Bring seaweed and rice toward you to the edge of the bamboo roller and holding the edge of the bamboo roller with one hand and, holding the cucumbers in place with the other hand, lift up the edge of the mat closest to you. Begin rolling mat away from you, rolling over the cucumber and connecting rice to rice. Then stop to make sure you still have a 1/2 inch strip of just nori left over at the top (this is what seals the roll). Lift the edge of bamboo roller slightly and roll another 1/2 inch away from you connecting the seaweed to seaweed and sealing the roll.",
        "Gently squeeze both sides while pressing gently down on top with both index fingers. Cut roll in half, then turn one piece around so they are parallel to one another, line them up, then cut both pieces twice, to make 6 pieces. Cut remaining rolls and serve."
    ],
    "ingredients": [
        "4 tablespoons rice vinegar",
        "1 tablespoon sugar",
        "1/4 teaspoon sea salt",
        "2 cups sushi rice",
        "3 cups water",
        "1/2 sheet of seaweed (nori)",
        "Sesame seeds (optional)",
        "1 tablespoon prepared wasabi",
        "3 cucumbers, peeled, seeded and sliced into long thin strips (matchstick size)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Wasabi",
        "Cucumber",
        "Healthy"
    ],
    "title": "Cucumber Nori Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/cucumber-nori-rolls-102219"
}
