{
    "directions": [
        "1. Dissolve the salt in the water, and add the coriander, fennel, and dill. Set aside.",
        "2. Scrub the cucumbers well, rubbing off any spines. Cut away a thin round from the stem and blossom ends, and slice lengthwise into quarters. Put the spears in a large bowl, and cover with the brine. Weight the cucumbers with a plate, cover the bowl with a kitchen towel, and set aside for 24 hours. If the bowl won't fit in your refrigerator, it's fine to leave it out at room temperature.",
        "3. The next day, pack the cucumber spears into two scalded quart jars, saving the brine. Measure out 2 cups of the brine and reserve. Strain the remaining brine through a fine sieve to capture the aromatics, and divide them between the jars. Tuck a dill head and two cloves of garlic into each jar.",
        "4. Mix the vinegar and the 2 cups reserved brine, and bring to a boil. Pour it over the pickles to cover. Seal the jars, and store in the refrigerator for a week before using. For long-term shelf storage, leave 1/2 inch headspace when filling the jars, then seal. Process in a boiling-water bath for 10 minutes, or in a hot-water bath, between 180 and 185 degrees, for 30 minutes."
    ],
    "ingredients": [
        "1/4 cup kosher salt",
        "6 cups lukewarm water",
        "2 teaspoons coriander seeds",
        "1/2 teaspoon fennel seeds",
        "3 large flowering dill heads (4 inches across)",
        "3 pounds Kirby pickling cucumbers",
        "4 cloves garlic, crushed",
        "2 cups white-wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Cucumber",
        "Dill",
        "Fat Free",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Cucumber Dill Spears and Chips",
    "url": "http://www.epicurious.com/recipes/food/views/cucumber-dill-spears-and-chips-51190830"
}
