{
    "directions": [
        "Stir garlic, lemon zest, and lemon juice into yogurt in a small bowl to combine; season with salt and pepper.",
        "Coarsely grind cumin seeds, peppercorns, caraway seeds, red pepper flakes, and sugar in spice mill or with mortar and pestle until only a few whole spices remain.",
        "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Thread lamb onto 6–8 skewers, leaving a small gap between each piece of meat. Season with salt, then sprinkle generously with spice blend, pressing it onto the meat with your hands to help it adhere if needed.",
        "Grill lamb over direct heat, turning every minute or so, until browned and beginning to char in spots, about 4 minutes. Move to cooler side of grill and continue to grill until lamb is cooked to desired doneness, about 4 minutes longer for medium-rare.",
        "Top garlic yogurt with cracked black pepper and a little lemon zest. Serve alongside lamb.",
        "Yogurt can be made 3 days ahead. Cover and chill.\nSpice blend can be made 1 month ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 garlic clove, grated",
        "1/2 teaspoon finely grated lemon zest",
        "1 tablespoon fresh lemon juice",
        "1 cup plain Greek yogurt",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons cumin seeds",
        "1 tablespoon Sichuan peppercorns or 1 teaspoon black peppercorns",
        "2 teaspoons caraway seeds",
        "2 teaspoons crushed red pepper flakes",
        "1 teaspoon sugar",
        "Vegetable oil (for grill)",
        "1 1/4 pounds boneless lamb shoulder, cut into 1-inch pieces",
        "Kosher salt, freshly cracked pepper",
        "Finely grated lemon zest (for serving)",
        "A spice mill or a mortar and pestle; 8 (8–12-inch-long) metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Grill",
        "Summer",
        "Yogurt",
        "Spice",
        "Skewer",
        "Chile",
        "Cumin",
        "Caraway",
        "Garlic"
    ],
    "title": "Cumin-Chile Lamb Kebabs With Garlic Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/cumin-chile-lamb-kebabs-with-garlic-yogurt"
}
