{
    "directions": [
        "In medium bowl, toss together all ingredients. Transfer to serving dish and set aside.",
        "If using charcoal grill, open bottom vents. Light charcoal. Leaving about 1/4 of grill free of charcoal, bank lit charcoal across rest of grill so coals are about 3 times higher on opposite side.",
        "If using gas grill, open hood, light all burners, and set on high. Close hood and preheat 10 minutes.",
        "Using electric spice grinder, pulse cumin seeds 2 to 3 times to crack. (Alternatively, place seeds on cutting board and crush lightly with small sauté pan, using gentle rocking motion.) Rub chops with oil, sprinkle with salt and pepper, and coat with cumin seeds, pressing firmly to adhere.",
        "Charcoal fire is medium-hot when you can hold your hand 5 inches above rack over area where coals are piled highest for 3 to 4 seconds. Sear chops on lightly oiled grill rack directly over hottest part of coals, turning over once, until well browned, about 3 to 4 minutes per side. Move chops to coolest part of grill, then cover with inverted roasting pan and grill, turning over once, until thermometer inserted diagonally into center of each chop (avoid bone) registers 145°F, about 12 minutes total. Transfer chops to platter and let stand, loosely covered with foil, 5 minutes (temperature will rise to 150°F). Serve, passing salsa on side.",
        "When grill is preheated, sear chops on lightly oiled grill rack, turning over once, until well browned, about 3 to 4 minutes per side. Turn off 1 burner (middle burner if there are 3) and put chops above shut-off burner. Reduce heat on remaining burner(s) to moderate and grill pork, covered with lid, until thermometer inserted diagonally into center of each chop (avoid bone) registers 145°F, about 12 minutes total. Transfer chops to platter and let stand, loosely covered with foil, 5 minutes (temperature will rise to 150°F). Serve, passing salsa on side."
    ],
    "ingredients": [
        "3 ripe but firm peaches, unpeeled, pitted and cut into 1/4-inch dice",
        "1/4 cup red onion, finely diced (about 1/2 small onion)",
        "2 tablespoons canned chipotle chiles in adobo, minced",
        "1/4 cup fresh lime juice",
        "1/4 cup fresh cilantro, chopped",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "1/4 cup whole cumin seeds",
        "6 pork rib chops, each about 1 1/2 inches thick (ask your butcher to cut them for you)",
        "3 tablespoons olive oil",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons freshly coarse-ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Herb",
        "Onion",
        "Pork",
        "Backyard BBQ",
        "Dinner",
        "Peach",
        "Pork Chop",
        "Grill",
        "Grill/Barbecue",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Cumin-Crusted Monster Pork Chop with Peach Chipotle Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/cumin-crusted-monster-pork-chop-with-peach-chipotle-salsa-238564"
}
