{
    "directions": [
        "Pour lentils into a large saucepan with cold water to cover by 2 inches. Bring water to a boil, reduce heat to medium, and simmer until lentils are tender, about 10 minutes; drain.",
        "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper. Coat paper with a layer of cooking spray.",
        "Heat olive oil in a skillet over medium-high heat. Saute onion in hot oil until golden, about 6 minutes; add carrots, bell pepper, celery, and about 2/3 of the garlic. Continue to saute the mixture until the carrots begin to soften, 5 to 7 minutes. Season mixture with cumin and cayenne pepper; remove skillet from heat.",
        "Stir lentils, bread crumbs, eggs, 3 tablespoons parsley, 3 tablespoons cilantro, salt, and pepper into the vegetable mixture; shape into patties and arrange onto the prepared baking sheet.",
        "Bake patties in preheated oven for 15 minutes, flip, and continue baking until brown and crispy, 10 to 15 minutes more.",
        "Whisk yogurt, lemon juice, and the remaining parsley and cilantro together in a small bowl.",
        "Put each burger into a lettuce leaf and top with a dollop of yogurt sauce."
    ],
    "ingredients": [
        "3/4 cup red lentils",
        "olive oil cooking spray",
        "2 tablespoons olive oil",
        "1 onion, finely chopped",
        "3 carrots, finely chopped",
        "1 orange bell pepper, finely chopped",
        "2 stalks celery, finely chopped",
        "3 cloves garlic, pressed and divided",
        "1 1/2 tablespoons ground cumin",
        "1/4 teaspoon cayenne pepper",
        "3/4 cup gluten-free bread crumbs",
        "2 eggs, lightly beaten",
        "1/4 cup chopped fresh parsley, divided",
        "1/4 cup chopped fresh cilantro, divided",
        "1 tablespoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 cup plain Greek yogurt",
        "1 tablespoon lemon juice",
        "8 leaves Bibb lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cumin-Spiced Red Lentil Burgers",
    "url": "http://allrecipes.com/recipe/237086/cumin-spiced-red-lentil-burgers/"
}
