{
    "directions": [
        "Place potatoes into a large saucepan and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 15 minutes. Drain and allow to steam dry for a minute or two.",
        "Melt the butter in a saucepan over medium heat. Stir in the garlic, and cook for 3 to 4 minutes until the aroma of the garlic has mellowed. Add the brown sugar and red wine, then bring to a boil over medium-high heat. Allow to boil for 5 minutes, then remove from the heat, cover, and keep warm.",
        "Meanwhile, season the lamb steaks with salt and pepper to taste. Press the cumin seeds into the steaks on both sides. Heat the vegetable oil in a large skillet over medium-high heat. Add the steaks, and cook on both sides until cooked to your desired degree of doneness, about 4 minutes per side for medium. Remove the steaks to rest in a warm spot. Place the spinach into the hot skillet, season to taste with salt and pepper, and cook until the spinach has wilted.",
        "Mash the potatoes with the sour cream and butter; season to taste with salt and pepper. To serve, mound a serving of mashed potatoes onto the center of a dinner plate. Top with the spinach and a lamb steak. Strain the red wine sauce overtop."
    ],
    "ingredients": [
        "20 new potatoes, halved",
        "1 tablespoon butter",
        "2 cloves garlic, minced",
        "2 tablespoons brown sugar",
        "1 cup red wine",
        "4 (6 ounce) lamb shoulder steaks",
        "salt and pepper to taste",
        "1 tablespoon cumin seeds",
        "1 tablespoon vegetable oil",
        "2 bunches fresh spinach, cleaned",
        "1/4 cup sour cream",
        "2 tablespoons softened butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Cumin Lamb Steaks with Smashed Potatoes, Wilted Spinach and Red Wine Sauce",
    "url": "http://allrecipes.com/recipe/165289/cumin-lamb-steaks-with-smashed-potato/"
}
