{
    "directions": [
        "Stir 5 cups water and 2 1/2 tablespoons sea salt in large bowl to dissolve salt. Add eggplant slices. Place plate on eggplant to submerge; let soak 1 hour. Drain eggplant; pat dry.",
        "Preheat oven to 350°F. Heat 1 tablespoon olive oil in large nonstick skillet over medium-high heat. Working in batches, sauté eggplant until brown in spots and softened, 2 minutes per side. Transfer to large rimmed baking sheet. Repeat with remaining eggplant, adding more oil by tablespoonfuls as needed; arrange eggplant in single layer on baking sheet.",
        "Mix cumin and cayenne. Sprinkle eggplant with cumin mixture. Roast until golden and cooked through, 30 minutes.",
        "Remove eggplant from oven; sprinkle with garlic. Arrange eggplant on platter and drizzle lightly with pomegranate molasses. Sprinkle pomegranate seeds and cilantro over. Serve warm or at room temperature.",
        "*A thick pomegranate syrup; available at some supermarkets, at Middle Eastern markets, and from adrianascaravan.com."
    ],
    "ingredients": [
        "5 cups water",
        "2 1/2 tablespoons sea salt or coarse kosher salt",
        "2 pounds eggplant (about 2 medium), cut crosswise into 1/2-inch-thick slices",
        "1 tablespoon (or more) olive oil",
        "2 teaspoons ground cumin",
        "1/8 teaspoon cayenne pepper",
        "2 garlic cloves, minced",
        "Pomegranate molasses* (for drizzling)",
        "2/3 cup pomegranate seeds",
        "1/4 cup cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Spice",
        "Eggplant",
        "Fall",
        "Healthy",
        "Low Cholesterol",
        "Pomegranate",
        "Potluck",
        "Molasses",
        "Cilantro",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Cumin-Scented Eggplant with Pomegranate and Cilantro",
    "url": "http://www.epicurious.com/recipes/food/views/cumin-scented-eggplant-with-pomegranate-and-cilantro-350409"
}
