{
    "directions": [
        "1. In a large bowl, combine the chicken thighs and oil. Toss to coat the thighs evenly. Transfer the thighs to a platter and sprinkle evenly on all sides with the cumin rub. Set aside at room temperature.",
        "2. Prepare a charcoal or gas grill for indirect grilling over medium heat; the temperature inside the grill should be 350°—375°F (180°—190°C). If using charcoal, bank the lit coals on either side of the grill bed, leaving a strip in the center without heat, and place a drip pan in the center. If using gas, preheat the burners, then turn off 1 or more of the burners to create a cooler zone. Brush and oil the grill grate.",
        "3. To make the salsa, place the tomatillos and chile over the direct-heat area of the grill. (You'll probably need a grill screen for the chile or you'll lose it through the grate.) Cook, turning as needed, until well charred on all sides, about 3 minutes. Transfer the tomatillos and chile to a blender, add the lime juice and oil, and pulse until combined but still chunky. Transfer to a bowl, fold in the cilantro, and season with salt. You should have about 2 cups (16 fl oz/500 ml). (The salsa can be made up to 1 week in advance and refrigerated. Bring to room temperature before serving.)",
        "4. Place the thighs, meaty side down, over the indirect-heat area of the grill. Cook, turning once, until the thighs are nicely grill-marked on both sides and firm to the touch and an instant-read thermometer inserted into the thickest part of the thigh away from bone registers 170°F (77°C), 10—15 minutes on each side.",
        "5. Transfer the thighs to a platter and let rest for 10 minutes. Serve at once with the tomatillo salsa."
    ],
    "ingredients": [
        "8 bone-in, skin-on chicken thighs",
        "1/4 cup (2 fl oz/60 ml) canola oil",
        "1/4 cup (1 oz/30 g) Cumin Crust Rub",
        "7 large tomatillos, papery husks removed, and cut in half",
        "1 jalapeño chile, halved lengthwise and seeded",
        "1/4 cup (2 fl oz/60 ml) fresh lime juice",
        "1 tablespoon olive oil",
        "1/2 cup (3/4 oz/20 g) chopped fresh cilantro",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Spice",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cumin",
        "Advance Prep Required",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Cumin-Crusted Chicken Thighs with Grilled Tomatillo Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/cumin-crusted-chicken-thighs-with-grilled-tomatillo-salsa-366209"
}
