{
    "directions": [
        "Preheat oven to 400°F. Unfold pastry onto work service. Using 2-inch- diameter scalloped cookie cutter, cut out 12 rounds. Using 1-inch-diameter cookie cutter, cut out centers of 6 pastry rounds. Discard centers. Pierce 2-inch rounds all over with fork. Brush edges with egg glaze. Top with pastry rings, pressing gently. Transfer to large baking sheet. Bake until puffed and golden, about 10 minutes. Transfer to rack; cool. Pull out uncooked portion from centers of pastries and discard. (Can be made 8 hours ahead. Store airtight at room temperature.)",
        "Preheat oven to 325°F. Cook bacon in heavy medium skillet over medium-high heat until crisp. Using slotted spoon, transfer bacon to paper towels. Pour 3 tablespoons bacon drippings into small bowl. Discard all but 1 teaspoon of remaining drippings from skillet. Add shallots to drippings in skillet; sauté over medium-high heat until tender, about 3 minutes. Add Port and cranberries and bring to boil, scraping any browned bits. Boil until cranberries are soft and liquid is reduced by half, about 10 minutes. Add reserved 3 tablespoons bacon drippings and stir just until warm. Pour vinegar into small bowl. Gradually whisk in Port mixture.",
        "Meanwhile, place pastries on baking sheet. Spoon 1 heaping tablespoon cheese into center of each. Bake until cheese is soft, about 6 minutes.",
        "Place endive in large bowl. Pour warm dressing over and toss. Divide greens among 6 plates. Sprinkle with bacon. Top each with 1 pastry and serve."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "1 egg, beaten to blend (glaze)",
        "9 smoked bacon slices, chopped",
        "1/3 cup minced shallots",
        "1 cup ruby Port",
        "1/2 cup dried cranberries",
        "1 tablespoon balsamic vinegar",
        "6 heaping tablespoons crumbled blue cheese",
        "9 cups bite-size curly endive"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Blue Cheese",
        "Cranberry",
        "Bacon",
        "Endive",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Curly Endive Salad with Cranberry-Bacon Vinaigrette and Blue Cheese Pastries",
    "url": "http://www.epicurious.com/recipes/food/views/curly-endive-salad-with-cranberry-bacon-vinaigrette-and-blue-cheese-pastries-845"
}
