{
    "directions": [
        "Stir together coconut and 1/4 cup water in a bowl and let soak at room temperature until all of water is absorbed, about 1 hour.",
        "Wash rice in several changes of cold water until water runs clear, then drain well in a sieve. Bring rice and 2 1/4 cups water to a boil in a 4-quart heavy saucepan, then reduce heat to low and cook, covered, until rice is tender and liquid is absorbed, about 20 minutes. Remove from heat and let stand, covered and undisturbed, 5 minutes. Fluff gently with a fork, then keep covered.",
        "While rice is cooking, simmer cucumber, green chile, chile powder, turmeric, and remaining 1/2 cup water in wok, uncovered, stirring frequently, until liquid is evaporated and mixture is dry, 10 to 15 minutes. Add cumin and reconstituted coconut, stirring until combined well, and reduce heat to moderately low. Add yogurt and cook, stirring constantly, until just heated through. (Do not let boil.)",
        "Immediately fold rice and yogurt mixture together gently in a large bowl until combined well, being careful not to break rice, then transfer to a shallow serving dish.",
        "Heat oil in a 10-inch heavy skillet over moderate heat until hot but not smoking. Add mustard seeds and cook until they make popping sounds, about 15 seconds. Add fenugreek and cook, stirring, until a shade darker, 30 seconds to 1 minute. Add curry leaves (oil will splatter) and cook, stirring, 30 seconds. Add chile and cook, stirring, until chile turns a shade darker, about 30 seconds.",
        "Pour hot oil mixture evenly over rice and serve immediately."
    ],
    "ingredients": [
        "6 tablespoons finely grated unsweetened coconut (dried)",
        "3 cups water",
        "1 1/2 cups basmati rice",
        "1/4 cup diced (1/4 inch) peeled cored seedless cucumber (usually plastic-wrapped)",
        "1 (2-inch) fresh hot green chile such as Thai or serrano, slit in half lengthwise, leaving stem end intact",
        "1 to 1 1/2 teaspoons mildly hot red Indian chile powder",
        "1 teaspoon ground turmeric",
        "1/4 teaspoon ground cumin",
        "1 1/2 cups whole-milk plain yogurt, whisked until smooth",
        "2 tablespoons coconut or canola oil",
        "1 1/2 teaspoons black mustard seeds",
        "1 teaspoon fenugreek seeds",
        "12 fresh curry leaves",
        "1 (3-inch) dried hot red Indian chile",
        "Special equipment: a 12- to 14-inch wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Coconut",
        "Curry",
        "Cucumber",
        "Hot Pepper",
        "Seed",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Curried Rice with Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/curried-rice-with-yogurt-232624"
}
