{
    "directions": [
        "Preheat oven to 400° F and butter a baking sheet.",
        "Pour boiling water into a small cup and steep tea bag 2 minutes. Remove and reserve tea bag and stir in currants. Into a bowl sift together flour, 2 tablespoons sugar, baking powder, and salt. Cut butter into 1/2-inch cubes and add to flour mixture, blending with fingertips until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Squeeze liquid from tea bag into cup and discard bag. With a fork stir 6 tablespoons half-and-half into flour mixture until just combined and a sticky dough is formed. Stir in currant mixture.",
        "Turn dough out onto a lightly floured surface and form into a 5-inch round. Transfer round to baking sheet and with a pastry brush lightly coat with additional half-and-half. Sprinkle dough with remaining 1/2 teaspoon sugar and with a knife score 1/4-inch deep into quarters.",
        "Bake scones in middle of oven 20 to 25 minutes, or until golden, and transfer to a rack to cool. Break scones along score marks and serve warm or at room temperature."
    ],
    "ingredients": [
        "2 tablespoons boiling water",
        "1 tea bag",
        "1/2 cup dried currants",
        "1 cup all-purpose flour",
        "2 tablespoons plus 1/2 teaspoon sugar",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) cold unsalted butter",
        "6 tablespoons half-and-half plus additional for brushing dough"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Currant",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Currant Tea Scones",
    "url": "http://www.epicurious.com/recipes/food/views/currant-tea-scones-14477"
}
