{
    "directions": [
        "Heat a large heavy pot over medium and pour in oil. Add onion and carrots, season with a five-finger pinch of salt, and cook, stirring often, until vegetables are very tender and just taking on a hint of color at the edges, about 5 minutes. Lightly crush fennel seeds with a mortar and pestle, or roughly chop them. Add fennel seeds, curry, and mustard seeds to pot and cook, stirring, until fragrant (the mustard seeds may begin to pop), less than a minute. Add split peas, stir to coat, then add stock and 4 cups water. Increase heat and bring to a boil, then simmer, stirring occasionally and adding more water if soup looks too thick, until split peas are very tender and some are starting to disintegrate, 50–55 minutes.",
        "Mash soup with a potato masher until split peas are in small pieces and soup is textured but creamy (if you prefer a smoother soup, use an immersion blender directly in the pot). Taste and adjust seasoning with more salt.",
        "While the soup is simmering, lightly crush coriander, fennel, and mustard seeds.",
        "Heat oil in a small skillet over medium and cook coconut flakes and spices, stirring constantly, until spices are sizzling and coconut is golden brown, about 1 minute. Transfer to a plate, season with salt, and let cool (coconut will crisp as it cools).",
        "Serve soup topped with spiced coconut and cilantro."
    ],
    "ingredients": [
        "2 tablespoons coconut, olive, or vegetable oil",
        "1 medium red onion, chopped",
        "4 large carrots, scrubbed, chopped",
        "Kosher salt",
        "1 teaspoon fennel seeds",
        "2 teaspoons Madras curry powder",
        "1 teaspoon mustard seeds",
        "12 ounces yellow split peas",
        "6 cups chicken stock, low-sodium chicken broth, or water",
        "1/2 teaspoon coriander seeds",
        "1/2 teaspoon fennel seeds",
        "1/2 teaspoon mustard seeds",
        "2 teaspoons coconut, olive, or vegetable oil",
        "1/4 cup unsweetened coconut flakes",
        "Kosher salt",
        "Cilantro leaves (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Soup/Stew",
        "Pea",
        "Coconut",
        "Seed",
        "Healthy",
        "Wheat/Gluten-Free",
        "Vegetarian",
        "Vegan"
    ],
    "title": "Curried Yellow Split Pea Soup With Spiced Coconut",
    "url": "http://www.epicurious.com/recipes/food/views/curried-yellow-split-pea-soup-with-spiced-coconut"
}
