{
    "directions": [
        "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.",
        "Meanwhile, place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the cauliflower, cover, and steam until just tender, 4 to 5 minutes depending on thickness. Remove from steamer and set aside.",
        "Season the pork chops with 1 1/2 teaspoon of curry powder, salt, and pepper. Heat the olive oil in a large skillet over medium-high heat. Arrange the pork chops in the skillet and cook until the pork is no longer pink in the center, about 3 minutes on each side. Place pork chops on a platter and cover to keep warm.",
        "Sprinkle the remaining 2 1/2 teaspoons of curry powder and flour into the same skillet. Whisk in the chicken broth, buttermilk, and apple chutney. Continue cooking until the curry has thickened. Stir in the cauliflower and half of the green onion; cook until the cauliflower is heated through. Place 3/4 cup of rice on each plate, and top each portion with a pork chop. Spoon curry sauce over pork chops, and sprinkle the remaining green onions to garnish."
    ],
    "ingredients": [
        "1 1/2 cups uncooked basmati rice",
        "3 cups water",
        "4 cups cauliflower florets",
        "4 (4 ounce) pork chops, trimmed",
        "1 1/2 teaspoons curry powder",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil",
        "2 1/2 teaspoons curry powder",
        "2 teaspoons all-purpose flour",
        "1/2 cup low-sodium chicken broth",
        "1/2 cup buttermilk",
        "1/4 cup apple chutney",
        "6 green onions, chopped, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Curried Pork Chops and Cauliflower with Basmati Rice",
    "url": "http://allrecipes.com/recipe/213255/curried-pork-chops-and-cauliflower-wi/"
}
