{
    "directions": [
        "In a heavy saucepan cook the garlic in the vegetable oil over moderately low heat, stirring, until it is fragrant, add the curry powder, and cook the mixture, stirring, for 30 seconds. Stir in the broth, the coconut milk, the water, the lemongrass, the gingerroot, and the peppercorns and bring the mixture to a boil. Add the chicken and poach it at a bare simmer for 20 minutes, or until it is cooked through. Transfer the chicken with a slotted spoon to a bowl and let it cool, keeping the poaching mixture warm.",
        "While the chicken is cooling, in a large bowl soak the noodles in warm water to cover for 5 minutes, drain them, and in a large saucepan of salted boiling water cook them for 5 minutes. Drain the noodles in a colander, rinse them under cold water, and drain them well.",
        "Discard the skin and bones from the chicken, shred the meat, and stir it into the poaching mixture with the lime juice and the fish sauce. Cook the soup over moderate heat, stirring, until it is hot, divide the noodles among 6 to 8 bowls, and ladle the soup over them. Sprinkle the soup with the coriander and drizzle it with the chili oil."
    ],
    "ingredients": [
        "2 garlic cloves, minced",
        "2 tablespoons vegetable oil",
        "4 tablespoons curry powder",
        "3 cups chicken broth",
        "two 14-ounce cans unsweetened coconut milk*",
        "1 cup water",
        "2 stalks of lemongrass*, the outer leaves discarded, ends trimmed, and 5 inches of the lower stalks minced",
        "ten 1/8-inch-thick slices of peeled fresh gingerroot",
        "1 teaspoon black peppercorns",
        "1 whole chicken breast with skin and bones (about 1 pound)",
        "1/2 pound dried rice-stick noodles* (rice vermicelli)",
        "6 tablespoons fresh lime juice",
        "6 tablespoons Asian fish sauce such as nuoc mam*",
        "1/3 cup chopped fresh coriander",
        "Asian chili oil* to taste if desired",
        "*available at Asian markets and some specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Pasta",
        "Coconut",
        "Curry",
        "Winter",
        "Lemongrass",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Curried Chicken Coconut Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/curried-chicken-coconut-noodle-soup-12714"
}
