{
    "directions": [
        "Heat 1/4 cup oil in a 4- to 5-quart heavy pot over moderate heat until hot but not smoking, then cook onion with 1/4 teaspoon salt, stirring occasionally, until golden, 8 to 10 minutes.",
        "Meanwhile, purée ginger, garlic, and 1/3 cup water in a blender. Add purée to golden onion and cook, stirring, until water is evaporated and oil visibly separates from onion mixture, about 5 minutes. Add curry powder, turmeric, and cumin and cook over low heat, stirring, 1 minute. Stir in lentils and remaining 5 cups water and simmer, covered, stirring occasionally, 30 minutes. Add carrots and remaining teaspoon salt and simmer, covered, stirring occasionally, until carrots are tender and lentils have broken down into a coarse purée, 15 to 20 minutes.",
        "Stir in spinach and peas and simmer, uncovered, stirring occasionally, until peas are tender, about 3 minutes. Stir in cilantro and season stew with salt and pepper. If necessary, add enough water to thin stew so that it can easily be ladled over rice.",
        "Just before serving, heat remaining 2 tablespoons oil in a small skillet over moderately high heat until hot but not smoking, then cook cumin seeds and red-pepper flakes, stirring, until fragrant and a shade darker, 30 to 45 seconds (be careful not to burn spices). Pour hot spice oil in a swirl over stew."
    ],
    "ingredients": [
        "6 tablespoons vegetable oil",
        "1 medium onion, finely chopped",
        "1 1/4 teaspoons salt",
        "1 (2- by 1-inch) piece peeled fresh ginger, quartered",
        "5 large garlic cloves, coarsely chopped",
        "5 1/3 cups water",
        "1 1/2 teaspoons curry powder",
        "3/4 teaspoon ground turmeric",
        "1/2 teaspoon ground cumin",
        "1 cup red lentils, picked over and rinsed",
        "3 medium carrots, quartered lengthwise, then cut crosswise into 1/2-inch pieces",
        "3 cups chopped trimmed spinach leaves (3 ounces)",
        "1 cup frozen peas (not thawed)",
        "1/2 cup chopped fresh cilantro",
        "1/4 teaspoon cumin seeds",
        "1/4 teaspoon dried hot red-pepper flakes",
        "Accompaniments: basmati rice; basmati rice; roasted cauliflower fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Garlic",
        "Ginger",
        "Leafy Green",
        "Herb",
        "Onion",
        "Vegetable",
        "Vegetarian",
        "Vegan",
        "Gourmet"
    ],
    "title": "Curried Red-Lentil Stew with Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/curried-red-lentil-stew-with-vegetables-238088"
}
