{
    "directions": [
        "Cut beef against the grain into ‿-inch-thick slices. Pulse shallots, lemongrass, garlic, ginger, salt, curry paste, and sugar in a food processor until finely chopped.",
        "Cook noodles in a large pot of boiling salted water until tender, 3 to 4 minutes, and drain in a colander. Rinse briefly and drain well.",
        "Heat 1 tablespoon oil in a wok or large heavy skillet over high heat until it just begins to smoke, then sauté beef, stirring, just until no longer pink. Add snap peas and sauté, stirring, 30 seconds. Transfer mixture to a bowl. Heat remaining tablespoon oil in wok over moderate heat until hot but not smoking, then cook shallot mixture, stirring frequently, until it begins to stick to bottom of wok, about 2 minutes. Stir in coconut milk and simmer, scraping up brown bits, until slightly thickened. Stir in beef mixture and cilantro and spoon over noodles."
    ],
    "ingredients": [
        "1/2 lb beef fillet or boneless sirloin steak",
        "2 shallots, chopped",
        "2 tablespoons chopped drained bottled lemongrass",
        "1 garlic clove, smashed",
        "1 tablespoon chopped peeled fresh ginger",
        "1 1/2 teaspoons salt",
        "1 teaspoon Thai red curry paste",
        "1 pinch sugar",
        "4 oz dried rice vermicelli (rice stick noodles)",
        "2 tablespoons vegetable oil",
        "6 oz sugar snap peas, trimmed and halved crosswise",
        "1 cup well-stirred canned unsweetened coconut milk",
        "2 tablespoons finely chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pasta",
        "Stir-Fry",
        "Coconut",
        "Steak",
        "Curry",
        "Spring",
        "Sugar Snap Pea",
        "Gourmet"
    ],
    "title": "Curried Beef and and Sugar Snap Peas Over Rice Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/curried-beef-and-and-sugar-snap-peas-over-rice-noodles-103311"
}
