{
    "directions": [
        "Cook onion in 2 tablespoons butter in a 10-inch heavy skillet over moderate heat, stirring occasionally, until softened, about 8 minutes, then reserve in skillet.",
        "Meanwhile, pat chicken slices dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté chicken in 2 batches, turning occasionally, until just cooked through and golden brown, 3 to 4 minutes per batch, transferring chicken to a plate with tongs.",
        "Reduce heat to moderate and add 1 tablespoon butter, then cook zucchini with 1/8 teaspoon salt and a pinch of pepper, stirring frequently, until just tender, about 2 minutes. Transfer to plate with chicken and loosely cover with foil.",
        "Add garlic along with half of reserved onion to larger skillet and cook over moderate heat, stirring, until garlic is fragrant, about 2 minutes. Add 1 teaspoon curry powder and cook, stirring, 1 minute. Stir in 1 cup broth and bring to a boil, then boil until reduced by half, 2 to 3 minutes. Add cream and boil sauce, stirring occasionally, until just thick enough to coat back of a spoon, about 2 minutes. Set sauce aside in skillet.",
        "Reheat remaining onion in 10-inch skillet over moderate heat, then add remaining teaspoon curry powder and cook, stirring, 1 minute. Add 1 tablespoon butter and remaining 1 1/4 cups broth, then bring to a boil. Stir in couscous and remaining 1/2 teaspoon salt and 1/8 teaspoon pepper, then cover tightly and let stand off heat 5 minutes. Cut remaining 2 tablespoons butter into small pieces and stir into couscous. Let stand, covered, 1 minute.",
        "While couscous is standing, add chicken and zucchini to sauce along with any juices accumulated on plate and cook over moderate heat, stirring occasionally, until heated through, about 2 minutes. Season with salt and pepper and sprinkle with 1/2 tablespoon cilantro.",
        "Fluff couscous with a fork to break up any lumps, then stir in remaining 2 tablespoons cilantro and salt and pepper to taste. Serve with lime wedges."
    ],
    "ingredients": [
        "1 large onion, finely chopped (2 cups)",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3 skinless boneless chicken breast halves (6 oz each), cut diagonally into 1/2-inch-thick slices",
        "1 1/8 teaspoons salt",
        "3/8 teaspoon black pepper",
        "2 tablespoons vegetable oil",
        "2 small zucchini (10 oz total), cut into matchsticks (2 inches long by 1/4 inch thick)",
        "2 large garlic cloves, minced",
        "2 teaspoons curry powder (preferably Madras)",
        "2 1/4 cups (18 fl oz) reduced-sodium chicken broth",
        "1/2 cup heavy cream",
        "1 1/4 cups couscous (8 oz)",
        "2 1/2 tablespoons coarsely chopped fresh cilantro",
        "1 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Curry",
        "Zucchini",
        "Summer",
        "Couscous",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Curried Couscous with Chicken and Zucchini",
    "url": "http://www.epicurious.com/recipes/food/views/curried-couscous-with-chicken-and-zucchini-232154"
}
