{
    "directions": [
        "Whisk white wine vinegar, curry powder,and pressed garlic in medium bowl to blend. Gradually whisk in olive oil. Season dressing to taste with salt and freshly ground pepper.",
        "Cook lentils and kohlrabi leaves in heavy large saucepan of boiling salted water until lentils are barely tender but not too soft, about 6 minutes. Drain; rinse under cold water to cool. Drain again.",
        "Bring 1 1/4 cups water to boil in same saucepan; remove from heat. Add 3 tablespoons dressing, sprinkle with salt, then stir in couscous. Cover pot and let stand 5 minutes. Transfer couscous to medium bowl. Fluff couscous with fork to separate grains and cool slightly. Season to taste with salt and pepper.",
        "Meanwhile, transfer lentils to large bowl. Add 1/2 cup dressing, diced kohlrabi bulb, and chopped green onions; toss to coat. Season mixture to taste with salt and pepper.",
        "Arrange baby spinach leaves over large rimmed platter. Drizzle spinach with 2 to 3 tablespoons remaining dressing. Sprinkle spinach leaves with salt and pepper. Mound lentil mixture in center of platter over spinach leaves. Stir mint into couscous. Spoon couscous around lentils and serve with remaining dressing."
    ],
    "ingredients": [
        "1/2 cup white wine vinegar",
        "1 1/2 tablespoons sweet curry powder",
        "2 garlic cloves, pressed",
        "2/3 cup extra-virgin olive oil",
        "1 16-ounce package red lentils (about 2 1/4 cups)",
        "3 large kohlrabi (about 1 1/4 to 1 1/2 pounds); leaves stemmed, thinly sliced; bulb peeled, cut into 1/3-inch dice (about 3 cups)",
        "1 cup plain couscous (about 6 ounces)",
        "1 cup chopped green onions",
        "1 5-to 6-ounce package baby spinach",
        "1/2 cup chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Curry",
        "Lentil",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Couscous",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Curried Red Lentil Kohlrabi, and Couscous Salad",
    "url": "http://www.epicurious.com/recipes/food/views/curried-red-lentil-kohlrabi-and-couscous-salad-360049"
}
