{
    "directions": [
        "Heat oil in heavy large pot over medium heat. Add onions and sauté until golden, about 15 minutes. Add ginger and garlic; sauté 1 minute. Add curry, cumin and cinnamon; sauté until fragrant, about 1 minute. Add flour, then yogurt and tomato paste, whisking until sauce is smooth, about 1 minute. Add broth and applesauce. Bring to boil. Reduce heat; simmer until sauce thickens slightly, stirring occasionally, about 30 minutes. (Can be made 1 day ahead. Cool slightly. Cover and chill. Bring to simmer before continuing.)",
        "Add chicken and peas to sauce. Simmer until chicken is almost cooked through, about 3 minutes. Add sour cream and coconut milk. Reduce heat to medium-low. Stir until chicken is cooked through and sauce thickens enough to coat spoon, about 3 minutes (do not boil). Season with salt and pepper. Transfer to bowl. Garnish with cilantro sprigs.",
        "Place rice, chutney, bananas, mangoes, coconut and peanuts in separate bowls. Serve alongside curry."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "3 cups chopped onions",
        "1/4 cup minced peeled fresh ginger",
        "3 garlic cloves, minced",
        "3 tablespoons curry powder",
        "1 teaspoon ground cumin",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons all purpose flour",
        "1 cup plain yogurt",
        "3 tablespoons tomato paste",
        "3 cups canned low-salt chicken broth",
        "1 cup unsweetened applesauce",
        "4 pounds skinless boneless chicken breasts, cut crosswise into 1/2-inch-thick slices",
        "1 10-ounce package frozen peas",
        "1/2 cup sour cream",
        "1/2 cup canned unsweetened coconut milk*",
        "Fresh cilantro sprigs",
        "Steamed white rice",
        "Major Grey mango chutney",
        "Sliced peeled bananas",
        "Chopped pitted peeled mangoes",
        "Shredded unsweetened coconut",
        "Chopped toasted peanuts",
        "*Available at Indian, Southeast Asian and Latin American markets and at many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dairy",
        "Ginger",
        "Onion",
        "Sauté",
        "Yogurt",
        "Diwali",
        "Coconut",
        "Spice",
        "Curry",
        "Pea"
    ],
    "title": "Curried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/curried-chicken-5879"
}
