{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place sweet potato, red potatoes, parsnips, and carrots in a roasting pan. Toss with olive oil; season with sea salt and black pepper.",
        "Roast sweet potato mixture in the preheated oven until vegetables are slightly softened, 20 to 30 minutes.",
        "Heat 1 tablespoon butter in a pot over medium heat; cook and stir onion until slightly softened, 3 to 5 minutes. Add sweet potato mixture and 2 more tablespoons butter; season with salt and black pepper. Cook and stir until butter is melted, 2 to 3 minutes.",
        "Heat vegetable broth and milk together in a separate saucepan over medium heat until mixture is almost at a boil.",
        "Stir flour and curry powder into sweet potato mixture until evenly coated. Gradually pour broth mixture into sweet potato mixture; stir until liquid is thickened, about 3 minutes. Divide mixture among four pot pie dishes. Top each with a puff pastry square.",
        "Bake in the preheated oven until pastry is golden brown and puffed, 17 to 20 minutes."
    ],
    "ingredients": [
        "1 3/4 cups sweet potato, peeled and cut into 2-inch chunks",
        "1 3/4 cups red potatoes, peeled and cut into 2-inch chunks",
        "1 3/4 cups parsnips, peeled and cut into 2-inch chunks",
        "1 3/4 cups carrots, peeled and cut into 2-inch chunks",
        "2 tablespoons olive oil",
        "sea salt and ground black pepper to taste",
        "1 tablespoon butter",
        "1 cup chopped onion",
        "2 tablespoons butter",
        "1 1/2 cups vegetable broth",
        "1/2 cup whole milk",
        "3 tablespoons all-purpose flour",
        "1 1/2 teaspoons curry powder, or more to taste",
        "1 (17.25 ounce) package frozen puff pastry, thawed and cut into four 5-inch squares"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Curry Root Vegetable Pot Pie",
    "url": "http://allrecipes.com/recipe/228161/curry-root-vegetable-pot-pie/"
}
