{
    "directions": [
        "Combine first 5 ingredients in heavy medium saucepan. Cook over medium-high heat until onions begin to soften, stirring frequently, about 4 minutes. Reduce heat to low, cover, and cook until onions are very soft, stirring occasionally, about 40 minutes. Add lemon juice and lemon peel; cook uncovered until most liquid is evaporated, stirring often, about 10 minutes. Season with salt and pepper. Can be made 1 day ahead. Cover and chill. Rewarm before serving.",
        "Cook oil and curry powder in heavy small skillet over medium-high heat until curry powder darkens slightly, about 1 minute. Transfer to small pitcher. Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before serving.",
        "Mix yogurt, green onions, and chopped mint in medium bowl. Cover and chill. Can be made 6 hours ahead. Keep chilled.",
        "Heat oil in heavy large pot over high heat. Add next 5 ingredients. Cook until onion and cauliflower begin to brown, stirring often, about 5 minutes. Add potatoes; stir 2 minutes. Add turmeric and stir 1 minute. Add broth and bay leaves. Bring to boil, reduce heat to medium, and simmer until vegetables are tender, about 10 minutes. Add spinach and stir until wilted, about 1 minute. Add tofu; heat until warmed through, about 1 minute. Season with salt and pepper. Discard bay leaves.",
        "Divide soup among 6 bowls; sprinkle with chopped parsley. Serve salsa, curry oil, and minted yogurt alongside.",
        "*Nigella seeds are pungent and peppery, from a flowering plant of the same name. Also called kalonji or black onion seeds. Available at indianfoodsco.com."
    ],
    "ingredients": [
        "4 cups chopped red onions (about 2 large)",
        "1 1/2 tablespoons sunflower oil or canola oil",
        "1 teaspoon nigella seeds*",
        "1 teaspoon black mustard seeds",
        "1 teaspoon yellow mustard seeds",
        "2 tablespoons fresh lemon juice",
        "2 teaspoons grated lemon peel",
        "3 tablespoons sunflower or canola oil",
        "4 teaspoons curry powder",
        "2/3 cup Greek yogurt",
        "2 green onions, thinly sliced",
        "2 tablespoons chopped fresh mint",
        "2 tablespoons olive oil",
        "1 small head of cauliflower, halved, cored, cut into 1/3-inch-thick slices, broken into pieces (about 3 cups)",
        "1 medium white onion, chopped",
        "3 tablespoons curry leaves",
        "1 teaspoon fennel seeds",
        "1 teaspoon cumin seeds",
        "1 pound Yukon Gold potatoes, peeled, cut into 1/2-inch cubes (about 3 cups)",
        "1 tablespoon turmeric",
        "4 1/2 cups vegetable broth",
        "6 bay leaves",
        "1 9-ounce bag baby spinach leaves",
        "1 14- to 16-ounce container firm tofu, drained, cut into 1/2-inch cubes",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Herb",
        "Mustard",
        "Onion",
        "Potato",
        "Vegetable",
        "Sauté",
        "Quick & Easy",
        "Cauliflower",
        "Spinach",
        "Fall",
        "Simmer"
    ],
    "title": "Curried Potato and Spinach Soup with Onion Salsa and Minted Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/curried-potato-and-spinach-soup-with-onion-salsa-and-minted-yogurt-234125"
}
