{
    "directions": [
        "On a work surface with the flat side of a knife mash together the shallots, the gingerroot, the garlic, and the jalapeño chili with the salt until mixture forms a coarse paste. In a heavy skillet heat the oil over moderate heat until it is hot but not smoking and in it cook the paste, stirring, for 1 minute. Add the turmeric, the curry powder, and the onion and cook the mixture over moderately low heat, stirring, for 2 minutes. Stir in the coconut milk and 1/2 cup water and simmer the mixture for 4 to 6 minutes, or until the liquid is reduced to about 1/2 cup. Add the shrimp in one layer and cook them, turning them once, for 3 to 4 minutes, or until they are just firm. Serve the shrimp mixture over the rice, tossing the rice with the sauce.",
        "With an ice pick or a skewer test the 3 eyes of the coconut to find the weakest one and pierce it to make a hole. Drain the liquid and reserve it for another use. Bake the coconut in a preheated 400°F. oven for 15 minutes, breaking it with a hammer, and with the point of a strong knife lever the flesh carefully out of the shell.",
        "Chop into small pieces enough of the coconut meat to measure 1 cup, reserving the remainder for another use, and in a blender or food processor blend it with 1/2 cup boiling water for 30 seconds. In a cheesecloth-lined sieve set over a bowl let the mixture drain in 5 minutes and squeeze it in the cheesecloth to extract more coconut milk. Makes about 1/2 cup."
    ],
    "ingredients": [
        "2 shallots, minced",
        "1 tablespoon minced peeled fresh gingerroot",
        "1 garlic clove, minced",
        "1 teaspoon minced bottled pickled jalapeño chili (wear rubber gloves)",
        "1 teaspoon salt",
        "1 tablespoon vegetable oil",
        "1/8 teaspoon turmeric",
        "1 teaspoon curry powder",
        "1 small onion, sliced thin crosswise",
        "1/2 cup thick coconut milk (from 1 coconut without any cracks and containing liquid",
        "3/4 pound (about 12) large shrimp, shelled, leaving the tail and the first joint of the shell intact, and deveined",
        "scallion rice as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Ginger",
        "Sauté",
        "Quick & Easy",
        "Coconut",
        "Shrimp",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Curried Chili Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/curried-chili-shrimp-10413"
}
