{
    "directions": [
        "In a large saucepan cook the wild rice in 8 cups boiling salted water for 5 minutes, remove the pan from the heat, and let the rice stand for 1 hour. Drain the rice in a large sieve and in the pan cook it in 6 cups boiling salted water for 25 to 30 minutes, or until it is tender. Drain the rice in the sieve and let it cool in a large bowl.",
        "In a small skillet melt 1 tablespoon of the butter with 1 teaspoon of the curry powder over moderately high heat until the foam subsides and in it sauté the chicken, patted dry and seasoned with salt and pepper, for 30 seconds on each side. Add the wine, vermouth, or water and cook the chicken, covered with a round of buttered wax paper and the lid, over moderately low heat for 5 minutes, or until it is just cooked through. Remove the skillet from the heat and let the chicken cool.",
        "In a small bowl whisk together the mayonnaise, 2 tablespoons of the chutney, 1 teaspoon of the remaining curry powder, the lemon juice, and the pan juices from the chicken. Cut the chicken into 1/2-inch dice, stir it well into the rice with the cashews, the raisins, the sauce, and salt and pepper to taste, and let the filling cool. The filling may be made 1 day in advance and kept covered and chilled.",
        "Preheat the oven to 425°F. In a small saucepan melt the remaining 5 tablespoons butter with the remaining 1 teaspoon curry powder. On a work surface arrange two 20-inch-long sheets of wax paper with the long sides overlapping slightly and facing you. Put 1 sheet of the phyllo on the wax paper, brush it with some of the curry butter, and sprinkle it with 2 teaspoons of the bread crumbs. On this, layer, brush, and sprinkle 4 more sheets of the phyllo in the same manner and lay the sixth sheet of phyllo on top.",
        "Spread the filling in a 3-inch wide strip, mounding it on the phyllo 4 inches above the near long side, leaving a 2-inch border at each end. Using the wax paper as a guide, lift the bottom 4 inches of the pastry over the filling, fold in the ends, and roll up the strudel tightly. Transfer the strudel carefully, seam side down, to a lightly buttered baking sheet, brush it with the remaining curry butter, and bake it in the lower third of the oven for 25 minutes, or until it is golden. Let the strudel cool to warm on the baking sheet on a rack. The strudel may be made 1 day in advance and kept covered loosely and chilled. Reheat the strudel in a preheated 400°F. oven for 15 minutes. Serve the strudel warm, cut into 1-inch slices with a serrated knife, with the additional chutney."
    ],
    "ingredients": [
        "1/2 cup wild rice, rinsed",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3 teaspoons curry powder",
        "1 whole skinless boneless chicken breast, halved and pounded between sheets of plastic wrap to a 1/2-inch thickness",
        "2 tablespoons dry white wine, dry vermouth, or water",
        "1/3 cup mayonnaise",
        "2 tablespoons Major Grey's chutney, the solids chopped, plus additional chutney as an accompaniment",
        "1 teaspoon fresh lemon juice, or to taste",
        "1/4 cup dry-roasted cashews, chopped",
        "1/4 cup golden raisins, plumped in hot water to cover for 10 minutes and drained",
        "six 18-by 14-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened kitchen towel",
        "10 teaspoons fine dry bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Bake",
        "Sauté",
        "Raisin",
        "Cashew",
        "Curry",
        "Winter",
        "Gourmet"
    ],
    "title": "Curried Chicken and Wild Rice Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/curried-chicken-and-wild-rice-strudel-10983"
}
