{
    "directions": [
        "In a blender or food processor blend the garlic, the vinegar, the lemon juice, the curry powder, the chutney, and salt and pepper to taste until the mixture is smooth. With the motor running add the oil in a stream, add the sour cream and the water, adding additional water if necessary to reach the desired consistency, and blend the dressing until it is combined well. Transfer the dressing to a small bowl and stir in the coriander. The dressing may be made 1 day in advance and kept covered and chilled.",
        "In a large heavy saucepan combine the wild rice with the water and the salt and simmer it, covered, for 45 to 50 minutes, until it is tender and all the water is absorbed. Transfer the wild rice to a large bowl and add the vinegar, the oil, and salt and pepper to taste. Toss the mixture well and let it cool completely. The wild rice mixture may be prepared up to this point 1 day in advance and kept covered and chilled. Stir in the scallions and the raisins.",
        "Cut the chicken into 3/4-inch pieces. Spoon the wild rice mixture onto one side of a large shallow serving dish, arrange the chicken on the other half, and arrange the mâche decoratively down the middle. Serve the dressing separately. (Alternatively, the wild rice mixture, the chicken, and the dressing may be tossed together in a large serving bowl and garnish with the mâche.)"
    ],
    "ingredients": [
        "2 garlic cloves, chopped",
        "3 tablespoons white-wine vinegar",
        "4 tablespoons fresh lemon juice",
        "1 1/2 tablespoons curry powder",
        "3 tablespoons bottled mango chutney",
        "2/3 cup olive oil",
        "3/4 cup sour cream",
        "3 tablespoons water",
        "1/2 cup finely chopped fresh coriander",
        "2 1/2 cups wild rice, rinsed",
        "6 1/2 cups water",
        "2 teaspoons salt",
        "1 tablespoon white-wine vinegar",
        "2 tablespoons olive oil",
        "1 bunch of scallions including the green part, chopped (about 3/4 cup)",
        "1 cup golden raisins",
        "6 whole smoked boneless chicken breast",
        "3 cups mâche (lamb's-lettuce), washed well and spun dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Leafy Green",
        "Rice",
        "Mango",
        "Curry",
        "Summer",
        "Gourmet"
    ],
    "title": "Curried Smoked Chicken and Wild Rice Salad",
    "url": "http://www.epicurious.com/recipes/food/views/curried-smoked-chicken-and-wild-rice-salad-12041"
}
