{
    "directions": [
        "Dissolve yeast in warm water.",
        "In a large bowl, cream sugar and butter. Add beaten egg and salt. Stir in cooled milk and then the yeast. Add 1 1/2 cups sifted flour; beat into a smooth batter. Cover and let rise until light, about one hour.",
        "Stir spices and dried orange zest into the sponge. Add 4 1/2 cups of flour to make a soft dough. Place on a lightly floured board, and knead until smooth and elastic. Knead in raisins and candied peel. Put in a well oiled bowl, and turn once to coat the surface of the dough.  Cover. Set aside to rise until double in bulk, about 2 hours.",
        "Divide dough into ten parts, roll into desired lengths, and let rise about 15 minutes.",
        "On a heavily greased baking sheet, make a braid of three parts, beginning in the center and working braid loosely toward each end. Pinch ends together. Twist the remaining two pieces together, and place on the base of the braid. In a small bowl, beat together egg yolk and milk; brush the loaf with this mixture. Sprinkle sliced almonds over the loaf. Repeat process for second loaf. Let rise about 45 minutes.",
        "Bake at 350 degrees F (175 degrees C) for 45 minutes. Transfer bread to a wire rack, and cool completely. Cover while cooling with a tea towel to make a soft crust. Sprinkle with confectioners' sugar."
    ],
    "ingredients": [
        "1 (0.6 ounce) cake compressed fresh yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "1/2 cup white sugar",
        "1/2 cup butter",
        "1 egg, beaten",
        "1 teaspoon salt",
        "2 cups scalded milk",
        "6 cups all-purpose flour",
        "1 pinch ground ginger",
        "1 pinch ground mace",
        "1/4 teaspoon orange zest",
        "1/2 cup golden raisins",
        "1/2 cup candied mixed fruit peel",
        "1/2 cup blanched slivered almonds",
        "1 egg yolk",
        "1 tablespoon milk",
        "2 tablespoons confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Czech Christmas Hoska",
    "url": "http://allrecipes.com/recipe/7002/czech-christmas-hoska/"
}
