{
    "directions": [
        "Using the back of a chef's knife, lightly smash lemongrass, then thinly slice. Combine lemongrass, chile, garlic, orange juice, fish sauce, brown sugar, and 4 tablespoons vinegar in a small bowl. Pour half of marinade into a large resealable plastic bag; reserve remaining marinade.",
        "Prick pork chops all over with a fork and add to bag; seal and turn to coat. Let marinate at room temperature, turning occasionally, at least 30 minutes.",
        "Prepare grill for medium-high heat; oil grate. Remove pork chops from marinade and pat dry. Season with salt and pepper. Grill, turning occasionally, until charred and cooked through, 6–8 minutes. Transfer to a platter and let rest 5 minutes.",
        "Meanwhile, season jicama with salt and grill until lightly charred, about 3 minutes per side. Cut into bite-size pieces and toss in a large bowl with mustard greens, basil, and remaining 3 tablespoons oil and 2 tablespoons vinegar; season with salt and pepper.",
        "Taste reserved marinade and season with salt, if needed. Serve pork chops with slaw alongside and marinade for drizzling over.",
        "Pork chops can be marinated 2 hours ahead. Chill."
    ],
    "ingredients": [
        "2 lemongrass stalks, tough outer layers removed",
        "1 habanero chile, seeded, very finely chopped",
        "2 garlic cloves, crushed",
        "1/2 cup fresh orange juice",
        "2 tablespoons fish sauce (such as nam pla or nuoc nam)",
        "2 tablespoons light brown sugar",
        "6 tablespoons unseasoned rice vinegar, divided",
        "4 (1/2\"-thick) bone-in pork chops",
        "3 tablespoons olive oil, plus more for grill",
        "Kosher salt, freshly ground pepper",
        "1 jicama, peeled, sliced 1/4\" thick",
        "1 bunch mustard greens, thick stems removed, sliced (about 8 cups)",
        "1/2 cup torn basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Pork Chop",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Mustard Greens",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Habanero-Marinated Pork Chops With Mustard Greens Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/habanero-marinated-pork-chops-with-mustard-greens-slaw-56389713"
}
