{
    "directions": [
        "For the cheese spread: Place the cottage cheese in a blender and puree until smooth. Transfer the cottage cheese to a mixing bowl. Add the mayonnaise, sour cream, onion, parsley, dill and garlic, and fold together with a spatula. Keep refrigerated until needed.",
        "For the burgers: Cook the bacon three-quarters of the way, remove from the pan and place on paper towels to drain any excess grease. When cool, cut into small pieces and set aside.",
        "Remove the stems from the peppers and halve them lengthwise. Scrape out the seeds (or leave them in if you like it HOT!) and finely dice. Set aside.",
        "Place the ground beef in a large mixing bowl. Add the diced bacon, peppers and the cheese. Mix together by hand just until incorporated. Don't overwork the burger mixture, as it will make the burgers tough.",
        "Shape the burgers into five 8-ounce patties. Sprinkle with salt and pepper on both sides. Set the grill to high and cook the patties for 3 minutes on the first side, and then flip. Cook another 4 minutes for medium rare, or longer for desired temperature. Split the buns and brush with the oil. Toast the buns on the grill.",
        "Place some lettuce and tomato slices on the bottom half of the burger bun. Place the burger on top of the lettuce and tomatoes, then top the burger with a good amount of the cheese spread. Finish with the other half of the bun and serve with French fries."
    ],
    "ingredients": [
        "1/4 cup cottage cheese",
        "1 cup mayonnaise",
        "1/4 cup sour cream",
        "1 tablespoon grated red onion",
        "1 tablespoon chopped fresh parsley",
        "3 sprigs fresh dill, chopped",
        "1 clove garlic, minced",
        "5 strips hickory smoked bacon",
        "3 habanero peppers",
        "2 1/2 pounds 80/20 ground sirloin",
        "1/2 cup grated Parmesan",
        "Salt and coarsely ground black pepper",
        "5 brioche hamburger buns",
        "2 ounces canola or vegetable oil",
        "Shredded iceberg lettuce, for topping",
        "Salted tomato slices, for topping",
        "French fries, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Burger",
        "Chile Peppers",
        "Vegetable",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Bacon Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Habanero Parmesan Bacon Burger",
    "url": "http://www.foodnetwork.com/recipes/habanero-parmesan-bacon-burger"
}
