{
    "directions": [
        "Remove fat from the chicken and reserve it for later use. Season chicken, inside and out, with salt.",
        "Bring a large pot of water to a boil; add chicken, onion, 8 garlic cloves, sliced 1-inch piece ginger, salt, and white pepper. Bring liquid back to a boil, reduce heat, and simmer until chicken is fully cooked, 20 to 25 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).",
        "Carefully remove chicken and plunge into a large bowl of ice water until cooled. Remove chicken, dry, and cut chicken into bite-size pieces. Strain chicken broth and reserve liquid.",
        "Wash and drain rice.",
        "Heat reserved chicken fat in a skillet over medium heat; cook and stir 5 sliced garlic cloves and sliced 1/2-inch piece ginger until fragrant, about 1 minute. Add rice and oil; cook and stir until rice is coated in oil. Pour in enough reserved chicken broth to cook rice, about 6 cups. Add pandan leaves. Cover skillet and cook rice until tender and broth is absorbed, 20 to 30 minutes.",
        "Pound red chile peppers using a mortar and pestle, adding a small amount of salt, until peppers transform into a fine paste. Stir enough lime juice into paste to make smooth; transfer to a serving dish.",
        "Pound 4 garlic cloves and 1 slice ginger using a mortar and pestle until paste is formed; transfer to a separate serving dish.",
        "Place lettuce leaves on a serving plate and arrange cucumber slices and tomatoes around dish. Place the chicken pieces in the center. Mix soy sauce and sesame oil together in a bowl; pour over chicken. Serve a bowl of reserved chicken broth on the side with a bowl of rice and the 2 dipping sauces."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1536&h=804&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4373904.jpg",
    "ingredients": [
        "1 (3 pound) whole chicken",
        "salt to taste",
        "water to cover",
        "1  onion, halved (skin on)",
        "8 cloves garlic, peeled",
        "1 (1 inch) piece fresh ginger, sliced",
        "salt and ground white pepper to taste",
        "3 cups long-grain white rice",
        "5 cloves garlic, sliced",
        "1 (1/2 inch) piece fresh ginger, sliced",
        "2 teaspoons oil",
        "5  pandan leaves, knotted",
        "3  fresh red chile peppers, halved and seeded",
        "1  lime, juiced, or as needed",
        "4 cloves garlic, peeled",
        "1 slice fresh ginger",
        "10 leaves lettuce, or as desired",
        "1  cucumber, peeled and sliced",
        "1  tomato, sliced",
        "1 tablespoon light soy sauce",
        "1 teaspoon sesame oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hainanese Chicken Rice",
    "url": "http://allrecipes.com/recipe/247232/hainanese-chicken-rice/"
}