{
    "directions": [
        "Remove fat from cavity of chicken and reserve for rice. Rub chicken inside and out with 1 teaspoon salt.",
        "Bring water with remaining 2 teaspoons salt and ginger to a boil in a 6- to 8-quart pot wide enough to hold chicken. Put chicken, breast down, in water and return to a boil, covered. Simmer chicken, partially covered, 20 minutes and remove from heat. Let chicken stand in hot broth, covered and undisturbed, until just cooked through, 15 to 20 minutes.",
        "Letting broth drain from chicken cavity into pot, transfer chicken to a large bowl of ice and cold water and reserve broth for rice and soup. Cool chicken completely, turning once. Drain chicken and pat dry with paper towels. Cut into serving pieces.",
        "Pulse chile-sauce ingredients to a coarse paste in mini food processor.",
        "Cook reserved chicken fat in a 3-quart heavy saucepan over moderate heat, stirring, until rendered, then discard solids. Add vegetable oil if necessary to make 2 tablespoons fat.",
        "Wash rice under cold running water until water runs clear and drain well.",
        "Cook shallots in fat over moderate heat, stirring, until browned. Add garlic and cook, stirring, 1 minute. Add rice and cook, stirring gently, 1 minute.",
        "Add 3 cups reserved broth and bring to a boil. Boil until liquid on surface is evaporated and small bubbles appear from holes in rice, 3 to 4 minutes.",
        "Cover and cook over very low heat until rice is tender and liquid is absorbed, about 15 minutes more. Remove from heat and let stand, covered and undisturbed, 5 minutes. Fluff rice with a fork and cover.",
        "Shave as many long ribbons as possible from cucumber with a U-shaped vegetable peeler and chill ribbons in another bowl of ice and cold water 15 minutes. Drain well.",
        "Stir together soy sauce and sesame oil.",
        "Bring 6 cups reserved broth and watercress to a boil in a 3-quart saucepan and simmer 1 minute. Remove pan from heat and let stand until watercress is a shade darker, about 3 minutes.",
        "Drizzle soy-sesame mixture over chicken. Serve chicken with cucumber ribbons and individual bowls of rice, soup, and chile sauce."
    ],
    "ingredients": [
        "1 (3- to 3 1/2-lb) chicken",
        "3 teaspoons salt",
        "4 qt water",
        "4 (1/8-inch-thick) slices fresh ginger, smashed",
        "6 (3- to 3 1/2-inch-long) fresh hot red Thai chiles or serrano chiles, chopped",
        "1 shallot, chopped",
        "2 tablespoons chopped peeled fresh ginger",
        "2 medium garlic cloves, chopped",
        "1/2 teaspoon salt",
        "1/3 cup fresh lime juice",
        "2 cups jasmine rice",
        "4 shallots, thinly sliced",
        "2 large garlic cloves, minced",
        "1 English cucumber",
        "1 tablespoon soy sauce",
        "2 teaspoons Asian sesame oil",
        "1 bunch or 1 (4-oz) bag watercress, coarse stems discarded",
        "Special equipment: a mini food processor and a U-shaped vegetable peeler",
        "1 U-shaped vegetable peeler",
        "Garnish: fresh cilantro leaves or sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Garlic",
        "Ginger",
        "Rice",
        "Hot Pepper",
        "Gourmet"
    ],
    "title": "Hainanese Chicken Rice",
    "url": "http://www.epicurious.com/recipes/food/views/hainanese-chicken-rice-103554"
}
