{
    "directions": [
        "Place flour in a large bowl. Make a well in the center; add water and salt. Mix lightly with a wooden spoon until dough comes together. Cover with plastic wrap and chill for 30 minutes.",
        "Mix shortening and butter together in a small bowl.",
        "Transfer dough to a flat work surface; roll into a rectangle about 1/4-inch thick. Spread 1/2 of the shortening mixture on top. Fold 1 side of the rectangle into the center; spread remaining shortening on top. Fold other side of the rectangle over the first, like a letter. Roll into a 1/4-inch-thick rectangle; fold into thirds. Repeat the rolling and folding process one more time.",
        "Wrap dough with plastic wrap and chill, 8 hours to overnight.",
        "Fill a baking pan with water and place on the bottom rack of the oven. Preheat oven to 375 degrees F (190 degrees C).",
        "Pound shallots, parsley, garlic, and chile powder into paste with a mortar and pestle.",
        "Preheat a large skillet over medium heat; cook and stir beef until browned, about 5 minutes. Stir in shallot paste, onion, and beef broth. Cover and cook, stirring constantly, until juices are absorbed, about 10 minutes. Let cool, about 5 minutes.",
        "Roll chilled dough to a rectangle about 1/2-inch thick. Cut into 2 1/2-inch circles. Place 1 1/3 tablespoon of the beef mixture on 1 side of each circle. Fold and lightly press edges to seal.",
        "Transfer filled patties to a baking sheet. Brush tops and edges with egg yolk.",
        "Bake in the preheated oven until puffy, about 30 minutes. Reduce oven temperature to 300 degrees F (150 degrees C) and continue baking until golden brown, about 20 minutes."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 cup cold water",
        "1 teaspoon salt",
        "1 cup vegetable shortening",
        "1/4 cup butter",
        "2 shallots, chopped",
        "2 teaspoons chopped fresh parsley",
        "1 clove garlic, chopped",
        "1 pinch chile powder, or to taste",
        "1 pound ground beef",
        "1 onion, diced",
        "1 tablespoon beef broth",
        "1 egg yolk, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Haitian Beef Patties",
    "url": "http://allrecipes.com/recipe/255839/haitian-beef-patties/"
}
