{
    "directions": [
        "Pour 1 cup vinegar into a large bowl. Swish beef shank and stew beef in vinegar to rinse. Transfer beef to a colander and rinse with water.",
        "Stir Epis Seasoning Base, lime juice, and seasoned salt in another large bowl. Add beef, toss to coat, and let marinate at least 30 minutes, preferably overnight.",
        "Heat 5 cups broth in very large stock pot over medium. Add marinated beef and bones, cover, and simmer until meat is beginning to soften, about 40 minutes.",
        "Add squash to pot on top of beef, cover, and return to a simmer. Cook until squash is fork-tender, 20–25 minutes. Using tongs or a slotted spoon, transfer squash to a blender. Add 4 cups broth and purée until smooth. Return to pot and bring to a simmer.",
        "Add potatoes, carrots, cabbage, onion, celery, leek, turnips, chile, rigatoni, cloves, garlic powder, onion powder, 2 1/2 tsp. salt, 1/2 tsp. pepper, a pinch of cayenne, parsley, if using, thyme, if using, and remaining 6 cups broth. Simmer, uncovered, until pasta and vegetables are tender, 30–35 minutes.",
        "Add oil, butter, and remaining 1 Tbsp. vinegar. Reduce heat to medium-low and simmer until beef is very tender, 15–20 minutes more.",
        "Taste and adjust seasonings. Divide soup among bowls and serve with bread alongside.",
        "Soup can be made 3 days ahead; cover and chill, or freeze up to 3 months."
    ],
    "ingredients": [
        "1 cup plus 1 tablespoon distilled white vinegar, divided",
        "1 pound beef shank, meat cut off bones into 1\" cubes",
        "1 pound stew beef (preferably chuck) cut into 1\" cubes",
        "1 cup Epis Seasoning Base",
        "3 tablespoons fresh lime juice (from about 1 lime)",
        "1 tablespoon seasoned salt",
        "15 cups beef or vegetable broth, divided",
        "1 pound beef bones",
        "1 medium calabaza squash (about 2 pounds), peeled, cubed, or 2 pounds defrosted frozen cubed calabaza squash, or 1 butternut squash (about 2 pounds), peeled, cut into 2\" chunks",
        "3 large russet potatoes (about 2 pounds), finely chopped",
        "3 carrots (about 1 pound), sliced",
        "1/2 small green cabbage (about 1 pound), very thinly sliced",
        "1 medium onion, sliced",
        "1 celery stalk, coarsely chopped",
        "1 leek, white and pale-green parts only, finely chopped",
        "2 small turnips, finely chopped",
        "1 green Scotch bonnet or habanero chile",
        "1 1/2 cups rigatoni",
        "6 whole cloves",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "2 1/2 teaspoons kosher salt, plus more",
        "1/2 teaspoon freshly ground black pepper, plus more",
        "Pinch of cayenne pepper, plus more",
        "1 parsley sprig (optional)",
        "1 thyme sprig (optional)",
        "2 tablespoons olive oil",
        "1 tablespoon unsalted butter",
        "Crusty bread (for serving)",
        "A very large stock pot (at least 10 quarts)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "New Year's Day",
        "Soup/Stew",
        "Haiti",
        "Squash",
        "Pumpkin",
        "Beef",
        "Beef Shank",
        "Pasta",
        "Chile Pepper",
        "Turnip",
        "Cabbage",
        "Lime Juice",
        "Potato",
        "Dinner"
    ],
    "title": "Haitian Beef and Pumpkin Soup (*Soup Joumou*)",
    "url": "http://www.epicurious.com/recipes/food/views/haitian-beef-and-pumpkin-soup-soup-joumou"
}
