{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over medium heat. Add shallots, garlic and thyme; sauté 2 minutes. Stir in wine and saffron. Add clams. Cover and simmer over medium heat until clams open, about 8 minutes (discard any clams that do not open). Remove from heat.",
        "Using tongs, transfer clams to bowl. Remove meat from shells; reserve meat. Strain cooking liquid and any accumulated clam juices into medium saucepan; discard solids. Add bottled clam juice to cooking liquid. Bring liquid to boil. Add peppers. Set aside.",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Sprinkle fish with salt and pepper. Add to skillet; cook until golden on bottom, about 2 minutes. Using spatula, turn fish over. Pour pepper mixture over fish. Cover and simmer over medium-low heat until fish is just cooked through, about 3 minutes.",
        "Using slotted metal spatula, transfer fish to shallow soup plates. Add clam meat to skillet; stir just until heated through. Spoon over fish. Sprinkle with cilantro and basil."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 cup chopped shallots",
        "2 tablespoons minced garlic",
        "2 tablespoons chopped fresh thyme",
        "3/4 cup dry white wine",
        "1/4 teaspoon crushed saffron threads",
        "3 1/2 dozen small clams, scrubbed",
        "1/4 cup bottled clam juice",
        "1 cup finely chopped red bell pepper",
        "1 cup finely chopped yellow bell pepper",
        "4 6-ounce halibut fillets",
        "1 1/2 tablespoons chopped fresh cilantro",
        "1 1/2 tablespoons chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Sauté",
        "Basil",
        "Halibut",
        "Clam",
        "Saffron",
        "Bell Pepper",
        "Summer",
        "Cilantro"
    ],
    "title": "Halibut and Clams with Bell Peppers and Saffron",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-and-clams-with-bell-peppers-and-saffron-5356"
}
