{
    "directions": [
        "Preheat oven to 450°F. Brush large rimmed baking sheet with 1 tablespoon oil. Mix dill and peel in small bowl for gremolata. Place beets in medium glass bowl; add enough water to cover beets halfway. Cover with plastic wrap and microwave on high until just tender, 8 to 10 minutes. Uncover and drain. Cool beets slightly. Peel and cut into 1/4- to 1/3-inch-thick slices. Return beets to same bowl. Add 1 tablespoon oil, 1 tablespoon gremolata, and shallots. Sprinkle with salt and pepper; toss well. Toss beet greens in another medium bowl with 1 tablespoon oil; sprinkle with salt and pepper.",
        "Spread beet slices in single layer on half of prepared baking sheet. Mound beet greens on other half of baking sheet. Sprinkle fish with salt and pepper; place fish fillets atop beet greens. Brush fish with remaining 2 tablespoons oil. Sprinkle fish with 2 tablespoons gremolata.",
        "Roast fish and vegetables until fish is just opaque in center, about 8 minutes. Divide fish and vegetables among plates. Sprinkle with remaining gremolata and serve."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "1/4 cup chopped fresh dill",
        "1 tablespoon finely grated orange peel",
        "3 medium (1 1/2- to 2-inch) beets with green tops attached; beets trimmed and scrubbed, beet greens very coarsely chopped (4 to 6 cups)",
        "1/2 cup thinly sliced shallots",
        "4 6- to 7-ounce halibut fillets or mahi-mahi fillets (about 1 inch thick)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Roast",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Orange",
        "Halibut",
        "Beet",
        "Healthy",
        "Dill",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Halibut with Roasted Beets, Beet Greens, and Dill-Orange Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-with-roasted-beets-beet-greens-and-dill-orange-gremolata-241608"
}
