{
    "directions": [
        "For the lemon butter: Whisk together the lemon juice, salt, pepper, lemon zest and butter in a deep medium bowl until well blended (mixture will be like a thick sauce). Set aside until ready to use.",
        "For the halibut and crispy shallots: Combine the olive oil, lemon juice, garlic, salt, pepper and garlic in an 8-by-8-by-2-inch glass dish. Whisk the marinade to blend. Add the halibut and turn several times to coat evenly. Let stand 15 to 20 minutes.",
        "Combine the grapeseed oil and shallots in a medium heavy saucepan over medium-high heat. Cook, stirring often, until the oil heats up and the shallots turn golden brown, 5 to 7 minutes. Transfer the shallots with a slotted spoon to several layers of paper towels to drain and crisp. Sprinkle with salt and pepper just before using.",
        "Heat a large dry nonstick skillet over medium-high heat. Lift the halibut from the marinade, letting the excess drain off. Add the halibut to the hot skillet and sear 3 minutes. Turn the fish over using a flexible metal spatula. Sear until still slightly pink in the center, about 3 minutes longer, depending on thickness. Transfer the halibut to plates. Top with a generous dollop of lemon-butter and pile the shallots alongside or scatter around the fish. Garnish with the lemon wedges and serve."
    ],
    "ingredients": [
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "Zest of 1 large lemon",
        "1/2 stick unsalted butter, at room temperature",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 large cloves garlic, smashed",
        "4 halibut fillets (each 4 to 5 ounces)",
        "1/2 cup grapeseed oil",
        "2 large shallots, cut into rounds, separated into rings",
        "Lemon wedges, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Shallot Recipes",
        "Vegetable",
        "Fruit",
        "Lemon Recipes",
        "Fish",
        "Halibut Recipes",
        "Main Dish Recipes"
    ],
    "title": "Halibut with Lemon-Butter and Crispy Shallots",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/halibut-with-lemon-butter-and-crispy-shallots-recipe"
}
