{
    "directions": [
        "Cook fava beans in large saucepan of boiling salted water 2 minutes; drain. Transfer to large bowl of ice water. Cool beans; peel if using fresh beans. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Mix 2 teaspoons mint, 1 teaspoon lemon peel, 3/4 teaspoon coarse salt, and 1 pinch of red pepper in small bowl. Arrange fish on large rimmed baking sheet. Rub mint mixture all over fish. DO AHEAD: Can be made 4 hours ahead. Cover and chill.",
        "Heat 2 tablespoons oil in heavy large skillet over medium heat. Add fava beans. Sprinkle with coarse salt, black pepper, and pinch of red pepper. Cook until heated through and tender, stirring occasionally and adding water by 1/4 cupfuls if dry, about 5 minutes. Using potato masher, mash beans to coarse puree, adding water by 1/4 cupfuls if dry. Season with salt and pepper. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature.",
        "Dredge fish in flour, shaking off excess. Heat 2 tablespoons oil in each of 2 heavy large skillets over medium-high heat. Cook fish until lightly browned and just opaque in center, about 4 minutes per side.",
        "Meanwhile, rewarm fava bean puree. Stir in remaining 1/4 cup mint, 1 teaspoon lemon peel, and 3 tablespoons olive oil.",
        "Divide fava bean puree among plates. Top with fish and serve."
    ],
    "ingredients": [
        "3 pounds fresh fava beans in pod, shelled, or 2 1/2 cups frozen doublepeeled fava beans, thawed",
        "2 teaspoons plus 1/4 cup chopped fresh mint",
        "2 teaspoons finely grated lemon peel, divided",
        "3/4 teaspoon coarse kosher salt",
        "2 pinches of dried crushed red pepper, divided",
        "6 5-ounce 3/4-inch-thick halibut fillets",
        "9 tablespoons extra-virgin olive oil, divided",
        "All purpose flour (for dredging)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Low Cal",
        "High Fiber",
        "Mother's Day",
        "Dinner",
        "Mint",
        "Halibut",
        "Spring",
        "Pan-Fry",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Halibut on Mashed Fava Beans with Mint",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-on-mashed-fava-beans-with-mint-352089"
}
