{
    "directions": [
        "Preheat broiler. Place tomato on rimmed baking sheet and broil until skin is blistered and slipping off, turning once with tongs, about 3 minutes. When cool enough to handle, peel skin off tomato, then cut in half and squeeze out seeds.",
        "Chop nuts in processor; add tomato, piquillo peppers, 2 tablespoons olive oil, garlic, paprika, vinegar, salt, and cayenne, then puree. Transfer romesco sauce to bowl. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Melt butter with remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add halibut and cook until golden brown, about 2 minutes per side (fish will not be cooked through). Transfer halibut to plate.",
        "Add broth to same skillet and bring to boil; stir in romesco sauce. Add halibut; reduce heat to medium-low, cover, and simmer until halibut is opaque in center, about 2 minutes. Transfer halibut to plates. Place steamed potatoes alongside. Spoon romesco sauce over; sprinkle with parsley, if desired, and serve.",
        "Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from tienda.com."
    ],
    "ingredients": [
        "1 large tomato (about 9 ounces)",
        "1/2 cup husked toasted hazelnuts (about 2 1/2 ounces)",
        "1/2 cup coarsely chopped drained piquillo peppers from jar or can",
        "4 tablespoons extra-virgin olive oil, divided",
        "2 garlic cloves, chopped",
        "1 1/2 teaspoons smoked paprika*",
        "1 teaspoon Sherry wine vinegar or red wine vinegar",
        "1/2 teaspoon salt",
        "1/4 teaspoon cayenne pepper",
        "1 tablespoon unsalted butter",
        "4 6-ounce halibut fillets",
        "1/2 cup low-salt chicken broth",
        "12 baby Yukon Gold potatoes, halved, steamed until tender",
        "Chopped fresh parsley (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Potato",
        "Tomato",
        "Broil",
        "Low Cal",
        "High Fiber",
        "Mother's Day",
        "Dinner",
        "Halibut",
        "Fall",
        "Anniversary",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Halibut in Hazelnut Romesco with Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-in-hazelnut-romesco-with-potatoes-350095"
}
