{
    "directions": [
        "Brush fish with oil. Mix ginger, shallots and garlic in heavy small saucepan. Rub 1 teaspoon ginger mixture over each fish fillet. Add clam juice and wine to remaining ginger mixture in saucepan. Boil mixture until liquid is reduced to 1/4 cup, about 15 minutes.",
        "Steam Swiss chard until just tender, about 30 seconds. Transfer chard to strainer and rinse with cold water. Drain.",
        "Pat chard dry. Place 1 chard leaf on work surface. Place another leaf next to first, overlapping long sides. Place 1 fish fillet crosswise near 1 end of chard, leaving 2-inch border on short sides of fish. Season fish with salt and pepper. Fold 2 long sides of chard over fish, then roll up fish in chard, enclosing completely. Repeat with remaining chard and fish. (Can be made 8 hours ahead. Cover ginger mixture and fish separately and chill.)",
        "Place steaming rack over boiling water in large Dutch oven. Place fish on rack. Cover; steam until cooked through, about 8 minutes. Transfer to plates.",
        "Meanwhile, add cream to ginger mixture in saucepan. Boil until mixture thickens to sauce consistency, about 5 minutes. Spoon sauce around fish."
    ],
    "ingredients": [
        "6 7-ounce halibut fillets, each about 1 1/2 inches thick by 2 inches wide",
        "Olive oil",
        "3 1/2 tablespoons minced fresh ginger",
        "2 shallots, minced",
        "1 tablespoon minced garlic",
        "1 cup bottled clam juice",
        "2/3 cup dry white wine",
        "12 large green or red Swiss chard leaves, thick stems removed",
        "1 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Ginger",
        "Leafy Green",
        "Steam",
        "Low Carb",
        "Dinner",
        "Halibut",
        "Chard"
    ],
    "title": "Halibut with Swiss Chard and Ginger Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-with-swiss-chard-and-ginger-cream-sauce-416"
}
