{
    "directions": [
        "Preheat oven to 450°F.",
        "In a small bowl, combine bread crumb ingredients. Bread crumbs may be made 1 day ahead and chilled, covered.",
        "In a small bowl stir together mayonnaise and mustard. Arrange fish in a lightly oiled shallow baking pan and season with salt and pepper. Spread mayonnaise mixture evenly on top of fillets and pat bread crumbs evenly on top. Roast fillets in middle of oven until just cooked through, 7 to 10 minutes.",
        "Serve fillets on top of coulis.",
        "Lightly brush a shallow baking pan with additional oil and in it arrange tomatoes in one layer. Brush tomatoes with remaining tablespoon oil and season with salt and pepper. Wrap garlic tightly in foil and roast tomatoes and garlic in pan in middle of oven about 20 minutes, or until tomatoes are lightly browned and garlic is tender when pierced with a knife. Peel garlic and in a blender purée with tomatoes and vinegar until smooth, adding some water if coulis is too thick. Season coulis with salt and pepper. Coulis may be made 1 day ahead and chilled, covered.",
        "In a saucepan, heat coulis over low heat, thinning with more water if too thick, and season with salt and pepper. Keep coulis warm."
    ],
    "ingredients": [
        "1/2 cup fresh bread crumbs (from about 1 slice)",
        "1 tablespoon finely chopped fresh tarragon leaves",
        "2 tablespoons chopped pitted Kalamata or other brine-cured black olives (about 5)",
        "1 tablespoon mayonnaise",
        "1/2 teaspoon Dijon mustard",
        "two 1-inch thick halibut or other firm-fleshed fish fillets such as scrod (each about 6 ounces)",
        "1 tablespoon extra-virgin olive oil plus additional for brushing pan",
        "3/4 pound plum tomatoes (about 6), cut into 1/4-inch-thick slices",
        "4 large garlic cloves, unpeeled",
        "1/2 teaspoon balsamic vinegar, or to taste",
        "about 1/4 cup water for thinning coulis"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Olive",
        "Tomato",
        "Roast",
        "Halibut",
        "Winter",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Halibut with Olive Tarragon Bread Crumbs on Roasted Tomato and Garlic Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-with-olive-tarragon-bread-crumbs-on-roasted-tomato-and-garlic-coulis-10081"
}
