{
    "directions": [
        "Using vegetable peeler, remove peel (orange part only) of clementines. Chop peel (reserve flesh for another use). Combine chopped clementine peel, chopped parsley, minced garlic, and sea salt in small bowl. Stir in extra-virgin olive oil and set gremolata aside. DO AHEAD: Gremolata can be prepared 4 hours ahead. Cover and refrigerate.",
        "Preheat oven to 350°F. Using vegetable peeler, remove peel of clementine in four 2-inch-long strips (orange part only). Cut four 12-inch squares parchment paper. Place halibut fillet in center of each parchment paper square. Sprinkle with salt and freshly ground black pepper. Drizzle halibut lightly with olive oil. Place 1 clementine peel strip, cut side up, on each halibut fillet. Bring 2 edges of parchment paper together along long side of fish fillet and fold parchment edges together 3 to 4 times. Tuck both remaining edges of parchment underneath fillet to create packet and place parchment packet on rimmed baking sheet. Repeat with remaining fish fillets. DO AHEAD: Halibut packets can be made 4 hours ahead. Chill on rimmed baking sheet.",
        "Bake fish just until opaque in center, about 18 minutes (to check doneness, unwrap packet and insert fork in fillet). Remove rimmed baking sheet from oven. Unwrap fish. Place halibut fillets on plates, spoon gremolata over, and serve."
    ],
    "ingredients": [
        "3 clementines",
        "1/3 cup chopped fresh Italian parsley",
        "2 garlic cloves, peeled, minced",
        "1 teaspoon sea salt",
        "1/4 cup extra-virgin olive oil",
        "1 clementine",
        "4 6-ounce halibut fillets",
        "Extra-virgin olive oil (for drizzling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Bake",
        "Christmas",
        "Low Cal",
        "Dinner",
        "Seafood",
        "Halibut",
        "Winter",
        "Healthy",
        "Christmas Eve",
        "Parsley",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Halibut with Clementine Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-with-clementine-gremolata-356311"
}
