{
    "directions": [
        "Finely grate 1 teaspoon zest from a grapefruit. Squeeze 1/2 cup juice from a white grapefruit.",
        "Cut peel, including all white pith, from remaining fruit with a sharp paring knife and cut segments free from membranes. Chop enough grapefruit segments (use all colors) to measure 1/2 cup. Reserve 1 cup of remaining whole segments.",
        "Boil juice, wine, shallot, and vinegar in a small heavy saucepan until reduced to about 1 tablespoon. Reduce heat to low and whisk in butter 1 piece at a time, lifting pan from heat occasionally to cool sauce and adding each new piece of butter before previous one has melted completely (sauce must not get hot enough to separate).",
        "Stir in chopped grapefruit and season with salt and pepper. Keep beurre blanc warm in a metal bowl set over a saucepan of hot water.",
        "Preheat oven to 250°F. Pat halibut dry and season with salt and pepper. Heat 1 1/2 tablespoons oil in a large nonstick skillet over moderately high heat until hot but not smoking, then sauté fish, in batches if necessary, turning over once, until golden brown and just cooked through, about 5 minutes total. Transfer fish to a shallow baking pan and keep warm in oven.",
        "Wipe skillet clean and heat remaining 1 1/2 tablespoons oil over moderately high heat until hot but not smoking, then sauté mushrooms with salt and pepper to taste, stirring, until golden brown, 5 to 7 minutes. Add endives and sauté, stirring, until leaves are slightly wilted, about 1 minute. Stir in reserved whole grapefruit segments and remove from heat.",
        "Serve fish over mushrooms, topped with beurre blanc and zest."
    ],
    "ingredients": [
        "3 grapefruit (preferably 2 white and 1 pink or red)",
        "1/4 cup dry white wine",
        "1 shallot, minced",
        "2 tablespoons white-wine vinegar",
        "1 1/4 sticks (1/2 cup plus 2 tablespoons) unsalted butter, cut into tablespoon pieces",
        "4 (1/2-inch-thick) halibut steaks with skin (1 1/2 lb)",
        "3 tablespoons vegetable oil",
        "1 lb fresh shiitake mushrooms, stems discarded and caps thinly sliced",
        "2 Belgian endives, trimmed and cut crosswise into 1-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Mushroom",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Grapefruit",
        "Halibut",
        "Winter",
        "Anniversary",
        "Endive",
        "Party",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Halibut with Grapefruit Beurre Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/halibut-with-grapefruit-beurre-blanc-106152"
}
