{
    "directions": [
        "Preheat oven to 350 degrees F. Line muffin pans with 12 to 18 Reynolds(R) StayBrite(R) Baking Cups with a black swirl design.",
        "Beat butter and sugar together in a large bowl with an electric mixer on medium speed for 30 seconds. Add baking powder, cinnamon, ginger, baking soda, and salt. Beat until combined, scraping down sides of the bowl as necessary. Beat in eggs, one at a time.",
        "Whisk together the milk and molasses in a medium bowl. Alternately add flour and milk mixture to the butter mixture, beating on low speed after each addition just until combined. Spoon batter evenly into prepared muffin cups, filling each about three-fourths full.",
        "Bake 18 to 20 minutes or until a wooden toothpick inserted near centers comes out clean. Cool in pans on a wire rack for 5 minutes. Carefully remove cupcakes from pans; cool completely on a wire rack.",
        "Frost with Cinnamon Vanilla Frosting. Sprinkle colored decorating sugars.",
        "Cinnamon Vanilla Frosting: Combine butter, sour cream, and vanilla in a large mixing bowl. Beat with an electric mixer on medium speed for 30 seconds. Gradually beat in powdered sugar and ground cinnamon. Thin with 1 to 2 tablespoons milk, if needed to reach desired consistency."
    ],
    "ingredients": [
        "6 tablespoons butter, softened",
        "1/2 cup granulated sugar",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2 eggs",
        "1 cup milk",
        "1/2 cup molasses",
        "1 3/4 cups all-purpose flour",
        "Orange and black decorating sugar",
        "Cinnamon Vanilla Frosting:",
        "1/3 cup butter, softened",
        "1/3 cup sour cream",
        "1 teaspoon vanilla",
        "4 cups powdered sugar",
        "1 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Halloween Gingerbread Cupcakes",
    "url": "http://allrecipes.com/recipe/238752/halloween-gingerbread-cupcakes/"
}
