{
    "directions": [
        "Beat butter and sugar with electric mixer in a large bowl until smooth. Mix in eggs one at a time, beating the first egg in until fully incorporated before adding the second. Stir in vanilla extract.",
        "Sift together flour, cocoa powder, baking soda, and salt in a bowl; stir into butter mixture. Shape dough into a log and wrap with waxed paper, parchment, or plastic wrap. Refrigerate until firm, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Slice pieces off the log and shape them into narrow wedges about 3 inches long. Set cookies on baking tray. Cut more slices and pull off teaspoon-sized pieces and roll into balls; flatten and press balls onto wide ends of wedges for the mummies' \"heads.\"",
        "Bake in preheated until cookies are set and edges are dry, about 8 minutes. Let cool in pan for 1 minute; remove to wire rack to cool completely.",
        "Combine white chocolate chips with vegetable shortening in a microwave-safe bowl. Heat in microwave on low until melted, 1 to 2 minutes, stirring every 20 seconds, until coating is warm and smooth. Coat the tops of each cookie with melted white chocolate using a small spatula or butter knife. Reheat white chocolate mixture in microwave for a few seconds and stir again if it becomes too thick to work with. Repeat coating remaining cookies with white chocolate.",
        "Use a toothpick to score lines for \"bandages\" on each cookie, and place mini chocolate chips on the mummy heads for eyes."
    ],
    "ingredients": [
        "2/3 cup butter, softened",
        "1 cup white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 (11 ounce) packages white chocolate chips, or as needed",
        "1 1/2 tablespoons solid vegetable shortening, or as needed",
        "miniature chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Halloween Mummy Cookies",
    "url": "http://allrecipes.com/recipe/234140/halloween-mummy-cookies/"
}
