{
    "directions": [
        "Preheat the oven to 350°F. Line 2 baking sheets with parchment paper. Stack the 8 sheets of phyllo and cut in half crosswise. Brush 1 half sheet of phyllo with oil and sprinkle with sugar. Layer another half sheet on top of the first and repeat with oil and sugar to form a stack of 4 half sheets, finishing the top layer with oil and sugar. Repeat with remaining half sheets to form 3 more stacks. Cut each of the stacks into 4 equal pieces to make 16 stacks. Transfer stacks to baking sheets and bake until golden brown, 8 to 12 minutes. Let cool to room temperature, about 15 minutes.",
        "Meanwhile, in a small bowl, stir together the honey or date syrup with the tahini. If using nondairy whipped topping, place in a large bowl and gently fold in the honey-tahini mixture. If using cream, beat until soft peaks form. Gently incorporate the honey-tahini mixture and whip to stiff peaks. Refrigerate until ready to use.",
        "Place one phyllo stack on a dessert plate. Spread with a scant 1/4 cup halvah cream. Repeat with 3 more phyllo stacks and 2 more layers halvah cream. Repeat this process to form 3 more servings. Drizzle each stack with honey or date syrup, sprinkle with halvah crumbles, and garnish with raspberries."
    ],
    "ingredients": [
        "8 sheets phyllo dough, defrosted if necessary",
        "Canola or olive oil, for brushing",
        "Granulated sugar, for sprinkling",
        "1/3 cup honey or silan (date syrup, available at Middle Eastern markets or online)",
        "1/3 cup pure tahini paste",
        "2 cups non-dairy whipped topping (defrosted if necessary) or 1 cup heavy cream",
        "1/2 cup crumbled halvah",
        "Honey or silan (date syrup), for serving",
        "Fresh raspberries, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Rosh Hashanah/Yom Kippur",
        "Honey",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Halvah Mille-Feuilles",
    "url": "http://www.epicurious.com/recipes/food/views/halvah-mille-feuilles-51250900"
}
