{
    "directions": [
        "In a large saucepan cook the onion and the garlic in the butter over moderately low heat, stirring, until the onion is softened. Add the ham,the carrot, the corn, the lima beans, the broth, the water, and the thyme and simmer the stew, covered, for 10 to 12 minutes, or until the carrot is tender. While the stew is simmering, in a bowl whisk together the cornmeal, the flour, the baking powder, and the salt, add the Cheddar, and toss the mixture well. Stir in the milk until the dough is just combined.",
        "Add the beurre manié to the stew, a little at a time, stirring until the sauce is thickened, and simmer the stew for 2 minutes. Transfer the stew to a buttered 1-quart shallow baking dish, drop the biscuit dough in 6 mounds on top of it, and bake the stew in the upper third of a preheated 425°F. oven for 15 minutes, or until the biscuits are golden."
    ],
    "ingredients": [
        "1 medium onion, chopped fine",
        "2 garlic cloves, minced",
        "1 tablespoon unsalted butter",
        "3/4 pound ham steak, cut into 1-inch pieces (about 2 cups)",
        "1 carrot, cut on the diagonal into 1/2-inch slices",
        "1 cup frozen corn",
        "1 cup frozen baby lima beans",
        "3/4 cup chicken broth",
        "3/4 cup water",
        "1/4 teaspoon dried thyme, crumbled",
        "1/4 cup yellow cornmeal",
        "1/4 cup all-purpose flour",
        "3/4 teaspoon double-acting baking powder",
        "1/4 teaspoon salt",
        "1/2 cup finely grated sharp Cheddar",
        "1/4 cup milk",
        "a beurre manié made by kneading together 1 tablespoon softened unsalted butter and 2 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Soup/Stew",
        "Cheese",
        "Vegetable",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Cheddar",
        "Ham",
        "Fall",
        "Gourmet"
    ],
    "title": "Ham and Succotash Stew with Cheddar Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/ham-and-succotash-stew-with-cheddar-biscuits-10655"
}
