{
    "directions": [
        "Preheat oven to 375°F. and generously butter a jelly-roll pan. 15 1/2 by 10 1/2 by 1 inch.",
        "In a bowl, whisk together flour, cornmeal, baking powder, salt and Cheddar.",
        "In a small bowl, whisk together egg, butter, sour cream and milk. Stir egg mixture into flour mixture until just combined and spread evenly in prepared pan. (It is important to spread batter evenly or corn bread will be too thin and crisp in places.) Bake corn bread in the middle of oven 15 to 20 minutes, or until sides pull away from pan and top is golden. While corn bread is hot, with a sharp knife, loosen corn bread edges and cut into twelve 2 1/2-inch squares, preferably with a square cutter. With a metal spatula carefully transfer corn bread to a cutting board to cool and trim.",
        "Halve each square diagonally to form 24 triangles. Corn bread triangles may be made 2 days ahead and kept in a sealed plastic bag, chilled. Corn bread will soften slightly. If crisper corn bread is desired, reheat in a 350°F. oven until crisp before proceeding with recipe.",
        "Top each corn bread triangle with a folded ham slice and 1 teaspoon chutney.",
        "Halve and pit peach and cut into 1/8-inch dice (about 1 1/4 cups).",
        "In a bowl, combine peach, raisins, chili, gingerroot, shallot and cumin. Chill chutney, covered, at least 1 hour and up to 2 hours.",
        "About 1 hour before serving, stir in remaining ingredients and salt and pepper to taste. Serve chutney at room temperature. Makes about 1 1/2 cups.",
        "Can be made in 45 minutes or less but requires additional unattended time."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1/2 cup yellow cornmeal",
        "3/4 teaspoon baking powder",
        "1 teaspoon salt",
        "1 cup grated Sharp Cheddar",
        "1 large egg",
        "2 tablespoons unsalted butter, melted and cooled",
        "1/2 cup sour cream",
        "1/4 cup milk",
        "24 slices cured ham such as Westphalian or prosciutto, or cooked country ham such as Smithfield",
        "about 1/2 cup fresh peach chutney",
        "1 firm-ripe peach",
        "1/4 cup golden raisins, chopped fine",
        "1 fresh serrano or jalapeño chili, seeded and chopped fine (wear rubber gloves)",
        "1 tablespoon finely chopped, peeled fresh gingerroot",
        "1 1/2 teaspoons finely chopped shallot",
        "1/4 teaspoon ground cumin",
        "1 tablespoon sugar",
        "1 tablespoon fresh orange juice",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Cheddar",
        "Raisin",
        "Peach",
        "Ham",
        "Cornmeal",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Ham and Fresh Peach Chutney on Corn Bread",
    "url": "http://www.epicurious.com/recipes/food/views/ham-and-fresh-peach-chutney-on-corn-bread-10118"
}
