{
    "directions": [
        "Combine all ingredients except broth in heavy medium saucepan. Cover and cook over medium heat until vegetables begin to soften, stirring often, about 5 minutes. Add broth; cover and simmer until vegetables are tender, stirring occasionally, about 25 minutes.",
        "Transfer 1 cup compote to food processor and puree until almost smooth. Add puree to remaining compote; simmer 2 minutes. Season with salt and pepper. (can be made 2 days ahead. Chill.)",
        "Combine ham, egg and whipping cream in processor and process until ham is finely chopped.",
        "Pound each chicken leg between sheets of waxed paper to 1/3-inch-thick rectangle (about 6 inches by 5 inches). Arrange, smooth side down, on work surface. Sprinkle with salt and pepper. Divide ham filling among chicken pieces. Spread over center of chicken, leaving 1/2-inch border on short sides. Starting at 1 long side, roll up chicken jelly roll style.",
        "Place four 9x7-inch foil squares on work surface; butter foil. Place 1 chicken roll in center of each. Roll up foil tightly around chicken, enclosing completely. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 500°F. Place chicken on baking sheet. Bake until chicken is cooked through, about 25 minutes. Remove foil from chicken. Cut chicken roll into 3/4-inch-thick slices.",
        "Rewarm compote over medium heat, stirring often. Spoon onto plates. Arrange chicken atop compote. Top with parsley."
    ],
    "ingredients": [
        "1 medium onion, thinly sliced",
        "1/2 red bell pepper, thinly sliced lengthwise",
        "1/2 yellow bell pepper, thinly sliced lengthwise",
        "1/2 green bell pepper, thinly sliced lengthwise",
        "1 tablespoon olive oil",
        "1 tablespoon dry white wine",
        "1 tablespoon honey",
        "1 tablespoon white wine vinegar",
        "1 cup canned low-salt chicken broth",
        "1 4-ounce ham slice, cut into 1/2-inch pieces",
        "1 large egg",
        "1 tablespoon whipping cream",
        "4 large chicken legs, skin and bones removed",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Pork",
        "Poultry",
        "Bake",
        "Ham",
        "Bell Pepper"
    ],
    "title": "Ham-Stuffed Chicken Legs with Sweet Pepper, Honey and Onion Compote",
    "url": "http://www.epicurious.com/recipes/food/views/ham-stuffed-chicken-legs-with-sweet-pepper-honey-and-onion-compote-1964"
}
