{
    "directions": [
        "In a large skillet cook the bell peppers and the onion in the butter over moderate heat, stirring, until the vegetables are softened, stir in the ham, and remove the skillet from the heat. The bell pepper mixture may be made 1 day in advance and kept covered and chilled.",
        "In a bowl whisk together the flour, the baking powder, and the salt, add the butter, and blend the mixture until it resembles coarse meal. Add the milk and stir the mixture until it just forms a dough. Gather the dough into a ball, on a lightly floured surface knead it gently 6 times, and cut it into 6 equal pieces. Roll each piece of dough into a 7-inch round, for a 1/2-inch-high rim on each round by turning in the edge of the dough and pinching it until the shell measures 5 inches, and transfer the shells to a buttered large baking sheet.",
        "Divide the Münster among the shells and top it with the bell pepper mixture, making a well in the center. Crack and drop an egg carefully into the well of each shell. Bake the pizzas in the middle of a preheated 425°F. oven for 12 to 15 minutes, or until the egg yolks are just set, and garnish them with the watercress."
    ],
    "ingredients": [
        "3 red green, or yellow bell peppers, cut into thin strips",
        "1 onion, sliced thin",
        "1 1/2 tablespoons unsalted butter",
        "1 cup finely diced cooked ham (about 1/2 pound)",
        "2 cups all-purpose flour",
        "2 teaspoons double-acting baking powder",
        "1 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "1/2 cup plus 2 tablespoons milk",
        "2 cups grated Münster or Monterey Jack (about 6 ounces)",
        "6 large eggs",
        "watercress sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Ham",
        "Bell Pepper",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Ham and Egg Biscuit Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/ham-and-egg-biscuit-pizzas-11735"
}
