{
    "directions": [
        "Blend all crêpe ingredients except butter in a blender until smooth. Chill batter 30 minutes.",
        "Brush a 10-inch nonstick skillet with some butter, then heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in 1/4 cup batter, immediately swirling and tilting to create a thin, even layer. (If batter sets before skillet is coated, reduce heat slightly. Next crêpe will be better.) Return skillet to heat and cook until just set and pale golden around edges, 10 to 15 seconds.",
        "Flip crêpe carefully and cook until underside is just cooked through and pale golden, about 20 seconds more. Transfer crêpe to a large plate. Make 4 more with remaining batter (5 more if first crêpe stuck to skillet), buttering skillet each time and stacking crêpes on plate as made.",
        "Stir together cream cheese, butter, shallot, cumin, and pepper in a small bowl until smooth.",
        "Put 1 crêpe on a work surface and spread with 3 tablespoons cheese filling. Fold 3 ham slices in half crosswise and put over lower half of crêpe. Scatter 1/4 cup watercress over ham. Starting at end with ham, tightly roll up crêpe, enclosing ham and watercress, to form an 8-inch log. Make 4 more logs in same manner. Cut each log crosswise into 6 pieces."
    ],
    "ingredients": [
        "3/4 cup plus 2 tablespoons whole milk",
        "1/2 cup plus 2 tablespoons all-purpose flour",
        "2 large eggs",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "4 teaspoons vegetable oil",
        "3/4 teaspoon salt",
        "2 tablespoons unsalted butter, melted",
        "6 oz cream cheese, softened",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1/4 cup finely chopped shallot",
        "1 1/2 teaspoons ground cumin",
        "1/4 teaspoon black pepper",
        "15 thin slices cooked ham (preferably Black Forest; 10 ounces)",
        "1 1/4 cups packed fresh watercress sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Quick & Easy",
        "Ham",
        "Watercress",
        "Gourmet"
    ],
    "title": "Ham and Watercress Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/ham-and-watercress-crepes-105898"
}
