{
    "directions": [
        "In a large saucepan combine the broth, the onion, the egg white, and the crushed shell and simmer the mixture for 10 minutes. Let the mixture stand for 20 minutes and strain it through a sieve lined with a double thickness of rinsed and squeezed cheesecloth into a bowl. In small heatproof bowl let the gelatin soften in the Sherry for 5 minutes, heat the mixture over a pan of simmering water, stirring, until the gelatin is dissolved, and add it to the broth mixture. Let the aspic cool, but do not let it set. Rinse a 2-quart mold with cold water, cover the bottom with a thin layer of the cooled but still liquid aspic, and chill the aspic for 3 hours, or until it is firm. Pour the remaining aspic into a shallow baking pan and chill it.",
        "If desired garnish the edges of the bottom of the mold with the egg white and the truffles, attaching the shapes with some of the liquid aspic.",
        "In a small heatproof bowl let the gelatin soften in the Sherry for 5 minutes and heat the mixture over a pan of simmering water, stirring, until the gelatin is dissolved. In a saucepan cook the scallion in the butter over moderate heat, stirring, until it is softened, but do not let it brown, stir in the broth, the tomato paste, and the gelatin mixture, and simmer the mixture, stirring, for 1 minute. Remove the pan from the heat and stir in the ham. Season the mixture with the nutmeg and salt and pepper and let it cool. In a small bowl beat the cream until it just forms stiff peaks and fold it into the ham mixture. Chill the mousse, set over a bowl of ice and cold water, stirring occasionally, for 10 hours, or until it is slightly set.",
        "Pour the mousse into the mold, spreading it evenly, and chill it, covered, for 3 hours, or until it is set. Unmold the mousse onto a chilled platter and garnish the platter with the remaining chilled aspic, chopped, and the parsley."
    ],
    "ingredients": [
        "2 cups chicken broth",
        "1 onion, sliced",
        "1 large egg white, reserving the shell, crushed",
        "1 envelope (1tablespoon) unflavored gelatin",
        "1/4 cup medium-dry Sherry",
        "hard-boiled egg white, cut into small decorative shapes for garnish if desired",
        "black truffles (available at specialty foods shops), cut into small decorative shapes for garnish if desired",
        "2 envelopes (2 tablespoons) unflavored gelatin",
        "1/4 cup medium-dry Sherry",
        "3 tablespoons finely chopped scallion",
        "1 tablespoon unsalted butter",
        "2 cups chicken broth",
        "2 tablespoons tomato paste, or to taste",
        "3 cups ground cooked ham (about 1 3/4 pounds cooked ham)",
        "1/8 teaspoon freshly grated nutmeg, or to taste",
        "1 cup heavy cream",
        "fresh parsley sprigs for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Ham",
        "Sherry",
        "Chill",
        "Gourmet"
    ],
    "title": "Ham Mousse in Sherry Aspic",
    "url": "http://www.epicurious.com/recipes/food/views/ham-mousse-in-sherry-aspic-11051"
}
