{
    "directions": [
        "Preheat oven according to cake mix directions. Butter and flour one 8 inch round and one 9 inch round cake pan and one 2 quart ovenproof bowl 8 inches in diameter.",
        "Prepare cake mixes. Pour 1 3/4 cups of the white mix into the 8 inch round cake pan, and the rest into the 2 quart bowl. Pour 1 3/4 cups of the chocolate mix into the 9 inch round pan.",
        "Bake 8 inch cake for 25 minutes, 9 inch cake for 20 minutes and bowl cake for 1 hour or until toothpick inserted into centers comes out clean. Cool in pans on racks 10 minutes. Remove from pans; cool completely on racks.",
        "In separate small bowls, tint small amounts of vanilla frosting red and yellow, to use as ketchup and mustard. Tint remaining vanilla frosting light brown, using brown and yellow food coloring.",
        "For bun bottom, frost the 8 inch cake with light brown frosting.",
        "For hamburger patty, spread top and sides of 9 inch chocolate cake with chocolate frosting Lightly press all around sides of cake with folded paper towel, pulling towel straight out to create rough edge of burger. center cake on top of bun bottom.",
        "For cheese, arrange orange fruit chews in single layer on microwave-safe plate. Microwave on High 10-15 seconds or until slightly softened. With hands, press and flatten chews together to form 9 inch square. Place on top of hamburger patty. On work surface sprinkled with granulated sugar roll out 5 leaf-shaped gumdrops to 1/8 inch thickness to form 1 large lettuce leaf; repeat rolling with 6 more gumdrops to form another leaf. Arrange over cheese near edges of burger. For tomatoes, roll out red gumdrops individually to 1/8 inch thickness. Arrange over lettuce around burger edges. For onion rings, roll out white gumdrops to 1/8 inch thickness. With round cookie cutters or sharp knife cut out circles; cut 1/4 inch thick rings from circles with small cutters. Re-roll scraps to make additional rings; arrange rings over tomatoes. Arrange fruit-slice candies over onions for pickles. Pipe red and yellow icing around edges of burger for ketchup and mustard.",
        "For bun top: If necessary, trim bowl cake so that it will be flat on the bottom when inverted. Invert firm paper plate onto work surface. Center bowl cake, trimmed side down, on top of plate. Starting from the top, spread remaining light brown frosting in lines down sides of cake, turning plate after each section. Sprinkle with sesame seeds. Carefully place on top of the cake."
    ],
    "ingredients": [
        "1 (18.25 ounce) package white cake mix",
        "1 (18.25 ounce) package chocolate cake mix",
        "yellow paste food coloring",
        "brown paste food coloring",
        "3/4 cup prepared chocolate frosting",
        "24 orange chewy fruit-flavored candy squares",
        "12 leaf-shaped spearmint gumdrops",
        "3 large red gumdrops",
        "4 large white gumdrops",
        "6 candy lime slices",
        "1 tablespoon sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hamburger Cake",
    "url": "http://allrecipes.com/recipe/8293/hamburger-cake/"
}
