{
    "directions": [
        "Heat enough olive oil in a large pot to cover the bottom of the pot over high heat; sear beef in hot oil in batches until completely browned, 5 to 7 minutes per batch. Remove browned beef with a slotted spoon to a bowl between batches.",
        "Pour some olive oil into the pot with the browned bits of beef on the bottom; heat until shimmering. Saute onion and garlic in the hot oil until beginning to brown, 5 to 7 minutes.",
        "Pour red wine into the pan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cook until the wine reduces slightly in volume, about 5 minutes.",
        "Pour tomato sauce, chili beans with sauce, white beans, black beans, and kidney beans into the pot; stir. Bring the mixture to a simmer and reduce heat to medium-low. Stir sea salt, cumin, black pepper, cayenne pepper, red pepper flakes, sugar, garlic powder, coriander, paprika, cinnamon, and nutmeg into the beef mixture. Cook until the beef is very tender, 2 to 3 hours."
    ],
    "ingredients": [
        "2 tablespoons olive oil, or to taste",
        "2 pounds beef stew meat, trimmed and cut into bite-size pieces",
        "1 onion, diced",
        "5 cloves garlic, minced",
        "1/4 cup red wine",
        "1 (28 ounce) can tomato sauce",
        "1 (16 ounce) can red chili beans in sauce",
        "1 (15.5 ounce) can small white beans, rinsed and drained",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 (15 ounce) can kidney beans, rinsed and drained",
        "1 teaspoon sea salt",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon red pepper flakes",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon smoked paprika",
        "1 pinch ground cinnamon",
        "1 pinch ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hand-Cut Beef Chili and Beans",
    "url": "http://allrecipes.com/recipe/237679/hand-cut-beef-chili-and-beans/"
}
