{
    "directions": [
        "Place 2 cups flour in large bowl. Make well in center. Add 1/2 cup hot water, 4 teaspoons oil, and pinch of salt to well and stir to combine. Gradually mix flour into wet ingredients, adding remaining 1/2 cup water to form soft dough. Turn dough out onto lightly floured work surface. Knead until smooth, adding more flour if sticky, about 5 minutes. Gather dough into ball. Transfer dough to bowl, cover with plastic wrap, and let rest 1 hour at room temperature.",
        "Lightly dust large baking sheet with flour. Place dough on work surface and cut off 1/2-inch-thick slice. Roll dough between palms of hands and lightly floured work surface to 1/3-inch-thick rope. Repeat with 5 more dough slices, rolling each into rope. Cut ropes into 1-inch lengths. Using 2 fingers, push fingertips into dough as you pull it toward you to form horizontal imprints. Transfer to prepared baking sheet. Repeat with remaining dough in batches. DO AHEAD: Can be made 2 hours ahead. Cover with dry kitchen towel, then plastic wrap, and let stand at room temperature.",
        "Heat remaining 1/2 cup oil in heavy large saucepan over medium heat. Add onion, pancetta, and pepper and sauté until onion is translucent, about 8 minutes. Add tomatoes with any juices and cook until softened, about 5 minutes. Mix in 16 basil leaves and oregano. Season to taste with salt.",
        "Bring large pot of salted water to boil. Add pasta and boil until tender but still slightly firm to bite, about 10 minutes. Drain well; return to pot. Add half of sauce and 1/2 cup grated cheese and toss over medium heat until warm, about 2 minutes. Divide pasta among bowls. Spoon remaining sauce over. Garnish with basil sprigs. Serve, passing shaved cheese separately."
    ],
    "ingredients": [
        "2 cups (or more) 00 flour",
        "1 cup hot water, divided",
        "4 teaspoons plus 1/2 cup extra-virgin olive oil",
        "Pinch of salt",
        "1/2 cup chopped white onion",
        "1/2 cup chopped pancetta (Italian bacon)",
        "1/4 teaspoon cracked black pepper",
        "3 cups small cherry tomatoes, halved",
        "16 fresh basil leaves plus fresh sprigs for garnish",
        "2 teaspoons chopped fresh oregano",
        "1/2 cup grated Pecorino Romano cheese plus additional Romano cheese, shaved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Herb",
        "Onion",
        "Pasta",
        "Pork",
        "Tomato"
    ],
    "title": "Handmade Pasta with Pancetta, Cherry Tomatoes, and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/handmade-pasta-with-pancetta-cherry-tomatoes-and-herbs-235846"
}
