{
    "directions": [
        "Heat 2 tablespoons oil in a large heavy skillet over medium-high heat. Add mushrooms; cook, stirring occasionally, until soft and golden, about 7 minutes. Season to taste with salt and pepper. Transfer to a bowl; set aside.",
        "Melt 1 tablespoon butter with remaining 1 tablespoon oil in same skillet over medium heat. Season steak with salt and cracked pepper. Add steak, garlic, and rosemary to skillet. Cook about 3 minutes per side for medium-rare. Transfer to a cutting board. Let rest while preparing sauce.",
        "Discard garlic and rosemary from skillet. Pour off all but 1 tablespoon fat. Add wine; cook, stirring up bits, until reduced to 3/4 cup, about 3 minutes. Strain; return liquid to skillet. Stir in stock; bring to a boil. Simmer until reduced to 1/2 cup, about 5 minutes. Remove from heat; Whisk in 3 tablespoons butter. Stir in mushrooms and 1 tablespoon tarragon. Season with salt and pepper.",
        "Spoon mushroom mixture onto plates. Thinly slice steak; serve over mushrooms. Garnish with remaining 1 tablespoon tarragon."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil, divided",
        "12 ounces assorted mushrooms, torn or cut into large pieces",
        "Kosher salt, freshly ground pepper",
        "4 tablespoons (1/2 stick) unsalted butter, divided",
        "1 1 1/2-pound hanger steak, trimmed, pounded to 1/2\" thickness",
        "Coarsely cracked black pepper",
        "3 garlic cloves, lightly crushed",
        "1 6\" sprig rosemary",
        "1 cup dry red wine",
        "3/4 cup low-salt chicken stock",
        "2 tablespoons chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Quick & Easy",
        "Dinner",
        "Steak",
        "Red Wine",
        "Fall",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hanger Steak with Mushrooms and Red Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/hanger-steak-with-mushrooms-and-red-wine-sauce-367758"
}
