{
    "directions": [
        "Heat a large heavy-bottomed sauté pan or skillet over high heat, then add the oil. When the oil is hot, season the steaks with salt and pepper, slip them into the pan, and brown evenly, turning as needed, until they're done the way you like them—6 minutes total will give you a medium-rare steak (remember, the steaks will continue cooking while they rest); cook the steaks a minute longer for medium and 2 to 3 minutes longer for well-done. Transfer the steaks to a heated serving dish and set them aside in a warm place while you make the shallots.",
        "Place the pan you used to cook the steaks over medium heat and add 1 tablespoon of the butter and the shallots. Season with salt and pepper and cook, stirring, for 3 to 5 mintues, until the shallots are softened but not colored. Add the vinegar and cook until it evaporates, then add the wine. Bring the wine to the boil and allow it to cook down until it is reduced by half. Pull the pan from the heat and swirl in the remaining 1 tablespoon butter, then stir in the chopped parsley.",
        "To serve: Cut each steak on the bias into thin slices and, for each serving, fan the slices out on a warm dinner plate. Drizzle the warm shallot sauce over the meat and serve immediately."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "six 7-ounce hanger steaks",
        "salt and freshly ground white pepper",
        "2 tablespoons unsalted butter",
        "8 medium shallots, peeled, trimmed, thinly sliced, rinsed, and dried",
        "2 tablespoons red wine vinegar",
        "1/2 cup dry red wine",
        "2 tablespoons finely chopped Italian parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Steak"
    ],
    "title": "Hanger Steak with Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/hanger-steak-with-shallots-102370"
}
