{
    "directions": [
        "Preheat oven to 350°. Heat butter in a large ovenproof skillet over medium heat. Cook shallots, tossing occasionally, until golden brown, 8–10 minutes. Add pepper, 1 teaspoon salt, and 2 tablespoons vinegar and toss. Roast shallots in oven, checking after 10 minutes and shaking pan to turn and adding a splash or so of water if butter is burning, until tender, 10–20 minutes.",
        "Meanwhile, whisk oil, chile, and remaining 1/4 cup vinegar in a large bowl; season with salt (vinaigrette will separate as it sits).",
        "When shallots are done cooking, whisk vinaigrette, add shallots, and toss gently.",
        "Cook Jerusalem artichokes in a large saucepan of boiling, generously salted water until tender, 10–12 minutes. Drain; return to saucepan. Cook over medium heat, tossing, until dry, about 2 minutes. Remove from heat, add cream and butter, and stir to combine.",
        "Purée in a blender. With motor running, gradually add oil and blend until emulsified; season with salt. Strain through a fine-mesh sieve into a large bowl; discard solids.",
        "Prepare grill for medium-high heat. Season steaks with salt and grill, turning occasionally, until lightly charred and an instant-read thermometer registers 130° for medium-rare, 8–10 minutes. Transfer to a cutting board. Squeeze lemons over and drizzle with oil; season with pepper. Let rest 5–10 minutes before slicing.",
        "Spoon purée onto plates and place steak around. Top with shallots, leaving vinaigrette in pan. Toss herbs and fennel fronds in vinaigrette; season with salt. Top steak with salad and drizzle with oil."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 pound shallots, peeled, roots left intact",
        "1/4 teaspoon coarsely ground black pepper",
        "1 teaspoon kosher salt, plus more",
        "2 tablespoons plus 1/4 cup red wine vinegar",
        "1/4 cup olive oil",
        "1 teaspoon finely chopped Fresno chile",
        "1 pound Jerusalem artichokes (sunchokes), cut into 1/2\" pieces",
        "Kosher salt",
        "3 tablespoons heavy cream",
        "1 tablespoons unsalted butter",
        "3 tablespoons olive oil",
        "1 1/2 pound hanger steak, center membrane removed, cut into 4 pieces",
        "Kosher salt",
        "2 lemons, halved",
        "Olive oil",
        "Freshly ground black pepper",
        "1/4 cup fresh flat-leaf parsley leaves with tender stems",
        "2 tablespoons fresh mint leaves",
        "2 tablespoons torn fennel fronds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Dinner",
        "Steak",
        "Jerusalem Artichoke",
        "Shallot",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Hanger Steak with Shallots and Jerusalem Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/hanger-steak-with-shallots-and-jerusalem-artichokes-51248460"
}
