{
    "directions": [
        "Roast onions and ginger directly on rack of a gas burner over high heat, turning with tongs, until blistered and blackened, 10 to 15 minutes. (Alternatively, broil onions and ginger on foil-lined rack of a broiler pan about 5 inches from heat, turning occasionally, until charred, 20 to 25 minutes for onions; 25 to 30 minutes for ginger.) Transfer to a bowl and cool. When cool enough to handle, rinse and rub under cold running water to remove any blackened pieces (some areas will remain browned).",
        "While onions and ginger roast, cover shanks with 2 quarts cold water in a 6- to 8-quart pot. Bring to a boil, then drain in a large colander (discard cooking water) and rinse well with cold water. Clean pot.",
        "Wrap star anise, cinnamon stick, cloves, and peppercorns in cheesecloth and tie into a bundle with kitchen string to make a spice bag, then add to cleaned pot along with 4 quarts water, shanks, onions, and ginger. Simmer, uncovered, skimming froth occasionally, 2 hours. Add remaining quart water and return to a boil, then reduce heat and simmer, skimming froth occasionally, until shanks are very tender, about 1 hour more.",
        "Freeze steak until firm but not frozen solid, 30 to 45 minutes, then slice across the grain with a sharp thin knife into less than 1/8-inch-thick slices.",
        "Soak rice noodles in cold water to cover until softened, about 30 minutes, then drain in cleaned large colander. Cook noodles in a 6-quart pot of boiling water, uncovered, stirring, 1 minute, then drain.",
        "Transfer shanks with tongs to a cutting board. Clean pot. When shanks are cool enough to handle, remove meat from bones and cut into small pieces, discarding bones, fat, and sinew. Set aside 2 cups beef (reserve remainder for another use).",
        "Pour broth through a fine-mesh sieve into a large heatproof bowl, discarding solids. Measure broth: If there is more than 3 quarts (12 cups), boil in cleaned pot until reduced; if there is less, add water. Let stand until fat rises to top, 1 to 2 minutes, then skim off fat if desired.",
        "Combine broth and beef (2 cups) in cleaned 6- to 8-quart pot and bring to a boil, then add fish sauce and salt and return to a boil just before serving.",
        "Divide noodles among 6 large deep bowls. Top noodles with uncooked sliced steak and ladle boiling-hot broth (with pieces of beef shanks) over steak and noodles. (Hot broth will cook steak.)",
        "Serve soup with accompaniments."
    ],
    "ingredients": [
        "2 large onions, halved lengthwise",
        "1 (3-inch) piece fresh ginger, left unpeeled",
        "4 lb meaty cross-cut beef shanks (sometimes called beef shins; 1 1/2 inches thick)",
        "7 qt cold water",
        "2 teaspoons star anise pieces",
        "1 (3-inch) cinnamon stick",
        "3 whole cloves",
        "1 tablespoon black peppercorns",
        "1 (1/2-lb) piece boneless beef sirloin steak or tenderloin",
        "1 lb dried flat thin or medium rice noodles (banh pho or pad Thai)",
        "1/2 cup Asian fish sauce (preferably Vietnamese nuoc mam), or to taste",
        "1/2 teaspoon salt, or to taste",
        "Special equipment: cheesecloth; kitchen string",
        "Accompaniments: fresh bean sprouts; very thinly sliced onion (rinsed and drained); fresh cilantro, mint, and basil (preferably Thai) leaves; thinly sliced scallions; lime wedges; thinly sliced fresh Thai or serrano chiles; Asian fish sauce (preferably nuoc mam)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Ginger",
        "Winter",
        "Anise",
        "Cinnamon",
        "Clove",
        "Noodle",
        "Simmer",
        "Gourmet"
    ],
    "title": "Hanoi Beef Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/hanoi-beef-noodle-soup-233548"
}
