{
    "directions": [
        "In small bowl, whisk together sugar, turmeric, salt, pepper, garlic, and shallot. Place in large sealable plastic bag with fish and refrigerate 15 minutes.",
        "In medium bowl, whisk together fish sauce, lime juice, sugar, and 2/3 cup water until sugar dissolves, about 2 to 3 minutes. Set aside.",
        "In heavy, 6-quart pot, bring 8 cups water to boil. Add noodles and boil until al dente, about 10 minutes. Drain in colander, rinse with warm water, and let drain completely.",
        "Position rack in middle of oven and preheat to 400°F. Place rice cracker directly on rack and heat until golden, about 3 to 4 minutes. The cracker will blister as it toasts. When cool enough to handle, break cracker into shards and place on small plate.",
        "Place peanuts in small bowl and arrange lettuce and herbs on platter.",
        "Preheat grill (high heat). Grill fish, turning once, until cooked through, about 5 minutes total.",
        "Meanwhile, place cast iron dish on grill over high heat.",
        "When fish is cooked, place on heated dish, then top with onion and fresh dill. Immediately but carefully pour vegetable oil on top. This will create smoke coming up from food. Serve immediately with sauce and accompaniments."
    ],
    "ingredients": [
        "2 teaspoons sugar",
        "2 1/2 teaspoons turmeric powder",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "4 cloves garlic, chopped (about 2 tablespoons)",
        "1 shallot, finely chopped (about 2 tablespoons)",
        "4 (1/2 pound) pieces catfish or red snapper fillets (2 pounds total)",
        "3 tablespoons fish sauce",
        "3 tablespoons freshly squeezed lime juice (from 1 1/2 medium limes)",
        "3/4 teaspoon sugar",
        "1/2 pound dried vermicelli rice noodles",
        "1 Vietnamese sesame rice cracker (also called banh da), toasted and broken into shards",
        "1 cup fried peanuts*",
        "1 head red leaf lettuce",
        "10 to 12 sprigs of some or all of the following fresh herbs: mint, Thai basil, Vietnamese balm (kinh gioi), red perilla (tia to), and cilantro",
        "1 large onion, thinly sliced (about 2 cups)",
        "2 bunches fresh dill, coarsely chopped (about 2 cups)",
        "1 teaspoon vegetable oil",
        "*Fried peanuts are available at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Onion",
        "Pasta",
        "Marinate",
        "Backyard BBQ",
        "Lime",
        "Peanut",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Dill"
    ],
    "title": "Hanoi Turmeric Grilled Fish with Dill and Onion",
    "url": "http://www.epicurious.com/recipes/food/views/hanoi-turmeric-grilled-fish-with-dill-and-onion-236372"
}
