{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "For the spice mix: Mix together in a bowl the cloves, pepper, fennel, sesame seeds, coriander, cumin, allspice, nutmeg, ginger and cardamom. Set aside.",
        "For the spice paste: Place the paprika, lemon juice, the spice mix (from Step 2), salt, chopped mint, black pepper and garlic cloves in a blender. Add 2 tablespoons of the olive oil and blend to until ingredients are mixed, about 6 or 8 pulses. Slowly add the additional olive oil if mixture seems too thick to spread. Blend just until mixture is a smooth paste.",
        "Spread potatoes and carrots in a roasting pan. Rub about 1/4 of the spice paste inside the cavity of the chicken. Rub the remainder of the paste on the outside of the chicken including the underside. Place the chicken directly on the carrots and potatoes. Pierce the 2 lemons all over with a fork, and place them into the chicken cavity.",
        "Tent the chicken with aluminum foil. Roast approximately 2 hours until the thickest part of the thigh reaches 180 degrees F (80 degrees C) and the juices run clear. Remove from the oven and let rest for about 10 minutes before serving."
    ],
    "ingredients": [
        "Dry Spice Mix:",
        "1/8 teaspoon ground cloves",
        "1/4 teaspoon ground black pepper",
        "3/8 teaspoon fennel seed, ground",
        "3/4 teaspoon sesame seeds, ground",
        "1/8 teaspoon ground coriander",
        "1/8 teaspoon ground cumin",
        "1/8 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "3/4 teaspoon ground ginger",
        "1/8 teaspoon ground cardamom",
        "Spice Paste:",
        "2 tablespoons Hungarian paprika",
        "1/4 cup fresh lemon juice",
        "1 tablespoon salt",
        "3 tablespoons chopped fresh mint",
        "1 teaspoon ground black pepper",
        "2 cloves garlic, peeled and crushed",
        "3 tablespoons olive oil",
        "1 pound small red potatoes, quartered",
        "2 cups baby carrots",
        "2 small lemons",
        "1 (4 pound) roasting chicken, rinsed and patted dry"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Harvey's Moroccan Roast Chicken",
    "url": "http://allrecipes.com/recipe/162918/harveys-moroccan-roast-chicken/"
}
