{
    "directions": [
        "Peel, core, and chop coarse apple and pear. In a large heavy saucepan combine dried and fresh fruits with water to cover and simmer, stirring occasionally, until softened, about 15 minutes. Drain fruit in a sieve, discarding liquid, and chop coarse. Return fruit to pan and add remaining filling ingredients. Simmer filling, stirring occasionally, 5 minutes, or until thickened. Transfer filling to a heat-proof bowl and cool.",
        "On a lightly floured surface roll out about two thirds dough into a 12-inch round (about 1/8 inch thick) and fit into a 10-inch tart or pie pan with a removable fluted rim. Chill shell 30 minutes. Gather dough scraps together with remaining dough and on a lightly floured surface roll out into a 10-inch round (about 1/8 inch thick). Cut round into 1/2-inch-wide strips and chill on a baking sheet 30 minutes.",
        "Preheat oven to 350°F.",
        "Spread filling in shell, smoothing top, and weave dough strips in a lattice pattern over pie, trimming lattice edges flush with rim of pan and brushing dough lightly with egg wash. Bake tart in middle of oven 40 minutes, or until crust is pale golden. Cool tart in pan on a rack 15 minutes and remove side of pan.",
        "Serve tart at room temperature with ice cream or whipped cream."
    ],
    "ingredients": [
        "1 tart apple such as Granny Smith",
        "1 firm-ripe pear",
        "1 cup dried apricots (about 1/2 pound)",
        "1 cup pitted prunes (about 1/2 pound)",
        "1/2 cup dried cranberries",
        "1/2 cup raisins",
        "1/4 cup sugar",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup chopped walnuts or pecans",
        "1/2 cup Calvados, Grand Marnier or kirsch",
        "enough sweet pastry dough for 1 1/2 pie crusts (to fill a 9- to 10-inch pie pan)",
        "an egg wash made by beating 1 large egg with 1 tablespoon water",
        "Accompaniment: vanilla ice cream or sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Dessert",
        "Bake",
        "Cranberry",
        "Prune",
        "Raisin",
        "Apple",
        "Pear",
        "Apricot",
        "Pecan",
        "Walnut",
        "Fall",
        "Chill",
        "Simmer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Harvest Tart",
    "url": "http://www.epicurious.com/recipes/food/views/harvest-tart-14328"
}
