{
    "directions": [
        "1. Make the dough: Sift the flour, sugar and salt into a bowl. Add the butter and shortening. Using fingertips or a pastry blender, rub the ingredients together until the mixture resembles coarse meal. Sprinkle in the ice water, 2 tablespoons at a time, stirring with a fork until the dough gathers together. Divide the dough into 2 disks; wrap in plastic and refrigerate for 2 hours.",
        "2. Preheat the oven to 350°:F.",
        "3. In a pot, place the fruits in water just to cover; simmer until tender, 20 minutes. Drain thoroughly and chop. Return to the pot; add the sugar, walnuts, butter and Grand Marnier; simmer for 5 minutes, stirring. Let cool.",
        "4. Roll a disk of dough into an 11-inch circle, 1/4-inch thick, on a lightly floured surface. Line a 9-inch pie pan, leaving a 1-inch overhang; spoon in the filling, mounding it slightly.",
        "5. Roll the remaining disk as before; cut into 1/2-inch strips and arrange lattice-fashion over the filling; crimp decoratively. Brush the lattice with the beaten egg.",
        "6. Bake the tart until the top is golden brown and the filling is bubbling, 30 to 35 minutes. Serve warm or cool."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 teaspoons sugar",
        "1 teaspoon salt",
        "8 tablespoons (1 stick) cold butter",
        "6 tablespoons cold solid vegetable shortening",
        "About 6 tablespoons ice water",
        "1 cup each: pitted prunes, dried apricots and peeled, chopped apples",
        "1/2 cup golden raisins",
        "1/3 cup sugar",
        "1/2 cup shelled walnut halves",
        "4 tablespoons unsalted butter, melted",
        "2/3 cup Grand Marnier liqueur",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Dried Fruit",
        "Prune",
        "Raisin",
        "Apple",
        "Apricot",
        "Walnut",
        "Fall",
        "Parade"
    ],
    "title": "Harvest Tart",
    "url": "http://www.epicurious.com/recipes/food/views/harvest-tart-241229"
}
