{
    "directions": [
        "Put 1 3/4 cups lukewarm water (105 degrees F to 110 degrees F), the yeast, 1/2 cup olive oil and 1 tablespoon each turbinado sugar and salt in the bowl of a stand mixer fitted with the dough hook attachment. Mix on medium speed until the yeast and sugar dissolve, then let stand until foamy, about 10 minutes. Add both flours and mix on medium speed to make a smooth but sticky dough, about 4 minutes.",
        "Poke the butter pieces into the dough, spacing them evenly apart. (Do not mix.) Cover the dough with plastic wrap and set aside in a warm place until doubled in size, 45 minutes to 1 hour.",
        "Mix the dough with the dough hook on low speed just until there are streaks of butter throughout, about 1 minute. Put the grapes and raisins in a microwave-safe bowl, cover loosely and microwave until juicy, about 10 minutes. Let cool, then strain through a sieve, discarding the liquid.",
        "Brush a rimmed baking sheet with 2 tablespoons olive oil. Divide the dough in half and transfer one piece to the baking sheet, leaving the other in the bowl. Cover both pieces of dough loosely with parchment paper; set aside until plump and airy, about 30 minutes. Meanwhile, put a pizza stone or inverted rimmed baking sheet on the lowest oven rack and preheat the oven to 450 degrees F.",
        "Spread the dough on the baking sheet so it fills the pan, dimpling it with your fingertips. Scatter half of the grape-raisin mixture evenly on top. Put the remaining piece of dough on top and stretch and pat it to cover the bottom piece of dough. (Don't worry if the dough tears.) Scatter the walnuts and the remaining grape-raisin mixture on top; dimple the dough all over with your fingertips, poking the topping into the dough. Cover loosely with parchment and set aside until the dough rises above the sides of the baking sheet by about 1/2 inch, 35 to 40 minutes.",
        "Mix the remaining 1/4 cup sugar, the coriander, rosemary, the remaining 3/4 teaspoon salt and the pepper; sprinkle over the dough. Place the baking sheet on the hot stone and bake 10 minutes. Reduce the oven temperature to 400 degrees F and bake until the focaccia is golden and springs back when pressed, 20 to 30 more minutes. Brush with the remaining 2 tablespoons olive oil; let cool in the pan 15 minutes, then transfer to a rack to cool slightly or let cool completely and freeze.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "1 3/4 cups lukewarm water",
        "2 1/4-ounce packets active dry yeast (1 1/2 tablespoons)",
        "3/4 cup extra-virgin olive oil",
        "1/4 cup plus 1 tablespoon turbinado sugar",
        "1 tablespoon plus 3/4 teaspoon kosher salt",
        "2 1/4 cups all-purpose flour",
        "2 1/4 cups bread flour",
        "1 stick cold unsalted butter, cut into 12 pieces",
        "2 cups (about 1 pound) seedless red grapes",
        "2/3 cup raisins",
        "1 cup walnuts, coarsely chopped",
        "1 teaspoon coriander seeds, cracked with a heavy pan",
        "1 teaspoon minced fresh rosemary",
        "1/2 teaspoon freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Focaccia Recipes",
        "Fruit",
        "Grape Recipes",
        "Nut Recipes"
    ],
    "title": "Harvest Focaccia",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/harvest-focaccia-recipe"
}
