{
    "directions": [
        "Place a rack in upper third of oven; preheat to 425°F. Halve squash lengthwise and scoop out seeds with a large spoon. Using a peeler, remove skin and white flesh below (you should reach the deep orange flesh). Rub all over with oil; season with salt and pepper. Roast in a baking dish just large enough to hold halves side by side until beginning to soften (a paring knife should easily slip in only about 1/4\"), 15–18 minutes.",
        "Meanwhile, bring chile, maple syrup, butter, and vinegar to a simmer in a small saucepan over medium-high, stirring occasionally and removing chile as soon as desired heat level is reached (set aside for serving), until just thick enough to coat spoon, 6–8 minutes. Reduce heat to very low and keep glaze warm.",
        "Transfer squash to a cutting board and let cool slightly. Using a sharp knife, score rounded sides of squash halves crosswise, going as deep as possible but without cutting all the way through. Return squash to baking dish, scored sides up, and tuck bay leaves between a few of the slices; season with salt and pepper.",
        "Roast squash, basting with glaze every 10 minutes or so and using pastry brush to lift off any glaze in dish that is browning too much, until tender and glaze forms a rich brown coating, 45–60 minutes. Serve topped with reserved chiles.",
        "Squash can be roasted 4 hours ahead. Let cool until just warm; cover and store at room temperature. Reheat before serving."
    ],
    "ingredients": [
        "1 large butternut squash or 2–3 small honeynut squash (about 3 pounds total)",
        "1 tablespoon olive oil",
        "Kosher salt, freshly ground pepper",
        "1 Fresno chile, thinly sliced",
        "1/4 cup pure maple syrup, preferably grade B",
        "3 tablespoons unsalted butter",
        "2 tablespoons apple cider vinegar",
        "6–8 dried bay leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Butternut Squash",
        "Thanksgiving",
        "Side",
        "Chile Pepper",
        "Maple Syrup",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Dinner"
    ],
    "title": "Hasselback Butternut Squash With Bay Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/hasselback-butternut-squash-with-bay-leaves"
}
