{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Peel potatoes, transferring to a large bowl of cold water as peeled (to prevent browning). Working with 1 potato at a time, cut a thin sliver lengthwise from 1 side of potato with a sharp paring knife to make it stand flat on a cutting board, if necessary. Lay chopsticks or spoons parallel to each other on cutting board and arrange potato lengthwise between them. Holding chopsticks against potato, make crosswise cuts, 1/8 inch apart, down to chopsticks (do not cut all the way down to chopsticks on narrow ends of potato or slices will fall off). Drop potato back into water after cutting.",
        "Line bottom of a shallow baking pan (1 inch deep) with parchment, then butter parchment. Drain potatoes and pat dry. Brush potatoes all over with 2 tablespoons butter (total), then arrange in baking pan and sprinkle with salt. Cover pan tightly with foil and bake potatoes until just tender, 40 to 45 minutes, then remove foil and bake until tender, 10 to 15 minutes more.",
        "Preheat broiler.",
        "Brush potatoes with 2 tablespoons butter, then sprinkle with bread crumbs and broil about 5 inches from heat until golden, about 2 minutes. Drizzle with remaining 2 tablespoons butter and serve immediately."
    ],
    "ingredients": [
        "8 russet (baking) potatoes (6 to 8 oz each)",
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "1 teaspoon salt",
        "3 tablespoons fine dry bread crumbs",
        "Special equipment: 2 wooden chopsticks or wooden spoons with 1/2-inch-diameter handles; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Quick & Easy",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hasselback Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/hasselback-potatoes-109124"
}
