{
    "directions": [
        "If using fresh chiles, place on a foil-lined baking sheet and broil until blistered, 5 to 7 minutes per side. Place in a bowl, cover with plastic wrap, and let steam for 5 minutes. Remove skins, stems, and seeds. Chop chiles, drain on paper towels, and set aside.",
        "In a medium pot over medium-low heat, melt the butter. Add the onion, garlic, and salt and cook, stirring, until lightly browned and liquid has evaporated, about 2 minutes more. Whisk the flour and cumin into the butter mixture and cook until lightly browned, 30 seconds to 1 minute.",
        "Raise the heat to medium and slowly whisk in the milk. Whisk constantly until sauce is thick enough to coat the back of a spoon, about 5 minutes.",
        "Lower the heat to medium-low and add the cheeses, 1/4 cup at a time. Stir until cheese has melted completely before adding more cheese.",
        "Fold in the tomatoes and chiles. Taste and adjust seasoning. Sprinkle with cilantro and serve immediately with chips alongside."
    ],
    "ingredients": [
        "5 large fresh or 1 cup frozen, defrosted or canned, chopped hatch chiles, drained, squeezed dry",
        "3 tablespoons unsalted butter",
        "2 tablespoons grated onion",
        "3 garlic cloves finely grated using a microplane",
        "1/2 teaspoon kosher salt",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon ground cumin",
        "1 1/2 to 2 cups whole milk",
        "4 cups grated Cheddar cheese (nothing fancy!)",
        "2 cups grated Monterey Jack cheese",
        "2 plum tomatoes, seeded, diced, drained",
        "Roughly chopped cilantro (for serving)",
        "White-corn tortilla chips (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Appetizer",
        "Cheddar",
        "Monterey Jack",
        "Chile Pepper",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Hatch Chile con Queso Dip",
    "url": "http://www.epicurious.com/recipes/food/views/hatch-chile-con-queso-dip-51253410"
}
