{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.",
        "Mix flour and 1/3 cup white sugar together in a large bowl. Rub in butter with your fingers until mixture is sandy. Press into the greased baking pan.",
        "Bake crust in the preheated oven until golden brown around the edges, about 10 minutes.",
        "Beat 1/2 cup butter and 1/2 cup white sugar in a bowl with an electric mixer until creamy. Beat in eggs one at a time. Mix in mashed sweet potatoes, milk, and vanilla extract until batter is the consistency of pancake batter. Pour over the crust.",
        "Bake in the preheated oven until sweet potato layer is firm, about 30 minutes.",
        "Whisk water, 1/2 cup white sugar, and cornstarch together in a small bowl until smooth.",
        "Pour coconut milk into a 5-quart saucepan. Bring to a simmer over low heat, about 5 minutes. Pour in water mixture, whisking constantly until coconut milk thickens, 3 to 5 minutes. Stir in shredded coconut; cook and stir until mixture thickens, about 5 minutes more.",
        "Pour coconut mixture over sweet potato layer. Refrigerate until firm, 4 hours to overnight."
    ],
    "ingredients": [
        "Crust:",
        "1 1/2 cups all-purpose flour",
        "1/3 cup white sugar",
        "3/4 cup butter, cubed",
        "Sweet Potato Layer:",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "2 eggs",
        "3 cups cooked and mashed Japanese purple sweet potatoes",
        "1/2 cup milk",
        "1 teaspoon vanilla extract",
        "Haupia Layer:",
        "1 1/4 cups cold water",
        "1/2 cup white sugar",
        "1/2 cup cornstarch",
        "2 (14 ounce) cans coconut milk",
        "2 cups shredded coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Haupia and Purple Sweet Potato Pie",
    "url": "http://allrecipes.com/recipe/257081/haupia-and-purple-sweet-potato-pie/"
}
