{
    "directions": [
        "Allow butter and eggs to stand at room temperature for 30 minutes. Meanwhile, lightly grease bottoms of three 8-inch round baking pans or two 8x8x2-inch square or 9x1-1/2-inch round cake pans. Line bottom of pans with parchment paper. Grease and lightly flour parchment paper and sides of pans. Or grease one 13x9x2-inch baking pan. Set pan(s) aside.",
        "Preheat oven to 350 degrees F. In a medium mixing bowl, stir together flour, cocoa powder, baking soda, baking powder and salt; set aside.",
        "In a large mixing bowl, beat butter with an electric mixer on medium to high speed for 30 seconds. Gradually add granulated sugar, about 1/4 cup at a time, beating on medium speed until well combined (3 to 4 minutes). Scrape sides of bowl; continue beating on medium speed for 2 minutes. Add eggs, one at a time, beating after each addition (about 1 minute total). Beat in vanilla.",
        "Alternately add flour mixture and milk to beaten mixture, beating on low speed just until combined after each addition. Beat on medium to high speed for 20 seconds more. Spread batter evenly into the prepared pan(s).",
        "Bake for 35 to 40 minutes for 8-inch square pans and the 13x9x2-inch pan, 30 to 35 minutes for 8- or 9-inch round pans, or until a wooden toothpick inserted in the center comes out clean. Cool cake layers in pans for 10 minutes. Remove from pans. Peel off parchment paper. Cool thoroughly on wire racks. Or place 13x9x2-inch cake in pan on a wire rack; cool thoroughly. Frost with desired frosting.",
        "To prepare frosting, in a large saucepan, melt semisweet chocolate chips and butter over low heat, stirring frequently. Cool for 5 minutes. Stir in sour cream. Gradually add powdered sugar, beating with an electric mixer until smooth. This frosts tops and sides of two or three 8- or 9-inch cake layers. (Halve the recipe to frost the top of a 13x9x2-inch cake.) Cover and store frosted cake in the refrigerator."
    ],
    "ingredients": [
        "3/4 cup butter, softened",
        "3 eggs",
        "2 cups all-purpose flour",
        "3/4 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 cups granulated sugar",
        "2 teaspoons vanilla extract",
        "1 1/2 cups milk",
        "Chocolate-Sour Cream Frosting:",
        "1 (12 ounce) package semisweet chocolate chips",
        "1/2 cup butter",
        "8 ounces sour cream",
        "4 1/2 cups sifted powdered sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "\"HAVE MERCY!\" Triple Chocolate Cake",
    "url": "http://allrecipes.com/recipe/256135/have-mercy-triple-chocolate-cake/"
}
