{
    "directions": [
        "For the roast pork: In a small bowl, combine the brown sugar, coriander, garlic powder, onion powder, salt, black pepper, cinnamon and cumin to make a dry rub. Massage the rub over the pork, making sure to rub it in between the scored fat cap. Wrap the pork in plastic wrap and let it sit for 2 hours or overnight in the fridge.",
        "Preheat the oven to 325 degrees F with the oven rack in the middle position.",
        "Remove the plastic wrap from the pork and place in a Dutch oven with a lid. Cover and place in the oven to roast for 3 hours. After 3 hours, uncover and cook for another 45 minutes to brown the fat and cook until the pork registers 200 degrees F on an instant-read thermometer. Remove from the oven and let rest for 20 minutes.",
        "For the sandwich build: Using two forks or your hands, pull apart the warm pork. Toss with the Chile Sauce. Butter and toast the buns until golden brown. Place ample quantities of pork on the bottom bun and top with Grilled Pineapple Relish and shredded red cabbage. Do your best hula dance and enjoy.",
        "Bring the vinegar, sugar, crushed red pepper, salt and garlic to a boil and cook until the sugar and salt dissolve. Simmer for 5 to 10 minutes, and then set aside until the pork is ready. Right before you toss in the pork, remove the smashed garlic cloves.",
        "Preheat a grill pan or grill over high heat. Rub the grill with a bit of oil and grill each side of the pineapple slices until dark grill marks appear, 3 to 5 minutes a side. Roughly chop the pineapple and add it to a bowl with the cilantro, ginger, lime juice, jalapeno and onions. Season with salt and pepper."
    ],
    "ingredients": [
        "1/4 cup light brown sugar",
        "1 tablespoon ground coriander",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 tablespoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground cumin",
        "1 boneless pork butt or shoulder, fat cap scored (about 5 pounds)",
        "Sweet Chile Sauce, warmed, recipe follows",
        "Unsalted butter, softened, to toast rolls",
        "4 soft potato rolls or sweet Hawaiian bread rolls",
        "Grilled Pineapple Relish, recipe follows",
        "Shredded red cabbage, to garnish",
        "2 cups rice vinegar",
        "1 cup brown sugar",
        "1 tablespoon crushed red pepper",
        "1 teaspoon kosher salt",
        "4 cloves garlic, smashed",
        "Oil, for grilling",
        "1 fresh pineapple, skinned, cored and cut into 1-inch slices",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon peeled and grated fresh ginger",
        "1 lime, juiced",
        "1 jalapeno, seeded and diced",
        "1/2 red onion, diced",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Pulled Pork",
        "Fruit",
        "Pineapples",
        "Meat",
        "Pork",
        "Main Dish Recipes",
        "Grilling"
    ],
    "title": "Hawaiian BBQ Pulled Pork Sandwich with Grilled Pineapple Relish",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/hawaiian-bbq-pulled-pork-sandwich-with-grilled-pineapple-relish-recipe"
}
