{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray, or butter the pan well and coat inside with flour to prevent sticking.",
        "Beat the cake mix, water, eggs, vegetable oil, 1 package of coconut cream pudding mix, and 1 tablespoon of rum extract in a bowl with an electric mixer until smooth, about 2 minutes. Gently fold in the crushed pineapple. Pour the batter into the prepared baking pan.",
        "Bake in the preheated oven until the cake has risen, turned golden brown, and a toothpick inserted into the center of the cake comes out clean, 30 to 35 minutes. Cool the cake to room temperature in the pan on a wire rack, about 30 minutes.",
        "While the cake is baking, spread 2 tablespoons of flaked coconut onto a baking sheet, and bake in the preheated oven until lightly toasted, about 10 minutes. Remove the coconut, allow to cool, and set aside.",
        "To make frosting, whisk 1 package coconut cream pudding mix with milk until the mixture turns thick and creamy, about 2 minutes. Gently fold in the whipped topping, 1/4 cup flaked coconut, coconut extract, and 1 teaspoon of rum extract. Frost the cake, and sprinkle toasted coconut on top. Keep refrigerated."
    ],
    "ingredients": [
        "1 (18.25 ounce) package white cake mix",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "1 (3.5 ounce) package instant coconut cream pudding mix",
        "1 tablespoon rum-flavored extract",
        "1 (8 ounce) can crushed pineapple, undrained",
        "2 tablespoons flaked coconut",
        "1 (3.5 ounce) package instant coconut cream pudding mix",
        "1/2 cup milk",
        "1 (8 ounce) container extra-creamy frozen whipped topping, thawed",
        "1/4 cup flaked coconut",
        "1 tablespoon coconut extract",
        "1 teaspoon rum-flavored extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hawaiian Frosted Cake",
    "url": "http://allrecipes.com/recipe/214705/hawaiian-frosted-cake/"
}
