{
    "directions": [
        "Place black-eyed peas into a large bowl and cover with several inches of cool water; soak 8 hours to overnight. Drain and rinse.",
        "Place black-eyed peas into a large pot and fill with water 1/2-inch above the peas; bring to a simmer. Add pork jowl, tasso ham, 1 chopped onion, 1 stalk celery, 2 cloves minced garlic, bay leaves, parsley, basil, and Worcestershire sauce; cook at a simmer until peas are tender, 2 to 3 hours.",
        "Remove and discard pork jowl, celery stalk, and bay leaves from the pea mixture.",
        "Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, leaving 2 to 3 tablespoons bacon drippings in the skillet. Crumble bacon when cooled.",
        "Cook and stir 2 cups onion, 2 cups celery, green bell pepper, and 3 cloves garlic in the hot bacon drippings over medium heat until onion is tender, about 10 minutes.",
        "Mix onion mixture, tomatoes with green chiles, bacon, and andouille sausage into pea mixture. Season with sugar, salt, and pepper. Simmer pea mixture until flavors have blended, 1 1/2 hours."
    ],
    "ingredients": [
        "2 pounds dried black-eyed peas",
        "1 1/2 pounds smoked pork jowl, cut into 4 pieces",
        "1 pound tasso ham, cut into 1/2-inch pieces",
        "1 onion, chopped",
        "1 stalk celery",
        "2 cloves garlic, minced",
        "3 bay leaves",
        "1 tablespoon dried parsley",
        "1 tablespoon dried basil",
        "1 tablespoon Worcestershire sauce",
        "8 strips bacon",
        "2 cups chopped onion",
        "2 cups chopped celery",
        "2 cups chopped green bell pepper",
        "3 cloves garlic, minced",
        "2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®), drained",
        "1 1/2 pounds smoked andouille sausage, sliced on the bias",
        "1 1/2 tablespoons white sugar",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hawg Wild Black-Eyed Peas",
    "url": "http://allrecipes.com/recipe/230425/hawg-wild-black-eyed-peas/"
}
