{
    "directions": [
        "Preheat oven to 200°F. Line a large baking sheet with parchment paper. Draw or trace 12 (3-inch) circles 1 inch apart on parchment and turn paper over on baking sheet.",
        "Put egg whites in a metal bowl set over a pan of simmering water and gently whisk constantly until barely warm. Remove bowl from heat and beat whites with a pinch of salt with an electric mixer until they just hold soft peaks. Gradually add 1/2 cup superfine sugar, beating until whites just hold stiff, glossy peaks. Fold in remaining 1/4 cup sugar, then nuts.",
        "Transfer meringue to pastry bag and pipe 12 rounds of meringue inside drawn circles on parchment. Bake in middle of oven until dry to the touch and crisp, about 1 1/2 hours. If macaroons are not crisp after 1 1/2 hours, turn off oven and let stand in oven 30 to 40 minutes more. Peel macaroons off parchment and transfer to a rack to cool (macaroons may stick if cooled on paper).",
        "Finely grate enough zest from oranges to measure 1 1/2 teaspoons. Squeeze 2 cups juice.",
        "Whisk together yolks, sugar, and potato starch in a 1-quart heavy saucepan. Gradually add juice, whisking until smooth. Cook over moderate heat, whisking constantly, until thickened and registers 170°F on an instant-read thermometer, 5 to 6 minutes. Pour through a very fine sieve into a metal bowl and stir in zest. Set bowl in a larger bowl of ice and cold water and stir occasionally until mixture is cold.",
        "Freeze in ice-cream maker until soft-frozen. Spread semifreddo on flat (bottom) side of 6 macaroons and top with remaining macaroons, flat sides down. Wrap each in plastic wrap and freeze until ready to serve.",
        "Remove zest from orange with a vegetable peeler, then remove any white pith from zest. Julienne zest. Squeeze 1 tablespoon juice.",
        "Cover zest with cold water in a small saucepan and bring to a boil. Drain in a sieve and rinse under cold water. Pat dry.",
        "Cook sugar in a dry 1-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a deep golden caramel.",
        "While caramel is cooking, bring wine and zest to a boil in a small saucepan. Tilt caramel pan and carefully pour in wine with zest (caramel will harden and steam vigorously). Cook over moderately low heat, stirring, until caramel is dissolved. Stir in orange and lemon juices, then cool.",
        "Let filled macaroons soften 20 to 25 minutes at room temperature, then serve with wine syrup."
    ],
    "ingredients": [
        "3 large egg whites",
        "3/4 cup superfine granulated sugar",
        "1/2 cup coarsely chopped blanched almonds (2 3/4 oz), toasted",
        "1/2 cup coarsely chopped hazelnuts (2 ounces), toasted",
        "9 oranges",
        "4 large egg yolks",
        "3/4 cup sugar",
        "2 tablespoons potato starch",
        "1 orange",
        "2/3 cup sugar",
        "2/3 cup dry white wine",
        "1/4 teaspoon fresh lemon juice",
        "Special equipment: parchment paper, a large pastry bag fitted with a 1-inch plain tip, and an ice-cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Ice Cream Machine",
        "Mixer",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Passover",
        "Frozen Dessert",
        "Orange",
        "Almond",
        "White Wine",
        "Spring",
        "Hazelnut",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hazelnut and Almond Macaroons with Orange Semifreddo",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-and-almond-macaroons-with-orange-semifreddo-104904"
}
