{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Toast hazelnuts in a shallow baking pan in oven until golden, about 10 minutes. (Leave oven on.) Cool slightly, then rub off any loose skins in a kitchen towel while nuts are still warm. When nuts are cool enough to handle, very finely chop.",
        "Whisk together flour, thyme, pepper, and salt in a bowl. Beat together butter and cream cheese in a large bowl with an electric mixer until combined well. Add flour mixture and mix at low speed until a soft dough forms. Gather dough into a ball, then halve dough and wrap each half in plastic wrap. Flatten each half (in plastic wrap) and form each half into a 4-inch disk. Chill until firm, about 6 hours. Bring dough tocool room temperature (this will take 15 to 20 minutes) before rolling out.",
        "Remove and discard plastic wrap from 1 half of dough, keeping other half wrapped and chilled. Put unwrapped dough in center of 1 sheet of floured parchment paper. Dust dough with flour and cover with another sheet of parchment, then roll out dough into a 9-inch round (about 1/8 inch thick). Carefully peel off top sheet of parchment and set aside. (If dough is too sticky to remove parchment cleanly, chill until firm, 10 to 20 minutes.) Repeat procedure with remaining half dough. Sprinkle hazelnuts and olives evenly over rounds of dough, then reposition top sheets of parchment on dough and press gently to help nuts and olives adhere.",
        "Remove and discard top sheets of parchment and cut each round into 16 wedges. Beginning with shortest side of 1 wedge, roll up dough as tightly as possible toward pointed end and transfer to an unlined large baking sheet. Repeat procedure with remaining wedges of dough. (If dough becomes too soft to roll up, chill until firmer.)",
        "Bake until golden, 20 to 25 minutes. Cool on baking sheet on a rack. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/3 cup hazelnuts (1 1/2 oz)",
        "1 cup all-purpose flour plus additional for dusting",
        "3/4 teaspoon dried thyme",
        "1/2 teaspoon coarsely ground black pepper",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "4 oz cream cheese, softened",
        "1/3 cup brine-cured green olives (preferably Sicilian), patted dry, pitted, and very finely chopped",
        "Special equipment: 4 (17- by 12-inch) sheets parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Olive",
        "Bake",
        "Hanukkah",
        "Cream Cheese",
        "Winter",
        "Kosher",
        "Thyme",
        "Hazelnut",
        "Gourmet"
    ],
    "title": "Hazelnut and Olive Rugelach",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-and-olive-rugelach-231170"
}
