{
    "directions": [
        "Preheat oven to 350°F. Butter an 8\"-diameter cake pan. Line with a parchment round; butter parchment. Dust pan with flour.",
        "Pulse hazelnuts and 1 tablespoon granulated sugar in a food processor until finely ground; set aside 2 tablespoons nut mixture. Whisk baking powder, salt, 1 cup flour, and remaining nut mixture in a medium bowl.",
        "Using an electric mixer on high speed, beat 1/2 cup butter and remaining granulated sugar in a large bowl until light and fluffy, about 3 minutes. Add eggs one at a time, beating to blend between additions. Reduce speed to low and mix in dry ingredients. Scrape batter into prepared pan, and sprinkle with reserved nut mixture and raw sugar.",
        "Bake until cake is golden brown and a tester inserted into the center of cake comes out clean, 40–45 minutes. Transfer pan to a wire rack; let cake cool in pan before turning out.",
        "DO AHEAD: Cake can be baked 1 day ahead. Keep wrapped tightly at room temperature.",
        "Bring granulated sugar, corn syrup, and 2 tablespoons water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Boil, swirling pan occasionally, until mixture turns a deep amber color, 8–10 minutes. Remove from heat and gradually add cream (mixture will bubble vigorously). Cook over medium heat, stirring occasionally, until smooth, about 2 minutes. Remove from heat and mix in butter and salt.Let cool slightly before serving with cake.",
        "DO AHEAD: Caramel sauce can be made 5 days ahead. Cover and chill. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature, plus more",
        "1 cup all-purpose flour, plus more",
        "1/2 cup blanched hazelnuts",
        "1 cup granulated sugar, divided",
        "1 teaspoon baking powder",
        "1/2 teaspoon kosher salt",
        "3 large eggs",
        "1 tablespoon raw or granulated sugar",
        "3/4 cup granulated sugar",
        "1 tablespoon light corn syrup",
        "3/4 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1/2 tablespoon flaky sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Valentine's Day",
        "Mother's Day",
        "Anniversary",
        "Birthday",
        "Family Reunion",
        "Shower",
        "Hazelnut",
        "Christmas Eve",
        "Engagement Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hazelnut Butter Cake with Sea Salt Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-butter-cake-with-sea-salt-caramel-51205210"
}
