{
    "directions": [
        "Whisk first 5 ingredients in medium bowl to blend. Beat butter, 1 cup powdered sugar, and citrus peels in large bowl until fluffy. Beat in egg yolks. Beat in dry ingredients in 4 additions; beat in nuts. Gather dough into ball; flatten into disk. Wrap; chill at least 1 hour and up to 1 day.",
        "Preheat oven to 325°F. Line 2 large rimmed baking sheets with parchment paper. Roll out half of dough on lightly floured surface to 1/8-inch thickness. Using 2-inch round cutter, cut out rounds. Using 3/4-inch round cutter, cut out center of half of rounds to make rings. Transfer rounds and rings to prepared sheets. Gather dough scraps; chill.",
        "Bake cookies until golden, reversing sheets after 10 minutes, about 22 minutes total. Cool completely on sheets. Repeat until all dough is used. Do ahead Store airtight at room temperature up to 2 days or freeze up to 2 weeks.",
        "Arrange cookie rings on work surface. Sift powdered sugar over. Spread 1 teaspoon jam on each cookie round. Press rings onto jam on rounds. Do ahead Can be assembled 1 day ahead. Store between sheets of waxed paper in airtight container at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking powder",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 cup powdered sugar plus more for decorating",
        "5 teaspoons (packed) finely grated orange peel",
        "2 teaspoons grated lemon peel",
        "3 large egg yolks",
        "1 1/4 cups hazelnuts, finely ground in processor (about 1 1/2 cups ground)",
        "Blackberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Berry",
        "Citrus",
        "Fruit",
        "Nut",
        "Bake",
        "Christmas",
        "Blackberry",
        "Shower",
        "Hazelnut",
        "Jam or Jelly"
    ],
    "title": "Hazelnut Linzer Cookies with Blackberry Jam",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-linzer-cookies-with-blackberry-jam-236806"
}
