{
    "directions": [
        "Place the potatoes into a large pot, and cover with water. Bring to a boil over high heat; reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. While the potatoes are boiling, mash the garlic with 1/2 teaspoon of salt into a smooth paste. Drain potatoes, then mash together with the garlic paste, butter, and pepper. Keep warm.",
        "Preheat an oven to 500 degrees F (260 degrees C).",
        "While the potatoes are cooking, Preheat an oven to 500 degrees F (260 degrees C). Pulse the hazelnuts and bread crumbs in a food processor until finely ground, but not ground into a paste. Pour onto a shallow dish. Season the halibut fillets on both sides with 1/4 teaspoon of salt. Gently press one side of the halibut fillets into the nut mixture, and set aside.",
        "Heat the olive oil and 1 tablespoon of butter in an ovenproof skillet over medium-high heat. Place the halibut fillets nut-side-up into the skillet; cook until the halibut begins to brown, 3 to 4 minutes. Turn the fillets over, and place into the preheated oven. Bake, nut-side-down until the fish flakes easily with a fork, about 5 minutes.",
        "Melt the remaining 5 tablespoons of butter in a small saucepan over medium-high heat until it turns nut brown. Stir in the vegetable broth, and bring to a simmer.",
        "To serve, mound the potatoes onto the center of each dinner plate. Place a halibut fillet on top of the mashed potatoes nut-side-up, then drizzle with the browned butter sauce."
    ],
    "ingredients": [
        "1 pound red potatoes, cut into chunks",
        "5 cloves garlic, minced",
        "1/2 teaspoon salt",
        "3 tablespoons butter",
        "1/4 teaspoon ground black pepper",
        "1/4 cup hazelnuts",
        "1/4 cup seasoned bread crumbs",
        "2 halibut fillets",
        "1/4 teaspoon salt",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "5 tablespoons butter",
        "3 tablespoons vegetable broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hazelnut Crusted Halibut with Garlic Mashed Potatoes",
    "url": "http://allrecipes.com/recipe/170582/hazelnut-crusted-halibut-with-garlic/"
}
