{
    "directions": [
        "Preheat oven to 225°F. and line 2 large baking sheets with parchment paper. Fit a large pastry bag with a 1/2-inch plain tip.",
        "In a bowl with am electric mixer beat whites with cream of tartar and salt until they just hold soft peaks. Add sugar in a stream and beat in vanilla and espresso and cocoa powders, beating until meringue holds stiff, glossy peaks.",
        "Working quickly, fold ground hazelnuts into meringue gently but thoroughly and fill pastry bag with meringue. Pipe 42 dots (each about 1/2 teaspoon) of meringue onto parchment 1/2 inch apart and top each dot with a whole hazelnut (meringue dots will anchor nuts). Pipe meringue over hazelnuts, encasing them, to form cookies about 1 inch wide and 1 3/4 inches high.",
        "Bake cookies in middle and lower third of oven, switching positions of baking sheets halfway through baking, 1 hour and 15 minutes, or until meringue os form on the outside and pale golden (cookies will fall during baking). Remove parchment with cookies from baking sheets and cool on racks (cookies will continue to crisp as they cool). Carefully peel cookies off parchment.",
        "In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth, and remove from het. Dip top half of each cookie in melted chocolate, transferring cookies, chocolate sides up, to a wax-paper-lined tray. Chill cookies until chocolate is hardened, about 15 minutes. Cookies keep, arranged in layers between sheets of wax paper in an airtight container and chilled, 5 days."
    ],
    "ingredients": [
        "3 large egg whites",
        "1/4 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "3/4 cup sugar",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon instant espresso powder",
        "1/2 teaspoon unsweetened cocoa powder (not Dutch-process)",
        "3/4 cup hazelnuts (about 3 1/2 ounces), toasted lightly and skinned and ground fine",
        "42 whole hazelnuts,toasted lightly and skinned",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Chill",
        "Hazelnut",
        "Simmer",
        "Double Boiler",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hazelnut Meringue Kisses",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-meringue-kisses-14284"
}
