{
    "directions": [
        "Position rack in center of oven and preheat to 325°F. Butter and flour 9-inch-diameter springform pan. Combine 2 tablespoons vanilla sugar and hazelnuts in processor; blend until nuts are finely ground but not pasty. Combine 6 egg yolks and remaining 1 cup plus 2 tablespoons vanilla sugar in large bowl; whisk until well blended and slightly thicker, about 2 minutes (do not use electric mixer). Whisk in hazelnut mixture. Gradually whisk in melted butter. Sift flour over batter; stir just until blended (batter will be thick; do not overmix or cake may be tough).",
        "Transfer batter to prepared pan; smooth top with offset spatula (layer will be thin). Brush top generously with egg glaze. Using back of tines of fork, deeply mark crisscross pattern atop cake, marking 3 times across in 1 direction and 3 times in opposite direction. Bake cake until deep golden on top and tester inserted into center comes out clean, about 1 hour. Cool in pan on rack 15 minutes, then remove pan sides and cool cake completely. DO AHEAD Can be made 1 day ahead. Wrap in foil and store at room temperature.",
        "Cut cake into wedges and serve with whole strawberries or with warm strawberry jam."
    ],
    "ingredients": [
        "1 1/4 cups vanilla sugar , divided",
        "1/2 cup hazelnuts, lightly toasted, husked",
        "6 large egg yolks (preferably organic)",
        "1 cup (2 sticks) salted butter, melted",
        "2 cups unbleached all purpose flour",
        "1 large egg yolk beaten with 2 teaspoons water (for glaze)",
        "Whole strawberries with stems attached or warm strawberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Strawberry",
        "Hazelnut",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Hazelnut Gâteau Breton",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-gateau-breton-238257"
}
