{
    "directions": [
        "Combine cranberries, apricots, sugar, and orange juice in heavy large saucepan. Bring to boil over high heat, stirring until sugar dissolves. Reduce heat to medium and simmer, stirring often, until filling is thick, beginning to stick to pan bottom and reduced to scant 3 cups, about 15 minutes. Cool completely. (Can be made 3 days ahead. Cover and chill.)",
        "Preheat oven to 350°F. Combine 1 cup flour and nuts in processor; blend until nuts are finely ground. Add remaining 1 cup flour, sugar, baking powder, and cinnamon; blend 15 seconds. Add butter and cut in, using on/off turns, until coarse meal forms. Add egg yolks, orange peel, and vanilla and process until moist clumps form. Gather dough into ball; divide in half. Flatten half of dough into disk; wrap and freeze 10 minutes. Press remaining half of dough over bottom and up sides of 10-inch-diameter tart pan with removable bottom. Spread filling evenly in crust.",
        "Roll out chilled dough between sheets of parchment paper to 11-inch round. Peel off paper. Cut dough into 1-inch-wide strips. Place 5 strips across top of tart, spacing 1 inch apart. Top with 5 strips arranged in opposite direction, forming lattice. Trim ends of strips; press to crust edge to seal.",
        "Bake tart until golden brown, about 40 minutes. Place tart on rack. Stir jam and 1 teaspoon water in small saucepan over medium heat until mixture boils. Brush hot glaze over lattice strips. Cool tart completely. (Can be made 1 day ahead. Cover loosely with foil and let stand at room temperature.) Push up pan bottom to release tart. Cut tart into wedges."
    ],
    "ingredients": [
        "1 12-ounce package cranberries",
        "2 15-ounce cans apricot halves in light syrup, drained, chopped",
        "1 cup sugar",
        "1/4 cup orange juice",
        "2 cups all purpose flour",
        "1 cup hazelnuts, toasted",
        "3/4 cup sugar",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 large egg yolks",
        "2 teaspoons grated orange peel",
        "1 teaspoon vanilla extract",
        "2 tablespoons apricot jam",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Cranberry",
        "Apricot",
        "Fall",
        "Hazelnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hazelnut Linzertorte with Cranberry-Apricot Filling",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-linzertorte-with-cranberry-apricot-filling-105847"
}
