{
    "directions": [
        "Place 1 tablespoon lemon juice in small bowl; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Stir butter, lemon peel and remaining lemon juice in small saucepan over low heat until butter melts. Whisk eggs, yolks and sugar in medium metal bowl to blend. Gradually whisk in butter mixture. Set bowl over saucepan of simmering water (do not let bottom of bowl touch water). Whisk constantly until mixture is thick and thermometer registers 140°F for 3 minutes, about 8 minutes total. Remove from over water. Add gelatin mixture to hot lemon curd; whisk until gelatin dissolves. Chill until curd cools to room temperature, stirring often, about 30 minutes. Beat cream in large bowl until medium peaks form. Fold whipped cream into curd. Cover; chill lemon cream until cold, at least 4 hours and up to 2 days.",
        "Preheat oven to 275°F Line 17x11x1-inch baking sheet with parchment paper, leaving 1-inch overhang at short ends. Using electric mixer, beat whites in large bowl to soft peaks. Gradually add 1 1/4 cups sugar, beating until stiff and glossy. Fold in nuts. Spread meringue in prepared pan.",
        "Bake meringue until firm and dry to touch and pale golden, about 1 hour 25 minutes. Immediately cut around pan sides to loosen. Pull parchment with meringue onto work surface. Trim meringue to 14x10 1/2-inch rectangle. Run knife under meringue to loosen from parchment. Cut meringue lengthwise into three 3 1/2-inch-wide strips. Cut crosswise into twelve 3 1/2-inch squares. Cut each square on diagonal, forming total of 24 triangles. (Can be made 2 days ahead. Store in airtight container in single layers between sheets of waxed paper.)",
        "Place 12 meringue triangles on work surface. Top each with 1/4 cup lemon cream. Place second triangle on each, pressing slightly to adhere. Run edge of spatula around assembled meringues to smooth filling at edges. Sift powdered sugar over. Transfer each dessert to plate. Drizzle with Blood Orange Syrup."
    ],
    "ingredients": [
        "3/4 cup fresh lemon juice",
        "1 teaspoon unflavored gelatin",
        "6 tablespoons (3/4 stick) unsalted butter",
        "2 tablespoons plus 2 teaspoons grated lemon peel",
        "3 large eggs",
        "3 large egg yolks",
        "3/4 cup sugar",
        "1 cup chilled whipping cream",
        "7 large egg whites",
        "1 1/4 cups sugar",
        "1 1/2 cups hazelnuts, toasted, husked, coarsely chopped",
        "Powdered sugar",
        "Blood Orange Syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Lemon",
        "Winter",
        "Hazelnut"
    ],
    "title": "Hazelnut Meringues with Lemon Cream and Blood Orange Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-meringues-with-lemon-cream-and-blood-orange-syrup-102885"
}
