{
    "directions": [
        "1. Preheat the oven to 350°F. Line 2 baking sheets with parchment paper.",
        "2. Sift together the flour, baking powder, and salt onto a piece of waxed paper.",
        "3. In a large bowl or the bowl of an electric mixer, whisk 2 of the eggs until they are foamy. Gradually whisk in the sugar and continue whisking until the mixture is pale yellow and light, about 4 minutes. Whisk in the oil, then add the lemon zest and mix well. Mix in the dry ingredients alternately with the milk, beginning and ending with the flour mixture. Then quickly and thoroughly mix in the hazelnuts.",
        "4. Turn out the dough onto a lightly floured work surface and divide it in half. Shape each half in an 8-inch-long log and 2 inches thick. Flatten the tops slightly and place the logs about 2 inches apart on one of the prepared baking sheets. Mix the remaining egg with 2 teaspoons water for an egg wash and brush it lightly on the logs.",
        "5. Bake the logs in the center of the oven until they are puffed and golden, 25 to 30 minutes. Remove from the oven and let cool on a wire rack for 10 minutes. Leave the oven on.",
        "6. With a sharp knife, cut each of the logs on the diagonal into about 24 pieces. Place the slices, cut side down, on the parchment-lined sheets and bake until they are golden on one side, about 15 minutes. Turn the slices and bake until golden on the other side, about 10 minutes more. Remove from the oven and let cool on wire racks."
    ],
    "ingredients": [
        "3 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "3/4 teaspoon fine sea salt",
        "3 large eggs",
        "1 1/4 cups vanilla sugar",
        "1/4 cup extra-virgin olive oil",
        "The zest of 3 lemons, minced",
        "1/2 cup whole milk",
        "1 cup hazelnuts, toasted and skinned"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Bake",
        "Lemon",
        "Hazelnut"
    ],
    "title": "Hazelnut and Lemon Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-and-lemon-cookies-104454"
}
