{
    "directions": [
        "Combine the chocolate chips and oil in a microwave-safe measuring cup or ceramic bowl. Stir until all of the chips are coated with oil. Microwave for 1 minute at 60% power. Stir. Heat at full power at 15-second intervals until the chocolate is melted, stirring after every interval. (This will take between 1 to 3 minutes, depending on your microwave.)",
        "Arrange 24 paper bonbon or candy cups on a baking sheet. Pour a small amount (about 2 teaspoons) of the melted chocolate mixture into each cup. Tip the cups to coat the insides fully with chocolate. Transfer the coated cups to the refrigerator. Reserve remaining chocolate.",
        "Pour the cup of heavy cream, vanilla extract, and coffee liqueur in a mixing bowl. Beat on high speed until frothy. Add the 2 teaspoons of sugar and continue to beat on high until soft peaks form. Stir in the hazelnut spread and beat on medium speed until combined. Quickly fold in the reserved melted chocolate. (If the chocolate has started to set up, place in microwave again for 10 seconds at 60% power.)",
        "Fill a pastry bag with the mousse filling and pipe it into each chocolate cup. (If a pastry bag is unavailable, use a  resealable plastic storage bag and snip off a corner.) You may need to use a spoon to smooth the tops. Chill the filled shells in the refrigerator for at least 4 hours.",
        "Whip the 1/2 cup of cream until frothy; add the teaspoon of sugar and whip until stiff peaks form. Use a pastry bag to top each chocolate cup with a small dollop of whipped cream. Sprinkle with chopped hazelnuts and top with a coffee bean. Refrigerate until serving."
    ],
    "ingredients": [
        "Chocolate Shells:",
        "1 1/4 cups bittersweet chocolate chips",
        "1 teaspoon vegetable oil",
        "Filling:",
        "1 cup heavy cream",
        "1 teaspoon vanilla extract",
        "3 tablespoons coffee flavored liqueur (such as Kahlua®)",
        "2 teaspoons white sugar",
        "1/2 cup chocolate-hazelnut spread (such as Nutella®)",
        "Garnish:",
        "1/2 cup heavy cream",
        "1 teaspoon white sugar",
        "2 tablespoons chopped hazelnuts, for garnish",
        "24 chocolate-covered coffee beans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hazelnut Cups",
    "url": "http://allrecipes.com/recipe/213126/hazelnut-cups/"
}
