{
    "directions": [
        "Preheat oven to 350°F. Spray large baking sheet with vegetable oil spray. Mix flour, baking powder, salt and cinnamon in medium bowl; set aside. Coarsely chop hazelnuts in processor. Transfer to small bowl. Combine sugar and butter in processor; blend until fluffy. Add orange peel and vanilla extract and blend well. Add eggs 1 at a time, blending just until incorporated after each addition. Add flour mixture; mix using on/off turns until just blended. Mix in hazelnuts using on/off turns until just blended.",
        "Turn dough out onto floured work surface. Divide dough in half. Roll each half into 9-inch-long, 2-inch-wide log. Space logs 3 inches apart on prepared baking sheet. Flatten each to 12-inch-long, 2 1/2-inch-wide log. Bake until very light golden and firm to touch, about 25 minutes. Cool on baking sheet 5 minutes. Maintain oven temperature.",
        "Using metal spatula, transfer logs to work surface. Using serrated knife, cut logs diagonally into 3/4-inch-wide slices. Place slices, cut side down, on large baking sheet. Bake 15 minutes. Turn biscotti over; bake until light golden and firm, about 15 minutes longer. Transfer biscotti to racks and cool. (Can be made 3 days ahead. Store airtight at room temperature.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3 cups all purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cinnamon",
        "1 cup hazelnuts, toasted, husked (about 4 ounces)",
        "3/4 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 tablespoon grated orange peel",
        "1 teaspoon vanilla extract",
        "3 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Hazelnut",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hazelnut-Cinnamon Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-cinnamon-biscotti-5189"
}
