{
    "directions": [
        "Preheat oven to 350°F. Spray 15x10x1-inch baking sheet with vegetable oil spray. Line with parchment paper. Butter parchment. Combine nuts, sugar and flour in processor. Process until nuts are finely ground. Beat egg whites in large bowl until stiff peaks form. Fold nut mixture into whites in 3 additions (whites will deflate). Spread on prepared baking sheet. Bake until cake starts to pull away from sides of baking sheet and is light golden on top, about 35 minutes (cake will be slightly moist). Cool cake 10 minutes.",
        "Line large baking sheet with parchment paper. Invert cake onto parchment. Cool cake completely.",
        "Place chocolate in large bowl. Bring cream to simmer in heavy medium saucepan. Pour over chocolate and whisk until smooth. Chill until firm enough to spread, at least 6 hours or overnight. (Cake and chocolate ganache can be made 1 day ahead. Cover cake tightly with plastic wrap; leave at room temperature. Keep ganache refrigerated. Let stand at room temperature until spreadable.)",
        "Beat cream in large bowl until soft peaks form. Gradually add sugar and 1/4 cup amaretto, beating until stiff peaks form. Fold in chopped hazelnuts and chocolate.",
        "Line 2-quart bowl with plastic wrap, overlapping sides by 2 inches. Cut cake lengthwise into 1/3-inch-wide slices. Line bowl with cake, placing slices cut side down and tightly side by side in single layer, trimming to fit and completely covering bowl (if cake slices break, piece together to fit). Brush cake with 1 1/2 tablespoons amaretto. Spread ganache over cake, covering completely. Spoon hazelnut cream into center; smooth top. Cover filling with cake, placing slices side by side, fitting tightly together and trimming to fit. Brush with 1 1/2 tablespoons amaretto. Cover; chill at least 4 hours and up to 3 days.",
        "Uncover cake. Invert onto platter. Remove plastic. Sift cocoa powder and powdered sugar over. Serve with berries."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 2/3 cups blanched slivered almonds (about 11 ounces), toasted",
        "1 3/4 cups hazelnuts (about 7 ounces), toasted",
        "2 cups sugar",
        "1/2 cup cake flour",
        "9 large egg whites",
        "10 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 cups whipping cream",
        "2 cups chilled whipping cream",
        "1/4 cup sugar",
        "1/4 cup plus 3 tablespoons amaretto or other almond liqueur",
        "1/2 cup hazelnuts, toasted, husked, chopped (about 2 ounces)",
        "1/3 cup finely chopped semisweet chocolate (about 2 ounces)",
        "Unsweetened cocoa powder",
        "Powdered sugar",
        "Fresh raspberries and blackberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Almond",
        "Amaretto",
        "Chill",
        "Hazelnut",
        "Simmer"
    ],
    "title": "Hazelnut Dome Cake",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-dome-cake-4246"
}
