{
    "directions": [
        "Preheat oven to 350°F. Toast hazelnuts on a large rimmed baking sheet until skins are slightly darkened and split, 12–15 minutes. Let cool, then bundle in a kitchen towel and rub vigorously to remove skins (there will definitely be some stubborn pieces that refuse to come off—do what you can). Transfer to a food processor and pulse until finely ground. Whisk hazelnuts, powdered sugar, buckwheat flour, and salt in a medium bowl to combine.",
        "Cook butter in a small saucepan over medium heat until it foams, then browns (be careful not to let it burn), 5–7 minutes. Let cool slightly.",
        "Whisk egg whites in a medium bowl until foamy (you’re not trying to create volume; you just want to break them up), then whisk into dry ingredients. Whisk in brown butter. Cover and chill batter until firm, at least 2 hours.",
        "Reheat oven to 350°F. Generously coat six 4-oz. fluted financier molds or a standard 12-cup muffin pan with nonstick spray. Divide batter among molds (use about 1/3 cup batter per mold, or 2 mounded Tbsp. if using a muffin pan). Top with figs (if using) and sprinkle with demerara sugar. Bake until tops are browned and edges are firm, 20–25 minutes. Transfer pans to a wire rack and let financiers cool 10 minutes in pans before turning out onto racks. Let cool completely.",
        "Batter can be made 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "3/4 cup skin-on hazelnuts",
        "1 1/4 cups powdered sugar",
        "1/3 cup buckwheat flour",
        "3/4 teaspoon kosher salt",
        "1/2 cup (1 stick) unsalted butter",
        "4 large egg whites",
        "Nonstick vegetable oil spray",
        "3 fresh or dried figs, cut lengthwise into 6 wedges (optional)",
        "Demerara or raw sugar (for sprinkling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Wheat/Gluten-Free",
        "Hazelnut",
        "Fig",
        "Bake",
        "Christmas",
        "Winter",
        "Dried Fruit",
        "Dessert"
    ],
    "title": "Hazelnut and Buckwheat Financiers With Figs",
    "url": "http://www.epicurious.com/recipes/food/views/hazelnut-buckwheat-financiers-with-figs"
}
