{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Generously coat the bottom of a 13x9-inch baking dish with 1 tablespoon olive oil.",
        "Season cut sides of tomatoes with salt and pepper.",
        "Heat olive oil in a skillet over medium heat. Arrange tomato halves into the skillet with the cut sides facing down. Reduce heat to medium-low, place a cover on the skillet, and cook tomatoes until warmed through, about 5 minutes.",
        "Pour water over the tomatoes, again cover the skillet, and continue cooking tomatoes until the skins begin to wrinkle and loosen from the flesh, about 5 minutes. Remove skins with tongs and discard. Mash tomatoes in the skillet until smooth.",
        "Reduce heat to low. Stir onion, bell pepper, celery, wine, tomato paste, parsley, basil, and garlic into the mashed tomatoes. Bring the mixture to a simmer and cook until the liquid reduces to about 2/3 its original volume, 10 to 15 minutes.",
        "Bake in preheated oven until the edges begin to brown, 25 to 30 minutes.",
        "Slice about 1/2 inch off each end of the eggplant; cut eggplant lengthwise into 6 equal slices. Lay each eggplant slice into the prepared baking dish; flip so both sides of each slice are coated in oil.",
        "Spoon tomato mixture in an even layer over the eggplant slices. Spread Gouda cheese over the tomato mixture in an even layer. Sprinkle Parmesan cheese evenly over the Gouda."
    ],
    "ingredients": [
        "1 tablespoon olive oil, or more as needed",
        "6 plum (Roma) tomatoes, halved",
        "1 pinch salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "1/2 cup water",
        "1 small white onion, chopped",
        "1 small orange bell pepper, diced",
        "1 stalk celery, chopped",
        "1/4 cup red wine",
        "1/2 (6 ounce) can tomato paste",
        "1/4 cup finely chopped fresh parsley",
        "6 fresh basil leaves, or more to taste, finely chopped",
        "1 eggplant",
        "1 tablespoon minced garlic",
        "1/2 cup shredded Gouda cheese",
        "1/2 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Healthy Eggplant Parmesan (No Frying Required)",
    "url": "http://allrecipes.com/recipe/237756/healthy-eggplant-parmesan-no-frying/"
}
