{
    "directions": [
        "Heat a Dutch oven or large skillet over medium heat; cook and stir turkey sausage, ground turkey, onion, and garlic until well browned, about 15 minutes. Stir in crushed tomatoes, tomato paste, tomato sauce, and water.  Season with basil, fennel seeds, Italian seasoning, pepper, and 2 tablespoons parsley.  Simmer, uncovered, for about 1 1/2 hours, stirring occasionally.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Spread 1 1/2 cups turkey sauce in bottom of 9x13 baking dish. Arrange 6 noodles lengthwise over sauce.  Spread half the ricotta over noodles. Top with a third of the mozzarella cheese slices. Spoon 1 1/2 cups turkey sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers and top with remaining mozzarella and Parmesan cheese. Cover with aluminum foil; make sure foil does not touch cheese to prevent sticking.",
        "Bake in preheated oven until sauce is hot and cheese is melted, about 25 minutes more. Remove foil and bake until cheese is golden brown, about 25 minutes. Cool 15 minutes before serving."
    ],
    "ingredients": [
        "1 pound turkey sausage",
        "3/4 pound lean ground turkey",
        "1/2 cup minced onion",
        "2 cloves garlic, crushed",
        "1 (28 ounce) can crushed tomatoes",
        "2 (6 ounce) cans tomato paste",
        "2 (6.5 ounce) cans canned tomato sauce",
        "1/2 cup water",
        "1 1/2 teaspoons dried basil leaves",
        "1/2 teaspoon fennel seeds",
        "1 teaspoon Italian seasoning",
        "1/4 teaspoon ground black pepper",
        "2 tablespoons chopped fresh parsley",
        "12 lasagna noodles",
        "16 ounces ricotta cheese",
        "3/4 pound low fat mozzarella cheese, sliced",
        "3/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Healthier World's Best Lasagna",
    "url": "http://allrecipes.com/recipe/222087/healthier-worlds-best-lasagna/"
}
