{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Cover the outside of a 9-inch springform pan with double layers of aluminum foil.",
        "Mix together cookie crumbs, 1 tablespoon sugar, and melted butter in a bowl. Press mixture into bottom of pan.",
        "Combine raspberries, 2 tablespoons sugar, cornstarch, and water in a saucepan. Bring to boil and continue boiling until sauce is thick, about 5 minutes. Strain sauce through a mesh strainer to remove seeds.",
        "Melt white chocolate chips with milk in a metal bowl over a pan of simmering water, stirring occasionally until smooth.",
        "Mix together Neufchatel cheese and 1/2 cup sugar in a large bowl until smooth. Beat in eggs, one at a time. Blend in vanilla extract and melted white chocolate. Pour half the batter over crust. Spoon 3 tablespoons raspberry sauce over batter.  Pour remaining cheesecake batter into pan and spoon 3 more tablespoons of raspberry sauce over batter. Swirl batter with tip of knife to create marbled effect. Place pan in a roasting pan and fill roasting pan with hot water to reach halfway up outside of pan.",
        "Bake in preheated until filling is set, 55 to 60 minutes. Cool completely. Cover with plastic wrap and refrigerate for 8 hours before removing from pan.  Serve with remaining raspberry sauce."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/4815793.jpg",
    "ingredients": [
        "1 cup chocolate cookie crumbs",
        "1 tablespoon white sugar",
        "3 tablespoons butter, melted",
        "1 (10 ounce) package frozen raspberries",
        "2 tablespoons white sugar",
        "2 teaspoons cornstarch",
        "1/2 cup water",
        "2 cups white chocolate chips",
        "1/4 cup 1% milk",
        "3 (8 ounce) packages Neufchatel cheese, softened",
        "1/2 cup white sugar",
        "3 eggs",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Healthier White Chocolate Raspberry Cheesecake",
    "url": "http://allrecipes.com/recipe/222098/healthier-white-chocolate-raspberry-c/"
}