{
    "directions": [
        "Separate the stems and the florets from the broccoli. Trim and discard the bottom of the broccoli stems and peel the tough outer layers. Finely chop the stems and coarsely chop the florets and set aside separately.",
        "Mist a large pot with nonstick cooking spray and heat over medium heat. Add the broccoli stems, onions and potatoes and cook, stirring, until softened, 7 to 10 minutes. Add the flour and cook, stirring, until lightly toasted, about 2 minutes. Stir in the broth and bring to a boil. Reduce the heat to maintain a simmer and continue to cook, stirring occasionally, until thickened and the vegetables are tender, 12 to 15 minutes.",
        "Meanwhile, combine the reserved florets and 1/2 cup water in a small saucepan. Bring to a boil, cover and continue to steam until the florets are bright green and crisp-tender, about 5 minutes. Add the entire contents of the pot with the florets to the soup along with the nutmeg. Stir to combine and remove from the heat. Stir in the Cheddar, Worcestershire and milk. Season with salt and pepper. Garnish with the scallions."
    ],
    "ingredients": [
        "1 bunch broccoli",
        "1 small onion, finely chopped",
        "1 medium red-skinned potato, diced",
        "1/4 cup all-purpose flour",
        "3 cups low-sodium chicken or vegetable broth",
        "Kosher salt and freshly ground black pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "1 cup grated extra-sharp Cheddar",
        "1 teaspoon Worcestershire sauce",
        "One 12-ounce can fat-free evaporated milk",
        "2 scallions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Broccoli Soup",
        "Vegetable Soup",
        "Broccoli",
        "Soup",
        "Vegetable",
        "Healthy",
        "Cheddar",
        "Cheese",
        "Diabetes-Friendly",
        "Heart-Healthy",
        "Low-Cholesterol",
        "Low Calorie",
        "Low-Fat"
    ],
    "title": "Healthified Broccoli Cheddar Soup",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/healthified-broccoli-cheddar-soup-recipe"
}
