{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Dissolve sugar and yeast in warm water in a large bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Stir flour into yeast mixture until dough holds together. Knead dough on a lightly floured surface, until smooth and elastic, 6 to 8 minutes. Place dough in a bowl and cover with a towel; set aside until dough has risen slightly, about 30 minutes.",
        "Place peeled garlic cloves in an 8x8-inch baking dish; add olive oil, oregano, basil, marjoram, and sage.",
        "Bake garlic in the preheated oven until softened, 30 to 40 minutes. Remove from oven and cool.",
        "Coat a baking sheet with a layer of the cooled olive oil with herbs; spread dough onto the oiled baking sheet. Brush more oil and herbs on the top of dough.",
        "Mash the garlic cloves in a bowl using a garlic press or fork; stir nutritional yeast into mashed garlic. Add some of the herbed olive oil if mixture is dry. Stir tomato sauce into garlic mixture. Spread sauce over dough. Top with red onion slices.",
        "Bake in the preheated oven until crust is crunchy, 10 to 20 minutes. Arrange avocado slices over pizza."
    ],
    "ingredients": [
        "2 tablespoons white sugar",
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water",
        "1 1/2 cups all-purpose flour",
        "4 heads garlic, peeled",
        "2 cups olive oil, or as needed",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "1 teaspoon dried marjoram",
        "1 teaspoon dried sage",
        "1 cup nutritional yeast",
        "3 cups smooth tomato sauce",
        "1/2 small red onion, thinly sliced",
        "1 avocado - peeled, pitted, and sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Healthy Vegan Pizza",
    "url": "http://allrecipes.com/recipe/233459/healthy-vegan-pizza/"
}
