{
    "directions": [
        "To make the marinade, combine the garlic, parsley, thyme, orange zest, peppercorns, cloves, allspice and cinnamon stick on a square of cheesecloth. Bring the corners together and tie securely with kitchen string. Pour the wine and the 1/4 cup olive oil into a deep nonaluminum container and add the onions and cheesecloth bag.",
        "Add the beef to the marinade, stir, cover and refrigerate for 24 hours.",
        "Preheat an oven to 300°F.",
        "Remove the meat from the marinade and pat dry. Reserve the marinade and cheesecloth bag. In a heavy sauté pan over high heat, warm 2 Tbs. of the olive oil. Brown half of the meat on all sides, 5 to 10 minutes. Transfer the browned meat to a heavy pot. Add the remaining 2 Tbs. oil to the pan and brown the remaining meat. Add it to the pot. Add the reserved marinade, including the cheesecloth bag, and the tomatoes. Add water as needed just to cover. Cover the pot, bring to a boil over high heat, transfer to the oven and bake until meltingly tender, 3 to 4 hours.",
        "Meanwhile, bring a saucepan three-fourths full of salted water to a boil over high heat. Add the carrots and cook until tender when pierced with a knife, about 10 minutes. Drain and set aside.",
        "When the beef is tender, remove from the oven and discard the cheesecloth bag. Using a large spoon, skim off the excess fat from the surface. Add the carrots and olives to the pot and place over medium heat until heated through. Season with salt and pepper.",
        "Transfer the stew to a warmed serving bowl or serve directly from the pot. Sprinkle with the chopped thyme and/or parsley just before serving."
    ],
    "ingredients": [
        "4 garlic cloves, crushed",
        "3 fresh flat-leaf parsley sprigs",
        "3 fresh thyme sprigs",
        "2 orange zest strips, each 3 inches long",
        "12 peppercorns",
        "12 whole cloves",
        "2 allspice berries",
        "1 cinnamon stick",
        "1 bottle (24 fl oz.) dry red wine",
        "1/4 cup olive oil",
        "2 yellow onions, coarsely chopped",
        "2 1/2 lb. boneless stewing beef, cut into 2-inch  &nbsp cubes",
        "4 Tbs. olive oil",
        "2 cups peeled, seeded and chopped tomatoes  &nbsp (fresh or canned)",
        "3/4 lb. carrots, peeled and cut into 2-inch  &nbsp lengths",
        "2/3 cup brine-cured black olives, pitted if desired",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. chopped fresh thyme and/or flat-leaf  &nbsp parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Hearty Beef Stew",
    "url": "http://www.williams-sonoma.com/recipe/hearty-beef-stew.html"
}
