{
    "directions": [
        "Mix warm water and sugar together in a bowl until sugar is dissolved; stir in yeast. Set aside until a creamy foam starts to form, about 5 minutes.",
        "Combine bread flour, whole wheat flour, coconut oil, and salt in a food processor; pulse 4 times. Add chia seeds, wheat germ, flax seeds, millet, 1 tablespoon hemp seeds, 1 tablespoon sunflower seeds, and 1 tablespoon oats; pulse until incorporated.",
        "Pour yeast mixture over flour mixture in the food processor; process until a dough ball forms, about 1 minute.",
        "Turn dough into a well-oiled large bowl and cover with a damp towel; allow to rise in a warm area until doubled in size, about 1 hour.",
        "Punch dough down and knead a few times. Form dough into an oblong shape and place in a greased bread pan. Lightly press the remaining hemp seeds, sunflower seeds, and oats onto the loaf. Cover with a damp towel and let rise in a warm area for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake in the preheated oven until cooked through and crust is lightly browned, about 30 minutes. Cool bread in the pan for 5 minutes before transferring to a wire rack to cool completely."
    ],
    "ingredients": [
        "1 cup warm water",
        "1/4 cup white sugar",
        "1 (.25 ounce) package active dry yeast",
        "2 cups bread flour",
        "1 cup whole wheat flour",
        "1/4 cup coconut oil",
        "1 teaspoon salt",
        "1 tablespoon chia seeds",
        "1 tablespoon wheat germ",
        "1 tablespoon flax seeds",
        "1 tablespoon millet",
        "2 tablespoons hulled hemp seeds, divided",
        "2 tablespoons salted roasted sunflower seeds, divided",
        "2 tablespoons old-fashioned oats, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hearty Multigrain Seeded Bread",
    "url": "http://allrecipes.com/recipe/256230/hearty-multigrain-seeded-bread/"
}
