{
    "directions": [
        "Position a rack in the lower third of an oven and preheat to 325°F. Cut the beef into 1 1/2-inch cubes and set aside. In a large Dutch oven, cook the bacon in the oil over medium heat, stirring occasionally, until the bacon is crisp and browned, about 7 minutes. Using a slotted spoon, transfer to paper towels to drain and set aside. Pour the fat into a heatproof bowl. Return 2 Tbs. of the fat to the pot and heat over medium-high heat. Season the beef cubes with salt and pepper. In batches to avoid crowding, add the beef and cook, stirring occasionally, until browned on all sides, about 5 minutes per batch. Transfer the beef to a plate.",
        "Add another 2 Tbs. of the fat to the pot and heat over medium heat. Add the onion, carrots, celery and garlic and cook, stirring occasionally, until the onion softens, about 5 minutes. Stir in the butter and let it melt. Sprinkle with the flour and stir well. Gradually stir in the stock, and then stir in the tomato paste, the 1 Tbs. parsley and the thyme, rosemary and bay leaf. Return the beef to the pot and bring to a boil. Cover, place in the oven, and cook for 1 1/2 hours.",
        "Cut the unpeeled potatoes into 1-inch cubes, add them to the pot, stir, re-cover and continue cooking until both the meat and potatoes are tender, about 45 minutes more. Season the stew with salt and pepper. Serve at once, garnished with parsley and the reserved bacon. Serves 6.",
        "Variaton: Substitute 1 1/2 cups hearty red wine, such as Syrah or Zinfandel, for an equal amount of the beef stock. If you like, sauté 1/2 lb. cremini mushrooms, quartered, in 2 Tbs. olive oil over medium heat until browned, about 5 minutes, and add them to the stew with the potatoes.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)"
    ],
    "ingredients": [
        "3 lbs. boneless beef chuck",
        "4 thick slices applewood-smoked bacon, chopped",
        "2 Tbs. canola oil",
        "Kosher salt and freshly ground pepper",
        "1 yellow onion, chopped",
        "3 carrots, cut into chunks",
        "3 stalks celery, cut into 1/2-inch lengths",
        "2 cloves garlic, chopped",
        "2 Tbs. unsalted butter",
        "6 Tbs. all-purpose flour",
        "4 cups beef stock or broth",
        "2 Tbs. tomato paste",
        "1 Tbs. chopped fresh flat-leaf parsley, plus more for garnish",
        "1 tsp. minced fresh thyme",
        "1 tsp. minced fresh rosemary",
        "1 bay leaf",
        "1 1/4 lbs. red-skinned potatoes"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Hearty Beef Stew",
    "url": "http://www.williams-sonoma.com/recipe/hearty-beef-stew-cf.html"
}
