{
    "directions": [
        "In a kettle bring the water to a boil and in it boil the corn, covered, for 10 minutes. Transfer the corn to a colander and pour the cooking water into a large heatproof bowl. In the kettle cook the bacon over moderate heat, stirring, until it is crisp and golden and with a slotted spoon transfer it to paper towels to drain. Pour off all but 2 tablespoons of the fat from the kettle and in the remaining fat cook the leeks over moderate heat, stirring, for 5 minutes. Add the potato, peeled and diced fine, and cook the mixture , stirring, for 10 minutes. Add the corn, cut from the cobs, the reserved cooking water, the bell pepper, the jalapeño, and salt and pepper to taste and simmer the chowder for 1 hour. In a blender purée 2 cups of the chowder, return it to the kettle, and stir in the half-and-half. Heat the chowder over moderate heat, stirring, until it is hot, ladle it into bowls, and top each serving with a dollop of the pistou and some of the bacon.",
        "In a food processor purée the basil and the garlic, add the oil, the Parmesan, and salt and pepper to taste, and blend the pistou until it is smooth. Stir the pistou into soups or toss it with cooked pasta or vegatables. (The pistou may be made 1 week in advance and kept, chilled, in an airtight container.) Makes about 1 cup."
    ],
    "ingredients": [
        "10 cups water",
        "6 ears of corn, shucked",
        "1/4 pound lean bacon, chopped fine",
        "the white and pale green parts of 2 leeks, washed well and chopped",
        "1 russet (baking) potato (about 1/2 pound)",
        "1 red bell pepper, chopped fine",
        "2 fresh jalapeño chilies, or to taste, seeded and chopped fine (wear rubber gloves)",
        "1 1/2 cups half-and-half",
        "8 cups packed fresh basil leaves, rinsed and spun dry",
        "2 garlic cloves, chopped fine",
        "1/2 cup olive oil",
        "1/4 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Potato",
        "Lunch",
        "Basil",
        "Bacon",
        "Leek",
        "Corn",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Hearty Corn Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/hearty-corn-chowder-12523"
}
