{
    "directions": [
        "In an 8-quart heavy kettle cook bacon over moderate heat, stirring, until crisp and transfer with a slotted spoon to a large bowl. In fat remaining in kettle brown chuck in small batches over high heat, transferring it as browned with slotted spoon to bowl.",
        "Reduce heat to moderate and add oil. Add onions and garlic and cook, stirring, until golden. Stir in paprika, caraway seeds, and flour and cook, stirring, 2 minutes. Whisk in vinegar and tomato paste and cook, whisking, 1 minute. (Mixture will be very thick.) Stir in broth, water, salt, bell peppers, bacon, and chuck and bring to a boil, stirring. Simmer soup, covered, stirring occasionally, 45 minutes.",
        "Peel potatoes and cut into 1/2-inch pieces. Add potatoes to soup and simmer, covered, occasionally until tender, about 30 minutes. Season soup with salt and pepper. Soup may be made 3 days ahead and cooled, uncovered, before chilling, covered. Reheat soup, thinning with water if desired."
    ],
    "ingredients": [
        "5 slices bacon, chopped",
        "3 pounds boneless chuck, trimmed and cut into 1/2-inch cubes",
        "2 tablespoons vegetable oil",
        "4 medium onions (about 1 1/2 pounds), chopped fine",
        "3 garlic cloves, minced",
        "3 tablespoons paprika (preferably Hungarian sweet*)",
        "1 1/2 teaspoons caraway seeds",
        "1/3 cup all-purpose flour",
        "1/4 cup red-wine vinegar",
        "1/4 cup tomato paste",
        "5 cups beef broth",
        "5 cups water",
        "1/2 teaspoon salt",
        "2 red bell peppers, chopped fine",
        "4 large russet (baking) potatoes (about 2 1/2 pounds)",
        "*available at specialty foods shops and many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Garlic",
        "Onion",
        "Potato",
        "Bacon",
        "Bell Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Hearty Goulash Soup",
    "url": "http://www.epicurious.com/recipes/food/views/hearty-goulash-soup-11021"
}
