{
    "directions": [
        "Bring water and 2 teaspoons salt to a boil in a large Dutch oven or heavy-bottom stockpot; and chicken, cover Dutch oven, and cook until chicken is no longer pink in the center, 10 to 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Transfer chicken to a plate to cool and pour water from Dutch oven into a bowl for later use.",
        "Heat olive oil in the Dutch oven over medium heat. Cook and stir onion and green bell pepper in the hot oil until onion is soft and translucent, 4 to 5 minutes. Add garlic to onion mixture; cook and stir until garlic is fragrant, about 1 minute.",
        "Mix chicken broth, black beans, Great Northern beans, fire-roasted tomatoes, green chile peppers, chili powder, oregano, cumin, and salt to taste into onion mixture; bring to a boil, reduce  heat to medium, cover Dutch oven, and simmer until soup flavors blend, about 20 minutes.",
        "Remove bone from chicken and discard. Shred chicken meat into small pieces using your hands or a fork. Add chicken and corn to soup; cover Dutch oven and cook until corn is warmed, about 5 minutes."
    ],
    "ingredients": [
        "4 cups water",
        "2 teaspoons salt",
        "3 bone-in skinless chicken breast halves",
        "2 tablespoons olive oil",
        "1 small onion, minced",
        "1 green bell pepper, minced",
        "4 cloves garlic, minced",
        "4 cups low-sodium chicken broth",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 (14.5 ounce) can Great Northern beans, rinsed and drained",
        "1 (14.5 ounce) can fire-roasted diced tomatoes",
        "1 (4 ounce) can chopped green chile peppers",
        "2 teaspoons chili powder",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons ground cumin",
        "salt to taste",
        "1 cup frozen corn"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hearty Chicken Tortilla Soup with Beans",
    "url": "http://allrecipes.com/recipe/239613/hearty-chicken-tortilla-soup-with-bea/"
}
