{
    "directions": [
        "Combine onion and 1/4 cup vinegar in a small bowl. Cover with plastic wrap, pressing directly onto surface. Chill until onion is uniformly pink, at least 4 hours.",
        "Heat a medium skillet, preferably cast iron, over medium-high. Cook tortilla and chile, turning often, until completely charred, 8-10 minutes. Let cool.",
        "Blend tortilla, chile, celery, oil, lemon juice, and remaining 2 tablespoons vinegar until very smooth. Strain through a fine-mesh sieve lined with a layer of cheesecloth into a small bowl; discard solids. Add reserved palm liquid to make 1 cup; season aguachile with salt.",
        "Combine palm and artichoke hearts, tomatoes, and radishes in a large bowl and toss with 1/2 cup aguachile; season with salt. Let sit at least 30 minutes.",
        "Just before serving, drain pickled onion and add to marinated vegetables along with cilantro. Toss to combine and transfer to a platter. Pour remaining marinade over top or serve alongside.",
        "Do ahead: Onion can be prepared 1 day ahead; keep chilled. Aguachile can be made 1 day ahead."
    ],
    "ingredients": [
        "1/2 small red onion, thinly sliced",
        "1/4 cup plus 2 tablespoons Sherry vinegar or red wine vinegar",
        "1 white corn tortilla",
        "1 habanero chile, seeds and ribs removed",
        "2 large celery stalks, cut into large pieces",
        "1/4 cup avocado oil or vegetable oil",
        "1/4 cup fresh lemon juice",
        "1 14-ounce can hearts of palm, drained, liquid reserved, halved lengthwise, cut into 1\" pieces",
        "Kosher salt",
        "1 14-ounce can quartered artichoke hearts, drained",
        "1 pint cherry tomatoes, halved",
        "4 ounces radishes, thinly sliced",
        "1/2 cup fresh cilantro leaves with tender stems",
        "Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Appetizer",
        "Side",
        "Low Fat",
        "Kid-Friendly",
        "High Fiber",
        "Lunch",
        "Artichoke",
        "Radish",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Tortillas",
        "Chile Pepper",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Hearts of Palm and Artichoke Aguachile Negro",
    "url": "http://www.epicurious.com/recipes/food/views/hearts-of-palm-and-artichoke-aguachile-negro-51264500"
}
