{
    "directions": [
        "Preheat oven to 425°F. Spray 2 large baking sheets with olive oil spray. Arrange eggplant slices and half of zucchini rounds, overlapping slightly, on 1 baking sheet. Arrange potato rounds and remaining zucchini, overlapping slightly, on second baking sheet. Spray vegetables generously with olive oil spray. Sprinkle with salt and pepper. Bake until tender and beginning to brown, about 40 minutes. Remove from oven and cool. Reduce oven temperature to 375°F.",
        "Heat 1 teaspoon oil in large nonstick skillet over medium heat. Add onion and garlic; sauté until onion is tender, adding 1 to 2 tablespoons water if mixture seems dry, about 7 minutes. Stir in oregano. Add beef; sauté until brown, breaking up with back of spoon. Add tomatoes with their juices and tomato paste, breaking up tomatoes with back of spoon. Simmer until mixture thickens slightly, about 15 minutes. Season to taste with salt and pepper. Remove from heat. Mix in 1/4 cup breadcrumbs, egg whites and cinnamon.",
        "Spray 13x9x2-inch glass baking dish with olive oil spray. Sprinkle 1/4 cup breadcrumbs over bottom of dish. Arrange potatoes in prepared dish. Spoon half of beef mixture over. Arrange eggplant slices over. Spoon remaining beef mixture over. Top with all of zucchini, overlapping slightly if necessary.",
        "Pour warm Low-Fat White Sauce over moussaka. Sprinkle 2 tablespoons cheese over. Bake until top is golden brown, about 55 minutes. Let stand 15 minutes. Cut into squares and serve."
    ],
    "ingredients": [
        "Nonstick olive oil spray",
        "2 12-ounce eggplants, peeled, each cut lengthwise in half, then cut crosswise into 1/2-inch-thick slices",
        "1 1/2 pounds medium zucchini, trimmed, cut into 1/4-inch-thick rounds",
        "1 pound red-skinned potatoes, cut into 1/4-inch-thick rounds",
        "1 teaspoon olive oil",
        "2 cups chopped onion",
        "1 tablespoon minced garlic",
        "2 teaspoons dried oregano",
        "1 pound lean ground beef sirloin or ground round",
        "1 28-ounce can whole tomatoes in juice",
        "3 tablespoons tomato paste",
        "1/2 cup plain dry white breadcrumbs",
        "2 large egg whites, beaten to blend",
        "1/4 teaspoon ground cinnamon",
        "Low-Fat White Sauce",
        "2 tablespoons grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Tomato",
        "Vegetable",
        "Bake",
        "Low Fat",
        "Dinner",
        "Casserole/Gratin",
        "Ground Beef",
        "Zucchini",
        "Winter",
        "Healthy",
        "Potluck"
    ],
    "title": "Hearty Moussaka with Low-Fat White Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/hearty-moussaka-with-low-fat-white-sauce-4989"
}
