{
    "directions": [
        "Using a blender or a food processor, finely chop 1/3 cup semisweet chocolate chips.  Place in a small mixing bowl.  Add vanilla wafer crumbs, ground hazelnuts, 2 tablespoons white sugar, and melted butter or margarine.  Mix until well combined.  Press onto the bottom and up the sides of a 9 inch springform pan.  Bake in a preheated 300 degrees F (150 degrees C) oven for 15 minutes.  Cool.",
        "In a large bowl, beat the cream cheese until fluffy.  Gradually add 1 cup white sugar; mix well.  Add the eggs and 3 tablespoons liqueur.  Mix until well blended.  Coarsely chop 1 cup of the semisweet chocolate chips, and add to the cream cheese mixture.  Stir.  Pour batter into the cooled crust.",
        "Bake at in a preheated 350 degrees F (175 degrees C) oven for 1 hour.  Let cake cool for 1 hour.  Remove outer ring from pan.  Then let cool completely.",
        "Melt 2/3 cup semisweet chocolate chips over hot (not boiling) water.  Stir until smooth.  Dip 13 hazelnuts into the chocolate, covering one-half of each nut.  Shake off the excess chocolate.  Place on a waxed-paper lined plate.  Chill until set.",
        "To the remaining melted chocolate, add sour cream.  Mix well.  Stir in 1 tablespoon liqueur.  Spread glaze on top of the cooled cheesecake.  Garnish with chocolate dipped hazelnuts."
    ],
    "ingredients": [
        "2 cups semisweet chocolate chips",
        "1 1/2 cups vanilla wafer crumbs",
        "3/4 cup toasted, ground hazelnuts",
        "2 tablespoons white sugar",
        "3 tablespoons butter, melted",
        "3 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "3 eggs, beaten",
        "3 tablespoons hazelnut liqueur",
        "13 skinned, toasted hazelnuts",
        "4 tablespoons sour cream",
        "1 tablespoon hazelnut liqueur"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Heavenly Chipped Chocolate and Hazelnut Cheesecake",
    "url": "http://allrecipes.com/recipe/9306/heavenly-chipped-chocolate-and-hazeln/"
}
