{
    "directions": [
        "Depending upon seasonal availability, choose to make either the winter pancakes or the summer pancakes: To make the winter pancakes, place the red onion in a bowl. With a pastry brush, dust the slices thoroughly with some of the cornstarch. Pull gently to separate the crescent shapes, dusting again with a bit more cornstarch. Add the carrot and sweet potato peels to the bowl and dust with the remaining cornstarch. Toss to distribute the vegetables evenly.",
        "To make the summer pancakes, with a pastry brush, dust the bitter melon slices thoroughly with some of the cornstarch, then place them in a bowl. Dust the zucchini slices and kabocha peels in a similar manner and add them to the bowl; toss to distribute evenly. Dust the shredded shiso leaves and chives with cornstarch and add them to the bowl; toss again to distribute evenly.",
        "Make the batter just before frying: Place the ice cubes in a small bowl with half of the water. Sift the cake flour over the water and stir to mix slightly; there should still be lumps. If needed, add water, a few drops at a time, until the batter is the consistency of a thin pancake batter.",
        "Pour the vegetable oil to a depth of 1 1/2 inches into a small wok or small, deep skillet. Add the sesame oil and heat slowly. Check the temperature with an unvarnished long wooden chopstick (or a bamboo skewer). Small bubbles will form around the tip when the oil is about 350°F. Wait for about 45 seconds longer to allow the temperature to rise a bit more—to about 370°F—and then test the oil temperature with a few drops of batter. If they sink slightly, then rise to the surface and puff quickly but do not color, the oil is ready. You may need to fry the pancakes in batches to avoid crowding them in the pan. Preheat the oven to 200°F for keeping the cooked pancakes warm.",
        "Spoon a bit of the batter over the cornstarch-dusted vegetables and toss lightly to coat the vegetables with the batter. Dip a large spoon or ladle into the hot oil. Place one-eighth of the vegetable mixture in the bowl of the oil-dipped spoon. Carefully tilt the spoon to slide the pancake into the hot oil, aiming to make a disk about 2 inches in diameter. The batter and cornstarch act as \"glue\" to keep the vegetable slivers together. Repeat to make more pancakes, being careful not to crowd the pan.",
        "Most important, refrain from touching the pancakes for a full 30 seconds after you place them in the oil. It will seem like an eternity, but gaman will yield the best results. If wayward bits are strewn at the edges of your pan, carefully pick them up and place them on top of the still-moist pancake batter in the center. (Skill with long chopsticks will be well rewarded, though a long-handled fine-mesh skimmer can scoop beneath as well.) If the center of the pancake is very dry, dip the wayward bits in some fresh batter before \"gluing\" them in place. When the batter in the center of the disk seems barely moist, carefully invert the pancake.",
        "After flipping, allow the pancakes to fry undisturbed for about 1 minute, or until crisp. Using cooking chopsticks or a skimmer, remove the pancakes from the oil and place them on a rack set over a baking sheet to drain. If frying in batches, place the baking sheet in the oven to keep the fried pancakes warm. Use the skimmer to clear the oil of batter bits between batches.",
        "When all of the pancakes are fried, transfer them to paper towels to absorb any additional surface oil."
    ],
    "ingredients": [
        "1/2 red onion, cut into thin slices through the stem end to make crescent shapes (about 1/3 cup)",
        "1 tablespoon cornstarch",
        "Scant 1/3 cup julienne-cut carrot peels (1-inch strips; about 3 ounces)",
        "Scant 1/3 cup julienne-cut Japanese-style sweet potato or other sweet potato peels (1-inch strips; about 2 1/2 ounces)",
        "3-ounce chunk bitter melon, cut in half lengthwise, seeds removed, very thinly sliced, salted with 1/4 teaspoon salt, and drained, about 1/4 cup",
        "1 tablespoon cornstarch",
        "2 small zucchini, about 4 ounces total weight, tops trimmed, cut in half lengthwise, and then cut on the diagonal into thin slices, about 2/3 cup",
        "Scant 1/3 cup julienne-cut kabocha squash peels (3/4-inch strips; about 3 ounces)",
        "2 tablespoons finely shredded summer herbs such as fresh shiso leaves",
        "4 or 5 fresh chives, cut into 1/2-inch lengths",
        "Several ice cubes",
        "1/3 cup cold water",
        "1/4 cup self-rising cake flour",
        "Vegetable oil for deep-frying",
        "1 to 2 teaspoons aromatic sesame oil (optional)",
        "1/4 teaspoon kosher salt",
        "Generous pinch of kona-zanshõ",
        "Generous pinch of tõgarashi",
        "Generous pinch of freshly ground black pepper",
        "Lemon or lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Appetizer",
        "Vegetarian",
        "Carrot",
        "Squash",
        "Zucchini",
        "Vegan",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Heaven-and-Earth Tempura Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/heaven-and-earth-tempura-cakes-363169"
}
