{
    "directions": [
        "Core tomatoes and cut a shallow X in bottom of each, then blanch tomatoes in boiling water 10 seconds. Transfer with a slotted spoon to an ice bath to stop cooking.",
        "Peel tomatoes using tip of a small paring knife, reserving skins. With tomatoes standing on stem ends, cut off outer layer of flesh (follow curve of tomato) from each side, leaving seedy interior and reserving flesh and interior (with juices) separately.",
        "Very lightly oil terrine, then line long sides and bottom with a sheet of plastic wrap, smoothing any wrinkles and allowing at least 2 inches of overhang on each side.",
        "Whisk gelatin into cooled 1/2 cup broth and let stand 5 minutes for gelatin to soften. Add to hot broth, stirring until gelatin has dissolved. Put gelatin mixture in a metal bowl and quick-chill by setting bowl in an ice bath and stirring occasionally until cool.",
        "Stir herbs into cooled gelatin mixture and continue to stir (in ice bath) until it has a syrupy consistency.",
        "Pour enough gelatin mixture into terrine to come 1/4 inch up sides. Put terrine in freezer 10 minutes to set gelatin.",
        "Completely cover set gelatin with a layer of tomato, rounded sides down. Pour a little of cooled (but not set) gelatin mixture over tomatoes to just cover them. Continue layering tomatoes and gelatin mixture. (Work quickly to keep gelatin mixture from setting; if it begins to set, remelt over barely simmering water, then quick-chill in ice bath, stirring gently, until syrupy.) Pour a final layer of gelatin mixture over top, letting it seep into spaces between tomatoes (make sure gelatin mixture covers tomatoes).",
        "Pour any remaining gelatin mixture into a shallow bowl and chill separately. Gently push down on surface of terrine to make sure there aren't any air pockets, then chill in refrigerator, covered, at least 8 hours.",
        "Run a thin knife along short sides (ends) of terrine, then invert onto a cutting board or a platter, gently pulling on plastic overhang to help unmold (discard plastic wrap). Carefully slice terrine with an electric knife or a very sharp thin knife, using a metal spatula to hold outside of each slice steady and transferring each slice to a plate. Drizzle with a little olive oil and sprinkle with sea salt. Chop extra gelatin (from bowl) and serve on the side."
    ],
    "ingredients": [
        "4 1/2 pounds mixed heirloom tomatoes (2 to 2 1/2 inches)",
        "8 cups water",
        "1 medium onion, finely chopped",
        "2 medium carrots, finely chopped",
        "2 celery ribs, finely chopped",
        "2 medium zucchini, finely chopped",
        "1 ear of corn, kernels removed (reserve cob)",
        "1 large turnip, finely chopped (1 1/2 cups)",
        "4 large fresh shiitake mushrooms, chopped",
        "1 bunch parsley (leaves and stems), chopped",
        "1/2 cup mixed chopped herbs such as basil, tarragon, and chives",
        "3 tablespoons unflavored gelatin (from three 1/4-ounce envelopes)",
        "1/2 cup mixed chopped herbs such as basil, tarragon, and chives",
        "a 9 1/2- by 3-inch rectangular nonreactive terrine (2 3/4 inches deep)",
        "extra-virgin olive oil",
        "sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Tomato",
        "Buffet",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Heirloom Tomato Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/heirloom-tomato-terrine-242857"
}
