{
    "directions": [
        "Blend together flour, butter, shortening, parmesan, pepper, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until mixture resembles coarse meal with some roughly pea-size lumps. Drizzle 2 tablespoons ice water over and gently stir with a fork (or pulse in food processor) until incorporated.",
        "Gently squeeze a small handful: If it doesn't hold together without falling apart, add more water, 1 tablespoon at a time, stirring (or pulsing) after each addition until incorporated, continuing to test. (Do not overwork dough, or it will become tough.)",
        "Turn out dough onto a work surface and divide into 2 portions. With heel of your hand, smear each portion once in a forward motion to help distribute fat. Gather both portions of dough into 1 ball, then pat into a disk. Chill, wrapped in plastic wrap, until firm, about 1 hour.",
        "Preheat oven to 375°F.",
        "Roll out dough on a lightly floured surface into a 12-inch round and fit into a 9-inch round tart pan with a removable rim. Roll rolling pin over top of pan to trim dough flush with rim. Lightly prick tart shell all over with a fork.",
        "Line shell with foil and fill with pie weights or rice. Bake in middle of oven 20 minutes. Carefully remove foil and weights and bake until golden, about 15 minutes more. Cool in pan on a rack.",
        "Remove side of pan and slide shell onto a platter. Arrange one third of mozzarella in bottom of shell and drizzle with one third of pesto. Arrange one third of tomato slices, overlapping, on top of cheese. Season with salt and pepper. Repeat layering twice."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons cold vegetable shortening",
        "2 tablespoons freshly grated parmesan",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon salt",
        "2 to 4 tablespoons ice water",
        "3/4 lb fresh mozzarella (not unsalted), very thinly sliced",
        "1/2 cuppesto",
        "2 lb mixed heirloom tomatoes, sliced 3/4 inch thick",
        "Special equipment: pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Vegetarian",
        "Parmesan",
        "Summer",
        "Gourmet"
    ],
    "title": "Heirloom Tomato Tart",
    "url": "http://www.epicurious.com/recipes/food/views/heirloom-tomato-tart-105214"
}
