{
    "directions": [
        "Cut 1 round from each bread slice with cookie cutter.",
        "Cook bacon in a 10-inch heavy skillet over moderate heat until crisp, then transfer to paper towels to drain. Pour off bacon fat from skillet and reserve fat (do not clean skillet).",
        "Heat 1 1/2 tablespoons oil in skillet over moderate heat until hot but not smoking, then toast 3 bread rounds, turning over once, until golden brown, about 3 minutes total. Transfer toasts to a rack to cool and season with salt and pepper. Toast remaining 3 bread rounds in 1 1/2 tablespoons more oil in same manner.",
        "Cook shallot in 2 tablespoons reserved bacon fat and remaining 3 tablespoons oil in a small heavy saucepan over moderate heat, stirring, until softened, about 2 minutes. Add vinegar and simmer, whisking, until emulsified, about 1 minute. Season dressing with salt and pepper and keep warm, covered.",
        "Crumble bacon. Arrange bread rounds on 6 plates and divide tomato slices among them, stacking slices and sprinkling some basil and bacon between slices. Sprinkle cheese and remaining basil and bacon over and around tomatoes. Spoon some of warm bacon dressing over and around tomatoes and season with salt and pepper."
    ],
    "ingredients": [
        "6 slices firm white sandwich bread",
        "1/4 lb sliced bacon (about 5 slices)",
        "6 tablespoons olive oil",
        "1/4 cup finely chopped shallot",
        "3 tablespoons Sherry vinegar",
        "4 assorted medium heirloom tomatoes (2 lb total), cut into 1/4- to 1/3-inch-thick slices",
        "30 small fresh basil leaves",
        "1 1/2 oz blue cheese (preferably Maytag Blue), crumbled, at room temperature",
        "Special equipment: a 3-inch round cookie cutter",
        "Garnish: very small heirloom cherry or currant tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Herb",
        "Pork",
        "Tomato",
        "Appetizer",
        "Fry",
        "Cocktail Party",
        "Picnic",
        "Blue Cheese",
        "Bacon",
        "Spring",
        "Summer",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Heirloom Tomatoes with Bacon, Blue Cheese, and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/heirloom-tomatoes-with-bacon-blue-cheese-and-basil-108328"
}
