{
    "directions": [
        "Set up a heavy-duty mixer with the paddle attachment. Have all the ingredients ready before you begin cooking.",
        "Combine the water, butter, and the 1 teaspoon salt in a medium saucepan and bring to a simmer over medium-high heat. Reduce the heat to medium, add the flour all at once, and stir rapidly with a stiff heatproof or wooden spoon until the dough pulls away from the sides of the pan and the bottom of the pan is clean, with no dough sticking to it. The dough should be glossy and smooth but still moist.",
        "Enough moisture must evaporate from the dough to allow it to absorb more fat when the eggs are added: Continue to stir for about 5 minutes, adjusting the heat as necessary to prevent the dough from coloring. A thin coating will form on the bottom and sides of the pan. When enough moisture has evaporated, steam will rise from the dough and the aroma of cooked flour will be noticeable. Immediately transfer the dough to the mixer bowl. Add the mustard, herbs, and the 1 tablespoon salt. Mix for a few seconds to incorporate the ingredients and release some of the heat, then add the cheese. With the mixer on the lowest speed, add 3 eggs, one at a time, beating until each egg is completely incorporated before adding the next one. Increase the speed to medium and add another 2 eggs, one at a time, mixing well after each one. Turn off the machine. Lift some of the dough on a rubber spatula, then turn the spatula to let it run off: It should move down the spatula very slowly; if it doesn't move at all or is very dry and just falls off in a clump, beat in the additional egg.",
        "Place the dough in a large pastry bag fitted with a 5/8-inch plain tip and let it rest for about 30 minutes at room temperature. (If you have only a small pastry bag, fill it with half the dough two times.) Bring a large pot of lightly salted water to a simmer. Line a baking sheet with paper towels. Line a second baking sheet with parchment paper.",
        "Because this recipe makes such a large quantity of gnocchi, your arm may get tired: An easy way to pipe the gnocchi is to place a large inverted pot, canister, or other container that is slightly higher than the pot on the right side of the pot (left side if you are left-handed) and set the filled pastry bag on it so that the tip extends over the side and the container serves as a resting place for the bag. Twist the end of the pastry bag to push the dough into the tip. (From time to time, as the bag empties, you will need to twist the end again.) As you squeeze the back of the bag with your right hand, hold a small knife in your left hand and cut off 1-inch lengths of dough, allowing the gnocchi to drop into the pot. Pipe about 24 gnocchi per batch. First, the gnocchi will sink in the pot. Keep the water temperature hot, but do not boil. Once the gnocchi float to the top, poach them for another 1 to 2 minutes, then remove them with a slotted spoon or skimmer and drain on the paper towel–lined baking sheet. Taste one to test the timing; it may still seem slightly undercooked in the center, but it will be cooked again. Repeat with the remaining dough.",
        "When all the gnocchi have drained, place them in a single layer on the parchment-lined baking sheet, cover with plastic wrap, and refrigerate for at least 30 minutes, or up to a day. Or, for longer storage, place the baking sheet in the freezer. Once the gnocchi have frozen solid, remove them from the baking sheet and place in a freezer bag in the freezer. Before using frozen gnocchi, spread them in a single layer on a baking sheet and defrost in the refrigerator for several hours."
    ],
    "ingredients": [
        "1 1/2 cups water",
        "12 tablespoons (6 ounces) unsalted butter",
        "1 tablespoon plus 1 teaspoon kosher salt",
        "2 cups all-purpose flour, sifted",
        "2 tablespoons Dijon mustard",
        "1 tablespoon chopped chervil",
        "1 tablespoon chopped chives",
        "1 tablespoon chopped parsley",
        "1 tablespoon chopped tarragon",
        "1 cup loosely packed shredded Comté or Emmentaler cheese",
        "5 to 6 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Pasta",
        "Side",
        "Poach",
        "Dinner",
        "Tarragon",
        "Chive",
        "Parsley",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herb Gnocchi",
    "url": "http://www.epicurious.com/recipes/food/views/herb-gnocchi-231342"
}
