{
    "directions": [
        "Pat the oxtails dry, season them with salt and pepper, and in a heavy kettle brown them in batches in the oil over moderately high heat, transferring them as they are browned to a platter or shallow baking pan. To the kettle add the broth, the wine, the tomatoes with the juice, the onions, the carrots, the garlic, the bay leaf, and the oxtails with any juices that have accumulated on the platter, bring the liquid to a boil, and braise the oxtails, covered, in the middle of a preheated 325°F. oven for 4 hours. Transfer the oxtails with a slotted spoon to a bowl, reserving the liquid, let them cool, and remove the meat, discarding the bones and fat. Strain the reserved cooking liquid through a sieve into a large bowl. In another large bowl stir together the meat, the scallion, the parsley, the lemon juice, the pepper, and 2 cups of the cooking liquid until mixture is combined well, reserving the remaining cooking liquid. Rinse a loaf pan, 9 by 5 by 3 inches, with cold water (do not dry it), spoon the oxtail mixture into it, and add some of the reserved cooking liquid if necessary to just cover the oxtail mixture. Chill the terrine, covered, for 4 hours, or until it is set. The terrine may be prepared up to this point 2 days in advance and kept covered and chilled. Let the terrine stand at room temperature for 20 minutes. Run a thin knife around the edge of the terrine to loosen it, dip the pan in hot water for 20 seconds, and invert a chilled platter over it. Invert the terrine with a sharp rap into the platter and with an electric knife or a very sharp knife cut into 1/2-inch-thick slices.",
        "In a bowl whisk together the sour cream, the mayonnaise, the capers, the mustard, and the horseradish until the sauce is combined well.",
        "Line each of 8 plates with some of the lettuce, arrange a slice of the terrine on the lettuce, and spoon a dollop of the sauce over a corner of the slice. Garnish each serving with some of the pickled onions and cornichons and serve the remaining sauce separately."
    ],
    "ingredients": [
        "5 pounds meaty oxtails, trimmed of excess fat",
        "1/4 cup vegetable oil",
        "9 cups beef broth",
        "1 1/2 cups dry red wine",
        "1 14- to 16-ounce can tomatoes including the juice",
        "2 onions, chopped coarse",
        "2 carrots, chopped coarse",
        "4 garlic cloves, crushed",
        "1 bay leaf",
        "1 1/3 cups chopped scallion",
        "1/2 cup minced fresh parsley leaves",
        "3 tablespoons fresh lemon juice",
        "1/2 teaspoon black pepper",
        "1/3 cup sour cream",
        "1/4 cup mayonnaise",
        "2 tablespoons drained bottled capers, chopped",
        "1 tablespoon Dijon-style mustard",
        "2 teaspoons drained bottled horseradish, or to taste",
        "soft-leafed lettuce for serving",
        "bottled pickled onions and cornichons (French sour gherkins, available at specialty foods shops and some supermarkets) for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Onion",
        "Tomato",
        "Appetizer",
        "Carrot",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Herbed Oxtail Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-oxtail-terrine-11301"
}
