{
    "directions": [
        "Preheat oven to 400°F.",
        "Wrap beets tightly in foil and roast in middle of oven 1 to 1 1/2 hours, or until tender. Unwrap beets carefully and cool until they can be handled. Discard stems and peel beets. Beets may be prepared up to this point 1 day ahead and chilled, covered. Cut each beet into 8 wedges and cover.",
        "In a blender blend together mustard, vinegar, tarragon, salt, and pepper. With motor running add oil in a stream and blend until emulsified. Vinaigrette may be made 1 day ahead and chilled, covered.",
        "In a bowl stir together bread crumbs, tarragon, salt, and pepper. Cut each cheese round in half crosswise. Coat each piece of cheese evenly with crumb mixture, pressing gently, and transfer to a baking sheet. Goat cheese may be prepared up to this point 1 day ahead and chilled, covered loosely. Let cheese come to room temperature before proceeding.",
        "Preheat broiler.",
        "Broil goat cheese about 2 inches from heat until crumbs are lightly browned, about 2 minutes.",
        "In a bowl toss watercress and onion with half of vinaigrette. Arrange watercress mixture, beets, and goat cheese on 8 salad plates and drizzle remaining vinaigrette over beets."
    ],
    "ingredients": [
        "4 medium beets, scrubbed and trimmed, leaving about 1 inch of stems attached",
        "1 1/4 teaspoons Dijon mustard",
        "2 tablespoons white-wine vinegar",
        "1/4 teaspoon dried tarragon, crumbled",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup plus 2 tablespoons extra-virgin olive oil",
        "3/4 cup fresh bread crumbs",
        "1/2 teaspoon dried tarragon, crumbled",
        "3/4 teaspoon salt",
        "1/8 teaspoon freshly ground black pepper",
        "8 ounces Montrachet or other soft goat cheese, cut into eight 1/2-inch rounds and chilled, covered",
        "2 bunches watercress, coarse stems discarded, rinsed and spun dry (about 8 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetable",
        "Broil",
        "Roast",
        "Thanksgiving",
        "Goat Cheese",
        "Beet",
        "Watercress",
        "Gourmet"
    ],
    "title": "Herbed Goat Cheese, Roasted Beet, and Watercress Salad",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-goat-cheese-roasted-beet-and-watercress-salad-10696"
}
