{
    "directions": [
        "Preheat oven to 325°F.",
        "Spread bread cubes in 2 shallow baking pans and bake in upper and lower thirds of oven, switching position of pans halfway through baking, until golden, 25 to 30 minutes total. Cool bread in pans on racks, then transfer to a large bowl.",
        "Meanwhile, cook bacon in a 12-inch heavy skillet over moderate heat, stirring occasionally, until crisp, about 10 minutes. Transfer to paper towels to drain, reserving fat in skillet.",
        "If bacon renders less than 1/4 cup fat, add enough oil to skillet to total 1/4 cup fat. Cook onions, celery, thyme, sage, garlic, salt, and pepper in fat in skillet over moderate heat, stirring occasionally, until vegetables are softened, 8 to 10 minutes. Transfer to bowl with bread cubes, then stir in bacon, parsley, butter, and oysters. Drizzle with stock, then season with salt and pepper and toss well.",
        "Transfer stuffing to a buttered 3- to 3 1/2-quart shallow baking dish. Bake, covered, in middle of oven 30 minutes, then uncover and bake until browned, about 30 minutes more."
    ],
    "ingredients": [
        "2 loaves Italian or French bread (1 lb total), cut into 3/4-inch cubes (12 cups)",
        "1/2 lb sliced bacon, cut into 1/2-inch pieces",
        "2 to 3 tablespoons olive oil (if needed)",
        "2 medium onions, finely chopped (2 cups)",
        "1 1/2 cups chopped celery",
        "3 tablespoons chopped fresh thyme or 1 tablespoon dried thyme, crumbled",
        "1 tablespoon finely chopped fresh sage or 2 teaspoons dried sage, crumbled",
        "1 tablespoon minced garlic",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2/3 cup finely chopped fresh flat-leaf parsley",
        "1 stick (1/2 cup) unsalted butter, melted",
        "18 oysters, shucked, drained, and chopped (3/4 cup)",
        "2 1/4 cups turkey giblet stock or low-sodium chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Shellfish",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bacon",
        "Oyster",
        "Fall",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Herbed Oyster Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-oyster-stuffing-107371"
}
