{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 375°F. Spray 2 large rimmed baking sheets with nonstick spray. Melt butter with olive oil in small saucepan over medium-low heat. Combine red beets, large pinch of thyme, large pinch of savory, and 1 tablespoon melted butter mixture in medium bowl. Sprinkle with salt and pepper and toss to coat. Turn beets out onto 1 side of 1 prepared sheet. Combine all remaining vegetables and herbs, garlic, and remaining butter mixture in large bowl. Sprinkle generously with salt and pepper and toss to coat. Divide vegetable mixture between prepared baking sheets.",
        "Roast vegetables 30 minutes. Reverse baking sheets and continue to roast until all vegetables are tender, stirring occasionally, about 45 minutes longer. (Can be prepared 4 hours ahead. Let stand at room temperature. Rewarm in 350°F oven about 20 minutes.) Transfer to platter and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3 tablespoons butter",
        "1/4 cup olive oil",
        "3 large red beets, peeled, each cut into 6 wedges",
        "2 tablespoons chopped fresh thyme",
        "2 tablespoons chopped fresh summer savory",
        "8 large shallots, peeled, halved through root end",
        "3 large golden beets, peeled, each cut into 6 wedges",
        "2 acorn squash (about 2 3/4 pounds total), unpeeled, halved, seeded, each half cut into 6 wedges",
        "2 medium turnips, peeled, each cut into 6 wedges",
        "2 large parsnips, peeled, each cut crosswise into 6 pieces",
        "1 large rutabaga, peeled, cut into 12 wedges",
        "12 garlic cloves, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Vegetable",
        "Side",
        "Roast",
        "Thanksgiving",
        "Root Vegetable",
        "Squash",
        "Fall",
        "Winter",
        "Healthy",
        "Shallot",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herbed Roasted Winter Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-roasted-winter-vegetables-108829"
}
