{
    "directions": [
        "Stir yeast and sugar into warm water in measuring cup and let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.) Stir together 1 1/4 cups flour, thyme, salt, and cayenne, then make a well in center and add yeast mixture and oil, stirring to form a dough.",
        "Turn out dough onto a lightly floured surface and knead in 2 to 3 tablespoons flour (dough should be moist but not sticky). Knead until smooth and elastic, about 6 minutes, then transfer to a lightly oiled large bowl and let rise, covered with plastic wrap, in a draft-free place at warm room temperature until doubled in bulk, 1 1/2 to 2 hours.",
        "Preheat oven to 450°F.",
        "Roll out dough as thin as possible (into an 18-inch square) with a lightly floured rolling pin on a lightly floured surface. Sprinkle with kosher salt and gently press salt to help adhere. Cut dough into 1-inch squares with a pizza wheel or large sharp knife. Transfer with a lightly floured metal spatula to 3 lightly oiled baking sheets, placing squares close together.",
        "Bake in batches in middle of oven, rotating sheets halfway through baking, until bottoms are golden (tops will remain pale), 6 to 7 minutes. Transfer to a rack to cool completely. (Crackers will crisp as they cool.)"
    ],
    "ingredients": [
        "1/2 teaspoon active dry yeast (from a 1/4-ounce package)",
        "Pinch of sugar",
        "1/2 cup lukewarm (105–115ºF) water",
        "1 1/3 to 1 1/2 cups all-purpose flour",
        "2 teaspoons chopped fresh thyme or 1 teaspoon dried, crumbled",
        "1/2 teaspoon salt",
        "1/8 teaspoon cayenne",
        "2 teaspoons extra-virgin olive oil",
        "1/2 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Bake",
        "Spice",
        "Healthy",
        "Thyme",
        "Gourmet"
    ],
    "title": "Herbed Oyster Crakers",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-oyster-crakers-108121"
}
