{
    "directions": [
        "Preheat oven to 350°F. Place bread on baking sheet. Bake until slightly dry, about 5 minutes. Cool. Combine bread and herbs in processor. Blend until bread forms crumbs. Transfer crumbs to bowl. (can be made 1 day ahead. Chill.)",
        "Preheat oven to 425°F. Sprinkle lamb with salt and pepper. Heat oil in heavy large skillet over high heat. Add lamb and brown well, turning occasionally, about 10 minutes. transfer lamb to baking pan. Roast until meat thermometer inserted into center of lamb registers 130°F for medium-rare, about 20 minutes. Let lamb cool 10 minutes. brush mustard all over lamb. Dredge in breadcrumbs, coating completely, Return lamb to baking pan, meant side up. Roast until crumb feel dry but are not colored, about 3 minutes. Let lamb rest 5 minutes at room temperature.",
        "Boil wine and Port in large saucepan until reduced to 1/3 cup, about 25 minutes. Remove from heat. Add butter; whisk just until melted. Season with salt and pepper.",
        "Spoon yams and apples into center of 4 plates. Cut lamb between bones into chops. Stand 3 to 4 chops (bones facing up)in yams. Arrange onion rings atop bones. Spoon sauce around yam; serve."
    ],
    "ingredients": [
        "2 ounces crustless brioche or egg bread, cut into 1-inch pieces (about 2 cups packed)",
        "1 cup (packed) coarsely chopped fresh parsley",
        "2 teaspoons chopped fresh rosemary",
        "1 teaspoon chopped fresh thyme",
        "2 1 1/4-pound racks of lamb, fat trimmed",
        "2 tablespoons vegetable oil",
        "6 tablespoons Dijon mustard",
        "1 1/2 cups dry red wine",
        "3/4 cup tawny Port",
        "9 tablespoons butter, cut into pieces",
        "Mashed Yams and Apples",
        "Fried Onion Rings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Mustard",
        "Roast",
        "Valentine's Day",
        "Port",
        "Red Wine",
        "Winter"
    ],
    "title": "Herb-Coated Lamb with Port-Red Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/herb-coated-lamb-with-port-red-wine-sauce-4576"
}
