{
    "directions": [
        "Brush the grill grates lightly with the safflower oil. Prepare a very hot fire in a gas or charcoal grill.The fire should be bright red and flaming hot. Rub the grates with the cut side of the russet potato (the starch from the potato keeps the fish from sticking). (Note:You can use a stove top grill pan instead of an outdoor grill, if desired, although the flavor will not be quite the same.)",
        "Place the salmon on a piece of heavy-duty aluminum foil, skin side down. Drizzle the orange juice over the flesh side of the salmon. Coat evenly with the olive oil, basil, dill, salt, and pepper. Lightly press the herb leaves into the flesh so they adhere.",
        "Place the salmon flesh side down (skin side up) on the grill (reserve the foil) and cook 6 to 8 minutes.",
        "Turn the salmon over and place it skin side down on the foil. Pour the remaining orange juice over the salmon. Put the salmon in the foil on the grates over the fire and cook uncovered 8 to 10 minutes longer, until the fish starts to flake but is still a little fleshy in the center. (Note:The fish will continue to cook as it rests.) Remove from the grill and let rest, loosely covered, for 3 to 4 minutes.",
        "Remove the skin and discard. Transfer the fish to a platter or serve portions on individual plates. Serve immediately, topped with chutney and fresh herb leaves.",
        "Preheat the oven to 400 degrees.",
        "Toss the yellow pear tomatoes and red grape tomatoes with 2 tablespoons of the olive oil and the vinegar to coat evenly. Spread in a single layer on a baking pan and place in the oven to roast about 30minutes. Remove from the oven and set aside.",
        "Grate the zest from the oranges and place the zest in a bowl. Trim the peel and the white pith from the oranges and discard. Cut the oranges into sections and add them to the bowl with the zest.",
        "Add the tomatoes, scallions, ginger, and the remaining olive oil, the lemon zest, lemon juice, jalapeño, mustard seeds, fennel seeds, peppercorns, basil, salt, and pepper in a bowl and stir to mix thoroughly. Refrigerate in an airtight container until ready to use or up to 3 days."
    ],
    "ingredients": [
        "Safflower oil or canola oil, for oiling the grill",
        "1 russet potato, halved, for rubbing on the grill",
        "One 3-pound boneless salmon fillet, skin on, scales removed (Note: One side of an averagesized salmon is about 3 pounds)",
        "Juice of 1 orange",
        "2 tablespoons olive oil",
        "6 fresh basil leaves",
        "3 or 4 sprigs fresh dill",
        "Salt and freshly ground black pepper to taste",
        "2 cups Fresh Tomato-Orange Chutney (recipe follows)",
        "Fresh herb leaves, for garnish",
        "1/2 pint yellow pear tomatoes or cherry tomatoes, cut in half",
        "1/2 pint red grape tomatoes or cherry tomatoes, cut in half",
        "1/4 cup olive oil",
        "2 tablespoons balsamic vinegar",
        "2 large navel oranges",
        "4 scallions, trimmed and minced",
        "2 tablespoons peeled, grated fresh ginger",
        "Grated zest and juice of 1 lemon",
        "1 jalapeño, seeded and minced",
        "1/2 teaspoon mustard seeds",
        "1/2 teaspoon fennel seeds",
        "1 teaspoon cracked mixed peppercorns",
        "5 or 6 fresh basil leaves, cut into very thin strips (chiffonade)",
        "Salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Fruit",
        "Herb",
        "Tomato",
        "Vegetable",
        "Roast",
        "Backyard BBQ",
        "Dinner",
        "Orange",
        "Seafood",
        "Salmon",
        "Grill",
        "Grill/Barbecue",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Herb-Grilled Salmon with Fresh Tomato-Orange Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/herb-grilled-salmon-with-fresh-tomato-orange-chutney-363359"
}
