{
    "directions": [
        "Mix butter, chopped parsley, chopped sage, chopped thyme, 3/4 teaspoon salt and 1/2 teaspoon pepper in medium bowl to blend. (Can be prepared 3 days ahead. Transfer herb butter to small bowl; cover and refrigerate. Bring butter to room temperature before using.) Position rack in bottom third of oven and preheat to 350°F. Sprinkle main cavity of turkey with salt and pepper. Place whole parsley, sage and thyme sprigs and 4 shallot halves in cavity. Starting at neck end, carefully slide hand between skin and breast meat to loosen skin. Spread 3 tablespoons herb butter over breast meat under skin. Tuck wing tips under; tie legs together to hold shape. Place turkey on rack set in large roasting pan. Rub 4 tablespoons herb butter over turkey. Cover only breast area of turkey with sheet of heavy-duty foil. Scatter remaining shallots in pan around turkey.",
        "Roast turkey 30 minutes; baste with 1/2 cup broth. Continue roasting turkey for 1 1/2 hours, basting with 1/2 cup broth every 30 minutes. Remove foil from over turkey breast. Continue to roast turkey until golden brown and thermometer inserted into thickest part of thigh registers 180°F, basting with pan juices every 20 minutes, about 1 hour longer. Transfer turkey to platter. Brush with 1 tablespoon herb butter. Tent loosely with foil; let stand 20 minutes.",
        "Using slotted spoon, transfer shallots from roasting pan to plate. Pour pan juices into medium bowl; spoon off fat and discard. Add wine and 1 cup chicken broth to roasting pan. Set pan directly over 2 burners and bring broth mixture to boil, scraping up any browned bits. Continue to boil until reduced by half, about 3 minutes; pour into large glass measuring cup. Add degreased pan juices. Add enough broth if necessary to equal 3 cups liquid.",
        "Blend flour into remaining herb butter. Pour broth mixture into heavy medium saucepan and bring to boil. Gradually whisk in herb butter mixture. Add any accumulated juices from turkey platter. Boil until gravy thickens enough to coat spoon lightly, whisking occasionally, about 6 minutes. Add shallots to gravy; simmer 1 minute. Season gravy with salt and pepper. Serve turkey with gravy."
    ],
    "ingredients": [
        "3/4 cup butter, room temperature",
        "3 tablespoons chopped fresh parsley plus 3 whole sprigs",
        "2 tablespoons chopped fresh sage plus 3 whole sprigs",
        "2 tablespoons chopped fresh thyme plus 3 whole sprigs",
        "3/4 teaspoon salt",
        "1/2 teaspoon coarsely ground black pepper",
        "1 15- to 16-pound turkey, rinsed, patted dry",
        "1 1/2 pounds shallots, peeled, halved lengthwise through root end",
        "3 cups (or more) canned low-salt chicken broth",
        "1 cup dry white wine",
        "2 tablespoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Shallot"
    ],
    "title": "Herb-Roasted Turkey with Shallot Pan Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-turkey-with-shallot-pan-gravy-104300"
}
