{
    "directions": [
        "Line extra-large pot or bowl with two 13-gallon (or larger) plastic bags, 1 inside the other. Combine 1 quart water, salt, bay leaves, peppercorns, and allspice in large saucepan. Stir over medium heat until salt dissolves. Remove from heat. Add 1 quart cold water and cool to lukewarm. Pour into plastic bags; mix in remaining 6 quarts water. Wrap turkey neck and refrigerate. Submerge turkey in brine to cover completely, gathering bags tightly to eliminate any air; tie bags closed. Refrigerate turkey in brine in pot at least 18 hours and up to 20 hours.",
        "Line large roasting pan with 4 layers of paper towels. Remove turkey from brine and drain well; discard brine. Place turkey in prepared pan. Cover with plastic wrap and refrigerate overnight.",
        "Mix parsley, thyme, sage, marjoram, rosemary, and nutmeg in small bowl. Transfer 1/4 cup herb mixture to small bowl; mix in 1/2 cup butter.",
        "Combine broth and apple cider in heavy large saucepan. Boil until reduced to 3 cups, about 20 minutes. Pour broth reduction into bowl. Melt remaining 1/4 cup butter in same saucepan over medium-high heat. Add flour; stir 1 minute. Whisk in broth reduction, then cream, Calvados, and remaining herb mixture. Bring to boil; reduce heat to medium-low and simmer until gravy base is thickened and reduced to 2 3/4 cups, whisking often, about 20 minutes. Cool gravy base slightly. (Gravy base and herb butter can be made 2 days ahead. Cover and chill.)",
        "Position rack in bottom third of oven and preheat to 350°F. Remove turkey from roasting pan; drain any accumulated juices from main cavity. Discard paper towels from roasting pan. Melt herb butter in small saucepan over medium heat. Brush bottom of roasting pan with some of herb butter. Return turkey to prepared pan. Tuck wing tips under; tie legs together loosely to hold shape. Place some apple quarters and onion quarters in main cavity. Brush remaining herb butter over turkey; sprinkle with pepper. Scatter remaining apples and onions around turkey in pan. Add reserved turkey neck to pan.",
        "Roast turkey 1 hour. Baste with 1/2 cup apple cider. Roast turkey 30 minutes. Baste with remaining 1/2 cup cider. Roast turkey until thermometer inserted into thickest part of thigh registers 175°F, basting turkey every 30 minutes with pan juices and covering breast loosely with foil if browning too quickly, about 2 hours longer (3 1/2 hours total). Transfer turkey to platter; let stand at least 30 minutes before carving (internal temperature will rise 5 to 10 degrees).",
        "Discard apples, onions, and turkey neck from pan. Pour pan juices into large glass measuring cup; spoon off fat from surface. Pour degreased juices into gravy base and bring to boil over medium-high heat, whisking occasionally. Boil until gravy thickens enough to coat spoon and is reduced to 3 1/2 cups, about 15 minutes. Season gravy to taste with pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "8 quarts cold water",
        "2 cups coarse kosher salt",
        "8 large fresh or dried bay leaves",
        "2 tablespoons black peppercorns",
        "2 tablespoons whole allspice",
        "1 16- to 17-pound turkey; giblets removed, neck reserved",
        "3 tablespoons minced fresh Italian parsley",
        "3 tablespoons minced fresh thyme",
        "3 tablespoons minced fresh sage",
        "3 tablespoons minced fresh marjoram",
        "1 teaspoon minced fresh rosemary",
        "1 teaspoon ground nutmeg",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "4 cups low-salt chicken broth",
        "2 cups apple cider",
        "3 tablespoons all purpose flour",
        "1/2 cup whipping cream",
        "2 tablespoons Calvados (apple brandy) or other brandy",
        "2 large Granny Smith apples, quartered, cored",
        "2 large onions, quartered",
        "1 cup apple cider"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Milk/Cream",
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Apple",
        "Brandy",
        "Fall",
        "Brine",
        "Calvados"
    ],
    "title": "Herb-Roasted Turkey with Apple Cider Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-turkey-with-apple-cider-gravy-108793"
}
