{
    "directions": [
        "In a small bowl whisk together the mustard, the garlic paste, the chopped rosemary, the chopped thyme, the soy sauce, the wine, and salt and pepper to taste, add 2 tablespoons of the oil in a stream, whisking, and whisk the mixture until it is combined well. Brush the lamb generously on all sides with some of the mustard mixture, reserving the remaining mustard mixture, and let it marinate in a lightly oiled roasting pan, covered and chilled, for at least 6 hours or overnight.",
        "Let the lamb come to room temperature and brush it with the reserved mustard mixture. In a bowl toss the onions with 1 tablespoon of the remaining oil, add the onions and the carrots to the pan, and roast them with the lamb in the middle of a preheated 450°F. oven for 15 minutes. In the bowl toss the potatoes with the remaining 1 tablespoon oil and add them to the pan. Reduce the heat to 350°F. and roast the lamb and vegetables, stirring the vegetables occasionally, for 1 hour and 15 minutes, or until a meat thermometer registers 140°F. for medium-rare meat. Transfer the lamb to a large platter and let it stand for 20 minutes. Transfer the onions and the potatoes with a slotted spoon to a serving dish, leaving the carrots in the pan, and keep them warm, covered.",
        "Remove the string from the lamb, spoon some of the potatoes and onions around the lamb, and garnish the lamb with the thyme and rosemary sprigs. Serve the lamb, carved, with the gravy.",
        "Pour off the fat from the pan, add the wine, and deglaze the pan over moderately high heat, scraping up the brown bits. Boil the mixture until it is reduced by half and strain it through a sieve into a saucepan, pressing hard on the carrots. Add the broth and bring the mixture to a boil. In a small bowl knead together the butter and the flour until the mixture is combined well and add the mixture to the gravy a little at a time, whisking. Add any juices that have accumulated on the platter and salt and pepper to taste and simmer the gravy, whisking occasionally, for 3 minutes, or until it is thickened."
    ],
    "ingredients": [
        "1/3 cup Dijon-style mustard",
        "1 large garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "1 tablespoon finely chopped fresh rosemary leaves or 1 teaspoon crumbled dried plus fresh rosemary sprigs for garnish",
        "1 tablespoon finely chopped fresh thyme leaves or 1 teaspoon crumbled dried plus fresh thyme sprigs for garnish",
        "1 1/2 tablespoons soy sauce",
        "1/4 cup dry white wine",
        "4 tablespoons olive oil",
        "an 8-pound leg of lamb, the pelvic bone removed and the lamb tied",
        "2 pounds (about 40) small white onions, blanched in boiling water for 2 minutes, drained, and peeled",
        "2 large carrots, cut into 1/2-inch pieces",
        "2 1/2 pounds (about 40) small red or white potatoes, cooked in boiling salted water for 10 minutes, drained, and halved",
        "1 cup dry red wine",
        "2 cups beef broth",
        "2 tablespoons unsalted butter, softened",
        "3 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Potato",
        "Marinate",
        "Roast",
        "Easter",
        "Rosemary",
        "Chill",
        "Thyme",
        "Gourmet"
    ],
    "title": "Herbed Roast Leg of Lamb with Roasted Onions and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-roast-leg-of-lamb-with-roasted-onions-and-potatoes-10383"
}
