{
    "directions": [
        "Preheat oven to 375°F Trim excess fat from lamb. Using sharp knife, score 1/4-inch-deep crosshatch pattern all over top of lamb. Rub lamb with vegetable oil. Sprinkle lamb with salt and pepper. Mix parsley, sage, rosemary, thyme and tarragon in small bowl. Rub herb mixture all over lamb, pressing firmly to adhere. Place lamb in large roasting pan. Roast until thermometer inserted into lamb registers 155°F, about 1 hour 45 minutes.",
        "Remove lamb from oven and let stand 15 minutes. Pour pan juices into glass measuring cup; degrease pan juices. Mix butter and flour in small bowl. Combine shallots and wine in heavy small saucepan. Boil until most of liquid evaporates, about 2 minutes. Add chicken broth and boil 2 minutes. Whisk in flour mixture and chopped fresh mint. Boil until thickened to sauce consistency, whisking occasionally, about 5 minutes. Whisk in any degreased lamb juices. Season sauce to taste with salt and pepper.",
        "Place lamb on platter. Surround with mint and parsley sprigs. Serve lamb with sauce and Rutabaga Puree."
    ],
    "ingredients": [
        "1 6- to 7-pound leg of lamb",
        "Vegetable oil",
        "1/3 cup chopped fresh parsley",
        "1 tablespoon chopped fresh sage or 1 teaspoon dried rubbed sage",
        "1 tablespoon chopped fresh rosemary or 1 teaspoon dried",
        "1 tablespoon chopped fresh thyme or 1 teaspoon dried",
        "1 tablespoon chopped fresh tarragon or 1 teaspoon dried",
        "1 tablespoon butter, softened",
        "1 tablespoon all purpose flour",
        "1/3 cup finely chopped shallots",
        "1/4 cup dry white wine",
        "1 cup canned low-salt chicken broth",
        "1 tablespoon chopped fresh mint",
        "Fresh mint sprigs",
        "Fresh parsley sprigs",
        "Rutabaga Puree"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Roast",
        "Easter",
        "St. Patrick's Day",
        "Mint",
        "Shallot"
    ],
    "title": "Herbed Lamb with Mint Shallot Sauce and Rutabaga Purée",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-lamb-with-mint-shallot-sauce-and-rutabaga-puree-1966"
}
