{
    "directions": [
        "Put the chicken in a large bowl. Add the oil, lemon, and sage; toss well. Cover tightly and transfer to the refrigerator to marinate for 24 hours.",
        "The next day, let the chicken stand at room temperature for 30 minutes while the oven preheats to 450°F.",
        "Sprinkle the chicken inside and out with the seasoning. Remove the lemon slices and sage from the marinade and stuff them inside the chicken cavity. Scatter the carrots, celery, and onion, if using, over the bottom of a roasting pan. Pour just enough water into the pan to cover the bottom. Arrange the chicken, breast side up, on top of the vegetables, if desired, or place the chicken on a roasting rack over the vegetables.",
        "Transfer the pan to the center oven rack; roast for 20 minutes. Baste with the pan juices, and continue roasting, basting once or twice, for 25 minutes more (if the chicken is not golden brown all over at this point, continue to cook for 10 more minutes).",
        "Reduce the heat to 325°F. Finish roasting, without basting, until an instant-read thermometer inserted in the thickest part of the thigh reads 165°F, 20 to 25 minutes longer. Let the chicken stand for 5 minutes before carving. Serve with the pan juices and vegetables, if desired."
    ],
    "ingredients": [
        "1 (3- to 3 1/2-pound) whole chicken, patted dry with paper towels",
        "1/2 cup extra-virgin olive oil",
        "1 lemon, thinly sliced",
        "1 bunch of fresh sage leaves (about 1/2 cup)",
        "2 teaspoons kosher salt and freshly ground black pepper",
        "3 medium carrots, peeled and halved crosswise, optional",
        "3 celery stalks, cut crosswise into thirds, optional",
        "1 large onion, peeled and cut into large chunks, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Marinate",
        "Roast",
        "Dinner",
        "Lemon",
        "Sage",
        "Advance Prep Required",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herb-Roasted Chicken with Lemon and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-chicken-with-lemon-and-sage-363432"
}
