{
    "directions": [
        "In a skillet cook bacon over moderate heat until crisp. Drain bacon on paper towels and crumble. Pour off all but 1 tablespoon bacon fat from skillet and set skillet aside.",
        "Shell fresh beans if using. In a small saucepan of boiling salted water cook beans, covered, over moderate heat, stirring occasionally, until just tender, about 5 minutes. In a sieve drain beans and rinse under cold running water to stop cooking.",
        "Cut larger cherry tomatoes in half. Working over a bowl to catch the juices, cut corn kernels from cobs. Chop onion and mince garlic.",
        "Add oil to bacon fat in skillet and cook onion over moderate heat, stirring, until softened. Add garlic and cook, stirring, 1 minute. Add tomatoes, corn, and vinegar and cook, stirring, until tomatoes just begin to lose their shape. Remove skillet from heat and gently stir in beans and half of bacon. Cool succotash to room temperature and gently stir in basil, arugula, and salt and pepper to taste.",
        "Serve succotash spooned over garlic cro※tes and sprinkled evenly with remaining bacon."
    ],
    "ingredients": [
        "1/4 pound bacon (about 4 slices)",
        "1 pound fresh shell beans in pod or 1 cup frozen baby lima beans",
        "3/4 pound cherry tomatoes (about 1 1/2 pints)",
        "4 ears corn",
        "1 small Vidalia onion or other sweet onion",
        "1 large garlic clove",
        "1 1/2 tablespoons olive oil",
        "1 tablespoon Sherry vinegar",
        "1/4 cup packed small fresh basil leaves",
        "1/4 cup packed small fresh arugula leaves",
        "Accompaniment: garlic croútes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Side",
        "Basil",
        "Bacon",
        "Corn",
        "Arugula",
        "Lima Bean",
        "Summer",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Herbed Summer Succotash",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-summer-succotash-102026"
}
