{
    "directions": [
        "To make the herbed pizza dough, in a small bowl, mix together the yeast, warm water and sugar and let stand for a few minutes until foamy. In a large bowl, combine the flour, olive oil, basil and salt. Stir in the yeast mixture. Turn the dough out onto a lightly floured board and knead until smooth and elastic, about 10 minutes. Place the dough in an oiled bowl, turn, cover and let rise in a warm place until doubled in size, 1 to 2 hours.",
        "Meanwhile, prepare a charcoal or gas grill for indirect grilling over high heat (400°F) and oil the grill rack. If using a charcoal grill, arrange the coals around the perimeter to fit 2 round pizzas in the middle. For gas grills, shape the dough to fit the unheated portion of the grill or trim precooked pizza rounds as necessary.",
        "Divide the dough in half and form into 2 balls. On a lightly floured board, roll out each ball into a 10-inch round. Whether using homemade or precooked rounds, brush both sides with olive oil and sprinkle with a little cornmeal.",
        "Place the rounds on the unheated portion of the grill. (If your grill has a widely spaced grid, you may need to use a grill basket for homemade dough.) Cook, turning once, until the dough is grill-marked and cooked or heated through, 5 to 8 minutes per side for uncooked pizza rounds, 3 to 4 minutes per side for precooked rounds. Transfer to a work surface.",
        "Grill the bell peppers directly over high heat, turning to char and blister them on all sides, 5 to 7 minutes. Transfer to a paper bag, close the bag and let stand for 10 minutes. Peel the peppers and remove the seeds and stems. Chop the peppers and set aside.",
        "Spread half of the tomato sauce on each pizza round. Top each round with half of the bell peppers and half of the prosciutto. Dot each pizza with half of the goat cheese and sprinkle with half of the basil. Season with salt and pepper and drizzle a little olive oil on top.",
        "Place the pizzas on the unheated part of the grill, cover the grill, and bake over indirect high heat until the topping is thoroughly heated through, about 10 minutes. Serve immediately. Serves 4."
    ],
    "ingredients": [
        "1 package (1 1/2 tsp.) active dry yeast",
        "3⁄4 cup warm water",
        "1 tsp. sugar",
        "2 cups all-purpose flour",
        "1⁄4 cup olive oil",
        "2 Tbs. dried basil",
        "1⁄2 tsp. salt",
        "Olive oil for coating",
        "Cornmeal for sprinkling",
        "2 red or yellow bell peppers",
        "1 cup tomato sauce",
        "1⁄4 lb. sliced prosciutto, cut into fine shreds",
        "1⁄4 lb. fresh goat cheese (chèvre)",
        "2 Tbs. chopped fresh basil or 1 Tbs. dried",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Herbed Pizzas with Prosciutto, Basil and Goat Cheese",
    "url": "http://www.williams-sonoma.com/recipe/herbed-pizzas-with-prosciutto-basil-and-goat-cheese.html"
}
