{
    "directions": [
        "Place lamb racks on heavy large rimmed baking sheet. Brush lamb with 1 tablespoon oil. Sprinkle with 2 teaspoons coarse salt and pepper. Mix all herbs in small bowl; press firmly over meat side of lamb to adhere. Let stand 2 hours at room temperature. (Can be made 6 hours ahead. Cover and refrigerate.)",
        "Preheat oven to 425°F. Heat remaining 4 tablespoons oil in heavy large nonstick skillet over medium-high heat. Working in batches, add lamb, meat-and-herb side down, and cook until brown, about 4 minutes. Transfer racks to baking sheet, meat-and-herb side up. Roast lamb until meat thermometer inserted into center registers 125°F for medium-rare, about 13 minutes. Remove from oven and let stand 15 minutes.",
        "Heat olive oil in heavy large skillet over medium heat. Add shallots and sauté until soft, about 4 minutes. Add parsley and sauté until wilted, about 2 minutes. Add mint, 1/2 cup water, and lemon peel and cook until parsley is tender, about 3 minutes. Mix in walnuts, walnut oil, and lemon juice. Season with salt and pepper.",
        "Cut lamb between bones into individual chops. Divide parsley sauté among 6 plates. Top with lamb chops and serve."
    ],
    "ingredients": [
        "3 1 1/4-pound racks of lamb, frenched",
        "5 tablespoons olive oil",
        "2 teaspoons coarse kosher salt",
        "1/2 cup finely chopped fresh Italian parsley",
        "1/4 cup finely chopped fresh rosemary",
        "1/4 cup finely chopped fresh mint",
        "2 tablespoons extra-virgin olive oil",
        "1/2 cup finely chopped shallots",
        "6 cups (packed) fresh Italian parsley leaves (from 2 large bunches)",
        "3/4 cup very coarsely chopped fresh mint leaves",
        "1/2 cup water",
        "2 teaspoons grated lemon peel",
        "3/4 cup coarsely chopped toasted walnuts (about 2 1/2 ounces)",
        "2 tablespoons walnut oil",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Nut",
        "Roast",
        "Easter",
        "Low/No Sugar",
        "Dinner",
        "Mint",
        "Rack of Lamb",
        "Walnut",
        "Spring",
        "Parsley",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herbed Rack of Lamb with Parsley, Mint, and Walnut Sauté",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-rack-of-lamb-with-parsley-mint-and-walnut-saute-108569"
}
