{
    "directions": [
        "Preheat the oven to 450 degrees F. Oil a roasting pan and set it aside.",
        "Put the onion into the bowl of a mini food processor. Using a vegetable peeler, peel the zest from the lemon in thin strips, being careful not to cut into the bitter white pith. Add the lemon zest to the food processor and reserve the whole lemon for another use. Chop the onion and lemon zest until fine. Add the sage, parsley, olive oil, and 1 teaspoon salt and pulse until it forms a coarse paste.",
        "Put 2 of the bay leaves and the butter into a small pan and heat over medium-low heat until the butter is bubbling. Remove from the heat and set aside.",
        "Put the turkey breasts on a work surface. Carefully run your fingers between the skin and the flesh from 1 end, being careful not to pull it completely off, creating a pocket. Season the turkey breasts generously with salt and pepper. Stuff half of the herb paste under the skin of each breast, and spread it evenly under the skin. Transfer the breasts to the roasting pan, and slide 2 bay leaves underneath each one. (The heat of the pan will release the bay leaf oils and flavor the breast.) Using a pastry brush, baste the breasts with half of the bay butter. Place the turkey in the oven and immediately decrease the temperature to 400 degrees F. After 20 minutes, baste the turkey breasts with the remaining butter, and roast for an additional 20 to 25 minutes, until cooked through, and a thermometer placed in the thickest part of the breast registers 170 degrees F.",
        "Remove from the oven, transfer to a platter, cover, and let rest for 10 minutes before carving while you make the gravy.",
        "Put the roasting pan over the burner on medium heat. Sprinkle the flour over the pan juices, and cook, stirring, for a few minutes. Add the apple brandy, and scrape the pan to lift the bits that are stuck to the bottom. Cook for a minute to burn off the alcohol, then, while stirring, pour in the apple cider. Bring to a simmer, and stir until thickened. Season with salt and pepper.",
        "Slice the turkey breast on the diagonal, and serve with warm gravy."
    ],
    "ingredients": [
        "1 small (golf-ball sized) onion, peeled and coarsely chopped",
        "1 lemon, scrubbed clean",
        "12 fresh sage leaves",
        "Large handful fresh flat-leaf parsley (about 1/2 cup, from 12 stems)",
        "3 tablespoons extra-virgin olive oil, plus more for oiling pan",
        "1 teaspoon salt, plus more as needed",
        "6 fresh bay leaves",
        "4 tablespoons butter",
        "2 boneless turkey breast halves, skin on (about 2 to 2 1/2 pounds each)",
        "Freshly ground black pepper",
        "3 tablespoons all-purpose flour",
        "1/4 cup apple or regular brandy (recommended: Calvados)",
        "2 to 3 cups apple cider",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Dinner Recipes",
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "Food Processor",
        "American",
        "Gravy",
        "Vegetable",
        "Apple",
        "Fruit",
        "Turkey Breast",
        "Fall",
        "Winter"
    ],
    "title": "Herb Roasted Turkey Breast with Pan Gravy",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/herb-roasted-turkey-breast-with-pan-gravy-recipe"
}
