{
    "directions": [
        "Put ham in deep 10- to 20-quart pot and cover with cold water (don't worry if bone sticks out). Bring to a boil, then drain ham.",
        "Put oven rack in lower third of oven (remove any other racks) and preheat oven to 350°F.",
        "Wash leeks in a bowl of cold water, then lift out and drain well. Cook leeks, onion, carrots, celery, garlic, thyme sprigs, parsley stems, nutmeg, peppercorns, and cloves in 2 tablespoons butter in wide 7- to 10-quart heavy pot (see \"special equipment,\" above) over moderately high heat, stirring occasionally, until vegetables are softened and beginning to brown, about 10 minutes. Add wine and bring to a boil, then add ham, skin side down, and water (liquid will not cover ham) and return to a boil.",
        "Cover pot tightly with lid or, if ham sticks up over top of pot, with heavy-duty foil. Braise ham in oven 1 hour.",
        "Turn ham skin side up and continue to braise in oven, covered, until thermometer inserted into center of ham (do not touch bone) registers 120°F, about 1 hour more (if ham was labeled \"fully cooked\"), or 160°F, about 2 hours more (if ham was labeled \"partially cooked\").",
        "While ham braises, mash together flour and remaining 3 tablespoons butter with a fork to make a beurre manié.",
        "Transfer ham to a platter and let stand, loosely covered with foil, 45 minutes.",
        "While ham stands, pour braising liquid through a fine-mesh sieve into a 3-quart saucepan, pressing on and discarding solids, and skim off any fat. Bring braising liquid to a simmer and whisk in beurre manié 1/2 tablespoon at a time (sauce will become lumpy). Continue to simmer, whisking, until sauce is smooth and slightly thickened, about 5 minutes. Remove from heat and stir in chopped thyme and parsley.",
        "Remove skin from ham, then slice meat and serve with sauce."
    ],
    "ingredients": [
        "1 (11- to 13-pound) bone-in smoked pork shoulder (sometimes called picnic ham)",
        "2 medium leeks (white and pale green parts only), chopped",
        "1 large onion, chopped",
        "3 medium carrots, cut into 1/2-inch cubes",
        "2 celery ribs, cut into 1/2-inch cubes",
        "2 garlic cloves, finely chopped",
        "6 (5-inch) fresh thyme sprigs plus 2 tablespoons finely chopped leaves",
        "6 fresh flat-leaf parsley stems plus 1/4 cup finely chopped leaves",
        "1/4 whole nutmeg, smashed with side of a large heavy knife",
        "1 teaspoon whole black peppercorns",
        "4 whole cloves",
        "5 tablespoons unsalted butter, softened",
        "2 cups dry white wine",
        "4 cups water",
        "1/3 cup all-purpose flour",
        "Special equipment: a deep 10- to 20-quart pot (such as a stockpot, lobster pot, or canning pot); a wide 7-quart heavy ovenproof pot (if you have an 11-pound ham) or a wide 9- to 10-quart heavy ovenproof pot (if you have a 13-pound ham); an instant-read thermometer (preferably remote digital with probe)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Braise",
        "Christmas",
        "Dinner",
        "Ham",
        "White Wine",
        "Winter",
        "Clove",
        "Nutmeg",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Herb-Braised Ham",
    "url": "http://www.epicurious.com/recipes/food/views/herb-braised-ham-108884"
}
