{
    "directions": [
        "Preheat oven to 400°F.",
        "In roasting pan, combine onions, celery, and garlic cloves. Drizzle with 1 tablespoon oil, toss well to coat, and mound in center of pan. Set lamb atop mixture. Drizzle with 1 tablespoon oil and sprinkle with herbes de Provence, salt, and pepper. Arrange carrots and celery root around meat and drizzle with remaining 2 tablespoons oil. Pour wine and broth into pan and cover pan tightly with heavy-duty foil.",
        "Roast 1 hour. Remove foil and increase heat to 425°F. Roast until thermometer inserted into thickest part of lamb registers 130°F for medium-rare, about 15 minutes more.",
        "Transfer lamb to carving board and tent with foil. Transfer carrots, celery root, and 1/2 of onions to medium bowl and keep warm. Force remaining contents of pan through medium-mesh strainer into medium saucepan, pressing well on solids. Skim off and discard fat. (Or pour pan juices through strainer into fat separator and let stand until fat rises to top, 1 to 2 minutes. Carefully pour pan juices from separator into pan, discarding fat.)",
        "Set saucepan over moderate heat and bring to simmer. Cook, uncovered, until reduced by half, about 10 minutes. Season to taste with salt and pepper.",
        "Remove kitchen string from lamb and cut meat crosswise into thin slices. Arrange on platter with roasted vegetables. Serve warm, with jus alongside."
    ],
    "ingredients": [
        "4 medium onions, peeled (roots trimmed but still attached) and quartered",
        "1 large stalk celery, quartered",
        "6 large garlic cloves, lightly crushed and peeled",
        "4 tablespoons extra-virgin olive oil",
        "1 (7-pound) boneless leg of lamb, trimmed, rolled, and tied",
        "1 teaspoon herbes de Provence",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "6 medium carrots, peeled and cut into 3-inch-long pieces",
        "2 medium or 1 large celery root, peeled and cut into 1 1/2-inch chunks",
        "1 1/2 cups dry white wine",
        "1 1/2 cups low-sodium beef broth or chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Lamb",
        "Onion",
        "Roast",
        "Easter",
        "Celery",
        "Carrot",
        "White Wine"
    ],
    "title": "Herb-Roasted Leg of Lamb with Vegetables and Jus",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-leg-of-lamb-with-vegetables-and-jus-238011"
}
