{
    "directions": [
        "Mince garlic and mash to a paste with salt using a large heavy knife.",
        "Whisk together garlic paste, lemon juice, and pepper in a large bowl, then whisk in oil, thyme, and rosemary until combined well. Put lamb in a large sealable bag, then add 3/4 cup herb marinade and seal bag, pressing out excess air. Marinate lamb, chilled, at least 6 hours or up to 8. Reserve remaining marinade, covered and chilled.",
        "About an hour before grilling, halve zucchini lengthwise, then cut diagonally crosswise, alternating direction with each cut, to create triangle shapes. Put zucchini in another large sealable bag, then pour reserved marinade over zucchini and seal bag, pressing out excess air. Marinate zucchini at room temperature 1 hour. (Marinating zucchini any longer will result in a mushy texture.)",
        "Prepare grill for cooking over direct heat with medium-hot charcoal (moderately high heat for gas); see Grilling Procedure",
        "While grill is heating, drain lamb, discarding marinade, then thread cubes 1/4 inch apart onto 8 skewers.",
        "Transfer zucchini to a bowl, reserving marinade, and thread zucchini onto 4 skewers (without lamb). Thread tomatoes onto remaining 4 skewers.",
        "Lightly oil grill rack and grill kebabs (covered only if using gas grill), turning occasionally, until tomatoes are softened but not falling apart, 2 to 3 minutes; zucchini is tender, 4 to 6 minutes; and lamb is medium-rare, about 6 minutes. Serve kebabs drizzled with reserved marinade (from zucchini)."
    ],
    "ingredients": [
        "1 large garlic clove",
        "1 1/2 teaspoons salt",
        "1/4 cup plus 2 tablespoons fresh lemon juice",
        "1 1/2 teaspoons black pepper",
        "1 cup plus 2 tablespoons olive oil",
        "1/4 cup finely chopped fresh thyme leaves",
        "1 1/2 tablespoons finely chopped fresh rosemary leaves",
        "1 (2-lb) piece trimmed boneless leg of lamb, cut into 1 1/4-inch cubes",
        "3 medium zucchini (1 1/2 lb total)",
        "24 large cherry tomatoes (3/4 lb total)",
        "Special equipment: 16 (12-inch) wooden skewers, soaked in warm water 1 hour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Marinate",
        "Lemon",
        "Rosemary",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Thyme",
        "Gourmet"
    ],
    "title": "Herbed Lamb, Tomato, and Zucchini Kebabs",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-lamb-tomato-and-zucchini-kebabs-234653"
}
