{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 400°F.",
        "Cut off stalks from fennel bulb. Chop enough fronds to measure 1/4 cup and discard stalks. Cut bulb (including core) into 1/4-inch dice.",
        "Cook fennel bulb, scallions, and 1/4 teaspoon salt in 2 tablespoons butter in a 10-inch heavy skillet, covered, over moderate heat, stirring occasionally, until tender, about 10 minutes. Remove lid and cook until any liquid is evaporated, 1 to 2 minutes more. Transfer to a large bowl and stir in cheeses, eggs, semolina, fennel fronds, dill, pepper, and remaining 1/4 teaspoon salt until combined.",
        "Melt remaining 6 tablespoons butter and brush springform pan with some of butter, then sprinkle bottom with 1 tablespoon bread crumbs. Unroll phyllo and cover stack with plastic wrap and a dampened kitchen towel. Working quickly, brush 1 phyllo sheet with some butter (keep remaining sheets covered) and gently fit it into springform pan, allowing ends to hang over. Rotate pan slightly, then butter another phyllo sheet and place on top (sheets should not align). Sprinkle with remaining tablespoon bread crumbs. Butter and fit 4 more phyllo sheets into pan, rotating pan for each sheet (overhang should cover entire rim).",
        "Spread cheese mixture in phyllo shell.",
        "Butter another phyllo sheet, then fold in half crosswise and butter again. Fold again (to quarter) and brush with butter, then lay over center of filling. Repeat with remaining phyllo sheet, laying it over folded sheet in opposite direction. Fold overhang toward center to enclose filling and folded phyllo, then brush top with butter.",
        "Bake until puffed and deep golden brown, 40 to 50 minutes. Once pie is golden brown, loosely cover pan with a sheet of foil to prevent overbrowning. Cool in pan on a rack 5 minutes. Remove side of pan and continue to cool pie on rack.",
        "Cut into wedges (leave bottom of pan under pie). Serve warm or at room temperature.",
        "*Available at D. Coluccio & Sons (718-436-6700)."
    ],
    "ingredients": [
        "1 medium fennel bulb (sometimes labeled \"anise\"; 1 lb) with fronds",
        "6 scallions (1 bunch), chopped",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter",
        "1 lb 4% cottage cheese (3 cups)",
        "1/2 lb feta, crumbled (2 cups)",
        "4 large eggs, lightly beaten",
        "2 tablespoons semolina* (sometimes labeled \"semolina flour\")",
        "1/4 cup chopped fresh dill",
        "1/4 teaspoon black pepper",
        "2 tablespoons fine dry bread crumbs (not seasoned)",
        "8 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "Special equipment: a 9- to 9 1/2-inch (24-cm) springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Bake",
        "Feta",
        "Fennel",
        "Summer",
        "Cottage Cheese",
        "Dill",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Herb and Cheese Pie",
    "url": "http://www.epicurious.com/recipes/food/views/herb-and-cheese-pie-234638"
}
