{
    "directions": [
        "Stir 3 gallons water and salt in large pot until salt dissolves. Stir in peppercorns and next 4 ingredients. Add turkey to brine. Place large plate atop turkey to submerge. Place in refrigerator. Soak turkey 8 to 10 hours. Remove turkey from brine; rinse and pat dry. (Can be prepared 1 day ahead. Store uncovered in refrigerator.)",
        "Preheat oven to 450°F. Place turkey on rack in large roasting pan. Rub butter over turkey. Sprinkle with salt and pepper. Place turkey in oven. Reduce temperature to 325°F. Roast turkey until thermometer inserted into thickest part of thigh registers 175°F, about 2 1/2 hours. Transfer turkey to platter; tent with foil. Let stand at room temperature 30 minutes before carving (internal temperature will rise 5 to 10 degrees).",
        "Spoon off fat from drippings in pan, reserving 1/4 cup fat. Measure 2/3 cup pan juices. Melt butter and reserved 1/4 cup fat in heavy large saucepan over medium heat. Mix in flour. Stir until light brown, about 2 minutes. Gradually add chicken broth, pear juice, and 2/3 cup pan juices. Simmer until thickened, stirring frequently, about 10 minutes. Stir in rum. Season with salt and pepper. Sprinkle turkey with marjoram; serve with gravy.",
        "No room in the fridge to brine a turkey? No problem. Put a turkey-sized oven bag in a large cooler, then place the turkey in the bag. Pour in the brine and seal tightly. Place ice over and around turkey, close the lid tightly, and let it brine 8 to 10 hours, adding ice periodically to keep temperature at 40° or below."
    ],
    "ingredients": [
        "3 gallons water",
        "1 3-pound box coarse kosher salt",
        "1/2 cup whole black peppercorns",
        "1/3 cup fresh thyme sprigs",
        "1/3 cup fresh marjoram sprigs",
        "1/3 cup fresh sage sprigs",
        "12 Turkish bay leaves",
        "1 13-pound turkey",
        "1/2 cup butter, room temperature pear gravy",
        "1/4 cup (1/2 stick) butter",
        "1/2 cup all purpose flour",
        "2 cups low-salt chicken broth",
        "1 cup pear juice",
        "2 tablespoons dark rum",
        "3 tablespoons chopped fresh marjoram"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Pear",
        "Fall",
        "Brine"
    ],
    "title": "Herb-Brined Turkey with Pear Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/herb-brined-turkey-with-pear-gravy-231060"
}
