{
    "directions": [
        "Line 2 large rimmed baking sheets with parchment paper. Mix cheese and next 5 ingredients in medium bowl.",
        "Whisk 2 3/4 cups flour, baking powder, sugar, salt, and baking soda in another medium bowl. Using large holes of box grater, grate frozen butter onto plate. Add grated butter to flour mixture and rub in with fingertips until evenly distributed. Stir in buttermilk just until incorporated (dough will be sticky).",
        "Sprinkle work surface with 1/4 cup flour. Transfer dough to work surface; sprinkle dough with flour. Using hands, press dough into 8-inch square, about 1/2 inch thick; sprinkle more flour on work surface as needed to prevent sticking.",
        "Sprinkle 1/2 cup cheese-herb mixture over 2/3 of surface of dough, leaving remaining 1/3 of dough surface uncovered. To fold as for business letter: Using dough scraper or metal spatula as aid, lift uncovered dough portion from work surface and fold over half of cheese-covered portion; still using dough scraper or metal spatula as aid, lift folded portion over remaining cheese-covered portion.",
        "Sprinkle dough with flour to prevent sticking. Press dough out again to 8-inch square. Spread 1/2 cup cheese-herb mixture over 2/3 of dough; repeat folding as for business letter, then pressing dough out to 8-inch square. Repeat 2 more times with dough and cheese-herb mixture. Roll out dough on floured surface to 10-inch square; cut into 36 small pieces. DO AHEAD: Place biscuits in single layer on baking sheets; freeze until firm. Wrap biscuits in single layer in foil, then enclose in resealable freezer bags; freeze up to 2 weeks. Place frozen biscuits 1 inch apart on parchment-lined baking sheets; thaw in refrigerator overnight. Let biscuits stand at room temperature 20 minutes before baking.",
        "Position rack in center of oven; preheat to 500°F. Bake biscuits, 1 sheet at a time, until golden on top and tester inserted into center comes out clean, about 10 minutes. Cool biscuits on baking sheet at least 5 minutes. If desired, cool completely, then rewarm biscuits in 400°F oven 3 minutes before serving."
    ],
    "ingredients": [
        "2 cups coarsely grated sharp cheddar cheese (about 6 ounces)",
        "2 tablespoons minced fresh parsley",
        "2 tablespoons minced fresh basil",
        "1 teaspoon minced fresh thyme",
        "1 teaspoon minced fresh sage",
        "1/4 teaspoon freshly ground black pepper",
        "2 3/4 cups all purpose flour plus 1/4 cup (or more) for dusting and rolling",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon sugar",
        "3/4 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/2 cup (1 stick) unsalted butter, frozen",
        "1 1/2 cups chilled buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Herb",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "Cheddar",
        "Basil",
        "Family Reunion",
        "Sage",
        "Thyme",
        "Potluck",
        "Butter",
        "Buttermilk"
    ],
    "title": "Herb and Cheese Poppers",
    "url": "http://www.epicurious.com/recipes/food/views/herb-and-cheese-poppers-355805"
}
