{
    "directions": [
        "Process herbs and garlic in food processor until finely minced. Set aside.",
        "Rinse turkey inside and out with cold water; pat dry with paper towels. Trim excess fat. Place turkey in large nonreactive bowl. Starting at neck cavity, loosen skin from breast and drumsticks by gently inserting fingers between skin and meat. Sprinkle kosher salt and pepper under and over skin. Then spread garlic-herb rub under skin and gently press skin to adhere. Lift wing tips up and over back; tuck into turkey. Refrigerate at least 8 hours or overnight.",
        "Let turkey stand at room temperature 1 hour before serving. Set oven rack at lowest position and preheat oven to 350°F. Spread sliced onions on bottom of heavy-bottomed roasting pan and place fitted rack over top. (Or place the turkey directly on bed of onions. They will prevent sticking and flavor drippings.) Brush turkey with grapeseed oil and carefully transfer to rack. Brush one side of double-folded sheet of aluminum foil with grapeseed oil and tent, greased side down, over turkey breast. Place turkey in oven so legs face back of oven and bird, breast side up, faces door. Place wrapped garlic on oven rack.",
        "Roast 45 minutes. Remove garlic from oven. Remove foil from turkey and turn pan around. Roast until thermometer inserted in thickest part of thigh registers 170°F and juices run clear when thigh is pierced with fork (see note below), about 1 hour 15 minutes. Transfer turkey to platter and reserve pan drippings. Let turkey stand 20 minutes before carving.",
        "Pour drippings into 4-cup glass measure, and skim off fat that rises to surface, reserving 1 tablespoon fat (see tip below). Add enough broth to drippings to measure 3 cups.",
        "Separate roasted garlic cloves. Squeeze pulp into small bowl and mash well with fork. In medium saucepan over medium heat, heat reserved fat. Add garlic and flour, and cook, whisking constantly, until lightly browned, about 30 seconds. Gradually whisk in broth mixture. Bring to boil over high heat, whisking constantly, and remove from heat. Carve turkey and serve with gravy."
    ],
    "ingredients": [
        "1 cup fresh flat-leaf parsley leaves",
        "1/2 cup fresh sage leaves",
        "1/2 cup fresh rosemary leaves",
        "1/2 cup fresh thyme leaves",
        "22 medium garlic cloves (about 3 heads)",
        "1 (10- to 12-pound) turkey, preferably organic or free-range",
        "1 large or 2 medium onions, sliced into thin rings",
        "2 tablespoons plus 1 teaspoon grapeseed oil",
        "1 head garlic, end cut off, brushed with olive oil and wrapped in aluminum foil",
        "3 1/2 cups (28 ounces) low-sodium chicken broth, preferably organic",
        "1/4 cup all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Low Carb",
        "Low Fat",
        "Dinner",
        "Healthy",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herb-Rubbed Turkey with Roasted-Garlic Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/herb-rubbed-turkey-with-roasted-garlic-gravy-233084"
}
