{
    "directions": [
        "Combine the lemon zest, lemon juice, 1/2 cup olive oil, garlic, rosemary, thyme, mustard, and 2 teaspoons salt in a sturdy 1-gallon resealable plastic bag. Add the pork tenderloins and turn to coat with the marinade. Squeeze out the air and seal the bag. Marinate the pork in the refrigerator for at least 3 hours but preferably overnight.",
        "Preheat the oven to 400 degrees F.",
        "Remove the tenderloins from the marinade and discard the marinade but leave the herbs that cling to the meat. Sprinkle the tenderloins generously with salt and pepper. Heat 3 tablespoons olive oil in a large oven-proof saute pan over medium-high heat. Sear the pork tenderloins on all sides until golden brown. Place the saute pan in the oven and roast the tenderloins for 10 to 15 minutes or until the meat registers 137 degrees F at the thickest part. Transfer the tenderloins to a platter and cover tightly with aluminum foil. Allow to rest for 10 minutes. Carve in 1/2-inch-thick diagonal slices. The thickest part of the tenderloin will be quite pink (it's just fine!) and the thinnest part will be well done. Season with salt and pepper and serve warm, or at room temperature with the juices that collect in the platter."
    ],
    "ingredients": [
        "1 lemon, zest grated",
        "3/4 cup freshly squeezed lemon juice (4 to 6 lemons)",
        "Good olive oil",
        "2 tablespoons minced garlic (6 cloves)",
        "1 1/2 tablespoons minced fresh rosemary leaves",
        "1 tablespoon chopped fresh thyme leaves",
        "2 teaspoons Dijon mustard",
        "Kosher salt",
        "3 pork tenderloins (about 1 pound each)",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Dinner",
        "Healthy",
        "Make Ahead",
        "Meat",
        "Pork",
        "Fruit",
        "Lemon Recipes",
        "Pork Tenderloin",
        "Main Dish Recipes",
        "Gluten Free",
        "Low Calorie",
        "Low-Fat",
        "Diabetes-Friendly",
        "Sauteing Recipes",
        "Marinating Recipes"
    ],
    "title": "Herb-Marinated Pork Tenderloins",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/herb-marinated-pork-tenderloins-recipe"
}
