{
    "directions": [
        "Pat roast dry and put, fat side up, on rack in roasting pan.",
        "Coarsely crush peppercorns in a mortar and pestle or folded kitchen towel (not terry cloth) with a meat pounder or bottom of a heavy skillet. Stir together peppercorns, 3 tablespoons kosher salt, thyme, and rosemary in a small bowl.",
        "Rub roast all over with oil, then coat it all over with peppercorn mixture, pressing to help it adhere. Let coated roast stand at room temperature 1 hour.",
        "Preheat oven to 450°F with rack in lower third. Roast beef roast 20 minutes.",
        "Reduce oven temperature to 350°F and roast until an instant-read thermometer inserted into center of meat (do not touch bone) registers 110°F, 1 1/2 to 2 hours more. Transfer to a platter (keep fat and pan juices in roasting pan) and let stand, uncovered, 40 minutes (temperature of meat will rise to about 130°F for medium-rare).",
        "While roast stands, put second oven rack in upper-third position and increase oven temperature to 450°F. Line 1 sheet pan with parchment paper.",
        "Strain pan juices from roasting pan through a sieve into a glass measuring cup (reserve roasting pan). Drain potatoes well and toss in a large bowl with 3 tablespoons melted beef fat from roasting pan and 1 teaspoon kosher salt, then spread out on parchment-lined sheet pan. Toss carrots in same bowl with another 3 tablespoons beef fat from pan and 1 teaspoon kosher salt, then spread out on other rimmed sheet pan. Roast vegetables in upper and lower thirds of oven, stirring occasionally and switching position of pans halfway through roasting, until golden, 25 to 30 minutes for carrots and 30 to 35 minutes for potatoes.",
        "Skim off and discard any remaining fat from pan juices. Set pan over 2 burners. Add 1 cup of wine and deglaze pan by boiling it over high heat, scraping up brown bits, 1 minute. Pour into pan juices in cup.",
        "Cook shallot in 1 tablespoon butter with remaining 1/4 teaspoon kosher salt in a 3- to 4-quart heavy saucepan over medium heat, stirring, until golden, 4 to 5 minutes. Add wine mixture in cup, along with remaining wine in bottle, and boil over high heat until mixture is reduced to 3/4 cup, about 10 minutes.",
        "Add broth and continue to boil over high heat until mixture is reduced to 1 1/2 cups. Strain mixture through a sieve into another saucepan and whisk in remaining 3 tablespoons butter (cut into pieces) until incorporated. Season sauce with salt and pepper.",
        "To carve roast, slide a carving knife along inside of ribs to separate meat from bones, then cut ribs into individual bones. Slice meat and serve with vegetables and jus."
    ],
    "ingredients": [
        "1 (4-rib) standing beef rib roast (bone-in prime rib; 9 to 10 pounds)",
        "1/4 cup mixed peppercorns (pink, white, and green)",
        "3 tablespoons plus 2 1/2 teaspoons kosher salt, divided",
        "2 tablespoons chopped fresh thyme",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon extra-virgin olive oil",
        "3 pounds medium Yukon Gold potatoes, peeled and each cut into 6 wedges (keep in a bowl of cold water to prevent discoloration)",
        "3 pounds carrots, peeled and cut diagonally into 2-inch pieces",
        "1 (750 milliliter) bottle Pinot Noir",
        "1/2 cup chopped shallots",
        "4 tablespoons unsalted butter, divided",
        "2 1/4 cups reduced-salt beef or chicken broth",
        "Special equipment: Heavy flameproof roasting pan (not glass) fitted with a flat rack; instant-read thermometer; 2 (18- by 13-inch) heavy rimmed sheet pans (aka half-sheet pans); parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Herb",
        "Potato",
        "Roast",
        "Christmas",
        "Dinner",
        "Rosemary",
        "Meat",
        "Beef Rib",
        "Carrot",
        "Thyme",
        "Christmas Eve",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Herb-Crusted Beef Rib Roast with Potatoes, Carrots, and Pinot Noir Jus",
    "url": "http://www.epicurious.com/recipes/food/views/herb-crusted-beef-rib-roast-with-potatoes-carrots-and-pinot-noir-jus-51142000"
}
