{
    "directions": [
        "On an ungreased griddle or small, heavy skillet set over medium heat, roast the garlic, turning frequently, until blackened in spots and soft to the touch, about 15 minutes. Cool, peel off  the papery skins, then finely chop.",
        "Roast the chiles directly over a gas flame or 4\" below a very hot broiler until blackened on all sides, about 5 minutes for open flame, about 10 minutes for broiler.  Cover with a kitchen towel and let stand 5 minutes.  Peel, pull out the stem and seed pod, then rinse briefly to remove bits of seeds and stray bits of skin. Chop the chiles into 1/4\" bits.",
        "In a medium-size bowl, mix together the garlic, ricotta, fresh herbs, and half the chopped chiles. Taste and season with the salt and pepper. Cover and set aside.",
        "Set up a steamer (a vegetable steamer in a large saucepan filled with 1/2\" of water works well); heat to a boil. Wrap the tortillas in a heavy kitchen towel, lay in the steamer and cover with a tight lid. Boil 1 minute, turn off the heat and let stand without opening the steamer for 15 minutes.",
        "Just before serving, mix the remaining half  of the chopped chiles into the ricotta (plus enough water to make it easily spoonable). One at a time, spread a generous 2 tablespoons of the ricotta filling over each of 8 hot tortillas. Sprinkle with the radishes and onion, lay on a sprig of cilantro and you’re ready for some light, zesty flavors.",
        "The filling will hold well for a couple of days in the refrigerator, but is best served at room temperature. Assemble the tacos at the last moment."
    ],
    "ingredients": [
        "4 garlic cloves, unpeeled",
        "2 fresh poblano chiles",
        "1 cup ricotta cheese (the freshest you can find)",
        "4 teaspoons chopped fresh herbs (such as cilantro, epazote, thyme, marjoram)",
        "Kosher salt",
        "About 1/8 teaspoon black pepper, preferably freshly ground",
        "8 (6-inch) corn tortillas",
        "3 or 4 radishes, thinly sliced or cut into matchsticks",
        "A few tablespoons chopped white onion, for garnish",
        "Big, beautiful sprigs of cilantro, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Taco",
        "Cheese",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Radish",
        "Herb",
        "Cilantro",
        "Ricotta",
        "Chile Pepper",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herby Ricotta-Poblano Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/herby-ricotta-poblano-tacos"
}
