{
    "directions": [
        "In a large roasting pan stir together the tomatoes, the mushrooms, the bell pepper, the yellow onion, the shallots, the garlic, the pearl onions, the rosemary, orégano, and thyme sprig, 1/4 cup of the oil, and salt and pepper to taste. Arrange the lamb, patted dry, on top of the vegetable mixture, drizzle it with the remaining 2 tablespoons oil, and season it with salt and pepper. Roast the lamb and the vegetables in the middle of a preheated 450°F. oven for 15 minutes, reduce the temperature to 350°F., and roast the lamb and stirring the vegetables every 20 minutes, for 1 hour and 20 minutes more, or until the lamb registers 145°F. on a meat thermometer for medium-rare meat.",
        "Transfer the lamb to a cutting board and let it stand, covered loosely with foil, for 15 minutes. Reserve the pearl onions for the mixed baby vegetables. Transfer the lamb to a platter, spoon the baby vegetables around it, and garnish the lamb with the mint sprigs. If planning to make the stuffed cabbage reserve 1 pound of the lamb.",
        "In a kettle of boiling salted water cook separately the zucchini, the pattypan squash, the carrots, and the haricots verts until each vegetable is crisp-tender and cook the potato, peeled and cut into 1/2-inch dice, until it is cooked through, transferring the vegetables as they are cooked with a slotted spoon to a bowl of ice and cold water to stop the cooking. Drain the vegetables and pat them dry. The vegetables may be prepared up to this point 1 day in advance and kept covered and chilled.",
        "In a large skillet heat the oil over moderately high heat until it is hot but not smoking and in it sauté the zucchini, the pattypan squash, the carrots, the haricots verts, and the onions for 3 minutes, or until they are heated through. Stir in the potato, the herbs, and salt and pepper to taste and sauté the mixture for 1 minute. Serves 4."
    ],
    "ingredients": [
        "2 1/2 pounds (about 15) plum tomatoes, sliced thick",
        "10 ounces mushrooms, quartered",
        "1 red bell pepper, chopped",
        "1 yellow onion, halved, with the skin left on",
        "2 shallots with the skin intact",
        "2 heads of garlic, the outer skin removed, leaving the cloves attached at the root end",
        "1/4 pound red pearl onions (available at specialty produce markets) or white pearl onions, blanched in boiling water for 3 minutes, drained, and peeled",
        "2 fresh rosemary sprigs",
        "2 fresh orégano sprigs",
        "2 fresh thyme sprigs",
        "6 tablespoons olive oil",
        "a 6-pound leg of lamb, trimmed of excess fat",
        "mixed baby vegetables as an accompaniment",
        "fresh mint sprigs for garnish",
        "1/4 pound baby zucchini and/or baby yellow squash*",
        "1/4 pound baby yellow and/or green pattypan squash*",
        "6 ounces baby carrots, trimmed and peeled",
        "1/4 pound haricots verts* (thin green beans), trimmed",
        "1 small potato (about 1/4 pound)",
        "1 tablespoon olive oil",
        "the pearl onions reserved from the herbed roast leg of lamb",
        "1 tablespoon minced fresh dill and/or mint leaves, or to taste",
        "*available at specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Mushroom",
        "Onion",
        "Tomato",
        "Vegetable",
        "Roast",
        "Bell Pepper",
        "Spring",
        "Gourmet"
    ],
    "title": "Herbed Roast Leg of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-roast-leg-of-lamb-11546"
}
