{
    "directions": [
        "1. Remove the turkey from the refrigerator 1 hour before roasting.",
        "2. Combine the butter, parsley, sage, rosemary, and thyme in a food processor and process until smooth. Season with salt and pepper.",
        "3. Preheat the oven to 450°F.",
        "4. Put 4 cups of the chicken stock in a medium saucepan and keep warm over low heat.",
        "5. Season the cavity of the turkey with salt and pepper and fill the cavity with half of the carrots, celery, and onions. Rub the entire turkey with the herb butter and season liberally with salt and pepper.",
        "6. Scatter the remaining vegetables on the bottom of a large roasting pan. Fit a rack over the vegetables and put the turkey on top of the rack. Pour the remaining 2 cups stock into the bottom of the roasting pan and carefully put the pan in the oven. Roast until the turkey is light golden brown, about 45 minutes.",
        "7. Reduce the oven temperature to 350°F and continue roasting, basting with the warm chicken stock every 15 minutes, until an instant-read thermometer inserted in the thigh registers 160°F, about 2 1/2 hours longer.",
        "8. Remove the turkey from the oven, transfer to a large cutting board, and tent loosely with foil. Let rest for 30 minutes before carving.",
        "9. Strain the stock in the bottom of the roasting pan through a strainer lined with cheesecloth or paper towels into a medium saucepan. Discard the solids. Boil the stock until reduced to a sauce consistency. Arrange the turkey on a large platter and drizzle with the reduced stock."
    ],
    "ingredients": [
        "1 (17-pound) turkey, rinsed well and patted dry",
        "10 tablespoons (1 1/4 sticks) unsalted butter, softened",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1 tablespoon finely chopped fresh sage",
        "1 tablespoon finely chopped fresh rosemary",
        "1 tablespoon finely chopped fresh thyme",
        "Kosher salt and freshly ground black pepper",
        "6 cups chicken stock, homemade or store-bought",
        "3 large carrots, cut into 1-inch pieces",
        "3 large stalks celery, cut into 1-inch pieces",
        "2 large onions, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Herb Roasted Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-turkey-367469"
}
