{
    "directions": [
        "Trim all but a thin layer of fat from roast. Grind peppercorns and bay leaves with salt to a powder in an electric coffee/spice grinder, then transfer to a mortar. Add garlic, thyme, and rosemary, then pound to a smooth paste with pestle. Stir in oil. Rub paste all over roast. Transfer roast to a rack set in a small flameproof roasting pan. Marinate, covered and chilled, at least 8 hours.",
        "Let roast stand at room temperature 1 hour.",
        "Preheat oven to 450°F.",
        "Roast beef in middle of oven 20 minutes. Reduce temperature to 350°F and roast beef until a thermometer inserted into center of meat registers 110°F, 1 1/2 to 1 3/4 hours more. Transfer beef to a large platter and let stand, uncovered, 25 minutes. (Meat will continue to cook, reaching about 130°F for medium-rare.)",
        "Skim fat from pan juices. Add broth, rosemary, thyme, and garlic and deglaze pan by simmering on top of stove over moderate heat, stirring and scraping up brown bits. Transfer to a small saucepan and add any juices that have collected on platter. Gently simmer 10 minutes. Skim fat and season jus with salt and pepper.",
        "Put slices from roast and serve with jus."
    ],
    "ingredients": [
        "1 (7- to 8-lb) prime rib roast (sometimes called standing rib roast; 3 or 4 ribs)",
        "1 tablespoon whole black peppercorns",
        "2 bay leaves (not California)",
        "1 tablespoon kosher salt",
        "3 garlic cloves",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh rosemary",
        "1 tablespoon olive oil",
        "2 cups beef broth",
        "1 small fresh rosemary sprig",
        "1 small fresh thyme sprig",
        "1 garlic clove, smashed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Marinate",
        "Roast",
        "Winter",
        "Gourmet"
    ],
    "title": "Herbed Rib Roast",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-rib-roast-104394"
}
