{
    "directions": [
        "Place 1/2 cup flour, salt, and pepper into a plastic bag; toss to mix. Add the rabbit pieces, toss to coat with the flour mixture, and shake off excess. Heat 2 tablespoons of olive oil in a Dutch oven over medium-high heat until lightly smoking.",
        "Sear the rabbit pieces on each side until golden brown, then set aside. Pour in the remaining tablespoon of olive oil and stir in the sliced onions. Cook until the onions have softened, about 2 minutes; then stir in the mushrooms and garlic, cook for an additional 2 minutes. Add the thyme, basil, rosemary, and bay leaves; season to taste with salt and pepper.",
        "Place the browned rabbit pieces into the Dutch oven, and pour in the beer and chicken stock. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the rabbit is very tender, 25 to 30 minutes.",
        "Stir 3 tablespoons of flour into the softened butter until smooth. Remove the rabbit from the simmering broth and set aside. Skim any visible fat from the liquid, then whisk in the butter paste. Simmer for 3 or 4 minutes until thickened, then remove the bay leaves, season again with salt and pepper if needed, and stir in the parsley. Serve the thickened sauce with braised rabbit."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 (3 pound) rabbit meat, cleaned and cut into pieces",
        "3 tablespoons extra-virgin olive oil",
        "2 cups thinly sliced onions",
        "1 1/2 pounds mushrooms, thinly sliced",
        "2 tablespoons chopped garlic",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh rosemary",
        "2 bay leaves",
        "2 cups amber beer",
        "1 quart chicken stock",
        "3 tablespoons all-purpose flour",
        "2 tablespoons softened butter",
        "1 tablespoon minced fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Herb and Beer Braised Rabbit",
    "url": "http://allrecipes.com/recipe/111578/herb-and-beer-braised-rabbit/"
}
