{
    "directions": [
        "Cook haricots verts in a large pot of boiling salted water until just tender, 3 to 4 minutes. Transfer with a slotted spoon to a bowl of ice and cold water, then drain.",
        "Add edamame to boiling water and cook 4 minutes. Drain in a colander, then rinse under cold water. If using edamame in pods, shell them and discard pods.",
        "Cook onion, garlic, bay leaf, rosemary, salt, and pepper in oil in a 2- to 4-quart heavy saucepan over moderately low heat, stirring, until softened, about 3 minutes. Add carrot and celery and cook, stirring, until softened, about 3 minutes.",
        "Add white beans and stock and simmer, covered, stirring occasionally, 10 minutes. Add haricots verts and edamame and simmer, uncovered, until heated through, 2 to 3 minutes. Add butter, parsley, and chervil (if using) and stir gently until butter is melted. Discard bay leaf and rosemary sprigs."
    ],
    "ingredients": [
        "6 ounces haricots verts (French thin green beans), trimmed and halved crosswise",
        "1 (1-pound) bag frozen edamame (soybeans in the pod) or 1 1/4 cups frozen shelled edamame, not thawed",
        "2/3 cup finely chopped onion",
        "2 garlic cloves, minced",
        "1 Turkish bay leaf or 1/2 California bay leaf",
        "2 (3-inch) fresh rosemary sprigs",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon olive oil",
        "1 medium carrot, cut into 1/8-inch dice",
        "1 medium celery rib, cut into 1/8-inch dice",
        "1 (15- to 16-ounces) can small white beans, rinsed and drained",
        "1 1/2 cups chicken stock or low-sodium broth",
        "2 tablespoons unsalted butter",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1 tablespoon finely chopped fresh chervil (optional)",
        "Garnish: fresh chervil sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Soy",
        "Vegetable",
        "Side",
        "Green Bean",
        "Summer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Herbed Bean Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-bean-ragout-106374"
}
