{
    "directions": [
        "Cook onions in oil in a 12-inch heavy nonstick skillet over moderately low heat, stirring frequently, until deep golden brown, 25 to 30 minutes. Transfer to a medium bowl, reserving 3 1/2 tablespoons onions in a small bowl for stuffing and sauce. (Do not clean skillet.)",
        "While onions are browning, simmer lentils in 1 cup broth and 1 cup water in a 3-quart saucepan, uncovered, stirring occasionally, until just tender, 20 to 25 minutes. Drain lentils in a sieve, then stir into onions in medium bowl along with salt and pepper. Cool to room temperature.",
        "Stir together dill, 3 tablespoons parsley, 2 tablespoons reserved onions, and salt and pepper to taste in a small bowl. Pat chicken dry and cut a 3- to 4-inch-long pocket horizontally in thicker side of each chicken breast. Gently stuff chicken breasts with herbed onions, then season chicken with salt and pepper.",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then turn off burner directly below where chicken will go and reduce remaining burner(s) to moderately high.",
        "Grill chicken, covered only if using a gas grill, on lightly oiled grill rack, turning over once, until cooked through, 8 to 11 minutes total. Transfer to a plate and let stand, loosely covered, while making sauce.",
        "Stir together arrowroot and 2 tablespoons broth in a small bowl. Purée remaining 1 1/2 tablespoons reserved onions with remaining 1 1/4 cups broth in a blender until smooth, then pour into skillet and deglaze by boiling over moderate heat, stirring and scraping up brown bits, 1 minute. Reduce heat to low, then add arrowroot mixture and cook, stirring, until just thickened, about 1 minute (do not let boil). Stir in 1/2 teaspoon lemon juice and season with salt and pepper. Remove from heat and keep warm, covered.",
        "Stir mint, remaining tablespoon parsley, and remaining 2 teaspoons lemon juice into lentils, then toss with lettuce and season with salt and pepper. Slice chicken, then divide salad among 6 plates and top with chicken, feta, and sauce.",
        "*Available at specialty foods shops and some supermarkets."
    ],
    "ingredients": [
        "3/4 lb onions, finely chopped (2 cups)",
        "2 teaspoons olive oil",
        "2/3 cup French green lentils* (4 1/2 ounces), picked over and rinsed",
        "2 1/4 cups plus 2 tablespoons fat-free chicken broth (18 fl oz)",
        "1 cup water",
        "1/2 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1 1/2 tablespoons coarsely chopped fresh dill",
        "4 tablespoons coarsely chopped fresh flat-leaf parsley",
        "6 (6-ounces) skinless boneless chicken breast halves",
        "1 teaspoon arrowroot",
        "2 1/2 teaspoons fresh lemon juice",
        "1 tablespoon coarsely chopped fresh mint",
        "1/2 lb Bibb lettuce (2 heads), leaves separated (torn if large)",
        "1 ounce crumbled feta (1/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Fourth of July",
        "Picnic",
        "Backyard BBQ",
        "Feta",
        "Lemon",
        "Mint",
        "Lentil",
        "Summer",
        "Grill",
        "Dill",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Herb-Stuffed Chicken with Caramelized Onion, Lentil, and Feta Salad",
    "url": "http://www.epicurious.com/recipes/food/views/herb-stuffed-chicken-with-caramelized-onion-lentil-and-feta-salad-108338"
}
