{
    "directions": [
        "Reserve 8 of the grapes, halve the remaining grapes, and in a small saucepan let the grape halves macerate in the wine for 1 hour. Halve the fillets lengthwise, season them with salt and pepper, and sprinkle the skinned sides with the parsley and the thyme. Roll up each fillet half with 1 of the reserved grapes in the middle and secure it with a wooden pick. Stand the fish rolls up in a saucepan just large enough to hold them in one layer without crowding them. Transfer the macerated grapes with a slotted spoon to a small bowl, bring the wine to a boil, and pour it over the fish rolls. Cook the fish rolls, covered, at a bare simmer for 10 to 15 minutes, or until they just flake. Transfer the fish rolls with a slotted spoon to a plate, reserving the cooking liquid, and keep them warm, covered.",
        "In a small saucepan cook the onion in the butter over moderate heat, stirring, for 5 minutes, stir in the flour, and cook the roux over moderately low heat, stirring, for 3 minutes. Remove the pan from the heat and strain the reserved cooking liquid through a fine sieve into the pan. Add the cream, the macerated grapes, the lemon juice, and salt and pepper to taste and boil the sauce, stirring for 3 minutes. Pour off any liquid that has accumulated on the plate, divide the fish rolls among 4 heated plates, and spoon the sauce over them."
    ],
    "ingredients": [
        "2/3 cup seedless green grapes",
        "3/4 cup dry white wine",
        "four 6- to 8-ounce skinless flounder or orange roughy fillets",
        "1/3 cup minced fresh parsley leaves",
        "1 tablespoon minced fresh thyme leaves or 3/4 teaspoon crumbled dried",
        "1/4 cup minced onion",
        "2 tablespoons unsalted butter",
        "1 tablespoon all-purpose flour",
        "1/4 cup heavy cream",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "White Wine",
        "Grape",
        "Gourmet"
    ],
    "title": "Herbed Fish Rolls in White Wine with Grapes",
    "url": "http://www.epicurious.com/recipes/food/views/herbed-fish-rolls-in-white-wine-with-grapes-10411"
}
