{
    "directions": [
        "Preheat oven to 450°F. Set a rack inside a large roasting pan. Pat turkey dry with paper towels. Rub bird inside and out with salt and pepper.",
        "Place turkey on the rack in the pan. Using a fork, mix butter, lemon zest, rosemary, sage, and thyme in a small bowl. Rub herb butter over top of turkey and inside cavity.",
        "Place onion, orange, and lemon inside turkey cavity. Tuck tips of wings under bird (this prevents them from burning during the long roasting time). Pour 4 cups water into pan. Roast turkey, uncovered, for 30 minutes. Reduce oven temperature to 325°F. Baste turkey with pan juices; add more water if needed to maintain at least 1/4\" liquid in the bottom of roasting pan. Continue roasting turkey, basting every 30 minutes and tenting with foil if skin is turning too dark, until an instant-read thermometer inserted into thickest part of the thigh without touching bone registers 165°F (juices should run clear when thermometer is removed), about 2 3/4 hours total.",
        "Transfer turkey to a platter. Tent with foil and let rest for 1 hour before carving."
    ],
    "ingredients": [
        "1 12-14-pound turkey, giblets and neck removed, at room temperature for 1 hour",
        "3 tablespoons kosher salt",
        "1 1/2 tablespoons freshly ground black pepper",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1 tablespoon finely grated lemon zest",
        "1 tablespoon minced fresh rosemary",
        "1 tablespoon minced fresh sage leaves",
        "1 tablespoon minced fresh thyme leaves",
        "1 medium onion, quartered",
        "1 orange, quartered",
        "1 lemon, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Herb-Roasted Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/herb-roasted-turkey-51122800"
}
