{
    "directions": [
        "One: Wash the chicken and pat dry. Put the chicken pieces in a large non reactive glass or stainless steel bowl. Stir the garlic into the buttermilk or yogurt. Pour it over the chicken and turn until coated and submerged in the liquid. Marinate for at least 30 minutes or up to an hour, refrigerated. Meanwhile, combine the spices, herbs, and salt in a bowl and stir until they are evenly blended. Put the flour in a paper or large Zip-lock plastic bag and sprinkle the spice-herb mixture over it. Close the bag and shake until the seasoning is well-distributed.",
        "Two: If you plan to serve the chicken hot, preheat the oven to 150°F. Fit a wire cooling rack on a cookie sheet and set aside. Fill a Dutch oven or deep-fat fryer with enough lard or oil to come halfway up the sides. Over medium-high heat, bring the fat to 375°E (hot but not smoking).",
        "Three: Beginning with the dark meat, lift the chicken pieces out of the marinade one at a time, allowing the excess to flow back into the bowl, and drop them into the bag with the seasoned flour. Close the bag and shake until the chicken is well coated. Lift out of the flour, shake off the excess, and slip enough of pieces into the fat to fill the pan or fryer without crowding it. Deep-fry until the outside is a rich brown and the chicken is tender, maintaining the temperature at 365°F about 15 to 20 minutes, turning the chicken once, if necessary.",
        "Four: Remove the pieces as they are done, drain well, and place on the wire rack set in a cookie sheet. If you want to serve it hot, keep the finished chicken in the warm oven while you fry the second batch."
    ],
    "ingredients": [
        "2 frying chickens, weighing no more than 3 pounds each, cut up for frying",
        "2 tablespoons chopped garlic (about 8 large cloves)",
        "4 cups buttermilk or plain all natural yogurt, stirred until smooth",
        "3 cups unbleached all-purpose flour",
        "Lard or peanut oil, for frying",
        "1/2 teaspoon ground cayenne pepper",
        "1 teaspoon freshly ground cumin",
        "1/2 teaspoon ground mace",
        "1 teaspoon freshly grated nutmeg",
        "1 teaspoon paprika",
        "1 teaspoon freshly milled black pepper",
        "1 teaspoon ground ginger",
        "2 teaspoons crumbled dried basil",
        "2 teaspoons bay leaves ground to a powder (use a spice mill or blender)",
        "2 teaspoons crumbled dried oregano",
        "2 teaspoons crumbled dried sage",
        "2 teaspoons crumbled dried thyme",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Garlic",
        "Ginger",
        "Fry",
        "Marinate",
        "Kid-Friendly",
        "Yogurt",
        "Mardi Gras",
        "Dinner",
        "Lunch",
        "Basil",
        "Sage",
        "Thyme",
        "Oregano",
        "Nutmeg",
        "Buttermilk",
        "Cumin",
        "Paprika",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Herb-and-Spice Southern Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/herb-and-spice-southern-fried-chicken-358324"
}
