{
    "directions": [
        "1. Put the garlic cloves in a large steamer basket set over a pan of simmering water and top with the spinach, parsley, celery, and cilantro. Cover and steam until the garlic is soft and the greens are very tender, about 15 minutes. Let cool, then squeeze the greens dry, finely chop, and set aside. Using the back of a fork, mash the garlic cloves.",
        "2. In a medium cazuela set over a flame-tamer or in a heavy-bottomed skillet, heat 1 tablespoon of the olive oil until shimmering. Add the mashed garlic, olives, paprika, cayenne, and cumin and stir over moderately high heat for 30 seconds, or until fragrant. Add the greens and cook, mashing and stirring, until soft and dry and somewhat smooth, about 15 minutes.",
        "3. Remove from heat and let cool to room temperature. Mash in the remaining olive oil. Refrigerate, closely covered, for at least 1 day and up to 4 days.",
        "4. To serve, return to room temperature. Stir in the lemon juice and season with salt and pepper. Pack in a serving dish and serve with crackers or semolina bread ."
    ],
    "ingredients": [
        "4 large garlic cloves, halved",
        "1 pound baby spinach leaves",
        "1 large bunch of flat-leafed parsley (about 4 ounces), stems discarded",
        "1/2 cup celery leaves, coarsely chopped",
        "1/2 cup cilantro leaves, stemmed",
        "1/4 cup extra virgin olive oil",
        "12 oil-cured black olives (about 1 ounce), pitted, rinsed, and coarsely chopped",
        "1 1/4 teaspoons Spanish sweet smoked paprika (pimentón de la Vera)",
        "Pinch of cayenne",
        "Pinch of ground cumin",
        "1 tablespoon lemon juice, or more to taste",
        "Salt and freshly ground pepper",
        "Crackers or semolina bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Olive",
        "Steam",
        "Lemon",
        "Spinach",
        "Cilantro",
        "Parsley"
    ],
    "title": "Herb Jam with Olives and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/herb-jam-with-olives-and-lemon-231567"
}
