{
    "directions": [
        "Place Reynolds(R) Oven Bag in roasting pan at least 2 inches deep.",
        "Combine wine, shallot, olive oil, Worcestershire sauce, garlic, flour, rosemary, sage, thyme, salt, and black pepper in bag. Gently knead to combine. Add beef rib roast to bag. Close bag with tie (found inside package).",
        "Marinate in the refrigerator for 6 to 24 hours, turning bag occasionally.",
        "Preheat oven to 325 degrees F.",
        "Cut six 1/2-inch slits in top of bag to allow steam to escape. Insert an oven-safe meat thermometer through one of the slits into center of roast, making sure thermometer does not touch bone. Tuck ends of bag in pan.",
        "Place pan in oven, allowing room for bag to expand during cooking without touching heating elements, wall, or racks. Bag should not hang over pan.",
        "Roast until desired doneness. Allow 1 3/4 to 2 1/4 hours for medium rare (135 degrees F) or 2 1/4 to 2 3/4 hours for medium (150 degrees F). Let stand in oven bag for 15 minutes. (The temperature of the meat after standing should be 145 degrees F for medium rare or 160 degrees F for medium.) Carefully cut open top of oven bag. Remember: Always support bag with pan.",
        "Transfer meat to a cutting board for carving. Carefully drain juices from oven bag into baking dish; toss bag. Skim excess fat from the juices. Stir in butter, if desired. Serve hot pan juices over sliced meat."
    ],
    "ingredients": [
        "1 cup dry red wine",
        "1/2 cup chopped shallot",
        "1/4 cup olive oil",
        "1 tablespoon Worcestershire sauce",
        "2 cloves garlic, minced",
        "2 tablespoons all-purpose flour",
        "1 teaspoon dried rosemary, crushed",
        "1/2 teaspoon dried sage, crushed",
        "1/2 teaspoon dried thyme, crushed",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (4 pound) beef rib roast",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Herbed Prime Rib Roast with Red Wine Sauce",
    "url": "http://allrecipes.com/recipe/238753/herbed-prime-rib-roast-with-red-wine/"
}
