{
    "directions": [
        "Combine 1 quart water and all remaining ingredients in medium saucepan. Bring to boil, stirring until sugar and salt dissolve. Pour brine into wide pot or container large enough to hold pork (3- to 4-gallon capacity). Add remaining 5 quarts cold water; stir to blend. Let stand until brine is cool to touch, about 1 hour.",
        "Place pork on work surface. Trim off all but 1/4-inch layer of fat from roast. Turn roast over so that rib bones point up. Using boning knife and starting where meat meets rib bones, gradually cut loin away from rack of bones, leaving 2 inches of meat attached to bones (do not cut meat off bones completely). Tie meat back onto bones with kitchen string at 2-inch intervals. Place roast in brine, submerging pork completely and weighing down with heavy pot if necessary. Cover and refrigerate 5 days.",
        "Remove pork from brine; discard brine. Rinse pork under cold running water for 5 minutes to reduce saltiness; pat dry with paper towels. Place pork on rack set over sheet of foil; let stand at room temperature 2 hours.",
        "Position rack in center of oven and preheat to 400°F. Place pork on rack in large roasting pan. Mix thyme and crushed peppercorns in small bowl; sprinkle mixture over pork. Roast until instant-read thermometer inserted into center of pork registers 140°F, about 1 hour. Remove from oven. Let roast rest 30 minutes (internal temperature of roast will increase 5 to 10 degrees).",
        "Remove kitchen string from roast. Cut meat into slices and serve.",
        "*Available in the spice section of most supermarkets."
    ],
    "ingredients": [
        "6 quarts cold water, divided",
        "1 1/2 cups sugar",
        "3/4 cup fine sea salt",
        "8 large fresh thyme sprigs",
        "6 Turkish bay leaves, crumbled",
        "4 juniper berries*",
        "2 teaspoons whole black peppercorns",
        "1 6- to 6 1/2-pound center-cut pork rib roast (8-bone; about 12 to 14 inches long), well-trimmed",
        "2 tablespoons chopped fresh thyme",
        "2 teaspoons whole black peppercorns, crushed in mortar with pestle or in resealable plastic bag with mallet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pork",
        "Roast",
        "Christmas",
        "New Year's Eve",
        "Brine"
    ],
    "title": "Herb-Brined Pork Prime Rib Roast",
    "url": "http://www.epicurious.com/recipes/food/views/herb-brined-pork-prime-rib-roast-231595"
}
