{
    "directions": [
        "Place potatoes in a large saucepan and cover with 1\" cold water; season with salt. Bring to a boil, reduce heat, and simmer until tender, 10–15 minutes. Drain.",
        "Meanwhile, preheat oven to 400°F. Season lamb with salt and pepper. Heat 2 tablespoons oil in a large skillet over medium-high heat. Cook lamb, turning occasionally, until golden brown all over, 6–8 minutes; transfer to a foil-lined baking sheet, placing fat side up.",
        "Mix garlic, parsley, dill, mustard, cumin, and 1 tablespoon oil in a small bowl; season with salt and pepper.",
        "Spread herb mixture over lamb and roast until an instant-read thermometer inserted into thickest part of meat registers 130°F for medium-rare, 18–22 minutes. Transfer to a cutting board and let lamb rest 5 minutes before cutting into double chops.",
        "While lamb is resting, heat remaining 1 tablespoon oil in a medium skillet over medium heat. Add potatoes and watercress and cook, tossing, until watercress is just wilted, about 1 minute. Mix in vinegar and season with salt and pepper. Serve lamb with watercress and potatoes."
    ],
    "ingredients": [
        "1 1/2 pounds small new or Yukon Gold potatoes, scrubbed",
        "Kosher salt",
        "2 racks of lamb (about 2 pounds total)",
        "Freshly ground black pepper",
        "4 tablespoons olive oil, divided",
        "2 garlic cloves, chopped",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/4 cup chopped fresh dill",
        "1 tablespoon Dijon mustard",
        "2 teaspoons cumin seeds, crushed",
        "6 cups watercress leaves with tender stems",
        "2 teaspoons Sherry vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Potato",
        "Easter",
        "Dinner",
        "Rack of Lamb",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Herb-Crusted Rack of Lamb with New Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/herb-crusted-rack-of-lamb-with-new-potatoes-51231730"
}
