{
    "directions": [
        "Bring hibiscus flowers and 2 cups water to a simmer in a small saucepan. Remove from heat; let steep until flowers are just tender, 5-8 minutes. Strain; reserve flowers. Heat olive oil in a large heavy pot over medium heat; add onion and sauté until soft but not brown. Add reserved hibiscus flowers, carrots, and next 4 ingredients; cook, stirring often, until carrots are soft and liquid evaporates, about 15 minutes. Season with salt and pepper. Keep warm.",
        "Combine the first 4 ingredients and 2 cups water in a pot over medium heat. Cook, stirring occasionally, until tomatoes begin to fall apart, about 20 minutes. Remove from heat and transfer mixture to a blender; purée until smooth. Wipe out pot; add oil and heat over medium-high heat. When oil begins to smoke, carefully add purée and bay leaves. Bring to a boil, reduce to a simmer, and cook, stirring occasionally, until thickened, about 10 minutes. Season with salt.",
        "Pour oil into a large skillet to a depth of 1/4\"; heat over medium-high heat until shimmering. Working in batches, submerge tortillas and cook, turning once, until they soften, 30-45 seconds. Drain on paper towels. Put 1/4 cup of filling in center of each tortilla; roll to enclose. Place 2 enchiladas on each plate. Smother with chipotle sauce and garnish with sour cream, cabbage, and Cotija cheese."
    ],
    "ingredients": [
        "1 cup dried hibiscus flowers",
        "1/4 cup olive oil",
        "1 large onion, thinly sliced",
        "2 large carrots, grated",
        "1/2 cup grated jicama",
        "1/4 cup sugar",
        "1/2 teaspoon ground dried oregano",
        "1/4 teaspoon dried thyme leaves",
        "Kosher salt and freshly ground black pepper",
        "2 pounds ripe plum tomatoes, cored, halved",
        "1/2 white onion, chopped",
        "3 garlic cloves, thinly sliced",
        "2 canned chipotle chiles in adobo",
        "2 tablespoons vegetable oil",
        "3 large dried bay leaves",
        "Kosher salt",
        "Vegetable oil",
        "12 6\" corn tortillas",
        "1 cup sour cream",
        "1 cup thinly sliced purple cabbage",
        "1/2 cup Cotija cheese or feta, crumbled",
        "Ingredient info: Dried hibiscus flowers, also called Jamaica flowers, are available at some natural foods stores and at Latin markets. Look for canned chipotle chiles and Cotija cheese at better supermarkets and at Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Vegetarian",
        "Low Cal",
        "Dinner",
        "Healthy",
        "Tortillas",
        "Chile Pepper",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hibiscus-Flower Enchiladas",
    "url": "http://www.epicurious.com/recipes/food/views/hibiscus-flower-enchiladas-368293"
}
