{
    "directions": [
        "Preheat oven to 250°F. Line a rimmed baking sheet with parchment paper. In a small bowl, whisk together 2 tsp. superfine sugar, cornstarch, and salt, breaking up any lumps; set aside.",
        "Grind flowers or tea leaves (cut open bags, remove tea, and discard bags) in a spice mill or food processor until very finely ground; set aside.",
        "Using an electric mixer fitted with a whisk attachment, beat egg whites and cream of tartar or vinegar on medium-high speed until the mixture transforms from frothy soapsuds to soft, opaque peaks, about 3 minutes. You should see tracks from the whisk on the surface of the whites.",
        "Add the remaining 1/2 cup sugar slowly, 1 tablespoon at a time, beating to incorporate fully before adding the next spoonful, 5–8 minutes total. Continue to beat on medium-high speed until stiff, glossy peaks form, about 2 minutes more. Test to see if sugar is fully dissolved by rubbing a small amount between your fingertips. If it still feels gritty, keep beating until dissolved.",
        "Sprinkle the sugar, cornstarch, and salt mixture over egg whites and fold in gently with a spatula. Using a fine-mesh strainer, sift 1 Tbsp. reserved ground tea over mixture and fold in gently. Reserve remaining ground tea.",
        "Using a large spoon, divide meringue into 6 even mounds on the prepared baking sheet. Using the back of the spoon, make a small well in the center of each meringue. Lightly dust 1 tsp. reserved ground tea with fine-mesh strainer over meringues. Reserve remaining ground tea.",
        "Bake, rotating halfway through cooking time, until outsides are dry and a very pale cream color, 65–70 minutes. Turn oven off and leave door slightly ajar with meringues inside, letting them cool completely, at least 2 hours or up to overnight.",
        "Bring 1 cup water to a boil in a small pot. Remove from heat and steep dried hibiscus flowers or tea bags, 4–5 minutes. Strain tea or discard tea bags; if straining, strain into a medium bowl, then return tea to pot. Add sugar and bring to a boil over high heat. Reduce the liquid, stirring occasionally, until a scant 1/4 cup liquid is left, 8–11 minutes—it should be thick with a syrupy consistency. Transfer to a small bowl and chill until cold, about 20 minutes.",
        "Using an electric mixer fitted with a whisk attachment, beat cream on medium-low speed in a large bowl until very soft peaks form. Reduce speed to low and gently beat in lemon curd, sour cream, and salt. If necessary, continue whipping until soft peaks return. Drizzle 1 Tbsp. chilled hibiscus syrup over whipped cream. Using a spatula, marble syrup throughout cream, creating dark pink streaks rather than a solid pink cream.",
        "Divide meringues among 6 dessert plates, then top each with a dollop of lemon-hibiscus cream. Using a fine-mesh strainer, lightly dust top of each pavlova with 1 tsp. reserved ground tea total, if desired, and serve immediately."
    ],
    "ingredients": [
        "1/2 cup plus 2 teaspoons superfine sugar, divided",
        "2 teaspoons cornstarch",
        "1/8 teaspoon fine sea salt",
        "6 tablespoons dried hibiscus flowers (available at natural food stores, Latin or Middle Eastern markets, or online) or 7 hibiscus tea bags",
        "3 large egg whites, room temperature",
        "1/4 teaspoon cream of tartar or 3/4 teaspoon distilled white vinegar",
        "2 tablespoons dried hibiscus flowers or 2 hibiscus tea bags",
        "1/4 cup superfine sugar",
        "1 cup cold heavy cream",
        "3 tablespoons homemade or store-bought lemon curd",
        "2 tablespoons sour cream",
        "Pinch of fine sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Egg",
        "Herb",
        "Dessert",
        "Easter",
        "Passover",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Spring",
        "Summer",
        "Sour Cream",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hibiscus Pavlova with Lemon-Hibiscus Cream",
    "url": "http://www.epicurious.com/recipes/food/views/hibiscus-pavlova-with-lemon-hibiscus-cream-56389421"
}
