{
    "directions": [
        "Preheat oven to 375°F with racks in upper and lower thirds.",
        "Cook bacon in skillet over medium heat, turning occasionally, until crisp. Drain on paper towels, then finely chop.",
        "Pour off fat from skillet, then wipe clean. Add corn and pan-roast over medium heat, stirring occasionally, until kernels are mostly golden brown, 10 to 15 minutes.",
        "Bring water to a boil with butter and salt in a heavy medium saucepan, stirring until butter is melted. Add flour all at once and cook over medium heat, stirring vigorously with a wooden spoon, until mixture pulls away from side of pan, about 2 minutes. Remove from heat and cool slightly, about 3 minutes. Add 4 eggs, 1 at a time, beating well after each addition. (Batter will appear to separate at first but will then become smooth.) Mixture should be glossy and just stiff enough to hold soft peaks and fall softly from a spoon. If batter is too stiff, beat remaining egg in a small bowl and add to batter 1 teaspoon at a time, beating and then testing batter until it reaches proper consistency.",
        "Stir in bacon, corn, cheeses, chives, and 1/2 teaspoon pepper.",
        "Line 2 large baking sheets with parchment paper or lightly butter sheets. Fill a pastry bag fitted with 1/2-inch plain tip with batter and pipe about 35 (3/4-inch-diameter) mounds, or spoon mounded teaspoons, 1/4 inch apart, onto each sheet. Bake, switching position of sheets halfway through baking, until puffed, golden, and crisp, 25 to 30 minutes total. Transfer to a rack (still on parchment if using). Make more puffs on cooled baking sheets. Serve warm or at room temperature."
    ],
    "ingredients": [
        "4 hickory-smoked bacon slices (1/4 pound)",
        "3/4 cup corn (from 2 medium ears)",
        "1 cup water",
        "1 stick unsalted butter, cut into tablespoon pieces",
        "1/4 teaspoon salt",
        "1 cup all-purpose flour",
        "4 to 5 large eggs",
        "1 1/2 cups coarsely grated extra-sharp Cheddar (5 ounces)",
        "2 tablespoons grated Parmigiano-Reggiano",
        "2 tablespoons finely chopped chives",
        "Equipment: a 10- to 12-inch well-seasoned cast-iron skillet; a pastry bag with 1/2-inch plain tip (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Appetizer",
        "Side",
        "Bake",
        "Thanksgiving",
        "Cheddar",
        "Parmesan",
        "Bacon",
        "Corn",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly"
    ],
    "title": "Hickory-Bacon and Roasted-Corn Gougeres",
    "url": "http://www.epicurious.com/recipes/food/views/hickory-bacon-and-roasted-corn-gougeres-240567"
}
