{
    "directions": [
        "Sprinkle the yeast over warm water in a large bowl bowl. Let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Beat in the sugar, egg, 1/2 teaspoon salt, and whole wheat flour with an electric mixer on low for 3 minutes. Stir in the bread flour, a 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 30 minutes.",
        "While the dough is rising, heat a large skillet over medium heat and cook and stir until the pork is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the ranch dressing mix until meat is well-coated. Add the cabbage, zucchini, onion, red bell pepper, carrot, and garlic. Cook and stir until the vegetables are tender and most of the liquid has evaporated, about 10 minutes. Season with salt and pepper. Set aside.",
        "Deflate the dough and turn it out onto a lightly floured surface. Use a knife to divide the dough into four equal pieces-don't tear it. Roll each portion out to an 8-inch square, then cut each large square into four smaller squares. Place about 3 tablespoonfuls of the pork filling into the center of each square. Bring the corners over the filling and pinch to seal. Secure with a toothpick, if needed. Spray a baking sheet with cooking spray. Place the pouches on the prepared baking sheet about 3-inches apart. Cover the pouches with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Bake in the preheated oven until golden brown, about 15 minutes. Remove from pan and discard toothpicks. Brush each pocket with melted butter. Serve hot."
    ],
    "ingredients": [
        "1 1/2 teaspoons rapid rise yeast",
        "1/2 cup warm water (110 degrees F to 115 degrees F)",
        "3 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 egg",
        "1/2 cup whole wheat flour",
        "1 1/2 cups bread flour, or as needed",
        "1 pound ground pork",
        "1 (1 ounce) package ranch dressing mix (such as Hidden Valley Ranch®)",
        "1 cup finely chopped cabbage",
        "1 small zucchini, grated",
        "1 small onion, chopped",
        "1/2 cup red bell pepper, finely chopped",
        "1 carrot, grated",
        "1 teaspoon minced garlic, or to taste",
        "salt and pepper to taste",
        "1 tablespoon butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hidden Treasures Ranch Pockets",
    "url": "http://allrecipes.com/recipe/215009/hidden-treasures-ranch-pockets/"
}
