{
    "directions": [
        "To decarb herb, preheat oven to 225°F and line a small rimmed baking sheet with parchment paper. Sort cannabis bud and flower for stems and seeds (discard stems and seeds). Finely grind herb using a hand herb grinder or very finely chop with a chef’s knife. Spread herb into an even layer in pan. Cover pan tightly with foil, crimping it around edges of pan, and bake until golden brown, 40–50 minutes. Let cool, covered, 20 minutes. Makes about 2 tsp. decarbed herb.",
        "Preheat oven to 250°F. Stir salt, baking soda, garlic powder, cinnamon, coriander, and cumin in a medium bowl. Stir in 1/2 tsp. decarbed herb (be careful to only use 1/2 tsp. here, reserving the remaining decarbed herb for another use.)",
        "Heat oil in a small saucepan over medium-high. Add honey, sugar, Sriracha, and cayenne, if using, and bring to a boil. Add 1 Tbsp. water and cook 1 minute. Remove from heat and stir in lime zest and spice mixture.",
        "Place popcorn in a large bowl and pour spicy honey syrup over. Using a rubber spatula, quickly stir to evenly coat popcorn. Transfer popcorn to a parchment-lined rimmed baking sheet and bake, tossing every 15 minutes, 45 minutes total. Let cool 5 minutes before devouring (it will get crunchy as it cools).",
        "This recipe is only intended for those who have obtained marijuana legally under applicable federal and state laws.",
        "An herb grinder",
        "Popcorn can be made 4 days ahead; store in an airtight container at room temperature."
    ],
    "ingredients": [
        "1.25 grams (1/16th ounce) cannabis",
        "1 teaspoon kosher salt",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground cumin",
        "1/4 cup virgin coconut oil, melted",
        "1/4 cup honey",
        "1/4 cup sugar",
        "1 tablespoon Sriracha",
        "1/2 teaspoon cayenne pepper (optional)",
        "Zest of 1 lime",
        "10 cups popped popcorn (from about one 3.5-ounce bag)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cooking After Dark",
        "Corn",
        "Honey",
        "snack",
        "Lime"
    ],
    "title": "High Honey-Sriracha Popcorn",
    "url": "http://www.epicurious.com/recipes/food/views/high-honey-sriracha-popcorn"
}
