{
    "directions": [
        "Dissolve kosher salt and sugar in water in a large container to make brine. Place chicken into brine, cover, and refrigerate until chicken meat is seasoned, 1 to 4 hours.",
        "Stir unsalted butter, Dijon mustard, garlic, and thyme in a bowl and let stand at room temperature while chicken marinates in brine.",
        "Remove chicken from brine, rinse chicken, and discard used brine. Use a sharp, sturdy knife or poultry shears to slice along both sides of the backbone from the tail to the neck, through the bones; remove backbone and tail. Turn chicken over, spread open with breast side facing up, and hit chicken sharply with the heel of your hand between the two chicken breasts to break the breast bone. Press chicken flat with your hands.",
        "Dry chicken thoroughly with paper towels on both sides. Use your fingers to loosen the skin over the chicken breast and thighs. Stir 1 pinch black pepper into the seasoned butter mixture and spread butter mixture generously underneath the skin. Pat chicken dry again. Lay the flattened chicken, breast side up, on the top of a 2-part broiler pan. Rub chicken with vegetable oil and sprinkle with more black pepper.",
        "Move a rack into the lower third of oven and preheat oven to 500 degrees F (260 degrees C). Line the bottom of broiler pan with aluminum foil.",
        "Place potato slices into bottom of broiler pan atop aluminum foil; toss potatoes with olive oil and season with salt and black pepper. Place top of broiler pan containing chicken over pan bottom.",
        "Roast chicken and potatoes in the preheated oven for 20 minutes; rotate pan and roast until an instant-read meat thermometer inserted into the thickest part of a thigh reads 160 degrees F (70 degrees C), about 20 more minutes. Let chicken rest on platter or cutting board while you blot excess chicken fat from top of potato slices. Invert broiler pan bottom to turn potatoes out into a serving dish and blot again with paper towels. Cut chicken in quarters with a sharp knife and serve with potatoes."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "1/2 cup white sugar",
        "2 quarts water",
        "1 (4 pound) whole chicken",
        "2 tablespoons unsalted butter, softened",
        "1 tablespoon Dijon mustard",
        "1 clove garlic, minced",
        "1 teaspoon fresh thyme leaves",
        "1 pinch ground black pepper",
        "1 1/2 teaspoons vegetable oil",
        "2 1/2 pounds russet potatoes, peeled and sliced",
        "1 tablespoon olive oil",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "High Roast Chicken",
    "url": "http://allrecipes.com/recipe/230473/high-roast-chicken/"
}
