{
    "directions": [
        "Dissolve 1 tablespoon sugar in warm water in a small bowl, and sprinkle the yeast over the water. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam.",
        "In a bowl, mix together the potato flakes, whole wheat flour, and unbleached flour. In a large bowl, mix together the buttermilk, softened butter, 2 tablespoons of sugar, salt, and egg until the mixture is well combined. Pour the yeast mixture into the buttermilk mixture, and add the flour mixture by half cups, stirring until the ingredients form a soft dough. Turn the dough out onto a well-floured surface, and knead until smooth and elastic, about 3 minutes.",
        "Shape the dough into a ball, oil the surface with vegetable oil, cover, and let rise in a warm place until doubled, about 1 hour.",
        "Gently punch down the dough, and divide into 9 equal pieces. Shape the pieces into balls. Grease an 8x8-inch baking dish, and place the rolls into the dish so the rolls slightly touch each other. Brush the tops with melted butter. Cover the rolls with plastic wrap, and allow to rise in a warm place until doubled, 30 to 45 minutes. The rolls should rise above the top of the pan and be crowding each other.",
        "Preheat oven to 400 degrees F (200 degrees C). Bake the rolls in the preheated oven until golden brown, 25 to 30 minutes.",
        "Brush the tops of the hot rolls with another coating of melted butter, allow to cool slightly, turn the rolls out of the pan, and pull apart. Serve warm."
    ],
    "ingredients": [
        "1 tablespoon white sugar",
        "1/4 cup warm water (100 degrees F/40 degrees C)",
        "1 package active dry yeast",
        "1/2 cup instant mashed potato flakes",
        "1 cup whole wheat flour",
        "2 cups unbleached all-purpose flour",
        "1 cup warm buttermilk (no more than 110 degrees F/45 degrees C)",
        "3 tablespoons butter, softened",
        "2 tablespoons white sugar",
        "1 teaspoon salt",
        "1 egg",
        "1/2 teaspoon vegetable oil, or as needed",
        "2 tablespoons melted butter (or as needed), divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "High Rise Dinner Rolls",
    "url": "http://allrecipes.com/recipe/214662/high-rise-dinner-rolls/"
}
