{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Coat three 9-inch round cake pans generously with cooking spray.",
        "Mix cake flour, cocoa powder, baking soda, and salt together in a large bowl.",
        "Beat white sugar, 1 cup butter, 2 teaspoons vanilla extract, and 1 teaspoon almond extract together in a large bowl with an electric mixer on medium speed until light and fluffy. Pour in half of the buttermilk and mix well. Beat in eggs one at a time.",
        "Beat half of the flour mixture into the creamed butter mixture. Add remaining buttermilk; beat well to combine. Add remaining flour mixture and beat until batter is smooth, about 1 minute. Pour batter into prepared cake pans.",
        "Bake in the preheated oven until a toothpick inserted into the centers comes out clean, 26 to 30 minutes. Let cool in pans, about 15 minutes. Invert onto wire racks and cool completely before frosting, about 45 minutes.",
        "Beat 1 1/4 cups butter, 2 teaspoons vanilla extract, and 1 teaspoon almond extract in a large bowl with an electric mixer on medium speed until creamy. Beat in milk gradually. Add confectioners' sugar, 2 cups at a time, scraping sides of the bowl as needed, until frosting is smooth. Increase speed to high and beat, adding more milk, 1 tablespoon at a time, until frosting is fluffy and spreadable.",
        "Spread frosting between cake layers and smooth over top and sides of cake."
    ],
    "ingredients": [
        "cooking spray",
        "2 3/4 cups cake flour (such as Pillsbury® Softasilk®)",
        "1 cup unsweetened cocoa powder",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "1 3/4 cups white sugar",
        "1 cup butter, softened to room temperature",
        "2 teaspoons vanilla extract",
        "1 teaspoon almond extract",
        "2 1/4 cups buttermilk, divided",
        "2 eggs",
        "Buttercream Frosting:",
        "1 1/4 cups butter, softened to room temperature",
        "2 teaspoons vanilla extract",
        "1 teaspoon almond extract",
        "6 tablespoons milk, or more as needed",
        "2 (16 ounce) packages confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "High-Altitude Buttermilk Devil's Food Cake",
    "url": "http://allrecipes.com/recipe/245741/high-altitude-buttermilk-devils-food/"
}
