{
    "directions": [
        "Sprinkle 1 tablespoon white sugar and the yeast over the warm milk and warm water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Mix in the egg, 1/2 cup orange juice, melted butter, vanilla pudding mix, and 1 tablespoon orange extract. Stir in 5 cups bread flour and salt. Add more bread flour if the dough is too sticky. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, 8 to 10 minutes.",
        "Place the dough in an oiled bowl and cover with a clean cloth. Allow the dough to rise in a warm place until doubled in size, about 1 1/2 hours.",
        "Combine 1/2 cup softened butter with the orange zest and 1 teaspoon orange extract in a small bowl until smooth. Set aside. Grease a baking sheet, or cover with parchment paper.",
        "Turn the dough out on a floured surface and roll out into a 24x12-inch rectangle. Spread the butter mixture evenly over the dough, then sprinkle with 3/4 cup white sugar. Roll up the dough, beginning with the long side. Cut the dough into 18 1 1/2-inch rolls. Arrange the rolls cut-side up on prepared baking sheet. Cover with plastic wrap and refrigerate overnight.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove the plastic wrap from the rolls and allow them to rise in a warm place for 30 minutes.",
        "Bake in the preheated oven until golden brown, 25 to 30 minutes. Allow rolls to cool slightly before frosting.",
        "While the rolls are baking, cream together the cream cheese and 1/2 cup softened butter until smooth. Stir in the confectioners' sugar and 2 teaspoons orange extract. Stir in milk, a little at a time, until frosting is smooth and spreadable. Spread the frosting over the slightly cooled rolls."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1910&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F733442.jpg",
    "ingredients": [
        "1 tablespoon white sugar",
        "1 tablespoon active dry yeast",
        "1 cup warm milk",
        "½ cup warm water",
        "1  egg, beaten",
        "½ cup orange juice",
        "½ cup butter, melted",
        "¼ cup instant vanilla pudding mix",
        "1 tablespoon orange extract",
        "5 cups bread flour, or more if needed",
        "1 teaspoon salt",
        "½ cup butter, softened",
        "2 tablespoons grated orange zest",
        "1 teaspoon orange extract",
        "¾ cup white sugar",
        "1 (8 ounce) package cream cheese, softened",
        "½ cup butter, softened",
        "2 cups confectioners' sugar",
        "2 teaspoons orange extract",
        "2 tablespoons milk, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "High Five Orange Rolls",
    "url": "http://allrecipes.com/recipe/219289/high-five-orange-rolls/"
}