{
    "directions": [
        "Bring all ingredients to a boil in a medium saucepan; reduce heat to low and cook, stirring often, until sauce thickens to a glaze, 8-10 minutes.",
        "Preheat oven to 375°F. Coat the bottom and sides of loaf pan with nonstick spray and set aside. In a large bowl, soak bread cubes in chicken broth, stirring frequently, until liquid is absorbed and bread is beginning to fall apart, 4-5 minutes. Cook bacon in a large heavy skillet over medium heat until fat is rendered and bacon is starting to crisp. Add scallions (white and pale-green parts only), celery, ginger, and garlic; cook, stirring often, until vegetables begin to soften, 3-4 minutes. Let cool in pan for 5 minutes.",
        "Combine scallion and bread mixtures in a large bowl. Add 2 tablespoons hoisin glaze, remaining scallions (dark-green parts), beef, pork, and remaining 4 ingredients. Using your hands, work all ingredients together until very well incorporated and mixture is beginning to get sticky. Pack mixture into prepared pan, pressing to eliminate any air pockets and mounding in center. Cover with foil. Line a rimmed baking sheet with foil; place loaf pan on top.",
        "Bake meatloaf for 30 minutes. Uncover and spread 2 tablespoons hoisin glaze over top. Bake until an instant-read thermometer registers 165°F when inserted into center of meatloaf, about 1 hour longer.",
        "Let meatloaf rest for 20 minutes. Using flexible spatulas, transfer meatloaf to a platter or cutting board. DO AHEAD: Can be made 1 day ahead. Let cool, cover, and chill.",
        "Toss vegetables, next 3 ingredients, and 2 teaspoons oil in a medium bowl to coat. Cover and chill, tossing occasionally, for 1 hour or up to 1 day ahead.",
        "Cut meatloaf into 12 slices. Heat 2 teaspoons oil in a large nonstick skillet over medium heat. Working in batches and adding additional oil by teaspoonfuls as needed, fry meatloaf slices until browned in spots and heated through, about 2 minutes per side.",
        "Place toasts on plates; brush with hoisin glaze and top with a meatloaf slice. Drain salad, if using; mound on top of meatloaf, dividing equally. Garnish with cilantro."
    ],
    "ingredients": [
        "3/4 cup hoisin sauce",
        "1/2 cup unseasoned rice vinegar",
        "1 1\" piece ginger, peeled, minced",
        "1 garlic clove, minced",
        "Nonstick vegetable oil spray",
        "2 cups 1/2\" cubes day-old crustless white bread (from 2 slices)",
        "1/2 cup low-salt chicken broth",
        "4 slices bacon, minced",
        "1 1/3 cups thinly sliced scallions (dark-green parts separated)",
        "3 celery stalks, minced (about 1 cup)",
        "1 4\" piece ginger, peeled, minced",
        "7 garlic cloves, minced",
        "1 pound ground beef",
        "1 pound ground pork",
        "2 large eggs, beaten to blend",
        "3 whole star anise, finely ground in a spice mill (about 2 teaspoons ground), or 1 teaspoon Chinese five-spice powder",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 cup each matchstick-size pieces peeled carrots, cucumbers, and radishes",
        "3/4 cup unseasoned rice vinegar",
        "Pinch of kosher salt",
        "Pinch of sugar",
        "4 teaspoons (or more) vegetable oil, divided",
        "12 thick slices white sandwich bread, toasted",
        "1 cup chopped fresh cilantro",
        "Ingredient info: Hoisin sauce is available at many supermarkets and at Asian markets.",
        "Special equipment: An 8 1/2x4 1/2x3\" loaf pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Pork",
        "Bake",
        "Dinner",
        "Lunch",
        "Meat",
        "Ground Beef",
        "Cucumber",
        "Carrot",
        "Radish",
        "Green Onion/Scallion",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Hoisin-Glazed Meatloaf Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/hoisin-glazed-meatloaf-sandwiches-394694"
}
