{
    "directions": [
        "Combine pork and five-spice powder in medium bowl; mix well. Sprinkle pork with pepper and lightly with salt. Add flour and toss to coat.",
        "Heat vegetable oil in heavy large pot over medium-high heat. Add half of pork and saut) until brown, about 4 minutes; transfer to bowl. Add remaining pork and sauté until brown, about 4 minutes. Return pork and any juices from bowl to pot. Add mushrooms, broth, 1 1/4 cups green onions, hoisin, soy sauce and ginger and bring to boil, scraping up browned bits. Reduce heat to low, cover and simmer until pork is just tender, stirring occasionally, about 50 minutes. (Can be made 1 day ahead. Chill uncovered until cold, then cover and keep chilled. Bring to simmer before continuing.) Add green beans. Cover; simmer 5 minutes. Uncover; simmer until beans are crisp-tender, stirring occasionally, about 5 minutes.",
        "Meanwhile, cook linguine in medium pot of boiling salted water until just tender but still firm to bite. Drain well. Return linguine to pot; mix in sesame oil.",
        "Transfer linguine to serving bowl. Top with pork mixture. Sprinkle with remaining 1/4 cup green onions."
    ],
    "ingredients": [
        "1 1/2 pounds well-trimmed boneless pork shoulder (Boston butt), cut into 1-inch cubes",
        "2 teaspoons Chinese five-spice powder",
        "3 tablespoons all purpose flour",
        "2 tablespoons vegetable oil",
        "1 pound fresh shiitake mushrooms, stemmed, caps sliced",
        "1 cup canned low-salt chicken broth",
        "1 1/2 cups chopped green onions",
        "3 tablespoons hoisin sauce",
        "1 tablespoon soy sauce",
        "2 1/4-inch-thick rounds of peeled fresh ginger",
        "8 ounces green beans, trimmed, cut on diagonal into 1 1/2-inch lengths",
        "1 9-ounce package fresh egg linguine, cut in half",
        "1 tablespoon oriental sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Pasta",
        "Pork",
        "Vegetable",
        "Braise",
        "Sauté",
        "Dinner",
        "Meat",
        "Green Bean",
        "Fall",
        "Winter",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Hoisin-Braised Pork, Mushrooms and Green Beans on Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/hoisin-braised-pork-mushrooms-and-green-beans-on-noodles-103002"
}
