{
    "directions": [
        "Preheat the oven to 350°F. Line a broiler pan rack or wire rack with foil and set it on top of a rimmed baking sheet. Lightly coat the foil with cooking spray, then use a sharp knife to make a few slits in the foil (this will allow the fat from the meatloaf to drip down onto the baking sheet).",
        "In a large bowl, whisk together the panko, milk, eggs, parsley, basil, scallions, garlic, onion, ginger, sesame oil, salt, and pepper to taste. Add the ground pork and turkey and stir or use your hands to gently combine, being careful not to overwork the meat.",
        "Shape the meat mixture into a 12-inch long loaf and place it on the foil-lined rack. Flatten the top slightly and square off the ends. In a small bowl, whisk together the hoisin sauce and ketchup. Pour about half the sauce over the meatloaf and use a brush or spoon to generously coat the sides and top.",
        "Bake for 1 hour to 1 hour 10 minutes, until the internal temperature reads 160°F on an instant-read thermometer, brushing with glaze every 20 minutes or so. Let the meatloaf cool for 10 to 15 minutes, then transfer to a platter, slice, and serve.",
        "For an extra decadent loaf, melt 1 tablespoon unsalted butter in a large skillet over medium-high heat. Add the panko and toast until golden brown, stirring often, 2 to 3 minutes. Continue with the rest of the recipe."
    ],
    "ingredients": [
        "Cooking spray",
        "1 1/4 cups whole wheat panko breadcrumbs",
        "1/2 cup whole milk",
        "3 large eggs",
        "1/2 cup minced fresh parsley leaves or cilantro",
        "1/4 cup minced fresh basil leaves",
        "4 scallions, minced",
        "6 garlic cloves, finely minced",
        "1/2 medium white onion, grated on a box grater",
        "1 tablespoon finely grated fresh ginger",
        "2 teaspoons toasted sesame oil",
        "2 teaspoons kosher salt",
        "Freshly cracked black pepper",
        "1 pound ground pork",
        "1 pound ground turkey",
        "1/3 cup hoisin sauce",
        "2 tablespoons ketchup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Meatloaf",
        "Pork",
        "turkey",
        "Dinner",
        "Ginger",
        "Sesame Oil"
    ],
    "title": "Hoisin-Glazed Pork and Turkey Meat Loaf",
    "url": "http://www.epicurious.com/recipes/food/views/hoisin-glazed-pork-and-turkey-meat-loaf"
}
