{
    "directions": [
        "On the first day, combine the candied orange peel, candied citron, candied pineapple, red and green candied cherries, currants, raisins, walnuts, and almonds. Combine the orange juice and the 2/3 cup bourbon; pour over the fruit and nuts. Stir and then cover tightly. Let the fruit marinate in a cool place for 1 full day, or at least 20 hours.",
        "On the second day, line two 9x5 inch loaf pans with parchment paper or aluminum foil and grease the inside with cooking spray. Combine the flour, cinnamon, nutmeg, cloves, allspice, ginger, cocoa, baking powder, and salt in a large bowl and stir with a whisk to blend.",
        "In a separate large bowl, beat the butter, brown sugar, and white sugar until light and fluffy using an electric mixer. Stir in the egg yolks until blended and then mix in the applesauce, the 1/2 cup bourbon, and vanilla until fluffy. Continue stirring, and add the the flour mixture gradually until well combined. Add the molasses and stir to combine. When the batter is thoroughly mixed, gently mix in the fruit and nut mixture with all of its juices.",
        "In a separate bowl, whip the egg whites with an electric mixer until they can hold a stiff peak. Fold egg whites into the batter.  Divide evenly between the prepared pans. Cover loosely with a towel and let the batter stand overnight in a cool, dry place.",
        "On the third day, preheat the oven to 250 degrees F (120 degrees C). Place a large baking pan on the bottom shelf and pour boiling water into it until almost full. Place a baking sheet on the center shelf and place the fruit cakes on the baking sheet.",
        "Bake for 2 1/2 hours in the preheated oven. Check the water level and refill if needed. Cover the cakes with a sheet of parchment paper, taking care not to let it touch the shelf. Continue to bake until a knife or toothpick inserted into the center comes out clean, about 1 hour more. Cool fruitcakes in the pans, set over a wire rack. Once cool, remove the cakes from the pans, and leave the parchment paper on. Sprinkle with more bourbon if desired and wrap in aluminum foil. Place in a tin or other sealed container overnight before serving."
    ],
    "ingredients": [
        "1 cup chopped candied orange peel",
        "1 cup chopped candied citron",
        "1 cup chopped candied pineapple",
        "1 cup halved red candied cherries",
        "1 cup halved green candied cherries",
        "1 cup dried currants",
        "1 cup raisins",
        "1 cup chopped pitted dates",
        "1 cup chopped walnuts",
        "3/4 cup chopped almonds",
        "1/2 cup orange juice",
        "2/3 cup bourbon whiskey",
        "4 cups all-purpose flour",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground nutmeg",
        "1 teaspoon ground cloves",
        "1 teaspoon ground allspice",
        "1 teaspoon ground ginger",
        "2 teaspoons unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 1/2 cups butter, room temperature",
        "1 cup packed brown sugar",
        "1/2 cup white sugar",
        "6 egg yolks",
        "3/4 cup applesauce",
        "1/2 cup bourbon whiskey",
        "1 teaspoon vanilla extract",
        "1/2 cup molasses",
        "6 egg whites"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Holiday Bourbon Fruitcake",
    "url": "http://allrecipes.com/recipe/151164/holiday-bourbon-fruitcake/"
}
