{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt pan.",
        "Sift the self-rising flour and pumpkin pie spice together into a bowl. In another mixing bowl, beat the white and brown sugars, vegetable oil, melted butter, applesauce, vanilla, pumpkin, and eggs together until smooth.",
        "Gradually beat the flour mixture into the pumpkin mixture, 1/2 cup at a time, until completely smooth and well blended. Pour the batter into the prepared Bundt pan.",
        "Bake in preheated oven for 60 minutes. Cover cake with aluminum foil to prevent over-browning, and bake until a wooden skewer inserted into the cake comes out clean, 15 to 20 minutes longer. Cool the cake in the pan on a wire rack for about half an hour.",
        "To unmold the cake, tap the bottom of the Bundt pan on the counter or work surface to help release it. Invert the cake on a serving plate and allow it to cool completely before glazing.",
        "To make the glaze, mix the cream cheese with the butter, confectioners' sugar, rum extract, and milk in a bowl. Heat in a microwave oven for 15 seconds. Drizzle spoonfuls over the cooled cake. Keep cake refrigerated after serving."
    ],
    "ingredients": [
        "Cake:",
        "2 cups self-rising flour",
        "3 teaspoons pumpkin pie spice",
        "1 1/2 cups white sugar",
        "1/2 cup light brown sugar, packed",
        "1/2 cup vegetable oil",
        "1/4 cup melted butter",
        "1/2 cup unsweetened applesauce",
        "1 1/2 teaspoons vanilla extract",
        "3 cups unsweetened canned pumpkin puree",
        "4 eggs, lightly beaten",
        "Glaze:",
        "1 (4 ounce) package cream cheese, softened",
        "1 tablespoon butter, softened",
        "2 cups confectioners' sugar",
        "1 teaspoon rum extract",
        "1 tablespoon milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Holiday Pumpkin Cake with Rum-Cream Cheese Glaze",
    "url": "http://allrecipes.com/recipe/130800/holiday-pumpkin-cake-with-rum-cream-c/"
}
