{
    "directions": [
        "1. In a large bowl, combine all the stuffing ingredients. Stir them with a fork, then mix thoroughly with your hands. Cover and refrigerate.",
        "2. In another bowl, thoroughly mix all sauce ingredients. Cover and refrigerate.",
        "3. Fill a very large stockpot three-quarters full with water and bring to a rapid boil. While bringing the water to a boil, use a thin, sharp knife to make deep cuts around the core of the large cabbage (cut into the cabbage in a circle about 1/4 inch out from the core). Lift out the core, making a hole about 2 inches wide and 2 1/2 inches deep. This is a bit difficult — persevere.",
        "4. Set out a baking tray neat the stove. Stick a long cooking fork into the core hole of the large cabbage, and plunge it (carefully, so you don't splash yourself) into the pot of rapidly boiling water. The outer leaves will begin to fall off. Leave them in the boiling water for a few minutes until they're limp and flexible enough for stuffing; then take them out one at a time, and place them on the baking tray. Try not to tear the leaves. When all the leaves are on the tray, transfer it into the sink and pour the boiling water from the pot over them. Wash the leaves carefully in cold water. With a small, sharp knife, trim off the tough outer spines and discard them.",
        "5. Find your largest leaves, and set them out on a plate. Set out all other leaves on another plate. One at a time, line each large leaf with another large leaf or two smaller leaves. (The idea is to strengthen your cabbage wrapping so that the stuffing stays securely inside during cooking. Be sure to align the spines of inner and outer leaves.) Stuff with 3/4 cup of the meat-rice mixture, roll very tightly along the spine, and close both sides by tucking them in with your fingers. The spine should be vertical in the center of tour roll.",
        "6. Stir the 4 cups of chopped cabbage into the sauce. Pour 3/4 inch of the sauce into a large, wide-bottomed stockpot. Arrange the cabbage rolls carefully on top of the sauce, and pour the remainder of the sauce over them to cover. Cover pot and simmer for 1 hour and 45 minutes. Serve with boiled potatoes and a vegetable."
    ],
    "ingredients": [
        "1 1/2 pounds chopmeat",
        "3/4 cup uncooked white rice",
        "1 cup finely chopped onion",
        "2 eggs, beaten",
        "1/2 cup water",
        "1 tablespoon finely chopped or crushed fresh garlic",
        "2 teaspoons salt",
        "1/2 teaspoon pepper",
        "2 cups plain tomato sauce",
        "1 1/2 cups finely chopped onion",
        "1/2 orange, chopped with peel into 1/2-inch pieces; remove pits",
        "2/3 lemon, chopped with peel into 1/2-inch pieces; remove pits",
        "1/2 teaspoon cinnamon",
        "1 cup white sugar",
        "1/2 cup brown sugar",
        "1/2 cup white vinegar",
        "2 cups water",
        "1 1/2 teaspoons salt",
        "1 large lightweight young green cabbage",
        "1 medium green cabbage. You'll need 4 cups (if you don't have enough, supplement with leftovers from the large cabbage)."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Egg",
        "Garlic",
        "Onion",
        "Rice",
        "Tomato",
        "Vegetable",
        "Sukkot",
        "Kosher",
        "Cabbage"
    ],
    "title": "Holishkes (Stuffed Cabbage)",
    "url": "http://www.epicurious.com/recipes/food/views/holishkes-stuffed-cabbage-236220"
}
