{
    "directions": [
        "Preheat oven to 325°F. Line 3 large baking sheets with parchment paper. Sift first 3 ingredients into medium bowl. Using electric mixer, beat butter and sugar in large bowl to blend well. Beat in eggs 1 at a time. Mix in lemon peel, vanilla, and aniseed. Beat in flour mixture just until blended. Stir in cranberries and pistachios (dough will be sticky). Turn dough out onto lightly floured surface. Gather dough together; divide in half. Roll each half into 15-inch-long log (about 1 1/4 inches wide). Carefully transfer logs to 1 prepared baking sheet, spacing 3 inches apart.",
        "Bake logs until almost firm to touch but still pale, about 28 minutes. Cool logs on baking sheet 10 minutes. Maintain oven temperature.",
        "Carefully transfer logs still on parchment to cutting board. Using serrated knife and gentle sawing motion, cut logs crosswise into generous 1/2-inch-thick slices. Place slices, 1 cut side down, on remaining 2 prepared sheets. Bake until firm and pale golden, about 9 minutes per side. Transfer cookies to racks and cool.",
        "Line another baking sheet with waxed paper. Stir white chocolate in top of double boiler over barely simmering water just until smooth. Remove from over water. Dip 1 end of each cookie into melted chocolate, tilting pan if necessary; shake off excess chocolate. Place cookies on prepared sheet. Chill until chocolate is firm, about 30 minutes. (Can be made 5 days ahead. Store airtight between sheets of waxed paper at room temperature.)"
    ],
    "ingredients": [
        "2 1/4 cups all purpose flour",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "3/4 cup sugar",
        "2 large eggs",
        "1 tablespoon grated lemon peel",
        "1 1/2 teaspoons vanilla extract",
        "1 teaspoon whole aniseed",
        "1 cup dried sweetened cranberries",
        "3/4 cup shelled natural unsalted pistachios",
        "6 ounces imported white chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Bake",
        "Christmas",
        "Cranberry",
        "Pistachio",
        "Winter",
        "Anise"
    ],
    "title": "Holiday Biscotti with Cranberries and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/holiday-biscotti-with-cranberries-and-pistachios-108977"
}
