{
    "directions": [
        "1. Combine 1/2 cup warm water, the yeast, and 1 tablespoon of the sugar in a small bowl. Stir until the yeast dissolves. Let it activate for 10 minutes—the mixture should look foamy.",
        "2. In the large bowl of a standing mixer with the paddle attachment or with a hand-held mixer, beat the eggs at medium speed until blended. Add the oil, salt, and remaining 3/4 cup sugar. Beat until pale in color, about 4 minutes. Beat in 2/3 cup water, then add the yeast mixture. Beat in the flour 1 cup at a time.",
        "3. Turn the dough onto a floured surface and knead for 2 minutes (or use the dough hook on your mixer for 1 minute at low speed). Put the dough in a lightly oiled bowl and turn to coat. Cover with plastic wrap and a kitchen towel and put in a warm corner of your kitchen to rise. I like to use my (unheated) oven with the lightbulb on. You want the dough to double in size, which takes just about an hour.",
        "4. Punch down the dough, rewrap with plastic wrap and a kitchen towel, and let the dough rise for 30 minutes. It won't quite double in this time, but it will puff up.",
        "5. Meanwhile, make the filling: In a small bowl, toss the apples with the raisins, lemon juice, honey, and cinnamon. Let sit for 20 minutes, then drain any liquid.",
        "6. Turn the dough out onto a lightly floured surface and divide in half. Divide each half into three equal parts, for a total of six pieces. Roll out each piece to form a 12-inch strand, then pat each strand down into a flat rectangle shape. Spoon a bit of apple mixture down the center of each rectangle, then fold dough over the filling, roll into a 15-inch rope, and pinch the ends tight.",
        "7. Form the loaves: Put three of the apple-filled \"ropes\" on each baking sheet. Braid the ropes together (fold right rope over center, then fold left rope over center, repeat). Pinch at bottom. Repeat with the other loaf. Cover the loaves with kitchen towels, and let rise for 45 minutes.",
        "8. Preheat the oven to 400°F and set a rack to the middle position. Whisk the egg yolk with 1 tablespoon water and brush over the tops of the loaves. Bake for 10 minutes, then reduce the heat to 350°F and bake until the crusts are browned and the bread is puffed and light, 30 minutes more. Transfer the loaves to a rack and let cool for 30 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons dry yeast",
        "1 tablespoon plus 3/4 cup (155 g) granulated sugar",
        "5 large eggs",
        "3/4 cup (180 ml) vegetable oil, such as canola or safflower",
        "3/4 teaspoon kosher salt",
        "6 cups (870 g) all-purpose flour",
        "1 large firm-tart apple (about 8 ounces), peeled, cored, and cut into small cubes",
        "1/2 cup (65 g) raisins",
        "3 tablespoons lemon juice",
        "2 tablespoons honey",
        "1/2 teaspoon ground cinnamon",
        "1 egg yolk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Fruit",
        "Bake",
        "Hanukkah",
        "Rosh Hashanah/Yom Kippur",
        "Dried Fruit",
        "Raisin",
        "Apple",
        "Fall",
        "Advance Prep Required"
    ],
    "title": "Holiday Apple-Raisin Challah",
    "url": "http://www.epicurious.com/recipes/food/views/holiday-apple-raisin-challah-368069"
}
