{
    "directions": [
        "Heat brandy in a 1-quart saucepan over low heat until warm, then remove from heat and stir in dried fruit. Cover and let stand 30 minutes.",
        "Preheat oven to 325°F with rack in middle. Invert bottom of springform pan and lock on side. Generously butter pan and dust with flour, knocking out excess.",
        "Finely grind 3/4 cup almonds with 1/4 cup sugar in a food processor, then whisk together with flour, baking powder, and salt in a bowl.",
        "Beat butter and remaining 3/4 cup sugar with an electric mixer at medium-high speed until pale and fluffy, about 5 minutes. Add eggs 1 at a time, beating well after each addition (batter will appear curdled), then add vanilla, zest, and fruit with brandy and beat until thoroughly combined, about 2 minutes.",
        "At low speed, mix in flour mixture until incorporated. Spoon batter into pan, smoothing it, and top with remaining 1/3 cup almonds.",
        "Bake until a long wooden pick inserted into center of cake comes out clean, 1 1/2 to 1 3/4 hours. Run a thin metal spatula around side of cake, then cool in pan on a rack 10 minutes.",
        "Meanwhile, melt marmalade with liqueur in a small heavy saucepan over medium heat, stirring, then strain glaze through a sieve into a small bowl, discarding solids.",
        "Loosen side of cake with thin metal spatula again, then remove side of pan and loosen bottom of cake. Transfer cake from pan to rack and brush glaze over top of cake.",
        "Cool cake completely, about 3 hours."
    ],
    "ingredients": [
        "3/4 cup Cognac or other brandy",
        "2/3 cup golden raisins",
        "2/3 cup currants",
        "2/3 cup dried apricots, finely chopped",
        "2/3 cup dried cranberries",
        "3/4 cup whole blanched almonds plus 1/3 cup for top of cake (6 ouncecs total)",
        "1 cup sugar, divided",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "3/4 teaspoon salt",
        "2 1/2 sticks unsalted butter, softened",
        "4 large eggs",
        "1 teaspoon pure vanilla extract",
        "1 tablespoon grated orange zest",
        "3 tablespoons sweet orange marmalade or apricot preserves",
        "1 tablespoon orange-flavored liqueur",
        "Equipment: a 9-inch springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "New Year's Day",
        "Cranberry",
        "Currant",
        "Raisin",
        "Apricot",
        "Almond",
        "Brandy",
        "Fall",
        "Winter",
        "Jam or Jelly",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Holiday Fruit-Filled Pound Cake",
    "url": "http://www.epicurious.com/recipes/food/views/holiday-fruit-filled-pound-cake-240968"
}
