{
    "directions": [
        "Preheat an oven to 275 degrees F (135 degrees C).  Spread the walnuts out onto a baking sheet and toast them for about 45 minutes, until the nuts start to brown and become fragrant. Watch the walnuts carefully, because they burn quickly. Set the walnuts aside.",
        "While the walnuts are roasting, rinse the chicken well with cold water, then pat dry inside and out with paper towels. Place the chicken into a small roasting pan, and sprinkle inside and outside with salt and pepper.",
        "Combine 2 tablespoons Italian dressing, 2 tablespoons of melted butter, 1 teaspoon orange peel, the lemon peel, thyme, and basil in a small bowl. Brush the chicken inside and out with the mixture.",
        "To make the stuffing, heat 2 tablespoons of butter in a skillet over medium heat. Add the apple, pear, and pineapple chunks; cook and stir about 5 minutes, until the apple and pear are tender.  Mix the cooked fruit mixture with the roasted walnuts, bread, prunes, grapes, 2 tablespoons Italian dressing, orange juice, apple cider, 1 teaspoon of orange zest, honey, and cinnamon in a large bowl and stir to combine.",
        "Increase oven temperature to 325 degrees F (165 degrees C). Spoon the stuffing into the chicken cavity, including the area under the neck skin.  Secure the skin over the neck cavity with toothpicks, and fold the wings underneath the chicken.  Tie the drumsticks together.",
        "Roast the chicken in the preheated oven for 1 hour, and untie the drumsticks.  Return the chicken to the oven and continue roasting until no longer pink at the bone and the juices run clear, about 45 minutes to 1 hour additional roasting time.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chicken from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing."
    ],
    "ingredients": [
        "1/4 cup coarsely chopped walnuts",
        "1 (5 pound) whole chicken",
        "salt and pepper, to taste",
        "2 tablespoons Italian-style salad dressing",
        "2 tablespoons butter, melted",
        "1 teaspoon grated orange zest",
        "1 teaspoon grated lemon zest",
        "1/2 teaspoon dried basil, or to taste",
        "1/2 teaspoon dried thyme, or to taste",
        "Stuffing",
        "2 tablespoons butter",
        "1 apple, cored and chopped",
        "1 pear, cored and chopped",
        "1/2 cup pineapple chunks, drained",
        "1/2 cup cubed French bread",
        "5 pitted prunes, chopped",
        "1 cup seedless grapes, halved",
        "2 tablespoons Italian-style salad dressing",
        "2 tablespoons orange juice",
        "1 tablespoon apple cider",
        "1 teaspoon grated orange zest",
        "1 tablespoon honey",
        "1 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Holiday Fruit Stuffed Roasted Chicken",
    "url": "http://allrecipes.com/recipe/184346/holiday-fruit-stuffed-roasted-chicken/"
}
