{
    "directions": [
        "Arrange a rack in lowest level of oven; preheat to 300°F. Leaving fat intact, remove outer rind from most of ham, leaving a band around the end of the shank bone. Score fat crosswise (do not cut into meat) on top of ham with parallel cuts spaced 1/2\" apart. Place ham in a large roasting pan. Boil 1 cup Riesling and 7 cups water in a saucepan for 5 minutes. Pour into bottom of roasting pan. Bake ham, basting with pan juices occasionally, until an instant-read thermometer inserted into center of ham registers 110°F, 2 1/2-3 hours.",
        "Meanwhile, melt butter in a medium skillet over medium heat. Add shallots and thyme sprigs; cook, stirring often, until shallots are very soft, about 10 minutes. Remove pan from heat; stir in the remaining 1 cup Riesling. Return to stove. Increase heat to medium-high, bring to a simmer, and cook until reduced to 1/4 cup, about 8 minutes. Remove the thyme sprigs and transfer mixture to a food processor. Add thyme leaves, mustard, honey, pepper, and salt. Process until well blended.",
        "Remove pan from oven and increase heat to 350°F. Using a pastry brush, spread Riesling mixture over ham. Return pan to oven and bake ham, tenting with foil if browning too quickly, until internal temperature registers 135°F and crust is golden brown, 15-30 minutes.",
        "Transfer ham to a large platter. Let rest for 30 minutes before carving. Skim fat from pan juices, reheat, and pour juices into a medium pitcher; serve alongside."
    ],
    "ingredients": [
        "1 14-16-pound whole cured, smoked bone-in ham",
        "2 cups sweet (Auslese) Riesling, divided",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/4 cup finely chopped shallots",
        "3 sprigs thyme plus 2 teaspoons fresh thyme leaves",
        "1/2 cup whole grain mustard",
        "1 tablespoon honey",
        "1/2 teaspoon freshly ground black pepper",
        "Small pinch of kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Mustard",
        "Roast",
        "Christmas",
        "Easter",
        "Dinner",
        "Meat",
        "Ham",
        "White Wine",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Holiday Ham with Riesling and Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/holiday-ham-with-riesling-and-mustard-368962"
}
