{
    "directions": [
        "Vigorously whisk the egg yolks and lemon juice together in a stainless steel bowl and until the mixture is thickened and doubled in volume. Place the bowl over a saucepan containing barely simmering water (or use a double boiler,) the water should not touch the bottom of the bowl. Continue to whisk rapidly. Be careful not to let the eggs get too hot or they will scramble. Slowly drizzle in the melted butter and continue to whisk until the sauce is thickened and doubled in volume. Remove from heat, whisk in cayenne and salt. Cover and place in a warm spot until ready to use for the eggs benedict. If the sauce gets too thick, whisk in a few drops of warm water before serving.",
        "Brown the bacon in a medium skillet and toast the English muffins, cut sides up, on a baking sheet under the broiler. Fill a 10-inch nonstick skillet half full of water. Add white vinegar to the cooking water. This will make the egg white cook faster so it does not spread. Bring to a slow boil. Gently break 1 of the eggs into the water taking care not to break it. Repeat with remaining eggs. Reduce the heat to a gentle simmer. Cook 3 1/2 minutes until the egg white is set and yolk remains soft. Remove with a slotted spoon, allowing the egg to drain. To assemble: Lay a slice of Canadian bacon on top of each muffin half, followed by a poached egg. Season with salt and pepper. Spoon hollandaise sauce over the eggs. Garnish with chopped parsley.",
        "Yield: 4 servings"
    ],
    "ingredients": [
        "4 egg yolks",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 cup unsalted butter, melted (1 stick)",
        "Pinch cayenne",
        "Pinch salt",
        "8 slices Canadian bacon",
        "4 English muffins, split",
        "2 teaspoons white vinegar",
        "8 eggs",
        "Salt and pepper, to taste",
        "Hollandaise Sauce, recipe above",
        "Fresh chopped parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "European Recipes",
        "Sauce Recipes",
        "Egg Recipes",
        "Fruit",
        "Lemon Recipes",
        "Dairy Recipes",
        "Brunch"
    ],
    "title": "Hollandaise Sauce",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/hollandaise-sauce-recipe"
}
