{
    "directions": [
        "For the au jus: Heat the oil over medium heat in a medium saucepan. Add the peppercorns, salt, thyme, garlic, rosemary and shallots. Cook the shallots, stirring occasionally, until they become translucent, 6 to 8 minutes. Add the sherry and simmer, a few minutes. Add the stock and simmer, 20 to 25 minutes. Remove the saucepan from the heat and strain the liquid. Keep warm.",
        "For the pickled radishes: Simmer 1/2 cup water, the vinegar, sugar, coriander seeds, salt, star anise, bay leaf and garlic. After 10 minutes of simmering, pour the mixture over the radishes in a heat-proof container and cool.",
        "For the sandwich build: Place the bottom halves of the rolls on a work surface. Place the sliced Homemade Roast Beef on the bottom. Top with 1 slice gruyere each, some pickled radishes and watercress. Cover with the tops of the rolls. Cut each sandwich in half, dunk into the au jus and realize sometimes leftovers are just better.",
        "Preheat the oven to 400 degrees F. Mix the rosemary, thyme, salt, pepper and garlic in a small bowl. Rub the mixture all over the roast, cover with plastic wrap and refrigerate, about 20 minutes.",
        "Heat the oil in a large heavy skillet over high heat. Wipe off the excess garlic and herbs and add the roast to the pan. Sear the roast on all sides, 2 to 3 minutes per side. Transfer the roast to a roasting pan with a rack. Roast until an instant-read thermometer inserted into the center registers 125 degrees F, about 50 minutes. Transfer the roast to a cutting board and let rest, about 10 minutes. Thinly slice the roast and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 tablespoon black peppercorns",
        "1 teaspoon kosher salt",
        "4 sprigs fresh thyme",
        "2 cloves garlic, smashed",
        "2 sprigs fresh rosemary",
        "1 large shallot, thinly sliced",
        "2 tablespoons dry sherry",
        "4 cups low-sodium beef stock",
        "1 cup white wine vinegar",
        "2 tablespoons sugar",
        "1 teaspoon coriander seeds",
        "1 teaspoon kosher salt",
        "1 star anise",
        "1 bay leaf",
        "1 clove garlic",
        "2 cups thinly sliced radishes (about 8 ounces)",
        "4 crusty hoagie rolls",
        "1 pound Homemade Roast Beef, thinly sliced, recipe follows",
        "8 thick slices gruyere",
        "Watercress, for serving",
        "1 tablespoon fresh rosemary leaves, minced",
        "1 tablespoon fresh thyme leaves, minced",
        "2 teaspoons kosher salt",
        "1 teaspoon ground black pepper",
        "3 cloves garlic, minced",
        "One 4-pound boneless beef eye round roast",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Beef",
        "Beef",
        "Meat",
        "Roast Recipes",
        "Sandwich",
        "Main Dish Recipes",
        "Holiday"
    ],
    "title": "Homemade Roast Beef Sandwich Au Jus",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/homemade-roast-beef-sandwich-au-jus-recipe"
}
