{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "In a bowl, mix together 1/2 cup of cold butter with 1 1/2 cups flour and the salt with a fork until the mixture is very crumbly. Mix in water, a tablespoon at a time, just until the mixture holds together. Mix again with a fork, then turn out onto a floured pastry cloth. Pat the dough out into a round piece, and roll out into a 10-inch circle. Invert a 9-inch pie dish onto the dough. Flip the dough over, and peel from the pastry cloth; adjust the crust into the plate if necessary. Fold the dough over the edge of the pie dish. Set the crust aside.",
        "Combine the raisins, apples, grapefruit peel, orange juice, and apple cider in a saucepan, and bring to a simmer over medium heat. Cook, stirring occasionally, until the apple pieces are soft, about 15 minutes. Stir in 3/4 cup of sugar, the cinnamon, cloves, and half a crushed graham cracker, and mix well.",
        "Mix together 1/3 cup of sugar, 3/4 cup of flour, 6 tablespoons of butter, and half a crushed graham cracker in a bowl, stirring until the mixture looks like fine crumbs. Pour the mince filling into the prepared pie crust, and sprinkle evenly with the streusel topping.",
        "Bake in the preheated oven for 15 minutes, and reduce oven temperature to 350 degrees F (175 degrees C); bake until the topping is lightly browned, about 30 more minutes. Allow to cool before serving."
    ],
    "ingredients": [
        "1/2 cup cold butter",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup cold water",
        "1 1/2 cups raisins",
        "5 apples - peeled, cored and chopped",
        "2 tablespoons finely chopped grapefruit peel without white layer",
        "1/3 cup orange juice",
        "1/2 cup apple cider",
        "3/4 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/2 graham cracker, crushed",
        "1/3 cup white sugar",
        "3/4 cup all-purpose flour",
        "6 tablespoons butter",
        "1/2 graham cracker, crushed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Mince Pie with Crumbly Topping",
    "url": "http://allrecipes.com/recipe/215756/homemade-mince-pie-with-crumbly-toppi/"
}
