{
    "directions": [
        "Combine 1/4 cup water and 1/2 teaspoon calcium chloride in another small bowl; mix well.",
        "Combine 1/4 cup water and 1/2 teaspoon rennet in a small bowl; mix well.",
        "Pour milk into a double boiler set over medium-low heat. Heat milk until it registers 86 degrees F (30 degrees C) on an instant-read thermometer, about 5 minutes. Remove from heat.",
        "Sprinkle 1/4 cheese culture on top of the milk; let dissolve, 3 to 5 minutes. Stir well. Cover and let stand, maintaining the temperature at 86 degrees F (30 degrees C), about 1 hour.",
        "Pour calcium chloride mixture into the milk; stir for 1 minute. Add rennet mixture; stir for 1 to 2 minutes. Let stand at room temperature until milk sets into curd, about 1 hour. Press edge of the curd gently with a palette knife or the back of a spoon to check for firmness.",
        "Cut curd all the way to the bottom of the pot into 1/3x3/4-inch squares. Stir gently with a rubber spatula. Let rest, 5 to 10 minutes.",
        "Stir curds, maintaining temperature at 86 degrees F (30 degrees C), until they sink to the bottom of the pot, about 20 minutes. Scoop out liquid (whey) with a ladle and discard or reserve for another use.",
        "Line 2 basket-style molds with damp muslin or cheesecloth. Ladle curds into the molds with a slotted spoon and cover with ends of muslin. Place one mold on top of the other, pressing lightly. Let drain, switching the molds and stirring curds a few times, until cheese is firm, at least 4 hours.",
        "Mix 8 1/2 cups water, sea salt, 1 teaspoon calcium chloride, and white vinegar together in a large container to make brine. Submerge cheese in brine and let soak, at least 8 hours and up to 3 weeks."
    ],
    "ingredients": [
        "Cheese:",
        "1/2 cup water, divided",
        "calcium chloride",
        "liquid rennet",
        "1 gallon milk",
        "feta MT1 cheese culture",
        "Brine:",
        "8 1/2 cups water",
        "5 tablespoons coarse sea salt",
        "calcium chloride",
        "1/4 teaspoon white vinegar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Feta Cheese",
    "url": "http://allrecipes.com/recipe/254477/homemade-feta-cheese/"
}
