{
    "directions": [
        "Cover potatoes with salted cold water by 1 inch in a large pot, then boil until just tender when pierced with a knife, about 20 minutes. Drain potatoes and cool completely, then chill, wrapped in plastic wrap, at least 8 hours.",
        "Quarter potatoes lengthwise and cut crosswise into 1/2-inch pieces.",
        "Cook onions with 1/4 teaspoon salt and 1/4 teaspoon pepper in 1 tablespoon butter in a 12-inch nonstick skillet over moderately low heat, stirring occasionally, until pale golden, 10 to 15 minutes, then transfer to a bowl.",
        "Heat 1 tablespoon butter and 1 tablespoon oil in skillet over moderately high heat until foam subsides, then sauté half of potatoes with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring occasionally, until golden, 8 to 12 minutes. Add half of onions and sauté, stirring occasionally, until potatoes are golden brown, about 3 minutes. Transfer to a bowl and keep warm, covered. Cook remaining potatoes and onions in same manner.",
        "Return all vegetables to skillet and gently toss with remaining tablespoon butter and chives until butter is melted. Season with salt and pepper."
    ],
    "ingredients": [
        "2 lb russet (baking) potatoes",
        "2 medium onions, halved lengthwise and thinly sliced crosswise (4 cups)",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 stick (1/4 cup) unsalted butter",
        "2 tablespoons olive oil",
        "2 tablespoons finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Brunch",
        "Side",
        "Sauté",
        "Fall",
        "Chill",
        "Chive",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Home Fries with Onions and Chives",
    "url": "http://www.epicurious.com/recipes/food/views/home-fries-with-onions-and-chives-105733"
}
