{
    "directions": [
        "Place pork sparerib cubes and pork fat in freezer until partially frozen, about 30 minutes. Place half of pork and half of pork fat in processor. Using on/off turns, blend mixture until finely ground. Transfer mixture to bowl. Repeat with remaining pork and pork fat. Gently mix sage and next 5 ingredients into ground pork mixture. Stir in 1/4 cup beer. Cover and chill overnight.",
        "Form pork mixture by tablespoonfuls into 1 1/4-to 1 1/2-inch-diameter patties; place on baking sheet. DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Heat large nonstick skillet over medium heat. Working in batches if necessary, add sausage patties to skillet and cook until browned on bottom, about 5 minutes. Add remaining 1/2 cup beer to skillet; cover with lid slightly ajar and cook until beer evaporates, 6 to 7 minutes. Turn patties over and cook until brown on bottom and cooked through, about 5 minutes longer.",
        "Transfer sausage patties to platter. Serve with Beer and Horseradish Mustard and soft pretzels."
    ],
    "ingredients": [
        "1 1/4 pounds boneless country-style pork spareribs, cut into 3/4-inch cubes",
        "1/3 pound pork fat, cut into 3/4-inch cubes",
        "1 1/2 teaspoons finely chopped fresh sage",
        "1 1/4 teaspoons coarse kosher salt",
        "3/4 teaspoon ground mace",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon sugar",
        "3/4 cup lager beer, divided",
        "Beer and Horseradish Mustard",
        "Purchased soft pretzels, pretzel rolls, or rye bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Food Processor",
        "Appetizer",
        "Horseradish",
        "Oktoberfest",
        "Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Homemade Bratwurst Bites with Beer and Horseradish Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-bratwurst-bites-with-beer-and-horseradish-mustard-355235"
}
