{
    "directions": [
        "Place chicken in a stockpot and add just enough water to cover; stir in poultry seasoning, sage, garlic powder, salt, and black pepper. Bring chicken mixture to a boil, reduce heat to medium and simmer until chicken is no longer pink at the bone and the juices run clear, 30 to 60. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).",
        "Remove chicken from cooking liquid; reserve cooking liquid, remove and discard bones and skin from chicken and dice chicken meat.",
        "Preheat oven to 375 degrees F (190 degrees C). Spray a pie plate with cooking spray and line it with 1 of the prepared pie pastries.",
        "Stir diced chicken meat, potatoes, onion, carrots, and mixed vegetables together in a bowl. Pour chicken mixture into prepared pie plate.",
        "Bring 1 cup reserved cooking liquid to a boil in a saucepan. Whisk cornstarch into cooking liquid and cook, whisking constantly, until gravy thickens, 3 to 5 minutes. Season gravy with salt and black pepper. Pour gravy over chicken mixture into prepared pie plate. Spread remaining pie pastry over the top, crimp edges together, and cut a slit in the top of the pie.",
        "Bake in the preheated oven until heated through and crust is golden, about 1 hour. Cool for 5 to 10 minutes before slicing."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1910&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2895656.jpg",
    "ingredients": [
        "1 ½ pounds chicken pieces, or more to taste",
        "2 teaspoons poultry seasoning",
        "¼ teaspoon dried sage",
        "¼ teaspoon garlic powder",
        "salt and ground black pepper to taste",
        "cooking spray",
        "2  prepared pie pastries",
        "2  potatoes, diced",
        "1  onion, diced",
        "½ cup diced carrots",
        "½ cup frozen mixed vegetables",
        "2 tablespoons cornstarch, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Chicken Potpie",
    "url": "http://allrecipes.com/recipe/240585/homemade-chicken-potpie/"
}