{
    "directions": [
        "Place water, salt, and garlic into a large saucepan. Add cloves, bay leaves, coriander seeds, and black peppercorns. Stir until salt is dissolved. Heat over low for just a few minutes to bring water to room temperature. The water should not be warm.",
        "Place some dill flowers in the bottom of a jar or crock large enough to hold the cucumbers, spices, and some brine.  Place a few of the cucumbers on top of the dill weed. Alternate layers of dill flowers and cucumbers, ending with a layer of dill. Pour pickling brine into the crock. Gently tap or shake the crock to eliminate any air bubbles. Weigh down the pickles with a small ramekin to ensure they stay below the surface of the brining liquid. Top with more brine. Reserve any extra brine to add if necessary during the fermentation process. Cover crock.",
        "Place crock where it can ferment at a temperature between 65 and 75 degrees F. Let pickles ferment for a week, checking every day to ensure pickles remain submerged. Small bubbles may appear; this is a normal product of the fermentation process. Add more brine if necessary.",
        "After about 8 days, you can skim off the foam. Test a pickle for flavor and crunch. You can continue fermenting them for a couple more days or, if you like them at this point, transfer pickles to a large jar. Fill jar with the brine from the fermentation process. Cover and store finished pickles in the refrigerator."
    ],
    "ingredients": [
        "Brine:",
        "8 cups cold fresh water",
        "8 tablespoons kosher salt",
        "4 cloves peeled garlic",
        "4 whole cloves",
        "3 bay leaves, or more to taste",
        "2 teaspoons whole coriander seeds",
        "2 teaspoons whole black peppercorns",
        "1 bunch fresh, flowering dill weed",
        "2 pounds very fresh Kirby cucumbers, washed thoroughly"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Dill Pickles",
    "url": "http://allrecipes.com/recipe/244811/homemade-dill-pickles/"
}
