{
    "directions": [
        "Place a large pot on the stovetop and place sterile 5 half-pint canning jars inside. Fill with enough water so that the jars are immersed up to their necks. Set the burner to low heat. The goal is to be able to maintain a consistent temperature between 110 degrees F and 115 degrees F (45 degrees C) for 4 to 6 hours. Check the temperature using a candy or meat thermometer periodically.",
        "Meanwhile, pour the milk and dry milk into a large saucepan. Stir to dissolve the powder and set over medium heat. Heat until just steaming; your thermometer should read 180 degrees F (82 degrees C). Remove from the heat and place the pan so the bottom is sitting in a bowl of ice water. Cool until the temperature has dropped to 115 degrees F (45 degrees C).",
        "When it reaches the temperature, remove it from the heat and stir about 1 cup of the milk into the plain yogurt until thoroughly blended. Stir this mixture back into the pan of milk.",
        "Pour the milk mixture into warm glass jars to within 1/2 inch of the rims. Set in the warm water bath. The water level should be up to the level of the yogurt in the jars. Cook uncovered and be sure to maintain the temperature at 110 to 115 degrees F (45 degrees C) for 4 to 6 hours. I like to do 6. Do not stir or poke the yogurt at all during this time - even if you are tempted! Doing this may cause it to become watery.",
        "When the time is about up, you can check the yogurt by pressing gently on the top or tipping the jars to see if it is set. It is done when the yogurt is firm and there is a thin layer of yellowish liquid on the top. Remove the jars from the water and dry off. Seal with clean lids and rings. They should be good to keep in the refrigerator for 1 to 2 weeks.",
        "Be sure to save a little extra out as a starter for the next batch. Over time your homemade yogurt will start to lose it's potency as starter (like making a copy of a copy of a copy), so every fourth or fifth batch you may want to use store-bought yogurt as starter. Just make sure it says ''live active cultures'' on the container. Good luck!"
    ],
    "ingredients": [
        "1 quart 1% milk",
        "1/4 cup dry milk powder",
        "3 tablespoons plain yogurt with active cultures"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Plain Yogurt",
    "url": "http://allrecipes.com/recipe/139891/homemade-plain-yogurt/"
}
