{
    "directions": [
        "Dust 2 baking sheets with semolina flour and set aside.",
        "In a large bowl, mix the squid ink, egg, and 120 grams (about 1/2 cup) water. Place the flour on a dry, clean work surface, forming a mound about 8 to 10 inches in diameter at its base. Sprinkle the salt in the middle of the mound. Using the bottom of a measuring cup, create a well 4 to 5 inches wide, with at least a half inch of flour at the bottom of the well.",
        "Slowly and carefully add the wet ingredients (squid ink, egg, and water) into the well, treating the flour as a bowl. Using a fork, gently beat the eggs without touching the flour walls or scraping through the bottom to the work surface. Then, still stirring, begin to slowly incorporate the flour \"walls\" into the egg mixture, gradually working your way toward the outer edges of the flour, but disturbing the base as little as possible. If the eggs breach the sides too soon, quickly scoop them back in and reform the wall. Once the dough starts to take on a thickened, paste-like quality (slurry), slowly incorporate the flour on the bottom into the mixture.",
        "When the slurry starts to move as a solid mass, remove as much as possible from the fork. Slide a bench scraper or spatula under the mass of dough and flip it and turn it onto itself to clear any wet dough from the work surface. At this point, with your hands, start folding and forming the dough into a single mass. The goal is to incorporate all the flour into the mass, and using a spray bottle to liberally spritz the dough with water is essential. It is a very dry dough, and it cannot be overstated how important it is to generously and constantly spritz to help \"glue\" any loose flour to the dry dough ball. When the dough forms a stiff, solid mass, scrape away any dried clumps of flour from the work surface, which, if incorporated in the dough, will create dry spots in the final product.",
        "Kneading is an essential step in the dough-making process: it realigns the protein structure of the dough so that it develops properly during the resting stage that follows. Kneading is simple: Drive the heel of your dominant hand into the dough. Push down and release, and then use your other hand to pick up and rotate the dough on itself 45 degrees. Drive the heel of your hand back in the dough, rotate, and repeat for 10 to 15 minutes. This is how Italian grandmas get their fat wrists.",
        "Pasta is easy to underknead but virtually impossible to overknead (unlike bread, where each type has its sweet spot or ideal kneading time). That said, even though the dough cannot be overkneaded, it can spend too much time on the worktable–and, as a direct result, start to dehydrate and be more difficult to form into its final shape. For best results, I think a 10 to 15 minute range is a solid guideline. When the dough is ready, it will stop changing appearance and texture. The dough will be firm but bouncy to the touch and have a smooth, silky surface, almost like Play-Doh. Tightly wrap the dough in plastic wrap.",
        "At this stage, the flour particles continue to absorb moisture, which further develops the gluten structure that allows pasta dough to stand up to rolling and shaping.",
        "If you plan to use the dough immediately, let it rest at room temperature, wrapped in plastic, for at least 30 minutes prior to rolling it out (the next step). If resting for more than 6 hours, put the dough in the refrigerator. It's best to use fresh dough within 24 hours. Under proper refrigeration, the dough will hold for 2 days.",
        "Rolling is the last phase of the mixing process. Rolling out pasta by machine–whether it's a hand-crank model or an electric one–should be a delicate, almost Zen-like art. You can only roll out dough that has rested for at least 30 minutes at room temperature. If it has rested for longer in the fridge, give the dough enough time to come back to room temperature. The fat content of pasta dough is so high that it will solidify when cold, so it needs to come back to room temperature to be easier to roll.",
        "The process for rolling sheets of pasta dough is the same whether you have a hand-cranked machine or an electric one, like we have in the restaurant.",
        "To start, slice off a section of the ball of dough, immediately rewrapping the unused portion in plastic wrap. Place the piece of dough on the work surface and, with a rolling pin, flatten it enough that it will fit into the widest setting of the pasta machine. You do not want to stress the dough or the machine.",
        "It's crucial to remember that whenever the pasta dough is not in plastic wrap or under a damp towel, you're in a race against time. The minute you expose the pasta to air, it starts to dehydrate. This creates a dry outer skin that you do not want to incorporate into the finished dough; the goal is to create a dough of uniform consistency.",
        "Our dough is purposely very dry. We do not add any raw flour in the rolling process. Extra flour added at this point sticks to the dough and, when cooked, that splotch turns into a gooey mass, a slick barrier to sauce. It dulls the seasoning and flavors of both the dough and the finished dish.",
        "Begin rolling the dough through the pasta machine, starting with the widest setting first. Roll out the dough to the thick setting, slightly over 1/16-inch. When handling the sheet of dough–especially as it gets longer–always keep it taut and flat. Never grab or flop or twist the pasta. The sheet should rest on the inside edges of your index fingers with your fingers erect and pointed out.",
        "The hands don't grab or stretch the dough; instead, they act as paddles, guiding the sheet of dough through the machine. Handling the dough with your fingers pointed straight out alleviates any pressure on the dough, which stretches and warps it. Use the right hand to feed the machine and use the left hand to crank. Once the pasta dough is halfway through, switch hands, pulling out with the left hand. If you have trouble doing it alone as the dough gets longer and thinner, find a friend to help juggle the dough, or roll out a smaller, more wieldy batch. Once you roll out the dough, immediately form it into shape.",
        "If you are cutting the dough with a chitarra, first cut a section of rolled dough that is the same length as your chitarra and place it atop the strings. Using a rolling pin, lightly press (but don't cut) the dough, forming a slight indentation–enough to set it so it won't slide. Then, press with more force to cut the dough through the strings into noodles. Put the noodles on the prepared baking sheet. Repeat with the remaining dough.",
        "If you are cutting the dough by hand, cut a 2-foot section of the rolled-out dough sheet, and cover the rest of the dough with plastic wrap. Using a knife, cut the dough into 12-inch segments. Make two stacks of strips, with four strips per stack and dusting between layers with semolina flour. Allow the dough to dry until it has a leathery texture, 30 to 45 minutes. It should still be pliable. Fold each stack like a letter, forming three even layers. Cut individual square-edged, long noodles by slicing segments off the edge of the folded dough that are the same width as the dough's thickness. Shake off the excess semolina and form into small nests on the prepared baking sheets."
    ],
    "ingredients": [
        "Semolina flour, for sprinkling",
        "25 grams squid ink (about 2 1/2 tablespoons)",
        "1 large egg, room temperature",
        "540 grams 00 flour (about 3 1/2 packed cups)",
        "2 teaspoons kosher salt",
        "pasta machine or attachment",
        "spray bottle filled with warm water",
        "chitarra (if using)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Pasta"
    ],
    "title": "Homemade Squid Ink Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-squid-ink-pasta-51244010"
}
