{
    "directions": [
        "Place kosher salt, brown sugar, pickling spice, and pink salt in a container large enough to hold the brine and the ham.",
        "Bring 2 quarts of water to a boil and pour over the brine ingredients; whisk to dissolve. Pour in 1 gallon fresh cold water to cool down the mixture.",
        "Score the skin side of the pork roast with a sharp knife. Cut into the fat beneath the skin but not into the meat. Score about 1 inch apart, then score in the opposite direction to get the classic diamond-shaped pattern.",
        "Lower scored roast into the cooled brine, skin side up. Use a plate to weigh down the roast so that it cures fully submerged in the liquid. Refrigerate for 1 day for every 2 pounds of pork (for a 7 pound roast, cure for at least 2 1/2 days). Turn the roast over halfway through the brining process.",
        "Remove roast from brining liquid. Discard the brining liquid and transfer the roast back to the brining container. Cover the roast with fresh cold water to rinse off some of the salt. Depending on how salty you want your ham, you can soak it for just a few minutes or overnight. Remove roast from the water and blot dry with paper towels.",
        "Preheat oven to 325 degrees F. Add a cup of water to a roasting pan with 2 whole star anise. Place roast on a rack in the roasting pan.",
        "Roast until ham reaches an internal temperature of 130 to 135 degrees F, about 2 hours. Ham will not be fully cooked at this point. If water has nearly evaporated, add a splash more. Increase oven temperature to 425 degrees F. Continue to roast until skin is browned and crispy and ham reaches an internal temperature of 145 to 150 degrees F.",
        "To make the optional glaze, mix the mustard, maple syrup, cayenne pepper, and salt together in a bowl. Brush glaze on the ham at this point, not before. Return roast to oven for about 5 minutes to crisp it even further."
    ],
    "ingredients": [
        "1 (7 pound) fresh, bone-in pork shoulder (\"picnic\") arm roast, with the skin still on",
        "6 quarts water, divided",
        "18 ounces kosher salt",
        "2 cups brown sugar",
        "7 teaspoons pink salt #1 (curing salt)",
        "1 tablespoon pickling spice, or to taste",
        "Optional Glaze:",
        "1/4 cup Dijon mustard",
        "1/4 cup maple syrup",
        "1 pinch cayenne pepper",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Home-Cured Holiday Ham",
    "url": "http://allrecipes.com/recipe/245724/home-cured-holiday-ham/"
}
