{
    "directions": [
        "For the clove-scented ketchup: Whisk together the ketchup and clove in a small bowl. Cover and let sit at room temperature.",
        "For the Home Fries: Heat the butter in a large cast-iron skillet over medium-high heat until it begins to shimmer. Add the potatoes, za'atar, paprika, turmeric and a very generous amount of salt and toss to coat the potatoes. Use a spatula to press and crush the potatoes against the bottom of the pan. Cook until golden brown and crisp on the bottom, about 4 minutes. Turn in large chunks and press again to crisp. Cook until browned on the bottom, another 4 minutes. Taste and add salt as needed.",
        "While the potatoes crisp, heat the vegetable oil in a small skillet over medium heat. Add the chiles and cook, stirring, until warmed and very slightly softened, about 1 minute. Stir in the herbs.",
        "Spoon the chile mixture over the potatoes and drizzle with the lime juice. Serve straight from the pan, with the clove-scented ketchup on the side."
    ],
    "ingredients": [
        "1 cup ketchup, such as Heinz",
        "1/4 teaspoon ground cloves",
        "4 tablespoons (1/2 stick) unsalted butter",
        "5 large russet potatoes, parboiled in salted water, peeled and cut into 1-inch cubes",
        "2 teaspoons za'atar",
        "1/2 teaspoon paprika",
        "1/4 teaspoon turmeric",
        "Kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon vegetable oil",
        "2 Fresno chiles, thinly sliced",
        "1/4 cup coarsely chopped mixed herbs (a combination of cilantro, dill and parsley)",
        "Juice of 1 lime"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Potato",
        "Vegetable",
        "Brunch"
    ],
    "title": "Home Fries with Za'atar, Red Chile, Cilantro, Lime and Clove-Scented Ketchup",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/home-fries-with-zaatar-red-chile-cilantro-lime-and-clove-scented-ketchup"
}
