{
    "directions": [
        "Pour 6 cups water and beer into large deep roasting pan. Add coarse salt; stir until dissolved. Add sugar; stir until dissolved. If desired, stir in Insta Cure No. 1. Mix in pickling spices. Pierce brisket all over with tip of small sharp knife. Submerge brisket in liquid, then top with heavy platter to weigh down. Cover and refrigerate 4 days.",
        "Remove brisket from brine. Stir liquid to blend. Return brisket to brine; top with heavy platter. Cover; refrigerate 4 days. Remove brisket from brine. Rinse with cold running water.",
        "Place corned beef in very large wide pot. Add stout and enough water to cover by 1 inch. Wrap cheesecloth around bay leaves, coriander seeds, allspice, and chile, enclosing completely, and tie with kitchen string to secure. Add spice bag to pot with beef; bring to boil. Reduce heat to medium-low, cover, and simmer until beef is tender, about 2 1/4 hours. Transfer beef to large baking sheet.",
        "Add turnips and all remaining vegetables to liquid in pot; bring to boil. Reduce heat to medium and boil gently until all vegetables are tender, about 25 minutes. Using slotted spoon, transfer vegetables to baking sheet with beef. Return beef to pot and rewarm 5 minutes. Discard spice bag.",
        "Cut beef against grain into 1/4-inch thick slices. Arrange beef and vegetables on platter. Serve with Horseradish Cream and Guinness Mustard.",
        "Brisket can be removed from brine 2 days ahead. Wrap corned beef in plastic, cover with foil, and refrigerate."
    ],
    "ingredients": [
        "6 cups water",
        "2 cups lager beer",
        "11/2 cups coarse kosher salt",
        "1 cup (packed) golden brown sugar",
        "1 1/2 tablespoons Insta Cure no. 1 (optional, See Note)",
        "1/4 cup pickling spices",
        "1 6- to 8-pound flat-cut beef brisket, trimmed, with some fat remaining",
        "1 12-ounce bottle Guinness stout or other stout or porter",
        "4 bay leaves",
        "1 tablespoon coriander seeds",
        "2 whole allspice",
        "1 dried chile de árbol (See Note), broken in half",
        "12 baby turnips, trimmed, or 3 medium turnips or rutabagas, peeled, quartered",
        "8 unpeeled medium white-skinned or red-skinned potatoes (about 3 pounds)",
        "6 medium carrots, peeled",
        "4 medium onions, peeled, halved through root ends",
        "2 medium parsnips, peeled, cut into 2-inch lengths",
        "1 2-pound head of cabbage, quartered",
        "Horseradish Cream",
        "Guinness Mustard",
        "Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Potato",
        "High Fiber",
        "Dinner",
        "Brisket",
        "Spice",
        "Carrot",
        "Turnip",
        "Winter",
        "Brine",
        "Cabbage",
        "Boil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Homemade Irish Corned Beef and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-irish-corned-beef-and-vegetables-241623"
}
