{
    "directions": [
        "Melt butter with oil in heavy large pot over medium heat. Add next 4 ingredients. Sauté until vegetables are soft but not brown, 12 to 14 minutes. Add beef, sausage, venison, and bacon. Increase heat to high. Cook until meat is brown, breaking into small pieces with back of spoon, about 15 minutes.",
        "Stir in milk, wine, and tomato paste. Reduce heat to low. Simmer until sauce is thick, flavors blend, and juices are reduced, stirring occasionally, about 1 hour 15 minutes. Season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cool 1 hour. Chill uncovered until cold, then cover and chill. Rewarm over low heat.",
        "Cook pasta in very large pot of boiling salted water until just tender but still firm to bite, stirring often, 4 to 5 minutes if cooking immediately or 5 to 6 minutes if previously chilled. Drain, reserving 1 cup cooking liquid. Return pasta to same pot. Add warm Bolognese and 1 cup cheese. Toss over medium heat until heated through, adding reserved cooking liquid by 1/4 cupfuls if dry. Season with salt and pepper.",
        "Transfer pasta to large shallow bowl. Serve, passing additional cheese.",
        "Pour a medium-bodied red, like the Michele Chiarlo 2007 Barbera d'Asti \"Le Orme\" ($15, Italy)."
    ],
    "ingredients": [
        "5 tablespoons butter",
        "7 tablespoons extra-virgin olive oil",
        "2 cups chopped onions",
        "1 1/4 cups chopped celery",
        "3/4 cup chopped carrot",
        "2 large garlic cloves, chopped",
        "1 1/2 pounds ground beef (15% fat)",
        "1 1/2 pounds antelope sausages or spicy Italian sausages, casings removed",
        "3/4 pound ground venison or ground beef (15% fat)",
        "3/4 pound bacon, chopped",
        "1 1/2 cups whole milk",
        "1 1/2 cups dry white wine",
        "3/4 cup tomato paste (about 7 1/2 ounces)",
        "Homemade Pappardelle",
        "1 cup freshly grated Parmesan cheese plus additional for passing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Wine",
        "Father's Day",
        "Dinner",
        "Meat",
        "Ground Beef",
        "Venison",
        "Sausage",
        "Family Reunion",
        "Party",
        "Potluck",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Homemade Pappardelle with Bolognese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-pappardelle-with-bolognese-sauce-357538"
}
