{
    "directions": [
        "Working in 2 batches, purée coconut and 4 1/2 cups hot water in a blender on high with vent open or lid slightly ajar covered with a towel (hot liquids can splatter) until smooth, 4–5 minutes. Pour mixture through a fine-mesh sieve set over a large bowl. Using a small ladle, spatula, or wooden spoon, press as much liquid from coconut as possible. You should have approximately 3 1/2 cups of milk. Discard solids or reserve for another use (see headnote). Rinse blender.",
        "Blend pectin and 1 cup coconut milk in blender until smooth, about 1 minute. Heat the remaining coconut milk in a medium saucepan over medium-high until an instant-read thermometer registers 140°F. Stir in pectin mixture and return to 140°F. Remove from heat and cool until thermometer registers 110°F. Whisk in coconut yogurt and vanilla, if using, pour into jars, and seal.",
        "Fill a large stockpot with water and heat until thermometer registers 115°F. Remove from heat, carefully place sealed jars in pot, and check water level—the jars should be submerged enough to cover all of the yogurt. Cover pot and let culture at least 12 hours and up to 1 day. Transfer jars to the refrigerator and chill at least 6 hours—the yogurt will become thicker as it chills."
    ],
    "ingredients": [
        "3 1/2 cups unsweetened coconut flakes",
        "2 teaspoons pectin powder (such as Pomona's)",
        "4 tablespoons store-bought coconut yogurt with live cultures",
        "1 teaspoon vanilla extract (optional)",
        "3 (8-ounce) or 2 (16-ounce) glass jars with lids"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Yogurt",
        "Lunch",
        "Coconut",
        "Healthy",
        "Low Cholesterol"
    ],
    "title": "Homemade Coconut Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-coconut-yogurt-56389461"
}
