{
    "directions": [
        "Beat butter, white sugar, and salt together in a bowl; add 2 cups flour and stir. Beat 1 cup flour into butter mixture; mix until a sticky dough forms.",
        "Whisk egg, vanilla extract, and milk together in a bowl. Beat remaining flour and egg mixture into dough. Cover the bowl with plastic wrap and refrigerate for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Break off a small portion of dough and roll it out on a lightly floured work surface into a 1/4-inch thick round. Place round on prepared baking sheet. Repeat with remaining dough.",
        "Bake cookies in the preheated oven until slightly golden and soft, 8 to 10 minutes. Transfer cookies to a wire rack to cool completely.",
        "Cook and stir coconut in a large skillet over medium heat until golden brown and toasted, 2 to 4 minutes.",
        "Melt caramel bits in a microwave-safe bowl, stirring every 30 seconds, until melted and smooth, about 2 minutes. Stir coconut into caramel. Press a spoonful of caramel-coconut mixture into the top of each cookie.",
        "Melt chocolate in a microwave-safe bowl, stirring every 30 seconds, until melted and smooth, about 60 seconds. Dip the base of each cookie into melted chocolate and place dipped cookies on parchment paper until chocolate sets. Drizzle chocolate over the top of each cookie."
    ],
    "ingredients": [
        "2 cups butter, softened",
        "1 cup white sugar",
        "1 teaspoon salt",
        "4 cups all-purpose flour, divided",
        "1 large egg, lightly beaten",
        "2 tablespoons vanilla extract",
        "1 teaspoon milk",
        "4 cups sweetened flaked coconut",
        "22 ounces caramels (such as Kraft® Caramel Bits)",
        "1 pound chocolate (such as CandiQuick®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Homemade Samoa Cookies",
    "url": "http://allrecipes.com/recipe/241752/homemade-samoa-cookies/"
}
