{
    "directions": [
        "Slowly heat milk and cream in a 6-quart pot over medium heat, stirring occasionally to avoid scalding, until mixture foams and reaches 190°F, 25–30 minutes. Add vinegar and 1 1/2 tsp. salt, stir once, and continue to cook, about 2 minutes. Remove from heat and let rest until mixture separates into clumps of milky white curds and whey, about 10 minutes.",
        "Meanwhile, line a large sieve with 2 layers of cheesecloth and place it over a large bowl. Using a slotted spoon, carefully transfer curds into strainer, letting whey collect in bowl. Strain until curds begin to firm up, 15–20 minutes, then transfer curds to a medium bowl with slotted spoon. Discard whey or reserve for another use.",
        "Fold chopped herbs and remaining 1 Tbsp. salt into curds. Transfer both layers of cheesecloth to a large plate and spoon herbed curds into the center. Use the back of a spoon to flatten curds into a round 3/4-1\" thick. Gather ends of cheesecloth and wrap tightly around curds. Place a second plate on top and use a can or other heavy object to weigh it down. Refrigerate at least 1 hour or up to overnight.",
        "Remove cheesecloth and place pressed cheese onto a cutting board. Cut into 1\" cubes and serve or use as desired."
    ],
    "ingredients": [
        "8 cups whole milk",
        "1 cup heavy cream",
        "3/4 cup distilled white vinegar",
        "1 tablespoon plus 1 1/2 teaspoons kosher salt, divided",
        "1/4 cup chopped fresh herbs (such as parsley, basil, and/or oregano)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Herb",
        "Appetizer",
        "Side",
        "Kid-Friendly",
        "Oscars",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Homemade Herbed Paneer Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/homemade-herbed-paneer-cheese-56389385"
}
