{
    "directions": [
        "Combine the honey, yeast and 1/2 cup warm water. Stir to combine and let the mixture stand until the yeast is activated and begins to foam, 5 minutes.",
        "Mix the flour and salt in a large mixing bowl with a dough hook and slowly add in the yeast mixture. Gradually add 1 cup warm water and mix until the dough comes together into a ball that is not too wet (you may not need all of the water). If the dough is sticky, add a little bit more flour. Turn out the dough onto a floured surface and knead until the dough is smooth and elastic, 2 to 6 minutes. You can do the thumbprint test: press in the dough with your thumb and it should bounce back when it's ready.",
        "Form the dough into a ball, place it in a lightly-oiled bowl and cover with a dishcloth, so it doesn't dry out. Let rest in a warm environment until doubled in size, 25 to 30 minutes.",
        "Punch down the dough and divide it in half. Shape into 2 baguettes by making a flat rectangle out of your dough, then folding the top and bottom towards the middle, like an envelope, and sealing the seam with your fingers. Keep repeating the folding and sealing, stretching the rectangle lengthwise as you go, until it's about 12 to 14 inches long and 2 inches wide. Fold and seal either end to round. Flip seam-side down and place on a sheet pan or baguette pan that has been dusted with cornmeal. Score the tops of the loaves, making deep diagonal slits 1/2-inch deep, cover with a dishcloth and let rise in a warm environment until they have doubled in size, 25 minutes.",
        "Preheat the oven to 450 degrees F and position your oven racks with one on the bottom and the other in the middle. Place an oven-safe (non-glass) bowl or pan on the bottom rack.",
        "When your bread has doubled for the second time, remove the towel and quickly and simultaneously, slide the sheet tray with the baguettes onto the middle rack while carefully throwing the ice cubes into the bowl on the bottom rack. The ice will create a burst of steam that will give you a nice crispy crust. Quickly shut the oven door so no steam escapes. Bake the baguettes until golden brown, 15 minutes.",
        "Cook's Note: If you have a glass window on your oven, place a towel over it when throwing the ice in, hot glass can shatter if ice touches it.",
        "Serving suggestions: ricotta cheese and acacia honey."
    ],
    "ingredients": [
        "2 envelopes dry active yeast (1 1/2 tablespoons)",
        "2 tablespoons honey",
        "3 1/2 to 4 cups all-purpose flour, plus more for dusting",
        "2 teaspoons salt",
        "Canola oil, for greasing bowl",
        "Cornmeal, for dusting pan",
        "3 to 4 ice cubes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bread"
    ],
    "title": "Homemade French Baguettes",
    "url": "http://www.foodnetwork.com/recipes/homemade-french-baguettes"
}
