{
    "directions": [
        "Place chicken breasts and salt in a pot; cover halfway with water. Bring to a boil; cook until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 15 minutes. Cool until easily handled, about 5 minutes. Shred into thin pieces.",
        "Heat 1 tablespoon vegetable oil in a large skillet over medium heat. Add onion, tomato, and green bell peppers; cook and stir until softened, about 2 minutes. Stir in shredded chicken, 1 teaspoon chicken bouillon, and black pepper; cook until golden brown, about 5 minutes.",
        "Spoon some of the chicken mixture into the middle of each corn tortilla. Fold tortilla around filling and secure with a toothpick.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry tortillas in batches until golden and crispy, about 2 minutes per side. Drain on paper towels.",
        "Bring 1/4 cup water to a boil in a small saucepan. Add tomato sauce, 1/2 teaspoon chicken bouillon, and seasoned salt. Cook and stir over medium-high heat until sauce thickens, about 5 minutes. Serve sauce over tacos."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1910&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4116217.jpg",
    "ingredients": [
        "2  skinless, boneless chicken breasts",
        "½ teaspoon salt, or to taste",
        "1 tablespoon vegetable oil",
        "1  onion, finely chopped",
        "1  tomato, finely chopped",
        "1  green bell pepper, finely chopped",
        "1 teaspoon chicken bouillon granules",
        "½ teaspoon ground black pepper",
        "1 pound corn tortillas",
        "vegetable oil for frying",
        "¼ cup water",
        "1 (6.5 ounce) can tomato sauce",
        "½ teaspoon chicken bouillon granules",
        "½ teaspoon seasoned salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honduran-Style Crispy Fried Tacos",
    "url": "http://allrecipes.com/recipe/255921/honduran-style-crispy-fried-tacos/"
}