{
    "directions": [
        "Place 1/2 cup warm milk and 1 teaspoon sugar in large bowl; sprinkle yeast over and stir to blend. Let stand until yeast dissolves and mixture looks foamy, about 5 minutes. Mix in 1/2 cup flour to form soft sponge. Cover sponge and let stand until very light and bubbly, about 30 minutes.",
        "Whisk eggs, honey, butter, lemon and orange peel, salt, remaining 1/4 cup milk, and 6 tablespoons sugar in medium bowl to blend. Stir egg mixture into sponge. Mix in 3 cups flour, 1 cup at a time, to form soft dough. Mix in additional flour, 1 tablespoon at a time, until dough is soft and just barely sticky. Turn out onto floured work surface. Knead dough until smooth and elastic, sprinkling with more flour by tablespoonfuls if still sticky, about 8 minutes.",
        "Butter another large bowl. Form dough into ball. Place in bowl; turn to coat. Cover bowl with plastic wrap. Let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
        "Gently press dough down. Sprinkle with all fruits and nuts; knead in bowl to distribute evenly.",
        "Remove center tube of an angel food cake pan and place an 8-inch-diameter tart pan bottom inside to create 12-cup baking mold. Spray mold with nonstick spray, then butter and flour pan. Form dough into round. Place in prepared pan. Cover with plastic wrap. Let rise in warm draft-free area until almost doubled in volume and almost level with top of pan, about 1 hour 15 minutes.",
        "Preheat oven to 375°F. Bake pan dulce until deep brown on top and tester inserted into center comes out clean, about 45 minutes. Let stand in pan 5 minutes. Turn out onto rack and cool completely. DO AHEAD Can be made 1 day ahead. Wrap in foil and store at room temperature.",
        "*Available at some specialty foods stores and candy stores."
    ],
    "ingredients": [
        "3/4 cup warm milk (120°F), divided",
        "1 teaspoon plus 6 tablespoons sugar",
        "2 envelopes active dry yeast",
        "3 3/4 cups (about) all purpose flour, divided",
        "2 large eggs",
        "1/4 cup honey",
        "1/4 cup (1/2 stick) unsalted butter, very soft room temperature",
        "1 teaspoon (packed) finely grated lemon peel",
        "1 teaspoon (packed) finely grated orange peel",
        "1 1/4 teaspoons salt",
        "1/4 cup chopped candied orange slices* or candied orange peel",
        "1/4 cup raisins",
        "1/4 cup chopped Calimyrna figs",
        "1/4 cup dried tart cherries",
        "1/4 cup chopped roasted salted cashews",
        "1/4 cup chopped toasted almonds",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Orange",
        "Raisin",
        "Fig",
        "Cherry",
        "Almond",
        "Cashew",
        "Winter",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey Pan Dulce with Nuts and Dried Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/honey-pan-dulce-with-nuts-and-dried-fruit-236470"
}
