{
    "directions": [
        "In a medium saucepan, combine the milk and cream. Break up the cinnamon stick into several pieces and toss them into the pan. Scald the milk mixture over medium-high heat (bubbles start to form around the edge of the pan, but the liquid is not boiling). Remove from the heat and let the cinnamon steep in the milk mixture for about 1 hour.",
        "In a medium bowl, whisk the egg yolks until blended, and then slowly whisk in the honey, sugar, and ground cinnamon until combined. Return the milk mixture to medium-high heat and scald again. Slowly add the hot milk mixture to the egg-honey mixture, a little at a time, whisking constantly. When all of the hot milk mixture has been incorporated, return the contents of the bowl to the saucepan, and return the saucepan to medium heat. Cook, stirring continuously with a wooden spoon, for 6 to 8 minutes, or until the mixture thickens and coats the back of the spoon. The mixture will seem watery at first, then it will start to steam, and then it will start to develop a little body and get thicker. Remove from the heat and immediately strain through a fine-mesh sieve into an airtight container. Whisk in the salt. Cover and refrigerate for at least 2 hours, or until cold, or up to overnight.",
        "Churn in an ice cream maker according to the manufacturer's directions.",
        "When the ice cream has finished churning, freeze it for at least 2 hours to allow it to ripen. During the ripening process, the ice cream becomes harder and smoother and the flavors more fully develop. The ice cream can be stored in an airtight container in the freezer for up to 1 week."
    ],
    "ingredients": [
        "2 cups (480 grams) milk",
        "2 cups (480 grams) heavy cream",
        "1 cinnamon stick, 2 inches long",
        "8 egg yolks",
        "3/4 cup (255 grams) honey",
        "2 tablespoons sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Christmas",
        "Fourth of July",
        "Thanksgiving",
        "Frozen Dessert",
        "Condiment",
        "Spice",
        "Birthday",
        "Honey",
        "Cinnamon",
        "Party",
        "Advance Prep Required",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Cinnamon Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/honey-cinnamon-ice-cream-364329"
}
