{
    "directions": [
        "Pound pork between 2 sheets of plastic wrap to 1/4\" thick; season with kosher salt and pepper. Whisk garlic, turmeric, yogurt, honey, and 1 tablespoon lemon juice in a small bowl; season with kosher salt and pepper. Place cutlets in a large resealable bag. Add yogurt mixture, seal bag, and toss to coat. Let sit at least 10 minutes.",
        "Remove cutlets from marinade, letting excess drip off. Heat 1 tablespoon vegetable oil in a large skillet over medium-high; cook 2 cutlets until browned and cooked through, about 2 minutes per side. Transfer pork to a platter. Wipe out skillet; repeat with remaining cutlets and 1 tablespoon vegetable oil.",
        "Toss beets, carrots, carrot tops (if using), chives, olive oil, and remaining 1 tablespoon lemon juice in a small bowl. Season with kosher salt, pepper, and more lemon juice, if desired. Serve pork topped with salad and sprinkled with sea salt.",
        "Pork can be marinated 12 hours ahead. Chill."
    ],
    "ingredients": [
        "1 1/4 pounds boneless pork shoulder (Boston butt), fat trimmed to 1/4\", cut into 4 pieces",
        "Kosher salt, freshly ground pepper",
        "2 garlic cloves, finely grated",
        "1 1/2 teaspoons finely grated peeled turmeric or 1/2 teaspoon ground turmeric",
        "1/2 cup plain whole-milk yogurt",
        "1/4 cup honey",
        "2 tablespoons (or more) fresh lemon juice, divided",
        "2 tablespoons vegetable oil",
        "3 small beets, scrubbed, thinly sliced",
        "3 small carrots, preferably with tops, tops reserved, carrots scrubbed, cut on a diagonal",
        "2 tablespoons finely chopped fresh chives",
        "2 tablespoons olive oil",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Kid-Friendly",
        "Yogurt",
        "Beet",
        "Carrot"
    ],
    "title": "Honey-Turmeric Pork with Beet and Carrot Salad",
    "url": "http://www.epicurious.com/recipes/food/views/honey-turmeric-pork-with-beet-and-carrot-salad-56389766"
}
