{
    "directions": [
        "Combine water, 2 tablespoons honey, 2 tablespoons sugar and vanilla in medium skillet. Stir over medium-low heat until sugar dissolves. Add peach halves; cover and simmer 3 minutes. Turn peaches over; cover and simmer until just tender, about 3 minutes longer. Using slotted spoon, transfer to plate. Cool. Simmer syrup until reduced to 3 tablespoons, about 2 minutes.",
        "Preheat oven to 400°F. Line large baking sheet with foil. Roll out pastry on floured surface to 17x11-inch rectangle, and 1/8-inch thick. Cut into six 4 1/2x5 1/2-inch rectangles. Cut off 1/2-inch-wide strip from each side of 1 rectangle. Brush strips with beaten egg. Place 2 long strips, egg side down, atop long edges of rectangle. Place short strips, egg side down, atop short edges, trimming to fit. Repeat with remaining rectangles.",
        "Place pastries on baking sheet. Spread 1 teaspoon honey over bottom of each. Slice each peach half thinly; fan slightly. Place 1 half in center of each pastry. Top each with 1 teaspoon sugar.",
        "Bake tartlets until crust is golden, about 25 minutes. Immediately transfer to rack; cool. Rewarm syrup until liquefied. Brush peaches with syrup.",
        "Beat cream, honey and vanilla in bowl to soft peaks. Serve tartlets with honey cream."
    ],
    "ingredients": [
        "1/4 cup water",
        "2 tablespoons plus 6 teaspoons honey",
        "2 tablespoons plus 6 teaspoons sugar",
        "2 teaspoons vanilla extract",
        "3 peaches, peeled, halved, pitted",
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "1 egg, beaten to blend",
        "3/4 chilled whipping cream",
        "1 tablespoon honey",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Peach",
        "Summer",
        "Honey"
    ],
    "title": "Honeyed Peach Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/honeyed-peach-tartlets-634"
}
