{
    "directions": [
        "Position rack in top third of oven and preheat to 375°F. Using lightly floured rolling pin, roll out puff pastry on lightly floured surface to 14x10-inch rectangle. Fold 1/2 inch of pastry edges in toward center on all sides, forming 13 x 9-inch rectangle. Transfer pastry to large rimmed baking sheet. Press firmly on pastry edges with fork to form rim. Chill crust.",
        "Cook bacon in small skillet over medium heat until brown and crisp. Transfer to paper towels to drain. Reserve 1 tablespoon bacon drippings from skillet.",
        "Whisk honey, wine, and reserved 1 tablespoon bacon drippings in large bowl. Add onions; toss to coat. Coat another large rimmed baking sheet with nonstick spray. Spread onion mixture in even layer on sheet. Roast 30 minutes. Turn onions over, allowing rings to separate. Roast until onions are caramelized, turning often for even browning, 30 to 45 minutes. Remove from oven; cool onions slightly.",
        "Increase oven temperature to 400°F. Mix crème fraîche, sea salt, 1/4 teaspoon black pepper, and nutmeg in small bowl. Using offset spatula, spread crème fraîche over crust to folded edge. Arrange onions atop crème fraîche. Sprinkle with bacon. bake tart until crust is light golden brown and topping is bubbling, 20 to 25 minutes. Sprinkle with thyme and serve."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "3 bacon slices, cut crosswise into 1/2-inch pieces",
        "1/4 cup honey",
        "1/4 cup dry white wine",
        "2 large sweet yellow onions (about 1 1/2 pounds), cut into 1/4-inch-thick rounds",
        "Nonstick vegetable oil spray",
        "3/4 cup crème fraîche",
        "1/2 teaspoon fine sea salt",
        "1/8 teaspoon freshly grated nutmeg",
        "1 teaspoon fresh thyme leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Appetizer",
        "Bake",
        "Dinner",
        "Bacon",
        "Winter",
        "Honey",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Honey-Roasted Onion Tart",
    "url": "http://www.epicurious.com/recipes/food/views/honey-roasted-onion-tart-363711"
}
