{
    "directions": [
        "Bring first 4 ingredients to boil in medium saucepan. Remove from heat. Cover and let steep 2 hours.",
        "Whisk eggs and sugar in medium bowl. Add honey to cream mixture. Simmer over medium heat, stirring until honey dissolves. Gradually whisk cream mixture into egg mixture. Return custard to same pan. Stir over medium heat until custard thickens enough to coat spoon and thermometer reads 170°F to 175°F, about 4 minutes (do not boil). Strain into clean bowl; whisk in vanilla. Cover; chill until cold, at least 3 hours and up to 1 day.",
        "Process custard in ice cream maker according to manufacturer's instructions. Transfer to bowl, cover, and freeze until firm, at least 3 hours and up to 3 days.",
        "Whisk egg white in medium bowl until frothy. Place sugar in shallow bowl. Dip thyme sprigs, 1 at a time, into egg white to coat, then shake off excess. Add to sugar and turn to coat. Place on paper towels to dry. Let stand at room temperature at least 1 hour and up to 8 hours before using.",
        "Scoop ice cream into bowls or goblets. Garnish with candied thyme."
    ],
    "ingredients": [
        "2 cups heavy whipping cream",
        "1 cup whole milk",
        "15 large fresh thyme sprigs",
        "8 (2 x 1/2-inch) strips lemon peel (yellow part only)",
        "2 large eggs",
        "1/4 cup sugar",
        "1/2 cup honey",
        "1/4 teaspoon vanilla extract",
        "1 large egg white",
        "Sugar",
        "10 large fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Citrus",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Honey",
        "Thyme",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey and Thyme Ice Cream with Candied Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/honey-and-thyme-ice-cream-with-candied-thyme-236890"
}
