{
    "directions": [
        "Blend flour and salt in processor. Add butter; using on/off turns, process until mixture resembles coarse meal. Add 5 tablespoons ice water; process until moist clumps form, adding water by teaspoonfuls if dry. Gather into ball; flatten into disk. Wrap in plastic; let stand 1 hour (do not chill).",
        "Mix first 5 ingredients in medium bowl. Whisk eggs, honey, lemon juice, and orange-flower water in another medium bowl. Add egg mixture to nut mixture; stir until well blended.",
        "Position rack in center of oven and preheat to 400°F. Roll crust out on lightly floured surface to 14-inch round. Transfer to 11-inch-diameter tart pan with removable bottom, allowing crust to drape over pan. Pour filling into crust, spreading evenly. Fold edges over filling, pleating as needed. Brush with egg glaze.",
        "Bake tart until filling is deep golden and almost set, about 40 minutes. Transfer to rack; cool 15 minutes. Carefully insert small knife between top edge of crust and pan sides in several places to loosen tart. Gently push up on tart bottom to release tart from sides of pan. Cool completely. (Can be made 1 day ahead. Cover with foil and store at room temperature.) Cut tart into wedges.",
        "*Available in the baking or liquor section of some supermarkets and at liquor stores."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/4 teaspoon fine sea salt",
        "7 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "5 tablespoons (or more) ice water",
        "3 cups toasted walnuts, chopped",
        "1 1/2 cups (packed) golden brown sugar",
        "2 tablespoons finely chopped candied orange peel",
        "2 teaspoons finely grated lemon peel",
        "1 1/2 teaspoons finely grated orange peel",
        "3 large eggs",
        "3 tablespoons honey",
        "3 tablespoons fresh lemon juice",
        "1 tablespoon orange-flower water*",
        "1 egg, whisked to blend with 2 teaspoons water (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Walnut",
        "Fall",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honeyed Walnut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/honeyed-walnut-tart-232900"
}
