{
    "directions": [
        "Combine 1/4 cup warm water and sugar in small bowl. Sprinkle yeast over; stir to blend. Let stand until yeast dissolves and mixture is foamy, about 6 minutes.",
        "Whisk flour and salt in large bowl to blend. Make well in center. Add raisins, pine nuts, egg, and 1 tablespoon oil to well. Pour remaining 1 1/4 cups warm water over, then pour yeast mixture over. Stir until smooth dough forms. Scrape down sides of bowl; cover bowl with plastic, then towel. Let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
        "Line large rimmed baking sheet with double layer of paper towels. Pour enough oil into large deep saucepan to reach depth of 2 inches. Attach deep-fry thermometer to side of pan and heat oil to 360°F to 370°F. Working in batches of 5 or 6 doughnuts, dip metal tablespoon into hot oil to coat and, without deflating dough, gently scoop up rounded tablespoonful. Drop dough into oil. Fry until deep golden, turning occasionally, about 5 minutes. Using slotted spoon, transfer doughnuts to prepared sheet and drain. Do ahead Doughnuts can be made 6 hours ahead. Let stand at room temperature. Rewarm on same sheet in 350°F oven about 15 minutes.",
        "Whisk honey, 3/4 cup water, and cinnamon in heavy medium saucepan over medium-high heat until syrup comes to boil. Remove pan from heat. Dip warm doughnuts into honey syrup and pile onto platter. Pour remaining syrup into bowl. Serve doughnuts with remaining syrup."
    ],
    "ingredients": [
        "1 1/2 cups warm water (105°F to 115°F), divided",
        "1/2 teaspoon sugar",
        "1 envelope active dry yeast",
        "3 cups unbleached all purpose flour",
        "1/2 teaspoon salt",
        "1/4 cup raisins",
        "1/4 cup pine nuts",
        "1 large egg, beaten to blend",
        "1 tablespoon vegetable oil plus more for frying",
        "1 1/2 cups honey",
        "3/4 cup water",
        "1 tablespoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Fry",
        "Cocktail Party",
        "Hanukkah",
        "Kid-Friendly",
        "Kosher",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Honey-Glazed Doughnuts with Raisins and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/honey-glazed-doughnuts-with-raisins-and-pine-nuts-236796"
}
