{
    "directions": [
        "Whisk first 4 ingredients in medium bowl to blend. Whisk oil, sugar, honey, eggs, lemon peel, aniseed and vanilla in large bowl until smooth. Stir in flour mixture, then nuts. Cover and refrigerate dough until well chilled, about 3 hours.",
        "Preheat oven to 350°F. Butter and flour 2 large baking sheets. Spoon out dough in 3 equal strips (2 on one sheet, spaced well apart, and 1 on second sheet). Using well-floured hands, shape strips into 2-inch-wide by 1-inch-high logs.",
        "Bake logs until just springy to touch, switching and turning pans after 10 minutes, about 20 minutes total (logs will spread). Cool 15 minutes on sheets. Maintain oven temperature.",
        "Using large spatula, gently transfer logs to work surface. Using serrated knife, cut each log on diagonal into §-inch-thick slices. Arrange slices, cut side down, on baking sheets. Bake until bottom side browns, about 7 minutes. Turn cookies over. Bake until bottom side browns, about 7 minutes longer. Transfer to racks and cool (cookies will crisp as they cool). (Can be made 2 weeks ahead. Store airtight at room temperature.)"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup vegetable oil",
        "1/2 cup sugar",
        "1/2 cup honey",
        "2 large eggs",
        "2 teaspoons grated lemon peel",
        "2 teaspoons aniseed, crushed",
        "1 teaspoon vanilla extract",
        "1 1/2 cups slivered almonds (about 6 ounces), lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Lemon",
        "Almond",
        "Spring",
        "Honey",
        "Anise",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey, Anise and Almond Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/honey-anise-and-almond-biscotti-103158"
}
