{
    "directions": [
        "In a large bowl, mix yeast, warm water and 1 cup of bread flour into a thin batter, and let stand until the mixture shows frothy bubbles, about 10 minutes. Stir in vegetable oil, honey, 3 eggs, and salt until well combined. Beat in 2 more cups of bread flour and the whole wheat flour, alternating flours by cupfuls, until the dough is too stiff to stir in more flour.",
        "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes, adding more flour if needed to form a slightly sticky dough. Form the dough into a round shape. Lightly oil a bowl, place the dough in the bowl, and turn the dough over a few times to oil the surface. Cover the bowl with a plastic bag, and let rise in a warm, draft-free place until doubled, 1 to 2 hours.",
        "Punch down the dough, knead it a few times to remove some of the bubbles, and cut it into 3 equal-sized pieces. Cut the first piece into 3 equal parts. Set the rest of the dough aside under a cloth to prevent drying out while you braid the first loaf.",
        "Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Repeat for the other 2 loaves, place them on a baking sheet lined with parchment paper, and let rise until doubled, 45 minutes to 1 hour.",
        "Preheat an oven to 350 degrees F (175 degrees C). Beat 1 egg with 1 teaspoon of water in a small bowl, and brush the egg mixture over the braided challah loaves. Sprinkle with sesame seeds.",
        "Bake in the preheated oven until the tops are a deep golden brown and the loaves sound hollow when tapped on the bottom, about 40 minutes. Cool on a rack before slicing."
    ],
    "ingredients": [
        "2 teaspoons active dry yeast",
        "2 1/8 cups warm water (110 degrees F/45 degrees C)",
        "1 cup bread flour",
        "1/3 cup vegetable oil",
        "1/3 cup honey, or more to taste",
        "3 eggs",
        "2 teaspoons salt",
        "2 cups bread flour, or more if needed",
        "3 cups whole wheat flour, or more if needed",
        "1 egg",
        "1 teaspoon water",
        "1/4 cup sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Whole Wheat Challah",
    "url": "http://allrecipes.com/recipe/188034/honey-whole-wheat-challah/"
}
