{
    "directions": [
        "Pound skirt steak briefly on each side with the textured side of a meat mallet.",
        "Cut a piece of parchment twice as long as the skirt steak; place steak on top half of the paper. Rub top of steak with 1 teaspoon salt and 1/2 teaspoon black pepper; drizzle 1 tablespoon honey in an S-shaped line down the top of the steak.",
        "Fold bottom of the parchment paper up over the steak; flip steak over and peel the parchment paper from the unseasoned side of steak. Repeat seasoning with remaining 1 teaspoon salt, 1/2 teaspoon black pepper, and 1 more tablespoon honey.",
        "Fold  parchment paper tightly around  steak, folding the edges over several times so honey can't leak out. Place wrapped steak in a resealable plastic bag. Refrigerate 8 hours to overnight.",
        "Preheat outdoor grill for high heat and lightly oil the grate.",
        "Lay steak on the hot grill; grill for 1 minute, then use tongs to flip steak and move to another area of the hot  grate. Continue flipping and moving the steak at 1-minute intervals until the steak is very well seared on both sides, 4 to 5 minutes in all. Inside of meat should still be pink.",
        "Remove steak and wrap in aluminum foil; let rest 5 to 10 minutes before cutting the steak diagonally across the grain into 1/2-inch strips.",
        "Mix horseradish, mayonnaise, and Worcestershire sauce in a bowl; serve as dipping sauce with steak."
    ],
    "ingredients": [
        "1 (1/2 pound) trimmed beef skirt steak",
        "2 teaspoons salt, divided",
        "1 teaspoon ground black pepper, divided",
        "2 tablespoons honey, or to taste - divided",
        "2 tablespoons prepared horseradish",
        "2 tablespoons mayonnaise",
        "1/2 teaspoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Skirt Steak Appetizer with Horsey Sauce",
    "url": "http://allrecipes.com/recipe/221052/honey-skirt-steak-appetizer-with-hors/"
}
