{
    "directions": [
        "Pulse garlic, parsley, fennel seeds, and 1/2 cup fennel fronds in a food processor until very finely chopped. With motor running, slowly add 1/4 cup oil and process until smooth; season generously with salt and pepper (mixture should taste quite salty as this is the only seasoning meat will get). Rub parsley mixture all over lamb. Transfer to a roasting pan, cover, and chill at least 8 hours.",
        "Let lamb sit at room temperature 1 hour. Bring vinegar and honey to a boil in a small saucepan. Reduce heat and simmer, stirring occasionally, until slightly thickened, 8–10 minutes. Set glaze aside.",
        "Place racks in lower third and middle of oven and preheat to 325°F. Toss fennel and carrots with remaining 1/4 cup oil in a medium bowl and arrange half around lamb in roasting pan; place remaining vegetables on a rimmed baking sheet.",
        "Roast vegetables on baking sheet on lower rack and lamb on middle rack until an instant-read thermometer inserted into the thickest part of lamb registers 100°F, about 1 hour.",
        "Increase oven to 450°F, brush roast with glaze, and continue to roast until an instant-read thermometer registers 120°F, 20–25 minutes longer. Transfer lamb to a cutting board and let rest 30 minutes before carving (temperature will rise to 140°F for medium-rare while lamb is resting).",
        "Continue to roast vegetables, tossing occasionally, until golden and tender, 20–25 minutes longer.",
        "Serve lamb with vegetables, topped with fennel fronds.",
        "DO AHEAD: Lamb can be rubbed with parsley mixture and vegetables can be prepped 1 day ahead. Cover separately and chill."
    ],
    "ingredients": [
        "2 garlic cloves, chopped",
        "1 cup fresh flat-leaf parsley leaves",
        "1 tablespoon fennel seeds, crushed",
        "1/2 cup fennel fronds plus more for serving",
        "1/2 cup olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 7–9 pound bone-in leg of lamb, tied",
        "1/2 cup red wine vinegar",
        "1/3 cup honey",
        "4 fennel bulbs, sliced 1/2\" thick",
        "16 small carrots (about 2 pounds), unpeeled, halved lengthwise if large"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Christmas",
        "Easter",
        "Dinner",
        "Vinegar",
        "Fennel",
        "Carrot",
        "Fall",
        "Winter",
        "Honey",
        "Christmas Eve",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Honey-Vinegar Leg of Lamb with Fennel and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/honey-vinegar-leg-of-lamb-with-fennel-and-carrots-51193690"
}
