{
    "directions": [
        "Put oven rack in middle position and preheat to 425°F.",
        "Finely grate enough zest from 1 lemon to measure 1 tablespoon, then squeeze enough juice from same lemon to measure 2 tablespoons.",
        "Stir together butter, tarragon, zest, 1/2 teaspoon salt, and pepper.",
        "Put chicken, breast side up, in a small roasting pan. Starting from neck cavity, work your fingers gently between skin and flesh of breast to loosen skin all the way to thighs without tearing. Put one fourth of tarragon butter under skin of each breast, then rub skin from outside to spread evenly.",
        "Starting from large cavity, loosen skin on both sides of cavity with a paring knife (to provide access to thighs), then work your fingers gently between skin and flesh of thighs and drumsticks. Divide remaining tarragon butter among thighs and drumsticks, rubbing skin from outside to spread evenly. Season cavity and skin with salt and pepper, then halve remaining lemon and put inside cavity along with garlic. Tie drumsticks together with kitchen string.",
        "Whisk together honey, lemon juice, oil, and remaining 1/4 teaspoon salt. Roast chicken 30 minutes, then brush pan juices and half of honey mixture over chicken and roast 10 minutes more. Brush chicken again with pan juices and remaining honey mixture and continue to roast until thermometer inserted in fleshy part of a thigh (do not touch bone) registers 170°F, about 20 minutes more.",
        "Transfer chicken to a cutting board and let stand 10 to 15 minutes before carving. Skim fat from pan juices and serve juices with chicken."
    ],
    "ingredients": [
        "2 lemons",
        "2 tablespoons unsalted butter, softened",
        "2 tablespoons finely chopped fresh tarragon",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 (3 1/2-lb) chicken, rinsed and patted dry",
        "1 head garlic, left unpeeled and halved horizontally",
        "1/4 cup mild honey",
        "1 tablespoon olive oil",
        "Special equipment: kitchen string; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Roast",
        "Kid-Friendly",
        "Back to School",
        "Lemon",
        "Fall",
        "Anniversary",
        "Honey",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Honey-Roasted Chicken with Lemon and Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/honey-roasted-chicken-with-lemon-and-tarragon-108489"
}
