{
    "directions": [
        "Combine chicken stock, apple cider, honey, and salt in a large bowl; stir until honey is dissolved. Add 1/2 of the thyme, 1/2 of the sage, garlic, and black pepper; stir. Add water and stir until brine is evenly combined.",
        "Place turkey in a food-safe cooking bag and pour brine over turkey. Inject the meaty parts of turkey with brine using an injector. Gather bag tightly around turkey so that brine completely surrounds turkey, adding more water if needed. Seal bag, place in a large pot, and refrigerate, 24 to 48 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Place a rack in a large 2 1/2-inch deep roasting pan.",
        "Remove turkey from brine and pat dry inside and out. Reserve about 1/2 of the brine. Place turkey in a fresh oven-safe baking bag, breast-side down and place on the rack.",
        "Squeeze oranges and lemons into the main cavity of the turkey. Place squeezed oranges and lemons, remaining thyme, and remaining sage in the cavity. Lightly coat turkey with olive oil and season with salt and black pepper. Insert an oven-safe thermometer in the thickest part of the thigh without touching the bone.",
        "Bake in the preheated oven, basting with brine every 30 minutes, for 2 1/2 hours. Flip turkey and continue baking until no longer pink at the bone and the juices run clear, 1 to 1 1/2 hours more. The thermometer should read 180 degrees F (82 degrees C). Allow turkey to rest 15 to 20 minutes before slicing."
    ],
    "ingredients": [
        "1 (32 fluid ounce) container chicken stock",
        "3 cups apple cider",
        "2 cups honey",
        "2 cups kosher salt",
        "2 bunches fresh thyme, divided",
        "1 bunch fresh sage, divided",
        "10 cloves garlic, peeled, or more to taste",
        "1 tablespoon coarsely ground black pepper, or more to taste",
        "4 cups water, or more if needed",
        "1 (20 pound) whole turkey, neck and giblets removed",
        "2 oranges, halved",
        "2 lemons, halved, or more to taste",
        "2 teaspoons olive oil, or more as needed",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Apple Brined Turkey",
    "url": "http://allrecipes.com/recipe/240072/honey-apple-brined-turkey/"
}
