{
    "directions": [
        "Generously season the brisket on both sides with salt and pepper. In the stovetop-safe insert of a slow cooker or in a roasting pan over medium-high heat, warm 1 Tbs. of the oil until smoking. Add the brisket and brown on all sides, about 10 minutes total. Transfer to a baking sheet.",
        "Warm the remaining 1 Tbs. oil in the insert or roasting pan, add the onions and cook, stirring occasionally, until browned on both sides, about 6 minutes. Transfer to a bowl.",
        "Reduce the heat to medium, add the garlic, tomato paste, paprika, cinnamon, demi-glace, bay leaf and thyme and cook, stirring constantly, for 1 minute. Increase the heat to medium-high, add the wine and boil for 5 minutes. Add the stock, honey, the 2 tsp. salt and the 1/4 tsp. pepper and bring to a simmer.",
        "If using the insert, return the brisket, fat side up, to the insert and nestle the onions and carrots around and on top of it. Transfer the insert to the slow-cooker base. If using the roasting pan, transfer the brisket, fat side up, to a slow cooker and add the contents of the roasting pan; nestle the onions and carrots around and on top of the brisket.",
        "Cover and cook on high according to the manufacturer’s instructions until the brisket is fork-tender, about 8 hours. Skim the fat off the sauce and remove and discard the bay leaf. Taste the sauce and adjust the seasonings with salt and pepper.",
        "Transfer the brisket to a cutting board and cut across the grain into slices. Transfer to a large platter and spoon the vegetables over and around the meat. Drizzle some of the sauce over the meat. Pour the remaining sauce into another bowl and pass at the table. Garnish the platter with fresh bay leaves. Serves 10.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1 flat-cut beef brisket, 4 1/2 to 5 lb.",
        "Kosher salt, to taste, plus 2 tsp.",
        "Freshly ground pepper, to taste, plus 1/4 tsp.",
        "2 Tbs. vegetable oil",
        "2 lb. cipollini onions, peeled",
        "1 Tbs. minced garlic",
        "1 Tbs. tomato paste",
        "2 Tbs. Hungarian paprika",
        "1 tsp. ground cinnamon",
        "1 Tbs. beef demi-glace",
        "1 dried bay leaf",
        "2 tsp. chopped fresh thyme",
        "1 cup red wine",
        "2 cups beef stock",
        "1/4 cup honey",
        "12 oz. carrots, peeled and cut into large chunks",
        "Fresh bay leaves for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Honey-Braised Beef Brisket",
    "url": "http://www.williams-sonoma.com/recipe/honey-braised-beef-brisket.html"
}
