{
    "directions": [
        "Preheat oven to 350°F. Whisk both flours and salt in medium bowl. Using electric mixer, beat butter, brown sugar, honey, and lemon peel in another medium bowl to blend. Beat in egg. Add flour mixture; beat just to blend. Gather dough into ball. Roll out on floured surface to 1/4-inch-thick round. Transfer to 9-inch-diameter tart pan with removable bottom. Press onto bottom and up sides of pan. Trim edges. Press edges so sides rise 1/4 inch above pan. Bake crust until golden brown, pressing with back of fork if bubbles form, about 13 minutes. Cool on rack.",
        "Preheat oven to 350°F. Bring both sugars, butter, and honey to boil in heavy medium saucepan, stirring to dissolve sugars. Boil 1 minute without stirring; remove from heat. Stir in cherries, apricots, almonds, cranberries, and whipping cream. Transfer filling to cooled crust. Arrange apricot halves, cut side down, atop filling.",
        "Bake tart until bubbling all over, about 1 hour 20 minutes. Cool on rack 15 minutes. Remove pan sides. Cool to lukewarm, about 1 hour.",
        "Using electric mixer, beat cream until peaks form. Add crème fraîche and beat until peaks form. Serve tart slightly warm or at room temperature with crème fraîche."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 cup semolina flour (pasta flour)*",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/3 cup (packed) golden brown sugar",
        "2 tablespoons honey",
        "1 teaspoon finely grated lemon peel",
        "1 large egg",
        "3/4 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/4 cup honey",
        "1/2 cup dried cherries",
        "1/2 cup coarsely chopped dried apricots",
        "1/2 cup whole almonds, toasted, coarsely chopped",
        "1/4 cup dried cranberries",
        "1/4 cup whipping cream",
        "1 (15-ounce) can apricot halves, drained, patted dry",
        "1 cup chilled whipping cream",
        "1 cup crème fraîche",
        "*Available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Apple",
        "Apricot",
        "Almond",
        "Fall",
        "Winter"
    ],
    "title": "Honey-Caramel Tart with Apricots and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/honey-caramel-tart-with-apricots-and-almonds-237924"
}
