{
    "directions": [
        "Blend crêpe ingredients in a blender. Chill batter while preparing pineapple.",
        "Heat butter in a 12-inch nonstick skillet over moderately high heat until foam subsides, then sauté pineapple until golden, about 5 minutes. Transfer pineapple to a bowl with a slotted spoon. Add ginger to skillet and sauté, stirring, 30 seconds. Add honey and juice and simmer until mixture is syrupy, 3 to 5 minutes.",
        "While honey mixture is reducing, brush a 10-inch nonstick skillet with oil and heat over moderately high heat until hot but not smoking. Holding skillet off heat, pour in 1/4 cup batter, immediately swirling and tilting skillet to create a thin, even layer. Return skillet to heat and cook until crêpe is golden around edges and dry in center, about 45 seconds. Flip crêpe carefully and cook until golden, about 15 seconds. Transfer to a platter and keep warm, covered. Make more crêpes in same manner.",
        "Add pineapple to honey mixture and simmer, stirring, until heated through. Spoon about \u0089 cup pineapple mixture over half of 1 crêpe, then fold in half. Repeat with remaining crêpes. Pour remaining pineapple mixture over folded crêpes."
    ],
    "ingredients": [
        "1/2 cup whole milk",
        "1 large egg",
        "1/2 cup all-purpose flour",
        "2 tablespoons unsalted butter, melted",
        "1 tablespoon confectioners sugar",
        "1 tablespoon unsalted butter",
        "20-oz can unsweetened pineapple chunks, drained well",
        "1 1/2 teaspoons minced peeled fresh ginger",
        "1/4 cup honey",
        "1/3 cup fresh orange juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Quick & Easy",
        "Pineapple",
        "Honey",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Ginger Pineapple Crêpes",
    "url": "http://www.epicurious.com/recipes/food/views/honey-ginger-pineapple-crepes-103208"
}
