{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "In a food processor or blender, crush the gingersnaps with the 2 tablespoons sugar. Add the egg white and process long enough to moisten the mixture. Press the crumbs into the bottom and up the sides of an 8- or 9-inch springform pan to form a thin layer.",
        "If the crumbs are too sticky, use a sheet of waxed paper between the crust and your fingers to press the crumbs into place. Bake until the crust is brown and firm to the touch, 10 to 12 minutes. Remove from the oven. If the crust slides down the side of the pan, use a rubber spatula or the back of a spoon to press it in place.",
        "Reduce oven heat to 300 degrees F (150 degrees C).  Fill an oven-proof dish with about 1 inch of warm water and place it at the back of the oven to provide steam for the cheesecake while it bakes.",
        "Clean the food processor or blender. Add the cream cheese, cottage cheese, ricotta cheese and cornstarch.  Blend until the mixture is smooth. Add the honey, vanilla and blend again. Add the egg substitute, blending until the mixture is smooth and even colored. Pour into the prepared crust.",
        "Bake 20 minutes on the lower rack of the oven. Reduce oven temperature to 250 degrees F (120 degrees C) and bake 60 minutes longer or until the sides are set and the center is fluid but not sloshing.",
        "Turn off the oven and allow the cake to cool 1 hour in the oven. Remove and cool to room temperature. Chill covered overnight before slicing. The cake will continue to set in the refrigerator so don't worry if the center doesn't appear to be firm when you remove it from the oven.",
        "If desired, serve the cheesecake with a sauce made from thawed frozen strawberries or raspberries.  Place the berries in a food processor or blender and puree until smooth.  Add sugar (or sugar substitute) to taste, if desired."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "32 gingersnap cookies, crushed",
        "2 tablespoons white sugar",
        "1 egg white",
        "1 (3 ounce) package Neufchatel cheese",
        "1 cup part-skim ricotta cheese",
        "2 tablespoons cornstarch",
        "1 cup honey",
        "1 tablespoon vanilla extract",
        "1 cup egg substitute",
        "1 (16 ounce) container low-fat cottage cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Vanilla Cheesecake with Gingersnap Crust",
    "url": "http://allrecipes.com/recipe/7933/honey-vanilla-cheesecake-with-gingers/"
}