{
    "directions": [
        "Combine hot water and salt in a 54-quart cooler; stir until salt dissolves. Stir vegetable broth and honey into the water. Add ice and stir. Place the turkey in the brine with the breast facing up; cover with cooler lid. Brine overnight to 12 hours.",
        "Remove the turkey from the brine and pat dry with paper towel; rub vegetable oil over turkey to coat. Discard brine.",
        "Put 1 cup wood chips in the center of each of two large sheets of aluminum foil. Wrap edges around wood chips to form small pouches, leaving small openings at the top.",
        "Preheat an outdoor grill to 400 degrees F (200 degrees C) and lightly oil the grate. Place 1 pouch of wood chips directly over the flame beneath the grate.",
        "Set the turkey over indirect heat, insert a probe thermometer into the thickest part of the breast, and set the alarm for 160 degrees F (70 degrees C). Close the lid and cook until the turkey's skin is golden brown, about 1 hour. Remove and discard first pouch of wood chips; replace with remaining pouch.",
        "Cover turkey with aluminum foil, return cover to grill and continue cooking until the turkey is no longer pink at the bone and the juices run clear, about 3 hours more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C).",
        "Remove the turkey from the grill, cover with aluminum foil, and allow to rest in a warm area for 1 hour before carving to serve."
    ],
    "ingredients": [
        "1 gallon hot water",
        "1 pound kosher salt",
        "2 quarts vegetable broth",
        "1 pound honey",
        "1 (7 pound) bag of ice cubes",
        "1 (15 to 20) pound turkey, giblets removed",
        "1/4 cup vegetable oil, or as needed",
        "1 cup wood chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Brined Smoked Turkey",
    "url": "http://allrecipes.com/recipe/229236/honey-brined-smoked-turkey/"
}
