{
    "directions": [
        "Preheat oven to 350°F with racks in upper and lower thirds.",
        "Cut 2 sheets of parchment paper to line bottom of a large 4-sided sheet pan (17 by 13 by 1 inch).",
        "Pulse together flour, walnuts, granulated sugar, baking soda, and salt in a food processor until nuts are finely ground. Add butter and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps.",
        "Whisk together honey, egg, and vanilla, then add to flour mixture and pulse just until dough comes together. (Dough will be soft.)",
        "Transfer dough to 1 sheet of trimmed parchment (not in pan) and cover with second sheet. Roll over with a rolling pin to spread dough evenly between sheets into a roughly 15- by 11-inch rectangle.",
        "Transfer dough in parchment to pan and remove top sheet.",
        "Using wet offset spatula, spread dough into corners of pan to cover parchment completely. Holding a paring knife sideways, drag tip over dough at roughly 1/2-inch intervals to create lines resembling those on tree bark.",
        "Sprinkle dough evenly with turbinado sugar. Bake in upper third of oven until set and dry to the touch, 20 to 25 minutes. Cool in pan on a rack 5 minutes.",
        "Reduce oven temperature to 300°F.",
        "Run a knife around edge of pan, then invert bark onto a work surface. Discard parchment.",
        "Fold bark in half lengthwise so that it breaks with uneven edges. Repeat with each piece. Tear each strip crosswise into 6 pieces.",
        "Divide biscuits, sugar sides up, between 2 baking sheets (biscuits may touch). Bake, switching position of pans halfway through baking, until deep golden brown, 15 to 25 minutes. (Biscuits will crisp completely as they cool.) Transfer to racks to cool."
    ],
    "ingredients": [
        "1 3/4 cups all-purpose flour",
        "1 cup walnut pieces",
        "3 tablespoons granulated sugar",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 stick unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup honey",
        "1 large egg",
        "1/2 teaspoon pure vanilla extract",
        "2 tablespoons turbinado sugar such as Sugar in the Raw",
        "a large offset spatula",
        "blueberries in gin syrup",
        "3/4 pound triple-crème cheese such as St. André"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Back to School",
        "Walnut",
        "Family Reunion",
        "Engagement Party",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey \"Tree Bark\" Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/honey-tree-bark-biscuits-243193"
}
