{
    "directions": [
        "Preheat oven to 350°F. Wrap outside of 10-inch-diameter springform pan with 2 1/2-inch-high sides with foil. Bring butter and honey to boil in heavy small saucepan, stirring occasionally. Remove from heat. Finely grind vanilla wafers in processor. Add nuts and salt to processor. Add butter mixture and process until nuts are finely chopped. Press mixture onto bottom and 1 inch up sides of prepared pan. Bake crust until golden, about 12 minutes. Transfer to rack and cool. Reduce over temperature to 325°F.",
        "Using electric mixer, beat cream cheese and ricotta cheese in large bowl until smooth. Mix in sugar and honey. Add eggs 1 at a time, beating well after each addition. Mix in vanilla and lemon extracts. Pour filling into crust.",
        "Bake pie until puffed, golden and center moves only slightly when pan is gently shaken, about 1 hour 10 minutes. Transfer to rack and cool completely. (Can be prepared 1 day ahead. Cover and chill.)",
        "Mix quartered strawberries and 1/3 cup honey in large bowl. (Can be made 4 hours ahead. Cover; chill.)",
        "Run small sharp knife around sides of pan to loosen pie. Release pan sides. Drizzle additional honey over pie in zigzag pattern. Transfer pie to serving platter. Using slotted spoon, transfer some of strawberry compote to top of pie, if desired.",
        "Garnish pie with strawberry blossoms, if desired. Cut pie into wedges and serve with remaining strawberry compote."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "2 tablespoons honey",
        "35 vanilla wafer cookies",
        "3/4 cup whole almonds",
        "3/4 cup walnuts",
        "1/4 teaspoon salt",
        "2 8-ounce packages cream cheese, room temperature",
        "1 15- to 16-ounce container whole milk ricotta cheese",
        "1/2 cup plus 1 tablespoon sugar",
        "1/2 cup plus 1 tablespoon honey",
        "4 extra-large eggs",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon lemon extract",
        "3 12-ounce baskets small strawberries, hulled, quartered",
        "1/3 cup honey",
        "Additional honey",
        "Strawberry blossoms or other small nonpoisonous flowers (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Strawberry",
        "Walnut",
        "Honey"
    ],
    "title": "Honey-Cheese Pie with Strawberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/honey-cheese-pie-with-strawberry-compote-1705"
}
