{
    "directions": [
        "Preheat the grill over medium-high direct heat. Oil the grill grates. Finely chop the cilantro and scallion and mix in the oil and ginger. Season with salt and pepper.",
        "Cut two 3-inch long slits through the skin lengthwise on the bottom of the salmon fillets, going about halfway into the salmon. Evenly stuff the slits with the herb mixture. Season the fish with salt and pepper.",
        "Stir together the lime juice, soy and honey until smooth. Place the salmon, skin side up, on the grill and cook until well marked, 3 to 4 minutes. Turn the salmon and continue to cook, brushing the tops with the sauce, until the fish is cooked through, about another 3 to 4 minutes. Transfer to a serving plate and sprinkle the tops with the sesame seeds. Serve with edamame and lime wedges.",
        "Broiler directions: Position an oven rack so that a baking sheet set on the rack is about 4-inches below the heat source. Preheat the broiler. Prepare the salmon as above and place the fillets, skin down, on a foil lined baking sheet coated with cooking spray. Broil, basting 3 to 4 times with the sauce, until just cooked through, about 6 to 7 minutes."
    ],
    "ingredients": [
        "1/4 cup packed cilantro leaves",
        "2 scallions",
        "2 teaspoons vegetable oil",
        "1 teaspoon grated ginger",
        "Kosher salt and freshly ground pepper",
        "4 center cut skin-on wild salmon fillets, about 6 ounces each",
        "2 teaspoons fresh lime juice",
        "2 teaspoons low-sodium soy sauce",
        "2 teaspoons honey",
        "1/4 teaspoon black sesame seeds",
        "1 1/3 cups cooked edamame",
        "Lime wedges, optional garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Grilling Recipes",
        "Grilling",
        "Healthy Grilling Recipes",
        "Healthy",
        "Grilled Salmon",
        "Fish",
        "Salmon",
        "Beans and Legumes",
        "Edamame Recipes"
    ],
    "title": "Honey Soy Grilled Salmon with Edamame",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/honey-soy-grilled-salmon-with-edamame-recipe"
}
