{
    "directions": [
        "Preheat oven to 350°F. Heat oil in heavy large pot over high heat. Sprinkle ribs with salt and pepper. Working in batches, brown ribs, turning occasionally, about 10 minutes. Return all ribs to pot. Add carrots, onion, celery and garlic to ribs; cook 5 minutes, stirring occasionally. Add honey; cook 2 minutes, stirring occasionally. Add vinegar and boil until most of liquid is absorbed, stirring occasionally, about 8 minutes. Add broth, red wine, Port, thyme and bay leaf and boil 5 minutes. Cover; transfer to oven. Bake until meat almost falls off bone, stirring occasionally, about 2§ hours.",
        "Using tongs, transfer ribs to large bowl. Boil cooking liquid until slightly reduced, stirring occasionally, about 10 minutes. Season with salt and pepper. Mix 1 tablespoon butter and flour in small bowl. Add to sauce; whisk to blend. Boil until thickened, 3 minutes. Mix in ribs. (Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and chill. Rewarm over medium heat before continuing.) Melt 2 tablespoons butter in another large pot over medium-high heat. Add spinach; cook until just wilted, stirring occasionally, 3 minutes. Season with salt and pepper. Divide spinach among plates. Top with ribs and sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "4 1/2 pounds beef short ribs",
        "1 cup chopped carrots",
        "1 cup chopped onion",
        "1 cup chopped celery",
        "8 garlic cloves, chopped",
        "1/4 cup honey",
        "1/2 cup red wine vinegar",
        "4 cups canned low-salt chicken broth",
        "1 750-ml bottle dry red wine",
        "1/2 cup ruby Port",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 bay leaf",
        "3 tablespoons butter, room temperature",
        "1 tablespoon all purpose flour",
        "2 6-ounce packages baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Leafy Green",
        "Onion",
        "Vegetable",
        "Bake",
        "Braise",
        "Beef Rib",
        "Celery",
        "Carrot",
        "Winter"
    ],
    "title": "Honey and Vinegar-Braised Short Ribs with Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/honey-and-vinegar-braised-short-ribs-with-spinach-102858"
}
