{
    "directions": [
        "Line extra-large stockpot with heavy large plastic bag (about 30-gallon capacity). Rinse turkey; place in plastic bag. Stir 8 quarts water, 2 cups coarse salt and 1 cup honey in large pot until salt and honey dissolve. Add 1 bunch fresh thyme, peeled garlic cloves and black pepper. Pour brine over turkey. Gather plastic bag tightly around turkey so that bird is covered with brine; seal plastic bag. Refrigerate pot with turkey in brine at least 12 hours and up to 18 hours.",
        "Position rack in bottom third of oven and preheat to 350°F. Drain turkey well; discard brine. Pat turkey dry inside and out. Squeeze juice from lemon halves into main cavity. Add lemon rinds and remaining 1 bunch fresh thyme to main cavity. Tuck wings under turkey; tie legs together loosely to hold shape. Place turkey on rack set in large roasting pan. Rub turkey all over with 2 tablespoons olive oil.",
        "Roast turkey 1 hour. Baste turkey with 1 cup chicken broth. Continue to roast until turkey is deep brown and thermometer inserted into thickest part of thigh registers 180°F, basting with 1 cup chicken broth every 30 minutes and covering loosely with foil if turkey is browning too quickly, about 2 1/2 hours longer. Transfer turkey to platter. Tent turkey loosely with foil and let stand 30 minutes. Pour pan juices into large glass measuring cup. Spoon off fat; reserve juices.",
        "While turkey cooks, place reserved turkey neck, heart and gizzard into large saucepan. Add 6 cups water, 3 1/2 cups chicken broth, carrots, onion, celery and bay leaf. Simmer over medium heat until turkey stock is reduced to 3 cups, about 2 hours. Strain turkey stock into bowl; reserve turkey neck and giblets. Pull meat off neck. Chop neck meat and giblets.",
        "Melt 5 tablespoons butter in heavy large saucepan over medium heat. Add 5 tablespoons all purpose flour and whisk 2 minutes. Gradually whisk in turkey stock, cream and up to 1 cup reserved turkey pan juices (juices are salty, so add according to taste). Simmer gravy until thickened to desired consistency, whisking occasionally, about 5 minutes. Add chopped turkey neck meat and giblets; season to taste with pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 19- to 20-pound turkey; neck, heart and gizzard reserved for gravy",
        "8 quarts water",
        "2 cups coarse salt",
        "1 cup honey",
        "2 bunches fresh thyme",
        "8 large garlic cloves, peeled",
        "2 tablespoons coarsely cracked black pepper",
        "2 lemons, halved",
        "2 tablespoons olive oil",
        "5 cups (about) canned low-salt chicken broth",
        "Reserved turkey neck, heart and gizzard",
        "6 cups water",
        "3 1/2 cups canned low-salt chicken broth",
        "2 carrots, coarsely chopped",
        "1 onion, halved",
        "1 large celery stalk, chopped",
        "1 small bay leaf",
        "5 tablespoons butter",
        "5 tablespoons all purpose flour",
        "1/4 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Brine"
    ],
    "title": "Honey-Brined Turkey with Giblet Cream Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/honey-brined-turkey-with-giblet-cream-gravy-102478"
}
