{
    "directions": [
        "1. In a small saucepan, bring the port to a simmer over medium-high heat. Add the figs to the pan, remove from the heat, and let the figs rehydrate while you prepare the rest of the dish.",
        "2. In a medium saucepan, heat the olive oil over medium heat. Add the shallots and sauté until softened, about 5 minutes. Add the quinoa, pistachios, and chicken stock or broth. Strain the figs from the port, reserving the port. Add the figs to the quinoa mixture and bring to a simmer over medium heat. Reduce the heat to low and simmer, covered, until the liquid has been absorbed and the quinoa is tender, 18 to 20 minutes. Turn off the heat and let the quinoa sit for 5 minutes. Fluff with a fork, cover, and leave on the burner to keep warm.",
        "3. Preheat the oven to 350°F. With a sharp knife, score the fat on the duck breasts in a crisscross pattern, making cuts about 1 inch apart. Place the honey in a small bowl and stir in the hot sauce, if using, and 1 teaspoon of the reserved port. Season both sides of the duck with salt and pepper.",
        "4. Heat a large ovenproof skillet over medium-high heat. Add the duck breasts skin-side down and cook undisturbed until the fat is mostly rendered, leaving a crispy crust, about 7 minutes. Use a spoon or a baster to remove all but 1 to 2 tablespoons of the duck fat. With a spatula or a pair of tongs, turn the breasts over and brush the skin side with the honey mixture.",
        "5. Transfer the pan to the oven and cook 5 to 7 minutes, or to desired level of doneness. For safety, the meat should have an internal temperature of 165°F when checked with a meat thermometer. Let the duck rest for 5 minutes to allow the juices to redistribute, then transfer to a cutting board and thinly slice each breast on the diagonal.",
        "6. To serve, stir the thyme into the quinoa mixture. Divide the quinoa among four plates and fan the slices of duck breast over it. Drizzle with the remaining port-honey sauce if desired. Serve immediately."
    ],
    "ingredients": [
        "1 cup ruby port",
        "1 cup quartered dried Black Mission figs",
        "2 teaspoons extra-virgin olive oil",
        "2 shallots, minced",
        "1 cup red quinoa, rinsed",
        "1 cup shelled unsalted pistachios",
        "2 cups chicken stock or broth",
        "4 duck breasts (about 6 ounces each)",
        "2 tablespoons honey",
        "1/2 teaspoon hot sauce, such as Sriracha (optional)",
        "1 tablespoon fresh thyme leaves",
        "kosher salt and black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Fruit",
        "Nut",
        "Poultry",
        "Sauté",
        "Dinner",
        "Condiment",
        "Dried Fruit",
        "Fig",
        "Pistachio",
        "Quinoa",
        "Fall",
        "Honey",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Glazed Duck with Fig and Pistachio Red Quinoa",
    "url": "http://www.epicurious.com/recipes/food/views/honey-glazed-duck-with-fig-and-pistachio-red-quinoa-51125200"
}
