{
    "directions": [
        "Preheat oven to 400°F. Roll out tart crust dough on floured work surface to 13-inch round. Slide 10-inch diameter tart pan bottom or bottom of 10-inch diameter springform pan under dough. Mix 2 tablespoons sugar and flour in small bowl. Sprinkle over tart crust, leaving 2-inch border. Arrange sliced peaches in concentric circles atop sugar mixture in crust, leaving 2-inch border. Drizzle peaches with honey. Gently fold pastry edges up around peaches. Brush edges of crust with melted butter. Sprinkle crust and peaches with 1 tablespoon sugar. Place tart (on tart pan bottom) on heavy large baking sheet with rim. Bake tart until crust is golden and peaches are tender, about 35 minutes. Transfer baking sheet to rack. Using pastry brush, brush any juices from center of tart over peaches and crust. Cool tart 20 minutes.",
        "Mix flour, powdered sugar and salt in processor. Add butter; process until mixture resembles coarse meal. Mix egg yolks and water in small bowl. Add to flour mixture and process until moist clumps form. Gather dough into ball; flatten into disk for round tart or into square for rectangular tart. Wrap in plastic and refrigerate 1 hour. (Can be prepared 3 days ahead. Keep refrigerated. Let dough soften briefly at room temperature before rolling out.)"
    ],
    "ingredients": [
        "3 tablespoons sugar",
        "2 tablespoon all purpose flour",
        "1 1/4 pounds fresh ripe peaches, (about 5 medium), halved, pitted, thinly sliced",
        "2 tablespoons honey",
        "2 tablespoons (1/4 stick) unsalted butter, melted, cooled",
        "Vanilla ice cream",
        "(Makes one 9-inch crust)",
        "1 1/4 cups all purpose flour",
        "1/3 cup powdered sugar",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces",
        "2 large egg yolks",
        "1 tablespoon cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Vanilla",
        "Summer",
        "Honey"
    ],
    "title": "Honey-Peach Tart with Vanilla Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/honey-peach-tart-with-vanilla-ice-cream-2300"
}
