{
    "directions": [
        "Place the water, sugar, butter, honey, bread flour, whole wheat flour, vital wheat gluten, cocoa powder, instant coffee granules, salt, and yeast into the pan of a bread machine in the order recommended by the manufacturer. Set the machine for the dough setting, start, and allow machine to complete cycle.",
        "Remove the bread pan with dough from the machine, and set pan into warm water (about 90 degrees F, 32 degrees C). Cover the top of the pan with a towel, and allow the bread to rise in the pan until doubled, about 1 hour.",
        "Turn the dough out onto a floured work surface, punch down, and divide into 12 equal pieces for rolls, or 3 pieces for small loaves. Form the dough into balls. Line a baking sheet with parchment paper, and place rolls on the prepared baking sheet. Sprinkle with sesame seeds. Place the baking sheet into a warm place, and allow to rise until bread is doubled, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Spray the inside of the preheated oven with water, and immediately place rolls in oven. Bake until rolls are light golden brown, 15 to 20 minutes. For loaves, bake until browned and they sound hollow when tapped, 20 to 25 minutes."
    ],
    "ingredients": [
        "1 1/2 cups warm water (75 to 85 degrees F, 25 to 30 degrees C)",
        "1 tablespoon white sugar",
        "2 tablespoons butter, softened",
        "1/2 cup honey",
        "2 cups bread flour",
        "1 2/3 cups whole wheat flour",
        "1 tablespoon vital wheat gluten (optional)",
        "1 tablespoon unsweetened cocoa powder",
        "2 teaspoons instant coffee granules",
        "1 teaspoon salt",
        "2 1/4 teaspoons bread machine yeast",
        "2 teaspoons sesame seeds for sprinkling (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Honey Brown Rolls or Loaves",
    "url": "http://allrecipes.com/recipe/219648/honey-brown-rolls-or-loaves/"
}
