{
    "directions": [
        "Preheat oven to 400°F. Brush madeleine mold with melted butter; dust with flour. Combine eggs, honey, 1/4 cup sugar and grated orange peel in bowl of electric mixer. Set over saucepan of simmering water (do not let bowl touch water); stir just until lukewarm, about 2 minutes. Remove from over water and beat with electric mixer until pale yellow and tripled in volume, about 12 minutes. Add orange flower water and vanilla extract. On low speed, gradually mix in flour, scraping bowl occasionally. Transfer 1/3 of batter to medium bowl. Gradually fold 3/4 cup melted butter into batter in medium bowl (do not fold in water at bottom of butter). Gently fold mixture into remaining batter (batter will thicken slightly).",
        "Spoon batter into madeleine mold, filling almost to top. Bake until cookies are springy to touch, turning pan half-way through cooking, about 10 minutes. Invert pan onto rack. Gently pry out cookies with knife tip. Sprinkle cookies with sugar. Wipe out molds, brush with melted butter, dust with flour and repeat with remaining batter. Cool completely on rack. (Can be prepared 1 day ahead. Store in airtight container at room temperature.)"
    ],
    "ingredients": [
        "Melted butter",
        "2 large eggs",
        "1/3 cup honey",
        "1/4 cup sugar",
        "1 1/2 teaspoons grated orange peel",
        "1/2 teaspoon orange flower water",
        "1/2 teaspoon vanilla extract",
        "1 cup all purpose flour",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted, room temperature",
        "Sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Orange",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Orange Madeleines",
    "url": "http://www.epicurious.com/recipes/food/views/honey-orange-madeleines-1807"
}
