{
    "directions": [
        "Combine 2 cups milk, whipping cream, vanilla bean, orange peel strips, ground cardamom and salt in heavy small saucepan. Cook milk mixture over medium heat until tiny bubbles appear around edge of saucepan. Remove from heat and let steep 20 minutes.",
        "Preheat oven to 325°F. Remove softened vanilla bean from milk mixture. Scrape seeds from vanilla bean into milk mixture; add bean. Heat milk mixture again until tiny bubbles appear around edge of saucepan. Remove saucepan from heat, add honey and stir until honey melts. Using fork, beat egg yolks and whole egg in medium bowl just until blended. Gradually mix hot milk mixture into egg mixture. Strain custard into large measuring cup with spout.",
        "Pour custard into four 1 1/4-cup soufflé dishes or custard cups. Set dishes in 13x9x2-inch baking pan. Add enough hot water to baking pan to come halfway up sides of dishes. Cover baking pan loosely with aluminum foil. Bake custards until knife inserted into center comes out clean, about 40 minutes. Transfer dishes to rack and cool completely. Cover custards and refrigerate until well chilled, about 4 hours. (Can be made 1 day ahead.",
        "Place sliced strawberries in medium bowl. Using small sharp knife, hold oranges over same bowl and cut between membranes to release segments, allowing juice and segments to fall into bowl. Squeeze orange membranes over same bowl to release any juice. Mix in 1 tablespoon honey and ground cardamom. (Compote can be prepared 2 hours ahead. Cover and refrigerate.)",
        "Place custards in dishes on plates. Top with compote and serve."
    ],
    "ingredients": [
        "2 cups milk (do not use low-fat or nonfat)",
        "1/4 cup whipping cream",
        "1 vanilla bean, split lengthwise",
        "2 2x1-inch orange peel strips (orange part only)",
        "1/4 teaspoon ground cardamom",
        "1/8 teaspoon salt",
        "1/3 cup honey",
        "4 large egg yolks",
        "1 whole large egg",
        "1 1-pint basket strawberries, hulled, sliced",
        "2 oranges, peel and white pith removed",
        "1 tablespoon honey",
        "1/4 teaspoon ground cardamom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Orange",
        "Spice",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Cardamom Custards with Strawberry-Orange Compote",
    "url": "http://www.epicurious.com/recipes/food/views/honey-cardamom-custards-with-strawberry-orange-compote-1580"
}
