{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Wrap the outside of a 9-inch springform pan with 2 3/4-inch-high sides with 2 layers of heavy-duty foil. Finely grind the biscotti in a food processor. Add the melted butter and process until the crumbs are moistened. Press the crumb mixture over the bottom (not the sides) of the prepared pan. Bake until the crust is golden, about 15 minutes. Cool the crust completely on a cooling rack.",
        "Blend the ricotta in a clean food processor until smooth. Add the cream cheese and sugar and blend well, stopping the machine occasionally and scraping down the sides of the work bowl. Blend in the honey and orange zest. Add the eggs and pulse just until blended.",
        "Pour the cheese mixture over the crust in the pan. Place the springform pan in a large roasting pan. Pour enough hot water into the roasting pan to come halfway up the sides of the springform pan. Bake until the cheesecake is golden and the center of the cake moves slightly when the pan is gently shaken, about 1 hour and 5 minutes (the cake will become firm when it is cold).",
        "Transfer the cake to a rack and cool 1 hour. Refrigerate until the cheesecake is cold, at least 8 hours and up to 2 days. Cut the cake into wedges and serve."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1 (12-ounce) container fresh whole milk ricotta, drained",
        "2 (8-ounce) packages cream cheese, room temperature",
        "3/4 cup sugar",
        "1/4 cup orange blossom or clover honey",
        "1 tablespoon orange zest",
        "4 large eggs",
        "8 ounces purchased biscotti"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "Food Processor",
        "Cheese",
        "Cream Cheese Recipes",
        "Honey Recipes",
        "Ricotta"
    ],
    "title": "Honey Ricotta Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/honey-ricotta-cheesecake-recipe"
}
