{
    "directions": [
        "Blend flour, sugar, and salt in processor. Using on/off turns, cut in butter until pea-size pieces form. With machine running, add enough ice water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic; refrigerate 1 hour.",
        "Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim overhang to 1 inch. Fold overhang in and press to form double-thick sides. Press inside edge of crust to push it 1/8 to 1/4 inch above top edge of pan. Pierce bottom of crust with fork. Refrigerate 1 hour.",
        "Preheat oven to 400°F. Bake tart crust until golden, piercing with fork if bubbles form, about 25 minutes. (Can be made 1 day ahead. Cool; wrap in plastic and store at room temperature.)",
        "Mix sugar, flour, and lemon peel in large bowl to blend. Add peaches and toss to coat. Pour into baked crust. Drizzle honey over peach mixture; dot with butter and sprinkle with almonds. Bake until peaches are tender and almonds are toasted, about 35 minutes. Brush fruit and almonds with peach preserves. Cool 15 minutes before serving. (Can be made 6 hours ahead. Store tart at room temperature.)",
        "Using electric mixer, beat cream, mascarpone, sugar, and vanilla in large bowl until peaks form. Slice tart into 6 wedges and serve with dollops of mascarpone cream.",
        "*Italian cream cheese available at Italian markets and many supermarkets."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons powdered sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 1/2 tablespoons (about) ice water",
        "1/4 cup sugar",
        "3 tablespoons all purpose flour",
        "2 teaspoons grated lemon peel",
        "6 ripe medium peaches, peeled, halved, pitted, cut into 1/2-inch-thick slices (about 4 cups)",
        "2 tablespoons honey",
        "2 tablespoons chilled unsalted butter, cut into small pieces",
        "2 tablespoons sliced almonds",
        "2 tablespoons peach preserves, melted",
        "1 cup chilled whipping cream",
        "6 tablespoons mascarpone cheese*",
        "2 tablespoons sugar",
        "1/4 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Backyard BBQ",
        "Peach",
        "Almond",
        "Summer",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey-Glazed Peach Tart with Mascarpone Cream",
    "url": "http://www.epicurious.com/recipes/food/views/honey-glazed-peach-tart-with-mascarpone-cream-108473"
}
