{
    "directions": [
        "Preheat oven to 350°F. Using electric mixer, beat cream cheese, 3 tablespoons honey and 1 tablespoon sugar in medium bowl until smooth. Mix in cream, egg, vanilla and orange peel. Spoon mixture into 9-inch glass pie dish. Bake until mixture is set, about 20 minutes. Transfer to rack and cool custard completely.",
        "Combine 3 tablespoons water, 2 tablespoon honey and 1 tablespoon sugar in small saucepan. Boil until syrup thickens slightly, about 5 minutes.",
        "Preheat oven to 375°F. Brush large baking sheet with 1 tablespoon melted butter. Combine 1/2 cup pistachios and 1 tablespoon sugar in small bowl. Arrange 1 phyllo sheet on work surface with long side parallel to edge of surface (cover remainder with plastic). Brush lower half of phyllo lengthwise with melted butter. Fold phyllo lengthwise in half. Brush phyllo with melted butter; sprinkle with about 1 tablespoon pistachio mixture. Divide custard into 8 equal portions. Spoon 1 portion custard onto phyllo near 1 short edge. Fold 1 corner of phyllo over custard; continue folding as for flag, forming triangle and enclosing filling completely. Repeat with remaining phyllo, butter, pistachio mixture and custard.",
        "Transfer pastries to prepared baking sheet. Brush with butter. Bake until golden, about 18 minutes. Brush with syrup. Sprinkle with additional chopped nuts. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 8-ounce package cream cheese, room temperature",
        "5 tablespoons honey",
        "3 tablespoons sugar",
        "1/4 cup whipping cream",
        "1 large egg",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon finely grated orange peel",
        "3 tablespoon water",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/2 cup unsalted pistachios, toasted, very finely chopped",
        "8 sheets fresh phyllo pastry or frozen, thawed",
        "Additional chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Pistachio",
        "Honey"
    ],
    "title": "Honey Custard in Phyllo Pastry",
    "url": "http://www.epicurious.com/recipes/food/views/honey-custard-in-phyllo-pastry-1070"
}
