{
    "directions": [
        "Using on/off turns, blend flour, butter, and salt in processor until mixture resembles coarse meal. Add 3 tablespoons ice water. Blend, using on/off turns, until moist clumps form, adding more ice water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour and up to 1 day. Preheat oven to 425°F. Roll out dough on lightly floured surface to 13-inch round. Transfer to 9-inch tart pan with removable bottom. Cut off all but 1/4 inch of overhang, leaving dough sides higher than pan sides. Freeze crust 15 minutes. Line crust with foil and dried beans. Bake until sides are set, about 20 minutes. Remove foil and beans. Bake crust until golden, piercing with fork if crust bubbles, about 15 minutes. Cool crust on rack. Reduce oven temperature to 325°F.",
        "Whisk yolks, 4 tablespoons sugar, honey, bourbon, vanilla, and salt in large bowl until thick. Beat in flour and baking soda, then dates and pecans. Whisk egg whites in medium bowl until soft peaks form. Add 2 tablespoons sugar; beat until stiff but not dry. Fold whites into date mixture in 3 additions. Spread filling in crust. Bake tart until filling is puffed, deep brown, and just set in center, about 40 minutes. Cool tart on rack at least 30 minutes. Serve warm or at room temperature with whipped cream. do ahead Tart can be made 1 day ahead. Cover and let stand at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups unbleached all purpose flour",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 teaspoon salt",
        "3 to 4 tablespoons ice water",
        "2 large eggs, separated",
        "6 tablespoons sugar, divided",
        "2 tablespoons honey",
        "1 tablespoon bourbon",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "2 tablespoons all purpose flour",
        "Pinch of baking soda",
        "1 cup chopped pitted Medjool dates",
        "2/3 cup coarsely chopped pecans",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Kentucky Derby",
        "Date",
        "Pecan",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Honey, Date, and Pecan Tart",
    "url": "http://www.epicurious.com/recipes/food/views/honey-date-and-pecan-tart-241628"
}
