{
    "directions": [
        "Preheat oven to 425°F. Cook farro in a large saucepan of boiling salted water until tender, 25–35 minutes. Drain; spread out on a rimmed baking sheet.",
        "Meanwhile, toss squash with 1 Tbsp. oil on another rimmed baking sheet; season with salt. Turn squash cut side down and roast until browned and tender, 20–30 minutes.",
        "Bring pine nuts and remaining 4 Tbsp. oil to a very gentle simmer in a small saucepan over medium, stirring occasionally. Reduce heat and cook at a very low simmer until nuts are light golden brown, about 5 minutes. Remove from heat and whisk in garlic and miso. Let cool (it will look a bit chunky and broken at this point). Add vinegar and 1 Tbsp. chives and whisk until dressing is smooth and emulsified; season with salt.",
        "Toss farro and a generous tablespoonful of dressing in a large bowl; season with salt.",
        "Toss radicchio and apple and 2 Tbsp. dressing in a medium bowl and toss to combine. Season salad with salt.",
        "Arrange farro on a platter; top with squash and salad. Drizzle remaining dressing over and top with more chives."
    ],
    "ingredients": [
        "3/4 cup whole grain or semipearled farro",
        "Kosher salt",
        "3 honeynut squash, halved, seeds removed, or 1 acorn squash, seeds removed, cut into thick wedges",
        "5 tablespoons olive oil, divided",
        "1/3 cup pine nuts",
        "1 garlic clove, chopped",
        "1 tablespoon white miso",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon thinly sliced chives, plus more for serving",
        "2 small heads of Treviso radicchio, outer leaves removed and halved, cores quartered",
        "1 Granny Smith or other tart apple, very thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Salad",
        "Dinner",
        "Grains",
        "Squash",
        "Butternut Squash",
        "Pine Nut",
        "Apple",
        "Radicchio",
        "Fall",
        "Winter"
    ],
    "title": "Honeynut Squash With Radicchio and Miso",
    "url": "http://www.epicurious.com/recipes/food/views/honeynut-squash-with-radicchio-and-miso"
}
