{
    "directions": [
        "In a re-sealable plastic bag add, 3 tablespoons soy sauce, ginger, garlic, chili garlic paste, 2 tablespoons cornstarch and mix thoroughly, then add chicken and marinate for 1 hour.",
        "In a medium stock pot boil water and cook chow mein noodles until al dente, remove and shock in ice bath, shake dry and toss with 2 tablespoons oil to keep from sticking.",
        "In a large saute pan or wok, heat 2 tablespoons oil to almost smoke point and add chicken, separating each peace upon entry. Cook until browned on all sides. Remove and hold warm.",
        "In same wok, add 2 tablespoons oil. Heat until almost the smoke point, then add the onions, bell peppers, carrots and celery., Saute for 2 minutes then add mushrooms, peas and bean sprouts. Cook for 1 minute, then add chicken saute for 1 minute, add hoisin, 3 tablespoons soy sauce and sesame oil, toss and remove.",
        "Heat a 12-inch nonstick saute pan, add 3 tablespoons oil, heat to almost smoke point, and add chilled chow mein noodles. Cook on one side until crispy light golden brown. Flip noodles and another 2 tablespoons of oil and cook other side. When done, remove and let drain on paper towels, while holding warm.",
        "Mix 2 tablespoons cornstarch and chicken stock, and deglaze hot wok with mixture and let reduce by one-third.",
        "Place noodles on a rimmed serving platter, top with chicken and vegetable saute, and pour chicken reduction over top. Garnish with green onions."
    ],
    "ingredients": [
        "1/4 cup soy sauce, divided",
        "2 tablespoons minced ginger",
        "1 tablespoons minced garlic",
        "2 tablespoons chili garlic paste",
        "4 tablespoons cornstarch, divided",
        "2 cups chicken breast, cut 1/4-inch slices, skinless",
        "16 ounces chow mein noodles",
        "1/2 cup canola oil",
        "1 cup 1/8-inch julienne white onion",
        "1/2 cup 1/4-inch strips red bell pepper",
        "1 cup 1/4-inch sticks cut carrot",
        "1 cup 1/2-inch bias cut celery",
        "1/2 cup 1/2-inch strips shiitake mushrooms",
        "3/4 cup 1/2-inch strips snow peas",
        "1 cup mung bean sprouts",
        "3 tablespoons hoisin sauce",
        "1/4 teaspoon sesame oil",
        "1 1/2 cups low-sodium chicken stock",
        "1/2 cup strips green onions"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Wok Recipes",
        "Asian",
        "Chinese Recipes",
        "Mushroom",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Noodles",
        "Beans and Legumes",
        "Pea Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Marinating Recipes",
        "Stir-Frying Recipes"
    ],
    "title": "Hong Kong Style Noodles with Chicken and Vegetables",
    "url": "http://www.foodnetwork.com/recipes/hong-kong-style-noodles-with-chicken-and-vegetables-recipe"
}
