{
    "directions": [
        "Stack three 8-inch squares cheesecloth on work surface. Place celery leaves and next 5 ingredients in center of square. Gather up edges of cheesecloth; tie with kitchen string and set packet aside.",
        "Place brisket and short ribs in heavy large wide pot. Add enough water to pot to cover meat. Bring to simmer over medium heat. Skim any impurities that rise to surface. Reduce heat to maintain gentle simmer. Add packet, onion, and 1 tablespoon coarse salt. Cover; simmer until meat is fork-tender, about 2 hours for short ribs and 3 1/4 to 3 1/2 hours for brisket. Transfer meats to 15x10x2-inch glass baking dish. Remove and discard bones from short ribs. Remove and discard packet and most of onion from cooking liquid. DO AHEAD: Can be made 1 day ahead. Cool cooking liquid and meats slightly, then chill separately until cold. Cover each; keep chilled.",
        "Bring meat cooking liquid to boil; add celery root, rutabaga, and potatoes. Reduce heat to medium and cook uncovered until vegetables are tender, about 45 minutes. Drain vegetables, reserving 3 cups cooking liquid. Return vegetables to pot and stir over low heat 1 minute to dry. Mash vegetables with potato masher to coarse puree. Mash in butter. Season to taste with salt and pepper. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm over medium-low heat before serving, adding reserved meat cooking liquid by tablespoonfuls as needed to moisten.",
        "Preheat oven to 375°F. Whisk horseradish, mustard, and sugar in small bowl. Brush 3 tablespoons horseradish sauce over meats in dish. Sprinkle with salt and pepper. Roast meats until browned and heated through, 35 to 45 minutes. Transfer meats to work surface. Thinly slice across grain. Place on platter. Drizzle 2 cups reserved cooking liquid around. Serve with vegetable mash and horseradish sauce."
    ],
    "ingredients": [
        "1 cup celery leaves",
        "3 whole cloves",
        "2 Turkish bay leaves",
        "2 cardamom pods",
        "1 garlic clove, peeled",
        "1/4 teaspoon whole black peppercorns",
        "1 3 1/2- to 3 3/4-pound flat-cut beef brisket",
        "2 pounds bone-in beef short ribs (about 6 medium)",
        "1 medium onion, peeled",
        "1 tablespoon coarse kosher salt",
        "4 cups 1- to 1 1/2-inch cubes peeled celery root (celeriac; about 1 large)",
        "4 cups 3/4-inch cubes peeled trimmed rutabaga (about 2 large)",
        "2 1/2 cups 1 1/2-inch cubes peeled Yukon Gold potatoes (about 1 pound)",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "3 tablespoons prepared white horseradish",
        "3 tablespoons Dijon mustard",
        "3 tablespoons (packed) golden brown sugar",
        "Special equipment: Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Horseradish",
        "Meat",
        "Root Vegetable",
        "Fall",
        "Rutabaga",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Horseradish-Glazed Brisket and Short Ribs with Root Vegetable Mash",
    "url": "http://www.epicurious.com/recipes/food/views/horseradish-glazed-brisket-and-short-ribs-with-root-vegetable-mash-361254"
}
