{
    "directions": [
        "Combine anchovies, garlic, parsley, horseradish, oil, red pepper flakes, and nutmeg in a small bowl; season with salt and pepper. Set 2 tablespoons of mixture aside.",
        "Place rib-eye roast, fat side down, on a cutting board with a short end toward you. Holding a sharp slicing knife about 1\" above cutting board, make a shallow cut along the entire length of a long side of roast. Continue cutting deeper into the roast, lifting and unfurling meat with your free hand, until it can lie flat. Season both sides with salt and pepper.",
        "Spread parsley mixture over roast and roll up so fat cap is on top; tie at 1\" intervals with kitchen twine. Rub outside of roast with reserved parsley mixture and wrap tightly in plastic wrap. Chill at least 8 hours and up to 1 day. Let roast sit at room temperature 1 hour to help it roast evenly.",
        "Preheat oven to 400°. Place meat on a rack set inside a roasting pan and roast, rotating once, until fat is golden brown and starting to render, 40-50 minutes. Reduce temperature to 300° and continue to roast until an instant-read thermometer inserted into the thickest part registers 125° for medium-rare, 1-1 1/2 hours longer. Transfer to a cutting board; let rest at least 30 minutes before slicing."
    ],
    "ingredients": [
        "8 anchovy fillets packed in oil, drained, finely chopped",
        "4 garlic cloves, finely grated",
        "1 cup finely chopped fresh parsley",
        "1/3 cup grated horseradish",
        "1/3 cup olive oil",
        "2 teaspoons crushed red pepper flakes",
        "1/2 teaspoons freshly grated nutmeg",
        "Kosher salt, freshly ground pepper",
        "1 4-5 pound boneless beef rib-eye roast",
        "The rib-eye roast comes from the same area as the standing rib roast, but it's a more manageable size (and cooks more evenly). It has all the fat—a.k.a. flavor—of prime rib. Ask your butcher for the bones and roast them with the meat: Then you can decide who's been naughty or nice."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Dinner",
        "Steak",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Horseradish and Parsley Stuffed Rib-Eye Roast",
    "url": "http://www.epicurious.com/recipes/food/views/horseradish-and-parsley-stuffed-rib-eye-roast-51259310"
}
