{
    "directions": [
        "Preheat oven to 425°F. Place beets, ginger and garlic in small glass baking dish. Cover with foil and bake until beets are tender, about 1 hour. Cool. Peel beets, ginger and garlic; place in blender.",
        "Heat 1 tablespoon oil in heavy large skillet over medium heat. Add shallot and thyme; sauté 4 minutes. Add fish stock and wine; simmer until reduced to 1 1/4 cups, about 10 minutes. Add fish stock mixture and vinegar to beet mixture in blender. Blend until smooth, thinning with water to sauce consistency if too thick.",
        "Mix horseradish and cream in small bowl. Season with salt and pepper. (Beet sauce and horseradish mixture can be prepared 1 day ahead. Cover separately; chill.)",
        "Preheat oven to 425°F. Sprinkle salmon with salt and pepper. Heat remaining 1 tablespoon oil in heavy large skillet over medium-high heat. Add 3 salmon fillets to skillet; cook just until golden, about 2 minutes per side. Arrange salmon, skin side down, on large baking sheet. Repeat with remaining salmon. Spread horseradish mixture atop salmon. Bake until salmon is cooked through, about 12 minutes.",
        "Bring beet sauce to simmer in pan, stirring. Remove from heat. Mix in sour cream. Season with salt and pepper. Place salmon on plates. Spoon sauce around salmon."
    ],
    "ingredients": [
        "3 medium beets, trimmed",
        "1 1-inch piece fresh ginger",
        "3 garlic cloves, unpeeled",
        "2 tablespoons olive oil",
        "1 shallot, finely chopped",
        "1 tablespoon chopped fresh thyme",
        "2 cups fish stock or bottled clam juice",
        "1/2 cup dry white wine",
        "2 tablespoons balsamic vinegar",
        "4 tablespoons (about) water",
        "1 1/2 cups finely grated peeled fresh horseradish root (about 5 ounces)",
        "1/4 cup whipping cream",
        "6 6-to-8 ounce salmon fillets",
        "3 tablespoons sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Bake",
        "Sauté",
        "Horseradish",
        "Salmon",
        "Beet",
        "White Wine",
        "Chill",
        "Sour Cream",
        "Simmer"
    ],
    "title": "Horseradish-Crusted Salmon with Beet Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/horseradish-crusted-salmon-with-beet-sauce-4324"
}
