{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Pat tenderloin dry, then sprinkle with salt and pepper.",
        "Straddle a 17- by 12-inch flameproof heavy roasting pan across 2 burners and heat 3 tablespoons oil in pan over high heat until hot but not smoking, then brown tenderloin on all sides, about 10 minutes total. Remove from heat and transfer meat to a cutting board to cool slightly, about 5 minutes. Put a lightly oiled metal rack inside roasting pan.",
        "While meat cools, toss horseradish with remaining 3 tablespoons oil. Rub meat all over with mustard, then transfer to rack in roasting pan and coat top and sides of meat with horseradish, pressing to help adhere.",
        "Roast tenderloin until thermometer inserted diagonally 2 inches into center of meat registers 120°F, 25 to 35 minutes for medium-rare. Transfer to cutting board and cool, uncovered, to room temperature, about 45 minutes. (Internal temperature will rise to at least 130°F before cooling.)",
        "Remove and discard string. Cut tenderloin into thick slices."
    ],
    "ingredients": [
        "1 (3 1/2-lb) trimmed center-cut beef tenderloin roast, tied",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "6 tablespoons olive oil",
        "1 lb fresh horseradish, peeled and coarsely grated (1 cup; see cooks' note, below)",
        "2 tablespoons Dijon mustard",
        "Special equipment: an instant-read thermometer",
        "Accompaniment: Bloody Mary aspic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Horseradish",
        "Meat",
        "Beef Tenderloin",
        "Anniversary",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Horseradish-Crusted Beef Tenderloin",
    "url": "http://www.epicurious.com/recipes/food/views/horseradish-crusted-beef-tenderloin-232147"
}
