{
    "directions": [
        "Cook onion, garlic, and ginger in 1 tablespoon oil in a 5-quart heavy pot over moderate heat, covered, stirring occasionally, until onion is softened, about 4 minutes. Add pumpkin and wine and boil, uncovered, until wine is reduced by about half, about 5 minutes. Stir in stock and simmer, covered, until pumpkin is tender, about 20 minutes.",
        "Heat remaining tablespoon oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then sauté lemongrass, galangal, and chiles to taste, stirring, until lightly browned, about 1 minute. Remove from heat.",
        "Purée pumpkin mixture in batches (use caution when blending hot liquids) and return to pot. Stir in lemongrass mixture, lime leaves, lime juice, fish sauce, and sugar. Simmer, uncovered, 20 minutes. Pour soup through a sieve, discarding solids, and season well with salt and pepper."
    ],
    "ingredients": [
        "1 large onion, coarsely chopped",
        "1 tablespoon chopped garlic",
        "1 tablespoon chopped peeled fresh ginger",
        "3 tablespoons vegetable oil",
        "1 (3-lb) sugar or cheese pumpkin, peeled, seeded, and cut into 1-inch cubes (6 cups)",
        "1 cup dry white wine",
        "2 qt chicken stock, or 1 qt canned chicken broth and 1 qt water",
        "6 lemongrass stalks (bottom 5 inches only), coarsely chopped",
        "1 (1-inch) piece galangal (thawed if frozen), peeled and coarsely chopped",
        "3 to 5 fresh (1 1/2-inch) Thai chiles or 2 fresh jalapeño chiles, trimmed and coarsely chopped (seed chiles if a milder flavor is desired)",
        "4 kaffir lime leaves (fresh or frozen)",
        "1/3 cup fresh lime juice",
        "1/4 cup Asian fish sauce",
        "1 tablespoon sugar",
        "shrimp toasts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Appetizer",
        "Lime",
        "Pumpkin",
        "White Wine",
        "Fall",
        "Winter",
        "Jalapeño",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hot-and-Sour Pumpkin Soup",
    "url": "http://www.epicurious.com/recipes/food/views/hot-and-sour-pumpkin-soup-105582"
}
