{
    "directions": [
        "1. In a medium bowl, combine the milk and yeast, stirring to dissolve. Let stand for 5 minutes.",
        "2. Stir in the 2 tablespoons sugar, the oil, and the salt. Add the whole-wheat flour and 1 cup bread flour, stirring until the dough starts to pull away from the side of the bowl.",
        "3. Using the 3 to 4 tablespoons of bread flour, lightly flour a flat surface. Turn out the dough. Knead for 6 to 7 minutes, gradually adding, if needed, enough of the remaining 1/2 cup bread flour to make the dough smooth and elastic. (The dough shouldn't be dry or stick to the surface. You may not need any of the additional 1/2 cup bread flour, or you may need the entire amount if the dough is too sticky.)",
        "4. Using cooking spray, lightly spray a large bowl and a piece of plastic wrap large enough to cover the top of the bowl. Transfer the dough to the bowl, turning to coat all sides with the cooking spray. Cover the bowl with the plastic wrap with the sprayed side down. Let the dough rise in a warm, draft-free place (about 85°F) for about 1 hour, or until doubled in bulk.",
        "5. Preheat the oven to 400°F. Line a large baking sheet with cooking parchment. Set aside.",
        "6. Punch the dough down. Divide it into 12 equal pieces. Using a small amount of bread flour, lightly flour a flat surface. Roll each piece of dough into an 18-inch rope. Working with one rope, at a point about 4 inches from each end, cross one end of the rope over the other to form a circle with two 4-inch-long tails. Bring the tails together and twist them once. Lift the twist, folding the dough to the opposite side of the circle so that the tails slightly overlap the circle, giving it the shape of a pretzel. Place the pretzel on the baking sheet. Repeat with the remaining dough ropes, spacing the pretzels 1 inch apart. Set aside.",
        "7. In a small bowl, using a fork, beat the egg yolk and water together. Set aside.",
        "8. In a separate small bowl, stir together the ingredients for either topping.",
        "9. Brush the yolk mixture over the top of the pretzels. Sprinkle the pretzels with the topping.",
        "10. Bake for 15 minutes, or until golden brown. Serve hot. Transfer leftovers to a cooling rack. Let cool completely, about 1 hour.",
        "11. Store in an airtight container for up to three days. To reheat, microwave on 100 percent power (high) for 20 seconds."
    ],
    "ingredients": [
        "1 cup lukewarm fat-free milk (105°F to 115°F)",
        "2 teaspoons active dry yeast",
        "2 tablespoons sugar",
        "2 tablespoons olive oil",
        "1/4 teaspoon salt",
        "1 1/2 cups whole-wheat flour",
        "1 cup bread flour, 3 to 4 tablespoons bread flour, and 1/2 cup bread flour, divided use",
        "Cooking spray",
        "1 large egg yolk",
        "2 tablespoons water",
        "1 tablespoon sesame seeds",
        "1 tablespoon poppy seeds",
        "1 teaspoon caraway seeds, crushed",
        "1/4 cup sugar",
        "1/2 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Kid-Friendly",
        "Low Sodium",
        "Oktoberfest",
        "Healthy",
        "Advance Prep Required"
    ],
    "title": "Hot Soft Pretzels",
    "url": "http://www.epicurious.com/recipes/food/views/hot-soft-pretzels-51171480"
}
