{
    "directions": [
        "Position rack in the lower third of the oven and preheat to 350 degrees F (175 degrees C). Butter a 9-inch round layer pan and line with a parchment circle.",
        "In a small saucepan, heat the milk and butter to almost boiling. Set aside.",
        "Sift together the flour, baking powder, and salt in a triple sifter. Set aside.",
        "Beat the eggs on medium-high speed in an electric mixer fitted with beaters or a whip attachment for about 2 minutes. Gradually add the sugar, 1 tablespoon at a time, taking about 4-5 minutes to blend it in well. Scrape the sides of the bowl occasionally. The mixture will thicken and turn light yellow in color.",
        "Reduce mixer speed to medium. Add the vanilla, then pour in the hot milk IN A STEADY STREAM, taking about 10 seconds. Immediately add the dry ingredients all at once, and beat just until blended, scraping the sides of the bowl as necessary. Increase mixer speed to medium-high and beat 10 seconds. The batter will be very thin. Remove the bowl from the mixer and quickly pour the batter into the prepared pan.",
        "Bake 30-35 minutes, or until the cake begins to come away from the sides of pan and is golden brown and springy to the touch.",
        "Set on a cake rack to cool for about 10 minutes. Run a thin knife around the sides of the pan to loosen. Invert pan onto the rack sprayed with nonstick coating and peel off the parchment paper. Invert again to finish cooling right-side up. Store the plain sponge layer under a glass dome or covered with aluminum foil at room temperature for up to 3 days. For longer storage, freeze."
    ],
    "ingredients": [
        "1/2 cup milk",
        "1 tablespoon unsalted butter",
        "1 cup sifted cake flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 eggs",
        "3/4 cup super fine sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hot Milk Sponge Cake II",
    "url": "http://allrecipes.com/recipe/8159/hot-milk-sponge-cake-ii/"
}
