{
    "directions": [
        "For the chicken: Whisk together the eggs, buttermilk and hot sauce in a shallow casserole dish.",
        "In a second shallow casserole dish, combine the flour, cornstarch, salt and pepper.",
        "Place the chicken cutlets into the flour mixture, coating evenly on each side and shaking off the excess. Then place the chicken into the egg wash, coating the pieces on both sides. Dredge the chicken a second time in flour and egg. (If you like, you can dredge a third time; the breading will be thicker with every coating.)",
        "Heat the shortening in a large cast-iron skillet over medium heat. Fry the breaded chicken until golden brown, about 2 minutes; flip and continue cooking until golden brown and cooked through, another 1 to 2 minutes. Transfer to a paper-towel-lined plate to drain.",
        "For the gravy: Melt the butter in a medium saucepan over medium-low heat. Add the flour and whisk until smooth. Cook until the mixture begins to turn golden brown, 3 to 5 minutes. Whisk in the milk and cook until thick and smooth, another 3 to 5 minutes. Season with salt and pepper.",
        "For the hot sauce: In a small bowl, mix together the melted butter, cayenne, paprika, brown sugar, salt, pepper and garlic powder.",
        "To serve: Brush the chicken with the warm hot sauce. Place chicken pieces onto the bottom halves of the biscuits and top with white gravy and pickle slices. Cover with the biscuit tops and serve immediately.",
        "Preheat the oven to 425 degrees F.",
        "In a large bowl, whisk together the flour, baking powder, baking soda, salt and 3 tablespoons of the sugar.",
        "In a small bowl, combine the warm water with the yeast and the remaining 2 tablespoons sugar; stir until the yeast is dissolved. Let stand until bubbles appear, 2 to 3 minutes.",
        "Using your hands, mix the 1 cup cold butter into the flour, breaking the butter into small pebbles, until the mixture resembles coarse meal. Make a well in the center and add the buttermilk and the yeast mixture. Gently fold the flour into the wet ingredients. Keep mixing until a ball starts to form, then gently knead, 12 to 15 times, to create a smooth dough. Cover with a cloth or plastic wrap and let rise in a warm place for approximately 1 hour.",
        "Transfer the dough to a lightly floured work surface and press out to 1- to 1 1/2-inches thick. Fold the dough in half, press again to 1- to 1 1/2-inches thick, and then fold again. Cut the dough using a 2- to 3-inch round biscuit cutter, depending personal preference. Brush the bottom of a cast-iron skillet with some of the melted butter. Place the biscuits in the skillet; brush the tops with melted butter.",
        "Bake until golden brown, 18 to 22 minutes, depending on size. Brush again with melted butter and serve immediately."
    ],
    "ingredients": [
        "2 eggs",
        "2 cups buttermilk",
        "2 tablespoons hot sauce, such as \"Louisiana\"",
        "3 cups all-purpose flour",
        "2 cups cornstarch",
        "2 tablespoons salt",
        "1 tablespoon black pepper",
        "1 pound chicken cutlets",
        "3 to 4 cups solid vegetable shortening",
        "4 tablespoons (1/2 stick) butter",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "Salt and freshly ground pepper",
        "8 tablespoons (1 stick) butter, melted",
        "1 tablespoon cayenne",
        "1 tablespoon paprika",
        "1 tablespoon brown sugar",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 teaspoon garlic powder",
        "Pickle slices",
        "8 Angel Biscuits, cut in half, recipe follows",
        "5 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "5 tablespoons sugar",
        "1/4 cup warm (90 to 110 degrees F) water",
        "1/2 ounce (2 packages) active dry yeast",
        "1 cup (2 sticks) salted butter, cold, cut into small squares, plus 4 tablespoons, melted",
        "2 cups buttermilk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Gravy",
        "Biscuit",
        "Chicken",
        "Poultry Recipes",
        "Buttermilk",
        "Dairy Recipes",
        "Main Dish Recipes"
    ],
    "title": "Hot Chicken Biscuits with Mama's White Gravy",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/hot-chicken-biscuits-with-mamas-white-gravy"
}
