{
    "directions": [
        "In an 8-quart stockpot, bring 4 quarts water to a boil over high heat. Blanch the cabbage by submerging it in the boiling water just until it turns a dull grayish purple, about 5 minutes. Drain in a colander, shake the colander for a minute or so to remove excess water, and reserve.",
        "Scatter the bacon in a 12-inch dry skillet over medium-high heat. With a wooden spoon, move the pieces around until the bacon is firm and barely crisp, about 4 minutes. Remove with a slotted spoon and reserve.",
        "Pour the vinegar into the skillet. It will hiss and pop at first but will soon subside. Swirl the vinegar around with the spoon, stirring up any browned bits of bacon. Add the celery seeds and red pepper flakes and stir.",
        "Add the cabbage to the skillet and toss to coat it with the vinegar. Add the salt, pepper, and reserved bacon, and continue to sauté, stirring the cabbage around the pan until all its bright magenta glory has returned, about 4 minutes.",
        "Place the slaw in a bowl and shake pepper vinegar over it to taste. Pass the cruet at the table for those who wish to fire it up further."
    ],
    "ingredients": [
        "One 3-pound red cabbage, cored and coarsely shredded, or a mix of red and green cabbages (10–12 cups)",
        "1/4 pound slab bacon or 4 slices thick-cut bacon, diced",
        "1/2 cup white vinegar, cider vinegar, or white wine vinegar",
        "1/2 teaspoon celery seeds",
        "1/4 teaspoon crushed red pepper flakes",
        "2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "Pepper vinegar to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cabbage",
        "Bacon",
        "Side",
        "Grill/Barbecue",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Hot Slaw a la Greyhound Grill",
    "url": "http://www.epicurious.com/recipes/food/views/hot-slaw-a-la-greyhound-grill"
}
