{
    "directions": [
        "Heat vegetable oil in heavy large pot over medium-high heat. Add half of beef ribs and sauté until brown on all sides, about 8 minutes. Transfer to plate. Repeat with remaining ribs; transfer to plate. Add sliced onion to pot. Sauté until golden, about 10 minutes. Return ribs and any juices to pot. Add 3 1/2 quarts water and remaining stock ingredients. Bring to boil, skimming any foam from surface. Reduce heat and simmer until ribs are very tender, skimming foam occasionally, about 2 1/2 hours.",
        "Using tongs, transfer ribs to plate. Strain stock into large bowl. Chill stock until fat solidifies on top, at least 3 hours. Remove meat from bones; cut away excess fat. Shred meat finely. (Can be made 1 day ahead. Cover meat and chill. Keep stock chilled.)",
        "Preheat oven to 375°F. Arrange beets in single layer in 13x9x2-inch baking dish; add 1 cup water. Cover; bake beets until tender when pierced with knife, about 1 hour. Cool beets. Peel and cut into 1/3-inch dice.",
        "Remove fat from surface of stock. Add enough canned beef broth to stock to measure 10 cups.",
        "Melt 2 tablespoons butter in heavy large pot over medium-low heat. Add diced carrots and chopped onions and sauté 10 minutes. Add cabbage and garlic and sauté 5 minutes. Add 10 cups beef stock, beets, potato and 2 tablespoons red wine vinegar. Simmer until cabbage and potato are tender, about 20 minutes. Add shredded meat; simmer 5 minutes. Season with additional red wine vinegar, salt and pepper.",
        "Ladle borscht into bowls. Top each with dollop of sour cream and serve."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "3 pounds beef short ribs, cut into 3- to 4-inch pieces",
        "1 large onion, sliced",
        "3 1/2 quarts water",
        "2 celery stalks, chopped",
        "1 carrot, coarsely chopped",
        "12 whole black peppercorns",
        "2 bay leaves",
        "2 whole cloves",
        "10 medium beets (about 2 inches in diameter), rinsed, tops trimmed",
        "1 cup water",
        "3 cups (about) canned beef broth",
        "2 tablespoons (1/4 stick) butter",
        "1 cup diced carrots",
        "1 cup chopped onions",
        "6 cups thinly sliced green cabbage (about 1/2 small head)",
        "4 teaspoons minced garlic",
        "1 large russet potato, peeled, diced",
        "2 tablespoons (or more) red wine vinegar",
        "Sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetable",
        "Beef Rib",
        "Beet",
        "Winter"
    ],
    "title": "Hot Beef Borscht with Sour Cream",
    "url": "http://www.epicurious.com/recipes/food/views/hot-beef-borscht-with-sour-cream-3189"
}
