{
    "directions": [
        "In a large heavy skillet cook bacon in batches over moderate heat, turning it, until golden brown and crisp. Transfer bacon as cooked to paper towels to drain.",
        "Toast bread and if desired discard crusts and lightly butter toast. Arrange toast on 6 flameproof plates and divide turkey among toasts.",
        "Preheat broiler.",
        "In a 2- to 3-quart heavy saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking constantly, 3 minutes. Add 2 cups milk in a stream, whisking, and bring sauce to a boil, whisking. Simmer sauce, whisking occasionally, 5 minutes.",
        "While sauce is simmering, in a bowl whisk together yolk and remaining cup of milk. Whisk about 1 cup sauce into yolk mixture. Remove pan from heat and whisk yolk mixture into sauce with Parmesan. Cook sauce over moderately low heat, whisking constantly, until a thermometer registers 160°F. Remove pan from heat and season sauce with white pepper and salt. In a small bowl whisk cream until it just holds stiff peaks and stir into sauce.",
        "Spoon sauce evenly over turkey and sprinkle Parmesan evenly over sauce. Broil sandwiches in batches about 2 to 3 inches from heat until sauce is lightly browned, about 2 minutes.",
        "Arrange 2 bacon slices in an X on each serving."
    ],
    "ingredients": [
        "12 bacon slices (about 10 ounces)",
        "12 slices firm white sandwich bread",
        "unsalted butter, softened, for spreading on toast if desired",
        "1 pound sliced roast turkey breast",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup all-purpose flour",
        "2 1/2 cups milk",
        "1 large egg yolk",
        "1 cup freshly grated Parmesan (about 3 ounces)",
        "freshly ground white pepper",
        "2 tablespoons well-chilled heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Milk/Cream",
        "Cheese",
        "turkey",
        "Broil",
        "Kid-Friendly",
        "Lunch",
        "Cheddar",
        "Parmesan",
        "Bacon",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hot Browns",
    "url": "http://www.epicurious.com/recipes/food/views/hot-browns-15730"
}
