{
    "directions": [
        "Pat salmon dry, then generously coat skin and wire rack with nonstick spray. Place salmon, skin side down, on rack and set inside a rimmed baking sheet; season salmon flesh well with salt. Chill, uncovered, 3 hours.",
        "Whisk shallot, crème fraîche, tarragon, and lemon zest in a small bowl to combine; taste and season with salt. Cover and chill.",
        "Crumple 2 large sheets of heavy-duty foil to form two 4\"-diameter balls. Heat skillet over medium-high, 6 minutes. Spread 2 cups wood chips in center of skillet and let char until partially blackened and smoking, about 5 minutes. Sprinkle coriander seeds, peppercorns, dill seeds, and celery seeds over chips. Carefully set rack with salmon in skillet over chips. Set foil balls on either side of fillet and push 3 skewers vertically into fillet along the bloodline about 1\" deep and 3\" apart. Loosely cover skillet with foil, using foil balls and skewers as support so there is space for smoke to circulate around the fish.",
        "Reduce heat to medium and smoke salmon 8 minutes, then reduce heat to lowest setting and cook until an instant-read thermometer inserted into the thickest part of fillet registers 120°F, 10–15 minutes. Transfer rack with salmon back to baking sheet and let cool 30 minutes.",
        "Serve salmon at room temperature with tarragon crème fraîche, bagels, capers, avocados, cucumbers, watercress, and scallions alongside."
    ],
    "ingredients": [
        "1 (4-pound) skin-on center-cut salmon fillet, pin bones removed",
        "Nonstick vegetable oil spray",
        "Kosher salt",
        "1/2 medium shallot, finely chopped",
        "2 cups crème fraîche",
        "2 tablespoons chopped fresh tarragon",
        "1 teaspoon finely grated lemon zest",
        "3 tablespoons coriander seeds",
        "1 tablespoon black peppercorns",
        "1 tablespoon dill seeds",
        "1 teaspoon celery seeds",
        "Bagels, capers, sliced avocados, sliced cucumbers, watercress, and sliced scallions (for serving)",
        "In addition to a 17\" cast-iron skillet, you'll need a 14\" circular wire rack ($28; amazon.com), mesquite or hickory wood chips, and three 6\" bamboo skewers."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Salmon",
        "Summer",
        "Grill/Barbecue",
        "Healthy"
    ],
    "title": "Hot-Smoked Salmon with Tarragon Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/hot-smoked-salmon-with-tarragon-creme-fraiche-56389865"
}
