{
    "directions": [
        "For the chicken breasts: Preheat the oven to 350 degrees F. Combine the Bloody Mary mix, Worcestershire sauce, butter and chipotle peppers in adobo sauce in a 13-by-9-by-2-inch baking pan and blend until smooth with an immersion blender. Add the chicken and toss to coat. Sprinkle evenly with the fish and taco seasonings and pour the lime juice on top. Cook, uncovered, until the chicken starts to fall apart, about 1 hour.",
        "When the chicken is cool enough to handle, shred it and return it to the cooking liquid so it is absorbed by the meat.",
        "For the jalapeno-cilantro crema: Add the mayonnaise, sour cream, garlic, lime juice, olive oil, onion powder, pepper, salt, cilantro and jalapenos to a 4-quart food storage container and blend until smooth with an immersion blender. Cover and refrigerate until needed.",
        "For serving: Split the ciabatta rolls, brush the insides with some olive oil and toast on a heated skillet or griddle until crisp and light brown, 1 to 2 minutes.",
        "Preheat the broiler. On a baking sheet, place 8 ounces chicken on the bottom of each roll. Top each with some of the mozzarella. Broil until the cheese melts and bubbles, about 1 minute. Spoon some of the jalapeno-cilantro crema on top of the chicken and top with the other halves of the rolls."
    ],
    "ingredients": [
        "1 cup Bloody Mary mix, such as Zing Zang",
        "3 tablespoons Worcestershire sauce",
        "1 stick (8 tablespoons) unsalted butter, diced and room temperature",
        "One 3-ounce can chipotle peppers in adobo sauce",
        "2 1/2 pounds boneless, skinless chicken breasts",
        "1 tablespoon seafood seasoning, such as Paul Prudhomme's Blackened Redfish Magic",
        "1 tablespoon taco seasoning",
        "2 limes, juiced",
        "1/4 cup mayonnaise, such as Duke's",
        "2 tablespoons sour cream",
        "1 tablespoon minced garlic",
        "1 tablespoon fresh lime juice",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon kosher salt",
        "1/2 bunch cilantro leaves, chopped",
        "2 jalapenos, seeded and chopped",
        "5 to 6 ciabatta rolls, for serving",
        "Olive oil, for toasting",
        "1 pound shredded mozzarella"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Jalapeno Recipes",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Hot Lap Sandwich",
    "url": "http://www.foodnetwork.com/recipes/hot-lap-sandwich"
}
