{
    "directions": [
        "Chop garlic on work surface. Sprinkle with 1 1/2 teaspoons kosher salt and mince until paste forms. Transfer paste to small bowl; mix in parsley and next 7 ingredients. Using small sharp knife, make 20 evenly spaced 1-inch-long, 2-inch-deep slits in pork. Stuff seasoning mixture into slits. Sprinkle outside of pork with salt and pepper. Let stand 1 hour for seasonings to penetrate.",
        "Position rack in bottom third of oven and preheat to 325°F. Place rack in large roasting pan; place pork on rack. Roast until thermometer inserted into thickest part registers 170°F, about 4 1/2 hours. Let pork rest 30 minutes. Transfer to work surface. Maintain oven temperature; reserve roasting pan.",
        "Thickly slice pork off bone. Coarsely chop or tear slices and place in large baking dish; cover with foil. Pour juices from roasting pan into 4-cup measuring cup. Spoon off fat. If necessary, add enough water to degreased juices to measure 2 cups. Stir 2 tablespoons juices and cornstarch in small saucepan until cornstarch dissolves; whisk in remaining juices and vinegar. Whisk over medium heat until sauce boils and thickens, about 2 minutes. Season to taste with salt and pepper.",
        "Heat oil in heavy large skillet over medium-high heat. Add onions and all peppers; sauté until vegetables are tender and brown, stirring occasionally, about 30 minutes. Sprinkle with salt and pepper.",
        "Arrange roll bottoms on work surface; mound with warm pork and drizzle with sauce. Cover with cheese, vegetables, and roll tops. Serve warm."
    ],
    "ingredients": [
        "4 large garlic cloves",
        "1 1/2 teaspoons coarse kosher salt",
        "1/4 cup chopped fresh parsley",
        "3 tablespoons extra-virgin olive oil",
        "2 teaspoons dried basil",
        "2 teaspoons dried oregano",
        "2 teaspoons dried rosemary",
        "1 teaspoon dried rubbed sage",
        "1 teaspoon fennel seeds, ground in mortar with pestle or spice grinder",
        "1 teaspoon ground black pepper",
        "1 9-pound whole pork shoulder with bone",
        "1 tablespoon cornstarch",
        "1 tablespoon red wine vinegar",
        "3 tablespoons extra-virgin olive oil",
        "1 pound onions, halved, cut into 1/4-inch-thick slices",
        "1 pound red bell peppers, seeded, cut into 1/2-inch-wide strips",
        "1/2 pound green bell peppers, seeded, cut into 1/2-inch-wide strips",
        "10 crusty rolls, split, toasted",
        "1 1/2 pounds fresh mozzarella cheese, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Pork",
        "Roast",
        "Sauté",
        "Super Bowl",
        "Mozzarella",
        "Spice",
        "Bell Pepper"
    ],
    "title": "Hot Slow-Roasted Pork, Onion, and Mozzarella Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/hot-slow-roasted-pork-onion-and-mozzarella-sandwiches-233921"
}
