{
    "directions": [
        "Blend ground cookies and both sugars in processor. Add butter and process to blend. Divide cookie mixture among ten 4 1/2-inch-diameter springform pans with 1 1/2-inch-high sides (about 1/2 cup packed per pan). Press crust onto bottoms and up sides of pans.",
        "Position racks in top and bottom thirds of oven; preheat to 325°F. Boil rum in small saucepan until reduced to 1/4 cup, about 1 minute. Cool.",
        "Using electric mixer, beat cream cheese in large bowl on low speed until smooth. Gradually beat in sugar. Add eggs 1 at a time, beating on low speed just to blend after each addition, occasionally scraping sides of bowl. Beat in spices, then cream, vanilla, and cooled rum just to blend. Divide filling among prepared crusts (about 1 cup per pan).",
        "Place cheesecakes on 2 rimmed baking sheets. Bake until tops appear set, puffed, and golden at edges but still move slightly in center when shaken, reversing sheets after 20 minutes, about 40 minutes total. Cool 5 minutes.",
        "Whisk sour cream, sugar, and vanilla in large bowl. Divide topping among hot cheesecakes, about 1/4 cup each, spreading to meet edges of crusts. Bake 10 minutes. Run knife around each cake to loosen crust from pan. Place hot cheesecakes directly in refrigerator.",
        "Chill uncovered overnight. (Can be made 2 days ahead. Cover; keep chilled.) Serve with Rum-Caramel Sauce."
    ],
    "ingredients": [
        "5 1/2 cups finely ground gingersnap cookies (about 1 3/4 pounds)",
        "1/4 cup sugar",
        "1/4 cup (packed) golden brown sugar",
        "1 cup (2 sticks) unsalted butter, melted",
        "1/2 cup dark rum",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1 /2 cups sugar",
        "4 large eggs",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "1/3 cup whipping cream",
        "1 teaspoon vanilla extract",
        "2 1/2 cups sour cream",
        "7 tablespoons sugar",
        "1 3/4 teaspoons vanilla extract",
        "Rum-Caramel Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hot Buttered Rum Cheesecakes with Rum-Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/hot-buttered-rum-cheesecakes-with-rum-caramel-sauce-233421"
}
