{
    "directions": [
        "Preheat oven to 425°F. Spray six 3/4-cup custard cups with nonstick spray. Using electric mixer, beat eggs in medium bowl at high speed until thick, about 3 minutes. Gradually beat in 2/3 cup sugar; beat until thick and pale yellow, about 1 minute longer. Beat in 1/2 teaspoon vanilla. Add flour and beat 30 seconds. Bring milk and butter just to boil in small saucepan, stirring until butter melts. Add hot milk mixture to batter; beat until blended and smooth, about 30 seconds. Divide batter among prepared cups. Place cups on rimmed baking sheet.",
        "Bake cakes until tops rise (tall rounded peak will form in center of each), turn pale golden, and are firm to touch, about 16 minutes. Cool in cups at least 20 minutes. DO AHEAD: Can be made 8 hours ahead. Cool completely in cups, then cover and let stand at room temperature.",
        "Toss strawberries and remaining 1/2 cup sugar in medium bowl to coat; let stand 20 minutes for juices to form. Using electric mixer, beat cream, powdered sugar, and remaining 1/4 teaspoon vanilla in another medium bowl until peaks form.",
        "Remove warm or room-temperature cakes from cups and transfer to bowls. Cut off rounded top of each cake. Spoon some of berries and juices over. Cover berries with tops of cakes. Spoon whipped cream over, garnish with remaining berries and juices, and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 extra-large eggs",
        "2/3 cup plus 1/2 cup sugar",
        "3/4 teaspoon vanilla extract, divided",
        "1 cup plus 2 tablespoons self-rising flour",
        "2/3 cup whole milk",
        "5 tablespoons unsalted butter",
        "1 pound large strawberries, hulled, thinly sliced lengthwise",
        "1/2 cup chilled heavy whipping cream",
        "1 tablespoon powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Mother's Day",
        "Strawberry",
        "Spring",
        "Summer",
        "Anniversary",
        "Party",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hot Milk Cakes with Strawberries and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/hot-milk-cakes-with-strawberries-and-cream-241911"
}
