{
    "directions": [
        "1. Cure the salmon: Mix together the salt, granulated sugar, brown sugar, and peppercorns in a medium bowl. Line a piece of extra-wide aluminum foil that's a little longer than the length of the fish with an equally long layer of plastic wrap. Sprinkle half of the salt rub on the wrap. Lay the salmon on the rub. Sprinkle the remaining rub on top of the salmon. Cover with plastic and wrap in foil, crimping the edges together tightly around the fish. Put the wrapped fish on a rimmed baking sheet and top with another baking sheet. Weight with a brick or two and refrigerate for 24 hours.",
        "2. Unwrap the salmon and rinse off the cure mixture with cold water. Pat dry with paper towels and put the salmon in a cool, dry place (not the refrigerator) until the surface of the fish is dry and somewhat matte, 1 to 3 hours, depending on humidity. A fan may be used to speed the process.",
        "3. Soak 2 cups alder wood chips in water for at least 30 minutes.",
        "4. Heat your smoker according to the manufacturer's instructions. If using a charcoal or gas grill, set up a drip pan with water on the bottom grates and heat the grill to low for indirect grilling. For a charcoal grill, put the drained wood chips over the hot coals, add the cooking grate, and close the cover. For a gas grill, add the wood chips to a smoker box or foil pouch, put on the cooking grates toward the back, and close the cover. For both grills, open the vents halfway and maintain a temperature of 200°F. Let smoke build for 10 minutes.",
        "5. Add the salmon to the smoker, skin side down, and cover the smoker. Adjust the heat as needed to maintain the temperature and smoke until the thickest part of the fish registers 150°F, about 1 hour. Serve immediately or cool to room temperature, wrap tightly in plastic, and refrigerate for up to 3 days.",
        "6. Make the salad: Whisk together the vinegar, mustard, and honey in a large bowl and season with salt and pepper. Slowly whisk in the oil until emulsified. Add the greens, apple, onion, cherries, and hazelnuts and toss to combine. Season with salt and pepper.",
        "7. Put the salmon on a platter and arrange the salad on top."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "2 tablespoons granulated sugar",
        "2 tablespoons packed light brown sugar",
        "2 teaspoons crushed black peppercorns",
        "1 (3- to 3 1/2-pound) piece center-cut salmon fillet, skin on, pin bones removed",
        "1/4 cup apple cider vinegar",
        "1 tablespoon whole-grain mustard",
        "2 teaspoons clover honey",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup canola oil",
        "4 ounces organic baby greens",
        "1 Granny Smith apple, cored and thinly sliced",
        "1/2 small white onion, halved and thinly sliced",
        "1/4 cup dried cherries",
        "1/4 cup chopped hazelnuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Backyard BBQ",
        "Dinner",
        "Apple",
        "Cherry",
        "Seafood",
        "Salmon",
        "Summer",
        "Smoker",
        "Hazelnut"
    ],
    "title": "Hot Smoked Salmon with Apples, Dried Cherries, Hazelnuts and Greens",
    "url": "http://www.epicurious.com/recipes/food/views/hot-smoked-salmon-with-apples-dried-cherries-hazelnuts-and-greens-51167010"
}
