{
    "directions": [
        "In a small bowl, sprinkle the yeast over half the warm milk. Let stand until creamy, about 15 minutes.",
        "In another bowl, mix two eggs and butter into the remaining warm milk.",
        "Place the whole wheat flour in a mixing bowl and add the salt, nutmeg, currants, and candied citrus peel. Make a well in the center and put in the yeast mixture, butter and egg mixture, and honey. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.",
        "Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. Meanwhile, make the crosses for the buns: Mix together 1 cup flour and 1/2 cup shortening to make a pastry. Roll out the pastry and cut in thin strips, set aside.",
        "Deflate the dough and turn it out onto a lightly floured surface. Divide into 16 equal pieces and form into round buns. Place them on lightly greased baking sheets",
        "Hanging the prepared strips of dough over the buns loosely so that they touch the baking sheets on each side. This allows for the expansion of the buns. Preheat oven to 400 degrees F (200 degrees C).",
        "Beat together one egg and 1/4 cup plus 2 tablespoons milk. Brush the buns with this mixture and leave them in a warm place for 20 minutes to rise.",
        "Place a tray of hot water in the bottom of the oven to make it steamy. This gives the buns a thin, soft crust. Bake the buns at 400 degrees F (200 degrees C)  for 20 minutes, or until they are golden-brown. Cool them on wire racks and serve them split and buttered."
    ],
    "ingredients": [
        "1 tablespoon active dry yeast",
        "1 1/4 cups warm milk (110 degrees F)",
        "2 eggs, beaten",
        "1/3 cup butter, softened",
        "4 cups whole wheat flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup currants",
        "3 ounces candied mixed fruit peel",
        "1/3 cup honey",
        "1 cup all-purpose flour",
        "1/2 cup shortening",
        "1 egg, lightly beaten",
        "2 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hot Cross Buns II",
    "url": "http://allrecipes.com/recipe/7074/hot-cross-buns-ii/"
}
