{
    "directions": [
        "Heat the milk in a small saucepan until it bubbles, then remove from heat. Stir in the butter until melted; let cool to lukewarm.",
        "In a small mixing bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. In another small bowl, combine 2 whole eggs with the egg yolk; beat lightly.",
        "In a large mixing bowl, mix together 4 cups flour, white sugar, salt, lemon zest, mace and nutmeg. Make a well in the center of this mixture and pour in the cooled milk, yeast mixture and beaten eggs. Beat well until a loose dough forms. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 3 hours.",
        "Turn the dough out onto a lightly floured surface. Gently knead the dough and gradually incorporate the remaining cup of flour. Continue kneading until the dough is smooth and elastic, about 10 minutes.",
        "Divide dough into 3 portions; 1 small, 1 medium and 1 large (or one the size of a tangerine, one the size of an orange and one the size of a grapefruit). Cut the largest piece of dough in half and roll it out into 2 long ropes about 30 inches long.  Twist the ropes together and place into a 8 inch diameter spiral and place it on a lightly greased cookie sheet.  Cut the medium size piece of dough in half and roll out into 2 ropes about 20 inches long each.  Twist the ropes together and place in a ring on top of the first circle of dough.  Roll the smallest piece of dough into a rope about 12 inches long.  Coil this rope on top of the other dough. The completed loaf should look like a pyramid.",
        "Place the uncovered loaf in an unheated oven to rise until doubled in size, about 2 hours.  Remove the loaf from oven and preheat to 325 degrees F (165 degrees C).",
        "Lightly beat the reserved egg white and brush over the loaf.  Bake at 325 degrees F (165 degrees C) for 30 to 40 minutes or until lightly browned. If bread starts to brown too quickly, cover with aluminum foil and continue baking. Cool on wire rack."
    ],
    "ingredients": [
        "1 cup milk",
        "3/4 cup butter",
        "1 1/2 (.25 ounce) packages active dry yeast",
        "1/4 cup warm water (110 degrees F)",
        "2 eggs",
        "1 egg, separated",
        "6 cups bread flour",
        "3/4 cup white sugar",
        "2 teaspoons lemon zest",
        "1/4 teaspoon ground mace",
        "1/4 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Houska",
    "url": "http://allrecipes.com/recipe/17131/houska/"
}
