{
    "directions": [
        "Place ginger, garlic, onion, brown sugar, fish sauce, vegetable oil, soy sauce, coriander, cumin, turmeric, and cayenne pepper into a mixing bowl; whisk into a smooth marinade.",
        "Bruise lemon grass by hitting it lightly several times with the back of a large chef's knife; mince the lemon grass and add to the marinade.",
        "Cut beef sirloin into strips about 2 1/2 inches long and 1/8 inch thick. Thoroughly mix the beef into marinade until all beef strips are completely coated, about 1 minute. Cover bowl with plastic wrap and marinate in refrigerator for 2 to 4 hours.",
        "Preheat an outdoor grill for high heat and lightly oil the grate.",
        "Remove beef from marinade and shake off excess marinade. Thread 1/4 the meat onto each metal skewer.",
        "Arrange skewers on the preheated grill and cook until the meat stops sticking to the grill, about 1 to 2 minutes. Flip skewers over onto other side and cook until meat is well browned and shows grill marks, 2 to 2 1/2 minutes. Turn onto first side again and cook until meat is still slightly pink, 2 more minutes. Transfer to a platter and let skewers rest about 2 more minutes before serving."
    ],
    "ingredients": [
        "1 tablespoon grated fresh ginger root",
        "4 cloves garlic, crushed",
        "2 tablespoons minced onion",
        "1/4 cup packed brown sugar",
        "1/4 cup fish sauce",
        "2 tablespoons vegetable oil",
        "2 tablespoons soy sauce",
        "2 tablespoons ground coriander",
        "1 tablespoon ground cumin",
        "1/2 teaspoon ground turmeric",
        "1/8 teaspoon cayenne pepper",
        "1 2-inch piece of fresh lemon grass (white part only)",
        "2 pounds beef top sirloin, trimmed",
        "4 12-inch long metal skewers"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "How to Make Beef Satay",
    "url": "http://allrecipes.com/recipe/234309/how-to-make-beef-satay/"
}
