{
    "directions": [
        "Soak Great Northern beans in water in a large bowl overnight. Drain beans and place into a large soup pot. Push whole clove garlic into the 1/2 onion and add to beans; stir in 4 cloves smashed garlic, bay leaf, thyme, rosemary, and 10 cups water. Bring beans to a simmer and cook over medium-low heat until beans have started to soften, about 1 hour. Drain beans and reserve the cooking liquid, removing and discarding onion with garlic clove and bay leaf. Transfer beans to a large mixing bowl.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Cook bacon in a large, heavy Dutch oven over medium heat until lightly browned and still limp, about 5 minutes. Stir celery, carrots, and 1/2 diced onion into bacon; season with salt. Cook and stir vegetables in the hot bacon fat until tender, about 10 minutes.",
        "Heat 1 teaspoon olive oil in a large, heavy skillet over medium heat; brown sausage link halves  and duck confit in the hot oil until browned, about 5 minutes per side.",
        "Season vegetable-bacon mixture with 1 1/2 teaspoon salt, cracked black pepper, and herbes de Provence; pour in diced tomatoes. Cook and stir mixture over medium heat until juice from tomatoes has nearly evaporated and any browned bits of food on the bottom of pot have dissolved, about 5 minutes. Stir mixture into beans.",
        "Spread half the bean mixture into the heavy Dutch oven and place duck-sausage mixture over the beans; spread remaining beans over meat layer. Pour just enough of the reserved bean liquid into pot to reach barely to the top of the beans, reserving remaining liquid. Bring bean cassoulet to a simmer on stovetop and cover Dutch oven with lid.",
        "Bake bean cassoulet in the preheated oven for 30 minutes.",
        "Melt butter in a large skillet over medium heat; add 4 crushed garlic cloves, panko crumbs, and parsley to the melted butter. Season with salt and black pepper, and drizzle 1 tablespoon olive oil over crumbs. Stir to thoroughly combine.",
        "Uncover cassoulet and check liquid level; mixture should still have several inches of liquid. If beans seem dry, add more of the reserved bean liquid. Spread half the crumb mixture evenly over the beans and return to oven. Cook, uncovered, for 20 minutes. There should be about 2 or 3 inches of liquid at the bottom of the pot; if mixture seems dry, add more reserved bean mixture. Sprinkle remaining half the bread crumb mixture over cassoulet.",
        "Turn oven heat to 375 degrees F (190 degrees C) and bake cassoulet, uncovered, until crumb topping is crisp, edges are bubbling, and the bubbles are slow and sticky, 20 to 25 more minutes. Serve beans on individual plates and top each serving with a piece of duck and several sausage pieces."
    ],
    "ingredients": [
        "Beans:",
        "1 pound dried Great Northern beans",
        "1 whole clove",
        "1/2 onion",
        "4 cloves garlic, smashed",
        "1 bay leaf",
        "1 teaspoon dried thyme",
        "1/2 teaspoon dried rosemary",
        "10 cups water",
        "Remaining Components:",
        "1/2 pound thick-sliced bacon, chopped",
        "2 ribs celery, diced",
        "2 carrots, diced",
        "1/2 onion, diced",
        "salt to taste",
        "1 teaspoon olive oil",
        "1 pound link sausages (preferably French herb sausage), cut in half crosswise",
        "1 pound cooked duck leg confit",
        "1 1/2 teaspoons salt",
        "1 teaspoon freshly cracked black pepper",
        "1 teaspoon herbes de Provence",
        "1 (14 ounce) can diced tomatoes",
        "Topping:",
        "1/4 cup butter",
        "4 cloves garlic, crushed",
        "2 cups panko bread crumbs",
        "1 bunch fresh parsley, finely chopped",
        "salt and freshly ground black pepper to taste",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "How to Make Cassoulet",
    "url": "http://allrecipes.com/recipe/234677/how-to-make-cassoulet/"
}
