{
    "directions": [
        "Place yeast into the bottom of a large mixing bowl and stir with water; mix in salt. Beat flour into yeast mixture with a wooden spoon until dough is thick and sticky and pulls flour from the side of the bowl, 5 to 10 minutes.",
        "Cover bowl with plastic wrap and let stand in a turned-off oven until doubled in size, 12 to 14 hours. Dough will be bubbly and very sticky.",
        "Place a silicone baking mat onto a baking sheet and dust generously with cornmeal.",
        "Use a floured spatula to scrape dough out onto a well-floured work surface and dust dough with flour. With well-floured hands, pat dough into a rectangle and cut into 4 equal-size pieces.",
        "Dust a piece of dough with flour and use your floured fingers to gently roll and stretch it out into a log about 10 inches long and 1 1/2 inches around. Gently transfer to prepared baking sheet. If desired, wipe off excess cornmeal with a damp paper towel. Repeat with another piece of dough. (Reserve remaining dough to bake later or prepare 2 baking sheets to bake all 4 at once). Dust loaves lightly with flour. Dust a large piece of plastic wrap with flour and drape plastic lightly over the baking sheet with floured side down.",
        "Let loaves rise, covered, until doubled, 1 to 1 1/2 hour.",
        "Move oven racks to the bottom and middle positions. Preheat oven to 500 degrees F (260 degrees C) or as high as your oven will go. Place an oven-safe baking dish full of water into bottom rack of the oven.",
        "Use a sharp kitchen shears to cut 4 or 5 angled slashes into the top of each loaf. Poke down the little sharp tips of dough left by the scissors. Spray loaves with water, using a spray bottle.",
        "Bake in the preheated oven until baguettes are browned, about 15 minutes, spraying loaves with water after 5 minutes and 10 minutes. Turn the pan around on the second spraying.",
        "Transfer baguettes to a cooling rack and let cool to room temperature before slicing with a serrated knife."
    ],
    "ingredients": [
        "1/4 teaspoon rapid rise yeast",
        "1 1/2 cups water at room temperature",
        "1 3/4 teaspoons salt",
        "4 cups all-purpose flour, or as needed",
        "1/2 teaspoon cornmeal, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "How to Make French Baguettes",
    "url": "http://allrecipes.com/recipe/235275/how-to-make-french-baguettes/"
}
