{
    "directions": [
        "Melt butter in a large skillet over medium heat; saute shallots in the hot butter until translucent, 5 to 8 minutes. Stir mushrooms, salt, and black pepper into shallots. Turn heat to medium-high and cook, stirring often, until mushrooms are golden brown, about 10 minutes.",
        "Pour white wine over mushroom mixture, dissolving any browned bits of food on bottom of skillet into wine; bring to a simmer. Gently place scallops into wine and poach in the mushroom mixture until barely firm, about 2 minutes per side. Transfer scallops to a bowl. Strain mushroom mixture into another bowl, reserving mushrooms and cooking liquid separately. Return strained liquid to skillet, pour in any accumulated juices from scallops, and stir in cream. Bring to a boil and cook until cream sauce is reduced by about half, about 10 minutes. Stir often. Turn off heat and let mixture cool for 1 minute.",
        "Quickly whisk egg yolk into cream sauce until combined. Transfer skillet to a work surface (such as a heatproof countertop or cutting board) and stir cayenne pepper, 2 teaspoons tarragon, and lemon zest into sauce.",
        "Divide mushroom mixture into scallop shells, spreading mushrooms out to cover bottoms of shells; place about 3 scallops onto each portion. Spoon cream sauce over scallops to coat; let sauce drizzle down into mushrooms. Sprinkle lightly with Gruyere cheese and paprika or cayenne.",
        "Turn oven's broiler to high. Slightly crinkle a large sheet of aluminum foil and place onto a baking sheet. Place filled shells onto foil and press lightly to help them stay level.",
        "Broil about 10 inches from the heat source until sauce is bubbling and cheese is lightly browned, 5 to 6 minutes. Transfer to serving plates lined with napkins to prevent shells from tipping; garnish each portion with 2 crossed tarragon leaves."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1/2 cup diced shallots",
        "1/2 pound white button mushrooms, sliced",
        "salt and freshly ground black pepper to taste",
        "1 cup white wine",
        "1 pound sea scallops",
        "1/2 cup heavy whipping cream",
        "1 egg yolk",
        "1 pinch cayenne pepper, or to taste",
        "2 teaspoons minced fresh tarragon",
        "1 teaspoon lemon zest",
        "4 large oven-safe scallop shells",
        "1/4 cup shredded Gruyere cheese",
        "1 pinch paprika",
        "8 fresh tarragon leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "How to Make Coquilles Saint-Jacques",
    "url": "http://allrecipes.com/recipe/235471/how-to-make-coquilles-saint-jacques/"
}
