{
    "directions": [
        "Preheat the oven to 200°C/ 400°F/ Gas Mark 6.",
        "Wrap the tortillas in a piece of tin foil, sit on a baking sheet and put them in the oven for about 10 minutes, or until they are heated through.",
        "Meanwhile, heat 1 tablespoon of oil in a large non-stick frying pan over medium-high heat. Add the tomato, spring onion, chilli, garlic, cumin, and a little salt and pepper and cook them for about 5 minutes, or until the tomato begins to break down.",
        "Stir in half of the cilantro, remove from the heat, and keep warm.",
        "Rinse out and dry the pan and put it back on a low-medium heat. Add the remaining tablespoon of oil and once nice and hot, crack in the eggs, spaced apart. Cook them gently for about 3-4 minutes until the whites are cooked but the yolks still a little runny. Remove the pan from the heat.",
        "Remove the tortillas from the oven and place one on each serving plate. Divide the salsa mix between them, spreading it out with the back of the spoon. Slide two eggs on top of each one, sprinkle the remaining coriander and serve."
    ],
    "ingredients": [
        "2 soft corn tortillas",
        "2 tablespoons olive oil",
        "4 ripe tomatoes, cut into cubes",
        "3 spring onions, finely chopped",
        "2 green jalapeños or 1/2 regular green or red chillies, deseeded for less heat if preferred, finely chopped",
        "1 garlic clove, finely chopped",
        "Good pinch of ground cumin",
        "Leaves from 1/2 bunch of fresh cilantro, roughly chopped",
        "4 free-range eggs",
        "Sea salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Egg",
        "Tortillas",
        "Bean",
        "Jalapeño",
        "Garlic",
        "Tomato",
        "Cilantro",
        "Brunch",
        "Breakfast",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Huevos Rancheros With Jalapeños and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/huevos-rancheros-with-jalapenos-and-garlic"
}
