{
    "directions": [
        "Stir first 4 ingredients in bowl to blend. Season salsa with salt and pepper.",
        "Preheat oven to 400°F. Spray baking sheet with nonstick spray. Arrange tortillas in single layer on sheet. Bake until tortillas are golden, about 15 minutes.",
        "Meanwhile, heat 3 teaspoons oil in large nonstick skillet over medium-high heat. Add onion and sauté until golden, about 5 minutes. Add garlic and cumin; stir 30 seconds. Stir in tomatoes with juice, beans, and chiles; bring to boil. Reduce heat; simmer until almost all liquid is absorbed, stirring frequently, about 8 minutes. Season to taste with salt.",
        "Heat 1 teaspoon oil in another large nonstick skillet over medium heat. Crack eggs into skillet; fry until whites are just set but yolks are still soft, about 4 minutes. Sprinkle with salt and pepper.",
        "Place 1 warm tortilla on each of 4 plates. Divide bean mixture among tortillas. Top each with 1 egg; sprinkle with cheese and lettuce. Top with salsa; serve.",
        "*Chipotle chiles canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "1 small avocado, peeled, pitted, diced",
        "1/3 cup chopped fresh cilantro",
        "1/3 cup minced green onions",
        "1 1/2 tablespoons fresh lime juice",
        "Nonstick vegetable oil spray",
        "4 5- to 6-inch-diameter corn tortillas",
        "4 teaspoons canola oil, divided",
        "1 cup finely chopped onion",
        "3 garlic cloves, minced",
        "2 1/2 teaspoons ground cumin",
        "1 28-ounce can diced tomatoes in juice",
        "1 15-ounce can black beans, drained",
        "2 teaspoons chopped canned chipotle chiles*",
        "4 large eggs",
        "1/2 cup grated Monterey Jack cheese or sharp cheddar cheese",
        "2 cups thinly sliced romaine lettuce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Egg",
        "Breakfast",
        "Brunch",
        "Sauté",
        "Low Fat",
        "Avocado",
        "Hot Pepper",
        "Healthy",
        "Tortillas",
        "Monterey Jack"
    ],
    "title": "Huevos Rancheros with Chipotle Black Bean Sauce and Avocado Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/huevos-rancheros-with-chipotle-black-bean-sauce-and-avocado-salsa-109373"
}
