{
    "directions": [
        "Place the chickpeas in a large bowl with 1 teaspoon of the baking soda and cover with water. (The chickpeas will double in volume, so use more water than you think you need.) Soak the chickpeas overnight at room temperature. The next day, drain the chickpeas and rinse under cold water.",
        "Place the chickpeas in a large pot with the remaining 1 teaspoon baking soda and add cold water to cover by at least 4 inches. Bring the chickpeas to a boil over high heat, skimming off any scum that rises to the surface. Lower the heat to medium, cover the pot, and continue to simmer for about 1 hour, until the chickpeas are completely tender. Then simmer them a little more. (The secret to creamy hummus is overcooked chickpeas; don’t worry if they are mushy and falling apart a little.) Drain.",
        "Combine the chickpeas, tehina sauce, salt, and cumin in a food processor. Purée the hummus for several minutes, until it is smooth and uber-creamy. Then purée it some more!",
        "To serve, spread the hummus in a shallow bowl, dust with paprika, top with parsley and more tehina sauce if you like, and drizzle generously with olive oil."
    ],
    "ingredients": [
        "1 cup dried chickpeas",
        "2 teaspoons baking soda",
        "1 1/2 cups Basic Tehina Sauce, plus a bit more for topping",
        "1 teaspoon kosher salt",
        "1/4 teaspoon ground cumin",
        "Paprika",
        "Chopped fresh parsley",
        "Olive oil, for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Hummus",
        "Sesame",
        "Chickpea",
        "Appetizer",
        "Dip",
        "Graduation",
        "Back to School",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Hummus Tehina",
    "url": "http://www.epicurious.com/recipes/food/views/hummus-tehina"
}
