{
    "directions": [
        "Preheat oven to 350 degrees F. Line 2 (12 capacity) standard cupcake pans with paper liners. Toss the pecans, banana pieces and pineapple with 1/2 cup flour in a small bowl. Set aside. Whisk the remaining 2 1/4 cups flour, baking soda, cinnamon, nutmeg, ginger, and salt together in a medium bowl.",
        "Beat the eggs and granulated sugar in a large bowl with an electric mixer until thick and light, about 5 minutes. While beating slowly, gradually add the oil to the egg mixture. Scatter the dry ingredients over the wet, and then gently fold them together to make a loose batter. Gently fold in the nut mixture.",
        "Scoop batter into cupcake tins until about 3/4 full. Bake until cupcakes are firm to the touch and a tester, inserted into the cupcakes, comes out clean, 30 to 40 minutes. Cool cupcakes in pans on a rack; until cool enough to turn cupcakes out of pans. Cool completely on the rack. (For best flavor, wrap tightly and let cupcakes ripen overnight.)",
        "For frosting: Beat cream cheese and butter in a large bowl, with an electric mixer until smooth and fluffy. Gradually beat in lemon zest and vanilla. Sift confectioners' sugar over the cream cheese mixture, and beat until smooth. Refrigerate until just set, about 20 minutes.",
        "To finish the cupcakes, divide icing between the cupcakes, transfer icing to a big plastic bag or piping bag and snip the corner. Pipe a dollop of icing onto each cupcake and spread with the back of a spoon or an offset spatula to make large swoops.",
        "Thinly slice the remaining firm banana and place on a silicon mat-lined sheet tray. Sprinkle each banana lightly with granulated sugar and use a brulee torch on low to caramelize the sugar. (Alternatively, place the tray under a low broiler until sugar caramelizes. Use a small off-set spatula to transfer caramelized bananas to top each cupcake.) Serve."
    ],
    "ingredients": [
        "1 cup pecans, chopped",
        "2 1/2 cups very ripe chopped bananas, (about 3 bananas) plus 1 firm banana, for garnish",
        "1/2 cup finely chopped fresh pineapple",
        "2 3/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon fine salt",
        "3 large eggs, room temperature",
        "1 3/4 cups granulated sugar, plus more for banana garnish",
        "3/4 cup vegetable oil",
        "2 (8-ounce) packages cream cheese, at room temperature",
        "12 tablespoons (1 1/2 sticks) unsalted butter, cubed, at room temperature",
        "1 tablespoon finely grated lemon zest (about 1 lemon)",
        "1 teaspoon pure vanilla extract",
        "2 cups confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "American",
        "Southern Recipes",
        "Cupcake",
        "Nut Recipes",
        "Banana",
        "Fruit",
        "Cheese",
        "Cream Cheese Recipes",
        "Pineapples",
        "Holiday"
    ],
    "title": "Hummingbird Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/hummingbird-cupcakes-recipe"
}
