{
    "directions": [
        "Cut the lemons in half and squeeze the juice into a small saucepan. Drop in the juiced lemon halves and add the garlic, shallots, oil, salt, and pepper. Bring to a boil, then reduce the heat and simmer gently for 30 minutes. Transfer to a bowl and cool to room temperature, then cover and refrigerate overnight. (If you haven't planned ahead, just let the oil sit at room temperature for 30 minutes.) Strain the oil, pressing down hard on the solids before discarding them. Taste for salt. Lemon oil will keep, covered and refrigerated, for 2 weeks.",
        "Put the chickpeas, garlic, tahini, lemon juice, salt, and pepper into a food processor and pulse until the chickpeas are coarsely chopped. Scrape down the sides of the bowl. Turn the processor on again and drizzle in the oil. Process until the hummus is smooth, scraping down the sides of the bowl as needed. Scrape the hummus into a bowl, cover it, and set it aside at room temperature until needed, or cover and refrigerate for up to 1 day. Bring the hummus back to room temperature before you use it.",
        "Combine the cucumber, onion, and haricots verts in a bowl. Cover and refrigerate until needed.",
        "Position an oven rack 6 inches from the broiler and heat the broiler. Brush a baking sheet with oil and slide it under the broiler to heat for 5 minutes.",
        "Put the cornmeal, flour, and sea salt in a shallow bowl and whisk to combine. Dip the skin side of the salmon into the breading mix and set it, skin side down, on the baking sheet. Brush the fish with oil and salt it lightly. Broil the fish for 1 1/2 minutes. Change the oven setting to 500°F and bake the fish for 7 1/2 minutes.",
        "Remove the baking sheet from the oven. Adjust the oven rack so it's about 3 inches from the broiler and turn the broiler back on. Spread the top of each fillet with one-quarter of the hummus. Use the back of a spoon to make peaks in the hummus (the uneven surface will give you better browning), and sprinkle each fillet with 1 teaspoon panko. Slide the baking sheet back into the oven and broil until the hummus is browned, about 2 1/2 minutes.",
        "To serve, divide the salad among 4 dinner plates, spreading it out in the center of each plate. Sprinkle each salad with 1 teaspoon parsley and drizzle with 1/4 cup lemon oil. Set the salmon on top of the salad and serve."
    ],
    "ingredients": [
        "2 lemons, scrubbed",
        "4 garlic cloves, sliced",
        "2 tablespoons sliced shallots",
        "1 1/4 cups olive oil",
        "1/4 teaspoon kosher salt",
        "Pinch of coarse grind black pepper",
        "1 1/4 cups canned chickpeas, rinsed and drained",
        "1 teaspoon minced garlic",
        "2 tablespoons tahini",
        "1 tablespoon lemon juice",
        "1/4 teaspoon kosher salt",
        "Pinch of coarse grind black pepper",
        "1/4 cup olive oil",
        "1 cucumber, peeled, seeded, and sliced",
        "1/2 red onion, cut into thin half-moons",
        "1/4 pound haricots verts (thin green beans), blanched and refreshed in cold water",
        "4 teaspoons chopped fresh parsley",
        "5 tablespoons fine-ground cornmeal",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon fine sea salt",
        "4 (9- to 10-ounce) wild king salmon fillets, skin on",
        "Soybean oil",
        "Kosher salt",
        "4 teaspoons panko or coarse dry bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Fish",
        "Broil",
        "Mother's Day",
        "Dinner",
        "Lemon",
        "Salmon",
        "Cucumber",
        "Chickpea",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free"
    ],
    "title": "Hummus-Crusted Alaskan Wild King Salmon Over a Bed of French Beans, Red Onion, and Cucumber Salad with Lemon Oil",
    "url": "http://www.epicurious.com/recipes/food/views/hummus-crusted-alaskan-wild-king-salmon-over-a-bed-of-french-beans-red-onion-and-cucumber-salad-with-lemon-oil-51201240"
}
