{
    "directions": [
        "Preheat oven to 350°F.",
        "In a blender or small food processor purée 1/4 cup parsley with 1/4 cup oil. Pour mixture through a fine sieve set over a bowl, pressing hard on solids, and discard solids.",
        "In a small baking pan toast pine nuts and cumin seeds, stirring occasionally, until nuts are golden, about 10 minutes.",
        "In a colander rinse and drain chick-peas and in a food processor purée 1/2 cup with garlic until garlic is finely minced. Add tahini, water, lemon juice, salt, remaining chick-peas, and remaining 1/2 cup olive oil and purée until smooth. Recipe may be prepared up to this point 3 days ahead. Keep hummus and parsley oil chilled, covered, and pine nuts and cumin seeds in an airtight container at room temperature. Bring parsley oil to room temperature before using.",
        "Strip leaves from additional parsley sprigs. Divide hummus between 2 shallow dishes and smooth tops. Drizzle hummus with parsley oil and sprinkle with parsley, pine nuts, and cumin seeds.",
        "Serve hummus with pita toasts."
    ],
    "ingredients": [
        "1/4 cup packed fresh flat-leafed parsley sprigs plus 2 to 3 additional sprigs",
        "3/4 cup extra-virgin olive oil",
        "3 tablespoons pine nuts",
        "1 teaspoon cumin seeds",
        "two 19-ounce cans chick-peas",
        "4 garlic cloves",
        "2/3 cup well-stirred tahini",
        "2/3 cup water",
        "5 tablespoons fresh lemon juice",
        "1 teaspoon salt",
        "Accompaniment:spiced pita toasts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Quick & Easy",
        "Pine Nut",
        "Chickpea",
        "Sesame",
        "Parsley",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Hummus with Toasted Pine Nuts, Cumin Seeds, and Parsley Oil",
    "url": "http://www.epicurious.com/recipes/food/views/hummus-with-toasted-pine-nuts-cumin-seeds-and-parsley-oil-15229"
}
