{
    "directions": [
        "Combine the chicken and shrimp in a mixing bowl along with 4 teaspoons of soy sauce, 4 teaspoons rice wine, and 2 teaspoons sesame oil. Sprinkle with cornstarch, and mix until evenly combined. Set aside to marinate for 25 minutes.",
        "Heat half of the vegetable oil in a wok over high heat. Stir in the chicken and shrimp, and cook until the chicken has turned white on the outside and is still a bit pink in the center; about 5 minutes. Remove the chicken and wipe the wok clean.",
        "Heat the remaining vegetable oil over high heat. Stir in the garlic, and cook for a few seconds until the garlic begins to turn brown. Stir in the dried chiles and Szechwan peppercorns; cook and stir a few seconds until the peppers begin to darken. Add the red and green bell peppers, dark soy sauce, 2 tablespoons of rice wine, and 2 tablespoons of sugar. Bring to a boil, stir in the chicken, and cook until the peppers are nearly tender, and the chicken is no longer pink in the center, about 5 minutes more. Stir in the peanuts and green onion until the green onion becomes limp. Stir in a few drops of sesame oil to serve."
    ],
    "ingredients": [
        "4 skinless, boneless chicken breast halves - cut into 1 inch cubes",
        "20 peeled and deveined large shrimp (21 to 30 per pound)",
        "4 teaspoons soy sauce",
        "4 teaspoons rice wine",
        "2 teaspoons sesame oil",
        "1 tablespoon cornstarch",
        "1/2 cup vegetable oil, divided",
        "4 cloves garlic, minced",
        "16 dried red chile peppers, cut in half",
        "2 teaspoons Szechuan peppercorns (optional)",
        "1 red bell pepper, sliced",
        "1 green bell pepper, sliced",
        "1/4 cup dark soy sauce",
        "2 tablespoons rice wine",
        "2 teaspoons white sugar",
        "1 cup salted peanuts",
        "4 green onions, cut into 3 inch lengths",
        "2 dashes sesame oil, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hunan Kung Pao",
    "url": "http://allrecipes.com/recipe/167942/hunan-kung-pao/"
}
