{
    "directions": [
        "Preheat oven to 350°F and butter 2 (15- by 10- by 1-inch) baking pans. Line bottom and sides of each pan with a large sheet of wax paper and butter paper. Dust pans with flour, knocking out excess.",
        "Melt chocolate in a double boiler or a small metal bowl set over a small saucepan of barely simmering water, stirring occasionally. Remove from heat. Beat together butter and 1/2 cup sugar in a large bowl with an electric mixer until light and fluffy and beat in yolks, 1 at a time, beating well after each addition. Beat in chocolate. Sift in flour, cocoa, and salt and beat on low speed until combined well.",
        "Beat egg whites with cream of tartar in another bowl with clean beaters until they hold soft peaks, then add remaining 1/4 cup sugar, beating until whites just hold stiff peaks. Stir one fourth of whites into batter to lighten and fold in remaining whites gently but thoroughly.",
        "Divide batter between pans (about 2 1/4 cups per pan) and carefully spread evenly. (Layers will be thin.) Bake in upper and lower thirds of oven, switching position of pans halfway through baking, until cake is set and firm to touch, 14 to 18 minutes total. Cool layers in pans on racks 10 minutes before inverting racks over pans and flipping layers onto them. Remove wax paper carefully and discard. Spread jam evenly over 1 warm layer and cool layers completely. Transfer jam-coated layer to a baking sheet or tray lined with a sheet of parchment or wax paper.",
        "Bring cream just to a boil and slowly pour over chocolate in a bowl. Stir until smooth and pour over plain cake layer, spreading to coat top evenly. Let stand in a cool place until set, about 1 hour.",
        "Bring cream just to a boil and slowly pour over chocolate in a large metal bowl. Stir until smooth and set bowl in an ice bath. Stir occasionally until cold. Remove from ice bath and beat with an electric mixer until mousse just holds soft peaks. (If mousse becomes grainy, melt over a saucepan of barely simmering water and repeat chilling and whipping.) Quickly spread evenly over jam layer (mousse will stiffen as it stands) and chill while making whipped-cream filling.",
        "Sprinkle gelatin over water in a small metal bowl and let soften 1 minute. Put bowl over a small saucepan of boiling water and heat, stirring occasionally, until gelatin is dissolved. Remove pan from heat but keep bowl on pan.",
        "Beat cream, confectioners sugar, and vanilla with an electric mixer until it holds a soft shape and beat in warm gelatin mixture. Continue beating until cream just holds stiff peaks, then spread evenly over top of mousse-coated layer.",
        "Cut glazed layer lengthwise into thirds and crosswise into tenths and reassemble bars on top of cream filling. Chill cake, uncovered, until glaze is firm, about 1 hour, then cover with plastic wrap and chill until ready to serve. Just before serving, cut cake with a large knife, wiping it off with a hot damp cloth between cuts."
    ],
    "ingredients": [
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 stick unsalted butter, softened",
        "3/4 cup sugar",
        "6 large eggs, separated",
        "1/3 cup cake flour (not self-rising)",
        "1/3 cup unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon cream of tartar",
        "1/2 cup apricot jam, melted and strained",
        "1/3 cup heavy cream",
        "4 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped in a food processor",
        "3 cups heavy cream",
        "12 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped in a food processor",
        "1 teaspoon unflavored gelatin",
        "2 tablespoons cold water",
        "1 cup chilled heavy cream",
        "2 tablespoons confectioners sugar",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Winter",
        "Engagement Party",
        "Potluck",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hungarian Chocolate Mousse Cake Bars",
    "url": "http://www.epicurious.com/recipes/food/views/hungarian-chocolate-mousse-cake-bars-103080"
}
