{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line the bottom of a greased 9-inch springform pan with parchment paper. Then grease the parchment paper.",
        "Separate the eggs.",
        "In a food processor puree the chestnuts with the butter and the rum, scraping down the sides, until the mixture is smooth. Add the melted bittersweet chocolate and blend the mixture until it is combined well. With the motor running, add the yolks, 1 at a time, and transfer the mixture to a large bowl.",
        "In a bowl with an electric mixer beat the whites with the salt until they hold soft peaks, add the sugar, a little at a time, beating, and beat the meringue until it holds stiff peaks.",
        "Whisk about one fourth of the meringue into the chocolate mixture to lighten it and fold in the remaining  meringue gently but thoroughly. Pour the batter into the prepared pan and smooth the top.",
        "Bake the cake in the middle of a 350 degrees F (175 degrees C)  oven for 45 to 55 minutes, or until a tester comes out with crumbs adhering to it and the top is cracked. Let the cake cool in the pan on a rack for 5 minutes, remove the side of the pan, and invert the cake onto another rack. Remove the bottom of the pan, invert the torte onto a rack, and let it cool completely. (The cake will fall as it cools.)",
        "To Make Glaze: Put 6 ounces of the finely chopped chocolate in a small bowl, in a saucepan bring 1/2 cup of the cream to a boil, and pour it over the chocolate. Stir the mixture until the chocolate is melted and the glaze is smooth and stir in 1 tablespoon of the rum. Dip each candied chestnut halfway into the glaze to coat it partially, transfer the chestnuts to a foil-covered tray, and let them set.",
        "Invert the cake onto a rack set on wax paper, pour the glaze over it, smoothing the glaze with a spatula and letting the excess drip down the side, and let the cake stand for 2 hours, or until the glaze is set. Transfer the cake carefully to a serving plate and garnish it with the coated chestnuts.",
        "Make the whipped cream just before serving the cake: In a chilled bowl with chilled beaters beat the 1 cup heavy cream until it holds soft peaks, beat in the 2 tablespoons sugar and the1 tablespoon  rum, and beat the mixture until it holds stiff peaks. Fold in the chopped candied chestnuts. Serve the cake with the whipped cream."
    ],
    "ingredients": [
        "3/4 pound whole chestnuts, drained",
        "1/2 cup unsalted butter",
        "4 tablespoons dark rum",
        "10 (1 ounce) squares bittersweet chocolate, chopped",
        "6 eggs",
        "1/4 teaspoon salt",
        "1/2 cup white sugar",
        "6 (1 ounce) squares bittersweet chocolate, chopped",
        "1/2 cup heavy cream",
        "1 tablespoon dark rum",
        "8 marrons glaces (candied chestnuts)",
        "1 cup heavy cream, chilled",
        "2 tablespoons white sugar",
        "1 tablespoon dark rum",
        "3/4 cup chopped marrons glace (candied chestnuts)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hungarian Chestnut Cake",
    "url": "http://allrecipes.com/recipe/8202/hungarian-chestnut-cake/"
}
