{
    "directions": [
        "Preheat oven to 350°F. Butter and flour 9-inch-diameter springform pan. Line bottom with parchment paper. Blend first 4 ingredients in processor until nuts are ground as fine as flour.",
        "Using electric mixer, beat egg yolks, 1/3 cup sugar, and vanilla in large bowl until mixture falls in heavy ribbon when beaters are lifted, about 5 minutes. Using clean dry beaters, beat egg whites in another large bowl until soft peaks form. Gradually add 1/3 cup sugar, beating until stiff but not dry. Fold 1/4 of whites into yolk mixture to lighten. Fold in remaining whites. Sift half of flour mixture over; fold in gently. Sift remaining flour mixture over and fold in, adding any nuts from sifter. Drizzle butter over batter, folding in gently (do not overmix or batter will deflate).",
        "Transfer batter to prepared pan; bake until tester inserted into center comes out clean, about 35 minutes. Transfer pan to rack; cool cake 10 minutes. Cut around pan sides to loosen cake; release pan sides. Invert cake onto rack. Remove pan bottom and parchment paper. Cool.",
        "Place cornstarch in heavy small saucepan. Gradually add milk, stirring until cornstarch dissolves. Whisk in egg yolks. Whisk constantly over medium-high heat until custard comes to boil and thickens, about 3 minutes. Transfer to large bowl. Press plastic wrap onto surface of custard. Chill 30 minutes.",
        "Finely grind 1 cup nuts with powdered sugar in processor, about 30 seconds. Using electric mixer, beat vanilla into custard. Beat in butter, 1 piece at a time, then beat in ground nut mixture in 4 additions. Refrigerate until firm enough to spread, stirring often, about 30 minutes.",
        "Stir apricot preserves in small saucepan over medium heat for 1 minute. Push preserves, including fruit pieces, through strainer into small bowl. Cool.",
        "Finely chop 1/2 cup hazelnuts. Using long serrated knife, cut cake horizontally in half. Place 1 layer, cut side up, on 8-inch-diameter tart pan bottom or cardboard round. Spread evenly with apricot preserves. Top with second layer, cut side down. Transfer 3/4 cup buttercream to pastry bag fitted with large star tip. Spread remaining buttercream over top and sides of cake. Press 1/2 cup chopped hazelnuts onto sides of cake.",
        "Pipe 12 rosettes around top edge of torte. Place 1 hazelnut and 1 apricot sliver into each rosette. Refrigerate until buttercream sets, at least 1 hour. (Can be made 1 day ahead. Cover with cake dome; keep chilled. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2/3 cup hazelnuts, toasted, husked, cooled",
        "2/3 cup cake flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "6 large eggs, separated",
        "2/3 cup sugar",
        "1 teaspoon vanilla extract",
        "3 tablespoons unsalted butter, melted, cooled slightly",
        "4 teaspoons cornstarch",
        "2/3 cup whole milk",
        "2 large egg yolks",
        "1 1/2 cups hazelnuts, toasted, husked, cooled, plus 12 whole nuts, toasted, husked",
        "1 1/2 cups powdered sugar",
        "1 teaspoon vanilla extract",
        "1 cup (2 sticks) unsalted butter, cut into 16 pieces, room temperature",
        "1 cup apricot preserves",
        "3 dried apricots, cut into slivers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Apricot",
        "Fall",
        "Chill",
        "Hazelnut",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Soy Free",
        "Kosher"
    ],
    "title": "Hungarian Hazelnut Torte",
    "url": "http://www.epicurious.com/recipes/food/views/hungarian-hazelnut-torte-107166"
}
