{
    "directions": [
        "Place porcini in small bowl. Add 3/4 cup hot water and let stand 45 minutes. Strain through fine sieve, reserving soaking liquid. Coarsely chop porcini.",
        "Heat 1 tablespoon oil in heavy medium nonstick skillet over medium-high heat. Add chopped porcini and garlic; sauté 2 minutes. Add reserved porcini soaking liquid and paprika; cook until liquid evaporates, stirring frequently, about 3 minutes. Season with salt and pepper. Cool. (Mushroom mixture can be made 1 day ahead. Cover and refrigerate.)",
        "Finely grate potatoes by hand or in processor fitted with grating disk. Transfer potatoes to large bowl. Add enough cold water to cover; let stand 5 minutes. Drain potatoes. Wrap in dry kitchen towel; twist ends to squeeze out as much liquid as possible. Place potatoes in large bowl. Mix in egg, breadcrumbs, salt, and pepper. Stir in mushroom mixture.",
        "Heat 6 tablespoons olive oil in heavy large skillet (preferably cast-iron) over medium-high heat until hot but not smoking. Working in batches, drop potato mixture by 1/4 cupfuls into hot oil, spacing apart. Using spatula, flatten each into 4-inch round and cook until crisp and brown, about 4 minutes per side. Using slotted spatula, transfer latkes to paper towels to drain. Add more oil to skillet as necessary and allow oil to get hot before adding more potato mixture. Transfer to plates and serve.",
        "*Available at Italian markets, specialty foods stores and many supermarkets."
    ],
    "ingredients": [
        "1/2 ounce dried porcini mushrooms*",
        "3/4 cup hot water",
        "7 tablespoons (or more) olive oil",
        "2 garlic cloves, finely chopped",
        "1 teaspoon Hungarian hot paprika",
        "1 1/2 pounds russet potatoes, peeled",
        "1 large egg, beaten to blend",
        "2 tablespoons fresh breadcrumbs, preferably made from egg bread",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Brunch",
        "Side",
        "Fry",
        "Hanukkah",
        "Winter",
        "Pan-Fry",
        "Kosher",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Hungarian Porcini-Potato Latkes",
    "url": "http://www.epicurious.com/recipes/food/views/hungarian-porcini-potato-latkes-106002"
}
