{
    "directions": [
        "Heat 2 teaspoons of olive oil in a large pot over low heat, and cook and stir the garlic until tender but not browned, about 3 minutes. Pour in the tomatoes with their juice, and mash with a potato masher to leave the tomatoes in chunks. Stir in tomato paste, red wine, sugar, oregano, basil, salt, and black pepper, and mix until the tomato paste is smoothly combined into the sauce. Bring to a simmer, and cook, stirring often, while you prepare the vegetables.",
        "Heat 1 tablespoon of olive oil in a skillet over medium heat, and cook and stir the carrot and celery until tender, 5 to 8 minutes. Stir into the sauce. In the same skillet, cook and stir the green peppers and onions until the onions are translucent,  5 to 8 more minutes; mix them to the sauce. Heat 1 more tablespoon of olive oil in the skillet, and cook and stir the mushrooms until they give up their liquid, about 10 minutes; stir the mushrooms into the sauce. Allow sauce to simmer while you cook the chicken.",
        "Beat the eggs in a bowl. Place the flour in a separate shallow bowl. Heat 1/4 cup of olive oil in a large skillet over medium heat. Dip chicken pieces in egg, then dredge in flour. Tap off any excess flour, and brown the chicken pieces in the hot oil until browned on both sides, about 15 minutes. Set the chicken pieces aside.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Spoon about 1 cup of the tomato sauce into the bottom of a large Dutch oven. Place the chicken pieces into the Dutch oven, and pour remaining sauce and vegetables over the chicken; cover.",
        "Bake in the preheated oven until the chicken is tender and no longer pink inside, about 1 hour. If sauce begins to boil harder than a simmer, reduce oven heat to 300 degrees F (150 degrees C).",
        "About 15 minutes before serving time, bring a large pot of lightly salted water to a boil. Stir in the linguine pasta, bring back to a boil, and cook, stirring often, until the linguine is tender but still slightly firm, 10 to 12 minutes. Drain the pasta well.",
        "Turn the linguine out onto a large platter, and top with the chicken and sauce. Sprinkle with parsley and Parmesan cheese to serve."
    ],
    "ingredients": [
        "2 teaspoons olive oil",
        "6 cloves garlic, sliced",
        "2 (28 ounce) cans whole peeled plum tomatoes with juice",
        "1 (6 ounce) can tomato paste",
        "3/4 cup red wine",
        "1 tablespoon white sugar",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 tablespoons olive oil, divided",
        "1 carrot, chopped",
        "1 stalk celery, chopped",
        "2 green bell peppers, cut into chunks",
        "2 onions, cut into chunks",
        "1 pound fresh mushrooms, sliced",
        "2 eggs",
        "2 cups all-purpose flour",
        "1/4 cup olive oil",
        "5 pounds skinless, boneless chicken pieces",
        "1 1/2 pounds dry linguine pasta",
        "1/2 cup chopped fresh parsley",
        "1 tablespoon freshly shredded Parmesan cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hunter Style Chicken Cacciatore",
    "url": "http://allrecipes.com/recipe/219757/hunter-style-chicken-cacciatore/"
}
