{
    "directions": [
        "In a saucepan simmer lentils in water to cover by 2 inches until tender but not falling apart, 15 to 20 minutes, and drain well. Transfer hot lentils to a bowl and stir in 1 tablespoon lemon juice and salt and pepper to taste. Cool lentils, stirring occasionally.",
        "In saucepan bring 1 1/4 cups water to a boil and stir in couscous and salt. Remove pan from heat and let couscous stand, covered, 5 minutes. Fluff couscous with a fork and transfer to a large bowl. Stir in 1 tablespoon oil and cool, stirring occasionally.",
        "Mince and mash garlic with salt to taste and in a small bowl whisk together with remaining 2 tablespoons lemon juice and 3 tablespoons oil and salt and pepper to taste. Stir lentils and dressing into couscous. Chill salad, covered, at least 3 hours and up to 24.",
        "Just before serving, shred romaine and cut lemon and each tomato into 6 wedges. Stir mint and cheese into salad and season with salt and pepper. Arrange romaine on a platter and top with salad. Arrange tomato and lemon wedges around salad."
    ],
    "ingredients": [
        "1 cup lentils",
        "3 tablespoons fresh lemon juice",
        "1 1/4 cups water",
        "1 cup couscous",
        "1/2 teaspoon salt",
        "1/4 cup olive oil",
        "1 large garlic clove",
        "1 small head romaine",
        "1 lemon",
        "6 plum tomatoes",
        "1/4 cup chopped fresh mint leaves",
        "3/4 cup crumbled Roquefort or other blue cheese (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Cheese",
        "Leafy Green",
        "Herb",
        "Pasta",
        "Tomato",
        "Side",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Hurricane Marilyn's Couscous and Lentil Salad",
    "url": "http://www.epicurious.com/recipes/food/views/hurricane-marilyns-couscous-and-lentil-salad-14177"
}
