{
    "directions": [
        "Brown the sausage in a skillet over medium heat, discard the fat in the skillet, and drain the sausage slices on paper towels to absorb any excess grease. Set the sausage aside. Cook and stir the chopped bacon in the skillet until crisp, 6 to 8 minutes, remove the bacon, and set aside. Stir the okra into the hot bacon drippings, and cook and stir until the okra is tender, about 5 minutes. Drain the okra in a colander, and discard bacon drippings.",
        "Place the okra and diced tomatoes in a saucepan over medium heat, and bring to a simmer. Reduce heat to medium-low, and simmer the okra mixture for about 10 minutes.",
        "In a large soup pot, melt the butter over medium heat, and cook and stir the onion, green onions, green pepper, celery, parsley, and garlic until the onion begins to turn brown, about 10 minutes. Remove the vegetables but leave the butter in the pot. Stir in the flour, reduce heat to low, and cook the roux, stirring constantly, until it turns the color of milk chocolate, 30 to 45 minutes. Do not let the roux burn.",
        "When the roux reaches its correct color, whisk in 2 cups of water. Raise the heat to medium; stir in salt, pepper, cayenne pepper, thyme, and bay leaves, bring the mixture to a boil, and stir in the sausage, bacon, okra-tomato mixture, and 6 more cups of water. Reduce heat to medium-low, and simmer the gumbo, stirring occasionally, until the soup has thickened and the flavors are blended, about 45 minutes. Stir in the shrimp, and simmer until they turn pink and opaque, 6 to 8 more minutes. Discard bay leaves and adjust the seasonings, if desired, before serving."
    ],
    "ingredients": [
        "1 pound smoked sausage links, cut into 1/4-inch slices",
        "1/4 pound bacon, chopped",
        "2 cups chopped okra",
        "1 (14.5 ounce) can diced tomatoes with green chile peppers",
        "1/2 cup unsalted butter",
        "2/3 cup all-purpose flour",
        "2 cups chopped onion",
        "1/2 cup chopped green onions",
        "2/3 cup finely chopped green bell pepper",
        "2/3 cup finely chopped celery",
        "2 tablespoons chopped fresh parsley",
        "2 tablespoons minced garlic",
        "2 cups water",
        "salt to taste",
        "ground black pepper to taste",
        "1/4 teaspoon cayenne pepper",
        "1 teaspoon dried thyme",
        "2 bay leaves",
        "6 cups water",
        "2 pounds uncooked medium shrimp, peeled and deveined"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Husband's Grandmother's Shrimp Gumbo",
    "url": "http://allrecipes.com/recipe/213572/husbands-grandmothers-shrimp-gumbo/"
}
