{
    "directions": [
        "Whisk flour, cornmeal, sugar, baking powder, salt, garlic powder, onion powder, and pepper in a large bowl to combine. Add butter and work in with a pastry blender or your fingers until mixture resembles coarse meal (the largest butter pieces should be no bigger than a pea).",
        "Make a well in the center of flour mixture and add egg and buttermilk to well. Gradually incorporate into dry ingredients, mixing from the center out, until a smooth batter forms. Add onion and jalapeño and mix gently just to evenly disperse (be careful not to overmix).",
        "Pour oil into a large heavy saucepan to come halfway up sides and fit with thermometer. Heat oil over medium-high until thermometer registers 350°F. Using a 1-oz. scoop or a tablespoon and working in 2–3 batches, carefully drop balls of batter into oil and fry, turning often with a spider or a slotted spoon and adjusting heat to maintain temperature, until hushpuppies are puffed and deep golden all over, about 4 minutes. Transfer to paper towels to drain and let cool slightly.",
        "Serve warm hushpuppies with tartar sauce alongside for dipping.",
        "Batter can be made 2 hours ahead. Cover and chill. Scoop cold batter directly into hot oil and fry."
    ],
    "ingredients": [
        "3/4 cup all-purpose flour",
        "3/4 cup fine-grind cornmeal",
        "2 teaspoons sugar",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon freshly ground black pepper",
        "4 tablespoons chilled unsalted butter, cut into pieces",
        "1 large egg, beaten to blend",
        "1 cup buttermilk",
        "1/2 small onion, finely chopped",
        "1 jalapeño, seeded if desired, finely chopped",
        "Vegetable oil (for frying; about 6 cups)",
        "Buxton Hall Tartar Sauce (for serving)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Hominy/Cornmeal/Masa",
        "Buttermilk",
        "Side",
        "Bread",
        "Fry",
        "Deep-Fry"
    ],
    "title": "Hushpuppies",
    "url": "http://www.epicurious.com/recipes/food/views/hushpuppies"
}
