{
    "directions": [
        "Place black peppercorns, cloves, cardamom, cinnamon sticks, star anise, and kala jeera in a spice grinder; grind into a fine powder.",
        "Place cilantro and mint leaves in a food processor; pulse until coarsely chopped.",
        "Combine spice powder, cilantro-mint mixture, yogurt, lemon juice, ginger-garlic paste, chile powder, biryani masala powder, and turmeric in a large bowl. Add chicken; turn to coat evenly. Cover with plastic wrap and let marinate in the refrigerator, about 2 hours.",
        "Bring water and rice to a boil in a saucepan; add 2 bay leaves. Reduce heat to medium-low, cover, and simmer until rice is partially cooked through and still firm, about 5 minutes. Drain.",
        "Combine milk and saffron in a small bowl; stir to combine.",
        "Heat ghee in a large pot with a tight-fitting lid over medium-high heat. Add onions; cook and stir until golden brown, about 15 minutes. Drain on paper towels. Reduce heat to low. Add remaining 2 bay leaves and chile peppers; cook and stir until fragrant, 1 to 2 minutes. Carefully remove 1 tablespoon of ghee from the pot; set it aside.",
        "Wipe excess marinade off the chicken, discarding marinade, and add to the pot. Cook over medium heat until no longer pink, about 2 minutes per side. Spread drained rice on top. Sprinkle onions on top of the rice. Drizzle reserved ghee and saffron milk over onions and rice.",
        "Cover the pot and cook over high heat, about 8 minutes. Reduce heat to low and continue cooking, about 5 minutes. Remove from heat and let stand, covered, until rice is tender and an instant-read thermometer inserted into the chicken reads 165 degrees F (74 degrees C), about 15 minutes."
    ],
    "ingredients": [
        "Marinade:",
        "10 black peppercorns",
        "6 whole cloves",
        "5 cardamom pods",
        "2 cinnamon sticks",
        "2 whole star anise pods",
        "1/2 teaspoon kala jeera (black cumin seeds)",
        "1 bunch fresh cilantro leaves",
        "1 bunch fresh mint leaves",
        "1 cup plain yogurt",
        "2 teaspoons lemon juice",
        "2 teaspoons ginger-garlic paste",
        "2 teaspoons chile powder",
        "1 teaspoon biryani masala powder (such as Dunya®)",
        "1/4 teaspoon ground turmeric",
        "1 pound chicken thighs",
        "Biryani:",
        "3 1/2 cups water",
        "2 1/3 cups basmati rice",
        "4 bay leaves, divided",
        "1/2 cup warm milk",
        "1 pinch saffron threads",
        "1/4 cup ghee (clarified butter), divided",
        "2 onions, thinly sliced",
        "2 green chile peppers, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hyderabad Dum Biryani",
    "url": "http://allrecipes.com/recipe/246558/hyderabad-dum-biryani/"
}
