{
    "directions": [
        "Combine the lamb, water, cinnamon stick, turmeric, and salt in a large skillet over medium heat; cook while breaking the lamb into small pieces until the meat is no longer pink and the liquid has evaporated, about 20 minutes. Set aside until cool enough to handle; remove and discard the cinnamon stick.",
        "Mix the cooked lamb, onion, beaten egg, chickpea flour, ginger garlic paste, green chile peppers, coriander, garam masala, cumin, and ground red pepper together in a large bowl until evenly mixed. Refrigerate at least 30 minutes.",
        "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold.",
        "Divide the lamb mixture into 8 even portions. Take one portion of meat and flatten the meat in your palm like a cutlet. Put a hard boiled egg in the center and wrap the meat tightly around it. Tie a piece of food-safe string around the wrapped egg. Repeat with the rest of the eggs and meat. Refrigerate the eggs again overnight or 8 hours.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry each kofta in the hot oil until slightly crispy on the outside, 10 to 15 minutes. Cut and remove the string. Halve the koftas lengthwise and sprinkle with chaat masala and cilantro. Serve with lime wedges on the side."
    ],
    "ingredients": [
        "1 1/4 pounds ground lamb",
        "1 cup water",
        "1 cinnamon stick",
        "1/4 teaspoon ground turmeric",
        "salt to taste",
        "1 onion, minced",
        "1 egg, beaten",
        "3 tablespoons chickpea flour",
        "1 tablespoon ginger garlic paste",
        "3 green chile peppers, minced",
        "1 teaspoon ground coriander",
        "1 teaspoon garam masala",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground red pepper",
        "8 eggs",
        "oil for deep frying",
        "1 teaspoon chaat masala",
        "1/2 cup chopped fresh cilantro",
        "8 wedges lime, as garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Hyderabadi Nargisi Kofta",
    "url": "http://allrecipes.com/recipe/212445/hyderabadi-nargisi-kofta/"
}
