{
    "directions": [
        "In large saucepan over moderately low flame, heat oil until hot but not smoking. Add onion and garlic and sauté, stirring, until translucent, 5 to 7 minutes. Add beets, potato, and celery, and stir to combine. Cover saucepan, reduce heat to low, and cook until beets begin to soften, about 5 minutes. Add stock, basil, thyme, salt, and pepper. Raise heat to moderate and bring to simmer. Reduce heat to moderately low, simmer covered until beets are very tender, about 25 minutes.",
        "Using blender, purée soup in batches until very smooth, transferring to large bowl (use caution when blending hot liquids). Taste and add additional salt and pepper if desired.",
        "Divide soup among 6 to 8 bowls. Top each portion with dollop of yogurt or use squeeze bottle to drizzle yogurt over each bowl. Sprinkle with chives or scallions and serve."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1 medium onion, peeled and finely chopped (about 2 cups)",
        "2 large or 3 small cloves garlic, peeled and finely chopped",
        "6 medium beets (about 1 1/2 pounds), finely chopped",
        "1 small baking potato, peeled and finely chopped",
        "1 large celery stalk, finely chopped",
        "5 cups vegetable stock",
        "1 tablespoon fresh basil leaves, chopped or 1 teaspoon dried",
        "1 tablespoon fresh thyme leaves, chopped or 1 teaspoon dried",
        "1/2 teaspoon sea salt",
        "1/4 teaspoon freshly ground black pepper",
        "Approximately 1/3 cup plain nonfat or low-fat yogurt for garnish",
        "Approximately 3 tablespoons chives or scallion greens, chopped for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Garlic",
        "Herb",
        "Onion",
        "Potato",
        "Vegetable",
        "Sauté",
        "Vegetarian",
        "Yogurt",
        "Healthy"
    ],
    "title": "La Puerta Garden Beet Soup",
    "url": "http://www.epicurious.com/recipes/food/views/la-puerta-garden-beet-soup-236643"
}
