{
    "directions": [
        "Line 3 buttered 9-inch round cake pans with rounds of wax paper, butter the paper, and dust the pans with flour, knocking out the excess. In a large bowl with an electric mixer cream the butter with the sugar until the mixture is light and fluffy and beat in the vanilla and the almond extract. In a bowl stir together the flour, the baking powder, and the salt, add the flour mixture to the butter mixture in batches alternately with the milk, and stir the batter until it is just combined. In another large bowl beat the egg whites with the cream of tartar and a pinch of salt until they just hold stiff peaks, stir one third of them into the batter, and fold in the remaining whites gently but thoroughly. Divide the batter among the prepared pans, smoothing the tops, and bake the cake layers, in batches if necessary, in the middle of a preheated 325°F. oven for 25 to 35 minutes, or until a tester comes out clean. Let the cake layers cool in the pans on racks for 5 minutes, turn them out onto the racks, and let them cool completely. The cake layers may be made 1 week in advance and kept wrapped well in plastic wrap and frozen. Let the layers thaw before proceeding with the recipe.",
        "In a small saucepan combine the sugar and the water, bring the mixture to a boil, stirring until the sugar is dissolved, and boil the syrup until it registers 248°F. on a candy thermometer. While the syrup is boiling, in a large bowl with an electric mixer beat the egg whites with a pinch of salt until they hold soft peaks and with the mixer running add the hot syrup in a stream. Beat in the vanilla and beat the icing until it is cool. Transfer 2 cups of the icing to a bowl, reserving the remaining icing, and fold in the chopped figs, the chopped pecans, and the raisins.",
        "Arrange 1 of the cake layers, flat side up, on a serving plate, spread it with half the dried-fruit icing, and top the filling with another cake layer, flat side down. Spread the top layer with the remaining dried-fruit icing and top the filling with the remaining cake layer. Spread the top and side of the cake with the reserved plain icing and garnish the cake with the sliced figs and the pecan halves."
    ],
    "ingredients": [
        "2 sticks (1 cup) unsalted butter, softened",
        "2 cups sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "3 cups all-purpose flour",
        "1 tablespoon double-acting baking powder",
        "1/2 teaspoon salt",
        "1 cup milk",
        "7 large egg whites",
        "1/4 teaspoon cream of tartar",
        "2 cups sugar",
        "3/4 cup water",
        "6 large egg whites",
        "2 teaspoons vanilla extract",
        "1/2 cup finely chopped dried figs plus sliced dried figs for garnish",
        "1 cup pecans, toasted lightly and chopped fine, plus pecan halves for garnish",
        "1/2 cup raisins, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Thanksgiving",
        "Kid-Friendly",
        "Raisin",
        "Fig",
        "Pecan",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lady Baltimore Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lady-baltimore-cake-13353"
}
