{
    "directions": [
        "Heat a large skillet over medium-high heat. Combine the garlic, onion, basil, parsley, mint, paprika, cumin, coriander, diced bell peppers, lemon juice, and olive oil in a food processor. Pulse the vegetables until finely chopped. Add the halved tomatoes and process until the mixture is a thick puree.",
        "Place the lamb in the preheated skillet and reduce the heat to medium. Add the puree and the tomato paste and mix well. Cook and stir until the lamb is cooked through, 10 to 15 minutes. Stir in cayenne pepper and salt to taste. Transfer the mixture to a shallow baking dish to cool to room temperature. Cover with plastic wrap and refrigerate overnight.",
        "Dissolve the yeast and sugar in 1 cup warm water. Combine the flour and salt in a mixing bowl and stir well. Add the vegetable oil and 1/2 cup water to the yeast mixture and pour it over the flour. Use your hands to mix the dough. Turn the dough out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Shape the dough into a ball and transfer to an oiled bowl. Cover with a wet towel and let rise in a warm place until doubled in bulk, about 1 hour. Remove the lamb sauce from the refrigerator and allow it to come up to room temperature. Prepare the garlic sauce: combine the yogurt, parsley, crushed garlic, and salt and pepper to taste. Stir well and set aside.",
        "Punch the dough down, transfer it to a floured work surface, and cut the dough into 10 portions. Shape each portion into a round. Flatten each round with your hand; use a rolling pin to roll each piece into a 10-inch circle. The dough should be thin, like a crepe. Place the rounds on parchment paper.",
        "Preheat an oven to 500 degrees F (260 degrees C).",
        "Stir the lamb sauce and then spoon it onto a dough round. Spread it thinly to the edges and press down lightly so it sticks to the dough. Bake pizzas on parchment paper-lined baking sheets on the lowest oven rack until the edges are a light tan color, 8 to 10 minutes.",
        "Place on a wire rack to cool. The pizzas can be stored in an airtight container in the refrigerator for three days or in the freezer for three months. To reheat, place the pizzas in a 350 degree F oven (175 degrees C) for 8 minutes.",
        "To assemble the lahmacun, drizzle with garlic sauce, top with shredded cabbage, and roll up to eat. See the Cook's Notes for other garnish ideas."
    ],
    "ingredients": [
        "For the Lamb Sauce:",
        "1 teaspoon chopped garlic",
        "1 yellow onion, chopped",
        "3 tablespoons chopped fresh basil",
        "1/2 cup chopped fresh parsley",
        "2 tablespoons chopped fresh mint",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander seed",
        "1/2 cup green bell pepper, diced",
        "1/2 cup red bell pepper, diced",
        "1/2 lemon, juiced",
        "4 teaspoons olive oil",
        "4 roma (plum) tomatoes, halved",
        "1 pound lean ground lamb",
        "6 tablespoons double concentrated tomato paste",
        "cayenne pepper to taste",
        "salt to taste",
        "For the Dough:",
        "3 1/4 teaspoons active dry yeast",
        "1/2 teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "5 cups all-purpose flour",
        "2 teaspoons salt",
        "1/4 cup vegetable oil",
        "1/2 cup water",
        "For the Garlic Sauce:",
        "1 cup plain yogurt",
        "1/2 teaspoon chopped fresh parsley",
        "1/4 teaspoon crushed garlic",
        "salt and ground black pepper to taste",
        "For the Garnish:",
        "1 cup shredded green cabbage",
        "1 cup shredded red cabbage"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lahmacun Turkish Pizza",
    "url": "http://allrecipes.com/recipe/215594/lahmacun-turkish-pizza/"
}
