{
    "directions": [
        "Heat oil in a large skillet over medium-high heat. Add onion, garlic, and serrano chile and cook, stirring often, until beginning to brown, about 4 minutes. Add tomatoes, breaking them up with your hands, piquillo peppers, brown sugar, vinegar, and cumin; season with salt and pepper. Bring to a boil, reduce heat, and simmer, stirring often and mashing with a potato masher (or a spoon), until thickened, 15–20 minutes. Let cool slightly, then purée in a blender until smooth; season with salt and pepper to taste.",
        "Heat butter in a large skillet over medium-high heat until golden brown, about 3 minutes. Add onion and garlic and cook, stirring often, until softened, 5–8 minutes. Add lamb, beef, Aleppo pepper, ras-el-hanout, and cumin; season with salt and pepper. Cook, breaking up with a spoon, until browned, 6–8 minutes. Transfer to a plate and let cool.",
        "Place a rack in lower third of oven and preheat to 500°F. Cut dough into 4 pieces. Working with 1 piece at a time and keeping remaining pieces covered, gently stretch dough into 12\" rounds and transfer to parchment-lined baking sheets. (If dough springs back, let rest 10 minutes, then stretch again, resting as needed, until dough is thin).",
        "Spread each round of dough with a layer of tomato sauce; season with salt and pepper and top with a thin layer of meat mixture. Working in batches, cook lahmacun until crusts are browned and crisp, 10–12 minutes.",
        "Toss parsley and lemon juice in a small bowl. Top each lahmacun with parsley mixture and drizzle with oil.",
        "DO AHEAD: Sauce and meat mixture can be made 1 day ahead. Cover separately and keep chilled."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 small onion, chopped",
        "1 garlic clove, chopped",
        "1/2 serrano chile, seeded, chopped",
        "1 14-ounce can whole peeled tomatoes",
        "1/4 cup canned piquillo peppers, chopped",
        "2 teaspoons light brown sugar",
        "2 teaspoons red wine vinegar",
        "1/2 teaspoon ground cumin",
        "Kosher salt, freshly ground pepper",
        "1/2 cup (1 stick) unsalted butter",
        "1 small onion, finely chopped",
        "4 garlic cloves, finely chopped",
        "1/2 pound ground lamb",
        "1/4 pound ground beef",
        "1 teaspoon Aleppo pepper",
        "1 teaspoon ras-el-hanout",
        "1/2 teaspoon ground cumin",
        "Kosher salt, freshly ground pepper",
        "1/2 pound pizza dough, room temperature",
        "Kosher salt, freshly ground black pepper",
        "1 cup fresh flat-leaf parsley leaves",
        "1 tablespoon fresh lemon juice",
        "Olive oil (for drizzling)",
        "Ingredient info: Ras-el-hanout, a Moroccan spice blend, and Aleppo pepper are available at specialty foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Lamb",
        "Tomato",
        "Bake",
        "Dinner",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lahmacun",
    "url": "http://www.epicurious.com/recipes/food/views/lahmacun-51198810"
}
