{
    "directions": [
        "Place ground lamb, rice, 1/4 cups olive oil, mint, currants, pine nuts, salt, pepper, cumin, cinnamon, oregano, and egg in a bowl. Mix together thoroughly with a fork. Cover and refrigerate until ready to use.",
        "Gently unroll and separate grape leaves. Rinse in cold water to remove brine. Drain. Reserve broken or less-than-perfect leaves to line pot.",
        "Place grape leaves on work surface with smooth side down (ribs of leaves up). Place a rounded tablespoon of lamb-rice filling near bottom-center of grape leaf. Fold bottom sections of leaf over mixture, fold over sides, and roll toward the top of the leaf into a firm cylinder. Don't roll too tightly or leaves may burst when rice cooks.",
        "Drizzle 1 tablespoon olive oil into pot; line bottom of pot with 1 or 2 layers of reserved grape leaves. Place dolmas in pot by arranging them along the sides then working toward the center to cover the bottom. Leave enough space between dolmas to allow for expansion, but close enough to hold their shapes when cooking. If necessary, make two layers. Pour in lemon juice and 2 teaspoons olive oil.",
        "Invert a small plate and then a larger plate over the dolmas to weight them down while they cook. Pour in hot chicken broth. Bring to a simmer, uncovered, over medium-high heat. As soon as liquid is heated through and starting to bubble (2 to 4 minutes), reduce heat to low, cover, and cook 35 minutes. Remove plates and check for doneness. Dolmas should look a bit puffed up, and a fork should pierce them easily. If not quite done, continue cooking without the plates, covered, until rice is tender, 10 to 15 minutes longer."
    ],
    "ingredients": [
        "1/2 pound ground lamb",
        "1/2 cup uncooked long grain rice",
        "1/4 cup olive oil",
        "2 tablespoons chopped fresh mint",
        "1 tablespoon dried currants",
        "1 tablespoon pine nuts",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon dried oregano",
        "1 large egg",
        "1 (16 ounce) jar grape leaves",
        "1 tablespoon olive oil",
        "juice of one lemon",
        "4 cups hot chicken broth",
        "2 teaspoons olive oil, or as desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamb and Rice Stuffed Grape Leaves",
    "url": "http://allrecipes.com/recipe/244551/lamb-and-rice-stuffed-grape-leaves/"
}
