{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Combine kosher salt, black pepper, Italian seasoning, dried rosemary, granulated garlic, granulated onion, and lemon pepper together in a small bowl.",
        "Place lamb in a large roasting pan. Rub with lemon juice, 1 tablespoon olive oil, red wine, and Worcestershire sauce on all sides and between any crevices. Sprinkle with kosher salt mixture and rub over all sides. Pour white wine, chicken stock, 4 crushed garlic cloves, bay leaves, capers, and anchovies into the bottom of the roasting pan.",
        "Cover pan tightly with heavy-duty aluminum foil and roast lamb in the preheated oven until tender but still pink in the center, 1 1/2 to 2 hours. An instant-read thermometer inserted into the center of the meat should read 130 degrees F (54 degrees C).",
        "Remove lamb to a cutting board and allow to cool slightly before slicing. Transfer meat to a large bowl and toss with some of the pan juices to keep it moist. Reserve remaining pan juices.",
        "Increase oven temperature to 500 degrees F (260 degrees C).",
        "Mix sour cream, horseradish, mustard, and garlic basil spread in a small bowl until combined. Cover and refrigerate.",
        "Heat 2 tablespoons olive oil in a large pot or Dutch oven over medium-high heat; cook and stir onions until they soften and begin to turn golden, about 12 minutes. Pour in Marsala wine and cook until reduced, about 5 minutes.",
        "Stir mushrooms, Kalamata olives, 2 tablespoons minced garlic, fresh rosemary, and red pepper flakes into onion mixture; cook and stir until mushrooms have softened, about 5 minutes. Add lamb slices and reserved pan juices. Cook, stirring to combine, until heated through, about 10 minutes.",
        "Spread each hoagie bun with horseradish sauce. Spoon lamb mixture into buns and top each sandwich with 1/4 of the lettuce, cherry tomatoes, Asiago cheese, and feta cheese. Serve with remaining pan juices for dipping."
    ],
    "ingredients": [
        "Roast Lamb:",
        "1/4 cup kosher salt",
        "1/4 cup freshly ground black pepper",
        "1/4 cup Italian seasoning",
        "2 tablespoons dried rosemary",
        "2 tablespoons granulated garlic",
        "2 tablespoons granulated onion",
        "1 tablespoon lemon pepper",
        "1 (4 pound) boneless leg of lamb",
        "1 lemon, juiced",
        "1 tablespoon olive oil",
        "1 tablespoon red wine",
        "1 tablespoon Worcestershire sauce",
        "2 cups dry white wine",
        "2 cups chicken stock",
        "4 cloves garlic, crushed",
        "3 bay leaves",
        "2 tablespoons capers",
        "2 anchovy fillets, diced (optional)",
        "Horseradish Cream:",
        "1 cup sour cream",
        "1/4 cup prepared horseradish",
        "2 tablespoons sweet hot mustard",
        "1 tablespoon garlic basil spread (see footnote for recipe link)",
        "Filling:",
        "2 tablespoons olive oil",
        "2 onions, sliced",
        "1/4 cup Marsala wine",
        "1 cup sliced mushrooms",
        "1/2 cup Kalamata olives, pitted and sliced in half",
        "2 tablespoons minced garlic",
        "2 teaspoons chopped fresh rosemary",
        "2 teaspoons red pepper flakes",
        "Assembly:",
        "4 Italian-style hoagie buns, split lengthwise",
        "1 head romaine lettuce, chopped - divided",
        "2 cups halved cherry tomatoes, divided",
        "1 cup shredded Asiago cheese, divided",
        "1 cup crumbled feta cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamb Grinder",
    "url": "http://allrecipes.com/recipe/230490/lamb-grinder/"
}
