{
    "directions": [
        "In a small saucepan combine potato, peeled and cut into 1/2-inch pieces, with water to cover and boil until tender, about 10 minutes. Add beans and simmer 2 minutes. Drain mixture well, reserving about 1/3 cup cooking water, and force through a ricer or food mill back into pan. Stir in 1/2 tablespoon oil, about one third garlic paste, salt and pepper to taste, and enough reserved cooking water to reach desired consistency and keep warm.",
        "In a shallow dish dredge lamb medallions in flour, shaking off excess. In a heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté lamb about 3 minutes on each side for medium-rare meat. Transfer lamb to a plate and keep warm.",
        "To skillet add shallot and remaining garlic paste and cook over moderately low heat, stirring, until softened. Deglaze skillet with wine over high heat, scraping up browned bits, and boil until reduced by about half. Stir in mustard, broth, and cream and simmer until thickened. Stir in parsley.",
        "Divide purée between 2 plates and top with lamb and sauce."
    ],
    "ingredients": [
        "1 medium russet (baking) potato (about 1/2 pound)",
        "1 cup drained canned white beans",
        "1 1/2 tablespoons olive oil",
        "1 large garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "four 1-inch-thick loin lamb chops, boned and tied",
        "3 Tablespoons finely chopped shallot",
        "all-purpose flour seasoned with salt and pepper for dredging",
        "1/4 cup dry red wine",
        "1/2 teaspoon Dijon mustard",
        "1/3 cup chicken or beef broth",
        "3 tablespoons heavy cream",
        "1 tablespoon minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Lamb",
        "Potato",
        "Sauté",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Lamb Medallions with White-Bean Potato Purée and Red-Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-medallions-with-white-bean-potato-puree-and-red-wine-sauce-10674"
}
