{
    "directions": [
        "Place green onions, sugar, chopped garlic, and sliced ginger in processor and blend until finely chopped, stopping occasionally to scrape down sides of bowl. Transfer mixture to medium bowl. Add soy sauce, mirin, Asian sesame oil, toasted sesame seeds, and black pepper; whisk marinade to blend. Pour 1 cup marinade into 15x10x2-inch glass baking dish. Open boned leg of lamb like book; add to baking dish, arranging in single layer. Pour remaining marinade over lamb, spreading to cover evenly. Cover and refrigerate at least 4 hours and up to 1 day, turning lamb occasionally.",
        "Puree Asian pear and chopped green onions in processor until smooth. Add soy sauce, mirin, and sugar and process until sugar dissolves. Add Asian sesame oil and 2 tablespoons toasted sesame seeds; process until sesame oil is incorporated (most sesame seeds will remain intact). Transfer sauce to 2-cup measuring cup. Season sauce to taste with salt and pepper. DO AHEAD: Dipping sauce can be made 1 day ahead. Cover and refrigerate.",
        "Coat grill rack with nonstick spray; prepare barbecue (medium heat). Thread jalapeño chile halves onto 2 metal skewers, dividing equally. Thread garlic cloves onto another metal skewer, spacing slightly apart. Place jalapeño and garlic skewers on plate and set aside.",
        "Remove lamb from marinade and place on prepared grill with some marinade still clinging to surface (discard marinade in dish). Grill lamb until meat is cooked to desired doneness, about 15 to 20 minutes per side for medium (if lamb begins to burn, slide large sheet of heavy-duty aluminum foil underneath and continue to grill). Transfer lamb to work surface and let rest 10 minutes.",
        "While lamb rests, grill jalapeños, garlic, and trimmed green onions until slightly charred and tender, 3 to 4 minutes per side. Transfer to work surface.",
        "Place kochujang (hot pepper paste) in small bowl. Stir dipping sauce and divide among 8 small dishes. Arrange butter lettuce leaves on large serving platter to cover. Thinly slice grilled lamb and arrange over lettuce leaves. Cut garlic cloves lengthwise in half. Cut green onions into 2-inch pieces. Arrange jalapeños, garlic, and green onions around lamb. Sprinkle remaining 2 tablespoons toasted sesame seeds over lamb. Serve grilled lamb and vegetables with hot pepper paste. Allow guests to spread very small amounts of kochujang over lettuce leaves, arrange lamb and vegetables in lettuce leaves, then wrap filling with lettuce leaves and dip into sauce."
    ],
    "ingredients": [
        "4 green onions, coarsely chopped",
        "3 tablespoons sugar",
        "3 garlic cloves, coarsely chopped",
        "1 2-inch piece fresh ginger, peeled, cut into thin rounds",
        "2/3 cup soy sauce",
        "2/3 cup mirin (sweet Japanese rice wine)",
        "1/3 cup Asian sesame oil",
        "2 tablespoons toasted sesame seeds",
        "1 teaspoon freshly ground black pepper",
        "1 boned butterflied leg of lamb (about 5 1/2 pounds; from one 6 1/2- to 7-pound bone-in leg), trimmed of excess fat",
        "1 cup chopped peeled cored Asian pear (about 1/2 large)",
        "10 green onions; 2 chopped, 8 trimmed",
        "1/2 cup soy sauce",
        "1/2 cup mirin (sweet Japanese rice wine)",
        "3 tablespoons sugar",
        "3 tablespoons Asian sesame oil",
        "4 tablespoons toasted sesame seeds, divided",
        "Nonstick vegetable oil spray",
        "8 jalapeño chiles, halved (seeded, if desired)",
        "8 garlic cloves, peeled",
        "1/2 cup kochujang (Korean hot pepper paste)",
        "1 large head of butter lettuce, leaves separated and left whole",
        "Special equipment: 3 metal skewers or bamboo skewers soaked in water at least 1 hour",
        "Ingredient info: Mirin is sold in the Asian foods section of some supermarkets and at Japanese markets. Kochujang is a spicy red paste made with pureed fermented soybeans (miso) and hot chiles. It's available at Korean markets and online from koamart.com. If you can't find Kochujang, substitute 1/3 cup miso mixed with 2 tablespoons sriracha hot sauce.",
        "Test-Kitchen tip: Ask your butcher to bone, butterfly, and trim the leg of lamb for you. Save the bone, pop it in the freezer, and use it to make soup or stock."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Lamb",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Asian Pear",
        "Soy Sauce",
        "Lettuce",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Lamb Bulgogi with Asian Pear Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-bulgogi-with-asian-pear-dipping-sauce-359749"
}
