{
    "directions": [
        "In a large, heavy, flameproof baking dish over high heat, warm 2 Tbs. of the oil. When hot, add a few pieces of the lamb and sear until they are lightly browned all over but not cooked through, about 3 minutes. Transfer to a bowl. Repeat with the remaining lamb.",
        "Reduce the heat to medium-high and add the remaining 2 Tbs. oil to the baking dish. When hot, add the onion, cardamom and cassia leaves and cook, stirring occasionally, until the onion is browned, about 8 minutes. Stir in the ginger, garlic, coriander and turmeric.",
        "Return the lamb to the baking dish along with the tomato, tomato paste, stock and salt. Bring to a boil, then reduce the heat to low, cover and cook until the meat is tender when pierced with a fork, about 2 hours. Alternatively, place the covered baking dish in a preheated 350ºF oven for 2 1/2 hours.",
        "About 20 minutes before the meat is done, stir in the pumpkin, cover and continue cooking until the lamb and pumpkin are tender and cooked through. Taste and adjust the seasonings. Transfer the curry to a warmed platter, taking care not to crush the pumpkin. Sprinkle with the garam masala and cilantro and serve immediately. Serves 2 to 4."
    ],
    "ingredients": [
        "4 Tbs. vegetable oil",
        "1 lb. lean lamb shoulder meat, trimmed and cut  &nbsp into 1-inch cubes",
        "1 cup chopped yellow onion",
        "3 black or green cardamom pods",
        "2 cassia leaves",
        "1 Tbs. peeled and grated fresh ginger",
        "2 tsp. minced garlic",
        "2 Tbs. ground coriander",
        "1/2 tsp. ground turmeric",
        "1 cup chopped tomato",
        "1 Tbs. tomato paste",
        "2 cups chicken stock or water",
        "1 1/2 tsp. salt, or to taste",
        "1-lb. piece pumpkin or butternut squash,  &nbsp peeled, seeded and cut into 1-inch  &nbsp pieces",
        "1 Tbs. garam masala",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lamb Curry with Pumpkin (Gosht)",
    "url": "http://www.williams-sonoma.com/recipe/lamb-curry-with-pumpkin-gosht.html"
}
