{
    "directions": [
        "1. Trim the lamb and cut it into large pieces. Season with salt and pepper and put in a bowl. Add the yogurt, 1 tbsp ginger, the garlic, and cardamom. Stir or toss until the ingredients are evenly distributed and the lamb is coated. Cover and refrigerate for at least 30 minutes and up to 3 hours.",
        "2. Put the cashews in a small bowl and add enough hot water to cover them. Let the cashews soak for 30 minutes and then drain. Grind the drained cashews to a coarse paste in a food processor. Set aside.",
        "3. Heat the ghee or oil in a casserole or Dutch oven over medium heat until it shimmers. Add the onion and sauté until transparent, 6 to 8 minutes. Add the cumin, cardamom, fennel, the remaining ginger, and the coriander. Cook, stirring often until aromatic, about 2 minutes. Add the chiles, cilantro stems, and cashew paste and stir well to be sure that nothing is sticking. Sauté, stirring frequently and adding water a tablespoon at a time if necessary, until the mixture is very aromatic, about 2 minutes.",
        "4. Add the lamb and the yogurt marinade, increase the heat, and stir until the pieces are evenly coated. Once the meat's juices begin to flow, reduce heat to low, cover, and simmer very slowly, stirring occasionally, until the meat is nearly tender, about 1 1/2 hours.",
        "5. Add the cream and continue to simmer until the curry is flavorful and thickened and the lamb is tender, 10 to 15 minutes. Season to taste with additional salt, pepper, or chopped bird chile. Serve garnished with the cilantro leaves and cashews."
    ],
    "ingredients": [
        "2 1/2 lb boneless lamb leg, cut into 1 1/2-inch cubes",
        "Salt as needed",
        "Ground white pepper as needed",
        "1 1/2 cups plain yogurt",
        "2 tbsp minced ginger root",
        "1 tbsp minced garlic",
        "2 tsp ground cardamom",
        "12 oz cashew nuts",
        "1/4 cup ghee (see tips, below) or canola oil",
        "3 cups small-dice yellow onion",
        "1 tsp ground cumin",
        "1 tsp ground cardamom",
        "1 tsp ground fennel",
        "2 tbsp ground coriander",
        "6 Thai bird chiles, chopped, or to taste",
        "1/3 cup chopped cilantro stems",
        "1 cup heavy cream",
        "Salt to taste",
        "1/2 cup chopped cilantro leaves",
        "1 cup pan-roasted cashews (see, tips below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Ginger",
        "Lamb",
        "Onion",
        "Sauté",
        "Dinner",
        "Cashew",
        "Chill",
        "Cardamom",
        "Cumin",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lamb Khorma",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-khorma-357130"
}
