{
    "directions": [
        "Remove tough outer layers from lemongrass, cut 4\" piece from bulb end, thinly slice, save remaining lemongrass for another use. Pulse lemongrass and garlic in a food processor until finely chopped. Add cilantro stems (reserve leaves for another use), shallot, and 1–2 Thai chiles, depending on how hot you like it, and pulse until finely chopped. Transfer to a large bowl; set aside. Pulse peanuts in food processor until coarsely ground and transfer to a small bowl; set aside. Thinly slice remaining chiles; set aside for serving.",
        "Whisk lime juice, fish sauce, and demerara sugar in a small bowl; set lime dressing aside.",
        "Heat oil in a large skillet, preferably cast iron, over high. Add lamb to skillet and press into a single flat layer with a flexible spatula. Cook, undisturbed, until underside is browned and crisp around the edges, 5–7 minutes. Use spatula to break patty into smaller pieces and turn. Cook pieces on the other side until edges are crisp and meat is cooked through, about 5 minutes. Transfer lamb to a medium bowl with a slotted spoon, then use spoon to break up meat into small pieces.",
        "Pour off all but 3 Tbsp. fat from skillet and set skillet over medium heat. Cook lemongrass mixture, stirring often, until fragrant and starting to stick to skillet, about 3 minutes. Add reserved lime dressing and peanuts and return reserved lamb to skillet. Toss until meat is coated. Remove from heat and season with more fish sauce, if desired.",
        "Serve larb with rice, lettuce, cucumber, limes, mint sprigs, cilantro sprigs, and reserved chiles for making lettuce cups."
    ],
    "ingredients": [
        "1 lemongrass stalk",
        "4 garlic cloves",
        "1/2 bunch cilantro, stems and leaves separated, stems coarsely chopped, plus sprigs for serving",
        "1 large shallot, coarsely chopped",
        "4 red Thai chiles, divided",
        "1/2 cup salted, roasted peanuts",
        "3 tablespoons fresh lime juice",
        "1 tablespoon (or more) fish sauce",
        "1 1/2 teaspoons demerara sugar or dark brown sugar",
        "2 tablespoons vegetable oil",
        "1 pound ground lamb (at least 10% fat)",
        "Cooked white rice, Bibb lettuce leaves, sliced cucumber, lime wedges, and mint sprigs (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Ground Lamb",
        "Laos",
        "Peanut",
        "Rice",
        "Lemongrass",
        "Garlic",
        "Cilantro",
        "Chile Pepper",
        "Lime Juice",
        "Cucumber",
        "Mint",
        "Dinner",
        "Salad",
        "Lettuce",
        "Wheat/Gluten-Free"
    ],
    "title": "Lamb Larb",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-larb"
}
