{
    "directions": [
        "1. Place the eggplant in a colander, toss liberally with salt, and let sit for about 1 hour to drain away extra water. Squeeze out the excess water and pat dry with a kitchen towel.",
        "2. In a large skillet over medium-high heat, add the olive oil. Working in batches, fry the eggplant slices, turning as necessary, until tender and light brown, 4 to 5 minutes total. Transfer the cooked slices to a rack set over a baking sheet to drain while you sauté the remaining eggplant. Set aside.",
        "1. In a large skillet over medium heat, add the olive oil. Add the onion to the pan and cook, stirring occasionally, until very tender, about 10 minutes. Add the ground meat and cook, stirring occasionally, until just browned, about 5 minutes.",
        "2. Add the garlic, tomatoes, tomato paste, cloves, allspice, cinnamon, bay leaf, and 1/2 cup water and bring the liquids to a boil. Reduce the heat to medium-low, season with salt and pepper, and simmer, stirring occasionally, until most of the liquid has reduced and the sauce is very thick, about 30 minutes.",
        "3. Add the red wine and continue simmering until the wine has reduced and developed a sweet aroma, 2 to 3 minutes. Remove and discard the bay leaf and cinnamon stick. Set the sauce aside.",
        "1. In a medium saucepan over medium heat, melt the butter. Stir in the flour and whisk until it is dissolved and the mixture resembles a smooth paste, about 2 minutes.",
        "2. Gradually whisk in the milk about 1 cup at a time, working out any lumps that form. Bring the sauce to a full boil, then reduce the heat to low and gently simmer, stirring frequently, until thickened, about 30 minutes. Remove the sauce from the heat. Season with nutmeg, salt, and pepper to taste.",
        "3. In a medium bowl lightly beat the egg yolks. Whisk about 1 cup of the hot milk mixture into the yolks to bring them up to the same temperature. Slowly add the yolk mixture to the rest of the milk mixture, then add the cheese and blend well. Set aside and keep warm.",
        "1. Preheat the oven to 350°F.",
        "2. Scatter the breadcrumbs in a deep, rectangular baking dish. Arrange about half of the eggplant slices in an even layer over the breadcrumbs. Add all of the meat sauce over the eggplant and spread into an even layer. Arrange the remaining eggplant in an even layer over the meat sauce. Pour the cheese sauce over the eggplant.",
        "3. Bake the moussaka until the cheese sauce is thick and golden brown and the eggplant is very tender, about 45 minutes. Let the moussaka rest for 25 minutes before serving."
    ],
    "ingredients": [
        "2 to 3 medium eggplants (about 3 pounds total), peeled and sliced into 1/2-inch rounds",
        "Kosher salt",
        "1/2 cup olive oil, or as needed",
        "2 tablespoons olive oil",
        "1 large onion, peeled and diced",
        "1 1/4 pounds ground lamb (or beef, turkey, pork, or a combination)",
        "2 cloves garlic, peeled and minced",
        "1 28-ounce can diced tomatoes",
        "2 tablespoons tomato paste",
        "1/4 teaspoon ground cloves",
        "1 pinch ground allspice",
        "1-inch cinnamon stick",
        "1 bay leaf",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup dry red wine",
        "5 tablespoons unsalted butter",
        "5 tablespoons all-purpose flour",
        "2 1/2 cups milk",
        "Pinch freshly grated nutmeg",
        "Kosher salt and freshly ground black pepper",
        "2 large egg yolks",
        "1/2 cup grated Parmesan cheese",
        "1/3 cup plain breadcrumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Dinner",
        "Casserole/Gratin",
        "Ground Lamb",
        "Eggplant",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lamb and Eggplant Casserole (Moussaka)",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-eggplant-casserole-moussaka-51121520"
}
