{
    "directions": [
        "Preheat oven to 350°F.",
        "In a 9-quart heavy ovenproof kettle cook sugar on top of stove over moderate heat, without stirring, until it begins to melt. Continue to cook sugar, stirring with a fork until melted and cook without stirring, swirling kettle, until a deep golden caramel. Add vinegar and stir until caramel is dissolved. Stir in tomatoes with juice, wine, rosemary, cinnamon, and bay leaf and bring to a boil. Add lamb shanks and braise, covered, in middle of oven until tender, about 2 hours. Braised lamb shanks improve in flavor if made 1 day ahead. Cool mixture, uncovered, and chill, covered. Skim and discard fat from mixture and reheat on top of stove before proceeding.",
        "In a saucepan of boiling water blanch onions 10 minutes, or until just tender, and drain. Cool onions and peel.",
        "Quarter potatoes and in a steamer set over simmering water steam potatoes, covered, 8 to 10 minutes, or until just tender. In a large non-stick skillet cook garlic in oil over moderate heat, stirring, until pale golden. Add potatoes with salt and pepper to taste and sauté mixture over moderately high heat 5 minutes, or until potatoes are golden.",
        "Transfer meat with a slotted spoon to a platter. Discard cinnamon stick and bay leaf. Add onions to sauce and boil until sauce is thickened slightly. Spoon sauce and onions over meat and surround with potatoes."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "1/2 cup red-wine vinegar",
        "a 28- to 32-ounce can whole tomatoes including juice, chopped",
        "1 cup dry red wine",
        "2 teaspoons dried rosemary, crumbled",
        "1 cinnamon stick",
        "1 bay leaf",
        "6 lamb shanks (about 6 pounds total)",
        "1 pound pearl onions (about 3 cups)",
        "2 pounds small red potatoes",
        "3 large garlic cloves, sliced thin",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Onion",
        "Potato",
        "Tomato",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Lamb Shank Stifado with Sauteed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-shank-stifado-with-sauteed-potatoes-11390"
}
