{
    "directions": [
        "Cook onion in oil in a 4-quart heavy pot over moderately low heat, stirring, until softened, 3 to 5 minutes. Add lamb and sauté over moderately high heat, stirring and breaking up lumps, until no longer pink, about 5 minutes. Add garlic, salt, oregano, cinnamon, sugar, and pepper and sauté, stirring, 2 minutes.",
        "Stir in eggplant and tomatoes and gently simmer, covered, stirring occasionally, until eggplant is just tender, about 40 minutes. Remove lid and simmer, stirring occasionally, until sauce is thickened, about 15 minutes more. Season with salt and pepper.",
        "Preheat oven to 425°F.",
        "Melt butter in a 2-quart heavy saucepan over moderate heat, then stir in flour and cook, stirring, 2 minutes. Whisk in milk and add garlic clove and whole clove, then bring to a boil, whisking constantly. Reduce heat and simmer, whisking occasionally, 5 minutes. Add feta, salt, and pepper and cook, whisking vigorously, until cheese is well incorporated.",
        "Beat eggs in a large bowl and gradually add sauce to eggs, whisking.",
        "Cook pasta in a large pot of boiling salted water until just al dente, then drain in a colander. Toss half of pasta with lamb sauce and half with cheese sauce.",
        "Pour pasta with lamb sauce into a wide shallow 3-quart baking dish, spreading evenly. Spoon pasta with cheese sauce on top, spreading evenly.",
        "Bake pastitsio, uncovered, in middle of oven until bubbling and top is golden, 25 to 30 minutes. Let stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "1 tablespoon olive oil",
        "1 lb lean ground lamb",
        "1 garlic clove, minced",
        "1 1/2 teaspoons salt",
        "1 teaspoon dried oregano, crumbled",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon sugar",
        "1/4 teaspoon black pepper",
        "1 lb eggplant, peeled and cut into 1/2-inch cubes",
        "1 (28- to 32-oz) can crushed tomatoes",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 garlic clove",
        "1 whole clove",
        "1/2 lb feta, crumbled",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 large eggs",
        "10 oz penne (3 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Lamb",
        "Pasta",
        "Tomato",
        "Bake",
        "Feta",
        "Eggplant",
        "Fall",
        "Gourmet"
    ],
    "title": "Lamb and Eggplant Pastitsio",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-eggplant-pastitsio-105595"
}
