{
    "directions": [
        "Line a colander with a quadruple layer of cheesecloth and pour the yogurt into the cheesecloth. suspend over a large bowl and refrigerate for 48 hours, allowing the moisture to drain from the yogurt.",
        "Peel and grate the cucumbers on a box grater. season with 1 teaspoon of salt and hang in a quadruple layer of cheese-cloth to drain excess moisture, about 1 hour. Measure 1 cup of the drained yogurt and reserve the rest for another use. Combine the cup of yogurt and the drained cucumbers in a medium bowl. stir in the lemon juice and olive oil. Grate the garlic on a Microplane grater into the mixture and fold in the chopped dill. Mix well and season with salt to taste.",
        "Preheat the oven to 300°F. Heat a large cast-iron skillet over high heat. season the lamb rack generously with salt. place the rack in the skillet fat side down and sear over high heat until browned, 2 1/2 to 3 minutes. Turn and sear the bottom for 1 minute. Turn the rack back onto the fat side and add the butter, thyme, and garlic. Baste the rack with the butter for 2 1/2 to 3 minutes. Transfer the lamb rack fat side up to a wire rack set in a rimmed baking sheet and roast in the oven for 10 minutes. Turn the lamb rack over, baste with butter, and return to the oven for another 10 minutes. remove the lamb rack from the oven, turn it back over, and baste once more. roast in the oven for another 10 to 15 minutes, until the internal temperature reaches 130° to 135°F. Let the lamb rack rest for 10 to 15 minutes before slicing. serve with the cucumber yogurt and heirloom tomatoes."
    ],
    "ingredients": [
        "1 1/2 cups plain Greek-style yogurt",
        "2 cucumbers",
        "Salt",
        "2 teaspoons lemon juice",
        "1 tablespoon olive oil",
        "1/2 clove garlic",
        "1 1/2 tablespoons chopped dill",
        "1 tablespoon canola oil",
        "1 lamb rack (about 2 1/4 pounds), frenched and tied",
        "Salt",
        "2 tablespoons butter",
        "5 sprigs thyme",
        "1 clove garlic, crushed but kept whole"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Easter",
        "Yogurt",
        "Dinner",
        "Rack of Lamb",
        "Cucumber",
        "Spring",
        "Advance Prep Required",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lamb Rack with Cucumber Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-rack-with-cucumber-yogurt-51157610"
}
