{
    "directions": [
        "Sprinkle lamb with salt and pepper. Heat 2 teaspoons oil in heavy large pot over medium-high heat. Add lamb, carrot and halved onion; sauté until lamb browns, about 10 minutes. Add 8 cups water, quartered tomato, and bay leaf. Bring to boil. Reduce heat to medium and boil gently, uncovered, until liquid is reduced to 4 cups, turning lamb often, about 45 minutes. Transfer lamb to cutting board; cool slightly. Strain lamb cooking liquid into bowl; spoon off any fat from surface. Discard lamb bone and vegetables. Cut lamb into 1-inch pieces.",
        "Combine chopped onion and remaining 1 teaspoon oil in same pot. Sauté over medium-high heat until onion is golden, about 4 minutes. Add rice, apricots, and garlic; stir 1 minute. Stir in reserved lamb cooking liquid, lamb pieces, and chopped tomato. Bring to boil. Reduce heat to low, cover and simmr until rice is tender and most liquid is absorbed, about 25 minutes. Season with salt and pepper. Transfer to bowl; sprinkle with cilantro and pine nuts and serve."
    ],
    "ingredients": [
        "1 2 1/3-pound bone-in lamb leg sirloin, fat and sinew trimmed",
        "3 teaspoons olive oil",
        "1 large carrot, peeled, quartered lengthwise",
        "1 small onion, halved",
        "8 cups water",
        "1 tomato, quartered",
        "1 bay leaf",
        "1/2 cup chopped onion",
        "1 1/2 cups arborio rice or medium-grain white rice",
        "1/4 cup chopped dried apricots",
        "1 garlic clove, minced",
        "1/4 cup chopped tomato",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Rice",
        "Tomato",
        "Dried Fruit",
        "Apricot",
        "Pine Nut",
        "Fall",
        "Simmer"
    ],
    "title": "Lamb and Rice Pilaf with Dried Apricots and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-rice-pilaf-with-dried-apricots-and-pine-nuts-104951"
}
