{
    "directions": [
        "Freeze lamb, wrapped in plastic wrap, until firm, 30 minutes, to facilitate slicing. Trim lamb well and cut into 1/8-inch-thick slices. Halve lamb slices crosswise. In a large bowl toss lamb with cornstarch until coated well and season with salt and pepper.",
        "In a bowl stir together sauce ingredients until combined well.",
        "Cut eggplant into 1-inch cubes. Diagonally cut celery into 1/4-inch-thick slices and mince garlic. Discard stems from shiitakes and halve caps (quarter if large). Halve white mushrooms lengthwise. Discard tough stems from watercress.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 2 tablespoons oil, swirling wok or skillet to coat evenly, and heat until hot but not smoking. Add eggplant and stir-fry until golden and tender, about 4 minutes. Add celery and stir-fry until crisp-tender, about 2 minutes. Add garlic and mushrooms and stir-fry until mushrooms are tender, about 2 minutes. Transfer mixture to a large bowl.",
        "Add 1 tablespoon oil to wok or skillet and heat until just smoking. Stir-fry half of lamb, separating slices, until browned and transfer to bowl. Add remaining tablespoon oil and stir-fry remaining lamb in same manner, transferring to bowl.",
        "Add sauce to wok or skillet and bring to a boil, stirring. Return lamb-vegetable mixture to wok or skillet and stir-fry until combined and heated through. Stir in watercress and season stir-fry with salt and pepper.",
        "Serve stir-fry over rice."
    ],
    "ingredients": [
        "1 pound boneless leg of lamb",
        "2 tablespoons cornstarch",
        "3/4 cup chicken broth",
        "3 tablespoons honey",
        "2 tablespoons soy sauce",
        "2 tablespoons oyster sauce",
        "3/4 teaspoon dried hot red pepper flakes",
        "1/2 pound eggplant (about 1 small)",
        "3 celery ribs",
        "3 garlic cloves",
        "1/2 pound fresh shiitake mushrooms",
        "1/2 pound small white mushrooms",
        "1 bunch watercress",
        "4 tablespoons peanut oil",
        "Accompaniment:Cooked Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mushroom",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Lamb and Shiitake Mushroom Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-shiitake-mushroom-stir-fry-14490"
}
