{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Drain 1 can tomatoes, reserving juice, then roughly break up tomatoes into 1/2-inch pieces with a spoon if necessary.",
        "Purée second can of tomatoes, including juice, with reserved juice (from other can), 1/4 teaspoon salt, and 1/8 teaspoon allspice in a blender until smooth. Transfer tomato sauce to a 2-quart heavy saucepan and boil, uncovered, stirring occasionally, until reduced to about 1/2 cup, about 20 minutes. Remove from heat.",
        "Heat a dry 12-inch heavy skillet over moderate heat until hot, then brown lamb with 1/2 teaspoon salt, 1/4 teaspoon black pepper, and remaining 1/2 teaspoon allspice, stirring and breaking up lumps (but leaving meat slightly chunky), about 5 minutes. Add drained tomatoes and cook, stirring occasionally, until juices are absorbed, about 1 minute.",
        "Cut polenta into 1/4-inch-thick slices with a sharp knife and cover bottom of a 9-inch ceramic or glass pie plate with half of polenta slices (overlapping slightly). Scatter half of lamb mixture over polenta, then top with half of mozzarella, then remaining polenta. Scatter remaining lamb on top and spread tomato sauce over meat, then top with remaining mozzarella.",
        "Bake, uncovered, until bubbling and beginning to brown, about 20 minutes. Let stand, loosely covered with foil, 15 minutes before serving."
    ],
    "ingredients": [
        "2 (14- to 15-ounce) cans stewed tomatoes",
        "1/2 plus 1/8 teaspoon ground allspice",
        "1 pound ground lamb (not lean)",
        "1 pound ready-made plain polenta (in a plastic-wrapped roll)",
        "1/2 pound whole-milk mozzarella, coarsely grated (about 1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Bake",
        "Quick & Easy",
        "Winter",
        "Hominy/Cornmeal/Masa",
        "Gourmet"
    ],
    "title": "Lamb and Polenta \"Lasagne\"",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-polenta-lasagne-231496"
}
