{
    "directions": [
        "Preheat oven to 350°F. Place lamb shanks on a large rimmed baking sheet; season generously with salt and pepper. Mix cinnamon, turmeric, cumin, and cardamom in a small bowl; massage spice mixture into lamb. Let rest 1 hour at room temperature or chill uncovered up to 12 hours (the longer, the better).",
        "If chilling, let shanks sit at room temperature 1 hour for even roasting.",
        "Heat 1/4 cup oil in a large pot over medium-high. Working in batches, cook lamb shanks until brown on all sides, 10–15 minutes. Transfer lamb to paper towels to drain.",
        "Wipe out pot and let cool slightly so that vegetables don’t burn. Heat remaining 1/4 cup oil in pot over medium. Add onions, season with salt, and cook, stirring occasionally, until golden and softened, 8–10 minutes. Add thyme sprigs, garlic, and bay leaves and cook, stirring often, until fragrant, about 2 minutes. Sprinkle flour over and stir vigorously to evenly distribute. Cook, stirring often, until flour is absorbed, about 1 minute. Add wine; bring to a simmer and cook, stirring often, until thickened, about 2 minutes. Gradually stir in broth, pomegranate juice, and pomegranate molasses. Bring to a simmer and cook, stirring occasionally, until flavors meld, about 5 minutes.",
        "Arrange lamb shanks in a single layer in a large roasting pan. Pour in onion mixture and push lamb shanks down into liquid (about three-quarters of lamb shanks should be submerged; add more broth if needed). Cover pan with foil and cook lamb, turning occasionally, until meat is fork-tender and almost falling off the bone, 1 1/2–2 hours. Remove pan from oven and let lamb rest, covered, in liquid at least 30 minutes.",
        "Transfer lamb to a platter and tent with foil to keep warm. Strain braising liquid through a fine-mesh sieve into a medium saucepan; skim off fat from surface and discard. Add walnuts to braising liquid and bring to a simmer over medium-high. Cook until reduced by one-third, 15–20 minutes (sauce should be slightly thickened and velvety). Add butter a piece at a time, stirring after each addition until incorporated before adding more; sauce should look glossy. Return lamb to pot and cook, stirring to coat, until heated through. Taste and adjust seasoning with salt and pepper.",
        "Arrange lamb over polenta on a platter and spoon walnuts and sauce over; top with lemon zest.",
        "Lamb shanks can be braised 1 day ahead. Chill uncovered until cold, then cover and keep chilled."
    ],
    "ingredients": [
        "6 pounds lamb shanks (6–8 shanks, depending on size), trimmed",
        "Kosher salt, freshly ground pepper",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground turmeric",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground cardamom",
        "1/2 cup olive oil, divided",
        "2 medium onions, thinly sliced",
        "6 sprigs thyme",
        "4 garlic cloves, crushed",
        "2 bay leaves",
        "2 tablespoons all-purpose flour",
        "1/2 cup dry red wine",
        "4 cups (or more) low-sodium chicken broth",
        "1 cup pomegranate juice",
        "1/2 cup pomegranate molasses",
        "2 cups walnuts, rinsed",
        "3 tablespoons unsalted butter, cut into pieces",
        "Cooked polenta (for serving)",
        "3 wide strips lemon zest, very thinly sliced lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Lamb Shank",
        "Pomegranate",
        "Pomegranate Juice",
        "Walnut",
        "Braise",
        "Christmas",
        "Cardamom",
        "Cinnamon",
        "Garlic",
        "Red Wine",
        "Dinner",
        "Hanukkah",
        "New Year's Eve",
        "Winter",
        "Entertaining",
        "Wheat/Gluten-Free"
    ],
    "title": "Lamb Shanks With Pomegranate and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-shanks-with-pomegranate-and-walnuts"
}
