{
    "directions": [
        "In a colander sprinkle the eggplant with salt and let it drain for 30 minutes. In a large skillet heat 4 tablespoons of olive oil over moderate heat, in it cook the eggplant, patted dry, in batches, stirring, for 15 minutes, or until it is tender but still holds its shape, and transfer it with a slotted spoon to a bowl. In the skillet heat the remaining 1 tablespoon oil over moderate heat and in it cook the onion, stirring, until it is softened. Add the garlic and cook the mixture, stirring, for 1 minute. Add the lamb and cook the mixture, stirring and breaking up any lumps, until the lamb is no longer pink. Pour off any excess fat from the skillet, add the cinnamon, the mint, the orégano, and the allspice, and cook the mixture, stirring, for 1 minute. Add the tomatoes with the reserved juice, the tomato paste, and salt and pepper to taste and cook the mixture, stirring, for 15 minutes, or until it is thickened. Transfer the mixture to a large bowl and stir in the Parmesan. The lamb mixture improves in flavor if made up to this point and kept, covered and chilled, overnight. Add the eggplant to the lamb mixture, combine the mixture well, and spread it in the buttered shallow 3-quart gratin dish.",
        "In a large saucepan combine the potatoes, peeled and cut into 1-inch pieces, with enough cold water to cover them by 1 inch, bring the water to a boil, and simmer the potatoes for 10 to 15 minutes, or until they are tender. Drain the potatoes, return them to the pan, and cook them over moderate heat, shaking the pan, for 30 seconds to evaporate any excess liquid. Force the potatoes through a ricer or the medium disk of a food mill into a bowl, add the butter, the Parmesan, the Feta, and salt and pepper to taste, and stir the mixture until it is combined well and butter is melted.",
        "Spoon the topping over the lamb mixture, spreading it to cover the lamb mixture completely, and dot the surface with the butter, cut into bits. Bake the potpie in the middle of a preheated 400°F. oven for 35 to 40 minutes, or until it is browned lightly."
    ],
    "ingredients": [
        "two 1-pound eggplants, cut into 1/2-inch cubes (about 8 cups)",
        "5 tablespoons vegetable oil",
        "1 large onion, chopped",
        "1 tablespoon minced garlic",
        "2 pounds ground lamb",
        "1 1/4 teaspoons cinnamon",
        "2 teaspoons crumbled dried mint",
        "1 1/4 teaspoons crumbled dried oregano",
        "1/2 teaspoon ground allspice",
        "a 35-ounce can Italian plum tomatoes, drained, reserving 1 cup of the juice, and chopped",
        "2 tablespoons tomato paste",
        "1/4 cup freshly grated Parmesan",
        "3 pounds russet (baking) potatoes (about 6)",
        "2 tablespoons unsalted butter",
        "1/3 cup freshly grated Parmesan",
        "1/3 pound grated Feta",
        "1 tablespoon unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Potato",
        "Tomato",
        "Bake",
        "Casserole/Gratin",
        "Feta",
        "Parmesan",
        "Eggplant",
        "Winter",
        "Cinnamon",
        "Potluck",
        "Gourmet"
    ],
    "title": "Lamb and Eggplant Potpie with Feta Potato Crust",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-eggplant-potpie-with-feta-potato-crust-10300"
}
