{
    "directions": [
        "Stir fresh cherries together with sugar and macerate while browning chops. If using frozen cherries, stir with any juices and sugar and thaw, about 1 1/2 hours.",
        "Pat lamb dry and sprinkle with salt and pepper. Heat 1 tablespoon oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sauté 4 chops, turning over once, about 6 minutes total for medium-rare. Transfer to a plate and loosely cover with foil. Cook and transfer remaining 4 chops in same manner.",
        "Pour off fat from skillet and add remaining tablespoon oil. Heat until hot but not smoking, then sauté shallot, stirring, until golden brown, about 3 minutes. Add cherries with juices, broth, and vinegar and bring to a boil, stirring occasionally and scraping up brown bits, then reduce heat and simmer 3 minutes. Add salt and pepper to taste, then add butter and 2 tablespoons mint, stirring just until butter is melted.",
        "Spoon sauce over chops and sprinkle with remaining 2 tablespoons mint."
    ],
    "ingredients": [
        "1 1/2 cups fresh or frozen (not thawed) pitted sour cherries (1/2 lb)",
        "1 tablespoon sugar",
        "8 (3/4-inch-thick) rib lamb chops (2 lb total), trimmed of excess fat",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 tablespoons vegetable oil",
        "1 cup thinly sliced shallot (4 oz)",
        "1/2 cup beef broth",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons unsalted butter",
        "4 tablespoons finely chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Lamb",
        "Sauté",
        "Quick & Easy",
        "Cherry",
        "Mint",
        "Summer",
        "Gourmet"
    ],
    "title": "Lamb Chops with Cherry Balsamic Sauce and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-with-cherry-balsamic-sauce-and-mint-108339"
}
