{
    "directions": [
        "Preheat oven to 325°F.",
        "Wrap herb sprigs, bay leaves, and peppercorns in a square of cheesecloth and tie into a bundle to make a bouquet garni.",
        "Pat lamb dry, then cut into 1 1/2-inch pieces and season with salt and pepper. Heat 2 tablespoons oil in a 6- to 7-quart wide heavy pot over moderately high heat until hot but not smoking, then brown lamb in 3 batches, turning occasionally, about 4 minutes per batch, transferring with a slotted spoon to a bowl.",
        "Add remaining tablespoon oil to pot and sauté chopped onion and garlic over moderately high heat, stirring, until onion is golden, about 6 minutes. Add wine and stock and deglaze pot by boiling, scraping up brown bits, 1 minute. Return lamb to pot along with any juices that have accumulated in bowl and add bouquet garni.",
        "Braise lamb, covered, in middle of oven until tender, about 1 1/2 hours. Stir in salt and pepper.",
        "While lamb is braising, cook pearl onions in a 5- to 6-quart pot of boiling salted water until tender, about 10 minutes, then transfer with a slotted spoon to a large bowl of ice and cold water to stop cooking (reserve cooking water). Remove onions and peel.",
        "Boil turnips, carrots, zucchini, and sugar snaps separately in reserved cooking water until just tender, about 5 minutes for turnips, 4 to 6 minutes for carrots, 2 minutes for zucchini, and 1 1/2 minutes for sugar snaps. Transfer vegetables as cooked with a slotted spoon to ice water and, when all are cooked, drain vegetables in a colander.",
        "Make a beurre manié by stirring together butter and flour in a small bowl to form a paste. Bring lamb stew to a simmer on stovetop and whisk in enough beurre manié, bit by bit, to thicken to desired consistency, then simmer about 2 minutes. Add vegetables and simmer, stirring occasionally, until heated through, about 2 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "6 fresh parsley sprigs",
        "2 fresh thyme sprigs",
        "2 fresh rosemary sprigs",
        "2 Turkish bay leaves or 1 California bay leaf",
        "6 whole black peppercorns",
        "3 pounds boneless lamb shoulder, trimmed of excess fat",
        "3 tablespoons olive oil",
        "1 large onion, finely chopped",
        "4 garlic cloves, finely chopped",
        "1 1/2 cups dry white wine",
        "2 1/2 cups beef stock or broth",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "10 ounces pearl onions",
        "1/2 pound baby turnips, trimmed and halved lengthwise if large",
        "1/2 pound baby carrots, peeled, trimmed, and halved lengthwise if large",
        "1/2 pound baby zucchini, trimmed and halved lengthwise",
        "1/2 pound sugar snap peas, trimmed",
        "2 tablespoons unsalted butter, softened",
        "3 tablespoons all-purpose flour",
        "Special equipment: cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Vegetable",
        "Stew",
        "Dinner",
        "Spring",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lamb Stew with Spring Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-stew-with-spring-vegetables-106363"
}
