{
    "directions": [
        "Toast cumin and coriander seeds in a small dry skillet over medium heat until fragrant, about 1 minute. Let cool, then finely chop. Toss lamb with cumin, coriander, paprika, garlic, vinegar, and 2 tablespoons oil in a large bowl to coat; season with salt and pepper. Cover and chill 15 minutes.",
        "Whisk yogurt and 1 tablespoon water in a small bowl; season with salt and pepper.",
        "Heat remaining 2 tablespoons oil in a large skillet, preferably cast iron, over medium-high heat. Working in batches, cook lamb, tossing occasionally, until browned, about 5 minutes per batch; transfer to a plate with a slotted spoon.",
        "Add onion to skillet and cook, stirring often, until beginning to brown and soften, about 3 minutes. Add 1/2 cup water; season with salt and pepper and cook, stirring occasionally, until onion is tender and water is evaporated, about 3 minutes. Return lamb to skillet and toss to combine. Season with salt and pepper.",
        "Serve lamb over rice, topped with yogurt, pomegranate seeds, pistachios, and herbs.",
        "DO AHEAD: Lamb can be marinated 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "2 teaspoons cumin seeds",
        "1 teaspoon coriander seeds",
        "1 1/2 pounds boneless leg of lamb, thinly sliced against the grain",
        "1 teaspoon paprika",
        "4 garlic cloves, finely chopped",
        "1 tablespoon red wine vinegar",
        "4 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1/2 cup plain Greek yogurt",
        "1 medium red onion, cut into 1/2\" wedges",
        "Cooked rice (for serving)",
        "1/4 cup pomegranate seeds",
        "2 tablespoons chopped pistachios",
        "Fresh oregano, mint, and/or cilantro leaves (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Stir-Fry",
        "Quick & Easy",
        "Yogurt",
        "Dinner",
        "Pomegranate",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lamb Stir-Fry with Pomegranate and Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-stir-fry-with-pomegranate-and-yogurt-51223820"
}
