{
    "directions": [
        "Preheat the oven to 500 degrees F.",
        "Cut the onions and turnips into quarters. Toss the onions, and turnips, carrots, and fennel lightly in oil and place them on baking sheets. Roast the vegetables for 30 minutes, stirring every 10 minutes. When vegetables are a dark caramel color, remove them from the oven. Reserve 1 onion, 1 carrot, 1 turnip, and the stalk of fennel; set aside. Put the remainder of the vegetables in a large pot with the chicken stock, garlic, orange juice, apple cider, coriander seeds, fennel seeds, star anise, cumin seeds, orange zest, salt and pepper. Cook the broth over high heat until reduced by about half.",
        "While the broth is simmering, remove the skin and excess fat from the leg of lamb and cut the meat into 1-inch cubes. Put the cubes on a wire rack to drain or on a clean towel to soak up excess moisture. Add some of the cooking oil to a large heavy skillet and heat over high heat. When the oil is hot, carefully add the diced lamb. Cook the lamb, in batches as necessary, for 3 minutes on each side, or until browned. Transfer the lamb to a roasting pan. Add the wine to the skillet that the lamb was cooked in and cook, over high heat, scraping the bottom of the pan with a wooden spoon. Cook the wine until reduced by about half and the solids have come up off the pan. Pour the reduced wine over the lamb.",
        "Reduce the oven temperature to 325 degrees F. Strain the broth and discard the solids. Pour the broth over the lamb in the roasting pan. Cover the pan with a lid or parchment paper and braise until the lamb is tender, about 1 1/2 hours.",
        "Once the lamb is tender, remove it from the oven and add the reserved roasted vegetables to the pan. Place the roasting pan over medium heat on the stovetop and bring to a simmer. Add salt, pepper, and fresh herbs, to taste. Serve the stew with rustic bread on the side."
    ],
    "ingredients": [
        "5 yellow onions",
        "2 turnips",
        "5 carrots",
        "1 stalk fennel",
        "1 cup cooking oil, divided",
        "1 1/2 gallons chicken stock",
        "1/2 head garlic",
        "1/4 gallon orange juice",
        "1/4 gallon apple cider",
        "1/4 cup coriander seeds",
        "1/8 cup fennel seeds",
        "1 star anise",
        "2 tablespoons cumin seeds",
        "1/8 cup orange zest",
        "1 teaspoon salt",
        "1/2 tablespoon freshly ground black pepper",
        "1 leg of lamb",
        "3 cups dry white wine",
        "Salt and freshly ground pepper",
        "Your choice fresh herbs, minced, to taste"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Lamb Stew",
        "Lamb Recipes",
        "Meat",
        "Stew Recipes",
        "Turnip Recipes",
        "Vegetable",
        "Carrot Recipes",
        "Apple",
        "Fruit",
        "Onion Recipes",
        "Main Dish Recipes"
    ],
    "title": "Lamb Stew",
    "url": "http://www.foodnetwork.com/recipes/lamb-stew-recipe"
}
