{
    "directions": [
        "Pat lamb shanks dry and season with kosher salt (rounded 1/2 teaspoon) and 1/4 teaspoon pepper. Heat 2 tablespoons oil in a 5-quart heavy pot over medium-high heat until it shimmers. Brown shanks on all sides, 6 to 7 minutes, then transfer to paper towels to drain. Add remaining 2 tablespoons oil to pot, then cook onion, garlic, plum tomatoes, sun-dried tomatoes, celery, mushrooms, and fennel with thyme, red pepper flakes, and 1/2 teaspoon pepper, stirring occasionally, until softened, 4 to 5 minutes.",
        "Return lamb shanks to pot with stock, bourbon, vinegar, Worcestershire sauce, soy sauce, and honey and bring to a boil. Reduce heat to low and simmer, covered, stirring occasionally, until meat is very tender, 3 to 3 1/2 hours.",
        "Remove meat from bones, discarding bones, and skim fat from cooking liquid, then return meat to pot. Simmer ragù, uncovered, stirring frequently, 15 minutes.",
        "Just before serving, stir in radicchio and scallion.",
        "Bring stock, water, and milk to a boil in a 2-quart heavy saucepan. Add grits in a stream, whisking, then cook over low heat, uncovered, stirring frequently, until grits are tender and thickened to the consistency of loose oatmeal, about 20 minutes.",
        "Toward end of cooking, finely grate one fourth of cheese (1 cup) and add to grits along with sour cream, sea salt, and pepper to taste. Stir until cheese has melted. If grits are too thick, stir in some additional milk.",
        "Serve ragù over grits and top with shavings of cheese."
    ],
    "ingredients": [
        "2 pounds lamb shanks",
        "Rounded 1/2 teaspoon kosher salt",
        "1/4 cup olive oil, divided",
        "1 cup chopped red onion",
        "2 large garlic cloves, chopped",
        "1/2 cup chopped plum tomatoes",
        "2 tablespoons finely chopped sun-dried tomatoes",
        "1/2 cup chopped celery",
        "1/2 cup chopped fresh oyster mushrooms or white mushrooms",
        "1/4 cup chopped fennel bulb",
        "1 teaspoon thyme leaves",
        "1/2 teaspoon hot red pepper flakes",
        "3 cups chicken stock or reduced-sodium chicken broth",
        "1 cup bourbon",
        "1/2 tablespoon cider vinegar",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon soy sauce",
        "1 teaspoon mild honey",
        "1/2 cup chopped radicchio",
        "1 scallion, chopped",
        "1 1/2 cups chicken stock or reduced-sodium chicken broth",
        "1 1/2 cups water",
        "3/4 cup whole milk plus additional if necessary",
        "1/2 cup quick-cooking grits (preferably Anson Mills)",
        "1 (1/2-pound) piece Manchego cheese (preferably raw sheep's milk)",
        "1 tablespoon sour cream",
        "1 teaspoon fine sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Cheese",
        "Lamb",
        "Mushroom",
        "Tomato",
        "Appetizer",
        "Stew",
        "Dinner",
        "Cornmeal",
        "Radicchio",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Lamb Shank Ragù with Anson Mills Grits",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-shank-ragu-with-anson-mills-grits-355529"
}
