{
    "directions": [
        "In a skillet heat the oil over moderately high heat until it is hot but not smoking and in it sauté the chops, seasoned with salt and pepper, flattening them occasionally with a metal spatula, for 4 minutes on each side for medium meat. Transfer the chops with a slotted spatula to a small platter and keep them warm, covered loosely with foil.",
        "Pour off all but 1 tablespoon of the fat and in the remaining fat cook the garlic over moderate heat, stirring, until it is pale golden. Add the onion and cook the mixture, stirring, for 1 minute. Add the mushrooms and the soy sauce and cook the mixture over moderately high heat, stirring, until the liquid the mushrooms give off is evaporated. Add the vinegar and boil the mixture until the liquid is evaporated. Add the wine and the thyme and boil the mixture until almost all the liquid is evaporated. Stir the cornstarch mixture, add it to the skillet, and bring the sauce to a boil, stirring. Season the sauce with salt and pepper, spoon it over the chops, and sprinkle the chops with the parsley."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "two 1/2-inch-thick lamb shoulder chops (about 1 pound total), patted dry",
        "2 large garlic cloves, minced",
        "1/2 small onion, chopped fine (about 1/4 cup)",
        "1/4 pound mushrooms, sliced",
        "1 tablespoon soy sauce",
        "1 tablespoon red-wine vinegar",
        "1/2 cup dry red wine",
        "1/4 teaspoon dried thyme, crumbled",
        "1 teaspoon cornstarch dissolved in 1/2 cup water",
        "1 tablespoon minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mushroom",
        "Sauté",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Lamb Chops with Mushroom Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-with-mushroom-wine-sauce-10658"
}
