{
    "directions": [
        "1. To make the meatballs, mix the ground lamb, bread crumbs, egg, cumin, garam masala, and salt together in a large bowl. Cover and refrigerate for at least 15 minutes or up to 4 hours.",
        "2. To make the sauce, heat the oil in a large saucepan over medium heat. Add the onion, garlic, ginger, and chile and stir well. Open the can of coconut milk. Spoon out and measure 1/2 cup of the thick coconut milk that has risen to the top. Add to the saucepan with the cumin and garam masala. Cook until the onion mixture is softened and the coconut milk is reduced and looks oily, about 5 minutes. Add 1 cup water, the cilantro, tamarind concentrate, and remaining coconut milk (about 1 1/4 cups). Whisk well and bring to a simmer. Reduce the heat to medium-low and cook, whisking occasionally, until slightly reduced, about 10 minutes.",
        "3. Using your hands rinsed under cold water, shape the meat mixture into 24 equal small meatballs. Transfer to a plate. Carefully add the meatballs to the simmering sauce and cover with the lid ajar. Simmer until the sauce is thickened and the meatballs are cooked through with no sign of pink, about 20 minutes. Season with salt. Serve hot."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 medium yellow onion, chopped",
        "4 cloves garlic, minced",
        "2 tablespoons peeled and minced fresh ginger",
        "1 jalapeño or serrano chile, seeded and minced",
        "1 (13 1/2-ounce) can coconut milk (do not shake)",
        "1 teaspoon ground cumin",
        "1/2 teaspoon garam masala",
        "1 cup packed chopped cilantro leaves",
        "1 teaspoon tamarind concentrate (sold at Indian grocers) or fresh lemon juice",
        "Kosher salt",
        "1 pound ground lamb",
        "1/2 cup fresh bread crumbs",
        "1 large egg, beaten",
        "1 teaspoon ground cumin",
        "1/2 teaspoon garam masala",
        "1/2 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Super Bowl",
        "Dinner",
        "Lunch",
        "Meat",
        "Curry",
        "Party",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lamb Meatballs in Green Curry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-meatballs-in-green-curry-sauce-369529"
}
