{
    "directions": [
        "Holding knife parallel to work surface, cut lamb lengthwise, following seam where bone was removed and stopping about 1/2\" before you get all the way through. Open lamb like a book and season all over with salt and pepper. Close, wrap tightly in plastic, and chill at least 8 hours.",
        "Preheat oven to 400°F. Open lamb and arrange garlic on bottom half, leaving a 1\" border. Top with orange slices and olives. Sprinkle with savory and red pepper flakes. Close lamb and tie at 1\" intervals with kitchen twine.",
        "Place lamb on a wire rack set inside a large rimmed baking sheet. Roast until nicely browned, 30–40 minutes. Remove lamb from oven.",
        "Reduce oven temperature to 300°F. Carefully transfer lamb to a large heavy ovenproof pot and add stock, wine, and tomato purée. Cover and braise lamb, basting with braising liquid every 30 minutes, until golden brown and fork-tender, 2 1/2–3 hours. Season with salt and pepper, if needed.",
        "Transfer lamb to a cutting board and let rest at least 30 minutes before slicing. Serve with braising liquid.",
        "DO AHEAD: Lamb can be seasoned 1 day ahead; keep chilled. Lamb can be braised 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1 4–5-pound boneless lamb shoulder",
        "Kosher salt, freshly ground pepper",
        "6 garlic cloves, thinly sliced",
        "2 mandarin oranges or tangerines, unpeeled, thinly sliced into rounds",
        "1 cup Taggiasca or other fruity, brine-cured black olives, pitted, coarsely chopped",
        "2 tablespoons chopped fresh savory or rosemary",
        "1 teaspoon crushed red pepper flakes",
        "1 1/2 cups beef stock or low-sodium chicken broth",
        "1 1/2 cups dry red wine",
        "1 cup tomato purée"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Olive",
        "Roast",
        "Christmas",
        "Hanukkah",
        "Passover",
        "Sukkot",
        "Dinner",
        "Buffet",
        "Orange",
        "Christmas Eve",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lamb Pot Roast with Oranges and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-pot-roast-with-oranges-and-olives-51205470"
}
