{
    "directions": [
        "Place chickpeas in a medium saucepan. Add water to cover by 2\". Let soak overnight.",
        "Drain chickpeas; return to same saucepan. Add 2 whole garlic cloves and cinnamon stick. Add water to cover by 2\". Bring to a boil, then reduce heat to medium and simmer until chickpeas are tender, about 45 minutes. Drain; set aside.",
        "Meanwhile, heat oil in a large heavy pot over medium-high heat. Season lamb with salt and pepper. Working in batches, brown lamb on all sides, about 4 minutes per batch. Transfer lamb to a medium bowl. Add onion to pot; reduce heat to medium, season with salt and pepper, and sauté until soft and beginning to turn golden, about 5 minutes. Add chopped garlic, Ras-el-Hanout , and ginger. Stir for 1 minute. Add tomatoes and lamb with any accumulated juices. Bring to a boil. Add 2 1/2 cups stock. Return to a boil, reduce heat to low, partially cover, and simmer, stirring occasionally, until lamb is tender, about 1 hour 30 minutes.",
        "Stir in chickpeas; simmer until heated through, about 10 minutes. Stir in apricots; simmer until heated through, about 5 minutes. Season with salt and pepper.",
        "Spoon couscous onto a large, shallow platter, forming a large well in center. Spoon tagine into center. Sprinkle cilantro over."
    ],
    "ingredients": [
        "3/4 cup dried chickpeas",
        "5 garlic cloves (2 whole, 3 chopped)",
        "1 large cinnamon stick, broken in half",
        "2 tablespoons olive oil",
        "3 pounds 1\" cubes lamb shoulder",
        "Kosher salt and freshly ground black pepper",
        "1 large onion, diced",
        "5 teaspoons Ras-el-Hanout spice blend",
        "1 tablespoon chopped peeled ginger",
        "1 cup canned diced tomatoes with juices",
        "2 1/2 cups (or more) low-salt chicken stock",
        "1/2 cup halved dried apricots",
        "Steamed couscous",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Dinner",
        "Apricot",
        "Spice",
        "Chickpea",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lamb Tagine With Chickpeas and Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-tagine-with-chickpeas-and-apricots-367761"
}
