{
    "directions": [
        "Combine lamb and 4 cups water in a wide 5-quart heavy pot (add more water to just cover lamb if necessary). Bring to a boil over moderate heat, skimming froth from surface. Once liquid is clear and at a full boil, add pepper and 1 teaspoon salt, then cover and simmer 30 minutes.",
        "While meat is simmering, heat butter in a 12-inch heavy skillet over moderate heat. Add pine nuts and cook, stirring occasionally, until golden, about 5 minutes. Transfer nuts with a slotted spoon to paper towels to drain. Add onion to skillet and cook, stirring occasionally, until softened and golden, about 12 minutes. Stir in turmeric, allspice, cardamom pods, and cinnamon and cook, stirring, until fragrant, about 2 minutes.",
        "Add onion mixture to lamb and simmer, covered, 1 hour. Remove lid and briskly simmer until liquid is reduced by half, about 1 hour more. Add yogurt, gently shaking and swirling pot to incorporate.",
        "Simmer lamb over moderately low heat, uncovered, stirring occasionally in one direction only (or yogurt may curdle), until sauce is slightly thickened and meat is very tender, 30 to 40 minutes. Season sauce with salt and pepper if necessary and discard cinnamon stick.",
        "While sauce simmers, bring remaining 3 cups water with remaining teaspoon salt to a boil in a 3-quart saucepan with a tight-fitting lid. Add rice and stir once, then reduce heat to low and cook, covered, 20 minutes. Slide pan off heat (do not lift) and let stand, covered, 5 minutes. Fluff rice gently with a fork.",
        "Line a 3-quart shallow serving bowl with a single layer of pita halves (reserve remaining pita to serve alongside), then mound rice on top of bread. Spoon 1/2 cup sauce over rice to moisten and arrange meat over rice. Sprinkle with pine nuts and spoon 1/2 cup sauce over meat, then arrange reserved pita and red onions around edge of bowl. Pour remaining sauce through a sieve into a sauceboat or small bowl and serve on the side."
    ],
    "ingredients": [
        "3 lb bone-in lamb shoulder, cut by butcher into 6 large chunks",
        "7 cups water",
        "1/2 teaspoon black pepper",
        "2 teaspoons salt",
        "1/4 cup clarified butter (see cooks' note, below)",
        "1/4 cup pine nuts (1 1/2 oz)",
        "1 large onion, chopped",
        "1 1/2 teaspoons ground turmeric",
        "1/2 teaspoon ground allspice",
        "2 cardamom pods*, lightly cracked",
        "1 (2-inch piece) cinnamon stick",
        "2 cups stabilized whole-milk yogurt",
        "2 cups long-grain white rice",
        "4 (5-inch) rounds pita bread, halved",
        "Accompaniment: 3 small red onions, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Rice",
        "Yogurt",
        "Pine Nut",
        "Spice",
        "Boil",
        "Gourmet"
    ],
    "title": "Lamb in Spiced Yogurt Sauce with Rice and Bread",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-in-spiced-yogurt-sauce-with-rice-and-bread-109441"
}
