{
    "directions": [
        "Place the basmati rice in a large container and cover with several inches of cool water; let stand 30 minutes. Drain.",
        "Heat 1/4 cup oil in a large skillet over medium heat; fry the cloves, cardamom pods, and cinnamon sticks in the hot oil until fragrant, about 1 minute. Add the onions; cook and stir until the onions are lightly browned, about 5 minutes. Stir the garlic paste and ginger paste into the onion mixture; cook until the garlic and ginger is fragrant, about 1 minute more. Sprinkle the cilantro and mint over the mixture and cook 1 minute more.",
        "Add the lamb chops to the skillet; season with salt. Cook and stir the lamb until the meat begins to brown, about 20 minutes.",
        "Stir the tomatoes, green chile peppers, and ground red pepper into the mixture; continue cooking until the oil begins to separate from the gravy, about 10 minutes. Add the yogurt and lemon juice; cover and cook until the lamb is tender, about 15 minutes. Add water as needed to keep the mixture from getting too dry.",
        "Bring the rice, 7 1/2 cups water, and 1 teaspoon salt to a boil in a saucepan until the rice is nearly done yet a little chewy, 10 to 15 minutes; drain any excess water.",
        "Heat 1 tablespoon oil in a small skillet; fry the sliced onion in the hot oil until lightly browned.",
        "Layer about half the rice in the bottom of a deep pot with a lid. Spoon the lamb masala over the rice. Spread the fried onion over the lamb masala. Top with the remaining rice. Stir the saffron and warm milk together in a small bowl; pour over the top layer of rice. Cover the pot with the lid and place the pot over low heat; cook until the rice is thoroughly cooked, about 15 minutes."
    ],
    "ingredients": [
        "2 1/2 cups basmati rice",
        "1/4 cup cooking oil",
        "8 whole cloves",
        "4 black cardamom pods",
        "4 cinnamon sticks",
        "4 large onions, sliced thin",
        "1 tablespoon garlic paste",
        "1 tablespoon ginger paste",
        "1/4 cup chopped fresh cilantro leaves",
        "3 tablespoons chopped fresh mint leaves",
        "1 pound lamb chops",
        "salt to taste",
        "3 tomatoes, chopped",
        "4 green chile peppers, halved lengthwise",
        "2 teaspoons ground red pepper",
        "2 tablespoons plain yogurt",
        "2 tablespoons lemon juice",
        "7 1/2 cups water",
        "1 teaspoon salt",
        "1 tablespoon vegetable oil",
        "1 onion, sliced",
        "1/2 teaspoon saffron",
        "2 tablespoons warm milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamb (Gosht) Biryani",
    "url": "http://allrecipes.com/recipe/212487/lamb-gosht-biryani/"
}
