{
    "directions": [
        "Sprinkle lamb with salt and pepper. Heat 3 tablespoons oil in heavy large pot over medium-high heat. Working in batches, cook lamb until brown, about 8 minutes. Transfer to large bowl.",
        "Reduce heat to medium. Add carrot rounds, onions and celery to pot. Sauté until vegetables are tender and golden, about 10 minutes. Add garlic, rosemary and oregano. Sauté 1 minute. Stir in tomatoes with juices, 2 cups water, wine and orange peel. Return lamb to pot, pressing to submerge. Bring to boil. Reduce heat to low. Cover; simmer until lamb is just tender, about 2 hours 15 minutes.",
        "Add potatoes, 2-inch carrot pieces, parsnips and olives to pot. Simmer uncovered until vegetables are tender and lamb is very tender, about 30 minutes longer. Using slotted spoon, transfer lamb and vegetables to platter. Boil juices in pot until thickened enough to coat spoon, about 5 minutes. Discard orange peel. Season sauce with salt and pepper.",
        "Spoon sauce over lamb and vegetables and serve."
    ],
    "ingredients": [
        "6 12- to 16-ounce lamb shanks",
        "3 tablespoons olive oil",
        "4 medium carrots, peeled, cut into 1/4-inch-thick rounds",
        "2 1/2 cups chopped onions",
        "1 1/2 cups sliced celery",
        "2 garlic cloves, minced",
        "2 teaspoons dried rosemary",
        "2 teaspoons dried oregano",
        "1 28-ounce can diced tomatoes in juice",
        "2 cups water",
        "2 cups dry red wine",
        "1 3x1-inch piece orange peel (orange part only)",
        "12 baby red-skinned potatoes",
        "6 medium carrots, peeled, cut into 2-inch pieces",
        "6 medium parsnips, peeled, cut into 2-inch pieces",
        "1/2 cup Kalamata olives, pitted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Onion",
        "Potato",
        "Tomato",
        "Vegetable",
        "Braise",
        "Wheat/Gluten-Free",
        "Lamb Shank",
        "Parsnip",
        "Red Wine",
        "Winter"
    ],
    "title": "Lamb Shanks with Potatoes, Parsnips and Kalamata Olives",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-shanks-with-potatoes-parsnips-and-kalamata-olives-5881"
}
