{
    "directions": [
        "Heat 2 tablespoons oil in heavy large Dutch oven over medium-high heat. Add peppers and Sauté until tender and beginning to color, about 8 minutes. Transfer peppers to bowl. Heat remaining 3 tablespoons oil in same Dutch oven over medium-high heat. Add lamb and Sautéuntil cooked through, breaking up with back of spoon, about 6 minutes. Add onion and Sauté until onion is tender, about 6 minutes. Add wine and cayenne pepper and cook 2 minutes. Stir in tomatoes, currants, tomato paste and nutmeg. Reduce heat to medium. Cover and simmer until sauce is very thick and reduced to 6 cups, stirring occasionally, about 1 hour 10 minutes. Season to taste with salt and pepper.",
        "Meanwhile, line large baking sheet with foil. Arrange eggplant slices in layers on prepared sheet, sprinkling each layer with sea salt. Let stand at room temperature 30 minutes.",
        "Preheat broiler. Line another large baking sheet with foil. Pat eggplant slices dry with paper towels. Arrange some of eggplant slices in single layer on second prepared sheet. Brush lightly with olive oil on both sides. Broil until golden brown, about 4 minutes per side. Transfer to platter. Repeat with remaining eggplant.",
        "Boil potatoes in large pot of salted water 5 minutes. Drain. Cool. Cut potatoes into 1/4-inch-thick slices.",
        "Preheat oven to 400°F. Coat 13x9x2-inch glass baking dish with oil. Arrange potatoes in bottom of dish. Arrange half of eggplant slices over potatoes. Pour half of sauce over. Arrange Sautéed peppers over sauce. Arrange remaining eggplant over peppers. Pour remaining sauce over.",
        "Bake moussaka until bubbling around edges, about 45. Spoon off any excess fat. Using back of spoon, press down on moussaka to compact layers. Whisk yogurt and egg yolks in medium bowl to blend. Pour over moussaka, covering completely. Bake until yogurt topping is softly set, about 15 minutes. Transfer baking dish to rack and let stand 20 minutes. (Can be prepared 1 day ahead. Cool. Cover and refrigerate. Rewarm in 400°F. oven until heated through, about 30 minutes.) Spoon moussaka onto plates."
    ],
    "ingredients": [
        "5 tablespoons olive oil",
        "3 large green bell peppers, seeded, cut into 1/2-inch pieces",
        "1 1/2 pounds ground lamb",
        "2 cups chopped onion",
        "2/3 cup dry red wine",
        "1 teaspoon cayenne pepper",
        "2 28-ounce cans Italian-style tomatoes, drained, chopped",
        "1/2 cup dried currants",
        "2 tablespoons tomato paste",
        "Pinch of ground nutmeg",
        "2 large eggplants (about 2 1/4 pounds total), cut lengthwise into 1/4-inch-thick slices",
        "2 teaspoons sea salt",
        "Olive oil",
        "1 pound russet potatoes (about 2 medium), peeled",
        "3 cups plain yogurt (do not use low-fat or nonfat)",
        "3 large egg yolks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Lamb",
        "Potato",
        "Tomato",
        "Bake",
        "Yogurt",
        "Casserole/Gratin",
        "Eggplant",
        "Bell Pepper",
        "Winter"
    ],
    "title": "Lamb Moussaka with Currants",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-moussaka-with-currants-359"
}
