{
    "directions": [
        "Place trimmed lamb in large bowl; sprinkle generously with salt and pepper. Cover and let stand at room temperature 30 minutes.",
        "Combine 1 cup chopped parsley, minced garlic, and grated lemon peel in small bowl. Reserve remaining 1/4 cup parsley for garnish.",
        "Heat oil in heavy large pot over high heat. Working in batches, add lamb and cook until well browned on all sides, about 7 minutes per batch. Transfer lamb to medium bowl. Add leeks and onion to drippings in pot and sauté until softened, about 7 minutes. Add chopped parsley mixture and thyme; stir 30 seconds. Return lamb and any accumulated juices to pot. Add 1 1/2 cups broth and bring to boil. Reduce heat to medium-low; cover and simmer until lamb is very tender, about 1 1/2 hours.",
        "Lamb stew can be prepared 1 day ahead of serving. Cool slightly. Refrigerate stew uncovered until cold, then cover and keep refrigerated. Bring lamb stew to simmer before continuing with recipe.",
        "Fill medium bowl with cold water. Squeeze juice from lemon half into water; add squeezed lemon half. Break off tough outer leaves from 1 artichoke where leaves break naturally, stopping when first yellow leaves are reached. Cut off stem and top 1/2 inch from artichoke, then cut artichoke in half lengthwise and drop into lemon water. Repeat with remaining artichokes.",
        "Drain artichokes and add to lamb stew. Bring to boil. Reduce heat to medium-low; cover and simmer until artichokes are tender, adding more broth by 1/4 cupfuls if stew is dry, about 25 minutes. Season stew to taste with salt and pepper. Transfer to bowl; sprinkle lamb stew with reserved 1/4 cup chopped parsley and serve with Mock Risotto alongside."
    ],
    "ingredients": [
        "3 1/2 pounds boneless lamb shoulder meat, trimmed of excess fat, cut into 2-inch pieces",
        "1 1/4 cups chopped fresh Italian parsley",
        "3 garlic cloves, minced",
        "1 tablespoon finely grated lemon peel",
        "3 tablespoons olive oil",
        "2 large leeks (white and pale green parts only), thinly sliced (about 2 1/2 cups)",
        "1 large onion, thinly sliced",
        "3/4 teaspoon dried thyme",
        "1 1/2 cups (or more) low-salt chicken broth",
        "1/2 lemon",
        "18 baby artichokes (about 1 3/4 pounds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Lamb",
        "Onion",
        "Stew",
        "Lemon",
        "Artichoke",
        "Leek",
        "Winter",
        "Parsley"
    ],
    "title": "Lamb Stew with Leeks and Baby Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-stew-with-leeks-and-baby-artichokes-235156"
}
