{
    "directions": [
        "Blanch parsley in large pot of boiling salted water for 30 seconds. Drain. Transfer to bowl of ice water and cool. Drain well. Place parsley, 6 tablespoons oil and 6 tablespoons ice water in blender; purée until well blended. Strain into small bowl, pressing on solids to extract as much liquid as possible. Mix in lemon juice. Season with salt and pepper. (Parsley jus can be made 1 day ahead. Cover; chill. Let stand 1 hour at room temperature before serving.)",
        "Preheat oven to 400°F. Sprinkle lamb with cumin, salt and pepper. Heat remaining 2 tablespoons oil in large ovenproof skillet over high heat. Add lamb; cook until brown on all sides, about 3 minutes. Transfer skillet to oven; cook lamb to desired doneness, about 10 minutes for medium-rare. Transfer lamb to cutting board. Tent with foil to keep warm. Let stand 5 minutes. Meanwhile, sauté sausage in heavy medium skillet over medium-high heat until brown, about 4 minutes. Bring stock and curry powder to boil in medium saucepan. Mix in couscous. Cover; remove from heat. Let stand 10 minutes. Fluff couscous with fork. Add sausage and mint; toss to blend. Season couscous to taste with salt and pepper. Slice lamb. Spoon couscous onto plates. Surround with sliced lamb. Spoon parsley jus around lamb and serve."
    ],
    "ingredients": [
        "1 large bunch parsley, stems trimmed",
        "8 tablespoons olive oil",
        "6 tablespoons ice water",
        "1 tablespoon fresh lemon juice",
        "2 2-pound racks of lamb, boned, trimmed",
        "1 1/2 teaspoons ground cumin",
        "7 ounces smoked andouille sausage or hot links, coarsely chopped",
        "1 1/2 cups chicken stock or canned low-salt chicken broth",
        "1/2 teaspoon curry powder",
        "1 cup couscous",
        "3 tablespoons chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Lamb",
        "Roast",
        "Mint",
        "Sausage",
        "Fall",
        "Couscous",
        "Parsley"
    ],
    "title": "Lamb with Sausage-Mint Couscous and Parsley Jus",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-with-sausage-mint-couscous-and-parsley-jus-104099"
}
