{
    "directions": [
        "In a 5-quart heavy-duty Dutch oven, heat 1 tablespoon of the butter and 1 tablespoon of the oil over medium heat. Add the leek, scallions, and garlic, and sauté, stirring occasionally, until just tender, about 5 minutes. Add the spinach, parsley, and dill, and stir constantly until the greens are just wilted. Remove the Dutch oven from the heat and set it aside.",
        "In a 10-inch skillet over medium-high heat, add the remaining butter and olive oil. When hot, add the lamb, a few pieces at a time, and brown on all sides. Season with salt and pepper, and transfer the lamb to the Dutch oven with the greens. The meat may be seared in 2 batches.",
        "Add the turmeric to the same skillet and stir for a few seconds, Add the chicken broth, scraping up any brown bits, and bring to a boil. Pour over the meat and greens mixture. Cover the Dutch oven, bring to a boil over medium heat, then turn the heat to low. Add the lemon juice and zest and simmer for 1 hour.",
        "Stir in the cooked beans and continue to simmer 10 to 15 minutes more, until the beans are hot and the meat is tender. Spoon over a bed of orzo or rice if you wish."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "2/3 cup finely chopped leek, white part only (about 1 medium leek)",
        "1 1/4 cups thinly sliced scallions (about 5 or 6 large scallions)",
        "2 teaspoons finely minced garlic (2 large cloves)",
        "2 pounds fresh crinkly leaf spinach, stems trimmed, or two 10-ounce packages or 1 1/4 pounds frozen spinach",
        "2 cups coarsely chopped fresh parsley (about 4 ounces)",
        "2 tablespoons coarsely snipped fresh dill",
        "1 pound lean lamb, cut into 3/4 inch cubes and dried on paper towels",
        "Salt and pepper to taste",
        "2 tablespoon ground turmeric",
        "1 1/4 cups chicken broth",
        "2 tablespoons lemon juice (about 1/2 large lemon)",
        "1 teaspoon finely grated lemon zest",
        "2 cups cooked white cannellini beans (about 4 ounces dried beans cooked or one 19-ounce can, rinsed and drained)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Lamb",
        "Stew",
        "High Fiber",
        "Leek",
        "Spinach",
        "Dill",
        "Parsley"
    ],
    "title": "Lamb and White Bean Stew with Spinach, Parsley, and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-white-bean-stew-with-spinach-parsley-and-dill-103471"
}
