{
    "directions": [
        "Pour 1/2 cup hot water over posto in a small bowl and let stand.",
        "Melt butter in a 4- to 6-quart heavy pot over moderate heat, then cook cardamom, cinnamon, and bay leaves, stirring, until cardamom starts to pop, about 1 minute. Stir in onions, ginger, and garlic and cook, stirring occasionally, until onions are pale golden, about 15 minutes.",
        "Add lamb, salt, and 1 tablespoon sugar and cook, stirring occasionally, until meat is lightly browned, about 4 minutes. Add chiles, posto (with soaking liquid), and enough hot water (1 to 2 cups) to just cover lamb and simmer, covered, over low heat until lamb is very tender, 1 to 1 1/2 hours.",
        "Season with salt to taste and enough sugar for stew to taste slightly sweet (up to 1 tablespoon). Boil until most of excess liquid is reduced and lamb is coated with thickened sauce, 15 to 25 minutes. Do not eat bay leaves."
    ],
    "ingredients": [
        "1 1/2 to 2 cups hot water",
        "1/2 cup posto (white poppy seeds; 2 oz)",
        "3/4 stick (6 tablespoons) unsalted butter",
        "6 whole green or white cardamom pods",
        "1 (3-inch) cinnamon stick, broken into several pieces",
        "4 Turkish bay leaves or 2 California",
        "2 large onions, halved lengthwise, then thinly sliced lengthwise",
        "1 (2-inch) piece fresh ginger, peeled and minced (2 1/2 tablespoons)",
        "8 garlic cloves, minced (2 tablespoons)",
        "2 lb boneless lamb shoulder, trimmed and cut into 1-inch cubes",
        "2 teaspoons salt",
        "1 to 2 tablespoons sugar",
        "6 (3-inch) whole dried red chiles",
        "Accompaniment: steamed white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Lamb",
        "Braise",
        "Quick & Easy",
        "Summer",
        "Cinnamon",
        "Poppy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Lamb with White Poppy Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-with-white-poppy-seeds-108391"
}
