{
    "directions": [
        "Combine apple juice and sugar in small saucepan. Bring to boil over medium–high heat, stirring until sugar dissolves. Add quince slices and thyme sprigs. Reduce heat to medium–low, cover, and simmer until quince is tender, about 20 minutes. Strain, reserving quince and juices separately. Discard thyme sprigs.",
        "Sprinkle lamb with salt and pepper. Heat 1 tablespoon oil in heavy large skillet over medium–high heat. Add lamb; cook to desired doneness, about 2 1/2 minutes per side for rib chops and 3 1/2 minutes per side for loin chops for medium–rare. Transfer lamb to platter; cover to keep warm. Pour off drippings from skillet; place skillet over medium heat. Add reserved quince juices; boil until reduced to 1/4 cup, scraping up any browned bits, about 2 minutes. Remove skillet from heat; stir in vinegar, butter, oregano, rosemary, and 1/2 teaspoon chopped thyme. Season pan sauce to taste with salt and pepper.",
        "Top lamb with poached quince. Spoon pan sauce over and serve."
    ],
    "ingredients": [
        "1 cup unsweetened apple juice",
        "1/4 cup sugar",
        "1 quince, peeled, cored, cut into 1/4–inch–thick slices",
        "3 fresh thyme sprigs plus 1/2 teaspoon chopped fresh thyme",
        "8 3/4–inch–thick lamb rib chops or eight 1 1/4–inch–thick lamb loin chops",
        "1 tablespoon vegetable oil",
        "1 tablespoon aged balsamic vinegar",
        "1 tablespoon butter",
        "1/2 teaspoon chopped fresh oregano",
        "1/2 teaspoon chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Lamb",
        "Dinner",
        "Apple",
        "Quince",
        "Lamb Chop",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lamb Chops with Poached Quince and Balsamic Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-with-poached-quince-and-balsamic-pan-sauce-236785"
}
