{
    "directions": [
        "Toast the coriander seeds over medium-low heat until they begin to turn brown and pop. Repeat the toasting process with the cumin seeds, then with the dried red peppers. Transfer each ingredient to a food processor or spice grinder as you finish. Add the salt and grind to a fine powder.  Mix with the garlic and ginger to form a thick paste.",
        "Sprinkle the turmeric over the lamb, stirring lightly to coat. Toast the fennel seeds as above and set aside.  Heat a Dutch oven over medium heat with the ghee and vegetable oil; cook the onions until golden brown, about 10 minutes.  Stir in your curry paste and fry for 1 minute.  Stir in the meat and fry for 1 minute more.  Pour in 2/3 of the can of coconut milk and 1 cup of water; bring to a boil, then reduce the heat to low. Simmer for 10 minutes.",
        "Stir in the remaining coconut milk and 1 cup of water, along with the cardamom pods, cinnamon stick, and toasted fennel seeds.  Cover with the lid ajar and return to a simmer, cook for about 1 1/2 hours until the lamb is tender. Stir occasionally and thin with water if the sauce becomes too thick while cooking.",
        "When the lamb is tender, stir in garam masala, sugar, and the tamarind paste dissolved in 3 tablespoons of water; cook 5 minutes longer, or until the sauce thickens.  Remove the cinnamon stick and cardamom pods before serving."
    ],
    "ingredients": [
        "Curry Paste",
        "1 1/2 tablespoons coriander seeds",
        "1 1/2 teaspoons cumin seeds",
        "1/2 teaspoon salt",
        "5 whole dried red chile peppers",
        "6 fresh curry leaves",
        "3 tablespoons garlic paste",
        "2 teaspoons ginger paste",
        "1 1/2 teaspoons ground turmeric",
        "2 1/4 pounds lamb meat, cut into 1 1/2 inch cubes",
        "1/2 cup ghee (clarified butter), melted",
        "1/4 cup vegetable oil",
        "4 onion, sliced 1/4 inch thick",
        "1 (13.5 ounce) can coconut milk",
        "2 cups water, divided",
        "1 teaspoon fennel seeds",
        "6 cardamom pods",
        "1 cinnamon stick",
        "1 1/2 teaspoons garam masala",
        "1 teaspoon sugar",
        "3 tablespoons warm water",
        "1 tablespoon tamarind paste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamb Madras Curry",
    "url": "http://allrecipes.com/recipe/99870/lamb-madras-curry/"
}
