{
    "directions": [
        "In a small skillet, warm 6 tablespoons olive oil, poppy seeds, sesame seeds, dried garlic, dried onion, and coarse salt over medium-low heat until the spices just start to sizzle and turn very light brown, about 2 minutes. Quickly pour into a heat-safe bowl and allow to cool completely.",
        "Season the lamb chops with 1/2 teaspoon kosher salt and 1/4 teaspoon pepper; set aside.",
        "In a large skillet, heat remaining 1 tablespoon olive oil over medium heat. Add onion and 1/4 teaspoon kosher salt and sauté until soft, 2 to 3 minutes. Add carrots and sauté until softened and starting to brown, about 6 minutes. Add garlic, 2 teaspoons harissa, cumin, and paprika and cook, stirring, until fragrant, 30 seconds to 1 minute more. Add broth and scrape up brown bits from bottom of pan. Stir in chickpeas, tomatoes, remaining 1/4 teaspoon kosher salt, and 1/4 teaspoon pepper. Bring to a boil, reduce to a simmer, and cook until thickened, about 5 minutes. Taste and adjust seasoning, adding more harissa if desired.",
        "In a large skillet (preferably cast iron) over high heat, heat vegetable oil. Sear chops, working in batches if necessary, 3 minutes per side, until the internal temperature reaches 125°F for medium rare.",
        "Mix yogurt with lemon juice. Gently fold in 1 tablespoon everything-bagel-spiced olive oil.",
        "To serve, spoon the chickpea mixture onto the plate. Top each chop with a dollop of yogurt. Finish with an additional drizzle of the spiced oil. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "7 tablespoons olive oil, divided",
        "2 1/2 teaspoons poppy seeds",
        "2 1/2 teaspoons sesame seeds",
        "2 teaspoons dried minced garlic",
        "2 teaspoons dried minced onion",
        "1 teaspoon coarse salt",
        "8 1-inch-thick lamb rib or loin chops (about 1 1/2 pounds)",
        "1 teaspoon kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper, divided",
        "1/2 cup chopped yellow onion",
        "1/2 pound carrots, peeled, cut into 1/4-inch-thick slices on a bias",
        "2 garlic cloves, minced",
        "2 teaspoons to 2 tablespoons harissa paste (depending on heat and saltiness)",
        "1 teaspoon ground cumin",
        "1/2 teaspoon smoked paprika",
        "1/3 cup low-sodium chicken broth",
        "1 15-ounce can chickpeas, rinsed and drained",
        "1 15-ounce can diced tomatoes",
        "1 tablespoon vegetable oil, such as grapeseed",
        "3/4 cup plain Greek yogurt (full-fat or low-fat)",
        "2 teaspoons lemon juice",
        "2 tablespoons chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Kid-Friendly",
        "Yogurt",
        "Lamb Chop",
        "Chickpea",
        "Carrot",
        "Cumin",
        "Paprika",
        "Quick and Healthy"
    ],
    "title": "Lamb Chops with Everything-Bagel Yogurt and Chickpeas",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-with-everything-bagel-yogurt-and-chickpeas-51248810"
}
