{
    "directions": [
        "Heat small skillet over medium-high heat. Add coriander and caraway seeds to dry skillet; toast until aromatic and slightly darker in color, stirring frequently, about 3 minutes. Finely grind in mortar with pestle or in spice mill. Transfer spice mixture to medium bowl. Add mint, salt, turmeric, crushed red pepper, and 1 tablespoon oil; mix to paste. Add lamb; toss to coat. Cover and chill at least 8 hours or overnight.",
        "Heat remaining 2 tablespoons oil in large pot over medium heat. Add lamb mixture and onions; sauté until outside of meat is no longer pink and onions begin to soften, about 8 minutes. Add crushed tomatoes, garlic, cinnamon stick, and bay leaf. Bring to simmer. Add carrots, then cabbage; sprinkle with coarse salt and pepper. Add 1 1/2 cups water and 2 tablespoons lemon juice to pot; stir to combine. Bring to boil. Reduce heat to low; cover and simmer until meat and cabbage are tender, stirring occasionally, 1 1/2 to 1 3/4 hours.",
        "Meanwhile, place fresh beans, if using, in small saucepan. Add pinch of coarse salt and just enough water to cover beans. Simmer uncovered until just tender, 10 to 30 minutes, depending on kind of bean. Drain.",
        "Remove cinnamon stick and bay leaf from stew. Add cooked beans (or canned beans, if using) and remaining 1 tablespoon lemon juice. Simmer 5 minutes to allow flavors to blend. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Refrigerate uncovered until cool; cover and keep chilled. Rewarm over medium heat, stirring occasionally.",
        "Stir parsley into stew. Divide stew among bowls. Sprinkle with ground cumin."
    ],
    "ingredients": [
        "2 teaspoons coriander seeds",
        "1 teaspoon caraway seeds",
        "1 teaspoon dried mint, crumbled",
        "3/4 teaspoon coarse kosher salt",
        "1/4 teaspoon turmeric",
        "1/4 teaspoon dried crushed red pepper",
        "3 tablespoons extra-virgin olive oil, divided",
        "1 3/4 pounds trimmed boneless lamb shoulder, cut into 11/2-inch cubes",
        "2 cups chopped onions",
        "1 2/3 cups canned crushed tomatoes with added puree",
        "4 garlic cloves, minced",
        "1 small cinnamon stick, broken in half",
        "1 bay leaf",
        "1 1/4 cups coarsely chopped peeled carrots",
        "1 small green cabbage (about 1 pound), quartered, cored, cut into 1/4-inch slices (about 7 cups)",
        "Coarse kosher salt",
        "1 1/2 cups water",
        "3 tablespoons fresh lemon juice, divided",
        "1 1/2 cups shelled fresh shell beans (such as cranberry, cannellini, flageolet, or pinto; from about 1 pound unshelled)",
        "1/4 cup chopped fresh Italian parsley",
        "Ground cumin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Lamb",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Healthy",
        "Cabbage",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Lamb and Cabbage Stew with Fresh Shell Beans",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-cabbage-stew-with-fresh-shell-beans-355233"
}
