{
    "directions": [
        "Preheat broiler.",
        "On a plate, stir together oregano, 1 tablespoon lemon juice and 1 teaspoon oil. Dip both sides of lamb chops in mixture to coat and put on rack of a broiling pan, seasoning both sides of chops with salt and pepper.",
        "In a bowl, stir together olives, tomato, onion, parsley, zest, remaining teaspoon lemon juice, remaining teaspoon oil and salt and pepper to taste.",
        "Broil lamb chops 2 inches from heat 4 to 5 minutes on each side for medium-rare meat.",
        "Spoon olive salsa over lamb chops.",
        "In a saucepan combine potatoes with salted water to cover by 1 inch and simmer until just tender, 8 to 10 minutes. In a colander, rinse potatoes under cold water to stop cooking and drain well.",
        "In a bowl, stir together yogurt, garlic paste, and mint. Add cucumbers and potatoes to yogurt mixture with salt and pepper to taste and toss well."
    ],
    "ingredients": [
        "1/2 teaspoon dried oregano, crumbled",
        "1 tablespoon plus 2 teaspoon fresh lemon juice",
        "2 teaspoons olive oil",
        "four 1-inch-thick rib lamb chops (about 1 pound total)",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and chopped coarse",
        "1 plum tomato, seeded and diced",
        "1/4 cup diced red onion",
        "1 tablespoon chopped fresh parsley leaves",
        "1/2 teaspoon freshly grated lemon zest",
        "1 pound boiling potatoes (about 3), peeled and cut into 1-inch pieces",
        "1/4 cup plain yogurt",
        "1 small garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "1 tablespoon chopped fresh mint leaves or 1 teaspoon dried, crumbled",
        "1 small cucumber, halved lengthwise, seeded and cut into 1/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Potato",
        "Broil",
        "Yogurt",
        "Mint",
        "Lamb Chop",
        "Cucumber",
        "Gourmet"
    ],
    "title": "Lamb Chops with Olive Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-with-olive-salsa-10101"
}
