{
    "directions": [
        "Set strainer lined with double layer of cheesecloth over medium bowl. Place yogurt in strainer; cover and chill 3 to 5 hours to drain. Transfer yogurt to small bowl. Stir in mint; season with salt and pepper. (Can be made 1 day ahead. Chill.)",
        "Place 1/2 cup warm water and saffron in small bowl; let stand at least 20 minutes to infuse.",
        "Sprinkle lamb with salt and pepper. Heat 2 tablespoons oil in heavy large pot over medium-high heat. Working in batches, cook lamb until brown on all sides, adding more oil as needed, about 5 minutes per batch. Transfer lamb to large bowl. Pour all but 1 tablespoon fat from pot (or add 1 tablespoon oil if dry); heat pot over medium heat. Add onions; sprinkle with salt and pepper. Sauté until beginning to brown, about 5 minutes. Add lemon, garlic, ginger, cinnamon, and cayenne. Stir 1 minute. Add saffron mixture; stir, scraping up browned bits. Add tomatoes with juice, figs, and lamb with any juices to pot. Stir to coat. Add 2 1/2 cups broth.",
        "Bring stew to boil. Reduce heat to medium-low, then cover with lid slightly ajar and simmer until meat is tender, stirring occasionally and adding more broth by 1/4 cupfuls as needed if dry, about 1 1/2 hours. Season to taste with salt and pepper. (Can be made 2 days ahead. Cool slightly. Refrigerate uncovered until cold, then cover and chill.)",
        "Bring stew to simmer, thinning with more chicken broth if necessary. Divide stew among 6 plates; top each serving with dollop of minted yogurt. Place wedge of Crispy Noodle Cake alongside each and serve."
    ],
    "ingredients": [
        "1 1/2 cups plain whole-milk yogurt",
        "3 tablespoons chopped fresh mint",
        "1/2 cup warm water",
        "1/4 teaspoon saffron threads, crumbled",
        "1 2 1/2- to 3-pound boneless lamb shoulder, trimmed, cut into 1- to 1 1/2-inch cubes",
        "2 tablespoons (or more) olive oil",
        "2 onions (about 1 pound), thinly sliced",
        "1 small lemon (preferably Meyer), ends trimmed, quartered lengthwise, thinly sliced crosswise",
        "4 garlic cloves, minced",
        "1 rounded teaspoon minced peeled fresh ginger",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon cayenne pepper",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1 cup dried figs, stems trimmed, quartered lengthwise (about 4 ounces)",
        "2 1/2 cups (or more) low-salt chicken broth",
        "Crispy Noodle Cake"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Lamb",
        "Onion",
        "Tomato",
        "Stew",
        "Yogurt",
        "Lemon",
        "Fig",
        "Mint",
        "Winter"
    ],
    "title": "Lamb Stew with Lemon and Figs",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-stew-with-lemon-and-figs-233923"
}
