{
    "directions": [
        "Pat lamb dry and season with 1 teaspoon salt and 3/4 teaspoon pepper. Heat oil in a wide 5-to 6-quart heavy pot over medium-high heat until it shimmers. Brown lamb on all sides in 3 batches until golden-brown, 4 to 5 minutes per batch, transferring to a plate with a slotted spoon.",
        "Add onions to pot and cook, stirring occasionally, until golden-brown, about 8 minutes. Add garlic and cook, stirring, 1 minute. Stir in vinegar and cook, scraping up brown bits, until vinegar has evaporated, 1 to 2 minutes.",
        "Return lamb with meat juices to pot. Stir in stock, chickpeas, preserves, and spices (including Maras and Urfa pepper) and simmer, uncovered, stirring occasionally, 1 hour.",
        "Peel potatoes and cut into 1/2-inch pieces. Add to stew (after 1 hour) and simmer, uncovered, until potatoes and lamb are tender, about 30 minutes more. Remove from heat and stir in currants, oregano, and lemon juice. Season with salt.",
        "Serve sprinkled with additional Maras and Urfa pepper."
    ],
    "ingredients": [
        "2 pounds lamb shoulder, cut into 3/4-inch chunks",
        "2 tablespoons olive oil",
        "2 medium onions, thinly sliced",
        "6 garlic cloves, thinly sliced",
        "1/4 cup red-wine vinegar",
        "7 cups reduced-sodium chicken stock or broth",
        "1 (15-to 19-ounces) can chickpeas, rinsed and drained",
        "1/4 cup apricot preserves or minced dried Turkish apricots",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cumin",
        "1 teaspoon ground cinnamon",
        "1 teaspoon Maras pepper plus more for sprinkling",
        "1 teaspoon Urfa pepper plus more for sprinkling",
        "1 1/2 pounds boiling potatoes (about 4 medium)",
        "1/4 cup dried currants",
        "1/4 cup chopped oregano",
        "1 1/2 tablespoons fresh lemon juice, or to taste",
        "Accompaniment: rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Lamb",
        "Stew",
        "Dinner",
        "Dried Fruit",
        "Family Reunion",
        "Cinnamon",
        "Potluck",
        "Cumin",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lamb Stew with Turkish Flavors",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-stew-with-turkish-flavors-352832"
}
