{
    "directions": [
        "Mix first 6 ingredients in small bowl; rub all over lamb. Let stand 30 minutes.",
        "Preheat oven to 350°F. Heat oil in large ovenproof pot over medium-high heat. Add lamb and sauté until brown, turning with tongs, about 12 minutes; transfer to plate. Reduce heat to medium. Add capocollo and stir 1 minute. Add onion, carrots, and celery. Cover and cook until vegetables are soft, stirring occasionally, about 10 minutes. Mix in garlic; cook 1 minute. Mix in lemon peel strips, bay leaves, and thyme. Add wine and bring to boil, scraping up browned bits. Add tomatoes and broth. Return lamb to pot. Bring to boil; cover and transfer pot to oven.",
        "Cook lamb until just tender, turning occasionally, about 1 1/2 hours. Remove pot from oven. Tilt pot and spoon off fat that rises to top of sauce. Place pot over medium heat and boil uncovered until sauce reduces enough to coat spoon and lamb is very tender, about 30 minutes. Season to taste with salt and pepper. Discard lemon peel and bay leaves. (Can be made 1 day ahead. Cool 30 minutes, chill uncovered until cold, then cover and keep chilled. Rewarm over low heat before continuing.)",
        "Mix parsley, grated lemon peel, and 1/2 teaspoon pepper in small bowl for gremolata. Transfer lamb to large shallow bowl. Sprinkle with gremolata and serve."
    ],
    "ingredients": [
        "2 teaspoons salt",
        "2 teaspoons chopped fresh rosemary",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon fennel seeds",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground coriander",
        "4 large lamb shanks",
        "3 tablespoons olive oil",
        "2 ounces thinly sliced capocollo or pancetta, cut into thin strips",
        "1 1/2 cups chopped onion",
        "1 cup chopped carrots",
        "1/2 cup chopped celery",
        "6 garlic cloves, chopped",
        "3 3 x 1/2-inch strips lemon peel",
        "2 small bay leaves",
        "2 teaspoons chopped fresh thyme",
        "2 cups dry white wine",
        "2 cups drained canned diced tomatoes in juice",
        "1 1/2 cups low-salt chicken broth",
        "3 tablespoons chopped fresh parsley",
        "1 tablespoon grated lemon peel",
        "1/2 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Lamb",
        "Tomato",
        "Braise",
        "Sauté",
        "Ham",
        "Celery",
        "Carrot",
        "White Wine",
        "Winter"
    ],
    "title": "Lamb Shanks with Tomatoes and Fresh Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-shanks-with-tomatoes-and-fresh-herbs-107646"
}
