{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F. Oil a 9-inch glass or ceramic pie plate with 1 teaspoon oil.",
        "Cook onion with salt in remaining tablespoon oil in a 10-inch heavy skillet over moderate heat, stirring occasionally, until softened and beginning to brown, 7 to 9 minutes.",
        "While onion is cooking, cook orzo in a 2-quart pot of boiling salted water until al dente. Reserve 1/4 cup cooking water, then drain orzo in a sieve.",
        "Spread half of onion in pie plate. Add lamb to remaining onion in skillet and cook, breaking up large clumps with a fork, until meat is no longer pink, about 3 minutes. Remove from heat and stir in orzo, reserved cooking water, 1 tablespoon dill, and salt and pepper to taste.",
        "Stir tomatoes into onion in pie plate and season with salt and pepper. Nestle bell pepper halves, cut sides up, in tomato and onion mixture and season with salt and pepper. Divide lamb mixture between bell pepper halves, then cover pie plate with a sheet of oiled foil (oiled side down) and bake until pepper is tender when pierced with a fork, 25 to 30 minutes. Sprinkle with remaining 1/2 tablespoon dill."
    ],
    "ingredients": [
        "1 tablespoon plus 1 teaspoon extra-virgin olive oil",
        "1 medium onion, coarsely chopped",
        "1/4 teaspoon salt",
        "3 tablespoons orzo ( 1 1/4 ounce)",
        "1/4 pound ground lamb",
        "1 1/2 tablespoons chopped fresh dill",
        "2 medium tomatoes, coarsely chopped (1 cup)",
        "1 small orange bell pepper with stem (6 to 8 ounces), halved lengthwise through stem, then ribs and seeds discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Pasta",
        "Pepper",
        "Tomato",
        "Bake",
        "Winter",
        "Gourmet"
    ],
    "title": "Lamb and Orzo Stuffed Pepper with Chunky Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-orzo-stuffed-pepper-with-chunky-tomato-sauce-230752"
}
