{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Generously season lamb chops with salt and black pepper.",
        "Heat vegetable oil in a Dutch oven over high heat. Place lamb chops in Dutch oven and cook until browned on all sides, about 8 minutes. Transfer lamb to a plate and reduce heat to medium.",
        "Stir onion and a pinch of salt into the Dutch oven; cook until onions are slightly golden, about 3 minutes. Stir in garlic and cook for 30 seconds.",
        "Pour pomegranate juice into the Dutch oven and scrape any browned bits off of the bottom of the pot. Pour in balsamic vinegar, increase heat to high, and bring to a boil.",
        "Stir rosemary, mint leaves, and red pepper flakes into pomegranate juice mixture. Continue to boil until liquid is reduced by half, about 10 minutes. Return lamb and any accumulated juices to Dutch oven, spoon pomegranate mixture over lamb, and cover.",
        "Cook in the preheated oven until meat is fork tender, about 2 hours. Transfer lamb to a plate and set Dutch oven on the stovetop over high heat. Bring pomegranate mixture to a boil; cook, skimming any fat that accumulates, until liquid is reduced by 1/3, about 5 minutes.",
        "Stir in honey and season with salt and black pepper to taste. Return lamb to the Dutch oven; stir to combine. Garnish with pomegranate seeds, sliced mint leaves, and pumpkin seeds."
    ],
    "ingredients": [
        "3 pounds lamb shoulder blade chops",
        "salt and freshly ground pepper to taste",
        "1 tablespoon vegetable oil",
        "1 onion, sliced",
        "1 pinch salt",
        "4 cloves garlic, sliced",
        "2 cups pomegranate juice",
        "1/3 cup aged balsamic vinegar",
        "1/4 teaspoon dried rosemary",
        "8 fresh mint leaves",
        "1/4 teaspoon red pepper flakes",
        "1 tablespoon honey, or more to taste",
        "salt and ground black pepper to taste",
        "2 tablespoons pomegranate seeds",
        "1 tablespoon sliced fresh mint leaves",
        "1 tablespoon pumpkin seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamb Braised in Pomegranate",
    "url": "http://allrecipes.com/recipe/222191/lamb-braised-in-pomegranate/"
}
