{
    "directions": [
        "Cover stack of phyllo with 2 overlapping sheets plastic wrap and then a damp kitchen towel.",
        "In a small bowl pour boiling water over tomatoes and soak 5 minutes. Thinly slice mushrooms. If using brine-cured olives, pit them. Thinly slice olives. Drain tomatoes well and thinly slice.",
        "In a large heavy skillet heat oil over moderately high heat until hot but not smoking and sauté mushrooms with salt and pepper to taste, stirring, until liquid they give off has evaporated. With a slotted spoon transfer mushrooms to a large bowl. Add lamb to skillet and cook, stirring and breaking up any lumps, until no longer pink. Transfer lamb with slotted spoon to bowl with mushrooms and discard fat. Stir tomatoes, olives, rosemary, basil, and red pepper flakes into lamb mixture and cool 10 minutes. Stir in feta, mozzarella, and salt and pepper to taste.",
        "Preheat oven to 425°F and lightly grease a large shallow baking pan.",
        "Stack phyllo between 2 sheets of wax paper and cover with a dry kitchen towel. On a work surface arrange two 20-inch-long sheets of wax paper with long sides overlapping slightly and facing you. Put 1 sheet of phyllo on wax paper and lightly brush with oil. On this, layer and brush 5 more sheets of phyllo in same manner. (Oiled phyllo stack should be 6 sheets thick.)",
        "Spread half of filling in a 3-inch-wide strip, mounding it, on phyllo 4 inches above the near long side, leaving a 2-inch border at each end. Using wax paper as a guide, lift bottom 4 inches of pastry over filling, folding in ends, and tightly roll up strudel. Carefully transfer strudel, seam side down, to baking pan and lightly brush with oil. Make another strudel with remaining ingredients in same manner.",
        "Bake strudels in middle of oven 25 minutes, or until golden. Cool strudels to warm in pan on a rack.",
        "Cut strudels into 1-inch slices with a serrated knife and serve slices warm."
    ],
    "ingredients": [
        "Twelve 17- by 12-inch phyllo sheets",
        "1 1/2 cups boiling water",
        "1/2 cup dried tomatoes not packed in oil (about 2 ounces)",
        "1/2 pound mushrooms",
        "3/4 cup Kalamata or other brine-cured black olives or pitted ripe black olives",
        "1 tablespoon olive oil",
        "1 pound ground lamb",
        "1 teaspoon dried rosemary, crumbled",
        "1 teaspoon dried basil, crumbled",
        "1/2 teaspoon dried hot red pepper flakes",
        "1 1/2 cups crumbled feta (about 8 ounces)",
        "1/2 cup grated mozzarella (about 3 ounces)",
        "About 5 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mushroom",
        "Olive",
        "Tomato",
        "Bake",
        "Winter",
        "Gourmet"
    ],
    "title": "Lamb and Dried-Tomato Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-and-dried-tomato-strudel-14528"
}
