{
    "directions": [
        "Preheat oven to 400°F. Cook turnips in a large saucepan of boiling, salted water until tender, 10-15 minutes. Drain. Return to pan; add cream. Bring to a boil. Reduce heat and simmer until cream coats turnips, about 4 minutes. Purée turnip mixture in a food processor or with an immersion blender until smooth. Cover and keep warm.",
        "Meanwhile, heat 1 teaspoon oil in a large ovenproof skillet over medium-high heat. Season lamb with salt and pepper. Cook fat side down until brown, 5-8 minutes.",
        "Turn lamb over. Tuck 4 thyme sprigs under; place in oven. Roast until an instant-read thermometer inserted into center registers 125°F for medium-rare, 15-25 minutes. Let rest on a plate for 10 minutes.",
        "Drain fat from skillet; add Marsala. Bring to a boil. Reduce heat; simmer, stirring and scraping up browned bits from bottom of skillet, until reduced by half, 5-8 minutes.",
        "Meanwhile, heat remaining 2 teaspoons oil in a large skillet over medium heat. Add garlic and remaining thyme sprig; stir until beginning to brown, about 1 minute; discard garlic and thyme sprig. Add spinach by the handful, tossing and allowing it to wilt slightly between additions. Season with salt and pepper. Cook until tender, about 4 minutes.",
        "Cut lamb between bones into chops and serve with spinach, turnip purée, and Marsala sauce."
    ],
    "ingredients": [
        "1 1/2 pounds turnips, peeled, cut into 1\" pieces",
        "Kosher salt",
        "1/2 cup heavy cream",
        "3 teaspoons olive oil, divided",
        "2 1/2 pounds rack of lamb (1 or 2 racks), bones frenched",
        "Freshly ground black pepper",
        "5 sprigs thyme, divided",
        "1 cup dry Marsala",
        "1 garlic clove, peeled",
        "2 bunches flat-leaf spinach, trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Dinner",
        "Rack of Lamb",
        "Spinach",
        "Turnip",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lamb Chops and Spinach and Turnip Purée",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-chops-and-spinach-and-turnip-puree-51144210"
}
