{
    "directions": [
        "Make the rub: Combine the salts, brown sugar, bay leaves, and pepper in a bowl and transfer to a large plate or a baking dish. Dredge the lamb breast in the rub and massage it into the surface of the lamb. (You'll probably have some rub left over.) Shake off any excess rub and let the meat sit, covered, in the refrigerator for 5 days, turning the lamb over once a day.",
        "Rinse the lamb breast thoroughly, pat it dry with paper towels, and allow it to sit uncovered in the refrigerator overnight.",
        "Cook the lamb bacon: Soak the wood chips in water for 30 minutes, then drain and them pat dry. Prepare your smoker. When the temperature inside the smoker has reached 200°F and the wood chips are smoking steadily, add the lamb, and let smoke. Maintain the temperature at 200°F at least until a thermometer inserted into the center of the meat reads 160°F. This will take about 2 hours, but we recommend smoking for 3, as longer cooking enhances the quality of the bacon. Allow the bacon to cool completely in the fridge and store, wrapped, for up to 1 month.",
        "Tip: The size of lamb breasts can vary quite a bit, so be sure to buy yours deboned or boneless. A bone-in breast will lose 30 to 35 percent of its weight upon deboning."
    ],
    "ingredients": [
        "5 tablespoons Diamond Crystal kosher salt",
        "2 teaspoons pink curing salt",
        "3 tablespoons (packed) dark brown sugar",
        "4 dried bay leaves, crushed",
        "1 tablespoon plus 1 teaspoon freshly ground black pepper",
        "1 1 1/2- to 2-pound boneless lamb breast, with silver skin intact",
        "Cherry wood chips, apple wood chips, or other fruit wood chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Marinate",
        "Meat",
        "Smoker",
        "Advance Prep Required"
    ],
    "title": "Lamb Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/lamb-bacon-51115410"
}
