{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).  Grease 10 X 15 inch jelly roll pan. Place a 22 inch length of waxed paper lengthwise in pan.  Smooth paper so it conforms to pan, allowing excess to hang over ends of pan.  Butter the waxed paper.",
        "In a medium bowl, combine flour, baking powder and salt, set aside.",
        "In a large mixing bowl, beat butter, sugar and vanilla until light and fluffy.  Add eggs one at a time, beating well after each addition.",
        "Stir in flour mixture 1/2 cup at a time, blending well after each addition.  Stir in chopped nuts.  Spread evenly in prepared pan.",
        "Bake 10 - 15 minutes, or just until a toothpick inserted in the center comes out clean.  Holding ends of waxed paper, lift cookie base out of pan and place on rack. Cool.",
        "To prepare Glaze: In a large bowl, whisk together powered sugar and cocoa until no lumps remain.  Add vanilla and 4 tablespoons milk. Add enough of the remaining milk to make a smooth, creamy glaze of medium consistency.",
        "Line a large baking sheet with waxed paper.  Place coconut on a large plate.  Cut cookie base in 48 (1 1/4 X 2 1/2 inch) strips.",
        "Use a fork to spear cookie rectangles; dip into chocolate glaze, allowing excess to drip back into bowl.  Place  chocolate dipped cookie on plate of coconut; use 2 forks to turn cookie so that all sides are coated.  Place on prepared baking sheet and refrigerate until glaze is set.  Store in airtight container at room temperature one week; freeze for longer storage."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup butter, softened",
        "3/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "3 eggs",
        "1 cup chopped almonds",
        "5 cups flaked coconut",
        "6 cups confectioners' sugar",
        "2/3 cup unsweetened cocoa powder",
        "2 teaspoons vanilla extract",
        "11 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lamington Bars",
    "url": "http://allrecipes.com/recipe/9955/lamington-bars/"
}
