{
    "directions": [
        "To make the sauce: Melt the butter in a heavy medium saucepan over medium-low heat. Add the flour and whisk for 3 minutes. Whisk in the milk. Increase the heat to medium-high. Whisk the sauce until it comes to a simmer and is thick and smooth, about 3 minutes. Whisk the salt, pepper, and nutmeg into the bechamel sauce.",
        "Preheat the oven to 450 degrees F.",
        "Whisk the ricotta, spinach, 1 cup Parmesan, prosciutto, egg, salt, and pepper in a medium bowl to blend.",
        "Add a tablespoon or 2 of oil to a large pot of boiling salted water. Boil the noodles until just tender but still firm to bite. Drain. Arrange the noodles in a single layer on a baking sheet to prevent them from sticking.",
        "Butter a 13-by-9-by-2-inch glass baking dish. Pour the bechamel sauce over the bottom of the prepared dish. Lay out 4 lasagna noodles on a work surface, then spread a large spoonful (about 3 tablespoons worth) of ricotta mixture evenly over each noodle. Starting at 1 end, roll each noodle like a jelly roll. Lay the lasagna rolls seam side down, without touching, atop the bechamel sauce in the dish. Repeat with the remaining noodles and ricotta mixture. Spoon 1 cup of marinara sauce over the lasagna rolls. Sprinkle the mozzarella and remaining 2 tablespoons of Parmesan over the lasagna rolls. Cover tightly with foil. Bake until heated through and the sauce bubbles, about 20 minutes. Uncover and bake until the cheese on top becomes golden, about 15 minutes longer. Let stand for 10 minutes. Meanwhile, heat the remaining marinara sauce in a heavy small saucepan over medium heat until hot, and serve alongside."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "4 teaspoons all-purpose flour",
        "1 1/4 cups whole milk",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "Pinch ground nutmeg",
        "1 (15-ounce) container whole milk ricotta cheese",
        "1 (10-ounce) package frozen chopped spinach, thawed, squeezed dry",
        "1 cup plus 2 tablespoons grated Parmesan",
        "3 ounces thinly sliced prosciutto, chopped",
        "1 large egg, beaten to blend",
        "3/4 teaspoon salt, plus more for salting water",
        "1/2 teaspoon freshly ground black pepper",
        "1 to 2 tablespoons olive oil",
        "12 uncooked lasagna noodles",
        "2 cups marinara sauce",
        "1 cup shredded mozzarella (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Lasagna Recipes",
        "Pasta Recipes",
        "Cheese",
        "Ricotta",
        "Spinach",
        "Vegetable",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Lasagna Rolls",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/lasagna-rolls-recipe"
}
