{
    "directions": [
        "Cook and stir ground beef, onion, garlic powder, and oregano in a large skillet over medium heat until onion is tender and beef is browned, about 10 minutes. Add tomato sauce and sugar; simmer until sauce is heated through, about 10 minutes.",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 to 10 minutes. Drain.",
        "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch casserole dish.",
        "Mix ricotta cheese, egg, parsley, and 3/4 cup Parmesan cheese together in a bowl.",
        "Place a lasagna noodle on a work surface. Spoon one layer of ricotta cheese mixture, one layer meat sauce, and one layer mozzarella cheese atop the lasagna noodle; top with another lasagna noodle. Roll up the stuffed lasagna noodles in the jelly-roll style; place in the prepared casserole dish. Repeat with remaining lasagna noodles, ricotta cheese mixture, meat sauce, and mozzarella cheese. Spread a spoonful of meat sauce atop each lasagna roll; top with remaining mozzarella cheese and 1/4 cup Parmesan cheese.",
        "Bake in the preheated oven until cheese is melted and bubbling, 30 to 35 minutes."
    ],
    "ingredients": [
        "1 pound ground beef",
        "1/4 white onion, chopped",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried oregano",
        "1 (26 ounce) jar chunky tomato sauce (such as Ragu®)",
        "3 tablespoons white sugar",
        "18 lasagna noodles",
        "1 (15 ounce) container ricotta cheese",
        "1 egg, beaten",
        "2 tablespoons chopped fresh parsley",
        "3/4 cup grated Parmesan cheese",
        "1 (12 ounce) package shredded mozzarella cheese, or as needed",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lasagna Roll Ups II",
    "url": "http://allrecipes.com/recipe/228649/lasagna-roll-ups-ii/"
}
