{
    "directions": [
        "Heat olive oil in a large pot over medium heat. Cook hot and mild sausage, stirring to break up into pieces, until browned, about 5 minutes. Add onions; cook and stir until translucent, about 5 minutes. Stir in garlic, oregano, and red pepper flakes; cook until fragrant, about 2 minutes.",
        "Stir tomato paste into the paste. Fill tomato paste can with water and pour in; mix well. Pour in beef broth, diced tomatoes, crushed tomatoes, and wine. Stir in basil sprigs, salt, and pepper. Bring soup to a boil; reduce heat and simmer until flavors combine, at least 30 minutes.",
        "Mix ricotta cheese, mozzarella cheese, and Parmesan cheese together in a bowl; season with salt and pepper.",
        "Bring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.",
        "Divide pasta among serving bowls; spoon some of the ricotta cheese mixture on top. Ladle soup over cheese mixture."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1 pound hot Italian sausage",
        "1 pound mild Italian sausage",
        "2 sweet onions, chopped",
        "5 cloves garlic, minced",
        "2 teaspoons dried oregano",
        "1 teaspoon red pepper flakes",
        "1 (6 ounce) can tomato paste",
        "1 (48 ounce) can beef broth",
        "1 (14.5 ounce) can diced tomatoes with basil",
        "1 (14.5 ounce) can crushed tomatoes with basil",
        "1/2 cup sweet wine (optional)",
        "2 sprigs fresh basil, or to taste",
        "salt and ground black pepper to taste",
        "1 (8 ounce) container ricotta cheese, or more to taste",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese, or more to taste",
        "1 (16 ounce) package farfalle (bow tie) pasta"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lasagna Soup",
    "url": "http://allrecipes.com/recipe/256873/lasagna-soup/"
}
