{
    "directions": [
        "Cook the lasagna noodles in a large pot of salted boiling water until al dente. Drain, rinse with cold water to cool and lay flat on a sheet of foil. Set aside.",
        "Make the sauce: In a large pot, heat the olive oil over medium-high heat. Add the onion, mushrooms, green pepper and garlic and saute 4 to 5 minutes, until the vegetables are starting to soften. Remove the veggie mixture from the pan, then add the ground beef to the pan and cook, stirring occasionally, until it's totally browned. Drain the excess fat, then add 1/2 teaspoon each salt and pepper, the diced tomatoes, tomato paste, the veggie mixture and 1 tablespoon each parsley and basil and stir to combine. Let the mixture simmer over low heat, 30 minutes.",
        "Make the filling: Combine the ricotta, 1/2 cup mozzarella, 3/4 cup parmesan, the eggs, 1/2 teaspoon each salt and pepper and the remaining 3 tablespoons each parsley and basil. Stir to combine.",
        "Assemble the lasagna: Spoon a thin layer of sauce onto the bottom of a 9-by-13-inch pan or five 6-inch disposable foil loaf pans. Spread 2 to 3 tablespoons ricotta filling on each lasagna noodle, then roll them up so that the cheese is on the inside of the roll. Lay them sideways in the pan(s). (Four roll-ups will fit in each loaf pan, or you can fill a 9-by-13-inch pan.) Top with the remaining sauce and plenty of grated mozzarella and parmesan.",
        "If you're making the roll-ups right away, place the pan(s) on a baking sheet and bake at 375 degrees F for 20 minutes, until hot and bubbly.",
        "Photograph by Steve Giralt",
        "Find this recipe and more in Ree's new book, The Pioneer Woman Cooks: Dinnertime ($30, William Morrow Cookbooks)."
    ],
    "ingredients": [
        "20 lasagna noodles",
        "Kosher salt",
        "2 tablespoons olive oil",
        "1 medium onion, diced",
        "1 cup finely chopped mushrooms (about 3 ounces)",
        "1 green bell pepper, diced (about 1 cup)",
        "3 cloves garlic, minced (about 1 1/2 tablespoons)",
        "2 pounds ground beef",
        "Freshly ground pepper",
        "1 28-ounce can diced tomatoes",
        "1 6-ounce can tomato paste",
        "4 tablespoons minced fresh parsley",
        "4 tablespoons minced fresh basil",
        "1 30-ounce container whole-milk ricotta cheese (about 3 1/3 cups)",
        "1 pound mozzarella, grated (about 3 1/2 cups)",
        "1 cup grated parmesan cheese",
        "2 large eggs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Lasagna Recipes",
        "Meat"
    ],
    "title": "Lasagna Roll-Ups",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/lasagna-roll-ups"
}
