{
    "directions": [
        "To make the meat ragu: Heat the oil in a Dutch oven over medium-low heat. Add the onion and garlic and saute until soft and fragrant, about 8 minutes. Add the ground beef, sausage, salt, basil, Italian seasoning, oregano and pepper to taste and increase the heat to high. Cook, breaking up the meat with a wooden spoon, until browned all over. Add the tomatoes. Pour some of the wine into the empty tomato boxes to rinse out the last bits of tomatoes and add to the pot, along with the remaining wine. Bring the mixture to a boil. Reduce the heat and simmer, partially covered, until the sauce thickens and the flavors come together, about 1 hour. Add a healthy amount of black pepper.",
        "To make the besciamella: Heat the milk in a small saucepan over medium heat until just simmering, then turn off the heat. Meanwhile, melt the butter in a medium heavy-bottomed saucepan over medium-high heat. Add the flour to the butter and cook, whisking constantly, until the mixture thickens and then loosens again, about 2 minutes. Add the hot milk, whisking constantly. Bring to a boil. Add the nutmeg and salt and pepper to taste. Reduce the heat to low and continue to cook, whisking almost constantly, for 2 minutes. Remove from the heat and use immediately.",
        "To make the lasagna: Preheat the oven to 350 degrees F.",
        "Spread an even layer of the meat ragu over the bottom of a 9-by-13-inch baking dish. Arrange 3 lasagna noodles over the sauce lengthwise across the short side of the pan. Avoid overlapping or allowing them to touch the sides of the pan because they will expand as they cook. Press down slightly to let the sauce spread around them. Cover with one-quarter of the besciamella and sprinkle with one-third of the Parmigiano-Reggiano. Add another layer of ragu. Add 3 more noodles, arranging them in the opposite direction from the first layer and breaking 1 of the noodles in half if necessary to fit. Add one-quarter of the besciamella and half of the mozzarella. Make a third layer of ragu, noodles (alternating directions again), besciamella and one-third of the Parmigiano-Reggiano. Add another layer of ragu, then the remaining mozzarella, noodles (alternating the noodles again), besciamella and ragu.",
        "Cover the pan with foil and bake until heated through, about 35 minutes. Remove the foil and continue baking until the top is brown and bubbling, about 20 minutes more. During the last 10 minutes of baking, scatter the remaining Parmigiano-Reggiano all over. Let the lasagna stand for 10 minutes before serving."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "1 yellow onion, finely chopped",
        "2 cloves garlic, pushed through a press",
        "1 pound ground beef",
        "2 links sweet Italian sausage, casings removed",
        "2 links hot Italian sausage, casings removed",
        "2 teaspoons kosher salt",
        "1 teaspoon dried basil",
        "1 teaspoon Italian seasoning",
        "1 teaspoon dried oregano",
        "Freshly ground black pepper",
        "Three 26.5-ounce boxes strained tomatoes, such as Pomi",
        "1 cup dry red wine",
        "3 cups whole milk",
        "1 stick (8 tablespoons) unsalted butter",
        "1/2 cup all-purpose flour",
        "1/8 teaspoon ground nutmeg",
        "Kosher salt and freshly ground white pepper",
        "1 pound no-cook lasagna noodles, such as Barilla",
        "2 1/4 cups finely grated Parmigiano-Reggiano cheese",
        "One 8-ounce package part-skim low-moisture shredded mozzarella"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Lasagna Recipes",
        "Cheese",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Lasagna alla Besciamella",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/lasagna-alla-besciamella"
}
