{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in 1 tablespoon of olive oil. Once the water is boiling, stir in the lasagna noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Drizzle the cooked noodles with about 1 1/2 teaspoons of olive oil to prevent them from sticking together.",
        "Place the tomatoes, juice and all, into the work bowl of a food processor and pulse to puree, about 1 minute. Set the tomatoes aside. Place the onion, carrots, celery, garlic, sage, and rosemary into the food processor, and pulse several times, until the vegetables are minced.",
        "Heat 2 tablespoons of olive oil in a large saucepan over high heat until smoking hot, and add the minced vegetables. Reduce heat to medium, and cook and stir until the vegetables have softened and are just beginning to brown, about 10 minutes. Stir in the ground beef and Italian sausage, and brown the meat, breaking it apart into crumbles as it cooks, about 10 minutes. When the meat is no longer pink, stir in the flour, and cook and stir about 2 more minutes. Pour in the red wine, bring the mixture to a simmer, and cook, stirring occasionally, until the wine has reduced, about 15 minutes. Pour the pureed tomatoes, cream, Parmesan cheese, and cinnamon into the meat sauce, bring to a boil over medium heat, reduce heat to a simmer, and cover the pan. Cook the sauce, stirring occasionally, for 20 minutes. Set the sauce aside.",
        "In a large bowl, mix together the ricotta cheese, eggs, 3/4 pound of shredded mozzarella cheese, and kosher salt and pepper. Reserve 1/4 pound of mozzarella for topping.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with olive oil.",
        "To make the lasagna, lay about 4 noodles in the bottom of the prepared baking dish, running the long way, and slightly overlap them to cover the bottom completely. Spread 1/3 of the ricotta cheese mixture over the noodles, and top with 1/4 of the meat sauce. Top with a second layer of noodles, running the short way. Top the second layer with 1/3 of the ricotta cheese mixture and 1/4 of the meat sauce as before; make a 3rd layer of noodles, the last third of the ricotta mixture, and 1/4 of the meat sauce. Place one more layer of noodles, and top with the last 1/4 of the meat sauce. Sprinkle the reserved mozzarella cheese over the top.",
        "Bake in the preheated oven until the lasagna is bubbling and the cheese is melted and lightly browned, 45 to 55 minutes. Let the lasagna stand about 5 minutes before serving."
    ],
    "ingredients": [
        "1 pound dry lasagna noodles",
        "1 1/2 tablespoons olive oil, divided",
        "1 (28 ounce) can Italian whole peeled tomatoes (such as La Valle®)",
        "1 onion, coarsely chopped",
        "2 carrots, coarsely chopped",
        "2 stalks celery, coarsely chopped",
        "3 cloves garlic, coarsely chopped",
        "1 tablespoon fresh sage",
        "1 tablespoon fresh rosemary",
        "2 tablespoons olive oil",
        "1 pound ground beef",
        "1 pound sweet Italian sausage links, removed from casing and crumbled",
        "2 tablespoons all-purpose flour",
        "1 cup dry red wine",
        "1/4 cup heavy cream",
        "1/2 cup grated Parmesan cheese",
        "1 pinch ground cinnamon",
        "1 (16 ounce) container ricotta cheese, broken apart with a fork",
        "3 eggs, lightly beaten",
        "1 pound shredded mozzarella cheese, divided",
        "kosher salt to taste",
        "freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lasagna Bolognese",
    "url": "http://allrecipes.com/recipe/214579/lasagna-bolognese/"
}
