{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Place the cherry tomatoes on a large baking sheet along with the thyme, oregano and garlic. Dress with 2 tablespoons of the EVOO, season with salt and pepper and toss to coat. Roast until the tomatoes burst, 35 to 45 minutes",
        "Brush the eggplant with the remaining 2 tablespoons EVOO and sprinkle with salt and pepper. Place cut-side down on a baking sheet and roast alongside the tomatoes until soft, 30 to 40 minutes.",
        "Let the tomatoes cool slightly, and then puree them with the basil in a food processor until smooth. Remove the skins from the garlic and puree the sauce with the roasted cloves before transferring the sauce to a bowl.",
        "When the eggplant has cooled, spoon out the flesh and add it into the cleaned bowl of the food processor along with the ricotta, Parmigiano-Reggiano, egg yolks and some salt and pepper. Puree the mixture until smooth and season with more salt and pepper.",
        "Ladle one-third of the tomato sauce into the bottom of a 9-by-13-inch casserole dish. Layer pasta sheets on top, followed by one-half of the eggplant, more pasta sheets, tomato sauce and 1/2 of the mozzarella. Repeat with another layer of pasta sheets, followed by the remaining eggplant, more pasta sheets and the remaining tomato sauce. Top the lasagna with the remaining mozzarella. Bake 1 hour. Let cool 20 minutes before serving."
    ],
    "ingredients": [
        "4 pints cherry tomatoes",
        "2 tablespoons finely chopped fresh thyme",
        "1 tablespoon fresh or 1 teaspoon dried oregano or marjoram",
        "6 cloves garlic in jackets (skins)",
        "4 tablespoons EVOO",
        "Salt and freshly ground black pepper",
        "1/2 cup loosely packed fresh basil leaves, roughly chopped",
        "1 large firm eggplant, halved lengthwise",
        "2 pints fresh ricotta cheese",
        "1 cup grated Parmigiano-Reggiano",
        "2 egg yolks 1 box no-boil lasagna noodles, soaked in lukewarm water 5 minutes",
        "3 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Pasta Recipes",
        "Easy Recipes",
        "Pasta Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Lasagna Recipes",
        "Cheese",
        "Ricotta",
        "Eggplant Recipes",
        "Vegetable",
        "Roasting"
    ],
    "title": "Lasagna with Roasted Eggplant-Ricotta Filling",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/lasagna-with-roasted-eggplant-ricotta-filling-recipe"
}
