{
    "directions": [
        "Heat olive oil in a large pot over medium heat. Cook and stir sausage in hot oil until slightly brown and crumbly, about 5 minutes. Stir onion in sausage; cook and stir until softened, about 6 minutes.",
        "Stir garlic, oregano, and red pepper flakes into onion mixture; cook and stir until fragrant, about 1 minute. Add tomato paste; cook and stir until mixture has a brick-red color, 3 to 4 minutes.",
        "Pour chicken stock, diced tomatoes, and bay leaves into pot; bring to a boil, reduce heat to medium-low, and simmer until flavors combine, about 30 minutes. Add rotini to pot and cook until tender yet firm to the bite, about 8 minutes; drain. Stir in basil and season soup with salt and black pepper.",
        "Stir ricotta cheese, Parmesan cheese, 1/4 teaspoon salt, and pinch black pepper in a bowl until well-combined.",
        "Place a dollop of cheese mixture in the bottom of a soup bowl. Sprinkle some mozzarella cheese over cheese mixture and ladle soup over the top. Repeat with remaining cheese mixture, mozzarella, and soup."
    ],
    "ingredients": [
        "Soup:",
        "2 teaspoons olive oil",
        "1 1/2 pounds bulk Italian sausage",
        "3 cups chopped onion",
        "4 cloves garlic, minced",
        "2 teaspoons dried oregano",
        "1/2 teaspoon red pepper flakes",
        "2 tablespoons tomato paste",
        "6 cups chicken stock",
        "2 (15 ounce) cans fire-roasted diced tomatoes",
        "2 bay leaves",
        "1 (8 ounce) package rotini pasta",
        "1/2 cup finely chopped fresh basil leaves",
        "salt and freshly ground black pepper to taste",
        "Cheesy Yum:",
        "8 ounces ricotta cheese",
        "1/2 cup grated Parmesan cheese",
        "1/4 teaspoon salt",
        "1 pinch freshly ground black pepper",
        "2 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lasagna Soup with Cheesy Yum",
    "url": "http://allrecipes.com/recipe/241855/lasagna-soup-with-cheesy-yum/"
}
