{
    "directions": [
        "Melt 1 tablespoon butter in heavy large skillet over medium heat. Add leeks; cook until wilted, stirring often, about 4 minutes. Transfer to medium bowl. Melt remaining 1 tablespoon butter in same skillet. Add asparagus, mushrooms, and thyme. Sprinkle with salt and pepper; sauté until asparagus is crisp-tender, stirring often, about 4 minutes. Add to bowl with leeks and toss to distribute evenly. Add broth, cream, and bay leaf to same skillet and boil over high heat until slightly thickened, about 6 minutes. Sprinkle flour over and whisk to blend. Boil until sauce thickens, about 1 minute, whisking until smooth. Remove from heat. Stir in nutmeg; discard bay leaf. Season to taste with salt and pepper. DO AHEAD: Vegetables and sauce can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 350°F. Coat four 2-cup shallow oval or round baking dishes with nonstick spray. Break off corners of noodles to fit flatly into dishes. Spoon 1/4 cup sauce into each dish. Place 1 noodle atop sauce. Scatter 1/4 cup vegetable mixture over, spreading in even layer. Drizzle 2 tablespoons sauce over. Sprinkle rounded tablespoonful cheese over each. Repeat layering 2 more times with noodles, vegetables, sauce, and cheese. Drizzle remaining sauce over lasagnas.",
        "Cover each dish tightly with foil. Place on rimmed baking sheet and bake until noodles are tender, about 40 minutes. Uncover and bake until sauce is bubbling and cheese begins to brown, about 6 minutes. Let stand at room temperature 5 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter, divided",
        "2 medium leeks (white and pale green parts only), halved lengthwise, thinly sliced (about 2 cups)",
        "1 pound thick asparagus spears, trimmed, cut on diagonal into 1-inch pieces",
        "4 ounces fresh morel mushrooms, rinsed, coarsely chopped, or 5 ounces fresh shiitake mushrooms, stemmed, coarsely chopped",
        "2 teaspoons chopped fresh thyme",
        "3 1/2 cups low-salt chicken broth",
        "1 1/2 cups heavy whipping cream",
        "1 bay leaf",
        "2 tablespoons all purpose flour",
        "3/4 teaspoon freshly grated nutmeg",
        "Nonstick vegetable oil spray",
        "1 9-ounce package no-cook lasagna noodles (12 noodles)",
        "1 1/4 cups (about) finely grated Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Mushroom",
        "Vegetable",
        "Bake",
        "Dinner",
        "Asparagus",
        "Leek",
        "Spring",
        "Family Reunion",
        "Noodle",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lasagna with Asparagus, Leeks, and Morels",
    "url": "http://www.epicurious.com/recipes/food/views/lasagna-with-asparagus-leeks-and-morels-358231"
}
