{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "Butter a small (approximately 8-by-10-inch) baking dish. Spread a thin film of the Besciamella Sauce on the bottom of the pan. Cover with a fresh pasta sheet, about 1 cup of the Ragu and about 1/2 cup more of the Besciamella. Lightly cover the surface with some of the grated cheese. Repeat this layering process until all of the pasta is used. Bake the lasagna uncovered, rotating once halfway through, 40 to 45 minutes. Allow to cool 1 hour, cut and serve.",
        "Warm the milk and bay leaf over medium-high heat until just below a boil. Melt the butter over medium heat in another saucepot. When the butter is fully melted and begins to bubble rapidly, add the flour and whisk until fully incorporated. Continue to cook over medium heat until a smooth, blond-colored paste is formed, 4 to 5 minutes. Add about half of the scalded milk to the butter and flour paste, whisking constantly. Once it is fully incorporated, add the thickened milk mixture back into the remainder of the scalding milk, whisking continuously to avoid lumps. Reduce the heat to medium-low and cook until the sauce comes to gentle boil and is fully thickened. Season with the salt and nutmeg, whisk to combine and strain through a fine mesh strainer. Cover the surface of the besciamella with plastic wrap to prevent a skin from forming and allow to cool to room temperature.",
        "Place the garlic, celery, onions and carrots in a food processor and process until very finely chopped. Add the oil and butter to a heavy-bottomed pot over medium heat. When the butter is melted, add the mortadella and pancetta and cook until the fat renders and the meats begin to brown slightly. Add the finely chopped vegetables, sprinkle with half of the salt, pepper and nutmeg and cook until softened and most of the liquid has evaporated.",
        "Add the ground beef and pork, breaking apart as much as possible. Sprinkle with the remaining salt, pepper and nutmeg and cook, stirring frequently, until the meat looks fully cooked and begins to brown lightly on the bottom, about 30 minutes. Deglaze with the white wine and allow the liquid to reduce by half. Add the broth, cream and tomato puree. Bring to a simmer and reduce the heat to maintain a gentle simmer. Let the ragu cook 3 to 4 hours, stirring occasionally. Taste for seasoning and adjust, if necessary. Allow to cool, ideally overnight, to allow the flavors to develop."
    ],
    "ingredients": [
        "Butter, for greasing",
        "Besciamella Sauce, recipe follows",
        "Five 8-by-10-inch sheets fresh egg pasta, or cut to the size of the small baking dish you are using",
        "Ragu Bolognese, recipe follows",
        "1 cup finely grated Parmigiano-Reggiano",
        "4 cups whole milk",
        "1 bay leaf, preferably fresh",
        "3 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 tablespoon kosher salt",
        "1/2 teaspoon ground nutmeg",
        "4 cloves garlic",
        "2 stalks celery, roughly chopped",
        "2 medium yellow onions, roughly chopped",
        "1 medium carrot, roughly chopped",
        "1/4 cup extra-virgin olive oil",
        "4 tablespoons unsalted butter",
        "4 ounces mortadella, ground or finely chopped",
        "4 ounces pancetta, ground or finely chopped",
        "2 tablespoons kosher or sea salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground nutmeg",
        "1 1/4 pounds ground beef, at room temperature",
        "1 1/4 pounds ground pork, at room temperature",
        "1 cup dry white wine",
        "2 cups meat broth, preferably homemade",
        "2 cups heavy cream",
        "2 cups concentrated tomato puree"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Lasagna Recipes",
        "Bolognese",
        "Pasta Recipes",
        "Vegetable",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Lasagna Bolognese",
    "url": "http://www.foodnetwork.com/recipes/lasagna-bolognese-recipe"
}
