{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 425°F. Oil a 13- by 9-inch or other 3-quart glass or ceramic baking dish and a large shallow baking pan.",
        "Toss together tomatoes, garlic, 3 tablespoons oil, 1 teaspoon salt, and 1/2 teaspoon pepper in baking dish, then arrange tomatoes, cut sides up, in 1 layer. Toss eggplant with remaining 3 tablespoons oil, 1/2 teaspoon salt, and 1/2 teaspoon pepper in baking pan.",
        "Roast tomatoes and eggplant, switching position of dish and pan halfway through baking, until tomato skins are wrinkled and beginning to brown and eggplant is golden brown and tender, 50 minutes to 1 hour. Cool vegetables slightly in dish and pan on racks. (Leave oven on.)",
        "When tomatoes and garlic are cool enough to handle, transfer to a cutting board (do not clean baking dish). Cut each tomato half lengthwise into 3 pieces and coarsely chop garlic. Transfer to a large bowl, then stir in eggplant and water.",
        "Stir together all filling ingredients until combined well.",
        "Cook pasta in a 6- to 8-quart pot of boiling salted water, uncovered, stirring occasionally, until tender. Drain in a colander and rinse under cold running water. Lay noodles flat on a clean kitchen towel and pat dry with paper towels, then cut in half crosswise (you will have 12 noodles).",
        "Move upper oven rack to middle position.",
        "Spread out half of vegetable mixture in uncleaned baking dish. Lay 4 noodles on a work surface, then spread 3 tablespoons filling evenly over each noodle. Roll up noodles tightly and put rolls, seam sides down and without touching, in vegetable mixture in dish. Make 8 more rolls with remaining noodles and filling in same manner, transferring to dish.",
        "Lightly brush rolls with water, then spoon remaining vegetables over rolls. Cover dish tightly with foil and bake until heated through, about 20 minutes."
    ],
    "ingredients": [
        "2 1/2 pounds plum tomatoes, halved lengthwise",
        "4 garlic cloves, peeled",
        "6 tablespoons olive oil",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "2 pounds eggplant (preferably baby Italian), cut into 1-inch pieces",
        "1/3 cup water",
        "1 pound ricotta (preferably fresh)",
        "1 ounce finely grated Parmigiano-Reggiano (1/2 cup)",
        "1 large egg yolk, lightly beaten",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "3/4 teaspoon freshly grated nutmeg",
        "6 dried lasagne noodles (long, narrow, and curly-edged; not no-boil; 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Bake",
        "Roast",
        "Parmesan",
        "Ricotta",
        "Eggplant",
        "Gourmet"
    ],
    "title": "Lasagne Rolls with Roasted Tomato and Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/lasagne-rolls-with-roasted-tomato-and-eggplant-236985"
}
