{
    "directions": [
        "Whisk milk and vinegar in small bowl to blend. Whisk flour and salt in medium bowl to blend; add shortening and rub in with fingertips until mixture resembles coarse meal. Stir in milk mixture; briefly knead in bowl just until dough comes together. Gather dough into ball. Divide into 2 pieces, 1 slightly larger than the other. Flatten each piece into disk. Wrap disks separately in plastic and refrigerate 30 minutes.",
        "Mix 2/3 cup sugar and next 6 ingredients in large bowl to combine. Add cherries and toss to blend. Let stand 30 minutes.",
        "Preheat oven to 400°F. Roll out larger dough disk on lightly floured work surface to 13-inch round (crust will be thin). Transfer to 10-inch-diameter glass pie dish. Roll out second disk on lightly floured work surface to 12x8-inch rectangle. Using fluted pastry wheel or sharp knife, cut rectangle lengthwise into nine 3/4-inch-wide strips. Spoon cherry filling into crust. Place 5 dough strips across pie in 1 direction and 4 in opposite direction, forming lattice. Press strip ends and edge of crust together to seal. Crimp edges decoratively. Brush lattice and edges with egg glaze. Sprinkle 1/4 cup sugar over lattice.",
        "Bake pie 20 minutes. Cover crust edges with foil collar to prevent overbrowning. Continue to bake until filling bubbles and crust is golden brown, about 40 minutes longer. Transfer pie to rack and cool at least 1 hour. Serve pie warm or at room temperature.",
        "A fluted pastry wheel will cut lattice strips with pretty scalloped edges, but a sharp knife works fine, too."
    ],
    "ingredients": [
        "1/3 cup whole milk",
        "1 tablespoon distilled white vinegar",
        "2 cups all purpose flour",
        "1/2 teaspoon salt",
        "1 cup chilled solid vegetable shortening, cut into 1/2-inch cubes",
        "2/3 cup plus 1/4 cup sugar",
        "3 tablespoons cornstarch",
        "2 tablespoons orange juice",
        "1 tablespoon grated orange peel",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon almond extract",
        "1/8 teaspoon salt",
        "5 cups pitted fresh cherries (about 2 1/2 pounds) or frozen pitted sweet dark cherries, thawed, drained (about 26 ounces frozen)",
        "1 egg, beaten to blend with 2 teaspoons water (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Picnic",
        "Cherry",
        "Summer",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Late-Summer Cherry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/late-summer-cherry-pie-108474"
}
