{
    "directions": [
        "Heat oven to 375°F. Sprinkle tomatoes with salt and place on baking sheet lined with parchment paper; roast 40 minutes. Heat 1 1/2 teaspoons oil in a soup pot over low heat. Cook leek, onion and sliced garlic 10 minutes, stirring occasionally. Add wine, raise heat to high and reduce 5 minutes. Place tomatoes, oregano, 1/4 cup parsley and shelled beans in pot and add enough water to cover vegetables by 1/2 inch. Bring to a boil; reduce heat and simmer, uncovered, 10 minutes. Add flat beans, salt and cayenne; simmer until beans are tender, about 30 minutes. Mix squid with chopped garlic and remaining 2 tablespoons parsley; let stand 30 minutes. When soup is ready, sautésquid: Heat remaining 1 1/2 teaspoons oil in a medium sauté pan over high heat until oil smokes, 2 to 3 minutes. Add squid (oil may splatter) and sauté, stirring, until cooked through, about 2 minutes. Sprinkle with salt. Toast bread; rub with garlic clove. Divide soup among 4 bowls, top each with 1/4 squid mixture and add bread."
    ],
    "ingredients": [
        "4 large tomatoes, cut into chunks",
        "Parchment paper",
        "3 teaspoons olive oil, divided",
        "1 leek, thinly sliced",
        "1/2 medium onion, diced",
        "4 cloves garlic, sliced",
        "1/4 cup red wine",
        "2 sprigs oregano",
        "1/4 cup plus 2 tablespoons chopped flat-leaf parsley",
        "1/4 pound (1 1/2 cups) shelled beans (such as fava, lima or cranberry)",
        "1/4 pound (3/4 cup) flat romano beans, cut into 1-inch lengths",
        "1 1/2 teaspoon salt",
        "1/4 teaspoon cayenne pepper",
        "1/4 pound squid, thinly sliced",
        "1 clove garlic, finely chopped",
        "4 slices crusty bread",
        "1 clove garlic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Tomato",
        "Lunch",
        "Squid",
        "Red Wine",
        "Summer",
        "Healthy",
        "Parsley",
        "Simmer",
        "Self",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Late Summer Tomato Soup with Shell Beans, Squid Rings and Parsley",
    "url": "http://www.epicurious.com/recipes/food/views/late-summer-tomato-soup-with-shell-beans-squid-rings-and-parsley-243585"
}
