{
    "directions": [
        "Mix Greek yogurt and blackberry jam together in a bowl until spread is smooth; refrigerate.",
        "Place potatoes in cheesecloth and wring, extracting as much moisture as possible. Combine potatoes, flour, beaten egg, and salt together in a bowl until thoroughly mixed. Divide potato mixture into 4 equal portions and form into 4-inch patties.",
        "Heat canola oil in a large skillet over medium-high heat. Cook potato patties in the hot oil until golden brown, about 6 minutes per side. Remove latkes from oil and place on a cooling rack, reserving oil in the skillet.",
        "Form breakfast sausage into two 5-ounce patties. Cook patties in the same skillet until browned on the outside and no longer pink in the center, 3 to 5 minutes per side. The internal temperature should be 160 degrees F (73 degrees C). Transfer patties to the cooling rack and top each with Cheddar cheese.",
        "Heat a non-stick skillet and add 2 tablespoons reserved heated oil. Crack 2 eggs into heated oil and cook for about 5 minutes.",
        "Spread blackberry spread onto 2 of the latkes; top with sausage-Cheddar cheese. Add 1 latke to the Cheddar cheese layer of each, creating a sandwich. Top each sandwich with an egg; season with salt and pepper."
    ],
    "ingredients": [
        "Blackberry-Yogurt Spread:",
        "2 tablespoons plain Greek yogurt",
        "1 tablespoon blackberry jam",
        "Latkes:",
        "1 1/2 cups shredded hash brown potatoes (such as Simply Potatoes®)",
        "2 tablespoons all-purpose flour",
        "1 egg, beaten",
        "1/2 teaspoon salt",
        "1/4 cup canola oil",
        "Filling:",
        "10 ounces ground breakfast sausage (such as Jimmy Dean® Maple Sausage)",
        "2 slices Cheddar cheese",
        "2 eggs",
        "1 pinch salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Latkes Breakfast Sandwiches with Blackberry-Yogurt Spread",
    "url": "http://allrecipes.com/recipe/244475/latkes-breakfast-sandwiches-with-blac/"
}
