{
    "directions": [
        "Toast chiles in small skillet over medium heat until darker and aromatic, 1 to 2 minutes per side. Cut in half with scissors. Stem, seed, and tear chiles; grind finely with 1/2 teaspoon coarse salt in spice mill.",
        "Drape smooth kitchen towel over large bowl. Blend potatoes and 1 cup onions in processor until potatoes are very finely ground, scraping down bowl often. Scrape mixture into towel. Gather towel around tightly and squeeze out at least 1 cup liquid.",
        "Scrape dry potato mixture from towel into another large bowl. Add cilantro, egg, masa, 1/2 teaspoon pepper, 1 1/4 teaspoons coarse salt, and 1 cup onions. Stir until mixture becomes moist and sticks together.",
        "Heat 6 tablespoons oil in large nonstick skillet over medium-high heat. For each latke, drop 1 rounded tablespoonful potato mixture into skillet; flatten to 2 1/2-inch round. Fry latkes until golden brown, adding oil as needed, about 3 minutes per side. Transfer to rimmed baking sheet. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 400°F oven until crisp, about 5 minutes per side.",
        "Arrange 3 latkes on each plate; sprinkle with chile salt. Spoon Watercress Guacamole into center. Garnish with watercress sprigs.",
        "Available at many supermarkets and at specialty foods stores and Latin markets.",
        "** Also known as masa harina; available at many supermarkets and at Latin markets."
    ],
    "ingredients": [
        "2 large dried ancho chiles*",
        "1 3/4 teaspoons coarse kosher salt, divided",
        "2 pounds russet potatoes, peeled, diced",
        "2 cups chopped white onions, divided",
        "2 tablespoons chopped fresh cilantro",
        "1 large egg",
        "1 tablespoon masa (corn tortilla mix),** toasted, or plain all purpose flour",
        "1/2 teaspoon freshly ground black pepper",
        "6 tablespoons (or more) vegetable oil",
        "Watercress Guacamole",
        "Fresh watercress sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Egg",
        "Onion",
        "Potato",
        "Appetizer",
        "Hanukkah",
        "Vegetarian",
        "High Fiber",
        "Avocado",
        "Root Vegetable",
        "Tortillas"
    ],
    "title": "Latkes with Ancho-Chile Salt and Watercress Guacamole",
    "url": "http://www.epicurious.com/recipes/food/views/latkes-with-ancho-chile-salt-and-watercress-guacamole-356340"
}
