{
    "directions": [
        "Cut butter into 1/2-inch pieces. In a bowl whisk together flours, sugar, and salt. With your fingertips or a pastry blender blend in butter until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. In a cup with a fork stir together whole egg and yolk until combined well and stir into flour mixture. Stir in vanilla and lemon juice and with hands gently knead mixture just until it forms a dough.",
        "Preheat oven to 350° F.",
        "Form one third dough (about 1/2 pound) into a ball and flatten into a thin disk. Chill disk, wrapped in plastic wrap, while working with remaining two thirds.",
        "Reserve one fourth remaining dough and crumble remainder into an 11-inch tart pan with a removable bottom and pat out dough to evenly cover bottom (not side). With lightly floured hands roll reserved piece of dough into several 1/2-inch-thick ropes. Arrange ropes end-to-end around edge of pastry against rim of pan, pressing gently, to form a shallow side. Spread preserves over bottom.",
        "With a rolling pin roll out chilled dough between 2 sheets plastic wrap into an 11-inch round and transfer in plastic wrap to a baking sheet. Remove top sheet of plastic wrap and with a fluted pastry cutter cut round into 1-inch-wide strips. Freeze dough on baking sheet 10 minutes to firm up dough.",
        "Working quickly, carefully invert dough strips onto baking sheet and remove plastic. Arrange dough strips over tart in an open lattice pattern (do not make a woven lattice), trimming edges to fit inside rim of pan. (Don't worry if strips break while making the lattice. Just lay any broken pieces in place‑they will meld together during baking.) Brush lattice with cold water and sprinkle with sugar. Scatter almonds over crostata and bake in middle of oven 45 minutes, or until lattice is golden. Cool crostata in pan on a rack. Crostata may be made 2 days ahead and kept, loosely covered, at room temperature."
    ],
    "ingredients": [
        "1 3/4 sticks (3/4 cup plus 2 tablespoons) cold unsalted butter",
        "1 1/2 cups all-purpose flour",
        "1 cup cake flour (not self-rising)",
        "1/3 cup sugar",
        "1/4 teaspoon salt",
        "1 whole large egg",
        "1 large egg yolk",
        "1 teaspoon vanilla",
        "1 teaspoon fresh lemon juice",
        "1 1/2 cups apricot preserves",
        "2 tablespoons sugar",
        "1/4 cup sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Bake",
        "Apricot",
        "Almond",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Lattice-Topped Apricot Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/lattice-topped-apricot-crostata-14982"
}
