{
    "directions": [
        "Preheat oven to 375°F. Melt butter in small skillet over medium heat. Scrape seeds from vanilla bean into butter; add bean. Cook until butter is golden brown, stirring often, about 3 minutes. Cool slightly. Remove bean. Gently blend pears, raisins, brown sugar, flour, and lemon juice in large bowl. Stir in vanilla butter.",
        "Roll out 1 dough disk on lightly floured surface to 12-inch round. Transfer to 9-inch pie dish. Trim overhang to 1 inch. Transfer filling to crust. Roll out second dough disk to 13-inch round. Using pastry wheel, cut dough into ten 1-inch-wide strips. Arrange 5 strips over filling, spacing evenly apart. Arrange remaining strips at right angle to first strips, weaving if desired. Fold lower crust overhang over strips and seal. Crimp edges decoratively. Brush lattice with 1 teaspoon milk and sprinkle with 1 tablespoon sugar.",
        "Bake pie until crust is golden brown, pears are tender, and filling is bubbling, covering crust edges with foil collar if browning too quickly, about 1 hour 20 minutes. Cool at least 1 hour before serving. (Can be made 6 hours ahead. Let stand at room temperature.) Serve pie warm or at room temperature with ice cream."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 vanilla bean, split lengthwise",
        "4 pounds ripe pears (such as Bartlett or Anjou; about 8), peeled, cored, cut into 1/2-inch-thick slices",
        "2/3 cup golden raisins",
        "1/2 cup (packed) golden brown sugar",
        "2 tablespoons all purpose flour",
        "1 teaspoon fresh lemon juice",
        "2 Butter Pie Crust Dough disks",
        "1 teaspoon milk",
        "1 tablespoon sugar",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Raisin",
        "Pear",
        "Vanilla",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lattice Pie with Pears and Vanilla Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/lattice-pie-with-pears-and-vanilla-brown-butter-108856"
}
