{
    "directions": [
        "Using a wooden spoon or rubber spatula, stir egg whites, powdered sugar, and cream of tartar in a medium bowl until a thick paste forms with no dry spots. Ideally, glaze should sit at least 12 hours for sugar to fully hydrate, but it can be used as soon as cookies have cooled. Or, you can cover and chill up to 1 week. Bring to room temperature before using.",
        "Whisk rice flour, salt, and 2 1/2 cups all-purpose flour in a medium bowl. Using an electric mixer on medium-high, beat butter, sugar, and lavender in a medium bowl until very pale and fluffy, about 5 minutes. Mix in dry ingredients on low until fully combined. Wrap in plastic and chill at least 2 hours and up to 2 days. Preheat oven to 350°. Roll out dough between 2 sheets of lightly floured parchment to 1/8\" thick. Using large cutter, cut out 16 rounds, rerolling scraps. Using small cutter, punch out centers. Bake on parchment-lined baking sheets until edges are golden, 12-14 minutes. Let cool on a wire rack.",
        "Working quickly, dip tops of cookies into glaze, letting excess drip off. Transfer to wire rack and decorate."
    ],
    "ingredients": [
        "3 large egg whites",
        "4 cups powdered sugar",
        "1/2 teaspoons cream of tartar",
        "1/3 cup rice flour",
        "1 1/2 teaspoons kosher salt",
        "2 1/2 cups all-purpose flour",
        "1 cup plus 6 tbsp unsalted butter, cut into pieces, room temperatur",
        "3/4 cup granulated sugar",
        "1 teaspoon coarsely ground dried lavender",
        "Freeze-dried and/or dried fruits, dried edible flowers, fresh and/or dried herbs (for decorating)",
        "One 3 1/8\"-diameter and one 1 1/4\"-diameter fluted cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "San Francisco"
    ],
    "title": "Lavender Shortbread with Fruits, Flowers, and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/lavender-shortbread-with-fruits-flowers-and-herbs-51259280"
}
