{
    "directions": [
        "1. To make the crust, preheat the oven to 350°F. Process the graham crackers in a food processor until finely ground. Combine the crumbs, melted butter, oats, brown sugar, and salt in a medium-size bowl and stir until moistened. Press into the bottom of a 9-inch pie plate and all the way up the side, packing it tightly with your fingertips so it is even and compacted. Bake until crisp, 6 to 8 minutes. Let cool completely on a wire rack. (The crust may be wrapped in plastic and frozen for up to 1 month.)",
        "2. To make the filling, sprinkle the gelatin over the cold water in a small stainless-steel bowl and let soften for 2 minutes. Whisk together the yogurt and honey in a medium-size bowl.",
        "3. Bring 2 inches of water in a small saucepan to a bare simmer. Set the bowl containing the gelatin over the pan, making sure it doesn't touch the water, and heat, whisking constantly, just until it melts, 30 seconds to 1 minute. Whisk into the yogurt mixture until smooth.",
        "4. In a large bowl, using an electric mixer, whip the heavy cream until it holds stiff peaks. Gently fold the yogurt mixture into the whipped cream, taking care not to deflate the cream. Scrape into the prepared pie shell, cover with plastic wrap, and refrigerate until completely set, at least 6 hours and up to 1 day.",
        "5. To make the topping, when ready to serve, combine the peach slices, honey, and cinnamon in a medium-size bowl. Slice the pie into wedges and serve each slice with some peaches on the side."
    ],
    "ingredients": [
        "11 whole graham crackers (to yield about 1 1/3 cups crumbs)",
        "5 tablespoons unsalted butter, melted",
        "1/2 cup old-fashioned rolled oats (not quick-cooking)",
        "3 tablespoons firmly packed light brown sugar",
        "1/8 teaspoon salt",
        "1 envelope unflavored gelatin",
        "3 tablespoons cold water",
        "1 cup whole-milk yogurt",
        "1/2 cup lavender honey",
        "1 1/2 cups heavy cream, chilled",
        "2 medium-size ripe peaches, peeled, pitted, and cut into 1/4-inch-thick slices",
        "2 tablespoons lavender honey",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Yogurt",
        "Summer",
        "Chill",
        "Honey",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lavender Honey and Yogurt Pie",
    "url": "http://www.epicurious.com/recipes/food/views/lavender-honey-and-yogurt-pie-238748"
}
