{
    "directions": [
        "Bring milk to simmer in small saucepan; add honey and 1 tablespoon lavender blossoms. Stir until honey dissolves. Remove from heat; cover and let steep 30 minutes.",
        "Meanwhile, preheat oven to 350°F. Butter and flour decorative 10-cup fluted pan or Bundt pan. Whisk flour, baking powder, baking soda, and salt in medium bowl.",
        "Strain milk mixture into another medium bowl; discard solids in strainer. Whisk sour cream into milk mixtureto blend. Using electric mixer, beat 1 cup sugar and butter in large bowl until light and fluffy. Add eggs 1 at a time, beating until blended after each addition. Add flour mixture alternately with milk mixture in 3 additions each, beating just until smooth. Transfer batter to prepared pan; smooth top with rubber spatula.",
        "Bake bread until tester inserted near center comes out clean, about 45 minutes. Cool bread in pan on rack 10 minutes. Turn out onto rack and cool completely.",
        "Combine powdered sugar and remaining 1/2 teaspoon lavender blossoms in strainer set over small bowl. Press sugar mixture through strainer, discarding large bits. (Can be made 1 day ahead. Cover and store at room temperature.) Sift strained powdered sugar mixture over bread.",
        "*Lavender honey is available at specialty foods stores and at zingermans.com; dried lavender blossoms are available online at gourmetsleuth.com.",
        "For a delicate texture, mix in the dry ingredients just until the tea bread batter is blended."
    ],
    "ingredients": [
        "1/2 cup whole milk",
        "2 tablespoons lavender honey*",
        "1 tablespoon plus 1/2 teaspoon dried lavender blossoms*",
        "2 1/2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 8-ounce container sour cream (1 cup)",
        "1 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3 large eggs",
        "2 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Egg",
        "Herb",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Winter",
        "Honey",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lavender Honey Tea Bread",
    "url": "http://www.epicurious.com/recipes/food/views/lavender-honey-tea-bread-233911"
}
