{
    "directions": [
        "In a sieve set over a bowl and lined with a triple thickness of rinsed and squeezed cheesecloth let the yogurt drain for 1 hour. Put the cucumber in another sieve, sprinkle it with the salt, and let it drain for 1 hour. Pat the cucumber dry between paper towels and transfer it to a bowl. Stir in the yogurt, the garlic, and salt and pepper to taste and combine the mixture well.",
        "In a saucepan combine the beans with enough cold water to cover them by 2 inches, simmer them, covered, for 1 hour, or until they are tender, and drain them well, reserving the cooking liquid. In a skillet cook the onion, the garlic, the orégano, and salt and pepper to taste in the oil over moderately low heat, stirring, until the onion is softened. Add the wine and simmer the mixture until the wine is reduced by half. In a food processor purée the beans and the onion mixture with 1/2 cup of the reserved cooking liquid and salt and pepper to taste, transfer the mixture to a bowl, and chill it, covered, until it is cool.",
        "In a small bowl toss together the tuna, the onion, the olives, the parsley, the vinegar, and salt and pepper to taste.",
        "Spread the bean purée over the bottom of a 10-inch round shallow serving dish, top it with the tuna mixture, and spoon the cucumber mixture over the top. Chill the dip, covered, for at least 3 hours or overnight, sprinkle the top with the tomatoes, the bell pepper, the onion, and the olives, and serve the dip with the pita triangles.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "1 1/2 cups plain yogurt",
        "1 cucumber, peeled, seeded, and chopped fine",
        "1/4 teaspoon salt",
        "1 large garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "1/2 pound dried white beans such as Great Northern, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "1 cup finely chopped onion",
        "2 teaspoons minced garlic",
        "1/2 teaspoon dried orégano, crumbled",
        "2 tablespoons olive oil",
        "1/2 cup dry white wine",
        "a 6 1/2-can chunk-light tuna packed in oil, drained and flaked",
        "1/3 cup finely chopped red onion",
        "1/4 cup finely chopped pitted Kalamata or other brine-cured black olives",
        "1/2 cup minced fresh parsley leaves",
        "1 tablespoon red-wine vinegar, or to taste",
        "2 plum tomatoes, diced",
        "1 green bell pepper, diced",
        "1/2 red onion, sliced thin",
        "1/4 cup sliced pitted Kalamata or other brine-cured black olives",
        "toasted pita triangles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Bean",
        "Garlic",
        "Olive",
        "Onion",
        "Appetizer",
        "Picnic",
        "Yogurt",
        "Tuna",
        "Cucumber",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Layered White Beans, Tuna, and Vegetable Dip",
    "url": "http://www.epicurious.com/recipes/food/views/layered-white-beans-tuna-and-vegetable-dip-11493"
}
