{
    "directions": [
        "For the sauce, place all the ingredients in a saucepan. Whisk until well combined. Cook and stir over medium heat until thickened, about 5 minutes. Taste and add more chili powder, if desired. Set aside.",
        "Place the beans in a large bowl. Add the onions, corn, olives, and green chilies (if using). Mix gently until well combined. Set aside.",
        "Preheat the oven to 350°F.",
        "Place 1 1/2 cups of the sauce in the bottom of a nonstick 9x13-inch baking dish. Place 4 corn tortillas over the bottom of the baking dish; they can overlap or be cut to fit. Spread half of the bean mixture over the tortillas. Place another 4 tortillas over the bean mixture and then spread the remaining bean mixture on top of those tortillas. Cover with 4 more tortillas and then pour the remaining sauce over the tortillas. Cover with parchment paper and then with aluminum foil, crimping the edges over the baking dish. Bake for 45 minutes. Remove from the oven and let rest for about 15 minutes before cutting. Serve with salsa and tofu sour cream, if desired."
    ],
    "ingredients": [
        "2 (8-ounce) cans tomato sauce",
        "3 cups water",
        "4 tablespoons cornstarch",
        "3 tablespoons chili powder",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon garlic powder",
        "12 corn tortillas",
        "4 cups of cooked mashed pinto beans",
        "1 cup chopped green onions",
        "1 1/2 cups frozen corn kernels, thawed",
        "1 (2.25-ounce) can sliced ripe olives, drained",
        "1–2 tablespoons chopped green chilies (optional)",
        "Salsa (optional)",
        "Tofu sour cream (optional; recipe available at www.drmcdougall.com)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Lasagna",
        "Vegan",
        "Tortillas",
        "Bean",
        "Corn",
        "Tomato",
        "Vegetarian",
        "Wheat/Gluten-Free"
    ],
    "title": "Layered Tex-Mex Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/layered-tex-mex-lasagna"
}
