{
    "directions": [
        "Mix vinegar, water, sugar, pickling spice and salt in heavy medium saucepan; bring to boil, stirring until sugar and salt dissolve. Cool to room temperature. Place cucumbers in large glass bowl. Pour marinade over cucumbers. Cover; refrigerate overnight.",
        "Mix apples, red onion, sour cream and chopped dill in large bowl. Season to taste with salt and pepper.",
        "Using slotted spoon, remove cucumbers from marinade. Arrange half of cucumbers in bottom of 8 x 8 x 2-inch glass dish. Arrange half of radishes atop cucumbers. Spoon half of apple mixture over radishes. Arrange herring evenly atop apple mixture. Spoon remaining apple mixture over herring. Cover with remaining cucumbers, then radishes. Cover and chill salad 3 hours.",
        "Arrange lettuce leaves on platter. Spoon salad onto leaves. Garnish with dill sprigs, if desired, and serve."
    ],
    "ingredients": [
        "3/4 cup apple cider vinegar",
        "3/4 cup water",
        "1/3 cup sugar",
        "2 teaspoons pickling spice",
        "1 teaspoon salt",
        "1 large hothouse cucumber, cut into 1/8-inch-thick rounds",
        "1 pound Granny Smith apples, peeled, cored, coarsely chopped",
        "1 1/2 cups chopped red onion",
        "1 cup sour cream",
        "1/4 cup chopped fresh dill",
        "1 1/4 cups sliced trimmed radishes",
        "2 6-ounce jars spiced cut herring, drained, each piece halved",
        "Boston lettuce leaves",
        "Fresh dill sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fish",
        "Fruit",
        "Onion",
        "Marinate",
        "Rosh Hashanah/Yom Kippur",
        "Buffet",
        "Vinegar",
        "Apple",
        "Cucumber",
        "Radish",
        "Chill",
        "Dill"
    ],
    "title": "Layered Pickled Herring Salad with Tart Apples and Red Onion",
    "url": "http://www.epicurious.com/recipes/food/views/layered-pickled-herring-salad-with-tart-apples-and-red-onion-3004"
}
