{
    "directions": [
        "1. The day before you want to serve this dish, use a mortar and pestle, spice grinder, or blender to grind the curry leaves and cloves. Transfer to a small bowl and mix in the ginger, cardamom, cinnamon, black pepper, and red pepper flakes.",
        "2. Place the beef in a nonreactive bowl, such as Pyrex. Combine 3 tablespoons of the spice mix with the yogurt and salt. Toss the yogurt mixture with the beef. Cover the bowl tightly with plastic wrap and marinate in the refrigerator overnight. Refrigerate the remaining spice mix.",
        "3. In a large nonstick skillet over high heat, warm 3 tablespoons of the vegetable oil. Remove the beef from the marinade and scrape off any marinade that clings to the meat (reserve the marinade). Sear the beef in batches, about 45 seconds on each side, adding additional oil if necessary. Transfer the beef to a bowl and set aside.",
        "4. Reduce the heat to medium and heat the remaining 1 tablespoon vegetable oil. Add the onions and cook until translucent, about 5 minutes. Add the garlic and the remaining spice mix, and toss well. Pour in the vinegar, raise the heat to medium-high, and boil until the vinegar has mostly evaporated, about 2 minutes. Add the carrot juice, bring to a boil, and season to taste with salt and pepper.",
        "5. Center a rack in the oven and preheat the oven to 300°F.",
        "6. Arrange half of the beef on the bottom of a medium cast-iron pot or Dutch oven, then add a layer of turnips, a layer of celery root, and a layer of potatoes, seasoning each vegetable layer with salt and pepper. Repeat the layering once more, finishing with a layer of potatoes on top. Pour the carrot juice mixture and the coconut milk into the pot and cover with a piece of oiled parchment paper and the pot lid. Bring to a simmer.",
        "7. Transfer the pot to the oven to braise for 2 hours. Uncover and braise until the meat is moist and stewlike, about 1 hour more. Sprinkle with cilantro leaves and grated coconut and serve."
    ],
    "ingredients": [
        "12 dried curry leaves",
        "2 whole cloves",
        "1 tablespoon peeled, grated fresh ginger",
        "2 teaspoons ground cardamom",
        "1 teaspoon ground cinnamon",
        "1 teaspoon freshly ground black pepper, plus additional 1/2 teaspoon crushed red pepper flakes",
        "2 pounds beef top butt or top sirloin, cut into 1/4-inch-thick slices",
        "1/2 cup plain whole-milk yogurt",
        "2 teaspoons coarse sea salt or kosher salt, plus additional",
        "1/4 cup vegetable oil, plus additional if necessary",
        "2 cups peeled, halved, and thinly sliced onions",
        "2 garlic cloves, peeled and chopped",
        "2 tablespoons white wine vinegar",
        "2 cups carrot juice",
        "1/2 pound turnips, peeled and sliced into 1/8-inch-thick rounds",
        "1/2 pound celery root, peeled and sliced into 1/8-inch-thick rounds",
        "1 pound Yukon Gold or Idaho potatoes, peeled and sliced into 1/8-inch-thick rounds",
        "2 cups unsweetened coconut milk",
        "Fresh cilantro leaves, for garnish",
        "Grated fresh or desiccated coconut, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Kid-Friendly",
        "Dinner",
        "Carrot",
        "Turnip"
    ],
    "title": "Layered Beef and Root Vegetables in a Spicy Coconut Curry",
    "url": "http://www.epicurious.com/recipes/food/views/layered-beef-and-root-vegetables-in-a-spicy-coconut-curry-56390036"
}
