{
    "directions": [
        "Preheat oven to 375°F. Butter 13 x 9 x 2-inch glass baking dish. Arrange 1/3 of celery root slices in dish. Top with 1/3 of potato slices. Sprinkle with salt and pepper, then 1/4 teaspoon nutmeg. Top with half of onion slices, half of garlic, then half of cheese. Repeat layering 1 more time. Cover with remaining celery root, then potatoes.",
        "Bring broth and cream to simmer in medium saucepan. Pour over vegetables. Sprinkle generously with salt and pepper. Cover baking dish with foil. Bake casserole 1 hour. Remove foil. Bake until vegetables are very tender and liquid bubbles thickly and is slightly absorbed, about 55 minutes longer. Remove from oven. Let stand 15 to 20 minutes; serve. (Can be made 2 hours ahead. Let stand at room temperature. Rewarm, covered with foil, in 350°F oven, about 25 minutes.)"
    ],
    "ingredients": [
        "3 pounds celery roots (celeriac; about 4 medium), peeled, quartered, thinly sliced (about 7 cups)",
        "3 pounds russet potatoes (about 4 large), peeled, thinly sliced (about 7 cups)",
        "1/2 teaspoon ground nutmeg",
        "1 large onion, thinly sliced",
        "3 garlic cloves, minced",
        "2 cups (packed) grated Gruyère cheese (about 8 ounces)",
        "2 cups canned low-salt chicken broth or canned vegetable broth",
        "1 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Casserole/Gratin",
        "Root Vegetable",
        "Winter",
        "Swiss Cheese",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Layered Potato, Onion and Celery Root Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/layered-potato-onion-and-celery-root-casserole-5776"
}
