{
    "directions": [
        "Cover beans with cold water by 3 inches in a bowl and soak at room temperature at least 8 hours. Drain well in a colander.",
        "Bring lamb, baharat, and water (9 cups) to a boil in a 6- to 8-quart heavy pot, then vigorously simmer mixture, covered, until meat is almost tender, 1 1/4 to 1 1/2 hours. Add beans and cook, uncovered, until beans are tender, about 1 hour more. Meanwhile, heat oil over moderate heat in a 12-inch heavy skillet until hot but not smoking, then cook onions, garlic, 1/2 teaspoon salt, and 1/4 teaspoon pepper, stirring, until onions are pale golden and tender, 8 to 10 minutes. Stir in tomato paste and cook, stirring, 2 minutes. When beans are tender, stir in tomato-onion mixture and simmer until just heated through, about 5 minutes. Stir in remaining 1 1/2 teaspoons salt and 1/2 teaspoon black pepper.",
        "*A Middle Easterna and African ground-spice mixture that typically contains allspice, cinnamon, clove, cumin, Maras chile, and black pepper. Available at Middle Eastern markets and Formaggio Kitchen (888-212-3224; formaggiokitchen.com)."
    ],
    "ingredients": [
        "1 lb dried navy beans, picked over and rinsed",
        "2 lb boneless lamb shoulder or boneless leg of lamb, trimmed of excess fat and cut into 1 1/2-inch cubes",
        "1 tablespoon plus 1 teaspoon baharat* or 1 (3-inch) cinnamon stick",
        "9 cups water",
        "2 tablespoons olive oil",
        "2 medium onions, chopped",
        "4 garlic cloves, finely chopped",
        "2 teaspoons salt",
        "3/4 teaspoon black pepper",
        "3 tablespoons tomato paste",
        "Accompaniments: spiced basmati rice better-than-pita grill bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Lamb",
        "Quick & Easy",
        "Cinnamon",
        "Clove",
        "Gourmet",
        "Indiana"
    ],
    "title": "Lebanese Lamb and Bean Stew",
    "url": "http://www.epicurious.com/recipes/food/views/lebanese-lamb-and-bean-stew-233264"
}
