{
    "directions": [
        "Chicken breasts are usually sold split in half. Cut each breast half in half again and put them in a bowl.",
        "Chop the garlic coarsely and in a small bowl crush it with the salt, using the back of a spoon, until you have a smooth paste. Stir in the lemon juice, oil, paprika, and pepper. Beat well with a fork and pour the marinade over the chicken pieces. Mix well, using your hands, and turn the pieces to coat them liberally with the marinade. Cover and refrigerate for 4 or 5 hours or overnight.",
        "When you're ready to cook, prepare the grill, leaving plenty of time for it to heat up if you're using charcoal or wood. When the fire is hot enough, place the chicken pieces on the grill and set the grill a good 8 inches from the source of the heat. Use the marinade remaining in the bowl to baste the chicken frequently as it cooks. Grill for 10 minutes or longer on each side, turning each piece once. Test for doneness and serve hot or at room temperature."
    ],
    "ingredients": [
        "2 pounds boneless chicken breasts, skin removed if you wish",
        "4 garlic cloves, crushed with the flat blade of a knife",
        "1 teaspoon sea salt",
        "1/2 cup fresh lemon juice",
        "3/4 cup extra-virgin olive oil",
        "1 teaspoon sweet paprika",
        "freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Advance Prep Required",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Lebanese Garlic-Marinated Chicken on the Grill",
    "url": "http://www.epicurious.com/recipes/food/views/lebanese-garlic-marinated-chicken-on-the-grill-51163800"
}
