{
    "directions": [
        "In a small saucepan, melt butter over low heat. Stir in sugar and water; continue stirring to dissolve sugar. Do not boil. Remove from heat and let cool slightly.",
        "Measure flours into a large bowl. Add melted butter, yeast, spices, and sesame seeds; stir slowly for about 10 minutes to thoroughly blend ingredients.  Cover the bowl with plastic wrap and leave dough in bowl to rest for 1 hour.",
        "Prepare 3 baking sheets with cooking spray or parchment paper. In a small bowl, pour the rose water and orange flower water. Pour the warm water in to a second small bowl. Working on a floured board, pull off about 1 cup of dough. Dip your fingers first in the warm water and knead the dough a few minutes; then dip the dough in the flower water and knead it again until the dough is soft and pliable.",
        "Use the palm of your hand to roll the ball of dough into a rope 12 inches long and 1 inch in diameter. Cut the rope in half and make a wreath-shaped cookie with each one, pinching the ends together. Place on a baking sheet. When you have filled a baking sheet, cover the cookies with a clean towel and refrigerate overnight to rest the dough.",
        "Preheat oven to 350 degrees F (175 degrees C). Remove baking sheets from the refrigerator to warm up while the oven preheats. Bake cookies in the preheated oven until golden brown, about 15 minutes."
    ],
    "ingredients": [
        "1 1/2 pounds butter",
        "4 cups white sugar",
        "1 cup water",
        "9 cups semolina flour",
        "8 cups all-purpose flour",
        "1 1/2 tablespoons quick rise yeast",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon allspice",
        "1 teaspoon ground mahleb",
        "1/4 cup black sesame seeds",
        "1/4 cup rose water",
        "1/4 cup orange flower water",
        "1 cup warm water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lebanese Easter Cookies",
    "url": "http://allrecipes.com/recipe/140413/lebanese-easter-cookies/"
}
