{
    "directions": [
        "In a medium saucepan, stir together the honey and molasses. Bring the mixture to a boil, remove from heat and stir in the brown sugar, egg, lemon juice and lemon zest. In a large bowl, stir together the flour, baking soda, cinnamon, cloves, allspice and nutmeg. Add the molasses mixture to the dry ingredients and mix well. Stir in the  citron and hazelnuts. Cover dough and chill overnight.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Using a small amount of dough at a time, roll out on a lightly floured surface to 1/4 inch thickness. Cut into small rectangles and place them 1 inch apart onto the prepared cookie sheet.",
        "Bake for 10 to 12 minutes in the preheated oven, until no imprint remains when touched lightly. Brush the icing over the cookies while they are still hot and quickly remove them to wire cooling racks. Store in airtight container with a cup of orange or apple for a few days to mellow.",
        "To make the icing: Combine the sugar and water in a small saucepan. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in the confectioners' sugar. If icing becomes sugary while brushing cookies, re-heat slightly- adding a little water until crystals dissolve."
    ],
    "ingredients": [
        "1/2 cup honey",
        "1/2 cup molasses",
        "3/4 cup packed brown sugar",
        "1 egg",
        "1 tablespoon lemon juice",
        "1 teaspoon lemon zest",
        "2 3/4 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground allspice",
        "1 teaspoon ground nutmeg",
        "1/3 cup diced candied citron",
        "1/3 cup chopped hazelnuts",
        "1 cup white sugar",
        "1/2 cup water",
        "1/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lebkuchen VI",
    "url": "http://allrecipes.com/recipe/25811/lebkuchen-vi/"
}
