{
    "directions": [
        "In a small saucepan over medium heat, stir together honey and molasses. Bring to a boil and remove from heat. Stir in the brown sugar, egg, lemon juice and lemon zest until well blended. Set aside. In a large bowl, mix together the flour, baking soda, cinnamon, cloves, nutmeg and allspice. Stir the ingredients from the pan into the bowl and blend well. Mix in the walnuts and  candied citron. Cover the dough and chill for several hours or overnight.",
        "Preheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets.",
        "Using a small amount of dough at a time, roll out to 1/4 inch thickness on a floured surface. Cut into small rectangles. Place the rectangles 1 inch apart onto the prepared baking sheets.",
        "Bake for 10 to 12 minutes in the preheated oven, until firm. Brush with glaze while hot from the oven. To make the glaze: Combine the 1 cup of sugar with water in a small saucepan over medium heat. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in confectioners' sugar until smooth. Brush over hot cookies."
    ],
    "ingredients": [
        "1/2 cup honey",
        "1/2 cup molasses",
        "3/4 cup packed brown sugar",
        "1 egg",
        "1 tablespoon lemon juice",
        "1 teaspoon lemon zest",
        "2 3/4 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground allspice",
        "1/2 cup chopped walnuts",
        "1/2 cup chopped candied citron",
        "1 cup white sugar",
        "1/2 cup water",
        "1/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lebkuchen IV",
    "url": "http://allrecipes.com/recipe/23349/lebkuchen-iv/"
}
