{
    "directions": [
        "Preheat the oven to 350°F (180°C).",
        "Place the bread cubes on a sheet pan and bake for 15 minutes, tossing once, until lightly browned. Place the pancetta in one layer on another sheet pan and bake in the same oven for 15 to 20 minutes, until lightly browned. Place the pancetta on a plate lined with paper towels and set aside.",
        "Meanwhile, soak the leeks in water until they’re clean, and spin them dry in a salad spinner. Heat the butter in an 11-inch (28-cm) pot over medium heat, add the leeks and cook for 10 minutes, stirring occasionally. Add the wine, 1 tsp. salt and 1 tsp. pepper and cook for 5 minutes, until the wine almost evaporates and the leeks are tender. Off the heat, mix in the artichokes, toasted bread cubes, chives and tarragon.",
        "Whisk the eggs, cream, chicken stock, nutmeg and 1 tsp. salt together in a large bowl. Spoon half of the bread mixture into a 13 x 9 x 2-inch (33 x 23 x 5-cm) baking dish. Sprinkle with half the Emmentaler and add the remaining bread mixture. Pour on the cream mixture, sprinkle with the remaining Emmentaler and press lightly to help the bread absorb the liquid. Dice or crumble the pancetta, scatter on top and sprinkle lightly with pepper. Set aside at room temperature for 30 minutes to allow the bread to absorb the cream mixture. Bake for 45 to 50 minutes, until the custard is set and the bread pudding is puffed and golden. Serve hot. Serves 8.",
        "Make It Ahead:",
        "Assemble the bread pudding and refrigerate for up to 2 days. Bake before serving.",
        "Recipe from Ina Garten,",
        "Make It Ahead",
        "(Clarkson Potter, 2014)"
    ],
    "ingredients": [
        "8 cups (1-inch-/2.5-cm-diced) day-old bakery white bread, crusts removed",
        "3 ounces (90 g) thinly sliced pancetta",
        "6 cups (1/2-inch-/12-mm-diced) leeks, white and light green parts (5 leeks)",
        "3 Tbs. unsalted butter",
        "1/2 cup (4 fl. oz./125 ml) dry white wine, such as Pinot Grigio",
        "Kosher salt and freshly ground black pepper",
        "1 (9-ounce/280-g) package frozen artichoke hearts, defrosted",
        "3 Tbs. minced fresh chives",
        "2 tsp. minced fresh tarragon leaves",
        "4 extra-large eggs",
        "2 cups (16 fl. oz./500 ml) heavy cream",
        "1 cup (8 fl. oz./250 ml) good chicken stock, preferably homemade",
        "1/4 tsp. ground nutmeg",
        "2 cups (8 oz./250 g) grated Emmentaler Swiss cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Leek and Artichoke Bread Pudding",
    "url": "http://www.williams-sonoma.com/recipe/leek-and-artichoke-bread-pudding.html"
}
