{
    "directions": [
        "Preheat oven to 350°F. Spread bread cubes on 2 rimmed baking sheets. Bake until bread is almost dry, about 15 minutes. Cool. Transfer to large bowl.",
        "Sauté bacon in large pot over medium-high heat until crisp, about 12 minutes. Transfer bacon to paper towels to drain. Reserve 6 tablespoons drippings in pot; discard any remaining drippings.",
        "Add leeks and button mushrooms to same pot. Sauté over medium-high heat until beginning to soften, about 5 minutes. Add shiitake mushrooms and saute 4 minutes. Add celery and sauté until leeks and mushrooms are tender but celery is still slightly crisp, about 6 minutes longer. (Bread, bacon and sautéed vegetables can be prepared 1 day ahead. Cover separately. Store bread at room temperature; refrigerate bacon and vegetables.) Mix bacon, sautéed vegetables and tarragon into bread. Season generously with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill main cavity with stuffing. Add enough broth to remaining stuffing to moisten lightly (about 1/4 to 1/2 cup, depending on amount of remaining stuffing). Generously butter glass baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 25 to 30 minutes. Uncover and bake until top is slightly crisp and golden, about 15 to 20 minutes.",
        "Preheat oven to 350°F. Generously butter 15 x 10 x 2-inch . Add enough broth to stuffing to moisten (about 3/4 to 1 cup). Transfer stuffing to prepared dish. Cover with butter foil, buttered side down; bake until heated through, about 30 to 35 minutes. Uncover and bake until top is slightly crisp and golden, about 20 to 25 minutes longer."
    ],
    "ingredients": [
        "1 24-ounce loaf sliced buttermilk bread, crust trimmed, bread cut into 1/2-inch cubes (about 11 cups)",
        "1 pound bacon slices, cut into 1/2-inch pieces",
        "7 cups chopped leeks (white and pale green parts only)",
        "1 1/2 pounds button mushrooms, coarsely chopped",
        "12 ounces shiitake mushrooms, stemmed, caps coarsely chopped",
        "4 cups coarsely chopped celery",
        "3 tablespoons chopped fresh tarragon or 1 1/2 tablespoons dried",
        "2 large eggs, beaten to blend",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Herb",
        "Mushroom",
        "Onion",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bacon",
        "Celery",
        "Leek",
        "Fall",
        "Tarragon",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Leek, Mushroom and Bacon Stuffing with Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/leek-mushroom-and-bacon-stuffing-with-tarragon-100441"
}
