{
    "directions": [
        "1. Line the pie dish of your choice with the pastry and chill in the freezer for 30 minutes.",
        "2. Preheat the oven to 400° F. Prick the pastry all over with the tines of a fork or a sharp knife, then line it with aluminum foil and fill it with dry beans or pastry weights to keep it from bubbling up. Bake it in the lower third of the oven until the edges of the pastry are golden, about 10 minutes. Remove from the oven and reserve.",
        "3. Melt the goose fat with the bacon in a large skillet over medium heat and cook until the bacon is slightly golden but not crisp, 2 to 3 minutes. Add the leeks, stir so they are coated with fat and cook, covered, until they are tender, about 15 minutes, stirring occasionally so they don't stick to the bottom of the pan. Season with salt and pepper and remove from the heat.",
        "4. In a medium-sized bowl whisk together the eggs until they are broken up, then whisk in the milk and the cream. Season with salt and pepper.",
        "5. Arrange the leeks and the bacon evenly over the pastry. Pour the custard mixture over it. Place the tart tin on a baking sheet and bake it in the bottom third of the oven until the top is golden and puffed and the custard is cooked through, 25 to 30 minutes. Remove from the oven, remove the edge of the tart tin if you've used a removable bottom tart tin, and serve immediately."
    ],
    "ingredients": [
        "1 tablespoon goose fat (or olive oil)",
        "6 ounces slab bacon, rind removed, cut in 1 x 1/4 x 1/4-inch pieces",
        "Just the green part from 2-1/2 pounds of leeks (about 1 pound, 12 ounces of tender green leaves), carefully cleaned and diced",
        "Sea salt and freshly ground black pepper",
        "6 large eggs",
        "2/3 cup whole milk",
        "1/3 cup crème fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Vegetable",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Bake",
        "Meat",
        "Bacon",
        "Leek",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Leek Tart",
    "url": "http://www.epicurious.com/recipes/food/views/leek-tart-102979"
}
