{
    "directions": [
        "Trim the leeks, leaving about 1 inch of the tender green portions, then rinse them. Cut crosswise into slices 1/2 inch thick.",
        "In a large saucepan over medium-low heat, melt the butter. When foaming, add the leeks and sauté, stirring occasionally, until they have wilted a little, 3 to 4 minutes. Add the potatoes and carrots, then add water just to cover the vegetables. Increase the heat to medium and bring to a boil. Reduce the heat to low and simmer, uncovered, until the vegetables are tender when pierced with the tip of a knife, about 30 minutes.",
        "Fit a food mill with the medium disk and set the mill over a large bowl. Using a ladle or a large spoon and working in batches, transfer the cooked vegetables and their liquid to the food mill and turn the handle to puree.",
        "If serving the soup hot, return the pureed vegetables to the saucepan and season with salt and pepper. Set the saucepan over medium-low heat, stir in the 1/4 cup cream and heat to just under a boil. Add a little water if the puree is too thick. Taste and adjust the seasonings.",
        "Ladle into warmed bowls and float a lemon slice on top of each serving. Using scissors, cut the chives into pieces 1/4 inch long and sprinkle the chives on the lemon slices. Serve immediately.",
        "If serving the soup cold, do not return the puree to the saucepan. Instead, cover the bowl and refrigerate the puree until well chilled. When ready to serve, season with salt and pepper and stir in the 1/2 cup cream, mixing well. Taste and adjust the seasonings.",
        "Ladle into chilled bowls. Float a lemon slice on top of each serving and garnish with the chives as directed above."
    ],
    "ingredients": [
        "1 lb. leeks (about 3 medium)",
        "2 Tbs. unsalted butter",
        "1 lb. baking potatoes, peeled and cubed",
        "2 carrots, peeled and sliced",
        "Salt and freshly ground pepper, to taste",
        "1/4 cup heavy cream if serving hot or 1/2 cup  &nbsp cream if serving cold",
        "4 thin lemon slices",
        "Fresh chives for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Leek and Potato Soup",
    "url": "http://www.williams-sonoma.com/recipe/leek-and-potato-soup.html"
}
