{
    "directions": [
        "Preheat oven to 250°F. Toast mustard seeds in skillet over medium heat until beginning to darken and pop, about 5 minutes; transfer to bowl and cool. Grind seeds to powder in spice mill.",
        "Whisk whole grain mustard, wine, oil, and ground mustard seeds in medium bowl. Season mustard coating with salt and pepper. Toss bread pieces and coating in large bowl to coat evenly. Spread bread out on rimmed baking sheet.",
        "Bake bread pieces until dried and slightly colored, stirring occasionally, about 1 hour 15 minutes. Cool completely. Using potato masher, coarsely crush bread on sheet. DO AHEAD: Can be made 3 days ahead. Cover and chill. Rewarm in 350°F oven 4 to 5 minutes before using.",
        "Place first 3 ingredients in medium bowl. Gradually whisk in oil. Season vinaigrette to taste with salt and pepper. DO AHEAD: Can be made 3 days ahead. Cover; chill. Bring to room temperature and rewhisk before using.",
        "Position rack in center of oven and preheat to 450°F. Cut leeks in half lengthwise. Rinse under cold water to remove any grit between layers; drain on paper towels. Arrange leeks, cut side down, in single layer in 13x9x2-inch glass baking dish. Pour broth over; drizzle with oil. Top with thyme sprigs and lemon slices. Cover dish tightly with plastic wrap, then foil.",
        "Bake leeks 35 minutes. Uncover; discard lemon. Bake leeks uncovered until very tender and browned, and liquid is almost evaporated, about 50 minutes. Cool 15 minutes. Serve or let stand up to 2 hours",
        "Arrange 2 leeks on each plate; sprinkle with vinaigrette, breadcrumbs, and parsley. Arrange cheese alongside."
    ],
    "ingredients": [
        "2 tablespoons mustard seeds",
        "1/4 cup whole grain Dijon mustard",
        "1/4 cup dry white wine",
        "1/4 cup canola oil",
        "1/2 16-ounce loaf country white bread, crusts trimmed, bread diced",
        "1/3 cup fresh lemon juice",
        "1/3 cup whole grain Dijon mustard",
        "1 teaspoon finely grated lemon peel",
        "2/3 cup olive oil",
        "8 medium leeks, each cut to 6-inch lengths, root ends trimmed",
        "11/2 cups low-salt chicken broth",
        "2 tablespoons extra-virgin olive oil",
        "4 large fresh thyme sprigs",
        "1 large lemon, cut into very thin rounds",
        "Chopped fresh Italian parsley",
        "16 ounces burrata cheese or fresh waterpacked mozzarella cheese, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mustard",
        "Side",
        "Bake",
        "Lunch",
        "Mozzarella",
        "Lemon",
        "Leek",
        "Healthy",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Leeks Vinaigrette with Burrata Cheese and Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/leeks-vinaigrette-with-burrata-cheese-and-mustard-243439"
}
