{
    "directions": [
        "Preheat oven to 300°F.",
        "Trim leeks and halve lengthwise. Rinse leeks well and in an ovenproof skillet arrange, cut sides down. Cut onions into 1/2-inch-thick slices and arrange over leeks. Add water and bring to a boil over high heat. Braise leeks and onions, covered, in middle of oven until very tender, about 1‚ hours. Cool leeks and onions to room temperature. Leeks and onions may be braised 1 day ahead and chilled, covered. Bring leeks and onions to room temperature before proceeding.",
        "Have ready a bowl of ice and cold water. Trim haricots verts and in a saucepan of heavily salted boiling water cook until completely tender, about 5 minutes. With a slotted spoon transfer beans to ice water to stop cooking and drain well, patting dry. Beans may be cooked 1 day ahead and chilled, covered. Bring beans to room temperature before serving.",
        "In a small bowl combine shallot and vinegar. Let mixture stand 20 minutes. Whisk in veal stock, mustard, and salt and pepper to taste and whisk in oil in a slow stream until emulsified.",
        "Arrange vegetables on a platter and drizzle with vinaigrette."
    ],
    "ingredients": [
        "4 medium leeks",
        "3 large red onions",
        "3/4 cup water",
        "6 ounces haricots verts (thin French green beans)",
        "1 teaspoon minced shallot",
        "1/4 cup white-wine vinegar",
        "1/4 cup veal stock (2 fluid ounces)",
        "1/4 teaspoon dry mustard",
        "1/4 cup vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Onion",
        "Appetizer",
        "Leek",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Leek, Red Onion, and Haricot Vert Salad with Veal Stock Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/leek-red-onion-and-haricot-vert-salad-with-veal-stock-vinaigrette-100594"
}
