{
    "directions": [
        "Melt 2 tablespoons butter in a small saucepan over low heat, then cool.",
        "Toss melted butter with bread crumbs, cheeses, garlic, parsley, 1/4 teaspoon salt, and 1/8 teaspoon pepper in a bowl until combined.",
        "Trim each leek to an 8-inch length (reserve tops for another use if desired). Halve leeks lengthwise, then cut crosswise into roughly 1-inch pieces. Wash leeks, then drain well.",
        "Melt 1 tablespoon butter in a 1-to 1 1/2-quart heavy saucepan over medium heat. Add flour and cook roux, whisking, 1 minute. Add stock in a slow stream, whisking, then bring to a boil, whisking. Add nutmeg and zest and boil, whisking, 1 minute. Remove from heat.",
        "Preheat oven to 400°F. Butter baking dish.",
        "Melt 1 tablespoon butter in a 12-inch heavy skillet over medium-low heat. Add leeks and 1/4 teaspoon each of salt and pepper, then cover leeks directly with a round of parchment paper and cook, stirring occasionally, until liquid is absorbed and leeks are tender and just beginning to brown, 10 to 15 minutes.",
        "Meanwhile, heat remaining 2 tablespoons butter in a large heavy skillet over medium heat until foam subsides. Add mushrooms and 1/4 teaspoon each of salt and pepper and cook, stirring occasionally, until liquid is absorbed and mushrooms are just beginning to brown, about 15 minutes. Remove from heat.",
        "Remove parchment from leeks and stir in mushrooms. Transfer mixture to baking dish, spreading it evenly. Pour sauce over vegetables and top with crumb mixture. Bake until gratin is bubbling and topping is golden, about 15 minutes."
    ],
    "ingredients": [
        "3/4 stick unsalted butter, divided",
        "1 cup fine dry bread crumbs",
        "1/4 pound Gruyère, finely grated on small teardrop-shaped holes of a box grater (2 cups)",
        "1/2 cup finely grated Parmigiano-Reggiano",
        "2 teaspoons finely chopped garlic",
        "1 tablespoon finely chopped flat-leaf parsley",
        "3 pounds leeks, root ends trimmed",
        "2 tablespoons all-purpose flour",
        "1 1/2 cups chicken stock or reduced-sodium chicken broth",
        "1/8 teaspoon grated nutmeg",
        "1/2 teaspoon grated lemon zest",
        "1 pound cremini mushrooms, trimmed and thinly sliced",
        "Equipment: a 1 1/2-quart oval gratin or other shallow baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Mushroom",
        "Side",
        "Quick & Easy",
        "Parmesan",
        "Leek",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Butter",
        "Breadcrumbs",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Leek and Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-mushroom-gratin-355418"
}
