{
    "directions": [
        "Stir together flour and salt in a large bowl, then make a well in center and add water, yogurt, 1/2 cup oil, and vinegar. Stir until a soft dough forms, then knead on a work surface (do not dust with flour) until smooth and pliable, about 4 minutes. Form dough into a ball and put in an oiled bowl, then turn to coat. Cover bowl with plastic wrap and let dough stand at room temperature 1 hour.",
        "Wash leeks in a bowl of cold water, agitating them, then lift out and drain well in a colander.",
        "Heat 1/4 cup oil in a deep 12-inch heavy skillet or a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté leeks and celery with 1/2 teaspoon salt, stirring frequently, until softened and translucent, 10 to 12 minutes. Transfer to a bowl and cool, stirring occasionally, 10 minutes.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Stir herbs into leek mixture along with cheeses, pepper, and remaining 1/2 teaspoon salt. Lightly beat eggs with remaining 3 tablespoons oil in a small bowl, then stir into leek filling.",
        "Brush baking pan with 2 tablespoons oil.",
        "Divide dough in half. Roll out 1 half on a floured surface with a floured rolling pin into a 19- by 14-inch rectangle. Fold rectangle loosely into quarters and transfer to baking pan, then unfold dough and fit into pan, leaving a 1-inch overhang. Spread filling evenly in pan.",
        "Roll out remaining dough on floured surface with floured rolling pin into a 20- by 15-inch rectangle. Lift dough and drape it over filling, leaving it slightly wrinkled. Roll edge of bottom crust over top to form a rope edge all around pie. Brush top of pie with remaining 2 tablespoons oil. Score top crust into serving pieces with a sharp knife (mark crust but do not cut through it).",
        "Bake pie until golden brown, 50 to 60 minutes. Cool to room temperature in pan on a rack, about 1 hour."
    ],
    "ingredients": [
        "4 cups all-purpose flour plus additional for dusting",
        "2 teaspoons salt",
        "3/4 cup water",
        "1/2 cup whole-milk yogurt (preferably Greek)",
        "3/4 cup extra-virgin olive oil",
        "1 tablespoon red-wine vinegar",
        "6 lb leeks (white and pale green parts only), finely chopped (about 10 cups)",
        "1/4 cup plus 3 tablespoons extra-virgin olive oil",
        "5 large celery ribs, finely chopped (about 3 cups)",
        "1 teaspoon salt",
        "1 cup chopped fresh mint",
        "2/3 cup chopped fresh flat-leaf parsley",
        "1/2 cup chopped fresh dill",
        "1/4 lb Greek feta (preferably Mt. Vikos or Dodoni brand), crumbled (1 cup)",
        "1 1/2 oz finely grated Kefalotyri or Parmigiano-Reggiano cheese (1/2 cup; see Tips, page 167)",
        "1/4 teaspoon black pepper",
        "3 large eggs",
        "Special equipment: a 17- by 12-inch shallow heavy baking pan (1 inch deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Bake",
        "Yogurt",
        "Feta",
        "Mint",
        "Celery",
        "Leek",
        "Dill",
        "Parsley",
        "Gourmet"
    ],
    "title": "Leek and Celery Pie",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-celery-pie-234978"
}
