{
    "directions": [
        "Soak the cod in cold water at least 24 hours in advance. Change the water, several times a day. Then cut in pieces.",
        "Place a large pot over medium-high heat. Add olive oil and sauté leeks until they brown slightly, 10 to 15 minutes. Add garlic and sauté until they begin to take on a slight tan color, 1 to 2 minutes.",
        "Toss in potatoes, carrot, pumpkin, and cod pieces. Immediately, pour in enough water to cover, 4 to 5 cups. Add about 1 teaspoon salt or less to the water, as the cod might still contain salt. Bring soup to a boil, and reduce heat to a simmer. Cook, uncovered, until potatoes are the desired softness. Stir once or twice. Depending on the size of the potato pieces, simmer for 15 to 25 minutes.",
        "Taste and add salt and pepper, if needed. Serve alone or with good bread.",
        "Two basic types of porrusalda exist, with and without cod. Excluding cod from the soup makes it no less genuine.",
        "Many cooks will not include garlic or sauté their leeks, and may stir in olive oil only at the end, into the nearly finished product. I find the simple steps of pan-frying the leeks and garlic add greatly to the flavor of these vegetables, as does the oil in the porrusalda."
    ],
    "ingredients": [
        "1/2 pound salt cod",
        "4 tablespoons olive oil",
        "6 leeks, white and pale green parts only, chopped in 1/2-inch sections",
        "4 cloves garlic, chopped or minced",
        "4 potatoes, chopped in 1-inch pieces",
        "1 medium carrot, chopped in 1/2-inch pieces",
        "1/2 pound pumpkin, chopped in 1/2-inch pieces (about 1 cup)",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Potato",
        "Sauté",
        "Cod",
        "Leek",
        "Carrot",
        "Pumpkin",
        "Winter",
        "Simmer"
    ],
    "title": "Leek and Cod Soup",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-cod-soup-109503"
}
