{
    "directions": [
        "Place chicken in extra-large pot. Add next 7 ingredients, then enough cold water to cover (about 18 cups). Bring to boil over medium-high heat. Reduce heat to medium-low and simmer soup 2 hours, skimming impurities from surface. Let stand 30 minutes. Strain consommé into large saucepan. Boil until reduced to 8 cups, if necessary. Add 1 tablespoon lemon juice; season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled (fat will form solid layer on top).",
        "Whisk 4 eggs in medium bowl. Mix in leek, chicken fat, broth, coarse salt, ginger, and pepper. Stir in matzo meal. Cover; chill at least 4 hours.",
        "Using wet hands, shape generous 2 tablespoons matzo mixture into balls. Place on sheet of foil. Bring large pot of salted water to boil over high heat. Drop in matzo balls; cover pot. Reduce heat to low; simmer until matzo balls are cooked through, about 1 hour 10 minutes. Using slotted spoon, transfer matzo balls in single layer to shallow dish. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Rewarm consommé. Add more lemon juice by teaspoonfuls, if desired. Add matzo balls; simmer to reheat, 5 to 10 minutes. Divide matzo balls and consommé among 6 bowls. Garnish with chopped chives.",
        "A fragrant white wine would be great with the consommé. We like the Yarden 2007 Gewürztraminer, a kosher wine made in Israel ($18)."
    ],
    "ingredients": [
        "2 (3 3/4–4-pound) chickens, quartered",
        "4 whole lemongrass stalks, halved lengthwise, cut into 3-inch pieces",
        "2 celery stalks, cut into 3-inch pieces",
        "2 garlic cloves, peeled, halved",
        "Peel of 1 large lime, cut off in strips with vegetable peeler",
        "1/2 large white onion",
        "1 6- to 7-inch piece large leek (white and pale green parts only), halved lengthwise",
        "1 1-inch-long piece fresh ginger, peeled, halved",
        "1 tablespoon (or more) fresh lemon juice",
        "4 large eggs",
        "1/3 cup finely chopped leek (white and pale green parts only)",
        "1/3 cup chicken fat (reserved from consommé or purchased), melted, cooled",
        "2 tablespoons chicken broth or club soda",
        "1 1/2 teaspoons coarse kosher salt",
        "1 teaspoon finely grated peeled fresh ginger",
        "Pinch of freshly ground black pepper",
        "1 cup unsalted matzo meal",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Passover",
        "Leek",
        "Spring",
        "Lemongrass",
        "Simmer"
    ],
    "title": "Leek and Ginger Matzo Balls in Lemongrass Consommé",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-ginger-matzo-balls-in-lemongrass-consomme-358215"
}
