{
    "directions": [
        "Put the parsley, chervil, tarragon, 4 Tbs. of the olive oil, salt and pepper in a bowl. Using an immersion blender, blend until a smooth paste forms. Set the fines herbes puree aside.",
        "In a sauté pan or a risotto pan over medium heat, sauté the pancetta until crisp, about 8 minutes. Using a slotted spoon, transfer the pancetta to a small bowl. Pour off all but 1 Tbs. of the fat from the pan and add the remaining 2 Tbs. oil. Add the onion and cook, stirring occasionally, until softened, about 7 minutes. Add the leeks and cook, stirring occasionally, 15 to 17 minutes. Add the garlic and cook for 30 seconds.",
        "Add the rice and pancetta and stir well. Cook, stirring, until the rice is translucent, 2 to 3 minutes. Add the wine and stir until it is absorbed, about 1 minute. Add the broth 1/2 cup at a time, stirring constantly until it is almost completely absorbed before adding more.",
        "When the rice is tender but firm to the bite, after 20 to 25 minutes, remove the pan from the heat. Stir in the butter, cheese and fines herbes puree, and season with salt and pepper. Serve immediately. Serves 4 to 6."
    ],
    "ingredients": [
        "1 cup fresh flat-leaf parsley leaves",
        "1/4 cup chopped fresh chervil",
        "1 to 2 Tbs. chopped fresh tarragon",
        "6 Tbs. olive oil",
        "Salt and freshly ground pepper, to taste",
        "3 oz. pancetta, diced",
        "1/2 yellow onion, chopped",
        "4 leeks, white and light green portions, rinsed well and thinly sliced",
        "3 garlic cloves, minced",
        "1 1/2 cups Arborio rice",
        "1/2 cup dry white wine",
        "6 cups chicken broth, warmed",
        "2 Tbs. unsalted butter, cut into 2 pieces",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Leek & Pancetta Risotto with Fines Herbes",
    "url": "http://www.williams-sonoma.com/recipe/leek-and-pancetta-risotto-with-fines-herbes.html"
}
