{
    "directions": [
        "1. Heat the butter in a medium skillet and sauté the leeks over medium heat for 5-6 minutes, until soft and translucent. Add the garlic and continue to sauté for 1 minute more. Set aside.",
        "2. Heat the chicken broth with the marrowbones in a large stockpot over medium heat. Simmer for 10 minutes, removing any scum that rises to the top of the broth with a metal spoon. Add the potatoes, carrots, reserved leeks, dill, salt, and pepper to the broth and continue to simmer the soup, uncovered, until the vegetables are tender but have not lost their shape, about 30 to 35 minutes. Remove from the heat and cool for 10 minutes.",
        "3. Remove the marrowbones with a slotted spoon. Scrape the marrow from the bones with a small teaspoon and set aside. Discard the bones.",
        "4. Purée the soup in batches in a food processor fitted with a knife blade. The soup will be smooth, colorful, and thick. Return the puréed soup to the stockpot, blend in the reserved marrow, and season to taste. Reheat over low heat and garnish with parsley."
    ],
    "ingredients": [
        "8 leeks, white part only, washed and medium juilenned",
        "4 tablespoons salted butter or margarine",
        "5 medium cloves garlic, finely minced",
        "3 quarts chicken broth, homemade or low-sodium canned",
        "2 pounds marrow bones",
        "3 1/2 pounds Red Bliss potatoes, scrubbed, unpeeled, and medium chopped",
        "6 medium carrots, peeled and medium chopped",
        "2 teaspoons finely chopped fresh dill",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "Garnish: 1 teaspoon finely chopped curly parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Potato",
        "Meat",
        "Leek",
        "Fall",
        "Kosher",
        "Dill",
        "Simmer"
    ],
    "title": "Leek and Potato Soup",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-potato-soup-104865"
}
