{
    "directions": [
        "Pulse pistachios in a food processor until coarsely ground. Add flour, salt, and sugar and pulse to combine. Add butter and pulse just until a coarse meal forms. With motor running, gradually stream in 1/2 cup ice water and process until dough comes together. Transfer dough to a work surface; form into a ball, then flatten into a disk. Wrap in plastic and chill at least 30 minutes.",
        "Preheat oven to 400ºF. Heat 1 Tbsp. oil in a small skillet over medium-low. Cook leek, stirring occasionally, until softened but without taking on any color, about 5 minutes. Transfer to a plate.",
        "Mix goat cheese, cream, and garlic in a medium bowl to combine; season with salt and black pepper.",
        "Divide dough into 4 pieces. Roll out 1 piece of dough on a lightly floured surface to an 8\" round; transfer to a parchment-lined baking sheet. Using an offset spatula, spread one-quarter of goat cheese mixture over dough, leaving a 1\" border. Scatter 1 Tbsp. dill evenly over, then top with a thin layer of potato slices. Drizzle with oil; season with salt. Scatter one-quarter of leeks over potatoes. Fold edges of dough over filling, tucking and overlapping slightly as needed. Repeat with remaining dough, goat cheese mixture, chopped dill, potatoes, and leeks and more oil and salt to make 3 more galettes. Brush top of dough with egg.",
        "Bake galettes until crusts are golden brown and potatoes are soft, 30–40 minutes. Drizzle with honey and top with dill sprigs. Sprinkle with pink peppercorns, if using; season with salt and black pepper.",
        "Dough can be made 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "1/2 cup raw pistachios",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon kosher salt",
        "1 teaspoon sugar",
        "1 cup (2 sticks) chilled unsalted butter, cut into pieces",
        "1 tablespoon olive oil, plus more for drizzling",
        "1 large leek, white and pale-green parts only, halved lengthwise, thinly sliced",
        "4 ounces fresh goat cheese",
        "5 tablespoons heavy cream",
        "2 garlic cloves, finely chopped",
        "Kosher salt, freshly ground pepper",
        "All-purpose flour (for surface)",
        "4 tablespoons coarsely chopped dill, divided, plus sprigs for serving",
        "2 large Yukon Gold potatoes, thinly sliced",
        "1 large egg, beaten to blend",
        "Crushed pink peppercorns (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Tart",
        "Pastry",
        "Leek",
        "Dinner",
        "Pistachio",
        "Goat Cheese",
        "Potato",
        "Honey",
        "Bake"
    ],
    "title": "Leek and Potato Galette With Pistachio Crust",
    "url": "http://www.epicurious.com/recipes/food/views/leek-and-potato-galette-with-pistachio-crust"
}
