{
    "directions": [
        "Heat oven to 425°F. Trim dark-green tops from leeks, leaving root end intact. Remove tough outer layer. Starting 1\" above root end, halve leeks lengthwise. Wash leeks, making sure to clean all sand from between layers. Dry slightly on paper towels.",
        "Heat 1 tablespoon oil and butter in a large, deep ovenproof skillet over medium heat. Add leeks, season with salt and pepper, and cook, turning occasionally, until light golden in spots, about 5 minutes. Add wine and cook until almost all liquid is absorbed, 3-4 minutes. Add 1 cup water, chicken stock, thyme, and 1/2 teaspoon salt. Bring to a boil. Transfer skillet to oven. Bake until leeks are tender, about 20 minutes.",
        "Meanwhile, whisk 1 tablespoon parsley, Dijon mustard, vinegar, and remaining 2 tablespoons oil in a small bowl. Season vinaigrette to taste with salt and pepper.",
        "Transfer leeks to a platter, drizzle with vinaigrette, top with eggs, and garnish with remaining 1 tablespoon parsley."
    ],
    "ingredients": [
        "6 medium leeks (about 2 1/2 pounds)",
        "3 tablespoons extra-virgin olive oil, divided",
        "1 tablespoon unsalted butter",
        "1/2 teaspoon kosher salt and freshly ground black pepper",
        "1/4 cup dry white wine",
        "1 cup low-salt chicken stock",
        "5 sprigs thyme",
        "2 tablespoons chopped flat-leaf parsley, divided",
        "1 tablespoon coarse-grained Dijon mustard",
        "1 tablespoon white wine vinegar",
        "2 hard-boiled eggs, whites and yolks separated and chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mustard",
        "Appetizer",
        "Side",
        "Braise",
        "Vegetarian",
        "Quick & Easy",
        "Leek",
        "Fall",
        "Healthy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Leeks Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/leeks-vinaigrette-367716"
}
