{
    "directions": [
        "Melt butter in a large heavy pot over medium heat. Add leeks, onion, and garlic and season with salt. Cook, stirring often, until vegetables begin to soften, 5-7 minutes. Add 1 cup water and cook, stirring occasionally, until vegetables are very soft, 25-30 minutes. Let cool slightly, then transfer half of leek mixture to a blender and add half of milk, cream, and yogurt. Purée until very smooth; pour into a large bowl. Repeat with remaining leek mixture, milk, cream, and yogurt.",
        "Return soup to pot and heat over medium, adding water by ¼-cupfuls, until soup is thick enough to hold potatoes without sinking but thin enough that a spoon dragged across the top doesn't leave a trail.",
        "Season with salt and pepper.",
        "Rinse potato in a colander under cold water until water runs clear; pat completely dry.",
        "Fit a medium saucepan with thermometer; pour in oil to measure 2\". Heat over medium-high until thermometer registers 350°F. Working in batches and returning oil to 350°F between batches, add potato by the handful and fry, turning occasionally, until golden and crisp, about 2 minutes. Using a spider or slotted spoon, transfer potato to paper towels to drain. Fry parsley and rosemary until parsley is translucent, about 15 seconds. Add to potato and let cool; season with kosher salt. Serve soup topped with a nest of potatoes and herbs and seasoned with sea salt."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter",
        "6 large leeks, white and pale-green parts only, halved lengthwise, thinly sliced crosswise",
        "1 small onion, thinly sliced",
        "5 garlic cloves, thinly sliced",
        "Kosher salt",
        "2 cups whole milk, divided",
        "1 cup heavy cream, divided 1 cup plain whole-milk yogurt, divided",
        "Freshly ground black pepper",
        "1 russet potato, peeled, cut into thin matchsticks Vegetable oil (for frying; about 4 cups)",
        "1/4 cup fresh flat-leaf parsley leaves",
        "1 sprig rosemary",
        "Kosher salt",
        "Flaky sea salt (such as Maldon)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Potato",
        "Vegetarian",
        "Dinner",
        "Rosemary",
        "Leek"
    ],
    "title": "Leek Soup with Shoestring Potatoes and Fried Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/leek-soup-with-shoestring-potatoes-and-fried-herbs-51252490"
}
