{
    "directions": [
        "Soak corn husks in a bowl of warm water until softened, about 1 hour; drain.",
        "Mix masa, 1 tablespoon paprika, 1 tablespoon chili powder, garlic powder, 1 teaspoon cumin, and 1 teaspoon salt together in a bowl. Stir corn oil into masa mixture. Measure 1/2 cup turkey broth and set aside. Add remaining broth, 1 cup at a time, to masa mixture until dough is smooth and the consistency of thick peanut butter.",
        "Heat olive oil in a skillet over medium heat; saute onion and garlic until softened and translucent, 5 to 10 minutes. Remove skillet from heat and add turkey, 1 teaspoon paprika, oregano, 1 teaspoon cumin, 1 teaspoon chili powder, 1 teaspoon salt, black pepper, and cayenne pepper. Stir reserved 1/2 cup turkey broth into filling until moistened.",
        "Spoon 1 heaping tablespoon dough in the center of each corn husk. Top filling with 1 heaping tablespoon filling. Roll husk around dough and filling, tucking bottom of husk into tamale. Tie a corn husk strip or string around each tamale to secure.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Stand tamales upright in steamer, cover, and steam until cooked through, about 1 hour. Add more water as needed."
    ],
    "ingredients": [
        "1 5-ounce package cornhusks",
        "Tamale Dough:",
        "3 cups masa harina",
        "1 tablespoon paprika",
        "1 tablespoon chili powder",
        "1 tablespoon garlic powder",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "1 cup corn oil",
        "1 quart turkey broth, divided",
        "Turkey Filling:",
        "1 tablespoon olive oil",
        "1 onion, finely chopped",
        "2 cloves garlic, minced",
        "3 1/2 cups finely chopped cooked turkey",
        "1 teaspoon paprika",
        "1 teaspoon dried oregano",
        "1 teaspoon ground cumin",
        "1 teaspoon chili powder",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Leftover Turkey Tamales",
    "url": "http://allrecipes.com/recipe/235513/leftover-turkey-tamales/"
}
