{
    "directions": [
        "Heat the olive oil and sesame oil in a wok or large skillet over medium-high heat until it shimmers. Cook and stir the turkey, carrot, garlic, black pepper, ginger, and garlic and herb seasoning until the garlic releases its fragrance, about 2 minutes. Stir in 2 tablespoons of the soy sauce, and continue cooking until the carrot begins to soften, about 5 minutes. Stir in the cabbage, oyster sauce, and remaining 3 tablespoons of soy sauce. Continue to stir, until the cabbage is soft and cooked through, about 10 minutes. Remove the mixture from the heat, and set aside. Drain off any excess liquid.",
        "Preheat oven to 350 degrees F (175 degrees C). Line several baking sheets with parchment paper.",
        "To fill the wrappers, separate and place the spring roll wrappers onto your work surface, with the points of the square pointing up and down in a diamond shape. Spoon about 2 tablespoons of the turkey filling in a line across the center of the wrapper, and fold the bottom point up to cover the filling. Fold the two side points in on top of the folded wrapper, to fully enclose the filling. The two side points should be about 1 inch apart. Firmly but gently, roll the spring roll into a tight cylinder, and roll the wrapper over to firmly press down the remaining point. Set the filled wrappers seam-side down onto the parchment-lined baking sheets so they don't touch. The rolls should be about the thickness of a finger.",
        "Bake the filled rolls in the preheated oven until they begin to brown, about 15 minutes. Mash the cranberry sauce in a saucepan over medium heat until the sauce is smooth, then whisk in the sugar, vinegar, and a dash of soy sauce. Bring the mixture to a boil, and simmer, whisking the sauce, until the sugar has dissolved and the sauce reduces and thickens slightly, about 10 minutes. Remove sauce to a bowl. Serve the rolls hot with the sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 teaspoon Asian (toasted) sesame oil (optional)",
        "2 cups finely chopped cooked turkey",
        "1/2 carrot, minced",
        "2 cloves garlic, minced",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon ground ginger",
        "1/8 teaspoon garlic and herb seasoning blend (such as Mrs. Dash®)",
        "5 tablespoons soy sauce",
        "6 cups finely shredded cabbage",
        "1/2 teaspoon oyster sauce (optional)",
        "50 (7 inch square) egg roll wrappers",
        "1/4 cup jellied cranberry sauce",
        "1/4 cup white sugar",
        "1/4 cup white vinegar",
        "1 dash soy sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Leftover Turkey Spring Rolls with Cranberry Sweet and Sour Dipping Sauce",
    "url": "http://allrecipes.com/recipe/212686/leftover-turkey-spring-rolls-with-cra/"
}
