{
    "directions": [
        "Preheat oven to 350°F. Arrange lamb bone, trimmings, onion, and carrots in roasting pan. Roast until browned, stirring occasionally, about 1 hour.",
        "Pour off fat and discard lamb bone from roasting pan. Place roasting pan over 2 burners; add broth and bring to boil, scraping up any browned bits. Strain into medium saucepan; discard solids in strainer. Add stout, lager, and mustard; boil until reduced to 3/4 cup, about 5 minutes.",
        "Do ahead: Can be made 1 day ahead. Cover and refrigerate. Rewarm before finishing sauce.",
        "Remove top rack from grill. Place disposable aluminum baking pan in center of barbecue (if using 2-burner gas grill, place pan on 1 side of grill). Add enough water to pan to reach depth of 1 inch.",
        "Preheat barbecue (medium heat). If using charcoal grill, light briquettes in chimney and place half on each side of aluminum baking pan (you may need to light additional briquettes in chimney to replenish halfway through grilling time). If using 3-burner gas grill, light gas burners on left and right, leaving center burner off. If using 2-burner gas grill, light burners on side opposite disposable pan.",
        "Place lamb on rimmed baking sheet. Brush lamb all over with balsamic vinegar; sprinkle all over with granulated garlic, then lemon pepper. Place lamb, rounded side up, on grill rack over aluminum pan. Cover grill and cook lamb until instant-read thermometer inserted into thickest part of lamb registers 125°F for medium-rare (temperature of thinner parts of lamb will register between 135°F and 145°F and will vary from medium to well-done), maintaining temperature of barbecue between 350°F and 375°F, 1 to 1 1/2 hours. Transfer lamb to cutting board; let rest 10 minutes.",
        "Bring sauce just to a boil over medium heat. Remove from heat and whisk in butter and honey. Serve with sliced lamb."
    ],
    "ingredients": [
        "1 6 1/4-pound leg of lamb, boned, butterflied, trimmed of excess fat and sinew (reserve bone and trimmings for sauce)*",
        "1 small onion, chopped",
        "3/4 cup chopped peeled carrots",
        "1 1/2 cups beef broth",
        "1/2 cup Guinness Extra Stout",
        "1/2 cup Harp lager beer",
        "2 tablespoons honey mustard",
        "Disposable 11 3/4x8 1/2x1 1/4-inch aluminum baking pan",
        "1/3 cup balsamic vinegar",
        "1 tablespoon granulated garlic",
        "3 tablespoons lemon pepper seasoning",
        "2 tablespoons (1/4 stick) chilled butter, cut into 4 cubes",
        "1 teaspoon (or more) honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mustard",
        "Onion",
        "Roast",
        "Low Cal",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Leg of Lamb \"Black and Tan\"",
    "url": "http://www.epicurious.com/recipes/food/views/leg-of-lamb-black-and-tan-235345"
}
