{
    "directions": [
        "In a large skillet, heat the oil and sauté the fennel bulb over medium heat until just tender, about 3 minutes. Add the scallions and chopped garlic and sauté for 2 minutes more. Add the greens and sauté, stirring, until wilted. Remove from the heat and stir in the fennel seeds and pepper to taste. Let cool, and then add the mint.",
        "Make 8 small slits randomly in the lamb and insert the garlic quarters.",
        "Transfer half of the greens mixture to a small bowl. Add the cheese to the greens remaining in the skillet. Taste and adjust the seasonings, adding salt if necessary (Feta is usually quite salty). Stuff the lamb with the cheese mixture, squeezing it to extract the excess juices; add some of the remaining greens if needed; the lamb should be well stuffed. Close the opening with toothpicks. Rub the lamb all over with the remaining greens. Cover and refrigerate for at least 3 hours, or overnight.",
        "Preheat the over to 450°F.",
        "Scrape the greens off the surface of the lamb and reserve. Brush the lamb with oil and sprinkle with the oregano and salt and pepper to taste. Place the lamb in a roasting pan that just holds it comfortably, preferably clay or Pyrex one. Roast for 20 minutes.",
        "Meanwhile, in a medium saucepan, bring the wine to a boil and simmer for 1 minute. Add the reserved greens.",
        "Pour the greens mixture over the lamb and roast for 5 minutes more. Reduce the oven temperature to 350°F and roast the lamb, basting frequently with the pan juices, adding a little more wine to the pan if necessary, for about 30 minutes longer, or until an instant-read meat thermometer inserted into the thickest part of the meat registers 135°F for medium. Remove the lamb from the oven, sprinkle with the chopped fennel or dill, cover with aluminum foil and let rest for 15 minutes.",
        "Carve the lamb and serve, passing the pan juices in a bowl or sauceboat at the table.",
        "NOTE: Alternatively, you can use a butterflied leg of lamb. Spread the stuffing over the lamb, roll it up and tie it. Marinate and roast as directed."
    ],
    "ingredients": [
        "1/3 cup olive oil, plus more for brushing",
        "1 fennel bulb, trimmed (fronds and tender stalks reserved), halved and thinly sliced",
        "1 1/2 cups thinly sliced scallions (white and most of the green parts)",
        "1 tablespoon coarsely chopped garlic, plus 2 garlic cloves, quartered",
        "1 1/2 cups coarsely chopped mixed greens (such as baby spinach, tender Swiss chard leaves, miner's lettuce, pea shoots, orache, green amaranth, outer leaves of escarole or romaine lettuce, and/or beet greens)",
        "1 teaspoon fennel seeds, preferably freshly ground or crushed in a mortar",
        "Freshly ground black pepper",
        "1/4 cup chopped fresh mint",
        "1 3 1/2-to-4 pound half leg of lamb (shank half), some fat left on, shank bone left in, hip end of bone removed (have the butcher do this, or see Note)",
        "1/2 cup crumbled Feta cheese",
        "Salt",
        "1 teaspoon dried oregano, crumbled",
        "1/2 cup dry white wine, plus more if needed",
        "1/2 cup chopped fennel fronds plus tender stalks, or fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Lamb",
        "Roast",
        "Easter",
        "Feta",
        "Spring",
        "Chard"
    ],
    "title": "Leg of Lamb Stuffed with Greens and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/leg-of-lamb-stuffed-with-greens-and-feta-231777"
}
