{
    "directions": [
        "Toss half of tomato slices with onions, eggplant, garlic, oregano, potatoes, salt, and pepper to taste in a large bowl. Transfer to an oiled shallow 3-quart casserole, spreading evenly. Arrange remaining tomato slices on top. Roast, uncovered, in middle of oven 30 minutes.",
        "Trim lamb of all but a 1/4-inch layer of fat. Cut small slits all over lamb with a sharp small knife and put a slice of garlic into each slit. Rub lamb with some lemon juice and season with oregano, salt, and pepper.",
        "After tian has been roasting 30 minutes, put lamb on top of vegetables. Roast in middle of oven 30 minutes, then reduce temperature to 350°F.",
        "Continue roasting, basting meat with cooking juices (baste with remaining lemon juice during last 30 minutes of roasting) until a thermometer inserted into thickest part of meat (do not touch bone) registers 135°F for medium-rare, about 1 1/2 hours. Transfer meat to a cutting board, cover tian with foil, and let meat stand 15 minutes before carving. Spoon off any excess fat from tian and discard. Serve tian with lamb."
    ],
    "ingredients": [
        "1 1/2 lb tomatoes, cut crosswise into 1/4-inch-thick slices",
        "1 lb onions, thinly sliced",
        "1 (1-lb) eggplant, cut crosswise into 1/4-inch-thick slices",
        "4 large garlic cloves, chopped",
        "1 1/2 teaspoons dried oregano, crumbled",
        "2 lb boiling potatoes, peeled and cut into 3/4-inch-thick slices",
        "1 teaspoon salt",
        "1 (6- to 7-lb) leg of lamb (aitchbone removed by butcher)",
        "3 large garlic cloves, thinly sliced",
        "1/4 cup fresh lemon juice",
        "1 teaspoon dried oregano, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Potato",
        "Tomato",
        "Vegetable",
        "Roast",
        "Easter",
        "Buffet",
        "Lemon",
        "Eggplant",
        "Spring",
        "Oregano",
        "Gourmet"
    ],
    "title": "Leg of Roasted Lamb on Potato, Eggplant, and Tomato Tian",
    "url": "http://www.epicurious.com/recipes/food/views/leg-of-roasted-lamb-on-potato-eggplant-and-tomato-tian-104890"
}
