{
    "directions": [
        "Oil large baking sheet. Stir sugar and water in heavy small saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally. Stir in pistachios. Immediately pour mixture onto prepared sheet. Cool praline completely.",
        "Finely chop praline. Grind 1/2 cup praline to powder in processor.",
        "Position 1 rack in center and 1 rack in top third of oven. Preheat oven to 225°F. Line 2 large baking sheets with parchment. Draw two 8-inch-diameter circles on 1 parchment sheet and 1 circle on second. Turn over parchment on baking sheets, marked side down. Using electric mixer, beat 5 egg whites and cream of tartar in large bowl until soft peaks form. Gradually add 1/2 cup sugar; beat until egg whites are stiff but not dry. Beat in almond extract. Stir powdered sugar and 1/2 cup praline powder in bowl to blend. Fold into meringue in 2 additions.",
        "Divide meringue among traced circles. Using spatula, spread mixture to edges. Bake until crisp and pale golden, reversing baking sheets after 45 minutes, about 1 hour and 45 minutes. Cool meringues completely.",
        "Stir white chocolate in top of double boiler set over simmering water until melted. Remove from over water; cool.",
        "Using electric mixer, beat egg whites and cream of tartar in large bowl until soft peaks form. Gradually beat in 2 tablespoons sugar.",
        "Meanwhile, combine remaining 2/3 cup sugar, 3 tablespoons water and corn syrup in heavy small saucepan. Stir over medium-low heat until sugar dissolves. Increase heat and boil without stirring until candy thermometer registers 238°F., brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 5 minutes.",
        "Immediately pour hot syrup in thin steady stream into beaten egg whites, beating until mixture is completely cool, about 4 minutes. Beat in butter 2 tablespoons at a time. Beat in white chocolate, lemon juice, peel and vanilla. Chill until thickened to spreadable consistency, about 45 minutes or less (If frosting looks curdled, place bowl over saucepan of simmering water and whisk just until butter softens slightly. Remove from heat. Using electric mixer, beat buttercream until smooth. Repeat warming technique as necessary to create smooth buttercream.)",
        "Place 1 meringue layer on platter. Spread scant 1 cup buttercream evenly over. Top with another meringue layer. Spread scant 1 cup buttercream evenly over top and sides of torte. Press chopped praline onto sides and in 1-inch border along top edge of torte. Chill overnight. Let torte stand at room temperature 30 minutes before serving."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "3 tablespoons water",
        "1 cup shelled unsalted pistachios",
        "5 large egg whites",
        "1/2 teaspoon cream of tartar",
        "1/2 cup sugar",
        "1/2 teaspoon almond extract",
        "1 cup powdered sugar",
        "4 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "4 large egg whites",
        "1/4 teaspoon cream of tartar",
        "2 tablespoons plus 2/3 cup sugar",
        "3 tablespoons water",
        "1 tablespoon light corn syrup",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon plus 2 teaspoons grated lemon peel",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Pistachio",
        "Chill",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon and Pistachio Praline Meringue Torte",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-pistachio-praline-meringue-torte-446"
}
