{
    "directions": [
        "Preheat the oven to 350 degrees F. Spray the sides and bottom of two 9-by-5-by-3-inch loaf pans with nonstick cooking spray. Line the bottom with parchment paper and spray the paper.",
        "Sift both flours, baking powder, baking soda, and salt together in a medium bowl.",
        "Put the sugar, eggs, lemon zest, and lemon juice in a food processor and pulse until combined. With the motor running, drizzle the butter in through the feed tube. Add the sour cream and vanilla and pulse until combined. Transfer the mixture to a large bowl.",
        "Sprinkle the flour mixture, one third at a time, folding gently after each addition until just combined. Do not overmix.",
        "Divide the batter evenly between the prepared pans. Bake in the center of the oven for 20 minutes, rotate the pans, reduce the oven temperature to 325 degrees F., and bake for another 30 to 35 minutes, or until a toothpick inserted in the center of the loaf comes out clean.",
        "Let cool in the pans for 15 minutes.",
        "In a small saucepan over medium heat, heat the lemon juice and sugar until the sugar is completely dissolved. Once dissolved, continue to cook for 3 more minutes. Remove from the heat and set aside.",
        "Line a half sheet pan with parchment paper and invert the loaves onto the pan. Use a toothpick to poke holes in the tops and sides of the loaves.",
        "Brush the tops and sides of the loaves with the lemon syrup. Let the syrup soak into the cake and brush again. Let the cakes cool completely, at least 30 minutes.",
        "(The soaked but unglazed loaves will keep, wrapped in two layers of plastic wrap and frozen, for up to 6 weeks.)",
        "In a small bowl, whisk together the confectioners' sugar and 4 tablespoons of the lemon juice. The mixture should be thick but pourable. If the mixture is too stiff, add up to another 2 tablespoons lemon juice and whisk again, adding small amounts of lemon juice and/or confectioners' sugar until you get the right consistency. Pour the lemon glaze over the top of each loaf and let it drip down the sides. Let the lemon glaze harden, about 15 minutes, before serving.",
        "The glazed loaves will keep for up to 3 days, wrapped tightly in plastic wrap, at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups cake flour",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1 teaspoon salt",
        "2 1/4 cups sugar",
        "8 large eggs, at room temperature",
        "1/4 cup grated lemon zest (from about 4 lemons)",
        "1/4 cup fresh lemon juice",
        "2 cups (4 sticks) unsalted butter, melted and cooled",
        "1/2 cup sour cream, at room temperature",
        "2 teaspoons pure vanilla extract",
        "1/3 cup fresh lemon juice",
        "1/3 cup sugar",
        "2 cups confectioners' sugar, sifted, or more if needed",
        "4 to 6 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Wedding",
        "Lemon",
        "Spring",
        "Winter",
        "Shower",
        "Party",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Lemon Loaf",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-lemon-loaf-350989"
}
