{
    "directions": [
        "Combine first 4 ingredients in large microwave-safe bowl. Place bowl in microwave and cook on high until butter melts, whisking every minute, about 3 minutes. Remove from microwave; cool 5 minutes. Beat eggs in small bowl to blend. Whisk half of butter mixture into eggs. Return mixture to same large bowl. Place in microwave and cook on high until curd is slightly thickened but not boiling, whisking every minute, about 4 minutes (curd will continue to thicken when chilled). Transfer curd to medium bowl. Press plastic wrap onto surface. Chill until firm, at least 1 day and up to 1 week.",
        "Combine sugar and lemon juice in small bowl. Whisk until sugar dissolves.",
        "Preheat oven to 350°F. Butter 8x8x2-inch metal baking pan. Using electric mixer, beat butter in large bowl until smooth. Add sugar and lemon peel and beat until fluffy. Beat in 1 egg, then half of flour; repeat. Transfer batter to prepared baking pan.",
        "Bake cake until tester inserted into center comes out clean, about 25 minutes. Place pan with cake on rack. Using slender wooden skewer, poke holes all over top of cake. Spoon syrup over cake in several additions, allowing syrup to be absorbed each time. Cool cake completely. (Can be made 1 day ahead. Cover and let stand at room temperature.)",
        "Whisk crème fraîche and 1/2 cup lemon curd in small bowl to blend. Cover and refrigerate until ready to use.",
        "Cut cake into squares. Top with lemon crème fraîche; spoon berries alongside. Garnish with mint, if desired."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons sugar",
        "3/4 cup fresh lemon juice",
        "1/2 cup (1 stick) unsalted butter",
        "2 1/2 tablespoons grated lemon peel",
        "3 large eggs",
        "1/2 cup sugar",
        "3/4 cup fresh lemon juice",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 cup sugar",
        "1 1/2 teaspoons grated lemon peel",
        "2 large eggs",
        "1 3/4 cups self-rising flour",
        "2 cups crème fraîche or plain yogurt",
        "3 cups sliced hulled strawberries (from about 1 pound)",
        "Fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Yogurt",
        "Strawberry",
        "Lemon",
        "Summer"
    ],
    "title": "Lemon Syrup Cake with Berries and Lemon-Curd Cream",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-syrup-cake-with-berries-and-lemon-curd-cream-109495"
}
