{
    "directions": [
        "Combine almonds and sugar in processor and chop finely. Transfer to medium bowl. Combine margarine and cinnamon and mix into almonds. Transfer to 9-inch-diameter springform pan. Using plastic wrap as aid, press almond mixture firmly 2 inches up sides and then over bottom of pan. Freeze 15 minutes.",
        "Preheat oven to 350°F. Place pan with crust on cookie sheet and bake 20 minutes. If crust sides slip, press back in place with back of fork. Transfer pan to rack and cool crust completely.",
        "Melt strawberry preserves in heavy small saucepan. Pour into cooled crust and spread to cover bottom. Cool. Soften ice very slightly and spread in pan. Freeze until firm. (Can be prepared 1 day ahead. Cover and freeze.)",
        "Combine 1/2 cup sugar and 1/2 cup water in heavy medium saucepan. Scrape in seeds from vanilla bean; add pod. Simmer 5 minutes. Add remaining 1/2 cup sugar and stir to dissolve. Add rhubarb. Bring to boil, reduce heat, cover and simmer until rhubarb is tender, about 8 minutes. Add frozen strawberries and bring to simmer. Cool. Cover and refrigerate until well chilled. (Can be prepared 1 day ahead.)",
        "Remove vanilla pod from sauce. Cut between crust and pan sides with small sharp knife. Remove pan sides. Spoon 1/2 cup sauce over center of torte. Mound fresh strawberries in center. Garnish with fresh mint sprigs. Cut torte into slices and serve with sauce."
    ],
    "ingredients": [
        "3 cups blanched slivered almonds, toasted (about 12 ounces)",
        "1/2 cup sugar",
        "5 tablespoons margarine, melted",
        "1/4 teaspoon ground cinnamon",
        "1/3 cup strawberry preserves",
        "3 pints lemon or pineapple ice, sherbet or sorbet",
        "1 cup sugar",
        "1/2 cup water",
        "1 vanilla bean, split lengthwise",
        "1 20-ounce bag frozen unsweetened rhubarb",
        "1 20-ounce bag frozen unsweetened strawberries",
        "1 1-pint basket fresh strawberries",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Passover",
        "Strawberry",
        "Lemon",
        "Kosher",
        "Rhubarb",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Lemon Ice Torte with Strawberry-Rhubarb Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ice-torte-with-strawberry-rhubarb-sauce-1624"
}
