{
    "directions": [
        "Preheat oven to 325°F. Generously butter 10-inch-diameter springform pan with 2 3/4-inch-high sides. Double-wrap outside of pan with heavy-duty foil. Blend ground cookies, sugar, and ginger in processor. Add melted butter and process until moist crumbs form. Press mixture onto bottom and 1/2 inch up sides of prepared pan. Bake until crust sets, about 10 minutes. Cool. Maintain oven temperature.",
        "Using electric mixer, beat cream cheese in large bowl until fluffy. Beat in sugar, scraping down sides of bowl occasionally. Add eggs 1 at a time, beating well after each addition. Beat in sour cream and whipping cream, then crystallized ginger, fresh ginger, lemon juice, and lemon peel.",
        "Pour filling into crust. Place springform pan in large roasting pan. Pour enough boiling water into roasting pan to come 1 inch up sides of springform pan. Bake cheesecake until filling is set and golden brown on top (cake will rise slightly above edge of pan), about 1 hour 25 minutes. Turn off oven and prop open oven door with wooden spoon. Let cake stand in oven 1 hour (cake will fall).",
        "Remove springform pan from water bath. Remove foil and cool cheesecake completely on rack. Cover and refrigerate overnight. (Can be prepared ahead and refrigerated 4 days or frozen up to 2 months. Defrost frozen cake overnight in refrigerator.) Release pan sides from cheesecake. Transfer cheesecake to platter. Arrange lemon slices decoratively around cake and serve."
    ],
    "ingredients": [
        "2 cups finely ground gingersnap cookies (about 9 ounces)",
        "2 tablespoons sugar",
        "1/2 teaspoon ground ginger",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/4 cups sugar",
        "4 large eggs, room temperature",
        "1 cup sour cream",
        "1/2 cup whipping cream",
        "1/2 cup finely chopped crystallized ginger",
        "2 tablespoons finely grated peeled fresh ginger",
        "2 tablespoons fresh lemon juice",
        "4 teaspoons grated lemon peel",
        "Lemon slices (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Ginger",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Lemon",
        "Summer",
        "Chill",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Ginger Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ginger-cheesecake-108255"
}
