{
    "directions": [
        "Pat the chickens very dry with paper towels. Season inside the cavities with salt and pepper. Combine the butter, lemon zest, parsley, chervil, chives, tarragon, 2 teaspoons salt and a few grinds of pepper in a mini food processor; pulse until almost smooth. Gently loosen the skin on the chicken breasts and thighs with your fingers. Rub half of the herb butter evenly under the skin of both chickens, then rub the remaining herb butter all over the chickens. Refrigerate, uncovered, at least 30 minutes to dry out the skin.",
        "About 30 minutes before roasting, bring the chickens to room temperature. Preheat the oven to 450 degrees F. Stuff the lemon quarters into the chicken cavities. Tie the legs together with kitchen twine and tuck the wings under the body. Arrange the chickens breast-side up on a rack set on a rimmed baking sheet or in a shallow roasting pan, leaving a bit of space between them; scatter the lemon wedges on the rack around the chickens.",
        "Roast until the breasts and tops of the legs are golden, about 30 minutes. Rotate the pan and reduce the oven temperature to 350 degrees F. Continue roasting until the skin is golden and crisp all over and a thermometer inserted into the thickest part of the thigh registers 165 degrees F, 40 to 50 more minutes.",
        "Remove the chickens from the oven; let rest 15 minutes in the pan. Remove the twine and carve the chickens (see below); serve with the roasted lemon wedges."
    ],
    "ingredients": [
        "2 3- to 4-pound chickens, giblets removed",
        "Kosher salt and freshly ground pepper",
        "6 tablespoons unsalted butter, at room temperature",
        "4 lemons (2 zested and quartered, 2 cut into wedges)",
        "1/2 cup chopped fresh parsley",
        "1/2 cup chopped fresh chervil",
        "1/2 cup chopped fresh chives",
        "1/4 cup chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Recipes",
        "Chicken",
        "Poultry Recipes"
    ],
    "title": "Lemon-Herb Roast Chicken",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/lemon-herb-roast-chicken"
}
