{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Lightly brush 8 muffin cups with some of melted butter and chill 2 minutes, then butter again and chill 1 minute more. Dust cups with matzo cake flour, knocking out excess.",
        "Beat together softened butter, 2/3 cup sugar, and 1/8 teaspoon salt in a large bowl with an electric mixer at medium-high speed until pale and fluffy, then add egg yolks, 1 at a time, beating until well blended. Beat in lemon juice and 2 teaspoons zest until combined. Add flour and mix at low speed until just combined.",
        "Beat whites with remaining 1/8 teaspoon salt in another bowl with cleaned beaters until they hold soft peaks. Add 2 tablespoons sugar, a little at a time, beating, then beat until whites just hold stiff peaks. Stir one fourth of whites into yolk mixture to lighten, then fold in remaining whites gently but thoroughly. Spoon batter into 8 prepared muffin cups.",
        "Blend remaining 2 tablespoons sugar and 1 teaspoon zest with your fingertips and sprinkle over batter, then bake until cakes are puffed, edges are golden, and a wooden pick or skewer inserted in center of cake comes out clean, 20 to 25 minutes. Cool cakes in pan on a rack 15 minutes, then lift out cakes carefully (tops will break easily) and cool completely on rack.",
        "Bring all syrup ingredients to a boil, covered, in a 3-quart heavy saucepan over moderate heat, stirring occasionally, then remove lid and boil 10 minutes. Pour syrup through a sieve into a bowl, pressing on and then discarding solids. Cool to room temperature.",
        "Beat cream in a bowl with cleaned beaters until it just holds stiff peaks.",
        "Spoon 1/4 cup syrup into each of 8 shallow bowls and top with cakes. Spoon whipped cream on top of cakes."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened, plus 1 1/2 tablespoons, melted",
        "3/4 cup matzo cake flour plus additional for dusting",
        "2/3 cup plus 1/4 cup sugar",
        "1/4 teaspoon salt",
        "3 large eggs, separated, at room temperature for 30 minutes",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon finely grated lemon zest",
        "1 1/4 cups sugar",
        "1 1/2 cups water",
        "1 (4- by 1-inch) strip fresh lemon zest",
        "1/2 cup fresh lemon juice",
        "8 large fresh basil sprigs",
        "1 cup chilled heavy cream",
        "Special equipment: a muffin pan with 12 (1/2-cup) muffin cups",
        "Garnish: small fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Herb",
        "Dessert",
        "Bake",
        "Passover",
        "Lemon",
        "Basil",
        "Spring",
        "Kosher",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon Cakes with Basil Lemon Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cakes-with-basil-lemon-syrup-231815"
}
