{
    "directions": [
        "To make the pudding, place the cashews in the Personal Blender with the grinder lid and 2-cup container or a food processor and grind into a powder. Add the bananas, lemon juice, and agave syrup and process until smooth. Place in the fridge to chill.",
        "To make the cupcakes, combine the pecans, coconut, and salt in the food processor and process into evenly sized small pieces, taking care not to overprocess into a butter. Scoop the mixture into another bowl. Combine the dates and vanilla in the food processor and process into small pieces. Return the pecan mixture to the food processor and pulse to mix. The cake mix should have a crumbly but sticky texture.",
        "Place 6 cupcake liners in a muffin pan. Use a 1/2-cup measuring cup to scoop 1/2 cup loosely packed pecan mixture into each. Using your fingertips, gently press to firm up the cupcakes and create cavities in the centers to hold the pudding. Make sure the edges reach the tops of the cupcake liners.",
        "To assemble, scoop about 3 tablespoons pudding into each cupcake and top with coconut. Place the muffin pan in the refrigerator to chill for several hours to firm up the cupcakes before serving.",
        "The pudding will keep for a few days in fridge when stored separately. The cupcakes, stored separately, will keep for several weeks in the fridge. The assembled cupcakes will keep in the fridge for a few days."
    ],
    "ingredients": [
        "1/3 cup cashews",
        "1 1/2 bananas",
        "1/4 cup lemon juice (from 1 to 2 lemons)",
        "2 tablespoons agave syrup",
        "2 1/2 cups dry pecans",
        "1/2 cup shredded coconut",
        "1/8 teaspoon sea salt",
        "3/4 cup firmly packed pitted Medjool dates",
        "3 tablespoons alcohol-free vanilla extract",
        "1/2 cup shaved or shredded coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Fruit",
        "Nut",
        "Dessert",
        "Vegetarian",
        "Kid-Friendly",
        "Tropical Fruit",
        "Coconut",
        "Tree Nut",
        "Cashew",
        "Pecan",
        "Birthday",
        "Shower",
        "Chill",
        "Vegan",
        "Raw",
        "Party",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Pudding Filled Coconut Cupcakes with Shaved Coconut Topping",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pudding-filled-coconut-cupcakes-with-shaved-coconut-topping-354035"
}
