{
    "directions": [
        "Mix the batter",
        "Preheat an oven to 350°F.",
        "Grate 2 tsp. zest from the lemons and squeeze 1/3 cup juice.",
        "In a large bowl, whisk together 3/4 cup of the sugar, the flour and the salt. Add the melted butter, lemon juice, lemon zest and egg yolks and continue whisking until smooth. Whisk in the milk.",
        "Beat the egg whites",
        "In a large bowl, using an electric mixer, beat the egg whites and cream of tartar on medium-high speed until foamy. Slowly add the remaining 1/4 cup sugar and beat until the whites hold stiff, shiny peaks, about 1 minute; do not overwhip.",
        "Using a rubber spatula, fold one-third of the egg whites into the batter to lighten it. Fold in the remaining whites just until no white streaks remain. Pour the batter into the 8-inch square baking dish.",
        "Bake the cake",
        "Place the filled baking dish into a 9-by-13-inch baking pan and pour hot water into the pan to reach halfway up the sides of the dish. Bake until the top of the cake is evenly light brown and firm, about 40 minutes. There may be several small cracks on top. Remove the baking dish from the water bath, place on a wire rack and let cool.",
        "Serve the cake warm, at room temperature or cold. Scoop out each serving with a large spoon and accompany with whipped cream. Serves 6.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Desserts,",
        "by Elinor Klivans (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 to 3 large lemons",
        "1 cup sugar",
        "1/4 cup all-purpose flour",
        "1/8 tsp. salt",
        "4 Tbs. (1/2 stick) unsalted butter, melted",
        "3 eggs, separated",
        "1 1/4 cups milk",
        "1/4 tsp. cream of tartar",
        "Whipped cream for serving (optional; see note above)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemon Pudding Cake",
    "url": "http://www.williams-sonoma.com/recipe/lemon-pudding-cake.html"
}
