{
    "directions": [
        "To make the dipping sauce, in a mortar, pound together the garlic and red chili with a pestle until pureed (or pass the garlic clove through a garlic press). Mix in the lime juice, fish sauce, sugar and water and add the carrot. Set aside.",
        "Bring a large saucepan three-fourths full of water to a boil over high heat. Drain the noodles, add to the boiling water, stir well and boil until tender, 2 to 3 minutes. Drain the noodles in a colander, rinse thoroughly with cold running water and drain again. Set aside.",
        "In a bowl, combine the beef, lemongrass, half of the garlic, the fish sauce, sugar and pepper. Mix well, cover and set aside.",
        "To make the salad, in a large bowl, toss together the lettuce, cucumber, bean sprouts, carrot, basil and mint. Divide the salad evenly among 4 shallow bowls. Top each with an equal amount of the noodles. Set aside.",
        "Preheat a wok or deep-fry pan over medium-high heat. When the pan is hot, add the 3 Tbs. oil and the remaining garlic and stir-fry until light golden brown, about 30 seconds. Add the onion and stir-fry until the layers separate, about 30 seconds more. Push the onion and garlic up the sides of the pan. Add additional oil if the pan is dry. When the oil is hot, add a batch of the beef mixture and spread it over the bottom of the pan. Cook, without stirring, until the beef is nicely seared on the bottom, about 1 minute. Turn the beef over and sear the other side, about 1 minute more. Transfer the beef and onion to a plate. Fry the remaining beef mixture in batches.",
        "When all of the beef is seared, return the beef and onion to the wok and toss for a few seconds to reheat. Spoon one-fourth of the beef-onion mixture over each salad. Garnish with the peanuts and fried shallots. Pour the dipping sauce into individual bowls.",
        "To eat, each diner spoons the dipping sauce over his or her portion, to taste, then, using chopsticks, tosses together the noodles, salad and topping."
    ],
    "ingredients": [
        "1 large garlic clove",
        "1 fresh red chili, seeded",
        "1/4 cup fresh lime juice",
        "5 Tbs. fish sauce",
        "3 Tbs. sugar",
        "6 Tbs. water",
        "2 Tbs. grated carrot",
        "3/4 lb. dried rice vermicelli, soaked in  &nbsp warm water for 15 minutes",
        "1 lb. beef chuck or flank, thinly sliced against  &nbsp the grain",
        "3 lemongrass stalks, tender midsection  &nbsp only, finely minced",
        "5 garlic cloves, chopped",
        "1 1/2 Tbs. fish sauce",
        "1/2 tsp. sugar",
        "Freshly ground pepper, to taste",
        "4 cups finely shredded red or green-leaf lettuce  &nbsp or romaine lettuce",
        "1/2 English cucumber, peeled and finely  &nbsp julienned",
        "2 cups bean sprouts",
        "1 carrot, peeled and finely grated",
        "1/2 cup coarsely chopped fresh Thai basil",
        "1/2 cup finely shredded fresh mint leaves",
        "3 Tbs. vegetable oil, or as needed",
        "1 large red onion, very thinly sliced",
        "1/2 cup chopped unsalted roasted peanuts",
        "Fried shallots for serving (see note)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemongrass Beef and Onions over Rice Vermicelli (Bun Bo)",
    "url": "http://www.williams-sonoma.com/recipe/lemongrass-beef-and-onions-over-rice-vermicelli-bun-bo.html"
}
