{
    "directions": [
        "Using a Philips pasta maker fitted with the spaghetti die, use the flour, eggs and water to make spaghetti according to manufacturer’s instructions.",
        "While the pasta is being made, place the shrimp in a bowl and season with salt and pepper. Add the garlic and olive oil to the bowl and toss to coat the shrimp. Refrigerate for 15 minutes.",
        "Meanwhile, bring a large pot two-thirds full of salted water to a boil over high heat.",
        "In a large fry pan over medium heat, melt 4 Tbs. of the butter. Add the shallots and sauté until tender, about 5 minutes. Add the wine, lemon juice and zest, the remaining 4 Tbs. butter and the red pepper flakes. Bring to a simmer, add the cream, reduce the heat to low and cook until golden and fragrant, about 5 minutes.",
        "Preheat an indoor grill or a grill pan over medium-high heat. Grill the shrimp until they are pink and opaque throughout, about 2 minutes per side. Transfer the shrimp to a plate and cover with aluminum foil to keep warm.",
        "Cook the pasta in the boiling water until al dente, about 3 minutes. Drain the spaghetti and transfer to the pan with sauce. Toss to coat. Top with the shrimp and season with more lemon juice and red pepper flakes if desired. Garnish with basil leaves and serve immediately.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "3 1/4 cups (1 lb./500 g) all-purpose flour",
        "2 eggs",
        "6 Tbs. (3 fl. oz./90 ml) water",
        "1 lb. (500 g) shrimp, peeled and deveined, tails intact",
        "Kosher salt and freshly ground pepper",
        "3 garlic cloves, grated",
        "2 Tbs. extra-virgin olive oil",
        "8 Tbs. (1 stick) (4 oz./125 g) unsalted butter",
        "3 shallots, minced",
        "1/3 cup (3 fl. oz./80 ml) plus 2 Tbs. white wine",
        "Grated zest and juice of 1 lemon, plus more to taste",
        "1 tsp. red pepper flakes, plus more to taste",
        "1/2 cup (4 fl. oz./125 ml) heavy cream",
        "Fresh basil leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemony Spaghetti with Garlic Shrimp",
    "url": "http://www.williams-sonoma.com/recipe/lemony-spaghetti-with-garlic-shrimp.html"
}
