{
    "directions": [
        "Preheat oven to 325°F.",
        "Have ready a 9-inch (1-quart) glass pie plate. In a dry 5-quart heavy kettle cook 1 cup sugar over moderately low heat, stirring slowly with a fork (to help sugar melt evenly), until melted and pale golden. Cook caramel, without stirring, gently swirling kettle, until deep golden. Immediately pour caramel into pie plate, tilting pie plate to coat bottom and side evenly, and put pie plate in a baking pan.",
        "With a vegetable peeler remove zest from 1 lemon and in a food processor pulse with remaining 1/3 cup sugar until finely chopped. Squeeze enough juice from lemons to measure 1/4 cup. In a saucepan bring cream and lemon sugar just to a boil, stirring. In a bowl whisk together eggs, yolks, vanilla, and a pinch salt until combined well and add cream mixture and lemon juice in a stream, whisking. Pour custard through a sieve into pie plate.",
        "Add enough hot water to baking pan to reach halfway up side of pie plate and bake crème caramel in middle of oven about 40 minutes, or until outer 3 inches are set but center still trembles slightly. (Custard will continue to set as it cools.) Remove pie plate from pan and cool crème caramel completely on a rack. Chill crème caramel, loosely covered with plastic wrap, at least 4 hours and up to 2 days. Run a thin knife around edge of crème caramel and gently rotate pie plate back and forth to make sure crème caramel is loosened. Invert a flat serving plate with a slight lip over pie plate and invert crème caramel onto serving plate."
    ],
    "ingredients": [
        "1 1/3 cups sugar",
        "2 large lemons",
        "2 cups heavy cream",
        "3 large eggs",
        "2 large egg yolks",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Crème Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-creme-caramel-15752"
}
