{
    "directions": [
        "1. Mince the parsley and place it in a large shallow bowl. Add the oil, lemon zest, and pine nuts and mix until well combined. Season with salt, cover, and let sit for at least 2 hours at room temperature.",
        "2. Bring a large pot of salted water to a boil over high heat. Add the tagliatelle, stir, and cook until it is al dente (tender but still firm to the bite), 1 to 1 1/2 minutes. Drain, reserving 1/2 cup of the cooking water.",
        "3. Add the hot pasta along with the cooking water immediately to the prepared sauce and toss until the sauce is thoroughly distributed. Season with salt and pepper and toss again.",
        "4. To serve, use two spoons and carefully scoop up the pasta, making sure to get pine nuts with each serving (see Note). Serve with lemon wedges if desired for squeezing atop the pasta.",
        "Note: The pine nuts tend to fall to the bottom of the bowl no matter how well you toss the pasta. Once the pasta is served, simply return to the bowl and evenly distribute the remaining pine nuts over each serving."
    ],
    "ingredients": [
        "1 cup (gently packed) fresh flat-leaf parsley leaves",
        "1/2 cup extra-virgin olive oil",
        "Zest of 2 lemons, cut into fine (julienne) strips",
        "1/2 cup pine nuts, lightly toasted",
        "Fine sea salt",
        "1 recipe fresh pasta dough cut into tagliatelle (about 1 3/4 pounds)",
        "Freshly ground black pepper",
        "1 lemon, cut into 6 wedges (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Herb",
        "Nut",
        "Pasta",
        "Vegetarian",
        "Dinner",
        "Lemon",
        "Pine Nut",
        "Party",
        "Noodle",
        "Parsley",
        "Boil",
        "Sugar Conscious",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Pine Nut Tagliatelle",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pine-nut-tagliatelle-103809"
}
