{
    "directions": [
        "Combine first 5 ingredients in heavy medium saucepan. Stir over medium heat until butter melts and sugar dissolves. Remove from heat. Gradually whisk in eggs. Whisk constantly over medium-low heat until curd thickens, about 2 minutes (do not boil). Strain curd through sieve into bowl. Press plastic wrap directly onto surface of curd; chill overnight.",
        "Combine all ingredients in small saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat and simmer 5 minutes. Cool.",
        "Using electric mixer, beat cream cheese, 1/2 cup sugar, 1/4 cup whipping cream, and vanilla in large bowl until smooth. Beat 2 cups whipping cream and 1/4 cup sugar in another large bowl until peaks form. Fold whipped cream into cream cheese mixture in 2 additions.",
        "Puree 1 container blueberries and 1/4 cup lemon syrup in processor. Transfer to medium bowl. Add 1 1/2 containers blueberries and mash with potato masher until chunky puree forms. Reserve remaining blueberries for garnish.",
        "Arrange 1/3 of pound cake cubes (about 2 generous cups) in bottom of 14-cup glass trifle dish. Drizzle with 7 tablespoons lemon syrup. Spoon 1/3 of cream cheese filling (about 2 cups) over cake in dollops; spread to sides of dish. Spoon half of blueberry puree over; spread to sides of dish. Spoon half of lemon curd (about 1 1/4 cups) over blueberry puree in dollops, then spread to sides of dish. Repeat layering with 1/3 of cake cubes, 7 tablespoons lemon syrup, 1/3 of cream cheese filling, and remaining blueberry puree, then remaining cake cubes, 7 tablespoons lemon syrup, and remaining lemon curd. Spread remaining cream cheese filling over. Sprinkle with reserved blueberries. Cover and chill overnight. (Can be made 2 days ahead. Keep refrigerated.) Spoon trifle into dessert dishes."
    ],
    "ingredients": [
        "1 1/3 cups sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes",
        "2/3 cup fresh lemon juice",
        "1 tablespoon grated lemon peel",
        "1/8 teaspoon salt",
        "5 large eggs, beaten to blend",
        "1 cup water",
        "1 cup sugar",
        "1/3 cup fresh lemon juice",
        "1 tablespoon (packed) grated lemon peel",
        "1 8-ounce package cream cheese, room temperature",
        "3/4 cup sugar",
        "2 1/4 cups chilled heavy whipping cream",
        "1/4 teaspoon vanilla extract",
        "3 1/2-pint containers fresh blueberries",
        "1 12-ounce purchased pound cake, cut into 1-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dairy",
        "Dessert",
        "Fourth of July",
        "Mother's Day",
        "Backyard BBQ",
        "Cream Cheese",
        "Blueberry",
        "Lemon",
        "Summer",
        "Shower",
        "Chill",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Curd and Blueberry Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-curd-and-blueberry-trifle-108465"
}
