{
    "directions": [
        "Finely grind flour, nuts, salt and cinnamon in processor. Using electric mixer beat butter and 1/2 cup sugar in large bowl until smooth. Beat in lemon peel and vanilla. Add dry ingredients to butter mixture and mix just until dough holds together. Gather dough into ball; flatten into disk. Wrap in plastic and chill until firm, about 1 hour.",
        "Position rack in center of oven and preheat to 325°F. Butter large baking sheet. Roll out dough on lightly floured surface to 1/4-inch thickness. Using 3-inch round cookie cutter, cut out cookies. Gather scraps into ball. Reroll dough to 1/4-inch thickness. Cut out additional cookies, forming total of 12. Transfer rounds to prepared sheet. Using 1-inch round cookie cutter, cut out center of 6 cookies and remove. (Can be baked for snacks.)",
        "Bake cookies until golden, about 20 minutes. Transfer sheet to rack and cool 5 minutes. Transfer cookies to rack and cool completely.",
        "Spread 1 1/2 teaspoons marmalade evenly over each cookie without a hole, leaving 1/8-inch border uncovered. Sift additional powdered sugar over cookies with holes; arrange powdered sugar side up atop jam-covered cookies. (Can be prepared up to 2 days ahead. Store cookie sandwiches in single layer in airtight container at room temperature.)"
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/2 cup toasted hazelnuts (about 2 ounces)",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup powdered sugar",
        "2 teaspoons grated lemon peel",
        "1 teaspoon vanilla extract",
        "3 tablespoons lemon marmalade",
        "Additional powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Citrus",
        "Nut",
        "Dessert",
        "Bake",
        "Lemon",
        "Hazelnut"
    ],
    "title": "Lemon Hazelnut Cookie Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-hazelnut-cookie-sandwiches-450"
}
