{
    "directions": [
        "In a small bowl, lightly beat the egg and yolks together. Have ready a fine mesh sieve suspended over a large heatproof bowl.",
        "In a medium saucepan over medium heat, combine the milk, sugar, and salt, and stir until the sugar has dissolved. Continue to cook, stirring occasionally, until the mixture is hot to the touch (it should register about 140° F on an instant-read thermometer).",
        "Whisking the eggs constantly, slowly whisk in about 1/4 cup of the hot milk. Slowly pour the egg mixture back into the saucepan, whisking the contents of the saucepan constantly.",
        "Continue to cook the custard over medium heat, stirring constantly, until it is thick enough to coat the back of a spoon (it should register 170° F on an instant-read thermometer), 3 to 4 minutes. Immediately strain the custard into the large bowl. Let cool for five minutes.",
        "When custard is cool, whisk in the chilled cream. Cover mixture and refrigerate until chilled, at least 4 hours or overnight.",
        "Whisk in the lemon juice and zest, if using (if you are using the candied lemon peels, they will be added later), and churn in an ice cream maker according to the manufacturer's directions. If using the candied lemon peels, add them during the last minute of churning. If making the ice cream cake , immediately pack into the pan. Or store, tightly covered, in the freezer."
    ],
    "ingredients": [
        "1 large egg, preferably farm-fresh",
        "2 large egg yolks, preferably farm-fresh",
        "2 cups whole milk, preferably hormone-free",
        "3/4 cup sugar",
        "1/2 teaspoon salt",
        "1 cup chilled heavy cream, preferably not ultrapasteurized",
        "1/4 cup freshly squeezed lemon juice (from about 2 lemons)",
        "1 recipe (2 tablespoons) chopped Candied Lemon Peels (or 1 tablespoon finely grated lemon zest, preferably organic)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Citrus",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Fourth of July",
        "Frozen Dessert",
        "Lemon",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Ice Cream with Candied Lemon Peel",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ice-cream-with-candied-lemon-peel-232351"
}
