{
    "directions": [
        "Preheat oven to 325 degrees F.",
        "Grease the bottom of a 9 by 9-inch baking pan with butter. Then place parchment paper over the top, pressing down at the corners. In a food processor, process the sugar, cinnamon and graham crackers until you have the texture of bread crumbs. Add the melted butter and pulse a couple of times to fully incorporate. Pour into the lined baking pan and gently pat down with the base of a glass. Bake in the oven for 12 minutes until golden. When done set aside to cool.",
        "Add cream cheese, eggs, lemon zest, lemon juice and sugar to the food processor and mix until well combined. It should have a smooth consistency. Pour onto the cooled base and then cover with blueberries. They will sink slightly but should still be half exposed -- as the cake bakes they will sink a little more and break down.",
        "Bake in the oven for 35 minutes or until the center only slightly jiggles. Remove from the oven and cool completely before refrigerating for at least 3 hours. Once set, remove from pan using the parchment lining and slice into 10 rectangular bars. Dust with powdered sugar."
    ],
    "ingredients": [
        "Butter, for greasing",
        "2 tablespoons sugar",
        "1/8 teaspoon ground cinnamon",
        "9 graham crackers",
        "1/2 stick unsalted butter, melted",
        "16 ounces cream cheese, room temperature",
        "2 eggs",
        "2 lemons, zested and juiced",
        "About 1/2 cup sugar, eyeball it",
        "1 1/2 cups fresh blueberries",
        "Powdered sugar, for dusting"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Blueberry",
        "Fruit",
        "Cheese",
        "Cream Cheese Recipes",
        "Lemon Recipes",
        "Dessert",
        "Summer"
    ],
    "title": "Lemon Blueberry Cheesecake Bars",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/lemon-blueberry-cheesecake-bars-recipe"
}
