{
    "directions": [
        "Heat 2 tablespoons olive oil in heavy large skillet over medium-high heat. Add 2 tablespoons chopped shallots and 2 cups rhubarb; sauté until soft, about 5 minutes. Stir in lemon juice and 1 teaspoon lemon peel. Season with salt and pepper. Cool rhubarb stuffing.",
        "Melt butter in heavy large saucepan over low heat. Add 21/2 cups rhubarb, 1/4 cup shallots, and ginger; sauté until soft, about 10 minutes. Increase heat to high. Add sugar and brandy; boil 1 minute. Add broth, star anise, and bay leaf. Simmer over low heat until mixture is reduced to 2 cups, about 1 hour. Strain sauce, discarding solids in strainer. Stir 1/3 cup rhubarb stuffing into sauce. DO AHEAD Stuffing and sauce can be made 2 days ahead. Cover each separately and chill. Rewarm sauce before using.",
        "Preheat oven to 425°F. Using fingertips, separate skin from flesh of chicken breasts, forming pocket. Place about 2 tablespoons rhubarb stuffing in pocket. Sprinkle chicken with salt and pepper. Heat 3 tablespoons oil in large skillet over medium-high heat. Working in 2 batches, add chicken breasts, skin side down, to skillet; cook until brown, about 7 minutes. Transfer chicken, skin side down, to roasting pan.",
        "Roast chicken 10 minutes; baste with pan juices. Roast until cooked through, about 10 minutes longer. Transfer chicken to platter, sprinkle with 1 teaspoon lemon peel, and serve, passing sauce alongside."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "2 tablespoons plus 1/4 cup chopped shallots",
        "4 1/2 cups diced rhubarb, divided",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons finely grated lemon peel, divided",
        "1/4 cup (1/2 stick) butter",
        "1/2 cup sliced unpeeled fresh ginger",
        "3/4 cup sugar",
        "6 tablespoons brandy",
        "4 cups low-salt chicken broth",
        "1 whole star anise",
        "1 bay leaf",
        "6 boneless chicken breast halves with skin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Roast",
        "Sauté",
        "Lemon",
        "Brandy",
        "Spring",
        "Summer",
        "Rhubarb",
        "Shallot",
        "Simmer"
    ],
    "title": "Lemon-Rhubarb Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-rhubarb-chicken-237100"
}
