{
    "directions": [
        "Preheat oven to 350°F. Blend graham cracker crumbs and sugar in processor. With machine running, add melted butter and lemon juice; blend until crumbs are evenly moistened. Press crumb mixture onto bottom and 2 inches up sides of 10-inch-diameter springform pan with 2 3/4-inch-high sides. Freeze crust 15 minutes. Bake crust until set, about 10 minutes. Cool completely. Maintain oven temperature.",
        "Using electric mixer, beat first 3 ingredients in large bowl until fluffy and smooth, stopping occasionally to scrape down sides of bowl. Add sour cream, whipping cream, lemon juice, and vanilla and beat just to blend, stopping occasionally to scrape down sides of bowl. Add eggs 1 at a time, beating just to blend after each addition.",
        "Pour filling into crust (filling will just fill crust). Place springform pan on rimmed baking sheet. Bake cheesecake until top appears set, puffed, and golden at edges but still moves slightly all over when shaken, about 55 minutes. Cool cake 5 minutes.",
        "Mix sour cream, sugar, and vanilla in medium bowl.",
        "Spoon topping over hot cake, spreading to edge of pan and covering completely. Bake 10 minutes. Transfer cake to rack; cool 10 minutes. Run sharp knife around top 1/2-inch edge of cake to loosen. Place hot cheesecake directly in refrigerator; chill uncovered overnight.",
        "Stir Port, sugar, and vinegar in heavy large saucepan over medium-high heat until sugar dissolves. Boil until liquid is reduced to 3/4 cup, stirring occasionally, about 25 minutes. Cool. Mix in lemon peel. (Cake and syrup can be prepared 2 days ahead. Cover cake and keep refrigerated. Cover syrup and let stand at room temperature.)",
        "Starting below stem end of each berry half, make 3 lengthwise slits through tip. Fan berries and place around edge of cake. (Can be made 8 hours ahead. Cover; chill.)",
        "Release pan sides. Slice cake and drizzle with Port syrup. Serve syrup alongside."
    ],
    "ingredients": [
        "2 cups graham cracker crumbs",
        "1/4 cup (packed) dark brown sugar",
        "5 tablespoons unsalted butter, melted",
        "2 teaspoons fresh lemon juice",
        "4 8-ounce packages cream cheese, room temperature",
        "1 3/4 cups sugar",
        "3 tablespoons grated lemon peel",
        "1 cup sour cream",
        "1/4 cup whipping cream",
        "1/3 cup fresh lemon juice",
        "2 teaspoons vanilla extract",
        "4 large eggs, room temperature",
        "1 1/2 cups sour cream",
        "1/4 cup sugar",
        "1 teaspoon vanilla extract",
        "1 750-ml bottle tawny Port",
        "1/2 cup sugar",
        "3 tablespoons raspberry vinegar",
        "1 1/2 teaspoons grated lemon peel",
        "8 large strawberries, unhulled, halved through stem"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Strawberry",
        "Lemon",
        "Port",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Cheesecake with Strawberries and Port Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cheesecake-with-strawberries-and-port-glaze-108971"
}
