{
    "directions": [
        "Soften 1 tablespoon of butter, and use it to grease the entire inside of the slow cooker crock. Place the lemon peel and peppercorns in a cheesecloth bag and tie with kitchen string. Add this bag plus the remaining butter (cut into eight pieces) and other filling ingredients to the slow cooker, and gently mix with a wooden spoon. Cover and cook on low until the fruit is softened, about 4 hours (there will still be some liquid).",
        "About 45 minutes before the fruit is finished, heat the oven to 400°F, and line a baking or cookie sheet with parchment paper. Whisk together the dry drop biscuit ingredients (with the exception of 1 teaspoon of the sugar) and the lemon zest in a medium-size bowl. Gently stir in 1 cup plus 1 tablespoon of the heavy cream. Use your hands to form a soft, relatively smooth dough, taking care not to overmix. Divide the dough into six balls and place on the lined baking sheet. Flatten each one to the thickness of about 1/2 inch. Then pour the remaining tablespoon of cream into a small bowl and put the remaining 1 teaspoon of sugar into another small bowl. Using a pastry brush, brush each biscuit with the cream, then sprinkle with the sugar. Bake until slightly golden and cooked through (when tested with a fork, it should come out clean), 20 to 25 minutes. Set the biscuits aside.",
        "Once the fruit is cooked through, carefully remove the sachet. Place a large strainer over a medium to large, heavy saucepan, then—using oven mitts—pour the fruit mixture into the strainer. Set the fruit (in the strainer) aside. Boil the liquid over high heat until reduced to 3 to 31/2 cups, about 20 minutes. Add the fruit to the pot with the thickened liquid, and mix.",
        "Use a ladle to divide the fruit mixture among six bowls; top each portion with a biscuit and a scoop of vanilla ice cream, if desired."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter, divided",
        "Zest of two lemons in strips, white pith removed (about 2 tablespoons)",
        "8 black peppercorns",
        "11 cups hulled and halved (or quartered if very large) strawberries (about 4 pounds)",
        "3 cups 1/2-inch-wide pieces rhubarb, halved if really thick (6 to 7 stalks, trimmed and leaves removed)",
        "1/4 cup fresh-squeezed, strained lemon juice",
        "1/4 cup fresh-squeezed, strained orange juice",
        "2 1/2 cups granulated sugar",
        "1/4 cup tapioca starch",
        "1/2 teaspoon coarse salt",
        "2 cups all-purpose flour",
        "6 tablespoons plus 1 teaspoon granulated sugar, divided",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon coarse salt",
        "2 teaspoons freshly grated lemon zest (about 1 lemon)",
        "1 cup plus 2 tablespoons chilled heavy cream, divided",
        "Vanilla ice cream, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lemon",
        "Spring",
        "Rhubarb",
        "Lemon Juice",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemony Strawberry-Rhubarb Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/lemony-strawberry-rhubarb-cobbler-51152200"
}
