{
    "directions": [
        "Mix all ingredients in small bowl. Season sauce to taste with salt. (Can be made 1 day ahead. Cover and chill.)",
        "Mix first 6 ingredients and 2 tablespoons oil in 11x7-inch glass dish. Add pork chops to marinade, turn several times to coat evenly, then crowd together in single layer. Cover and refrigerate at least 30 minutes and up to 2 hours.",
        "Arrange cucumber, pineapple, bean sprouts, all herbs, and carrot around edge of large platter. (Can be prepared 2 hours ahead. Cover; chill.)",
        "Cook noodles in large pot of boiling salted water until just tender and turning white, separating often with tongs, about 4 minutes. Drain. Arrange in center of platter. Mound lettuce leaves in large shallow bowl.",
        "Prepare barbecue (medium-high heat). Brush grill rack with remaining 1 tablespoon oil. Grill pork with marinade still clinging to meat until slightly charred and cooked through, 4 to 5 minutes per side, depending on thickness. Transfer pork to cutting board. Let rest 10 minutes.",
        "Cut pork crosswise into 1/3-inch-wide strips. Place pork and any juices from board atop noodles. To serve, fill lettuce leaves with pork, noodles, herbs, and vegetables. Serve with sauce for dipping."
    ],
    "ingredients": [
        "3/4 cup hot water",
        "5 tablespoons fish sauce*",
        "3 1/2 tablespoons sugar",
        "1 1/2 tablespoons fresh lime juice",
        "2 Thai bird chiles with seeds or 1/2 jalapeño chile with seeds, minced",
        "1 garlic clove, minced",
        "6 green onions (white and pale green parts only), chopped (about 1/2 cup)",
        "3 tablespoons chopped lemongrass*",
        "2 tablespoons soy sauce",
        "1 tablespoon golden brown sugar",
        "2 teaspoons fish sauce",
        "1/4 teaspoon ground white pepper",
        "3 tablespoons vegetable oil, divided",
        "1 1/2 to 1 3/4 pounds boneless pork loin chops (each 1/3 to 1/2 ich thick)",
        "1 small English hothouse cucumber, halved lengthwise, thinly sliced crosswise",
        "1 baby pineapple, peeled, halved, thinly sliced or 1/2 small pineapple, peeled, cut into 2 wedges, cored, thinly sliced",
        "2 cups bean sprouts",
        "1 cup fresh Thai basil leaves",
        "1 cup fresh cilantro leaves",
        "1 cup fresh mint leaves",
        "20 fresh green shiso leaves",
        "1/2 cup finely shredded carrot",
        "1 8- to 9-ounce package dried rice vermicelli noodles",
        "3 heads of butter lettuce, cored, leaves separated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Pork",
        "Vegetable",
        "Marinate",
        "Lunch",
        "Meat",
        "Pork Chop",
        "Summer",
        "Noodle",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Lemongrass Pork with Vietnamese Table Salad",
    "url": "http://www.epicurious.com/recipes/food/views/lemongrass-pork-with-vietnamese-table-salad-232268"
}
