{
    "directions": [
        "Preheat oven to 350 degrees F. Line muffin pans with 24 Reynolds(R) StayBrite(R) Baking Cups.",
        "Combine flour, sugar, cinnamon, baking powder, baking soda, nutmeg, and salt in a large bowl.",
        "Combine the carrots, oil, applesauce, egg, and vanilla in a medium bowl. Add carrot mixture to the flour mixture; mix just until combined. Divide the batter among the prepared muffin cups.",
        "Bake 16 to 18 minutes or until a toothpick inserted in centers comes out clean. Cool 5 minutes in muffin pan. Transfer cupcakes to cooling rack; cool completely.",
        "Top with Lemon Cream Cheese Frosting, reserving a small amount. Make \"nests\" with the coconut. Dip jelly beans or candy eggs slightly into extra frosting and then place in the \"nests\" to keep them in place.",
        "Lemon Cream Cheese Frosting: Combine cream cheese, butter, softened; and lemon curd in a large mixing bowl. Beat with an electric mixer on medium to high speed until smooth. Gradually add 1 1/2 cups of powdered sugar, beating well. Beat in 2 teaspoons milk. Gradually beat in another 1 1/2 cups powdered sugar. If necessary, beat in additional milk, 1 teaspoon at a time, to reach spreading consistency."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/1298752.jpg",
    "ingredients": [
        "Reynolds® StayBrite® Baking Cups",
        "2 cups all-purpose flour",
        "1 cup granulated sugar",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon salt",
        "2 cups shredded carrots",
        "1/2 cup canola oil",
        "1/2 cup unsweetened applesauce",
        "1 egg, lightly beaten",
        "1 teaspoon vanilla",
        "1 cup flaked coconut, toasted",
        "1 cup mini jelly beans or chocolate egg candies",
        "Lemon Cream Cheese Frosting:",
        "3 ounces cream cheese, softened",
        "3 tablespoons butter, softened",
        "2 tablespoons lemon curd",
        "3 cups powdered sugar, divided",
        "2 teaspoons milk, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Frosted Carrot Cake Cupcakes",
    "url": "http://allrecipes.com/recipe/238756/lemon-frosted-carrot-cake-cupcakes/"
}