{
    "directions": [
        "First, make the dressing. In a blender, purée the tomatoes, nuts, garlic, lemon juice, olive oil, and salt for 45 seconds, until the mixture is thick and creamy. Transfer the contents to a small bowl and stir in the minced pickles. Set it aside. (Any extra dressing can be stored in the fridge for up to three days.)",
        "To prepare to garnish, heat the coconut oil in a skillet set over medium-high heat. Sauté the onions until they are slightly caramelized, then set them aside.",
        "For the burgers, in a food processor purée the chicken, onion, and garlic until everything is well combined. Transfer it to a large bowl and add the parsley, thyme, lemon zest, lemon juice, and salt. Blend the mixture well with your hands, then form it into four equal-size burgers.",
        "In a large skillet set over medium-high heat, melt the coconut oil, then add the burgers. Allow them to brown on one side for several minutes before flipping them and browning the other side. If you are not serving these right away, you can transfer them to a heated oven at this point to keep them warm.",
        "When the burgers are ready, serve them on buns topped with the fresh greens and sautéed red onion, and with a side of Thousand Island Dressing."
    ],
    "ingredients": [
        "1 pound pasture-raised, skinless, boneless chicken breast, cut into large chunks (or you can use ground pasture-raised chicken or turkey)",
        "1 medium onion, diced",
        "1 garlic clove, minced",
        "1/4 cup chopped fresh parsley",
        "2 teaspoons chopped fresh thyme",
        "Zest and juice of 1 lemon",
        "Sea salt to taste",
        "2 tablespoons coconut oil",
        "4 gluten-free buns, such as Sami's Bakery buns",
        "1 handful mâche lettuce, baby spinach, or arugula",
        "1 1/2 cups (about 4) quartered plum tomatoes",
        "1/2 cup raw macadamia nuts or cashews",
        "2 garlic cloves",
        "1/8 cup lemon juice",
        "1/8 cup extra-virgin olive oil",
        "1 teaspoon sea salt",
        "2 dill pickles, minced",
        "2 tablespoons coconut oil",
        "1 large red onion, sliced into thin rounds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Cashew",
        "Spring",
        "Summer",
        "Pan-Fry",
        "Sandwich Theory"
    ],
    "title": "Lemon Herb Chicken Burgers with Thousand Island Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-herb-chicken-burgers-with-thousand-island-dressing-56389605"
}
