{
    "directions": [
        "Stir sugar and 1/4 cup water in heavy small saucepan over medium heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 10 minutes. Quickly pour caramel into eight 3/4-cup ramekins or custard cups. Using oven mitts as aid, immediately tilt each ramekin to coat bottom. Transfer ramekins to 13x9x2-inch baking pan. Set aside.",
        "Combine whole milk, aniseed, cinnamon stick and lemon peel in medium saucepan. Bring to simmer. Remove from heat. Cover and let stand 45 minutes.",
        "Position rack in center of oven and preheat to 350°F. Pour milk mixture into large bowl. Add remaining ingredients and whisk to blend. Strain egg mixture into another large bowl. Pour custard into prepared ramekins, dividing equally. Pour enough hot water into baking pan to come halfway up sides of ramekins.",
        "Bake flans until center is gently set, about 35 minutes. Transfer flans to rack and cool. Cover and chill overnight. (Can be made 2 days ahead. Keep chilled.)",
        "Run knife around 1 flan to loosen. Turn over onto plate. Shake gently. Lift off ramekin, allowing syrup to run over flan. Repeat with remaining flans."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1/4 cup water",
        "1 1/4 cups whole milk",
        "1 1/2 teaspoons aniseed",
        "1 cinnamon stick",
        "3/4 teaspoon grated lemon peel",
        "1 14-ounce can sweetened condensed milk",
        "4 large eggs",
        "2 teaspoons vanilla extract",
        "1/8 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Vanilla",
        "Anise",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Anise Flan",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-anise-flan-104607"
}
