{
    "directions": [
        "Transfer ice cream to a microwave-safe bowl and microwave at 30 percent power in 10-second intervals, stirring, until softened, about 50 seconds total (see cooks' note, below).",
        "Stir in lemon zest and juice. Spread ice cream thinly in a 13-by 9-inch baking dish and freeze while making compote and sandwich layers.",
        "Cook blueberries, sugar, and zest in a 12-inch heavy skillet over medium-high heat, thoroughly crushing blueberries with a potato masher, until juices are released and sugar has dissolved, about 2 minutes.",
        "Stir together lemon juice and cornstarch, then stir into blueberry mixture. Boil, stirring, 1 minute (mixture will thicken).",
        "Transfer blueberry compote to a bowl and chill until cold, about 1 hour. Discard lemon zest.",
        "Preheat oven to 375°F with rack in middle. Butter baking pans and line with foil, leaving a 1-inch overhang on each side, then butter foil.",
        "Whisk together flour, baking powder, baking soda, and salt in a small bowl. Beat together butter and brown sugar in another bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes. Beat in egg and vanilla. At low speed, add flour mixture in 2 batches, mixing until just combined.",
        "Divide batter between baking pans and spread into thin, even layers with offset spatula. Bake until golden-brown but still tender, 10 to 12 minutes. Cool completely in pans, about 30 minutes.",
        "Dollop tablespoons of blueberry compote all over ice cream, then swirl it gently through ice cream with a spoon. Spoon all of ice cream over 1 sandwich layer (in pan) and spread evenly using clean offset spatula. Invert second sandwich layer over ice cream, pressing gently to form an even sandwich. Wrap baking pan in plastic wrap and freeze until firm, at least 2 hours.",
        "Transfer sandwich to a cutting board using overhang. Trim edges if desired, then cut into 8 pieces."
    ],
    "ingredients": [
        "2 pint premium vanilla ice cream",
        "1 tablespoon grated lemon zest",
        "2 tablespoons fresh lemon juice",
        "2 cups blueberries (10 ounces)",
        "1/4 cup sugar",
        "2 (3-by 2 1/2-inch) strips lemon zest",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons cornstarch",
        "1 cup all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 stick unsalted butter, softened",
        "3/4 cup packed light brown sugar",
        "1 large egg",
        "1/2 teaspoon pure vanilla extract",
        "Equipment: 2 (8-inch) square baking pans (2 inches deep); a small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Bake",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Summer",
        "Lemon Juice",
        "Gourmet"
    ],
    "title": "Lemon Ice Cream Sandwiches with Blueberry Swirl",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ice-cream-sandwiches-with-blueberry-swirl-354515"
}
