{
    "directions": [
        "Whisk egg yolks, sugar, lemon juice, lemon peel, and salt in medium metal bowl to blend. Set bowl over saucepan of simmering water. Whisk until mixture is very thick and thermometer inserted into center registers 160°F to 170°F, about 6 minutes. Remove bowl from over water. Cool lemon mousse base to room temperature.",
        "Combine 1/4 cup cream and white chocolate in another medium metal bowl. Set bowl over saucepan of barely simmering water. Stir constantly until chocolate is soft and almost melted. Remove bowl from over water and stir until white chocolate is melted and smooth. Cool white chocolate mousse base to room temperature.",
        "Beat remaining 2 2/3 cups cream in large bowl until firm peaks form. Divide whipped cream between both mousse bases, folding in 1 cup at a time (about 3 cups for each).",
        "Layer scant 1/4 cup lemon mousse in each of 8 parfait glasses or wineglasses; top with 2 tablespoons strawberries. Layer scant 1/4 cup white chocolate mousse over strawberries. Repeat layering 1 more time. DO AHEAD: Can be made 1 day ahead. Cover with plastic wrap and chill. Cover and chill remaining strawberries.",
        "Spoon strawberries over top of each parfait, if desired, and serve."
    ],
    "ingredients": [
        "5 large egg yolks",
        "1/2 cup sugar",
        "1/2 cup fresh lemon juice",
        "4 teaspoons finely grated lemon peel",
        "Pinch of salt",
        "1/4 cup plus 2 2/3 cups chilled heavy whipping cream",
        "1 3.5-ounce bar high-quality white chocolate (such as Lindt or Perugina), finely chopped",
        "5 cups sliced hulled strawberries (about 2 pounds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Easter",
        "Valentine's Day",
        "Strawberry",
        "Lemon",
        "Candy Thermometer",
        "Lemon Juice",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon and White Chocolate Mousse Parfaits With Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-white-chocolate-mousse-parfaits-with-strawberries-352046"
}
