{
    "directions": [
        "Preheat the oven to 350 degrees F. Place 12 standard-size silicone muffin cups on a baking sheet or line a standard 12-cup muffin tin with paper liners.",
        "With a stand mixer fitted with the paddle attachment, beat the flour(s), sugars, butter, vanilla, and lemon together on medium-low speed until a cohesive dough forms.",
        "Roll the dough into 1-inch balls and place in the muffin cups. With the back of a spoon, press the balls into the bottom of each cup to form a disk.",
        "Bake for 10-12 minutes, just until the crust is matte (no longer shiny and raw-looking) on top--it will still be puffy and soft. Remove from the oven and cool while you make the filling.",
        "With an electric hand mixer or stand mixer fitted with the paddle attachment, beat the cream cheese, goat cheese, sugar, flour, egg, applesauce, and lemon zest and juice together on medium-low speed.",
        "Spoon the filling on top of the crust in each cup, dividing it evenly and filling each cup to the brim.",
        "Bake for about 30 minutes, or until the filling is set and slightly browned. Transfer to a wire cooling rack and cool completely before serving."
    ],
    "ingredients": [
        "Cookie Crust:",
        "1 cup all-purpose flour",
        "1/4 cup powdered sugar",
        "1/4 cup granulated sugar",
        "8 tablespoons unsalted butter, at room temperature",
        "1 teaspoon vanilla extract",
        "1 lemon, zested",
        "Filling:",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1 (4 ounce) log goat cheese, at room temperature",
        "1/2 cup powdered sugar",
        "1 tablespoon all-purpose flour",
        "1 large egg",
        "1/2 cup Mott's® Natural Applesauce",
        "1 lemon, zested",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Goat Cheese Cheesecake Bites (Gluten Free Optional)",
    "url": "http://allrecipes.com/recipe/241274/lemon-goat-cheese-cheesecake-bites-g/"
}
