{
    "directions": [
        "Roll out the dough 1/8 inch thick on a lightly floured surface and fit it into a 9-inch (1 quart) glass pie plate. Crimp the edge decoratively and chill the shell for 30 minutes.",
        "Preheat the oven to 350°F. In a bowl whisk together the butter, the sugar, the buttermilk, the egg yolks, the flour, the vanilla, the zest, the salt, and the nutmeg and pour the filling into the shell. Bake the pie in the lower third of the oven for 20 minutes, reduce the temperature to 325°F., and bake the pie for 20 to 25 minutes more, or until the filling is set and golden. Let the pie cool on a rack and serve it at room temperature or chilled.",
        "In a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add the 2 tablespoons ice water, toss the mixture until the water is incorporated, adding the additional ice water if necessary to form a dough, and form the dough into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour."
    ],
    "ingredients": [
        "Pâte Brisée (recipe below)",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "1 cup sugar",
        "1 1/2 cups buttermilk",
        "4 large eggs yolks",
        "4 tablespoons all-purpose flour",
        "1 teaspoon vanilla",
        "1 1/2 teaspoons freshly grated lemon zest",
        "1/4 teaspoon salt",
        "freshly grated nutmeg to taste",
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt",
        "2 tablespoons ice water plus additional if necessary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Picnic",
        "Lemon",
        "Spring",
        "Chill",
        "Gourmet"
    ],
    "title": "Lemon Buttermilk Pie",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-buttermilk-pie-11728"
}
