{
    "directions": [
        "Place bread on baking sheet. Spread tomato paste over. Top each with 1 tomato slice. Sprinkle cheese atop.",
        "Pound each chicken breast between sheets of plastic to 1/4-inch-thickness. Sprinkle chicken with salt and pepper. Place flour in bowl. Heat 1 teaspoon oil in large nonstick skillet over high heat. Lightly coat 2 chicken with flour; shake off excess. Transfer to skillet and cook until brown and cooked through, about 2 minutes per side. Transfer chicken to plate and tent with foil. Repeat with 1 teaspoon oil, flour and remaining chicken.",
        "Heat 1/2 teaspoon oil in same skillet over low heat. Add green onions and garlic; sauté until tender, about 2 minutes. Stir in broth and wine scraping up any browned bits in skillet. Add lemon juice and 2 tablespoons parsley. Increase heat to high; boil until liquid is slightly reduced, about 3 minutes. Mix in lemon peel. Season with salt and pepper. Return chicken to skillet; simmer until heated through, turning to coat.",
        "Meanwhile, preheat broiler. Broil crostini until cheese melts, watching closely, about 1 minute.",
        "Transfer chicken to plates. Spoon pan juices over chicken. Sprinkle with remaining parsley. Serve with crostini."
    ],
    "ingredients": [
        "12 1/4-inch-thick French bread baguette slices, toasted",
        "1/4 cup tomato paste",
        "12 thin slices plum tomato",
        "2 tablespoons grated Parmesan cheese",
        "4 4-ounce skinless boneless chicken breasts",
        "3 tablespoons all purpose flour",
        "2 1/2 teaspoons olive oil",
        "1/4 cup finely chopped green onions (white and pale green parts only)",
        "2 small garlic cloves, minced",
        "1/2 cup canned low-salt chicken broth",
        "1/4 cup dry white wine",
        "1 tablespoon fresh lemon juice",
        "4 tablespoons chopped fresh parsley",
        "1 teaspoon grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Onion",
        "Tomato",
        "Sauté",
        "Low Fat",
        "Parmesan",
        "Lemon",
        "White Wine"
    ],
    "title": "Lemon Chicken with Parmesan Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-chicken-with-parmesan-crostini-5832"
}
