{
    "directions": [
        "Puree berries in processor. Strain into heavy medium saucepan. Add sugar and cornstarch. Stir over medium heat until mixture boils and thickens, about 3 minutes. Cool. Cover; chill until cold, about 2 hours.",
        "Preheat oven to 350°F. Lightly butter 9-inch-diameter cake pan with 2-inch-high sides. Line bottom with parchment paper. Butter parchment. Dust pan with flour; shake out excess. Using electric mixer, beat butter in large bowl until fluffy. Add eggs 1 at a time, beating well after each addition. Sift flour, baking powder and salt into medium bowl. Stir in cornmeal. Add to butter mixture and beat just until blended. Mix in lemon peel and extract.",
        "Transfer batter to prepared pan. Bake until cake is golden and toothpick inserted into center comes out with a few moist crumbs attached, about 35 minutes. Transfer cake to rack, cool. Using knife, cut around pan sides to loosen cake. Turn cake out. Peel off parchment.",
        "Beat cream, sugar and extract in large bowl until soft peaks form. Beat in 1 1/2 teaspoons lemon peel. Set aside 2/3 cup frosting for decoration.",
        "Using serrated knife, cut cake horizontally into 3 layers. Using bottom of 9-inch-diameter tart pan as aid, transfer 1 layer to platter. Spread half of filling over. Spread 1 cup frosting over filling. Top with second cake layer. Spread remaining filling over. Spread 1 cup frosting over filling. Top with third cake layer. Spread sides and top of cake with remaining frosting. Press nuts onto sides of cake. Spoon reserved 2/3 cup frosting into pastry bag fitted with medium star tip. Pipe around top edge of cake. Sprinkle top of cake with 1 1/2 teaspoons lemon peel. (Can be made 4 hours ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2 cups frozen unsweetened raspberries, thawed",
        "2 tablespoons sugar",
        "1 tablespoon cornstarch",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3/4 cup sugar",
        "3 large eggs",
        "1 1/4 cups cake flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup yellow cornmeal",
        "6 teaspoons grated lemon peel",
        "2 teaspoons lemon extract",
        "2 cups chilled whipping cream",
        "2 tablespoons sugar",
        "1 teaspoon lemon extract",
        "3 teaspoons grated lemon peel",
        "3/4 cup sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Raspberry",
        "Lemon",
        "Almond",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Cornmeal Cake with Raspberry Filling",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cornmeal-cake-with-raspberry-filling-1214"
}
