{
    "directions": [
        "Preheat the oven to 350 degree F. Line 2 baking sheets with parchment paper or silicone liners.",
        "Place the flour, granulated sugar, baking powder and salt into a sifter or fine-mesh strainer, then sift the mixture into a large bowl until it's all combined. Throw the butter pieces into the bowl and use a pastry cutter to cut the butter into the dry ingredients.",
        "Measure the cream in a spouted measuring cup and crack in an egg. Zest one of the lemons and add the zest to the cream. Add half of the rosemary to the mixture. Whisk together, then drizzle it into the flour-butter mixture, stirring gently with a fork until combined and a dough forms.",
        "Turn the dough onto a floured surface and lightly press it together until it forms a rough rectangle. Use a rolling pin to roll into a rectangle about 1/2 inch to 3/4 inch thick. Use your hands to help with the forming if necessary. The final rectangle should be about 18 inches by about 10 inches.",
        "Use a knife to trim the dough into a symmetrical rectangle, then cut the rectangle into 12 symmetrical square/rectangular pieces. Next, cut each piece in half diagonally to form smaller triangles. Transfer the triangles to the prepared baking sheets. Bake until just barely golden brown, about 18 minutes, then allow to cool completely.",
        "While the scones are cooling, make the glaze: Combine the powdered sugar and milk in a large bowl. Add the juice of the lemon you zested and whisk the mixture together. Zest the second lemon and add the zest to the bowl. Add the rest of the rosemary and whisk it until it's all combined. Add a little extra milk if it needs thinning.",
        "Position a cooling rack over a baking sheet. When the scones are completely cooled, drop them one by one into the glaze. Flip them over to coat. Transfer them to the cooling rack to allow the excess glaze to drip off. Allow the glaze to set completely before serving.",
        "The scones will last for several days in an airtight container."
    ],
    "ingredients": [
        "3 cups all-purpose flour, plus more for flouring",
        "2/3 cup granulated sugar",
        "1 tablespoon plus 1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 cup (2 sticks) cold unsalted butter, cut into pieces",
        "1 cup heavy cream",
        "1 egg",
        "2 lemons",
        "Leaves from 2 rosemary sprigs (or 4 if they're small sprigs), finely minced",
        "5 cups powdered sugar",
        "1/2 cup whole milk, plus more if needed for thinning"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Scone Recipes",
        "Fruit",
        "Lemon Recipes",
        "Brunch"
    ],
    "title": "Lemon-Rosemary Scones",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/lemon-rosemary-scones"
}
