{
    "directions": [
        "Line small baking sheet with foil. Using vegetable peeler, remove peel from lemons in long strips (yellow part only). Place in small saucepan. Add enough cold water to cover generously; bring to boil. Drain. Repeat blanching 2 more times. Cut lemon peel into 1/8-inch-wide strips. Bring 2 cups sugar and 2 cups water to boil in medium saucepan, stirring until sugar dissolves. Boil gently 5 minutes. Add lemon peel; simmer until peel is translucent, about 15 minutes. Using slotted spoon, transfer peel to prepared sheet; sprinkle 1 cup sugar over and toss to coat. Let dry at room temperature 2 hours. Transfer lemon peel mixture to airtight container. Pour syrup into bowl. (Candied lemon peel and syrup can be made 3 days ahead. Store peel at room temperature. Cover and chill syrup.)",
        "Whisk egg yolks, whole eggs, sugar, lemon juice, and salt to blend in top of double boiler over barely simmering water (do not allow bowl to touch water); whisk constantly until mixture thickens and instant-read thermometer registers 160°F, about 6 minutes. Transfer to glass bowl; place plastic wrap directly on surface; refrigerate overnight.",
        "Finely chop enough candied lemon peel to measure 1/4 cup; place in small bowl. Mix in 1/2 cup lemon curd; cover and chill. Beat whipping cream in large bowl until peaks form. Fold 1 cup whipped cream into remaining lemon curd; cover and chill. Cover remaining whipped cream; chill.",
        "Line six 3/4-cup soufflé dishes (3 inches in diameter with 1 1/2-inch-high sides) with plastic wrap, leaving 3-inch overhang. Cut ladyfingers into 2-inch lengths, reserving ends. Stand 7 ladyfinger pieces upright side by side, rounded side out, around inside rim of each dish. Place reserved end pieces of ladyfingers in bottom of each dish, covering completely. Brush ladyfingers lightly with lemon syrup. Spoon 1/4 cup lemon cream mixture into center of each dish. Gently spread generous 1 tablespoon lemon curd-peel mixture over top of each. Chill at least 2 hours. (Can be made 1 day ahead. Cover; keep chilled.)",
        "Using plastic wrap as aid, lift charlottes out of soufflé dishes. Carefully peel off plastic wrap. Place on plates. Spoon reserved whipped cream into pastry bag fitted with medium star tip. Pipe whipped cream rosette atop each charlotte. Sprinkle each with candied lemon peel."
    ],
    "ingredients": [
        "4 lemons",
        "3 cups sugar",
        "2 cups water",
        "4 large egg yolks",
        "2 large eggs",
        "3/4 cup sugar",
        "1/2 cup fresh lemon juice",
        "Pinch of salt",
        "1 1/4 cups chilled whipping cream",
        "42 purchased soft ladyfingers (from two 3-ounce packages)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Dessert",
        "Lemon",
        "Spring"
    ],
    "title": "Lemon Charlottes with Lemon Curd and Candied Lemon Peel",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-charlottes-with-lemon-curd-and-candied-lemon-peel-106432"
}
