{
    "directions": [
        "Whisk eggs and egg yolks in medium bowl. Melt butter in medium metal bowl set over large saucepan of simmering water. Whisk in sugar, lemon juice, lemon peel, and salt; gradually whisk in egg mixture. Whisk until thick and thermometer inserted into curd registers 178°F to 180°F, about 8 minutes. Transfer to small bowl. Press plastic wrap on top of curd; chill 4 hours. DO AHEAD Can be made 2 days ahead. Keep chilled.",
        "Preheat oven to 400°F. Mix pecans, sugar, and butter in medium bowl until moistened. Press pecan mixture onto bottom and up sides of 9-inch-diameter glass pie dish (mixture will be crumbly). Bake until crust is lightly toasted, about 12 minutes (crust will slip down sides of dish). Use back of spoon to press crust back into place. Cool crust on rack. Freeze crust 30 minutes.",
        "Dollop 1 1/2 cups ice cream over crust; spread into even layer. Spread lemon curd over ice cream; freeze until firm, about 2 hours. Dollop 1 1/2 cups softened ice cream over lemon curd; spread into even layer. Cover and freeze until firm, about 2 hours.",
        "Using electric mixer, beat egg whites in medium bowl until frothy. Beat in cream of tartar. With mixer running, gradually add sugar. Beat until stiff peaks form. Spoon meringue over pie, spreading to seal at edges and swirling decoratively. DO AHEAD Can be made 1 day ahead. Freeze pie. Using kitchen butane torch, toast meringue until golden in spots or place pie in a preheated 500°F oven until meringue is golden in spots, watching to prevent burning, about 3 minutes. Cut pie into wedges; serve immediately."
    ],
    "ingredients": [
        "2 large eggs",
        "2 large egg yolks",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1 cup sugar",
        "6 tablespoons fresh lemon juice",
        "2 teaspoons finely grated lemon peel",
        "Pinch of salt",
        "1 1/2 cups finely chopped pecans",
        "1/4 cup sugar",
        "1/4 cup (1/2 stick) butter, melted",
        "3 cups vanilla ice cream, slightly softened, divided",
        "4 large egg whites, room temperature",
        "Pinch of cream of tartar",
        "6 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Lemon",
        "Pecan",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Meringue Ice Cream Pie in Toasted Pecan Crust",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-meringue-ice-cream-pie-in-toasted-pecan-crust-237881"
}
