{
    "directions": [
        "Pulse almonds with 1/4 cup flour in a food processor until finely ground, being careful not to grind to a paste.",
        "Beat together butter and sugar with an electric mixer until pale and fluffy. Chill 1 tablespoon beaten egg for egg wash and beat remaining egg into butter mixture. Beat in vanilla and almond extracts. At low speed, mix in almond mixture, zest, salt, and remaining 1 3/4 cups flour until a dough just forms. Halve dough and form each half into a 5- to 6-inch disk. Wrap disks separately in plastic wrap and chill until firm, at least 30 minutes.",
        "Beat yolks with 3/4 cup sugar using cleaned beaters until very thick and tripled in volume, about 5 minutes. Transfer to a heavy medium saucepan and stir in zest, juice, butter, and salt. Cook over medium-low heat, whisking frequently, until curd is thick enough to hold marks of whisk and mixture begins to bubble, about 6 minutes. Transfer lemon curd to a bowl and chill, its surface covered with parchment paper, until cold, at least 1 hour.",
        "Preheat oven to 375°F with rack in middle. Generously butter springform pan.",
        "Roll out 1 piece of dough (keep other piece chilled) between 2 sheets of parchment into a 12-inch round (dough will be very tender). Remove top sheet of parchment and invert dough into springform pan. (Dough will tear easily; patch it with your fingers.) Press dough over bottom and 1 inch up side of pan, trimming excess.",
        "Chill shell and roll out remaining dough between sheets of parchment into a 12-inch round. Remove top sheet of parchment, then cut dough into 10 (1/3-inch-wide) strips with pastry wheel and slide, still on parchment, onto a baking sheet. Chill until firm, 30 to 45 minutes.",
        "Bake shell until bottom is pale golden and edge is golden, 15 to 20 minutes. Cool shell in pan on a rack, about 30 minutes.",
        "Spread filling in shell and arrange 5 strips 1 inch apart on filling. Arrange remaining 5 strips 1 inch apart diagonally across first strips to form a lattice with diamond-shaped spaces. Trim edges of all strips flush with edge of shell. Brush lattice top with egg wash and sprinkle crostata with remaining tablespoon sugar.",
        "Bake crostata until pastry is golden and filling is bubbling, 25 to 30 minutes. Cool completely in pan on a rack, about 2 hours (juices will thicken)."
    ],
    "ingredients": [
        "3/4 cup whole almonds with skins (1/4 pound), toasted and cooled",
        "2 cups all-purpose flour, divided",
        "10 tablespoons unsalted butter, softened",
        "1/2 cup sugar",
        "1 large egg, lightly beaten",
        "1/2 teaspoon pure vanilla extract",
        "3/4 teaspoon pure almond extract",
        "2 teaspoons grated lemon zest",
        "1/2 teaspoon salt",
        "5 large egg yolks",
        "3/4 cup plus 1 tablespoon sugar, divided",
        "1 tablespoon grated lemon zest",
        "1/2 cup fresh lemon juice",
        "6 tablespoons unsalted butter, cut into bits",
        "3/4 teaspoon salt",
        "Equipment: an 8-inch springform pan; a pastry/pizza wheel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Mother's Day",
        "Lemon",
        "Spring",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-crostata-242016"
}
