{
    "directions": [
        "Whisk sugar and cornstarch in heavy medium saucepan to blend. Gradually add lemon juice, whisking until cornstarch dissolves. Whisk in yolks. Add butter. Cook over medium heat until curd thickens and boils, whisking constantly, about 8 minutes. Transfer curd to medium bowl. Press plastic wrap directly onto surface of curd. Refrigerate at least 1 day. (Can be prepared 5 days ahead. Keep chilled.)",
        "Using electric mixer, beat whipping cream in medium bowl until peaks form. Fold 3/4 cup lemon curd into whipped cream 1/4 cup at a time. Chill lemon mousse at least 2 hours and up to 6 hours. Keep remaining curd chilled.",
        "Combine 3/4 cup blueberries, sugar, lemon juice, grated lemon peel, salt, and cinnamon in small saucepan. Stir over medium heat until sugar dissolves, about 4 minutes. Whisk in flour; cook 1 minute. Remove from heat. Stir in remaining 3/4 cup blueberries. Transfer compote to small bowl. Cover and refrigerate at least 2 hours. (Can be prepared 1 day ahead. Keep compote refrigerated.)",
        "Position rack in center of oven and preheat to 375°F. Roll out pie crust disk on lightly floured surface to 13 1/2-inch round. Transfer crust to 9-inch-diameter glass pie dish. Trim overhang to 1 inch. Fold edges under and crimp decoratively; chill 30 minutes. Line crust with foil; fill with dried beans or pie weights. Bake crust until sides are set, about 20 minutes. Remove foil and beans from crust. Bake crust until golden and cooked through, piercing with fork if crust bubbles, about 20 minutes longer. Transfer crust to rack and cool completely.",
        "Spread 1 1/2 cups of remaining lemon curd over bottom of crust. Using slotted spoon and leaving most of juices behind, spoon 3/4 cup blueberry compote evenly over curd. Drop lemon mousse in dollops over blueberries; spread to cover berries completely. Using slotted spoon, spoon remaining blueberries over mousse. Chill pie while preparing meringue.",
        "Whisk egg whites and sugar in large metal bowl to blend. Place bowl over saucepan of simmering water (do not let bottom of bowl touch water); whisk constantly until sugar dissolves and mixture is very warm to touch, about 1 1/2 minutes. Remove bowl from over water. Using electric mixer, beat mixture until thick and fluffy peaks form, about 5 minutes. Spoon meringue into pastry bag fitted with large (about 3/4-inch) plain tip. Pipe meringue decoratively over top of pie, leaving 1-inch plain border to expose some of mousse and blueberries. Using pastry torch, singe meringue until golden. (Can be prepared 6 hours ahead. Cover with cake dome and refrigerate.)"
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "2 1/4 teaspoons cornstarch",
        "3/4 cup fresh lemon juice",
        "9 large egg yolks",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup chilled heavy whipping cream",
        "1 1/2 cups fresh blueberries (from two 1/2-pint containers), divided",
        "3 tablespoons sugar",
        "1/2 teaspoon fresh lemon juice",
        "1/4 teaspoon finely grated lemon peel",
        "Pinch of salt",
        "Pinch of ground cinnamon",
        "1 teaspoon all purpose flour",
        "1 Tender Pie Crust dough disk",
        "3 large egg whites",
        "1/2 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Thanksgiving",
        "Blueberry",
        "Lemon",
        "Fall",
        "Summer",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Meringue Blueberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-meringue-blueberry-pie-232394"
}
