{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Place a baking rack into a large, shallow baking sheet with sides.",
        "Sprinkle each pork chop with onion powder, garlic powder, and lemon pepper seasoning. Place the cornflake crumbs into a shallow dish, and thoroughly dredge each pork chop in the crumbs, pressing the chops into the crumbs with a fork. Gently brush away any loose crumbs, and place the pork chops onto the baking rack.",
        "Bake in the preheated oven until the chops are no longer pink inside and the juices run clear, 30 to 45 minutes. An instant-read meat thermometer inserted into the thickest part of a chop should read at least 160 degrees F (70 degrees C).",
        "While chops are baking, place the apple wedges into a large saucepan over medium heat, and pour in enough apple juice to reach depth of 2 inches above the apples. Mix in the cinnamon, allspice, vanilla extract, and brown sugar. Bring to a boil, reduce heat to a simmer, and cook until apples are soft when pierced with a fork, about 30 minutes.",
        "To serve, place a pork chop in the center of a plate, and arrange apple slices decoratively up one side, over the top, and down the other side of the chop. Drizzle each chop with the apple liquid; serve remaining sauce separately."
    ],
    "ingredients": [
        "6 pork chops",
        "1 teaspoon onion powder, or to taste",
        "1 teaspoon garlic powder, or to taste",
        "1 1/2 teaspoons lemon pepper seasoning, or to taste",
        "1 cup finely crushed cornflake crumbs, or as needed",
        "7 apples - peeled, cored and cut into wedges",
        "1 1/2 cups apple juice, or as needed",
        "1 teaspoon ground cinnamon",
        "3/4 teaspoon ground allspice, or to taste",
        "1 teaspoon vanilla extract",
        "2/3 cup brown sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Pepper Pork Chops Baked and Served With Apples",
    "url": "http://allrecipes.com/recipe/219007/lemon-pepper-pork-chops-baked-and-ser/"
}
