{
    "directions": [
        "Place 2 teaspoons water in small bowl; sprinkle gelatin over. Let stand 10 minutes. Whisk sugar, lemon juice, yolks and lemon peel in heavy medium saucepan to blend. Add butter; stir constantly over medium heat until mixture thickens and just begins to bubble at edges, about 9 minutes. Remove from heat. Add gelatin mixture; stir to dissolve. Transfer lemon curd to medium bowl. Press plastic wrap directly onto surface. Chill until cold. (Can be made 3 days ahead. Keep chilled.)",
        "Preheat oven to 350°F. Spread coconut on baking sheet. Sprinkle brown sugar over.Bake until coconut is golden, stirring occasionally, about 10 minutes. Cool.",
        "Beat cream in medium bowl until stiff peaks form. Fold 1 cup cream into curd.",
        "Layer 3 tablespoons berries, 3 tablespoons mousse, 1 tablespoon coconut mixture and 3 tablespoons whipped cream in each of 8 stemmed 10-to-12 ounce glasses. Repeat layering. Top each with 2 tablespoons berries, dollop of cream, some coconut mixture and more berries. (Can be made 6 hours ahead. Cover; chill.)"
    ],
    "ingredients": [
        "2 teaspoons water",
        "1/2 teaspoon unflavored gelatin",
        "1 cup sugar",
        "1/2 cup fresh lemon juice",
        "6 large egg yolks",
        "2 tablespoons grated lemon peel",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into small pieces",
        "1 cup sweetened flaked coconut",
        "1/4 cup (packed) golden brown sugar",
        "1 1/2 cups chilled whipping cream",
        "2 6-ounce baskets fresh blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Blueberry",
        "Lemon",
        "Coconut",
        "Summer",
        "Chill"
    ],
    "title": "Lemon Curd Mousse with Toasted Coconut and Blueberries",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-curd-mousse-with-toasted-coconut-and-blueberries-4308"
}
