{
    "directions": [
        "Rub verbena sprigs in your hands to bruise leaves and stems, then combine sprigs with wine and 3/4 cup sugar in a heavy medium saucepan. Bring to a boil, stirring until sugar has dissolved, then simmer 1 minute. Remove from heat and let steep, covered, 1 hour.",
        "While verbena mixture steeps, finely grind verbena leaves with remaining 1/4 cup sugar in a food processor or an electric coffee/spice grinder. Gently toss fruit with verbena sugar and 2 tablespoons lemon juice in a bowl. Let stand while verbena syrup finishes steeping.",
        "Sprinkle gelatin over water and let soften 1 minute. Meanwhile, reheat verbena syrup until hot, then stir in gelatin mixture until dissolved. Strain through a fine-mesh sieve into a bowl. Stir in macerated fruit with juices and remaining 2 tablespoons lemon juice. Chill in an ice bath, stirring occasionally, until cool and thickened (the texture of raw egg whites) but not set, 8 to 10 minutes.",
        "Very lightly oil baking pan with vegetable oil (not necessary if pan is nonstick or if using individual glasses).",
        "Pour gelée into baking pan and chill in refrigerator until set, at least 3 hours.",
        "To unmold, dip pan in a larger pan of hot water 5 to 10 seconds to loosen. Invert onto a serving plate (do not unmold if using individual glasses). Let stand at room temperature 15 minutes before serving."
    ],
    "ingredients": [
        "8 (4-inch) leafy lemon verbena sprigs plus 4 medium leaves, divided",
        "2 cups dry rosé wine",
        "1 cup sugar, divided",
        "3 cups mixed summer fruit such as berries and thinly sliced nectarines or peaches",
        "1/4 cup fresh lemon juice, divided",
        "4 1/2 teaspoon unflavored gelatin (two 1/4-ounces envelopes)",
        "1/3 cup water",
        "Equipment: a 1 1/2-quarts nonreactive baking pan, loaf pan, or bowl or 6 (8-oz) glasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Berry",
        "Dessert",
        "Nectarine",
        "Summer",
        "Chill",
        "Healthy",
        "Boil",
        "Lemon Juice",
        "Gourmet",
        "Fat Free",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon Verbena and Summer Fruit Gelée",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-verbena-and-summer-fruit-gelee-354986"
}
