{
    "directions": [
        "Preheat oven to 300°F. Place salmon in a baking dish and rub with lemon zest, oregano, salt, and pepper on all sides, then coat with oil. Arrange peppers around salmon. Bake until salmon is firm but still pink in the center, about 20 minutes (if you prefer salmon more well done, cook an additional 5 minutes).",
        "Set a steamer basket in a large pot filled with 2\" water. Cover pot and bring water to a boil. Add potatoes, cover, and steam until tender, 10–12 minutes. Add asparagus to potatoes, cover, and steam until crisp-tender, 3–5 minutes.",
        "Meanwhile, whisk oil, lemon juice, honey, salt, pepper, and 1/4 cup dill in a small bowl or measuring cup. Toss escarole with half of the dressing in a large bowl, then transfer to a serving platter.",
        "Toss potatoes and asparagus with remaining dressing in same bowl, then arrange over escarole. Flake salmon into large pieces and arrange on platter. Top with feta, peppers, and dill sprigs."
    ],
    "ingredients": [
        "1 1/2 pounds skinless salmon fillet",
        "2 teaspoons finely grated lemon zest",
        "1 teaspoon finely chopped oregano",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "4 ounces roasted bell peppers from a jar, thinly sliced",
        "1/2 pound small new potatoes, halved",
        "1 bunch asparagus (about 1 pound), trimmed",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon honey",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup finely chopped dill, plus sprigs for serving",
        "1/2 head of escarole, coarsely chopped (about 8 cups)",
        "3 ounces feta, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Spring",
        "Salmon",
        "Dinner",
        "Fish",
        "Seafood",
        "Quick and Healthy",
        "Wheat/Gluten-Free",
        "Escarole",
        "Roast",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon-Roasted Salmon With Escarole, Asparagus, and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-roasted-salmon-with-escarole-asparagus-and-potatoes"
}
