{
    "directions": [
        "Preheat oven to 350°F. Line loaf pan with parchment paper, leaving an overhang on the long sides, and lightly coat with nonstick spray.",
        "Whisk flour, baking powder, and salt in a medium bowl. Whisk lemon zest into sugar in a large bowl until very fragrant, about 1 minute. Add eggs, oil, and vanilla and whisk until light in color and slightly thickened, about 3 minutes. Whisk in half of the dry ingredients, then whisk in yogurt. Whisk in remaining dry ingredients. Add lemon juice and whisk to combine. Scrape batter into prepared pan and smooth top.",
        "Bake cake, rotating pan halfway through, until top is golden brown and a tester inserted into the center comes out clean, 55–60 minutes. Transfer pan to a wire rack and let cool, about 2 hours.",
        "Bring sugar and 1 cup water to a boil in a medium saucepan. Add blueberries, then reduce to a simmer. Smash blueberries with the back of a spoon and continue to simmer 20 minutes.",
        "Meanwhile, sprinkle gelatin over 1/3 cup cold water in a small bowl; let sit 10 minutes to soften.",
        "Strain blueberry mixture through a fine-mesh sieve into a medium bowl, pressing blueberries with the back of spoon to release juices. Whisk about 1/3 cup blueberry syrup into gelatin mixture, stirring to dissolve, then pour gelatin mixture over remaining blueberry syrup and stir to combine. Chill at least 1 1/2 hours.",
        "Run a knife around sides of cooled cake to loosen. Using parchment overhang, transfer cake to a baking sheet or cutting board. Starting at 1 end of cake, use a 1/8\" dowel or the thin handle of a wooden spoon to poke holes in rows spaced about 3/4\" apart, alternating between 2 and 3 holes per row (you should have about 11 rows of holes).",
        "Transfer chilled blueberry filling to a pastry bag, turkey baster, or squeeze bottle. Carefully squeeze filling into holes.",
        "Whisk powdered sugar, lemon juice, and 1 Tbsp. water in a medium bowl. Transfer cake to a wire rack set inside a rimmed baking sheet. Spread glaze over cake with a spatula, covering the holes. Toss blueberries in glaze bowl to coat, then sprinkle blueberries and lemon zest over cake. Chill until filling and glaze are set, about 1 hour.",
        "Lemon cake can be made 1 day ahead. Cake can be baked, filled, and glazed 3 days ahead; chill in an airtight container."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon kosher salt",
        "2 tablespoons finely grated lemon zest",
        "1 3/4 cups sugar",
        "2 large eggs, room temperature",
        "1/3 cup vegetable oil",
        "1 teaspoon vanilla extract",
        "3/4 cup plain whole milk yogurt",
        "5 tablespoons fresh lemon juice",
        "1/2 cup sugar",
        "1 cup blueberries",
        "1 teaspoon unflavored powdered gelatin",
        "3/4 cup powdered sugar",
        "1 tablespoon fresh lemon juice",
        "2 tablespoons blueberries",
        "1 teaspoon finely grated lemon zest",
        "A 9x5\" loaf pan (preferably metal)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#CAKEWEEK",
        "Cake",
        "Lemon",
        "Lemon Juice",
        "Blueberry",
        "Dessert",
        "Breakfast",
        "Brunch",
        "Bake",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon-Blueberry Poke Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-blueberry-poke-cake"
}
