{
    "directions": [
        "Position a rack in the lower third of an oven and preheat to 325°F (165°C). Grease and flour all 4 wells of an Easter bunny cake pan; tap out the excess flour.",
        "To make the cake, in the bowl of an electric mixer fitted with the flat beater, beat the butter on medium-high speed until fluffy, 3 to 4 minutes. Stop the mixer, add 1 cup of the cake mix and beat on medium speed until smooth, about 1 minute.",
        "Add the eggs one at a time, beating well after each addition. Add the remaining cake mix and the milk and beat until all of the mix is moistened, about 1 minute.",
        "Spoon the batter into the prepared pan, filling each well about 3/4 full, and spread the batter so the sides are slightly higher than the center. Bake until the cake begins to pull away from the sides of the pan and a toothpick inserted into the center of the cake comes out clean, about 40 minutes.",
        "Transfer the pan to a wire rack and let the cake cool in the pan for 15 minutes. Invert the pan onto the rack and lift off the pan. Let the cake cool completely, at least 2 hours, before assembling and decorating.",
        "Meanwhile, prepare the buttercream frosting: In the bowl of an electric mixer fitted with the flat beater, beat the butter on medium speed until smooth and creamy, about 1 minute. Add the confectioners’ sugar, milk, vanilla and salt and beat until light and fluffy, about 1 minute more, stopping the mixer to scrape down the bottom and sides of the bowl as needed.",
        "To assemble the cake, return both halves of the bunny and both halves of the egg to the pan. Level all four cakes by using a serrated knife to gently saw off any portion of the cake that rose above the edge of the pan.",
        "Remove the egg cakes from the pan; set aside. Remove one half of the bunny cake from the pan. Spread a thin layer of the buttercream frosting over the cut side of the cake half that is still in the pan. Place the first half, cut side down, on top of the half that is still in the pan, lining up the edges. Gently press down to adhere the two halves. Cover the pan with the cake in it loosely with plastic wrap and refrigerate until the buttercream is firm, about 1 hour.",
        "Carefully unmold the bunny cake and place the bunny upright on a platter. If the cake is unstable, use a serrated knife to trim the bottom so it is level. Place the egg cakes alongside. Decorate the bunny and egg cakes as desired with royal icing, or dust with confectioners’ sugar immediately before serving. Serves 12 to 16.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "16 Tbs. (2 sticks) (8 oz./250 g) unsalted butter, at room temperature",
        "1 package lemon Bundt cake mix",
        "4 eggs, at room temperature",
        "1 1/3 cups (11 fl. oz./340 ml) milk, at room temperature",
        "2 Tbs. unsalted butter, at room temperature",
        "3/4 cup (3 oz./90 g) confectioners’ sugar, sifted",
        "1 1/2 tsp. milk",
        "1/4 tsp. vanilla extract",
        "Pinch of salt",
        "Royal icing for decorating or confectioners’ sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemon Bunny Cake",
    "url": "http://www.williams-sonoma.com/recipe/lemon-bunny-cake.html"
}
