{
    "directions": [
        "Whisk eggs and yolks in large bowl. Combine lemon juice, butter, and sugar in medium metal bowl. Set over saucepan of simmering water; stir until sugar dissolves. Gradually whisk hot lemon mixture into egg mixture. Return mixture to bowl set over water; whisk constantly until mixture thickens and instant-read thermometer registers 180°F, about 5 minutes. Pour curd through fine strainer set over bowl; stir in lemon peel.",
        "Place plastic wrap directly on surface of curd. Refrigerate until cold, at least 8 hours or overnight. (Can be made 2 days ahead. Keep refrigerated.)",
        "Position rack in center of oven and preheat to 325°F. Lightly butter two 9-inch-diameter cake pans with 2-inch-high sides. Line bottom of pans with parchment rounds. Sift first five ingredients into large bowl of stand mixer fitted with whisk attachment. Add butter, milk, and lemon peel and beat on medium-high speed until thick batter forms, about 2 minutes. Add 4 egg whites; beat until smooth. Add remaining 4 egg whites; beat until well blended and smooth. Divide batter between prepared pans (about generous 4 1/2 cups for each); smooth tops with offset spatula.",
        "Bake cakes until golden and tester inserted into centers come out clean, about 45 minutes. Cool in pans on rack 10 minutes. Turn cakes out onto racks; remove parchment and cool completely. (Can be prepared 1 day ahead. Wrap in foil and store at room temperature.)",
        "Cut domed tops from both cakes, making each cake 1 1/4 to 1 1/3 inches high. Using long serrated knife, cut each cake horizontally in half. Place 3 cake layers on separate cardboard rounds or plates (reserve fourth cake layer for another use). Spread 1/3 cup preserves over top of each of 3 cake layers.",
        "Transfer 1 cup curd to large bowl; reserve for mousse. Divide remaining curd among layers (generous 3/4 cup for each); spread evenly over preserves to edge of layers. Refrigerate layers separately while preparing mousse (do not stack cake layers).",
        "Pour 1/4 cup water into small saucepan; sprinkle gelatin over. Let stand until gelatin softens, about 15 minutes. Place saucepan over low heat, stirring until gelatin dissolves, about 2 minutes (mixture will be lukewarm). Stir gelatin into reserved 1 cup lemon curd.",
        "Using electric mixer, beat egg whites and 3 tablespoons sugar in large bowl until stiff but not dry. Fold egg whites into curd mixture in 2 additions; set aside until mousse begins to set slightly, about 10 minutes. Spoon 1/3 of lemon mousse (scant 1 cup) atop each layer, then spread gently to edges using offset spatula. Chill layers until mousse firms up slightly, about 30 minutes.",
        "Place 1 cake layer on platter. Gently top with second, then third, being careful not to press down firmly. Refrigerate at least 2 hours. (Can be prepared 1 day ahead. Cover with cake dome and keep refrigerated.)",
        "Garnish top edge of cake with white chocolate curls. Sprinkle pistachios and crystallized ginger in center of cake."
    ],
    "ingredients": [
        "7 large eggs",
        "4 large egg yolks",
        "1 cup fresh lemon juice",
        "1 cup (2 sticks) unsalted butter, diced",
        "3/4 cup sugar",
        "2 1/2 tablespoons (packed) finely grated lemon peel",
        "4 cups all purpose flour",
        "2 1/4 cups sugar",
        "5 teaspoons ground ginger",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons fine sea salt",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "1 1/3 cups whole milk",
        "2 1/2 tablespoons (packed) finely grated lemon peel",
        "8 large egg whites, room temperature, divided",
        "1 cup blackberry preserves",
        "1/4 cup water",
        "2 teaspoons unflavored gelatin",
        "4 large egg whites, room temperature",
        "3 tablespoons sugar",
        "White chocolate curls",
        "1/4 cup chopped natural unsalted pistachios (about 2 ounces)",
        "2 tablespoons chopped crystallized ginger (about 1 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Wedding",
        "Blackberry",
        "Lemon",
        "Pistachio",
        "Spring",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Lemon-Ginger Cake with Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ginger-cake-with-pistachios-234444"
}
