{
    "directions": [
        "Remove 2 wide strips zest from 1 lemon with a vegetable peeler. Combine 1 strip zest with the vegetable oil in a small saucepan over medium heat and cook until the edges of the zest turn slightly golden, about 5 minutes. Let the lemon oil cool.",
        "Meanwhile, cook the rice as the label directs, adding the remaining strip lemon zest to the water. Transfer the rice to a large bowl, discarding the zest, and fluff with a fork. Let cool to room temperature.",
        "Meanwhile, make the dressing: Juice both lemons into a medium bowl. Add the vinegar, brown sugar, 1 1/4 teaspoons salt and 1/2 teaspoon pepper and whisk until the sugar dissolves. Discard the zest from the lemon oil, then whisk the oil into the dressing. Add the onion slices and let marinate 15 minutes.",
        "Add the carrot, cucumber, peanuts, cilantro, mint, basil and watercress to the bowl with the rice. Add the dressing mixture and gently toss. Per Serving: Calories: 378; Total Fat: 15.5 grams; Saturated Fat: 1 gram; Protein: grams; Total carbohydrates: 55 grams; Sugar: 4 grams; Fiber: 1.5 grams; Cholesterol: 0 milligrams; Sodium: 159 milligrams",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "2 lemons",
        "Kosher salt and freshly ground pepper",
        "1/2 medium red onion, thinly sliced",
        "1 medium carrot, shredded",
        "1/4 cup vegetable oil",
        "2 cups long-grain white rice",
        "2 tablespoons rice wine vinegar",
        "2 teaspoons packed light brown sugar",
        "1 Kirby cucumber, seeded and diced",
        "1/2 cup chopped salted roasted peanuts",
        "1/2 cup fresh cilantro, roughly chopped",
        "1/2 cup fresh mint, roughly chopped",
        "1/2 cup fresh basil, roughly chopped",
        "1 bunch watercress, tough stems removed, leaves torn"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Salad Recipes",
        "Rice Recipes",
        "Low-Fat",
        "Gluten Free",
        "Low Calorie",
        "Heart-Healthy",
        "Low-Cholesterol",
        "Low Sodium"
    ],
    "title": "Lemon-Herb Rice Salad",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/lemon-herb-rice-salad-recipe"
}
