{
    "directions": [
        "In a large bowl, use your hands to mix together all of the ingredients, then form the mixture into twelve 2-inch patties (about 3/4 inch thick). Arrange the patties on a plate and refrigerate for at least 30 minutes, until firm.",
        "Preheat the grill for at least 10 minutes and set it up to grill over moderately high heat. Oil the grates. Grill the patties until brown grill marks form on the bottom, about 4 minutes. Flip the patties, then grill for 3 to 4 minutes longer, until cooked through but still juicy.",
        "In a small mixing bowl, whisk the vinegar with the sugar and water. Add the fish sauce, then taste and season with more vinegar or sugar, depending on your taste.",
        "Arrange the lettuce leaves and herb sprigs on a platter. To serve, wrap the pork patties and herb sprigs in lettuce and dip in the sauc"
    ],
    "ingredients": [
        "1 pound ground pork",
        "3 large cloves of garlic, minced (about 2 tablespoons)",
        "1/4 cup thinly sliced scallion greens (from 3 to 4 scallions)",
        "1 stalk lemongrass, tough outer layers removed, lower 6 inches of tender bulb, finely chopped",
        "1 tablespoon finely chopped fresh ginger",
        "1 1/2 teaspoons fish sauce (such as nuoc mam or nam pla)",
        "1 1/2 teaspoons sugar",
        "1/2 teaspoon freshly ground black pepper",
        "3/4 teaspoon kosher salt",
        "1 1/2 tablespoons rice vinegar, plus more to taste",
        "1 tablespoons sugar, plus more to taste",
        "1/4 cup water",
        "1 tablespoon plus 1 teaspoon fish sauce",
        "Pinch of crushed red pepper",
        "12 lettuce leaves, such as Boston lettuce or iceberg",
        "Herb sprigs, such as mint, cilantro and Thai basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Ginger",
        "Pork",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Lemongrass",
        "Green Onion/Scallion"
    ],
    "title": "Lemongrass Pork Patties With Vietnamese Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lemongrass-pork-patties-with-vietnamese-dipping-sauce-51237010"
}
