{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Grease springform pan with some oil, then line bottom with a round of parchment paper. Oil parchment.",
        "Finely grate enough lemon zest to measure 1 1/2 teaspoons and whisk together with flour. Halve lemon, then squeeze and reserve 1 1/2 tablespoons fresh lemon juice.",
        "Beat together yolks and 1/2 cup sugar in a large bowl with an electric mixer at high speed until thick and pale, about 3 minutes. Reduce speed to medium and add olive oil (3/4 cup) and reserved lemon juice, beating until just combined (mixture may appear separated). Using a wooden spoon, stir in flour mixture (do not beat) until just combined.",
        "Beat egg whites (from 4 eggs) with 1/2 teaspoon salt in another large bowl with cleaned beaters at medium-high speed until foamy, then add 1/4 cup sugar a little at a time, beating, and continue to beat until egg whites just hold soft peaks, about 3 minutes.",
        "Gently fold one third of whites into yolk mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Transfer batter to springform pan and gently rap against work surface once or twice to release any air bubbles. Sprinkle top evenly with remaining 1 1/2 tablespoons sugar. Bake until puffed and golden and a wooden pick or skewer inserted in center of cake comes out clean, about 45 minutes. Cool cake in pan on a rack 10 minutes, then run a thin knife around edge of pan and remove side of pan. Cool cake to room temperature, about 1 1/4 hours. Remove bottom of pan and peel off parchment, then transfer cake to a serving plate."
    ],
    "ingredients": [
        "3/4 cup olive oil (extra-virgin if desired), plus additional for greasing pan",
        "1 large lemon",
        "1 cup cake flour (not self-rising)",
        "5 large eggs, separated, reserving 1 white for another use",
        "3/4 cup plus 1 1/2 tablespoons sugar",
        "Special equipment: a 9-inch (24-cm) springform pan; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Egg",
        "Bake",
        "Quick & Easy",
        "Spring",
        "Birthday",
        "Gourmet"
    ],
    "title": "Lemon Olive-Oil Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-olive-oil-cake-234274"
}
