{
    "directions": [
        "Place chicken in large bowl. Add boiling water to cover. Let stand 2 minutes; drain well. Using small knife, scrape skin to remove any surface fat. Rinse with cold water; drain again. Bring 5 quarts water to boil in heavy large pot. Add chicken. Return to boil, skimming impurities . Cook until broth is clear, skimming as needed and stirring occasionally, about 15 minutes. Add onions, yam, carrots, parsnips, and celery. Partially cover and reduce heat to medium-low; simmer until chicken and vegetables are tender, about 1 1/2 hours. Add dill and parsley to soup; simmer 3 minutes. Remove from heat and let stand 1 hour. Strain into clean pot. (Can be made 2 days ahead. Chill uncovered until cold, then cover and chill.) Add matzo balls to soup and rewarm over medium heat. Season to taste with lemon juice, salt, and pepper. Ladle into bowls. Add 1 lemon slice and matzo balls to each."
    ],
    "ingredients": [
        "1 4 1/2- to 5-pound chicken, cut into 8 pieces, rinsed well, excess skin and fat cut away and discarded",
        "Boiling water",
        "5 quarts cold water",
        "1 tablespoon coarse kosher salt",
        "1 pound onions, quartered",
        "1 1-pound yam (red-skinned sweet potato), peeled, cut in half crosswise",
        "3/4 pound carrots, peeled, thickly sliced",
        "1/2 pound parsnips, peeled, thickly sliced",
        "4 large celery stalks, cut into 2-inch pieces",
        "10 large fresh dill sprigs",
        "10 large fresh Italian parsley sprigs",
        "Parsley-Sage Matzo Balls",
        "3 to 4 tablespoons fresh lemon juice",
        "8 thin lemon slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Citrus",
        "Poultry",
        "Passover",
        "Low Cal",
        "Spring",
        "Kosher",
        "Dill"
    ],
    "title": "Lemon-Scented Chicken Soup with Parsley-Sage Matzo Balls",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-scented-chicken-soup-with-parsley-sage-matzo-balls-234412"
}
