{
    "directions": [
        "In large bowl, whisk together oil and eggs. Stir in matzoh meal and salt until well blended. Stir in 1/4 cup stock. Cover batter and refrigerate until cold and firm, at least 20 minutes and up to 1 day.",
        "Line large baking sheet with plastic wrap or parchment paper. Using wet hands, very gently shape batter into about 16 balls, each about 2 inches in diameter. Arrange on prepared sheet.",
        "In large stock pot over high heat, bring remaining stock to boil. Gently drop balls into stock, return to boil, then reduce heat to low, cover, and simmer until balls are tender and cooked through, about 40 minutes. (Matzoh balls can be cooked up to 1 day ahead. Refrigerate stock and balls separately and rewarm balls before serving by simmering in stock 5 minutes.)",
        "Cut leeks crosswise into 2-inch lengths, then thinly slice lengthwise. Wash leek strips in bowl of cold water, agitating, then lift out and pat dry.",
        "In medium saucepan over high heat, bring 4 cups salted water to boil. Reduce heat to low, add leeks, and gently simmer, uncovered, until tender, about 7 minutes. Using slotted spoon, transfer leeks to small bowl. Add mushrooms to water and gently simmer, uncovered, until tender, about 10 minutes. Using slotted spoon, transfer mushrooms to second small bowl. Cover vegetables and keep warm. (Vegetables can be poached up to 1 day ahead and refrigerated, covered. Rewarm by simmering in water 30 seconds before proceeding.)",
        "Using slotted spoon, divide balls among 8 soup bowls. (Discard stock in which balls were cooked.) Top with leeks and mushrooms. Ladle warm consommé over and sprinkle with parsley. Serve immediately."
    ],
    "ingredients": [
        "4 tablespoons vegetable oil",
        "4 large eggs",
        "1 cup matzoh meal",
        "2 teaspoons salt",
        "4 quarts chicken stock or low-sodium chicken broth",
        "1 large leek (white and pale green parts only)",
        "1/2 pound shiitake mushrooms, stems discarded and caps thinly sliced",
        "Lemongrass Consommé , warm",
        "1/4 cup fresh Italian parsley, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Appetizer",
        "Poach",
        "Passover",
        "Leek",
        "Parsley",
        "Boil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Lemongrass Consommé with Matzoh Balls, Leeks, and Shiitake Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/lemongrass-consomme-with-matzoh-balls-leeks-and-shiitake-mushrooms-241928"
}
