{
    "directions": [
        "Lightly oil six 3/4-cup ramekins or custard cups. Mix milk and cream in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Remove from heat. Cover; let steep 30 minutes. Remove vanilla bean.",
        "Pour lemon juice into small bowl; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Stir sugar and gelatin mixture into milk mixture. Stir over low heat just until sugar and gelatin dissolve, about 2 minutes. Remove from heat. Whisk in crème fraîche and lemon peel. Divide among ramekins. Cover; chill until set, at least 6 hours or overnight.",
        "Puree 2/3 of blackberries and all reserved juices, brown sugar, and crème de cassis, if desired, in blender. Strain mixture into medium bowl, pressing on solids to extract as much liquid as possible. Discard solids in strainer. Stir remaining blackberries into sauce. (Can be made 1 day ahead. Cover and chill.)",
        "Run small knife around each panna cotta. Place bottoms of ramekins, 1 at a time, in bowl of hot water 45 seconds. Place plate atop ramekin. Hold plate and ramekin together; invert, shaking gently, to turn out panna cotta. Serve with sauce.",
        "*Available at some supermarkets. If unavailable, heat 1 cup whipping cream to lukewarm (85°F). Remove from heat; mix in 2 tablespoons buttermilk. Cover; let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Chill until ready to use."
    ],
    "ingredients": [
        "Vegetable oil",
        "1 cup whole milk",
        "1 cup whipping cream",
        "1/2 vanilla bean",
        "5 tablespoons fresh lemon juice",
        "2 teaspoons unflavored gelatin",
        "1/2 cup sugar",
        "1 cup crème fraîche*",
        "2 tablespoons grated lemon peel",
        "3 cups frozen blackberries (about 12 ounces), thawed, drained, juices reserved",
        "3 tablespoons (packed) golden brown sugar",
        "3 tablespoons crème de cassis (black-currant-flavored liqueur; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Dessert",
        "Blackberry",
        "Lemon",
        "Vanilla",
        "Chill",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon Panna Cotta with Blackberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-panna-cotta-with-blackberry-sauce-107943"
}
