{
    "directions": [
        "Preheat oven to 350°F. Butter a 9-inch round cake pan (2 inches deep) and line bottom with a round of wax paper.",
        "Into a bowl sift together flour, baking powder, and salt. In a large bowl with an electric mixer beat together butter and 1 cup sugar until light and fluffy, about 1 minute. Separate eggs and beat yolks 1 at a time into butter mixture, beating well after each addition. In 3 batches alternately beat in flour mixture and milk, beginning and ending with flour mixture. Add zest and 2 tablespoons lemon juice, beating until just combined (do not overbeat). In a bowl with cleaned beaters beat whites until they hold soft peaks and beat in remaining 1/4 cup sugar. Fold whites into batter gently but thoroughly. Transfer batter to cake pan and bake in middle of oven until a tester comes out clean, 35 to 40 minutes. Cool cake in pan on a rack and invert onto rack. Cake may be prepared up to this point 1 day ahead and kept in an airtight container at cool room temperature.",
        "With a long serrated knife horizontally halve cake. Put bottom half, cut side up, in a 9-inch springform pan. Brush 2 tablespoons remaining lemon juice over layer. Working quickly, spread half of blueberry filling evenly over layer, leaving a 1/4-inch border around edge, and top with one third ice cream, spreading evenly. Put remaining cake half, cut side up, on top of ice cream and brush remaining 2 tablespoons lemon juice over it. Spread remaining blueberry filling evenly over top, leaving a 1/4-inch border around edge, and spread half of remaining ice cream evenly over filling. Reserve remaining ice cream for outside of cake. Freeze cake, covered, until firm, at least 8 hours, and up to 1 day.",
        "Remove side of springform pan. With a spatula loosen cake from bottom and transfer to a plate. Frost cake with remaining ice cream, spreading evenly around sides and top of cake. Freeze cake, loosely covered, at least 2 hours and up to 5 days.",
        "Twenty minutes before serving, garnish top of cake with blueberries and put cake in refrigerator to soften slightly."
    ],
    "ingredients": [
        "1 1/2 cups cake flour (not self-rising)",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 1/4 cups sugar",
        "2 large eggs",
        "1/2 cup whole milk",
        "3 tablespoons finely grated fresh lemon zest",
        "6 tablespoons fresh lemon juice",
        "blueberry filling",
        "7 cups lemon ice cream",
        "Garnish: 2 cups blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Blueberry",
        "Lemon",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Blueberry Ice-Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-blueberry-ice-cream-cake-15161"
}
