{
    "directions": [
        "Bring grape juice to boil in heavy large saucepan. Reduce heat to medium-low and simmer uncovered 1 hour. Add all remaining ingredients and bring to boil. Reduce heat to medium-low and simmer until fruit is tender and liquid is reduced and slightly syrupy, about 1 hour longer. Transfer compote to large bowl. Let stand at room temperature until cool, about 2 hours.",
        "Spoon 2 teaspoons liquid from fruit compote into each of six 3/4-cup ramekins or custard cups. Place ramekins in 13x9x2-inch metal baking pan. Cover and refrigerate remaining fruit compote overnight.",
        "Combine milk, sugar, lemon peel, and salt in medium saucepan; bring to boil. Reduce heat to medium-low.",
        "Cover and simmer 10 minutes. Uncover and let milk mixture steep at room temperature 1 hour. Return milk mixture to simmer. Strain into small bowl; discard lemon peel.",
        "Preheat oven to 350°F. Whisk eggs and egg yolks in medium bowl to blend. Gradually whisk warm milk mixture into egg mixture. Divide custard among prepared soufflé dishes. Pour enough hot water into baking pan to come halfway up sides of soufflé dishes. Bake custards until centers are set and thin knife inserted at edge of dish cleanly separates custard from dish, about 45 minutes. Remove flans from water. Cool 1 hour. Refrigerate flans uncovered overnight.",
        "Run small thin knife around flans to loosen. Invert each flan onto plate. Spoon fruit compote and syrup over and around flans and serve."
    ],
    "ingredients": [
        "5 cups white grape juice",
        "1 1/2 cups 3/4-inch cubes peeled honeydew melon (from about 10-ounce wedge)",
        "1/2 cup dry white wine",
        "1 large Golden Delicious apple, peeled, cored, cut into 3/4-inch cubes",
        "1 large Bosc pear, peeled, cored, cut into 3/4-inch cubes",
        "6 small dried figs, stems trimmed",
        "6 dried apricots",
        "6 pitted prunes",
        "3 tablespoons dark raisins",
        "Peel from 1/2 orange (orange part only; removed with vegetable peeler in strips)",
        "Peel from 1/2 lemon (yellow part only; removed with vegetable peeler in strips)",
        "2 tablespoons honey",
        "3 whole cloves",
        "1 cinnamon stick",
        "1/4 teaspoon ground nutmeg",
        "3 tablespoons juices reserved from compote",
        "2 cups whole milk",
        "1/2 cup sugar",
        "Peel from 1/2 lemon (yellow part only; removed with vegetable peeler in strips), coarsely chopped",
        "Pinch of salt",
        "2 large eggs",
        "2 large egg yolks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Lemon",
        "Dried Fruit",
        "Prune",
        "Raisin",
        "Fig",
        "Fall",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Flan with Autumn Fruit Compote",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-flan-with-autumn-fruit-compote-232896"
}
