{
    "directions": [
        "For the cake: Preheat the oven to 325 degrees F.",
        "In the bowl of an electric mixer fitted with the paddle attachment, cream together the granulated sugar and butter. Add the eggs one at a time, mixing after each addition. Combine the flour and salt in a small bowl, then add it to the butter-sugar mixture 1 cup at a time, mixing after each addition. With the mixer on low, slowly add the lemon-lime soda and mix until combined. Add the lemon and lime zests and mix. Scrape the bowl and mix again.",
        "Thoroughly spray a Bundt pan with nonstick baking spray. Add large spoonfuls of batter to the pan until filled, then even out the surface. Bake for 1 hour and 10 minutes to 1 hour and 15 minutes (a toothpick inserted in the center should not come out totally clean, but it shouldn't be wet with batter either). Let the cake sit in the pan for 15 minutes, then carefully turn it out onto a cake plate and let it cool.",
        "For the glaze: Combine the powdered sugar, lemon zest and juice, lime zest and juice, salt and about 1 tablespoon water in a bowl and gently whisk until thick but pourable; add a little extra water if needed. Use a large spoon to drizzle the glaze all over the cake. Sprinkle over more zest to decorate. Let the glaze set before serving.",
        "Whip the heavy cream and granulated sugar together in a large bowl until it forms soft peaks. Slice the cake and serve with the whipped cream and berries!"
    ],
    "ingredients": [
        "3 cups granulated sugar",
        "3 sticks (12 ounces) unsalted butter",
        "5 eggs",
        "3 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup lemon-lime soda, such as 7-Up",
        "1 tablespoon lemon zest",
        "1 tablespoon lime zest",
        "Nonstick baking spray, for spraying pan",
        "2 cups powdered sugar, sifted",
        "1 tablespoon lemon zest, dried for at least 30 minutes, plus more for sprinkling",
        "1 tablespoon lemon juice",
        "1 tablespoon lime zest, dried for at least 30 minutes, plus more for sprinkling",
        "1 tablespoon lime juice",
        "1/4 teaspoon salt",
        "1 cup heavy cream",
        "1 teaspoon granulated sugar",
        "Blackberries, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Cake",
        "Fruit",
        "Lime Recipes",
        "Lemon Recipes"
    ],
    "title": "Lemon-Lime Pound Cake",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/lemon-lime-pound-cake"
}
