{
    "directions": [
        "Preheat the oven to 425 degrees F. Whisk the olive oil, minced garlic, lemon zest and juice, anchovies, basil, parsley, paprika and 1 teaspoon salt in a large bowl. Add the shrimp, tomatoes, scallions and jalapeno; toss.",
        "Tear off eight 16-inch sheets of parchment paper. Make the packets (see photo gallery), using a double layer of parchment for each packet: Arrange about one-quarter of the shrimp mixture on a double layer, using a slotted spoon. Top with 2 tablespoons clam juice, 1/2 tablespoon butter and one-quarter of the liquid from the bowl. Seal as directed. Repeat to make 3 more packets; divide between 2 baking sheets.",
        "Transfer to the oven and bake until the parchment puffs and the shrimp are just cooked through, about 20 minutes. Let rest 5 minutes before opening.",
        "Meanwhile, toast the baguette slices in a grill pan until marked; rub with the remaining garlic clove. Carefully open the packets and serve with the grilled bread. Photograph by David Malosh",
        "Be careful when opening parchment packets - the steam is hot!",
        "Photograph by David Malosh"
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "2 cloves garlic (1 minced)",
        "Grated zest and juice of 1 lemon",
        "2 to 3 anchovies, rinsed and minced (about 1 tablespoon)",
        "3 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon paprika",
        "Kosher salt",
        "2 pounds extra-large shrimp, peeled and deveined, tails intact",
        "1 pint grape tomatoes, halved",
        "4 scallions, sliced",
        "1 red jalapeno pepper, seeded and chopped",
        "1/2 cup bottled clam juice",
        "2 tablespoons unsalted butter",
        "1 baguette, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Shellfish Recipes",
        "Shrimp",
        "Main Dish Recipes"
    ],
    "title": "Lemon-Herb Shrimp Packets",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/lemon-herb-shrimp-packets"
}
