{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 9 inch springform pan. Cut an 18 inch square of aluminum foil, and wrap around the outside bottom of the pan.",
        "To make the crust, mix the graham cracker crumbs and brown sugar together in a bowl. Stir in the melted butter until thoroughly blended. Press the mixture evenly into the bottom of the prepared pan.",
        "Bake in preheated oven until golden brown, about 8 minutes. Remove pan from oven and cool on a rack.",
        "To make the filling, place the cream cheese in a mixing bowl; beat until creamy, about 2 minutes. Continue beating while gradually adding 1 cup sugar. Beat until sugar is thoroughly blended. Beat in the egg yolks, one at a time, scraping the sides of the bowl after each addition. Mix in the lemon zest, lemon juice, vanilla, and sour cream until well blended.",
        "Beat the egg whites in a clean bowl until soft peaks form. Continue beating while gradually adding 1/3 cup sugar in a slow stream, until stiff peaks form. Do not overbeat. Gently fold 1/3 of the meringue into the cream cheese mixture. Repeat twice more with remaining meringue, mixing carefully to not deflate the egg whites, until no meringue streaks remain. Pour the filling into the prepared pan, and place in a large baking pan. Pour hot (not boiling) water into the baking pan up to 1 inch on the sides of the springform pan.",
        "Bake in preheated oven until the top is almost set, 50-55 minutes. Turn off the heat, prop the oven door open about 2 inches, and allow cake to rest in the oven until completely set, about 1 hour longer. Refrigerate at least 4 hours, or overnight before serving.",
        "To make the topping, place 1 cup blueberries and sugar in a saucepan; cook over medium heat until berries begin to break, 6-8 minutes. While still hot, strain the berries through a sieve or cheesecloth placed over a bowl, reserving the juice. Discard berry pulp. Allow the juice to cool.",
        "Mix remaining 2 cups blueberries and lemon juice together in a large bowl. Stir in the strained blueberry juice. Just before serving, pour the blueberry topping over the cheesecake."
    ],
    "ingredients": [
        "1 1/4 cups graham cracker crumbs",
        "2 tablespoons brown sugar, packed",
        "1 tablespoon butter, melted",
        "4 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "4 large egg yolks",
        "1 tablespoon finely grated lemon zest",
        "1/4 cup fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1/2 cup sour cream",
        "4 large egg whites",
        "1/3 cup white sugar",
        "3 cups fresh blueberries or frozen blueberries, thawed",
        "1/3 cup white sugar",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Souffle Cheesecake with Blueberry Topping",
    "url": "http://allrecipes.com/recipe/143546/lemon-souffle-cheesecake-with-blueber/"
}
