{
    "directions": [
        "Cut each chicken breast half lengthwise into 6 thin strips. Thread each strip completely onto 1 skewer, leaving 1/2 inch of skewer exposed at 1 end. Press 1 grape tomato onto end of skewer. Divide skewers between two 15x10x2-inch glass baking dishes, stacking skewers if necessary.",
        "Pour oil into bowl. Whisk in next 6 ingredients. Pour marinade over chicken. Marinate 1 hour at room temperature, turning often, or cover and chill overnight.",
        "Preheat oven to 425°F. Remove skewers from marinade and arrange on 2 large rimmed baking sheets; reserve marinade. Bake chicken until just cooked through, about 8 minutes. Transfer to platter.",
        "Transfer reserved marinade to medium saucepan. Boil over medium-high heat 1 minute. Cool marinade 15 minutes. Strain. Pour 1/2 cup marinade into medium bowl; whisk in mayonnaise. Season sauce to taste with salt and pepper. Spoon remaining marinade over chicken to moisten. Serve chicken with sauce."
    ],
    "ingredients": [
        "8 skinless boneless chicken breast halves (each about 7 ounces)",
        "48 8-inch bamboo skewers, soaked in water 30 minutes, drained",
        "1 1-pint basket grape tomatoes or small cherry tomatoes",
        "1 cup olive oil",
        "1 cup fresh lemon juice",
        "6 bay leaves, broken into small pieces",
        "3 tablespoons chopped fresh rosemary",
        "4 large garlic cloves, pressed",
        "2 teaspoons salt",
        "2 teaspoons hot pepper sauce",
        "1 cup light mayonnaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Tomato",
        "Appetizer",
        "Bake",
        "Marinate",
        "Low Carb",
        "Rosemary",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Lemon-Rosemary Chicken Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-rosemary-chicken-skewers-104459"
}
