{
    "directions": [
        "Combine flour, sugar, and salt in processor; blend 5 seconds. Using on/off turns, blend in butter until coarse meal forms. Add 4 teaspoons cream. Using on/off turns, blend until moist clumps form, adding more cream by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap and chill at least 2 hours.",
        "Preheat oven to 350°F. Roll out dough on floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Fold overhang in, pressing to form double-thick sides. Bake crust until golden, pressing with back of fork if crust bubbles, about 18 minutes (small cracks may appear). Brush inside of hot crust twice with egg white. Maintain oven temperature.",
        "Whisk 3/4 cup sugar, cream, yolks, and eggs in bowl to blend well. Mix in lemon juice and lemon peel. Pour filling into warm crust. Bake until filling is slightly puffed at edges and set in center, about 30 minutes. Cool completely, about 1 hour.",
        "Preheat broiler. Place tart on baking sheet. Cover edge of crust with foil to prevent burning. Sprinkle tart with 2 tablespoons sugar. Broil tart until sugar melts and caramelizes, turning sheet for even browning, about 2 minutes. Transfer tart to rack. Cool until topping is crisp, about 1 hour.",
        "Push tart pan bottom up, releasing tart. Place on platter, garnish with lemon slices, if desired, and serve."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/4 cup powdered sugar",
        "Pinch of salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "4 teaspoons (or more) chilled whipping cream",
        "1 egg white, beaten to blend",
        "3/4 cup plus 2 tablespoons sugar",
        "3/4 cup whipping cream",
        "4 large egg yolks",
        "2 large eggs",
        "1/2 cup fresh lemon juice",
        "1 tablespoon (packed) finely grated lemon peel",
        "Lemon slices (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Dessert",
        "Bake",
        "Broil",
        "Lemon",
        "Spring",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Crème Brûlée Tart",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-creme-brulee-tart-109359"
}
