{
    "directions": [
        "Preheat oven to 350°F. Spray 9-inch deep-dish glass pie dish with nonstick spray. Mix cookie crumbs and melted butter in small bowl. Press crumb mixture over bottom and up sides of prepared dish. Bake until golden brown, about 20 minutes. Cool on rack.",
        "Place 1/4 cup water in small bowl; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Whisk egg yolks, 1/3 cup sugar, lemon juice, and lemon peel in top of double boiler to blend. Cook over barely simmering water until custard thickens, whisking frequently, about 6 minutes. Transfer to large bowl. Add gelatin to hot custard; whisk to dissolve. Place over bowl of ice water; stir until cool and thickened but not set, about 12 minutes.",
        "Using electric mixer, beat egg whites in another large bowl until soft peaks form. Gradually add 1/3 cup sugar; beat until stiff but not dry. Fold egg white mixture into custard in 2 additions. Using electric mixer, beat cream in medium bowl until peaks form. Fold into lemon mixture. Transfer filling to cooled crust. Cover with plastic and chill overnight. (Can be made 2 days ahead. Keep chilled.)",
        "Stir sugar and 1/3 cup water in medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high; bring to boil. Add cranberries; cook until half have popped, about 5 minutes. Add jelly; stir until melted. Cool to room temperature. Gently spoon topping over pie. Chill at least 30 minutes to set. (Can be made 4 hours ahead; keep refrigerated.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups shortbread cookie crumbs",
        "3 1/2 tablespoons unsalted butter, melted",
        "1/4 cup water",
        "1 1/2 teaspoons unflavored gelatin",
        "4 large eggs, separated",
        "2/3 cup sugar",
        "1/3 cup fresh lemon juice",
        "1 teaspoon grated lemon peel",
        "1/2 cup chilled whipping cream",
        "1/2 cup sugar",
        "1/3 cup water",
        "2 cups fresh or frozen whole cranberries (about 8 ounces)",
        "1/2 cup currant jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Lemon",
        "Fall",
        "Jam or Jelly",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon Chiffon Pie with Glazed Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-chiffon-pie-with-glazed-cranberries-108857"
}
