{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "In a bowl, stir together the cookie crumbs, butter and the 3 Tbs. granulated sugar until the crumbs are evenly moistened. Pat the crumb mixture firmly and evenly into the bottom and all the way up the sides of a 9-inch (23-cm) pie dish. Bake until the crust is firm, 5 to 7 minutes.",
        "Pour the cold water into a saucepan and sprinkle with the gelatin. Let stand until the gelatin softens and swells, 5 to 10 minutes. Stir in the 3/4 cup granulated sugar, the salt, lemon juice, orange zest and egg yolks; the mixture will be lumpy. Set over medium heat and cook, stirring continuously, until the gelatin melts and the mixture thickens, 6 to 8 minutes. Do not allow the mixture to boil. Set the saucepan in an ice bath until the mixture is cool to the touch.",
        "In a large bowl, using an electric mixer, beat the cream and confectioners’ sugar on medium-high speed until thick, soft peaks form. Spoon the whipped cream into the gelatin mixture and fold together with a rubber spatula until smooth. Pour into the prepared crust, smoothing the top.",
        "Refrigerate the pie until chilled and firm, 3 to 4 hours. Let stand at room temperature for 20 minutes before serving. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "Dessert of the Day,",
        "by Kim Laidlaw (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "1 1/4 cups (4 oz./125 g) gingersnap cookie crumbs",
        "5 Tbs. (2 1/2 oz./75 g) unsalted butter, melted",
        "3 Tbs. plus 3/4 cup (6 oz./185 g) granulated sugar",
        "1/4 cup (2 fl. oz./60 ml) cold water",
        "2 1/4 tsp. (1 package) unflavored powdered gelatin",
        "1/8 tsp. kosher salt",
        "3/4 cup (6 fl. oz./180 ml) fresh lemon juice, strained",
        "1 Tbs. finely grated orange zest",
        "4 egg yolks, lightly beaten",
        "1 1/4 cups (10 fl. oz./310 ml) heavy cream",
        "1/4 cup (1 oz./30 g) confectioners’ sugar"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemon Chiffon Gingersnap Pie",
    "url": "http://www.williams-sonoma.com/recipe/lemon-chiffon-gingersnap-pie.html"
}
