{
    "directions": [
        "1. Set a rack in the middle of the oven and preheat to 350°.",
        "2. In a medium bowl, combine the flour, sugar, and baking powder; stir well to mix. Stir in the pistachios.",
        "3. In another bowl, whisk the eggs with the lemon zest, juice, and vanilla. Use a rubber spatula to stir the egg mixture intot he dry ingredients. Continue to stir until a stiff dough forms.",
        "4. Scrape the dough onto a lightly floured work surface and divide it in half. Roll each half under th epalms of your hands into a cylinder a little shorter than your baking sheet. Place the logs of dough on the baking sheet, making sure they are not too close to each other or to the sides of the pan. With the palm of your hand, press down gently to flatten the logs.",
        "5. Bake for about 25 to 30 minutes, or until the logs are well risen and have spread to about double their size. The logs are done when, pressed with a fingertip, they feel firm. Place the pan on a rack to cool the logs completely.",
        "6. Reset the racks in the upper and lower thirds of the oven. Reduce the oven temperature to 300°F. Place each of the cooled logs on a cutting board and cut it into 1/3-inch thick diagonal slices. Arrange the biscotti on the prepared pans, cut side down. It isn't necessary to leave space between them. Bake the biscotti for about 15 or 20 minutes or until they are dry and lightly golden. Cool on the pan on a rack.",
        "7. Store the cooled biscotti between sheets of parchment or wax paper in a tin or plastic container with a tight-fitting cover."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "3/4 cup sugar",
        "1 1/2 teaspoons baking powder",
        "6 ounces (about 1 1/2 cups) unsalted pistachios",
        "3 large eggs",
        "Finely grated zest of 2 medium lemons",
        "3 tablespoons strained lemon juice",
        "1 teaspoon vanilla extract",
        "2 cookie sheets or jelly roll pans covered with parchment or foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Pistachio",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Pistachio Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pistachio-biscotti-104366"
}
