{
    "directions": [
        "Slice each chicken breast in half horizontally to make 2 thin cutlets. Sprinkle lightly with water, place between two sheets of plastic wrap and pound until 1/4 inch thick. Season with salt and pepper.",
        "Pour some flour into a shallow dish and season with salt. Lightly beat the eggs with the lemon juice in another shallow dish.",
        "Heat the olive oil in a large skillet over medium heat. Dredge the cutlets in the flour, shaking off any excess; dip in the lemon-egg mixture, coating both sides. Add the cutlets to the skillet and cook until golden on the bottom, about 2 minutes. Add the sage leaves to the skillet, then turn the cutlets and cook until golden on the other side, about 2 more minutes. Transfer the cutlets and sage to a paper towel-lined plate.",
        "Pour out any remaining oil from the skillet. Add the wine and chicken broth and cook over medium-high heat until reduced by half, about 5 minutes. Add the butter and swirl until melted.",
        "Transfer the chicken to a platter. Top with the fried sage and drizzle with the pan sauce. Serve with lemon wedges and grains on the side.",
        "Toss 2 cups cubed winter squash and 1 pint cherry tomatoes with olive oil and salt on a baking sheet; roast at 425 degrees F until tender, 25 minutes. Meanwhile, combine 1 cup farro or barley in a saucepan with 1/2 teaspoon salt, a pinch of red pepper flakes, a bay leaf and enough water to cover by 1 inch. Bring to a simmer over high heat, then reduce the heat to medium low and cook, uncovered, until al dente, 15 to 20 minutes. Drain the farro (remove the bay leaf) and toss with the squash, tomatoes, 1 tablespoon olive oil and 3 tablespoons each chopped parsley and grated pecorino. Season with salt and pepper.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "2 large skinless, boneless chicken breasts (about 1 1/4 pounds)",
        "Kosher salt and freshly ground pepper",
        "All-purpose flour, for dredging",
        "2 large eggs",
        "Juice of 1 lemon, plus lemon wedges for serving",
        "3 tablespoons extra-virgin olive oil",
        "4 sprigs sage, leaves only",
        "1/2 cup dry white wine",
        "3/4 cup low-sodium chicken broth",
        "1 to 2 tablespoons unsalted butter",
        "Warm Farro Salad, recipe follows, or other grains, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Fruit",
        "Lemon Recipes",
        "Farro Recipes",
        "Grain Recipes"
    ],
    "title": "Lemon-Sage Chicken Cutlets",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/lemon-sage-chicken-cutlets-recipe"
}
