{
    "directions": [
        "Coat springform pan with nonstick spray. Whisk flour, cornstarch, and salt in a small bowl; set aside. Place butter and powdered sugar in a food processor. Pulse until mixture is smooth. Add dry ingredients to food processor and pulse until mixture resembles medium-size pebbles (dough will not come together completely). Transfer dough to prepared pan. Using your fingers, press dough evenly onto bottom and 1 1/2\" up sides of pan. DO AHEAD: Crust can be prepared 1 day ahead. Cover and chill.",
        "Using a mandoline, slice lemon into paper-thin rounds. Remove seeds. (If using a regular lemon, blanch slices in boiling water for 4 minutes, drain, and let cool before proceeding). Mix sugar, honey, and lemon zest in a medium bowl. Add lemon slices and toss to coat. Let sit until lemon is softened and sugar is dissolved, 30-45 minutes. DO AHEAD: Lemon slice mixture can be made 1 day ahead. Cover and chill.",
        "Place rack in upper third of oven; preheat to 325°F. Bake crust until center is firm to the touch and edges are beginning to turn golden brown, 30-35 minutes.",
        "When crust is almost done baking, whisk eggs and egg yolks in a medium bowl to blend. Whisk flour, cornstarch, and salt in a small bowl; add to egg mixture and whisk to combine. Whisk in lemon juice. Add lemon slice mixture; mix gently to combine.",
        "Reduce oven temperature to 300°F. Pour filling into hot crust. Bake until filling is set and slightly puffed around edges, 25-30 minutes. Transfer pan to a wire rack; let cool completely. Chill for at least 4 hours, then unmold. Serve cold. DO AHEAD: Tart can be made 2 days ahead. Cover and keep chilled."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 3/4 cups all-purpose flour",
        "2 tablespoons cornstarch",
        "1 1/4 teaspoons kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, cut into 1\" pieces",
        "2/3 cup powdered sugar",
        "1 Meyer lemon or thin-skinned regular lemon",
        "1 cup sugar",
        "3 tablespoons honey",
        "1 tablespoon finely grated lemon zest",
        "3 large eggs",
        "2 large egg yolks",
        "1/4 cup all-purpose flour",
        "2 teaspoons cornstarch",
        "1/4 teaspoon kosher salt",
        "2/3 cup fresh lemon juice, preferably Meyer lemon",
        "Special equipment: A 9\"-diameter springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Lemon",
        "Winter",
        "Honey",
        "Lemon Juice",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Honey Tart with Salted Shortbread Crust",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-honey-tart-with-salted-shortbread-crust-51140700"
}
