{
    "directions": [
        "Heat oven to 200°F with racks in upper and lower thirds. Line baking sheets with parchment paper. Use a pencil to mark parchment with parallel lines 5 inches apart; these lines will be your guides when piping. Turn paper over.",
        "Beat whites with salt in stand mixer at high speed (or in a large bowl with handheld mixer) until they just hold soft peaks. Gradually add sugar, beating, and continue to beat at high speed until meringue holds stiff, glossy peaks. Secure paper to baking sheets with dabs of meringue.",
        "Spoon some meringue into pastry bag and pipe 5-inch-long cigars (3/4 to 1 inch wide) onto 1 baking sheet, about 1 inch apart. Add more meringue to pastry bag and pipe more cigars in same manner on other baking sheet.",
        "Sprinkle cigars generously with pistachios.",
        "Bake cigars in oven, switching position of sheets halfway through baking, until crisp but still white, about 2 hours.",
        "Turn off oven and cool meringue cigars in oven 1 hour, then transfer to wire racks to cool completely.",
        "Set a large fine-mesh sieve over a large bowl.",
        "Whisk together zest, juice, sugar, and eggs in a 2-quart heavy saucepan. Add butter and cook over moderately low heat, whisking frequently, until butter melts, curd is thick enough to hold marks of whisk, and first bubble appears on surface, 6 to 9 minutes.",
        "Immediately force lemon curd through sieve into bowl and chill curd, its surface covered with a round of wax paper, until cold, at least 1 hour.",
        "Beat cream and confectioners' sugar in another bowl with cleaned beaters until mixture just holds soft peaks. Fold one third of whipped cream into lemon curd to lighten, then fold in remaining cream. Divide among individual bowls and chill, covered, if not using right away.",
        "Top with strawberries and serve with meringue cigars."
    ],
    "ingredients": [
        "4 large egg whites",
        "1/4 teaspoon salt",
        "1 cup sugar",
        "3 tablespoons unsalted pistachios (preferably not roasted), finely chopped",
        "2 teaspoons finely grated fresh lemon zest",
        "1/2 cup strained fresh lemon juice",
        "1/2 cup sugar",
        "3 large eggs",
        "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
        "1 cup heavy cream",
        "1/2 cup confectioners' sugar",
        "1 pound strawberries, trimmed and halved, or quartered if large",
        "Special equipment: 2 large baking sheets; parchment paper; a stand mixer or a powerful handheld electric mixer; a pastry bag fitted with a plain, round 1/2-inch tip (we used Wilton 1A)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Easter",
        "Kid-Friendly",
        "Strawberry",
        "Lemon",
        "Tree Nut",
        "Pistachio",
        "Spring",
        "Lemon Juice",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Pudding with Strawberries and Meringue Cigars",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pudding-with-strawberries-and-meringue-cigars-395394"
}
