{
    "directions": [
        "1. Line a 9 1/2 x 4 x 3-inch loaf pan with a double layer of plastic wrap, making sure the wrap is tucked into all the corners and there is at least 1 inch overhanging the top of the pan on all sides.",
        "2. Combine 1 pint of ice cream with the blueberries in a food processor and process until smooth. Place in the freezer to keep cold so it doesn't melt while you work.",
        "3. Combine the remaining 2 pints of ice cream, the lemon juice, and the zest in a large bowl and mash with the back of a spoon until it is smooth but not yet melting. Spread half of the lemon ice cream in an even layer across the bottom of the prepared pan. Freeze for 10 minutes. Spread half of the blueberry ice cream mixture on top. Place the pan in the freezer until the blueberry layer is firm, at least 1 hour. Place the remaining blueberry ice cream and the remaining lemon ice cream in the freezer until ready to use.",
        "4. When ready to continue, let the blueberry and lemon ice creams soften for 5 minutes on the counter, then spread the remaining lemon ice cream over the firmed-up blueberry ice cream in the pan. Spread the remaining blueberry ice cream on top of the lemon. Sprinkle the cookie crumbs over the blueberry ice cream in an even layer, pressing them lightly into the ice cream. Cover the pan with plastic wrap and freeze until firm, at least 3 hours and up to 1 week.",
        "5. In a large bowl, using an electric mixer, whip the heavy cream with the confectioners' sugar and vanilla extract until it holds stiff peaks.",
        "6. Remove the pan from the freezer and gently tug the plastic wrap that lines the pan to loosen the cake. Place a serving platter over the pan and invert. Gently tap to release the cake. Slice and serve with whipped cream on the side."
    ],
    "ingredients": [
        "3 pints vanilla ice cream, slightly softened",
        "1 cup fresh blueberries, rinsed and picked over for stems",
        "1/4 cup freshly squeezed lemon juice",
        "1 tablespoon finely grated lemon zest",
        "24 vanilla creme sugar wafers, such as Nabisco Biscos, crushed",
        "3/4 cup heavy cream, chilled",
        "1 1/2 tablespoons confectioners' sugar",
        "1/2 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Berry",
        "Citrus",
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "No-Cook",
        "Fourth of July",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Blueberry",
        "Lemon",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon and Blueberry Ice Cream Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-blueberry-ice-cream-terrine-238750"
}
