{
    "directions": [
        "Preheat oven to 350°F. Fold 16-inch long piece of foil to 8x16-inch strip; place in 8x8x2-inch metal baking pan, leaving overhang on 2 sides. Repeat with another sheet of foil in opposite direction, lining pan completely. Butter foil.",
        "Place graham crackers in heavy-duty plastic bag. Using rolling pin or mallet, crush crackers finely. Melt butter in medium skillet over low heat. Remove from heat; add crumbs and toss to coat. Press crumbs evenly onto bottom of prepared pan. Bake crust until deep golden, about 12 minutes. Cool crust while preparing filling.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Beat in egg and sour cream, then lemon juice, lemon peel, and vanilla. Spread batter over crust.",
        "Bake cheesecake until slightly puffed and set in center, about 30 minutes; cool completely in pan on rack. Chill cheesecake until cold, at least 2 hours. DO AHEAD: Can be made 1 day ahead. Cover; keep chilled.",
        "Using foil overhang as aid, lift cheesecake from pan. Cut into 16 squares; arrange on platter. Top each square with berries. Chill until ready to serve, up to 3 hours. Serve chilled."
    ],
    "ingredients": [
        "9 whole graham crackers",
        "5 tablespoons butter",
        "1 8-ounce package cream cheese, room temperature",
        "1/3 cup sugar",
        "1 large egg",
        "3 tablespoons sour cream",
        "2 tablespoons fresh lemon juice",
        "2 teaspoons finely grated lemon peel",
        "1 teaspoon vanilla extract",
        "Fresh berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Berry",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Kid-Friendly",
        "Backyard BBQ",
        "Cream Cheese",
        "Summer",
        "Shower",
        "Chill",
        "Sour Cream",
        "Lemon Juice",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Cheesecake Squares with Fresh Berries",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cheesecake-squares-with-fresh-berries-353837"
}
