{
    "directions": [
        "Butter bottom (not sides) of 9-inch-diameter tart pan with removable bottom. Blend flour, sugar, grated lemon peel, and salt in processor. Add butter; blend until coarse meal forms. Add egg yolks; blend until moist clumps form. Gather dough into ball. Press onto bottom and up sides of prepared pan. Freeze crust until firm, about 15 minutes. DO AHEAD Crust can be made 2 days ahead. Cover; keep frozen.",
        "Preheat oven to 400°F. Bake crust 5 minutes. Press up sides with back of fork if falling. Continue to bake until golden, pressing up sides as needed, about 18 minutes longer. Cool completely. Maintain oven temperature.",
        "Whisk sugar, eggs, yolks, and lemon peel in heavy medium saucepan. Whisk in lemon juice and wine. Cook over medium heat until custard thickens and just begins to bubble, whisking constantly, about 5 minutes. Transfer to medium bowl. Cool to just warm, stirring occasionally, about 15 minutes. Gradually whisk in cream. Pour filling into crust. Bake tart until filling is set in center and begins to puff at edges, about 20 minutes. Cool in pan on rack. Refrigerate at least 2 hours and up to 6 hours."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "1/4 cup sugar",
        "1 teaspoon finely grated lemon peel",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 large egg yolks",
        "1/2 cup sugar",
        "2 large eggs",
        "2 large egg yolks",
        "1 tablespoon (packed) finely grated lemon peel",
        "1/3 cup fresh lemon juice",
        "2 tablespoons dry white wine (such as Sauvignon Blanc)",
        "3/4 cup heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cream-tart-238529"
}
