{
    "directions": [
        "Preheat an oven to 350°F (180°C).",
        "To make the crust, in a food processor, pulse the gingersnap cookies until fine crumbs form. Add the sugar and salt and pulse a few times to mix. Add the melted butter and pulse until well combined. Transfer the mixture to a 9-inch (23-cm) pie dish and spread evenly across the bottom and up the sides, pressing until compact.",
        "Bake until the crust is set, about 10 minutes. Let cool completely on a wire rack before filling.",
        "To make the filling, in a saucepan over medium-high heat, combine the eggs, egg yolks, sugar, cornstarch, lemon juice and salt. Cook, stirring constantly, until the mixture comes to a boil. Reduce the heat to medium and cook, stirring constantly, until thickened, 6 to 8 minutes. Pour the mixture through a fine-mesh sieve into a large bowl. Add the butter and stir until melted. Let cool to room temperature. Spread the lemon curd over the crust. Press plastic wrap directly onto the surface and refrigerate for at least 1 hour or up to overnight.",
        "To make the meringue, in the bowl of a stand mixer fitted with the whisk attachment, beat together the egg whites and cream of tartar on medium speed until foamy, about 2 minutes. Raise the speed to medium-high and slowly add the sugar. Beat until soft peaks form and the egg whites are shiny and glossy, about 3 minutes. Add the vanilla and beat until the egg whites hold stiff peaks, about 1 minute longer.",
        "Preheat the broiler. Place the pie dish on a baking sheet. Pipe or spread the meringue over the lemon curd filling so that it completely covers the pie, leaving no gaps between the crust and the meringue. Broil until the meringue is lightly toasted, about 5 minutes. Refrigerate for at least 2 hours or up to overnight before serving. Serves 8 to 10.",
        "Adapted from Williams Sonoma",
        "The Pie Cookbook",
        "(Weldon Owen, 2016)"
    ],
    "ingredients": [
        "For the crust:",
        "4 cups (8 oz./500 g) gingersnap cookies",
        "3 Tbs. sugar",
        "1 tsp. kosher salt",
        "1/2 cup (4 oz./125 g) unsalted butter, melted and cooled",
        "5 eggs plus 7 egg yolks",
        "1 1/2 cups (12 oz./375 g) sugar",
        "1/3 cup (1 1/2 oz./45 g) cornstarch",
        "1 1/2 cups (375 ml) fresh Meyer lemon juice",
        "1/2 tsp. kosher salt",
        "1/2 cup (4 oz./125 g) unsalted butter, cut into cubed",
        "5 egg whites",
        "1/4 tsp. cream of tartar",
        "1/2 cup (4 oz./125 g) sugar",
        "1/2 tsp. vanilla extract"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Lemon Meringue Pie with Gingersnap Crust",
    "url": "http://www.williams-sonoma.com/recipe/lemon-meringue-pie-with-gingersnap-crust.html"
}
