{
    "directions": [
        "Combine flour and salt in processor. Add butter; cut in, using on/off turns, until mixture resembles coarse meal. Add egg yolk and 3 tablespoons ice water. Process until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather into ball; flatten into disk. Wrap in plastic; chill 30 minutes. (Can be made 1 day ahead. Keep chilled.)",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12-inch round. Transfer dough to 9-inch-diameter tart pan with removable bottom. Fold in overhang and press, forming high-standing rim. Pierce all over with fork. Cover and freeze 20 minutes.",
        "Bake crust until deep golden, about 40 minutes. Transfer to rack; cool.",
        "Melt butter in heavy medium saucepan over medium heat. Whisk in 1 cup sugar and next 5 ingredients. Cook until mixture thickens, whisking constantly, about 10 minutes. Reduce heat to low and whisk 2 minutes longer. Pour hot filling into crust. Chill uncovered until filling is set, about 2 hours.",
        "Line small baking sheet with foil. Stir 2 tablespoons sugar and 4 teaspoons water in heavy small saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until pale golden, about 6 minutes. Add pistachios and stir to coat. Spread pistachios in single layer on prepared sheet. Cool completely. Coarsely chop pistachios. (Tart and pistachios can be made 1 day ahead. Cover tart; keep chilled. Store pistachios airtight at room temperature. Let tart stand at room temperature 20 minutes before serving.",
        "Sprinkle pistachios in 2-inch border around edge of tart. Cut tart into wedges."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1 large egg yolk",
        "3 tablespoons (or more) ice water",
        "1 cup (2 sticks) unsalted butter",
        "1 cup plus 2 tablespoons sugar",
        "1/3 cup fresh lemon juice",
        "3 large eggs",
        "3 large egg yolks",
        "1 tablespoon grated lemon peel",
        "1 1/2 teaspoons vanilla extract",
        "4 teaspoons water",
        "1/2 cup unsalted shelled pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Pistachio",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Pistachio Tart",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pistachio-tart-103354"
}
