{
    "directions": [
        "Cut off and discard top of each lemongrass stalk, leaving 6-inch stalk, then smash stalks with side of large heavy knife. Cut each stalk in half crosswise.",
        "In 8-quart stock pot over moderately high heat, combine all ingredients and 3 quarts cold water. Bring to simmer, skimming froth, then reduce heat to moderately low and gently simmer, uncovered, skimming froth occasionally, 45 minutes.",
        "Remove chicken, reserving for another use, then strain consommé through fine-mesh sieve into large bowl, discarding solids. If using consommé right away, skim off and discard any fat. If making ahead, cool consommé completely, uncovered, then chill, covered, and discard any solidified fat. (Consommé can be chilled up to 3 days or frozen 1 month.) Rewarm consommé before serving by bringing to gentle simmer in large pot over moderately high heat.)"
    ],
    "ingredients": [
        "4 stalks fresh lemongrass, root ends trimmed and 1 or 2 outer layers discarded",
        "1 (4-pound) whole chicken, cleaned and cut into 4 pieces",
        "2 stalks celery, trimmed and cut into 2-inch lengths",
        "1 leek (white and pale green parts only), cut into 2-inch lengths and washed well",
        "1 small white onion, peeled and quartered",
        "1 (2 1/2-inch-long) piece fresh ginger, peeled",
        "2 cloves garlic, peeled",
        "1 fresh or frozen kaffir lime leaf",
        "1 small whole dried red chile (such as chile de árbol)",
        "1 teaspoon whole black peppercorns",
        "2 teaspoons kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Appetizer",
        "Passover",
        "Dinner",
        "Kosher",
        "Kosher for Passover",
        "Lemongrass",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lemongrass Consommé",
    "url": "http://www.epicurious.com/recipes/food/views/lemongrass-consomme-242041"
}
