{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Remove the chicken giblets. Rinse the chicken inside and out. Remove any excess fat and leftover pinfeathers and pat the outside dry. Place the chicken in a large roasting pan. Liberally salt and pepper the inside of the chicken. Stuff the cavity with the thyme, reserving enough thyme to garnish the chicken dish, 1 lemon, halved, and 2 halves of the garlic. Brush the outside of the chicken with the butter and sprinkle again with salt and pepper. Tie the legs together with kitchen string and tuck the wing tips under the body of the chicken. Cut 2 of the lemons in quarters and scatter the quarters and remaining garlic around the chicken. Lay the bacon slices over the chicken to cover.",
        "Roast the chicken for 1 hour. Remove the bacon slices from the top of the chicken and set aside. Continue roasting the chicken for an additional 1/2 hour, or until the juices run clear when you cut between a leg and thigh. Remove to a platter and cover with aluminum foil while you prepare the gravy.",
        "Remove all but 2 tablespoons of the fat from the bottom of the pan. Add the wine and chicken stock and bring it to a boil. Reduce the heat, and simmer for 5 minutes, or until reduced by half.",
        "Slice the chicken on a platter. Garnish the chicken platter with the bacon slices, roasted garlic, reserved thyme and 1 lemon, sliced. Serve with the gravy."
    ],
    "ingredients": [
        "1 (5 to 6-pound) roasting chicken",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 large bunch fresh thyme",
        "4 lemons",
        "3 heads garlic, cut in 1/2 crosswise",
        "2 tablespoons butter, melted",
        "1/2 pound sliced bacon",
        "1 cup white wine",
        "1/2 cup chicken stock"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roasted Chicken",
        "Chicken",
        "Poultry Recipes",
        "Roasting",
        "American",
        "Roast Recipes",
        "Bacon Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Lemon and Garlic Roast Chicken",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/lemon-and-garlic-roast-chicken-recipe"
}
