{
    "directions": [
        "Using a knife, cut peel and white pith, end to end, from lemons. Juice enough flesh to measure ⅓ cup; reserve. Bring a large saucepan of water to a boil. Add peel; boil for 5 minutes. Drain; repeat 2 more times. Let peel cool; slice lengthwise into thin strips, then crosswise in half.",
        "In a small heavy saucepan over medium heat, stir sugar, reserved 1/3 cup lemon juice, and 1/4 cup water until sugar dissolves. Add peel, bring to a simmer, and cook until mixture is reduced to ⅔ cup and an instant-read thermometer reads 225°F about 10 minutes. DO AHEAD: Can be made up to 2 weeks ahead. Cover and chill.",
        "Pour 1/2 cup milk into a medium bowl; sprinkle gelatin over. Let sit until gelatin softens, about 15 minutes.",
        "Meanwhile, combine cream, sugar, lemon peel, and remaining 1/2 cup milk in a large saucepan. Scrape vanilla seeds from bean into saucepan; add bean. Bring to a simmer over medium heat, whisking until sugar dissolves. Remove from heat; cover and let steep for 10 minutes.",
        "Bring cream mixture back to a simmer. Add gelatin mixture and stir until dissolved. Strain. Divide among eight 3/4-cup ramekins. Chill uncovered until panna cotta is set, at least 6 hours. DO AHEAD: Can be made 2 days ahead. Cover and keep chilled.",
        "Using a small sharp knife, cut around edges of each panna cotta. Place a small serving plate atop each ramekin and invert, allowing panna cotta to settle onto plate. Serve with marmalade."
    ],
    "ingredients": [
        "3 large lemons",
        "3/4 cup sugar",
        "1 cup whole milk, divided",
        "2 teaspoons unflavored gelatin",
        "2 1/2 cups heavy whipping cream",
        "1/2 cup sugar",
        "Peel from 1 lemon (removed with a vegetable peeler)",
        "1 vanilla bean, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Dessert",
        "Cocktail Party",
        "Easter",
        "Mother's Day",
        "Lemon",
        "Birthday",
        "Shower",
        "Christmas Eve",
        "Engagement Party",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lemon Pannacotta with Lemon Marmalade",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-pannacotta-with-lemon-marmalade-365158"
}
