{
    "directions": [
        "On a lightly floured surface with a floured rolling pin roll out dough 1/8 inch thick (about a 12-inch round). Fit dough into a 9-inch (1-quart) glass pie plate and trim edge. Crimp edge of shell decoratively and with a fork prick bottom of shell in several places. Chill shell 30 minutes, or until firm.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven 25 minutes. Transfer shell to a rack and carefully remove weights or rice and foil. Cool shell.",
        "Increase temperature to 450°F. Finely grate enough zest from lemons to measure 1 tablespoon and squeeze enough juice from lemons to measure 3 tablespoons. Melt butter and cool. In a bowl with an electric mixer beat together eggs and sugar until thick and pale and on medium speed beat in butter, zest, lemon juice, and all remaining ingredients until combined. (Custard will be thin.) Pour custard into shell.",
        "Put pie in middle of oven and reduce temperature to 325°F. Bake pie until just set in center, 35 to 40 minutes, and cool completely on rack. Pie may be made 6 hours ahead and kept, uncovered, at cool room temperature.",
        "Serve pie at room temperature with whipped cream."
    ],
    "ingredients": [
        "pastry dough",
        "pie weights or raw rice for weighting shell",
        "2 lemons",
        "1/2 stick (1/4 cup) unsalted butter",
        "4 large eggs",
        "1 1/4 cups sugar",
        "1/4 cup unsulfured molasses",
        "1/4 cup heavy cream",
        "2 tablespoons yellow cornmeal",
        "1/8 teaspoon salt",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Cornmeal",
        "Winter",
        "Molasses",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Molasses Chess Pie",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-molasses-chess-pie-100577"
}
