{
    "directions": [
        "1. Center a rack in the oven and preheat the oven to 350°F (180°C). Butter and flour a 9 x 5 x 3-inch (22.5 x 12.5 x 7.5-cm) loaf pan, dust the interior with flour, and tap out the excess. Put the pan on an insulated baking sheet or on two stacked regular baking sheets and set aside.",
        "2. Sift the flour, baking powder, and salt together and keep close at hand. Toss the sugar and zest together in a large bowl and rub them together with your fingertips until the sugar is moist and aromatic. Whisk in the eggs, beating until the mixture is pale and foamy, then whisk in the crème fraîche and rum. Switch to a large rubber spatula and gently stir the sifted flour mixture into the batter in three or four additions—the batter should be thick and smooth. Finally, fold in the cooled melted butter in two or three additions.",
        "3. Immediately spoon the batter into the pan and slide the baking sheet(s) into the oven. Bake for 1 hour and 25 to 30 minutes, or until a thin knife inserted into the center of the cake comes out dry and free of crumbs. (Check the cake at the 40-minute mark. If it is browning quickly, cover it loosely with a foil tent for the remainder of the baking period.) Remove the cake from the oven and allow it to cool for about 10 minutes on a cooling rack before turning it out of the pan; invert and cool to room temperature right side up."
    ],
    "ingredients": [
        "2 1/4 cups (250 grams) cake flour, sifted",
        "3/4 teaspoon double-acting baking powder",
        "1/4 teaspoon salt",
        "1 1/2 cups (335 grams) sugar",
        "Grated zest of 3 lemons or 2 oranges",
        "5 large eggs, at room temperature",
        "2/3 cup (165 grams) crème fraîche, homemade or storebought, or heavy cream, at room temperature",
        "2 tablespoons (30 grams) dark rum (for the lemon cake) or Grand Marnier (for the orange cake)",
        "7 1/2 tablespoons (3 3/4 ounces; 110 grams) unsalted butter, melted and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Lemon",
        "Orange",
        "Winter",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon or Orange Cake (_Cake Citron ou Cake Orange_)",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-or-orange-cake-em-cake-citron-ou-cake-orange-em-355943"
}
