{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Grease twelve 4-ounce ramekins.",
        "Stir 1/2 pound blueberries and 1/2 cup white sugar together in a saucepan over medium heat until hot and bubbly, 5 to 10 minutes. Remove from heat and cool until slightly thickened.",
        "Melt the white chocolate and butter in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching; remove from heat.",
        "Beat 3 tablespoons white sugar, eggs, egg yolk, and vanilla bean seeds together in a bowl with an electric mixer on high speed until light and fluffy, about 8 minutes. Add lemon juice and beat until combined.",
        "Beat white chocolate mixture and flour into egg mixture on high speed until batter reaches a thick, mousse-like consistency, 4 to 6 minutes. Pour batter into prepared ramekins to fill about 3/4 full. Spoon 2 tablespoons blueberry mixture into the center of each ramekin, poking down blueberry filling into the batter. Place ramekins on a baking sheet.",
        "Bake cakes in the preheated oven until puffed, golden, and is hot in the blueberry center, 10 to 12 minutes. Remove cakes from oven and immediately flip each onto a plate to remove cake from ramekin.",
        "Stir 1/2 pound blueberries, 1/2 cup white sugar, and water together in a saucepan; bring to a simmer and cook, stirring occasionally, until sauce is reduced by half and has a syrupy consistency, 10 to 15 minutes. Pour sauce over warm cakes and dust each with confectioners' sugar."
    ],
    "ingredients": [
        "Blueberry Filling:",
        "1/2 pound fresh blueberries",
        "1/2 cup white sugar",
        "Cake:",
        "1/2 cup white chocolate chips",
        "1/4 cup unsalted butter",
        "3 tablespoons white sugar",
        "2 eggs",
        "1 egg yolk",
        "1/2 vanilla bean, split, seeds scraped out and reserved",
        "1/4 cup lemon juice",
        "3 tablespoons all-purpose flour",
        "Blueberry Sauce:",
        "1/2 pound fresh blueberries",
        "1/2 cup white sugar",
        "1/2 cup water",
        "2 tablespoons confectioners' sugar, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Blueberry Lava Cake",
    "url": "http://allrecipes.com/recipe/237862/lemon-blueberry-lava-cake/"
}
