{
    "directions": [
        "For the chicken: Mix together the olive oil, lemon zest and juice, cilantro, parsley, rosemary, thyme, oregano, salt, pepper and garlic in a 1-gallon ziptop bag. Add the chicken and massage the marinade into the meat until evenly coated. Seal the bag and place in the refrigerator. Let the chicken marinate at least 2 hours.",
        "For the apple, celery and snap pea slaw: In a small bowl, combine the olive oil, lemon juice, vinegar and agave. Season with salt and pepper.",
        "In a large bowl, combine the peas, cilantro, apples, celery, jalapeno and onion. Add the vinaigrette to the bowl and toss. Cover and refrigerate for about 30 minutes.",
        "Preheat a grill to high heat. Dip a wad of paper towels lightly in vegetable oil and, using tongs, carefully rub over the grates several times until glossy and coated. Grill the chicken until cooked through, 2 to 3 minutes per side.",
        "Serve the chicken with the slaw."
    ],
    "ingredients": [
        "1/3 cup extra-virgin olive oil",
        "1 tablespoon lemon zest plus 3 tablespoons lemon juice",
        "2 tablespoons finely chopped fresh cilantro",
        "2 tablespoons finely chopped fresh parsley",
        "1 teaspoon finely chopped fresh rosemary",
        "1 teaspoon finely chopped fresh thyme",
        "1/2 teaspoon finely chopped fresh oregano",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "3 cloves garlic, minced",
        "4 thinly sliced boneless, skinless chicken breast pieces (see Cook's Note)",
        "Vegetable oil, for oiling the grill grates",
        "1/4 cup olive oil",
        "1/4 cup lemon juice",
        "3 tablespoons white wine vinegar",
        "2 tablespoons agave nectar",
        "Salt and freshly ground black pepper",
        "1 cup sugar snap peas, cut in half",
        "1 cup fresh cilantro leaves, chopped",
        "3 green apples, cut into julienne",
        "3 stalks celery, chopped",
        "1 jalapeno, thinly sliced",
        "1 red onion, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Chicken",
        "Chicken",
        "Grilling",
        "Poultry Recipes",
        "Celery",
        "Vegetable",
        "Apple",
        "Fruit",
        "Main Dish Recipes"
    ],
    "title": "Lemon-Herb Grilled Chicken with Apple, Celery and Snap Pea Slaw",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/lemon-herb-grilled-chicken-with-apple-celery-and-snap-pea-slaw"
}
