{
    "directions": [
        "Butter and flour 10-inch-diameter springform pan. Combine flour, sugar, yeast, grated lemon peel, and 1/2 teaspoon salt in processor; blend 5 seconds. Add chilled butter and cut in, using on/off turns, until mixture resembles coarse meal. Add whole milk, egg yolks, and vanilla extract and blend until soft clumps form. Using floured hands, gather dough into ball. Press dough over bottom and 1 inch up sides of prepared pan. Cover pan tightly with plastic wrap. Let dough rise in warm draft-free area until slightly puffy, about 2 hours 15 minutes.",
        "Preheat oven to 350°F. Using electric mixer, beat cream cheese, sugar, and flour in large bowl until well blended. Beat in eggs 1 at a time. Add whipping cream, dark rum, grated lemon peel, and vanilla extract; beat until filling is smooth. Transfer filling to crust (filling may be higher in pan than sides of crust).",
        "Bake cheesecake until set in center and puffed at edges, about 40 minutes. Cool cheesecake in pan on rack 15 minutes. Cut around pan sides; release sides. Cool cheesecake completely. (Can be prepared 8 hours ahead. Let cheesecake stand at cool room temperature.)",
        "Cut cheesecake into wedges and serve with strawberry compote."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/4 cup sugar",
        "1 envelope dry yeast",
        "1 teaspoon grated lemon peel",
        "1/2 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup whole milk",
        "3 large egg yolks",
        "2 teaspoons vanilla extract",
        "1 1/2 8-ounce packages cream cheese, room temperature",
        "1 cup sugar",
        "1 tablespoon all purpose flour",
        "3 large eggs",
        "2/3 cup whipping cream",
        "2 tablespoons dark rum",
        "2 teaspoons grated lemon peel",
        "2 teaspoons vanilla extract",
        "Strawberry Compote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Dairy",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Strawberry",
        "Lemon",
        "Spring",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon and Rum Cheesecake with Strawberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-rum-cheesecake-with-strawberry-compote-106497"
}
