{
    "directions": [
        "1. Preheat the oven to 350°F",
        "2. In the bowl of an electric mixer fitted with the paddle attachment, beat the butter on medium speed. Add the salt, sugar, and vanilla, and continue to beat until light but not fluffy. Lower the speed and add the flour. Mix until just combined.",
        "3. Spread the dough into the bottom of an 8 by 8-inch pan, patting with your fingers and smoothing the top with an offset metal or rubber spatula if necessary.",
        "4. Bake until light golden brown around the edges, 18 to 20 minutes. Remove from the oven and let cool on a wire rack. Do not turn off the oven.",
        "Place the poppy seeds, sugar and 1/4 cup cold water in a small saucepan and bring to a boil over high heat. Let boil for 1 to 2 minutes, stirring occasionally, until the mixture is thick and glossy. Add the butter and stir until incorporated. Remove from the heat immediately and spread the poppy seed mixture evenly over the baked cookie crust. Set aside.",
        "1. Place 3/4 cup cold water and the cornstarch into a medium nonreactive saucepan and whisk to dissolve the cornstarch.",
        "2. Add the sugar and egg yolks and whisk to combine. Over medium heat, stirring constantly, bring the mixture to a boil and let boil for 2 minutes. Remove from the heat.",
        "3. Add the lemon juice, lemon zest, and butter. Whisk until smooth. Pour the lemon filling evenly over the poppy seed layer.",
        "1. Using a handheld mixer or in a the bowl of an electric mixer, whip the eggwhites on medium-high speed. When the whites peak softly, slowly add the sugar. Continue whipping until firm (but not stiff) peaks are formed.",
        "2. Fold in the cornstarch, and then the poppy seeds. Cover the lemon filling completely and dab the top to make attractive swirled points. Bake until the meringue browns, about 18 minutes. Cool and refrigerate until firm, at least 2 hours. Cut into 8 large bars."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) butter",
        "Pinch of salt",
        "1/4 cup sugar",
        "1/2 teaspoon vanilla extract",
        "1 cup flour",
        "1/2 cup poppy seeds, finely ground in a coffee grinder or blender, or crushed with the bottom of a heavy pan",
        "1/4 cup sugar",
        "2 tablespoons butter",
        "1/4 cup cornstarch",
        "1 cup sugar",
        "3 egg yolks",
        "3/4 cup freshly squeezed lemon juice",
        "Grated zest of 1 lemon",
        "2 tablespoons butter, softened",
        "3 egg whites",
        "1/3 cup sugar",
        "1 tablespoon cornstarch",
        "1 tablespoon poppy seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Mother's Day",
        "Lemon",
        "Chill",
        "Potluck",
        "Poppy",
        "Coffee Grinder",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Poppy Seed Bars",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-poppy-seed-bars-352430"
}
