{
    "directions": [
        "1. Preheat the oven to 350°F. Generously grease and flour a (9-inch) Bundt pan or line 36 muffin tins with paper liners.",
        "2. In a stand mixer fitted with the paddle attachment, combine the butter and sugar and beat on medium speed until the mixture is smooth and light in texture, about 5 minutes. While the butter is beating, sift together the flour, baking soda, and salt, and set aside. In a small bowl, combine the buttermilk, lemon zest, and 4 tablespoons of the lemon juice and set aside.",
        "3. Add the eggs to the butter-sugar mixture, one at a time, beating well and scraping down the bowl after each addition. In 3 additions, alternate adding the sifted dry ingredients and the wet ingredients to the butter-sugar mixture, stirring on low until just incorporated.",
        "4. Pour the batter into the prepared Bundt pan or fill each muffin cup two-thirds full with batter. Bake until the center of cake springs back when touched and a skewer inserted near the center comes out clean, 1 hour to 1 hour and 15 minutes. Bake cupcakes until they rise in a dome shape and spring back when lightly pressed with a fingertip, 16 to 20 minutes.",
        "5. Remove the cake from the oven and let cool completely in the pan on a wire rack. Release the sides and bottom of the cake from the pan with a narrow metal spatula or knife. Invert the pan and turn out the cake. Place a wire rack in a baking pan and set the cake, right side up, on the rack.",
        "6. In a small bowl, combine the confectioner's sugar, the remaining 1 tablespoon lemon juice, and 1 tablespoon cold water and stir until very smooth. Add a little more confectioners' sugar or water as necessary to achieve a glaze consistency (similar to that of honey). Spoon the glaze evenly over the cake. When the glaze has firmed, transfer the cake to a plate. Slice and serve at room temperature."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, plus more for greasing, at room temperature",
        "1 3/4 cups sugar",
        "2 2/3 cups all-purpose flour, plus more for dusting",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 1/4 cups buttermilk",
        "1 tablespoon lemon zest",
        "5 tablespoons lemon juice",
        "4 large eggs, at room temperature",
        "3/4 cup confectioners' sugar, plus more as needed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Shower",
        "Butter",
        "Buttermilk",
        "Lemon Juice",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Buttermilk Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-buttermilk-cake-51113420"
}
