{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Generously butter molds and put on a baking sheet.",
        "Whisk together flour, baking powder, zest, and salt.",
        "Beat together butter and sugar with an electric mixer at high speed until pale and fluffy, about 2 minutes. Beat in egg and vanilla until just incorporated. Add milk and beat until just combined (mixture will appear curdled). Reduce speed to low, then add flour mixture in 3 batches, beating until just combined after each addition.",
        "Divide batter among molds, filling each mold about two-thirds full. Bake until edges of cakes are golden and a wooden pick inserted in center of a cake comes out clean, about 25 minutes. Cool cakes in molds on a rack 5 minutes, then turn out onto rack and cool completely.",
        "While cakes cool, pulse 1/2 cup each of raspberries, blueberries, blackberries, and strawberries (all together) with 2 tablespoons superfine sugar in a food processor until fruit is just crushed. Chill, covered, up to 2 hours.",
        "Beat cream with remaining tablespoon superfine sugar using cleaned beaters at medium-high speed until it just forms soft peaks. Chill, covered, until ready to serve (but no longer than 2 hours).",
        "Arrange cakes upside down on 6 plates and top each with 2 rounded tablespoons whipped cream and 1 rounded tablespoon crushed berries. Scatter remaining whole berries over top and serve remaining crushed berries on the side."
    ],
    "ingredients": [
        "3/4 cup plus 2 tablespoons all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon finely grated fresh lemon zest",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/2 cup sugar",
        "1 large egg",
        "1/2 teaspoon vanilla",
        "1/2 cup whole milk",
        "1 cup raspberries (4 oz)",
        "1 cup blueberries (5 oz)",
        "1 cup blackberries (5 oz)",
        "1 cup strawberries (4 oz), sliced 1/4 inch thick",
        "3 tablespoons superfine granulated sugar",
        "1/2 cup chilled heavy cream",
        "Special equipment: 6 (5-oz) fluted brioche molds (4 inches across top) or a muffin tin with 6 (5- to 6-oz) muffin cups",
        "Garnish: white and red currants or other fresh berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Quick & Easy",
        "Backyard BBQ",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Sun Cakes with Berries and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-sun-cakes-with-berries-and-cream-232325"
}
