{
    "directions": [
        "Preheat oven to 325°F. Generously butter pan, then flour it, knocking out excess. Chill 10 minutes.",
        "Finely grind together fresh ginger and 1/4 cup sugar in a food processor (mixture will be wet).",
        "Whisk together flour, baking powder, ground ginger, and salt.",
        "Stir together milk and vanilla in a small bowl.",
        "Beat together butter, remaining 1/2 cup plus 2 tablespoons sugar, and zest in a large bowl with an electric mixer until fluffy. Add eggs 1 at a time, beating well after each addition.",
        "Alternately add flour and milk mixtures to butter and eggs in 4 batches, beginning with flour and mixing at low speed until each batch is just incorporated. Mix in ginger sugar until just combined, then lemon juice.",
        "Spoon batter into pan, smoothing top, and bake in middle of oven until golden brown on top and a tester inserted into center comes out clean, about 40 minutes (about 1 hour for loaf pan). Carefully loosen edges with a knife and immediately invert cake onto a rack to cool completely.",
        "Gradually add confectioners sugar to 1 tablespoon lemon juice, whisking until smooth and adding more juice, 1 drop at a time, if glaze is too thick. Drizzle decoratively over top of cake."
    ],
    "ingredients": [
        "3 tablespoons finely chopped peeled fresh ginger",
        "3/4 cup plus 2 tablespoons granulated sugar",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "1/4 cup whole milk",
        "1/2 teaspoon vanilla",
        "1 stick (1/2 cup) unsalted butter, softened",
        "2 tablespoons finely grated fresh lemon zest",
        "2 large eggs",
        "2 tablespoons fresh lemon juice",
        "1/2 cup confectioners sugar",
        "1 1/2 tablespoons fresh lemon juice",
        "Special equipment: a 4- to 5-cup nonstick bundt, kugelhopf, or loaf pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Citrus",
        "Ginger",
        "Dessert",
        "Bake",
        "Lemon",
        "Spring",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Ginger Pound Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-ginger-pound-cake-104905"
}
