{
    "directions": [
        "Into a bowl sift together flour, baking powder, and salt. In bowl of a standing electric mixer beat butter, shortening, and sugar until light and fluffy. Beat in eggs, 1 at a time, beating well after each addition, and beat in milk and vanilla (batter will appear curdled). With mixer on low speed beat in flour mixture, a little at a time, until it forms a dough. Halve dough and form each piece into a disk. Chill dough, wrapped in plastic wrap, until firm, about 3 hours.",
        "Cut twenty-four 6-inch squares of wax paper. Roll out 1 piece of dough between 2 sheets of plastic wrap into 12-inch round (about 1/8 inch thick). Cut out 6 rounds with a 5-inch round cutter, sandwiching each round between 2 squares of wax paper, and stack on a baking sheet. If dough becomes to soft to work with, transfer it to a baking sheet and chill until firm. Roll out and cut remaining piece of dough in same manner, sandwiching rounds between remaining squares of wax paper, and stack on baking sheet. Chill rounds until firm and wrap each stack carefully with plastic wrap to prevent drying. Dough may be made 1 day ahead and chilled.",
        "In a heavy saucepan whisk together sugar, cornstarch, and salt and gradually whisk in water and milk until cornstarch is dissolved. In a bowl whisk together yolks. Cook milk mixture over moderate heat, whisking, until it comes to a boil. Gradually whisk about 1/2 cup hot milk mixture into yolks and whisk yolk mixture into remaining hot milk mixture. Bring custard to a slow boil, whisking, 1 minute. Remove pan from heat and whisk in butter, lemon juice, and zest until butter is melted. Cover surface of filling with plastic wrap. Filling may be made 1 day ahead and chilled. Do not stir filling or it will break down.",
        "Preheat oven to 375°F. and lightly butter 2 baking sheets.",
        "Discard top square of wax paper from 1 dough round and spoon 1 tablespoon filling onto center of round. Using wax paper fold dough over to form a half circle, enclosing filling, and press edges together lightly. Transfer pie to baking sheet, discarding paper, and crimp edge with a fork. Prick pie with fork once. Make 11 more pies with remaining dough rounds and filling.",
        "Bake pies in 2 batches in middle of oven 15 minutes, or until golden brown around edges (dough will crack open slightly), and transfer to racks to cool. Pies may be made 4 hours ahead and chilled, covered. Serve pies chilled or at room temperature (do not let pies stand more than 30 minutes at room temperature)."
    ],
    "ingredients": [
        "5 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/4 cup vegetable shortening",
        "1 1/2 cups sugar",
        "2 large eggs",
        "2/3 cup milk",
        "1 teaspoon vanilla",
        "1/2 cup sugar",
        "2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1/2 cup water",
        "1/4 cup milk",
        "2 large egg yolks",
        "2 teaspoons unsalted butter",
        "1/4 cup fresh lemon juice",
        "1 teaspoon freshly grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Cajun Sweet Dough Pies",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-cajun-sweet-dough-pies-12398"
}
