{
    "directions": [
        "Preheat oven to 350°F. Butter and flour 9 x 5 x 2 1/2-inch metal loaf pan. Sift flour, salt and baking soda into medium bowl. Using electric mixer, beat 1 1/2 cups sugar and butter in large bowl until well blended. Add eggs 1 at a time, beating well after each addition. Mix in almond extract. Add dry ingredients to egg mixture alternately with buttermilk in 3 additions each, beating until well blended after each addition. Add ground almonds and lemon peel and beat 1 minute. Transfer batter to prepared pan.",
        "Bake cake until deep golden brown and cracked on top and tester inserted into center comes out clean, about 1 hour 25 minutes. Cool cake in pan on rack 15 minutes.",
        "Meanwhile, stir remaining 1/2 cup sugar and 5 tablespoons lemon juice in small bowl until sugar dissolves.",
        "Place rack on baking sheet. Turn cake out onto rack, top side up. Using skewer or toothpick, poke holes 1 to 2 inches apart all over cake. Brush top and sides of cake with all of lemon glaze, allowing some glaze to soak into cake before brushing with more. Cool cake completely. (Can be prepared 1 day ahead. Cover and store at room temperature.) Slice cake. Serve with Balsamic Strawberries."
    ],
    "ingredients": [
        "2 1/4 cups all purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking soda",
        "2 cups sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "3 large eggs",
        "1/4 teaspoon almond extract",
        "3/4 cup buttermilk",
        "3/4 cup ground almonds (from about 3 1/2 ounces whole almonds)",
        "1 tablespoon grated lemon peel",
        "5 tablespoons fresh lemon juice",
        "Balsamic Strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Vinegar",
        "Strawberry",
        "Lemon",
        "Almond",
        "Spring",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Almond Buttermilk Loaf with Balsamic Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-almond-buttermilk-loaf-with-balsamic-strawberries-101367"
}
