{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line a 12-cup muffin tin with paper liners.",
        "Mix flour, baking soda, and salt together in a bowl.",
        "Heat 5 tablespoons butter and milk together in a saucepan over low heat until butter is melted, 3 to 5 minutes. Remove from  heat.",
        "Beat white sugar, eggs, egg yolk, and 1 teaspoon vanilla extract together in a bowl using an electric hand mixer on low until mixture is smooth and thickened. Slowly pour flour mixture into sugar-egg mixture while mixing with the electric mixer until just incorporated. Slowly add butter-milk mixture; beat until just combined. Fold in 1/2 cup shredded coconut. Fill muffin cups with batter.",
        "Bake in the preheated oven until a toothpick inserted in the center of a cupcake comes out clean, about 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Beat softened butter and cream cheese together in a bowl using an electric mixer on medium. Gradually beat confectioners' sugar into creamed butter mixture on low until incorporated. Beat in 1/2 teaspoon vanilla extract and lemon zest until smooth and creamy. Spread frosting over cooled cupcakes; sprinkle about 1 teaspoon shredded coconut onto each cupcake."
    ],
    "ingredients": [
        "Cupcakes:",
        "1 1/4 cups all-purpose flour",
        "3/4 teaspoon baking soda",
        "1 pinch salt",
        "5 tablespoons butter, cut into chunks",
        "2/3 cup milk",
        "1 cup white sugar",
        "2 eggs",
        "1 egg yolk",
        "1 teaspoon vanilla extract",
        "1/2 cup shredded coconut",
        "Frosting:",
        "1/4 cup butter, softened",
        "4 ounces cream cheese, softened",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 teaspoon grated lemon zest",
        "1/4 cup shredded coconut, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lemon Coconut Cupcakes",
    "url": "http://allrecipes.com/recipe/232371/lemon-coconut-cupcakes/"
}
