{
    "directions": [
        "Preheat oven to 325°F. and generously butter and flour a madeleine pan (preferably non-stick), knocking out excess flour.",
        "In a bowl whisk together flour, baking powder, salt, zest, and thyme.",
        "In another bowl with an electric mixer beat together butter, lemon juice, and sugar until mixture is light and fluffy. Beat in eggs, 1 at a time, beating well after each addition, and add flour mixture, beating until just combined.",
        "Spoon some of batter into prepared madeleine molds and with a spatula smooth surfaces, scraping back and forth over molds and returning excess batter to bowl. (This will eliminate any air pockets and ensure that molds are not overfilled.) Wipe excess batter from edges of pan.",
        "Bake madeleines in middle of oven 20 to 25 minutes, or until edges are browned and tops are golden. Loosen edges and transfer madeleines to a rack set over a baking dish. Make more madeleines in pan, cleaned, buttered, and floured, with remaining batter in same manner.",
        "While first batch of madeleines is baking, in a small saucepan bring syrup ingredients to a boil, stirring, and remove from heat.",
        "Brush warm madeleines with some of hot syrup and repeat with remaining madeleines as they are baked, keeping syrup warm."
    ],
    "ingredients": [
        "2 cups cake flour (not self-rising)",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3 tablespoons plus 1 teaspoon freshly grated lemon zest (from about 7 large lemons)",
        "1 1/2 tablespoons finely chopped fresh thyme leaves",
        "2 sticks (1 cup) unsalted butter, softened",
        "2 teaspoons fresh lemon juice",
        "2 cups sugar",
        "6 large eggs",
        "1/4 cup water",
        "1/4 cup sugar",
        "1/4 cup lemon vodka",
        "1/4 cup fresh lemon juice",
        "2 teaspoons finely chopped fresh thyme leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Vodka",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Thyme",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Thyme Madeleines with Lemon Vodka Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-thyme-madeleines-with-lemon-vodka-syrup-10004"
}
