{
    "directions": [
        "Mix lemon juice, basil, oregano and garlic. Season chicken with salt and pepper. Heat oil over medium heat in a large skillet. Cook chicken 8 minutes; turn and cook 5 minutes more. Add lemon-juice mixture and stir up anything stuck to skillet. Reduce heat and cover; simmer until cooked through, about 6 minutes.",
        "Heat oven to 450°F. Toss all ingredients in a roasting pan and cover with foil. Cook 20 minutes. Remove foil; cook 20 minutes more, stirring once.",
        "Toast bread until very crisp, then rub each slice with 1 teaspoon garlic. Beat remaining 1 teaspoon garlic with anchovies, lemon juice, oil and salt with a fork in a salad bowl until well emulsified. Add lettuce; toss to evenly coat leaves. Grind black pepper over salad. Dice garlic toast and add croutons to salad. Toss again to mix well. Serve salad immediately."
    ],
    "ingredients": [
        "Juice of 2 lemons (about 1/3 cup)",
        "2 tablespoons chopped fresh basil or 2 teaspoons dried basil",
        "1 tablespoon chopped fresh oregano or 1 teaspoon dried oregano",
        "2 teaspoons chopped garlic",
        "4 boneless, skinless chicken breast halves (about 1 3/4 pounds)",
        "1 tablespoon plus 1 1/2 teaspoons olive oil",
        "14 ounces small red potatoes, quartered",
        "4 teaspoons olive oil",
        "1 tablespoon fresh rosemary or 1 teaspoon dried rosemary",
        "2 slices whole-wheat bread",
        "3 teaspoons chopped garlic",
        "1–2 anchovy fillets, sliced",
        "Juice of 1/2 lemon (about 2 tablespoons)",
        "2 tablespoons extra-virgin olive oil",
        "1/8 teaspoon salt",
        "8 romaine lettuce leaves, cut into bite-size pieces",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Herb",
        "Potato",
        "Poultry",
        "Vegetable",
        "Roast",
        "Dinner",
        "Root Vegetable",
        "Fall",
        "Winter",
        "Healthy",
        "Self",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Herb Chicken with Roasted Potatoes and Easy Caesar Salad",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-herb-chicken-with-roasted-potatoes-and-easy-caesar-salad-240523"
}
