{
    "directions": [
        "Preheat oven to 400°F. Place chickens on rack set in large roasting pan. Starting at each cavity end, slide hand between skin and breast meat to loosen, being careful not to tear skin. Arrange lemon slices under skin to cover breast meat.",
        "Season each cavity with 1 1/2 teaspoons salt and 1/2 teaspoon pepper. Stuff each with halved lemons, garlic, rosemary, and oregano.",
        "Flip wings of each chicken back and tuck under body. Using pastry brush, brush 3 tablespoons oil over skin of each chicken, then sprinkle each with 1 1/2 teaspoons salt and 1/2 teaspoon pepper. Tie legs together loosely with kitchen string.",
        "Roast chickens, basting with pan juices every 15 minutes, until skins are crisp golden-brown and juices run clear when thighs are pierced, about 55 to 60 minutes. (Instant-read thermometer inserted into thickest part of breast should register 170°F.) Remove from oven, then remove lemons, herbs, and garlic from cavities and discard. Reserve pan drippings. Transfer chickens to carving board and tent with foil to keep warm.",
        "In 2-quart pot of boiling water, blanch fresh fava beans 1 minute. Drain, then immediately transfer to medium bowl of ice water to stop cooking. Drain. Slip outer skin off each bean and discard skin; place beans in medium bowl. Add radishes, arugula, mint, parsley, celery leaves, and cheese, and toss to combine. Stir in lemon juice and remaining 2 tablespoons olive oil.",
        "Divide fava bean and radish salad among 10 plates. Carve chickens and arrange pieces atop each portion of salad. Spoon pan drippings over."
    ],
    "ingredients": [
        "2 (3- to 4-pound) roasting chickens, necks and giblets removed and discarded, rinsed and patted dry",
        "5 lemons, 2 cut into 1/4-inch-thick slices, 2 halved",
        "2 tablespoons kosher salt",
        "2 teaspoons freshly ground black pepper",
        "2 heads garlic, halved with skins left on",
        "2 sprigs fresh rosemary",
        "2 bunches fresh oregano",
        "8 tablespoons extra-virgin olive oil",
        "1 cup fresh fava beans*",
        "2 cups radishes, thinly sliced (from 2 bunches)",
        "2 cups loosely packed arugula leaves (from 2 bunches)",
        "1/2 cup loosely packed fresh mint leaves (from 1 bunch)",
        "1/2 cup loosely packed fresh flat-leaf parsley leaves (from 1 bunch)",
        "1/2 cup loosely packed celery leaves (from 2 bunches celery)",
        "1/2 cup Pecorino Toscano or other mild Italian sheep's milk cheese (less than 6 ounces), coarsely grated",
        "*If fresh fava beans are unavailable, fresh lima beans are a good substitute."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Chicken",
        "Citrus",
        "Dairy",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Poultry",
        "Vegetable",
        "Roast",
        "Lemon",
        "Legume",
        "Radish"
    ],
    "title": "Lemon- and Garlic-Roasted Chicken with Fava Beans, Radishes, and Pecorino",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-garlic-roasted-chicken-with-fava-beans-radishes-and-pecorino-237515"
}
