{
    "directions": [
        "Squeeze 2 lemon halves into a large bowl of cold water.",
        "Cut off top inch of 1 artichoke and bend back outer leaves until they snap off close to base (keep stem attached). Discard several more layers of leaves in same manner until you reach pale yellow leaves.",
        "Cut off remaining leaves 1/2 inch above top of artichoke base using a sharp knife, then pull out purple leaves and scoop out fuzzy choke with a melon-ball cutter. Trim dark green fibrous parts from base and side of artichoke.",
        "Trim a thin slice from stem end, then trim side of stem down to pale green inner core. Rub cut surfaces with lemon halves, then put artichokes in lemon water.",
        "Trim remaining artichokes in same manner.",
        "Combine lemon juice, water (3 cups), oil, 3 tablespoons mint, garlic, and 1 teaspoon salt in a 4-to 5-quarts heavy pot (wide enough to hold artichokes in 1 layer with stems pointing upward) and bring to a simmer.",
        "Stand artichokes, stem ends up, in liquid and cover with a round of parchment paper. Simmer, covered with parchment and lid, until just tender when artichoke bottom is pierced with a knife, 25 to 30 minutes.",
        "Transfer artichokes with a slotted spoon to a shallow serving dish. Boil cooking liquid until reduced to about 1/2 cup, about 20 minutes. During last 2 minutes of boiling, whisk liquid until it emulsifies. Pour over artichokes and sprinkle with remaining 2 tablespoons mint.",
        "Yarden Galilee\nCabernet Sauvignon '05"
    ],
    "ingredients": [
        "2 lemons, halved",
        "8 large artichokes with long stems",
        "1/4 cup fresh lemon juice",
        "3 cups water",
        "1/3 cup extra-virgin olive oil",
        "5 tablespoons chopped mint, divided",
        "3 garlic cloves, minced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Braise",
        "Passover",
        "Vegetarian",
        "Lemon",
        "Mint",
        "Artichoke",
        "Spring",
        "Healthy",
        "Kosher",
        "Vegan",
        "Kosher for Passover",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lemon Mint Braised Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-mint-braised-artichokes-352323"
}
