{
    "directions": [
        "Combine lemon juice, sugar and egg yolks in heavy medium saucepan. Whisk over medium heat until mixture thickens and just comes to boil, about 6 minutes. Transfer curd to medium bowl; set aside to cool. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 400°F. Using vegetable peeler, remove peel from lemon in strips. Squeeze 2 tablespoons juice from lemon; reserve juice. Place peel and 3 tablespoons sugar in processor. Blend until peel is finely ground. Add flour, cornmeal, baking powder,salt and baking soda; process to blend. Add butter; process until mixture resembles coarse meal. Add 6 tablespoons cream and 2 tablespoons lemon juice; process just until moist clumps form. Gather dough into ball; flatten into disk.",
        "Pat out dough on lightly floured surface to 3/4-inch-thick round. Using floured 2 1/2-inch-diameter cutter, cut out rounds. Gather scraps; pat out to 3/4-inch-thick round. Cut out enough additional rounds to equal a total of 6. Place on heavy large baking sheet. Brush with 2 tablespoons cream. Sprinkle with 2 tablespoons sugar.",
        "Bake biscuits until cooked through and golden, about 15 minutes. Transfer to plate. Cool. (Can be made 3 hours ahead. Let stand at room temperature.)",
        "Combine 1 1/2 cups blueberries, water, blueberry spread and sugar in heavy small saucepan. Stir gently over medium-high heat until mixture come to boil and berries begin to release juices, about 2 minutes. Remove from heat. Mix in 1 1/2 cups blueberries. Cool.",
        "Beat cream in medium bowl until stiff peaks form. Fold into curd in 2 additions. Cut biscuits horizontally in half. Place bottoms on 6 plates. Spoon some sauce, then lemon curd mixture over each. Place biscuit tops over. Garnish with 1/4 cup blueberries, and mint and lemon slices, if desired."
    ],
    "ingredients": [
        "7 tablespoons fresh lemon juice",
        "6 tablespoons sugar",
        "4 large egg yolks",
        "1 lemon",
        "5 tablespoons sugar",
        "1 1/4 cups all purpose flour",
        "1/4 cup yellow cornmeal",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "8 tablespoons chilled whipping cream",
        "3 1/4 cups blueberries (from about two 12-ounce baskets)",
        "6 tablespoons water",
        "3 tablespoons all-fruit blueberry spread",
        "1 tablespoon sugar",
        "2/3 cup chilled whipping cream",
        "Fresh mint sprigs (optional)",
        "Lemon slices (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Blueberry",
        "Lemon",
        "Cornmeal",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon and Blueberry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-and-blueberry-shortcakes-2257"
}
