{
    "directions": [
        "Preheat oven to 350°F. Toss bread and melted butter on large rimmed baking sheet to coat. Place bread in oven and toast until golden, tossing occasionally, about 15 minutes. Cool.",
        "Meanwhile, scrape seeds from vanilla bean into heavy medium saucepan; add bean. Add milk, cream, cardamom, star anise, and lemon peel to pan and bring to simmer. Remove from heat, cover, and let steep 30 minutes. Strain.",
        "Whisk eggs, sugar, and salt in large bowl. Gradually whisk milk mixture into egg mixture. Add bread and toss gently to combine. Cover and let stand at room temperature, stirring occasionally, at least 1 hour and up to 2 hours.",
        "Position rack in middle of oven and preheat to 350F. Butter 11x7x2-inch glass baking dish. Transfer bread mixture to prepared dish. Bake until just set, about 55 minutes. Cool pudding at least 10 minutes. Serve warm or at room temperature with sautéed peaches."
    ],
    "ingredients": [
        "6 cups 1-inch bread cubes from day-old rustic bread with crusts (about 11 ounces)",
        "5 tablespoons butter, melted",
        "1 vanilla bean, split lengthwise",
        "2 cups whole milk",
        "1 cup whipping cream",
        "4 cardamom pods, crushed",
        "2 whole star anise*",
        "1 1/2 teaspoons grated lemon peel",
        "3 large eggs",
        "1 1/4 cups sugar",
        "1 teaspoon salt",
        "Sautéed Peaches",
        "*Brown, star-shaped seedpods; available in the spice section of some supermarkets and at Asian markets and specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Lemon",
        "Spice",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon-Spice Bread Pudding with Sauteed Peaches",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-spice-bread-pudding-with-sauteed-peaches-235856"
}
