{
    "directions": [
        "Make 4 long 1/2-inch-deep cuts in lemon. Place in microwave-safe bowl. Cover and microwave on high 2 minutes. Place garlic head in medium microwave-safe bowl; add enough water to cover garlic. Cover bowl and microwave on high until soft, about 3 minutes. Transfer garlic to work surface; cool and peel.",
        "Pour any lemon juice from bowl into small cup. Cut lemon in half and squeeze juice into same cup; reserve juice for gravy. Scrape all fruit and pith from inside peel halves; discard insides. Chop peel. Blend peel and garlic in mini processor until finely chopped. Add butter and all remaining ingredients; process to blend. DO AHEAD: Can be made 2 days ahead. Transfer to bowl. Cover lemon juice and lemon-herb butter separately; chill. Bring butter to room temperature before using. WELL PRESERVED: The microwave method for the lemon is a neat trick. It's a two-minute way to make fresh-tasting Moroccan-style \"preserved\" lemons (which usually take from one week to one month to cure). TEST-KITCHEN TIP: Fennel fronds, those delicate, feathery, dark-green leaves rising from the fresh fennel bulb, are jampacked with fennel flavor. At the market, look for fennel bulbs that still have the fronds attached (you'll find that some bulbs have been too closely trimmed).",
        "Set rack at lowest position in oven and preheat to 325°F. Transfer 2 tablespoons lemon-herb butter to small bowl; reserve for gravy. Sprinkle main turkey cavity with salt and pepper and spread with 2 tablespoons lemon butter. Starting at neck end of turkey, carefully slide hand between skin and meat of breast, thighs, and upper drumsticks to loosen skin. Spread lemon butter over thigh and drumstick on both sides. Arrange a few lemon slices under skin. Spread remaining butter over breast meat; place lemon slices atop butter under skin. Fill main cavity with any remaining lemon slices, parsley and sage sprigs, and fennel fronds. Tie legs together loosely to hold shape. Tuck wing tips under.",
        "Place turkey on rack set in large roasting pan. Rub outside of turkey all over with oil; sprinkle with salt and pepper. Pour stock into pan. Roast turkey until thermometer inserted into thickest part of thigh registers 165°F to 170°F, about 3 hours. Tilt turkey so juices from main cavity run into pan. Transfer turkey to platter. Tent very loosely with foil; let rest at least 30 minutes (internal temperature will rise 5 to 10 degrees). Reserve pan.",
        "Scrape juices and browned bits from reserved roasting pan into large glass measuring cup. Spoon off fat, reserving 2 tablespoons. Add enough stock to juices to measure 1 2/3 cups.",
        "Heat reserved 2 tablespoons fat in heavy large saucepan over medium-high heat. Add garlic and shallot; sauté 2 minutes. Add flour; whisk until golden, about 4 minutes. Add degreased pan juices and 2 cups stock. Bring to boil, whisking until smooth. Reduce heat and simmer until gravy is reduced to desired consistency, about 4 minutes. Whisk in 2 tablespoons reserved lemon butter, 2 tablespoons reserved lemon juice, lemon peel, and sugar, then herbs. Whisk in crème fraîche, if desired. Season to taste with salt and pepper.",
        "*Available at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 large lemon",
        "1 small head of garlic",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1/4 cup chopped fresh Italian parsley",
        "3 tablespoons chopped fresh fennel fronds",
        "1 small shallot, chopped",
        "1 tablespoon chopped fresh sage",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "1 large pinch of powdered saffron or saffron threads",
        "1 14- to 16-pound turkey, rinsed, patted dry inside and out; neck, heart, and gizzard reserved for Shortcut Turkey Stock",
        "3 lemons, cut into 1/8-inch-thick slices",
        "10 fresh Italian parsley sprigs",
        "6 fresh sage sprigs",
        "6 fresh fennel fronds",
        "2 tablespoons olive oil",
        "2 cups Shortcut Turkey Stock or water",
        "2 cups (or more) Shortcut Turkey Stock",
        "3 garlic cloves, chopped",
        "1 small shallot, chopped",
        "1/4 cup all purpose flour",
        "1 teaspoon finely grated lemon peel",
        "1/2 teaspoon sugar",
        "1/4 cup chopped fresh Italian parsley",
        "1 tablespoon chopped fennel fronds",
        "2 teaspoons chopped fresh sage",
        "1/2 cup crème fraîche* (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Garlic",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Lemon",
        "Sage"
    ],
    "title": "Lemon-Herb Turkey with Lemon-Garlic Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-herb-turkey-with-lemon-garlic-gravy-240378"
}
