{
    "directions": [
        "Preheat the oven to 350 degrees F. Grease and flour 2 (8 1/2 by 4 1/4 by 2 1/2-inch) loaf pans. You may also line the bottom with parchment paper, if desired.",
        "Cream the butter and 2 cups granulated sugar in the bowl of an electric mixer fitted with the paddle attachment, until light and fluffy, about 5 minutes. With the mixer on medium speed, add the eggs, 1 at a time, and the lemon zest.",
        "Sift together the flour, baking powder, baking soda, and salt in a bowl. In another bowl, combine 1/4 cup lemon juice, the buttermilk, and vanilla. Add the flour and buttermilk mixtures alternately to the batter, beginning and ending with the flour. Divide the batter evenly between the pans, smooth the tops, and bake for 45 minutes to 1 hour, until a cake tester comes out clean.",
        "Combine 1/2 cup granulated sugar with 1/2 cup lemon juice in a small saucepan and cook over low heat until the sugar dissolves. When the cakes are done, allow to cool for 10 minutes. Remove the cakes from the pans and set them on a rack set over a tray or sheet pan; spoon the lemon syrup over them. Allow the cakes to cool completely.",
        "For the glaze, combine the confectioners' sugar and the lemon juice in a bowl, mixing with a wire whisk until smooth. Pour over the tops of the cakes and allow the glaze to drizzle down the sides."
    ],
    "ingredients": [
        "1/2 pound (2 sticks) unsalted butter, at room temperature",
        "2 1/2 cups granulated sugar, divided",
        "4 extra-large eggs, at room temperature",
        "1/3 cup grated lemon zest (6 to 8 large lemons)",
        "3 cups flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "3/4 cup freshly squeezed lemon juice, divided",
        "3/4 cup buttermilk, at room temperature",
        "1 teaspoon pure vanilla extract",
        "2 cups confectioners' sugar, sifted",
        "3 1/2 tablespoons freshly squeezed lemon juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Healthy",
        "Mixer Recipes",
        "Cake",
        "Fruit",
        "Lemon Recipes",
        "Low Sodium"
    ],
    "title": "Lemon Cake",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/lemon-cake-recipe"
}
