{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Brush cake pans with canola oil. Line bottom of each pan with a round of parchment or wax paper, then oil paper.",
        "Whisk together flour mix, salt, baking powder, and xanthan gum until combined well. Stir together milk, canola oil (1 cup), vanilla, and zest in another bowl.",
        "Beat together sugar and eggs in a large bowl with an electric mixer at medium speed just until combined, about 1 minute. Reduce speed to low and add flour and milk mixtures alternately in batches, beginning and ending with flour mixture and mixing until just combined.",
        "Divide batter evenly between cake pans, smoothing tops, and bake until a wooden pick or skewer inserted in center of each cake layer comes out clean, 35 to 40 minutes.",
        "Cool cake layers in pans on racks 10 minutes. Run a thin knife around edge of 1 cake layer and invert rack over cake pan, then invert cake onto rack. Repeat with second layer. Peel off paper and cool layers completely.",
        "Whisk together zest, lemon juice, sugar, yolks, a pinch of salt, and guar gum in a 1-quart heavy saucepan. Add butter and cook over moderately low heat, whisking constantly, until curd is thick enough to hold marks of whisk and first bubbles appear on surface, about 5 minutes. Whisk in extract. Immediately pour curd into a bowl, then cover surface with wax paper and chill until cold, about 30 minutes.",
        "Beat butter with an electric mixer at high speed until light and fluffy, about 1 minute. Reduce speed to low and add confectioners sugar, lemon juice, extract, and zest, then mix until creamy and smooth, about 2 minutes.",
        "Halve each cake layer horizontally using a long serrated knife. Spread bottom half of each cake layer with half of lemon curd, then top with remaining cake layers to form two sandwiched cakes. Put 1 sandwiched cake on a cake stand or platter and spread a heaping 1/2 cup frosting over top, then cover with remaining sandwiched cake. Frost top and sides of cake with remaining frosting."
    ],
    "ingredients": [
        "1 cup canola oil, plus additional for greasing cake pans",
        "2 1/2 cups brown-rice flour mix",
        "1/2 teaspoon salt",
        "1 tablespoon baking powder",
        "1 teaspoon xanthan gum",
        "1 cup milk",
        "1 teaspoon vanilla",
        "1 tablespoon finely grated fresh lemon zest",
        "2 cups granulated sugar",
        "4 large eggs",
        "2 teaspoons finely grated fresh lemon zest",
        "1/4 cup fresh lemon juice",
        "1/4 cup plus 2 tablespoons granulated sugar",
        "3 large egg yolks",
        "1/4 teaspoon guar gum",
        "1/2 stick (1/4 cup) unsalted butter, cut into tablespoon pieces",
        "1/4 teaspoon lemon extract",
        "2 sticks (1 cup) unsalted butter, softened",
        "3 1/2 cups confectioners sugar",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon lemon extract",
        "2 teaspoons finely grated fresh lemon zest",
        "Special equipment: 2 (9- by 2-inch) round cake pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Wedding",
        "Lemon",
        "Gourmet"
    ],
    "title": "Lemon Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-layer-cake-233013"
}
