{
    "directions": [
        "1 Set a rack in the middle level of the oven and preheat to 300 degrees.",
        "2 Combine the milk and sugar in a medium saucepan and whisk several times to mix. Bring the mixture to a boil over low to medium heat.",
        "3 Use a vegetable peeler to remove just the yellow zest from the lemons in large strips. Do not include any of the white pith beneath the zest, which would impart a bitter flavor.",
        "4 When the milk boils, remove it from the heat, add the lemon zest and cinnamon stick, and allow to steep for 5 minutes.",
        "5 Combine the eggs and vanilla in a mixing bowl and whisk well, but not so quickly that the eggs become foamy. Strain the milk mixture into a lipped container, such as a 4-cup measure, to remove the strips of zest and the cinnamon stick.",
        "6 Pour the milk into the egg mixture in a thin stream, whisking constantly but not quickly to avoid creating too much foam.",
        "7 After the milk has been added, let the mixture rest for 5 minutes, then use a ladle or large kitchen spoon to remove any foam from the surface. Pour the mixture into the lipped container and fill the molds almost to the top.",
        "8 Place the pan of molds on the oven rack and immediately pour 3 to 4 cups of warm water into the pan around the molds so that the water comes about halfway up the side of each mold. If the molds fit tightly in the pan, it may be necessary to remove one temporarily to have room to pour in the water.",
        "9 Bake the custards for about an hour, or until they are completely set and no longer wobbly in the center.",
        "10 Remove the pan from the oven and place it on a rack for 10 minutes to cool. Then remove the molds from the pan and cool them completely to room temperature. Individually wrap each mold in plastic and chill until you intend to serve them.",
        "Serve the custards in the molds or unmold them to dessert plates. To unmold, insert the point of a paring knife about 1/4 inch deep between the mold and the custard. Run the knife all around the inside of the mold to loosen the top. Using your fingertips, ease the top of the custard to one side, letting some air into the space you create between the custard and the mold. Invert a dessert plate on the mold, then invert it again. Holding both the mold and plate firmly with both hands, quickly raise and lower the stack to unmold the custard. If it does not emerge easily from the mold, repeat the motion several times. Top each custard with a couple of spoonfuls of the raspberry sauce.",
        "Keep refrigerated at all times. You may prepare these custards a day or two in advance, but don't keep them more than 3 days total."
    ],
    "ingredients": [
        "1 quart whole milk",
        "2/3 cup sugar",
        "3 large lemons",
        "1-inch piece cinnamon stick",
        "6 large eggs",
        "2 teaspoons vanilla extract",
        "1 recipe Cooked Raspberry Sauce",
        "Eight 4-ounce ramekins or custard cups, set in a small roasting pan or any pan about 2 inches deep"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Valentine's Day",
        "Low/No Sugar",
        "Lemon",
        "Chill",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lemon Custard with Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lemon-custard-with-raspberry-sauce-51201810"
}
