{
    "directions": [
        "In a large bowl, cover the lentils with boiling water and allow to sit for 15 minutes. Drain.",
        "In a large stockpot over medium heat, heat the olive oil and saute the onions, leeks, garlic, salt, pepper, thyme, and cumin for 20 minutes, or until the vegetables are translucent and tender. Add the celery and carrots and saute for another 10 minutes. Add the chicken stock, tomato paste, and drained lentils, cover, and bring to a boil. Reduce the heat and simmer uncovered for 1 hour, or until the lentils are cooked through and tender. Check the seasonings. Add the kielbasa and red wine and simmer until the kielbasa is hot. Serve drizzled with olive oil and sprinkled with grated Parmesan.",
        "Place the chickens, onions, carrots, celery, parsnips, parsley, thyme, dill, garlic, salt, and peppercorns in a 16 to 20-quart stockpot with 7 quarts of water and bring to a boil. Skim the surface as needed. Simmer uncovered for 4 hours. Strain the entire contents of the pot through a colander, discarding the chicken and vegetables, and chill. Discard the hardened fat, and then pack the broth in quart containers.",
        "Yield: 6 quarts"
    ],
    "ingredients": [
        "1 pound French green lentils (recommended: du Puy)",
        "1/4 cup olive oil, plus extra for serving",
        "4 cups diced yellow onions (3 large)",
        "4 cups chopped leeks, white and light green parts only (2 leeks)",
        "1 tablespoon minced garlic (2 large cloves)",
        "1 tablespoon kosher salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 tablespoon minced fresh thyme leaves",
        "1 teaspoon ground cumin",
        "3 cups medium diced celery (8 stalks)",
        "3 cups medium diced carrots (4 to 6 carrots)",
        "3 quarts Homemade Chicken Stock, recipe follows, or canned broth",
        "1/4 cup tomato paste",
        "1 pound kielbasa, cut in 1/2 lengthwise and sliced 1/3-inch thick",
        "2 tablespoons dry red wine or red wine vinegar",
        "Freshly grated Parmesan, for serving",
        "3 (5-pound) chickens",
        "3 large onions, unpeeled and quartered",
        "6 carrots, unpeeled and halved",
        "4 celery stalks with leaves, cut in thirds",
        "4 parsnips, unpeeled and cut in 1/2, optional",
        "20 sprigs fresh flat-leaf parsley",
        "15 sprigs fresh thyme",
        "20 sprigs fresh dill",
        "1 head garlic, unpeeled and cut in 1/2 crosswise",
        "2 tablespoons kosher salt",
        "2 teaspoons whole black peppercorns"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Tomato Soup",
        "Vegetable Soup",
        "Soup",
        "Tomato",
        "Vegetable",
        "Leek Recipes",
        "Beans and Legumes",
        "Lentil Recipes",
        "Sausage Recipes",
        "Winter",
        "Sauteing Recipes"
    ],
    "title": "Lentil Sausage Soup",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/lentil-sausage-soup-recipe"
}
