{
    "directions": [
        "Pulse onion, fennel, carrots, and chopped garlic in a food processor until soffritto is finely chopped. Heat 1/4 cup oil in a large pot over medium. Add soffritto, season with salt, and cook, stirring occasionally, until soft, 10–12 minutes. Stir in tomato paste and cook, stirring occasionally and adding a splash of water if mixture is browning too quickly, until golden brown and very soft (it will look almost like a purée), 10–12 minutes. Add lentils and 6 cups water. Lay Parmesan rind on top (it may stick if it falls to the bottom). Bring mixture to a boil, reduce heat, and simmer until lentils are tender, 35–45 minutes, depending on type. Taste and season with more salt.",
        "Meanwhile, place spinach in a glass bowl and add a splash of water and a pinch of salt. Microwave on high until bright green and slightly wilted, about 1 minute. Squeeze firmly to expel excess water, then cut in half. (If you don’t have a microwave, add the spinach directly to the pot and let it wilt slightly before making divots for eggs.) Thin stew with water by 1/4-cupfuls if needed to loosen. Scatter wilted spinach across the top.",
        "Using the back of a spoon, create 4 divots in surface of stew and drop an egg into each. Cover pot and simmer stew very gently just until eggs are set, 8–12 minutes.",
        "While the eggs are cooking, heat a small saucepan over medium-high; pour in oil to come 1/4\" up sides. Working one at a time, fry slices of bread, turning once and adding more oil as needed, until golden brown and crisp, about 1 minute per side for each slice. Season lightly with salt and rub with garlic clove.",
        "Carefully divide stew and eggs among bowls, add a splash of vinegar to each, and top with Pecorino. Serve with fried bread.",
        "Stew (without eggs and spinach) can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "1 fennel bulb, chopped",
        "3 medium carrots, peeled, chopped",
        "6 garlic cloves, 5 finely chopped, 1 whole",
        "1/4 cup olive oil, plus more for frying",
        "Kosher salt",
        "1 tablespoon tomato paste",
        "2 cups French or black beluga lentils",
        "1 (3x2-inch) piece Parmesan rind",
        "1 bunch large spinach, tough stems trimmed",
        "4 large eggs",
        "4 large slices country-style bread",
        "Red wine vinegar and grated Pecorino (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lentil",
        "Stew",
        "Egg",
        "Spinach",
        "Healthy",
        "Vegetarian",
        "Parmesan",
        "Soup/Stew",
        "Dinner",
        "Winter",
        "Bread"
    ],
    "title": "Lentil and Egg Stew",
    "url": "http://www.epicurious.com/recipes/food/views/lentil-and-egg-stew"
}
