{
    "directions": [
        "Bring 3 cups water and bay leaf to a boil in a 2- to 3-quart saucepan, then add lentils and simmer, uncovered, 2 minutes. Remove pan from heat and let lentils soak 1 hour. Drain lentils in a colander.",
        "Cook pork fat in a 6-quart heavy pot over moderate heat, stirring occasionally, until deep golden and some fat is rendered, 6 to 8 minutes, then discard solids. (If using bacon, transfer with a slotted spoon to paper towels to drain and reserve for garnish.)",
        "Add oil to fat in pot and heat over moderately high heat until hot but not smoking, then fry bread, turning once, until golden, about 1 minute total. Transfer toasts to paper towels to drain and lightly season with salt. Add potatoes to fat in pot and sauté, stirring, until golden, 7 to 8 minutes. Transfer with a slotted spoon to fresh paper towels to drain.",
        "Add onion and garlic to pot and sauté, stirring, until golden, 6 to 8 minutes. Stir in lentils, tomatoes with their juice, sugar, salt, pepper, and remaining 5 cups water and simmer, uncovered, stirring occasionally, until lentils are just tender and stew is thickened, 40 to 45 minutes. Discard bay leaf and stir in potatoes, basil, oregano, and salt and pepper to taste. Thin stew with water if desired, then serve over toasts or with toasts on the side. Sprinkle with bacon if using.",
        "*Available at specialty foods shops and natural foods stores."
    ],
    "ingredients": [
        "8 cups cold water",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 lb small Italian lentils (1 1/8 cups; preferably from Abruzzo) or small French lentils*, picked over",
        "2 oz fresh pork fat (from butcher), chopped, or 3 bacon slices, chopped (1/2 cup)",
        "3 tablespoons olive oil",
        "4 slices Italian bread (1/2 inch thick and about 3 inches in diameter), toasted",
        "1/2 lb boiling potatoes (2 medium), peeled and cut into 1/4-inch dice",
        "1 large onion, finely chopped",
        "2 large garlic cloves, finely chopped",
        "1 (14- to 15-oz) can whole tomatoes in juice, finely chopped and juice reserved",
        "1 teaspoon sugar",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "3 tablespoons chopped fresh basil",
        "1 tablespoon finely chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Potato",
        "Tomato",
        "Side",
        "Basil",
        "Lentil",
        "Winter",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lentils San Stefano",
    "url": "http://www.epicurious.com/recipes/food/views/lentils-san-stefano-230456"
}
