{
    "directions": [
        "Heat oil in large saucepan over medium-high heat. Add onion and sauté until golden, about 12 minutes. Add garlic, anchovies, jalapeños, turmeric, and saffron. Stir until fragrant, about 1 minute. Mix in tomatoes. Reduce heat to medium-low; simmer until sauce thickens, stirring occasionally, about 15 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cover; refrigerate.)",
        "Heat 3 tablespoons oil in medium saucepan over medium-high heat. Add onion and sauté until brown, about 8 minutes. Add carrot, celery, and garlic; sauté until vegetables begin to color, about 5 minutes. Add lentils, jalapeños, and paprika; stir to coat. Add broth and vinegar and bring to boil. Cover, reduce heat to medium, and simmer until lentils are almost tender, about 1 hour. Uncover and cook until all broth is absorbed, about 25 minutes longer. Season lentil mixture with salt and pepper. Using potato masher, mash mixture coarsely. Transfer filling to medium bowl and chill until cold, about 30 minutes.",
        "Line 2 large baking sheets with foil or parchment paper. Working with 2 wonton wrappers at a time, brush each with egg white. Place 1 tablespoon filling in center of 1 wrapper. Top with second wrapper, egg white side down, and seal, pressing out any air. Cut into round with fluted pastry wheel or 2 3/4-inch-diameter scalloped cookie cutter, if desired. Place on prepared sheet. Repeat with remaining wrappers and filling. (Can be made 1 day ahead. Cover tightly and refrigerate.)",
        "Place flour in 1 small bowl, egg in second small bowl, and breadcrumbs in third small bowl. Dip sausage pieces into flour, then egg, then crumbs to coat. Place on large plate. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 250°F. Heat 1/4 cup vegetable oil in heavy large skillet over medium heat. Add sausages. Sauté until golden, about 4 minutes per side. Place on baking sheet; keep warm in oven.",
        "Bring large pot of generously salted water to boil. Cook 1/3 of ravioli until just tender but still firm to bite, about 5 minutes. Using slotted spoon, divide ravioli between 2 shallow bowls; tent with foil to keep warm. Repeat with remaining ravioli in 2 more batches. Rewarm sauce; spoon around ravioli. Top with sausage."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "1 large onion, chopped",
        "4 garlic cloves, chopped",
        "2 anchovy fillets, finely chopped",
        "1 1/2 tablespoons chopped jalapeño chiles with seeds",
        "1/4 teaspoon (generous) turmeric",
        "1 large pinch of saffron threads",
        "1 1/2 pounds yellow tomatoes, cored, diced (about 3 1/2 cups)",
        "3 tablespoons vegetable oil",
        "1/2 cup finely chopped onion",
        "1/4 cup chopped carrot",
        "1/4 cup chopped celery",
        "2 garlic cloves, chopped",
        "1 cup dried French green lentils",
        "2 tablespoons chopped seeded jalapeño chiles",
        "1 teaspoon Hungarian hot paprika",
        "2 3/4 cups low-salt chicken broth",
        "1 tablespoon Sherry wine vinegar",
        "72 (about) wonton wrappers (from two 12-ounce packages)",
        "2 egg whites, beaten to blend",
        "2/3 cup all purpose flour",
        "1 large egg, beaten to blend",
        "1 1/3 cups fresh breadcrumbs",
        "1 pound fully cooked smoked sausages (such as cotechino, linguiça, or andouille), cut into 1/3-inch-thick slices",
        "1/4 cup vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "Sausage",
        "Lentil",
        "Fall",
        "Jalapeño"
    ],
    "title": "Lentil Ravioli with Sausage and Yellow Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lentil-ravioli-with-sausage-and-yellow-tomato-sauce-108570"
}
