{
    "directions": [
        "Kefir sauce: Stir kefir, honey, and salt in a small bowl; cover and chill.",
        "Toast seeds in a dry small skillet over medium-high, tossing occasionally, until fragrant and coriander seeds start to pop, about 3 minutes. Let cool; finely grind in spice mill.",
        "Purée spice mix, watercress, broth, and salt in a blender until smooth. Cover and chill until ready to use.",
        "Toast caraway in a dry large skillet over medium-high, tossing, until fragrant, about 30 seconds. Let cool; finely grind in spice mill.",
        "Cook scallions in same skillet, turning occasionally, until charred, 5 minutes. Let cool, then coarsely chop. Reserve skillet.",
        "Process caraway, scallions, chile, garlic, bread, ricotta, lentils, broth, onion powder, paprika, and 1 1/2 teaspoons salt in a food processor to a paste (some larger pieces of lentils should still be visible). Form into 12 balls.",
        "Pour oil into a large heavy skillet to a depth of 1/2\" and heat over medium-high until oil bubbles immediately when a pinch of lentil mixture is added. Working in batches if needed, cook croquettes until deep golden brown and crisp, about 2 minutes per side. Drain on paper towels; season with salt.",
        "Swirl both sauces in bowls; top with croquettes. Drizzle with pomegranate molasses and finish with watercress.",
        "Do ahead: Croquettes can be formed 1 day ahead. Cover and chill. Bring to room temperature before frying."
    ],
    "ingredients": [
        "1 cup kefir (cultured milk)",
        "1 1/2 teaspoons honey",
        "1 teaspoon kosher salt",
        "1 teaspoon caraway seeds",
        "1 teaspoon coriander seeds",
        "2 cups (lightly packed) trimmed watercress leaves",
        "1/2 cup low-sodium vegetable broth",
        "1/2 teaspoon kosher salt",
        "1 teaspoon caraway seeds",
        "4 scallions, white and pale-green parts only",
        "1 serrano chile, seeded, chopped",
        "3 garlic cloves, chopped",
        "4 ounces pumpernickel bread, torn into small pieces",
        "2 ounces ricotta",
        "1 cup sprouted lentils",
        "1/4 cup low-sodium vegetable broth",
        "1 tablespoon onion powder",
        "1 teaspoon paprika",
        "1 1/2 teaspoons kosher salt, plus more",
        "Vegetable oil (for frying; about 3 cups)",
        "Pomegranate molasses and watercress leaves (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Yogurt",
        "Low Sodium",
        "Dinner",
        "Lunch",
        "Ricotta",
        "Lentil",
        "Healthy",
        "Low Cholesterol",
        "Coriander",
        "Caraway",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lentil Croquettes with Watercress and Kefir",
    "url": "http://www.epicurious.com/recipes/food/views/lentil-croquettes-with-watercress-and-kefir-56389365"
}
