{
    "directions": [
        "Heat 3 tablespoons of olive oil in a large pot over medium-high heat. Stir in the onion and garlic, and cook until the onion has turned golden brown, about 5 minutes. Stir in the tomato paste, cumin, kosher salt, black pepper, and 1/8 teaspoon of chili powder. Cook and stir 2 minutes more until the spices are fragrant.",
        "Stir in the chicken broth, lentils, and carrot. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the lentils are soft, about 30 minutes.",
        "Pour half of the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot. Do not puree all of the soup, leave it a little chunky.",
        "Stir in the lemon juice and cilantro, then season to taste with salt. Drizzle with olive oil and a sprinkle of chili powder to serve."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "2 cloves garlic, minced",
        "1 tablespoon tomato paste",
        "1 teaspoon ground cumin",
        "1/4 teaspoon kosher salt, or to taste",
        "1/4 teaspoon freshly ground black pepper",
        "1/8 teaspoon chili powder, or to taste",
        "1 (32 ounce) carton chicken broth",
        "1 cup red lentils",
        "1 large carrot, diced",
        "2 tablespoons lemon juice, or to taste",
        "3 tablespoons chopped fresh cilantro",
        "4 teaspoons extra-virgin olive oil for drizzling",
        "1 pinch chili powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lentil Soup with Lemon",
    "url": "http://allrecipes.com/recipe/160051/lentil-soup-with-lemon/"
}
