{
    "directions": [
        "1. In a small bowl, whisk together the peanut butter, sugar, soy sauce, lime juice and zest, ginger, vinegar, fish sauce, and sriracha until smooth.",
        "2. Heat the oil in a large nonstick skillet over medium-high heat until shimmering. Add the scallions and cook until softened, about 2 minutes. Add the pork and cook, breaking up with a wooden spoon, until no longer pink, 8 to 10 minutes. Add the peanut butter mixture and cook, stirring until absorbed, about 3 minutes. Stir in the quinoa and quinoa puffs. Adjust the seasoning with soy sauce, fish sauce, and sriracha.",
        "3. Stir in the cilantro and pea shoots and sprinkle with peanuts.",
        "4. Scoop the pork mixture into the lettuce leaves. Serve with lime wedges and sriracha."
    ],
    "ingredients": [
        "3 tablespoons (2 ounces/60 grams) creamy peanut butter (avoid using natural peanut butter, which won't blend as smoothly)",
        "1 tablespoon palm sugar or light brown sugar",
        "3 tablespoons soy sauce, plus more to taste",
        "3 tablespoons juice, plus 2 teaspoons finely grated zest from about 3 limes",
        "1 tablespoon finely grated fresh ginger",
        "1 tablespoon rice vinegar",
        "2 teaspoons fish sauce, plus more to taste",
        "2 teaspoons sriracha hot sauce, plus more to taste",
        "1 tablespoon vegetable oil",
        "6 scallions, ends trimmed and thinly sliced",
        "1 pound/450 grams ground pork",
        "1 cup (6 ounces/180 grams) cooked quinoa",
        "1/2 cup (1 ounce/30 grams) quinoa puffs",
        "1/2 cup cilantro, chopped",
        "1/2 cup pea shoots, chopped",
        "1/2 cup (2 1/2 ounces/75 grams) salted and roasted peanuts, chopped",
        "1 head Bibb lettuce, leaves separated",
        "Lime wedges",
        "Sriracha hot sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Spring",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Lettuce Cups with Pork and Quinoa in Peanut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lettuce-cups-with-pork-and-quinoa-in-peanut-sauce-56389788"
}
