{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Wrap the exterior of an 8-inch springform pan with aluminum foil, then spray the interior with cooking spray. Spread the vanilla wafer crumbs over the bottom and sides of the pan, pressing firmly to adhere.",
        "Cream together the egg yolks and sugar in a large bowl. Stir in the cream cheese, sour cream, and vanilla extract until smooth.  Beat egg whites until foamy in a large glass or metal mixing bowl. Add the cream of tartar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape.",
        "Use a rubber spatula or wire whisk to fold 1/3 of the egg whites into the cream cheese mixture . Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated. Add the remaining egg whites, folding just until incorporated. Pour the batter into the prepared springform pan. Line a roasting pan with a damp kitchen towel.  Place springform pan on towel, inside roasting pan, and place roasting pan on oven rack.  Fill roasting pan with boiling water to reach halfway up the sides of the baking dish.",
        "Bake in the preheated oven for about 50 minutes. The cheesecake is ready when the edges have nicely puffed  and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken. Turn off the oven, and allow the cheesecake to rest in the oven for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight."
    ],
    "ingredients": [
        "1/2 (12 ounce) package vanilla wafers, crushed",
        "3 eggs, separated",
        "1/2 cup white sugar",
        "8 ounces sour cream",
        "1 teaspoon vanilla extract",
        "1 (8 ounce) package cream cheese, softened",
        "1/8 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Light and Airy Cheesecake",
    "url": "http://allrecipes.com/recipe/218231/light-and-airy-cheesecake/"
}
