{
    "directions": [
        "Preheat the broiler. Mist both sides of the eggplant slices with nonstick cooking spray and sprinkle both sides with the Italian seasoning, 1/4 teaspoon salt and 1/4 teaspoon pepper. Place on a rimmed baking sheet and broil until browned and tender, turning once, about 6 minutes. Set aside. Reduce the oven temperature to 425 degrees F.",
        "Meanwhile, combine the flour and cayenne in a shallow dish. Combine the egg whites and 1 teaspoon water in a second dish. Combine the cereal and parmesan cheese in a third dish. Working with 1 piece of chicken at a time, dredge with the flour and tap off the excess. Coat with the egg whites and then place in the cereal mix and press until well coated on both sides. Repeat with the remaining chicken.",
        "Mist a large nonstick skillet with nonstick cooking spray and heat over medium-high heat. Add 1/2 of the oil and then 2 pieces of the coated chicken. Cook, turning once, until the chicken is just cooked through, about 5 mintues. Transfer to a 9-by-13-inch baking dish coated with nonstick cooking spray and repeat with the remaining oil and chicken.",
        "Place 2 eggplant slices on each chicken cutlet and top evenly with the tomatoes and cheese. Return to the oven and bake until the cheese is melted and lightly browned, 15 to 20 minutes. Sprinkle with parsley and 1/4 teaspoon salt and pepper to taste."
    ],
    "ingredients": [
        "1 small eggplant (about 1 pound), trimmed and cut into 8 slices",
        "Nonstick cooking spray",
        "1/2 teaspoon dried Italian seasoning",
        "Kosher salt and freshly ground black pepper",
        "1/3 cup all-purpose flour",
        "1/4 teaspoon cayenne pepper",
        "2 large egg whites, lightly beaten",
        "3 cups crispy rice cereal, such as Rice Chex, finely crushed",
        "2 tablespoons grated Parmesan",
        "4 boneless skinless chicken cutlets (12 to 14 ounces total)",
        "4 teaspoons olive oil",
        "1 1/3 cup no-salt-added crushed tomatoes",
        "1/2 cup shredded part-skim mozzarella cheese",
        "Chopped parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Eggplant Parmesan",
        "Eggplant Recipes",
        "Vegetable",
        "Healthy",
        "High Fiber",
        "Low Calorie",
        "Low-Fat"
    ],
    "title": "Lightened Chicken and Eggplant Parmesan",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/lightened-chicken-and-eggplant-parmesan-recipe"
}
