{
    "directions": [
        "Combine Marsala, 1/4 cup plus 1 tablespoon sugar and eggs in top of double boiler. Whisk mixture over gently simmering water until thickened and foamy and mixture registers 160°F. on candy thermometer, about 2 minutes. Remove from over water; whisk in light sour cream. Cool to room temperature.",
        "Beat cream cheese until light and fluffy. Beat in 1/3 of egg mixture. Fold in remaining egg mixture in 2 additions.",
        "Line bottom and sides of 9x5-inch loaf pan with plastic wrap. Line bottom of prepared pan with angel food cake slices, trimming cake to fit bottom evenly. Combine coffee, rum and remaining sugar in small bowl. Brush cake in pan generously with coffee mixture. Pour filling over cake in pan. Brush enough remaining cake slices to cover filling lightly with coffee mixture. Place slices atop filling, coffee side down, trimming cake to fit pan evenly. Brush top of cake generously with coffee mixture. Reserve remaining cake and coffee mixture for another use. Sprinkle top with grated chocolate. Cover and refrigerate 8 hours or overnight. Serve."
    ],
    "ingredients": [
        "1/4 cup plus 1 tablespoon dry Marsala",
        "1/4 cup plus 2 tablespoons sugar",
        "2 extra-large eggs",
        "3 tablespoons light sour cream",
        "8 ounces light cream cheese",
        "1 11-ounce loaf angel food cake, cut into 1/2-inch slices",
        "1/2 cup strong brewed espresso or strong coffee",
        "2 tablespoons dark rum",
        "1 ounce bittersweet (not unsweetened) or semisweet chocolate, grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Rum",
        "Dairy",
        "Egg",
        "Dessert",
        "Low Fat",
        "Cream Cheese",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Light Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/light-tiramisu-168"
}
