{
    "directions": [
        "Preheat oven to 400°F. Spray 8 x 8 x 2-inch glass baking dish with vegetable oil spray. Whisk wine and cornstarch in small bowl to blend. Whisk flour in heavy medium saucepan to remove any lumps. Gradually add milk to flour, whisking until smooth. Add broth and thyme and whisk over medium heat until liquid thickens and boils, about 4 minutes. Add cornstarch mixture and whisk until liquid boils and is smooth, about 1 minute. Remove from heat. Add Neufch‰tel cheese and whisk until melted. Stir in both cans of tuna with their liquid and frozen peas. Season to taste with salt and pepper.",
        "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain pasta. Return to pot.",
        "Add tuna mixture to pasta; stir to blend well. Transfer to prepared baking dish. Sprinkle with potato chips. Bake until top is golden and sauce bubbles around edges of dish, about 25 minutes."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1/4 cup dry white wine",
        "4 teaspoons cornstarch",
        "1/3 cup all purpose flour",
        "1 1/2 cups low-fat (1%) milk",
        "1 cup canned low-salt chicken broth",
        "2 teaspoons minced fresh thyme or 1 teaspoon dried",
        "2 tablespoons Neufchâtel cheese (reduced-fat cream cheese)",
        "1 6-ounce can solid white tuna packed in water, undrained",
        "1 6-ounce can chunk light tuna packed in water, undrained",
        "1 cup frozen petite peas, unthawed",
        "8 ounces farfalle (bow-tie) pasta",
        "1/2 cup crushed baked potato chips (about 1 ounce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fish",
        "Pasta",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Casserole/Gratin",
        "Cream Cheese",
        "Tuna",
        "Pea",
        "Winter",
        "Noodle"
    ],
    "title": "Lighter Than Mom's Tuna-Noodle Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/lighter-than-moms-tuna-noodle-casserole-4990"
}
