{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, 10 to 12 minutes; drain.",
        "Bring a second pot of water to a boil. Cook asparagus until bright green, about 3 minutes. Remove asparagus using tongs and immediately dunk in cold water.",
        "Mix oregano, basil, thyme, salt, and pepper in a small bowl. Spray chicken breasts with cooking spray; rub herb mixture into chicken.",
        "Heat 1 teaspoon olive oil in a skillet over medium-high heat; cook chicken in the hot oil until lightly browned and no longer pink in the center, about 3 minutes per side.",
        "Heat remaining 1 teaspoon olive oil in a saucepan over medium-high heat; cook and stir red bell pepper and garlic in the hot oil until fragrant, about 1 minute. Stir buttermilk, wine, and flour into red bell pepper mixture; cook and stir until sauce is thickened, 2 to 4 minutes. Add spinach; cook until spinach wilts, 2 to 3 minutes. Stir Parmesan cheese into sauce until melted.",
        "Run hot water over asparagus to warm. Evenly divide linguine among serving plates; top with sauce, asparagus, and chicken."
    ],
    "ingredients": [
        "6 ounces whole wheat linguine",
        "20 asparagus spears, trimmed",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon salt",
        "2 teaspoons freshly ground black pepper",
        "4 (3 ounce) skinless, boneless chicken breast halves, pounded thin",
        "olive oil cooking spray",
        "2 teaspoons olive oil, divided",
        "1 red bell pepper, cut into matchstick-sized pieces",
        "3 cloves garlic, minced",
        "2 cups low-fat buttermilk",
        "1/2 cup white wine",
        "1 tablespoon all-purpose flour",
        "1/2 pound fresh spinach",
        "1/3 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Light Tuscan Garlic Chicken",
    "url": "http://allrecipes.com/recipe/233654/light-tuscan-garlic-chicken/"
}
