{
    "directions": [
        "Preheat the oven to 350 degrees F. Spray a 13-by-9-inch metal baking pan with nonstick spray. Line the bottom with parchment paper.",
        "Whisk together the all-purpose flour, pastry flour, baking powder, cinnamon, baking soda, allspice, ginger and 1/2 teaspoon salt in a medium bowl.",
        "In a large mixing bowl, add the eggs, egg white, brown sugar and granulated sugar and beat until light and creamy, about 3 minutes. Add the pineapple and vegetable oil and mix until thoroughly incorporated into the batter, about another minute.",
        "Add the dry ingredients in thirds and mix until combined, 1 to 2 minutes. Add the carrots and mix until just combined.",
        "Pour the batter into the prepared baking pan and bake for 35 minutes. Let the cake cool completely before flipping out of the pan and removing the parchment paper. Top with the cream cheese frosting.",
        "Beat the cream cheese, powdered sugar and lemon zest together until light and fluffy. Frost the carrot cake."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1 1/4 cups all-purpose flour",
        "1 1/4 cups whole wheat pastry flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon baking soda",
        "1/2 teaspoon allspice",
        "1/2 teaspoon ground ginger",
        "Fine salt",
        "2 large eggs",
        "1 egg white",
        "1 cup packed light brown sugar",
        "3/4 cup granulated sugar",
        "1/2 cup canned crushed pineapple in fruit juice",
        "1/2 cup vegetable oil",
        "5 medium carrots, peeled and grated (about 3 cups)",
        "Light Cream Cheese Frosting, recipe follows",
        "8 ounces reduced-fat cream cheese, at room temperature",
        "3/4 cup powdered sugar",
        "1 teaspoon fresh lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Carrot Cake",
        "Cake",
        "Carrot Recipes",
        "Vegetable",
        "Baking",
        "Frosting Recipes",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Light Carrot Cake",
    "url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/light-carrot-cake-recipe"
}
