{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease a 10-inch tube pan. Whisk the flour and baking powder in a bowl until thoroughly combined.",
        "In a large bowl, beat the butter and vegetable shortening together with an electric mixer until light and fluffy, about 3 minutes. Mix in 3 cups of sugar, 1 cup at a time, beating until smooth after each addition, then beat in the eggs, 1 at a time, beating each in well before adding the next. Beat in the applesauce until the liquid ingredients are smooth. Mix in the flour mixture, alternating with the milk, and stir in vanilla extract and lemon juice.",
        "In a bowl, stir the cocoa powder, 1/4 cup of sugar, and water until the sugar has dissolved and the syrup is smooth. Pour about 3/4 cup of the pound cake batter into the chocolate mixture, and stir to combine. Pour the remaining vanilla cake batter into the prepared tube pan, then pour the chocolate batter over the vanilla batter. With a spoon handle or butter knife, swirl the two batters together a few times (don't overmix) to create a marbled effect.",
        "Bake the cake in the preheated oven until a toothpick inserted into the cake comes out clean, and the sides of the cake pull slightly away from the pan, 70 to 80 minutes. Cool in the pan on a wire rack for 10 minutes, then invert the cake and remove from the pan onto the wire rack to finish cooling completely."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 cup butter, softened",
        "1/2 cup vegetable shortening",
        "3 cups white sugar",
        "5 eggs",
        "1/2 cup unsweetened applesauce",
        "1 cup milk",
        "1 teaspoon vanilla extract",
        "1 teaspoon lemon juice",
        "1/4 cup unsweetened cocoa powder",
        "1/4 cup white sugar",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Light Marble Pound Cake",
    "url": "http://allrecipes.com/recipe/218284/light-marble-pound-cake/"
}
