{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Coat a 9x13-inch baking dish with one teaspoon olive oil.",
        "Heat remaining 2 tablespoons of olive oil in a large saucepan over medium heat, and cook and stir the onion and garlic until the onion is translucent, about 5 minutes. Mix in the turkey, mushrooms, basil, oregano, and black pepper; cook and stir until the turkey is no longer pink and the mushrooms have released their liquid, 10 to 15 minutes. Break the turkey meat into crumbles as it cooks. Stir in the diced tomatoes, tomato paste, and spinach. Cook, stirring often, until the spinach leaves are wilted, about 5 minutes; turn off burner.",
        "Mix the cottage cheese, egg whites, parsley, and Parmesan cheese in a bowl until thoroughly combined. Set aside.",
        "Place 4 lasagna noodles into the prepared baking dish, overlapping if necessary, and pour half of the turkey mixture over the noodles. Spread half the zucchini slices over the meat sauce, and top with half of the cottage cheese mixture. Spread half of the mozzarella cheese over the cottage cheese layer. Repeat layers, starting with 4 more noodles, the remaining meat sauce, zucchini slices, cottage cheese mixture, and remaining mozzarella cheese.",
        "Bake the lasagna in the preheated oven until the sauce is bubbling and the cheese is melted and browned, 45 minutes to 1 hour."
    ],
    "ingredients": [
        "2 1/3 tablespoons olive oil, divided",
        "1 yellow onion, chopped",
        "4 cloves garlic, chopped",
        "1 pound ground turkey",
        "3 cups fresh mushrooms, sliced",
        "4 teaspoons dried basil",
        "4 teaspoons dried oregano",
        "1 teaspoon ground black pepper",
        "2 (14.5 ounce) cans diced tomatoes",
        "1 (6 ounce) can tomato paste",
        "6 cups chopped fresh spinach, washed and dried",
        "2 1/2 cups low-fat cottage cheese",
        "4 egg whites",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/4 cup grated low-fat Parmesan cheese",
        "8 no-boil lasagna noodles",
        "3 cups zucchini, sliced",
        "2 cups shredded low-fat mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Light and Delicious Lasagna",
    "url": "http://allrecipes.com/recipe/219270/light-and-delicious-lasagna/"
}
