{
    "directions": [
        "Bring the barley and water to a boil in a saucepan over high heat. Cover, reduce heat to low, and simmer until the barley is tender, about 30 minutes. Drain and set aside.",
        "Melt the butter in a large pot over medium heat. Stir the onion and celery into the melted butter, place a cover on the pot, and cook until tender, about 5 minutes. Add about half the garlic. Season with the black pepper, red pepper flakes, sea salt, and nutmeg. Return the cover to the pot and cook another 5 minutes.",
        "Stir the broccoli, vegetable stock, and remaining garlic into the mixture and bring to a boil. Return the cover to the pot, reduce heat to medium, and cook another 15 minutes, stirring once. Remove the pot from heat.",
        "Pour the soup into a blender, filling the pitcher no more than halfway. Hold the blender lid with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can puree the soup with a stick blender directly in the pot.",
        "Return the soup to medium-low heat. Stir the coconut milk, 2% milk, and barley into the pureed soup; cover and cook until hot, 5 to 8 minutes. Ladle into bowls and top with Asiago cheese and parsley to serve."
    ],
    "ingredients": [
        "3/4 cup barley",
        "3 cups water",
        "2 tablespoons unsalted butter",
        "1 onion, chopped",
        "2 celery stalks, chopped",
        "5 cloves garlic, cut into slivers and divided",
        "2 tablespoons fresh ground black pepper",
        "1 tablespoon red pepper flakes",
        "1 tablespoon sea salt",
        "2 dashes ground nutmeg",
        "7 cups chopped broccoli florets and stalks",
        "3 1/4 cups low-sodium vegetable stock",
        "1 (14 ounce) can reduced-fat coconut milk",
        "1 cup 2% milk",
        "1/4 cup grated Asiago cheese (optional)",
        "1/2 bunch fresh parsley, chopped (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Light Coconut Cream Broccoli and Barley Soup",
    "url": "http://allrecipes.com/recipe/214995/light-coconut-cream-broccoli-and-barl/"
}
