{
    "directions": [
        "Combine sea salt, porcini mushrooms, thyme, garlic powder, 1 teaspoon black pepper, and red pepper flakes in a food processor; blend until thoroughly mixed. Pour seasoning mixture into a bowl.",
        "Combine egg yolks, lemon juice, garlic, and dill in the food processor; blend, pouring in canola oil and olive oil in a steady stream until aioli is thick and smooth.",
        "Combine sliced onions, red wine vinegar, sugar, salt, and pepper in an airtight container. Let marinate, at least 15 minutes.",
        "Preheat an outdoor grill for medium heat and lightly oil the grate.",
        "Spread buns on grill and toast until golden, 30 seconds to 1 minute. Transfer to a serving platter. Spread some aioli over each half.",
        "Shape ground beef into 6 large patties. Sprinkle seasoning mixture generously over both sides.",
        "Increase grill heat to high. Grill patties until browned and an instant-read thermometer inserted into the center reads 160 degrees F (71 degrees C), about 4 minutes per side.",
        "Place 1 cooked patty on the bottom of each toasted bun. Top each with 3 tablespoons goat cheese, 2 tomato slices, 1 heaping tablespoon pickled red onions, and 1/2 cup arugula. Cover with top half of the bun."
    ],
    "ingredients": [
        "Seasoning Mixture:",
        "2/3 cup sea salt",
        "1 ounce dried porcini mushrooms",
        "2 teaspoons dried thyme",
        "2 teaspoons garlic powder",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon red pepper flakes",
        "Aioli:",
        "2 egg yolks",
        "1/2 lemon, juiced",
        "1 teaspoon finely chopped garlic",
        "1 teaspoon finely chopped fresh dill",
        "3/4 cup canola oil",
        "1/4 cup olive oil",
        "Pickled Red Onions:",
        "1 pound red onions, sliced into half moons",
        "1/2 cup red wine vinegar",
        "2 teaspoons white sugar",
        "salt and ground black pepper to taste",
        "Burgers:",
        "6 brioche buns, halved",
        "2 pounds ground beef",
        "9 ounces crumbled goat cheese (chevre)",
        "12 slices heirloom tomatoes",
        "3 cups arugula"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Li'l Woody's Farmers Market Burger",
    "url": "http://allrecipes.com/recipe/255192/lil-woodys-farmers-market-burger/"
}
