{
    "directions": [
        "Place lima beans in large bowl with enough water to cover by 5 inches. Soak overnight.",
        "Bring 2 cups water and dried mushrooms to boil in small saucepan. Using slotted spoon, transfer mushrooms to medium bowl; reserve liquid in saucepan.",
        "Heat oil in heavy large pot over medium heat. Add onion and garlic; sauté until onion is tender, 10 minutes. Drain beans; add to pot. Pour in mushroom liquid, leaving sediment behind. Add 6 cups water. Bring to simmer; skim foam from top. Stir in red pepper and thyme. Simmer partially covered until beans are tender, 45 minutes. Season with salt. Chop mushrooms; add to pot. Simmer uncovered over medium heat until beans and mushrooms are very tender, stirring occasionally and adding water to thin as needed, about 15 minutes longer. DO AHEAD: Can be made 3 days ahead. Cool, then cover and chill. Rewarm beans before continuing.",
        "Add chard to beans. Cover pot; cook until chard is tender, stirring often, about 8 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1 pound dried lima beans",
        "3 1 1/2-ounce packages assorted dried wild mushrooms",
        "2 tablespoons extra-virgin olive oil",
        "1 large onion, chopped",
        "4 garlic cloves, chopped",
        "1/4 teaspoon dried crushed red pepper",
        "1/4 teaspoon dried thyme",
        "6 cups (lightly packed) sliced stemmed Swiss chard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Sauté",
        "Low Fat",
        "Vegetarian",
        "High Fiber",
        "Lima Bean",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Swiss Cheese",
        "Simmer",
        "Boil",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Lima Beans with Wild Mushrooms and Chard",
    "url": "http://www.epicurious.com/recipes/food/views/lima-beans-with-wild-mushrooms-and-chard-351259"
}
