{
    "directions": [
        "Pulse together all crust ingredients in a food processor or beat with an electric mixer until a dough forms. Press dough evenly onto bottom and up side of tart pan with floured fingers. Chill shell until firm, about 30 minutes.",
        "Preheat oven to 350°F.",
        "Line shell with foil and fill with 1 inch of pie weights, then bake in middle of oven until edge is pale golden, about 22 minutes. Carefully remove foil and bake shell until edge is golden and bottom is pale golden, about 20 minutes more. Cool completely in pan on a rack.",
        "Reduce oven temperature to 300°F.",
        "Mix together all custard ingredients in a bowl with a whisk (do not beat) until just combined. Set tart shell (in tart pan) in a shallow baking pan and pour three fourths of custard into shell. Carefully put tart in middle of oven and pour remaining custard into shell with a small cup.",
        "Bake tart until just set in center, about 1 hour. Cool tart completely in tart pan on rack, then chill, covered, until cold, at least 2 hours. Just before serving, remove side of pan."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons all-purpose flour",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1 large egg, lightly beaten",
        "6 large eggs",
        "1 cup heavy cream",
        "1 cup sugar",
        "2/3 cup fresh lime juice",
        "Garnish: confectioners sugar",
        "Special equipment: an 8-inch fluted tart pan (2 inches deep) with a removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Citrus",
        "Dessert",
        "Bake",
        "Christmas",
        "Lime",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime Custard Tart",
    "url": "http://www.epicurious.com/recipes/food/views/lime-custard-tart-107435"
}
