{
    "directions": [
        "1. Put 3 tablespoons of the oil in a medium skillet over medium-low heat. Add the garlic and cook, stirring occasionally,until the garlic turns golden, about 10 minutes; set aside.",
        "2. Meanwhile, combine the lime juice and sugar in a small saucepan and bring to a boil. Set aside.",
        "3. Fill a large bowl with water and ice and set aside.",
        "Bring a small pot of water to a boil and add the basil and mint leaves. As soon as the water returns to a boil, drain the leaves and transfer to the ice water. When cold, drain again and squeeze dry. Purée in a blender with the sesame seeds, garlic, salt, and 1 cup of the oil. (This herb paste will keep, refrigerated, for 2 days.)",
        "4. Heat the remaining 3 tablespoons oil in a skillet over high heat. Add the vegetables and some salt and cook, tossing, just until brightly colored. Keep warm.",
        "5. Bring a large pot of water to a boil and salt it. Cook the noodles until tender, 30 seconds. Drain and transfer to a large skillet set over high heat with the butter and lime syrup; add salt to taste and cook, tossing, until well mixed and creamy. Put the noodles in a warmed serving bowl; drizzle liberally with the basil-mint paste, top with the vegetables, garnish with the sesame seeds, and serve."
    ],
    "ingredients": [
        "1 1/4 cups plus 2 tablespoons grape seed, corn, or other neutral oil",
        "10 garlic cloves, thinly sliced",
        "3/4 cup fresh lime juice",
        "1/2 cup sugar",
        "2 cups fresh basil leaves, preferably Thai",
        "1 1/2 cups fresh mint leaves",
        "3/4 cup white sesame seeds, plus more for garnish",
        "1 tablespoon salt, plus more as needed",
        "About 1/2 pound assorted vegetables: carrots, parsnips, broccoli (stems are fine), bell peppers, etc., peeled and julienned",
        "1 pound 1/4-inch-wide dried rice noodles, soaked in hot water until softened and drained",
        "1/2 cup unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Herb",
        "Vegetable",
        "Sauté",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Lime",
        "Mint",
        "Basil",
        "Broccoli",
        "Bell Pepper",
        "Carrot",
        "Noodle",
        "Boil",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime Noodles with Vegetables, Basil, and Sesame",
    "url": "http://www.epicurious.com/recipes/food/views/lime-noodles-with-vegetables-basil-and-sesame-355870"
}
