{
    "directions": [
        "Preheat oven to 350°F. and butter a 10-inch springform pan.",
        "In a food processor pulse almonds until finely ground and transfer to a bowl. Dust sides of springform pan with about 3 tablespoons ground almonds, knocking excess back into bowl. Melt butter and cool slightly. Stir butter and sugar into almonds until combined well and press evenly onto bottom of springform pan.",
        "In a large bowl with an electric mixer beat cream cheese and sugar on low speed 2 minutes. Add lime juice and a pinch salt and beat until smooth. Add eggs 1 at a time, beating well after each addition.",
        "Pour filling into pan and bake cheesecake 45 minutes. Remove cheesecake from oven (keep oven at 350°F.) and let stand 10 minutes.",
        "Let sour cream stand at room temperature 30 minutes. In a bowl whisk together sour cream, sugar, lime juice, and almond extract.",
        "Drop spoonfuls of topping around edge of cheesecake and spread gently over entire top of cake, smoothing evenly. Bake cheesecake in middle of oven 10 minutes and transfer immediately to refrigerator. Chill cheesecake at least 8 hours, or until cold, and up to 2 days, covering after 8 hours. Run a thin knife around edge of pan and remove side."
    ],
    "ingredients": [
        "7 ounces blanched whole almonds (about 1 1/4 cups)",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup sugar",
        "2 pounds cream cheese, softened",
        "1 1/2 cups sugar",
        "1 1/2 tablespoons fresh lime juice",
        "4 large eggs",
        "a 16-ounce container sour cream",
        "1/4 cup sugar",
        "1 tablespoon fresh lime juice",
        "1 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Cream Cheese",
        "Lime",
        "Almond",
        "Gourmet",
        "Pennsylvania"
    ],
    "title": "Lime Almond Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/lime-almond-cheesecake-101157"
}
