{
    "directions": [
        "Preheat oven to 350°F. Butter a 9x13\" baking pan and line with parchment paper, leaving a 1\" overhang on both long sides.",
        "Combine cornmeal, powdered sugar, salt, and 2 cups flour in the bowl of a stand mixer fitted with the paddle attachment. Add 1 cup butter and beat until mixture resembles coarse meal and dough sticks together when you rub it with your fingers. Transfer dough to prepared pan and press into bottom and 1/2\" up sides with your knuckles. Bake crust until golden, 18–20 minutes. Remove pan from oven and reduce oven temperature to 300°F.",
        "While crust is baking, whisk granulated sugar, lime zest, and remaining 3 Tbsp. flour in a large bowl until combined. Add eggs and yolk and whisk until smooth. Whisk in lime juice and pour mixture onto hot crust (it's easiest to do this with pan on oven rack) and bake until topping is set, 25–30 minutes. Transfer pan to a wire rack to cool.",
        "Combine blueberries, granulated sugar, and 3 Tbsp. water in a small saucepan. Bring to a boil and simmer over medium heat, stirring occasionally, until blueberries have burst and sauce is slightly thickened, about 20 minutes. Let cool slightly. Purée blueberry mixture in a blender until smooth and strain through a fine-mesh sieve into a small bowl. Let glaze cool.",
        "Pour blueberry glaze over lime filling and spread to form an even, thin layer. Let cool completely, then chill until ready to serve. Lift bar out of pan using parchment overhang and cut into 24 squares.",
        "Bars can be stored in an airtight container and chilled for up to 3 days."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
        "1/2 cup fine cornmeal",
        "1/2 cup powdered sugar",
        "1/4 teaspoon kosher salt",
        "2 cups plus 3 tablespoons all-purpose flour, divided",
        "1 1/2 cups granulated sugar",
        "1 tablespoon finely grated lime zest",
        "4 large eggs plus 1 egg yolk",
        "3/4 cup fresh lime juice",
        "1 cup fresh blueberries",
        "2 tablespoons granulated sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Kid-Friendly",
        "Blueberry"
    ],
    "title": "Lime Cornmeal Bars with Blueberry Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/lime-cornmeal-bars-with-blueberry-glaze-56389815"
}
