{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Combine 1 cup sifted flour, 1/4 cup white sugar, and butter with a pastry blender to make coarse crumbs. With a fork, mix in the lime peel, egg yolk, and 1 teaspoon lime juice. Dough will have a paste-like consistency. Cover the bottom and sides of a 9-inch springform pan with the crust mixture. Bake in preheated oven until slightly brown, about 6 to 8 minutes. Remove from oven and set aside.",
        "Increase oven temperature to 450 degrees F (230 degrees C).",
        "In a large bowl, combine the cream cheese, 1 1/2 cups white sugar, and 1/2 cup flour; beat until smooth. Blend in eggs one at a time, mixing until fully incorporated before adding the next egg. Mix in 1 cup lime juice, vanilla extract, and salt. Beat until smooth. Pour filling into prepared crust.",
        "Bake in preheated oven for 12 minutes. Reduce heat to 300 degrees F (150 degrees C). Bake until center of the cheesecake doesn't wiggle when the pan is gently shaken, about 1 hour. Remove cake from oven and cool on wire rack.",
        "Release spring on the outside rim after 1 hour of cooling time, but do not remove the sides. Loosening the spring will help to prevent the cake from cracking.  If you remove the rim, the cake will not hold its shape. Chill the cake several hours before serving. Cake develops better flavor if chilled overnight."
    ],
    "ingredients": [
        "Crust:",
        "1 cup sifted all-purpose flour",
        "1/4 cup white sugar",
        "1/2 cup butter, softened",
        "1 tablespoon grated lime zest",
        "1 egg yolk, beaten",
        "1 teaspoon fresh lime juice",
        "Filling:",
        "5 (8 ounce) packages cream cheese, room temperature",
        "1 1/2 cups white sugar",
        "1/2 cup all-purpose flour",
        "6 eggs, room temperature",
        "1 cup fresh lime juice",
        "1 teaspoon vanilla extract",
        "1 teaspoon salt",
        "8 slices lime"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lime Kissed Cheesecake",
    "url": "http://allrecipes.com/recipe/7975/lime-kissed-cheesecake/"
}
