{
    "directions": [
        "Combine sugar and 3/4 cup water in heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Bring mixture to simmer over medium heat, stirring until sugar dissolves. Simmer until syrup thickens and is reduced to 1 1/4 cups, about 8 minutes. Cool to room temperature. Discard vanilla bean. Transfer 1/2 cup syrup to small bowl. Whisk in 1 tablespoon lime juice. Cover lime-vanilla syrup and chill.",
        "Mix gelatin and remaining 7 tablespoons lime juice in small bowl. Let stand until gelatin softens, about 10 minutes. Add to syrup in saucepan. Stir over low heat just until gelatin dissolves, about 5 minutes (do not boil).",
        "Using electric mixer, beat eggs in large stainless steel bowl at high speed until mixture falls in heavy ribbon when beaters are lifted, about 6 minutes. Gradually beat in warm lime syrup. Place bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); beat until thermometer registers 140°F for 3 minutes, about 5 minutes total. Place bowl over larger bowl of ice water; beat syrup mixture until cold, about 3 minutes.",
        "Beat whipping cream in medium bowl until peaks form. Fold into syrup mixture in 2 additions. Fold in lime peel. Cover mousse and refrigerate until set, at least 6 hours and up to 1 day.",
        "Using 2 large soup spoons, form mousse into 12 egg-shaped \"dumplings,\" placing 2 on each of 6 plates. Spoon lime-vanilla syrup over mousse and serve."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "3/4 cup water",
        "1 4-inch piece vanilla bean, split lengthwise",
        "8 tablespoons fresh lime juice",
        "1 teaspoon unflavored gelatin",
        "2 large eggs",
        "1 cup chilled heavy whipping cream",
        "2 teaspoons grated lime peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Citrus",
        "Dessert",
        "Lime",
        "Vanilla",
        "Summer",
        "Chill",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lime Mousse with Lime-Vanilla Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/lime-mousse-with-lime-vanilla-syrup-106978"
}
