{
    "directions": [
        "Preheat oven to 450°F. Whisk lime juice, lime peel, honey, 2 tablespoons cilantro, and soy sauce in small bowl; set aside. Heat oil in large deep ovenproof skillet or casserole (with lid) over medium-high heat. Add shallots and sauté until beginning to soften and brown, about 5 minutes. Stir in rice, then 3 1/4 cups broth; bring to boil. Cover skillet tightly with lid; place in oven and bake 10 minutes (rice will be almost cooked through and most of broth will be absorbed; mix in more broth by 1/4 cupfuls if dry).",
        "Remove skillet from oven. Sprinkle rice lightly with salt. Sprinkle salmon with salt and pepper and arrange on rice, pressing in lightly. Tuck broccolini in around fish, with stems anchored in rice. Spoon 1 tablespoon lime mixture over each salmon fillet. Cover skillet tightly and return to oven; bake until salmon is just opaque in center and broccolini is crisp-tender, 8 to 10 minutes. Drizzle remaining lime mixture over fish and rice; sprinkle with additional chopped cilantro and serve from skillet."
    ],
    "ingredients": [
        "1/4 cup fresh lime juice",
        "2 tablespoons finely grated lime peel",
        "2 tablespoons honey",
        "2 tablespoons chopped fresh cilantro plus additional for sprinkling",
        "4 teaspoons soy sauce",
        "1 tablespoon olive oil",
        "3/4 cup sliced shallots (about 3 large)",
        "1 1/2 cups basmati rice (9 to 10 ounces)",
        "3 1/4 cups (or more) low-salt chicken broth",
        "4 5-to 6-ounce skinless salmon fillets",
        "1 bunch broccolini, bottom inch trimmed, stalks separated if necessary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Sauté",
        "Low Fat",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Salmon",
        "Healthy",
        "Honey",
        "Lime Juice",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Lime- and Honey-Glazed Salmon with Basmati and Broccolini",
    "url": "http://www.epicurious.com/recipes/food/views/lime-and-honey-glazed-salmon-with-basmati-and-broccolini-355189"
}
