{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Sift flour, 1/2 cup superfine sugar, and salt into medium bowl; repeat sifting 3 times. Using electric mixer, beat egg whites, lime peel, and vanilla on medium speed in large bowl until frothy (mixture may turn neon green but color will change when remaining ingredients are added). Add cream of tartar; increase speed to high and beat until soft peaks form. Gradually add remaining 1 cup sugar, 2 tablespoons at a time, beating until stiff peaks form. Sprinkle 1/3 of flour mixture over whites and gently fold in until incorporated. Fold in remaining flour mixture in 2 more additions just until incorporated. Transfer to ungreased 10-inch angel food cake pan with 4-inch-high sides and removable bottom (do not use nonstick pan); smooth top.",
        "Bake cake until pale golden and tester inserted near center comes out clean, about 38 minutes. Immediately invert cake onto work surface if pan has feet, or invert center tube of pan onto neck of bottle or metal funnel and cool cake completely.",
        "Using long thin knife, cut around cake sides and center tube to loosen. Lift out center tube with cake still attached; run knife between cake and bottom of pan to loosen. Invert cake onto rack, then turn cake over, rounded side up. Set rack with cake atop rimmed baking sheet.",
        "Combine sugar and 3 tablespoons lime juice in small saucepan; stir over medium heat until sugar dissolves. Brush syrup all over top and sides of cake. Immediately press pistachios onto top and sides of cake, pressing to adhere.",
        "Stir powdered sugar with remaining 1 tablespoon lime juice in small bowl until smooth. Drizzle glaze over top of cake. Let stand until glaze sets, about 10 minutes. DO AHEAD: Cake can be made up to 1 day ahead. Cover with cake dome and store at room temperature.",
        "Transfer cake to platter; cut into wedges and serve."
    ],
    "ingredients": [
        "1 cup cake flour",
        "1 1/2 cups superfine sugar, divided",
        "1/4 teaspoon salt",
        "10 large egg whites, room temperature",
        "2 teaspoons finely grated lime peel",
        "1 teaspoon vanilla extract",
        "1 teaspoon cream of tartar",
        "1/2 cup sugar",
        "4 tablespoons fresh lime juice, divided",
        "1/2 cup unsalted raw pistachios (about 2 ounces), finely chopped in processor",
        "1/2 cup powdered sugar",
        "Special equipment: 10-inch-diameter angel food cake pan with 4-inch-high sides and removable bottom (do not use nonstick pan)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Low Fat",
        "Low Cal",
        "Lime",
        "Pistachio",
        "Birthday",
        "Family Reunion",
        "Healthy",
        "Low Cholesterol",
        "Engagement Party",
        "Party",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime Angel Food Cake with Lime Glaze and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/lime-angel-food-cake-with-lime-glaze-and-pistachios-358238"
}
