{
    "directions": [
        "Combine all ingredients in heavy medium saucepan. Bring to boil over medium-high heat, whisking to blend. Reduce heat to medium and simmer 1 minute. Remove from heat. Cover and let sauce stand at room temperature 10 minutes for flavors to blend. Strain. Season sauce to taste with salt and pepper. (Can be made 2 days ahead. Cover and refrigerate. Rewarm before serving.)",
        "Using on/off turns, mix flour and next 5 ingredients in processor until blended. Transfer flour mixture to medium metal bowl. Gradually whisk in 3/4 cup ginger ale. (Can be made 6 hours ahead. Cover and refrigerate. Add more ginger ale by tablespoonfuls if batter thickens.)",
        "Add enough oil to heavy large saucepan to measure 1 1/2 inches deep. Attach deep-fry thermometer to side of pan (do not allow tip to touch bottom of pan). Heat oil to 370°F to 380°F. Place cornstarch in shallow bowl. Place coconut in medium bowl. Lightly dredge shrimp in cornstarch, shaking off excess. Working in batches, dip shrimp in batter to coat lightly, allowing excess batter to drip off. Dredge shrimp in coconut. Fry shrimp until cooked through and coconut is golden, about 2 minutes. Transfer to paper towels to drain.",
        "Divide warm sauce among 6 plates. Stand 3 shrimp back-to-back on each plate. Garnish with cilantro sprigs and lime leaves and serve.",
        "*Available at Indian, Southeast Asian, and Latin American markets and in the ethnic foods section of many supermarkets.",
        "**Found at Southeast Asian markets."
    ],
    "ingredients": [
        "1 13.5- to 14.5-ounce can unsweetened coconut milk*",
        "12 whole green cardamom pods, crushed",
        "3 fresh kaffir lime leaves (3 double leaves)**",
        "2 garlic cloves, chopped",
        "2 tablespoons (packed) golden brown sugar",
        "1 tablespoon grated lemon peel",
        "1 tablespoon fresh lime juice",
        "1 tablespoon Thai red curry paste*",
        "2 teaspoons fish sauce (nam pla or nuoc nam)*",
        "3/4 cup all purpose flour",
        "1/4 cup cornstarch",
        "2 teaspoons minced kaffir lime leaves (3 to 4 double leaves)**",
        "1 1/2 teaspoons Thai red curry paste*",
        "1 teaspoon (packed) golden brown sugar",
        "1/2 teaspoon salt",
        "3/4 cup (or more) ice-cold ginger ale",
        "6 cups (about) peanut oil",
        "1/2 cup cornstarch",
        "2 1/2 cups sweetened flaked coconut",
        "18 uncooked large shrimp (about 1 pound), peeled, deveined, butterflied, tails left intact",
        "Fresh cilantro sprigs",
        "Kaffir lime leaves**"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Fry",
        "Lime",
        "Coconut",
        "Shrimp",
        "Curry",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lime and Coconut Shrimp with Red Curry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lime-and-coconut-shrimp-with-red-curry-sauce-230604"
}
