{
    "directions": [
        "Preheat oven to 300°F.",
        "In a small heavy saucepan stir together rum, water, and 3/4 cup sugar and bring to a boil over moderate heat. Cook mixture, without stirring, until sugar is dissolved and begins to turn golden caramel. Immediately divide caramel among six 1-cup ramekins, tilting them to coat bottoms evenly. (If caramel begins to thicken before all ramekins are filled, reheat it over low heat until just pourable.) Let caramel cool.",
        "In a large saucepan scald milk with cream over moderate heat. In a large heat-proof bowl whisk together whole eggs, yolks, and remaining 1/2 cup plus 2 tablespoons sugar until mixture is combined well. Add scalded milk mixture in a slow stream, whisking constantly, and whisk in lime juice, zest, and rum extract. Strain mixture through a coarse sieve into a heat-proof pitcher or measuring cup (at least 6-cup capacity).",
        "Arrange ramekins in a baking pan just large enough to hold them and divide mixture evenly among them. Add enough hot water to baking pan to reach two-thirds up sides of ramekins. Carefully put a single piece of foil over all ramekins, tucking it loosely around them, and bake in middle of oven about 1 hour 10 minutes (custards should appear set when shaken). Remove ramekins carefully from baking pan and let creams cool. Chill caramel creams, covered, 6 hours or overnight.",
        "Run a thin knife around sides of caramel creams and gently shake them from side to side to loosen. Invert a dessert plate over each ramekin and invert caramel creams onto plates."
    ],
    "ingredients": [
        "3 tablespoons dark rum",
        "1/4 cup water",
        "1 1/4 cups plus 2 tablespoons sugar",
        "2 1/4 cups milk",
        "1/2 cup heavy cream",
        "5 large whole eggs",
        "6 large egg yolks",
        "3 tablespoons fresh lime juice (from about 1 1/2 limes)",
        "1 tablespoon freshly grated lime zest (from about 3 limes)",
        "1/2 teaspoon rum extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Bake",
        "Lime",
        "Winter",
        "Chill",
        "Gourmet"
    ],
    "title": "Lime and Rum Caramel Creams",
    "url": "http://www.epicurious.com/recipes/food/views/lime-and-rum-caramel-creams-10010"
}
