{
    "directions": [
        "Set fine metal strainer over medium bowl and set aside. Whisk eggs, egg yolks, and sugar in another medium metal bowl to blend. Whisk in lime juice. Set bowl over large saucepan of gently simmering water (do not allow bottom of bowl to touch water). Whisk constantly until curd thickens and instant-read thermometer inserted into curd registers 178°F to 180°F, about 6 minutes. Immediately pour curd through prepared strainer set over bowl. Add butter to warm strained curd; let stand 1 minute, then whisk until blended and smooth. Press plastic wrap directly onto surface of curd, covering completely. Refrigerate until cold, about 4 hours. DO AHEAD: Lime curd can be made up to 2 days ahead. Keep chilled.",
        "Using electric mixer, beat butter and sugar in medium bowl until well blended, 1 to 2 minutes. Add egg yolk; beat to blend. Add flour and salt and mix on low speed until mixture resembles large peas. Using hands, knead in bowl just until dough comes together.",
        "Transfer dough to 9-inch-diameter tart pan with removable bottom. Break dough into pieces, then press dough evenly up sides and onto bottom of pan. Cover and chill 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Preheat oven to 350°F. Uncover crust and bake until golden brown, about 35 minutes. Cool completely in pan on rack.",
        "Remove sides from tart pan and place crust on plate. Spread lime curd evenly in baked crust. Arrange blackberries in 2 concentric circles just inside edge of tart. Mound blueberries in center of tart. Place jam in small microwave-safe bowl. Heat in microwave until jam is melted, about 15 seconds. Whisk to loosen and blend, adding water by teaspoonfuls if thick. Brush jam over berries. DO AHEAD: Tart can be made up to 8 hours ahead. Chill uncovered."
    ],
    "ingredients": [
        "3 large eggs",
        "3 large egg yolks",
        "1 cup sugar",
        "3/4 cup fresh lime juice",
        "6 tablespoons (3/4 stick) unsalted butter, cut into 6 pieces",
        "2 6-ounce containers fresh blackberries",
        "1 6-ounce container fresh blueberries",
        "1 tablespoon blackberry jam",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 cup sugar",
        "1 large egg yolk",
        "1 1/4 cups all purpose flour",
        "1 large pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "High Fiber",
        "Wedding",
        "Blackberry",
        "Blueberry",
        "Lime",
        "Summer",
        "Family Reunion",
        "Shower",
        "Engagement Party",
        "Candy Thermometer",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime Tart with Blackberries and Blueberries",
    "url": "http://www.epicurious.com/recipes/food/views/lime-tart-with-blackberries-and-blueberries-359373"
}
