{
    "directions": [
        "1. In a blender, combine the lemongrass with 3 cups water and puree until mostly smooth. (Lemongrass is very fibrous, so you will not get to a completely uniform consistency; that's okay.) Transfer the puree to a saucepan and bring to a simmer over medium heat. Remove from the heat, cover, and let the liquid infuse for 15 to 20 minutes. Strain the syrup into a bowl, pressing on the solids; discard the solids in the strainer. You should wind up with about 2 cups of strained \"lemongrass tea\"; be sure to measure out your final yield.",
        "2. In a medium saucepan, combine the \"lemongrass tea\" with the same amount (by volume) of sugar. So, if you wind up with 2 cups tea, you will add 2 cups (400 grams) sugar. Stir the mixture over medium-high heat until all the sugar has dissolved and the syrup comes to a simmer. Remove from the heat and let cool completely.",
        "3. Transfer the cooled syrup to a quart-size container and stir in the ginger juice and lime juice. Cover and refrigerate the sorbet base until completely cold, at least 3 hours.",
        "4. Pour the chilled sorbet base into an ice cream maker and freeze according to the manufacturer's instructions. Place the container in which you refrigerated the sorbet base in the freezer so you can use it to store the finished sorbet. Churn the sorbet until it resembles Italian ice. Transfer the sorbet to the chilled storage container and freeze until hardened to your desired consistency. The sorbet will keep, frozen, for up to 7 days."
    ],
    "ingredients": [
        "2 thick lemongrass stalks, cut into 2-inch pieces",
        "2 cups (400 grams) sugar, plus more as needed",
        "1/2 cup fresh ginger juice (from about 160 grams peeled fresh ginger; see Cooks' Note)",
        "1/2 cup fresh lime juice (from about 8 limes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Spring",
        "Summer",
        "Lemongrass",
        "Lime Juice",
        "Fat Free",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime, Ginger, and Lemongrass Sorbet",
    "url": "http://www.epicurious.com/recipes/food/views/lime-ginger-and-lemongrass-sorbet-56389791"
}
