{
    "directions": [
        "Preheat oven to 350°F. and butter a 9-inch tart pan with a removable fluted rim.",
        "In a food processor blend almonds, sugar, and salt until almonds are ground fine. In a bowl toss almond mixture with cookie crumbs and butter until combined well.",
        "Sprinkle half of crumb mixture onto bottom of pan near rim, pressing evenly up side. Sprinkle remaining crumb mixture onto bottom and press evenly over bottom, joining edge. Bake crust in lower third of oven 10 minutes, or until a deeper shade of golden, and cool on a rack.",
        "In a heavy saucepan cook sugar, butter, eggs, and lime juice over moderately low heat, whisking frequently, until thick enough to hold marks of whisk and first bubble appears on surface, 12 to 15 minutes. Immediately pour curd through a sieve into a bowl. Stir in zest and cool. Filling may be made 1 week ahead and chilled, its surface covered with plastic wrap.",
        "Spoon filling evenly into crust and cover surface with a buttered round of wax paper. Chill tart, covered, at least 1 hour and up to 24.",
        "In a bowl gently toss compote ingredients together and let stand 15 minutes.",
        "Remove side of tart pan and transfer lime curd tart to a plate. Serve lime curd tart cut into wedges with fruit compote on the side."
    ],
    "ingredients": [
        "2/3 cup sliced almonds, toasted until golden and cooled completely",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1 cup vanilla wafer crumbs (from about twenty 1 1/2-inch cookies)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 cup plus 1 tablespoon sugar",
        "1 stick (1/2 cup) plus 1 tablespoon cold unsalted butter, cut into pieces",
        "4 large eggs, beaten lightly",
        "1/2 cup fresh lime juice (from about 4 limes)",
        "1 tablespoon freshly grated lime zest (from about 2 limes)",
        "3 cups fresh Bing cherries, cut into 1/4-inch dice",
        "2/3 cup 1/4-inch dice fresh pineapple",
        "1/2 mango, cut into 1/4-inch dice",
        "2 firm-ripe apricots, peeled and cut into 1/4-inch dice",
        "2/3 cup raspberries, picked over and quartered",
        "1 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Lime",
        "Almond",
        "Spring",
        "Engagement Party",
        "Gourmet"
    ],
    "title": "Lime Curd and Toasted Almond Tart with Fruit Compote",
    "url": "http://www.epicurious.com/recipes/food/views/lime-curd-and-toasted-almond-tart-with-fruit-compote-12000"
}
