{
    "directions": [
        "Preheat oven to 375°F. Finely grind cookies, brown sugar, and salt in processor. Add hot butter and vanilla; blend until moist crumbs form. Add hot nuts; blend just until finely chopped. Press crust onto bottom and up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides to within 1/4 inch of top edge. Freeze crust 15 minutes. Bake until golden, about 15 minutes. Freeze 30 minutes.",
        "Stir lime juice, sugar, and lime peel in large bowl until sugar dissolves. Pour 1/3 cup lime syrup into small bowl; mix in cardamom. Cover; chill to use later. Mix ice cream into remaining lime syrup in large bowl. Spoon all but 2 1/2 cups ice cream into crust; smooth top. Freeze torte and remaining ice cream until firm, about 2 hours.",
        "Top torte with large scoops of ice cream, spacing apart and dipping ice cream scoop into hot water between scoops. Top with large scoops of sorbets, spacing apart. Using measuring spoons of various sizes dipped in hot water, scoop remaining sorbets place among larger scoops. Freeze 3 hours.",
        "Stir 1/3 cup water and sugar in medium saucepan over medium heat until sugar dissolves. Add frozen berries. Increase heat; boil until berries are soft and liquid is slightly reduced, about 8 minutes. Puree mixture in processor. Strain through sieve set over bowl, pressing on solids; discard solids. Cover; chill until cold. DO AHEAD: Can be made 1 day ahead. Cover torte; keep frozen. Keep lime syrup and berry sauce chilled.",
        "Run knife around pan sides to loosen crust. Release sides. Tuck some fresh berries into spaces between ice cream and sorbet. Toss remaining berries in berry sauce. Cut torte into wedges. Drizzle lime syrup over wedges. Spoon berry mixture alongside."
    ],
    "ingredients": [
        "1 5.25-ounce package sugar cookies",
        "1/3 cup (packed) dark brown sugar",
        "1/8 teaspoon salt",
        "7 tablespoons unsalted butter, melted, hot",
        "1 1/2 teaspoons vanilla extract",
        "1 1/4 cups hazelnuts, toasted , hot",
        "2/3 cup fresh lime juice",
        "2/3 cup sugar",
        "3 tablespoons finely grated lime peel",
        "1/4 teaspoon finely crushed cardamom seeds",
        "2 quarts premium vanilla ice cream, slightly softened",
        "3 pints assorted berry sorbets (such as strawberry, raspberry, and blackberry)",
        "1/3 cup water",
        "1/4 cup sugar",
        "1 12-ounce package frozen blackberries",
        "4 cups mixed fresh berries (such as blackberries, raspberries, and blueberries; about 20 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Blackberry",
        "Lime",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Lime Ice Cream Torte Topped with Berry Sorbets",
    "url": "http://www.epicurious.com/recipes/food/views/lime-ice-cream-torte-topped-with-berry-sorbets-242991"
}
