{
    "directions": [
        "In a saucepan, combine the sugar and 2 cups (16 fl. oz./500 ml) water. Bring to a boil over medium-high heat, stirring occasionally, until the sugar is completely dissolved and a syrup has formed, about 5 minutes. Let the syrup cool to room temperature.",
        "Pour the syrup into a bowl and stir in the lemon zest and juice, salt and limoncello. Cover and refrigerate until very cold, at least 2 hours or up to 1 day.",
        "Pour the cold lemon mixture into an ice cream maker and churn according to the manufacturer’s instructions. Spoon the sorbet into a freezer-safe container and place parchment or waxed paper directly on the surface. Cover tightly and freeze until firm, at least 2 hours or up to 3 days.",
        "Lemon bowls:",
        "Using a paring knife, trim off about 3/4 inch (2 cm) from the stem end of 8 lemons. You need an opening about 1 1/4 inches (3 cm) in diameter. Using a teaspoon, hollow out the flesh and membranes from each lemon, capturing the juice in the bowl. Put the removed lemon flesh in a fine-mesh sieve and press against it with the back of a spoon to extract the juice. Use the juice for making the sorbet or reserve for another use.",
        "Trim a thin slice from the bottom end of each lemon so it will stand upright.",
        "Line a baking sheet with parchment or waxed paper, transfer the hollowed-out lemons to the baking sheet and freeze until cold, at least 20 minutes. Fill each chilled lemon bowl with about 1/2 cup (4 fl. oz./125 ml) of the sorbet, mounding it on top and pressing firmly with a teaspoon. The filled bowls will keep in the freezer for up to 1 day. Makes about 1 quart (1 l).",
        "Adapted from",
        "The Ice Creamery Cookbook: Recipes for Frozen Treats, Toppings, Mix-Ins & More,",
        "by Shelly Kaldunski"
    ],
    "ingredients": [
        "1 1/2 cups (12 oz./375 g) sugar",
        "Finely grated zest of 2 lemons",
        "1/2 cup (4 fl. oz./125 ml) fresh lemon juice",
        "Pinch of salt",
        "1/2 cup (4 fl. oz./125 ml) limoncello"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Limoncello Sorbet",
    "url": "http://www.williams-sonoma.com/recipe/limoncello-sorbet.html"
}
