{
    "directions": [
        "Toss the eggplant with the kosher salt and spread out onto a microwave-safe plate. Cook in the microwave on High until the eggplant is dry and has shriveled to 1/3 of its original size, about 15 minutes. Transfer to a paper towel-lined plate and set aside.",
        "Whisk the tomato juice cocktail, vinegar, red wine, brown sugar, parsley, and anchovies together in a large bowl. Stir in the tomatoes, raisins, black olives, green olives, zucchini, yellow squash, celery, red bell pepper, and carrot; set aside.",
        "Heat 1 tablespoon of the olive oil in a large skillet over medium-high heat. Stir in the eggplant and cook, stirring occasionally, until the edges have browned, 4 to 8 minutes. Add the remaining 2 tablespoons of olive oil along with the celery and onion. Cook and stir until the onion has softened, about 4 minutes more. Stir in the vegetable mixture and bring to a simmer. Reduce heat to medium-low and simmer uncovered until the liquid thickens and begins to coat the vegetables, 4 to 7 minutes more. Scrape into a bowl and stir in the pine nuts. Refrigerate to room temperature. Sprinkle with the Parmesan cheese and serve."
    ],
    "ingredients": [
        "1 large eggplant, cut into 1/2 inch cubes",
        "3/4 teaspoon kosher salt",
        "1 cup tomato-vegetable juice cocktail (such as V8®)",
        "1/4 cup red wine vinegar",
        "1/2 cup red wine",
        "2 tablespoons brown sugar",
        "1/4 cup chopped fresh parsley",
        "4 anchovy fillets, minced, or to taste",
        "1 (14.5 ounce) can diced tomatoes",
        "1/4 cup raisins",
        "1/2 cup pitted black olives, chopped",
        "1/2 cup pitted green olives, chopped",
        "1/2 cup zucchini, diced",
        "1/2 cup yellow squash, diced",
        "2 celery stalks, diced",
        "1/2 red bell pepper, diced",
        "1/2 cup grated carrot",
        "3 tablespoons extra-virgin olive oil",
        "1/2 red onion, finely diced",
        "1/2 cup pine nuts",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Linda's Summertime Eggplant Salsa",
    "url": "http://allrecipes.com/recipe/171359/lindas-summertime-eggplant-salsa/"
}
