{
    "directions": [
        "Preheat oven to 400°F. Place squash cubes on rimmed baking sheet. Sprinkle with salt and pepper, then pour 1 tablespoon olive oil over and toss to coat. Roast 10 minutes. Turn squash over; continue roasting until tender, about 20 minutes longer. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature.",
        "Bring wine, shallots, garlic, and crushed red pepper to boil in large skillet. Add mussels; cover and cook until mussels open, 2 to 3 minutes (discard any mussels that do not open). Transfer mussels to large bowl. Cover liquid in skillet and set aside. Remove mussels from shells; discard shells. Pour clam juice and any accumulated juices from mussels into liquid in skillet. Bring to boil; reduce heat to medium and simmer until reduced to 1/2 cup, about 5 minutes. Whisk in 2 tablespoons oil. Cover; set aside.",
        "Meanwhile, cook linguine in large pot of boiling salted water until tender but still firm to bite, stirring occasionally.",
        "Using tongs, transfer pasta to skillet with juices, reserving pasta cooking liquid in pot. Add mussels and squash to skillet; toss. Add spinach to pasta cooking liquid; let stand 1 minute to wilt. Drain spinach.",
        "Divide wilted spinach among 4 wide shallow bowls. Divide linguine, squash, mussels, and sauce among bowls. Drizzle with oil and serve.",
        "Crisp, citrusy Mönchhof 2007 Estate Riesling, Germany ($15)."
    ],
    "ingredients": [
        "4 cups 3/4-inch cubes peeled butternut squash (about 1 pound)",
        "3 tablespoons extra-virgin olive oil, divided, plus additional for drizzling",
        "1/2 cup dry white wine",
        "2 large shallots, chopped",
        "2 large garlic cloves, minced",
        "1/2 teaspoon dried crushed red pepper",
        "2 pounds mussels, scrubbed, debearded",
        "1/2 cup bottled clam juice",
        "8 ounces linguine",
        "2 5-ounce packages fresh baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Roast",
        "Low Fat",
        "High Fiber",
        "Dinner",
        "Mussel",
        "Spinach",
        "Butternut Squash",
        "Fall",
        "Family Reunion",
        "Healthy",
        "Party",
        "Potluck",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Linguine with Butternut Squash, Spinach, and Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-butternut-squash-spinach-and-mussels-355198"
}
