{
    "directions": [
        "Heat 3 tablespoons oil in large skillet over medium heat. Add garlic and crushed red pepper; stir 1 minute. Add squid; sauté just until opaque, about 3 minutes. Add wine; simmer until liquid is reduced by half, about 20 minutes. Add tomatoes with juices and tomato paste. Bring to simmer, breaking up tomatoes. Cover; simmer over low heat 40 minutes.",
        "Bring 1/4 cup water to boil in another large skillet over high heat. Add clams and mussels. Cover; cook until shells open, about 6 minutes (discard any clams and mussels that do not open). Transfer shellfish to colander set over medium bowl; drain.",
        "Strain juices from skillet and medium bowl through fine sieve into tomato sauce. Simmer sauce uncovered until slightly thickened, about 10 minutes. Add lobster, shrimp and scallops. Simmer 2 minutes. Add clams and mussels from colander. Simmer 1 minute longer. Stir in remaining 3 tablespoons oil and parsley. Season with salt and pepper.",
        "Meanwhile, cook linguine in large pot of boiling salted water until just tender but still firm to bite. Drain. Return to pot. Add shellfish sauce; toss to coat."
    ],
    "ingredients": [
        "6 tablespoons extra-virgin olive oil",
        "2 garlic cloves, minced",
        "3/4 teaspoon dried crushed red pepper",
        "12 ounces cleaned squid, bodies cut into 1/2-inch-wide rings, tentacles left whole",
        "1 1/4 cups dry white wine",
        "1 28-ounce can Italian-style tomatoes with basil",
        "2 teaspoons tomato paste",
        "1/4 cup water",
        "2 pounds small littleneck clams, scrubbed",
        "1 pound mussels, scrubbed, debearded",
        "1 10-ounce uncooked lobster tail, shelled, meat cut into 1-inch pieces",
        "8 ounces uncooked large shrimp, peeled, deveined",
        "4 ounces bay scallops",
        "3 tablespoons chopped fresh Italian parsley",
        "1 pound linguine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Seafood",
        "Clam",
        "Lobster",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Squid",
        "White Wine",
        "Anniversary",
        "Noodle",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Linguine with Shellfish Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-shellfish-sauce-103431"
}
