{
    "directions": [
        "Cook bacon in a 5-quart heavy pot over moderate heat, stirring occasionally, until crisp, about 5 minutes, then transfer with a slotted spoon to paper towels to drain. Pour off all but 3 tablespoons bacon fat from pot. Add pine nuts to pot and cook over moderate heat, stirring, until golden, about 2 minutes. Transfer nuts with slotted spoon to paper towels to drain and season with salt.",
        "Add shallots to pot and cook over moderate heat, stirring, until softened, about 4 minutes. Add garlic and red pepper flakes and cook, stirring, 1 minute. Add oil and half of collard greens and cook, stirring, until slightly wilted, about 1 minute. Add remaining greens and salt and continue to cook, stirring, until greens are crisp-tender, about 2 minutes more. Add water and cover pot, then simmer greens, stirring occasionally, until just tender, about 15 minutes.",
        "While collard greens are simmering, cook linguine in a 6- to 8-quart pot of boiling salted water until al dente.",
        "Drain linguine in a colander. Add drained linguine and tomatoes to pot with greens and cook over moderately high heat, stirring constantly, 1 minute. Season pasta with salt and pepper and serve topped with bacon, pine nuts, and cheese shavings."
    ],
    "ingredients": [
        "10 bacon slices (1/2 lb), chopped",
        "3/4 cup pine nuts (1/4 lb)",
        "1/4 lb shallots, finely chopped (3/4 cup)",
        "6 garlic cloves, minced",
        "1 teaspoon dried hot red pepper flakes",
        "2 tablespoons olive oil",
        "3 lb collard greens, stems and center ribs discarded and leaves chopped",
        "1/4 teaspoon salt",
        "2 cups water",
        "1 lb dried linguine",
        "1 lb grape or cherry tomatoes, quartered",
        "1 cup Parmigiano-Reggiano shavings, made with a vegetable peeler from a 6-to 8-oz wedge"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pasta",
        "Pork",
        "Side",
        "Thanksgiving",
        "Bacon",
        "Pine Nut",
        "Fall",
        "Gourmet",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Linguine with Collard Greens and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-collard-greens-and-bacon-108340"
}
