{
    "directions": [
        "In a kettle bring the water to a boil with the clams and steam the clams, covered, checking them occasionally and transferring them as they open with a slotted spoon to a large bowl, for 3 to 8 minutes. Discard any unopened clams, strain the broth through a fine sieve into a large glass measure, and if necessary add enough water to measure a total of 1 1/2 cups. Discard the shells, rinse any clams that feel sandy, and chop the clams.",
        "Stir the cornstarch into the clam broth and stir in the soy sauce, the Scotch, the vinegar, and the sugar. In a wok or large heavy skillet heat the oil over moderately high heat until it just begins to smoke and in it stir-fry the gingerroot, the black beans, and the garlic for 30 seconds, or until the mixture is fragrant. Stir the cornstarch mixture, add it to the wok, stirring, and bring the sauce to a boil, stirring. Simmer the sauce, stirring, for 2 minutes and keep it warm.",
        "In a kettle of salted boiling water cook the linguine until it is al dente, drain it, and add it to the wok with the clams and the scallions. Cook the mixture over moderate heat, tossing the linguine, until it is heated through and the linguine is coated well with the sauce."
    ],
    "ingredients": [
        "1 cup water",
        "30 small (about 2-inch) hard-shelled clams, scrubbed well",
        "2 tablespoons cornstarch",
        "3 tablespoons soy sauce",
        "2 tablespoons Scotch",
        "2 tablespoons rice vinegar",
        "1 tablespoon sugar",
        "3 tablespoons vegetable oil",
        "3 tablespoons minced peeled fresh gingerroot",
        "2 1/2 tablespoons dried fermented black beans*, rinsed well, drained, and chopped",
        "2 tablespoons minced garlic",
        "3/4 pound linguine",
        "2 scallions, halved lengthwise and cut crosswise into 1-inch pieces",
        "*available at Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Scotch",
        "Ginger",
        "Pasta",
        "Shellfish",
        "Clam",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Linguine with Clams in Black Bean Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-clams-in-black-bean-sauce-12719"
}
