{
    "directions": [
        "In large pot over moderately high heat, combine 8 quarts of water to boil and salt. Bring to boil, then add linguine and cook to 1 minute short of al dente according to package directions (pasta should still be quite firm).",
        "Meanwhile, in large sauté pan over moderately high heat, heat 6 tablespoons extra- olive oil until hot but not smoking. Add garlic and sauté until just golden, about 30 seconds. Add clams and 1 tablespoon red pepper flakes and sauté 1 minute. Add wine, tomatoes and juice, and 1/2 cup parsley and simmer, uncovered, just until clams open, 7 to 8 minutes.",
        "Reserve 1/2 cup cooking water, then drain linguine and add to pan. Simmer, tossing occasionally, until linguine is just tender, about 1 minute. If necessary, add some of reserved cooking water to keep moist. Remove from heat. Add remaining 2 tablespoons parsley, 1 teaspoon red pepper flakes, and extra-virgin olive oil, tossing to coat. Transfer to serving dish and serve immediately."
    ],
    "ingredients": [
        "3 tablespoons kosher or coarse sea salt",
        "1 pound linguine",
        "12 tablespoons extra-virgin olive oil",
        "4 cloves garlic, thinly sliced",
        "1 pound New Zealand cockles or 24 Manila or littleneck clams, scrubbed",
        "1 tablespoon plus 1 teaspoon red pepper flakes",
        "1 cup dry white wine",
        "1 (14-ounce) can whole San Marzano tomatoes in juice, juice reserved and tomatoes coarsely chopped",
        "1/2 cup plus 2 tablespoons fresh flat-leaf parsley, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Christmas",
        "Dinner",
        "Seafood",
        "Clam",
        "Christmas Eve",
        "Simmer",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Linguine With Clams (_Linguine Con le Vongole_)",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-clams-em-linguine-con-le-vongole-em-350683"
}
