{
    "directions": [
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.",
        "Meanwhile, melt 1 tablespoon butter with 1 tablespoon olive oil in a large skillet over medium heat. Add shallots and stir until just soft, 3-4 minutes. Add garlic and 1 chile and cook, stirring often, until fragrant, about 1 minute.",
        "Add 1/2 tablespoon lemon juice and 3 tablespoons pasta cooking liquid to shallot mixture; add a pinch of pepper. Stir until liquid is almost evaporated, about 1 minute.",
        "Transfer pasta to skillet and add 1/2 cup reserved pasta cooking liquid. Increase heat to medium-high. Cook, tossing pasta or stirring with tongs, until liquid is almost evaporated and pasta becomes glossy, about 2 minutes. Add the remaining 3 tablespoons butter, 1 tablespoon oil, 1 tablespoon lemon juice, 1 teaspoon lemon zest, crab, half of mint, and more chile rounds, if desired.",
        "Stir pasta until butter melts and pasta is well coated, adding more pasta cooking liquid if dry. Divide between bowls; top with remaining 1 teaspoon lemon zest and mint. Sprinkle with more lemon juice if desired."
    ],
    "ingredients": [
        "8 ounces linguine",
        "Kosher salt",
        "4 tablespoons unsalted butter, divided",
        "2 tablespoons olive oil, divided",
        "1/4 cup minced shallots",
        "1 teaspoon minced garlic",
        "1-2 Fresno chiles, red jalapeños, or red Thai chiles, seeded, sliced into thin rounds",
        "1 1/2 tablespoons (or more) fresh lemon juice, divided",
        "2 teaspoons (packed) finely grated lemon zest, divided",
        "Freshly ground black pepper",
        "8 ounces cooked, shelled Dungeness crab, king crab, or jumbo lump crabmeat, picked over for shells",
        "1/3 cup fresh mint leaves, gently torn, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Pasta",
        "Shellfish",
        "Dinner",
        "Lemon",
        "Mint",
        "Seafood",
        "Crab",
        "Winter",
        "Chile Pepper",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Linguine with Crab, Lemon, Chile, and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-crab-lemon-chile-and-mint-380610"
}
