{
    "directions": [
        "Bring a large pot of salted water to a boil. Add pasta and cook, stirring occasionally, until almost al dente. Drain, reserving 1 cup pasta cooking liquid.",
        "Meanwhile, heat 3 tablespoons oil in another large heavy pot over medium heat. Add chopped fennel and garlic; cook, stirring often, until softened but not browned, 2-3 minutes. Add wine, then clams. Increase heat to high. Cover and cook until clams open, 4-7 minutes, depending on size of clams. As clams open, use tongs to transfer them to a large bowl (discard any that do not open).",
        "Add 1/2 cup reserved pasta cooking liquid to clam juices in pot; bring to a boil. Add pasta to pot. Cook over high heat, tossing constantly, until pasta is al dente and has soaked up some of the sauce, 2-3 minutes. Season with salt and pepper. Add clams with any juices from bowl and 2 tablespoons fennel fronds; toss to combine, adding more pasta liquid by tablespoonfuls if dry.",
        "Divide among bowls. Drizzle with oil; garnish with fennel fronds and fennel pollen."
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound linguine",
        "3 tablespoons extra-virgin olive oil plus more for drizzling",
        "1/2 small fennel bulb, finely chopped, plus 2 tablespoons coarsely chopped fennel fronds and more for garnish",
        "6 garlic cloves, chopped",
        "3/4 cup dry white wine",
        "3 pounds small clams (such as Manila) or cockles, scrubbed",
        "Freshly ground black pepper",
        "1 teaspoon (or more) fennel pollen or 1 teaspoon fennel seeds, toasted and finely ground in a spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Shellfish",
        "Valentine's Day",
        "Dinner",
        "Seafood",
        "Clam",
        "Fennel",
        "Christmas Eve",
        "Boil",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Linguine with Clams and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-clams-and-fennel-395445"
}
