{
    "directions": [
        "Light a grill and preheat for at least 10 minutes or preheat a grill pan. Arrange the grill so half cooks over high heat and the other half can cook over moderately low heat. Meanwhile, soak 1 small bamboo skewer for 10 minutes.",
        "Thread the garlic cloves onto skewer. Brush both sides of the leek and the tuna with olive oil and season with salt and pepper. Rub the tuna with the rosemary.",
        "Oil the grill grates, then grill the leek cut side down and the tuna over high heat until grill marks form, 2 to 3 minutes. Flip the tuna and leek and move to the cooler part of the grill. Cook until the tuna is just slightly pink within and the leek is tender, about 8 minutes for the tuna and 15 minutes for the leek. Transfer to a work surface and let cool slightly.",
        "Grill the garlic on the skewer over high heat, turning a few times, until blistered and slightly softened, about 2 minutes.",
        "Remove the outer layer of the leek and discard; thinly slice the leek crosswise, discarding any pieces that are tough, and transfer to a large bowl. Peel the garlic and finely chop. Flake the tuna and add the garlic and tuna to the leek.",
        "Meanwhile, cook the linguine until al dente; drain, reserving 1/2 cup of the cooking water. Add the hot pasta, parsley, capers, lemon juice and the 1/4 cup of olive oil to the bowl and toss. Add the cooking water, little by little, if necessary, to loosen the sauce. Season with salt, pepper and crushed red pepper, then serve immediately."
    ],
    "ingredients": [
        "2 unpeeled garlic cloves",
        "1 large leek, halved and well-rinsed",
        "1 pound fresh tuna, such as yellowfin",
        "1/4 cup extra-virgin olive oil, plus more for brushing",
        "Kosher Salt",
        "Freshly ground black pepper",
        "2 teaspoons finely chopped rosemary",
        "12 ounces linguine",
        "2 cups parsley leaves, roughly chopped",
        "1 tablespoon capers, roughly chopped",
        "Juice of 1 lemon",
        "Crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tuna",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Parsley",
        "Capers"
    ],
    "title": "Linguine with Grilled Tuna, Capers and Parsley",
    "url": "http://www.epicurious.com/recipes/food/views/linguine-with-grilled-tuna-capers-and-parsley-51241210"
}
