{
    "directions": [
        "Place oven rack in the center position. Preheat oven to 350 degrees F (175 degrees C). Spread almonds onto a baking sheet.",
        "Bake in the preheated oven until almonds are lightly toasted, 8 to 10 minutes. Remove from oven and cool.",
        "Pulse almonds with 1/4 cup white sugar in a food processor until finely ground.",
        "Whisk flour, lemon zest, cinnamon, and salt together in a bowl. Beat butter and remaining 1/2 cup white sugar together in a separate bowl until light and fluffy; beat in egg yolks, vanilla extract, ground almond mixture, and flour mixture until just combined. Cover bowl with plastic wrap and refrigerate until firm, 3 to 12 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.",
        "Roll dough into a rectangle about 1/4-inch thick on a lightly floured surface; cut into cookies using a 3-inch cookie cutter. Place cookies about 1-inch apart on the prepared baking sheets. Cut the centers out of half the cookies using a smaller cookie cutter.",
        "Bake in the preheated oven until cookies are lightly browned around the edges, about 12 minutes. Cool completely on a wire rack.",
        "Place the cut-out cookies on a baking sheet and lightly dust with confectioners' sugar. Spread a thin layer of jam onto the full cookies. Place the cut-out cookies on top of the full cookies; gently sandwich them together. Spoon more jam into the cut-out area."
    ],
    "ingredients": [
        "Cookies:",
        "1 cup whole almonds",
        "3/4 cup white sugar, divided",
        "2 cups all-purpose flour",
        "1 lemons, zested",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1 cup unsalted butter at room temperature",
        "2 large egg yolks",
        "1 teaspoon vanilla extract",
        "Topping:",
        "1/2 cup confectioners' sugar",
        "1/4 cup raspberry jam, stirred well, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Linzer Augen",
    "url": "http://allrecipes.com/recipe/232826/linzer-augen/"
}
