{
    "directions": [
        "Sift together the flour, baking powder and salt; set aside. In a medium bowl, cream together the butter, brown sugar and cinnamon until light and fluffy. Beat in the lemon zest, egg and vanilla. Mix in 1 cup of chopped almonds, then stir in the sifted ingredients. Press 2/3 of the dough into the bottom of a greased or parchment lined 8x8 inch baking pan. Roll the remaining portion between two pieces of waxed paper, out to an 8 inch square. Refrigerate all of the dough for at least 2 hours.",
        "While the dough is chilling, place the apricots into a small saucepan with water to cover. Bring to a boil and cook for three minutes. Remove from heat and set aside to cool. Drain the excess liquid from the apricots and mix in the preserves and lemon juice.",
        "Preheat oven to 350 degrees F (175 degrees C). Spread the apricot filling evenly over the chilled crust, leaving a 1/4 inch border on edges. Cut the chilled square of dough into 1/2 inch strips. Place the strips over the filling in a lattice design. Trim edges to fit and press the edges into the border. Brush the top with egg white then sprinkle with remaining chopped almonds and coarse sugar.",
        "Bake for 15 to 20 minutes in the preheated oven, until filling is bubbly and the crust is golden brown. Allow to cool completely before cutting into squares."
    ],
    "ingredients": [
        "DOUGH:",
        "1 1/2 cups all-purpose flour",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "5/8 cup butter",
        "1/2 cup brown sugar",
        "1 teaspoon ground cinnamon",
        "1 tablespoon lemon zest",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 cup finely chopped almonds",
        "FILLING:",
        "1/4 cup chopped dried apricots",
        "1/2 cup apricot preserves",
        "2 teaspoons lemon juice",
        "GLAZE:",
        "1 egg white",
        "2 tablespoons finely chopped almonds",
        "1 tablespoon coarse granulated sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Linzer Cookies",
    "url": "http://allrecipes.com/recipe/26163/linzer-cookies/"
}
