{
    "directions": [
        "Cover mushrooms with boiling-hot water (2 cups) in a bowl and let stand 30 minutes, then squeeze excess water from mushrooms and reserve 1 cup mushroom-soaking liquid (discard remainder or reserve for another use). Discard mushroom stems and cut caps into very thin slices.",
        "Meanwhile, mix together pork, scallions, water chestnuts, rice wine, sesame oil, sugar, 1 tablespoon ginger, 1 tablespoon soy sauce, and 1/2 teaspoon salt in a large bowl with your hands. Gather together pork mixture and throw against bottom or side of bowl 5 or 6 times to firm texture, then chill, covered, until ready to use.",
        "Remove and reserve 4 large cabbage leaves. Halve cabbage head lengthwise, then cut out and discard core. Cut cabbage halves crosswise into 2-inch-wide pieces.",
        "Heat wok over high heat until a drop of water evaporates instantly. Swirl 2 tablespoons peanut oil to coat bottom and sides of wok, then stir-fry mushrooms, half of cabbage, and remaining tablespoon ginger until cabbage begins to wilt, 1 to 2 minutes. Add remaining cabbage and 3/4 teaspoon salt and stir-fry until all of cabbage has begun to wilt, about 3 minutes. Add reserved soaking liquid (1 cup) and continue stir-frying until cabbage is wilted, about 3 minutes. Transfer mixture to a 4-quart clay pot or a 4- to 5-quart heavy pot, arranging evenly on bottom. Wipe wok clean with paper towels.",
        "Stir together cornstarch, pepper, and remaining tablespoon soy sauce in a small bowl until smooth.",
        "Divide pork mixture into quarters, then coat your hands with some of cornstarch mixture. Form 4 large meatballs, transferring each as formed to a large plate and then recoating your hands.",
        "Heat wok over high heat until a drop of water evaporates instantly, then pour in remaining peanut oil (enough to measure a scant 1/4 inch in wok). Reduce heat to moderately high and gently arrange meatballs in wok. Fry meatballs, turning gently with tongs or a slotted spoon, until deep golden on all sides, about 5 minutes total (if meatballs stick to wok, add more oil). Transfer with a slotted spoon to paper towels to drain, then arrange on top of cabbage in pot. Add broth, then cover meatballs completely with reserved 4 cabbage leaves. Bring liquid just to a boil, then reduce heat and gently simmer, covered, 1 hour. (Check occasionally to be sure liquid is not boiling vigorously.) Season broth with salt, then move large cabbage leaves around side of pot to resemble a lion's mane. Serve in individual shallow bowls."
    ],
    "ingredients": [
        "8 large dried shiitake mushrooms (3/4 ounces)",
        "2 cups boiling-hot water",
        "1 pound ground pork butt (not lean)",
        "1 large bunch scallions (white and pale green parts only), finely chopped",
        "6 large fresh water chestnuts, peeled and finely chopped, or 10 canned whole water chestnuts, rinsed, drained, and finely chopped",
        "1 tablespoon Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "2 teaspoons Asian sesame oil",
        "1 teaspoon sugar",
        "2 tablespoons finely chopped peeled fresh ginger",
        "2 tablespoons soy sauce",
        "1 1/4 teaspoons salt",
        "1 (2 1/2- to 3-pound) head Napa cabbage",
        "2/3 cup peanut or vegetable oil",
        "1 tablespoon cornstarch",
        "1/4 teaspoon black pepper",
        "2 cups reduced-sodium chicken broth (16 fluid ounces)",
        "Special equipment : a well-seasoned 14-inch flat-bottomed wok",
        "Accompaniment: steamed white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Leafy Green",
        "Mushroom",
        "Onion",
        "Pork",
        "Rice",
        "Vegetable",
        "Fry",
        "Stir-Fry",
        "Dinner",
        "Gourmet",
        "Lunar New Year",
        "Dairy Free"
    ],
    "title": "Lion's Head Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/lions-head-casserole-238436"
}
