{
    "directions": [
        "Place a rack in the center of the oven and preheat the oven to 350°F. Use a little of the lard or bacon drippings to grease the bottom of a roasting pan.",
        "Rinse off the meat and dry thoroughly. Set aside.",
        "Put all the spices and the salt in a small bowl and stir to mix well. Use your fingertips to rub the spice blend all over the meat. Place the meat in the roasting pan with its largest surface facing up. With your fingers or a spoon, dab the remaining lard or drippings all over the top of the meat.",
        "Roast for 50 minutes to 1 hour, until cooked through (timing will vary with the thickness of the meat; if it is 2 inches at its thickest point, it will take closer to an hour). Remove and let stand for 5 minutes.",
        "Thinly slice the meat. If you wish, deglaze the pan with a little water and pour the pan gravy over the slices of meat. Grilled Spice-Rubbed Pork: You can come closer to the original fire-cooked pork of the Lisu if you cook the meat over a charcoal grill. Use pork butt or loin cut crosswise into 3/4- to 1-inch-thick slabs. Rub on both sides with the spice blend, then grill slowly (over medium heat), turning the meat once partway through, and basting it with a little lard or oil to keep it moist, until it is cooked through (20 to 30 minutes). Thinly slice before serving."
    ],
    "ingredients": [
        "About 2 tablespoons lard or bacon drippings",
        "About 1 1/2 pounds boneless pork butt or loin, no more than 2 inches thick at its thickest",
        "2 teaspoons freshly grated nutmeg",
        "1 1/2 teaspoons dry-roasted Sichuan peppercorns, ground",
        "1/2 teaspoon freshly ground black pepper",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Dinner",
        "Meat",
        "Spice",
        "Gourmet",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lisu Spice-Rubbed Roast Pork",
    "url": "http://www.epicurious.com/recipes/food/views/lisu-spice-rubbed-roast-pork-242879"
}
