{
    "directions": [
        "Combine the quinoa, eggs, and salt in a medium bowl. Stir in the chives, onion, cheese, and garlic. Add the bread crumbs, stir, and let sit for a few minutes so the crumbs can absorb some of the moisture. At this point, you should have a mixture you can easily form into twelve 1-inch/2.5cm thick patties. I err on the very moist side because it makes for a not-overly-dry patty, but you can add more bread crumbs, a bit at a time, to firm up the mixture, if need be. Conversely, a bit more beaten egg or water can be used to moisten the mixture.",
        "Heat the oil in a large, heavy skillet over medium-low heat, add 6 patties, if they'll fit with some room between each, cover, and cook for 7 to 10 minutes, until the bottoms are deeply browned. Turn up the heat if there is no browning after 10 minutes and continue to cook until the patties are browned. Carefully flip the patties with a spatula and cook the second sides for 7 minutes, or until golden. Remove from the skillet and cool on a wire rack while you cook the remaining patties. Alternatively, the quinoa mixture keeps nicely in the refrigerator for a few days; you can cook patties to order, if you prefer."
    ],
    "ingredients": [
        "2 1/2 cups/12 oz/340 g cooked quinoa, at room temperature",
        "4 large eggs, beaten",
        "1/2 teaspoon fine-grain sea salt",
        "1/3 cup/.5 oz /15 g finely chopped fresh chives",
        "1 yellow or white onion, finely chopped",
        "1/3 cup/.5 oz/15 g freshly grated Parmesan or Gruyère cheese",
        "3 cloves garlic, finely chopped",
        "1 cup/3.5 oz /100 g whole grain bread crumbs, plus more if needed",
        "Water, if needed",
        "1 tablespoon extra-virgin olive oil or clarified butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Appetizer",
        "Fry",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Quinoa",
        "Potluck",
        "Picnic",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Little Quinoa Patties",
    "url": "http://www.epicurious.com/recipes/food/views/little-quinoa-patties-365029"
}
