{
    "directions": [
        "Bring broth to a simmer in a 3-quart saucepan, then add chicken and simmer, uncovered, 6 minutes. Remove pan from heat and cover, then let stand until chicken is cooked through, about 15 minutes. Transfer chicken to a plate and cool at least 10 minutes, reserving broth for another use.",
        "While chicken is poaching, bring 4 quarts salted cold water to a boil in a 5- to 6-quart saucepan over moderately high heat. Stir in noodles, then 1/2 cup cold water. When water returns to a boil, add another 1/2 cup cold water and bring to a boil again, stirring, then repeat once more, or until noodles are just tender but still firm and chewy throughout.",
        "Drain noodles in a colander and rinse well under cold water to cool, then drain well. Toss noodles with peanut oil in a large bowl.",
        "Stir together vinegar, soy sauces, chile oil with sediment, garlic, sugar, and salt in another bowl until sugar is dissolved, then add to noodles and toss until coated.",
        "Shred chicken with your fingers into 1/4-inch-wide strips and add to noodles, tossing to combine. Sprinkle with scallions and soy nuts."
    ],
    "ingredients": [
        "3 cups chicken broth or water (24 fl oz)",
        "1 lb skinless boneless chicken breast halves (2)",
        "1/2 lb dried buckwheat noodles such as soba noodles",
        "1 tablespoon peanut oil",
        "3 tablespoons Chinese black vinegar",
        "1 tablespoon light soy sauce",
        "1 tablespoon dark soy sauce",
        "1 tablespoon chile oil containing sesame oil (such as Chiu Chow Chili Oil from Lee Kum Kee) plus some of sediment from jar",
        "2 garlic cloves, minced",
        "1/2 teaspoon sugar",
        "1/8 teaspoon salt",
        "3 scallions (green parts only), thinly sliced",
        "2 tablespoons soy nuts (roasted salted soybeans)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Poach",
        "Quick & Easy",
        "Lunch",
        "Vinegar",
        "Noodle",
        "Soy Sauce",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Kosher"
    ],
    "title": "Liu Shaokun's Spicy Buckwheat Noodles with Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/liu-shaokuns-spicy-buckwheat-noodles-with-chicken-107966"
}
