{
    "directions": [
        "Whisk together the vegetable oil, 2 tablespoons lemon juice, brandy, crushed garlic, 1 teaspoon salt, 1/2 teaspoon black pepper, marjoram, thyme, rosemary, and oregano in a bowl, and pour into a resealable plastic bag. Add the cubed lamb, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 12 to 24 hours.",
        "Once the meat has finished marinating, remove from the refrigerator, and allow to stand at room temperature for 1 hour. While the meat is warming up, prepare the tzatziki sauce by whisking together the yogurt and cucumber in a mixing bowl along with 1 clove of minced garlic, 1 tablespoon lemon juice, 1 teaspoon salt, and 1/4 teaspoon pepper. Wrap the sauce with plastic wrap, and refrigerate until ready to use.",
        "Preheat the oven's broiler and set the oven rack about 4 inches from the heat source. Remove the lamb cubes from the marinade, and squeeze off excess. Discard the remaining marinade.  Spray a broiling pan with cooking spray, thread the meat onto the skewers, and place the skewers onto the prepared pan.",
        "Broil under the preheated broiler to your desired degree of doneness, turning every few minutes so the meat cooks evenly. It should take about 10 minutes to cook the meat to medium-well.",
        "To assemble the sandwiches, cook each pocket bread in a microwave on high until hot, 20 to 30 seconds each. Split each piece in half, and open up the pockets. Divide the tomato and onion slices among the pocket bread halves. Stuff with shredded lettuce, then fill with the broiled lamb. Sprinkle with crumbled feta cheese, and top with the tzatziki sauce to serve."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "2 tablespoons lemon juice",
        "2 tablespoons brandy",
        "1 clove garlic, crushed",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon dried marjoram",
        "1/8 teaspoon ground dried thyme",
        "1/8 teaspoon ground dried rosemary",
        "1/8 teaspoon dried oregano",
        "1 pound boneless lamb shoulder, cut into 1-inch cubes",
        "1 cup plain yogurt",
        "1/2 cucumber, shredded",
        "1 clove garlic, minced",
        "1 tablespoon lemon juice",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "4 (10 inch) bamboo skewers, soaked in water for 20 minutes",
        "8 pocket bread rounds",
        "1 tomato, sliced",
        "1/2 red onion, thinly sliced",
        "1 cup shredded lettuce",
        "1/2 cup crumbled feta cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "LIZZY217's Lamb Gyros",
    "url": "http://allrecipes.com/recipe/107442/lizzy217s-lamb-gyros/"
}
