{
    "directions": [
        "1. Drop noodles into a large quantity of boiling water — at least 2 quarts — and cook 3 1/2 to 5 minutes until tender. Do not overcook. Drain and rinse well under cold water. Set aside.",
        "2. Place the mushrooms in a bowl and add boiling water to cover. Let stand 15 to 30 minutes or longer, then drain and squeeze the mushrooms to extract most of their moisture. Cut off and discard the tough stems and thinly slice the cap.",
        "3. Place the meat on a flat surface and cut it across the grain into the thinnest possible slices. Place the slices in a bowl and add the oyster sauce, pepper, and 1 teaspoon of sesame oil. Mix to coat meat with the oyster sauce mixture.",
        "4. In a wok or skillet, heat the 1/2 cup peanut, vegetable, or corn oil, and when it is warm, not hot, add the beef and cook, stirring constantly, about 1 minute. Drain the beef in a sieve-lined bowl and keep the drippings; remove oil from wok and reserve.",
        "5. Heat 2 tablespoons of this reserved oil in the wok to almost smoking. Then add the bamboo shoots and mushrooms and cook, stirring, over high heat about 15 seconds. Add the cabbage, sugar and salt. Cook, stirring, about 1 minute, remove vegetables from wok.",
        "6. Add the beef drippings and an additional 3 tablespoons of reserved oil to the pan. Turn the heat to high, and when hot add the noodles. Cook, stirring, about 20 seconds. Add the bamboo shoots, mushrooms, and light soy sauce. Cook about 15 seconds, stirring, and add the chicken broth and dark soy sauce. Cook, stirring, about 8 minutes, then add the chives, bean sprouts, and beef. Cook, stirring, about 2 minutes.",
        "7. Add the remaining sesame oil, toss to blend, and serve hot."
    ],
    "ingredients": [
        "1/2 lb. fresh Chinese lo mein noodles",
        "3 large dried black mushrooms",
        "3/4 lb. flank steak",
        "1 to 2 tablespoons oyster sauce",
        "1/2 teaspoon pepper",
        "2 1/2 teaspoons sesame oil",
        "1/2 cup peanut, vegetable, or corn oil",
        "1/2 cup shredded bamboo shoots",
        "1/2 cup any kind of chopped cabbage",
        "1/2 teaspoon sugar",
        "1 1/2 teaspoons salt",
        "1 tablespoon light soy sauce",
        "1/2 cup chicken broth",
        "1 1/2 teaspoons dark soy sauce",
        "1/2 cup chives, cut into 2-inch lengths",
        "3 cups bean sprouts, rinsed and drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Beef",
        "Mushroom",
        "Pasta",
        "Kid-Friendly",
        "Dinner",
        "Meat",
        "Steak",
        "Winter",
        "Chive",
        "Cabbage",
        "Noodle",
        "Soy Sauce",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Lo Mein with Beef",
    "url": "http://www.epicurious.com/recipes/food/views/lo-mein-with-beef-104617"
}
