{
    "directions": [
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil. Cut the red bell pepper in half from top to bottom; remove the stem, seeds, and ribs; place pepper cut-side-down onto the prepared baking sheet.",
        "Cook under the preheated broiler until the skin of the pepper has blackened and blistered, about 5 minutes. Allow the blackened pepper to cool and steam in a paper bag for 5 minutes; peel and dice; set aside.",
        "Stir together the 2 ounces feta cheese, mayonnaise, lime juice, the 1 sprig chopped mint, and the 1 sprig chopped parsley in a small bowl; set aside.",
        "Preheat an outdoor grill for medium heat, and lightly oil the grate.",
        "Place the roasted red pepper, ground beef, feta cheese, spinach, bread crumbs, egg, garlic, onion, basil, the remaining mint, and the remaining parsley in a bowl. Sprinkle with salt and pepper, and mix gently with your hands until evenly combined. Divide the meat mixture to form 4 equal 4 1/2 inch patties.",
        "Cook on the preheated grill until the burgers are cooked to your desired degree of doneness, about 4 minutes per side for medium. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve burgers on warm toasted Kaiser roll with the feta cheese spread, fresh tomatoes, and lettuce."
    ],
    "ingredients": [
        "1 red bell pepper",
        "Spread:",
        "2 ounces crumbled feta cheese",
        "2 tablespoons mayonnaise",
        "2 teaspoons lime juice",
        "1 sprig fresh mint, chopped",
        "1 sprig fresh parsley, chopped",
        "Burgers:",
        "1 pound lean ground beef",
        "6 ounces crumbled feta cheese",
        "8 ounces fresh spinach - rinsed, drained and coarsely chopped",
        "1/4 cup bread crumbs",
        "1 egg",
        "1 clove garlic, minced",
        "1/4 cup chopped onion",
        "2 sprigs fresh basil, coarsely chopped",
        "3 sprigs fresh mint, coarsely chopped",
        "2 sprigs fresh parsley, coarsely chopped",
        "salt and ground black pepper to taste",
        "4 Kaiser rolls, split and toasted",
        "1 tomato, sliced",
        "4 leaves lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Loaded Greek Burgers",
    "url": "http://allrecipes.com/recipe/200404/loaded-greek-burgers/"
}
