{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Prick potatoes with a fork and wrap each potato in aluminum foil.",
        "Bake in the preheated oven until potatoes are tender, 1 1/2 to 2 hours. Cool potatoes until easily handled; scoop insides from skins and discard skins.",
        "Place chicken in a bowl and add enough olive oil to coat; add 1 teaspoon salt and 1/2 teaspoon pepper and toss to coat.",
        "Heat a skillet over medium-high heat; cook and stir chicken until no longer pink in the center and juices run clear, 5 to 10 minutes.",
        "Toss onion, carrots, and celery with enough olive oil to coat in a bowl.",
        "Heat a skillet over medium-low heat; cook and stir onion mixture until tender, 5 to 10 minutes.",
        "Melt butter in a large saucepan over medium-heat. Stir flour into melted butter and cook until lightly browned, 1 to 2 minutes. Pour milk, about 1/4 cup at a time, into butter-flour mixture; cook, stirring constantly, until sauce is thickened, about 10 minutes.",
        "Stir cooked potato, chicken, onion mixture, chicken stock, broccoli, 1/2 of the bacon bits, 1/2 of the green onions, and 4 ounces of the Cheddar cheese into the sauce. Cook soup until heated through and broccoli is tender, about 10 minutes; season with salt and pepper. Stir sour cream into soup and cook until heated through, about 5 minutes.",
        "Ladle soup into serving bowls and top with remaining bacon, green onions, and Cheddar cheese."
    ],
    "ingredients": [
        "2 1/2 pounds russet potatoes",
        "1 pound skinless, boneless chicken breast halves, cut into chunks",
        "2 tablespoons olive oil, or as needed",
        "1 teaspoon salt, plus more to taste",
        "1/2 teaspoon ground black pepper, plus more to taste",
        "1 onion, diced",
        "1 cup diced carrots",
        "2 stalks celery, diced",
        "6 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "3 cups milk",
        "1 cup chicken stock",
        "1 cup bite-size broccoli florets",
        "1/2 cup bacon bits, divided",
        "2 green onions, chopped",
        "5 ounces shredded sharp Cheddar cheese, divided",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Loaded Chicken Potato Soup",
    "url": "http://allrecipes.com/recipe/239849/loaded-chicken-potato-soup/"
}
