{
    "directions": [
        "Remove the meat from the shells of the lobsters. Cut the meat into large cubes and place them in a bowl. Cover with plastic wrap and refrigerate. Reserve the shells and all the juices that collect. Cut the corn kernels from the cobs and set aside, reserving the cobs separately.",
        "For the stock, melt the butter in a stockpot or Dutch oven large enough to hold all the lobster shells and corncobs. Add the onion and cook over medium-low heat for 7 minutes, until translucent but not browned, stirring occasionally. Add the sherry and paprika and cook for 1 minute. Add the milk, cream, wine, lobster shells and their juices, and corn cobs and bring to a simmer. Partially cover the pot and simmer the stock over the lowest heat for 30 minutes. (I move the pot halfway off the heat.)",
        "Meanwhile, in another stockpot or Dutch oven, heat the oil and cook the bacon for 4 to 5 minutes over medium-low heat, until browned and crisp. Remove with a slotted spoon and reserve. Add the potatoes, onions, celery, corn kernels, salt, and pepper to the same pot and saute for 5 minutes. When the stock is ready, remove the largest pieces of lobster shell and the corn cobs with tongs and discard. Place a strainer over the soup pot and carefully pour the stock into the pot with the potatoes and corn. Simmer over low heat for 15 minutes, until the potatoes are tender. Add the cooked lobster, the chives and the sherry and season to taste. Heat gently and serve hot with a garnish of crisp bacon."
    ],
    "ingredients": [
        "3 (1 1/2-pound) cooked lobsters, cracked and split",
        "3 ears corn",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1 cup chopped yellow onion",
        "1/4 cup cream sherry",
        "1 teaspoon sweet paprika",
        "4 cups whole milk",
        "2 cups heavy cream",
        "1 cup dry white wine",
        "1 tablespoon good olive oil",
        "1/4 pound bacon, large-diced",
        "2 cups large-diced unpeeled Yukon gold potatoes (2 medium)",
        "1 1/2 cups chopped yellow onions (2 onions)",
        "2 cups diced celery (3 to 4 stalks)",
        "1 tablespoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 teaspoons chopped fresh chives",
        "1/4 cup cream sherry"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Dutch Oven",
        "American",
        "Chowder",
        "Soup",
        "Celery",
        "Vegetable",
        "Bacon Recipes",
        "Meat",
        "Lobster",
        "Shellfish Recipes",
        "Corn Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Recipes for Parties",
        "Outdoor Party",
        "4th of July",
        "Holiday",
        "Fall",
        "Summer",
        "Sauteing Recipes"
    ],
    "title": "Lobster Corn Chowder",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/lobster-corn-chowder-recipe"
}
