{
    "directions": [
        "Bring large pot of water to boil. Add lobsters head first and boil until cooked through, about 8 minutes. Using tongs, transfer lobsters to large bowl. Reserve 2 cups cooking liquid. Cool lobsters.",
        "Working over large bowl to catch juices, cut off lobster tails and claws. Crack tail and claw shells and remove lobster meat. Coarsely chop lobster meat; cover and chill. Coarsely chop lobster shells and bodies; transfer to medium bowl. Reserve juices from lobster in large bowl.",
        "Heat olive oil in heavy large pot over high heat. Add lobster shells and bodies and sauté until shells begin to brown, about 8 minutes. Add onion and next 8 ingredients. Mix in brandy and Sherry. Boil until almost all liquid has evaporated, about 4 minutes. Add fish stock, reserved 2 cups lobster cooking liquid and lobster juices. Simmer 1 hour.",
        "Strain soup through sieve set over large saucepan, pressing firmly on solids. Whisk tomato paste into soup. Simmer until soup is reduced to 3 cups, about 15 minutes. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Add cream to soup and simmer 5 minutes. Dissolve cornstarch in 1 tablespoon water. Add to soup and boil until slightly thickened, about 2 minutes. Mix lobster meat into soup and stir to heat through. Ladle soup into bowls."
    ],
    "ingredients": [
        "2 1-pound live lobsters",
        "2 tablespoons olive oil",
        "1 onion, sliced",
        "1 large celery stalk, sliced",
        "1 small carrot, sliced",
        "1 garlic head, cut in half crosswise",
        "1 tomato, sliced",
        "2 tablespoons chopped fresh tarragon",
        "2 tablespoons chopped fresh thyme",
        "2 bay leaves",
        "8 whole black peppercorns",
        "1/2 cup brandy",
        "1/2 cup dry Sherry",
        "4 cups fish stock or bottled clam juice",
        "1/4 cup tomato paste",
        "1/2 cup whipping cream",
        "2 teaspoons cornstarch",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Herb",
        "Shellfish",
        "Tomato",
        "Lobster",
        "Brandy",
        "Sherry"
    ],
    "title": "Lobster Bisque",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-bisque-4092"
}
