{
    "directions": [
        "To cook the lobsters: Fill a large pot with enough water to come about 2 inches up the sides of the pot. Bring to a boil over high heat. Add a pinch of salt. Add the lobsters, shell side down, cover, and let steam for 12 minutes. Drain the lobsters and let cool.",
        "When the lobster is cool enough to handle, remove the meat from the tails and claws and very coarsely chop. You should have between 1 2/3 and 1 3/4 cups of meat. Set aside in a medium bowl. )Save the bodies and shells for snacking on or for making a lobster broth).",
        "Cook the bacon in a skillet until crisp on both sides, about 10 minutes. Drain on paper towels and set aside.",
        "To make the basil aïoli: In a small bowl, whisk together the mayonnaise, basil, and oil. Season to taste with salt and pepper. Cover and refrigerate; the aïoli will keep for several days. (You will have more aïoli than you need here; save for use in chicken sandwiches, chickensalad, roast beef and cheddar cheese sandwiches, and more.)",
        "Add the celery to the lobster. Fold in 2 tablespoons of the aïoli and the lemon juice to lightly coat the ingredients. Season with salt and pepper. Store in the refrigerator for up to 6 hours if not making the BLTs at once.",
        "To assemble a BLT: Lightly toast the bread. Spread the toast with a light dollop of the basil aïoli, just under a tablespoon on each piece of bread. Divide the bacon, lettuce leaves, tomato slices, and lobster salad between 2 slices of the toast. Cover with the remaining 2 slices toast. Slice the sandwiches in half on the diagonal.",
        "• Substitute cooked crabmeat for the lobster.",
        "• You can omit the bacon.",
        "• Serve this as a Lobster BLT Salad: Line a plate with a mixture of good greens, pile on the lobster salad and surround with the tomatoes and the bacon, cut into 1-inch pieces. Drizzle lightly with olive oil and vinegar."
    ],
    "ingredients": [
        "two 1 1/4-pound live lobsters, or 1 3/4 cups cooked",
        "lobster meat.",
        "Salt",
        "4 ounces great-quality thick-sliced smoked bacon (3 to 4 slices)",
        "1 stalk celery, finely diced",
        "1 tablespoon fresh lemon juice",
        "Sea salt and freshly ground black pepper",
        "4 slices brioche bread, white bread, a crusty roll, or your favorite bread",
        "4 Romaine or Buttercrunch lettuce leaves",
        "2 to 4 thick slices vine-ripened tomato",
        "1 cup mayonnaise",
        "1/4 cup thinly sliced basil leaves",
        "2 1/2 teaspoons olive oil",
        "Salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Tomato",
        "Mayonnaise",
        "Basil",
        "Bacon",
        "Lobster",
        "Summer",
        "Lettuce"
    ],
    "title": "Lobster Blt",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-blt-235566"
}
