{
    "directions": [
        "Bring large pot of water to boil. Add 1 lobster headfirst. Cover pot; cook lobster 5 minutes. Transfer lobster to large bowl of ice. Cook remaining lobster; cool. Working over rimmed baking sheet, twist tail and large claws off lobsters. Using lobster cracker or nutcracker, crack claws; gently remove meat in 1 piece. Remove tail meat from shell; slice each tail crosswise into 6 medallions. Place lobster meat in small bowl; cover and chill. Place lobster shells and juices in heavy resealable plastic bag; smash shells with kitchen mallet into smaller pieces; reserve.",
        "Peel and devein shrimp, leaving tails intact; reserve shells. Place shrimp in medium bowl; cover and chill.",
        "Heat oil in large pot (at least 8-quart capacity) over medium-high heat. Add onions, celery, fennel and garlic; sauté 5 minutes. Mix in tomato paste; sauté 5 minutes. Add tomatoes with juices, herbs and crushed pepper; cook 5 minutes. Add clam juice, wine, snapper, lobster shells, and juices and shrimp shells; bring to boil. Reduce heat and simmer uncovered 1 hour.",
        "Working in batches, strain stew through large sieve into second large pot, reserving solids. Set food mill over second pot. Working with 2 cups reserved stew-base solids at a time, press through food mill to extract remaining broth and some fish and vegetables to make 13 cups stew base. Discard remaining solids.",
        "Boil stew base until reduced to 10 cups, stirring occasionally, about 15 minutes. (Can be made 1 day ahead. Chill stew base uncovered until cold, then cover and keep chilled. Keep lobster and shrimp chilled.)",
        "Bring stew base to simmer; keep warm. Combine scallops, crabmeat (if desired), shrimp, and lobster meat in large bowl. Add flour; toss gently to coat. Place seafood in sieve; shake off excess flour. Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add half of seafood. Sauté 1 minute. Add half of butter, then 2 tablespoons parsley, half of garlic, and half of shallot. Sauté until scallops and shrimp are just opaque in center and all seafood is beginning to brown, about 4 minutes. Transfer to large bowl. Repeat with remaining oil, butter, seafood, 2 tablespoons parsley, garlic, and shallot; transfer to same bowl. Add wine to skillet and boil until reduced to glaze, scraping up browned bits, about 3 minutes. Mix glaze into seafood.",
        "Ladle stew base into shallow bowls. Arrange seafood in center. Sprinkle with 2 tablespoons parsley."
    ],
    "ingredients": [
        "2 1 1/3- to 1 1/2-pound live lobsters",
        "2 pounds uncooked large shrimp with shells",
        "1 1/4 cups olive oil",
        "2 medium onions, chopped",
        "1 cup chopped celery",
        "1 cup chopped fresh fennel bulb",
        "12 garlic cloves, peeled, flattened",
        "1/4 cup tomato paste",
        "1 28-ounce can plus 2 cups diced tomatoes in juice",
        "1 bunch fresh basil",
        "4 large fresh thyme sprigs",
        "4 large fresh parsley sprigs",
        "2 large fresh oregano sprigs",
        "2 bay leaves",
        "1 teaspoon dried crushed red pepper",
        "4 8-ounce bottles clam juice",
        "2 cups dry white wine",
        "3 pounds red snapper fillets",
        "16 large sea scallops",
        "1 pound large lump crabmeat (optional)",
        "1/2 cup all purpose flour",
        "6 tablespoons olive oil",
        "3 tablespoons unsalted butter",
        "6 tablespoons chopped fresh parsley",
        "2 large garlic cloves, minced",
        "1 large shallot, minced",
        "1/2 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Tomato",
        "Stew",
        "Snapper",
        "Crab",
        "Lobster",
        "Scallop",
        "Fennel",
        "White Wine",
        "Winter",
        "Thyme",
        "Parsley",
        "Oregano"
    ],
    "title": "Lobster and Shrimp Cioppino",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-and-shrimp-cioppino-105674"
}
