{
    "directions": [
        "Bring large pot of salted water to boil. Drop 1 lobster headfirst into water. Boil until just cooked through, about 10 minutes. Using tongs, transfer lobster to baking sheet. Repeat with remaining lobsters. Cool lobsters. Twist claws and tails off lobsters. Crack claws and claw joints; remove meat. Remove lobster meat from tails. Cut lobster meat into 1/2-inch cubes. (Can be made 1 day ahead; cover and chill.)",
        "Steam potatoes until just tender, about 10 minutes. Transfer to large bowl and cool. Heat 4 tablespoons oil in heavy large skillet over medium-high heat. Add onion; sauté until golden and crisp, about 12 minutes. Cool onion.",
        "Place tomatoes, corn, sliced basil, and remaining 1 tablespoon oil in medium bowl; toss to coat. Season with salt and pepper. Add lobster and onion to potatoes; mix in lemon juice. Season with salt and pepper. Mound lobster and potato salad in center of platter. Spoon tomato and corn salad around. Garnish with additional basil leaves."
    ],
    "ingredients": [
        "3 1 1/4-pound live lobsters",
        "3/4 pound red-skinned potatoes, unpeeled, cut into 1/2-inch cubes",
        "5 tablespoons olive oil",
        "1 large red onion, thinly sliced",
        "1 pound plum tomatoes, halved, seeded, diced (about 2 cups)",
        "1 cup fresh corn kernels (cut from 2 large ears of corn)",
        "1/2 cup (packed) thinly sliced fresh basil leaves",
        "1/4 cup fresh lemon juice",
        "Additional fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Potato",
        "Tomato",
        "Steam",
        "Lunch",
        "Basil",
        "Lobster",
        "Corn",
        "Summer",
        "Chill",
        "Healthy",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lobster Salad with Summer Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-salad-with-summer-vegetables-106943"
}
