{
    "directions": [
        "Fill large stockpot with water and bring to a boil. There should be enough water to cover lobsters completely when immersed. Place live lobsters in boiling water head first to minimize splashing. When water re-boils, turn down the heat, and simmer for 20 minutes. Do not overcook lobsters. Remove lobsters from the pot using tongs; save all the water in stockpot as this is now a flavorful stock to be re-used.",
        "Place 10 cups of stock in a clean stockpot and put on low heat. Clean claws and tails of lobsters and reserve meat, legs, and swimmerets. After lobsters are cleaned, place shells in stockpot with 10 cups of stock. Cut bodies in quarters and place in stockpot, making sure to include all roe and tomalley in pot. Add 1 cup tomato paste and simmer on low heat for 1 1/2 hours, stirring occasionally. Be careful not to have heat so high as to burn stock. Pour entire contents of pot through sieve into clean stockpot; this should now be 8 cups of glorious red stock.",
        "Place onions, celery, carrots, thyme, parsley and saffron in a large saute pan, add 4 cups stock from original stock pot and put on high heat for 30 minutes, stirring every 5 minutes. Add 1/2 cup tomato paste and black pepper. Turn down heat and simmer 30 minutes, stirring every 5 minutes. Press entire contents of saute pan through sieve into stockpot of 8 cups previously made stock.",
        "To finish Bisque, put pot on medium heat. Add heavy cream slowly, using whisk to blend. Add sherry. Simmer on low heat for 20 minutes; bisque will thicken slightly. Mix cornstarch with 1/4 cup water and slowly add to bisque with whisk. Simmer on low heat for another 20 minutes.",
        "If you prefer your bisque to be thicker, you may add more cornstarch, or perhaps, flour, but have found the bisque thickens nicely over low heat, and additional cornstarch or flour takes away from the wonderful flavor.",
        "Place pieces of previous cleaned lobster meat in bowl and add 1 cup of bisque. Garnish with legs and swimmerets around the bowl and one parsley leaf in center, if desired."
    ],
    "ingredients": [
        "4 (1 1/2-pound) lobsters",
        "1 1/2 cups tomato paste",
        "1 1/2 cups coarsely chopped onion",
        "1 1/2 cups coarsely chopped celery, including leaves",
        "1 1/2 cups coarsely chopped carrot",
        "1 sprig thyme",
        "3 sprigs flat-leaf parsley, plus extra, for garnish",
        "1/2 teaspoon saffron",
        "6 cups heavy cream",
        "1 cup cream sherry",
        "2 tablespoons freshly ground black pepper",
        "1/4 cup cornstarch"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Lobster Bisque",
        "Lobster",
        "Shellfish Recipes",
        "American",
        "Soup",
        "Celery",
        "Vegetable",
        "Carrot Recipes",
        "Tomato",
        "Dairy Recipes",
        "Appetizer",
        "Sauteing Recipes"
    ],
    "title": "Lobster Bisque",
    "url": "http://www.foodnetwork.com/recipes/lobster-bisque-recipe1"
}
