{
    "directions": [
        "1. Fill a large pot with 2 inches of salted water. Insert a steaming rack so that the lobster will not touch the water. Cover and bring to a boil. Add lobster and cover; cook 10 to 12 minutes. Remove to a platter and refrigerate to cool, about 30 minutes.",
        "2. Meanwhile, in a stainless steel bowl combine egg yolk and water. Whisk to combine. Add oil in a slow, steady stream until the dressing is emulsified and thick enough to coat the back of a spoon. Add half of the verbena and lemon juice. Season with salt and pepper. Set aside for 10 minutes to let flavors combine.",
        "3. Once cooled, remove lobster meat from shell, leaving claw and tail meat intact. Using a chef’s knife, slice tail meat into pieces 1/2 inch thick. Transfer claws and tail meat to a medium bowl. Add 2 tablespoons dressing and tomato strips. Toss to coat.",
        "4. Place greens in a medium bowl. Drizzle olive oil them and season with salt. Toss to lightly coat. Place 1 cup tossed greens in the center of each plate. Divide tail meat and claws. Drizzle 1 tablespoon dressing on each plate around lobster. Garnish each plate with radish and remaining verbena. Serve immediately. (Remaining dressing should be stored, tightly covered, in the refrigerator for up to 3 days.)",
        "Raw eggs should not be used in food prepared for pregnant women, babies, young children, the elderly, or anyone whose health is compromised."
    ],
    "ingredients": [
        "1 1/2 to 1 3/4 pound lobster",
        "1 large egg yolk, room temperature",
        "1 teaspoon water",
        "3/4 cup olive oil, more for dressing greens",
        "1/4 cup vegetable oil",
        "1 1/2 to 2 tablespoons lemon verbena, cut in chiffonade",
        "Juice of 1/2 lemon",
        "1 large vine-ripe tomato, peeled, seeded, and cut into 1/4-inch strips",
        "2 cups mesclun mix, pea shoots, or sunflower shoots",
        "2 radishes, julienned",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Herb",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Fourth of July",
        "Picnic",
        "Mother's Day",
        "Lunch",
        "Lemon",
        "Seafood",
        "Lobster",
        "Shower",
        "Lettuce",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lobster Salad with Lemon Verbena Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-salad-with-lemon-verbena-dressing-104671"
}
