{
    "directions": [
        "Bring 6 quarts water with 3 tablespoons salt to a boil in an 8- to 10-quart pot over high heat.",
        "Meanwhile, stir together cornstarch, broth, rice wine, soy sauce, sugar, and pepper in a small bowl until sugar is dissolved.",
        "Plunge lobsters headfirst into boiling water, then cover tightly and cook for 2 minutes from time lobsters enter water. Transfer lobsters with tongs to a large bowl of ice and cold water to stop cooking (lobsters will not be fully cooked), then drain lobsters in a colander. When cool enough to handle, twist off tail and claws (including joints) of 1 lobster. Cut body in half lengthwise through shell with shears, then remove and discard sand sacs from inside head. Cut body in half again crosswise. Halve tail lengthwise through shell with a cleaver or large heavy knife, then cut each half crosswise into 4 pieces. Working with same lobster, 1 claw at a time, wrap claws with joints in a kitchen towel and twist off claws from joints. Unwrap claws, then crack joints with a mallet or back of a large heavy knife. Chop claws in half lengthwise between pincers with a cleaver or large heavy knife. Transfer lobster pieces to a bowl, keeping meat in shells. Repeat with second lobster, putting pieces of second lobster in another bowl.",
        "Heat wok over high heat until a drop of water evaporates instantly. Pour 1 tablespoon vegetable oil down side of wok, then tilt wok to swirl oil, coating side. When oil begins to smoke, add pieces of 1 lobster and stir-fry just until meat starts to turn opaque, about 1 1/2 minutes. Transfer cooked lobster with a slotted spoon to a large bowl. Repeat with second lobster, transferring cooked pieces to same bowl.",
        "Add remaining tablespoon vegetable oil to wok, swirling to coat, then add beans, garlic, ginger, scallions, and pork and stir-fry until pork is no longer pink, about 1 minute.",
        "Stir cornstarch mixture, then add to pork in wok and bring to a boil. Add lobster and stir to coat, then reduce heat and simmer, covered, 2 minutes. Remove lid and pour eggs over lobster mixture in a thin circular stream. Cover wok and simmer just until eggs begin to set, 1 to 2 minutes. Drizzle with sesame oil, then gently toss. Serve immediately."
    ],
    "ingredients": [
        "1 tablespoon cornstarch",
        "3/4 cup reduced-sodium chicken broth",
        "1/4 cup Chinese rice wine or dry Sherry",
        "3 tablespoons soy sauce",
        "1 teaspoon sugar",
        "1/4 teaspoon black pepper",
        "2 (1 1/2-lb) live lobsters",
        "2 tablespoons vegetable oil",
        "2 tablespoons Chinese fermented black beans, rinsed and finely chopped",
        "2 teaspoons finely chopped garlic",
        "2 teaspoons finely chopped peeled fresh ginger",
        "4 scallions, trimmed and cut into 1 1/2-inch pieces",
        "1/4 lb ground fatty pork",
        "2 large eggs, lightly beaten",
        "2 teaspoons Asian sesame oil",
        "Special equipment: kitchen shears; a well-seasoned 14-inch flat-bottomed wok with a lid"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Pork",
        "Shellfish",
        "Stir-Fry",
        "Dinner",
        "Seafood",
        "Lobster",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Lobster Cantonese",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-cantonese-236029"
}
