{
    "directions": [
        "Bring an 8- to 10-quart pot of water to a boil, then plunge 2 lobsters headfirst into water and boil, covered, 6 minutes from time they enter water. Transfer with tongs to a shallow baking pan to cool, then boil remaining 2 lobsters.",
        "When lobsters are cool enough to handle, twist off tails, claws, and knuckles and remove meat, discarding bodies and shells. Cut tail meat crosswise into 1-inch-thick slices. Put lobster meat in a large bowl.",
        "Bring wine, water, and 1/2 teaspoon salt to a simmer in a wide heavy medium pot. Add scallops and poach at a bare simmer, uncovered, until scallops are just cooked through (opaque), 3 to 4 minutes. Transfer with a slotted spoon to bowl with lobster.",
        "Return liquid to a simmer over medium-high heat. Add mussels and cook, covered, stirring occasionally, until mussels just open wide, checking frequently after 4 minutes and transferring to bowl with seafood. (Discard any mussels that remain unopened after 6 minutes.)",
        "Strain cooking liquid through a sieve lined with a dampened paper towel. Rinse pot, then return liquid to pot and boil until reduced to 1 cup, about 8 minutes.",
        "Heat oil, garlic, vinegar, 1/2 cup reduced seafood liquid, and 1/2 teaspoon salt in a 1 1/2- to 2-quart nonreactive saucepan over medium-low heat, stirring occasionally, until warm, about 2 minutes. Add tomatoes and cook until they just begin to wilt but still hold their shape, 3 to 5 minutes.",
        "Pour hot vinaigrette over seafood and stir gently to coat. Marinate, covered and chilled, at least 2 hours. Bring to room temperature, about 30 minutes, before serving."
    ],
    "ingredients": [
        "4 (1 1/2-pound) live lobsters",
        "1/2 cup dry white wine",
        "2 1/2 cups water",
        "1 1/2 pounds sea scallops, tough ligament removed from side of each if attached and scallops halved horizontally if large",
        "2 pound cultivated mussels, scrubbed well and beards removed",
        "2/3 cup extra-virgin olive oil",
        "3 garlic cloves, finely chopped",
        "5 tablespoons white-wine vinegar",
        "1 pound grape tomatoes, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Tomato",
        "Marinate",
        "Lobster",
        "Mussel",
        "Scallop",
        "White Wine",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Lobster, Scallops, and Mussels with Tomato Garlic Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-scallops-and-mussels-with-tomato-garlic-vinaigrette-239289"
}
