{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes; drain.",
        "Melt 3 tablespoons butter in a large saucepan over medium heat; stir in shallots and cook and stir until soft, about 3 minutes. Stir flour into shallot mixture and cook for 1 minute; whisk in milk. Bring milk mixture to a gentle boil, whisking constantly.",
        "Set aside a large pinch of the Cheddar cheese, Gruyere cheese, and a few cubes of the Brie cheese to use for topping. Stir Dijon mustard and remaining Cheddar cheese, Gruyere cheese, and Brie cheese into milk mixture; remove from heat and stir until all cheese is melted, about 2 minutes; season with salt and pepper.",
        "Stir macaroni and lobster meat into cheese mixture; pour into a baking dish.",
        "Whisk panko bread crumbs, Parmesan cheese, and reserved Cheddar and Gruyere cheese together in a bowl; sprinkle over the top of lobster mixture. Cut remaining 1 tablespoon butter and reserved Brie cheese into tiny pieces and scatter evenly over crumb mixture.",
        "Bake in the preheated oven until bubbly and golden, about 20 minutes."
    ],
    "ingredients": [
        "1 (16 ounce) package uncooked elbow macaroni",
        "1/4 cup butter, divided",
        "2 shallots, finely chopped",
        "3 tablespoons all-purpose flour",
        "2 cups milk",
        "8 ounces white Cheddar cheese, shredded, divided",
        "4 ounces Gruyere cheese, shredded, divided",
        "4 ounces Brie cheese, rind removed, cubed, divided",
        "2 teaspoons Dijon mustard",
        "salt and ground black pepper to taste",
        "2 cooked lobster tails, peeled and coarsely chopped",
        "1 1/4 cups panko bread crumbs, or to taste",
        "1/4 cup grated Parmesan cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lobster Mac with Cheddar, Brie, and Gruyere",
    "url": "http://allrecipes.com/recipe/241362/lobster-mac-with-cheddar-brie-and-g/"
}
