{
    "directions": [
        "Kill the lobsters by plunging the tip of a large sharp knife straight down behind the lobsters' eyes. Separate tails from bodies. Wash well. Cut off fanned tail shells; set aside. Pull out the alimentary canal. Slice tails through lengthwise (first snip through the under-shell with scissors).",
        "Bring the fish stock to the boil in a large saucepan, add lobster bodies and tail fans and boil for 6 minutes (no longer or you will overcook the legs). Remove from the pot. Pull off legs and claws, cover and set aside with the tail fans (they will later decorate the completed dish). Strain and retain the stock for the sauce.",
        "Heat a little oil in a large saucepan and lightly cook the lobster tail pieces for about 1 minute. Set aside.",
        "Lightly brown the onions and garlic in the same pot (add extra oil if necessary), then add the chilli, curry leaves, cumin, coriander, turmeric, cardamom and cinnamon. Sizzle the spices for about 30 seconds, then add the chopped tomato, lemon juice, stock and a little salt and pepper. Cover and simmer for about 10 minutes.",
        "Just before serving return the lobster to the sauce and simmer for 2-3 minutes until cooked. Add the yoghurt and heat through. Tip into a warm bowl, or serve directly from the pan. Garnish with the reserved tail fans and legs, and serve with Yellow Rice and Quince Sambal."
    ],
    "ingredients": [
        "4 lobsters",
        "250 ml (1 cup) Fish Stock",
        "vegetable oil",
        "12 pickling onions, peeled",
        "10 ml (2 teaspoons) crushed garlic",
        "1-2 fresh chillies, finely sliced and seeded",
        "4-5 curry leaves",
        "5 ml (1 teaspoon) ground cumin",
        "5 ml (1 teaspoon) ground coriander",
        "2 ml (1/2 teaspoon) turmeric",
        "1 ml (1/4 teaspoon) ground cardamom",
        "1 stick cinnamon",
        "4 large, ripe tomatoes blanched, skinned, and chopped",
        "lemon juice",
        "salt, milled black pepper",
        "60 ml (1/4 cup) plain yoghurt (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Shellfish",
        "Tomato",
        "Sauté",
        "Yogurt",
        "Lobster",
        "Spice",
        "Fall",
        "Simmer"
    ],
    "title": "Lobster Curry",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-curry-231242"
}
