{
    "directions": [
        "1. Pour the tomatoes, with all their juices, into a food processor and pulse until well blended. Set aside.",
        "2. Heat the olive oil in a large heavy pot over medium heat. Add the lobster pieces, and season with salt and pepper. Cook, stirring frequently (and adding more oil if needed), until the lobster turns bright red, 10 to 12 minutes.",
        "3. Add the shallots and garlic to the lobster, and toss with tongs. Add the wine and cognac, and cook over medium heat, turning the lobster carefully with tongs, until most of the liquid has evaporated, about 5 minutes. Then add the bell pepper, jalape&ntilede;o, processed tomatoes, tomato paste, sugar, 6 tablespoons of the parsley, and the basil and oregano. Simmer (do not boil), stirring occasionally, over medium to medium-low heat until the flavors blend together, 20 minutes.",
        "4. While the mixture is cooking, bring a large pot of salted water to a boil. Add the spaghettini and cook until al dente, according to the package directions. Drain, and set aside.",
        "5. To serve, make delicate swirls of spaghettini in the center of four shallow pasta bowls. Arrange the lobster tails and claws, with the sauce, on top of the pasta. Sprinkle with the remaining 2 tablespoons parsley. Serve the lobster bodies and legs in a separate bowl and let the guests help themselves. Serve immediately, with plenty of napkins."
    ],
    "ingredients": [
        "5 cups canned Italian plum tomatoes, with their juices",
        "4 tablespoons extra-virgin olive oil, or more if needed",
        "3 fresh lobsters (each 1 1/2 pounds), each cut into 8 pieces (see Note)",
        "Salt and freshly ground black pepper, to taste",
        "2 large shallots, finely minced",
        "2 tablespoons finely minced garlic",
        "3/4 cup dry white wine",
        "1/4 cup cognac",
        "1 small red bell pepper, stemmed, seeded, and cut into 1/4-inch dice",
        "2 teaspoons finely minced fresh red jalapeño or serrano chile, with seeds and ribs; or 1/2 teaspoon crushed red pepper flakes",
        "3 tablespoons tomato paste",
        "1/2 teaspoon sugar",
        "8 tablespoons chopped fresh flat-leaf parsley leaves",
        "2 tablespoons torn fresh basil leaves",
        "2 teaspoons dried oregano",
        "12 ounces spaghettini"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Shellfish",
        "Tomato",
        "Dinner",
        "Lobster",
        "Cognac/Armagnac",
        "Anniversary",
        "Jalapeño",
        "Engagement Party",
        "Potluck",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lobster Fra Diavolo",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-fra-diavolo-351009"
}
