{
    "directions": [
        "Place a medium saucepan on a burner and add 2 cups water. Bring to a boil, then reduce the heat and slowly whisk in all of the butter. Hold warm until ready to heat lobsters.",
        "Marinate filets in 1/4 cup olive oil, cracked black pepper, and thyme for 1 hour at room temperature.",
        "Preheat a grill. Season filets with kosher salt and grill to desired temperature. Remove from grill and allow to rest for 4 minutes before serving.",
        "While meat is coking, reheat the melted butter if needed. While meat is resting, place the lobster tails and claws in the butter and heat until warmed all the way through, about 3 minutes.",
        "Meanwhile, heat remaining 1/4 cup olive oil in a saute pan over medium heat. Add chopped garlic and blanched baby spinach and saute until heated through.",
        "For each dish, place a potato cake in the center of a plate, top with sauteed spinach, and a lobster tail. Thinly slice the filet into 6 slices and fan the filet out in front of the potato and spinach. Top with the lobster claw and pour sauce around the plate. Serve spaetzle as a side dish.",
        "Preheat oven to 400 degrees F.",
        "In a baking dish, toss the whole potatoes with the olive oil, salt, and pepper. Roast until mostly cooked through. Remove from oven and cool. Peel potatoes and grate. Season with salt and pepper, to taste.",
        "Melt the butter in a saute pan over medium heat. Saute the onion until tender. Add the cooked onion to the grated potato mixture. Form into 4 patties, place on a cookie sheet, cover with plastic wrap, and chill in the refrigerator.",
        "Heat about 1/4 cup of olive oil in a large saute pan over medium-high heat. Add potato cakes and saute until golden brown on both sides and heated through, about 2 minutes on each side. Drain on paper towels.",
        "Preheat oven to 500 degrees F. Place lobster heads on a sheet tray and roast until slightly browned, approximately 15 to 20 minutes. In the meantime, sweat onion, carrot, celery, shallots, and garlic in 1/2 stick of butter in a large saucepan. Add brandy and reduce until almost dry. Add white wine and reduce. Add tarragon, bay leaves, parsley, thyme, basil, chicken stock, tomato paste, and roasted lobster heads. Bring to a boil and simmer for 2 hours, skimming periodically. Strain through a chinois, return to the pan, and reduce by half until the sauce starts to thicken, approximately 30 minutes. In the meantime, reduce heavy cream by half in a small saucepan. Whisk in the heavy cream and finish sauce by slowly adding the remaining 1/2 stick of butter, 1 tablespoon at time. Keep warm until ready to serve.",
        "Beat egg, yolks, and milk in bowl and set aside. Measure all dry ingredients and place in bowl. Add egg mixture to flour mixture and blend with hand, then add the melted butter. Let batter rest for 30 minutes.",
        "Bring a large pot of boiling, salted water to a boil. Place a perforated hotel pan over the boiling water. Pour the batter into the perforated pan and press it through into the water. Cook until spaetzle rises to the top. Drain and shock in ice water. Drain again and toss with the oil. Serve as a side with the lobster."
    ],
    "ingredients": [
        "2 pounds unsalted butter",
        "4 (1 1/2-pound) poached Maine lobsters, tail and claw meat removed (reserve bodies for Thermidor Sauce)",
        "4 (6-ounce) filet mignons",
        "1/2 cup olive oil, divided",
        "4 teaspoons cracked black pepper",
        "4 teaspoons chopped fresh thyme leaves",
        "Kosher salt",
        "4 teaspoons chopped garlic",
        "4 cups blanched baby spinach, all liquid squeezed out",
        "4 Potato Cakes, recipe follows",
        "8 ounces Thermidor Sauce, recipe follows",
        "Spaetzle, recipe follows",
        "4 Yukon gold potatoes",
        "1 tablespoon olive oil",
        "1 tablespoon kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 stick butter",
        "1 white onion, chopped into 1/4-inch dice",
        "Olive oil, for sauteing",
        "3 lobster bodies, cleaned of gills",
        "1 onion, cut into medium dice",
        "1 carrot, cut into medium dice",
        "1 celery stalk, cut into medium dice",
        "1/2 cup medium-diced shallots",
        "8 garlic cloves, lightly smashed",
        "1/2 stick butter, plus 1 stick, cut into tablespoons for sauce",
        "2 cups brandy",
        "6 cups white wine",
        "2 sprigs fresh tarragon",
        "2 bay leaves",
        "1/4 bunch fresh parsley",
        "2 sprigs fresh thyme",
        "1/8 bunch fresh basil",
        "4 cups chicken stock",
        "1/2 cup tomato paste",
        "1 cup heavy cream",
        "1 egg",
        "3 egg yolks",
        "3/4 cup milk",
        "2 cups all-purpose flour",
        "1/4 teaspoon grated nutmeg",
        "1 tablespoon each kosher salt and freshly ground pepper",
        "1/2 cup melted butter",
        "1 teaspoon olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Celery",
        "Vegetable",
        "Beef",
        "Meat",
        "Spinach",
        "Tomato",
        "Shallot Recipes",
        "Lobster",
        "Shellfish Recipes",
        "Carrot Recipes",
        "Potato",
        "Main Dish Recipes",
        "Dinner Parties",
        "Recipes for Parties",
        "Sauteing Recipes",
        "Marinating Recipes",
        "Grilling"
    ],
    "title": "Lobster Thermidor",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/lobster-thermidor-recipe"
}
