{
    "directions": [
        "Peel and devein the shrimp, reserving the shells and heads. Chop the shrimp into bite-size pieces.",
        "To make the shrimp stock, combine the shrimp shells and heads, onion, and celery in a large pot. Squeeze the lemon juice into the pot, then add the lemon halves as well. Add the dried basil, oregano, thyme, peppercorns, 1/2 cup parsley, and 3 cups of water. Cover the pot and bring to a boil. Reduce heat and simmer, uncovered, for 1 hour, skimming away any foam or impurities that have risen to the surface. Strain the shrimp stock and set aside.",
        "Heat the butter in a large skillet over medium heat. Cook the shrimp pieces until pink and almost cooked through, 1 to 2 minutes. Remove and set aside. Add the shallots to the pan; cook and stir until the shallots have softened and turned translucent, about 5 minutes.",
        "Stir in the garlic, lemon zest, salt, and ground pepper. Cook for thirty seconds, then add the white wine. Bring to a boil and cook until the white wine is reduced by half, about 5 minutes. Add the shrimp stock to the pan, bring it to a boil, and simmer until the sauce is reduce by half, about 15 minutes.",
        "Meanwhile, fill a large pot with heavily salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in ravioli, and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 3 to 4 minutes. Drain well, reserving a little pasta-cooking water to thin the sauce, if necessary.",
        "Stir the diced tomatoes and cream into the shrimp sauce and heat through. Return the shrimp to the pan, taste the sauce, and season to taste with salt and pepper. Fold the ravioli into the sauce.",
        "Place four ravioli onto each of four warmed pasta bowls or plates and top with sauce. Garnish the pasta with chopped parsley and lemon zest."
    ],
    "ingredients": [
        "For the Shrimp Stock:",
        "1/2 pound unpeeled large shrimp",
        "1 yellow onion, quartered",
        "2 stalks celery with leaves, cut into pieces",
        "1 lemon, halved",
        "1 tablespoon dried basil",
        "1 tablespoon dried oregano",
        "1 tablespoon dried thyme",
        "2 tablespoons whole black peppercorns",
        "1/2 cup chopped fresh flat-leaf parsley",
        "3 cups water",
        "For the Sauce:",
        "1 tablespoon unsalted butter",
        "1 shallot, minced",
        "2 cloves garlic, minced",
        "2 teaspoons lemon zest",
        "1 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 cup white wine",
        "1 cup canned petite diced tomatoes",
        "1/2 cup heavy cream",
        "salt and freshly ground black pepper to taste",
        "16 lobster ravioli",
        "For Garnish:",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 teaspoon lemon zest"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lobster Ravioli in Tomato Cream Sauce with Shrimp",
    "url": "http://allrecipes.com/recipe/213134/lobster-ravioli-in-tomato-cream-sauce/"
}
