{
    "directions": [
        "Fill a 6-quart kettle three fourths full with salted water and bring to a boil. Plunge lobster headfirst into water and cook, covered, over high heat 8 minutes. Transfer lobster with tongs to a large bowl and in a measuring cup reserve 2 cups cooking liquid. Let lobster stand until cool enough to handle. Working over a bowl to catch the juices, twist off tail and claws and reserve juices. Reserve tomalley and discard head sacs and any roe. Remove meat from claws and tail, reserving shells and lobster body. (Lobster meat will not be cooked through.) Coarsely chop meat and transfer to a bowl. Chill lobster meat, covered.",
        "Chop onion, celery, carrot, and tomato and halve garlic head crosswise. In a 6-quart heavy kettle heat oil over moderately high heat until hot but not smoking and sauté reserved lobster shells and body, stirring occasionally, 8 minutes. Add vegetables, garlic, herbs, peppercorns, brandy, and Sherry and simmer, stirring, until almost all liquid is evaporated, about 5 minutes. Add stock and reserved tomalley and cooking liquid. Simmer mixture, uncovered, stirring occasionally, 1 hour.",
        "Pour mixture through a fine sieve into a large saucepan, pressing on and discarding solids. Whisk in tomato paste and simmer until reduced to about 3 cups, about 10 minutes. Add cream and simmer bisque 5 minutes. In a small bowl stir together cornstarch and water and whisk into bisque. Simmer bisque, stirring, 2 minutes. (Bisque will thicken slightly.) Add lobster meat with any reserved juices and simmer bisque 1 minute, or until lobster meat is just cooked through. Season bisque with salt and pepper."
    ],
    "ingredients": [
        "a 3-pound live lobster",
        "1 medium onion",
        "1 celery rib",
        "1 carrot",
        "1 vine-ripened tomato",
        "1 head garlic",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh tarragon leaves",
        "2 tablespoons chopped fresh thyme leaves",
        "1 bay leaf",
        "8 black peppercorns",
        "1/2 cup brandy",
        "1/2 cup dry Sherry",
        "4 cups fish stock*",
        "1/4 cup tomato paste",
        "1/2 cup heavy cream",
        "1 1/2 tablespoons cornstarch",
        "2 tablespoons water",
        "*available at fish markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Dairy",
        "Herb",
        "Vegetable",
        "Lobster",
        "Gourmet"
    ],
    "title": "Lobster Bisque",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-bisque-14916"
}
