{
    "directions": [
        "Bring very large pot of salted water to boil. Add lobsters. Boil until cooked through, about 12 minutes (or cook in batches, if necessary). Using tongs, transfer lobsters to large rimmed baking sheet. Remove meat from tail and claws; place meat in medium bowl. Remove any roe from bodies and place in small bowl. Cover and chill meat and roe (if any). Remove tomalley (green matter) from bodies and discard. Reserve bodies and shells.",
        "Heat oil in heavy large pot over high heat. Add reserved lobster bodies and shells. Sauté 3 minutes. Reduce heat to low. Add tomato paste; stir 3 minutes. Stir in tomatoes, wine, vinegar, garlic, tarragon, thyme, and parsley. Add cream; boil 2 minutes. Reduce heat to medium-low. Simmer just until lobster flavor infuses cream, stirring occasionally, about 20 minutes. Strain sauce into large bowl, pressing on solids to extract as much liquid as possible. Discard contents of strainer. (Lobster and sauce can be prepared 1 day ahead. Cover separately and chill.)",
        "Transfer sauce to heavy large saucepan. Cut lobster meat into bite-size pieces; coarsely crumble roe, if using. Add to sauce. Gently rewarm over low heat, stirring occasionally.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain; return pasta to pot. Add sauce; toss over medium-high heat until sauce coats pasta, about 4 minutes. Season with salt and pepper. Transfer to large shallow bowl and serve."
    ],
    "ingredients": [
        "3 1 3/4-pound live lobsters",
        "3 tablespoons olive oil",
        "1/4 cup tomato paste",
        "2 large plum tomatoes, chopped",
        "1/3 cup dry white wine",
        "2 tablespoons white wine vinegar",
        "2 garlic cloves, sliced",
        "2 fresh tarragon sprigs",
        "2 fresh thyme sprigs",
        "2 fresh Italian parsley sprigs",
        "6 cups whipping cream",
        "1 1/2 pounds fettuccine or linguine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Lobster",
        "White Wine",
        "Fall"
    ],
    "title": "Lobster Pasta with Herbed Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-pasta-with-herbed-cream-sauce-231284"
}
