{
    "directions": [
        "Place thawed lobster and fresh lime juice in medium bowl; toss to coat. Let stand 15 minutes, tossing lobster occasionally.",
        "Heat olive oil in heavy large pot over high heat. Add lobster pieces and any accumulated juices. Sauté until lobster shells turn bright orange, about 4 minutes. Using slotted spoon, return lobster to same bowl. Reduce heat to medium. Add chopped onion and chopped bell pepper to pot; sauté until soft, about 5 minutes. Add chopped garlic cloves, fresh parsley, and paprika and sauté 1 minute. Add diced tomatoes and tomato purée. Cook until juices thicken, stirring frequently, about 8 minutes. Add clam juice, dry Sherry, and bay leaf. Season to taste with salt. Add cayenne pepper. Bring mixture to boil, then add stone crab claws and reserved lobster with any accumulated juices. Reduce heat to medium-low, cover, and simmer until lobster meat is cooked through and tender, about 10 minutes."
    ],
    "ingredients": [
        "2 uncooked frozen lobster tails (1 1/2 pounds total), thawed, cut in half lengthwise, each half cut into thirds with shell intact",
        "1 tablespoon fresh lime juice",
        "1/4 cup olive oil",
        "1/3 cup chopped onion",
        "2 tablespoons chopped green bell pepper",
        "2 garlic cloves, chopped",
        "1 tablespoon chopped fresh parsley",
        "1/4 teaspoon paprika",
        "2 large plum tomatoes, seeded, diced",
        "1/2 cup canned tomato purée",
        "3/4 cup bottled clam juice",
        "1/2 cup dry Sherry wine",
        "1 bay leaf",
        "1/4 teaspoon cayenne pepper",
        "1 pound stone crab claws, cracked"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Tomato",
        "Sauté",
        "Crab",
        "Lobster",
        "Sherry",
        "Summer"
    ],
    "title": "Lobster and Stone Crab Enchilado",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-and-stone-crab-enchilado-234798"
}
