{
    "directions": [
        "Place mustard in small bowl. Whisk in 2 tablespoons vinegar and orange juice. Gradually whisk in oil. Mix in tarragon, shallot and orange peel. Season dressing to taste with salt and pepper.",
        "Char bell peppers over gas flamer or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel and seed peppers; cut into 1/2-inch pieces. Place in large bowl.",
        "Bring large pot of salted water to boil. Add lobster tails and cook 10 minutes. Transfer to bowl of ice water and cool. Add green beans to same pot of boiling water and cook until crisp-tender, about 5 minutes. Using slotted spoon, transfer beans to another bowl of ice water and cool. Add potato to same pot of boiling water and cook 2 minutes. Add corn kernels; cook until potato and corn are just tender, about 2 minutes longer. Drain well; add to bowl with peppers. Drain green beans; pat dry with paper towels. Add beans to potato mixture.",
        "Drain lobster; remove meat from shells. Cut meat crosswise into rounds. (Dressing, lobster and salad can be prepared 4 hours ahead. Cover separately and refrigerate.) Mix lobster with 1 1/2 tablespoons dressing. Mix remaining dressing into salad. Season with salt and pepper.",
        "Toss greens with remaining 1 tablespoon vinegar. Place on large platter. Mound salad on greens. Arrange lobster over greens and serve."
    ],
    "ingredients": [
        "1 tablespoon Dijon mustard",
        "3 tablespoons seasoned rice vinegar",
        "2 1/2 tablespoons fresh orange juice",
        "1 1/2 tablespoons olive oil",
        "1 1/2 tablespoons chopped fresh tarragon or 1 1/2 teaspoons dried",
        "1 large shallot, minced",
        "1 teaspoon (packed) grated orange peel",
        "1 large yellow bell pepper",
        "1 large red bell pepper",
        "2 8-to-10 ounce uncooked lobster tails (thawed, if frozen)",
        "12 ounces small green beans, trimmed",
        "1 large white-skinned potato, cut into 1/2-inch pieces",
        "1 large ear fresh corn",
        "10 cups mixed baby greens (about 5 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Potato",
        "Low Cal",
        "Orange",
        "Lobster",
        "Corn",
        "Green Bean",
        "Bell Pepper",
        "Summer",
        "Chill",
        "Healthy",
        "Tarragon",
        "Lettuce",
        "Boil"
    ],
    "title": "Lobster and Confetti Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-and-confetti-vegetable-salad-4332"
}
