{
    "directions": [
        "Preheat oven to 350°F. Toss garlic with oil in small baking dish. Cover; bake until tender, about 1 hour. Cool. Remove garlic from skin and mash in bowl. Mix in mayonnaise, lemon juice, and cumin. Set aside.",
        "Steam potatoes until tender, about 13 minutes. Transfer to large bowl; cool. Add 1/2 cup onions, eggs, and 1/2 cup dressing; toss to coat. Season with salt and pepper.",
        "Toss all cabbage, carrots, remaining chopped onions and remaining dressing in large bowl. Season with salt and pepper. (Potato salad and coleslaw can be made 6 hours ahead; cover and refrigerate separately.)",
        "Drop lobsters headfirst into large pot of boiling water. Cover; cook until shells are bright red and centers are opaque, about 9 minutes. Using tongs, transfer lobsters, shell side down, to work surface. Place tip of large knife into center of each lobster and cut lengthwise in half from center to end of head (knife may not cut through shell); then cut in half from center to end of tail. Use poultry shears to cut through shell if necessary. Serve lobster halves with potato salad and coleslaw."
    ],
    "ingredients": [
        "18 large garlic cloves, unpeeled",
        "2 tablespoons olive oil",
        "1 cup mayonnaise",
        "1/4 cup fresh lemon juice",
        "2 teaspoons ground cumin",
        "8 small red-skinned new potatoes, cut into wedges",
        "1 bunch green onions, chopped",
        "2 hard-boiled eggs, chopped",
        "2 cups sliced green cabbage",
        "2 cups sliced purple cabbage",
        "2 carrots, peeled, cut into matchstick-size strips",
        "2 1 1/2-pound live lobsters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Potato",
        "Lobster",
        "Summer",
        "Cabbage"
    ],
    "title": "Lobster with Roasted Garlic-Potato Salad and Coleslaw",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-with-roasted-garlic-potato-salad-and-coleslaw-105163"
}
