{
    "directions": [
        "Plunge lobster headfirst into pot of boiling water; boil 4 minutes. Using tongs, transfer to cutting board. Cut off tail and claws. Crack tail and claws and remove meat. Cut meat into 1/2-inch pieces. Cut body and shells into 2-inch pieces. Chill meat; reserve shells.",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add lobster body, lobster shells, and shrimp shells to skillet and sauté 4 minutes. Add onion and next 4 ingredients; sauté 6 minutes. Add tomato paste; stir 1 minute. Remove from heat; stir in Cognac. Add 3 cups water; bring to boil. Reduce heat, cover, and simmer 30 minutes.",
        "Strain mixture into bowl, pressing on solids to extract liquid; discard solids. Set stock aside. Heat 1 tablespoon oil in same skillet over medium-high heat. Add shrimp; sauté until just opaque in center, about 3 minutes. Cool slightly. Coarsely chop shrimp.",
        "Melt 2 tablespoons butter in large saucepan over medium heat. Add flour; stir 1 minute. Add stock and cream; simmer until sauce is reduced to 2 cups, about 5 minutes. Add cheese; stir until smooth. Season with salt and pepper. Remove from heat.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain. Stir lobster, shrimp, pasta, crab, and 2 tablespoons butter into sauce. Stir over medium-low heat until heated through, about 2 minutes. Season with salt and pepper. Serve topped with chives."
    ],
    "ingredients": [
        "1 1 3/4- to 2-pound live lobster",
        "2 tablespoons olive oil, divided",
        "12 large shrimp, peeled, deveined, shells reserved",
        "1 cup chopped onion",
        "3/4 cup chopped peeled carrots",
        "3/4 cup chopped celery",
        "2 garlic cloves, peeled, flattened",
        "1 Turkish bay leaf",
        "1 tablespoon tomato paste",
        "1/4 cup Cognac or brandy",
        "3 cups water",
        "4 tablespoons (1/2 stick) butter, divided",
        "2 tablespoons all purpose flour",
        "1 cup whipping cream",
        "1 1/2 cups grated Fontina cheese (about 6 ounces)",
        "8 ounces shell or gemelli pasta",
        "6 ounces fresh crabmeat, picked over",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Lobster",
        "Shrimp",
        "Brandy",
        "Winter"
    ],
    "title": "Lobster Macaroni and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-macaroni-and-cheese-230624"
}
