{
    "directions": [
        "With a small (about 1/4-inch) melon-ball cutter scoop outer flesh of zucchini, reserving remaining zucchini for another use if desired. (There should be about 1 1/2 cups zucchini pieces.) In a saucepan of boiling water blanch zucchini and corn 1 minute and drain well. Let vegetables cool and transfer to a large bowl.",
        "Break off claws at body of each lobster. Crack claws and remove meat. Cut claw meat into 1/2-inch pieces and add to vegetables. Twist tails off lobster bodies, keeping them intact, and discard bodies. With a pair of kitchen shears remove thin hard membrane from each lobster tail by cutting just inside outer edge of shell. Remove meat from tail and reserve tail shells for serving. Cut tail meat into 1/2-inch pieces and add to claw meat mixture.",
        "In a small bowl whisk together mayonnaise, vinegar or lemon juice, and salt and pepper to taste and add to lobster mixture. Toss salad gently just to combine well. Salad may be prepared up to this point 8 hours ahead and chilled, covered.",
        "Just before serving, stir shredded basil into salad. Mound about 1/2 cup salad into each reserved lobster tail and arrange on a platter. Transfer remaining salad to a serving bowl and garnish platter and bowl with basil."
    ],
    "ingredients": [
        "4 zucchini (about 2 pounds)",
        "1 1/2 cups fresh corn (cut from about 3 ears)",
        "12 boiled or steamed 1 1/4-pound lobsters",
        "1/2 cup mayonnaise, or to taste",
        "3 to 4 tablespoons white-wine vinegar or fresh lemon juice",
        "1/2 cup finely shredded fresh basil leaves",
        "Garnish: fresh basil sprigs and finely shredded basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Side",
        "Wedding",
        "Basil",
        "Lobster",
        "Corn",
        "Zucchini",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lobster, Corn, Zucchini, and Basil Salad",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-corn-zucchini-and-basil-salad-12049"
}
