{
    "directions": [
        "Fill very large pot 2/3 full with salted water; bring to boil over high heat. Meanwhile, place potatoes, onions, and fennel in another very large pot. Add beer and 4 cups water; sprinkle with Old Bay seasoning and salt. Add 5 thyme sprigs and sausage. Bring to boil over high heat; reduce heat to medium-high. Cover; cook 15 minutes. Add corn, then mussels and remaining thyme. Cover and cook until mussels open and potatoes are cooked through, about 15 minutes longer.",
        "Meanwhile, drop lobsters headfirst into salted boiling water; cover. Boil until cooked through and shells turn bright red, about 13 minutes. Using tongs, remove lobsters from pot. Split in half lengthwise.",
        "Melt butter in saucepan and divide among 6 ramekins.",
        "Remove corn, fennel, onions, potatoes, and mussels from pot (discard any mussels that do not open). Divide among 6 large bowls. Place 1/2 lobster atop mixture in each bowl. Season broth with salt and pepper; pour over seafood and vegetables. Serve with melted butter, lemons, and Lemon-Herb Mayonnaise."
    ],
    "ingredients": [
        "18 small red-skinned potatoes",
        "6 small onions, quartered lengthwise",
        "1 fresh fennel bulb (about 1 pound), trimmed, halved lengthwise, thinly sliced crosswise",
        "2 12-ounce bottles pale ale",
        "4 cups water",
        "1 tablespoon Old Bay seasoning",
        "1 tablespoon coarse kosher salt",
        "10 fresh thyme sprigs",
        "1 pound kielbasa or linguiça sausage, cut into 1-inch pieces",
        "6 ears of corn, husked",
        "2 1/2 pounds mussels, scrubbed, debearded",
        "3 1 3/4-pound live lobsters",
        "1 cup (2 sticks) butter",
        "Lemon wedges",
        "Lemon-Herb Mayonnaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Dinner",
        "Sausage",
        "Seafood",
        "Lobster",
        "Mussel",
        "Corn",
        "Fall",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lobster with Sausage, Mussels, Corn, and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-with-sausage-mussels-corn-and-potatoes-108443"
}
