{
    "directions": [
        "1. Prepare a large bowl of ice water.",
        "2. Fill the pasta pot with 3 quarts of water and bring it to a rolling boil over high heat. Add the coarse salt and the beans, and blanch until crisp-tender, 3 to 4 minutes. (Cooking time will vary according to the size and tenderness of the beans.) Immediately remove the colander from the water, letting the water drain from the beans. Plunge the beans into the ice water so they cool down as quickly as possible. (The beans will cool in 1 to 2 minutes. If you leave them longer, they will become soggy and begin to lose flavor.) Drain the beans and wrap them in a thick kitchen towel to dry. (Store the cooked beans in the refrigerator for up to 4 hours.)",
        "3. In a large, shallow bowl, combine the yogurt, mustard, and fine salt and whisk to blend. Taste for seasoning. Add the green beans, chives, apple, avocado, and lobster. Toss to coat. Arrange on the plates and serve."
    ],
    "ingredients": [
        "3 tablespoons coarse sea salt",
        "10 ounces slim haricots verts (green beans), trimmed at both ends and cut into 1/2-inch pieces (2 cups)",
        "1 cup Greek-style yogurt",
        "1 tablespoon imported French mustard",
        "1/4 teaspoon fine sea salt",
        "1/4 cup minced fresh chives",
        "1 Granny Smith apple, cored, and cut into 1/4-inch cubes (do not peel)",
        "1 large ripe avocado, halved, pitted, peeled, and cut into 1/4-inch cubes",
        "1 pound (2 cups) cooked lobster meat, cut into bite-sized pieces",
        "Equipment: A 5-quart pasta pot fitted with a colander; 4 chilled large dinner plates"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Quick & Easy",
        "Yogurt",
        "Dinner",
        "Lunch",
        "Apple",
        "Seafood",
        "Lobster",
        "Avocado",
        "Green Bean",
        "Spring",
        "Summer",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Lobster Salad with Green Beans, Apple, and Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-salad-with-green-beans-apple-and-avocado-364850"
}
