{
    "directions": [
        "In a large (5-to 6-quart) kettle combine water and 1 cup wine and bring to a boil. Plunge lobsters into liquid headfirst and return liquid to a boil. Simmer lobsters, covered, 9 minutes. With tongs plunge lobsters immediately into cold water to stop cooking, reserving cooking liquid.",
        "Working over a bowl to catch the juices, twist off tails and claws and reserve juices. Discard tomalley, head sacs, and any roe and remove meat from tails and claws, reserving it separately.",
        "To reserved cooking liquid add lobster shells, reserved lobster juices and shrimp shells, 1 onion, quartered, 1 cup fennel, half of carrots, celery, 1 bay leaf, thyme, parsley, peppercorns, and zest. Simmer mixture gently, uncovered, skimming froth occasionally, 1 1/4 hours.",
        "Strain stock through a large sieve set over a large bowl and pour into cleaned kettle. Boil stock until reduced to about 6 cups and return to bowl. Stock, cooked lobster, and shelled raw shrimp keep, covered separately and chilled, 1 day.",
        "In a kettle cook remaining onion, chopped fine, remaining 1 cup fennel, remaining carrots, remaining bay leaf, garlic, and salt and pepper to taste in oil over moderate heat, stirring, until vegetables are softened.",
        "Add remaining 1/2 cup wine and boil until mostly evaporated. Add saffron, tomatoes, and shellfish stock and simmer, covered, 20 minutes. Add shrimp and reserved lobster claw meat (reserving tail meat) and simmer 2 minutes, or until shrimp are cooked through. Remove soup from heat and remove 6 shrimp, reserving them. Discard bay leaf.",
        "In a blender purée soup in batches until smooth, transferring as it is puréed to a very fine sieve set over a saucepan. Force soup through sieve, pressing hard on solids, and whisk in cream, Pernod, and salt and pepper to taste. Heat bisque over moderate heat until hot (do not boil) and stir in lemon juice.",
        "Chop fine reserved shrimp and lobster tail meat and divide among heated soup bowls. Ladle soup over shellfish and garnish with reserved fennel fronds."
    ],
    "ingredients": [
        "16 cups water",
        "1 1/2 cups dry white wine",
        "two 1 1/4-pound live lobsters",
        "3/4 pound large shrimp (about 18), shelled, reserving shells, and deveined if desired",
        "2 medium onions",
        "1 fennel bulb, chopped (about 2 cups), reserving fronds for garnish if desired",
        "4 large carrots, chopped",
        "1 celery rib, chopped",
        "2 bay leaves",
        "3/4 teaspoon dried thyme, crumbled",
        "1/4 cup fresh parsley sprigs",
        "1/4 teaspoon black peppercorns",
        "the zest of 1 navel orange, removed in strips with a vegetable peeler",
        "3 garlic cloves, minced",
        "2 tablespoons olive oil",
        "1/4 teaspoon saffron threads",
        "a 28- to 32-ounce can whole tomatoes, drained and chopped",
        "1/4 cup heavy cream",
        "1 1/2 tablespoons Pernod, or to taste",
        "1 tablespoon fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Herb",
        "Onion",
        "Tomato",
        "Lobster",
        "Shrimp",
        "Saffron",
        "Fennel",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Lobster and Shrimp Bisque",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-and-shrimp-bisque-11531"
}
