{
    "directions": [
        "Plunge lobsters headfirst into an 8-quart pot of boiling salted water . Loosely cover pot and cook lobsters over moderately high heat 9 minutes from the time they enter water, then transfer with tongs to sink to cool.",
        "Remove meat from claws, joints, and tails. Discard (or save for another use) tomalley, any roe, and shells. Cut meat into 1/2-inch pieces and sprinkle with salt and pepper.",
        "While lobsters are cooling, cut pulp in 1 or 2 large pieces out of each pineapple half with grapefruit knife, then discard core and cut pulp into 1/2-inch pieces. Scrape juice and any remaining pulp from pineapple shells with a spoon (to form 1/4-inch-thick shells) into a fine sieve set over a bowl and drain until you have 2 to 3 tablespoons juice, about 2 minutes. Discard solids.",
        "Cook oil and garlic in a small saucepan over moderately low heat, stirring, until garlic is golden, 2 to 3 minutes, then discard garlic. Add garlic oil to pineapple juice along with lime juice, fish sauce, and sugar, whisking until sugar is dissolved. Add shallot, bell pepper, pineapple pieces, chile, and herbs. Toss lobster with pineapple mixture and serve mounded in pineapple shells."
    ],
    "ingredients": [
        "2 (1 1/4-lb) live lobsters",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 firm-ripe baby pineapples with leaves, halved lengthwise",
        "1/4 cup peanut or vegetable oil",
        "1 garlic clove, smashed",
        "2 tablespoons fresh lime juice",
        "1 tablespoon Asian fish sauce",
        "1 tablespoon sugar",
        "1 small shallot, thinly sliced",
        "1 red bell pepper, cut into 1/4-inch dice",
        "1 teaspoon minced fresh serrano chile, including seeds",
        "3 tablespoons chopped fresh mint",
        "2 tablespoons chopped fresh basil",
        "Special equipment: a serrated grapefruit knife"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Shellfish",
        "Pineapple",
        "Mint",
        "Basil",
        "Lobster",
        "Spring",
        "Gourmet"
    ],
    "title": "Lobster and Pineapple Salad with Basil and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-and-pineapple-salad-with-basil-and-mint-106522"
}
