{
    "directions": [
        "In a small, non-reactive bowl, toss together the onion, vinegar and and few pinches of salt. Set aside to lightly pickle for at least 30 minutes and up to 6 hours.",
        "Bring a large pot of heavily salted water to a boil and cook the lobsters in it for 12 minutes. Remove them from the pot and, when cool enough to handle, twist off and crack open the tails, using a kitchen towel to protect your hands.",
        "Remove the lobster roe (if available) from the place where the tail met the body. It is a coral-red bundle of tiny eggs. As best you can, delicately separate the eggs, taking care not to crush them, and set aside in a small bowl. Remove as much of the tomalley—the greenish substance found alongside the roe and possibly also in the head, that acts as the lobster’s liver and pancreas, and which is quite delicious—and add it to the bowl with the roe.",
        "Remove the meat from the shell and coarsely chop it. Remove the claws, crack them and extract the meat. Extract as much of the knuckle and body meat as possible. Arrange all of the lobster meat on a serving platter or in a serving bowl, cover and chill.",
        "In a small bowl, whisk together the olive oil, lemon juice, mayonnaise and salt to taste. Fold in the reserved lobster roe and tomalley, taste and adjust seasoning accordingly.",
        "When ready to serve, scatter the pickled onions and the tomatoes over the lobster. Pour the dressing mixture over the lobster and vegetables, and serve immediately."
    ],
    "ingredients": [
        "1 small onion, peeled and cut into julienne",
        "1/4 cup sherry vinegar",
        "Salt to taste",
        "2 (1 1/2-pound) lobsters (preferably female)",
        "1/4 cup best-quality Spanish or Italian extra-virgin olive oil",
        "2 tablespoons freshly squeezed lemon juice",
        "1 tablespoon mayonnaise",
        "1 small to medium tomato, cored and finely chopped, or 1 cup cherry tomatoes, cut in half"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lobster",
        "Tomato",
        "Lemon Juice",
        "Boil"
    ],
    "title": "Lobster Catalan, Revisited",
    "url": "http://www.epicurious.com/recipes/food/views/lobster-catalan-revisited"
}
