{
    "directions": [
        "Cut the lobster tail in half lengthwise.",
        "Melt half the butter in a pan, add the scallions and onion and cook for 5 minutes, or until soft but not colored. Add the carrot and cook for 2 minutes. Add the lobster halves, fish stock, parsley, bay leaf, peppercorns, the water. Bring to a boil, reduce the heat and simmer for 20 minutes, skimming the surface as required.",
        "Remove the lobster from the stock, cool slightly and take the meat from the shells. Set the lobster meat aside, crush the shell and return it to the pan. Continue simmering for further 40 minutes. Strain the stock, then strain again through a sieve lined with 2 layers of damp muslin or cheesecloth.",
        "Cut some thin slices from the lobster to use as a garnish and set aside. In a blender, blend the remaining lobster flesh with a little of the strained stock until smooth. Mix the flour and remaining butter to a paste.  Add the pureed lobster to the pot along with the flour paste, tomato puree, sherry, cream, nutmeg and salt and pepper, to taste. Mix well.",
        "Add the tarragon and the remaining stock and cook, stirring continuously, over high heat until the soup boils and thickens. Reduce the heat and simmer gently for 5 minutes. Season to taste and serve garnished with the reserved lobster and some sprigs of tarragon, if desired."
    ],
    "ingredients": [
        "14 ounces raw lobster tail",
        "1/3 cup butter, softened",
        "7 green onions, chopped",
        "1 onion, chopped",
        "1 carrot, chopped",
        "4 cups fish stock",
        "4 sprigs fresh parsley",
        "1 bay leaf",
        "4 whole black peppercorns",
        "2 1/2 cups water",
        "1/3 cup all-purpose flour",
        "1 3/4 cups tomato puree",
        "1 tablespoon sherry",
        "1/2 cup heavy cream",
        "1 pinch ground nutmeg",
        "2 teaspoons chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lobster Bisque I",
    "url": "http://allrecipes.com/recipe/13109/lobster-bisque-i/"
}
