{
    "directions": [
        "Pour bottle of wine into a non-reactive saucepan. Add the 3 cloves crushed and chopped garlic and the shallots and bring to a boil. Reduce heat to a simmer and cook until liquid is reduced to 1 cup. Strain through a fine strainer into another non-reactive saucepan. Add the half-and-half and simmer until thick; do not let boil. Whisk in 1 cup of the yogurt cheese to thicken. Simmer until just heated through and then remove from heat and keep warm.",
        "Preheat the broiler.",
        "Split the lobster tail lengthwise and then sprinkle with lemon juice. Place under the broiler and cook until done, about 5 minutes. Let cool. Remove from shell then slice into 1/4-inch circles. Set aside.",
        "In a food processor, combine pine nuts, the remaining 2 cloves garlic, and basil in a food processor and blend until smooth. Fold the pesto into the remaining 1/2 cup yogurt cheese. Arrange 4 wonton wrappers on a sheet tray. Place 1 circle of lobster on each wonton and then top with a teaspoon of the pesto filling, leaving a 1/4-inch border all the way around. Brush the wonton wrapper with the beaten egg. Top with another wonton and press firmly with a fork all the way around edges. Cover ravioli with a damp cloth and repeat until you have made 12 ravioli.",
        "In a large pot of simmering water, drop ravioli, in batches as necessary, and simmer for 3 to 4 minutes. Ravioli are done when they rise to the top. Remove ravioli with a slotted spoon and toss with the sauce. Sprinkle with Parmesan and minced basil.",
        "Line a strainer with cheesecloth. Place the strainer over a bowl. Pour the yogurt into the cheesecloth. Cover and refrigerate for at least 2 hours, or overnight. Discard the liquid in the bowl.",
        "Yield: about 1 1/2 to 1 3/4 cups"
    ],
    "ingredients": [
        "1 (750-milliliter) bottle dry white wine",
        "3 cloves garlic, crushed and roughly chopped, plus 2 cloves garlic, chopped",
        "2 tablespoons chopped shallots",
        "1 cup fat-free half-and-half",
        "1 1/2 cups yogurt cheese, divided, recipe follows",
        "1 (8-ounce) lobster tail",
        "1/2 lemon",
        "2 tablespoons pine nuts, toasted",
        "2 tablespoons chopped fresh basil, plus additional minced fresh basil for garnish",
        "1 egg, beaten",
        "24 (4-inch square) wonton wrappers",
        "1/4 cup finely grated Parmesan, for garnish",
        "1 pint plain non-fat yogurt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Lobster Ravioli",
        "Lobster",
        "Ravioli",
        "Shellfish Recipes",
        "Food Processor",
        "Italian",
        "European Recipes",
        "American",
        "Pasta Recipes",
        "Dairy Recipes",
        "Cheese",
        "Shallot Recipes",
        "Vegetable",
        "Main Dish Recipes",
        "Broiling"
    ],
    "title": "Lobster Ravioli",
    "url": "http://www.foodnetwork.com/recipes/lobster-ravioli0"
}
