{
    "directions": [
        "Cut the stems from the shiitake, discarding them, and chop the shiitake fine. (There should be about 1 cup packed finely chopped shiitake). Strain the reserved liquid through a fine sieve to remove any grit and reserve it for the sauce. In a large skillet cook the shallots in the oil over moderately low heat, stirring, until they are softened, stir in the celery, the carrot, and the garlic, and cook the mixture, stirring, until the vegetables are softened. Stir in the rosemary, the sage, the marjoram, the thyme, the parsley, and the Cognac and cook the mixture, stirring, for 1 minute. Add the lemon juice, the broth, the white mushrooms, and the chopped shiitake and cook the mixture, its surface covered with a round of buttered wax paper, stirring occasionally, until the mushrooms are tender. Boil the mixture, uncovered, stirring occasionally, until the liquid is evaporated. Stir in the cream and the bread crumbs, season the mixture with salt and pepper, and cook it over moderate heat, stirring, until it is thickened. Let the stuffing cool. The stuffing may be made 1 day in advance, kept covered and chilled, and brought to room temperature before the veal is stuffed.",
        "Using the handle of a wooden spoon, pack the stuffing into the veal a little at a time (there will be room, if the loin is tied loosely enough). Transfer the veal to a roasting pan just large enough to hold it and add 1 cup of the stock. Cover the veal with the fatback and roast it in the middle of a preheated 325°F. oven, basting it every 20 minutes with the pan juices, for 1 hour. Remove the fatback and roast the veal for 45 minutes to 1 hour more, or until it registers 150°F. on a meat thermometer. Transfer the veal to a cutting board and let it stand for 15 minutes.",
        "While the veal is standing, skim the fat from the pan juices, add the remaining 1/2 cup stock, and deglaze the pan over high heat, scraping up the brown bits, until the mixture is reduced by half. Strain the mixture through a fine sieve set over a saucepan, bring it to a boil with the reserved shiitake liquid, whisking, and simmer the mixture for 5 minutes, or until it is thickened slightly. Season the sauce with salt and the white pepper. In a skillet sauté the shiitake in the oil over moderately high heat, stirring occasionally, until they are heated through. Cut the veal into 16 slices, arrange 2 slices on each plate, and garnish each serving with 2 of the sautéed shiitake and some of the thyme sprigs."
    ],
    "ingredients": [
        "1 1/2 ounces dried shiitake mushrooms, soaked in 1 1/2 cups hot water for 20 minutes and drained, reserving the liquid",
        "1/2 cup minced shallots",
        "2 tablespoons olive oil",
        "1/4 cup minced celery",
        "3/4 cup minced carrot",
        "2 garlic cloves, minced",
        "1/2 teaspoon finely chopped fresh rosemary or 1/8 teaspoon crumbled dried",
        "1/2 teaspoon finely chopped fresh sage or 1/8 teaspoon dried, crumbled",
        "1/2 teaspoon finely chopped fresh marjoram or 1/8 teaspoon dried, crumbled",
        "1/2 teaspoon finely chopped fresh thyme or 1/8 teaspoon dried, crumbled",
        "1 1/2 tablespoons finely chopped fresh parsley leaves",
        "1 tablespoon Cognac",
        "2 teaspoons fresh lemon juice",
        "1/4 cup chicken broth",
        "1/4 pound small white mushrooms, chopped fine (about 1 1/4 cups)",
        "1/3 cup heavy cream",
        "1/2 cup fresh bread crumbs",
        "a 2 1/2- to 3-pound boned veal loin (preferably naturally raised) trimmed, a 1 1/2-inch-wide slit cut lengthwise through the center of  the loin, and the loin tied loosely at 1-inch intervals with kitchen string",
        "1 1/2 cups white veal stock or chicken broth",
        "thin slices of fatback for covering the veal",
        "white pepper to taste",
        "16 dried shiitake mushrooms (about 1 ounce), soaked in 1 cup ho  water for 20 minutes, drained, and patted dry, for garnish if desired",
        "1 tablespoon olive oil if desired",
        "thyme sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Roast",
        "New Year's Eve",
        "Rosemary",
        "Veal",
        "Cognac/Armagnac",
        "Winter",
        "Sage",
        "Gourmet"
    ],
    "title": "Loin of Veal with Shiitake Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/loin-of-veal-with-shiitake-stuffing-13573"
}
