{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "For the stuffing, heat 1 tablespoon of olive oil and the butter in a large (12-inch) saute pan. Add the onions and fennel with 1 teaspoon salt and 1/2 teaspoon pepper. Cook over low to medium-low heat for 15 minutes, stirring occasionally, until the onions and fennel are tender and lightly browned. Add the garlic and thyme and cook for 1 more minute. Add the Pernod and cook for another minute, deglazing the pan. Cool slightly.",
        "Add the bread crumbs and 1 teaspoon of salt to the stuffing mixture. Lay the pork on a board fat side down, and sprinkle with salt and pepper. Spread the stuffing evenly on the pork and roll up lengthwise, ending with the fat on the top of the roll. Tie with kitchen string, rub with olive oil, and sprinkle liberally with salt and pepper.",
        "Place the rolled pork loin on a baking rack on a sheet pan and roast for 30 minutes. Lower the heat to 350 degrees F and roast for another 20 to 30 minutes, until the interior of the pork is 137 degrees F. (If the thermometer hits stuffing rather than pork, it will register a higher temperature, so test the meat in several places.) Remove from the oven and cover tightly with aluminum foil. Allow to rest for 15 minutes. Remove the strings, slice thickly, and serve."
    ],
    "ingredients": [
        "Good olive oil",
        "1 tablespoon unsalted butter",
        "2 cups sliced yellow onions (2 onions)",
        "2 cups sliced fennel (1 large bulb)",
        "Kosher salt",
        "Freshly ground black pepper",
        "2 teaspoons minced garlic (2 large cloves)",
        "1 tablespoon minced fresh thyme leaves",
        "1 tablespoon Pernod or white wine",
        "3 cups fresh bread crumbs",
        "1 (3 1/2-pound) loin of pork, butterflied"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meat",
        "Vegetable",
        "Dairy Recipes",
        "Pork",
        "Main Dish Recipes"
    ],
    "title": "Loin of Pork with Fennel",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/loin-of-pork-with-fennel-recipe"
}
