{
    "directions": [
        "Soak craft sticks for one hour in a bowl of cold water.",
        "In small heavy saucepan over very low heat, stir chocolate chips until melted and smooth.  Remove from heat; let cool.",
        "In large bowl with electric mixer at medium speed, beat butter, brown sugar and vanilla until fluffy.  Beat egg in well; beat in cooled chocolate.  With mixer at low speed, beat in flour, cocoa powder and salt until smooth. Divide dough in half.",
        "Preheat oven to 375 degrees F (190 degrees C) and grease 2 large cookie sheets.",
        "Roll each half out to 1/8 inch thickness between 2 sheets of wax paper; freeze, in wax paper, 5 minutes.  Peal top sheets of wax paper off dough; cut dough out using 3-inch heart-shaped cutter.  Reroll scraps; freeze again 5 minutes; cut out.  Place half of the hearts 1 inch apart on prepared cookie sheet.",
        "Drain sticks, pat dry.  Place one stick on each heart to make 2 1/2 inch handle, pressing lightly into dough.  Place remaining hearts on top; press edges gently to seal.  Bake about 12 minutes until firm to touch. Cool on wire racks.",
        "In 2-quart heavy saucepan over very low heat, or in top of double boiler set over barely simmering water, stir white or milk chocolate until melted and smooth; if using both chocolates, melt in separate 1-quart pans.  Remove from heat.",
        "Holding each lollipop by handle, dip into chocolate to coat on both sides; let excess chocolate drip back into pan.  Place each lollipop as it is coated on wax-paper-lined cookie sheet; refrigerate 20 minutes until chocolate is set.",
        "To Make Icing:  In large bowl with electric mixer at high speed, beat egg white and confectioners' sugar until very smooth.  If desired, remove small portion of icing to separate bowl; tint with drops of food coloring.  Spoon icing into decorating bag fitted with small writing tip; pipe over lollipops in desired patterns.  Decorate with assorted candies and decors; attaching with dots of icing."
    ],
    "ingredients": [
        "12 craft sticks",
        "1/2 cup semisweet chocolate chips",
        "1/2 cup butter, softened",
        "1/3 cup packed light brown sugar",
        "1/2 teaspoon vanilla extract",
        "1 egg",
        "2 cups all-purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "12 (1 ounce) squares white chocolate",
        "1 egg white",
        "1 1/4 cups confectioners' sugar",
        "3 drops red food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lollipop Cookie Valentines",
    "url": "http://allrecipes.com/recipe/10415/lollipop-cookie-valentines/"
}
