{
    "directions": [
        "Combine soy sauce, red wine, juices, 2 tablespoons oil, scallions, garlic, white pepper, and cayenne in a 1-quart heavy-duty sealable plastic bag. Add steak and seal bag, pressing out air. Turn bag to coat steak, then marinate, chilled, turning bag occasionally, at least 4 hours.",
        "Transfer steak to a plate and pour 2 tablespoons marinade through a fine-mesh sieve into a 1-quart heavy saucepan, discarding remainder or reserving for another use (see cooks' note, below). Bring steak to room temperature, about 30 minutes.",
        "Heat remaining tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook steak, uncovered, until underside is browned, about 5 minutes. Turn steak over, then reduce heat to moderately low and cover skillet. Continue cooking until thermometer inserted horizontally 2 inches into center of steak registers 120°F, 10 to 12 minutes. Transfer to a cutting board and let stand at least 15 minutes (internal temperature of steak will rise to 130-135°F for medium-rare).",
        "While steak cooks and stands, bring marinade in saucepan to a boil, then pour into a bowl and cool completely. Whisk in mayonnaise until combined well and chill, covered, until ready to serve.",
        "Holding knife at a 45-degree angle, cut steak across the grain into very thin slices and transfer to a platter, then drizzle with any juices accumulated on cutting board. Serve at room temperature or slightly chilled, with mayonnaise."
    ],
    "ingredients": [
        "3/4 cup fine-quality fermented soy sauce*",
        "1/2 cup dry red wine",
        "1/4 cup fresh lemon juice",
        "1/3 cup fresh orange juice",
        "3 tablespoons olive oil",
        "1 bunch scallions, cut into 3-inch lengths",
        "5 garlic cloves, smashed and peeled",
        "1/2 teaspoon white pepper",
        "Pinch of cayenne",
        "2 1/2 to 3 lb top-round London broil (1 to 1 1/2 inches thick)",
        "1 cup mayonnaise",
        "Special equipment: an instant-read thermometer",
        "Accompaniment: toasted or grilled country bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Citrus",
        "Soy",
        "Marinate",
        "Quick & Easy",
        "Dinner",
        "Mayonnaise",
        "Meat",
        "Steak",
        "Summer",
        "Soy Sauce",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "London Broil with Soy Citrus Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/london-broil-with-soy-citrus-mayonnaise-232308"
}
