{
    "directions": [
        "Mayonnaise:",
        "Whisk together the mayonnaise, mustards, hot sauce, cornichons, green onion and parsley in a small bowl and season with salt and pepper, to taste. Cover and refrigerate for at least 1 hour.",
        "Burger:",
        "Stir together the paprika, pepper, salt, thyme, garlic powder, onion powder and cayenne in a small bowl.",
        "Mold the meat into patties. Brush with oil, season both sides with salt. Sprinkle 1 side of each patty with the spice mixture, making sure to rub the spices into the meat, then drizzle with oil before grilling.",
        "Preheat grill to high.",
        "Heat the 2 tablespoons of oil in a cast iron skillet on top of the grates of the grill until it begins to shimmer. If using cast iron pan, place the burger in the pan and cook until slightly charred and the spices have formed a crust, about 1 1/2 minutes (be careful not to burn the spices.) Turn the burger over, lower the heat to medium and continue cooking to desired doneness. If using a grill, grill the burgers on the grates of the grill for about same amount of time. Top each burger with 2 slices of cheese during the last 30 seconds of cooking, until cheese is melted.",
        "Put the burgers on the buns, top with the ham, some of the onions and some of the mayonnaise sauce and potato chips. Use a skewer to hold the burger together."
    ],
    "ingredients": [
        "1/2 cup prepared mayonnaise",
        "1 tablespoon Dijon mustard",
        "1 tablespoon whole-grain mustard",
        "1 teaspoon hot sauce, or more if desired",
        "5 cornichons, diced",
        "1 green onion, white and pale green part, finely chopped",
        "1 tablespoon finely chopped flat-leaf parsley",
        "Salt and freshly ground black pepper",
        "1 tablespoon sweet paprika",
        "2 teaspoons freshly ground black pepper",
        "2 teaspoons kosher salt",
        "1 teaspoon dried thyme",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon cayenne pepper",
        "1 1/2 pounds ground chuck",
        "2 tablespoons canola oil, plus more for brushing",
        "8 paper thin slices pepper jack cheese",
        "4 buns, split",
        "8 slices thinly sliced tasso ham",
        "1 red onion, peeled and cut into 1/4-inch thick slices"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Cajun",
        "Burger",
        "Meat"
    ],
    "title": "Louisiana Burger",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/louisiana-burger-recipe"
}
