{
    "directions": [
        "Scrub mussels well and remove beards. Finely chop onion, celery, and bell pepper. In a 6- to 8-quart heavy kettle melt butter over moderately low heat and stir in flour. Cook roux, stirring constantly, until color of peanut butter, about 6 minutes. Stir in vegetables and cook, covered, until soft. Stir in tomato paste, broth, tomatoes with juice, and cayenne and bring mixture to a boil, breaking up tomatoes. Simmer sauce, uncovered, stirring occasionally, 15 minutes, or until thickened.",
        "While sauce is simmering, make garlic bread:",
        "Preheat broiler.",
        "Mince garlic and mash to a paste with a pinch salt. In a small saucepan melt butter over moderate heat and stir in garlic paste. Halve bread horizontally and brush garlic butter on cut sides. On a baking sheet broil bread about 4 inches from heat until golden, 1 to 2 minutes.",
        "Stir mussels into sauce and simmer, covered, 4 to 8 minutes, or until mussels are opened. (Discard any unopened mussels after 8 minutes.) Divide mussels between 2 bowls.",
        "Season sauce with salt and ladle over mussels. Serve bread on the side."
    ],
    "ingredients": [
        "2 pounds mussels (preferably cultivated)",
        "1 medium onion",
        "1 celery rib",
        "1 small green bell pepper",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "2 teaspoons tomato paste",
        "1 cup chicken broth",
        "a 14- to 16-ounce can whole tomatoes including juice",
        "1/2 teaspoon cayenne For garlic bread",
        "1 small garlic clove",
        "2 tablespoons unsalted",
        "a 12-inch piece French or Italian bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Steam",
        "Mussel",
        "Gourmet"
    ],
    "title": "Louisiana Mussel \"Sauce Piquante\" with Garlic Bread",
    "url": "http://www.epicurious.com/recipes/food/views/louisiana-mussel-sauce-piquante-with-garlic-bread-14964"
}
