{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Grease the bottom and sides of a 13 by 9 by 2-inch baking pan with vegetable spray. Dust all over with flour, shaking out excess. Set aside.",
        "In a large mixing bowl, add 4 eggs, vegetable oil, 1 teaspoon vanilla extract, water and cake mix. Reserve the fudge package for another use. Using an electric mixer with whisk attachment, whisk until well combined, about 3 minutes.",
        "Into another mixing bowl, add ricotta cheese, 4 eggs, 1 tablespoon vanilla extract and 3/4 cup of granulated sugar. Add chocolate chips. Whisk until well combined, about 2 minutes.",
        "Pour 2/3 cup of the cake batter into the pan. Add cocoa powder to the remaining batter and pour over the batter in the pan. Gently swirl in the cocoa batter creating a marble look. Pour the ricotta mixture over the batter and place the pan on middle rack in the oven. Bake for 1 hour. Check for doneness by inserting a toothpick into the center of the cake. If it comes out clean, the cake is cooked.",
        "Remove cake from oven and set aside to completely cool.",
        "To make the frosting, in a large bowl, add package of chocolate pudding and cold milk. Using an electric mixer, whisk until thick and glossy, about 1 minute. Gently fold in prepared whipped cream until well combined.",
        "When cake is completely cool, carefully transfer it to a decorative serving platter. Spread frosting evenly over the top of the cake and serve.",
        "Store leftovers in the refrigerator."
    ],
    "ingredients": [
        "Vegetable spray, for greasing baking pan",
        "All-purpose flour, for dusting baking pan",
        "8 large eggs",
        "1/3 cup vegetable oil",
        "1 teaspoon pure vanilla extract",
        "1 1/4 cups water",
        "1 package fudge marble cake mix (or plain vanilla)",
        "1/2 cup cocoa powder",
        "2 pounds whole milk ricotta cheese",
        "3/4 cup granulated sugar",
        "1 tablespoon vanilla extract",
        "1/2 cup chocolate chips",
        "1 package instant chocolate pudding",
        "1 1/4 cups cold whole milk",
        "4 cups prepared whipped cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Dairy Recipes",
        "Egg Recipes",
        "Cheese",
        "Sugar",
        "Ricotta"
    ],
    "title": "Love Cake",
    "url": "http://www.foodnetwork.com/recipes/love-cake-recipe"
}
