{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place spinach in a microwave safe bowl with a splash of water. Cover, and microwave until the spinach has wilted, about 5 minutes. Drain and allow to cool.",
        "In a large bowl, mix together beef, pork, eggs, bread crumbs, and Romano cheese. Season with salt and pepper. Divide into two equal portions, and roll each into balls.",
        "Place a 15-inch long piece of plastic wrap on your work surface and lightly sprinkle with flour. Place one of the balls onto the plastic wrap and pat into a thin, 8-inch by 10-inch rectangle.  Cover evenly with half of the spinach and 3 slices of prosciutto, then shingle three slices of provolone running along the edge facing you.",
        "Using the plastic wrap to lift the meat, roll the loaf starting from the cheese side into a firmly packed spiral, peeling away the plastic wrap as you go. Make a second loaf with remaining ingredients.",
        "To bake, pour wine into a broiler pan bottom. Oil the slotted top with some of the olive oil before placing the loaves on and brushing them with remaining oil. Cover loaves with a sheet of aluminum foil and bake in preheated oven for 40 minutes.",
        "Remove the foil and pour water into the pan. Continue baking for another 35 minutes, until the internal temperature reaches 160 degrees F (72 degrees C). Allow to rest 10 minutes before slicing into 1-inch thick slices to serve."
    ],
    "ingredients": [
        "1 (10 ounce) bag washed spinach leaves",
        "1 pound ground beef",
        "1 pound ground pork",
        "3 large eggs, lightly beaten",
        "1 1/4 cups bread crumbs",
        "1 cup grated Romano or Parmesan cheese",
        "salt and pepper to taste",
        "6 slices provolone cheese",
        "6 slices prosciutto or ham, thinly sliced",
        "all-purpose flour for dusting",
        "2 tablespoons olive oil",
        "2 cups red wine",
        "2 cups water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Lover's Loaf",
    "url": "http://allrecipes.com/recipe/132576/lovers-loaf/"
}
