{
    "directions": [
        "Combine cookie crumbs, butter, 3 tablespoons Splenda, and nuts.  Press evenly in the bottom of  a 9 inch springform pan.  Chill crust while preparing the filling. Preheat oven to 350 degrees F (175 degrees C)",
        "In a large bowl, whip egg whites until stiff but not dry.",
        "In another large bowl, beat cream cheese, sour cream, 1 cup Splenda, and flour substitute until smooth.  Beat in egg yolks one at a time, blending well after each addition. Gently fold whipped egg whites into cream cheese mixture. Spoon batter into prepared crust.  Slowly swirl 6 ounces of melted chocolate through cheese mixture to give a marbled effect.",
        "Place pan on a cookie sheet  in the preheated oven, and bake 60 to 70 minutes or until set.  Turn off oven, and allow cake to cool in the oven with the door open.  When cool, transfer to the refrigerator, and chill overnight.",
        "Spread 3 ounces of melted chocolate on a cookie sheet. Sprinkle with remaining chopped nuts, and then refrigerate until chilled. Scrape chocolate from pan to form slivers. Decorate cake with chocolate slivers by heaping over the top, and pressing vertically onto the sides of the cake."
    ],
    "ingredients": [
        "1 cup low-carb chocolate cookie crumbs",
        "1/4 cup butter, melted",
        "3 tablespoons SPLENDA® Granular",
        "1/2 cup finely chopped macadamia nuts, pecans, or almonds",
        "3 eggs, separated",
        "3 (8 ounce) packages cream cheese, at room temperature",
        "1 cup sour cream",
        "1 cup SPLENDA® Granular",
        "2 tablespoons low-carbohydrate baking flour substitute",
        "6 ounces low-carbohydrate, dark chocolate, melted",
        "3 ounces low-carbohydrate, dark chocolate, melted",
        "3 tablespoons finely chopped macadamia nuts, pecans, or almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Low-Carb Chocolate Swirl Cheesecake",
    "url": "http://allrecipes.com/recipe/67677/low-carb-chocolate-swirl-cheesecake/"
}
