{
    "directions": [
        "Preheat oven to 400°F. Spray 9-inch-diameter springform pan with nonstick vegetable oil spray. Coarsely grind granola and blanched slivered almonds in processor. Transfer mixture to medium bowl. Stir in orange juice and honey. Press mixture onto bottom of prepared springform pan. Bake until crust is set and beginning to color, about 10 minutes. Transfer springform pan to rack and cool crust completely.",
        "Stir orange juice and gelatin in heavy small saucepan over low heat until gelatin dissolves, about 3 minutes. Remove from heat. Puree cottage cheese, cream cheese, evaporated milk, sugar, honey and almond extract in blender until very smooth. Transfer to large bowl. Stir in gelatin mixture. Pour filling into crust. Cover and refrigerate overnight. (Cheese pie can be prepared 1 day ahead. Keep refrigerated.)",
        "Cut peel and white pith from oranges. Cut oranges crosswise into 1/4-inch-thick rounds. Cut each round in half. Drain orange pieces on several layers of paper towels. Arrange oranges decoratively over top of cheese pie. Stir apricot preserves in heavy small saucepan over low heat until melted. Brush oranges with apricot glaze. Sprinkle pie with almonds and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 3/4 cups low-fat granola",
        "1/2 cup blanched slivered almonds (about 2 ounces)",
        "1/4 cup plus 1 tablespoon orange juice",
        "1 tablespoon honey",
        "1/2 cup orange juice",
        "1 envelope unflavored gelatin",
        "1 16-ounce container nonfat cottage cheese",
        "4 ounces nonfat cream cheese, room temperature",
        "1/4 cup canned evaporated skim milk",
        "3 tablespoons sugar",
        "2 tablespoons honey",
        "1/2 teaspoon almond extract",
        "4 oranges",
        "1/4 cup apricot preserves",
        "1 tablespoon sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Low Fat",
        "Cream Cheese",
        "Orange",
        "Almond",
        "Chill",
        "Cottage Cheese",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Low-Fat Orange and Almond Cream Cheese Pie",
    "url": "http://www.epicurious.com/recipes/food/views/low-fat-orange-and-almond-cream-cheese-pie-1584"
}
