{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Coat two 9-inch round cake pans with non-stick cooking spray and dust with flour",
        "Mix cake mix and pudding mix in a large bowl. Add water, sour cream, and egg whites; beat on medium speed with electric mixer for 2 minutes. Pour about half the batter into each of the prepared cake pans.",
        "Bake in the preheated oven until golden and the tops spring back when lightly pressed, about 25 minutes; set aside to cook to room temperature.",
        "Mix 1 tablespoon reserved juice from raspberries and cornstarch in a small bowl; set aside.",
        "Bring the berries to a simmer in a saucepan over medium heat; cook and stir until the berries break down, about 10 minutes. Stir the cornstarch mixture into the berries; continue cooking until thickened, about 2 minutes more. Remove saucepan from heat and cool berry mixture to room temperature.",
        "When the cakes are completely cool, run a paring knife between cake and pan edges. Hold a cake pan on its side and gently tap the sides of the pan against the counter to loosen cake layer. Cover the cake pan with a plate and invert it to tip the cake out of the pan and onto the plate.",
        "Place one cake layer onto a serving plate. Spread raspberry filling over the top of the layer. Top with remaining cake.",
        "Prepare frosting by gently folding yogurt into the whipped topping in a large bowl; spread over top and sides of cake.",
        "Cool cake in refrigerator for 2 hours before serving."
    ],
    "ingredients": [
        "cooking spray",
        "Cake batter:",
        "1 (18.25 ounce) package lemon cake mix",
        "1 (3 ounce) package sugar-free lemon pudding mix",
        "1 1/4 cups water",
        "1/2 cup fat-free sour cream",
        "1/2 cup egg whites",
        "Filling:",
        "1 (12 ounce) package frozen raspberries, thawed and drained (reserve drained liquid)",
        "1 1/2 teaspoons cornstarch",
        "Frosting:",
        "1 (8 ounce) container fat-free lemon yogurt",
        "1 (8 ounce) container reduced-fat frozen whipped topping, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Low-Fat Lemon Raspberry Cake",
    "url": "http://allrecipes.com/recipe/231301/low-fat-lemon-raspberry-cake/"
}
