{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.",
        "Melt the unsweetened chocolate in a cup or small bowl in the microwave. Stir at 15 second intervals until chocolate is smooth. Allow to cool slightly. Transfer to a large bowl, and stir in the margarine and sugar until smooth. Beat in the eggs  one at a time, then stir in the vanilla. Stir in the flour just until blended. Pour the batter into the prepared dish and spread evenly.",
        "Bake in the preheated oven until the surface appears dry and the sides are beginning to pull away from the edges of the pan, 20 to 25 minutes. The brownies may look more like cake and may jiggle slightly in the center- this is normal. Remove from the oven and cool in the pan set over a wire rack.",
        "To make the middle layer, beat 1/2 cup of butter with confectioners' sugar in a large bowl using an electric mixer. Add milk as needed to get a spreadable consistency. Stir in the peppermint extract and green food coloring. Spread this over the cooled pan of  brownies. Refrigerate for 30 minutes",
        "In a microwave-safe bowl, microwave chocolate chips with the butter until melted. Stir every 20 seconds until chocolate is smooth. Stir in vanilla and then pour over the chilled brownies and quickly spread to cover the surface. Cool again until firm, about 10 minutes, then cut into squares and serve."
    ],
    "ingredients": [
        "4 (1 ounce) squares unsweetened chocolate",
        "1 cup margarine, softened",
        "2 cups white sugar",
        "3 eggs",
        "2 1/2 teaspoons vanilla extract",
        "1 cup all-purpose flour",
        "1/2 cup butter, softened",
        "4 cups confectioners' sugar",
        "2 tablespoons milk, or as needed",
        "1 1/2 teaspoons peppermint extract",
        "6 drops green food coloring",
        "1 1/3 cups semisweet chocolate chips",
        "6 tablespoons butter",
        "1 tablespoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Luck o' the Irish Brownie",
    "url": "http://allrecipes.com/recipe/162836/luck-o-the-irish-brownie/"
}
