{
    "directions": [
        "Heat refried beans in small nonstick pan over medium heat and season with hot sauce. Transfer the beans to a small, deep casserole dish. Scrape pan clean with rubber spatula and return to heat.",
        "Add a little extra-virgin olive oil to the pan and raise heat to high. When the oil smokes, add the scallions and sear them, 2 to 3 minutes. Add green salsa to scallions and heat through. Add cilantro, remove salsa from heat, and layer on top of the beans.",
        "Return the same pan to the stove, lower heat to medium and add black beans, heat through and season with cumin, layer on top of the green salsa.",
        "Top the black beans with a layer of chipotle salsa. Mix sour cream the lime zest and juice and spread on top of the chipotle salsa.",
        "Combine the meat of 2 ripe avocados with garlic, lemon juice, jalapeno and salt to form a chunky guacamole. Top the salsa with guacamole. Garnish the dip with the final layer of diced tomatoes and sliced olives."
    ],
    "ingredients": [
        "1 (15-ounce) can refried beans",
        "2 tablespoons hot sauce",
        "Extra-virgin olive oil, for drizzling",
        "4 scallions, cut into 1 inch pieces",
        "1 (16 to 18 ounce) jar green chili or tomatillo salsa",
        "2 tablespoons chopped cilantro, a palm full, chopped",
        "1 (15-ounce) can black beans",
        "2 teaspoons ground cumin, 2/3 palm full",
        "1 (16 to 18 ounce) jar chipotle salsa",
        "2 cups sour cream",
        "1 lime, zested and juiced",
        "2 ripe avocados",
        "2 cloves garlic, finely chopped",
        "1 lemon, juiced",
        "1 jalapeno, seeded and finely chopped",
        "Salt",
        "2 plum tomatoes, diced",
        "Pimiento stuffed jumbo Spanish olives, chopped",
        "Tortilla chips, buy 2 sacks in 2 different colors/varieties"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Vegetarian",
        "American",
        "Southwestern",
        "Dip",
        "Beans and Legumes",
        "Jalapeno Recipes",
        "Vegetable",
        "Olive Recipes",
        "Chile Peppers",
        "Avocado",
        "Dairy Recipes",
        "Tomato",
        "Recipes for Parties",
        "Tailgate Party",
        "Super Bowl"
    ],
    "title": "Lucky 7 Layer Dip",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/lucky-7-layer-dip-recipe"
}
