{
    "directions": [
        "Put tomatoes in a large bowl and season with salt and pepper, to taste. Add oregano, parsley, garlic, onion, capers, peppers, olives, lemon juice, pepper oil, and 4 tablespoons of the extra-virgin olive oil. Stir gently just to mix and set aside at least 1 hour. Adjust seasonings, if desired. Mixture will become more liquid and sauce-like over time.",
        "Preheat oven to 450 degrees F.",
        "Bring a large pot of salted water to a boil and cook linguini until al dente. Drain and toss with remaining 2 tablespoons extra-virgin olive oil. Reserve.",
        "To cook the fish: (See Chef's Note below if using waxed paper.) Place a small square of parchment or waxed paper at the bottom of each paper bag. Place small pile of linguini in each of the bags. Top with a spoonful of tomato sauce, making sure to moisten the linguini with the juices. Lay a piece of fish on top and arrange with another spoonful of sauce. Moisten again with juices from the sauce and season with salt and pepper.",
        "Fold over the tops of the bags, place them on a baking sheet, and bake for 15 minutes.",
        "To serve, transfer the bags to 4 dinner plates and let each diner cut open the package to enjoy the aromas."
    ],
    "ingredients": [
        "3 cups vine-ripened plum (Roma) tomatoes, cored and cut into thin wedges",
        "Salt and freshly ground black pepper",
        "1 tablespoon finely chopped fresh oregano leaves, or 1 teaspoon dried oregano",
        "1 tablespoon finely chopped fresh flat-leaf parsley",
        "1 tablespoon minced garlic",
        "1/4 cup (1 small) minced red onion",
        "2 tablespoons rinsed, drained, and roughly chopped capers",
        "1/2 cup roasted red or yellow bell peppers, coarsely chopped",
        "12 pitted and sliced Greek olives (such as kalamata or Gaeta olives)",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons pepper olive oil or 1/2 teaspoon dried chili flakes",
        "6 tablespoons extra-virgin olive oil",
        "1/2 pound dried linguini",
        "4 (6-ounce) swordfish steaks"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fish",
        "Swordfish",
        "Main Dish Recipes",
        "Dinner Parties",
        "Recipes for Parties"
    ],
    "title": "\"Lunchbag\" Swordfish with Mediterranean Tomato Sauce and Linguini",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/lunchbag-swordfish-with-mediterranean-tomato-sauce-and-linguini-recipe"
}
