{
    "directions": [
        "Place rack in middle of oven and preheat to 350°F. Place potatoes in a large wide heavy pot. Add 1 1/2 tsp. salt and enough cold water to cover by 2\". Bring to a boil over high heat, then reduce heat to medium-low and simmer until potatoes break apart when pierced with the tip of a knife, 35–40 minutes.",
        "Meanwhile, cook garlic, cream, and butter in a medium saucepan over medium heat, whisking occasionally, until butter is melted. Whisk in nutmeg, pepper, and 1 Tbsp. plus 1 tsp. salt. Remove from heat.",
        "Drain potatoes and immediately pass through potato ricer into a large bowl. Stir in cream mixture until smooth.",
        "Return half of potato mixture to wide pot; reserve remaining potato mixture in bowl. Add Gruyère and mozzarella and cook over low heat, stirring constantly with a wooden spoon, until cheese is melted and mixture can be stretched with the spoon (like warm mozzarella), about 10 minutes. Transfer to gratin dish; smooth top.",
        "Working in batches if needed, spoon reserved potato mixture in bowl into pastry bag fitted with star tip. Pipe very tight rows of 1/2x1/2\" rosettes on potato-cheese mixture in gratin dish. Bake until top is golden brown, about 45 minutes. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "4 pounds Yukon Gold potatoes, peeled, cut into 1 1/2\" pieces",
        "Kosher salt",
        "4 garlic cloves, forced through a press or finely chopped",
        "2 cups heavy cream",
        "1/2 cup (1 stick) unsalted butter",
        "3/4 teaspoon freshly grated nutmeg",
        "3/4 teaspoon freshly ground white pepper",
        "3/4 pound Gruyère, coarsely grated (about 4 cups)",
        "1/2 pound fresh mozzarella, coarsely grated (about 1 1/2 cups)",
        "A 4-quart gratin or casserole dish; a potato ricer or food mill; a pastry bag fitted with a 3/4-inch star tip"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Dinner",
        "Mozzarella",
        "Milk/Cream",
        "Cheese",
        "Party",
        "Kid-Friendly",
        "Root Vegetable",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Luxe French Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/luxe-french-potatoes"
}
