{
    "directions": [
        "Lightly oil a 9-inch square baking pan and line with plastic wrap, leaving an overhang. Combine sugar and 1 1/2 cups Champagne in a small saucepan and sprinkle gelatin over mixture. Let gelatin stand 1 minute to soften.",
        "Cook over moderate heat, gently stirring occasionally (vigorous stirring will create too much foam), just until sugar and gelatin are dissolved.",
        "Slowly pour into a metal bowl set in a larger bowl of ice and cold water and cool, stirring occasionally. Slowly add lemon juice and remaining 1 1/2 cups Champagne, stirring just until combined. Let stand 5 minutes, then skim foam.",
        "Continue to cool mixture, gently stirring occasionally, until it mounds slightly, about 20 minutes. Transfer to baking pan and chill, covered, until firm, at least 8 hours.",
        "Peel lychees. Make a lengthwise slit in each and remove pit, leaving pulp as intact as possible.",
        "Heat lychees, sugar, water, and lemon juice in a small saucepan over moderate heat, stirring, just until sugar is dissolved. Transfer to a medium bowl and chill at least 2 hours.",
        "Invert gelée onto a cutting board, discarding plastic wrap, then trim edges. Cut gelée into 1/2-inch cubes and add to compote with raspberries. Gently mix with a rubber spatula."
    ],
    "ingredients": [
        "1 cup sugar",
        "3 cups Champagne or other sparkling wine",
        "1 tablespoon plus 2 teaspoons unflavored gelatin (less than 3 envelopes)",
        "1 tablespoon strained fresh lemon juice",
        "1 lb fresh lychees or 1 (15-oz) can, rinsed and drained",
        "1/2 cup sugar",
        "1/2 cup water",
        "1 1/2 teaspoons fresh lemon juice, or to taste",
        "1/2 pint raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Champagne",
        "Berry",
        "Fruit",
        "Dessert",
        "Cocktail Party",
        "Raspberry",
        "Lemon",
        "Summer",
        "Shower",
        "Chill",
        "Lychee",
        "Party",
        "Gourmet",
        "Fat Free",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Lychee Compote with Raspberries and Champagne Gelée",
    "url": "http://www.epicurious.com/recipes/food/views/lychee-compote-with-raspberries-and-champagne-gelee-103856"
}
