{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Line bottoms of 3 - 9 inch pans with parchment paper, but do not grease. Mix together the flour, baking powder, and salt; set aside.",
        "Place grated ube in a large bowl. Mix together 3/4 cup milk and 1 teaspoon vanilla; gradually blend into ube until smooth. Blend in corn syrup, egg yolks, and oil. Beat in flour mixture until smooth; set aside.",
        "In a large glass or metal mixing bowl, beat egg whites with cream of tartar until foamy. Gradually add sugar, then red and blue food coloring, continuing to beat until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Pour batter into prepared pans.",
        "Bake in the preheated oven for 30 to 35 minutes, or until the center of cake bounces back when lightly tapped. Invert pans on a wire rack and let cool upside down. When cool, run a knife around the edges to loosen cake from pans. Fill between layers with coconut preserves, then frost top and sides with butter icing.",
        "To make Butter Icing:  Combine evaporated milk and 3/4 cup sugar. set aside.  Cream butter until light and fluffy; gradually add sugar mixture, and continue beating to desired spreading consistency. Add food color, one drop at a time until desired tint is achieved."
    ],
    "ingredients": [
        "2 1/2 cups cake flour",
        "3 teaspoons baking powder",
        "1 teaspoon salt",
        "1 cup ube (purple yam), cooked and finely grated",
        "3/4 cup milk",
        "1 teaspoon vanilla extract",
        "1/2 cup corn syrup",
        "7 egg yolks, lightly beaten",
        "1/2 cup vegetable oil",
        "7 egg whites",
        "1 teaspoon cream of tartar",
        "1 cup white sugar",
        "6 drops red food color",
        "6 drops blue food coloring",
        "1 (12 ounce) jar macapuno (coconut preserves)",
        "1 cup evaporated milk, chilled",
        "3/4 cup white sugar",
        "1 cup butter, softened",
        "1 drop violet food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ube-Macapuno Cake",
    "url": "http://allrecipes.com/recipe/51518/ube-macapuno-cake/"
}
