{
    "directions": [
        "Bring broth and 3 cups water to simmer in large pot over medium heat. Add cilantro, mushrooms, sliced ginger, and lemongrass. Cover; simmer until mushrooms are tender, about 30 minutes. Rinse kombu; add to broth. Simmer 1 minute. Using tongs, remove kombu and mushrooms; discard kombu. Transfer mushrooms to work surface; cut off stems and discard. Cut each mushroom into 3 to 4 strips. Strain broth through fine-mesh strainer into another large pot; discard solids in strainer. Add tamari and rice vinegar to broth. DO AHEAD: Can be made 1 day ahead. Cover and chill mushrooms. Cool, cover, and chill broth.",
        "Bring large pot of salted water to boil. Cook yams until just tender, 4 to 5 minutes. Using skimmer, transfer to medium bowl. Cook snow peas, cabbage, and carrots separately until crisp-tender (snow peas, 30 seconds; cabbage, 1 1/2 minutes; carrots, 2 minutes). Using skimmer, transfer vegetables to separate bowls. Reserve cooking liquid. DO AHEAD: Vegetables can be cooked 2 hours ahead. Let vegetables and liquid stand at room temperature.",
        "Bring cooking liquid to boil. Sprinkle with salt. Add noodles; cook until tender but still firm to bite, stirring often. Drain; rinse.",
        "Meanwhile, bring vegetable broth to simmer. Add green onions and ginger strips. Season with salt and pepper.",
        "Using tongs, divide noodles among bowls. Divide mushrooms, yams, snow peas, cabbage, and carrots among bowls, each in separate mound. Divide tofu, if using, among bowls. Ladle broth over and serve, passing sambal oelek and tamari separately."
    ],
    "ingredients": [
        "10 cups Light Vegetable Broth or good-quality canned vegetable broth (such as Swanson)",
        "3 cups water",
        "1 1/2 cups coarsely chopped fresh cilantro",
        "1 1/2 ounces dried shiitake mushrooms, rinsed",
        "3/4 cup thinly sliced peeled fresh ginger",
        "2 lemongrass stalks, outer dark layers removed, all but bottom 4 inches cut off and discarded",
        "2 6-inch strips dried kombu",
        "2 teaspoons tamari soy sauce",
        "1 teaspoon unseasoned rice vinegar",
        "2 cups 1/2-inch cubes peeled yams (red-skinned sweet potatoes)",
        "5 ounces snow peas, trimmed",
        "4 cups 1/2-inch-wide crosswise slices cored Napa cabbage",
        "5 ounces slender carrots (preferably assorted colors), peeled, thinly sliced on diagonal",
        "10 ounces Japanese-style udon noodles or soba noodles",
        "1 cup sliced green onions",
        "1/4 cup matchstick-size strips peeled fresh ginger",
        "4 to 6 ounces semi-firm tofu, cut into 1/2-inch cubes (optional)",
        "Sambal oelek",
        "Tamari soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Mushroom",
        "Low Fat",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Tofu",
        "Sweet Potato/Yam",
        "Healthy",
        "Low Cholesterol",
        "Cabbage",
        "Noodle",
        "Lemongrass",
        "Soy Sauce",
        "Simmer",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Udon with Mushroom Broth, Cabbage, and Yams",
    "url": "http://www.epicurious.com/recipes/food/views/udon-with-mushroom-broth-cabbage-and-yams-357289"
}
