{
    "directions": [
        "Bring large pot water to boil over high heat. Have ready large bowl ice water. Add carrots, snow peas, cabbage, and spinach to boiling water and blanch until crisp-tender, about 30 seconds. Using slotted spoon, transfer vegetables to ice water to stop cooking (reserve boiling water), then transfer to colander to drain. Set aside.",
        "Boil noodles in same water until just tender, following package instructions. Drain and transfer to 4 warmed bowls.",
        "In medium saucepan over moderately high heat, combine dashi, soy sauce, and mirin. Bring to simmer, then add chicken, mushrooms, clams, and shrimp. Simmer until chicken is cooked through, mushrooms are tender, clams open, and shrimp are opaque, about 5 minutes. (Discard any unopened clams.)",
        "Divide vegetables between bowls atop noodles, then ladle hot broth, chicken, mushrooms, clams, and shrimp over. Serve immediately."
    ],
    "ingredients": [
        "3/4 cup carrots, thinly sliced",
        "1 cup snow peas, cut in half crosswise",
        "5 napa cabbage leaves, cut crosswise into 1-inch-wide strips",
        "4 ounces (about 2 cups packed) spinach, coarse stems removed and leaves cut crosswise into 1-inch-wide strips",
        "8 ounces dried udon noodles",
        "6 cups dashi",
        "1/2 cup light soy sauce",
        "1/4 cup mirin (Japanese sweet rice wine)",
        "8 ounces boneless, skinless chicken thighs, cut into bite-size pieces",
        "1 ounce (about 4) fresh shiitake mushrooms, stemmed",
        "8 littleneck clams, scrubbed",
        "4 ounces (about 12) small shrimp, peeled, deveined, and butterflied",
        "2 scallions (white and green parts), cut crosswise into 2-inch pieces and julienned"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Shellfish",
        "Kid-Friendly",
        "Dinner",
        "Clam",
        "Shrimp",
        "Spinach",
        "Cabbage",
        "Potluck",
        "Noodle",
        "Soy Sauce",
        "Simmer",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Udon Noodles with Chicken, Shellfish, and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/udon-noodles-with-chicken-shellfish-and-vegetables-352489"
}
