{
    "directions": [
        "Pour boiling water over the poppy seeds in a bowl and drain well over a fine sieve. If necessary, repeat this washing. Spread the poppy seeds on a tea towel or brown paper and let dry overnight.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch pans and line bottoms with parchment paper.",
        "Sift together the flour, baking powder, baking soda and 1/4 teaspoon salt. Set aside.",
        "In a large bowl, beat the eggs and 1 1/2 cups sugar until thick and lemon colored. Beat in the sour cream and vanilla. Sift the flour mixture, and gently fold it into the egg mixture, along with the poppy seeds. Pour batter into prepared pans.",
        "Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.",
        "To make the Lemon Filling:  In a saucepan, mix together 1/2 cup sugar, cornstarch and pinch of salt. Stir in lemon zest, lemon juice, water, orange juice and butter. Cook, stirring constantly, until mixture thickens. Place egg yolks in a medium bowl. Slowly whisk 1/2 cup of hot mixture into egg yolks. Slowly pour the egg yolk mixture back to remaining hot mixture, whisking constantly. Cook, stirring constantly, for 5 minutes, or until thickened."
    ],
    "ingredients": [
        "Cake:",
        "1/2 cup poppy seeds",
        "3 eggs",
        "1 1/2 cups white sugar",
        "1 1/2 cups sour cream",
        "1 1/2 teaspoons vanilla extract",
        "2 1/4 cups cake flour",
        "3 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "Lemon Filling:",
        "1/2 cup white sugar",
        "2 tablespoons cornstarch",
        "1 pinch salt",
        "1/2 teaspoon grated lemon zest",
        "1/3 cup lemon juice",
        "1/3 cup water",
        "1/3 cup orange juice",
        "2 tablespoons butter",
        "3 egg yolks, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ukrainian Sour Cream Poppy Seed Cake",
    "url": "http://allrecipes.com/recipe/25555/ukrainian-sour-cream-poppy-seed-cake/"
}
