{
    "directions": [
        "Melt butter in a skillet over medium-high heat. Sautee onion in butter until tender. Remove from heat, and set aside to cool. When the onion is cool enough to handle, mix together the ground pork, bread crumbs, egg, salt and pepper until well blended.",
        "Place the head of cabbage in a large pot, and add enough water to cover the cabbage halfway. Bring to a boil, and cook for about 2 minutes. As the outer leaves become translucent and soft, remove them one at a time by peeling them off with a wooden spoon. Trim off the thick ribs at the leaf stem.",
        "Preheat the oven to 325 degrees F (165 degrees C). Grease the bottom of a 9x13 inch baking dish, and line the bottom with outer cabbage leaves. Lay a few more leaves on a clean work surface. Place a large spoonful of the pork mixture at the base of each leaf. Roll up towards the top. Repeat until filling is used up. Arrange the finished rolls over the leaves in the dish, and pour in just enough broth to cover the rolls. Place extra cabbage leaves over the top.",
        "Cover, and bake for 1 hour in the preheated oven. When finished, drain off broth from the dish into a small saucepan. Whisk together the flour and sour cream. Gradually stir the sour cream into the broth. Cook over medium heat, stirring frequently until heated, about 5 minutes.",
        "To serve, arrange cabbage rolls on a platter, cover with sauce and sprinkle with dill. This goes perfectly with homemade noodles, or millet kasha."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 large onion, chopped",
        "3/4 pound ground pork",
        "1/2 cup fresh bread crumbs",
        "1 egg",
        "2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1 head savoy cabbage, cored",
        "2 cups chicken stock, or as needed",
        "1 tablespoon all-purpose flour",
        "1 cup sour cream",
        "1 tablespoon chopped fresh dill"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ukrainian Meat Filled Cabbage Rolls",
    "url": "http://allrecipes.com/recipe/48815/ukrainian-meat-filled-cabbage-rolls/"
}
