{
    "directions": [
        "To make the crust, whisk 4 1/2 cups of flour with 1 teaspoon of salt in a bowl, then mash the 1/2-inch pieces of cold unsalted butter into the flour mixture with your fingers until the mixture looks like coarse crumbs. Stir in ice water, 1 tablespoon at a time, until the mixture gathers together into a smooth dough and all the flour is incorporated. Form the dough into a ball, wrap in plastic wrap, and refrigerate for 30 minutes.",
        "Bring a saucepan filled with water to a boil, and cook the carrots until they just begin to soften, about 2 minutes; transfer the carrots with a slotted spoon into a bowl of ice water to stop them from cooking. Heat 1/4 cup of unsalted butter over medium heat in a large pot, and cook the celery and onion until the onion begins to turn  translucent, about 3 minutes; stir in mushrooms and garlic, and cook until the mushrooms have given up their juice and the vegetables are tender, about 8 more minutes. Whisk 1/3 cup of flour into the pot, then gradually whisk the turkey stock and red wine into the flour. Bring the mixture to a boil over medium-low heat, and simmer until the gravy thickens, 5 to 10 minutes. Stir in the turkey meat, canned peas, parsley, thyme, oregano, sage, sea salt, and black pepper, and allow the mixture to simmer another 5 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Divide the dough in half, and roll each half into an 11-inch circle on a floured work surface. Fit one crust into a 10-inch pie dish; trim away excess dough.",
        "Bake in the preheated oven until the bottom crust begins to turn brown, 10 to 15 minutes. Remove the pie dish from the oven, fill the crust with the hot turkey and vegetable filling, and place the top crust onto the pie dish. Fold the edge of the crust over the pie dish, press to seal the 2 crusts together, and cut several steam holes into the top crust.",
        "Return pie to the oven, and bake until the top crust is golden brown and the filling is bubbling, about 30 more minutes. Let cool for about 10 minutes before serving."
    ],
    "ingredients": [
        "4 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1 1/3 cups cold unsalted butter, cut into 1/2-inch pieces",
        "1 cup ice water, or as needed",
        "2 carrots, peeled and diced",
        "1/4 cup unsalted butter",
        "2 stalks celery, diced",
        "1 onion, diced",
        "1 cup sliced fresh mushrooms",
        "3 cloves garlic, minced",
        "1/3 cup all-purpose flour",
        "2 cups turkey stock",
        "1/2 cup red wine",
        "3 cups diced cooked turkey",
        "1/2 cup canned peas, drained",
        "1/4 cup chopped fresh parsley",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh sage",
        "1 pinch sea salt to taste",
        "1 pinch freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ultimate Turkey Pot Pie",
    "url": "http://allrecipes.com/recipe/215453/ultimate-turkey-pot-pie/"
}
