{
    "directions": [
        "Place the eggs in a large saucepan and cover completely with cool water. Bring to a boil and then cover and remove from the heat. Let the eggs sit in the hot water for 9 minutes, then drain and cool in an ice bath.",
        "Peel the eggs, then halve lengthwise. Remove the yolks and place them in a bowl. Add the mayonnaise, Pickled Shallots, gherkins, mustard and vinegar, and use a fork to mash the ingredients together until smooth. Alternatively, use a food processor. Add the chives, parsley, bacon, scallion whites and some salt and pepper.",
        "Transfer the filling to a piping bag fitted with a medium round tip or a resealable plastic bag with one corner of the bag snipped off. Pipe the filling into the egg whites, then top each with scallion greens, pickled shallots, some paprika and a sprinkle of bacon.",
        "Place the vinegar, 1/4 cup water, the sugar, salt and coriander seeds in a small saucepan, and bring to a boil.",
        "Place the shallots in a medium heatproof bowl and pour the hot liquid over the top. Cool to room temperature, and then cover and refrigerate for 1 hour."
    ],
    "ingredients": [
        "12 large eggs",
        "1/3 cup mayonnaise",
        "1/4 cup Pickled Shallots, chopped, recipe follows, plus more for garnish",
        "1 teaspoon Dijon mustard",
        "1 teaspoon white wine vinegar",
        "3 gherkins, finely chopped",
        "2 teaspoons chopped fresh chives",
        "2 teaspoons chopped fresh parsley",
        "4 slices bacon, cooked and chopped, plus more for garnish",
        "1 scallion, white part finely minced and green part thinly sliced",
        "Kosher salt and freshly ground black pepper",
        "1/2 teaspoon paprika",
        "1/2 cup rice wine vinegar",
        "1/4 cup sugar",
        "2 teaspoons salt",
        "1/2 teaspoon coriander seeds",
        "5 small shallots, peeled and thinly sliced into rings"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Deviled Egg",
        "Shallot Recipes",
        "Vegetable",
        "Egg Recipes"
    ],
    "title": "Ultimate Deviled Eggs",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/ultimate-deviled-eggs"
}
