{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line two 8-inch round pans with parchment paper.",
        "Sift 1 1/2 cups of the white sugar, flour, cocoa powder, baking soda, and salt together in a bowl. Beat shortening and remaining 1/2 cup white sugar together in a large bowl with an electric mixer until light and fluffy. Beat 1 egg at a time into the shortening mixture; add vanilla extract with last egg. Add portions of flour mixture alternately with buttermilk, beating after each addition to form a smooth batter. Pour batter into prepared baking pans.",
        "Bake in preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Remove parchment from cake bottoms. Cut each layer in half horizontally, making 4 layers total. Pour 2 tablespoons cherry liqueur over each cake half.",
        "Beat cream in a chilled glass or metal bowl with an electric mixer until stiff peaks form. Beat in 2 tablespoons cherry liqueur and 1/2 teaspoon vanilla extract. Beat in confectioners' sugar and salt until cream filling is smooth and stiff.",
        "Spread 1 cake layer with 1/4 of the cream filling; top with 1/3 cherries. Repeat with 2 additional layers. Place 4th layer on top; frost top and sides of cake with remaining cream filling."
    ],
    "ingredients": [
        "Cake:",
        "2 cups white sugar, divided",
        "1 2/3 cups all-purpose flour",
        "1 cup cocoa powder",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "1/2 cup shortening",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1 1/2 cups buttermilk",
        "1/2 cup cherry liqueur, divided",
        "Filling:",
        "1 cup heavy whipping cream",
        "2 tablespoons cherry liqueur",
        "1/2 teaspoon vanilla extract",
        "1 cup confectioners' sugar",
        "1 pinch salt",
        "1 (16 ounce) can pitted sour cherries, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ultimate Black Forest Cake",
    "url": "http://allrecipes.com/recipe/245748/ultimate-black-forest-cake/"
}
