{
    "directions": [
        "Peel and devein the shrimp. Refrigerate shrimp meat.  Place the shrimp heads and shells in a large pot, and cover with 2 quarts of water.  Cover, and simmer over medium low heat until liquid is reduced by half. Strain out the shrimp heads and shells.",
        "Select a large stock pot capable of holding all the ingredients.  Add oil to the pot, and heat over medium high heat.  Using a long handled spoon, stir in flour; cook and stir for several minutes until dark brown.  At that point, the flour suddenly puffs and absorbs the oil.  Slowly stir in chicken broth and an equal amount of water.  Place chicken in the pot.  Add onions, celery, bell pepper, tomatoes, garlic, bay leaves, red pepper flakes, Old Bay seasoning, and salt.  Boil for about 1 1/2 hours, or until chicken meat is no longer pink and the juices run clear.",
        "Remove chicken from the pot, and set aside until cool enough to handle. Remove bones, and chop the chicken into about one inch pieces.",
        "Add chicken meat, shrimp broth, crab meat, sausage, and shrimp to .  Add the file powder, and stir from the bottom of the pot.  When the gumbo comes to a boil, remove from heat.  Continue to stir from the bottom for 1 minute.  Serve."
    ],
    "ingredients": [
        "4 pounds medium shrimp - peeled and deveined",
        "1/2 cup corn oil",
        "1/2 cup all-purpose flour",
        "1 cup chicken broth",
        "1 (3 pound) whole chicken",
        "2 onions, chopped",
        "5 stalks celery, chopped",
        "1 green bell pepper, chopped",
        "5 large tomatoes, chopped",
        "4 cloves garlic, minced",
        "2 bay leaves",
        "1 tablespoon salt",
        "2 tablespoons Old Bay Seasoning TM",
        "1 tablespoon ground cayenne pepper",
        "3 (6 ounce) cans crab meat, drained",
        "1 pound andouille sausage, diced",
        "2 tablespoons file powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ultimate Gulf Coast Gumbo",
    "url": "http://allrecipes.com/recipe/12774/ultimate-gulf-coast-gumbo/"
}
