{
    "directions": [
        "Preheat oven to 375°. Line a rimmed baking sheet with parchment paper.",
        "Whisk milk, granulated sugar, and kosher salt in a medium bowl until sugar and salt dissolve. Whisk flour and baking powder in a large bowl. Cut 10 Tbsp. butter into 1/2\" cubes, add to flour mixture, and blend with a pastry cutter or your fingertips until pea-size pieces form with some larger chunks remaining. Add milk mixture and stir with a fork until large clumps form. Gently knead in the bowl until dough just comes together. Transfer to a lightly floured work surface.",
        "With a lightly floured rolling pin, roll out dough to a 14x8\" rectangle, with long side facing you. Heat 2 Tbsp. butter in a small, microwave-proof bowl in the microwave until softened but not melted, about 20 seconds. Spread evenly over dough with fingertips, then sprinkle currants evenly on top and press to adhere. Fold up bottom third of dough over center, then fold down top third to meet bottom edge, as if folding a letter. Fold in half crosswise, then, using a rolling pin, gently flatten into an 8x4\" rectangle.",
        "Cut dough in half lengthwise and in quarters crosswise to form 8 even squares. Transfer to prepared pan, spacing 2\" apart. Sprinkle tops generously with demerara sugar and lightly with flaky sea salt.",
        "Bake until scones are golden brown, 25-30 minutes. Meanwhile, melt remaining 4 Tbsp. butter in a small saucepan over medium-low heat. When butter bubbles, remove from heat and skim off foam from surface. As soon as the scones come out of the oven, lightly brush tops with clarified butter, leaving behind white solids in bottom of saucepan. Cool scones on sheet on a wire rack and serve hot, warm, or room temperature."
    ],
    "ingredients": [
        "1 cup cold whole milk",
        "1/4 cup granulated sugar",
        "1 teaspoon kosher salt",
        "3 cups all-purpose flour, plus more for dusting",
        "2 1/2 teaspoons baking powder",
        "1 cup (2 sticks) cold unsalted butter, divided",
        "1/2 cup dried currants",
        "Demerara or turbinado sugar (for sprinkling)",
        "Flaky sea salt (for sprinkling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Breakfast",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Dried Fruit"
    ],
    "title": "Ultra-Buttery Irish Scones",
    "url": "http://www.epicurious.com/recipes/food/views/ultra-buttery-irish-scones-56389333"
}
