{
    "directions": [
        "Grease two (9x5 inch) loaf pans.",
        "In a medium saucepan over medium heat, warm beer slightly. Stir in milk and 2 tablespoons margarine to melt. Pour contents into bread machine pan. Pour in flour. Make a well in the center of the flour, and sprinkle salt onto one side of the mound that forms. Into the well, pour the sugar and yeast. Sprinkle with pepper, onion, garlic, and herbs. Begin the dough cycle.",
        "Meanwhile, slice the cheese into pea-size crumbles. Avoid using shredded cheese, as it may clump. Once the dough forms into a sticky ball, gradually add the cheese crumbles.",
        "As the cycle continues and the cheese fully incorporates into the dough, the ball should still be somewhat soft and sticky. If it is too dry, add a bit of milk.",
        "When the cycle has completed, punch down the dough, and divide it in half. Place each half into a greased loaf pan, and allow the dough to rise, about 45 to 60 minutes.",
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "When the dough has risen, bake for 1 hour, or until the loaves are golden brown and make a hollow sound when thumped. Immediately turn out onto a cooling rack, and brush with melted margarine. Cool completely before cutting."
    ],
    "ingredients": [
        "1 (12 fluid ounce) can or bottle premium lager",
        "2 tablespoons margarine",
        "2 tablespoons milk",
        "4 cups all-purpose flour",
        "2 teaspoons salt",
        "2 tablespoons sugar",
        "4 teaspoons yeast",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cayenne pepper",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried marjoram",
        "1/2 teaspoon dried basil",
        "8 ounces reduced-fat extra-sharp Cheddar cheese",
        "2 tablespoons margarine, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Una's Cheddar Beer Bread (bread machine dough cycle)",
    "url": "http://allrecipes.com/recipe/79017/unas-cheddar-beer-bread-bread-machi/"
}
