{
    "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.",
        "Cut the peppers in half from top to bottom. Place the peppers cut-sides down onto the prepared baking sheet.",
        "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place the blackened peppers into a bowl and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Remove and discard excess blackened skin and stems. Tear peppers with your hands and place in a bowl.",
        "Cut the top off of each tomato around the stem. Scoop seeds and pulp out of each tomato and squeeze into a bowl to create a thick tomato 'juice'. Chop tomatoes and place in a separate bowl.",
        "Heat corn oil and olive oil together in a large pot over medium heat. Cook and stir black pepper, paprika, cloves, cinnamon, and cayenne pepper in hot oil until fragrant, about 30 seconds.",
        "Stir onion and garlic into hot spiced oil; cook and stir until onion is softened, about 5 minutes. Pour tomato 'juice' into the pot and bring mixture to a boil while scraping the browned bits of food off of the bottom of the pot with a wooden spoon. Add chopped tomatoes, chicken broth, raisins, and brown sugar. Bring to a simmer.",
        "Reduce heat to low and add the chocolate; stir until chocolate melts. Add roasted peppers and stir. Bring sauce to a simmer and cook until flavors blend, at least 1 hour.",
        "Pour sauce into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return sauce to the pot and season with salt."
    ],
    "ingredients": [
        "4 red bell peppers",
        "4 tomatoes",
        "1 tablespoon corn oil",
        "1 tablespoon olive oil",
        "1 teaspoon ground black pepper",
        "1 teaspoon paprika",
        "1 teaspoon ground cloves",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon cayenne pepper",
        "2 medium onions, chopped",
        "4 cloves garlic, chopped",
        "1 cup chicken broth",
        "1/4 cup raisins",
        "2 tablespoons brown sugar",
        "1/2 cup coarsely chopped Mexican dark chocolate",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Uncle Tim's Mole Sauce",
    "url": "http://allrecipes.com/recipe/236967/uncle-tims-mole-sauce/"
}
