{
    "directions": [
        "Bring raw sugar, allspice, cloves, cinnamon, and 1 1/3 cups water to a simmer in a small saucepan over medium heat. Remove from heat and let spices steep 10 minutes. Strain through a fine-mesh sieve into a small measuring glass or bowl (you’ll have 1 1/2–1 3/4 cups syrup); let syrup cool. Cover and chill until cold, at least 30 minutes.",
        "Stir spiced syrup, sherry, vermouth, cranberry juice, and lemon juice in a large pot or bowl.",
        "If serving from a dispenser with a spigot, line sides at the bottom with a row of orange wheels and fill one-quarter full with crushed ice to hold orange wheels against sides. Create another layer of orange wheels and add just enough ice to hold them against sides. Repeat until dispenser is full. Pour punch over ice and top with fir sprigs, if desired. Serve punch in ice-filled glasses garnished with cranberries, cinnamon sticks, and orange wheels.",
        "If serving in a punch bowl, add 4 cups ice cubes to punch and stir until very cold, about 1 minute. Remove ice with a slotted spoon. Ladle into ice-filled glasses garnished with cranberries, cinnamon sticks, and orange wheels.",
        "Syrup can be made 1 month ahead. Keep chilled.\nPunch (stirring in ice if serving in a punch bowl) can be made 8 hours ahead. Cover and chill."
    ],
    "ingredients": [
        "1 1/3 cups raw sugar",
        "3 tablespoons allspice berries, cracked",
        "2 tablespoons whole cloves",
        "2 (3-inch) cinnamon sticks",
        "1 (750 ml) bottle amontillado sherry (preferably Lustau)",
        "1 (750 ml) bottle dry vermouth (preferably Dolin)",
        "1 1/2 cups plus 1 tablespoon cranberry juice cocktail",
        "1 1/2 cups plus 1 tablespoon fresh lemon juice",
        "Blood orange or navel orange wheels, fir sprigs (optional), cranberries, and cinnamon sticks (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Punch",
        "Christmas",
        "Christmas Eve",
        "Cocktail",
        "Cocktail Party",
        "Sherry",
        "Vermouth",
        "Cranberry",
        "Clove",
        "Cinnamon",
        "Orange"
    ],
    "title": "Under-the-Mistletoe Punch",
    "url": "http://www.epicurious.com/recipes/food/views/under-the-mistletoe-punch"
}
