{
    "directions": [
        "To prepare the chicken: Preheat the oven to 400°F.",
        "In a mixing bowl, mix the buttermilk and hot sauce. Submerge the chicken pieces in the buttermilk and soak in the refrigerator for at least 1 hour but no more than 24 hours.",
        "In a gallon-size plastic bag, combine the bread crumbs, Parmesan, black pepper, cayenne, onion powder, garlic powder, and paprika. Seal the bag and shake until well mixed.",
        "Remove the chicken from the buttermilk and transfer directly to the bag with the bread crumb mixture. Shake the bag until the chicken breasts are evenly coated with the bread crumbs. Remove the chicken breasts from the bag and lay flat on a nonstick baking sheet. Refrigerate, uncovered, for 30 minutes.",
        "Bake the chicken for 20 to 25 minutes or until just cooked through.",
        "Divide the chicken and brussels sprouts among 4 serving plates, and squeeze the lemon over the chicken.",
        "To prepare the brussels sprouts: Preheat the oven to 400°F.",
        "Place brussels sprouts in a medium mixing bowl, toss with the olive oil, and season with salt and pepper. Spread the brussels sprouts in a medium ovenproof baking dish and roast for 20 minutes or until caramelized and tender."
    ],
    "ingredients": [
        "1 cup buttermilk",
        "1 tablespoon Louisiana Hot Sauce or another hot sauce",
        "4 skinless and boneless chicken breasts, cut in half",
        "1 1/2 cups multigrain or whole wheat panko bread crumbs",
        "3 tablespoons grated Parmesan cheese",
        "2 teaspoons ground black pepper",
        "1 teaspoon cayenne",
        "1 1/2 teaspoons onion powder",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon paprika",
        "16 brussels sprouts, cut in half",
        "1 1/2 tablespoons extra-virgin olive oil",
        "Salt and freshly ground black pepper",
        "1 lemon, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Dinner",
        "Healthy",
        "Brussel Sprout",
        "Breadcrumbs"
    ],
    "title": "Unfried Chicken with Roasted Brussels Sprouts",
    "url": "http://www.epicurious.com/recipes/food/views/unfried-chicken-with-roasted-brussels-sprouts-51178210"
}
