{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Process cubed bread in a food processor to make bread crumbs. Set aside.",
        "Heat olive oil in a deep ovenproof skillet or Dutch oven. Add onion; cook and stir until softened, about 5 minutes.  Add garlic; cook and stir until fragrant, about 1 minute.",
        "Add quinoa, chicken stock, and water to the skillet.  Bring to a simmer; cover and cook until quinoa is tender, about 10 minutes.",
        "Heat 1/4 cup butter in a saucepan over medium-low heat. Add flour; cook and stir to form a paste, about 2 minutes. Slowly whisk in skim milk. Season with salt and ground black pepper; simmer on low until thickened, about 5 minutes.  Remove saucepan from heat; stir in Cheddar and mozzarella cheeses, a little at a time, until combined. Stir cheese sauce into quinoa mixture in the skillet.",
        "Melt 1 tablespoon butter in a separate skillet over medium heat. Add bread crumbs; cook and stir until crumbs are toasted, about 2 minutes. Place tomato slices on top of quinoa; top with bread crumbs. Quinoa mixture will be soupy but will firm up during baking.",
        "Bake in the oven until golden brown, about 25 minutes. Allow to rest for 5 minutes before serving."
    ],
    "ingredients": [
        "5 slices bread, crusts removed and cubed",
        "1 tablespoon olive oil",
        "1 small onion, diced",
        "3 cloves garlic, diced",
        "2 cups quinoa",
        "2 cups chicken stock",
        "2 cups water",
        "1/4 cup butter",
        "1/4 cup flour",
        "2 cups skim milk",
        "salt and ground black pepper to taste",
        "8 ounces sharp Cheddar cheese, shredded",
        "4 ounces mozzarella cheese, shredded",
        "1 tablespoon butter",
        "1 large tomato, cored and sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Unhealthy Quinoa Mac and Cheese",
    "url": "http://allrecipes.com/recipe/230688/unhealthy-quinoa-mac-and-cheese/"
}
