{
    "directions": [
        "Melt butter in heavy large skillet over medium-high heat. Add bell peppers and celery and sauté until just beginning to soften, about 7 minutes. Remove from heat. Season with salt and pepper.",
        "Combine cream, half and half and blue cheese in heavy medium saucepan. Stir over low heat until cheese melts. Remove from heat. Add celery seeds. Season sauce with cayenne, salt and pepper. Beat yolks in medium bowl to blend. Gradually whisk in half of cheese sauce. Return mixture to saucepan and whisk to blend. Add celery leaves.",
        "Butter 13 3/4x10 1/2x2 3/4-inch (4-quart capacity) oval baking dish. Cook pasta in pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Return to same pot. Add sauce and vegetables; stir to blend. Transfer to baking dish. (Can be made 1 day ahead. Cover; chill. Let stand at room temperature 1 hour before continuing.)",
        "Preheat oven to 400°F. Sprinkle Parmesan over surface of pasta. Bake until pasta is heated through, sauce is bubbling and top is beginning to brown, about 25 minutes."
    ],
    "ingredients": [
        "2 tablespoons (1/4 sticks) butter",
        "3 large red bell peppers (about 1 1/2 pounds), cut into 1/2-inch pieces",
        "5 celery stalks, chopped",
        "1 1/2 cups whipping cream",
        "1 1/2 cups half and half",
        "1 pound blue cheese, crumbled",
        "1 teaspoon celery seeds",
        "Cayenne pepper",
        "3 large egg yolks",
        "1/2 cup chopped celery leaves",
        "1 pound penne",
        "3/4 cup freshly grated Parmesan cheese (about 2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Side",
        "Bake",
        "Vegetarian",
        "Lunch",
        "Blue Cheese",
        "Celery",
        "Bell Pepper",
        "Winter",
        "Potluck",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Upscale Macaroni and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/upscale-macaroni-and-cheese-975"
}
