{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line bottoms and sides of two 9-inch pie pans with waxed paper. Spray with cooking spray.",
        "Combine pumpkin puree, white sugar, and evaporated milk in a large bowl. Add eggs, cinnamon, and salt; beat with an electric mixer until batter is smooth.",
        "Pour batter into prepared pans. Sprinkle yellow cake mix on top. Drizzle 1 cup melted butter over cake mix. Sprinkle pecans on top; press lightly into butter.",
        "Bake in the preheated oven until golden brown, 50 to 60 minutes. Remove pans from the oven and let pies cool, about 2 hours.",
        "Run a knife around the edges of the pans to loosen pies; invert onto serving plates. Peel off waxed paper. Place pies in the refrigerator.",
        "Melt 1 cup butter in a saucepan over low heat. Add brown sugar and 1 cup heavy cream; cook and stir until sugar is dissolved, 3 to 5 minutes. Simmer caramel sauce until smooth, about 3 minutes. Remove from heat.",
        "Beat 2 cups heavy cream in a chilled glass or metal bowl with an electric mixer until foamy. Add confectioners' sugar and vanilla gradually, beating until soft peaks form.",
        "Slice chilled pies into wedges. Drizzle caramel sauce over wedges; top with a dollop of whipped cream."
    ],
    "ingredients": [
        "cooking spray",
        "2 (15 ounce) cans pumpkin puree",
        "1 cup white sugar",
        "2/3 cup evaporated milk",
        "3 eggs",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "1 (18.25 ounce) box yellow cake mix",
        "1 cup butter, melted",
        "1 1/2 cups coarsely chopped pecans",
        "Caramel Sauce:",
        "1 cup butter",
        "2 cups packed brown sugar",
        "1 cup heavy whipping cream",
        "Whipped Cream Topping:",
        "2 cups heavy whipping cream",
        "1 tablespoon confectioners' sugar",
        "1 1/2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Upside-Down Pumpkin Pecan Pie",
    "url": "http://allrecipes.com/recipe/254791/upside-down-pumpkin-pecan-pie/"
}
