{
    "directions": [
        "Bring to a boil the water, onion, garlic, cinnamon, turmeric, garam masala, salt, and pepper in a large pot. Add the lamb; reduce the heat to low and simmer 15 to 20 minutes. Separate the lamb from the liquid and set aside. Transfer the liquid to a bowl.",
        "While the lamb mixture simmers, heat the oil in a large, deep skillet over medium heat. Fry the eggplant slices in the hot oil, assuring the pieces do not touch, until brown on both sides; remove to a plate lined with paper towels to drain. Use the same procedure to fry the zucchini and the cauliflower. Cook the broccoli in the oil until hot and remove to a paper towel-lined plate to drain.",
        "Layer the lamb into the bottom of the large pot. Arrange the eggplants, zucchini, broccoli, and cauliflower on top of the beef in layers. Pour the rice over the beef and vegetables, shaking the pot gently to allow the rice to settle into the dish. Pour the reserved liquid from the beef over the mixture until it is completely covered. Add water if needed.",
        "Cover the pot and simmer over low heat until the rice is soft and the liquid is absorbed, 30 to 45 minutes. Remove the lid from the pot. Place a large platter over the pot and flip the pot so the dish is 'upside down' on the platter. Serve with yogurt on the side."
    ],
    "ingredients": [
        "7 cups water",
        "2 onions, chopped",
        "1 tablespoon chopped garlic",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground turmeric",
        "2 teaspoons garam masala",
        "1 pinch salt and ground black pepper to taste",
        "2 cups cooking oil",
        "2 cups lamb meat, cut into small pieces",
        "1 large eggplant, cut into 3/4-inch slices",
        "2 zucchini, cut into 1/4-inch slices",
        "1 cup broccoli",
        "1 cup cauliflower",
        "1 1/2 cups jasmine rice",
        "1 (16 ounce) container plain yogurt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Upside Down (Maqluba)",
    "url": "http://allrecipes.com/recipe/160087/upside-down-maqluba/"
}
