{
    "directions": [
        "Preheat oven to 300°F. Butter twelve 3/4-cup ramekins or custard cups. Place 1 cup sugar, honey, and butter in heavy medium saucepan. Stir over medium heat until butter melts and mixture is blended. Increase heat to medium-high and bring to boil. Whisk until mixture darkens slightly and candy thermometer registers 300°F, about 5 minutes. Remove from heat; add 1/3 cup water (mixture will bubble vigorously); whisk to blend. Divide topping among ramekins (about 2 tablespoonfuls for each). Divide ramekins between 2 roasting pans and chill while preparing filling.",
        "Using on/off turns, blend cream cheese and brown sugar in processor, scraping bowl occasionally. Add sour cream, lemon juice, and vanilla; process until smooth. Add eggs 1 at a time, processing just to blend between additions. Divide filling among ramekins. Add enough hot water to pans to come halfway up sides of ramekins.",
        "Bake cheesecakes until set, about 35 minutes. Remove from roasting pans and chill until firm, about 1 hour. DO AHEAD Can be made 2 days ahead. Cover and keep chilled.",
        "Run thin knife around sides of ramekins. Invert onto plates, scooping any remaining topping from ramekins over cheesecakes. Garnish with berries."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/3 cup honey",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/3 cup water",
        "3 (8-ounce) packages cream cheese, room temperature",
        "2/3 cup (packed) golden brown sugar",
        "1 cup sour cream",
        "2 teaspoons fresh lemon juice",
        "2 teaspoons vanilla extract",
        "4 large eggs, room temperature",
        "Assorted fresh berries (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Berry",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cream Cheese",
        "Fall",
        "Spring",
        "Chill",
        "Shavuot",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Upside-Down Honey Cheesecakes",
    "url": "http://www.epicurious.com/recipes/food/views/upside-down-honey-cheesecakes-237917"
}
