{
    "directions": [
        "Position rack in center of oven and preheat to 425°F. Combine 1/2 cup sugar if using canned apricots (or 3/4 cup sugar if using fresh apricots) and 2 tablespoons water in heavy small saucepan. Stir over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup is deep amber, occasionally brushing down sides of pan with pastry brush dipped into water and swirling pan, about 8 minutes. Add butter and cream (mixture will bubble vigorously). Stir over low heat until any caramel bits are dissolved. Immediately pour caramel into nonstick 10-inch-diameter ovenproof skillet; swirl to cover bottom of skillet. Carefully place apricot halves, rounded side down, tightly together atop caramel.",
        "Roll out puff pastry sheet on lightly floured surface to 12 1/2-inch square. Using 12-inch tart pan bottom or platter as guide, cut pastry into 12-inch round. Place puff pastry round atop apricots in skillet. Gently press down pastry around apricots at edge of skillet. Bake tart until pastry is puffed and deep golden, about 25 minutes. Remove from oven; cool 1 minute. Cut around edge of pastry to loosen. Place large rimmed platter atop skillet. Using oven mitts as aid, hold skillet and platter tightly together and invert, allowing tart and syrup to fall onto platter. Carefully lift off skillet. Rearrange any apricots that may have become dislodged. Serve warm."
    ],
    "ingredients": [
        "1/2 to 3/4 cup sugar",
        "2 tablespoons water",
        "3 tablespoons unsalted butter",
        "2 tablespoons whipping cream",
        "9 fresh apricots",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Apricot",
        "Summer",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Upside-Down Caramelized Apricot Tart",
    "url": "http://www.epicurious.com/recipes/food/views/upside-down-caramelized-apricot-tart-105058"
}
