{
    "directions": [
        "Preheat oven to 350°F. Coat pan with nonstick spray and place on a foil-lined rimmed baking sheet. Cook brown sugar, 1/4 cup butter, and 2 Tbsp. water in a small saucepan over medium heat, stirring, until sugar is dissolved and mixture is smooth. Bring to a boil and cook, without stirring, 2 minutes (it should be slightly thickened). Pour caramel into prepared pan and let rest until set, about 5 minutes.",
        "Arrange orange slices in concentric circles in a single layer over caramel. (Start with larger slices around the outside, then use smaller ones as you work toward the center. Cut up leftover citrus to fill in the gaps.)",
        "Whisk flour, polenta, salt, baking powder, and baking soda in a medium bowl. Place granulated sugar and remaining 1/2 cup butter in a large bowl; scrape in vanilla seeds and save pod for another use. Using an electric mixer on high speed, beat until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend between additions; beat until mixture is very fluffy, about 3 minutes.",
        "Reduce mixer speed to low. Add dry ingredients in 3 additions alternating with buttermilk in 2 additions, beginning and ending with dry ingredients; mix just until batter is smooth. Scrape batter into prepared pan (be careful not to disturb orange slices) and smooth surface with an offset spatula.",
        "Bake cake until golden brown and a tester inserted into the center comes out clean, 50–65 minutes. Transfer pan to a wire rack and let cake cool 10 minutes. Run a knife around edges of cake to loosen, then unmold. Invert cake onto rack and carefully remove bottom of pan. Let cool completely.",
        "Finely grate lemon omani and cardamom pods over cake and whipped cream, if desired. Serve cake with whipped cream alongside."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3/4 cup (packed) light brown sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, divided",
        "6 blood oranges, peel and white pith removed, each sliced into 4 rounds, seeds removed",
        "1 1/2 cups all-purpose flour",
        "3 tablespoons polenta (not quick-cooking)",
        "1 1/2 teaspoons kosher salt",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1 cup granulated sugar",
        "1 vanilla bean, split lengthwise",
        "4 large eggs, room temperature",
        "3/4 cup buttermilk, room temperature",
        "Lemon omani (dried black limes), green cardamom pods, and softly whipped cream (for serving; optional)",
        "A 9\" springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Hominy/Cornmeal/Masa",
        "Orange",
        "Dessert",
        "Kid-Friendly",
        "Vanilla",
        "Bake",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Upside-Down Blood Orange–Polenta Cake",
    "url": "http://www.epicurious.com/recipes/food/views/upside-down-blood-orangepolenta-cake"
}
