{
    "directions": [
        "1. Prepare the beef: At least 1 day before serving the chili, cut the meat from the beef shanks. (Save the bones to make beef stock.) You should have about 3 pounds (1.5 kg) meat. Cut the meat into 1-inch (2.5-cm) cubes. Place them on a baking sheet and freeze until they are semisolid, about 1 hour. In batches, process the meat in a food processor until it is coarsely chopped. (If you are lucky to live near an artisan butcher, ask them to bone and grind the beef shank meat with the coarse \"chili\" blade.)",
        "2. Mix the guajillo chile, vinegar, chile de arbol, salt, oregano, cumin, and cloves together in a nonreactive medium bowl. Add the beef and mix well. Cover tightly and refrigerate for at least 12 and up to 24 hours.",
        "3. Prepare the beans: Put the beans in a large bowl and add enough cold water to cover by at least 3 inches (7.5 cm). Let them stand in a cool place (refrigerate if the kitchen is warm) for at least 12 and up to 16 hours.",
        "4. Drain the beans, put them in a large saucepan, and add enough fresh cold water to cover by 3 inches (7.5 cm). Heat them, stirring often, over medium-high heat just until the water boils. Reduce the heat to medium-low and simmer until the beans are barely tender, about 1 1/2 hours, depending on the freshness of the beans. During the last 30 minutes, add the salt to the saucepan. Drain the beans and set them aside.",
        "5. Make the chili: Meanwhile, heat 2 tablespoons of the oil in a heavy Dutch oven over medium-high heat. In 2 or 3 batches, add the marinated beef and cook, stirring often, until it is seared, about 5 minutes. Using a slotted spoon, transfer the beef to a bowl, leaving the fat in the pot.",
        "6. Pulse the onions and garlic together in a food processor until finely chopped but not puréed. (Or mince the onions and garlic by hand.) Add the remaining 1 tablespoon oil to the Dutch oven and heat. Add the onion mixture and cook, stirring often, until the onions are softened, about 5 minutes.",
        "7. Return the beef to the Dutch oven. Add the tomato purée, chile flakes, oregano, thyme, and cumin and stir well. Reduce the heat to medium-low. Simmer, uncovered, for about 2 1/2 hours, until the meat is very tender and the tomato juices thicken. Add hot water to the chili if it threatens to stick to the pot, and stir in the beans during the last hour. Season with salt and more Urfa chile flakes. If you like very spicy chili, add more ground chile de arbol. (The chili can be cooled, covered, and refrigerated for up to 2 days.) Spoon it into bowls and serve hot."
    ],
    "ingredients": [
        "5 pounds (2.5 kg) beef shank",
        "1/2 cup (60 g) pure ground guajillo chile",
        "1/3 cup (75 ml) cider vinegar",
        "1 tablespoon pure ground chile de arbol",
        "1 tablespoon kosher salt",
        "1 tablespoon dried oregano, preferably Mexican",
        "1/4 teaspoon ground cumin",
        "Dash of ground cloves",
        "1 pound (455 g) dried red kidney beans, rinsed and pick through for stones",
        "1 tablespoon kosher salt",
        "3 tablespoons extra-virgin olive oil",
        "2 large yellow onions, coarsely chopped",
        "6 garlic cloves, crushed and peeled",
        "2 (28-ounce/800-g) cans whole peeled tomatoes, drained, puréed in a blender",
        "3 tablespoons Urfa Biber or Aleppo chile flakes, plus more to taste",
        "2 tablespoons dried oregano, preferably Mexican",
        "2 tablespoons dried thyme",
        "2 tablespoons ground cumin",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Beef",
        "Super Bowl",
        "Fall",
        "Winter",
        "Tailgating",
        "Chile Pepper",
        "Advance Prep Required"
    ],
    "title": "Upstate Chili",
    "url": "http://www.epicurious.com/recipes/food/views/upstate-chili-51201610"
}
