{
    "directions": [
        "Preheat the oven to 400ºF and line a baking tray with parchment paper.",
        "To make the za'atar, first toast the sesame seeds. In a small dry pan, heat the seeds over medium for 3 to 5 minutes, until they're lightly browned. Stir occasionally, so they don't burn. Let them cool. In a small bowl, combine the sumac, thyme, sesame seeds, and salt.",
        "Fill a medium pot halfway with water and bring it to a boil. Add the sweet potatoes and parboil them (cook them just until they start to soften). This will take 5 to 7 minutes. Drain the potatoes and transfer them to a medium bowl. Toss them with a glug of olive oil and 1 tablespoon of the za'atar seasoning until coated.",
        "Spread the potatoes on the prepared baking sheet and roast them for 10 minutes. Using a spatula, move them around on the baking sheet and continue roasting for another 5 minutes or until they begin to slightly brown.",
        "Mix 1 tablespoon of olive oil into the remaining za'atar and set it aside.",
        "In a large skillet, heat a glug of olive oil over medium. When the pan is hot, add the garlic. Sauté until the garlic becomes fragrant, about a minute. Add the greens and stir until they turn bright green and begin to soften. Add the sweet potatoes and heat everything for a few more minutes.",
        "Top the vegetables with some of the za'atar and oil mixture and serve."
    ],
    "ingredients": [
        "1 tablespoon sesame seeds",
        "1 tablespoon sumac",
        "2 teaspoons dried thyme",
        "1/4 teaspoon sea salt",
        "2 medium-size sweet potatoes, cut into cubes (about 4 cups)",
        "Olive oil",
        "3 garlic cloves, chopped",
        "1 bunch kale, destemmed and roughly chopped (about 6 cups)",
        "Sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dinner",
        "Vegan",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Sesame",
        "Sweet Potato/Yam",
        "Kale",
        "Garlic",
        "Fall",
        "Winter"
    ],
    "title": "Za'atar Sweet Potatoes and Garlicky Kale",
    "url": "http://www.epicurious.com/recipes/food/views/zaatar-sweet-potatoes-and-garlicky-kale"
}
