{
    "directions": [
        "Fold together the cheeses, eggs, parsley, and salt and pepper in a small bowl.",
        "For every 6 turnovers, you should use 2 layers of phyllo, liberally brushing each layer with melted butter. To assemble, start at the shorter end of the phyllo rectangle and cut into 6 even strips. Beginning at the far left lower corner of each strip, place 1/2 teaspoon of filling, and like folding an American flag, begin making right-angle turns until you have reached the end of the strip and you have a triangle-shaped pastry. Brush the turnovers liberally with butter and place them on wax paper. When all the triangles have been made, place them between layers of wax paper in a box or snap-top container and freeze. They can also be baked and eaten right away.",
        "Preheat your oven to 400°F, and bake the pastries for 12 minutes on an ungreased cookie sheet (they already have enough butter). If they have been frozen they can go directly from the freezer to the oven for 20 minutes. They will be a pale golden color and very hot inside, so be careful with the first bite!",
        "Working with phyllo dough can be a frustrating experience if you ignore one important rule: Always defrost the dough slowly, overnight in your refrigerator. If you try to rush it you will lose half a box to sticky layers. Always keep the phyllo covered with a dry kitchen towel while working with it and brush layers liberally with melted butter."
    ],
    "ingredients": [
        "2 cups feta cheese",
        "2 cups small-curd cottage cheese, drained",
        "1/4 cup grated Romano cheese",
        "4 large eggs, beaten",
        "2 tablespoons minced parsley",
        "Salt and freshly ground pepper",
        "1 box thawed phyllo pastry",
        "2 sticks butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Bake",
        "Feta",
        "Spring",
        "Cottage Cheese",
        "Parsley",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Zeke's Tyropitas",
    "url": "http://www.epicurious.com/recipes/food/views/zekes-tyropitas-234561"
}
