{
    "directions": [
        "Soak Brussels sprouts in a large bowl filled with lightly salted water for about 15 minutes. Drain well.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes.",
        "Divide the drained Brussels sprouts evenly between jars, filling the jars about 3/4-inch from the top.",
        "Place 1 garlic clove and 1/4 teaspoon red pepper flakes in each jar.",
        "Bring vinegar, water, and pickling salt to a boil in a large pot over medium-high heat until the salt is dissolved, about 5 minutes.",
        "Pour the vinegar mixture into the jars, filling the jars to within 1/4 inch of the top.",
        "Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles.",
        "Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot, and fill stockpot halfway with water.",
        "Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary, until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool.",
        "Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area, and wait at least 3 weeks before opening."
    ],
    "ingredients": [
        "2 pounds Brussels sprouts, trimmed and cut in half",
        "5 1-pint canning jars with lids and rings",
        "5 cloves garlic, divided",
        "1 1/4 teaspoons red pepper flakes, divided",
        "5 cups water",
        "5 cups distilled white vinegar",
        "7 tablespoons pickling salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Zesty Pickled Brussels Sprouts",
    "url": "http://allrecipes.com/recipe/220205/zesty-pickled-brussels-sprouts/"
}
