{
    "directions": [
        "Preheat oven to 325°F. Melt 1 tablespoon butter in heavy large oven-proof pot over medium-high heat. Sprinkle ribs with coarse salt and pepper. Add to pot in single layer and sauté until brown on all sides, about 10 minutes. Transfer ribs to large bowl. Add 1 tablespoon butter to pot. Add onions; sauté until brown, about 6 minutes. Add parsnips; sauté until beginning to color, about 6 minutes. Mix in garlic, then rosemary. Add wine and broth; bring to boil, scraping up browned bits.",
        "Return ribs and any accumulated juices to pot, arranging in single layer. Bring to simmer; cover and place in oven. Braise until ribs are very tender, about 2 1/2 hours.",
        "Using tongs, transfer ribs to clean bowl. Spoon fat from pan juices. Boil juices until just beginning to thicken, about 10 minutes. Mix 1 tablespoon butter and flour in small bowl to smooth paste. Whisk into juices in pot; simmer until thickened enough to coat spoon, about 5 minutes longer. Season gravy with coarse salt and pepper. Return ribs to pot; spoon gravy over. DO AHEAD: Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm over low heat before serving.",
        "Cook potatoes and parsnips in large pot of boiling salted water until tender, about 15 minutes.",
        "Meanwhile, bring milk, butter, and rosemary to simmer in small saucepan.",
        "Drain potato mixture and return to pot. Stir briefly over medium heat to evaporate excess moisture. Add milk mixture and mash well. Season to taste with salt and pepper.",
        "Transfer short ribs and gravy to large shallow serving bowl. Serve short ribs with mashed potatoes."
    ],
    "ingredients": [
        "3 tablespoons room-temperature butter, divided",
        "8 3-to 4-inch-long meaty beef short ribs (about 4 pounds)",
        "Coarse kosher salt",
        "2 1/2 cups chopped red onions",
        "2 cups 1/2-inch cubes peeled parsnips",
        "6 garlic cloves, chopped",
        "2 tablespoons chopped fresh rosemary",
        "1 750-ml bottle Zinfandel",
        "2 cups low-salt beef broth",
        "1 tablespoon all purpose flour",
        "3 tablespoons room-temperature butter, divided",
        "3 pounds russet potatoes, peeled, cut into 1-inch cubes",
        "1 pound large parsnips, peeled, cut into 3/4-inch cubes",
        "1 cup whole milk",
        "6 tablespoons (3/4 stick) butter",
        "1 tablespoon chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Potato",
        "Braise",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Rosemary",
        "Beef Rib",
        "Parsnip",
        "Red Wine",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Zinfandel-Braised Beef Short Ribs with Rosemary-Parsnip Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/zinfandel-braised-beef-short-ribs-with-rosemary-parsnip-mashed-potatoes-352635"
}
