{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Sprinkle the corned beef with a little water, wrap it tightly in aluminum foil and steam it in the oven.",
        "Meanwhile, put the whole loaf of rye bread (unwrapped) into the oven. Bake the bread until the crust is very crunchy, about 15 minutes. Set the bread on the counter and let it cool for about 5 minutes.",
        "When the rye bread is cool enough to handle place it on a cutting board. Hold the bread knife at a 45-degree angle and cut 12 slices.",
        "Take the corned beef out of the oven and unwrap it. Spread each slice of bread with Russian dressing. Layer half of the slices with corned beef, sauerkraut and slices of Swiss cheese, then top the sandwiches with the remaining slices of bread (dressing-side down).",
        "Heat 2 large heavy skillets over medium heat. Brush the bread with butter. Put the sandwiches in the pans and weight them with a lid or heat proof bowl topped with something heavy. Cook until the first sides are crisp and golden about 7 minutes then flip the sandwiches. Cook until the second sides are also well toasted and the cheese is melted. Lift the sandwiches onto a cutting board. Cut each in half diagonally and serve.",
        "Combine the mayonnaise, chili sauce, sour cream, parsley, onion, pickle, lemon juice, horseradish and Worcestershire sauce in a bowl and mix well."
    ],
    "ingredients": [
        "1 loaf unseeded and unsliced Jewish Rye bread",
        "2 pounds corned beef, sliced (see Cook's Note)",
        "12 ounces Russian dressing, recipe follows",
        "12 ounces sauerkraut",
        "12 slices Swiss cheese",
        "4 tablespoons butter, melted",
        "3/4 cups mayonnaise",
        "1/4 cup plus 2 to 3 tablespoons chili sauce",
        "2 tablespoons sour cream",
        "2 teaspoons chopped curly parsley leaves",
        "1 tablespoon plus 1 teaspoon minced Spanish onion",
        "1 tablespoon plus 1 teaspoon minced dill pickle",
        "1/2 teaspoon fresh lemon juice",
        "1/2 teaspoon grated horseradish",
        "1/4 teaspoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Lunch Recipes",
        "Easy Recipes",
        "Lunch",
        "American",
        "Sandwich",
        "Beef",
        "Meat"
    ],
    "title": "Zingerman's Reuben Sandwich",
    "url": "http://www.foodnetwork.com/recipes/zingermans-reuben-sandwich-recipe"
}
