{
    "directions": [
        "Make the pesto",
        "Bring a large pot of water to a boil over high heat.",
        "In a food processor, combine the garlic, pine nuts, arugula and Parmigiano-Reggiano and pulse to chop. With the machine running, gradually add the olive oil. Add the salt and several grindings of pepper. Reserve 1/2 cup of the pesto and store the remaining pesto for future use (see note above).",
        "Cook the pasta",
        "Add the 2 Tbs. salt and the pasta to the boiling water. Cook, stirring occasionally to prevent sticking, until the pasta is al dente (tender but firm to the bite), according to the package instructions. Drain, reserving about 1/2 cup of the cooking water. Return the pasta to the pot.",
        "Finish the pasta",
        "Meanwhile, in a large fry pan over medium-high heat, melt the butter. Add the chicken and cook, stirring occasionally until heated through, 3 to 4 minutes.",
        "Add the chicken to the cooked pasta, along with the reserved 1/2 cup arugula pesto, the tomatoes, ricotta salata and Parmigiano-Reggiano. Stir to combine, adding as much of the cooking water as needed to loosen the sauce. Season with salt and pepper and serve immediately. Serves 4 to 6; makes about 4 cups pesto total.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Make Ahead,",
        "by Rick Rodgers (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "2 garlic cloves",
        "1/2 cup pine nuts",
        "5 cups baby arugula",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "1 cup olive oil",
        "1 tsp. salt",
        "Freshly ground pepper, to taste",
        "",
        "2 Tbs. salt, plus more, to taste",
        "1 lb. ziti",
        "2 Tbs. unsalted butter",
        "2 cups cooked, shredded chicken",
        "1/2 lb. cherry tomatoes, halved",
        "1 cup ricotta salata, crumbled",
        "1/4 cup grated Parmigiano-Reggiano cheese",
        "Freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Ziti with Arugula Pesto and Chicken",
    "url": "http://www.williams-sonoma.com/recipe/ziti-with-arugula-pesto-and-chicken.html"
}
