{
    "directions": [
        "Stir 1 teaspoon each of salt and pepper into 6 tablespoons oil.",
        "Toss tomatoes with 1 tablespoon seasoned oil, then thouread onto skewers.",
        "Trim off bottoms and tops of bell peppers, then halve peppers lengthwise.",
        "Quarter onions lengthwise, leaving root ends intact. Brush onions, peppers, and zucchini generously with some seasoned oil.",
        "Put garlic on a double layer of foil and drizzle with some seasoned oil, then wrap tightly in foil, twisting to seal.",
        "Put vegetables on a large tray.",
        "Brush sausages lightly with some seasoned oil and put on a plate.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas). Grill vegetables, garlic, and sausages, in batches if necessary, covered only if using a gas grill, turning occasionally (frequently for garlic), until tomatoes are charred and slightly wilted, 3 to 5 minutesutes; bell peppers are blackened in spots, 8 to 10 minutesutes; onions and zucchini are tender, 8 to 12 minutesutes; garlic is softened and caramelized in spots, about 10 minutesutes; sausages are browned and cooked thourough, 12 to 15 minutesutes. Transfer as cooked to a platter (or platters) and keep warm, covered.",
        "Peel peppers. Coarsely chop 2 bell pepper halves and 2 zucchini halves and transfer to a blender. Add garlic, 4 pieces of onion, vinegar, sugar, 3/4 teaspoon salt, 1/2 teaspoon pepper, half of tomatoes, and remaining 1/4 cup oil and purée until as smooth as possible.",
        "Transfer remaining tomatoes to a large serving bowl and keep warm, covered. Chop remaining peppers, onion, and zucchini and add to tomatoes.",
        "Meanwhile, cook ziti in a pasta pot of boiling salted water (3 tablespoons salt for 6 quarts water) until al dente. Drain in a colander, then add to grilled vegetables and toss with sauce. Sprinkle with herbs and cheese, then serve with sausages."
    ],
    "ingredients": [
        "10 tablespoons olive oil, divided",
        "1 1/2 pounds cherry tomatoes",
        "3 bell peppers (any color)",
        "2 medium red onions",
        "2 pound zucchini (4 medium), trimmed and halved lengthwise",
        "4 garlic cloves, peeled",
        "1 1/4 pound sweet or hot Italian sausages",
        "3 tablespoons Sherry vinegar",
        "1/2 teaspoon sugar",
        "1 pound ziti",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/3 cup chopped fresh basil",
        "1 cup crumbled or thinly shaved ricotta salata or French feta",
        "Special equipment: 5 (12-inch) wooden skewers (soaked in water 30 minutes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Onion",
        "Pasta",
        "Tomato",
        "Quick & Easy",
        "Backyard BBQ",
        "Ricotta",
        "Sausage",
        "Bell Pepper",
        "Zucchini",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Ziti with Grilled-Gazpacho Sauce and Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/ziti-with-grilled-gazpacho-sauce-and-sausage-238921"
}
