{
    "directions": [
        "Make the sauce: Heat the olive oil in a large skillet over medium-high heat. Add the garlic, fennel seeds and red pepper flakes and cook, stirring, until the garlic is lightly golden, about 1 minute. Add the tomatoes and 1 teaspoon salt; cook, stirring occasionally, until the tomatoes begin to sizzle, about 5 minutes. Add half of the basil and 1/2 cup water and bring to a boil. Reduce the heat to medium low and simmer, stirring occasionally and smashing the tomatoes with the back of a spoon, 25 minutes. Stir in the remaining basil and season with salt.",
        "Prepare the zucchini: Preheat the oven to 400 degrees F. Trim the zucchini and halve crosswise, then slice lengthwise into 18 strips, about 1/4 inch thick. Put the flour in a shallow dish. Whisk the eggs and milk in another dish. In a third dish, combine the panko, parmesan, parsley, garlic, 1/2 teaspoon salt, and pepper to taste. Working in batches, dredge the zucchini in the flour and shake off the excess. Dip in the egg mixture, turning to coat; let the excess drip off, then dredge in the panko mixture, pressing to help it stick. Set aside.",
        "Heat the olive oil in a large, deep skillet over medium-high heat. Working in batches, add the zucchini in a single layer and fry until golden brown, 2 to 3 minutes per side. Drain on paper towels; season with salt.",
        "Lay 6 pieces fried zucchini a few inches apart in a 9-by-13-inch baking dish. Top each with a few tablespoons of the tomato sauce, a slice of mozzarella and a piece of prosciutto. Repeat the layering (zucchini, sauce, mozzarella, prosciutto), then top with the remaining zucchini. Top with a little more sauce, sprinkle with parmesan and dollop with the ricotta. Bake until heated through, about 15 minutes. Top the stacks with more prosciutto. Serve with the remaining sauce.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "For the sauce:",
        "2 tablespoons extra-virgin olive oil",
        "2 cloves garlic, thinly sliced",
        "1/2 teaspoon fennel seeds, chopped",
        "1/4 to 1/2 teaspoon red pepper flakes",
        "3 pounds plum tomatoes, cored and roughly chopped",
        "Kosher salt",
        "1/2 cup chopped fresh basil",
        "For the zucchini:",
        "2 medium-to-large zucchini",
        "3/4 cup all-purpose flour",
        "2 large eggs",
        "1/3 cup milk",
        "2 cups panko breadcrumbs",
        "1/2 cup grated parmesan cheese, plus more for sprinkling",
        "1/4 cup chopped fresh parsley",
        "1 clove garlic, grated",
        "Kosher salt and freshly ground pepper",
        "1 cup olive oil, for frying",
        "6 ounces fresh mozzarella, sliced into 12 pieces",
        "2 ounces thinly sliced prosciutto, torn into 12 pieces, plus more for topping (optional)",
        "2/3 cup ricotta cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Vegetable",
        "Zucchini Recipes",
        "Main Dish Recipes"
    ],
    "title": "Zucchini Parmesan",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/zucchini-parmesan-recipe"
}
