{
    "directions": [
        "In a large bowl stir together zucchini, onions, bell pepper, and salt until combined well. Chill vegetables, covered, at least 6 hours and up to 1 day.",
        "In a large colander drain vegetables and rinse a few times under cold water, draining well.",
        "In a stainless-steel or enameled kettle combine vegetables and remaining ingredients and bring to a boil. Simmer relish, stirring occasionally, 10 minutes and with a sterilized spoon divide among 10 sterilized 8-ounce Mason-type jars (procedure follows). Pour remaining liquid over relish and cool completely. Wipe rims with a dampened cloth and seal jars with lids. Relish keeps, covered and chilled, 2 months.",
        "Wash the jars in hot suds and rinse them in scalding water. Put the jars in a kettle and cover them with hot water. Bring the water to a boil, covered, and boil the jars for 15 minutes from the time that steam emerges from the kettle. Turn off the heat and let the jars stand in the hot water. Just before they are to be filled invert the jars onto a kitchen towel to dry. (The jars should be filled while they are still hot.) Sterilize the jar lids for 5 minutes, or according to the manufacturer's instructions."
    ],
    "ingredients": [
        "4 pounds zucchini, peeled, quartered lengthwise, cored, and chopped",
        "2 medium onions, chopped",
        "1 medium red bell pepper, chopped",
        "2 tablespoons salt",
        "1 1/2 cups sugar",
        "1 cup water",
        "1 cup distilled white vinegar",
        "1 teaspoon celery seeds",
        "1 teaspoon freshly grated nutmeg",
        "1 teaspoon turmeric if desired",
        "1/2 teaspoon freshly ground black pepper, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Onion",
        "Vinegar",
        "Bell Pepper",
        "Zucchini",
        "Chill",
        "Gourmet",
        "Kentucky"
    ],
    "title": "Zucchini Relish Wiley",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-relish-wiley-13250"
}
