{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease the inside of a casserole dish.",
        "Scoop pulp from the center of each zucchini half, leaving a 1/2-inch deep shell. Chop pulp and reserve. Place zucchini shells in a pot of lightly salted water; bring to a boil. Cook until zucchini are slightly tender, about 5 minutes. Drain and arrange zucchini in bottom of prepared casserole dish.",
        "Heat olive oil in a skillet over medium heat; cook and stir onions and zucchini pulp until onions are softened, 5 to 7 minutes. Season with salt and black pepper. Add rice and reserved juice from canned tomatoes; cook until liquid is nearly evaporated, stirring regularly, about 5 minutes. Add tomatoes and stir to combine.",
        "Stir water in 1/2 cup increments into rice mixture until rice has absorbed all the water and is almost tender, 10 to 15 more minutes. Add mint, parsley, wine, and sausages; cook until heated through and rice is tender, adding additional water if needed, 5 to 10 minutes. Spoon rice mixture over zucchini halves in casserole dish.",
        "Bake casserole in preheated oven until zucchini are tender, about 20 minutes."
    ],
    "ingredients": [
        "4 zucchini, halved lengthwise",
        "1/4 cup olive oil",
        "3 sweet onions, chopped",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper, or to taste",
        "1 cup short-grain white rice",
        "1 (16 ounce) can diced tomatoes, drained and juice reserved",
        "1 cup water, or more as needed",
        "2 tablespoons chopped fresh mint, or more to taste",
        "1 cup chopped fresh parsley",
        "3 tablespoons Chardonnay wine",
        "1/2 (14 ounce) package little smoked sausages, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Zucchini Casserole with Mint and Parsley",
    "url": "http://allrecipes.com/recipe/223219/zucchini-casserole-with-mint-and-pars/"
}
