{
    "directions": [
        "For the dressing, first soak the bread in water for 5 minutes. Drain the bread, then place in a blender with the almonds, garlic, vinegar, and 1/2 cup of the olive oil. Gradually add the cold water and blend on high for 30 seconds, or until a smooth purée forms. Add salt to taste, then set aside in a bowl until serving time.",
        "Preheat the oven to 350°F",
        "On the stove, heat a ridged grill pan or grill to high, until slightly smoky.",
        "Coat the cut sides of the zucchini pieces with 1/3 cup of the olive oil. Place them on the ridged grill pan and cook them, turning now and then, until they are branded all over. Place on a baking tray and finish in the oven for another 3–5 minutes-you want to cook them through, but leave a bit of texture and crunch to the zucchini. Once cooked, set aside and keep warm.",
        "Place the nuts and remaining olive oil in a small saucepan over medium heat and warm through until fragrant. Transfer the nuts to a bowl, then season with the paprika and salt to taste.",
        "To assemble the dish, place the warm zucchini in a large mixing bowl, along with the herbs and nuts, and stir gently to combine. Season with salt to taste and freshly ground black pepper if needed.",
        "Dollop most of the dressing around the bottom of your serving dish, then arrange the zucchini salad on top. If desired, drizzle some more dressing on top for that creamy, nutty flavor and texture."
    ],
    "ingredients": [
        "3 to 4 slices white bread, crusts removed",
        "3/4 cup blanched almonds, roughly chopped",
        "1 garlic clove, peeled",
        "1 teaspoon sherry vinegar",
        "1 cup extra-virgin olive oil",
        "1/3 cup ice-cold water",
        "3 medium zucchinis, cut into random pieces",
        "1/2 ounce hazelnuts, chopped",
        "1/2 ounce blanched almonds, chopped",
        "1/2 ounce walnuts, chopped",
        "Pinch of smoked paprika",
        "1 small handful flat-leaf (Italian) parsley, washed and chopped",
        "1 small handful mint, washed and chopped",
        "Freshly ground black pepper",
        "Salt to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Kid-Friendly",
        "Quick & Easy",
        "High Fiber",
        "Lunch",
        "Mint",
        "Almond",
        "Walnut",
        "Zucchini",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Hazelnut",
        "Parsley",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Zucchini Salad With Ajo Blanco Dressing & Spiced Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-salad-with-ajo-blanco-dressing-spiced-nuts-56389847"
}
