{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch fluted tube pan (such as a Bundt(R)).",
        "Sift flour, salt, baking soda, cinnamon, nutmeg, and allspice together in a bowl. Cream butter and vegetable shortening together in a separate large bowl until thoroughly combined; beat in white sugar and 1 cup brown sugar until the mixture is smooth and creamy. Beat eggs, water, and vanilla extract into the shortening mixture, followed by the flour mixture. Gently stir in zucchini and 1/2 cup walnuts. If batter seems dry, mix in 1 more tablespoon water.",
        "Melt 1/4 cup butter in a saucepan over medium-low heat and stir in 1/2 cup brown sugar until it has dissolved and small bubbles appear in the mixture. Stir 1/2 cup walnuts into the brown sugar mixture.",
        "Spoon brown sugar-walnut mixture into the bottom of the prepared cake pan and pour cake batter over the mixture.",
        "Bake in the preheated oven until lightly golden brown and a toothpick inserted into the center of the cake comes out clean, about 1 hour. Let cool in the pan for 10 minutes, then invert over a serving plate to reveal the brown sugar topping."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground allspice",
        "1/2 cup butter",
        "1/2 cup vegetable shortening",
        "1 cup white sugar",
        "1 cup brown sugar, not packed",
        "3 eggs",
        "1 tablespoon water, or more if needed",
        "1 teaspoon vanilla extract",
        "2 cups shredded zucchini",
        "1/2 cup chopped walnuts",
        "1/4 cup butter",
        "1/2 cup brown sugar",
        "1/2 cup chopped walnuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Zucchini Nut Cake",
    "url": "http://allrecipes.com/recipe/228672/zucchini-nut-cake/"
}
