{
    "directions": [
        "Quick-thaw the peas by blanching in boiling water for 3 minutes or microwaving until soft. In a food processor or high-speed blender, combine the peas, pine nuts, garlic, oil, water, hemp seeds, lemon zest, lemon juice, salt, and pepper to taste and pulse until the mixture is well combined and thick. Adjust seasonings to taste. Store in an airtight glass container in the refrigerator for up to 1 week.",
        "Place the grated zucchini in a strainer, sprinkle the salt on top, and gently toss until the salt is distributed. Allow the zucchini to sit and sweat excess moisture for 45 to 60 minutes.",
        "Transfer the zucchini from the strainer to a nut-milk bag or cheesecloth. Wrapping the cloth around the zucchini entirely, use your hands to squeeze out any excess liquid. Repeat the process until the zucchini no longer releases liquid. Place the zucchini in a large bowl and add the flours, eggs, garlic, nutritional yeast, oregano, red pepper flakes, and black pepper to taste. Stir to combine well.",
        "Position one rack in the middle of the oven and another in the top position. Place a pizza stone (for a crispier crust) or a baking sheet lined with parchment paper on the middle rack. Preheat the oven to 500ºF. Place a large piece of parchment paper on a clean countertop and drizzle it with olive oil. Spread the zucchini dough onto the parchment paper and form the dough into a large 10-inch round or oval, about 1/2 inch thick.",
        "Transfer the dough from the parchment paper directly to the hot pizza stone or lined baking sheet and bake for 20 minutes. Flip the pizza crust over and bake for an additional 10 minutes, until the crust is firm-crisp.",
        "Carefully remove the crust from the oven, spoon on the pesto to the desired thickness, and bake on the top rack for 5 to 7 minutes, until the pesto is warm. Remove from the oven. Top with garnishes, if desired, and serve immediately."
    ],
    "ingredients": [
        "1 (10-ounce) bag frozen peas",
        "2 tablespoons pine nuts, toasted",
        "2 cloves garlic, minced",
        "2 tablespoons olive oil",
        "2 tablespoons filtered water",
        "2 tablespoons hemp seeds",
        "1 tablespoon grated fresh lemon zest",
        "Juice of 1 lemon",
        "Pinch of sea salt",
        "Freshly ground black pepper",
        "3 cups finely grated zucchini",
        "1–2 teaspoons sea salt",
        "1/2 cup almond flour",
        "2 tablespoons brown rice flour",
        "2 eggs, beaten",
        "2 cloves garlic, minced",
        "2 tablespoons nutritional yeast",
        "1 teaspoon dried oregano",
        "1/2 teaspoon red pepper flakes",
        "Freshly ground black pepper",
        "Olive oil, for drizzling",
        "Garnishes: arugula, grated fresh lemon zest, fresh lemon juice, and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Pizza",
        "Wheat/Gluten-Free",
        "Zucchini",
        "Pea",
        "Dinner",
        "Spring",
        "Vegetarian",
        "Pine Nut"
    ],
    "title": "Zucchini Pizza Crust With Lemony Pea Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-pizza-crust-with-lemony-pea-pesto"
}
