{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Fit pie dough into pie plate and lightly prick all over. Bake according to package instructions, then transfer crust in pie plate to a rack.",
        "Reduce oven temperature to 350°F.",
        "While crust bakes, cook bacon in a 12-inch heavy skillet over moderately high heat, stirring occasionally, until just crisp, about 6 minutes. Transfer bacon with a slotted spoon to a paper-towel-lined plate, reserving fat in skillet.",
        "Add zucchini and 1/4 teaspoon salt to fat in skillet and sauté over moderately high heat, stirring frequently, until zucchini is tender and starting to brown, about 5 minutes, then transfer with slotted spoon to a plate.",
        "Heat cream, milk, pepper, and remaining 1/4 teaspoon salt in a 1- to 2-quart saucepan until mixture reaches a bare simmer, then remove from heat.",
        "Whisk together eggs in a large heatproof bowl, then gradually whisk in hot cream mixture until combined. Stir in bacon, zucchini, and cheese and pour into piecrust. Bake until filling is just set, 25 to 30 minutes. Transfer quiche in pan to rack to cool slightly, about 20 minutes."
    ],
    "ingredients": [
        "1 (9-inch) refrigerated pie dough round (from a 15-oz package)",
        "1/4 lb sliced bacon, coarsely chopped",
        "2 medium zucchini (3/4 lb total), halved lengthwise, then cut crosswise into 1/8-inch-thick slices",
        "1/2 teaspoon salt",
        "3/4 cup heavy cream",
        "3/4 cup whole milk",
        "1/4 teaspoon black pepper",
        "3 large eggs",
        "2 oz Gruyère, coarsely grated (1 cup)",
        "Special equipment: a 9 1/2-inch deep-dish pie plate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Pork",
        "Vegetable",
        "Bake",
        "Quick & Easy",
        "Bacon",
        "Zucchini",
        "Gourmet"
    ],
    "title": "Zucchini, Bacon, and Gruyère Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-bacon-and-gruyere-quiche-233259"
}
