{
    "directions": [
        "Cook and stir ground beef, Italian sausage, onion, and garlic in a large skillet over medium heat until the meat is crumbly and no longer pink, about 10 minutes. Drain grease and stir basil, oregano, brown sugar, red pepper flakes, 1 teaspoon salt, black pepper, tomatoes, and tomato paste into the meat. Bring to a boil, reduce heat to low, and simmer meat sauce for 30 minutes. Stir occasionally.",
        "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.",
        "Mix eggs, ricotta cheese, 1 cup Parmesan cheese, parsley, and 1 teaspoon salt in a bowl until thoroughly combined. Pare several slices of skin lengthwise from zucchini, alternating with strips of remaining skin. Cut zucchini into long strips to resemble lasagna noodles. Discard seedy middle strips.",
        "Place 1/3 of the zucchini strips into bottom of the prepared baking dish, filling in any gaps with scrap pieces of zucchini. Spread half the ricotta mixture over zucchini; spread 1 cup of mozzarella cheese over ricotta mixture; spread 1/3 of the meat sauce over mozzarella cheese. Repeat layers once more, layering 1/3 of zucchini strips, remaining half of the ricotta mixture, 1 more cup of mozzarella cheese, and 1/3 of the meat sauce. Make a third layer of remaining zucchini strips, remaining meat sauce, and 2 tablespoons Parmesan cheese sprinkled on top.",
        "Bake in the preheated oven until lasagna is bubbling and top is browned, about 1 hour. If top is browning too quickly, cover dish with aluminum foil during last 15 minutes of baking time. Spread 1 cup mozzarella cheese on top of the casserole and bake until mozzarella cheese topping is melted, 5 to 10 more minutes. Let casserole stand 10 minutes before serving."
    ],
    "ingredients": [
        "1/2 pound ground beef",
        "1/2 pound bulk Italian sausage",
        "1 onion, chopped",
        "4 cloves garlic, minced",
        "2 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh oregano",
        "2 tablespoons brown sugar",
        "1 tablespoon red pepper flakes, or to taste",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (12 ounce) can tomato paste",
        "2 eggs",
        "2 cups ricotta cheese",
        "1 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon salt",
        "3 large zucchini, trimmed",
        "2 cups shredded mozzarella cheese, divided",
        "2 tablespoons grated Parmesan cheese",
        "1 cup shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Zucchini Lasagna With Beef and Sausage",
    "url": "http://allrecipes.com/recipe/229289/zucchini-lasagna-with-beef-and-sausag/"
}
