{
    "directions": [
        "Coarsely grate zucchini, then toss with 2 teaspoons salt and let stand 30 minutes.",
        "While zucchini stands, peel potatoes and cut into 1/3-inch dice.",
        "Heat oil in skillet over medium-high heat until hot, then add potatoes, onion, and 3/4 teaspoon salt. Reduce heat to medium-low and cook (without browning), uncovered, stirring occasionally, 30 minutes.",
        "Transfer zucchini to a colander to drain, then squeeze small handfuls to remove as much liquid as possible, transferring as squeezed to a small bowl.",
        "Add zucchini to potatoes and cook, stirring occasionally, until potatoes are tender and zucchini is slightly browned, about 15 minutes. Drain vegetables in colander set over a bowl, reserving oil. Cool 5 minutes.",
        "Lightly beat eggs in a large bowl, then stir in vegetables, 1 tablespoon reserved oil, 3/4 teaspoon salt, and 1/2 teaspoon pepper.",
        "Return 1 tablespoon reserved oil to skillet and add egg mixture, pressing potatoes flush with eggs. Cook over low heat, covered, until almost set and underside is golden, 12 to 15 minutes. Remove from heat and let stand, covered, 15 minutes.",
        "Run a rubber spatula around tortilla and shake skillet gently to loosen (if bottom sticks, carefully slide spatula underneath). Slide tortilla onto a large flat plate, then cover with skillet and invert tortilla back into skillet. Round edge of tortilla with rubber spatula and cook over low heat, uncovered, until set, about 15 minutes more.",
        "Slide tortilla onto a serving plate and cut into wedges. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 pounds zucchini (preferably small; 6 to 8)",
        "2 pounds boiling potatoes",
        "1 1/2 cups olive oil",
        "2 1/2 cups chopped Spanish onion (1 pound)",
        "10 large eggs",
        "a 12-inch nonstick skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Potato",
        "Brunch",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Zucchini",
        "Pan-Fry",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Zucchini Potato Tortilla",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-potato-tortilla-242870"
}
