{
    "directions": [
        "Preheat oven to 450°F.",
        "In a small dry heavy skillet, toast seeds over moderate heat, shaking skillet, until fragrant, being careful not to burn them, and cool.",
        "Brush an ovenproof skillet large enough to hold red snapper fillets in one layer with 3 tablespoons oil and cook onion over moderate heat, stirring, 5 minutes, or until softened and slightly golden.",
        "Stir in seeds, cinnamon, and garlic and cook, stirring, 1 minute. Add tomatoes and zest and cook, stirring, 5 minutes or until tomatoes are slightly softened. Stir in wine and cook, stirring, until most of liquid is evaporated. Remove pan from heat and stir in orange juice, parsley, and salt and pepper to taste.",
        "Pat fillets dry and season with salt and pepper.",
        "Trim ends of zucchini and with a mandoline or other hand-held slicing device, slice zucchini lengthwise into about twenty-eight 1/8-inch-thick strips. On a work surface, arrange fillets in one layer and place about 7 zucchini strips crosswise on top of each fillet, overlapping them slightly and leaving ends of fillet exposed. Carefully tuck ends of zucchini strips under each fillet and with a long spatula, transfer zucchini-wrapped fillets, zucchini strip ends down, to tomato sauce (fillets should be in one layer). Brush tops of fillets with remaining tablespoon oil and bake fillets in skillet in middle of oven 15 to 20 minutes, or until just cooked through.",
        "Discard zest and divide fillets and sauce among 4 plates. Garnish fillets with parsley."
    ],
    "ingredients": [
        "2 teaspoons cumin seeds",
        "four 6- to 7-ounce red snapper fillets, skinned",
        "4 tablespoons olive oil",
        "1 large onion, sliced",
        "1/8 teaspoon cinnamon",
        "4 garlic cloves, sliced thin",
        "1 1/2 pounds plum tomatoes, cut into chunks",
        "two 3-inch strips fresh orange zest, removed with a vegetable peeler",
        "1/4 cup dry white wine",
        "1/4 cup fresh orange juice",
        "1/4 cup chopped flat-leafed parsley leaves",
        "two 7-inch-long zucchini (each about 1/2 pound)",
        "Garnish: flat-leafed parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Tomato",
        "Vegetable",
        "Bake",
        "Orange",
        "Snapper",
        "Spice",
        "Zucchini",
        "Healthy",
        "Gourmet"
    ],
    "title": "Zucchini-Wrapped Red Snapper with Tomato, Cumin, and Orange Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-wrapped-red-snapper-with-tomato-cumin-and-orange-sauce-10045"
}
