{
    "directions": [
        "Whisk yeast, sugar, and 3 Tbsp. warm water in a large bowl. Let sit until surface is foamy, about 5 minutes. Add 1 1/4 cups room-temperature water, then add 1 cup flour, whisking until smooth (mixture should be the consistency of pancake batter). Add 2 1/2 cups flour and 2 tsp. kosher salt and mix with a wooden spoon until a shaggy dough forms.",
        "Turn out dough onto a lightly floured surface and knead with your hands, adding more flour as needed to prevent it from sticking, until dough is smooth and supple, 5–10 minutes (it will be very soft). Transfer to a large oiled bowl and cover with plastic wrap. Let rise in a warm, draft-free spot until doubled in size, 1–1 1/2 hours.",
        "Divide dough into 4 equal pieces and form into balls. Place on an oiled rimmed baking sheet and cover with plastic wrap; let rise in a warm, draft-free spot until balls of dough are nearly doubled in size, 40–50 minutes.",
        "Meanwhile, place potato slices in a colander and rinse with cold water. Drain, season with kosher salt, and let sit, tossing occasionally, until softened, 10–15 minutes. Transfer to a bowl and toss with onion, zucchini, and 2 Tbsp. oil; set aside.",
        "Preheat oven to 450°F. Working with 1 ball of dough at a time and keeping remaining dough covered while you work, roll out dough on a lightly floured surface into 10\" rounds.",
        "Heat a dry large cast-iron skillet over medium. Pour 1 Tbsp. oil into skillet and cook a dough round until bottom is golden brown and top looks dry, about 1 minute. Flip and cook just until bottom is lightly golden, about 1 minute. Transfer to a rimmed baking sheet and repeat with remaining 3 Tbsp. oil and rounds of dough (you should be able to fit two pizzettas per baking sheet if you overlap them slightly).",
        "Top pizzettas with Fontina cheese and reserved potato mixture; season with kosher salt. Bake, rotating baking sheets once top to bottom and back to front, until crusts are golden brown and crisp and cheese is bubbling, 10–15 minutes. Remove pizzettas from oven, season with sea salt and pepper, and drizzle with oil."
    ],
    "ingredients": [
        "1 (1/4-ounce) envelope active dry yeast (about 2 1/4 teaspoons)",
        "Pinch of sugar",
        "3 1/2 cups all-purpose flour, divided, plus more for surface",
        "2 teaspoons kosher salt, plus more",
        "6 tablespoons olive oil, divided, plus more",
        "2 small red waxy potatoes (about 1/2 pound), scrubbed, very thinly sliced",
        "1 red onion, very thinly sliced",
        "1 medium zucchini, very thinly sliced",
        "4 ounces Fontina cheese, grated (about 1 1/2 cups)",
        "Flaky sea salt",
        "Coarsely ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pizza",
        "Zucchini",
        "Cast Iron",
        "Fontina",
        "Onion",
        "Summer",
        "Potato",
        "Dinner",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Zucchini, Potato, And Fontina Pizzettas",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-potato-and-fontina-pizzettas"
}
