{
    "directions": [
        "Thinly julienne zucchini lengthwise with slicer, working around core, into 1/4-inch-thick ribbons. Cut zucchini cores into 1/2-inch pieces.",
        "Peel potatoes and cut into 1/2-inch pieces. Cook onion in butter in a 5-quart heavy pot over moderate heat, stirring occasionally, until softened, about 10 minutes. Add potatoes, garlic, and saffron and cook, stirring, 1 minute. Add broth, bay leaf, and thyme and simmer, uncovered, until potatoes are tender, about 20 minutes. Add chopped zucchini cores and simmer, uncovered, until zucchini is very tender, about 8 minutes.",
        "Purée soup in batches in a blender until very smooth (use caution when blending hot liquids) and pour through a fine sieve into a bowl. Stir in cream, lemon juice, salt, and pepper, then cool to room temperature, uncovered. Chill soup, covered, until cold, at least 4 hours and up to 2 days.",
        "While soup is chilling, cook julienned zucchini in boiling salted water until crisp-tender, about 30 seconds, then drain and transfer to a bowl of ice and cold water. Drain and pat dry with paper towels. Season with salt and pepper and chill, covered.",
        "Before serving soup, cut each scallop horizontally into 3 rounds and pat dry. Heat oil in a large nonstick skillet over high heat until hot but not smoking, then sear scallops until golden brown, 20 to 30 seconds on each side, and season with salt.",
        "Serve soup with zucchini mounded in center, topped with scallop rounds."
    ],
    "ingredients": [
        "2 pounds small (5-inch-long) zucchini",
        "1 medium onion, chopped",
        "3 tablespoons unsalted butter",
        "1 pound boiling potatoes",
        "1 teaspoon chopped garlic",
        "1/4 teaspoon finely crumbled saffron threads",
        "5 cups chicken broth",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 teaspoon packed fresh thyme leaves",
        "1/2 cup chilled heavy cream",
        "2 teaspoons fresh lemon juice",
        "1 1/4 teaspoons salt",
        "1/4 teaspoon black pepper",
        "4 large sea scallops (4 ounces total), tough muscle removed from side of each if necessary",
        "1 tablespoon vegetable oil",
        "Special equipment: an adjustable-blade slicer fitted with julienne blade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Potato",
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Lunch",
        "Scallop",
        "Saffron",
        "Zucchini",
        "Summer",
        "Chill",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Zucchini and Saffron Vichyssoise with Scallops",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-and-saffron-vichyssoise-with-scallops-107004"
}
