{
    "directions": [
        "In a large non-stick skillet heat 2 teaspoons oil over moderately high heat until hot but not smoking and sauté zucchini until it begins to brown. Add spinach and cook, stirring occasionally, until just wilted. Season mixture with salt and pepper. Remove skillet from heat and cool vegetables slightly.",
        "Preheat oven to 225°F. Grease a large baking sheet.",
        "In a large bowl beat eggs lightly and stir in vegetables, tarragon, and salt and pepper to taste. In a 9-inch heavy omelet pan heat 1 teaspoon oil over moderately low heat until hot but not smoking and add 1 cup egg mixture, tilting pan to distribute evenly. Cook egg mixture until set underneath but still slightly wet in center, 3 to 4 minutes. Slide frittata halfway out of pan onto prepared baking sheet and fold second half over to make a half circle. (Eggs will continue to cook from residual heat.) Keep frittata warm in oven. Make 3 more frittata with remaining oil and egg mixture in same manner. Keep frittata warm, covered with foil, up to 1 hour.",
        "Cut each frittata into 8 wedges."
    ],
    "ingredients": [
        "6 teaspoons olive oil",
        "1 zucchini (about 1/2 pound), cut into 1/4-inch dice",
        "1 large bunch spinach, washed well, spun dry, and chopped coarse",
        "10 large eggs",
        "1 tablespoon chopped fresh tarragon leaves or 1 1/2 teaspoons dried, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Vegetable",
        "Brunch",
        "Vegetarian",
        "Lunch",
        "Spinach",
        "Zucchini",
        "Pan-Fry",
        "Tarragon",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Zucchini and Spinach Frittata",
    "url": "http://www.epicurious.com/recipes/food/views/zucchini-and-spinach-frittata-10237"
}
