{
    "directions": [
        "Cook and stir fennel seeds, cumin seeds, and coriander seeds in a skillet over medium-high heat until toasted and fragrant, 1 to 2 minutes. Transfer to a spice grinder or food processor; add coffee, ancho chile pepper, brown sugar, kosher salt, paprika, black pepper, and red pepper flakes. Grind until spice rub is a medium-coarse texture.",
        "Break steak down into 4-ounce pieces. Lightly score steak 1/2-inch x 1/2-inch and season with salt. Rub steak with spice rub. Heat a cast iron skillet over medium high. Pack spice rub onto all sides of the steak and place in the hot cast iron skillet; drizzle about 1 teaspoon olive oil over steak.",
        "Cook steak in the cast iron skillet until well browned, about 4 minutes. Flip and scatter shallots, smashed garlic, thyme, and butter around steak. Cook steak until desired doneness is reached, 4 to 5 minutes more. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C). Let steak rest for 5 minutes; cut into thin slices.",
        "Whisk juice of 1 lemon, lemon zest, olive oil, honey, salt, and pepper together in a small bowl until dressing is evenly mixed.",
        "Thinly shave fennel and toss with juice from 1/2 lemon (to preserve color) in a bowl. Add apple, mint, parsley, and cilantro. Drizzle dressing over salad and toss gently; season with salt and pepper. Arrange steak slices on top of salad and scatter roasted shallots, pomegranate seeds, and hazelnuts on top."
    ],
    "ingredients": [
        "Coffee Chile Spice Rub:",
        "1 tablespoon fennel seeds",
        "1 tablespoon cumin seeds",
        "1 tablespoon coriander seeds",
        "1/4 cup finely ground dark roast coffee beans",
        "1/4 cup ground ancho chile pepper",
        "1/4 cup brown sugar",
        "2 1/2 tablespoons kosher salt",
        "2 tablespoons hot smoked paprika",
        "2 teaspoons ground black pepper",
        "2 teaspoons red pepper flakes",
        "Steak:",
        "1 pound hanger steak",
        "salt to taste",
        "1 teaspoon olive oil",
        "4 shallots, halved",
        "3 cloves garlic, smashed",
        "3 sprigs fresh thyme",
        "1 tablespoon butter, cut in small pieces",
        "Salad Dressing:",
        "1 lemon, zested and juiced",
        "1 tablespoon olive oil",
        "2 teaspoons honey",
        "salt and ground black pepper to taste",
        "Salad:",
        "1 bulb fennel, halved",
        "1/2 lemon, juiced",
        "1/2 apple, cut into matchstick-size pieces",
        "1 tablespoon fresh mint leaves, or to taste",
        "1 tablespoon fresh parsley leaves, or to taste",
        "1 tablespoon fresh cilantro leaves, or to taste",
        "1/4 cup pomegranate seeds",
        "2 tablespoons chopped hazelnuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gabe's Coffee-Crusted Hanger Steak with Apple, Fennel, and Herb Salad",
    "url": "http://allrecipes.com/recipe/255569/gabes-coffee-crusted-hanger-steak-wi/"
}
