{
    "directions": [
        "Whisk together flour, 1/4 cup sugar, baking powder, and salt in a large bowl, then blend in butter with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal. Drizzle with beaten whole eggs and gently stir with a wooden spoon (or pulse in processor) until incorporated.",
        "Turn dough out onto a lightly floured surface and gently knead a few times (dough will be very soft). Gently press into a ball and flatten into a 6-inch square. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 400°F.",
        "Peel, quarter, and core apples, then cut into 3/4-inch pieces. Stir together butter, zests, sea salt, cardamom, and honey in a 13- by 9-inch glass baking dish, then add apples, stirring to coat, and spread in an even layer.",
        "Roast apples in upper third of oven, stirring occasionally, until very tender and any liquid is absorbed, 1 1/4 to 1 1/2 hours. Stir in Calvados (if using) and cool compote 20 minutes. (Leave oven on.)",
        "Put dough on top of 2 overlapping sheets of wax paper, then top with 2 more overlapping sheets and roll out dough into a square slightly larger than 12 inches (1/8 inch thick). Remove top sheets of paper and trim dough with a small knife into a 12-inch square. Loosely roll dough (with bottom sheets of paper) around rolling pin, then unroll, wax paper side up, onto a parchment-lined baking sheet. Carefully remove wax paper and cut dough into 3 (4-inch-wide) pieces. (If dough becomes too soft to work with, chill briefly.)",
        "Spoon one third of apple compote along a long side of each rectangle, leaving a 3/4-inch border on long edge and a 1/2-inch border on either end.",
        "Brush some of egg wash along all 4 sides of 1 rectangle, then fold pastry in half lengthwise, covering compote completely. Seal edges (including ends) by crimping with a fork dipped occasionally in granulated sugar. Form 2 more pastries in same manner, then chill on baking sheet 15 minutes. Brush pastries with remaining egg wash and lightly sprinkle with remaining tablespoon granulated sugar.",
        "Bake in upper third of oven until golden, 15 to 20 minutes. Cool to warm on baking sheet on a rack.",
        "Beat together heavy cream and crème fraîche in a bowl with an electric mixer at high speed until thickened, about 5 minutes. Fold in honey and sea salt until just combined.",
        "Cut pastries crosswise into 1 1/4-inch-wide slices with a serrated knife. Dust generously with confectioners sugar and serve with honey cream."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/4 cup plus 1 tablespoon granulated sugar",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "2 large eggs, lightly beaten",
        "1 large egg yolk, lightly beaten with 1 tablespoon water",
        "2 pounds Gala apples (about 4)",
        "3 tablespoons unsalted butter, melted",
        "1 teaspoon finely grated fresh orange zest",
        "1 teaspoon finely grated fresh lemon zest",
        "Pinch of fine sea salt",
        "Pinch of ground cardamom",
        "3 tablespoons mild honey",
        "1 tablespoon Calvados or apple brandy (optional)",
        "1/2 cup chilled heavy cream",
        "1/2 cup crème fraîche or sour cream",
        "1/4 cup mild honey",
        "1/8 teaspoon fine sea salt",
        "Special equipment: parchment paper",
        "Garnish: confectioners sugar; toasted sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Honey",
        "Calvados",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gala Apple \"Newtons\" with Honey Cream",
    "url": "http://www.epicurious.com/recipes/food/views/gala-apple-newtons-with-honey-cream-108699"
}
