{
    "directions": [
        "Place the almond paste into a food processor or blender with about half of the sugar, and process until well blended. Add the butter and remaining sugar using and process until smooth, then blend in 1 egg, vanilla extract, almond extract, flour and salt. Set aside.",
        "Preheat the oven to 425 degrees F (220 degrees C). Butter a baking sheet or line with parchment paper, and set aside.",
        "Roll out one sheet of the puff pastry into an 11-inch square. Keep the pastry cool, do not knead or stretch. Use a large pie plate, cake pan or frying pan to trace an 11 inch circle onto the dough using the tip of a small knife. Place the circle of pastry onto the prepared baking sheet. Repeat with the second sheet of pastry. Refrigerate both sheets.",
        "Mound the almond filling onto the center of the pastry that is on the baking sheet. Leave about 1 1/2 inch margin at the edges. Press the bean or feve down into the filling. Place the second sheet of pastry on top, and press down the edges to seal. Beat the remaining egg with a fork, and lightly brush onto the top of the galette. Use a knife to make a crisscross pattern in the egg wash, and then prick several small slits in the top to vent steam while baking.",
        "Bake for 15 minutes in the preheated oven. Do not open the oven until the time is up, as the pastry will not fully puff. Remove from the oven, and dust with confectioners' sugar. Return to the oven, and cook for an additional 12 to 15 minutes, or until the top is a deep golden brown. Transfer to a wire rack to cool.",
        "Lay a golden paper crown gently on top of the cake. This will be used to crown the person who finds the bean or feve. Serve warm or cold. Make sure to tell everyone about the bean or feve."
    ],
    "ingredients": [
        "1/4 cup almond paste",
        "1/4 cup white sugar",
        "3 tablespoons unsalted butter, softened",
        "1 egg",
        "1/4 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "2 tablespoons all-purpose flour",
        "1 pinch salt",
        "1 (17.25 ounce) package frozen puff pastry, thawed",
        "1 dry kidney bean",
        "1 egg, beaten",
        "1 tablespoon confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Galette des Rois",
    "url": "http://allrecipes.com/recipe/80734/galette-des-rois/"
}
