{
    "directions": [
        "Place garbanzos in large bowl. Add water to cover by 2 inches. Let soak overnight. Drain.",
        "Place pork ribs, ham, ham shank, chorizo, steak, and pancetta in heavy large pot. Add 16 cups water. Bring to boil. Add garbanzos and leeks. Reduce heat to medium-low, cover partially, and simmer until garbanzos are tender, adjusting heat as needed to maintain active simmer, about 1 hour. Add potatoes and kale; simmer until potatoes are tender, 40 to 50 minutes.",
        "Using slotted spoon, divide meats, vegetables, and broth among 8 large bowls.",
        "Available at specialty foods stores and Italian markets.",
        "** A pork link sausage flavored with garlic and spices but milder than Mexican chorizo; available at specialty foods stores and Spanish markets and from latienda.com.",
        "The rich stew needs a big red wine. José recommends a Ribera del Duero from northern Spain, like the Bodegas Alejandro Fernández 2006 \"Pesquera\" Tinto ($34). The Zarus 2004 Barrica ($15) would also be a good choice."
    ],
    "ingredients": [
        "1 1/2 cups dried garbanzo beans* (chickpeas; about 9 1/2 ounces)",
        "1 1 1/2-pound rack baby back pork ribs, cut into 3-rib sections",
        "1 to 1 1/4 pounds ham, cut into 3 x 2 x 3/4-inch pieces",
        "1 1-pound smoked ham shank",
        "1 pound fully cooked smoked Spanish chorizo,** cut into 1/2-inch-thick rounds",
        "1 pound skirt steak, cut crosswise into 8 pieces",
        "8 ounces 1/3-inch-thick slices pancetta (Italian bacon), coarsely chopped",
        "16 cups water",
        "5 large leeks (white and pale green parts only), halved lengthwise, cut crosswise into 1-inch pieces",
        "3 pounds 3-inch-diameter white skinned potatoes, peeled, halved",
        "1 pound kale (2 large bunches), center ribs removed, cut crosswise into 3/4-inch-wide strips (about 16 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Potato",
        "Stew",
        "High Fiber",
        "Dinner",
        "Steak",
        "Ham",
        "Leek",
        "Kale",
        "Chickpea",
        "Potluck",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Galician Pork and Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/galician-pork-and-vegetable-stew-358550"
}
