{
    "directions": [
        "In large sauté pan over low heat, heat 2 tablespoons olive oil. Add red, yellow, and green peppers; scallions; celery; and pimientos. Sauté until soft, 8 to 10 minutes. Transfer to large bowl and let cool.",
        "Add crabmeat, mayonnaise, mustard, salt, and pepper to vegetables and stir to combine. Form mixture into 16 patties.",
        "Place Wondra in large bowl. In second large bowl, whisk together eggs and remaining 2 tablespoons olive oil. In third large bowl, place panko. In fourth large bowl, beat egg whites until foamy. In fifth large bowl, place grated sweet potatoes.",
        "Carefully dip 1 patty in Wondra and dust off excess. Then, dip in beaten eggs, allowing excess to drip off, and then in panko. Next, dip in egg whites, allowing excess to drip off. Finally, dip in shredded sweet potatoes, gently pressing potato to patty. Transfer patty to large baking sheet and repeat with remaining patties, filling 2 baking sheets. Refrigerate 30 minutes.",
        "In medium saucepan, combine coconut milk, callaloo leaves, okra, onion, pumpkin, scallions, pimientos, Scotch bonnet, garlic, and thyme. Bring to boil, lower heat, and simmer 1 hour.",
        "In large skillet over moderately low heat, heat 2 tablespoons olive oil. Add 4 crab cakes and fry until potatoes are golden and crispy, 4 to 5 minutes per side. Drain crab cakes on paper towels and keep warm. Add 2 more tablespoons oil to pan and cook 4 more cakes. Repeat with remaining cakes, cooking in batches of 4 and adding 2 tablespoons oil before each batch. Keep warm in oven.",
        "Remove thyme sprigs and Scotch bonnet from callaloo and discard. Pour mixture into blender and purée until smooth. Season with salt and pepper. Divide among 8 soup plates, and top each with 2 crab cakes."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "2 red bell peppers, finely diced",
        "2 yellow bell peppers, finely diced",
        "2 green bell peppers, finely diced",
        "4 scallions (green and white parts), chopped",
        "4 stalks celery, finely diced",
        "4 fresh pimiento peppers, seeded and finely diced (see Tips, below)",
        "1 1/2 pounds jumbo lump crabmeat, picked over",
        "1 cup mayonnaise",
        "1/2 cup grainy mustard",
        "1/4 teaspoon salt",
        "Pinch freshly ground black pepper",
        "2 cups Wondra quick-dissolving flour or all-purpose flour (See Tips, below)",
        "4 eggs",
        "3 cups panko (Japanese breadcrumbs) or fresh breadcrumbs",
        "8 egg whites",
        "4 starchy yellow sweet potatoes (not orange), peeled and coarsely grated",
        "2 cups canned unsweetened coconut milk",
        "1 bunch callaloo leaves, fresh or frozen and defrosted, roughly chopped (see Tips, below)",
        "6 large pods okra, fresh or frozen",
        "1 small onion, chopped",
        "1/4 cup fresh pumpkin, diced",
        "2 whole scallions, chopped",
        "2 fresh pimiento peppers, seeded and chopped",
        "1 Scotch bonnet chile, whole",
        "2 cloves garlic, chopped",
        "2 fresh thyme sprigs",
        "1/2 cup olive oil, divided into 4 (2-tablespoon) portions",
        "1/4 teaspoon salt",
        "Pinch freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Mustard",
        "Onion",
        "Appetizer",
        "Sauté",
        "Lunch",
        "Mayonnaise",
        "Crab",
        "Celery",
        "Bell Pepper",
        "Pumpkin",
        "Sweet Potato/Yam",
        "Pescatarian",
        "Dairy Free"
    ],
    "title": "Gallette of Sweet Potato-Crusted Tobago Crab Cake",
    "url": "http://www.epicurious.com/recipes/food/views/gallette-of-sweet-potato-crusted-tobago-crab-cake-234501"
}
