{
    "directions": [
        "Bring the rice, a pinch of salt, and water to a boil in a saucepan with a lid. Reduce the heat, cover with a lid, and simmer the wild rice until the kernels burst open, 45 to 50 minutes. Replenish the water if necessary. Fluff the rice with a fork, and let stand for 5 to 10 minutes to absorb water.",
        "Preheat oven to 425 degrees F (220 degrees C). Grease a baking dish large enough to hold the game hen.",
        "Heat 2 tablespoons of butter in a skillet, and cook and stir the mushrooms over medium heat until they are partially cooked and starting to give their juice, 5 to 8 minutes. Stir the mushrooms and butter into the cooked rice.",
        "Sprinkle the game hen, inside and out, with poultry seasoning, rosemary, and salt and pepper. Lightly stuff the Cornish hen with the wild rice mixture, and tie the legs together with cooking twine to hold in the stuffing. Slice 2 tablespoons of butter into small pats, and dot them around the bird.",
        "Bake the bird in the preheated oven until no longer pink at the bone and the juices run clear, 40 to 50 minutes.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Remove the game hen from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing."
    ],
    "ingredients": [
        "1/2 cup uncooked wild rice",
        "1 1/2 cups water",
        "1 pinch salt",
        "10 fresh mushrooms, sliced",
        "2 tablespoons butter",
        "1 Cornish game hen, thawed",
        "1 tablespoon poultry seasoning, or to taste",
        "1/2 teaspoon dried crushed rosemary",
        "salt and pepper to taste",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Game Hen Stuffed with Wild Rice and Mushrooms",
    "url": "http://allrecipes.com/recipe/212670/game-hen-stuffed-with-wild-rice-and-m/"
}
