{
    "directions": [
        "Heat 1 1/2 tablespoons olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is translucent, 5 to 10 minutes. Add 1/2 of the chopped tomatoes; cook and stir for 1 minute. Add garbanzo beans, 1 tablespoon lemon juice, and 1 teaspoon olive oil; cover skillet and cook, stirring occasionally, until heated through, about 10 minutes.",
        "Heat butter and remaining 1 teaspoon olive oil in a separate skillet over medium heat; cook and stir zucchini, yellow squash, and green bell pepper until tender, about 5 minutes. Season with salt and black pepper.",
        "Mix remaining 1 tablespoon lemon juice into garbanzo bean mixture; cover and cook for 5 minutes more. Mash garbanzo beans with a potato masher while skillet is still over heat until desired consistency is reach. Mix cumin, chili powder, and paprika into garbanzo beans; stir to coat.",
        "Layer garbanzo bean mixture, vegetable mixture, and remaining tomatoes onto each tortilla; top with Cheddar cheese and hot sauce. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito."
    ],
    "ingredients": [
        "1 1/2 tablespoons olive oil",
        "1/2 large onion, diced",
        "3 cloves garlic, minced, or more to taste",
        "2 tomatoes, divided",
        "2 (15 ounce) cans garbanzo beans, drained",
        "2 tablespoons lemon juice, divided",
        "2 teaspoons olive oil, divided",
        "1 1/2 teaspoons butter",
        "2 zucchini, chopped",
        "1 yellow squash, chopped",
        "1 green bell pepper, diced",
        "salt and ground black pepper to taste",
        "1 1/2 teaspoons ground cumin",
        "1 teaspoon chili powder",
        "1 teaspoon paprika",
        "6 (10 inch) flour tortillas",
        "1/2 cup shredded Cheddar cheese (optional)",
        "1 dash hot sauce, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garbanzo Bean and Veggie Burritos",
    "url": "http://allrecipes.com/recipe/241095/garbanzo-bean-and-veggie-burritos/"
}
