{
    "directions": [
        "Combine tomatoes, onion, carrots, and garlic in a large pot. Drizzle olive oil over tomato mixture; cook and stir over medium heat. Cover pot and simmer, stirring occasionally, until vegetables are tender, about 25 minutes.",
        "Mix chicken broth, salt, sugar, dill, black pepper, celery salt, and cloves into tomato mixture. Cover pot and simmer, stirring occasionally, until soup flavors have blended, about 20 minutes.",
        "Whisk milk and cornstarch together in a bowl until dissolved.",
        "Heat butter in a saucepan over medium-low heat. Whisk cornstarch mixture into melted butter until smooth and thickened, 3 to 5 minutes.",
        "Slowly pour cornstarch mixture into tomato soup, stirring until incorporated.",
        "Pour half of the soup and basil leaves into a blender no more than half-full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree soup in batches until smooth. Return blended soup to pot and heat on low for 3 to 5 minutes. Spoon soup into serving bowls and top with Parmesan cheese and shredded basil."
    ],
    "ingredients": [
        "7 cups chopped fresh tomatoes (with seeds and juice)",
        "1 onion, finely chopped",
        "1 cup finely chopped carrots",
        "3 cloves garlic, crushed",
        "1 teaspoon extra-virgin olive oil, or more to taste",
        "2 cups chicken broth",
        "2 teaspoons salt, or to taste",
        "3/4 teaspoon white sugar",
        "3/4 teaspoon dried dill weed",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon celery salt",
        "1/4 teaspoon ground cloves",
        "1 cup skim milk",
        "1 tablespoon cornstarch",
        "1 1/2 teaspoons butter (optional)",
        "5 large fresh basil leaves, or more to taste",
        "1/4 cup grated Parmesan cheese, or to taste",
        "2 tablespoons shredded fresh basil, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garden-Fresh Tomato Soup",
    "url": "http://allrecipes.com/recipe/238176/garden-fresh-tomato-soup/"
}
