{
    "directions": [
        "Make the dough: Whisk a pinch of sugar into the warm water in a small bowl and sprinkle the yeast over the top {yeast feeds on sugar so this helps to wake it up and get it going}.",
        "Stir 3 cups/385 g of the flours and salt together in a large bowl or the bowl of a stand mixer to combine {reserving 1/4 cup/30 g flour for later}. Make a well in the center and pour in the yeast mixture. Stir with a fork or the dough hook to make a shaggy dough. If making the dough by hand, stir vigorously with a wooden spoon to work the gluten for about 5 minutes until the dough is smooth. Then turn onto a lightly floured countertop and knead until the dough is smooth and elastic, about 5 minutes, adding small sprinkles of flour as needed to just keep it from sticking. If you're using a stand mixer fitted with the dough hook, beat on high speed until the dough comes together and slaps the side of the bowl, about 5 minutes, adding up to 1/4 cup/30 grams more flour as needed to create a cohesive ball.",
        "Divide the dough half {for large pizzas} or quarters {for small pizzas} and form into balls. Place each ball of dough in a lightly oiled plastic bag, seal, and refrigerate overnight {it gets more supple as it sits overnight} or up to 3 days {or freeze for up to 1 week}.",
        "Remove the dough from the fridge 2 hours before you plan to cook. Oil two or four bowls {depending on whether you are making two large or four individual pizzas}. Turn each dough ball in the bowl to coat in oil; cover the bowl tightly with plastic wrap/cling film. Draw a circle around the top to mark where the dough is now, so you can watch it expand. Set aside in a warm place until doubled, about 2 hours.",
        "Position a pizza stone on the bottom rack of your oven. Preheat the oven to 475°F/240°C/gas 9 at least 45 minutes before you plan to bake the pizzas.",
        "Lightly dust a clean countertop and the dough with flour. Press and pat each ball of dough into a rectangle or round. Once you have the basic shape you want, stretch the dough by draping it over the back of your hands and wrists, letting it hang down so gravity does the work. For larger pizzas, aim for a 7-by-12-inch/17-by 30.5-cm rectangle or a 12-inch/30.5-cm round; for individual pizzas, aim for a 6-to-9-inch/15-to-23-cm round or rectangle for smaller pizzas and flatbreads, depending on how thick you like your dough. {Don't worry if it's misshapen.} Cover the dough with a towel until baking.",
        "Generously dust a pizza peel or baking sheet/tray with cornmeal and lay on the dough, shaking the peel or sheet/tray back and forth a little to make sure the dough slides easily.",
        "Chop or slice all the vegetables into small pieces that will cook quickly in the hot oven. Top the pizzas with any topping that needs to be cooked or melted, like cheese, sliced garlic, mushrooms, and small pieces of vegetables that need cooked through{the key is to use a light hand here, since overtopped pizzas tend to turn soggy}, dividing the toppings between all the dough.",
        "Slide the pizza onto the stone {or cook directly on the baking sheet} and bake larger pizzas one at a time, smaller ones two at a time, until puffed, crisp and evenly baked through, about 8 to 10 minutes.",
        "Remove and top with fresh and raw ingredients like shaved corn, sliced tomatoes, fresh basil, arugula/rocket, or sorrel. Shave or grate fresh Parmigiano-Reggiano over the top, drizzle with your best olive oil, and season with salt and black pepper."
    ],
    "ingredients": [
        "Generous pinch of sugar",
        "1 1/4 cups/300 ml warm water {about 110°F/45°C}",
        "One 1/4-oz/7-g package active dry yeast",
        "2 tbsp extra-virgin olive oil, plus more for drizzling",
        "2 cups/255 g bread/strong flour",
        "1 to 1 1/4 cups/175 to 200 g whole-wheat/wholemeal or white whole-wheat/wholemeal flour",
        "1 tsp fine sea salt",
        "Cornmeal or semolina flour",
        "4 to 6 oz/115 to 170 g cheese, such as shredded or fresh mozzarella, burrata, or fresh ricotta",
        "2 garlic cloves, very thinly sliced",
        "2 to 4 handfuls fresh veggies such as sliced tomatoes, arugula/rocket, sorrel, shaved zucchini/courgette, kale, Swiss chard, corn, or mushrooms",
        "Handful of fresh herbs, such as basil, opal basil",
        "Parmigiano-Reggiano cheese",
        "Extra-virgin olive oil",
        "Fine sea salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Herb",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Dinner",
        "Parmesan",
        "Basil",
        "Arugula",
        "Squash",
        "Zucchini",
        "Summer",
        "Party",
        "Advance Prep Required",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gardener's Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/gardeners-pizza-395569"
}
