{
    "directions": [
        "Preheat oven to 350 degrees F. Using a sharp knife, trim the top off of each head of garlic, keeping the bulb intact. Place each bulb in a square of Reynolds Wrap® Aluminum Foil. Drizzle each bulb with 1 tablespoon of olive oil, sprinkle with salt, pepper and about 1 teaspoon of thyme leaves. Wrap foil around bulbs and place on a baking sheet. Bake for 30-35 minutes or until garlic is very tender. Open foil carefully by cutting along top with a sharp knife, allowing steam to escape; then open top.",
        "In a large pot over medium heat, add 2 tablespoons of olive oil. Add chopped shallots and saute on medium-high heat for 5 minutes. Add potatoes, remaining thyme and bay leaf. Squeeze the soft roasted garlic cloves into the pot. Saute for 3 minutes over medium heat. Stir in broth and 1 cup cream. Bring to boil and then reduce heat and simmer, stirring occasionally for 30 minutes or until potatoes are very tender. Remove from heat; let stand 10 minutes to cool. Remove thyme and bay leaf.",
        "For the prosciutto, preheat the oven to 350 degrees F. Place slices flat on a foil-lined baking sheet. Bake for about 15 minutes, or until crispy. Remove from oven and let cool slightly. Break the prosciutto into small pieces and set aside. In a blender, puree soup in batches until smooth; return to pot. Stir in remaining cup of cream and bring to a simmer. Season to taste with salt and pepper.",
        "Ladle soup into bowls and garnish with crispy prosciutto, lemon zest, a drizzle of olive oil and a sprinkle of smoked paprika. Finish with a few leaves of parsley."
    ],
    "ingredients": [
        "4 heads garlic, whole",
        "6 tablespoons olive oil",
        "Sea salt to taste",
        "Freshly ground black pepper to taste",
        "3 sprigs fresh thyme",
        "3 large shallots, chopped",
        "3 large Yukon Gold potatoes, cubed",
        "1 bay leaf",
        "3 cups chicken broth",
        "2 cups heavy cream",
        "4 slices prosciutto di Parma",
        "Zest of 1 lemon",
        "Olive oil for drizzling",
        "1/4 teaspoon smoked paprika",
        "1/2 cup torn fresh parsley leaves",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garlic Soup with Crispy Prosciutto",
    "url": "http://allrecipes.com/recipe/245233/garlic-soup-with-crispy-prosciutto/"
}
