{
    "directions": [
        "Rinse chickens and pat dry inside and out with paper towels. Rub skin of chickens with 1/4 cup softened butter. Mix paprika, garlic powder, and black pepper in a small bowl and sprinkle chickens with about half the seasoning mix. Reserve remaining seasonings for later step.",
        "Make a small hole in the skin between the breast and leg of each chicken; use your finger to loosen breast skin and push 1 or 2 cloves of garlic beneath the breast skin. Place parsley, oregano, and thyme in the cavity of each chicken. Let the chickens marinate 1 hour, or up to overnight refrigerated.",
        "Preheat grill for low heat and lightly oil the grate.",
        "Place 2 garlic cloves into each partially full can of beer and remove herbs from chicken cavities; stuff the herbs into the beer cans. Spray each chicken with cooking spray and sit the chickens up on the beer cans, inserting cans into the cavities to hold chickens upright.",
        "Place a large section of aluminum foil on grill; stand chickens up on the foil. Baste chickens with 1/4 cup melted butter and sprinkle with remaining seasoning mix.",
        "Grill chickens until an instant-read meat thermometer inserted into a thigh of each bird reads 180 degrees F (80 degrees C), about 2 hours."
    ],
    "ingredients": [
        "2 (5 pound) whole chickens",
        "1/4 cup butter, softened",
        "2 tablespoons paprika",
        "2 tablespoons garlic powder",
        "ground black pepper to taste",
        "10 cloves garlic, peeled and lightly smashed - divided",
        "1/4 bunch fresh parsley",
        "1/4 bunch fresh oregano sprigs",
        "1/4 bunch fresh thyme sprigs",
        "2 (12 ounce) cans beer, each 2/3 full",
        "cooking spray",
        "1/4 cup butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garlic Herb Beer Butt Chicken",
    "url": "http://allrecipes.com/recipe/222938/garlic-herb-beer-butt-chicken/"
}
