{
    "directions": [
        "In a heavy skillet heat vegetable oil over moderate heat until hot but not smoking and cook bell pepper, mushrooms, scallions, and red pepper flakes, stirring, until vegetables are golden and cooked through, about 5 minutes. Toss vegetables with sesame oil and salt and pepper to taste.",
        "In a small bowl combine soy sauce, Sherry, brown sugar, garlic, gingerroot, and salt and pepper taste and stir until sugar is dissolved. Gently pound chicken between 2 sheets of plastic wrap until about 1/4 inch thick. In a large sealable plastic bag marinate chicken in soy sauce mixture, turning occasionally, 25 minutes.",
        "In a heavy skillet heat oil over moderate heat until hot but not smoking. Remove chicken from marinade, letting excess drip off and reserving marinade, and cook until browned and cooked through, 3 to 4 minutes on each side. Transfer chicken to plate and keep warm. Pour reserved marinade through a sieve into skillet and boil until reduced to about 2 tablespoons.",
        "Drizzle chicken with sauce and serve with sesame vegetables."
    ],
    "ingredients": [
        "1/4 cup soy sauce",
        "1/4 cup medium-dry Sherry",
        "2 tablespoons firmly packed brown sugar",
        "2 large garlic cloves, minced",
        "1 tablespoon grated peeled fresh gingerroot",
        "1 whole skinless boneless chicken breast (about 3/4 pound), halved",
        "1 tablespoon vegetable oil",
        "Accompaniment: sesame vegetables",
        "1 tablespoon vegetable oil",
        "1 medium red bell pepper, cut into thin strips",
        "1/4 pound white mushrooms, trimmed and quartered",
        "4 scallions, root ends and dark green parts discarded, cut crosswise into 1 1/2-inch pieces",
        "a pinch dried hot red pepper flakes, or to taste",
        "1 teaspoon Asian sesame oil, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Ginger",
        "Mushroom",
        "Marinate",
        "Sauté",
        "Quick & Easy",
        "Bell Pepper",
        "Sherry",
        "Gourmet"
    ],
    "title": "Garlic Soy Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-soy-chicken-11372"
}
