{
    "directions": [
        "Boil the chopped cauliflower in a large pot until it is tender enough to mash with the back of the spoon, about 10-15 minutes. Drain the cauliflower well then use a salad spinner or paper towels to blot excess water. Set aside.",
        "Reconstitute the arame sea vegetable in water for five minutes. Drain and set aside.",
        "In a blender or food processor, add the cauliflower, coconut milk, arame, mustard, red wine and balsamic vinegars, nutritional yeast, lemon juice, hot sauce, garlic, salt and pepper. Puree for 1 minute then drizzle in the olive oil as it purees until it comes together like dressing. Season to taste, adding more or less acidity with the lemon juice, or cheese flavor with the nutritional yeast.",
        "Croutons: Preheat oven to 375 degrees.",
        "Combine all crouton ingredients and place on baking sheet in a single layer.",
        "Roast beans for 20-25 minutes until the beans have split open. Cool before serving.",
        "Salad assembly: Wash and quarter lengthwise two heads of romaine lettuce, taking care to dry well with a paper towel. Brush cut sides with a little olive oil and place on a warm grill. Grill for about 5 minutes per side until outermost leaves are slightly wilted.",
        "Serve with a generous amount of Caesar dressing on top and finish with croutons. Serve extra lemon wedges on the side."
    ],
    "ingredients": [
        "1 1/2 cups cauliflower, cooked, finely chopped",
        "1 1/2 tablespoons arame sea vegetable, reconstituted",
        "1/2 cup So Delicious® Dairy Free Unsweetened Coconut Milk",
        "1 tablespoon Dijon mustard",
        "2 teaspoons red wine vinegar",
        "2 teaspoons balsamic vinegar",
        "1 tablespoon dry nutritional yeast",
        "3 tablespoons lemon juice",
        "4 dashes hot pepper sauce (such as Tabasco®)",
        "3 cloves garlic",
        "1 teaspoon salt",
        "1 teaspoon cracked black pepper",
        "1/2 cup olive oil",
        "2 heads romaine lettuce",
        "Cannellini Herb Croutons:",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1/4 cup finely chopped Italian parsley",
        "1 1/2 teaspoons fresh lemon juice",
        "4 1/2 teaspoons olive oil",
        "1 teaspoon garlic powder",
        "1 teaspoon nutritional yeast",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garlicky Grilled Caesar Salad with Cannellini Herb Croutons",
    "url": "http://allrecipes.com/recipe/240822/garlicky-grilled-caesar-salad-with-ca/"
}
