{
    "directions": [
        "Combine first 5 ingredients in glass baking dish. Add steak and turn to coat. Season generously with pepper. Cover and refrigerate steak overnight, turning occasionally.",
        "Heat oil in heavy large skillet over medium-high heat. Add onions and sauté 4 minutes. Add peppers and sauté until beginning to soften, about 8 minutes. Add marjoram and dried red pepper. Season to taste with salt and pepper and stir 2 minutes. Remove from heat.",
        "Bring steak to room temperature. Preheat broiler 5 minutes. Remove steak from marinade; pat dry. Transfer marinade to heavy small saucepan. Broil steak to desired degree of doneness, about 10 minutes per side for rare (meat thermometer will register 125°F. for rare). Transfer to platter. Let stand 10 minutes",
        "Meanwhile, reheat bell peppers and onions in skillet. Bring marinade to boil.",
        "Thinly slice steak across grain. Arrange on platter. Surround with Potato-Onion Cakes, peppers and onions. Serve, passing marinade separately."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "1/2 cup soy sauce",
        "1/4 cup balsamic vinegar or red wine vinegar",
        "8 large garlic cloves, minced",
        "4 teaspoons dried rosemary, crumbled",
        "1 2-inch-thick boneless top sirloin steak (about 3 1/2 pounds)",
        "1/3 cup olive oil",
        "2 large onions, cut into 1-inch pieces",
        "2 red bell peppers, cut into 1-inch pieces",
        "3/4 teaspoon dried marjoram, crumbled",
        "1/8 teaspoon dried crushed red pepper",
        "Potato-Onion Cakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Pepper",
        "Potato",
        "Broil",
        "Fry",
        "Fall"
    ],
    "title": "Garlic and Rosemary Steak with Potato-Onion Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-and-rosemary-steak-with-potato-onion-cakes-2542"
}
