{
    "directions": [
        "Preheat oven to 400°F with racks in upper and lower thirds. Lightly oil 2 large (17- by 13-inch) baking sheets.",
        "Stir together rosemary, thyme, 1/4 cup cheese, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a small bowl. Stir together oil, garlic, and 1/4 teaspoon each of salt and pepper in another bowl.",
        "Divide dough in half. Keeping half of dough covered with a kitchen towel (not terry cloth), gently roll out other half into a 15-by 10-inch rectangle on a lightly floured surface with a lightly floured rolling pin. (Use your hands to pull corners. If dough is very elastic, cover with towel and let rest about 3 minutes.)",
        "Sprinkle one half of dough (crosswise) with half of herb mixture, then fold dough in half crosswise and roll lightly to form a roughly 10- by 8-inch rectangle. Cut lengthwise into 9 strips (less than 1 inch wide) with a pizza wheel or a sharp heavy knife. Keeping remaining strips covered with a kitchen towel, twist each strip from both ends and place on baking sheet, arranging twists 1 inch apart. Brush with 1 tablespoon garlic oil and let stand while forming remaining bread twists.",
        "Roll out and form more bread twists with remaining dough and herb mixture, then arrange on other sheet. Brush with 1 tablespoon garlic oil and let stand 5 minutes.",
        "Bake bread twists, switching position of sheets halfway through, until golden, 20 to 25 minutes total.",
        "Meanwhile, stir together parsley and remaining 3/4 cup cheese in a shallow baking pan.",
        "Immediately after baking, brush bread twists with remaining garlic oil, then roll in parsley and cheese until coated. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 tablespoon finely chopped rosemary",
        "1 tablespoon finely chopped thyme",
        "1 cup grated Parmigiano-Reggiano (2 oz), divided",
        "1/4 cup olive oil",
        "3 garlic cloves, minced",
        "2 pounds pizza dough or use store-bought)",
        "1/4 cup finely chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Garlic",
        "Bake",
        "Kid-Friendly",
        "Lunch",
        "Parmesan",
        "Rosemary",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Garlic Herb Bread Twists",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-herb-bread-twists-354216"
}
