{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Bake the garlic in a small baking dish for 1 hour, or until soft and fragrant. Cut the garlic heads in half crosswise, squeeze out all of the pulp, and reserve. You should have 1 cup of roasted garlic.",
        "Puree the garlic pulp in a blender until smooth, and add the butter and herbs. Process just until smooth, then stir in the breadcrumbs and walnuts. Reserve.",
        "Bring a small pot of water to a rolling boil and add a pinch of salt. Blanch the leek rings about one minute. They should be tender, but still have some bite. Shock in an ice water bath, drain and reserve.",
        "Swirl a small amount of olive oil in a heavy bottomed pan and arrange the Brussels sprouts in the pan cut side down. Cook over medium high heat until the Brussels sprouts are caramelized. Season with salt and pepper, and cook until just tender.",
        "Add the leek rings and set aside. It is ideal that the Brussels sprouts hold their shape.",
        "In another pan, warm 1 tablespoon unsalted butter, add the shallots and cook until soft, add the spinach and cook just until wilted. Season with salt and pepper and reserve.",
        "In a heavy bottomed oven-proof pan swirl just enough olive oil to coat the bottom of the pan. Place the chicken breasts in the pan, skin side down and cook until the skin is golden brown.",
        "Place the pan in the oven and bake for approximately 10 minutes, or until the juices run clear when pricked with the tip of a knife. There is no need to turn the chicken over, cook the breasts with the skin side down the whole time.",
        "When the chicken is fully cooked, remove from the oven to a sheet pan, skin side up. Coat each breast with the garlic-butter walnut crust and place under the broiler until the coating turns golden brown and crisp. Remove from the broiler and keep warm.",
        "To serve: Distribute the spinach evenly among the plates, placing it in the center. Sprinkle the leek rings and Brussels sprouts around the outside of the spinach, and then sprinkle the pomegranate seeds over the top. Place one breast on top of the spinach and serve immediately."
    ],
    "ingredients": [
        "6 heads garlic",
        "1 cup toasted California walnuts, lightly crushed",
        "1/2 cup Japanese (panko) breadcrumbs",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh thyme",
        "1/2 cup unsalted butter, softened",
        "1 tablespoon unsalted butter",
        "1 shallot, thinly sliced",
        "1 pound fresh spinach",
        "1/2 pound fresh Brussels sprouts, split in half lengthwise",
        "2 leeks, white parts only, sliced into thin rings",
        "6 whole chicken breasts with skin",
        "2 tablespoons olive oil, or as needed",
        "1 pomegranate, seeds only (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garlic and Walnut Crusted Chicken",
    "url": "http://allrecipes.com/recipe/230584/garlic-and-walnut-crusted-chicken/"
}
