{
    "directions": [
        "Preheat oven to 400°F. Peel outer papery skin from garlic head. Cut off top 1/3 inch to expose garlic cloves. Place garlic head, cut side up, in small ramekin. Drizzle 1 1/2 tablespoons oil over. Wrap ramekin in double thickness of foil. Place in oven; roast garlic 30 minutes. Open top of foil, exposing garlic. Continue to roast garlic until golden, about 20 minutes. Remove from oven; cool.",
        "Cut out mushroom stems; chop stems finely. Melt butter with 1 teaspoon oil in heavy medium skillet over medium-high heat. Add chopped stems; sauté until beginning to release juices, about 3 minutes. Add breadcrumbs; stir until crumbs are toasted, about 5 minutes. Remove skillet from heat. Mix in parsley and chopped rosemary.",
        "Separate roasted garlic into cloves and peel; reserve oil. Using fork, finely mash enough garlic in bowl to measure 1 1/2 tablespoons. Mix in reserved oil. Stir garlic mixture into chopped mushroom mixture. Season with salt and pepper.",
        "Line large baking sheet with foil. Spray with oil spray. Brush mushroom caps with 1 1/2 tablespoons oil. Place rounded side down on prepared sheet. Lightly salt mushrooms. Spoon filling into mushrooms, mounding in center.(Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 375°F. Bake mushrooms uncovered until tender, about 20 minutes. Arrange on platter. Garnish with rosemary sprigs, if desired."
    ],
    "ingredients": [
        "1 whole medium head garlic",
        "3 tablespoons plus 1 teaspoon olive oil",
        "16 2-inch-diameter mushrooms",
        "1 teaspoon butter",
        "3/4 cup fine fresh sourdough breadcrumbs",
        "1 tablespoon chopped fresh parsley",
        "1 1/2 teaspoons chopped fresh rosemary",
        "Nonstick vegetable oil spray",
        "Fresh rosemary sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Rosemary",
        "Winter"
    ],
    "title": "Garlic and Rosemary Stuffed Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-and-rosemary-stuffed-mushrooms-515"
}
