{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Pat shanks dry and rub all over with salt and pepper. Dredge shanks in flour, turning to coat. Heat 1 1/2 tablespoons oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then brown shanks on all sides in 3 batches, adding 1/2 tablespoon oil if necessary, 5 to 6 minutes per batch.",
        "Transfer shanks to a large roasting pan. Add broth and water to skillet and bring to a boil, scraping up brown bits. Nestle garlic (cut sides down), zest, thyme, and bay leaves with celery and carrots around shanks in pan and add broth mixture. Cover surface with a sheet of parchment paper and tightly cover pan with foil. Transfer to oven and braise until meat is very tender, 2 1/2 to 3 hours. Skim off and discard fat from cooking liquid and cool mixture completely, uncovered, about 1 hour, then chill, covered, at least 6 hours.",
        "Preheat oven to 350°F (leave rack in middle position).",
        "Skim off and discard any remaining fat from surface of pan juices and reheat shank mixture, covered, in oven, turning shanks over once, 1 hour. Discard bay leaf, thyme sprigs, and zest. Transfer shanks and vegetables with garlic to a serving dish and keep warm, covered. If pan juices measure more than 3 cups, boil in a cleaned 12-inch skillet until reduced; if less, add water. Squeeze garlic pulp from 1 head into pan juices, discarding skin, and whisk to incorporate, then add lemon juice and salt and pepper to taste. Pour sauce over shanks and serve, along with vegetables and remaining garlic heads."
    ],
    "ingredients": [
        "6 (1 1/2-inch-thick) beef shanks (6 pounds)",
        "1 tablespoon salt",
        "1 teaspoon black pepper",
        "2/3 cup all-purpose flour",
        "1 1/2 to 2 tablespoons extra-virgin olive oil",
        "1 3/4 cups reduced-sodium beef broth (14 fluid ounces)",
        "2 cups water",
        "4 large heads of garlic, 1/4 inch of root end cut off and discarded to expose cloves",
        "2 (4-inch-long) strips fresh lemon zest",
        "8 fresh thyme sprigs",
        "2 Turkish bay leaves or 1 California",
        "3 celery ribs, cut diagonally into 1-inch pieces",
        "3 large carrots, cut diagonally into 1-inch pieces",
        "1 tablespoon fresh lemon juice, or to taste",
        "Special equipment: parchment paper",
        "Garnish: celery leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Vegetable",
        "Braise",
        "Dinner",
        "Meat",
        "Beef Shank",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Garlic-Braised Beef Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-braised-beef-shanks-237586"
}
