{
    "directions": [
        "Heat 2 Tbsp. oil and 2 Tbsp. butter in a large saucepan over medium. Add garlic, white and pale green parts of leek, and thyme and cook, stirring often, until garlic is softened, about 5 minutes (reduce heat if garlic starts to brown). Add potatoes and 4 cups broth, bring to a simmer, and cook until potatoes are very tender, 25–30 minutes. Let cool slightly, then add crème fraîche.",
        "Transfer soup to a blender (or use an immersion blender directly in saucepan) and blend until very smooth; season with salt and pepper. Transfer soup back to saucepan and set aside.",
        "Pour water into another large saucepan to come 4\" up sides and bring to a boil, then reduce heat so water is at a gentle simmer. Crack an egg into a small bowl, then gently slide egg into water. Repeat with remaining eggs, waiting until whites are opaque before adding the next one (about 30 seconds apart). Poach until whites are set but yolks are still runny, about 3 minutes. Using a slotted spoon, transfer eggs to paper towels as they are done; season with salt and pepper.",
        "Heat remaining 2 Tbsp. butter in a medium saucepan over medium. Add reserved dark green parts of leek and 2 Tbsp. water and cook, stirring often, until leeks are softened and very bright green, about 2 minutes. Transfer leek mixture to a platter and top with parsley leaves and lemon zest.",
        "Gently reheat reserved soup over medium-low, thinning with more broth if needed; divide among bowls. Carefully place a poached egg and some leek mixture in the center of each bowl of soup and drizzle with oil.",
        "Soup (without eggs and toppings) can be made 2 days ahead; cover and chill. Eggs can be poached 1 day ahead; place in a bowl of ice water, cover, and chill. Reheat gently in simmering water 1 minute just before serving with soup."
    ],
    "ingredients": [
        "2 tablespoons olive oil, plus more for serving",
        "4 tablespoons salted butter, divided",
        "3 heads of garlic, cloves peeled",
        "1 large leek, halved lengthwise, very thinly sliced, dark green parts reserved separately",
        "1 tablespoon thyme leaves",
        "1 1/2 pounds Yukon Gold potatoes (about 2 large), peeled, cut into 1-inch pieces",
        "4 cups (or more) low-sodium chicken broth",
        "2 tablespoons crème fraîche or sour cream, room temperature",
        "Kosher salt",
        "Freshly ground white or black pepper",
        "4 large eggs, room temperature",
        "2 tablespoons parsley leaves with tender stems",
        "Finely grated lemon zest (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Egg",
        "Potato",
        "Leek",
        "Wheat/Gluten-Free"
    ],
    "title": "Garlic Soup With Potatoes and Poached Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-soup-with-potatoes-and-poached-eggs"
}
