{
    "directions": [
        "Pull off turkey skin and freeze in a small resealable plastic bag. (You can use the skin to make cracklings for our Shredded Kale Salad with Turkey Skin Cracklings. )",
        "Cut out the thigh bone from each thigh and save in another resealable plastic bag in the freezer for a future stock.",
        "Mash garlic to a paste with 2 teaspoons salt in a mortar and pestle or mince and mash to a paste with a heavy knife.",
        "Whisk together the paste with the chili powder, cumin, and olive oil and spread it all over the thighs in a baking dish. Cover the dish and marinate the thighs, chilled, at least 2 hours.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high for gas); see Grilling Procedure, below.",
        "Oil grill rack, then grill thighs (cover only if using a gas grill), turning once or twice, until thermometer registers 170°F, 15 to 25 minutes. Transfer to a platter and let stand 5 to 10 minutes before slicing.",
        "Charcoal Grilling Instructions:\nOpen vents on bottom of grill. Light a large chimney starter full of charcoal (preferably hardwood).",
        "For Direct-Heat Instructions:\nWhen coals are lit, dump them out across bottom rack, leaving a space free of coals on one side of grill equal to the size of the food to be grilled where food can be moved in case of any flare-ups.",
        "When charcoal turns grayish white (start checking coals after 15 minutes), the grill will be at its hottest and will then begin to cool off. It will be at the proper medium-hot temperature when you can hold your hand 5 inches above the grill rack (directly over the coals) for 3 to 4 seconds.",
        "Gas Grill Instructions:\nPreheat all burners on high, covered, 10 minutes, then adjust heat according to recipe."
    ],
    "ingredients": [
        "2 1/2 to 3 pounds turkey thighs with skin and bones",
        "4 large garlic cloves",
        "Salt",
        "1 tablespoon chili powder",
        "1 teaspoon ground cumin",
        "3 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Poultry",
        "turkey",
        "Thanksgiving",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Gourmet",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Garlic-Chile Grilled Turkey Thighs",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-chile-grilled-turkey-thighs-369380"
}
