{
    "directions": [
        "Halve 1 lemon and add halves to a large bowl of cold water, squeezing to release juice.",
        "Cut off top inch of 1 artichoke with a serrated knife and bend back outer leaves until they snap off close to base (keep stem attached). Discard several more layers in same manner until you reach pale yellow leaves.",
        "Cut remaining leaves flush with top of artichoke bottom with serrated knife. Trim dark green fibrous parts from base and side of artichoke with a paring knife.",
        "Trim end of stem to expose core, then peel side of stem down to pale inner core. Put in lemon water while preparing remaining artichokes.",
        "Remove 3 (3- by 1-inch) strips of zest from remaining lemon with a vegetable peeler and squeeze enough juice to measure 1 tablespoon. Bring water (1 cup), oil, zest, and lemon juice to a simmer in a 3- to 5-quart pot wide enough to fit artichoke hearts in 1 layer. Stand artichokes in pot and season with 1 teaspoon salt and 1/4 teaspoon black pepper. Cover artichokes with a round of parchment paper, then a lid, and simmer over medium-low heat until just tender when pierced with a knife, 20 to 30 minutes.",
        "Transfer artichokes to a dish and reserve braising liquid. When artichokes are cool enough to handle, halve lengthwise. Scoop out and discard inner chokes (fuzzy center and any sharp leaves). Cut each half into 2 pieces.",
        "Preheat oven to 450°F with rack in upper third. Butter a 2 1/2 to 3-quart shallow baking dish.",
        "Heat 3 tablespoons oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then cook anchovies and half of garlic, stirring and mashing anchovies into oil with a wooden spoon, until garlic is golden, about 30 seconds. Add artichokes and gently stir until coated. Spoon mixture into baking dish and drizzle with 1/2 cup braising liquid and lemon juice.",
        "Heat remaining 2 tablespoons oil in same skillet over medium heat and cook remaining garlic, stirring, until pale golden, about 30 seconds. Stir in breadcrumbs and salt and pepper to taste and remove from heat. Stir in cheese and parsley. Sprinkle crumb mixture over top of artichokes and drizzle with a little more oil. Bake until topping is golden, 8 to 10 minutes."
    ],
    "ingredients": [
        "2 lemons",
        "8 medium artichokes",
        "1 cup water",
        "1/4 cup extra-virgin olive oil",
        "Salt and freshly ground black pepper",
        "5 tablespoons extra-virgin olive oil, divided, plus more for drizzling",
        "4 to 5 flat anchovy fillets packed in oil, drained",
        "6 garlic cloves, finely chopped, divided",
        "2 tablespoons fresh lemon juice",
        "1 cup coarse fresh breadcrumbs (from an Italian loaf or a baguette)",
        "2 tablespoons grated Parmigiano-Reggiano",
        "2 tablespoons chopped fresh parsley",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Easter",
        "Artichoke",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Garlic Anchovy Artichoke Hearts",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-anchovy-artichoke-hearts-51233430"
}
