{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Prepare a large skillet with cooking spray and place over medium heat. Cook chicken in skillet until no longer pink in the center, 5 to 7 minutes; season with 1 tablespoon garlic powder and transfer to a baking dish.",
        "Bring a large pot of lightly salted water to a boil. Cook macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain and mix with chicken in the baking dish.",
        "Melt 1/4 cup butter in a large pot over medium heat. Cook flour in melted butter until the flour is cooked and the mixture forms a roux, about 5 minutes. Stream milk into the pot while stirring to mix with the roux completely; cook until just about simmering, about 5 minutes more. Add Cheddar cheese in small amounts to the sauce and stir to melt completely before adding the next portion; cook and stir until thick and smooth, 2 to 3 minutes. Pour the sauce over the chicken and macaroni; stir to coat.",
        "Melt 1/4 cup butter in the skillet in which you cooked the chicken over medium heat. Stir remaining tablespoon garlic powder into the melted butter; cook until fragrant, 1 to 2 minutes. Remove skillet from heat and stir crushed crackers into the butter mixture to coat; spread over the chicken and macaroni mixture in the baking dish.",
        "Bake in preheated oven until the topping is crispy, 35 to 45 minutes."
    ],
    "ingredients": [
        "cooking spray",
        "4 skinless, boneless chicken breast halves, cut into cubes",
        "2 tablespoons garlic powder, or to taste, divided",
        "1 (16 ounce) package macaroni",
        "1/2 cup butter, divided",
        "1/4 cup all-purpose flour",
        "4 cups whole milk",
        "1 pound Cheddar cheese, shredded",
        "2 sleeves buttery round crackers (such as Ritz®), crushed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Garlic Chicken Mac and Cheese",
    "url": "http://allrecipes.com/recipe/240624/garlic-chicken-mac-and-cheese/"
}
