{
    "directions": [
        "Position an oven rack just below the center of the oven. Preheat the oven to 400 degrees F.",
        "For the butter: In a small bowl, combine the butter, rosemary, thyme, lemon juice, salt, pepper and garlic until smooth.",
        "For the chicken: Tuck the wings under the chicken. Sprinkle the cavity of the chicken with salt and pepper. Spoon 2 tablespoons of the butter mixture into the cavity. Place the rosemary, thyme and lemon quarters in the cavity. Tie the legs together loosely with kitchen string. Place the chicken in a large roasting pan.",
        "Starting at the neck end of the chicken, loosen the skin over the entire chicken breast. Smear the remaining butter mixture over the outside and under the skin of the chicken, being careful not to tear the skin.",
        "For the vegetables: In a large bowl, toss together the oil, rosemary, thyme, salt, pepper, potatoes, carrots, parsnips, shallots and garlic.",
        "Arrange the vegetables around the chicken in a single layer. Add the broth and roast until the vegetables are tender and an instant-read thermometer inserted into the thickest part of the chicken thigh registers 160 to 165 degrees F, about 1 1/2 hours. Let the chicken rest for 20 minutes.",
        "Transfer the chicken to a platter. Arrange the vegetables around the chicken. Scrape the contents of the roaster into a 4-cup measuring cup. Spoon off the layer of fat that rises to the top. Season the pan juices with salt and pepper, if needed. Serve the chicken with the pan juices."
    ],
    "ingredients": [
        "Butter:",
        "6 tablespoons (3/4 stick) unsalted butter, at room temperature",
        "2 teaspoons chopped fresh rosemary",
        "2 teaspoons chopped fresh thyme",
        "1/2 teaspoon fresh lemon juice (from 1/2 large lemon)",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 large cloves garlic, minced",
        "Chicken:",
        "One 6 1/4-pound chicken, rinsed and patted dry",
        "Kosher salt and freshly ground black pepper",
        "1 teaspoon kosher salt, plus more for seasoning",
        "1/2 teaspoon freshly ground black pepper, plus more for seasoning",
        "6 baby red potatoes, halved",
        "4 medium carrots, peeled and halved lengthwise",
        "2 large parsnips, peeled and quartered lengthwise",
        "2 large shallots (about 8 ounces), peeled and halved",
        "1 clove garlic, peeled",
        "1/2 cup low-salt chicken broth",
        "5 sprigs fresh rosemary",
        "5 sprigs fresh thyme",
        "1 lemon, quartered",
        "Vegetables:",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roasted Chicken",
        "Chicken",
        "Poultry Recipes",
        "Roasting",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Garlic-Roasted Chicken and Root Vegetables",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/garlic-roasted-chicken-and-root-vegetables-recipe"
}
