{
    "directions": [
        "Prepare a grill for medium-high heat with both direct and indirect heat zones, preferably with hardwood or hardwood charcoal. Separate leaves from 5 rosemary sprigs, then coarsely chop leaves. Tie remaining sprigs together with kitchen twine to form a brush. Combine garlic and oil in a measuring cup.",
        "Place chicken breast side down on work surface. Spatchcock chicken by cutting along both sides of backbone with kitchen shears; reserve backbone for stock. Turn chicken over, breast side up, and splay open. Press down on breastbone with palms until you hear it crack and chicken is as flat as possible. Tuck the wings behind the breasts, then tuck in the legs so the bottoms of the drumsticks are pointed away from the body and chicken is as flat as possible.",
        "Brush all sides of both pieces of chicken with the garlic-oil using rosemary brush. Sprinkle all sides with chopped rosemary leaves, salt, and pepper.",
        "Grill both pieces of chicken, skin side down, over direct heat, until skin is golden brown, crispy, and lightly charred, about 5 minutes. Flip both pieces of chicken over, transfer to indirect heat, and baste with rosemary brush dipped in garlic-oil.",
        "Continue to grill chicken, basting occasionally, until skin is golden brown, juices run clear, and an instant-read thermometer inserted into the thickest part of the meat registers 165°F, 45–60 minutes for whole chicken and 25–35 minutes for chicken breast. Let chicken stand at least 10 minutes before carving. Arrange chicken on a serving platter and serve with chimichurri sauce alongside."
    ],
    "ingredients": [
        "1 bunch rosemary",
        "3 garlic cloves, smashed",
        "1/4 cup olive oil",
        "1 (3 1/2-pound) whole chicken",
        "1 (1 1/2-pound) skin-on, bone-in whole chicken breast",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "Chimichurri Sauce (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Kid-Friendly",
        "Rosemary",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Healthy"
    ],
    "title": "Garlic and Herb Spatchcock Grilled Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/garlic-and-herb-spatchcock-grilled-chicken-56389623"
}
