{
    "directions": [
        "As soon as you get the chicken home, salt it inside and out, wrap it and keep it in the refrigerator for up to 2 days.",
        "When you are ready to cook the chicken, first preheat the oven to 425 degrees F.",
        "Pat the outside of the chicken dry with paper towels. Liberally salt and pepper the inside of the chicken and stuff the cavity with the all the garlic and lemon. Tie the legs together with kitchen string and tuck the wing tips under the body of the chicken. Place it in a roasting pan just large enough to hold it and the vegetables. Scatter the onion slices, carrots and potatoes around the chicken. Brush the outside of the chicken with the butter and sprinkle with salt and pepper.",
        "Roast the chicken for 1 1/2 hours, or until the juices run clear when you cut between a leg and thigh. Remove the chicken to a platter and cover with aluminum foil. Place the vegetables back in the oven and continue cooking for an additional 15 minutes.",
        "When the vegetables are cooked, carve the chicken and place the slices on the platter surrounded by the vegetables. Drizzle some pan juices over the chicken and vegetables."
    ],
    "ingredients": [
        "1 (5 to 6-pound) roasting chicken",
        "Kosher salt and freshly ground black pepper",
        "2 heads garlic, cut in 1/2 crosswise",
        "1 lemon, halved",
        "1/2 large Spanish onion, thickly sliced",
        "4 carrots cut diagonally into 2-inch chunks",
        "2 large Yukon gold potatoes, cut into 6 pieces",
        "4 tablespoons butter, melted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roasted Chicken",
        "Chicken",
        "Poultry Recipes",
        "Roasting",
        "Roasted Vegetable",
        "Vegetable",
        "Roast Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Garlic Roast Chicken",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/garlic-roast-chicken-recipe"
}
