{
    "directions": [
        "Combine brown raisins, golden raisins, and brandy in small bowl; toss to blend. Let soak at least 30 minutes and up to 1 hour.",
        "Cook yams in large pot of boiling salted water until just barely tender, about 8 minutes. Using large slotted spoon, transfer yams to baking sheet to cool.",
        "Meanwhile, bring 3/4 cup maple syrup, 1/2 cup brown sugar, and 1/4 cup unsalted butter to boil in heavy medium saucepan over medium heat, stirring until brown sugar dissolves. Boil 2 minutes.",
        "Butter 15x10x2-inch glass baking dish. Drain raisins (reserve brandy for another use). Place raisins in very large bowl. Add cooked yams, then maple syrup mixture and toasted walnut pieces. Toss gently to coat evenly, being careful to keep yams intact. Transfer yam mixture to prepared baking dish. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 350°F. Bake yams uncovered until syrup is thick and bubbling, basting occasionally, about 55 minutes. Let stand 10 minutes and serve."
    ],
    "ingredients": [
        "1/2 cup brown raisins",
        "1/2 cup golden raisins",
        "1/4 cup brandy",
        "5 pounds garnet yams or other yams (red-skinned sweet potatoes), peeled, cut into 3/4-inch cubes",
        "3/4 cup pure maple syrup",
        "1/2 cup (packed) golden brown sugar",
        "1/4 cup (1/2 stick) unsalted butter",
        "1 1/2 cups walnut pieces, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Raisin",
        "Walnut",
        "Brandy",
        "Sweet Potato/Yam",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Maple Syrup",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Garnet Yams with Maple Syrup, Walnuts, and Brandied Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/garnet-yams-with-maple-syrup-walnuts-and-brandied-raisins-355801"
}
