{
    "directions": [
        "Butter 13x9x2-inch glass baking dish. Peel yams; cut 1 inch off ends. Coarsely grate enough of yam ends to measure 1/2 cup; set aside for streusel. Discard remaining ends. Cut remaining whole yams into 1/3-inch-thick rounds. Arrange yam rounds in 4 overlapping lengthwise rows in prepared baking dish.",
        "Bring 1/2 cup water, maple syrup, butter, and cider vinegar to boil in small saucepan. Stir in 1 teaspoon coarse salt and 3/4 teaspoon pepper. Pour maple syrup mixture over yams. Cover baking dish tightly with foil.",
        "Mix first 4 ingredients in small bowl. Add melted butter and rub in with fingertips until moist clumps form. Mix in reserved 1/2 cup grated yams. DO AHEAD: Yams and streusel can be made 6 hours ahead. Cover separately and refrigerate. Let yams stand at room temperature 1 hour before baking.",
        "Preheat oven to 375°F. Bake yams covered until almost tender, about 40 minutes. Increase oven temperature to 400°F. Sprinkle streusel over and bake uncovered until yams are very tender and streusel is golden and slightly crisp, about 35 minutes longer. Serve warm.",
        "Available at some supermarkets and at specialty foods stores and natural foods stores."
    ],
    "ingredients": [
        "3 1/2 pounds slender garnet yams or other yams (red-skinned sweet potatoes; about 2 1/2 inches in diameter)",
        "1/4 cup Blis maple syrup or other pure maple syrup",
        "1/4 cup (1/2 stick) unsalted butter",
        "1 tablespoon apple cider vinegar",
        "1 teaspoon coarse kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "1 cup all purpose flour",
        "1/2 cup maple sugar* (scant 3 ounces)",
        "1/3 cup (packed) golden brown sugar",
        "3/4 teaspoon ground cinnamon",
        "6 tablespoons (3/4 stick) unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Casserole/Gratin",
        "Sweet Potato/Yam",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Maple Syrup",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Garnet Yams with Blis Maple Syrup and Maple-Sugar Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/garnet-yams-with-blis-maple-syrup-and-maple-sugar-streusel-350428"
}
