{
    "directions": [
        "Score a cross in the base of each tomato. Cover with boiling water for 1 minute, plunge into cold water, drain and peel away the skin. Chop the flesh so finely that it is almost a puree.",
        "Mix together the tomatoes, 1 of the chopped cucumbers, 1 of the chopped green pepper, garlic, olives, vinegar, oil and tomato paste, and season to taste. Cover and refrigerate for 2 to 3 hours.",
        "Use 2 to 3 cups of chilled water to thin the soup to your taste. Serve chilled with the chopped onion, green pepper, scallions, cucumber, boiled egg, herbs and croutons served separately for diners to add to their own bowls.",
        "To Make Garlic Herb Croutons: Preheat the oven to 350 degrees F (175 degrees C).  Cut two 1/2  thick slices from a loaf of bread (your choice). Remove the crusts and cut each bread slice into 16 cubes.  In a bowl, mix together 3 tablespoons olive oil, 2 crushed cloves garlic, 1 tablespoon chopped fresh oregano, 2  tablespoons chopped fresh thyme, 1tablespoon chopped fresh rosemary and a pinch of chili flakes. Add the bread cubes to the herbed oil and toss until all the oil has been absorbed.  Lay the bread cubes in a single layer on a baking tray and bake in the oven for 10 to 12 minutes, or until the croutons are golden brown. Turn once during baking."
    ],
    "ingredients": [
        "1 3/4 pounds ripe tomatoes",
        "1 large cucumber, chopped",
        "1 green bell pepper, chopped",
        "2 cloves crushed garlic",
        "1 tablespoon finely chopped black olives",
        "1/3 cup white wine vinegar",
        "1/4 cup olive oil",
        "1 tablespoon tomato paste",
        "2 1/2 cups water",
        "1 small onion, chopped",
        "1 green bell peppers, diced",
        "2 green onions, thinly sliced",
        "1 large cucumber, chopped",
        "2 hard-cooked eggs, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gazpacho I",
    "url": "http://allrecipes.com/recipe/13110/gazpacho-i/"
}
