{
    "directions": [
        "Heat 3 tablespoons vegetable oil in a small skillet over medium heat. Toast dried red chiles in the hot oil until they turn dark red, about 2 minutes. Toss black pepper, 2 chopped green onions, light sesame oil, and 1 small chopped shallot into the hot oil; remove from heat.",
        "Blend cranberry sauce, turkey broth, soy sauce, orange juice, white vinegar, plum wine, ginger, garlic, and orange zest in a blender until smooth. Transfer to a bowl. Stir toasted red pepper mixture into glaze. Divide glaze in half.",
        "Place turkey into a large basting bag and pour half the glaze over the turkey and into the cavity. Seal the bag and refrigerate turkey overnight.",
        "Dissolve cornstarch in the remaining half of the glaze and refrigerate in a covered container.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Remove turkey from marinade; discard the used marinade. Set turkey onto a rack inside a roasting pan.",
        "Mix white rice, wild rice, dried cranberries, walnuts, 2 small chopped green onions, 1 chopped shallot, and 1 tablespoon sesame oil in a bowl. Lightly stuff the turkey cavity with the rice mixture. Combine 1/3 cup vegetable oil with 1/3 cup sesame oil in a bowl and set aside.",
        "Roast turkey in the preheated oven, basting with vegetable and sesame oil mixture every 15 minutes, until skin is browned and crisp, about 2 hours. Stir reserved glaze containing cornstarch thoroughly and baste turkey every 15 minutes until glaze has baked onto turkey and an instant-read meat thermometer inserted into the thickest part of a thigh reads 165 degrees F (75 degrees C), 1 1/2 to 2 more hours."
    ],
    "ingredients": [
        "Marinade/Glaze:",
        "3 tablespoons vegetable oil",
        "3 small dried red chiles, or more to taste",
        "1 teaspoon ground black pepper",
        "2 green onions, chopped",
        "1/4 cup light sesame oil",
        "1 small shallot, chopped",
        "1/2 (16 ounce) can whole berry cranberry sauce",
        "1 cup turkey broth",
        "1/2 cup soy sauce",
        "1/4 cup orange juice",
        "1/4 cup white vinegar",
        "1/4 cup plum wine",
        "1/4 cup white sugar",
        "2 tablespoons chopped fresh ginger root",
        "2 tablespoons chopped garlic",
        "2 teaspoons grated orange zest",
        "1 (12 pound) whole turkey, neck and giblets removed",
        "3 tablespoons cornstarch",
        "Dressing:",
        "2 cups cooked white rice",
        "1/2 cup cooked wild rice",
        "1/3 cup dried cranberries",
        "1/4 cup chopped walnuts",
        "2 small green onions, chopped",
        "1 small shallot, chopped",
        "1 tablespoon sesame oil",
        "Basting Oil:",
        "1/3 cup vegetable oil",
        "1/3 cup sesame oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "General Tso's Whole Turkey",
    "url": "http://allrecipes.com/recipe/230120/general-tsos-whole-turkey/"
}
