{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 14x16-inch or larger baking sheet.",
        "Spread walnuts out onto a baking sheet in a single layer and bake in the preheated oven until walnuts smell toasted and are lightly browned, about 10 minutes. Let cool; process nuts into tiny chunks in a food processor, pulsing several times to avoid turning them into nut butter.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add raisins to the steamer, cover, and steam until plump and moist, 10 to 15 minutes.",
        "Combine walnuts, raisins, 1/2 cup white sugar, and cinnamon in a bowl.",
        "Place 1 pie crust in the center of the prepared baking sheet. Cover with 1/3 of the raisin mixture, spreading it into a layer about 1/2-inch thick and leaving a 1-inch margin at the edge of the crust. Dot filling with 1 tablespoon butter chunks. Place 2nd crust over filling and spread 1/3 of the raisin filling as before; dot with 1 tablespoon butter. Repeat with 3rd crust and remaining 1/3 of raisin filling and remaining 1 tablespoon butter chunks. Place final crust on top and press edges together to make a dome with the filling sealed inside the crusts. Use your fingers to crimp the edges into a fluted shape.",
        "Whisk egg with milk in a small bowl and brush the top of the pie with the mixture. Cut 5 2-inch-long slits into the top crust in a star pattern.",
        "Bake in the preheated oven until golden brown, 50 to 60 minutes.",
        "Combine 1/2 cup white sugar, brown sugar, and white grape juice in a small saucepan. Bring to a boil until mixture thickens into a syrup, 7 to 10 minutes. Drizzle syrup over the hot torte to make a glaze. Cool slightly before cutting into 16 slices for serving."
    ],
    "ingredients": [
        "2 cups walnuts",
        "2 cups golden raisins",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "2 (15 ounce) packages pastry for 9-inch double crust pie",
        "3 tablespoons butter, cut into small chunks - divided",
        "1 egg",
        "2 teaspoons milk",
        "1/2 cup white sugar",
        "1/2 cup brown sugar",
        "1/2 cup white grape juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Georgian Golden Raisin Walnut Torte",
    "url": "http://allrecipes.com/recipe/231039/georgian-golden-raisin-walnut-torte/"
}
