{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9 inch) round pans. Sift together the flour, baking powder, baking soda and salt. Set aside. In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.",
        "In a large bowl, cream together the shortening and sugar until light and fluffy. Beat in the eggs one at a time, then beat in melted chocolate. Beat in the flour mixture alternately with the water and buttermilk, mixing just until incorporated. Finely chop cherries and fold in. Pour batter into prepared pan.",
        "Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely. Fill and frost with chocolate cherry frosting.",
        "For the frosting:  In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, combine butter, confectioners' sugar, melted chocolate and almond extract. Cream with an electric mixer. Add reserved cherry juice by the tablespoon until frosting reaches desired consistency."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "4 (1 ounce) squares unsweetened chocolate, chopped",
        "1/2 cup shortening",
        "2 cups white sugar",
        "2 eggs",
        "3/4 cup water",
        "3/4 cup buttermilk",
        "1/2 cup maraschino cherries, drained and juice reserved",
        "1 (1 ounce) square unsweetened chocolate, chopped",
        "1/2 cup butter",
        "4 cups confectioners' sugar",
        "1/4 teaspoon almond extract",
        "1/3 cup maraschino cherry juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "George Washington Chocolate Cake",
    "url": "http://allrecipes.com/recipe/25583/george-washington-chocolate-cake/"
}
