{
    "directions": [
        "Steam potatoes in a vegetable steamer set over 1 inch of boiling water in a wide 4- to 5-quart pot, covered, until tender when pierced with a paring knife, 20 to 25 minutes. Transfer to a cutting board.",
        "Meanwhile, cook asparagus in a wide 4- to 5-quart pot of boiling salted water, uncovered, until just tender, about 3 minutes. Transfer asparagus with tongs to a bowl of ice and cold water to stop cooking, then drain and pat dry. Cut off and reserve tips, then cut stalks into 1-inch pieces. Add tips and stalks to a large bowl.",
        "Cook bacon in a 12-inch heavy skillet over moderate heat, stirring occasionally, until golden and crisp, about 8 minutes. Transfer with a slotted spoon to paper towels to drain, reserving bacon drippings in skillet.",
        "Once potatoes have cooled to warm, cut into 1/2-inch-thick slices. Add to bowl with asparagus, along with bacon, ham, celery, onion, parsley, and pickle.",
        "Return skillet with bacon drippings to moderately high heat. Add oil, then whisk in vinegar, sugar, mustard, salt, and pepper and cook, stirring and scraping up brown bits, 30 seconds. Immediately pour hot dressing over potato salad and toss to coat."
    ],
    "ingredients": [
        "3 pounds medium (2 to 3 inches in diameter) red boiling potatoes, scrubbed well",
        "1 pound medium asparagus, trimmed",
        "5 bacon slices (5 ounces), cut into 1/2-inch pieces",
        "5 ounces sliced Black Forest or other baked deli ham, slices stacked and cut in half lengthwise, then cut crosswise into 1/3-inch-wide strips",
        "2 celery ribs, cut into 1/4-inch dice (1 cup)",
        "1 cup finely chopped sweet onion such as Vidalia",
        "1/2 cup chopped fresh parsley",
        "1/3 cup finely chopped sweet gherkin pickles",
        "3 tablespoons olive oil",
        "7 tablespoons distilled white vinegar",
        "2 teaspoons sugar",
        "1 teaspoon Dijon mustard",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Pork",
        "Potato",
        "Vegetable",
        "Side",
        "Bacon",
        "Ham",
        "Summer",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "German-Style Potato and Ham Salad",
    "url": "http://www.epicurious.com/recipes/food/views/german-style-potato-and-ham-salad-235017"
}
