{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Lightly coat two 9-inch round cake pans with oil and dust with flour. Whisk together the flour, cocoa, baking soda and salt in a small bowl; set aside.",
        "Microwave the chocolate in a small microwave-safe bowl on high power for 45 seconds; remove and stir. Microwave again at high power in 30-second increments, stirring in between, until the chocolate has melted completely; set aside.",
        "Beat the granulated sugar, oil and eggs in a large bowl with an electric mixer on medium speed until smooth. Beat in the melted chocolate. Alternate beating in the flour mixture and the milk, adding the flour in three additions and the milk in two, starting and ending with the flour, until just incorporated. Add half the milk, and mix until just incorporated. Repeat with the remaining flour mixture and milk, making sure not to overmix. Divide the batter evenly between the prepared pans.",
        "Bake until a toothpick inserted in the center comes out with moist crumbs, 30 to 35 minutes. Let cool in the pans for 10 minutes, run a thin spatula around the edges and then turn the cakes out onto a cooling rack to cool completely. (They will have a sugary \"crust\" on the top. This is from the melted chocolate and is not a problem. It will soften once the cake is assembled or if the layers are baked the day before.)",
        "For the filling: While the cakes cool, spread the pecans on a baking sheet and bake, tossing once, until toasted, 8 to 10 minutes. Finely chop. Whisk together the milk and egg yolks in a medium saucepan until smooth. Add the brown sugar, butter, corn syrup, vanilla and salt, and cook over medium heat, stirring constantly, until the mixture has thickened and coats the back of a spoon, 5 to 6 minutes. (It will be similar to the thickness of eggnog.) Pour the mixture into a large bowl. (Don't worry if it seems thin. The coconut and nuts will bind it.) Stir in the coconut and pecans; set aside to cool.",
        "For the frosting: Put the chocolate in a medium bowl. Heat 1 cup of the cream in a small saucepan over medium heat until steaming but not boiling, and pour over the chocolate. Let stand a few minutes, and then whisk until smooth; let stand at room temperature (or put in the refrigerator if your kitchen is hot) until thick but not set, 20 minutes to 1 hour. Add the remaining 2 tablespoons cream to the chocolate mixture, and beat with an electric mixer on medium speed until lightened in color and fluffy, about 1 minute (do not overbeat, or it will become hard and grainy). The frosting should hold medium peaks and will continue to firm up a bit as it stands. Spoon about 1 cup frosting into a pastry bag fitted with a star tip.",
        "To assemble: Put one cake layer right-side up on a serving plate, and top with half the filling. Top with the second cake layer and the remaining filling, spreading it to about 1/2 inch from the edge. Frost the sides, and decorate around the top edge of the cake with the frosting in the pastry bag.",
        "Loosely cover the cake with plastic wrap and leave at room temperature overnight. Unwrap and serve."
    ],
    "ingredients": [
        "1 cup vegetable oil, plus more for greasing the pans",
        "2 1/2 cups all-purpose flour, spooned and leveled, plus more for dusting the pans",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon fine salt",
        "4 ounces semisweet chocolate, roughly chopped",
        "2 cups granulated sugar",
        "3 large eggs, at room temperature",
        "1 cup milk",
        "1 1/2 cups pecans",
        "1 cup milk",
        "3 large egg yolks",
        "3/4 cup packed light brown sugar",
        "4 tablespoons unsalted butter",
        "1/4 cup corn syrup",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon fine salt",
        "1 1/2 cups sweetened shredded coconut",
        "8 ounces semisweet chocolate, chopped",
        "1 cup plus 2 tablespoons heavy cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Coconut Cake",
        "Coconut Recipes",
        "Fruit",
        "Baking",
        "Dessert",
        "German Chocolate Cake"
    ],
    "title": "German Chocolate Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/german-chocolate-cake"
}
