{
    "directions": [
        "Trim 1/4 inch from the root end of each kohlrabi bulb so the bulb will stand upright, scoop out the pulp from the opposite end with a small melon-ball cutter or spoon, leaving 1/4-inch-thick shells, and chop it fine (there will be about 2 3/4 cups). In a large kettle of boiling salted water cook the kohlrabi leaves for 3 minutes, or until they are just tender, drain them well, and chop them fine (there will be about 2 cups).",
        "In a large skillet cook the onion and the garlic in 2 tablespoons of the butter over moderate heat, stirring, until the onion is golden and transfer the mixture to a large bowl. To the bowl add the pork, the rice, 2 tablespoons of the parsley, the paprika, the marjoram, the caraway seeds, the tomato paste, the eggs, 1/2 cup of the kohlrabi pulp, 1/4 cup of the chopped kohlrabi leaves, and salt and pepper to taste and combine the mixture well. Divide the mixture among the kohlrabi shells, mounding it, and arrange the shells in a shallow flameproof baking dish just large enough to hold them in one layer. Scatter the remaining pulp and leaves in the dish and pour in the broth. Bring the broth to a boil and simmer the shells, covered partially, for 30 to 50 minutes, or until they can be pierced easily with a sharp knife. Transfer the shells with a slotted spoon to a plate, reserving the cooking mixture in the baking dish, and keep them warm.",
        "In a small saucepan cook the flour in the remaining 2 tablespoons butter over moderate heat, whisking, for 3 minutes and whisk in the cream. Bring the mixture to a boil, whisking, simmer it for 1 minute, and stir it into the reserved cooking mixture, a little at a time. Add salt and pepper to taste and cook the sauce over moderate heat, stirring occasionally, for 5 to 10 minutes, or until it is thickened. Return the stuffed shells to the baking dish and garnish them with the additional parsley."
    ],
    "ingredients": [
        "8 kohlrabies (about 5 pounds), bulbs peeled, stems discarded, and the leaves trimmed of tough center ribs",
        "1/2 cup finely chopped onion",
        "1 garlic clove, chopped fine",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 pound ground pork",
        "1/2 cup cooked long-grain rice",
        "2 tablespoons finely chopped fresh parsley leaves plus additional for garnish if desired",
        "2 tablespoons sweet paprika",
        "1/4 teaspoon dried marjoram, crumbled",
        "1/4 teaspoon caraway seeds",
        "1 1/2 tablespoons tomato paste",
        "2 large eggs, beaten lightly",
        "3 1/2 cups chicken broth",
        "2 tablespoons all-purpose flour",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Rice",
        "Vegetable",
        "Dinner",
        "Fall",
        "Gourmet"
    ],
    "title": "German-Style Stuffed Kohlrabi",
    "url": "http://www.epicurious.com/recipes/food/views/german-style-stuffed-kohlrabi-10663"
}
