{
    "directions": [
        "Sprinkle yeast over warm water in a bowl and let activate while you complete remaining steps.",
        "Place flour and salt into a food processor and pulse once or twice to combine. Scatter butter slices over flour and process until butter is thoroughly mixed into the flour, about 1 minute.",
        "Whisk yeast mixture, sour cream, egg, egg yolks, and vanilla extract together in a bowl; pour mixture into food processor. Pulse several times, just until the dough starts to hold together and clean the sides of the bowl (do not overmix). Remove dough from food processor and divide in half; form each half into a thick disk, wrap in plastic wrap, and refrigerate at least 2 hours. For best texture, refrigerate overnight.",
        "Preheat oven to 375 degrees F (190 degrees C). Line several baking sheets with parchment paper.",
        "Sprinkle a work surface generously with sugar and roll out one of the dough disks into an 8x16-inch rectangle. Sprinkle dough with a generous amount of sugar. Fold the dough over in thirds, letter-style, and roll out again; fold as before and roll out and fold a third time, sprinkling dough with sugar each time. Finally, roll dough into a 4x14-inch rectangle, about 1/4 inch thick. Repeat process with second dough disk.",
        "Cut strips from the short side of the dough rectangles, making them 1/2 to 3/4 inch wide. Place strips onto the parchment-lined baking sheets, twisting and slightly stretching them. If preferred, form into horseshoe shapes.",
        "Bake in the preheated oven until lightly golden brown, 12 to 15 minutes. Cookies will puff up a bit to reveal delicate layers. Let cookies cool for about 5 minutes on sheets before transferring to wire cooling racks."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1/4 cup warm water",
        "3 1/2 cups bleached all-purpose flour",
        "1 teaspoon salt",
        "1 cup butter, sliced",
        "3/4 cup sour cream",
        "1 large egg",
        "2 large egg yolks",
        "1 teaspoon vanilla extract",
        "1 cup white sugar, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "German Twists",
    "url": "http://allrecipes.com/recipe/228408/german-twists/"
}
