{
    "directions": [
        "Chocolate-Pecan Ice Cream: Line a cookie sheet with waxed paper; set aside. Slice chocolate ice cream into sheets about 2 inches thick. Use a cookie cutter to cut rounds just larger than the cupcakes from frozen ice cream. Place on waxed paper-lined cookie sheet.  Press toasted pecan pieces into ice cream letting pecans protrude from the ice cream. Cover and freeze 4 hours or overnight.",
        "Preheat oven to 350 degrees F. Line twelve 2-1/2-inch muffin cups with paper baking cups. Set aside.",
        "In a small bowl stir together flour, baking soda, and salt; set aside.",
        "In a small saucepan combine chocolate and water. Cook and stir over low heat until melted; cool about 10 minutes.",
        "In a large bowl beat butter with an electric mixer on medium to high speed for 30 seconds. Beat in sugar until fluffy. Add eggs and vanilla; beat on low speed until combined then beat on medium speed for 1 minute. Beat in chocolate mixture. Add the flour mixture and buttermilk alternately to beaten mixture, beating on low speed after each addition just until combined. Spoon batter into bake cups, filling cups about 2/3 full.",
        "Bake about 25 minutes or until a wooden toothpick comes out clean. Cool in pans on wire racks for 10 minutes. Remove from pans. Cool thoroughly.",
        "Just before serving, heat caramel ice cream topping until warm. Remove wrappers from cupcakes; place cupcakes on plates or in shallow bowls. Top each cupcake with one round of Chocolate-Pecan Ice Cream \"Frosting.\" Top with toasted coconut and drizzle with warm caramel ice cream topping."
    ],
    "ingredients": [
        "Chocolate-Pecan Ice Cream \"Frosting\":",
        "1/2 gallon chocolate ice cream",
        "3/4 cup toasted pecan pieces, or as needed",
        "Cupcakes:",
        "1 cup all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2 (1 ounce) squares sweet baking chocolate",
        "1/4 cup water",
        "1/2 cup butter, softened",
        "1/2 cup sugar",
        "2 eggs",
        "1/2 teaspoon vanilla",
        "1/2 cup buttermilk or sour milk",
        "Caramel ice cream topping",
        "2/3 cup toasted shaved coconut*"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "German Chocolate Cupcakes",
    "url": "http://allrecipes.com/recipe/233298/german-chocolate-cupcakes/"
}
