{
    "directions": [
        "Preheat the oven to 350 degrees. Line cupcake pans with 14 or 15 paper liners.",
        "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter, granulated sugar, and brown sugar on medium-high speed for 5 minutes, until light and fluffy. Scrape down the bowl. Lower the speed to medium, add the eggs one at a time, then add the vanilla and mix well. In a separate bowl, whisk together the buttermilk, sour cream, and coffee. In a third bowl, sift together the flour, cocoa powder, baking soda, and salt. With the mixer on low, add the buttermilk and flour mixtures alternately in thirds, beginning with the buttermilk and ending with the flour. Don't overmix! Fold the batter a few times with a rubber spatula to be sure it's mixed.",
        "Scoop the batter into the cupcake liners. (I use a 2-inch ice cream scoop.) Bake in the center of the oven for 20 to 25 minutes, until a toothpick comes out clean. Cool for 10 minutes, remove from the pans, and allow to cool completely before frosting.",
        "Coconut Frosting:",
        "Melt the butter in a large saucepan over medium heat. Whisk in the evaporated milk, brown sugar, and egg yolks and bring to a simmer over medium heat. Simmer, stirring constantly with a wooden spoon, for about 15 minutes, until slightly thickened. If the mixture looks a bit curdled, beat it vigorously with a whisk. Off the heat, stir in the vanilla extract, almond extract, coconut, almonds, pecans, and salt. Allow to cool for about an hour. Frost the cupcakes with a knife or small metal spatula."
    ],
    "ingredients": [
        "1 teaspoon pure vanilla extract",
        "1/2 teaspoon pure almond extract",
        "2 cups sweetened flaked coconut",
        "1 cup blanched sliced almonds, toasted",
        "1 cup chopped pecans",
        "1/4 teaspoon kosher salt",
        "2/3 cup granulated sugar",
        "2/3 cup light brown sugar, lightly packed",
        "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature",
        "2 extra-large eggs, at room temperature",
        "2 teaspoons pure vanilla extract",
        "1 cup buttermilk, shaken, at room temperature",
        "1/2 cup sour cream, at room temperature",
        "2 tablespoons freshly brewed coffee",
        "1 3/4 cups all-purpose flour",
        "1 cup unsweetened cocoa powder, such as Pernigotti",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon kosher salt",
        "12 tablespoons (1 1/2 sticks) unsalted butter",
        "1 (12-ounce) can evaporated milk",
        "1 1/4 cups light brown sugar, lightly packed",
        "4 extra-large egg yolks"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cupcake",
        "Chocolate",
        "Cupcake",
        "Baking",
        "Dessert",
        "Nut Recipes",
        "Coconut Recipes",
        "Fruit"
    ],
    "title": "German Chocolate Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/german-chocolate-cupcakes-recipe"
}
