{
    "directions": [
        "Cut chicken breasts into 1 inch strips. Place in a medium bowl with desired marinade, and marinate in the refrigerator for at least 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat oil in a large skillet over medium heat. Saute chicken and onions until chicken is evenly brown. Stir in diced tomatoes with green chile peppers, stewed tomatoes, chile peppers, soup and broth. Bring mixture to a boil. Reduce heat, cover skillet, and simmer for 20 to 30 minutes, or until chicken is no longer pink and juices run clear.",
        "Remove chicken from skillet, and shred when cool enough to handle. Meanwhile, allow skillet  mixture to simmer and reduce to about 2 1/4 cups. In a medium bowl, combine shredded chicken and about 1/4 cup skillet mixture (just enough to make a paste like mixture). Mix together with half the chopped green onions. Pour remaining 2 cups of skillet mixture into a 9x13 inch baking dish.",
        "In a second skillet, heat cream over low heat, being careful not to boil. Dip tortillas in the warm cream to soften and coat. Spoon about 1/3 cup chicken mixture onto each tortilla. Top chicken mixture with half the shredded cheese, and roll up tortillas. Place rolled tortillas in baking dish, seam side down, and drizzle with enchilada sauce. Cover with remaining shredded cheese, and sprinkle remaining chopped green onion over cheese. Bake uncovered in preheated oven for 25 minutes, or until cheese is melted and bubbling."
    ],
    "ingredients": [
        "4 boneless, skinless chicken breast halves",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 (14.5 ounce) can stewed tomatoes",
        "12 small chile peppers, diced (optional)",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (14.5 ounce) can chicken broth",
        "1 bunch green onions, chopped",
        "1/2 pint heavy cream",
        "6 (6 inch) corn tortillas",
        "3 cups shredded Cheddar cheese",
        "1 (10 ounce) can enchilada sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gerry's Chicken Enchiladas",
    "url": "http://allrecipes.com/recipe/8966/gerrys-chicken-enchiladas/"
}
