{
    "directions": [
        "Preheat oven to 350 degrees. Line a 9 x 13 inch baking pan with foil and grease with pan spray.",
        "In a medium saucepan, bring 2 inches of water to a gentle simmer. Put the 60% chips and butter in a heatproof bowl and set it over (but not touching) the simmering water. Stir the mixture with a rubber spatula until the butter is melted and both ingredients are completely combined. Turn off the heat and leave the bowl over the warm water.",
        "Sift together the flour and baking powder and set aside.  In a large bowl whisk together eggs, salt, sugar and vanilla.  Add the egg mixture to the chocolate mixture and whisk together gently. With a spatula, fold in the flour.  Immediately pour 1/2 the mixture into the prepared baking pan and spread it evenly. Next, sprinkle the chopped peppermint bark over the batter and then pour the remaining batter over this.  Spread evenly.",
        "Bake for 15-20 minutes.  The center should be fudgy but not dry.  Remove from the oven and cool for 10 minutes.  Place Peppermint Bark chunks on top of warm brownies and allow them to soften for 1 minute. Using a spatula, gently swirl the melting Peppermint Bark to create swirls of melted chocolate.  Refrigerate for 1 hour.  Trim the 4 edges of the brownies by 1/4 inch. And cut into 18 squares."
    ],
    "ingredients": [
        "1 1/2 sticks unsalted butter",
        "1 1/2 cups Ghirardelli 60% cacao chocolate chips",
        "3 large eggs, at room temperature",
        "1 cup sugar",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1/2 cup all purpose flour, plus",
        "2 tablespoons all purpose flour",
        "1/2 teaspoon baking powder",
        "8 squares Ghirardelli Peppermint Bark, chopped into large chunks (for the brownies)",
        "18 squares Ghirardelli Peppermint Bark, broken into large chunks (about 8 pieces per square) (for the finishing)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli Chocolate Brownies with Peppermint Bark",
    "url": "http://allrecipes.com/recipe/219089/ghirardelli-chocolate-brownies-with-p/"
}
