{
    "directions": [
        "To make the centers, in the top of a double boiler or in a heatproof bowl over barely simmering water, melt the 2 ounces of chocolate with the cream. Whisk gently to blend.",
        "Refrigerate for about 2 hours, or until firm. With your hands, form into six balls; refrigerate until needed.",
        "Preheat the oven to 400 degrees F. Spray six 4-ounce ramekins or custard cups with cooking spray.",
        "To make the cakes, in the top of a double boiler or in a heatproof bowl over barely simmering water, melt the 4 ounces of chocolate and the butter, stirring occasionally until smooth.",
        "In a large bowl, with an electric mixer, whisk the whole eggs, egg yolks, sugar, and vanilla on high speed for about 5 minutes, or until thick and light. Fold the melted chocolate mixture and flour into the egg mixture just until combined. Spoon the cake batter into the ramekins. Place a chocolate ball in the middle of each ramekin.",
        "Bake for about 15 minutes, or until the cake is firm to the touch. Remove from the oven and let sit for about 5 minutes. Run a small, sharp knife around the inside of each ramekin, place an upside-down plate on top, invert, and remove the ramekin. Garnish with raspberries and a dollop of whipped cream."
    ],
    "ingredients": [
        "Centers:",
        "2 ounces Ghirardelli 60% Cacao Bittersweet Chocolate baking bar, broken or chopped into 1-inch pieces",
        "1/4 cup heavy cream",
        "Cakes:",
        "4 ounces Ghirardelli 60% Cacao Bittersweet Chocolate baking bar, broken or chopped into 1-inch pieces",
        "1/2 cup unsalted butter, cut into pieces",
        "2 large whole eggs",
        "2 large egg yolks",
        "1/3 cup granulated white sugar",
        "1/2 teaspoon pure vanilla extract",
        "1/4 cup cake flour",
        "Raspberries for garnish",
        "Whipped cream for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli® Individual Chocolate Lava Cakes",
    "url": "http://allrecipes.com/recipe/210418/ghirardelli-individual-chocolate-l/"
}
