{
    "directions": [
        "Preheat the oven to 350 degrees F. Butter a 9-inch spring form pan and line with parchment paper.",
        "In a large microwaveable bowl melt 1 cup chocolate chips and butter together. You can do this over a pot of simmering water (bain marie) or gently in the microwave.",
        "When the chocolate has cooled, whisk in sugar then add 6 egg yolks, one at a time. Add in the vanilla extract.",
        "Sift cocoa and salt over chocolate mixture and whisk to combine.",
        "In a stand mixer (or using a hand mixer) beat 6 egg whites at medium high speed until peaks form and it becomes stiff.",
        "Gently fold in a large spoon full of the egg whites to the chocolate mix. This is called \"introducing.\" It will loosen up the chocolate mixture. Then follow with the rest of the egg whites. Gently folding, taking care to maintain the bubbles in the eggs.",
        "Pour batter into the prepared pan and bake for 40 to 45 minutes or until it is just set. Take care not to overbake or it won't be as moist. Cool the cake in the tin until totally cold. The cake will naturally fall in the center but that is normal.",
        "Cover the cake and set it aside until ready to decorate. This cake is best made the day before.",
        "For the Chocolate Mousse: Put 3/4 cup chocolate chips, butter and orange zest in a heatproof bowl and place over a pot of simmering water (bain marie) to melt. Gently stir until melted. Remove from the heat and cool.",
        "Whisk 3 egg whites in a large clean bowl until stiff peaks form.",
        "Whisk 3 egg yolks into the chocolate mix until combined.",
        "Gently fold the egg whites into the chocolate mix. Start by folding in one spoonful to loosen the mix, then fold in the rest until fully incorporated.",
        "Place the mousse in the refrigerator to set overnight or a minimum of 10 hours.",
        "The next day, spoon the mousse over the cold cake. The cake naturally falls during baking, which creates a nice crater for the mousse.",
        "Once the mousse is on top of the cake, store it in the refrigerator for up to 3 days.",
        "Optional: decorate the cake with colorful fruit on top."
    ],
    "ingredients": [
        "Flourless Chocolate Cake:",
        "1 cup Ghirardelli 60% Cacao Bittersweet Chocolate Baking Chips",
        "2 sticks salted butter",
        "1 1/4 cups sugar",
        "6 large room temperature eggs, separated",
        "1 cup Ghirardelli® Unsweetened Cocoa Powder",
        "1/2 teaspoon salt",
        "1 teaspoon vanilla extract",
        "Chocolate Mousse:",
        "3/4 cup Ghirardelli 60% Cacao Bittersweet Chocolate Baking Chips",
        "1/2 tablespoon butter",
        "1/4 cup warm water",
        "3 whole eggs, separated",
        "1/2 tablespoon grated orange zest"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli® Chocolate and Orange Mousse Cake",
    "url": "http://allrecipes.com/recipe/245378/ghirardelli-chocolate-and-orange-m/"
}
