{
    "directions": [
        "Preheat the oven to 325 degrees F. Arrange a rack in center of oven. Butter the bottom and sides of a 9 by 2-inch round cake pan and line the bottom with parchment paper.",
        "In the top of a double boiler or in a heatproof bowl over barely simmering water, melt the semi-sweet chocolate chips and butter, stirring occasionally until smooth. Cool slightly.",
        "Meanwhile, in a large bowl with an electric mixer fitted with the whip attachment, whip the eggs and salt on medium speed until doubled in volume, about 5 minutes. Gently fold the whipped eggs, a third at a time, into the melted chocolate. Pour the batter into the prepared cake pan.",
        "Prepare a water bath for the cake by placing the cake pan in a larger pan, and filling the large pan halfway up the sides of the cake pan with hot, but not boiling water.",
        "Bake for about 40 minutes, or until the cake pulls away from the sides of the pan and is set in the center. Remove the pan from the water bath to a cooling rack, and cool the cake completely in the pan. Cover with plastic wrap and refrigerate overnight. To remove the cake from the pan, dip the pan in warm water halfway up the sides and run a thin metal spatula around the inside of the pan. Invert onto a plate to unmold and remove the parchment paper.",
        "To prepare the ganache, bring the heavy cream to a simmer in a small saucepan over low heat. Pour the heated cream over the milk chocolate chips. Stir gently until smooth and allow to cool slightly. When the ganache is still warm to the touch, pour over the top of cake and spread with an offset spatula to evenly cover (There will be some ganache leftover.)",
        "Chill the cake until the ganache sets, about 30 minutes. To garnish, grate the white chocolate bar on top of cake."
    ],
    "ingredients": [
        "3 cups Ghirardelli Semi-Sweet Chocolate Chips",
        "1 cup unsalted butter at room temperature",
        "8 large eggs, chilled",
        "1/4 teaspoon salt",
        "1/2 cup heavy cream",
        "1 cup Ghirardelli Milk Chocolate Chips",
        "2 ounces Ghirardelli White Chocolate baking bar, chilled"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli® Triple Chocolate Truffle Cake",
    "url": "http://allrecipes.com/recipe/210424/ghirardelli-triple-chocolate-truff/"
}
