{
    "directions": [
        "Preheat the oven to 350 degrees F. Line 12 cupcake molds or muffin tins with paper liners or spray with nonstick spray.",
        "To make the cupcakes, sift together the flour, cocoa, baking soda, and salt.",
        "In a medium bowl, whisk together the egg, brown sugar, and white sugar. Whisk in the milk, coffee, and melted butter. Whisk in the dry ingredients. Divide the batter evenly among the cupcake molds, filling them about three-quarters full.",
        "Bake for 15 minutes, or until a tester inserted in the middle of the cupcakes comes out clean. Cool for 10 minutes. Using a small spatula or knife, remove the cupcakes from the pan. Continue to cool on a wire rack to room temperature.",
        "To make the frosting, melt the chopped chocolate in the top of a double boiler, or in a heatproof bowl, over barely simmering water, stirring occasionally until smooth. Heat the cream until hot. Remove from the heat and whisk in the chocolate. Transfer to a bowl and cool to just warm. Whisk in the butter until smooth. Let sit until it reaches a spreading consistency, about 1 hour. Spread the frosting on top of the cupcakes. Sprinkle them with chocolate chips."
    ],
    "ingredients": [
        "Cupcakes:",
        "1 1/8 cups all-purpose flour",
        "1/4 cup Ghirardelli Unsweetened Cocoa",
        "1 1/4 teaspoons baking soda",
        "1/4 teaspoon salt",
        "1 large egg",
        "1/2 cup firmly packed light brown sugar",
        "1/2 cup granulated white sugar",
        "1/2 cup whole milk plus",
        "2 tablespoons whole milk",
        "1/3 cup strong brewed coffee or espresso",
        "1/2 cup unsalted butter, melted",
        "Frosting:",
        "6 ounces Ghirardelli Semi-Sweet Chocolate baking bar, broken or chopped into 1-inch pieces",
        "3/4 cup heavy cream",
        "3 tablespoons unsalted butter",
        "1 cup Ghirardelli Milk or Semi-Sweet Chocolate Chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli® Dark Chocolate Cupcakes",
    "url": "http://allrecipes.com/recipe/210423/ghirardelli-dark-chocolate-cupcake/"
}
