{
    "directions": [
        "Preheat over to 325 degrees F (165 degrees C).",
        "CRUST: In a microwave safe bowl, melt the butter. Add the chocolate graham crackers, ground almonds, and sugar and mix until combined. Press mixture into the bottom of a 9-inch springform pan and set aside.",
        "PUREE: In a saucepan, combine raspberries and sugar. Bring to boil, and continue boiling 3-5 minutes, or until sauce is thick.  Strain sauce through a mesh strainer to remove seeds and set aside.",
        "CHEESECAKE: In a small pot over low heat, bring the whipping cream to just boiling. Remove from heat and add the chocolate chips. Set aside for 5 minutes and then stir until smooth.",
        "In a large bowl, mix together cream cheese and 3/4 cup sugar until smooth. Beat in eggs, one at a time.  Remove approximately 1 1/2 cup of this batter and place into a smaller bowl and add 1/2 cup raspberry puree. Blend until combined.  Add the melted chocolate to the remaining batter and mix until combined. Pour the chocolate cheesecake batter into the pan.  Very carefully layer the raspberry cheesecake mixture on top of the chocolate mixture. Bake for 60 to 75 minutes, or until filling is set.  Cool in pan, then cover with plastic wrap and refrigerate until cold before removing from pan."
    ],
    "ingredients": [
        "Crust:",
        "1 1/2 cups chocolate graham cracker crumbs",
        "1/2 cup ground almonds",
        "4 tablespoons white sugar",
        "3/4 cup butter, melted",
        "Cheesecake:",
        "4 (8 ounce) packages cream cheese, softened",
        "3/4 cup white sugar",
        "4 eggs",
        "Raspberry puree (recipe below)",
        "2 cups Ghirardelli® 60% Cacao Bittersweet Chocolate Chips",
        "1/2 cup heavy cream",
        "Raspberry puree:",
        "1 (10 ounce) package frozen raspberries",
        "4 tablespoons white sugar",
        "Chocolate Ganache (optional):",
        "8 ounces Ghirardelli® 60% Cacao Bittersweet Chocolate Chips",
        "1/2 cup heavy cream",
        "Additional Garnishes (optional):",
        "Fresh raspberries",
        "8 ounces white chocolate, melted for drizzling"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli Chocolate Raspberry Cheesecake Hearts",
    "url": "http://allrecipes.com/recipe/216680/ghirardelli-chocolate-raspberry-chees/"
}
