{
    "directions": [
        "Preheat the oven to 350 degrees with a rack in the lower third.  Grease or spray the top surface of the pan with nonstick spray and line the cups with paper liners.",
        "In the top of a double boiler or in a heatproof bowl over barely simmering water, melt 1 1/4 cups of the chocolate chips with the butter, stirring frequently until melted and smooth. Remove the chocolate from the heat and let it cool to lukewarm. Meanwhile, in a small bowl, whisk the flour and baking powder together thoroughly.",
        "In a large bowl, beat the eggs, sugar, and salt with an electric mixer on high speed for 2 to 3 minutes until the mixture is very pale and thick.  Scrape the warm chocolate over the egg mixture and fold it in with a large rubber spatula.  Sprinkle the flour into the bowl with half of the remaining chocolate chips and half of the walnuts.  Fold just until the ingredients are blended.  Divide the batter evenly among the lined cups.  Sprinkle the tops with marshmallows followed by the remaining walnuts and the remaining chocolate chips. Bake 18 to 20 minutes until the marshmallows are golden brown.",
        "Set the pan on a rack to cool for 5 minutes.  Run the tip of a table knife around the top of each cupcake to detach any melted marshmallow or chocolate from the pan.  Let the cupcakes cool until firm enough to remove from the pan.  Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 3/4 cups Ghirardelli® 60% Cacao Bittersweet Chocolate Chips",
        "1/2 cup unsalted butter, cut into pieces",
        "1/2 cup all-purpose flour plus",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon baking powder",
        "3 large eggs",
        "3/4 cup sugar",
        "1/4 teaspoon salt",
        "1 cup coarsely chopped walnuts",
        "1 cup mini marshmallows"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ghirardelli Rocky Road Cupcakes",
    "url": "http://allrecipes.com/recipe/218117/ghirardelli-rocky-road-cupcakes/"
}
