{
    "directions": [
        "1. To make spiced honey marinade, combine the honey, lime juice, lime zest, and soy sauce in a bowl. Slowly whisk in 1/4 cup of the oil. Stir in grated gingerroot, onion, cumin, coriander, cilantro, and cornstarch. Place locusts in liquid and marinate for 30 minutes.",
        "2. Heat a wok or skillet over medium-high heat until it is nearly smoking. Add 2 tablespoons oil. When the oil is hot, add the garlic. Stir-fry until it is aromatic, then add the locusts. Stir and toss the locusts for 3 to 4 minutes, adding 1-2 tablespoons of marinade if they seem to be drying out. Stir-fry until locusts are just turning golden brown. Remove the locusts from the pan. Drain in a colander or on paper towels.",
        "3. Add 2 tablespoons oil to the wok or skillet. When the oil is hot, add the minced gingerroot. Stir-fry until aromatic, then add the vegetables. Stir-fry for 1 to 2 minutes, until the vegetables are tender but still crisp. Stir in salt and sugar while stir-frying the vegetables, if desired. Add 1 to 2 tablespoons of marinade if the vegetables are drying out during stir-frying.",
        "4. Add 1/2 cup of marinade and bring to a boil. Add the locusts back into the pan. Stir-fry for 2 more minutes to heat through and thoroughly cook the locusts. Serve hot."
    ],
    "ingredients": [
        "2 tablespoons honey",
        "3 tablespoons lime juice",
        "1 teaspoon grated lime zest",
        "1/4 cup soy sauce",
        "1/2 cup vegetable oil, divided",
        "2 tablespoons grated gingerroot",
        "1 green onion, trimmed and thinly sliced",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon coriander",
        "1/4 cup chopped cilantro",
        "2 teaspoons cornstarch",
        "20 locusts or large grasshoppers, legs and wings removed",
        "1 clove garlic, minced",
        "1 slice gingerroot, minced",
        "3 cups packaged fresh stir-fry vegetable mix",
        "Salt to taste",
        "Sugar to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Stir-Fry",
        "Honey",
        "Cilantro",
        "Coriander",
        "Lime Juice",
        "Cumin"
    ],
    "title": "Ghiscari Spiced Honeyed Locusts",
    "url": "http://www.epicurious.com/recipes/food/views/ghiscari-spiced-honeyed-locusts-395309"
}
