{
    "directions": [
        "Preheat the oven to 350°F. Line a 13- by 18-inch rimmed baking sheet with parchment paper.",
        "In a large bowl, toss the walnuts, almonds, and hazelnuts with the corn syrup until evenly coated. Spread in a single layer on the prepared baking sheet. Bake, stirring once, until the nuts are toasted and caramelized, 25 to 30 minutes. Carefully transfer the nuts on the parchment paper to a wire rack to cool completely, separating the nuts as they cool. Line the baking sheet with a clean sheet of parchment paper.",
        "In a double boiler or large heatproof bowl set over a saucepan of simmering water, melt 3 cups chopped bittersweet chocolate, stirring occasionally to evenly melt. Remove from the heat and add the remaining 1 cup chocolate. Stir until almost melted, then set over the simmering water again. Continue stirring slowly and gently until just melted. Remove from the heat and add the nuts. Fold until evenly coated. Spread in a flat, even layer to the edges of the prepared baking sheet.",
        "Place 1 cup white chocolate in another heatproof bowl and set over the saucepan of barely simmering water. Melt very gently (do not overheat), stirring occasionally, then remove from the heat. Add the remaining 1/2 cup white chocolate and stir until melted. Dollop onto the dark chocolate, then run a butter knife through the dollops to form ghostly streaks.",
        "Refrigerate until set, about 3 hours. Break bark into pieces and wrap in treat bags if desired."
    ],
    "ingredients": [
        "1 cup roughly chopped walnuts",
        "1 cup roughly chopped almonds",
        "1/2 cup roughly chopped hazelnuts",
        "1/2 cup corn syrup",
        "20 ounces good-quality bittersweet chocolate (62% to 71% cacao), finely chopped (4 cups)",
        "7 1/2 ounces white chocolate, finely chopped (1 1/2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Chocolate",
        "Halloween",
        "Almond",
        "Hazelnut"
    ],
    "title": "Ghostly Chocolate-Nut Bark",
    "url": "http://www.epicurious.com/recipes/food/views/ghostly-chocolate-nut-bark-51254500"
}
