{
    "directions": [
        "Heat the olive oil in a large soup pot over medium heat. Add the leek, chopped carrot and fennel and season with 1/2 teaspoon salt and the pepper flakes. Saute slowly until the vegetables are very soft but not browned, about 3 minutes.",
        "Add the white beans and farro and toast for a minute or two, then add the tomatoes with their juices and the chicken stock, thyme, parmesan rind and 4 cups water. Bring to a boil, then reduce the heat to a steady simmer. Cook, stirring occasionally, about 1 1/2 hours, or until the beans are tender but not mushy; they should be firm and separate. Season with salt.",
        "Add the kielbasa, kale and sliced carrot. Cook until the kale and carrot are tender, about 15 minutes. Remove and discard the thyme sprigs and parmesan rind. Serve with a drizzle of olive oil, a sprinkle of grated parmesan and a squeeze of lemon, if you like.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "1 leek, white and tender green parts only, finely chopped",
        "2 carrots, 1 finely chopped, 1 sliced",
        "1/2 fennel bulb, finely chopped",
        "Kosher salt",
        "1/2 teaspoon red pepper flakes",
        "3/4 cup dried small white beans, such as navy",
        "1/2 to 3/4 cup farro",
        "1 15-ounce can diced tomatoes",
        "2 quarts chicken stock (homemade or low-sodium)",
        "2 to 3 sprigs thyme",
        "1 2-inch piece parmesan cheese rind",
        "13 ounces turkey or Polska kielbasa, cut into half-moons",
        "4 to 5 large leaves Tuscan kale, ribs removed, chopped (about 2 cups)",
        "Grated parmesan cheese and fresh lemon juice, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Soup",
        "Farro Recipes",
        "Grain Recipes",
        "Sausage Recipes"
    ],
    "title": "Giada's \"House\" Soup",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/giadas-house-soup"
}
