{
    "directions": [
        "Spray inside of tart pan ring with nonstick spray. Wrap removable bottom of pan with plastic wrap; gather excess plastic underneath (it should be smooth on top of removable bottom). Set inside ring.",
        "Heat chocolate in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until melted. Remove from heat and, stirring constantly, add oil. Let cool, stirring occasionally, until chocolate mixture firms slightly, about 10 minutes.",
        "Pour a little less than half of chocolate mixture into prepared pan; reserve remaining chocolate mixture at room temperature. Tilt pan until bottom is evenly coated. Chill until firm, about 15 minutes.",
        "Meanwhile, purée peanuts, powdered sugar, peanut butter, and salt in a food processor, scraping bowl often, until mixture forms a large mass around the blade that sticks together; do not overprocess or mixture will be too soft and greasy.",
        "Transfer peanut mixture to a large sheet of wax paper. Press firmly into a disk 1/4\" smaller than diameter of tart pan, about 9 3/4\", until no cracks remain. Carefully invert disk into tart pan, centering it. Peel off and discard wax paper.",
        "Pour reserved chocolate mixture (it should be the consistency of fudge sauce) over center of peanut disk. Tilt pan to spread completely over the top, filling the gap between edges of pan and disk, until smooth. Chill until firm, about 45 minutes.",
        "Remove sides of tart pan. Carefully lift tart off bottom of pan, then slide onto a platter while removing plastic wrap. Let sit at room temperature 10 minutes, then cut into wedges."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "18 ounces milk, semisweet, and/or bittersweet chocolate (preferably 40–60% cacao), chopped",
        "1 tablespoon plus 1 1/2 teaspoons coconut or other neutral vegetable oil",
        "1 pound unsalted, dry-roasted peanuts (about 3 1/2 cups; see Cooks' Note)",
        "1 1/2 cups powdered sugar",
        "3 tablespoons creamy peanut butter",
        "1 3/4 teaspoons fine sea salt",
        "A 10\" fluted tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Peanut Butter",
        "Chocolate",
        "Candy",
        "Halloween"
    ],
    "title": "Giant Chocolate Peanut Butter Cup",
    "url": "http://www.epicurious.com/recipes/food/views/giant-chocolate-peanut-butter-cup"
}
