{
    "directions": [
        "Line a 10-inch round cake pan with plastic wrap.",
        "Mix ground beef, onion, steak sauce, Worcestershire sauce, salt, and pepper together in a bowl. Press beef mixture firmly into prepared cake pan to form a giant beef patty. Cover pan with plastic wrap and refrigerate until firm, about 2 hours.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Lightly oil a pizza peel. Remove plastic wrap from top of beef patty and invert pan on top of pizza peel to release patty from the pan. Remove remaining plastic wrap. Use a grill spatula and a slight shaking motion to gently slide the patty from the pizza peel onto the preheated grill.",
        "Cook beef patty on the preheated grill until browned on one side, 7 to 10 minutes. Use the grill spatula and pizza peel to carefully flip the patty. Place cheese and bacon slices on top of the burger and cook until burger is firm and no longer pink in the center, about 10 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
        "Place the bottom half of the king cake on a serving platter. Place the burger on top of the bottom king cake 'bun' and place the top half of the king cake on the burger. Spread reserved icing over the top 'bun' and sprinkle purple, yellow, and green decorating sugars over the top."
    ],
    "ingredients": [
        "3 pounds ground beef",
        "1 yellow onion, chopped",
        "2 tablespoons steak sauce",
        "2 tablespoons Worcestershire sauce",
        "salt and ground black pepper to taste",
        "2 tablespoons vegetable oil, or as needed",
        "1 pound Cheddar cheese, thinly sliced",
        "1 pound cooked bacon strips",
        "1 Mardi Gras King Cake (see footnote), sliced in half horizontally, icing reserved",
        "2 tablespoons purple decorating sugar",
        "2 tablespoons yellow decorating sugar",
        "2 tablespoons green decorating sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Giant King Cake Burger",
    "url": "http://allrecipes.com/recipe/236808/giant-king-cake-burger/"
}
