{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch springform pan.",
        "In a large bowl, stir together the cake mix and instant pudding.  Make a well in the center and pour in the eggs, oil and water. Mix until well blended. Spread evenly into the prepared pan.",
        "Bake for 45 to 50 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool cake completely on a wire rack before removing from pan.",
        "Slice a 1 inch thick slice off of the top of the cake and set aside. Scoop out the cake for  the center of the bottom part to within 1 inch of the sides. Discard or save for another use. To make the filling, whisk together the flour and milk. Cook over medium heat, stirring constantly until thickened. Set aside to cool completely.",
        "Once the flour and milk mixture has cooled, beat the 1/2 cup shortening, butter, sugar and vanilla on high speed until light and fluffy. Add the milk mixture and continue to beat for 4 more minutes. Spoon into the center of the cake and replace the layer sliced from the top.",
        "Combine the chocolate chips, 1/4 cup shortening, corn syrup and water in the top of a double boiler. Heat, stirring frequently  until melted and smooth. Pour warm glaze over the top of the cake and smooth over the sides. Refrigerate until serving."
    ],
    "ingredients": [
        "1 (18.25 ounce) package devil's food cake mix",
        "1 (3.9 ounce) package instant chocolate pudding mix",
        "4 eggs",
        "1 1/4 cups water",
        "1/2 cup vegetable oil",
        "1/4 cup all-purpose flour",
        "1 cup milk",
        "1/2 cup shortening",
        "1/2 cup butter",
        "1 cup white sugar",
        "2 teaspoons vanilla extract",
        "1 cup chocolate chips",
        "1/4 cup shortening",
        "3 tablespoons light corn syrup",
        "2 1/4 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Giant Ding Dong Cake",
    "url": "http://allrecipes.com/recipe/27511/giant-ding-dong-cake/"
}
