{
    "directions": [
        "Line bottom and sides of loaf pan with foil, leaving an overhang on all sides. Lightly coat foil with nonstick spray.",
        "Gently stir sugar and 1/4 cup water in a large saucepan. Heat over medium and cook, brushing down sides of pan with a wet pastry brush if needed and swirling pan gently (do not stir), until sugar is amber-brown, 15–20 minutes. Remove from heat.",
        "Carefully add cream in a steady stream, stirring with a silicone spatula (it will bubble up violently); if it looks like it may boil over, stop adding cream and stir to break up bubbles. Stir in butter until melted and smooth.",
        "Fit saucepan with candy thermometer and heat over medium. Cook, undisturbed, until mixture reaches 245°F (almost firm-ball stage). Immediately add peanuts and salt and carefully stir to combine. Quickly transfer peanut mixture to prepared pan and press into an even layer with a spatula. Let sit at room temperature until set, at least 1 hour and up to overnight.",
        "Beat egg whites in a stand mixer fitted with the whisk attachment on medium speed until soft peaks form. Meanwhile, fit a small saucepan with candy thermometer. Pour 1/2 cup water into saucepan, add sugar, and gently stir to combine. Heat over medium and cook, stirring, until sugar dissolves. Bring to a boil and continue to cook, brushing down sides of pan with a wet pastry brush if needed and swirling pan gently (do not stir), until mixture reaches 255°F. Return mixer speed to medium, then add sugar mixture in a slow, steady stream to egg whites down side of bowl.",
        "Increase mixer speed to medium-high and continue to beat until bowl feels warm to the touch and mixture is thick, tacky, and opaque white, about 8 minutes. Add peanut butter and salt and fold gently with a spatula until incorporated.",
        "Scoop peanut butter mixture onto peanut caramel; gently press into an even layer. Let sit at room temperature until set, at least 1 hour and up to overnight.",
        "Heat chocolate in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until melted. Remove from heat and, stirring constantly, add oil. Let cool, stirring occasionally, until chocolate firms slightly, about 10 minutes.",
        "Pour one-third of chocolate mixture over nougat; reserve remaining chocolate mixture at room temperature. Chill until set, at least 20 minutes.",
        "Cut a piece of parchment roughly the same size as top of loaf pan; press over set chocolate. Place a wire rack over pan. Holding pan and rack together, invert quickly. Remove pan, then peel off parchment. Set rack inside a rimmed baking sheet lined with waxed paper.",
        "Slowly pour reserved chocolate mixture over loaf; coat tops completely and let run down sides (use an offset spatula to coat sides completely if needed), pouring a little extra down center of bar. If you run out of chocolate mixture, carefully lift rack off pan, then remove waxed paper with chocolate drippings. Return rack to pan and pour chocolate drippings over. Chill until firm, about 45 minutes.",
        "Let sit at room temperature 10 minutes, then cut crosswise into 16–20 slices.",
        "Bar can be made 3 days ahead; loosely cover and chill."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/4 cups sugar",
        "2/3 cup heavy cream",
        "2 tablespoons unsalted butter",
        "1 3/4 cups unsalted, dry-roasted peanuts (see Cooks' Note)",
        "3/4 teaspoon fine sea salt",
        "2 large egg whites",
        "1 3/4 cups sugar",
        "1/2 cup creamy peanut butter, room temperature",
        "1/2 teaspoon fine sea salt",
        "12 ounces milk, semisweet, and/or bittersweet chocolate (preferably 40–60% cacao), chopped",
        "1 tablespoon coconut or other neutral vegetable oil",
        "A 9x5\" loaf pan; a candy thermometer; a stand mixer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Halloween",
        "Chocolate",
        "Peanut",
        "Peanut Butter",
        "Dessert",
        "Candy",
        "Butterscotch/Caramel"
    ],
    "title": "Giant Chocolate Candy Bar With Peanuts and Nougat",
    "url": "http://www.epicurious.com/recipes/food/views/giant-chocolate-candy-bar-with-peanuts-and-nougat"
}
