{
    "directions": [
        "Preheat oven to 350°F. Butter a 13x9\" baking pan, line bottom and sides with parchment paper, and butter parchment.",
        "Using an electric mixer on medium speed, beat 1 cup butter in a large bowl until creamy. Add sugar and beat, scraping bowl occasionally, until incorporated. Beat in salt, then vanilla. Reduce mixer speed to low and gradually beat in flour, scraping bowl occasionally, until dough just starts to form and large pieces of flour remain.",
        "Press dough into prepared pan in an even layer. Poke holes all over with a fork. Bake cookie until golden brown and firm to the touch, 30–35 minutes. Transfer to a wire rack and let cool.",
        "Heat cream, butter, and salt in a heatproof measuring cup or bowl in a microwave until cream is warm and butter is melted, about 45 seconds.",
        "Gently stir sugar and 1/3 cup water in a large saucepan. Heat over medium and cook, brushing down sides of pan with a wet pastry brush if needed and swirling pan gently (do not stir), until sugar is amber-brown, 15–20 minutes. Remove from heat.",
        "Carefully add cream mixture in a steady stream, stirring with a silicone spatula (it will bubble up violently); if it looks like it may boil over, stop adding cream mixture and stir to break up bubbles.",
        "Fit saucepan with candy thermometer and heat over medium. Cook, undisturbed, until mixture reaches 245°F (almost firm-ball stage). Immediately and carefully pour over cookie. Tilt pan to spread caramel evenly. Let sit until set, at least 1 hour and up to overnight.",
        "Heat chocolate in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until melted. Remove from heat and, stirring constantly, add oil. Let cool, stirring occasionally, until chocolate firms slightly, about 10 minutes.",
        "Place a sheet of parchment paper over cake pan. Place cutting board over parchment. Holding pan and board, invert quickly. Lift off pan, then peel off parchment.",
        "Pour one-third of chocolate mixture over cookie; reserve remaining chocolate mixture at room temperature, stirring occasionally. Spread chocolate mixture evenly with an offset spatula until cookie is coated. Chill until set, about 15 minutes.",
        "Using an oiled knife, cut cookie in half lengthwise. Carefully invert bars, caramel side up, and transfer to a wire rack set inside a rimmed baking sheet lined with waxed paper, spacing 2\" apart.",
        "Slowly pour reserved chocolate mixture over bars; coat tops completely and let run down sides (use an offset spatula to coat sides completely if needed). If you run out of chocolate mixture, carefully lift rack off pan, then remove waxed paper with chocolate drippings. Return rack to pan and pour chocolate drippings over. Create a swoopy texture in chocolate with offset spatula, if desired. Chill until firm, about 45 minutes.",
        "Let sit at room temperature 10 minutes, then slice each bar crosswise into 10–12 pieces.",
        "Cookie bars can be made 3 days ahead; loosely cover and chill."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
        "1/2 cup sugar",
        "1/2 teaspoon fine sea salt",
        "2 teaspoons vanilla extract",
        "2 cups all-purpose flour",
        "1 cup heavy cream",
        "4 tablespoons unsalted butter, cut into pieces",
        "3/4 teaspoon fine sea salt",
        "1 3/4 cups sugar",
        "1 pound milk, semisweet, and/or bittersweet chocolate (preferably 40–60% cacao), chopped",
        "2 tablespoons plus 1 teaspoon coconut or other neutral vegetable oil",
        "A candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Halloween",
        "Candy",
        "Butterscotch/Caramel",
        "Chocolate",
        "Cookies",
        "Dessert"
    ],
    "title": "Giant Chocolate Caramel Cookie Bars",
    "url": "http://www.epicurious.com/recipes/food/views/giant-chocolate-caramel-cookie-bars"
}
