{
    "directions": [
        "Chop liver and transfer to small bowl; cover and refrigerate. Bring broth, neck, heart, and gizzard to boil in heavy large saucepan. Reduce heat to medium; simmer 1 hour. Strain broth into medium bowl; reserve. Remove meat from neck; place in small bowl. Chop heart and gizzard; add to bowl with neck meat.",
        "Heat 2 tablespoons oil in medium skillet over medium heat. Add onion and garlic; sauté until tender, about 3 minutes. Add reserved liver; sauté until cooked through, about 4 minutes. Add chopped neck meat, heart, and gizzard, 1 1/2 cups of reserved broth, and 1/4 cup oil. (Dressing can be made 2 days ahead; cover and refrigerate dressing and any remaining broth separately.)",
        "Preheat oven to 400°F. Divide bread cubes between 2 rimmed baking sheets. Drizzle 2 tablespoons oil over bread on each sheet; toss to coat. Toast bread in oven until golden brown, turning once, about 10 minutes. Transfer to large bowl.",
        "Add mushrooms, celery, celery root, 1 tablespoon parsley, and oregano to bread. Bring dressing to simmer; remove from heat. Stir in vinegar. Pour dressing over bread mixture; toss. If desired, drizzle remaining broth by tablespoonfuls over bread mixture to moisten. Sprinkle remaining chopped parsley over. Let stand at least 10 minutes and up to 1 hour."
    ],
    "ingredients": [
        "Giblets (liver, neck, heart, and gizzard) from 1 turkey",
        "4 cups low-salt chicken broth",
        "10 tablespoons vegetable oil, divided",
        "1/4 cup minced onion",
        "1 garlic clove, minced",
        "11 cups 1/2-inch cubes country white bread with crust (about 1 pound)",
        "1 6-ounce package crimini (baby bella) mushrooms, thinly sliced",
        "1/2 cup 1/4-inch cubes celery",
        "1/2 cup 1/4-inch cubes peeled celery root (celeriac)",
        "2 tablespoons chopped fresh parsley, divided",
        "1 tablespoon dried oregano",
        "2 1/2 tablespoons Sherry wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Poultry",
        "turkey",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Giblet and Mushroom Bread Salad",
    "url": "http://www.epicurious.com/recipes/food/views/giblet-and-mushroom-bread-salad-233156"
}
