{
    "directions": [
        "Gingerbread House:",
        "In a large mixing bowl, cream the butter, brown sugar, molasses, cinnamon, ginger, cloves and baking soda together until the mixture is smooth. Blend in the flour and water to make a stiff dough. Chill at least 30 minutes or until firm.",
        "Preheat oven to 375 degrees F.",
        "Cut out the following paper patterns for the gingerbread house template:",
        "Two rectangles, 3 by 5 inches, to make the front and back of the house. Two rectangles, 3 by 5 1/2 inches for the roof. Two pieces for the ends of the house, 3 inches wide at the base, 3 inches to the roof line, and slanted to a peak 5 1/2 inches from the bottom. Four smaller rectangles, 1 1/2 by 1 inch for the roof and sides of the entryway. And one piece, 2 inches wide at the base, 1 1/2 inches to the roof line, and slanted to a peak 2 1/2 inches from the bottom for the front of the entryway.",
        "Roll gingerbread dough out to edges on a large, rimless cookie sheet. Place paper patterns onto the rolled out dough. With a sharp, straight edged knife, cut around each of the pieces, but leave pieces in place.",
        "Bake at 375 degrees F for about 15 minutes until dough feels firm.",
        "Place patterns on top of the gingerbread again and trim shapes, cutting edges with a straight-edged sharp knife. Leave to cool on baking sheet.",
        "Place royal icing into pastry bag with a writing tip and press out to decorate individual parts of house, piping on decorations, windows, door, etc., as desired. Let dry until hardened.",
        "Glue sides, front and back of house together at corners using royal icing. Place an object against the pieces to prop up until icing is dry (it only takes a few minutes).",
        "Glue the two roof pieces to the pitched roofline of the house. Then, similarly, glue the sides and roof of the entryway together with icing. Attach the entryway to the front of the house.",
        "Continue decorating the house, gluing on gumdrops, licorice and peppermint, as desired.",
        "Mix all of the ingredients together using an electric hand mixer, until the icing is smooth and thin enough to be pressed through a pastry bag with a writing tip. Add more lemon juice, if necessary."
    ],
    "ingredients": [
        "1/2 cup (1 stick) butter, at room temperature",
        "1/2 cup dark brown sugar",
        "1/4 cup light molasses or dark corn syrup",
        "1 tablespoon cinnamon",
        "1 tablespoon ground ginger",
        "1 1/2 teaspoons ground cloves",
        "1 teaspoon baking soda",
        "2 cups all-purpose flour",
        "2 tablespoons water",
        "Melted white chocolate or Royal Icing, recipe follows",
        "Gumdrops, licorice and peppermint, as desired",
        "1 pound (3-3/4 cups) powdered sugar, sifted if lumpy",
        "1 to 2 large egg whites, or substitute 4 teaspoons packaged egg whites and 1/4 cup water",
        "1 teaspoon almond extract, vanilla or lemon juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Mixer Recipes",
        "American",
        "European Recipes",
        "Scandinavian Recipes",
        "Frosting Recipes",
        "Gingerbread",
        "Christmas",
        "Holiday",
        "Dairy Recipes",
        "Nut Recipes",
        "Winter",
        "Kid-Friendly"
    ],
    "title": "Gingerbread House",
    "url": "http://www.foodnetwork.com/recipes/gingerbread-house-recipe"
}
