{
    "directions": [
        "Preheat oven to 350°F. Butter and flour three nonstick 9-inch-diameter cake pans with 1 1/2-inch-high sides. Bring cola to boil in heavy medium saucepan. Remove from heat; whisk in baking soda, then molasses. Transfer to large bowl; cool to room temperature. Whisk flour and next 6 ingredients in medium bowl to blend. Whisk sugar, oil, and eggs into molasses mixture. Whisk in dry ingredients. Divide batter among prepared pans (about 1 2/3 cups batter for each).",
        "Bake cakes until tester inserted into center comes out clean, about 18 minutes. Cool cakes in pans on racks 15 minutes. Turn cakes out onto racks; cool cakes completely.",
        "Bring first 5 ingredients to boil in heavy large skillet, stirring to dissolve sugar. Scrape in seeds from vanilla bean; add bean. Add kumquats; reduce heat to medium and simmer until almost tender, stirring often, about 6 minutes. Using slotted spoon, transfer kumquats to plate. Boil syrup until reduced to 2/3 cup, stirring often, about 8 minutes. Cool syrup.",
        "Stir brown sugar and whipping cream in heavy small saucepan over medium heat until sugar dissolves; cool caramel completely. Transfer 1/4 cup caramel to small bowl and reserve. Using electric mixer, beat cream cheese, butter, and vanilla in large bowl until smooth. Beat remaining caramel into frosting until well blended.",
        "Chop enough candied kumquats to measure 1/3 cup; mix in small bowl with 1 tablespoon kumquat syrup. Place 1 cake layer on platter. Spread 3/4 cup frosting over. Dot with half of chopped-kumquat mixture. Drizzle with half of reserved caramel. Top with second cake layer. Spread 3/4 cup frosting over. Dot with remaining chopped-kumquat mixture. Drizzle with remaining reserved caramel. Top with third cake layer. Spread remaining frosting over top and sides of cake. Arrange enough sliced kumquats in single layer atop cake just to cover. Mix pecans and ginger in small bowl. Press nut mixture halfway up sides of cake. Chill 1 hour. (Cake can be made 1 day ahead. Cover cake with cake dome; chill overnight. Cover remaining kumquat syrup; let stand at room temperature.) Drizzle some kumquat syrup over kumquats atop cake. Serve cake cold or at room temperature."
    ],
    "ingredients": [
        "1 cup cola",
        "1 1/2 teaspoons baking soda",
        "1 cup mild-flavored (light) molasses",
        "2 cups all purpose flour",
        "2 tablespoons ground ginger",
        "1 1/2 teaspoons baking powder",
        "1 1/4 teaspoons ground cinnamon",
        "3/4 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "1 cup (packed) dark brown sugar",
        "3/4 cup vegetable oil",
        "3 large eggs",
        "1 cup water",
        "3/4 cup honey",
        "1/4 cup sugar",
        "15 whole cloves",
        "2 cinnamon sticks, broken in half",
        "1 vanilla bean, split lengthwise",
        "22 ounces kumquats, cut into 1/4-inch-thick rounds, seeded",
        "1 1/3 cups (packed) dark brown sugar",
        "1/2 cup plus 1 tablespoon whipping cream",
        "2 8-ounce packages cream cheese, room temperature",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 tablespoon vanilla extract",
        "1 cup pecans, toasted, chopped",
        "1/3 cup chopped crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Winter",
        "Kumquat",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingerbread Layer Cake with Candied Kumquats",
    "url": "http://www.epicurious.com/recipes/food/views/gingerbread-layer-cake-with-candied-kumquats-108970"
}
