{
    "directions": [
        "Combine the milk, cream, lemon zest and 1/2 cup of the sugar in a heavy saucepan. Cook, stirring frequently, over medium heat until almost simmering. In a bowl, whisk together the egg yolks, the remaining 1/2 cup sugar, and the salt in a bowl. Slowly pour the hot liquid into the egg mixture, whisking as you pour. Return the mixture to the saucepan. Cook, over medium-low heat, stirring constantly with a heat-resistant plastic or a wooden spatula, until the custard reaches 175°F and lightly coats the spatula.",
        "Strain the custard into a clean bowl and cool over an ice bath until room temperature. Stir in the lemon juice. Refrigerate the custard for at least 4 hours or up to overnight. Churn in an ice cream machine according to the manufacturer's instructions. Freeze until scoopable, about 4 hours, depending on your freezer.",
        "Sift together the flour, baking soda, cinnamon, ginger, white pepper, and allspice. Stir in the salt.",
        "Beat the butter, 1/4 cup of the granulated sugar, and the brown sugar together until smooth. Stir in the egg. Mix in the molasses. Stir in the dry ingredients in 2 additions. Refrigerate the dough until very firm, at least 3 hours.",
        "Divide the dough in half, wrap each half in plastic wrap, and refrigerate the dough for at least 2 hours or up to 4 days. When firm, roll the dough on a lightly sugared work surface into two 9-inch-long logs.",
        "Preheat the oven to 350°F. Line 3 baking pans with parchment paper. Cut the dough into 1/2-inch-thick slices. There should be at least 24 cookies. Put the remaining 1/4 cup granulated sugar in a bowl. Coat the cookies with the sugar. Place the cookies 2 1/2 inches apart on the prepared pans. Bake the cookies until set and no longer wet looking, 10 to 12 minutes. They will be puffy when you take them out of the oven and will sink as they cool.",
        "Place 12 of the cookies, bottom side up, on the work surface. Place a large scoop of ice cream on each. Top with a second cookie, bottom side against the ice cream, and gently press to adhere the sandwiches together. Serve immediately, or freeze until ready to serve. Once frozen, wrap well in plastic wrap or store in an airtight container."
    ],
    "ingredients": [
        "1 1/2 cups whole milk",
        "3 cups heavy (whipping) cream",
        "Zest stripped from 2 lemons",
        "1 cup sugar",
        "6 large egg yolks",
        "1/4 teaspoon kosher salt",
        "2 teaspoons freshly squeezed lemon juice",
        "1 cup all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/8 teaspoon ground white pepper",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon kosher salt",
        "4 ounces (8 tablespoons) unsalted butter, softened",
        "1/2 cup granulated sugar",
        "1/4 cup firmly packed brown sugar",
        "1 large egg",
        "3 tablespoons molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Family Reunion",
        "Potluck",
        "Lemon Juice"
    ],
    "title": "Gingersnap Lemon Ice Cream Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/gingersnap-lemon-ice-cream-sandwiches-354449"
}
