{
    "directions": [
        "Whisk 2 cups water and 2 tablespoons red miso in medium saucepan. Add shiitake mushrooms and simmer over medium heat until mushrooms are soft, about 5 minutes. Stir in dark and pale green onion tops. Cover to keep warm and set aside.",
        "Meanwhile, mix 2 tablespoons red miso, minced white part of green onion, 2 tablespoons vegetable oil, and minced fresh ginger in small bowl. Sprinkle striped bass fillets with salt and pepper. Spread ginger mixture over 1 side of bass fillets, pressing to adhere. Sprinkle panko over coated side of fillets; press to adhere.",
        "Heat 2 tablespoons vegetable oil in medium nonstick skillet over medium-high heat. Add fillets to skillet, coated side down, and sauté until brown and crisp, about 3 minutes. Turn fillets over and sauté until cooked through, about 3 minutes. Divide shiitake mushroom broth and shiitake mushrooms between 2 shallow bowls. Place 1 fish fillet in center of each bowl. Sprinkle chopped fresh cilantro over and serve."
    ],
    "ingredients": [
        "2 cups water",
        "4 tablespoons red miso (aka-miso), divided",
        "4 large shiitake mushrooms (about 4 ounces), stemmed, thinly sliced",
        "3 green onions, dark and pale green part thinly sliced, white part minced",
        "4 tablespoons vegetable oil, divided",
        "1 tablespoon minced peeled fresh ginger",
        "2 6-ounce skinless striped bass fillets",
        "1/4 cup panko (Japanese breadcrumbs)",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Mushroom",
        "Soy",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Seafood",
        "Bass",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free"
    ],
    "title": "Ginger-Miso Striped Bass in Shiitake Mushroom Broth",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-miso-striped-bass-in-shiitake-mushroom-broth-236782"
}
