{
    "directions": [
        "In the bowl of a standing mixer fitted with the paddle attachment, beat the butter on medium-low speed for about 5 minutes, until a thick, smooth paste forms. Add the egg and vanilla seeds and mix until combined.",
        "Meanwhile, in a separate bowl, sift together the flour, confectioners' sugar, ginger, and curry powder; sprinkle the kosher salt over the top. With the mixer on low speed, slowly add the dry ingredients to the butter and mix until just combined.",
        "Divide the dough between 2 sheets of parchment and form into long thin logs, about 1 1/2 inches in diameter. Fold the paper over the dough roll and use a pastry scraper to tighten the dough log. Use your hands to smooth and form the dough into as perfect a cylinder as you can. Refrigerate until firm.",
        "When ready to bake, preheat the oven to 350°F. Line 2 baking sheets with silicone baking mats or parchment paper.",
        "Using 2 hands, roll the dough logs firmly on a work surface to round out any edges. Sprinkle the Demerara sugar onto another baking sheet. Unwrap the dough and, using a pastry brush, brush the surface with beaten egg yolk. Roll the dough in the sugar and slice it with a sharp knife into 1/4-inch-thick slices. Brush the surface of each cookie with beaten yolk, sprinkle a few flakes of Maldon salt on top, and press a piece of crystallized ginger into the center of each cookie.",
        "Space the cookies about 1 inch apart on the lined baking sheets and bake for 15 to 16 minutes, rotating the pans halfway through, until the edges are just beginning to turn golden. Cool in the pan for 10 minutes before transferring to a rack to cool completely. Store in an airtight container for up to 5 days."
    ],
    "ingredients": [
        "10 tablespoons (1 1/4 sticks) cold unsalted butter, diced (140 grams)",
        "1 large egg",
        "Seeds from 1 vanilla bean",
        "1 1/2 cups plus 1 tablespoon all-purpose flour (208 grams)",
        "3/4 cup confectioners' sugar (90 grams)",
        "1 1/2 teaspoons ground ginger (3 grams)",
        "1 teaspoon mild curry powder (2 grams)",
        "1/2 teaspoon kosher salt (2 grams)",
        "Demerara sugar, for rolling",
        "2 large egg yolks, beaten",
        "Maldon sea salt, for sprinkling",
        "24 one-inch slices crystallized ginger, halved crosswise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Ginger",
        "Dessert",
        "Curry"
    ],
    "title": "Ginger-Curry Sugar Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-curry-sugar-cookies-51254210"
}
