{
    "directions": [
        "In a large bowl, whisk together the flour, baking soda, salt, cinnamon, cloves, and ginger; set aside.",
        "In the bowl of a standing mixer fitted with the paddle attachment, beat together the sugar and butter on medium speed until light and fluffy, 2 to 3 minutes, scraping down the sides of the bowl halfway through. Beat in the egg and molasses until combined. Reduce the mixer speed to low and gradually add the flour mixture, beating until combined. Transfer the dough to a clean bowl, cover with plastic wrap, and refrigerate until well chilled, about 1 hour (and up to 24 hours).",
        "Arrange the oven rack in the middle position. Preheat the oven to 350°F. Line two baking sheets with parchment paper or nonstick silicone baking mats; set aside. Place the extra sugar for rolling on a plate; set aside.",
        "Use a 1 1/2-inch ice cream scoop to scoop out the dough, and roll into balls between your hands. Roll the balls in the sugar to coat, and place about 2 inches apart on the prepared baking sheets.",
        "Bake one sheet at a time, rotating the sheet two-thirds of the way through the baking time, until the cookies are deep golden brown and the centers are firm, 15 to 20 minutes.",
        "Transfer the sheet to a wire rack to cool for 10 minutes. Use a spatula to transfer the cookies to the rack, and let cool completely. Continue to roll and bake the remaining cookies in the same way."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/4 teaspoon coarse salt",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground ginger",
        "1 cup sugar, plus 3/4 cup for rolling",
        "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature",
        "1 large egg, at room temperature",
        "1/4 cup unsulfured molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Picnic",
        "Kid-Friendly",
        "Back to School",
        "Birthday",
        "Family Reunion",
        "Chill",
        "Edible Gift",
        "Clove",
        "Party",
        "Advance Prep Required",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-cookies-363435"
}
