{
    "directions": [
        "In a shallow bowl stir together marinade ingredients.",
        "Add filets to marinade, turning to coat, and marinate at room temperature 15 minutes. Remove filets from marinade, letting excess drip off, and reserve marinade. In a 10-inch non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté filets about 4 minutes on each side for medium-rare meat. Transfer filets to a cutting board.",
        "In any drippings remaining in skillet cook mushrooms with salt, stirring frequently, until golden, about 3 minutes. Add reserved marinade, water, and honey and bring to a boil. Remove skillet from heat and cool mixture 10 minutes.",
        "In a large bowl combine cabbage, mizuna or arugula, bell pepper, pear, scallions, and all but 4 sprigs coriander. Add mushroom mixture and toss to coat. Cut filets into thin slices. Mound cabbage mixture on 4 dinner plates and arrange steak slices on top. Garnish with reserved coriander sprigs."
    ],
    "ingredients": [
        "2 tablespoons soy sauce",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon red-wine vinegar",
        "1 tablespoon grated peeled fresh gingerroot",
        "1 garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "1/4 teaspoon dried hot red pepper flakes, or to taste",
        "two 1-inch-thick filets mignons (3/4 pound), any fat trimmed",
        "2 teaspoons vegetable oil",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps sliced",
        "1/2 teaspoon salt",
        "1/4 cup water",
        "1 tablespoon honey",
        "1 small Napa cabbage (about 1 1/2 pounds), trimmed and sliced thin crosswise",
        "1 cup packed >I<mizuna >/I",
        "1 medium red bell pepper, cut into thin strips",
        "1 Asian pear or firm-ripe Bosc pear, cut into 1/4-inch julienne strips",
        "2 scallions, sliced thin",
        "1/2 cup packed fresh coriander sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gourmet"
    ],
    "title": "Gingered Steak and Napa Cabbage Salad",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-steak-and-napa-cabbage-salad-13052"
}
