{
    "directions": [
        "Fill a 4-quart kettle three fourths full with water and bring to a boil. Cook noodles in boiling water until tender, about 3 minutes, and drain in a colander. Finely chop white and pale-green parts of scallions, reserving dark-green parts. In a bowl toss noodles with chopped scallions and 1 tablespoon each of gingerroot and oil until combined well.",
        "To cook noodle \"cakes,\" in a large nonstick skillet heat enough oil to cover bottom of skillet over moderate heat until hot but not smoking. Drop some noodles by heaping tablespoons (see note, beginning of recipe), evenly spaced, into skillet and with a fork spread to form 1 1/2 inch circles. Cook noodle cakes until golden and crisp, about 2 minutes on each side. With tongs transfer noodle cakes as cooked to paper towels to drain. Make more noodle cakes in same manner, adding more oil to skillet as needed. Noodle cakes may be made 1 day ahead and kept in an airtight container at room temperature.",
        "Pat tenderloin dry and halve lengthwise. Cut each piece in half lengthwise to form 2 long strips (4 long strips total). In a bowl whisk together lime juice, hoisin and soy sauces, and remaining tablespoon gingerroot. Put beef and hoisin mixture into a sealable heavy-duty plastic bag. Marinate beef, covered and chilled, turning bag over once or twice, at least 1 hour and up to 6.",
        "Preheat oven to 450°F.",
        "Remove beef from bag and transfer marinade to a small saucepan. Simmer marinade 2 minutes and cool completely. Ginger-hoisin sauce keeps, covered and chilled, 1 day.",
        "In a heavy skillet heat 1/2 tablespoon oil over moderately high heat until just smoking and brown beef on all sides, about 3 minutes total for each piece. Transfer beef to a small shallow roasting pan and cook in middle of oven 10 to 12 minutes for medium-rare. Transfer beef to a cutting board and let stand 20 minutes. Beef may be cooked 1 day ahead and chilled, covered.",
        "While beef is standing, cut reserved scallion greens into 1 1/2-inch-long thin julienne strips. Chill scallion greens, wrapped in a dampened paper towel, at least 10 minutes and, in a sealable plastic bag, up to 1 day.",
        "Cut beef into 1/4-inch-thick slices and top each noodle cake with 1 slice. Top beef slices with about 1/4 teaspoon sauce and a few scallion greens."
    ],
    "ingredients": [
        "1/4 pound rice noodles (rice vermicelli)",
        "8 thin scallions",
        "2 tablespoons grated peeled fresh gingerroot",
        "about 1/2 cup vegetable oil",
        "a 1-pound piece beef tenderloin",
        "1/4 cup fresh lime juice",
        "1/4 cup hoisin sauce",
        "2 tablespoons soy sauce (preferably Kikkoman)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Marinate",
        "Cocktail Party",
        "Spring",
        "Gourmet"
    ],
    "title": "Ginger-Hoisin Beef and Scallions on Crispy Noodle Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-hoisin-beef-and-scallions-on-crispy-noodle-cakes-101191"
}
