{
    "directions": [
        "Preheat the oven to 350°F. In a bowl with an electric mixer cream together the butter, 1/2 cup of the granulated sugar, and the brown sugar until the mixture is light and fluffy, add the molasses, and beat the mixture until it is smooth. In another bowl whisk together the flour, the ginger, the cinnamon, the allspice, the baking soda, and the salt, add the flour mixture to the butter mixture, and stir the mixture until it forms a soft dough. Form the dough into 24 balls (each about 1 1/2 inches in diameter), roll the balls in the additional granulated sugar, coating them, and arrange them 2 inches apart on buttered baking sheets. Bake the gingersnaps in batches in the middle of the oven for 13 to 15 minutes, until they are crisp and cracked but still soft inside, and let them cool on the sheets for 5 minutes. Transfer the gingersnaps with a metal spatula to racks and let them cool completely.",
        "Sandwich a scoop of the ice cream between 2 of the gingersnaps, pressing the cookies together, form 11 more sandwiches in the same manner, and roll the edges in the pistachios. Freeze the sandwiches on a tray, covered, until they are hard. The sandwiches may be made 2 days in advance and kept covered and frozen."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup granulated sugar plus additional for coating the cookies",
        "1/2 cup firmly packed light brown sugar",
        "1/3 cup unsulfured molasses",
        "1 large egg",
        "2 cups all-purpose flour",
        "2 1/2 teaspoons ground ginger",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon ground allspice",
        "1 teaspoon baking soda",
        "3/4 teaspoon salt",
        "Lemon Ice Cream",
        "1 cup shelled natural pistachio nuts, the loose skins rubbed off in a kitchen towel and the nuts chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Lemon",
        "Summer",
        "Gourmet"
    ],
    "title": "Gingersnap and Lemon Ice Cream Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/gingersnap-and-lemon-ice-cream-sandwiches-12039"
}
