{
    "directions": [
        "Place rib racks on work surface. Using small sharp knife, carefully pry papery membrane off underside of each rib section (use caution-it will be slippery). Place ribs on large rimmed baking sheet.",
        "Combine ginger, garlic, sugar, 1 tablespoon coarse salt, and black pepper in processor and puree to blend well. Add honey, soy sauce, and fish sauce and process until blended. Spread spiced marinade on both sides of ribs (about 2 tablespoons marinade per side for each rib section). Cover with plastic wrap and refrigerate at least 4 hours. DO AHEAD: Can be made 1 day ahead; baste ribs occasionally with accumulated marinade on baking sheet. Keep chilled.",
        "Place each of 6 very small bowls on each of 6 small plates. Place 1 teaspoon coarse salt and 1 teaspoon ground white pepper in neat mounds side by side in each bowl, then place 1 lime half on plate next to each bowl.",
        "Spray grill rack with nonstick spray. Prepare barbecue (medium heat). Spoon any juices from baking sheet with ribs over ribs before grilling. Place rib racks, rounded (meaty) side down, on grill rack. Grill ribs, uncovered, 8 minutes per side, then cover barbecue and grill until ribs are cooked through, about 8 minutes longer per side.",
        "Transfer ribs to cutting board. Cut between bones into individual ribs. Transfer ribs to platter. Before serving, allow each diner to squeeze juice from lime into bowl with coarse salt and white pepper and stir until mixed, then dip ribs into sauce.",
        "Available in the Asian foods section of most supermarkets, at some specialty foods stores, and at Asian markets."
    ],
    "ingredients": [
        "2 2 1/4-to 2 1/2-pound baby back pork rib racks, cut into 6-to 7-rib sections",
        "1/4 cup chopped peeled fresh ginger",
        "6 garlic cloves, chopped",
        "1 tablespoon sugar",
        "1 tablespoon coarse kosher salt",
        "1 tablespoon freshly ground black pepper",
        "2 tablespoons honey",
        "2 tablespoons soy sauce",
        "2 tablespoons fish sauce (such as nam pla or nuoc nam)*",
        "6 teaspoons coarse kosher salt, divided",
        "6 teaspoons ground white pepper, divided",
        "3 large limes, halved",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Kid-Friendly",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Pork Rib",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Honey",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Ginger and Honey Baby Back Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-and-honey-baby-back-ribs-353813"
}
