{
    "directions": [
        "Preheat the oven to 350°F. In a food processor grind fine the almonds with 1/4 cup of the confectioners' sugar and 1 cup of the flour, add the butter, and blend the mixture until it just resembles meal. Pat the mixture into an 8-inch-square baking pan and bake the crust in the middle of the oven for 15 to 20 minutes, or until it is pale golden. Let the crust cool completely in the pan on a rack.",
        "In the bowl of an electric mixer beat the eggs until they are thick and pale, beat in the granulated sugar and the lemon juice, and beat the mixture for 8 minutes. Sift in the remaining 2 tablespoons flour, the baking powder, the ginger, and a pinch of salt, stir the filling until it is combined well, and pour it over the crust. Bake the confection in the middle of the oven for 20 to 25 minutes, or until the filling is set and pale golden. Transfer the dessert in the pan to the rack, sift the additional confectioners' sugar over the top, and let the dessert cool completely. Cut the dessert into 2-inch squares."
    ],
    "ingredients": [
        "1/4 cup unskinned almonds, toasted lightly and cooled completely",
        "1/4 cup confectioners' sugar plus additional for sifting over the squares",
        "1 cup plus 2 tablespoons all-purpose flour",
        "1 stick (1 1/2 cup) cold unsalted butter, cut into pieces",
        "2 large eggs",
        "3/4 cup granulated sugar",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon double-acting baking powder",
        "1 teaspoon ground ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Lemon",
        "Almond",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingered Lemon Almond Squares",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-lemon-almond-squares-12534"
}
