{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray mini-muffin tins with non-stick cooking spray.",
        "Combine Mott's(R) Natural Applesauce and 2 teaspoons cinnamon in a small saucepan. Bring to a simmer over medium hear. Lower heat and continue to simmer, stirring occasionally, until thickened, about 8 minutes. Remove from heat and cool.",
        "Sift together the flour, ginger, baking soda, cinnamon, cloves, and salt.",
        "Cream together in a large bowl the margarine and 1 cup sugar until light and fluffy. Beat in the egg, then stir in the water and molasses. Gradually stir the sifted ingredients into the molasses mixture. Shape dough into walnut sized balls, and place then into prepared mini-muffin tins.",
        "Bake until light brown, 8 to 10 minutes. Allow cookies to cool in pan for 10 minutes. To make a well for the filling, press down centers of cookies with your fingertip or rounded end of a cooking utensil. Cool completely on a wire rack. If not serving immediately, store in airtight container.",
        "Prior to serving, fill cups with a small spoonful of applesauce mixture.",
        "Stir together confectioners sugar and cider. Drizzle filled cups with glaze."
    ],
    "ingredients": [
        "1 cup Mott's® Natural Applesauce",
        "2 teaspoons ground cinnamon",
        "2 1/4 cups all-purpose flour",
        "2 teaspoons ground ginger",
        "1 teaspoon baking soda",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "3/4 cup butter, softened",
        "1 cup white sugar",
        "1 egg",
        "1 tablespoon water",
        "1/4 cup molasses",
        "1/4 cup confectioners' sugar",
        "3 tablespoons apple cider vinegar",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ginger Apple Cups",
    "url": "http://allrecipes.com/recipe/240272/ginger-apple-cups/"
}
