{
    "directions": [
        "Position rack in center of oven and preheat to 250°F. Line baking sheet with parchment paper. Whisk 1 1/2 tablespoons sugar and cornstarch in small bowl to blend; set aside.",
        "Using electric mixer, beat egg whites and cream of tartar in large bowl until soft peaks form. Beat in vanilla. Gradually beat in remaining 6 1/2 tablespoons sugar, 1 tablespoon at a time; continue to beat until stiff peaks form. Sift cornstarch mixture over meringue and gently fold in with rubber spatula just until incorporated.",
        "Spoon meringue onto prepared baking sheet in 6 mounds (about 1/4 cup each), spacing apart. Using back of spoon, make indentation in center of each mound, forming each meringue into 3-inch-diameter nest. Bake meringues until crisp and barely golden on outside but still soft on inside, about 55 minutes. Using metal spatula, transfer meringues to rack and cool completely. DO AHEAD: Can be made 1 day ahead. Store in single layer in airtight container at room temperature.",
        "Combine 2 cups water, 1 1/4 cups sugar, fresh lemon juice, and sliced ginger in large saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat to medium and simmer 5 minutes. Add peeled peach halves to syrup in saucepan; remove from heat. Allow peaches to cool to room temperature in syrup, turning occasionally. Transfer peaches with syrup to medium bowl; cover and chill until cold. DO AHEAD: Peaches can be made 1 day ahead. Keep refrigerated.",
        "Remove peaches from syrup and cut each half into 6 wedges; reserve syrup.",
        "Place all berries in small bowl; add 4 tablespoons peach syrup and toss to coat.",
        "Using electric mixer, beat cream and 1 1/2 tablespoons sugar in medium bowl until soft peaks form.",
        "Place 1 meringue on each of 6 plates. Spoon whipped cream into center of each meringue, then top each with 6 peach wedges and berry mixture."
    ],
    "ingredients": [
        "1/2 cup sugar, divided",
        "2 teaspoons cornstarch",
        "2 large egg whites, room temperature",
        "1/8 teaspoon cream of tartar",
        "1/4 teaspoon vanilla extract",
        "2 cups water",
        "1 1/4 cups sugar",
        "3 tablespoons fresh lemon juice",
        "1 2-inch piece fresh ginger, peeled, thinly sliced",
        "3 firm but ripe large peaches, peeled, halved, pitted",
        "1/2 cup (generous) fresh raspberries (about half of 6-ounce basket)",
        "1/2 cup (generous) fresh blackberries (about half of 6-ounce basket)",
        "1/2 cup chilled heavy whipping cream",
        "1 1/2 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Berry",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Backyard BBQ",
        "Blackberry",
        "Raspberry",
        "Peach",
        "Spice",
        "Summer",
        "Shower",
        "Engagement Party",
        "Party",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingered-Peach Pavlovas",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-peach-pavlovas-354337"
}
