{
    "directions": [
        "Put a sheet of wax paper on a small baking sheet and put a 3-inch round cutter on it. (Alternatively, line a 3-inch ramekin with plastic wrap, leaving a 2-inch overhang.)",
        "Chop chocolate and transfer to a bowl. In a small saucepan bring cream to a boil and pour over chocolate. Stir mixture with a rubber spatula until completely smooth and pour into cutter or ramekin. Freeze ganache while preparing cake. (Ganache may be made 1 week ahead and frozen, covered.)",
        "Preheat oven to 375°F and generously butter and flour four 10-ounce mini-bundt pans (not non-stick) or ramekins, knocking out excess flour.",
        "Into a bowl sift together flour, ginger, baking soda, and salt. In a large bowl with an electric mixer beat together butter and brown sugar until light and fluffy. Beat in eggs, sour cream, and molasses until combined well. (Mixture will separate but will come together again when flour mixture is added.) Add flour mixture to egg mixture, beating until just combined (do not overbeat).",
        "Spoon about 1/2 cup batter into each pan or ramekin and bake on a baking sheet in middle of oven 20 minutes. Run a thin knife around side of cutter and remove ganache. (Alternatively, lift ganache out of ramekin using plastic wrap.) Quarter ganache and put 1 piece in center of each cake, pressing down gently (ganache will sink into cakes). Bake cakes 15 to 20 minutes more, or until set and a crust is formed on top. Cool cakes in pans or ramekins on a rack 10 minutes. (Cakes may be made 1 day ahead and kept in pans or ramekins, covered, at room temperature. Reheat cakes in a 375°F oven before serving.)",
        "Invert cakes onto plates and serve warm with crème anglaise."
    ],
    "ingredients": [
        "2 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1/4 cup heavy cream",
        "1 cup all-purpose flour",
        "2 teaspoons ground ginger",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter",
        "3/4 cup packed dark brown sugar",
        "2 large eggs",
        "1/4 cup sour cream",
        "1/4 cup unsulfured molasses",
        "Accompaniment: Ginger Crème Anglaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger Cakes with Molten Chocolate Centers and Ginger Crème Anglaise",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-cakes-with-molten-chocolate-centers-and-ginger-creme-anglaise-14595"
}
