{
    "directions": [
        "Stir sugar and 1 1/2 cups water in large saucepan over medium heat until sugar dissolves. Increase heat and bring to boil. Add kumquats; reduce heat to medium-low and simmer until soft mixture to medium bowl. Cool. Cover and chill until cold. DO AHEAD: Can be made 5 days ahead. Keep chilled.",
        "Before using, pour kumquat mixture through strainer; set kumquats aside for trifle. (Reserve syrup for another use.)",
        "Stir wine and sugar in large saucepan over medium heat until sugar dissolves. Increase heat and boil wine mixture 5 minutes. Add cranberries and simmer until soft but still intact, about 5 minutes. Transfer mixture to medium bowl. Cool. Cover and chill until cold. DO AHEAD: Can be made 5 days ahead. Keep chilled.",
        "Before using, pour cranberry mixture through strainer; set cranberries aside for trifle. (Reserve syrup for another use.)",
        "Combine stout and molasses in large saucepan. Bring to boil over medium-high heat, stirring occasionally. Remove from heat; stir in baking soda (mixture will foam up). Let stand until completely cool, about 1 hour.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 350°F. Generously butter three 8-inch-diameter cake pans with 1 1/2-inch-high sides. Dust pans with flour; tap out excess. Whisk 2 cups flour and next 6 ingredients in large bowl to blend. Whisk eggs and both sugars in medium bowl to blend. Whisk oil, then stout mixture into egg mixture. Gradually whisk stout-egg mixture into flour mixture. Stir in fresh ginger. Divide batter among prepared pans (about 12/3 cups for each).",
        "Place 2 cake pans on top rack and 1 cake pan on bottom rack of oven. Bake until tester inserted into center of cakes comes out clean, reversing position of pans halfway through baking, about 28 minutes total. Cool cakes in pans on rack 15 minutes. Invert cakes onto racks; cool completely. DO AHEAD: Can be made 1 day ahead. Wrap in plastic; store at room temperature.",
        "Using electric mixer, beat mascarpone in large bowl until smooth. Add all remaining ingredients and beat until peaks form and mixture is smooth (do not overbeat or mixture may curdle). Cover and chill up to 2 hours.",
        "Using serrated knife, cut each of 2 cakes in half horizontally for a total of 4 cake layers. (Reserve remaining cake for another use.) Trim 1 cake layer to 7-inch round. Place trimmed cake round in bottom of 7 3/4-inch-diameter, 43/4-inch-deep trifle dish. Scatter scant 1/2 cup drained kumquats in single layer over cake. Top with 11/3 cups mascarpone cream, spreading evenly to sides of dish. Sprinkle 1/2 cup drained cranberries over. Repeat 2 more times with cake layer, kumquats, mascarpone cream, and cranberries. Top with fourth cake layer. Spread 1 1/3 cups mascarpone cream over. Spoon remaining cream into pastry bag fitted with large star tip. Pipe rosettes of mascarpone cream around top edge of dish. Tent loosely with foil; chill at least 4 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Cover and chill remaining kumquats and cranberries separately.",
        "Scatter remaining kumquats and cranberries over center of trifle and serve.",
        "An Italian cream cheese; sold at many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "2 1/2 cups sugar",
        "1 1/2 cups water",
        "3 cups sliced seeded kumquats",
        "2 cups fruity red wine (such as Syrah)",
        "2 cups sugar",
        "12 ounces fresh or frozen cranberries",
        "1 cup extra stout (such as Guinness)",
        "1 cup mild-flavored (light) molasses",
        "1 1/2 teaspoons baking soda",
        "2 cups all purpose flour",
        "2 tablespoons ground ginger",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cardamom",
        "3 large eggs",
        "1/2 cup sugar",
        "1/2 cup (packed) dark brown sugar",
        "3/4 cup vegetable oil",
        "1 tablespoon minced peeled fresh ginger",
        "3 8-ounce containers mascarpone cheese* (3 cups)",
        "3 cups chilled heavy whipping cream",
        "1 1/2 cups powdered sugar",
        "3 tablespoons Grand Marnier or other orange liqueur",
        "4 teaspoons finely grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Mixer",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Cranberry",
        "Red Wine",
        "Kumquat",
        "Christmas Eve",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingerbread Trifle With Candied Kumquats and Wine-Poached Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/gingerbread-trifle-with-candied-kumquats-and-wine-poached-cranberries-350790"
}
