{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F.",
        "Butter and flour loaf pan, knocking out excess flour.",
        "Pulse ginger and 1/2 cup flour in a food processor until ginger is finely chopped.",
        "Beat butter and salt in a large bowl with an electric mixer until creamy. Add brown sugar, a little at a time, and beat until pale and fluffy. Add yolks, 1 at a time, beating well after each addition. Beat in reserved ginger syrup, then beat in chopped ginger mixture.",
        "Beat whites and a pinch of salt in another bowl with cleaned beaters until they just hold stiff peaks.",
        "Fold one fourth of whites into batter gently but thoroughly, then sift one fourth of remaining cup flour into batter and fold gently but thoroughly. Add remaining egg whites and flour alternately in 3 batches, folding in same manner.",
        "Spoon batter into loaf pan, spreading evenly. Bake until a wooden pick or skewer inserted in center of cake comes out clean, 1 1/4 to 1 1/2 hours. Cool on a rack 10 minutes, then run a thin knife around edge of pan and turn cake out onto rack to cool completely, about 1 hour.",
        "*Available at specialty foods shops and by mail order from Simpson & Vail (800-282-8327; svtea.com)."
    ],
    "ingredients": [
        "10 oz stem ginger in syrup*, drained, reserving 1/4 cup syrup, and coarsely chopped (1 cup); or see cooks' note, below",
        "1 1/2 cups all-purpose flour",
        "2 sticks (1 cup) unsalted butter, softened",
        "1/4 teaspoon salt",
        "2/3 cup packed dark brown sugar",
        "4 large eggs, separated",
        "Special equipment: 1 (8 1/2- by 4 1/2- by 2 1/2-inch) loaf pan, or see cooks' note, below"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Fall",
        "Spring",
        "Family Reunion",
        "Engagement Party",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger Cake",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-cake-231208"
}
