{
    "directions": [
        "In the bowl of an electric mixer fitted with a paddle, add the butter, sugar and orange zest and beat until smooth, 5 to 8 minutes.",
        "Meanwhile, in a medium bowl, sift together the flour, baking powder, baking soda, dry ginger, nutmeg, allspice, cinnamon, cloves and salt. Whisk to blend. Set aside.",
        "In another bowl, whisk together the eggs, molasses and lemon juice.",
        "Preheat the oven to 350 degrees F.",
        "When the butter and sugar are integrated, lower the speed of the mixer and add the dry ingredients. Add the egg mixture and when blended, remove the bowl from the machine. Divide the cookie dough in half. Press the first half of the dough in between 2 sheets of waxed paper or plastic wrap and chill for 15 minutes. Repeat with the second half. This step will make it easier to finish rolling out the dough when it has chilled. It will also mean you only have half of the dough getting warm as you roll it.",
        "Lightly flour a flat surface. Use a floured rolling pin to gently roll the first half of the dough about 1/2-inch thick. Lightly flour the cookie cutter(s) and cut the shapes, making as few scraps as possible. Use a metal spatula to gently transfer them, cookie by cookie, (the cookies should be similar size) to a baking sheet. Repeat with the other half of the dough and transfer them to another baking sheet. A note about crowding the tray(s): these particular cookies can spread a little. Leave room between the cookies. Better to use 3 baking sheets with fewer cookies than to crowd them on 2 trays. Bake until brown around the edges, 8 to 10 minutes.",
        "Got scraps? Form the scraps into a ball, press it flat and chill in the refrigerator. These cookies may be a little more \"tough\" because the dough will have been worked a little more than the others.",
        "Why not have a little frosting on your gingerbread?",
        "In a medium bowl add all of the ingredients and whisk together to combine. If too thick in consistency, add a touch more orange juice or water to thin out.",
        "Use a pastry bag fitted with a star tip to pipe the frosting between 2 of the gingerbread cookies. Press the 2 cookies halves gently together.",
        "The Variation:",
        "I love springerle, the German anise-flavored cookies, for the delicate molds (and carved rolling pins) used to make them. I have made this recipe with springerle molds with stunning results. The kind of cookies that make people marvel at how great they look before they eat a half a plate of them! Simply dust the decorative molds (or rolling pin) with flour, shaking lightly to remove any excess. Roll the dough very thin (between 1/2 and 1/4-inch thick). Press or roll the dough into the molds and trace the shapes with a sharp knife to extract the cookies. Arrange them on a greased baking sheet (with some space between them) and bake for 6 to 8 minutes. Not using molds? Scoop the batter in teaspoons and roll them into balls. Press the balls onto a greased baking sheet or press with the tines of a fork to make ridges. Bake until brown around the edges, about 10 to 12 minutes.",
        "These cookies are so beautiful, they can stand alone. Or...make gingerbread sandwiches using the above frosting as the filling..."
    ],
    "ingredients": [
        "1 1/2 sticks lightly salted butter, softened",
        "1 2/3 cups sugar",
        "1 orange, zested",
        "The dry ingredients:",
        "4 cups all-purpose flour, plus 1/2 cup additional for rolling, if needed",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1 tablespoon ground dry ginger",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground allspice",
        "2 teaspoons ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon kosher salt",
        "2 eggs",
        "1/2 cup dark molasses",
        "1 lemon, juiced",
        "Easy Orange Frosting, recipe follows",
        "1 cup powdered sugar",
        "Finely grated zest of 1 orange",
        "1 to 2 tablespoons freshly squeezed orange juice",
        "1/2 teaspoon orange liqueur",
        "1/4 teaspoon light corn syrup"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Gingerbread Cookie",
        "Cookie",
        "Gingerbread",
        "Lemon Cookie",
        "Fruit",
        "Lemon Recipes",
        "Christmas Cookie",
        "Christmas",
        "Holiday",
        "Sugar Cookie",
        "Sugar"
    ],
    "title": "Gingerbread Cookies",
    "url": "http://www.foodnetwork.com/recipes/alexandra-guarnaschelli/gingerbread-cookies-for-the-holidays-recipe"
}
