{
    "directions": [
        "Position a rack in center of oven; preheat to 250°F. Line a baking sheet with parchment paper. Using an electric mixer, beat egg whites and cream of tartar in a large bowl until soft peaks form. Beat in vanilla. Gradually beat in cornstarch, then sugar, 1 tablespoon at a time; continue to beat until stiff peaks form. Fold in pistachios. Spread meringue on parchment paper in a 1/3\" layer (meringue will not completely cover parchment). Bake meringue until crisp, about 55 minutes. Let cool, then break into small pieces. DO AHEAD: Can be made 1 day ahead. Store airtight.",
        "Combine sugar, ginger, and 1/4 cup water in a small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a boil over medium heat, stirring until sugar dissolves. Remove saucepan from heat and let infuse for 30 minutes. Discard bean. Cover and chill ginger syrup.",
        "In a small bowl, whisk together yogurt, cream, and ginger syrup just to blend. Place mixture in a whipped-cream canister. DO AHEAD: Can be made 4 hours ahead. Chill. Dispense into bowls according to manufacturer's instructions. (Alternatively, double ingredients and whip chilled cream until stiff peaks form, then whip in yogurt and syrup. Spoon the mixture into bowls.) Top with crumbled pistachio meringue. Garnish with pistachios."
    ],
    "ingredients": [
        "2 large egg whites, room temperature",
        "1/8 teaspoon cream of tartar",
        "1/2 teaspoon vanilla extract",
        "2 teaspoons cornstarch",
        "1/2 cup sugar",
        "1/4 cup chopped natural pistachios",
        "1/3 cup sugar",
        "1 2\" piece peeled ginger, cut into 1/4\" slices",
        "1 vanilla bean, split lengthwise",
        "1 cup low-fat plain yogurt",
        "1 cup heavy cream",
        "1 tablespoon chopped natural pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Egg",
        "Ginger",
        "Dessert",
        "Yogurt",
        "New Year's Eve",
        "Pistachio",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger-Yogurt Mousse with Pistachio Meringue",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-yogurt-mousse-with-pistachio-meringue-367714"
}
