{
    "directions": [
        "Rinse rice in several changes of cold water in a large bowl until water runs clear. Drain in a colander.",
        "Transfer rice to a 4-quart heavy saucepan, then add water (3 1/3 cups) and bring to a boil. Reduce heat to low and cook, covered, until steam holes appear on surface and water is absorbed, about 13 minutes. Remove from heat and let stand, tightly covered and undisturbed, 5 minutes. Fluff rice with a fork and spread in a large shallow baking pan to cool quickly, about 45 minutes. Chill, covered with plastic wrap, at least 4 hours.",
        "Heat a wok or 12-inch heavy skillet over moderate heat until a drop of water vaporizes instantly. Pour oil around side of wok, then tilt wok to swirl oil, coating side. When oil just begins to smoke, stir-fry ginger, white and pale green parts of scallions, and salt until fragrant, about 1 minute. Crumble rice into wok and stir-fry until lightly browned, 10 to 12 minutes. Remove from heat, then add scallion greens, pineapple, and sesame oil, tossing to combine. Season with salt."
    ],
    "ingredients": [
        "2 1/2 cups long-grain white rice",
        "3 1/3 cups water",
        "1/4 cup peanut or vegetable oil",
        "3 tablespoons finely grated (with a rasp) peeled fresh ginger",
        "5 scallions (white and pale green parts separated from greens), finely chopped",
        "1 1/2 teaspoons kosher salt",
        "3/4 cup diced (1/4 inch) cored peeled fresh pineapple (labeled \"extra sweet\")",
        "1 teaspoon Asian sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Fruit",
        "Ginger",
        "Rice",
        "Vegetable",
        "Side",
        "Stir-Fry",
        "Quick & Easy",
        "Pineapple",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Ginger Pineapple Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-pineapple-fried-rice-235030"
}
