{
    "directions": [
        "Whisk the flour, ginger, baking soda, cinnamon, allspice, mustard, salt and black pepper together in a medium bowl.",
        "Beat the butter and the sugars with a hand mixer electric mixer on medium-high until light and fluffy, about 2 minutes. Scrape down the sides of the bowl. Add the egg yolk and vanilla and beat on medium speed until just incorporated, about 20 seconds. Add the molasses and ginger preserves and continue beating until the batter is an even light brown color, 30 seconds more.",
        "Add the dry ingredients all at once, beating slowly to make a soft, smooth dough. Use a rubber spatula to make sure all ingredients are combined. Then beat again for 20 seconds. Cover the bowl with plastic and refrigerate the dough until firm, about 25 minutes.",
        "Put about 1/2 cup sugar in a small bowl. With a cookie scoop or a small ice cream scoop, portion the dough into a slightly heaping tablespoon for each cookie. Roll the dough, by hand, into balls. Roll the tops of the balls in the sugar, and space them 2 inches apart on a nonstick or lightly oiled cookie sheet. Refrigerate until firm, about 25 minutes. (The chilling is what gives this cookie a beautiful, crackly crunch on top, and a soft, chewy center.)",
        "Preheat oven to 375 degrees F.",
        "Bake until the top is crackly, and the insides peeking out through are dark and moist but not raw, about 15 to 20 minutes. Briefly cool the cookies on the baking sheets, then transfer to racks to cool completely.",
        "Serve or store in a tightly sealed container for up to 3 weeks."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 1/2 teaspoons ground ginger",
        "1 1/4 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground mustard",
        "1/2 teaspoon fine salt",
        "5 cracks freshly ground black pepper",
        "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature",
        "1/2 cup sugar, plus more for rolling the cookies",
        "1/4 cup dark brown sugar",
        "1 large egg yolk",
        "1 teaspoon pure vanilla extract",
        "1/2 cup unsulphured molasses",
        "2 tablespoons ginger preserves (see Cook's Note)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Christmas Cookie",
        "Christmas",
        "Cookie",
        "Holiday",
        "Baking",
        "American",
        "Sugar Cookie",
        "Sugar",
        "Dairy Recipes"
    ],
    "title": "Ginger Cookie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/ginger-cookie-recipe"
}
