{
    "directions": [
        "In a food processor grind coarse the walnuts with the sugar,add the flour, the salt, and the butter, and blend the mixture until it resembles coarse meal. Transfer the mixture to a bowl, add 3 tablespoons ice water, and toss the mixture until the water is incorporated. Press the dough into the bottom and up the side of a 7 1/2-inch tart pan with a removable fluted rim, crimping the edge decoratively, and prick the bottom with a fork. Chill the shell for 30 minutes, line it with foil, and fill the foil with the rice. Bake the shell in the middle of a preheated 425°F. oven for 7 minutes, remove the rice and foil carefully, and bake the shell for 5 minutes more, or until it is golden. Let the shell cool in the pan on a rack.",
        "In a saucepan just large enough to hold the pears in one layer combine the wine, the cinnamon stick, and the sugar and bring the liquid to a boil over moderately high heat, stirring until the sugar is dissolved. Add the pears, peeled, and poach them, turning them occasionally, for 15 minutes, or until they are just tender. Let the pears cool in the syrup.",
        "In a bowl with an electric mixer beat lightly the egg yolks. Add the brown sugar, a little at a time, beating, beat the mixture until it ribbons when the beaters are lifted, and beat in the flour. Add the milk, scalded, in a stream, whisking, transfer the mixture to a heavy saucepan, and bring it to a boil over moderately low heat, stirring constantly. Boil the mixture, stirring constantly , for 2 minutes. Strain the pastry cream through a fine sieve into a bowl and stir in the butter, the salt, and the gingerroot. Let the pastry cream cool, its surface covered with a buttered round of wax paper, for 1 hour.",
        "Remove the rim of the tart pan, set the shell on a platter, removing the bottom of the pan, and spread the pastry cream in the shell. Arrange the pears, drained, cut lengthwise into sixths, and cored in a spoke pattern on top of the pastry cream."
    ],
    "ingredients": [
        "3/4 cup walnuts",
        "2 tablespoons sugar",
        "1 1/4 cups all-purpose flour",
        "1/2 teaspoon salt",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "raw rice for weighting the shell",
        "3 firm-ripe pears",
        "2 cups dry red wine",
        "1 cinnamon stick",
        "1 cup sugar",
        "3 large eggs yolks",
        "1/2 cup light brown sugar",
        "3 tablespoons all-purpose flour",
        "1/4 cup milk",
        "1 tablespoon unsalted butter",
        "1/4 teaspoon salt",
        "2 teaspoons grated peeled fresh gingerroot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Ginger",
        "Dessert",
        "Pear",
        "Walnut",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Ginger Butterscotch Pear Tart",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-butterscotch-pear-tart-11309"
}
