{
    "directions": [
        "Preheat oven to 450°F.",
        "Wrap beets tightly in foil and roast in middle of oven until tender, about 1 1/2 hours. Unwrap beets carefully and let stand until cool enough to handle. Discard stems and peel beets. In a blender purée half of beets with 1 cup water and transfer to saucepan, whisking in remaining 2 cups water to make beet broth.",
        "Wash beet greens well and drain. Remove and discard stems from leaves. Chop enough leaves to measure 2 1/2 cups and chop remaining beets.",
        "Bring beet broth to a simmer and keep warm.",
        "In a large heavy saucepan cook onion, gingerroot, and garlic in butter over moderate heat, stirring, until onion is softened. Stir in rice and cook, stirring constantly, about 1 minutes. Add wine and cook, stirring, until absorbed. Continue simmering and adding beet broth, about 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until about half of broth has been added. Stir in chopped beets and beet leaves and continue simmering and adding broth in same manner until rice is tender but still al dente, about 18 minutes. Stir in 1/4 cup Parmesan and salt and pepper to taste.",
        "Serve risotto sprinkled with remaining Parmesan."
    ],
    "ingredients": [
        "2 pounds beets with greens, beets scrubbed and trimmed, leaving about 1 inch of stems attached and reserving greens",
        "3 cups water",
        "1 small onion, chopped (about 1/2 cup)",
        "1 tablespoon minced peeled fresh gingerroot",
        "3 large garlic cloves, minced",
        "3 tablespoons unsalted butter",
        "1 cup Arborio* or long-grain rice",
        "1/2 cup dry white wine",
        "1/2 cup freshly grated Parmesan (about 2 ounces), or to taste",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Rice",
        "Quick & Easy",
        "Parmesan",
        "Beet",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Gingered Beet Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-beet-risotto-11435"
}
