{
    "directions": [
        "Preheat oven to 350°F. Butter Bundt pan. Dust pan with flour, tapping out excess. Combine cherries, crystallized ginger, grated ginger, and Dijon mustard in a medium bowl. Pour espresso over cherry mixture and set aside. Whisk 2 1/2 cups flour, ground ginger, baking soda, salt, allspice, cinnamon, and pepper in a large bowl.",
        "Using an electric mixer on medium speed, beat 1/2 cup butter in a large bowl until light and fluffy, about 2 minutes. Add brown sugar and beat for 2 minutes. Beat in eggs one at a time, then beat in molasses.",
        "Strain cherry mixture into a small bowl, reserving soaking liquid. Add dry ingredients to butter mixture in 3 additions, alternately with soaking liquid in 2 additions, beating to blend between additions. Fold in drained cherry mixture. Scrape batter into prepared pan.",
        "Bake until top of cake springs back when lightly pressed in the middle, about 1 hour. Let cool in pan on a wire rack. DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature.",
        "Remove cake from pan. Spoon Luscious Chocolate Icing over cake, if using, allowing it to drip down sides. Cut cake into wedges to serve."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature, plus more for pan",
        "2 1/2 cups all-purpose flour plus more for pan",
        "1 cup dried tart cherries (about 6 ounces), finely chopped",
        "1/2 cup finely chopped crystallized ginger",
        "1 tablespoon finely grated peeled ginger",
        "1 tablespoon Dijon mustard",
        "1 cup hot espresso or very strong coffee",
        "1 tablespoon ground ginger",
        "2 teaspoons baking soda",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon ground allspice",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 cup (packed) dark brown sugar",
        "3 large eggs",
        "1 cup mild-flavored (light) molasses",
        "Luscious Chocolate Icing (optional)",
        "Special equipment: A 6-8-cup Bundt pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Easter",
        "Cherry",
        "Spice",
        "Christmas Eve",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger Spice Cake with Dried Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-spice-cake-with-dried-cherries-395034"
}
