{
    "directions": [
        "Preheat oven to 350°F. Butter and flour three 8-inch-diameter cake pans. Bring stout and molasses to boil in heavy medium saucepan over high heat. Remove from heat; stir in baking soda. Let stand 1 hour to cool completely.",
        "Whisk flour and next 6 ingredients in large bowl to blend. Whisk eggs and both sugars in medium bowl to blend. Whisk in oil, then stout mixture. Gradually whisk stout-egg mixture into flour mixture. Stir in fresh ginger.",
        "Divide batter among prepared pans. Bake until tester inserted into centers of cakes comes out clean, about 25 minutes. Cool cakes in pans 15 minutes. Invert cakes onto racks; cool. (Can be made 1 day ahead. Wrap each cake separately in plastic and keep at room temperature.)",
        "Preheat oven to 325°F. Line large baking sheet with foil. Mix pistachios and corn syrup in medium bowl. Add sugar and toss to coat. Working quickly so sugar doesn't melt, spread pistachios on prepared baking sheet. Bake until pistachios are pale golden, about 8 minutes. Cool completely. (Can be made 1 day ahead. Store airtight at room temperature.)",
        "Using electric mixer, beat cream cheese, butter, and orange peel in large bowl until fluffy. Gradually beat in powdered sugar. Chill frosting 30 minutes.",
        "Place 1 cake layer, rounded side up, on platter. Spread 3/4 cup frosting over. Top with second cake layer, rounded side up, then spread 3/4 cup frosting over. Top with third cake layer, flat side up. Spread top and sides of cake with remaining frosting. Sprinkle top of cake with candied pistachios. (Can be made 1 day ahead. Cover and refrigerate. Bring to room temperature before serving.) Cut cake into wedges and serve."
    ],
    "ingredients": [
        "1 cup Guinness extra stout or dark beer",
        "1 cup mild-flavored (light) molasses",
        "1 1/2 teaspoons baking soda",
        "2 cups all purpose flour",
        "2 tablespoons ground ginger",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cardamom",
        "3 large eggs",
        "1/2 cup sugar",
        "1/2 cup (packed) dark brown sugar",
        "3/4 cup vegetable oil",
        "1 tablespoon minced peeled fresh ginger",
        "1 cup finely chopped pistachios",
        "1 tablespoon light corn syrup",
        "2 tablespoons sugar",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3/4 teaspoon finely grated orange peel",
        "2 cups powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Beer",
        "Dairy",
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Pistachio",
        "Spice",
        "Fall",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingerbread Layer Cake with Cream Cheese Frosting and Candied Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/gingerbread-layer-cake-with-cream-cheese-frosting-and-candied-pistachios-107331"
}
