{
    "directions": [
        "Purée scallions, cilantro, vinegar, gochujang, ginger, soy sauce, sesame oil, pepper, sugar, 1 garlic clove, and 1/4 cup vegetable oil in a blender until smooth. Set aside 1/4 cup marinade and chill.",
        "Place steak and remaining marinade in a large resealable plastic bag, turn to coat, and chill at least 2 hours.",
        "Remove steak from marinade, scraping off as much marinade as possible. Heat 1 tablespoon vegetable oil in a large skillet over medium-high heat. Cook steak until browned on all sides, 8–10 minutes for medium-rare (the thinner steaks will cook more quickly). Transfer to a cutting board and let rest at least 5 minutes before slicing.",
        "Heat remaining 1 tablespoon vegetable oil in a medium skillet over medium-high heat. Add bok choy, cut side down, and cook until golden brown, about 2 minutes. Turn, add remaining garlic clove, and cook, tossing occasionally, until fragrant, about 1 minute. Add 1/4 cup water and cook until bok choy is tender, about 2 minutes longer.",
        "Top steak with chives and serve with bok choy and reserved marinade alongside.",
        "DO AHEAD: Steak can be marinated 1 day ahead. Keep chilled."
    ],
    "ingredients": [
        "4 scallions, chopped",
        "1 cup cilantro leaves with tender stems",
        "3 tablespoons unseasoned rice vinegar",
        "2 tablespoons gochujang (Korean hot pepper paste)",
        "1 tablespoon grated peeled ginger",
        "2 teaspoons reduced-sodium soy sauce",
        "2 teaspoons toasted sesame oil",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon sugar",
        "2 garlic cloves, finely chopped, divided",
        "1/4 cup plus 2 tablespoons vegetable oil, divided",
        "1 1/2 pounds hanger steak, central membrane removed, cut into 4 pieces",
        "4 baby bok choy, halved lengthwise",
        "1 tablespoon chopped fresh chives",
        "Ingredient info: Gochujang is available at Korean markets and online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Quick & Easy",
        "Dinner",
        "Meat",
        "Steak",
        "Bok Choy",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Ginger-Marinated Hanger Steak",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-marinated-hanger-steak-51198610"
}
