{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch springform pan with 2 3/4-inch-high sides.",
        "Blend graham crackers and sugar in processor to coarse crumbs. Add 1/2 cup butter. Blend until crumbs hold together; press onto bottom and up sides of prepared pan. Bake crust until beginning to color, about 15 minutes; sprinkle with chopped ginger. Cool. Reduce oven temperature to 325°F.",
        "Stack 3 long sheets of 18-inch-wide foil on work surface. Place cake pan in center. Fold foil snugly up sides of pan.",
        "Bring cream and fresh ginger to simmer. Remove from heat; cover. Steep 30 minutes. Strain cream. Stir preserves and 1 tablespoon water in small saucepan over medium heat until preserves melt; strain into small bowl. Discard solids; reserve ginger jelly.",
        "Using electric mixer, beat cream cheese in large bowl until smooth. Beat in sugar, ground ginger, vanilla, and salt. Add eggs, 1 at a time, beating well. Add 2 tablespoons ginger jelly and beat until blended. Gradually beat in strained cream. Transfer to prepared crust. Place cake pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of cake pan. Place cake in water bath in oven.",
        "Bake cake until gently set, browned on top, and beginning to crack around edges, about 2 hours. Remove from water. Remove foil. Place hot cake, uncovered, in refrigerator and chill overnight. Do ahead Can be made 2 days ahead. Keep cake chilled. Store ginger jelly at room temperature.",
        "Line large plate with several layers of paper towels. Cut all peel and pith off grapefruits. Working over bowl, cut between membranes to release segments; place on paper towels to drain. Cover with additional paper towels, pressing to absorb excess liquid. Do ahead Can be prepared 8 hours ahead. Chill, changing towels as needed.",
        "Cut around crust. Remove pan sides. Spread 1/4 cup ginger jelly over filling; top with grapefruit, then brush with ginger jelly. Sprinkle with crystallized ginger. Do ahead Can be made 1 hour ahead. Chill."
    ],
    "ingredients": [
        "20 whole graham crackers, coarsely broken",
        "6 tablespoons sugar",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons finely chopped crystallized ginger",
        "1 1/3 cups heavy whipping cream",
        "1 (1-inch-long) piece fresh ginger, peeled, cut into very thin rounds",
        "1 cup ginger preserves",
        "1 tablespoon water",
        "4 (8-ounce) packages cream cheese, room temperature",
        "1 1/4 cups sugar",
        "1 tablespoon ground ginger",
        "2 1/2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "4 large eggs",
        "2 large pink or ruby grapefruits",
        "Finely chopped crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Wedding",
        "Cream Cheese",
        "Grapefruit",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger and Pink Grapefruit Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-and-pink-grapefruit-cheesecake-236892"
}
