{
    "directions": [
        "Combine 3 cups water, sugar, ginger, and lemon peel in large skillet. Bring to boil over medium-high heat, stirring until sugar dissolves. Reduce heat to mediumlow. Add pears to skillet; place parchment paper round atop pears, then cover with lid and simmer until pears are tender when pierced with small sharp knife, 10 to 15 minutes. Remove skillet from heat; uncover and cool pears completely in poaching liquid in skillet. Transfer mixture to bowl. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Remove lemon peel strips and 3 ginger slices from poaching liquid and discard. Using slotted spoon, transfer pears and remaining ginger slices to food processor. Add pinch of salt and process until smooth. Transfer pear puree to large measuring cup; add 1 1/2 cups poaching liquid (reserve remaining poaching liquid). Stir pear eau-de-vie into pear mixture. Transfer pear mixture to ice cream maker and process according to manufacturer's instructions. Transfer pear sorbet to freezer container. Cover and freeze until firm. DO AHEAD: Sorbet can be made up to 3 days ahead. Keep frozen.",
        "Boil remaining poaching liquid in small saucepan until syrup is reduced to 1/2 cup, about 8 minutes. Carefully strain pear syrup into small bowl and cool. DO AHEAD Syrup can be made 3 days ahead. Cover and refrigerate. Place 2 small scoops or 1 large scoop of sorbet in each of 10 Spiced Brown Butter and Walnut Tuile Cups. Spoon small amount of pear syrup over each. Garnish with raspberries and serve."
    ],
    "ingredients": [
        "3 cups water",
        "1 1/2 cups sugar",
        "1 1-inch piece fresh ginger (about 1/2 ounce), peeled, very thinly sliced",
        "2 1 1/2-inch-long strips lemon peel (yellow part only, removed with vegetable peeler)",
        "2 1/4 pounds ripe pears, peeled, halved, cored (quartered if large)",
        "Pinch of salt",
        "2 tablespoons pear eau-de-vie (such as poire Williams) or pear liqueur (such as Mathilde Poires)",
        "Spiced Brown Butter and Walnut Tuile Cups",
        "Fresh raspberries (for garnish)",
        "Special equipment Ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Food Processor",
        "Ice Cream Machine",
        "Ginger",
        "Dessert",
        "Christmas",
        "Low Fat",
        "High Fiber",
        "Frozen Dessert",
        "Pear",
        "Walnut",
        "Winter",
        "Christmas Eve",
        "Butter",
        "Fat Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger-Pear Sorbet in Spiced Brown Butter and Walnut Tuile Cups",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-pear-sorbet-in-spiced-brown-butter-and-walnut-tuile-cups-356339"
}
