{
    "directions": [
        "Halve squash lengthwise with a sharp knife and discard seeds and strings. Peel squash and cut into 1/2-inch pieces.",
        "In a 4-quart saucepan simmer squash, garlic, gingerroot, and water, partially covered, until squash is very tender, about 20 minutes. In a blender purée mixture in batches and return to pan. Stir in tomatoes, ham, and salt and pepper to taste. Soup may be prepared up to this point 2 days ahead and chilled, covered.",
        "Into a bowl sift together cornmeal, flour, baking powder, and salt and blend in butter until mixture resembles meal. Add milk, egg, and chives and stir until batter is just combined. Bring soup to a bare simmer.",
        "Drop batter by rounded tablespoons onto soup and simmer, covered, until dumplings are just cooked through, about 12 minutes."
    ],
    "ingredients": [
        "2 1/2 pounds kabocha* or butternut squash",
        "2 garlic cloves",
        "1 tablespoon minced peeled fresh gingerroot",
        "7 cups water",
        "1 cup drained canned whole tomatoes, chopped (about a 1-pound  can)",
        "1/2 pound trimmed boneless ham steak, cut into 1/4-inch cubes",
        "1/3 cup yellow cornmeal",
        "1/4 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 1/2 teaspoons cold unsalted butter, cut into bits",
        "3 tablespoons milk",
        "2 tablespoons beaten egg (about 1/2 large egg)",
        "2 tablespoons chopped fresh chives",
        "*available at some natural foods stores, some specialty foods shops, and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Pork",
        "Tomato",
        "Vegetable",
        "Ham",
        "Cornmeal",
        "Squash",
        "Butternut Squash",
        "Winter",
        "Gourmet"
    ],
    "title": "Gingered Squash and Ham Soup with Cornmeal Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-squash-and-ham-soup-with-cornmeal-dumplings-13483"
}
