{
    "directions": [
        "1. Preheat the oven to 200°F. Melt the butter in a large skillet over medium heat. Add the apples and cook, stirring occasionally, until tender, about 10 minutes. Stir in the brown sugar, 2 tablespoons water, the lemon juice, 1/4 teaspoon cinnamon, and 1/4 teaspoon salt. Cook until the mixture bubbles. Remove from the heat and stir in the vanilla; transfer to a serving dish and set aside.",
        "2. Meanwhile, in a small bowl stir together the flour, granulated sugar, ginger, remaining 1 teaspoon cinnamon, the baking powder, and remaining 1/4 teaspoon salt in a small bowl. Combine 1/4 cup water, the egg, molasses, and 3 tablespoons oil in a glass measuring cup; add to the flour mixture and stir with a fork until the mixture is just combined but not smooth. Add additional water if necessary to reach the consistency of pancake batter.",
        "3. Brush a nonstick skillet with a little oil; heat over medium-low heat. Add the gingerbread mixture to the skillet a generous tablespoonful at a time and spread to make a 2 1/2-inch round; cook until lightly browned, about 3 minutes. Turn and brown on the other side, 3 to 4 minutes. Repeat until all the batter has been used. Keep the pancakes warm in the oven until all have been cooked.",
        "4. To serve, divide the pancakes among dessert plates and top each serving with some of the apples."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "2 large Golden Delicious apples (about 1 pound), peeled and sliced",
        "1/4 cup packed light brown sugar",
        "1 tablespoon fresh lemon juice",
        "1 1/4 teaspoons ground cinnamon",
        "1/2 teaspoon table salt",
        "1 1/2 teaspoons vanilla extract",
        "3/4 cup unbleached all purpose flour",
        "1/4 cup granulated sugar",
        "1 1/2 tablespoons ground ginger",
        "1/2 teaspoon baking powder",
        "1 large egg",
        "3 tablespoons molasses",
        "3 tablespoons vegetable oil, plus more for cooking the pancakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Ginger",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Christmas",
        "Vegetarian",
        "Kid-Friendly",
        "Dinner",
        "Lemon",
        "Apple",
        "Vanilla",
        "Fall",
        "Winter",
        "Cinnamon",
        "Molasses",
        "Butter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingerbread Pancakes with Butterscotch Apples",
    "url": "http://www.epicurious.com/recipes/food/views/gingerbread-pancakes-with-butterscotch-apples-355874"
}
