{
    "directions": [
        "1 Bring the water to a boil in a medium saucepan. Remove from the heat and stir in the ginger and lemon zest. Cover the pan and allow the mixture to steep for 10 minutes. Strain the mixture into a large bowl and cool it to room temperature.",
        "2 Combine the milk and sugar in a large saucepan and whisk to mix. Place over medium heat, stirring occasionally to make sure the sugar dissolves.",
        "3 Meanwhile, whisk the eggs in a bowl to break them up.",
        "4 When the milk boils, whisk a third of it into the eggs. Return the remaining milk to a boil over low heat and whisk in the egg mixture in a stream. Cook the custard, whisking constantly, for about 20 seconds. Strain the custard into a bowl and refrigerate it, stirring occasionally, until it is very cold.",
        "5 Whisk the ginger tea into the custard mixture.",
        "6 Freeze the mixture in an ice cream maker according to the manufacturer's directions.",
        "7 While the ice is churning, place a bowl or other container in the freezer. Empty the churned ice into the bowl as you remove it from the ice cream maker. Press plastic wrap against the surface and freeze the ice. Remove the bowl from the freezer to add the remaining ice when it is ready.",
        "Serve the ice in chilled dessert bowls or glasses. A garnish of fresh raspberries, cherries, or other sliced fruit makes a good accompaniment. Or use it when an ice is suggested for serving in the cake and fruit desserts chapters.",
        "Keep the ice in the freezer. It certainly won't spoil if you keep it frozen for a long time, but its texture will be best if you serve it within 24 hours of churning it."
    ],
    "ingredients": [
        "1 1/2 cups water",
        "1/2 cup coarsely chopped peeled ginger (2 1/2 ounces)",
        "Zest of 1 lemon, stripped off with a vegetable peeler",
        "2 cups whole milk",
        "1/2 cup sugar",
        "2 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ginger",
        "Dessert",
        "Low/No Sugar",
        "Frozen Dessert",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ginger Ice Milk",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-ice-milk-51201830"
}
