{
    "directions": [
        "Sift flour, ginger, baking soda, cinnamon and cloves into medium bowl. Using electric mixer, beat shortening and butter in large bowl into light. Add sugar and beat until fluffy. Beat in molasses, then egg. Add dry ingredients. Using spoon, stir until mixture forms dough (dough will be very soft). Divide dough into thirds. Gather each third into ball; flatten into disks. Wrap each disk in plastic and refrigerate until firm, about 4 hours. (Can be prepared 2 days ahead. Keep refrigerated.)",
        "Sift flour, baking powder and salt into medium bowl. Using electric mixer, beat butter, lemon peel and tangerine peel in large bowl until light. Add 1/2 cup sugar and 1/4 cup powdered sugar and beat until fluffy. Beat in egg. Add dry ingredients. Using spoon, stir until mixture forms dough (dough will be soft). Divide dough into thirds. Gather each third into ball; flatten into disks. Wrap each disk in plastic and refrigerate until firm, about 4 hours. (Can be prepared 2 days ahead. Keep refrigerated. Let soften slightly, if necessary, before rolling out.)",
        "If you're making both kinds of cookies, work with one type of dough at a time.",
        "Preheat the oven to 350°F. Generously flour work surface and rolling pin. Place 1 dough disk on work surface (keep remaining 2 dough disks refrigerated). Press rolling pin into dough several times to flatten slightly for easier rolling. Roll out dough to 1/8- to 1/4-inch thickness, frequently lifting and turning dough to prevent sticking. Using assorted cookie cutters dipped into flour, cut out cookies. Transfer cookies to ungreased nonstick baking sheets, spacing 1/2 inch apart. Gather dough scraps together and reserve.",
        "Bake until cookies turn brown on edges, about 15 minutes. Let cookies stand on sheets 1 minute. Using metal spatula, transfer cookies to racks and cool completely.",
        "Repeat rolling, cutting and baking with remaining 2 dough disks as described above, being sure to cool cookie sheets before making each batch. Combine all reserved dough scraps and shape into ball; flatten into disk. Wrap disk in plastic and freeze until firm enough to roll, about 30 minutes. Repeat rolling, cutting and baking as described above. Store cooled cookies in airtight container at room temperature until ready to decorate.",
        "This recipe makes about three cups of icing, enough to decorate all the gingerbread and sugar cookies in the preceding recipes.",
        "6 tablespoons fresh lemon juice",
        "1/4 cup milk",
        "6 to 8 cups powdered sugar",
        "Assorted food colorings (such as blue, red, yellow and green)",
        "Combine lemon juice and milk in large bowl. Whisk in 5 cups powdered sugar. Gradually whisk in enough remaining sugar by 1/2 cupfuls to form icing stiff enough to pipe (mixture will resemble stirred sour cream). Transfer 2/3 cup icing to small bowl to use as white icing; set aside. Divide remaining icing equally among 2 or more small bowls; mix food coloring by drops into each bowl, tinting icing to desired shade. If necessary, stir more sugar into icing to thicken.",
        "The techniques listed below are all easy and give beautiful results. You can even combine techniques: for example, cookies can be glazed first and then piped or drizzled with icing or sprinkled with colored sugar or coconut #&151; or all of the above.",
        "Milk",
        "Pastry Brushes",
        "Assorted decorations (such as colored sugar, sweetened shredded coconut, toasted sliced almonds, chocolate and rainbow sprinkles, multicolored nonpareils, button candies, mini semisweet baking bits and dried currants)",
        "Standard pastry bags and 1/16-inch plain tips or disposable plastic pastry bags",
        "Spoon a small amount of white or colored icing into a small bowl. Mix in enough milk by 1/4 teaspoons to thin icing to spreading consistency",
        "Using pastry brush, brush glaze over cooled baked cookies. Continue decorating glazed cookies, if desired, using the following techniques.",
        "Before glaze dries, sprinkle cookie with assorted decorations.",
        "To pipe using standard pastry bags: Fit each pastry bag with 1/16-inch plain tip. Stand each bag in short cup. Fold back top of bag to expose interior. Spoon 1 color of icing into each bag. Lift bag from cup; twist top of bag at level of icing to close securely.",
        "Stand each plastic bag in a short cup. Spoon 1 color of icing into each bag. Lift bag from cup; twist top of bag at level of icing to close securely. Cut off very bottom of tip to allow small ribbon of icing to come out.",
        "Pipe icing decoratively onto plain or glazed cookies. Before piped icing sets, sprinkle with colored sugar, coconut or other decorations, if desired.",
        "Line baking sheet with foil. Place plain or glazed cookies on foil, spacing apart. Mix milk into white or colored icing by 1/2 teaspoonfuls until icing is thin enough to drizzle. Dip spoon into icing and drizzle over cookies in zigzag or slanted lines. Before icing lines set, sprinkle with colored sugar, sweetened shredded coconut or other decorations, if desired.",
        "Use wet icing as glue to stick on nuts, dried currants or other decorations 1 at a time. For example, dip tip of toasted sliced almonds into icing. Attach iced section of almond to plain or glazed cookie. Repeat to form 1 row of nuts or to cover cookie completely.",
        "Let decorated cookies stand until icing sets, about 2 hours. (Can be prepared up to 2 weeks ahead. Store cookies in single layers between sheets of waxed paper in airtight containers.)"
    ],
    "ingredients": [
        "2 3/4 cups unbleached all purpose flour",
        "1 teaspoon ground ginger",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/4 cup solid vegetable shortening, room temperature",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "1/2 cup sugar",
        "1/2 cup unsulfured (light) molasses",
        "1 large egg",
        "2 cups unbleached all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 1/4 teaspoons grated lemon peel",
        "1 1/4 grated tangerine peel or orange peel",
        "1/2 cup sugar",
        "1/4 cup powdered sugar",
        "1 large egg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Citrus",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Winter"
    ],
    "title": "Gingerbread Cookies and Citrus Sugar Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/gingerbread-cookies-and-citrus-sugar-cookies-103110"
}
