{
    "directions": [
        "Place apricots and plums in small heatproof bowl. Add enough boiling water to cover. Let stand 15 minutes to soften. Drain and quarter all fruit.",
        "Meanwhile, mix 2/3 cup broth with soy sauce, mango chutney, tamarind concentrate, and sugar in small bowl. Whisk cumin, curry powder, garlic powder, and cayenne pepper in another small bowl. DO AHEAD: Fruit, broth mixture, and spice blend can be made 2 hours ahead. Let stand separately at room temperature.",
        "Heat vegetable oil in heavy large skillet over medium-high heat. Add onion and saut until translucent, about 2 minutes. Add garlic and ginger and saut 30 seconds. Add apricots, plums, and carrot; saut until onion begins to brown, about 1 minute. Add shrimp and spice blend, stirring to coat. Cook until shrimp are pink on both sides but still uncooked in center, about 2 minutes. Add broth mixture; cover and cook until shrimp are just opaque in center, about 1 minute, adding more broth by tablespoonfuls if sauce is too thick. Transfer to serving bowl. Sprinkle with green onion and serve.",
        "*Tamarind concentrate is a dark, seedless paste (sometimes labeled tamarind paste) with a tart-sweet flavor; available at Middle Eastern and Indian markets and at some Asian markets."
    ],
    "ingredients": [
        "12 dried apricot halves",
        "12 pitted dried plums (prunes)",
        "2/3 cup (or more) low-salt chicken broth",
        "2 tablespoons soy sauce",
        "1 tablespoon mango chutney, large pieces chopped",
        "2 teaspoons tamarind concentrate*",
        "1 teaspoon sugar",
        "1 1/4 teaspoons ground cumin",
        "1 1/4 teaspoons curry powder",
        "1 1/4 teaspoons garlic powder",
        "1/2 teaspoon cayenne pepper",
        "3 tablespoons vegetable oil",
        "1/2 cup thinly sliced white onion",
        "2 garlic cloves, minced",
        "1 teaspoon chopped peeled fresh ginger",
        "1/2 cup matchstick-size strips peeled carrot",
        "16 uncooked large shrimp, peeled, deveined",
        "1 green onion, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Onion",
        "Sauté",
        "Currant",
        "Dried Fruit",
        "Prune",
        "Apricot",
        "Shrimp",
        "Carrot",
        "Winter",
        "Tamarind",
        "Soy Sauce"
    ],
    "title": "Ginger-Apricot Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/ginger-apricot-shrimp-239844"
}
