{
    "directions": [
        "Combine raisins and ginger in heavy small saucepan. Add enough water to just cover. Simmer over low heat until liquid is absorbed, about 15 minutes. Cool completely.",
        "Position rack in lowest third of oven and preheat to 400°F. Combine pears and next 6 ingredients in bowl. Stir in raisin mixture. Roll out 1 pie crust disk on lightly floured surface to 13-inch round (about 1/8 inch thick). Roll up dough on rolling pin and transfer to 9-inch-diameter glass pie plate. Gently press into place. Trim edges of crust, leaving 1/4-inch overhang. Spoon pear mixture into pan, mounding in center.",
        "Roll out second crust disk on lightly floured surface to 13-inch-diameter round. Roll up on rolling pin and unroll over pie. Trim edges, leaving 3/4 -inch overhang. Fold overhang of top crust under edge of bottom crust. Pinch edges together to seal. Crimp edges to make decorative border. Gather and reroll scraps. Cut out decorative shapes. Beat egg with milk in small bowl for glaze. Brush top of pie with glaze. Make several slashes in top crust so steam can escape.",
        "Bake pie until crust is golden brown and juices bubble up through slashes, covering crust edges with foil if browning too quickly, about 1 hour. Serve warm with vanilla ice cream."
    ],
    "ingredients": [
        "3/4 cup golden raisins",
        "1/4 cup plus 2 tablespoons minced crystallized ginger (about 2 1/2 ounces)",
        "3 pounds ripe medium pears (about 7), peeled, cored, sliced 1/2 inch thick",
        "1/2 cup sugar",
        "3 tablespoons butter, melted",
        "2 tablespoons quick-cooking tapioca",
        "1 tablespoon fresh lemon juice",
        "1 1/4 teaspoons ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "2 Buttermilk Pie Crust Dough disks",
        "1 egg",
        "2 tablespoons milk",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Raisin",
        "Pear",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Gingered Pear Pie with Golden Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/gingered-pear-pie-with-golden-raisins-2693"
}
