{
    "directions": [
        "Preheat the oven to 325 degrees F (165 degrees C). Use a serrated knife to score the top of the ham in a diamond pattern. Press whole cloves into the ham and place on a roasting rack in a roasting pan.",
        "Bake for 1 1/2 to 2 hours in the preheated oven, or until the internal temperature of the ham has reached 140 degrees F (60 degrees C). Cover with aluminum foil if the ham starts to look dry.",
        "While the ham is baking, mix together the cinnamon, mustard and 1/2 cup of brown sugar in a cup or small bowl. Set aside. In a saucepan over medium heat, mix together the remaining brown sugar, cider vinegar, peach nectar and peach preserves. Bring to a boil and then stir in the sliced peaches, ginger, cherry pepper and the cinnamon stick. Simmer until the peaches are tender and the sauce has thickened, 25 to 30 minutes.",
        "Remove the ham from the oven and brush liberally with the mustard glaze. Increase the oven temperature to 350 degrees F (175 degrees C) and return the ham to the oven, uncovered.",
        "Bake for an additional 20 to 30 minutes, or until glaze is bubbly. Allow the ham to rest for 15 to 20 minutes before carving. Serve with hot Peach-Ginger sauce."
    ],
    "ingredients": [
        "1 (10 pound) fully-cooked, bone-in ham",
        "2 teaspoons whole cloves",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons brown mustard",
        "1/2 cup packed brown sugar",
        "1/4 cup packed brown sugar",
        "2 tablespoons apple cider vinegar",
        "1 cup peach nectar",
        "1 cup peach preserves",
        "5 cups frozen peach slices",
        "2 teaspoons minced fresh ginger root",
        "1 hot cherry pepper, seeded and minced",
        "1 (3 inch) cinnamon stick"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Glazed Ham with Peach-Ginger Sauce",
    "url": "http://allrecipes.com/recipe/102269/glazed-ham-with-peach-ginger-sauce/"
}
