{
    "directions": [
        "Preheat oven to 350°F. Butter 13x9-inch baking pan. Dust pan with flour. Using electric mixer, beat 2 cups sugar with eggs, oil and vinegar in large bowl at high speed until very thick, about 4 minutes. Combine dry ingredients in medium bowl. Reserve 1/4 cup dry ingredients; mix remaining dry ingredients into egg mixture. Toss pears, pecans and dried pears with reserved dry ingredients to coat. Mix into batter. Transfer batter to prepared pan. Bake until tester inserted into center of cake comes out clean, about 1 hour.",
        "Meanwhile, combine remaining 2 cup sugar, pear nectar and whipping cream in heavy small saucepan. Stir over high heat until sugar dissolves. Boil until thick, about 20 minutes. Spoon 1/2 cup glaze over hot cake. Let cool completely. (Can be prepared 1 day ahead. Cover cake and let stand at room temperature. Cover remaining glaze and chill.)",
        "Rewarm glaze in heavy small saucepan over low heat. Cut cake into squares. Spoon glaze over and serve."
    ],
    "ingredients": [
        "3 cups sugar",
        "4 eggs",
        "3/4 cup vegetable oil",
        "1 1/2 tablespoons pear vinegar or white wine vinegar",
        "2 cups all purpose flour",
        "1 tablespoon ground cinnamon",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1 1/2 pounds Bosc pears (about 2 very large), peeled, cored, cut into 1/2- to 3/4-inch pieces",
        "1 cup toasted pecan pieces",
        "3/4 cup diced dried pear (about 3 ounces)",
        "2 cups pear nectar",
        "1 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Pear",
        "Pecan",
        "Fall",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Glazed Pear and Pecan Cake",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-pear-and-pecan-cake-35"
}
