{
    "directions": [
        "Heat salt, brown sugar, and 4 cups water in a large pot over medium, whisking, until salt and sugar dissolve, about 5 minutes. Remove from heat and stir in hot sauce and 8 cups ice water. Add chicken to brine, cover, and chill 4 hours.",
        "Combine 2 cups flour and 3 tablespoons Old Bay seasoning in a shallow baking dish and toss with your fingers to evenly distribute seasoning. Place buttermilk in a medium bowl. Remove chicken from brine and pat dry with paper towels.",
        "Working one at a time, dip 8 pieces of chicken in buttermilk, allowing excess to drip off, then coat in flour mixture, packing all around chicken and pressing firmly into cracks and crevices; shake off excess. Place chicken on a wire rack set inside a rimmed baking sheet. Discard flour mixture, which will be wet at this point, and repeat process with remaining flour, Old Bay, buttermilk, and chicken; place on another wire rack set inside a rimmed baking sheet. Chill, uncovered, 12–24 hours.",
        "Let chicken stand at room temperature 30 minutes.",
        "Heat lard, Old Bay, paprika, and cayenne in a small saucepan over low, stirring, until lard is melted, about 3 minutes. Set glaze aside.",
        "Pour oil into a large pot fitted with deep-fry thermometer to come halfway up the sides. Heat over medium-high until thermometer registers 325°. Working in 4 batches, fry chicken, turning often with tongs and adjusting heat to maintain temperature, until skin is deep golden brown and an instant-read thermometer inserted into the thickest part of chicken registers 165° for dark meat and 160° for white meat, 10–12 minutes per batch. Transfer chicken back to wire racks and let rest 5 minutes. Brush lightly with glaze (reheat glaze, if needed) and let cool. Store on racks at room temperature up to 3 hours ahead."
    ],
    "ingredients": [
        "9.5 ounces kosher salt (1 cup Morton or 1 2/3 cups Diamond Crystal)",
        "1/3 cup (packed) light brown sugar",
        "3/4 cup hot sauce (preferably Crystal)",
        "2 (3 1/2–4-pound) chickens, cut into 8 pieces (legs and thighs separated, breasts halved), backbone and wing tips removed",
        "4 cups all-purpose flour",
        "6 tablespoons Old Bay seasoning",
        "3 cups buttermilk",
        "3/4 cup lard",
        "1 tablespoon Old Bay seasoning",
        "2 teaspoons paprika",
        "1 1/2 teaspoons cayenne pepper",
        "Vegetable oil (for frying; about 4 quarts)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Kid-Friendly",
        "Summer",
        "Deep-Fry",
        "South Carolina"
    ],
    "title": "Glazed Fried Chicken With Old Bay and Cayenne",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-fried-chicken-with-old-bay-and-cayenne-56389708"
}
