{
    "directions": [
        "In a small saucepan, combine the soy sauce, sake, sugar and vinegar and bring to a boil. Boil over high heat until thickened to a glaze, 2 to 3 minutes. Taste and season with a fresh splash of vinegar, if you like.",
        "Preheat the grill for at least 10 minutes, preparing to grill over moderately high heat, and soak 8 double-pronged bamboo skewers or 16 single skewers in water.",
        "In a bowl, use your hands to mix together all of the ingredients except for the sesame seeds and scallion greens.",
        "Form the meat mixture into 16 meatballs. Thread the meatballs onto the skewers, leaving just a little space in between and flatten slightly.",
        "Oil the grates well and grill the meatball skewers until light grill marks form, 3 to 4 minutes. Flip and grill for 2 minutes longer, until the outside of the meatballs looks cooked.",
        "Brush the sauce over the meatballs, flip and brush the other side. Flip them and brush them with the sauce constantly for about 1 minute, until glazed and cooked through. If the sauce darkens too quickly, reduce the heat or move the skewers to a cooler part of the grill.",
        "Transfer the skewers to a platter and sprinkle with sesame seeds and sliced scallions. Serve over rice, if desired."
    ],
    "ingredients": [
        "1/4 cup low-sodium soy sauce",
        "1/4 cup dry sake",
        "1/4 cup sugar",
        "2 tablespoons sherry vinegar, plus more, for seasoning",
        "1 1/2 pounds ground chicken or turkey, preferably dark meat",
        "1 tablespoon minced shallot",
        "1 tablespoon minced fresh ginger",
        "1 teaspoon minced garlic (1 small clove)",
        "1 teaspoon kosher salt",
        "1 teaspoon toasted sesame oil",
        "Sesame seeds",
        "Thinly sliced scallion greens",
        "Steamed rice (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Sake",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Soy Sauce"
    ],
    "title": "Glazed Japanese Chicken Meatballs on Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-japanese-chicken-meatballs-on-skewers-51237210"
}
