{
    "directions": [
        "Remove wishbone from turkey by lifting neck skin to expose meat and cutting along both sides of bone with a small paring knife to separate flesh from bone. Pull firmly on both sides to snap out (if bone does not come out in one piece, grip remaining fragments with a paper towel and pull out). This will make carving the breast much easier later.",
        "Grind bay leaves, peppercorns, and allspice in a spice mill until very fine; toss with salt, sage, and 1/4 cup brown sugar in a medium bowl. Generously sprinkle dry brine inside cavity and rub all over skin, packing on until you've used entire mixture. Chill turkey on a large rimmed baking sheet uncovered 8–12 hours.",
        "Thoroughly rinse turkey to remove brine; pat dry. Let sit on baking sheet 3 hours to bring to room temperature.",
        "Meanwhile, bring vinegar, soy sauce, and remaining 1/4 cup brown sugar to a boil in a small saucepan over medium heat, stirring to dissolve sugar. Reduce heat and simmer, stirring occasionally, until mixture is thickened to the consistency of molasses (it needs to be very thick to adhere to the turkey; if glaze is too thin, keep simmering), 5–8 minutes. Let glaze cool.",
        "Preheat oven to 325ºF. Starting at neck end of turkey, gently slide your fingers between skin and breast to loosen skin. Place butter pieces underneath skin, spacing evenly over breasts. Coat a piece of foil large enough to cover turkey breast with nonstick spray. Cover breast with foil, coated side down, avoiding thighs and tucking end inside cavity (foil will protect skin from tearing during first stage of cooking). Place turkey, breast side down, on a V-shape roasting rack set inside a large roasting pan. Roast until back side of turkey is golden brown, 50–60 minutes.",
        "Remove turkey from oven and transfer to a clean rimmed baking sheet with oven mitts or 2 pairs of tongs. Turn bird breast side up and transfer back to rack in roasting pan; discard foil. Pour any juices collected on baking sheet into pan. Roast turkey until breast is golden brown and skin is crisp, 35–45 minutes.",
        "Remove turkey from oven and brush all over with glaze. Continue to roast, checking temperature every 5 minutes, until an instant-read thermometer inserted into thickest part of breast near neck registers 150ºF (temperature will rise as the bird rests;), 15–25 minutes. Transfer turkey to a platter and let rest 1 hour.",
        "Increase oven to 450ºF. Brush another even layer of glaze over turkey. Roast, watching closely in case glaze starts to burn, until turkey is deep golden brown and skin is shiny and crisp, about 5 minutes. Transfer to a clean platter and let rest 30 minutes before carving.",
        "Turkey can be brined 2 days ahead. Brine on Tuesday, then rinse on Wednesday and chill overnight so you are ready to roast on Thursday."
    ],
    "ingredients": [
        "1 (12-14 pound) turkey, neck and giblets removed, patted dry",
        "6 dried bay leaves",
        "2 teaspoons black peppercorns",
        "1/2 teaspoon allspice berries",
        "1/2 cup kosher salt",
        "2 tablespoon dried sage",
        "1/2 cup (packed) brown sugar, divided",
        "1/4 cup Sherry vinegar or red wine vinegar",
        "1/4 cup soy sauce",
        "4 tablespoons unsalted butter, cut into 4 pieces, room temperature",
        "Nonstick vegetable oil spray",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Dinner",
        "Party",
        "Peanut Free",
        "Tree Nut Free",
        "turkey"
    ],
    "title": "Glazed and Lacquered Roast Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-and-lacquered-roast-turkey"
}
