{
    "directions": [
        "1. Place the pepper flakes in a small bowl and pour the boiling water over them. Let sit for 1 to 2 minutes to rehydrate the flakes. Combine all the brine ingredients in a blender, or in a large bowl using an immersion/stick blender. Stir in the pepper flakes and the soaking water.",
        "Place the loin in an extra-large resealable plastic bag, pour the brine over the top, squeeze out any excess air from the bag, and close. Roll the bag to evenly coat the meat. Refrigerate for at least 6 hours, or up to 12.",
        "2. Preheat an indirect barbecue with a drip pan and fruitwood (preferably apple), a ceramic cooker with deflector plate and fruitwood (preferably apple), or a charcoal or gas grill with a box or packet of fruitwood (preferably apple) to 250°F.",
        "3. Combine all of the seasoning blend ingredients.",
        "Place all of the glaze ingredients in a jar with a tight-fitting lid and shake to combine. Set aside.",
        "4. Remove the loin from the brine and lightly pat dry with paper towels.",
        "Sprinkle the rub evenly on all sides.",
        "Using your hands or a brush, evenly, but lightly, coat the loin with canola oil.",
        "Insert a remove thermometer into the center of the meat.",
        "5. Place the loin in the cooker and cook until the internal temperature reaches 135°F, about 1 hour and 15 minutes.",
        "6. Give the glaze a quick shake to reincorporate any ingredients that may have settled. Brush the loin with the glaze and return to the cooker until the internal temperature reaches 145°F, about 15 minutes. At this point the meat will be slightly pink in the center; cook for an additional 5 to 10 minutes for more well-done.",
        "7. Pour about half of the remaining glaze on a cutting board and top with the loin. Let rest for 10 minutes.",
        "8. Slice the meat into 1/4-inch slices. Dredge the slices in the glaze, adding additional as needed to coat the exposed sides. Sprinkle with fleur de sel and pepper."
    ],
    "ingredients": [
        "1 teaspoon crushed hot red pepper flakes",
        "1 tablespoon boiling water",
        "2 cups apricot nectar",
        "2 cups water",
        "1/2 cup kosher salt",
        "1/2 cup granulated sugar",
        "10 garlic cloves, peeled, halved, germ removed, and grated on a Microplane grater",
        "One 6 1/2- to 7-pound pork loin",
        "2 tablespoons mild chile powder, preferably Chimayo, Ancho, or Hatch",
        "1 tablespoon sweet paprika",
        "1 tablespoon firmly packed dark brown sugar",
        "3/4 teaspoon dry mustard",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon lemon pepper",
        "1/2 teaspoon coarsely ground fresh black pepper",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon Old Bay Seasoning",
        "1/4 teaspoon ground cumin",
        "1/2 cup apricot preserves",
        "1 1/2 tablespoons freshly squeezed lemon juice",
        "3 tablespoons finely chopped cilantro or flat-leaf parsley",
        "1 garlic clove, peeled, halved, germ removed, and grated on a Microplane grater",
        "About 2 tablespoons canola or vegetable oil",
        "Fleur de sel",
        "Finely ground fresh black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Pork",
        "Vegetable",
        "Marinate",
        "Fourth of July",
        "Super Bowl",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Meat",
        "Tailgating",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Cilantro",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Glazed Pork Loin with Cilantro and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-pork-loin-with-cilantro-and-garlic-352949"
}
