{
    "directions": [
        "Remove the dough from the refrigerator. If necessary, allow it to sit for about 10 minutes or until it is soft enough to roll.",
        "Using a pastry cloth and sleeve rubbed with flour or two sheets of plastic wrap lightly sprinkled with flour, roll the dough 1/8 inch thick or less and large enough to cut a 13-inch circle. Use an expandable flan ring or a cardboard template and a sharp knife as a guide to cut out the circle. Transfer the dough to the pie pan. Fold under the excess and crimp the border using a fork or your fingers. Cover it loosely and refrigerate for a minimum of 1 hour and a maximum of 24 hours.",
        "Preheat the oven to 425°F at least 20 minutes before baking.",
        "Line the pastry shell with parchment, pleating it as necessary so it fits into the pan, and fill it with rice or dried beans. Bake for 20 minutes. Carefully lift out the rice or beans with the parchment. With a fork prick the bottom and sides and bake 5 to 10 minutes more or until the crust is a pale golden. Check after 3 minutes and prick any bubbles that may have formed.",
        "Cool the crust on a rack for 3 minutes, so it is no longer piping hot, then brush the bottom and sides with the egg white.",
        "In a 2-quart saucepan, mix together the sugar and cornstarch. Gradually stir in the cran/raspberry concentrate and water until smooth. Over medium heat, bring to a boil, stirring constantly. Boil for 1 minute. Remove the pan from the heat and cool completely.",
        "Gently fold in the strawberries and spoon the filling into the baked pastry shell. Refrigerate for 4 hours or until set.",
        "Refrigerated up to 2 days.",
        "If the fruit is very acidic, the glaze will only keep 1 day."
    ],
    "ingredients": [
        "1 Basic Flaky Pie Crust for a 9-inch pie",
        "1 tablespoon egg white, lightly beaten",
        "1/4 cup sugar",
        "3 tablespoons cornstarch",
        "1 cup liquid cran/raspberry concentrate, thawed, undiluted",
        "3/4 cup water",
        "4 cups strawberries, rinsed, hulled, dried, and halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Strawberry",
        "Summer",
        "Fat Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Glazed Strawberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-strawberry-pie-101859"
}
