{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Cut a lengthwise slit 3/4 of the way through pork tenderloin and spread tenderloin open. Pound the meat flat and to 1/4-inch thickness with a meat mallet.",
        "Heat canola oil in a large skillet over medium heat and brown the flattened tenderloin in the hot oil, about 5 minutes per side. Transfer tenderloin to a plate.",
        "Heat butter in skillet over medium heat and cook and stir celery and onion in the hot butter until tender, about 8 minutes. Stir bread crumbs, parsley, 1 teaspoon garlic powder, rosemary, salt, and black pepper into the celery and onions.",
        "Open the tenderloin and spread the bread crumb mixture over the meat to within 1/2 inch of the edge. Fold the tenderloin over the stuffing and tie together with kitchen string; place into a shallow roasting pan.",
        "Stir cranberry jam, jalapeno pepper jam, garlic, and garlic powder together in a bowl; spread mixture over the tenderloin.",
        "Bake in the preheated oven until the jam mixture has baked into a glaze and an instant-read meat thermometer inserted into the middle of stuffing reads 160 degrees F (70 degrees C), 50 to 60 minutes. Let meat stand 5 minutes before untying and slicing."
    ],
    "ingredients": [
        "1 (1 pound) pork tenderloin",
        "1 tablespoon canola oil",
        "2 tablespoons butter",
        "3 celery ribs, chopped",
        "1 small onion, chopped",
        "1/2 cup bread crumbs",
        "1 teaspoon garlic powder",
        "1 tablespoon chopped parsley",
        "1 teaspoon garlic powder",
        "1/4 teaspoon dried rosemary",
        "1/4 teaspoon salt",
        "1/4 teaspoon pepper",
        "1/4 cup cranberry jam",
        "1/4 cup jalapeno pepper jam",
        "1 teaspoon minced garlic",
        "1 teaspoon minced onion",
        "1 teaspoon garlic powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Glazed and Stuffed Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/229243/glazed-and-stuffed-pork-tenderloin/"
}
