{
    "directions": [
        "Preheat oven to 350°F. Toss blueberries, blackberries, sugar, ginger, lime juice, 1/4 tsp. salt, and 2 Tbsp. flour in a medium bowl to combine.",
        "Beat egg and heavy cream in a small bowl until no streaks remain. Roll out pie dough on a lightly floured work surface to a 15x10\" rectangle. Cut a thin border around dough to square off edges. Cut dough in half lengthwise and then in thirds crosswise to form six 5\" squares. Brush edges with egg mixture, then mound about 1/4 cup blueberry filling in 1 corner of each square. Working with 1 square at a time, fold corner opposite filling up and over to create a triangle; press edges with a fork to seal. Place on a parchment-lined baking sheet and brush with remaining egg mixture. Cut about a 1\"-long slit in the center of each turnover. Bake until pastry is golden brown and juices run from slits, 35–45 minutes. Let cool on baking sheet until slightly warm.",
        "Whisk powdered sugar, vanilla, and remaining 1/4 tsp. salt in large wide bowl. Whisking constantly, add warm water a tablespoonful at a time until glaze is thick and smooth and falls off the whisk in a slowly dissolving ribbon (it should look like sweetened condensed milk).",
        "Working one at a time, dip top sides of slightly warm turnovers into glaze, letting excess drip back into bowl. Transfer to a wire rack and let sit until turnovers are cool and glaze is set, about 30 minutes."
    ],
    "ingredients": [
        "3/4 cup fresh (or frozen, thawed) blueberries",
        "3/4 cup fresh (or frozen, thawed) halved blackberries",
        "3 tablespoons sugar",
        "2 teaspoons finely grated peeled ginger",
        "2 teaspoons fresh lime juice",
        "1/2 teaspoon kosher salt, divided",
        "2 tablespoons all-purpose flour, plus more for surface",
        "1 large egg, beaten to blend",
        "1/4 cup heavy cream",
        "1 disk All-Purpose Pie Dough",
        "1 1/2 cups powdered sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Breakfast",
        "Blueberry",
        "Blackberry",
        "Pie",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Glazed Blueberry-Blackberry Turnovers",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-blueberry-blackberry-turnovers"
}
