{
    "directions": [
        "Position a rack in the lower third of oven and preheat to 325°F.",
        "Using a sharp knife, score the fat covering the ham in a 3/4-inch-wide diamond pattern (do not cut into the meat). Place the ham in a 10-by-14-inch roasting pan and add 1 cup water. Roast the ham for 2 hours.",
        "While the ham is roasting, prepare the glaze: In a heavy, medium saucepan over moderately low heat, combine 1 cup orange juice, brown sugar, and bourbon. Bring to a simmer and continue simmering for 10 minutes. Add the guava or apple jelly, shallots, allspice, and cloves, and continue simmering until slightly reduced, about 5 minutes. Add the orange zest and the remaining 1 cup orange juice, and bring to a boil. Continue boiling until thickened, about 5 minutes. Add the orange slices and fresh ginger, and cook until the orange slices are tender, about 2 minutes.",
        "Once the ham has been in the oven for two hours, drape the glazed orange slices over the ham, securing them with toothpicks, and brush the ham and oranges with about 1/2 cup of glaze, reserving the remainder for serving. Continue roasting the ham until an instant-read thermometer inserted into the thickest part registers 145°F, about 30 minutes.",
        "Remove the toothpicks from the ham and arrange the orange slices on a platter. Slice the ham and arrange on top of the oranges. Warm the remaining glaze and serve alongside."
    ],
    "ingredients": [
        "1 (10- to 12-pound) fully cooked, trimmed, bone-in smoked ham (shank end), room temperature",
        "2 cups freshly squeezed orange juice",
        "1/2 cup packed dark brown sugar",
        "3/4 cup bourbon",
        "1/2 cup guava or apple jelly, warmed",
        "2 large shallots, peeled and thinly sliced",
        "3 whole allspice",
        "3 whole cloves",
        "Zest of 1 orange plus 2 oranges cut into 1/4-inch-thick slices",
        "1 (2-inch-long) piece fresh ginger, peeled and grated",
        "Special equipment: 1 (10- by 14-inch) roasting pan; toothpicks; pastry brush"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Roast",
        "Christmas",
        "Dinner",
        "Meat",
        "Ham",
        "Clove",
        "Jam or Jelly",
        "Orange Juice",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Glazed Ham",
    "url": "http://www.epicurious.com/recipes/food/views/glazed-ham-51126890"
}
