{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Make the crust: Pulse the oat flour, almond flour, tapioca flour, sugar, and salt together in a food processor for 5 seconds to blend.",
        "Add the cubed butter and pulse 8-10 times more until a moist, crumbly dough starts to form. Add the applesauce and blend until a soft dough forms.",
        "Divide the dough into 6 equal pieces and use your fingers to press the dough into 6 mini tart pans (or 1 9-inch tart pan if you don't have mini shells), making sure the dough rises slightly above the edges of each pan.",
        "Place the tarts on a rimmed baking sheet and freeze for 15 minutes while the oven heats.",
        "Bake the tarts for 10 minutes, until they start to brown at the edges. Remove from the oven and cool the crusts to room temperature.",
        "Reduce the oven heat to 375 degrees F.",
        "Make the filling: Beat the egg, almond paste, and applesauce together with an electric hand mixer on medium-low speed until smooth.",
        "Add the oat flour and powdered sugar, and beat on low speed to blend thoroughly.",
        "Divide the almond custard evenly between the cooled tart crusts.",
        "Pit and slice the peaches into 1/4-inch thick half-moons and fan the peach slices across each tart crust. Whisk the jam with 1 tablespoon water to make a glaze. Brush the peaches with the glaze using a pastry brush. Return the tarts to the oven and bake for 20-25 minutes more, until the custard is matte and puffy at the edges. Serve immediately."
    ],
    "ingredients": [
        "Crust:",
        "1/2 cup gluten-free oat flour",
        "1/2 cup almond flour",
        "1/4 cup tapioca flour",
        "1 tablespoon granulated sugar",
        "1/2 teaspoon kosher or fine sea salt",
        "4 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup Mott's® Cinnamon Applesauce",
        "Filling:",
        "1 large egg",
        "1/2 cup gluten-free almond paste, broken into bite-size pieces",
        "1/4 cup Mott's® Cinnamon Applesauce",
        "1 tablespoon gluten-free oat flour",
        "1 tablespoon powdered sugar",
        "2 medium peaches",
        "1 tablespoon apricot jam or other light-colored jam"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten Free Almond Mini Tarts",
    "url": "http://allrecipes.com/recipe/241045/gluten-free-almond-mini-tarts/"
}
