{
    "directions": [
        "Pulse 2 1/2 cups flour, 2 tablespoons sugar, xanthan gum, and salt together in a food processor; add 3/4 cup butter, 2 eggs, and cold water. Blend until evenly mixed and crumbly but holds together when pinched; add more cold water, 1 tablespoon at a time, if needed. Form dough into a ball, place in a bowl, and chill for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Mix apples, 1/4 cup white sugar, brown sugar, 2 tablespoons flour, lemon juice, vanilla extract, cinnamon, and nutmeg in a large bowl.",
        "Melt 6 tablespoons butter in a saucepan over medium heat until foamy; continue cooking and stirring until butter is brown with a nutty aroma, 3 to 5 minutes. Pour browned butter over apple mixture; stir to coat.",
        "Roll dough out on a lightly floured surface to 1/8-inch thickness; cut into 4-inch circles. Whisk 1 egg and 1 tablespoon water together in a bowl; brush egg wash over each circle of dough. Spoon about 2 tablespoons apple filling on 1 half of each circle; fold the other half over the filling. Crimp the edges of each pie together using a fork. Place pies on a baking sheet; brush tops with egg wash and sprinkle with 1 teaspoon white sugar.",
        "Bake in the preheated oven until pies are lightly browned, about 30 minutes."
    ],
    "ingredients": [
        "Crust:",
        "2 1/2 cups gluten-free all-purpose baking flour",
        "2 tablespoons white sugar",
        "2 teaspoons xanthan gum",
        "1 teaspoon salt",
        "3/4 cup butter",
        "2 eggs",
        "1/4 cup cold water, or more as needed",
        "Filling:",
        "4 apples, peeled and thinly sliced",
        "1/4 cup white sugar",
        "1/4 cup brown sugar",
        "2 tablespoons gluten-free all-purpose baking flour",
        "4 teaspoons lemon juice",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "6 tablespoons butter",
        "Egg Wash:",
        "1 egg",
        "1 tablespoon water",
        "1 teaspoon white sugar, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten Free Brown Butter Apple Hand Pies",
    "url": "http://allrecipes.com/recipe/233461/gluten-free-brown-butter-apple-hand-p/"
}
