{
    "directions": [
        "Preheat oven to 350 degrees F. Place cupcake liners in 8 wells of a muffin tin.",
        "In a small bowl, whisk together the coconut flour, cocoa powder, salt, baking soda, and powdered buttermilk, if using. Set aside.",
        "In a larger bowl, combine the eggs, egg whites, Melt, buttermilk or water, erythritol, and stevia. Mix on low speed with a hand blender until combined. Add the dry ingredients and mix well, beginning on low speed and increasing to high, for about 2 minutes, until well-blended and no lumps remain. Blend in food coloring until desired color is achieved.",
        "Divide batter evenly among the cupcake liners. Bake for 20 minutes, or until a toothpick inserted in the center of a cupcake comes out clean. Cool completely before frosting.",
        "To make the frosting, beat together the cream cheese and Melt until fluffy (the Melt does not need to be warmed to room temperature; it will be soft enough straight from the refrigerator.) Add the powdered erythritol in several additions, beating well, until fluffy. Beat in liquid vanilla stevia drops to taste."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/989844.jpg",
    "ingredients": [
        "Cupcakes:",
        "1/2 cup coconut flour",
        "2 tablespoons natural, unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking soda",
        "2 eggs",
        "2 egg whites",
        "2 tablespoons Melt® Organic Buttery Spread, melted over low heat",
        "1/2 cup low fat buttermilk*",
        "1/2 cup erythritol, such as NOW Foods",
        "1/2 teaspoon vanilla stevia extract",
        "7 drops red gel food coloring",
        "Frosting:",
        "4 ounces reduced-fat cream cheese, room temperature",
        "2 ounces Melt® Organic Buttery Spread",
        "1 cup erythritol, powdered**",
        "15 drops vanilla stevia, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten-Free, Sugar-Free Red Velvet Cupcakes With Sugar-Free Cream Cheese Frosting",
    "url": "http://allrecipes.com/recipe/219859/gluten-free-sugar-free-red-velvet-cu/"
}