{
    "directions": [
        "Dissolve yeast in 1 cup warm water in a small bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. Whisk in light corn syrup, egg, and vegetable oil.",
        "Whisk white rice flour, brown rice flour, potato starch, tapioca flour, salt, xanthan gum, and baking powder together in the bowl of an electric mixer fitted with a paddle or dough hook attachment. Pour yeast mixture into the bowl; mix on medium speed until well-combined, 3 to 4 minutes. Add up to 2 tablespoons water if the dough is dry or crumbly.",
        "Turn dough out onto a work surface lightly dusted with rice flour and knead gently until smooth, about 5 minutes. Transfer to a large, greased bowl and cover with plastic wrap. Let rise until almost doubled in volume, about 1 hour.",
        "Push down gently on the dough to deflate, and separate into 12 equal pieces. Roll each piece into a rope about 15 inches long and shape into a \"U.\" Twist the two ends of the dough and press them firmly into the top of the loop to form a pretzel shape.",
        "Preheat oven to 425 degrees F (220 degrees C). Generously grease 2 baking sheets.",
        "Bring 4 quarts of water to boil in a large pot. Add the baking soda and white sugar carefully; water will foam vigorously. Gently place one pretzel into the water bath; remove with a large slotted spoon when it floats to the top of the water and transfer to a dry baking sheet. Repeat with remaining pretzels. Transfer boiled pretzels to greased baking sheets, brush with melted butter, and sprinkle with pretzel salt.",
        "Bake in the preheated oven until pretzels are golden brown, rotating the baking sheets halfway through baking, about 25 minutes. Remove from the oven and allow to cool on a cooking rack."
    ],
    "ingredients": [
        "2 1/4 teaspoons active dry yeast",
        "1 cup warm water",
        "3 tablespoons light corn syrup",
        "1 egg",
        "2 tablespoons vegetable oil",
        "2 cups white rice flour, plus more for dusting",
        "1 cup brown rice flour",
        "1/2 cup potato starch",
        "1/4 cup tapioca flour",
        "1 teaspoon salt",
        "1 teaspoon xanthan gum",
        "1/2 teaspoon baking powder",
        "2 tablespoons water (optional)",
        "4 quarts water",
        "1/4 cup baking soda",
        "2 tablespoons white sugar",
        "2 tablespoons butter, melted",
        "pretzel salt, for topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten-Free Pretzels",
    "url": "http://allrecipes.com/recipe/245408/gluten-free-pretzels/"
}
