{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line 24 muffin cups with paper liners.",
        "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels.",
        "Mix flour, white sugar, cocoa powder, xanthan gum, baking soda, baking powder, and sea salt together in a bowl. Beat coffee, buttermilk, eggs, canola oil, and 1 fluid ounce whiskey together in a separate large bowl. Slowly mix dry ingredients into wet until combined into a batter.",
        "Crumble approximately half of the cooked bacon into the batter and stir; divide batter evenly between the lined muffin cups.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Beat cream cheese, confectioners' sugar, and 1 fluid ounce whiskey together in a small bowl; spread over the top of the cooled cupcakes. Crumble remaining bacon and sprinkle over the frosted cupcakes."
    ],
    "ingredients": [
        "Cupcakes:",
        "12 slices bacon",
        "2 cups gluten-free all purpose baking flour",
        "2 cups white sugar",
        "3/4 cup unsweetened cocoa powder",
        "2 1/4 teaspoons xanthan gum",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon sea salt",
        "1 cup cold strong-brewed coffee",
        "1 cup buttermilk",
        "2 eggs",
        "1/2 cup canola oil",
        "1 fluid ounce whiskey",
        "Frosting:",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup confectioners' sugar",
        "1 fluid ounce whiskey (such as Jack Daniel's®), divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten-Free Chocolate-Whiskey-Bacon Cupcakes",
    "url": "http://allrecipes.com/recipe/241405/gluten-free-chocolate-whiskey-bacon-c/"
}
