{
    "directions": [
        "Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 350°F. Line three baking sheets with silicone baking mats, non-stick foil, or parchment paper and set aside.",
        "In a small saucepan, heat cream and brown-rice syrup over medium heat until it just begins to simmer. Immediately remove pot from heat and stir in chocolate. Let stand for 3 minutes, and then stir until chocolate is melted and smooth. Add orange liqueur and stir to combine.",
        "Transfer chocolate filling to a bowl and let stand at room temperature until the texture thickens and resembles peanut butter, whisking occasionally, about 45 minutes.",
        "In a blender or food processor, pulse the oats, gluten-free flour, and salt together until oats are coarsely ground. Set aside.",
        "In a small, deep saucepan, combine the sugar, cream, brown-rice syrup and butter. Bring to a boil over medium heat, stirring occasionally, and then boil for 1 minute. Remove the pot from the heat and stir in vanilla. Add the oat mixture and stir until well combined. Let dough cool for 15 minutes.",
        "Scoop dough by the packed teaspoon onto the prepared baking sheets, leaving three inches between as the batter spreads quite a bit. Working in batches, bake the cookies until golden and darker around the edges, 10 to 12 minutes, rotating pans halfway through baking. Let cookies cool completely before removing them from the baking sheets.",
        "Spread 1 teaspoon of filling on the flat side of one cookie and press another cookie gently on top to adhere. Let set briefly before serving.",
        "Make Ahead: Store cookies at room temperature in an airtight container in single layers separated by parchment or wax paper for up to 3 days or in the freezer for up to 2 weeks."
    ],
    "ingredients": [
        "1/4 cup heavy cream",
        "1 tablespoon brown rice syrup",
        "6 ounces high-quality bittersweet chocolate, finely chopped",
        "1 tablespoon orange liqueur, such as Cointreau",
        "1 3/4 cups gluten-free rolled oats",
        "3 tablespoons rice-based gluten-free all-purpose flour*",
        "1/4 teaspoon fine sea salt",
        "3/4 cup granulated sugar",
        "2 tablespoons heavy cream",
        "2 tablespoons brown-rice syrup",
        "5 tablespoon unsalted butter",
        "1/2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Bake",
        "Wheat/Gluten-Free",
        "Oat"
    ],
    "title": "Gluten-Free Lacy Oat Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/gluten-free-lacy-oat-sandwich-cookies-51259010"
}
