{
    "directions": [
        "Arrange the racks in the upper and lower rungs in the oven and preheat the oven to 325°F. Use a coffee grinder or mortar and pestle to grind the psyllium, flax and chia seeds to a fine powder, transfer to a bowl along with the flour mix, cornstarch, and salt. Whisk a few times to combine, and set aside.",
        "In a separate large bowl, beat the sugar and butter together using an electric mixer. Beat in the yolks and vanilla until combined. Add the flour mixture and mix just until combined. Divide the dough in three equal parts, placing each in a medium bowl. Add one type of zest to each bowl. Mix the zest into the dough until evenly distributed. Form each dough into a disc, wrap in plastic, and refrigerate until dough has firmed up a bit, about 15 minutes. Place each piece of dough between two pieces of parchment and roll to a 8-x-6-inch rectangle. Stack the dough sheets and transfer to the refrigerator. Chill until firmed up, about 30 minutes.",
        "Remove the dough from the refrigerator and remove top layers of parchment. Using a sharp knife, cut the dough lengthwise and crosswise to form 1 1/4-inch squares. Arrange the dough squares 2 inches apart on two baking sheets. Chill until firm, about 15 minutes.",
        "Bake cookies until light golden on the edges, about 15 minutes. Let cool for 10 minutes on the baking sheet, then transfer the cookies to wire rack set over a parchment-lined baking sheet to cool completely.",
        "Sift the confectioners sugar into a large bowl, add the ground cloves, and whisk together to combine. Whisk in the melted butter. Place a third of the mixture into each of three separate small bowls. Whisk one type of juice into each of the separate bowls to make three varieties of citrus glazes.",
        "Glaze the top of each type of cookie with 1 teaspoon of glaze of the same flavor. Use the back of a spoon or a small offset spatula to spread the glaze over the top of the cookie. Repeat to glaze all of the cookies. Sprinkle the zest of the same citrus over each cookie. Let stand at room temperature until set, about 2 hours."
    ],
    "ingredients": [
        "1/2 teaspoon psyllium-husk powder",
        "1 1/2 teaspoon whole flax seeds",
        "1 teaspoon chia seed",
        "2 1/2 cups rice-based gluten-free all-purpose flour*",
        "2 tablespoons cornstarch",
        "1/4 teaspoon fine sea salt",
        "1 cup granulated sugar",
        "1 cup (2 sticks) unsalted butter, softened",
        "2 large egg yolks",
        "1 1/2 teaspoon vanilla extract",
        "1/2 teaspoon finely grated lime zest",
        "1/2 teaspoon finely grated lemon zest",
        "1/2 teaspoon finely grated grapefruit zest",
        "1 cup confectioners sugar",
        "1/8 teaspoon ground cloves",
        "2 tablespoons butter, melted",
        "1/2 teaspoon finely grated lime zest, plus 2 1/2 teaspoon lime juice",
        "1/2 teaspoon finely grated lemon zest, plus 2 1/2 teaspoon lemon juice",
        "1/2 teaspoon finely grated grapefruit zest, plus 2 1/2 teaspoon grapefruit juice",
        "coffee grinder or mortar and pestle, stand or hand mixer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Bake",
        "Wheat/Gluten-Free",
        "Grapefruit",
        "Lemon",
        "Lime"
    ],
    "title": "Gluten-Free Citrus Sugar Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/gluten-free-citrus-sugar-cookies-51259030"
}
