{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch loaf pan; dust with 1 tablespoon rice flour.",
        "Mix brown rice flour, 1/2 cup rice flour, tapioca flour, and salt together in a bowl.",
        "Combine egg whites and cream of tartar in the bowl of a stand mixer fitted with the paddle attachment; beat for 3 to 4 minutes. Add 1/2 cup sugar gradually, continuing to beat until stiff and glossy peaks form. Transfer beaten egg whites carefully into a clean, dry bowl.",
        "Combine egg yolks, remaining 1/2 cup sugar, and lemon zest in the bowl of the stand mixer. Beat for 3 to 4 minutes. Add oil very slowly, continuing to beat until fully incorporated.",
        "Fold rice flour mixture and beaten egg whites very gently into the egg yolk mixture. Pour 3/4 of the batter into the prepared loaf pan.",
        "Fold walnuts, vanilla extract, cocoa powder, and coffee powder into the remaining batter. Pour into the loaf pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Turn off oven and let cake cool inside, about 20 minutes. Transfer cake to a wire rack and let cool completely, about 20 minutes."
    ],
    "ingredients": [
        "1 tablespoon rice flour",
        "1/2 cup brown rice flour",
        "1/2 cup rice flour",
        "2 teaspoons tapioca flour",
        "1/2 teaspoon salt",
        "4 eggs, at room temperature, separated",
        "1/2 teaspoon cream of tartar",
        "1 cup white sugar, divided",
        "1 tablespoon lemon zest",
        "1 cup grapeseed oil",
        "1 cup chopped toasted walnuts",
        "1 tablespoon vanilla extract",
        "1 tablespoon unsweetened cocoa powder",
        "1 teaspoon instant coffee powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten-Free Walnut and Chocolate Pound Cake",
    "url": "http://allrecipes.com/recipe/257154/gluten-free-walnut-and-chocolate-poun/"
}
