{
    "directions": [
        "Preheat the oven to 325 degrees F. Lightly grease a 7 by 4 by 3-inch loaf pan with oil.",
        "Pour the rice milk and apple cider vinegar into a small bowl, but do not stir; set aside. This will create your \"buttermilk.\"",
        "In a medium bowl, whisk together the flour, cornmeal, cornflour, baking powder, baking soda, xanthan gum, and salt. Add the oil, agave nectar, applesauce, and vanilla to the dry ingredients. Stir the batter until well combined. Pour in the \"buttermilk,\" and mix gently until the ingredients are fully incorporated and a slightly grainy batter is formed.",
        "Pour the batter into the prepared pan and sprinkle with some kosher salt. Bake the cornbread on the center rack for 34 minutes, rotating the pan 180 degrees after 20 minutes. The cornbread will bounce slightly when pressed and a toothpick inserted in the center will come out clean. Let the cornbread stand in the pan for 20 minutes, then gently run a knife around the edge of the bread. Cover the top of the pan with a cutting board, and invert onto the board. Carefully lift the pan away and re-invert the cornbread onto another cutting board. Either cut and serve warm, or wait until it is completely cool before storing. Cover the uncut cornbread with plastic wrap and store at room temperature for up to 3 days.",
        "Pour all the flours into a large container. (Restaurant supply stores sell large plastic containers that fit this purpose well. You could also use a large glass jar.) Shake and shake and shake harder until all the flours have become one color.",
        "Recipe Courtesy of Shauna James Ahern"
    ],
    "ingredients": [
        "2/3 cup rice milk",
        "1 tablespoon apple cider vinegar",
        "3/4 cup All-Purpose Gluten-Free Flour Mix, recipe follows",
        "1/2 cup cornmeal",
        "1/2 cup cornflour",
        "2 teaspoons baking powder",
        "1 teaspoons baking soda",
        "1 teaspoon xanthan gum",
        "1 teaspoon kosher salt, plus more for sprinkling",
        "1/2 cup coconut oil, plus more for pans",
        "1/3 cup agave nectar",
        "1/3 cup applesauce",
        "2 teaspoons pure vanilla extract",
        "400 grams millet flour",
        "300 grams sweet rice flour",
        "300 grams potato starch"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Cornbread",
        "Grain Recipes",
        "Apple",
        "Fruit",
        "Cornmeal",
        "Rice Recipes",
        "Dairy Recipes",
        "Coconut Recipes",
        "Gluten Free"
    ],
    "title": "Gluten-Free Cornbread",
    "url": "http://www.foodnetwork.com/recipes/gluten-free-cornbread-2"
}
