{
    "directions": [
        "Preheat the oven to 350 degrees F. Line an 8-inch square metal, ceramic, or glass baking pan with 2 long pieces of aluminum foil, layering the pieces across one another and crimping the overhang over the sides of the pan.",
        "Melt the butter and chocolate together in a small (1 1/2-quart) heavy-bottomed saucepan over low heat, stirring constantly to make sure the chocolate doesn't burn. When nearly all the chocolate is melted, remove the pan from the heat and continue stirring to melt completely.",
        "Scrape the melted chocolate into a large mixing bowl with a silicone spatula. Stir in the applesauce and vanilla extract, then stir in the sugar and salt until a grainy batter forms.",
        "Stir in the eggs one at a time, making sure the first egg is fully incorporated before adding the next.",
        "Gently stir in the almond flour 1/4 cup at a time, then stir in the almonds.",
        "Pour the batter into the prepared baking pan, spreading it evenly to reach all the corners of the pan.",
        "Make the almond butter swirl by beating the almond butter, sugar, and applesauce together with a silicone spatula or electric hand mixer on low speed.",
        "Drop the almond butter in spoonfuls over the brownie batter and use the tip of a butter knife to carefully swirl into the batter, making sure not to puncture the foil on the bottom of the pan.",
        "Bake for 45 minutes to 1 hour, or until a toothpick or small knife inserted into the center of the pan comes out with moist crumbs attached. (Baking time will be slightly longer for ceramic and glass pans than for metal pans.)",
        "Cool completely in the pan for at least an hour and preferably overnight.",
        "Use the long edges of the foil to carefully lift the bars out of the pan and onto a cutting board. Peel the foil off and cut the brownies into squares.",
        "Brownies taste best when baked the day before you plan to serve them. Leftover brownies can be stored in the refrigerator in an airtight container for up to 5 days."
    ],
    "ingredients": [
        "Brownie Base:",
        "4 tablespoons unsalted butter, cut into 1/2-inch slices",
        "4 ounces unsweetened chocolate, chopped",
        "1/4 cup Mott's® Original or Natural Applesauce",
        "1 teaspoon vanilla extract",
        "1 cup granulated sugar",
        "1/2 teaspoon fine sea salt or kosher salt",
        "2 large eggs",
        "3/4 cup almond flour",
        "1/4 cup chopped roasted unsalted almonds",
        "Almond Butter Swirl:",
        "1/2 cup smooth almond butter",
        "1/4 cup powdered sugar",
        "2 tablespoons Mott's® Original or Natural Applesauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten Free Almond Swirl Brownies",
    "url": "http://allrecipes.com/recipe/241046/gluten-free-almond-swirl-brownies/"
}
