{
    "directions": [
        "Preheat the oven to 350 degrees F. Line an 8-inch square metal, ceramic, or glass baking pan with 2 long pieces of aluminum foil, layering the pieces across one another and crimping the overhang over the sides of the pan.",
        "Make the crust: Whisk the coconut flour, almond flour, sugar, and salt together in a medium mixing bowl. Stir in the coconut, poppy seeds and lemon zest.",
        "Whisk the butter, applesauce, and egg yolk together in a small bowl, then stir into the crust.",
        "Press the crust evenly across the bottom of the prepared baking pan.",
        "Bake the crust for 10-15 minutes, or until the edges just start to brown. (Baking time will be slightly longer for ceramic and glass pans than for metal pans.)",
        "While the crust bakes, make the filling: Whisk the eggs, lemon juice, lemon zest, and applesauce together in a medium mixing bowl until the eggs are well blended.",
        "Whisk in the sugar and cornstarch.",
        "Pour the filling over the baked crust and return the pan to the oven.",
        "Bake for 25-30 minutes more, until the filling is set.",
        "Cool in the pan on a wire rack for 5 minutes, then use the long edges of the foil to carefully lift the bars out of the pan and onto the rack.",
        "Cool to room temperature, then peel the foil off. Dust the bars with powdered sugar and sprinkle with poppy seeds, then cut into squares or longer bars.",
        "Bars can be made up to 3 days in advance and stored in the refrigerator in an airtight container."
    ],
    "ingredients": [
        "Crust:",
        "1/2 cup coconut flour",
        "1/4 cup almond flour",
        "2 tablespoons granulated sugar",
        "1/4 teaspoon kosher salt",
        "1/4 cup shredded toasted coconut",
        "1/4 teaspoon poppy seeds",
        "Zest of 1 lemon",
        "2 tablespoons unsalted butter, melted",
        "2 tablespoons Mott's® Original Applesauce",
        "1 large egg yolk",
        "Filling:",
        "4 large eggs",
        "1/3 cup lemon juice",
        "Zest of 2 lemons",
        "1/4 cup Mott's® Original or Natural Applesauce",
        "1/2 cup granulated sugar",
        "1/4 cup cornstarch",
        "Topping:",
        "Powdered sugar",
        "Poppy seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten Free Lemon Coconut Poppy Seed Bars",
    "url": "http://allrecipes.com/recipe/241047/gluten-free-lemon-coconut-poppy-seed/"
}
