{
    "directions": [
        "Heat milk in a microwave-safe bowl until warm, about 30 seconds. Mix in 1/4 cup butter, 2 tablespoons plus 2 teaspoons honey, and salt. Cool until lukewarm, 3 to 5 minutes.",
        "Combine warm water and yeast in a small bowl. Let stand until dissolved and creamy, about 5 minutes.",
        "Combine milk and yeast mixture in the bowl of a stand mixer fitted with a paddle attachment. Add half the beaten egg. Beat in flour, 1/2 cup at a time, until dough pulls together. Switch to the dough hook attachment and knead lightly until dough is wet and sticky but forms into a ball, about 5 minutes.",
        "Grease a large bowl with 1 teaspoon softened butter. Use greased or wet hands to transfer dough into the bowl, turning to coat it with butter. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Dust a work surface with potato starch. Deflate dough and turn it out onto the work surface. Divide the dough into 4 equal pieces and form into rounds. Place a piece of parchment paper over one of the rounds and roll into a rectangle about 1/8-inch thick with a rolling pin; cut into wedges. Brush each wedge with a little softened butter. Repeat with remaining dough rounds.",
        "Roll each wedge up from the base towards the point. Brush a little bit of remaining beaten egg on the seam to seal. Bend each roll into a crescent shape.",
        "Line baking sheets with parchment paper. Arrange crescents sealed-side down on the sheets. Brush tops with remaining beaten egg.",
        "Transfer baking sheets to the cold oven. Heat oven to 365 degrees F (185 degrees C).",
        "Bake crescents until golden brown, about 25 minutes."
    ],
    "ingredients": [
        "1/4 cup whole milk",
        "1/4 cup butter, softened",
        "2 tablespoons honey",
        "2 teaspoons honey",
        "1/8 teaspoon salt",
        "1/4 cup warm water (110 degrees F (43 degrees C))",
        "1/2 (.25 ounce) package active dry yeast",
        "1 egg, beaten, divided",
        "2 cups gluten-free all-purpose flour",
        "1 tablespoon butter, softened, divided",
        "1 tablespoon potato starch, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gluten-Free Crescent Rolls",
    "url": "http://allrecipes.com/recipe/246678/gluten-free-crescent-rolls/"
}
