{
    "directions": [
        "Cover the potatoes with water in a medium pot. Bring to a boil and cook until fork-tender, about 25 minutes; remove. Once the potatoes are cool enough to handle, remove the skin and work the potatoes through a ricer set over a large bowl (should have about 2 cups). Set aside.",
        "Stir together the warm water, agave and yeast in a measuring cup or small bowl. Let sit until a small layer of foam develops at the top, 3 to 5 minutes. (If this doesn't happen, discard and try again with new yeast.)",
        "Add the potatoes, rice flour, tapioca starch and 3/4 teaspoon salt to the bowl of a stand mixer fitted with the paddle attachment. Mix on medium speed until the mixture is combined and forms a fine, crumbly meal. Continuing to mix on medium, add the egg white and oil, slowly drizzle in the yeast mixture and mix until the dough comes together (it will be slightly tacky). Cover the bowl tightly with plastic wrap and set in a warm place until the dough increases by half, about 1 1/2 hours.",
        "Form the dough into two or four balls, for small or medium pizzas, then either cook them as desired or wrap them well and freeze for up to 1 month. Thaw frozen dough at room temperature, then shape and cook."
    ],
    "ingredients": [
        "2 large all-purpose potatoes (about 14 ounces)",
        "1/3 cup warm water (110 degrees F)",
        "2 teaspoons agave syrup or honey",
        "One 1/4-ounce package active dry yeast",
        "1 cup white rice flour",
        "1/2 cup tapioca starch",
        "Kosher salt",
        "1 large egg white",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pizza Dough",
        "Potato",
        "Vegetable",
        "Heart-Healthy",
        "Low-Fat",
        "Low-Cholesterol",
        "Low Calorie",
        "Gluten Free"
    ],
    "title": "Gluten-Free Pizza Dough",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/gluten-free-pizza-dough"
}
