{
    "directions": [
        "Preheat oven to 325°F. Butter cake pan, then line bottom with parchment paper. Butter parchment, then sprinkle evenly with 1/4 cup almonds.",
        "Pit and coarsely chop 6 oz. apricots. Pulse salt, 1 1/2 cups sugar, and remaining 2 1/4 cups almonds in a food processor until finely ground. Add eggs, vanilla, 6 Tbsp. butter, and half of the chopped apricots; process until very smooth. Add flour and baking powder; pulse until combined, then fold in remaining chopped apricots. Transfer to prepared pan.",
        "Bake cake until golden brown and the center no longer jiggles when shaken, 60–70 minutes. Transfer pan to a wire rack and let cake cool completely.",
        "Meanwhile, pit and slice remaining 10 oz. apricots. Toss apricots, amaretto, if using, and remaining 2 Tbsp. sugar in a medium bowl. Let sit at least 10 minutes or up to 1 hour. Using a whisk or an electric mixer on medium-high speed, whip cream to soft peaks in a large bowl.",
        "Run a knife around edges of cooled cake and invert onto a platter.",
        "Serve with macerated apricots and whipped cream alongside.",
        "Cake can be baked 3 days ahead. Cover and chill. Let come to room temperature before serving."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, plus more for pan",
        "2 1/2 cups blanched sliced almonds (about 10 ounces), divided",
        "1 pound apricots, divided",
        "1/2 teaspoon kosher salt",
        "1 1/2 cups plus 2 tablespoons sugar, divided",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "3/4 cup all-purpose flour (regular or gluten-free)",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon amaretto (optional)",
        "2 cups heavy cream",
        "A 9-inch cake pan (preferably light-colored metal)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#CAKEWEEK",
        "Cake",
        "Wheat/Gluten-Free",
        "Apricot",
        "Summer",
        "Almond",
        "Amaretto",
        "Dessert",
        "Bake",
        "Food Processor",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Almond-Apricot Food Processor Cake",
    "url": "http://www.epicurious.com/recipes/food/views/gluten-free-almond-apricot-food-processor-cake"
}
