{
    "directions": [
        "Cut the baked potato in half and scoop the flesh into a large bowl; discard the skin. Using a fork mash the potato, salt and pepper together until smooth. Mix in 3 tablespoons of the egg (reserve the remaining egg for another use). Sprinkle the flour over the potato mixture. Stir until the mixture forms a dough. Knead until smooth, 30 seconds.",
        "On a lightly floured work surface, divide the dough into 4 equal pieces. Roll each piece between your palms and the work surface into a 1/2-inch-diameter rope (about 20 inches long). Cut the dough into 1-inch pieces. Roll each piece of dough over a wooden paddle with ridges or over the tines of a fork to form grooves in the dough.",
        "Bring a large pot of salted water to a boil over high heat. Add the gnocchi and cook until the gnocchi rise to the surface, about 1 minute. Continue cooking until the gnocchi are tender, 1 to 2 minutes longer. Drain and reserve about 1 cup of pasta cooking water.",
        "For the sauce: In a large nonstick skillet, heat the oil over medium-high heat. Add the olives and cook for 1 minute. Add the tomato sauce and bring to a simmer. Add the gnocchi to the skillet and stir until heated through, about 1 minute. Transfer to a large serving bowl. Add the Parmesan and basil. Toss gently until all the ingredients are coated, adding the reserved pasta water as needed to loosen the sauce, and serve."
    ],
    "ingredients": [
        "One 1-pound russet potato, baked and cooled (see Cook's Note)",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 large egg, beaten",
        "1/4 cup all-purpose flour, plus extra for dusting",
        "1 tablespoon extra-virgin olive oil",
        "3/4 cup kalamata or green olives, pitted and halved",
        "1 1/2 cups tomato-basil sauce, such as Giada De Laurentiis for Target",
        "3/4 cup grated Parmesan",
        "1/2 packed cup fresh basil leaves, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Gnocchi",
        "Tomato",
        "Vegetable",
        "Potato",
        "Olive Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Gnocchi with Tomatoes, Basil and Olives",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/gnocchi-with-tomatoes-basil-and-olives-recipe"
}
