{
    "directions": [
        "To make the Sauce: Take the tomatoes out of the can, cut in half, and remove the seeds. Chop the tomatoes into small pieces and reserve the juice. In a saucepan, add olive oil and garlic and saute for 1 minute. Add the tomatoes, salt, pepper and chili and bring to a simmer for 5 minutes. If necessary, add the reserved juice. Add the basil. Finish with cream.",
        "To make the gnocchi: Preheat the oven to 300 degrees F.",
        "Bake the potatoes for approximately 1 to 1 1/2 hours, until tender. Scoop each potato out of its skin into mixing bowl. Mash the potatoes to a fine consistency.",
        "In a separate bowl, combine egg yolks, melted butter, salt, pepper and nutmeg. Add the egg mixture to the potatoes and mix together. Add flour to mixture, 1 cup at a time, and mix until smooth.",
        "Scoop out and make finger sized rolls on floured board. Cut with knife into bite sized pieces. Roll each piece over the back of a fork to make a round form. In a pan, freeze until hard enough to handle, and put into portion sized bags.",
        "Fill a large pot with water and add a pinch of salt and boil. Drop gnocchi into boiling water 3 or 4 at a time so the water doesn't stop boiling. The gnocchi is ready when it floats to the top. Drain gnocchi and scoop out into bowl and add sauce. Add fresh Parmesan and serve."
    ],
    "ingredients": [
        "1 (28-ounce) can whole Italian tomatoes",
        "2 tablespoons olive oil",
        "1 tablespoon chopped garlic",
        "Salt",
        "Pepper",
        "Crushed chile flakes",
        "6 to 8 large fresh basil leaves, chopped",
        "1/2 cup cream",
        "6 large baking potatoes, like russets",
        "2 egg yolks",
        "4 ounces (1 stick) butter, melted",
        "Pinch salt",
        "Pinch white pepper",
        "Fresh grated nutmeg",
        "2 cups flour",
        "Grated Parmesan, to serve"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "European Recipes",
        "Gnocchi",
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Potato",
        "Dairy Recipes",
        "Cheese",
        "Appetizer",
        "Main Dish Recipes"
    ],
    "title": "Gnocchi Pomodoro",
    "url": "http://www.foodnetwork.com/recipes/gnocchi-pomodoro-recipe0"
}
