{
    "directions": [
        "Cook the butter in a heavy medium skillet over medium heat until it begins to brown, about 2 minutes. Remove from the heat. Add the thyme leaves. Set aside.",
        "Pierce the potato all over with a fork. Microwave the potato until tender, turning once, about 12 minutes. Cut the potato in half and scoop the flesh into a large bowl; discard the skin. Using a fork, mash the potato well. Mash in the salt and pepper. Mix in 3 tablespoons of the egg; discard the remaining egg. Sift the flour over the potato mixture and knead just until blended.",
        "Divide the dough into 4 equal pieces. Roll each piece between your palms and the work surface into a 1/2-inch-diameter rope (about 20 inches long). Cut the dough into 1-inch pieces. Roll each piece of dough over a wooden paddle with ridges or over the tines of a fork to form grooves in the dough.",
        "Cook the gnocchi in a large pot of boiling salted water until the gnocchi rise to the surface, about 1 minute. Continue cooking until the gnocchi are tender, about 4 minutes longer. Using a slotted spoon, transfer the gnocchi to the hot thyme-butter in the skillet. Toss to coat.",
        "Spoon the gnocchi and butter sauce into shallow bowls. Top with the Pecorino and serve."
    ],
    "ingredients": [
        "1/2 cup unsalted butter",
        "1 tablespoon fresh thyme leaves",
        "1 (1-pound) russet potato",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 large egg, beaten to blend",
        "1/4 cup all-purpose flour",
        "1/4 cup shaved Pecorino Romano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheesy Potatoes",
        "Cheese",
        "Potato",
        "Vegetable",
        "European Recipes",
        "Italian",
        "Gnocchi",
        "Main Dish Recipes"
    ],
    "title": "Gnocchi with Butter Thyme Sauce",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/gnocchi-with-butter-thyme-sauce-recipe"
}
