{
    "directions": [
        "It is easier to dice the neck of the butternut squash uniformly than the bulb, which is important for this recipe. We use the remaining bulb for soup. Cut off and discard the stem end of the squash, then cut off the neck. Use a paring knife or sharp vegetable peeler to slice away the peel deep enough to reach the bright orange flesh of the squash. Trim the neck to straighten the sides, then cut it lengthwise into 1/2-inch-thick slices. Cut the slices into 1/2-inch dice. (You need about 3 cups diced squash.) If you have less than 3 cups, peel the bulb of the squash, cut it in half, and scrape out the seeds. Trim and cut as much of the bulb as you need into 1/2-inch dice. Reserve the remaining squash for another use.",
        "Line a baking sheet with paper towels.",
        "Heat a thin film of canola oil over medium heat in a skillet large enough to hold the squash in a single layer (or cook the squash in two batches). When the oil is hot, add the butter and brown it lightly. Add the squash, salt and pepper to taste, and the sage leaves. Cook, stirring the pieces to brown them on all sides, for 4 to 6 minutes, or until tender throughout. Reduce the heat as necessary to cook the squash and brown it lightly, without burning; the best way to see if the squash is fully cooked is to eat a piece. Drain the squash on one end of the paper towel–lined baking sheet and set aside the sage leaves for the garnish. Wipe out the skillet with a paper towel and set aside.",
        "Trim away the tough stems and cut the caps into 1/4-inch-thick slices.",
        "Heat a thin film of canola oil in the same skillet over high heat. When the oil begins to smoke, add the mushrooms and salt and sauté for about a minute. The mushrooms will absorb the oil and should not weep any liquid. Add the butter, shallots, thyme, and pepper, then toss and sauté until the mushrooms are thoroughly cooked, 3 to 4 minutes total. Drain the mushrooms on the paper towel–lined baking sheet. The gnocchi should be cooked in two skillets: Wipe out the mushroom skillet with paper towels and add a light coating of olive oil to it and to a second large skillet.",
        "Heat the oil over medium-high heat until hot. Add 1 tablespoon of the butter to each skillet. When the butter has browned, divide the gnocchi between the two skillets and season to taste with salt and pepper. Once the gnocchi have begun to brown, shake and rotate the skillets, tossing the gnocchi so that they brown and crisp on all sides, about 2 1/2 minutes.",
        "Add the squash, mushrooms, and chives and heat just through. Spoon the gnocchi and vegetables onto serving plates and return one skillet to high heat. Add the remaining 2 tablespoons butter and cook until it is a rich brown, then quickly add the parsley to crackle for a few seconds. Standing back—the butter will spatter—add a squeeze of lemon half. Spoon the brown butter and herbs over the gnocchi and around the plates. Garnish with the reserved sage leaves."
    ],
    "ingredients": [
        "One 2 1/2- to 3-pound butternut squash (one with a long neck)",
        "Canola oil",
        "1 tablespoon unsalted butter",
        "Kosher salt and freshly ground black pepper",
        "12 small sage leaves",
        "12 ounces shiitake mushrooms, cleaned",
        "Canola oil",
        "1 1/2 teaspoons kosher salt",
        "1 tablespoon unsalted butter",
        "3 tablespoons minced shallots",
        "1 tablespoon minced thyme",
        "3/4 teaspoon freshly ground black pepper",
        "Extra virgin olive oil",
        "4 tablespoons (2 ounces) unsalted butter",
        "1/2 recipe Herb Gnocchi , thawed if frozen",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons minced chives",
        "1 tablespoon chopped Italian parsley",
        "1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Vegetable",
        "Sauté",
        "Butternut Squash",
        "Fall"
    ],
    "title": "Gnocchi with Mushrooms and Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/gnocchi-with-mushrooms-and-butternut-squash-231343"
}
