{
    "directions": [
        "Line a large baking sheet with parchment paper. Add about three-quarters of the semolina to the sheet, spreading it out to form a more or less even layer. Put the rest of the semolina in a medium bowl. Make sure there's space in your fridge to hold the baking sheet.",
        "Combine the ricotta, parmesan, and salt in a large bowl. Use a large wooden spoon to mash and stir the mixture until it's well combined. Put the mixture in a disposable piping bag (or resealable plastic bag). With your fingers, work the mixture toward the tip and twist the top of the bag. Use kitchen scissors to cut an opening about 1 1/4 inches across at the tip of the piping bag (or a bottom corner of the plastic bag). Pipe the mixture onto the semolina-lined tray in 3 or 4 long straight lines, leaving an inch or two of space between them.",
        "Hold a pair of kitchen scissors perpendicular to the tray (you could use a knife, but the scissors make it faster and easier) and snip each strip of dough every 1 1/4 to 1 1/2 inches along its length. You want to turn each strip into 9 or 10 pudgy little logs.",
        "Working with one little log at a time, gently press the ends between your palms to make the log shorter and a little pudgier, almost round. Try not to form any creases as you do this (the gnudi shouldn't look like little bums) or any pointed edges. Hold the log gently in the palm of one hand over the bowl of semolina. grab a large pinch of semolina and sprinkle it over the gnudi, gently turning the gnudi so the semolina coats every bit of it. Carefully return it to the semolina-covered tray, and repeat with the rest of the logs. Make sure you leave a little space between each one on the tray.",
        "Dust the semolina remaining in the bowl over the gnudi. Cover the tray tightly with plastic wrap, and pop it into the fridge. Keep the gnudi in the fridge, turning them over once a day and covering them again, until they're firm and no longer feel damp—give it at least 3 days, but no more than 4.",
        "Fill a large wide pan or shallow pot two-thirds full with water, salt it generously, and bring it to a boil over high heat. Meanwhile, transfer the gnudi to a large plate, giving each one a gentle but assertive shake to remove any loose semolina.",
        "Put 3 tablespoons of the butter in a shallow pan large enough to hold the gnudi in one layer, add 1/3 cup of the hot salted water, and set over medium heat. once the butter has melted, take the pan off the heat.",
        "Add the remaining 4 tablespoons butter to another large pan, set the pan over medium-high heat, and let the butter melt and foam until it goes slightly nutty and turns light golden brown. Add the sage to the butter in one layer and cook the leaves just until they've gone crispy, about 2 minutes. Transfer them to paper towels to drain and sprinkle them with salt. Keep the brown butter in a warm spot at the back of the stove, off the heat.",
        "Ease the gnudi into the boiling water and cook, gently shaking the pot once (don't stir the gnudi), for 2 minutes. (You might want to set a timer. don't cook them any longer, or they'll fall apart.) Set the pan with the butter-water mixture over high heat. Use a slotted spoon to quickly transfer the cooked gnudi to the butter-water and cook at a vigorous simmer, shaking the pan now and then (again, don't stir the gnudi), until the butter sauce thickens slightly and begins to cling to the gnudi, about 3 minutes.",
        "Serve the gnudi in the pan or divide the gnudi among warm shallow bowls. Sprinkle on the parmesan and a little salt and garnish with the sage leaves. drizzle on as much of the brown butter as you'd like."
    ],
    "ingredients": [
        "1 pound semolina flour",
        "1 pound sheep's-milk ricotta",
        "A 1-ounce chunk of Parmesan, finely grated",
        "1 teaspoon kosher salt",
        "7 tablespoons slightly chilled unsalted butter",
        "20 good-sized sage leaves",
        "Kosher salt",
        "A handful of finely grated Parmesan",
        "Parchment paper; disposable piping bag (or a resealable plastic bag)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Vegetarian",
        "Dinner",
        "Parmesan",
        "Ricotta",
        "Sage",
        "Boil",
        "Butter",
        "Advance Prep Required"
    ],
    "title": "Gnudi",
    "url": "http://www.epicurious.com/recipes/food/views/gnudi-395072"
}
