{
    "directions": [
        "Toast coriander, cumin, cinnamon, and cloves in a small heavy skillet over medium heat, shaking skillet, until fragrant and darker (do not burn), 3 to 4 minutes. Stir in coconut, red-pepper flakes, and turmeric and cook, stirring, until coconut is golden brown, 1 to 2 minutes. Transfer to a bowl and cool completely, then pulse in grinder until finely ground.",
        "Heat oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sauté onion until golden, 3 to 5 minutes. Add garlic, ginger, chiles, tamarind, and spice mixture and cook, stirring, 30 seconds. Add tomato and cook, stirring, until sauce is thickened, 3 to 4 minutes.",
        "Toss shrimp with sea salt, then add to sauce and cook, stirring, until just cooked through, 3 to 5 minutes. Stir in vinegar and season with sea salt."
    ],
    "ingredients": [
        "1 teaspoon coriander seeds",
        "1/2 teaspoon cumin seeds",
        "1 (1-inch) piece cinnamon stick, broken into pieces",
        "4 whole cloves",
        "1/4 cup unsweetened dried grated coconut",
        "1 teaspoon hot red-pepper flakes",
        "1/2 teaspoon turmeric",
        "3 tablespoons vegetable oil",
        "1 medium onion, finely chopped",
        "3 garlic cloves, finely chopped",
        "1 tablespoon grated peeled ginger (use a Microplane)",
        "2 (4-inch) fresh hot green chiles, cut lengthwise into thin shreds, plus seeds",
        "1/4 cup Swad-brand tamarind concentrate (see cooks' note, below)",
        "1 cup finely chopped plum tomato (1 large)",
        "1 1/2 lb large shrimp, peeled",
        "1 teaspoon coarse sea salt such as fleur de sel",
        "2 teaspoons Sherry vinegar or red-wine vinegar",
        "Equipment: an electric coffee/spice grinder",
        "Accompaniment: basmati rice or Indian bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Sauté",
        "Dinner",
        "Coconut",
        "Shrimp",
        "Brooklyn",
        "New York",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Goan Shrimp in Roasted-Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/goan-shrimp-in-roasted-coconut-sauce-242304"
}
