{
    "directions": [
        "Grind the Kashmiri chiles, cinnamon stick, cumin, clove, peppercorns, and turmeric with a mortar and pestle or electric coffee grinder until the spices have been ground smooth. Mix with 1 tablespoon of white vinegar to create a smooth paste.  Season to taste with salt.",
        "Mix the pork cubes with the spice-vinegar paste in a bowl until evenly coated. Cover the bowl with plastic wrap, and marinate in the refrigerator overnight.",
        "Heat the vegetable oil in a Dutch oven or large pot over medium-high heat. Cook and stir the onions, garlic, and ginger until golden brown, about 10 minutes. Add the pork and its marinade, and cook, stirring frequently, until the pork cubes have firmed, about 5 minutes. Pour in the water, bring to simmer, then reduce heat, cover, and cook until the pork is tender, about 40 minutes.",
        "Stir in the green chile pepper strips and 1/4 cup of vinegar. Cook uncovered until the green chile peppers have softened and the vindaloo has thickened, about 30 more minutes. Season to taste with salt before serving."
    ],
    "ingredients": [
        "16 dried Kashmiri chile peppers, stemmed and seeded",
        "1 (1 inch) piece cinnamon stick",
        "1 teaspoon cumin seeds",
        "6 whole cloves",
        "1/2 teaspoon whole black peppercorns",
        "1/2 teaspoon ground turmeric",
        "1 tablespoon white vinegar",
        "salt to taste",
        "2 pounds boneless pork loin roast, trimmed and cut into 1-inch cubes",
        "1/4 cup vegetable oil",
        "4 onions, chopped",
        "10 cloves garlic, minced, or more to taste",
        "1 (2 inch) piece fresh ginger root, minced",
        "2 cups boiling water",
        "2 green chile peppers, seeded and cut into strips",
        "1/4 cup white vinegar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Goan Pork Vindaloo",
    "url": "http://allrecipes.com/recipe/217331/goan-pork-vindaloo/"
}
