{
    "directions": [
        "Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a damp clean kitchen towel. Arrange 1 phyllo sheet on a work surface with a long side nearest you (keep remaining sheets covered) and brush with some butter. Top with 2 more phyllo sheets, brushing each with butter.",
        "Cut buttered phyllo stack crosswise into 5 (12- by 3 1/3-inch) strips.",
        "Put 2 teaspoons red peppers and 2 teaspoons goat cheese near 1 corner of a strip and fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangular shape. Put triangle, seam side down, on a baking sheet and cover with plastic wrap. Make 14 more triangles in same manner, using remaining phyllo and filling (you may have a little butter left over).",
        "Heat oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then fry triangles in 2 batches until golden, about 1 minute per side. Transfer with tongs to paper towels to drain.",
        "Whisk together vinegar, mustard, and salt in a large bowl, then add oil in a slow stream, whisking until emulsified. Add frisée and olives and toss with dressing, then season with pepper. Mound salad on plates and arrange phyllo triangles alongside."
    ],
    "ingredients": [
        "9 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "2/3 cup rinsed and drained bottled red peppers (7-ounce jar), finely chopped and patted dry",
        "5 ounces soft mild goat cheese (2/3 cup)",
        "1/2 cup olive oil",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon Dijon mustard",
        "1/4 teaspoon salt",
        "3 tablespoons extra-virgin olive oil",
        "8 ounces frisée, torn into bite-size pieces (8 cups)",
        "2 tablespoons chopped pitted Kalamata or other brine-cured black olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Olive",
        "Fry",
        "Vegetarian",
        "Lunch",
        "Goat Cheese",
        "Bell Pepper",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Goat Cheese and Red Pepper Phyllo Triangles with Olive Frisée Salad",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-and-red-pepper-phyllo-triangles-with-olive-frisee-salad-106994"
}
