{
    "directions": [
        "Preheat the oven to 400° F. Butter a 6-cup soufflé dish or an 8-cup gratin dish and coat it with the Parmesan. Heat the milk with the aromatics until it boils. Set it aside to steep for 15 minutes, then strain.",
        "Melt the butter in a saucepan. When foamy, stir in the flour and cook over low heat for several minutes. Whisk in the milk all at once and stir vigorously for a minute or so as it thickens, then add 3/4 teaspoon salt, a few twists of pepper, and the cayenne. Remove from heat. Beat in the egg yolks one at a time until well blended, then stir in the cheese. Don't worry about getting it smooth.",
        "Beat the egg whites with a pinch of salt until they form firm peaks, then stir a quarter of them into the base to lighten the mixture. Fold in the rest, transfer to the prepared dish, then put in the center of the oven and lower the heat to 375° F. Bake for 30 minutes or until golden and just a bit wobbly in the center. Remove, scatter the thyme over the top, and serve immediately."
    ],
    "ingredients": [
        "Butter, plus 2 tablespoons freshly grated Parmesan, for the dish",
        "1 1/4 cups milk or cream",
        "Aromatics: 1 bay leaf, several thyme sprigs, 2 thin onion slices",
        "3 tablespoons butter",
        "3 tablespoons flour",
        "Salt and freshly milled pepper",
        "Pinch cayenne",
        "4 egg yolks",
        "1 cup (about 4 ounces) crumbled goat cheese, preferably a Bucheron or other strong-flavored cheese",
        "6 egg whites",
        "Several plump thyme sprigs, leaves only"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Onion",
        "Side",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Parmesan",
        "Thyme",
        "Party",
        "Potluck",
        "Butter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Goat Cheese Soufflé with Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-souffle-with-thyme-358281"
}
