{
    "directions": [
        "To make the lemon curd, finely grate 1 Tbs. zest from the lemons, then squeeze 1/2 cup lemon juice. Add both to a nonreactive saucepan. Whisk in the eggs, sugar and salt. Cook the mixture over medium-low heat, whisking constantly, until it turns bright yellow and is thick enough to coat the back of a wooden spoon (do not let the mixture boil), 3 to 4 minutes. Remove from the heat, whisk in the butter followed by the cream and then strain through a fine-mesh sieve. Let cool to room temperature. Use immediately or cover with plastic wrap, pressing it directly onto the surface of the curd, and refrigerate for up to 3 days.",
        "To make the cheesecake, preheat an oven to 325°F.",
        "In a food processor, finely grind the biscotti. Add the 2 Tbs. sugar, the melted butter and the pinch of salt, and pulse until the mixture resembles wet sand. Transfer to a 9-inch springform pan and press into the bottom and halfway up the sides of the pan. Bake the crust until lightly golden, 10 to 12 minutes. Let cool, then wrap the outside of the pan with a large sheet of aluminum foil.",
        "In a liquid measuring cup, whisk together the eggs, vanilla and lemon oil. Using a stand mixer on medium-high speed, beat the Neufchâtel and goat cheeses until light and creamy, about 4 minutes. Beat in the 1 cup sugar and the 1/4 tsp. salt until thoroughly blended, 1 to 2 minutes. Slowly pour in the egg mixture, beating constantly and scraping the sides of the bowl as needed. Add the sour cream and continue beating until the mixture is light and fluffy, about 1 minute longer. Using a rubber spatula, give the mixture a final stir, scraping the sides and bottom of the bowl.",
        "Pour the filling into the crust and spread it evenly. Place the pan in a large roasting pan. Transfer the roasting pan to the oven and pour in 1 inch of very hot water. Bake the cheesecake until just set and a cake tester inserted into the center comes out clean, 1 to 1 1/4 hours. (Check after 30 minutes and add more hot water to the pan if needed.) Let the cheesecake cool in the water bath on a wire rack for 1 hour. Remove the aluminum foil, then cover the cheesecake with plastic wrap and refrigerate for at least 1 hour. Spread the lemon curd on the cheesecake. Cover with plastic wrap and refrigerate for at least 2 hours or up to 2 days.",
        "Drench a kitchen towel in hot water, wring well and wrap it around the springform pan for 10 seconds. Unclasp and remove the pan sides, transfer the cheesecake to a cake plate, slice and serve. Serves 10 to 12.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Desserts",
        ", by Raquel Pelzel (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "3 lemons",
        "4 eggs, at room temperature",
        "1 cup sugar",
        "Pinch of salt",
        "4 Tbs. (1/2 stick) unsalted butter",
        "2 Tbs. heavy cream",
        "6 oz. almond biscotti, broken into pieces",
        "2 Tbs. plus 1 cup sugar",
        "4 Tbs. (1/2 stick) unsalted butter, melted",
        "Pinch plus 1/4 tsp. salt",
        "4 eggs, at room temperature",
        "1/2 tsp. vanilla extract",
        "1/2 tsp. lemon oil",
        "1 lb. Neufchâtel cheese, at room temperature",
        "1/2 lb. fresh goat cheese, at room temperature",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Goat Cheese-Lemon Cheesecake",
    "url": "http://www.williams-sonoma.com/recipe/goat-cheese-lemon-cheesecake.html"
}
