{
    "directions": [
        "Heat a cast iron skillet over medium heat. Cook sausage patties until golden brown, about 3 minutes per side. Transfer to 3 serving plates.",
        "Bring 3 or 4 cups of salted water to a boil in a large pot. Add potatoes and green onions; cook for 1 to 2 minutes. Drain and cool under running water.",
        "Combine potatoes, green onions, mushrooms, quick-mixing flour, garlic powder, pepper, and sea salt in a bowl; mix well by hand. Blend in goat cheese with your fingers.",
        "Melt butter in the skillet over medium-high heat. Drop potato mixture into the skillet in 3 portions. Flatten into 3-inch pancakes with spoon or spatula. Cook until browned and slightly crusted, 2 to 3 minutes per side. Place on top of sausage patties.",
        "Fill a large saucepan with 2 to 3 inches of water and bring to a boil. Reduce heat to bring water to a gentle simmer; add vinegar. Crack 1 egg into a small bowl. Gently slip into the simmering water, holding the bowl just above the surface of the water. Repeat with remaining eggs.",
        "Cook eggs until the whites are firm and the yolks have thickened, 2 1/2 to 3 minutes. Remove the eggs from the water with a slotted spoon, dab on a kitchen towel to remove excess water, and place on top of pancakes."
    ],
    "ingredients": [
        "3 sausage patties",
        "6 red potatoes, cut into matchsticks",
        "2 green onions, cut into 2-inch matchsticks",
        "2 button mushrooms, thinly sliced and cut into matchsticks",
        "1 tablespoon quick-mixing flour (such as Wondra®), or more as needed",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon fine sea salt",
        "2 tablespoons goat cheese",
        "1 tablespoon butter",
        "1 teaspoon white vinegar",
        "3 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Goat Cheese Potato Pancakes with Poached Eggs",
    "url": "http://allrecipes.com/recipe/255638/goat-cheese-potato-pancakes-with-poac/"
}
