{
    "directions": [
        "Spray one side of a tortilla with oil and place it, oiled side down, on the grill over medium-high heat. Top with one-quarter (about 3 ounces) of the cheese and one-quarter of the salsa. Spray one side of a second tortilla with oil, and place it on top of the first, oiled side up. Cook, about 3 minutes, until the bottom tortilla is golden brown. Turn the quesadilla over and continue cooking, about 3 minutes more, until the bottom is golden brown and the cheese is melted. Remove from the grill and cut into wedges. Repeat with the remaining tortillas, cheese, and salsa. Serve immediately.",
        "Spray a large skillet with oil and warm over medium-high heat on the stove. Place 1 tortilla in the hot skillet, and top with one-quarter (about 3 ounces) of the cheese and one-quarter of the salsa. Top with a second tortilla. Cook, about 3 minutes, until the bottom tortilla is golden brown. Turn the quesadilla over and continue cooking, about 3 minutes more, until the bottom is golden brown and the cheese is melted. Remove from the skillet and cut into wedges. Repeat with the remaining tortillas, cheese, and salsa. Serve immediately.",
        "Make it a meal by adding broiled shrimp. Preheat the broiler. Spread 1 pound of peeled shrimp in a single layer on a baking sheet, spray with olive oil, and season with salt and pepper. Broil, about 2 minutes, until the shrimp is cooked through. Split each shrimp in half lengthwise. Continue with preparation per the camp-stove method. Add 1/4 cup of the shrimp to each quesadilla along with the cheese and salsa."
    ],
    "ingredients": [
        "Olive oil spray or nonstick cooking spray",
        "8 10-inch flour tortillas",
        "12 ounces soft fresh goat cheese, crumbled (about 1 1/2 cups)",
        "Tomato and Corn Salsaepi:recipelink</epi:recipelink>"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetarian",
        "Quick & Easy",
        "Father's Day",
        "Goat Cheese",
        "Summer",
        "Tortillas"
    ],
    "title": "Goat Cheese Quesadillas with Tomato and Corn Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-quesadillas-with-tomato-and-corn-salsa-235221"
}
