{
    "directions": [
        "Generously oil or butter a 9-inch square baking pan and line with a 14- by 8-inch piece parchment paper, allowing ends of paper to overhang 2 opposite edges of pan. Press on paper to coat underside with oil or butter and turn over, keeping ends of paper overhanging.",
        "Preheat oven to 3750 F.",
        "Cut potatoes into 1/4-inch-thick slices and in a kettle of boiling salted water cook until tender but not falling apart, about 8 minutes. Drain potatoes in a colander and cool 15 minutes.",
        "In a large bowl whisk together butter and sour cream until smooth and whisk in goat cheese and eggs until combined well. Add potatoes, tossing gently, and transfer mixture to baking pan. Smooth top with a spatula, spreading potatoes evenly, and sprinkle with thyme. Bake potato cake in middle of oven 35 minutes, or until top is golden, and cool in pan on a rack. Potato cake may be made 2 days ahead and chilled, covered.",
        "Using parchment paper, lift potato cake from pan and transfer to a cutting board. Cut cake into squares, discarding parchment, and serve at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds small red potatoes",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1/2 cup sour cream",
        "4 ounces goat cheese (preferably aged; about 1/2 cup), grated if aged or forced through a grater if soft",
        "2 large eggs",
        "1 teaspoon fresh thyme leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Potato",
        "Appetizer",
        "Bake",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Goat Cheese and Thyme Potato Cake",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-and-thyme-potato-cake-13013"
}
