{
    "directions": [
        "Mix cumin, coriander, ginger, sweet paprika, smoked sweet paprika, smoked hot paprika, and chile powder together in a bowl.",
        "Rub goat shank with about 1/4 teaspoon salt and 1/4 teaspoon pepper.",
        "Heat coconut oil in a large Dutch oven over medium-high heat until melted and shimmering. Cook goat shank in hot oil until browned as completely as you can get it, 2 to 3 minutes per side. Remove shank to a bowl, reserving oil in the skillet.",
        "Reduce heat under the skillet to low. Cook and stir onion in the retained oil until soft, 7 to 10 minutes. Add butternut squash and garlic; cook and stir until the garlic is fragrant, about 1 minute. Sprinkle the cumin mixture over the squash mixture; cook and stir 1 minute more.",
        "Stir tomatoes, water, cinnamon stick, and saffron into the squash mixture; return goat shank to the Dutch oven, bring the liquid to a simmer, and cook until the goat meat is tender and falling from the bone, 90 minutes to 2 hours.",
        "Remove shank from Dutch oven to a cutting board. Strip meat from the bone and cut into bite-size pieces. Discard bone. Stir meat into the squash mixture, season with salt and pepper, and cook until the meat is reheated, about 5 minutes."
    ],
    "ingredients": [
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon ground ginger",
        "1/2 teaspoon sweet paprika",
        "1/2 teaspoon smoked sweet paprika",
        "1/2 teaspoon smoked hot paprika",
        "1/2 teaspoon ancho chile powder",
        "1 (3 pound) bone-in goat shank",
        "1/4 teaspoon salt, or more to taste",
        "1/4 teaspoon ground black pepper, or to taste",
        "2 tablespoons coconut oil",
        "1 onion, chopped",
        "1 (1 pound) butternut squash, peeled and cut into 1/2-inch cubes",
        "4 cloves garlic, minced",
        "1 (14 ounce) can diced tomatoes",
        "1 1/2 cups water",
        "1 cinnamon stick",
        "1 pinch saffron"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Goat and Butternut Squash Stew",
    "url": "http://allrecipes.com/recipe/236899/goat-and-butternut-squash-stew/"
}
