{
    "directions": [
        "Preheat oven to 350°F.",
        "In an 8-inch non-stick skillet melt 1 tablespoon butter over moderate heat and in bowl toss with bread cubes. On a baking sheet toast bread cubes in middle of oven until pale golden and crisp, about 10 minutes, and transfer to a bowl.",
        "Peel sweet potato and cut into 1/4-inch dice. In a steamer set over boiling water steam potato and onion until tender, about 4 minutes, and toss with croutons. Cool mixture and toss with goat cheese and rosemary. In a bowl whisk together eggs and salt and pepper to taste. In skillet heat 1/2 tablespoon butter over moderately high heat until foam subsides. Pour in half of eggs, tilting skillet to spread evenly over bottom. Cook omelet 1 minute, or until almost set, stirring top layer with back of fork and shaking skillet, letting any uncooked egg run underneath. Sprinkle half of omelet with half of crouton mixture and cook 1 minute more, or until set. Fold omelet over filling and transfer to a plate. Keep omelet warm while making another omelet with remaining 1/2 tablespoon butter, eggs, and crouton mixture in same manner."
    ],
    "ingredients": [
        "2 tablespoon unsalted butter",
        "1 cup 1/2-inch cubes country-style bread",
        "1 small sweet potato (about 1/2 pound)",
        "1 small red onion, sliced thin",
        "2 ounces soft mild goat cheese, crumbles (about 1/4 cup)",
        "1 teaspoon minced fresh rosemary leaves",
        "5 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Onion",
        "Potato",
        "Brunch",
        "Quick & Easy",
        "Spring",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Goat Cheese, Sweet Potato, and Crouton Omelets",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-sweet-potato-and-crouton-omelets-13444"
}
