{
    "directions": [
        "Preheat oven to 350°F. Combine garlic and oil in small custard cup. Cover with foil. Bake until garlic is very tender, about 35 minutes. Cool slightly. Add 1 teaspoon salt and 3/4 teaspoon pepper to custard cup and mash to paste. Maintain oven temperature.",
        "Spray four 2-cup soufflé dishes with nonstick spray. Sprinkle each with 1 tablespoon breadcrumbs, coating bottom and sides; place dishes on baking sheet. Melt butter in medium saucepan over medium heat. Add flour; whisk until smooth, about 1 minute. Gradually add milk, whisking constantly until mixture boils, thickens, and is smooth, about 2 minutes. Stir in tomatoes, thyme, and garlic mixture. Remove soufflé base from heat.",
        "Whisk egg yolks in large bowl to blend. Gradually whisk in hot soufflé base, then fold in goat cheese. Using electric mixer, beat egg whites in another large bowl until foamy. Add cream of tartar; beat until stiff but not dry. Fold whites into soufflé mixture in 4 additions. Divide among prepared dishes.",
        "Bake soufflés until puffed and golden, about 25 minutes. Serve immediately."
    ],
    "ingredients": [
        "6 large garlic cloves, flattened",
        "1 teaspoon olive oil",
        "1 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "Nonstick vegetable oil spray",
        "4 tablespoons plain dry breadcrumbs",
        "1 tablespoon butter",
        "2 tablespoons all purpose flour",
        "1 1/4 cups low-fat (1%) milk",
        "1/2 cup finely chopped drained oil-packed sun-dried tomatoes",
        "2 1/2 teaspoons chopped fresh thyme",
        "4 large egg yolks",
        "4 ounces mild fresh goat cheese, crumbled (about 1 cup)",
        "6 large egg whites",
        "1/8 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Healthy"
    ],
    "title": "Goat Cheese, Sun-Dried Tomato, and Roasted Garlic Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-sun-dried-tomato-and-roasted-garlic-souffles-109385"
}
