{
    "directions": [
        "Heat oil in large skillet over medium-high heat. Add shallots and next 5 ingredients; sauté 3 minutes. Add tomatoes; reduce heat and simmer 5 minutes to thicken slightly. Add greens; stir until wilted, about 5 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill.)",
        "Mix first 4 ingredients in large bowl. Stir in 1 1/4 cups water and cilantro. Knead in bowl until smooth, about 5 minutes. Cover with kitchen towel; let rest 30 minutes. Divide dough into 4 pieces; roll each into ball. Cover loosely with plastic wrap; let rest on work surface 30 minutes. Roll out each dough ball on lightly floured surface to 9-inch round.",
        "Heat large dry nonstick skillet over medium heat. Add 1 flatbread round to skillet; cook until bottom of bread is golden brown in spots and bread puffs slightly, about 4 minutes. Turn bread over; cook until bottom is brown in spots, about 3 minutes. Repeat with remaining dough.",
        "Preheat oven to 450°F. Place breads on baking sheet. Spread 1/4 of topping over each. Sprinkle with cheese. Bake until heated through, about 8 minutes.",
        "Available at specialty foods stores, Italian markets, and some supermarkets."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "5 large shallots, finely chopped",
        "3 1/2 tablespoons minced fresh ginger",
        "4 garlic cloves, minced",
        "2 1/2 teaspoons ground coriander",
        "2 1/2 teaspoons ground cumin",
        "1/4 teaspoon dried crushed red pepper",
        "2 1/2 cups crushed tomatoes with added puree",
        "2 cups chopped mustard greens",
        "2 cups semolina flour (pasta flour)*",
        "1 cup all purpose flour",
        "1 teaspoon salt",
        "1 teaspoon dry mustard",
        "1 1/4 cups water, room temperature",
        "3 tablespoons chopped fresh cilantro",
        "8 ounces soft fresh goat cheese (such as Montrachet), crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Tomato",
        "Bake",
        "Sauté",
        "Kid-Friendly",
        "Goat Cheese",
        "Mustard Greens",
        "Shallot"
    ],
    "title": "Goat Cheese Pizzas with Indian-Spiced Tomatoes and Mustard Greens",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-pizzas-with-indian-spiced-tomatoes-and-mustard-greens-105528"
}
