{
    "directions": [
        "Whisk 1/2 cup oil, thyme, and black pepper in small bowl to blend. Arrange grape leaves, vein side up, on work surface. Dip each cheese round into thyme oil and place in center of 1 grape leaf. Fold sides of leaves over cheese; fold up bottom and continue to roll up, enclosing cheese completely. Arrange wrapped cheeses, seam side down, on platter. Brush lightly with some thyme oil. Cover and chill at least 1 hour. (Can be made 1 day ahead; keep chilled. Cover remaining thyme oil and store at room temperature.)",
        "Prepare barbecue (medium-high heat). Whisk 1/4 cup extra-virgin olive oil, vinegar, and mustard in small bowl to blend. Season dressing with salt and pepper. Slightly overlap tomato slices on large platter. Drizzle with dressing; sprinkle with half of olives.",
        "Place wrapped cheese rounds on grill, seam side down. Grill until cheese softens and leaves begin to char, about 2 minutes per side. Arrange cheeses atop tomatoes. Sprinkle with remaining olives.",
        "Brush bread slices with remaining thyme oil. Grill bread until beginning to brown, turning occasionally, about 5 minutes. Cut toasts diagonally in half. Serve cheese, passing toasts separately."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "4 teaspoons chopped fresh thyme",
        "3/4 teaspoon coarsely ground black pepper",
        "12 large grape leaves from jar, rinsed, patted dry, stemmed",
        "3 4- to 5-ounce logs soft fresh goat cheese, each cut crosswise into 4 rounds",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons balsamic vinegar",
        "2 teaspoons Dijon mustard",
        "6 large tomatoes, thinly sliced",
        "1/3 cup coarsely chopped pitted oil-cured black olives (about 30)",
        "6 1/2-inch-thick slices crusty country-style white bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Olive",
        "Tomato",
        "Appetizer",
        "No-Cook",
        "Vegetarian",
        "Goat Cheese",
        "Summer",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Goat Cheese in Grape Leaves with Tomato and Olive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-in-grape-leaves-with-tomato-and-olive-salad-108271"
}
