{
    "directions": [
        "Pulse membrillo, vinegar, Aleppo-style pepper, and lemon juice in a food processor until smooth. Transfer to a small bowl.",
        "Using floured hands, form a heaping tablespoonful of goat cheese into a 1 1/2\"-long log. Transfer to a parchment-lined baking sheet. Repeat with remaining cheese to make 15 more logs. Chill until firm, about 20 minutes.",
        "Pulse panko in a food processor until very finely ground; transfer to a shallow bowl. Whisk eggs and 1 Tbsp. cold water in a second shallow bowl. Place remaining 1 cup flour in a third shallow bowl. Dredge a log of goat cheese in flour, shaking off excess. Dip in egg mixture, letting excess drip back into bowl, then coat in panko, pressing to adhere. Repeat process to create a second coating. Transfer to a baking sheet. Repeat with remaining logs of goat cheese. Chill croquettes in freezer until firm but not frozen solid, about 15 minutes.",
        "Pour oil into a large heavy pot to come 2\" up sides. Fit pot with thermometer and heat oil over medium-high until thermometer registers 350°F. Working in several batches to avoid crowding the pan, fry croquettes, turning occasionally, until golden and crisp, about 2 minutes. Transfer to paper towels to drain; season with salt.",
        "Serve croquettes with spiced membrillo."
    ],
    "ingredients": [
        "8 ounces membrillo (quince paste)",
        "2 tablespoons sherry vinegar",
        "1 tablespoon Aleppo-style pepper",
        "1 teaspoon fresh lemon juice",
        "1 cup all-purpose flour, plus more for hands",
        "8 ounces chilled fresh goat cheese",
        "1 1/2 cups panko (Japanese breadcrumbs)",
        "2 large eggs",
        "Vegetable oil (for frying; about 6 cups)",
        "Kosher salt",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Hors D'Oeuvre",
        "Quince",
        "Goat Cheese",
        "Breadcrumbs",
        "Fry",
        "Deep-Fry"
    ],
    "title": "Goat Cheese Croquettes With Spiced Membrillo",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-croquettes-with-spiced-membrillo"
}
