{
    "directions": [
        "Preheat oven to 350°F. Butter six 3/4-cup soufflé dishes or custard cups.",
        "Cut one 4-ounce goat cheese log into 6 equal rounds. Place 1 round in each prepared dish. Crumble remaining 4-ounce cheese log into large bowl.",
        "Bring milk to simmer in small saucepan. Remove from heat. Melt butter in heavy medium saucepan over medium-high heat. Add flour and stir 2 minutes. Gradually whisk in hot milk. Continue cooking until mixture is smooth and resembles thick paste, whisking constantly, about 2 minutes. Pour mixture over crumbled goat cheese in large bowl. Whisk in Parmesan, yolks, herbs and pepper. Cool soufflé base to lukewarm.",
        "Using electric mixer, beat egg whites with 1/4 teaspoon salt in another large bowl until stiff but not dry. Gently fold 1/4 of egg whites into lukewarm soufflé base to lighten. Fold in remaining egg whites. Divide soufflé mixture among prepared dishes. Transfer dishes to baking sheet and bake until soufflés are puffed and golden brown on top, about 22 minutes.",
        "Place soufflé dishes on serving plates. Mound Mixed Greens with Raspberry Vinaigrette alongside and serve."
    ],
    "ingredients": [
        "2 4-ounce logs soft fresh goat cheese (such as Montrachet)",
        "2/3 cup whole milk",
        "2 tablespoons (1/4 stick) butter",
        "3 tablespoons all purpose flour",
        "1/2 cup freshly grated Parmesan cheese (about 1 1/2 ounces)",
        "4 large egg yolks",
        "2 tablespoons chopped fresh chives",
        "2 teaspoons chopped fresh thyme or 1/2 teaspoon dried",
        "2 teaspoons chopped fresh rosemary or 1/2 teaspoon dried",
        "1/4 teaspoon ground black pepper",
        "6 large egg whites",
        "1/4 teaspoon salt",
        "Mixed Greens with Raspberry Vinaigrette"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Herb",
        "Bake",
        "Vegetarian",
        "Winter"
    ],
    "title": "Goat Cheese Souffles and Mixed Greens with Raspberry Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-souffles-and-mixed-greens-with-raspberry-vinaigrette-5809"
}
