{
    "directions": [
        "Char all peppers over gas flame or in broiler until blackened on all sides. Place in paper bag; seal and let stand at room temperature 15 minutes. Peel and seed peppers; chop.",
        "Heat oil in large skillet over medium heat. Add onion and tomatoes and cook until onion begins to brown, about 4 minutes. Reduce heat to low; cook until vegetables are very soft and onion is brown, stirring often, about 15 minutes. Add chopped peppers and vinegar. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Lightly sprinkle rimmed baking sheet with cornmeal. Mix 8 ounces goat cheese, 1/3 cup Parmesan cheese, and next 2 ingredients in medium bowl. Arrange 6 wonton wrappers on work surface. Place 1 tablespoon cheese filling in center of each wrapper. Using fingertip, dampen edges of wrappers with water. Fold all 4 corners up to meet in center, forming pyramid shape; seal all 4 edges tightly. Pinch top to seal. Place on prepared baking sheet. Repeat with remaining wrappers and filling. DO AHEAD: Can be made 8 hours ahead. Cover and chill.",
        "Cook butter in large skillet over medium heat until beginning to brown, stirring occasionally, about 4 minutes.",
        "Cook ravioli in pot of gently boiling salted water until tender, about 4 minutes. Transfer ravioli to skillet with browned butter. Toss over medium heat.",
        "Meanwhile, rewarm bell pepper mixture; divide among 6 plates. Using slotted spoon, top peppers on each plate with 3 ravioli. Drizzle with any remaining browned butter. Sprinkle with Parmesan, toasted pine nuts, olives, and chives.",
        "*Brine-cured black olives; available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "2 small red bell peppers",
        "2 small yellow bell peppers",
        "1 small green bell pepper",
        "2 tablespoons olive oil",
        "1/2 cup chopped onion",
        "1/2 cup diced seeded tomatoes",
        "2 teaspoons red wine vinegar",
        "Cornmeal for sprinkling",
        "8 ounces soft fresh goat cheese",
        "1/3 cup grated Parmesan cheese plus additional for sprinkling",
        "1/4 cup mascarpone cheese",
        "2 tablespoons chopped assorted fresh herbs (such as basil, chives, mint, and tarragon)",
        "18 wonton wrappers",
        "4 tablespoons (1/2 stick) butter",
        "Toasted pine nuts",
        "Thinly sliced pitted Niçoise olives*",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Pasta",
        "Tomato",
        "Vegetarian",
        "Kid-Friendly",
        "Bell Pepper",
        "Boil"
    ],
    "title": "Goat Cheese Ravioli with Bell Peppers and Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-ravioli-with-bell-peppers-and-brown-butter-239796"
}
