{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add shallots; sauté 10 minutes. Add arugula; toss until wilted but still bright green, about 3 minutes. Transfer arugula mixture to large bowl and cool. Mix in goat cheese and Parmesan cheese. Season filling with salt and pepper.",
        "Line 2 baking sheets with heavy-duty foil; spray foil with nonstick spray. Place 4 wonton wrappers on work surface; cover remaining wrappers with plastic to prevent drying. Lightly brush entire surface of each wrapper with egg white. Spoon 1 generous teaspoon filling into center of each wrapper. Fold wrappers diagonally in half, forming triangles. Press edges firmly to seal. Arrange ravioli on prepared sheets. Repeat with remaining wrappers and filling. (Can be made ahead. Cover with plastic and chill up to 1 day; or cover with plastic, then heavy-duty foil, and freeze up to 1 week. If frozen, do not thaw before cooking.)",
        "Cook chopped pancetta in large skillet over medium-high heat until crisp and brown. Using slotted spoon, transfer pancetta to paper towel; drain. Set aside. Pour off all but 1 tablespoon drippings from skillet. Add butter to drippings in skillet; melt over medium-high heat. Add tomatoes and thyme; sauté until tomatoes are tender, about 5 minutes. Season with salt and pepper. (Can be made 2 hours ahead. Let stand at room temperature.)",
        "Place melted butter in large bowl. Cook half of ravioli in large pot of boiling salted water until just tender, about 4 minutes for fresh or 5 minutes for frozen. Using large strainer, transfer ravioli to colander and drain; place in bowl with butter and toss to coat. Cover to keep warm. Cook remaining ravioli in same pot of boiling water. Drain and add to bowl of buttered ravioli. Toss gently to coat. Divide ravioli among bowls. Rewarm tomato butter over medium heat. Add reserved pancetta and basil; sauté 1 minute. Spoon sauce over ravioli; garnish with thyme.",
        "*Pancetta, Italian bacon cured in salt, is available at Italian markets and in the deli case at many supermarkets."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "3 large shallots, minced",
        "8 ounces arugula, chopped (about 8 cups)",
        "6 ounces soft fresh goat cheese (such as Montrachet), crumbled",
        "1/2 cup (about 1 1/2 ounces) freshly grated Parmesan cheese",
        "Nonstick vegetable oil spray",
        "42 (about) wonton wrappers (from one 12-ounce package)",
        "2 large egg whites, whisked just until foamy",
        "6 ounces thinly sliced pancetta* or bacon, coarsely chopped",
        "1/4 cup (1/2 stick) butter",
        "6 large plum tomatoes, quartered, seeds and membranes discarded, tomatoes diced",
        "1 teaspoon chopped fresh thyme",
        "5 tablespoons butter, melted",
        "12 fresh basil leaves",
        "Fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Tomato",
        "Goat Cheese",
        "Parmesan",
        "Basil",
        "Bacon",
        "Arugula",
        "Summer"
    ],
    "title": "Goat Cheese-Arugula Ravioli with Tomato-Pancetta Butter",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-arugula-ravioli-with-tomato-pancetta-butter-104784"
}
