{
    "directions": [
        "Combine turkey, breadcrumbs, lemon juice, lemon peel, thyme, salt and pepper in large bowl. Mix well. Divide turkey mixture into 6 equal portions. Form 1 portion into two 4-inch diameter patties. Place 1 tablespoon goat cheese atop 1 turkey patty; place second patty atop cheese. Seal patties at edges to enclose cheese. Repeat with remaining 5 portions. (Can be prepared 4 hours ahead. Cover and refrigerate.)",
        "Prepare barbecue (medium-high heat). Grill burgers until cooked through, about 5 minutes per side. Grill hamburger buns, cut side down, until lightly toasted, about 1 minute. Place turkey burgers on bottom half of buns. Top burgers with Roasted Red Pepper Relish, then bun tops and serve.",
        "Heat oil in heavy large skillet over medium-high heat. Add red peppers and sauté 2 minutes. Add onions and garlic. Cook until onions are tender, stirring frequently, about 5 minutes.",
        "Mix vinegar and sugar in small bowl until sugar dissolves. Stir vinegar mixture into red peppers. Mix in mustard and cayenne pepper. Season with salt. Continue cooking relish until all liquid has evaporated, stirring frequently, about 6 minutes. Cool to room temperature. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before using.) Makes about 2 cups."
    ],
    "ingredients": [
        "1 1/2 pounds lean ground turkey",
        "6 tablespoons fresh breadcrumbs",
        "3 tablespoons fresh lemon juice",
        "2 teaspoons grated lemon peel",
        "2 teaspoons dried thyme",
        "1 1/8 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "6 tablespoons soft fresh goat cheese (such as Montrachet)",
        "6 whole wheat, hamburger buns",
        "3 tablespoons olive oil",
        "4 7-ounce jars roasted sweet red peppers, rinsed, drained, patted dry, chopped",
        "1 1/2 cups chopped onions",
        "3 teaspoons finely chopped garlic",
        "4 1/2 tablespoons cider vinegar",
        "3 tablespoons sugar",
        "1/4 teaspoon dry mustard",
        "1/4 teaspoon cayenne pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Pepper",
        "Poultry",
        "turkey",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Goat Cheese-Stuffed Turkey Burgers with Roasted Red Pepper Relish",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-stuffed-turkey-burgers-with-roasted-red-pepper-relish-2279"
}
