{
    "directions": [
        "Sift first 3 ingredients into bowl. Mix in yogurt and 1/4 cup goat cheese. Knead on floured surface until smooth and elastic, about 10 minutes. Form into ball. Return to bowl; cover with plastic. Let rest 2 hours (dough will not rise).",
        "Melt butter in large skillet over medium heat. Add onions; sauté until deep golden, about 25 minutes. Season with salt and pepper. Cool. Set aside. Turn dough out onto floured surface. Divide into 4 pieces. Form each into ball. Roll out each to 8-inch round.",
        "Brush heavy medium skillet with olive oil; heat over medium-high heat. Add 1 dough round and cook until brown spots appear all over bottom, about 5 minutes. Turn bread over and cook until brown spots appear all over second side and bread is cooked through, about 5 minutes. Transfer to large baking sheet. Repeat with remaining dough rounds. (Can be made 2 hours ahead. Cover onions and bread separately; let stand at room temperature. Rewarm bread uncovered in 350¡F oven about 5 minutes.)",
        "Preheat broiler. Spread onion mixture atop breads. Sprinkle with 3/4 cup goat cheese. Broil breads just until cheese begins to melt, watching closely to avoid burning, about 2 minutes. Cut breads into wedges. Serve with Mango Salsa."
    ],
    "ingredients": [
        "1 1/2 cups unbleached all purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup plus 2 tablespoons plain yogurt",
        "1 cup crumbled soft fresh goat cheese",
        "3 tablespoons butter",
        "3 1/2 cups sliced Maui or yellow onions",
        "Olive oil Mango Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Onion",
        "Broil",
        "Yogurt",
        "Diwali",
        "Goat Cheese",
        "Fall",
        "Pan-Fry"
    ],
    "title": "Goat Cheese-Onion Naan with Mango Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-onion-naan-with-mango-salsa-5706"
}
