{
    "directions": [
        "In a fry pan over medium-high heat, melt 2 Tbs. of the butter until it foams. Add the leeks and sauté until translucent, 4 to 5 minutes. Add the thyme, bay leaf, stock, 1/2 tsp. of the salt and 1/2 tsp. of the pepper. Reduce the heat to low, cover and simmer until the leeks are nearly tender, about 15 minutes. Uncover and cook, stirring occasionally and being careful not to let the leeks brown, until almost all the liquid has evaporated, about 15 minutes more. Remove and discard the bay leaf. Transfer the leeks to a bowl. Stir in the crème fraîche and goat cheese until well mixed.",
        "In another fry pan over medium-high heat, melt the remaining 1 Tbs. butter until it foams. Add the mushrooms, the remaining 1/2 tsp. salt and the remaining 1/4 tsp. pepper and sauté until the mushrooms are soft and have released their juices, 3 to 4 minutes.",
        "Preheat an oven to 400°F. Line a large rimmed baking sheet with parchment paper.",
        "On a floured work surface, roll out the puff pastry into a rectangle 10 by 12 inches wide and 1/8 inch thick. Transfer the dough to the prepared baking sheet. Spread the leek mixture to within 1 inch of the edge of the dough, and fold the edges of the dough over the filling to make a free-form tart. Bake until the crust puffs and both the crust and the leeks are golden, about 15 minutes. Scatter the mushrooms over the leeks and bake for 5 minutes more.",
        "Let the tart stand for 5 to 10 minutes. Cut into bite-size pieces and serve warm. Serves 8 to 10.",
        "Adapted from Williams-Sonoma",
        "Essentials of French Cooking,",
        "by Georgeanne Brennan & Sarah Putnam Clegg (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "3 Tbs. unsalted butter",
        "3 lb. leeks, white parts and 1 inch of pale green parts, thinly sliced",
        "2 tsp. fresh thyme leaves",
        "1 bay leaf",
        "1/2 cup chicken stock",
        "1 tsp. salt",
        "3/4 tsp. freshly ground pepper",
        "1/3 cup crème fraîche",
        "3 oz. soft goat cheese, crumbled",
        "1/2 lb. mixed mushrooms, such as oyster, chanterelle and cremini, brushed clean and coarsely chopped",
        "All-purpose flour for dusting",
        "1 sheet puff pastry, thawed if frozen"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Goat Cheese, Leek and Mushroom Tart",
    "url": "http://www.williams-sonoma.com/recipe/goat-cheese-leek-and-mushroom-tart.html"
}
