{
    "directions": [
        "In a skillet cook onion and garlic in 1 tablespoon oil over moderate heat, stirring, until softened. Transfer onion mixture to a food processor and add roasted peppers, basil, remaining 2 tablespoons oil, and salt and pepper to taste. Blend sauce until smooth and transfer to a small bowl. (Sauce may be made up to 3 days ahead and chilled, covered.)",
        "Put 1 tortilla on a work surface and spread with 1 goat cheese piece, covering surface evenly. Spread 1 tablespoon pesto over goat cheese and cover with one fourth of onion. Repeat layering in the same manner, ending with a tortilla and gently pressing layers together. Make 1 more layered quesadilla with the remaining tortillas, goat cheese, pesto, and onion. Spread top and bottom of each quesadilla with 1/2 tablespoon butter.",
        "Heat a griddle or well-seasoned 10-inch cast-iron skillet over moderately high heat until hot but not smoking. Cook quesadilla, 1 at a time, gently pressing down with a metal spatula, until golden, about 4 minutes on each side. Cut each quesadilla into 8 wedges and serve warm with roasted red pepper sauce.",
        "Using a long-handled fork, char peppers over an open flame or on a rack set over an electric burner, turning them, until skins are blackened, 4 to 6 minutes. (Or broil peppers on a rack of a broiler about 2 inches from heat, turning them every 5 minutes, 15 to 20 minutes, or until skins are blistered and charred.) Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Keeping peppers whole, peel them, starting at blossom end. Cut off pepper tops and discard seeds and ribs."
    ],
    "ingredients": [
        "1 small onion, chopped coarse",
        "3 garlic cloves, chopped",
        "3 tablespoons olive oil",
        "2 red bell peppers, roasted (procedure follows)",
        "2 tablespoons chopped fresh basil leaves",
        "six 9- to 10-inch flour tortillas",
        "a 4 1/2-ounce log soft mild goat cheese such as Montrachet, cut into 4 pieces, at room temperature",
        "1/4 cup prepared basil pesto*",
        "1 small onion, sliced thin",
        "2 tablespoons unsalted butter, softened",
        "*available at specialty food shops and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cocktail Party",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Goat Cheese",
        "Basil",
        "Bell Pepper",
        "Summer",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Goat Cheese Quesadillas with Roasted Red Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/goat-cheese-quesadillas-with-roasted-red-pepper-sauce-12421"
}
