{
    "directions": [
        "Mix onion, garlic, ginger, gochujang, soy sauce, sugar, mirin, sesame oil, and 1 tsp. pepper in a medium bowl to combine; set sauce aside.",
        "Toss rice, cumin, garlic powder, and mustard powder in a medium bowl to combine; spread out on a parchment-lined rimmed baking sheet and chill until cold, about 1 hour.",
        "Meanwhile, season chicken generously with salt. Heat butter and vegetable oil in a medium heavy pot over medium. As soon as foaming subsides, add chicken and cook, turning occasionally, until lightly browned, about 5 minutes. Add reserved sauce and bring to a simmer; cook until sauce appears to thin out, about 3 minutes. Add broth and bring to a boil. Reduce heat, partially cover pot, and simmer, turning occasionally, until chicken is very tender, 45–55 minutes.",
        "Divide rice into 4 portions; form into 3/4\"-thick disks (moisten hands with water to prevent sticking). Heat a large nonstick skillet over medium. Working in 2 batches, cook rice cakes, turning halfway through, until crisp, puffed, and golden, about 10 minutes. Transfer to plates.",
        "Add scallions to chicken and cook until tender, about 3 minutes. Season with salt and pepper. Top each cake with 2 chicken legs and a few scallions; spoon plenty of sauce over."
    ],
    "ingredients": [
        "1 small onion, finely chopped",
        "8 garlic cloves, finely grated",
        "1 (2-inch) piece ginger, peeled, finely grated",
        "1/4 cup gochujang (Korean hot pepper paste)",
        "1/4 cup soy sauce",
        "2 tablespoons sugar",
        "1 tablespoon mirin",
        "1 tablespoon toasted sesame oil",
        "1 teaspoon freshly ground black pepper, plus more",
        "3 cups cooked short-grain rice",
        "1 teaspoon ground cumin",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon mustard powder",
        "8 chicken drumsticks, patted dry",
        "Kosher salt",
        "4 tablespoons unsalted butter",
        "2 tablespoons vegetable oil",
        "4 cups low-sodium chicken broth",
        "6 scallions, white and pale-green parts only, cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dinner",
        "Sesame Oil",
        "Ginger",
        "Braise",
        "Rice",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Gochujang-Braised Chicken and Crispy Rice",
    "url": "http://www.epicurious.com/recipes/food/views/gochujang-braised-chicken-and-crispy-rice"
}
