{
    "directions": [
        "Preheat oven to 400°F. Place all beets in 9x9x2-inch metal pan. Drizzle 3 tablespoons oil over; sprinkle with salt and pepper and toss to coat. Cover pan with foil and roast beets until tender, about 1 1/2 hours. Uncover and cool completely. Peel beets, cut into 1/2-inch cubes, and place in large bowl, each color on opposite side; sprinkle with salt and pepper. Do ahead Can be made 1 day ahead. Cover and chill. Bring to room temperature before using.",
        "Cut all peel and pith off oranges. Working over medium bowl to catch orange juice, cut between membranes, releasing segments. Add 1 cup orange segments, fennel, mint, parsley, hazelnuts, and shallot to bowl with beets. Transfer 2 teaspoons orange juice to small bowl; whisk in vinegar and remaining 2 tablespoons olive oil. Season dressing to taste with salt and white pepper. Stir into beet mixture.",
        "Mound salad on large platter. Drain remaining orange segments; arrange on salad. Sprinkle with cheese."
    ],
    "ingredients": [
        "2 large (3-inch-diameter) red beets, all but 1 inch of tops trimmed",
        "2 large (3-inch-diameter) golden beets, all but 1 inch of tops trimmed",
        "5 tablespoons extra-virgin olive oil, divided",
        "4 oranges",
        "1 small fresh fennel bulb, trimmed, quartered, cored, cut into paper-thin strips",
        "1/4 cup finely chopped fresh mint",
        "1/4 cup finely chopped fresh Italian parsley",
        "1/4 cup hazelnuts, toasted, husked, halved",
        "1 small shallot, finely chopped",
        "1 tablespoon balsamic vinegar",
        "Coarse kosher salt",
        "Freshly ground white pepper",
        "1 1/2 cups coarsely crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Appetizer",
        "Roast",
        "Vegetarian",
        "Feta",
        "Orange",
        "Fennel",
        "Beet",
        "Healthy",
        "Hazelnut",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Golden and Crimson Beet Salad with Oranges, Fennel, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/golden-and-crimson-beet-salad-with-oranges-fennel-and-feta-236187"
}
