{
    "directions": [
        "In a saucepan with a tight-fitting lid heat 1 tablespoon of the canola oil with the garlic over medium heat for 1 minute, stirring constantly. Add the jasmine rice and stir constantly for 1 minute more. Add the 2-1/2 cups water and 1 teaspoon salt. Bring rice to a boil, then reduce the heat to low, cover the pan, and cook the rice for 15 minutes. Transfer the rice to a large bowl, and let it cool for 15 minutes",
        "While the rice cooks, cut the sweet potato into thirds. Place the pieces in a pot, and cover them with cold water. Bring the potatoes to a boil, and cook them until they are tender, about 20 minutes. Drain and let them cool.",
        "In a saucepan bring the coconut milk, the water or orange juice, and the minced ginger almost to a boil, then turn the heat to low and cook for 5 minutes. Remove the pan from the heat.",
        "Peel the skin off the cooled sweet potato. Puree the sweet potato flesh with the coconut-ginger liquid in a blender or food processor. Pour the sweet-potato puree back into the saucepan and add salt and pepper.",
        "Mince the carrot, the red pepper, and the coarsely chopped scallions in a food processor. Add 1/2 of the jasmine rice and the 2 beaten eggs; run the machine in spurts until the mixture has a mealy consistency. Put this mixture back into the bowl with the rest of the jasmine rice and mix well. Put half of this mixture into a clean bowl.",
        "Heat two skillets or a large griddle over medium-high heat. Divide the remaining canola oil between the skillets or spread it on the griddle. Divide the rice mixture in each bowl into thirds. Form each of the six parts into a ball then place each ball in a skillet or on the griddle.  Pat the ball down to form a cake about 1 1/2 inches thick. Fry the cakes for 3 to 4 minutes per side, or until they are golden brown.",
        "Reheat the sauce, and ladle it into plates. Place a rice cake on each plate, and top with the finely chopped scallions."
    ],
    "ingredients": [
        "3 tablespoons canola oil",
        "2 cloves garlic, minced",
        "2 cups dry jasmine rice",
        "2 1/2 cups water",
        "1 teaspoon salt",
        "1 sweet potato",
        "1 (14 ounce) can coconut milk",
        "1/2 cup orange juice",
        "1 tablespoon minced fresh ginger root",
        "salt and pepper to taste",
        "1 carrot, coarsely chopped",
        "1/2 red bell pepper, chopped",
        "4 green onions, chopped",
        "2 eggs, beaten",
        "2 green onions, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Golden Rice Cakes with Sweet Potato-Ginger Sauce",
    "url": "http://allrecipes.com/recipe/14055/golden-rice-cakes-with-sweet-potato-g/"
}
