{
    "directions": [
        "Preheat oven to 350°F. Butter 2 (9- by 2-inch) round cake pans and line bottoms of each with rounds of wax or parchment paper. Butter paper and dust pans with flour, knocking out excess.",
        "Sift together flour, baking powder, baking soda, and salt.",
        "Beat together butter and sugar in a large bowl with an electric mixer until light and fluffy. Add eggs 1 at a time, beating well after each addition, then beat in vanilla. Add half of flour mixture and mix at low speed until just blended. Add sour cream, mixing until just combined, then add remaining flour mixture, mixing at low speed until batter is smooth.",
        "Divide batter between pans, smoothing tops. Bake in middle of oven until cake is springy to the touch and a tester comes out clean, 30 to 40 minutes. Cool in pans on racks 10 minutes, then invert onto racks, remove paper, and cool completely.",
        "Trim tops of cooled cake layers with a long serrated knife if necessary to make flat and level. Halve each layer horizontally with serrated knife to make a total of 4 layers.",
        "Put 1 cake layer on a cake plate and spread with 3/4 cup frosting. Layer remaining cake layers using 3/4 cup frosting between each layer. Frost top and sides of cake with remaining frosting."
    ],
    "ingredients": [
        "3 1/2 cups cake flour (not self-rising)",
        "1 tablespoon baking powder",
        "3/4 teaspoon baking soda",
        "1 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "2 cups sugar",
        "4 large eggs at room temperature",
        "2 teaspoons vanilla",
        "2 cups sour cream",
        "Chocolate sour cream frosting",
        "Garnish: brown sugar buttercream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Wedding",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Golden Cake with Chocolate Sour Cream Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/golden-cake-with-chocolate-sour-cream-frosting-104575"
}
