{
    "directions": [
        "Preheat broiler.",
        "Broil bell peppers on a broiler pan about 5 inches from heat, turning occasionally with tongs, until skins are blackened, about 15 minutes. Transfer to a bowl and let stand, covered, until cool enough to handle, about 20 minutes. Peel peppers, discarding stems and seeds, and coarsely chop, then purée in a blender with 2 tablespoons water, scraping down sides of blender, until smooth.",
        "Cook onion in 1 teaspoon oil in a 12-inch nonstick skillet over moderate heat, stirring frequently, until golden, about 5 minutes. Stir in spinach, 1/2 teaspoon salt, 1/4 teaspoon black pepper, and remaining 1/4 cup water and cook, stirring, until spinach is wilted, about 3 minutes. Transfer to a colander set over a bowl and drain off excess liquid, gently pressing on spinach.",
        "Whisk together pepper purée and flour in a large bowl, then whisk in egg whites and remaining teaspoon salt and 1/4 teaspoon pepper until combined.",
        "Heat 1/2 teaspoon oil in an 8-inch nonstick skillet over moderate heat until hot but not smoking. Pour 1/2 cup egg mixture into skillet and cook, lifting up cooked egg around edge occasionally to let raw egg flow underneath, until omelet is set but top is still slightly moist, about 2 minutes. Spoon one fourth of spinach over half of omelet and sprinkle with 1 tablespoon cheese. Fold remaining half of omelet over filling using a heatproof plastic spatula and transfer to a plate. Keep warm, covered with foil.",
        "Make 3 more omelets with remaining egg mixture, oil, spinach, and cheese in same manner."
    ],
    "ingredients": [
        "2 medium yellow bell peppers",
        "1/4 cup plus 2 tablespoons water",
        "1 small onion, finely chopped",
        "3 teaspoons olive oil",
        "2 (5-ounce) bags baby spinach, coarsely chopped",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons all-purpose flour",
        "12 large egg whites or liquid egg whites",
        "1 ounce coarsely grated Gruyère (1/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Egg",
        "Breakfast",
        "Brunch",
        "Vegetarian",
        "Lunch",
        "Spinach",
        "Bell Pepper",
        "Pan-Fry",
        "Healthy",
        "Swiss Cheese",
        "Gourmet"
    ],
    "title": "Golden Egg White Omelets with Spinach and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/golden-egg-white-omelets-with-spinach-and-cheese-108671"
}
