{
    "directions": [
        "Preheat oven to 400°F. If using unsalted butter, heat in a small saucepan over medium, skimming off white foam that rises to the surface, until butter is melted and milk solids have settled to the bottom of the pan. Spoon clear (clarified) butter into a small bowl. Discard milk solids.",
        "Heat 1 Tbsp. clarified butter (or ghee) in a medium skillet, preferably ovenproof nonstick or cast iron (you will need to cover it; use a baking sheet if you don’t have a lid), over medium-high and add half of potatoes, tossing to separate slices and coat in butter. Cook, tossing often, until some of the slices are browned around the edges, about 5 minutes. Transfer to a large bowl. Repeat with another 1 Tbsp. butter and remaining potatoes; transfer to same bowl. Let cool slightly.",
        "Arrange some potato slices in an overlapping pattern in a single layer in bottom of skillet. Season with salt and pepper and drizzle with some of the remaining clarified butter. Repeat with remaining potatoes, building a layer at a time, seasoning with salt and pepper and drizzling with clarified butter as you go. When you are finished layering the potatoes, pour any remaining clarified butter over top and cover skillet.",
        "Cook potatoes over low heat until barely tender, 10–15 minutes. Uncover skillet and transfer to oven. Bake until potatoes are very tender in the middle (if you have a cake tester, that’s a good way to check, or use the tip of a paring knife) and browned and crisp around the edges, 25–30 minutes. Let cool slightly.",
        "Slide a rubber spatula underneath potato cake to loosen, then invert onto a platter. Season with more salt.",
        "Potato cake can be made 3 hours ahead. Leave in skillet at room temperature. Reheat at 350°F for 10 minutes before serving."
    ],
    "ingredients": [
        "8 tablespoons unsalted butter or 6 tablespoons ghee",
        "2 pounds small russet potatoes, peeled, very thinly sliced",
        "Flaky sea salt",
        "Freshly ground white or black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Christmas",
        "Potato",
        "Butter",
        "New Year's Eve"
    ],
    "title": "Golden Potato Cake",
    "url": "http://www.epicurious.com/recipes/food/views/golden-potato-cake"
}
