{
    "directions": [
        "Preheat the oven to 325°F. Spray your molds with nonstick spray (I, obviously, use egg-shaped molds. You can use a muffin pan or any other small baking molds.)",
        "Sift together the flour, baking powder, salt, and nutmeg. Set aside.",
        "In an electric mixer fitted with either the paddle or the whisk attachment, whip the butter and sugar together until light and fluffy.",
        "This can take up to 10 minutes, depending on the temperature of your butter.",
        "As you're whipping away, stop and scrape down the sides of the bowl to make sure all the butter is incorporated into the sugar.",
        "You can't make magic without a lot of patience. So keep whipping and keep scraping.",
        "Add the eggs one at a time, whipping after each one until the egg is fully incorporated into the batter.",
        "Scrape down the bowl every now and again as well.",
        "Add the vanilla.",
        "Once all the eggs are incorporated, alternate adding the flour mixture and the buttermilk, mixing slowly.",
        "After they are well incorporated but not overbeaten, take a rubber spatula and fold the batter a few times to make sure everything is evenly distributed and the batter is smooth.",
        "Distribute the batter into your molds, filling each cavity a little less than halfway.",
        "Bake for about 15 minutes. Baking time varies depending on the size of your mold, so check for a very light golden brown color and make sure the cake springs back when you touch it.",
        "Unmold your little cakes and while they are still warm, dunk them quickly in the melted butter, then dredge them in the cinnamon and sugar.",
        "One warning: people are going to call you a stinking liar. They will not believe that these precious morsels aren't fried like a donut. But that's the cost of making magic."
    ],
    "ingredients": [
        "Nonstick baking spray",
        "3 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1 teaspoon nutmeg",
        "1/2 pound (2 sticks) unsalted butter, at room temperature",
        "2 cups sugar",
        "5 large eggs, at room temperature",
        "1 teaspoon vanilla extract",
        "1 1/4 cups nonfat buttermilk",
        "8 tablespoons (1 stick) unsalted butter, melted",
        "1 cup sugar and 1 teaspoon cinnamon mixed together in a small shallow bowl"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Side",
        "Bake",
        "Easter",
        "Kid-Friendly",
        "Vanilla",
        "Spring",
        "Cinnamon",
        "Nutmeg",
        "Butter",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Golden Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/golden-eggs-358292"
}
