{
    "directions": [
        "Fit processor with large-hole grating disk. Working with a few pieces of daikon at a time, place daikon pieces in feed tube and process until coarsely grated. Transfer daikon to bowl. Replace grating disk in processor with metal blade. Return daikon to processor and finely chop, using on/off turns.",
        "Heat heavy large skillet over medium-high heat. Add sausage cubes to skillet and sauté until fat renders and sausage browns, about 5 minutes. Add green onions and dried shrimp; stir 1 minute. Add daikon with juices and 1/2 cup water; bring to boil. Reduce heat to medium; cook until daikon is soft and liquid is almost evaporated, stirring frequently, about 25 minutes.",
        "Meanwhile, spray 9-inch-diameter cake pan with 1 1/2-inch-high sides with nonstick spray. Whisk rice flour and remaining 1 cup water in large bowl until well blended. Stir in daikon mixture. Season to taste with salt and pepper. Spread daikon mixture evenly in prepared pan. Place cake pan on bamboo steamer rack set over wok filled halfway with simmering water or on metal rack set over simmering water in pot. Cover with lid; steam over medium heat until cake is set and firm to touch, occasionally adding more water to wok or pot as needed, about 45 minutes. Remove pan from steamer; cool cake in pan 1 hour. Cover and refrigerate daikon cake in pan overnight.",
        "Whisk soy sauce and sesame oil in small bowl. Heat 1 tablespoon vegetable oil in small skillet over medium heat. Add cilantro, ginger with juices, and chiles or hot chili sauce; stir 30 seconds. Mix ginger mixture into soy sauce mixture. DO AHEAD Daikon cake and sauce can be made 2 days ahead. Cover separately and refrigerate.",
        "Run small knife around daikon cake to loosen. Invert onto cutting board. Cut cake into 1/2-inch-thick slices (not wedges), then cut each slice crosswise into 2-inch-long pieces.",
        "Heat 1 tablespoon vegetable oil in large nonstick skillet over medium-high heat. Working in batches, add daikon cake slices to skillet and cook until golden brown, adding more oil to skillet for each batch as needed, about 5 minutes per side. Transfer slices to platter. Sprinkle with sesame seeds. Serve herb soy sauce alongside for dipping."
    ],
    "ingredients": [
        "1 1/2 pounds daikon (Asian white radish), peeled, cut into 1-inch pieces",
        "2 Chinese sweet pork sausages (lop chong), cut into 1/4-inch cubes (about 3 ounces)",
        "1/2 cup finely chopped green onions (about 3 large)",
        "2 tablespoons small dried shrimp, finely chopped",
        "1 1/2 cups water, divided",
        "Nonstick vegetable oil spray",
        "1 1/2 cups rice flour",
        "1 cup soy sauce",
        "1 tablespoon Asian sesame oil",
        "2 tablespoons (or more) vegetable oil, divided",
        "1 cup fresh cilantro leaves",
        "1 tablespoon grated peeled fresh ginger, juices included",
        "2 small Thai red chiles, halved lengthwise, seeds removed, thinly sliced crosswise or 1 tablespoon hot chili sauce (such as sriracha)",
        "1 tablespoon sesame seeds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Herb",
        "Onion",
        "Pepper",
        "Pork",
        "Vegetable",
        "Appetizer",
        "Steam",
        "Cocktail Party",
        "High Fiber",
        "Lunar New Year",
        "Sausage",
        "Shrimp",
        "Hot Pepper",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Golden Crisp Daikon Cake with Spicy Herb Soy Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/golden-crisp-daikon-cake-with-spicy-herb-soy-sauce-237085"
}
