{
    "directions": [
        "Toss first 6 ingredients in medium bowl to blend. DO AHEAD: Can be made 2 hours ahead. Cover and chill.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 400°F. Line 2 large rimmed baking sheets with parchment. Roll out 1 puff pastry sheet on lightly floured surface to 11-inch square. Using 5- to 51/2-inch plate or bowl as template, cut out 4 rounds from pastry. Transfer pastry rounds to 1 baking sheet, spacing apart. Repeat with second pastry sheet, placing rounds on second baking sheet. Spoon filling onto half of each pastry round, dividing all of filling among rounds. Brush edges of pastry lightly with some of egg glaze. Fold plain pastry half over filling; press on edges to seal and enclose filling completely, then press tines of fork along pastry edge to create tight seal. Using tip of small sharp knife, cut two 1/2-inch-long slits in top of crust on each turnover. Brush tops with egg glaze, then sprinkle with sugar.",
        "Bake turnovers until crusts are puffed and golden and juices are bubbling through slits in crusts, about 25 minutes. Carefully run metal spatula under turnovers to loosen and transfer to racks to cool slightly. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 medium Golden Delicious apples, peeled, halved, cored, cut into 1/2-inch cubes (about 2 1/2 cups)",
        "1 1/2 cups (loosely packed) coarsely grated extra-sharp cheddar cheese",
        "1/4 cup pure maple syrup",
        "1/4 cup chopped walnuts",
        "1/4 cup sweetened dried cranberries",
        "Pinch of salt",
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "1 large egg, beaten with 1 teaspoon water to blend (for glaze)",
        "Sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "High Fiber",
        "Cheddar",
        "Dried Fruit",
        "Apple",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Golden Delicious Apple and Cheddar Turnovers with Dried Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/golden-delicious-apple-and-cheddar-turnovers-with-dried-cranberries-355217"
}
