{
    "directions": [
        "Blend flour, cake flour, sugar and salt in processor. Add butter and shortening and cut in using on/off turns until mixture resembles coarse meal. Add 6 tablespoons ice water and process just until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; divide into 2 pieces, 1 slightly larger than the other. Flatten larger piece into disk and smaller piece into rectangle; wrap each in plastic and refrigerate 1 hour. (Can be made 1 day ahead. Keep refrigerated. Let soften slightly at room temperature before rolling out.)",
        "Position rack in bottom third of oven and preheat to 375°F. Spread apple slices on large rimmed baking sheet. Sprinkle 3 tablespoons sugar over apples, then drizzle with 2 tablespoons melted butter and lemon juice; toss to coat. Bake just until apples begin to soften, stirring once, about 15 minutes. Cool apples completely on baking sheet. Maintain oven temperature.",
        "Transfer apples and any accumulated juices to large bowl. Mix in raisins and brown sugar.",
        "Butter 9-inch-diameter glass pie dish. Roll out dough disk on floured surface to 12-inch round. Transfer crust to prepared pie dish. Spoon apple filling into crust. Drizzle remaining 1 tablespoon melted butter over. Roll out dough rectangle on floured surface to 11x7-inch rectangle. Cut lengthwise into twelve 1/2-inch-wide strips. Place 6 strips 1 inch apart atop apple filling. Place remaining 6 strips diagonally atop first 6 strips, forming diamond lattice pattern. Trim strips even with bottom crust. Fold dough overhang in, pressing onto edge of pie dish. Press dough edge decoratively with fork to seal.",
        "Brush dough strips with egg glaze. Sprinkle strips with 2 teaspoons sugar. Bake 15 minutes. Reduce oven temperature to 350°F. Continue to bake pie until crust is golden and apples are tender, covering crust edges with foil if browning too quickly, about 1 hour 15 minutes longer. Cool pie at least 2 hours. Serve slightly warm or at room temperature. (Can be made 1 day ahead. Cool completely, then cover and store at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 cup cake flour",
        "1 tablespoon plus 1 1/2 teaspoons sugar",
        "3/4 teaspoon salt",
        "9 tablespoons (1 stick plus 1 tablespoon) chilled unsalted butter, cut into pieces",
        "3 tablespoons chilled solid vegetable shortening, cut into pieces",
        "6 tablespoons (or more) ice water",
        "3 1/4 pounds Golden Delicious apples, peeled, quartered, cored, each quarter cut crosswise into 1/4-inch-thick slices",
        "3 tablespoons plus 2 teaspoons sugar",
        "3 tablespoons unsalted butter, melted",
        "2 teaspoons fresh lemon juice",
        "1 cup golden raisins (about 5 ounces)",
        "2 tablespoons (packed) dark brown sugar",
        "1 large egg yolk beaten to blend with 1 tablespoon whipping cream (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Raisin",
        "Apple",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Golden Raisin and Apple Lattice Pie",
    "url": "http://www.epicurious.com/recipes/food/views/golden-raisin-and-apple-lattice-pie-104321"
}
