{
    "directions": [
        "In a large heavy skillet cook onions with dried thyme (if using) and salt and pepper to taste in 2 tablespoons butter, covered, over moderately low heat, stirring occasionally, 30 minutes, or until very tender and pale golden. Cook, uncovered, stirring, 15 minutes and add wine. Simmer mixture until most of wine is evaporated. Stir in fresh thyme (if using) and transfer to a bowl.",
        "Preheat oven to 375°F. and butter an 8-inch square baking dish.",
        "In the cleaned skillet cook half of zucchini slices in one layer in 1 tablespoon butter over moderate heat until tender, about 2 minutes on each side, and transfer to another bowl. Cook remaining zucchini in 1 tablespoon butter in same manner.",
        "In a small heavy saucepan melt remaining 3 tablespoons butter over moderately low heat. Add flour and cook roux, whisking, 3 minutes. Add milk in a stream, whisking, and bring to a boil, whisking. Add nutmeg and salt and pepper to taste and simmer sauce, whisking, until thickened, about 2 minutes.",
        "Spread a few tablespoons sauce on bottom of prepared dish. Over sauce in dish layer in this order: 1 lasagne square, half of onions, half of zucchini, a third sauce, and a third Parmesan. Repeat. Top with remaining lasagne square, remaining sauce, and remaining Parmesan.",
        "Bake lasagne in middle of oven 25 to 30 minutes, or until golden, and let stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 1/2 pounds onions, sliced thin (about 6 cups)",
        "1/2 teaspoon dried thyme, crumbled, or 1 1/2 teaspoons chopped fresh thyme leaves",
        "7 tablespoons unsalted butter",
        "1/2 cup dry white wine",
        "1 pound zucchini, scrubbed and sliced 1/4 inch thick (about 3 1/2 cups)",
        "1/4 cup all-purpose flour",
        "2 1/2 cups milk",
        "freshly grated nutmeg to taste",
        "three 7-inch squares instant (no-boil) lasagne*",
        "1 1/2 cups freshly grated Parmesan cheese (about 5 ounces)",
        "*available at specialty foods shops and many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Onion",
        "Pasta",
        "Bake",
        "Parmesan",
        "Zucchini",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Golden Onion and Zucchini Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/golden-onion-and-zucchini-lasagne-11627"
}
