{
    "directions": [
        "In a small mixing bowl, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes.",
        "Prepare a sweet dough by creaming 1/4 cup sugar with the shortening and 1/4 teaspoon salt. Add 1 egg and beat with electric mixer one minute until well blended. Add 2 1/2 cups flour, the yeast mixture and 1 tablespoon vanilla.  Mix three minutes with dough hook or with hands. Turn dough out on floured board and knead for one minute.  Place in a lightly greased bowl, cover with a towel and set in a warm place to rise for one hour.",
        "While dough is rising, prepare the Gooey Butter Topping:  In a large bowl, combine 2 1/2 cups sugar, 1 cup butter and a pinch of salt.  Add 1 egg and the corn syrup. Mix enough to incorporate. Add 2 1/4 cups flour, 1/4 cup water and 1 teaspoon vanilla. Mix together well and set aside.",
        "Divide dough into two pieces. Place each into a greased 9 inch round cake pan. Crimp edges halfway up sides of pans to keep the gooey butter topping from running out underneath. After dough is spread out, punch holes in dough with fork to keep it from bubbling when baking.",
        "Divide Gooey Butter Topping into two equal parts. Spread over dough in each pan. Let cake stand for 20 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C). Bake cakes in preheated oven 30 minutes.  Do not overbake; the topping should stay gooey. After cakes are cool, sprinkle with confectioners' sugar."
    ],
    "ingredients": [
        "1/4 cup white sugar",
        "1/4 cup shortening",
        "1/4 teaspoon salt",
        "1 egg",
        "1 (0.6 ounce) cake compressed fresh yeast",
        "1/2 cup warm milk",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon vanilla extract",
        "2 1/2 cups white sugar",
        "1 cup butter",
        "1/8 teaspoon salt",
        "1 egg",
        "1/4 cup light corn syrup",
        "2 1/4 cups all-purpose flour",
        "1/4 cup water",
        "1 tablespoon vanilla extract",
        "1/4 cup confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gooey Butter Cake IV",
    "url": "http://allrecipes.com/recipe/17387/gooey-butter-cake-iv/"
}
