{
    "directions": [
        "Trim the legs of any excess fat. In a Dutch oven or other large, heavy pot with a lid, heat the duck fat over medium-high heat. Add the legs and brown them, salting them as they cook. Take your time to get them well browned. Transfer them to a plate and set aside.",
        "Add the onion and mushrooms to the pot, turn the heat to high, and stir to combine. Sauté for 6 to 8 minutes, until the onion begins to brown. Add the marjoram, return the legs to the pot, and then pour in the stock. Bring to a simmer, cover, and cook for 2 to 3 hours, until the meat is tender. If a lot of fat begins to accumulate on the surface of the stew, skim it off.",
        "When the goose legs are tender, remove them, let them cool a bit, and then pull all of the meat off the bones. Return the meat to the pot. Add the barley, carrots, and celery root, stir well, and cook for about 30 minutes, until the barley and celery root are tender. Season with salt.",
        "Serve garnished with the dill and a sprinkle of black pepper, and top each bowl with a dollop of sour cream at the table."
    ],
    "ingredients": [
        "8 goose legs (2 to 3 pounds)",
        "3 tablespoons duck fat, lard, or unsalted butter",
        "Kosher salt and freshly ground pepper",
        "1 large yellow or white onion, sliced",
        "1 pound small mushrooms (such as yellow foot chanterelle or beech), halved or left whole",
        "2 teaspoons dried marjoram",
        "7 cups Basic Duck Stock or beef stock",
        "1 cup pearled barley",
        "1 cup peeled and sliced carrots",
        "1 celery root, peeled and cut into 1-inch cubes",
        "2 tablespoons chopped fresh dill",
        "4 to 6 tablespoons sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Poultry",
        "Sauté",
        "Stew",
        "Dinner",
        "Goose",
        "Barley",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Goose Stew with Barley and Celery Root",
    "url": "http://www.epicurious.com/recipes/food/views/goose-stew-with-barley-and-celery-root-51197630"
}
