{
    "directions": [
        "Chop onion and mince garlic. Peel carrots and parsnips and diagonally cut into 3/4-inch-thick slices. Peel turnips and cut into 3/4-inch-thick wedges. Cut mushrooms into 1/2-inch-thick slices. Peel gingerroot and mince enough to measure 1/4 cup. Drain tomatoes and chop.",
        "Pat chuck roast dry and season with salt and pepper. In a 5-quart heavy kettle heat oil over moderately high heat until hot but not smoking and brown roast on all sides. Transfer roast to a plate and pour off all but 1 tablespoon fat from kettle. Add onion to kettle and cook over moderate heat, stirring, until golden. Add garlic and cook, stirring, 1 minute. Add Port and red wine and simmer, scraping up any brown bits on bottom of kettle, 5 minutes. Stir in broth, Worcestershire sauce, brown sugar, gingerroot, tomatoes, bay leaves, thyme, and oregano and bring mixture to a boil. Add roast, carrots, parsnips, turnips, and mushrooms and simmer, covered, turning roast over halfway through cooking time, 3 hours total, or until tender. Pot roast may be made up to this point 3 days ahead. Cool roast, uncovered, before chilling, covered, and remove any solidified fat before reheating.",
        "Transfer roast with tongs to a cutting board and let stand 10 minutes. If necessary skim fat from cooking liquid and bring cooking liquid and vegetables to a boil over moderate heat. In a small bowl stir together cornstarch and water until smooth and stir enough into sauce to thicken to desired consistency. Simmer sauce, stirring occasionally, 2 minutes.",
        "Cut roast crosswise into 1/2-inch-thick slices and arrange on a deep platter. Spoon vegetables and sauce over meat. ."
    ],
    "ingredients": [
        "1 medium onion",
        "3 garlic cloves",
        "3/4 pound carrots",
        "1/2 pound parsnips",
        "1/2 pound turnips",
        "6 ounces mushrooms",
        "a 3-inch piece fresh gingerroot",
        "a 28- to 32-ounce can whole tomatoes",
        "a 3-pound boneless beef chuck roast",
        "2 tablespoons olive oil",
        "3/4 cup Tawny Port",
        "3/4 cup dry red wine",
        "2 cups beef or chicken broth",
        "2 tablespoons Worcestershire sauce",
        "1 tablespoon packed brown sugar",
        "3 bay leaves",
        "1 teaspoon dried thyme, crumbled",
        "1 teaspoon dried oregano, crumbled",
        "3 tablespoons cornstarch",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Mushroom",
        "Tomato",
        "Braise",
        "Root Vegetable",
        "Port",
        "Red Wine",
        "Fall",
        "Gourmet"
    ],
    "title": "Gordon's Pot Roast",
    "url": "http://www.epicurious.com/recipes/food/views/gordons-pot-roast-15733"
}
