{
    "directions": [
        "Cover chanterelle mushrooms with hot water, cover, and set aside to soften for 30 minutes. Once soft, remove the mushrooms from the water and chop; discard water.",
        "Melt butter along with truffle oil in a large saucepan over medium-high heat. Add the onion, shallot, and garlic; cook and stir two minutes until the onion begins to soften. Add the fresh mushrooms, and continue cooking until the mushroom softens and begins to release its liquid. Stir in the chopped chanterelle mushrooms, and cook 3 minutes more.",
        "Add Arborio rice; cook and stir for a few minutes until the rice is well coated with the onion mixture and looks glossy. Stir in the white wine, and cook until nearly evaporated.",
        "Reduce heat to medium, and add 1/3 of the hot chicken stock. Cook and stir until the chicken stock has been mostly absorbed, about 5 minutes. The risotto should be simmering gently while you stir in the chicken stock. Add half of the remaining stock, and stir for 5 minutes more. Finally add the remaining stock, and continue cooking until the risotto is creamy and the rice is tender, about 5 minutes more. The rice should not be completely soft, but still have a little firmness when you bite into it. You can add a little water if needed to cook the rice to this state.",
        "Remove the risotto from the heat, and stir in the heavy cream and Gorgonzola cheese. Season to taste with salt and pepper, and serve."
    ],
    "ingredients": [
        "2 ounces dried chanterelle mushrooms",
        "1 1/2 teaspoons butter",
        "1 teaspoon truffle oil (optional)",
        "1 chopped onion",
        "2 shallots, minced",
        "1 clove garlic, minced",
        "3 ounces sliced fresh button mushrooms",
        "1 (12 ounce) package Arborio rice",
        "1/2 cup dry white wine",
        "1 quart hot chicken stock",
        "2 tablespoons heavy cream",
        "2 tablespoons crumbled Gorgonzola cheese, or to taste",
        "ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gorgonzola and Wild Mushroom Risotto",
    "url": "http://allrecipes.com/recipe/150033/gorgonzola-and-wild-mushroom-risotto/"
}
