{
    "directions": [
        "Preheat the oven to 275°F. In a medium saucepan, heat the oil over medium heat. Add the leeks and onion, and sauté for 7 to 10 minutes, or until soft.",
        "In a medium bowl, whisk the egg yolks until pale in color. Whisk in the cream and half-and-half. Mix in the leeks, onions, Gorgonzola, dill or tarragon, parsley, salt, and pepper.",
        "Place six standard-size flan dishes in a baking pan. Divide the custard mixture among the dishes. Pour warm water into the pan to come halfway up the sides of the dishes. Bake in the oven for 35 to 40 minutes, or until the center of each custard still jiggles slightly. Remove from the oven and lift the dishes from the hot water. Place the dishes on a baking sheet.",
        "Evenly sprinkle 4 teaspoons grated cheese or 1 1/2 teaspoons sugar over each custard. Using a hand-held blowtorch, brown the cheese or caramelize the sugar (see note below). Serve hot."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "2 medium-large leeks (about 12 ounces total), split lengthwise, washed thoroughly, and sliced crosswise",
        "1 small yellow onion, chopped",
        "5 large egg yolks",
        "1 cup heavy (whipping) cream",
        "1 cup half-and-half",
        "5 ounces Gorgonzola cheese, crumbled",
        "1 tablespoon minced fresh dill or tarragon, or 3/4 teaspoon dried dill or tarragon",
        "3 tablespoons minced Italian parsley",
        "Salt and freshly ground black pepper to taste",
        "24 teaspoons or 6 tablespoons grated Parmesan cheese, or 9 or 6 teaspoons sugar for topping"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Appetizer",
        "Bake",
        "Sauté",
        "Backyard BBQ",
        "Leek",
        "Spring",
        "Summer",
        "Anniversary",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Gorgonzola and Leek Crème Brûlée",
    "url": "http://www.epicurious.com/recipes/food/views/gorgonzola-and-leek-creme-brulee-351770"
}
