{
    "directions": [
        "Cook bacon in a 4- to 5-quart wide heavy pot over moderate heat, turning over occasionally, until fat is rendered and bacon is crisp, about 5 minutes. Reserve bacon for another use, then add butter and onion to bacon fat and cook, stirring frequently, until onion is browned, 7 to 8 minutes. Stir in paprika and cook, stirring frequently, 1 minute.",
        "Pat chuck and liver dry and add to onion mixture, then cook, stirring frequently, until meat is browned, 10 to 12 minutes. Sprinkle with flour and cook, stirring frequently, 1 minute. Add wine and salt and bring to a boil, then reduce heat and gently simmer, covered, stirring occasionally, 1 hour. Transfer liver to a cutting board using tongs, then mince. Return liver to pot and add bell pepper. Gently simmer, covered, stirring occasionally, until beef is tender, about 1 hour.",
        "While meat is simmering, peel potatoes and cut into 1/2-inch pieces. Put potatoes in a 2- to 3-quart saucepan and cover with salted cold water, then simmer until just tender, 12 to 15 minutes. Add potatoes to soup along with 3 cups potato cooking liquid and salt to taste and simmer 5 minutes. Serve sprinkled with dill."
    ],
    "ingredients": [
        "3 bacon slices",
        "1 tablespoon unsalted butter",
        "1 large onion, finely chopped (1 cup)",
        "2 teaspoons sweet Hungarian paprika",
        "3 pounds boneless chuck roast, cut into 1/2-inch cubes",
        "1/4 pound calf's liver in 1 piece",
        "3 tablespoons all-purpose flour",
        "1 cup dry white wine",
        "1 teaspoon salt",
        "1 large green bell pepper, finely chopped (1 cup)",
        "2 pounds boiling potatoes (4 or 5 large)",
        "2 tablespoons chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Potato",
        "Stew",
        "Bacon",
        "Bell Pepper",
        "White Wine",
        "Winter",
        "Dill",
        "Gourmet"
    ],
    "title": "Goulash Soup",
    "url": "http://www.epicurious.com/recipes/food/views/goulash-soup-108661"
}
