{
    "directions": [
        "Pour warm water into a small bowl; stir in honey until dissolved. Add the yeast, stirring until dissolved. Let stand until creamy, about 10 minutes.",
        "In a large bowl, combine the flour and salt.  Add yeast mixture and olive oil; stir well to combine.  When the dough has pulled together, turn it out onto a lightly floured surface and knead in more flour until the dough is no longer sticky. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Punch down the risen dough on a floured surface. Divide into two equal portions. Allow the dough to relax for a minute, then roll each portion out into a thin circle. Place on lightly oiled pizza pans.",
        "To make the peanut sauce, place peanut butter, tea, rice vinegar, and soy sauce in a blender. Add chili oil, ginger, and honey; process until smooth.",
        "In a medium bowl, combine the chicken, sesame seeds, paprika, chile peppers, salt, and  3 tablespoons of the peanut sauce. Mix until the chicken is evenly coated. Spread the remaining peanut sauce evenly over pizza dough. Top with chicken, green onions, and cheese.",
        "Bake in preheated oven for 20 minutes or until cheese is lightly browned. Garnish with carrots and cilantro."
    ],
    "ingredients": [
        "Pizza Dough",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1 tablespoon honey",
        "2 teaspoons active dry yeast",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "2 tablespoons olive oil",
        "Pizza Sauce",
        "3 1/2 tablespoons peanut butter",
        "3 tablespoons brewed black tea",
        "3 tablespoons rice vinegar",
        "2 tablespoons soy sauce",
        "2 teaspoons chili oil",
        "1 tablespoon minced fresh ginger",
        "2 teaspoons honey",
        "Pizza Topping",
        "1 boneless chicken breast half, cooked and sliced into thin strips",
        "2 tablespoons toasted sesame seeds",
        "1 tablespoon paprika",
        "1 small fresh red chile pepper, finely chopped",
        "1 teaspoon salt",
        "4 green onions, sliced",
        "1 cup grated mozzarella cheese",
        "1 carrot, peeled and grated",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gourmet Thai Chicken Pizza",
    "url": "http://allrecipes.com/recipe/85719/gourmet-thai-chicken-pizza/"
}
