{
    "directions": [
        "Place the turkey bacon in a large, nonstick skillet over medium-high heat. Cook for about 30 seconds until the grease starts to render from the turkey. Stir in the garlic and onion, and cook for a few minutes until the aroma of the garlic mellows and the turkey has fully cooked. Stir in the green, red, yellow, and orange bell peppers, then add the basil, parsley, Worcestershire sauce, and cayenne pepper. Cook and stir until the peppers begin to soften, about 3 minutes. Pour in the Scotch, and simmer until evaporated. Scrape the pepper mixture into a bowl, and keep warm.",
        "Return the skillet to the stove over medium-low heat. Whisk together the eggs and five-spice powder until smooth. Pour into the skillet, and stir briefly until the egg begins to coagulate. Sprinkle with the Monterey Jack cheese and Gouda cheese. Continue cooking until the cheese begins to melt, then place the pepper mixture onto the omelet in a strip running down the center. Fold the sides of the omelet over the filling, and slide onto a plate. Cut the omelet in half, and dot each serving with salsa and sour cream. Sprinkle with chives to serve."
    ],
    "ingredients": [
        "4 slices peppered turkey bacon, cut into 1/2 inch pieces",
        "2 tablespoons minced garlic",
        "2 tablespoons minced onion",
        "1/4 cup diced green bell pepper",
        "1/4 cup diced red bell pepper",
        "1/4 cup diced yellow bell pepper",
        "1/4 cup diced orange bell pepper",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh parsley",
        "1 dash Worcestershire sauce",
        "1 pinch cayenne pepper",
        "1/4 cup Scotch whiskey",
        "3 eggs",
        "1 pinch Chinese five-spice powder",
        "1/4 cup shredded Monterey Jack cheese",
        "1/4 cup shredded Gouda cheese",
        "1/4 cup salsa",
        "2 tablespoons sour cream",
        "1 tablespoon chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gourmet Hangover Omelet",
    "url": "http://allrecipes.com/recipe/169163/gourmet-hangover-omelet/"
}
