{
    "directions": [
        "Heat oil in a large stockpot over medium. Add onion, garlic, and mushrooms and cook, stirring occasionally, until soft, 6–8 minutes. Crumble sausage, beef, and pork with your fingers into onion mixture. Add kosher salt, pepper, celery salt, oregano, garlic powder, and onion powder and cook, breaking up meat with a wooden spoon, until browned and cooked through, 3–5 minutes. Add tomato paste and cook, stirring occasionally, 15 minutes. Add crushed tomatoes and tomato sauce. Stir to combine, then reduce heat to medium-low and simmer, stirring occasionally, at least 3 hours and up to 8.",
        "Meanwhile, combine sausage, beef, pork, onion, breadcrumbs, Parmesan, milk, kosher salt, pepper, celery salt, oregano, garlic powder, and onion powder in a large bowl, breaking up meat with a wooden spoon. Using your hands, form mixture into 1\" balls and chill until sauce is ready.",
        "When sauce is ready, heat 1–2 Tbsp. oil in a large skillet over medium-high. Working in batches, add meatballs (without crowding) and cook, turning frequently, until browned on all sides, about 5 minutes per batch, adding more oil as needed. Transfer meatballs to a rimmed baking sheet as you finish cooking each batch.",
        "Reserve 2 cups tomato sauce, then add meatballs to remaining sauce in stockpot. If your pot is not large enough, divide sauce and meatballs between 2 pots. Cover and continue to simmer until meatballs are cooked through, 10–15 minutes.",
        "When meatballs and sauce are almost ready, cook spaghetti in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid, and return pasta to pot over medium-low heat. Spoon reserved 2 cups tomato sauce over pasta and toss to coat. Add pasta cooking liquid, 1/4 cup at a time, as needed to loosen sauce and coat pasta.",
        "Divide pasta among plates and top with meatballs and remaining sauce. Sprinkle with Parmesan.",
        "Sauce can be made, cooled, and chilled for up to 5 days or frozen for up to 3 months. Meatballs can be shaped and chilled 1 day ahead. Meatballs can be cooked in sauce, cooled, and chilled for up to 5 days or frozen for up to 3 months."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 large onion, chopped",
        "1 garlic clove, finely chopped",
        "4 ounces button mushrooms, trimmed, sliced (about 3 cups)",
        "3 sweet Italian sausages, removed from casings (about 1 pound)",
        "8 ounces ground beef",
        "8 ounces ground pork",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon celery salt",
        "1 teaspoon dried oregano",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 (12-ounce) can tomato paste",
        "3 (28-ounce) cans crushed tomatoes",
        "1 (28-ounce) can tomato sauce",
        "3 sweet Italian sausages, removed from casings (about 1 pound)",
        "8 ounces ground beef",
        "8 ounces ground pork",
        "1 small onion, chopped",
        "1 cup breadcrumbs",
        "1/2 cup grated Parmesan (about 3/4 ounce)",
        "1/2 cup milk",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon celery salt",
        "1 teaspoon dried oregano",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "Olive oil (for cooking)",
        "1 1/2 pounds spaghetti",
        "Kosher salt",
        "1/2 cup grated Parmesan (about 3/4 ounce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Pork",
        "Tomato",
        "Kid-Friendly",
        "Dinner",
        "Ground Beef",
        "Sausage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Gramma Pandolfi's Pasta Sauce with Meatballs",
    "url": "http://www.epicurious.com/recipes/food/views/gramma-pandolfis-pasta-sauce-with-meatballs-56389749"
}
