{
    "directions": [
        "In a bowl, dissolve the sugar in the warm water, and stir in the yeast. Let stand until the yeast forms a creamy layer, about 5 minutes.  In another bowl, mix the flour and margarine until well blended, and stir in the egg yolks, one at a time. Mix in the yeast mixture until incorporated, then stir in the sour cream to make a soft but not sticky dough. Cut the dough into 6 equal-sized pieces, cover with a cloth, and refrigerate for at least 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease baking sheets, or line with parchment paper.",
        "Working on a floured work surface, roll out one of the dough balls into a square about 6x8 inches, about 1/8-inch thick. Keep the other pieces of dough refrigerated. With a pastry cutter or pizza roller, cut the square into 12 smaller squares about 2 inches on a side. Place about 2 teaspoons of fruit filling in the middle of each square, and fold two opposite corners of dough together to meet in the center. Pinch the corners together to partially enclose the filling. Place the filled kolacky on the prepared baking sheets.",
        "Bake in the preheated oven until the cookies begin to turn golden brown, 20 to 25 minutes. Let cool on the baking sheets for about 2 minutes before removing them to wire racks to finish cooling. Sprinkle the kolacky with confectioners' sugar."
    ],
    "ingredients": [
        "1 teaspoon white sugar",
        "1/4 cup warm water (100 degrees F/40 degrees C)",
        "2 (.25 ounce) packages active dry yeast",
        "4 cups sifted all-purpose flour",
        "1 cup margarine, softened",
        "4 egg yolks",
        "1 cup sour cream",
        "3 (10 ounce) jars apricot or other fruit filling (such as Baker® Fine Dessert Filling)",
        "1/2 cup confectioners' sugar, for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Olga's Kolacky",
    "url": "http://allrecipes.com/recipe/212864/grandma-olgas-kolacky/"
}
