{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line 16 muffin cups with paper liners.",
        "Beat the butter, sugar, and almond extract in a mixing bowl with an electric mixer until light and fluffy. Beat in the eggs one at a time, mixing well after each addition, followed by the self-rising flour. Gently fold the ground almonds into the batter; spoon batter into the prepared cupcake cups, filling them about halfway.",
        "Bake the cupcakes until they have risen and a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes. Allow the cupcakes to cool completely.",
        "To decorate, knead the fondant until pliable; set aside about 1/3 of the fondant. Roll out the larger portion of the fondant on a work surface dusted generously with confectioners' sugar. Using a round cookie or biscuit cutter the same size as the cupcake tops, cut out circles of the fondant; place a fondant circle on each cupcake. Press the fondant down lightly.",
        "Divide the remaining fondant into four even portions; place 3 portions into a bowl and the other into a second small bowl. Tint the larger portion to your desired shade of green with the green food coloring. Tint the smaller portion to your desired shade of red food coloring.",
        "Roll out the green fondant on a work surface generously dusted with confectioners' sugar and cut out 32 holly leaves with leaf-shaped cutter. Use your finger to rub away any white confectioners' sugar on the green leaves and arrange 2 leaves on each cupcake. Roll red fondant into 48 small red berries and place 3 berries on the leaves of each cupcake."
    ],
    "ingredients": [
        "9 tablespoons butter, softened",
        "1 cup superfine sugar",
        "4 drops almond extract, or more to taste",
        "4 eggs",
        "1 cup self-rising flour",
        "1 3/4 cups ground almonds",
        "round cookie or biscuit cutter",
        "small holly leaf-shaped cutter",
        "1 pound ready-to-use white fondant, divided",
        "1/4 cup confectioners' sugar, or as needed",
        "2 drops green food coloring, or as desired",
        "1 drop red food coloring, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Christmas Cupcakes",
    "url": "http://allrecipes.com/recipe/218221/grandmas-christmas-cupcakes/"
}
