{
    "directions": [
        "Combine the flour and eggs and mix until smooth. Add the milk, soda water, vegetable oil, and salt and mix to combine; refrigerate the batter overnight.",
        "To make the pancakes, heat a lightly greased frying pan over medium heat. Remove the batter from the refrigerator and mix well. Pour 1/4 cup of the batter into the pan and cook the pancake for about one minute. Flip it over and cook for another minute, or until golden brown. Remove the pancake from the pan and place it on waxed paper. Repeat with the remaining batter, stacking the pancakes while keeping them separate with waxed paper.",
        "To make the filling, combine the chopped almonds, 1/2 cup sugar, milk, vanilla extract, and rum (if desired) in a saucepan. Cook and stir over low heat until the sugar is dissolved and the mixture is creamy. Allow it to cool slightly before filling the pancakes.",
        "For the chocolate topping, combine the water, 1/2 cup sugar, and chocolate in a saucepan and cook over low heat just until the chocolate melts. Remove the pan from the heat and add the margarine, stirring until melted and combined.",
        "Spread 1 heaping tablespoon of almond filling onto each pancake, rolling them up and placing them on a platter. (You will have 10 to 15 total, depending on their size.) Pour the chocolate topping over the platter of rolled pancakes. If desired, warm the platter in a microwave for about 30 seconds before serving."
    ],
    "ingredients": [
        "Pancakes:",
        "2 cups all-purpose flour",
        "2 eggs",
        "1 cup milk",
        "1 cup soda water",
        "1/2 cup vegetable oil",
        "1 pinch salt",
        "Almond Filling:",
        "1 cup chopped almonds",
        "1/2 cup white sugar",
        "1/4 cup milk",
        "1/4 teaspoon vanilla extract",
        "1 1/2 teaspoons rum (optional)",
        "Chocolate Topping:",
        "1/4 cup water",
        "1/2 cup white sugar",
        "1/2 cup chopped bittersweet chocolate",
        "2 tablespoons margarine"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Irena's Palacsinta (Hungarian Crepes)",
    "url": "http://allrecipes.com/recipe/212825/grandma-irenas-palacsinta-hungarian/"
}
