{
    "directions": [
        "Dissolve salt in a large bowl with enough water to cover the trimmed watermelon rind cubes (all green and red parts removed). Soak the watermelon rind overnight in the salty water. Drain, rinse, and place the rind cubes into a large saucepan over medium heat. Bring to a boil, reduce heat to a simmer, and cook until tender, about 10 minutes. Drain the rind in a colander set in the sink.",
        "Mix the sugar, vinegar, and 2 cups of water in a large bowl, stirring until the sugar has dissolved. Place the lemon, cinnamon, and cloves into a a piece of cheesecloth, and tie the corners together to make a spice bag. Place the spice bag into the pot, and stir in the watermelon rind pieces. Bring to a boil, reduce heat to a simmer, and cook until the watermelon rind becomes translucent, about 35 minutes. Remove the spice bag.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the watermelon pickle into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes, or the time recommended for your area.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all)."
    ],
    "ingredients": [
        "1/4 cup salt",
        "2 pounds watermelon rind, white part only, cut into 1-inch cubes",
        "4 cups white sugar",
        "2 cups white vinegar",
        "2 cups water",
        "1 lemon, thinly sliced",
        "2 tablespoons broken cinnamon stick",
        "1 tablespoon whole cloves",
        "1 18-inch square of cheesecloth",
        "3 (1 pint) canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Ashworth's Watermelon Pickle",
    "url": "http://allrecipes.com/recipe/218891/grandma-ashworths-watermelon-pickle/"
}
