{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "In a bowl, toss the oats with the canola oil, melted butter and salt. Spread the mixture out on 2 baking sheets and toast in the oven for 15 to 20 minutes, shaking the pan twice and making sure they don't burn. Remove from the oven and set aside. Reduce the heat to 325 degrees F.",
        "In a medium saucepan, combine the brown sugar, honey, apple juice and molasses. Heat the mixture slowly, stirring until all combined. Stir in the vanilla and remove from the heat.",
        "Toss together the toasted oats, rice cereal, wheat germ, pecans and almonds. Pour in the sugar mixture, stirring as you pour. Toss to combine; it will be sticky.",
        "Press into 1 baking sheet (thoroughly greased with butter) and bake until golden, about 25 minutes. Remove from oven and let cool. Cut pieces with a sharp knife and remove from the pan. You can cut them while they're still warm if that's easier.",
        "Dip the cooled granola bars straight into the melted chocolate so that the top is plain and the bottom is chocolate-covered. Set on parchment until set, sticking in the fridge to hasten this along if necessary."
    ],
    "ingredients": [
        "6 cups rolled oats (not quick oats)",
        "1/4 cup canola oil",
        "4 tablespoons butter, melted, plus more for greasing",
        "1 teaspoon salt",
        "1 cup brown sugar",
        "1/2 cup honey",
        "1/4 cup apple juice",
        "1/4 cup molasses",
        "3 teaspoons vanilla extract",
        "1 1/2 cups rice cereal",
        "1 cup wheat germ",
        "1/2 cup finely chopped pecans",
        "1/4 cup roughly chopped almonds",
        "8 ounces milk chocolate, melted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Granola Recipes",
        "Nut Recipes",
        "Grain Recipes",
        "Oats",
        "Chocolate",
        "Snack"
    ],
    "title": "Granola Bars",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/granola-bars-recipe"
}
