{
    "directions": [
        "Beat the egg and vinegar together in a small bowl, and set aside. Whisk together the flour, 2 tablespoons sugar, and salt in a mixing bowl. Cut in the cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. (This can also be done in a food processor: pulse the cold butter or shortening until it's the size of small peas. Turn mixture into a bowl and proceed.) Stir in the egg and vinegar mixture. Add the ice water a tablespoon at a time, tossing with a fork, until the flour mixture is moistened. Do not add more water than you need: when you squeeze a handful of the moistened pastry mixture, it should form a ball. Divide the dough in half and shape into balls. Wrap in plastic and refrigerate for at least 30 minutes or up to three days.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Roll one ball out to fit a 9 inch pie plate. Place bottom crust in pie plate and chill for at least 20 minutes before baking. Roll out top crust and set aside. Arrange the apple slices on the bottom of the pie crust, then scatter the blackberries on top. Sprinkle with 1/2 cup sugar. Place the second pie crust on top of the fruit mixture, and pinch the top and bottom crusts together. Lightly sprinkle the top crust with water, followed by the remaining 1 tablespoon of sugar. Poke several holes in the top of the crust with a fork to allow steam to escape during baking.",
        "Bake in the preheated oven until golden brown, 40 to 45 minutes."
    ],
    "ingredients": [
        "1 egg",
        "1 teaspoon distilled white vinegar",
        "2 1/2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1 teaspoon salt",
        "3/4 cup cold unsalted butter, cut into small cubes",
        "7 tablespoons ice water, plus more as needed",
        "6 cups fresh blackberries",
        "1 apple, peeled and cut into 1/2-inch thick slices",
        "1/2 cup white sugar",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Blackberry Pie",
    "url": "http://allrecipes.com/recipe/214558/grandmas-blackberry-pie/"
}
