{
    "directions": [
        "Place the warm water, salt, egg and 2 tablespoons butter in the pan of a bread machine. Add bread flour, and pour 1/4 cup sugar on the edge of the pan. Make a shallow hole in the flour and add the yeast. Close the lid, and set machine for the DOUGH cycle.",
        "While the dough is mixing, combine the prunes, prune juice, 1/4 cup sugar, cinnamon, cloves and lime juice in a saucepan. Bring to a boil, then reduce heat to low, and simmer until prunes are soft and the sauce has thickened, about 15 minutes. Remove from heat and blend in a mixer or food processor until smooth.",
        "When the bread machine signals the end of the dough cycle, transfer the dough to a lightly floured surface. Divide the dough into 20 small egg-sized pieces. Cover with greased plastic wrap, and set aside for 10 minutes.",
        "In a small bowl, mix together 1 cup sugar and 1/2 cup flour. Stir in melted butter and 1 teaspoon cinnamon to make a crumbly streusel.",
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a large baking sheet or line it with parchment paper.",
        "Shape the kolache dough into balls and place them on the prepared baking sheet. Press a shallow hole in the center of each one, and fill with prune filling. Top each of the kolaches with streusel. Let the kolaches rest until doubled in size, about 20 minutes.",
        "Bake until the tops are lightly browned, 14 to 16 minutes."
    ],
    "ingredients": [
        "For the Bread:",
        "1 cup warm water",
        "1 teaspoon salt",
        "1 egg",
        "2 tablespoons butter, room temperature",
        "3 cups bread flour",
        "1/4 cup white sugar",
        "3 teaspoons bread machine yeast",
        "For the Filling:",
        "2 cups pitted prunes",
        "2 cups prune juice or water",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon, or to taste",
        "1/2 teaspoon ground cloves, or to taste",
        "2 tablespoons lime juice",
        "For the Topping:",
        "1 cup white sugar",
        "1/2 cup all-purpose flour",
        "2 tablespoons butter, melted",
        "1 teaspoon cinnamon (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Skeet's Prune Kolaches",
    "url": "http://allrecipes.com/recipe/65237/grandma-skeets-prune-kolaches/"
}
