{
    "directions": [
        "Place the cumin seeds into a dry skillet over medium heat, and toast them, stirring constantly, until they give off a roasted fragrance and turn a darker brown, about 1 minute. Scrape the seeds into a bowl, and allow to cool. When cool, grind them with a mortar and pestle or a clean spice grinder. Set the ground seed aside.",
        "Remove stems of chiles if necessary, and soak pods in the apple cider vinegar in a bowl until soft, at least 1 hour. Place the softened chiles with vinegar, cumin, and garlic into a blender or food processor, and pulse until ground into a paste, 30 seconds to 1 minute or as needed.",
        "Heat the vegetable oil in a large pot over medium heat, and cook and stir the onions until lightly browned, about 10 minutes. Stir in ginger garlic paste and about 1 teaspoon of the Grandmother's Chile Paste mixture or as desired. Reduce heat to medium-low, and fry the onions with the spice pastes for 5 minutes to blend flavors. Stir in tomato paste, ground red pepper, turmeric, cinnamon, and cloves, and bring to a simmer. Cook to blend flavors, about 20 minutes.",
        "Mix in the lamb shank pieces, and stir in salt to taste; simmer for 20 minutes, and stir in the water. Bring the lamb and sauce to a boil, reduce heat to a simmer, and simmer until lamb is very tender and sauce has thickened, 45 more minutes. Sprinkle with chopped cilantro to serve."
    ],
    "ingredients": [
        "Grandmother's Chile Paste:",
        "1 teaspoon cumin seeds",
        "6 dried red chile peppers (preferably Kashmiri)",
        "1/4 cup apple cider vinegar",
        "1 clove garlic, coarsely chopped - or more to taste",
        "3 tablespoons vegetable oil",
        "2 onions, finely chopped",
        "2 teaspoons ginger garlic paste",
        "5 tablespoons tomato paste",
        "1 teaspoon ground red pepper (cayenne) or to taste",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "2 pounds lamb shanks, cut into 1 1/2-inch pieces",
        "1/2 teaspoon salt",
        "3 cups water",
        "1 tablespoon chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandmother's Lamb",
    "url": "http://allrecipes.com/recipe/217288/grandmothers-lamb-recipe/"
}
