{
    "directions": [
        "Preheat oven to 325°F. Line 8x8-inch metal baking pan with foil. Melt unsweetened chocolate and unsalted butter in heavy medium saucepan over low heat, stirring until smooth; cool slightly. Whisk sugar, grated orange peel, vanilla extract and salt into chocolate mixture. Whisk in eggs 1 at a time, then continue whisking until mixture is velvety. Add flour and whisk just to blend. Transfer batter to prepared metal baking pan.",
        "Bake brownies until top is just springy to touch and toothpick inserted into center comes out with moist crumbs attached, about 35 minutes. Cool in pan on rack 10 minutes. If necessary, press down on raised brownie edges to level top. Cool in pan completely.",
        "Bring cream and orange peel to simmer in heavy small saucepan. Remove from heat. Add chocolate and whisk until smooth. Whisk in Grand Marnier. Refrigerate until thick enough to spread, stirring occasionally, about 45 minutes.",
        "Spread topping over brownies. Refrigerate until topping is cold, about 1 hour. (Can be prepared 1 week ahead. Cover brownies tightly and keep refrigerated.) Using foil as aid, lift brownies from pan; trim edges. Cut into 25 squares. Let brownies stand at room temperature 30 minutes before serving."
    ],
    "ingredients": [
        "4 ounces unsweetened chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter",
        "1 1/4 cups sugar",
        "2 teaspoons grated orange peel",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "3 large eggs",
        "3/4 cup all purpose flour",
        "1/2 cup whipping cream",
        "1 teaspoon grated orange peel",
        "5 1/2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3 tablespoons Grand Marnier or other orange liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Orange",
        "Vanilla",
        "Fall",
        "Spring",
        "Birthday"
    ],
    "title": "Grand Marnier Brownie Kisses",
    "url": "http://www.epicurious.com/recipes/food/views/grand-marnier-brownie-kisses-103157"
}
