{
    "directions": [
        "Make a brine by dissolving 1/2 cup of salt in 4 cups water in a large container, place the cucumber spears into the brine, and let stand overnight.",
        "The next day, drain the cucumbers, rinse well with water, and set aside.",
        "Combine the sugar, vinegar, 1 cup of water, mustard seeds, celery seed, turmeric, and pickling salt in a large nonreactive pot, and bring to a boil. Add the carrot sticks, and boil for 2 minutes, until the carrots are cooked but not mushy. Stir in the pepper slices and cucumbers, and bring back to a boil.",
        "Sterilize canning jars and lids in boiling water for at least 5 minutes. Pack the pickles into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. Process in a boiling water bath canner for 15 minutes, remove the jars, and let cool to room temperature.",
        "Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "4 cups water",
        "10 medium pickling cucumbers, sliced lengthwise into spears",
        "4 cups white sugar",
        "3 cups distilled white vinegar",
        "1 cup water",
        "2 tablespoons whole mustard seeds",
        "2 teaspoons celery seed",
        "1 teaspoon ground dried turmeric",
        "1 tablespoon pickling salt",
        "6 large carrots, peeled and sliced lengthwise into sticks",
        "4 green bell peppers, seeded and cut into strips",
        "4 red bell peppers, seeded and cut into strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Arndt's Pickles",
    "url": "http://allrecipes.com/recipe/133581/grandma-arndts-pickles/"
}
