{
    "directions": [
        "In a large bowl, mix together the yeast, 1 teaspoon sugar, and 1/2 cup of warm water. Let the mixture stand until the yeast begins to bubble and form a layer of creamy foam on top, about 15 minutes. Stir in 2 more cups of warm water, olive oil, 1 tablespoon salt, garlic powder, and about 2 cups of flour. Mix together to form a loose batter, and begin beating in flour, about 1/2 cup at a time, until the dough is slightly sticky but not wet, about 3 more cups.",
        "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Form the dough into a ball, place into an oiled bowl, cover with a cloth, and let rise in a warm place until double, about 30 minutes.",
        "Melt 2 tablespoons of butter in a saucepan over medium-low heat, and stir in the oregano. Let the oregano fry in the butter for a few seconds, then whisk in the ricotta cheese until the mixture makes a smooth paste. Whisk in the tomato puree, onion powder, 1 pinch garlic powder, 1 teaspoon of salt, black pepper, and 1 teaspoon sugar until the sauce is smooth. Bring the sauce to a boil, stirring occasionally, cover, and remove from heat.",
        "Preheat oven to 375 degrees F (190 degrees C). Coat 3 12-inch pizza pans with about 1/2 teaspoon olive oil apiece.",
        "Place the sausage into a skillet over medium heat and sprinkle with 1 pinch dried oregano and 1 pinch crushed red pepper flakes, if desired. Brown the sausage, breaking it into small chunks as it cooks, until the sausage is no longer pink, about 10 minutes. Set the sausage aside.",
        "Place the dough on a floured surface, punch down the dough, and cut it into 3 equal pieces. Roll a dough piece out to the size of a prepared pizza pan, and place the dough on the pan. Stretch the edges of the dough a little beyond the pan, and fold the excess dough over to make a thicker edge. Press the folded dough together to seal. Repeat for the other 2 crusts.",
        "Bake the crusts in the preheated oven for about 15 minutes, then remove from oven and brush each crust with about 1/2 teaspoon melted butter (see Notes for details).",
        "Using a large spoon, spread a layer of sauce over each crust. Sprinkle with pizza cheese blend, dot pieces of browned sausage evenly over the cheese, spread pepperoni slices over the pizzas, and sprinkle each pizza with about 1/4 teaspoon of crushed red pepper. Shake 1 or more dashes of hot sauce over each pizza. Return the pizzas to the oven, and bake until the cheese is melted, bubbling, and beginning to brown, 15 to 20 more minutes."
    ],
    "ingredients": [
        "2 (.25 ounce) packages fast-rising dry yeast",
        "1 teaspoon white sugar",
        "2 1/2 cups warm water (110 degrees F/45 degrees C), divided",
        "1/3 cup olive oil",
        "1 tablespoon salt",
        "1 pinch garlic powder, or to taste",
        "5 cups all-purpose flour, or more if needed",
        "2 tablespoons butter, melted",
        "1 tablespoon dried oregano, or to taste",
        "2 tablespoons ricotta cheese (optional)",
        "1 (29 ounce) can tomato puree (such as Contadina® Tomato Puree)",
        "1 teaspoon onion powder, or to taste",
        "1 pinch garlic powder, or to taste",
        "1 teaspoon salt, or to taste",
        "1 teaspoon ground black pepper, or to taste",
        "1 teaspoon white sugar, or to taste",
        "1 1/2 teaspoons olive oil, divided",
        "3 Italian sausage links, casings removed",
        "1 pinch dried oregano, or to taste (optional)",
        "1 pinch crushed red pepper flakes, or to taste (optional)",
        "1 1/2 teaspoons melted butter, divided",
        "1 cup shredded pizza cheese blend, or as needed",
        "24 slices pepperoni sausage, or as needed",
        "3/4 teaspoon crushed red pepper flakes, or as needed",
        "3 dashes Louisiana-style hot sauce, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Homemade Pizza ala 'Da Boys'",
    "url": "http://allrecipes.com/recipe/213196/grandmas-homemade-pizza-ala-da-boys/"
}
