{
    "directions": [
        "In a large bowl, combine 1 cup flour, 1/4 cup sugar, 1 teaspoon lemon peel, and 1 teaspoon orange peel. Split a 1-inch piece of vanilla bean; scrape seeds into flour mixture. Cut in butter until mixture resembles course crumbs. Add 1 egg yolk; stir until all flour is moistened. Gather dough into ball, wrap in wax paper, and refrigerate for 1 hour and 30 minutes.",
        "Lightly butter a 9 inch springform pan. Roll dough on lightly floured surface to 1/8 inch thick; trim to a 10 inch circle. Reserve pastry trimmings. Press pastry circle into bottom and 1/2 inch up sides of a 9 inch buttered springform pan. Refrigerate 1 hour.",
        "Preheat oven to 400 degrees F (200 degrees C). Bake crust for 20 minutes, until lightly browned. Cool on wire rack.",
        "Beat cream cheese, 1 3/4 cups sugar, 3 tablespoons flour, 1 1/2 teaspoons lemon peel and 1 1/2 teaspoons orange peel in large mixer on medium speed until light and fluffy, about 10 minutes. Split a 1 inch piece of vanilla bean and scrape seeds into cream cheese mixture. Beat in 5 eggs and 2 egg yolks, 1 at a time, on medium speed. Stir in cream.",
        "Increase oven temperature to 500 degrees F (260 degrees C). Roll out reserved pastry trimmings on lightly floured board; cut into strips 2 inches wide. Pat strips up side of pan, pressing dough lightly to baked crust. Pour filling into crust. Bake 15 minutes.",
        "Reduce oven temperature to 200 degrees F (95 degrees C). DO NOT OPEN OVEN DOOR! Bake until cheesecake is firm in center, about 50 minutes. Turn off oven; leave cheesecake in oven with door slightly open for 1 hour. Remove from oven, and cool completely on wire rack. Refrigerate at least 2 hours."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4032&h=2111&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3713267.jpg",
    "ingredients": [
        "1 cup all-purpose flour",
        "¼ cup white sugar",
        "1 teaspoon grated lemon zest",
        "1 teaspoon grated orange zest",
        "½  vanilla bean",
        "½ cup unsalted butter",
        "1  egg yolk",
        "5 (8 ounce) packages cream cheese, softened",
        "1 ¾ cups white sugar",
        "3 tablespoons all-purpose flour",
        "1 ½ teaspoons grated lemon zest",
        "1 ½ teaspoons grated orange zest",
        "½  vanilla bean",
        "5  eggs",
        "2  egg yolks",
        "¼ cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandmother's Cheesecake",
    "url": "http://allrecipes.com/recipe/26030/grandmothers-cheesecake/"
}