{
    "directions": [
        "In a bowl, whisk together 2 cups of flour with salt. Using a pastry cutter, cut the vegetable shortening and 6 tablespoons of cold butter into the flour mixture until the butter and shortening are the size of small peas. Sprinkle on cold water, 1 tablespoon at a time, and gently gather the moistened dough together with a fork until it just begins to clean flour from the side of the bowl. Separate the dough into 2 equal-size pieces, form into rounds, and refrigerate until needed.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Melt 3 tablespoons of butter in a large skillet over medium heat, and cook the carrots, onion, and celery with black pepper until the onions are translucent, about 8 minutes. Transfer the mixture into a bowl; set aside. Place 2 tablespoons of flour into a resealable plastic zipper bag, and toss the cooked turkey meat into the flour; shake the bag to coat. Melt 2 more tablespoons of butter in the same skillet over medium heat, and cook the turkey meat in the butter until the flour coating turns golden brown, about 10 minutes. Pour the chicken broth into the skillet about 1/2 cup at a time, and stir until the broth begins to simmer and thicken, about 5 minutes. Remove the skillet from the heat. Stir in the cooked vegetables, green beans, cream of mushroom soup, cream-style corn, parsley, and thyme until the filling is thoroughly combined.",
        "Roll out one of the dough pieces on a floured work surface to a circle about 11 inches in diameter, then fit the crust into a 10-inch pie dish. Pour the filling into the bottom crust. Roll out the second crust into an 11-inch circle, lay it on top of the filling, then pinch and fold the two crusts together at the edges to seal. Cut 5 slits into the top crust to vent steam.",
        "Bake the pie in the preheated oven for 15 minutes; lower the oven temperature to 350 degrees F (175 degrees C) and bake until the filling is bubbling and the crust is golden brown, about 25 more minutes."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "7 tablespoons cold vegetable shortening",
        "6 tablespoons cold butter",
        "6 tablespoons cold water, or as needed",
        "3 tablespoons butter",
        "2 carrots, diced",
        "1 onion, diced",
        "2 stalks celery, diced",
        "1/8 teaspoon ground black pepper",
        "2 tablespoons all-purpose flour",
        "2 cups cubed cooked turkey",
        "2 tablespoons butter",
        "2 cups chicken broth",
        "1 (15 ounce) can cut green beans, drained",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 (15 ounce) can cream-style corn",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma Carlson's Turkey Pot Pie",
    "url": "http://allrecipes.com/recipe/215445/grandma-carlsons-turkey-pot-pie/"
}
