{
    "directions": [
        "Combine warm water and yeast together in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.",
        "Stir 3/4 cup lukewarm milk, white sugar, shortening, 1 egg, and salt into yeast mixture. Mix flour into yeast mixture until a soft, easy to handle dough forms.",
        "Turn dough out onto a lightly floured surface and let stand for 10 minutes. Knead dough until smooth and elastic, about 8 minutes. Form dough into a ball.",
        "Place dough in a large, lightly-oiled bowl and turn to coat. Cover bowl with a damp towel and let rise in a warm place until doubled in volume, or until a hole remains when your finger is pressed deeply into the dough, about 2 hours.",
        "Punch down dough and turn onto a lightly floured surface. Shape into ball and let dough rest for 15 minutes.",
        "Beat brown sugar, butter, and 1 egg together in a bowl until creamy. Add 1/4 cup milk, vanilla extract, and lemon extract; stir until smooth. Stir walnuts into the filling mixture until walnuts are completely incorporated.",
        "Roll dough on a large, floured cloth into a 20x30-inch rectangle. Spread walnut filling evenly over the top of the dough, spreading to the edges. Roll the rectangle up along the long edge like a jelly roll and pinch edges to seal. Coil the roll into a snail-shape.",
        "Grease a 9x13x2-inch baking sheet. Place shaped dough on the prepared sheet and let rise until an impression remains when the dough is gently pressed, about 1 hour.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Bake in the preheated oven until the top is golden brown, 40 to 45 minutes."
    ],
    "ingredients": [
        "Bread Dough:",
        "1/4 cup warm water",
        "1 (.25 ounce) package active dry yeast",
        "3/4 cup lukewarm milk",
        "1/4 cup white sugar",
        "1/4 cup vegetable shortening (such as Crisco®)",
        "1 egg, beaten",
        "1 teaspoon salt",
        "3 1/2 cups all-purpose flour, or more as needed",
        "Filling:",
        "1/2 cup brown sugar",
        "1/4 cup butter, softened",
        "1 egg",
        "1/4 cup milk",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon lemon extract",
        "2 cups finely chopped walnuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Povitisa (Po-vuh-teet-zuh) Povitica Croatian Nut Bread",
    "url": "http://allrecipes.com/recipe/235811/grandmas-povitisa-po-vuh-teet-zuh/"
}
