{
    "directions": [
        "Heat 1 tablespoon of olive oil in a skillet over medium-high heat. Add the minced garlic and the chopped green onion and cook for 2 minutes. Stir in the eggplant, salt, and pepper and cook until the eggplant begins to brown, about 7 minutes.",
        "Mix in the mushrooms and cook until the mushrooms are soft and have given off all of their liquid. Reduce the heat to low and add the spinach. Cook until the spinach wilts, about 1 to 2 minutes. Remove the pan from the heat. Stir in the salmon, ricotta, cottage cheese, Parmesan cheese, chopped parsley, and the dried basil. Mix well and set aside.",
        "On a lightly floured surface, roll out the pasta dough into a long thin rectangle; the dough should be about 1 millimeter thick. Slice the dough in half, width-wise, to make two rectangles. Spoon half the salmon mixture onto one side of each rectangle. Fold the other side of the rectangle over the filling and press to seal the dough around the filling. Trim the edges to make a nice shape and crimp edges to seal. Repeat with remaining ravioli. Refrigerate ravioli for 1 hour.",
        "Coat the cauliflower with 1 tablespoon of olive oil. Mix together the minced garlic, Parmesan cheese, bread crumbs, and salt and pepper to taste. Pour the garlic-bread crumb mixture over the cauliflower and toss to combine.",
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Spray a baking sheet with olive oil cooking spray. Place the ravioli in the center of the tray. Surround the ravioli with the seasoned cauliflower. Arrange the cherry tomatoes over the cauliflower and top with grated zucchini and sprinkle with salt and pepper to taste.",
        "Bake the ravioli and vegetables in the preheated oven until the cauliflower and zucchini begin to brown, about 20 minutes. Remove the baking sheet from the oven. Use a spatula to transfer each ravioli to the center of a dinner plate. Spoon cauliflower mixture around the ravioli. Spread 1/2 tablespoon butter on each ravioli, sprinkle with the remaining chopped parsley, and serve."
    ],
    "ingredients": [
        "For the Ravioli:",
        "1 tablespoon olive oil",
        "2 cloves garlic, minced",
        "1 green onion, chopped",
        "1 eggplant, peeled and cubed",
        "sea salt and pepper to taste",
        "1 1/4 cups sliced fresh mushrooms",
        "1 cup fresh spinach",
        "1 cup cooked salmon, flaked",
        "3 tablespoons ricotta cheese",
        "3 tablespoons cottage cheese",
        "3 tablespoons grated Parmesan cheese",
        "2 tablespoons finely chopped fresh parsley",
        "1 1/2 teaspoons dried basil",
        "1 pound fresh pasta sheets",
        "For the Roasted Vegetables:",
        "4 cups cauliflower florets",
        "1 tablespoon olive oil",
        "1/2 cup dry bread crumbs",
        "2 cloves garlic, minced",
        "1 tablespoon grated Parmesan cheese",
        "sea salt and pepper to taste",
        "olive oil cooking spray",
        "8 ounces cherry tomatoes, halved",
        "1 zucchini, grated",
        "1 tablespoon butter",
        "1 tablespoon finely chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grande Ravioli Salmone e Vedure",
    "url": "http://allrecipes.com/recipe/213130/grande-ravioli-salmone-e-vedure/"
}
