{
    "directions": [
        "Pour the milk into a small saucepan, and set over medium heat. Heat just until a skin starts to form on the top, then remove from the stove, and stir in salt and 1/4 cup margarine. Allow to cool to lukewarm.",
        "Place 1/8 cup of  warm water in a small bowl. Stir in 1/2 teaspoon sugar. Sprinkle yeast over the surface, and let stand until foamy, 5 to 10 minutes.",
        "In a large bowl, stir together the cooled milk mixture and the yeast for 2 minutes using an electric mixer on medium speed. Add egg, and mix well. Use a large wooden spoon to stir in flour 1/2 cup at a time, mixing well after each addition until the mixture forms a dough. Knead on a floured surface, adding more flour if necessary, until dough is smooth and elastic, about 8 minutes. Place in an oiled bowl, and turn once to coat the top. Cover, and let rise until doubled in size, 1 to 2 hours.",
        "Punch down dough, and let rest on the counter while you prepare the caramel topping. In a medium bowl, mix together the corn syrup, 1 1/2 tablespoons of water, 3 tablespoons of margarine and brown sugar until smooth. Spread an even layer onto the bottom of a 9x9 inch baking dish. Place pecan halves upside down in rows over the sugar mixture.  Set aside.",
        "On a lightly floured surface, roll dough out to a 9x12 inch rectangle Spread with 2 tablespoons of margarine. Mix together 1/4 cup of sugar with the cinnamon; sprinkle over the margarine. Roll the dough up starting at the long end to form a log. Pinch the seam together to seal. Cut the roll into 1 inch rounds. Place the rounds into the prepared baking dish. Set in a warm place to rise until doubled, about 30 minutes.",
        "Preheat the oven to 350 degrees F (175 degrees C). Bake rolls for 20 to 25 minutes in the oven, until golden brown. Invert baking pan onto a cutting board or a clean cookie sheet while still warm so the caramel topping is on top."
    ],
    "ingredients": [
        "1/2 cup milk",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon salt",
        "1/4 cup margarine",
        "1/8 cup warm water (110 degrees F)",
        "1 (.25 ounce) envelope active dry yeast",
        "1 egg",
        "2 1/2 cups all-purpose flour, or as needed",
        "2 tablespoons margarine, softened",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "2 tablespoons light corn syrup",
        "1 1/2 tablespoons water",
        "3 tablespoons margarine",
        "3/4 cup packed brown sugar",
        "1/2 cup pecan halves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandmother Stougaard's Caramel Pecan Sweet Rolls",
    "url": "http://allrecipes.com/recipe/54513/grandmother-stougaards-caramel-pecan/"
}
