{
    "directions": [
        "Blend flour, sugar and salt in processor 10 seconds. Add unsalted butter and lard and process until mixture resembles coarse meal, using on/off turns. Blend in 6 tablespoons water. Mix in enough additional water by tablespoonfuls until moist clumps form. Gather dough into ball; divide in half. Flatten each half into disk. Wrap tightly in plastic and refrigerate until firm, about 1 hour. (Can be made 1 day ahead. Keep refrigerated. Let dough disks soften slightly at room temperature before continuing.)",
        "Roll out 1 dough disk on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie plate. Trim overhang to 1 inch; fold edges under. Crimp crust edge decoratively, forming high-standing rim. Repeat rolling and shaping with remaining dough disk. Freeze crusts 15 minutes.",
        "Preheat oven to 350°F. Line crusts with foil; fill with dried beans or pie weights. Bake crusts until sides begin to set, about 15 minutes. Remove foil and beans. Bake crusts until pale golden, piercing with toothpick if crusts bubble, about 15 minutes. Cool completely on racks. Maintain oven temperature.",
        "Whisk all ingredients in large bowl to blend. Pour half of pumpkin filling (about 3 3/4 cups) into each prepared pie crust.",
        "Bake pies until filling is set in center, about 1 hour. Cool pies on racks."
    ],
    "ingredients": [
        "2 2/3 cups all purpose flour",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1/2 cup chilled lard or vegetable shortening, cut into pieces",
        "8 tablespoons (about) ice water",
        "3 cups solid pack pumpkin (about 1 1/2 16-ounce cans)",
        "1 1/2 cups sugar",
        "1 1/2 cups whipping cream",
        "1 1/4 cups milk",
        "6 tablespoons all purpose flour",
        "3 large eggs",
        "3 tablespoons dark molasses",
        "1 tablespoon ground cinnamon",
        "3/4 teaspoon ground allspice",
        "3/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Spice",
        "Pumpkin",
        "Fall",
        "Molasses"
    ],
    "title": "Grandma Cottington's Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/grandma-cottingtons-pumpkin-pie-920"
}
