{
    "directions": [
        "Dissolve yeast in warm water and warm orange juice in a bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.",
        "Beat warm milk, shortening, 1/4 cup white sugar, egg, and salt together in a separate bowl. Stir yeast mixture into milk mixture. Add enough flour to mixture to create a soft dough. Turn dough onto a lightly floured surface; knead until smooth and elastic, 6 to 8 minutes.",
        "Grease a large bowl and two 11x7x2-inch baking sheets.",
        "Place dough in the greased bowl and turn dough to coat all sides. Cover bowl with plastic wrap or a clean towel and let rise in a warm place until dough is doubled in size, about 1 hour.",
        "Punch dough down and divide in half. Roll each half on a lightly floured surface creating 2 15x10-inch rectangles.",
        "Mix 1 cup white sugar, 1/2 cup softened butter, and 2 tablespoons orange zest in a bowl until smooth; spread half the filling onto each dough rectangle. Roll each rectangle around the filling, jelly roll-style, starting with the long end creating a log. Cut each log into 15 rolls.",
        "Arrange rolls on the prepared baking sheets. Cover baking sheets with plastic wrap and let rolls rise until doubled in size, about 45 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C). Remove plastic wrap from baking sheets.",
        "Bake rolls in the preheated oven until lightly browned, 20 to 25 minutes.",
        "Beat confectioners' sugar, cream cheese, 3 tablespoons softened butter, orange juice, and 2 teaspoons orange zest in a bowl until frosting is smooth. Spread frosting on the warm rolls."
    ],
    "ingredients": [
        "Rolls:",
        "1 (.25 ounce) package active dry yeast",
        "1/4 cup warm water (105 - 115 degrees F; 40 - 45 degrees C)",
        "3/4 cup warm orange juice (105 - 115 degrees F; 40 - 45 degrees C)",
        "1/4 cup warm milk (105 - 115 degrees F; 40 - 45 degrees C)",
        "1/4 cup shortening",
        "1/4 cup white sugar",
        "1 egg, lightly beaten",
        "1 teaspoon salt",
        "3 3/4 cups all-purpose flour, or as needed",
        "Filling:",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "2 tablespoons orange zest",
        "Frosting:",
        "2 cups confectioners' sugar",
        "1/2 (8 ounce) package cream cheese, softened",
        "3 tablespoons butter, softened",
        "3 tablespoons orange juice",
        "2 teaspoons orange zest"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Orange Rolls with Orange Cream Cheese Frosting",
    "url": "http://allrecipes.com/recipe/231305/grandmas-orange-rolls-with-orange-cr/"
}
