{
    "directions": [
        "Heat 2 tablespoons of olive oil over medium heat in the bottom of a large saucepan, and fry the garlic cloves 5 to 8 minutes, until brown and fragrant. Remove the garlic cloves and set aside. Place the pig's feet and pork neck bones in the saucepan and fry, turning occasionally, until the meat and bones have browned, about 15 minutes.",
        "Return the garlic cloves to the saucepan, and stir in the tomato paste and 1 1/2 cups of water. Bring to a boil, and pour in the tomato puree. Reduce heat to low, and simmer for about 3 hours, stirring from the bottom often to prevent burning, until the pig's feet are tender and the mixture begins to thicken. Stir in the sugar, pepper, and baking soda. Continue to simmer while you prepare the meatballs.",
        "Soak the torn bread with 1 cup of water in a bowl. Squeeze excess water out of the bread, and place the bread in a large bowl with the 6 beaten eggs, ground pork, ground veal, and ground beef. Mix thoroughly and form into 24 meatballs about 2 1/2 inches in diameter.",
        "Heat 1 tablespoon olive oil in a large skillet over medium heat, stir in the minced garlic and chopped fresh basil, let them cook for about 1 minute, and then add the meatballs. Season with salt and pepper to taste, and fry them on all sides until brown, about 15 minutes, working in batches, if necessary.",
        "Place the browned meatballs, along with the oil, garlic, and basil from the skillet into the sauce, stirring lightly to avoid breaking them. Add the whole hard-boiled eggs, and simmer for about 1 1/2 more hours, until the meatballs are cooked, the sauce is thick, and all the flavors have blended."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "3 whole garlic cloves, peeled",
        "2 pig's feet",
        "1 pound pork neck bones",
        "2 (6 ounce) cans tomato paste",
        "1 1/2 cups water",
        "2 (28 ounce) cans tomato puree",
        "1 tablespoon white sugar",
        "1 teaspoon black pepper",
        "3/4 teaspoon baking soda",
        "1 (16 ounce) loaf fresh Italian bread, torn into 2-inch pieces",
        "1 cup water",
        "6 eggs, beaten",
        "1 pound ground pork",
        "1 pound ground veal",
        "1 pound ground beef",
        "1 tablespoon olive oil",
        "1 clove garlic, minced",
        "2 tablespoons chopped fresh basil",
        "salt and pepper to taste",
        "6 hard-boiled eggs, peeled (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grandma's Old Italian Spaghetti Sauce with Meatballs",
    "url": "http://allrecipes.com/recipe/191507/grandmas-old-italian-spaghetti-sauce/"
}
