{
    "directions": [
        "Pulse flour, sugar, and salt in a food processor. Add butter and shortening; pulse just until coarse meal forms. Add 1/3 cup ice water; pulse until dough forms clumps, adding more ice water by teaspoonfuls if dry. Gather dough into a ball; divide in half. Flatten into disks, wrap in plastic, and chill for at least 1 hour and up to 2 days.",
        "Roll out 1 dough disk on a lightly floured surface into an 11\" round. Transfer to pie dish; press gently onto bottom and up sides of dish. Trim dough flush with edge of dish, leaving no overhang. Freeze until firm, about 10 minutes. Add scraps to remaining dough disk; roll out on parchment paper to a 12\" round. Slide paper with dough onto a rimless baking sheet and chill in refrigerator.",
        "Preheat oven to 375°F. Line dough in pie dish with foil or parchment paper. Fill foil with pie weights or dried beans. Bake until edges are just beginning to turn golden, 25-30 minutes. Remove foil and pie weights. Return dish to oven; continue baking until crust is dark golden all over, about 20 minutes longer. Transfer pan to a wire rack; let crust cool completely.",
        "Mix apples, grapes, sugar, and flour in a large saucepan; stir to coat. Cook over medium-low heat, stirring often, until fruit is translucent and juices are thickened, 30-40 minutes. Let mixture cool to room temperature.",
        "Preheat oven to 375°F. Transfer fruit to crust. Remove remaining dough from refrigerator. Using a decorative cutter, make a pattern in center of dough, leaving a 2\" plain border; reserve cutouts. Invert dough over fruit in crust; peel off parchment paper. Trim dough along edge of crust, leaving no overhang. Arrange reserved dough cutouts decoratively over top crust, pressing lightly to adhere. Place pie on a baking sheet.",
        "Bake pie until crust is golden brown and juices bubble, 50 minutes-1 hour. Transfer to a wire rack to cool. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature. Serve with ice cream, if desired."
    ],
    "ingredients": [
        "3 cups all-purpose flour plus more for surface",
        "1 tablespoon sugar",
        "1 1/2 teaspoons kosher salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1/2\" cubes",
        "1/2 cup vegetable shortening",
        "3 pounds tart, crisp apples (such as Crispin or Pink Lady), peeled, quartered, cored, thinly sliced",
        "1 pound red or black grapes, halved, seeded if needed",
        "3/4 cup plus 2 tablespoons sugar",
        "2 tablespoons all-purpose flour",
        "Vanilla ice cream (optional)",
        "**Special equipment:**A 9'-diameter glass or cermanic pie dish or metal pie pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Grape",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grape & Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/grape-apple-pie-368275"
}
