{
    "directions": [
        "Roll out dough with a floured rolling pin into a 13-inch round on a floured surface and fit into tart pan (if pastry breaks, press together with your fingers). Trim excess dough, leaving a 1/2-inch overhang, then fold overhang inward and press against side of pan to reinforce edge. Lightly prick bottom of shell all over with a fork. Chill 30 minutes.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights. Bake in middle of oven 10 minutes, then carefully remove foil and weights and bake shell until golden, 13 to 15 minutes more. Transfer shell in pan to a rack to cool.",
        "Cut peel, including all white pith, from fruit with a sharp paring knife, then cut segments free from membranes and pat dry with paper towels. Squeeze 3 tablespoons juice from membranes into a bowl. Whisk together mascarpone, candied ginger, 2 tablespoons juice, and 2 tablespoons confectioners sugar. Add remaining tablespoon juice if mixture is too thick.",
        "Spread ginger mascarpone evenly in tart shell and top decoratively with fruit. Dust with remaining 2 tablespoons confectioners sugar and serve immediately."
    ],
    "ingredients": [
        "Sweet pastry dough",
        "4 grapefruit (preferably 2 pink and 2 red)",
        "8 oz mascarpone cheese* at room temperature",
        "3 tablespoons finely chopped candied ginger",
        "4 tablespoons confectioners sugar",
        "Special equipment: a 9- to 10-inch round tart pan (1 inch deep) with removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Grapefruit",
        "Winter",
        "Shower",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grapefruit Tart",
    "url": "http://www.epicurious.com/recipes/food/views/grapefruit-tart-106178"
}
