{
    "directions": [
        "In a bowl with an electric mixer beat the egg whites with the salt until they are foamy, beat in the cream of tartar, and beat the whites until they hold soft peaks. Beat in the sugar, a little at a time, beat the meringue for 5 to 7 minutes, or until it is stiff and glossy and the sugar is dissolved, and fold in the coconut. Drop heaping tablespoons of the meringue evenly around the edge of a well-butter 9-inch (1-quart) pie plate, spreading the meringue with the back of the spoon to form the side of the shell, and spread the remaining meringue evenly over the bottom of the pie plate. Bake the shell in the middle of a preheated 250°F. oven for 1 1/4 to 1 1/3 hours, or until it if firm and very pale golden, turn off the oven, and let the shell cool completely in the oven with the door ajar. (Once the shell is cooled completely, it may be left overnight in the oven with the door closed.)",
        "In a small bowl sprinkle the gelatin over 1/4 cup of the grapefruit juice and let it soften for 1 minute. In a small saucepan whisk together the egg yolks and the sugar, add the remaining 1/2 cup grapefruit juice, the gelatin mixture, and a pinch of salt, and cook the mixture over moderate heat, whisking, until it registers 160°F. on a candy thermometer. Transfer the yolk mixture to a metal bowl set in a larger bowl of ice and cold water and whisk it constantly until it is thickened to the consistency of raw egg white but is not set. Remove the smaller bowl from the bowl of ice and cold water and reserve the bowl of ice and cold water for later use. In another metal bowl with an electric mixer beat the cream cheese until it is light, fluffy, and smooth, scraping down the side, add the yolk mixture, a little at a time, beating, and beat the mixture until it is smooth and combined well. Set the bowl containing the cream cheese mixture in the reserved bowl of ice and cold water and whisk the cream cheese mixture until is thickened and forms a ribbon when the whisk is lifted. In a bowl beat the heavy cream until it holds stiff peaks and whisk about one fourth of it into the cream cheese mixture. Fold in the remaining whipped cream gently but thoroughly and fold in the grapefruit pieces gently.",
        "Pour the filling into the shell, smoothing the top, and chill the pie, uncovered, for 4 hours, or until the filling is set completely. (If the pie is to be chilled for more than 4 hours, cover it with plastic wrap or wax paper.) Just before serving garnish the pie with the grapefruit sections."
    ],
    "ingredients": [
        "4 large egg whites at room temperature",
        "1/4 teaspoon salt",
        "1/4 teaspoon cream of tartar",
        "1 cup sugar",
        "1 cup sweetened flake coconut",
        "1 envelope (about 1 tablespoon) unflavored gelatin",
        "3/4 cup strained fresh grapefruit juice",
        "4 large egg yolks",
        "1/2 cup sugar",
        "8 ounces cream cheese, softened",
        "1 cup well-chilled heavy cream",
        "2 cups fresh grapefruit sections (cut from about 3 large grapefruit), cut into 1/2-inch pieces and drained well",
        "fresh grapefruit sections for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Grapefruit",
        "Coconut",
        "Summer",
        "Chill",
        "Candy Thermometer",
        "Gourmet"
    ],
    "title": "Grapefruit and Coconut Angel Pie",
    "url": "http://www.epicurious.com/recipes/food/views/grapefruit-and-coconut-angel-pie-11741"
}
