{
    "directions": [
        "Sterilize the jars and lids in boiling water for at least 5 minutes.",
        "Place grapes in a large wide pot and mash using a potato masher just enough to generate a small amount of juice. Turn heat to medium-low and cook until grapes can be easily crushed, about 10 minutes. Remove pot from heat.",
        "Place grapes in a food mill or a fine mesh strainer and press as much pulp and juice into a large bowl. Discard skins and seeds. You should have about 8 cups pulp and juice.",
        "Place several small plates in the freezer.",
        "Return grape pulp and juice to the pot and add honey, lemon juice, and butter; bring to a boil. Cook, stirring occasionally, until mixture begins to reduce and thicken, about 20 minutes. Place a small spoonful of jam in the center of a frozen plate; wait 10 seconds. Drag a finger slowly through the jam. If the jam forms wrinkles ahead of your moving finger, it is done. If it does not wrinkle, continue to boil and repeat the test at 5-minute intervals.",
        "Pack jam into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "5 quarts stemmed Concord grapes",
        "3 1/2 cups honey",
        "1 large lemon, juiced",
        "1 teaspoon butter (optional)",
        "7 half-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grape Honey Jam",
    "url": "http://allrecipes.com/recipe/245019/grape-honey-jam/"
}
