{
    "directions": [
        "Combine 1 cup grapefruit juice and sugar in medium saucepan. Stir over medium heat until sugar dissolves. Increase heat and bring to boil. Remove from heat; stir in remaining 1 cup grapefruit juice, Campari, and grated peel. Pour mixture into 11x7x2-inch glass baking dish or metal baking pan. Cover and freeze until firm, at least 8 hours or overnight. DO AHEAD: Can be made 3 days ahead. Keep frozen.",
        "Using sharp knife, cut off all peel and white pith from 4 grapefruits. Working over bowl to catch juices and using small sharp knife, cut between membranes to release segments into bowl. Squeeze any remaining juice from membranes into bowl. DO AHEAD: Can be made 4 hours ahead. Cover; chill.",
        "Combine whipping cream, crème fraîche, and powdered sugar in medium bowl. Scrape in seeds from vanilla bean; reserve bean. Using electric mixer, beat mixture until soft peaks form. Add reserved vanilla bean to cream mixture; cover and chill at least 2 hours. DO AHEAD: Can be made 4 hours ahead. Keep chilled.Remove vanilla bean and rewhisk cream mixture until thick before using.",
        "Using fork, scrape surface of granita to form icy flakes. Divide grapefruit segments and juices from bowl among 6 dessert glasses. Divide granita among glasses. Top each with large dollop of vanilla whipped cream and serve immediately."
    ],
    "ingredients": [
        "2 cups fresh ruby red or pink grapefruit juice, divided",
        "6 tablespoons sugar",
        "2/3 cup Campari",
        "1 tablespoon (packed) finely grated ruby red or pink grapefruit peel",
        "4 ruby red or pink grapefruits",
        "1 cup chilled heavy whipping cream",
        "1/4 cup chilled crème fraîche or sour cream",
        "4 teaspoons powdered sugar",
        "1 1 1/2-inch piece vanilla bean, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Mixer",
        "Citrus",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Vegetarian",
        "Frozen Dessert",
        "Grapefruit",
        "Spice",
        "Vanilla",
        "Spirit",
        "Campari",
        "Party",
        "Sour Cream",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grapefruit-Campari Granita with Vanilla Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/grapefruit-campari-granita-with-vanilla-whipped-cream-357517"
}
