{
    "directions": [
        "Preheat oven to 350°F. Toast pine nuts on a rimmed baking sheet, tossing occasionally, until golden brown, 6–8 minutes; let cool.",
        "Increase oven heat to 400°F. Place beets on a sheet of parchment paper set on top of a sheet of foil; rub beets with oil and season with salt. Close up parchment and foil around beets. Place packet on a baking sheet and roast beets until tender, 40–50 minutes. Unwrap beets and let cool.",
        "Peel beets and thinly slice into rounds. Toss beets and vinegar in a medium bowl; season with salt and let stand 15 minutes.",
        "Meanwhile, finely grate 1/2 teaspoon zest from 1 grapefruit and set aside. Using a sharp, small knife, cut all peel and white pith from both grapefruits; discard. Thinly slice grapefruit into rounds.",
        "Place yogurt in a small bowl; season with salt and mix well. Spoon onto plates. Top yogurt with beets and sliced grapefruit, then tarragon, toasted pine nuts, and reserved grapefruit zest.",
        "DO AHEAD: Beets can be roasted 2 days ahead; let cool. Cover and chill. Pine nuts can be toasted 1 day ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "3 tablespoons pine nuts",
        "4 medium white or Chioggia (candy-stripe) beets (about 1 pound)",
        "1 tablespoon olive oil",
        "Kosher salt",
        "2 tablespoons white wine vinegar",
        "2 white grapefruits",
        "3/4 cup plain Greek yogurt",
        "1/4 cup fresh tarragon leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Lunch",
        "Grapefruit",
        "Beet",
        "Winter",
        "Healthy",
        "Tarragon",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grapefruit and White Beets with Yogurt and Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/grapefruit-and-white-beets-with-yogurt-and-tarragon-51214690"
}
