{
    "directions": [
        "Preheat oven to 350°F. Line an 8 1/2-by-4 1/2–inch loaf pan, preferably metal, with parchment paper, leaving overhang on the long sides, and lightly coat with nonstick spray. Whisk flour, baking powder, and 3/4 tsp. salt in a medium bowl.",
        "Using your fingers, work grapefruit zest into granulated sugar in a large bowl until sugar starts to clump and mixture is very fragrant, about 1 minute. Add eggs, oil, and vanilla and beat with an electric mixer on high speed until light and thick, about 4 minutes. Reduce speed to low and mix in half of dry ingredients, then mix in 3/4 cup yogurt. Mix in remaining dry ingredients followed by 5 Tbsp. grapefruit juice and 1 Tbsp. poppy seeds. Scrape batter into prepared pan and smooth top.",
        "Bake cake until top is golden brown and a tester inserted into the center comes out clean, 50 to 60 minutes. Transfer pan to a wire rack. Poke holes in top of cake and brush remaining 3 Tbsp. grapefruit juice over top. Let sit 15 minutes, then run a knife around sides to loosen and use parchment paper to lift cake out of pan and onto rack. Remove parchment and let cool completely.",
        "Whisk powdered sugar, remaining 1 Tbsp. yogurt, 1 tsp. water, and a pinch of salt in a medium bowl until smooth and drizzle over cake. Sprinkle with poppy seeds and let sit until glaze is set, about 30 minutes.",
        "Loaf can be baked and glazed 3 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon kosher salt, plus more",
        "1 tablespoon finely grated grapefruit zest",
        "1 cup granulated sugar",
        "2 large eggs, room temperature",
        "1/3 cup vegetable oil",
        "1 teaspoon vanilla extract",
        "3/4 cup plus 1 tablespoon plain Greek yogurt",
        "8 tablespoons fresh grapefruit juice, divided",
        "1 tablespoon poppy seeds, plus more for sprinkling",
        "1/2 cup powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Grapefruit",
        "Winter",
        "Poppy",
        "Dessert",
        "Bake",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grapefruit–Poppy Seed Loaf Cake With Yogurt Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/grapefruit-poppy-seed-loaf-cake-with-yogurt-glaze"
}
