{
    "directions": [
        "Rinse grape leaves in several changes of cold water and in a large saucepan of boiling water blanch 3 minutes. In a colander drain leaves and refresh under cold water. Drain leaves well.",
        "Toast pine nuts golden and chop separately onion, prosciutto, raisins, dill, and parsley. In a saucepan bring 2 cups water to a boil with salt and stir in rice. Cook rice, covered, over moderately low heat until water is absorbed, 17 to 20 minutes, and transfer to a large bowl. In a heavy skillet cook onion in 2 tablespoons oil over moderate heat, stirring, until tender and golden and stir into rice with pine nuts, prosciutto, raisins, dill, parsley, currants, 3 tablespoons lemon juice, and salt and pepper to taste until combined well.",
        "Arrange 1 grape leaf, smooth side down, on a kitchen towel. Trim stem flush with leaf (if leaf is large, trim to 5‚ inches across), reserving stem and any trimmings. Spoon about 1 tablespoon filling onto leaf near stem end and roll up filling tightly in leaf, folding in sides and squeezing roll to pack filling. (Roll should be about 3 1/2 inches long.) Make more rolls in same manner.",
        "In a saucepan heat broth just to a simmer and keep warm, covered. Line bottom of a 3-quart heavy saucepan with reserved stems and trimmings and any remaining grape leaves and arrange rolls, seam sides down, close together in layers over leaves, seasoning each layer with salt. Drizzle remaining 2 tablespoons oil and remaining 3 tablespoons lemon juice over rolls and cover with an inverted heatproof plate slightly smaller than diameter of pan, pressing down lightly. Add just enough broth to come up to rim of plate and bring to a boil. Reduce heat to low and cook rolls, covered with plate and a lid, 50 minutes, or until leaves are tender and most of liquid is absorbed.",
        "Remove pan from heat and cool rolls, covered. Using plate to hold back rolls, pour off remaining liquid and transfer rolls to another plate, discarding stems, trimmings, and grape leaves. Stuffed grape leaves may be made 5 days ahead and chilled, covered.",
        "Halve stuffed grape leaves diagonally and serve at room temperature or chilled."
    ],
    "ingredients": [
        "a 1-pound jar brine-packed grape leaves*",
        "1/2 cup pine nuts",
        "6 ounces thinly sliced prosciutto",
        "1/2 cup golden raisins",
        "1/4 cup packed fresh dill leaves",
        "1/4 cup packed fresh flat-leafed parsley leaves",
        "2 cups water",
        "1/2 teaspoon salt",
        "1 cup long-grain rice",
        "4 tablespoons olive oil",
        "1/3 cup dried currants",
        "6 tablespoons fresh lemon juice",
        "about 2 1/2 cups chicken broth",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Pork",
        "Rice",
        "Appetizer",
        "Cocktail Party",
        "Picnic",
        "Currant",
        "Dried Fruit",
        "Raisin",
        "Fall",
        "Chill",
        "Prosciutto",
        "Gourmet",
        "Kidney Friendly",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grape Leaves Stuffed with Prosciutto, Dried Fruit, and Herbed Rice",
    "url": "http://www.epicurious.com/recipes/food/views/grape-leaves-stuffed-with-prosciutto-dried-fruit-and-herbed-rice-100729"
}
