{
    "directions": [
        "In the bowl of an electric mixer fitted with a paddle attachment proof the yeast with the granulated sugar in the water for 5 minutes, or until the mixture is foamy, add the flour, the salt, 1/3 cup of the brown sugar, the cinnamon, and the butter, and combine the dough well. With the dough hook knead the dough for 2 minutes, or until it is soft and slightly sticky. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours, or until it is double in bulk. The dough may be made up to this point, punched down, and kept, covered and chilled, overnight. Let the dough return to room temperature before proceeding with the recipe. Press the dough evenly into an oiled jelly-roll pan, 15 1/2 by 10 1/2 by 1 inches, and let it rise, covered loosely, in a warm place for 1 hour, or until it is almost double in bulk.",
        "In a bowl stir together the grapes, the walnuts, and the Marsala and sprinkle the mixture evenly over the dough. Sprinkle the focaccia with the remaining 1/3 cup brown sugar and bake it in the bottom third of a preheated 400°F. oven for 30 to 35 minutes, or until it is cooked through and topping is caramelized. Let the focaccia cool in the pan on a rack and serve it warm or at room temperature."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon granulated sugar",
        "1 cup lukewarm water",
        "3 1/2 cups unbleached all-purpose flour",
        "1 teaspoon salt",
        "2/3 cup firmly packed light brown sugar",
        "1/4 teaspoon cinnamon",
        "3/4 stick (6 tablespoon) cold unsalted butter, cut into bits",
        "1 1/4 pounds seedless grapes (preferably red), halved lengthwise  (about 3 cups)",
        "3/4 cup finely chopped walnuts",
        "2 tablespoons Marsala"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Wine",
        "Fruit",
        "Nut",
        "Bake",
        "Walnut",
        "Winter",
        "Grape",
        "Gourmet"
    ],
    "title": "Grape and Walnut Sweet Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/grape-and-walnut-sweet-focaccia-13550"
}
