{
    "directions": [
        "Heat oven to 375°F with rack in middle.",
        "Meanwhile, stir together bread crumbs and milk in a large bowl and set aside.",
        "Cook onion, carrot, celery, and garlic in oil with 1 teaspoon salt in a heavy 12-inch skillet over medium heat, covered, stirring occasionally, until tender, 8 to 10 minutes. Remove from heat and cool.",
        "Combine beef, pork, ketchup, eggs, Worcestershire sauce, smoked paprika, pepper, 1 teaspoon salt, and cooked vegetables with bread crumbs and mix with your hands until vegetables are well distributed and mixture is cohesive.",
        "Form mixture into a 12-inch loaf, about 4 1/2 inches wide, in pan, and lay bacon slices crosswise over it.",
        "Roast in oven until an instant-read thermometer inserted into the center registers 160°F, 40 to 45 minutes.",
        "If the bacon on top isn't crisp, reset oven to broil and broil the meatloaf, 4 to 5 inches from the heat, until bacon is crisp and browned, 2 to 3 minutes.",
        "Let meatloaf rest in pan 10 minutes before transferring to a platter."
    ],
    "ingredients": [
        "1 cup fresh bread crumbs (ground in food processor from 2 slices of bread)",
        "1/2 cup milk",
        "1 medium onion, finely chopped",
        "2 medium carrots, finely chopped",
        "1 large celery rib, finely chopped",
        "4 large garlic cloves, finely chopped",
        "2 tablespoons olive oil",
        "Salt",
        "1 1/2 pounds ground grass-fed beef (preferably ground once; see Cooks' Notes)",
        "1/2 pound ground pork (preferably shoulder, not lean; and ground once; see Cooks' Notes)",
        "1/2 cup ketchup",
        "2 large eggs, lightly beaten",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons smoked paprika (optional; see Cooks' Notes)",
        "1/2 teaspoon freshly ground black pepper",
        "6 bacon slices, halved crosswise",
        "Special equipment: A large, heavy rimmed sheet pan or flameproof roasting pan (not glass); instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Roast",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Lunch",
        "Meat",
        "Ground Beef",
        "Bacon",
        "Fall",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Breadcrumbs",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grass-Fed Beef Meatloaf in a Bacon Blanket",
    "url": "http://www.epicurious.com/recipes/food/views/grass-fed-beef-meatloaf-in-a-bacon-blanket-368549"
}
