{
    "directions": [
        "Preheat oven to 350°F with a rack in upper third of oven.",
        "Peel potatoes and thinly cut into 1/8 inch thick slices, using slicer if desired.",
        "Discard dark green part of leek and halve white and light green part lengthwise. Rinse layers under running water to remove any dirt and grit and pat dry. Thinly slice crosswise.",
        "Stir together white pepper and nutmeg with 1 3/4 teaspoons salt in a small bowl. Melt butter in a small heavy saucepan over medium-low heat and cook leek and garlic, stirring frequently, until softened, 3 to 5 minutes.",
        "Spread leek and butter mixture evenly in bottom of baking dish. Arrange one quarter of potatoes in a slightly overlapping layer over leeks, then pour 1/2 cup milk over potatoes, and sprinkle lightly with 1/2 teaspoon salt mixture. Layer potatoes with milk and salt mixture three more times in same manner.",
        "Place dish on a shallow baking pan and cover with foil. Bake until potatoes are almost tender, about 1 hour.",
        "Remove foil and pour cream over potatoes. Continue to bake, uncovered, until cream has been absorbed by potatoes and top is golden in spots, 30 to 40 minutes."
    ],
    "ingredients": [
        "3 pounds Yukon gold potatoes (about 6 large)",
        "1 medium leek",
        "3/4 teaspoon freshly ground white pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "2 tablespoons unsalted butter",
        "1 large garlic clove, minced",
        "2 cups whole milk",
        "1/2 cup heavy cream",
        "Special equipment: an adjustable blade slicer (optional); a 2 1/2- to 3-quart shallow baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Potato",
        "Side",
        "Bake",
        "Easter",
        "Vegetarian",
        "Kid-Friendly",
        "Leek",
        "Root Vegetable",
        "Family Reunion",
        "Christmas Eve",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Gratin Dauphinoise (Scalloped Potatoes)",
    "url": "http://www.epicurious.com/recipes/food/views/gratin-dauphinoise-scalloped-potatoes-395310"
}
