{
    "directions": [
        "Cut off and discard the stem of the squash, then cut the squash into two pieces by cutting through it horizontally at the bottom of the neck. This will make it easier to peel.",
        "Peel the cylindrical neck lengthwise, removing enough skin so that the orange flesh underneath is revealed. (Under the outer skin there is a layer of green, which should be removed.) Peel the round part of the squash by cutting around it in a spiral fashion with a sharp knife; it is easier to peel a round object in this manner.",
        "Cut the rounded part in half lengthwise, and, using a spoon, scoop out the seeds. Then cut the squash into 1/8-to-1/4-inch slices, either with a knife or in a food processor fitted with the slicing blade.",
        "Preheat the oven to 400 degrees. Place the squash slices in a large saucepan, cover them with water, and bring to a boil. Boil over high heat for 1 1/2 to 2 minutes, then drain in a colander. The pieces will break a little in cooking. Arrange pieces in a gratin dish, and sprinkle with the salt and pepper. Pour on the cream, and stir gently with a fork to distribute the additions properly. Cover with the cheese, and bake for about 30 minutes.",
        "At serving time, brown the top of the gratin by heating it under a hot broiler for 4 to 5 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 large butternut squash (3 1/4 pounds), peeled and seeded (2 1/2 pounds)",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 1/2 cups heavy cream",
        "3 tablespoons grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Side",
        "Bake",
        "Thanksgiving",
        "Casserole/Gratin",
        "Parmesan",
        "Butternut Squash",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Gratin of Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/gratin-of-butternut-squash-105643"
}
