{
    "directions": [
        "Wipe salmon with a damp cloth. Leave skin on, but carefully remove bone so that big fillets remain. Be careful not to break fish. Mix together salt, sugar, white pepper and allspice. Rub seasonings carefully into all surfaces of the fish. Sprinkle fish with cognac. Wash dill and shake dry. Place one third of the dill in the bottom of a large deep pan or bowl (not aluminum). Place one piece of salmon, skin side down, on dill. Cover salmon with another third of the dill. Top with second piece of salmon, skin side up and cover with remaining dill. Set heavy plate or board on salmon, or a plate, weighted down. Refrigerate salmon for at least 24, preferably 36 or 48, hours.",
        "Drain fish and scrape off dill and spices. Slice on a slant, wafer thin, away from the skin. Serve with lemon wedges, mustard sauce and freshly ground black pepper. Gravad lax will keep under refrigeration for about 8-10 days only.",
        "Variation: In the Scandinavian manner, after draining and scraping fish, remove skin from fish carefully. Cut skin into strips and fry in hot butter until crisp. Add a strip of skin to each serving.",
        "Combine ingredients and blend thoroughly. Chill sauce for several hours. At serving time, beat smooth with fork or wire whisk — do not use rotary beater. Makes about 1 cup sauce."
    ],
    "ingredients": [
        "7-8 pounds middle cut of fresh salmon in one piece, with bones",
        "2/3 cup salt",
        "1/2 cup sugar",
        "1 tablespoon whole white pepper, coarsely crushed",
        "1 teaspoon whole allspice, coarsely crushed",
        "6 tablespoons cognac",
        "2 large bunches fresh dill weed",
        "9 tablespoons light olive oil",
        "3 tablespoons white vinegar",
        "2-3 tablespoons prepared sharp mustard",
        "3/4 teaspoon salt",
        "1/4 teaspoon freshly ground pepper",
        "1/4 cup sugar",
        "1/8 teaspoon cardamom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Appetizer",
        "Salmon",
        "Cognac/Armagnac",
        "Winter",
        "Dill",
        "House & Garden"
    ],
    "title": "Gravad Lax with Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/gravad-lax-with-mustard-sauce-20111"
}
