{
    "directions": [
        "Great gravy begins with this Make-Ahead Turkey Stock. If you want to make one from scratch, do it now (or anytime, for that matter, since turkey wings are available year-round). In a pinch, store-bought stock will work.",
        "Preheat oven to 450°F. Arrange 3 1/2 pounds turkey wings and 1 turkey neck (optional) on a rimmed baking sheet and roast, turning turkey halfway through, until golden brown, about 45 minutes.",
        "Transfer wings and neck to a stockpot. Pour off fat from baking sheet; discard. Pour 2 cups water onto baking sheet. Scrape up any browned bits with a wooden spoon. Pour liquid from sheet into pot with turkey. Add 1 chopped large onion, 1 peeled and chopped large carrot, 1 chopped celery stalk, 4 sprigs parsley, 4 sprigs thyme, 12 whole peppercorns, 1 bay leaf, and 10 cups water. Bring to a simmer; reduce heat to low and simmer gently until stock is reduced by at least one-third, about 4 hours.",
        "Strain stock through a fine-mesh sieve into a clean saucepan. If you have more than 6 cups stock, simmer uncovered over medium heat until reduced to 6 cups. Let cool. Pour stock into an airtight container; cover and chill. DO AHEAD: Stock can be made 3 days ahead. Keep chilled. Stock can also be frozen for up to 3 months.",
        "Roux is simply butter or oil cooked with flour. It's used for thickening sauces, and it's what makes this gravy silky-smooth.",
        "Melt 1/3 cup unsalted butter in a small skillet over medium heat. Whisk in 1/3 cup all-purpose flour. Reduce heat to low; whisk until roux is golden brown, about 2 minutes. DO AHEAD: Roux can be made 2 days ahead. Let cool, cover, and chill.",
        "Browned bits left in the bottom of the pan after roasting the turkey give body, richness, and roasty flavor to the gravy.",
        "Bring 6 cups Make-Ahead Turkey Stock to a boil in a large saucepan over medium heat. Add 1-2 cups skimmed and strained roast turkey drippings. (If you're short on drippings, skim fat from pan and add 1-2 cups water. Scrape up browned bits with a wooden spoon; strain liquid into stock.) Season to taste with kosher salt and freshly ground black pepper. Whisk in roux. Reduce heat to low; simmer gently for 5 minutes for gravy to thicken and flavors to meld. You're done!"
    ],
    "ingredients": [
        "3 1/2 pounds turkey wings",
        "1 turkey neck (optional)",
        "1 chopped large onion",
        "1 peeled and chopped large carrot",
        "1 chopped celery stalk",
        "4 sprigs parsley",
        "4 sprigs thyme",
        "12 whole peppercorns",
        "1 bay leaf",
        "1/3 cup unsalted butter",
        "1/3 cup all-purpose flour",
        "6 cups Make-Ahead Turkey Stock",
        "1-2 cups skimmed and strained roast turkey drippings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Onion",
        "turkey",
        "Side",
        "Thanksgiving",
        "Celery",
        "Carrot",
        "Thyme",
        "Parsley",
        "Simmer",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/gravy-51122830"
}
