{
    "directions": [
        "1. Wash leek roots well and trim, leaving 1/4 inch of roots on the bottom of the bulbs. Cut a 3-inch-long X through the green of each leek. Place the leeks in a bowl and cover with water. Add the vinegar and let soak for 30 minutes to remove any sand. Drain and rinse under cold running water. Set aside.",
        "2. While the leeks are soaking, prepare the seasoned broth: Combine the broth, oil, cilantro sprigs, garlic, cinnamon sticks, cumin, curry powder, saffron, and salt in a very large heavy pot. Bring to a boil, reduce the heat and simmer, uncovered, for 30 minutes.",
        "3. Using a potato peeler, peel each zucchini lengthwise at intervals to make 3 or 4 stripes in the skin. Cut the zucchini into 1 1/2-inch lengths. Set aside.",
        "4. Place the reserved leeks, the carrots, potatoes, turnips, and onions in the broth. Bring to a boil, reduce the heat and simmer, uncovered, for 30 minutes.",
        "5. Add the reserved zucchini, tomatoes, chickpeas, prunes, and raisins. Stir gently so that the vegetables don't break up. Simmer 30 minutes longer.",
        "6. Just before serving, remove the leeks carefully and trim off the roots close to the bottom of each white bulb. Gently heat the vegetables and broth through. Stir in 3 tablespoons chopped cilantro.",
        "7. Spoon cooked couscous into each bowl, if desired. Top with the vegetables and broth. Garnish with the remaining tablespoon chopped cilantro."
    ],
    "ingredients": [
        "6 medium-sized leeks (4 inches of green left on)",
        "1 tablespoon white vinegar",
        "3 quarts defatted chicken broth or vegetable broth",
        "2 tablespoons olive oil",
        "6 large fresh cilantro sprigs, rinsed, with roots and stems crushed",
        "8 cloves of garlic, lightly bruised and peeled",
        "3 cinnamon sticks (each 3 inches long)",
        "2 teaspoons ground cumin",
        "2 teaspoons curry powder",
        "1/4 teaspoon crumbled saffron threads",
        "1 teaspoon coarse salt",
        "2 medium-sized zucchini, ends trimmed",
        "6 medium-sized carrots, peeled, halved lengthwise and cut into 2-inch lengths",
        "3 Idaho potatoes, peeled and cut into quarters",
        "8 ounces small white turnips, peeled and quartered",
        "3 small yellow onions, peeled and halved",
        "3 ripe large tomatoes, cored and quartered",
        "1 cup chickpeas, rinsed",
        "1 cup pitted prunes, halved",
        "1/2 cup golden raisins",
        "4 tablespoons chopped cilantro or parsley",
        "8 cups cooked couscous (2 2/3 cups dried), hot (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Tomato",
        "Vegetable",
        "Side",
        "Vinegar",
        "Prune",
        "Raisin",
        "Curry",
        "Leek",
        "Chickpea",
        "Winter",
        "Couscous",
        "Parade"
    ],
    "title": "Great One Pot Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/great-one-pot-vegetables-106698"
}
