{
    "directions": [
        "In a medium bowl, stir together the flour and 1/4 teaspoon of salt. Cut in butter with a fork or pastry blender until the mixture resembles bread crumbs. Stir in cold water with a fork until the mixture is able to come together in a ball. Knead a couple of times then divide pastry into two pieces. Pastry may be refrigerated for later use at this time.",
        "Preheat the oven to 400 degrees F (200 degrees C). On a lightly floured surface, roll out each half of the pastry into a 10-inch circle.",
        "Place half of the potato slices in a line down the center of each circle, leaving  at least 1 inch at each end uncovered. Arrange onion slices over the potatoes, and season with salt, pepper and some of the dried parsley. Place half of the beef cubes over each onion layer, then season again with salt, pepper and dried parsley. Fold the edges over the pastry over the filling, and tuck in the ends.",
        "Transfer the two pastries to a greased baking sheet, and cut a few slits in the top of each one for ventilation.",
        "Bake for 45 minutes in the preheated oven. Remove from the oven, and reduce heat to 350 degrees F (175 degrees C). Spoon 1 teaspoon of water into each slit on the tops of the pasties. Return to the oven, and bake for an additional 15 minutes, or until golden brown. Serve whole, or cut into halves."
    ],
    "ingredients": [
        "PASTRY:",
        "1 1/2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup shortening",
        "1/4 cup cold water",
        "FILLING:",
        "3/4 pound boneless beef sirloin, cubed",
        "1 medium onion, sliced",
        "2 medium potatoes, peeled and thinly sliced",
        "1 teaspoon dried parsley",
        "salt and ground black pepper to taste",
        "1/4 cup water, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Great Grandma Johns' Pasties",
    "url": "http://allrecipes.com/recipe/66326/great-grandma-johns-pasties/"
}
