{
    "directions": [
        "Remove the dough ball from the refrigerator and leave wrapped at room temperature until the dough warms to 60°F to 65°F. Meanwhile, set up the oven with two pizza stones or baking steels and preheat to 500°F for 1 hour.",
        "Cut off the ends of the zucchini and yellow squash and discard. Trim away one long side (it won't be used) of the zucchini and cut the remaining zucchini lengthwise on a mandoline or by hand into thin, even slices 1/8 inch thick, discarding the other long side. You will need a total of 6 slices.",
        "Cut the yellow squash crosswise on a slight diagonal into slices 1/8 inch thick, discarding the end slice. You will need a total of 12 slices.",
        "To cook the squash slices on a panini press, heat the press according to the manufacturer's instructions. Brush both sides of the zucchini and yellow squash slices with olive oil and season lightly with salt and pepper.",
        "Arrange on the press, close the lid, and cook for 30 seconds. Lift the lid and check to see if the slices are etched with grill marks and tender.",
        "If not, continue to cook as needed. Transfer the slices to a flat plate and season with additional salt and pepper.",
        "To cook the squash slices in the oven, coat a half sheet pan with a generous film of olive oil. Arrange the zucchini and yellow squash slices in a single layer, turning to coat both sides with oil, and season with salt and pepper. Set the pan on the top stone and cook for 4 to 5 minutes.",
        "The slices will cook and sizzle in the oil but should not brown (this would toughen the edges). Transfer the slices to a flat plate and season with additional salt and pepper.",
        "Dust the work surface with the dusting mixture, then move the dough to the surface and dust the top.",
        "Sprinkle a wooden peel with the dusting mixture. Open the dough on the work surface to a 13-inch round with a slightly raised edge. Move the dough to the peel. As you work, shake the peel forward and backward to ensure the dough isn't sticking.",
        "Mound the mozzarella in the center of the dough and use your fingertips to spread it evenly over the surface, leaving a 3/4-inch border.",
        "Slide the dough onto the top stone. Bake for 7 minutes.",
        "Remove the pizza from the oven and place on a cutting board (or work directly on the peel if there is room to set it on the work surface). Place the zucchini slices on the pizza, arranging them like the spokes of a wheel.",
        "Then put the yellow squash slices between the zucchini slices, placing 2 slices in each section.",
        "Lift the pizza with the peel (if on a cutting board) rotate it 180 degrees and then transfer. Bake for 6 minutes, until the bottom is browned and crisp and the top is golden brown.",
        "Transfer the pizza to a cutting board and cut into 6 wedges. Crumble the Feta over the pizza, then scatter the olives and Peppadew peppers evenly over the top. Finish with a dusting of pecorino and oregano and with a drizzle of garlic oil over the surface and the crust.",
        "Just before serving, squeeze the lemon over the top."
    ],
    "ingredients": [
        "1 (13-ounce/370-gram) ball Master Dough , preferably with starter, made with Poolish",
        "1 part flour mixed with 1 part semolina, for dusting",
        "1 to 2 medium (about 6 ounces/170 grams each) zucchini",
        "1 to 2 medium (about 6 ounces/ 170 grams each) straight-neck yellow squash",
        "Olive oil, for brushing",
        "Fine sea salt and freshly ground black pepper",
        "7 ounces (200 grams) part-skim mozzarella cheese, shredded (1-3/4 cups)",
        "1-ounce (30-gram) piece Feta cheese, preferably water-packed Greek",
        "6 pitted Kalamata olives, quartered lengthwise",
        "1 large (18 grams) Peppadew pepper, cut into strips",
        "Grated Pecorino Romano cheese, for dusting",
        "Dried oregano, for dusting",
        "Garlic Oil , for drizzling",
        "1/2 lemon, grilled (see headnote)",
        "2 pizza baking stones or steels, pizza peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly"
    ],
    "title": "Greco",
    "url": "http://www.epicurious.com/recipes/food/views/greco-51255850"
}
