{
    "directions": [
        "Halve the potatoes, unpeeled, and cut them into 1-inch wedges. In a large roasting pan heat 1/3 cup of the oil in the middle of a preheated 425°F. oven for 5 minutes, add the potatoes, tossing them to coat them with the oil, and roast them, stirring them every 10 minutes, for 30 minutes, or until they are tender. Let the potatoes cool in the pan. In a blender purée the garlic, the vinegar, the rosemary leaves, and salt to taste, with the motor running add the remaining 1/3 cup oil in a stream, and blend the dressing until it is emulsified. In a small bowl of ice and cold water let the onion soak for 5 minutes, drain it well, and pat it dry. In a kettle of boiling salted water boil the green beans for 5 minutes, or until they are crisp-tender, and drain them in a colander. Refresh the beans under cold water and pat them dry. In a very large bowl combine the potatoes, the onion, the green beans, and the olives, add the dressing, and toss the salad gently. Serve the salad, garnished with the rosemary sprigs, at room temperature."
    ],
    "ingredients": [
        "3 pounds red boiling potatoes",
        "2/3 cup olive oil",
        "1 garlic clove",
        "1/4 cup red-wine vinegar",
        "1 tablespoon fresh rosemary leaves or 1 teaspoon crumbled dried, plus rosemary sprigs for garnish",
        "1 red onion, halved lengthwise and sliced thin lengthwise",
        "2 pounds green beans, trimmed and cut into 1-inch pieces",
        "24 Kalamata or Niçoise olives, pitted and halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Olive",
        "Onion",
        "Potato",
        "Side",
        "Roast",
        "Vegetarian",
        "Rosemary",
        "Green Bean",
        "Summer",
        "Vegan",
        "Boil",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Bean, Red Onion, and Roast Potato Salad with Rosemary Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-red-onion-and-roast-potato-salad-with-rosemary-vinaigrette-12123"
}
