{
    "directions": [
        "Preheat oven to 425°F.",
        "Cook beans in 2 batches in a 4-quart saucepan of boiling salted water until just tender, 3 to 4 minutes, transferring with a slotted spoon to a bowl of ice and cold water to stop cooking. When cool, drain beans and pat dry.",
        "Toss squash with oil, salt, and pepper in a large bowl, then roast in a large shallow baking pan (1 inch deep) in middle of oven, turning occasionally, until golden brown and tender, about 40 minutes.",
        "While squash is roasting, melt 1 stick butter with vinegar and soy sauce over moderately low heat, whisking until emulsified, about 4 minutes. Season with salt and pepper.",
        "Reduce oven temperature to 350°F.",
        "Push roasted squash to 1 side of roasting pan and add beans to other side. Drizzle beans with tablespoon melted butter and heat in middle of oven, uncovered, stirring occasionally, about 20 minutes.",
        "Transfer roasted vegetables to a dish. Just before serving, drizzle with Sherry soy butter and gently toss."
    ],
    "ingredients": [
        "2 lb green beans (preferably haricots verts), trimmed",
        "4 lb butternut squash, halved lengthwise, seeded, and diagonally cut crosswise into 1 1/2-inch-thick triangular pieces",
        "3 tablespoons olive oil",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 stick (1/2 cup) plus 1 tablespoon unsalted butter, stick cut into tablespoon pieces and other tablespoon melted",
        "1 1/2 tablespoons Sherry vinegar",
        "1 1/2 tablespoons soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Vinegar",
        "Green Bean",
        "Butternut Squash",
        "Fall",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Beans and Roasted Squash with Sherry Soy Butter",
    "url": "http://www.epicurious.com/recipes/food/views/green-beans-and-roasted-squash-with-sherry-soy-butter-107363"
}
