{
    "directions": [
        "Blend ranch dressing, cucumber, 1 tablespoon milk, horseradish, vinegar, wasabi powder, 1/8 teaspoon salt, and cayenne pepper together in a food processor until dip is smooth. Transfer dip to a bowl, cover, and refrigerate until chilled, at least 30 minutes.",
        "Bring water and chicken broth to a boil; add green beans and cook until slightly tender, about 10 minutes. Drain.",
        "Whisk egg and 1 tablespoon milk together in a bowl. Combine bread crumbs, French-fried onions, 3/4 teaspoon salt, onion powder, black pepper, and garlic powder together in a separate bowl. Place flour in a third bowl.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Press green beans in flour until evenly coated. Dip coated green beans in egg-milk mixture, allowing excess liquid to drip back into bowl. Transfer green beans to bread crumbs mixture and press to coat, shaking off excess. Arrange coated beans in 1 layer on a plate or in a colander.",
        "Working in batches, fry coated green beans in the hot oil until crisp, about 1 minute 30 seconds. Transfer green bean fries to a paper towel-lined colander using a slotted spoon. Serve green bean fries with dip."
    ],
    "ingredients": [
        "Cucumber Wasabi Dip:",
        "1/2 cup ranch dressing",
        "1/4 cup peeled, seeded, and minced cucumber",
        "1 tablespoon whole milk",
        "1 1/2 teaspoons prepared horseradish",
        "1 teaspoon white vinegar",
        "1 teaspoon Japanese wasabi powder",
        "1/8 teaspoon salt",
        "1 pinch cayenne pepper, or more to taste",
        "Green Bean Fries:",
        "2 cups water",
        "2 cups chicken broth",
        "8 ounces fresh green beans, trimmed",
        "1 egg, beaten",
        "1 tablespoon whole milk, or more as needed",
        "1/2 cup plain bread crumbs",
        "1/2 cup crushed French-fried onions",
        "3/4 teaspoon salt",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon garlic powder",
        "1 cup all-purpose flour",
        "8 cups vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Green Bean Fries with Cucumber Wasabi Dip",
    "url": "http://allrecipes.com/recipe/242212/green-bean-fries-with-cucumber-wasabi/"
}
