{
    "directions": [
        "Preheat oven to 325°F. Toast caraway seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 1 minute. Let cool; finely grind in spice mill or with mortar and pestle.",
        "Remove ribs and stems from 1 bunch chard; discard. Blanch leaves in a large pot of boiling salted water 10 seconds. Immediately transfer to a bowl of ice water; let cool. Drain and squeeze out excess water. Coarsely chop; transfer to a blender. Add chiles, cilantro, cumin, caraway, 1/4 cup oil, and 1 cup ice. Purée, adding more ice if needed, until smooth; season with salt.",
        "Trim tough stems from remaining chard; separate leaves from ribs. Tear leaves into large pieces; chop ribs into bite-size pieces. Heat remaining 2 Tbsp. oil in a large skillet over medium. Cook onion, stirring often, until starting to soften, about 5 minutes. Add chard stems, season with salt and pepper, and cook, stirring occasionally, until crisp-tender and onion is soft, 5–8 minutes. Working in batches, add chard leaves, letting wilt slightly before adding more; cook, tossing often, until all leaves are wilted, about 2 minutes. Pour in purée and use a spoon to create 8 small wells; crack an egg into each well. Sprinkle lightly with salt and harissa powder. Bake until eggs are just set, 20–25 minutes. Top with dill."
    ],
    "ingredients": [
        "1/2 teaspoon caraway seeds",
        "3 medium bunches green Swiss chard, divided",
        "Kosher salt",
        "2 serrano chiles, seeds removed, chopped",
        "1/2 cup cilantro leaves",
        "1 teaspoon ground cumin",
        "1/4 cup plus 2 tablespoons olive oil",
        "1 large onion, sliced",
        "Freshly ground black pepper",
        "8 large eggs",
        "Harissa powder or Aleppo-style pepper and coarsely chopped dill (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chard",
        "Egg",
        "Brunch",
        "Dinner",
        "Hot Pepper",
        "Cilantro",
        "Cumin",
        "Caraway",
        "Quick and Healthy"
    ],
    "title": "Green Shakshuka",
    "url": "http://www.epicurious.com/recipes/food/views/green-shakshuka"
}
