{
    "directions": [
        "Fill large bowl with ice and cold water. Cook beans in large pot of generously salted boiling water just until crisp-tender, 5 to 6 minutes. Drain. Place beans in bowl of ice water until cool. Drain well, then pat dry with kitchen towels. DO AHEAD: Can be made 1 day ahead. Wrap beans in several layers of paper towels; enclose in large resealable plastic bag and chill. Bring to room temperature before using.",
        "Combine 2 cups water, cider vinegar, and next 6 ingredients in large saucepan. Bring to boil, stirring until sugar dissolves. Add onions; bring to boil. Reduce heat and simmer until onions are wilted, about 4 minutes. Remove from heat. Cool uncovered to room temperature. DO AHEAD: Can be made 1 day ahead. Cover and chill onion mixture. Before using, drain liquid; discard thyme, cloves, and bay leaf and bring to room temperature.",
        "Whisk oil, syrup, and chopped thyme in large bowl. Season with salt and pepper. Add green beans and drained onions; toss to coat. Transfer salad to platter and serve."
    ],
    "ingredients": [
        "2 pounds green beans, trimmed",
        "3/4 cup apple cider vinegar",
        "3/4 cup red wine vinegar",
        "1/4 cup (packed) golden brown sugar",
        "5 fresh thyme sprigs",
        "4 whole cloves",
        "1 small bay leaf",
        "1 teaspoon salt",
        "2 large onions, thinly sliced",
        "3 tablespoons olive oil",
        "1/4 cup pure maple syrup",
        "1 teaspoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Vinegar",
        "Green Bean",
        "Family Reunion",
        "Healthy",
        "Low Cholesterol",
        "Potluck",
        "Maple Syrup",
        "Boil",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Green Beans with Pickled-Onion Relish",
    "url": "http://www.epicurious.com/recipes/food/views/green-beans-with-pickled-onion-relish-350474"
}
