{
    "directions": [
        "Preheat an oven to 375°F. Butter a 6-cup soufflé dish or gratin dish and dust with a few tablespoons of the Parmigiano-Reggiano.",
        "In a small saucepan, combine the garlic, cream and thyme. Cover and cook over low heat for 15 minutes. Set aside.",
        "Place the spinach in a fry pan over medium-high heat, with water clinging to the leaves. Stir until wilted, 1 minute. Transfer the spinach to a colander and press out the moisture with the back of a large spoon. Chop finely.",
        "In a saucepan over medium heat, melt the butter. Stir in the flour and cook, stirring, for 1 minute. Whisk in the milk and continue whisking until thickened, 1 to 2 minutes. Add the 1 tsp. salt. Stir in the goat cheese and the remaining Parmigiano-Reggiano. Stir in the egg yolks, spinach and garlic mixture. Season with white pepper. Taste and adjust seasonings.",
        "In a large bowl, beat the egg whites with a pinch of salt until soft peaks form. Pour the soufflé base on top and fold together until just blended. Scrape the mixture into the prepared dish, filling it no more than seven-eighths full. Bake until the soufflé is golden brown and set, 30 minutes for a soufflé dish, 25 minutes for a gratin dish. Serve immediately. Serves 4.",
        "Adapted from",
        "Williams-Sonoma TASTE",
        "(February 2001), \"A Good Egg,\" by Deborah Madison"
    ],
    "ingredients": [
        "1/2 cup freshly grated Parmigiano-Reggiano  &nbsp cheese",
        "3/4 to 1 cup finely chopped green garlic (about  &nbsp 5 heads)",
        "1/2 cup heavy cream or half-and-half",
        "1 thyme sprig",
        "3/4 pound spinach, stemmed and rinsed",
        "4 Tbs. (1/2 stick) unsalted butter",
        "1/4 cup all-purpose flour",
        "1 cup milk",
        "1 tsp. salt, plus more, to taste",
        "3/4 cup crumbled fresh goat cheese (chèvre)",
        "4 egg yolks",
        "Freshly ground white pepper, to taste",
        "5 egg whites"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Green Garlic and Spinach Souffle",
    "url": "http://www.williams-sonoma.com/recipe/green-garlic-and-spinach-souffle.html"
}
