{
    "directions": [
        "Cook haricots verts in a large pot of boiling salted water (3 tablespoons salt for 6 quarts water), uncovered, until just tender, 4 to 5 minutes. Drain, then transfer to an ice bath to stop cooking. Drain and pat dry.",
        "Force hard-boiled eggs through a medium-mesh sieve into a bowl using a rubber spatula. Stir in mayonnaise, zest, lemon juice, scallions, 1/2 teaspoon pepper, and 1/4 teaspoon salt (or to taste).",
        "Place a sushi mat with slats running crosswise or a 9-inch square of parchment paper on a work surface. Arrange 3 slices prosciutto perpendicular to slats and slightly overlapping to form a 9- by 7-inch rectangle.",
        "Spread about 1 tablespoon egg mixture evenly across bottom half of prosciutto rectangle. Arrange beans on egg side by side and end to end, overlapping ends, in 8 tight rows parallel to slats. Spread another tablespoon egg mixture over beans.",
        "Roll up prosciutto and beans tightly with aid of mat. Transfer roll, seam side down, to a cutting board, then trim ends and cut crosswise into about 10 (3/4-inch) pieces. Make and cut 4 more rolls. Turn pieces upright to serve."
    ],
    "ingredients": [
        "1/2 pound haricots verts, trimmed",
        "3 hard-boiled large eggs, quartered",
        "2 tablespoons mayonnaise",
        "1/2 teaspoon grated lemon zest",
        "1/2 tablespoon fresh lemon juice, or to taste",
        "1/3 cup minced scallions (2 to 3)",
        "15 thin slices prosciutto (about 7 by 3 inches; 1/2 pound)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Christmas",
        "Cocktail Party",
        "Quick & Easy",
        "New Year's Eve",
        "Mayonnaise",
        "Green Bean",
        "Prosciutto",
        "Boil",
        "Gourmet"
    ],
    "title": "Green-Bean and Prosciutto Negimaki",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-and-prosciutto-negimaki-240974"
}
