{
    "directions": [
        "The flavoring: In a 2-quart saucepan, combine the broth and chiles, bring to a boil, then partially cover and simmer gently over medium to medium-low heat for about 10 minutes, until the chiles are very soft. Pour the chile mixture into a food processor, add the cilantro (stems and all), and process to a smooth puree. Press through a medium-mesh strainer into a bowl and stir in the salt.",
        "The rice: Wipe the pan clean, add the oil and heat over medium. Add the rice and onion, and cook, stirring regularly, until the rice is chalky looking and the onion is soft, about 5 minutes. Stir in the garlic and cook a minute longer.",
        "Add the warm (or reheated) chile liquid to the hot rice pan, stir once, scrape down any rice kernels clinging to the side of the pan, cover, and cook over medium-low heat for 15 minutes. Uncover and check a grain of rice: It should be nearly cooked through. If the rice is just about ready, turn off the heat, re-cover and let stand for 5 to 10 minutes longer to complete the cooking. If the rice seems far from done, continue cooking for 5 minutes or so, retest, then turn off the heat and let stand a few minutes longer. Fluff with a fork, scoop into a warm serving dish, decorate with cilantro sprigs and it's ready to serve.",
        "Advance preparation: The rice can be made several days ahead; turn out the fluffed rice onto a baking sheet to cool, transfer to a storage container, then cover and refrigerate. Reheat the rice in a steamer basket set over boiling water.",
        "Variations and improvisations: An obvious variation is to use 3 or 4 long green (Anaheim) chiles, or to mix poblanos and long greens with hotter chiles like jalapeño, manzano or habanero. Grilled corn cut from 1 cob or 1 large grilled zucchini (cubed) are tasty vegetable add-ins. About 1 cup coarsely shredded roast (or barbecued) pork or smoked salmon, mixed in toward the end of cooking, will make green rice a full meal."
    ],
    "ingredients": [
        "1 2/3 cups chicken broth or water",
        "2 fresh poblano chiles, stems and seeds removed, and roughly chopped",
        "12 sprigs cilantro, plus extra for garnish",
        "Salt, about 1/2 teaspoon if using salted broth, 1 teaspoon if using unsalted or water",
        "1 tablespoon vegetable or olive oil",
        "1 cup rice, preferably medium grain",
        "1 small white onion, cut into 1/4-inch dice",
        "5 garlic cloves, peeled and finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Rice",
        "Side",
        "Vegetarian",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Poblano Rice (Arroz Verde al Poblano)",
    "url": "http://www.epicurious.com/recipes/food/views/green-poblano-rice-arroz-verde-al-poblano-15367"
}
