{
    "directions": [
        "Preheat oven to 325°F. Heat oil in large ovenproof pot (wide enough to hold lamb in single layer) over medium-high heat. Sprinkle lamb on all sides with salt and pepper. Add lamb to pot and sauté until brown, turning occasionally, about 10 minutes. Transfer lamb to plate. Add next 10 ingredients to pot. Sauté until vegetables brown, about 20 minutes. Mix in tomato paste. Add wine and all broth; boil until liquid is reduced by half, stirring occasionally, about 10 minutes. Return lamb to pot, arranging in single layer; add any accumulated juices. Bring to boil.",
        "Place lamb in oven and cook uncovered until tender, basting and turning occasionally, about 2 hours. Transfer lamb to plate. Skim any fat from top of roasting liquid. Press all liquid and enough of vegetables through sieve set over large bowl to make sauce with gravy consistency. Return gravy to pot; add lamb. Season with salt and pepper. (Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep refrigerated.) Rewarm lamb over low heat. Transfer to platter and serve."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "6 12- to 14-ounce lamb shanks",
        "2 celery stalks, chopped",
        "1 large onion, chopped",
        "1 large carrot, chopped",
        "6 large garlic cloves, chopped",
        "3 drained canned anchovies",
        "2 cinnamon sticks",
        "2 small bay leaves",
        "2 fresh thyme sprigs",
        "5 juniper berries or 2 tablespoons gin",
        "1/4 teaspoon ground nutmeg",
        "1 tablespoon tomato paste",
        "1 750-ml bottle Merlot",
        "1 14-ounce can low-salt chicken broth",
        "1 14-ounce can low-salt beef broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Vegetable",
        "Braise",
        "Low Carb",
        "Dinner",
        "Lamb Shank",
        "Red Wine",
        "Winter",
        "Cinnamon",
        "Nutmeg",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Greek-Style Braised Lamb Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/greek-style-braised-lamb-shanks-107081"
}
