{
    "directions": [
        "Preheat oven to 275 degrees F (135 degrees C). Spread almonds on a baking sheet.",
        "Toast almonds in the preheated oven until golden, stirring halfway through, about 13 minutes total. Remove from oven and set aside.",
        "Increase oven temperature to 350 degrees F (175 degrees C). Grease one 9x13-inch casserole dish.",
        "Place bacon and onion in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, 8 to 10 minutes. Remove bacon and onion with a slotted spoon; set aside. Drain excess bacon fat from the skillet; add olive oil. Add mushrooms and cook, stirring, until soft, about 5 minutes.",
        "Place 1 quart water in a saucepan and bring to a boil. Add green beans and blanch for 2 minutes. Drain in a colander and immediately immerse in ice water for several minutes to stop the cooking process and preserve the bright green color. Drain.",
        "Pour mushroom soup into a large bowl and whisk until smooth, adding up to 1/2 cup water, until soup is the consistency of thick gravy. Stir in almonds, 3/4 of the bacon-onion mixture (reserving the rest for topping), mushrooms, green beans, 1 cup French-fried onions, and water chestnuts. Mix thoroughly to combine and season with salt and black pepper.",
        "Pour green bean mixture into casserole dish. Top with remaining bacon-onion mixture and 1 cup French-fried onions.",
        "Bake in the preheated oven until bubbling and crispy on top, 30 to 45 minutes. Serve hot."
    ],
    "ingredients": [
        "1/4 cup slivered almonds",
        "1/2 pound bacon",
        "1 large onion, chopped",
        "2 tablespoons olive oil",
        "3/4 cup chopped mushrooms",
        "1 quart water",
        "1 pound fresh green beans, trimmed and cut into 2-inch pieces",
        "2 (10.75 ounce) cans condensed cream of mushroom soup (such as Campbell's®)",
        "1/2 cup water, or as needed",
        "2 cups French-fried onions (such as French's®), divided",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Green Bean Casserole with Bacon and Toasted Almonds",
    "url": "http://allrecipes.com/recipe/245405/green-bean-casserole-with-bacon-and-t/"
}
