{
    "directions": [
        "In a food processor blend together salsa butter, and salt until combined well. (Salsa butter may be made 3 days ahead and covered, chilled.)",
        "Heat a dry comal or flat iron griddle over moderately low heat until hot and pan-roast poblanos, tomatoes, and garlic, turning them occasionally to ensure even roasting, until browned and soft throughout, 25 to 30 minutes.",
        "While vegetables are roasting, if using dried morels, in a small bowl soak in hot water until soft, about 15 minutes. Remove morels from soaking liquid and halve. Strain soaking liquid through a sieve lined with paper towels into another small bowl, reserving soaking liquid. If using fresh morels, wash well, pat dry, trim, and halve.",
        "In a small heavy skillet heat oil over moderately high heat until hot but not smoking and sauté dried or fresh morels, stirring, until browned lightly, about 1 minute. If using dried morels, add reserved soaking liquid and boil until liquid is evaporated. Sauté dried or fresh morels, stirring until browned, about 3 minutes more.",
        "Wearing rubber gloves, stem and seed chiles. Discard tomato stems and garlic stems.",
        "In a food processor pulse chiles, tomatoes, garlic, morels, and epazote until chopped coarse (do not purée). In a bowl stir together chile mixture, water, and salt. (Salsa may be made 3 days ahead and chilled, covered. Bring salsa to room temperature before using.) Makes about 1 1/2 cups."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/8 teaspoon coarse salt, or to taste",
        "1/2 cup green chile mushroom salsa",
        "2 poblano chiles*",
        "2 plum tomatoes",
        "3 medium unpeeled garlic cloves",
        "1/2 ounce dried morels** or 1/4 pound fresh morels**",
        "1 tablespoon olive oil",
        "6 freshepazote leaves* chopped",
        "1/2 cup water",
        "1/8 teaspoon coarse salt, or to taste",
        "available at Mexican markets and some specialty produce markets",
        "** available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Food Processor",
        "Herb",
        "Mushroom",
        "Roast",
        "Hot Pepper"
    ],
    "title": "Green Chile Mushroom Salsa Butter",
    "url": "http://www.epicurious.com/recipes/food/views/green-chile-mushroom-salsa-butter-12675"
}
