{
    "directions": [
        "Toast fennel seeds in small skillet over medium-high heat until fragrant, shaking skillet occasionally, about 1 minute. Transfer seeds to medium bowl. Add olives, 2 tablespoons oil, garlic chives, orange juice, thyme, and orange peel to bowl and toss to blend. Season to taste with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cover; chill. Bring to room temperature before using.",
        "Prepare barbecue (medium-high heat). Brush both sides of bread slices with oil. Grill on 1 side until golden, about 1 minute. Turn bread over; immediately top each slice with 1 cheese round. Grill until bottoms are golden and cheese softens slightly, about 1 minute.",
        "Transfer crostini to platter. Spoon olive mixture over and sprinkle with pepper.",
        "Garlic chives, also known as Chinese chives, can be found at Asian markets."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds",
        "1 cup (lightly packed) chopped pitted imported brine-cured green olives",
        "2 tablespoons extra-virgin olive oil plus additional for brushing",
        "1 tablespoon thinly sliced garlic chives or 2 garlic cloves, thinly sliced",
        "1 tablespoon fresh orange juice",
        "2 teaspoons chopped fresh thyme",
        "1 1/2 teaspoons finely grated orange peel",
        "16 1/2-inch-thick diagonal slices baguette",
        "1 6-ounce log soft fresh goat cheese (cut into 16 rounds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Appetizer",
        "Cocktail Party",
        "Vegetarian",
        "Low Cal",
        "Oscars",
        "Backyard BBQ",
        "Dinner",
        "Goat Cheese",
        "Grill",
        "Grill/Barbecue",
        "Low Cholesterol",
        "Engagement Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Green Olive and Goat Cheese Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/green-olive-and-goat-cheese-crostini-242993"
}
