{
    "directions": [
        "In a medium saucepan, bring a few inches of water to a boil. Using a slotted spoon, gently lower in the eggs and cook for 9 minutes (or 8 minutes if you like the yolk a little softer). While the eggs cook, set up a bowl of ice water in the sink; transfer the just boiled eggs to the ice bath.",
        "Allow the eggs to cool in ice water, then peel them and separate the yolks from the whites. Reserve the whites for another use and push the yolks through a a sieve or a \"spider\" spatula into a medium mixing bowl. Add the mustard, vinegar, lemon juice, salt, and pepper; stir until smooth. Gradually whisk in the oil, creating a creamy, mayo-like emulsion with a bit more texture. Season and add additional lemon juice to taste.",
        "Put the lettuces and radishes in a salad bowl and spoon over most of the dressing. Season with a sprinkle of salt and freshly cracked black pepper. Gently but thoroughly toss the salad with your hands to coat the leaves well. Taste a leaf and add more dressing, lemon, salt, or pepper as needed. Serve immediately."
    ],
    "ingredients": [
        "3 large eggs",
        "2 teaspoons Dijon mustard",
        "2 teaspoons red-wine vinegar",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon kosher salt, plus more to taste",
        "Freshly ground black pepper",
        "3/4 cup extra-virgin olive oil",
        "8 cups small whole leaves of romaine, little gems, or iceberg lettuce (or, for the bitter tolerant/enthusiast, escarole, radicchio or frisée), washed and spun dry",
        "6 red radishes (or 2 peeled watermelon radishes), rinsed and thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Mustard",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Salad Dressing",
        "Radish",
        "Healthy",
        "Low Cholesterol",
        "Anniversary",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Salad with Radishes and Creamy Mustard Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/green-salad-with-radishes-and-creamy-mustard-dressing-51262910"
}
