{
    "directions": [
        "Coat bottom and sides of pan with nonstick spray. Line bottom with a parchment-paper round. Using your fingertips, mix remaining ingredients in a medium bowl until mixture holds together when pinched tightly. Pack onto bottom of pan in an even layer (using the bottom of a flat measuring cup works well). Chill until firm, at least 1 hour or up to 1 day.",
        "Place gelatin and 1 1/2 tablespoons cold water in a heatproof bowl. Let stand until softened, 5-10 minutes.",
        "Pulse cream cheese, yogurt, sugar, lemon juice, vanilla, and salt in a food processor, scraping down sides as needed, until completely smooth.",
        "Pour water to a depth of 1/2\" into a small skillet over medium heat. Place bowl with gelatin in skillet; stir until gelatin dissolves, about 2 minutes. Remove bowl from skillet.",
        "With processor running, drizzle gelatin into cream cheese mixture; mix until well blended. Pour into prepared crust. Tap pan firmly on the counter to break up any big air bubbles. Smooth top. Cover tightly with plastic wrap and chill for at least 6 hours before serving. DO AHEAD: Cheesecake can be made 2 days ahead. Keep chilled.",
        "Bring first 3 ingredients to a simmer in a medium saucepan over medium-low heat; simmer, whisking occasionally, until syrup is thickened, shiny, and measures a generous 1/2 cup, 35-40 minutes. Let cool. DO AHEAD: Pomegranate syrup can be made 5 days ahead. Cover; chill. Rewarm slightly before serving.",
        "Cut cheesecake into slices, dipping knife into a large glass of warm water and wiping dry between slices, and place on plates. Drizzle pomegranate syrup over and scatter pomegranate seeds around."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups fine graham cracker crumbs",
        "1/2 cup (1 stick) unsalted butter, melted, cooled slightly",
        "1/4 cup sugar",
        "2 teaspoons powdered gelatin",
        "1 1/2 pounds cream cheese, room temperature",
        "1 1/2 cups plain whole-milk Greek yogurt",
        "3/4 cup sugar",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon kosher salt",
        "2 cups flash-pasteurized pomegranate juice",
        "1/2 cup sugar",
        "2 tablespoons light corn syrup",
        "Pomegranate seeds",
        "Special equipment: A 9\"-diameter springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Dessert",
        "Freeze/Chill",
        "Yogurt",
        "Cream Cheese",
        "Chill",
        "Pomegranate",
        "Pomegranate Juice",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Greek Yogurt Cheesecake with Pomegranate Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/greek-yogurt-cheesecake-with-pomegranate-syrup-51123080"
}
