{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking pan; line with parchment paper.",
        "Stir 1 tablespoon water and 1 tablespoon matcha together in a small bowl to form a paste the consistency of mustard.",
        "Beat egg yolks and 2 tablespoons white sugar together in a bowl until light and creamy, 3 to 4 minutes. Add flour; beat until smooth and fluffy, about 1 minute. Stir in green tea paste.",
        "Beat egg whites in a separate bowl with electric mixer at high speed until soft peaks form, 4 to 5 minutes. Add remaining 2 tablespoons sugar; beat until mixture is stiffened and smooth, about 1 minute more.",
        "Spoon 1/3 egg white mixture onto green tea mixture using a rubber spatula. Gently run spatula around the edges of the green tea mixture lifting the bottom up and over the center, repeating just until incorporated. Add remaining egg white mixture gradually, folding just until batter is combined. Spread batter into prepared baking pan, smoothing it out to remove air bubbles.",
        "Bake in preheated oven until cake is golden brown on top, about 10 minutes.",
        "Place a large sheet of waxed paper on a work surface. Turn cake out onto waxed paper; remove baking pan lining. Cool to room temperature, 30 minutes to 1 hour.",
        "Whisk cream, superfine sugar, and 1 teaspoon matcha together in a bowl until smooth and spreadable.",
        "Select best side of cake; place that side down on the waxed paper. Spread cream mixture evenly across cake. Lift waxed paper to gently roll cake. Refrigerate until set, at least 3 hours. Cut off the ends as needed to make even."
    ],
    "ingredients": [
        "1 tablespoon water, or as needed",
        "1 tablespoon matcha green tea powder, or as needed",
        "4 eggs, whites and yolks separated",
        "1/4 cup white sugar, divided",
        "1/3 cup self-rising flour",
        "Filling:",
        "1 cup heavy whipping cream",
        "2 tablespoons superfine sugar",
        "1 teaspoon matcha green tea powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Green Tea Swiss Roll",
    "url": "http://allrecipes.com/recipe/246269/green-tea-swiss-roll/"
}
