{
    "directions": [
        "In a heatproof bowl pour enough boiling water over bulgur to cover by 1 inch. Cover bowl with a plate to trap steam and let stand 20 minutes. Drain bulgur in a large fine sieve, pressing out excess liquid, and transfer to a bowl.",
        "Keeping each variety of green separate, tear greens into bite-size pieces, discarding stems. Still keeping greens separate, wash thoroughly by dunking in a sinkful of water and transfer to a colander to drain.",
        "Put coarser greens (kale or collard) in a 4 1/2- to 5-quart kettle and steam in water clinging to leaves, covered, over moderate heat, stirring occasionally, until wilted, about 4 minutes. Add delicate greens (escarole, spinach, Swiss chard, and/or mustard) to coarse greens and steam, covered, stirring occasionally, until just wilted, 3 to 4 minutes. Drain greens in colander, pressing out excess liquid.",
        "In a large heavy skillet cook garlic in oil over moderate heat,stirring, until softened but not golden. Stir in greens and bulgur and season generously with salt and pepper. Stir in Parmesan and remove skillet from heat.",
        "Preheat oven to 400°F. and lightly oil a 1 1/2-quart gratin dish or other shallow baking dish.",
        "Spread half of greens mixture in dish and sprinkle evenly with mozzarella. Spread remaining greens mixture over mozzarella and smooth top with a rubber spatula. Gratin may be prepared up to this point 8 hours ahead and chilled, covered.",
        "In a small bowl with a fork stir together bread crumbs and oil until crumbs are evenly moistened.",
        "Sprinkle topping over greens mixture and bake in middle of oven 30 minutes, or until bubbling and top is browned lightly."
    ],
    "ingredients": [
        "1/2 cup coarse bulgur*",
        "2 pounds assorted greens such as kale, collard, escarole, spinach,Swiss chard, and/or mustard greens",
        "6 large garlic cloves, minced",
        "3 tablespoons olive oil",
        "1/4 cup freshly grated Parmesan (about 1 ounce)",
        "6 ounces chilled whole-milk or part-skim mozzarella, grated coarse",
        "1/2 cup fine fresh bread crumbs",
        "1 tablespoon olive oil",
        "*available at natural foods stores and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Side",
        "Bake",
        "High Fiber",
        "Casserole/Gratin",
        "Mozzarella",
        "Parmesan",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Greens and Bulgur Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/greens-and-bulgur-gratin-13121"
}
