{
    "directions": [
        "Sprinkle the yeast over 1/2 cup of warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam.",
        "Heat a large skillet over medium heat and add the olive oil and the onions.  Cook and stir for 3 minutes, or until onions are soft.  Remove the onions from heat and reserve.",
        "Combine the bread flour, salt, sugar, dill, garlic powder, olives, and cooked onions in a large bowl and mix well.  Add the yeast mixture and the remaining 1 3/4 cup water.  Mix well until the ingredients have pulled together and have formed a sticky dough.  Turn the dough out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.",
        "Lightly grease two baking sheets.   Deflate the risen dough and turn it out onto a lightly floured surface. Use a knife to divide the dough into two equal pieces-don't tear it. Shape into dough into round loaves, and place the loaves into the prepared pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.",
        "Preheat an oven to 450 degrees F (230 degrees C).",
        "Bake loaves in the preheated oven until the tops are golden brown and the bottoms sound hollow when tapped, about 40 minutes.  Cool slightly before slicing."
    ],
    "ingredients": [
        "2 (.25 ounce) packages rapid rise yeast",
        "1/2 cup warm water",
        "2 tablespoons extra-virgin olive oil",
        "2 large red onions, diced",
        "7 cups bread flour",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon white sugar",
        "1/4 cup chopped fresh dill",
        "1/4 teaspoon garlic powder (optional)",
        "2 cups pitted kalamata olives, chopped",
        "1 3/4 cups warm water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Olive and Onion Bread",
    "url": "http://allrecipes.com/recipe/187377/greek-olive-and-onion-bread/"
}
