{
    "directions": [
        "Wash the spinach and tender stems until the water runs clean; drain. If leaves are large and crinkly, sprinkle lightly with salt and mix well. Let stand in a colander 15 minutes; rinse and squeeze out excess moisture. Shred the spinach to make about 3 cups.",
        "Heat 3 tablespoons of the olive oil in a 10-inch straight-sided skillet. Add the scallions, onions, a pinch of salt, and 1/4 cup water and cook, covered, over medium-low heat for 10 minutes. When the water evaporates, slowly let the onions turn golden, stirring occasionally. Add 1 cup water, the reduced tomato purée, and rice. Cover and cook for 10 minutes.",
        "Spread the spinach and dill over the rice, cover, and cook 10 minutes longer. Remove from heat, mix, then place a double thickness of paper toweling over the rice, cover again, and let stand until cool. Adjust the seasoning with black pepper and salt and drizzle with the remaining tablespoon olive oil. Serve at room temperature garnished with black olives and feta cheese or yogurt."
    ],
    "ingredients": [
        "2 pounds fresh spinach, washed and tough stems removed",
        "Coarse sea salt",
        "4 tablespoons extra-virgin olive oil",
        "1/2 cup thinly sliced scallions",
        "3/4 cup finely chopped onions or leeks",
        "1/2 cup fresh tomato purée reduced by boiling to 3 tablespoons",
        "1/2 cup long-grain rice",
        "1/4 cup chopped dill",
        "Freshly ground black pepper",
        "Oily black olives for garnish",
        "Chunks of feta cheese or spoonfuls of thick yogurt for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Rice",
        "Side",
        "Vegetarian",
        "Feta",
        "Spinach",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Greek-Style Rice with Spinach, Feta, and Black Olives",
    "url": "http://www.epicurious.com/recipes/food/views/greek-style-rice-with-spinach-feta-and-black-olives-15420"
}
