{
    "directions": [
        "To make the vinaigrette, whisk together the rice wine vinegar, mustard, garlic, pinch of salt, and pepper; slowly pour in 2/3 cup olive oil, whisking constantly. Pour into a jar with a tight-fitting lid to transport it to the picnic.",
        "Adjust oven rack to highest position and turn broiler on high. Toss zucchini and bell pepper with 2 tablespoons olive oil and salt and pepper to taste, and arrange on a large baking sheet with sides. Broil until spotty brown, 8 to 10 minutes, turning zucchini slices and pepper halves once. Set aside in a large bowl to cool, then cut into bite-sized pieces.",
        "Bring 1 gallon of water and 2 tablespoons of salt to boil. Add pasta; boil using package times, until just tender. Drain thoroughly (do not rinse) and dump onto the baking sheet. Set aside to cool.",
        "Put vegetables, pasta and remaining ingredients (except dressing) in the bowl or a gallon-sized zipper bag (can be refrigerated for several hours). When ready to serve, add dressing; toss to coat."
    ],
    "ingredients": [
        "Dijon Vinaigrette",
        "1/4 cup rice wine vinegar",
        "2 tablespoons Dijon mustard",
        "1 large clove garlic, minced",
        "Big pinch of salt",
        "Black pepper, to taste",
        "2/3 cup extra-virgin olive oil",
        "Pasta Salad",
        "2 medium zucchini, thinly sliced lengthwise",
        "1 medium yellow pepper, halved lengthwise, seeded",
        "2 tablespoons olive oil",
        "Ground black pepper and salt, to taste",
        "1 gallon water",
        "2 tablespoons salt",
        "1 pound medium pasta shells",
        "1 pound cooked shrimp, halved lengthwise",
        "8 ounces cherry tomatoes, halved",
        "3/4 cup coarsely chopped, pitted Kalamata olives",
        "1 cup crumbled feta cheese",
        "1/2 small red onion, cut into small dice",
        "2 teaspoons dried oregano"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Pasta Salad with Shrimp, Tomatoes, Zucchini, Peppers, and Feta",
    "url": "http://allrecipes.com/recipe/104968/greek-pasta-salad-with-shrimp-tomato/"
}
