{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Make a small incision on sides of each chestnut, and place in a skillet over medium heat. Cook, stirring often, until toasted. Remove from heat, peel, and chop.",
        "Melt 2/3 cup butter in a saucepan, and mix in the orange juice, tangerine juice, and lemon juice. Rub the turkey inside and out with the mixture, reserving some for basting. Season turkey with salt and pepper.",
        "In a large skillet over medium heat, cook the ground beef, ground pork, and onion until beef and pork are evenly brown and onion is tender. Drain grease. Mix in the rice. Stir in the chestnuts, pine nuts, raisins, 1/3 cup butter, broth, and brandy. Season with 1 teaspoon salt and 1/2 teaspoon pepper. Continue cooking until all liquid has been absorbed. Stuff all turkey cavities with the mixture, and tie in place with kitchen twine.",
        "Place turkey on a rack in a roasting pan, and loosely cover breast and thighs with aluminum foil. Pour about 1/4 inch water into the bottom of the pan. Maintain this level of water throughout cook time. Roast turkey in the preheated oven 3 to 4 hours, brushing occasionally with remaining butter and juice mixture. Increase oven temperature to 400 degrees F (200 degrees C) during final hour of roasting, and remove foil. Cook turkey to a minimum internal temperature of 180 degrees F (82 degrees C)."
    ],
    "ingredients": [
        "1 cup chestnuts",
        "2/3 cup butter",
        "1/4 cup orange juice",
        "1/4 cup tangerine juice",
        "2/3 cup lemon juice",
        "1 (10 pound) whole turkey",
        "salt and ground black pepper to taste",
        "1/2 pound ground beef",
        "1/2 pound ground pork",
        "1/4 cup chopped onion",
        "1/2 cup uncooked instant rice",
        "1/4 cup pine nuts",
        "1/4 cup raisins (optional)",
        "1/3 cup butter",
        "1/2 cup chicken broth",
        "2 tablespoons brandy",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Traditional Turkey with Chestnut and Pine Nut Stuffing",
    "url": "http://allrecipes.com/recipe/78393/greek-traditional-turkey-with-chestnu/"
}
