{
    "directions": [
        "Combine soy sauce, orange juice, maple syrup, and sesame oil in a large resealable plastic bag. Add pork and seal bag. Chill, turning occasionally, at least 8 hours or up to 1 day.",
        "Heat oil in a large skillet over medium-high heat. Add pumpkin seeds and toast, shaking pan often, until seeds are brown, about 4 minutes. Add cumin seeds, then gradually add sugar, then lime juice, tossing constantly to coat seeds with melted sugar and juice. Transfer pumpkin seed mixture to a foil-lined baking sheet; spread out and let cool. Season with salt.",
        "Heat 1 tablespoon oil in a medium saucepan over medium heat.",
        "Add shallot and garlic and cook, stirring often, until softened, about 3 minutes. Add curry paste and lime zest and cook, stirring constantly, until fragrant, about 1 minute. Add coconut milk and bring just to a boil, stirring and scraping up any browned bits from bottom of pan; reduce heat and simmer, stirring occasionally, until mixture is reduced by half, 10-15 minutes. Remove from heat and let cool.",
        "Transfer coconut milk mixture to a blender. Add cilantro, lime juice, brown sugar, and 2 tablespoons water and blend until smooth. With motor running, drizzle in remaining 2 tablespoons oil and blend until creamy. Season curry sauce with salt and pepper, return to pan, and cover to keep warm.",
        "Prepare grill for medium-high heat. Remove pork from marinade; pat dry. Grill pork, turning often, until an instant-read thermometer inserted into the center registers 140°F, 15-20 minutes. Let rest 10 minutes.",
        "Slice pork and serve with curry sauce and cumin-spiced pumpkin seeds.",
        "DO AHEAD: Cumin-spiced pumpkin seeds and curry sauce can be made 1 day ahead. Store pumpkin seeds airtight at room temperature. Cover and chill curry sauce."
    ],
    "ingredients": [
        "1/2 cup reduced-sodium soy sauce",
        "1/4 cup fresh orange juice",
        "2 tablespoons pure maple syrup",
        "2 tablespoons toasted sesame oil",
        "2 pork tenderloins (about 2 1/4 pounds total)",
        "1 tablespoon vegetable oil",
        "3/4 cup shelled pumpkin seeds (pepitas)",
        "1/2 teaspoon cumin seeds",
        "1 tablespoon sugar",
        "1 tablespoon fresh lime juice",
        "Kosher salt",
        "3 tablespoons vegetable oil, divided",
        "1 small shallot, chopped",
        "1 garlic clove, chopped",
        "1/4 cup green Thai curry paste",
        "1 teaspoon finely grated lime zest",
        "1 14-ounce can unsweetened coconut milk",
        "1/4 cup fresh cilantro leaves",
        "1 tablespoon fresh lime juice",
        "1 tablespoon (packed) light brown sugar",
        "Kosher salt, freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Marinate",
        "Dinner",
        "Lime",
        "Pork Tenderloin",
        "Curry",
        "Grill",
        "Grill/Barbecue",
        "Advance Prep Required",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Green Curry Pork Tenderloin",
    "url": "http://www.epicurious.com/recipes/food/views/green-curry-pork-tenderloin-51160610"
}
