{
    "directions": [
        "Bring a big pot of water to the boil, while you top and tail (trim) the beans. Once the water has come to the boil, salt it and cook the beans until they have lost their rawness (about 6 minutes after the water comes back to the boil), but retain a bit of crunch.",
        "Strain them, and put the pot back on the stove over a low heat with the butter and olive oil. While the butter melts, chop up the lemon. Put it on a chopping board, cut a slice off each end, just enough to remove skin and pith, and then cut downwards, turning the lemon as you go, to peel the fruit fully. Don't worry if in order to remove all the pith you cut into the fruit a bit: just take the pieces of fruity peel over to the pan and squeeze in any juice you can. Then cut the lemon up on the board: I just slice and let each slice tumble into bits on its own. Add the lemon pieces and all the juice that collects to the melted butter and stir well with a wooden spoon, adding the drained beans.",
        "Swirl the pan vigorously and turn the beans in the lemony butter. Add salt to taste and lots of freshly ground pepper. I love white pepper (out of deference to my mother's taste and practice) or the much-abominated 1980s restaurant-style mixed pepper, but neither is crucial.",
        "Remove to a warmed casserole making sure you don't leave any lemony, buttery juices behind."
    ],
    "ingredients": [
        "2 lbs slender green beans",
        "3/4 stick unsalted butter",
        "few drops olive oil",
        "1 lemon",
        "sea salt and fresh pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Christmas",
        "Vegetarian",
        "Lemon",
        "Green Bean",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Bean and Lemon Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-and-lemon-casserole-236619"
}
