{
    "directions": [
        "Melt 2 tablespoons butter in heavy medium skillet over medium heat. Add green onions and garlic; sauté until onions are soft, about 2 minutes. Add spinach and sauté until liquid evaporates, about 3 minutes. Season to taste with salt and pepper. Cool completely.",
        "Blend challah in processor to fine crumbs. Add spinach mixture and dill and process, using on/off turns, until spinach is finely chopped. Transfer to large bowl. Season to taste with salt and pepper. Mix in eggs and baking powder.",
        "Melt 2 tablespoons butter with 2 tablespoons oil in heavy large skillet (preferably cast-iron) over medium heat until hot but not smoking. Working in batches, drop batter by heaping tablespoonfuls into skillet, using back of spoon to flatten latkes slightly. Cook until brown, about 2 minutes per side. Using slotted spatula, transfer latkes to paper towels to drain. Add more butter and oil to skillet as necessary and allow to get hot before adding more batter. Transfer latkes to plates. Serve, passing Feta-Yogurt Sauce separately."
    ],
    "ingredients": [
        "4 tablespoons (or more) butter",
        "1 cup chopped green onions",
        "1 garlic clove, chopped",
        "2 10-ounce packages frozen chopped spinach, thawed, drained, squeezed dry",
        "1/3 cup (packed) crustless challah or other egg-bread pieces",
        "1/2 cup chopped fresh dill",
        "4 large eggs, beaten to blend",
        "1 1/2 teaspoons baking powder",
        "2 tablespoons (or more) olive oil",
        "Feta-Yogurt Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Herb",
        "Side",
        "Sauté",
        "Hanukkah",
        "Feta",
        "Spinach",
        "Winter",
        "Pan-Fry",
        "Kosher",
        "Dill",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Greek-Herbed Spinach Latkes with Feta-Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/greek-herbed-spinach-latkes-with-feta-yogurt-sauce-105954"
}
