{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add all mushrooms and thyme; sauté 5 minutes. Add 2 tablespoons shallots; sauté until mushrooms are tender, about 3 minutes. Add Madeira and simmer until almost all liquid evaporates, about 2 minutes. Add cream and simmer until slightly thickened, about 2 minutes. Set sauce aside. Cook beans in large pot of boiling salted water until just tender, 5 minutes. Drain. Transfer to bowl of ice water; cool. Drain. (Sauce and beans can be made 6 hours ahead. Cover separately; chill.)",
        "Pour enough oil into large deep saucepan to reach depth of 4 inches. Heat oil to 350°F. Place 1/4 of leeks in small metal strainer. Lower strainer into oil; fry until golden, 40 seconds. Lift strainer from oil. Drain leeks on paper towels. Repeat with remaining leeks in 3 more batches. Season leeks with salt.",
        "Melt 1 tablespoon butter in heavy large skillet over medium heat. Add beans and remaining 1 tablespoon shallots; toss to heat through. Season with salt and pepper. Place beans on platter.",
        "Bring sauce to simmer. Spoon sauce over beans. Sprinkle with fried leeks."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "6 ounces shiitake mushrooms, stemmed and sliced",
        "6 ounces oyster mushrooms, sliced",
        "3/4 teaspoon dried thyme",
        "3 tablespoons chopped shallots",
        "1/2 cup Madeira",
        "1 cup whipping cream",
        "1 pound fresh green beans, trimmed",
        "Vegetable oil (for deep-frying)",
        "2 large leeks (white and pale green parts only), thinly sliced crosswise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Bean",
        "Mushroom",
        "Sauté",
        "Kid-Friendly",
        "Fall"
    ],
    "title": "Green Beans with Mushroom-Madeira Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/green-beans-with-mushroom-madeira-sauce-102143"
}
