{
    "directions": [
        "Combine 2 tablespoons fish sauce, garlic, sugar and pepper in medium bowl. Add chicken. Refrigerate 1 hour.",
        "Heat 1 tablespoon oil in medium saucepan over medium heat. Add curry paste; sauté until fragrant, about 2 minutes. Stir in coconut milk, stock, sugar and 2 tablespoons fish sauce. Simmer until flavors blend and sauce thickens slightly, about 10 minutes. Keep warm.",
        "Cook spinach in pot of boiling water until soft, about 3 minutes. Drain well. Cool spinach and squeeze dry. Transfer spinach to blender. Add 1/4 cup sauce and basil; puree mixture.",
        "Using electric mixer, beat egg whites, cornstarch, flour and 1/4 cup water in large bowl until smooth. Drain chicken; add to batter, stirring to coat. Pour enough oil into heavy large pot to reach depth of 3 inches. Heat to 350°F. Working in batches, add chicken to pot and deep-fry until cooked through and golden, turning frequently, about 2 minutes. Using tongs, transfer chicken to paper towels.",
        "Add spinach puree to sauce. Bring to boil. Remove from heat. Place chicken atop steamed rice. Pour sauce over; serve."
    ],
    "ingredients": [
        "4 tablespoons fish sauce (nam pla)",
        "1 tablespoon minced garlic",
        "1 tablespoon sugar",
        "1 teaspoon ground black pepper",
        "1 1/2 pounds skinless boneless chicken tenders",
        "1 tablespoon vegetable oil plus additional oil (for frying)",
        "3 tablespoons Thai green or red curry paste",
        "2 cups canned unsweetened coconut milk",
        "1 cup chicken stock or canned low-salt chicken broth",
        "1/4 cup (packed) golden brown sugar",
        "1 10-ounce package ready-to-use fresh spinach",
        "1 cup fresh basil leaves",
        "3 large egg whites",
        "1/2 cup cornstarch",
        "2 tablespoons all purpose flour",
        "1/4 cup water",
        "Steamed rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Mixer",
        "Chicken",
        "Rice",
        "Fry",
        "Coconut",
        "Basil",
        "Curry",
        "Spinach"
    ],
    "title": "Green Curry Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/green-curry-chicken-5702"
}
