{
    "directions": [
        "Place onion, 1/4 cup vinegar, and bay leaf in large jar or medium bowl. Add just enough water to cover. Season generously with salt and pepper. Cover and chill overnight. (Can be prepared 3 days ahead.)",
        "Preheat oven to 350°F. Place large piece of foil on baking sheet. Place beets in center of foil. Drizzle beets with 1 tablespoon oil and 2 tablespoons water. Top with another piece of foil; crimp edges to seal tightly. Roast beets until tender when pierced with fork, about 1 hour 15 minutes. Cool completely.",
        "Cook beans in large pot of boiling salted water until crisp-tender, about 6 minutes. Rinse under cold water to cool. Drain and pat dry.",
        "Whisk remaining 6 tablespoons balsamic vinegar, 1/2 cup oil, shallots, and thyme in small bowl to blend. Season dressing with salt and pepper. (Beets, beans, and dressing can be made 1 day ahead. Cover separately and refrigerate.)",
        "Peel and cut beets into 1/4-inch-thick slices. Arrange large radicchio leaves over very large platter to cover (reserve small leaves for another use). Drain red onions; scatter over radicchio. Arrange beans over onions. Arrange beet slices decoratively over beans. Pour dressing over salad and serve."
    ],
    "ingredients": [
        "1 large red onion, halved lengthwise, thinly sliced crosswise",
        "1/4 cup plus 6 tablespoons balsamic vinegar",
        "1 bay leaf",
        "6 large beets (about 2 1/2 pounds)",
        "1 tablespoon plus 1/2 cup extra-virgin olive oil",
        "2 tablespoons water",
        "1 1/2 pounds slender green beans, trimmed, cut in half crosswise",
        "1/4 cup chopped shallots",
        "1 tablespoon minced fresh thyme",
        "1 large head of radicchio"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Appetizer",
        "Roast",
        "Vegetarian",
        "Green Bean",
        "Beet",
        "Fall",
        "Vegan",
        "Shallot",
        "Boil",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Green Bean and Radicchio Salad with Roasted Beets and Balsamic Red Onions",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-and-radicchio-salad-with-roasted-beets-and-balsamic-red-onions-109576"
}
