{
    "directions": [
        "Coarsely chop the tomatoes. Place in a colander and, pressing with your hand, squeeze out as much tomato juice as you can. Transfer tomatoes to a large saucepan with 1 cup of water. Bring to a boil over medium-high heat; remove from heat and drain well.",
        "Return tomatoes to saucepan with 1 cup of cold water, bring to a boil; drain again.",
        "Place tomatoes back in the saucepan with remaining cup of water, apples, raisins, brown sugar, 3 1/2 teaspoons salt, vinegar, and 1/2 cup butter-flavored shortening. Cook slowly over medium-low heat, stirring frequently, until tomatoes are transparent, about 30 minutes.",
        "In the last 5 minutes of cooking, add cinnamon, nutmeg, cloves, lemon rind and juice. Remove mincemeat from heat and set aside to cool.",
        "For the Pastry: In a large bowl, combine flour, 1 teaspoon salt ,and shortening. Add ice water, 1 tablespoon at a time, until the dough barely holds together. Wrap dough in plastic and refrigerate for 30 minutes.",
        "Roll dough out to 1/8 inch thick on floured surface. Cut a 5-inch circle, place a large spoonful of filling on one half of the circle. Fold over and seal the edges by pressing them with a fork. Repeat with remaining dough.",
        "In a large heavy skillet, heat shortening to 360 degrees F (182 degrees C). Carefully place 4 pies in the hot shortening. Fry until golden brown on both sides. Drain on paper towels. Repeat with remaining pies."
    ],
    "ingredients": [
        "2 pounds green tomatoes",
        "3/4 cup distilled white vinegar",
        "1 1/2 teaspoons ground cinnamon",
        "3 cups cold water, divided",
        "3 pounds tart apples - peeled, cored and chopped",
        "1 1/2 pounds raisins",
        "3 3/4 cups packed brown sugar",
        "3 1/2 teaspoons salt",
        "1 teaspoon ground nutmeg",
        "1 teaspoon lemon zest",
        "1 teaspoon ground cloves",
        "1/4 cup lemon juice",
        "1/2 cup butter flavored shortening",
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/3 cup shortening",
        "3 tablespoons ice water",
        "3 cups shortening for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Green Tomato Mincemeat Fried Pies",
    "url": "http://allrecipes.com/recipe/12609/green-tomato-mincemeat-fried-pies/"
}
