{
    "directions": [
        "Whisk together flours, cornmeal, baking powder, baking soda, brown sugar, 2 teaspoons peppercorns, and table salt in a bowl. Blend in butter using a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk and stir just until a dough forms. Turn dough out onto a floured surface and gently knead 6 to 8 times. Cut into 5 pieces, then chill, covered with plastic wrap, 10 minutes.",
        "Preheat oven to 350°F with racks in upper and lower thirds.",
        "Mix kosher salt and remaining 2 teaspoons peppercorns in a small bowl.",
        "Roll out 1 piece of dough on a well-floured surface with a floured rolling pin into a 15- by 4-inch rectangle (1/8 inch thick). Lightly brush with egg, then prick all over with a fork. Sprinkle with about 1/2 teaspoon salt-and-pepper mixture.",
        "Cut crosswise into 12 strips and arrange 1/8 inch apart on a parchment-paper-lined baking sheet. Repeat with remaining dough.",
        "Bake, switching position of sheets halfway through, until golden-brown and crisp, 20 to 25 minutes. Cool crackers slightly, then transfer to racks to cool completely."
    ],
    "ingredients": [
        "3/4 cup whole-wheat flour",
        "3/4 cup all-purpose flour",
        "1/2 cup cornmeal (preferably stone-ground)",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "2 teaspoons packed light brown sugar",
        "4 teaspoons dried green peppercorns, coarsely crushed, divided",
        "1/2 teaspoon table salt",
        "1 stick cold unsalted butter, cut into pieces",
        "2/3 cup well-shaken buttermilk",
        "1/2 teaspoon kosher salt",
        "1 large egg, beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Bake",
        "Cocktail Party",
        "Cornmeal",
        "Engagement Party",
        "Buttermilk",
        "Gourmet"
    ],
    "title": "Green-Peppercorn Cornmeal Crackers",
    "url": "http://www.epicurious.com/recipes/food/views/green-peppercorn-cornmeal-crackers-357979"
}
