{
    "directions": [
        "Preheat oven to 450°F.",
        "With a vegetable peeler remove zest from lemon and reserve lemon. Pit olives. In a food processor finely chop zest, olives, garlic, and parsley with 2 tablespoons oil.",
        "Peel potatoes and cut into 1 1/2-inch pieces. In a large flameproof roasting pan toss potatoes with remaining 2 tablespoons oil to coat and season with salt and pepper. Arrange lamb on potatoes and with the tip of a sharp small knife cut small slits all over lamb. Rub olive mixture over lamb, pushing it into slits. Halve reserved lemon and squeeze juice over lamb. Season lamb with salt and pepper and roast with potatoes in middle of oven 20 minutes.",
        "Reduce temperature to 350°F.",
        "Roast lamb and potatoes, loosening potatoes from pan with a metal spatula and turning them occasionally, 1 hour more, or until a meat thermometer inserted into thickest part of meat registers 135°F. Transfer lamb to a cutting board and let stand while making gravy. Transfer potatoes to a large bowl and keep warm.",
        "In a cup with your fingers blend together flour and butter. Add wine and water to roasting pan and deglaze pan over moderately high heat, stirring and scraping up brown bits. Transfer mixture to a small saucepan and bring to a boil. Whisk in flour mixture, whisking until incorporated, and simmer gravy, stirring occasionally, 1 minute. With a slotted spoon remove any potato pieces from gravy.",
        "Garnish lamb with lemon halves and olive branches and serve with gravy and potatoes."
    ],
    "ingredients": [
        "1 large lemon",
        "1/3 cup brine-cured green olives (preferably Italian)",
        "4 large garlic cloves",
        "1/4 cup packed fresh flat-leafed parsley leaves",
        "4 tablespoons olive oil",
        "3 pounds boiling potatoes (preferably Yukon Gold)",
        "a 7-pound leg of lamb (ask butcher to remove pelvic bone and tie lamb for easier carving)",
        "1/2 tablespoon all-purpose flour",
        "1/2 tablespoon unsalted butter",
        "1/2 cup dry white wine",
        "1/2 cup water",
        "Garnish: lemon halves and olive branches"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Garlic",
        "Lamb",
        "Olive",
        "Roast",
        "Easter",
        "Spring",
        "Gourmet"
    ],
    "title": "Green Olive, Lemon, and Garlic-Roasted Leg of Lamb with Potatoes and Pan Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/green-olive-lemon-and-garlic-roasted-leg-of-lamb-with-potatoes-and-pan-gravy-101528"
}
