{
    "directions": [
        "Combine 1 cup heavy whipping cream, 1 cup whole milk, and 1/2 cup sugar in heavy medium saucepan. Bring mixture to simmer, stirring until sugar dissolves. Whisk 3 large egg yolks and remaining 1/4 cup sugar in large heatproof bowl until blended. Gradually add hot cream mixture to yolk mixture and whisk until blended. Return mixture to saucepan and stir over mediumlow heat until custard thickens slightly and coats back of spoon when finger is drawn across and instant-read thermometer inserted into mixture registers 170°F, about 3 minutes (do not boil). Pour custard through strainer set over medium bowl. Place bowl with custard in larger bowl filled halfway with ice and water. Whisk occasionally until custard is almost cool to touch, about 5 minutes. Remove bowl with custard from ice water. Whisk yogurt and pinch of salt into custard. Refrigerate custard until well chilled.",
        "Transfer custard to ice cream maker and process according to manufacturer's instructions. Transfer yogurt ice cream to freezer container. Cover and freeze until ice cream is firm. DO AHEAD: Can be made 3 days ahead. Keep frozen.",
        "A thick yogurt; sold at some supermarkets and at specialty foods stores (such as Trader Joe's and Whole Foods) and Greek markets. If unavailable, place regular yogurt in cheesecloth-lined strainer set over large bowl. Cover and chill overnight to drain."
    ],
    "ingredients": [
        "1 cup whole milk",
        "3/4 cup sugar, divided",
        "3 large egg yolks",
        "1 cup whole-milk Greek-style yogurt*",
        "Pinch of salt",
        "Special equipment: Ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Egg",
        "Yogurt",
        "Frozen Dessert",
        "Candy Thermometer"
    ],
    "title": "Greek Yogurt Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/greek-yogurt-ice-cream-354911"
}
