{
    "directions": [
        "Char chiles directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel, seed, and coarsely chop chiles.",
        "Combine chiles, orange juice, oil, vinegar, and garlic in blender. Blend until mixture is smooth and thick. Season dressing to taste with salt and pepper. Cover; chill until dressing is cold, at least 1 hour and up to 1 day.",
        "Preheat oven to 400°F. Wrap each beet tightly in foil; place directly on oven rack. Roast beets until tender when pierced with knife, about 50 minutes. Unwrap beets and cool completely, then peel. Coarsely grate beets into medium bowl. Toss with lime juice. Season to taste with salt and pepper. Cover and let stand at room temperature at least 1 hour.",
        "Cook green beans in large pot of boiling salted water until crisp-tender, about 3 minutes. Drain; transfer to large bowl of ice water to cool. Drain again and pat dry.",
        "Toss green beans, spinach, onion, and radishes in large bowl with enough dressing to coat. Season with salt and pepper. Divide salad among plates; top with beets."
    ],
    "ingredients": [
        "2 fresh poblano chiles",
        "1/4 cup fresh orange juice",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon apple cider vinegar",
        "2 garlic cloves",
        "2 small beets",
        "3 tablespoons fresh lime juice",
        "1 1/2 pounds green beans, trimmed, cut diagonally into 1-inch pieces",
        "3 cups baby spinach leaves",
        "1 small white onion, sliced paper-thin",
        "5 large radishes, sliced paper-thin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit Juice",
        "Blender",
        "Side",
        "Roast",
        "Vegetarian",
        "Orange",
        "Green Bean",
        "Spinach",
        "Hot Pepper",
        "Beet",
        "Radish",
        "Fall",
        "Healthy",
        "Vegan"
    ],
    "title": "Green Bean, Spinach, and Beet Salad",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-spinach-and-beet-salad-108034"
}
