{
    "directions": [
        "One: Wash the chicken and pat dry. Put them in a large non-reactive glass or stainless steel bowl. In a separate bowl, combine the olive oil, lemon juice, wine, garlic, onion, bay leaf, oregano, juniper berries, coriander seeds, and a few liberal grindings of pepper. Whisk until well-mixed and pour over the chicken, fuming the chicken until it is uniformly coated with the marinade. Cover and refrigerate, marinating for 2 hours or overnight.",
        "Two: Drain the chicken, pat dry, and sprinkle liberally with salt. Spread the flour on a plate or place it in a paper or large Zip-lock plastic bag. Fill a large cast-iron skillet with enough olive or peanut oil (or combination of both) to come halfway up the sides, about 1 inch deep. Over medium-high heat, bring the oil to 375°F (hot but not smoking).",
        "Three: Beginning with the dark meat roll the chicken in the flour or drop it a few pieces at a time into the bag of flour, close the top, and shake until it is coated. Shake off the excess flour and slip the chicken into the hot fat",
        "Four: Fry until the bottom is sealed and beginning to color, about 4 minutes. Turn, and brown the second side. Reduce the heat to medium (325°F) and fry, turning once, until the chicken is cooked through and golden, about 15 minutes more.",
        "Lift the chicken from the fat and drain well on a wire rack. Transfer to a platter and garnish with the sprigs of herb and lemon wedges and serve at once."
    ],
    "ingredients": [
        "1 frying chicken, weighing no more than 3 pounds, skinned and cut up for frying",
        "1/4 cup extra virgin olive oil",
        "1/2 cup freshly squeezed lemon juice",
        "1/2 cup dry white wine",
        "2 large garlic cloves, minced",
        "1 small onion, thinly sliced",
        "1 bay leaf, crumbled if dried, chopped if fresh",
        "1 tablespoon chopped fresh oregano or 1 teaspoon dried 6 juniper berries, crushed",
        "6 coriander seeds, crushed",
        "Black pepper",
        "Salt",
        "1 cup all-purpose flour",
        "Olive or peanut oil (or a combination), for frying",
        "Parsley or fresh oregano sprigs and 1 1emon cut into wedges, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Onion",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Lemon",
        "Family Reunion",
        "Deep-Fry",
        "Oregano",
        "Coriander",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Greek Marinated Fried Chicken - Kotopoulo Tiganito Marinato",
    "url": "http://www.epicurious.com/recipes/food/views/greek-marinated-fried-chicken-kotopoulo-tiganito-marinato-358293"
}
