{
    "directions": [
        "Preheat the oven to 375°F.",
        "In a large sauté pan or wok over moderate heat, warm the oil. Add the shallots and sauté, stirring occasionally, for 2 minutes. Add the garlic and sauté, stirring occasionally, for 1 minute. Add the green beans, along with the vinegar, salt, and pepper, and continue to cook, stirring occasionally, for 1 minute. Add the chicken stock and cook, tossing occasionally, until the green beans are crisp-tender, about 4 minutes. Using tongs, lift the green beans from the pan and transfer to the baking dish; set aside.",
        "Add the heavy cream and rosemary to the sauté pan and bring to a simmer. Continue simmering until slightly reduced, about 2 minutes. Add the butter and stir until melted, then pour the mixture over the green beans. DO AHEAD: The green beans can be prepared up to this point, covered, and kept at room temperature for 1 hour.",
        "Sprinkle the almonds and Cheddar over the green beans and bake until the cheese is melted and the green beans are hot, about 10 minutes."
    ],
    "ingredients": [
        "1 tablespoon canola oil",
        "1/4 cup sliced shallots",
        "2 cloves garlic, peeled and minced",
        "3 pounds green beans, trimmed",
        "1/2 cup red-wine vinegar",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1/2 cup chicken stock or low-sodium chicken broth",
        "1/2 cup heavy cream",
        "1 teaspoon coarsely chopped fresh rosemary",
        "2 tablespoons unsalted butter",
        "1 cup sliced almonds, lightly toasted",
        "1 cup freshly grated sharp or extra-sharp white Cheddar cheese",
        "Special equipment: 1 (2 1/2- to 3-quart) baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Nut",
        "Vegetable",
        "Side",
        "Christmas",
        "Cheddar",
        "Almond",
        "Green Bean",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Green Bean Amandine",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-amandine-51126860"
}
