{
    "directions": [
        "Set 4 whole garlic cloves in a small skillet over medium-high heat; toast until spotty brown, about 5 minutes. Peel, mince and set aside.",
        "Break up lamb in a medium bowl. Sprinkle roasted garlic, feta, oregano, salt and pepper over meat; stir with a fork to combine. Divide into 4 portions. Toss meat back and forth between cupped hands to form a ball. Pat with fingertips to flatten to about 4 inches wide. Refrigerate.",
        "Mix cucumber, sour cream, mint, vinegar, 1 minced clove of garlic, and salt and pepper to taste in a small bowl. Refrigerate sauce until ready to serve.",
        "Build a hot fire on one side of grill. Replace rack. When coals are covered with white ash, add burgers. Cover and cook, turning only once, until done, about 4 to 5 minutes per side for medium to medium-well burgers.",
        "Grill pitas until spotty brown and warm, a minute or so per side. Split crosswise. Spread a couple of tablespoons of sauce over 4 pita halves. Top each with an onion slice, a tomato slice and a burger. Spread a portion of the remaining sauce over each burger. Top with remaining pita halves."
    ],
    "ingredients": [
        "4 large unpeeled garlic cloves",
        "1 1/4 pounds ground lamb",
        "1/2 cup crumbled feta cheese",
        "3/4 teaspoon dried oregano",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 large cucumber, peeled, grated and squeezed very dry in a clean towel",
        "3/4 cup sour cream",
        "1 tablespoon minced fresh mint leaves",
        "1 teaspoon red or rice wine vinegar",
        "1 clove garlic, minced",
        "4 large, thin red onion slices",
        "4 large, thin tomato slices",
        "4 small (4 inch) pita breads"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Lamb-Feta Burgers With Cucumber Sauce",
    "url": "http://allrecipes.com/recipe/87308/greek-lamb-feta-burgers-with-cucumber/"
}
