{
    "directions": [
        "Working in batches, cook three-quarters of green beans in a large pot of boiling salted water until crisp-tender, about 3 minutes per batch. Transfer to a bowl of ice water; let cool. Drain and pat dry; trim stem ends.",
        "Combine mushroom soy sauce, black vinegar, rice vinegar, and sugar in a small bowl, stirring to dissolve sugar. Set mushroom XO sauce aside.",
        "Trim stem ends of remaining uncooked green beans. Heat 1 Tbsp. oil in a large skillet over medium-high. Cook beans, tossing occasionally, until blistered in spots and crisp-tender, about 5 minutes. Transfer to a plate.",
        "Add remaining 1 Tbsp. oil to same skillet and cook king trumpet and shiitake mushrooms, tossing occasionally, until browned and tender, about 5 minutes. Remove skillet from heat and carefully add brandy away from heat source. Return skillet to heat and tilt to ignite brandy. Once flames have subsided, add shallot, chile, garlic, dried shrimp, half of scallions, and reserved XO sauce. Cook, tossing occasionally, just until aromatics have softened, about 3 minutes (there should still be some liquid in the pan). Add chile oil and all of the green beans and toss well to combine. Serve topped with remaining scallions."
    ],
    "ingredients": [
        "2 pounds green beans, divided",
        "Kosher salt",
        "5 tablespoons mushroom soy sauce or 3 tablespoons regular soy sauce",
        "2 tablespoons black (Chinkiang) vinegar",
        "2 tablespoons unseasoned rice vinegar",
        "1 tablespoon sugar",
        "2 tablespoons vegetable oil, divided",
        "4 ounces king trumpet or maitake mushrooms, caps sliced, stalks coarsely chopped",
        "4 ounces shiitake mushrooms, sliced",
        "1/4 cup brandy",
        "1 shallot, very thinly sliced",
        "1 Fresno chile, thinly sliced",
        "2 garlic cloves, thinly sliced",
        "2 tablespoons small dried shrimp or a splash of fish sauce",
        "4 scallions, green parts only, thinly sliced on a diagonal, divided",
        "1 tablespoon chile oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Side",
        "Green Bean",
        "Mushroom",
        "Soy Sauce",
        "Chile Pepper",
        "Green Onion/Scallion"
    ],
    "title": "Green Beans With Mushroom XO Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/green-beans-with-mushroom-xo-sauce"
}
