{
    "directions": [
        "Heat olive oil in a 5-quart pressure cooker over medium-high heat. Add half the beef; cook and stir until well browned on all sides. Remove beef with a slotted spoon and set aside. Brown the remaining meat and set aside.",
        "Place chopped onion in the pressure cooker; cook and stir for 1 minute. Add the garlic and stir for an additional minute. Pour in the red wine, red wine vinegar, and beef broth; stir in the tomato paste and mix well.",
        "Grind or crush rosemary, oregano, and peppercorns in a mortar and pestle or spice grinder. Add crushed spices to the cooker with bay leaves, cumin, cinnamon, cloves, black pepper, and brown sugar.",
        "Pour in tomatoes and their juice; rinse the can with 1/2 cup water and add the water to the cooker. Stir in potatoes and carrots. Return the browned meat to the pressure cooker. A 5-quart pot should be about half full and a little soupy; the potato will dissolve a bit and thicken it after cooking. Cover the pot and seal the lid.",
        "Bring the pot up to high pressure over high heat. Reduce the heat to low, maintaining full pressure, and cook for 15 minutes. Remove from heat and let the pressure reduce naturally. Taste the stew and add salt, if desired."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 pound cubed beef stew meat",
        "1 onion, peeled and chopped",
        "1 large clove garlic, minced",
        "1/4 cup red wine",
        "2 tablespoons red wine vinegar",
        "1/2 cup fat-free reduced-sodium beef broth",
        "1 tablespoon tomato paste",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon dried oregano",
        "6 whole black peppercorns",
        "2 bay leaves",
        "1 teaspoon ground cumin",
        "1/8 teaspoon ground cinnamon",
        "1 pinch ground cloves",
        "1/4 teaspoon ground black pepper",
        "1 1/2 teaspoons light brown sugar",
        "1 (28 ounce) can whole plum tomatoes, undrained and quartered",
        "1/2 cup water",
        "2 potatoes, peeled and cut into 2-inch pieces",
        "2 carrots, peeled and sliced",
        "salt to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Style Beef Stew",
    "url": "http://allrecipes.com/recipe/216615/greek-style-beef-stew/"
}
