{
    "directions": [
        "Bring 8 cups water, bay leaf, half of onion, half of garlic, and 1 teaspoon salt to a boil, covered, in a 6-quart heavy pot, then reduce heat and simmer 10 minutes. Add chicken and poach at a bare simmer, uncovered, skimming off any foam, until just cooked through, about 20 minutes. Transfer chicken to a cutting board to cool. Pour broth through a fine-mesh sieve into a large bowl, discarding solids, and reserve. When chicken is cool enough to handle, coarsely shred with your fingers.",
        "Cook pumpkin seeds in a dry small skillet over low heat, stirring occasionally, until puffed but not browned (seeds will pop as they puff), 6 to 7 minutes. Transfer to a bowl to cool completely, then finely grind in coffee/spice grinder.",
        "Simmer tomatillos and remaining onion in remaining cup water in a 3-quart saucepan, covered, until tender, about 10 minutes. Drain vegetables and purée in a blender with jalapeños, 1/4 cup cilantro, epazote, remaining garlic, and remaining 1 1/2 teaspoons salt.",
        "Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then add purée (use caution as it will splatter and steam). Cook, uncovered, stirring frequently, until thickened, about 10 minutes. Stir in pumpkin seeds and 1 cup reserved broth and simmer 5 minutes. Stir in shredded chicken, hominy, and 3 more cups reserved broth and simmer, partially covered, 20 minutes.",
        "Stir in remaining 1/2 cup cilantro and serve pozole in deep bowls with accompaniments."
    ],
    "ingredients": [
        "9 cups water",
        "1 Turkish or 1/2 California bay leaf",
        "1 large white onion, halved lengthwise and thinly sliced",
        "6 garlic cloves, chopped",
        "2 1/2 teaspoons salt",
        "3 lb skinless boneless chicken thighs",
        "1/2 cup hulled (green) pumpkin seeds (not roasted; 2 1/4 ounce)",
        "1 lb tomatillos, husked",
        "2 fresh jalapeño chiles, quartered (including seeds)",
        "3/4 cup chopped fresh cilantro",
        "1 teaspoon dried epazote or oregano (preferably Mexican), crumbled",
        "2 tablespoons vegetable oil",
        "2 (15-oz) cans white hominy, rinsed and drained",
        "Accompaniments: diced radish; cubed avocado tossed with lime juice; shredded romaine; chopped white onion; lime wedges; dried oregano",
        "N/A avocado",
        "N/A romaine",
        "N/A",
        "N/A lime wedges",
        "N/A",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Poultry",
        "Pumpkin",
        "Winter",
        "Healthy",
        "Gourmet"
    ],
    "title": "Green Pozole with Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/green-pozole-with-chicken-107749"
}
