{
    "directions": [
        "Whisk together the lemon juice, vinegar, oregano, garlic and some salt and pepper in a small bowl. Slowly whisk in the oil until emulsified. Let sit at room temperature while you prepare the salad to allow the flavors to meld.",
        "Rinse the quinoa in a strainer until the water runs clear. Combine the quinoa, 2 cups water, 1 teaspoon salt and 1/4 teaspoon pepper in a small saucepan, bring to a boil and cook until the water is absorbed and the quinoa is tender, about 15 minutes.",
        "Transfer to a bowl, fluff with a fork and let sit for 5 minutes to cool slightly. Add the tomatoes, olives, green onions, cherry peppers, red onions, cucumbers and dressing and toss to coat. Cover and refrigerate for at least 1 hour and up to 8 hours before serving. The longer it sits the better the flavor.",
        "Just before serving, transfer to a platter and sprinkle feta on top."
    ],
    "ingredients": [
        "3 tablespoons freshly squeezed lemon juice",
        "1 tablespoon red wine vinegar",
        "1/4 teaspoon dried oregano",
        "1 clove garlic, smashed and finely chopped to a paste",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup extra-virgin olive oil",
        "1 cup quinoa",
        "Kosher salt and pepper",
        "2 cups red and yellow grape tomatoes, halved",
        "1 cup pitted kalamata olives",
        "2 green onions (green and pale green part), thinly sliced",
        "2 pickled cherry peppers, diced",
        "1 small red onion, halved and thinly sliced",
        "1/2 English cucumber, cut into small dice",
        "Feta, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Greek Recipes",
        "Salad Recipes",
        "Greek Salad",
        "Grain Recipes",
        "Quinoa"
    ],
    "title": "Greek Quinoa Salad",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/greek-quinoa-salad-recipe"
}
