{
    "directions": [
        "Put the chicken pieces, onion, and garlic into a large saucepan; add water or chicken broth to cover and add salt. Add the optional giblets if you are making this with water. Bring to a simmer and cook over low heat until the meat is almost tender but still firm, about 25 minutes. (A lot will depend on the quality of the chicken.) If using pork, cook for about 20 minutes longer. Strain, reserving the broth. Reduce or add water to make up to 6 cups (1.5L).",
        "Put the sesame seeds into an ungreased skillet over medium heat, stirring them constantly until they become a deep golden color, about 5 minutes. Take care not to let them burn. Spread them out on a tray to cool. Put the pumpkin seeds into the pan and stir them until they begin to swell and start to pop around, about 3 minutes. Set aside to cool. When the seeds are cool, grind the sesame first with the cloves, peppercorns, and allspice to a slightly textured powder. Then grind the pumpkin seeds to the same texture. Transfer both to a bowl and stir in 1 cup (250ml) of the reserved broth to make a thick paste.",
        "Heat about 3 tablespoons of the lard or oil in a heavy casserole, add the seed paste, and fry over medium-low heat, scraping the bottom of the pan constantly to avoid sticking — if necessary add a little more fat — until dry, shiny, and a rich deep golden color.",
        "Unless you have a large blender jar you may need to blend the greens in two batches, but try to use the minimum of liquid. Put 1 cup (250ml) of the broth into the blender jar and add the garlic, tomate verde, and chiles and blend fairly smooth. Gradually add half of the greens and blend as smoothly as possible. Add the rest of the greens little by little, with just enough of the broth to enable the blades of the blender to work efficiently.",
        "Gradually stir the blended ingredients into the fried seed paste over medium heat, stirring the mixture well after each addition. Continue cooking over medium heat, stirring frequently, until the sauce starts to reduce and thicken, for about 10 minutes. Add the remaining broth and cook for a further 10 minutes — pools of oil will form around the periphery. Add the meat, adjust salt, and cook for a further 10 minutes. Dilute with more broth or water if desired. Serve with corn tortillas."
    ],
    "ingredients": [
        "1 large chicken (3 1/2-4 pounds/1.575 to 1.8 kg), cut into serving pieces, or 4 1/2 pounds (about 2 kg) country-style spareribs, cut into 2-inch (5-cm) pieces",
        "1 small white onion, roughly chopped",
        "2 garlic cloves, roughly chopped",
        "Water or light chicken broth to cover",
        "Sea salt to taste",
        "1 pound (450g) giblets (optional)",
        "5 ounces (140g) sesame seeds, about 1 cup (250ml)",
        "1 1/2 ounces (45g) raw hulled pumpkin seeds, about 1/3 cup (83ml)",
        "3 whole cloves",
        "3 peppercorns",
        "3 allspice berries",
        "About 1/3 cup (83ml) lard or vegetable oil",
        "2 garlic cloves, roughly chopped",
        "6 ounces (180g) tomate verde (about 8 medium), roughly chopped",
        "2 poblano chiles (unpeeled), seeds and veins removed and roughly chopped, about 1/2 cup (125ml)",
        "6 to 8 serrano chiles, roughly chopped",
        "8 romaine lettuce leaves, roughly chopped",
        "5 green Swiss chard leaves, stems removed and discarded, leaves roughly chopped",
        "1 large bunch cilantro, trimmed of thick stems and roughly chopped, about 1 1/2 cups (375ml) tightly packed",
        "1 small bunch flat-leaf parsley, roughly chopped, about 1/2 cup (125ml) tightly packed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Pork Rib",
        "Hot Pepper",
        "Fall",
        "Chard",
        "Cilantro",
        "Parsley",
        "Simmer"
    ],
    "title": "Green Mole",
    "url": "http://www.epicurious.com/recipes/food/views/green-mole-108193"
}
