{
    "directions": [
        "Place rice in a bowl, cover with water, and allow to soak for 1 hour.",
        "Slice a long, 1/2-thick slice from the side of each zucchini to serve as a lid; hollow out the flesh and seeds from the inside of the zucchini with a spoon, leaving a 1/2-inch thick shell. Discard the flesh, or save for another use. Drain, and place the soaked rice in a bowl. Mix in the ground beef, shallots, garlic, mint, and parsley. Stuff the zucchini boats about 3/4 full with the mixture; stuffing will expand during cooking. Cover the zucchini with the cut-off lid slices.",
        "Heat the olive oil in a large skillet over medium heat, and sprinkle the pan with salt and pepper. Place the stuffed zucchini into the pan, pour water around the zucchini, then reduce heat to medium low. Cover with a lid, and cook until the zucchini are tender and the meat is no longer pink, 35 to 40 minutes.",
        "About 10 minutes before the zucchini are done, beat the egg whites in a bowl with an electric mixture until stiff peaks form. Whisk in the yolks and lemon juice until well combined. Remove the zucchini from the skillet, leaving the juices, and set the zucchini aside in a warm place. Whisk about 1/2 of the liquid in the skillet into the egg mixture by tablespoons, then pour the egg mixture into the skillet with the remaining liquid. Over low heat, combine the sauce with the pan liquid by gently rotating the skillet to mix the contents; heat the sauce for about 1 minute to thicken enough to coat the back of a spoon. Do not boil. Serve the zucchini with lemon sauce."
    ],
    "ingredients": [
        "1/4 cup uncooked white rice",
        "8 zucchini, ends trimmed",
        "1 pound ground beef",
        "4 shallots, chopped",
        "2 cloves garlic, finely chopped",
        "1/4 cup chopped fresh mint",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "3 tablespoons water",
        "Avgolemono Sauce:",
        "2 eggs, separated",
        "4 lemons, juiced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greek Stuffed Zucchini",
    "url": "http://allrecipes.com/recipe/215683/greek-stuffed-zucchini/"
}
