{
    "directions": [
        "Combine artichoke hearts, 6 tablespoons oil, 2 minced garlic cloves and 1 tablespoon oregano in medium bowl. Refrigerate at least 2 hours and up to 6 hours, tossing occasionally.",
        "Heat remaining 6 tablespoons oil in heavy large skillet over medium-high heat. Add prosciutto; stir 2 minutes. Add bread pieces; stir to coat with oil. Mix in remaining 2 garlic cloves and 2 tablespoons oregano. Reduce heat to medium-low; stir until bread pieces begin to brown and are crisp on edges, about 10 minutes. Remove from heat. Season with pepper; sprinkle lightly with salt.",
        "Place romaine, arugula, red onion and vinegar in large bowl. Add artichoke mixture; toss to blend. Season salad to taste with salt and pepper. Spoon bread mixture over center of salad. Sprinkle with goat cheese."
    ],
    "ingredients": [
        "4 6.5-ounce jars marinated artichoke hearts, well drained",
        "12 tablespoons extra-virgin olive oil",
        "4 garlic cloves, minced",
        "3 tablespoons minced fresh oregano",
        "6 ounces thinly sliced prosciutto, coarsely chopped (about 1 1/2 cups)",
        "5 cups 1/2-inch pieces crustless baguette (from one 16-ounce loaf)",
        "6 cups lightly packed bite-size pieces romaine lettuce",
        "4 cups lightly packed arugula (about 2 large bunches)",
        "2/3 cup sliced red onion",
        "4 tablespoons Sherry wine vinegar or balsamic vinegar",
        "1 1/2 cups crumbled soft fresh goat cheese (such as Montrachet; about 5 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Sauté",
        "Goat Cheese",
        "Arugula",
        "Prosciutto",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Green Salad with Goat Cheese, Artichoke Hearts and Migas",
    "url": "http://www.epicurious.com/recipes/food/views/green-salad-with-goat-cheese-artichoke-hearts-and-migas-101007"
}
