{
    "directions": [
        "In a small bowl, stir together the crème fraîche, horseradish to taste, and a pinch of salt. Cover and refrigerate.",
        "Cut off the root ends of the young leeks and green garlic. Trim away the tough green leek tops and discard or save for making stock. Cut the leeks and garlic in half lengthwise, then chop crosswise into 1/4- to 1/2-inch (6- to 12-mm) pieces. You should have about 2 cups (180 g). If using large leeks and mature garlic, cut the white part of each leek into the same-size pieces and mince the garlic.",
        "In a 12-inch (30.5-cm) skillet, heat 1 tablespoon each of the butter and olive oil over medium heat. Add the leeks and garlic, season with salt and pepper, and reduce the heat to medium-low. Cook uncovered, stirring occasionally, until the colors brighten, about 3 minutes. Cover and continue to cook, stirring occasionally and reducing the heat as needed to prevent browning, until very tender, 7 to 8 minutes. Transfer the mixture to a bowl and set aside. Reserve the skillet.",
        "Break the matzo sheets into small pieces into a medium bowl and pour in water to cover. In another medium bowl, whisk together the eggs, 1/2 teaspoon salt, and a few grinds of pepper until the eggs are well blended. Drain the matzos (don’t be too fussy; just tilt the bowl to pour off the excess water, using your hand to prevent them from tumbling out). Stir the egg and leek mixtures into the matzos.",
        "Reheat the skillet with the remaining 1 tablespoon each butter and oil over medium heat. The pan is hot enough when a bit of matzo mixture dropped into it sizzles on contact. Pour in the matzo brei batter and smooth the top and edges. Cook, reducing the heat to medium-low as needed to prevent scorching, until the underside is set and golden, about 5 minutes.",
        "Use the edge of a pancake turner or spatula to cut the matzo brei into 6 wedges. Flip each wedge, rotating the pan as you go so that the pieces fit back into the pan nicely. Continue to cook until the matzo brei is cooked through but not dry, about 3 minutes more. (If you must add more fat to the pan during cooking, tilt the pan, add the fat to the side of the pan still resting on the burner, and hold the pan at this angle for a moment to heat the fat. Then, use your spatula to lift the edge of the matzo brei and tilt the pan in the opposite direction to let the warmed fat run under the matzo brei before you set the pan back squarely on the burner to finish cooking.)",
        "Place a wedge of matzo brei on each plate. Drape each wedge with salmon, top with a spoonful or two of horseradish cream, and shower with dill. Use a five-hole zester to zest long strands of lemon peel over each serving and add a squeeze of lemon."
    ],
    "ingredients": [
        "1/2 cup (115 g) crème fraîche or plain Greek yogurt",
        "1–3 tablespoons prepared horseradish (brands vary in strength)",
        "Kosher or sea salt and freshly ground white pepper",
        "1/2 bunch each young leeks and green garlic, about 10 plants total, or 2 large leeks, white part only, and 1–2 cloves garlic",
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "4 sheets matzo",
        "4 eggs",
        "1/4 pound (115 g) sliced smoked salmon",
        "A few dill sprigs, snipped",
        "1 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Passover",
        "Egg",
        "Kosher",
        "Kosher for Passover",
        "Garlic",
        "Leek",
        "Horseradish",
        "Salmon",
        "Breakfast",
        "Brunch",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Green Garlic and Leek Matzo Brei With Smoked Salmon and Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/green-garlic-and-leek-matzah-brei-with-smoked-salmon-and-horseradish-cream"
}
