{
    "directions": [
        "For the lamb: In a large skillet, heat the oil over medium-high heat. Add the lamb, sprinkle with salt and pepper and cook until the meat gets nice and golden brown, 10 to 12 minutes. With a slotted spoon, remove the lamb and reserve. Lower the heat to medium and saute the onions in the lamb juices until soft, about 5 minutes. Add the oregano and garlic and cook until fragrant. Season. Add the tomato paste and cook until it caramelizes. Deglaze with the red wine and scrape any bits up that have adhered to the pan. Add the lamb back in, stir and set aside.",
        "For the tzatziki: Grate the cucumber on the large holes of a box grater and place in a fine-meshed strainer or cheese cloth fitted over a bowl. Salt the cucumber and let sit 10 minutes. Then squeeze out any excess moisture. Add the strained cucumber into a bowl with the yogurt, feta, garlic and mint. Adjust the seasoning if necessary.",
        "For the cucumber tomato relish: Toss the olive oil, vinegar, tomatoes, cucumbers and onions in a bowl and adjust the seasoning if necessary. Cover and let sit at least 1 hour to marry the flavors.",
        "For the sandwich build: Schmear the tzatziki on the pitas, then place on the lamb and top with cucumber tomato relish."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "2 pounds ground lamb",
        "Kosher salt and freshly ground black pepper",
        "1/2 red onion, minced",
        "1 teaspoon dried oregano",
        "4 cloves garlic, minced",
        "1 tablespoon tomato paste",
        "2 tablespoons dry red wine",
        "1 English cucumber",
        "Salt",
        "1 cup whole-milk Greek yogurt",
        "1/2 cup crumbled feta cheese",
        "1 clove garlic, minced or pressed",
        "2 tablespoons minced fresh mint",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon red wine vinegar",
        "2 firm tomatoes, seeded and diced",
        "1 English cucumber, seeded and diced",
        "1/2 red onion, diced",
        "Freshly ground black pepper",
        "4 non-pocket pitas, oiled and lightly griddled on each side"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Greek Recipes",
        "Taco Recipes",
        "Cheese",
        "Feta",
        "Lamb Recipes",
        "Meat",
        "Cucumber",
        "Vegetable",
        "Tomato"
    ],
    "title": "Greek Taco!",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/greek-taco-recipe"
}
