{
    "directions": [
        "Preheat oven to 325ºF. Spread pecans on a rimmed baking sheet. Toast, tossing once, until fragrant and lightly golden, 8–10 minutes. Let cool completely.",
        "Meanwhile, toast sesame seeds in a medium skillet over medium-low heat, stirring frequently, until fragrant and lightly golden, about 5 minutes. Add coriander, cumin, and fennel seeds and toast, stirring frequently, until sesame seeds are golden and spices are fragrant, about 2 minutes more. Transfer to a plate and let cool completely.",
        "Coarsely chop 1/4 cup pecans; set aside. Pulse sesame seed mixture, 1/2 tsp. salt, 1/2 tsp. pepper, and 1/2 cup pecans in a food processor until coarse, dry, and crumbly; do not let it become a paste.",
        "Cook green beans in a large pot of boiling salted water until crisp-tender, 5–7 minutes. Drain, then transfer immediately to a large bowl filled with ice water. Drain again and pat dry.",
        "Meanwhile, coarsely chop fennel fronds; set aside. Cut fennel bulb in half lengthwise, then thinly slice each half lengthwise.",
        "Whisk lemon zest, oil, 1/2 tsp. salt, and 1/4 tsp. pepper in a large bowl. Add green beans, fennel bulb, and half of the dukkah and toss to combine. Season with salt and pepper. Transfer salad to a serving platter, then top with fennel fronds, remaining dukkah, and remaining 1/4 cup pecans.",
        "Dukkah can be made up to 3 days ahead; store in an airtight container at room temperature."
    ],
    "ingredients": [
        "3/4 cup pecans (3 ounces)",
        "3 tablespoons sesame seeds",
        "1 tablespoon coriander seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon fennel seeds",
        "Kosher salt, freshly ground black pepper",
        "2 1/2 pounds green beans, trimmed",
        "1 medium fennel bulb with fronds",
        "Finely grated zest from 1 lemon",
        "1/3 cup extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Healthy",
        "Green Bean",
        "Pecan",
        "Sesame",
        "Fennel",
        "Kid-Friendly",
        "High Fiber"
    ],
    "title": "Green Bean Salad with Fennel and Toasted Pecan Dukkah",
    "url": "http://www.epicurious.com/recipes/food/views/green-bean-salad-with-fennel-and-toasted-pecan-dukkah"
}
