{
    "directions": [
        "Heat oven to 350°F. Cut 1/4 off each pita (a half-moon shape from 10 o'clock to 2 o'clock). Chop half-moons, transfer to a bowl and sprinkle with milk. Let soak 5 minutes. Drain and squeeze out excess milk. Purée soaked bread, onion, garlic, herbs and lemon juice in a blender or food processor. Transfer purée to a bowl. Add lamb, season with salt and pepper and combine. Form into 4 patties. Wrap pitas in foil and heat until warm, about 8 minutes. (Or place pitas between sheets of paper towel and microwave until warm, about 30 seconds.) Heat oil in a nonstick skillet over medium-high heat until hot. Cook burgers to medium, 2 to 3 minutes on each side. Whisk yogurt, mint, garlic, mustard and honey in a bowl. Stir in cucumber and season with salt and pepper. Open each pita, stuff with arugula and drizzle with some of the dressing. Add burger, tomato and red onion to pita. Sprinkle with feta. Serve leftover dressing on the side."
    ],
    "ingredients": [
        "4 whole-wheat pitas (6 1/2 inches each)",
        "1/4 cup skim milk",
        "1 small onion, finely chopped",
        "2 cloves garlic",
        "2 tablespoon chopped fresh mint",
        "4 teaspoon chopped fresh oregano or 1 teaspoon dried",
        "1 tablespoon fresh lemon juice",
        "3/4 pound lean ground lamb",
        "2 teaspoon olive oil",
        "3 cups arugula",
        "1 medium tomato, cut into 1/4-inch-thick slices",
        "1 red onion, cut into 1/4-inch-thick slices",
        "1/3 cup crumbled feta",
        "2/3 cup nonfat plain yogurt",
        "1 tablespoon chopped fresh mint",
        "2 teaspoon chopped garlic",
        "2 teaspoon Dijon mustard",
        "1 teaspoon honey",
        "1/2 cup peeled, seeded and finely diced cucumber"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Blender",
        "Food Processor",
        "Tomato",
        "Low Fat",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Feta",
        "Mint",
        "Ground Lamb",
        "Cucumber",
        "Arugula",
        "Pan-Fry",
        "Healthy",
        "Self",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Greek Burger with Arugula, Tomatoes, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/greek-burger-with-arugula-tomatoes-and-feta-241487"
}
