{
    "directions": [
        "Place an oven rack in the center of the oven and preheat to 400 degrees F. Butter a 9-by-13-inch baking dish.",
        "Bring a large pot of salted water to a boil over high heat. Cook the noodles until tender but still firm to the bite, stirring occasionally, 7 to 9 minutes. Drain and transfer to a large bowl.",
        "Heat the oil over medium-high heat in a large skillet. Add the onion, 1 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring occasionally until soft, about 4 minutes. Add the garlic and cook until aromatic, about 30 seconds. Add the lamb, cumin, coriander, cinnamon, allspice, 1 teaspoon salt and the remaining 1/4 teaspoon pepper. Cook, stirring frequently, until cooked through, about 6 minutes. Add the tomato sauce and mint. Bring the mixture to a boil. Reduce the heat and simmer for 5 minutes.",
        "For the sauce: Simmer the milk and cream over medium heat in a medium heavy-bottomed saucepan. Reduce the heat to low. Add the cheese and whisk until the cheese is melted and the sauce is smooth. Remove the pan from the heat and stir in the yogurt.",
        "Add the meat sauce to the pasta and toss well until the noodles are coated. Transfer the mixture to the baking dish. Spoon the cheese sauce evenly on top and bake until golden brown, 25 to 30 minutes. Cool for 10 minutes. Sprinkle with chopped mint if using, and serve."
    ],
    "ingredients": [
        "Butter, for greasing the baking dish",
        "Kosher salt",
        "12 ounces egg noodles",
        "2 tablespoons extra-virgin olive oil",
        "1 large onion, chopped",
        "3/4 teaspoon freshly ground black pepper",
        "3 cloves garlic, chopped or smashed",
        "1 pound ground lamb",
        "2 tablespoons ground cumin",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "One 26-ounce jar tomato-basil sauce (3 1/4 cups)",
        "1 1/2 packed cups fresh mint leaves, chopped",
        "1 cup milk, at room temperature",
        "1/2 cup heavy cream, at room temperature",
        "3 cups grated Parmesan (about 6 ounces)",
        "1 cup plain Greek yogurt, at room temperature",
        "1/4 cup chopped fresh mint leaves, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Greek Recipes",
        "Casserole",
        "Noodles",
        "Lamb Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Greek Noodle Casserole (Pastitsio)",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/greek-noodle-casserole-pastitsio-recipe"
}
