{
    "directions": [
        "Place 1 1/2 cup of flour and the salt into the work bowl of a food processor, and pulse briefly once or twice to combine. Add 9 tablespoons of chilled unsalted butter, and pulse 4 or 5 times, a few seconds per time, until the mixture looks like coarse crumbs. With the machine running, drizzle the peach nectar into the dough, 1 tablespoon at a time, until the dough gathers itself into a crumbly mass. Transfer the dough into a bowl, form into a ball, and wrap it in plastic wrap. Refrigerate to hydrate the dough, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place the 4 chopped peaches into the food processor, and pulse to puree, about 1 minute. Add the minced habanero peppers, 1 teaspoon at a time, and puree until smooth. Place the remaining 6 sliced peaches into a bowl, and toss lightly with the habanero puree.",
        "In a bowl, mix 1/3 cup of flour, the white sugar, and 1/4 cup of softened unsalted butter until it forms a crumbly mixture; set the streusel aside.",
        "Cut the dough in half, and roll each half into a circle about 10 inches in diameter. Fit one dough circle into a 9-inch pie dish. Pour the peach-habanero filling into the bottom pie crust, and sprinkle with the crumbly sugar streusel. Fit the top crust onto the pie, and crimp with a fork to seal the edges. Cut several slits into the top crust for venting steam.",
        "Bake in the preheated oven until the crust is golden brown and the filling is bubbling and thickened, about 50 minutes."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "9 tablespoons cold unsalted butter, cut into 1/4-inch cubes",
        "3 tablespoons ice-cold peach nectar, or as needed",
        "4 large  fresh peaches - peeled, pitted and chopped",
        "6 large  fresh peaches - peeled, pitted and sliced",
        "3 habanero peppers, seeded and minced (wear gloves), or to taste",
        "1/3 cup all-purpose flour",
        "1 cup white sugar",
        "1/4 cup unsalted butter, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Greg's Hot Peach Pie",
    "url": "http://allrecipes.com/recipe/217138/gregs-hot-peach-pie/"
}
