{
    "directions": [
        "Place whole poblano peppers on the grate of a stove-top gas burner set to medium-high. Rotate peppers over the flame using a set of tongs until the outer skin blackens and blisters and is charred on all sides. Transfer peppers to a paper bag, tightly close the bag, and set aside for 20 minutes. Remove peppers from bag and peel off charred skin. Trim stems and seeds; discard. Chop peppers and set aside.",
        "Melt butter over medium-high heat in a large stockpot. Add onion; cook and stir until lightly browned around the edges, 5 to 7 minutes.",
        "Pour wine into the pot over onions; bring to a boil while scraping any browned bits off of the bottom of the pot. Reduce heat to medium-low and simmer until onions are well browned, about 5 minutes.",
        "Stir in chicken stock, fresh tomatoes, canned tomatoes, poblano chiles, carrot, bay leaf, orange zest, thyme, paprika, salt, and pepper. Bring to a simmer and cook until the vegetables are soft, about 30 minutes. Remove bay leaf and discard.",
        "Pour the mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the mixture moving before leaving it on to puree. Puree in batches until smooth. Strain soup through a fine mesh sieve back into the stockpot. Alternately, use a stick blender and puree the mixture right in the pot.",
        "Return pureed soup to a simmer; stir in cream. Season with salt and black pepper to taste. Serve topped with a dollop of creme fraiche and chopped basil."
    ],
    "ingredients": [
        "1/3 cup butter",
        "1 large onion, chopped",
        "2 cups white wine",
        "3 quarts chicken stock",
        "3 large fresh tomatoes, chopped",
        "1 (28 ounce) can crushed tomatoes",
        "3 fresh poblano chile peppers",
        "1 carrot, peeled and sliced",
        "1 bay leaf",
        "1 tablespoon grated orange zest",
        "1 teaspoon chopped fresh thyme",
        "1/2 teaspoon Spanish smoked paprika",
        "salt and freshly ground black pepper to taste",
        "1/4 cup heavy cream",
        "1/2 cup creme fraiche",
        "1 tablespoon chopped fresh basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Gretchen's Tomato Orange Soup",
    "url": "http://allrecipes.com/recipe/221797/gretchens-tomato-orange-soup/"
}
