{
    "directions": [
        "Prepare barbecue (medium-high heat). Set aside 2 garlic cloves for bread slices. Place remaining garlic on double layer of heavy-duty foil; drizzle 3 tablespoons olive oil over. Fold up and seal packet. Place directly on grill rack and cook until garlic is very tender and golden, about 30 minutes. Open packet; cool garlic.",
        "Toss shrimp (in shells) and 1 tablespoon oil in medium bowl to coat; sprinkle with salt and pepper. Combine plum tomatoes, green onions, sweet onion, both bell peppers, and 2 tablespoons oil in large bowl; toss to coat. Arrange cucumber halves and bread slices on baking sheet; brush with 2 tablespoons oil. Sprinkle all vegetables with salt and pepper. Grill shrimp until just opaque, about 2 1/2 minutes per side; transfer to another bowl and cool. Grill vegetables until crisp-tender, turning frequently, about 3 minutes for plum tomatoes and green onions, 5 minutes for cucumbers, and 15 minutes for sweet onion and bell peppers. Transfer to large rimmed baking sheet. Grill bread slices until just beginning to crisp and grill marks appear, about 2 1/2 minutes per side. Rub bread with reserved garlic cloves, then discard garlic cloves.",
        "Peel shrimp; transfer to large bowl. Cut all vegetables and bread into 1/2- to 3/4-inch pieces; add to shrimp along with any accumulated juices. Stir in grilled garlic cloves and grape tomatoes. Whisk vinegar, hot pepper sauce, and remaining 4 tablespoons oil in small bowl; pour over salad and toss to coat.",
        "Do ahead: Can be made 1 1/2 hours ahead. Let stand at room temperature.",
        "Stir thinly sliced basil into salad. Season salad to taste with salt and pepper. Serve with lime wedges."
    ],
    "ingredients": [
        "2 medium heads of garlic, separated into cloves, peeled (about 24 cloves)",
        "3/4 cup olive oil, divided",
        "1 1/2 pounds uncooked large shrimp, deveined but with shells intact*",
        "8 firm plum tomatoes, halved lengthwise",
        "2 bunches green onions; root ends trimmed, onions left whole",
        "1 1-pound sweet onion (such as Vidalia or Maui), cut into 1/2-inch-thick slices",
        "1 red bell pepper, quartered, cored",
        "1 yellow bell pepper, quartered, cored",
        "1 1/2 large English hothouse cucumbers, peeled, halved lengthwise",
        "2 6x3x1-inch slices country-style bread",
        "2 cups grape tomatoes, halved (about 1 pint)",
        "1/4 cup red wine vinegar",
        "1 teaspoon hot pepper sauce",
        "1/2 cup thinly sliced fresh basil",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Garlic",
        "Herb",
        "Onion",
        "Pepper",
        "Tomato",
        "High Fiber",
        "Dinner",
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Gazpacho Salad with Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-gazpacho-salad-with-shrimp-235333"
}
