{
    "directions": [
        "In a large saucepan simmer beans in salted water with crushed garlic until tender, about 1 hour, and drain, reserving 1/4 cup cooking liquid. In a small bowl mash 1/2 cup beans with a fork and return mashed and whole beans to pan with reserved liquid. Chop 1 cup arugula and stir into beans (off heat) with garlic paste, onion, parsley, 2 tablespoons lemon juice, and salt and pepper to taste. Keep bean salad warm, covered, over very low heat while cooking arugula.",
        "Prepare grill while beans are cooking.",
        "Rinse and pat dry tuna. On a plate combine tuna steaks with remaining tablespoon lemon juice, turning to coat, and sprinkle both sides with fennel seeds, pepper, and salt to taste. Grill fish on a lightly oiled rack set 5 to 6 inches over glowing coals about 3 minutes on each side, or until barely cooked through. (Alternatively, fish may be cooked in a heated well-seasoned ridged grill pan in same manner.)",
        "Arrange bean salad and remaining cup arugula on 4 plates and top with fish. Squeeze lemon over the fish."
    ],
    "ingredients": [
        "1/2 pound dried Great Northern beans (1 1/4 cups)",
        "4 cups salted water",
        "2 garlic cloves, 1 crushed and 1 chopped and mashed to a paste with 1/2 teaspoon salt",
        "2 cups packed arugula leaves, washed well and spun dry",
        "1 small red onion, sliced thin",
        "2 tablespoons chopped fresh flat-leafed parsley leaves",
        "3 tablespoons fresh lemon juice",
        "four 4-ounce skinless tuna steaks (each about 1/2 inch thick)",
        "1 teaspoon fennel seeds, crushed",
        "freshly ground black pepper",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Low Fat",
        "Low Cal",
        "Lemon",
        "Tuna",
        "Arugula",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Grilled Tuna with Warm White Bean Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tuna-with-warm-white-bean-salad-11991"
}
