{
    "directions": [
        "In a sieve set over a bowl drain yogurt, covered and chilled, 2 hours. In a dry small heavy skillet toast cumin seeds over moderate heat, shaking skillet frequently, until a shade darker, 2 to 3 minutes. Cool cumin seeds and with a mortar and pestle or in an electric coffee/spice grinder coarsely grind. Finely grate carrots into a bowl and stir in yogurt, cumin, mint, and salt and pepper to taste. Sauce may be made 8 hours ahead and chilled.",
        "Cut off wing tips, reserving for another use, and halve wings at joint. In a bowl dissolve salt in water. Marinate wings in brine, covered and chilled, stirring occasionally, at least 2 hours and up to 24.",
        "Prepare grill.",
        "In a colander drain wings and rinse well. Pat wings dry and in a bowl rub garam masala and oil onto wings. Grill wings on an oiled rack set 5 to 6 inches over glowing coals until cooked through and golden brown, 8 to 10 minutes on each side.",
        "Serve wings with sauce."
    ],
    "ingredients": [
        "2 cups plain yogurt",
        "2 teaspoons cumin seeds",
        "2 carrots",
        "1/4 cup finely chopped fresh mint leaves",
        "3 pounds chicken wings (12 to 14)",
        "1 cup coarse salt",
        "2 cups water",
        "1 1/2 tablespoons garam masala (Indian spice mix) such as Frontier brand",
        "1 tablespoon vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Appetizer",
        "Cocktail Party",
        "Super Bowl",
        "Yogurt",
        "Backyard BBQ",
        "Carrot",
        "Summer",
        "Poker/Game Night",
        "Grill",
        "Grill/Barbecue",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Indian-Style Chicken Wings with Carrot-Cumin Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-indian-style-chicken-wings-with-carrot-cumin-yogurt-sauce-101931"
}
