{
    "directions": [
        "Prepare a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush steaks with oil; season with salt and pepper.",
        "Grill steaks until cooked to desired doneness, 5-6 minutes per side for medium-rare. Transfer steaks to a plate and let rest for 5 minutes",
        "Meanwhile, heat 1 tablespoon oil in a large cast-iron skillet set on grill alongside steaks. Add mushrooms and shallots to skillet and stir until mushrooms are tender and browned in spots and shallots are tender, 4-5 minutes. Remove skillet from heat; stir in brandy (caution: Mixture may ignite). Return skillet to grill. Add broth, Dijon mustard, and thyme leaves; stir to blend.",
        "Add cream; simmer until mushroom sauce is slightly thickened, 4-5 minutes. Season sauce to taste with salt, pepper, and cayenne.",
        "Spoon sauce onto plates; top each with a filet. Garnish with chives."
    ],
    "ingredients": [
        "4 6-ounce filets mignons",
        "1 tablespoon olive oil plus more for brushing",
        "Kosher salt and freshly ground black pepper",
        "10 ounces sliced mushrooms (such as button, crimini, or stemmed shiitake; about 4 1/2 cups)",
        "2 shallots, finely chopped (about 1/2 cup)",
        "1/2 cup brandy",
        "1/2 cup low-salt beef broth",
        "2 tablespoons Dijon mustard",
        "2 teaspoons fresh thyme leaves",
        "1/2 cup heavy cream",
        "Cayenne pepper",
        "2 tablespoons thinly sliced fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Meat",
        "Brandy",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Filet Mignon with Brandy Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-filet-mignon-with-brandy-mustard-sauce-395936"
}
