{
    "directions": [
        "Place fish, skin side down, in 13x9x2-inch glass baking dish. Whisk 2 tablespoons olive oil and next 4 ingredients in small bowl. Spread herb mixture over fish. Cover and chill at least 2 hours and up to 8 hours.",
        "Spray grill with nonstick spray. Preheat barbecue (medium heat). Brush onion slices with olive oil; sprinkle with salt and pepper. Grill onions until just tender and slightly charred, about 2 minutes per side. Grill bread slices until slightly charred, about 1 minute per side. Spread 1 side of each bread slice with butter. Sprinkle fish with fleur de sel and pepper. Grill fish until just opaque in center, about 3 minutes per side. Remove bones from fish.",
        "Place arugula in medium bowl. Drizzle with 1 tablespoon extra-virgin olive oil and lemon juice and toss; season to taste with fleur de sel and pepper. Arrange 3 arugula leaves atop each bread slice; top with grilled onions. Top onions on each bread slice with 2 sardines or 1 trout or branzino fillet, trimming fish to fit. Garnish with lemon wedges and serve."
    ],
    "ingredients": [
        "12 butterflied fresh sardines or six 6-inch-long trout or branzino fillets with skin",
        "2 tablespoons olive oil plus additional for brushing",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh Italian parsley",
        "2 teaspoons grated lemon peel",
        "1 teaspoon piment d'Espelette or 1/2 teaspoon dried crushed red pepper",
        "Nonstick vegetable oil spray",
        "6 1/3-inch-thick slices sweet onion (such as Maui or Vidalia)",
        "6 6-inch-long baguette slices, cut 1/2-inch thick on sharp diagonal",
        "3 tablespoons butter, room temperature",
        "Fleur de sel*",
        "18 arugula leaves",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon fresh lemon juice",
        "6 lemon wedges",
        "*A delicately flavored sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Fish",
        "Herb",
        "Onion",
        "Appetizer",
        "Marinate",
        "Lunch",
        "Lemon",
        "Arugula",
        "Grill/Barbecue"
    ],
    "title": "Grilled Sardine Tartines with Onion and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sardine-tartines-with-onion-and-arugula-235575"
}
