{
    "directions": [
        "Bring stock to a simmer in a small saucepan over medium-low heat; cook until reduced by half, about 5 minutes.",
        "Whisk egg yolk and mustard in a bowl. Whisking constantly, gradually add oil, drop by drop at first, until mixture is very thick. Whisk in lemon juice and garlic; season with salt and pepper. Stir in stock.",
        "Preheat oven to 200°F. Prepare grill for medium-high heat (or heat a grill pan over medium-high). Rub steak with cut sides of garlic and 1 tablespoon oil; season with salt and pepper. Grill, turning several times, until lightly charred and mediumrare (an instant-read thermometer should register 130°F), 14–16 minutes. Transfer to a rack set inside a rimmed baking sheet.",
        "Meanwhile, toss scallions on another baking sheet with 1 tablespoon oil; season with salt and pepper. Grill, turning often, until tender, about 4 minutes. Transfer to rack with beef and keep warm in oven.",
        "Arrange greens on a platter; season with salt and pepper. Drizzle with lemon juice and 1 tablespoon oil. Toss beets in a bowl with vinegar and remaining 1 tablespoon oil; season with salt and pepper. Arrange over greens. Slice steak 1/2\" thick; top greens with scallions and meat. Pour any juices over; season with salt. Serve with aioli."
    ],
    "ingredients": [
        "1/2 cup beef or chicken stock or low-sodium chicken broth",
        "1 large egg yolk",
        "1 teaspoon Dijon mustard",
        "1/2 cup vegetable oil",
        "2 teaspoons fresh lemon juice",
        "1 small garlic clove, finely grated",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "1 pound tri-tip, New York strip, or skirt steak",
        "1 garlic clove, halved",
        "4 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "1 bunch scallions or ramps",
        "1 bunch spicy greens (such as arugula or mizuna)",
        "1 tablespoon fresh lemon juice",
        "3 beets, peeled, thinly sliced",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Kid-Friendly",
        "Dinner",
        "Steak",
        "Arugula",
        "Beet",
        "Spring",
        "Summer",
        "Healthy",
        "Quick and Healthy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Steak Salad with Beets and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-salad-with-beets-and-scallions-56389546"
}
