{
    "directions": [
        "Strip leaves from stems of rosemary and thyme, then chop coarsely. Smash garlic cloves, then chop coarsely. Pulse herbs, garlic and 1/2 teaspoon oil in a food processor until smooth. Place lamb in a 13\" x 9\" glass baking dish; rub with garlic mixture; cover; refrigerate 1 hour. Remove from fridge and let sit at room temperature 30 minutes before grilling. Cook couscous as directed on package; transfer to a bowl. Toss with 2 teaspoon oil, cherry tomatoes and basil. Season with salt and pepper; set aside. Make raita: Heat oven to 375°F. Toss tomato slices with remaining 2 tablespoons oil and spread on a baking sheet; roast until tomatoes brown in spots, about 30 minutes. Grind cumin seeds to a fine powder in a coffee grinder or spice mill. Puree roasted tomato in a blender with cumin, yogurt, cucumber and sugar until smooth. Stir in mint. Season with salt and pepper. Transfer to bowl and refrigerate until ready to eat. Heat grill to medium-high heat (about 375°F). Grill lamb, about 2 minutes per side for medium. Remove from grill and let rest 10 minutes; cut into 1-inch-thick slices. Divide couscous and lamb among 4 plates. Serve with 1 tablespoon raita per plate."
    ],
    "ingredients": [
        "3 sprigs fresh rosemary",
        "3 sprigs fresh thyme",
        "4 cloves garlic",
        "2 1/2 teaspoon plus 2 tablespoons olive oil",
        "1 pound lamb tenderloin",
        "3/4 cup Israeli couscous",
        "1 cup heirloom cherry tomatoes, halved",
        "1/4 cup chopped fresh basil",
        "1 medium vine-ripened tomato, thinly sliced",
        "1 teaspoon cumin seeds, toasted 1 minute in a dry skillet",
        "1/4 cup fat-free Greek yogurt",
        "1/4 cup seeded and roughly chopped cucumber",
        "1/8 teaspoon confectioners' sugar",
        "1 tablespoon chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Backyard BBQ",
        "Dinner",
        "Cucumber",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Couscous",
        "Self",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Grilled Lamb Loin With Tomato and Cucumber Raita and Israeli Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lamb-loin-with-tomato-and-cucumber-raita-and-israeli-couscous-360369"
}
