{
    "directions": [
        "Prepare grill.",
        "In a small bowl together butter, zest, 1 teaspoon lime juice, garlic, coriander, and salt and pepper to taste.",
        "Rub both sides of swordfish steaks with remaining 2 teaspoons lime juice and season with salt and pepper. Grill swordfish on an oiled rack set 5 to 6 inches over glowing coals until just cooked through, 3 to 4 minutes on each side. (Alternatively, swordfish may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.)",
        "Top each swordfish steak with a dollop of coriander lime butter and serve with grilled onions.",
        "Prepare grill.",
        "In a small bowl stir together oil, cumin, cayenne, and salt and pepper to taste.",
        "Brush both sides of onion slices with oil mixture and grill on an oiled rack set 5 to 6 inches over glowing coals until well-charred and tender, 2 to 3 minutes on each side. (Alternatively, onion slices may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.)",
        "Separate onion slices into rings. In a bowl toss onion rings with lime juice and season with salt and pepper.",
        "Serve with grilled fish, meat, or poultry."
    ],
    "ingredients": [
        "1 1/2 tablespoons unsalted butter, softened",
        "1 teaspoon freshly grated lime zest",
        "1 tablespoon fresh lime juice",
        "1 small garlic clove, minced",
        "1 tablespoon minced fresh coriander leaves",
        "two 6-to-8 ounce swordfish steaks",
        "Accompaniment if desired: grilled spiced red onions",
        "1 tablespoon olive oil",
        "1/2 teaspoon ground cumin",
        "cayenne to taste",
        "1 large red onion, cut crosswise into four 1/2-inch-thick slices",
        "1 teaspoon fresh lime juice if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Onion",
        "Quick & Easy",
        "Backyard BBQ",
        "Lime",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Swordfish with Coriander Lime Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-swordfish-with-coriander-lime-butter-10131"
}
