{
    "directions": [
        "Bring water, brown sugar, salt, and 6 tablespoons granulated sugar to a boil in a 5-quart pot, stirring until sugar is dissolved. Transfer 6 cups brine to a 13- by 9-inch glass or ceramic baking dish, then stir in dill and cool. Transfer remaining 4 cups brine to a large bowl and add remaining 4 tablespoons granulated sugar, stirring until dissolved, then cool completely.",
        "Marinate salmon, skin sides up, in brine in baking dish, chilled, 1 hour. (Do not turn salmon.) Put eggplant in brine in bowl, then invert a small plate over eggplant and weight it with soup can (to keep eggplant immersed). Marinate eggplant at room temperature 30 minutes. (Do not brine salmon or eggplant longer than indicated or they will be too salty.)",
        "Prepare charcoal or gas grill for cooking.",
        "Remove salmon from brine and pat dry, discarding brine. Remove eggplant from brine, then rinse and pat dry, discarding brine. Toss eggplant with oil and pepper to taste in a bowl.",
        "When fire is moderate (you can hold your hand 5 inches above rack for 3 to 4 seconds), grill eggplant on lightly oiled grill rack, turning once, until golden, about 4 minutes total. Transfer to a platter with tongs and keep warm, covered.",
        "When fire is moderately low (you can hold your hand 5 inches above rack for 5 to 6 seconds), grill salmon, starting with skin sides up and turning once, until just cooked through and skin is crisp, about 8 minutes total.",
        "Serve salmon over eggplant."
    ],
    "ingredients": [
        "7 1/2 cups water",
        "3 cups packed light brown sugar (from two 1-lb boxes)",
        "1 1/2 cups kosher salt",
        "1/2 cup plus 2 tablespoons granulated sugar",
        "1 cup chopped fresh dill",
        "8 (6- to 8-oz) pieces salmon fillet with skin",
        "2 lb small eggplants, cut diagonally into 1/3-inch-thick slices",
        "2 tablespoons olive oil",
        "Accompaniment: fennel cucumber relish",
        "Special equipment: a 1-lb weight such as a soup can"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Vegetable",
        "Salmon",
        "Summer",
        "Brine",
        "Grill/Barbecue",
        "Dill",
        "Gourmet"
    ],
    "title": "Grilled Brined Salmon and Eggplant with Fennel Cucumber Relish",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-brined-salmon-and-eggplant-with-fennel-cucumber-relish-106575"
}
