{
    "directions": [
        "Arrange all vegetables on large rimmed baking sheet. Brush vegetables lightly on both sides with 1/3 cup Mango-Sesame Dressing; sprinkle with salt and pepper.",
        "Arrange chicken on sheet of foil. Brush both sides of chicken with 1/3 cup dressing, then sprinkle with salt and pepper.",
        "Vegetables and chicken can be prepared 2 hours ahead. Let stand at room temperature.",
        "Coat grill rack generously with nonstick spray and prepare barbecue (medium-high heat). Grill vegetables until just tender, turning occasionally, about 8 minutes for onion rounds and 4 minutes for mushrooms, radishes, bok choy, and pepper strips. Return all vegetables to same baking sheet.",
        "Grill chicken until cooked through, 5 to 6 minutes per side. Transfer chicken to cutting board. Let stand 5 to 10 minutes. Cool 2 chicken breasts; wrap and chill for Asian Chicken-Noodle Salad.",
        "Arrange remaining 4 chicken breasts and vegetables on platter. Serve with remaining dressing."
    ],
    "ingredients": [
        "8 1/3-inch-thick rounds red onion",
        "8 large shiitake mushrooms, stemmed",
        "8 red radishes, trimmed, halved",
        "4 baby bok choy, halved lengthwise",
        "1 large orange bell pepper, cut lengthwise into 8 strips",
        "1 1/4 cups Mango-Sesame Dressing , divided",
        "6 boneless chicken breast halves with skin",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Radish",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Bok Choy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Asian Chicken with Bok Choy, Shiitake Mushrooms, and Radishes",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-asian-chicken-with-bok-choy-shiitake-mushrooms-and-radishes-359329"
}
