{
    "directions": [
        "Whisk together all sauce ingredients in a medium saucepan. Bring to a boil, reduce to a simmer and cook for 10 to 15 minutes. Remove from heat and allow to cool to room temperature, about 15 minutes.",
        "Measure out 1/2 cup of sauce and set aside. Pour remaining sauce into a large sealable bag. Add chicken breasts to bag. Seal and refrigerate for 30 minutes.",
        "Preheat grill to medium heat and arrange four 12x12-inch pieces of Reynolds Wrap(R) Non-Stick Foil on the grill. Use tongs to transfer one chicken breast to each foil square. Discard marinade.",
        "Brush each chicken breast with some of the remaining 1/2 cup BBQ sauce. Top with mushrooms and onions. Fold foil around each chicken breast to enclose the chicken and veggies. Allow to cook over medium heat for 10 to 12 minutes or until chicken is tender and juices run clear or a meat thermometer inserted into the center reads 170 degrees F.",
        "Unwrap foil packets and place 2 slices of provolone cheese over each chicken breast so that the cheese is lying on top of the mushrooms and onions. Allow to cook uncovered 2 to 3 minutes longer or until cheese is melted. Garnish with fresh cilantro or parsley and serve."
    ],
    "ingredients": [
        "4 skinless, boneless chicken breasts, pounded to 1/2-inch thickness",
        "2 cups Kansas City BBQ Sauce, divided (see below for recipe)",
        "1/3 cup sliced white mushrooms",
        "1/2 medium onion, thinly sliced",
        "8 slices provolone cheese",
        "Fresh cilantro or parsley (optional)",
        "Reynolds Wrap® Non-Stick Foil",
        "Kansas City BBQ Sauce:",
        "1 cup ketchup",
        "1/2 cup brown sugar",
        "1/4 cup yellow mustard",
        "1/4 cup apple cider vinegar",
        "1/4 cup Worcestershire sauce",
        "2 tablespoons honey",
        "2 tablespoons dark molasses",
        "2 teaspoons chili powder",
        "2 teaspoons garlic powder",
        "1 teaspoon liquid smoke",
        "1 teaspoon onion powder",
        "1 teaspoon crushed red pepper flakes",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Kansas City Smothered BBQ Chicken",
    "url": "http://allrecipes.com/recipe/247447/grilled-kansas-city-smothered-bbq-chi/"
}
