{
    "directions": [
        "Combine first 3 ingredients in small bowl. Gradually whisk in vinegar. Let stand 15 minutes. Whisk in apple juice concentrate, brown mustard, rosemary, and oil. Season marinade to taste with coarse salt and pepper.",
        "Place lamb, boned side up, in 15x10x2-inch glass baking dish. Sprinkle with salt and pepper. Spread 1/3 cup marinade over top to coat. Turn over. Sprinkle with salt and pepper. Spread remaining marinade over lamb. Cover dish with plastic wrap; chill overnight.",
        "Spray grill rack with nonstick spray. Prepare barbecue (medium heat). Place lamb on grill with marinade still clinging (reserve dish with marinade). Grill 15 minutes. Turn lamb over. Grill 15 minutes, brushing with marinade from reserved dish. Turn lamb over again and grill until thermometer inserted into thickest part registers 130°F for medium-rare, brushing often with any remaining marinade, about 5 minutes longer per side. Transfer lamb to platter. Cover loosely with foil; let rest 15 minutes. Slice lamb thinly; arrange on platter and serve."
    ],
    "ingredients": [
        "1 tablespoon dry mustard",
        "1 teaspoon ground cardamom",
        "1/4 teaspoon ground cloves",
        "1 tablespoon apple cider vinegar",
        "1/2 cup frozen apple juice concentrate, thawed",
        "1/2 cup spicy brown mustard (such as Gulden's)",
        "1 tablespoon chopped fresh rosemary",
        "2 teaspoons olive oil",
        "Coarse kosher salt",
        "1 5-pound boneless leg of lamb, butterflied, trimmed of all fat",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mustard",
        "Marinate",
        "Low Carb",
        "Rosemary",
        "Grill/Barbecue"
    ],
    "title": "Grilled Leg of Lamb with Spiced Mustard and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-leg-of-lamb-with-spiced-mustard-and-rosemary-109792"
}
