{
    "directions": [
        "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.",
        "Place the red bell pepper onto the preheated grill, and grill until the skin is completely charred on all sides, 10 to 15 minutes. Place the pepper into a paper bag, seal the bag, and let the pepper cool. When cooled, remove the charred skin, slice the pepper into quarters, and remove the seeds. Thinly slice the pepper and set aside.",
        "Mix salt and pepper into the olive oil in a small bowl. Brush the smooth side of the mushrooms with the seasoned oil, and grill, oiled side down, until the mushrooms show grill marks, about 3 minutes. Brush the gill sides of the mushrooms with more seasoned olive oil, flip the mushrooms, and grill until the mushrooms are softened and juicy, about 3 more minutes. Set the mushrooms aside and keep warm.",
        "Lightly grill the slices of onion until softened and lightly browned, about 2 minutes per side. Spread the rolls out onto the grill to toast, about 1 minute. Mix the mayonnaise and roasted garlic in a bowl.",
        "Spread each roll with garlic mayonnaise, and make each sandwich with 1 mushroom cap, 1 ounce sliced mozzarella cheese, 1 slice of tomato, 4 basil leaves, 1 slice of grilled onion, and 1/4 the roasted red pepper slices. Repeat for remaining sandwiches."
    ],
    "ingredients": [
        "1 red bell pepper",
        "salt and black pepper to taste",
        "1/2 cup olive oil",
        "4 portobello mushroom caps, cleaned",
        "4 slices onion",
        "4 Kaiser rolls, split",
        "4 teaspoons mayonnaise",
        "1 teaspoon roasted garlic, mashed into a paste (optional)",
        "4 ounces buffalo mozzarella, thinly sliced",
        "4 slices tomato",
        "16 fresh basil leaves, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Portobello Sandwich with Roasted Red Pepper and Mozzarella",
    "url": "http://allrecipes.com/recipe/215022/grilled-portobello-sandwich-with-roas/"
}
