{
    "directions": [
        "Mix mustard and lemon juice in medium bowl. Mix in anchovy oil. Gradually whisk in olive oil. Add anchovies, chopped basil, and shallots. Season dressing with salt and pepper. Open lamb in large glass baking dish. Pour 1 1/3 cups dressing over, turning to coat both sides. Cover lamb and remaining dressing seperately and chill at leat 6 hours or overnight. Bring dressing to room temperature before using.",
        "Cook potaotes in large pot of salted water just until tender, about 15 minutes. Drain well. Transfer to large bowl. Add 1 1/2 cups reserved dressing to warm potatoes and toss gently to coat. Cook beans in large pot of boiling salted water until crisp-tender, about 8 minutes. Drain. Rinse with cold water, drain well. Add beans and mushrooms to potatoes. Mix in 1/2 cup reserved dressing. Season to taste with salt and papper.",
        "Prepare barbeque (medium-high heat). Sprinkle lamb with salt and pepper. Place lamb on grill and cook until thermometer inserted into thickest part of meat registers 135°F., brushing with remaining marinade from baking dish , about 12 minutes per side for medium-rare. Transfer to platter and let stand at least 15 minutes.",
        "Line large platter with spinach leaves. Mound potato salad in center. Cut lamb across grain in diagonal slices. Arrange sliced lamb around edges of platter. Drizzle lamb with remaining reserved dressing. Garnish salad with fresh basil sprigs and serve."
    ],
    "ingredients": [
        "3/4 cup Dijon mustard",
        "1/2 cup fresh lemon juice",
        "3 2-ounce cans anchovies, drained, oil reserved, anchovies chopped",
        "1 1/3 cups oil",
        "1 1/2 cups (packed)chopped fresh basil",
        "1 cup chopped shallots",
        "1 5 1/2-pound leg of lamb, fat trimmed, boned, and butterflied (about 3 1/2 pounds boned)",
        "3 pounds small red-skinned potatoes, cut into 3/4-inch pieces",
        "2 pounds yellow wax beans, trimmed",
        "1 pound mushrooms, sliced",
        "Spinach leaves",
        "Fresh basil sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Lamb",
        "Mushroom",
        "Mustard",
        "Potato",
        "Marinate",
        "Summer"
    ],
    "title": "Grilled Lamb, Potato, Bean and Mushroom Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lamb-potato-bean-and-mushroom-salad-101130"
}
