{
    "directions": [
        "Prepare grill for cooking. (If grilling seafood right after pizzas, mound live coals in center and add enough new briquets to evenly cover bottom of grill. Allow them 15 to 20 minutes to heat up.)",
        "Plunge live lobsters headfirst into an 8-quart pot of boiling salted water. Cook, covered, 4 minutes from time they enter water (lobsters will be only partially cooked) and transfer with tongs to a colander to drain and cool.",
        "Twist tails off each lobster and break off claws at body, discarding body. Halve tails lengthwise (including shells) with kitchen shears and lightly crack claws. (Do not remove tail or claw meat from shells.)",
        "Put clams in a disposable aluminum pie plate and drizzle with 1 tablespoon oil.",
        "Snip shells of shrimp down center of backs with kitchen shears, from wide end down to last tail section, and devein.",
        "Pat lobsters, shrimp, scallops, and fish dry, then brush with remaining 4 tablespoons oil and season with salt and pepper.",
        "Put lobster claws and tails (cut sides up), shrimp, and clams (in pie plate) on rack of grill, 5 to 6 inches over glowing coals, and cover grill. Cook, turning once, until just cooked through, about 5 minutes for claws (liquid will bubble at open ends), 5 to 6 minutes for tails and shrimp (meat will be opaque), and 6 to 8 minutes for clams, or until opened (discard any unopened ones).",
        "Transfer as cooked to a platter and keep warm, covered.",
        "Put scallops and fish in center of rack and cover grill. Cook, turning once, until just cooked through and meat is opaque, about 4 minutes for scallops and about 12 minutes for fish. Transfer with a large metal spatula to platter.",
        "Mound bulgur salad in center of 8 plates and arrange seafood on top and around it. Spoon over some vinaigrette (serve remainder on the side) and sprinkle seafood and bulgur with pine nuts."
    ],
    "ingredients": [
        "2 (1 1/3-lb) live lobsters",
        "1 1/2 lb small hard-shelled clams such as littlenecks (16), well scrubbed",
        "5 tablespoons olive oil",
        "1 lb jumbo shrimp (8 to 12), with shells",
        "1 lb large sea scallops (10 to 12)",
        "2 (2-lb) whole red snappers, cleaned and heads removed",
        "Vegetable bulgur salad",
        "1 3/4 cupstomato, caper, and olive vinaigrette",
        "1/2 cup pine nuts, toasted and salted",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Shellfish",
        "Tomato",
        "Summer",
        "Grill/Barbecue",
        "Capers",
        "Gourmet"
    ],
    "title": "Grilled Seafood with Tomato, Caper and Olive Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-seafood-with-tomato-caper-and-olive-vinaigrette-103667"
}
