{
    "directions": [
        "Place the dried mushrooms into the boiling water and set aside until softened, about 20 minutes. Once softened, squeeze excess water from mushrooms and finely chop. Reserve the mushroom-flavored water.",
        "Preheat an outdoor grill for medium-high heat and lightly oil grate.",
        "Season chicken breasts with salt and pepper. Grill chicken breasts until no longer pink in the center, about 6 minutes per side. Once cooked, set aside.",
        "Pour chicken broth into a large pot, and bring to a boil over high heat. Stir in sun-dried tomatoes, tomato paste, and reserved mushroom liquid. Reduce heat to medium-low, and simmer for 15 minutes.",
        "Meanwhile, heat the olive oil in a large skillet over medium heat. Stir in garlic and onion, and cook until the onion has softened and turned translucent, about 5 minutes. Stir in the chopped mushrooms, artichokes, pepper, parsley, lemon juice, and white wine. Bring to a boil over high heat, then reduce heat and simmer 10 minutes; add to the simmering chicken broth.",
        "Slice the grilled chicken breasts into strips and stir into the simmering soup. Sprinkle with Parmesan cheese before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1910&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1024576.jpg",
    "ingredients": [
        "1 ounce dried porcini mushrooms",
        "1 cup boiling water",
        "1 pound skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "6 cups chicken broth",
        "½ cup sun-dried tomatoes (not packed in oil), snipped into small pieces",
        "2 tablespoons tomato paste",
        "⅓ cup olive oil",
        "2 cloves cloves garlic, minced",
        "1  red onion, minced",
        "2 (13.75 ounce) cans artichoke bottoms, drained and chopped",
        "¼ teaspoon black pepper",
        "½ cup chopped fresh parsley",
        "2 tablespoons fresh lemon juice",
        "½ cup dry white wine",
        "½ cup grated Parmesan cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Chicken and Artichoke Soup",
    "url": "http://allrecipes.com/recipe/146711/grilled-chicken-and-artichoke-soup/"
}