{
    "directions": [
        "Whisk first 4 ingredients in small bowl to blend. Whisk in olive oil, then truffle oil, if desired. Season with salt and pepper.",
        "Bring small saucepan of water to boil. Add pearl onions and boil 3 minutes. Drain; cool onions slightly. Peel onions, leaving root ends intact.",
        "Do ahead: Dressing and onions can be made 2 hours ahead. Cover separately and let stand at room temperature.",
        "Prepare barbecue (medium heat). Thread onions on skewers; thread shrimp on separate skewers. Place onion skewers, shrimp skewers, corn, and bread slices on 2 large rimmed baking sheets. Brush onions, shrimp, corn, and bread with olive oil, then sprinkle with salt and pepper. Sprinkle shrimp on both sides with smoked paprika. Grill onions and corn until cooked through, about 5 minutes per side; grill bread slices until browned; and grill shrimp until cooked through, about 2 1/2 minutes per side.",
        "Transfer vegetables, shrimp, and bread to work surface. Cut corn kernels off cobs; place corn kernels in very large bowl. Remove shrimp and onions from skewers and add to bowl. Add mâche and avocados to bowl. Toss salad with enough dressing to coat. Season to taste with salt and pepper. Transfer salad to large rimmed platter and serve with bread.",
        "*Available at some supermarkets, Italian markets, and specialty foods stores.",
        "**Available at some supermarkets and specialty foods stores or online from tienda.com."
    ],
    "ingredients": [
        "6 tablespoons orange juice",
        "3 1/2 tablespoons white wine vinegar",
        "2 tablespoons chopped fresh chives",
        "1 1/2 teaspoons finely grated orange peel",
        "1/4 cup olive oil",
        "1/2 teaspoon truffle oil* (optional)",
        "1 10-ounce bag red pearl onions",
        "Metal skewers",
        "2 pounds uncooked large shrimp, peeled, deveined",
        "3 large ears of corn, husked",
        "1 ciabatta bread or pain rustique, cut crosswise into 1-inch-thick slices",
        "Olive oil",
        "2 teaspoons hot smoked paprika (Pimentn de la Vera)**",
        "12 cups mâche (about 7 ounces)",
        "2 avocados, halved, pitted, peeled, cut into 3/4-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Leafy Green",
        "Herb",
        "Shellfish",
        "Vegetable",
        "Seafood",
        "Shrimp",
        "Avocado",
        "Corn",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Shrimp Salad with Corn and Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-salad-with-corn-and-avocado-235584"
}
