{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Add garlic and crushed red pepper and stir until fragrant, about 30 seconds. Add mustard greens, chard, and collard greens and toss until beginning to wilt, about 2 minutes. Remove from heat. (Can be prepared 2 hours ahead. Let stand at room temperature.)",
        "Prepare barbecue (medium-high heat). Grill prosciutto until beginning to crisp, about 1 minute per side. Transfer prosciutto to plate. Tear each slice lengthwise into 1-inch-wide strips; add to pot with greens. Grill clams in batches, if necessary, until each opens, about 6 minutes (discard any clams that do not open). Transfer clams from grill to pot.",
        "Meanwhile, cook spaghetti in another large pot of boiling salted water until just tender but still firm to bite. Drain, reserving 2 cups pasta cooking water. Add pasta to pot with greens, prosciutto, and clams. Squeeze juice from 1 lemon half over. Add parsley. Toss over medium-high heat until heated through, adding reserved pasta cooking water by 1/2 cupfuls if dry. Season with salt and pepper and more lemon juice, if desired. Transfer pasta mixture to large shallow bowl and serve."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "4 garlic cloves, chopped",
        "3/4 teaspoon dried crushed red pepper",
        "8 large leaves mustard greens, stems cut from leaves and discarded, leaves coarsely torn",
        "4 large leaves Swiss chard, stems cut from leaves and discarded, leaves coarsely torn",
        "4 large leaves collard greens, stems cut from leaves and discarded, leaves coarsely torn",
        "1/2 pound thinly sliced prosciutto",
        "40 large littleneck clams (about 8 3/4 pounds), scrubbed",
        "1 pound spaghetti",
        "1 lemon, halved",
        "1/2 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pasta",
        "Pork",
        "Shellfish",
        "Clam",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Clams with Spaghetti, Prosciutto, and Mixed Greens",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-clams-with-spaghetti-prosciutto-and-mixed-greens-108287"
}
