{
    "directions": [
        "Prepare the tri-tip and vegetables",
        "Prepare a gas or charcoal grill for direct-heat grilling over medium-high heat, or preheat a broiler.",
        "Season the tri-tip generously with salt and pepper. Let stand at room temperature for 10 minutes. Brush the zucchini, eggplant, bell pepper and onion with the olive oil. Sprinkle with the rosemary and season with salt and pepper.",
        "Grill the tri-tip",
        "Place the tri-tip over the hottest part of the fire or under the broiler. Cover the grill and cook, turning once or twice with tongs, for about 30 minutes total for medium-rare, or until done to your liking. Transfer 1 roast to a carving board and let stand for 5 to 10 minutes before slicing. Set the second roast aside to cool, then store for later use (see note above).",
        "Grill the vegetables",
        "While the tri-tip is resting, place the vegetables on the grill rack, away from the hottest part of the fire, or under the broiler. Grill, turning once or twice, until lightly charred and tender, 4 to 6 minutes. Transfer to a platter or to the edge of the grill to keep them warm.",
        "Thinly slice the tri-tip across the grain and serve with the vegetables. Serves 4 to 6; makes about 6 cups thinly sliced beef total.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Simple Suppers,",
        "by Melanie Barnard (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 tri-tip roasts, each about 2 lb.",
        "Salt and freshly ground pepper, to taste",
        "1 zucchini, sliced lengthwise about 1/4 inch thick",
        "1 small eggplant, sliced lengthwise about 1/4  inch thick",
        "1 orange or yellow bell pepper, seeded and  quartered lengthwise",
        "1 small sweet onion, such as Vidalia, sliced  crosswise about 1/4 inch thick",
        "1/4 cup olive oil",
        "1 Tbs. chopped fresh rosemary (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Tri-Tip & Vegetables",
    "url": "http://www.williams-sonoma.com/recipe/grilled-tri-tip-and-vegetables.html"
}
