{
    "directions": [
        "Teriyaki Chicken Tacos: Toss chicken with VH(R) Teriyaki Stir-Fry Sauce; refrigerate for at least 30 minutes or for up to 8 hours.",
        "Purple Cabbage Slaw: Meanwhile, whisk together mayonnaise, lime juice, garlic and salt; toss with cabbage. Let stand for 30 minutes.",
        "Spray grate of outdoor grill with PAM(R) Grilling for Grill Spray. Preheat grill to medium heat. Grill chicken for 5 to 7 minutes per side or until chicken is cooked through. Let stand for 5 minutes. Slice chicken.",
        "Fill tortillas with sliced chicken, some of the cabbage slaw, avocado, cucumber and green onion. Serve with remaining cabbage slaw and lime wedges.",
        "Grilled Zucchini, Eggplant and Red Onion Fusilli: Preheat grill to medium-high heat. Season zucchini, eggplant and red onion with salt and pepper; spray with PAM(R) Olive Oil cooking spray.",
        "Grill vegetables for 3 to 5 minutes per side or until grill-marked and tender. (Eggplant should be soft; cook eggplant for 1 to 2 minutes longer if necessary.) Let vegetables cool slightly; chop coarsely. Meanwhile, cook fusilli according to package directions and drain.",
        "Meanwhile, in large, deep skillet, heat Aylmer(R) Accents(R) Garlic and Olive Oil Petite Cut Tomatoes over medium heat until simmering. Simmer for 5 minutes. Add vegetables and cook for 5 minutes; toss with pasta.  Sprinkle with shaved cheese before serving."
    ],
    "ingredients": [
        "Teriyaki Chicken Tacos",
        "1 (160 mL) pouch VH® Teriyaki Stir-Fry Sauce",
        "PAM® for Grilling",
        "8 ounces skinless boneless chicken breast",
        "4 (7 inch) flour tortillas, warmed",
        "1/2 avocado - peeled, pitted and sliced",
        "1/3 cup diced cucumber",
        "1 green onion, finely chopped",
        "Purple Cabbage Slaw",
        "2 tablespoons mayonnaise",
        "1 tablespoon lime juice",
        "1 clove garlic, minced",
        "pinch of salt",
        "2 cups shredded purple cabbage",
        "Lime wedges",
        "Grilled Zucchini, Eggplant and Red Onion Fusilli with Parmesan Cheese",
        "1 zucchini, sliced lengthwise into strips, about 1/4-inch (5 mm) thick",
        "1 small eggplant, sliced into rounds, about 1/2-inch (1 cm) thick",
        "1 red onion, sliced into rounds, about 1/2-inch (1 cm) thick",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly ground pepper",
        "PAM® Olive Oil",
        "1/2 (375 g) package Catelli Bistro® Fusilli",
        "1 (540 mL) can Aylmer® Accents® Garlic and Olive Oil Petite Cut Tomatoes",
        "1/3 cup shaved Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Zucchini, Eggplant and Red Onion Fusilli with Parmesan Cheese with Teriyaki Chicken Tacos",
    "url": "http://allrecipes.com/recipe/247080/grilled-zucchini-eggplant-and-red-on/"
}
