{
    "directions": [
        "Prepare barbecue (medium heat). Brush both sides of portobello mushrooms with 1/3 cup olive oil. Place whole mushrooms and whole red bell peppers on grill rack. Grill until mushrooms are tender and bell peppers are blackened on all sides, turning occasionally, about 20 minutes for mushrooms and 25 minutes for bell peppers. Transfer mushrooms to plate. Enclose bell peppers in paper bag. Let stand 10 minutes. Peel and seed peppers. Cut into 1/2-inch-wide strips. Cut mushrooms into 1/2-inch-wide strips. Season mushrooms and peppers to taste with salt and pepper.",
        "Combine 1 tablespoon red wine vinegar, chopped fresh rosemary and garlic clove in food processor. With machine running, gradually add remaining 1/3 cup olive oil and process until well blended. Season dressing to taste with salt and pepper.",
        "Arrange mixed baby greens on large platter. Top with portobello mushroom strips, then red bell pepper strips. Drizzle dressing over and serve."
    ],
    "ingredients": [
        "7 large portobello mushrooms (about 2 pounds total), stemmed",
        "2/3 cup olive oil",
        "2 large red bell peppers",
        "1 tablespoon red wine vinegar",
        "1 tablespoon chopped fresh rosemary",
        "1 garlic clove, peeled",
        "1 4- to 5-ounce package mixed baby greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Mushroom",
        "Appetizer",
        "Side",
        "Bell Pepper",
        "Summer",
        "Grill/Barbecue",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Portobello and Red Bell Pepper Salad with Rosemary Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-portobello-and-red-bell-pepper-salad-with-rosemary-dressing-101848"
}
