{
    "directions": [
        "In a small bowl whisk together marinade ingredients.",
        "Rinse quail and pat dry. Arrange quail in a flat-bottomed dish large enough to hold them in one layer and add marinade, turning quail to coat well. Marinate quail, covered and chilled, turning them once or twice, at least 1 day and up to 2.",
        "Prepare grill and bring quail to room temperature (about 30 minutes).",
        "Remove quail from marinade, discarding marinade, and pat dry with paper towels. Season quail with salt and pepper and grill on an oiled rack set about 5 to 6 inches over glowing coals 3 to 4 minutes on each side, or until just cooked through. Meat should still be pink. (Alternatively, grill quail in batches without crowding in a hot oiled well-seasoned ridged grill pan.) Transfer quail as cooked to a plate and keep warm, covered.",
        "In a cup or very small bowl stir together vinegar and honey. In a 12-inch heavy skillet cook bacon over moderate heat, stirring, until crisp. Transfer bacon with a slotted spoon to a small bowl and pour off all but about 2 tablespoons bacon fat from skillet.",
        "Heat bacon fat remaining in skillet over moderately high heat until hot but not smoking and cook caraway seeds, stirring, until fragrant, about 30 seconds. Add red cabbage, carrots, vinegar mixture, and salt and pepper to taste and sauté, stirring, until cabbage is just wilted, about 1 minute.",
        "Remove skillet from heat and add Napa cabbage and scallions, tossing until cabbage is wilted slightly.",
        "Divide slaw among 6 plates. Cut each quail into 4 serving pieces and arrange decoratively over slaw. Top salads with bacon."
    ],
    "ingredients": [
        "1/4 cup cider vinegar",
        "1/4 cup molasses",
        "1/4 cup olive oil",
        "1 teaspoon ground allspice",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "6 semi-boneless quail*",
        "3 tablespoons cider vinegar",
        "2 teaspoons honey",
        "4 bacon slices, chopped coarse",
        "1 teaspoon caraway seeds, crushed lightly",
        "3 cups very thinly sliced red cabbage",
        "2 medium carrots, shredded fine",
        "3 cups very thinly sliced Napa cabbage",
        "4 scallions, sliced thin",
        "*available at some butcher shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Marinate",
        "Thanksgiving",
        "Quail",
        "Fall",
        "Grill/Barbecue",
        "Healthy",
        "Cabbage",
        "Gourmet"
    ],
    "title": "Grilled Quail with Wilted Cabbage Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-quail-with-wilted-cabbage-slaw-13430"
}
