{
    "directions": [
        "Prepare a medium-hot fire in a grill.",
        "In a large bowl, combine the milk and bread and stir until evenly moistened. Set aside.",
        "Finely dice half of 1 onion. In a small saucepan over medium-high heat, warm 1 Tbs. of the olive oil. Add the onion and a pinch of salt and cook, stirring occasionally, until the onion is softened, about 6 minutes, reducing the heat as needed to prevent browning. Let cool to room temperature.",
        "Add the cooked onion, ground beef, parsley, thyme, the 1 tsp. salt and pepper to the bowl with the bread mixture. Using a spoon or your hands, gently mix just until the ingredients are combined.",
        "Spray the wells of a meatball grill basket with nonstick cooking spray. Using about 3 Tbs. of the meat mixture for each meatball, form the mixture into balls in the bottom half of the wells (the side with the handle). Close the lid on the basket.",
        "Thinly slice the remaining onions. In a bowl, stir together the onions and the remaining 3 Tbs. olive oil. Transfer the onions to a mesh grill-top fry pan and place on the grill. Cover the grill and cook, stirring occasionally, for 15 minutes. Season the onions with salt and pepper; keep the onions on the grill. Place the meatball basket on the grill. Cover the grill and cook, turning the meatball basket over once, until the meatballs are cooked through, about 14 minutes total. Meanwhile, continue cooking the onions, stirring occasionally, until caramelized.",
        "Remove the meatball basket from the grill but keep the onions on the grill. Pour the barbecue sauce into a 5-quart Dutch oven, add the meatballs to the pot and place on the grill. Heat until the sauce is warm, 2 to 3 minutes.",
        "Arrange the sandwich rolls, cut side down, on the grill and toast until golden, 2 to 4 minutes. To assemble the sandwiches, layer the onions, meatballs and cheese on the rolls, dividing evenly; spoon on more sauce, if desired. Place the sandwiches on the unheated side of the grill, cover and heat until the cheese is melted, 2 to 4 minutes. Serve immediately. Serves 6."
    ],
    "ingredients": [
        "1/4 cup milk",
        "1 cup torn pieces of crustless white bread (1/2-inch pieces)",
        "2 yellow onions",
        "4 Tbs. olive oil",
        "1 tsp. salt, plus more, to taste",
        "1 lb. ground beef",
        "2 Tbs. chopped fresh flat-leaf parsley",
        "1/2 tsp. chopped fresh thyme",
        "Freshly ground pepper, to taste",
        "1 jar smoky bacon barbecue sauce",
        "4 sourdough sandwich rolls, each about 5 inches long, halved lengthwise",
        "4 slices provolone cheese, each 1 oz., cut into 1-inch strips"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Meatball Subs",
    "url": "http://www.williams-sonoma.com/recipe/grilled-meatball-subs.html"
}
