{
    "directions": [
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.",
        "Cut kielbasa crosswise into 4 long sections, then halve each section lengthwise. If using kosher salami, cut lengthwise into 8 (1/4-inch-thick) slices. Trim off skin if desired.",
        "Whisk together oil, mustard, horseradish, vinegar, honey, salt, and pepper in a small bowl until emulsified. Toss lettuce with half of vinaigrette and reserve remainder.",
        "Grill tops and bottoms of rolls on lightly oiled grill rack, covered only if using a gas grill, turning over once, about 2 minutes total, then transfer, cut sides up, to a platter. Brush cut sides of top halves with remaining vinaigrette and mound salad on bottom halves.",
        "Grill sausage on lightly oiled grill rack, covered only if using a gas grill, turning over once, 3 to 4 minutes total, then arrange on top of lettuce (2 pieces per sandwich) and cover with top halves of rolls. Cut sandwiches in half crosswise."
    ],
    "ingredients": [
        "3/4 to 1 lb whole smoked kielbasa or kosher salami",
        "2 tablespoons olive oil",
        "1 tablespoon Dijon mustard",
        "1 tablespoon drained bottled horseradish",
        "2 teaspoons white-wine vinegar",
        "1 teaspoon honey",
        "1/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1 small head Boston lettuce, torn into small pieces",
        "4 (6-inch-long) crusty rolls, such as Portuguese, halved horizontally"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Mustard",
        "Quick & Easy",
        "Horseradish",
        "Sausage",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Grilled Kielbasa Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-kielbasa-sandwiches-109534"
}
