{
    "directions": [
        "Prepare barbecue (medium heat). Brush peppers, zucchini, and bread on both sides with oil. Sprinkle lightly with salt and pepper. Grill peppers and zucchini until slightly charred and just tender, turning often, about 6 minutes. Transfer vegetables to foil-lined baking sheet. Grill bread until lightly charred and just crisp, turning often, about 3 minutes. Transfer to sheet with vegetables and cool. Tear bread into 1-inch pieces. DO AHEAD Vegetables and bread can be made 2 hours ahead. Let stand at room temperature.",
        "Cut peppers lengthwise into 1/2-inch-wide strips, then crosswise into 1/2-inch pieces. Cut zucchini lengthwise in half, then crosswise into 1/2-inch pieces. Place in large bowl. Add cucumber, tomatoes, green onions, olives, mint, and cilantro and toss to combine. Add bread pieces. Whisk 1/2 cup oil, lemon juice, and cumin in small bowl to blend. Season dressing to taste with salt and pepper. Add dressing to salad; toss to coat. Add feta and gently mix into salad.",
        "Transfer salad to large bowl. Serve, passing ground sumac for sprinkling over, if desired."
    ],
    "ingredients": [
        "3 medium orange or red bell peppers (about 1 pound), stemmed, seeded, quartered",
        "4 to 5 slender zucchini (about 1 pound), trimmed, cut lengthwise in half",
        "2 (5- to 6-inch) pita breads, each cut horizontally into 2 disks, or two 6x4x1/2-inch slices country white bread",
        "Olive oil (for grilling)",
        "1 (8-ounce) cucumber, peeled, halved, seeded, cut into 1/2-inch cubes",
        "12 cherry tomatoes, each halved",
        "3 green onions, thinly sliced",
        "1 cup (scant) pitted Kalamata olives, halved",
        "1/2 cup (packed) fresh mint leaves",
        "1/3 cup chopped fresh cilantro",
        "1/2 cup olive oil",
        "1/4 cup fresh lemon juice",
        "1 teaspoon ground cumin",
        "1 4-ounce piece feta cheese, cut into 1/2-inch cubes (scant 1 cup)",
        "Ground sumac* (optional)",
        "*A fruity, tangy seasoning powder made from ground dried sumac berries; available at Middle Eastern markets and from adrianascaravan.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Citrus",
        "Olive",
        "Pepper",
        "Tomato",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Feta",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Zucchini and Bell Pepper Fattoush",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-zucchini-and-bell-pepper-fattoush-238777"
}
