{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Core tomatoes, then halve crosswise. Stud the cut side of each half with garlic slivers, then sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper (total). Arrange tomatoes, cut sides up, in a lightly oiled shallow baking pan, then drizzle evenly with 1 tablespoon oil. Roast until just soft and wilted, 15 to 20 minutes.",
        "While tomatoes roast, cook beans in a 6- to 8-quart pot of boiling salted water , uncovered, until just tender, 5 to 8 minutes. Drain in a colander and cool slightly, about 10 minutes. When beans are cool enough to handle, gently slip off skins. Coarsely chop beans and roasted tomatoes, then toss with basil, remaining tablespoon oil, remaining 1/2 teaspoon salt, remaining 1/4 teaspoon pepper, and lemon juice (to taste).",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine charcoal heat. It is medium-hot when you can hold your hand there for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce to moderate setting.",
        "Pat fish dry and season both sides with salt and pepper. Grill on lightly oiled grill rack, covered only if using gas grill, turning over once, until just cooked through, 6 to 8 minutes total.",
        "Serve fish topped with bean and roasted tomato sauce."
    ],
    "ingredients": [
        "4 large tomatoes (preferably heirloom; 2 lb total)",
        "3 garlic cloves, cut lengthwise into slivers",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons olive oil",
        "2 lb fresh lima or fava beans in pod, shelled, or 10 oz frozen baby lima beans or shelled edamame (soybeans; 2 cups), not thawed",
        "1/2 cup chopped fresh basil",
        "1 to 2 tablespoons fresh lemon juice",
        "6 (6-oz) pieces halibut fillet (1 1/4 to 1 1/2 inches thick)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Tomato",
        "Low Cal",
        "Basil",
        "Halibut",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Grilled Halibut with Lima Bean and Roasted Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-halibut-with-lima-bean-and-roasted-tomato-sauce-232791"
}
