{
    "directions": [
        "Prepare grill.",
        "Shuck corn, reserving largest outer husks (about 20 to 24) for wrapping salmon and tearing some remaining husks lengthwise into narrow strips for tying packages. Grill corn on a rack set 5 to 6 inches over glowing coals, turning it frequently, until browned (not blackened) all over, about 12 minutes, and cool to room temperature. Cut kernels from cobs (there will be about 1 3/4 cups) and in a bowl stir together with chipotle rub and butter until combined well.",
        "On a work surface arrange 5 to 6 large husks side by side, overlapping long sides. Arrange a salmon piece in the center with length parallel to long sides of husks and top with on fourth corn mixture, one fourth epazote, and one fourth scallion. Fold long sides and ends of husks over filling and tie with strips of husks. (Don't be a perfectionist about this. If it's not possible to fold in ends of husks, tie off each end and middle with husk strips.) Make 3 more packages in same manner with remaining husks, corn mixture, epazote, and scallion.",
        "Grill packages around edges (to avoid hottest part of coals) of a rack set 5 to 6 inches over glowing coals, covered, turning them once, until husks are charred and salmon is just cooked through, about 6 minutes on each side. (Packages may open while cooking, and butter might drip, causing flare-ups.)",
        "Serve salmon packages with salsa.",
        "In a small heavy skillet dry-roast oregano over moderate heat, shaking skillet occasionally, until fragrant and beginning to brown, about 2 minutes, and transfer to a small bowl. Cool oregano completely and in an electric coffee/spice grinder grind fine.",
        "In a heavy skillet heat oil over moderately high heat until hot but not smoking and, using tongs, fry chiles, 1 or 2 at a time, turning them, until puffed and just beginning to brown, about 10 seconds. (Do not let chiles burn or rub will be bitter.) Transfer chiles as fried to paper towels to drain and cool until crisp.",
        "Wearing rubber gloves, break chiles into pieces and in coffee/spice grinder grind fine in batches. In a food processor grind oregano and chiles with garlic and salt until mixture is a shaggy, saltlike consistency. If mixture seems moist, on a large baking sheet spread it into a thin, even layer and dry in middle of an oven set a lowest temperature until no longer moist, about 1 hour. Wearing rubber gloves, break up any lumps with your fingers. (Chipotle rub keeps in an airtight container, chilled, 6 months. Regrind rub before using.) Makes about 3 1/4 cups."
    ],
    "ingredients": [
        "2 large ears corn, unshucked",
        "1 stick (1/2 cup) unsalted butter, softened",
        "a 3/4-pound piece center-cut salmon filet, cut into 4 pieces (each about 4 by 1 1/2 by 1 inch)",
        "4 fresh epazote leaves*, chopped",
        "1 tablespoon thinly sliced scallion",
        "Accompaniment: Tomatillo Salsa",
        "1 1/2 teaspoons chipotle rub",
        "1/4 cup dried Mexican oregano*",
        "1/4 cup corn oil",
        "5 dried chipotle chiles*, stemmed, seeded, and deveined (wear rubber gloves)",
        "5 ancho chiles*, seeded and deveined (wear rubber gloves)",
        "25 garlic cloves",
        "1 1/2 cups coarse salt",
        "available at Mexican markets and some specialty produce markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Herb",
        "Backyard BBQ",
        "Salmon",
        "Corn",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Grilled Salmon in Corn Husks",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-salmon-in-corn-husks-12684"
}
