{
    "directions": [
        "1. For the sauce, soak the beans in a generous amount of water overnight.",
        "2. Using poultry sheers, cut each chicken along the backbone and remove as much of the backbone as possible. Press the chickens with your fist to flatten them slightly and then place them in a large glass dish that will fit in the refrigerator.",
        "3. Combine the lemon juice, olive oil, oregano, wine, garlic, onion, and some salt and pepper in a blender and purée to make a paste. Spread the paste over the chicken and massage it into the meat. Cover the dish and refrigerate for at least 2 hours, or, preferably, overnight.",
        "4. The next day, drain the beans, put them in a saucepan, and add enough fresh water to cover the beans by about 3 inches. Bring to a boil over medium heat and cook for 10 minutes, then reduce the heat, and simmer the beans until completely soft, 1 to 1 1/2 hours. Drain well.",
        "5. Put the beans, almonds, garlic, and vinegar in a food processor and process to a smooth paste. Gradually add the olive oil and lemon juice through the hole in the lid, processing to a thick sauce. Add the flaxseed oil and season with salt and pepper. Set aside.",
        "6. Preheat the broiler until very hot, prepare the grill, or preheat the oven to 350°F.",
        "7. Wipe away excess marinade from the chicken, then cook under the broiler, on the barbecue or in a roasting pan in the oven until cooked through, approximately 45 minutes. Test by piercing the thickest part of the flesh with a knife: when the chicken is cooked, the juices will run clear.",
        "8. Cut the chickens in half, sprinkle with the herbs, and serve with the sauce and lemon wedges."
    ],
    "ingredients": [
        "9 ounces dried large white beans, such as lima beans",
        "1/2 cup ground almonds",
        "2 garlic cloves",
        "1 tablespoon white wine vinegar",
        "Scant 1/2 cup olive oil",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon cold-pressed flaxseed oil",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground white pepper",
        "2 spring chickens (poussins), (about 2 pounds each)",
        "Juice of 1 lemon",
        "3 tablespoons olive oil",
        "1/2 teaspoon dried oregano",
        "3 tablespoons dry white wine",
        "2 garlic cloves, finely chopped",
        "1 onion, finely chopped",
        "Salt and pepper",
        "2 tablespoons chopped fresh herbs, such as parsley, thyme, or oregano",
        "Lemon wedges, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Garlic",
        "Nut",
        "Poultry",
        "Vegetable",
        "Broil",
        "Marinate",
        "Roast",
        "Backyard BBQ",
        "Tree Nut",
        "Almond",
        "Chill",
        "Grill/Barbecue",
        "Advance Prep Required"
    ],
    "title": "Grilled Chicken with Almond and Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-with-almond-and-garlic-sauce-363322"
}
