{
    "directions": [
        "Whisk lime juice, lime peel, and piment d'Espelette in small bowl. Gradually whisk in oil. Season with fleur de sel and pepper. DO AHEAD: Can be made 1 day ahead. Chill. Bring to room temperature before using.",
        "Blanch basil in small pot of boiling salted water 30 seconds; drain. Squeeze to remove as much water as possible, then coarsely chop. Puree basil and oil in blender until smooth. Transfer to small bowl. Season to taste with fleur de sel. DO AHEAD: Can be made 1 day ahead. Cover and chill. Return to room temperature before using.",
        "Prepare barbecue (medium-high heat). Brush scallops and nectarines with oil; sprinkle with salt and pepper. Grill scallops until slightly charred and cooked through, about 2 minutes per side. Grill nectarines until slightly charred, about 1 1/2 minutes per side. Transfer scallops and nectarines to plate.",
        "Arrange 4 scallops on each of 6 plates. Toss corn and 2 tablespoons dressing in medium bowl. Toss tomatoes with 1 tablespoon dressing in another bowl; season to taste with salt and pepper. Spoon corn around scallops. Scatter tomatoes over corn. Arrange nectarine wedges decoratively on plates. Drizzle some dressing over scallops, then spoon some basil puree over. Sprinkle sliced basil and fleur de sel over corn and tomatoes and serve.\n\nA type of sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "3 tablespoons fresh lime juice",
        "1 1/2 teaspoons finely grated lime peel",
        "1/8 teaspoon (generous) piment d'Espelette or chili powder",
        "3 tablespoons extra-virgin olive oil",
        "Fleur de sel*",
        "24 large sea scallops, side muscles removed, patted dry",
        "3 firm but ripe nectarines (white or yellow), each cut into 6 wedges",
        "Olive oil, for brushing",
        "1 1/2 cups fresh corn kernels, cut from 2 large ears of corn",
        "24 grape or cherry tomatoes, halved",
        "1/3 cup thinly sliced basil leaves",
        "Fleur de sel",
        "3/4 cup (loosely packed) fresh basil leaves",
        "1/4 cup extra-virgin olive oil",
        "Fleur de sel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Nectarine",
        "Seafood",
        "Scallop",
        "Corn",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy"
    ],
    "title": "Grilled Scallops and Nectarines with Corn and Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-scallops-and-nectarines-with-corn-and-tomato-salad-242982"
}
