{
    "directions": [
        "To make the salsa verde, in a small bowl, combine the parsley, capers, olives, anchovies, garlic, mint, vinegar and olive oil. Using a fork, mix together until all the ingredients are evenly distributed. Season with the salt and pepper. Set aside for 20 to 30 minutes to allow the flavors to blend.",
        "Prepare a hot fire in a grill and oil the grill rack. Season the flank steak on both sides with the salt and pepper.",
        "By charcoal grill:",
        "Using tongs, place the steak over the hottest part of the fire and grill, turning once, 5 to 7 minutes per side for medium-rare, 6 to 8 minutes per side for medium and 8 to 10 minutes per side for well done. To test for doneness, cut into the steak at the thickest part.",
        "By gas grill:",
        "Using tongs, place the steak directly over the heat elements and grill, turning once, 5 to 7 minutes per side for medium-rare, 6 to 8 minutes per side for medium and 8 to 10 minutes per side for well done. To test for doneness, cut into the steak at the thickest part.",
        "Transfer the steak to a platter and let rest for about 10 minutes to reabsorb the juices. Cut the steak across the grain into thin slices. Serve with the salsa verde. Serves 4.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Healthful Cooking",
        ", by Mary Abbott Hess, Dana Jacobi & Marie Simmons (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "3/4 cup loosely packed fresh flat-leaf parsley leaves, chopped",
        "4 tsp. capers, rinsed, drained and chopped",
        "3 pitted green olives, finely chopped",
        "2 or 3 anchovy fillets, rinsed, patted dry and finely chopped",
        "1 garlic clove, minced",
        "1 Tbs. chopped fresh mint",
        "2 Tbs. white wine vinegar",
        "1 Tbs. extra-virgin olive oil",
        "1/4 tsp. kosher salt, or more, to taste",
        "Freshly ground pepper, to taste",
        "1 lb. flank steak",
        "1/2 tsp. kosher salt",
        "1/8 tsp. freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Beef with Salsa Verde",
    "url": "http://www.williams-sonoma.com/recipe/grilled-beef-with-salsa-verde.html"
}
