{
    "directions": [
        "Bring brown sugar, lemon juice, water, and ginger to a boil in a 1-quart heavy saucepan, stirring until sugar is dissolved, then remove from heat and let steep, uncovered, 15 minutes. Pour syrup through a sieve into a bowl and cool to room temperature, about 15 minutes.",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). (If using a charcoal grill, open vents on bottom of grill, then light charcoal. When Charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows: Hot: When you can hold your hand there for 1 to 2 seconds; Medium-hot: 3 to 4 seconds; Low: 5 to 6 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.)",
        "While grill heats, cut core from pineapple and discard. Cut each piece of pineapple lengthwise into 8 wedges, then halve each wedge diagonally (use caution; peeled pineapple is slippery).",
        "Grill pound cake, covered only if using a gas grill, on lightly oiled grill rack, turning over once with a metal spatula, until grill marks appear, about 1 1/2 minutes total.",
        "Divide coconut pound cake among 8 shallow bowls, then top each slice with a generous scoop of ice cream and some pineapple and mango. Drizzle each serving with 1 1/2 tablespoons lemon ginger syrup."
    ],
    "ingredients": [
        "1/2 cup packed light brown sugar",
        "1/4 cup fresh lemon juice",
        "1/4 cup water",
        "4 (1/8-inch-thick) slices fresh ginger, smashed",
        "1/2 pineapple, trimmed, peeled, and halved lengthwise",
        "8 (1/2-inch-thick) slices coconut pound cake",
        "2 pt premium ice cream (vanilla, banana, or mango)",
        "2 mangoes, peeled, pitted, and cut lengthwise into 1/4-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Backyard BBQ",
        "Coconut",
        "Mango",
        "Pineapple",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Coconut Poundcake Sundaes With Tropical Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-coconut-pound-cake-sundaes-with-tropical-fruit-232180"
}
