{
    "directions": [
        "Mince garlic and mash to a paste with 1 teaspoon salt using a large heavy knife, then stir together garlic paste, rosemary, pepper, and 1 tablespoon oil in a small bowl. Pat pork dry and rub all over with paste. Marinate, uncovered, at room temperature 20 minutes.",
        "While pork marinates, prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.",
        "While grill is heating, set a box grater into a shallow dish, then rub cut sides of tomatoes against large teardrop-shaped holes to remove as much tomato pulp as possible (discard skins). Boil tomato pulp, sugar, red pepper flakes, and remaining 1/2 teaspoon salt in a 4-quart heavy pot, uncovered, stirring occasionally, until reduced to about 1 1/2 cups, 15 to 20 minutes. Transfer tomato jam to a bowl set in a larger bowl of ice and cold water and cool to room temperature, stirring.",
        "Brush both sides of endive halves with remaining 1 1/2 tablespoons oil and season with salt. Grill pork and endives on lightly oiled grill rack, turning over occasionally, until thermometer inserted diagonally into center of pork registers 150°F and endives are tender, 8 to 10 minutes. Transfer pork to a cutting board and let stand 5 minutes. (Internal temperature will rise to about 155°F while standing.) Serve pork with endives and tomato chile jam."
    ],
    "ingredients": [
        "1 large garlic clove",
        "1 1/2 teaspoons salt",
        "2 teaspoons minced fresh rosemary",
        "1/4 teaspoon black pepper",
        "2 1/2 tablespoons olive oil",
        "2 (3/4-lb) pork tenderloins",
        "2 lb plum tomatoes, halved lengthwise",
        "1/3 cup sugar",
        "1 teaspoon dried hot red pepper flakes",
        "4 Belgian endives, halved lengthwise",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Tomato",
        "Marinate",
        "Rosemary",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Endive",
        "Gourmet"
    ],
    "title": "Grilled Pork Tenderloin and Belgian Endive and Tomato Chile Jam",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tenderloin-and-belgian-endive-and-tomato-chile-jam-109740"
}
