{
    "directions": [
        "Stir together butter, horseradish, dill, shallot, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a bowl with a rubber spatula until combined well. Transfer butter to a sheet of parchment or wax paper and roll into a 1-inch-thick cylinder. Twist ends of parchment to close, then chill until firm, about 20 minutes.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal.",
        "Put salmon steaks on a cutting board with tail-like flaps nearest you. Halve 1 steak lengthwise by cutting along each side of large center bone. Remove and discard bones (you will end up with 2 thin pieces of fillet). Flip 1 piece over, turning it so rounded thicker portion is nearest you. Push halves together to create a yin-yang presentation, wrapping tail-like flaps around outside of steak. Wrap a piece of kitchen string around outside of steak, going around once or twice, and tie ends.",
        "Brush salmon on both sides with oil, then sprinkle with remaining 3/4 teaspoon salt and 1/2 teaspoon pepper.",
        "Oil grill rack, then grill salmon, covered only if using a gas grill, turning over once and if necessary moving to area with no coals underneath to avoid flare-ups, until just cooked through, 6 to 8 minutes total.",
        "Serve each fish steak topped with a slice of horseradish butter."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup drained bottled horseradish (from a 6-ounce jar)",
        "2 tablespoons finely chopped fresh dill",
        "1 tablespoon finely chopped shallot",
        "1 teaspoon salt",
        "3/4 teaspoon black pepper",
        "4 (1- to 1 1/4-inch-thick) salmon steaks (preferably wild)",
        "1 to 2 tablespoons olive oil",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Backyard BBQ",
        "Dinner",
        "Horseradish",
        "Seafood",
        "Salmon",
        "Summer",
        "Grill/Barbecue",
        "Dill",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Boneless Salmon Steaks with Horseradish Dill Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-boneless-salmon-steaks-with-horseradish-dill-butter-238702"
}
