{
    "directions": [
        "Prepare grill.",
        "Peel bananas and halve lengthwise. In a shallow baking pan large enough to hold bananas in one layer stir together butter and brown sugar and add bananas, tossing gently to coat. Transfer bananas with a metal spatula to an oiled rack set 5 to 6 inches over glowing coals and grill until browned and cooked through, about 2 minutes on each side. (If bananas are difficult to handle you may grill them on 1 side only.)",
        "Serve bananas like a banana split with ice cream and chocolate sauce.",
        "In a 2 1/2- to 3-quart heavy saucepan combine cream and milk. Scrape seeds from vanilla bean into cream mixture, dropping in bean. Add zest and bring mixture just to boil.",
        "In a large metal bowl whisk together brown sugar and yolks until combined well. Add hot cream mixture to yolk mixture in a slow stream, whisking, and return custard to pan. Cook custard over moderately low heat, whisking constantly, until thickened and coats back of a wooden spoon, about 3 minutes. (Do not let custard boil or it will curdle.)",
        "Pour custard through a very fine sieve into cleaned metal bowl and cool slightly. Stir in rum and chill, covered, until cold. Freeze custard in an ice-cream maker. Makes about 1 1/2 quarts.",
        "In a heavy saucepan heat chocolate and half-and-half over low heat, stirring frequently, until chocolate is melted. (The sauce will have a very thin consistency, like that of hot chocolate.) Serve sauce warm. Makes about 1 cup."
    ],
    "ingredients": [
        "4 firm-ripe bananas",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "1/4 cup firmly packed brown sugar",
        "2 cups heavy cream",
        "2 cups milk",
        "1 vanilla bean, halve lengthwise",
        "a 2-by 1/2-inch piece lemon zest, removed with a vegetable peeler",
        "2/3 cup firmly packed brown sugar",
        "8 large egg yolks",
        "1/4 cup good-quality dark rum such as Bacardi Black",
        "1/4 pound (about 1 1/2 tablets) Mexican chocolate* such as Ibarra, chopped",
        "1 cup half-and-half",
        "available at some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Ice Cream Machine",
        "Chocolate",
        "Egg",
        "Fruit",
        "Dessert",
        "Frozen Dessert",
        "Banana",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Bananas with Rum Ice Cream and Mexican Hot Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-bananas-with-rum-ice-cream-and-mexican-hot-chocolate-sauce-12687"
}
