{
    "directions": [
        "Blend parsley, vinegar and garlic in processor until parsley is finely chopped, scraping down sides of bowl twice. With machine running, gradually add 1/2 cup olive oil. Season vinaigrette to taste with salt and pepper.",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain pasta. Rinse under cold water and drain again. Transfer to large bowl. Mix in 2 tablespoons vinaigrette.",
        "Prepare barbecue (medium heat). Place smoke chips in 8x6-inch foil packet with open top. Set packet atop coals about 5 minutes before grilling.",
        "Brush corn, zucchini and onion with remaining 2 tablespoons oil. Sprinkle with salt and pepper. Grill vegetables until cooked through and beginning to brown, turning often, about 12 minutes. Cool slightly. Cut kernels from corncobs. Cut zucchini and onion into 1/2-inch pieces.",
        "Add corn kernels, zucchini and onion to pasta in large bowl. Mix in enough vinaigrette to coat. Season to taste with salt and pepper. (Can be prepared 8 hours ahead. Cover and refrigerate. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "1 cup coarsely chopped fresh Italian parsley",
        "3 tablespoons red wine vinegar",
        "1 large garlic clove",
        "1/2 cup plus 2 tablespoons olive oil (preferably extra-virgin)",
        "3/4 pound fusilli pasta",
        "1 cup hickory smoke chips, soaked in water 30 minutes, drained",
        "2 large ears fresh corn, husked",
        "2 large zucchini, trimmed, halved lengthwise",
        "1 large red onion, sliced into 3 large rounds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Herb",
        "Pasta",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Corn",
        "Zucchini",
        "Summer",
        "Grill",
        "Healthy",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled-Vegetable Pasta Salad with Parsley Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-vegetable-pasta-salad-with-parsley-vinaigrette-2143"
}
