{
    "directions": [
        "Stir garlic powder, chili powder, Mexican oregano, 1 teaspoon salt, and 1 teaspoon black pepper together in a bowl. Sprinkle garlic powder mixture over both sides of flap steak, pat rub into meat, wrap steak in plastic wrap, and refrigerate for at least 8 hours or overnight.",
        "Whisk honey, lime juice, cilantro, chipotle peppers, garlic, vegetable oil, apple cider vinegar, chipotle mustard, cumin, 1/2 teaspoon salt, and 1/2 teaspoon black pepper together in a bowl. Cover with plastic wrap and refrigerate 1 to 2 hours. Separate mixture equally into two bowls; one for basting and one for serving.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Cook steak on the preheated grill until smoke rises from the spice rub. Turn the meat and squeeze the juice from 2 lime halves over the steak. When the spice rub begins to smoke, turn the meat again. Brush the refrigerated honey-lime basting sauce onto both sides of the steak and cook steak to your desired degree of doneness, 8 to 10 minutes per side for medium. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Let meat rest for 5 minutes and chop against the grain into bite-size pieces.",
        "Spoon grilled meat into tortillas. Top with onion, lime juice, reserved honey-lime serving sauce, and queso fresco cheese."
    ],
    "ingredients": [
        "Dry Rub:",
        "1 tablespoon garlic powder",
        "2 teaspoons chili powder",
        "2 teaspoons Mexican oregano",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 pounds flap steak, trimmed of fat",
        "Sauce:",
        "1/4 cup honey",
        "1/4 cup fresh lime juice",
        "1/4 cup chopped cilantro",
        "2 chipotle peppers, diced",
        "3 cloves garlic",
        "2 tablespoons vegetable oil",
        "2 tablespoons apple cider vinegar",
        "2 tablespoons chipotle mustard",
        "1 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 limes, halved",
        "4 flour tortillas",
        "1/2 red onion",
        "1/4 cup crumbled queso fresco cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Honey Chili Flap Steak",
    "url": "http://allrecipes.com/recipe/234513/grilled-honey-chili-flap-steak/"
}
