{
    "directions": [
        "Heat 1/4 cup olive oil in heavy large saucepan over medium heat. Add garlic and sauté until golden, about 5 minutes. Add chopped fresh tomatoes or canned tomatoes with juice; coarsely crush tomatoes with potato masher. Add 6 basil sprigs and dried crushed red pepper; bring to boil. Reduce heat to low and simmer until mixture is reduced to thick sauce consistency (about 3 cups), stirring occasionally, about 15 minutes. Season sauce to taste with coarse kosher salt and freshly ground black pepper. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate. Rewarm over medium heat before serving.",
        "Prepare barbecue (medium-high heat). Brush steaks and bread slices with olive oil. Sprinkle steaks with coarse kosher salt and freshly ground black pepper. Grill steaks to desired doneness, about 7 minutes per side for medium-rare. Grill bread slices until golden and grill marks appear, about 2 minutes per side.",
        "Spoon some of warm sauce onto 6 plates, then top each with 1 steak. Spoon additional sauce over each steak. Cut bread in half on diagonal; place bread alongside steaks. Garnish with additional basil sprigs and serve."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil plus additional for brushing",
        "2 garlic cloves, peeled, crushed",
        "2 pounds ripe plum tomatoes (preferably San Marzano-style), coarsely chopped, or one 28-ounce can San Marzano tomatoes in juice with basil leaves",
        "6 large fresh basil sprigs plus additional for garnish",
        "1/2 teaspoon dried crushed red pepper",
        "Coarse kosher salt",
        "6 10- to 11-ounce New York steaks (preferably prime; 1 1/4 inches thick)",
        "6 5x3x1/2-inch slices pain rustique, ciabatta, or other rustic countrystyle bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Basil",
        "Steak",
        "Grill/Barbecue",
        "Pittsburgh",
        "Pennsylvania"
    ],
    "title": "Grilled New York Steaks with San Marzano Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-new-york-steaks-with-san-marzano-sauce-239807"
}
