{
    "directions": [
        "Preheat an oven to 400°F.",
        "To make the roasted garlic, pull off the papery outer layers from the head of garlic. Break into individual cloves, or slice the head crosswise at the root end to expose all of the cloves. Lay a 12-inch square of aluminum foil on a work surface. Place the garlic in the center, drizzle with the olive oil and using your fingers, rub the oil evenly over the garlic. If using the garlic head intact, place cut side down and make sure that the cut portion is well oiled. Sprinkle with 2 pinches of salt. Bring the 4 corners of the foil up over the garlic, twist and press to seal the packet.",
        "Roast until the garlic is very soft, 50 to 60 minutes. You will need 2 roasted garlic cloves for this recipe; reserve the rest for another use. The garlic will keep in its foil packet for up to 5 days in the refrigerator.",
        "To make the sauce, in a small saucepan, combine the tomatoes, the pulp from 2 roasted garlic cloves and the broth. Bring to a boil and cook until most of the liquid has evaporated, about 4 minutes. Remove from the heat, pour in the wine and add the coriander and peppercorns. Bring to a boil, reduce the heat to medium and cook until reduced by one-third, about 8 minutes. Pour through a fine-mesh sieve into a bowl. Discard the solids. Whisk in the olive oil and salt. Season with pepper. Keep warm.",
        "Prepare a hot fire in a grill and oil the rack. Season the beef fillets with salt and pepper.",
        "By charcoal grill:",
        "Using tongs, place the fillets directly over the hottest part of the fire and grill until grill marks are visible, about 2 minutes. Rotate 90 degrees and grill until cross-hatching is visible, about 1 minute. Turn the fillets and grill for about 1 minute more for rare, about 2 minutes for medium and about 3 minutes for well done.",
        "By gas grill:",
        "Using tongs, place the fillets directly over the heat elements and grill until grill marks are visible, about 2 minutes. Rotate 90 degrees and grill until cross-hatching is visible, about 1 minute. Turn the fillets and grill for about 1 minute more for rare, about 2 minutes for medium and about 3 minutes for well done.",
        "Transfer the fillets to a platter, tent loosely with aluminum foil and let rest for about 10 minutes. Brush the mushroom caps with the olive oil.",
        "By charcoal grill:",
        "Grill the mushrooms, cap side down, over the hottest part of the fire until grill marks are visible, about 2 minutes. Rotate 90 degrees and grill until cross-hatching is visible, about 2 minutes. Turn and grill until tender throughout when pierced in the center with a sharp, thin-bladed knife, 2 to 3 minutes.",
        "By gas grill:",
        "Grill the mushrooms, cap side down, directly over the heat elements until grill marks are visible, about 2 minutes. Rotate 90 degrees and grill until cross-hatching is visible, about 2 minutes. Turn and grill until tender throughout when pierced in the center with a sharp, thin-bladed knife, 2 to 3 minutes.",
        "Place a mushroom, cap side down, in the center of each plate. Set a fillet on top of the mushroom. Top with one-fourth of the wine sauce and serve. Serves 4.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Healthful Cooking",
        ", by Mary Abbott Hess, Dana Jacobi & Marie Simmons (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "1 garlic head",
        "1 tsp. extra-virgin olive oil",
        "Kosher salt, to taste",
        "2 plum tomatoes, seeded and chopped",
        "1/2 cup mushroom broth",
        "1 cup fruity red wine such as Zinfandel",
        "1/4 tsp. coriander seeds, crushed",
        "1/4 tsp. peppercorns",
        "1 tsp. extra-virgin olive oil",
        "1/4 tsp. kosher salt",
        "Freshly ground pepper, to taste",
        "4 beef fillets, each about 6 oz., trimmed of all visible fat",
        "Kosher salt and freshly ground pepper, to taste",
        "4 large portobello mushrooms, each about 5 oz., brushed clean and stemmed",
        "2 tsp. extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Beef Fillets with Mushrooms and Red Wine Sauce",
    "url": "http://www.williams-sonoma.com/recipe/grilled-beef-fillets-with-mushrooms-and-red-wine-sauce.html"
}
