{
    "directions": [
        "Whisk together lime juice, vinegar, sugar, sesame oil, chile paste, and 1/4 teaspoon salt.",
        "Cut squid bodies open to make flat pieces and, holding knife almost parallel to work surface (at a 30-degree angle), score inner side of flattened squid in a crosshatch pattern (do not cut all the way through). Pat squid bodies and tentacles dry and toss with vegetable oil, 1/4 teaspoon salt, and pepper.",
        "Heat lightly oiled grill pan over moderately high heat until hot but not smoking, then grill squid bodies, in batches if necessary, crosshatch sides down first, turning once, until just cooked through (squid will curl up as it cooks), about 2 minutes. Transfer to a cutting board as grilled and keep warm, covered. Grill tentacles in same manner. Cut squid bodies crosswise into 1-inch pieces.",
        "Grill plums, in batches if necessary, turning once, until grill marks appear, about 2 minutes. Transfer as grilled to a bowl.",
        "Toss cabbage with cilantro, mint, scallion, 1/4 cup peanuts, half of dressing, and remaining 1/4 teaspoon salt. Mound salad on plates and top with squid and plums. Drizzle with dressing to taste and sprinkle with remaining 1/4 cup peanuts."
    ],
    "ingredients": [
        "3 tablespoons fresh lime juice, or to taste",
        "2 1/2 tablespoons seasoned rice vinegar",
        "1 tablespoon sugar, or to taste",
        "4 teaspoons Asian sesame oil",
        "1 teaspoon Asian chile paste",
        "3/4 teaspoon salt",
        "1 lb cleaned small squid",
        "1 teaspoon vegetable oil",
        "1/4 teaspoon black pepper",
        "4 firm-ripe medium plums (1 1/4 lb), halved lengthwise, pitted, and each half cut into sixths",
        "3/4 lb Napa cabbage, thinly sliced crosswise (4 cups)",
        "1/2 cup packed fresh cilantro leaves",
        "1/2 cup packed fresh mint leaves",
        "1/4 cup thinly sliced scallion",
        "1/2 cup coarsely chopped salted peanuts",
        "Accompaniment: lime wedges",
        "Special equipment: a well-seasoned ridged grill pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Nut",
        "Shellfish",
        "Plum",
        "Mint",
        "Peanut",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Squid and Plum Salad with Cilantro, Mint, and Peanuts",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-squid-and-plum-salad-with-cilantro-mint-and-peanuts-106750"
}
