{
    "directions": [
        "Heat 1 tablespoon oil in large skillet over medium heat. Add shallots; sauté until softened, about 5 minutes. Add garlic, 1/4 teaspoon coarse salt, 1/4 teaspoon thyme, and 1/8 teaspoon allspice. Stir until fragrant, about 30 seconds. Add blueberries, 1/4 cup water, and vinegar. Stir to blend. Mash berries with potato masher or back of fork and cook until sauce thickens, stirring often, 3 to 4 minutes. Season with freshly ground black pepper. Remove from heat. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature. Rewarm before using.",
        "Brush grill rack with oil. Prepare barbecue (medium-high heat). Brush salmon on both sides with oil; sprinkle with coarse salt, thyme, allspice, and black pepper.",
        "Grill salmon until just opaque in center, 4 to 5 minutes per side. Transfer to plates. Stir 2 tablespoons sliced mint into warm blueberry sauce. Spoon sauce over salmon and sprinkle with remaining 1 tablespoon mint. Serve immediately."
    ],
    "ingredients": [
        "1 tablespoon olive oil plus additional for brushing",
        "3/4 cup sliced shallots",
        "1 garlic clove, thinly sliced",
        "1/4 teaspoon coarse kosher salt plus additional for seasoning",
        "1/4 teaspoon chopped fresh thyme plus additional for seasoning",
        "1/8 teaspoon ground allspice plus additional for seasoning",
        "1 cup fresh blueberries",
        "1/4 cup water",
        "1 tablespoon balsamic vinegar",
        "4 7-ounce salmon steaks or fillets with skin (each about 3/4 inch thick)",
        "3 tablespoons thinly sliced fresh mint, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick & Easy",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Blueberry",
        "Salmon",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Salmon with Quick Blueberry Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-salmon-with-quick-blueberry-pan-sauce-360069"
}
