{
    "directions": [
        "Whisk wine, shallots, mustard, 1/3 cup chopped sage, oil, and garlic in medium glass bowl. Transfer 1/2 cup marinade to small bowl; reserve for sauce. Cover and chill. Place leg of lamb in 2-gallon resealable plastic bag. Pour remaining marinade into bag; seal. Turn bag to coat, arranging lamb in 1 flat piece. Place lamb in marinade on rimmed baking sheet. Chill overnight, turning occasionally.",
        "Combine reserved 1/2 cup marinade and beef broth in small saucepan. Boil until reduced to 3/4 cup, about 12 minutes. DO AHEAD: Sauce can be made 1 day ahead. Cool, cover, and chill.",
        "Prepare barbecue (medium heat). Remove lamb from plastic bag and transfer to large rimmed baking sheet with some marinade still clinging. Open lamb like book and sprinkle on both sides with salt and pepper. Transfer lamb to grill. Cover and grill until charred and instant-read thermometer inserted into meat registers 135°F for medium-rare, about 10 minutes per side (some thicker pieces can be cut away from leg and grilled longer if desired). Transfer to work surface; let rest 10 minutes. Rewarm sauce. Whisk in butter and remaining 1 tablespoon chopped sage.",
        "Season to taste with salt and pepper. Thinly slice lamb against grain. Transfer to platter. Spoon some of sauce over. Garnish with fresh sage sprigs, if desired. Serve with additional sauce alongside.",
        "A New Zealand Pinot Noir is a great pairing for the lamb. Try the Sherwood Estate 2007 Pinot Noir ($15). The plum and cherry flavors and toasty oak finish are delicious with the grilled meat."
    ],
    "ingredients": [
        "1 cup dry red wine (such as Zinfandel)",
        "3/4 cup chopped shallots (about 3 large)",
        "1/2 cup whole grain Dijon mustard",
        "1/3 cup plus 1 tablespoon finely chopped fresh sage (about 1/2 ounce) plus sprigs for garnish (optional)",
        "1/4 cup olive oil",
        "3 garlic cloves, pressed",
        "1 7-pound leg of lamb, boned, evenly flattened, outside fat partially trimmed (yields about 5 2/3 pounds)",
        "1 cup low-salt beef broth",
        "2 tablespoons (1/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "Special equipment: 1 2-gallon resealable plastic bag"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Mustard",
        "Marinate",
        "Low Cal",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Red Wine",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Sage",
        "Party",
        "Candy Thermometer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Leg of Lamb with Red Wine, Garlic, Mustard and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-leg-of-lamb-with-red-wine-garlic-mustard-and-sage-353415"
}
