{
    "directions": [
        "Preheat oven to 350°F. Place garlic cloves in small baking dish. Drizzle 2 tablespoons oil over. Cover and bake garlic until tender, about 20 minutes. Uncover; bake until garlic is golden brown, about 10 minutes longer. Cool. Peel garlic. Transfer garlic and oil to processor. Process until smooth paste forms. Add vinegar; process until well blended. Transfer to medium bowl. Gradually add 1/4 cup oil, whisking until dressing is thick and smooth. Stir in basil. Season dressing with salt and pepper.",
        "Cook beans in large pot of boiling salted water until just crisp-tender, about 2 minutes. Drain; transfer beans to large bowl of ice water. Drain; pat dry with paper towels. Toss beans in large bowl with remaining 1/2 tablespoon oil. Season with salt and pepper. (Dressing and beans can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Prepare barbecue (medium-high heat) or preheat broiler. Grill or broil beans until beginning to brown, turning frequently, about 2 minutes. Transfer to large bowl. Add onions and tomatoes. Toss with enough dressing to coat. Serve salad at room temperature."
    ],
    "ingredients": [
        "16 large garlic cloves, unpeeled",
        "2 1/2 tablespoons plus 1/4 cup olive oil (preferably extra-virgin)",
        "1/4 cup balsamic vinegar",
        "2 tablespoons chopped fresh basil",
        "1 pound haricots verts or other thin green beans, trimmed",
        "1 1/2 cups thinly sliced red onions",
        "3 plum tomatoes, seeded, cut into matchstick-size strips (about 1 1/2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Bean",
        "Garlic",
        "Onion",
        "Tomato",
        "Side",
        "Fourth of July",
        "Vegetarian",
        "Backyard BBQ",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Green Bean Salad with Red Onions and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-green-bean-salad-with-red-onions-and-tomatoes-5697"
}
