{
    "directions": [
        "Using a meat mallet, pound the skirt steak out thinly. Cut the steak into 1-1/2 inch strips and skewer on wooden skewers. Skewer the shrimp in a similar fashion on additional skewers. Each skewer should contain only a single piece of food to be grilled.",
        "Cut the sausage into diagonal slices and also skewer. Place the skewered meats onto platters and lightly marinate in olive oil. Refrigerate until ready to cook. Marinate not longer than overnight.",
        "Combine all the chimichurri ingredients in a large bowl, mix well and set aside. Make the chimichurri well in advance of cooking. (It can be prepared 3 days in advance and kept refrigerated for up to a week.)",
        "Prepare a medium-hot fire on a well-oiled outdoor grill or indoor stove-top grill pan. Carefully drain all excess oil from the skewered meats and fish, and season with salt and pepper. Cook each skewered anticucho for 2-3 minutes or until charred and fully cooked.",
        "Serve the anticuchos on a platter, drizzle chimichurri over the top or serve separately."
    ],
    "ingredients": [
        "1 pound skirt steak",
        "1 pound medium shrimp, peeled",
        "1 pound chorizo sausage",
        "Olive oil",
        "Salt and pepper",
        "Wooden skewers-soaked in hot water",
        "1/2 cup olive oil",
        "3 tablespoons white vinegar",
        "2 jalapeño peppers, seeded and diced",
        "1 small bunch flat leaf parsley, picked and chopped (1 cup loose leaves)",
        "3 tablespoons chopped cilantro",
        "1 clove fresh garlic, finely chopped",
        "1 bay leaf",
        "Sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Pork",
        "Shellfish",
        "Appetizer",
        "Marinate",
        "Low/No Sugar",
        "Dinner",
        "Buffet",
        "Sausage",
        "Seafood",
        "Shrimp",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Jalapeño",
        "Cilantro",
        "Parsley",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Chorizo, Shrimp, and Beef with Chimichurri Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chorizo-shrimp-and-beef-with-chimichurri-sauce-100830"
}
