{
    "directions": [
        "Mince and mash garlic to a paste with 1/4 teaspoon salt. Transfer to a bowl and stir in oil and 3 tablespoons lime juice.",
        "Pour marinade over chops in a glass or ceramic shallow baking dish, then turn to coat. Marinate at room temperature, turning over once, 20 minutes to 1 hour.",
        "Chop peach, then toss with sugar and remaining teaspoon lime juice in a medium bowl and let stand 5 minutes.",
        "Stir in tomatoes, scallions, chile, herbs, and vinegar. Let stand while grilling pork.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas).",
        "Meanwhile, remove chops from marinade and pat dry, leaving any bits of garlic. Sprinkle chops on both sides with chili powder, 3/4 teaspoon salt, and 1/4 teaspoon pepper (total).",
        "Oil grill rack, then grill chops, covered only if using a gas grill, turning over once and moving to area with no coals underneath if flare-ups occur, until just cooked through, 12 to 15 minutes.",
        "Serve chops with relish."
    ],
    "ingredients": [
        "2 large garlic cloves",
        "1 tablespoon extra-virgin olive oil",
        "3 tablespoons plus 1 teaspoon fresh lime juice, divided",
        "4 (3/4- to 1-inch-thick) bone-in rib pork chops (2 1/4 pound)",
        "1 large peach or nectarine",
        "1 teaspoon sugar",
        "1 pint grape or cherry tomatoes (10 ounces), quartered",
        "2 scallions, finely chopped",
        "1 tablespoon finely chopped fresh jalapeño chile",
        "1/4 cup chopped basil",
        "2 tablespoons chopped mint",
        "2 tablespoons red-wine vinegar",
        "1 tablespoon chili powder",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Tomato",
        "Marinate",
        "Backyard BBQ",
        "Peach",
        "Basil",
        "Summer",
        "Grill/Barbecue",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Grilled Pork Chops with Tomato Peach Relish",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-chops-with-tomato-peach-relish-239306"
}
