{
    "directions": [
        "Cook eggs in a large saucepan of boiling water 7 minutes. Drain and place in a large bowl of ice water; let cool.",
        "Prepare a grill for medium-high heat. Rub halibut with 2 Tbsp. oil; season with salt and pepper. Grill, skin side down, until skin is charred and fish is nearly cooked through, 5–8 minutes. Turn and grill just until cooked through, about 1 minute. Transfer halibut to a plate and remove skin.",
        "Toss vegetables with remaining 1/4 cup oil in a large bowl; season with salt and pepper. Grill, turning occasionally, until lightly charred and tender. Time will be different for each vegetable (about 2 minutes for scallions and garlic scapes, 4 minutes for Romano beans, 8–10 minutes for eggplants, 10–15 for potatoes). Transfer to a plate as they are done.",
        "Carefully peel and halve eggs (yolks will still be a bit loose in the center). Arrange lettuce leaves on a platter and place halibut, grilled vegetables, tomatoes, radishes, and eggs in separate areas on top. Spoon some Green Olive Tapenade over; serve remaining tapenade alongside."
    ],
    "ingredients": [
        "4 large eggs",
        "1 1/2 pounds skin-on halibut fillets",
        "2 tablespoons plus 1/4 cup olive oil",
        "Kosher salt, freshly ground pepper",
        "2 pounds mixed vegetables (such as scallions, garlic scapes, Romano beans, halved small eggplants, halved baby or new potatoes)",
        "4 cups torn lettuce leaves (such as romaine, red leaf, or butter)",
        "1 cup Sun Gold tomatoes, halved",
        "1 bunch small breakfast radishes, trimmed, halved lengthwise",
        "1 cup Green Olive Tapenade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Halibut",
        "Fish",
        "Summer",
        "Spring",
        "Tomato",
        "Potato",
        "Radish",
        "Green Bean",
        "Olive",
        "Egg",
        "Dinner",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Halibut Niçoise With Market Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-halibut-nicoise-salad-with-market-vegetables"
}
