{
    "directions": [
        "In a 9-by-13-inch baking dish, whisk together the mirin, soy sauce, rice wine vinegar, brown sugar, sesame oil, scallions, 1/4 cup of the vegetable oil and two-thirds of the garlic and ginger. Put the pork tenderloins in the marinade and turn to coat. Cover and marinate for at least 2 hours and up to overnight.",
        "Heat a grill pan over medium-high heat.",
        "Remove the pork from the marinade, allowing the excess to drip off. Transfer the marinade to a small saucepan and bring to a boil over high heat. Boil to reduce slightly, about 5 minutes. Set aside to cool.",
        "Meanwhile, grill the pork, turning occasionally, until a meat thermometer inserted into the center of the tenderloins reaches 145 degrees F, 10 to 12 minutes. Remove to a cutting board and allow to rest for 10 minutes before slicing.",
        "Heat the remaining 1 tablespoon vegetable oil in a large skillet over medium-high heat. Add the remaining ginger and garlic and cook until fragrant, about 30 seconds. Add the bok choy along with 2 tablespoons water and cover. Steam until the bok choy is bright green and crisp-tender, 5 to 6 minutes. Serve alongside the sliced pork with the marinade sauce."
    ],
    "ingredients": [
        "1/4 cup mirin",
        "1/4 cup low-sodium soy sauce",
        "1/4 cup rice wine vinegar",
        "2 tablespoons light brown sugar",
        "1 teaspoon sesame oil",
        "2 scallions, thinly sliced, plus more for garnish",
        "1/4 cup plus 1 tablespoon vegetable oil",
        "3 cloves garlic, thinly sliced",
        "One 3-inch piece fresh ginger, peeled and thinly sliced",
        "2 pork tenderloins",
        "1 1/2 pounds baby bok choy, halved lengthwise",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Tenderloin",
        "Vegetable",
        "Meat",
        "Pork",
        "Main Dish Recipes",
        "Grilling",
        "Marinating Recipes"
    ],
    "title": "Grilled Pork Tenderloin with Baby Bok Choy",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/grilled-pork-tenderloin-with-baby-bok-choy"
}
