{
    "directions": [
        "Mix first 5 ingredients in small bowl. Reserve 4 teaspoons spice mixture for mop mixture. Rub remaining spice mixture all over chicken halves. Refrigerate chicken 1 hour.",
        "Mix 1 cup water, vinegar, Worcestershire sauce, and reserved 4 teaspoons spice mixture in medium bowl to blend for mop mixture.",
        "Place 1 handful of torn newspaper in bottom of charcoal chimney. Top newspaper with 30 charcoal briquettes. Remove top rack from barbecue; place chimney on bottom rack. Light newspaper and let charcoal burn until ash on briquettes is gray, about 30 minutes. Open 1 bottom barbecue vent. Turn out hot charcoal onto 1 side of bottom rack. Using metal spatula, spread charcoal to cover approximately 1/3 of rack. Scatter 1 cup drained wood chips over coals (using too many wet chips may douse the fire). Fill foil loaf pan halfway with water and place on bottom rack opposite coals.",
        "Return top rack to barbecue. Arrange chicken halves, skin side up, on top rack above loaf pan (not above charcoal). Cover barbecue with lid, positioning top vent directly over chickens. Place stem of candy thermometer through top vent, with gauge on outside of lid and tip near chickens (thermometer should not touch chickens or rack); leave thermometer in place during cooking. Use top and bottom barbecue vents to maintain temperature between 275°F and 325°F, opening vents wider to increase heat and closing to decrease heat. Keep any other vents closed. Check temperature every 10 minutes.",
        "Grill chickens until almost cooked through, brushing with mop mixture every 15 minutes, about 1 hour 25 minutes. After 15 minutes, use technique described above to light an additional 15 charcoal briquettes in chimney set atop nonflammable surface.",
        "If temperature of barbecue falls below 275°F, use oven mitts to lift off top rack with chickens; place rack with chickens on nonflammable surface. Using tongs, add hot gray charcoal briquettes from chimney to bottom rack. Scatter remaining 1 cup drained wood chips over charcoal. Reposition top rack on barbecue, placing chickens above loaf pan. Cover with lid. Brush chickens with some Root Beer Barbecue Sauce and continue grilling until meat thermometer inserted into thighs registers 180°F, about 6 minutes longer. Using tongs, move chickens directly over fire. Grill until sauce sizzles and browns, about 2 minutes. Cut chicken into quarters. Serve, passing remaining Root Beer Barbecue Sauce separately."
    ],
    "ingredients": [
        "1 tablespoon salt",
        "1 tablespoon Hungarian sweet paprika",
        "1 tablespoon (packed) dark brown sugar",
        "2 teaspoons ground black pepper",
        "1/4 teaspoon celery seed",
        "2 3 1/2- to 3 3/4-pound chickens, each cut in half, backbones removed",
        "1 cup water",
        "3/4 cup distilled white vinegar",
        "1/4 cup Worcestershire sauce",
        "45 charcoal briquettes",
        "2 cups hickory wood chips, soaked 1 hour in water to cover, drained",
        "Root Beer Barbecue Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fourth of July",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Chicken with Root Beer Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-with-root-beer-barbecue-sauce-105270"
}
