{
    "directions": [
        "Cut the leaves away from the bok choy stalks. Halve the stalks lengthwise. Rinse the leaves and stalks well, then pat dry to remove any excess water. In a small bowl, mix together the butter and miso with a fork until well combined. Set aside.",
        "Prepare a medium-hot fire in a charcoal or gas grill. Put the bok choy stalks in a large bowl. Using your hands (or a fork), coat the bok choy with the miso butter. Arrange the bok choy, cut side down, on the grill grate. (If you have a grill screen, set it on top of the grate before adding the bok choy, to keep the stalks from falling through the gaps.) Close the lid and grill for about 5 minutes, until golden brown on the underside. Turn the bok choy with tongs, re-cover, and grill for 5 to 6 minutes more, until golden and crisp-tender.",
        "While the stalks are cooking, stack the bok choy leaves and roll them up lengthwise into a cigar shape. Slice the leaves crosswise into thin shreds. Make a bed of the shredded leaves on a serving platter. Drizzle the leaves with the oil and lemon juice, sprinkle with the salt and 1/4 teaspoon pepper, and toss to combine.",
        "Put the grilled bok choy on the dressed salad to wilt the leaves; sprinkle additional pepper over the bok choy. Serve immediately."
    ],
    "ingredients": [
        "1 1/2 pounds baby bok choy (about 6 heads) or Shanghai bok choy",
        "3 tablespoons unsalted butter, at room temperature",
        "3 tablespoons white or yellow miso paste",
        "2 tablespoons olive oil",
        "1 tablespoon freshly squeezed lemon juice",
        "Pinch of kosher salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Grill/Barbecue",
        "Bok Choy",
        "Butter",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Baby Bok Choy with Miso Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-baby-bok-choy-with-miso-butter-51227010"
}
