{
    "directions": [
        "Mince garlic and in a small bowl stir together with mustard, vinegar, and cream. Add oils in a slow stream, whisking until emulsified, and season with pepper and salt.",
        "Roast and peel bell pepper . Cut pepper into 1/4-inch dice. Separate lettuce leaves from head, leaving them whole, and discard coarse stems from watercress. Cut mushrooms into 1/4-inch-thick slices.",
        "Prepare grill.",
        "Halve each quail lengthwise through breast and pat dry. Rub quail lightly all over with oil and season with pepper and salt. Grill quail on a lightly oiled rack set 5 to 6 inches over glowing coals 2 to 3 minutes on each side, or until skin is well browned but meat is still pink. (Alternatively, grill quail in a hot well-seasoned ridged grill pan over moderately high heat.)",
        "In a large bowl toss watercress and mushrooms with just enough vinaigrette to coat lightly. Arrange lettuce on each of 4 large plates and top with watercress mixture and bell pepper. Arrange quail on top of salad and sprinkle with tarragon. Serve remaining vinaigrette on the side."
    ],
    "ingredients": [
        "1 small garlic clove",
        "1 teaspoon Dijon mustard",
        "1 tablespoon Sherry vinegar",
        "1/4 cup heavy cream",
        "2 tablespoons corn or canola oil",
        "2 tablespoons extra-virgin olive oil",
        "freshly ground black pepper",
        "1 red bell pepper",
        "1 head Boston lettuce",
        "1 bunch watercress",
        "4 ounces white mushrooms (about 6 medium)",
        "4 semiboneless jumbo quail (6 to 8 ounces each)",
        "corn or canola oil for rubbing on quail",
        "freshly ground black pepper",
        "2 teaspoons chopped fresh tarragon leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Leafy Green",
        "Mushroom",
        "Pepper",
        "Appetizer",
        "Quail",
        "Tarragon",
        "Watercress",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Quail Salad with Creamy Garlic Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-quail-salad-with-creamy-garlic-vinaigrette-15509"
}
