{
    "directions": [
        "Whisk together oil, lemon juice, 1/2 tsp salt, and 1/2 tsp pepper in a large bowl until combined, then stir in tomatoes and onion.",
        "Preheat oven to 350°F with rack in middle.",
        "Gently pound chops (avoiding bone) to 1/8 inch thick between 2 sheets of plastic wrap with flat side of a meat pounder or with a rolling pin.",
        "Toast bread crumbs in a large 4-sided sheet pan in oven, stirring once or twice, until dry but not golden, 7 to 10 minutes. Cool completely.",
        "Stir crumbs together with cheese and 1/4 tsp each of salt and pepper in a shallow bowl or pie plate. Sprinkle chops with 1/4 tsp each of salt and pepper.",
        "Line a large baking sheet with wax paper. Put oil in another shallow bowl or pie plate. Dip each chop in oil, letting excess drip off, then dredge both sides of chop (and bone) in bread-crumb mixture, pressing gently to help crumbs adhere. Transfer to baking sheet.",
        "Prepare a grill for direct-heat cooking over medium-hot charcoal (medium heat for gas).",
        "Oil grill rack, then grill chops, covered only if using a gas grill, turning once, until just cooked through and golden brown and grill marks appear, about 8 minutes total.",
        "Just before serving, add arugula and basil to salad and toss, then season with salt and pepper. Serve over chops."
    ],
    "ingredients": [
        "5 tablespoons extra-virgin olive oil",
        "2 tablespoons fresh lemon juice",
        "3 medium tomatoes, cut into thin wedges",
        "1 small red onion, halved lengthwise, then thinly sliced crosswise (1/2 cup)",
        "10 ounces baby arugula (5 cups)",
        "1 cup packed basil leaves, torn into pieces",
        "6 (3/4- to 1-inch-thick) bone-in rib veal chops (4 to 5 pounds; see cooks' note, below)",
        "4 cups fine fresh bread crumbs (from 10 slices firm white sandwich bread)",
        "2/3 cup grated Parmigiano-Reggiano",
        "1 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Parmesan",
        "Basil",
        "Veal",
        "Arugula",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Veal Chops with Arugula and Basil Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-veal-chops-with-arugula-and-basil-salad-242602"
}
