{
    "directions": [
        "Finely chop garlic and in a small bowl stir together with remaining herb-rub ingredients.",
        "Put lamb in a large dish and with tip of a sharp small knife held at a 45-degree angle cut 1/2-inch-deep slits all over lamb, rubbing herb mixture into slits and all over lamb. Marinate lamb at room temperature 1 hour.",
        "Prepare grill.",
        "Lightly pat lamb dry. On a lightly oiled rack set 5 to 6 inches over glowing coals grill lamb about 10 minutes on each side, or until an instant-read thermometer horizontally inserted into thickest part of meat registers 125°F for medium-rare. (Alternatively, roast lamb in a roasting pan in middle of a 425°F oven about 25 minutes, or until an instant-read thermometer horizontally inserted into meat registers 125°F for medium-rare.) Transfer lamb to a cutting board. Halve and seed lemon. Squeeze juice over lamb and let stand, loosely covered with foil, 15 minutes.",
        "Cut lamb into slices and serve with any juices that have accumulated on cutting board."
    ],
    "ingredients": [
        "8 garlic cloves",
        "3 tablespoons chopped fresh thyme leaves",
        "2 tablespoons chopped fresh rosemary leaves",
        "2 tablespoons chopped fresh parsley leaves",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon coarse salt",
        "3 tablespoons olive oil",
        "a 7- to 8-pound leg of lamb, trimmed of all fat, boned, and butterflied by butcher (4 to 4 3/4 pounds boneless)",
        "1 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Marinate",
        "Kid-Friendly",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Thyme",
        "Gourmet"
    ],
    "title": "Grilled Butterflied Leg of Lamb with Lemon, Herbs, and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-butterflied-leg-of-lamb-with-lemon-herbs-and-garlic-101877"
}
