{
    "directions": [
        "To make the onion rings, in a deep fryer, heat the canola oil to 350°F. Line a baking sheet with paper towels. Season the onion rings lightly with kosher salt.",
        "Sift the semolina flour, all-purpose flour, sugar, baking soda, baking powder, cornstarch and the 2 tsp. kosher salt into a large bowl. Add the eggs, vegetable oil and club soda and whisk until just incorporated; do not overmix. Dip about 10 of the onion rings into the batter, then add them to the oil. Fry, shaking the fry basket occasionally, until the onion rings are golden and crispy, about 8 minutes. Transfer to the paper towel?lined baking sheet and season lightly with kosher salt. Repeat with the remaining onion rings.",
        "Preheat an electric indoor grill on high heat according to the manufacturer?s instructions. Brush the steaks with the olive oil and season generously with kosher salt and pepper. Arrange the steaks on the grill and cook, turning once, until nicely grill-marked, about 6 minutes per side for medium-rare, or until done to your liking.",
        "Transfer the steaks to a carving board, cover loosely with aluminum foil and let rest for 5 minutes. Cut the steaks against the grain into slices 1/4 inch thick and sprinkle with sea salt. Pile the onion rings on a platter and arrange the steak slices alongside. Serve immediately with creamy truffled spinach. Serves 6.",
        "Adapted from a recipe by Gabriel Rucker, Chef, Le Pigeon, Portland, OR."
    ],
    "ingredients": [
        "5 cups canola oil",
        "2 sweet onions, such as Walla Walla, about 1 1/2 lb. total, cut into 1/4-inch rings",
        "Kosher salt, to taste, plus 2 tsp.",
        "2 cups semolina flour",
        "2 Tbs. all-purpose flour",
        "2 tsp. sugar",
        "1/2 tsp. baking soda",
        "1/2 tsp. baking powder",
        "2 Tbs. cornstarch",
        "2 eggs, lightly beaten",
        "6 Tbs. vegetable oil",
        "1 1/2 cups club soda",
        "6 flat-iron steaks, each 7 to 8 oz.",
        "2 Tbs. olive oil",
        "Kosher salt and freshly ground pepper, to taste",
        "Sea salt for sprinkling",
        "Creamy Truffled Spinach for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Flat-Iron Steaks, Semolina Onion Rings & Creamy Truffled Spinach",
    "url": "http://www.williams-sonoma.com/recipe/grilled-flat-iron-steaks-semolina-onion-rings-and-creamy-truffle.html"
}
