{
    "directions": [
        "Grilling Method: Combo/Medium-High",
        "Make Butter at least 3 hours in advance. Combine butter, shallots soaked in Jack Daniels (or other bourbon or whiskey), parsley, Worcestershire, mustard, whiskey, salt, and pepper. Mix well. On a piece of plastic wrap, drop butter in spoonfuls to form a log. Roll butter in plastic wrap and smooth out to form a round log. Refrigerate until hard and easy to slice into round, coin-shaped pieces.",
        "Allow meat to come to room temperature about 15 minutes before grilling.",
        "Just before grilling, brush both sides of the steaks with the oil and season with salt and pepper.",
        "Place steaks directly over medium-high heat for about 1 to 2 minutes, just long enough to get good grill marks. Turn steaks and sear the other side. Move steaks to indirect heat and continue cooking for about 7 more minutes for medium rare.",
        "Remove steaks from the grill, top with a pat of the whiskey butter and allow to rest at least 5 minutes but no longer than 10 before serving.",
        "Spread the melted butter all over the tops of the steaks and top each with a fresh slice of the whiskey butter and parsley, if desired."
    ],
    "ingredients": [
        "2 sticks unsalted butter, softened",
        "2 shallots minced, soaked in 1 shot of Jack Daniels or other whiskey or bourbon",
        "3 teaspoons minced parsley",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon Dijon mustard",
        "3 teaspoons Jack Daniels or other whiskey",
        "1/2 teaspoon sea salt",
        "White pepper to taste",
        "4 cowboy steaks, bone-in rib eye steaks, or other favorite steak, about 1-inch thick",
        "1 teaspoon kosher salt",
        "1/4 teaspoon whole black peppercorns, coarsely ground",
        "Olive oil",
        "Chopped parsley, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Meat",
        "Steak",
        "Whiskey",
        "Summer",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Steak with Whiskey Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-with-whiskey-butter-242257"
}
