{
    "directions": [
        "Heat 1 tablespoon olive oil in heavy small saucepan over medium heat. Add garlic and chile; sauté until fragrant and light golden, about 3 minutes. Add soy sauce, brown sugar, vinegar, and 3 tablespoons water and bring to boil, stirring until sugar dissolves. Reduce heat to medium and simmer until mixture is reduced to 3/4 cup, about 5 minutes (sauce will be thin). Remove barbecue sauce from heat; whisk in sesame oil. Transfer 1/4 cup barbecue sauce to small bowl and reserve for serving.",
        "Prepare barbecue (medium heat). Combine bok choy and eggplant halves in large bowl. Drizzle 2 tablespoons olive oil over and toss to coat. Sprinkle with salt and pepper. Brush fish with remaining 1 tablespoon olive oil; sprinkle with salt and pepper. Grill vegetables and fish until vegetables are tender and slightly charred and fish is just opaque in center, turning occasionally and brushing with sauce, about 10 minutes total for vegetables and 7 minutes total for fish. Transfer vegetables and fish to plates; sprinkle with green onions. Drizzle with reserved sauce and serve."
    ],
    "ingredients": [
        "4 tablespoons olive oil or vegetable oil, divided",
        "2 garlic cloves, minced",
        "1 1/2 teaspoons minced serrano chile with seeds",
        "1/3 cup soy sauce",
        "1/4 cup (packed) dark brown sugar",
        "3 tablespoons unseasoned rice vinegar",
        "3 tablespoons water",
        "1 tablespoon Asian sesame oil",
        "8 baby bok choy, halved lengthwise",
        "4 medium-size Japanese eggplants, trimmed, halved lengthwise",
        "4 6- to 7-ounce halibut fillets (each about 1 inch thick)",
        "2 green onions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Leafy Green",
        "Onion",
        "Vegetable",
        "Backyard BBQ",
        "Dinner",
        "Seafood",
        "Halibut",
        "Eggplant",
        "Summer",
        "Grill/Barbecue",
        "Bok Choy",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Grilled Halibut, Eggplant, and Baby Bok Choy with Korean Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-halibut-eggplant-and-baby-bok-choy-with-korean-barbecue-sauce-235590"
}
