{
    "directions": [
        "Stir together coriander, cumin, salt, and pepper in a small bowl, then add oil and stir until combined well. Rub spice mixture all over chops. Let chops marinate while making sauce and preparing grill.",
        "Simmer tomatillos and 3 cups water in a 2 1/2- to 3-quart saucepan, uncovered, stirring occasionally, until tomatillos are just soft, 8 to 10 minutes. Drain and cool 15 minutes.",
        "While tomatillos are cooling, core apples and cut into 1/4-inch dice. Purée tomatillos with remaining sauce ingredients except apples in a food processor. Transfer to a bowl and stir in apples.",
        "Open vents on bottom of grill. Light charcoal (80 to 100 briquettes) in chimney starter. Leaving about one quarter of grill free of charcoal, bank lit charcoal across rest of grill so that coals are about three times higher on opposite side.",
        "Charcoal fire is medium-hot when you can hold your hand 5 inches above rack over area where coals are piled highest for 3 to 4 seconds. Sear pork on lightly oiled grill rack directly over hottest part of coals, uncovered, turning over once and, if necessary, moving around grill to avoid flare-ups, until well browned, 10 to 12 minutes total. Move pork to coolest part of grill, then cover with inverted roasting pan and grill, turning pork over once, until thermometer inserted diagonally into center of each chop (avoid bone) registers 150°F, 10 to 12 minutes total. Transfer pork to a cutting board and let stand, loosely covered with foil, 15 minutes (temperature will rise to 155°F).",
        "Preheat all burners on high, covered, 10 minutes. Sear pork on lightly oiled grill rack, covered with lid, turning over once, until well browned, 10 to 12 minutes total. Turn off 1 burner (middle burner if there are 3) and put pork above shut off burner. Reduce heat on remaining burner(s) to moderate and grill pork, covered with lid, until thermometer inserted diagonally into center (avoid bone) registers 150°F, 12 to 16 minutes. Transfer pork to a cutting board and let stand, loosely covered with foil, 15 minutes (temperature will rise to 155°F).",
        "Cut pork away from bone, then thinly slice and serve with sauce."
    ],
    "ingredients": [
        "3 tablespoons ground coriander",
        "3 tablespoons ground cumin",
        "2 1/2 tablespoons kosher salt",
        "1 1/2 tablespoons black pepper",
        "3 tablespoons olive oil",
        "4 (2-inch-thick) loin pork chops (each about 1 lb)",
        "1/2 lb fresh tomatillos (about 5), husks discarded and tomatillos rinsed",
        "2 Granny Smith apples",
        "1/2 cup loosely packed fresh cilantro sprigs",
        "1 garlic clove, minced",
        "1 teaspoon ground cumin",
        "1/4 cup apple juice",
        "1 tablespoon fresh lime juice",
        "1 tablespoon mild honey",
        "1 teaspoon minced canned chipotle chiles in adobo",
        "Special equipment: a large chimney starter (if using charcoal); a 17- by 12 1/2- by 3 1/2-inch disposable aluminum roasting pan (if using charcoal); an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Marinate",
        "Apple",
        "Pork Chop",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Tomatillo",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Grilled Monster Pork Chops with Tomatillo and Green Apple Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-monster-pork-chops-with-tomatillo-and-green-apple-sauce-109529"
}
