{
    "directions": [
        "Whisk together vinegar, sugar, salt, pepper, and shallots in a large bowl. Add oil in a slow stream, whisking constantly until combined. Reserve half of vinaigrette in another large bowl and add mushrooms to remaining vinaigrette. Toss to coat and marinate 5 minutes.",
        "Transfer mushrooms to another bowl with a slotted spoon, discarding marinade.",
        "Heat lightly oiled grill pan over moderately high heat until hot but not smoking, then grill mushrooms in 3 batches, turning frequently, until golden brown, about 5 minutes per batch. Transfer as grilled to a cutting board and cool to room temperature.",
        "Cut portabellas into 1/2-inch-wide wedges, then halve shiitake and cremini mushrooms and cut chanterelles (if large) lengthwise into 1/2-inch pieces.",
        "Transfer mushrooms to reserved vinaigrette, tossing to coat, then add arugula, cheese, and salt and pepper to taste and toss again."
    ],
    "ingredients": [
        "1/2 cup Champagne vinegar",
        "2 teaspoons sugar",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "1/2 cup finely chopped shallots (4 small)",
        "1 cup extra-virgin olive oil",
        "1/2 pound whole fresh portabella mushrooms, stems discarded",
        "1/2 pound fresh shiitake mushrooms, stems discarded",
        "1/2 pound fresh cremini mushrooms, trimmed",
        "3/4 pound fresh chanterelle mushrooms, trimmed",
        "1/2 pound baby arugula, or regular arugula torn into bite-size pieces (16 cups)",
        "2/3 cup Parmigiano-Reggiano shavings (made with a vegetable peeler from a 2-oz piece)",
        "Special equipment: a well-seasoned large (2-burner) ridged grill pan (preferably cast-iron)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Mushroom",
        "Onion",
        "Side",
        "Parmesan",
        "Grill/Barbecue",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Mushroom Salad with Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-mushroom-salad-with-arugula-235788"
}
