{
    "directions": [
        "Thinly slice lower 6 inches of lemongrass stalks, discarding remainder of stalks. In a food processor or blender finely grind together sliced lemongrass and garlic. Add remaining marinade ingredients and blend well.",
        "In a large resealable plastic bag combine marinade and steak and seal bag, pressing out excess air. Marinate steak, chilled, turning bag once or twice, at least 4 hours or overnight.",
        "In a large bowl soak noodles in hot water to cover 15 minutes, or until softened and pliable.",
        "Prepare grill (or preheat broiler). Bring a kettle of salted water to a boil for noodles.",
        "Discard marinade and grill steak on an oiled rack set 5 to 6 inches over glowing coals 3 to 5 minutes on each side for medium-rare. (Alternatively, steak may be broiled on rack of a broiler pan about 3 inches from heat about same amount of time.) Transfer steak to a cutting board and let stand 5 minutes.",
        "While steak is cooking, drain noodles in a colander and cook in boiling water 30 seconds to 1 minute, or until just tender. In a colander drain noodles and rinse under cold water to stop cooking. Drain noodles well.",
        "In a large bowl toss noodles with herbs and half of nuoc cham. Divide cucumber among 4 bowls or plates and top with noodles. Sprinkle each serving with 1 to 1 1/2 teaspoons rice powder. Thinly slice steak on the diagonal and divide among noodles, mounding it. Sprinkle chilies over each serving and garnish with herb sprigs. Serve remaining nuoc cham on the side."
    ],
    "ingredients": [
        "2 stalks fresh lemongrass, outer leaves discarded and root end trimmed",
        "6 garlic cloves, minced",
        "2 tablespoons Asian fish sauce (preferably nuoc mam)",
        "1 tablespoon soy sauce",
        "4 teaspoons sugar",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon Asian sesame oil",
        "a 1- to-1 1/4 pound skirt steak or flank steak",
        "1/2 pound dried rice-stick noodles (rice vermicelli)",
        "1/2 cup fresh basil leaves (preferably Thai basil), washed well and spun dry",
        "1/2 cup fresh mint leaves, washed well and spun dry",
        "1/2 cup fresh coriander leaves, washed well and spun dry",
        "about 1 cup Nuoc Cham (Vietnamese lime sauce)",
        "a 1-pound seedless (European) cucumber, halved lengthwise and cut diagonally into 1/4-inch-thick slices",
        "about 2 tablespoons Toasted Rice Powder",
        "2 to 4 small thin fresh red or green Asian chilies (1 to 2 inches long) or serrano chilies, seeded and sliced very thin (wear rubber gloves)",
        "Garnish: Thai basil, mint, or coriander sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Food Processor",
        "Beef",
        "Garlic",
        "Herb",
        "Pasta",
        "Marinate",
        "Backyard BBQ",
        "Mint",
        "Basil",
        "Cucumber",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Lemongrass",
        "Gourmet"
    ],
    "title": "Grilled Lemongrass Beef and Noodle Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lemongrass-beef-and-noodle-salad-10516"
}
