{
    "directions": [
        "Heat vegetable oil in heavy large pot over medium-high heat. Add onions and sauté until soft and deep golden brown, stirring often, about 10 minutes. Stir in wine, vinegar, and sugar. Reduce heat to low and simmer until almost all liquid is absorbed, stirring often, 3 to 4 minutes. Season to taste with salt and pepper. Transfer to small bowl. Cool.",
        "Heat medium skillet over medium heat. Add sausage; sauté until cooked through and browned, breaking up with back of fork, 5 to 6 minutes. Transfer to small bowl. Cool. DO AHEAD: Onions and sausage can be made 1 day ahead. Cover separately; chill. Bring to room temperature before using.",
        "Prepare barbecue (medium-high heat). Lightly flour 2 rimless baking sheets. Divide purchased pizza dough in half (if using). Working with 1 dough round or dough half at a time, roll out on lightly floured surface to 12x8-inch oval. Transfer to baking sheets. Spray top of flatbreads with nonstick spray.",
        "Invert flatbreads, sprayed side down, onto grill. Cook until grill marks appear and sides of bread are dry, 3 to 5 minutes. Return to same baking sheets, grilled side down. Spray uncooked side with nonstick spray. Turn flatbreads over on baking sheets, grilled side up. Sprinkle 3/4 cup cheese over each flatbread. Sprinkle onions, then sausage, over flatbreads, dividing equally. Sprinkle remaining 1/2 cup cheese over, dividing equally. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Transfer flatbreads, topping side up, to grill. Cover and cook until crusts are crisp and cheese melts, 3 to 5 minutes. Transfer to work surface. Cut into rectangles and serve.",
        "A Spanish cheese made from sheep's milk; sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "2 large red onions (1 1/2 to 1 3/4 pounds), halved, thinly sliced",
        "1/2 cup dry red wine (such as Zinfandel)",
        "2 tablespoons balsamic vinegar",
        "1 teaspoon sugar",
        "3/4 pound sweet Italian sausages (about 4 links), casings removed",
        "Pizza Dough Rounds or 1 pound purchased fresh pizza dough",
        "Nonstick olive oil spray",
        "2 cups (packed) coarsely shredded Manchego cheese,* divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Appetizer",
        "High Fiber",
        "Backyard BBQ",
        "Sausage",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Flatbreads with Caramelized Onions, Sausage, and Manchego Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-flatbreads-with-caramelized-onions-sausage-and-manchego-cheese-353389"
}
