{
    "directions": [
        "Lightly mash garlic with flat side of a large heavy knife. In a kettle bring water to a boil with garlic and remaining brine ingredients and simmer 15 minutes. Cool brine completely.",
        "Working over a bowl, divide pork chops and brine among 3 large heavy sealable plastic bags and seal bags, pressing out any excess air. Marinate pork chops in bags in a large bowl, chilled, turning them once, 2 days.",
        "In a small bowl whisk together all spice rub ingredients.",
        "Prepare grill.",
        "Remove pork chops from brine, discarding brine and any spices still adhering to chops, and pat dry. Season chops with salt and pepper and sprinkle each side of each chop with about 1/2 tablespoon spice rub, patting it into meat.",
        "Grill chops on an oiled rack set 5 to 6 inches over glowing coals 10 to 12 minutes on each side, or until a meat thermometer diagonally inserted 2 inches into centers registers 155°F. (Alternatively, arrange chops in 2 lightly oiled shallow baking pans. Roast chops in upper and lower thirds of a preheated 450°F. oven, switching position of pans halfway through roasting, about 20 minutes, or until a meat thermometer registers 155°F.) Transfer chops to a platter and let stand 5 minutes before serving."
    ],
    "ingredients": [
        "9 large garlic cloves",
        "3 quarts water",
        "1/2 cup coarse salt",
        "1/4 cup plus 2 tablespoons black peppercorns",
        "1/4 cup plus 2 tablespoons sugar",
        "1 1/2 tablespoons dried thyme, crumbled",
        "1 teaspoon whole allspice",
        "1/2 bay leaf",
        "twelve 1 1/2-inch-thick rib pork chops",
        "1/2 cup plus 2 tablespoons packed light brown sugar",
        "2 1/2 tablespoons ground cumin",
        "1 tablespoon coarse salt",
        "1/2 teaspoon cayenne"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork Chop",
        "Spice",
        "Fall",
        "Brine",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Spiced Double-Thick Pork Chops",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-spiced-double-thick-pork-chops-15280"
}
