{
    "directions": [
        "Preheat broiler. Place tomatillos, 4 whole garlic cloves, and jalapeños on rimmed baking sheet. Broil until tender and vegetables are slightly charred, turning occasionally, about 7 minutes for garlic and 8 minutes for tomatillos and jalapeños. Transfer to plate and let stand until cool enough to handle. Stem and seed jalapeños. Place tomatillos, garlic, jalapeños, onion, and cilantro in processor. Puree until almost smooth. Season tomatillo salsa with salt and pepper. DO AHEAD Salsa can be made 1 day ahead. Cover and chill. Return salsa to room temperature before serving.",
        "Prepare barbecue (medium-high heat). Rub both sides of pork chops with halved garlic clove. Sprinkle with kosher salt and pepper; brush with oil. Grill until just cooked through, about 8 minutes per side. Transfer chops to plate; let rest 10 minutes. Grill tortillas until slightly charred, about 1 minute per side. Serve chops with tortillas and salsa."
    ],
    "ingredients": [
        "12 tomatillos* (about 1 pound), husked, rinsed",
        "4 garlic cloves, peeled",
        "2 jalapeño chiles",
        "2/3 cup finely chopped white onion",
        "2/3 cup (lightly packed) chopped fresh cilantro",
        "6 (1 1/4-inch-thick) pork rib chops (14 ounces each with bone)",
        "1 garlic clove, peeled, halved",
        "Coarse kosher salt",
        "Extra-virgin olive oil (for brushing)",
        "12 corn or flour tortillas",
        "*Tomatillos are available at some supermarkets and at Latin markets. They have papery husks that should be removed before cooking. It's easiest to do this under running water so that you can rinse the fruit to remove the sticky coating."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Pork",
        "Broil",
        "Pork Chop",
        "Grill/Barbecue",
        "Tomatillo"
    ],
    "title": "Grilled Pork Chops with Tomatillo Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-chops-with-tomatillo-salsa-239075"
}
