{
    "directions": [
        "Place pork between 2 sheets of waxed paper. Pound to 1/4- to 1/2-inch thickness. (Can be made 4 hours ahead. Cover; chill.)",
        "Heat 2 tablespoons oil in heavy large skillet over medium heat. Add next 5 ingredients. Sauté until seeds are lightly browned, about 4 minutes. Set aside.",
        "Place 4 cups water, tomatillos, and jalapeño in small saucepan. Simmer over medium heat until tomatillos are soft and olive-green color, about 15 minutes. Drain, reserving 1/4 cup cooking liquid. Transfer tomatillos, jalapeño, reserved 1/4 cup liquid, cilantro, lettuce, broth, radishes, and seed mixture to blender. Blend sauce until smooth, stopping occasionally to push down ingredients.",
        "Heat 1 tablespoon oil in large skillet over medium heat. Add sauce; cook until thickened, about 4 minutes. Season with salt and pepper. (Can be made 2 hours ahead. Let stand at room temperature.)",
        "Prepare barbecue (medium-high heat). Sprinkle pork with salt and pepper. Grill until cooked through, about 2 minutes per side. Divide among 4 plates. Stir sauce over medium heat until heated through. Spoon sauce over pork.",
        "Green tomato-like vegetables with paper-thin husks. Available at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "1- to 1 1/4-pound pork tenderloin, cut into 1/2-inch-thick medallions",
        "3 tablespoons vegetable oil",
        "1/2 onion, coarsely chopped",
        "3/4 cup pumpkin seeds (pepitas)",
        "1/4 cup peanuts (1 1/2 ounces)",
        "1/4 cup sesame seeds (1 1/2 ounces)",
        "2 garlic cloves, minced",
        "4 cups water",
        "12 ounces tomatillo,* husked",
        "2 teaspoons coarsely chopped seeded jalapeño chili",
        "1 1/2 cups fresh cilantro leaves",
        "1 1/2 cups torn romaine leaves",
        "1 1/4 cups low-salt chicken broth",
        "3 radishes, trimmed, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Pork Tenderloin",
        "Peanut",
        "Radish",
        "Pumpkin",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Tomatillo",
        "Seed"
    ],
    "title": "Grilled Pork Tenderloin with Pipian Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tenderloin-with-pipian-sauce-107082"
}
