{
    "directions": [
        "1. Brush the grill grates lightly with the safflower oil. Prepare a hot fire on a gas or charcoal grill.",
        "2. Whisk together the olive oil, vinegar, and basil in a small bowl until well blended. Brush the zucchini, yellow squash, onion, red bell peppers, and scallions with the olive oil mixture. Place the vegetables on the hot grill and cook 3 to 4 minutes per side until crisp-tender. Season with salt and pepper.",
        "3. Soak the sun-dried tomatoes in 1 cup hot water, covered, about 5 minutes or until softened. Drain and set aside. (Note: Eliminate this step if you are using sun-dried tomatoes packed in oil.)",
        "4. Arrange the grilled vegetables, sun-dried tomatoes, and sliced tomatoes on individual plates or a serving platter. Add a slice of chevre on the side of the vegetables. Drizzle the vegetables with the vinaigrette, and drizzle a little more vinaigrette around the place. Garnish with the parsley and basil. Season with additional salt and pepper, if desired, and serve with crostini.",
        "Makes 25 to 30 crostini",
        "1. Preheat the oven to 400 degrees",
        "2. Slice the bread on a slight angle into 1/4-inch-thick slices and place on a baking pan in a single layer.",
        "3. Mix together the olive oil, butter, parsley, dill and pepper in a small bowl.",
        "4. Brush one side of each piece of bread with the butter mixture and sprinkle with the salt. Toast in the oven 10 to 15 minutes, until golden brown and crunchy.",
        "5.Let cool completely, then store in an air-tight container up to 1 week.",
        "1. Combine the vinegar, lemon juice, herbs, and pepper in a small bowl and stir to mix.",
        "2. Slowly add the olive oil and the canola oil and whisk until all the oil is incorporated. Refrigerate in an air-tight container until ready to use or up to 1 week.",
        "1. Mix the parsley and pepper together on a plate. Roll the chevre log in the mixture, pressing lightly so the seasonings adhere. Wrap in plastic wrap and chill 1 to 2 hours.",
        "2. Remove the log from the refrigerator and unwrap. Cut into 1-inch slices with string, dental floss, or wire. Keep refrigerated until ready to serve"
    ],
    "ingredients": [
        "Safflower oil or canola oil, for oiling the grill",
        "1/2 cup olive oil",
        "1/4 cup balsamic vinegar",
        "5 fresh basil leaves, cut into very thin strips (chiffonade)",
        "2 zucchini, cut into 1/2-inch slices lengthwise",
        "2 yellow squash, cut into 1/2-inch slices lengthwise",
        "1 red onion, cut into 1/2-inch-thick rounds",
        "2 red bell peppers, cored, seeded, and cut into 2-inch strips",
        "7 scallions, trimmed",
        "Salt and freshly ground black pepper to taste",
        "1/4 cup sun-dried tomatoes",
        "2 ripe tomatoes cut into 1/2-inch slices",
        "1 recipe Herbed Chevre (recipe follows)",
        "1 recipe Herbed Balsamic Vinaigrette (recipe follows)",
        "Fresh parsley and fresh basil, to garnish, optional",
        "Crostini (recipe follows)",
        "1 long, thin, good-quality baguette",
        "1/4 cup olive oil",
        "2 tablespoons unsalted butter, melted",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon chopped fresh dill",
        "1 teaspoon freshly ground black pepper",
        "Kosher salt or coarse sea salt to taste",
        "1/3 cup balsamic vinegar",
        "Juice of 1 lemon",
        "2 tablespoons mixed chopped fresh basil, parsley, and thyme",
        "1 teaspoon freshly ground black pepper",
        "1/4 cup olive oil",
        "1/3 cup canola or safflower oil",
        "1/4 cup fresh parsley, chopped, or mixed fresh herbs, such as thyme, rosemary, and dill",
        "1 tablespoon freshly ground black pepper",
        "One 8-ounce mild, creamy chevre log"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Herb",
        "Pepper",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Side",
        "Goat Cheese",
        "Basil",
        "Rosemary",
        "Bell Pepper",
        "Squash",
        "Zucchini",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Thyme",
        "Dill",
        "Parsley",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Vegetable Antipasto with Herbed Chevre and Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-vegetable-antipasto-with-herbed-chevre-and-crostini-355947"
}
