{
    "directions": [
        "1. Make about 8 small incisions on the fatty side of the lamb and insert a smashed garlic half and some rosemary into each slit. Rub the lamb on both sides with the olive oil, Marsala, remaining garlic and rosemary, mint, salt, and pepper Cover and refrigerate overnight or let stand 1 hour at cool room temperature.",
        "2. Brush the grill grates lightly with the safflower oil. Prepare a hot fire in a gas or charcoal grill.",
        "3. If the lamb has been in the refrigerator, bring it to room temperature. Remove the meat from the marinade and drain slightly, allowing some of the marinade to remain on the lamb for added flavor.",
        "4. When the fire is medium-hot (if using charcoal, the coals will be grey and slightly glowing), place the lamb on the grill and cook 15-20 minutes per side (depending on how hot the fire is), basting frequently with the remaining marinade. Move the lamb to the side of the grill away from the direct heat and continue to cook 10 to 15 minutes longer, turning once, or until the internal temperature registers 130 to 135 degrees for medium-rare and 140 to 145 degrees for medium",
        "5. Remove the lamb from the grill and let rest, lightly covered, on a carving board 10 minutes before slicing. Carve into 1/4-inch slices and serve immediately with Foster's Seven Pepper Jelly with Fresh Mint.",
        "Makes 1 1/2 cups jelly",
        "Combine the jelly with the mint, vinegar, and pepper in a bowl and whisk until all ingredients are blended. Refrigerate in an airtight container until ready to use or up to 1 week."
    ],
    "ingredients": [
        "One 4 1/2 to 5-pound butterflied leg of lamb, trimmed of excess fat and silverskin",
        "8 garlic cloves, cut in half, smashed lightly with the flat side of a knife blade",
        "1/4 cup fresh rosemary or 1 heaping tablespoon dried rosemary or a mixture of rosemary, marjoram, and oregano",
        "3 tablespoons olive oil",
        "1/2 cup Marsala or dry red wine",
        "3 tablespoons chopped fresh mint",
        "1 teaspoon kosher salt",
        "1 tablespoon freshly ground black pepper",
        "Safflower oil or canola oil, for oiling the grill",
        "1 recipe Foster's Seven Pepper Jelly with Fresh Mint (recipe follows)",
        "1 cup Foster's Seven Pepper jelly or your favorite pepper jelly",
        "1/4 cup chopped fresh mint",
        "3 tablespoons red wine vinegar",
        "1 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Garlic",
        "Lamb",
        "Dinner",
        "Mint",
        "Rosemary",
        "Meat",
        "Marsala",
        "Grill",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Butterflied Leg Of Lamb With Fresh Mint-Pepper Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-butterflied-leg-of-lamb-with-fresh-mint-pepper-jelly-355948"
}
