{
    "directions": [
        "Heat oil in large nonstick skillet over medium-high heat until very hot. Add endive leaves and sauté until almost translucent and beginning to wilt, 1 to 2 minutes. Sprinkle sugar over and sauté until endive leaves begin to brown and edges are deep golden brown, stirring often, 2 to 3 minutes. Add beer and orange juice and boil until liquid is reduced to thick glaze and coats endive leaves, 3 to 4 minutes. Season to taste with salt and freshly ground black pepper. Let cool to room temperature.",
        "Preheat oven to 350°F. Arrange bread on baking sheet. Spread 1 side of each bread slice lightly with butter. Turn 4 bread slices over, buttered side down. Divide ham and cheese among plain sides of 4 bread slices. Top with remaining bread slices, buttered side up.",
        "Heat large nonstick skillet over medium heat. Add 2 sandwiches to skillet and cook until brown on bottom, 3 to 4 minutes. Transfer sandwiches to same baking sheet, browned side up. Repeat with remaining 2 sandwiches. Bake in oven until sandwiches are brown on bottom and cheese melts, about 5 minutes.",
        "Place 1 sandwich on each of 4 plates. Spoon endive, 2 pickles, and mustard alongside each and serve."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "4 heads of Belgian endive, root ends trimmed and discarded, leaves separated",
        "1 tablespoon sugar",
        "1/2 cup Belgian white beer (such as Hoegaarden)",
        "1/4 cup orange juice",
        "8 5 x 3 x 1/2-inch slices country-style bread",
        "Butter",
        "8 thin slices country ham or prosciutto (about 8 ounces total)",
        "8 ounces Belgian Chimay",
        "\"À La Bière\" cheese or German Temptin cheese, thinly sliced",
        "8 sour pickle spears",
        "Whole grain brown mustard or whole grain Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beer",
        "Cheese",
        "Sauté",
        "High Fiber",
        "Father's Day",
        "Lunch",
        "Ham",
        "Grill",
        "Endive",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Ham and Chimay Cheese Sandwiches with Caramelized Belgian Endive",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-ham-and-chimay-cheese-sandwiches-with-caramelized-belgian-endive-358558"
}
