{
    "directions": [
        "Whisk together all ingredients except coarse salt and clams (to make mignonnette sauce).",
        "Prepare grill for cooking. If using a charcoal grill, open vents in bottom of grill.",
        "Cover a large platter with a 1/2-inch layer of coarse salt to hold clams in place for serving. Grip 1 clam in a kitchen towel with its \"hinge\" facing toward you. Working over a bowl to catch any clam liquor, slide knife in between the 2 shells at a point opposite hinge and rotate clam, sliding knife between shells, until knife reaches hinge. Cut through hinge, being careful to avoid hitting center of clam. Open shells, sliding knife along underside of top shell to detach it from clam. Pull top shell off and discard, keeping clam in bottom shell, and slide knife under clam to loosen, preserving as much clam liquor as possible in bowl.",
        "When fire is moderately hot (you can hold your hand 5 inches above rack for 3 to 4 seconds), set rack on grill. Using tongs, arrange clams on the half shell in 1 layer on rack and spoon some reserved liquor on them. Once clam liquor reaches a boil, allow clams to grill, uncovered, until just cooked through, 3 to 4 minutes. Carefully transfer clams with tongs to platter and drizzle with mignonnette."
    ],
    "ingredients": [
        "5 tablespoons rice vinegar (not seasoned)",
        "3 tablespoons peanut oil",
        "1 teaspoon Asian sesame oil",
        "1/2 teaspoon finely grated peeled fresh ginger",
        "1 scallion, thinly sliced",
        "1 fresh serrano chile or 1/2 fresh jalapeño chile, minced",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cumin",
        "1 to 2 cups coarse salt for stabilizing clams on platter",
        "24 small hard-shelled clams (2 1/2 pounds) such as littlenecks (less than 2 inches wide), scrubbed well",
        "Special equipment: a clam knife; a metal cooling rack",
        "Accompaniment: seaweed salad"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Shellfish",
        "Backyard BBQ",
        "Vinegar",
        "Clam",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Jalapeño",
        "Sesame",
        "Gourmet"
    ],
    "title": "Grilled Clams on the Half Shell with Ginger Mignonnette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-clams-on-the-half-shell-with-ginger-mignonnette-106992"
}
