{
    "directions": [
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add onions and sauté until slightly softened, about 5 minutes. Stir in vinegar, sugar and caraway seeds. Reduce heat to medium-low and sauté until onions are deep brown and very tender, about 20 minutes longer. Season to taste with salt and pepper. (Can be prepared 2 hours ahead. Let stand at room temperature. Rewarm over low heat before using.)",
        "Preheat broiler. Brush 11x7-inch metal baking pan with oil. Place sausages in pan. Broil until sausages are brown and crisp, about 6 minutes per side. Transfer sausages to work surface and cut lengthwise in half.",
        "Arrange 3 sausage halves on each of 2 bread slices. Spread 2 teaspoons mustard over sausages on each. Top sausages with caramelized onions, dividing equally. Top with Gruyère or Emmenthal cheese slices, dividing equally. Cover with remaining 2 bread slices. Spread half of butter over upper bread slices.",
        "Heat large nonstick skillet over medium-low heat. Carefully invert sandwiches, buttered side down, into skillet. Cover and cook until bottoms are brown, about 5 minutes. Spread remaining butter over upper bread slices. Turn sandwiches, cover and cook until bottoms are brown, about 4 minutes longer."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 pounds onions, thinly sliced",
        "1 1/2 tablespoons red wine vinegar",
        "1 tablespoon (packed) dark brown sugar",
        "1/2 teaspoon caraway seeds",
        "3 fully cooked smoked sausages (such as white bratwurst or chicken-apple)",
        "4 large slices rye or pumpernickel bread",
        "4 teaspoons Dijon mustard",
        "4 ounces Gruyère or Emmenthal cheese, thinly sliced",
        "3 tablespoons butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Sausage",
        "Winter",
        "Swiss Cheese"
    ],
    "title": "Grilled Sausage Sandwiches with Caramelized Onions and Gruyère Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sausage-sandwiches-with-caramelized-onions-and-gruyere-cheese-104588"
}
