{
    "directions": [
        "Sauté chopped bacon and chile de àrbol in heavy large saucepan over medium heat until bacon is crisp. Add chopped onion and garlic cloves; sauté until onion is translucent, about 5 minutes. Add Worcestershire sauce and crushed peppercorns; stir 1 minute. Add peaches and sauté until translucent, about 5 minutes. Add orange juice, ketchup, 1 1/2 tablespoons lemon juice, and hot pepper sauce. Simmer until sauce thickens enough to coat spoon thickly, stirring sauce often, about 30 minutes.",
        "Strain sauce into medium bowl, pressing enough liquid and solids through strainer to yield 2 cups sauce; discard solids in strainer. Season sauce to taste with salt and more lemon juice, if desired. (Can be made 1 week ahead. Cover and refrigerate.)",
        "Brush pork tenderloins with olive oil to coat. Arrange pork on rimmed baking sheet. Mix coarsely ground black pepper, kosher salt, and garlic powder in small bowl to blend. Sprinkle seasoning mixture all over pork. (Tenderloins can be prepared 1 day ahead. Cover and refrigerate.)",
        "Prepare barbecue (medium-high heat). Transfer 1/2 cup sauce to small bowl to use for basting. Pour remaining sauce into small saucepan. Grill pork tenderloins until brown and meat thermometer inserted into center registers 140°F, turning occasionally with tongs, about 18 minutes. Brush pork all over with some of basting sauce. Grill pork until glazed, turning and brushing with more basting sauce, about 3 minutes longer. Transfer pork to work surface; let rest 10 minutes.",
        "Rewarm sauce in pan. Cut pork crosswise on slight diagonal into 1/2-inch-thick slices. Arrange pork slices on platter. Drizzle pork with some warm peach barbecue sauce. Serve, passing remaining sauce separately.",
        "*A long, thin red chile available at Latin American markets, some specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "4 ounces bacon slices, chopped",
        "1 dried chile de àrbol,* broken in half",
        "1 cup coarsely chopped onion",
        "2 garlic cloves, chopped",
        "1 tablespoon Worcestershire sauce",
        "1/2 tablespoon whole black peppercorns, crushed",
        "2 small peaches (10 to 12 ounces total), halved, pitted, diced",
        "1 cup orange juice",
        "1 cup ketchup",
        "1 1/2 tablespoons (or more) fresh lemon juice",
        "1/2 teaspoon hot pepper sauce",
        "3 15- to 16-ounce pork tenderloins, trimmed",
        "2 tablespoons olive oil",
        "4 teaspoons coarsely ground black pepper",
        "4 teaspoons coarse kosher salt",
        "2 1/2 teaspoons garlic powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Fruit",
        "Backyard BBQ",
        "Orange",
        "Peach",
        "Bacon",
        "Pork Tenderloin",
        "Hot Pepper",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Pork Tenderloin with Peach Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tenderloin-with-peach-barbecue-sauce-230636"
}
