{
    "directions": [
        "Preheat grill pan to over medium high to high heat. Season mahi mahi fillets with salt and pepper. Combine the lime juice, dark soy, ginger and a little vegetable or canola oil in a shallow dish. Turn the mahi mahi in the citrus soy marinade and let it hang out for 10 minutes. Grill on hot grill pan for 6 minutes per side for a 1-inch fillet or until fish is firm and opaque.",
        "Take 1 spear of asparagus and hold it at each and. Bend the asparagus until it snaps and breaks. Use this spear as your guide on where to trim the ends of your bundle of spears. Using a peeler, make thin long strips of orange zest from both oranges. Cut the ends off the zested oranges and stand them up right on a cutting board. Remove the pith in strips using sharp knife and cutting down from the top of the orange. Discard the pith. When the oranges are both peeled and trimmed, turn them on their sides and slice into 1/4-inch rounds, cross sectioning the whole. Set the orange disks aside. In a skillet with a cover, bring 1-inch water to a boil with the zest of the oranges and grated fresh gingerroot. Allow the orange zest and ginger to simmer for at least 1 minute then add salt and asparagus spears. Simmer the spears 3 to 5 minutes until just tender. Drain the asparagus. Discard the orange zest and ginger. Assemble a few spears on each dinner plate, layering them back and forth, crisscrossing the spears over orange slices. Sprinkle sesame seeds over asparagus and oranges and top with 1 portion of grilled mahi mahi. Garnish assembled fish and asparagus with chopped or thinly sliced chives."
    ],
    "ingredients": [
        "4 portions, 6 to 8 ounces each, mahi mahi fillets",
        "Salt and pepper",
        "2 limes, juiced",
        "3 tablespoons dark tamari soy sauce",
        "2 inches fresh ginger root, grated, about 1 1/2 tablespoons",
        "1 tablespoon vegetable or canola oil",
        "20 blades fresh chives, chopped or 3 scallions, thinly sliced, for garnish",
        "1 to 1 1/4 pounds thin asparagus spears",
        "2 navel oranges",
        "1-inch fresh ginger root",
        "2 tablespoons toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Easy Grilling Recipes",
        "Grilling",
        "Grilled Vegetable",
        "Vegetable",
        "Skillet Recipes",
        "American",
        "Fish",
        "Mahi Mahi Recipes",
        "Fruit",
        "Orange Recipes",
        "Asparagus",
        "Low Calorie",
        "Low-Fat",
        "Spring",
        "Marinating Recipes"
    ],
    "title": "Grilled Mahi Mahi Fillets and Asparagus with Orange and Sesame",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/grilled-mahi-mahi-fillets-and-asparagus-with-orange-and-sesame-recipe2"
}
