{
    "directions": [
        "Prepare the grill (medium-high heat). Grill the corn on the grill rack, covered, turning occasionally, until lightly charred in spots, about 10 minutes. Using tongs, transfer the corn to a platter and let it cool, then cut the kernels from the cob. In a bowl toss the corn with the remaining corn salad ingredients. Season the salad with salt and freshly ground black pepper.",
        "Toss together all the pico de gallo ingredients and season the salsa with salt and additional fresh lemon and lime juice, if necessary.",
        "Scoop the avocado flesh into a blender and add the mango and lime and lemon juices. Blend the mixture until it is smooth, then, thin the purée, if necessary. with water. Season the purée with salt.",
        "In a medium skillet over moderately high heat, melt the butter, then stir in the cilantro. Add the prawns and sauté, turning them occasionally, until they turn pink and are just cooked through, about 4 to 6 minutes. Season the prawns with salt.",
        "Divide the corn salad among 4 plates, spooning it onto the center of each plate, and top each serving with a prawn. Spoon the pico de gallo over the prawn and drizzle it with the avocado purée."
    ],
    "ingredients": [
        "1 ear of corn, shucked",
        "4 tablespoons grated queso fresco",
        "2 tablespoons chopped cilantro",
        "Juice of 1/2 lime",
        "1 teaspoon cayenne pepper",
        "1/2 teaspoon ground cumin",
        "2 tablespoons olive oil",
        "Salt and freshly ground pepper to taste",
        "1/2 medium yellow onion, minced",
        "2 medium tomatoes, seeded and diced",
        "1/4 fresh jalapeño chile, minced",
        "Juice of 1 lime",
        "3 tablespoons chopped fresh cilantro",
        "1/2 tablespoon ground cumin",
        "Salt to taste",
        "1/2 ripe avocado, pitted",
        "1/2 mango, peeled and flesh coarsely chopped",
        "Juice of 1/2 lime",
        "Juice of 1/2 lemon",
        "1/4 cup water",
        "Salt to taste",
        "3 tablespoons unsalted butter",
        "2 tablespoons chopped cilantro",
        "4 tiger prawns or jumbo shrimp, peeled and deveined",
        "Salt to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Shrimp",
        "Corn",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Street Corn Salad with Cilantro Butter Shrimp, Pico de Gallo and Avocado Purée",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-street-corn-salad-with-cilantro-butter-shrimp-pico-de-gallo-and-avocado-puree-51180800"
}
