{
    "directions": [
        "Place 1/4 cup tarragon leaves, parsley, 2 tablespoons pine nuts, 1 teaspoon lemon juice, and shallot in mini processor; chop coarsely. With machine running, gradually add 3 tablespoons olive oil. Season pesto to taste with salt and pepper. Add more olive oil by teaspoonfuls to thin, if necessary.",
        "Whisk 2 teaspoons chopped tarragon, remaining 4 teaspoons lemon juice, and 3 tablespoons oil in small bowl. Season dressing with salt and pepper.",
        "Prepare barbecue (medium-high heat). Brush chicken breasts on both sides with oil. Sprinkle with salt and pepper. Grill until grill marks form, skin is crisp, and chicken is cooked through, 7 to 8 minutes per side. Transfer to work surface; let rest 5 minutes. Using clean brush, brush both sides of bread with oil. Sprinkle with salt and pepper. Grill until dark-brown grill marks appear on both sides, 2 to 3 minutes per side.",
        "Place greens, radishes, and cucumbers in large bowl. Toss with dressing. Season to taste with salt and pepper. Divide salad among 4 plates.",
        "Cut grilled chicken breasts crosswise into 1/3-inch-thick slices. Arrange 1 sliced chicken breast atop salad on each plate. Spoon tarragon pesto over chicken. Sprinkle remaining 2 tablespoons pine nuts over salads. Serve with grilled bread slices."
    ],
    "ingredients": [
        "1/4 cup (packed) fresh tarragon leaves plus 2 teaspoons chopped",
        "1/4 cup (packed) fresh Italian parsley leaves",
        "4 tablespoons pine nuts, divided",
        "5 teaspoons fresh lemon juice, divided",
        "2 teaspoons chopped shallot",
        "6 tablespoons (or more) olive oil, divided, plus additional for brushing",
        "4 boneless chicken breast halves",
        "4 1/2-inch-thick slices country-style French or sourdough bread",
        "1 5-ounce package mixed baby greens",
        "1 cup thinly sliced radishes (from 1 large bunch)",
        "1 cup thinly sliced Japanese cucumbers (about 1 1/2)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Chicken",
        "High Fiber",
        "Lunch",
        "Pine Nut",
        "Cucumber",
        "Radish",
        "Spring",
        "Grill",
        "Grill/Barbecue",
        "Tarragon",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Chicken Salad with Radishes, Cucumbers, and Tarragon Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-salad-with-radishes-cucumbers-and-tarragon-pesto-352032"
}
