{
    "directions": [
        "Prepare grill for cooking.",
        "Soak shrimp (still in shells) in salt water 5 minutes, then rinse well in a colander.",
        "Place tamarind in a bowl with water and rub with your fingers to dissolve pulp. Pour through a sieve into a bowl, pressing hard on solids, and discard solids.",
        "Heat oil in a small heavy saucepan over moderate heat until hot but not smoking, then cook cilantro paste and garlic, stirring, until fragrant. Stir in hot sauce, 3 tablespoons tamarind juice, palm sugar, and fish sauce. Simmer until thickened to consistency of light syrup, about 3 minutes.",
        "Snip shells of shrimp with scissors down center of back, from wide end to second-to-last tail section. Butterfly shrimp in their shells, making a deep incision along length of back where shells are cut, and devein.",
        "Grill shrimp on their sides on an oiled rack set 5 to 6 inches over glowing coals until shells are pink and slightly charred and shrimp are just cooked through, 3 to 4 minutes on each side. (Alternatively, grill shrimp in a hot well-seasoned ridged grill pan over moderate heat.)",
        "Spoon tamarind sauce over shrimp (still in shells) in a serving dish."
    ],
    "ingredients": [
        "1 1/2 lb jumbo (8 to 12 per lb) shrimp",
        "3 teaspoons sea salt dissolved in 11/2 cups water",
        "1 tablespoon tamarind from a pliable block",
        "1/3 cup water",
        "1 tablespoon peanut oil",
        "1 tablespoon chopped cleaned fresh cilantro roots and/or stems, pounded to a paste",
        "1 tablespoon minced garlic",
        "1 tablespoon Sriracha or other Asian hot chile sauce",
        "1 1/2 tablespoons palm sugar, or to taste",
        "1 tablespoon Asian fish sauce (preferably Thai naam pla), or to taste",
        "Garnish: 2 fresh serrano or jalapeño chiles, seeded, halved lengthwise, and finely julienned crosswise; and fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Tamarind",
        "Gourmet"
    ],
    "title": "Grilled Shrimp with Tamarind Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-with-tamarind-sauce-103561"
}
