{
    "directions": [
        "Place mayonnaise, ketchup, creme fraiche, 1 tablespoon lemon juice, cider vinegar, brown sugar, paprika, salt, cayenne pepper, Worcestershire sauce, green onion, and parsley in a bowl. Whisk together until ingredients are well combined. Cover and refrigerate until thoroughly chilled, 2 to 3 hours.",
        "Drizzle olive oil and juice from half a lemon over the shrimp just before grilling. Sprinkle with salt and smoked paprika. Gently but thoroughly toss until shrimp are coated.",
        "Preheat an outdoor grill for high heat and lightly oil the grate.",
        "Grill over hot coals until shrimp are pink and flesh is opaque, about 2 minutes per side. Transfer to a dish and refrigerate until shrimp are chilled, about 30 minutes. You can remove shrimp tails or leave them on.",
        "Divide romaine lettuce among serving bowls. Arrange cherry tomatoes, avocado slices, and egg halves on top. Season with salt and pepper. Ladle on about 1/4 cup to 1/2 cup dressing on the vegetables, and top with the shrimp and sliced green onions. Drizzle additional dressing over the shrimp, if desired."
    ],
    "ingredients": [
        "Dressing:",
        "1 cup mayonnaise",
        "1/3 cup ketchup",
        "1/4 cup creme fraiche",
        "1 tablespoon freshly squeezed lemon juice",
        "1 teaspoon apple cider vinegar",
        "1 teaspoon packed brown sugar",
        "1 teaspoon paprika",
        "1/4 teaspoon kosher salt, or to taste",
        "1/8 teaspoon cayenne pepper",
        "1/2 teaspoon Worcestershire sauce",
        "2 tablespoons minced green onion",
        "2 tablespoons chopped fresh parsley",
        "Grilled Shrimp:",
        "1 tablespoon olive oil",
        "1/2 lemon, juiced",
        "2 pounds uncooked medium shrimp - peeled and deveined, tails left intact",
        "1 teaspoon kosher salt",
        "1/4 teaspoon smoked paprika",
        "Salad:",
        "1 heart of romaine lettuce, chopped",
        "8 cherry tomatoes, halved",
        "1 avocado - peeled, pitted, and thinly sliced",
        "4 hard-boiled eggs, halved"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Shrimp Louie",
    "url": "http://allrecipes.com/recipe/255012/grilled-shrimp-louie/"
}
