{
    "directions": [
        "Cut a large piece of Reynolds Wrap(R) Non-Stick Foil and firmly fit it over the grill grate. Heat the grill to medium heat.",
        "While the grill is heating, make the dressing. To a shallow bowl, add the shallot, vinegar, maple syrup, and a couple pinches of salt and pepper to taste. Let the mixture sit until the shallots are tender, about 10 minutes. Add 4 tablespoons of the oil and whisk until the dressing is mixed and blended. Set aside.",
        "Cut the garlic clove in half. Gently rub both sides of each slice of bread with the cut side of the garlic. Using 1 tablespoon of oil, lightly brush each side of the bread.",
        "Place the bread on the hot grill and cook until toasted and firm, about 7 to 10 minutes. Remove the bread and let cool.",
        "Brush the peaches with the remaining tablespoon of oil and sprinkle with a couple pinches of salt. Place the peaches on the foil-covered grill and cook until lightly browned but firm, about 4 to 5 minutes. Remove from heat and set aside.",
        "In a large serving bowl, toss together the arugula and basil. Tear the bread into large chunks and add to the bowl. Add the peaches and fennel. Mix in the dressing and give everything a thorough toss."
    ],
    "ingredients": [
        "1 large shallot, sliced thin",
        "2 tablespoons white wine vinegar",
        "1 teaspoon maple syrup (or sweetener of choice)",
        "1/2 teaspoon fine sea salt and fresh pepper",
        "6 tablespoons extra-virgin olive oil, divided",
        "1 clove garlic",
        "4 slices hearty bread",
        "2 peaches, sliced into wedges",
        "2 cups baby arugula",
        "1 cup torn basil leaves",
        "1 large fennel bulb, halved, cored and thinly shaved on a mandoline",
        "Reynolds Wrap® Non Stick Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Panzanella Salad with Peaches and Fennel",
    "url": "http://allrecipes.com/recipe/247450/grilled-panzanella-salad-with-peaches/"
}
