{
    "directions": [
        "Cut tofu crosswise into 6 slices. Arrange in 1 layer on a triple layer of paper towels and top with another triple layer of towels. Weight with a shallow baking pan or baking sheet and let stand 2 minutes. Repeat weighting with dry paper towels 2 more times.",
        "Stir together soy sauce, sesame oil, brown sugar, ginger, garlic, Tabasco, and 1 tablespoon vegetable oil in a glass pie plate. Add tofu slices in 1 layer and marinate, turning over every couple of minutes, 8 minutes total.",
        "Heat a lightly oiled well-seasoned ridged grill pan over moderately high heat until hot but not smoking. Lift tofu from marinade with a slotted spatula (reserve marinade) and grill, turning over once carefully with spatula, until grill marks appear and tofu is heated through, 4 to 6 minutes total.",
        "While tofu grills, heat remaining teaspoon vegetable oil in a 12-inch skillet over moderately high heat until hot but not smoking, then sauté greens, tossing with tongs, until beginning to wilt. Add reserved marinade and sauté, tossing, until greens are just wilted, about 1 minute. Lift greens from skillet with tongs, letting excess marinade drip off, and divide between 2 plates.",
        "Serve greens with tofu slices."
    ],
    "ingredients": [
        "1 (14-ounce) block firm tofu, drained",
        "1/4 cup low-sodium soy sauce",
        "1 teaspoon Asian sesame oil",
        "1 1/2 teaspoons packed dark brown sugar",
        "1 1/2 teaspoons finely grated peeled fresh ginger",
        "1 small garlic clove, minced",
        "1/4 teaspoon Tabasco or dried hot red pepper flakes",
        "1 tablespoon plus 1 teaspoon vegetable oil",
        "2 (5-ounce) bags Asian greens or baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Leafy Green",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "Tofu",
        "Spinach",
        "Grill/Barbecue",
        "Healthy",
        "Vegan",
        "Sesame",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Grilled Tofu and Sauteed Asian Greens",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tofu-and-sauteed-asian-greens-108684"
}
