{
    "directions": [
        "Preheat grill to medium-high.",
        "Grind the toasted spices in a spice grinder and add to a small bowl with cayenne. Fold the tail end of the beef under to create a roll of meat that is even in thickness. Tie with butcher's twine to secure. This will help the meat to cook evenly and to be handled easily. Once the tenderloin is tied, season the beef generously with salt and rub with the spice mix. Give it a little massage with extra-virgin olive oil.",
        "Place the tenderloin on the preheated grill and grill on all sides until it is very brown and charred on the outside. When the tenderloin is nice and brown on all the sides, move it to a cooler part of the grill and shut the grill and cook until it is cooked to the desired doneness (medium rare for me), about 20 to 25 minutes or so for medium-rare. If cooking indoors, put the meat in a preheated 375 degrees F oven to roast to the desired doneness, about 125 to 130 degrees F for medium-rare. Remove the meat from the grill or oven to a cutting board and let rest for about 10 minutes before slicing; this will keep the tenderloin very juicy.",
        "Meanwhile, toss the onions with extra-virgin olive oil and salt and place on the preheated grill. Grill until they are soft and charred. Remove from the grill and reserve.",
        "To serve, remove the string from the beef. Cut into relatively thin slices, but thicker if you prefer. Serve 3 slices of beef, for each serving, with the grilled onions and a spoonful of Horseradish Cream.",
        "MMMMM...BIG MEAT!",
        "Combine all the ingredients in a serving bowl. Taste for seasoning, adjust salt if needed. Easy peasy!"
    ],
    "ingredients": [
        "1 tablespoon toasted coriander seeds",
        "1 tablespoon toasted cumin seeds",
        "1/2 tablespoon cayenne pepper",
        "1 beef tenderloin, trimmed (about 3 pounds)",
        "Kosher salt",
        "Extra-virgin olive oil",
        "2 bunches spring onions, stems removed, cut in 1/2",
        "Horseradish Cream, recipe follows",
        "1/2 cup prepared horseradish",
        "1/2 cup creme fraiche",
        "1/2 cup mayonnaise",
        "1 garlic clove, smashed and finely chopped",
        "1/2 lemon, juiced",
        "1 bunch chives, finely chopped",
        "Kosher salt. if needed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Onion Recipes",
        "Vegetable",
        "Beef",
        "Meat",
        "Beef Tenderloin",
        "Main Dish Recipes"
    ],
    "title": "Grilled Beef Tenderloin with Grilled Spring Onions",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/grilled-beef-tenderloin-with-grilled-spring-onions-recipe"
}
