{
    "directions": [
        "Very thinly slice onion crosswise into rings with slicer. Set slicer aside. Heat vinegar, sugar, and 1/2 teaspoon salt in a small heavy nonreactive saucepan until sugar has dissolved. Remove from heat and stir in onion, then let stand until ready to use (about 25 minutes).",
        "Meanwhile, stir 1/4 cup lime juice together with cilantro, oil, and 1/2 teaspoon salt. Add fish and toss to coat, then marinate at room temperature 15 minutes.",
        "Whisk together mayonnaise, crema, 1/2 teaspoon salt, and remaining 3 tablespoons lime juice to make sauce.",
        "Preheat a gas grill with burners on high, covered, 10 minutes, then reduce heat to medium-high.",
        "Thread each piece of fish onto a skewer (discard marinade). Wrap exposed part of each skewer in heavy-duty foil to protect it from charring.",
        "Wrap tortillas in 2 foil packages and warm on grill, turning once, about 3 minutes total.",
        "Oil grill rack, then grill fish, covered, turning once, until opaque and just cooked through (for mahimahi), about 6 minutes total; or until just pink in center (for tuna), about 4 minutes.",
        "Very thinly slice radishes with slicer. Halve, pit, and peel avocados, then cut into 1/2-inch-thick slices. Drain onions.",
        "Serve fish with tortillas, crema sauce, onions, and remaining toppings."
    ],
    "ingredients": [
        "1 medium red onion",
        "1/2 cup cider vinegar",
        "1/4 cup sugar",
        "7 tablespoons fresh lime juice, divided",
        "1/4 cup chopped cilantro",
        "1 tablespoon olive oil",
        "1 1/4 pound (1-inch-thick) skinless mahimahi fillet or tuna steak, cut into 12 pieces",
        "2/3 cup mayonnaise",
        "2/3 cup crema or sour cream",
        "12 (6-inch) corn tortillas",
        "6 to 8 radishes",
        "1 to 2 (6- to 8-ounce) firm-ripe avocados",
        "4 cups thinly sliced green cabbage (1/2 small head)",
        "Equipment: an adjustable-blade slicer; 12 (6- to 8-inch) wooden skewers, soaked in water 30 minutes",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Marinate",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Tuna",
        "Avocado",
        "Radish",
        "Grill",
        "Grill/Barbecue",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled-Fish Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-fish-tacos-239949"
}
