{
    "directions": [
        "Prepare grill for cooking.",
        "Soak shrimp (still in shells) in salt water 5 minutes, then rinse well in a colander.",
        "Pound all chiles with garlic to a coarse paste with a mortar and pestle and stir in fish sauce and lime juice and sugar to taste. Transfer to a large bowl.",
        "Snip shells of shrimp with scissors down center of back, from wide end to second-to-last tail section. Butterfly shrimp in their shells, making a deep incision along length of back where shells are cut, and devein.",
        "Discard tough outer leaves of lemongrass and trim root ends. Thinly slice lower 6 inches of stalks.",
        "Grill shrimp on their sides on an oiled rack set 5 to 6 inches over glowing coals until shells are pink and slightly charred and shrimp are just cooked through, 3 to 4 minutes on each side. (Alternatively, grill shrimp in a hot well-seasoned ridged grill pan over moderate heat.)",
        "Toss shrimp (with shells still on) with chile mixture and stir in sliced lemongrass, shallots, scallions, and mint.",
        "Serve on a bed of lettuce and tomato with cilantro or mint."
    ],
    "ingredients": [
        "1 lb jumbo (8 to 12 per lb) shrimp",
        "2 teaspoons sea salt dissolved in 1 cup water",
        "4 to 8 (1- to 2-inch) fresh red Thai chiles, minced",
        "2 fresh serrano or jalapeño chiles (preferably red), minced",
        "1 tablespoon minced garlic",
        "3 tablespoons Asian fish sauce (preferably Thai naam pla)",
        "3 to 4 tablespoons fresh lime juice",
        "2 to 3 teaspoons sugar",
        "2 stalks fresh lemongrass",
        "2 small shallots, halved lengthwise and thinly sliced crosswise (1/4 cup)",
        "2 scallions (white parts and half of greens), thinly sliced",
        "1/2 cup fresh mint leaves, torn into pieces",
        "Accompaniments: green-leaf lettuce, sliced tomato, and fresh cilantro or mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Pepper",
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Lemongrass",
        "Gourmet"
    ],
    "title": "Grilled Shrimp Salad with Lemongrass and Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-salad-with-lemongrass-and-chiles-103550"
}
