{
    "directions": [
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows:\nHot: When you can hold your hand there for 1 to 2 seconds\nMedium-hot: 3 to 4 seconds\nLow: 5 to 6 seconds",
        "If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.",
        "Meanwhile, whisk together 1 tablespoon oil, 1/4 teaspoon cayenne, and 1/2 teaspoon each of cumin, cinnamon, and salt in a large shallow bowl. Pat pork dry and add to spiced oil in bowl, turning to coat.",
        "Grill tenderloins on lightly oiled grill rack, covered only if using a gas grill, turning over occasionally, until thermometer inserted diagonally 2 inches into thickest end of meat registers 150°F, 16 to 18 minutes. Transfer to a cutting board, then tent loosely with foil and let stand 10 minutes before slicing. (Internal temperature will rise to 160°F while pork stands.)",
        "Cook garlic in remaining 2 tablespoons oil in a 10- to 12-inch heavy skillet over moderate heat, stirring occasionally, until pale golden, 1 to 2 minutes. Add tomatoes with their juices, remaining 1/8 teaspoon cayenne, and remaining 1/4 teaspoon each of cumin, cinnamon, and salt, then briskly simmer until sauce is slightly thickened, about 10 minutes. Slice pork and serve with sauce."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "3/8 teaspoon cayenne",
        "3/4 teaspoon ground cumin",
        "3/4 teaspoon cinnamon",
        "3/4 teaspoon salt",
        "2 (3/4-lb) pork tenderloins",
        "4 garlic cloves, very thinly sliced",
        "2 1/2 lb tomatoes (about 6 medium), chopped",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Tomato",
        "Quick & Easy",
        "Low/No Sugar",
        "Meat",
        "Pork Tenderloin",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Spice-Rubbed Pork with Tomato Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-spice-rubbed-pork-with-tomato-garlic-sauce-232311"
}
