{
    "directions": [
        "Stir 1 1/4 cups warm water, yeast, and sugar in large bowl to blend. Let stand until yeast dissolves, about 10 minutes. Whisk in 1 cup flour; let stand in warm draft-free area until bubbling, about 30 minutes.",
        "Stir oil and salt, then 2 cups flour into yeast mixture. Knead dough in bowl until almost smooth and beginning to pull away from sides, adding 1/4 cup more flour to prevent sticking. Turn dough out onto floured surface; knead until smooth and elastic, adding more flour by tablespoonfuls as needed (dough should be slightly sticky), about 7 minutes. Place dough in lightly oiled large bowl; cover with plastic wrap. Let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
        "Prepare barbecue (medium heat). Arrange zucchini and eggplant slices on 2 large baking sheets. Brush vegetables with oil; sprinkle with salt and pepper. Grill until tender and golden brown, about 4 minutes per side. Transfer to platter.",
        "If using charcoal barbecue, remove grate and arrange coals so that 1 side of grill is hot and 1 side is cooler (for gas barbecue, adjust burners accordingly).",
        "Sprinkle 3 baking sheets with flour. Punch down dough. Divide dough into 3 equal pieces; roll out each piece on floured surface to 12x8-inch oval. Transfer to prepared baking sheets. Brush dough tops with oil. Place ovals, oiled side down, on hot side of grill rack and grill until bottoms are firm (watch closely to avoid burning), about 3 minutes. Turn crusts over; grill until dough is set, about 2 minutes. Transfer to baking sheets, grill mark side up.",
        "Spread 1/4 cup tapenade over each pizza; arrange grilled zucchini and eggplant slices over. Sprinkle each with 1 tablespoon marjoram and 1/4 teaspoon crushed red pepper. Drizzle lightly with oil. Sprinkle each with 1/2 cup Fontina and 1/3 cup Pecorino Romano. Return pizzas to cooler side of grill. Cover and grill until cheese melts, about 5 minutes. Sprinkle pizzas with parsley; slice and serve.",
        "*A thick paste or spread made from brine-cured olives, capers, anchovies, and seasonings; available at some supermarkets, specialty foods stores, and Italian markets."
    ],
    "ingredients": [
        "1 1/4 cups warm water (105°F to 115°F)",
        "1 envelope (1/4 ounce) active dry yeast",
        "Generous pinch of sugar",
        "3 1/4 to 3 3/4 cups all purpose flour, divided",
        "1 tablespoon extra-virgin olive oil",
        "2 1/2 teaspoons coarse kosher salt",
        "3 medium zucchini (about 1 pound total), trimmed, cut lengthwise into 1/4-inch-thick slices",
        "2 small eggplants (about 1 1/2 pounds total), cut lengthwise into 1/4-inch-thick slices",
        "3/4 cup (about) extra-virgin olive oil, divided",
        "3/4 cup purchased black-olive tapenade* (about 5 1/2 ounces)",
        "3 tablespoons minced fresh marjoram or fresh oregano",
        "3/4 teaspoon dried crushed red pepper",
        "1 1/2 cups (packed) coarsely grated Fontina cheese",
        "1 cup freshly grated Pecorino Romano cheese",
        "1/2 cup chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetarian",
        "Eggplant",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Parsley",
        "Oregano",
        "Fontina"
    ],
    "title": "Grilled Zucchini and Eggplant Pizza with Tapenade and Fontina",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-zucchini-and-eggplant-pizza-with-tapenade-and-fontina-232562"
}
