{
    "directions": [
        "Prepare a grill for medium-high heat. Cut lemon in half crosswise and thinly slice 1 half; remove seeds. Set remaining lemon half aside for serving. Grill lemon slices, turning occasionally, until lightly charred, about 2 minutes. Transfer to a cutting board and coarsely chop. Place in a medium bowl.",
        "Using long tongs, place clams directly on grill. Carefully transfer to a large bowl as they open. (Try to save as much clam liquor as possible, but some will inevitably spill onto coals.) Let cool.",
        "Remove clams from their shells and coarsely chop. Transfer clams and any liquor to bowl with lemon and add garlic, parsley, red pepper flakes, and 1/4 cup oil; season with salt and black pepper.",
        "Drizzle bread with oil and grill, turning halfway through, until toasted and lightly charred, about 5 minutes.",
        "Top toasts with clam mixture, some Green Olive Tapenade, then Parmesan, dividing evenly; cut into pieces. Cut reserved lemon into wedges and serve alongside toast for squeezing over."
    ],
    "ingredients": [
        "1 lemon",
        "4 pounds littleneck clams",
        "1 garlic clove, finely chopped",
        "1/2 cup coarsely chopped parsley",
        "1 teaspoon crushed red pepper flakes",
        "1/4 cup olive oil, plus more for drizzling",
        "Kosher salt, freshly ground pepper",
        "1 loaf crusty bread, halved lengthwise",
        "Green Olive Tapenade",
        "1 ounce Parmesan, coarsely grated (about 1/3 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Clam",
        "Grill",
        "Lemon",
        "Olive",
        "Appetizer",
        "Parsley",
        "Bread",
        "Summer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Clam Toasts With Lemon and Green Olives",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-clam-toasts-with-lemon-and-green-olives"
}
