{
    "directions": [
        "To spatchcock the chicken, use strong kitchen scissors or poultry shears and cut down either side of the spine. Pull out the spine, turn the chicken over and press down on the breast of the chicken to flatten it out to one thickness.",
        "Whisk together the olive oil, lemon juice and zest, garlic, oregano, 1 1/2 teaspoons salt and 1/4 teaspoon pepper in a medium bowl. Put the chicken in a gallon-size resealable plastic bag in a rimmed dish. Pour in half of the marinade, reserving the rest for serving later. Seal the bag and rotate it around to evenly distribute the marinade. Refrigerate for 1 hour.",
        "Remove the chicken from the marinade and discard the marinade. Pat the chicken dry with paper towels and season generously all over with salt and pepper; let sit at room temperature for 30 minutes.",
        "Prepare a grill for medium indirect heat: For gas grills (with 3 or more burners), turn all the burners to medium-high heat; after about 15 minutes turn off one of the middle burners and turn the remaining burners down to medium. For charcoal grills, bank one chimney starter-full of lit and ashed-over charcoal briquettes to one side of the grill. Set up a drip pan on the other side to avoid flare-ups. (Be sure to consult the grill manufacturer's guide for best results.)",
        "Place the chicken skin-side up on the indirect side of the grill with the legs facing the hotter side. Cover and cook until an instant-read thermometer inserted in the thickest part of the thigh (avoiding the bone) reads 150 to 160 degrees F (almost cooked through), about 50 minutes.",
        "Move the chicken over to the direct-heat side of the grill. After 2 minutes, flip the chicken to char and crisp up the skin side, another 3 or 4 minutes. Check that the temperature in the thigh is now at least 165 degrees F. If it is not, then move the chicken back to the indirect side, cover and cook until the final temperature is reached. Remove from the grill; let rest 20 minutes before carving.",
        "Stir the scallions and dill into the reserved marinade. Drizzle over the chicken or serve on the side."
    ],
    "ingredients": [
        "1 whole chicken (3 1/2 to 4 pounds) spatchcocked",
        "1 cup extra-virgin olive oil",
        "Juice of 2 lemons and zest of 1",
        "3 garlic cloves, finely grated",
        "2 tablespoons chopped fresh oregano",
        "Kosher salt and freshly ground black pepper",
        "2 scallions, sliced",
        "1/4 cup roughly chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Chicken",
        "Chicken",
        "Grilling",
        "Poultry Recipes",
        "European Recipes",
        "Greek Recipes",
        "Main Dish Recipes",
        "Marinating Recipes"
    ],
    "title": "Grilled Spatchcocked Greek Chicken",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/grilled-spatchcocked-greek-chicken"
}
