{
    "directions": [
        "Combine all ingredients in heavy medium saucepan. Whisk over medium heat until butter melts and sauce is well blended. Season to taste with salt and pepper. (Can be made 3 hours ahead. Cool. Whisk over low heat to rewarm before using.)",
        "Arrange corn pieces, eggplant rounds and onion wedges in single layer on large baking sheet. arrange bell pepper strips, zucchini spears, asparagus spears and carrot slices in single layer on another large baking sheet. Transfer 1/2 cup sauce to small saucepan and reserve for dipping. Brush both sides of vegetables lightly with some of remaining basting sauce.",
        "Prepare barbecue (medium-high heat). Grill Corn, eggplant and onion until tender and lightly charred, brushing occasionally with basting sauce and turning with tongs, about 6 minutes. Transfer vegetables to small platter as vegetables finish grilling. Tent with foil to keep warm.",
        "Grill bell peppers, zucchini, asparagus and carrot until tender and lightly charred, brushing occasionally with basting sauce and turning with tongs, about 6 minutes. Transfer vegetables to same platter, arranging alongside other vegetables. Season all vegetables with salt and pepper. Garnish with fresh herb sprigs and lemon.",
        "Place pan with reserved 1/2 cup sauce over low heat or at edge of barbecue and whisk sauce until warmed through. Transfer to small bowl. Serve vegetables, passing warm dipping sauce separately."
    ],
    "ingredients": [
        "1/2 cup (1 stick) butter, diced",
        "1/3 cup chopped shallots",
        "1/4 cup olive oil",
        "3 tablespoons Dijon mustard",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons chopped fresh thyme",
        "1 tablespoon grated lemon peel",
        "2 large ears fresh corn, husked, each cut crosswise into 4 pieces",
        "1 small eggplant (about 1 pound), cut crosswise into 1/2-inch-thick rounds",
        "1 large red onion, cut into 3/4-inch-thick wedges",
        "1 large red bell pepper, seeded, cut lengthwise into 6 strips",
        "1 large yellow or green bell pepper, seeded, cut lengthwise into 6 strips",
        "1 large zucchini, trimmed, quartered lengthwise",
        "8 asparagus spears, trimmed",
        "1 large carrot, peeled, cut on deep diagonal into 1/4-inch-thick slices",
        "Fresh herb sprigs",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Summer",
        "Grill/Barbecue",
        "Thyme",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Vegetables with Lemon, Thyme and Mustard Basting Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-vegetables-with-lemon-thyme-and-mustard-basting-sauce-2285"
}
