{
    "directions": [
        "Combine 1/2 cup dill, 1/2 cup olive oil, 3 tablespoons lemon juice, shallot, and 2 teaspoons lemon peel in large bowl; whisk to blend. Season with salt and pepper. Add chicken and stir to coat. Marinate at room temperature 1 hour or chill up to 8 hours, turning chicken occasionally.",
        "Combine mayonnaise, sour cream, 1/4 cup dill, 1 tablespoon lemon juice, and 1 teaspoon peel in small bowl; whisk to blend. Season with salt and pepper. Cover and chill until ready to use.",
        "Steam potatoes until just tender, about 12 minutes. Transfer to large bowl; sprinkle with salt and pepper.",
        "Combine zucchini slices and 2 tablespoons olive oil in medium bowl. Sprinkle with salt; toss to coat. Heat grill pan or large ridged cast-iron skillet over high heat until very hot, about 4 minutes. Working in batches, grill zucchini slices until just crisp-tender, about 1 minute per side; transfer to plate. Grill chicken until brown and cooked through, about 6 minutes per side. Transfer to work surface; cool 15 minutes. Cut chicken into 1/2-inch cubes; add to potatoes in bowl. Mix in celery, olives, and dressing; season with salt and pepper.",
        "Overlap zucchini slices around edge of platter. Mound chicken salad in center."
    ],
    "ingredients": [
        "3/4 cup chopped fresh dill",
        "1/2 cup plus 2 tablespoons olive oil",
        "4 tablespoons fresh lemon juice",
        "1 large shallot, finely chopped",
        "3 teaspoons grated lemon peel",
        "4 large skinless boneless chicken breast halves",
        "3 tablespoons mayonnaise",
        "3 tablespoons sour cream",
        "1 pound red-skinned potatoes, unpeeled, cut into 1/2-inch cubes",
        "1 pound medium zucchini, cut on diagonal into 1/4-inch-thick slices",
        "3 celery stalks, thinly sliced",
        "1 cup coarsely chopped pitted large green Sicilian olives or other brine-cured green olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Olive",
        "Potato",
        "Marinate",
        "Picnic",
        "Lunch",
        "Lemon",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Sour Cream",
        "Dill",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Lemon Chicken Salad with Dill Cream Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lemon-chicken-salad-with-dill-cream-dressing-106942"
}
