{
    "directions": [
        "Preheat oven to 325 degrees F and place a rack in the center of the oven. Line a 9x5-inch baking pan with Reynolds Wrap(R) Non-Stick Foil and set aside.",
        "Whisk together flour, baking powder and salt in a medium bowl. Set aside.",
        "Cream together softened butter and cream cheese in the bowl of an electric stand mixer fitted with a paddle attachment. Stop the mixer occasionally to scrape down the bowl and make sure that the butter and cream cheese are evenly mixed. Add the sugar to the butter and cream cheese mixture, and beat on medium speed until smooth and creamy, about 3 minutes.",
        "Beat in one egg at a time, mixing for one minute after each addition. Stop the mixer and scrape down the sides of the bowl as necessary. Beat in vanilla extract.",
        "Add dry ingredients all at once. Beat on low speed until dry ingredients are completely incorporated. Spoon batter into prepared pan. Bake for 50 to 60 minutes, rotating once or twice during baking. Bake until a skewer inserted in the center comes out clean or with just a few crumbs. Allow cake to cool in the pan for 15 minutes before inverting onto a wire rack to cool to room temperature. Wrap the cooled cake and refrigerate for 4 hours or overnight.",
        "Slice the chilled pound cake into 8 thick slices.",
        "Toss the strawberries together with the sugar in a small bowl. Allow to rest at room temperature for 20 minutes.",
        "Whip the heavy cream with powdered sugar, salt and vanilla until soft peaks form. Set aside.",
        "Grill the slices of pound cake over a warm, greased grill until golden brown grill marks appear on both sides of cake, flipping once.",
        "Warm the strawberries on the grill by spooning strawberries among 8 Jumbo Reynolds(R) Aluminum Foil Baking Cups and warming alongside the pound cake.",
        "Serve warm pound cake slices with warmed strawberries and sweet cream."
    ],
    "ingredients": [
        "Pound Cake:",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup unsalted butter, room temperature",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 cups granulated sugar",
        "4 large eggs",
        "2 teaspoons pure vanilla extract",
        "Reynolds Wrap® Non Stick Aluminum Foil",
        "Strawberries:",
        "1 1/2 pounds fresh strawberries, hulled and sliced",
        "1/3 cup granulated sugar",
        "8 Reynolds® Aluminum Foil Baking Cups - jumbo",
        "Cream:",
        "1 1/2 cups heavy cream",
        "1/2 cup powdered sugar",
        "1 pinch salt",
        "1 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Strawberry Shortcake with Sweet Cream",
    "url": "http://allrecipes.com/recipe/247455/grilled-strawberry-shortcake-with-swe/"
}
