{
    "directions": [
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Whisk shallot, red wine vinegar, white balsamic vinegar, garlic, lemon juice, Dijon mustard, parsley, chives, cilantro, and dill together in a large bowl. Slowly stream olive oil into the mixture while whisking vigorously until the oil is incorporated into a smooth and creamy dressing.",
        "Arrange asparagus, corn, zucchini, yellow squash, green onions, bell pepper, and red onion onto baking sheets. Brush olive oil onto all the vegetables to coat; season with salt and pepper.",
        "Cook vegetables directly on preheated grill, turning frequently, until slightly charred and just tender, about 5 minutes for green onions, 8 minutes for asparagus, zucchini, yellow squash, bell pepper, and red onion, and 10 minutes for corn. Remove vegetables to the baking sheets used for preparation and cool.",
        "Cut asparagus, green onions, zucchini, yellow squash, and red bell pepper crosswise into 1-inch pieces and put into a large bowl. Quarter red onion slices; add to bowl. Cut corn kernels from cobs; add to bowl. Let vegetables cool to room temperature.",
        "Drizzle vinaigrette over the vegetable mixture and toss to coat."
    ],
    "ingredients": [
        "Vinaigrette:",
        "1 shallot, minced (optional)",
        "3 tablespoons red wine vinegar",
        "1 tablespoon white balsamic vinegar",
        "1 clove garlic, minced",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon Dijon mustard",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon chopped fresh chives",
        "1 tablespoon chopped fresh cilantro",
        "1 tablespoon chopped fresh dill",
        "1/2 cup extra-virgin olive oil, or more to taste",
        "Vegetable Salad:",
        "10 fresh asparagus spears, trimmed to 5 inches",
        "2 ears corn, husked",
        "2 zucchini, halved lengthwise",
        "2 yellow squash, halved lengthwise",
        "1 bunch green onions, tops trimmed a few inches",
        "1 large red bell pepper, cut lengthwise into 4 sections and seeded",
        "1 large red onion, sliced thickly",
        "1/4 cup olive oil, or as needed",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Vegetable Salad with Fresh Herb Vinaigrette",
    "url": "http://allrecipes.com/recipe/233437/grilled-vegetable-salad-with-fresh-he/"
}
