{
    "directions": [
        "Mix all ingredients in bowl. (Can be made 1 week ahead. Cover; chill. Bring to room temperature before using.)",
        "Mix first 4 ingredients in large bowl. Add watercress, cucumber, carrot, cilantro, and onion and toss to blend. Season with salt and pepper. Let stand 30 minutes or chill up to 1 hour, tossing occasionally.",
        "Stir coriander seeds in small skillet over medium heat until fragrant and slightly darker, about 2 minutes. Transfer seeds to plastic bag. Using mallet or hammer, coarsely crack seeds. Combine sesame oil and ginger in medium bowl; mix in coriander seeds, then scallops. Let stand at least 30 minutes or chill up to 1 hour.",
        "Prepare barbecue (medium-high heat). Thread 3 scallops onto each of 4 skewers. Brush barbecue rack with oil to prevent sticking. Grill scallops until just opaque in center, about 3 minutes per side. Divide vegetables among 4 plates. Top each with scallops and serve, passing hoisin-orange sauce separately.",
        "Available at Asian markets and many supermarkets."
    ],
    "ingredients": [
        "1 8.5-ounce jar hoisin sauce sauce*",
        "1/3 cup orange juice",
        "1 1/2 tablespoons unseasoned rice vinegar",
        "1 tablespoon grated orange peel",
        "2 garlic cloves, minced",
        "2 teaspoons minced peeled fresh ginger",
        "3 tablespoons fresh lime juice",
        "2 tablespoons oriental sesame oil",
        "1 teaspoon chili-garlic sauce*",
        "1 teaspoon fish sauce (nam pla)*",
        "1 bunch watercress, trimmed",
        "1 medium cucumber, peeled, seeded, cut into matchstick-size strips",
        "1 medium carrot, peeled, cut into matchstick-size strips",
        "3/4 cup cilantro leaves (from large bunch)",
        "1/2 red onion, very thinly sliced",
        "1 1/2 teaspoons whole coriander seeds",
        "1 tablespoon oriental sesame oil",
        "1 tablespoon minced peeled fresh ginger",
        "12 large sea scallops",
        "Vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Appetizer",
        "Orange",
        "Scallop",
        "Cucumber",
        "Carrot",
        "Summer",
        "Grill/Barbecue",
        "Watercress",
        "Cilantro",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Grilled Scallops with Vegetables and Hoisin-Orange Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-scallops-with-vegetables-and-hoisin-orange-sauce-105530"
}
