{
    "directions": [
        "If using tuna steaks, prepare grill.",
        "Season tuna steaks with salt and pepper and grill on an oiled rack set 5 to 6 inches over glowing coals 3 to 4 minutes on each side, or until just cooked through. (Alternatively, tuna steaks may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer tuna to a platter and cool. In a large sealable plastic bag combine lemon juice, thyme, and 1/4 cup oil and add grilled tuna. Marinate grilled tuna, chilled, turning bag occasionally, at least 1 hour and up to 1 day. If using canned tuna, drain tuna and in a bowl stir together with lemon juice, thyme, 1/4 cup oil, and salt and pepper to taste.",
        "In a bowl toss together parsley, onion, and remaining 2 tablespoons oil and season with salt and pepper. Pat roasted peppers dry. Halve focaccia horizontally and layer one half with peppers, tuna, capers, and parsley salad. Top sandwich with remaining focaccia half, pressing gently, and cut lengthwise in half and crosswise into thirds to make 6 sandwiches. Cut sandwiches in half diagonally and wrap tightly in plastic wrap. Chill sandwiches at least 1 hour and up to 1 day."
    ],
    "ingredients": [
        "2 pounds 1/2-inch-thick tuna steaks or four 6-ounce cans oil-packed tuna",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon minced fresh thyme leaves",
        "1/4 cup plus 2 tablespoons extra-virgin olive oil",
        "2 cups fresh flat-leafed parsley leaves",
        "1/8 cup sliced red onion (about 1)",
        "1 Thyme Focaccia",
        "3 large red bell peppers,roasted and peeled",
        "2 tablespoons drained capers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Tuna",
        "Bell Pepper",
        "Summer",
        "Thyme",
        "Parsley",
        "Capers",
        "Gourmet"
    ],
    "title": "Grilled Tuna and Roasted Pepper Sandwiches on Thyme Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tuna-and-roasted-pepper-sandwiches-on-thyme-focaccia-14159"
}
