{
    "directions": [
        "To make rémoulade, whisk together mustard and vinegar in a large bowl until combined well, then whisk in 2/3 cup oil with parsley, horseradish, pickle, scallion, paprika, cayenne, 1 1/4 teaspoons salt, and 1/2 teaspoon black pepper.",
        "Snip through shells of shrimp down middle of back using scissors, exposing vein and leaving tail and first segment of shell intact. Devein shrimp, leaving shells in place. (Shells will prevent shrimp from becoming tough on outside when grilled.) Toss shrimp with remaining 1/4 cup oil, remaining teaspoon salt, and remaining 1/2 teaspoon black pepper in a large bowl, then thread about 6 shrimp (through top and tail, leaving shrimp curled) onto each skewer.",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "Grill shrimp on lightly oiled grill rack, covered only if using a gas grill, turning over once, until just cooked through, 3 to 4 minutes total.",
        "When just cool enough to handle, push shrimp off skewers into rémoulade, then toss to combine well and cool at least 15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/4 cup Creole mustard* or other coarse-grain mustard",
        "1/4 cup white-wine vinegar",
        "2/3 cup plus 1/4 cup vegetable oil",
        "3 tablespoons minced fresh flat-leaf parsley",
        "2 1/2 tablespoons drained bottled horseradish",
        "2 1/2 tablespoons minced dill pickle",
        "2 tablespoons minced scallion greens",
        "2 teaspoons paprika (not hot)",
        "1 1/2 teaspoons cayenne",
        "2 1/4 teaspoons salt",
        "1 teaspoon black pepper",
        "3 lb large shrimp in shell (21 to 25 per lb)",
        "Special equipment: 14 (12-inch) wooden skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Low Carb",
        "Quick & Easy",
        "Horseradish",
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Parsley",
        "Gourmet"
    ],
    "title": "Grilled Shrimp Rémoulade",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-remoulade-109742"
}
