{
    "directions": [
        "In a blender blend olives, roasted pepper, garlic, mustard, vinegar, lemon juice, with salt and pepper to taste until smooth. With motor running, add 3 tablespoons oil in a stream and blend vinaigrette until emulsified.",
        "Discard small tough muscle from side of each scallop if necessary and in a small bowl toss scallops with remaining tablespoon oil and salt and pepper to taste.",
        "Heat a well-seasoned ridged grill pan over high heat until hot and grill scallops until just cooked through, 2 to 3 minutes on each side. Transfer scallops to a plate and keep warm. Grill tomatoes over high heat until tender and lightly charred, 1 to 2 minutes on each side.",
        "Toss arugula with half the vinaigrette and divide between 2 plates. Top arugula with scallops and tomatoes and serve with remaining vinaigrette if desired."
    ],
    "ingredients": [
        "1/4 cup chopped pitted Kalamata or other brine-cured black olives",
        "1 tablespoon finely chopped bottled roasted red pepper",
        "1/2 teaspoon minced garlic",
        "1 teaspoon Dijon mustard",
        "1 tablespoon red-wine vinegar",
        "1/4 teaspoon fresh lemon juice",
        "1/4 cup olive oil (preferably extra-virgin)",
        "1/2 pound sea scallops, rinsed and drained",
        "2 medium vine-ripened tomatoes, cut into wedges",
        "2 cups arugula, stems discarded and leaves washed well and spun dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Leafy Green",
        "Olive",
        "Shellfish",
        "Tomato",
        "Vegetable",
        "Quick & Easy",
        "Low/No Sugar",
        "Dinner",
        "Scallop",
        "Arugula",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Sea Scallops and Tomatoes with Olive Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sea-scallops-and-tomatoes-with-olive-vinaigrette-12069"
}
