{
    "directions": [
        "Whisk balsamic vinegar, 3 Tbsp. oil, 1 tsp. kosher salt, and 1/2 tsp. pepper in a small bowl. Finely grate 2 garlic cloves and whisk into marinade. Place steak in a resealable plastic bag. Pour marinade over steak, toss to coat, then let rest at room temperature at least 1 hour.",
        "Meanwhile, toss tomatoes and 1 tsp. kosher salt in a colander set over a large bowl; let rest 1 hour.",
        "Prepare a grill for medium-high heat or heat grill pan over medium-high; lightly oil grate or pan. Remove steaks from marinade and pat dry. Grill steaks, turning occasionally, until lightly charred on all sides and an instant-read thermometer inserted into the center registers 125°F, 8–10 minutes for medium-rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.",
        "Brush zucchini with oil; season with 1/4 tsp. kosher salt and 1/8 tsp. pepper. Grill, turning occasionally, until zucchini is charred and tender, about 10 minutes. Meanwhile, grill bread alongside zucchini, turning occasionally, until lightly charred and crisp, about 5 minutes. Transfer zucchini and bread to cutting board. Let cool slightly. Slice zucchini into 1/4\"-thick half moons. Crush remaining garlic clove and rub all over bread. Cut bread into 1\" cubes.",
        "Shake colander to thoroughly drain tomatoes, reserving liquid in bowl. Add mustard, white wine vinegar, and remaining 1/4 cup oil and 1/2 tsp. pepper to bowl with tomato liquid and whisk to combine. Add kale and zucchini and toss to coat. Add tomatoes, bread, and basil and toss just to combine. Top with steak and sprinkle with sea salt.",
        "Steak can be marinated 10 hours ahead; chill in bag. Let steak come to room temperature at least 1 hour before cooking."
    ],
    "ingredients": [
        "3 tablespoons balsamic vinegar",
        "1/4 cup plus 3 tablespoons olive oil, divided, plus more for brushing",
        "2 1/4 teaspoons kosher salt, divided",
        "1 1/8 teaspoons freshly ground black pepper, divided",
        "3 garlic cloves, divided",
        "1 (1–1 1/2-pound) hanger steak, center membrane removed, cut into 4 pieces",
        "1 1/2 pounds ripe beefsteak or heirloom tomatoes, cut into bite-size pieces",
        "2 medium zucchini, cut in half lengthwise",
        "4 thick slices country-style bread",
        "1 tablespoon Dijon mustard",
        "1 tablespoon white wine vinegar",
        "1 bunch Tuscan kale, ribs and stems removed, thinly sliced (about 3 1/2 cups)",
        "1 cup basil leaves, torn if large",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Grill",
        "Tomato",
        "Summer",
        "Salad",
        "Bread",
        "Basil",
        "Kale",
        "Zucchini",
        "Flaming Hot Summer"
    ],
    "title": "Grilled Steak Panzanella Salad With Tomato Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-panzanella-salad-with-tomato-vinaigrette"
}
