{
    "directions": [
        "Arrange eight 24-inch-long pieces of kitchen string, side by side and 1 1/2 inches apart, on surface. Overlap bay leaves atop strings in rectangle about same size as fish. Top bay leaves with overlapping rows of lemon slices. Sprinkle fish skin with coarse salt and freshly ground black pepper; place fish, skin side down, on lemon slices. Sprinkle fish flesh with coarse salt and pepper; drizzle with olive oil. Top with overlapping rows of lemon slices, then bay leaves. Tightly tie strings, securing lemon slices and bay leaves to fish. Place fish packet in grilling basket; close basket (basket does not have to close completely in order to support fish). DO AHEAD: Can be made 2 hours ahead. Chill salmon in basket. Bring to room temperature before grilling.",
        "Prepare barbecue (medium-high heat). Grill fish in basket until just firm to touch and thermometer inserted into thickest part registers 135°F, holding basket sides together to turn fish, about 20 minutes per side. Transfer fish to platter, with string knots up. Remove strings, bay leaves, and lemons from top side. Drizzle with oil; serve."
    ],
    "ingredients": [
        "4 3/4-ounce packages fresh bay leaves, divided",
        "6 to 7 lemons, very thinly sliced into rounds, divided",
        "1 3-pound center-cut salmon fillet with skin",
        "Coarse kosher salt",
        "Olive oil (for drizzling)",
        "kitchen string",
        "Large fish-grilling basket"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Cal",
        "Backyard BBQ",
        "Lunch",
        "Lemon",
        "Seafood",
        "Salmon",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Salmon Wrapped in Lemon and Bay Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-salmon-wrapped-in-lemon-and-bay-leaves-353835"
}
