{
    "directions": [
        "Combine garlic, oil, and oregano in large bowl; whisk to blend. Add lamb, sprinkle with 1 teaspoon coarse salt and freshly ground black pepper, and toss to coat. Cover and chill 1 hour. DO AHEAD: Can be made 1 day ahead. Keep refrigerated, tossing occasionally.",
        "Char peppers directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag and steam 10 minutes. Peel, seed, and coarsely chop peppers. DO AHEAD: Can be made 1 day ahead. Wrap and chill.",
        "Place eggplant in large colander. Sprinkle with salt and toss to coat. Let stand 30 minutes. Rinse eggplant; drain well and pat dry. Heat 3 tablespoons oil in large nonstick skillet over medium-high heat. Add eggplant to skillet and sauté until tender, about 5 minutes. Remove skillet from heat. Add lemon juice, capers, oregano, roasted peppers, and remaining 1 tablespoon oil to eggplant and toss to combine. Season to taste with salt and pepper. Transfer salad to large bowl.",
        "Prepare barbecue (medium-high heat). Thread lamb cubes onto 6 long metal skewers, dividing equally. Grill lamb until cooked to desired doneness, turning skewers occasionally, about 10 minutes for medium-rare.",
        "Add arugula to eggplant salad and toss gently to combine. Serve lamb spiedini with salad alongside."
    ],
    "ingredients": [
        "3 large garlic cloves, finely chopped",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh oregano",
        "2 3/4 pounds 3/4- to 1-inch-thick lamb shoulder blade chops, fat trimmed, deboned, meat cut into 3/4-inch cubes (about 1 1/2 pounds yield)",
        "1 teaspoon coarse kosher salt",
        "Freshly ground black pepper",
        "2 red bell peppers",
        "1 large eggplant (14 to 15 ounces), peeled, cut into 1-inch cubes",
        "4 tablespoons olive oil, divided",
        "3 tablespoons fresh lemon juice",
        "1 1/2 tablespoons drained capers",
        "1 tablespoon chopped fresh oregano",
        "4 cups baby arugula (3 to 4 ounces)",
        "Special equipment: 6 long metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Eggplant",
        "Arugula",
        "Bell Pepper",
        "Grill",
        "Grill/Barbecue",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Lamb Spiedini with Eggplant, Red Bell Pepper, and Arugula Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lamb-spiedini-with-eggplant-red-bell-pepper-and-arugula-salad-361275"
}
