{
    "directions": [
        "Whisk first 5 ingredients in small bowl. Season marinade with salt and pepper.",
        "Combine 1/2 cup marinade, cucumber and next 4 ingredients in medium bowl; season salsa with salt and pepper. Let stand 30 minutes; toss occasionally.",
        "Spray barbecue rack with nonstick spray and prepare barbecue (medium-high heat). Place salmon, skin side down, in large glass baking dish. Top with remaining marinade. Let stand 10 minutes. Sprinkle with salt and pepper.",
        "Spray basket with nonstick spray. Place salmon in fish basket, folding tail under if fish is too long. Place basket on barbecue and grill salmon, skin side up, 5 minutes. Turn basket over; grill salmon until just opaque in center, about 5 minutes longer. Turn salmon out onto platter.",
        "Spray rimless baking sheet with nonstick spray. Place salmon, skin side up, on sheet. Spray skin with nonstick spray. Slide salmon, skin side up, onto barbecue. Grill 5 minutes. Stand blade of large spatula at 1 long side of salmon to hold in place. From opposite side, slide rimless baking sheet completely under salmon. Hold salmon with spatula; turn sheet and salmon over, releasing salmon, skin side down, onto barbecue. Grill salmon until just opaque in center, about 5 minutes longer. Slide baking sheet under salmon; transfer fish to platter. Serve with salsa."
    ],
    "ingredients": [
        "1/3 cup fresh lemon juice",
        "1/3 cup extra-virgin olive oil",
        "1/3 cup chopped shallots",
        "1 tablespoon grated lemon peel",
        "1 3/4 teaspoons ground cumin",
        "1 medium English hothouse cucumber, unpeeled, diced",
        "1 12-ounce basket small cherry tomatoes, each quartered",
        "1 large yellow bell pepper, diced",
        "1/4 cup drained capers",
        "2 tablespoons chopped fresh cilantro",
        "Nonstick vegetable oil spray",
        "1 2 1/2- to 2 3/4-pound salmon fillet with skin (1 whole side)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Low Carb",
        "Backyard BBQ",
        "Salmon",
        "Cucumber",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Capers"
    ],
    "title": "Grilled Salmon with Tomato, Cucumber and Caper Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-salmon-with-tomato-cucumber-and-caper-salsa-101820"
}
