{
    "directions": [
        "Melt 6 tablespoons butter in heavy small saucepan over medium heat. Add minced shallot and cook until translucent, about 2 minutes. Add vinegar and rosemary and simmer until syrupy and reduced to 1/2 cup, about 6 minutes. Remove from heat (balsamic sauce will separate as it stands).",
        "Prepare barbecue (medium-high heat). Peel sweet onions, then cut into 1/2-inch-thick rounds. Skewer horizontally with toothpicks to keep intact. Peel shallots; cut in half lengthwise. Trim root ends and tops of leeks. Cut in half lengthwise; rinse to remove any dirt. Trim root ends of green onions. Place sweet onions, shallots, leeks, and green onions on rimmed baking sheet and drizzle with oil; toss. Sprinkle with salt and pepper.",
        "Sprinkle steaks with salt and pepper. Grill sweet onions, shallots, leeks, and green onions until tender, turning often, about 5 minutes for green onions and 10 minutes for sweet onions, shallots, and leeks. Move onions to cooler part of grill to keep warm. Grill steaks to desired doneness, about 7 minutes per side for medium-rare. Transfer steaks and onions to platter; cover.",
        "Remove rosemary sprigs from balsamic sauce; add orange juice and bring to simmer. Remove saucepan from heat; add remaining 2 tablespoons chilled butter and whisk until melted and sauce is smooth. Season sauce to taste with salt and pepper. Drizzle some of sauce over steaks and onions. Serve, passing remaining sauce separately."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) chilled unsalted butter, divided",
        "1 large shallot, minced",
        "1/2 cup balsamic vinegar",
        "2 large fresh rosemary sprigs",
        "2 pounds mixed sweet onions, large shallots, baby leeks, and green onions",
        "2 tablespoons olive oil",
        "4 (1 1/4-inch-thick) New York strip steaks (each about 6 ounces)",
        "2 tablespoons orange juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Onion",
        "Backyard BBQ",
        "Dinner",
        "Rosemary",
        "Steak",
        "Fall",
        "Summer",
        "Grill/Barbecue",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Steak and Onions with Rosemary-Balsamic Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-and-onions-with-rosemary-balsamic-butter-sauce-235595"
}
