{
    "directions": [
        "1. Marinating the Meat. In a food processor or blender combine one-quarter of the onions, the garlic, lime juice, cumin and 1/2 teaspoon salt. Process to a smooth puree. Place the skirt steak in a nonaluminum baking dish. Using a spoon, smear the marinade over both sides of the skirt steak. Cover and refrigerate for at least 1 hour or up to 8 hours.",
        "2. Making the Grilled Chile-and-Onion Rajas. Turn on the oven to its lowest setting. Heat a gas grill to medium high or light a charcoal fire and let it burn just until the coals are covered with gray ash and very hot. Either turn the burner(s) in the center of the grill to medium-low or bank the coals to the sides of the grill for indirect cooking. Set the cooking grate in place, cover the grill and let the grate heat up, 5 minutes or so.",
        "Lay the chiles on the hottest part of the grill, and cook, turning occasionally until the skin is blistered and uniformly blackened all over, about 5 minutes. Be careful not to char the flesh, only the skin. Remove the chiles from the grill and cover with a kitchen towel.",
        "While the chiles are roasting, brush or spray the remaining onion slice with oil and lay the whole rounds of onions on the grill in a cooler spot than you chose for the chiles. When they're starting to soften and are browned on the first side, about 10 minutes, use a spatula to flip them and brown the other side. Transfer to an ovenproof serving dish and separate the rings (if they haven't started separating during grilling).",
        "3. Grilling the Meat. Remove the steak from the marinade and gently shake off the excess. Oil the steak well on both sides and lay it over the hottest part of the grill. Grill, turning once, until richly browned and done to your liking, about 1 1/2 to 2 minutes per side for medium-rare (the way I like skirt steak).",
        "4. Serving the tacos. Cut the long piece of skirt steak into 3-to 4-inch lengths, then cut each section across the grain (that is, in line with the full length of the steak) into thin strips. Mix with the chiles and onions, season with a little salt and set on the table along with the lime wedges and hot tortillas, for your guests to make into soft tacos.",
        "Working Ahead: Thin steaks like skirt taste best with a relatively short tour in the marinade — 1 to 8 hours. Leave them longer, and the marinade overpowers the flavor and saps the rosy color of the meat. The poblano-and-onion rajas can be made several hours ahead and left at room temperature; rewarm before serving. The steak, of course, must be grilled just before you're ready to eat."
    ],
    "ingredients": [
        "2 medium white onions, sliced into 1/2-inch rounds (keep the rounds intact for easy grilling)",
        "3 garlic cloves, peeled and roughly chopped",
        "3 tablespoons fresh lime juice",
        "1/4 teaspoon cumin, preferably freshly ground",
        "Salt",
        "1 pound beef skirt steak, trimmed of surface fat as well as the thin white membrane called \"silverskin\"",
        "Vegetable or olive oil for brushing or spritzing the onions and meat",
        "A small bowlful of lime wedges for serving",
        "12 warm, fresh corn tortillas (See how to reheat corn tortillas )"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Pepper",
        "Lime",
        "Fall",
        "Grill/Barbecue"
    ],
    "title": "Grilled Skirt Steak Tacos with Roasted Poblano Rajas",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-skirt-steak-tacos-with-roasted-poblano-rajas-105445"
}
