{
    "directions": [
        "Blend all ingredients in blender until smooth. Season with salt and pepper. (Can be made 2 days ahead. Cover and refrigerate.)",
        "Grind peppercorns, coriander seeds and fennel seeds to fine powder. Lightly spray steak with nonstick spray; sprinkle each side with salt, pepper and 1 1/2 teaspoons spice mix. Let stand 30 minutes.",
        "Prepare barbecue (medium-high heat). Grill steak until cooked to desired doneness, about 5 minutes per side for medium-rare. Using tongs, transfer steak to cutting board. Tent with foil to keep warm. Let rest 10 minutes.",
        "Meanwhile, spray asparagus and onion slices with nonstick spray; sprinkle with salt and pepper. Grill asparagus until crisp-tender and slightly charred, turning often, about 5 minutes. Transfer asparagus to plate. Keeping slices intact, grill onion until slightly charred and almost tender, about 4 minutes per side; transfer to plate with asparagus.",
        "Cut steak crosswise into thin slices. Arrange steak and asparagus on 6 plates. Drizzle with vinaigrette. Garnish salads with some onion rings and orange slices."
    ],
    "ingredients": [
        "1/4 cup hoisin sauce",
        "1/4 cup white wine vinegar",
        "1/4 cup canned low-salt chicken broth",
        "2 tablespoons olive oil",
        "4 teaspoons minced peeled fresh ginger",
        "1 tablespoon soy sauce",
        "2 teaspoons hot Chinese-style mustard or Dijon mustard",
        "1 tablespoon black peppercorns",
        "2 teaspoons coriander seeds",
        "2 teaspoons fennel seeds",
        "1 1-pound top sirloin steak (about 1 inch thick)",
        "Nonstick olive oil spray",
        "1 1/4 pounds thin asparagus spears, trimmed",
        "3 thin red onion slices",
        "Orange slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Steak",
        "Asparagus",
        "Summer"
    ],
    "title": "Grilled Steak and Asparagus Salad with Hoisin Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-and-asparagus-salad-with-hoisin-vinaigrette-5663"
}
