{
    "directions": [
        "Cut a shallow X in bottom of each peach and tomato with a sharp paring knife and blanch in 2 batches in a 4-quart saucepan of boiling water 10 seconds. Transfer peaches and tomatoes with a slotted spoon to a bowl of ice and cold water and let stand until cool enough to handle. Peel peaches and tomatoes, then halve peaches lengthwise and pit. Cut peaches into 1-inch pieces. Coarsely chop tomatoes.",
        "Cook onion, ginger, and salt in oil in a 3-quart heavy saucepan over moderate heat, stirring occasionally, until softened, 3 to 4 minutes. Add curry powder and cook, stirring constantly, 1 minute. Add peaches and tomatoes with any juices, sugar, and lime juice and simmer, uncovered, stirring occasionally, until mixture is thick and peaches are tender but still hold their shape, about 8 minutes. Transfer to a bowl and cool, uncovered, then chill, covered, at least 8 hours.",
        "Combine scallions, thyme, salt, allspice, pepper, lime juice, molasses, and hot sauce in a blender and blend until smooth. Put pork in a nonreactive dish and rub all over with marinade. Marinate, covered and chilled, turning occasionally, 8 hours. Bring to room temperature before grilling.",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas); see \"Grilling Procedure,\" below.",
        "Discard any marinade remaining in dish, then brush pork lightly with oil and grill on a lightly oiled grill rack, turning occasionally and basting frequently with oil, until thermometer inserted diagonally into center of meat registers 145°F, 15 to 25 minutes.",
        "Transfer pork to a cutting board and let stand 15 minutes. (Internal temperature will rise to about 155°F.) Serve pork with relish.",
        "If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows:",
        "Hot: When you can hold your hand there for 1 to 2 seconds",
        "Medium-hot: 3 to 4 seconds",
        "Low: 5 to 6 seconds",
        "If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.",
        "*Available at most supermarkets and kitchenmarket.com."
    ],
    "ingredients": [
        "1 1/2 lb firm-ripe peaches",
        "1/2 lb tomatoes",
        "1/2 cup chopped red onion (1 medium)",
        "1 tablespoon minced peeled fresh ginger",
        "1 teaspoon kosher salt",
        "1 tablespoon vegetable oil",
        "1 1/2 teaspoons curry powder",
        "2 tablespoons sugar",
        "1 tablespoon fresh lime juice",
        "3 scallions (white and pale green parts only), trimmed",
        "1 tablespoon chopped fresh thyme",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon black pepper",
        "2 tablespoons fresh lime juice",
        "1 tablespoon molasses (not robust or blackstrap)",
        "1 teaspoon Scotch bonnet or habanero hot sauce*, or to taste",
        "2 pork tenderloins (1 3/4 to 2 lb total)",
        "2 tablespoons vegetable oil for basting",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Tomato",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Peach",
        "Curry",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Jerk Pork With Curried Peach Relish",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-jerk-pork-with-curried-peach-relish-232488"
}
