{
    "directions": [
        "Combine coconut milk, shallots, garlic, lemongrass, jalapeños, ginger, lime juice, tamarind juice, fish sauce, kosher salt, turmeric, and 1 cup water in a blender. Purée mixture until a smooth marinade forms.",
        "Place chicken wings in a large baking dish. Pour marinade over; turn wings to coat evenly. Cover chicken and chill overnight.",
        "Remove chicken from marinade, shaking any excess marinade back into dish. Transfer chicken to a large platter. Let stand at room temperature for 15 minutes.",
        "Transfer marinade to a large saucepan and bring to a boil over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until marinade thickens, 10-15 minutes. Pour half of marinade into a small bowl; set aside for basting chicken while it grills. Keep remaining marinade in saucepan; cover and keep warm until ready to serve the chicken.",
        "Build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Oil grill grates to prevent sticking. Grill chicken wings, turning every 5 minutes and basting occasionally with marinade in small bowl, until fat is rendered and skin is nicely charred in spots, 30-35 minutes. (The key here is to turn the wings often so the skin doesn't burn.)",
        "Continue cooking chicken without basting (so it will get crisp) until wings are cooked through, about 10 minutes longer.",
        "Transfer chicken to a large platter and let it rest for 5 minutes. Squeeze lime wedges over wings. Transfer marinade in saucepan to a small bowl. Serve warm marinade alongside chicken as a dipping sauce."
    ],
    "ingredients": [
        "1 cup canned unsweetened coconut milk",
        "3 shallots, chopped",
        "3 garlic cloves",
        "2 lemongrass stalks (bottom third only, tough outer layers removed), finely chopped",
        "2 jalapeños, stemmed",
        "1 1\" piece ginger, peeled, chopped",
        "2 tablespoons fresh lime juice",
        "2 tablespoons tamarind juice concentrate (not paste or pulp) or 1 tablespoons fresh lime juice",
        "1 tablespoons fish sauce (such as nuoc nam or nam pla)",
        "2 teaspoons kosher salt",
        "1 teaspoon turmeric",
        "3 pounds whole chicken wings",
        "Vegetable oil (for grill)",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Lemongrass",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Turmeric and Lemongrass Chicken Wings",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-turmeric-and-lemongrass-chicken-wings-51104390"
}
