{
    "directions": [
        "Whisk vinegar, shallots, and mustard in small bowl to blend. Gradually whisk in oil. Season vinaigrette with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Bring vinaigrette to room temperature and rewhisk before using.)",
        "Spray grill rack with nonstick spray. Prepare barbecue (medium-high heat). Cut cornbread into 4 squares; remove from pan. Cut each square into four 1-inch-wide strips. Brush cornbread strips lightly on all sides with oil. Grill bread just until grill marks appear, about 1 minute per side. Transfer bread to work surface; cool. Brush onion rounds with oil. Grill until tender and golden, turning once, about 6 minutes per side. Transfer to large bowl; cool.",
        "Cut bread into 1-inch cubes. Separate onion rounds into rings; return onions to same bowl. (Grilled cornbread and onions can be prepared 4 hours ahead; let stand at room temperature.)",
        "Add tomatoes, arugula, basil, cucumber, and olives to bowl with onion rings. Add vinaigrette and toss to coat, then add cornbread and toss gently; serve."
    ],
    "ingredients": [
        "1/4 cup red wine vinegar",
        "3 tablespoons minced shallots",
        "1 tablespoon Dijon mustard",
        "2/3 cup olive oil",
        "Nonstick vegetable oil spray",
        "Buttermilk Cornbread with Monterey Jack Cheese",
        "Olive oil",
        "2 small red onions, cut into 3/4-inch-thick rounds",
        "1 12-ounce container cherry tomatoes, halved",
        "1 5-ounce package baby arugula",
        "2 cups (packed) torn fresh basil leaves",
        "1/2 English hothouse cucumber, halved lengthwise, then thinly sliced crosswise",
        "1/2 cup oil-cured black olives, pitted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Onion",
        "Tomato",
        "Vegetable",
        "Side",
        "Fourth of July",
        "Backyard BBQ",
        "Arugula",
        "Summer",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Cornbread Salad with Red Onions, Arugula, and Red Wine Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-cornbread-salad-with-red-onions-arugula-and-red-wine-vinaigrette-232371"
}
