{
    "directions": [
        "Make the dressing: In a blender blend together the garlic, the vinegar, 1 tablespoon of the lemon juice, the sun-dried tomatoes, the plum tomatoes, and 1/4 cup water until the mixture is smooth and with the motor running add the oil in a stream. Add the sour cream, the coriander, the additional lemon juice, and salt and pepper to taste and blend the dressing until it is combined well. (The dressing may be made 1 day in advance and kept covered and chilled. Let the dressing return to room temperature.)",
        "In a large bowl toss the mesclun with the tomatoes and the corn and divide the mixture among 4 plates. Brush the tuna on both sides with the oil, season it with salt and pepper, and grill it on an oiled rack set about 4 inches over glowing coals for 4 to 5 minutes on each side for medium-rare, or until is cooked to the desired degree. Let the tuna stand for 3 minutes and cut it against the grain into 1/4-inch-thick slices. Divide the tuna slices among the salads and pour about 1/4 cup of the dressing over each serving. Serve any remaining dressing separately and garnish the salads with nasturtium blossoms."
    ],
    "ingredients": [
        "1 large garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "2 tablespoons red-wine vinegar",
        "1 tablespoon fresh lemon juice plus additional to taste",
        "1/4 cup finely chopped drained sun-dried tomatoes packed in oil",
        "2 plum tomatoes, seeded and chopped",
        "1/2 cup olive oil",
        "2 tablespoons sour cream",
        "1/2 cup packed fresh coriander",
        "10 cups loosely packed mesclun (mixed baby greens, available at specialty produce markets)",
        "1 cup cherry tomatoes, halved lengthwise",
        "1 cup cooked fresh corn (cut from about 2 ears)",
        "two 1-inch-thick tuna steaks (about 1-1/2 pounds) olive oil for brushing the tuna nasturtium blossoms for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Leafy Green",
        "Tomato",
        "Backyard BBQ",
        "Tuna",
        "Corn",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Grilled Tuna Salad with Sun-Dried Tomato Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tuna-salad-with-sun-dried-tomato-dressing-12342"
}
