{
    "directions": [
        "Gently slide finger tips between chicken meat and skin along 1 long side of each breast, leaving skin attached on opposite ling side. Place 3 goat cheese rounds under skin of each chicken breast. skewer seams closed with toothpicks. Sprinkle chicken with salt and pepper. (Can be made 1 day ahead. Cover and chill.)",
        "Prepare barbecue (medium-high heat) or preheat broiler. Place oil in large bowl. Place onions on baking sheet. Brush with 1 tablespoon oil. Add bell peppers to remaining oil in bowl; toss to coat. Sprinkle onions and peppers with salt and pepper. Grill or broil chicken, skin toward heat, until cooked through, turning occasionally, abut 22 minutes. Transfer to baking sheet; tent with foil. Grill or broil onions and peppers until lightly charred, turning occasionally, about 4 minutes.",
        "Remove toothpicks from chicken. Arrange chicken, onions and peppers on plates. Spoon Jalapeño Salsa over chicken. Spoon Tomato Salsa on side. Sprinkle with chives and serve."
    ],
    "ingredients": [
        "6 large chicken breast halves with skin and bones",
        "1 11-ounce log chilled soft fresh goat cheese (such as Montrachet), cut into eighteen 1/3- to 1/2-inch-thick rounds",
        "2 tablespoons extra-virgin olive oil",
        "2 medium-size sweet onions (such as Maui), cut into 1/2-inch-wide slices",
        "2 red bell pepper, cut into 1-inch-wide strips",
        "2 yellow bell pepper, cut into 1-inch-wide strips",
        "1 bunch fresh chives, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Pepper",
        "Broil",
        "Low Carb",
        "Goat Cheese",
        "Summer",
        "Chive"
    ],
    "title": "Grilled Chicken with Goat Cheese Stuffing, Peppers, Onions and Two Salsas",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-with-goat-cheese-stuffing-peppers-onions-and-two-salsas-4495"
}
