{
    "directions": [
        "To make the smoked paprika marinade, in a nonreactive bowl, stir together the olive oil, vinegar, orange juice, paprika, garlic and oregano until blended.",
        "Lay the flank steak in a nonreactive baking dish and add the marinade. Turn the steak a few times to coat it with the marinade, cover, and refrigerate for at least 2 hours or preferably overnight, turning once or twice.",
        "About 1 hour before cooking, remove the flank steak from the refrigerator. Cut the onions crosswise into rounds 1/2 inch thick (do not separate the layers). Cut the bell peppers into wide planks, removing and discarding the stems, seeds and ribs. Brush the vegetables with 2 Tbs. of the olive oil and season lightly with salt and pepper.",
        "Prepare a grill for direct-heat grilling over medium-high heat.",
        "In a food processor, combine the remaining 2 Tbs. olive oil, the orange juice, vinegar, paprika, garlic, piquillo peppers, almonds, a scant 1/2 tsp. salt and a few grinds of pepper. Process until a relatively smooth dressing forms, about 15 seconds. Taste and adjust the seasonings. Set aside.",
        "Grill the onions and peppers, turning once, until softened and lightly charred on both sides, 7 to 10 minutes for the onions and about 15 minutes for the peppers. Transfer to a plate.",
        "Remove the meat from the marinade and season on both sides with salt and pepper. Grill, turning once, until browned on both sides and an instant-read thermometer inserted into the thickest part of the meat registers 130°F for medium-rare, 10 to 15 minutes total, or until cooked to your liking.",
        "Transfer the steak to a cutting board and cover loosely with aluminum foil. Cut the peppers into 1/2-inch-wide strips and separate the onion slices into rings.",
        "In a bowl, toss the lettuce with 1/8 tsp. salt. Divide the lettuce among individual plates. Thinly slice the steak on the diagonal. Top each mound of lettuce with an equal amount of the steak, onion and peppers. Spoon the dressing over each salad, dividing evenly, and sprinkle with a little parsley. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Salads,",
        "by Dina Cheney (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "1/3 cup sherry vinegar",
        "2 Tbs. fresh orange juice",
        "1 Tbs. Spanish sweet smoked paprika",
        "5 garlic cloves, minced",
        "1 1/2 Tbs. fresh oregano leaves",
        "1 beef flank steak, 2 3/4 lb.",
        "2 small red onions",
        "3 bell peppers (1 each yellow, red and orange)",
        "4 Tbs. extra-virgin olive oil",
        "Sea salt and freshly ground pepper, to taste",
        "1 Tbs. fresh orange juice",
        "2 Tbs. sherry vinegar",
        "1/4 tsp. Spanish sweet smoked paprika",
        "2 garlic cloves, minced",
        "3 jarred piquillo peppers",
        "1 1/2 Tbs. chopped blanched almonds",
        "1/2 large head green leaf lettuce, leaves torn into bite-size pieces",
        "2 Tbs. chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Steak, Pepper and Onion Salad with Romesco Dressing",
    "url": "http://www.williams-sonoma.com/recipe/grilled-steak-pepper-and-onion-salad-with-romesco-dressing.html"
}
