{
    "directions": [
        "Honey Garlic Chicken Kabobs: Spray grate of outdoor grill with PAM(R) Grilling for Grill Spray. Preheat grill to medium-high heat.",
        "Evenly thread chicken, red pepper, green pepper and onion onto 8 skewers. Brush each skewer with VH(R) Honey Garlic Sauce.",
        "Grill kabobs, turning occasionally, for 15 to 18 minutes or until chicken is cooked through.",
        "Grilled Mushroom and Goat Cheese Rotini: Preheat grill to medium-high heat. Season mushrooms with salt and pepper; spray with PAM(R) Olive oil or PAM(R) Original. Grill mushrooms for 3 to 5 minutes per side or until grill-marked and tender. Let cool slightly and slice.",
        "Cook Catelli Bistro(R) Rotini according to package directions; drain, reserving 1/4 cup (60 mL) cooking water.",
        "Meanwhile, in large, deep skillet, heat Aylmer(R) Accents(R) Italian Seasonings Chunky Stewed Tomatoes over medium heat until simmering. Simmer for 10 minutes. Toss with reserved cooking water, rotini and sliced mushrooms. Top with goat cheese and parsley before serving."
    ],
    "ingredients": [
        "Honey Garlic Chicken Kabobs",
        "1 pound boneless skinless chicken breasts, cut into 1-inch cubes",
        "1/2 cup VH® Honey Garlic Sauce",
        "PAM® for Grilling",
        "1 large red pepper, cut into 16 chunks",
        "1 large green pepper, cut into 16 chunks",
        "1 red onion, cut into 16 chunks",
        "Grilled Mushroom and Goat Cheese Rotini",
        "4 medium portobello mushroom caps, gills removed",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "PAM® Olive Oil or PAM® Original",
        "1/2 (12 ounce) package Catelli Bistro® Rotini",
        "1 (540 mL) can Aylmer® Accents® Italian Seasonings Chunky Stewed Tomatoes",
        "1/2 cup crumbled goat cheese",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Mushroom and Goat Cheese Rotini with Honey Garlic Chicken Kabobs",
    "url": "http://allrecipes.com/recipe/247081/grilled-mushroom-and-goat-cheese-roti/"
}
