{
    "directions": [
        "Prepare grill.",
        "Trim eggplant and cut lengthwise into 1/4-inch-thick slices. Using a total of 3 tablespoons oil for eggplant, lightly brush both sides of each slice with some oil and grill in batches on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side. (Alternatively, broil eggplant under a preheated broiler about 3 inches from heat.) With a metal spatula transfer eggplant as grilled to a platter and keep warm, loosely covered.",
        "Cut an X in blossom end of each plum tomato. Have ready a bowl of ice and cold water. In a small saucepan of boiling water blanch tomatoes 10 seconds and transfer with a slotted spoon to ice water to stop cooking. Peel tomatoes and seed. Chop blanched and dried tomatoes. Mince onion and garlic.",
        "In a 10-inch heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté onion, garlic, and pine nuts, stirring, until onion and pine nuts are golden. Add blanched and dried tomatoes and herbs and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes. Add goat cheese and Parmesan and cook, stirring, just until melted. Remove skillet from heat and season filling with salt and pepper.",
        "Put a generous tablespoon filling at wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling. Make more roulades in same manner and arrange on a warm platter."
    ],
    "ingredients": [
        "1 medium eggplant",
        "4 tablespoons olive oil",
        "3 plum tomatoes",
        "5 dried tomatoes packed in oil",
        "1 small onion",
        "1 garlic clove",
        "2 tablespoons pine nuts",
        "2 tablespoons finely chopped mixed fresh herbs (such as basil, mint, parsley, and tarragon leaves)",
        "1/4 cup crumbled soft mild goat cheese (about 2 ounces)",
        "1 tablespoon freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Side",
        "Pine Nut",
        "Eggplant",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Eggplant Roulades Olivo",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-eggplant-roulades-olivo-15516"
}
