{
    "directions": [
        "1. Combine the ground beef, onion, garlic, soy sauce, eggs, ginger, salt, and pepper in the bowl. Mix the ingredients with your hands until they are well blended and hold together well.",
        "2. Preheat the broiler.",
        "3. Brush the baking sheet with 2 teaspoons of the oil. With your hands, form the meat mixture into 24 round balls and place them 1 1/2 inches apart on the baking sheet. (Each ball should weigh about 1/2 ounce.) Lightly moisten your hands before forming each ball to facilitate rolling. Brush the meatballs with the remaining oil and broil them, 4 inches from the heating element, 6 to 8 minutes, turning them once, until they are cooked through.",
        "Place the meatballs in a shallow bowl with the Indian-Spiced Yogurt Sauce on the side, or cut off the top of a small round loaf of bread, remove the insides, and spoon the meatballs into the bread. Dust with chopped parsley for color.",
        "1. Line the strainer with the cheesecloth. Place it over a bowl and spoon the yogurt into the strainer. Allow the yogurt to drain in the refrigerator for 3 hours.",
        "2. Transfer the drained yogurt from the cheesecloth to the other bowl and blend in the garlic, lemon juice, oil, cumin, turmeric, and cayenne. Season to taste with salt and black pepper."
    ],
    "ingredients": [
        "2 pounds ground beef round",
        "1 large red onion, minced",
        "2 large cloves garlic",
        "3 tablespoons light soy sauce",
        "2 large eggs, beaten",
        "1 teaspoon minced ginger",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground pepper",
        "4 teaspoons extra virgin olive oil",
        "1 pint yogurt",
        "2 medium cloves garlic, minced",
        "1 tablespoon fresh lemon juice",
        "2 tablespoons extra virgin olive oil",
        "2 teaspoons ground cumin",
        "2 teaspoons ground turmeric",
        "1/4 teaspoon cayenne",
        "Salt and freshly ground pepper",
        "2 tablespoons minced curly parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Appetizer",
        "Broil",
        "Yogurt",
        "Dinner",
        "Meat",
        "Shower",
        "Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Grilled Meatballs with Indian-Spiced Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-meatballs-with-indian-spiced-yogurt-sauce-355974"
}
