{
    "directions": [
        "1. Place the cream in a chilled mixer bowl or in a large metal bowl. Beat with a mixer until soft peaks form, starting on the slow speed and gradually increasing the speed to high. The total beating time will be 6 to 8 minutes. When soft peaks have formed, add the confectioners' sugar, cinnamon, and tequila. Continue beating the cream until stiff peaks form, about 2 minutes longer. Don't overbeat the cream or it will start to turn to butter. The tequila whipped cream can be made several hours ahead. Refrigerate it, covered, until ready to serve.",
        "2. Lightly brush each slice of pound cake with butter on both sides. Cook the pound cake, following the instructions below for any of the grills, until lightly toasted. If desired, rotate each slice a quarter turn after 1 minute to create a handsome crosshatch of grill marks. You may need to cook the pound cake slices in more than one batch.",
        "3. Place the pound cake slices on plates. Top each serving with a spoonful of Pineapple \"Salsa\" and a dollop of tequila whipped cream, garnish with a sprig of mint, and serve at once.",
        "Preheat the grill; if your contact grill has a temperature control, preheat the grill to high. Place the drip pan under the front of the grill. When ready to cook, lightly oil the grill surface. Place the slices of pound cake on the hot grill, then close the lid. The pound cake will be done after cooking 2 to 4 minutes.",
        "Place the grill pan on the stove and preheat it to medium-high over medium heat. When the grill pan is hot a drop of water will skitter in the pan. When ready to cook, lightly oil the ridges of the grill pan. Place the slices of pound cake in the hot grill pan. They will be done after cooking 2 to 4 minutes per side.",
        "Preheat the grill to high, then, if it does not have a nonstick surface, brush and oil the grill grate. Place the pound cake slices on the hot grate. They will be done after cooking 2 to 4 minutes per side.",
        "Preheat the grill to high; there's no need to oil the grate. Place the pound cake slices on the hot grill. They will be done after cooking 3 to 5 minutes per side.",
        "Rake red hot embers under the gridiron and preheat it for 3 to 5 minutes; you want a hot, 2 to 3 Mississippi fire. When ready to cook, brush and oil the gridiron. Place the pound cake slices on the hot grate. They will be done after cooking 2 to 4 minutes per side."
    ],
    "ingredients": [
        "3/4 cup heavy (whipping) cream",
        "3 tablespoons confectioners' sugar",
        "1/4 teaspoon ground cinnamon",
        "1 tablespoon tequila (preferably gold)",
        "8 slices pound cake (each 1/2 inch thick)",
        "2 to 3 tablespoons unsalted butter, melted",
        "Pineapple \"Salsa\"",
        "4 fresh mint sprigs, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Tequila",
        "Dairy",
        "Dessert",
        "Super Bowl",
        "Quick & Easy",
        "Backyard BBQ",
        "Pineapple",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Pound Cake with Pineapple \"Salsa\" and Tequila Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pound-cake-with-pineapple-salsa-and-tequila-whipped-cream-231542"
}
