{
    "directions": [
        "Heat oil in large saucepan over medium heat. Add onion and garlic and cook until soft, stirring often, about 5 minutes. Add wine and grapes. Simmer over medium heat until almost all liquid is evaporated, stirring occasionally, about 20 minutes. Add broths. Boil over medium-high heat until reduced to 2 scant cups, about 40 minutes. Strain into measuring cup, pressing on solids to release liquid; discard solids in strainer. Season with salt and pepper. DO AHEAD:Can be made 3 days ahead. Cover; chill.",
        "Melt 1 tablespoon butter in medium skillet over medium-high heat. Add onion, garlic, and ginger; sauté until soft, about 3 minutes. Add curry powder and 3 tablespoons butter. Stir until melted and bubbling. Remove from heat.",
        "Preheat oven to 350°F. Place potatoes on small baking sheet. Drizzle with 3 teaspoons oil, sprinkle with salt and pepper, and toss to coat. Roast until tender, about 25 minutes. Cool slightly. Cut potatoes crosswise into 3/4inch pieces; transfer to medium bowl.",
        "Heat 2 teaspoons oil in large skillet over medium-high heat. Add cauliflower and sauté until brown in spots, about 3 minutes. Add 1/4 cup water, cover, and cook until tender, adding more water by tablespoonfuls as needed, about 3 minutes longer. Transfer cauliflower to bowl with potatoes. Wipe skillet clean. Add remaining 2 teaspoons oil to same skillet. Add brussels sprouts and sauté until brown in spots, about 3 minutes. Add 1/4 cup water, cover, and simmer until tender, adding more water by tablespoonfuls as needed, about 3 minutes longer. Transfer to bowl with cauliflower and potatoes. DO AHEAD:Curry butter and vegetables can be made 2 hours ahead. Let stand separately at room temperature.",
        "Bring verjus and sugar to boil in small saucepan, stirring until sugar dissolves. Reduce heat to medium-high and boil until reduced to 1/4 cup, about 5 minutes. Cool.",
        "Preheat oven to 250°F. Place grapes on rimmed baking sheet lined with parchment or foil. Roast until reduced in size by half, about 1 1/2 hours. Cool.",
        "Mix syrup, grapes, pine nuts, and next 5 ingredients in medium bowl. DO AHEAD: Gremolata can be made 1 hour ahead. Let stand at room temperature.",
        "Prepare barbecue (medium-high heat). Sprinkle lamb all over with salt, pepper, and curry powder. Grill lamb until thermometer inserted lengthwise into lamb registers 130°F for mediumrare, about 15 minutes. Transfer to work surface and let rest 10 minutes. Slice lamb crosswise into 1/2-inch-thick slices.",
        "Meanwhile, melt 2 tablespoons curry butter in heavy large skillet over medium heat; add vegetables and cook until heated through, stirring frequently, about 4 minutes. Season to taste with salt and pepper and additional curry butter, if desired. Rewarm sauce.",
        "Divide vegetables among 4 plates. Divide lamb slices among plates. Drizzle sauce over lamb. Spoon gremolata over.",
        "*Tart juice made from unripened fruit, usually wine grapes; available at specialty foods stores and from igourmet.com."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 small red onion, chopped",
        "3 garlic cloves, minced",
        "2 cups dry red wine",
        "1/2 pound stemmed seedless red grapes",
        "2 1/2 cups low-salt chicken broth",
        "2 1/2 cups beef broth",
        "4 tablespoons (1/2 stick) butter, divided",
        "1 tablespoon minced onion",
        "1 garlic clove, minced",
        "1 teaspoon minced peeled fresh ginger",
        "1 1/2 teaspoons curry powder",
        "8 ounces fingerling potatoes (about 8)",
        "7 teaspoons olive oil, divided",
        "1/2 head of cauliflower, cored, cut into bite-size florets",
        "8 brussels sprouts, halved",
        "1/2 cup verjus* or 1/4 cup apple cider vinegar and 1/4 cup white grape juice",
        "1/4 cup sugar",
        "1/2 pound stemmed seedless red grapes",
        "1/2 cup pine nuts, toasted",
        "1 1/2 tablespoons chopped fresh parsley",
        "1 1/2 tablespoons thinly sliced fresh mint",
        "1 teaspoon finely grated lemon peel",
        "1 teaspoon olive oil",
        "1 garlic clove, minced",
        "2 racks of lamb, meat cut from bones",
        "Curry powder for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Lamb",
        "Potato",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Pine Nut",
        "Curry",
        "Cauliflower",
        "Red Wine",
        "Fall",
        "Grill/Barbecue",
        "Brussel Sprout",
        "Grape",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Grilled Lamb with Curried Vegetables and Grape Pine Nut Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lamb-with-curried-vegetables-and-grape-pine-nut-gremolata-239803"
}
