{
    "directions": [
        "Prepare barbecue (high heat). Whisk first 5 ingredients in medium bowl. Set aside. Pull out some of inside of bread, forming thick shells. Brush corn, peppers, onion, cut sides of bread, and steaks with olive oil. Sprinkle with salt and pepper. Grill vegetables until charred and just tender and steaks until charred and cooked to medium-rare, about 15 minutes for corn, 8 to 10 minutes for peppers, and 5 to 8 minutes for onion, turning occasionally, and 3 minutes per side for steaks. Let steaks rest 5 minutes. Grill bread, cut side down, until charred, about 2 to 3 minutes.",
        "Cut corn from cobs; add 1 cup to bowl with mayonnaise mixture and stir to coat. Season to taste with salt and pepper.",
        "Cut steaks diagonally against the grain into 1/3- to 1/2-inch-thick strips. Arrange steak slices, peppers, and onion over bottom halves of bread. Spoon corn mayonnaise over. Top with bread, pressing slightly to compact. (If using ciabatta, cut into 6 sandwiches.) only 377 calories!"
    ],
    "ingredients": [
        "2/3 cup mayonnaise",
        "1 1/2 tablespoons red wine vinegar",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh basil",
        "1 small garlic clove, pressed",
        "6 4-inch-long baguette sections or one 1-pound loaf ciabatta, halved horizontally",
        "2 ears of corn, husked",
        "2 small red bell peppers, quartered lengthwise",
        "1 large red onion, cut into 1/3-inch rounds",
        "1 1/4 to 1 1/2 pounds skirt steak, cut crosswise into 6-inch pieces",
        "Olive oil (for brushing)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Quick & Easy",
        "High Fiber",
        "Father's Day",
        "Backyard BBQ",
        "Lunch",
        "Mayonnaise",
        "Steak",
        "Corn",
        "Bell Pepper",
        "Grill",
        "Grill/Barbecue",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Skirt Steak and Pepper Sandwiches with Corn Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-skirt-steak-and-pepper-sandwiches-with-corn-mayonnaise-354829"
}
