{
    "directions": [
        "Combine first 9 ingredients in small bowl; whisk spice rub to blend well. Transfer 1 tablespoon spice rub to medium bowl; add butter and mix well. (Rub and seasoned butter can be made 2 days ahead. Cover separately. Chill butter. Bring butter to room temperature before using.)",
        "Sprinkle spice rub over both sides of chicken pieces. Arrange chicken pieces on waxed-paper-lined baking sheets. Cover chicken with more waxed paper and let stand at room temperature at least 1 hour and up to 2 hours.",
        "Prepare barbecue (medium-high heat). Reserve 4 tablespoons seasoned butter. Spread remaining seasoned butter on 1 side of baguette slices. Place bread slices on platter and cover. Place chicken on grill, skin side up. Grill 20 minutes. Turn chicken over. Grill until skin is deep golden brown, about 15 minutes. Turn chicken again and grill, skin side up, until cooked through (no red shows when chicken is cut at thigh bone), about 5 minutes longer. Transfer chicken to platter. Brush chicken with reserved 4 tablespoons seasoned butter.",
        "Grill bread until just golden, about 2 minutes per side. Arrange toasts around chicken and serve."
    ],
    "ingredients": [
        "2 tablespoons salt",
        "1 tablespoon coarsely ground black pepper",
        "1 tablespoon (packed) golden brown sugar",
        "2 teaspoons garlic powder",
        "1 1/2 teaspoons cornstarch",
        "1 1/2 teaspoons onion powder",
        "1 teaspoon lemon-pepper seasoning with garlic and onion",
        "1 teaspoon chili powder",
        "1 teaspoon cayenne pepper",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 4-pound chickens, quartered, rinsed, patted dry",
        "1 sourdough baguette, cut on diagonal into 3/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Spice",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Dixie Chicken with Cayenne Spice Rub",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-dixie-chicken-with-cayenne-spice-rub-108307"
}
