{
    "directions": [
        "Combine the onion, garlic, 1/4 cup of the oil, and water in a blender; blend until smooth. Put the skirt steak in a large resealable plastic bag or baking dish and pour in the onion mixture, coating both sides. Cover or wrap the meat well so the onion scent does not permeate your refrigerator; chill for at least 4 hours and up to 24 hours.",
        "Prepare a grill to medium-high heat.",
        "Remove the steak from the marinade and season both sides with the kosher salt and pepper. Transfer the meat to the grill and let cook until one side is well seared, 3 minutes. Flip and cook for 2 minutes more, for rare to medium-rare. At this point, remove the steak from the grill and let rest for 2 minutes to allow the carryover heat to give it a more even doneness. Finally, return the steak to the grill and cook for 1 minute more per side (this guarantees this thin cut of steak will be served hot). (Add another minute of cooking on the second side for medium doneness.) Remove the skirt steak from the grill and let rest 1 to 2 minutes before slicing and serving.",
        "Cut each steak with the grain into three sections. Turn each piece to slice against the grain at a 45-degree angle. Slice into 1/4-inch pieces  on a slight bias against the grain. You should get about 5 slices per cut piece, about 15 slices total. Transfer the meat to a warmed plate. Garnish with the remaining 1 tablespoon oil and smoked sea salt and serve with the chimichurri."
    ],
    "ingredients": [
        "1/2 medium yellow onion, coarsely chopped",
        "1 small garlic clove, peeled",
        "1/4 cup plus 1 tablespoon extra-virgin olive oil",
        "1\ttablespoons water",
        "2 pounds skirt steak, silver skin trimmed away",
        "1 teaspoon kosher salt",
        "1⁄4 teaspoon freshly ground black  pepper",
        "Smoked sea salt, for finishing",
        "Ox’s Chimichurri, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "cookbooks",
        "Steak",
        "Beef",
        "Grill",
        "Summer",
        "Onion",
        "Dinner",
        "Wheat/Gluten-Free",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Beef Skirt Steak With Onion Marinade",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-beef-skirt-steak-with-onion-marinade"
}
