{
    "directions": [
        "Set the fish on a wire rack and let sit until dry, about 30 minutes, turning once or twice. Make five 1/4-inch deep slashes into the flesh on both sides. In a small bowl, combine the jalapeño and garlic and season with salt and pepper. Rub the mixture into the slashes and any remaining into the cavity. Add the lemon and shallot slices to the cavity. Rub the fish all over with oil and season generously with salt and pepper.",
        "Light a grill and wire-brush any debris from the grates. Wipe off any debris and rub the grates generously with oil. Alternatively, rub a large fish basket with oil and add the fish.",
        "Grill the fish over medium-high heat covered, without touching for 15 minutes, until lightly charred and the skin releases from the grates easily. Using a carving fork, carefully lift the fish and slip a large spatula underneath. Gently flip the fish and grill the other side until the skin releases and the flesh is cooked through, about 15 minutes longer. Transfer the fish to a platter and let sit for 10 minutes.",
        "In a bowl, combine the herbs, almonds, shallot, lemon juice and olive oil and season with salt and pepper.",
        "Using a spoon, pull out the row of pin bones that run along the top ridge of the fish. Carefully separate the top fillet from the center bone and transfer it to a plate. Lift the bone and discard. Transfer the bottom fillet to the platter. Serve with the Chimichurri sauce and lemon wedges."
    ],
    "ingredients": [
        "One 3 1/2 -pound red snapper, cleaned and scaled at room temperature",
        "1 jalapeño, seeded and minced",
        "1 garlic clove, crushed",
        "Salt and freshly ground pepper",
        "6 lemon slices, plus wedges for serving",
        "1 small shallot, thinly sliced",
        "Extra-virgin olive oil for grilling",
        "1/4 cup chopped mixed herbs, such as chives, basil, oregano and tarragon",
        "2 tablespoons smoked almonds, chopped",
        "1 teaspoon minced shallot",
        "1 teaspoon lemon juice",
        "1/3 cup extra-virgin olive oil",
        "Salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Backyard BBQ",
        "Almond",
        "Snapper",
        "Grill"
    ],
    "title": "Grilled Red Snapper with Smoked Almond-Herb-Garden Chimichurri",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-red-snapper-with-smoked-almond-herb-garden-chimichurri-51237610"
}
