{
    "directions": [
        "Place octopus and wine in a large pot. Peel 2 garlic cloves; add to pot. Add enough water to cover by 2\". Bring to a boil, reduce heat to medium, and simmer until octopus is tender, about 1 hour. Transfer to a plate; let cool. Cut octopus into 4\" pieces. Remove as much of slippery outer purple coating as possible without removing suction cups.",
        "Meanwhile, preheat oven to 500°F. Place remaining garlic cloves and rosemary in a large roasting pan. Add whole tomatoes, drizzle with 3 tablespoons oil, and season lightly with salt and pepper. Toss to coat. Roast 30 minutes, stirring occasionally, until tomatoes are blistered and slightly charred. Let cool. Peel garlic.",
        "Toast coriander seeds in a small skillet over medium heat, stirring often, until aromatic and slightly darkened in color, about 3 minutes. Let cool. Place in a resealable plastic bag. Using a rolling pin or the bottom of a skillet, coarsely crush seeds. Whisk together coriander, 3/4 cup oil, and vinegar in a small bowl. Season vinaigrette to taste with salt and pepper. Set aside",
        "Heat remaining 2 tablespoons oil in another large pot. Working in batches, add kale and cook until softened and slightly browned, adding additional oil by tablespoonfuls if dry. Season to taste with salt. Transfer kale to a large bowl and toss with 1/4 cup of coriander vinaigrette.",
        "Prepare a medium-hot fire in a charcoal grill, or heat a gas grill to medium-high. Warm 3 cups cooked beans in a small pot with 1/4 cup of vinaigrette. Toss octopus with half of remaining vinaigrette; grill until charred, about 3 minutes per side.",
        "Divide tomatoes, garlic, kale, and beans among plates. Top with grilled octopus, drizzle with some vinaigrette, and season to taste with salt and pepper."
    ],
    "ingredients": [
        "1 small octopus, cleaned (about 5 pound)",
        "1 cup dry white wine",
        "2 heads of elephant garlic, cloves unpeeled, separated",
        "1 sprig fresh rosemary",
        "6 plum tomatoes, cored",
        "5 tablespoons (or more) extra-virgin olive oil, divided, plus 3/4 cup",
        "Kosher salt and freshly ground black pepper",
        "4 teaspoons coriander seeds",
        "1/4 cup red wine vinegar",
        "3 pound kale, center stalks removed, leaves torn into 4\" pieces",
        "1 1/2 cups dried cannellini or pinto beans, cooked according to package directions",
        "Ingredient info: Elephant garlic, available at better supermarkets and at melissas.com, looks like garlic that's been supersized."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Tomato",
        "Backyard BBQ",
        "Dinner",
        "Seafood",
        "Octopus",
        "Kale",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Boil",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Octopus with Kale, Tomatoes, and Beans",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-octopus-with-kale-tomatoes-and-beans-366417"
}
