{
    "directions": [
        "Prepare grill.",
        "Make butter: In a small bowl stir together butter ingredients with salt and pepper to taste until well blended and juice is incorporated.",
        "Grill Steaks: In a heavy-duty sealable plastic bag or between 2 sheets of wax paper crush peppercorns and anise seeds with bottom of a heavy skillet. Pat steak dry and coat both sides with peppercorn mixture, pressing it in.",
        "Season steak with salt and brush both sides with oil. Grill steak on an oiled rack set 5 to 6 inches over glowing coals 4 to 5 minutes on each side for medium-rare meat. (Alternatively, steaks may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer steak with tongs to a platter and let stand 10 minutes.",
        "Top steak with dollops of anise basil butter.",
        "Prepare grill.",
        "Quarter fennel bulbs lengthwise into wedges. In a steamer set over boiling water steam fennel, covered, until just tender, 8 to 10 minutes.",
        "Brush fennel quarters with oil and grill on an oiled rack set 5 to 6 inches over glowing coals 2 to 3 minutes on each side, or until golden. (Alternatively, fennel may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer grilled fennel with tongs to a serving dish. Squeeze lemon to taste over fennel and season with salt and pepper."
    ],
    "ingredients": [
        "1 1/2 tablespoons unsalted butter, softened",
        "1 tablespoon minced fresh basil leaves",
        "1/2 teaspoon anise seeds, ground coarse with a mortar and pestle or in an electric coffee grinder",
        "3/4 teaspoon fresh lemon juice",
        "2 teaspoons black peppercorns",
        "1 teaspoon anise seeds",
        "a 1-pound boneless sirloin steak (about 1 inch thick)",
        "olive oil for brushing steak",
        "(accompaniment if desired)",
        "2 small fennel bulbs (sometimes call anise, about 1 pound), stalks trimmed flush with bulb",
        "olive oil for brushing fennel",
        "1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Backyard BBQ",
        "Basil",
        "Beef Tenderloin",
        "Fennel",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Anise",
        "Gourmet"
    ],
    "title": "Grilled Sirloin Steak with Anise Basil Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sirloin-steak-with-anise-basil-butter-12434"
}
