{
    "directions": [
        "Prepare barbeque (medium-high heat). Whisk 3/4 cup oil and vinegar in medium bowl to blend. Place onion, beets, zucchini, eggplants, and red bell pepper on baking sheet. Brush both sides with some of vinaigrette. Sprinkle vegetables with salt and pepper. Grill vegetables until just cooked through, about 10 minutes per side for beets, 6 minutes per side for onion and 4 minutes per side for zucchini, eggplant, and peppers. (Vegetables can be grilled 1 hour ahead. Let stand at room temperature.) Brush bread with additional olive oil; sprinkle with pepper. Grill bread until beginning to brown, about 2 minutes per side.",
        "Arrange greens on large platter. Overlap tomatoes atop greens in center of platter. Sprinkle tomatoes with salt and pepper. Arrange grilled vegetables atop greens around edge of platter. Drizzle remaining vinaigrette over tomatoes and grilled vegetables. Sprinkle tomatoes and vegetables with herbs. Sprinkle tomatoes with goat cheese. Sprinkle Romano cheese over all. Garnish with olives. Serve with bread."
    ],
    "ingredients": [
        "3/4 olive oil",
        "1/4 cup balsamic vinegar",
        "1 large red onion,cut into 3/4-inch-thick rounds",
        "12 baby beets, stems trimmed to 1 inch, peeled, halved lengthwise",
        "3 small zucchini, each cut lengthwise into 4 slices",
        "2 large red bell peppers, cut into 2-inch-wide strips",
        "6 slices country-style-French bread",
        "Additional olive oil",
        "10 cups mixed baby greens",
        "4 large tomatoes, sliced",
        "3 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh chives or green onions",
        "1 tablespoon chopped fresh majoram",
        "3/4 cup chilled fresh mild goat cheese (such as Montrachet), crumbled (about 3 ounces)",
        "1/2 cup freshly grated Pecorino Romano cheese (about 2 ounces)",
        "3/4 cup brine-cured black olives (such as Kalamanta)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Dairy",
        "Leafy Green",
        "Herb",
        "Olive",
        "Tomato",
        "Vegetarian",
        "Goat Cheese",
        "Bell Pepper",
        "Beet",
        "Zucchini",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Vegetable Salad with Greens, Tomatoes, Herbs, Olives and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-vegetable-salad-with-greens-tomatoes-herbs-olives-and-cheese-101106"
}
