{
    "directions": [
        "Place beans in large saucepan. Pour enough water over beans to cover by 3 inches. Bring to boil. Remove from heat; cover and let stand 1 hour. Add onion, thyme, and bay leaf to beans; simmer until beans are tender, stirring occasionally, about 1 hour 15 minutes. Drain. Discard onion, thyme, and bay leaf; return beans to saucepan.",
        "Heat 2 tablespoons oil in small skillet over medium heat. Add shallots and sauté until tender, about 4 minutes. Stir shallots into beans. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill. Rewarm over medium-low heat, stirring and adding more water to moisten if necessary, before serving.)",
        "Place calamari tentacles in medium bowl. Cut calamari bodies lengthwise in half. Using sharp knife, score bodies at 1/2-inch intervals in lattice pattern (do not cut through). Add to bowl. Add 2 tablespoons oil, lemon juice, and garlic; toss to coat. Let stand 1 hour.",
        "Prepare barbecue (medium-high heat). Drain calamari; sprinkle with salt and pepper. Grill just until slightly curled at edges, about 30 seconds per side.",
        "Stir parsley into warm beans. Divide beans among 6 plates. Top with calamari. Drizzle remaining 3 tablespoons oil over. Sprinkle with crushed red pepper."
    ],
    "ingredients": [
        "1 cup dried small white beans",
        "1 medium onion, quartered",
        "3 large fresh thyme sprigs",
        "1 bay leaf",
        "7 tablespoons extra-virgin olive oil",
        "2 large shallots, chopped",
        "1 pound cleaned calamari (tentacles and bodies)",
        "1/2 cup fresh lemon juice",
        "2 garlic cloves, minced",
        "1/4 cup chopped fresh Italian parsley",
        "1/4 teaspoon dried crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Appetizer",
        "Side",
        "Squid",
        "Summer",
        "Grill/Barbecue",
        "Thyme",
        "Parsley",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Calamari with White Beans",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-calamari-with-white-beans-105529"
}
