{
    "directions": [
        "Plunge lobsters headfirst into a 12-quart pot of boiling salted water . Cook, covered, over high heat 4 minutes (for 1 1/4-lb lobster) to 5 minutes (for 1 1/2-lb lobster) from time they enter water. Transfer with tongs to a large colander to drain and cool. (Lobsters will not be fully cooked.) Return cooking water to a boil.",
        "Add potatoes to boiling water and simmer, uncovered, until just tender, 15 to 20 minutes. Drain in a colander.",
        "When lobsters are cool enough to handle, twist off claws (including knuckles) and crack with a meat mallet or rolling pin. Halve lobsters lengthwise using a large heavy knife. Reserve green tomalley and any orange roe from bodies for another use if desired.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (moderately high heat for gas).",
        "While grill heats, whisk together vinegar, lemon juice, garlic, red-pepper flakes, sugar, and salt in a bowl. Add oil in a slow stream, whisking until well blended, then stir in basil.",
        "Halve potatoes. Oil grill rack, then grill potatoes, cut sides down, covered only if using a gas grill, turning over once, until grill marks appear, about 4 minutes total. Transfer to a bowl and toss with 2 tablespoons vinaigrette. Keep potatoes warm, covered.",
        "Oil grill rack, then grill 4 lobster halves, cut sides down, and all of claws, covered only if using a gas grill, until grill marks appear on meat, about 4 minutes. Turn over bodies and claws and grill in same manner 4 minutes more. Transfer to a large bowl and toss with 1/4 cup vinaigrette, then keep warm, covered. Grill remaining lobster halves in same manner and add to same bowl, tossing to coat.",
        "Arrange arugula on a large platter and top with grilled lobster and potatoes. Drizzle with 1/2 cup vinaigrette and serve remaining vinaigrette on the side."
    ],
    "ingredients": [
        "4 (1 1/4- to 1 1/2-pound) live lobsters",
        "2 pounds small (1 1/2- to 2-inch) boiling potatoes (preferably yellow-fleshed)",
        "3 tablespoons red-wine vinegar",
        "5 tablespoons fresh lemon juice",
        "3 garlic cloves, minced",
        "1/2 teaspoon dried hot red-pepper flakes, or to taste",
        "1 teaspoon sugar",
        "1/2 teaspoon salt",
        "2/3 cup extra-virgin olive oil",
        "1/2 cup chopped fresh basil",
        "1/2 pound baby arugula (about 10 cups loosely packed)",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Potato",
        "Shellfish",
        "Backyard BBQ",
        "Dinner",
        "Basil",
        "Seafood",
        "Lobster",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Anniversary",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Lobster and Potatoes with Basil Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lobster-and-potatoes-with-basil-vinaigrette-238704"
}
