{
    "directions": [
        "Prepare grill.",
        "Lightly brush bell peppers and eggplants with oil and grill on an oiled rack set about 4 inches over glowing coals about 4 minutes on each side, or until cooked through. Cut peppers into strips.",
        "Lightly brush cut sides of bread with oil and grill, cut sides down, about 2 minutes, or until golden. Spread each piece of bread with 4 tablespoons pesto and divide peppers, eggplants, and mozzarella between them. Grill sandwiches, covered, just until cheese is melted. (Alternatively, vegetables and assembled sandwiches may be broiled.) Sprinkle each sandwich with basil and cut in half.",
        "In a blender or small food processor blend together all ingredients with salt and pepper to taste until smooth. Pesto keeps, covered and chilled, up to 1 week. Makes about 2/3 cup."
    ],
    "ingredients": [
        "1 red bell pepper, quartered",
        "1 yellow bell pepper, quartered",
        "3 small eggplants (about 1/2-pound total), sliced diagonally 1/4inch thick",
        "olive oil for brushing vegetables and bread",
        "1 14-inch-long loaf Italian bread, halved horizontally with serrated knife",
        "1/2 cup pesto",
        "1 cup diced mozzarella cheese (about 1/4 pound)",
        "3 tablespoons finely shredded fresh basil leaves for garnish",
        "1 cup packed fresh basil leaves",
        "3 tablespoons pine nuts or chopped walnuts, toasted lightly and cooled",
        "1 large garlic clove, chopped",
        "3 tablespoons freshly grated Parmesan cheese",
        "1/3 olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Vegetable",
        "Vegetarian",
        "Lunch",
        "Mozzarella",
        "Basil",
        "Summer",
        "Gourmet"
    ],
    "title": "Grilled Open-Faced Vegetable, Pesto, and Mozzarella Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-open-faced-vegetable-pesto-and-mozzarella-sandwiches-12486"
}
