{
    "directions": [
        "Prepare a hot fire in your grill. Brush the tenderloin with the olive oil and season with salt and pepper.",
        "Remove the skewers from the water. Pierce the figs through the middle with a metal skewer or ice pick to make a hole. Then thread 3 figs onto each rosemary or wooden skewer. Lightly brush the figs with olive oil.",
        "Place the pork tenderloin directly over the fire. Grill for 2 to 3 minutes per side (the center-cut pork loin filet for 5 to 7 minutes per side), turning a quarter turn at a time, until an instant-read meat thermometer inserted in the thickest part registers 140°F for medium and the meat is juicy and slightly pink in the center.",
        "At the same time, place the skewered figs over the fire, turning several times and cooking for about 5 to 6 minutes until they are heated through. When they're caramelized and soft, remove the skewers from the heat and keep warm.",
        "Let the pork rest for about 5 minutes, and then cut on the diagonal into 1- to 2-inch-thick slices.",
        "To serve, arrange 3 slices of pork with a skewer of figs on each plate, all topped with crumbled goat cheese, drizzled with 1/2 teaspoon honey, and a sprinkled with chopped rosemary."
    ],
    "ingredients": [
        "One (1 to 1 1/4 pounds) pork tenderloin or center-cut pork filet",
        "2 tablespoons olive oil",
        "Fine kosher or sea salt and freshly ground black pepper to taste",
        "4 long rosemary branches or wooden skewers, soaked in water for at least 15 minutes",
        "12 small ripe figs",
        "4 ounces goat cheese",
        "2 teaspoons honey",
        "1 1/2 teaspoons finely chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Backyard BBQ",
        "Dinner",
        "Fig",
        "Rosemary",
        "Meat",
        "Pork Tenderloin",
        "Spring",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Pork Tenderloin with Fresh Fig Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tenderloin-with-fresh-fig-skewers-395329"
}
