{
    "directions": [
        "Mix the seasoning blend, salt, and wine in a small bowl and stir well. Then combine the mixture with all the other ingredients except the oil and peppers in a mixing bowl and mash with your hands until all the ingredients are evenly distributed. Put the meat in the refrigerator for an hour or more to allow the flavors to blend.",
        "Heat a little oil in a frying pan and place a teaspoon of the meat mixture in the hot oil. Cook, turning frequently, until done on both sides. Taste, and adjust the salt and seasonings in the remaining meat mixture.",
        "Cut the peppers in half through the stem so that they form six half-pepper cups. Fill each half pepper with meat mixture. Mound the meat no more than a 1/2 inch over the top edge of each pepper. The stuffed peppers can be made in advance to this point and stored covered in the refrigerator for several days.",
        "Light the grill. Cook pepper side down over low heat for 10 to 12 minutes, until the pepper is charred and soft. Turn the stuffed peppers over and cook on the meat side for 10 minutes. Test for doneness. Serve immediately with your choice of salsas. These are also great cold or cut into slices for sandwiches.",
        "Use kebab seasoning such as Sadaf, available in Middle Eastern grocery stores.",
        "Use a Cajun spice blend such as Tony Chachere's or Zatarain's and omit the salt."
    ],
    "ingredients": [
        "2 tablespoons seasoning blend of your choice",
        "1 teaspoon salt (omit if there is salt in the seasoning mix)",
        "1/2 cup white wine",
        "1/2 pound venison sausage (substitute breakfast sausage meat)",
        "1/2 pound ground beef",
        "1 cup cooked rice",
        "2 cloves garlic, minced",
        "1 egg, beaten",
        "1/2 cup minced fresh parsley leaves",
        "Cayenne pepper",
        "Ground cumin",
        "Oil, for frying",
        "3 small green bell peppers (four lobes preferred)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pepper",
        "Appetizer",
        "Side",
        "Super Bowl",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Ground Beef",
        "Venison",
        "Sausage",
        "Bell Pepper",
        "Summer",
        "Winter",
        "Tailgating",
        "Poker/Game Night",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Stuffed Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-stuffed-peppers-363417"
}
