{
    "directions": [
        "Prepare grill.",
        "Make a bouquet garni by wrapping parsley, thyme, and bay leaf in cheesecloth and tying it closed with kitchen string. Thinly slice shallots. In a heavy 3- to 4-quart saucepan heat oil over moderately high heat until hot but not smoking and sauté shallots with bouquet garni, stirring, until shallots are golden. Add Port and deglaze pan, scraping up any brown bits. Add red wine and boil sauce until almost evaporated and reduced to a glaze, about 2 tablespoons. Add stock and boil sauce until slightly thickened and liquid is reduced to about 2/3 cup. Pour sauce through a fine sieve into a small saucepan and discard bouquet garni. Season sauce with pepper and salt and keep warm, covered.",
        "Pat steaks dry and season with pepper and salt. Grill steaks on a lightly oiled rack set 5 to 6 inches over glowing coals about 30 seconds on each side for medium-rare. (Alternatively, grill steaks in a hot, lightly oiled, well-seasoned ridged grill pan over moderately high heat.)",
        "Serve steaks with sauce."
    ],
    "ingredients": [
        "4 long fresh parsley sprigs",
        "2 long fresh thyme sprigs",
        "1 bay leaf",
        "a 6-inch square of cheesecloth",
        "3 shallots",
        "1 tablespoon peanut oil",
        "1 cup Ruby Port",
        "a 750-ml. bottle dry red wine such as Côtes du Rhône",
        "2 cups veal stock*",
        "freshly ground black pepper",
        "six 1/4-inch-thick boneless beef top loin (strip) steaks** (each about 5 ounces)",
        "*available at specialty foods shops",
        "**available by request from butcher"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Port",
        "Red Wine",
        "Fall",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Paillards of Beef with Red Wine and Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-paillards-of-beef-with-red-wine-and-port-sauce-101125"
}
