{
    "directions": [
        "Prepare grill",
        "Mince enough chipotles to measure 2 teaspoons. In a blender puree chipotles, chutney, citrus juices, and salt to taste until dressing is smooth. Dressing may be made 1 day ahead and chilled, covered.",
        "Cut enough corn from cobs to measure 1 cup. In a small saucepan boil corn in water to just cover until crisp-tender, about 2 minutes. In a colander drain corn and rinse under cold water to stop cooking. Pat corn dry and cut tomatoes and radishes into 1/4-inch dice. Vegetables may be prepared up to this point 4 hours ahead and chilled separately, covered.",
        "Pat pork dry and season with salt and pepper. Grill pork on a lightly oiled rack set 5 to 6 inches over glowing coals, turning it, until a thermometer inserted diagonally into center registers 155°F., 15 to 20 minutes. (Alternatively, pork may be grilled in a hot lightly oiled well-seasoned ridged grill pan over moderately high heat.) Let pork stand 5 minutes and thinly slice. Chop frisée and transfer with corn, tomatoes, radishes, beans, and pork to a large bowl.",
        "Just before serving, toss salad with dressing."
    ],
    "ingredients": [
        "2 canned chipotle chiles in adobo 1/4 cup bottled Major Grey's chutney",
        "1/4 cup bottled Major Grey's chutney",
        "1/4 cup fresh orange juice",
        "1/4 cup fresh lime juice",
        "2 ears corn",
        "1 pound vine-ripened tomatoes (about 3 medium)",
        "10 radishes",
        "1 cup drained canned black beans",
        "1 pound pork tenderloin",
        "2 large heads frisée (French curly endive; about 1/2 pound total)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Citrus",
        "Pork",
        "Tomato",
        "Summer",
        "Grill/Barbecue",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Grilled Pork, Tomato, Frisée, and Black Bean Salad with Chipotle Citrus Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tomato-frisee-and-black-bean-salad-with-chipotle-citrus-dressing-15295"
}
