{
    "directions": [
        "Set strainer over large bowl. Line strainer with 2 layers of cheesecloth (do not let strainer touch bottom of bowl). Spoon yogurt into strainer. Let stand at room temperature 1 hour (liquid will drain out and yogurt will thicken; discard liquid). Mix yogurt, garlic and lemon juice in small bowl. Season to taste with salt.",
        "Rub cumin and coriander over lamb pieces. Thread lamb onto 6 metal skewers. (Yogurt and lamb can be prepared 4 hours ahead. Cover separately and chill.)",
        "Combine 1 cup water and 1/4 teaspoon salt in medium saucepan. Bring to boil. Add couscous. Remove from heat. Cover; let stand until liquid is absorbed, about 5 minutes. Transfer couscous to large bowl; fluff with fork. Cool to room temperature. Stir in chopped cucumber, tomato, onion, olive oil and fresh dill. Season with salt and pepper.",
        "Prepare barbecue (medium-high heat). Grill lamb to desired doneness, turning frequently, about 10 minutes for medium-rare. Transfer to platter. Sprinkle with salt. Grill pitas until heated through and lightly toasted, about 1 minute per side.",
        "Place 1 pita on each of 6 plates. Spread yogurt mixture evenly over pitas. Spoon couscous down center of pitas. Slide lamb off skewers onto couscous."
    ],
    "ingredients": [
        "1 1/2 cups plain yogurt",
        "2 garlic cloves, pressed",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons ground cumin",
        "1 teaspoon ground coriander",
        "2 1/4 pounds boneless lamb sirloin, trimmed, cut into 1-inch cubes",
        "1 cup water",
        "1/4 teaspoon salt",
        "2/3 cup couscous",
        "1/2 cucumber, seeded, chopped",
        "1 ripe tomato, chopped",
        "1/2 small onion, halved, thinly sliced",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh dill",
        "6 6-inch-diameter pita breads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Yogurt",
        "Fall",
        "Grill/Barbecue",
        "Couscous"
    ],
    "title": "Grilled Cumin-Lamb Pitas with Couscous and Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-cumin-lamb-pitas-with-couscous-and-yogurt-102136"
}
