{
    "directions": [
        "Combine soy sauce, mirin, salt and white pepper in a bowl. Add pork slices and mix to coat with marinade. Cover and refrigerate 30 minutes or overnight.",
        "Remove pork from refrigerator. Drain slices; discard marinade. Heat a grill pan and brush or spray with vegetable oil. Place pork slices on grill and cook until well seared, turning every 3 to 4 minutes. Drain on paper towels.",
        "Pour milk into shallow bowl. Mix flour, salt, pepper and seasoned salt together in a shallow dish for dredging. Beat eggs in a third bowl. Dip tomato slices into milk, then flour mixture, then eggs. Coat well with flour mixture again.",
        "Heat butter and olive oil in a frying pan over medium-high heat. Place tomato slices in pan and cook until golden brown, about 2 minutes per side. If necessary, place in warm oven until ready to serve.",
        "To build sandwiches, spread mayonnaise on bread slices. On half the slices, layer lettuce, avocado slices, grilled pork belly and fried tomatoes. Top with remaining bread slices."
    ],
    "ingredients": [
        "1 cup soy sauce",
        "1 cup mirin",
        "Salt and ground white pepper to taste",
        "1 pound skinless pork belly, thinly sliced",
        "1 cup milk",
        "2 eggs, beaten",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "2 teaspoons steak seasoning blend",
        "2 large red tomatoes, thickly sliced",
        "3 tablespoons butter",
        "3 tablespoons olive oil",
        "2 ripe avocados from Mexico, peeled, pitted and sliced",
        "4 leaves green leaf lettuce",
        "8 slices crusty artisan bread, toasted",
        "1 tablespoon mayonnaise"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Pork Belly BLT with Fried Tomatoes and Avocado",
    "url": "http://allrecipes.com/recipe/237850/grilled-pork-belly-blt-with-fried-tom/"
}
