{
    "directions": [
        "Stir together all sauce ingredients with pepper to taste. Trim and cook artichokes: Combine 1 qt cold water and lemon juice in a large bowl. Working with 1 artichoke at a time, bend back outer leaves until they snap off close to base and discard several more layers of leaves in same manner until exposed leaves are pale green at top and pale yellow at base. Trim pointed tips of leaves with kitchen shears, then cut a thin slice from end of stem to expose a fresh cross section. Trim dark green fibrous parts from base and stem of artichoke, being careful not to break off stem. Halve artichoke lengthwise. Remove fuzzy center and any pointed inner leaves. Put in bowl of lemon water.",
        "Drain artichokes, then cook in a large pot of boiling salted water (1 Tbsp salt for 5 qt water) until tender, about 8 minutes. Drain and transfer to an ice bath to stop cooking. Drain well.",
        "Prepare a grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas).",
        "Toss artichokes with oil in a bowl. Oil grill rack, then grill artichokes, cut sides down, covered only if using a gas grill, turning once, until golden brown in spots, 6 to 8 minutes. Serve drizzled with sauce."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "6 flat anchovy fillets, drained, patted dry, and minced",
        "2 1/2 tablespoons drained capers, rinsed and finely chopped",
        "1/4 cup finely chopped mint",
        "1 tablespoon white-wine vinegar",
        "1 tablespoon fresh lemon juice",
        "12 baby artichokes (3 1/2 by 2 inches; see cook's note, below; 1/2 pound total)",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Side",
        "Backyard BBQ",
        "Lemon",
        "Mint",
        "Artichoke",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Capers",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Baby Artichokes with Caper-Mint Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-baby-artichokes-with-caper-mint-sauce-242603"
}
