{
    "directions": [
        "Pour 1/4 cup warm water into large bowl. Sprinkle yeast over; stir to blend. Let stand until yeast dissolves and mixture is slightly foamy, about 10 minutes.",
        "Stir 1 1/2 cups room-temperature water and salt into yeast mixture. Add 3 1/2 cups flour, 1/2 cup at a time, stirring until slightly sticky dough forms. Knead dough on floured surface until smooth and elastic, adding more flour by tablespoonfuls if sticky, about 10 minutes. Oil large bowl. Add dough; turn to coat. Cover bowl with plastic wrap. Let rise in warm area until doubled in volume, about 50 minutes.",
        "Punch dough down; turn out onto floured surface. Divide dough into 4 equal pieces; knead each briefly until smooth. Cover with towel; let rise until almost doubled, about 30 minutes.",
        "Prepare barbecue (medium-high heat). Roll out 1 dough piece on lightly floured surface to 11 x 8-inch rectangle. Transfer to floured baking sheet. Brush top with oil. Place oiled side down on barbecue. Grill until bottom is golden, about 2 1/2 minutes. Brush top with oil. Using tongs, turn bread over; grill until second side is golden, about 2 minutes. Transfer to baking sheet. Brush bread with oil. Repeat with remaining dough pieces. (Can be made 4 hours ahead. Cover with foil; let stand at room temperature. Before continuing, prepare barbecue; use medium-high heat.)",
        "Sprinkle Parmesan and Fontina over breads. Top each with tomato slices, corn kernels, parsley and jalapeño. Drizzle with oil. Place breads on barbecue; cover loosely with foil. Grill until cheese melts, watching closely, about 2 minutes. Cut each bread into pieces; serve warm."
    ],
    "ingredients": [
        "1/4 cup warm water (105°F. to 115°F.)",
        "1 1/2 teaspoons dry yeast",
        "1 1/2 cups water, room temperature",
        "2 1/2 teaspoons coarse salt",
        "3 3/4 cups (about) unbleached all purpose flour",
        "Extra-virgin olive oil",
        "1 1/2 cups grated Parmesan cheese (about 3 1/2 ounces)",
        "1 1/2 cups grated Fontina cheese (about 6 ounces)",
        "4 medium tomatoes, thinly sliced",
        "1 cup fresh corn kernels or frozen, thawed",
        "1/4 cup chopped fresh cilantro or Italian parsley",
        "4 teaspoons minced seeded jalapeños"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Kid-Friendly",
        "Backyard BBQ",
        "Parmesan",
        "Corn",
        "Grill",
        "Grill/Barbecue",
        "Jalapeño"
    ],
    "title": "Grilled Pizza with Tomatoes, Corn and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pizza-with-tomatoes-corn-and-cheese-5708"
}
