{
    "directions": [
        "1. In a bowl, combine the sugar, fish sauce, lemongrass, garlic, shallot, chile, and black pepper and whisk until the sugar dissolves. Arrange the pork chops in a rimmed dish in a single layer. Pour the marinade over, cover with plastic wrap, and let marinate at room temperature for 1 to 2 hours. (The pork can also be refrigerated overnight. Bring meat to room temperature before grilling).",
        "2. Prepare a hot fire in a charcoal grill (you should be able to hold your hand 1 to 2 inches above the grate for only 2 to 3 seconds). When the coals are ready, push two-thirds of the coals to one-half of the grill, creating a hot zone; spread the remaining one-third on the opposite side of the grill to create a cooler zone.",
        "3. Remove the pork chops from the marinade and discard the marinade. Place the chops on the hottest part of the grill. Let cook for 1 minute, then flip and cook for 1 minute on the second side.",
        "4. Move the chops to the cooler side of the grill and cook, turning once, for about 10 minutes total, until an instant-read thermometer inserted into the thickest part of the chop registers 140°F, raking over coals from the hotter side of the grill if necessary to maintain an even temperature. Spritz any flare-ups with a spray bottle filled with water.",
        "5. Transfer the chops to a large plate, tent with aluminum foil, and let stand for 10 minutes. Cut the meat from the bone and slice the meat across the grain on the diagonal. Transfer the slices and bones to a serving platter and serve."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup plus 1 tablespoon fish sauce",
        "1 lemongrass stalk, finely chopped",
        "1 1/2 tablespoons minced garlic",
        "2 tablespoons minced shallot",
        "1 Thai chile, stemmed and finely chopped",
        "1/4 teaspoon freshly ground black pepper",
        "3 bone-in center cut pork chops, each about 12 ounces and 1 inch thick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pork",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Meat",
        "Pork Chop",
        "Grill",
        "Grill/Barbecue",
        "Lemongrass",
        "Advance Prep Required",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Pork Chops with Sweet Lemongrass Marinade",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-chops-with-sweet-lemongrass-marinade-51115010"
}
