{
    "directions": [
        "Cut the racks of lamb in half so that you have four 3- or 4-boned sections of meat.",
        "Place on a platter or in a baking dish and cover the meat with 1 1/2 cups of the mole (try to avoid wasting the mole on the bones). Cover and refrigerate for at least 4 hours, and for as long as overnight. Refrigerate the remaining mole for when you serve the dish.",
        "Prepare a medium fire in a grill. Preheat the oven to 475 degrees.",
        "Brush off any excess marinade from the lamb. Oil the grill rack, lay the racks of lamb on it, and grill, turning once or twice, until nicely browned on all sides. Be mindful that the fat on the lamb can drip and cause the flames to flare; if this happens, simply turn the lamb over or move it away from the hottest flames.",
        "Transfer the meat to a small roasting pan and put it in the oven. Check it after 10 minutes, and discard any fat that may have accumulated in the bottom of the pan. Cook the lamb until it has reached the desired doneness. In my opinion, lamb from the rack is best served medium-rare. (When it is rare, the texture can be too springy; when medium-well to well-done, it often will be disagreeably dry.) An internal temperature of 130 degrees will be right — especially when you take into account that the temperature will rise another few degrees once it comes out of the oven. Allow the lamb to rest for a few minutes.",
        "Meanwhile, warm the reserved mole in a small saucepan.",
        "Cut the lamb into chops, or serve the half-racks as they are. Offer the mole on the side, with salt and pepper.",
        "Recommended wine: A Zinfandel from Sonoma (but not a high-alcohol one) will offer restraint to complement the gentle gaminess of the lamb and the power of the red mole."
    ],
    "ingredients": [
        "Two 7- to 8-bone racks of lamb, trimmed and Frenched (the butcher can do this)",
        "2 1/2 cups Red Mole",
        "1 to 2 tablespoons canola or grapeseed oil",
        "Kosher salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Marinate",
        "Backyard BBQ",
        "Rack of Lamb",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grill-Roasted Rack of Lamb in Red Mole",
    "url": "http://www.epicurious.com/recipes/food/views/grill-roasted-rack-of-lamb-in-red-mole-108206"
}
