{
    "directions": [
        "Rub ribs with chipotle rub and put in large sealable plastic bags or a shallow baking dish large enough to hold ribs in one layer. (Marinate ribs, covered and chilled, at least 12 hours and up to 1 day.)",
        "Add recado to ribs, turning them to coat well. (Marinate ribs, covered and chilled, at least 12 hours and up to 1 day.)",
        "Prepare grill.",
        "Remove ribs from marinade, letting excess marinade drip off, and reserve excess marinade. Grill ribs, bone sides down, on an oiled rack set 5 to 6 inches over glowing coals, covered, until marinade sets and dries slightly, 10 to 15 minutes. Turn ribs and baste with some reserved marinade. Grill ribs, covered 10 minutes more. Grill ribs, uncovered, basting frequently with some reserved marinade, until crusty and browned on both sides, 10 to 20 minutes more. (Do not baste ribs with marinade during last 5 minutes of cooking.) Discard any unused marinade.",
        "Cut meat into individual ribs and serve with salsa.",
        "In a small heavy skillet dry-roast oregano over moderate heat, shaking skillet occasionally, until fragrant and beginning to brown, about 2 minutes, and transfer to a small bowl. Cool oregano completely and in an electric coffee/spice grinder grind fine.",
        "In a heavy skillet heat oil over moderately high heat until hot but not smoking and, using tongs, fry chiles, 1 to 2 at a time, turning them, until puffed and just beginning to brown, about 10 seconds. (Do not let chiles burn or rub will be bitter.) Transfer chiles as fried to paper towels to drain and cool until crisp.",
        "Wearing rubber gloves, break chiles into pieces and in coffee/spice grinder grind fine in batches. In a food processor grind oregano and chiles with garlic and salt until mixture is a shaggy, saltlike consistency. If mixture seems moist, on a large baking sheet spread it into a thin, even layer and dry in middle of an oven set at lowest temperature until no longer moist, about 1 hour. Wearing rubber gloves, break up any lumps with your fingers. (Chipotle rub keeps in an airtight container, chilled, 6 months. Regrind rub before using.) Makes about 3 1/4 cups."
    ],
    "ingredients": [
        "2 slabs baby back pork ribs (about 1 pound each)",
        "1/4 cup dried Mexican oregano*",
        "1/4 cup corn oil",
        "5 dried chipotle chiles*, stemmed, seeded, and deveined (wear rubber gloves)",
        "5 ancho chiles*, seeded and deveined (wear rubber gloves)",
        "25 garli cloves",
        "1 1/2 cups coarse salt",
        "1 1/2 cups Tamarind Recado",
        "available at Mexican markets and some specialty produce markets",
        "Accompaniment: Charred Tomato Mint Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Marinate",
        "Backyard BBQ",
        "Pork Rib",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Tamarind",
        "Oregano"
    ],
    "title": "Grilled Pork Ribs with Tamarind Recado",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-ribs-with-tamarind-recado-12682"
}
