{
    "directions": [
        "Preheat an outdoor grill for medium-high heat.",
        "Place the wine and shallot in a saucepan over medium-high heat. Bring the mixture to a boil, then reduce the heat to medium-low and reduce the liquid down by about half, about 4 minutes. Remove from heat and set aside.",
        "Place the Parmesan cheese, garlic, and walnuts into a food processor; process until finely chopped. Add the olive oil, cilantro, and 1/8 teaspoon black pepper; process until smooth. Remove the cilantro pesto from the food processor and set aside.",
        "Place the red peppers into the food processor, pour in the wine reduction, and process until smooth. Pour the entire mixture back into the saucepan and bring to a boil over medium-high heat. Reduce the heat to medium and simmer the sauce for 4 minutes. Meanwhile, season both sides of the mahi mahi fillets with salt and pepper.",
        "Cook the mahi mahi on the preheated grill until the fish is golden and flakes easily with a fork, about 4 minutes per side.",
        "Whisk the butter, 1/8 teaspoon black pepper, and 1/4 teaspoon salt into the red pepper sauce until smooth. Spoon the red pepper sauce onto the bottom of the serving plate, arrange the fish on the sauce, and top with the cilantro pesto to serve."
    ],
    "ingredients": [
        "1/2 cup white wine",
        "1 shallot, minced",
        "2 tablespoons shredded Parmesan cheese",
        "2 cloves garlic",
        "1/3 cup chopped walnuts",
        "1 tablespoon extra-virgin olive oil",
        "1/4 cup packed fresh cilantro leaves",
        "1/8 teaspoon ground black pepper",
        "1 (12 ounce) jar roasted red bell peppers, drained",
        "4 (6 ounce) mahi mahi fillets",
        "salt and ground black pepper to taste",
        "1 tablespoon butter",
        "1/8 teaspoon ground black pepper",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Mahi Mahi with Roasted Pepper Sauce and Cilantro Pesto",
    "url": "http://allrecipes.com/recipe/143760/grilled-mahi-mahi-with-roasted-pepper/"
}
