{
    "directions": [
        "Whisk together vinegar, oregano, thyme, garlic, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a small bowl until salt is dissolved. Add 1/3 cup oil in a slow stream, whisking until vinaigrette is combined.",
        "Heat 1 tablespoon oil in a wide 3-quart heavy saucepan over moderate heat until hot but not smoking, then toast couscous, stirring occasionally, until fragrant and pale golden, 3 to 5 minutes. While couscous toasts, stir together broth, water, and saffron in a large glass measure. Add to couscous with 1/2 teaspoon salt and bring to a simmer, uncovered. Simmer, covered, until liquid is absorbed and couscous is al dente, 10 to 12 minutes. Remove from heat and let stand, covered, 10 minutes. Stir vinaigrette to combine, then stir 2 tablespoons into couscous and let stand, uncovered, at room temperature.",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas).",
        "Toss shrimp with 1 tablespoon oil, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a bowl and thread 4 or 5 shrimp onto each skewer (don't crowd, or shrimp won't cook evenly).",
        "Peel onions and trim root ends slightly, leaving ends intact, then halve lengthwise and cut halves lengthwise into 1/2-inch-wide wedges. Insert 1 wooden pick through each wedge to hold layers together while grilling, then put onions in a large bowl with zucchini. Toss vegetables with remaining 2 tablespoons oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "Grill shrimp skewers on lightly oiled grill rack, covered only if using a gas grill, turning over once with tongs, until just cooked through, about 4 minutes total. Transfer shrimp, discarding skewers, to a clean bowl and toss with 2 tablespoons vinaigrette.",
        "Grill vegetables on lightly oiled grill rack, covered only if using a gas grill, turning over once, until just tender, about 5 minutes, transferring to bowl as grilled. Remove and discard picks from onions. Drizzle vegetables with remaining vinaigrette and toss to combine.",
        "Spoon couscous onto a large platter or shallow serving bowl. Arrange shrimp and vegetables on top of couscous and sprinkle with feta. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 tablespoons red-wine vinegar",
        "3 tablespoons chopped fresh oregano",
        "2 tablespoons chopped fresh thyme",
        "1 large garlic clove, finely chopped",
        "1 3/4 teaspoons salt",
        "3/4 teaspoon black pepper",
        "1/3 cup plus 1/4 cup olive oil",
        "2 1/4 cups pearl couscous (sometimes called Israeli couscous; 3/4 pound)",
        "1 3/4 cups reduced-sodium chicken broth (14 fl ounces)",
        "1 cup water",
        "1/4 teaspoon crumbled saffron threads",
        "2 lb large shrimp (21 to 25 per pound), peeled and deveined if necessary",
        "2 medium red onions (1 pound total)",
        "2 pounds large zucchini (about 4), cut diagonally into 1/2-inch-thick slices",
        "6 ounces feta, crumbled (1 1/4 cups)",
        "Special equipment: about 12 (8-inch) wooden skewers and 20 wooden picks (round, not flat), soaked in water 30 minutes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Herb",
        "Onion",
        "Shellfish",
        "Vegetable",
        "Lunch",
        "Shrimp",
        "Summer",
        "Grill/Barbecue",
        "Couscous",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Shrimp and Vegetables with Pearl Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-and-vegetables-with-pearl-couscous-235021"
}
