{
    "directions": [
        "Stir together garlic, 3 tablespoons vinegar, 1 1/2 tablespoons oil, 1 1/2 teaspoons salt, and 1/2 teaspoon black pepper and pour into a 1-quart sealable plastic bag.",
        "Add steak to marinade, turning to coat, and marinate, chilled, turning bag occasionally, at least 4 hours.",
        "Bring to room temperature, then remove steak from marinade and discard marinade.",
        "Trim root ends of onions slightly, leaving them intact, then halve lengthwise and cut halves lengthwise into 3/4-inch-thick wedges. Insert 1 wooden pick horizontally through each wedge (to keep it intact while grilling). Whisk together remaining tablespoon vinegar and 1 1/2 tablespoons oil and salt and pepper to taste in a bowl and add onions, tossing gently to coat.",
        "Open vents on bottom of grill. Light a large chimney starter of charcoal (80 to 100 briquettes) and pour lit charcoal onto bottom rack, leaving about one quarter of bottom rack free of charcoal and banking remaining coals across rest of bottom rack so that coals are about 3 times higher on opposite side. Charcoal fire is medium-hot when you can hold your hand 5 inches above thickest layer of coals for 3 to 4 seconds. 3Sear steak on lightly oiled grill rack over thickest layer of coals, uncovered, 1 minute on each side, then move steak to area over fewer coals and grill, uncovered, turning occasionally and moving to coolest area of grill if browning too quickly, until thermometer inserted horizontally 2 inches into meat registers 120°F, 10 to 12 minutes. Transfer to a plate and let stand 10 minutes (steak will continue to cook, reaching medium-rare).",
        "Preheat all burners on high, covered, 10 minutes.",
        "Sear steak on lightly oiled grill rack, uncovered, 1 minute on each side, then reduce heat to moderate. Grill steak, covered, turning occasionally, until thermometer inserted horizontally 2 inches into meat registers 120°F, 10 to 12 minutes. Transfer to a plate and let stand 10 minutes (steak will continue to cook, reaching medium-rare).",
        "While steak is standing, grill onions (covered only if using a gas grill) over moderate heat, turning over once, until tender, about 6 minutes.",
        "Serve onions with steak; cut steak crosswise into thin slices, holding knife at a 45-degree angle."
    ],
    "ingredients": [
        "4 garlic cloves, minced",
        "1/4 cup balsamic vinegar",
        "3 tablespoons olive oil",
        "1 1/2 lb (1 1/4-inch-thick) top round London broil",
        "3 small red onions (3/4 lb total)",
        "Special equipment: about 24 wooden picks; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Marinate",
        "Fourth of July",
        "Low/No Sugar",
        "Vinegar",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Balsamic-Marinated London Broil with Red Onions",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-balsamic-marinated-london-broil-with-red-onions-108387"
}
