{
    "directions": [
        "Heat the grill to high.",
        "Brush both sides of the mushroom caps with 4 tablespoons of the canola oil and season with salt and pepper. Place on the grill, cap side down and grill until golden brown and slightly charred, 4 to 5 minutes. Turn the mushrooms over and continue cooking until just cooked through, 3 to 4 minutes longer. Remove from the grill and coarsely chop.",
        "Whisk together the shallots, vinegar, extra virgin olive oil and parsley in a medium bowl until combined and season with salt and pepper. Add the mushrooms and stir to coat. Let sit at room temperature for at least 15 minutes before serving.",
        "Brush both sides of the chicken with the remaining canola oil and season with salt and pepper. Place on the grill, skin side down and grill until golden brown, 4 to 5 minutes. Flip over, reduce the heat of the grill to medium, close the cover and continue grilling until just cooked through, about 7 minutes longer. Remove chicken from the grill and let rest 5 minutes before serving. Serve 1 breast per person topped with some of the shiitake vinaigrette. Garnish with parsley leaves."
    ],
    "ingredients": [
        "5 large shiitake mushrooms, stems removed",
        "6 tablespoons canola oil",
        "Salt and freshly ground black pepper",
        "1 teaspoon whole-grain mustard",
        "3 tablespoons balsamic vinegar",
        "3 tablespoons extra-virgin olive oil",
        "4 tablespoons finely chopped flat-leaf parsley, plus torn leaves for garnish",
        "4 bone-in, skin on chicken breasts (about 8 ounces each)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Chicken Breast",
        "Chicken",
        "Poultry Recipes",
        "Mushroom",
        "Vegetable",
        "Main Dish Recipes",
        "Lunch",
        "Gluten Free",
        "Diabetes-Friendly",
        "Low-Carb",
        "Low Sodium",
        "Grilling"
    ],
    "title": "Grilled Chicken Breasts with Shiitake Mushroom Vinaigrette",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/grilled-chicken-breasts-with-shiitake-mushroom-vinaigrette-recipe"
}
