{
    "directions": [
        "In a large bowl, stir together the water, kosher salt, and sugar. Add pork chops to this brine, and let them soak for no more than one hour. Drain and discard the brine. Pat pork chops dry with paper towels.",
        "In a shallow dish, stir together the olive oil, garlic, and rosemary. Place pork chops in the dish, and turn to coat. Cover, and marinate in the refrigerator for at least 1 or 2 hours.",
        "Pour the balsamic vinegar into a small saucepan. Bring to a boil, and cook until reduced by 1/2, about 10 minutes. When the vinegar cools, it should be the consistency of syrup.",
        "Melt butter with olive oil in a large skillet over medium-high or high heat. Add the onions and pears, and quickly brown being careful to keep the wedges intact. Once the onions and pears are browned, reduce heat to low, and cook for about 7 minutes, or until tender. Stir in the reduced vinegar and salt. The recipe can be prepared up to this point several hours before grilling.",
        "Preheat the grill for medium-high heat.",
        "Warm pears on a cool section of the grill (in the skillet), while placing the pork chops over the hot part. Cook pork for about 3 minutes per side, or to desired doneness. Remove to a serving plate, cover with aluminum foil and let rest  for a few minutes. Uncover, top with the pear onion sauce, and serve."
    ],
    "ingredients": [
        "1 1/2 quarts water",
        "5 tablespoons kosher salt",
        "2 tablespoons white sugar",
        "6 pork loin chops, 1/2 inch thick",
        "1/2 cup olive oil",
        "4 cloves garlic, minced",
        "1 tablespoon fresh rosemary, minced",
        "1/2 cup balsamic vinegar",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "2 Vidalia onions, each cut into 8 wedges",
        "2 pears, cored and each cut into 8 wedges",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Pork Chops with Balsamic Caramelized Pears",
    "url": "http://allrecipes.com/recipe/74140/grilled-pork-chops-with-balsamic-cara/"
}
