{
    "directions": [
        "1. Start a charcoal or gas grill or broiler; make sure the fire is very hot, and adjust the rack so that it is as close to the heat source as possible.",
        "2. Meanwhile, make the papaya mustard. Whisk together the mustards and vinegar in a small bowl until the mustard powder is dissolved; let sit while you proceed.",
        "Put the honey in a small heavy saucepan over medium-high heat. Cook, stirring constantly with a rubber spatula, until the honey bubbles, thickens, and darkens slightly, about 7 minutes.",
        "3. Turn the heat to medium and add the papaya. Cook, stirring occasionally, until the papaya water evaporates and the mixture becomes mushy, about 15 minutes.",
        "Remove from the heat and immediately stir in the mustard mixture. Season to taste with salt and lime juice and set aside.",
        "4. Brush the shrimp with the oil, then sprinkle with salt and cayenne. Grill for 2 or 3 minutes per side, turning once. Serve the shrimp, garnished with the cilantro,with the papaya mustard and lime wedges on the side."
    ],
    "ingredients": [
        "2 tablespoons mustard powder, preferably Coleman's",
        "1/4 cup Dijon mustard",
        "2 tablespoons rice vinegar or plum wine vinegar",
        "1/2 cup honey, plus more as needed",
        "1 1/2 pounds papaya, peeled, seeded, and cut into 1/2-inch chunks",
        "Salt",
        "2 tablespoons fresh lime juice, or to taste",
        "24 large shrimp, peeled and deveined",
        "2 tablespoons extra virgin olive oil, plus more as needed",
        "Cayenne pepper",
        "2 tablespoons chopped fresh cilantro leaves",
        "Lime wedges for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Shellfish",
        "Appetizer",
        "Side",
        "Cocktail Party",
        "Quick & Easy",
        "Dinner",
        "Lime",
        "Tropical Fruit",
        "Papaya",
        "Seafood",
        "Shrimp",
        "Grill",
        "Grill/Barbecue",
        "Honey",
        "Party",
        "Cilantro",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Shrimp with Papaya Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-with-papaya-mustard-355889"
}
