{
    "directions": [
        "Open vents in lid and bottom of kettle grill and put 25 briquets on 2 opposite sides of bottom, leaving middle clear. Oil rack and position with wider openings over briquets. Light briquets. (They will be ready for cooking as soon as they turn grayish-white, 20 to 30 minutes.)",
        "Remove plastic wrap from 2 pieces of rolled-out pizza dough (if grill is not large, work with 1 piece at a time, keeping remaining piece chilled) and lightly brush dough with some oil. Trying not to stretch dough, carefully transfer it oiled side down, with your hands to rack of grill. (If it's a very hot day, the dough may get too soft to transfer easily; if so, pop it into the freezer until firm again, about 15 minutes.) Lightly brush top with some oil. When grilling pizzas, rotate them if one side of grill is hotter than the other. Grill crusts, covered, until undersides are golden brown, about 4 minutes. Flip crusts over with 2 metal spatulas and top each crust with half of Fontina, corn, bell pepper, poblanos, pancetta, or bacon, and scallions. Grill pizzas, covered, about 5 minutes more, or until undersides are golden brown and cheese is melted.",
        "Top pizzas with coriander and cut into wedges.",
        "In a large bowl stir together 1/3 cup water, yeast, and sugar and let stand until foamy, about 10 minutes. Stir in remaining 1/3 cup water, 2 tablespoons oil, 1 3/4 cups flour, cornmeal, and salt and blend until mixture forms a dough. Knead dough on a floured surface, incorporating as much of remaining 1/4 cup flour as necessary to prevent dough from sticking, until smooth and elastic 5 to 10 minutes.",
        "Alternatively, dough may be made in a food processor. Proof yeast as described above. In food processor process yeast mixture with 1 3/4 cups flour, cornmeal, and salt until mixture forms a ball, adding more water, 1 teaspoon at a time, if too dry or more flour, 1 tablespoon at a time, if too wet, and knead dough by processing 15 seconds more.",
        "Put dough, prepared by either method, in an oiled deep bowl and turn to coat with oil. Let dough rise, covered with plastic wrap, in a warm place 1 hour, or until doubled in bulk, and punch down. Form dough into 4 balls. Makes enough dough for four 10-inch thin-crust pizzas.",
        "Lightly brush a baking sheet with olive oil. On a lightly floured surface roll out 1 ball of dough 1/8 inch thick (about 10 inches in diameter). Brushing off excess flour, transfer dough with your hands to baking sheet and cover surface completely with plastic wrap. Repeat procedure with remaining dough balls and plastic wrap in same manner, stacking rolled-out pieces on top of one another on baking sheet. Wrap baking sheet with more plastic wrap to ensure that dough is completely covered. (Chill dough until firm, about 1 hour and up to 4 hours.)",
        "Using a long-handled fork char peppers over an open flame, turning them, until skins are blackened, 2 to 8 minutes. (Alternatively, broil peppers on rack of a broiler pan under a preheated broiler about 2 inches form heat, turning them every 5 minutes, until skins are blistered and charred, 15 to 25 minutes.) Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Keeping peppers whole, peel them, starting at blossom end. Cut off tops and discard seeds and ribs. (Wear rubber gloves when handling chilies.)"
    ],
    "ingredients": [
        "2 balls pizza dough, rolled out and chilled (recipe and procedure follow)",
        "olive oil for brushing dough",
        "1 1/2 cups coarsely grated Fontina, preferably Italian (about 9 ounces)",
        "1 cup fresh corn (cut from 2 to 3 ears)",
        "1 red bell pepper, chopped fine (about 1 cup)",
        "2 poblano chilies* if desired, roasted (procedure follows)",
        "6 slices (about 5 ounces) pancetta (Italian unsmoked cured bacon) or bacon, cooked until crisp",
        "1/4 cup chopped scallions",
        "1/4 cup packed fresh coriander leaves, washed well and spun dry",
        "2/3 cup lukewarm water (105°F.-115°F.)",
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "2 tablespoons olive oil plus additional for oiling bowl",
        "1 3/4 to 2 cups all-purpose unbleached flour",
        "1/4 cup finely ground yellow cornmeal",
        "2 teaspoons coarse salt",
        "*available at Mexican markets and some specialty produce markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Bacon",
        "Corn",
        "Bell Pepper",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Fontina",
        "Gourmet"
    ],
    "title": "Grilled Pizza with Fresh Corn, Bell Pepper, Pancetta, and Fontina",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pizza-with-fresh-corn-bell-pepper-pancetta-and-fontina-12648"
}
