{
    "directions": [
        "Let turkey stand at room temperature 30 minutes.",
        "Prepare barbecue (medium heat) for indirect grilling. If using charcoal grill, light briquettes in chimney. Remove top grill rack. Place briquettes at left and right sides of bottom rack, leaving center empty (you may need to light additional briquettes in chimney to replenish during grilling time). Replace top grill rack. If using 3-burner gas grill, light burners on left and right, leaving center burner off. If using 2-burner gas grill, light burner on just 1 side.",
        "Toast fennel seeds, coriander seeds, and peppercorns in medium skillet over medium heat until fragrant and fennel seeds begin to darken, 2 to 3 minutes. Pour spices into spice grinder or small coffee mill; cool. Grind spices finely. Transfer to small bowl; mix in coarse salt.",
        "Brush turkey all over with oil. Sprinkle inside and out with spice mixture. Spread carrots, celery, parsnips, onion, and thyme in 13x9x2-inch metal roasting pan. Place turkey, breast side down, on vegetables.",
        "Place pan with turkey on rack over unlit portion of grill. Cover grill. Insert stem of instant-read thermometer into hole in hood and maintain temperature as close as possible to 350°F by opening vents to increase temperature and closing vents to reduce temperature. Cook turkey 1 hour. Rotate pan. Using oven mitts, turn turkey, breast side up. Cover grill and continue cooking turkey until instant-read thermometer inserted into thickest part of thigh registers 165°F, covering any parts of turkey that are browning too quickly with foil, about 1 1/2 hours longer.",
        "Transfer turkey to platter. Tent with foil and let rest 30 to 45 minutes (internal temperature will rise 5 to 10 degrees).",
        "Strain pan juices into large measuring cup, pressing to extract as much liquid as possible. Spoon off fat that rises to surface into 1-cup measuring cup and, if necessary, add enough butter to fat to measure 1/2 cup. Add enough chicken broth to degreased juices to measure 4 cups.",
        "Heat turkey fat in large saucepan over medium-low heat. Whisk in flour. Cook roux until deep golden brown (like dark peanut butter), whisking often, about 20 minutes. Gradually whisk in broth mixture. Boil until gravy thickens enough to coat spoon, whisking often, about 5 minutes. Whisk in vinegar and thyme. Season gravy to taste with coarse salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 12-to 14-pound turkey, rinsed, patted dry",
        "2 tablespoons fennel seeds",
        "2 tablespoons whole coriander seeds",
        "2 teaspoons whole black peppercorns",
        "1 tablespoon coarse kosher salt",
        "3 tablespoons olive oil",
        "3 medium carrots, peeled, cut into 3/4-inch pieces",
        "3 celery stalks, cut into 3/4-inch pieces",
        "3 medium parsnips (11 ounces), peeled, cut into 3/4-inch pieces",
        "1 large onion, coarsely chopped",
        "1 tablespoon chopped fresh thyme",
        "1/2 cup reserved turkey fat (and butter if needed)",
        "2 to 3 cups low-salt chicken broth",
        "1/2 cup all purpose flour",
        "2 teaspoons Sherry wine vinegar",
        "2 teaspoons finely chopped fresh thyme",
        "Coarse kosher salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Parsnip",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Thyme",
        "Christmas Eve",
        "Potluck",
        "Coriander",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Turkey with Toasted Fennel and Coriander and Fresh Thyme Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-turkey-with-toasted-fennel-and-coriander-and-fresh-thyme-gravy-355793"
}
