{
    "directions": [
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). (If using a charcoal grill, open vents on bottom of grill, then light charcoal. When Charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows: Hot: When you can hold your hand there for 1 to 2 seconds; Medium-hot: 3 to 4 seconds; Low: 5 to 6 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.)",
        "Purée feta, sour cream, water, lemon juice, and garlic in a food processor until smooth, then, with motor running, add 1 1/2 tablespoons oil in a slow stream. Add basil and salt and pepper to taste and pulse until just combined.",
        "Thinly slice zucchini lengthwise (just under 1/8 inch thick) using slicer. Toss zucchini and tomatoes (on the vine) in a large bowl with salt and remaining tablespoon oil. If using loose cherry tomatoes, thread onto skewers. Grill vegetables, in batches if necessary, on oiled grill rack, turning over once with tongs, until just tender, 3 to 5 minutes total per batch. Serve with sauce."
    ],
    "ingredients": [
        "3 oz mild feta cheese (preferably French; 1/2 cup)",
        "1/4 cup sour cream",
        "2 tablespoons water",
        "2 teaspoons fresh lemon juice",
        "1/2 teaspoon minced garlic",
        "2 1/2 tablespoons extra-virgin olive oil",
        "2 tablespoons finely chopped fresh basil",
        "2 medium zucchini (1 lb total)",
        "3/4 lb cherry tomatoes (preferably on the vine, cut into 4 bunches)",
        "1/4 teaspoon salt",
        "Special equipment: an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Backyard BBQ",
        "Feta",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Zucchini and Tomatoes with Feta Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-zucchini-and-tomatoes-with-feta-sauce-232146"
}
