{
    "directions": [
        "Prepare grill.",
        "Grill fresh sausages on an oiled rack set 5 to 6 inches over glowing coals, turning them, 10 to 15 minutes, or until cooked through (170°F. on an instant-read thermometer). Grill smoked sausages on rack, turning them, 5 to 8 minutes, or until heated through.",
        "Serve sausages with ketchup and mustards on bread.",
        "In a heavy kettle cook onions, garlic, and tomatoes, covered, over moderately low heat, stirring occasionally, until onions are very soft, about 40 minutes. Force mixture through a food mill fitted with coarse disk into a bowl.",
        "In cleaned kettle stir together purée, sugar, and vinegar and simmer, uncovered, stirring frequently to prevent scorching, until reduced by half, about 20 minutes.",
        "Tie cloves, allspice, cinnamon, and celery seed in a cheesecloth bag and add to tomato mixture with mustard and paprika. Simmer mixture, stirring, until very thick, about 10 minutes. Discard bag and season mixture with Tabasco and salt. Ketchup may be made 10 days ahead and chilled, covered.",
        "Makes about 1 1/2 cups."
    ],
    "ingredients": [
        "about 2 pounds fresh beef and lamb sausage links with rosemary",
        "about 2 pounds smoked whiskey fennel pork sausage links",
        "Accompaniments",
        "homemade tomato ketchup (recipe follows)",
        "assorted mustards",
        "12 to 16 small French loaves or hot dog buns",
        "4 medium onions, chopped",
        "4 garlic cloves, chopped",
        "four 28-ounce cans whole tomatoes, drained",
        "1/2 cup sugar",
        "1 cup cider vinegar",
        "1 teaspoon whole cloves",
        "1 teaspoon whole allspice, crushed",
        "1 cinnamon stick",
        "1 teaspoon celery seed",
        "2 teaspoons dry mustard",
        "1 teaspoon paprika",
        "Tabasco to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Lamb",
        "Pork",
        "Tomato",
        "Fourth of July",
        "Quick & Easy",
        "Backyard BBQ",
        "Vinegar",
        "Sausage",
        "Spice",
        "Summer",
        "Oktoberfest",
        "Tailgating",
        "Grill",
        "Gourmet"
    ],
    "title": "Grilled Sausages",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sausages-12258"
}
