{
    "directions": [
        "In a small bowl stir together garlic and oil and let stand 15 minutes.",
        "With a mandoline or other manual slicer, slice squash crosswise into 1/16-inch thick rounds, transferring to plate.",
        "Prepare grill: Open vents in lid and bottom of kettle grill and put 25 briquets on 2 opposite sides of bottom, leaving middle clear. Oil rack and position with wider openings over briquets. Light briquets. (They will be ready for cooking as soon as they turn grayish-white, 20 to 30 minutes.)",
        "Remove plastic wrap from 2 pieces of rolled-out-pizza dough (if grill is not large, work with 1 piece at a time, keeping remaining piece chilled) and lightly brush dough with some garlic oil. Trying not to stretch dough, carefully transfer it, oiled side down, with your hands to rack of grill. (If it's a very hot day, the dough may get too soft to transfer easily; if so, pop it into the freezer until firm again, about 15 minutes.) Lightly brush top with some garlic oil. When grilling pizzas, rotate them if 1 side of grill is hotter than the other. Grill crusts, covered, until undersides are golden brown on bottom, about 4 minutes. Flip crusts over with 2 metal spatulas and top each crust with half of cheeses, squash, and thyme. Lightly brush pizzas with some garlic oil and grill, covered, about 5 minutes, or until undersides are golden brown and cheeses are melted.",
        "Garnish pizzas with thyme sprigs and cut into wedges.",
        "In a large bowl stir together 1/3 cup water, yeast, and sugar and let stand until foamy, about 10 minutes. Stir in remaining 1/3 cup water, 2 tablespoons oil, 1 3/4 cups flour, cornmeal, and salt and blend until mixture forms a dough. Knead dough on a floured surface, incorporating as much of remaining 1/4 cup flour as necessary to prevent dough from sticking, until smooth and elastic, 5 to 10 minutes.",
        "Alternatively, dough may be made in a food processor. Proof yeast as described above. In food processor process yeast mixture with 1 3/4 cups flour, cornmeal, and salt until mixture forms a ball, adding more water, 1 teaspoon at a time, it too dry or more flour, 1 tablespoon at a time, if too wet, and knead dough by processing 15 seconds more.",
        "Put dough, prepared by either method, in an oiled deep bowl and turn to coat with oil. Let dough rise, covered with plastic wrap, in a warm place 1 hour, or until doubled in bulk, and punch down. Form dough into 4 balls. Makes enough dough for four 10-inch thin-crust pizzas.",
        "Lightly brush a baking sheet with olive oil.",
        "On a lightly floured surface roll out 1 ball of dough 1/8 inch thick (about 10 inches in diameter). Brushing off excess flour, transfer dough with your hands to baking sheet and cover surface completely with plastic wrap. Repeat procedure with remaining dough balls and plastic wrap in same manner, stacking rolled-out pieces on top of one another on baking sheet. Wrap baking sheet with more plastic wrap to ensure that dough is completely covered. (Chill dough until firm, about 1 hour, and up to 4 hours.)"
    ],
    "ingredients": [
        "1 garlic clove, chopped",
        "3 tablespoons extra-virgin olive oil",
        "1 medium yellow squash",
        "2 balls pizza dough, rolled out and chilled",
        "2/3 cup lukewarm water (105°F.-115°F.)",
        "a 1/4 ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "2 tablespoons olive oil plus additional for oiling bowl",
        "1 3/4 to 2 cups all-purpose unbleached flour",
        "1/4 cup finely ground yellow cornmeal",
        "2 teaspoons coarse salt",
        "3/4 cup coarsely grated fresh mozzarella (about 3 ounces)",
        "3/4 cup freshly grated Parmesan (about 2 1/4 ounces)",
        "4 teaspoons chopped fresh thyme leaves (preferably lemon thyme)",
        "Garnish: fresh thyme sprigs (preferably lemon thyme)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Backyard BBQ",
        "Mozzarella",
        "Parmesan",
        "Squash",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Thyme",
        "Gourmet"
    ],
    "title": "Grilled Pizza with Yellow Squash, Mozzarella, and Lemon Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pizza-with-yellow-squash-mozzarella-and-lemon-thyme-12649"
}
