{
    "directions": [
        "Char peppers directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel and seed peppers. Transfer peppers to processor; using on/off turns, puree peppers coarsely. Transfer peppers to bowl. Mix in remaining ingredients. Season relish to taste with salt and pepper. Let stand 1 hour. (Relish can be prepared 1 day ahead. Cover and refrigerate.)",
        "Combine rosemary, oil, garlic, orange peel strips, salt, and pepper in processor; blend until thick and almost smooth. Spread rosemary puree evenly over pork. Let stand while preparing barbecue.",
        "Stand charcoal chimney on nonflammable surface. Place torn newspaper in bottom of chimney; add charcoal briquettes. Light paper through hole near bottom of chimney. Let charcoal burn until ash is just gray, 30 minutes.",
        "Open vents at bottom of barbecue. Remove top rack. Carefully turn out hot charcoal from chimney onto bottom rack over 1 vent. To make a drip pan, pour water into disposable 9-inch-diameter foil pan to depth of 1/2 inch. Set pan with water on rack next to charcoal. Return top rack to barbecue.",
        "Place pork roast, bone side down, on top rack over drip pan. Cover barbecue with lid, positioning top vent directly over pork. Place stem of metal candy thermometer through top vent, keeping gauge on outside; thermometer should not touch meat or rack. Leave thermometer in place during cooking. Grill pork 1 hour, maintaining temperature of 325°F by opening top and bottom vents wider to increase heat and closing vents to decrease heat. Leave any other vents closed.",
        "Using tongs, turn pork over. Cover barbecue. Cook pork until instant-read meat thermometer inserted into top center of roast registers 140°F to 145°F, about 15 minutes longer; temperature in barbecue may fall below 325°F during last 30 minutes.",
        "Transfer pork to platter, leaving meat thermometer in place. Tent loosely with foil; let stand 15 minutes (temperature of meat will rise to 150°F to 155°F). Cut pork between bones to separate chops. Serve with red pepper relish."
    ],
    "ingredients": [
        "1 1/2 pounds red bell peppers (about 3 large)",
        "2 tablespoons drained capers",
        "1 tablespoon olive oil",
        "4 anchovies, drained, chopped",
        "2 teaspoons grated orange peel",
        "2 teaspoons balsamic vinegar",
        "1/4 teaspoon dried crushed red pepper",
        "1/2 cup fresh rosemary leaves (from about 2 large bunches)",
        "1/3 cup olive oil",
        "6 large garlic cloves",
        "Peel from 1 orange (orange part only, removed in strips with vegetable peeler)",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 31/2-pound center-cut pork rib roast (6 or 7 rib bones), trimmed of excess fat",
        "30 charcoal briquettes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Rosemary",
        "Bell Pepper",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Tuscan Pork Rib Roast with Rosemary Coating and Red Pepper Relish",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tuscan-pork-rib-roast-with-rosemary-coating-and-red-pepper-relish-105301"
}
