{
    "directions": [
        "For vegetables and couscous: Preheat oven to 400°F. Rub cut sides of eggplant with 1 tbsp oil and sprinkle with cumin. Season with salt and pepper and place in baking pan, cut sides down; bake for 30 minutes or until eggplant is browned and cooked through. Remove and let sit until cool enough to handle. Spoon out flesh onto cutting board and roughly chop; transfer to a medium-sized bowl. While eggplant is cooking, bring a large pot of salted water to a boil and set up an ice bath by combining 5 cups ice cubes and 7 cups cold water in a large bowl. Blanch green beans in boiling water until bright green, about 3 minutes; remove with a slotted spoon and cool in the ice bath at least 1 minute (until cool in center). Repeat with wax beans. Cook corn for 15 seconds, then cool 1 minute in ice bath. Drain and blot dry all vegetables. Add tomatoes and toss together gently. Season to taste with salt and pepper. Cook couscous according to package instructions; mix with eggplant and stir in 2 tbsp oil, red wine vinegar, and basil. Season to taste with salt and pepper.",
        "For fish: Preheat grill or broiler. Brush fish on both sides with remaining oil. Season skin side with salt and pepper. Starting with skin side down, grill or broil fish 4 minutes. Season flesh side with salt and pepper; turn and grill or broil about 4 minutes longer or until cooked through.",
        "To serve: Spoon equal amounts of vegetables and couscous onto 4 plates and top with grilled fish. Serve hot."
    ],
    "ingredients": [
        "1 eggplant, halved lengthwise",
        "1/4 cup olive oil",
        "2 tsp ground cumin",
        "1/4 lb green beans, trimmed and cut into 1-inch pieces",
        "1/4 lb wax beans, trimmed and cut into 1-inch pieces",
        "2 cups corn kernels (about 3 ears)",
        "1 pint pear or cherry tomatoes, halved",
        "1 cup uncooked couscous",
        "1 tbsp red wine vinegar",
        "1 cup fresh basil leaves, chopped",
        "4 striped bass (or red snapper) fillets (6 oz each), skin on"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Low Fat",
        "Bass",
        "Corn",
        "Green Bean",
        "Summer",
        "Grill/Barbecue",
        "Couscous",
        "Self"
    ],
    "title": "Grilled Striped Bass with Summer Vegetables and Couscous Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-striped-bass-with-summer-vegetables-and-couscous-vinaigrette-230283"
}
