{
    "directions": [
        "Finely grind cumin seeds in an electric coffee/spice grinder or with a mortar and pestle.",
        "Thinly slice bottom 6 inches of lemongrass, discarding remainder. Purée lemongrass, shallots, garlic, ginger, cumin, sugar, salt, turmeric, cayenne, and water in a food processor, scraping down side occasionally, until as smooth as possible, about 2 minutes. (Paste will not be completely smooth.)",
        "Heat 3 tablespoons oil in a 10-inch heavy skillet over moderate heat until hot but not smoking. Add lemongrass paste, then reduce heat to moderately low and cook, stirring constantly, until paste begins to stick to bottom of skillet and is very thick, 8 to 12 minutes. Transfer paste to a bowl and cool to room temperature, about 10 minutes.",
        "Pat lamb chops dry and rub lemongrass paste all over them, then arrange in 1 layer in a 13- by 9-inch dish. Marinate, covered and chilled, at least 12 and up to 24 hours.",
        "Prepare grill for cooking over direct heat with medium-hot charcoal.",
        "Grill lamb on a lightly oiled grill rack, covered only if using a gas grill, loosening lamb from grill with a metal spatula, turning over occasionally, and moving around on grill when flare-ups occur, 9 to 11 minutes total for medium-rare. (Some of lemongrass paste will fall off.) Transfer chops to a platter and let stand, loosely covered with foil, 10 minutes. Discard wooden picks.",
        "Whisk together lime zest and juice, remaining 1/4 cup oil, and salt and pepper to taste. Spoon over chops and sprinkle with herbs."
    ],
    "ingredients": [
        "1 1/2 teaspoons cumin seeds, toasted and cooled",
        "3 fresh lemongrass stalks, root ends trimmed and 1 or 2 tough outer leaves discarded from each",
        "2 large shallots, chopped (1/2 cup)",
        "4 garlic cloves, chopped",
        "1 1/2 tablespoons chopped peeled fresh ginger",
        "1 1/2 tablespoons sugar",
        "1 teaspoon salt",
        "1/2 teaspoon turmeric",
        "1/4 teaspoon cayenne",
        "3 tablespoons water",
        "1/4 cup plus 3 tablespoons vegetable oil",
        "6 (1 1/4-inch-thick) loin lamb chops (2 to 2 1/2 lb total), end flaps secured with wooden picks",
        "1/4 teaspoon finely grated fresh lime zest",
        "1 tablespoon fresh lime juice",
        "1/2 cup small fresh basil leaves",
        "1/4 cup small fresh mint leaves",
        "1/4 cup fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Lamb",
        "Marinate",
        "Backyard BBQ",
        "Meat",
        "Lamb Chop",
        "Summer",
        "Grill/Barbecue",
        "Lemongrass",
        "Gourmet"
    ],
    "title": "Grilled Lemongrass Lamb Chops with Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lemongrass-lamb-chops-with-herbs-235748"
}
