{
    "directions": [
        "Whisk lemon juice, shallot, 1 tablespoon marjoram, and lemon peel in small bowl. Gradually whisk in 1/4 cup oil. Season vinaigrette with salt and pepper.",
        "Prepare barbecue (medium heat). Place potatoes in large saucepan; add enough cold salted water to cover. Boil just until almost tender, about 4 minutes. Drain. Transfer potatoes to medium bowl. Add 1 teaspoon marjoram and 1 1/2 tablespoons oil; sprinkle with salt and pepper and toss to coat.",
        "Combine squash and bell pepper in large bowl; add remaining 1 teaspoon marjoram and 1 1/2 tablespoons oil. Sprinkle with salt and pepper; toss to coat.",
        "Arrange potatoes in single layer in grill basket. Grill until tender, 5 minutes per side. Transfer to large bowl. Grill squash and bell pepper until tender, turning occasionally, 10 minutes. Transfer squash to bowl with potatoes. Cut bell pepper into 1-inch pieces; add to vegetables. Add vinaigrette; toss. Season with salt and pepper. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 tablespoons fresh lemon juice",
        "2 tablespoons minced shallot",
        "1 tablespoon plus 2 teaspoons chopped fresh marjoram",
        "1 teaspoon finely grated lemon peel",
        "1/4 cup plus 3 tablespoons extra-virgin olive oil",
        "1/2 pound small fingerling potatoes (such as Russian Banana), unpeeled, halved lengthwise",
        "1 pound assorted summer squash (such as zucchini and yellow crookneck), cut on diagonal into 1/3-inch-thick slices",
        "1 large red bell pepper, cut into 1-inch-wide strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Potato",
        "Vegetable",
        "Side",
        "Picnic",
        "Backyard BBQ",
        "Squash",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Yellow Squash",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Potato and Summer Squash Salad with Marjoram-Lemon Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-potato-and-summer-squash-salad-with-marjoram-lemon-vinaigrette-235583"
}
