{
    "directions": [
        "Mince garlic, then mash to a paste with salt. Stir together garlic paste, oil, lemon zest and juice, thyme, pepper, and allspice. Put lamb, fat side up, in a large ceramic or glass dish. Using a paring knife, make 1 1/2-inch-long slits (about 2 inches deep) 2 inches apart all over leg. Reserve 1 teaspoon thyme mixture and push remainder into slits, then rub all over with reserved teaspoon of mixture. Marinate lamb, covered and chilled, 12 hours.",
        "Let lamb stand at room temperature 30 minutes before grilling.",
        "Prepare grill for indirect-heat cooking over medium-hot charcoal (high heat for gas). If using a gas grill, preheat all burners on high, covered, 10 minutes, then turn off all burners except burner closest to you.",
        "Oil grill rack, then grill lamb over area with no coals (or over turned-off burner or burners), covered, without turning, until thermometer inserted into thickest part of roast (almost to the bone but not touching it) registers 125°F for medium-rare, 1 1/4 to 1 1/2 hours (temperatures in thinner parts of leg may register up to 160°F). To maintain medium-hot charcoal, add more charcoal (about 2 cups) every 15 minutes.",
        "Let lamb stand on a cutting board, uncovered, 30 minutes."
    ],
    "ingredients": [
        "4 large garlic cloves",
        "1 1/2 teaspoons salt",
        "2 tablespoons olive oil",
        "1 teaspoon finely grated fresh lemon zest",
        "1 tablespoon fresh lemon juice",
        "5 teaspoons minced fresh thyme",
        "1 teaspoon black pepper",
        "1/2 teaspoon ground allspice",
        "1 (6 1/2- to 7-lb) bone-in leg of lamb, trimmed of all but a thin layer of fat",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Garlic",
        "Herb",
        "Lamb",
        "Marinate",
        "Backyard BBQ",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Leg of Lamb with Thyme and Allspice",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-leg-of-lamb-with-thyme-and-allspice-238680"
}
