{
    "directions": [
        "Place chicken between 2 sheets of plastic wrap; pound with meat mallet to 1/2- to 3/4-inch thickness. Place chicken in 11 x 7 x 2-inch glass baking dish. Drizzle with 4 tablespoons olive oil. Sprinkle with oregano, 2 teaspoons lemon peel, garlic, and pepper. Turn to coat. Cover and let stand 1 hour at room temperature.",
        "Fill large bowl halfway with ice cubes and water. Cook carrots in boiling salted water until crisp-tender, about 2 minutes. Drain. Immediately place carrots in bowl of ice water to cool. Drain carrots; pat dry.",
        "Prepare barbecue (medium-high heat). Toss carrots, 1 tablespoon oil, and chipotle chiles in large bowl; sprinkle lightly with coarse salt. Place chicken, skin side down, on grill, along with carrots. Grill chicken until cooked through, 5 to 6 minutes per side. Grill carrots until tender and grill marks appear, about 3 minutes per side. Transfer chicken to cutting board. Transfer carrots to large bowl. Drizzle carrots with remaining 1 tablespoon oil, 1 tablespoon lemon juice, and honey. Add cilantro and remaining 1 teaspoon lemon peel; toss to coat. Season with coarse salt and freshly ground black pepper. Slice chicken on diagonal. Arrange on platter, surround with grilled carrots, and sprinkle with crumbled feta. Drizzle remaining 1 tablespoon lemon juice over and serve.",
        "Dried, smoked jalapeños in a spicy tomato sauce called adobo; available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "1 1/4 pounds boneless chicken breast halves with skin",
        "6 tablespoons extra-virgin olive oil, divided",
        "2 1/2 teaspoons minced fresh oregano",
        "3 teaspoons finely grated lemon peel, divided",
        "2 garlic cloves, pressed",
        "Freshly ground black pepper",
        "1 1/2 pounds large carrots, peeled, cut on deep diagonal into 1/4- to 1/3-inch-thick slices",
        "3/4 teaspoon minced canned chipotle chiles*",
        "Coarse kosher salt",
        "2 tablespoons fresh lemon juice, divided",
        "1 1/2 teaspoons honey",
        "1/4 cup chopped fresh cilantro",
        "4 ounces feta cheese, coarsely crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Feta",
        "Carrot",
        "Spring",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Chile Pepper",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Chicken Breasts and Chipotle-Cilantro Carrots with Feta",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-breasts-and-chipotle-cilantro-carrots-with-feta-358494"
}
