{
    "directions": [
        "1. Heat the oven to 325°F. Lightly oil and salt the day-old bread and bake until golden brown, about 10 minutes. Let cool, tear into pieces, and process in the food processor until finely ground; set aside.",
        "2. In a medium skillet, heat the pancetta and cook over medium-high heat for 5 minutes until lightly golden brown. Drain on a paper towel-lined plate. In a medium bowl, mix the vinegar, mustard seeds, red pepper flakes, sugar, and thyme. Whisk in the melted butter and add the red onions, fennel, and pancetta. Set the pancetta vinaigrette aside.",
        "3. In a large bowl, toss the broccoli rabe with the radicchio leaves, oil, and garlic; add salt to taste. Heat a grill or grill pan until hot but not smoking. Put the greens (in batches) on the grill for 30 seconds, turning them over frequently until just wilted; transfer to a large bowl. Continue until all of the broccoli rabe and radicchio are grilled and toss them with 4 tablespoons of the pancetta vinaigrette.",
        "4. Bring a medium pot of water to a boil over medium-high heat and use a slotted spoon to lower the eggs into the water. Adjust the heat to maintain a simmer and cook the eggs for 5 minutes. Fill a medium bowl with ice and water, then remove the cooked eggs from the pan into the ice water bath. When the eggs are cool enough to handle, gently crack the shell all over, start to peel, and intermittently submerge in the ice bath (if they're a bit too hot) and continue to peel.",
        "5. To serve, portion the grilled broccoli rabe and radicchio onto 4 serving plates, mounding it in the center of each plate. Put 5 Parmigiano shavings on top of the greens, then set one whole soft-cooked egg on top. Drizzle the remaining vinaigrette on top of the egg and around the plate and top generously with the breadcrumbs."
    ],
    "ingredients": [
        "2 slices day-old country or rustic bread, crusts removed",
        "Olive oil",
        "Coarse salt",
        "6 slices pancetta (about 1/4 pound), cut into 14-inch dice",
        "1/2 cup white balsamic vinegar",
        "1 tablespoon mustard seeds",
        "1 teaspoon crushed red pepper flakes",
        "2 tablespoons sugar",
        "1 teaspoon fresh thyme leaves, roughly chopped",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1/4 cup finely chopped red onions (about 1/2 medium onion)",
        "1/4 cup finely chopped fennel (about 1/2 bulb)",
        "1 pound young broccoli rabe, washed, dried, and leaves removed (keep for another use)",
        "2 heads radicchio, cored and leaves separated",
        "2 tablespoons blended olive oil and grape seed oil",
        "2 teaspoons minced garlic",
        "4 large eggs",
        "20 shavings Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Backyard BBQ",
        "Parmesan",
        "Bacon",
        "Fall",
        "Grill",
        "Grill/Barbecue",
        "Radicchio",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Broccoli Rabe and Radicchio with Pancetta Dressing Topped with a Soft-Cooked Egg",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-broccoli-rabe-and-radicchio-with-pancetta-dressing-topped-with-a-soft-cooked-egg-361389"
}
