{
    "directions": [
        "In a small bowl whisk together the vinegar, the mustard, the anchovy paste, the thyme, the sugar, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified.",
        "Reserve 2 tablespoons of the dressing in another small bowl, arrange the tuna pieces and the squash slices on a baking sheet, and brush them lightly with the reserved dressing. In a bowl toss the shrimp and the scallops with 2 tablespoons of the remaining dressing. Let the mixture stand for 15 minutes. In a kettle of boiling water cook the beans for 5 minutes, or until they are crisp-tender, drain them in a colander, and refresh them under cold water. In another bowl toss the beans with 3 tablespoons of the remaining dressing.",
        "On a rack set 4 to 6 inches over glowing coals grill the tuna for 2 1/2 minutes on each side, the shrimp for 4 minutes on each side, and the scallops and the squash for 6 minutes on each side, transferring the seafood and the squash as it is cooked to a platter. Line 6 plates with the lettuce, on each plate arrange 2 scallops, halved horizontally, 3 shrimp halves, and 1 piece of tuna, sliced diagonally, and divide the squash, beans, roasted pepper, tomatoes, and olives among the plates. Drizzle the remaining dressing over the salads or serve it separately."
    ],
    "ingredients": [
        "3 tablespoons red-wine vinegar",
        "1 tablespoon Dijon-styled mustard",
        "1 teaspoon anchovy paste",
        "1/2 teaspoon dried thyme, crumbled",
        "1/4 teaspoon sugar",
        "1/3 cup olive oil",
        "1 pound 1-inch-thick tuna steak, cut into 6 pieces",
        "1 large yellow squash, cut into 1/4-inch-thick slices",
        "9 jumbo shrimp, shelled and halved lengthwise",
        "12 large sea scallops",
        "1 pound green or wax beans or a combination, trimmed and cut into 2-inch lengths",
        "red-leaf lettuce for lining the plates",
        "1 red bell pepper, roasted and cut into 2-inch pieces",
        "1 pint red or yellow cherry tomatoes or a combination, quartered",
        "1 cup drained Niçoise olives (available at specialty foods shops and some supermarkets)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Olive",
        "Backyard BBQ",
        "Lunch",
        "Tuna",
        "Scallop",
        "Shrimp",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Seafood Salad Niçoise",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-seafood-salad-nicoise-12305"
}
