{
    "directions": [
        "Heat olive oil in a large saucepan on the grates of the grill. Add the onions and garlic and cook until soft. Add chickpeas, stock and salt and pepper and cook until chickpeas are very soft. *Transfer mixture carefully, in batches, to a blender and blend until smooth. Return the mixture to the saucepan and bring to a boil. Slowly whisk in the polenta, stirring constantly, and continue whisking until mixture begins to bubble. Reduce heat to medium and continue cooking, stirring with a wooden spoon until the mixture is thickened and cooked, about 30 minutes. Season with salt and pepper, to taste.",
        "Spread the mixture into a baking sheet, cover with plastic and place in the refrigerator until cold and very firm, about 4 hours. When the polenta is firm, remove from the refrigerator and, using a 2-inch ring mold, cut out circles of the polenta.",
        "Preheat a grill to medium-high.",
        "Season the polenta circles with salt and pepper on both sides, brush with oil and grill on both sides until golden brown, about 2 to 3 minutes per side. Remove from grill, drizzle with chive oil and garnish with lemon zest and chives.",
        "Combine ingredients in a blender and blend for 5 minutes. Season with salt and pepper, to taste."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 Spanish onion, finely chopped",
        "2 cloves garlic, finely chopped",
        "2 cups canned chickpeas, rinsed and drained",
        "8 cups chicken stock or water",
        "Salt and freshly ground black pepper",
        "2 cups polenta",
        "1/2 cup olive oil",
        "Chive oil, recipe follows",
        "Finely grated lemon zest",
        "Finely chopped fresh chives",
        "1 cup chopped chives",
        "1 cup extra-virgin olive oil",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Grilling Recipes",
        "Grilling",
        "Healthy",
        "European Recipes",
        "Italian",
        "American",
        "Cake",
        "Polenta Recipes",
        "Fruit",
        "Rice Recipes",
        "Lemon Recipes",
        "Vegetable",
        "Beans and Legumes",
        "Low Calorie",
        "Gluten Free",
        "Heart-Healthy",
        "High Fiber",
        "Low-Cholesterol",
        "Pureeing Recipes"
    ],
    "title": "Grilled Chickpea Polenta Cakes with Chive Oil and Lemon",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/grilled-chickpea-polenta-cakes-with-chive-oil-and-lemon-recipe"
}
