{
    "directions": [
        "Prepare grill (medium-high heat). Purée ginger, 1/4 cup oil, 1 tablespoon garam masala, garlic, coriander, and cumin in a blender until coarse purée forms. Put salmon into a baking dish and season with salt and pepper. Coat salmon with ginger pureée. Let marinate at room temperature for 15 minutes.",
        "Meanwhile, stir yogurt, cucumber, cilantro, scallions, lime juice, and remaining 1 teaspoon garam masala in a medium bowl. Season raita to taste with salt and pepper.",
        "Brush the grill rack with oil. Brush off marinade for easier grilling, or leave it on for a better crust. Grill salmon, turning once, until it just begins to flake in center, 4-5 minutes per side. Transfer salmon to a platter. Garnish with cilantro. Serve with raita."
    ],
    "ingredients": [
        "1/2 cup coarsely chopped peeled fresh ginger",
        "1/4 cup vegetable oil plus more",
        "1 tablespoon plus 1 teaspoon garam masala",
        "2 garlic cloves, coarsely chopped",
        "2 teaspoons ground coriander",
        "1 1/2 teaspoons ground cumin",
        "1 2-pound center-cut piece of boneless salmon fillet, skin on",
        "Kosher salt and freshly ground black pepper",
        "1 cup plain whole-milk yogurt",
        "3/4 cup finely chopped peeled, seeded cucumber",
        "2 tablespoons finely chopped fresh cilantro, plus more for garnish",
        "2 scallions, finely chopped",
        "1 tablespoon fresh lime juice",
        "Ingredient info: Garam masala, an Indian spice mixture, is available in the spice section of better supermarkets and at Indian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick & Easy",
        "Yogurt",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Salmon",
        "Spice",
        "Cucumber",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Salmon with Indian Spices and Raita",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-salmon-with-indian-spices-and-raita-365171"
}
