{
    "directions": [
        "In blender on high, blend tahini and garlic until smooth, about 30 seconds. With motor running, add 1/2 cup water, lemon juice, olive oil, salt, and pepper and blend until incorporated, about 30 seconds. (Tahini sauce can be prepared ahead and refrigerated, in airtight container, up to 2 days. If sauce is too thick after storage, whisk in several drops of water to thin.)",
        "Reserve 1/2 cup tahini sauce for serving. Brush remainder in thick layer over both sides of tempeh pieces. Transfer to airtight container and refrigerate at least 4 hours and up to 8 hours.",
        "In a 2-quart pot over moderately high heat, bring orange juice to a boil. Lower heat to moderate and simmer, uncovered, until reduced by half, 6 to 8 minutes. Transfer to large bowl and let cool to room temperature, about 15 minutes. Whisk in vinegar, then gradually whisk in olive oil, orange oil, salt, and pepper. (Dressing can be prepared ahead and refrigerated, in airtight container, up to 2 days. Whisk to reemulsify before using.)",
        "If using charcoal grill, open vents on bottom, then light charcoal and preheat grill to moderately high. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high. Brush grill rack with oil.",
        "Grill tempeh, turning once, until golden brown, about 3 minutes per side. Grill radicchio, turning once, until beginning to wilt, about 2 minutes perside.",
        "Cut each piece of tempeh into 4 slices. In large bowl, toss together radicchio, parsley, and orange dressing. Divide salad among 4 plates and top with tempeh and avocado slices. Drizzle with lemon juice and reserved tahini sauce. Serve immediately."
    ],
    "ingredients": [
        "1/2 cup tahini (Middle Eastern sesame paste), well-stirred",
        "1 clove garlic, germ removed and clove crushed with back of knife",
        "2 teaspoons fresh lemon juice (from 1 small lemon)",
        "1/2 teaspoon extra-virgin olive oil",
        "1 teaspoon fine sea salt",
        "3/4 teaspoon ground white pepper",
        "4 (4-ounce) pieces soy tempeh",
        "1 cup freshly squeezed orange juice (from 2 medium oranges)",
        "3 tablespoons plus 1 1/2 teaspoons white wine vinegar",
        "1/2 cup extra-virgin olive oil",
        "2 drops orange oil*",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon ground white pepper",
        "Olive oil (for brushing)",
        "2 heads radicchio, cut into eighths through core, with some core still attached to each piece",
        "1/4 cup (loosely packed) fresh flat-leaf parsley, coarsely chopped",
        "2 firm-ripe avocados, peeled and cut into wedges",
        "3 tablespoons fresh lemon juice (from 1 medium lemon)",
        "*Available at specialty foods shops. If unavailable, use 1 tablespoon finely grated orange zest. Do not substitute orange flower water."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Soy",
        "Marinate",
        "Vegetarian",
        "Backyard BBQ",
        "Orange",
        "Avocado",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Vegan",
        "Sesame",
        "Parsley"
    ],
    "title": "Grilled Marinated Tempeh Steak with Avocado, Radicchio, Orange Dressing, and Tahini",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-marinated-tempeh-steak-with-avocado-radicchio-orange-dressing-and-tahini-242945"
}
