{
    "directions": [
        "Roast peppers on racks of gas burners over high heat, turning with tongs, until skins are blackened, 5 to 8 minutes. (Alternatively, broil peppers on rack of a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a bowl and let stand, covered, until cool enough to handle.",
        "Peel peppers and discard stems and seeds. Finely chop peppers and pat dry, then season with salt and pepper.",
        "Finely grate 2 teaspoons zest from lemon and squeeze 2 teaspoons juice.",
        "Pureé zest, juice, sour cream, and 1/3 cup chopped basil in a food processor until smooth and season with salt and pepper. Transfer to a bowl and chill, covered, while preparing roulades.",
        "Remove skin and tender from turkey breast, reserving tender for another use (discard skin). Cut turkey breast in half crosswise and chill 1 piece, covered, while working with the other (1 piece will be slightly larger).",
        "Holding a sharp knife parallel to work surface and beginning on a long side, butterfly turkey by cutting horizontally almost in half (not all the way through), then opening it like a book.",
        "Place between 2 sheets of plastic wrap and, with flat side of a meat pounder or with a rolling pin, pound turkey to slightly less than 1/4 inch thick (don’t worry if you end up with a few small holes). Butterfly and pound remaining piece.",
        "Season turkey pieces well with salt and pepper and divide roasted peppers between them, spreading evenly and leaving a 1/4-inch border around edges. Top peppers with whole basil leaves. Beginning with a short side, roll up each turkey piece, gently pressing on filling while rolling (don’t roll too tight, or filling will slip out of ends), and tie roulades crosswise with string. Season roulades with salt and pepper.",
        "If using a charcoal grill, light a full chimney of charcoal, then put on 1 side of bottom rack. Charcoal will be ready for cooking when it turns grayish white, 10 to 15 minutes. If using a gas grill, light both sides.",
        "When fire is medium-hot (you can hold your hand 5 inches above rack 3 to 4 seconds), place roulades on lightly oiled grill rack directly over fire and grill, uncovered, turning occasionally, until seared on all sides, about 15 minutes.",
        "If using a gas grill, turn off 1 side of grill. Move roulades away from fire and grill over indirect heat, covered with lid, turning roulades occasionally, until an instant-read thermometer inserted diagonally 2 inches into several places on each roulade registers 170°F, 15 to 20 minutes (smaller piece will be done first). Transfer to a cutting board and let stand 10 minutes.",
        "Discard string, being careful not to unroll turkey, and cut into 1/2-inch-thick slices with a serrated knife. Serve roulades warm with sauce."
    ],
    "ingredients": [
        "4 medium red bell peppers",
        "1 large lemon",
        "1 cup sour cream",
        "1/3 cup chopped fresh basil leaves plus 2 cups large leaves",
        "1 boneless turkey breast half",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Basil",
        "Bell Pepper",
        "Summer",
        "Grill/Barbecue",
        "Sour Cream"
    ],
    "title": "Grilled Pepper, Basil, and Turkey Roulade with Basil Sour Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pepper-basil-and-turkey-roulade-with-basil-sour-cream-sauce-105411"
}
