{
    "directions": [
        "Puree first 4 ingredients in mini processor. Transfer to small bowl. Whisk in mayonnaise; season with salt, black pepper, and cayenne pepper. DO AHEAD: Can be made 3 days ahead. Cover; chill.",
        "Arrange mushroom caps and onion slices on baking sheet; brush both sides with oil, then sprinkle with salt, pepper, and thyme. Turn mushrooms, gill side up, and sprinkle with garlic. Let stand at least 30 minutes and up to 2 hours.",
        "Prepare barbecue (medium-high heat). Place mushrooms, gill side up, and onion slices on rack. Cook until grill marks appear, about 4 minutes. Turn vegetables over, transferring to cooler part of grill. Cover and cook until mushrooms are very tender and onion slices still retain some texture, about 8 minutes. Turn mushrooms, gill side up; top with cheese. Arrange rolls, cut side down, on grill. Cover; cook until cheese on mushrooms melts and cut sides of rolls are golden, about 1 minute longer.",
        "Arrange roll bottoms on plates; spread with aioli. Top each with mushroom, onion slice, and watercress. Spread cut side of roll tops with aioli; press onto watercress."
    ],
    "ingredients": [
        "1/2 cup chopped drained piquillo peppers or roasted red peppers from jar",
        "1 tablespoon Sherry wine vinegar",
        "2 teaspoons finely chopped fresh thyme",
        "1 garlic clove, minced",
        "1/2 cup purchased mayonnaise",
        "Cayenne pepper",
        "6 large portobello mushrooms, stemmed, dark gills scraped out",
        "1 sweet onion (such as Vidalia or Walla Walla), cut into 1/3-inch-thick slices",
        "Extra-virgin olive oil",
        "2 teaspoons chopped fresh thyme",
        "1 large garlic clove, minced",
        "8 ounces Idiazábal or smoked Gouda cheese, rind trimmed, thinly sliced",
        "6 sourdough rolls (each about 4 inches in diameter), halved horizontally",
        "1 bunch watercress, stems trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Pepper",
        "Fourth of July",
        "Vegetarian",
        "High Fiber",
        "Backyard BBQ",
        "Mayonnaise",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Watercress"
    ],
    "title": "Grilled Portobello Burgers with Piquillo Pepper Aïoli and Watercress",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-portobello-burgers-with-piquillo-pepper-aioli-and-watercress-242712"
}
