{
    "directions": [
        "Bring a large kettle (at least 8-quart capacity) three fourths full of water to a boil for lobsters.",
        "In a blender blend zest, orange juice, vinegar, chipotles in adobo, salt, and sugar until chipotles are chopped fine. With motor running add oil in a slow stream. Vinaigrette may be prepared up to this point 3 days ahead and chilled, covered. Bring vinaigrette to room temperature before serving.",
        "In boiling water partially cook lobsters, 2 at a time, over high heat 3 minutes and transfer with tongs to a colander to drain and cool. (Make sure water returns to a full boil before adding each batch of lobsters.)",
        "When lobsters are cool enough to handle, remove tails and claws and discard bodies. With kitchen shears halve tails (including shells) lengthwise, cutting off swimmerets on underside of tails if desired. Lobsters may be prepared up to this point 1 day ahead and chilled, covered.",
        "Prepare grill.",
        "Grill claws, in batches if necessary, on a rack set 5 to 6 inches over glowing coals, turning occasionally, until liquid bubbles at open end, 5 to 7 minutes, and transfer to a platter.",
        "Stir basil leaves into vinaigrette and reserve 1 1/4 cup in a small pitcher. Brush meat in lobster tails with some vinaigrette. Grill tails, meat side down, in batches if necessary, 3 minutes. Turn tails meat side up, brushing with more vinaigrette, and grill until juices are bubbling and meat is plump and opaque, 3 to 5 minutes. Transfer tails to platter. Lobster may be grilled 2 hours ahead and cooled, uncovered, before chilling, covered.",
        "Serve lobster warm or chilled with reserved vinaigrette and garnish with basil sprigs."
    ],
    "ingredients": [
        "eight 1 1/2-pound live lobsters",
        "3/4 teaspoon finely grated fresh orange zest",
        "1 cup fresh orange juice",
        "1/4 cup white-wine vinegar",
        "1 1/2 tablespoons canned chipotle chilies in adobo, or to taste",
        "2 1/2 teaspoons salt",
        "1 teaspoon firmly packed brown sugar",
        "1 cup olive oil",
        "2 tablespoons chopped fresh basil leaves",
        "Garnish: basil sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Backyard BBQ",
        "Orange",
        "Basil",
        "Lobster",
        "Hot Pepper",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Lobster with Orange Chipotle Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lobster-with-orange-chipotle-vinaigrette-10497"
}
