{
    "directions": [
        "Combine 6 Thai bird chiles (or 2 serrano or jalapeño chiles) and next 12 ingredients in processor. Using on/off turns, blend until finely chopped and paste forms. If spicier sambal is desired, add more chopped chiles to taste and blend again until paste forms. Transfer sambal to small bowl. Heat 2 tablespoons oil in heavy large saucepan over medium-high heat. Add sambal and cook until fragrant and lightly browned, stirring constantly and adding more oil by tablespoonfuls if mixture is dry, about 7 minutes. Add 1 cup water; reduce heat to medium and simmer until most of water is absorbed but mixture is still creamy, stirring often, about 4 minutes. Transfer to small bowl and cool. DO AHEAD:Can be made 1 day ahead. Cover sambal and chill.",
        "Whisk lime juice, 3 tablespoons oil, and 2 tablespoons sambal in small bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewhisk marinade before using, adding more oil by teaspoonfuls if marinade is thick.",
        "If using unpeeled shrimp, use kitchen scissors to cut shrimp shell along rounded back of tail; scrape out vein with tip of bamboo skewer or tip of small knife. Place peeled or unpeeled shrimp in large glass baking dish. Brush shrimp all over with marinade. Allow shrimp to marinate at room temperature at least 15 minutes and up to 30 minutes.",
        "Meanwhile, prepare barbecue (medium-high heat). Brush grill rack with oil. Grill shrimp until just opaque in center, 2 to 3 minutes per side. Transfer shrimp to platter. Rewarm remaining sambal and serve alongside for dipping or for spooning atop shrimp.",
        "Unpeeled shrimp cook up more succulent and flavorful but are a bit messier to eat than peeled shrimp (which you can use, if you prefer). For ease of preparation, the seafood department at some supermarkets sells uncooked unpeeled shrimp that have already been deveined."
    ],
    "ingredients": [
        "6 (or more) Thai bird chiles or 2 (or more) serrano or jalapeño chiles (preferably red), seeded, coarsely chopped",
        "1 1/2 cups coarsely chopped shallots (about 8 ounces)",
        "1/4 cup chopped peeled fresh ginger",
        "3 tablespoons chopped lemongrass (from bottom 4 inches of 2 large stalks)",
        "6 macadamia nuts",
        "4 garlic cloves, coarsely chopped",
        "2 teaspoons (packed) golden brown sugar",
        "2 teaspoons turmeric",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground coriander",
        "1 teaspoon paprika",
        "1 bay leaf, crumbled",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons (or more) vegetable oil",
        "1 cup water",
        "2 tablespoons fresh lime juice",
        "3 tablespoons (or more) vegetable oil",
        "3 pounds uncooked unpeeled large shrimp, or 2 1/2 pounds uncooked peeled large shrimp, deveined, tails left intact"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Low Cal",
        "Backyard BBQ",
        "Dinner",
        "Shrimp",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Lemongrass",
        "Chile Pepper",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Grilled Shrimp with Fiery Lemongrass-Chile Sambal",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-with-fiery-lemongrass-chile-sambal-353811"
}
