{
    "directions": [
        "Prepare grill.",
        "Finely chop ginger, garlic, chile, and coconut in a food processor. Add cilantro and mint and process until chopped. Add vinegar, sugar, and salt and blend chutney well.",
        "Cut banana leaves into 6 sheets (12 by 10 inches each). Arrange in a stack with a short side nearest you.",
        "Season fillets on both sides with salt and pepper. Spread 1 slightly rounded tablespoon cilantro chutney on top of a fillet, then invert onto center of a banana leaf, arranging fillet crosswise. Spread another slightly rounded tablespoon of chutney on top of fish. Fold bottom edge of leaf over fish and fold in sides over fish, then fold package away from you, enclosing fish. Tie package (in both directions) with a 24-inch piece of kitchen string. Repeat with remaining fillets, chutney, and banana leaves.",
        "Grill fish, turning over once, until cooked through, 8 to 10 minutes (untie 1 package to check doneness). Cut string before serving and transfer packages to 6 plates. The banana leaves are inedible, but we think they make a nice presentation."
    ],
    "ingredients": [
        "1 (1- by 1 1/2-inch) piece fresh ginger, peeled",
        "5 garlic cloves",
        "1 fresh hot green chile such as jalapeño or serrano, trimmed",
        "1/2 cup chopped fresh coconut (see how to crack and peel fresh coconut )",
        "3 cups fresh cilantro sprigs",
        "1/3 cup fresh mint leaves",
        "1/4 cup white-wine vinegar",
        "1 teaspoon sugar",
        "1/4 teaspoon salt, or to taste",
        "1 (1-pound) package frozen banana leaves, thawed",
        "6 (6-ounce) pieces white fish fillet (1 inch thick) such as wahoo, cod, or halibut",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fish",
        "Ginger",
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Coconut",
        "Mint",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Fish with Cilantro Chutney in Banana Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-fish-with-cilantro-chutney-in-banana-leaves-105016"
}
