{
    "directions": [
        "Using on/off turns, blend sage leaves, pine nuts, parsley, and garlic in processor until mixture is finely chopped. With machine running, add 3/4 cup oil and blend until thick paste forms. Mix in cheese. Transfer to small bowl; season with salt and pepper. (Can be made 1 day ahead. Press plastic wrap onto surface of pesto and refrigerate. Bring to room temperature before using.)",
        "Place each chicken breast between sheets of waxed paper. Using rolling pin or meat mallet, pound each to 1/2-inch thickness. Brush chicken with 3 tablespoons oil; sprinkle with salt and pepper. Let chicken stand 30 minutes.",
        "Prepare barbecue (medium heat). Grill chicken until firm to touch and cooked through, about 5 minutes per side. Transfer chicken to platter. Grill focaccia until just beginning to brown, about 1 minute per side.",
        "Arrange bottom halves of focaccia on work surface. Spread each with mayonnaise. Top each with overlapping layer of sliced apple, then 1 chicken breast. Drizzle each chicken breast with pesto. Spread pesto on cut side of bread tops. Place tops on chicken, pesto side down. Cut sandwiches in half on diagonal. Transfer sandwiches to plates and serve."
    ],
    "ingredients": [
        "3/4 cup lightly packed fresh sage leaves (from 2 large bunches)",
        "3/4 cup pine nuts (about 4 ounces)",
        "1/4 cup (packed) fresh Italian parsley leaves",
        "1 garlic clove",
        "3/4 cup plus 3 tablespoons olive oil",
        "6 tablespoons freshly grated Parmesan cheese",
        "6 skinless boneless chicken breast halves",
        "6 4x5-inch rectangles focaccia, ciabatta, or long French rolls, split horizontally",
        "Mayonnaise",
        "3 medium Fuji apples, halved, cored, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Fruit",
        "Poultry",
        "Apple",
        "Summer",
        "Grill/Barbecue",
        "Sage"
    ],
    "title": "Grilled Chicken Sandwiches with Sage Pesto and Apples",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-sandwiches-with-sage-pesto-and-apples-108306"
}
