{
    "directions": [
        "Prepare grill. Soak skewers in warm water 30 minutes.",
        "With a sharp knife slit skin of pompano along center of each piece to keep skin from curling when grilling. Shell shrimp, leaving tail and connecting shell segment intact, and thread 4 shrimp onto each skewer. Brush shrimp and pompano all over with additional olive oil.",
        "With a sharp knife cut ends from lemons. Standing each lemon on a cut side, cut rind and pith from lemon, exposing flesh. Cut lemon segments free from membranes. Discard coarse stems from spinach. Flatten olives, a few at a time, with flat side of a large heavy knife to loosen pit from flesh and discard pits. In a small saucepan stir together olives, extra-virgin olive oil, bay leaves, and a pinch salt.",
        "Season shrimp and pompano with salt and pepper and grill on a lightly oiled rack set 5 to 6 inches over glowing coals until just cooked through, about 3 minutes on each side. (Alternatively, grill seafood in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer seafood with tongs to a platter and keep warm, covered. Heat olive mixture over low heat until warm.",
        "In a 12-inch skillet heat remaining tablespoon olive oil over moderately high heat until hot but not smoking and sauté spinach, stirring and turning it with tongs, until wilted, 1 to 2 minutes. Season spinach with salt and pepper.",
        "Serve seafood over spinach, topped with lemon segments and olive mixture."
    ],
    "ingredients": [
        "four 10-inch wooden skewers",
        "four 1/4-pound pieces pompano fillet with skin",
        "16 large shrimp (about 1 pound)",
        "1 tablespoon olive oil plus additional for brushing seafood",
        "2 lemons",
        "1 pound spinach (about 2 bunches)",
        "1/3 cup Ligurian or Niçoise olives*",
        "1/3 cup extra-virgin olive oil (preferably Ligurian)",
        "16 small fresh bay leaves",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Backyard BBQ",
        "Lemon",
        "Shrimp",
        "Spinach",
        "Fall",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Grilled Pompano and Shrimp with Lemon, Olives, and Bay Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pompano-and-shrimp-with-lemon-olives-and-bay-leaves-15626"
}
