{
    "directions": [
        "Prepare grill",
        "In a saucepan boil carrot juice until reduced to about 3/4 cup, about 10 minutes, and cool. In a bowl, whisk together carrot juice, lemon juice, oil, and cumin and season dressing with salt and pepper. Dressing may be made 1 day ahead and chilled, covered.",
        "Cut romaine and spinach crosswise into 1/4-inch-wide strips and, using side of a grater with largest holes, grate carrots. Cut tomatoes into 1/4-inch dice. Rinse chick-peas and slip off skins. Vegetables may be prepared up to this point 4 hours ahead and chilled separately, covered.",
        "Pat chicken dry and season with salt and pepper. Grill chicken on a lightly oiled rack set 5 to 6 inches over glowing coals 7 minutes on each side, or until cooked through. (Alternatively, grill chicken in a hot lightly oiled well-seasoned ridged grill pan over moderately high heat.) Let chicken stand 2 minutes and slice. In a large bowl toss chicken with vegetables.",
        "Just before serving, toss salad with dressing."
    ],
    "ingredients": [
        "2 cups fresh carrot juice*",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon extra-virgin olive oil",
        "1 1/2 teaspoons ground cumin",
        "2 hearts of romaine (about 1 pound total)",
        "1 bunch spinach",
        "1 pound carrots",
        "1 1/4 pounds vine-ripened tomatoes (about 4 medium)",
        "2 cups drained canned chick-peas (one 19-ounce can)",
        "10 ounces skinless boneless chicken breast halves (about 2)",
        "*available at natural foods stores, juice bars, and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Tomato",
        "Spinach",
        "Chickpea",
        "Carrot",
        "Summer",
        "Gourmet"
    ],
    "title": "Grilled Chicken and Chick-Pea Salad with Carrot-Cumin Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-and-chick-pea-salad-with-carrot-cumin-dressing-15500"
}
