{
    "directions": [
        "Place garlic into a nonreactive bowl and whisk in cola, coffee, rice vinegar, ketchup, black pepper, 1 teaspoon salt, rosemary, and hot sauce until thoroughly combined.",
        "Unroll the skirt steak and cut into 6-inch lengths with the grain, using a kitchen scissors. Submerge the meat totally in the marinade; place a piece of plastic wrap onto meat and marinade surface. Marinate 8 to 12 hours in refrigerator or overnight.",
        "Preheat an outdoor grill for medium-high heat.",
        "Remove meat from marinade; save the marinade. Pat meat thoroughly dry with paper towels. Season both sides of meat with salt and cayenne pepper to taste.",
        "Pour marinade into a saucepan over medium heat and simmer until slightly thickened, about 10 minutes. Strain through a fine-mesh sieve into a bowl.",
        "Grill meat on the preheated grill until steak pieces are still pink inside and meat has good grill marks, about 4 minutes per side. Place thin cooked pieces onto thicker pieces of meat to prevent thin ones from overcooking. When the surface of the meat looks shiny and wet from juices being forced  up to the surface, the meat is medium-rare to medium in doneness. An instant-read meat thermometer inserted into the center of a piece should read 125 to 130 degrees F (52 to 54 degrees C).",
        "Remove meat to a platter and let rest for at least 5 minutes before slicing thinly across the grain to serve. Drizzle servings with reduced coffee-cola marinade."
    ],
    "ingredients": [
        "2 large cloves garlic, minced",
        "1 (12 fluid ounce) can or bottle cola-flavored carbonated beverage",
        "1/2 cup freshly brewed strong coffee",
        "1/4 cup rice vinegar",
        "2 tablespoons ketchup",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 teaspoon salt",
        "1 teaspoon crushed dried rosemary",
        "1/4 teaspoon Louisiana-style hot sauce, or to taste",
        "1 (1 1/4 pound) beef skirt steak - trimmed of large fat chunks",
        "salt to taste",
        "1 pinch cayenne pepper, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Coffee and Cola Skirt Steak",
    "url": "http://allrecipes.com/recipe/233573/grilled-coffee-and-cola-skirt-steak/"
}
