{
    "directions": [
        "To make the pizza dough, in a 2-cup (16-fl.-oz./500-ml) measuring pitcher, whisk together the water and yeast. Let stand for 5 minutes.",
        "In a food processor, combine the 2 3/4 cups all-purpose flour, the bread flour and salt and process to mix. Whisk the 2 Tbs. olive oil into the yeast mixture. With the processor running, add the yeast mixture and process until the dough comes together and forms a ball, about 1 minute. (If the dough does not form a ball, add water, 1 Tbs. at a time, until it comes together.)",
        "Turn the dough out onto a lightly floured work surface and knead briefly until smooth. Brush a large bowl with olive oil. Shape the dough into a ball, place in the bowl and turn the dough to coat with oil. Cover the bowl with a kitchen towel and let stand until doubled in volume, about 1 1/2 hours.",
        "Punch down the dough and divide in half. Use immediately, or shape each half into a ball, place in separate resealable plastic bags, and refrigerate for up to 2 days or freeze for up to 1 month. You will need half of the dough for this pizza.",
        "If the dough has been refrigerated, let stand for 1 hour; if frozen, thaw at room temperature for 4 hours before using.",
        "In a bowl, combine the tomatoes, 1 Tbs. of the olive oil and half of the garlic. Sprinkle with salt and stir to blend. In a small bowl, stir together the remaining garlic with the remaining 1 Tbs. olive oil.",
        "Prepare a medium fire in a grill.",
        "Meanwhile, on a lightly floured work surface, roll out the dough into a rectangle about 11 by 13 inches (28 by 33 cm). Brush the top of the dough with olive oil.",
        "Place the dough, oiled side down, on the grill and immediately brush the top of the crust with the garlic oil. Grill until well browned underneath, about 5 minutes. Using a wide spatula, carefully turn the crust over, and immediately sprinkle with the mozzarella and Gorgonzola cheeses. Distribute the tomato mixture evenly over the cheeses, and sprinkle with the green onions, basil and marjoram. Grill until the pizza is just browned underneath and the cheeses melt, about 7 minutes.",
        "Using the spatula or a rimless baking sheet, transfer the pizza to a cutting board. Cut the pizza into squares and serve. Makes 1 large pizza.",
        "Adapted from Williams-Sonoma",
        "Kitchen Garden Cookbook,",
        "by Jeanne Kelley (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "1 cup (8 fl. oz./250 ml) lukewarm water",
        "1 1/2 tsp. active dry yeast",
        "2 3/4 cups (14 oz./440 g) unbleached all-purpose flour, plus\n  more for dusting",
        "3 Tbs. bread flour",
        "1 1/2 tsp. kosher salt",
        "2 Tbs. extra-virgin olive oil, plus more for brushing",
        "",
        "1 1/2 cups (9 oz./280 g) cherry tomatoes, stemmed and halved",
        "2 Tbs. extra-virgin olive oil, plus more for brushing",
        "2 garlic cloves, pressed",
        "Kosher salt, to taste",
        "Unbleached all-purpose flour for dusting",
        "1 1/4 cups (5 oz./155 g) whole-milk mozzarella cheese,\n  shredded",
        "1/4 lb. (125 g) Gorgonzola cheese, crumbled",
        "2 green onions, thinly sliced",
        "2 Tbs. chopped fresh basil",
        "1 Tbs. chopped fresh marjoram or oregano"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Pizza with Cherry Tomatoes and Gorgonzola",
    "url": "http://www.williams-sonoma.com/recipe/grilled-pizza-tomato-gorgonzola.html"
}
