{
    "directions": [
        "Toss scallops with 1 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a bowl, then thread 4 scallops onto each skewer.",
        "Prepare grill for direct-heat cooking over high heat.",
        "Oil grill rack, then grill scallops, covered only if using a gas grill, turning over once, until just cooked through, about 5 minutes. Transfer to a plate and cool slightly.",
        "While scallops cool, cut peel, including white pith, from orange with a sharp paring knife, then cut segments free from membranes. Coarsely chop enough segments to measure 1/4 cup and transfer to a large bowl (reserve remaining orange for another use). Stir in lime juice, cucumber, shallot, jalapeño (to taste), and remaining 2 tablespoons oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "When scallops are cool enough to handle, halve each crosswise (quarter if large), then add to cucumber mixture, tossing to combine. Marinate, covered and chilled, until cold, at least 1 hour. Just before serving, stir in cilantro."
    ],
    "ingredients": [
        "1 1/2 pounds large sea scallops (about 20), tough ligament removed from side of each if attached",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 navel orange",
        "2 tablespoons fresh lime juice",
        "3/4 seedless cucumber (usually plastic-wrapped), halved lengthwise, cored, and thinly sliced (2 cups)",
        "2 tablespoons thinly sliced shallot",
        "1 to 2 teaspoons finely chopped fresh jalapeño chile, including seeds",
        "1/4 cup chopped fresh cilantro",
        "Special equipment: 5 metal or wooden skewers (if using wooden, soak in water 30 minutes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Fruit",
        "Herb",
        "Onion",
        "Shellfish",
        "Vegetable",
        "Marinate",
        "Backyard BBQ",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Scallop \"Ceviche\"",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-scallop-ceviche-238685"
}
