{
    "directions": [
        "Prepare barbecue (medium-high heat). Place first 3 ingredients on baking sheet. Brush with 3 tablespoons oil; sprinkle with salt and pepper. Brush both sides of bread with 2 tablespoons oil. Grill vegetables until skins are charred, turning frequently, about 8 minutes for tomatoes, 10 minutes for onion, and 15 minutes for pepper. Return to baking sheet. Grill bread until toasted, about 1 1/2 minutes per side. Cut 1 garlic clove in half; rub over toasted sides of bread. Cut bread into small cubes; reserve croutons.",
        "Remove charred skins and cores from tomatoes. Peel, seed, and core pepper; coarsely chop. Remove charred papery peel and core from onion. Set aside half of chopped cucumber for garnish. Working in 2 batches, add half each of tomatoes, pepper, onion, and remaining cucumber to processor and blend until coarse puree forms. Transfer mixture to large bowl. Repeat with remaining tomatoes, pepper, and onion. Using garlic press, squeeze in remaining 2 garlic cloves. Stir in remaining 3 tablespoons olive oil, 3 tablespoons vinegar, marjoram, smoked paprika, cumin, and cayenne. Thin soup, if desired, with cold water by 1/4 cupfuls. Season with salt and pepper. Chill at least 2 hours. DO AHEAD Gazpacho and croutons can be made 8 hours ahead. Cover gazpacho and chopped cucumber garnish separately and refrigerate. Cover and store croutons at room temperature.",
        "Season gazpacho to taste with more salt and more vinegar, if desired. Ladle into bowls. Garnish with cucumber, croutons, and green onions; serve."
    ],
    "ingredients": [
        "3 1/4 to 3 1/2 pounds firm but ripe medium tomatoes",
        "1 (8- to 9-ounce) red bell pepper",
        "1 (8- to 10-ounce) red onion, unpeeled, quartered lengthwise",
        "8 tablespoons extra-virgin olive oil, divided",
        "3 (5 x 3 x 1/2-inch) slices country-style bread",
        "3 garlic cloves, divided",
        "1 (10- to 11-ounce) cucumber, peeled, halved, seeded, cut into small cubes, divided",
        "3 tablespoons (or more) Sherry wine vinegar",
        "2 teaspoons chopped fresh marjoram",
        "3/4 teaspoon smoked paprika*",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon cayenne pepper",
        "3/4 cup (about) cold water (optional)",
        "3 green onions, cut into thin strips",
        "*Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from tienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Onion",
        "Pepper",
        "Tomato",
        "Freeze/Chill",
        "Backyard BBQ",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Tomato-Bell Pepper Gazpacho",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tomato-bell-pepper-gazpacho-239064"
}
