{
    "directions": [
        "Prepare a grill for direct-heat cooking over medium high heat. Place the zucchini and squash in a bowl with the rosemary, 1 Tbs. of the oil and the vinegar. Season with salt and pepper and toss to coat. Set aside.",
        "Punch the dough down and divide it into 4 equal portions. On a lightly floured work surface, roll each piece of dough until about 1⁄8 inch (3 mm) thick. Brush both sides of the dough with the remaining oil and season with salt and pepper.",
        "Oil the grill well. Place the dough rounds on the oiled, cool part of the grill and close the cover. Cook until the top of the dough bubbles and the bottom is grill-marked, about 90 seconds. With a long-handled spatula, flatten the bubbles and then flip the dough and cook the other side for about 90 seconds. Transfer to a platter.",
        "Grill the zucchini and squash slices until they are softened and grill marked, 2 to 3 minutes per side.",
        "Spread the hummus on the pizzas, dividing evenly, and top with the grilled vegetables. Sprinkle with parsley and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Healthy Dish of the Day",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "2 small zucchini, sliced on the diagonal 1⁄4 inch (6 mm) thick",
        "2 small yellow squash, sliced on the diagonal 1⁄4 inch (6 mm) thick",
        "1 Tbs. finely chopped fresh rosemary",
        "2 Tbs. olive oil, plus more for grilling",
        "1 tsp. red wine vinegar",
        "Salt and freshly ground pepper, to taste",
        "1 lb. (500 g) purchased whole-wheat pizza dough",
        "All-purpose flour, for dusting",
        "1 cup (10 oz./315 g) prepared hummus",
        "Chopped fresh flat-leaf parsley for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Pizza with Hummus and Rosemary Summer Squash",
    "url": "http://www.williams-sonoma.com/recipe/grilled-pizza-with-hummus.html"
}
