{
    "directions": [
        "Let the skewers soak in water to cover for 1 hour. Toast the chili on a baking sheet in the middle of a preheated 250°F. oven for 5 minutes and transfer to a heatproof bowl. Pour enough boiling water over the chili to cover, let the mixture stand for 30 minutes, and drain the chili. In a blender blend together the chili, the 1 cup water, the garlic, the onion, the cumin, the thyme, the orégano, the salt, the peppercorns, the oil, and the lemon juice until the marinade is smooth.",
        "In a large heavy-duty resealable plastic bag combine the pork and the marinade and let the pork marinate, chilled, for at least 6 hours overnight.",
        "Drain the pork, pat it dry lightly, and thread each skewer loosely with 3 pieces of the pork, 3 chunks of the pineapple, and 3 chunks of the red onion. Grill or broil the kebabs on an oiled rack set about 4 to 5 inches from the heat for 8 to 10 minutes on each side, or until the pork is cooked through but still slightly pink. Serve the kebabs with the manchamantel sauce.",
        "Toast the chilies on a baking sheet in the middle of a preheated 250°F. oven for 5 minutes and transfer them to a heatproof bowl. Pour enough boiling water over the chilies to cover, let the mixture stand for 30 minutes, and drain the chilies. In a heavy skillet cook the garlic, the onion, and salt and pepper to taste in 2 tablespoons of the oil over moderately low heat, stirring, until the onion is soft and pale golden, add 1 tablespoon of the sugar and 1 1/2 tablespoons of the vinegar, and cook the mixture, stirring, for 1 minute. Transfer the onion mixture to a blender, add the chilies, the broth, the 1/2 cup water, the pineapple, the banana, the cinnamon, the cloves, the additional sugar and vinegar if desired, and salt and pepper to taste, and blend the sauce until it is very smooth. In the skillet heat the remaining 1 1/2 tablespoons oil over moderately high heat until it is hot but not smoking, add the sauce, and simmer it, stirring, for 5 minutes. Makes about 3 cups."
    ],
    "ingredients": [
        "eight 12-inch bamboo skewers",
        "1 dried ancho chili*, stemmed and seeded (wear rubber gloves)",
        "1 cup water",
        "4 garlic cloves, chopped",
        "1 onion, chopped",
        "1 1/2 tablespoons ground cumin",
        "2 tablespoons chopped fresh thyme leaves or 2 teaspoons dried thyme, crumbled",
        "2 tablespoon chopped fresh orégano leaves or 2 teaspoons dried orégano, crumbled",
        "2 teaspoons salt or to taste",
        "2 teaspoons black peppercorns, crushed",
        "1/3 cup olive oil",
        "1/3 cup fresh lemon juice",
        "3 pork tenderloins (about 2 1/4 pounds), each trimmed and cut crosswise into 8 pieces",
        "twenty-four 1-inch chunks of fresh pineapple",
        "twenty-four 1-inch chunks of red onion",
        "(Ancho Chili Fruit Sauce)",
        "2 ounces dried ancho chilies* (about 5), stemmed and seeded (wear rubber gloves)",
        "1 tablespoon minced garlic",
        "1 cup finely chopped onion",
        "3 1/2 tablespoons vegetable oil",
        "1 tablespoon sugar plus additional to taste",
        "1 1/2 tablespoons cider vinegar plus additional to taste",
        "1 cup low-salt chicken broth",
        "1/2 cup water",
        "1 cup chopped fresh pineapple",
        "3/4 cup sliced banana (about 1 small banana)",
        "1/2 teaspoon cinnamon",
        "a pinch of ground cloves",
        "*available at Hispanic markets, some specialty foods shops, and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Pork",
        "Broil",
        "Marinate",
        "Banana",
        "Pineapple",
        "Gourmet"
    ],
    "title": "Grilled Pork Kebabs with Manchamantel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-kebabs-with-manchamantel-sauce-11555"
}
