{
    "directions": [
        "Prepare a grill for medium-high, direct heat, preferably with hardwood or hardwood charcoal. Grill corn over direct heat, turning to cook evenly, until kernels are tender, about 20 minutes. Let corn steam in its husk 10 minutes, then shuck and cut kernels from cob. Transfer kernels to a large bowl.",
        "While corn is grilling, brush cut sides of zucchini with 1 Tbsp. olive oil, then sprinkle with salt and pepper. Toss scallions with remaining 1 Tbsp. olive oil and a pinch of salt and pepper. Grill zucchini and scallions over direct heat, turning occasionally, until tender and lightly charred, 8–10 minutes. Let cool slightly. Coarsely chop zucchini and scallions, then toss with corn. Season with salt and pepper.",
        "Combine avocado, scallion, tomatoes, cilantro, lime juice, salt, and cayenne in a medium bowl.",
        "Arrange tortillas on a work surface. Dividing evenly, layer cheese, then beans, then grilled vegetables on one side of each tortilla. Fold tortillas in half to create half-moons.",
        "Heat 1 Tbsp. vegetable oil in a large heavy skillet over medium-low until hot, then cook 2 tortillas, turning once, until cheese is melted and tortillas are brown, 1–2 minutes per side. Transfer quesadillas to serving plates, then cook remaining tortillas with remaining oil. Sprinkle quesadillas with cilantro leaves and serve with salsa and lime wedges alongside.",
        "Vegetables can be grilled, covered, and chilled for up to 3 days."
    ],
    "ingredients": [
        "2 ears of corn, unshucked",
        "1 medium zucchini, halved lengthwise",
        "2 tablespoons olive oil, divided",
        "Kosher salt and freshly ground black pepper",
        "1 bunch scallions (reserve 1 scallion for salsa)",
        "1 avocado, diced",
        "1 scallion, thinly sliced",
        "1/2 pint (1 cup) cherry tomatoes, coarsely chopped",
        "2 tablespoons coarsely chopped fresh cilantro",
        "2 tablespoons fresh lime juice",
        "1/2 teaspoon kosher salt",
        "Pinch of cayenne pepper",
        "4 (8-inch) flour tortillas",
        "1 1/2 cups shredded Monterey Jack cheese",
        "1 (15-ounce) can black beans, drained, rinsed",
        "2 tablespoons vegetable oil, divided",
        "Cilantro leaves with tender stems (for serving)",
        "Lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Tomato",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Avocado",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Low Cholesterol",
        "Cilantro",
        "Tortillas",
        "Monterey Jack"
    ],
    "title": "Grilled Corn, Zucchini, and Black Bean Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-corn-zucchini-and-black-bean-quesadillas-56389624"
}
