{
    "directions": [
        "Break cinnamon stick in half, then finely grind cinnamon, cumin, coriander, peppercorns, and cloves together in grinder. Transfer spice mixture to a large bowl and whisk in paprika, cayenne, ginger, salt, cilantro, garlic, and oil. Add quail, turning to coat, then transfer to a large sealable plastic bag and marinate, chilled, 2 hours.",
        "Thirty minutes before cooking, prepare grill for cooking over indirect heat with medium-hot charcoal (moderate heat for gas); see \"Grilling Procedure,\" below.",
        "Arrange 2 quail on a work surface side by side, breast sides up, with drumsticks closest to you. Horizontally thread 1 skewer through drumsticks and the lower carcasses of birds. Thread a second skewer, parallel to first, through wings and upper carcasses, then arrange quail so that there is 1 inch of space between the birds. Repeat procedure on remaining quail, 2 at a time.",
        "Lightly season quail with salt, then grill on lightly oiled grill rack, covered only if using a gas grill, turning over once, 5 to 6 minutes total. Serve quail with lemon wedges."
    ],
    "ingredients": [
        "1 (3-inch) cinnamon stick",
        "1 tablespoon cumin seeds",
        "1 tablespoon coriander seeds",
        "1/4 teaspoon whole black peppercorns",
        "3 whole cloves",
        "2 tablespoons paprika (not hot)",
        "1/2 teaspoon cayenne",
        "2 teaspoons ground ginger",
        "1 teaspoon salt",
        "2 cups coarsely chopped fresh cilantro",
        "1 tablespoon finely chopped garlic",
        "1/4 cup extra-virgin olive oil",
        "8 semi-boneless quail",
        "Special equipment: 8 (12-inch) wooden skewers, soaked in warm water 1 hour; an electric coffee/spice grinder",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Marinate",
        "Quail",
        "Summer",
        "Grill/Barbecue",
        "Clove",
        "Cilantro",
        "Seed",
        "Gourmet"
    ],
    "title": "Grilled Charmoula Quail",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-charmoula-quail-234599"
}
