{
    "directions": [
        "Blend basil with oil and 1/2 teaspoon salt in blender until finely chopped. Pour into a paper-towel- or coffee-filter-lined sieve set over a bowl and let drain 20 minutes. Gather together sides of towel or filter and press gently on it to extract more oil. (You will have a generous 1/3 cup oil.) Reserve 1 tablespoon basil oil separately for serving. Scrape basil solids into a small bowl and reserve.",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas); see \"Grilling Procedure,\" below.",
        "While grill heats, cut off bottoms of eggplants, then cut 6 (1/2-inch-thick) crosswise rounds from each, starting from cut end. Reserve remaining eggplant for another use. Cut 4 (1/3-inch-thick) rounds from large tomato and 2 center slices (1/3 inch thick) from each medium tomato, reserving remaining tomato for another use.",
        "Lightly brush eggplant rounds on both sides with basil oil and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Grill on a lightly oiled grill rack, covered only if using a gas grill, turning over occasionally, lightly brushing eggplant with more basil oil occasionally if it looks dry, until eggplant is very tender, 6 to 10 minutes. (Leave gas grill on.)",
        "On baking pan, arrange 4 largest eggplant rounds side by side and spread each with a generous 1/2 teaspoon of reserved basil solids, then top each with 1 of 4 largest tomato rounds. Season tomatoes with salt and pepper and top each with about 1 tablespoon feta. Make another layer with medium-size eggplant rounds, basil solids, medium tomato rounds, salt, pepper, and feta, then top with remaining eggplant and feta.",
        "Set baking pan on grill and cook stacks, with grill cover closed, until heated through and cheese on top is softened, about 3 minutes. Transfer stacks to 4 plates and drizzle plates with reserved basil oil.",
        "If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows:",
        "Hot: When you can hold your hand there for 1 to 2 seconds",
        "Medium-hot: 3 to 4 seconds",
        "Low: 5 to 6 seconds",
        "If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe."
    ],
    "ingredients": [
        "1 cup loosely packed fresh basil leaves",
        "1/2 cup extra-virgin olive oil",
        "2 medium eggplants (1 3/4 to 2 lb total)",
        "1 large tomato (about 4 inches in diameter) and 2 medium tomatoes (about 2 1/2 inches in diameter)",
        "3 oz feta, crumbled (about 3/4 cup)",
        "Garnish: finely shredded fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetarian",
        "Quick & Easy",
        "Feta",
        "Basil",
        "Eggplant",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Eggplant Stacks with Tomato and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-eggplant-stacks-with-tomato-and-feta-232478"
}
