{
    "directions": [
        "Prepare a medium-hot fire in a grill. Place a perforated steel sauté pan and a perforated steel chef’s pan on the grill and preheat for 15 to 20 minutes.",
        "In a bowl, stir together the steak and 1 Tbs. of the oil, and season with salt and pepper. In another bowl, stir together the bell peppers, red onion, broccoli and 2 Tbs. of the oil, and season with salt and pepper. In another bowl, stir together the squash, zucchini and the remaining 2 Tbs. oil, and season with salt and pepper.",
        "Add half the beef to the chef’s pan, cover the grill and cook, stirring occasionally, for about 5 minutes. Transfer to a large bowl. Repeat to cook the remaining beef.",
        "Meanwhile, add the bell pepper mixture to the sauté pan, place the lid on the pan, cover the grill and cook, stirring occasionally, until almost crisp-tender, about 5 minutes, adding the water halfway through the cooking time. Add the squash mixture to the sauté pan and continue cooking, stirring occasionally, until all the vegetables are crisp-tender, 5 to 6 minutes more.",
        "Transfer all the vegetables and the beef to the chef’s pan, add the 3/4 cup hibachi barbecue sauce and stir to coat evenly. Cook until warmed through, 1 to 2 minutes, adding the green onions during the last 30 seconds.",
        "Transfer the beef and vegetables to a warmed platter. Serve immediately with steamed rice and pass additional barbecue sauce at the table for drizzling. Serves 6."
    ],
    "ingredients": [
        "1 1/2 lb. flank steak, cut into strips 2 inches wide and 1/8 inch thick",
        "5 Tbs. vegetable oil",
        "Kosher salt and freshly ground pepper, to taste",
        "1 red bell pepper, cut into 1/4-inch strips",
        "1 yellow bell pepper, cut into 1/4-inch strips",
        "1 red onion, halved and cut into 1/4-inch slices",
        "8 oz. broccoli, cut into small florets",
        "1/2 lb. yellow squash, cut into 1/4-inch slices",
        "1/2 lb. zucchini, cut into 1/4-inch slices",
        "1/4 cup water",
        "3/4 cup hibachi barbecue sauce, plus more for drizzling",
        "4 green onions, white and light green portions, thinly sliced on the bias",
        "Steamed white rice for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grill-Sautéed Beef and Vegetables",
    "url": "http://www.williams-sonoma.com/recipe/grill-sauteed-beef-vegetables.html"
}
