{
    "directions": [
        "Prepare barbecue (medium-high heat). Drain oil from feta into glass measuring cup. Whisk in oregano. Transfer 1/2 cup oil mixture to small bowl; whisk in 2 tablespoons vinegar. Season dressing with salt and pepper (reserve remaining oil mixture for brushing).",
        "Brush chicken and onion wedges with reserved oil mixture; sprinkle with salt and pepper. Grill chicken until cooked through, 7 to 8 minutes per side, and onion until tender, 3 to 4 minutes per side. Transfer to cutting board; let rest 5 minutes.",
        "Meanwhile, arrange spinach on large platter. Combine all tomatoes, olives, and feta in large bowl. Toss with enough dressing to coat generously. Season with salt and pepper. Arrange on platter with spinach.",
        "Thinly slice chicken; arrange chicken and onion wedges on platter. Drizzle chicken and spinach with more dressing and serve."
    ],
    "ingredients": [
        "1 10.5-ounce jar marinated feta cheese cubes in oil with herbs and spices",
        "2 tablespoons chopped fresh oregano",
        "2 tablespoons red wine vinegar",
        "4 skinless boneless chicken breast halves",
        "1 large red onion, peeled, cut through root end into 1/2-inch wedges",
        "1 5-ounce package baby spinach leaves",
        "1 pound tomatoes (preferably heirloom) in assorted colors, cut into wedges",
        "1 9-ounce container teardrop tomatoes",
        "1/2 cup halved pitted Kalamata olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Feta",
        "Spinach",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Chicken Salad with Tomatoes, Spinach, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-salad-with-tomatoes-spinach-and-feta-353771"
}
