{
    "directions": [
        "Preheat the grill to medium heat.",
        "Wrap the sweet potatoes in Reynolds Wrap(R) Aluminum Foil individually so they are completely covered. Place them onto the grill, cover and cook for 45 minutes to 1 hour. You want the potatoes to feel very soft inside the foil. When they are done, remove them from the grill and keep them in the foil until ready to assemble and serve.",
        "Make the beans while the potatoes are baking. Heat oil in a medium-sized pan over medium heat. Add the onions and cook for 7 to 10 minutes until soft and starting to brown. Add the garlic and cook for another 2 minutes. Then add the beans and BBQ sauce. Stir to combine the ingredients, bring the heat to low and continue cooking for another couple of minutes to heat all of the ingredients.",
        "Make the cilantro cream. Place the yogurt, shallots, salt and lemon juice into a food processor and pulse several times until smooth. Add in the cilantro leaves and pulse a couple of times just until they are chopped and incorporated.",
        "Assemble the potatoes. Cut a slit down the center lengthwise of the potato and gently pull the sides apart just enough to create a well for the beans. Then add a couple spoonfuls of the BBQ beans and finish with a drizzle of the cilantro cream. Garnish with some roughly chopped cilantro leaves."
    ],
    "ingredients": [
        "2 large sweet potatoes",
        "2 tablespoons sunflower seed oil",
        "1 red onion, diced",
        "2 cloves garlic, minced",
        "1 (15 ounce) can black beans, drained",
        "1 cup barbeque sauce",
        "6 ounces plain yogurt",
        "2 tablespoons minced shallots",
        "1/4 teaspoon salt",
        "1 tablespoon lemon juice",
        "1/2 cup cilantro leaves, plus more for garnish",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Sweet Potatoes with BBQ Baked Beans and Cilantro Cream",
    "url": "http://allrecipes.com/recipe/247456/grilled-sweet-potatoes-with-bbq-baked/"
}
