{
    "directions": [
        "Preheat a grill or grill pan to medium-high heat. In a small saucepan set over medium heat, melt the butter and garlic together. Brush the corn with the butter mixture and reserve the remaining butter for a later use. Grill the corn until slightly charred and cooked through, about 3 minutes per side. Remove from the heat, then cut the kernels from the cobs and place in a large bowl. Stir in the arugula, cilantro, oil, parsley, tarragon, avocados, black-eyed peas, jalapenos, lime juice and onions.",
        "Thread the shrimp onto the skewers, 4 per skewer, and brush with the reserved garlic butter. Sprinkle the shrimp with the paprika and some salt and pepper and then grill until pink and cooked through, about 3 minutes per side.",
        "Season the salad with salt and pepper, then transfer to a serving plate and place the shrimp skewers on top of the salad to serve."
    ],
    "ingredients": [
        "1/2 cup (1 stick) salted butter",
        "4 cloves garlic, finely chopped",
        "4 ears corn, husked and cleaned",
        "2 cups arugula, chopped",
        "1/2 cup lightly chopped fresh cilantro",
        "1/2 cup olive oil",
        "1/2 cup lightly chopped fresh parsley",
        "2 tablespoons chopped fresh tarragon",
        "1 avocado, pitted and diced",
        "One 14-ounce can black-eyed peas, drained and rinsed",
        "1 jalapeno, diced",
        "1 lime, juiced",
        "1/2 red onion, diced",
        "1 pound large shrimp, peeled and deveined, tails left on (about 16 shrimp)",
        "1 teaspoon paprika",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Shrimp Salad",
        "Salad Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Fruit",
        "Lime Recipes",
        "Corn Recipes",
        "Vegetable"
    ],
    "title": "Grilled Shrimp and Corn Salad with Herb Lime Dressing",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/grilled-shrimp-and-corn-salad-with-herb-lime-dressing"
}
