{
    "directions": [
        "Prepare barbecue (medium-high heat). Sprinkle skirt steak on both sides with salt and 1 1/4 teaspoons chile powder. Whisk 1 1/2 tablespoons olive oil and 1 tablespoon lime juice in 11x7-inch glass dish. Add meat and turn to coat; place in single layer. Marinate 15 minutes.",
        "Meanwhile, brush green onions and corn with 1 tablespoon oil and sprinkle with salt and pepper. Grill vegetables until slightly charred, turning occasionally, about 2 minutes for green onions and 7 minutes for corn. Working over bowl, cut corn from cob directly into bowl. Coarsely chop green onions and add to corn. Stir in cilantro, lime peel, and remaining 1/4 teaspoon chile powder, 1/2 tablespoon oil, and 1 tablespoon lime juice. Season relish to taste with salt and pepper.",
        "Grill skirt steak to desired doneness, about 2 1/2 minutes per side for medium. Transfer to work surface; let rest 5 minutes.",
        "Place tortillas at edge of grill to warm and soften, about 1 minute.",
        "Arrange 2 warm tortillas on each of 4 plates. Thinly slice skirt steak across grain. Divide skirt steak and juices equally among tortillas. Spoon relish over each and serve."
    ],
    "ingredients": [
        "1 pound skirt steak, cut into 4 pieces",
        "1 1/2 teaspoons chipotle chile powder, divided",
        "3 tablespoons olive oil, divided",
        "2 tablespoons fresh lime juice, divided",
        "6 green onions",
        "2 ears of corn, husked",
        "1/4 cup chopped fresh cilantro",
        "1 teaspoon finely grated lime peel",
        "8 5- to 6-inch corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Marinate",
        "Backyard BBQ",
        "Lime",
        "Steak",
        "Corn",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Cilantro",
        "Tortillas"
    ],
    "title": "Grilled Skirt Steak Tacos with Corn Relish",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-skirt-steak-tacos-with-corn-relish-230637"
}
