{
    "directions": [
        "Pound the chicken breast halves with a meat mallet until 1/2 inch thick. Season with salt and pepper and place into a resealable plastic bag or small baking dish. Whisk together 1 serrano chile, garlic, chili powder, and 2 tablespoons raspberry vinegar in a small bowl. Whisk in the olive oil until incorporated, then pour the marinade over the chicken breasts, squeeze out excess air, and seal. Place into the refrigerator, and marinate for 2 to 3 hours.",
        "While the chicken marinates, toss the strawberries with the mint and sugar in a bowl. Cover, and refrigerate 1 hour, then fold in the remaining serrano chile, red onion, and 2 tablespoons raspberry vinegar. Season to taste with salt and pepper. Let the salsa stand at room temperature for 20 minutes before serving.",
        "Preheat an outdoor grill for medium-high heat, and lightly oil grate.",
        "Remove the chicken breasts from the marinade, and shake off excess. Discard the remaining marinade. Cook the chicken on the grill until no longer pink in the center and the juices run clear, 3 to 5 minutes per side. Serve with the strawberry salsa and a dollop of sour cream."
    ],
    "ingredients": [
        "4 (6 ounce) skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "1 serrano chile, seeded and minced",
        "1 clove garlic, minced",
        "1 teaspoon chili powder",
        "2 tablespoons raspberry vinegar",
        "1/4 cup olive oil",
        "2 cups sliced fresh strawberries",
        "2 tablespoons chopped fresh mint",
        "2 tablespoons white sugar",
        "1 serrano chile, seeded and minced",
        "1/3 cup minced red onion",
        "2 tablespoons raspberry vinegar",
        "salt and pepper to taste",
        "1/4 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Chicken Breasts with Fresh Strawberry Salsa",
    "url": "http://allrecipes.com/recipe/166477/grilled-chicken-breasts-with-fresh-st/"
}
