{
    "directions": [
        "Prepare grill for medium–high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Coarsely grind red pepper flakes in spice mill or with mortar and pestle. Combine ground red pepper flakes, porcini powder, sugar, kosher salt, and black pepper in a small bowl.",
        "Rub veal all over with oil, followed by enough spice mixture to coat nicely (about 1/2 cup), patting to adhere.",
        "Grill veal over direct heat, turning occasionally, until deeply browned all over, 15–20 minutes total. Move veal to indirect heat, placing bone side down, and grill, turning every 20 minutes or so, until an instant-read thermometer inserted into the thickest part of loin registers 115°, 1 1/2–2 hours. (Check after 30 minutes—once thermometer registers 100°, the temperature will climb much faster.)",
        "Transfer veal to a cutting board and let rest 5 minutes. Cut loin from the bones in one piece. Slice between bones to separate and grill over direct heat, turning often, until crisped and well charred, about 5 minutes.",
        "Grill loin over direct heat, cut side up, just to reheat slightly (do not grill the cut side), about 4 minutes. Slice loin 1/2\" thick and transfer to a platter. Sprinkle with sea salt and serve with bones alongside.",
        "Veal can be grilled 2 hours ahead. Do not cut meat from bones; hold at room temperature. Grill over high to reheat, about 4 minutes, before finishing as directed above."
    ],
    "ingredients": [
        "1 1/2 teaspoons crushed red pepper flakes",
        "1/4 cup porcini mushroom powder (from about 3/4 ounce dried mushrooms)",
        "2 tablespoons sugar",
        "1 tablespoon kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "1 (5–6-pounds) six-bone rack of veal, chine bone removed (not frenched)",
        "1/4 cup extra-virgin olive oil",
        "Flaky sea salt",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Veal"
    ],
    "title": "Grilled Porcini-Rubbed Rack of Veal",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-porcini-rubbed-rack-of-veal-56389664"
}
