{
    "directions": [
        "Toast caraway, coriander, and cumin seeds in medium skillet over medium heat until slightly darker in color, stirring occasionally, about 5 minutes. Cool completely. Grind cooled spices and dried crushed red pepper in mortar with pestle or spice grinder to fine powder. Add oil and garlic; grind to smooth paste. Stir in paprika and salt. (Can be made 3 days ahead. Cover and refrigerate.)",
        "Whisk 3 tablespoons plus 1 teaspoon harissa, 2 tablespoons oil, 2 tablespoons lime juice, and lime peel in small bowl. Rub mixture over all sides of chicken pieces. Place chicken in 11x7x2-inch glass baking dish. Cover and marinate overnight.",
        "Whisk remaining 1/2 cup oil, 3 tablespoons lime juice, and pinch of sugar in medium bowl to blend. Season dressing to taste with salt and pepper. (Dressing can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat barbecue (medium-low heat). Grill chicken until cooked through, turning and repositioning occasionally for even cooking, about 45 minutes total. Let stand at room temperature.",
        "Bring chicken broth and curry powder to boil in heavy small saucepan. Stir in couscous, cover, and remove from heat; let stand 5 minutes. Fluff couscous with fork and transfer to platter. Place chicken atop couscous. Serve, passing dressing and remaining harissa alongside."
    ],
    "ingredients": [
        "1 tablespoon caraway seeds",
        "1 tablespoon coriander seeds",
        "1 tablespoon cumin seeds",
        "1 tablespoon dried crushed red pepper",
        "2 tablespoons olive oil",
        "2 garlic cloves",
        "3 tablespoons Hungarian sweet paprika",
        "1 1/2 teaspoons salt",
        "2 tablespoons plus 1/2 cup olive oil",
        "5 tablespoons fresh lime juice, divided",
        "1 teaspoon finely grated lime peel",
        "1 2 3/4- to 3-pound chicken, quartered, backbone removed",
        "Pinch of sugar",
        "1 3/4 cups low-salt chicken broth",
        "1 1/2 teaspoons curry powder",
        "1 10-ounce package plain couscous"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Dinner",
        "Curry",
        "Grill/Barbecue",
        "Couscous",
        "Seed",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Moroccan Chicken with Curried Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-moroccan-chicken-with-curried-couscous-232699"
}
