{
    "directions": [
        "For the meatloaf: Preheat the oven to 425 degrees F and line a 9-by-13-inch baking dish with foil.",
        "In a small bowl, add the milk and bread and set aside. To the bowl of a food processor, add the rosemary, celery, carrots and onions. Pulse until the vegetables are medium chopped, about 15 seconds.",
        "In a large bowl, combine the ground bison, pork and veal. Add in the bread mixture, chopped vegetables, Parmesan, Worcestershire, beaten eggs and some pepper and mix with your hands to combine. Continue to mix the meat for about 2 minutes or until the seasoning and vegetables are evenly distributed. Place the meatloaf mixture into the lined baking sheet and gently shape into a flat football.",
        "For the glaze: In a medium bowl, whisk together the ketchup, brown sugar, Dijon mustard and apple cider vinegar.",
        "Spread the glaze evenly over the surface of the meatloaf. Bake for 40 minutes. Let cool for 10 minutes before cutting.",
        "For the sandwiches: Preheat a grill to medium high.",
        "Spray the meatloaf pieces with canola spray and place on the grill for 3 minutes per side. Spray the insides of the onion rolls with canola spray and grill for 1 minute per side. Transfer the grilled meatloaf and rolls to a plate and assemble the sandwiches. Begin with a roll, top with cheese, some mayonnaise, a piece of lettuce and onion and a slice of tomato. Add a piece of meatloaf and serve immediately."
    ],
    "ingredients": [
        "1 cup whole milk",
        "3 potato rolls, torn",
        "1 tablespoon chopped fresh rosemary",
        "4 celery stalks, chopped",
        "2 carrots, chopped",
        "1 white onion, chopped",
        "1 pound ground bison",
        "1 pound lean (90/10) ground pork",
        "1 pound ground veal",
        "1 cup grated Parmesan cheese",
        "1/4 cup Worcestershire",
        "3 eggs, lightly beaten",
        "Freshly ground black pepper",
        "1 cup ketchup",
        "1/2 cup dark brown sugar",
        "2 tablespoons Dijon mustard",
        "1 tablespoon apple cider vinegar",
        "Canola oil spray, for spraying meat and rolls",
        "12 to 15 onion slider rolls",
        "12 to 15 slices Cheddar cheese",
        "1/2 cup mayonnaise",
        "12 to 15 pieces green leaf lettuce",
        "12 to 15 thinly sliced pieces red onion",
        "12 to 15 slices tomato"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatloaf",
        "Sandwich",
        "Meat",
        "Veal",
        "Pork",
        "Main Dish Recipes"
    ],
    "title": "Grilled Meatloaf Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/grilled-meatloaf-sandwiches"
}
