{
    "directions": [
        "Make the marinade by finely mincing the capers, oregano and garlic together. Add to a small bowl along with the yogurt, olive oil, lemon zest and some salt and pepper, stirring until well combined. Place the lamb in a large resealable bag and pour in the yogurt marinade. Mix it around so the lamb is completely coated all over. Squeeze out any air, reseal the bag and place in the refrigerator for at least 30 minutes, or up to overnight.",
        "Preheat the grill to medium-high heat.",
        "When the lamb is marinated, remove it from the bag and wipe off any excess with paper towels. Unfold the lamb, drizzle with a little olive oil and sprinkle well with salt and pepper on both sides; this will help form a nice crust. Grill for about 15 minutes, then flip once and cook for another 12 minutes on the second side until cooked through and you have some color on the lamb. When done, remove from the grill, tent with foil and let rest for 10 to 12 minutes before carving across the grain into thin slices.",
        "Take the baguette and split horizontally lengthwise so you have long halves. Place on the grill to warm the bread through and get slightly crisp, about 2 minutes per side.",
        "To assemble the sandwiches, smear the bread with Harissa Mayo, stack with slices of lamb and Quick Pickled Sweet Cucumbers. Place the top of the baguette on and slice the sandwich into quarters.",
        "Mix the mayonnaise, sour cream, harissa, vinegar and cumin together in a large bowl and stir with a whisk to combine. Taste for seasoning and add salt and pepper as desired. Refrigerate and serve smeared on lamb sandwiches.",
        "Add the cucumber slices and chile slices to a medium bowl and toss to combine.",
        "In a medium saucepan, add the vinegar, sugar, 1/2 water and salt. Heat gently, stirring, just until the sugar and salt dissolve. Pour over the cucumbers and chiles in the bowl. Set aside to marinate at least 15 minutes before serving."
    ],
    "ingredients": [
        "1/2 tablespoon capers",
        "1 teaspoon fresh oregano leaves",
        "4 cloves garlic",
        "2 cups plain unsweetened yogurt",
        "2 tablespoons extra-virgin olive oil, plus more for grilling",
        "1/2 teaspoon lemon zest",
        "Salt and freshly cracked black pepper",
        "One 3 to 4-pound leg of lamb, butterflied",
        "1 sourdough baguette (use 2 if serving 8)",
        "Harissa Mayo, for serving, recipe follows",
        "Quick Pickled Sweet Cucumbers, for serving, recipe follows",
        "1/2 cup mayonnaise",
        "1/4 cup sour cream",
        "2 tablespoons store-bought harissa paste",
        "1/2 teaspoon red wine vinegar",
        "1/4 teaspoon ground cumin",
        "Salt and freshly cracked black pepper",
        "1 hothouse cucumber, finely sliced",
        "1 teaspoon kosher salt",
        "1/2 Fresno chile, halved lengthwise, seeded if desired and finely sliced",
        "3/4 cup sugar",
        "1 cup white vinegar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Lamb Recipes",
        "Meat",
        "Cucumber",
        "Vegetable",
        "Grilling"
    ],
    "title": "Grilled Lamb Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/grilled-lamb-sandwiches-recipe"
}
