{
    "directions": [
        "Combine first 8 ingredients and 1 teaspoon coarse salt in processor. Blend to almost smooth puree (some texture should remain). Season with pepper and more salt, if desired. Transfer to medium bowl. Cover; chill at least 3 hours and up to 1 day.",
        "Cut each bread slice into rectangle (about 4 1/2 x 2 1/2 inches). Arrange 4 bread rectangles on work surface. Top bread with half of cheese slices (trimming to fit) and 2 tomato slices. Sprinkle tomatoes with salt and pepper. Top with remaining cheese, then remaining bread; press to compact.",
        "Melt butter in large skillet over medium heat. Add sandwiches. Cover and cook until bread is golden, turning once, about 3 minutes per side. Transfer sandwiches to paper towels. Cut each sandwich in half.",
        "Divide gazpacho among 4 bowls; place on plates. Arrange sandwiches alongside."
    ],
    "ingredients": [
        "1 pound ripe green heirloom tomatoes, cored, cut into large chunks",
        "1 6-inch piece unpeeled English hothouse cucumber, diced",
        "1/2 cup chopped onion",
        "1/2 cup chopped celery",
        "1/2 cup salted roasted Marcona almonds",
        "2 tablespoons extra-virgin olive oil",
        "2 large garlic cloves, peeled",
        "1 tablespoon Champagne vinegar or other white wine vinegar",
        "1 teaspoon (or more) coarse kosher salt",
        "8 1/3-inch-thick slices brioche or challah, trimmed to 5x3 inches",
        "1 8-ounce package smoked mozzarella cheese, cut into 1-inch-wide by 1/8-inch-thick slices",
        "2 large heirloom tomatoes (preferably Brandywine), cut into 1/4-inch slices",
        "1/4 cup (1/2 stick) butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Sandwich",
        "Tomato",
        "Vegetarian",
        "High Fiber",
        "Backyard BBQ",
        "Lunch",
        "Mozzarella",
        "Almond",
        "Grill",
        "Grill/Barbecue",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Heirloom Tomato and Mozzarella Sandwiches with Green Heirloom Tomato Gazpacho",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-heirloom-tomato-and-mozzarella-sandwiches-with-green-heirloom-tomato-gazpacho-360751"
}
