{
    "directions": [
        "Whisk together lemon juice, oregano, garlic, 1/2 tablespoon salt, and 1/2 teaspoon pepper in a large bowl and add oil in a slow stream, whisking.",
        "Discard excess fat from chicken and season with remaining 1 1/2 tablespoons salt and 1 1/2 teaspoons pepper.",
        "Open vents on bottom of grill and on lid. Light a large chimney starter of charcoal briquettes (80 to 100) and pour them evenly over 1 side of bottom rack (you will have a double or triple layer of briquettes).",
        "When charcoal turns grayish white (15 to 20 minutes) and you can hold your hand 5 inches above rack for 3 to 4 seconds, sear chicken legs in 3 batches on lightly oiled grill rack over coals, uncovered, turning once, until well browned, 6 to 8 minutes total, then transfer as cooked to a tray.",
        "Put all browned legs on side of grill with no coals underneath and cook, covered with lid, turning occasionally, until just cooked through (flesh will no longer be pink when cut near joint), 15 to 25 minutes more. Transfer legs to bowl with lemon dressing and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil, while cooking breasts.",
        "Add 15 briquettes evenly to coals and wait until they just light, about 5 minutes. (They will not be grayish white yet but will give off enough heat with other briquettes to maintain correct cooking temperature.)",
        "Sear chicken breasts, starting with skin sides down, in 2 batches on rack over coals, uncovered, turning once, until well browned, 6 to 8 minutes total, then transfer as cooked to tray.",
        "Put all browned chicken breasts on side of grill with no coals underneath and cook, covered with lid, turning occasionally, until just cooked through (the meat next to the tender, when opened slightly, will be moist but no longer pink), 12 to 15 minutes more. Transfer breasts to bowl with lemon dressing and turn to coat, then transfer to platter with legs.",
        "Grill lemon slices on rack over coals, uncovered, until grill marks appear, about 3 minutes on each side, and transfer to platter with chicken.",
        "Preheat all burners on high, then adjust heat to moderately high. Turn off 1 burner and arrange chicken legs on lightly oiled rack above it. Cook, covered with lid, turning legs once, until cooked through, about 40 minutes total. Transfer legs to bowl with lemon dressing and turn to coat, then transfer to a serving platter and keep warm, loosely covered with foil, while cooking breasts.",
        "Cook chicken breasts on rack above unlit burner, covered with lid, turning once, until just cooked through (the meat next to the tender, when opened slightly, will be moist but no longer pink), about 30 minutes total. Transfer breasts to bowl with lemon dressing and turn to coat, then transfer to platter with legs.",
        "Grill lemon slices on rack over flames, uncovered, until grill marks appear, about 3 minutes on each side, and transfer to platter with chicken."
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "1/4 cup finely chopped fresh oregano",
        "2 tablespoons minced garlic",
        "2 tablespoons kosher salt",
        "2 teaspoons black pepper",
        "1/3 cup olive oil",
        "12 whole chicken legs (7 lb)",
        "8 chicken breast halves with skin and bones (8 lb)",
        "5 lemons, cut crosswise into 1/3-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Garlic",
        "Poultry",
        "Low/No Sugar",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Chicken with Lemon, Garlic, and Oregano",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-with-lemon-garlic-and-oregano-106742"
}
