{
    "directions": [
        "Prepare grill.",
        "Pat steaks dry and brush on both sides with oil. Rub steaks with chipotle rub and in a shallow baking dish large enough to fit steaks in one layer marinate them at room temperature up to 30 minutes.",
        "Grill steaks on an oiled rack set 5 to 6 inches over glowing coals until crusty and medium-rare, about 4 minutes on each side. (Alternatively, steaks may be cooked in a hot well-seasoned ridged grill pan.) Transfer steaks to a warm platter and let stand 5 minutes.",
        "Divide beans among 4 small deep platters and top with steaks. Dollop salsa butter on steaks and top with onion rings.",
        "In a small heavy skillet dry-roast oregano over moderate heat, shaking skillet occasionally, until fragrant and beginning to brown, about 2 minutes, and transfer to a small bowl. Cool oregano completely and in an electric coffee/spice grinder grind fine.",
        "In a heavy skillet heat oil over moderately high heat until hot but not smoking and, using tongs, fry chiles, 1 or 2 at a time, turning them, until puffed and just beginning to brown, about 10 seconds. (Do not let chiles burn or rub will be bitter.) Transfer chiles as fried to paper towels to drain and cool until crisp.",
        "Wearing rubber gloves, break chiles into pieces and in coffee/spice grinder grind fine in batches. In a food processor grind oregano and chiles with garlic and salt until mixture is a shaggy, saltlike consistency. If mixture seems moist, on a large baking sheet spread it into a thin, even layer and dry in middle of an oven set a lowest temperature until no longer moist, about 1 hour. Wearing rubber gloves, break up any lumps with your fingers. (Chipotle rub keeps in an airtight container, chilled, 6 months. Regrind rub before using. Makes about 3 1/4 cups.)"
    ],
    "ingredients": [
        "Four 3/4-inch-thick rib-eye-steaks (about 8 to 10 ounces each)",
        "2 tablespoons olive oil",
        "2 tablespoons plus 2 teaspoons chipotle rub",
        "1/4 cup dried Mexican oregano*",
        "1/4 cup corn oil",
        "5 dried chipotle chiles*, stemmed, seeded, and deveined (wear rubber gloves)",
        "5 ancho chiles*, seeded and deveined (wear rubber gloves)",
        "25 garlic cloves",
        "1 1/2 cups coarse salt",
        "3 cups Drunken Beans",
        "1/4 cup Green Chile Mushroom Salsa Butter",
        "Chipotle Fried Onion Rings",
        "available at Mexican markets and some specialty produce markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Cinco de Mayo",
        "Backyard BBQ",
        "Steak",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Grilled Rib-Eye Steaks with Green Chile Mushroom Salsa Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-rib-eye-steaks-with-green-chile-mushroom-salsa-butter-12673"
}
