{
    "directions": [
        "Preheat an outdoor grill for medium-high heat and lightly oil grate.",
        "Brush eggplant, potatoes, and zucchini lightly with extra-virgin olive oil. Grill vegetables until just tender and golden brown. Layer potatoes into the bottom of a 9x13 inch glass baking dish. Next layer in the eggplant, followed by the zucchini; set aside.",
        "Preheat oven to 375  degrees F (190 degrees C).",
        "Melt butter in a large saucepan over medium heat. Whisk in the flour, and cook until the flour smells slightly toasted, about 5 minutes. Whisk in milk, nutmeg, and salt. Bring to a bare simmer over medium-high heat, then reduce heat to medium-low and simmer 10 minutes. Place the egg yolk into a bowl, and quickly whisk in 1/4 cup of the thickened milk, a tablespoon at a time. Quickly stir the egg yolk mixture into the thickened milk until smooth, then set aside.",
        "Meanwhile, heat 1 tablespoon of olive oil in a large skillet over medium-high heat. Stir in the ground beef and onion, and cook until the beef is crumbly and no longer pink. Drain off any excess grease, then stir in the oregano, parsley, tomatoes, salt, and pepper. Turn heat to medium-low, cover, and simmer for 10 minutes, stirring occasionally.",
        "To assemble, spread the meat mixture over the vegetables, and sprinkle with the feta cheese. Pour the white sauce overtop, and smooth with a spatula.",
        "Bake moussaka in preheated oven until bubbly and golden brown, about 30 minutes."
    ],
    "ingredients": [
        "3 large eggplant, sliced into 1/4 inch rounds",
        "3 large potatoes, thinly sliced",
        "3 large zucchini, cut lengthwise into 1/4 inch slices",
        "1/2 cup extra-virgin olive oil",
        "5 tablespoons butter",
        "7 tablespoons all-purpose flour",
        "5 cups milk",
        "1 pinch ground nutmeg",
        "salt to taste",
        "1 egg yolk, beaten",
        "1 tablespoon olive oil",
        "1 1/2 pounds ground beef",
        "1 onion, chopped",
        "1 teaspoon oregano",
        "salt and pepper to taste",
        "1/2 cup chopped fresh parsley",
        "5 ripe tomatoes, chopped",
        "1 cup crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Eggplant Moussaka",
    "url": "http://allrecipes.com/recipe/147380/grilled-eggplant-moussaka/"
}
