{
    "directions": [
        "Light a fire in a charcoal or gas grill. Place the corn—without anything on it—on the grill grate. Grill the ears of corn, rotating the corn as needed to keep it from getting charred too much on one side, for about 7 minutes. (Don't overcook the corn, or it will become mushy!) Remove from heat and let cool slightly. Remove the kernels from the cobs and set aside.",
        "Meanwhile, squirt just a bit of canola oil on the tomato and onion slices. Sprinkle pepper on top. Place the onion slices on the grill. Add the tomatoes cut-side down on the hot grate and grill until both are nicely browned, 3 to 5 minutes. Turn the onion slices and tomatoes with tongs and continue grilling until the bottoms of the tomatoes (the rounded parts) are nicely browned and the onion becomes softer and fragrant, about 3 more minutes.",
        "Dice the onion and tomatoes and place in a bowl. Add the corn kernels and the jalapeño. Pour in the olive oil and vinegar and stir to combine. Season with salt. This can be done up to one day ahead of time; just bring the salsita to room temperature prior to serving.",
        "Place the oysters directly on the grates of the grill, close the cover, and cook until all of the oysters have opened, 4 to 5 minutes. Discard any oysters that have not opened on their own. Further open the ones that have started to open and top each one with 1 teaspoon of the corn and jalapeño salsita. Serve hot."
    ],
    "ingredients": [
        "4 ears of corn, shucked",
        "Canola oil for grilling",
        "2 plum tomatoes, sliced in half, lengthwise",
        "1 red onion, sliced",
        "Freshly ground black pepper",
        "1 jalapeño pepper, roasted, deveined, seeded, and diced",
        "2 tablespoons olive oil",
        "2 tablespoons white balsamic vinegar",
        "Kosher salt",
        "12 oysters, scrubbed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Fourth of July",
        "Backyard BBQ",
        "Dinner",
        "Seafood",
        "Oyster",
        "Corn",
        "Grill",
        "Grill/Barbecue",
        "Jalapeño",
        "Party",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled East Coast Oysters with Corn Jalapeño Salsita",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-east-coast-oysters-with-corn-jalapeno-salsita-358970"
}
