{
    "directions": [
        "Grind first 6 ingredients in processor until almost smooth. Add juice and blend well. Season spice mixture with salt and pepper. Sprinkle fish with salt and pepper. Rub 2 teaspoons spice mixture over each fillet; place on waxed-paper-lined tray. Refrigerate 2 hours.",
        "Whisk juice, oil, vinegar, mint and ginger in small bowl to blend. Season dressing to taste with salt and pepper. (Dressing can be made 2 hours ahead. Let stand at room temperature.)",
        "Spray barbecue rack with nonstick spray; prepare barbecue (medium-high heat). Spray fish with nonstick spray. Grill until just opaque in center, about 3 minutes per side. Transfer fish to plate.",
        "Toss greens in large bowl with enough dressing to coat; divide among 6 plates. Arrange grapefruit segments and mangoes atop greens; drizzle with some dressing. Place 1 fish fillet alongside each salad. Top fish with avocado. Serve, passing any remaining dressing separately."
    ],
    "ingredients": [
        "2 tablespoons paprika",
        "2 tablespoons minced garlic",
        "1 tablespoon olive oil",
        "1 tablespoon chili powder",
        "2 teaspoons dried oregano",
        "1 1/2 teaspoons ground allspice",
        "1/4 cup grapefruit juice",
        "6 4- to 5-ounce sea bass fillets",
        "5 tablespoons grapefruit juice",
        "1/4 cup olive oil",
        "2 tablespoons Sherry wine vinegar",
        "1 1/2 tablespoons chopped fresh mint",
        "1 tablespoon chopped fresh ginger",
        "Nonstick vegetable oil spray",
        "1 5-ounce package mixed baby greens (about 10 cups)",
        "3 pink grapefruits, peel and pith cut away, segments cut from between membranes",
        "2 large mangoes, peeled, pitted, thinly sliced",
        "1 avocado, peeled, pitted, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Low Cal",
        "Low/No Sugar",
        "Wheat/Gluten-Free",
        "Grapefruit",
        "Mango",
        "Avocado",
        "Summer"
    ],
    "title": "Grilled Sea Bass, Mango, Grapefruit and Avocado Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sea-bass-mango-grapefruit-and-avocado-salad-5658"
}
