{
    "directions": [
        "Whisk together zest, lemon juice, and salt and pepper to taste, then add olive oil in a stream, whisking until combined well. Whisk in olives and chopped oregano.",
        "Make 1-inch-long slits at 2-inch intervals down middle of fish on both sides with a sharp paring knife, then brush fish all over with vegetable oil and season with salt and pepper. Season fish cavity with salt and pepper, then evenly distribute 3 lemon rounds and 3 oregano sprigs in cavity. Close cavity, then evenly arrange remaining 3 lemon rounds and 3 oregano sprigs on top of fish and tie fish closed with string at 2-inch intervals, securing lemon slices and oregano sprigs to fish.",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.",
        "Grill fish on lightly oiled grill rack, covered only if using gas grill, 15 minutes. Turn fish over using a metal spatula and tongs, then grill until just cooked through, about 15 minutes more.",
        "Transfer fish to a large platter using 2 metal spatulas, then cut and discard string. Serve fish with sauce."
    ],
    "ingredients": [
        "1/2 teaspoon finely grated fresh lemon zest",
        "1 1/2 tablespoons fresh lemon juice",
        "1/3 cup extra-virgin olive oil",
        "1/4 cup pitted Kalamata olives (1 1/4 oz), cut into slivers",
        "3 tablespoons finely chopped fresh oregano plus 6 large sprigs",
        "1 (3 1/4- to 3 1/2-lb) cleaned whole Spanish mackerel or bluefish (with head and tail)",
        "2 tablespoons vegetable oil",
        "6 (1/4-inch-thick) lemon slices",
        "Special equipment: a 22-inch grill; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Lemon",
        "Summer",
        "Grill/Barbecue",
        "Oregano",
        "Gourmet"
    ],
    "title": "Grilled Whole Mackerel with Lemon, Oregano, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-whole-mackerel-with-lemon-oregano-and-olives-109523"
}
