{
    "directions": [
        "Mix 1/4 cup oil, garlic, and lemon zest in a medium bowl; season with salt and pepper. Let marinate for 20 minutes. Add all herbs to oil mixture; stir until well coated. Let stand until herbs begin to wilt, about 10 minutes. Stir in remaining 1/4 cup oil. Season herb salsa verde to taste with salt and pepper.",
        "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Season skirt steak generously with salt and pepper and grill until charred, 2 minutes per side for medium-rare. Transfer steak to a serving platter; let rest for 5 minutes, allowing juices to accumulate on platter.",
        "Transfer skirt steak to a cutting board and slice against the grain on a diagonal. Season to taste with salt; return to platter with juices. Spoon half of herb salsa verde over. Serve with lemon wedges. Pass remaining herb salsa verde alongside."
    ],
    "ingredients": [
        "1/2 cup olive oil, divided",
        "4 garlic cloves, finely chopped",
        "1 tablespoon finely grated lemon zest",
        "Kosher salt and freshly ground black pepper",
        "2 cups coarsely chopped fresh herbs, such as tarragon, savory, and mint",
        "1 cup coarsely chopped flat-leaf parsley leaves",
        "1 skirt steak (about 1 1/2 pounds), trimmed, cut into two or three 10\" pieces",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Mint",
        "Meat",
        "Steak",
        "Grill",
        "Grill/Barbecue",
        "Tarragon",
        "Parsley",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Skirt Steak with Herb Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-skirt-steak-with-herb-salsa-verde-395477"
}
