{
    "directions": [
        "On a cutting board, using a pair of kitchen scissors, or sharp paring knife, cut the shrimp lengthwise through the shell, along the top side about 1 inch below the head and press to flatten. Pull out and discard the intestinal vein that runs lengthwise.",
        "In a small microwave safe bowl, combine the softened butter with the sriracha, lemongrass, garlic, ginger, turmeric, fish sauce and lime juice and season with the salt. Microwave on high power just until soft enough to brush but not melted, about 5 seconds.",
        "Light a grill and oil the grates. Arrange the butterflied shrimp in a hinged grill basket, shell-side down, brush with oil and season with salt. Brush very lightly with some of the butter. Grill the shrimp, shell side down until lightly charred, about 2 minutes. Brush the shrimp with more of the butter, turn and grill until lightly charred and cooked through, about 2 minutes longer. Transfer the shrimp to plates and serve with the remaining butter, naan, lime wedges and cilantro. Serve right away."
    ],
    "ingredients": [
        "16 prawns or jumbo shrimp (size U-15) in the shells, preferably with heads on",
        "8 tablespoons unsalted butter (1 stick), softened",
        "1 tablespoon sriracha",
        "2 tablespoons minced lemongrass (inner bulb only, from 2 stalks)",
        "1 tablespoon minced garlic",
        "1 teaspoon minced ginger",
        "1 teaspoon minced Serrano chile",
        "1 teaspoon ground turmeric",
        "1 teaspoon fish sauce",
        "1 tablespoon lime juice, plus wedges for garnish",
        "Pinch of salt",
        "Canola oil for brushing",
        "Grilled naan, lime wedges and cilantro for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Shellfish",
        "Shrimp",
        "Grill",
        "Grill/Barbecue",
        "Lemongrass"
    ],
    "title": "Grilled Butterflied Prawns with Sriracha-Lemongrass Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-butterflied-prawns-with-sriracha-lemongrass-butter-51239010"
}
