{
    "directions": [
        "To prepare the romesco, place the tomato, bell pepper and yellow onion on a baking sheet, drizzle with 1 Tbs. of the olive oil and toss to coat. Roast for 40 minutes, adding the garlic during the last 5 minutes of roasting. Transfer to a shallow bowl, cover loosely with aluminum foil and let stand for 20 minutes. Remove the skins from the tomato and bell pepper.",
        "Meanwhile, in a small sauté pan over medium-low heat, toast the almonds until golden brown, 3 to 5 minutes. Transfer to a plate. In the same pan over medium-high heat, warm the remaining 2 Tbs. olive oil. Add the bread and fry until golden brown, about 3 minutes. Transfer to a plate. Let the bread cool, then tear into pieces.",
        "In a food processor, combine the almonds, bread, vinegar, paprika, cayenne, the 1 1/4 tsp. salt, the 1/4 tsp. black pepper and the roasted vegetables and blend until smooth, about 1 minute. Taste and adjust the seasonings with salt and black pepper. The romesco can be made in advance; cover and refrigerate for up to 5 days.",
        "Preheat an indoor electric grill to high heat.",
        "In a large bowl, combine the green onions, olive oil, salt and black pepper and toss to coat. Arrange the onions on the grill and cook, turning occasionally, until the onions are soft and dark grill marks appear, 7 to 10 minutes total.",
        "Transfer the onions to a platter and serve immediately with the romesco. Serves 8."
    ],
    "ingredients": [
        "1 large plum tomato, halved crosswise and  seeded",
        "1 large red bell pepper, seeded, deveined and  quartered",
        "1 small yellow onion, quartered",
        "3 Tbs. olive oil",
        "2 garlic cloves",
        "1/4 cup slivered almonds",
        "1/2 slice white bread, crusts removed",
        "4 tsp. balsamic vinegar",
        "3/4 tsp. sweet paprika",
        "Pinch of cayenne pepper",
        "1 1/4 tsp. salt, plus more, to taste",
        "1/4 tsp. freshly ground black pepper, plus more,  to taste",
        "4 bunches green onions",
        "Olive oil as needed",
        "Kosher salt and freshly ground black pepper, to  taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grilled Green Onions with Romesco",
    "url": "http://www.williams-sonoma.com/recipe/grilled-green-onions-with-romesco.html"
}
