{
    "directions": [
        "Mince garlic and mash to a paste with kosher salt. Stir together spices in a bowl, then stir in garlic and oil until a paste forms. Pat steak dry, then rub all over with paste. Marinate steak in a sealed large plastic bag, chilled, at least 6 hours.",
        "Bring steak to room temperature, about 30 minutes.",
        "While steak comes to room temperature, prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is hot when you can hold your hand 5 inches above rack for 1 to 2 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "Grill steak on lightly oiled grill rack, uncovered, turning over once, 4 to 6 minutes total for medium-rare.",
        "Cut steak diagonally across grain into 1/4-inch-thick slices. Divide sweet-potato salad among 6 plates, then top with steak and arugula."
    ],
    "ingredients": [
        "3 garlic cloves",
        "1 1/2 teaspoons kosher salt",
        "1 1/2 teaspoons paprika",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons ground coriander",
        "1 teaspoon black pepper",
        "1/2 teaspoon ground cinnamon",
        "Pinch of ground cloves",
        "1 tablespoon olive oil",
        "2 1/4 pounds skirt steak (2 steaks), each halved crosswise",
        "Special equipment: a charcoal grill and a bag of hardwood charcoal, or a gas grill",
        "Accompaniments: sweet-potato salad with mustard vinaigrette arugula with lemon and olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Fourth of July",
        "Backyard BBQ",
        "Steak",
        "Spice",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Spice-Rubbed Skirt Steak",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-spice-rubbed-skirt-steak-108168"
}
