{
    "directions": [
        "In a saucepan over medium heat, melt the butter with olive oil, and cook the onions and garlic until the onion is translucent, about 8 minutes. Stir in curry powder, coriander, cumin, salt, white pepper, thyme, lemon, apples, applesauce, dark raisins, and golden raisins until thoroughly combined. Bring the mixture to a boil, turn down the heat to a simmer, cover, and simmer the sauce until it has the consistency of applesauce and the raisins are plump and starting to break apart, about 1 hour. Mix in a tablespoon of water if sauce starts to become too thick.",
        "Preheat an outdoor grill for medium heat, and lightly oil the grate. Sprinkle the lamb chops with seasoned salt.",
        "Grill on the preheated grate until the chops are well-browned, cooked to your desired color of pink inside, and show grill marks, 3 to 5 minutes per side for medium-rare.  An instant-read thermometer inserted into the center of a chop, not touching bone, should read about 145 degrees C (65 degrees C). Serve the lamb chops with the sauce on the side."
    ],
    "ingredients": [
        "1/4 cup butter",
        "1 tablespoon olive oil",
        "3 cups chopped onion",
        "1 clove garlic, crushed",
        "2 tablespoons curry powder, or to taste",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "2 teaspoons salt, or to taste",
        "2 teaspoons white pepper",
        "1 teaspoon dried thyme",
        "1/2 lemon (including peel), seeded and finely chopped",
        "3 cups apples - peeled, cored, and chopped",
        "1 cup applesauce",
        "2/3 cup dark raisins",
        "2/3 cup golden raisins",
        "1 tablespoon water, if needed (optional)",
        "6 (4 ounce) lamb chops",
        "1 teaspoon seasoned salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Lamb Chops with Curry, Apple and Raisin Sauce",
    "url": "http://allrecipes.com/recipe/216866/grilled-lamb-chops-with-curry-apple/"
}
