{
    "directions": [
        "Prepare gill.",
        "In a small bowl drizzle 2 teaspoons oil over pepper rings, tossing to coat well. Secure each slice of onion horizontally with a wooden pick (to prevent separation into rings) and brush with remaining teaspoon oil.",
        "Grill peppers and onions on an oiled rack set 5 to 6 inches over glowing coals 3 minutes on each side, or until tender. (Alternatively, peppers and onions may be grilled in batches in a hot well-seasoned ridged grill pan over moderately high heat.)",
        "Transfer peppers and onions to a bowl, discarding wooden picks, and toss with Worcestershire sauce and vinegar.",
        "Prick sausages with a fork and grill, turning them, until golden and just cooked through (about 160° F. on a instant-read thermometer), 10 to 15 minutes.",
        "Halve sausages lengthwise and rolls horizontally and grill, cut sides down, 1 minute, or until sausages are cooked through but still juicy and rolls are toasted lightly.",
        "Divide peppers and onions between rolls and top with sausages."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 red bell pepper, cut into 1/4-inch rings",
        "1 yellow bell pepper, cut into 1/4-inch rings",
        "1 medium onion, cut into 1/4-inch slices",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon balsamic vinegar",
        "4 sweet or hot Italian sausages (about 12 ounces total)",
        "2 individual hero, hoagie, or grinder rolls (each about 7 inches long by 3 inches wide)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Onion",
        "Pepper",
        "Quick & Easy",
        "Backyard BBQ",
        "Sausage",
        "Summer",
        "Tailgating",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Sausages, Peppers, and Onions on Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-sausages-peppers-and-onions-on-rolls-12662"
}
