{
    "directions": [
        "Stir together brown sugar, cumin, chili powder, salt, pepper, and mustard in a bowl. Pat steak dry and rub all over with 2 tablespoons spice mixture. Reserve remainder for sauce. Marinate steak at room temperature while making sauce.",
        "Cook onion in oil in a 1- to 1 1/2-quart heavy saucepan over moderately high heat, stirring, until golden brown, 5 to 10 minutes. Stir in ketchup, Worcestershire sauce, and reserved spice mixture and bring to a boil over moderately high heat, stirring occasionally. Reduce heat and cover, then simmer until onions are very tender, about 5 minutes. Transfer to a blender and purée with water (use caution with hot liquids) until very smooth (add additional water, 1 tablespoon at a time, if necessary), then transfer to a bowl.",
        "Meanwhile, preheat gas grill burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "Oil grill rack, then grill steak, covered, 4 to 5 minutes per side for medium-rare. Brush steak all over with some of sauce and grill 30 seconds per side.",
        "Transfer to a cutting board and let stand 5 minutes. Cut steak into thin slices and serve with remaining sauce."
    ],
    "ingredients": [
        "3 tablespoons packed dark brown sugar",
        "2 teaspoons ground cumin",
        "2 teaspoons chili powder",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "1 teaspoon dry mustard",
        "1 (1 1/4 -pound) flatiron steak (1 inch thick; also called boneless chuck top blade steak)",
        "1 medium onion, finely chopped",
        "1 tablespoon vegetable oil",
        "1/2 cup ketchup",
        "2 tablespoons Worcestershire sauce",
        "5 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Beef",
        "Mustard",
        "Onion",
        "Marinate",
        "Quick & Easy",
        "Backyard BBQ",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled \"Barbecue\" Beef",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-barbecue-beef-238392"
}
