{
    "directions": [
        "Add the pineapple juice, achiote paste, chipotles, garlic and 1 1/2 teaspoons salt to a food processor and puree until uniform. Reserve about 1/2 cup of the marinade for glazing. Put the remaining marinade and the pork in a resealable plastic bag and marinate for 2 hours in the fridge, rotating if necessary halfway through.",
        "Heat a grill to high heat; clean and oil the grill grates.",
        "Thread the onion rounds on the skewers, drizzle with oil and season with salt and pepper. Grill the onions, developing a deep char on each side, about 10 minutes per side. Set aside to cool.",
        "Lightly season the tenderloins once more, then grill on all 4 sides, frequently basting with the reserved marinade, until golden brown and the internal temperature registers 145 degrees F, 8 to 10 minutes per side. Transfer to a plate, tent loosely with foil and rest for 5 minutes.",
        "Mince the cooled onions and season again. Slice the pork and serve with a dollop of Avocado Crema and garnished with chopped cilantro and charred onions.",
        "Put the cilantro, Mexican cream, avocado and lime zest and juice in a food processor and run until smooth. Season with salt and pepper. Cover with plastic wrap pressed on top until serving, to keep the avocado from browning."
    ],
    "ingredients": [
        "1 cup pineapple juice",
        "One 1-ounce package achiote paste",
        "4 chipotle chiles in adobo sauce",
        "2 cloves garlic",
        "Kosher salt",
        "2 pork tenderloins, about 1 1/2 pounds each, trimmed of silver skin",
        "Neutral oil, for oiling the grill grates and drizzling",
        "1 medium yellow onion, sliced into 1-inch rounds",
        "Freshly ground black pepper",
        "Avocado Crema, recipe follows",
        "Chopped fresh cilantro, for garnish",
        "1/2 cup fresh cilantro",
        "1/4 cup Mexican cream or sour cream",
        "1 avocado, chopped",
        "1 lime, zested and juiced",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit",
        "Pineapples",
        "Pork Tenderloin",
        "Meat",
        "Pork",
        "Avocado",
        "Vegetable",
        "Main Dish Recipes",
        "Grilling"
    ],
    "title": "Grilled Pork Tenderloin al Pastor with Avocado Crema",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/grilled-pork-tenderloin-al-pastor-with-avocado-crema"
}
