{
    "directions": [
        "Prepare a charcoal fire or preheat a gas or electric grill. Set the chopped tomatoes to drain in a fine-mesh colander or sieve.",
        "In a small sauté pan over medium-low heat, toast the almonds in a tablespoon of the oil, stirring frequently, until the almonds are golden brown— about 5 to 7 minutes—being careful not to burn them. Transfer the almonds to a mortar, food processor, or blender. In the oil remaining in the pan, gently sauté the garlic cloves, stirring frequently, until they are golden—about 15 minutes. Add the garlic to the almonds along with the parsley, black pepper, and hot pepper. Pound in the mortar or process or blend, gradually adding in the drained tomatoes to make a thick sauce. (If you're using a food processor or blender, be careful not to overprocess; the mixture should be a little granular from the almonds.)",
        "Transfer the sauce to a bowl and beat in the lemon juice and vinegar. Reserve 2 tablespoons of the remaining oil and beat the rest into the sauce. Set the sauce aside.",
        "Toss the shrimp with the reserved 2 tablespoons oil. Cook the shrimp on the hot grill, about a minute to a side, until the shells are papery and the flesh is thoroughly cooked. Pile the shrimp on a platter and serve the sauce in a separate bowl (less messy); or pour the sauce over the hot shrimp and serve (very messy but delicious)."
    ],
    "ingredients": [
        "2 tomatoes, peeled, seeded, and chopped",
        "1/2 cup blanched almonds",
        "6 tablespoons extra-virgin olive oil",
        "2 garlic cloves, peeled",
        "1 teaspoon minced flat-leaf parsley",
        "1/2 teaspoon freshly ground black pepper",
        "1 teaspoon hot red pepper flakes",
        "juice of 1/2 lemon",
        "2 tablespoons sherry vinegar",
        "2 pounds medium-large (25 count) shrimp"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Backyard BBQ",
        "Dinner",
        "Seafood",
        "Shrimp",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Shrimp with Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-shrimp-with-almonds-51160000"
}
