{
    "directions": [
        "In a bowl whisk together hoisin sauce, vinegar, soy sauce, garlic, minces scallion, honey, and salt.",
        "Trim as much remaining fat as possible from lamb and in a shallow dish large enough to hold lamb flat spread marinade over both sides of it. Marinate lamb, covered and chilled, at least 4 hours or overnight.",
        "Prepare grill.",
        "Bring lamb to room temperature and grill on an oiled rack set 5 to 6 inches over glowing coals 12 to 15 minutes on each side, or until meat thermometer registers 140°F. for medium-rate meat. (Alternatively, lamb may be broiled under preheated broiler about 4 inches from heat for approximately the same time on each side as for grilling.) Transfer lamb to a cutting board and let stand 20 minutes before carving.",
        "Holding a sharp knife at a 45° angle, cut lamb across grain into thin slices. (If planning to make lamb salad, reserve one-third unsliced lamb, covered and chilled.)",
        "Trim roots and green parts from scallions, leaving about 2 1/2-inch stalks. Make 1/2-inch lengthwise cuts at both ends of stalks and spread fringed ends gently. Put scallions in a bowl of ice and cold water and chill 2 hours, or until fringed ends have curled. Drain scallions well.",
        "Garnish lamb with scallion brushes and serve with eggplant."
    ],
    "ingredients": [
        "1/3 cup hoisin sauce",
        "3 tablespoons rice vinegar (not seasoned)",
        "2 tablespoons soy sauce",
        "2 tablespoons minced garlic",
        "1/4 cup minced scallions",
        "1 tablespoon honey",
        "1/2 teaspoon salt",
        "a 6 1/2- to 7 1/2-pound whole leg of lamb, trimmed, boned, and butterflied (4 1/2 to 5 1/2 pounds boneless)",
        "scallion brushes",
        "Accompaniment:Broiled Eggplant with Garlic Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Broil",
        "Marinate",
        "Backyard BBQ",
        "Summer",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Hoisin-Marinated Butterflied Leg of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-hoisin-marinated-butterflied-leg-of-lamb-14436"
}
