{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the lasagna noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles are cooked, but still firm to the bite, about 8 minutes; drain and rinse.",
        "Preheat oven to 375 degrees F (190 degrees C). Spread the marinara sauce in the bottom of a 9x13 glass baking dish; set aside.",
        "Heat oil in a skillet over medium heat; cook and stir mushrooms until they soften, about 5 minutes. Stir in spinach, and cook until hot; remove from heat.",
        "Stir together the chicken, ricotta cheese, Parmesan cheese, oregano, and the cooked spinach mixture in a large bowl. Season to taste with salt and black pepper. Spread about 1/4 cup of the mixture on each lasagna noodle. Roll the noodle up, and place seam-side down into the prepared baking dish. Repeat for each noodle. Spoon Alfredo sauce over the rollups.",
        "Bake, covered, in the preheated oven for 40 minutes. Uncover; sprinkle with mozzarella cheese and pine nuts. Return to the oven and bake until the cheese is melted and bubbly and the pine nuts are toasted, about 10 minutes. Serve hot."
    ],
    "ingredients": [
        "18 lasagna noodles, cooked and drained",
        "2 cups marinara sauce",
        "1 teaspoon vegetable oil",
        "2 portobello mushrooms, diced",
        "1 cup frozen chopped spinach",
        "2 cups diced cooked chicken",
        "1 (15 ounce) container ricotta cheese",
        "1/2 cup grated Parmesan cheese",
        "1 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "2 cups Alfredo sauce",
        "1 cup shredded mozzarella cheese",
        "1/4 cup pine nuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Chicken and Portobello Lasagna Rollups",
    "url": "http://allrecipes.com/recipe/102831/grilled-chicken-and-portobello-lasagn/"
}
