{
    "directions": [
        "If grilling, brush the crabs lightly with blended olive oil, and season with salt and pepper. If sauteing, season the crabs with salt and pepper, and dredge lightly in flour. Cook the crabs for about 3 minutes per side over medium heat. Set aside and keep warm. Place the toasted brioche in the center of a plate and cover it generously with Basil Mayonnaise. Layer the arugula leaves, tomato slices, and warm pancetta, in that order, on top of the brioche. Top with the warm crabs and squeeze more Basil Mayonnaise over the plate and the crabs. Garnish with rosemary, and serve with shoestring potatoes or chips.",
        "Place the egg yolks, water, and basil in the bowl of a food processor. Turn on the processor and slowly add the oil through the feeding tube. Add salt and pepper, to taste. If the mayonnaise is too thick, add a little water. Transfer Basil Mayonnaise to a squeeze bottle and refrigerate."
    ],
    "ingredients": [
        "2 jumbo soft shell crabs, cleaned",
        "Blended olive oil, if grilling",
        "Salt and freshly ground black pepper",
        "Flour, for dredging, if sauteing",
        "1 thick slice brioche, grilled or toasted",
        "1 cup Basil Mayonnaise, recipe follows",
        "6 to 8 arugula leaves, washed and dried",
        "2 to 3 slices beefsteak tomato",
        "3 thin slices pancetta, cooked and kept warm",
        "1 sprig rosemary, for garnish",
        "Shoestring potatoes or potato chips",
        "2 egg yolks",
        "2 teaspoons warm water",
        "1 cup fresh basil leaves",
        "1 1/2 cups blended oil",
        "Pinch salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Tomato",
        "Vegetable",
        "Crab Recipes",
        "Shellfish Recipes",
        "Meat",
        "Main Dish Recipes",
        "Summer",
        "Grilling",
        "Sauteing Recipes"
    ],
    "title": "Grilled or Sauteed Soft Shell Crab BLT",
    "url": "http://www.foodnetwork.com/recipes/grilled-or-sauteed-soft-shell-crab-blt-recipe"
}
