{
    "directions": [
        "Bring 6 1/2 quarts water to boil in large pot. Remove from heat. Using vegetable peeler, remove peel from 3 lemons (yellow part only). Add peel, tea bags, and 6 rosemary sprigs to water; steep 20 minutes. Remove tea bags. Add salt and sugar; stir to dissolve. Stir in lemon juice. Cool to lukewarm. Add ice to reduce temperature to below 45°F.",
        "Place 1 roasting bag inside the second, forming 2 layers. Place inside large pot. Place turkey in roasting bags, breast side down. Pour brine over turkey. Tie bags tightly, eliminating any air pockets. Refrigerate 36 to 48 hours. Or, place bags into large cooler, pour brine over turkey, and tie bags securely. Pour ice over and around turkey in bags. Place lid securely on cooler. Check twice a day to ensure that turkey is covered with ice (some ice will melt). Remove top rack from grill. Place disposable aluminum baking pan in center of barbecue (if using 2-burner gas grill, place pan on 1 side of grill; if using 3-burner grill, place pan over center burner).",
        "Prepare barbecue (medium-low heat). If using charcoal grill, arrange coals on each side of aluminum baking pan, dividing equally. (You will need to add about 6 briquettes to each side of aluminum pan every 30 minutes to maintain temperature while cooking turkey.) If using 3-burner gas grill, light burner(s) on left and right, leaving center burner(s) off. If using 2-burner gas grill, light burner on side opposite disposable pan. Insert instant-read thermometer into top vent of grill. Maintain temperature at around 350°F.",
        "Drain turkey; discard brine. Pat turkey dry. Pierce 2 lemons all over with fork. Stuff turkey with lemons, 5 sprigs rosemary, celery, and onion. Tie legs together. Brush turkey all over with oil.",
        "Place turkey directly on grill above aluminum pan. Close grill. Adjust temperature to maintain 350°F. Roast turkey until thermometer inserted into thickest part of thigh registers 175°F, about 3 hours. Transfer turkey to platter. Tent with foil. Allow to rest 30 minutes before carving (internal temperature will rise 5 to 10 degrees). Serve with gravy."
    ],
    "ingredients": [
        "5 lemons, divided",
        "18 Earl Grey tea bags",
        "11 4-inch-long rosemary sprigs, divided",
        "2 cups coarse kosher salt",
        "1 1/2 cups (packed) golden brown sugar",
        "1/2 cup fresh lemon juice",
        "12 cups ice cubes",
        "2 turkey-size oven-roasting bags",
        "1 22-pound turkey; neck, heart, and gizzard reserved for gravy",
        "1 12 3/4x9x2-inch disposable aluminum pan",
        "1 celery stalk, cut crosswise into 3-inch pieces",
        "1 medium onion, quartered",
        "1/4 cup olive oil",
        "Tea-and-Lemon Gravy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Poultry",
        "turkey",
        "Thanksgiving",
        "Fall",
        "Brine",
        "Grill/Barbecue"
    ],
    "title": "Grilled Tea-Brined Turkey with Tea-and-Lemon Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-tea-brined-turkey-with-tea-and-lemon-gravy-231086"
}
