{
    "directions": [
        "Heat a skillet over medium heat. Add pistachios; cooking, shaking often, until toasted, about 5 minutes.",
        "Make the pesto by combining the pistachios, avocado, basil leaves, Parmesan, garlic, salt and pepper in a blender. Pulse until the mixture is roughly chopped and then with the blender running, slowly stream in 1/4 cup olive oil. Continue blending until the pesto is a thick paste, scraping down the sides of the blender as needed. Set the pesto aside.",
        "Preheat the grill for 10 minutes on medium heat. Spread the butter on the corn, then wrap each ear of corn in Reynolds Wrap(R) Aluminum Foil. Place the corn on the grill, close the lid and grill the corn, turning it frequently until it is tender, 15 to 20 minutes. Unwrap the corn and when cool enough to handle, slice the kernels off the cob.",
        "Brush both sides of the flatbreads with 2 tablespoons olive oil and grill them for 1 to 2 minutes on each side to warm them. Remove the flatbreads from the grill and top with the avocado pesto, Gruyere, mozzarella, red onions and corn.",
        "Return the flatbreads to the grill, close the lid and grill until the cheese is melted, about 3 minutes.",
        "Remove the flatbreads from the grill and transfer them to serving plates. Top the flatbreads with arugula and crushed red pepper flakes (optional) and then slice and serve immediately."
    ],
    "ingredients": [
        "Avocado Pesto:",
        "2 tablespoons unsalted pistachios",
        "1 medium avocado, peeled and pitted",
        "2 cups lightly packed fresh basil leaves",
        "2 tablespoons grated Parmesan cheese",
        "3 medium cloves garlic, chopped",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1/4 cup olive oil",
        "Flatbread Pizzas:",
        "2 medium ears corn, shucked",
        "2 tablespoons unsalted butter, softened",
        "4 store-bought flatbreads (or naan)",
        "2 tablespoons olive oil",
        "2 cups shredded Gruyere cheese",
        "1 cup sliced fresh mozzarella cheese",
        "1/2 cup thinly sliced red onions",
        "1 cup arugula",
        "Crushed red pepper flakes, for serving (optional)",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Flatbread Pizzas with Avocado Pesto",
    "url": "http://allrecipes.com/recipe/247444/grilled-flatbread-pizzas-with-avocado/"
}
