{
    "directions": [
        "1. Heat 1 tablespoon of the oil in a small saucepan over medium heat. Add the shallot and cook until soft, about 2 minutes. Add the vinegar, juniper berries, caraway seeds, mustard seeds, thyme, sugar, 1 teaspoon salt, and 1/4 teaspoon pepper. Bring to a boil and cook until the sugar and salt are dissolved, 1 to 2 minutes. Remove from the heat. Let sit for 15 minutes then strain into a small bowl, discarding the solids. Slowly whisk in the remaining 1/2 cup oil until emulsified.",
        "2. Heat your grill to high for direct grilling.",
        "3. Brush the cut sides of the radicchio with oil and season with salt and pepper. Grill, cut side down, until golden brown and slightly charred, 2 to 3 minutes. Brush the tops with oil, flip over the radicchio, and continue grilling until just heated through, 2 to 3 minutes longer. Remove from the grill. Thinly slice the radicchio and put it in a bowl.",
        "4. Remove the kale from the water and shake gently to get some of the water off. Season with salt and pepper and place on the grill. Cook until slightly wilted and charred on all sides, about 30 seconds per side. Remove from the grill. Thinly slice and add to the radicchio.",
        "5. Add the dressing to the radicchio and kale and toss to coat. Let sit at room temperature for 30 minutes to allow the flavors to meld."
    ],
    "ingredients": [
        "1/2 cup plus 1 tablespoon canola oil, plus more for brushing",
        "1 large shallot, chopped",
        "1/2 cup apple cider vinegar",
        "8 juniper berries",
        "1/2 teaspoon caraway seeds",
        "1/2 teaspoon yellow mustard seeds",
        "3 fresh thyme sprigs",
        "1 to 2 tablespoons sugar, to taste",
        "Kosher salt and freshly ground black pepper",
        "3 heads radicchio, halved lengthwise",
        "2 big bunches kale, soaked in cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Side",
        "Fourth of July",
        "Vegetarian",
        "Father's Day",
        "Backyard BBQ",
        "Kale",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Vegan",
        "Caraway",
        "Radicchio",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Radicchio and Kale, Sauerkraut Style",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-radicchio-and-kale-sauerkraut-style-51167000"
}
