{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Make the salsa: Place the poblano peppers and the tomatoes over a medium gas flame, either on a grill or right on the burners. Rotate the vegetables every few minutes so that the skins don't completely blacken. Remove the vegetables once their skins are blistering and just partially charred. Let the vegetables cool a bit. Remove the skins of the vegetables with a paring knife. Cut the poblanos into 1/2 inch wide strips, and set them aside.",
        "Cut the tomatoes into 1/2 inch cubes, and put them into a bowl. Add onions, lime juice, cilantro, jalapeno, salt and pepper to the bowl. Mix well. Chill the salsa if you won't be making the frittata within the next few hours.",
        "Make the chips: Stack the tortillas and cut the stack into six wedges. Spread the pieces on a baking sheet, lightly salt them and bake them for 10 minutes or until they are crisp. Remove the chips from the oven but keep the oven on.",
        "Make the frittata: Heat the olive oil in a 10 to 12 inch non-stick oven-proof skillet over medium heat. Add the eggs, and stir them for the first minute of cooking with a plastic spatula. Let the eggs rest for a few seconds, then push the frittata to one side of the pan so the uncooked egg runs underneath.",
        "When the frittata is still moist but no longer runny, sprinkle it with salt, pepper and the shredded Jack cheese.",
        "Place the poblano strips in a star shape on top of the cheese. Bake the frittata in the oven for 3 to 4 minutes or until it is just set. Remove the skillet from the oven and stick the tortilla chips around the edge of the frittata. Take the skillet to the table and cut the frittata into wedges. Serve with the salsa."
    ],
    "ingredients": [
        "3 poblano peppers",
        "3 tomatoes",
        "1 small onion, minced",
        "2 teaspoons lime juice",
        "3 tablespoons chopped fresh cilantro",
        "1/2 jalapeno pepper, seeded and minced",
        "salt and pepper to taste",
        "3 (6 inch) corn tortillas",
        "1 tablespoon olive oil",
        "7 eggs, lightly beaten",
        "1 cup shredded Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Poblano Frittata",
    "url": "http://allrecipes.com/recipe/14060/grilled-poblano-frittata/"
}
