{
    "directions": [
        "Combine first 7 ingredients in large glass baking dish. Add chicken, turning to coat. Cover and chill 2 to 4 hours.",
        "Prepare barbecue (medium-high heat). Spread rice in center of large platter. Remove chicken from marinade and sprinkle with salt and pepper. Grill until just cooked through, about 5 minutes per side. Transfer chicken directly from grill to platter and arrange atop rice.",
        "Add vegetables to marinade and turn to coat. Transfer to barbecue. Sprinkle vegetables with salt and pepper and grill until just cooked through, about 6 minutes per side for onions and 4 minutes per side for zucchini, eggplants and peppers. Transfer vegetables directly from grill to platter and arrange atop rice with chicken. Pour marinade into small saucepan and bring to boil. Brush over chicken; drizzle lightly over grilled vegetables. Sprinkle with additional chopped herbs and serve."
    ],
    "ingredients": [
        "1 1/2 cups balsamic vinegar",
        "1/2 cup olive oil",
        "1/2 cup honey",
        "1/3 cup chopped fresh oregano or 1 1/2 tablespoons dried",
        "1/3 cup chopped fresh sage or 1 1/2 tablespoons dried",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground cumin",
        "8 large skinless boneless chicken breast halves",
        "2 cups (12 ounces) wild rice, cooked according to package directions",
        "2 large red onions, cut into 3/4-inch-thick rounds",
        "3 zucchini, trimmed, cut lengthwise into thirds",
        "3 Japanese eggplants, trimmed, cut lengthwise into thirds",
        "2 large red bell peppers, seeded, cut into 1-inch-wide strips",
        "Additional chopped fresh oregano",
        "Additional chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Marinate",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Sage"
    ],
    "title": "Grilled Chicken and Vegetables with Wild Rice",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-and-vegetables-with-wild-rice-620"
}
