{
    "directions": [
        "Prepare barbecue (medium-high heat). Place smoke chips in 8 x 6-inch foil packet with open top. Set atop coals 5 minutes before grilling lobsters. Bring large pot of salted water to boil. Working in batches, drop lobsters headfirst into water. Cover; boil 2 minutes. Transfer lobsters to work surface. Immediately split in half lengthwise, using heavy large knife. Crack claws.",
        "Arrange lobsters, cut side up, on grill. Cover; grill 6 minutes. Turn lobsters over and grill until just cooked through, about 5 minutes. Remove from heat. Remove lobster meat from shells. Cool. Cut meat into 1/2-inch pieces. Transfer to large bowl.",
        "Whisk oil and next 5 ingredients in medium bowl to blend. Season with salt and pepper. (Can be made 1 day ahead. Cover lobster and dressing separately; chill. Rewhisk dressing before continuing.)",
        "Add avocados, tomatoes and papaya to lobster in bowl. Pour 1/2 cup dressing over; toss. Season with salt and pepper.",
        "Toss greens in another large bowl with enough remaining dressing to coat.",
        "Divide greens among plates. Spoon lobster mixture atop greens and serve."
    ],
    "ingredients": [
        "2 cups mesquite smoke chips, soaked in water 30 minutes, drained",
        "4 1 3/4-pound live lobsters",
        "9 tablespoons olive oil",
        "1/2 cup orange juice",
        "3 tablespoons fresh lime juice",
        "1 tablespoon minced seeded jalapeño chili",
        "1 tablespoon finely grated lime peel",
        "1 1/2 teaspoons finely grated orange peel",
        "2 avocados, halved, pitted, peeled, cut into 1/2-inch pieces",
        "4 medium tomatoes, seeded, cut into 1/2-inch pieces",
        "1 large papaya, peeled, seeded, cut into 1/2-inch pieces",
        "10 cups mixed baby greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Tomato",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Papaya",
        "Lobster",
        "Avocado",
        "Summer",
        "Grill",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Lobster Salad with Avocado and Papaya",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lobster-salad-with-avocado-and-papaya-5476"
}
