{
    "directions": [
        "Using kitchen twine, tie the pork roast at 2-inch (5-cm) intervals. Rub with 1 Tbs. of the olive oil and then with the grilling salt. Let stand at room temperature for 1 hour.",
        "Prepare a grill for indirect grilling over medium-high heat. Place a mesh roaster over direct heat, close the lid and preheat for 10 minutes.",
        "Put the cipollini onions and shallots in a bowl, and put the spring onions in a separate bowl. Toss each with 1 Tbs. of the olive oil, and season with kosher salt and pepper.",
        "Move the roaster over indirect heat. Put the pork, fat side up, in the center of the roaster and arrange the cipollini onions and shallots along the sides. Cover the grill and cook for 40 minutes. Add the spring onions to the roaster, cover the grill, and cook until the pork is well browned and an instant-read thermometer inserted into the center of the meat registers 145°F (63°C), about 40 minutes more; adjust the burners as needed to maintain the internal grill temperature at about 400°F (200°C).",
        "Transfer the pork to a carving board, cover loosely with aluminum foil and let rest for 10 to 15 minutes. If the onions are not yet tender, set the roaster over direct heat, cover the grill and cook, stirring occasionally, until tender. Cut the pork into slices and serve with the onions. Serves 6 to 8.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "1 boneless pork loin roast, about 3 1/2 lb. (1.75 kg)",
        "3 Tbs. olive oil",
        "3 Tbs. pork grilling salt",
        "2 lb. (1 kg) cipollini onions and shallots, peeled, larger onions\n  halved",
        "2 bunches spring onions, trimmed",
        "Kosher salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Grill-Roasted Pork Loin with Onions",
    "url": "http://www.williams-sonoma.com/recipe/grill-roasted-pork-loin-with-onions.html"
}
