{
    "directions": [
        "Combine minced garlic, chopped rosemary, minced anchovies, fennel seeds, salt, and freshly cracked black pepper in small bowl or in mortar with pestle. Using sturdy wooden spoon or pestle, mash mixture into paste. Mix in extra-virgin olive oil. Rub paste thoroughly over both sides of lamb. Place lamb in 15x10x2-inch glass baking dish; cover with plastic wrap and refrigerate overnight. Let lamb stand at room temperature 1 hour before grilling.",
        "Stir fennel seeds in small dry skillet over medium heat until fragrant and slightly darker in color, about 2 minutes. Transfer to medium saucepan. Add tomatoes, olives, and vinegar. Stir in oil; season with salt and ground black pepper. Set aside.",
        "Prepare barbecue (medium-high heat). Place lamb on grill rack. Cover barbecue and open vents; grill lamb until instant-read thermometer inserted into meat registers 130°F for medium-rare, turning occasionally, about 25 minutes. Transfer lamb to cutting board; let rest 10 minutes. Place saucepan with vinaigrette on slightly cooler part of barbecue and heat just until warm, about 5 minutes. Stir in thinly sliced basil leaves.",
        "Cut lamb crosswise into 1/2-inch-thick slices. Transfer to platter. Spoon vinaigrette over and serve."
    ],
    "ingredients": [
        "9 garlic cloves, minced",
        "2 tablespoons chopped fresh rosemary",
        "2 anchovy fillets, minced",
        "2 teaspoons fennel seeds",
        "2 teaspoons coarse kosher salt",
        "1 1/2 teaspoons freshly cracked black pepper",
        "1/4 cup extra-virgin olive oil",
        "1 (4- to 5-pound) butterflied leg of lamb, trimmed of excess fat and sinew (from one 61/2-pound bone-in leg of lamb)",
        "1 1/2 teaspoons fennel seeds",
        "1 pound tomatoes, seeded, finely chopped (about 2 cups)",
        "1/2 cup Kalamata or Niçoise olives, pitted, finely chopped",
        "3 tablespoons red wine vinegar",
        "1/3 cup extra-virgin olive oil",
        "Coarse kosher salt",
        "1/4 cup thinly sliced fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Olive",
        "Tomato",
        "Freeze/Chill",
        "Marinate",
        "Backyard BBQ",
        "Fennel",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Grilled Butterflied Leg of Lamb with Tomato-Fennel Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-butterflied-leg-of-lamb-with-tomato-fennel-vinaigrette-239071"
}
