{
    "directions": [
        "Preheat oven to 375°F. Trim green tops from beets; cut off stems and discard, reserving greens. Gently scrub 4 beets and set aside (reserve remaining beets for another use). Toss beets with 2 tablespoons oil in roasting pan. Sprinkle with salt. Cover pan with foil. Bake until beets are tender, about 50 minutes. Let beets stand covered at room temperature 20 minutes. Peel beets and cut into 1/2-inch cubes.",
        "Whisk crème fraîche, horseradish, lemon juice, and minced shallot in medium bowl. Add beets and toss to coat. Season to taste with salt and pepper. Let stand at room temperature at least 20 minutes. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Whisk 2 tablespoons olive oil, Dijon mustard, Worcestershire sauce, chopped rosemary, minced garlic, and ground black pepper in 13x9x2-inch glass baking dish. Add steak; turn to coat. Cover and chill at least 1 hour and up to 2 hours.",
        "Spray grill rack with nonstick spray. Prepare barbecue (medium-high heat). Remove steak from marinade; sprinkle with salt and pepper. Grill steak to desired doneness, about 5 minutes per side for medium-rare. Remove from grill; let stand 5 minutes.",
        "Meanwhile, heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add reserved beet greens; sauté until wilted, about 3 minutes. Remove from heat, cover, and let stand 3 minutes.",
        "Thinly slice steak crosswise. Divide steak among 6 plates; surround with sautéed beet greens. Mound horseradish beets alongside."
    ],
    "ingredients": [
        "8 medium beets with green tops",
        "2 tablespoons olive oil",
        "1/3 cup crème fraîche or sour cream",
        "3 tablespoons prepared white horseradish",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon minced shallot",
        "4 tablespoons olive oil, divided",
        "2 tablespoons Dijon mustard",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon chopped fresh rosemary",
        "1 garlic clove, minced",
        "1/2 teaspoon ground black pepper",
        "1 1 1/2-pound flank steak",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Leafy Green",
        "Bake",
        "Freeze/Chill",
        "Marinate",
        "Sauté",
        "Horseradish",
        "Steak",
        "Beet",
        "Grill/Barbecue"
    ],
    "title": "Grilled Flank Steak with Sauteed Beet Greens and Creamy Horseradish Beets",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-flank-steak-with-sauteed-beet-greens-and-creamy-horseradish-beets-237885"
}
