{
    "directions": [
        "Soak wood chips in water to cover 30 minutes and drain well.",
        "Rinse turkey and pat dry inside and out. Season turkey inside and out with salt and pepper and pack neck cavity loosely with some lemon halves and herbs. Fold neck skin under body and fasten with a skewer. Fill body cavity loosely with some lemon halves and herbes. Fold neck skin under body and fasten with a skewer. Fill body cavity loosely with remaining lemon halves and herbs and truss turkey.",
        "Put an oiled rack inside a metal roasting pan that will fit inside grill. Spread turkey with butter and put on rack in pan. Add water to pan.",
        "Prepare grill:",
        "Open vents in lid and Bottom of grill and put 25 briquettes on 2 opposite sides of bottom, leaving middle clear. Position rack with wider openings over briquettes and light briquettes. (They will be ready for cooking as soon as they turn grayish-white in color, 20 to 30 minutes.) Shake excess water off wood chips and put evenly on top of briquettes. When chips begin to smoke, in about 2 minutes, the grill is ready.",
        "Grill turkey on rack in pan in grill, covered, over glowing coals 1 hour. (Do not remove lid during cooking.) Remove lid and add 10 more briquettes on each side. Grill turkey, covered, 1 hour more. Remove lid and add 10 more briquettes on each side. Grill turkey 1 hour more and insert a meat thermometer in fleshy part of a thigh. If thermometer registers 180°:F. and juices run clear when thigh is pierced, turkey is done. If turkey is not done, add 10 more briquettes on each side and test for doneness in same manner every 15 minutes.",
        "Transfer turkey to a heated platter, reserving juices in pan, and discard string. Keep turkey warm, covered loosely with foil.",
        "In a saucepan cook cranberries and sugar over moderately low heat, stirring frequently, until sugar is melted and cranberries burst. In a blender in batches purée cranberry mixture until smooth, transferring to a bowl. Cranberry mixture may be make 1 day ahead and chilled, covered. Bring mixture to room temperature before proceeding.",
        "Skim fat from pan juices, reserving 3 tablespoons fat, and deglaze pan with water over moderately high heat, scraping up brown bits. Simmer pan juices 3 minutes, stirring, and reserve off heat. In a saucepan whisk together reserved fat and flour and cook roux over moderately low heat, whisking, 3 minutes. Add pan juices and stock or broth in a stream and add cranberry mixture, whisking occasionally. Boil gravy, whisking occasionally, until reduced to about 5 cups, 15 to 20 minutes, and strain through a sieve into a saucepan. Season gravy with salt and pepper and keep warm.",
        "Discard lemon halves and herbs from turkey cavities. Garnish turkey with lemon halves and/or slices and herbs."
    ],
    "ingredients": [
        "1 cup wood chips (preferably apple, cherry, or hickory) if desired",
        "a 12- to 14- pound turkey, neck and giblets (excluding liver) reserved for making gravy",
        "2 to 3 lemons, halved",
        "fresh herb sprigs such as sage, parsley, and thyme",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup water",
        "a 12-ounce bag fresh or unthawed frozen cranberries, picked over",
        "3/4 cup sugar",
        "1 cup water",
        "3 tablespoons all-purpose flour",
        "4 cups turkey giblet stock or chicken broth",
        "Garnish: fresh lemon halves and/or slices and fresh thyme and flat-leafed parsley sprigs",
        "Garnish: fresh lemon halves and/or slices and fresh thyme and flat-leafed parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Grill",
        "Gourmet"
    ],
    "title": "Grilled Turkey with Cranberry Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-turkey-with-cranberry-gravy-10784"
}
