{
    "directions": [
        "Whisk the ingredients together and season to taste with salt and pepper. (The glaze can be made a few days in advance, covered, and kept refrigerated. Bring to room temperature before using.)",
        "Heat the oil in a saucepan over medium-high heat. Add the onion and garlic and cook, stirring, until soft, about 5 minutes; do not brown. Add the orange juice, lime juice, and habanero and bring to a boil. Cook until reduced by half. Whisk in the cilantro and cumin and season to taste with salt and pepper. (The mojo can be made a few hours in advance and set aside at room temperature.)",
        "1. Heat your grill to high. Set aside a few tablespoons of glaze for brushing the cooked pork.",
        "2. Brush the pork with the oil and sprinkle with salt and pepper. Grill, brushing often with the glaze, until just cooked through, 4 to 5 minutes per side.",
        "3. Remove the pork from the grill, brush with the reserved glaze, and let rest for 10 minutes. Cut into 1/2-inch-thick slices and arrange on a serving platter. Drizzle with mojo and serve immediately."
    ],
    "ingredients": [
        "1 cup guava jelly (available at Latin and Caribbean markets) or apricot jam",
        "1/4 cup Dijon mustard",
        "1/4 cup orange juice, preferably fresh",
        "Salt and freshly ground black pepper",
        "2 tablespoons mild vegetable oil, such as canola",
        "1 small red onion, finely chopped",
        "4 cloves garlic, finely chopped",
        "3 cups orange juice",
        "1/2 cup fresh lime juice",
        "1/2 habanero chile, seeded and finely chopped",
        "2 tablespoons chopped fresh cilantro leaves",
        "1 teaspoon cumin seeds",
        "Salt and freshly ground black pepper",
        "2 pork tenderloins, about 1 1/2 pounds each",
        "2 tablespoons mild vegetable oil, such as canola",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Garlic",
        "Mustard",
        "Onion",
        "Pork",
        "Low Carb",
        "Hot Pepper",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Jam or Jelly"
    ],
    "title": "Grilled Pork Tenderloin à la Rodriguez with Guava Glaze and Orange Habanero",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pork-tenderloin-a-la-rodriguez-with-guava-glaze-and-orange-habanero-234838"
}
