{
    "directions": [
        "In a blender or small food processor blend together the olives, the garlic, the mustard, the vinegar, 1/2 teaspoon of the thyme, and salt and pepper to taste, with the motor running add 3 tablespoons of the oil in a stream, and blend the vinaigrette until it is emulsified. Add the tomato and the water and blend the vinaigrette until it is smooth. Brush the chicken and the bell pepper with the additional oil, season them with salt and pepper, and grill them on an oiled rack set 5 to 6 inches over glowing coals, or in a hot well-seasoned ridged grill pan, covered, over moderately high heat, for 5 minutes on each side, or until the bell pepper is just tender and the chicken is cooked through. Transfer the chicken and bell pepper to cutting board, cut the bell pepper into thin strips, and slice the chicken on the diagonal into 1/4-inch-thick pieces. In a bowl toss the chicken pieces with the remaining 1 teaspoon thyme and salt and pepper to taste. Divide the arugula, the endive, the bell pepper, and the chicken between 2 plates and pour half the vinaigrette over each serving."
    ],
    "ingredients": [
        "4 large Kalamata or other brine-cured black olives, pitted",
        "1 garlic clove, chopped",
        "t teaspoon Dijon-style mustard",
        "1 tablespoon balsamic vinegar",
        "1 1/2 teaspoon fresh thyme leaves",
        "3 tablespoons olive oil plus additional for brushing the chicken and the bell pepper",
        "1 plum tomato, seeded",
        "1 tablespoon water",
        "1 whole boneless chicken breast with skin (about 1 pound), halved",
        "1 large red bell pepper, quartered",
        "4 cups packed arugula leaves, washed well and spun dry",
        "1 small Belgian endive, trimmed and sliced thin crosswise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Herb",
        "Olive",
        "Quick & Easy",
        "Low/No Sugar",
        "Arugula",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Chicken Breast with Arugula and Olive Thyme Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-chicken-breast-with-arugula-and-olive-thyme-vinaigrette-12318"
}
