{
    "directions": [
        "Pour 1 1/4 cups warm water into large bowl. Add sugar; sprinkle yeast evenly over and stir to blend. Let stand until yeast dissolves and mixture looks spongy, about 10 minutes. Mix in salt, then 2 1/2 cups flour. Stir until shaggy-looking dough forms. Sprinkle work surface with 1/4 cup flour; turn dough out onto work surface. Knead dough until smooth and only slightly sticky, adding more flour if very sticky, about 8 minutes. Dust dough all over with flour. Place in clean large bowl. Cover with plastic wrap and towel. Let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.\nFor toppings:\nThinly slice cheese; arrange atop crusts, leaving 1/2-inch plain border. Cover cheese with single layer of pear slices (there may be some pear left over), then scatter walnuts over.\nPrepare barbecue (medium heat). Working in batches if necessary, transfer pizzas to grill. Cover and cook until cheese softens and crust is golden on bottom, 4 to 5 minutes. Transfer pizzas to work surface. Sprinkle with pepper; drizzle with oil. Cut into wedges and serve.\nIngredient tip: This recipe calls for Brinata, a specific kind of pecorino fresco. Pecorino fresco is a fresh sheep' smilk cheese that is milder in taste and softer than Pecorino Toscano or Pecorino Romano. Look for pecorino fresco at your local cheese shop or purchase it online from murrays cheese.com or agferrari.com. Manchego cheese, which is also made from sheep's milk, is a good substitute.\nWhat to drink: In keeping with the spirit of this menu, pour Tuscan wines. Try a Tuscan white with the pizza. We like the citrus and floral notes of the 2006 Bibi Graetz \"Casamatta\" Bianco ($9).",
        "Knead dough down. Dust lightly with flour. Divide into 4 equal pieces. Place on work surface. Cover dough with kitchen towel and let rest 30 minutes.",
        "Prepare barbecue (medium-high heat). Working with 1 dough piece at a time, stretch and roll out on lightly floured surface to 9- to 10-inch round. Grill until beginning to color, about 1 1/2 minutes per side. Transfer crusts to baking sheets. DO AHEAD: Pizza crusts can be made 6 hours ahead. Let crusts stand at room temperature.",
        "Thinly slice cheese; arrange atop crusts, leaving 1/2-inch plain border. Cover cheese with single layer of pear slices (there may be some pear left over), then scatter walnuts over.",
        "Prepare barbecue (medium heat). Working in batches if necessary, transfer pizzas to grill. Cover and cook until cheese softens and crust is golden on bottom, 4 to 5 minutes. Transfer pizzas to work surface. Sprinkle with pepper; drizzle with oil. Cut into wedges and serve.",
        "This recipe calls for Brinata, a specific kind of pecorino fresco. Pecorino fresco is a fresh sheep' smilk cheese that is milder in taste and softer than Pecorino Toscano or Pecorino Romano. Look for pecorino fresco at your local cheese shop or purchase it online from murrays cheese.com or agferrari.com. Manchego cheese, which is also made from sheep's milk, is a good substitute."
    ],
    "ingredients": [
        "1 1/4 cups warm water (105°F to 115°F)",
        "Pinch of sugar",
        "1 1/2 teaspoons active dry yeast",
        "1 1/2 teaspoons salt",
        "2 3/4 cups (or more) bread flour, divided",
        "12 ounces Brinata or aged Manchego cheese",
        "2 pears (about), halved, cored, very thinly sliced",
        "2/3 cup walnut pieces, coarsely broken",
        "Freshly cracked black pepper",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Pear",
        "Walnut",
        "Grill",
        "Grill/Barbecue",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Pizza with Pears, Fresh Pecorino, and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-pizza-with-pears-fresh-pecorino-and-walnuts-243004"
}
