{
    "directions": [
        "Preheat grill for medium heat and lightly oil the grate.",
        "Toss tomatoes with 2 tablespoons olive oil and 1/2 teaspoon salt in a bowl. Place on 2 sheets of aluminum foil; tent the edges to contain the juices.",
        "Toss red bell pepper, onion, poblano pepper, and garlic with remaining 2 tablespoons olive oil and 1/2 teaspoon salt in the bowl.",
        "Place tented aluminum foil with tomatoes on the grill. Place red bell pepper mixture and lemon halves directly on the grill. Cover and cook, turning occasionally, until browned, 12 to 15 minutes.",
        "Wrap grilled red bell pepper and poblano pepper in aluminum foil. Allow peppers to steam as they cool, about 10 minutes. Remove and discard skins and seeds.",
        "Transfer peeled peppers to a blender. Add grilled tomatoes, with their juices, and 3/4 of the onion to the blender. Squeeze in juice from grilled lemon and garlic from the skins. Cover and blend until smooth. Stir in horseradish, seafood seasoning, celery salt, Worcestershire sauce, and hot sauce. Refrigerate until cooled, about 30 minutes.",
        "Fill 6 glasses with ice. Pour 1 fluid ounce vodka into each. Top with blended mixture. Garnish with remaining 1/4 onion."
    ],
    "ingredients": [
        "1 pound tomatoes",
        "1/4 cup olive oil, divided",
        "1 teaspoon salt, divided",
        "1 red bell pepper",
        "1 small onion, quartered",
        "1 poblano pepper",
        "3 cloves garlic, unpeeled",
        "1 lemon, halved",
        "1 1/2 teaspoons grated fresh horseradish",
        "1 teaspoon seafood seasoning (such as Old Bay®)",
        "1/2 teaspoon celery salt",
        "1 dash Worcestershire sauce",
        "1 dash hot sauce (such as Tabasco®), or to taste (optional)",
        "ice",
        "6 fluid ounces vodka, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grilled Gazpacho Bloody Mary",
    "url": "http://allrecipes.com/recipe/254445/grilled-gazpacho-bloody-mary/"
}
