{
    "directions": [
        "In small saucepan over moderate heat, stir together jam, vinegar, red pepper flakes, and lemon zest. Bring to boil, then lower heat to low and simmer, uncovered, stirring occasionally, until slightly thickened, about 10 minutes. Remove from heat and allow to cool 5 minutes. Stir in mint and set aside.",
        "If using charcoal grill, open vents on bottom, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 4 to 5 seconds. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high.",
        "In electric spice mill or clean coffee grinder, combine cumin and coriander seeds. Pulse several times to coarsely grind. In large bowl, toss together lamb, figs, and olive oil. Add garlic, ground cumin and coriander, salt, and pepper, and toss gently to combine. Thread lamb cubes and figs onto skewers.",
        "Arrange eggplant slices on platter. Rub each slice on both sides with oil and sprinkle with salt and pepper.",
        "Arrange skewers and eggplant on grill. Cook eggplant, turning once, until slices are golden and moist, about 3 to 4 minutes per side. Cook lamb to slightly less than desired doneness (cubes will continue to cook after being removed from grill), turning once and brushing with glaze during last 30 seconds of grilling on each side, about 4 minutes per side for medium-rare.",
        "Arrange eggplant slices on serving platter, top with skewers, and serve."
    ],
    "ingredients": [
        "2/3 cup apricot jam",
        "1/3 cup red wine vinegar",
        "1 tablespoon red pepper flakes",
        "1 tablespoon finely grated lemon zest (from about 1 lemon)",
        "1/4 cup fresh mint, chopped",
        "1 tablespoon whole cumin seeds",
        "1 tablespoon whole coriander seeds",
        "3 pounds boneless leg of lamb, fat trimmed, cut into 1-inch cubes",
        "12 fresh figs, halved vertically",
        "1/4 cup olive oil",
        "2 medium cloves garlic, minced (about 2 tablespoons)",
        "1 tablespoon kosher salt",
        "1 tablespoon freshly coarse-ground black pepper",
        "Special equipment: about 30 (12-inch) metal skewers",
        "2 eggplants, unpeeled, cut into 1-inch-thick slices",
        "1/4 cup olive oil",
        "1 tablespoon kosher salt",
        "1 tablespoon freshly coarse-ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Garlic",
        "Herb",
        "Lamb",
        "Vegetable",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Lamb and Fig Skewers with Mint-Pepper Glaze and Grilled Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-lamb-and-fig-skewers-with-mint-pepper-glaze-and-grilled-eggplant-238566"
}
