{
    "directions": [
        "Coarsely crack peppercorns (see cooks' note, below). Stir together pepper and salt in a small bowl, then add oil and stir until combined well. Rub spice mixture all over beef.",
        "Tear off 8 (2-foot-long) sheets of heavy-duty foil and arrange in 2 stacks of 4. Divide potatoes, onions, garlic, and sage between stacks, arranging in 1 layer in center of foil, then drizzle each with 2 tablespoons oil and season with salt and pepper. Working with top sheet of foil, fold each side over potato mixture to enclose, then turn package a quarter turn and repeat folding and turning package with each piece of remaining foil. Make second hobo pack in same manner.",
        "Open vents on bottom of grill. Light charcoal (80 to 100 briquettes) in chimney starter. Leaving about one quarter of grill free of charcoal, bank lit charcoal across rest of grill so that coals are about three times higher on opposite side.",
        "Charcoal fire is medium-hot when you can hold your hand 5 inches above rack over area where coals are piled highest for 3 to 4 seconds. Using long metal tongs, lift up one hinged side of rack and put hobo packs, folded sides down, on portion of bottom rack with no coals on it. (One side of packages will be in direct contact with coals.) Cook hobo packs, turning a quarter turn with tongs every 15 minutes, 45 minutes total.",
        "While hobo packs are cooking, sear beef on lightly oiled grill rack directly over hottest part of coals, uncovered, turning occasionally and, if necessary, moving around grill to avoid flare-ups, until well browned, 12 to 15 minutes total. Move beef to coolest part of grill, then cover with inverted roasting pan and grill, turning occasionally, until thermometer inserted diagonally into center registers 120°F for medium-rare, about 10 minutes. Transfer beef to a cutting board and let stand, loosely covered with foil, 15 minutes.",
        "Preheat all burners on high, covered, 10 minutes. Reduce heat to moderately low on 2 burners if your grill has 3 (or 1 burner if your grill has 2) and cook hobo packs, folded sides down, on grill rack, covered with lid, over moderately low burner(s) 40 minutes.",
        "Meanwhile, sear beef on lightly oiled grill rack over remaining burner on high, covered with lid, turning over occasionally, until well browned, 12 to 15 minutes total. Reduce heat to moderate and cook beef, covered with lid, turning over occasionally, until thermometer inserted diagonally into center registers 120°F for medium-rare, about 10 minutes. Transfer beef to a cutting board and let stand, loosely covered with foil, 15 minutes.",
        "Thinly slice beef, then remove potato mixture from packages and serve with sour cream, bacon, and chives."
    ],
    "ingredients": [
        "2 tablespoons black peppercorns",
        "1 1/2 tablespoons kosher salt",
        "2 tablespoons olive oil",
        "1 (2 1/2-lb) center-cut beef tenderloin roast, trimmed and tied",
        "1 1/2 lb fingerling or baby Yukon Gold potatoes (about 16), halved lengthwise",
        "1/2 lb pearl onions (about 16), blanched in boiling water 1 minute, drained, and peeled",
        "12 garlic cloves",
        "2 tablespoons minced fresh sage",
        "1/4 cup extra-virgin olive oil",
        "1/2 cup sour cream",
        "6 bacon slices, cooked and crumbled",
        "1/4 cup thinly sliced fresh chives",
        "Special equipment: 12-inch-wide heavy-duty aluminum foil; a 22 1/2-inch kettle grill with a hinged top rack (if using charcoal); a large chimney starter (if using charcoal); long metal tongs; a 17- by 12 1/2- by 3 1/2-inch disposable aluminum roasting pan (if using charcoal); an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Potato",
        "Backyard BBQ",
        "Dinner",
        "Beef Tenderloin",
        "Bacon",
        "Grill",
        "Grill/Barbecue",
        "Sage",
        "Chive",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Grilled Beef Tenderloin with Potato Hobo Packs",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-beef-tenderloin-with-potato-hobo-packs-109518"
}
