{
    "directions": [
        "Prepare barbecue (medium-high heat). Line each of 2 shallow soup bowls with large sheet of heavy-duty foil (18-inch- wide size), leaving overhang on all sides. Cut top 3/4 inch off each head of garlic, revealing cloves. Place 2 heads of garlic in each foil-lined bowl. Spoon 11/2 cups olives around garlic in each bowl. Sprinkle half of coriander and half of crushed red pepper over each. Drizzle each with 3 tablespoons oil. Fold foil overhang to center; seal packets tightly. Transfer packets from bowls to edge of grill. Cook until garlic is tender, opening packets to test garlic every 45 minutes, about 2 hours total. Open packets; cool 15 minutes.",
        "Place 1 head of garlic in center of large shallow bowl. Working with 1 at a time, hold remaining garlic heads upside down and squeeze softened cloves into olive mixture in packets, dividing equally; stir to blend. Spoon olive-garlic relish from both packets around head of garlic in bowl.",
        "Grill bread until crisp on 1 side, 3 to 4 minutes. Arrange toasts, cheese, and bowl of relish on platter; garnish with rosemary."
    ],
    "ingredients": [
        "4 large heads of garlic",
        "3 cups assorted pitted olives (such as Kalamata, Greek, and Niçoise)",
        "2 tablespoons coriander seeds, coarsely crushed in plastic bag",
        "1 1/2 teaspoons dried crushed red pepper",
        "6 tablespoons olive oil",
        "1 baguette, cut on slight diagonal into 1/3-inch-thick slices",
        "1 8-ounce log soft fresh goat cheese",
        "Fresh rosemary sprigs (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Garlic",
        "Olive",
        "Roast",
        "High Fiber",
        "Backyard BBQ",
        "Goat Cheese",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Grill-Roasted Garlic and Olive Relish with Toasts and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/grill-roasted-garlic-and-olive-relish-with-toasts-and-goat-cheese-363189"
}
