{
    "directions": [
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas). (If using a charcoal grill, open vents on bottom of grill, then light charcoal. When Charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows: Hot: When you can hold your hand there for 1 to 2 seconds; Medium-hot: 3 to 4 seconds; Low: 5 to 6 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.)",
        "Toss peppers and onion with 1 tablespoon oil. Grill on lightly oiled grill sheet set directly on grill rack, with grill covered only if using a gas grill, turning occasionally, until slightly softened and charred, 9 to 15 minutes (onion will cook faster), transferring to a bowl as cooked.",
        "Add vinegar, oregano, salt, pepper, and remaining 2 tablespoons oil to peppers and onion, tossing to coat. Let stand 10 minutes to allow flavors to develop.",
        "While vegetables stand, run skewers crisscrossed horizontally through sausage coil, securing ends. Grill directly over medium-hot charcoal (moderate heat for gas) on lightly oiled grill rack, covered only if using a gas grill, turning over once, until cooked through, 10 to 12 minutes total. (Thicker sausage may take longer.)",
        "Transfer vegetables to a platter and top with sausage."
    ],
    "ingredients": [
        "3 mixed large bell peppers, trimmed and quartered lengthwise",
        "1 large red onion, quartered lengthwise and separated into layers",
        "3 tablespoons extra-virgin olive oil",
        "1 1/2 tablespoons red-wine vinegar",
        "1/2 teaspoon dried oregano, crumbled",
        "1/2 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1 lb luganega or other fresh Italian sausage",
        "Special equipment: a perforated grill sheet; 2 (10- to 12-inch-long) wooden or metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pepper",
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Sausage",
        "Bell Pepper",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Grilled Italian Sausage with Warm Pepper and Onion Salad",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-italian-sausage-with-warm-pepper-and-onion-salad-232162"
}
