{
    "directions": [
        "Prepare grill.",
        "Cut six 1/4-inch-thick slices from center of onion and reserve. Divide beef into 6 portions. Form indentation in each portion and spoon rounded teaspoon pesto into each indentation. Form beef portions into six 3/4-inch-thick patties, enclosing pesto completely. Grill patties on an oiled rack set 5 to 6 inches over glowing coals 5 minutes. Turn burgers and grill 3 minutes more. Top burgers with mozzarella and grill 2 minutes more, or until just cooked through. Transfer burgers to a platter and let stand while grilling onion. Brush onion on both sides with oil and grill until softened and browned, about 3 minutes on each side.",
        "Spread pesto on both sides of buns and make sandwiches with onion and burgers.",
        "In a food processor blend together all ingredients with salt and pepper to taste until smooth. Pesto keeps, surface covered with plastic wrap, chilled, 1 week. Makes about 1 cup."
    ],
    "ingredients": [
        "1 large red onion",
        "2 pounds ground beef",
        "3/4 cup dried tomato and arugula pesto, or to taste",
        "6 ounces mozzarella, cut into 6 slices",
        "olive oil for brushing onion",
        "6 hamburger buns, grilled lightly if desired",
        "1 1/2 cups packed arugula, washed well and spun dry",
        "1/3 cup drained bottled dried tomatoes packed in oil",
        "1/4 cup olive oil",
        "3 tablespoons freshly grated Parmesan",
        "2 tablespoons pine nuts, toasted golden and cooled",
        "1 large garlic clove, chopped and mashed to a paste with 1/2 teaspoon salt",
        "a pinch sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Backyard BBQ",
        "Mozzarella",
        "Ground Beef",
        "Arugula",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled Mozzarella Cheeseburgers with Dried Tomato and Arugula Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-mozzarella-cheeseburgers-with-dried-tomato-and-arugula-pesto-12456"
}
