{
    "directions": [
        "Preheat oven to 250°F. Spread out coconut (if using) on a rimmed baking sheet. Bake, stirring often, until golden brown, about 10 minutes. Let cool on pan.",
        "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. Brush grill grates with oil. Meanwhile, combine okra, corn, zucchini, chiles, eggplant, and salt in a large bowl; drizzle with oil and toss to coat. Grill vegetables (use a grill basket if you have one), turning frequently, until crisp-tender and lightly charred, about 8 minutes. Place chiles in a medium bowl; cover tightly with plastic to let steam for easy peeling. Set chiles aside for dressing.",
        "Cut corn kernels from cobs; place in a large bowl. Cut zucchini and eggplant into irregular 1\" pieces; place in bowl with corn. Trim any tough tops from okra and cut okra in half lengthwise; add to bowl. Set aside.",
        "Peel or scrape off charred skin from chiles and discard. Purée chiles (with seeds) and garlic in a food processor or mash with a mortar and pestle until a coarse paste forms. Add sugar and process or pound until dissolved. Stir in fish sauce and lime juice.",
        "Drizzle dressing over warm vegetables; add herbs and toasted coconut (if using); toss well.",
        "Scoop steamed rice onto a platter and top with salad."
    ],
    "ingredients": [
        "1/4 cup unsweetened shredded coconut (optional)",
        "Vegetable oil",
        "12 okra pods",
        "3 ears of corn, shucked",
        "2 large zucchini, halved lengthwise, centers scooped out",
        "2 long red chiles (such as Holland or Anaheim), stemmed",
        "1 small eggplant, cut lengthwise into 1\" slices",
        "1 tablespoon sea salt",
        "1 garlic clove, minced",
        "1 teaspoon palm sugar or (packed) light brown sugar",
        "2 tablespoons fish sauce (such as nuoc nam or nam pla)",
        "1 tablespoon fresh lime juice",
        "2 cups (loosely packed) mixed fresh tender herbs (such as basil, cilantro, fennel fronds, marjoram, mint, and tarragon)",
        "4 cups steamed jasmine rice",
        "Ingredient info: Look for unsweetened shredded coconut at natural and specialty foods stores and some supermarkets. Anaheim chiles, also known as California chiles, are available at Latin markets and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Low Cal",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Low Cholesterol",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Vegetable and Rice Salad with Fish-Sauce Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-vegetable-and-rice-salad-with-fish-sauce-vinaigrette-51104380"
}
