{
    "directions": [
        "Snip shells of shrimp with scissors down middle of back, leaving tail and first segment of shell intact. Make an incision along length of back where shells are cut and devein, leaving shells in place. (Shells will prevent shrimp from becoming tough on outside when grilled.) Toss shrimp with oil, garlic, and 1/2 teaspoon salt and marinate at cool room temperature 15 minutes.",
        "While shrimp marinate, prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "Heat butter, chili powder, pepper, Worcestershire sauce, and remaining 1/4 teaspoon salt in a small heavy saucepan over moderately low heat, stirring, until butter is melted, then remove from heat and stir in lemon juice.",
        "Thread 4 or 5 shrimp onto each skewer and grill, covered only if using a gas grill, turning over once, until just cooked through, 3 to 4 minutes total. Push shrimp off skewers into a bowl, then pour butter mixture over them and toss to combine well."
    ],
    "ingredients": [
        "1 1/2 lb large shrimp (21 to 25 per lb)",
        "2 tablespoons olive oil",
        "3 medium garlic cloves, minced",
        "3/4 teaspoon salt",
        "3/4 stick (6 tablespoons) unsalted butter",
        "2 teaspoons chili powder",
        "2 teaspoons black pepper",
        "4 teaspoons Worcestershire sauce",
        "1 tablespoon fresh lemon juice",
        "Special equipment: 7 (12-inch) wooden skewers",
        "Accompaniments: a baguette and lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Picnic",
        "Quick & Easy",
        "Mardi Gras",
        "Lemon",
        "Shrimp",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Grilled New Orleans-Style Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-new-orleans-style-shrimp-108335"
}
