{
    "directions": [
        "Prepare a gas grill for direct-heat cooking over medium-high heat; see Grilling Procedure .",
        "Cover potatoes with water in a saucepan and season well with salt. Simmer, partially covered, until just tender, 12 to 15 minutes. Drain potatoes, then arrange on a platter with roasted peppers.",
        "While potatoes cook, pat steak dry and season with 1 teaspoon salt. Oil grill rack, then grill steak, turning once, 10 to 12 minutes total for medium-rare. Let steak rest on a cutting board 5 minutes before thinly slicing across the grain.",
        "While steak rests, with motor running, drop garlic into a food processor and finely chop. Add cilantro and pulse until chopped. Add lemon juice, spices, 1/2 teaspoon salt, and oil. Pulse until cilantro is finely chopped and sauce comes together. Transfer charmoula to a small bowl.",
        "Arrange sliced steak, with any juices, over potatoes and peppers. Serve charmoula on the side."
    ],
    "ingredients": [
        "2 pounds medium Yukon Gold potatoes, scrubbed well and quartered lengthwise",
        "6 bottled whole roasted peppers (about 8 ounces), rinsed and patted dry",
        "2 pounds flank steak (1 inch thick)",
        "2 garlic cloves",
        "2 cups packed cilantro sprigs",
        "3 tablespoons fresh lemon juice",
        "2 teaspoons ground cumin",
        "2 teaspoons paprika (not hot)",
        "1/2 teaspoon hot red-pepper flakes",
        "1/2 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Fourth of July",
        "Quick & Easy",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Steak",
        "Spice",
        "Bell Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Grilled Steak and Potatoes with Charmoula Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-steak-and-potatoes-with-charmoula-sauce-354136"
}
