{
    "directions": [
        "Add buttermilk, jalapeno, smoked paprika, 1/2 the lime juice, salt, and pepper to a large resealable zip top bag. Add the halibut and let marinate for 30 minutes.",
        "Preheat the grill to medium-high heat.",
        "Once hot, brush the grill grate with some olive oil. Remove the fish from the marinade and grill the fish 4 minutes per side, about 8 minutes total. Remove to a plate and break the fish into chunks. Sprinkle with lime juice and a touch more salt.",
        "Grill corn tortillas until warm and soft and they have a few charred marks.",
        "To assemble the tacos, place a nice spoonful of the fish onto the center of a warmed tortilla. Top with the Cabbage Slaw. Garnish with lime wedges and cilantro leaves.",
        "Using a large holed grater attachment for a food processor, shred the cabbage and red onion. Add to a large serving bowl with the chopped cilantro.",
        "Mix the sour cream, chipotle, lime juice, honey, salt, and pepper in a separate bowl.",
        "Add the dressing to the grated cabbage. Allow the mixture to marinate for at least 30 minutes and up to 8 hours before serving"
    ],
    "ingredients": [
        "1 cup buttermilk",
        "1 jalapeno, sliced",
        "1 teaspoon smoked paprika",
        "Juice of 1 lime",
        "1 1/2 pounds halibut, skinless",
        "Olive oil, for greasing grates",
        "Kosher salt and freshly ground black pepper",
        "16 to 20 (6-inch) corn tortillas",
        "Cabbage Slaw, recipe follows",
        "Lime wedges, for serving",
        "Fresh cilantro leaves, for serving",
        "1/2 small head green cabbage, cored",
        "1/4 red onion",
        "3 tablespoons chopped cilantro",
        "1/2 cup sour cream",
        "1 chipotle, packed in adobo, finely chopped",
        "Juice of 1/2 lime",
        "1 tablespoon honey",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Grilling Recipes",
        "Easy Recipes",
        "Grilling",
        "Taco Recipes",
        "Fish",
        "Jalapeno Recipes",
        "Vegetable"
    ],
    "title": "Grilled Southern Fish Tacos with Cabbage Slaw",
    "url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/grilled-southern-fish-tacos-with-cabbage-slaw-recipe"
}
