{
    "directions": [
        "Spread 2 tablespoons of the butter on one half of the bread loaf and a thin layer of mustard on the other. Place 1 to 2 layers of ham, pork, cheese, and, finally, pickles on the buttered bread and top with the mustard-spread bread.",
        "Smear the remaining butter all over the outside of the sandwich and wrap it completely in aluminum foil.",
        "Heat your grill to high (550°F) and close the lid. Wait at least 15 minutes before lowering the heat to medium-high (450°F) and continuing.",
        "Before grilling the sandwich, press down on it with your hands to flatten it. Place the wrapped, flattened sandwich on the grill and top with a brick, grill press, or any other heavy, heat-resistant object. Close the lid and grill for 5 to 6 minutes per side.",
        "Remove the wrapped sandwich from the grill and take off the foil. Return the sandwich to the grill and grill for about 2 to 3 minutes per side, or until both pieces of bread are crispy and golden brown.",
        "Remove the sandwich from the grill and cut at an angle into small sandwich wedges (triangles). Place on a large platter and serve while still hot."
    ],
    "ingredients": [
        "1 loaf Cuban bread, sliced lengthwise",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "3 tablespoons yellow mustard, or to taste",
        "1 1/2 pounds boiled ham, sliced",
        "1 1/2 pounds roasted pork , sliced",
        "1 pound Swiss cheese, sliced",
        "1 cup dill pickle chips, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Pork",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Ham",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Swiss Cheese",
        "Sandwich Theory",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grilled Cuban Sandwich (_Sandwich Cubano_)",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-cuban-sandwich-em-sandwich-cubano-em-364812"
}
