{
    "directions": [
        "1 Preheat an outdoor grill or stovetop grill pan to medium-high.",
        "2 To cut the mangoes, slice off one of the pointed ends on one of them and stand it up on a cutting board. Using a sharp knife, make a cut from top to bottom, removing one of the wide, rounded sides of the mango from the center pit but keeping the side intact. Repeat with the other side. Also cut away any of the mango flesh around the narrow edge of the pit; reserve that flesh for a fruit salad or another use.",
        "3 Peel the two halves removed from the mango, then repeat with the remaining mangoes.",
        "4 Mix the olive oil and salt in a bowl and add the mango halves. Use your hands to mix thoroughly so that all the mango pieces are evenly coated with the mixture.",
        "5 Grill the mango halves for a minute on each side, using a large spatula to turn them. Remove them to the jelly-roll pan.",
        "6 Mix the curry powder and sugar and evenly sprinkle half on the mango halves. Turn the mango halves over and sprinkle the remaining curry mixture on the other side.",
        "7 Return the mango halves to the grill for 30 seconds on each side. Remove the mangoes to the pan again.",
        "8 To assemble the dessert, place a warm grilled mango half on each of 8 dessert plates. Place a scoop of the Coconut Ice Milk next to it, then sprinkle with a tablespoon of the toasted coconut.",
        "Serve immediately. For advance preparation, you may do the first grilling before serving time, then add the curry mixture and do the second grilling right before serving.",
        "Cover and refrigerate any leftover mango halves if you are not using all 8. They are also good cold."
    ],
    "ingredients": [
        "4 large mangoes (or 6 to 8 if they are small)",
        "1 tablespoon light or pure olive oil",
        "1/4 teaspoon salt",
        "1 tablespoon best-quality curry powder",
        "3 tablespoons sugar",
        "1 recipe Ginger Ice Milk",
        "1/2 cup (1 to 1 1/2 ounces) sweetened shredded coconut, lightly toasted",
        "One jelly-roll pan for holding the mango slices before and after grilling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Vegetarian",
        "Low/No Sugar",
        "Coconut",
        "Mango",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Grilled Curried Mangoes with Ginger Ice Milk",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-curried-mangoes-with-ginger-ice-milk-51202010"
}
