{
    "directions": [
        "Stir together 1 stick softened butter, thyme, rosemary, zest, 1 teaspoon sea salt, and 3/4 teaspoon pepper in a bowl until combined well.",
        "Trim necks of poussins flush with bodies if necessary. Rinse poussins inside and out and pat dry. Discard any excess fat from opening of cavities, then sprinkle cavities with a total of 1 1/2 teaspoons sea salt and remaining 1/2 teaspoon pepper. Starting at cavity end of each bird, gently slide an index finger between skin and flesh of breasts and legs to loosen skin (be careful not to tear skin). Using a teaspoon measure or small spoon, slide 1 teaspoon herb butter under skin of each breast half and each drumstick (4 teaspoons per poussin), using your finger on outside of skin to push butter out of spoon.",
        "Put 1 lemon wedge and 3 thyme sprigs into cavity of each poussin, then tie legs together with kitchen string and tuck wing tips under body. Arrange in a large pan. Pat poussins dry, then brush with melted butter and sprinkle with remaining teaspoon salt.",
        "Open vents on bottom of grill and on lid. Light charcoal (80 to 100 briquettes) in chimney starter and pour evenly over 2 opposite sides of bottom rack, leaving about an 8-inch-wide space in center of bottom rack free of coals. When charcoal fire is medium-hot (you can hold your hand 5 inches above grill rack for 3 to 4 seconds), remove poussins from pan and arrange in center of lightly oiled grill rack with no coals underneath and cook, covered with lid, until thermometer inserted in fleshy part of a thigh registers 170°F, 35 to 50 minutes. (Add more briquettes if necessary during grilling to maintain heat.)",
        "Preheat all burners on high, covered, 10 minutes, then reduce to moderately high. Turn off 1 burner (middle burner if there are 3) and put poussins on lightly oiled rack above shut-off burner. Remove poussins from pan, then grill, covered with lid, until thermometer inserted in fleshy part of a thigh registers 170°F, 35 to 45 minutes."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) unsalted butter (1 stick softened and 1/2 stick melted and cooled)",
        "2 tablespoons chopped fresh thyme leaves",
        "1 tablespoon finely chopped fresh rosemary",
        "1 1/2 tablespoons loosely packed finely grated fresh lemon zest",
        "3 1/2 teaspoons fine sea salt",
        "1 1/4 teaspoons black pepper",
        "6 (1 1/4- to 1 1/2-lb) poussins or small Cornish hens",
        "1 lemon, cut lengthwise into 6 wedges",
        "18 sprigs fresh thyme",
        "Special equipment: kitchen string; a large chimney starter (if using charcoal); an instant-read thermometer",
        "Garnish: fresh thyme and rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Lemon",
        "Rosemary",
        "Grill/Barbecue",
        "Thyme",
        "Gourmet"
    ],
    "title": "Grilled Poussins with Lemon Herb Butter",
    "url": "http://www.epicurious.com/recipes/food/views/grilled-poussins-with-lemon-herb-butter-235471"
}
