{
    "directions": [
        "First, prepare the grits. Bring the water and salt to a boil in a heavy-bottomed pot. Whisking the whole time, add the grits in a steady stream. Reduce the heat to low or medium-low and cook, stirring frequently, for 10 minutes, or until the grits have bloomed and are creamy. Stir in the butter and taste for salt. Keep warm.",
        "Fry the bacon in a large sauté pan over medium heat, until crispy. Remove the bacon to paper towels to drain. Add the onion to the pan and sauté in the bacon fat until soft. Keep warm.",
        "Coat the fillets thoroughly with Cajun seasoning and sprinkle both sides with salt and pepper. Heat the butter in a large clean sauté pan or in the bacon pan over medium-high heat. Add the fish fillets and fry for 2 to 3 minutes per side, or until just cooked through. While the fish is cooking, crack the eggs into the pan and fry alongside the fish, or fry in a separate skillet if the pan is not large enough to accommodate both.",
        "Spoon the grits into two large shallow serving bowls and sprinkle with the bacon and sautéed onion. Top each with 2 fish fillets and crown with an egg. Lay the sliced avocado and tomato on the side and season with salt and pepper."
    ],
    "ingredients": [
        "5 cups water",
        "1 teaspoon kosher salt, plus more to taste",
        "1 cup instant grits",
        "2 tablespoons (1/4 stick) unsalted butter",
        "3 bacon slices, diced",
        "1/2 sweet onion, diced, such as Walla Walla",
        "4 snapper or rockfish fillets",
        "4 to 6 tablespoons Cajun and Blackening Seasoning",
        "Kosher salt and freshly ground black pepper",
        "3 tablespoons unsalted butter",
        "2 large eggs",
        "1 avocado, peeled, pitted, and sliced",
        "1 tomato, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fish",
        "Breakfast",
        "Brunch",
        "Sauté",
        "Bacon",
        "Snapper",
        "Avocado",
        "Hominy/Cornmeal/Masa",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Grits and Grunts",
    "url": "http://www.epicurious.com/recipes/food/views/grits-and-grunts-51168010"
}
