{
    "directions": [
        "Bring the chicken stock to a boil in a saucepan over high heat.",
        "Slowly pour the grits into the stock while stirring constantly.",
        "Reduce heat to low; simmer until the grits are tender and thick, 15 to 20 minutes, stirring occasionally.",
        "Stir in 1/4 cup heavy cream to thin the grits.",
        "Stir in the Gouda cheese and 1/4 cup butter until melted and smooth.",
        "While the grits are cooking, place the bacon in a large, deep skillet over medium heat; cook until the bacon fat is rendered, about 3 minutes.",
        "Stir in the shallot and garlic; cooking and stirring until the shallots are tender, about 5 minutes.",
        "Pour in the white wine and stir in 3 tablespoons butter, cooking and stirring until the butter has melted.",
        "Drop the shrimp in the skillet; cook and stir until they are bright pink on the outside and the meat is no longer transparent in the center, about 3 minutes.",
        "Stir in the spinach, mushrooms, and green onions; cook and stir until the spinach wilts, about 2 minutes more.",
        "Remove the shrimp with a slotted spoon.",
        "Stir in 2 cups heavy cream. Simmer until the cream is reduced by about a third, about 10 minutes.",
        "Season with hot sauce, salt, and pepper.",
        "Return the shrimp to the skillet to heat through.",
        "Serve shrimp and sauce over the prepared grits."
    ],
    "ingredients": [
        "3 1/2 cups chicken stock",
        "3/4 cup old fashioned grits",
        "1/4 cup heavy cream, plus more as needed",
        "1 cup shredded smoked Gouda cheese, or more to taste",
        "1/4 cup butter",
        "8 slices bacon, chopped",
        "3 tablespoons butter",
        "1 tablespoon minced shallot",
        "1 tablespoon minced garlic",
        "1 splash white wine",
        "1 pound jumbo shrimp, peeled and deveined",
        "2 cups chopped spinach",
        "1 cup chopped portobello mushrooms",
        "1/4 cup sliced green onions",
        "2 cups heavy cream",
        "1 dash hot pepper sauce, or to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grits a Ya Ya",
    "url": "http://allrecipes.com/recipe/220018/grits-a-ya-ya/"
}
