{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until a bit of the fat renders, 2 to 3 minutes; add onion, garlic, and black pepper. Continue to cook and stir the beef mixture until the beef is browned completely, 3 to 5 minutes more.",
        "Combine flour, baking powder, and salt in a large bowl. Cut shortening into the flour mixture with a pastry cutter or fork. Slowly pour 3/4 cup milk into the mixture while stirring with a fork to form a soft dough; knead 8 to 10 times and roll out into a 12x8-inch rectangle.",
        "Spread the beef mixture in an even layer onto the pastry rectangle to cover, leaving one of the longer edges clear. Begin with longer end not left clear and roll pastry and filling tightly into a cylinder, pinching the edge left clear to seal.",
        "Use a thread to cut cylinder into ten 1 1/2-inch slices; arrange pinwheels onto a baking sheet.",
        "Bake in preheated oven until pastry is no longer doughy, 15 to 20 minutes.",
        "Stir cream of mushroom soup and 1 can of milk together in a saucepan; bring to a simmer and cook until hot, 2 to 3 minutes. Spoon over the baked pinwheels."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/3757013.jpg",
    "ingredients": [
        "Meat:",
        "1 pound ground beef",
        "1/2 onion, chopped",
        "1 clove garlic, minced",
        "1/4 teaspoon ground black pepper",
        "Pastry:",
        "2 cups all-purpose flour",
        "4 teaspoons baking powder",
        "1 teaspoon salt",
        "1/2 cup shortening",
        "3/4 cup milk",
        "Mushroom Sauce:",
        "2 (10.75 ounce) cans cream of mushroom soup",
        "1 (10.75 ounce) can milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ground Beef Pinwheels with Mushroom Sauce",
    "url": "http://allrecipes.com/recipe/237566/ground-beef-pinwheels-with-mushroom-s/"
}