{
    "directions": [
        "Heat olive oil in a large pot over medium heat. Cook and stir onion, celery, and carrots until tender, 6 to 8 minutes. Stir garlic into onion mixture; cook, stirring, until fragrant, about 1 minute. Remove pot from heat.",
        "Heat a large skillet over medium-high heat. Cook and stir ground beef in batches in the hot skillet until browned and crumbly, 5 to 10 minutes. Transfer browned beef to onion mixture in the large pot using a slotted spoon.",
        "Heat onion-beef mixture over medium heat. Stir vegetable juice, beef broth, tomatoes, Italian seasoning, beef bouillon, thyme, cayenne pepper, salt, and black pepper into beef mixture. Bring to a boil, reduce heat to low, cover, and simmer to blend the flavors, at least 1 hour.",
        "Stir corn, kidney beans, cannellini beans, great Northern beans, green beans, peas, lima beans, and okra into beef mixture; bring to a boil, reduce heat to low, and simmer until heated through, about 10 minutes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 large yellow onions, diced",
        "6 stalks celery, cut into 1/2-inch pieces",
        "4 carrots, sliced 1/8-inch thick",
        "3 cloves garlic, chopped",
        "2 1/2 pounds lean ground beef",
        "46 ounces low-sodium vegetable juice (such as V8®)",
        "46 ounces reduced-sodium beef broth",
        "1 (28 ounce) can diced tomatoes",
        "1 tablespoon Italian seasoning",
        "2 cubes beef bouillon",
        "1 teaspoon ground thyme",
        "1/4 teaspoon cayenne pepper",
        "salt and pepper to taste",
        "1 (15.25 ounce) can yellow corn, drained",
        "1 (15.25 ounce) can red kidney beans, drained and rinsed",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1 (15 ounce) can great Northern beans, drained and rinsed",
        "1 (14.5 ounce) can cut green beans, drained",
        "8 ounces frozen peas",
        "8 ounces frozen lima beans",
        "8 ounces frozen sliced okra"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ground Beef and Vegetable Soup",
    "url": "http://allrecipes.com/recipe/234753/ground-beef-and-vegetable-soup/"
}
