{
    "directions": [
        "Place porcini mushrooms in a small bowl. Cover with warm water. Let soak until rehydrated, 20 to 30 minutes. Drain and chop coarsely.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Cook shell pasta in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.",
        "Melt butter in a large pot over medium heat. Add leek and shallot; cook and stir until softened, about 2 minutes. Reduce heat to low; whisk in flour, Worcestershire sauce, and pepper. Pour in 1 cup warmed milk slowly, stirring constantly, until incorporated. Simmer sauce until thickened, about 5 minutes.",
        "Stir chopped mushrooms, tomato, and tofu hot dogs into the sauce; fold in pasta. Stir in Cheddar cheese, Brie cheese, and Asiago cheese until melted.",
        "Pour pasta and cheese mixture into a 9-inch square casserole dish. Drizzle 1/4 cup milk on top if mixture seems too thick. Top with bread crumbs and paprika. Cover dish with aluminum foil.",
        "Bake in the preheated oven until bubbling in the center, about 20 minutes."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms",
        "1 (8 ounce) package small shell pasta",
        "1/4 cup unsalted butter",
        "1 leek, finely chopped",
        "1 small shallot, finely chopped",
        "1/4 cup all-purpose flour",
        "1 teaspoon Worcestershire sauce",
        "1/8 teaspoon ground black pepper",
        "1 cup milk, warmed",
        "1 tomato, chopped",
        "2 tofu hot dogs, sliced 1/8-inch thick",
        "6 ounces grated Cheddar cheese",
        "3 ounces Brie cheese, rind removed and cut into cubes",
        "2 ounces grated Asiago cheese",
        "1/4 cup milk (optional)",
        "1/3 cup bread crumbs",
        "1 teaspoon ground paprika"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Grown-Up Macaroni and Cheese",
    "url": "http://allrecipes.com/recipe/247469/grown-up-macaroni-and-cheese/"
}
