{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Generously butter one 10-cup soufflé dish or six 1 1/4-cup soufflé dishes; sprinkle with Parmesan cheese to coat. (If using 1 1/4-cup dishes, place all 6 on rimmed baking sheet.) Melt butter in heavy large saucepan over medium heat. Add flour, cayenne pepper and nutmeg. Cook without browning until mixture begins to bubble, whisking constantly, about 1 minute. Gradually whisk in milk, then wine. Cook until smooth, thick and beginning to boil, whisking constantly, about 2 minutes. Remove from heat. Mix yolks, salt and pepper in small bowl. Add yolk mixture all at once to sauce and whisk quickly to blend. Fold in 1 1/4 cups Gruyère cheese and 1/4 cup Parmesan cheese (cheeses do not need to melt). Using electric mixer, beat whites in large bowl until stiff but not dry. Fold 1/4 of whites into lukewarm soufflé base to lighten. Fold in remaining whites. Transfer soufflé mixture to prepared dish. Sprinkle with remaining 2 tablespoons Gruyère cheese.",
        "Place soufflé in oven; reduce heat to 375°F. Bake soufflé until puffed, golden and gently set in center, about 40 minutes for large soufflé (or 25 minutes for small soufflés). Using oven mitts, transfer soufflé to platter and serve immediately."
    ],
    "ingredients": [
        "Grated Parmesan cheese",
        "1/4 cup (1/2 stick) butter",
        "5 tablespoons all purpose flour",
        "Pinch of cayenne pepper",
        "Pinch of ground nutmeg",
        "1 1/4 cups whole milk",
        "1/4 cup dry white wine",
        "6 large egg yolks",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 1/4 cups plus 2 tablespoons (packed) coarsely grated Gruyère cheese (about 6 ounces)",
        "1/4 cup finely grated Parmesan cheese",
        "8 large egg whites"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Brunch",
        "Bake",
        "Lunch",
        "Parmesan",
        "Swiss Cheese"
    ],
    "title": "Gruyère and Parmesan Cheese Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/gruyere-and-parmesan-cheese-souffle-103223"
}
