{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.",
        "Cream 1 1/2 cup sugar and unsalted butter in a large bowl until mixture is fluffy and pale yellow, 3 to 5 minutes. Mix 6 egg yolks into the butter mixture, stirring in each one before adding the next. Whisk flour, baking powder, baking soda, and salt in a separate bowl; gradually stir the flour mixture into the egg yolk mixture, alternating with 1 1/2 cup milk, to make a smooth batter. Stir in almond extract.",
        "Beat 6 egg whites with cream of tartar in a bowl with an electric mixer until frothy; gradually beat in 2 tablespoons sugar until the egg whites form stiff peaks. Gently fold the egg white mixture into the batter, retaining as much volume as possible. Pour the cake batter into prepared baking pan.",
        "Bake in preheated oven until a toothpick inserted into the middle of the cake comes out clean, 35 to 45 minutes. Cool cake completely in pan on a rack.",
        "Whisk sweetened condensed milk, evaporated milk, and 2 tablespoons whole milk in a bowl. Use a large fork or skewer to poke holes all over the cake; pour the three-milk mixture over the cake.",
        "Beat cream with 1/4 cup sugar and 1 teaspoon vanilla extract until the whipped cream holds stiff peaks. Top the cake with whipped cream; refrigerate until cold, at least 1 hour. Refrigerate leftovers. Cake is better a day or two after making."
    ],
    "ingredients": [
        "1 1/2 cups white sugar",
        "3/4 cup unsalted butter at room temperature",
        "6 eggs at room temperature, separated",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups whole milk at room temperature",
        "1 teaspoon almond extract",
        "3/4 teaspoon cream of tartar",
        "2 tablespoons white sugar",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 fluid ounce) can evaporated milk",
        "2 tablespoons whole milk",
        "1 pint heavy whipping cream",
        "1/4 cup white sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "G's Tres Leches Cake",
    "url": "http://allrecipes.com/recipe/221909/gs-tres-leches-cake/"
}
