{
    "directions": [
        "To make guacamole, sliced avocados in half, lengthwise. Remove the pit and discard. Scoop out the avocado flesh with a spoon into a bowl.",
        "Add juices, chili powder, salsa and salt and mash with a fork until nicely chunky.",
        "Cover with plastic and set aside. (If you want to make the guacamole an hour or so ahead of time, you can keep it fresh in its bowl in the refrigerator by pressing plastic wrap onto the surface of the guacamole so that no air reaches the avocado, which is what makes it turn brown.)",
        "In a bowl, combine garlic, salt, pepper, cumin and paprika until thoroughly blended.",
        "Brush each patty on both sides with olive and sprinkle with the seasoning blend on both sides.",
        "Using a skillet or grill pan, cook patties over medium-high heat, covered, about 5 to 6 minutes per side, until no pink remains. If you're adding cheese, do so for about the last 1 minute of cooking.",
        "Brush each bun on both sides with melted butter and warm in another skillet over medium-high heat for about 15 seconds per side, just until toasty.",
        "Place patties on each bun bottom, top with guacamole and other desired trimmings. Serve with a little salsa on the side."
    ],
    "ingredients": [
        "8 Ball Park® Hamburger Buns",
        "2 tablespoons extra virgin olive oil",
        "Burgers:",
        "8 ground turkey breast patties",
        "3 teaspoons garlic granules",
        "1 teaspoon kosher salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "1 teaspoon sweet paprika",
        "1 tablespoon extra virgin olive oil",
        "Guacamole:",
        "4 ripe avocados",
        "1/4 cup finely chopped green onion",
        "1/2 lemon, juiced",
        "1/2 lime, juiced",
        "1 teaspoon chili powder",
        "2 tablespoons favorite Mexican salsa",
        "kosher salt to taste",
        "Trimmings: as desired, such as mayo, lettuce, tomato, onion and pickles"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Guacamole Turkey Burger",
    "url": "http://allrecipes.com/recipe/256906/guacamole-turkey-burger/"
}
