{
    "directions": [
        "1. Prepare the dipping sauce: If you are using powdered wasabi, place it in a mixing bowl and add 1 tablespoon of warm water. Stir to form a paste and let stand for about 5 minutes. If you are using wasabi paste, place it in a mixing bowl. Grate the ginger on a fine grater into the bowl; you should have about 1 tablespoon. Cut the lemon in half and cut a thin slice off one half. Cut the slice in quarters, remove any seeds, and set the lemon quarters aside for garnishing the sauce. Squeeze the juice from the remaining lemon into the bowl, squeezing it through your fingers to catch any seeds. Add the soy sauce, scallion, and chile and stir to mix well. Divide the sauce among 4 small bowls. Float a quarter lemon slice in each bowl. The dipping sauce can be prepared up to 1 hour ahead.",
        "2. Prepare the tuna: Place the tuna steaks on a large plate and thickly crust them with cracked peppercorns, pressing the pepper onto the fish on both sides and the edges. Generously season the tuna with Old Bay seasoning and salt. Place the olive oil in a shallow bowl.",
        "3. Set up the grill for direct grilling and preheat it to high.",
        "4. When ready to cook, brush and oil the grill grate. Dip each piece of tuna in the olive oil on both sides, then arrange it on the hot grate. The dripping oil may and should cause flare-ups—it's supposed to. The flames will help sear the crust. Grill the tuna until it is dark and crusty on the outside but still very rare inside, 2 to 3 minutes per side, turning with tongs. When done the tuna should feel quite soft when poked.",
        "5. Transfer the grilled tuna steaks to a cutting board and cut them into 1/4-inch slices. Cut down through the steaks, holding the blade perpendicular to the cutting board. Each slice will have a dark crusty exterior and a blood-rare center. Fan out the slices on a platter or plates. Garnish the tuna with lemon or lime wedges and serve the bowls of dipping sauce alongside."
    ],
    "ingredients": [
        "1 tablespoon wasabi powder, or 1 tablespoon wasabi paste",
        "1 piece (2 inches) fresh ginger, peeled (for 1 tablespoon grated)",
        "1 lemon",
        "3/4 cup soy sauce",
        "1 scallion, both white and green parts, trimmed and sliced crosswise paper-thin",
        "1 hot chile, thinly sliced crosswise (see Note)",
        "4 tuna steaks (each about 1 1/2 inches thick and 6 to 8 ounces)",
        "6 to 8 tablespoons cracked black peppercorns",
        "2 tablespoons Old Bay seasoning",
        "Coarse salt (kosher or sea)",
        "1/2 cup extra-virgin olive oil",
        "Lemon or lime wedges, for serving",
        "None; the beauty of this dish is its spontaneity. However, the dipping sauce can be prepared 1 hour ahead."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Guam \"Volcano\" Tuna (Pepper-Crusted Tuna with Ginger-Wasabi Dipping Sauce)",
    "url": "http://www.epicurious.com/recipes/food/views/guam-volcano-tuna-pepper-crusted-tuna-with-ginger-wasabi-dipping-sauce-359069"
}
