{
    "directions": [
        "Preheat oven to 425°F with rack in middle.",
        "Beat egg with a fork, then put 1 1/2 tablespoons egg in a small bowl with water (1/2 tablespoon) and lightly beat to make egg wash.",
        "Put remaining beaten egg in a food processor with cream cheese, sugar, and vanilla and purée until smooth. Transfer to a small bowl.",
        "Purée guava preserves with lemon juice in cleaned food processor until smooth.",
        "Put a baking sheet in oven to preheat 5 minutes while you prepare pastry.",
        "Roll out pastry on a floured work surface with a floured rolling pin into an 11- by 9 1/2-inch rectangle. Cut rectangle in half crosswise.",
        "Transfer 1 piece of pastry to a sheet of foil. Spread cream cheese mixture in a 3 1/2-inch-wide strip down middle of pastry, leaving 1-inch borders on all sides. Dollop 2 rows of preserves lengthwise on top of cheese mixture, about 1 inch apart.",
        "Fold remaining piece of pastry in half lengthwise and put folded edge nearest you. Leaving a 1-inch border on sides and top of pastry, cut 1 1/2-inch-long slits every 1/2 inch through folded edge to top border.",
        "Brush some of egg wash around filling. Unfold cut pastry and lay over filling. Lightly press edges to seal and brush top of dough with some egg wash. Bake on foil on hot baking sheet until puffed and golden-brown, 25 to 30 minutes. Transfer pastry to a rack to cool completely."
    ],
    "ingredients": [
        "1 large egg",
        "1/2 tablespoon water",
        "6 ounces cream cheese, softened",
        "1 tablespoon sugar",
        "1/4 teaspoon pure vanilla extract",
        "5 ounces guava preserves or paste (about 2/3 cup)",
        "1 tablespoon fresh lemon juice",
        "1 sheet frozen puff pastry (from a 17 1/4-ounce package), thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Egg",
        "Breakfast",
        "Dessert",
        "Bake",
        "Guava",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Guava and Cream Cheese Pastry",
    "url": "http://www.epicurious.com/recipes/food/views/guava-and-cream-cheese-pastry-358001"
}
