{
    "directions": [
        "Toss first 4 ingredients in medium bowl to combine. Cover filling and chill until ready to use, up to 1 day.",
        "Stir sugar, cinnamon, and cayenne pepper in small bowl. Place 1 phyllo sheet on work surface; keep remaining sheets covered with plastic wrap and damp towel to prevent drying. Brush phyllo with butter and sprinkle with 11/2 teaspoons sugar mixture. Repeat 2 more times to make 3 layers. Cut rectangle in half crosswise, making two 6x8-inch stacks. Place scant 1/3 cup guava filling in center of each stack. Gather sheets around filling to form pouch. Brush pouches with butter. Transfer to small baking sheet. Repeat with remaining ingredients to make 6 pouches total. Sprinkle with some of remaining sugar mixture. (Can be made 1 day ahead. Cover with plastic and refrigerate.)",
        "Preheat oven to 350°F. Bake phyllo pouches uncovered until golden brown and filling is heated through, about 20 minutes. Transfer to plates. Spoon syrup alongside; serve phyllo pouches warm.",
        "*A firm block of concentrated fruit available at some supermarkets, at Latin markets, and at cafecubano.com."
    ],
    "ingredients": [
        "1 cup 1/4- to 1/3-inch cubes guava paste* (about 7 ounces)",
        "1 cup 1/4- to 1/3-inch cubes Manchego cheese (about 4 ounces)",
        "1/2 cup sliced almonds, toasted",
        "1/2 teaspoon vanilla extract",
        "9 tablespoons sugar",
        "1 tablespoon ground cinnamon",
        "3/4 teaspoon cayenne pepper",
        "9 12x8-inch sheets fresh phyllo pastry or frozen, thawed",
        "1/2 cup (1 stick) unsalted butter, melted",
        "Passion Fruit Syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dessert",
        "Bake",
        "Almond",
        "Summer",
        "Guava",
        "Passion Fruit",
        "Phyllo/Puff Pastry Dough",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Guava and Manchego Phyllo Pouches with Passion Fruit Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/guava-and-manchego-phyllo-pouches-with-passion-fruit-syrup-234818"
}
