{
    "directions": [
        "Toss beef cubes with 2 tablespoons vegetable oil in a bowl.",
        "Whisk flour, salt, black pepper, and cayenne pepper in a separate bowl. Dredge beef cubes through flour mixture until evenly coated.",
        "Heat 1/4 cup vegetable oil in a large skillet over medium-high heat; cook and stir coated beef cubes, working in batches, until beef is browned on all sides, 5 to 10 minutes. Transfer browned beef to a Dutch oven or heavy-bottomed pot.",
        "Cook and stir onions and garlic in the same skillet used for browning beef until lightly browned, 5 to 10 minutes.",
        "Stir tomato paste with enough water to partially dilute; pour into onion mixture. Stir to blend. Reduce heat to medium, cover Dutch oven, and simmer for 5 minutes.",
        "Pour half the Irish stout into the onion mixture, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer entire mixture to the browned beef. Pour remaining half of Irish stout into beef mixture; add thyme.",
        "Cover Dutch oven, reduce heat to low, and simmer for 2 hours. Add potatoes and carrots and simmer, stirring every 20 minutes, until potatoes are soft, about 1 hour. Adjust salt as needed; garnish with parsley."
    ],
    "ingredients": [
        "4 pounds boneless beef chuck roast, cut into 11/2-inch cubes",
        "2 tablespoons vegetable oil",
        "1/4 cup all-purpose flour",
        "2 pinches salt and ground black pepper, or to taste",
        "2 pinches cayenne pepper",
        "1/4 cup vegetable oil",
        "2 yellow onions, chopped",
        "4 cloves garlic, crushed",
        "1/4 cup tomato paste",
        "1 teaspoon water, or as needed",
        "3 cups Irish stout beer (such as Guinness®), divided",
        "2 sprigs fresh thyme",
        "4 large potatoes, chopped",
        "2 cups chopped carrot",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Guinness® Irish Stew",
    "url": "http://allrecipes.com/recipe/231751/guinness-irish-stew/"
}
