{
    "directions": [
        "For the shrimp stock: toss the shrimp shells in a large pot and fill with water. Bring the water to a boil, turn off the heat and let sit for at least 15 to 20 minutes, although longer is fine. Strain the shells and discard.",
        "Coat a large, wide pot with olive oil and bring to medium-high heat. Add the andouille and cook for 4 to 5 minutes, or until the sausage starts to brown. Add the peppers, celery, and onion to the pan, season with salt and a pinch crushed red pepper. Cook 7 to 8 minutes or until the mixture has softened and is very aromatic. Toss in the garlic and cook for 2 to 3 more minutes. Add the tomatoes and cayenne. Stir in the rice.",
        "Add 4 cups shrimp stock, bay leaves, and thyme bundle. Season with salt and taste it to make sure you are on the way to something delicious. Cover and cook over medium heat for 25 minutes.",
        "Stir in the shrimp and cook for another 5 to 7 minutes or until the shrimp turn pink. Serve garnished with chopped scallions."
    ],
    "ingredients": [
        "2 pounds medium gulf shrimp, peeled and deveined, shells reserved",
        "Extra-virgin olive oil",
        "1 pound andouille sausage, cut into rounds",
        "2 green peppers, seeded and cut into 1/4-inch dice",
        "3 ribs celery, cut into 1/4-inch dice",
        "1 Spanish onion, cut into 1/4-inch dice",
        "Kosher salt",
        "Pinch crushed red pepper",
        "3 cloves garlic, smashed and finely chopped",
        "1 (28-ounce) can diced tomatoes",
        "1 teaspoon cayenne pepper",
        "2 cups long-grain rice",
        "2 fresh bay leaves",
        "1 bundle fresh thyme",
        "5 scallions, whites and greens thinly sliced, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Shrimp Recipes",
        "Easy Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Jambalaya Recipes",
        "Andouille Sausage",
        "Sausage Recipes"
    ],
    "title": "Gulf Shrimp Jambalaya",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/gulf-shrimp-jambalaya-recipe"
}
