{
    "directions": [
        "Bring a large amount of water to a boil in a large stockpot over high heat. Remove cores from the cabbages with the tip of a paring knife, leaving the heads intact. Place the cabbages into the boiling water, and set aside to soften.",
        "In a large skillet, brown the beef, sausage, and venison in batches over medium-high heat. Drain the meat in a colander. Using a little of the grease from the meat, stir in the onions and garlic; cook until softened and translucent. Stir in the rice, and cook until the rice has begun to brown. When the rice has browned, mix it together with the browned meat, red pepper flakes, and dill in a large bowl; season to taste with salt and pepper.",
        "Remove the heads of cabbage from the hot water. Remove the softened outer leaves, and rinse with cool water. Set the firm, small, inner leaves aside.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter two 9x13-inch casserole dishes.",
        "Lay a cabbage leaf flat on a work surface with the inside of the leaf facing up, and the core-side facing you. Place 1 to 2 tablespoons of the meat mixture on the bottom part of the leaf. Roll the leaf about halfway, then fold in the sides, and finish rolling all of the way. Place into the prepared dish, seam-side down. Repeat with remaining ingredients.",
        "Roughly chop the remaining inner leaves, and sprinkle over the cabbage rolls. Pour the canned tomatoes (with juice) into a bowl and crush by hand into 1/2-inch pieces. Stir in the tomato sauce and chicken broth. Pour this evenly over the rolls, and cover them with aluminum foil.",
        "Bake in preheated oven until the rice has softened, and the juices are bubbling, about 2 hours."
    ],
    "ingredients": [
        "2 large heads cabbage",
        "2 pounds ground beef",
        "1 pound sage pork sausage",
        "1 1/2 pounds lean ground venison or beef",
        "2 tablespoons minced garlic, or to taste",
        "2 large onions, coarsely chopped",
        "2 cups uncooked white rice",
        "1 teaspoon red pepper flakes",
        "2 teaspoons dried dill",
        "Salt and pepper to taste",
        "2 (14.4 ounce) cans whole tomatoes with juice",
        "2 (15 ounce) cans tomato sauce",
        "2 cups chicken broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Guluptsie (Cabbage Rolls)",
    "url": "http://allrecipes.com/recipe/132833/guluptsie-cabbage-rolls/"
}
