{
    "directions": [
        "Heat 1 tablespoon oil in heavy extra-large pot over medium-high heat. Add ham; sauté until browned, about 10 minutes. Transfer to bowl and reserve. Melt butter in same large pot over medium-high heat. Add leeks and celery. Sauté until vegetables are soft, about 8 minutes. Add green onions, parsley, and garlic. Sauté until onions wilt, about 2 minutes. Reduce heat to medium-low. Add filé powder, oregano, and cayenne pepper. Stir 3 minutes. Add collard greens, mustard greens, watercress, spinach, and sugar. Toss to combine. Add 2 cups broth. Cover and cook until all greens are tender, stirring occasionally, about 15 minutes. Remove pot from heat.",
        "Working in batches of 2 cups, puree greens in processor, scraping down sides occasionally. Transfer puree to bowl.",
        "Heat 10 tablespoons oil in same pot over medium-high heat. Add flour; whisk until smooth. Cook until roux is peanut butter color, whisking often, about 7 minutes. Whisk in remaining 8 cups broth and bring to boil, whisking often. Add greens puree, then ham. Simmer gumbo 10 minutes to blend flavors. Season to taste with salt and pepper. (Can be made 1 day ahead. Cool slightly; chill uncovered until cold, then cover and keep chilled. Rewarm over medium heat before serving.)",
        "Mound 1/4 cup warm rice in center of each bowl. Ladle gumbo around rice.",
        "*A powder made from ground sassafras leaves; available in the spice section of some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "11 tablespoons vegetable oil, divided",
        "4 cups 1/2-inch cubes smoked ham (about 22 ounces)",
        "2 tablespoons (1/4 stick) butter",
        "6 cups sliced leeks (white and pale green parts only; from 5 large)",
        "2 cups finely chopped celery",
        "2 cups sliced green onions (about 8)",
        "1 cup chopped fresh Italian parsley",
        "5 large garlic cloves, chopped",
        "3 tablespoons filé powder*",
        "1 tablespoon chopped fresh oregano",
        "3/4 teaspoon cayenne pepper",
        "8 cups sliced collard greens (about 6 ounces)",
        "8 cups sliced mustard greens (about 6 ounces)",
        "1 large bunch watercress, thick stems trimmed (about 4 cups)",
        "4 cups fresh spinach leaves",
        "1/2 teaspoon sugar",
        "10 cups low-salt chicken broth, divided",
        "3/4 cup all purpose flour",
        "Perfect Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Leafy Green",
        "Pork",
        "Rice",
        "Vegetable",
        "Sauté"
    ],
    "title": "Gumbo Z'herbes with Perfect Rice",
    "url": "http://www.epicurious.com/recipes/food/views/gumbo-zherbes-with-perfect-rice-231073"
}
