{
    "directions": [
        "In a kettle blanch the crabs in boiling water for 2 minutes, drain them, and let them cool until they can be handled. Discard the top shells, the aprons, the gills, the sand sacs, and the mouths and reserve the crabs.",
        "In a heavy skillet, preferably cast-iron, melt the shortening over moderately low heat, add the flour, and cook the roux, stirring constantly, for 30 minutes, or until it is the color of cocoa. Stir in the onion and cook the mixture, stirring, until the onion begins to brown. Add the okra and cook the mixture over moderate heat, stirring frequently, until the okra is golden. In a kettle bring 8 cups water to a boil, add the roux mixture, the ham, the tomatoes with the juice, the bell pepper, the garlic paste, the bay leaf, the parsley, the thyme, and the celery leaves, and simmer the mixture, stirring occasionally, for 50 minutes. Stir in the reserved crabs and simmer the gumbo for 5 minutes. Stir in the shrimp and the lump crabmeat, if used, simmer the gumbo for 5 minutes, or until the shrimp are firm, and season it with the cayenne and salt. Discard the bay leaf and serve the gumbo sprinkled with the filé powder."
    ],
    "ingredients": [
        "6 live small hard-shelled crabs or 1/2 pound lump crabmeat, picked over",
        "1/4 cup vegetables shortening",
        "2 rounded tablespoons all-purpose flour",
        "1/4 cup chopped onion",
        "1 pound okra, rinsed, trimmed, and sliced thin",
        "1/2 cup chopped ham",
        "a 14- to 16-ounce can tomatoes including the juice",
        "2 tablespoons finely chopped green bell pepper",
        "2 garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "1 bay leaf",
        "6 parsley sprigs",
        "1 thyme sprig",
        "2 tablespoons chopped celery leaves",
        "3/4 pound medium shrimp, shelled",
        "cayenne to taste",
        "1 tablespoon filé powder (available at some specialty foods shops)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Crab",
        "Shrimp",
        "Fall",
        "Okra",
        "Gourmet"
    ],
    "title": "Gumbo Filé",
    "url": "http://www.epicurious.com/recipes/food/views/gumbo-file-11046"
}
