{
    "directions": [
        "Bring 2 quarts of water to a boil in a 6- to 8-quart wide heavy pot. Add cabbage and simmer, covered, until tender, about 10 minutes. Transfer cabbage with tongs to a colander reserving cooking liquid, then add half of mustard, turnip, and beet greens to cooking liquid. Simmer uncovered, 5 minutes. Transfer greens with tongs to colander with cabbage, then cook remaining greens in same manner and transfer to colander. When greens are cool enough to handle, finely chop.",
        "Add ham hocks to cooking liquid (liquid will not cover them completely) and simmer, covered, 1 hour. Transfer with tongs to a cutting board to cool. Transfer ham broth to a bowl, adding water if necessary to measure 5 cups liquid. Discard skin, bones, and fat and finely chop ham.",
        "Cook onions and garlic in butter in pot over moderate heat, stirring frequently, until golden, about 5 minutes. Add flour and cook, stirring, 3 minutes. Add ham broth in a slow stream, stirring constantly. Add chopped greens, ham, thyme, and minced chile and simmer, uncovered, until greens are tender, about 8 minutes.",
        "Gradually add spinach, stirring until wilted. Stir in parsley, vinegar, and salt. Serve with hot sauce and additional vinegar if desired."
    ],
    "ingredients": [
        "8 cabbage leaves (from 1 large head)",
        "1 lb mustard greens",
        "3/4 lb turnip greens",
        "1/2 lb beet greens (from 1 bunch beets; including stems)",
        "2 smoked ham hocks (1 lb each)",
        "2 medium onions, finely chopped",
        "2 garlic cloves, minced",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1 tablespoon fresh thyme or 1 teaspoon dried thyme",
        "1 to 2 small fresh hot red chiles (2 to 3 inches long), minced, including seeds",
        "10 oz baby spinach",
        "1/4 cup finely chopped fresh parsley",
        "3 tablespoons cider vinegar plus additional for serving",
        "1 teaspoon salt, or to taste",
        "Accompaniments: hot sauce such as Tabasco; corn bread or rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Leafy Green",
        "Pork",
        "Super Bowl",
        "Mardi Gras",
        "Ham",
        "Spinach",
        "Turnip",
        "Winter",
        "Mustard Greens",
        "Gourmet"
    ],
    "title": "Gumbo Z'herbes",
    "url": "http://www.epicurious.com/recipes/food/views/gumbo-zherbes-109112"
}
