{
    "directions": [
        "Place chicken breasts on a solid, level surface. Pound with a meat tenderizer until 1/2-inch thick.",
        "Mix 2 tablespoons oyster sauce, 1 tablespoon cooking oil, 1 tablespoon sugar, 2 cloves minced garlic, and lemon grass together in a bowl. Rub marinade over chicken.",
        "Cook chicken in a cast iron or heavy skillet on stovetop over medium-high heat for 2 minutes. Turn chicken, reduce heat to low, cover skillet with a lid and cook until chicken is no longer pink in the center, 4 to 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).Transfer chicken to a cutting board and cover with aluminum foil to keep warm.",
        "(The chicken can also be cooked in a countertop induction oven. Place chicken on the grill pan and cook chicken in the induction oven on the medium-high grill setting for 1 minute. Turn chicken, reduce heat to low, cover chicken with aluminum foil, and cook until chicken is no longer pink in the center, about 4 minutes.)",
        "Combine 1/4 cup chicken broth, red bell pepper, 2 tablespoons oyster sauce, ginger, 3 cloves garlic, tamarind paste, vinegar, 1 tablespoon sugar, and fish sauce in a food processor; blend into a smooth chile sauce.",
        "Heat a large skillet over medium-high heat. Pour in chile sauce; bring to a gentle boil, about 1 minute. Remove skillet from heat and pour sauce into a bowl.",
        "Heat remaining 1 tablespoon cooking oil in the skillet over medium-high heat. Add shallot and 2 cloves minced garlic; cook and stir until shallots are wilted and translucent, 3 to 5 minutes. Pour in 1 3/4 cup chicken broth; bring to a boil. Stir in rice, red chile pepper, and white pepper. Reduce heat and cover; cook until most of the broth is absorbed, about 15 minutes.",
        "Slice cooked chicken and place over rice and cover. Reduce heat to very low and let cook, 3 to 5 minutes.",
        "Garnish rice and chicken with cucumber, green onion, and cilantro. Pour chile sauce on top."
    ],
    "ingredients": [
        "1 pound skinless, boneless chicken breasts",
        "Marinade:",
        "2 tablespoons oyster sauce",
        "1 tablespoon cooking oil",
        "1 tablespoon white sugar",
        "2 cloves garlic, minced",
        "1 stalk lemon grass, tough outer stalks removed and inner stalks minced",
        "Chile Ginger Sauce:",
        "1/4 cup chicken broth",
        "1/4 red bell pepper",
        "2 tablespoons oyster sauce",
        "1 (1 inch) piece fresh ginger, peeled",
        "3 cloves garlic, peeled",
        "1 tablespoon tamarind paste",
        "1 tablespoon white vinegar",
        "1 tablespoon white sugar",
        "1 1/2 teaspoons fish sauce",
        "1 tablespoon cooking oil",
        "1 shallot, minced",
        "2 cloves garlic, minced",
        "1 3/4 cups chicken broth",
        "1 cup white rice",
        "1 red chile pepper, or more to taste",
        "1/4 teaspoon ground white pepper",
        "1/4 cucumber, cut into matchstick-size pieces",
        "1 green onion, sliced",
        "1/4 cup chopped cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jackie's Lemongrass Ginger Chile Chicken and Rice",
    "url": "http://allrecipes.com/recipe/255318/jackies-lemongrass-ginger-chile-chic/"
}
