{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C). (If using a countertop induction oven, use \"Auto-Cook\" option 2. Choose setting and enter fish weight.)",
        "Pour 1 tablespoon olive oil over fingerling potatoes in the bowl. Season with 1 teaspoon garlic powder, salt, and pepper; toss to combine.",
        "Rub 1 1/2 teaspoon olive oil over each salmon fillet. Season each with 1 teaspoon seafood seasoning. Arrange salmon, skin-side up, in center of a cast iron skillet or baking dish. (Place salmon on the grill pan if using countertop induction oven.)",
        "Bake in the preheated oven until bottom of salmon is lightly browned, 4 to 5 minutes. Flip salmon and continue cooking until fish flakes easily with a fork, 10 to 15 minutes. (For countertop induction oven, cook on medium-high grill setting for 1 1/2 minutes with skin side up. Flip and grill salmon until fish flakes easily with a fork, 2 1/2 to 3 minutes more.)",
        "Heat cast iron skillet over medium-high heat; cook and stir potatoes until browned and cooked through, 15 to 20 minutes.",
        "Combine remaining 1 teaspoon garlic powder, butter, thyme, and sage in a small microwave-safe bowl. Heat in the microwave until butter is melted, 20 to 30 seconds. Mix well. Pour over cooked potatoes.",
        "Whisk 1 tablespoon olive oil and lemon juice together in a bowl until dressing is well mixed. Toss microgreens and dressing together in a bowl.",
        "Place salmon on serving plates; garnish with micro greens. Serve potatoes alongside."
    ],
    "ingredients": [
        "2 tablespoons olive oil, divided, or as needed",
        "1 pound fingerling potatoes",
        "2 teaspoons garlic powder, divided",
        "salt and ground black pepper to taste",
        "2 (6 ounce) skin-on salmon fillets",
        "2 teaspoons seafood seasoning (such as Old Bay®), or to taste",
        "1/4 cup butter, at room temperature",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon olive oil, or to taste",
        "1/2 lemon, juiced, or to taste",
        "1 package microgreens"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jacob's Grilled Cajun Salmon with Roasted Fingerling Potatoes",
    "url": "http://allrecipes.com/recipe/255321/jacobs-grilled-cajun-salmon-with-roa/"
}
