{
    "directions": [
        "Scrub the potatoes and put them, whole, in a saucepan with water to cover by 1/2 inch. Bring the water to a boil, reduce the heat, and cook the potatoes gently until they are just tender and can be pierced with a sharp knife. Drain immediately and let cool slightly. (Scrape the skin from the cooked potatoes, if you want, as soon as they can be handled. For a decorative look with fingerlings, scrape off only a band of skin, about 1/2 inch thick, all around the long sides of the potato.)",
        "Heat 2 tablespoons of the olive oil in a small saute pan. When hot, add the scallions and the onion, toss to coat well, and cook for about a minute over medium-high heat. Add the garlic, toss to mix, and cook for just a few moments, then remove the pan from the heat.",
        "Slice the potatoes while still warm, cutting them crosswise into 1/2-inch sections. Put the pieces in a large mixing bowl, pour the wine and 3 or 4 tablespoons of olive oil over them, and toss gently to distribute. Add the warm vegetables from the pan, mustard, chives, chopped herbs, salt, and pepper, and gently fold all together, mixing well but not crushing the potatoes. Taste the salad and add more seasonings as you like.",
        "Serve the potatoes warm (no colder than room temperature). Arrange the large radicchio leaves, if you have them, in a close circle on the serving platter, with their curved insides up, to form a rough bowl. Spoon the potato salad inside the leaves, sprinkle chopped egg around the edges, and parsley over the top."
    ],
    "ingredients": [
        "2 pounds fingerling potatoes or other small waxy potatoes",
        "1/2 cup or so extra-virgin olive oil",
        "1/2 cup 1/4-inch slices of scallion, green and white parts",
        "1/2 cup chopped onion",
        "3 cloves garlic, mashed and coarsely chopped (1 1/2 tsp)",
        "1/3 cup white wine",
        "1 1/2 tablespoons Dijon-style mustard",
        "2 to 3 tablespoons chopped chives",
        "2 tablespoons or more coarsely chopped fresh green or purple basil, fresh tarragon, or parsley",
        "1 teaspoon kosher salt, plus more if needed",
        "1/2 teaspoon freshly cracked black pepper (coarse), plus more if needed",
        "Large radicchio leaves, about 6, from the outside of the head",
        "1 or 2 hard-boiled eggs, coarsely chopped",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Wine",
        "Egg",
        "Mustard",
        "Olive",
        "Onion",
        "Potato",
        "Side",
        "Fourth of July",
        "Picnic",
        "Backyard BBQ",
        "Lunch",
        "Basil",
        "Family Reunion",
        "Tarragon",
        "Parsley",
        "Boil",
        "Radicchio",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Jacques's French Potato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/jacquess-french-potato-salad-358334"
}
