{
    "directions": [
        "Cut off most of the fatty flap of neck skin and reserve. Insert a sharp knife into 1 breast near the shoulder joint and slice — in a semicircle — around the wishbone. Slide your finger in back of wishbone and pry it out.",
        "To remove the legs, lift the duck by one leg and cut through the skin all around the thigh, including the meaty piece along the backbone, called the \"oyster.\" Grasp the leg at the knee and pull back the thigh, to expose the joint. Cut through it and pull the leg off the carcass in 1 piece. Repeat to remove the other leg. Cut the drumsticks from the thigh pieces.",
        "To remove the breast halves, slice along both sides of the breastbone. Lay the duck on its side, and cut through the upper shoulder joint. Hold the carcass down by the neck with one hand, grasp the shoulder section with the other, and pull off the entire breast half, in 1 piece. Repeat on the other side. Pull out the 2 slim meaty filets that remain on either side of the breastbone.",
        "Chop off the wing tips. Cut around the wing on 1 breast piece to free it from the breastbone; separate the largest wing joint from the other 2. Repeat on the other side.",
        "You should now have 12 pieces to put in the pan: 2 large breast pieces, 2 thighs, 2 drumsticks, 2 small breast filets, and 4 wing pieces.",
        "Finally, trim any loose, fatty flaps of skin from the carcass, the breast, or the leg pieces.",
        "Set the pan over moderate heat. Slice the reserved neck skin into 3 or 4 strips and put them in the pan to begin rendering fat. Season the duck pieces with 1/2 teaspoon of the salt and the 1/4 teaspoon pepper. When there's enough fat to film the pan bottom, lay in all the pieces, skin side down (you can push aside the strips of neck skin, but leave them in the pan).",
        "Raise the heat to medium-high, and cook skin side down and uncovered. The duck skin will shrink and color, and lots of fat will accumulate in the pan. Check the underside of the pieces once or twice t make sure they are not burning; lower the heat slightly if necessary. Fry until the skin on all the pieces is well browned and quite crisp; the whole process should take 20 to 25 minutes.",
        "Turn the heat down to low. Leave the duck pieces on their skin — they should be half submerged in fat — and strew the parsnip pieces, shallots, and garlic cloves all around them in the pan. Add the rosemary and bay leaves, and sprinkle over 1/4 teaspoon of salt. Cover the pan, turn down the heat to low, and cook for 30 minutes. Check occasionally to make sure that the duck is gently steaming; adjust the heat as necessary.",
        "When the duck and vegetables are tender — pierce with a sharp knife to check — turn off the heat. Immediately lift the duck and vegetable pieces from the pan with the spoon or skimmer, allowing the fat to drain, and arrange on a serving platter.",
        "Pour off the clear duck fat from the pan — you will have 1 1/2 cups or so — and save for other uses. Add 1 cup of water to the pan, bring to a boil, scraping with a wooden spatula to melt all the solidified juice, and pour over the duck. Scatter chopped parsley over and serve.",
        "A Côtes du Rhône, Syrah, or Grenache-type wine would be good with this duck."
    ],
    "ingredients": [
        "1 duck, 5 to 5 1/2 pounds, defrosted if frozen, giblets removed",
        "3/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "3 large parsnips (about 1 1/2 pounds total), peeled, ends trimmed, sliced into 1 1/2-inch pieces",
        "2 cups large whole shallots, peeled (about 10 ounces unpeeled)",
        "2 heads garlic, cloves (about 30), separated but unpeeled",
        "2 sprigs fresh rosemary",
        "2 bay leaves",
        "chopped fresh parsley, for garnish",
        "Special equipment: A large sauté pan or heavy-bottomed saucepan (12-inch diameter or larger), nonstick preferred, with a tight-fitting cover",
        "A large perforated spoon or skimmer",
        "A large serving platter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Vegetable",
        "Fry",
        "Sauté",
        "Dinner",
        "Parsnip",
        "Fall",
        "Shallot",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Jacques's Skillet Duck with Parsnips and Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/jacquess-skillet-duck-with-parsnips-and-shallots-105471"
}
