{
    "directions": [
        "A small frying pan; a shallow- sided heavy aluminum or copper roasting pan or heavy cast-iron skillet, just large enough to hold the trussed chicken; a 1-quart glass measuring cup or deep bowl; cotton kitchen twine; a basting brush; a board or platter for resting and carving.",
        "Preheat oven to 425°F.",
        "Heat the butter and olive oil in the frying pan over medium heat. When hot, add the shallots, parsley, savory, salt, and pepper, stirring well and tossing in the pan. Cook for about a minute, just until the shallots begin to soften. Scrape the mixture on a plate to cool.",
        "Remove any lumps of fat from inside the cavity near the tail.",
        "To make carving easier, remove the wishbone. Lift the flap of neck skin and insert a thin, sharp knife into each end of the breast; then slice diagonally along both sides of the wishbone. Use your finger and thumb to loosen the bone, pry it out at the top, and pull it down. Try to remove it whole—if it breaks, carefully wiggle out the pieces. Cut the wings at the \"elbow\" joint, leaving only the meaty section attached to the shoulder.",
        "Place the chicken on its back. To loosen the breast skin, lift the neck flap and work your fingers between the skin and the flesh, taking care not to puncture the skin. Slide your fingers down the breast and to either side along the legs, especially the thighs.",
        "Stand the chicken on its tail end in the measuring cup or bowl; hook the wing sections over the rim, to keep the bird upright. Hold the neck flap away from the breast and stuff the cooled herb mixture down between the skin and the flesh, pushing it gently to the sides and bottom. Lay the chicken on its back, tuck the neck flap underneath, and smooth the skin, to distribute the stuffing evenly over the entire breast.",
        "Sprinkle 1/4 teaspoon salt all over the chicken. Grease the center of the roasting pan with a small amount of butter or a dash of oil to prevent sticking (or place a small piece of oiled parchment paper in pan bottom). Set the chicken on its side in the greased pan and place in the oven.",
        "Roast for 25 minutes for a 3 1/2-pound chicken (3 or 4 minutes longer for a 4-pound bird), then turn the chicken onto its other side, grasping it with kitchen tongs or towels. The first side on which it rested will be deeply colored; be careful not to tear the skin when turning. Roast for another 25 to 28 minutes, depending on size, then turn the chicken breast-side up; baste with the pan juices. Roast for 10 minutes and baste once again during this final cooking. Test the chicken for doneness; return to the oven for a few minutes if necessary.",
        "Remove the chicken to a cutting board; place it on one side or breast down, so the juices flow into the breast meat, and let rest for 15 minutes.",
        "Make the deglazing sauce in the roasting pan. Drizzle about half the pan sauce over the carved pieces and serve, passing the rest of the sauce."
    ],
    "ingredients": [
        "1 chicken, 3 1/2 to 4 pounds",
        "1 tablespoon unsalted butter",
        "1 teaspoon virgin olive oil",
        "1/2 cup minced shallots (4 or more large shallots)",
        "4 tablespoons chopped fresh parsley",
        "1 tablespoon finely chopped fresh savory",
        "1/8 teaspoon salt",
        "1/8 teaspoon ground pepper",
        "1/4 teaspoon salt for sprinkling on the chicken",
        "Butter or vegetable oil for the roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Roast",
        "Fall",
        "Healthy",
        "Parsley",
        "Gourmet"
    ],
    "title": "Jacques's Savory-Stuffed Roast Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/jacquess-savory-stuffed-roast-chicken-102263"
}
