{
    "directions": [
        "To make harissa paste: Heat a dry skillet over high heat and add coriander, caraway and cumin seeds. Shake pan gently until spices become fragrant, about 2 minutes. Remove pan from heat and pour seeds into mortar and grind with pestle to a fine powder. Add garlic, salt, paprika and dried red pepper flakes, mashing and stirring until garlic is incorporated with the spices. Mixture will be dry and crumbly. Add enough of the 2 tablespoons extra-virgin olive oil until you have a thick paste. Use fewer pepper flakes if you prefer less heat. Set aside.",
        "Pour 2 tablespoons olive oil into a large pot and add minced onions and garlic. Cook slowly over low heat until onions are translucent, about 10 minutes. Push onions aside in the pot, and stir in the anchovies.  Cook anchovies until they soften, mashing them with the back of a wooden spoon until they dissolve. Stir together with the onion and garlic mixture.",
        "Add the butternut squash, carrots, bell pepper, frozen peas and a pinch of salt. Stir and cook over medium heat for about 5 minutes. Pour in the stock. Bring to a simmer and cook for about a minute.",
        "Stir in the drained fava beans, diced tomatoes, tomato paste, bay leaf and harissa paste (from step 1). Add brown sugar and pomegranate molasses. Bring back to a simmer, then reduce heat to low and cook uncovered for about 1 1/2 hours. The long, slow cooking time allows the flavors to deepen.",
        "Just before serving, stir in the chopped parsley. Top with the mint, if you like."
    ],
    "ingredients": [
        "Harissa Paste:",
        "1 teaspoon coriander seeds",
        "1 teaspoon caraway seeds",
        "1/2 teaspoon cumin seeds",
        "2 cloves garlic",
        "1 pinch coarse sea salt",
        "2 tablespoons sweet paprika",
        "2 tablespoons dried red pepper flakes",
        "2 tablespoons extra-virgin olive oil, or as needed",
        "2 tablespoons olive oil",
        "1 medium onion, minced",
        "2 cloves garlic, minced",
        "4 anchovy fillets, chopped (optional)",
        "2 cups diced peeled butternut squash",
        "2 carrots, chopped",
        "1/2 red bell pepper, diced",
        "1 cup frozen peas",
        "1 pinch salt",
        "2 cups vegetable broth",
        "2 (14.5 ounce) cans fava beans, drained",
        "1 (14 ounce) can canned tomatoes, diced",
        "2 tablespoons tomato paste",
        "1 bay leaf",
        "1 teaspoon brown sugar",
        "3 tablespoons pomegranate molasses",
        "1 cup chopped fresh flat-leaf parsley",
        "1/4 cup chopped fresh mint (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jacy's Middle-Eastern Fava Bean Stew",
    "url": "http://allrecipes.com/recipe/162810/jacys-middle-eastern-fava-bean-stew/"
}
