{
    "directions": [
        "In a very large bowl, combine 7 cups of flour, cheese, jalapenos, 7 tablespoons sugar and the salt; mix well.",
        "In a separate bowl, combine the water, yeast and remaining 1 tablespoon sugar. Let sit about 10 minutes; stir until all yeast is dissolved.",
        "Add the oil to the liquid mixture, stirring . Add half of the liquid mixture to the flour mixture. Mix with hands to moisten flour as much as possible. Add remaining liquid mixture to dough and mix until flour is thoroughly incorporated.",
        "Turn onto a lightly floured surface and knead by hand until smooth and elastic to the touch, about 15 minutes, gradually adding only enough additional flour to keep dough from sticking.",
        "Place in a large greased bowl and invert dough so top is greased; cover with a dry towel and let stand in a warm place (90 - 100F) until doubled in size, about 1 hour. Punch down dough.",
        "To Make Bread: Divide dough into 3 equal portions. Form each into a ball, then stretch out dough with both hands and tuck edges under to form a smooth surface. Pop any large air bubbles by pinching them. Form into loaves. (Note: I like to use a rolling pin and roll out dough, which pops all bubbles easily and quickly.) Place in 3 greased 8 1/2 x 4 1/2 inch loaf pans. Cover with towel again and allow to rise until almost doubled in size, about 45 minutes to 1 hour.",
        "Bake at 325 degrees F (165 degrees C) until dark brown and done, about 1 hour, rotating the pans after 25 minutes for more even browning. Remove from pan as soon as bread will easily lift out, after about 5 to 10 minutes. Let cool about 1 hour before slicing."
    ],
    "ingredients": [
        "8 cups all-purpose flour",
        "4 cups shredded Cheddar cheese",
        "3/4 cup minced jalapeno peppers",
        "1/2 cup white sugar",
        "1 1/2 teaspoons salt",
        "2 cups hot water",
        "3 (.25 ounce) packages active dry yeast",
        "4 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jalapeno Cheese Bread",
    "url": "http://allrecipes.com/recipe/6669/jalapeno-cheese-bread/"
}
