{
    "directions": [
        "Combine jalapeño, garlic, cilantro, lime juice, oil, salt, pepper, and cumin in a large resealable bag or bowl. Add steak and toss to coat; if using bowl, wrap with plastic. Marinate at least 30 minutes at room temperature or chill up to overnight in refrigerator, tossing occasionally.",
        "Let steak sit at room temperature 30 minutes before cooking if chilled. Prepare a grill or grill pan for medium-high heat. Remove steak from marinade, scraping off any bits that cling to meat; discard marinade. Grill steak 2–3 minutes per side for medium rare. Let rest 10 minutes before thinly slicing against the grain.",
        "Warm tortillas in a microwave, oven, or over a gas flame. Divide steak among tortillas, then top with salsa, avocado, sour cream, queso fresco, if using, cilantro, and onion. Serve with lime wedges alongside.",
        "Steak can be marinated 1 day ahead; keep chilled."
    ],
    "ingredients": [
        "1 medium jalapeño, thinly sliced",
        "2 garlic cloves, finely chopped",
        "1/4 cup coarsely chopped cilantro",
        "1/4 cup fresh lime juice",
        "1/4 cup olive oil",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "3/4 teaspoon ground cumin",
        "1 pound skirt steak, cut crosswise into 5–6-inch segments",
        "8 (8-inch) corn tortillas",
        "Homemade or store-bought tomatillo salsa (for serving)",
        "1/2 medium avocado, sliced",
        "1/3 cup sour cream, thinned with a tablespoon of water or lime juice",
        "Crumbled queso fresco (optional), cilantro leaves, thinly sliced red onion, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Jalapeño",
        "Lime Juice",
        "Tortillas",
        "Cheese",
        "Lunch",
        "Dinner",
        "Summer",
        "Grill",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Jalapeño and Lime–Marinated Skirt Steak Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/jalapeno-and-lime-marinated-skirt-steak-tacos"
}
