{
    "directions": [
        "Prepare grill.",
        "In a bowl whisk together mustard, honey, garlic paste,lemon juice, jalapeño, and salt and pepper to taste and reserve 1 tablespoon of marinade in a small bowl for basting kebabs.",
        "Add pork to marinade remaining in bowl. Toss pork pieces to coat well and marinate 15 minutes.",
        "Thread pork onto two 10-inch metal skewers and grill on an oiled rack set 5 to 6 inches over glowing coals 4 minutes. Turn kebabs and baste with reserved marinade. Grill kebabs, turning and basting them, 10 to 15 minutes more, or until pork is cooked through and registers 160°F. on a meat thermometer. (Alternatively, kebabs may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.)",
        "Serve kebabs with couscous.",
        "In a small heavy sauce, cook shallot or onion in butter over moderately low heat, stirring, until softened. Add water and bring to a boil.",
        "Stir in couscous, zest and rosemary and cover pan. Remove pan from heat and let stand 5 minutes. Fluff couscous with a fork and stir in walnuts, lemon juice and salt and pepper to taste. Serves 2."
    ],
    "ingredients": [
        "2 tablespoons Dijon mustard",
        "1 tablespoon honey",
        "1 large garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "1 tablespoon fresh lemon juice",
        "1 fresh or pickled jalapeño chili, seeded and minced (wear rubber gloves)",
        "1 pork tenderloin (about 3/4 pound), trimmed and cut crosswise into 1 1/2-inch pieces",
        "Accompaniment if desired: lemon, rosemary, and toasted walnut couscous",
        "Can be prepared in 45 minutes or less.",
        "1/3 cup finely chopped shallot or onion",
        "1 tablespoon butter",
        "1 cup water",
        "2/3 cup couscous",
        "1 teaspoon freshly grated lemon zest",
        "1 1/2 teaspoons minced fresh rosemary leaves or 1/2 teaspoon crumbled dried rosemary",
        "1/4 cup walnuts, toasted lightly and chopped fine",
        "2 teaspoons fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Marinate",
        "Quick & Easy",
        "Backyard BBQ",
        "Lemon",
        "Rosemary",
        "Pork Tenderloin",
        "Walnut",
        "Grill",
        "Grill/Barbecue",
        "Honey",
        "Jalapeño",
        "Couscous",
        "Gourmet"
    ],
    "title": "Jalapeño Honey Mustard Pork Kebabs",
    "url": "http://www.epicurious.com/recipes/food/views/jalapeno-honey-mustard-pork-kebabs-10142"
}
