{
    "directions": [
        "Combine water, butter, honey, and yeast in the bowl of a stand mixer; let stand until yeast activates and foams, about 5 minutes.",
        "Mix flour and 1 1/4 teaspoon salt into yeast mixture on low speed until dough is just combined. Increase the speed to medium and continue kneading until the dough is smooth and begins to pull away from the side of the bowl. Add additional flour if needed, a little a time, until the dough is no longer sticky.",
        "Spray inside of a bowl with cooking spray, place dough in bowl, and turn to coat. Cover bowl with a towel or plastic wrap and place in a warm place until dough doubles in size, about 1 hour.",
        "Mix cream cheese, mozzarella, bacon, and jalapeno pepper together into a separate bowl.",
        "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper or a silicon mat.",
        "Bring water to a boil in a large pot; slowly add baking soda, about 1 tablespoon at a time.",
        "Divide dough into 4 equal pieces on a floured work surface. Roll each piece into a long rope and cut into 1-inch pieces. Roll each piece flat using a rolling pin and fill with a spoonful of cheese mixture; fold dough over filling and pinch ends. Repeat filling the dough until all dough and filling are used.",
        "Boil the pretzel dippers in the water solution, working in batches, about 30 seconds per batch. Remove dippers with a large-slotted spoon and place on the prepared baking sheet, keeping dippers about 2-inches apart. Beat egg and cold water together in a bowl until smooth; brush over each dipper. Sprinkle kosher salt over each dipper.",
        "Bake in the preheated oven until dippers are golden brown, 15 to 18 minutes. Cool dippers on the baking sheet for 5 minutes."
    ],
    "ingredients": [
        "3/4 cup warm water",
        "3 tablespoons unsalted butter, melted",
        "1 tablespoon honey",
        "1 package active dry yeast",
        "2 1/4 cups bread flour, or more as needed",
        "1 1/4 teaspoons kosher salt (such as Diamond Crystal®)",
        "cooking spray",
        "6 ounces cream cheese, softened",
        "1/2 cup shredded mozzarella cheese",
        "5 slices extra-crispy cooked bacon, crumbled",
        "1 jalapeno pepper, diced",
        "10 cups water",
        "3/4 cup baking soda",
        "1 egg",
        "1 tablespoon water",
        "kosher salt (such as Diamond Crystal®) to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jalapeno-Bacon-Stuffed Pretzel Dippers",
    "url": "http://allrecipes.com/recipe/239743/jalapeno-bacon-stuffed-pretzel-dipper/"
}
