{
    "directions": [
        "Prepare a hot fire in a grill. Brush and oil the grill grate.",
        "In a bowl, using a spoon, not your hands, gently mix together the ground chuck and sirloin. Run your hands under cold water and then divide the mixture into 6 equal portions. Shape each portion into a patty about 1 inch thick, being careful not to compact the meat too much. (Check to make sure the patties fit the buns, too.) Season on both sides with salt and pepper. Make a depression in the center of each patty with your thumb. Refrigerate the patties until the grill is ready.",
        "Place the patties, indent side up, and the chilies, skin side down, on the grill directly over the fire. Grill both the patties and the jalapeños, turning once, until they are nicely charred on both sides and the burgers are cooked to your liking, 4 to 5 minutes per side for medium. During the last 2 minutes of cooking, top each patty with a cheese slice, 2 jalapeño halves and 2 bacon slices. Put the buns, cut side down, along the edge of the grill and cover the grill. Cook until the cheese is melted and the buns are lightly toasted.",
        "Place a burger on the bottom half of each bun and place the tops alongside. Set out the barbecue sauce and other condiments for diners to add to their burgers. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Grill Master",
        ", by Fred Thompson (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1 lb. ground chuck",
        "1 lb. ground sirloin",
        "Kosher salt and freshly ground pepper, to taste",
        "6 jalapeño chiles, stemmed, halved lengthwise and seeded",
        "6 cheddar cheese slices",
        "12 thick-cut applewood-smoked bacon slices, fried until crisp",
        "6 hamburger buns, split",
        "Barbecue sauce for serving",
        "Lettuce, tomato slices and onion slices for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Jalapeño-Bacon-Cheddar Burgers",
    "url": "http://www.williams-sonoma.com/recipe/jalapeno-bacon-cheddar-burgers.html"
}
