{
    "directions": [
        "Whisk all ingredients in medium bowl to blend. Season sauce with salt and pepper.",
        "Gently mix all ingredients in large bowl. Form mixture into eight 1/2- to 3/4-inch-thick patties. Place on small baking sheet. Cover and chill at least 2 hours and up to 1 day.",
        "Stir first 5 ingredients in small saucepan over medium heat until coffee is dissolved. Remove from heat. Whisk in butter. Season glaze to taste with salt and pepper.",
        "Prepare barbecue (medium-high heat). Working in batches if necessary, cook bacon in large skillet over medium-high heat until crisp and brown. Transfer bacon to paper towels to drain.",
        "Spray grill rack with nonstick spray. Toast buns until golden, about 2 minutes per side. Transfer buns, cut side up, to plates. Place lettuce on each bun bottom. Grill burgers 5 minutes, basting with glaze. Turn burgers, baste with glaze, and grill until cooked to desired doneness, about 5 minutes longer for medium. Press cheese atop each burger and allow cheese to melt. Place some sauce, then 1 burger on each bun bottom. Top each with 2 slices bacon and desired additional toppings. Cover with bun top. Serve with remaining sauce."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1 cup sour cream",
        "1/2 cup chopped fresh cilantro",
        "6 tablespoons fresh lime juice",
        "4 green onions, finely chopped",
        "2 tablespoons minced seeded jalapeño chile",
        "1/2 teaspoon cayenne pepper",
        "2 pounds ground beef",
        "1 small onion, chopped (about 1 1/4 cups)",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons Worcestershire sauce",
        "1 tablespoon chopped seeded jalapeño chile",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "1/3 cup light corn syrup",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons ketchup",
        "1 teaspoon instant coffee crystals",
        "2 teaspoons (packed) golden brown sugar",
        "3 tablespoons butter",
        "16 bacon slices",
        "Nonstick vegetable oil spray",
        "8 hamburger buns or 3- to 4-inch square focaccia rolls, split horizontally",
        "8 lettuce leaves",
        "2 cups coarsely shredded sharp white cheddar cheese",
        "Assorted additional toppings (such as tomato and grilled onion slices)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Pepper",
        "Fourth of July",
        "Super Bowl",
        "Bacon",
        "Summer",
        "Tailgating",
        "Grill/Barbecue",
        "Jalapeño"
    ],
    "title": "Jalapeño Cheeseburgers with Bacon and Grilled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/jalapeno-cheeseburgers-with-bacon-and-grilled-onions-232193"
}
