{
    "directions": [
        "Heat vegetable oil in a skillet over medium-high heat. Saute jalapeno peppers, garlic, cumin, and red pepper flakes in hot oil until vegetables are tender and fragrant, about 5 minutes; cool completely.",
        "Stir buttermilk and cooled jalapeno mixture together in a large glass or ceramic bowl; add chicken wings and stir to coat wings completely. Cover the bowl with plastic wrap and refrigerate for at least 8 hours or overnight. Drain chicken and discard buttermilk mixture.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Toss chicken wings with olive oil, 2 teaspoons salt, and black pepper in a large bowl. Spread wings out in an even layer on a baking sheet.",
        "Cook chicken in the preheated oven, turning once, until almost cooked through, 20 to 25 minutes. Remove from oven.",
        "Whisk apple juice concentrate, lemon juice, honey, hot pepper sauce, Worcestershire sauce, and remaining 1/4 teaspoon salt together in a large saucepan; bring to a boil and cook until mixture is reduced by half and syrupy, about 20 minutes.",
        "Brush 1/4 cup the apple juice sauce on the chicken wings. Return wings to oven and continue cooking for 1 to 2 minutes. Brush wings again with 1/4 cup apple juice sauce, turn wings, and brush wings with another 1/4 cup apple juice sauce. Broil until chicken wings are deep brown, 1 to 2 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Serve with remaining apple juice sauce."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "2 jalapeno peppers, seeded and finely chopped",
        "2 cloves garlic, minced",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon red pepper flakes",
        "1 pinch ground ginger",
        "2 cups buttermilk",
        "4 1/2 pounds chicken wings, tips discarded",
        "1 tablespoon olive oil",
        "2 1/4 teaspoons salt, divided",
        "1/2 teaspoon ground black pepper",
        "1/2 (12 fluid ounce) can frozen apple juice concentrate (such as Old Orchard®)",
        "1/3 cup lemon juice",
        "1/4 cup honey",
        "1 tablespoon hot pepper sauce (such as Tabasco®)",
        "1 tablespoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jalapeno Apple Hot Wings",
    "url": "http://allrecipes.com/recipe/236286/jalapeno-apple-hot-wings/"
}
