{
    "directions": [
        "1. Place the flour, confectioners' sugar, and salt in the bowl of a food processor. Process for 30 seconds. Add the butter and pulse until the mixture resembles medium-coarse cornmeal. Mix 1 egg yolk with 2 tablespoons ice-cold water, then gradually add it to the pastry mixture, processing after each addition. (Do not allow the mixture to become a ball of dough—it should stay in large, coarse clumps.) Transfer to a mixing bowl. Bring the mixture together in your hands, knead it for 30 seconds on a clean, lightly floured surface, then press it down into a 1/2-inch-thick disc. Wrap it in plastic wrap and chill in the refrigerator for 30 minutes.",
        "2. Thinly roll out the pastry on a lightly floured surface. Stamp out circles using a 4 1/4-inch-diameter (for large tarts) or 3 1/2-inch-diameter (for smaller ones) cookie cutter. Gently lift the circles of dough and ease them into a 6-hole shallow nonstick tart tray (for large tarts) or a 12-hole nonstick muffin tray (for smaller ones). Prick the bases with a fork. Freeze until solid, about 20 minutes.",
        "3. Preheat oven to 375°F. In a small bowl, mix the remaining egg yolk with the milk to make the glaze. Place the oven rack on the top third of the oven. Line the pastries with pieces of parchment paper that are large enough to completely cover the base and sides, then fill with baking beans. Bake for 8 minutes, then remove the paper and beans and brush the sides with the glaze. Return to the oven and bake until just tinged with color, about 5 minutes more.",
        "4. Remove the tarts from the oven. Add 1 heaped tablespoon (for the large tarts) or 2 teaspoons (for the smaller ones) of the preserves to each pastry case. Return to the oven and bake until the preserves are bubbling, about 8 to 10 minutes. Remove and allow to cool in the tin for 10 minutes before transferring to a cake rack to cool completely."
    ],
    "ingredients": [
        "1 1/3 cups all purpose flour",
        "2 tablespoons confectioners' sugar",
        "1 pinch fine-grained salt",
        "5 tablespoons unsalted butter, chilled",
        "2 egg yolks (kept separate from each other)",
        "2 tablespoons milk",
        "8 tablespoons apricot, cherry, strawberry, or rhubarb preserves, stirred until smooth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Jam or Jelly",
        "Cookie",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Jam Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/jam-tarts-240033"
}
