{
    "directions": [
        "Center an oven rack and preheat the oven to 325°F.",
        "In a large bowl, sift together the flour, baking soda, cinnamon, nutmeg, cloves, and salt, then whisk the mixture to ensure that the ingredients are well distributed.",
        "In a small bowl, stir together the jam and the buttermilk.",
        "In the bowl of a stand mixer fitted with the paddle attachment, cream the butter and sugar together on medium-high speed until fluffy, about 5 minutes. As you make the batter, stop the mixer frequently and scrape the paddle and the sides of the bowl with a rubber spatula. Blend in the eggs one at a time, adding the next one as soon as the previous one has disappeared into the batter. With the mixer on low speed, add the flour mixture in three parts, alternating with the buttermilk mixture in two parts, beginning and ending with the flour. After each addition, mix until just barely blended and stop and scrape the bowl. Stop the mixer before the last of the flour has been incorporated and complete the blending by hand with a rubber spatula to ensure you do not overbeat the batter.",
        "Divide the batter evenly into the prepared pans (there will be approximately 1 pound 4 ounces per pan) and smooth the tops. Bake in the middle of the oven until the centers are just barely firm when lightly touched, 32 to 34 minutes. Cool the cakes on a wire rack for 30 minutes before removing them from their pans. Once removed, continue to cool the cakes on the rack, top side up, until they reach room temperature. Leave the parchment paper on until you assemble the cake.",
        "To assemble the cake, place one of the layers, top side up, on a flat plate or a cake board. Using a thin metal spatula, spread a thin layer of caramel ganache (a bit more than 1/2 cup) on top of the cake and out to the edges of the cake. Sprinkle 2 tablespoons of almonds evenly over the ganache. Align the next cake layer, top side up, on top of the first one, and repeat with another thin layer of ganache and almonds. Place the final layer of cake on top of the cake. Frost the top heavily and the sides lightly with the remainder of the ganache. Lightly press the remaining toasted almonds on the sides of cake.",
        "This cake is best stored and served at room temperature. In an airtight container, it keeps for up to 5 days."
    ],
    "ingredients": [
        "Three 8-inch round cake pans, greased and bottoms lined with parchment paper circles",
        "2 3/4 cups (13 3/4 ounces) all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1 teaspoon fine sea salt",
        "1 1/2 cups (17 1/4 ounces) jam, preferably blackberry, raspberry, or apricot",
        "3/4 cup buttermilk, at room temperature",
        "3/4 cup (6 ounces) unsalted butter, at room temperature",
        "1 1/2 cups (10 1/2 ounces) sugar",
        "4 eggs, at room temperature",
        "1 cup (4 ounces) sliced natural almonds, toasted",
        "Caramel Chocolate Ganache"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Condiment",
        "Tree Nut",
        "Almond",
        "Birthday",
        "Party",
        "Jam or Jelly",
        "Advance Prep Required",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Jam Cake with Caramel Chocolate Ganache",
    "url": "http://www.epicurious.com/recipes/food/views/jam-cake-with-caramel-chocolate-ganache-51111800"
}
