{
    "directions": [
        "Prepare the pastry by combining the flour and salt in a bowl. Rub in the butter and shortening until incorporated, and the mixture takes on a sandy appearance. Combine the egg and water, and stir into the flour mixture until a dough forms, then knead for a few turns to bring the dough together. Wrap well, and chill for 3 hours in the refrigerator.",
        "While dough is chilling, peel plantains and cut into thirds. Place into a small saucepan with a little water. Bring to a simmer and steam until tender, 5 to 10 minutes depending on how ripe your plantains are. Once soft, pour out the water, and mash plantains with sugar, vanilla, nutmeg, and red food coloring. Set aside to cool.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Roll dough out on a lightly floured surface to 1/4-inch thick. Cut into circles using a 4 or 5-inch round cookie cutter. Spoon a little of the plantain filling into the center of each circle, then fold in half, to form a half-moon shape. Place the tarts on a baking sheet, brush with beaten egg white, and sprinkle with sugar.",
        "Bake in preheated oven for 20 to 25 minutes until golden brown. Allow tarts to cool to room temperature before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2048&h=1072&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1525083.jpg",
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "¼ cup cold butter, cut into 1/2 inch pieces",
        "3 tablespoons shortening, chilled and diced",
        "1  egg, beaten",
        "1 tablespoon ice-cold water",
        "3  very ripe (black) plantains",
        "¼ cup white sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon grated nutmeg",
        "2 drops red food coloring (optional)",
        "1  egg white, beaten",
        "white sugar for decoration"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jamaican Plantain Tarts",
    "url": "http://allrecipes.com/recipe/130573/jamaican-plantain-tarts/"
}