{
    "directions": [
        "Boil rum and 2 tablespoons water in small saucepan for 3 minutes.",
        "Transfer rum mixture to blender; add vinegar and next 12 ingredients and blend until almost smooth. Transfer 2 tablespoons jerk seasoning to small bowl; mix in ketchup and soy sauce to make sauce. (Jerk seasoning and sauce can be made 1 day ahead; cover separately and refrigerate.)",
        "Arrange chicken in large roasting pan or baking dish. Pour lime juice over; turn to coat. Spoon jerk seasoning over chicken and rub in. Cover and refrigerate at least 4 hours, turning occasionally. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Preheat oven to 350°F or prepare barbecue (medium heat). Remove chicken from jerk seasoning marinade; sprinkle with salt and pepper. If roasting chicken in oven, arrange chicken, skin side up, on rimmed baking sheet. Roast until chicken is cooked through and juices run clear when thickest part of thigh is pierced with fork, about 50 minutes. If grilling chicken, place chicken, skin side down, on grill rack, cover, and grill until chicken is cooked through, turning occasionally and adjusting heat if browning too quickly, about 50 minutes.",
        "Cut each chicken half into pieces and serve with sauce."
    ],
    "ingredients": [
        "3 tablespoons dark rum",
        "2 tablespoons water",
        "1/2 cup malt vinegar",
        "10 green onions, chopped",
        "4 garlic cloves, peeled, chopped",
        "2 tablespoons dried thyme",
        "2 Scotch bonnet chiles or habanero chiles with seeds, chopped",
        "2 tablespoons vegetable oil",
        "4 teaspoons ground allspice",
        "4 teaspoons ground ginger",
        "4 teaspoons ground cinnamon",
        "2 teaspoons ground nutmeg",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "2 teaspoons dark brown sugar",
        "1 cup ketchup",
        "3 tablespoons soy sauce",
        "2 3- to 3 1/2-pound chickens, halved lengthwise, rinsed, patted dry",
        "1/2 cup fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Garlic",
        "Onion",
        "Marinate",
        "Vinegar",
        "Lime",
        "Spice",
        "Hot Pepper",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Jamaican Jerk Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/jamaican-jerk-chicken-234807"
}
