{
    "directions": [
        "Discard stems, seeds, and ribs from 2 chiles and coarsely chop. Coarsely chop remaining chile including seeds (for a less spicy dish, seed half of chile before chopping).",
        "Blend chiles with remaining ingredients except chicken in a food processor until a paste forms. Cut several 1-inch-long slits in each piece of chicken, then rub paste all over chicken, rubbing it into slits. Marinate, covered and chilled, at least 2 hours.",
        "Open vents on bottom of grill and on lid. Light a rounded chimney full of charcoal briquettes (about 100) and divide between 2 sides of grill, leaving a space down middle.",
        "When charcoal turns grayish white (15 to 20 minutes from lighting) and you can hold your hand 5 inches about top rack for 3 to 4 seconds, grill chicken, skin sides down first, on portion of lightly oiled grill rack with no coals underneath, turning occasionally, until cooked through, 20 to 30 minutes.",
        "Preheat all burners on high (until thermostat registers 500°F). Turn off 1 burner and reduce heat on other burner (or burners) to medium. (Thermostat should register 350 to 375°F.) Grill chicken, skin sides down first, on portion of lightly oiled grill rack over unlit burner, covered, turning occasionally, until cooked through, 20 to 30 minutes."
    ],
    "ingredients": [
        "3 fresh Scotch bonnet or habanero chiles",
        "6 scallions, coarsely chopped",
        "1/4 pound shallots (3 meduim), quartered",
        "3 garlic cloves, smashed",
        "1 (1-inch) piece fresh ginger, peeled and chopped",
        "3 tablespoons fresh thyme leaves",
        "2 teaspoons ground allspice",
        "1 1/2 teaspoons black pepper",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground cloves",
        "1/4 cup vegetable oil",
        "8 whole chicken legs (4 1/2 pounds), thighs and drumsticks separated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Ginger",
        "Backyard BBQ",
        "Spice",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Shallot",
        "Gourmet"
    ],
    "title": "Jamaican Jerk Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/jamaican-jerk-chicken-108095"
}
