{
    "directions": [
        "Preheat oven to 350°F. Spray 13x9x2-inch metal pan with nonstick spray. Combine sugar, butter, cocoa, ground coffee, and salt in large metal bowl. Place bowl over saucepan of simmering water and whisk until butter melts and ingredients are blended (texture will be grainy). Remove bowl from over water; cool mixture to lukewarm if necessary. Whisk in eggs and vanilla. Sift flour over and fold in. Mix in pecans.",
        "Spread batter in prepared pan. Bake brownies until tester inserted into center comes out clean, about 25 minutes. Cool brownies in pan.",
        "Place chocolate chips in small bowl. Bring brewed coffee to simmer in small saucepan; pour over chips and stir until melted and smooth. Let ganache stand until cool and beginning to thicken, about 1 hour; spread evenly over brownies. (Can be made 1 day ahead. Cover; let stand at room temperature.) Cut brownies into 15 squares. Top each with 2 ginger strips."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups sugar",
        "15 tablespoons (2 sticks minus 1 tablespoon) unsalted butter",
        "3/4 cup unsweetened cocoa powder",
        "3 tablespoons finely ground Jamaican Blue Mountain coffee beans",
        "1/2 teaspoon salt",
        "3 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/4 cups all purpose flour",
        "3/4 cup pecan pieces",
        "1 cup bittersweet or semisweet chocolate chips (6 ounces)",
        "6 tablespoons freshly brewed Jamaican Blue Mountain coffee",
        "30 thin strips crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Pecan",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Jamaican Coffee Brownies with Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/jamaican-coffee-brownies-with-pecans-234819"
}
