{
    "directions": [
        "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is chewy and the liquid has been absorbed, about 15 minutes. Let the rice stand, covered, for about 5 minutes. Uncover, and allow to cool.",
        "Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch pie dish.",
        "Place the sausage links into a large skillet over medium-high heat, and cook until browned on both sides, 3 to 4 minutes per side. Remove from heat, and cut into 1/4 inch slices; set aside. Melt butter in a large saucepan over medium heat, and whisk in flour. Allow the flour to cook until frothy-looking, about 1 minute; whisk in the milk. Turn the heat down to medium-low, and simmer the sauce while you finish the remaining steps; whisk often. Stir in Cajun seasoning to taste. When sauce has thickened enough to coat the back of a spoon, remove from heat.",
        "In a bowl, toss the chicken meat with liquid smoke flavoring. Mix in the cooked rice, cooked sausage, onion, red bell pepper, garlic, and shrimp until thoroughly combined. Pour in about 3/4 of the white sauce to moisten the filling.",
        "To assemble the pie, trim the sheets of puff pastry to 10x10 inches; lay a sheet in the prepared pie dish. (Square corners will stick out). Fill the bottom crust with the rice mixture, and pour in the remaining 1/4 of the white sauce. Top with the remaining sheet of puff pastry; pinch the edges to seal. Brush the top of the pie with beaten egg.",
        "Bake in the preheated oven until the crust is flaky in the center and golden brown, 20 to 30 minutes."
    ],
    "ingredients": [
        "1/2 cup uncooked white rice",
        "3/4 cup water",
        "2 Italian sausage links",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "2 cups whole milk",
        "3 tablespoons Cajun seasoning, or to taste",
        "1 cup cooked chicken meat, shredded",
        "3 drops liquid smoke flavoring, or to taste",
        "1/2 cup finely chopped onion",
        "1/2 cup chopped red bell pepper",
        "2 cloves garlic, minced, or more to taste",
        "1/2 cup uncooked shrimp - peeled, deveined, and tails removed",
        "2 sheets frozen puff pastry, thawed",
        "1 beaten egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jambalaya Pot Pie",
    "url": "http://allrecipes.com/recipe/216886/jambalaya-pot-pie/"
}
