{
    "directions": [
        "Bring a small pot of water to a boil. Add the carrot and cook 2 minutes. Add the shrimp and cook until they’re just cooked through, 1 to 2 minutes more. Drain and then return them to the pot. Add the corn, edamame, shiitakes, chicken stock, soy sauce, sake, sugar, and 1/2 teaspoon of salt. Set the pot over medium-high heat and bring to a boil. In a small container, stir together the cornstarch and 3 tablespoons of water until smooth. Gradually add the cornstarch mixture to the pot, stirring constantly. Let the stock mixture come to a boil again and cook just until slightly thickened, about 3 minutes. Take the pot off the heat and stir in the sesame oil and pepper to taste; keep warm, covered.",
        "Heat the vegetable oil in a large skillet over medium-high heat until it shimmers. Add the eggs and cook, stirring constantly, until they’re barely cooked, about 30 seconds. Add the rice and cook, stirring often and breaking up the clumps but making sure not to smash the grains, until the rice is heated through and the egg has browned slightly, about 4 minutes. Season with about 1 teaspoon of the salt and pepper to taste.",
        "Divide the fried rice among 4 small bowls and firmly press down on the rice to pack it into the bowls. Overturn the bowls onto 4 large shallow bowls. Remove the bowls to reveal the mounds of rice and pour the sauce over each one. Top with the scallions and serve."
    ],
    "ingredients": [
        "1/4 cup diced (1/4-inch cubes) carrot",
        "12 medium shrimp (about 6 ounces), peeled and deveined, cut crosswise into thirds",
        "1/4 cup fresh or frozen corn kernels",
        "1/4 cup fresh or frozen shelled edamame",
        "1/4 cup diced (1/4-inch pieces) fresh shiitake mushrooms or rehydrated dried shiitakes",
        "2 1/4 cups low-sodium chicken stock",
        "3 tablespoons Japanese soy sauce",
        "3 tablespoons sake (Japanese rice wine)",
        "2 teaspoons granulated sugar",
        "1 1/2 teaspoons kosher salt",
        "3 tablespoons cornstarch",
        "2 teaspoons toasted sesame oil",
        "White or black pepper to taste",
        "1/4 cup vegetable oil",
        "4 large eggs, lightly beaten",
        "6 packed cups cooked short-grain white rice, preferably 1 or 2 days old",
        "1 generous tablespoon thinly sliced scallion greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Rice",
        "Shrimp",
        "Dinner",
        "Mushroom",
        "Egg",
        "Quick & Easy"
    ],
    "title": "Japanese-Style Fried Rice (*Chahan*)",
    "url": "http://www.epicurious.com/recipes/food/views/japanese-style-fried-rice-chahan"
}
