{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 4 (9 inch) round cake pans. Toss together the raisins, coconut and pecans in 1 cup of the flour until coated.  Set aside.",
        "Cream butter and 2 cups sugar until light and fluffy. Beat in yolks one at a time. Sift together remaining 2 cups flour, baking powder, cinnamon, nutmeg and cloves. Add to creamed mixture, alternating with milk, mix until blended. Fold in raisin, pecan and coconut mixture.",
        "In a clean bowl, whip egg whites until stiff peaks develop. Fold into batter until no streaks remain.",
        "Divide batter into four 9 inch baking pans (about 1 1/2 to 2 cups per pan).  Bake in preheated oven for 25 to 30 minutes or until a toothpick inserted in center comes out clean.  Cool in pans 10 minutes, then turn out onto wire racks to finish cooling.",
        "To make the filling:  Mix 2 cups sugar and 1/4 cup flour in a saucepan, add water and stir until dissolved. Chop lemons and oranges into small pieces and add to saucepan. Bring to a boil and cook until thick, about 10 minutes. Add 2 cups coconut. Allow to cool.",
        "Assemble cake with filling between layers, and ending with filling on top."
    ],
    "ingredients": [
        "1 cup butter",
        "2 cups sugar",
        "6 egg yolks",
        "3 cups all-purpose flour",
        "4 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 teaspoon nutmeg",
        "1 teaspoon ground cloves",
        "1 cup milk",
        "2 cups raisins",
        "2 cups flaked coconut",
        "1 cup chopped pecans",
        "6 egg whites",
        "2 cups sugar",
        "1/4 cup all-purpose flour",
        "1 1/2 cups water",
        "2 lemons, peeled and seeded",
        "2 oranges, peeled and seeded",
        "2 cups flaked coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Japanese Fruit Cake II",
    "url": "http://allrecipes.com/recipe/8113/japanese-fruit-cake-ii/"
}
