{
    "directions": [
        "In a saucepan whisk together the soy sauce, the Sherry, the sugar, the gingerroot, the garlic, the salt, and pepper to taste and bring the mixture to a boil over moderate heat. Simmer the mixture for 5 minutes, or until the sugar is dissolved, and let the marinade cool.",
        "On each skewer alternate 3 pieces of chicken with 2 scallion lengths and 2 water chestnuts, skewering the water chestnuts carefully so that they do not split and beginning and ending with the chicken. In a large shallow baking dish arrange the kebabs in one layer, pour the marinade over them, and let the chicken marinate, covered and chilled, turning the kebabs once, for 30 minutes. Arrange the kebabs, reserving the marinade, in one layer on an oiled rack of a broiler pan and broil them under a preheated broiler about 4 inches from the heat, basting them with the marinade for the first 6 minutes, for 10 to 15 minutes, or until the chicken is cooked through. Discard any remaining marinade."
    ],
    "ingredients": [
        "1/2 cup soy sauce (preferably dark Japanese style)",
        "1/2 cup dry Sherry",
        "2 tablespoons sugar",
        "1 tablespoon minced peeled fresh gingerroot",
        "1 garlic clove, minced",
        "1/4 teaspoon salt",
        "12 wooden skewers for skewering the chicken and vegetables",
        "8 skinless boneless chicken thighs, cut into thirty-six 1 1/2-inch pieces",
        "2 bunches of scallions (about 10), the white and pale green parts cut into twenty-four 1 1/2-inch lengths",
        "24 canned whole water chestnuts, rinsed and drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Poultry",
        "Broil",
        "Marinate",
        "Gourmet"
    ],
    "title": "Japanese Chicken, Water Chestnut, and Scallion Yakitori",
    "url": "http://www.epicurious.com/recipes/food/views/japanese-chicken-water-chestnut-and-scallion-yakitori-12161"
}
