{
    "directions": [
        "Rub seasoning blend into both sides of filets and place in a large, resealable plastic bag. In a medium bowl, stir together the soy sauce, rice wine vinegar, sesame oil, allspice, ginger, and garlic. Pour marinade into the bag and shake gently to ensure it coats the meat. Refrigerate filets for at least 3 hours or overnight.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove filets from plastic bag and reserve marinade. Use a paper towel to pat the meat dry. Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Brown the filets on all sides, about 5 minutes. Place filets onto a baking sheet and bake in preheated oven until they reach an internal temperature of 140 degrees F (60 degrees C) for medium, about 10 minutes.",
        "Meanwhile, in a large skillet over medium heat, heat the remaining olive oil. Stir-fry the cabbage, mushrooms, cucumbers, bean sprouts, snow peas, and green onions until tender, about 4 minutes. Stir in the spinach, parsley, and reserved marinade; cook another 5 minutes.",
        "To serve, divide the vegetables between four plates; cut the filets into thick slices and place on top of vegetables."
    ],
    "ingredients": [
        "4 (6 ounce) beef tenderloin filets",
        "2 tablespoons salt-free seasoning blend",
        "2 tablespoons soy sauce",
        "2 tablespoons rice wine vinegar",
        "2 tablespoons sesame oil",
        "2 tablespoons ground allspice",
        "1 tablespoon minced fresh ginger",
        "1 tablespoon minced garlic",
        "2 tablespoons extra virgin olive oil, divided",
        "2 cups shredded napa (Chinese) cabbage",
        "1 cup chopped shiitake mushrooms",
        "1 cup chopped cucumber",
        "1 cup bean sprouts",
        "1/2 cup fresh snow peas, trimmed",
        "1 tablespoon chopped green onions",
        "2 cups chopped fresh spinach leaves",
        "1 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Japanese-Inspired Beef Tenderloin",
    "url": "http://allrecipes.com/recipe/140994/japanese-inspired-beef-tenderloin/"
}
