{
    "directions": [
        "Dissolve the salt and brown sugar in 1/4 cup warm water.  Pour into a large resealable plastic bag with remaining 2 3/4 cups water.  Place pork in bag, seal, and refrigerate overnight.",
        "In a small, microwavable bowl, combine peanut butter, sake, soy sauce, vinegar, honey, peanut oil, chili paste, chili sauce, garlic, ginger root, green onions, and cilantro.  Microwave for 30 seconds to 1 minute to melt peanut butter; mix thoroughly.",
        "Reserve 1/2 to 3/4 cup of this peanut sauce to serve as a sauce for the cooked meat; refrigerate until ready to use. Pour remaining sauce into a resealable plastic bag. Remove pork from brine; discard brine. Rinse pork, pat dry, and place in the bag with the peanut sauce marinade. Refrigerate for 8 hours, or overnight.",
        "Preheat grill for medium heat. Take pork out of peanut sauce marinade; let sit at room temperature for about 20 minutes. Pour marinade in small saucepan.  Heat to a boil, and boil for 3 minutes.  If marinade gets too thick, add a little milk to thin.",
        "Lightly oil grill grate, and arrange tenderloins on grill.  When pork reaches 125 degrees F (50 degrees C), baste with the boiled marinade.  Watch pork carefully after basting so that it doesn't burn.  Use a bbq spatula to roll the pork around while cooking.  Grill pork tenderloins until internal temperature reaches 145 degrees F (63 degrees C); this should take about 15 minutes. Pull off the grill, and let sit for 5 minutes before slicing into thin rounds.",
        "Warm the reserved sauce in the microwave, and place a dollop of the sauce on each plate. Place pork slices on top of sauce to serve."
    ],
    "ingredients": [
        "Brine:",
        "1/4 cup kosher salt",
        "1/4 cup brown sugar",
        "3 cups warm water",
        "2 (3/4 pound) pork tenderloins",
        "Marinade:",
        "1/2 cup chunky peanut butter",
        "1/4 cup sake",
        "2 tablespoons soy sauce",
        "2 tablespoons white wine vinegar",
        "2 tablespoons honey",
        "2 tablespoons peanut oil",
        "2 tablespoons Thai chili paste",
        "2 tablespoons Sriracha chili sauce",
        "4 cloves garlic, finely minced",
        "2 tablespoons fresh ginger root, finely chopped",
        "1/4 cup finely chopped green onions",
        "1/4 cup minced fresh cilantro (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Javanese Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/72335/javanese-pork-tenderloin/"
}
