{
    "directions": [
        "Mix diced apple, cold water, and lemon juice together in a small bowl; soak for 10 minutes. Drain.",
        "Stir cream cheese, brown sugar, cinnamon, nutmeg, and allspice together in a bowl until smooth. Fold the diced apple into the cream cheese mixture.",
        "Spoon the cream cheese mixture onto the center of a sheet of plastic wrap. Use the plastic to shape the cheese mixture into a log, wrap the plastic around the log, and refrigerate until set, about 2 hours.",
        "Cook and stir white sugar in a 3-quart saucepan over medium-high heat until melted, smooth, and taking on an amber color, about 10 minutes; add butter and stir quickly with a whisk until the butter is melted, 1 to 2 minutes. Immediately remove saucepan from heat. Slowly stream heavy cream into the sugar mixture while continually stirring with the whisk to incorporate fully; add sea salt and stir. Transfer the caramel sauce to a glass bowl and set aside to cool.",
        "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.",
        "Roll out pie pastry on a lightly floured surface to about 1/4-inch thick. Cut dough into rectangles about 2 inches long. Arrange dough strips onto the prepared baking sheet. Brush the tops of the dough strips with beaten egg. Sprinkle cinnamon-sugar over the strips.",
        "Bake dough strips in preheated oven until golden brown, 10 to 15 minutes. Cool completely.",
        "Spread pecans into a shallow dish. Unwrap cheese log and roll in the pecans to coat. Place coated log onto a plate and drizzle caramel sauce evenly over the log. Serve with the pie crust chips."
    ],
    "ingredients": [
        "Spread:",
        "1 large Red Delicious apple - peeled, cored, and diced",
        "1 cup cold water",
        "1 tablespoon lemon juice",
        "2 (8 ounce) packages cream cheese, softened",
        "1/4 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "Caramel Sauce:",
        "1 cup white sugar",
        "6 tablespoons unsalted butter, sliced and softened",
        "1/2 cup heavy whipping cream, room temperature",
        "3/4 teaspoon sea salt",
        "Pie Crust Chips:",
        "1 pastry for a 9-inch double-crust pie",
        "1 egg, beaten",
        "1/2 cup cinnamon-sugar",
        "1 cup chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "JD's Apple Pie Cheesecake Log with Salted Caramel Sauce",
    "url": "http://allrecipes.com/recipe/239744/jds-apple-pie-cheesecake-log-with-sa/"
}
