{
    "directions": [
        "In a small bowl, mix together the mayonnaise, 4 cloves of garlic, 1 teaspoon of saffron powder, bread crumbs, and red pepper flakes. Set aside.",
        "Preheat the oven broiler. Arrange the baguette slices on a baking sheet. Place under the broiler for a few minutes to toast. Set aside to cool.",
        "Heat olive oil in a stock pot or Dutch oven over medium heat. Add 4 cloves of garlic, onion, and leek; saute for a few minutes until tender. Add a pinch of saffron and the bay leaf. Pour in the white and red wines, then place the fish in the pan, and pour in enough water to cover the fish just barely. Simmer for about 10 minutes, turning the fish carefully as needed, until the fish flakes easily with a fork.",
        "Remove the fish from the broth with a slotted spoon, and set aside. Pour in the beef broth, and simmer uncovered for about 10 minutes to burn off some of the alcohol, and reduce the broth. Remove the bay leaf, and transfer the broth to a blender. Add the tomato, lemon juice and parsley to the blender. Puree in batches if necessary, and return to the pot.",
        "Whisk the flour and half-and-half into the pot, and set over medium heat. Whisk in about half of the mayonnaise mixture, or to taste. Return fish to the soup, and break into small pieces. Season to taste with salt and pepper, and heat through.",
        "Spread the remaining mayonnaise mixture onto the toasted bread slices, and top with shredded Gruyere cheese. Ladle the soup into serving bowls, and float 1 or 2 slices of toast on the top."
    ],
    "ingredients": [
        "3/4 cup light mayonnaise",
        "4 cloves garlic, crushed",
        "1 teaspoon saffron powder",
        "4 teaspoons plain dry bread crumbs",
        "1 teaspoon red pepper flakes",
        "1/2 French baguette, sliced into 1/4 inch rounds",
        "1 tablespoon olive oil",
        "4 cloves garlic, minced",
        "1/2 medium onion, chopped",
        "1 leek, bulb only, chopped",
        "1 pinch saffron powder",
        "1 bay leaf",
        "3/4 cup white wine",
        "1/3 cup red wine",
        "4 ounces cod fillets",
        "1 cup water",
        "1 cup beef broth",
        "1 roma (plum) tomato, seeded and chopped",
        "1 1/2 teaspoons lemon juice",
        "3 tablespoons chopped fresh parsley, divided",
        "1 tablespoon all-purpose flour",
        "1/2 cup half-and-half cream",
        "1 cup grated Gruyere cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jean-Pierre's Cod Fish Soup",
    "url": "http://allrecipes.com/recipe/75075/jean-pierres-cod-fish-soup/"
}
