{
    "directions": [
        "In the bowl of a mixer, combine 4 cups flour and salt. Add the yeast. In a small bowl, combine the milk and 2 tablespoons sugar. Add with the remaining milk to the flour. (If using dry yeast, mix the yeast with 2 tablespoons of the milk and 2 tablespoons sugar and let sit until foamy, about 5 to 10 minutes and add to the flour.)",
        "Add the eggs and butter to the flour mixture. Begin to mix the ingredients into a soft, but not sticky, dough. Add a little extra milk, 1 tablespoon at a time. Work in extra flour, 1 tablespoon at a time. Turn the dough out onto a lightly floured surface and knead until smooth and elastic. (You can do this in a mixer fitted with a dough hook.) Transfer the dough to a lightly oiled bowl, cover, and let rise until doubled in size, about 2 hours.",
        "Punch down the risen dough. Turn out onto a lightly floured surface and knead for a few seconds. With a lightly floured rolling pin, gradually roll out the dough to about 1/2-inch thick. When rolling dough, let it rest periodically to relax. Cut out into 3 to 4-inch rounds with a lightly floured biscuit cutter. Re-roll the scraps to make more rounds. Place the doughnuts on lightly floured baking sheets, spacing them apart, and cover lightly with a dry towel. Let rise in a warm spot until doubled in size, about 20 minutes.",
        "Transfer the risen doughnuts to a heavy pot filled 3-inches high with vegetable oil at 350 degrees F. Fry the doughnuts, a few at a time, until golden and puffed, turning frequently, 5 to 7 minutes.",
        "Lift the doughnuts from the oil using a slotted spoon and roll on a plate lined with granulated sugar and cinnamon mixed together. Let cool slightly and fill a pastry bag, fitted with a 1/2-inch round tip with jelly preserves. Insert the tip into the end of each doughnut and pipe approximately 1 to 2 teaspoons preserves into them and serve."
    ],
    "ingredients": [
        "4 to 4 1/2 cup white bread flour, plus more for dusting",
        "1 teaspoon salt",
        "2/3 ounce (.6 ounce) cake fresh yeast or 1 envelope dry active yeast (2 1/2 teaspoons)",
        "1 cup lukewarm milk",
        "2 tablespoons sugar, plus more for dusting",
        "2 large eggs, beaten",
        "2 tablespoons unsalted butter, melted and cooled",
        "1/2 cup preserves of choice",
        "Vegetable oil, for frying",
        "Cinnamon and sugar, for rolling doughnuts"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit Dessert Recipes",
        "Dessert",
        "Fruit",
        "Doughnut Recipes",
        "Holiday",
        "Egg Recipes",
        "Dairy Recipes",
        "Sugar",
        "Deep-Frying"
    ],
    "title": "Jelly Doughnuts",
    "url": "http://www.foodnetwork.com/recipes/jelly-doughnuts-recipe"
}
