{
    "directions": [
        "In a 3-quart saucepan simmer broth, Sherry, soy sauce, gingerroot, scallions, star anise, and salt, covered, 25 minutes. Add chicken and cook at a bare simmer, uncovered, 15 minutes. Cool chicken in liquid, uncovered, 1 hour.",
        "Transfer chicken to a bowl, reserving cooking liquid, and tear into thin shreds. Chill chicken, covered, while making aspic.",
        "Pour reserved cooking liquid through a fine sieve lined with a dampened paper towel into a bowl. Measure liquid and add enough cold water (about 1/2 cup) to measure 3 cups total. Return liquid to cleaned pan.",
        "In a small bowl sprinkle gelatin over 1/4 cup cold water to soften. Stir gelatin mixture into cooking liquid and heat over moderate heat, stirring, until gelatin is dissolved (do not boil).",
        "Toss chicken with coriander and arrange evenly in a 2-quart terrine or loaf pan. Pour aspic slowly over chicken mixture. Chill terrine, covered, until firm, at least 6 hours, and up to 2 days.",
        "In a small bowl stir together hoisin sauce and vinegar until smooth.",
        "Run a thin knife around edge of terrine and dip terrine or pan into a larger pan of hot water 10 seconds to loosen. Invert terrine onto a platter and serve with sauce and pickled ginger. Terrine will be quite fragile: If slicing, use an electric knife; otherwise, serve with a spoon."
    ],
    "ingredients": [
        "3 cups chicken broth, fat skimmed",
        "1/2 cup medium-dry Sherry",
        "2 teaspoons soy sauce",
        "a 1 1/2-inch piece fresh gingerroot, cut into 1/4-inch-thick slices",
        "6 scallions, each cut crosswise into thirds and flattened with flat side of a large knife",
        "1 1/2 tablespoons star anise pieces*, crushed lightly",
        "1/2 teaspoon salt",
        "1 pound skinless boneless chicken breasts (about 3 breast halves)",
        "about 3/4 cup cold water",
        "1 envelope plus 1 1/2 teaspoons (about 4 1/2 teaspoons total) unflavored gelatin",
        "1/2 cup fresh coriander leaves, washed well and spun dry",
        "2 tablespoons hoisin sauce",
        "4 teaspoons rice vinegar (not seasoned)",
        "Accompaniment: 1/4 cup drained pickled ginger*",
        "*available at Asian markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Herb",
        "Appetizer",
        "Gourmet"
    ],
    "title": "Jellied Chicken and Coriander \"Terrine\"",
    "url": "http://www.epicurious.com/recipes/food/views/jellied-chicken-and-coriander-terrine-13246"
}
