{
    "directions": [
        "Preheat an outdoor grill for medium heat, and lightly oil the grate.",
        "Cook the sausages on the preheated grill, turning occasionally, until no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Cut into bite sized pieces; set aside.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.",
        "Meanwhile, melt 1 cup of butter in a saucepan over medium heat. Stir in the garlic, and cook until softened and fragrant, about 5 minutes. Stir in the cream and red pepper flakes; bring to a simmer over medium-high heat, and whisk in the Parmesan cheese until melted. Keep warm over low heat, stirring occasionally to keep smooth.",
        "Melt the remaining 1 tablespoon of butter in a large skillet over medium-high heat. Stir in the onion, red bell pepper, and mushrooms. Cook and stir until the vegetables are tender. Once tender, stir in the chorizo pieces, and cook until hot. Combine with the penne pasta and Parmesan cream sauce to serve."
    ],
    "ingredients": [
        "5 (4 ounce) links chorizo sausage (such as Johnsonville®)",
        "1 (16 ounce) box penne pasta",
        "1 cup butter",
        "4 cloves garlic, minced",
        "1 cup heavy whipping cream",
        "1/4 teaspoon crushed red pepper flakes",
        "1 cup grated Parmesan cheese",
        "1 tablespoon butter",
        "1 onion, sliced",
        "1 red bell pepper, sliced",
        "1 (8 ounce) package button mushrooms, stems trimmed",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jen's Chorizo Pasta",
    "url": "http://allrecipes.com/recipe/218286/jens-chorizo-pasta/"
}
