{
    "directions": [
        "In a food processor, combine the white onion, green onions, chilies, allspice, thyme, nutmeg, oil, salt and pepper. Process until pureed, then transfer to a baking dish. Add the pork cubes and toss to coat evenly. Cover and refrigerate for at least 1 hour or up to 4 hours.",
        "If using bamboo skewers, soak 8 skewers in water for at least 1 hour.",
        "To make the plum relish, in a nonreactive bowl, stir together the plums, bell pepper, red onion, hot sauce, lime juice, mint and cilantro. Set aside.",
        "Remove the pork from the refrigerator and let stand at room temperature for 20 to 30 minutes. Prepare a medium-hot fire in a grill, or preheat a cast-iron stovetop grill pan over medium-high heat.",
        "Thread the pork cubes onto the skewers, pressing them snugly together. Wrap about 2 inches of the blunt end of each skewer in aluminum foil to make a handle. Pat the pork dry.",
        "Place the skewers on the grill rack over the hottest part of the fire or in the grill pan. Cook, turning once, until the pork is seared on all sides, browned and firm to the touch, about 1 1/2 minutes per side.",
        "Remove the foil from the skewers and arrange on plates. Top with the plum relish and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "The Cook and The Butcher,",
        "by Brigit Binns (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1 white or yellow onion, thickly sliced",
        "4 green onions, white and green portions, thickly sliced",
        "2 or 3 habanero chilies, seeded",
        "2 tsp. ground allspice",
        "2 tsp. dried thyme",
        "1 tsp. freshly grated nutmeg",
        "2 Tbs. canola oil",
        "3/4 tsp. kosher salt",
        "1/4 tsp. freshly ground pepper",
        "1 pork tenderloin, about 1 1/4 lb., silverskin removed, pork cut\n  into 3/4-inch cubes",
        "",
        "3 plums, pitted and cut into 1/4-inch dice",
        "3 Tbs. finely diced red bell pepper (optional)",
        "1 1/2 Tbs. minced red onion",
        "1 to 3 tsp. hot sauce, such as Pickapeppa Jamaican",
        "2 tsp. fresh lime juice",
        "8 to 12 fresh mint leaves, coarsely chopped",
        "1 tsp. minced fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Jerk-Spiced Pork Kabobs with Plum Relish",
    "url": "http://www.williams-sonoma.com/recipe/jerk-spiced-pork-kabobs-relish.html"
}
