{
    "directions": [
        "Peel Jerusalem artichokes and cut into 1-inch pieces. In a stainless-steel or enameled saucepan combine artichokes, milk, and enough water to cover artichokes by 1 inch and simmer until tender, about 30 minutes. (Milk will help prevent artichokes from discoloring.) While artichokes are cooking, in a large skillet heat 2 tablespoons butter over moderately high heat until foam subsides and sauté onion, garlic, and 1 tablespoon sage until onion is golden, about minutes.",
        "Preheat oven to 425° F.",
        "Drain artichokes and in a food processor pulse with onion mixture and Parmesan until smooth. Spoon purée into a 2-quart buttered gratin dish. In large skillet melt remaining 3 tablespoons butter over moderate heat and sauté bread crumbs with remaining 2 tablespoons sage until golden, about 5 minutes. Season bread crumbs with salt and pepper and sprinkle evenly over purée. Gratin may be prepared up to this point 2 days ahead and chilled covered.",
        "Bake gratin in middle of oven until hot and bread crumbs are a shade darker, about 20 minutes, and garnish with fried sage leaves.",
        "In a small skillet heat 1/8 inch oil over moderately high heat until hot but not smoking and fry sage leaves, 1 at a time, about 3 seconds, until crisp, transferring with a slotted spoon to paper towels to drain. Sprinkle sage leaves with coarse salt."
    ],
    "ingredients": [
        "4 pounds Jerusalem artichokes",
        "2 cups milk",
        "5 tablespoons unsalted butter",
        "1 large onion, chopped",
        "2 garlic cloves, minced",
        "3 tablespoons chopped fresh sage leaves",
        "1/2 cup freshly grated Parmesan cheese",
        "2 1/2 cups fresh bread crumbs",
        "olive oil for frying",
        "12 whole fresh sage leaves",
        "coarse salt for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Vegetarian",
        "Parmesan",
        "Jerusalem Artichoke",
        "Fall",
        "Chill",
        "Sage",
        "Gourmet"
    ],
    "title": "Jerusalem Artichoke and Sage Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/jerusalem-artichoke-and-sage-gratin-13437"
}
