{
    "directions": [
        "1 Fill a large pot two-thirds full of water, add the 1 tbsp salt, and bring to a boil over high heat. Add the pasta and stir. Cook the pasta until al dente (cooked through but still slightly chewy), 7 to 8 minutes.",
        "2 While the pasta water is heating and pasta is cooking, in a large sauté pan, heat the oil over medium-high heat and swirl to coat the pan bottom. Add the Jerusalem artichokes, the remaining 1 tsp salt, the pepper, and red pepper flakes and sauté until the Jerusalem artichokes begin to brown on the edges, about 5 minutes. Add the onion and sauté until translucent, about 5 minutes more. Add the artichoke hearts and garlic and continue sautéing until the artichoke hearts are heated through and the garlic is soft but not brown, about 3 minutes. Add the lemon juice and toss to coat.",
        "3 When the pasta is ready, drain it in a colander, reserving 1 cup/240 ml of the cooking water. Add the pasta and the mint to the sauté pan and toss to combine with the Jerusalem artichoke mixture. Add just enough of the reserved pasta water, a little at a time, as needed to moisten. Taste and adjust the seasoning. Divide the pasta among warmed individual bowls and shower with the cheese. Serve immediately."
    ],
    "ingredients": [
        "1 tbsp kosher or fine sea salt, plus 1 tsp",
        "1 lb/455 g dried linguine",
        "3 tbsp extra-virgin olive oil",
        "1 lb/455 g Jerusalem artichokes, cut on the diagonal into slices 1/4 in/6 mm thick",
        "1/4 tsp freshly ground pepper",
        "1/8 tsp red pepper flakes",
        "1 small red onion, thinly sliced",
        "One 14-oz/400-g can quartered artichoke hearts in water, drained and patted dry",
        "6 large garlic cloves, thinly sliced",
        "1 tsp fresh lemon juice",
        "1/4 cup/15 g thinly sliced fresh mint",
        "Freshly grated Pecorino Romano cheese for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sauté",
        "Vegetarian",
        "Dinner",
        "Artichoke",
        "Root Vegetable",
        "Jerusalem Artichoke",
        "Fall",
        "Winter",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Jerusalem Artichoke and Artichoke Heart Linguine",
    "url": "http://www.epicurious.com/recipes/food/views/jerusalem-artichoke-and-artichoke-heart-linguine-51127600"
}
