{
    "directions": [
        "Combine chicken, 1/4 cup olive oil, 1/2 juiced lemon, chopped fresh rosemary, and garlic in a bowl; marinate chicken in refrigerator, at least 30 minutes.",
        "Melt butter in a saucepan over medium heat. Stir garlic pepper, thyme, and dried rosemary into melted butter and cook for 1 minute.",
        "Whisk chicken broth, water, wine, milk, and 4 teaspoons lemon juice together in a bowl. Add cornstarch and whisk until lumps have dissolved; pour into butter mixture. Whisk sauce and bring to a boil; season with salt and pepper and remove saucepan from heat.",
        "Heat a large skillet over medium-high heat; add 1/4 cup olive oil. Remove chicken from marinade, discarding the marinade. Cook and stir chicken in the hot olive oil until no longer pink in the center, about 8 minutes. Add asparagus, tomatoes, broccoli, spinach, zucchini, yellow squash, red bell pepper, peas, and carrots to chicken; cook and stir until vegetables are tender, about 10 minutes.",
        "Bring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.",
        "Mix pasta and sauce in with chicken and vegetables; stir until evenly combined."
    ],
    "ingredients": [
        "Chicken:",
        "2 pounds skinless, boneless chicken breast halves, cut into 1/2-inch strips",
        "1/4 cup extra-virgin olive oil",
        "1/2 lemon, juiced",
        "2 small sprigs fresh rosemary, chopped",
        "1 clove garlic",
        "Sauce:",
        "2 tablespoons butter",
        "2 teaspoons garlic pepper seasoning",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon dried rosemary",
        "1/2 cup chicken broth",
        "1/2 cup water",
        "1/2 cup white wine",
        "2 tablespoons milk",
        "2 teaspoons lemon juice",
        "2 tablespoons cornstarch",
        "1 teaspoon sea salt and ground black pepper to taste",
        "Vegetables:",
        "1/4 cup extra-virgin olive oil",
        "1 bunch fresh asparagus, cut into 1-inch pieces",
        "2 Roma (plum) tomatoes, diced",
        "1 cup broccoli florets",
        "1 cup spinach, cut into 1/2-inch pieces",
        "1 zucchini, cut into rounds",
        "1 pound yellow squash, cut into rounds",
        "1/2 red bell pepper, cut into strips",
        "1/2 cup frozen peas",
        "1/2 cup matchstick-cut carrots",
        "1 (16 ounce) package farfalle (bow tie) pasta"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jewel's Chicken Giardino",
    "url": "http://allrecipes.com/recipe/241675/jewels-chicken-giardino/"
}
