{
    "directions": [
        "Rinse rice in several changes of cold water in a large bowl until water runs clear. Drain in a large sieve.",
        "Bring water and salt to a boil in a 6-quart heavy pot, then add rice and boil, uncovered, stirring occasionally, 5 minutes from time water returns to boil. Drain rice in sieve.",
        "Toss together dried fruit in a bowl. Melt 6 tablespoons butter with cardamom and pepper in cleaned and dried pot, stirring to combine, then alternately layer rice and dried fruit over it, beginning and ending with rice and mounding loosely. Make 5 or 6 holes in rice to bottom of pot with round handle of a wooden spoon, then cover pot with a kitchen towel and a heavy lid. Fold edges of towel up over lid (to keep towel from burning) and cook rice over moderately low heat, undisturbed, until tender and a crust forms on bottom, 30 to 35 minutes. Remove from heat and let rice stand, tightly covered and undisturbed, at least 30 minutes.",
        "Heat remaining 2 tablespoons butter in a small skillet over moderate heat and cook pistachios, stirring, until lightly browned, 2 to 3 minutes.",
        "Spoon loose rice onto a platter, then break crust into 1-inch pieces and scatter over rice. Sprinkle with pistachios."
    ],
    "ingredients": [
        "3 cups basmati rice (1 1/4 lb)",
        "4 qt water",
        "3 tablespoons salt",
        "1/2 cup dried apricots (3 1/2 oz), quartered",
        "1/2 cup golden raisins (3 oz)",
        "1/2 cup dried cranberries (2 oz)",
        "1 stick (1/2 cup) unsalted butter",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon black pepper",
        "1/2 cup coarsely chopped shelled unsalted pistachios (not dyed red; 2 1/2 oz)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Quick & Easy",
        "Wheat/Gluten-Free",
        "Dried Fruit",
        "Raisin",
        "Pistachio",
        "Fall",
        "Christmas Eve",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Jeweled Rice with Dried Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/jeweled-rice-with-dried-fruit-230991"
}
