{
    "directions": [
        "Stir together water, yeast, and sugar in a small bowl until sugar is dissolved, then let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Stir together 2 1/2 cups flour and 1 1/2 teaspoons salt in a large bowl, then add yeast mixture and 2 tablespoons oil and stir until a dough forms. Turn out dough onto a floured surface and knead, adding enough of remaining cup flour, a little at a time, as needed to prevent stickiness, until smooth and elastic, about 8 minutes.",
        "Form dough into a ball and transfer to an oiled large bowl, turning to coat with oil. Cover bowl with plastic wrap and let dough rise in a draft-free place at warm room temperature until doubled in bulk, about 2 hours.",
        "Cook onions in remaining tablespoon oil with remaining teaspoon salt in an 8- to 9-inch nonstick skillet over moderately low heat, stirring, until slightly softened, about 2 minutes. Cover surface of onions with a round of parchment or wax paper (or cover skillet with a tight-fitting lid) and cook onions, lifting parchment to stir frequently, until very soft and pale golden, 12 to 15 minutes.",
        "Transfer dough to a 15- by 10- by 1-inch baking pan and stretch dough, first by pulling with your hands, then by pressing your fingertips into dough and working outward from center, until dough fills pan. Prick dough all over at 1-inch intervals with a fork, leaving a 1-inch border all around sides, and cover loosely with oiled plastic wrap (oiled side down). Let dough rise slightly in draft-free place at warm room temperature, 30 minutes.",
        "While dough rises, put oven rack in middle position and preheat oven to 400°F.",
        "Gently brush dough with some egg wash, being careful not to deflate dough. Scatter onions evenly over dough, leaving a 1-inch border, then sprinkle with nigella seeds.",
        "Bake until top is golden and bottom sounds hollow when tapped, about 30 minutes. Lift bread from pan and transfer to a rack to cool slightly.",
        "Cut into roughly 3-inch squares before serving.",
        "*Available at specialty foods shops and Kalustyan's (800-352-3451)."
    ],
    "ingredients": [
        "1 cup warm water (105–115°F)",
        "1 (1/4-oz) package active dry yeast (2 1/2 teaspoons)",
        "2 teaspoons sugar",
        "3 1/2 cups all-purpose flour",
        "2 1/2 teaspoons salt",
        "3 tablespoons vegetable oil",
        "2 medium onions, finely chopped (2 cups)",
        "1 large egg, lightly beaten with 1 tablespoon water",
        "1 teaspoon nigella seeds* or poppy seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Onion",
        "Bake",
        "Kosher",
        "Gourmet"
    ],
    "title": "Jewish Onion Bread",
    "url": "http://www.epicurious.com/recipes/food/views/jewish-onion-bread-109217"
}
