{
    "directions": [
        "Place the chopped bacon in a large pot over medium heat, and cook, stirring often, until the bacon is browned and crisp, about 10 minutes. Remove the bacon with a slotted spoon, leaving the drippings in the pot, and set aside.",
        "Sprinkle the lamb with salt and black pepper, and brown the meat well over medium heat in several batches in the bacon drippings. Do not crowd the pan or lamb won't brown. Set the lamb aside. Stir the celery, chopped carrot, red onion, garlic, rosemary, thyme, and oregano into the bacon drippings, and cook and stir until the onion is softened and translucent, about 5 minutes. Pour almost all the stout beer into the pan, but reserve about 1/4 cup in a small bowl and set aside. Bring the mixture to a boil, and cook until the stout beer has reduced by about half, about 10 minutes. Scrape up and dissolve any brown flavor bits in the bottom of the pot into the liquid.",
        "Stir the bacon and cooked lamb meat back into the stew; mix in the fire-roasted tomatoes with their juice, and pour in enough beef stock to cover. Bring the mixture to a boil, reduce heat to a simmer, and cook for 1 hour and 45 minutes. Mix in the pearl barley, and simmer 15 minutes more. Stir in red potatoes, sliced carrots, rutabaga, and mushrooms, and simmer until the potatoes are tender, about 30 minutes.",
        "To thicken the stew, whisk flour into the reserved 1/4 cup of stout beer until smooth; stir the mixture into the stew, and simmer until thickened, about 5 minutes."
    ],
    "ingredients": [
        "4 slices bacon, chopped",
        "2 pounds cubed lamb stew meat",
        "salt and ground black pepper to taste",
        "2 stalks celery, sliced",
        "1 carrot, chopped",
        "1 red onion, chopped",
        "4 cloves garlic, chopped",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh oregano",
        "1 (12 fluid ounce) can or bottle Irish stout beer (such as Guinness®), divided",
        "1 (14.5 ounce) can fire-roasted diced tomatoes, with juice",
        "4 cups beef stock, or as needed",
        "1 cup pearl barley, rinsed",
        "1 pound small red potatoes, cubed",
        "2 carrots, sliced",
        "1 rutabaga, peeled and cubed",
        "1 (10 ounce) package sliced fresh mushrooms",
        "3 tablespoons all-purpose flour, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "JG's Irish Lamb Stew",
    "url": "http://allrecipes.com/recipe/216925/jgs-irish-lamb-stew/"
}
