{
    "directions": [
        "In a small bowl, stir together yeast, sugar and hot water; set aside until bubbles form on the yeast's surface. Stir in salt and olive oil. Place flour in a large bowl, then stir in yeast mixture and bring mixture together to form a soft dough. Working on a lightly floured surface, use your hands to knead the dough until it's satiny smooth and soft, about 15 minutes. Cover dough with a clean towel and set aside to rest.",
        "Coarsely chop the spinach. Bring a large pot of salted water to boil and add spinach. Cook spinach 2 minutes, or just until wilted; drain very well and return to the pot. Add onions, lemon juice, garlic, basil, mint, and garlic salt. Cook and stir spinach mixture 2 minutes more to blend the flavors.",
        "Place a pizza stone in the oven and preheat to 450 degrees F (230 degrees C). Meanwhile, cut the dough into golf-ball size pieces and roll into 5-inch diameter disks about 1/4-inch thick. Place 1 tablespoon of spinach filling in the middle of each disk. Be sure to stir the spinach mixture frequently so the juice doesn't separate. Fold up three sides of the disk to make a triangle, leaving a small hole in the center to release steam while baking.",
        "Bake 10 to15 minutes, or until golden brown. Remove and cool on racks."
    ],
    "ingredients": [
        "1 1/2 teaspoons white sugar",
        "1 1/2 teaspoons active dry yeast",
        "1 1/4 cups warm water (110 degrees F to 115 degrees F)",
        "1 1/2 teaspoons salt",
        "2 tablespoons olive oil",
        "3 cups whole wheat flour",
        "3 pounds fresh spinach, rinsed and stems removed",
        "2 medium onions, finely chopped",
        "2/3 cup lemon juice",
        "4 cloves garlic, finely chopped",
        "2 tablespoons chopped fresh basil leaves",
        "2 tablespoons chopped fresh mint leaves",
        "3/4 teaspoon garlic salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jiddo's Fatayer Sabanegh (Spinach Triangles)",
    "url": "http://allrecipes.com/recipe/140412/jiddos-fatayer-sabanegh-spinach-tri/"
}
