{
    "directions": [
        "For the sauté, use the sauté setting over normal, or medium heat, and heat the oil (if using). Add the onion and sauté until transparent, 5 minutes. Then add the garlic and peppers and sauté for a minute more.",
        "For the first pressure cook, add the smoked paprika, chili powder and black-eyed peas and stir. Add the dates and water but do not stir. Put the lid on the Instant Pot and cook at high pressure for 3 minutes. Let the pressure release naturally.",
        "For the second pressure cook, open the lid carefully. Add the tomatoes and greens. Return to high pressure for 1 more minute, then turn the valve to release manually. Add salt to taste.",
        "To serve, you can add as much hot sauce as you want to the pot or pass it at the table so diners can add it themselves."
    ],
    "ingredients": [
        "1 tsp (5 ml) oil (or *dry sauté or add a little water/vegetable broth)",
        "1 medium to large onion, thinly sliced",
        "3 cloves garlic, minced",
        "1 cup (149 g) diced red pepper",
        "1 small jalapeño or other hot chile, minced",
        "2 tsp (4 g) smoked paprika",
        "1–2 tsp (3–5 g) chili powder",
        "1 1/2 cups (218 g) dried black-eyed peas, soaked overnight and drained",
        "4 dates, finely chopped",
        "1 1/2 cups (355 ml) water or vegetable broth, plus more as needed",
        "1 (15-oz [425-g]) can fire-roasted tomatoes with green chiles",
        "2 cups (32 g) chopped greens (such as kale, collards or Swiss chard)",
        "Salt to taste",
        "Hot sauce such as Tabasco or Texas Pete"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Pea",
        "Bean",
        "Leafy Green",
        "Collard Greens",
        "Kale",
        "Date",
        "Vegan",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Dinner",
        "Garlic",
        "Tomato"
    ],
    "title": "Jill Nussinow’s Smoky-Sweet Black-Eyed Peas and Greens for the Instant Pot",
    "url": "http://www.epicurious.com/recipes/food/views/jill-nussinows-smoky-sweet-black-eyed-peas-and-greens-for-the-instant-pot"
}
