{
    "directions": [
        "In a large saucepan saute garlic, onion, and roasted peppers in 2 tablespoons olive oil until onions turn golden brown. Stir in fresh basil and blend well. Add ground black pepper, ground white pepper, ground red pepper, ground sage, onion powder, ground sage, onion powder, dried parsley, dried oregano, and salt. Stir until well blended. If desired, add MSG. Stir in chopped Italian tomatoes and both cans of tomato paste. Cover and simmer over medium-low heat until paste has liquefied.",
        "Once sauce has liquefied, add bay leaf, fennel seed, dried chives, bouillon cube, and ,if desired, anchovy fillets and Vermouth. Cover and let simmer for 30 minutes. Stir occasionally.",
        "In a separate skillet prepare sausage by lightly browning in 2 tablespoons olive oil. Using medium heat, cover and let cook for 15 minutes. At the completion of cooking time, remove sausage from pan, and cut into 1 inch pieces. Add to sauce pot.",
        "Cover sauce and simmer for an additional 15 minutes. Stir occasionally and serve warm."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "8 cloves crushed garlic",
        "1 onion, chopped",
        "1/2 (12 ounce) jar roasted red bell peppers",
        "1/2 cup chopped fresh basil",
        "ground black pepper to taste",
        "1/8 teaspoon freshly ground white pepper",
        "1 pinch cayenne pepper",
        "1 pinch dried sage",
        "1 pinch onion powder",
        "2 teaspoons dried parsley",
        "2 teaspoons dried oregano",
        "salt to taste",
        "1 tablespoon monosodium glutamate (MSG)",
        "1 fluid ounce sweet vermouth (optional)",
        "2 anchovy filets (optional)",
        "1 (28 ounce) can Italian-style whole peeled tomatoes",
        "2 (6 ounce) cans tomato paste",
        "1 bay leaf",
        "1/8 teaspoon fennel seed",
        "1 tablespoon dried chives",
        "1 cube chicken bouillon",
        "3/4 pound sweet Italian sausage",
        "3/4 pound spicy Italian sausage",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jimmy the Saint's Sausage and Pepper Sauce",
    "url": "http://allrecipes.com/recipe/11988/jimmy-the-saints-sausage-and-pepper/"
}
