{
    "directions": [
        "Preheat  oven to 350 degrees F (175 degrees C). Grease a 10-inch Bundt pan. In a bowl, whisk together the flour, baking soda, allspice, and 1 teaspoon of salt.",
        "In a large bowl, mix the vegetable oil, 2 cups of sugar, eggs, apples, 1 cup of pecans, and raisins. Mix the flour mixture into the wet ingredients, and pour the batter into the prepared Bundt pan.",
        "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out with moist crumbs, about 70 minutes. Let the cake cool in the pan for about 10 minutes, then turn out onto a rack to finish cooling.",
        "For glaze, mix 1/2 cup of white sugar, the brown sugar, half and half, and 1/4 teaspoon of salt in a saucepan. Bring to a boil, reduce heat to medium-low, and boil, stirring constantly, until the mixture thickens to a syrup, 5 to 10 minutes. A candy thermometer will read 220 degrees F (105 degrees C). At that point, stir in butter, 1 cup of pecans, and vanilla extract. Continue to cook and stir until the syrup reaches 234 degrees F (110 degrees C). Allow the glaze to cool for 5 minutes, then spread the warm glaze over the cake."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 teaspoon baking soda",
        "2 teaspoons ground allspice",
        "1 teaspoon salt",
        "1 1/2 cups vegetable oil",
        "2 cups white sugar",
        "4 eggs",
        "3 cups apples - peeled, cored and shredded",
        "1 cup chopped pecans",
        "1 cup raisins",
        "1/2 cup white sugar",
        "1/2 cup light brown sugar",
        "1/2 cup half-and-half cream",
        "1/4 teaspoon salt",
        "1/2 cup butter, softened",
        "1 cup chopped pecans",
        "1/4 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jim's Apple Raisin Pound Cake with Praline Glaze",
    "url": "http://allrecipes.com/recipe/216915/jims-apple-raisin-pound-cake-with-pr/"
}
