{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Place lamb shanks into a roasting pan and drizzle with olive oil; season with salt, black pepper, dried rosemary, and thyme. Toss lamb shanks to coat with oil and seasonings.",
        "Roast in the preheated oven until lamb is browned, about 30 minutes.",
        "Reduce oven heat to 325 degrees F (165 degrees C).",
        "Melt butter in a saucepan over medium-high heat; cook and stir onion, celery, and carrot in the hot butter until onion is browned, about 10 minutes. Stir flour into vegetables until combined; mix in garlic. Cook and stir for 1 more minute.",
        "Pour red wine into vegetable mixture, stir to combine, and mix in chicken stock, water, balsamic vinegar, and cinnamon. Pour sauce over lamb shanks in the roasting pan. Cover roasting pan with aluminum foil, sealing foil loosely so that the sauce can reduce slightly as it cooks.",
        "Bake lamb shanks for 1 hour; flip lamb shanks and place foil back on dish. Continue baking until a fork inserts easily into the meat, about 1 more hour. Transfer lamb shanks to a large bowl, cover with foil, and let rest for 10 minutes.",
        "Pour braising liquid into a saucepan, place over high heat, and boil for 10 minutes, skimming fat as it reduces and thickens slightly. Stir chopped rosemary into sauce, check levels of salt and pepper, and serve lamb shanks with pan sauce."
    ],
    "ingredients": [
        "5 1/2 pounds lamb shanks",
        "2 tablespoons olive oil",
        "salt and freshly ground black pepper to taste",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon dried thyme",
        "1 tablespoon butter",
        "1 onion, diced",
        "1 rib celery, diced",
        "1 large carrot, diced",
        "1 1/2 tablespoons all-purpose flour",
        "4 cloves garlic, minced",
        "1/2 cup red wine",
        "1 cup chicken broth",
        "1 cup water",
        "1 tablespoon balsamic vinegar",
        "1/8 teaspoon ground cinnamon",
        "1 teaspoon minced fresh rosemary leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jinx-Proof Braised Lamb Shanks",
    "url": "http://allrecipes.com/recipe/235355/jinx-proof-braised-lamb-shanks/"
}
