{
    "directions": [
        "1. Preheat the oil to 350°F.",
        "2. Completely thaw the turkey. Remove giblets and neck, reserve for other uses. If present, remove and discard any plastic pieces such as leg holder and pop-up timer. Rinse turkey well with cold water; drain cavity. Dry turkey completely with paper towels. Generously rub the front and back of the outside of the turkey with the dry rub. Separate the skin covering the breast and insert dry rub under the skin. Pull the neck skin to the back and twist wing tips to the back, holding the skin in place. Tuck the legs under the band of skin or tie legs to tail with cotton string or butcher's twine.",
        "3. Place the turkey breast side down on an upright stand designed for poultry frying. Wearing protective gloves or heavy oven mitts and using a hook or tong to hold the bird away from you, very slowly lower the turkey into hot oil. Be cautious of splattering oil. Maintain oil temperature at around 350°F. Fry turkey for 3 1/2 minutes per pound. Slowly lift from oil and place on a metal sheet pan or tray. Use caution, as hot oil will drain from the bird. Check for doneness. Insert an instant-read thermometer in the center of the breast; it is considered done when thermometer reads 170°F or above. Let rest for 15 minutes. Carefully carve with a sharp knife."
    ],
    "ingredients": [
        "5 to 8 gallons peanut oil",
        "10 to 12 lb. turkey, thawed",
        "1/3 cup salt",
        "1/3 cup pepper",
        "1/3 cup garlic powder",
        "Butcher's twine or cotton string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Deep-Fry",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Jive Turkey Deep-Fried Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/jive-turkey-deep-fried-turkey-233079"
}
