{
    "directions": [
        "Heat 2 cups of milk in a saucepan over low heat until the milk just comes to a simmer; remove from heat, and let cool. Mash the cake yeast with the warm water in a bowl, and set aside.",
        "In a bowl, whisk together the flour with 1 teaspoon of cinnamon and 1 teaspoon of nutmeg. In a separate large bowl, mash the butter with 1 cup of sugar and the salt until the mixture is smooth and creamy.  Beat in 2 eggs and 1 teaspoon of vanilla extract. After milk is cooled to a warm temperature, stir the yeast mixture into the scalded milk, and stir the milk mixture to the creamed butter mixture. Beat in 3 cups of flour until completely incorporated, and beat in remaining flour, 1/2 cup at a time, until the mixture forms a smooth dough that's almost sticky. Dough will be very soft.",
        "Turn the dough out onto a well-floured work surface, and knead until smooth and elastic, about 8 minutes. Place the dough into an oiled bowl, and turn the dough over to coat all sides with oil. Cover with a floured kitchen towel, and let rise in a warm place until doubled, 2 to 3 hours.",
        "Punch down the dough, cut into 6 equal pieces, and roll each piece into a ball. Cover with floured kitchen towel, and set the balls into a warm place to rise until doubled, 40 minutes to 1 hour.",
        "While dough is rising the second time, make the nut filling: tear toasted bread into a few pieces, and grind toast with walnuts and  pecans in a food grinder, or process in the work bowl of a food processor until finely chopped. Place the nuts into a bowl; mix in 1 teaspoon of vanilla extract, 1 cup of honey, 1/2 cup of sugar, 1 teaspoon of cinnamon, and 1 teaspoon of nutmeg until thoroughly combined. Mix in milk, a little at a time, to make a workable mixture.",
        "Beat egg whites to stiff peaks in a bowl with an electric mixer, and gently fold the egg whites into the nut mixture until completely combined.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Roll out each piece of dough on a floured surface into a 12-inch square;  brush with melted butter. Spread 1/6 of the nut mixture onto each square of dough, and roll each into a log; pinch ends and seam tightly together, and tuck the ends underneath the roll. Place filled rolls on the prepared baking sheet, seam sides down.",
        "Beat egg yolks and 1/2 cup of milk together in a small bowl, and brush the rolls with the egg yolk mixture. If desired, allow to rise 30 more minutes (for more puffy rolls). Poke holes in the rolls every 4 inches.",
        "Bake in the preheated oven until golden brown, 50 to 65 minutes. A toothpick inserted into the center of a roll will come out clean. Brush rolls with melted butter after removing from oven; allow to cool on racks."
    ],
    "ingredients": [
        "2 cups milk",
        "1 (0.6 ounce) cake cake yeast",
        "1/4 cup warm water - 100 to 110 degrees F (40 to 45 degrees C)",
        "6 cups all-purpose flour",
        "1 teaspoon ground cinnamon, or more to taste",
        "1 teaspoon nutmeg",
        "1/2 cup butter",
        "1 cup white sugar",
        "1 teaspoon salt",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1 slice bread, toasted",
        "3 pounds walnut halves",
        "1 1/4 pounds pecan halves",
        "1 teaspoon vanilla extract",
        "1 cup honey, or to taste",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon, or to taste",
        "1 teaspoon nutmeg",
        "4 egg whites",
        "2 cups milk, or as needed",
        "1/4 cup butter, melted - divided",
        "2 egg yolks",
        "1/2 cup milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Joanna's Nut Roll",
    "url": "http://allrecipes.com/recipe/217822/joannas-nut-roll/"
}
