{
    "directions": [
        "Put chopped onion and sliced olives in separate small bowls and combine each with 1/4 cup of vinegar. Set aside to marinate. Meanwhile, heat the vegetable oil in a skillet over medium heat. Stir in the chorizo, breaking it apart into crumbles as it cooks, about 10 minutes. Remove the chorizo from the skillet and set aside.",
        "Heat 1/4 cup of oil in the skillet and add the tortilla pieces, cooking and stirring over medium-low heat until just beginning to get crisp and golden at the edges, about 10 minutes. Remove skillet from heat and drain the tortillas; pour 1 tablespoon of the oil into a saucepan.",
        "Heat the saucepan over medium-low heat until hot but not smoking.  Add the flour, and cook and stir until smooth, about 1 minute.  Pour in the two tomato sauces, water, browned chorizo, cocoa powder, sugar, 1 tablespoon of vinegar, oregano, and taco seasoning.  Simmer the sauce about 5 minutes to blend the flavors. Stir in diced chiles and tortillas.  Simmer about 10 minutes more, stirring occasionally, until tortillas have softened and the mixture is thick.",
        "Drain the onion and olives.  Spoon a layer of tortilla mixture evenly into a 2 quart baking dish or serving dish, and follow with a layer of about 2 tablespoons marinated onion, then a layer of 2 tablespoons olives, followed by a layer of 1/4 cup Parmesan cheese.  Repeat layers twice more. Serve hot."
    ],
    "ingredients": [
        "1 onion, chopped",
        "1 (6 ounce) can sliced black olives",
        "1/2 cup white vinegar, divided",
        "1 tablespoon vegetable oil (optional)",
        "1/2 pound chorizo or bulk spicy pork sausage (optional)",
        "12 (7 inch) corn tortillas, cut into 1-inch pieces",
        "1/4 cup vegetable oil",
        "1 1/2 tablespoons all-purpose flour",
        "3 (8 ounce) cans tomato sauce",
        "1 (7.75 ounce) can Mexican style hot tomato sauce (such as El Pato Salsa de Chile Fresco®)",
        "1 cup water",
        "1 1/2 teaspoons unsweetened cocoa powder",
        "1 teaspoon white sugar",
        "1 tablespoon white vinegar",
        "1 tablespoon dried oregano",
        "1 tablespoon taco seasoning mix (optional)",
        "1 (4 ounce) can diced green chiles, drained",
        "3/4 cup crumbled cotija or feta cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jollyrogers' Chilaquiles",
    "url": "http://allrecipes.com/recipe/183179/jollyrogers-chilaquiles/"
}
