{
    "directions": [
        "Cut a few shallow slits into each chicken drumstick, and place into a resealable plastic bag; set aside. Heat 5 tablespoons of vegetable oil in a Dutch oven or large pot over medium-high heat. Stir in the onion, garlic, and ginger. Cook and stir until the onion has turned golden brown, about 7 minutes. Remove the pot from the heat, and use a slotted spoon to scoop the onion mixture into a blender. Leave as much oil in the pot as you can, and set aside. Add 3 tablespoons white vinegar, coriander, cumin, garam masala, black pepper, salt, turmeric, and cayenne pepper. Puree until smooth, then pour into the bag with the chicken; mix until the chicken is evenly coated, and squeeze out excess air. Marinate at room temperature for 1 hour, or in the refrigerator for 3 hours or longer.",
        "After the chicken has marinated, heat the oil left in the Dutch oven over high heat, and stir in the curry leaves and mustard seeds. Once the mustard seeds have finished popping and have turned gray, remove the chicken from its marinade, and cook until browned on all sides, about 5 minutes. Pour in the remaining marinade and water. Bring to a simmer, then reduce heat to medium-low, cover, and simmer 20 minutes.",
        "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).",
        "While the chicken is cooking, deep fry the potato cubes until golden brown. Drain on a paper towel-lined plate. Once the chicken has cooked for 20 minutes, stir in the potatoes and  2 tablespoons of white vinegar. Recover, and continue to simmer until the chicken is no longer pink at the bone, at least more 10 minutes."
    ],
    "ingredients": [
        "2 pounds skinless chicken drumsticks",
        "5 tablespoons vegetable oil",
        "2 onions, finely chopped",
        "4 large cloves garlic, minced",
        "1/2 inch piece fresh ginger root, minced",
        "3 tablespoons distilled white vinegar",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon garam masala",
        "1/2 teaspoon ground black pepper",
        "salt to taste",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon cayenne pepper",
        "8 dried curry leaves",
        "1/2 teaspoon black mustard seeds",
        "1/4 cup water",
        "1 quart vegetable oil for frying",
        "1 large potato, peeled and cut into 1 inch pieces",
        "2 tablespoons distilled white vinegar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jonagold's Chicken Vindaloo",
    "url": "http://allrecipes.com/recipe/217328/jonagolds-chicken-vindaloo/"
}
