{
    "directions": [
        "Preheat oven to 350°F.",
        "In a shallow baking pan toast pecans in one layer in middle of oven until a shade darker and fragrant, about 10 minutes. Transfer nuts while still hot to a bowl and toss with 1 tablespoon butter and salt to taste. Cool nuts completely and finely chop.",
        "Coarsely grate Cheddar and transfer to a large bowl. Cut remaining 2 sticks butter into 16 pieces and scatter over cheese. Let cheese and butter soften. Add nuts, flour, and cayenne and with an electric mixer beat mixture until it forms a dough.",
        "Divide dough into 8 pieces. On a sheet of wax paper roll each piece of dough into a 1-inch-diameter log and wrap logs tightly in wax paper and foil. Chill logs at least 8 hours and up to 1 week. Dough keeps, frozen, 2 months. Preheat oven to 350°F.",
        "Working with 1 log at a time, with a sharp knife cut log crosswise into 1/8-inch-thick slices and arrange slices 1/2 inch apart on parchment-lined baking sheets. Bake wafers in batches in middle of oven until pale golden and just firm to the touch, 10 to 12 minutes. Cool wafers on baking sheet 2 minutes. With a metal spatula transfer wafers to a rack to cool. Turn wafers over and sprinkle with salt to taste. (Crevices on undersides hold salt without letting it roll off.) Wafers keep in an airtight container at room temperature 4 days."
    ],
    "ingredients": [
        "1 cup pecans",
        "2 sticks (1 cup) plus 1 tablespoon unsalted butter",
        "1 pound extra-sharp Cheddar",
        "2 cups all-purpose flour",
        "1 teaspoon cayenne pepper",
        "parchment paper for lining baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Cheese",
        "Dairy",
        "Nut",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Cheddar",
        "Pecan",
        "Spice",
        "Gourmet",
        "Georgia"
    ],
    "title": "Jo's Cheese Wafers",
    "url": "http://www.epicurious.com/recipes/food/views/jos-cheese-wafers-15808"
}
