{
    "directions": [
        "Bring the rice and 1 1/2 cups water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Put the cooked rice into a large serving bowl.",
        "While the rice cooks, bring beef bouillon and 3/4 cup water to a boil in a saucepan; cook until the bouillon dissolves completely. Whisk the cornstarch and 1/4 cup water together in a small bowl until smooth; stir the red wine vinegar, spaghetti sauce, steak sauce, salsa picante, brown sugar, and ginger into the cornstarch mixture; pour the resulting sauce into the bouillon and water. Simmer until hot, about 5 minutes.",
        "Melt the butter with the soy sauce in a large skillet over medium heat; cook the beef in the melted butter mixture until it begins to brown, about 5 minutes. Pour the sauce from the saucepan into the skillet; season with the garlic powder, cinnamon, salt, and pepper. Bring the mixture to a boil; lower heat to medium-low and simmer, stirring occasionally, until the sauce is thick and sticks to the beef, 20 to 30 minutes.",
        "Pour the skillet mixture over the rice. Cook the onion and pepper rings in the skillet until softened, 5 to 7 minutes; scrape the onions, peppers, and remaining juices onto the beef and rice to serve."
    ],
    "ingredients": [
        "3/4 cup white rice",
        "1 1/2 cups water",
        "1 teaspoon beef bouillon granules",
        "3/4 cup water",
        "2 tablespoons cornstarch",
        "1/4 cup water",
        "2 tablespoons red wine vinegar",
        "2 tablespoons spaghetti sauce",
        "1 tablespoon steak sauce",
        "1 tablespoon salsa picante",
        "1 tablespoon brown sugar",
        "1 teaspoon ground ginger",
        "1 tablespoon butter",
        "1 teaspoon soy sauce",
        "1 1/2 pounds boneless beef sirloin steak, cut into serving size pieces",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 onion, thinly sliced",
        "4 mild yellow pepper rings, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Joy's Awesome Pepper Steak",
    "url": "http://allrecipes.com/recipe/155927/joys-awesome-pepper-steak/"
}
