{
    "directions": [
        "Lay 4 chiles on their sides on racks of gas burners and turn flames on high. (Or broil all 8 chiles on rack of a broiler pan about 2 inches from heat.) Roast chiles, turning with tongs, until skins are blistered but not blackened, 4 to 6 minutes (do not over roast because chiles may fall apart). Transfer immediately to a large plastic bag, then close to allow chiles to steam. Roast remaining chiles in same manner.",
        "Cook onion in oil in a medium nonstick skillet over moderately low heat, stirring, until onion begins to turn golden, about 4 minutes. Add water and cook, stirring occasionally, until water is evaporated and onion is tender, about 5 minutes. Add tomatoes and cook, stirring, until softened, about 4 minutes. Remove from heat.",
        "Stir in chicken, salt, and pepper. Cool completely, then stir in cheese.",
        "Preheat oven to 350°F.",
        "Rub skins off chiles. Cut a slit lengthwise in each chile and carefully remove seeds (leave stem attached).",
        "Stuff filling into chiles through slits, keeping chiles intact. Place chiles in a 13- by 9-inch baking dish and cover tightly with foil.",
        "Bake chiles in middle of oven until cheese is melted, about 30 minutes."
    ],
    "ingredients": [
        "8 medium poblano chiles (1 1/4 lb)",
        "1 large onion, finely chopped",
        "1/2 tablespoon corn oil",
        "1/4 cup water",
        "2 plum tomatoes, finely diced",
        "2 cups chopped cooked chicken breast meat",
        "1 teaspoon kosher salt",
        "1/2 teaspoon black pepper",
        "2 1/2 oz Monterey Jack cheese, cut into 1/4-inch dice (2/3 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Pepper",
        "Tomato",
        "Vegetable",
        "Dinner",
        "Monterey Jack",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Juana's Chicken-Stuffed Poblanos",
    "url": "http://www.epicurious.com/recipes/food/views/juanas-chicken-stuffed-poblanos-103825"
}
