{
    "directions": [
        "Set the rack on the lower middle level and preheat the oven to 425°F.",
        "Rinse the chicken thoroughly, inside and out, under hot water, then dry it with paper towels. Remove any lumps of fat from inside the cavity near the tail opening.",
        "To make carving easier, remove the wishbone. Lift the flap of neck skin and insert a thin, sharp knife into each end of the breast; then slice diagonally along both sides of the wishbone. Use your finger and thumb to loose the bone, pry it out at the top, and pull it down. If it breaks, carefully wiggle out the pieces.",
        "Trim the small bony protrusions, or \"nubbins,\" from the wing tip joint. Then fold the wings up against the breast, where they will be held in place by the V-rack.",
        "Salt and pepper the cavity and stuff it with the sage leaves and 3 or 4 thick slices of lemon; give the slices a squeeze as you put them in. Massage the butter over the entire chicken skin, including undersides, then salt generously.",
        "Tie the ends of the drumsticks together with twine. Arrange the chicken breast-up on the rack in the roasting pan and tuck the flap of neck skin underneath. Squeeze the juice of the remaining lemon pieces over the top.",
        "Set the roasting pan in the oven. After 15 minutes, lower heat to 350°F. When the chicken is beginning to brown rapidly, baste with accumulated pan juices. Roast for an hour, adding the onions and carrots after 30 minutes and basting several times. Very carefully test for doneness, checking for easy movement in the leg joint and clear color in the juices. Return it to the oven if there is any sign of pinkness. (A small chicken will roast in about 1 1/4 hours, a larger one may take 1 1/2 hours or more.) When done, remove the chicken from the rack and set it on a board to rest for 15 minutes before carving. This allows the juices to retreat back into the flesh.",
        "While the chicken is resting, make the deglazing sauce in the roasting pan."
    ],
    "ingredients": [
        "1 fine, fresh 3 1/2 pound chicken",
        "Salt and pepper",
        "6 fresh sage leaves (or 4 sprigs of fresh tarragon or 1/2 teaspoon dried herbes de Provence)",
        "1 large lemon, cut in 1/4-inch slices",
        "2 tablespoons unsalted butter at room temperature",
        "2/3 cup mixed roughly chopped carrots and onions",
        "A roasting pan 2 inches deep; a V-shaped roasting rack; a pastry brush for basting; a board or platter for resting and carving; cotton kitchen twine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Herb",
        "Poultry",
        "Roast",
        "Lemon",
        "Fall",
        "Healthy",
        "Gourmet"
    ],
    "title": "Julia's Roast Chicken with Lemon and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/julias-roast-chicken-with-lemon-and-herbs-102264"
}
