{
    "directions": [
        "Peel the potatoes and slice each one lengthwise in half, or in quarters if very large; then cut crosswise into half-round or quarter-round slices, about 1/2 inch thick.",
        "Put the slices in a saucepan with water just to cover and 1 1/2 teaspoons of salt per quart of water. Heat to a simmer, and cook the potatoes for 5 to 6 minutes, or until just cooked through. It is essential that they be just cooked through. Bite into a slice or two to be very sure. Immediately remove from the heat and drain the potatoes into a colander, but save a cup of the cooking liquid for dressing the potatoes. Transfer the potatoes to a large bowl. Stir the cider vinegar with ⅓ cup of the potato water or chicken stock and drizzle this over the potato pieces, turning them gently to distribute it evenly. Let sit 10 minutes to absorb the liquid.",
        "Add the prepared onion, celery, bacon, pickle, hard-boiled eggs, and chives, and season carefully to taste. Top with ⅔ cup of mayonnaise (or a mix of mayonnaise and a bit of sour cream) and, with a large rubber spatula, gently fold everything together until well blended. Taste the salad and add more salt, pepper, or mayonnaise as needed.",
        "Cover the salad and set aside in the refrigerator for at least an hour or so before serving. If it is refrigerated longer, let it come back to room temperature before serving. Taste and adjust the seasoning again.",
        "To serve, line a bowl or a platter with red-leaf lettuce or other greens, and mound the salad on top. Decorate at the last moment, if you wish, with any or all of the optional garnishes."
    ],
    "ingredients": [
        "2 pounds large Yukon Gold potatoes, or other waxy, boiling potatoes",
        "2 tablespoons cider vinegar",
        "1/3 cup chicken stock or potato-cooking water",
        "2/3 cup finely chopped onion",
        "1/2 cup finely chopped celery",
        "3 or 4 slices crisply cooked bacon, chopped or crumbled",
        "2 to 3 tablespoons finely chopped pickle, sweet or dill",
        "2 hard-boiled eggs, peeled and sliced thin",
        "3 tablespoons or so finely chopped fresh chives or scallions, including a bit of their tender green",
        "Salt and freshly ground white pepper",
        "1 cup or so mayonnaise, homemade if possible",
        "Sour cream (optional)",
        "Crisp whole red-leaf or other lettuce leaves",
        "Canned red pimiento, diced; sliced hard-boiled eggs; tomato quarters; parsley sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Onion",
        "Potato",
        "Side",
        "Fourth of July",
        "Picnic",
        "Kid-Friendly",
        "Backyard BBQ",
        "Lunch",
        "Mayonnaise",
        "Vinegar",
        "Bacon",
        "Family Reunion",
        "Lettuce",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Julia's American-Style Potato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/julias-american-style-potato-salad-358335"
}
