{
    "directions": [
        "Preheat the oven to 375 degrees F. Line a baking sheet with parchment paper. Combine the buttermilk and vanilla in a small bowl and set aside.",
        "Put the flour, granulated sugar, baking powder, baking soda, orange zest, nutmeg, cinnamon and 1/2 teaspoon salt in a food processor and pulse until combined. Add the butter and continue to pulse until the mixture looks like fine meal.",
        "Add the pecans and pulse once. Add the buttermilk mixture and pulse 3 or 4 times, or until the mixture is just moistened. (Do not overmix or the scones will be tough.)",
        "Turn the dough out onto a lightly floured surface and gently knead until it just forms a ball. Transfer to the prepared baking sheet and pat into an 8-inch round, about 3/4 inch thick. (To make individual scones, cut into 8 wedges and space apart on the baking sheet.) Brush with buttermilk and bake until golden, about 25 minutes. Let cool 2 minutes on the baking sheet, then transfer to a rack to cool completely.",
        "Mix the confectioners' sugar, maple syrup and a pinch of salt in a small bowl until smooth. Drizzle over the scone. Cut into wedges.",
        "Photograph by Steve Giralt"
    ],
    "ingredients": [
        "3/4 cup buttermilk, plus more for brushing",
        "1 teaspoon vanilla extract",
        "2 1/4 cups all-purpose flour, plus more for dusting",
        "1/4 cup granulated sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon grated orange zest",
        "1/4 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt, plus a pinch",
        "12 tablespoons (1 1/2 sticks) unsalted butter, cut into small pieces and chilled",
        "1/2 cup pecan pieces, toasted",
        "1/4 cup confectioners' sugar",
        "3 tablespoons maple syrup"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Breakfast Recipes",
        "Easy Recipes",
        "Easy Brunch Recipes",
        "Brunch",
        "Scone Recipes",
        "Nut Recipes"
    ],
    "title": "Jumbo Maple-Pecan Scone",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/jumbo-maple-pecan-scone-recipe"
}
