{
    "directions": [
        "Mix kosher salt, black pepper, and seasoned salt together in a small bowl to make seasoning mixture.",
        "Shape ground chuck into four 6-inch patties that are 3/4-inch thick. Press your thumb into the center of each patty to make an indentation. Brush 1/2 teaspoon oil over each side. Sprinkle 1/2 teaspoon seasoning mixture over each side.",
        "Place seasoned patties on a plate lined with waxed paper and freeze until firm, about 15 minutes.",
        "Fill a barbeque starter chimney with lump charcoal and ignite in an outdoor briquette barbecue grill; heat until charcoal turns white. Spread charcoal evenly on lower grate. Add upper grate, cover grill, and let heat for 5 minutes. Lightly oil the grate.",
        "Grill patties, covered, until browned, about 5 minutes. Flip and cook until second side is browned, about 4 minutes. Place 2 slices Monterey Jack cheese over each patty; cook until melted, about 1 minute. Transfer patties to a plate and tent with aluminum foil.",
        "Brush 1 tablespoon melted butter over insides of each roll. Place roll halves buttered-side down on the grill; toast until golden, 30 seconds to 1 minute. Transfer to a flat work surface.",
        "Top the bottom half of each roll with 1/4 of the avocados, 2 lettuce leaves, 1 tomato slice, 1/4 of the red onion slices, and 3 slices of bacon.",
        "Whisk mayonnaise and horseradish together in a bowl until smooth. Spread a thin layer of mayonnaise mixture on each burger patty and place over bacon slices. Cover with top halves of rolls."
    ],
    "ingredients": [
        "1 tablespoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon seasoned salt (such as Johnny's®)",
        "2 pounds ground chuck",
        "4 teaspoons canola oil",
        "8 slices Monterey Jack cheese",
        "1/4 cup butter, melted",
        "4 Mexican telera rolls, split",
        "2 avocados, sliced into 1/4-inch wedges",
        "8 small butter lettuce leaves",
        "1 beefsteak tomato, cut into 4 thick slices",
        "1/2 red onion, thinly sliced",
        "12 strips cooked bacon",
        "1/4 cup mayonnaise",
        "2 tablespoons creamed horseradish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Jumbo Bacon Avocado Horseradish Cheeseburgers",
    "url": "http://allrecipes.com/recipe/255215/jumbo-bacon-avocado-horseradish-chees/"
}
