{
    "directions": [
        "In a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add 2 tablespoons ice water, toss the mixture until the water is incorporated, adding more ice water if necessary to form a dough, and form the dough into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour.",
        "Roll out half the dough 1/8-inch thick on a lightly floured surface, fit it into a 9-inch deep-dish (1 quart) pie plate, and trim the edge, leaving a 1/2-inch overhang. Chill the shell while making the filling. In a large bowl toss together the berries, the cornstarch, 1-1/2 cups of the sugar, the lemon juice, the nutmeg, and the cinnamon until the mixture is combined well, mound the filling in the shell, and dot it with the butter bits.",
        "Roll out the remaining dough into a 13- to 14-inch round on a lightly floured surface, drape it over the filling, and trim it, leaving a 1-inch overhang. Fold the overhang under the bottom crust, pressing the edge to seal it, and crimp the edge decoratively. Brush the crust with the half-and-half, make slits in the top crust, forming steam vents, and sprinkle the pie lightly with the additional sugar. Bake the pie on a large baking sheet in the middle of a preheated 425°F. oven for 20 minutes, reduce the heat to 375°F., and bake the pie for 35 to 40 minutes more, or until the crust is golden and filling is bubbling. Serve the pie with the ice cream."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt",
        "3 cups blackberries, picked over and rinsed",
        "3 cups blueberries, picked over and rinsed",
        "2-1/2 cups raspberries or other summer berries such as red currants or boysenberries picked and rinsed",
        "1/3 cup cornstarch",
        "1-1/2 cups sugar plus additional for sprinkling the pie",
        "1/4 cup fresh lemon juice",
        "1/8 teaspoon freshly grated nutmeg",
        "1/8 teaspoon cinnamon",
        "1 tablespoon unsalted butter, cut into bits",
        "1/4 cup half-and-half",
        "peach and brown sugar ice cream as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Summer",
        "Gourmet"
    ],
    "title": "Jumbleberry Pie (Summer Berry Pie)",
    "url": "http://www.epicurious.com/recipes/food/views/jumbleberry-pie-summer-berry-pie-12349"
}
