{
    "directions": [
        "Combine the onion, carrot, celery, garlic, sage, thyme, and a few grinds of pepper in a medium bowl. Mix well and set aside.",
        "Position a rack on the second-lowest level in the oven and preheat to 500°F. Have ready a large roasting pan with a roasting rack, preferably V-shaped, set in the pan.",
        "Put 1/2 cup of the vegetable mixture inside the neck cavity and 1/2 cup inside the chest cavity of the turkey. Scatter the remainder on the bottom of the roasting pan and add 1 cup water to the pan. Truss the turkey. Using a pastry brush, brush the turkey with half of the melted butter. Place the turkey, breast side down, on the roasting rack. Roast for 30 minutes, then reduce the oven temperature to 350°F. Baste the turkey with the pan juices and roast for 30 minutes longer.",
        "Remove the turkey from the oven. Using silicone oven mitts, regular oven mitts covered with aluminum foil, or wads of paper towels, turn the turkey breast side up. (It won't be very hot at this point.) Baste with the pan juices and the remaining melted butter, and return the turkey to the oven. Continue to roast, basting with the pan juices again after 45 minutes. At this point, check the internal temperature of the turkey by inserting an instant-read thermometer into the thickest part of a thigh without touching bone. (As a point of reference, when the internal temperature of the turkey reaches 125°F, the turkey is about 1 hour away from being done. Of course, roasting times will vary, depending on the size of the bird, its temperature when it went into the oven, whether or not it is stuffed, and your particular oven and the accuracy of the thermostat.) The turkey is done when the instant-read thermometer registers 160° to 165°F when inserted into the thickest part of a thigh away from the bone.",
        "When the turkey is done, tilt the body so the juices from the main cavity run into the pan. Transfer to a carving board or serving platter and cover loosely with aluminum foil. Let the turkey rest for 30 to 40 minutes before carving, to allow the juices to redistribute. (The internal temperature will rise 5 to 10 degrees while the turkey rests.)",
        "Strain the juices, vegetables, and browned bits from the roasting pan through a fine-mesh sieve set over a large glass measuring cup. Set aside and allow the fat to rise to the top. Spoon off the fat. The pan juices from a brined turkey are usually too salty to add to gravy, so I refrigerate it and add it to the water for making stock from the carcass; the juices provide additional flavor and the salt is diluted by the water.",
        "Carve the turkey. Serve, accompanied by the Chanterelle Mushroom Gravy."
    ],
    "ingredients": [
        "1 large yellow onion, chopped",
        "1 large carrot, peeled and chopped",
        "1 large rib celery, chopped",
        "2 cloves garlic, minced",
        "7 fresh sage leaves, chopped",
        "1 tablespoon fresh thyme leaves",
        "Freshly ground pepper",
        "One 12-to 16-pound brined turkey made with Juniper Brine",
        "1/2 cup (1 stick) unsalted butter, melted",
        "Chanterelle Mushroom Gravy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Garlic",
        "Mushroom",
        "Onion",
        "Poultry",
        "turkey",
        "Marinate",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Christmas Eve",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Juniper-Brined Roast Turkey with Chanterelle Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/juniper-brined-roast-turkey-with-chanterelle-mushroom-gravy-355409"
}
