{
    "directions": [
        "Stir whiskey, brown sugar, ketchup, hot sauce, butter, vinegar, cayenne pepper, red pepper flakes and garlic powder together in a saucepan over medium heat; cook, whisking occasionally, until the mixture begins to bubble, about 5 minutes. Reduce heat to low and cook sauce at a gentle simmer until thickened to the consistency of syrup, about 15 minutes more. Remove from heat to cool.",
        "Heat olive oil in a large skillet over medium heat. Cook chicken breasts in the hot oil, turning occasionally, until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Remove chicken to a cutting board. Use two forks to pull the chicken into shreds.",
        "Drain and discard oil from skillet, but do not otherwise clean. Return shredded chicken to the skillet. Place skillet over low heat and pour sauce over the chicken; cook and stir until the chicken is coated in sauce and the sauce sticks to the chicken strands, 1 to 2 minutes.",
        "Heat a clean skillet over low heat. Toast a tortilla in the skillet until warmed, about 1 minute. Flip tortilla and top with 2 slices provolone cheese. Cook until the cheese melts slightly, about 1 minute more. Spoon about one-quarter of the chicken mixture into the tortilla and wrap tortilla around the filling. Repeat with remaining tortillas, cheese, and chicken mixture."
    ],
    "ingredients": [
        "Sauce:",
        "1/4 cup whiskey (such as Jack Daniel's® Tennessee Honey)",
        "1/4 cup packed brown sugar",
        "1/3 cup ketchup",
        "2 tablespoons hot pepper sauce (such as Frank's RedHot®)",
        "2 tablespoons butter",
        "1 tablespoon white vinegar",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon red pepper flakes",
        "1/4 teaspoon garlic powder",
        "Wraps:",
        "1 tablespoon olive oil",
        "1 pound skinless, boneless chicken breast halves",
        "4 (6 inch) flour tortillas",
        "8 slices provolone cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Justin's Honey Buffalo Chicken Wraps",
    "url": "http://allrecipes.com/recipe/238306/justins-honey-buffalo-chicken-wraps/"
}
