{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Unroll the pie crusts, and line a 9-inch pie dish with 1 crust. Set aside the other crust.",
        "Heat the olive oil in a skillet over medium heat, and cook the onion, stirring occasionally, until translucent, about 5 minutes. Stir in the thyme, oregano, salt and black pepper, then add the mixed vegetables and combine. Place the vegetable mixture into the prepared pie dish.",
        "In a saucepan over medium heat, whisk the cream, milk, and cornstarch together until smooth, then bring to a simmer. Reduce heat and simmer the cream mixture until thickened, about 1 minute; pour the sauce over the vegetables in the pie dish. Arrange the turkey meat over the sauce and vegetables, then top the pie with the reserved crust. Crimp the two crusts together around the edge of the pie dish with a fork, and poke several holes in the top of the pie. Spread butter over the top crust. Cover the pie with aluminum foil.",
        "Bake in the preheated oven for 10 minutes; reduce heat to 350 degrees F (175 degrees C) and bake for 50 more minutes. Remove the foil from the pie about 20 minutes before the end of baking time to let the crust brown. Let stand about 10 minutes before serving."
    ],
    "ingredients": [
        "1 (15 ounce) package pastry for a 9 inch double crust pie",
        "2 teaspoons olive oil",
        "1 onion, finely chopped",
        "1 teaspoon dried thyme leaves",
        "1 teaspoon dried oregano leaves",
        "salt and ground black pepper to taste",
        "2 cups frozen mixed vegetables, thawed and drained",
        "1 cup heavy whipping cream",
        "1 cup milk",
        "2 tablespoons cornstarch",
        "2 cups cubed cooked turkey, or more to taste",
        "1 tablespoon butter, softened (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Just Another Turkey Pot Pie",
    "url": "http://allrecipes.com/recipe/215444/just-another-turkey-pot-pie/"
}
