{
    "directions": [
        "Preheat oven to 350°F. Butter a 13x9x2\" metal or glass baking dish; sprinkle bottom evenly with 3 tablespoons raw sugar. Set aside.",
        "Pulse walnuts in a food processor until coarsely chopped. Set 2 cups aside. Add all-purpose flour to processor and pulse until walnuts are very finely ground, 1-2 minutes. Add almond flour; pulse to blend. Set aside.",
        "Using an electric mixer, beat 1 cup butter and granulated sugar in a large bowl until light and fluffy, 2-3 minutes. Add eggs, cream, yogurt, and salt. Scrape in seeds from vanilla bean (reserve bean for another use). Beat until well combined, 1-2 minutes. Add ground-walnut mixture and beat just to blend. Gently fold in chopped walnuts, being careful not to overmix. Pour batter into prepared dish; smooth top. Sprinkle with remaining 3 tablespoons raw sugar.",
        "Bake until cooked through and a tester inserted into center comes out clean, 50-55 minutes. Let cool in pan on a wire rack. Serve with whipped cream. DO AHEAD: Can be made 3 days ahead. Cover and chill. Cake is best served cold."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
        "6 tablespoons raw sugar, divided",
        "7 cups walnut halves",
        "3/4 cup all-purpose flour",
        "1 1/2 cups almond flour or almond meal",
        "3/4 cup granulated sugar",
        "6 large eggs",
        "3/4 cup heavy cream",
        "1/2 cup plain whole-milk yogurt",
        "1 teaspoon kosher salt",
        "1 vanilla bean, split lengthwise",
        "Whipped cream",
        "Ingredient info: Almond flour is available at some supermarkets and at natural foods stores and specialty markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Brunch",
        "Dessert",
        "Bake",
        "Yogurt",
        "Tree Nut",
        "Walnut",
        "Shower",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-cake-394718"
}
