{
    "directions": [
        "Preheat oven to 350° F. and butter and flour two 8-inch round cake pans, knocking out excess flour.",
        "On a baking sheet toast walnuts in middle of oven until 1 shade darker, about 8 minutes, and cool. In a food processor grind walnuts fine.",
        "Into a bowl sift together flour, baking powder, and a pinch salt. In a small cup stir together espresso powder and water. In a large bowl with an electric mixer beat together butter and sugar until light and fluffy and add eggs, 1 at a time, beating well after each addition. Beat in flour mixture, espresso, walnuts, and oil until just combined.",
        "Spoon batter into cake pans, smoothing tops, and bake in middle of oven about 25 minutes, or until pale golden and a tester comes out clean. Cool cake layers in pans on a rack 15 minutes. Run a thin knife around edges of pans and invert cake layers onto rack to cool completely.",
        "In a small bowl beat together cream cheese and 2 tablespoons maple syrup until smooth.",
        "Arrange 1 cake layer on an ovenproof serving plate and with a pastry brush gently brush top with 1 1/2 tablespoons maple syrup. Spread cream cheese mixture evenly onto layer and top with remaining layer. Brush top of torte with remaining 1 1/2 tablespoons maple syrup. Torte may be prepared up to this point 2 days ahead and chilled, covered. Bring torte to room temperature before proceeding.",
        "Let whites stand at room temperature 1 hour. In a 1-quart heavy saucepan bring maple syrup to a boil over moderate heat and simmer until a candy thermometer registers 235° F. (be careful it doesn―t bubble over).",
        "While maple syrup is simmering, in bowl of a standing electric mixer beat whites with cream of tartar and a pinch salt until they just hold stiff peaks. Add hot maple syrup in a stream, beating until meringue is thickened and glossy, 1 to 2 minutes.",
        "Preheat broiler.",
        "Immediately frost torte with a narrow metal spatula, mounding extra meringue on top and drawing it up with a fork to form peaks (see photograph, page 111). Broil torte about 4 inches from heat until tops of peaks are pale golden, about 30 seconds. Let torte stand at room temperature 15 minutes before serving."
    ],
    "ingredients": [
        "1 cup walnuts",
        "1 cup cake flour (not self-rising)",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon instant espresso powder",
        "1 tablespoon boiling-hot water",
        "1 1/2 sticks (1/8 cup) unsalted butter, softened",
        "3/4 cup sugar",
        "3 large eggs",
        "1 1/2 tablespoons vegetable oil",
        "6 ounces cream cheese, softened",
        "5 tablespoons pure maple syrup",
        "2 large egg whites",
        "1 cup pure maple syrup",
        "1/4 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Cheese",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Spring",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut Maple Torte with Maple Meringue Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-maple-torte-with-maple-meringue-frosting-14100"
}
