{
    "directions": [
        "Combine first 3 ingredients in processor. Using on/off turns, process until mixture resembles coarse meal. Add water 1 tablespoon at a time, processing until moist clumps form Gather into ball. Flatten into disk. Wrap in plastic; chill 30 minutes. (Can be made 1 day ahead. Keep chilled. Let soften slightly before pressing out.)",
        "Preheat oven to 350°F. Lightly butter 9-inch-diameter tart pan with removable bottom. Press dough into bottom and up sides of prepared pan. Pierce crust several times with fork. Freeze crust 15 minutes.",
        "Bake crust until golden, piercing with fork if bubbles form, about 20 minutes. Transfer pan to rack and cool crust completely. Maintain oven temperature.",
        "Combine cream and sugar in heavy medium saucepan. Bring to simmer, stirring until sugar dissolves. Whisk in liqueur, orange peel, vanilla and salt. Remove from heat. Place crust in pan on baking sheet. Sprinkle nuts on crust. Ladle cream mixture over. Bake tart until mixture bubbles and top is light brown, about 35 minutes. Transfer tart to rack and cool completely."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-pieces",
        "1 teaspoon vanilla extract",
        "2 tablespoons (about) ice water",
        "3/4 cup whipping cream",
        "3/4 cup sugar",
        "2 tablespoons orange liqueur",
        "1 tablespoon grated orange peel",
        "1/2 teaspoon vanilla extract",
        "1 3/4 cups (6 1/2 ounces) walnut halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Orange",
        "Walnut",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut-Orange Tart",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-orange-tart-4579"
}
