{
    "directions": [
        "Bring apricots and orange juice to simmer in small saucepan. Remove from heat, cover, and let soften 20 minutes. Using slotted spoon, transfer apricots to processor and chop coarsely. Reserve juice in saucepan.",
        "Combine honey, 1/2 cup water, and orange peel in heavy large saucepan. Bring to boil. Reduce heat and simmer until syrup coats spoon, about 10 minutes. Cool slightly. Remove orange peel and reserve. Add lemon juice and reserved orange juice to syrup. Cool.",
        "Preheat oven to 350°F. Brush 9-inch-diameter cake pan with 2-inch-high sides with 1 tablespoon butter. Using electric mixer, beat egg yolks, sugar, and salt in large bowl until pale and thick. Stir in farina, walnuts, 5 tablespoons melted butter, and apricots.",
        "Using clean dry beaters, beat egg whites in another large bowl until stiff but not dry. Fold whites into batter in 3 additions; transfer to prepared pan.",
        "Bake until cake is golden and tester inserted into center comes out clean, about 30 minutes. Immediately pour all of syrup over cake in pan. Cover pan loosely with foil; let cake stand until cool. Turn out cake and syrup onto platter. Garnish with reserved orange peel."
    ],
    "ingredients": [
        "1 6-ounce package dried apricots",
        "1/3 cup orange juice",
        "1 1/2 cups orange blossom honey",
        "1/2 cup water",
        "Peel of 1 orange, removed in strips using vegetable peeler",
        "2 tablespoons fresh lemon juice",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "5 large eggs, separated",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "1 cup farina (10-minute Cream of Wheat; not instant)",
        "1 cup walnuts, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Apricot",
        "Walnut",
        "Summer",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut-Apricot Cake in Honey Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-apricot-cake-in-honey-syrup-106498"
}
