{
    "directions": [
        "Cook pancetta in oil in a large heavy skillet over moderately low heat, stirring frequently, until golden and fat is rendered, 10 to 12 minutes. Add onion and marjoram and cook, stirring occasionally, until onion is well browned, 10 to 15 minutes. Remove from heat and transfer half of mixture to a 2-quart saucepan and remaining half to a bowl. Stir walnuts, parsley, 1/8 teaspoon salt, and pepper into mixture in bowl. Cool filling.",
        "Add water, red pepper flakes, and cheese rind to pancetta mixture in saucepan and simmer briskly, uncovered, until reduced to about 1 cup, about 12 minutes. Pour through a fine sieve into a bowl and stir in remaining 1/8 teaspoon salt.",
        "Place 1 level teaspoon filling in center of 1 pasta square, keeping remaining squares covered tightly with plastic wrap. Moisten edges of pasta square with water and fold in half to form a triangle, pressing around filling to force out air (air pockets increase the chance of pansoti breaking during cooking) and then pressing edges to seal. Transfer to a dry kitchen towel. Make more pansoti in same manner.",
        "Cook asparagus tips in a small saucepan of salted boiling water until crisp-tender, about 2 minutes. Drain in a sieve and plunge into a bowl of ice and cold water to stop cooking. Drain and pat dry.",
        "Bring a 6-quart pot of salted water to a boil, then add pansoti and cook at a strong simmer, gently stirring once or twice, until tender, 3 to 5 minutes.",
        "While pansoti are boiling, cook asparagus tips in oil in a small skillet over low heat until heated through, 1 to 2 minutes.",
        "Heat sauce in a 12-inch skillet over moderate heat until hot. Transfer pansoti with a slotted spoon to sauce and cook over moderate heat, stirring gently, 1 minute. Transfer pansoti to plates with slotted spoon, then top with some sauce and sprinkle with asparagus tips."
    ],
    "ingredients": [
        "1 (3-ounce) piece pancetta (Italian unsmoked cured bacon; not lean), finely chopped (2/3 cup)",
        "1 tablespoon olive oil",
        "1 large onion, finely chopped",
        "3/4 teaspoon dried marjoram, crumbled",
        "1/2 cup walnuts (2 ounces), finely chopped",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 cups water",
        "1/8 teaspoon dried hot red pepper flakes",
        "1 (3- by 2-inch) rind from a wedge of Parmigiano-Reggiano",
        "24 (3 1/2-inch) fresh pasta squares",
        "1 1/2 cups asparagus tips (from 2 lb asparagus), halved lengthwise",
        "1 teaspoon extra-virgin olive oil",
        "Accompaniment: grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Parmesan",
        "Bacon",
        "Walnut",
        "Asparagus",
        "Spring",
        "Gourmet"
    ],
    "title": "Walnut and Pancetta Pansoti with Asparagus in Parmesan Broth",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-and-pancetta-pansoti-with-asparagus-in-parmesan-broth-106254"
}
