{
    "directions": [
        "Preheat the oven to 350°F. Lightly butter and flour a 9-inch round cake pan and tap out the excess flour.",
        "To prepare the cake, in a bowl, combine the flour, baking powder and salt and whisk 8 to 10 times until well mixed.",
        "Using an electric mixer set on medium-high speed, cream the butter and sugar. Add the egg yolks and beat until smooth. Add the dry ingredients in 3 or 4 batches, alternating with the milk and ending with the dry ingredients. Stir well and fold in the nuts and vanilla.",
        "Using an electric mixer set on medium-high speed, beat the egg whites until they hold stiff peaks. Fold the whites into the batter just until mixed. Spread the batter in the cake pan. Bake in the center oven rack for 35 to 40 minutes or until a toothpick inserted in the center comes out clean. Turn out onto a wire rack to cool.",
        "To prepare the pears, in a sauté pan or skillet, melt the butter over medium-high heat and cook the pears, stirring, for about 5 minutes, or just until softened. Sprinkle with the sugar. Add the cinnamon, nutmeg and lemon juice and mix well. Cover to keep warm.",
        "To make the cream, using an electric mixer set on medium-high speed, whip the cream and sugar until the cream is thick but not dry. Add the cinnamon and continue whipping until the cream is the desired consistency. Serve the cake topped with the pears and cream."
    ],
    "ingredients": [
        "1 1/4 cups unbleached all-purpose flour",
        "1 teaspoon baking powder",
        "pinch of salt",
        "1/2 cup (1 stick) unsalted butter, at room temperature, cut into pieces",
        "1 cup sugar",
        "2 large eggs, at room temperature, separated",
        "1/2 cup milk",
        "1 cup chopped walnuts",
        "1 teaspoon pure vanilla extract",
        "2 tablespoons unsalted butter",
        "6 small Bosc pears, cored, peeled and cut into 1/4-inch pieces",
        "2 tablespoons brown sugar",
        "1 tablespoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "2 tablespoons fresh lemon juice",
        "1 cup heavy cream",
        "1 tablespoon sugar",
        "1 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Pear",
        "Walnut",
        "Fall",
        "Cinnamon"
    ],
    "title": "Walnut Cake with Sauteed Pears and Cinnamon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-cake-with-sauteed-pears-and-cinnamon-cream-15845"
}
