{
    "directions": [
        "Combine milk, cream, peppercorns, and salt in heavy large saucepan. Bring just to simmer. Whisk yolks and sugar in medium bowl. Gradually whisk hot milk mixture into yolk mixture. Return to saucepan and stir constantly over medium heat until mixture is thick enough to coat back of spoon, about 3 minutes (do not boil). Strain custard into medium bowl; cover and refrigerate until cold, about 4 hours.",
        "Do ahead: Can be made 1 day ahead. Keep chilled.",
        "Transfer custard to ice cream maker and process according to manufacturer's instructions. Transfer ice cream to container; cover and freeze.",
        "Preheat oven to 350°F. Butter and flour 13x9x2-inch metal baking pan. Process walnuts and powdered sugar in processor until nuts are finely ground. Transfer to large bowl. Add almond flour, all purpose flour, and salt. Using electric mixer, beat egg whites and vanilla extract in large bowl until frothy. With mixer running, gradually add brown sugar and beat until stiff peaks form. Stir 1/3 egg-white mixture into flour mixture. Fold in remaining egg-white mixture in 2 additions. Pour into prepared pan. Bake cake until tester inserted into center comes out clean, about 27 minutes. Cool cake in pan on rack.",
        "Melt butter with sugar and honey in heavy extra-large skillet over medium-high heat. Add pears and cook until liquid evaporates and pears are golden brown, about 15 minutes. Stir in brandy and lemon juice.",
        "Cut cake into 8 pieces. Place cake on plates. Arrange shaved cheese on side of plates. Top with sautéed pears and scoop of black pepper ice cream."
    ],
    "ingredients": [
        "3 cups whole milk",
        "1 cup heavy whipping cream",
        "1 tablespoon whole black peppercorns",
        "Pinch of salt",
        "7 large egg yolks",
        "1/2 cup plus 1 tablespoon sugar",
        "2 cups (about 1/2 pound) chopped walnuts",
        "2 cups powdered sugar",
        "3/4 cup almond flour*",
        "1/2 cup all purpose flour",
        "1/4 teaspoon salt",
        "9 large egg whites",
        "1 teaspoon vanilla extract",
        "1/2 cup (packed) golden brown sugar",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1/4 cup sugar",
        "1 1/2 tablespoons honey",
        "6 firm Anjou pears, peeled, cored, cut into 1/4-inch-thick slices",
        "1 1/2 tablespoons pear brandy",
        "1 tablespoon fresh lemon juice",
        "1/2 cup shaved Pecorino Romano cheese",
        "*Available at specialty foods stores and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Ice Cream Machine",
        "Cheese",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Sauté",
        "Pear",
        "Walnut",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut Cake with Sautéed Pears, Pecorino, and Black Pepper Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-cake-with-sauteed-pears-pecorino-and-black-pepper-ice-cream-235858"
}
