{
    "directions": [
        "Scrape seeds from vanilla bean into heavy medium saucepan; add bean. Add figs, raspberries with juices and all remaining ingredients. Bring to simmer, stirring until sugar dissolves. Simmer over medium heat until figs are tender, about 30 minutes. Cool. (Can be prepared 3 days ahead. Cover and chill.)",
        "Combine 1 cup milk and next 7 ingredients in blender. Blend until smooth, occasionally scraping down sides of blender. Cover; chill crepe batter in blender container 2 hours. Re-blend batter 15 seconds. If necessary, thin batter with additional milk, 1 tablespoon at a time, to consistency of heavy cream.",
        "Heat nonstick skillet with 7-inch-diameter bottom over medium-high heat. Brush skillet with additional melted butter. Pour scant 1/4 cup crepe batter into skillet, tilting skillet quickly to coat bottom. Cook until top of crepe appears dry and bottom is golden, loosening sides of crepe with spatula, about 35 seconds. Turn crepe over; cook until brown spots appear on bottom, about 20 seconds. Turn crepe out onto plate. Repeat with remaining batter. Stack crepes on plate.",
        "Brush 13 x 9 x 2-inch glass baking dish with additional melted butter. Spoon generous 2 tablespoons filling onto center of spotted side of 1 crepe. Spread filling to within 1 inch of edge of crepe. Fold crepe in half, then fold in half again, forming wedge shape. Place filled crepe in prepared dish. Repeat with remaining crepes and filling, overlapping crepes slightly in dish. Brush crepes lightly with melted butter. Sprinkle lightly with additional sugar. Cover dish with foil. Stir crème fraîche and honey in small bowl to blend. (Crepes and honey crème fraîche can be prepared 1 day ahead. Cover separately and chill.)",
        "Preheat oven to 350°F. Bake crepes, covered, until heated through, about 20 minutes. Place 2 crepes on each of 6 plates. Top with dollop of honey crème fraîche and serve."
    ],
    "ingredients": [
        "1/2 vanilla bean, split lengthwise",
        "1 1/2 cups chopped dried Calimyrna figs",
        "1 12-ounce package frozen sweetened raspberries (not packed in syrup), thawed, juice reserved",
        "1 cup Muscat wine",
        "1 cup water",
        "1/4 cup (packed) dark brown sugar",
        "2 tablespoons honey",
        "2 teaspoons orange peel",
        "1 cup (or more) whole milk",
        "1 cup all purpose flour",
        "3 large eggs",
        "1/4 cup chopped walnuts",
        "2 tablespoons sugar",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "1 teaspoon grated orange peel",
        "1/4 teaspoon salt",
        "Additional melted butter",
        "Additional sugar",
        "1 8-ounce container crème fraîche*",
        "2 tablespoons honey",
        "*Available at some supermarkets. If unavailable, heat 1 cup whipping cream to lukewarm (85°F.). Remove from heat; mix in 2 tablespoons buttermilk. Cover; let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Chill until ready to use."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Berry",
        "Fruit",
        "Nut",
        "Dessert",
        "Raspberry",
        "Fig",
        "Walnut",
        "Spring",
        "Honey"
    ],
    "title": "Walnut Crepes with Raspberries and Dried Figs",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-crepes-with-raspberries-and-dried-figs-101608"
}
