{
    "directions": [
        "Combine flour, brown sugar and salt in medium bowl. Add butter and cut in with fingers or pastry blender until mixture resembles coarse meal. Beat egg yolk and water in small bowl to blend. Pour over flour mixture. Stir with fork until mixture forms dough. Gather into ball; flatten into disk. Wrap dough and chill until firm, at least 30 minutes.",
        "Preheat oven to 400°F. Roll dough out on lightly floured surface to 12-inch- diameter round. Roll up on rolling pin and transfer to 9-inch-diameter tart pan with removable bottom. Fit dough into pan and trim edges. Freeze until firm, about 20 minutes. Bake crust until golden brown, piercing with toothpick if crust bubbles, about 15 minutes. Cool slightly. Maintain oven temperature.",
        "Place walnuts on cookie sheet and toast in oven until just golden brown and fragrant, about 8 minutes. Cool. Reduce oven temperature to 350°F.",
        "Dissolve instant coffee in 2 tablespoons water in large bowl. Add brown sugar and whisk until smooth. Whisk in eggs, corn syrup, butter and salt. Stir in walnuts. Pour filling into prepared crust and bake until set, about 30 minutes. Cool tart on rack. (Tart can be prepared 6 hours ahead. Cover loosely and let stand at room temperature.)",
        "Dissolve instant coffee in 1 teaspoon water in small bowl. Whip cream and sugar until medium-soft peaks form. Add coffee mixture and continue beating until stiff peaks form.",
        "Serve tart with whipped cream."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "1 tablespoon dark brown sugar",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into small pieces",
        "1 large egg yolk",
        "1 tablespoon ice water",
        "1 1/4 cups chopped walnuts (about 5 ounces)",
        "2 tablespoons instant coffee granules",
        "2 tablespoons water",
        "1/2 cup firmly packed dark brown sugar",
        "3 large eggs",
        "1/2 cup light corn syrup",
        "1/4 cup (1/2 stick) unsalted butter, melted, cooled",
        "1/8 teaspoon salt",
        "1 teaspoon instant coffee granules",
        "1 teaspoon water",
        "1 cup chilled whipping cream",
        "2 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Walnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut and Coffee Tart with Coffee Cream",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-and-coffee-tart-with-coffee-cream-1292"
}
