{
    "directions": [
        "Preheat oven to 350°F. Using coarse grating disc (with large holes), grate walnuts in processor. Remove grating disc, leaving walnuts in processor bowl. Fit processor with metal blade. Using on/off turns, grind walnuts until finely ground but not pasty. Set aside 2 tablespoons ground walnuts for garnish.",
        "Butter bottom (not sides) of 9-inch-diameter springform pan. Using electric mixer, beat egg yolks in large bowl until light and fluffy, about 4 minutes. Gradually add 1/2 cup sugar, beating until well blended. Stir remaining ground walnuts into yolk mixture. Using clean dry beaters, beat egg whites in another large bowl until stiff but not dry. Fold whites into nut mixture in 2 additions. Transfer batter to prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 40 minutes. Cool 5 minutes. Run knife between cake and pan sides to loosen; remove pan sides. Cool cake completely on rack (cake will fall in center). (Cake can be prepared 1 day ahead. Cover and store at room temperature.)",
        "Using electric mixer, beat cream, powdered sugar, coffee mixture, and vanilla in large bowl until peaks form. Spread coffee whipped cream onto top of cake. Sprinkle top with reserved ground walnuts; arrange walnut halves in center of cake. Cut cake into wedges."
    ],
    "ingredients": [
        "1 cup plus 6 tablespoons walnuts (about 5 ounces)",
        "4 large eggs, separated",
        "1/2 cup sugar",
        "1 cup chilled heavy whipping cream",
        "3 tablespoons powdered sugar",
        "1 teaspoon instant coffee crystals dissolved in 2 teaspoons heavy whipping cream",
        "3/4 teaspoon vanilla extract",
        "Walnut halves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Nut",
        "Dessert",
        "Bake",
        "Walnut",
        "Fall",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Walnut Torte with Coffee Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-torte-with-coffee-whipped-cream-232895"
}
