{
    "directions": [
        "Melt butter in heavy large skillet over medium heat. Add onion and sauté until tender, about 5 minutes. Let cool.",
        "Combine milk and sugar in large bowl. Sprinkle yeast over; stir to blend. Let stand until foamy, about 10 minutes. Transfer to processor. Mix in onion mixture, salt and 1 cup flour. Blend in enough remaining flour, 1 cup at a time, to form smooth ball. Transfer dough to floured work surface and knead until smooth and elastic, about 3 minutes. Shape dough into ball.",
        "Butter large bowl. Place dough in bowl; turn to coat. Cover bowl with clean kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 45 minutes.",
        "Butter heavy large baking sheet. Punch down dough. Turn out onto floured work surface. Sprinkle walnuts over; knead to incorporate. Divide dough in half. Shape each half into 6-inch round loaf. Place dough rounds on prepared baking sheet, spacing 4 inches apart. Flatten slightly. Cover with dry towel. Let rise in warm draft-free area until almost doubled in volume, about 45 minutes. Preheat oven to 400°F. Bake until loaves are golden brown and sound hollow when tapped on bottom, about 25 minutes. Transfer to racks; cool. Serve at room temperature."
    ],
    "ingredients": [
        "1/2 cup (1 stick) butter or walnut oil",
        "3/4 cup finely chopped onion",
        "2 cups warm milk (105°F. to 115°F.)",
        "2 tablespoons sugar",
        "2 envelopes dry yeast",
        "2 teaspoons salt",
        "5 cups (about) all purpose flour",
        "3/4 cup walnuts, toasted, coarsely chopped (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Food Processor",
        "Onion",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Walnut"
    ],
    "title": "Walnut Bread",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-bread-4249"
}
