{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Generously grease a 9- by 2-inch round cake pan with softened butter or vegetable oil and dust with some matzo meal, knocking out excess.",
        "Pour hot water over dates in a large bowl and let stand 15 minutes to soften.",
        "Pulse walnuts in a food processor until chopped, then add 1/4 cup sugar and pulse until nuts are finely ground. Add matzo meal (2/3 cup), zest, cardamom, and salt and pulse until combined.",
        "Beat egg whites with a pinch of salt in a bowl using an electric mixer at medium-high speed until they just hold soft peaks. Add remaining 1/2 cup sugar in a slow stream, beating until whites hold stiff glossy peaks.",
        "Whisk yolks into date mixture. Fold one third of yolk mixture into whites, then fold in remaining yolk mixture gently but thoroughly. Fold all of nut mixture into batter.",
        "Spoon batter into cake pan and bake until golden and springy to the touch and cake just begins to pull away from side of pan, 35 to 40 minutes. Cool in pan on a rack 30 minutes, then invert onto rack and cool completely."
    ],
    "ingredients": [
        "1/4 cup boiling-hot water",
        "1 1/2 cups pitted dates (1/2 pound), finely chopped",
        "1 1/2 cups walnuts (5 ounces), toasted and cooled",
        "3/4 cup sugar, divided",
        "2/3 cup matzo meal",
        "1 tablespoon grated orange zest",
        "1/2 teaspoon ground cardamom",
        "1/4 teaspoon salt",
        "4 large eggs, separated, at room temperature 30 minutes",
        "Accompaniment: unsweetened whipped cream",
        "Garnish: Passover powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Passover",
        "Date",
        "Walnut",
        "Spring",
        "Kosher",
        "Kosher for Passover",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Walnut-Date Torte",
    "url": "http://www.epicurious.com/recipes/food/views/walnut-date-torte-242024"
}
