{
    "directions": [
        "Position oven rack in middle of oven and preheat to 400°F. Mix 2 tablespoons sugar and 1/2 teaspoon ground cinnamon in small bowl. Unfold thawed puff pastry on lightly floured baking sheet. Brush some of egg glaze over 1-inch border of pastry on all sides. Fold 1-inch border over to form raised edge on all sides; press edge to adhere. Using sharp knife, make 1/2-inch-long cuts all around pastry edge, spacing 1/2 inch apart. Pierce center of pastry (not edge) all over with fork. Spread 2 tablespoons apricot preserves over center of pastry. Arrange apple slices atop apricot preserves in 3 rows, overlapping apples and fitting tightly together. Brush pastry edge with some of egg glaze. Sprinkle cinnamon-sugar mixture over apples and pastry edge.",
        "Bake tart until apples are tender and pastry is brown, about 30 minutes. Transfer tart to rack.",
        "Meanwhile, mix remaining 1/4 teaspoon ground cinnamon, remaining 6 tablespoons apricot preserves, 2 tablespoons fresh lemon juice and 1 1/2 tablespoons unsalted butter in small sauce-pan. Stir apricot sauce over medium heat until melted and hot.",
        "Lightly dab some of apricot sauce over apples. Sprinkle with dried currants. Cut warm tart into 4 squares. Top each square with scoop of vanilla ice cream. Drizzle remaining apricot sauce over ice cream and serve."
    ],
    "ingredients": [
        "2 tablespoons sugar",
        "3/4 teaspoon ground cinnamon",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "1 egg, beaten to blend (for glaze)",
        "8 tablespoons apricot preserves",
        "1 Golden Delicious apple (6 ounces), peeled, cored, very thinly sliced",
        "2 tablespoons fresh lemon juice",
        "1 1/2 tablespoons unsalted butter",
        "Dried currants",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Currant",
        "Apple",
        "Fall",
        "Cinnamon"
    ],
    "title": "Warm Cinnamon-Apple Tart with Currants",
    "url": "http://www.epicurious.com/recipes/food/views/warm-cinnamon-apple-tart-with-currants-103039"
}
