{
    "directions": [
        "Whisk sugar and egg yolks in medium bowl to blend. Bring half and half and lemon peel to simmer in heavy medium saucepan. Gradually whisk hot half and half mixture into yolk mixture. Return to saucepan. Stir over medium heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 5 minutes (do not boil). Strain custard into bowl; discard solids. Whisk lemon juice and vanilla into custard. Chill until cold, about 3 hours. (Can be prepared 2 days ahead. Cover and keep refrigerated.)",
        "Preheat oven to 350°F. Butter 9-inch-diameter cake pan with 2-inch-high sides. Stir sugar and water in heavy small saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until syrup turns deep amber, occasionally swirling pan and brushing down sides of pan with wet pastry brush, about 10 minutes. Pour caramel over bottom of prepared pan. Overlap pears atop caramel.",
        "Mix flour, baking powder and salt in medium bowl. Using electric mixer, beat sugar and butter in large bowl until creamy. Add eggs and lemon peel; beat until light and fluffy. Combine milk and brandy in small bowl. Mix dry ingredients into batter alternately with milk mixture in 3 additions each. Stir in nuts.",
        "Pour batter atop pears in pan. Bake cake until golden on top and tester inserted into center comes out clean, about 1 hour. Cool in pan 5 minutes. Run small knife around edges of pan to loosen cake. Place platter over cake and invert onto platter. Let stand 1 minute. Remove pan. Serve cake warm with cold sauce."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "2 large egg yolks",
        "1 cup half and half",
        "2 tablespoons grated lemon peel",
        "1/2 teaspoon fresh lemon juice",
        "1/4 teaspoon vanilla extract",
        "3/4 cup sugar",
        "3 tablespoons water",
        "2 large Anjou pears, peeled, cored, cut into thin wedges",
        "1 1/2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "1 cup plus 2 tablespoons sugar",
        "1/2 cup (1 stick) plus 1 tablespoon unsalted butter, room temperature",
        "2 large eggs",
        "1 tablespoon grated lemon peel",
        "6 tablespoons milk (do not use low-fat or nonfat)",
        "3 tablespoons brandy",
        "6 tablespoons finely chopped walnuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Lemon",
        "Pear",
        "Walnut",
        "Fall"
    ],
    "title": "Warm Pear and Walnut Cake with Lemon Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/warm-pear-and-walnut-cake-with-lemon-custard-sauce-4432"
}
