{
    "directions": [
        "Butter and flour 6 individual ovenproof bowls, about 2/3 cup capacity. Set on a baking sheet and spoon 1 tbsp corn syrup into each of the molds (this will become the sticky topping). Set aside.",
        "Remove the pits from the dates and chop them into small pieces. Place in a bowl and add the sherry and just enough boiling water to cover. Let soak for 10 minutes.",
        "Preheat the oven to 375°F (convection oven to 375°F). Cream the butter and sugar together either by hand or using an electric mixer until soft, light, and creamy. Add the eggs, one at a time, beating well after each addition. (The mixture may appear to separate at this point, but it will come back together.)",
        "Sift together the flour, salt, and baking powder, combine with the ground almonds, and fold into the batter with the orange zest. Squeeze out the excess moisture from the dates, add to the mixture, and stir well to combine.",
        "Divide the batter among the ovenproof bowls, filling them no more than two-thirds full. Bake until well risen, golden, and springy to the touch, 20 to 25 minutes.",
        "To unmold, run a small knife around the inside of each mold and invert the pudding onto a warm plate. Serve the little desserts at once, either on their own or, as I prefer, with a dollop of cream."
    ],
    "ingredients": [
        "1/2 cup plus 1 tbsp unsalted butter, plus extra to grease",
        "all-purpose flour, to dust",
        "3/8 cup light corn syrup, slightly warmed",
        "12 Medjool dates",
        "1 tbsp Pedro Ximénez sherry",
        "2/3 cup superfine sugar",
        "2 organic large eggs",
        "scant 1/2 cup self-rising flour",
        "small pinch of salt",
        "1 tsp baking powder",
        "1/3 cup ground almonds",
        "finely grated zest of 1 orange"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Vegetarian",
        "Kid-Friendly",
        "Date",
        "Tree Nut",
        "Almond",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Date and Almond Puddings",
    "url": "http://www.epicurious.com/recipes/food/views/warm-date-and-almond-puddings-358409"
}
