{
    "directions": [
        "Cook bacon in heavy large skillet over medium heat until crisp. Using slotted spoon, transfer bacon to paper towels. Pour off drippings and reserve. Combine 1/4 cup reserved drippings with remaining ingredients in small bowl. Season to taste with salt and pepper.",
        "Working over small bowl and using small sharp knife, cut between membranes of oranges to release segments; add to bowl. Tear spinach and radicchio into bite-size pieces and place in large bowl. (Can be prepared 1 day ahead. Cover dressing, orange segments, greens and reserved bacon drippings separately and refrigerate.)",
        "Drain orange segments. Heat 2 tablespoons reserved bacon drippings in heavy large skillet over medium-high heat. Add shiitake mushrooms and sauté 1 minute. Add oyster mushrooms and season with salt and pepper. Sauté until golden brown, about 2 minutes. Add mushrooms to greens and toss. Pour dressing into same skillet and boil 2 minutes. Pour dressing over greens. Add bacon, orange segments and chopped hazelnuts. Toss to combine. Season to taste with salt and pepper. Garnish salad with enoki mushrooms and serve."
    ],
    "ingredients": [
        "8 ounces sliced bacon, cut into 1-inch pieces",
        "3/4 cup fresh orange juice",
        "1/4 cup plus 2 tablespoons minced shallots",
        "1/4 cup olive oil",
        "1/4 cup balsamic vinegar or red wine vinegar",
        "4 oranges, peeled, white pith removed",
        "10 ounces spinach, stems trimmed",
        "1 medium head radicchio",
        "6 ounces fresh shiitake mushrooms, stemmed, sliced",
        "6 ounces fresh oyster mushrooms",
        "1/2 cup (generous) toasted hazelnuts, coarsely chopped",
        "1 3 1/2-ounce packageenoki mushrooms (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mushroom",
        "Sauté",
        "Lunch",
        "Orange",
        "Bacon",
        "Spinach",
        "Hazelnut",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Warm Orange and Mushroom Spinach Salad",
    "url": "http://www.epicurious.com/recipes/food/views/warm-orange-and-mushroom-spinach-salad-1426"
}
