{
    "directions": [
        "Stir honey, sugar, butter, cinnamon, and salt in medium skillet over medium heat until sugar melts. Cook until mixture boils and is deep golden brown, about 3 minutes. Mix in walnuts. Pour out onto sheet of foil; cool completely. Chop walnut crunch into small pieces. Do ahead Can be made 2 days ahead. Store airtight at room temperature.",
        "Stir 1/2 cup sugar, 1 tablespoon water, and salt in heavy large skillet over medium heat until sugar is evenly moist. Cook until sugar begins to turn golden, stirring occasionally, about 4 minutes (mixture may be granular). Place figs in sugar mixture, cut side down, and cook until figs begin to release juice, about 3 minutes. Add butter; swirl skillet to melt. Remove skillet from heat. Add Port and let stand 5 minutes. Using slotted spoon, transfer figs to plate and cool. Return syrup to boil, whisking until smooth. Cool syrup completely. Do ahead Figs and syrup can be made 1 day ahead. Cover separately and chill. Rewarm syrup before using.",
        "Preheat oven to 350°F. Line baking sheet with foil. Roll out thawed puff pastry on lightly floured surface to 12x8-inch rectangle. Using 3 1/2-inch round cutter, cut out 6 rounds; arrange on prepared sheet. Divide walnut crunch among pastry rounds. Top each with 3 fig halves, cut side up.",
        "Bake tartlets until pastry is puffed and golden, about 30 minutes. Do ahead Tartlets can be made 2 hours ahead. Let stand at room temperature. Rewarm at 350°F for 8 minutes.",
        "Arrange cheese atop warm tartlets. Brush or drizzle with warm Port syrup, then top with cube of honeycomb or drizzle with honey."
    ],
    "ingredients": [
        "2 tablespoons honey",
        "2 tablespoons sugar",
        "1 tablespoon butter",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "6 tablespoons chopped toasted walnuts",
        "1/2 cup sugar",
        "1 tablespoon water",
        "Pinch of salt",
        "9 fresh figs (preferably black Mission), stemmed, cut lengthwise in half",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 cup ruby Port",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "3 ounces La Fourme d'Ambert or Stilton blue cheese, diced or coarsely crumbled, room temperature",
        "Honeycomb or honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Blue Cheese",
        "Fig",
        "Walnut",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Black Mission Fig, Walnut Crunch, and Blue Cheese Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/warm-black-mission-fig-walnut-crunch-and-blue-cheese-tartlets-236218"
}
