{
    "directions": [
        "Position rack in center of oven and preheat to 425°F. Whisk flour, 6 tablespoons sugar, baking powder, salt, and baking soda in medium bowl to blend. Add butter and shortening and rub in with fingertips until coarse meal forms. Whisk buttermilk and 1 egg to blend in small bowl. Add to flour mixture and stir until moist clumps form. Gather dough together; turn out onto floured work surface and knead gently just until dough holds together, about 5 turns (dough will be moist). Pat dough into 9x6-inch rectangle; cut into six 3-inch squares. Transfer squares to heavy ungreased baking sheet, spacing apart. (Can be prepared 4 hours ahead. Cover tightly and refrigerate.)",
        "Whisk egg white in small bowl until foamy. Add pecans and stir to blend. Spread pecan mixture over top of biscuits, dividing equally. Sprinkle squares with remaining 3 teaspoons sugar. Bake biscuits until puffed and light golden, about 18 minutes. Cool biscuits 10 minutes.",
        "Meanwhile, beat whipping cream, brown sugar, and bourbon in medium bowl until soft peaks form.",
        "Using serrated knife, cut warm biscuits horizontally in half. Place 1 bottom half on each of 6 plates. Top with Brown Sugar Peaches. Spoon generous dollop of bourbon whipped cream atop each. Cover with biscuit tops. Garnish each with dollop of bourbon whipped cream and 1 strawberry; serve immediately."
    ],
    "ingredients": [
        "2 1/2 cups unbleached all purpose flour",
        "6 tablespoons plus 3 teaspoons sugar",
        "4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1/2 cup solid vegetable shortening, frozen, cut into 1/2-inch pieces",
        "2/3 cup chilled buttermilk",
        "1 large egg",
        "1 large egg white",
        "3/4 cup finely chopped pecans (about 2 1/2 ounces)",
        "1 cup chilled whipping cream",
        "2 tablespoons (packed) golden brown sugar",
        "1 1/2 tablespoons bourbon",
        "Brown Sugar Peaches",
        "6 large strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Summer"
    ],
    "title": "Warm Peach Shortcakes with Bourbon-Brown Sugar Cream",
    "url": "http://www.epicurious.com/recipes/food/views/warm-peach-shortcakes-with-bourbon-brown-sugar-cream-106859"
}
