{
    "directions": [
        "To prepare the ice cream: Prepare an ice water bath. Place the dates, vanilla bean pulp, heavy cream, half-and-half, and milk in a medium saucepan and bring to a simmer over medium heat. Whisk the egg yolks in a large bowl and slowly pour in the hot cream mixture. Puree the cream mixture until smooth, return to the saucepan, and cook for 3 minutes, stirring constantly. Strain through a fine-mesh sieve, and cool in the ice water bath. Freeze in an ice cream machine and keep frozen until ready to use.",
        "To prepare the dough: Using an electric mixer or by hand, combine the flour, butter, sugar, and salt in a large bowl until pebble-sized balls form. Add the egg yolk and water all at one time and mix until the dough just comes together. Remove the dough from the mixer, pat into a disc, and cover with plastic wrap. Refrigerate for at least 1 hour.",
        "To prepare the caramel: Place the sugar in a medium saucepan and cook over medium-low heat for 10 minutes, or until golden brown. Add the butter and vanilla pulp and cook for 2 minutes. Add the apple wedges and cook for 4 to 6 minutes or until the apples are half cooked. Remove the apples from the caramel and reserve both separately.",
        "To prepare the tart: Preheat the oven to 350°F. Roll out the dough to 1/8 inch thick and carefully press into an 8- or 9-inch tart ring, trimming any excess. Place the tart ring on a parchment-lined sheet pan and sprinkle 1/2 cup of the chopped pecans in the bottom of the shell. Pinwheel the apple slices in the tart and brush with some of the caramel sauce. Bake the tart for 20 to 30 minutes, or until golden brown.",
        "To prepare the red wine-caramel sauce: Place the red wine in a small saucepan and simmer over medium heat for 20 minutes, or until reduced to 1/4 cup. Add the remaining caramel sauce to the red wine reduction and whisk until smooth. Fold in the remaining 1/4 cup of pecans and keep warm.",
        "Cut the tart into 8 pieces and place a piece in the center of each plate. Spoon the red wine-caramel sauce around the tart and top the tart with a scoop of the date ice cream."
    ],
    "ingredients": [
        "14 ounces dried dates, pitted and chopped",
        "Pulp of 1 vanilla bean",
        "1 1/2 cups heavy cream",
        "3/4 cup half-and-half",
        "3/4 cup milk",
        "6 egg yolks",
        "1 1/4 cups flour",
        "2/3 cup cold unsalted butter, cubed",
        "2 tablespoons sugar",
        "3/4 teaspoon salt",
        "1 egg yolk",
        "3 tablespoons ice water",
        "1 1/2 cups sugar",
        "4 tablespoons butter",
        "Pulp of 1 vanilla bean",
        "4 Granny Smith apples, peeled and cut into 20 thin slices",
        "3/4 cup chopped pecans",
        "1 cup red wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Thanksgiving",
        "Date",
        "Apple",
        "Pecan",
        "Vanilla",
        "Red Wine",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Apple Tart with Date Ice Cream and Red Wine-Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/warm-apple-tart-with-date-ice-cream-and-red-wine-caramel-sauce-104121"
}
