{
    "directions": [
        "Trim fennel stalks flush with bulb, discarding stalks, and cut enough of bulb into 1/4-inch dice to measure 1/3 cup. Peel and seed tomato. Separately cut enough tomato and zucchini into 1/4-inch dice to measure 1/2 cup each. In a small saucepan of boiling water blanch zucchini 1 minute and drain in a sieve. Rinse zucchini under cold water to stop cooking and drain well.",
        "In a bowl combine zucchini, fennel, tomato, shallot, and cayenne and season with sea salt and white pepper. Halve garlic and pit and chop olives. Add garlic and olives to vegetable mixture with parsley, basil, capers, and oils, stirring to combine well. Chill salad, covered, at least 2 hours and up to 6.",
        "Scrub mussels and pull off beards. Heat a large heavy skillet over moderately high heat until hot and add water and half of mussels. Steam mussels, covered, 3 to 8 minutes, checking occasionally after 3 minutes and transferring them as they open to a bowl. Discard any unopened mussels. Repeat procedure with liquid remaining in skillet and remaining mussels.",
        "Remove mussels from shells and divide among 4 shallow bowls. With a slotted spoon mound salad over mussels, tossing if desired. Drizzle each salad with 1 tablespoon dressing remaining in bowl."
    ],
    "ingredients": [
        "1/2 fennel bulb (sometimes called anise)",
        "1 small vine-ripened tomato",
        "1 medium zucchini",
        "1 teaspoon chopped shallot",
        "a pinch cayenne",
        "fine sea salt",
        "freshly ground white pepper",
        "1/2 medium garlic clove",
        "4 imported black olives",
        "1 teaspoon chopped fresh flat-leafed parsley leaves",
        "2 tablespoons chopped fresh basil leaves",
        "1 teaspoon drained capers",
        "1/4 cup olive oil",
        "1/4 cup extra-virgin olive oil",
        "3 pounds mussels (preferably cultivated)",
        "1/3 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Tomato",
        "Vegetable",
        "Steam",
        "Low/No Sugar",
        "Mussel",
        "Fennel",
        "Zucchini",
        "Summer",
        "Gourmet"
    ],
    "title": "Warm Mussel and Marinated Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/warm-mussel-and-marinated-vegetable-salad-15208"
}
