{
    "directions": [
        "Peel and seed tomato and cut into 1/4-inch dice. In a dry small heavy skillet toast sesame seeds over moderate heat, stirring occasionally, until golden, about 3 minutes. Shell and devein shrimp.",
        "Trim top 1 1/4 inches from each endive and separate leaves, discarding small inner core. With a sharp knife cut away soft yellow edges of each leaf (save trimmings for another use), leaving only firm white centers, and cut centers lengthwise into 1/4-inch-wide strips.",
        "In a small bowl whisk together vinaigrette and mustards. In a bowl combine endives, tomato, sesame seeds, soy sauce, lemon juice, and 3 tablespoons mustard vinaigrette, tossing to coat, and season with sea salt and white pepper.",
        "Season shrimp with sea salt and white pepper. In a large heavy nonstick skillet heat oil over moderately high heat until just smoking. Add shrimp in one layer and sauté until undersides are golden brown, about 1 minute. Turn shrimp over and sauté until just cooked through, about 30 seconds.",
        "Divide shrimp among 4 plates, mounding them. Add 5 teaspoons sliced cilantro to endive mixture, tossing to mix, and mound mixture over shrimp. Garnish salads with remaining teaspoon cilantro."
    ],
    "ingredients": [
        "1 medium vine-ripened tomato",
        "2 teaspoons sesame seeds",
        "3/4 pound large shrimp (about 16)",
        "4 medium Belgian endives",
        "1/2 cup house vinaigrette",
        "2 teaspoons Dijon mustard",
        "2 teaspoons coarse-grained mustard",
        "2 teaspoons soy sauce",
        "1 teaspoon fresh lemon juice",
        "fine sea salt",
        "freshly ground white pepper",
        "1 tablespoon corn oil",
        "2 tablespoons thinly sliced fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Mustard",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Picnic",
        "Low Cal",
        "Seafood",
        "Shrimp",
        "Summer",
        "Endive",
        "Gourmet"
    ],
    "title": "Warm Shrimp and Endive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/warm-shrimp-and-endive-salad-15211"
}
