{
    "directions": [
        "Whisk flour, sugar, and salt in large bowl. Make well in center of flour mixture. Whisk milk and next 5 ingredients in medium bowl to blend. Add to flour mixture; whisk to blend. Cover; let stand at room temperature 2 hours.",
        "Heat nonstick skillet with 7-inch-diameter bottom over medium-high heat. Brush bottom with melted butter. Pour generous 2 tablespoons batter into skillet; swirl to coat bottom. Cook until edges are light brown, about 30 seconds. Loosen edges gently with spatula and turn crepe over. Cook until bottom begins to brown in spots, about 30 seconds. Transfer to plate. Cover with paper towel. Repeat to make 12 crepes total, brushing skillet with melted butter as needed and stacking crepes between paper towels. (Can be made 1 day ahead. Cover and chill.)",
        "Using on/off turns, finely chop nuts with sugar in processor. Add remaining ingredients; process until blended.",
        "Butter rimmed baking sheet. Place 1 crepe on work surface. Place 1 tablespoon hazelnut cream in lower right quarter of crepe. Fold crepe in half over cream, then into quarters, folding to show layers. Transfer to prepared baking sheet. Place 1 teaspoon hazelnut cream atop crepe. Repeat with remaining 11 crepes and hazelnut cream. (Can be prepared 3 hours ahead. Cover with plastic wrap and chill.)",
        "Preheat oven to 400°F. Bake until crepes are hot and crisp around edges, about 6 minutes.",
        "Stir Frangelico and sugar in small bowl until sugar dissolves. Melt butter in heavy large skillet over medium-high heat; cook until butter browns, stirring occasionally, about 5 minutes. Remove from heat. Mix in Frangelico mixture, nuts, and salt.",
        "Divide crepes among 6 plates. Spoon sauce over and around crepes."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1 1/2 cups whole milk",
        "1/2 cup whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "2 large eggs",
        "2 tablespoons Frangelico (hazelnut liqueur)",
        "1 teaspoon grated lemon peel",
        "Additional melted butter",
        "1 cup hazelnuts, toasted, husked",
        "1/2 cup powdered sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "2 tablespoons plus 1 teaspoon all purpose flour",
        "1 large egg",
        "1 large egg yolk",
        "1 tablespoon Frangelico",
        "2 tablespoons Frangelico",
        "1 1/2 teaspoons sugar",
        "1/2 cup (1 stick) unsalted butter",
        "1/3 cup hazelnuts, toasted, chopped",
        "1/4 teaspoon coarse kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Nut",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Sauté",
        "Valentine's Day",
        "Quick & Easy",
        "Back to School",
        "Frangelico",
        "Fall",
        "Winter",
        "Pan-Fry",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Crepes with Hazelnut Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/warm-crepes-with-hazelnut-brown-butter-109180"
}
