{
    "directions": [
        "Cook shallots in 1 tablespoon butter in a heavy medium saucepan over medium heat, stirring, until golden, about 3 minutes. Add tomato paste and cook, stirring, 1 minute. Add wine, garlic, thyme, parsley, bay leaf, 1/2 teaspoon salt, and 1/4 teaspoon pepper and boil until reduced to about 1 cup, 25 to 40 minutes.",
        "Preheat oven to 350°F with racks in upper and lower thirds.",
        "Meanwhile, cook lardons in a small heavy skillet over medium heat, stirring occasionally, until browned but not crisp. Drain on paper towels.",
        "Strain wine mixture through a fine-mesh sieve into a bowl, pressing on and then discarding solids. Return to saucepan, then stir in veal demi-glace and bring to a simmer.",
        "Stir together flour and remaining 1/2 tablespoon butter to make a beurre manié, then whisk into sauce and simmer, whisking occasionally, 3 minutes. Add half of lardons to sauce and keep warm off heat, covered. Wrap remaining lardons in foil and keep warm on rack in lower third of oven.",
        "Brush baguette slices with oil and season lightly with salt and pepper. Toast in upper third of oven until pale golden and crisp, about 10 minutes. Rub garlic on toasts.",
        "Meanwhile, fill a deep large skillet with 1 1/4 inches water, then add vinegar and bring to a simmer. Break 1 egg into a cup and slide egg into water. Repeat with remaining eggs, spacing them apart, and poach at a bare simmer until whites are firm but yolks are still runny, 2 to 3 minutes.",
        "Toss frisée with vinegar and 1/4 teaspoon salt, then with oil, and divide among 4 plates.",
        "Lift each egg out of poaching liquid with a slotted spatula and gently pat dry (still on spatula), then transfer to a toast. Season eggs lightly with salt and pepper and divide among salads. Pour sauce over eggs and sprinkle salads with remaining lardons."
    ],
    "ingredients": [
        "1/2 cup chopped shallots",
        "1 1/2 tablespoons unsalted butter, divided",
        "1 teaspoon tomato paste",
        "1 (750-ml) bottle dry red wine",
        "2 garlic cloves, chopped",
        "4 thyme sprigs",
        "1 large parsley sprig",
        "1 Turkish or 1/2 California bay leaf",
        "1 (1/4-pound) piece slab bacon, cut crosswise into 1/4-inch sticks (lardons)",
        "2/3 cup veal demi-glace or 2 tablespoons demi-glace concentrate plus 1/2 cup water",
        "1/2 tablespoon all-purpose flour",
        "8 (1/2-inch-thick) baguette slices",
        "1 tablespoon olive oil",
        "1 garlic clove, halved",
        "1 teaspoon distilled white vinegar",
        "8 large eggs",
        "1/2 pound frisée, trimmed and torn into pieces (4 cups)",
        "1 teaspoon distilled white vinegar",
        "2 teaspoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Brunch",
        "Mother's Day",
        "Dinner",
        "Lunch",
        "Fall",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Warm Frisée-Lardon Salade with Poached Eggs in Red-Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/warm-frisee-lardon-salade-with-poached-eggs-in-red-wine-sauce-241765"
}
