{
    "directions": [
        "Preheat oven to 325°F. Whisk egg white in a medium bowl until frothy. Whisk in sugar. Add pecans; toss until coated. Spread out on a parchment-lined rimmed baking sheet and bake, tossing every 10 minutes, until browned and dry, 25–30 minutes. Let cool.",
        "Bring cream, milk, butter, and vanilla to a simmer in a medium saucepan over medium heat. Meanwhile, whisk eggs, sugar, cornstarch, cocoa powder, and salt in a medium heatproof bowl to combine.",
        "As soon as cream mixture reaches a simmer, remove from heat and, whisking constantly, very gradually add one-third of cream mixture to egg mixture. Whisk tempered egg mixture into cream mixture in saucepan. Cook over medium heat, whisking constantly, until mixture thickens and is bubbling, about 2 minutes. Remove from heat and add chopped chocolate; whisk until chocolate is melted and pudding is smooth. Serve topped with candied pecans.",
        "Pecans can be candied 1 week ahead. Store airtight at room temperature.\nPudding can be made 2 days ahead. Press plastic wrap directly onto surface and chill. Reheat gently in a heatproof bowl set over a pan of simmering water before serving."
    ],
    "ingredients": [
        "1 large egg white",
        "2 tablespoons sugar",
        "1 cup pecans",
        "1 1/2 cups heavy cream",
        "1 1/2 cups whole milk",
        "4 tablespoons unsalted butter",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "1/2 cup sugar",
        "2 tablespoons plus 1 teaspoon cornstarch",
        "2 tablespoons unsweetened cocoa powder",
        "1 1/2 teaspoons kosher salt",
        "4 ounces chopped chocolate (at least 70% cacao)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Milk/Cream",
        "Chocolate",
        "Pecan",
        "Winter",
        "Fall",
        "Wheat/Gluten-Free"
    ],
    "title": "Warm Cocoa Pudding With Candied Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/warm-cocoa-pudding-with-candied-pecans"
}
