{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Butter the bottom of a 10 inch springform pan, and line with parchment paper.",
        "Melt the butter in a large saucepan over low heat. Stir in chocolate, and continue to stir until almost melted. Remove from heat, and stir until melted and smooth.  In a large bowl, stir together 1 1/4 cups sugar and the cocoa powder. Whisk in the eggs until well blended, then whisk in the chocolate and butter. Pour the batter into the prepared pan.",
        "Bake for about 45 minutes in the preheated oven. The cake is ready when the edges have nicely puffed  and the surface is firm except for a small spot in the center that will jiggle when the pan is gently shaken. Cool cake in the pan over a wire rack. Run a knife around the sides of the pan to loosen the cake, then remove the sides of the pan, and invert onto a serving plate. Remove the parchment paper.",
        "In a heavy saucepan, stir together 1 1/2 cups of sugar, water, and lemon juice. Bring to a boil over medium heat, and cook without stirring until the syrup is a deep amber color. For an accurate color check, dip a metal spoon into the syrup and lift it out of the pan to check the color. Once the syrup is amber, remove from the heat. Gradually stir in the cream. The mixture will bubble vigorously.  If lumps form, stir gently over low heat to dissolve them. Stir in 2 tablespoons of butter.",
        "Cut the cake into wedges while warm, and serve with caramel sauce spooned over it. You can also chill the cake and sauce, then warm again before serving."
    ],
    "ingredients": [
        "1 cup butter, cubed",
        "8 ounces semisweet chocolate, chopped",
        "1 1/4 cups white sugar",
        "1 cup unsweetened cocoa powder",
        "6 eggs",
        "1 1/2 cups white sugar",
        "1/4 cup water",
        "1 1/2 teaspoons fresh lemon juice",
        "1 cup heavy cream",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Warm Flourless Chocolate Cake with Caramel Sauce",
    "url": "http://allrecipes.com/recipe/77782/warm-flourless-chocolate-cake-with-ca/"
}
