{
    "directions": [
        "Bring cornmeal, water, and 2 1/4 teaspoons salt to a boil in a 4-quart heavy saucepan, stirring constantly. Reduce heat and simmer, stirring frequently, until polenta is creamy and tender, about 50 minutes. Remove from heat, then stir in 11/2 tablespoons butter and cool slightly.",
        "Spoon polenta onto center of a lightly buttered large baking sheet, then spread evenly into a 10- by 7-inch rectangle (about 1/2 inch thick). Cover with plastic wrap, then poke several holes in wrap with a small sharp knife and chill 2 hours.",
        "Melt remaining tablespoon butter in a heavy saucepan over moderate heat. Stir in sugar, cumin, cinnamon, paprika, cayenne, and 1/4 teaspoon salt, then cook, without stirring, until caramelized. Add pumpkin seeds and cook, stirring occasionally, until seeds are puffed and golden. Transfer to a plate to cool. When seeds have hardened, break up any clumps with your fingers.",
        "Whisk together pomegranate juice, vinegar, and shallot and let stand 5 minutes. Whisk in 3 tablespoons oil, remaining 1/4 teaspoon salt, and pepper to taste.",
        "Preheat oven to 450°F.",
        "Cut pumpkin quarters crosswise into 1/2-inch-thick slices. Toss with 1 tablespoon oil and salt and pepper to taste in a shallow baking pan and arrange slices in 1 layer. Roast in middle of oven until just tender, about 20 minutes. Remove from oven, then cover with foil to keep warm.",
        "Trim polenta into a 9- by 6-inch rectangle. Cut polenta into 6 (3-inch) squares, then halve each square diagonally. Heat 1 tablespoon oil in a large nonstick skillet until hot but not smoking, then cook polenta in 2 batches, turning once, until golden brown, about 8 minutes (if necessary, use remaining tablespoon oil for second batch). Transfer as cooked to a plate and keep warm, covered.",
        "Shave 12 strips from cheese with a vegetable peeler.",
        "Whisk vinaigrette, then toss arugula in a large bowl with enough vinaigrette to lightly coat. Place several pieces of pumpkin and 1 piece of polenta on each of 6 plates. Top with arugula, more pumpkin, and remaining polenta. Sprinkle with candied pumpkin seeds and top with parmesan shavings, then drizzle with remaining vinaigrette."
    ],
    "ingredients": [
        "1 1/2 cups yellow cornmeal (not coarse)",
        "7 1/2 cups water",
        "2 3/4 teaspoons salt",
        "2 1/2 tablespoons unsalted butter",
        "1 tablespoon sugar",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon cinnamon",
        "1/4 teaspoon paprika",
        "1/4 teaspoon cayenne",
        "1/2 cup raw green (hulled) pumpkin seeds (pepitas)",
        "1 tablespoon fresh pomegranate juice (see cooks' note, below) or cranberry juice cocktail",
        "2 teaspoons Sherry vinegar",
        "1 tablespoon minced shallot",
        "6 tablespoons extra-virgin olive oil",
        "1 small cheese pumpkin or butternut squash (2 lb), peeled, quartered lengthwise, and seeded",
        "1 (6-oz) piece Parmigiano-Reggiano",
        "8 oz arugula, trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Fry",
        "Roast",
        "Vegetarian",
        "Halloween",
        "Parmesan",
        "Cornmeal",
        "Arugula",
        "Pumpkin",
        "Fall",
        "Seed",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Pumpkin Salad with Polenta and Candied Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/warm-pumpkin-salad-with-polenta-and-candied-pumpkin-seeds-105581"
}
