{
    "directions": [
        "In 3-quart pot over moderate heat, bring milk and cream to boil. In medium bowl, whisk together egg yolks, cornstarch, and 1 tablespoon sugar. Gradually whisk hot milk and cream mixture into egg-yolk mixture, then return mixture to pot. Reduce heat to low and cook, whisking constantly, until mixture becomes thick and smooth, about 2 minutes. Strain custard, pressing on solids, through fine-mesh strainer into large bowl.",
        "Place lemon juice in small bowl. Sprinkle gelatin over juice and let stand 1 minute to soften, then stir until dissolved, about 1 minute. Stir lemon juice mixture and lemon zest into custard, press plastic wrap onto surface of custard, and let cool at room temperature.",
        "In small saucepan, stir together 3/4 cup water and remaining 11 tablespoons sugar. Clamp on candy thermometer and set over moderate heat. Simmer, uncovered and undisturbed, until thermometer registers 235°F, 10 to 12 minutes. While syrup is simmering, in large bowl using electric mixer, beat egg whites and salt just until soft peaks begin to form, about 3 to 4 minutes. With mixer running, slowly and carefully pour hot syrup into egg whites, then continue to whip until meringue thickens, becomes glossy, and holds soft peaks, about 6 to 8 minutes.",
        "When custard has cooled, gently fold in meringue. Divide Chiboust evenly among 12 silicone muffin cups and freeze until firm, at least 4 hours and up to 24 hours.",
        "In large bowl, whisk together flour, sugar, and salt. Using pastry blender or fingertips, blend in butter until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. In small bowl, whisk together yolks and 1 tablespoon ice water, then drizzle over flour mixture and stir with fork until just combined. With floured hands, gently knead mixture until dough forms. Turn dough out onto lightly floured surface and gently knead until smooth, 4 to 5 times. Form dough into ball, then flatten into 5-inch disk. Wrap tightly in plastic and chill until firm, 30 minutes to 1 hour.",
        "On 13- by 18-inch piece of parchment, lightly dusted with flour, roll out dough to 1/4-inch-thick-round (about 12 to 13 inches in diameter). Transfer parchment and dough to sheet pan, then cover with plastic and chill in refrigerator 30 minutes.",
        "Preheat oven to 350°F.",
        "Remove dough from refrigerator. Using 3-inch round cookie cutter, cut out 12 rounds and place on large baking sheet. Remove Chibousts from freezer, unmold, and place one on each dough round. Sift confectioners' sugar over and bake until Chibousts are puffy and thin crust has formed on top, about 20 minutes.",
        "In large saucepan over moderate heat, bring cream to boil. Remove pan from heat and add chocolate, whisking until chocolate is melted and mixture is smooth.",
        "In one-quart pot over moderate heat, heat sugar and 1 1/2 tablespoons water, whisking constantly, until sugar dissolves, about 2 to 3 minutes. Pour syrup over chocolate and whisk until smooth, about 2 to 3 minutes. Whisk in lemon juice and thyme. Keep warm.",
        "Remove Chibousts from oven. Using blowtorch, brown top of each by moving flame evenly back and forth over top until golden brown, about 1 to 2 minutes. Drizzle each Chiboust with 2 tablespoons chocolate velouté and serve warm."
    ],
    "ingredients": [
        "3/4 cup milk",
        "3/4 cup heavy cream",
        "4 large eggs, separated",
        "3 tablespoons cornstarch",
        "3/4 cup (12 tablespoons) sugar",
        "1/4 cup fresh Meyer lemon juice* (from 1 medium lemon)",
        "2 teaspoons powdered gelatin (from 1 -1/4-ounce envelope)",
        "1 tablespoon finely grated Meyer lemon zest* (from 2 medium lemons)",
        "1/8 teaspoon salt",
        "1 1/2 cups all-purpose flour",
        "1/2 cup sugar",
        "1/2 teaspoon salt",
        "7 tablespoons cold, unsalted butter, cut into 1/2-inch cubes",
        "4 large egg yolks",
        "1/2 teaspoon pure vanilla extract",
        "1/2 cup confectioners' sugar",
        "1 cup heavy cream",
        "1 1/2 cups (9 ounces) high-quality milk chocolate such as Valrhona, coarsely chopped",
        "4 1/2 teaspoons sugar",
        "2 teaspoons fresh Meyer lemon juice* (from 1/2 lemon)",
        "1/2 teaspoon fresh lemon thyme** leaves, minced",
        "Special equipment: 12-cup silicone muffin pan; small blowtorch",
        "*If Meyer lemons are unavailable, regular lemons can be substituted. **If lemon thyme is unavailable, regular thyme can be substituted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Lemon",
        "Chill",
        "Thyme",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Warm Lemon Chiboust with Lemon Thyme Infused Milk Chocolate Velouté",
    "url": "http://www.epicurious.com/recipes/food/views/warm-lemon-chiboust-with-lemon-thyme-infused-milk-chocolate-veloute-236370"
}
