{
    "directions": [
        "Preheat oven to 350°F. Place garlic in small baking dish. Drizzle with 2 tablespoons oil. Cover dish tightly with foil; bake until garlic is tender, about 50 minutes. Cool. Squeeze roasted garlic from skins into medium bowl. Mash with fork. Add 3/4 cup oil, shallots, 3 tablespoons vinegar, and thyme. Whisk to blend well. Season with salt and pepper.",
        "Increase oven temperature to 375°F. Oil large rimmed baking sheet. Arrange onion rings on sheet. Sprinkle with salt and pepper. Drizzle with remaining 2 tablespoons oil; toss to coat. Roast until tender and brown, stirring occasionally, about 30 minutes. Drizzle with remaining 1 tablespoon vinegar; toss to coat. Add onions to vinaigrette in bowl. Maintain oven temperature.",
        "Melt butter in heavy medium ovenproof skillet over medium heat. Add chopped garlic and sauté 30 seconds. Add bread cubes and rosemary and toss to combine. Transfer to oven and bake until croutons are golden and crisp, about 10 minutes. Place arugula in large bowl. Add cheese and toss to combine. Transfer vinaigrette to medium saucepan. Stir over medium-low heat until hot. Pour hot dressing over arugula salad and toss to combine. Season to taste with salt and pepper. Top with croutons and serve."
    ],
    "ingredients": [
        "1 head of garlic",
        "4 tablespoons plus 3/4 cup olive oil",
        "1/4 cup finely chopped shallots",
        "4 tablespoons balsamic vinegar",
        "2 tablespoons chopped fresh thyme",
        "2 large red onions, sliced into 1/4-inch-thick rings, separated",
        "2 tablespoons (1/4 stick) butter",
        "6 garlic cloves, chopped",
        "2 cups 1/2-inch cubes day-old sourdough bread",
        "1 teaspoon chopped fresh rosemary",
        "8 cups (packed) arugula leaves (about 10 ounces)",
        "1 cup (packed) grated smoked mozzarella cheese (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Leafy Green",
        "Bake",
        "Sauté",
        "Arugula",
        "Winter"
    ],
    "title": "Warm Arugula Salad with Garlic Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/warm-arugula-salad-with-garlic-croutons-104701"
}
