{
    "directions": [
        "Bring a pot of water to a boil. Add large tomatoes to boiling water for 1 to 2 minutes; transfer to a bowl of ice water. Peel large tomatoes, squeeze out excess juice and seeds, and dice.",
        "Combine large tomatoes, cherry tomatoes, green bell pepper, red onion, and ginger in a large cast iron pot. Stir dried cranberries, vinegar, brown sugar, pickling spice, chili powder, and salt into tomato mixture; bring to a boil. Reduce heat to medium and cook until chutney is thickened, at least 1 hour.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack chutney into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "1 1/2 pounds large tomatoes",
        "1 1/2 pounds cherry tomatoes, nicked and squeezed",
        "1 large green bell pepper, diced",
        "1 red onion, diced",
        "1 tablespoon diced candied ginger",
        "1 (5 ounce) package sweetened dried cranberries",
        "1 1/2 cups cider vinegar",
        "1 1/2 cups packed brown sugar",
        "1 tablespoon pickling spice",
        "1 teaspoon chili powder",
        "1 teaspoon salt",
        "4 (1 pint) canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Warm Tomato Chutney",
    "url": "http://allrecipes.com/recipe/235459/warm-tomato-chutney/"
}
