{
    "directions": [
        "Place garlic and oil in small glass measuring cup or ramekin. Cover tightly with plastic wrap and microwave 30 seconds. Transfer garlic to small bowl. Reserve oil. Using fork, coarsely mash garlic. Add basil, vinegar, and mustard to mashed garlic. Whisk until smooth. Gradually whisk in reserved garlic oil. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate. Let stand 1 hour at room temperature and rewhisk before using.)",
        "Mix first 6 ingredients in medium bowl to blend. Dip each cheese round into egg whites, turning to coat. Coat each with breadcrumb mixture. Transfer coated cheese rounds to plate. Cover with plastic wrap and refrigerate at least 1 hour and up to 8 hours.",
        "Prepare barbecue (medium-high heat). Heat 1 tablespoon olive oil in heavy large nonstick skillet over medium-high heat. Add cheese rounds and cook until golden and crisp, about 3 minutes per side. Transfer to plate.",
        "Brush bread slices on both sides with olive oil. Grill until beginning to toast, about 3 minutes per side. Transfer to plate.",
        "Place greens in large bowl and toss with all but 2 tablespoons vinaigrette; season to taste with salt and pepper. Divide salad among 6 plates. Top each with 1 cheese round and 1 slice grilled bread. Drizzle cheese rounds with remaining 2 tablespoons vinaigrette and serve.",
        "Available at Asian markets and in the Asian foods section of some supermarkets."
    ],
    "ingredients": [
        "2 garlic cloves, peeled, halved",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon chopped fresh basil",
        "2 tablespoons red wine vinegar",
        "2 tablespoons Dijon mustard",
        "1 cup panko (Japanese breadcrumbs)*",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh basil",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon salt",
        "3 4-ounce logs soft fresh goat cheese, each halved crosswise, halves pressed to 1/2-inch thickness",
        "2 large egg whites, lightly beaten until foamy",
        "1 tablespoon olive oil",
        "6 3/4-inch-thick slices olive bread",
        "Additional olive oil",
        "2 5-ounce packages mixed baby greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Leafy Green",
        "Lunch",
        "Goat Cheese",
        "Basil",
        "Summer",
        "Shower",
        "Chill",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Goat Cheese Salad with Grilled Olive Bread",
    "url": "http://www.epicurious.com/recipes/food/views/warm-goat-cheese-salad-with-grilled-olive-bread-106622"
}
