{
    "directions": [
        "Mix breadcrumbs and thyme in glass pie dish. Season goat cheese with salt and pepper. Dip cheese into beaten egg, then into breadcrumbs, coating completely. cover and refrigerate until ready to use. (Can be prepared 4 hours ahead.)",
        "Whisk vinegar and mustard in small bowl to blend. Gradually whisk in 1/2 cup oil. Season to taste with salt and pepper. Combine mixed greens, Belgian endive and pears in large bowl.",
        "Heat remaining 3 tablespoons oil in heavy large skillet over medium-high heat. Add walnuts and sauté until lightly toasted, about 2 minutes. Transfer to plate using slotted spoon. Reduce heat to medium. Working in batches, add cheese rounds to skillet and cook until crisp and brown on outside and soft on inside, about 2 minutes per side.",
        "Toss salad with enough dressing to coat. Divide among 4 plates. Using metal spatula, place 2 cheese rounds in center of each salad. Sprinkle with walnuts."
    ],
    "ingredients": [
        "1 1/4 cup fresh white breadcrumbs",
        "2 tablespoons minced fresh thyme or 2 teaspoons dried",
        "11 ounces soft fresh goat cheese(such as Montrachet), cut into 8 rounds",
        "1 egg, beaten to blend",
        "2 tablespoons plus 3/4 teaspoon white wine vinegar",
        "1 tablespoon Dijon mustard",
        "1/2 cup plus 3 tablespoons walnut oil",
        "8 cups mixed baby greens",
        "2 heads Belgian endive, cut crosswise into 1/2-inch pieces",
        "2 large ripe pears, peeled, cored, cut into 1/4-inch-thick slices",
        "1/3 cup chopped walnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Sauté",
        "Vegetarian",
        "Goat Cheese",
        "Pear",
        "Walnut",
        "Chill",
        "Endive",
        "Lettuce"
    ],
    "title": "Warm Goat Cheese Salad with Pears and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/warm-goat-cheese-salad-with-pears-and-walnuts-4293"
}
