{
    "directions": [
        "Line 13 x 9 x 2-inch baking pan with foil. Melt chocolate in top of double boiler over simmering water, stirring until smooth. Pour chocolate into prepared pan; spread evenly. Sprinkle almonds over chocolate. Refrigerate until chocolate sets, about 30 minutes. Break brittle into irregular shapes. (Brittle can be prepared 1 day ahead. Cover tightly and refrigerate.)",
        "Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Line bottom with parchment. Wrap outside of pan with foil. Melt chocolate in top of double boiler over simmering water, stirring until smooth. Set aside to cool.",
        "Using electric mixer, beat butter and 1/3 cup sugar in large bowl to blend. Mix in cornstarch, espresso powder and salt. Beat in egg yolks, 1 at a time. Mix in melted chocolate. Using clean dry beaters, beat egg whites in another large bowl with 1/3 cup sugar until stiff but not dry. Fold whites into chocolate mixture in 2 additions. Transfer to prepared pan.",
        "Bake cake until set and tester inserted into center comes out with moist crumbs attached, about 50 minutes. Cool cake completely on rack (cake may fall and appear cracked). Refrigerate until well chilled, about 4 hours. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Preheat oven to 300°F. Bake cake uncovered just until warm, about 20 minutes. Cut around cake to loosen. Release pan sides. Cut warm cake into wedges. Garnish cake with pieces of brittle and serve."
    ],
    "ingredients": [
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup sliced almonds, toasted",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2/3 cup sugar",
        "1 tablespoon cornstarch",
        "2 teaspoons instant espresso powder",
        "1/8 teaspoon salt",
        "6 large eggs, separated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Almond",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Chocolate Cake with Chocolate Almond Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/warm-chocolate-cake-with-chocolate-almond-brittle-756"
}
