{
    "directions": [
        "In a measuring cup stir together soy sauce, vinegar, and Sherry. In a bowl toss steak with garlic, gingerroot, and 2 tablespoons soy sauce mixture and marinate while preparing vegetables.",
        "Discard stems from mushrooms and cut mushrooms and scallions into thin strips, keeping them separate. Peel cucumber and cut in half lengthwise. With a spoon scrape seeds from cucumber halves, discarding seeds, and cut each half crosswise into 1/4-inch-thick slices.",
        "In a large non-stick skillet heat 1 tablespoon oil over high heat until very hot but not smoking and brown steak, stirring frequently, until any liquid evaporates, about 3 minutes. Transfer steak to a clean bowl.",
        "In a skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté mushrooms, stirring occasionally, until liquid they give off is evaporated. Add scallions and bean sprouts and cook 1 minute. Remove skillet from heat and add steak, remaining soy sauce mixture, and water.",
        "In a large bowl toss together spinach, cucumber, and warm steak mixture. Divide salad among 2 plates."
    ],
    "ingredients": [
        "3 tablespoons soy sauce",
        "2 tablespoons seasoned rice vinegar",
        "1 1/2 tablespoons medium-dry Sherry",
        "3/4 pound flank steak",
        "1 large garlic clove, minced",
        "2 teaspoons grated peeled fresh gingerroot",
        "1/2 pound mushrooms",
        "3 scallions",
        "1 small cucumber",
        "2 tablespoons vegetable oil",
        "1 cup fresh bean sprouts",
        "2 tablespoons water",
        "2 cups packed spinach leaves, washed well and spun dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Beef",
        "Ginger",
        "Leafy Green",
        "Mushroom",
        "Sauté",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Warm Teriyaki Beef Salad",
    "url": "http://www.epicurious.com/recipes/food/views/warm-teriyaki-beef-salad-13113"
}
