{
    "directions": [
        "Combine raisins and rum in small bowl.Let stand at room temperature while preparing pudding.",
        "Combine nonfat milk and next 4 ingredients in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer; remove from heat. Allow to steep uncovered 1 hour. Strain coconut broth.",
        "Rinse rice in medium bowl of cold water. Drain. Repeat 2 more times. Cook 1 cup coconut broth and rice in heavy medium saucepan over medium-high heat until almost all liquid is absorbed, stirring constantly, about 3 minutes. Add remaining coconut broth; cook over low heat until rice is tender, stirring frequently, about 13 minutes. Remove from heat. Stir in 6 tablespoons sugar (mixture will be thick). Transfer to large bowl; cool.",
        "Whip cream in medium bowl until cream holds peaks. Fold half of whipped cream into cooled rice. Drain raisins. Stir raisins and lime peel into rice. Fold in remaining whipped cream. Divide mixture among eight 3/4-cup ramekins or custard cups.",
        "Preheat broiler. Sprinkle 1/2 tablespoon sugar over each pudding. Place puddings on rimmed baking sheet. Broil until sugar caramelizes, watching closely to prevent burning, about 3 minutes. Spoon passion fruit over puddings."
    ],
    "ingredients": [
        "1/2 cup raisins",
        "3 tablespoons Malibu rum or other coconut-flavored rum",
        "1 1/2 cups nonfat milk",
        "1 1/4 cups canned unsweetened coconut milk",
        "3/4 cup whole milk",
        "1 cinnamon stick",
        "1/2 teaspoon salt",
        "1/2 vanilla bean, halved lengthwise",
        "1 1/4 cups jasmine rice",
        "6 tablespoons plus 1/4 cup sugar",
        "1 cup chilled whipping cream",
        "2 1/2 teaspoons grated lime peel",
        "6 passion fruits, halved, juice and seeds scooped into bowl"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Rice",
        "Dessert",
        "Broil",
        "Lime",
        "Raisin",
        "Coconut",
        "Vanilla",
        "Passion Fruit",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Warm Jasmine Rice Puddings with Passion Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/warm-jasmine-rice-puddings-with-passion-fruit-230663"
}
