{
    "directions": [
        "Bring lentils, water, and bay leaf to a boil in a 2- to 3-quart heavy saucepan, then reduce heat and simmer, covered, until almost tender, about 15 minutes. Stir in 1/2 teaspoon salt, then simmer lentils, covered, until tender but not falling apart, 3 to 5 minutes.",
        "While lentils simmer, cook onion, carrots, celery, garlic, thyme, 1/4 teaspoon salt, and 1/8 teaspoon pepper in 2 tablespoons oil in a 12-inch heavy skillet over moderately low heat, stirring occasionally, until vegetables are just softened, 7 to 9 minutes.",
        "Make vinaigrette by whisking together vinegar, mustard, and remaining 1/4 teaspoon salt and 1/8 teaspoon pepper in a bowl. Add remaining 1/2 cup oil in a slow stream, whisking until blended well.",
        "Drain lentils in a colander, discarding bay leaf, and return to saucepan along with vegetable mixture and vinaigrette. Cook over low heat, stirring, until heated through. Keep warm, covered.",
        "Brown kielbasa in cleaned and dried 12-inch heavy skillet (in 2 batches if necessary), turning over once, about 2 minutes per batch. Stir kielbasa and parsley into lentils."
    ],
    "ingredients": [
        "2 cups French green lentils (13 oz), picked over and rinsed",
        "6 cups water",
        "1 California bay leaf or 2 Turkish",
        "1 teaspoon salt",
        "1 medium onion, finely chopped (1 cup)",
        "2 carrots, cut into 1/4-inch dice (1 cup)",
        "2 celery ribs, cut into 1/4-inch dice (1 cup)",
        "1 tablespoon finely chopped garlic",
        "1/2 teaspoon dried thyme, crumbled",
        "1/4 teaspoon black pepper",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "1/4 cup red-wine vinegar",
        "1 tablespoon Dijon mustard",
        "3/4 lb smoked kielbasa or other smoked sausage (not low-fat), cut crosswise into 1/4-inch-thick slices",
        "1/4 cup finely chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Sauté",
        "Quick & Easy",
        "Sausage",
        "Celery",
        "Lentil",
        "Carrot",
        "Parsley",
        "Gourmet"
    ],
    "title": "Warm Lentil Salad with Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/warm-lentil-salad-with-sausage-233546"
}
