{
    "directions": [
        "Put the kettle on to boil. Then put the gelatin leaves into a small wide bowl, cover them with cold water and set aside to soften.",
        "Cut the limes in half lengthwise, rather than around their middles, and, using a spoon, scoop out the juicy flesh. It takes a bit of wiggling and getting squirted by the juice, but you will get there! The trick is not to break through the lime skin. (You don’t need the flesh for this recipe, but afterward I like to squeeze the juice out and freeze it in an ice-cube tray for handy lime juice needs at other times.)",
        "Set each half, cut side up, on a large tray, or put each one in the cup of a 12-cup muffin pan. They fit perfectly and don’t move around too much that way. You will need two or three 12-cup muffin pans, but if you don’t have enough, you can nestle the excess lime shells on top in between the others and they should sit still.",
        "Next, break up the strawberry gelatin a bit and put it into a heatproof measuring cup, then pour over enough hot water to reach 1 3/4 cups.",
        "Pick up the gelatin leaves—they will feel all soft. Gently squeeze out as much liquid as you can from them, discard the bowl of water and then put the soft gelatin leaves into the gelatin and hot water. Leave to stand for a few minutes until everything begins to melt, then stir a little until everything is completely dissolved. Next, stir in the sugar, if using, until dissolved also.",
        "Use the gelatin to fill each lime shell right up to the very top so it is almost overflowing. Let the shells cool down for about 5 minutes and then put them in the freezer for about 25 minutes to firm up (but not much longer or they will freeze!). They will set in the fridge also, but allow double the time.",
        "Meanwhile, prepare the passion fruit by cutting it (or them) in half and scooping out the seeds onto paper towels. Dab the seeds dry with the towels and set them aside.",
        "Halfway through the setting time (once the gelatins are just beginning to firm up), remove them and carefully arrange the passion fruit seeds on top. Arrange about six seeds on each one, keeping them away from the middle as you will be cutting them in half later, and lightly press each one down a little so it will set into the gelatin. Then return to the freezer until completely firm.",
        "Once they are firm, remove them from the freezer. Then, using a sharp, nonserrated knife, cut them in half, straight down (again, lengthwise), and there you have it!"
    ],
    "ingredients": [
        "7 (2 1/2x4 1/2-inch) or 8 (3x4-inch) leaves of gelatin",
        "16 small or 14 medium limes",
        "4-oz package of strawberry gelatin",
        "1 3/4 cups hot water",
        "1 tablespoon sugar (optional)",
        "1 large or 2 small passion fruit (optional)",
        "Kettle, small wide bowl, large tray or 2–3 (12-cup) muffin pans, heatproof measuring cup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dessert",
        "Strawberry",
        "Passion Fruit",
        "Lime",
        "Non-Alcoholic",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Watermelon Jell-O Shots",
    "url": "http://www.epicurious.com/recipes/food/views/watermelon-jell-o-shots"
}
