{
    "directions": [
        "Stir watermelon rind, onion, and salt together in a large bowl; refrigerate until liquid has been released from the rind, about 24 hours.",
        "Combine vinegar, sugar, ginger, garlic, cinnamon, mustard, turmeric, chipotle pepper, and cloves in a large saucepan; bring to a boil. Decrease heat to low and simmer until sugar is dissolved, about 10 minutes. Add watermelon rind mixture and simmer for 30 minutes more.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack piccalilli into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "4 cups 1/4-inch chunks watermelon rind",
        "1 cup 1/4-inch chunks onion",
        "1/4 cup salt",
        "2 cups apple cider vinegar",
        "1 cup white sugar",
        "1 tablespoon finely chopped fresh ginger",
        "1 clove garlic, finely chopped",
        "3/4 teaspoon ground cinnamon",
        "3/4 teaspoon dry mustard",
        "1/2 teaspoon ground turmeric",
        "1/4 teaspoon ground dried chipotle pepper",
        "1/4 teaspoon ground cloves",
        "canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Watermelon Piccalilli",
    "url": "http://allrecipes.com/recipe/238277/watermelon-piccalilli/"
}
