{
    "directions": [
        "Stir canning salt into 1 gallon water in a large container until dissolved; add watermelon rind. Cover the container with plastic wrap or a lid and let sit 12 hours. Drain and rinse completely.",
        "Combine drained watermelon rind and 1 gallon water in a stock pot. Bring the water to a boil, reduce heat to medium-low, and simmer until the rind is tender, 45 minutes to 1 hour; drain and set aside.",
        "Put cinnamon sticks, allspice, and cloves in cheesecloth or spice bag. Combine vinegar, sugar, spice bag, maraschino cherries, and lemon slices in the stock pot; stir until sugar is dissolved. Add watermelon rind to the pot; bring to a boil, reduce heat to medium-low, and simmer until the rind is transparent, about 5-10 minutes. Remove the spice bag and set aside.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Put one whole clove into each jar. Break cinnamon sticks into pieces and put 1 piece into each jar.",
        "Pack the watermelon rind with the vinegar mixture into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "1 cup canning salt",
        "1 gallon water",
        "16 cups (1-inch) cubes watermelon rind",
        "1 gallon water",
        "3 cinnamon sticks",
        "1 teaspoon whole allspice",
        "1 teaspoon whole cloves",
        "2 cups white vinegar (5% acidity)",
        "3 cups white sugar, or more to taste",
        "12 maraschino cherries, halved",
        "1 lemon, thinly sliced",
        "6 1-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Watermelon Pickles",
    "url": "http://allrecipes.com/recipe/228065/watermelon-pickles/"
}
