{
    "directions": [
        "Bring sugar, water, and zest to a boil in a 2-quart heavy saucepan, stirring until sugar is dissolved, then reduce heat and simmer, without stirring, washing down any sugar crystals on side of pan with a pastry brush dipped in cold water, 2 minutes.",
        "Put watermelon in a blender, then add syrup and lemon juice and blend until smooth. Pour through a fine-mesh sieve into a large bowl, pressing on pulp and discarding any remaining solids.",
        "Freeze in ice cream maker, then transfer to an airtight container and freeze until firm.",
        "Blanch basil in a 3-quart pot of boiling salted water 5 seconds, then drain and transfer to a bowl of ice and cold water to stop cooking. Drain basil and squeeze dry.",
        "Bring wine, sugar, zest, and 1/2 cup water to a boil in cleaned 2-quart heavy saucepan, stirring until sugar is dissolved, then simmer 2 minutes.",
        "While wine syrup simmers, sprinkle gelatin over remaining 2 tablespoons water in a large metal bowl and let soften 1 minute.",
        "Pour about 1/2 cup wine syrup through a medium-mesh sieve lined with a dampened paper towel into gelatin mixture (reserve lined sieve), then stir until gelatin is dissolved.",
        "Blend remaining syrup with basil and lemon juice in cleaned blender until smooth (use caution when blending hot liquids), then pour through lined sieve into gelatin mixture. Set bowl in a larger bowl of ice and cold water and let stand, stirring occasionally, until cold, about 15 minutes, then chill in refrigerator, uncovered, until set, at least 2 hours.",
        "Gently whisk gelée to break into small pieces and serve as a bed for scoops of sorbet."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "1/4 cup water",
        "1 teaspoon finely grated fresh lemon zest",
        "5 cups coarsely chopped seeded watermelon (from a 4-lb piece, rind discarded)",
        "2 tablespoons fresh lemon juice, or to taste",
        "1/4 cup packed fresh basil leaves",
        "1 1/2 cups dry white wine",
        "1/2 cup sugar",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 cup plus 2 tablespoons water",
        "2 teaspoons unflavored gelatin (from 1 envelope)",
        "2 tablespoons fresh lemon juice, or to taste",
        "Special equipment: an ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Frozen Dessert",
        "Lemon",
        "Watermelon",
        "Basil",
        "White Wine",
        "Summer",
        "Gourmet",
        "Fat Free",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Watermelon Sorbet with Wine Basil Gelée",
    "url": "http://www.epicurious.com/recipes/food/views/watermelon-sorbet-with-wine-basil-gelee-109666"
}
