{
    "directions": [
        "Heat oil in large nonstick skillet over medium heat. Add onion and stir 1 minute to coat with oil. Add vinegar and sugar and stir until onion begins to soften slightly, about 3 minutes. Transfer onion to baking sheet or platter; spread in single layer. Sprinkle with salt. Cover and chill at least 8 hours or overnight (onion will turn pink). DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Whisk red wine vinegar, 1/4 teaspoon salt, 1/8 teaspoon freshly ground black pepper, and sugar in small bowl. Gradually whisk in both oils. DO AHEAD: Vinaigrette can be made 1 day ahead. Cover and refrigerate. Bring to room temperature and rewhisk before using.",
        "Combine Port and figs in large saucepan. Bring to boil. Reduce heat to medium-low and simmer until figs are plump and tender, about 30 minutes. Using slotted spoon, transfer figs to small bowl. Increase heat to medium-high and boil Port syrup until thickened and reduced to 6 tablespoons, about 8 minutes. Transfer syrup to another small bowl. DO AHEAD: Can be made 2 days ahead. Cover figs and Port syrup separately and chill.",
        "Combine endive, and pickled onion Toss salad with vinaigrette Port syrup over each salad among plates. Sprinkle salads and serve."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 medium-size red onion, thinly sliced (about 2 cups)",
        "1 tablespoon Champagne vinegar or white wine vinegar",
        "1 teaspoon sugar",
        "2 tablespoons red wine vinegar",
        "1/4 teaspoon salt",
        "1/8 teaspoon freshly ground black pepper",
        "1/8 teaspoon sugar",
        "1/4 cup grapeseed oil or vegetable oil",
        "2 tablespoons extra-virgin olive oil",
        "1 750-ml bottle ruby Port",
        "1 pound dried black Mission figs, stems removed, figs halved",
        "3 bunches watercress, thick stems removed (about 8 cups)",
        "6 heads of Belgian endive, trimmed, cut crosswise into 1/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Dried Fruit",
        "Port",
        "Family Reunion",
        "Low Cholesterol",
        "Potluck",
        "Watercress",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Watercress Salad with Port-Braised Figs and Pickled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/watercress-salad-with-port-braised-figs-and-pickled-onions-351244"
}
