{
    "directions": [
        "Bring the water and salt to a boil in a large, enamel stockpot over high heat. Add the watermelon rinds, and return to a boil. Cook for 20 minutes, then drain the rinds in a colander. Bring the vinegar to a boil with 6 cups of sugar. Remove from the heat, stir in the watermelon rinds, cover, and let stand overnight.",
        "The following day, remove the rinds from the syrup using a slotted spoon, and place them into a clean bowl. Set the stockpot onto the stove over high heat, add 4 cups of sugar, and return the syrup to a boil. Once the sugar has dissolved, remove the stockpot from the heat, and stir in the watermelon rinds, cover, and let stand overnight.",
        "On day 3, repeat the process above, using only 2 cups of sugar: remove the rinds from the syrup using a slotted spoon, and place them into a clean bowl. Set the stockpot onto the stove over high heat, add 2 cups of sugar, and return the syrup to a boil. Once the sugar has dissolved, remove the stockpot from the heat, and stir in the watermelon rinds, cover, and let stand overnight. Repeat step 3 every day for 6 more days.",
        "On day 10, sterilize the canning jars, rings and lids in boiling water. Pack the watermelon rinds into sterilized jars, making sure there are no spaces or air pockets on the sides. Add two cloves and one cinnamon stick to each jar. Return the syrup to a boil, and fill the jars to within 1/4 inch of the top. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with boiling water. Carefully lower jars into pot using a holder. Leave a 2 inch space between jars. Pour in more boiling water if necessary, until tops of jars are covered by 2 inches of water. Bring water to a full boil, cover the pot, and process for 10 to 15 minutes. Remove the stockpot from the heat, and let the jars stand in the water for 2 hours off of the heat.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area for 2 weeks before opening."
    ],
    "ingredients": [
        "2 1/2 gallons water",
        "1 tablespoon salt",
        "2 gallons watermelon rind, white part only, cut into 1-inch cubes",
        "1 quart cider vinegar",
        "26 cups white sugar, divided",
        "28 whole cloves",
        "14 (3 inch) cinnamon stick"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Watermelon Rind Candy",
    "url": "http://allrecipes.com/recipe/168521/watermelon-rind-candy/"
}
