{
    "directions": [
        "Preheat broiler. Place garlic cloves on small baking sheet; broil until golden brown, about 2 1/2 minutes per side. Heat 1 teaspoon oil in heavy small skillet over medium heat. Add onion slices; cook until light brown and slightly softened, about 7 minutes per side. Finely chop garlic and onion. Whisk pomegranate juice and next 4 ingredients in small bowl. Whisk in 1/4 cup oil. Mix in onion and garlic. Season with salt and pepper. Whisk in cilantro.",
        "Cut off all peel and white pith from oranges. Cut between membranes to release segments.",
        "Combine cabbage, watercress, green onions, and orange segments in large bowl. Add dressing and avocado slices and toss gently to coat. Transfer salad to large platter and serve.",
        "*A thick pomegranate syrup; available at some supermarkets and Middle Eastern markets and by mail from Adriana's Caravan (adrianascaravan.com)."
    ],
    "ingredients": [
        "4 large garlic cloves, peeled",
        "1 teaspoon plus 1/4 cup olive oil",
        "2 1/2-inch-thick red onion slices",
        "1/4 cup pomegranate juice",
        "1/4 cup fresh lime juice",
        "1 tablespoon pomegranate molasses*",
        "1 tablespoon minced seeded serrano chiles",
        "3/4 teaspoon aniseed, ground in spice mill",
        "2 1/2 tablespoons chopped fresh cilantro",
        "4 large navel oranges",
        "5 cups thinly sliced red cabbage",
        "3 large bunches watercress, thick stems trimmed (about 10 cups)",
        "5 green onions, trimmed, cut into thin matchstick-size strips",
        "2 large avocados, peeled, pitted, cut lengthwise into 1/2-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Garlic",
        "Onion",
        "Christmas",
        "Vegetarian",
        "Quick & Easy",
        "Lime",
        "Orange",
        "Avocado",
        "Pomegranate",
        "Cabbage",
        "Watercress"
    ],
    "title": "Watercress, Orange, and Avocado Salad",
    "url": "http://www.epicurious.com/recipes/food/views/watercress-orange-and-avocado-salad-233390"
}
