{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Wrap belacan tightly in foil and bake 10 minutes. Open foil carefully and cool belacan to room temperature, about 15 minutes. Crumble belacan into mini food processor and finely purée with chiles and shallots.",
        "Heat oil in wok over moderate heat until hot but not smoking, then add belacan mixture and cook, stirring constantly, 3 minutes. Add shrimp and increase heat to moderately high, then cook, stirring, until beginning to turn pink, about 1 minute. Add coconut milk, stock, and salt and simmer, stirring occasionally, 2 minutes.",
        "Increase heat to high, then add water spinach and cook, stirring, until spinach is crisp-tender, about 3 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 teaspoon belacan (shrimp paste)",
        "4 (5 1/2-inch) fresh Holland red chiles, sliced, including seeds if desired (for a spicier dish)",
        "1/2 cup chopped shallots (2 large)",
        "2 tablespoons vegetable oil",
        "1/2 lb large shrimp in shell (about 21 to 25 per lb), peeled, deveined, and cut crosswise into 1/2-inch pieces",
        "3/4 cup well-stirred unsweetened canned coconut milk (not low-fat)",
        "1/3 cup Nonya chicken stock epi:recipelinkor reduced-sodium chicken broth</epi:recipelink>",
        "1 teaspoon salt",
        "1 1/2 lb water spinach, bottom 4 inches discarded and remainder (leaves with stems) cut crosswise into 1-inch pieces",
        "Special equipment: a mini food processor; a large wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Wok",
        "Side",
        "Bake",
        "Stir-Fry",
        "Quick & Easy",
        "Shrimp",
        "Spinach",
        "Hot Pepper",
        "Healthy",
        "Shallot",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Water Spinach with Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/water-spinach-with-shrimp-234663"
}
