{
    "directions": [
        "Pulse shallot, garlic, and ginger in a food processor to finely chop. Heat oil in a large saucepan over medium. Add shallot mixture and cook, stirring often, until golden brown, about 4 minutes. Add curry paste and turmeric; cook, stirring, until paste is darkened in color and mixture starts to stick to pan, about 3 minutes. Add tomatoes, breaking up with your hands, then juices. Cook, stirring often and scraping up browned bits, until tomatoes start to break down and stick to pot, about 5 minutes.",
        "Stir in coconut milk and season with salt. Simmer, stirring occasionally to prevent sticking, until mixture is slightly thickened and flavors meld, 8–10 minutes. Add vegetables and pour in enough water to cover. Bring to a simmer and cook, stirring occasionally, until vegetables are crisp-tender, 8–10 minutes.",
        "Season fish all over with salt and nestle into curry (add a little more water if it’s very thick). Return to a simmer and cook just until fish is cooked through, about 5 minutes.",
        "Spoon curry over rice noodles and top with cilantro and a squeeze of lime.",
        "Curry base (without vegetables or fish) can be made 3 days ahead. Cover and chill. Reheat over medium-low, adding water to thin as needed."
    ],
    "ingredients": [
        "1 large shallot",
        "6 garlic cloves",
        "1 (2-inch) piece ginger, peeled, cut into pieces",
        "2 tablespoons vegetable oil",
        "2 tablespoons red curry paste",
        "2 teaspoons ground turmeric",
        "1 1/2 cups whole peeled tomatoes, plus juices from one 15-ounce can or half of one 28-ounce can",
        "1 (13.5-ounce) can unsweetened coconut milk",
        "Kosher salt",
        "1 pound mixed vegetables (such as cauliflower, carrots, and/or shallots), cut into 1-inch pieces",
        "1 pound firm white fish (such as halibut or cod), skin removed, cut into 2-inch pieces",
        "Cooked rice noodles, cilantro leaves with tender stems, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Curry",
        "Soup/Stew",
        "Garlic",
        "Tomato",
        "Coconut",
        "Fish",
        "Seafood",
        "Wheat/Gluten-Free",
        "Dinner",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Weeknight Red Curry",
    "url": "http://www.epicurious.com/recipes/food/views/weeknight-red-curry"
}
