{
    "directions": [
        "Heat oil in a small heavy pot over medium-high. Add ground pork and cook undisturbed until very well browned, about 5 minutes. Break pork up into small pieces and continue to cook, stirring occasionally, until browned all over, about 3 minutes longer. Add jalapeño, garlic, ginger, and 4 scallions and cook, stirring often, until softened and very fragrant, about 3 minutes. Add tomato paste and Sichuan peppercorns and cook, stirring constantly, until paste is slightly darkened in color, about 1 minute. Add broth and black bean garlic sauce and bring to a simmer. Mix cornstarch and 1 Tbsp. water in a small bowl to form a slurry, then stir into broth. Return to a simmer and cook just until slightly thickened, about 1 minute. Add tofu, cover pot, and let simmer gently until tofu is heated through (do not stir or tofu will break apart).",
        "Divide mapo dofu into bowls and top with basil and more chopped scallion. Serve with rice."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "8 ounces ground pork",
        "1 jalapeño, thinly sliced",
        "4 garlic cloves, sliced",
        "1 (1 1/2-inch) piece ginger, peeled, finely chopped",
        "4 scallions, chopped, plus more for serving",
        "1 tablespoon tomato paste",
        "1 teaspoon ground Sichuan peppercorns or freshly ground black pepper",
        "2 cups low-sodium chicken broth",
        "3 tablespoons Chinese black bean garlic sauce",
        "1 tablespoon cornstarch",
        "1 pound silken tofu, drained, cut into 1-inch pieces",
        "Torn basil leaves and steamed white rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tofu",
        "Pork",
        "Quick & Easy",
        "Ginger",
        "Chile Pepper",
        "Hot Pepper",
        "Jalapeño",
        "Green Onion/Scallion",
        "Dinner"
    ],
    "title": "Weeknight Mapo Tofu With Ground Pork",
    "url": "http://www.epicurious.com/recipes/food/views/weeknight-mapo-tofu-with-ground-pork"
}
