{
    "directions": [
        "Heat 2 tablespoons of olive oil in a large (12-inch) skillet over medium-high heat. Add the ground sirloin and cook, crumbling the meat with a wooden spoon, for 5 to 7 minutes, until the meat has lost its pink color and has started to brown. Stir in the garlic, oregano and red pepper flakes and cook for 1 more minute. Pour 1 cup of the wine into the skillet and stir to scrape up any browned bits. Add the tomatoes, tomato paste, 1 tablespoon salt and 1 1/2 teaspoons pepper, stirring until combined. Bring to a boil, lower the heat and simmer for 10 minutes.",
        "Meanwhile, bring a large pot of water to a boil, add a tablespoon of salt, a splash of oil and the pasta, and cook according to the directions on the box.",
        "While the pasta cooks, finish the sauce. Add the nutmeg, basil, cream and the remaining 1/4 cup wine to the sauce and simmer for 8 to 10 minutes, stirring occasionally until thickened. When the pasta is cooked, drain and pour into a large serving bowl. Add the sauce and 1/2 cup Parmesan and toss well. Serve hot with Parmesan on the side.",
        "Photograph by Johnny Miller"
    ],
    "ingredients": [
        "2 tablespoons good olive oil, plus extra to cook the pasta",
        "1 pound lean ground sirloin",
        "4 teaspoons minced garlic (4 cloves)",
        "1 tablespoon dried oregano",
        "1/4 teaspoon crushed red pepper flakes",
        "1 1/4 cups dry red wine, divided",
        "1 (28-ounce) can crushed tomatoes, preferably San Marzano",
        "2 tablespoons tomato paste",
        "Kosher salt and freshly ground black pepper",
        "3/4 pound dried pasta, such as orecchiette or small shells",
        "1/4 teaspoon ground nutmeg",
        "1/4 cup chopped fresh basil leaves, lightly packed",
        "1/4 cup heavy cream",
        "1/2 cup freshly grated Parmesan cheese, plus extra for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bolognese",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Weeknight Bolognese",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/weeknight-bolognese"
}
