{
    "directions": [
        "Mix the flour, 3/4 cup granulated sugar, baking powder, and salt together in a large bowl. Cut the butter into cubes and add to the flour mixture. Using a pastry cutter or your hands, work the butter into the flour until it’s no longer visible. Add the egg and knead until the dough is smooth. Wrap tightly in plastic wrap and refrigerate for at least 1 hour and up to 24 hours.",
        "Peel, core, and quarter the apples. Cut them into slices 1/8 to 1/4 inch/3 to 6mm thick and put the slices in a large pot. Add the juice of 1 lemon along with the Lebkuchen Spice and the 1/4 cup/60ml of water. Cover the pot and bring to a simmer over medium heat, stirring occasionally. Cook the apples for 15 to 20 minutes, or until silky and relatively broken down. The apples should not turn completely to mush but still retain some shape. Take the pot off the heat and stir in the cranberries and the remaining 1 Tbsp granulated sugar.",
        "Preheat the oven to 350°F/180°C. Line the bottom of a 9-inch/23cm springform pan with parchment paper. Take two-thirds of the dough and pat it evenly into the springform pan, forming a 1-inch-/2.5cm-high rim at the edges. Refrigerate the remaining dough. Prick the dough in the pan evenly all over with a fork. Line the dough with a sheet of aluminum foil and fill the pan with pie weights or dried beans. Bake for 20 to 30 minutes, or until the crust is starting to firm up but is not yet browning. Remove from the oven and carefully remove the aluminum foil and pie weights; maintain the oven temperature.",
        "Scrape the apple mixture evenly into the par-baked shell and smooth the top. The apple filling should precisely fill the crust. Roll out the remaining one-third of the dough between two pieces of plastic wrap until just slightly larger than the circumference of the pan. Trim the edges of the circle and then gently transfer the circle to the top of the cake, laying it over the apple filling. Tuck in the top crust and cut off any excess. Cut 3 small slits in the top of the dough. Put the pan back in the oven and bake for 35 to 45 minutes, or until the top is golden brown and slightly puffed.",
        "Remove the pan from the oven and let cool for 10 minutes while you prepare the glaze. Sieve the confectioners’ sugar into a small bowl and whisk in the 2 teaspoons of lemon juice and the 2 teaspoons of water until smooth. Brush the glaze over the still-hot cake and then let the cake cool completely before serving. The cake will keep at room temperature, covered lightly with plastic wrap, for 2 to 3 days."
    ],
    "ingredients": [
        "2 1/3 cups, scooped and leveled, plus 1 tablespoon/300g all-purpose flour",
        "3/4 cup/150g plus 1 tablespoon granulated sugar, divided",
        "1 teaspoon baking powder",
        "Pinch of salt",
        "10 1/2 tablespoons/150g unsalted high-fat, European-style butter, softened",
        "1 egg, at room temperature",
        "6 large apples (2 pounds 10 ounces/1.2kg)",
        "Juice of 1 lemon plus 2 teaspoons freshly squeezed lemon juice",
        "1 1/4 teaspoon Lebkuchen Spice Mix",
        "1 cup fresh cranberries",
        "1/4 cup/60ml plus 2 teaspoons water",
        "3/4 cup/75g confectioners’ sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Christmas",
        "Bake",
        "Cake",
        "Cranberry",
        "Spice",
        "Apple",
        "Dessert"
    ],
    "title": "Christmas Glazed Apple Cake (*Weihnachten Gedeckter Apfelkuchen*)",
    "url": "http://www.epicurious.com/recipes/food/views/weihnachten-gedeckter-apfelkuchen-christmas-glazed-apple-cake"
}
