{
    "directions": [
        "1. Preheat the oven to 375°F.",
        "2. Prepare pie dough and form pie shell as directed through Step 4 in the Buttery Pie Crust recipe, rolling out the bottom crust to fit a 9-inch pie plate. Roll out the top crust and fold it into quarters. Beginning about 3/4 inch from the center point, use a knife to cut 3 slits on both of the straight sides, leaving 1/2 inch between each. This will allow steam to escape as the pie bakes. Place the top crust on a plate. Cover both crusts with plastic wrap and refrigerate until ready to use.",
        "3. Peel, core, and thickly slice the apples. Place them in a large bowl and toss gently with the lemon juice.",
        "4. Combine the brown sugar, ginger, cornstarch, and 1 teaspoon of the cinnamon in a food processor. Pulse the machine on and off until well mixed and the ginger has been finely chopped. Add this mixture to the apples, along with the Calvados; toss gently to combine.",
        "5. Remove the prepared pie shell from the refrigerator. Brush the bottom and sides with the egg-white mixture to prevent sogginess. Spoon in the apple filling. Dot the filling with the butter.",
        "6. Remove the top crust from the refrigerator and unfold it over the filling. Trim the overhang to 1 inch. With a little water, moisten the edges where the crusts meet, then press together lightly and turn under. Crimp the edge decoratively. Brush the top crust lightly with the milk. Mix the remaining 1/2 teaspoon cinnamon with the sugar and sprinkle the mixture over the pie.",
        "7. Bake the pie in the center of the oven until the apples are tender, the juices are bubbly and the crust is golden brown, about 1 hour. Let cool on a rack before serving warm or at room temperature."
    ],
    "ingredients": [
        "Buttery Pie Crust for a 9-inch double pie",
        "5 or 6 large Granny Smith apples (to make 5 cups, sliced)",
        "1 1/2 tablespoons fresh lemon juice",
        "1/2 cup (packed) light-brown sugar",
        "4 ounces crystallized ginger",
        "2 tablespoons cornstarch",
        "1 1/2 teaspoons ground cinnamon",
        "2 tablespoons Calvados (apple brandy)",
        "1 large egg white, lightly beaten with 1 tablespoon water",
        "2 tablespoons cold unsalted butter, cut into small pieces",
        "2 tablespoons milk",
        "1 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Apple",
        "Fall",
        "Parade",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wende's Blue-Ribbon Apple Pie with Candied Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/wendes-blue-ribbon-apple-pie-with-candied-ginger-106670"
}
