{
    "directions": [
        "Preheat oven to 325°F. and lightly grease and flour a large baking sheet.",
        "In a bowl with an electric mixer, beat together butter, sugar, zest and vanilla until light and fluffy. Add eggs, 1 at a time, beating well after each addition.",
        "Into a bowl, sift together flour, baking powder and salt and gradually beat into butter mixture, beating until combined well. Stir in remaining ingredients. Chill dough 30 minutes, or until it no longer feels sticky.",
        "Turn dough out on a lightly floured surface and halve. Form each piece into a flattish log about 12 inches long by 3 inches wide. Arrange logs at least 3 inches apart on baking sheet and bake in middle of oven until pale golden, about 30 minutes. Cool logs on baking sheet on a rack 5 minutes.",
        "On a cutting board cut logs crosswise on a diagonal into 1-inch-thick slices and arrange biscotti, cut sides down, on baking sheet. Bake biscotti in middle of oven 15 minutes, or until golden.",
        "Transfer biscotti to racks and cool completely. Biscotti keep in an airtight container at room temperature."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "3/4 cup sugar",
        "1 tablespoon freshly grated orange zest",
        "1/2 teaspoon vanilla",
        "2 large eggs",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "2 ounces white chocolate, chopped coarse (about 1/2 cup)",
        "1/2 cup dried currants",
        "1 1/4 cups natural shelled pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Currant",
        "Orange",
        "Dried Fruit",
        "Pistachio",
        "Gourmet",
        "Providence",
        "Rhode Island"
    ],
    "title": "Wendy's Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/wendys-biscotti-10075"
}
