{
    "directions": [
        "1. In a dry skillet heated on high, toast the ancho chiles on each side for about 10 seconds or just until they start to puff. Fill the skillet with enough water to cover chiles. Leave the heat on until water begins to boil and then turn off the heat and let the chiles soak until soft, about 30 minutes. Once hydrated, discard the soaking water and rinse the chiles.",
        "2. Put ancho chiles, chipotle chiles, garlic, half of the diced onions, cumin, oregano, allspice, and chicken broth in a blender and puree. It should be thick and smooth.",
        "3. In a pot, heat 1 tablespoon of lard or oil on low heat and then whisk in the flour. Pour in the sauce, and simmer for 15 minutes, stirring occasionally. Add salt and black pepper to taste, and adjust other seasonings as needed.",
        "4. Preheat the oven to 350 degrees and lightly grease a large baking dish.",
        "5. In a skillet, heat on medium 1 tablespoon of lard or oil. Cook each tortilla for about 30 seconds on each side (or until soft). Keep warm in a towel or a warmer.",
        "6. To assemble the enchiladas, take a tortilla and place it in the baking dish. Drizzle 1/4 cup of the sauce on each tortilla and then add 1/4 cup of the grated cheeses, mixed, and 1 teaspoon of onions. Add another tortilla, and add same amount of sauce, cheese, and onions. Add a third tortilla, and again top with sauce, cheese, and onions. Repeat until you have four stacks.",
        "7. Bake enchiladas in the oven for 15 minutes or until cheese is melted and bubbling. While enchiladas are cooking, heat the remaining tablespoon of lard or oil in the cast-iron skillet and then fry the eggs two at a time (or however many will fit). To serve, place an enchilada stack on a plate and top with a fried egg."
    ],
    "ingredients": [
        "6 dried ancho chiles, seeds and stems removed",
        "2 canned chipotle chiles in adobo",
        "4 large cloves garlic, chopped",
        "1/4 medium yellow onion, chopped",
        "1 teaspoon ground cumin",
        "1/2 teaspoon oregano",
        "1/4 teaspoon ground allspice",
        "2 cups chicken broth or water",
        "1 tablespoon lard or vegetable oil",
        "1 tablespoon all-purpose flour",
        "Salt and black pepper, to taste",
        "2 tablespoons lard or vegetable oil, divided",
        "12 corn tortillas",
        "1 1/2 cups grated cheddar cheese (6 ounces)",
        "1 1/2 cups grated Monterey Jack cheese (6 ounces)",
        "1/4 medium yellow onion, diced",
        "4 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Bake",
        "Dinner",
        "Cheddar",
        "Tailgating",
        "Party",
        "Tortillas",
        "Monterey Jack",
        "Chile Pepper",
        "Advance Prep Required",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "West Texas Stacked Enchiladas",
    "url": "http://www.epicurious.com/recipes/food/views/west-texas-stacked-enchiladas-367410"
}
