{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round baking pans.",
        "Mix cake mix, 1 cup water, oil, and eggs in a large bow until well blended. Pour batter into prepared baking pans.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 26 to 31 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Slice one cakes in half horizontally and place one half in a 10-inch springform pan. Save remaining 3/4 cake for another use.",
        "Melt chopped baking chocolate and cream cheese in a large microwave-safe bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Set aside to cool.",
        "Mix 1 teaspoon gelatin with 1 tablespoon cold water in a small bowl for 1 minutes; add boiling water and stir until gelatin is dissolved. Allow to cool.",
        "Beat 3/4 cups heavy whipping cream until foamy in a large bowl. Add 1/2 teaspoon sugar and gelatin mixture; continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the whipped cream should form a sharp peak that holds its shape. Fold about 1/4 the whipped cream into the cooled chocolate cream cheese mixture until well blended; fold remaining whipped cream into chocolate mixture to create a mousse. Spread mousse over cake arranged in springform pan. Refrigerate while preparing next layer.",
        "Beat egg yolks in a large bowl until yolks are a pale yellow. Beat in 1/4 cup sugar, 3 tablespoons flour, and 1 teaspoon gelatin until  mixed.",
        "Bring 1 3/4 cups heavy whipping cream and vanilla extract to a boil in a saucepan; lower heat to medium. Pour about 1/2 cup hot cream into egg mixture while stirring; stir remaining cream mixture into bowl. Pour cream mixture through a strainer into the saucepan; continue cooking and stirring until mixture is thick enough to coat the back of a spoon, about 10 minutes. Allow custard to cool, then pour over mousse layer in springform pan. Place cake in freezer while making remaining layer.",
        "Reserve 1/2 cup chocolate chips; pour remaining chocolate chips in a large bowl.",
        "Bring 1 1/2 cups heavy whipping cream and butter to a boil in a clean saucepan. Pour cream mixture into the bowl over chocolate chips. Stir until smooth and chocolate is melted. Allow mixture to cool until chocolate ganache begins to thicken.",
        "Remover cake from freezer and remove pan collar from the springform pan. Pour chocolate ganache over cake; use a spatula to evenly spread chocolate over top and sides of the cake. Press reserved 1/2 cup chocolate chips along the side of the cake. Refrigerate until ready to serve."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/1907171.jpg",
    "ingredients": [
        "1 (18.25 ounce) package devil's food cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 large eggs",
        "1 (4 ounce) bar semisweet baking chocolate, chopped",
        "1/2 (8 ounce) package cream cheese, cubed",
        "1 teaspoon unflavored gelatin",
        "1 tablespoon cold water",
        "1 tablespoon boiling water",
        "3/4 cup heavy whipping cream",
        "1/2 teaspoon white sugar",
        "3 egg yolks",
        "1/4 cup white sugar",
        "3 tablespoons all-purpose flour",
        "1 teaspoon unflavored gelatin",
        "1 3/4 cups heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1 (18 ounce) package miniature semisweet chocolate chips",
        "1 1/2 cups heavy whipping cream",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "What (Chocolate) Dreams Are Made Of Cake",
    "url": "http://allrecipes.com/recipe/223077/what-chocolate-dreams-are-made-of-c/"
}