{
    "directions": [
        "Purée all vinaigrette ingredients in a blender. Reserve 1 cup vinaigrette for marinating tofu.",
        "Combine reserved vinaigrette and soy sauce in a sealable plastic bag. Add tofu, seal bag, and turn to coat. Marinate, chilled, turning bag over occasionally, at least 30 minutes and up to 1 day. Bring to room temperature, about 30 minutes, before grilling.",
        "Simmer wheat berries in unsalted water in a 2- to 3-quart saucepan, partially covered, until tender but still chewy, 1 1/4 to 1 1/2 hours. Drain, then return to pan and stir in salt. Cool to room temperature.",
        "Prepare grill for direct-heat cooking over hot charcoal.",
        "Pour off marinade from tofu and pat dry, then transfer to a plate.",
        "Thread tomatoes 1/4 inch apart onto skewers.",
        "Oil grill rack and grill bell peppers, covered only if using a gas grill, turning occasionally with tongs, until skins are blackened, 10 to 12 minutes. Transfer to a bowl, then cover and let steam 10 minutes.",
        "Grill tomatoes, covered only if using a gas grill, turning over once, until blistered and softened, 3 to 4 minutes.",
        "Oil grill rack well, then grill tofu, covered only if using a gas grill, until grill marks appear, about 3 minutes. Loosen tofu with a metal spatula, then turn over and grill until heated through and grill marks appear, about 3 minutes more. Transfer to a clean plate and cover.",
        "Assemble salad: Stir together tomatoes, celery, scallions, olives, wheat berries, and 1/2 cup vinaigrette. Let stand, uncovered, 15 minutes.",
        "Peel and seed peppers, then cut into 1-inch-wide strips. Stir into wheat-berry mixture.",
        "Halve pieces of tofu diagonally (for a total of 8 triangles).",
        "Toss lettuce and mint on a platter, then top with wheat-berry mixture and tofu. Drizzle with some vinaigrette; serve remainder on the side."
    ],
    "ingredients": [
        "1/2 pounds tomatoes, chopped",
        "1/4 cup red-wine vinegar",
        "1 tablespoon balsamic vinegar",
        "2 teaspoons Dijon mustard",
        "2 teaspoons sugar",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 cup extra-virgin olive oil",
        "1 (14-ounce) block extra-firm tofu, cut crosswise into 4 thick slices",
        "1 cup reserved tomato vinaigrette",
        "1 tablespoon soy sauce",
        "1 cup wheat berries (whole-grain wheat)",
        "1/2 teaspoon salt",
        "1/2 pound cherry tomatoes (about 14)",
        "4 yellow bell peppers (1 1/2 pounds)",
        "3 celery ribs, halved lengthwise and thinly sliced",
        "3 scallions, halved lengthwise and thinly sliced",
        "1/2 cup pitted brine-cured black olives, such as Kalamata, halved",
        "1 head Boston lettuce, torn into bite-size pieces (6 cups)",
        "1 cup torn fresh mint leaves",
        "Special equipment: 2 (12-inch) wooden skewers, soaked in water for 30 minutes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Herb",
        "Mustard",
        "Olive",
        "Onion",
        "Pepper",
        "Soy",
        "Tomato",
        "Vegetable",
        "Quick & Easy",
        "Backyard BBQ",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Wheat-Berry Salad with Grilled Tofu",
    "url": "http://www.epicurious.com/recipes/food/views/wheat-berry-salad-with-grilled-tofu-238674"
}
