{
    "directions": [
        "1. Put the oil in a large pot or Dutch oven over medium-high heat. When it's hot, add the beef a few pieces at a time, turning as they cook and sprinkling with salt and pepper. (Don't crowd or the cubes will not brown properly; cook in batches if necessary.) Brown the meat well on all sides, 5 to 10 minutes total.",
        "2. As the pieces brown, remove them with a slotted spoon. Pour off all but 3 tablespoons of the fat from the pan and turn the heat down to medium. Add the onions and garlic and cook, stirring, until softened and beginning to color, 5 to 10 minutes. Add the wine and cook, stirring to scrape up any brown bits from the bottom of the pan, for a minute or 2. Add the stock, wheat berries, bay leaf, thyme, and meat and bring to a boil. Turn the heat down so the liquid bubbles gently. Cover and cook, undisturbed, for 1 hour.",
        "3. Uncover the pot; the mixture should still be wet and the wheat berries almost fully tender. If not, add a little more liquid, cover, and cook for another 15 minutes, then check again; the grains should be tender and the mixture soupy but not swimming in liquid. If not, repeat this step until they're ready.",
        "4. Add the parsnips, turn the heat up for a minute or so to bring the liquid back to a boil, then lower the heat and cover again. Cook, stirring once or twice, until the parsnips are tender but not too soft, 10 to 15 minutes. Remove the bay leaf and thyme sprig, then taste and adjust the seasoning. (The stew can be made ahead to this point and refrigerated for up to 3 days; reheat gently before proceeding.) Garnish with parsley and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "12 ounces boneless beef chuck or round, cut into large cubes",
        "Salt and black pepper",
        "2 onions, cut into wedges",
        "4 garlic cloves, sliced",
        "1/2 cup red wine",
        "4 cups beef or vegetable stock or water, or more as needed",
        "3/4 cup wheat berries",
        "1 bay leaf",
        "1 sprig fresh thyme, or several pinches dried",
        "1 pound parsnips, cut into 1/2-inch slices",
        "1/4 cup chopped fresh parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Braise",
        "Dinner",
        "Meat",
        "Root Vegetable",
        "Parsnip",
        "Fall",
        "Advance Prep Required",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wheat Berries with Braised Beef and Parsnips",
    "url": "http://www.epicurious.com/recipes/food/views/wheat-berries-with-braised-beef-and-parsnips-362729"
}
