{
    "directions": [
        "Preheat oven to 400°F. Line heavy large baking sheet with parchment paper. Roll out pastry on floured surface to 15x12-inch rectangle. Cut crosswise into three 12x5-inch strips. Transfer 2 pastry strips to prepared sheet, spacing evenly (freeze third strip for another use). Pierce pastry all over with fork. Freeze 10 minutes.",
        "Bake pastry strips until golden and puffed, about 15 minutes. Transfer baking sheet to rack; cool pastry. Using long serrated knife, trim top side of pastry layers horizontally so that they are flat and even. (Pastry can be prepared 8 hours ahead. Store airtight at room temperature.)",
        "Combine 2 teaspoons water and espresso powder in medium bowl; stir to dissolve. Mix in enough powdered sugar by tablespoonfuls to form thick spreadable icing. Spread icing over bottom side of 1 pastry sheet. Let stand until icing sets, about 20 minutes.",
        "Place remaining 1 tablespoon water in heavy small saucepan. Sprinkle gelatin over. Let stand 10 minutes to soften. Add 2 tablespoons cream to gelatin mixture and stir over medium-low heat until gelatin dissolves, about 1 minute. Remove from heat. Pour 1/2 cup cream into large bowl. Add 1 tablespoon sugar, vanilla and gelatin mixture and beat to stiff peaks.",
        "Place second pastry strip on work surface, trimmed side up. Spread jam over. Top with dollops of whipped cream; spread gently to cover. Top with iced pastry, iced side up. Refrigerate at least 1 hour and up to 3 hours. Using serrated knife, carefully cut pastry crosswise into 8 slices. Transfer to plates."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "2 teaspoons plus 1 tablespoon water",
        "1 teaspoon instant espresso powder",
        "6 tablespoons (about) powdered sugar",
        "1/4 teaspoon unflavored gelatin",
        "2 tablespoons plus 1/2 cup chilled whipping cream",
        "1 tablespoon sugar",
        "1/2 teaspoon vanilla extract",
        "1/4 cup raspberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Raspberry",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Whipped Cream Pastries with Jam and Coffee Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/whipped-cream-pastries-with-jam-and-coffee-glaze-1969"
}
