{
    "directions": [
        "Brush an 8x8x2\" or other 6-cup baking dish with 1 tablespoon melted butter. Place potatoes in a large pot and add cold water to cover by 1\". Add a large pinch of salt; bring to a boil, then reduce heat to medium-low. Cover with lid slightly ajar and gently simmer until potatoes are tender, about 20 minutes.",
        "Drain potatoes; return to same pot. Shake and stir with a wooden spoon over very low heat until dry. Then, using a potato masher, mash coarsely. Using a hand mixer, beat 1/2 cup butter into potatoes, a few pieces at a time, until blended. Beat in cream cheese, adding a few pieces at a time, then horseradish. With motor running, gradually add milk, beating until potatoes are light and fluffy, 4-5 minutes. Season well with salt and pepper.",
        "Stir in scallions. Scrape potatoes into prepared dish.3 Use a spatula to create peaks across the surface. Drizzle potatoes with remaining 1 tablespoon melted butter and sprinkle with paprika. DO AHEAD: Potatoes can be made 1 day ahead. Let stand at room temperature to cool. Cover and chill.",
        "Preheat oven to 350°F. Bake potatoes, uncovered, until they are heated through and top is golden, about 40 minutes (if chilled, add 10 minutes)."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, melted, divided, plus 1/2 cup (1 stick), cut into 1\" cubes, room temperature",
        "2 1/2 pounds russet potatoes, peeled, cut into 2\" pieces",
        "Kosher salt",
        "4 ounces cream cheese, cut into 1\" cubes, room temperature",
        "2 tablespoons prepared horseradish",
        "2/3 cup whole milk, warmed",
        "Freshly ground black pepper",
        "1 bunch scallions, white and pale-green parts only, minced (about 2/3 cup loosely packed)",
        "Hungarian sweet paprika"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Potato",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "Low Sodium",
        "Horseradish",
        "Potluck",
        "Boil",
        "Butter",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Whipped Potatoes with Horseradish",
    "url": "http://www.epicurious.com/recipes/food/views/whipped-potatoes-with-horseradish-51123060"
}
