{
    "directions": [
        "1. If you're using dried beans, first rinse them, picking out any stones, and place in a bowl. Cover with cold water and soak for 8 hours, or overnight, then drain the beans and place in a pot. Add the garlic and bay leaf and enough water to cover the beans by at least 1 inch. Bring to a boil, reduce the heat, cover, and simmer, stirring occasionally, until the beans are tender, about 1 hour.",
        "2. In a small bowl, combine the olive oil, lemon zest, lemon juice, honey, and shallot. Whisk to combine.",
        "3. When the beans are done, drain them well and place in a medium bowl. Discard the bay leaf and garlic clove. Add one third of the vinaigrette to the warm beans and toss; then let stand for 15 minutes, tossing occasionally. If using canned beans, rinse and drain them, then toss with the vinaigrette.",
        "4. In a small pot of boiling water, cook the snow peas or sugar snap peas for 1 minute. Using a slotted spoon, place them in a bowl of ice water. Drain, pat dry, and slice thin.",
        "5. In a large salad bowl, place the cooled beans, snow peas, chives, radishes, and basil. Pour the remaining dressing over and toss lightly. Serve immediately."
    ],
    "ingredients": [
        "1 cup dried small white beans, such as cannellini or Great Northern, or 1 15-ounce can",
        "1 clove garlic",
        "1 bay leaf",
        "1/4 cup extra-virgin olive oil",
        "1/2 teaspoon grated lemon zest",
        "1 tablespoon lemon juice",
        "1/2 teaspoon honey",
        "1 tablespoon chopped shallot",
        "1 cup snow peas or sugar snap peas",
        "1/2 bunch fresh chives, chopped",
        "5 mild radishes, such as Lady Slipper radishes, thinly sliced",
        "3 tablespoons chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Lunch",
        "Legume",
        "Radish",
        "Spring",
        "Healthy",
        "Sugar Snap Pea",
        "Lemon Juice",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Bean Salad",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-salad-51103000"
}
