{
    "directions": [
        "Coat 7 1/2 x 3 3/4 x 2-inch (3 cup) loaf pan with nonstick vegetable oil spray. Line with 3x12-inch strip of waxed paper, pressing gently to fit and overlapping ends of pan.",
        "Warm 1/3 of chocolate with cream in heavy small saucepan over low heat, stirring constantly with rubber spatula until melted and smooth. Add remaining chocolate in 2 batches, allowing second batch to melt completely before adding last third. Remove from heat occasionally to avoid overheating chocolate. Add 3 tablespoons butter and 1 tablespoon framboise. Stir until butter is just melted. Repeat with remaining butter and framboise. Remove from heat; let stand in warm area while assembling terrine layers.",
        "Pour 2/3 cup chocolate mixture into prepared pan and freeze until set but not hard, about 15 minutes. Choose medium-size berries and arrange upside down in 9 crosswise rows of 3 berries each, spacing evenly and leaving border around edge of pan. Press gently into chocolate. Gently pour 1 cup chocolate mixture over berries in even layer. Freeze until set but not hard, about 20 minutes. Repeat layering with more berries to form second layer. Press gently into chocolate. Gently pour remaining chocolate mixture over. Smooth to form even layer. Refrigerate until firm. Cover and chill overnight. Reserve remaining berries for garnish. (Can be prepared 2 days ahead.)",
        "Combine raspberries with syrup and pear in heavy small saucepan. Stir to coat pear with syrup. Bring to simmer. Simmer until pear softens, about 10 minutes. Puree in blender until smooth. Strain puree through fine sieve. (Can be prepared 2 days ahead. Cover tightly and refrigerate.)",
        "Run small sharp warm knife around top edge of terrine. If necessary dip bottom of terrine into warm water about 5 seconds. Using waxed paper as aid, gently unmold onto small cutting board. Peel off waxed paper. Use spatula to smooth surface if necessary.",
        "Heat long thin knife under warm water. Dry knife and slice terrine into 1/8-inch-thick slices, cleaning and warming knife as necessary. Place 2 to 3 slices in center of each plate. Garnish one side of plate with reserved fresh berries and mint leaves. (Can be prepared 2 hours ahead. Cover; chill.)",
        "Just before serving, mix framboise into sauce. Spoon 2 to 3 tablespoons sauce opposite berries. Let stand at room temperature 10 minutes."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "18 ounces imported white chocolate (such as Tobler or Lindt), finely chopped",
        "1/2 cup whipping cream",
        "6 tablespoons (3/4 stick) unsalted butter, cut into small pieces, room temperature",
        "2 tablespoons framboise eau-de-vie (clear raspberry brandy)",
        "1 pint (2 baskets) raspberries",
        "1 10-ounce package frozen raspberries in syrup",
        "1 7-ounce ripe pear, halved, cored, cut into eighths",
        "Mint leaves",
        "2 tablespoons framboise eau-de-vie"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Fruit",
        "Dessert",
        "Raspberry",
        "Brandy",
        "Spring",
        "Summer",
        "Shower"
    ],
    "title": "White Chocolate and Fresh Raspberry Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-fresh-raspberry-terrine-1856"
}
