{
    "directions": [
        "Place chiles in bowl; add enough water to cover. Let stand at room temperature overnight. Drain. Boil 1 1/2 cups water, sugar, and chiles in small saucepan until 2 tablespoons liquid remain, about 15 minutes. Transfer to processor; puree until smooth. With machine running, gradually add oil. Season with salt and pepper. DO AHEAD: Can be made 3 days ahead. Cover; chill.",
        "Place beans in large pot. Add enough water to cover by 4 inches. Let soak overnight.",
        "Drain beans. Melt butter in same pot over medium-high heat. Add celery, carrot, onion, and garlic; cook until soft, stirring often, about 15 minutes. Add beans and 8 cups water. Bring to boil, reduce heat to low, and cook until beans are soft, stirring occasionally, about 1 1/2 hours. Stir in cumin and coriander; cool. Working in batches, puree soup in blender, adding water by 1/4 cupfuls if too thick. Return to same pot. Stir in cream. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Rewarm soup. Divide among bowls. Drizzle with chile paste. Swirl paste into soup; serve.",
        "*Sold at many supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "2 dried ancho chiles,* stemmed, seeded",
        "1 dried chile de rbol,* stemmed, seeded",
        "1 1/2 cups water",
        "1 tablespoon dark brown sugar",
        "3 tablespoons vegetable oil",
        "2 cups dried Great Northern beans",
        "2 tablespoons (1/4 stick) butter",
        "2 celery stalks, finely chopped",
        "1 large carrot, finely chopped",
        "1 large white onion, finely chopped",
        "1 large garlic clove, minced",
        "8 cups (or more) water",
        "2 1/2 teaspoons ground cumin",
        "2 teaspoons ground coriander",
        "1/2 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Vegetarian",
        "High Fiber",
        "Celery",
        "Hot Pepper",
        "Carrot",
        "Winter",
        "Simmer"
    ],
    "title": "White Bean Soup with Chile Paste",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-soup-with-chile-paste-239798"
}
