{
    "directions": [
        "Blend flour, sugar and salt in processor. Add butter and ginger and process using on/off turns until mixture resembles coarse meal. Add ice water and blend until moist clumps form. Gather dough into ball and divide into 2 pieces. Flatten each into disk and wrap in plastic. Chill until firm, about 1 hour. (Can be made 1 day ahead. Keep refrigerated.)",
        "Preheat oven to 375°F. Roll out each dough disk on lightly floured surface to 6-inch round. Press into each of two 4 1/2-inch tartlet pans with removable bottoms. Trim overhang to 1/2 inch. Fold overhang in, pressing to form double-thick sides. Pierce crusts all over with fork. Freeze 15 minutes. Bake crusts until golden, piercing with fork if crusts bubble, about 25 minutes. Transfer to rack. Immediately spoon 1/2 tablespoon preserves over bottom of each crust. Cool completely. Reduce oven temperature to 350°F.",
        "Bring cream to simmer in heavy medium saucepan. Remove from heat, add white chocolate and whisk until melted. Whisk yolks and vanilla in medium bowl. Slowly whisk cream mixture into yolks to blend well. Divide custard between crusts. Bake tartlets until center is just set, about 20 minutes. Cool on rack. Chill tartlets overnight.",
        "Preheat broiler. Sprinkle each tartlet with 1 teaspoon sugar. Broil just until sugar melts and browns, covering crusts with foil to prevent burning, about 2 minutes. Refrigerate tartlets until cold, at least 1 hour and up to 3 hours. Arrange raspberries around edge of tartlets."
    ],
    "ingredients": [
        "3/4 cup unbleached all purpose flour",
        "4 teaspoons sugar",
        "1/8 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1 1/2 teaspoons minced crystallized ginger",
        "1 tablespoon ice water",
        "1 tablespoon raspberry preserves, stirred to loosen",
        "6 tablespoons whipping cream",
        "1 ounce good-quality white chocolate (such as Lindt or Baker’s), finely chopped",
        "2 large egg yolks",
        "1/4 teaspoon vanilla extract",
        "2 teaspoons sugar",
        "Fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Raspberry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate-Raspberry Crème Brûlée Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-raspberry-creme-brulee-tartlets-104531"
}
