{
    "directions": [
        "Drain beans and place in a large heavy pot. Remove rind from Parmesan and add rind along with onion and garlic to beans. Pour in water to cover by 2\"; season with salt. Bring to a boil, reduce heat, and simmer, adding water as needed to keep beans submerged, until beans are tender, about 2 hours. Let cool. Discard vegetables and Parmesan rind, then drain.",
        "Preheat oven to 450°F. Toss broccoli with 1/4 cup oil on a rimmed baking sheet; season with salt and pepper. Roast, tossing occasionally, until tender and lightly charred, 15 to 20 minutes. Let cool.",
        "Finely chop half of broccoli and toss in a large bowl with anchovies, lemon zest, lemon juice, and beans. Shave half of Parmesan over and add remaining broccoli and 1/4 cup oil; toss and season with salt, pepper, and more lemon juice, if desired. Shave remaining Parmesan over."
    ],
    "ingredients": [
        "2 cups dried large white beans (such as gigante or corona), soaked overnight 3 ounces Parmesan with rind",
        "3 ounces Parmesan with rind",
        "1 onion, quartered",
        "1 head garlic, halved crosswise",
        "Kosher salt",
        "1 1/2 pounds broccoli (about 3 small heads), coarsely chopped",
        "1/2 cup olive oil, divided",
        "Freshly ground black pepper",
        "4 anchovy fillets packed in oil, drained, finely chopped",
        "2 wide strips lemon zest, thinly sliced",
        "1/4 cup fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Side",
        "Parmesan",
        "Lemon",
        "Broccoli",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "White Beans and Charred Broccoli with Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/white-beans-and-charred-broccoli-with-parmesan-51252720"
}
