{
    "directions": [
        "Place beans in heavy medium saucepan and add enough cold water to cover by 3 inches. Soak overnight. Drain. Return beans to pan. Add 8 cups water and bring to boil. Reduce heat to medium-low. Simmer gently until beans are tender, stirring occasionally, about 1 hour 15 minutes. Cool beans completely in liquid.",
        "Place remaining 4 cups water, prosciutto, 1/2 garlic head, and 1/4 teaspoon fennel seeds in heavy large saucepan. Bring to boil; reduce heat and simmer 10 minutes. Strain prosciutto broth into large measuring cup, reserving solids in strainer for soup. Add enough water to prosciutto broth to measure 4 cups. Return broth mixture to same saucepan. Add dried crushed red pepper, 2 tablespoons oil, and remaining 1/4 teaspoon fennel seeds. Gradually whisk in polenta. Bring to boil, whisking constantly. Remove from heat; cover and let stand 2 hours.",
        "Preheat oven to 350°F. Grease large baking sheet. Spread polenta on prepared baking sheet, pressing with wet hands into 1-inch-thick round. Make 2-inch hole in center to allow steam to escape during baking. Brush with 1 tablespoon oil. Bake until crisp at edges, about 35 minutes.",
        "Meanwhile, drain beans, reserving 3 cups cooking liquid. Heat remaining 1/2 cup oil in heavy large pot over medium heat. Add remaining 1/2 garlic head, cut side down, and sauté 2 minutes. Add escarole and sauté until wilted, about 2 minutes. Add beans with 3 cups cooking liquid. Remove skins from garlic in reserved solids from prosciutto broth; add solids to soup. Simmer soup 10 minutes to blend flavors. Season soup generously with salt and pepper. Discard remaining halved garlic from soup.",
        "Ladle soup into shallow soup bowls. Cut polenta into wedges. Serve alongside soup."
    ],
    "ingredients": [
        "1 cup dried cannellini (white kidney beans)",
        "12 cups water (or more), divided",
        "1/2 cup 1/4-inch dice prosciutto (about 3 ounces)",
        "1 head of garlic, cut crosswise in half",
        "1/2 teaspoon fennel seeds, divided",
        "1/8 teaspoon dried crushed red pepper",
        "3 tablespoons plus 1/2 cup extra-virgin olive oil",
        "1 cup polenta or yellow cornmeal",
        "8 cups coarsely chopped lightly packed escarole leaves (from 1 large head)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "Leafy Green",
        "Pork",
        "Bake",
        "Dinner",
        "Lunch",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "White Bean and Escarole Soup with Spicy Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-and-escarole-soup-with-spicy-polenta-235834"
}
