{
    "directions": [
        "Blend first 4 ingredients in processor until nuts are finely ground. Add butter; cut in using on/off turns until mixture resembles coarse meal. Add 2 tablespoons ice water and vanilla; process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Divide into 6 equal pieces. Flatten each into disk. Wrap each in plastic; chill 2 hours. (Can be made 2 days ahead. Keep chilled. Let dough soften slightly before continuing.)",
        "Preheat oven to 375°F. Press 1 dough disk evenly onto bottom and up sides of 4 1/2-inch-diameter tartlet pan with removable bottom. Pierce crust all over with fork. Repeat with remaining 5 dough disks. Freeze crusts until firm, about 20 minutes.",
        "Bake crusts until golden and baked through, about 25 minutes. Remove from oven. Immediately sprinkle bittersweet chocolate over bottom of hot crusts, dividing equally. Let stand until chocolate melts, about 5 minutes. Using back of spoon, spread chocolate over bottom of crusts. Chill until chocolate sets, about 10 minutes.",
        "Stir white chocolate in top of double boiler set over barely simmering water until just melted and smooth. Remove top of double boiler from over water. Cool white chocolate to room temperature. Beat cream and liqueur in medium bowl until soft peaks form. Fold cream mixture into melted white chocolate in 3 additions. Divide filling among tartlet crusts; smooth tops. Chill until filling is set, about 4 hours. (Can be made 1 day ahead. Cover loosely with foil; keep chilled.)",
        "Gently toss banana slices and orange juice in bowl. Transfer banana slices to paper towels; pat dry. Alternate banana slices and strawberry slices in circle atop tartlets, overlapping. (Can be prepared 2 hours ahead. Chill.)"
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/2 cup hazelnuts, toasted, husked",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons (or more) ice water",
        "1 teaspoon vanilla extract",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "6 ounces good-quality white chocolate (such as Lindt or Baker’s), finely chopped",
        "3/4 cup chilled whipping cream",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "2 medium bananas, peeled, thinly sliced",
        "1/4 cup orange juice",
        "1 1-pint basket strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Berry",
        "Chocolate",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Strawberry",
        "Banana",
        "Summer",
        "Chill",
        "Party",
        "Double Boiler",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate Tartlets with Strawberries and Bananas",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-tartlets-with-strawberries-and-bananas-103302"
}
