{
    "directions": [
        "For terrine: Line 9x5x2 1/2-inch loaf pan with plastic wrap, allowing plastic to overhang edges by 3 inches. Place in freezer. Whisk first 3 ingredients in large metal bowl. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until candy thermometer registers 160°F, about 4 minutes. Remove bowl from over water. Add white chocolate; whisk until melted and smooth. Mix in peppermint extract. Whisk until cool and thick, about 3 minutes.",
        "Using electric mixer, beat cream in another large bowl until stiff peaks form. Fold cream into white chocolate mixture. Spoon mixture into prepared pan; smooth top. Cover and freeze overnight.",
        "For sauce: Combine first 3 ingredients in heavy medium saucepan. Stir over medium heat until butter melts. Add both chocolates and whisk until smooth. Mix in 3 tablespoons water. Remove from heat; cool slightly. (Terrine and sauce can be made 1 week ahead. Keep terrine frozen. Cover and refrigerate sauce. Before serving, stir sauce over low heat just until warm.)",
        "Turn frozen terrine out onto platter. Peel off plastic. Cut terrine into 3/4-inch-thick slices. Place 1 slice on each plate. Drizzle sauce over. Garnish with mint."
    ],
    "ingredients": [
        "6 large egg yolks",
        "1/4 cup water",
        "1/4 cup light corn syrup",
        "8 ounces good-quality white chocolate (such as Baker's or Lindt), finely chopped",
        "1 1/4 teaspoons peppermint extract",
        "2 cups chilled whipping cream",
        "1/2 cup whipping cream",
        "1/4 cup dark corn syrup",
        "1/4 cup (1/2 stick) unsalted butter",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 ounce unsweetened chocolate, chopped",
        "3 tablespoons water",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Egg",
        "Herb",
        "Dessert",
        "Freeze/Chill",
        "Mint"
    ],
    "title": "White Chocolate Mint Terrine with Dark Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-mint-terrine-with-dark-chocolate-sauce-2005"
}
