{
    "directions": [
        "Combine 1 cup blackberries, sugar and water in heavy medium saucepan. Bring to boil over medium-high heat, stirring constantly. Boil until mixture is reduced by half, stirring occasionally, about 8 minutes. Puree mixture in blender until smooth. Strain sauce into small bowl. Cool.",
        "Combine white chocolate and 1/4 cup water in top of double boiler set over simmering water. Stir until white chocolate melts and mixture is smooth. Remove top of double boiler from over water; cool 10 minutes.",
        "Stir sour cream and lemon juice in large bowl to blend. Stir in melted chocolate mixture. Beat cream in another large bowl until stiff peaks form. Gently fold whipped cream into chocolate mixture in 3 additions. Cover and chill until mousse is set, about 2 hours.",
        "Spoon white chocolate mousse into pastry bag fitted with medium star tip. Pipe half of mousse into 4 wineglasses, dividing equally. Spoon half of blackberry sauce over. Pipe remaining mousse over sauce, dividing equally. Drizzle remaining sauce over.",
        "Garnish parfaits with additional blackberries and serve."
    ],
    "ingredients": [
        "1 cup fresh blackberries or frozen unsweetened",
        "1/4 cup sugar",
        "1/4 cup water",
        "9 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "1/4 cup water",
        "1/4 cup sour cream",
        "4 teaspoons fresh lemon juice",
        "1 1/2 cups chilled whipping cream",
        "Additional blackberries (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Chocolate",
        "Dessert",
        "Freeze/Chill",
        "Quick & Easy",
        "Blackberry",
        "Chill",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate-Blackberry Parfait",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-blackberry-parfait-763"
}
