{
    "directions": [
        "Combine first 6 ingredients in large saucepan. Stir over medium-high heat until sugar dissolves. Add pears and bring to boil. Reduce heat to medium, cover, and simmer until pears are just tender when pierced with knife, about 35 minutes. Transfer liquid with pears to large bowl and refrigerate until cold, about 3 hours.",
        "Using slotted spoon, transfer pears to plate. Boil poaching liquid in heavy large saucepan over medium-high heat until slightly thickened and reduced to generous 1 1/2 cups, about 15 minutes. Strain into 2-cup measuring cup; discard spices in strainer. Cool. Cover and chill pears and pear syrup until cold.",
        "Combine white chocolate, pear brandy, and 1/4 cup water in top of double boiler set over simmering water. Stir until smooth (mixture will be very liquidy). Scrape in seeds from vanilla bean; discard bean. Transfer white chocolate mixture to large bowl; gradually add mascarpone, whisking until mixture is smooth. Cool mascarpone mixture until barely lukewarm.",
        "Using electric mixer, beat 1 cup cream in medium bowl until peaks form. Fold whipped cream into mascarpone mixture in 4 additions. Cover and chill white chocolate mousse until set, about 3 hours. DO AHEAD: Pears and mousse can be made 1 day ahead. Keep chilled.",
        "Cut pears lengthwise in half and remove cores and stems; cut halves lengthwise into 1/4-inch-thick slices.",
        "Arrange ladyfingers, rounded sides down, in single layer in bottom of 12-cup trifle dish (about 8 inches in diameter and 5 inches deep), covering bottom completely (using about 15 ladyfingers). Drizzle 5 tablespoons pear syrup evenly over ladyfingers. Using small offset spatula, spread 1/3 of white chocolate mousse over ladyfingers, making layer slightly thicker around outer edges of dish to allow mousse to be more visible (center of mousse layer will be thin). Starting at outer edges of dish, place pear slices in single layer with curved edges against sides of dish atop mousse, covering completely. Repeat layering of ladyfingers, syrup, mousse, and pears 2 more times. Cover with fourth layer of ladyfingers (some ladyfingers and pear slices may be left over). Drizzle ladyfingers evenly with 5 tablespoons syrup. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate trifle and remaining pear syrup separately.",
        "Using electric mixer, beat 2 cups whipping cream in large bowl until soft peaks form. Add 1/4 cup pear syrup and beat until stiff peaks form. Working in batches, transfer cream to large pastry bag fitted with large star tip. Pipe rosettes all over top of trifle, mounding slightly in center. Sprinkle with crystallized ginger. Garnish with chocolate curls. DO AHEAD: Can be made 6 hours ahead. Keep refrigerated.",
        "Sift powdered sugar over trifle just before serving.",
        "* Mascarpone is an Italian cream cheese; sold at many supermarkets and at Italian markets.",
        "** Available in the bakery or bread section of some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 750-ml bottle dry white wine",
        "2 cups pear juice or pear nectar",
        "1 1/4 cups sugar",
        "12 whole green cardamom pods, crushed in resealable plastic bag with mallet",
        "4 1-inch-diameter rounds peeled fresh ginger (each about 1/8 inch thick)",
        "2 cinnamon sticks, broken in half",
        "5 large firm but ripe Anjou pears (3 to 31/4 pounds), peeled",
        "7 ounces high-quality white chocolate (such as Lindt or Perugina), finely chopped",
        "1/3 cup poire Williams (clear pear brandy)",
        "1/4 cup water",
        "1/2 vanilla bean, split lengthwise",
        "1 8- to 8.8-ounce container mascarpone cheese*",
        "1 cup chilled heavy whipping cream",
        "3 3-ounce packages soft ladyfingers,** separated",
        "2 cups chilled heavy whipping cream",
        "1/4 cup minced crystallized ginger",
        "White chocolate curls",
        "1 tablespoon powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Chocolate",
        "Dessert",
        "Christmas",
        "Pear",
        "Vanilla",
        "White Wine",
        "Winter",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate Tiramisu Trifle With Spiced Pears",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-tiramisu-trifle-with-spiced-pears-240701"
}
