{
    "directions": [
        "Preheat oven to 350°F.",
        "In small saucepan over moderately low heat, heat 2 tablespoons olive oil and tomato oil until hot but not smoking. Add pine nuts and toast, stirring occasionally, until light golden brown, 3 to 4 minutes. Remove from heat and stir in garlic, thyme, and red pepper flakes. Continue stirring until mixture cools slightly, about 3 minutes. Stir in beans, tomatoes, lemon juice, basil, Parmesan, and Feta. (Topping can be prepared ahead and refrigerated, covered, up to 6 hours. Before serving, bring to room temperature.)",
        "Arrange bread squares on parchment-lined baking sheet and brush on both sides with remaining 4 tablespoons olive oil. Toast, turning once, until light golden brown, about 3 minutes per side.",
        "Top squares with white bean topping and serve immediately. (Alternately, serve white bean, sun-dried tomato, and Feta mixture in bowl and arrange toast squares alongside.)"
    ],
    "ingredients": [
        "6 tablespoons extra-virgin olive oil",
        "1 (8.5-ounce) jar sun-dried tomatoes in oil, 2 tablespoons oil reserved and tomatoes chopped",
        "1/3 cup pine nuts",
        "2 cloves garlic, finely chopped",
        "2 teaspoons fresh thyme, chopped (from about 10 sprigs)",
        "1/2 teaspoon red pepper flakes",
        "1 ½ (15-ounce) cans white beans, drained and rinsed",
        "¼ cup fresh lemon juice (from 1 ½ lemons)",
        "½ cup fresh basil, coarsely chopped and loosely packed",
        "1 ounce Parmesan cheese, finely grated (about ¼ cup)",
        "3 ½ ounces Feta cheese, crumbled (about ½ cup)",
        "10 slices white sandwich bread, each slice cut into 4 squares",
        "¼ teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Tomato",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Quick & Easy",
        "New Year's Eve",
        "Feta",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Bean, Sun-dried Tomato, and Feta Bites",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-sun-dried-tomato-and-feta-bites-350622"
}
