{
    "directions": [
        "Preheat oven to 375°F. Combine parsnips and shallots in medium roasting pan. Drizzle with oil. Sprinkle with 1/2 teaspoon thyme, sugar, salt and pepper; toss to coat. Dot with butter. Roast until vegetables are tender and deep golden brown, stirring occasionally, about 1 hour 15 minutes.",
        "Meanwhile, combine 8 cups water, beans, 1 teaspoon salt, bay leaf and remaining 1 teaspoon thyme in heavy large pot. Bring to boil. Reduce heat to medium-low, cover and simmer until beans are almost tender, stirring occasionally, about 1 hour 15 minutes (some liquid will remain). Mix vegetables into beans, cover and cook until beans are tender, thinning with more water if needed, about 15 minutes. Discard bay leaf. Meanwhile, char peppers over gas flame or in broiler until blackened. Enclose in paper bag 10 minutes. Peel, seed and coarsely chop peppers; stir into beans. Season stew with salt and pepper."
    ],
    "ingredients": [
        "1 pound medium parsnips, peeled, halved lengthwise, cut into 2-inch-long pieces",
        "1 pound medium shallots, peeled, root ends trimmed, halved",
        "1 1/2 tablespoons olive oil",
        "1 1/2 teaspoons dried thyme",
        "1/4 teaspoon sugar",
        "1 tablespoon butter, cut into pieces",
        "8 cups (or more) water",
        "2 cups dried Great Northern beans, rinsed (about 13 ounces)",
        "1 teaspoon salt",
        "1 bay leaf",
        "2 large red bell peppers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Vegetable",
        "Stew",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Legume",
        "Root Vegetable",
        "Parsnip",
        "Winter",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Bean Stew with Parsnips, Shallots and Red Bell Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-stew-with-parsnips-shallots-and-red-bell-peppers-104586"
}
