{
    "directions": [
        "Mix 6 cups water and 6 tablespoons coarse salt in very large bowl, stirring to dissolve salt. Place cabbage, cut side up, in water so that water almost covers cabbage. Put heavy plate atop cabbage, then top with iron skillet to weigh down to submerge cabbage in water. Set aside at room temperature 10 to 12 hours.",
        "Drain cabbage; discard water. Rinse cabbage under cold water. Mix 4 cups water, 1 tablespoon coarse salt, sugar, and fish sauce in same large bowl. Let brine stand until salt dissolves, stirring occasionally, about 10 minutes.",
        "Mix pear, daikon, green onions, and garlic in medium bowl. Lift each cabbage leaf and distribute some radish mixture between each leaf (about 1 to 11/2 tablespoons). Nestle layered cabbage in bowl of brine as tightly as possible. Put heavy plate atop cabbage, then top with iron skillet to weigh down to submerge cabbage in brine. Set aside at room temperature for 24 hours. Refrigerate kimchi submerged in brine for 24 hours. DO AHEAD: Can be made 3 weeks ahead. Remove weight. Cover and keep refrigerated in brine.",
        "Lift cabbage from brine, allowing excess brine to drip back into bowl. Place on work surface. Cut crosswise into 1-to 2-inch slices and serve.",
        "Available at some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "7 tablespoons coarse kosher salt, divided",
        "1 large head of Napa cabbage, outer leaves discarded, cabbage quartered lengthwise with root ends left intact",
        "1 tablespoon sugar",
        "1 teaspoon fish sauce (such as nam pla or nuoc nam)*",
        "1 Asian pear (about 12 ounces), peeled, cored, cut into matchstick-size strips",
        "1/2 pound daikon (Japanese white radish),* peeled, cut into matchsticksize strips",
        "6 green onions (white and pale green parts only), cut into matchstick-size strips",
        "3 garlic cloves, minced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Low Fat",
        "Low Cal",
        "High Fiber",
        "Chill",
        "Healthy",
        "Low Cholesterol",
        "Asian Pear",
        "Cabbage",
        "Green Onion/Scallion",
        "Fat Free",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "White Kimchi",
    "url": "http://www.epicurious.com/recipes/food/views/white-kimchi-353892"
}
