{
    "directions": [
        "In a bowl soak beans in water to cover by 2 inches overnight or quick-soak (procedure follows) and drain.",
        "In a heavy kettle (at least 5 quarts) simmer ham hocks and wheat berries in water and broth, covered, 1 hour. Add drained beans and bring to a boil. Reduce to a simmer and skim froth. Add onions, carrots, celery, bay leaf, and rosemary and simmer, covered, until beans are tender, about 1 hour.",
        "Transfer ham hocks with a slotted spoon to a cutting board. Discard fat and bones and chop meat.",
        "In a blender or food processor purée 3 cups soup. Stir purée into soup with chopped meat and escarole and simmer, uncovered, 15 minutes. Stir in garlic and salt and pepper to taste. Soup may be made 4 days ahead (cool uncovered before chilling covered.)",
        "In a large saucepan combine dried beans, picked over and rinsed, with triple, their volume of cold water. Bring the water to a boil and cook beans, uncovered, over moderate heat 2 minutes. Remove pan from heat and let beans soak 1 hour."
    ],
    "ingredients": [
        "1 pound dried baby lima beans or other dried white beans, picked over",
        "2 ham hocks",
        "2/3 cup wheat berries*",
        "8 cups water",
        "2 cups chicken broth",
        "2 medium onions, chopped",
        "3 carrots, chopped",
        "3 celery ribs, chopped",
        "1 bay leaf",
        "1 teaspoon dried rosemary, crumbled",
        "1 head escarole (about 1 pound), chopped coarse",
        "3 garlic cloves, minced",
        "*available at natural foods stores and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Onion",
        "Ham",
        "Celery",
        "Lima Bean",
        "Carrot",
        "Winter",
        "Escarole",
        "Gourmet"
    ],
    "title": "White Bean, Wheat Berry, and Escarole Soup",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-wheat-berry-and-escarole-soup-11529"
}
