{
    "directions": [
        "Stir white chocolate in large bowl set over saucepan of barely simmering water until melted and smooth. Remove from heat. Bring milk to simmer in heavy medium saucepan. Whisk milk barely simmering water until melted and smooth. Remove chocolate from heat. Bring milk to simmer in heavy medium saucepan. Whisk milk into chocolate. Let chocolate mixture cool until just beginning to thicken, stirring occasionally, about 1 hour.",
        "Using electric mixer, beat cream and vanilla in another large bowl until medium-firm peaks form. Fold whipped cream into chocolate mixture in 3 additions. Cover and refrigerate.",
        "Preheat oven to 400°F. Line 17x11x1-inch baking sheet with parchment paper. Roll out 1 pastry sheet on lightly floured surface to 15x12-inch rectangle. Cut crosswise into three 12x5-inch rectangles. Repeat rolling and cutting with remaining pastry sheet to make six 12x5-inch pastry rectangles total. Transfer 2 pastry rectangles to prepared baking sheet, spacing evenly. Cover remaining pastry rectangles and chill.",
        "Pierce pastry rectangles on baking sheet all over with fork. Top with second piece of parchment. Place another 17x11x1-inch baking sheet atop parchment to weigh down pastry rectangles as they cook. Bake pastries until edges and bottoms are golden, about 10 minutes. Remove baking sheet and parchment paper from atop pastries. Turn pastries over. Continue baking uncovered until bottoms are golden, about 5 minutes longer. Transfer pastries to rack; cool. Repeat piercing and baking with remaining 4 pastry rectangles in 2 more batches. (White chocolate cream and pad pastry rectangles can be prepared 1 day ahead. Keep cream refrigerated. Store pastry rectangles airtight at room temperature.)",
        "Place 1 pastry rectangle on work surface. Spread 1 1/2 cups of chocolate cream over pastry. Gently toss all berries in large bowl. Arrange of berries in single layer over chocolate cream. Place second pastry rectangle atop berries. Spread 1 cups of chocolate cream atop second pastry rectangle. Top with of berries. Top with third pastry rectangle. Repeat with remaining 3 pastry rectangles, chocolate cream and berries to form second napoleon. (Can be made 4 hours ahead. Refrigerate.) Using serrated knife, cut each pastry crosswise into 10 equal pieces. Sprinkle powdered sugar over each and serve."
    ],
    "ingredients": [
        "12 ounces good-quality white chocolate (such as Lindt or Bakers), chopped",
        "1/2 cup whole milk",
        "2 cups chilled whipping cream",
        "1 teaspoon vanilla extract",
        "1 17-ounce package frozen puff pastry (2 sheets), thawed",
        "2 5- to 6-ounce baskets blackberries",
        "2 8-ounce baskets strawberries, hulled, halved",
        "2 6-ounce baskets blueberries",
        "2 6-ounce baskets raspberries",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate and Summer Berry Napoleons",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-summer-berry-napoleons-4071"
}
