{
    "directions": [
        "Preheat oven to 450°F. Place a well-seasoned 8\"-10\" cast-iron skillet in oven.",
        "Pierce potatoes in several spots with a fork. Microwave sweet potatoes on high for 5 minutes. (Alternatively, wrap sweet potatoes in foil and bake at 450°F until tender around edges but still hard in center, 30-35 minutes.) Transfer potatoes to a large bowl and cover with plastic wrap. Let sit for 5 minutes.",
        "Whisk mirin, honey, vinegar, and salt in a medium bowl. Peel sweet potatoes and cut crosswise into 1\"-1 1/2\"-thick rounds. Add to mirin mixture; toss to coat.",
        "Using oven mitts, carefully remove heated skillet from oven; add oil and swirl pan to coat. Add sweet potatoes and mirin mixture to skillet, arranging potatoes cut side down. Bake until sweet potatoes are caramelized on one side, 15-20 minutes. Turn sweet potatoes, rotating them around pan to avoid hot spots, and cook until tender and caramelized, 5-7 minutes longer.",
        "Transfer sweet potatoes to a platter. Add 2 tablespoons water to skillet, scraping up browned bits. Add butter, swirling pan to melt and combine. Pour sauce over sweet potatoes. Season with salt."
    ],
    "ingredients": [
        "2 large white sweet potatoes (about 2 pounds total)",
        "1/2 cup mirin (sweet Japanese rice wine)",
        "2 tablespoons honey",
        "1 tablespoon distilled white vinegar",
        "1/2 teaspoon kosher salt",
        "2 teaspoons corn oil",
        "2 tablespoons unsalted butter",
        "Coarse sea salt (preferably Maldon)",
        "Ingredient info: Mirin is available in the Asian foods section of some supermarkets and at Japanese markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Vegetarian",
        "Sweet Potato/Yam",
        "Winter",
        "Healthy",
        "Honey",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Sweet Potatoes with Mirin and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/white-sweet-potatoes-with-mirin-and-honey-388730"
}
