{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Spray 2 9-inch round cake pans with cooking spray.",
        "Mix white cake mix, flour, eggs, sugar, canola oil, 1 teaspoon vanilla extract, baking powder, and milk in a large bowl until thoroughly combined. Pour batter into prepared cake pans.",
        "Bake in preheated oven until the cakes are lightly browned and a toothpick inserted into the center of the cakes comes out clean, 40 to 50 minutes. Let cakes cool about 10 minutes in pans before removing to finish cooling on racks.",
        "Whisk evaporated milk, sweetened condensed milk, 6 tablespoons cream, 1/2 teaspoon vanilla extract, and coconut extract in a bowl until smooth. Refrigerate the tres leches mixture.",
        "Beat 2 cups cream with instant vanilla pudding mix in a separate mixing bowl with an electric mixer until soft peaks form, 3 to 5 minutes. Refrigerate mousse filling.",
        "With a long serrated knife, lightly cut off a thin layer of each cake top to level the cake. Place cakes, leveled sides up, on pieces of waxed paper. Poke holes all over the cakes with a skewer. Slowly pour the tres leches mixture over the cakes, about 1/2 cup at a time, waiting until the mixture has soaked in before continuing to pour on more milk mixture. Wrap cake layers in plastic wrap; refrigerate until chilled, at least 4 hours.",
        "Unwrap a cake layer and place onto a serving platter with leveled side up. Top the cake with mousse filling; gently place second cake layer over the filling with leveled side down. Refrigerate leftovers."
    ],
    "ingredients": [
        "cooking spray with flour",
        "1 (18.25 ounce) package white cake mix",
        "1 1/2 cups all-purpose flour",
        "5 large eggs",
        "1 cup white sugar",
        "2/3 cup canola oil",
        "1 teaspoon vanilla extract",
        "1 teaspoon baking powder",
        "1 cup milk",
        "2 (5 ounce) cans evaporated milk",
        "1 (10 ounce) can sweetened condensed milk",
        "6 tablespoons heavy whipping cream",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon coconut extract",
        "2 cups heavy whipping cream",
        "1 (3.5 ounce) package instant vanilla pudding mix"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "White Tres Leches Cake",
    "url": "http://allrecipes.com/recipe/221905/white-tres-leches-cake/"
}
