{
    "directions": [
        "Preheat oven to 350°F. Butter 9-inch-diameter cake pan with 2-inch-high sides. Line bottom of pan with waxed paper. Dust with flour. Using electric mixer, beat eggs and sugar in large bowl until thick, about 5 minutes. Sift flour, cocoa powder and baking powder over egg mixture; gently fold together. Pour batter into pan. Bake until tester inserted into center of cake comes out clean, about 25 minutes. Turn out onto rack; peel off paper. Cool.",
        "Whisk 3 tablespoons cream and white chocolate in heavy small saucepan over very low heat until smooth. Remove from heat. Repeat with 3 tablespoons cream and milk chocolate. Cool.",
        "Beat 10 tablespoons cream in large bowl until stiff peaks form. Fold half of whipped cream into each chocolate mixture. Chill 15 minutes.",
        "Mix juice and liqueur in small bowl. Cut cake into 3 equal layers. Transfer 1 layer to platter, cut side up. Brush top with 2 tablespoons orange mixture. Spread milk chocolate mousse over. Repeat layering with 1 cake layer, remaining orange mixture and white chocolate mousse. Top with third cake layer, cut side down. Cover; chill until set, at least 4 hours.",
        "Whisk 1/3 cup cream, bittersweet chocolate, water and espresso powder in heavy medium saucepan over low heat until smooth. Drizzle over cake; smooth over tops and sides. Chill until set, about 30 minutes. (Can be made 1 day ahead. Let stand 1 hour before serving.)"
    ],
    "ingredients": [
        "4 large eggs",
        "1/2 cup sugar",
        "1/2 cup self-rising flour",
        "1 tablespoon unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "16 tablespoons plus 1/3 cup chilled whipping cream",
        "4 ounces white chocolate, chopped",
        "4 ounces milk chocolate, chopped",
        "2 tablespoons orange juice",
        "2 tablespoons orange liqueur",
        "9 ounces bittersweet (not unsweetened) chocolate, chopped",
        "2 tablespoons water",
        "2 teaspoons instant espresso powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Oscars",
        "Mother's Day",
        "Orange",
        "Fall",
        "Birthday",
        "Chill",
        "Party"
    ],
    "title": "White and Milk Chocolate Mousse Cake",
    "url": "http://www.epicurious.com/recipes/food/views/white-and-milk-chocolate-mousse-cake-4804"
}
