{
    "directions": [
        "In a small bowl let the anchovy fillets soak in 2 tablespoons of the milk for 10 minutes, drain them, and pat them dry. In another small bowl let the bread soak in the remaining 6 tablespoons milk for 10 minutes and squeeze out the excess milk. In a food processor fitted with the steel blade or in a blender purée the olives, the anchovies, the bread, the hard-boiled egg yolks, the capers, the lemon juice, the garlic and the mustard, with the motor running add the oil in a stream, and blend the mixture until it is smooth. Transfer the mixture to a small bowl and chill it, covered, for at least 2 hours or up to 1 week.",
        "Scoop out a trough from the cut side of each radish half with a 1/2-inch melon-ball cutter, dropping the radishes as they are cut into a bowl or ice water, transfer the radishes cut side down to paper towels, and let them drain for 5 minutes. Invert the radishes, transfer the tapenade to a pastry bag fitted with a small star tip, and pipe it into the radishes. (The radish boats may be prepared up to 2 hours ahead and kept chilled, covered loosely.) Arrange the hors d'oeuvres decoratively on a platter."
    ],
    "ingredients": [
        "6 flat anchovy fillets, rinsed and drained",
        "1/2 cup milk",
        "2 slices homemade-type white bread, torn into pieces",
        "1 cup Kalamata oives or other brine-cured black olives, pitted and chopped",
        "the yolks from 2 hard-boiled large eggs",
        "2 tablespoons drained capers",
        "2 tablespoons fresh lemon juice",
        "1 small garlic clove, minced",
        "1 teaspoon Dijon-style mustard",
        "2 tablespoons olive oil",
        "25 white icicle radishes, peeled and halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Vegetable",
        "Cocktail Party",
        "Radish",
        "Summer",
        "Engagement Party",
        "Gourmet"
    ],
    "title": "White Radish Boats with Tapenade",
    "url": "http://www.epicurious.com/recipes/food/views/white-radish-boats-with-tapenade-101556"
}
