{
    "directions": [
        "Line baking sheet with foil. Stir chocolate and shortening in top of double boiler set over simmering water until melted and smooth. Pour onto prepared baking sheet, tilting pan to spread chocolate mixture to irregular 14x9-inch rectangle. Refrigerate until just firm, about 12 minutes. Spray assorted star-shaped cookie cutters with nonstick spray. Cut out stars. Refrigerate until firm, about 30 minutes. Using small offset spatula, carefully transfer stars 1 at a time to another foil-lined baking sheet. Refrigerate until ready to use. (Can be made 3 days ahead. Cover and keep refrigerated.)",
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with parchment paper; butter parchment. Stir unsweetened chocolate in heavy medium saucepan over low heat until melted and smooth. Cool slightly. Sift flour, cocoa powder, baking powder, baking soda, and salt into medium bowl. Using electric mixer, beat sugar and butter in large bowl until well blended. Beat in lukewarm melted unsweetened chocolate and vanilla. Beat in eggs, 1 at a time, blending well after each addition. Mix in cocoa powder mixture in 3 additions, alternating with milk in 2 additions.",
        "Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 35 minutes. Cool cakes in pans on racks 10 minutes. Run knife around edge of each pan to loosen cakes. Turn cakes out onto racks and cool completely. Peel off parchment.",
        "Bring 1 cup cream and butter to simmer in heavy medium saucepan over medium heat, stirring until butter melts. Remove from heat. Add white chocolate and stir until smooth. Whisk in vanilla. Pour 1 1/2 cups white chocolate filling into small bowl; cover and freeze until cold, about 2 hours.",
        "Let remaining white chocolate mixture in saucepan stand at room temperature until lukewarm, about 20 minutes.",
        "Using electric mixer, beat remaining 2 cups cream and almond extract in large bowl until peaks form. Working in 3 batches, fold in lukewarm white chocolate mixture. Refrigerate whipped cream frosting just until medium peaks hold, folding occasionally, about 3 hours.",
        "Brush 2 tablespoons amaretto over top of each cake layer. Place 1 layer on platter. Spread chilled 1 1/2 cups white chocolate filling over. Top with second cake layer. Spread whipped cream frosting over top and sides of cake. Chill until cold and set, about 1 hour. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Arrange chocolate stars decoratively atop cake and serve."
    ],
    "ingredients": [
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon solid vegetable shortening",
        "Nonstick vegetable oil spray",
        "4 ounces unsweetened chocolate, chopped",
        "1 3/4 cups all purpose flour",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 cups sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 teaspoons vanilla extract",
        "2 large eggs",
        "1 1/2 cups whole milk",
        "3 cups chilled whipping cream",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
        "1 pound good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon almond extract",
        "4 tablespoons amaretto or other almond liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Christmas",
        "Vanilla",
        "Amaretto",
        "Winter",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate Truffle and Chocolate Fudge Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-truffle-and-chocolate-fudge-layer-cake-107459"
}
