{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high-sides.",
        "Bring half and half to simmer in small saucepan. Remove from heat. Add chocolate and vanilla and stir until smooth; cool to room temperature.",
        "Finely grind pistachios with flour and baking powder in processor. Using electric mixer, beat butter and 3/4 cup sugar in large bowl until fluffy. Add yolks 1 at a time, beating well after each addition. Beat in flour mixture alternately with white chocolate mixture in 2 additions each. Using clean dry beaters, beat egg whites in medium bowl until soft peaks form. Gradually add remaining 1/4 cup sugar, beating until stiff but not dry. Fold whites into batter in 2 additions.",
        "Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool 10 minutes. Cut around pan sides to loosen cakes. Turn out cakes onto racks; cool completely.",
        "Hull and slice 2 baskets strawberries. Place 1 cake layer on platter. Spread 1 cup buttercream over. Arrange enough berry slices over to cover. Spread 1 cup buttercream over. Arrange another layer of sliced berries over to cover. Spread thin layer of buttercream over second cake layer and place cake, buttercream side down, atop berries. Press gently to adhere. Spread remaining buttercream over top and sides of cake. Chill cake until buttercream is firm, about 1 hour.",
        "Knead marzipan in medium bowl to soften. Shape marzipan into disk. Dust work surface with 2 tablespoons powdered sugar. Roll out marzipan disk on powdered sugar to 9 1/2-round. Place on cake; press to adhere to top and gently press overhang onto sides of cake.",
        "Beat whipping cream and remaining 1/4 cup powdered sugar in large bowl to firm peaks. Transfer to large pastry bag fitted with medium star tip. Pipe cream in side-by-side columns up sides of cake. Pipe border of rosettes around top edge of cake. Refrigerate cake until cold, at least 2 hours. (Can be prepared 1 day ahead. Cover with cake dome and keep refrigerated. Let stand at room temperature 30 minutes before continuing.)",
        "Arrange remaining whole strawberries in center of cake.",
        "Bring half and half and pistachios to boil in heavy small saucepan. Remove from heat; cover and let stand 1 hour. Whisk sugar, yolks and flour in medium bowl to blend. Bring half and half mixture to simmer; gradually whisk into yolk mixture. Return to same saucepan; stir over medium heat until mixture bubbles thickly, about 5 minutes. Mix in vanilla. Transfer to processor; blend until nuts are very finely chopped. Transfer pistachio pastry cream to bowl. Cover and cool to room temperature, about 2 hours.",
        "Using electric mixer, beat unsalted butter in large bowl until fluffy. Add pastry cream by 1/4 cupfuls, beating well after each addition. (Can be prepared 2 days ahead. Cover and refrigerate. Bring to room temperature before using.)"
    ],
    "ingredients": [
        "3/4 cup half and half",
        "3 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "2 teaspoons vanilla extract",
        "1/2 cup unsalted pistachio nuts",
        "1 1/4 cups all purpose flour",
        "1 teaspoon baking powder",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1 cup sugar",
        "3 large egg yolks",
        "5 large egg whites",
        "3 1-pint baskets strawberries",
        "1 7-ounce package marzipan",
        "2 tablespoons plus 1/4 cup powdered sugar",
        "1 1/2 cups chilled whipping cream",
        "Makes about 3 cups",
        "1 1/4 cups half and half",
        "3/4 cup unsalted pistachio nuts",
        "1/2 cup sugar",
        "4 large egg yolks",
        "2 tablespoons all purpose flour",
        "1 teaspoon vanilla extract",
        "1 cup (2 sticks) unsalted butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Easter",
        "Strawberry",
        "Pistachio",
        "Spring",
        "Summer",
        "Birthday",
        "Party"
    ],
    "title": "White Chocolate Easter Cake with Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-easter-cake-with-strawberries-449"
}
