{
    "directions": [
        "Combine white and brown sugar and water in a saucepan over medium-high heat. Stir occasionally to dissolve the sugar completely, but stop stirring once the mixture comes to a boil to prevent the sugar from crystallizing.",
        "Swirl the pan gently to redistribute the caramel as the sugar begins to darken. Cook to about 310 degrees F (160 degrees C), or until the sugar turns light golden brown. Remove from heat immediately, as sugar will continue to darken.",
        "Pour the caramel in an 8-inch baking dish, coating the bottom and sides of the dish. Let caramel harden, about 5 minutes.",
        "Preheat an oven to 325 degrees F (165 degrees C).",
        "Melt the white chocolate in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave).  Do not overheat or chocolate will scorch.",
        "Cream together the cream cheese, mascarpone cheese, evaporated milk, sweetened condensed milk, eggs, and melted white chocolate in a bowl until smooth.",
        "Pour the cream cheese mixture over the hardened caramel.",
        "Place baking dish in a large roasting pan. Fill the roasting pan with about 1-inch water.",
        "Bake in the preheated oven until a knife inserted into the center comes out clean, about 1 hour.",
        "Refrigerate until completely chilled, 5 to 6 hours. To serve, run a paring knife along the edges of the baking dish to loosen the flan. Cover the baking dish with a plate, and invert it to tip the flan out of the pan and onto the plate."
    ],
    "ingredients": [
        "1 cup white sugar",
        "2 tablespoons brown sugar",
        "2 tablespoons water",
        "1 (12 ounce) package white chocolate chips",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) container mascarpone cheese",
        "1 (12 fluid ounce) can evaporated milk",
        "1 (14 ounce) can sweetened condensed milk",
        "3 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "White Chocolate Flan",
    "url": "http://allrecipes.com/recipe/220155/white-chocolate-flan/"
}
