{
    "directions": [
        "Place beans in large pot. Add enough cold water to cover beans by 3 inches; let stand overnight. Drain.",
        "Return beans to same pot. Add 8 cups water; onion and bay leaves. Bring to boil. Reduce heat; cover and simmer until beans are tender, stirring occasionally, about 1 hour. Reserve 1 cup cooking liquid. Drain beans; transfer to baking pan. Discard onion and bay leaves.",
        "Meanwhile, combine oil and lemon slices in heavy medium saucepan. Simmer over low heat until lemon slices are translucent, about 5 minutes. Let cool uncovered 30 minutes. Strain lemon oil into bowl. Transfer 4 lemon slices to plate; cut in half and reserve (discard remaining lemon slices). (Beans, cooking liquid, lemon oil and lemons can be prepared 1 day ahead. Chill separately.)",
        "Heat 4 tablespoons lemon oil in heavy large pot over medium-high heat. Add mushrooms and sauté until brown and tender, about 5 minutes. Add beans, 1 cup reserved cooking liquid, remaining lemon oil, herbs and lemon juice to mushrooms. Simmer over medium heat 5 minutes to blend flavors. Cool completely.",
        "Stir chopped tomatoes and grated Parmesan cheese into bean mixture season to taste with salt and pepper. Spoon bean mixture onto platter. Garnish with halved lemon slices."
    ],
    "ingredients": [
        "2 cups dried Great Northern beans (about 13 ounces)",
        "8 cups water",
        "1 onion, cut into 8 wedges",
        "3 bay leaves",
        "1/2 cup extra-virgin olive oil",
        "12 1/4-inch-thick lemon slices",
        "8 ounces fresh shiitake mushrooms, stemmed, caps sliced",
        "3 tablespoons chopped fresh parsley",
        "3 tablespoons chopped fresh thyme or 1 tablespoon dried",
        "3 tablespoons chopped chives or green onions",
        "3 tablespoons fresh lemon juice",
        "2 cups chopped seeded tomatoes",
        "1/2 cup grated Parmesan cheese (about 1 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Herb",
        "Mushroom",
        "Tomato",
        "Side",
        "Vegetarian",
        "Buffet",
        "Parmesan",
        "Lemon",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "White Bean Ragoût with Lemon Oil and Shiitake Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-ragout-with-lemon-oil-and-shiitake-mushrooms-5848"
}
