{
    "directions": [
        "Preheat oven to 400°F. Spray rimmed baking sheet with oil spray. Arrange carrots, tomatoes, onion, squash and garlic on sheet. Drizzle with oil. Sprinkle with salt and pepper. Toss to coat. Bake until vegetables are brown and tender, stirring occasionally, about 45 minutes.",
        "Transfer carrots and squash to work surface. Cut into 1/2-inch pieces; set aside. Peel garlic cloves; place in processor. Add tomatoes and onion; puree until almost smooth. Pour 1/2 cup broth onto baking sheet; scrape up any browned bits. Transfer broth and vegetable puree to large pot. Add 5 1/2 cups broth, kale, thyme and bay leaf to pot; bring to boil. Reduce heat; simmer uncovered until kale is tender, about 30 minutes.",
        "Add beans and reserved carrots and squash to soup. Simmer 8 minutes to blend flavors, adding more broth to thin soup if necessary. Season with salt and pepper. Discard thyme sprigs and bay leaf. (Can be made 1 day ahead. Cover and chill. Bring to simmer before serving.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3 medium carrots, peeled, quartered lengthwise",
        "2 large tomatoes, quartered",
        "1 large onion, cut into 8 wedges",
        "1/2 small butternut squash, peeled, seeded, cut lengthwise into 1/2-inch-thick wedges",
        "6 garlic cloves, unpeeled",
        "1 tablespoon olive oil",
        "6 cups (or more) canned vegetable broth",
        "4 cups finely chopped kale",
        "3 large fresh thyme sprigs",
        "1 bay leaf",
        "1 15-ounce can Great Northern beans, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Vegetable",
        "Roast",
        "Vegetarian",
        "High Fiber",
        "Winter",
        "Healthy"
    ],
    "title": "White Bean, Kale and Roasted Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-kale-and-roasted-vegetable-soup-102844"
}
