{
    "directions": [
        "In a saucepan melt butter over moderately low heat. Stir in flour and cook roux, stirring, 3 minutes. Add milk in a stream and bring mixture to a boil, whisking until thick and smooth. Add salt and pepper to taste and simmer sauce over low heat, whisking occasionally, 10 to 12 minutes, or until thickened. Transfer sauce to a bowl and cover surface with a buttered round of wax paper.",
        "Into a small bowl crumble oregano, rosemary, marjoram, and thyme. Thinly slice mushrooms. Discard coarse stems from spinach and coarsely chop spinach. Cut chicken into 1/2-inch strips. In a large skillet melt butter over moderate heat and cook chicken, 1 1/2 teaspoons garlic, and half of herb mixture, stirring occasionally, 5 minutes, or until chicken is cooked through. Transfer chicken with a slotted spoon to a large bowl.",
        "Add wine to skillet and bring mixture to a boil, stirring. Add mushrooms and spinach and cook, covered, until spinach is wilted. Add remaining 1 1/2 teaspoons garlic, remaining herb mixture, Tabasco, and salt and pepper to taste and cook, uncovered, stirring occasionally, until liquid given off by mushrooms is evaporated. Transfer mushroom mixture to chicken and stir until combined well. Reserving 1 cup sauce, add remaining sauce with salt and pepper to taste to chicken mixture and stir until combined well.",
        "Preheat oven to 350°F. and butter a 13 x 9-inch baking dish (3-quart).",
        "In a bowl whisk together ricotta, egg, basil, and salt and pepper to taste. Pour 1/2 cup reserved sauce into baking dish (sauce will not cover bottom completely) and cover with 3 pasta sheets, making sure they do not touch each other. Spread half of chicken mixture over pasta sheets in dish and top with another 3 pasta sheets. Spread half of ricotta mixture over pasta and top with another 3 pasta sheets.",
        "Continue layering lasagne in same manner with remaining chicken mixture, pasta sheets, and ricotta mixture, ending with pasta. Spread remaining ‚ cup sauce over top and sprinkle with Parmesan. Lasagne may be made 1 day ahead and chilled, covered. Bake lasagne in middle of oven 45 minutes, or until bubbling and golden."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter",
        "1/2 cup all-purpose flour",
        "4 cups milk",
        "1 teaspoon dried oregano",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon dried marjoram",
        "1/2 teaspoon dried thyme",
        "1/2 pound white mushrooms",
        "3/4 pound fresh spinach",
        "5 whole boneless skinless chicken breasts (about 2 1/2 pounds total)",
        "3 tablespoons unsalted butter",
        "1 tablespoon minced garlic",
        "2 tablespoons dry white wine",
        "1 teaspoon Tabasco",
        "a 15-ounce container whole-milk ricotta (about 1 3/4 cups)",
        "1 large egg",
        "1 1/2 teaspoons dried basil",
        "fifteen 7 x 3 1/2-inch sheets dry no-boil lasagne pasta",
        "1/2 cup freshly grated Parmesan (about 1 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Chicken",
        "Dairy",
        "Leafy Green",
        "Herb",
        "Mushroom",
        "Pasta",
        "Poultry",
        "Vegetable",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Parmesan",
        "Ricotta",
        "Spinach",
        "Fall",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "White Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/white-lasagne-100760"
}
