{
    "directions": [
        "Make crust: Finely grind almonds and crumbs in a food processor and add butter, blending until combined. Press over bottom and 2/3 up side of a 10-inch springform pan.",
        "Make filling: Preheat oven to 350 degrees F.",
        "Melt chocolate in a double boiler or a large metal bowl set over a saucepan of barely simmering water, stirring until smooth, and remove from heat.",
        "Beat cream cheese with an electric mixer at medium speed until fluffy, then beat in sugar. Add whole eggs and yolks, 1 at a time, beating well at low speed and scraping down bowl after each addition.",
        "Beat in flour and vanilla until just combined, then add melted chocolate in a slow stream, beating until filling is well combined.",
        "Arrange berries in 1 layer over crust and pour filling into crust. Bake in middle of oven until cake is set 3 inches from edge but center is still wobbly when pan is gently shaken, 45 to 55 minutes.",
        "Run a thin knife around edge of cake to loosen, then cool completely in pan on a rack. (Cake will continue to set as it cools.) Serve at room temperature or chilled."
    ],
    "ingredients": [
        "1 cup slivered almonds",
        "2 cups graham cracker crumbs (7 ounces)",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "8 ounces fine-quality white chocolate",
        "4 (8-ounce) packages cream cheese, softened",
        "1/2 cup plus 2 tablespoons sugar",
        "4 whole large eggs",
        "2 large egg yolks",
        "2 tablespoons all-purpose flour",
        "1 teaspoon vanilla",
        "2 cups fresh raspberries (11 ounces)",
        "Garnish: Fresh raspberries, mint sprigs and raspberry coulis"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Mixer Recipes",
        "Egg Recipes",
        "Fruit",
        "Chocolate",
        "White Chocolate",
        "Nut Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Raspberry Recipes",
        "Dairy Recipes"
    ],
    "title": "White Chocolate Raspberry Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/white-chocolate-raspberry-cheesecake-recipe1"
}
