{
    "directions": [
        "To Make Crunch: In a food processor, combine nuts, flour and 1/4 cup sugar. Mix in 3 tablespoons butter until dough forms large crumbs; do not let the dough come together in a ball.",
        "Press the crunch into the bottom and up the sides of a 9 inch pie pan. Freeze until crust is firm.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake crust for 25 minutes, or until it is lightly browned and set. Let cool on a wire rack. Leave oven on at 350 degrees F (175 degrees C).",
        "To Make White Chocolate Coating: In a small bowl, mix together 8 tablespoons butter and white chocolate. Place bowl over simmering water, stirring constantly until chocolate and butter are smooth. Pour mixture evenly into crust. Freeze until firm.",
        "To Make Key Lime Endeavor: In a medium bowl, whisk together the egg yolks, condensed milk and lime peel. Gradually stir in lime juice. Pour mixture into chilled crust.",
        "Bake in preheated 350 degrees F (175 degrees C) oven for 20 minutes. Let pie cool completely on a wire rack. Then cover and refrigerate for about 2 hours, or until chilled.",
        "In a chilled mixing bowl, whip the heavy cream with 1 tablespoon sugar until stiff peaks form. Spoon or pipe the whipped cream on top of pie before serving."
    ],
    "ingredients": [
        "1/2 cup finely chopped macadamia nuts",
        "1/2 cup unbleached all-purpose flour",
        "1/4 cup white sugar",
        "3 tablespoons unsalted butter, chilled and cubed",
        "8 tablespoons unsalted butter, cubed",
        "4 ounces white chocolate",
        "4 egg yolks, beaten",
        "1 (14 ounce) can sweetened condensed milk",
        "1/2 teaspoon grated lime peel",
        "5/8 cup key lime juice",
        "1 cup heavy cream, chilled",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "White Chocolate Key Lime Endeavor with Macadamia Crunch",
    "url": "http://allrecipes.com/recipe/19465/white-chocolate-key-lime-endeavor-wit/"
}
