{
    "directions": [
        "Line bottom of 9x5x3-inch loaf pan (with 7-to 8-cup capacity) with aluminum foil, extending foil over shorter ends. Puree strawberries in processor. Transfer 1 1/4 cups puree to small bowl; reserve remaining puree for another use. Stir white chocolate in top of double boiler set over barely simmering water until melted. Remove pan from over water.",
        "Combine sugar, water and corn syrup in heavy small saucepan. Stir over low heat until sugar dissolves. Increase heat; boil until candy thermometer registers 250°F, tilting pan if necessary to submerge bulb of thermometer and occasionally brushing down sides of pan with wet pastry brush, about 4 minutes.",
        "Meanwhile, using electric mixer, beat egg whites and cream of tartar in large bowl until soft peaks form.",
        "Gradually add boiling syrup to whites, beating until firm peaks form and meringue is cool, about 5 minutes. Fold white chocolate into meringue.",
        "Beat cream and vanilla in large bowl until medium-firm peaks form; fold into white chocolate mixture. Transfer 4 cups white chocolate mousse to medium bowl. Fold 1 1/4 cups strawberry puree and Grand Marnier into 4 cups mousse.",
        "Spread half of strawberry mousse in prepared pan. Chill remaining white chocolate mousse and remaining white chocolate mousse and remaining strawberry mousse. Freeze strawberry layer until almost firm , about 15 minutes.",
        "Spread white chocolate mousse over strawberry layer. Freeze until almost firm, about 25 minutes.",
        "Spread remaining berry mousse over white chocolate layer. Cover terrine with plastic and freeze overnight. (Can be prepared 4 days ahead. Keep frozen.)",
        "Uncover terrine. Cut between foil and pan side to loosen terrine. Invert onto platter. Lift off pan and peel off foil. Serve with Dark Chocolate Sauce.",
        "Combine half and half, sugar, cocoa, butter and espresso powder in heavy small saucepan. Whisk over low heat until sugar dissolves and butter melts. Increase heat to medium and whisk until sauce just begins to simmer. Remove from heat. Mix in vanilla. Cool sauce."
    ],
    "ingredients": [
        "2 3/4 cups frozen unsweetened strawberries, thawed, drained",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "3/4 cup sugar",
        "1/3 cup water",
        "1 tablespoon light corn syrup",
        "4 large eggs white",
        "1/2 teaspoon cream of tartar",
        "1 1/2 cups chilled whipping cream",
        "1 teaspoon vanilla extract",
        "1 tablespoon Grand Marnier",
        "1 cup half and half",
        "1/2 cup sugar",
        "1/4 cup unsweetened cocoa powder",
        "3 tablespoons unsalted butter",
        "1 teaspoon instant espresso powder",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Chocolate",
        "Dessert",
        "Strawberry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate and Strawberry Terrine with Dark Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-strawberry-terrine-with-dark-chocolate-sauce-1287"
}
