{
    "directions": [
        "Preheat the oven to 300ºF.",
        "In a large bowl, mix together the tomatoes, broth, wine, salt, and pepper.",
        "In a large enameled Dutch oven (with a tight-fitting lid), heat the oil over medium heat. Place the meat in the pan to sear, 2 to 3 minutes on each side, or until it is evenly browned.",
        "Remove the meat and set aside. Line the bottom of the Dutch oven with onion slices. Place the brisket on top of the onion and pour the tomato mixture over the meat, making sure that the liquid covers the meat entirely. If you are using a larger pot and the liquid does not cover the meat and vegetables, add water until it does. Add the thyme sprigs.",
        "Cover and place in the oven for 3 1/2 hours, checking every hour or so to make sure the liquid is still covering the meat. If at any point it isn’t, pour hot water into the Dutch oven to make sure the meat remains covered. After 3 1/2 hours, add the butternut squash, making sure to submerge it under the liquid. Cook for 1 hour more, then remove the pot from the oven. Let sit at least 45 minutes before slicing.",
        "Brisket tastes even better the next day, reheated in the oven. To serve, scoop out about 3 cups of liquid from the Dutch oven and place in a small saucepot. Cook over medium-low heat until it has reduced into a sauce. Serve the brisket and squash on a platter, with the sauce ladled over the top, and garnish with fresh herbs."
    ],
    "ingredients": [
        "1 1/2 cups canned diced tomatoes",
        "4 cups beef, chicken, or vegetable broth, store-bought or homemade",
        "1 (750-mL) bottle white wine (Pinot Grigio, Sauvignon Blanc, etc.)",
        "1 tablespoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 tablespoon vegetable oil",
        "2 1/2 pounds second cut brisket (also called deckle)",
        "1 large onion, sliced",
        "Handful of fresh thyme sprigs",
        "1 large butternut squash, peeled, seeded, and chopped into large chunks",
        "Chopped fresh herbs, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Brisket",
        "Wine",
        "Braise",
        "Dinner",
        "Passover",
        "Butternut Squash",
        "Beef",
        "Hanukkah"
    ],
    "title": "Wine-Braised Brisket With Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/white-wine-braised-brisket-butternut-squash-gefilte-manifesto-recipe"
}
