{
    "directions": [
        "Have ready a bowl of ice and cold water. In a saucepan of boiling water blanch chives 10 seconds and drain in a sieve. Immediately plunge chives into ice water to stop cooking. Remove chives from ice water, squeezing out excess water, and drain on paper towels. Chop chives and in a blender purée with oil until smooth. Transfer chive oil to a bowl. Chill oil, covered, at least 8 hours and up to 1 day. Pour oil through a fine sieve into a small bowl, pressing hard on solids.",
        "Thinly slice onions and in a 5-quart heavy kettle combine with broth and wine. Bring mixture to a boil and skim foam. Add thyme and simmer, uncovered, until onions are very tender, 45 to 50 minutes. Cool mixture 10 minutes.",
        "In a blender purée mixture in batches with butter until smooth (use caution when blending hot liquids), transferring to a bowl. In kettle stir together purée, sugar, vinegar, pepper, and salt to taste and heat over moderate heat, stirring, until heated through. Soup may be made 2 days ahead and cooled, uncovered, before chilling, covered. Reheat soup before serving. With a vegetable peeler shave enough thin slices from Parmigiano-Reggiano to measure about 1/2 cup. Serve soup drizzled with chive oil and topped with Parmigiano-Reggiano."
    ],
    "ingredients": [
        "1 bunch fresh chives",
        "1/2 cup extra-virgin olive oil",
        "2 pounds white onions (about 2 medium-large)",
        "4 cups chicken broth (32 fluid ounces)",
        "1/2 cup dry white wine",
        "1 tablespoon fresh thyme leaves",
        "1 tablespoon unsalted butter",
        "1 teaspoon sugar",
        "1/2 teaspoon white-wine vinegar",
        "freshly ground white pepper to taste",
        "a small wedge Parmigiano-Reggiano (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Herb",
        "Onion",
        "Vegetable",
        "Lunch",
        "Parmesan",
        "Spring",
        "Gourmet"
    ],
    "title": "White Onion Soup with Chive Oil",
    "url": "http://www.epicurious.com/recipes/food/views/white-onion-soup-with-chive-oil-15102"
}
