{
    "directions": [
        "Preheat the oven to 350 degrees F. Using a pencil, draw an 8-by-10-inch rectangle on a piece of parchment paper. Turn the parchment paper over so the pencil mark doesn't get onto the chocolate and place it on a sheet pan.",
        "Place the pistachios in one layer on another sheet pan and bake for 8 minutes. Set aside to cool.",
        "Place three quarters of the white chocolate in a heat-proof glass bowl and put it in the microwave on high for 30 seconds. (Time it with your watch for accuracy.) Stir the chocolate with a rubber spatula, return it to the microwave for another 30 seconds, then stir again. Continue to heat and stir in 30-second intervals until the chocolate is just melted. Immediately stir in the remaining chocolate and allow it to sit at room temperature, stirring often, until it's completely smooth. (If you need to heat it a little more, place it in the microwave for another 15 seconds.)",
        "Pour the melted chocolate onto the parchment paper and spread it lightly to fill the drawn rectangle. Sprinkle the top evenly with the cooled pistachios, the cranberries, and apricots. Press the nuts and fruit lightly so they will set in the chocolate. Set aside for at least 2 hours until firm or refrigerate for 20 minutes. Cut or break the bark in 16 pieces and serve at room temperature."
    ],
    "ingredients": [
        "1/2 cup whole shelled salted pistachios",
        "16 ounces good white chocolate, finely chopped",
        "1/4 cup dried cranberries",
        "1/4 cup medium-diced dried apricots"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Candy Recipes and Ideas",
        "Nut Recipes",
        "Fruit",
        "Chocolate",
        "White Chocolate",
        "Holiday",
        "Recipes for Parties",
        "Microwave Recipes"
    ],
    "title": "White Chocolate Bark",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/white-chocolate-bark0"
}
