{
    "directions": [
        "Prepare a grill for indirect grilling over medium-high heat. Preheat a grill-top pizza stone for at least 30 minutes, until the thermometer on the stone registers 500°F.",
        "In a small fry pan over medium-low heat, warm the olive oil. Add the garlic and cook until it just begins to sizzle, 2 to 3 minutes. Transfer the garlic oil to a bowl.",
        "In a small bowl, combine the semolina flour, salt and pepper. Dust a pizza peel with 1 to 2 Tbs. of the semolina mixture. Using your hands, stretch out half of the pizza dough into a 10- to 12-inch round and lay the dough on the peel. Spread 1 to 2 Tbs. of the garlic oil over the dough, leaving a 1/2-inch border. Sprinkle with half of the rosemary, parsley, cheese, pancetta and clams.",
        "Carefully slide the pizza onto the preheated pizza stone, cover the grill and cook for 5 to 7 minutes. Uncover the grill and turn the pizza 180 degrees. Cover the grill and continue cooking until the crust is golden, 5 to 7 minutes more. Using the pizza peel, transfer the pizza to a cutting board and cover with aluminum foil. Repeat to make the second pizza. Cut the pizzas into slices and serve immediately. Serves 4 to 6."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "4 garlic cloves, thinly sliced",
        "3 Tbs. semolina flour",
        "1/2 tsp. salt",
        "1/4 tsp. freshly ground pepper",
        "1 batch Thin Crust Pizza Dough",
        "1 tsp. finely chopped fresh rosemary",
        "2 tsp. finely chopped fresh flat-leaf parsley",
        "8 oz. fresh mozzarella, sliced 1/4 inch thick",
        "4 oz. pancetta, cooked and broken into pieces",
        "2 to 2 1/2 lb. littleneck or steamer clams,  shucked, drained and roughly chopped"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "White Pizza with Clams & Pancetta",
    "url": "http://www.williams-sonoma.com/recipe/white-pizza-with-clams-and-pancetta.html"
}
