{
    "directions": [
        "Butter an 8-inch square glass baking dish. Cut enough bread into 3/4-inch cubes to measure 6 cups. Chop chocolate.",
        "In a small heavy saucepan bring 1 cup cream just to a boil and add chocolate. Remove pan from heat and let mixture stand, covered, undisturbed. In another small heavy saucepan bring milk and remaining cup cream to a gentle simmer. In a bowl with an electric mixer beat together whole eggs, yolks, sugar, and a pinch salt on medium speed 5 minutes. With mixer running, add milk mixture in a slow stream, beating until combined well. Whisk chocolate mixture until smooth and add with vanilla to egg mixture. Beat mixture until combined well.",
        "Arrange bread cubes in baking dish. Pour cream mixture over bread and with a spoon push bread down into mixture to coat evenly. Chill pudding, covered, 1 1/2 hours.",
        "Preheat oven to 350°F.",
        "Put baking dish in a large baking pan and add enough hot water to pan to reach halfway up sides of dish. Bake pudding in middle of oven 45 to 50 minutes, or until set and springy to the touch. Transfer pudding to a rack and cool 30 minutes before serving.",
        "In a saucepan bring wine, water, and sugar to a boil, stirring until sugar is dissolved. Add cherries and remove pan from heat. Let mixture stand, covered, 1 hour. Drain cherries in a sieve and discard liquid.",
        "Serve pudding with cherries and whipped cream."
    ],
    "ingredients": [
        "about 1/2 pound brioche or challah",
        "5 ounces fine-quality white chocolate",
        "2 cups heavy cream",
        "1 cup milk",
        "3 large whole eggs",
        "3 large egg yolks",
        "1/4 cup sugar",
        "1 teaspoon vanilla",
        "1/2 cup dry white wine",
        "1/2 cup water",
        "1/2 cup sugar",
        "1 cup dried tart cherries",
        "Accompaniment: whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Cherry",
        "White Wine",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White-Chocolate Bread Pudding with Poached Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-bread-pudding-with-poached-cherries-15819"
}
