{
    "directions": [
        "Combine flour, sugar and salt in large bowl. Add butter and cut in using fingertips or pastry blender until mixture resembles coarse meal. Beat egg yolks to blend in small bowl. Pour yolks over flour mixture and stir with fork to combine. Gather dough into ball; flatten into disk. Wrap dough in plastic and refrigerate 30 minutes. (Dough can be prepared 3 days ahead. Keep refrigerated. Let dough soften slightly at room temperature before continuing.)",
        "Preheat oven to 375°F. Roll out dough between sheets of waxed paper to 14-inch round (scant 1/4 inch thick). Peel off top sheet of waxed paper. Using second sheet of paper as aid, invert dough into 11-inch-diameter tart pan with removable bottom. Carefully press into pan. Trim and finish edges, patching any holes with scraps. Freeze until firm about 15 minutes.",
        "Line crust with aluminum foil and fill with dried beans or pie weights. Bake until sides are set, about 23 minutes. Remove beans and foil and continue baking until crust is golden brown, piercing bottom with toothpick if crust bubbles, about 12 minutes. Remove from oven. Immediately sprinkle chocolate over crust. Let stand until chocolate melts, about 4 minutes. Using back of spoon, carefully spread chocolate over bottom and up sides of crust. Cool.",
        "Measure 1 tablespoon crème de cassis liqueur into heavy small saucepan; sprinkle unflavored gelatin over and let stand 5 minutes to soften. Add 3/4 cup whipping cream and stir over low heat until gelatin dissolves. Add 7 ounces white chocolate and stir until melted and smooth. Transfer to medium bowl. Refrigerate until cool but not set, stirring occasionally, about 30 minutes.",
        "Whip remaining 1/2 cup whipping cream in medium bowl until soft peaks form. Add remaining 2 tablespoons crème de cassis and whip until stiff peaks form. Fold whipped cream into white chocolate mixture. Fold in raspberries. Spoon filling into crust. Refrigerate until beginning to set, about 30 minutes. Arrange strawberries atop filling, cut sides down and points toward edge. To form optional white chocolate curls, slide vegetable peeler across white chocolate. Garnish tart with chocolate curls. (Tart can be prepared 6 hours ahead. Refrigerate.)"
    ],
    "ingredients": [
        "1 1/2 cups unbleached all purpose flour",
        "4 1/2 tablespoons sugar",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 egg yolks",
        "3 ounces imported milk chocolate (such as Lindt or Droste), finely chopped",
        "3 tablespoons crème de cassis liqueur",
        "1 teaspoon unflavored gelatin",
        "1 1/4 cups chilled whipping cream",
        "7 ounces imported white chocolate (such as Lindt or Droste), chopped",
        "1 1/2-pint basket fresh raspberries",
        "2 1-pint baskets strawberries, halved",
        "2 ounces imported white chocolate for curls (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Raspberry",
        "Strawberry",
        "Summer",
        "Chill"
    ],
    "title": "White Chocolate Mousse and Berry Tart",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-mousse-and-berry-tart-1988"
}
