{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch round cake pans with 2-inch-high sides. Butter two 9-inch parchment paper rounds and place in pans, buttered side up. Stir white chocolate in top of double boiler set over barely simmering water until melted and smooth. Leave white chocolate in pot; turn off heat. Sift flour, baking powder, and salt into medium bowl. Using electric mixer, beat butter and sugar in large bowl until well blended. Add eggs 1 at a time, beating well after each addition. Beat in vanilla. Add dry ingredients alternately with milk in 3 additions, blending well after each addition. Add warm white chocolate and beat just until blended.",
        "Divide batter equally between pans, smoothing tops with spatula. Bake cakes until tester inserted into centers comes out clean, about 30 minutes. Cool cakes in pans on racks 20 minutes (cakes will fall). Run small sharp knife around cake pan sides. Turn cakes out onto cardboard round or tart pan bottom; peel off parchment. Turn cakes right side up onto racks and cool completely.",
        "Stir white chocolate in top of double boiler over barely simmering water until melted and smooth. Remove white chocolate from over water. Let stand until cool but not set, about 20 minutes. Using electric mixer, beat butter in large bowl until fluffy. Beat in white chocolate and vanilla, scraping down sides of bowl occasionally. Beat in powdered sugar. Cover and refrigerate until thick enough to spread, about 45 minutes (frosting will be very soft).",
        "Boil 1/2 cup water and sugar in small saucepan over medium heat, stirring to dissolve sugar. Cool syrup.",
        "Using serrated knife, cut each cake layer horizontally in half. Place 1 layer, cut side up, on 9-inch cardboard cake round or removable bottom of 9-inch tart pan and brush with 2 tablespoons sugar syrup. Spread 6 tablespoons buttercream over cake. Cover buttercream with single layer of sliced apricots. Spread 3 tablespoons buttercream over apricots; top with second cake layer, cut side up. Brush with 2 tablespoons sugar syrup, 6 tablespoons buttercream, apricots, and 3 tablespoons buttercream. Top with third cake layer, cut side up. Brush with 2 tablespoons syrup. Spread 6 tablespoons buttercream over cake; cover with apricots. Spread 3 tablespoons buttercream over apricots. Top with fourth layer, cut side down. Spread 1 cup buttercream over top and sides of cake (layer will be thin). Chill 1 hour. Spread remaining buttercream over top and sides of cake. Press chopped walnuts onto sides of cake. Cover top with remaining sliced apricots. Brush apricots with apricot preserves. Chill cake 1 hour. (Can be made 1 day ahead. Cover with cake dome and keep chilled. Let stand 3 hours at room temperature before serving.)"
    ],
    "ingredients": [
        "8 ounces imported white chocolate, chopped",
        "2 1/4 cups all purpose flour",
        "2 1/4 teaspoons baking powder",
        "1/4 teaspoon salt",
        "10 tablespoons unsalted butter, room temperature",
        "1 1/3 cups sugar",
        "4 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/4 cups whole milk",
        "1 1/4 pounds imported white chocolate, chopped",
        "1 3/4 cups plus 2 tablespoons unsalted butter, room temperature",
        "2 teaspoons vanilla extract",
        "2 cups powdered sugar, sifted",
        "1/2 cup water",
        "1/4 cup sugar",
        "1 1/2 pounds apricots, pitted, thinly sliced",
        "1 cup walnuts, finely chopped",
        "1/4 cup apricot preserves, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Wedding",
        "Apricot",
        "Walnut",
        "Summer",
        "Birthday",
        "Jam or Jelly"
    ],
    "title": "White Chocolate Layer Cake with Apricot Filling and White Chocolate Buttercream",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-layer-cake-with-apricot-filling-and-white-chocolate-buttercream-108258"
}
