{
    "directions": [
        "Preheat oven to 350°F. Grind biscotti and almonds in processor until finely ground. Add butter and process until well blended. Divide mixture equally among eight 4 1/2-inch diameter tartlet pans with removable bottoms (about 1/3 cup mixture for each). Press mixture onto bottoms and up sides of pans. Bake until crusts are golden brown, about 15 minutes. Transfer pans to racks; cool completely.",
        "Bring 1/2 cup whipping cream to boil in heavy medium saucepan. Remove from heat. Add chopped white chocolate and stir until melted and smooth. Cool mixture to room temperature. Using electric mixer, beat cream cheese in large bowl until smooth. Gradually add white chocolate mixture and beat until well blended. Beat remaining 3/4 cup whipping cream, sugar and vanilla in medium bowl until medium-firm peaks form. Fold into cream cheese mixture in 2 additions. Divide filling among prepared tartlet crusts (about 1/2 filing for each). Refrigerate at least 2 hours.",
        "Combine strawberries, water, 3 tablespoons sugar and lemon juice in blender. Purée until smooth. Cover and refrigerate until cold, at least 2 hours. (Tartlets and coulis can be prepared 1 day ahead. Keep refrigerated.)",
        "Remove tartlets from pans. Place 1 tartlet on each of 8 plates. Spoon strawberry coulis alongside and serve."
    ],
    "ingredients": [
        "8 ounces purchased almond biscotti",
        "1 cup whole almonds, toasted (about 5 1/2 ounces)",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1 1/4 cups whipping cream",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "12 ounces cream cheese, room temperature",
        "5 teaspoons vanilla extract",
        "2 cups quartered hulled strawberries (about 12 ounces)",
        "1/4 cup water",
        "3 tablespoons sugar",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Cream Cheese",
        "Strawberry",
        "Almond",
        "Summer",
        "Chill"
    ],
    "title": "White Chocolate Tartlets with Strawberry Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-tartlets-with-strawberry-coulis-5841"
}
