{
    "directions": [
        "Preheat oven to 350°F.. Line 9-inch square baking pan with foil, allowing foil to extend over sides. Butter foil. Combine butter and 4 ounces white chocolate in small saucepan. Whisk over low heat until melted. Remove from heat. Combine flour, baking powder and salt in medium bowl. Using electric mixer, beat eggs, sugar, peel and vanilla in large bowl until fluffy, about 2 minutes. Stir in white chocolate mixture. Fold in dry ingredients. Spread batter in prepared pan. Sprinkle 1 ounce white chocolate atop batter. Bake until golden and top is dry to touch, about 35 minutes.(Can be made 1 day ahead. Cover; store at room temperature.)",
        "Combine cream and white chocolate in small saucepan. Whisk over low heat until chocolate melts. Transfer to medium bowl and chill until cold, about 1 hour. Beat mixture until stiff peaks form. Fold in sliced berries.",
        "Using foil as aid, lift blondie out of pan and place on work surface. Using 3 1/2-inch heart-shaped cookie cutter, cut out 4 hearts (reserve scraps for snacks). Place 1 heart on each of 2 plates. Spread berry filling over hearts on plates, dividing equally and maintaining heart shape. Top with remaining hearts set at slight angle. Garnish plates with halved strawberries, lime segments and mint. Sift powdered sugar lightly over hearts."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "5 ounces imported white chocolate (such as Lindt), chopped",
        "1 1/4 cups sifted unbleached all purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3 large eggs",
        "1 cup plus 2 tablespoons sugar",
        "1 tablespoon minced lime peel (green part only)",
        "2 teaspoons vanilla extract",
        "3/4 cup whipping cream",
        "2 ounces imported white chocolate (such as Lindt), chopped",
        "2 cups sliced strawberries",
        "4 whole strawberries, stems left attached, halved",
        "6 lime segments",
        "Fresh mint sprigs",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Lime",
        "Winter"
    ],
    "title": "White Chocolate and Lime Blondies",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-lime-blondies-543"
}
