{
    "directions": [
        "In the bowl of an electric mixer fitted with a paddle attachment, beat the butter, brown sugar and granulated sugar on medium-high speed until light and fluffy, about 2 minutes. With the mixer on low, add the eggs 1 at a time. Add the vanilla and beat for 1 more minute.",
        "In a separate bowl, sift together the flour, baking powder, cinnamon and salt. With the mixer on low, slowly add the dry ingredients to the wet ingredients. Add the oats, apricots and white chocolate chips and fold to combine using a rubber spatula, making sure everything is evenly incorporated. Cover the bowl with plastic wrap and refrigerate for 1 hour before baking.",
        "Preheat the oven to 325 degrees F. Spray 2 baking sheets with cooking spray.",
        "Using a medium ice cream scoop, drop 2-inch mounds of dough onto the prepared baking sheets. Bake until golden in color, 14 to 16 minutes. Transfer the cookies to a wire rack and let cool completely."
    ],
    "ingredients": [
        "2 sticks (1 cup) unsalted butter, at room temperature",
        "1 cup packed light brown sugar",
        "1 cup granulated sugar",
        "2 large eggs, at room temperature",
        "2 teaspoons pure vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1 teaspoon kosher salt",
        "3 cups old-fashioned oats",
        "1 cup dried apricots, roughly chopped",
        "3/4 cup white chocolate chips",
        "Nonstick cooking spray, for spraying the baking sheets"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Oatmeal Recipes",
        "Cookie",
        "Grain Recipes",
        "Oats",
        "Chocolate",
        "White Chocolate",
        "Apricot",
        "Fruit",
        "Dessert"
    ],
    "title": "White Chocolate Apricot Oatmeal Cookies",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/white-chocolate-apricot-oatmeal-cookies"
}
