{
    "directions": [
        "In a large kettle soak beans in cold water to cover by 2 inches overnight. Drain beans in a colander and return to kettle with cold water to cover by 2 inches. Cook beans at a bare simmer until tender, about 1 hour, and drain in colander.",
        "In a skillet cook onion in 2 tablespoons butter over moderate heat until softened.",
        "In a 6- to 8-quart heavy kettle melt remaining 6 tablespoons butter over moderately low heat and whisk in flour. Cook roux, whisking constantly, 3 minutes. Stir in onion and gradually add broth and half-and-half, whisking constantly. Bring mixture to a boil and simmer, stirring occasionally, 5 minutes, or until thickened. Stir in Tabasco, chili powder, cumin, salt, and white pepper. Add beans, chilies, chicken, and Monterey Jack and cook mixture over moderately low heat, stirring, 20 minutes. Stir sour cream into chili.",
        "Garnish chili with coriander and serve with salsa."
    ],
    "ingredients": [
        "1/2 pound dried navy beans, picked over",
        "1 large onion, chopped",
        "1 stick (1/2 cup) unsalted butter",
        "1/4 cup all-purpose flour",
        "3/4 cup chicken broth",
        "2 cups half-and-half",
        "1 teaspoon Tabasco, or to taste",
        "1 1/2 teaspoons chili powder",
        "1 teaspoon ground cumin",
        "1/2 teaspoon salt, or to taste",
        "1/2 teaspoon white pepper, or to taste",
        "two 4-ounce cans whole mild green chilies, drained and chopped",
        "5 boneless skinless chicken breast halves (about 2 pounds), cooked and cut into 1/2-inch pieces",
        "1 1/2 cups grated Monterey Jack (about 6 ounces)",
        "1/2 cup sour cream",
        "Garnish: fresh coriander sprigs",
        "Accompaniment: tomato salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bean",
        "Cheese",
        "Chicken",
        "Onion",
        "Pepper",
        "Winter",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "White Chicken Chili",
    "url": "http://www.epicurious.com/recipes/food/views/white-chicken-chili-11452"
}
