{
    "directions": [
        "In a heavy kettle cook the salt pork over moderately low heat, stirring, until it is crisp, transfer the cracklings with a slotted spoon to paper towels, and reserve them. In the fat remaining in the kettle cook the onion, the garlic, the bay leaf, and the rosemary, stirring, until the onion is softened, add the celery, the carrots, the turnips, the potatoes, cut into 1-inch pieces, the beans, 4 cups of the broth, and 6 cups water, and simmer the mixture, covered, stirring occasionally, for 1 1/2 to 2 hours, or until the beans are tender. Stir in the spinach is cooked, and stir in the wine, the additional broth or water to thin the soup to the desired consistency, and salt and pepper to taste. Discard the bay leaf, simmer the soup, stirring, for 5 minutes, and serve it sprinkled with the Parmesan and the cracklings if desired.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "1/4 pound salt pork, rind discarded and the meat cut into 1/4-inch dice",
        "2 cups finely chopped onion",
        "2 large garlic cloves, minced",
        "1 bay leaf",
        "1 tablespoon dried rosemary, crumbled",
        "4 ribs of celery, cut crosswise into 1/4-inches slices (about 2 cups)",
        "4 large carrots, cut crosswise into 1/4-inch slices (about 2 cups)",
        "1 pound turnips, peeled and cut into 3/4-inch pieces",
        "1 pound small red potatoes",
        "1 pound dried white beans such as Great Northern, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "4 cups chicken broth plus, if desired, additional for thinning the soup",
        "6 cups packed fresh spinach leaves, washed well, spun dry, and shredded coarse",
        "1 cup dry white wine",
        "freshly grated Parmesan to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Pork",
        "Potato",
        "Vegetable",
        "High Fiber",
        "Spinach",
        "Carrot",
        "Turnip",
        "Fall",
        "Gourmet"
    ],
    "title": "White Bean and Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-and-vegetable-soup-11488"
}
