{
    "directions": [
        "In a dry metal bowl set over a pan of barely simmering water, melt the white chocolate. Remove from the heat and add the passion fruit pulp, heavy cream, and salt and stir to combine. Slowly and carefully add the egg yolks, stirring to combine. Place the bowl over the pan of barely simmering water and heat, stirring constantly, until thickened. Remove from the heat, cover, and chill.",
        "Line a large baking sheet with parchment paper and preheat the oven to 400°F.",
        "Once the white chocolate filling is completely cold, make the turnovers: Arrange the puff pastry rounds on a work surface and fold each one in half. Fill the turnovers with the chilled white chocolate filling and crimp the edges to seal them closed. (Brush the edges of the pastry with water, if necessary, to seal the turnovers.) Transfer to the prepared baking sheet and bake, flipping them over about halfway through the baking time, until golden brown, about 20 minutes.",
        "In a medium saucepan over moderate heat, combine the blueberries, pineapple, water, lemon juice, and sugar. Bring to a simmer and continue simmering for about 3 minutes. Transfer to a blender or food processor, add the mint, and process until smooth. Pour the purée through a fine-mesh sieve into a bowl. If the sauce is very thin, place it in a medium saucepan and simmer until it's reduced to the desired consistency.",
        "In a medium bowl, combine the heavy cream and sugar and whip until medium-stiff peaks form. Fold in the coconut and cinnamon.",
        "Arrange 2 turnovers on each of 4 plates, drizzle with the blueberry-mint sauce, and top each with a generous dollop of coconut cream."
    ],
    "ingredients": [
        "5 ounces high-quality white chocolate, such as Lindt",
        "3 ounces thawed passion fruit pulp*",
        "2 tablespoons heavy cream",
        "1/8 teaspoon sea salt",
        "2 large egg yolks",
        "8 (3 1/2-inch) puff pastry rounds cut from 2 thawed sheets frozen puff pastry (from one 1-pound package)",
        "1 cup blueberries",
        "2 ounces cubed pineapple",
        "1/4 cup water",
        "2 tablespoons freshly squeezed lemon juice",
        "2 tablespoons sugar",
        "1 ounce fresh mint leaves",
        "1 cup heavy cream",
        "1/4 cup sugar",
        "2 ounces shredded unsweetened coconut",
        "1 teaspoon ground cinnamon",
        "*Passion fruit pulp can be found in Latin markets and some supermarkets. If you can't find it, substitute several ripe passion fruit. Force flesh through a fine-mesh sieve into a bowl (the pulp will be very liquid), discarding seeds, until it measures 3 ounces.",
        "1 large baking sheet; parchment paper; blender or food processor; fine-mesh sieve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Berry",
        "Chocolate",
        "Dairy",
        "Fruit",
        "Herb",
        "Dessert",
        "Blueberry",
        "Coconut",
        "Mint",
        "Passion Fruit",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate Passion Fruit Turnovers with Blueberry-Mint Sauce and Coconut Cream",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-passion-fruit-turnovers-with-blueberry-mint-sauce-and-coconut-cream-51190810"
}
