{
    "directions": [
        "Combine dried cherries, juice and 2 tablespoons sugar in a saucepan and bring to a boil. Reduce heat and stir a minute or two until sugar dissolves.",
        "Remove from heat and set aside. (Note: If you use Grand Marnier instead, combine cherries and liqueur in a bowl, cover and allow to sit overnight to soak.)",
        "Heat oven to 350 degrees F.",
        "In a saucepan, combine white chocolate, half & half, milk and sugar, heating over medium heat about 5 to 7 minutes, stirring until chocolate melts and is thoroughly combined.",
        "Add cinnamon and nutmeg and reduce heat to simmer.",
        "Stir a little of the hot mixture into the beaten eggs and stir well to temper the eggs. Slowly add the tempered eggs into the white-chocolate mixture and stir to combine.",
        "Drain cherries and reserve the liquid.",
        "Butter a 9x9-inch baking pan or 8 ramekins.",
        "Place half the cubed buns in the pan or ramekins, top with half of the cherries. Follow with the rest of the cubed buns and the remaining cherries.",
        "Ladle the white chocolate liquid over the bread and cherries. Press down slightly to make sure the liquid soaks into the bread thoroughly.",
        "Bake for 30 to 40 minutes or until a knife inserted into the center comes away clean. Remove from oven and allow to rest for 10 minutes.",
        "Make topping by combining creme fraiche, confectioner's sugar and 1 to 2 tablespoons of the reserved cherry liquid, stirring well.",
        "Top the bread pudding with the creme and serve warm."
    ],
    "ingredients": [
        "Bread pudding:",
        "8 day-old Ball Park® Hamburger Buns, cut into bite-size pieces",
        "1 1/2 cups dried sour cherries (or other dried fruit)",
        "2 cups cherry or apple juice",
        "2 tablespoons sugar",
        "1 (11 ounce) package white chocolate chips",
        "2 cups half-and-half",
        "1 cup milk",
        "1/4 cup sugar",
        "1 teaspoon cinnamon",
        "1 teaspoon ground nutmeg",
        "5 eggs, beaten",
        "Topping:",
        "1 cup creme fraiche",
        "2 tablespoons confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "White Chocolate-Cherry Bread Pudding",
    "url": "http://allrecipes.com/recipe/256909/white-chocolate-cherry-bread-pudding/"
}
