{
    "directions": [
        "Preheat oven to 325°F. Line three 6-cup muffin pans with paper liners. Place white chocolate in metal bowl set over pan of barely simmering water. Stir until melted and smooth.",
        "Whisk flour, baking powder, and salt in medium bowl. Using electric mixer, beat sugar, butter, and vanilla in large bowl until blended. Add hot white chocolate to sugar mixture; stir to combine. Add flour mixture in 3 additions alternately with coconut milk in 2 additions, beating batter just to combine between additions.",
        "Using clean dry beaters, beat egg whites in medium bowl until soft peaks form. Gently fold egg white mixture into batter in 3 additions.",
        "Divide batter among muffin cups (about 1/4 cup each). Bake until tester inserted into center comes out clean, about 25 minutes. Cool completely. (Can be made 1 day ahead. Store in airtight container at room temperature.)",
        "Stir white chocolate in metal bowl set over saucepan of barely simmering water until melted and smooth. Cool slightly. Using electric mixer, beat cream cheese, butter, sugar, vanilla, and salt in medium bowl until fluffy. Gradually beat in melted white chocolate. Let cool until thickened to spreadable consistency.",
        "Spread frosting over cupcakes. Drain Candied Kumquats; arrange kumquats decoratively atop cupcakes. (Can be assembled 2 hours ahead. Let stand at room temperature.)",
        "*Coconut milk is available at many supermarkets and at Indian, Southeast Asian, and Latin markets."
    ],
    "ingredients": [
        "8 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
        "1 3/4 cups all purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon coarse kosher salt",
        "1 cup sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 tablespoon vanilla extract",
        "1/2 cup canned unsweetened coconut milk*",
        "3 large egg whites",
        "4 1/2 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
        "6 ounces (3/4 of 8-ounce package) cream cheese, room temperature",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1/4 cup powdered sugar",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon coarse kosher salt",
        "Candied Kumquatsepi:recipelink</epi:recipelink>"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kid-Friendly",
        "Cream Cheese",
        "Kumquat",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate Cupcakes with Candied Kumquats",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-cupcakes-with-candied-kumquats-233944"
}
