{
    "directions": [
        "In a medium, heavy-bottomed saucepan over medium heat, melt 3/4 cup of the sugar, stirring often, until it takes on a nice sandy color and is a smooth liquid, 10 to 15 minutes.",
        "Quickly add the fruit and stir to coat with the sugar; this will prevent the sugar from caramelizing any further and/or burning. Cook until the fruit is soft, about 10 minutes or so, depending on which fruit you're using and its ripeness.",
        "Transfer the caramelized fruit to a blender. Add the miso and process to a smooth purée. Set aside.",
        "Fill a large bowl or pan with ice and water. Place a large, clean bowl in the ice bath and fit the bowl with a fine-mesh strainer.",
        "In a large, heavy-bottomed, nonreactive saucepan over medium heat, combine the cream and milk and cook, stirring occasionally, until hot but not boiling.",
        "Meanwhile, in a medium bowl, whisk together the egg yolks and the remaining 1 cup sugar until well blended.",
        "Remove the cream mixture from the heat. Slowly pour about half of the hot cream mixture into the yolk mixture, whisking constantly. Transfer the yolk mixture back to the saucepan with the remaining cream mixture and return it to medium heat. Cook, stirring constantly with a rubber spatula and being sure to scrape the bottom of the saucepan so it doesn't scorch, until the liquid begins to steam and you can feel the spatula scrape against the bottom of the pan, about 2-3 minutes.",
        "Remove the custard from the heat. Add the fruit-miso mixture and stir to mix completely. Pour the custard through the strainer into the clean bowl you set up in the ice bath. Let cool, stirring occasionally. Taste for sweetness; add a little more sugar if needed.",
        "When the custard has totally cooled, cover the bowl tightly and chill in the refrigerator for at least 1 hour or preferably overnight. When you are ready to freeze the custard, transfer it to an ice cream maker and spin according to the manufacturer's instructions. Eat immediately, or transfer to an airtight container, cover, and freeze for up to 1 week."
    ],
    "ingredients": [
        "1 3/4 cups sugar, plus more if needed",
        "2 large peaches, apples, or pears (we like Anjou), pitted or cored and cut into chunks. Pears and apples should be peeled, but the peaches don't have to be. (Note: If you're using out-of-season fruit—which is often less flavorful—feel free to toss in an extra one to coax out more flavor.)",
        "2 tbsp white miso",
        "2 cups heavy cream",
        "1 cup whole milk",
        "3 egg yolks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Dairy",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Apple",
        "Pear",
        "Peach",
        "Fall",
        "Party",
        "Advance Prep Required",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "White Miso Peach/Pear/Apple",
    "url": "http://www.epicurious.com/recipes/food/views/white-miso-peach-pear-apple-395670"
}
