{
    "directions": [
        "Trim off the cabbage's root end, thinly slice crosswise, then chop into pieces that can be easily picked up with a fork. Combine the cabbage, carrots, jicama, green onions, apples, and dried currants in a large bowl.",
        "Vigorously whisk together the garlic, lime juice, honey, oil, mustard, balsamic vinegar, and mayonnaise in a medium bowl until the dressing is thoroughly combined. Whisk in the fennel seeds and pour the dressing over the cabbage mixture. Stir until the dressing evenly covers the slaw. The slaw will be a little soupy, which is just the way I like it. Cover and refrigerate for at least 1 hour or until ready to serve.",
        "Instead of by hand, you can mix the dressing in a food processor fitted with the metal blade, which will save you the hassle of chopping up garlic (you add it whole). You cannot, however, escape the slight hassle of peeling off the papery skin and slicing off the tips of each clove.",
        "For those who plan to wear their summer shorts short, you can lighten the dressing: for the 1 cup mayonnaise, substitute 1/4 cup reduced-fat mayonnaise plus 3/4 cup nonfat or low-fat yogurt."
    ],
    "ingredients": [
        "1 medium head napa cabbage (about 2 1/2 pounds)",
        "3 medium carrots, grated on the large holes",
        "1 large jicama (about 1 1/2 pounds), peeled and cut into large matchsticks",
        "1 bunch chopped green onions, white part only",
        "2 Granny Smith apples, peeled, cored, and cut into large matchsticks",
        "3/4 cup dried currants or dried cranberries",
        "3 cloves garlic, minced (about 1 tablespoon)",
        "2 tablespoons freshly squeezed lime juice (about 1 medium lime)",
        "3 tablespoons honey",
        "1/4 cup canola oil",
        "1/4 cup Dijon mustard",
        "1/2 cup white balsamic vinegar",
        "1 cup mayonnaise",
        "1 tablespoon fennel seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Fourth of July",
        "Picnic",
        "Quick & Easy",
        "Backyard BBQ",
        "Mayonnaise",
        "Dried Fruit",
        "Apple",
        "Carrot",
        "Summer",
        "Cabbage",
        "Green Onion/Scallion",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Balsamic-Jicama Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/white-balsamic-jicama-slaw-358170"
}
