{
    "directions": [
        "Soak beans in cold water to cover overnight (8 hours). Drain and rinse well.",
        "Simmer ham hocks in 6 cups water in a 3-quart saucepan, partially covered, skimming foam as necessary, 1 hour. Reserve 4 cups cooking liquid and drain ham hocks.",
        "Heat bacon drippings in an 8-quart heavy pot over moderate heat until hot but not smoking, then cook onion and garlic, stirring, until softened. Add tomatoes and thyme and cook, stirring, 1 minute. Add soaked beans, broth, ham hocks, and reserved cooking liquid and simmer, covered, stirring occasionally, until beans are tender, about 1 hour.",
        "Preheat oven to 375°F.",
        "Melt butter with garlic and toss together with corn bread cubes in a shallow baking pan. Toast in middle of oven until lightly browned and crisp on the outside, about 15 minutes.",
        "Remove ham hocks and shred meat. Return meat to soup and stir in arugula. Simmer, uncovered, stirring occasionally, until greens are tender, 3 to 5 minutes. Season with salt, pepper, and Tabasco.",
        "Serve soup topped with croutons."
    ],
    "ingredients": [
        "1 lb dried small white beans such as navy or Great Northern",
        "1 lb smoked ham hocks",
        "1/4 cup bacon drippings (from 1/2lb bacon) or olive oil",
        "2 cups chopped onion",
        "2 tablespoons minced garlic",
        "1 lb tomatoes, peeled, seeded, and diced",
        "4 fresh thyme sprigs",
        "8 cups chicken broth",
        "3 tablespoons unsalted butter",
        "1 garlic clove, minced",
        "3 cups 3/4-inch cubes corn bread",
        "1 lb arugula, coarse stems removed",
        "Tabasco to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Pork",
        "Tomato",
        "Vegetable",
        "High Fiber",
        "Ham",
        "Arugula",
        "Legume",
        "Fall",
        "Gourmet"
    ],
    "title": "White Bean and Ham Hock Soup with Arugula and Corn Bread Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-and-ham-hock-soup-with-arugula-and-corn-bread-croutons-104225"
}
