{
    "directions": [
        "Make the curd in two separate batches. It's used as a filling between the cake layers and as a component in the mousse.",
        "Whisk 3 cups sugar and 4 1/2 teaspoons cornstarch in heavy medium saucepan to blend. Gradually whisk in 1 1/2 cups lemon juice, then 18 yolks. Add 1 1/2 cups butter. Cook over medium heat until curd thickens and boils, whisking constantly, about 18 minutes. Transfer curd to medium bowl. Press plastic wrap directly onto surface of curd. Make second batch of curd, using same amount of each ingredient. Refrigerate at least 1 day. (Can be made 7 days ahead. Keep chilled.)",
        "Make the frosting in two separate batches at least one day ahead. One batch is for the 12-inch cake, one for the other two cakes. Cream replaces butter in this variation of the standard cream cheese frosting, so it's spreadable straight from the fridge. Use heavy whipping cream for the best results.",
        "Place 8 ounces chocolate in top of double boiler set over barely simmering water. Stir just until chocolate is melted, smooth, and just warm (do not overheat); remove from over water. Using electric mixer, beat 3 packages cream cheese in large bowl until fluffy. Beat in 1 1/4 cups sugar, then warm chocolate. Beat 2 cups cream and 1 1/4 cups sugar in medium bowl until medium-firm peaks form. Fold into cream cheese mixture in 3 additions. Cover; chill. Make second batch of frosting, using same amount of each ingredient. Refrigerate frosting at least 1 day and up to 4 days.",
        "Place lemon curd in large bowl and refrigerate. Place white chocolate in top of double boiler set over barely simmering water. Stir just until chocolate is melted, smooth, and just warm (do not overheat); remove from over water. Beat whipping cream in another large bowl until medium-firm peaks form; fold in warm white chocolate. Fold mixture into lemon curd in 3 additions. Cover bowl and chill mousse until cold and set, at least 1 day and up to 4 days.",
        "Use half of these ingredients to make the 12-inch cake and half to make both the 9- inch and the 6-inch cakes. Sift the flour first, then measure it.",
        "Position rack just below center of oven and preheat to 350°F. Butter and flour 12-inch-diameter cake pan with removable bottom and 3-inch-high sides. Butter and flour 9-inch-diameter cake pan with removable bottom and 3-inch-high sides. Butter and flour 6-inch-diameter cake pan with removable bottom and 3-inch-high sides. Sift 5 1/2 cups sifted cake flour, 5 1/2 teaspoons baking powder, and 1 1/4 teaspoons salt 3 times into large bowl. Mix 1 1/2 cups buttermilk, 3 tablespoons orange juice concentrate, and 2 1/2 tablespoons vanilla in small bowl.",
        "Using electric mixer, beat 3/4 cup (1 1/2 sticks) butter in large bowl until smooth and fluffy. Gradually beat in 1 1/4 cups sugar, then 3/4 cup oil. Beat in 1 more cup sugar. Beat in flour mixture in 4 additions alternately with buttermilk mixture in 3 additions, scraping down sides of bowl often. Using clean dry beaters, beat 1 1/4 cups (about 10) egg whites and 1/4 teaspoon cream of tartar in another large bowl until soft peaks form. Gradually add 1 cup sugar, beating until whites fall from beaters in thick, puffy (not stiff) ribbon, about 4 minutes. Fold whites into batter in 4 additions. Transfer batter to prepared 12-inch pan. Bake cake until brown and tester inserted into center comes out clean, about 1 hour 25 minutes. Cool cake in pan on rack 30 minutes. Cut around cake to loosen; remove pan sides. Maintain oven temperature.",
        "Make second batch of cake batter following same technique as for first cake and using same amount of each ingredient. Transfer 8 1/2 cups batter to prepared 9-inch pan; transfer 4 cups batter to prepared 6-inch pan. Bake cakes until brown and tester inserted into center comes out clean, about 1 hour 10 minutes for 6-inch cake and 1 hour 18 minutes for 9-inch cake. Cool cakes in pans on racks 30 minutes. Cut around cakes to loosen. Remove pan sides. Cool all cakes completely. (Can be made 1 day before filling and frosting the cakes. Return cakes to pans. Cover with foil and store at room temperature.)",
        "To make filling and frosting the cakes easier, use tart-pan bottoms or buy cardboard rounds from a cake and candy supply store.",
        "Push 12-inch cake up to release from pan. Using large serrated knife, cut off enough of top crust to make cake 2 1/2 inches high. Cut cake horizontally into 3 layers, each about 3/4 inch thick. Using tart-pan bottom or 11-inch cardboard round, transfer top layer to work surface and cover; transfer middle layer to work surface and cover. Cut bottom layer from pan bottom and place on tart-pan bottom or cardboard round. Spread generous 1 3/4 cups mousse over. Drop 1 3/4 cups curd over by tablespoonfuls and spread to cover mousse in even layer. Refrigerate until mousse and curd are firm, about 1 hour. Using tart-pan bottom, place middle layer on bottom layer. Spread with same amounts of mousse and curd. Using tart-pan bottom, place top layer on cake and press lightly. Refrigerate assembled cake.",
        "Push 9-inch cake up to release from pan. Cut off enough of top crust to make cake 2 1/2 inches high. Cut cake horizontally into 3 layers, each about 3/4 inch thick. Using tart-pan bottom or cardboard round, transfer top layer to work surface and cover; repeat with middle layer. Cut bottom layer from pan bottom and place on 8-inch tart-pan bottom or cardboard round. Spread 1 1/4 cups mousse over. Drop generous 2/3 cup curd over by tablespoonfuls and spread to cover mousse in even layer. Refrigerate until mousse and curd are firm, about 1 hour. Using tart-pan bottom, place middle layer on bottom layer. Spread with same amount of mousse and curd. Using tart-pan bottom, place top layer on cake and press lightly. Refrigerate assembled cake.",
        "Push 6-inch cake up to release from pan. Cut off enough of top crust to make cake 2 1/2 inches high. Cut cake horizontally into 3 layers, each about 3/4 inch thick. Transfer top layer to work surface and cover; repeat with middle layer. Cut bottom layer from pan bottom and place on 5-inch tart-pan bottom or cardboard round. Spread generous 1/2 cup mousse over. Drop 6 tablespoons curd over by tablespoonfuls and spread to cover mousse in even layer. Refrigerate until mousse and curd are firm, about 1 hour. Using large spatula, place middle layer on bottom layer. Spread with same amount of mousse and curd. Using large spatula, place top layer on cake and press lightly. Refrigerate assembled cake.",
        "Spread 2 1/4 cups frosting thinly over top and sides of 12-inch assembled cake as first coat. Spread 1 1/2 cups frosting thinly over top and sides of 9-inch assembled cake. Spread 3/4 cup frosting thinly over top and sides of 6-inch assembled cake. Chill all cakes 1 hour.",
        "Spread 5 cups frosting over 12-inch cake. Spread 3 2/3 cups frosting over 9-inch cake. Spread 2 cups frosting over 6-inch cake. Refrigerate 6-inch cake.",
        "Place 12-inch cake on platter. Press 1 dowel straight down into center and through to bottom of cake. Mark dowel 1 1/4 inches above level of frosting. Remove dowel and cut with serrated knife at marked point. Cut 7 more dowels to same length. Press 1 dowel back into center of cake. Press remaining 7 dowels into cake, spaced equally apart and 3 to 3 1/4 inches from center dowel. Chill cake with dowels.",
        "Press 1 dowel straight down into center of 9-inch cake. Mark dowel 1 1/4 inches above level of frosting. Remove dowel and cut with serrated knife at marked point. Cut 5 more dowels to same length. Press 1 dowel back into center of cake. Press remaining dowels into cake, spaced equally apart and 2 inches from center; chill with dowels. (Can be made 2 days ahead. After frosting is firm, cover cakes with cake domes or loosely with foil; keep chilled.)",
        "Mix of large and tiny white roses and freesias (about 5 dozen)",
        "Place 9-inch cake atop dowels in 12-inch cake. Place 6-inch cake atop dowels in 9-inch cake. Place large roses between bottom and middle tiers, fitting in tiny roses and freesias to fill space. Fill space between middle and top tiers with mix of flowers.",
        "This fruit compote contributes color and flavor contrast to each serving of the cake.",
        "Combine all ingredients in large bowl; toss to coat. Cover; chill until juices form, at least 1 hour and up to 6 hours.",
        "Place top and middle cake tiers on work surface. Remove flowers and dowels from cakes. Cut top cake into 8 slices. Cut middle cake into 16 slices. Insert knife straight down into 12-inch cake 3 inches from edge. Continue to cut around cake 3 inches from edge, making 6-inch-diameter circle in center. Cut outer ring into 18 slices. Cut 6-inch center into 8 slices. Place cake slices on plates; spoon compote alongside each."
    ],
    "ingredients": [
        "6 cups sugar",
        "9 teaspoons cornstarch",
        "3 cups fresh lemon juice",
        "36 large egg yolks",
        "3 cups (6 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "16 ounces imported white chocolate (such as Lindt or Perugina), finely chopped (do not use chips)",
        "6 8-ounce packages Philadelphia-brand cream cheese, room temperature",
        "5 cups (packed) powdered sugar (about 1 1/4 pounds)",
        "4 cups chilled heavy whipping cream",
        "4 cups lemon curd (see above)",
        "14 ounces imported white chocolate (such as Lindt or Perugina), finely chopped (do not use chips)",
        "1 1/3 cups chilled heavy whipping cream",
        "11 cups sifted cake flour",
        "11 teaspoons baking powder",
        "2 1/2 teaspoons salt",
        "3 cups buttermilk",
        "6 tablespoons thawed frozen orange juice concentrate",
        "5 tablespoons vanilla extract",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "6 1/2 cups sugar",
        "1 1/2 cups vegetable oil",
        "2 1/2 cups egg whites (about 20 large)",
        "1/2 teaspoon cream of tartar",
        "2 11-inch-diameter tart-pan bottoms or cardboard rounds",
        "1 8-inch-diameter tart-pan bottom or cardboard round (cut from 9-inch round)",
        "1 5-inch-diameter tart-pan bottom or cardboard round (cut from 6-inch round)",
        "14 12-inch-long, 1/4-inch-diameter wooden dowels",
        "Mix of large and tiny white roses and fresias (about 5 dozen)",
        "8 1-pint containers fresh strawberries, hulled, halved",
        "2 1/2-pint containers fresh blackberries",
        "2 1/2-pint containers fresh raspberries",
        "2 1/2-pint containers fresh blueberries",
        "1 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Wedding",
        "Cream Cheese",
        "Lemon",
        "Summer",
        "Chill",
        "Double Boiler"
    ],
    "title": "White Chocolate and Lemon Wedding Cake",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-lemon-wedding-cake-108257"
}
