{
    "directions": [
        "Place all ingredients in large bowl; toss to coat. Cover and refrigerate overnight.",
        "Puree fruit mixture in processor until smooth. Strain, pressing on solids in strainer; discard solids. Process puree in ice cream maker according to manufacturer's instructions. Transfer to container; cover and freeze until solid, about 4 hours.",
        "DO AHEAD Can be made 3 days ahead. Keep frozen.",
        "Place peaches, 3/4 cup sugar, corn syrup, and ascorbic acid in large bowl; cover and refrigerate overnight.",
        "Puree fruit in processor until smooth. Strain, pressing on solids in strainer; discard solids. Cover and chill until ready to use.",
        "Whisk yolks in large bowl. Bring cream and remaining 3 tablespoons sugar to boil in heavy medium saucepan, stirring until sugar dissolves. Gradually whisk hot cream mixture into yolks; return mixture to same pan. Stir constantly over medium heat until custard thickens enough to leave path on back of spoon when finger is drawn across, about 5 minutes. Strain custard into medium metal bowl; place over large bowl of ice water and stir frequently until custard is cold. Whisk in peach puree. Process in ice cream maker according to manufacturer's instructions. Transfer to container. Cover and freeze at least 4 hours.",
        "DO AHEAD Can be made 3 days ahead. Keep frozen.",
        "Divide ice cream and sorbet among 8 bowls. Spoon sliced peaches and nectarines over and serve."
    ],
    "ingredients": [
        "2 pounds white nectarines, halved, pitted, sliced",
        "3/4 cup sugar",
        "1/4 cup light corn syrup",
        "1 teaspoon powdered ascorbic acid",
        "1 1/4 pounds very ripe white peaches",
        "3/4 cup plus 3 tablespoons sugar",
        "1/3 cup light corn syrup",
        "1/2 teaspoon powdered ascorbic acid",
        "3 large egg yolks",
        "1 cup whipping cream",
        "2 white nectarines, halved, cored, sliced",
        "2 white peaches, halved, cored, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Egg",
        "Dessert",
        "Frozen Dessert",
        "Nectarine",
        "Peach"
    ],
    "title": "White Nectarine Sorbet with White Peach Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/white-nectarine-sorbet-with-white-peach-ice-cream-234959"
}
