{
    "directions": [
        "Combine all ingredients in heavy medium saucepan. Bring to boil, stirring occasionally. Reduce heat to medium-low and simmer gently until figs and prunes are soft, about 10 minutes. Cool compote slightly. Transfer to small bowl. (Compote can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 325°F. Arrange six 3/4-cup ramekins or custard cups in 13x9x2-inch metal baking pan. Combine cream, half and half, and pepper in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring cream mixture to simmer over medium heat. Cover; set aside 10 minutes to steep. Discard vanilla bean. Whisk egg yolks and 1/2 cup sugar in medium bowl to blend. Gradually whisk in warm cream mixture.",
        "Divide custard among ramekins. Pour enough hot water into baking pan to come halfway up sides of ramekins. Bake custards until set in center, about 35 minutes. Remove custards from water; refrigerate uncovered until cold, about 2 hours. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Preheat broiler. Sprinkle 1 1/2 teaspoons raw sugar crystals over top of each custard. Place custards on small baking sheet and broil until sugar melts and browns, rotating sheet for even browning, about 3 minutes. Refrigerate custards uncovered until topping hardens, at least 1 hour and up to 3 hours.",
        "Serve custards with compote."
    ],
    "ingredients": [
        "2 cups apple juice",
        "3/4 cup diced dried Calimyrna figs (about 5 ounces)",
        "3/4 cup diced dried pitted prunes (about 5 ounces)",
        "1/2 teaspoon (packed) grated orange peel",
        "2 1/3 cups whipping cream",
        "1/3 cup half and half",
        "1/2 teaspoon ground white pepper",
        "1 5-inch piece vanilla bean, split lengthwise",
        "8 large egg yolks",
        "1/2 cup sugar",
        "9 teaspoons raw sugar crystals"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Prune",
        "Fig",
        "Apple",
        "Spice",
        "Fall",
        "Ramekin",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Pepper Crème Brûlée with Fig and Prune Compote",
    "url": "http://www.epicurious.com/recipes/food/views/white-pepper-creme-brulee-with-fig-and-prune-compote-108592"
}
