{
    "directions": [
        "Line a metal loaf pan, 8 1/2 by 4 1/2 by 2 1/2 inches, with plastic wrap, leaving a 2-inch overhang on ends, and chill in freezer.",
        "In a skillet cook almonds with salt in butter over moderately low heat, stirring, until almonds are coated well, about 1 minute. Chill almonds until cold.",
        "In a metal bowl set over a pan of hot but not simmering water melt chocolate, stirring occasionally, and remove bowl from heat.",
        "In another metal bowl beat eggs with sugar to combine. Set bowl over a pan of simmering water and beat until thick and pale and mixture registers 140°F. on an instant-read thermometer. Continue beating over simmering water 3 minutes (for egg safely) and remove from heat. Beat in chocolate, vanilla, and almond extract.",
        "In another bowl beat cream until it just holds stiff peaks and fold into egg mixture gently but thoroughly. Fold in almonds and pour mixture into prepared pan. Cover pan with plastic wrap and freeze semifreddo 8 hours or overnight.",
        "Unmold semifreddo onto a platter, discarding plastic wrap, and cut into thick slices. Cut slices crosswise into thirds and serve with Lemon Rhubarb Cake Roll."
    ],
    "ingredients": [
        "a scant cup sliced almonds (3 1/2 ounces), toasted lightly",
        "1/4 teaspoon salt",
        "1 tablespoon unsalted butter",
        "6 ounces fine-quality white chocolate, chopped",
        "2 large eggs",
        "1/3 cup sugar",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1 1/2 cups chilled heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Almond",
        "Chill",
        "Gourmet"
    ],
    "title": "White Chocolate Toasted Almond Semifreddo",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-toasted-almond-semifreddo-14412"
}
