{
    "directions": [
        "Position oven rack on lowest shelf and preheat oven to 500°F. Lightly oil a 17- by 14-inch heavy baking sheet (without sides) and sprinkle with cornmeal, tapping off excess.",
        "Pulse beans with garlic, broth, and 1 teaspoon oil in a food processor until coarsely chopped and season with salt and pepper.",
        "Dust pizza dough and your hands with flour. Holding 1 edge of dough in the air with both hands and letting bottom touch work surface, move hands around edge (like turning a steering wheel), allowing weight of dough to stretch it roughly into a 10-inch round. Flour backs of your fists and with them stretch dough from center of underside, turning dough to maintain a rough circle, until 13 to 14 inches.",
        "Place on baking sheet.",
        "Spread bean purée over dough, leaving a 1-inch border around edge. Top purée with tomatoes and onion, then sprinkle with rosemary and dot with cheese. Season with salt and pepper.",
        "Bake pizza on bottom oven rack until crust is browned and crisp and topping is bubbling, 12 to 15 minutes.",
        "Toss greens with remaining 1/2 teaspoon oil and salt and pepper to taste and sprinkle over pizza.",
        "Cut pizza into 8 slices."
    ],
    "ingredients": [
        "Cornmeal for sprinkling",
        "1 cup cannellini or other white beans (from a l-lb can), rinsed",
        "1 garlic clove, smashed",
        "1 tablespoon fat-free chicken broth or water",
        "1 1/2 teaspoons extra-virgin olive oil",
        "1 lb fresh or thawed frozen pizza dough",
        "All-purpose flour for dusting",
        "3 plum tomatoes, coarsely chopped",
        "1/4 small red onion, thinly sliced",
        "1 teaspoon chopped fresh rosemary",
        "4 oz low-fat soft goat cheese, crumbled",
        "2 cups small-leaf greens such as baby arugula or mâche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bean",
        "Garlic",
        "Tomato",
        "Bake",
        "Super Bowl",
        "Quick & Easy",
        "Goat Cheese",
        "Rosemary",
        "Arugula",
        "Summer",
        "Gourmet"
    ],
    "title": "White Bean, Tomato and Goat-Cheese Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/white-bean-tomato-and-goat-cheese-pizza-103720"
}
