{
    "directions": [
        "Preheat oven to 350°F. Place large piece of foil on heavy large baking sheet. Set 8x2-inch bottomless heart-shaped cake pan atop foil. (If unavailable, use 8-inch springform pan; omit foil.) Wrap foil around outside and 1 inch up sides of pan. Butter foil and pan. Finely grind cookies and almonds in processor. Add butter and blend until mixture forms very moist crumbs. Using plastic wrap as aid, press crumbs firmly onto bottom and 2 inches up sides of pan. Bake until golden, about 10 minutes. Cool. Maintain oven temperature.",
        "Melt white chocolate in top of double boiler over simmering water until smooth, stirring often. Remove from over water. Using electric mixer, beat cream cheese, sugar, vanilla and peel in large bowl until smooth. Add eggs 1 at a time, beating just until combined. Beat in white chocolate.",
        "Spoon half of batter into crust. Top with 3/4 cup berries. Spoon remaining batter over. Bake until edges of cake are set but center 3 inches still moves when cake is shaken, about 45 minutes. Cool 20 minutes. Maintain oven temperature. Using fingertips, press down gently on edges of cheesecake to flatten slightly.",
        "Whisk sour cream, sugar and vanilla in bowl. Spoon over cake, spreading to edge of pan. Bake 5 minutes. Transfer cake in pan to rack. Run small knife around sides of cake. Cool completely. Chill cake overnight.",
        "Fold down foil along sides of pan. Lift cake pan off cheesecake. Transfer cheesecake to platter, discarding foil. Cover cake with berries. Bring jam to simmer in small saucepan, stirring often. Gently brush jam over berries. (Can be prepared 3 hours ahead; chill.)"
    ],
    "ingredients": [
        "18 vanilla wafer cookies",
        "1 cup almonds, toasted",
        "4 1/2 tablespoons unsalted butter, melted",
        "4 ounces imported white chocolate (such as Lindt), chopped",
        "2 8-ounce packages cream cheese, room temperature",
        "2/3 cup sugar",
        "2 teaspoons vanilla extract",
        "3/4 teaspoon grated lemon peel",
        "2 large eggs",
        "3/4 cup fresh raspberries or frozen unsweetened, thawed, drained",
        "1 8-ounce container sour cream",
        "3 tablespoons sugar",
        "1/2 teaspoon vanilla extract",
        "2 1/2-pint baskets raspberries or one 1-pint basket strawberries",
        "1/2 cup seedless raspberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Cream Cheese",
        "Raspberry",
        "Almond",
        "Chill",
        "Party",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "White Chocolate and Raspberry Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/white-chocolate-and-raspberry-cheesecake-1162"
}
