{
    "directions": [
        "Put oven rack in middle position and preheat oven to 325°F. Oil terrine mold and line bottom with a sheet of wax paper (cut to fit), then oil paper.",
        "Remove any visible silver skin or sinew from fish and cut on either side of pin bones until all pin bones have been removed, then cut fish into 1-inch pieces. Purée fish with salt, white pepper, and nutmeg in a food processor until very smooth. Add egg white and purée until incorporated, then transfer mixture to a bowl set in a larger bowl of ice.",
        "Set tamis, screen side up, over a plate and work fish mixture through sieve about 2 tablespoons at a time with scraper until all that remains is sinews. Continue to work fish through sieve, scraping strained fish from underside of tamis from time to time and transferring to a large bowl set in another bowl of ice.",
        "Weigh strained fish to determine equal amount of cream (1 cup cream weighs 8 ounces). Then, keeping fish mixture over ice, stir cream into fish mixture, about 1/4 cup at a time, with a large rubber spatula until all cream is incorporated.",
        "Transfer one fourth of mixture to a small bowl and stir in dill. Gently fold salmon roe into remaining fish mixture.",
        "Spread about two thirds of roe mixture in terrine and create a wide trough lengthwise along the middle with back of a spoon. Fill trough with dill mixture, mounding it slightly and smoothing surface. Cover with remaining roe mixture and rap mold firmly on counter to compact terrine. Smooth top with offset spatula and cover surface with an oiled sheet of wax paper (oiled side down).",
        "Bake in awater bath until terrine is firm to the touch and separates easily from sides of mold and thermometer inserted diagonally through paper into center of terrine registers 110 to 120°F (a metal skewer or thin knife plunged to bottom of terrine for 5 seconds and removed will feel hot), 40 to 45 minutes.",
        "Transfer terrine in mold to a rack and let cool 10 to 15 minutes before unmolding.",
        "To unmold, remove wax paper and run a thin knife around inside edge of mold. Invert a cutting board or serving dish over terrine, then reinvert and remove mold and wax paper, blotting any excess liquid. Cut terrine into slices with a sharp knife, supporting each slice as cut with a flat metal spatula and transferring as cut to small plates.",
        "*Available at bridgekitchenware.com."
    ],
    "ingredients": [
        "1 1/4 lb skinless cod, scrod, or gray sole fillets, well chilled",
        "2 teaspoons kosher salt or 1 teaspoon table salt",
        "1/4 teaspoon white pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "1 large egg white",
        "2 cups chilled heavy cream",
        "2 tablespoons minced fresh dill",
        "3 tablespoons salmon roe",
        "Special equipment: a 4-cup terrine mold or loaf pan; a tamis (drum sieve) with 30 to 40 holes per square centimeter*; a slightly flexible bowl scraper; a kitchen scale; an offset spatula; an instant-read thermometer",
        "Accompaniment:beurre blanc"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Appetizer",
        "Bake",
        "Cod",
        "Dill",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "White Fish Terrine with Salmon Roe and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/white-fish-terrine-with-salmon-roe-and-dill-233244"
}
