{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Wrap the outside of a 10-inch springform pan with foil. Grease the inside of the pan.",
        "Place the cream cheese, sugar, and flour in a mixing bowl and cream until light and fluffy. Beat in eggs one at a time, mixing well after each addition. Scrape bowl.",
        "Melt 4 ounces of the white chocolate. With an electric mixer on low speed, mix melted white chocolate into cream cheese mixture. Keeping electric mixer on low, slowly beat in the vanilla and 1/2 cup of heavy cream. Blend well. Pour mixture into the prepared springform pan.",
        "Place cheesecake pan in a water bath filled with warm water. Bake at 300 degrees F (150 degrees C) for 50 to 60 minutes, or until center of the cheesecake is just firm. Cool at room temperature for 1 hour. Refrigerate until set before removing from pan.",
        "To make White Chocolate Brandy Sauce: place chopped white chocolate in a heat-proof bowl. Pour 1 cup cream into a saucepan and bring it to a boil over medium-high heat. Watch carefully so it doesn't boil over. Pour hot cream over chopped white chocolate; let soften for 2 minutes. Stir with a wooden spoon until melted. Add brandy and continue stirring until incorporated. Pour over chilled cheesecake and serve."
    ],
    "ingredients": [
        "White Chocolate Cheesecake:",
        "4 (1 ounce) squares white chocolate",
        "3 (8 ounce) packages cream cheese, room temperature",
        "3/4 cup white sugar",
        "1/4 cup all-purpose flour",
        "3 eggs, room temperature",
        "1/2 cup heavy cream, room temperature",
        "1/2 teaspoon vanilla extract",
        "White Chocolate Brandy Sauce:",
        "2 cups finely chopped white chocolate",
        "1 cup heavy cream",
        "2 fluid ounces brandy"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "White Chocolate Cheesecake with White Chocolate Brandy Sauce",
    "url": "http://allrecipes.com/recipe/7385/white-chocolate-cheesecake-with-white/"
}
