{
    "directions": [
        "In a small bowl stir together 1 3/4 cups warm water and yeast and let stand until foamy, about 5 minutes. In a measuring cup whisk together remaining 1/4 cup warm water and molasses. In a large bowl stir together 2 cups flour, sugar, salt, and oil and add molasses and yeast mixtures, stirring until combined well. Stir in enough of remaining 3 to 4 cups flour, 1/2 cup at a time, for mixture to form a soft dough and turn dough out onto a lightly floured surface. Knead dough 8 minutes, or until smooth and elastic, and shape into a ball.",
        "Transfer dough to a lightly oiled bowl, turning to coat, and let rise, covered with plastic wrap, in a warm place until doubled in bulk, about",
        "1 hour. Punch down dough and let rise, covered, 45 minutes more.",
        "Preheat oven to 400°F. and grease 2 loaf pans, 8 1/2 by 4 1/2 by",
        "2 inches.",
        "Divide dough in half. Lightly knead each piece of dough and form into ovals. Transfer loaves to pans and let rise, covered with kitchen towels,",
        "45 minutes. Brush tops of loaves lightly with egg wash and sprinkle with oats. Bake loaves in middle of oven 10 minutes. Reduce oven temperature to 350°F. and bake loaves 20 to 25 minutes more, or until golden brown. Turn loaves out onto a rack to cool."
    ],
    "ingredients": [
        "2 cups warm water (105°-115°F.)",
        "1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/4 cup molasses",
        "5 to 6 cups whole-wheat flour",
        "2 tablespoons sugar",
        "2 teaspoons salt",
        "1/2 cup canola oil",
        "an egg wash made by beating 1 large egg white with 1 teaspoon water",
        "3 tablespoons old-fashioned rolled oats for sprinkling loaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Oat",
        "Winter",
        "Healthy",
        "Molasses",
        "Whole Wheat",
        "Gourmet",
        "Canada"
    ],
    "title": "Whole-Wheat Bread Hayes",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-bread-hayes-13597"
}
