{
    "directions": [
        "Heat 2 tablespoons oil in a large skillet over medium heat. Add breadcrumbs and toast, stirring frequently, until golden and crisp, 4-5 minutes. Transfer to a small bowl; stir in lemon zest and red pepper flakes. Set aside.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until tender but still firm to the bite. Drain, reserving 2 cups pasta cooking liquid.",
        "Meanwhile, heat 1 tablespoon oil and butter in a large deep skillet over medium-high heat. Add radishes; cook, stirring often, until browned in spots but still crisp-tender, about 2 minutes. Transfer to a small bowl. Add remaining 2 tablespoons oil and garlic to skillet; stir until fragrant, about 1 minute.",
        "Add greens and 1 cup pasta cooking liquid and cook, stirring often, until greens start to wilt. Add pasta and cheese; stir until cheese melts and sauce is slightly thickened, adding more pasta cooking liquid by 1/4-cupfuls if too dry. Stir in radishes, lemon juice, and pepper. Season with salt. Sprinkle with breadcrumb mixture."
    ],
    "ingredients": [
        "5 tablespoons extra-virgin olive oil, divided",
        "3/4 cup coarse fresh breadcrumbs made from whole wheat bread",
        "2 teaspoons finely grated lemon zest",
        "1 teaspoon crushed red pepper flakes",
        "1 pound whole wheat orecchiette (little ear-shaped pasta)",
        "Kosher salt",
        "1 tablespoon unsalted butter",
        "8 medium radishes (8 ounces), sliced into 1/4\" rounds",
        "3 garlic cloves, sliced",
        "2 bunches bitter greens (such as escarole), trimmed, chopped",
        "1 cup finely grated Parmesan",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon cracked black peppercorns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pasta",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Parmesan",
        "Radish",
        "Winter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Whole Wheat Oricchiette with Bitter Greens and Radishes",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-oricchiette-with-bitter-greens-and-radishes-368981"
}
