{
    "directions": [
        "Whisk minced onion, water, tangerine juice, coconut aminos, 1/3 cup coconut oil, green onions, garlic, ginger, vinegar, salt, and black pepper together in a bowl until marinade is evenly mixed. Place chicken in a separate bowl and pour 1/2 of the marinade over chicken.",
        "Bring a large pot of lightly salted water to a boil. Add string beans and broccoli; cook uncovered until broccoli turns bright green, about 1 minute. Drain in a colander and immediately run under cold water for several minutes until cold. Drain and transfer to a large bowl.",
        "Heat ghee in a skillet over medium heat; cook and stir mushrooms until lightly browned, 5 to 10 minutes. Transfer mushrooms to bowl with beans and broccoli, reserving ghee in skillet.",
        "Cook and stir sliced onion in the ghee until softened, 5 to 10 minutes. Transfer onion to the bowl with mushroom mixture.",
        "Remove chicken from marinade, reserving marinade. Heat a cast iron grill pan or nonstick skillet over medium heat; cook chicken until no longer pink in the center, about 10 minutes. Transfer chicken to mushroom mixture.",
        "Heat 2 tablespoons coconut oil in a separate skillet over high heat; cook zucchini and carrots, using tongs to toss zucchini, until tender, 2 to 3 minutes. Add mushroom mixture, marinade from chicken, and reserved marinade to skillet; cook and stir until simmering and heated through, 5 to 10 minutes."
    ],
    "ingredients": [
        "Marinade:",
        "1/2 onion, minced",
        "1/2 cup water",
        "1/2 cup tangerine juice",
        "1/3 cup coconut aminos (soy-free seasoning sauce)",
        "1/3 cup coconut oil",
        "4 green onions, sliced into rounds",
        "2 cloves garlic, minced",
        "1 (1 inch) piece fresh ginger, minced",
        "1 teaspoon vinegar",
        "salt and ground black pepper to taste",
        "2 pounds boneless chicken breast, cut into cubes",
        "1 cup string beans, trimmed, or to taste",
        "1 cup chopped broccoli",
        "1/4 cup ghee (clarified butter)",
        "1 (8 ounce) package fresh mushrooms, sliced",
        "1/2 onion, sliced",
        "2 tablespoons coconut oil",
        "3 zucchini, spiralized",
        "2 carrots, shredded"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Whole30® Thai Stir Fry",
    "url": "http://allrecipes.com/recipe/244255/whole30-thai-stir-fry/"
}
