{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. Place the broccoli rabe in a large microwaveable dish with 1 tablespoon of water. Cover tightly and microwave on high for 5 minutes. Drain and set aside.",
        "3. Spread the pine nuts in a single layer on a baking sheet and toast in the oven for about 5 minutes, or until they are fragrant and golden brown.",
        "4. Set a large pot of water to boil for the pasta. When boiling, add the pasta and cook according to the directions on the box. Drain. Meanwhile, heat 1 tablespoon of the oil in a large skillet over a medium flame. Add the sausage and cook for 5 or 6 minutes, until brown. Remove the sausage from the skillet and slice into 1/4-inch rounds.",
        "5. Add the remaining oil to the skillet and sauté the garlic until fragrant, about 2 minutes. Stir in the broccoli rabe and sliced sausage, and sautéfor about 3 minutes. Add the chicken broth, crushed red pepper, and salt and pepper to taste. Simmer on a low heat until pasta is ready.",
        "6. Combine the drained pasta with the sausage-broccoli rabe mixture and the pine nuts in a large bowl or pot. Serve topped with Parmesan cheese."
    ],
    "ingredients": [
        "1 bunch broccoli rabe (about 1 pound), washed and coarsely chopped",
        "1/4 cup pine nuts",
        "3/4 pound whole wheat penne",
        "2 tablespoons olive oil",
        "3/4 pound Italian-style poultry sausage",
        "3 garlic cloves, minced",
        "1 cup low-sodium chicken broth",
        "1/4 teaspoon crushed red pepper flakes",
        "Salt and freshly ground black pepper to taste",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sauté",
        "Kid-Friendly",
        "Dinner",
        "Poultry Sausage",
        "Healthy",
        "Broccoli Rabe",
        "Boil",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Whole Wheat Penne with Sausage and Broccoli Rabe",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-penne-with-sausage-and-broccoli-rabe-51186470"
}
