{
    "directions": [
        "Position a rack in the lowest position in an oven and preheat to 400°F. Grease a baking sheet or a 12-inch pizza pan with the 2 tsp. olive oil and dust with cornmeal.",
        "On a lightly floured work surface, pat and stretch the pizza dough into a 12-inch round. Transfer to the prepared baking sheet.",
        "In a fry pan over medium heat, warm 1 Tbs. of the olive oil. Remove the sausages from their casings, add the meat to the pan and cook, stirring constantly and breaking up the meat into pieces, until lightly browned on all sides, 3 to 5 minutes. Transfer to a plate and scrape out any browned bits from the pan.",
        "In the same pan over medium heat, warm the remaining 1 Tbs. olive oil. Add the garlic and red pepper flakes and cook until just fragrant, about 1 minute. Add the broccoli rabe (carefully, as any water clinging to it may cause the oil to splatter) and sprinkle with the salt. Cook, stirring often, until the broccoli rabe is bright green and evenly coated with the oil, about 2 minutes. Add 2 Tbs. water to the pan and steam until the broccoli rabe is tender, about 5 minutes more, sprinkling up to 2 Tbs. more water if needed.",
        "Scatter the cheese, broccoli rabe and sausage evenly on top of the dough. Bake until the crust is golden brown on the edges and the cheese is bubbling, 15 to 18 minutes. Let the pizza cool slightly, then cut into squares or wedges and serve immediately. Makes one 12-inch pizza; serves 4.",
        "Adapted from Williams-Sonoma",
        "Healthy in a Hurry",
        ", by Karen Ansel, MS, RD and Charity Ferreira (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "2 tsp. plus 2 Tbs. olive oil",
        "Cornmeal for dusting",
        "1 lb. whole-wheat pizza dough",
        "2 turkey sausages",
        "1 garlic clove, pressed or minced",
        "1/4 tsp. red pepper flakes",
        "1 bunch broccoli rabe, trimmed, coarsely chopped and rinsed",
        "1/8 tsp. sea salt",
        "1/2 cup shredded part-skim mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Whole-Wheat Pizza with Broccoli Rabe and Turkey Sausage",
    "url": "http://www.williams-sonoma.com/recipe/whole-wheat-pizza-with-broccoli-rabe-and-turkey-sausage.html"
}
