{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Line baking sheet with parchment paper. Mix mushrooms and apricots in medium bowl; pour 3/4 cup warm water over. Let stand until mushrooms and apricots soften and liquid is absorbed, about 15 minutes.",
        "Mix buttermilk, oats, and butter in large bowl. Let stand until oats soften, about 15 minutes. Stir mushroom mixture into oat mixture. Stir in honey.",
        "Whisk both flours, baking powder, salt, and baking soda in another large bowl. Make well in center; add oat mixture and stir until dough forms, gradually mixing in dry ingredients. Turn dough out onto work surface and knead gently, about 5 turns. Shape dough into 7-inch round. Transfer to baking sheet. Cut X in top center of loaf. Brush with egg glaze.",
        "Bake bread until tester inserted into center comes out clean, about 1 hour 5 minutes. Transfer to rack and cool. (Can be made 1 day ahead. Wrap bread tightly in foil and let stand at room temperature.)"
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms* (about 1 1/2 cups), any grit brushed away, coarsely chopped",
        "1/2 cup diced unsulfured dried apricots** or dried figs",
        "3/4 cup warm water",
        "1 3/4 cups buttermilk",
        "1 cup old-fashioned oats",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1/4 cup honey",
        "2 cups all purpose flour",
        "1 1/4 cups whole wheat flour",
        "2 teaspoons baking powder",
        "2 teaspoons coarse salt",
        "1 teaspoon baking soda",
        "1 egg, beaten to blend (for glaze)",
        "*Available at Italian markets, specialty food stores, and some supermarkets.",
        "**Available at natural food stores and some specialty food stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Mushroom",
        "Bake",
        "St. Patrick's Day",
        "Dried Fruit",
        "Apricot",
        "Oat",
        "Fall",
        "Healthy",
        "Honey"
    ],
    "title": "Whole Wheat Porcini Soda Bread",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-porcini-soda-bread-107261"
}
