{
    "directions": [
        "Preheat oven to 350°F. Butter heavy large baking sheet. Place 4 teaspoons aniseed in small sealable plastic bag; close bag. Using mallet, pound seeds until coarsely crushed. Combine crushed aniseed and anisette liqueur in small bowl.",
        "Stir both flours, oats, salt and baking soda in large bowl to blend. Whisk buttermilk, eggs, molasses and melted butter in medium bowl. Whisk in anisette mixture. Make well in center of dry ingredients. Pour buttermilk mixture into well; stir until blended. Mix in pears (dough will be dense and moist).",
        "Turn dough out onto floured surface. Knead gently until dough comes together and pear pieces are well distributed, about 2 minutes. Cut dough in half. Form each half into 6-inch round. Transfer to prepared baking sheet. Flatten slightly. Using sharp knife, cut 1/2-inch-deep cross in center of each round.",
        "Bake until bread is golden and sounds hollow when tapped and tester inserted into center of bread comes out clean, about 55 minutes. Transfer to racks. Cool completely. (Can be made ahead; wrap in foil and store at room temperature 1 day or freeze up to 2 weeks. Thaw bread; rewarm wrapped in foil in 350°F. oven about 15 minutes, if desired.)"
    ],
    "ingredients": [
        "4 teaspoons aniseed",
        "1/4 cup anisette liqueur",
        "4 cups whole wheat flour",
        "2 cups unbleached all purpose flour",
        "1 cup old-fashioned oats",
        "1 tablespoon salt",
        "2 teaspoons baking soda",
        "2 1/4 cups buttermilk",
        "2 large eggs",
        "1/4 cup unsulfured (light) molasses",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 pound dried pears, cut into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Fruit",
        "Herb",
        "Bake",
        "St. Patrick's Day",
        "Pear",
        "Winter",
        "Anise"
    ],
    "title": "Whole Wheat Soda Bread with Dried Pears and Anise",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-soda-bread-with-dried-pears-and-anise-1243"
}
