{
    "directions": [
        "In a fry pan large enough to accommodate the pasta later, warm 6 Tbs. (3 fl. oz./90 ml) of the olive oil over medium heat. Add the onions and sauté, stirring often to heat evenly and to prevent sticking, until lightly golden, soft and creamy, about 45 minutes. Remove from the heat and season with sea salt and pepper. Cover to keep warm.",
        "While the onions are cooking, preheat an oven to 450°F (230°C).",
        "On a rimmed baking sheet, toss the squash with just enough olive oil to coat lightly and spread it out in a single layer. Roast until golden brown outside and thoroughly tender inside, about 15 minutes. Remove from the oven and cover to keep warm.",
        "In a small fry pan over medium-low heat, warm the remaining 3 Tbs. olive oil. Add the bread crumbs and cook, stirring constantly, until golden and crunchy, about 2 minutes, reducing the heat if the crumbs color too quickly. Remove from the heat.",
        "Meanwhile, in a large pot over high heat, bring 5 quarts (5 l) water to a rapid boil. Add the kosher salt and the pasta, stir well and cook, stirring occasionally, until al dente, according to the package directions.",
        "Drain the pasta and add it, still dripping wet, to the pan with the caramelized onions. Add the cheese and toss until well combined. Taste and adjust the seasoning with sea salt, then sprinkle liberally with pepper. Transfer the pasta to warmed individual shallow bowls. Top with the roasted squash and sprinkle with the bread crumbs. Serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "The Pasta Book,",
        "by Julia della Croce (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "9 Tbs. (4 1/2 fl. oz./140 ml) extra-virgin olive oil, plus more for\n  roasting squash",
        "6 yellow onions, halved through the stem end and sliced\n  lengthwise paper-thin",
        "Fine sea salt and freshly ground pepper, to taste",
        "1 piece butternut or calabaza squash, about 6 oz. (185 g),\n  peeled and cut into 1/2-inch (12-mm) dice",
        "1/4 cup (1 oz./30 g) fresh bread crumbs",
        "2 Tbs. kosher salt",
        "1 lb. (500 g) whole-wheat spaghetti or linguine",
        "1/4 cup (1 oz./30 g) grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Whole-Wheat Spaghetti with Roasted Squash",
    "url": "http://www.williams-sonoma.com/recipe/whole-wheat-spaghetti-squash.html"
}
