{
    "directions": [
        "Stir together bread crumbs, salt, and 1 tablespoon oil in a small bowl until combined well. Transfer to a 12-inch heavy skillet and cook over moderate heat, stirring, until crisp and golden, 3 to 5 minutes, then return to bowl.",
        "Heat remaining 1/4 cup oil in skillet over moderately high heat until hot but not smoking, then sauté cauliflower, stirring occasionally, until browned well, about 8 minutes.",
        "Add pancetta and sauté, stirring frequently, until just beginning to crisp, 2 to 3 minutes. Stir in garlic and red pepper flakes and sauté, stirring, 1 minute. Add broth, then reduce heat and simmer, partially covered, stirring occasionally, until cauliflower is tender and sauce is slightly reduced, about 7 minutes.",
        "While sauce simmers, cook linguine in a 6- to 8-quart pot of boiling salted water , uncovered, until al dente, then drain in a colander.",
        "Stir cheese into sauce and simmer 1 minute.",
        "Toss pasta with cauliflower mixture and parsley in a large bowl, then sprinkle with bread crumbs. Serve with additional cheese."
    ],
    "ingredients": [
        "1 cup coarse fresh bread crumbs (from 2 slices firm sandwich bread)",
        "1/4 teaspoon salt",
        "1/4 cup plus 1 tablespoon extra-virgin olive oil",
        "1 large head cauliflower (2 1/2 lb), cut into 1-inch-wide florets (8 cups)",
        "1/4 lb sliced pancetta, chopped (1 cup)",
        "4 garlic cloves, finely chopped",
        "1/4 teaspoon dried hot red pepper flakes",
        "1 1/2 cups reduced-sodium chicken broth",
        "3/4 lb dried whole-wheat linguine",
        "1/2 oz finely grated Parmigiano-Reggiano (1/4 cup) plus additional for serving",
        "1/3 cup chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Pork",
        "Vegetable",
        "Quick & Easy",
        "Bacon",
        "Cauliflower",
        "Whole Wheat",
        "Gourmet"
    ],
    "title": "Whole-Wheat Linguine with Cauliflower, Pancetta, and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-linguine-with-cauliflower-pancetta-and-parmesan-233256"
}
