{
    "directions": [
        "Stir 1 1/4 cups water and yeast in large bowl to blend. Stir in warm milk, honey, and salt, then melted butter. Add 1 1/2 cups whole wheat flour and stir vigorously with wood spoon until well incorporated. Add 1/2 cup rye flour, oat bran and cocoa powder and stir until well blended. Add enough bread flour, 1/2 cup at a time, to form moist and sticky dough, stirring vigorously with wood spoon until well incorporated. Mix in raisins and walnuts. Cover bowl with plastic wrap. For do-ahead version: Refrigerate dough overnight. For same-day version: Let dough rise in warm draft-free area until doubled in volume, about 1 hour (do not punch down dough).",
        "Spray 9x5x3-inch metal loaf pan with nonstick spray. Transfer dough to prepared pan, being careful not to deflate dough. Cover loaf pan loosely with plastic wrap. Let rise in warm draft-free area until dough is puffed and almost reaches top of pan, about 45 minutes for refrigerated dough and 20 minutes for room-temperature dough.",
        "Meanwhile, position rack in center of oven and preheat to 500°F. Generously spray inside of oven with water (about 8 sprays); immediately place bread in oven. Lower oven temperature to 400°F and bake bread until top is deep brown and crusty and tester inserted into center comes out clean, about 45 minutes. Cool in pan on rack 10 minutes. Turn bread out onto rack and cool completely."
    ],
    "ingredients": [
        "1 1/4 cups lukewarm water (85°F to 95°F)",
        "1 tablespoon active dry yeast (for do-ahead version) or quick-rising dry yeast (for same-day version)",
        "1 cup warm whole milk (105°F to 115°F)",
        "2 tablespoons honey",
        "1 tablespoon salt",
        "1/4 cup (1/2 stick) unsalted butter, melted, cooled slightly",
        "1 1/2 cups whole wheat flour",
        "1/2 cup rye flour",
        "1/2 cup oat bran",
        "1 tablespoon unsweetened cocoa powder",
        "2 1/2 cups (about) bread flour",
        "1/2 cup raisins",
        "1/2 cup chopped walnuts",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Nut",
        "Bake",
        "Dried Fruit",
        "Raisin",
        "Walnut",
        "Winter",
        "Whole Wheat"
    ],
    "title": "Whole Wheat Bread with Raisins and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-bread-with-raisins-and-walnuts-104690"
}
