{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Toss bread cubes and 2 tablespoons oil in large bowl. Spread in single layer on large rimmed baking sheet. Sprinkle with salt and freshly ground black pepper. Bake until bread cubes are golden and slightly crunchy, stirring occasionally, about 15 minutes. Cool slightly, then return bread cubes to same large bowl.",
        "Sauté pancetta in heavy large skillet over medium heat until crisp, adding oil if dry, about 6 minutes. Tilting skillet to allow pan drippings to accumulate at 1 end and using slotted spoon, transfer pancetta to bowl with bread cubes. Add chestnuts and shallots to drippings in skillet; sauté until beginning to brown, about 6 minutes. Add thyme and rosemary; stir 1 minute. Transfer mixture to bowl with bread. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Preheat oven to 375°F. Generously butter 13x9x2-inch glass baking dish. Boil 3 cups broth in medium saucepan until reduced to 1 1/2 cups, 6 to 8 minutes. Whisk eggs in another large bowl. Mix in cheese. Gradually whisk in broth. Pour broth mixture over chestnut-bread mixture. Sprinkle with black pepper and stir well.",
        "Transfer stuffing to prepared baking dish. Cover dish with foil and bake 25 minutes. Remove foil and bake uncovered until top is golden brown and slightly crisp around edges, about 20 minutes longer.",
        "Peeled cooked chestnuts; sold at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 1-pound loaf rustic whole wheat bread, cut (with crust) into 1/2- to 3/4-inch cubes (about 10 cups)",
        "2 tablespoons (or more) extra-virgin olive oil",
        "4 ounces 1/4-inch-thick slices pancetta (Italian bacon), cut into 1/4-inch cubes",
        "1 7.25-to 7.41-ounce jar whole steamed chestnuts or vacuum-packed roasted chestnuts,* broken into 1/2-inch pieces",
        "1 cup chopped shallots (about 4 large)",
        "1 teaspoon minced fresh thyme",
        "1/2 teaspoon minced fresh rosemary",
        "3 cups low-salt chicken broth",
        "2 large eggs",
        "1 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Rosemary",
        "Ham",
        "Thyme",
        "Chestnut",
        "Potluck",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Whole Wheat Stuffing with Pancetta, Chestnuts, and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/whole-wheat-stuffing-with-pancetta-chestnuts-and-parmesan-355780"
}
