{
    "directions": [
        "In blender, purée garlic, salt, cayenne pepper, and 2 teaspoons oil until smooth and creamy, about 2 minutes. Add yolks and lemon juice and blend until smooth. With motor running, very slowly add remaining 3/4 cups plus 2 tablespoons oil in thin, steady stream, blending until aïoli is thick, about 2 minutes. Refrigerate until ready to use.",
        "Position rack in center of oven; preheat to 400°F. Grease 13- by 9-inch roasting pan.",
        "In small saucepan over moderately high heat, combine garlic and 3 cups water and bring to boil. Drain and repeat process two more times. Set garlic aside.",
        "Whisk together olive oil, lemon juice, salt, pepper, and za'atar.",
        "Lay 1 fish on its side. Holding sharp paring knife at 30-degree angle from fish, cut 3 vertical 2 1/2-inch-long slits through skin and partially into flesh. Turn fish over and repeat in same manner. Repeat with other fish. Pat fish dry, then rub with seasoning mixture, being sure to tuck some into slits.",
        "Arrange tomato slices so they cover bottom of roasting pan. Lay fish on top and surround with thyme and rosemary. Roast, uncovered, 15 minutes.",
        "Fill medium bowl with cold water. Squeeze juice from lemons into water; add squeezed lemons.",
        "Using serrated knife, cut off artichoke stems and discard. Cut off top 1/2 inch of 1 artichoke. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until reaching pale yellow leaves with pale green tips. Cut off green tips. With sharp paring knife, trim dark-green fibrous parts from base and sides of artichoke. Halve artichoke lengthwise and use spoon to scoop out choke. Drop artichoke into lemon water. Trim remaining artichokes in same manner and keep in lemon water until ready to use.",
        "When fish has roasted 15 minutes, scatter garlic cloves across pan and continue to roast until fish is just cooked through, about 15 more minutes. Keep warm.",
        "In 4-quart heavy pot over moderate heat, heat oil until thermometer registers 350°F. Fry artichokes in batches (returning oil to 350°F between batches) until golden brown, about 8-10 minutes. Transfer fried artichokes to paper towels to drain, and immediately season with sea salt. Keep warm.",
        "Transfer fish to large platter and surround with tomatoes. Scatter artichokes over, and serve aïoli alongside."
    ],
    "ingredients": [
        "3 garlic cloves, coarsely chopped",
        "1/2 teaspoon salt",
        "Pinch cayenne pepper",
        "1 cup extra-virgin olive oil",
        "2 large egg yolks",
        "fresh lemon juice",
        "12 large garlic cloves, peeled",
        "1/4 cup extra virgin olive oil",
        "1/4 cup fresh lemon juice",
        "1 1/2 teaspoons sea salt (also called gros sel)",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons za'atar*",
        "2 (2-pound) whole red snappers, cleaned, leaving head and tail intact",
        "2 beefsteak tomatoes, cut into 1/3-inch thick slices",
        "1 bunch fresh thyme",
        "1 bunch rosemary",
        "2 lemons, halved",
        "12 baby artichokes",
        "3 cups olive oil",
        "Sea salt",
        "*Za'atar is also available at Middle Eastern Markets or online at penzeys.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Tomato",
        "Fry",
        "Roast",
        "Lemon",
        "Rosemary",
        "Snapper",
        "Artichoke",
        "Healthy",
        "Thyme"
    ],
    "title": "Whole Roasted Snapper with Artichokes and Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/whole-roasted-snapper-with-artichokes-and-aioli-235571"
}
