{
    "directions": [
        "In heavy medium pot, combine onions and enough water to cover and bring to boil, then strain. Return onions to pot and add sugar, red wine vinegar, and balsamic vinegar. Place over moderate heat and bring to simmer. Reduce heat to low, and cook, uncovered, stirring occasionally, until onions are completely tender and have no bite left, about one and a half hours. (The liquid should be syrupy and coat the onions.) Remove from heat and cool to room temperature.",
        "In food processor or blender, purée yolk, garlic, mustard, and vinegar until smooth and creamy, 1 to 2 minutes. Combine oils, then, with motor running, slowly drizzle into processor until completely emulsified, about 2 minutes. (If aïoli gets too thick, add a small amount of warm water, 1 teaspoon at a time.) Sprinkle in salt, pepper, and pepperoncini, cover with plastic wrap, and refrigerate until ready to use.",
        "Preheat oven to 350°F.",
        "In large, heavy skillet over moderate heat, cook 6 slices bacon, turning occasionally, until crisp, then transfer with tongs to paper towel–lined plate to drain. Repeat with remaining 6 slices. Set aside.",
        "Slice each ciabatta in half and place on large baking sheet. Place 4 ounces turkey on each of four ciabatta bottoms, then spread onion relish over meat. Lay 3 slices bacon on each of 4 ciabatta tops. Transfer baking sheet to oven and toast until bacon is crispy and edges of ciabatta turn light golden brown, about 5 minutes (the turkey does not have to get hot). Remove from oven and transfer bacon to other side of ciabatta, laying on top of onion relish. Divide avocado slices between sandwiches, placing on top of bacon. Spread aïoli evenly across each ciabatta top, close sandwiches, slice each in half, and serve."
    ],
    "ingredients": [
        "2 yellow onions, thinly sliced",
        "1/4 cup dark brown sugar",
        "1/2 cup red-wine vinegar",
        "1/2 cup balsamic vinegar",
        "1 egg yolk",
        "1/2 clove garlic, minced (about 1/2 teaspoon)",
        "1 teaspoon Dijon mustard",
        "1/2 ounce white-wine vinegar",
        "4 ounces grape seed oil",
        "1 ounce olive oil",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "1/8 teaspoon pepperoncini or cayenne pepper",
        "1 pound roasted turkey breast, sliced (use your thanksgiving leftovers!)",
        "4 ciabatta rolls",
        "12 slices bacon",
        "1 avocado, halved, pitted, peeled, and thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Blender",
        "Food Processor",
        "Onion",
        "turkey",
        "Vegetable",
        "Bake",
        "Picnic",
        "Super Bowl",
        "Lunch",
        "Bacon",
        "Avocado",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "'Wichcraft's Roasted Turkey, Avocado, Bacon, Onion Relish, & Aïoli on Ciabatta",
    "url": "http://www.epicurious.com/recipes/food/views/wichcrafts-roasted-turkey-avocado-bacon-onion-relish-aioli-on-ciabatta-236737"
}
