{
    "directions": [
        "Sift together 2 cups of cake flour and 2/3 cup of confectioners' sugar in a mixing bowl. Cut in the butter with a knife or pastry blender until the mixture resembles coarse crumbs. Stir 1/2 cup of water into the flour mixture until dough is formed. Cover and refrigerate for 20 minutes. Meanwhile, sift together 2 cups of cake flour with 2 tablespoons of confectioners' sugar in a small bowl. Knead in 1/2 cup shortening until dough is formed. Cover and refrigerate for 20 minutes.",
        "Boil the candied waxgourd in 1/2 cup of water until candy is nearly tender. Drain and place in a blender. Blend waxgourd to a paste. Sift sweet rice flour and superfine sugar together in a bowl, then mix in the sesame seeds. Stir in 1/4 cup shortening and waxgourd paste. Gradually stir in 2/3 cup of water, mixing until dough forms.",
        "Preheat an oven to 400 degrees F (200 degrees C). Line 2 baking sheets with parchment paper.",
        "Divide each dough mixture into 25 equal portions. Take one portion of the the butter dough and roll out in the shape of a circle. Wrap one portion of the shortening dough with the butter dough in the shape of a ball, then roll the combined ball into an oval shape. Roll the dough up, lengthwise, into a tube shape then roll out once more into a long strip. Roll the dough up lengthwise again, pressing the ends down to secure. Shape the dough into a circle and place the sweet rice flour dough into the center. Wrap the outer dough around the filling creating a ball. Flatten the pastry into a circle and place seam side down on the prepared baking sheet. Repeat with the remaining portions. Prick holes on the top of each pastry using a fork. Brush each pastry with egg yolk.",
        "Bake in the preheated oven until golden brown, about 20 minutes.  Cool in the pans for 10 minutes before removing to cool completely on a wire rack."
    ],
    "ingredients": [
        "2 cups cake flour",
        "2/3 cup confectioners' sugar",
        "1/4 cup butter",
        "1/2 cup water",
        "2 cups cake flour",
        "2 tablespoons confectioners' sugar",
        "1/2 cup vegetable shortening",
        "1 cup candied waxgourd",
        "1/2 cup water",
        "1 1/2 cups sweet rice flour (mochiko)",
        "3/4 cup superfine sugar",
        "1/4 cup sesame seeds, toasted",
        "1/4 cup vegetable shortening",
        "2/3 cup water",
        "1 egg yolk, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Wife Pastry (Lo Po Bang)",
    "url": "http://allrecipes.com/recipe/176531/wife-pastry-lo-po-bang/"
}
