{
    "directions": [
        "1. In a large cast-iron pot, sauté the onion in olive oil until translucent.",
        "2. Add the boar meat and brown. (That is, cook the meat over high heat, turning frequently, just until it's cooked on the outside.)",
        "3. Add the canned tomatoes and the bay leaves.",
        "4. Add the wine.",
        "5. Gradually add the garlic, dried chili, cinnamon stick, cloves, sun-dried tomatoes, anchovies (or anchovy paste), oregano, basil, sage, red wine vinegar, and salt and black pepper to taste.",
        "6. Simmer on low on the stovetop with the lid of the pot slightly ajar, and stir occasionally for at least two hours — or longer if possible. The longer you simmer this, the more tender the meat will become. The ragù is ready to eat when the meat has totally fallen apart and most of the liquid has been absorbed by the meat. Take out the cinnamon stick and bay leaves before serving.",
        "7. Serve over the pasta and top with grated cheese. Accompany with some crusty peasant bread and a good red wine, preferably a strong Italian, like Amarone or Barolo.",
        "Mangia!"
    ],
    "ingredients": [
        "1 large Spanish onion (chopped)",
        "2 tablespoons olive oil",
        "2 pounds boneless wild boar meat (cut for stew)",
        "1 can chopped tomatoes",
        "3 bay leaves",
        "1 cup red wine",
        "5 cloves garlic, crushed",
        "3 dried chili peppers (crushed)",
        "1 cinnamon stick",
        "5 cloves",
        "3 sun-dried tomatoes",
        "3 anchovies or 1 teaspoon anchovy paste",
        "Fresh or dried oregano, basil, and sage",
        "1 tablespoon red wine vinegar",
        "Salt and black pepper to taste",
        "N/A",
        "Pasta (pappardelle or fettuccine)",
        "Grated pecorino cheese (Parmigiano is an acceptable substitute, but pecorino, being sheep cheese, complements game)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fish",
        "Garlic",
        "Herb",
        "Onion",
        "Pasta",
        "Pepper",
        "Tomato",
        "Sauté",
        "Dinner",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wild Boar Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/wild-boar-ragu-238625"
}
