{
    "directions": [
        "Cook beans in large pot of boiling salted water until crisp-tender, about 4 minutes. Drain. Transfer to bowl of ice water; cool. Drain well. Pat dry with paper towel. (Can be made 1 day ahead. Cover and chill.)",
        "Whisk 4 tablespoons olive oil, vinegar and thyme in small bowl to blend. Season dressing to taste with salt and pepper. Set dressing aside.",
        "Heat remaining 3 tablespoons oil in heavy large skillet over medium-high heat. Add mushrooms and shallot; sauté until mushrooms are brown, about 8 minutes. Remove from heat. Mix in 2 tablespoons dressing. Season to taste with salt and pepper.",
        "Combine beans and baby greens in large bowl. Add remaining dressing; toss to coat. Season to taste with salt and pepper. Divide salad among 6 plates. Spoon warm mushroom mixture over. Sprinkle with goat cheese and serve."
    ],
    "ingredients": [
        "1/2 pound haricots verts or other slender green beans, trimmed",
        "7 tablespoons olive oil",
        "2 tablespoons balsamic vinegar",
        "1 tablespoon chopped fresh thyme",
        "1 pound assorted fresh wild mushrooms (such as oyster, crimini and stemmed shiitake), sliced",
        "1 large shallot, chopped",
        "1 5-ounce bag mixed baby greens",
        "3 ounces soft mild goat cheese (such as Montrachet), crumbled (about 3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Dairy",
        "Mushroom",
        "Vegetable",
        "Appetizer",
        "Side",
        "Goat Cheese",
        "Green Bean",
        "Fall",
        "Summer",
        "Portland",
        "Maine",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Wild Mushroom and Green Bean Salad with Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-and-green-bean-salad-with-goat-cheese-104051"
}
