{
    "directions": [
        "Heat 2 tablespoons oil in heavy medium saucepan over medium heat. Add onion and sauté until tender, about 5 minutes. Add rice and allspice and stir 30 seconds. Add 1 1/2 cups water and currants and bring to boil. Reduce heat to low, cover and simmer until water is absorbed and rice is tender, about 20 minutes. Remove from heat.",
        "Heat 1 tablespoon oil in heavy small skillet over medium-low heat. Add pine nuts and sauté until golden brown, about 6 minutes. Mix nut mixture into rice. Season with salt and pepper.",
        "Bring large pot of water to boil. Add grape leaves and stir to separate. Turn off heat; let stand 1 minute. Drain. Rinse with cold water to cool; drain well.",
        "Cover bottom of heavy large skillet or Dutch oven with about 10 grape leaves, pressing about 1 inch up sides of skillet. Arrange 1 leaf, vein side up, on work surface. Place 1 rounded tablespoon rice filling near stem. Fold in sides, then roll up jelly roll fashion. Repeat with remaining filling and leaves. Arrange stuffed leaves, seam side down, close together in leaf-lined skillet. Drizzle 3 tablespoons oil over. Add 1/4 cup water and fresh lemon juice. Bring to boil. Reduce heat to medium-low, cover and cook 50 minutes. Cool completely. (Grape leaves can be made 1 day ahead. Cover and refrigerate.)",
        "Arrange stuffed grape leaves on platter. Garnish with lemon and parsley."
    ],
    "ingredients": [
        "6 tablespoons olive oil",
        "1 onion, chopped",
        "2/3 cup (about 4 1/2 ounces) Uncle Ben's Long Grain and Wild Rice",
        "1/2 teaspoon ground allspice",
        "1 1/2 cups water",
        "1/4 cup dried currants",
        "1/4 cup pine nuts",
        "1 8-ounce jar grape leaves,* drained",
        "1/4 cup water",
        "1/4 cup fresh lemon juice",
        "Fresh lemon wedges",
        "Chopped fresh parsley",
        "*Available at Greek, Middle Eastern and most Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Appetizer",
        "Low/No Sugar",
        "Summer",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Wild Rice-Stuffed Grape Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-stuffed-grape-leaves-2333"
}
