{
    "directions": [
        "Rinse rice in strainer under cold water; drain. Bring 6 cups water and 2 teaspoons coarse salt to boil in large saucepan. Add rice; bring to boil. Reduce heat; simmer uncovered until rice grains begin to split and are tender but still slightly chewy, about 45 minutes. Drain. Spread on rimmed baking sheet to cool. Transfer to bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 350°F. Oil rimmed baking sheet. Toss squash cubes and 3 tablespoons oil in medium bowl. Spread squash in single layer on prepared sheet; sprinkle with salt and pepper. Roast just until tender but firm enough to hold shape, stirring occasionally, about 15 minutes. Transfer squash to bowl. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Melt 4 tablespoons butter in large skillet over medium heat. Add leeks and 3/4 cup water; simmer until leeks are tender, about 7 minutes. Add corn; simmer 2 minutes longer. Add rice and butternut squash; simmer until heated through and liquid is absorbed, about 4 minutes. Stir in 2 tablespoons butter and parsley. Season with salt and pepper. Transfer to bowl and serve."
    ],
    "ingredients": [
        "1 1/2 cups wild rice (about 9 ounces)",
        "2 teaspoons coarse kosher salt",
        "3 cups 1/2-inch cubes peeled butternut squash (from 11/2-pound squash)",
        "3 tablespoons olive oil",
        "6 tablespoons (3/4 stick) butter, divided",
        "1 1/2 cups finely chopped leeks (white part only)",
        "1 1/2 cups frozen white corn kernels, thawed",
        "1 tablespoon chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Leek",
        "Corn",
        "Butternut Squash",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Wild Rice",
        "Simmer",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Wild Rice with Butternut Squash, Leeks, and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-with-butternut-squash-leeks-and-corn-350425"
}
