{
    "directions": [
        "Cook shallots and garlic in oil in a 4- to 5-quart heavy pot over moderately low heat, stirring occasionally, until golden brown, about 10 minutes. Add rice and cook, stirring, until it releases a nutty aroma, about 3 minutes. Add broth and water and bring to a boil, stirring occasionally, then reduce heat and simmer, covered, until rice is tender (grains will split open), about 1 1/4 hours.",
        "Meanwhile, preheat broiler.",
        "Halve bell peppers lengthwise, then discard stems and seeds. Put peppers, cut sides down, in 1 layer in an oiled shallow baking pan. Broil 2 inches from heat until charred and softened, 15 to 18 minutes. Transfer to a bowl. Cover and let steam 15 minutes. Peel, then cut into 1/2-inch pieces.",
        "Melt butter in a 12-inch heavy skillet over moderate heat, then add almonds and cook, stirring, until golden, 5 to 8 minutes.",
        "Remove rice from heat and drain well, then return to pot. Stir in salt, pepper, red peppers, almonds, and vinegar. Transfer to a serving dish."
    ],
    "ingredients": [
        "1/4 pound shallots (about 4 medium), thinly sliced crosswise into rounds",
        "4 garlic cloves, thinly sliced crosswise",
        "2 tablespoons olive oil",
        "2 cups wild rice (11 ounces), rinsed and drained",
        "3 1/2 cups reduced-sodium chicken broth (28 fluid ounces)",
        "3 1/2 cups water",
        "2 red bell peppers",
        "1 tablespoon unsalted butter",
        "1 cup sliced almonds with skins (3 1/2 ounces)",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon Sherry vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Broil",
        "Christmas",
        "Thanksgiving",
        "Almond",
        "Bell Pepper",
        "Fall",
        "Healthy",
        "Christmas Eve",
        "Shallot",
        "Wild Rice",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Wild Rice with Roasted Peppers and Toasted Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-with-roasted-peppers-and-toasted-almonds-236380"
}
