{
    "directions": [
        "Roll the dough into a 1/8-inch-thick rectangle on a floured surface and with a floured 3 1/2-inch-long oval cutter cut 20 ovals from it. Fit ovals into 20 lightly oiled 3 3/4-inch-long barqutte tins and chill the tartlet shells for 30 minutes. Weight the shells with empty barquette tins or line them with foil, fill the tins or foil with the rice and bake the shells in a jelly-roll pan in the lower third of a preheated 425°F. oven for 10 minutes. Remove the rice and tins or foil carefully, bake the shells for 5 to 10 minutes more, or until they are golden, and let them cool in the pan on a rack.",
        "In a bowl let the porcini soak in boiling water to cover for 30 minutes or until they are softened, drain them, reserving the soaking liquid for another use, and discard any tough stems. In a large skillet cook the shallots in the butter over moderately low heat, stirring, until they are softened. In a food processor chop fine the porcini with the white mushrooms, add the mixture to the shallot mixture, and stir in the tarragon. Cook the mixture, stirring, until the liquid the mushrooms give off is evaporated, stir in the flour, and cook the mixture, stirring, for two minutes. Stir in the Sherry, the sour cream, the lemon juice, and salt and pepper to taste and cook the filling, stirring for 5 minutes, or until thickened. Remove the skillet from the heat and let the filling cool. The filling may be prepared up to this point 2 days ahead and kept covered and chilled.",
        "Stir the parsley into the filling and divide the filling among the shells, smoothing the tops. Bake the tartlets in the lower third of a preheated 375°F. oven for 10 minutes, or until heated through, arrange 2 of the enoki-dake, trimmed, on each tartlet, and bake the tartlets for 2 minutes more. Loosen the tartlets from the tins with the tip of a small sharp knife and transfer them carefully to serving plates."
    ],
    "ingredients": [
        "pâte brisée",
        "raw rice for weighting the shells",
        "1 ounce dried porcini or cèpes",
        "1/4 pound shallots, minced",
        "3 tablespoons unsalted butter",
        "1 pound small white mushrooms",
        "1/2 teaspoon dried tarragon, crumbled",
        "2 tablespoons all-purpose flour",
        "3 tablespoons medium-dry Sherry",
        "1/2 cup sour cream",
        "fresh lemon juice to taste",
        "1/4 cup minced fresh parsley leaves",
        "a 3 1/2-ounce package enoki-dake mushrooms"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Sherry",
        "Sour Cream",
        "Shallot",
        "Gourmet"
    ],
    "title": "Wild Mushroom Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-tartlets-101580"
}
