{
    "directions": [
        "In a medium sauté pan over moderate heat, warm the oil. Add the onions and shallot and sauté, stirring occasionally, until soft. Season with salt, add the heavy cream, and continue to cook, stirring occasionally, about 5 minutes. Transfer the onion mixture to a food processor or blender and process until smooth.",
        "In a medium sauté pan over high heat, warm the walnut oil. Add the mushrooms, in batches if necessary, and sauté, stirring occasionally, until the liquid released by the mushrooms is evaporated, about 5 minutes. Add the sage, season with salt, and continue to cook, stirring occasionally, until the mushrooms are golden and tender.",
        "Preheat the oven to 425°F.",
        "Arrange the beets in a large, deep baking dish and drizzle with the oil. Add enough water to reach about 1/4 inch up the sides of the baking dish. Cover with foil and roast until the beets are tender, about 45 minutes. Once the beets are cool enough to handle, peel them and cut them into quarters. Transfer the beets to a medium bowl, add lemon zest, lemon juice, and chives, season with salt, and toss to combine.",
        "Preheat the oven to 375°F.",
        "Arrange the pumpkin seeds on a large, rimmed baking sheet, drizzle with walnut oil, and toss to combine. Roast until toasted, about 10 minutes, then toss with salt.",
        "Fill a large bowl with ice water.",
        "In a large pot of boiling salted water, blanch the peas until just tender. Drain, then immediately plunge the peas into the ice water to stop cooking. Drain the peas again and pat them dry.",
        "In a large bowl combine the mushrooms, beets, peas, goat cheese, and onion purée and toss to combine. Divide the salad among 4 plates, sprinkle with toasted pumpkin seeds, and serve."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "5 cipollini onions, peeled and cut into quarters",
        "1/2 medium shallot, minced",
        "Salt",
        "5 tablespoons heavy cream",
        "3 tablespoons walnut oil",
        "2 ounces fresh chanterelle mushrooms, cleaned and trimmed",
        "2 ounces fresh black trumpet mushrooms, cleaned and trimmed",
        "2 ounces fresh royal trumpet mushrooms, cleaned, trimmed, and cut into quarters",
        "4 sprigs fresh sage",
        "Salt",
        "8 medium red beets, trimmed and scrubbed",
        "8 medium golden beets, trimmed and scrubbed",
        "1/4 cup olive oil",
        "Zest and juice of 1 Meyer lemon",
        "2 tablespoons minced fresh chives",
        "Salt",
        "1/4 cup pumpkin seeds",
        "2 tablespoons walnut oil",
        "Salt",
        "20 English peas, shelled",
        "Salt",
        "1/4 cup goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mushroom",
        "Onion",
        "Goat Cheese",
        "Beet",
        "Summer"
    ],
    "title": "Wild Mushroom, Roasted Beet, and Goat Cheese Salad with Onion Purée",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-roasted-beet-and-goat-cheese-salad-with-onion-puree-51181400"
}
