{
    "directions": [
        "Melt 3 tablespoons butter with 2 tablespoons grapeseed oil in heavy large skillet over medium heat. Add onions and sauté until golden, about 45 minutes. Season with salt and pepper.",
        "Melt remaining 4 tablespoons butter with 1 teaspoon grapeseed oil in another heavy large skillet over medium-high heat. Add mushrooms, garlic, and shallot. Sauté 4 minutes. Add wine and simmer until almost all liquid is absorbed, stirring frequently, about 13 minutes. Add rosemary; season with salt and pepper.",
        "Position rack in bottom third of oven. Place heavy 17x11-inch baking sheet on rack (invert if rimmed). Preheat oven to 500°F at least 30 minutes before baking. Roll out 2 dough disks on lightly floured surface to 8-inch rounds, allowing dough to rest a few minutes if it springs back. Sprinkle another baking sheet (invert if rimmed) with cornmeal. Transfer 1 dough round to second baking sheet. Lightly brush dough with garlic oil. Sprinkle with 1/2 cup cheese. Scatter 2 1/2 tablespoons onions over cheese. Scatter 1/2 cup mushrooms over onions. Sprinkle with salt.",
        "Position baking sheet with pizza at far edge of 1 side of hot baking sheet. Tilt sheet and pull back slowly, allowing pizza to slide onto hot sheet. Repeat with second dough disk, garlic oil, cheese, onions, mushrooms, and salt, and slide second pizza onto second half of hot baking sheet. Bake pizzas 6 minutes. Rotate pizzas half a turn. Bake until crust is deep brown, about 6 minutes longer. Using large spatula, carefully transfer pizzas to cutting board. Let rest 1 minute. Slice into wedges and serve. Repeat with remaining ingredients."
    ],
    "ingredients": [
        "7 tablespoons butter, divided",
        "2 tablespoons plus 1 teaspoon grapeseed oil",
        "3 onions, halved lengthwise, thinly sliced crosswise (about 6 cups)",
        "2 pounds assorted wild mushrooms (such as crimini, oyster, chanterelle, and stemmed shiitake), cut into bite-size pieces",
        "6 garlic cloves, minced",
        "2 tablespoons minced shallot (about 1 medium)",
        "2 cups dry white wine",
        "1 tablespoon minced fresh rosemary",
        "Pizza Dough",
        "Cornmeal (for dusting)",
        "Garlic oil",
        "3 cups grated Fontina cheese (about 10 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Mushroom",
        "Onion",
        "Bake",
        "Vegetarian",
        "Rosemary",
        "White Wine",
        "Fall",
        "Fontina"
    ],
    "title": "Wild Mushroom Pizza With Caramelized Onions, Fontina, and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-pizza-with-caramelized-onions-fontina-and-rosemary-230633"
}
