{
    "directions": [
        "Place wild rice in heavy medium saucepan. Add enough cold water to cover rice by 3 inches. Bring to boil. Reduce heat to medium-low and simmer until rice is almost tender, about 45 minutes. Drain.",
        "Meanwhile, melt 1 tablespoon butter with 1 tablespoon oil in heavy large pot over medium-high heat. Add shiitakes; sauté until brown, about 7 minutes. Transfer to large bowl. Add 1 tablespoon butter and 1 tablespoon oil to same pot; heat over medium-high heat. Add oyster mushrooms; sauté until brown, about 5 minutes. Transfer to bowl with shiitakes.",
        "Add 1 tablespoon butter and 1 tablespoon oil to same pot; heat over medium heat. Add onions to pot; sauté until golden and very tender, about 20 minutes. Add chile; stir 1 minute. Add remaining 1 tablespoon butter and 1 tablespoon oil to pot; add brown rice and stir 2 minutes. Add wild rice, broth, bay leaves, and 1 teaspoon coarse salt; bring to boil. Reduce heat to medium; cover and simmer until all rice is tender and liquid is absorbed, 35 to 40 minutes. Fluff rice mixture with fork. Stir in mushrooms and parsley. Season to taste with more salt and pepper. Stir briefly over medium heat until heated through. Transfer to large bowl.",
        "Available at many supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "2 cups wild rice (about 12 ounces)",
        "4 tablespoons (1/2 stick) butter, divided",
        "4 tablespoons extra-virgin olive oil, divided",
        "12 ounces fresh shiitake mushrooms, stemmed, sliced",
        "12 ounces oyster mushrooms, sliced",
        "2 large onions, chopped (about 4 cups)",
        "1 large dried ancho chile,* stemmed, seeded, finely chopped",
        "2 cups brown basmati rice",
        "5 cups low-salt chicken broth",
        "3 bay leaves (preferably fresh)",
        "1 teaspoon (or more) coarse kosher salt",
        "1/4 cup chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Low Fat",
        "High Fiber",
        "Dinner",
        "Fall",
        "Healthy",
        "Low Cholesterol",
        "Christmas Eve",
        "Potluck",
        "Brown Rice",
        "Wild Rice",
        "Chile Pepper",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Wild Rice and Mushroom Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-and-mushroom-stuffing-355779"
}
