{
    "directions": [
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into an 11-inch round and fit into tart pan, trimming excess dough. Chill until firm, about 30 minutes.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Lightly prick bottom of shell all over with a fork, then line with foil and fill with pie weights. Bake until side is set and edge is pale golden, 18 to 20 minutes. Carefully remove foil and weights and bake shell until bottom is golden, 10 to 15 minutes more.",
        "Cool completely in pan on a rack, about 15 minutes.",
        "Heat butter and oil in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté mushrooms, shallot, thyme, 1/2 teaspoon salt, and 1/4 teaspoon pepper, stirring frequently, until mushrooms are tender and any liquid given off is evaporated, 8 to 10 minutes. Transfer to a bowl and cool to room temperature.",
        "Whisk together crème fraîche, heavy cream, whole egg, yolk, and remaining 1/4 teaspoon salt and 1/8 teaspoon pepper in a medium bowl until combined.",
        "Reduce oven temperature to 325°F.",
        "Scatter mushrooms evenly in tart shell and pour custard over them. Bake tart in pan on a baking sheet until custard is just set and slightly puffed, 35 to 45 minutes.",
        "Cool tart in pan on rack at least 20 minutes, then remove side of pan. Serve tart warm or at room temperature."
    ],
    "ingredients": [
        "Pastry dough",
        "1 tablespoon unsalted butter",
        "1 tablespoon vegetable oil",
        "3/4 pound mixed fresh wild mushrooms such as cremini, oyster, and chanterelle, quartered lengthwise",
        "2 tablespoons finely chopped shallot",
        "1 teaspoon chopped fresh thyme",
        "3/4 teaspoon salt",
        "3/8 teaspoon black pepper",
        "1/2 cup crème fraîche",
        "1/2 cup heavy cream",
        "1 whole large egg",
        "1 large egg yolk",
        "Special equipment: a 9- by 1-inch round fluted tart pan with a removable bottom; pie weights or raw rice",
        "1 pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Mushroom",
        "Bake",
        "Vegetarian",
        "Fall",
        "Gourmet"
    ],
    "title": "Wild Mushroom Tart",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-tart-230762"
}
