{
    "directions": [
        "To make the pizza dough, in a food processor, combine the flours, yeast, sugar and salt. Pulse to mix the ingredients. With the motor running, add the water and olive oil in a steady stream, and then pulse until the dough comes together in a rough mass, about 12 seconds. If the dough does not form into a ball, sprinkle with 1 to 2 tsp. water and pulse again until a rough mass forms. Let the dough rest for 5 to 10 minutes.",
        "Process the dough again for 25 to 30 seconds, steadying the top of the food processor with one hand. The dough should be tacky to the touch but not sticky. Transfer the dough to a lightly floured work surface and form into a smooth ball. Place the dough in a large oiled bowl, turn to coat with oil and cover with plastic wrap. Let the dough rise in a warm place until doubled in bulk and spongy, about 1 1/2 hours.",
        "While the dough is rising, make the tomato sauce. In a small fry pan over medium heat, warm the olive oil. Add the garlic and cook, stirring frequently, until fragrant, 1 to 2 minutes. Be careful not to let the garlic brown or it will turn bitter.",
        "In a bowl, stir together the garlic-oil mixture, tomatoes, dried basil, oregano, thyme, pepper, 1/3 cup (3 fl. oz./80 ml) water and 1 1/2 Tbs. of the vinegar. Season to taste with salt and additional vinegar. Set aside 1 cup (8 fl. oz./250 ml) to use for the pizza. The remaining 1 3/4 cups (14 fl. oz./440 g) can be refrigerated in an airtight container for up to 1 week.",
        "Turn the dough out onto a lightly floured work surface, punch it down, and shape into a smooth cylinder. Divide into 2 equal pieces. Shape each piece into a smooth ball, dusting with flour only if the dough becomes sticky. Cover both balls of dough with a clean kitchen towel and let rest for 10 minutes. Unless you are doubling this recipe to make two pizzas, place the second ball in a gallon-size sealable plastic bag and freeze for up to 2 months. (When ready to use, thaw the frozen dough for 3 to 4 hours at room temperature.)",
        "Place a pizza stone in the middle of the oven and preheat to 450°F (230°C). Once the oven has reached 450°F (230°C), let the stone continue to heat for 15 to 30 minutes longer, without opening the door.",
        "In a fry pan over medium-high heat, warm 3 Tbs. of the olive oil. Add the garlic and sauté just until it begins to soften but not brown, about 1 minute. Then add the mushrooms, season with salt and pepper and sauté until soft, about 4 minutes. Add the remaining 1 Tbs. olive oil and the kale and stir to coat the kale with the oil. Sauté just until the kale begins to wilt, about 2 minutes. Taste and adjust the seasoning.",
        "Remove from the heat and set aside.",
        "On a floured pizza peel, stretch or roll out the pizza dough into a 12-inch (30-cm) round. If the dough springs back, let it rest for about 10 minutes before continuing. Leaving a 1-inch (2.5-cm) border, spread the sauce over the dough round and top with the cheese. Distribute the mushroom and kale mixture evenly around the pizza. Brush the outside edge of the dough with olive oil and season the whole pizza lightly with salt and pepper.",
        "Carefully slide the pizza from the peel onto the hot stone in the oven and bake for 10 to 12 minutes, or until the crust is golden brown. Using the peel, transfer the pizza to a cutting board. Let cool for a few minutes, then slice and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Pizza Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "3 1/3 cups (17 oz./530 g) all-purpose flour, plus more for dusting",
        "1/4 cup (1 1/2 oz./45 g) whole-wheat flour",
        "1 package (2 1/2 tsp.) quick-rise yeast",
        "1 Tbs. sugar",
        "1 Tbs. kosher salt",
        "1 1/4 cups (10 fl. oz./310 ml) warm water (110°F/43°C), plus more as needed",
        "2 Tbs. olive oil, plus more as needed",
        "1/4 cup (2 fl. oz./60 ml) olive oil",
        "5 garlic cloves, minced",
        "1 can (15 oz./470 g) crushed tomatoes",
        "1 tsp. dried basil",
        "3/4 tsp. dried oregano",
        "1/4 tsp. dried thyme",
        "1/4 tsp. freshly ground pepper",
        "1 1/2 to 2 Tbs. red wine vinegar",
        "Kosher salt",
        "4 Tbs. (2 fl. oz./60 ml) olive oil, plus more for brushing",
        "2 garlic cloves, minced",
        "5 oz. (155 g) wild mushrooms such as cremini, shiitake or oyster or a mixture",
        "Kosher salt and freshly ground pepper",
        "5 oz. (155 g) baby kale or stemmed and chopped regular kale",
        "1 1/2 cups (6 oz./185 g) shredded fontina cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Wild Mushroom, Kale and Fontina Pizza",
    "url": "http://www.williams-sonoma.com/recipe/wild-mushroom--kale-and-fontina-pizza.html"
}
