{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium heat. Add shallots, tomatoes, garlic, basil, 2 teaspoons thyme and rosemary; sauté 2 minutes. Add mushrooms; sauté until very tender, about 15 minutes. Remove from heat. Season with salt and pepper. Cool.",
        "Preheat oven to 400°F. Butter baking sheet. Melt 3 tablespoons butter in small saucepan. Place kitchen towel on work surface. Top with 1 phyllo sheet (keep remaining phyllo sheets covered with plastic wrap and damp towel). Brush with melted butter. Top with phyllo sheet; brush with butter. Sprinkle with 1/2 teaspoon thyme. Repeat layering with 2 more phyllo sheets, brushing with butter and sprinkling with remaining 1/2 teaspoon thyme. Top with another phyllo sheet; brush with butter.",
        "Starting 1 1/2 inches in from 1 long side and 2 inches in from each short side, spoon mushroom mixture onto phyllo in 2 1/2-inch-diameter log parallel to long sides. Fold short sides over filling; brush folded edges with butter. Using towel as aid and starting on long side nearer filling, roll up strudel jelly-roll style. Using spatula, transfer strudel to prepared baking sheet, seam side down. Brush strudel with butter. Freeze 5 minutes.",
        "Bake strudel until golden brown, about 15 minutes. Cut strudel into slices. Serve with Arugula Pesto."
    ],
    "ingredients": [
        "5 tablespoons butter",
        "1/4 cup chopped shallots",
        "2 tablespoons chopped drained oil-packed sun-dried tomatoes",
        "2 large garlic cloves, minced",
        "1 tablespoon chopped fresh basil",
        "3 teaspoons chopped fresh thyme",
        "1 teaspoon minced fresh rosemary",
        "28 ounces assorted wild mushrooms (such as stemmed shiitake, oyster, button, crimini or portobello), sliced",
        "5 sheets fresh phyllo pastry or frozen, thawed",
        "Arugula Pesto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Tomato",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Fall",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Wild Mushroom Strudel with Arugula Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-strudel-with-arugula-pesto-15680"
}
