{
    "directions": [
        "Position oven rack 8 inches from broiler heat source; preheat broiler. Heat oil in 10-inch-diameter nonstick ovenproof skillet over medium-high heat. Add mushrooms and sauté just until golden, about 4 minutes. Reduce heat to medium. Stir in garlic. Cook until mushrooms are tender, about 6 minutes longer.",
        "Whisk eggs, grated Parmesan, fresh mint and 1/2 teaspoon salt in medium bowl to blend. Pour egg mixture evenly over mushrooms in skillet. Cook mixture until sides and bottom are set but center is still loose, running rubber spatula around sides of skillet occasionally but not allowing uncooked mixture to run under cooked eggs, about 3 minutes. Broil until mixture is just set on top and cooked through, about 2 minutes. Cool 2 minutes. Run spatula around sides of skillet to loosen frittata. Place plate atop skillet. Invert frittata onto plate. Cool frittata to room temperature. (Can be prepared 2 hours ahead. Cover frittata and store at room temperature.) Cut frittata into wedges and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 pound assorted fresh wild mushrooms, thinly sliced",
        "1 garlic clove, minced",
        "6 large eggs",
        "1/4 cup freshly grated Parmesan cheese (about 3/4 ounce)",
        "4 teaspoons minced fresh mint",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Herb",
        "Mushroom",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Lunch",
        "Parmesan",
        "Mint",
        "Fall",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Wild Mushroom Frittata with Fresh Mint",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-frittata-with-fresh-mint-103420"
}
