{
    "directions": [
        "1. Preheat the broiler with the rack in the second position from the top.",
        "2. In a medium bowl, whisk together the eggs, milk, 1/2 tsp salt, a few grinds of pepper, the nutmeg, and cayenne.",
        "3. In a 12-in/30.5-cm ovenproof skillet over medium-high heat, melt the butter. When the butter is melted and hot, add the potatoes and a sprinkle of salt and pepper. Cook the potatoes, stirring every now and then, until they begin to soften, about 3 minutes. Add the green onions, mushrooms, garlic, thyme, and another sprinkle of salt and pepper and continue to cook and stir until the mushrooms have given off their liquid and are dry, about 4 minutes. Add the peas and cook until all of the veggies are tender and the peas are warmed through, another minute or two. Taste and adjust the seasoning. Spread the filling evenly over the bottom of the pan and sprinkle the cheese over the top.",
        "4. Pour the eggs evenly over the vegetables in the pan and reduce the heat to low. Cover the pan and cook for 2 minutes, then remove the lid and transfer the pan to the broiler. Broil the frittata until the top is lightly browned and the eggs have firmed up in the center, about 4 minutes. To test, press the center of the frittata lightly with your finger. If it feels firm, it's done.",
        "5. Remove the frittata from the oven and let it rest for 3 minutes on a wire rack on the countertop to continue to firm up before cutting it into wedges. It will be puffy when it comes out of the oven but will deflate and become firmer as it cools. Serve the frittata hot or at room temperature."
    ],
    "ingredients": [
        "6 large eggs",
        "2 tbsp milk or water",
        "Salt and freshly ground black pepper",
        "Pinch of freshly grated nutmeg",
        "Pinch of cayenne pepper",
        "2 tbsp unsalted butter",
        "3 new potatoes, scrubbed and cut into 1/4-in/6-mm dice",
        "4 green onions, white and tender green parts, thinly sliced",
        "10 oz/280 g mixed wild mushrooms (see \"It's that easy\"), such as cremini, shiitake, and oyster, brushed clean and sliced",
        "1 garlic clove, minced",
        "1 tsp minced fresh thyme",
        "1/2 cup/70 g frozen peas, thawed",
        "1/2 cup/55 g shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Broil",
        "Vegetarian",
        "Dinner",
        "Cheddar",
        "Legume",
        "Pea",
        "Green Onion/Scallion",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Wild Mushroom Frittata with Cheddar, Green Onions, and Peas",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-frittata-with-cheddar-green-onions-and-peas-51171410"
}
