{
    "directions": [
        "Submerge porcini mushrooms in 3 quarts cold water in a large bowl. Let stand at room temperature at least 2 hours or chill overnight.",
        "Pour mushrooms and liquid into a fine-mesh sieve set over a wide heavy pot, gently pressing mushrooms to extract as much liquid as possible. Reserve mushrooms for another use.",
        "Add garlic, thyme, bay leaves, and peppercorns to pot and bring to a simmer over medium-high heat. Reduce heat to medium-low and gently simmer, stirring occasionally, until broth is reduced to 6 cups, about 1 hour. Strain broth through fine-mesh sieve into a large bowl; discard solids. Return broth to pot.",
        "Cook noodles in a large pot of boiling salted water, stirring occasionally, until just al dente, 7–8 minutes. Drain; rinse under cold water.",
        "Meanwhile, bring Mushroom Broth to a simmer over medium-high heat. Add wild mushrooms, carrots, celery stalks, scallion whites, 1 tsp. salt, and 1/8 tsp. pepper; simmer until tender, about 5 minutes.",
        "Add noodles and scallion greens to soup; season with salt and pepper. Transfer to a large serving bowl and top with celery leaves.",
        "Soup (without noodles) can be made 3 days ahead. Let cool, transfer to an airtight container, and chill."
    ],
    "ingredients": [
        "1 1/2 ounces dried porcini mushrooms",
        "6 garlic cloves, gently smashed",
        "1 small bunch thyme",
        "2 bay leaves",
        "1/2 teaspoon whole black peppercorns",
        "1 1/2 cups medium egg noodles",
        "Kosher salt",
        "12 ounces wild mushrooms, cut into 1/4\" pieces if large",
        "2 medium carrots, peeled, cut into 1/8\"-thick slices",
        "2 stalks celery, cut into 1/8\"-thick slices",
        "3 scallions, thinly sliced, green and white parts separated",
        "Freshly ground black pepper",
        "2 tablespoons celery leaves, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Soup/Stew",
        "Kid-Friendly",
        "Healthy",
        "Low Fat",
        "Vegetarian"
    ],
    "title": "Wild Mushroom Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-noodle-soup"
}
