{
    "directions": [
        "Heat oil in a large saucepan over medium heat. Add chopped celery and onion; cook, stirring occasionally, until softened and almost translucent, about 8 minutes. Stir in garlic; cook, stirring often, until fragrant, about 2 minutes. Add wild rice; stir for 1 minute. Add broth, bay leaf, 1 teaspoon salt, and 1 1/2 cups water; increase heat and bring to a boil. Reduce heat to medium-low, cover, and simmer for 30 minutes. Uncover, stir, and continue cooking, uncovered, stirring occasionally, until liquid is absorbed and rice is tender, 20-40 minutes.",
        "Meanwhile, preheat oven to 325°F. Spread out pecans on a rimmed baking sheet. Toast until fragrant, 5-7 minutes. Let cool; coarsely chop. DO AHEAD: Can be made 1 day ahead. Store nuts airtight at room temperature. Let stuffing cool, then cover and chill. Rewarm over medium heat, adding water by tablespoonfuls if too dry, before continuing.",
        "Discard bay leaf. Stir in dried cranberries, apricots, and raisins. Let sit, covered, for 5 minutes.",
        "Season rice to taste with salt and pepper. Fold pecans, sliced cranberries, and sliced celery into mixture. Garnish with celery leaves."
    ],
    "ingredients": [
        "1 1/2 tablespoons olive oil",
        "3 large celery stalks, finely chopped",
        "1 cup finely chopped onion",
        "1 garlic clove, thinly sliced",
        "1 1/2 cups wild rice",
        "2 cups low-salt chicken or turkey broth",
        "1 bay leaf",
        "1 teaspoon kosher salt plus more",
        "3/4 cup (3 ounces) pecans",
        "1/2 cup dried cranberries",
        "1/4 cup (about 3 ounces) dried apricots, coarsely chopped",
        "1/4 cup (about 2 1/2 ounces) golden raisins",
        "Freshly ground black pepper",
        "1/2 cup (about 4 ounces) fresh cranberries, thinly sliced",
        "1 1/2 cups thinly sliced small celery stalks (from celery heart)",
        "1/2 cup celery leaves from celery heart, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Side",
        "Thanksgiving",
        "Dinner",
        "Stuffing/Dressing",
        "Cranberry",
        "Apricot",
        "Pecan",
        "Fall",
        "Healthy",
        "Low Cholesterol",
        "Wild Rice",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wild Rice, Fruit, and Pecan Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-fruit-and-pecan-stuffing-368309"
}
