{
    "directions": [
        "Sprinkle gelatin over 1 tablespoon water in a small bowl and let stand to soften.",
        "Beat cream in a bowl with an electric mixer until it just holds soft peaks, then chill, covered.",
        "Stir together honey, sugar, salt, and remaining 2 tablespoons water in a 1- to 1 1/2-quart heavy saucepan and bring to a boil over moderate heat, stirring occasionally until sugar is dissolved. Boil, undisturbed, until mixture registers 238°F on thermometer (soft-ball stage; you may need to tilt pan to get temperature; see cooks' note, below), about 4 minutes.",
        "Beat yolks in a medium bowl with cleaned beaters at high speed until they are thick and pale, about 4 minutes. Reduce speed to medium and pour hot honey mixture in a slow stream into yolks (try to avoid beaters and side of bowl). Reserve pan. Immediately add gelatin mixture to hot honey pan, swirling until dissolved, then beat liquid gelatin into yolk mixture and continue to beat until mixture is pale, thick, and completely cool, 3 to 5 minutes.",
        "Fold one third of whipped cream into honey mixture with a rubber spatula until just combined, then fold in remaining whipped cream gently but thoroughly.",
        "Divide mixture evenly among ramekins, then cover with plastic wrap and freeze until frozen, at least 1 hour.",
        "Line a baking sheet with parchment.",
        "Stir together cream, sugar, honey, and salt in a 1- to 1 1/2-quart heavy saucepan and boil over moderate heat, stirring occasionally, until mixture is golden and registers 260°F on thermometer (hard-ball stage; see cooks' note, below), about 6 minutes.",
        "Remove mixture from heat and immediately stir in sesame seeds, then pour evenly onto parchment-paper-lined baking sheet and spread into a very thin layer (about a 9-inch round) with an offset spatula. Cool to room temperature, about 5 minutes (candy will be slightly flexible), then chill on sheet in the refrigerator until hard, 2 to 3 minutes. Remove toffee from parchment and break into very small pieces (less than 1/4 inch) with your hands or a rolling pin.",
        "Beat together butter and sugar in a large bowl with an electric mixer at medium speed until smooth, then add honey, beating until combined. Beat in egg white until combined well, then reduce speed to low and add flour and salt until combined. Chill batter, covered, until slightly firm, about 30 minutes.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 375°F.",
        "Line 2 large baking sheets with parchment. Using offset spatula, spread half of batter (about 1/3 cup) into a very thin, sheer 14- by 11-inch rectangle on 1 sheet. Using tip of spatula or a butter knife, section off 12 squares by scraping knife through batter to make a 1/4-inch-wide space between batter sections. Sprinkle half of sesame toffee evenly over batter. Repeat with remaining batter and brittle on second sheet. Bake wafers, switching position of sheets and rotating 180 degrees halfway through baking, until golden (some parts may be pale golden), about 8 minutes. Cool to room temperature on sheets on racks, about 10 minutes. Peel parchment off wafers.",
        "Peel and cut any white pith from oranges with a sharp knife. Cut oranges lengthwise into 1/4-inch-thick slices, discarding white pith from center, then cut slices into 1/4-inch dice.",
        "Fill a large bowl with cool water and dip 1 ramekin (with semifreddo) into water 3 seconds.",
        "Run a sharp paring knife around edge, then invert ramekin onto a dessert plate, gently releasing semifreddo. (It may be necessary to run knife around more than once and gently pry semifreddo out slightly; if necessary, smooth top and sides with knife.) Repeat with remaining ramekins.",
        "Spoon diced orange over and around each semifreddo and serve each with 1 or 2 honey sesame wafers."
    ],
    "ingredients": [
        "1/4 teaspoon unflavored gelatin (from a 1/4-oz package)",
        "3 tablespoons water",
        "3/4 cup heavy cream",
        "3 tablespoons mild honey (preferably wildflower)",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "3 large egg yolks",
        "1/4 cup heavy cream",
        "1/4 cup sugar",
        "1 tablespoon mild honey (preferably wildflower)",
        "1/8 teaspoon salt",
        "1 tablespoon black sesame seeds",
        "1 tablespoon white sesame seeds (not toasted)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/4 cup sugar",
        "1 tablespoon mild honey (preferably wildflower)",
        "1 large egg white",
        "1/2 cup all-purpose flour",
        "1/8 teaspoon salt",
        "2 navel oranges",
        "Special equipment: a candy thermometer; 6 (4-oz) ramekins; parchment paper; an offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Orange",
        "Honey",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wildflower-Honey Semifreddo with Honey Sesame Wafers",
    "url": "http://www.epicurious.com/recipes/food/views/wildflower-honey-semifreddo-with-honey-sesame-wafers-232643"
}
