{
    "directions": [
        "Heat the oil in a large heavy pan over medium-low heat and sweat the onions until soft and translucent.",
        "In a separate pan, warm all the spice seeds until they release their fragrance and just begin to jump in the pan. Tip into a mortar and grind with the pestle while still warm.",
        "Add the warm ground spices to the onions along with the chiles, curry leaves, lime leaves, and cilantro. Cook for another 5 minutes over fairly low heat, then add the garlic, jaggery, lime juice, and fish sauce. Stir well and cook for 5 minutes.",
        "Add the tomatoes, stir well, and cook for another 10 minutes, then add the fresh or cooked dried beans and coconut milk. Cook gently for 10 to 15 minutes (or until the beans are tender if cooking fresh).",
        "While the curry is cooking, wash the wild garlic very well, picking over each leaf thoroughly for they can carry little stones.",
        "A couple of minutes before serving the curry, add the wild garlic and cook until it is just wilted and soft. Don't overcook it—wild garlic should be bright and vibrant. Taste and adjust the seasoning if necessary. This curry should be soft, fragrant, gently sweet, sharp, and salty, with just enough heat to warm you."
    ],
    "ingredients": [
        "1 tsp vegetable oil",
        "2 red onions, peeled and finely sliced",
        "1 1/2 tsp coriander seeds",
        "1 tsp yellow mustard seeds",
        "1 tsp fenugreek seeds",
        "seeds from 5 cardamom pods",
        "3 fresh red chiles (or more if you like heat), sliced (seeded if you prefer less heat)",
        "12 fresh curry leaves",
        "6 kaffir lime leaves",
        "small handful of cilantro roots, washed and minced",
        "4 cloves garlic, peeled and crushed",
        "2 tbsp jaggery or superfine sugar",
        "juice of 2 limes",
        "3 tbsp fish sauce",
        "2 (12-ounce) cans good-quality peeled plum tomatoes",
        "2 cups shelled fresh coco beans, or 1 cup dried cannellini beans, cooked",
        "generous 3/4 cup coconut milk",
        "10 ounces wild garlic leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Vegetable",
        "Dinner",
        "Spice",
        "Legume",
        "Spring",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wild Garlic and White Bean Curry",
    "url": "http://www.epicurious.com/recipes/food/views/wild-garlic-and-white-bean-curry-358389"
}
