{
    "directions": [
        "Melt 1/4 cup butter with olive oil in heavy large skillet over medium-high heat. Add diced wild mushrooms and sprinkle lightly with salt and pepper. Sauté until mushrooms are tender and beginning to brown, about 8 minutes. Transfer mushrooms to large bowl.",
        "Melt remaining 1/2 cup butter in same skillet over medium heat. Add onions and celery. Sauté until vegetables are tender, about 12 minutes. Add all herbs; sauté 1 minute longer. Add spinach and toss until just wilted, about 1 minute. Add vegetable mixture to bowl with mushrooms. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill.",
        "Preheat oven to 350°F. Divide bread between 2 rimmed baking sheets. Bake until bread is crusty but not hard, reversing sheets after 5 minutes, 10 to 12 minutes total. Transfer to very large bowl and cool.",
        "Butter 13x9x2-inch baking dish. Stir vegetable mixture into bread. Whisk eggs, salt, and pepper in small bowl to blend well; whisk in 1 cup broth. Add egg mixture to stuffing, tossing to combine evenly and adding more broth by 1/4 cupfuls if dry. Transfer stuffing to prepared dish.",
        "Bake stuffing uncovered until cooked through and brown and crusty on top, 50 to 60 minutes. Let stand 10 minutes."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, divided",
        "1 tablespoon olive oil",
        "1 pound assorted fresh wild mushrooms (such as chanterelle, stemmed shiitake, and crimini), cut into 1/2-inch dice (about 9 cups)",
        "3 cups chopped onions (about 1 pound)",
        "2 cups chopped celery (4 to 5 stalks)",
        "1/4 cup chopped fresh Italian parsley",
        "2 tablespoons chopped fresh sage",
        "2 tablespoons chopped fresh thyme",
        "1 5-ounce container or bag baby spinach leaves",
        "12 cups (generous) 1-inch cubes day-old pain rustique or ciabatta bread with crust (about 1 1/4 pounds)",
        "2 large eggs",
        "1 1/2 teaspoons fine sea salt",
        "1 teaspoon coarsely ground black pepper",
        "1 cup (or more) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Sauté",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Stuffing/Dressing",
        "Spinach",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wild Mushroom and Spinach Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-and-spinach-stuffing-350470"
}
