{
    "directions": [
        "Soak dried mushrooms in boiling-hot water in a bowl until softened, about 20 minutes. Drain in a paper-towel-lined sieve set over a bowl and reserve soaking liquid, then rinse soaked mushrooms. Pat dry and finely chop.",
        "Heat 3 tablespoons butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté fresh mushrooms with garlic, salt, and pepper, stirring occasionally, until liquid mushrooms give off is evaporated and mushrooms are browned, 5 to 7 minutes. Stir in chopped soaked mushrooms and reserved mushroom-soaking liquid and simmer 1 minute, then remove from heat.",
        "Cook pasta in a 6- to 8-quart pot of boiling salted water until al dente, about 5 minutes. Ladle out and reserve 1/4 cup pasta cooking water. Drain pasta in a colander, then add it to mushrooms in skillet. Add remaining 2 tablespoons butter and cook over moderately high heat, tossing and adding some pasta-cooking liquid if necessary to lightly coat, 1 minute. Add chives, parsley, lemon zest, and juice, then toss well. Serve immediately with cheese and pepper to taste."
    ],
    "ingredients": [
        "2/3 oz dried morel or porcini mushrooms",
        "1 3/4 cups boiling-hot water",
        "5 tablespoons unsalted butter",
        "1/2 lb fresh cremini mushrooms, trimmed and sliced 1/4 inch thick",
        "3/4 lb mixed fresh wild mushrooms, such as oyster, chanterelle, or porcini, trimmed and sliced lengthwise 1/4 inch thick",
        "1 large garlic clove, minced",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 lb dried egg fettuccine",
        "1/4 cup chopped fresh chives",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 1/2 teaspoons finely grated fresh lemon zest",
        "1/2 teaspoon fresh lemon juice",
        "Accompaniment: grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Vegetarian",
        "High Fiber",
        "Low/No Sugar",
        "Dinner",
        "Fall",
        "Healthy",
        "Noodle",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Wild-Mushroom Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-pasta-235731"
}
