{
    "directions": [
        "Heat 1 Tbsp. oil in a large deep skillet or Dutch oven over medium. Add onion, garlic, and thyme and cook, stirring occasionally, until onion starts to release moisture and turns translucent, 2–3 minutes. Add parsnip and cook until parsnip begins to soften, 3–5 minutes more. Add mushrooms and remaining 1 Tbsp. oil and cook until mushrooms are well-browned and cooked through, 5–7 minutes more.",
        "Add miso, tomato paste, and 3/4 tsp. salt to pan and cook, stirring, until tomato paste begins to caramelize, about 1 minute. Add cornstarch and stir to coat, about 30 seconds. Add wine and cook, scraping bottom of pan with a wooden spoon to release brown bits, then add 1 1/2 cups room-temperature water. Bring mixture to a simmer, continuing to scrape bottom of pan and adding water by the tablespoon if pan starts to dry out, and cook until sauce is thick enough to coat the back of a spoon, 10–12 minutes. Taste and season with salt if needed.",
        "Meanwhile, cook polenta, 5 cups milk, and 1 tsp. salt according to package directions. When polenta thickens, stir in 1/4 cup cheese. Taste and add salt and milk, if needed.",
        "Transfer polenta to a large serving bowl. Top with mushroom ragout, remaining 1/4 cup cheese, and hazelnuts."
    ],
    "ingredients": [
        "2 tablespoons olive oil, divided",
        "1 small onion, coarsely chopped (about 3/4 cup)",
        "1 garlic clove, finely chopped",
        "1 thyme sprig",
        "1 medium parsnip (about 7 ounces), peeled, finely chopped",
        "12 ounces mixed wild mushrooms, such as maitake, shiitake, porcini, and/or crimini, cut into 1/2\" pieces",
        "1 tablespoon miso paste",
        "1 tablespoon tomato paste",
        "1/2 teaspoon cornstarch",
        "1 3/4 teaspoons kosher salt, divided, plus more",
        "1/4 cup red wine",
        "1 cup quick-cooking polenta",
        "5 cups (or more) whole milk",
        "1/2 cup grated Parmesan, divided",
        "1/4 cup roasted, unsalted hazelnuts, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "No Meat, No Problem",
        "Wheat/Gluten-Free",
        "Mushroom",
        "Vegetarian",
        "Dinner",
        "Parsnip",
        "Parmesan",
        "Hominy/Cornmeal/Masa",
        "Hazelnut"
    ],
    "title": "Wild Mushroom and Parsnip Ragout With Cheesy Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-and-parsnip-ragout-with-cheesy-polenta"
}
