{
    "directions": [
        "Puree ricotta in processor until smooth, about 1 minute. Add 1 yolk and 2 teaspoons oil and blend. Transfer ricotta mixture to bowl; fold in crème fraîche.",
        "Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add mushrooms and sauté 7 minutes. Mix in thyme. Season to taste with salt and pepper. Add butter and sauté until mushrooms are tender, about 4 minutes longer. Mix in green onions.",
        "Preheat oven to 400°F. Roll out puff pastry on lightly floured surface to 13x9-inch rectangle. Using sharp knife and starting 1/4 inch in from edge, cut score line around entire perimeter of dough, cutting halfway through. Brush 1/4-inch dough border with glaze. Transfer dough to ungreased heavy baking sheet. Spread ricotta mixture over dough, inside border. Top with half of mushrooms, half of Gruyère, then remaining mushrooms and Gruyère. Bake tart until crust is golden and Gruyère melts, about 25 minutes.",
        "Toss herbs with oil and lemon juice in small bowl. Season with salt and pepper.",
        "Cut tart into rectangles. Transfer to plates. Garnish with herb salad."
    ],
    "ingredients": [
        "1/2 cup whole-milk ricotta cheese",
        "1 large egg yolk",
        "2 teaspoons plus 2 tablespoons extra-virgin olive oil",
        "1/4 cup crème fraîche or sour cream",
        "1 1/2 pounds assorted fresh wild mushrooms (such as chanterelle, oyster, or stemmed shiitake), sliced",
        "2 teaspoons fresh thyme leaves",
        "1 tablespoon butter",
        "1 bunch green onions, thinly sliced on diagonal (about 1 1/2 cups)",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "1 large egg yolk, beaten to blend with 1 teaspoon water (for glaze)",
        "4 ounces thinly sliced Gruyère cheese",
        "6 tablespoons fresh Italian parsley leaves",
        "1/3 cup 1/2-inch pieces fresh chives",
        "3 tablespoons fresh tarragon leaves",
        "3 tablespoons fresh chervil leaves",
        "2 tablespoons extra-virgin olive oil",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Appetizer",
        "Bake",
        "Sauté",
        "Dinner",
        "Lunch",
        "Ricotta",
        "Fall",
        "Tarragon",
        "Chive",
        "Sour Cream",
        "Parsley",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wild Mushroom and Gruyère Tart with Fresh Herb Salad",
    "url": "http://www.epicurious.com/recipes/food/views/wild-mushroom-and-gruyere-tart-with-fresh-herb-salad-108548"
}
