{
    "directions": [
        "In large skillet over low heat, heat 1 tablespoon olive oil until hot but not smoking. Add onion and sauté until translucent and softened, about 8 minutes. Add garlic, curry paste, and lemongrass and continue cooking, uncovered, until aromatic, about 5 minutes. Add coconut milk and wine, increase heat to moderately high, and bring to boil. Reduce heat to moderate and simmer, stirring occasionally, until reduced by half, about 20 minutes. Stir in heavy cream, remove from heat, and let cool about 10 minutes. Using slotted spoon, remove lemongrass and discard. Transfer mixture to blender, add lime juice, and pulse until smooth, about 30 seconds (use caution when blending hot liquids). With motor on low, add remaining 1/4 cup olive oil in slow, steady stream and process until fully incorporated. Stir in salt and set aside.",
        "In heavy medium saucepan over moderately high heat, heat vegetable oil to 300°F. Fry ginger, stirring occasionally, until light golden brown, about 5 minutes. Using slotted spoon, transfer ginger to paper towels to drain. Sprinkle with salt and pepper.",
        "Divide hamachi evenly among 8 chilled plates. Drizzle 1/4 cup vinaigrette over and around fish, sprinkle with fried ginger, and serve."
    ],
    "ingredients": [
        "1/4 cup plus 1 tablespoon extra-virgin olive oil",
        "1/2 white onion, very thinly sliced",
        "1 garlic clove, minced",
        "1 tablespoon Thai green curry paste*",
        "1 stalk fresh lemongrass, root ends trimmed, 1 or 2 tough outer leaves discarded from stalk, and roughly chopped",
        "1 (13.5 ounce) can unsweetened coconut milk",
        "1 cup white wine, preferably Sauvignon Blanc",
        "1/4 cup heavy cream",
        "2 tablespoons freshly squeezed lime juice (from 1 medium lime)",
        "1/2 teaspoon sea salt",
        "1 cup vegetable oil",
        "2 (2-inch) pieces fresh ginger (about 1 ounce total), peeled and very thinly sliced",
        "1/4 teaspoon sea salt",
        "Scant 1/8 teaspoon freshly ground black pepper",
        "8 ounces fresh sushi-grade hamachi** from a reputable fishmonger, well-chilled and very thinly sliced",
        "*Thai green curry paste is available at Asian markets and in the Asian foods section of some supermarkets.",
        "**Ask your fishmonger for a hamachi filet that can be easily divided into 8 portions. Or, ask him to slice it for you. If hamachi is unavailable, sushi-grade ahi tuna makes a good substitute."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Dairy",
        "Fish",
        "Garlic",
        "Ginger",
        "Onion",
        "Appetizer",
        "Fry",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wild Hamachi Sashimi with Coconut-Green Curry Vinaigrette and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/wild-hamachi-sashimi-with-coconut-green-curry-vinaigrette-and-ginger-238383"
}
