{
    "directions": [
        "Combine chicken broth and rice in small saucepan. Cover and simmer over medium-low heat until rice is tender and liquid is absorbed, about 50 minutes.",
        "Meanwhile, soak mushrooms in 1 1/2 cups hot water until soft, about 20 minutes. Drain mushrooms, reserving soaking liquid. Cut off mushroom stems and discard. Thinly slice mushrooms.",
        "Melt 1 tablespoon butter in heavy large saucepan over medium-high heat. Add mushrooms and sauté until tender and golden brown, about 5 minutes. Transfer to small bowl. Melt remaining 1 tablespoon butter in same pan. Add onion, garlic, rosemary and thyme and sauté until onion is very tender, about 10 minutes. Mix in potato, beef stock and reserved mushroom soaking liquid. Cover and simmer until potato is very tender, about 15 minutes.",
        "Transfer soup to blender in batches and puree until smooth. Return to saucepan. Stir in wild rice, mushrooms, 3/4 cup milk and Madeira. Cover and simmer 15 minutes to blend flavors. Season with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Return soup to simmer.) Thin with additional milk if desired."
    ],
    "ingredients": [
        "1 14 1/2-ounce can chicken broth",
        "1/2 cup wild rice",
        "1 ounce dried shiitake mushrooms",
        "1 1/2 cups hot water",
        "2 tablespoons butter",
        "1 onion, chopped",
        "2 garlic cloves, chopped",
        "1/4 teaspoon dried rosemary, crumbled",
        "1/4 teaspoon dried thyme, crumbled",
        "1 8-ounce russet potato, peeled, diced",
        "2 cups beef stock or canned beef broth",
        "3/4 cup (about) milk",
        "2 tablespoons Madeira"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Rice",
        "Sauté",
        "Lunch"
    ],
    "title": "Wild Rice and Mushroom Soup",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-and-mushroom-soup-1424"
}
