{
    "directions": [
        "Whisk first 4 ingredients in medium bowl. Season with salt and pepper.",
        "Cook rice in large pot of boiling salted water until just tender, adding more water as needed, about 1 hour; drain well. Place in large bowl. Add half of vinaigrette to warm rice; toss to coat.",
        "Position racks in bottom third and top third of oven and preheat to 425°F. Spray 2 large baking sheets with nonstick spray. Toss carrots with 1 1/2 tablespoons vegetable oil in medium bowl to coat; sprinkle with salt. Transfer to 1 prepared baking sheet. Toss mushrooms with 2 tablespoons vegetable oil in medium bowl to coat; sprinkle with salt. Transfer to second prepared baking sheet. Roast carrots and mushrooms until brown and tender, stirring twice, about 30 minutes. Transfer to large bowl and cool.",
        "Spray same sheets with nonstick spray. Toss peppers with 2 tablespoons vegetable oil in medium bowl to coat; sprinkle with salt. Transfer to 1 prepared sheet. Place onion wedges, rounded side down, on second sheet. Drizzle with 1 tablespoon oil. Sprinkle with salt. Roast peppers and onions until brown and tender, about 30 minutes. Cool.",
        "Cut all vegetables into 3/4-inch pieces. Transfer to bowl with rice. Add remaining vinaigrette and toss to coat. (Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "2/3 cup olive oil",
        "1/3 cup Sherry wine vinegar",
        "2 tablespoons chopped fresh thyme",
        "1 garlic clove, minced",
        "5 6-ounce packages wild rice, rinsed, drained",
        "Nonstick vegetable oil spray",
        "1 pound carrots, peeled, cut diagonally into 1 1/2-inch pieces",
        "6 1/2 tablespoons vegetable oil",
        "1 1/2 pounds crimini mushrooms",
        "3 large red bell peppers, quartered",
        "1large red onion, cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mushroom",
        "Onion",
        "Rice",
        "Vegetable",
        "Side",
        "Roast",
        "Bell Pepper",
        "Carrot",
        "Winter"
    ],
    "title": "Wild Rice and Roasted Vegetable Salad with Sherry-Thyme Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/wild-rice-and-roasted-vegetable-salad-with-sherry-thyme-vinaigrette-107476"
}
