{
    "directions": [
        "1. Bring 3 quarts of water to a boil and set up an ice bath nearby. Plunge the calamari into the boiling water and cook for 30 seconds. Remove the calamari with a slotted spoon or strainer and immediately plunge it into the ice bath. Allow it to cool for 1 minute, then drain and set aside. Blanch the leeks in the same water for 8 to 9 minutes, until just tender. Refresh in the ice bath, then cut in half lengthwise.",
        "2. Preheat the grill or broiler. Brush the leek halves with 2 tablespoons of the olive oil and season with salt and pepper. Grill or broil the leeks, cut side toward the heat, until charred, 8 to 10 minutes. Resist the temptation to move them more than once.",
        "3. In a 12- to 14-inch sauté pan, heat 3 tablespoons of the oil over high heat until smoking. Season the fish fillets with salt and pepper and cook, skin side down, for 5 to 7 minutes, or until the flesh is crispy and moves easily without tearing.",
        "4. While the fish cooks, combine the wine, lemon juice, and squid ink in another sauté pan and bring to a boil. Turn off the heat and whisk in the mustard, then the remaining 4 tablespoons of olive oil. Season with salt and pepper and add the calamari. Keep warm.",
        "5. Turn the fish over and add the leeks to the pan. Cook the fish on the other side for 2 to 3 minutes and heat the leeks through. Place two leeks in the center of each of four warmed plates. Place one fillet atop each bed of leeks, flesh side up. Drizzle each fillet with some of the squid vinaigrette and garnish with the tentacles and lemon zest. Serve immediately."
    ],
    "ingredients": [
        "1 pound cleaned calamari tentacles or cuttlefish tentacles",
        "4 large leeks, whites only, cleaned and cut into 5-inch lengths",
        "9 tablespoons extra-virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "4 6-ounce wild striped bass fillets, skinned",
        "1/4 cup dry white wine",
        "Juice and zest of 1 lemon",
        "2 packets (2 tablespoons) of squid ink",
        "1 teaspoon Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Bass",
        "Squid",
        "Leek",
        "White Wine",
        "Spring",
        "Grill/Barbecue",
        "Boil"
    ],
    "title": "Wild Striped Bass with Charred Leeks and Squid Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/wild-striped-bass-with-charred-leeks-and-squid-vinaigrette-107561"
}
