{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9 inch springform pan. Line the bottom of the pan with parchment paper, and then wrap the outside of the pan with aluminum foil.",
        "Combine 14 ounces of bittersweet chocolate with the butter in a metal bowl over a pan of simmering water. Stir frequently until melted and smooth. Remove from heat, and cool to lukewarm.",
        "In a medium bowl, whip egg yolks with half of the sugar (6 tablespoons) until thick and pale, about 5 minutes. Fold cooled chocolate into the yolks along with the vanilla and rum. In a separate glass or metal bowl, whip egg whites until foamy. Gradually add remaining sugar while continuing to whip to medium stiff peaks. Fold egg whites into the chocolate mixture in thirds. Pour the batter into the prepared pan.",
        "Bake for 45 to 50 minutes in the preheated oven, until the top of the cake is puffed and cracked.  A wooden pick inserted into the cake will still have some moist crumbs attached.  Cool cake in the pan over a wire rack. The top will fall.",
        "Place 1 pound of chocolate in a metal bowl. Heat cream to boiling in a saucepan. Pour hot cream over chocolate, and stir until smooth. Bowl may be set over a pan of simmering water if the chocolate is not able to melt completely from the heat of the cream.",
        "Press down gently on the top of the cake to make it uniformly flat.  Remove sides from the cake pan, and invert cake onto a plate. Remove parchment paper from the bottom. Ladle warm ganache over the top, and spread out to cover sides. Wipe drips from the plate, and let stand until set."
    ],
    "ingredients": [
        "14 ounces bittersweet chocolate, chopped",
        "3/4 cup unsalted butter, cubed",
        "6 egg yolks",
        "6 egg whites",
        "3/4 cup white sugar, divided",
        "2 teaspoons vanilla extract",
        "1 teaspoon dark rum (optional)",
        "1 1/4 cups heavy cream",
        "1 pound bittersweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Willie Cake",
    "url": "http://allrecipes.com/recipe/44655/willie-cake/"
}
