{
    "directions": [
        "Preheat the oven to 400°F.",
        "Peel the squash: First cut into two cross sections, scrape out the seeds, and place the squash, flat side down, on a cutting board. Work around the squash with a sharp knife or peeler, making sure to remove the layer of lighter colored flesh under the skin as well as the skin. Dice into 1/2-inch cubes to make about 1 cup (reserve any leftovers for another use).",
        "Arrange the diced squash and pears on a baking sheet and toss with the oil. Roast until browned, about 20 minutes; set aside at room temperature.",
        "Make a cross slit on the rounded end of each chestnut with a sharp paring knife. Place on a baking sheet and roast for 15 minutes, or until the cut sections on the bottoms of the nuts just start to curl. Peel the chestnuts as soon as they are cool enough to handle, as they will peel the easiest when hot. Cut into quarters and set aside.",
        "Reduce the oven temperature to 350°F. Wrap the shallots in parchment paper and then in aluminum foil. Bake until tender and slightly caramelized, about 1 hour. Once the shallots are cool enough to handle, chop coarsely and set aside.",
        "To make the vinaigrette: In a large sauté pan, cook the bacon over medium heat until crispy; transfer the bacon to a paper towel-lined plate and reserve the fat in the pan. Once the fat has cooled slightly, strain through a fine-mesh strainer into a measuring cup that has a spout. in a blender or food processor, combine the mustard, honey, vinegar, thyme, and pepper and blend for 30 seconds. Slowly add the strained warm bacon fat and the oil through the cap of the blender or the feed tube of a food processor, blending until thoroughly combined Pour the vinaigrette into a large mixing bowl.",
        "Add the squash and pears, chestnuts, shallots, bacon, komatsuna, tatsoi, and mustard greens to the mixing bowl and toss with the warm vinaigrette. Serve immediately."
    ],
    "ingredients": [
        "1 medium African or small butternut squash",
        "2 Moonglow or Asian pears, cored, peeled, and diced (about 1 cup)",
        "1 tablespoon olive oil",
        "1/2 cup (about 12) chestnuts",
        "10 shallots, peeled",
        "1/3 pound (about 2 bunches) tender komatsuna leaves or fresh spinach, torn",
        "1/3 pound (about 2 heads) tatsoi, torn",
        "1/3 pound (about 2 bunches) mustard greens, torn",
        "8 ounces bacon, diced",
        "2 tablespoons Dijon mustard",
        "2 tablespoons local honey",
        "1/4 cup Champagne vinegar",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon freshly ground pepper",
        "1/3 cup canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Mustard",
        "Side",
        "Bake",
        "Dinner",
        "Salad Dressing",
        "Butternut Squash",
        "Fall",
        "Winter",
        "Honey",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Wilted Autumn Greens with Honey Mustard Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/wilted-autumn-greens-with-honey-mustard-vinaigrette-51211620"
}
