{
    "directions": [
        "Position rack in lower third of oven and preheat to 350°F. Melt 1 1/2 tablespoons butter with vegetable oil in heavy large roasting pan set over 2 burners over medium heat. Add carrots and shallots. Sauté until vegetables begin to brown, stirring frequently, about 5 minutes. Sprinkle vegetables with salt and pepper. Add 1 cup white wine and 1 cup chicken broth. Increase heat to high and boil 3 minutes. Push vegetables to sides of pan; place ham in center. Add parsley sprigs, thyme sprigs, and bay leaves to pan. Tent pan with aluminum foil, sealing edges (do not allow foil to touch ham).",
        "Roast ham until thermometer inserted into center (do not touch bone) registers 140°F, basting every 20 minutes with pan juices, about 2 hours. Remove ham; increase oven temperature to 450°F.",
        "Whisk apricot jam and 2 teaspoons Dijon mustard in small bowl. Brush over ham. Return ham to oven and roast, uncovered, until glaze turns dark brown, about 15 minutes.",
        "Transfer ham to cutting board. Discard parsley sprigs, thyme sprigs, and bay leaves from pan. Using slotted spoon, transfer vegetables to bowl. Tent ham and vegetables loosely with foil.",
        "Whisk remaining 3 tablespoons butter and flour in small bowl to smooth paste. Place roasting pan over 2 burners over medium-high heat. Add heavy cream, chopped thyme, and remaining 1 cup white wine, 2 cups chicken broth, and 2 teaspoons Dijon mustard. Bring to simmer. Add flour-butter mixture 1 tablespoon at a time, whisking to incorporate. Simmer until sauce thickens and is reduced to 3 cups, about 10 minutes. Season sauce to taste with salt and pepper.",
        "Slice ham and arrange on platter. Arrange vegetables around ham. Drizzle some sauce over ham and serve, passing remaining sauce separately."
    ],
    "ingredients": [
        "4 1/2 tablespoons unsalted butter, room temperature, divided",
        "1 tablespoon vegetable oil",
        "1 pound baby carrots with 1/2 inch of tops still attached, peeled",
        "1 pound shallots, peeled, halved lengthwise (about 22)",
        "2 cups dry white wine, divided",
        "3 cups low-salt chicken broth, divided",
        "1 fully cooked butt-end ham (about 7 1/2 pounds)",
        "6 large fresh Italian parsley sprigs",
        "6 large fresh thyme sprigs",
        "3 bay leaves",
        "1/4 cup apricot jam",
        "4 teaspoons Dijon mustard, divided",
        "3 tablespoons all purpose flour",
        "3/4 cup heavy cream",
        "1 tablespoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Braise",
        "Easter",
        "Ham",
        "Carrot",
        "White Wine",
        "Spring",
        "Thyme",
        "Shallot",
        "Parsley",
        "Jam or Jelly"
    ],
    "title": "Wine-Braised Ham with Shallots and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/wine-braised-ham-with-shallots-and-carrots-109392"
}
