{
    "directions": [
        "Heat oven to 350°F with rack in middle.",
        "Whisk together matzoh meal with 1 tablespoon kosher salt (2 teaspoons fine) and 1/2 teaspoon pepper. Pat brisket dry and dredge in matzoh mixture, shaking off excess.",
        "Set roasting pan across 2 burners and in it heat 3 tablespoons oil over medium-high heat until oil shimmers. Brown brisket (fat side down first if using first cut) on both sides, 3 to 5 minutes per side. Transfer to a large platter or rimmed baking sheet.",
        "If necessary, add remaining tablespoon oil, then reduce heat to medium, and cook shallots, turning occasionally, until they begin to brown, about 2 minutes. Add garlic and cook, stirring, until fragrant, 1 minute.",
        "Add wine and boil until liquid is reduced by half, then stir in chicken stock, cherries, sugar, balsamic vinegar, star anise, and 1 teaspoon kosher salt (1/2 teaspoon fine salt). Bring to a simmer and return brisket, fat side up, to pan. Cover pan tightly with heavy-duty foil or a double layer of regular foil, and braise in oven for 2 hours.",
        "Meanwhile, blanch carrots in a 3-quart pot of well-salted boiling water. Drain and transfer to a bowl of ice water to stop cooking. Drain again and pat dry.",
        "Add carrots to roasting pan (after meat has braised for 2 hours), then cover again tightly with foil, and continue to braise in oven, until meat is fork-tender, 1 to 1 1/2 hours more.",
        "If serving soon, transfer meat to a cutting board and let it rest, loosely covered, 15 minutes, then slice meat across the grain. Skim off any excess fat from surface of sauce, then discard star anise, and season to taste with salt. Reheat sauce, then return sliced meat to sauce to reheat before serving. Serve meat with sauce and carrots on a large deep platter. (If making brisket ahead, see Cooks' Notes.)"
    ],
    "ingredients": [
        "1/4 cup matzoh cake meal (see Cooks' notes)",
        "Kosher or fine salt",
        "Freshly ground black pepper",
        "1 (6- to 6 1/2-pound) first- or second-cut beef brisket",
        "3 to 4 tablespoons vegetable oil",
        "16 medium shallots (about 1 pound); peeled, leaving root ends intact",
        "3 large garlic cloves, finely chopped",
        "2 cups Pinot Noir",
        "2 cups chicken stock or reduced-sodium chicken broth",
        "1 1/2 cups (8 ounces) dried tart cherries",
        "2/3 cup packed dark brown sugar",
        "2/3 cup balsamic vinegar",
        "2 whole star anise (see Cooks' notes)",
        "2 pounds young, slim carrots in bunches (not pre-cut variety), peeled",
        "Special equipment: A nonreactive large, heavy-bottomed roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Braise",
        "Passover",
        "Dinner",
        "Cherry",
        "Meat",
        "Brisket",
        "Carrot",
        "Kosher",
        "Kosher for Passover",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wine-Braised Brisket with Tart Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/wine-braised-brisket-with-tart-cherries-395411"
}
