{
    "directions": [
        "Combine wine, sugar, orange juice, lemon peel, and clove in heavy medium saucepan. Bring to simmer over medium heat, stirring until sugar dissolves. Add pear halves to saucepan. Cut out round of parchment paper same size as saucepan. Place parchment round atop pears, pushing edges of parchment into liquid to prevent edges from curling up. Reduce heat and barely simmer until pears are tender when pierced with knife, about 12 minutes.",
        "Using slotted spoon, transfer pears to bowl. Boil liquid in saucepan until slightly syrupy and reduced to 3/4 cup, about 14 minutes. Cool syrup to room temperature; stir in crème de cassis, if desired. Pour syrup over pears. Cover and chill at least 12 hours, turning pears occasionally.",
        "Thinly slice pear halves lengthwise almost to stem end, leaving stems attached. Spoon generous 1 tablespoon pear syrup onto each of 4 plates. Top each with 1 pear half, pressing gently to fan. Serve with cheese."
    ],
    "ingredients": [
        "1 1/2 cups dry red wine",
        "1/3 cup sugar",
        "1/4 cup orange juice",
        "1 3x3/4-inch strip lemon peel (yellow part only)",
        "1 whole clove",
        "2 firm but ripe medium-size pears, peeled, stems left attached, halved lengthwise, cored",
        "1 tablespoon cassis (black-currant-flavored liqueur; optional)",
        "8 ounces triple-crème cheese (such as Explorateur, Saint André, boursault or Brillat-Savarin), cut into 4 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Cheese",
        "Citrus",
        "Fruit",
        "Dessert",
        "Poach",
        "Christmas",
        "Thanksgiving",
        "Oscars",
        "New Year's Eve",
        "Pear",
        "Red Wine",
        "Fall",
        "Winter",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Wine- and Citrus-Poached Pears with Triple-Crème Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/wine-and-citrus-poached-pears-with-triple-creme-cheese-106129"
}
