{
    "directions": [
        "1. Season the brisket evenly on both sides with salt and pepper. Cover and refrigerate for 2 hours. Meanwhile, in a medium saucepan, bring the wine to a boil and continue boiling until it reduces to half its original volume, 15 to 20 minutes.",
        "2. Preheat the oven to 350° F. Evenly sprinkle the brisket all over with flour, shaking off excess. Heat a heavy Dutch oven over high heat. Add 2 tablespoons of the oil. When it is almost smoking, turn the heat to medium-high, carefully add the brisket, and sear until well browned, about 5 minutes per side. Transfer the brisket to a platter. Pour off the fat from the Dutch oven and add another 2 tablespoons of oil. Add the garlic, shallots, carrots, celery, and leek, and sauté until glossy and lightly browned, about 5 minutes. Add half of the apricots and all the parsley, thyme, bay leaves, and tomato paste, and continue to cook 1 minute more.",
        "3. Return the browned brisket to the Dutch oven and add the reduced wine and 2 quarts stock or broth. If the brisket is not completely covered with liquid, add enough extra stock, broth, or water to cover. Bring the liquid to a simmer. Cover the pot and carefully place it in the oven. Cook until the brisket is fork-tender, 2 to 2 1/2 hours. Meanwhile, blanch and peel the onions as instructed in the tips (see below), leaving them whole. Cut the remaining apricots into 1/4-inch strips.",
        "4. In a small sauté pan, heat the remaining 2 tablespoons oil over medium-high heat and sauté the pearl onions until lightly golden, 5 to 7 minutes. Add the apricot strips and pour in the remaining 1/4 cup stock or broth, stirring and scraping with a wooden spoon to deglaze the pan deposits. Reduce the heat and simmer gently until tender, about 5 minutes. Cover and keep warm.",
        "5. When the meat is done, carefully transfer it to a heated platter, cover with aluminum foil, and keep warm. Boil the liquid in the Dutch oven until it thickens and reduces to about 1 quart, 15 to 20 minutes. Pour it through a fine-mesh strainer into a bowl, taste, and adjust the seasonings if necessary with more salt and pepper.",
        "6. To serve, use a sharp knife to cut the brisket across the grain into 1/4-inch slices. Arrange the slices on heated serving plates or on a heated platter, spoon half the sauce over it, and garnish with the pearl onions and apricots. Sprinkle with minced parsley and pass the remaining sauce on the side."
    ],
    "ingredients": [
        "5 pounds beef brisket",
        "2 tablespoons kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 bottle red wine",
        "All-purpose flour",
        "6 tablespoons vegetable oil",
        "10 garlic cloves, peeled and smashed",
        "6 large shallots, peeled and thinly sliced",
        "2 medium carrots, peeled, cut into 1-inch chunks",
        "2 celery stalks, cut into 1-inch chunks",
        "1 medium leek, white part only, cut into 1-inch chunks",
        "1 cup dried apricots",
        "6 sprigs fresh flat-leaf parsley",
        "2 sprigs fresh thyme",
        "2 bay leaves",
        "2 tablespoons tomato paste",
        "2 quarts plus 1/4 cup homemade beef stock or good-quality canned beef broth",
        "1 cup pearl onions",
        "Minced parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Onion",
        "Braise",
        "Super Bowl",
        "Oscars",
        "Apricot",
        "Brisket",
        "Leek",
        "Red Wine",
        "Fall",
        "Winter",
        "Thyme"
    ],
    "title": "Wine-Braised Brisket of Beef with Caramelized Pearl Onions and Dried Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/wine-braised-brisket-of-beef-with-caramelized-pearl-onions-and-dried-apricots-234062"
}
