{
    "directions": [
        "To prepare the short ribs, in a saucepan over high heat, combine the brine blend with 1 quart of the water and bring to a boil, stirring to dissolve the brine. Remove from the heat, let cool to room temperature and refrigerate until thoroughly chilled. In a large container, combine the brining solution with the remaining 1 quart water and add the short ribs. Cover and refrigerate for 6 to 12 hours.",
        "In a large sauté pan over medium-high heat, bring the wine to a boil and boil until reduced to 3 cups, 20 to 30 minutes. Set aside. Remove the short ribs from the brine, rinse with cool water and pat dry with paper towels. Season with five pepper blend. Put the rosemary in a shallow bowl. Press the meaty side of each rib in the rosemary.",
        "In a large fry pan over high heat, warm the olive oil until almost smoking. Working in batches (do not overcrowd the pan), brown the ribs on all sides, about 2 minutes per side. Transfer to a slow cooker.",
        "In the same pan over medium heat, cook the onions and garlic, stirring often, until the onions just begin to soften, about 5 minutes. Add the flour and cook, stirring to scrape up the browned bits, about 3 minutes. Whisk in the stock. Transfer to the slow cooker along with the parsley, tomatoes and the reduced wine. Season with salt and five pepper blend. Cover and cook on high until the meat is very tender and falling off the bone, about 6 hours.",
        "Transfer the ribs to a serving bowl and cover with aluminum foil. Spoon off any fat from the sauce. Pour the sauce into a large sauté pan, set over medium heat and simmer until thickened, 15 to 20 minutes.",
        "Meanwhile, prepare the pasta: In a large saucepan over medium heat, melt the butter. When it sizzles, add the garlic and cook, stirring often, until golden brown, 1 to 2 minutes. Stir in the lemon zest. Add the cooked pasta and toss to combine. Stir in the chives and season with salt and pepper.",
        "Divide the pasta among 8 bowls. Place 1 short rib on top of each serving. Spoon the sauce over the ribs and serve immediately. Serves 8.",
        "Williams-Sonoma Kitchen",
        "* Available at Williams-Sonoma stores."
    ],
    "ingredients": [
        "3⁄4 cup turkey brine blend*",
        "2 quarts water",
        "8 beef short ribs, about 4 1⁄2 lb. total",
        "2 bottles (each 750ml) Cabernet Sauvignon",
        "Salt and freshly ground five pepper blend, to taste",
        "1⁄3 cup minced fresh rosemary",
        "3 Tbs. olive oil",
        "2 yellow onions, diced",
        "5 garlic cloves, sliced",
        "1⁄2 cup all-purpose flour",
        "1 1⁄2 cups beef stock",
        "1⁄4 cup chopped fresh flat-leaf parsley",
        "1 can (15 oz.) diced tomatoes, drained",
        "4 Tbs. (1⁄2 stick) unsalted butter",
        "4 garlic cloves, minced",
        "2 Tbs. lemon zest",
        "1 lb. farfalle, cooked according to package instructions, drained",
        "1⁄3 cup chopped fresh chives",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Wine-Braised Short Ribs with Lemon Pasta",
    "url": "http://www.williams-sonoma.com/recipe/wine-braised-short-ribs-with-lemon-pasta.html"
}
