{
    "directions": [
        "Place softened ice cream in medium bowl. Using plastic spatula, fold ginger and rum into ice cream. Transfer to airtight container. Freeze ice cream mixture until firm, about 4 hours. (Can be made 1 day ahead. Keep frozen.)",
        "Generously butter eight 3/4-cup soufflé dishes. Stir chocolate, butter, coriander, cardamom, cinnamon, cloves, and white pepper in heavy medium saucepan over low heat until melted and smooth. Cool slightly. Whisk eggs, egg yolks, and vanilla in large bowl to blend. Whisk in 3 cups powdered sugar, then chocolate mixture, then flour. Transfer batter to prepared dishes, filling to top and dividing equally. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 425°F. Bake cakes until batter has risen above dish, top edges are dark brown, and centers are still soft and runny, about 15 minutes, or about 18 minutes for refrigerated batter. Run small knife around cakes to loosen. Allow cakes to rest in dishes 5 minutes. Using hot pad and holding dish very firmly, place plate gently atop 1 cake and invert onto plate. Repeat with remaining cakes. Dust with powdered sugar. Top with crystallized ginger. Serve cakes with rum-ginger ice cream."
    ],
    "ingredients": [
        "1 pint vanilla ice cream, softened",
        "2 tablespoons chopped crystallized ginger",
        "1 tablespoon dark rum",
        "14 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 1/4 cups (2 1/2 sticks) unsalted butter",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cardamom",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground white pepper",
        "6 large eggs",
        "6 large egg yolks",
        "2 teaspoons vanilla extract",
        "3 cups powdered sugar",
        "1 cup all purpose flour",
        "Additional powdered sugar",
        "Crystallized ginger strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Chocolate",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Spice",
        "Winter",
        "Birthday",
        "Cinnamon",
        "Clove",
        "Coriander",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Winter-Spiced Molten Chocolate Cakes with Rum-Ginger Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/winter-spiced-molten-chocolate-cakes-with-rum-ginger-ice-cream-109054"
}
