{
    "directions": [
        "Preheat oven to 400 degrees F.",
        "Melt the butter in a large skillet over moderate heat and cook until it foams. Add the garlic and thyme, and immediately add the bread cubes. Toss to coat well. Add most of the grated cheese and stir. Transfer bread to a baking sheet and sprinkle with the remaining cheese and salt and pepper and gently toss again while still warm to melt the cheese. Bake stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside and let cool.",
        "Soak the sliced onion in the sherry vinegar and a pinch of salt for about 15 minutes. Set aside.",
        "Toss the squash with 1 1/2 tablespoons of the olive oil, sage, salt, and pepper. Arrange in a single layer on a baking sheet and bake until the squash is tender and lightly caramelized, about 15 to minutes. Let cool.",
        "Bring a large pot of salted water to a boil. Add the quartered Brussels sprouts and cook until tender but retain a touch of crispness, about 1 1/2 minutes, and drain.",
        "Into the reserved red onions and vinegar, whisk in remaining 1/2 cup olive oil. Season with pepper.",
        "In a large bowl combine the roasted squash, croutons, and Brussels sprouts. Add the vinaigrette and toss. Add the parsley leaves and toss again. Taste and adjust the seasoning. Garnish with grated Parmesan and serve immediately.",
        "Chef note: \"Soaking the onion briefly in sherry vinegar--sometimes called blooming the onion--mellows the raw onion taste.\""
    ],
    "ingredients": [
        "1/4 cup unsalted butter",
        "2 teaspoons finely chopped garlic",
        "2 teaspoons finely chopped fresh thyme",
        "6 cups day-old bread, crust removed, cubed",
        "6 tablespoons finely grated Parmesan, plus more for garnish",
        "Salt and freshly ground black pepper",
        "1 small red onion, sliced thinly lengthwise",
        "3 tablespoons sherry vinegar",
        "Gray salt",
        "4 cups peeled, seeded, and diced butternut squash (1/2-inch dice)",
        "1/2 cup plus 1 1/2 tablespoons extra-virgin olive oil",
        "1 tablespoon chopped fresh sage",
        "Freshly ground black pepper",
        "1/2 pound Brussels sprouts, ends trimmed, then quartered",
        "1/2 cup fresh Italian parsley leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "European Recipes",
        "Salad Recipes",
        "Brussels Sprouts",
        "Vegetable",
        "Squash",
        "Winter"
    ],
    "title": "Winter Panzanella",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/winter-panzanella-recipe"
}
