{
    "directions": [
        "Cook pancetta, onions, celery, and carrots in oil in a wide 7-to 9-quart heavy pot over medium heat, stirring occasionally, while preparing chard.",
        "Cut out stems from chard and chop stems, reserving leaves. Stir chard stems into pancetta mixture with garlic, 1 teaspoon salt, and 3/4 teaspoon pepper and continue cooking, stirring occasionally, until vegetables are very tender and begin to stick to bottom of pot, about 45 minutes total. (Set aside chard leaves.)",
        "Push vegetables to one side of pot. Add tomato paste to cleared area and cook, stirring constantly, until it starts to caramelize, about 2 minutes. Stir paste into vegetables and cook, stirring, 2 minutes. (Paste may stick to pot, but don't let it burn.)",
        "Stir in tomatoes with their juice, breaking them up with a spoon, then add hot water (3 quarts), scraping up any brown bits from bottom of pot.",
        "Bring to a simmer. Stir in cabbage, escarole, and parmesan rind. Simmer, covered, until greens are tender, about 40 minutes.",
        "Coarsely chop chard leaves and stir into soup along with beans. Simmer, partially covered, 10 minutes. Discard rind. Season soup with salt and pepper. If using ditalini, stir in just before serving."
    ],
    "ingredients": [
        "1/3 pound sliced pancetta, chopped",
        "3 medium red onions, chopped",
        "4 celery ribs, chopped",
        "2 medium carrots, chopped",
        "1/3 cup extra-virgin olive oil",
        "1 bunch Swiss chard",
        "6 garlic cloves, finely chopped",
        "2 tablespoons tomato paste",
        "1 (28-ounce) can whole tomatoes in juice",
        "3 quart hot water",
        "5 cups coarsely chopped cored Savoy cabbage (6 ounces)",
        "5 cups coarsely chopped escarole (1/2 pound)",
        "1 piece Parmigiano-Reggiano rind (about 3 by 1 1/2 inches)",
        "1 (19-ounce) can cannellini beans, rinsed and drained",
        "Accompaniments: extra-virgin olive oil for drizzling; cooked ditalini pasta tossed with oil (optional); grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Dinner",
        "Lunch",
        "Bacon",
        "Celery",
        "Carrot",
        "Winter",
        "Family Reunion",
        "Cabbage",
        "Escarole",
        "Potluck",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Winter Minestrone",
    "url": "http://www.epicurious.com/recipes/food/views/winter-minestrone-351167"
}
