{
    "directions": [
        "Boil 1 cup wine in heavy small saucepan until reduced to 1/4 cup, about 6 minutes. Pour into large bowl. Add grapefruit juice, sugar, corn syrup, grenadine and peel; stir until sugar dissolves. Mix in remaining 3/4 cup wine. Refrigerate until cold.",
        "Cook all ingredients in heavy medium saucepan over medium-high heat until berries pop and soften, stirring frequently, about 10 minutes. Puree in processor. Strain into bowl. Refrigerate until cold.",
        "Combine pears and 1 cup plus 2 tablespoons wine in heavy medium saucepan over medium heat. Cover and cook until pears are tender, about 8 minutes. Puree pear mixture and sugar in processor. Mix in 3/4 cup wine and corn syrup. Chill until cold.",
        "Process each mixture separately in ice cream maker according to manufacturer's instructions. Freeze in covered containers. (Can be made 1 week ahead.)",
        "Using oval-shaped ice cream scooper, place 1 scoop of each sorbet on each plate. Garnish with mint."
    ],
    "ingredients": [
        "1 3/4 cups Essencia (or other sweet dessert wine)",
        "2 1/2 cups fresh pink grapefruit juice (from about 6 grapefruits)",
        "1/2 cup plus 2 tablespoons sugar",
        "2 tablespoons light corn syrup",
        "1 tablespoon grenadine syrup",
        "1 1/2 teaspoons grated pink grapefruit peel",
        "2 cups fresh or frozen cranberries",
        "1 1/2 cups water",
        "1 cup tawny Port",
        "1 cup sugar",
        "2 1/4 pounds ripe pears, peeled, quartered, cored",
        "1 3/4 cups plus 2 tablespoons Gewürztraminer or other dry white wine",
        "3/4 cup sugar",
        "2 tablespoons light corn syrup",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ice Cream Machine",
        "Berry",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Cranberry",
        "Grapefruit",
        "Pear",
        "Winter",
        "Vegan",
        "Fat Free",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Winter Sorbet Sampler",
    "url": "http://www.epicurious.com/recipes/food/views/winter-sorbet-sampler-550"
}
