{
    "directions": [
        "Melt 2 tablespoons butter in large skillet over medium-high heat. Add pears; sprinkle with sugar. Sauté until pears are golden, about 5 minutes. Transfer to very large bowl; mix in cinnamon. Melt remaining 10 tablespoons butter in same skillet over medium heat. Add onions and celery; sauté until golden, about 15 minutes. Add wine and next 5 ingredients. Simmer until liquid is reduced almost to glaze and mixture is soft and moist, stirring occasionally, about 15 minutes. Mix into pears. (Can be made 1 day ahead. Cover and chill. Reheat to lukewarm before continuing.)",
        "Mix bread and pecans into fruit mixture. Season stuffing with salt and pepper.",
        "Loosely fill main cavity and neck cavity of turkey with stuffing. Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover dish with buttered foil, buttered side down. Bake stuffing in dish — alongside turkey or while turkey is resting — until heated through, about 25 minutes. Uncover stuffing in dish. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish. Transfer stuffing to prepared dish. Bake uncovered until heated through, about 35 minutes."
    ],
    "ingredients": [
        "12 tablespoons (1 1/2 sticks) butter",
        "2 large Anjou pears, peeled, cored, cut into 1/2-inch cubes",
        "1 tablespoon sugar",
        "3/4 teaspoon ground cinnamon",
        "4 cups chopped onions",
        "1 1/2 cups chopped celery",
        "1 1/2 cups Sauternes or other sweet white wine",
        "1 1/2 cups chopped pitted prunes",
        "1 1/2 cups chopped dried apricots",
        "1 cup dried cranberries",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon chopped fresh sage",
        "14 cups 1/2-inch cubes crustless firm white bread (about 1 1/2 pounds)",
        "1 cup pecans, toasted, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Prune",
        "Pear",
        "Apricot",
        "Pecan",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Winter Fruit and Nut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/winter-fruit-and-nut-stuffing-107294"
}
