{
    "directions": [
        "Rinse chicken inside and out, then stuff cavity with scallions, ham, and ginger. Bring water with chicken and salt to a boil in a deep 7- to 8-quart stockpot or pasta pot, then reduce heat and cook at a bare simmer, uncovered, skimming off froth occasionally, 3 hours. 3Remove and discard chicken, then pour broth through a fine-mesh sieve into a large bowl. Let stand 5 minutes. Skim off fat. (You will have about 10 to 12 cups broth and need only 9 cups for this soup; reserve remainder for the Black-Bean Shrimp with Chinese Broccoli or for another use.)",
        "Bring 2 cups broth to a boil in a 1-quart heavy saucepan, then add dried scallops and remove from heat. Soak, covered, 15 minutes.",
        "Return scallop mixture to low heat and simmer, uncovered, until scallops are soft and pale, about 15 minutes. Remove from heat and cool in cooking liquid. Transfer scallops with a slotted spoon to a bowl, reserving cooking liquid. Shred scallops into \"threads\" with a fork or your fingers, discarding tough ligament from side of each scallop if attached. Bring remaining 7 cups broth to a simmer in cleaned 7- to 8-quart pot with scallops and reserved cooking liquid.",
        "Cut off and discard rind from winter melon. Remove and discard seeds, then cut melon into 1/3-inch cubes (about 5 cups). Add to broth and gently simmer, uncovered, until melon is transparent, 20 to 30 minutes. 3Stir in ham, ginger, scallions, and salt to taste just before serving."
    ],
    "ingredients": [
        "1 (3- to 3 1/2-lb) whole chicken",
        "1 bunch scallions, halved crosswise",
        "2 oz Smithfield or other cured ham (1 piece or sliced), trimmed of any spice coating",
        "1 (1-inch) piece peeled fresh ginger, smashed",
        "14 cups water",
        "1 tablespoon salt",
        "5 (1-inch-wide) large dried scallops",
        "1 (2-lb) wedge winter melon",
        "2 oz Smithfield or other cured ham (1 piece or sliced), trimmed of any spice coating and cut into very thin matchsticks (1/2 cup)",
        "1 (2-inch) piece fresh ginger, peeled and cut into very thin matchsticks (2 tablespoons)",
        "3 scallions, thinly sliced (1/2 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Appetizer",
        "Lunar New Year",
        "Melon",
        "Ham",
        "Scallop",
        "Winter",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Winter Melon Soup",
    "url": "http://www.epicurious.com/recipes/food/views/winter-melon-soup-233787"
}
