{
    "directions": [
        "Lightly butter a 3-quart baking dish. Working in batches, blanch kale in a pot of boiling lightly salted water until just softened, about 3 minutes. Using a slotted spoon, transfer kale to a large bowl of ice water; let cool, then drain. Squeeze out as much excess water as possible by hand and transfer kale to a work surface.",
        "Repeat with mustard greens, blanching for 2 minutes per batch. Coarsely chop all greens and combine in a large bowl (you should have 6 cups tightly packed greens). Separate clumps and loosen chopped leaves by hand.",
        "Heat oil in a 12\" skillet over medium heat. Add breadcrumbs and cook, stirring frequently, until golden and crispy, 8-10 minutes. Transfer to a large bowl; stir in Parmesan and 1 teaspoon thyme leaves. DO AHEAD: Greens and breadcrumbs can be made 2 days ahead. Cover greens and chill. Store breadcrumbs airtight at room temperature.",
        "Melt 1 tablespoon butter in a medium saucepan over medium-high heat. Add shallots; cook, stirring often, until slightly softened and light golden, about 5 minutes. Transfer shallots to bowl with greens. Add cream, milk, garlic, and thyme sprigs to same saucepan; bring to a simmer. Cook until mixture is thickened and reduced to 1 1/2 cups, 10-12 minutes. Discard thyme sprigs and garlic; stir in nutmeg. Season mixture with salt and pepper.",
        "Pour cream mixture over greens in bowl and toss to evenly coat in sauce; season to taste with salt and pepper. Transfer greens mixture to prepared baking dish; sprinkle Gruyère over. Top with breadcrumbs. Cover dish with foil. DO AHEAD: Gratin can be assembled 1 day ahead.",
        "Preheat oven to 400°F. Bake until filling is hot, about 25 minutes. Uncover and bake until cheese is melted, edges are bubbling, and breadcrumbs are golden brown, 10-20 minutes longer. Garnish with remaining 1 teaspoon thyme leaves."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter plus more for dish",
        "2 pounds kale, center ribs and stems removed, torn into large pieces, or two 10-ounce bags trimmed, chopped kale (about 24 cups)",
        "Kosher salt",
        "2 1/2 pounds mustard greens, center ribs and stems removed, torn into large pieces",
        "1/4 cup extra-virgin olive oil",
        "3 cups coarse fresh breadcrumbs",
        "1/2 cup finely grated Parmesan",
        "2 teaspoons fresh thyme leaves, divided, plus 7 sprigs thyme",
        "2 shallots, sliced into 1/4\"-thick rounds (about 1 cup)",
        "1 cup heavy cream",
        "1 cup whole milk",
        "7 garlic cloves, smashed",
        "1/8 teaspoon freshly ground nutmeg",
        "Freshly ground black pepper",
        "1 cup coarsely grated Gruyère"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Leafy Green",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Casserole/Gratin",
        "Parmesan",
        "Kale",
        "Winter",
        "Mustard Greens",
        "Christmas Eve",
        "Shallot",
        "Breadcrumbs",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Winter Greens Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/winter-greens-gratin-51133460"
}
