{
    "directions": [
        "Heat the butter and olive oil in a large saucepan over low heat. Stir in the garlic, shallots, and ginger, and cook until fragrant but not brown, about 5 minutes. Stir in the green onions, cauliflower, parsnip, and mushrooms, and cook and stir an additional 5 minutes. Add the pear, beans, mustard, and dill, and stir just until heated, about 1 minute.",
        "Stir in the wine and thyme, and turn up the heat to high. Boil, stirring constantly, until the wine is reduced by half and is syrupy, about 5 minutes. Pour in the chicken broth. Return the mixture to a boil, then reduce heat to low and simmer, partly covered, until vegetables are tender, about 20 minutes. Allow the soup to cool slightly.",
        "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Stir in cream, and, if needed, thin with additional chicken broth; serve hot. You may wish to serve this soup the next day. It will improve in taste with time."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "3 cloves garlic, chopped",
        "2 shallots, chopped",
        "1 (1 inch) piece fresh ginger, minced",
        "3 green onions, chopped",
        "1/3 small head cauliflower, chopped",
        "1 small parsnip, chopped",
        "10 small button mushrooms, chopped",
        "1 pear - peeled, cored and diced",
        "1/2 cup cannellini beans",
        "1/2 teaspoon Dijon mustard",
        "1 teaspoon chopped fresh dill",
        "3/4 cup Chardonnay wine",
        "6 sprigs fresh thyme",
        "1 (14.5 ounce) can fat-free chicken broth",
        "1/3 cup heavy cream",
        "salt and pepper to taste",
        "1/4 cup fat-free chicken broth (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Winter White Soup",
    "url": "http://allrecipes.com/recipe/103364/winter-white-soup/"
}
