{
    "directions": [
        "In a food processor chop cranberries fine and in a saucepan combine with sugar and 1/2 cup water. Simmer mixture, stirring occasionally, until sugar is dissolved, about 5 minutes. On a baking sheet arrange bread slices and brush tops and edges with some cranberry cooking liquid.",
        "Peel, quarter, and core apples. Cut apples into 1-inch chunks and add to cranberry mixture with cinnamon sticks and cloves, stirring. Simmer mixture, stirring occasionally, 10 minutes, or until apples are just tender and most liquid is evaporated.",
        "While apple mixture is simmering, in a very small bowl sprinkle gelatin over remaining tablespoon water and let soften 1 minute. Stir gelatin mixture into fruit mixture until dissolved.",
        "Arrange 6 bread slices, overlapping slightly, against inside of a deep 1-quart bowl or pudding mold with coated side against inside of bowl or mold. Gently press remaining bread slice into bottom and spoon fruit mixture over bread. Chill pudding, covered with plastic wrap, until completely cold, at least 6 hours, and up to 2 days.",
        "To unmold pudding, run a thin knife around edge of bowl or mold and invert pudding onto a plate. Serve pudding cut into wedges."
    ],
    "ingredients": [
        "2 cups fresh or frozen cranberries (about 8 ounces)",
        "3/4 cup sugar",
        "1/2 cup plus 1 tablespoon water",
        "7 slices very thin firm white sandwich bread, crusts discarded",
        "3 Golden Delicious apples (about 1 1/2 pounds total)",
        "2 cinnamon sticks",
        "10 whole cloves tied in cheesecloth",
        "1 1/4 teaspoons unflavored gelatin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Berry",
        "Fruit",
        "Dessert",
        "Christmas",
        "Picnic",
        "Thanksgiving",
        "Cranberry",
        "Apple",
        "Spice",
        "Winter",
        "Chill",
        "Cinnamon",
        "Clove",
        "Party",
        "Gourmet"
    ],
    "title": "Winter Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/winter-pudding-13661"
}
