{
    "directions": [
        "In a large, heavy stockpot or Dutch oven, heat the oil over medium heat. Add the onion, carrots, celery, pancetta, and garlic. Cook, stirring frequently, until the onion is translucent, about 10 minutes. Add the Swiss chard and potato. Season with salt and pepper and cook for 2 minutes. Stir in the tomatoes and rosemary sprigs. Bring the mixture to a boil. Reduce the heat and simmer until the chard is wilted and the tomatoes are very soft, about 10 minutes.",
        "In a food processor or blender, combine 3/4 of the beans with 1/2 cup of broth. Blend until almost smooth. Add the pureed bean mixture, remaining broth, and Parmesan rind to the vegetable mixture. Simmer, stirring occasionally, until the potato pieces are tender, about 15 minutes. Stir in the remaining beans and the parsley. Simmer until the beans are heated through and the soup is thick, about 2 minutes. Discard the rosemary stems (the leaves will have fallen off) and season with salt and pepper, to taste. Ladle the soup into bowls and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 carrots, peeled and chopped",
        "2 celery stalks, chopped",
        "3 ounces thinly sliced pancetta, coarsely chopped",
        "2 cloves garlic, crushed",
        "1 pound Swiss chard, stems trimmed, leaves coarsely chopped",
        "1 russet potato, peeled and cubed",
        "Kosher salt and freshly ground black pepper",
        "1 (14 1/2-ounce) can diced tomatoes in juice",
        "2 fresh rosemary sprigs",
        "1 (15-ounce) can cannellini beans, drained and rinsed, divided",
        "2 (14-ounce) cans low-sodium beef broth, divided",
        "1 (1-ounce) Parmesan rind",
        "1/4 cup chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bean Soup",
        "Beans and Legumes",
        "Soup",
        "Carrot Soup",
        "Vegetable Soup",
        "Carrot Recipes",
        "Vegetable",
        "Potato Soup",
        "Potato",
        "Tomato Soup",
        "Tomato",
        "Celery",
        "Meat",
        "Onion Recipes",
        "Holiday",
        "Winter"
    ],
    "title": "Winter Minestrone",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/winter-minestrone-recipe2"
}
