{
    "directions": [
        "Purée chile, cilantro, oil, caraway, and cumin in a blender until smooth; season with salt and pepper.",
        "Trim brussels sprouts; halve lengthwise. Pluck off outer green leaves and place in a large bowl. Very thinly slice half of brussels and add to bowl with leaves. Heat oil in a medium skillet over medium-high. Cook remaining brussels, tossing occasionally, until crisp-tender, about 5 minutes. Transfer to bowl.",
        "Trim ends from citrus; cut off peel and white pith. Cut 3 citrus in half lengthwise, then thinly slice crosswise. Working over a bowl, cut along membranes of remaining 3 citrus to release segments. Squeeze membranes and trim over bowl to release juices. Whisk 3 Tbsp. juice, vinegar, and poppy seeds in a small bowl; season dressing with salt. Discard remaining juice.",
        "Add citrus and dressing to bowl with brussels sprouts and toss; season with salt.",
        "To serve, spread fromage blanc over a platter. Arrange salad on top and drizzle with 1/4 cup green harissa (save remaining harissa to use on roasted veg or grilled meat); sprinkle with nigella seeds, if using.",
        "Harissa can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 serrano chile, seeds removed, chopped",
        "1 cup (packed) cilantro leaves with tender stems",
        "1/2 cup olive oil",
        "1/2 teaspoon ground caraway",
        "1/2 teaspoon ground cumin",
        "Kosher salt, freshly ground pepper",
        "1 pound brussels sprouts",
        "1 tablespoon olive oil",
        "6 small citrus (such as navel or blood oranges or tangelos)",
        "3 tablespoons Champagne vinegar",
        "2 teaspoons poppy seeds",
        "Kosher salt",
        "1 cup fromage blanc or plain whole-milk Greek yogurt",
        "1 teaspoon nigella seeds (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cilantro",
        "Brussel Sprout",
        "Orange",
        "Citrus",
        "Yogurt",
        "Chile Pepper",
        "Winter",
        "Side"
    ],
    "title": "Winter Salad With Brussels Sprouts and Citrus",
    "url": "http://www.epicurious.com/recipes/food/views/winter-salad-with-brussels-sprouts-and-citrus"
}
