{
    "directions": [
        "In a bowl let the cranberries soak in the orange juice for 30 minutes, drain them in a sieve set over a bowl, and reserve the juice. Reserve 1 large piece of the preserved ginger and in a blender or food processor purée the remaining ginger with the syrup and the reserved orange juice. In a deep 2-quart glass serving dish arrange half the cranberries, drizzle them with about 1/2 cup of the ginger mixture, and top them with the grapes. Drizzle the grapes with about 1/2 cup of the remaining ginger mixture, top them with the grapefruit, and drizzle the grapefruit with about 1/2 cup of the remaining ginger mixture. Top the grapefruit with the pineapple, drizzle it with the remaining ginger mixture, and arrange the remaining cranberries on top. Arrange the orange sections over the cranberries, chill the compote, covered, for at least 2 hours or overnight, and serve it garnished with the reserved ginger, cut into julienne strips."
    ],
    "ingredients": [
        "2 to 2 1/2 cups dried cranberries (available at specialty foods shops and some supermarkets)",
        "2 cups fresh orange juice",
        "a 10 1/2-ounce jar preserved ginger in syrup",
        "3 cups seedless green grapes, halved",
        "3 large pink grapefruit, the rind and pith cut away with a serrated knife and the flesh sectioned",
        "1/2 pineapple, peeled, cored, and cut into 1/2-inch pieces",
        "1 large navel orange, the rind and pith cut away with a serrated knife and the flesh sectioned."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Side",
        "No-Cook",
        "Cranberry",
        "Grapefruit",
        "Orange",
        "Pineapple",
        "Winter",
        "Vegan",
        "Grape",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Winter Fruit Compote with Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/winter-fruit-compote-with-ginger-10936"
}
