{
    "directions": [
        "Generously butter a 2-quart shallow ceramic or glass baking dish.",
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Melt butter (3 tablespoons) in a 2-quart heavy saucepan over moderate heat until foam subsides, then add flour and cook roux, whisking, 2 minutes. Add milk in a slow stream and boil, whisking, then reduce heat and simmer, whisking occasionally, until thickened, about 3 minutes. Whisk in squash, cheese, brown sugar, salt, cayenne, and nutmeg until combined (mixture may not be completely smooth), then transfer to a large bowl and whisk in yolks.",
        "Beat whites with a pinch of salt in another bowl with an electric mixer until they just hold stiff peaks. Fold one fourth of whites into squash mixture to lighten, then fold in remaining whites gently but thoroughly. Spoon into baking dish and bake, uncovered, 15 minutes. Loosely cover top with foil and bake until puffed, golden brown, and just set, 25 to 30 minutes. Serve immediately, with freshly ground pepper."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter plus additional for greasing",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups whole milk",
        "1 (12-ounce) package frozen winter squash purée, thawed",
        "1 cup coarsely grated Swiss cheese (1/4 pound)",
        "1 tablespoon packed brown sugar",
        "3/4 teaspoon salt, or to taste",
        "1/4 teaspoon cayenne",
        "3/4 teaspoon freshly grated nutmeg",
        "3 large egg yolks",
        "4 large egg whites"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Squash",
        "Fall",
        "Winter",
        "Swiss Cheese",
        "Nutmeg",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Winter Squash Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/winter-squash-souffle-236420"
}
