{
    "directions": [
        "Preheat  oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.",
        "Melt 1 12-ounce package of chocolate chips in a saucepan with 2/3 cup of butter over very low heat, stirring constantly, until smooth. Watch carefully to avoid scorching; Remove from heat, and scrape into a large bowl. Beat in the sugar, a couple of tablespoons at a time, then beat in the eggs 2 at a time until the mixture is well combined. Stir in flour and salt until blended, then stir in the vanilla extract. Gently fold in 1 more 12-ounce package of chocolate chips and the pecans. Spread batter into the prepared baking pan.",
        "Bake in the preheated oven until a toothpick inserted into the center of the brownies comes out with moist crumbs, about 35 minutes. Remove from oven and cool completely.",
        "Mix the cream and 1/4 cup of butter together in a saucepan over low heat until the butter has melted, stirring constantly; pour in remaining 1 12-ounce bag of chocolate chips and stir to melt completely. Pour the mixture into a mixing bowl, and beat on Medium speed with an electric mixer until combined, about 1 minute; chill the frosting thoroughly, stirring occasionally, about 45 minutes to 1 hour. Mixture should be the consistency of thick cream; beat the frosting again with electric mixer until it forms stiff peaks, 3 to 5 minutes. Spread frosting on cooled brownies."
    ],
    "ingredients": [
        "2 (12 ounce) bags semi-sweet chocolate chips",
        "2/3 cup butter",
        "1 cup white sugar",
        "4 eggs",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "2 teaspoons vanilla extract",
        "1 cup chopped pecans",
        "1 1/2 cups heavy cream",
        "1/4 cup butter",
        "1 (12 ounce) bag semi-sweet chocolate chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Wonderful Brownies",
    "url": "http://allrecipes.com/recipe/217917/wonderful-brownies/"
}
