{
    "directions": [
        "Get all your ingredients and equipment ready. Turn the oven on to 375°F. Fill a large saucepan with hot water, put it on a high heat and cover with a lid. Put the fine grater attachment into the food processor.",
        "Put the pie shells onto a baking sheet and spoon 1 soup spoon of raspberry jam into each one. Slice 4 pear halves and divide between the pastry shells. Scatter a few lemon thyme leaves over each, if using. (If using a 9-inch shell, use all of the pear halves from the can.)",
        "Carefully separate 2 eggs and put the yolks into a big serving bowl. Put the whites into a small mixing bowl.",
        "Add the superfine sugar and a pinch of salt to the small mixing bowl with the egg whites, turn on the electric whisk, and leave running at full speed until the mixture is glossy and stiff.",
        "Add 3 tablespoons of extra virgin olive oil and a good pinch of salt & pepper to the bowl of egg yolks. Grate the Parmesan in the processor and tip it into the bowl of egg yolks with the lemon zest and juice. Reserve some of the small basil leaves, then split the rest of the bunch into 2 halves. Pound one half in a pestle & mortar until you have a green paste, and roughly chop the other half. Add both to the bowl. Stir until everything is mixed together, then season with salt & pepper.",
        "The egg whites should be glossy, smooth, and thick by now, so mix in the vanilla paste or extract, then spoon and smooth the meringue over the tartlets so you get lovely peaks. Put into the oven on the middle shelf and set the timer for 6 minutes, or until golden and lovely. (If using a 9-inch shell, lower the oven temperature to 350° and cook the tart for 20 minutes.)",
        "Put the pancetta into an empty frying pan on a medium heat and add a squashed, unpeeled clove of garlic. Once the slices are golden, turn them over and add the tablespoon of fennel seeds. Meanwhile, put the salad leaves onto a serving platter or into a large bowl. Quickly tear in some mint and tarragon leaves, and add a large handful of whole or halved grapes. When the pancetta is nice and crispy, take the pan off the heat. Toss the salad together and put on a platter. Crumble over the crispy pancetta, and sprinkle the fennel seeds on top.",
        "Make the dressing. Pour 1/4 cup of extra virgin olive oil and 2 tablespoons of balsamic vinegar into a small pitcher or screw-top jar. Add a pinch of salt & pepper and squeeze in the juice of 1/2 lemon, then take to the table with the salad so you can dress it right before tucking in.",
        "Stack the lasagne sheets on a chopping board and carefully slice them into fairly thin strips — do this in batches. Add to the pan of boiling water with a good pinch of salt. Stir, then put the lid on slightly askew and keep it at a hard boil for just 1 1/2 minutes.",
        "Check on your tartlets and take them out to cool if cooked. Take the ice cream out of the freezer so you can serve it with your tartlets when ready.",
        "This pasta must be eaten ASAP to be enjoyed properly, so call everyone around the table now. I like to use tongs to move the pasta to the egg mixture, because the cooking water that comes with it is what really makes the sauce incredible. If you find that tricky, just drain the pasta in a colander, but save the water. Toss the pasta and sauce together quickly, then add 2 or 3 more spoonfuls of cooking water to make it silkier if needed. Fresh pasta is constantly sucking up water so make it slightly looser than it needs to be and it will be perfect at the table. Have a taste. Does it need more salt or Parmesan to balance the lemon juice? If so, adjust then sprinkle over the reserved basil leaves and grate over some extra Parmesan. Take to the table, quickly dress the salad, and eat right away."
    ],
    "ingredients": [
        "2 egg yolks",
        "5 ounces Parmesan cheese, plus extra for serving",
        "zest and juice of 2 lemons",
        "a small bunch of fresh basil",
        "1 pound fresh lasagne sheets, thawed if frozen",
        "8 slices pancetta",
        "1 clove garlic",
        "1 tablespoon fennel seeds",
        "1 x 5-ounce package prewashed arugula and/or watrecress",
        "a small bunch of fresh mint",
        "a small bunch of fresh tarragon",
        "a large handful of red, green, or mixed grapes",
        "2 tablespoons balsamic vinegar",
        "1/2 lemon",
        "olive oil",
        "extra virgin olive oil",
        "sea salt & black pepper",
        "4 individual ready-to-use pie shells (or 1 x 9-inch ready-made shell)",
        "4 soup spoons raspberry jam",
        "1 x 15-ounce can pear halves in natural juice",
        "optional: 2 sprigs of fresh lemon thyme",
        "1/2 cup superfine sugar",
        "2 egg whites",
        "1 teaspoon vanilla paste or extract",
        "1 pint good-quality vanilla ice cream, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Herb",
        "Pasta",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Pear",
        "Mint",
        "Summer",
        "Family Reunion",
        "Tarragon",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Wonky Summer Pasta, Herby Salad, Pear Drop Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/wonky-summer-pasta-herby-salad-pear-drop-tartlets-368809"
}
