{
    "directions": [
        "Pulse ginger, garlic, and miso in a food processor, scraping down sides of bowl, until smooth. Transfer half of mixture (about 2 Tbsp.) to a small bowl; set aside. Add three-quarters of zucchini and cremini mushrooms to food processor and pulse until uniform and finely chopped, about 45 seconds; transfer to a medium bowl. Pulse remaining zucchini and cremini mushrooms until combined, about 10 seconds; transfer to same medium bowl.",
        "Heat 1 Tbsp. coconut oil in a large nonstick skillet over medium. Add zucchini mixture and 1 1/2 tsp. salt and cook, spreading mixture flat and stirring occasionally, until beginning to brown and liquid evaporates, about 12 minutes. Transfer to a large bowl. Add egg, breadcrumbs, 1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and 2 Tbsp. chopped cilantro and toss to combine.",
        "Heat 1 Tbsp. coconut oil in a large saucepan over low. Add reserved ginger mixture and cook, stirring occasionally, until fragrant and beginning to brown, about 2 minutes. Add broth and simmer until ready to use.",
        "Meanwhile, grease a rimmed baking sheet or large plate with coconut oil. Roll heaping tablespoonfuls of zucchini mixture into balls with your hands (you should have about 25). Transfer balls to prepared sheet.",
        "Add remaining 1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and 1/2 tsp. salt to broth. Gently add meatballs with a slotted spoon, cover, and cook until meatballs are puffed and cooked through, about 5 minutes. Uncover, add bok choy, and cook until crisp-tender, about 3 minutes. Add snow peas and beech mushrooms, then drop in wonton wrappers one at a time. Cook, tilting pot back and forth to evenly cook meatballs and vegetables (do not stir to avoid breaking up meatballs), until vegetables are crisp-tender and wontons are cooked through, about 2 minutes.",
        "Divide soup among bowls, top with scallions and 1 Tbsp. cilantro leaves, and serve.",
        "Soup can be made 3 days ahead; cover and chill."
    ],
    "ingredients": [
        "1 (4\") piece ginger, finely grated",
        "6 garlic cloves, very finely chopped",
        "2 tablespoons white miso paste",
        "1 medium zucchini (about 8 ounces), coarsely chopped, divided",
        "8 ounces cremini mushrooms, coarsely chopped, divided",
        "2 tablespoons coconut oil, divided, plus more for pan",
        "2 teaspoons kosher salt, divided",
        "1 large egg",
        "1 1/4 cups breadcrumbs",
        "2 tablespoons low-sodium soy sauce, divided",
        "2 tablespoons toasted sesame oil, divided",
        "2 tablespoons chopped cilantro plus 1 tablespoon cilantro leaves",
        "8 cups homemade or store-bought low-sodium vegetable broth",
        "2 small heads baby bok choy, cut crosswise in 2\" pieces",
        "8 ounces snow peas",
        "4 ounces white beech or thinly sliced cremini mushrooms",
        "12 fresh wonton wrappers, brushed with a pastry brush to remove excess flour, cut in half on the bias",
        "2 scallions, white and pale-green parts only, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Zucchini",
        "Dinner",
        "Meatball",
        "Ginger",
        "Mushroom",
        "Bok Choy",
        "Green Onion/Scallion",
        "Soup/Stew",
        "Noodle",
        "Cilantro",
        "No Meat, No Problem"
    ],
    "title": "Wonton Soup With Mushroom-Zucchini \"Meatballs\"",
    "url": "http://www.epicurious.com/recipes/food/views/wonton-soup-with-mushroom-zucchini-meatballs"
}
