{
    "directions": [
        "Place shrimp in a food processor and pulse a few times to coarsely chop.  Combine celery, 1 tablespoon green onion, egg white, sesame oil, salt and 1 teaspoon cornstarch with shrimp and pulse a few more times to make a chunky paste.  Transfer mixture to a bowl and stir briskly until it becomes elastic.",
        "Lay the wonton wrappers on a flat surface and place a scant teaspoon of shrimp mixture in the center of each wrapper.  Combine remaining 1 teaspoon cornstarch with 2 tablespoons water to form a paste.  One at a time, brush some cornstarch paste around the edge of a wonton wrapper and fold the wrapper in half to make a semicircle, pressing edges together to seal.  Then, holding the wonton with the curved edge facing away from you, bring the tips of the straight edge together and seal with more cornstarch paste.  Repeat with remaining wontons.",
        "Bring a large pot of water to a boil and cook the noodles in boiling water until al dente, 8 to 10 minutes.  Drain and divide between 4 serving bowls.",
        "Meanwhile, bring the chicken broth to a simmer over medium-low heat.",
        "Bring another large pot of water to a boil and drop the wontons into the boiling water.  When the wontons rise to the surface, continue to cook them one minute longer.  Remove with a slotted spoon as they finish cooking and  divide them among the 4 bowls.",
        "Pour hot chicken broth over wontons and noodles in bowls and garnish with the remaining chopped green onions to serve."
    ],
    "ingredients": [
        "1/2 pound shrimp, shelled and deveined",
        "1 tablespoon minced celery",
        "1 tablespoon minced green onion",
        "1 egg white",
        "1/2 teaspoon sesame oil",
        "1/2 teaspoon salt",
        "2 teaspoons cornstarch, divided",
        "24 round wonton wrappers",
        "2 tablespoons water",
        "1 pound dry Chinese noodles",
        "1 quart chicken stock",
        "4 tablespoons minced green onion"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Wonton Noodle Soup",
    "url": "http://allrecipes.com/recipe/26476/wonton-noodle-soup/"
}
