{
    "directions": [
        "Whisk together sugar, cornstarch, oyster sauce, and 1 tablespoon sesame oil in a large bowl; add the ground pork, shrimp, and 1 chopped green onion and mix to combine.",
        "Lay one wonton skin like a baseball diamond in front of you. Using your finger, brush beaten egg around the outer edge of the wonton skin. Place 1 tablespoon of pork mixture onto the middle of the wonton skin. Fold 'home run' corner to '2nd base' corner and press down creating a triangle. The meat filling lump is at the bottom of the triangle. Brush egg mixtures at the '1st base' and '3rd base' corners of the triangle. Fold each base corner over the meat filling lump and over each other. Brush egg mixture at the '2nd base/homerun' corner of the triangle and fold behind the meat filling lump. This is one wonton. Repeat until there are no more mixture or wrapper skins. Keep the wontons covered with a wet towel to prevent from drying.”",
        "Mix together the chicken stock, soy sauce, 2 tablespoons sesame oil, and 2 green onions in a pot over medium-high heat. Bring this to a boil; reduce heat to medium-low and simmer for 15 minutes. Add the bok choy and return to a boil until the bok choy is tender, about 5 minutes.",
        "Bring a large pot of salted water to a boil; boil wontons for 3 to 5 minutes, stirring occasionally to prevent wontons from sticking to each other or to the edges of the pot.",
        "Place wontons in a soup bowl and ladle soup over wontons to serve. Garnish with chopped green onions."
    ],
    "ingredients": [
        "1 teaspoon white sugar",
        "1 teaspoon cornstarch",
        "1 tablespoon oyster sauce",
        "1 tablespoon sesame oil",
        "1 pound lean ground pork",
        "1/4 pound diced raw shrimp",
        "1 green onion, chopped",
        "40 wonton wrappers",
        "2 green onions",
        "1 egg, beaten",
        "9 cups chicken stock",
        "1/4 cup soy sauce",
        "2 tablespoons sesame oil",
        "2 cups chopped bok choy",
        "1 cup green onions, chopped (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Wonton Soup without Ginger",
    "url": "http://allrecipes.com/recipe/171931/wonton-soup-without-ginger/"
}
