{
    "directions": [
        "Simmer pork ribs, chicken, scallions, ginger, and water in a 6- to 8-quart tall narrow stockpot, uncovered, until meat is very tender and falling apart, 4 1/2 to 5 hours. Pour broth through a sieve into a large bowl and discard solids. Cool broth, uncovered, then chill, covered, at least 1 1/2 hours.",
        "Stir together pork, yolk, scallions, ginger, soy sauce, vinegar, sesame oil, salt, and white pepper in a bowl in 1 direction with your hand until just combined (do not overwork, or filling will be tough).",
        "Put 1 wonton wrapper on a work surface (keep remaining wrappers covered with plastic wrap). Spoon a rounded teaspoon of filling in center of square, then brush water around edges. Lift 2 opposite corners together to form a triangle and enclose filling, pressing edges firmly around mound of filling to eliminate air pockets and seal. Moisten opposite corners of long side. Curl moistened corners toward each other, overlapping one on top of the other, and carefully press corners together to seal. Make more wontons in same manner.",
        "Skim any fat from broth, then bring to a simmer in a 5- to 6-quart pot. Stir in bok choy, salt, and white pepper and simmer, uncovered, until bok choy is crisp-tender, 3 to 4 minutes. Add wontons and simmer, uncovered, gently stirring, until filling is just cooked through, about 3 minutes (cut 1 open to check)."
    ],
    "ingredients": [
        "2 lb country-style (meaty) pork ribs",
        "2 lb chicken thighs, legs, and wings",
        "4 scallions, coarsely chopped",
        "1 (2-inch) piece peeled fresh ginger, chopped",
        "12 cups water",
        "1 1/2 lb bok choy, leaves halved lengthwise, then stalks and leaves thinly sliced crosswise",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon white pepper",
        "1/2 lb ground pork (not lean)",
        "1 large egg yolk",
        "2 scallions, finely chopped",
        "1 (1 1/2-inch) piece peeled fresh ginger, finely chopped",
        "1 tablespoon soy sauce",
        "1 teaspoon rice vinegar (not seasoned)",
        "1/2 teaspoon Asian sesame oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon white pepper",
        "About 30 wonton wrappers, thawed if frozen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Leafy Green",
        "Pork",
        "Dinner",
        "Pork Rib",
        "Winter",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Wonton Soup with Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/wonton-soup-with-bok-choy-109023"
}
