{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Cut and set aside 25 pieces of plastic wrap about 5 inches square.",
        "For cookies, beat 1/2 cup of vegetable shortening, 2 cups of milk, 2 cups of sugar, the eggs, and 2 teaspoons of vanilla extract together in a large mixing bowl until smooth and creamy. In a separate bowl, whisk the 4 cups of flour with both amounts of unsweetened cocoa, baking soda, and salt until thoroughly combined. Beat the flour mixture into the wet ingredients just until smooth.",
        "Scoop up the batter by teaspoons, and drop onto ungreased baking sheets in small round dollops about 2 inches apart. Recipe should make about 50 cookies. The cookies will rise and expand a lot.",
        "Bake in the preheated oven until the cookies are set in the middle, 8 to 10 minutes. Allow to cool on baking sheets for several minutes before removing to finish cooling on racks.",
        "To make the filling, place 1 cup milk in a microwave-safe measuring cup, and cook in microwave until hot but not simmering, 1 to 2 minutes. Pour the heated milk into a large mixing bowl. Add the cup of room temperature butter, 1 cup of vegetable shortening, 2 cups of sugar, 2 tablespoons of flour, 2 teaspoons of vanilla extract, and the marshmallow creme. Beat the mixture on high speed until the frosting is fluffy, 5 to 10 minutes. At first the frosting will appear lumpy, but keep beating.",
        "To fill the cookies, choose 2 cookies that are about the same size, and spread about 1 1/2 tablespoon of the frosting onto the flat bottom of a cookie. Top with the other cookie, flat side down, and wrap the filled cookie in a sheet of plastic wrap. Place the filled cookie into the freezer. Repeat with remaining cookies and frosting, wrapping each whoopie pie in plastic wrap and freezing.",
        "To serve, remove whoopie pies from the freezer and allow to thaw until very cold but not frozen, 10 to 15 minutes."
    ],
    "ingredients": [
        "1/2 cup vegetable shortening",
        "2 cups milk",
        "2 cups white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "4 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder (such as Hershey's®)",
        "2 tablespoons unsweetened cocoa powder (such as Hershey's®)",
        "1 tablespoon baking soda",
        "1 1/2 teaspoons salt",
        "1 cup milk",
        "1 cup butter at room temperature",
        "1 cup vegetable shortening",
        "2 cups white sugar",
        "2 tablespoons all-purpose flour",
        "2 teaspoons vanilla extract",
        "2 (7 ounce) jars marshmallow creme"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "World's Best Maine Whoopie Pies - Ayuh",
    "url": "http://allrecipes.com/recipe/219630/worlds-best-maine-whoopie-pies---ayu/"
}
