{
    "directions": [
        "Melt margarine in a skillet over medium heat. Cook and stir onion and green bell pepper in margarine until tender, about 5 minutes. Stir mustard, Worcestershire sauce, seafood seasoning, salt, hot pepper sauce, black pepper, and cayenne pepper into the onion mixture. Sprinkle flour over the mixture; stir to integrate. Pour cream over the mixture; bring to a boil, stirring constantly and cook for 1 minute. Fold crab meat into the mixture.",
        "Spoon some of the liquid from the skillet into the bowl with the beaten egg yolks to temper the egg; stir. Pour the egg mixture into the skillet and stir. Cook, stirring constantly, until the mixture thickens, about 5 minutes.",
        "Transfer crab mixture to a bowl; refrigerate until chilled completely, about 1 hour.",
        "Mix bread crumbs, melted butter, and paprika in a shallow bowl.",
        "Divide the crab mixture into 4 portions; form into patties. Gently press the patties into the bread crumb mixture to coat.",
        "Pour enough corn oil into a flat-bottomed pan to be 1-inch deep; heat to 350 degrees F (175 degrees C).",
        "Cook patties in hot oil until golden brown, 2 to 3 minutes per side."
    ],
    "ingredients": [
        "2 tablespoons margarine",
        "1/2 cup minced onion",
        "1/2 cup minced green bell pepper",
        "1 tablespoon dry mustard",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon seafood seasoning (such as Old Bay®)",
        "3/4 teaspoon salt",
        "1/4 teaspoon hot pepper sauce (such as Tabasco®)",
        "1/4 teaspoon ground black pepper",
        "1 pinch cayenne pepper",
        "1/4 cup all-purpose flour",
        "1 1/4 cups light cream",
        "1 pound crab meat",
        "2 egg yolks, beaten",
        "1/2 cup bread crumbs",
        "1 tablespoon melted butter",
        "1/2 teaspoon paprika",
        "1 cup corn oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dad G's Crab Cakes",
    "url": "http://allrecipes.com/recipe/230961/dad-gs-crab-cakes/"
}
