{
    "directions": [
        "Melt the bacon drippings in a large heavy pot over medium heat. Add the onions and cook until they are translucent.",
        "Combine the beef with the garlic, ground chile, chili powder and cumin. Add this meat-and-spices to the onions in the pot. Break up any meat that sticks together as you cook, stirring occasionally, about 30 minutes, until meat is evenly browned (very browned, not just gray). Sprinkle in Hungarian paprika and oregano.",
        "Pour in the tomato sauce, tomato paste, water, salt, parsley and jalapeno. Bring to a boil, then lower the heat and simmer, uncovered, for 1 hour.  NOTE: True Texans DO NOT add beans to their chili, but my husband loves them, so this is the point where you can add as many cans of drained and rinsed pinto beans as you wish (I add 2 cans, but shhhhhh don't tell my Daddy!!!).",
        "During cooking you may squeeze the jalapeno as it softens against the sides of the pot to release more heat if desired.",
        "Mix in the masa harina, and cook while stirring for 30 minutes longer, or until desired consistency is achieved.  Taste and adjust seasonings."
    ],
    "ingredients": [
        "3 tablespoons bacon drippings",
        "2 large onions, chopped",
        "8 pounds beef stew meat, or coarse ground chili beef",
        "5 cloves garlic, finely chopped",
        "4 tablespoons ground red chile pepper",
        "4 tablespoons mild chili powder",
        "1 tablespoon ground cumin",
        "1/4 cup sweet Hungarian paprika",
        "1 teaspoon dried Mexican oregano",
        "3 (10 ounce) cans tomato sauce",
        "1 (6 ounce) can tomato paste",
        "3 cups water",
        "2 tablespoons salt",
        "1/4 cup dried parsley (optional)",
        "1 fresh jalapeno peppers",
        "1 cup masa harina flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Daddy's 'If They'da had This at the Alamo we would'ha WON!' Texas Chili",
    "url": "http://allrecipes.com/recipe/86915/daddys-if-theyda-had-this-at-the-a/"
}
