{
    "directions": [
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Allow the potatoes to cool.",
        "While potatoes are cooking, place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spiral pasta, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink, rinse with cold water, and let cool.",
        "Peel the potatoes. Chop potatoes and hard-cooked eggs into bite-size pieces in a large bowl. Mix in the cooked pasta, dill pickles, and green onions. In a bowl, stir together the mayonnaise, Worcestershire sauce, enough dill pickle juice to make a creamy dressing, and salt and pepper to taste. Pour the dressing over the potato mixture, and toss lightly to coat all ingredients with dressing. Chill the salad until cold, at least 30 minutes."
    ],
    "ingredients": [
        "5 pounds potatoes, unpeeled",
        "12 eggs",
        "1 (16 ounce) package uncooked spiral pasta",
        "1 (16 ounce) jar dill pickles, chopped (reserve juice)",
        "2 bunches green onions, chopped",
        "3 cups mayonnaise, or to taste",
        "2 tablespoons Worcestershire sauce",
        "1/4 cup dill pickle juice, or as needed",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dad's Potato Salad",
    "url": "http://allrecipes.com/recipe/214717/dads-potato-salad/"
}
