{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "Place the peas and carrots, green beans, and celery into a saucepan; cover with water, bring to a boil, and simmer over medium-low heat until the celery is tender, about 8 minutes. Drain the vegetables in a colander set in the sink, and set aside.",
        "Melt the butter in a saucepan over medium heat, and cook the onion until translucent, about 5 minutes. Stir in 2/3 cup of flour, salt, black pepper, celery seed, onion powder, and Italian seasoning; slowly whisk in the chicken broth and milk until the mixture comes to a simmer and thickens. Remove from heat; stir the cooked vegetables and turkey meat into the filling until well combined.",
        "Fit 2 pie crusts into the bottom of 2 9-inch pie dishes. Spoon half the filling into each pie crust, then top each pie with another crust. Pinch and roll the top and bottom crusts together at the edge of each pie to seal, and cut several small slits into the top of the pies with a sharp knife to release steam.",
        "Bake in the preheated oven until the crusts are golden brown and the filling is bubbly,  30 to 35 minutes. If the crusts are browning too quickly, cover the pies with aluminum foil after about 15 minutes. Cool for 10 minutes before serving."
    ],
    "ingredients": [
        "2 cups frozen peas and carrots",
        "2 cups frozen green beans",
        "1 cup sliced celery",
        "2/3 cup butter",
        "2/3 cup chopped onion",
        "2/3 cup all-purpose flour",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon celery seed",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon Italian seasoning",
        "1 3/4 cups chicken broth",
        "1 1/3 cups milk",
        "4 cups cubed cooked turkey meat - light and dark meat mixed",
        "4 (9 inch) unbaked pie crusts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dad's Leftover Turkey Pot Pie",
    "url": "http://allrecipes.com/recipe/215447/dads-leftover-turkey-pot-pie/"
}
