{
    "directions": [
        "Pulse flour, butter, and confectioners sugar in a food processor until it resembles coarse meal. Add egg yolks and pulse just until a dough forms.",
        "Transfer dough to a lightly floured surface and divide in half. Form each half into a 4-inch square (about 1 inch thick) and wrap in plastic wrap. Freeze until solid, at least 2 hours.",
        "Bring whole plums, sugar, wine, and bay leaf to a simmer in a heavy medium saucepan over medium-low heat, covered, stirring occasionally until sugar has dissolved (be careful juices don't boil over). Reduce heat to low and simmer, covered, stirring occasionally, until plums fall apart, about 30 minutes. Transfer to a bowl and chill, uncovered, until cold, then cover. Discard pits and bay leaf, then add a little confectioners sugar to taste if desired.",
        "Coarsely grate pastry from one frozen square into tartlet pans, dividing it evenly. (Reserve remaining dough for another use.) Press dough flakes into tartlet pans to line bottoms and sides evenly. Prick bottoms all over with a fork, then freeze tartlets until firm, at least 1 hour.",
        "Preheat oven to 425°F with rack in middle.",
        "Put tartlets in a shallow baking pan and put in oven. Turn oven temperature down to 400°F and bake until shells are golden all over, 15 to 18 minutes.",
        "Transfer tartlet pans to a rack to cool completely, then remove shells from pans.",
        "Put cream in a large bowl, then scrape seeds from vanilla bean into cream. Beat in sugar and zest with an electric mixer until cream just holds stiff peaks. Fold in about 2 tablespoons plum compote, then divide cream among tartlet shells. Serve topped with some of remaining compote (you will have a lot left over)."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 sticks (1/2 pound) cold unsalted butter, cut into 1/2-inch cubes",
        "1 cup confectioners sugar",
        "3 large egg yolks",
        "1 pound damson plums or prune plums",
        "1 3/4 cups sugar",
        "2 tablespoons white wine",
        "1 Turkish or 1/2 California bay leaf",
        "1 cup heavy cream",
        "1/2 vanilla bean, split lengthwise",
        "1 tablespoon sugar",
        "1/2 teaspoon grated lemon zest",
        "Equipment: 6 (4-inch) fluted tartlet pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Plum",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Damson Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/damson-tartlets-240164"
}
