{
    "directions": [
        "In a medium bowl, cream together the butter and 2/3 cup of flour. Divide into 2 equal parts, and roll each half between 2 pieces of waxed paper into a 6 x12 inch sheet. Refrigerate.",
        "In a large bowl, mix together the dry yeast and 3 cups of the remaining flour. In a small saucepan over medium heat, combine the milk, sugar and salt. Heat to 115 degrees F (43 degrees C), or just warm, but not hot to the touch. Mix the warm milk mixture into the flour and yeast along with the eggs, and lemon and almond extracts. Stir for 3 minutes. Knead in the remaining flour 1/2 cup at a time until the dough is firm and pliable. Set aside to rest until double in size.",
        "Cut the dough in half, and roll each half out to a 14 inch square. Place one sheet of the cold butter onto each piece of dough, and fold the dough over it like the cover of a book. Seal edges by pressing with fingers. Roll each piece out to a 20x 12 inch rectangle, then fold into thirds by folding the long sides in over the center. Repeat rolling into a large rectangle, and folding into thirds. Wrap in plastic and refrigerate for at least 30 minutes.",
        "Remove from the refrigerator one at a time, and roll and fold each piece two more times. Return to the refrigerator to chill again before shaping. If the butter gets too warm, the dough will become difficult to manage.",
        "To make danishes, roll the dough out to 1/4 inch thickness. The dough can be cut into squares, with a filling placed in the center. Fold 2 of the corners over the center to form a filled diamond shape. Or, fold the piece in half, cut into 1 inch strips, stretch, twist and roll into a spiral. Place a dollop of preserves or other filling in the center. Place danishes on an ungreased baking sheet, and let rise until doubled. Preheat the oven to 450 degrees F (220 degrees C). Danishes can be brushed with egg white for a shiny finish.",
        "Bake for 8 to 10 minutes in the preheated oven, or until the bottoms are golden brown."
    ],
    "ingredients": [
        "2 cups unsalted butter, softened",
        "2/3 cup all-purpose flour",
        "2 1/2 cups milk",
        "1/2 cup white sugar",
        "2 teaspoons salt",
        "4 1/2 teaspoons active dry yeast",
        "8 cups all-purpose flour",
        "2 eggs",
        "1 teaspoon lemon extract",
        "1 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Danish Pastry",
    "url": "http://allrecipes.com/recipe/27342/danish-pastry/"
}
