{
    "directions": [
        "In a large bowl, cut 1 cup butter into flour until crumbly, leaving pea-sized chunks. Stir in sour cream, and mix well; dough will be very sticky. Form dough into a ball. Cover tightly, and refrigerate 8 hours, or overnight.",
        "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet. Prepare the filling by combining 1 cup butter, brown sugar, and 1 cup chopped walnuts.",
        "Divide dough into three equal parts; return two parts to the refrigerator to keep cold. Quickly form 1/3 of the dough into a rectangle, and flour lightly. On a heavily floured surface, roll out to approximately 12x17 inches. Position lengthwise on the work surface. Along the long edges of the dough rectangle, use a sharp knife to cut 4 inch long angled lines about 1/2 inch apart. Spoon 1/3 of the filling along the length of the rectangle's uncut center. Alternating from one side of the dough to the other, fold each 1/2 inch wide strip towards the center, crisscrossing the filling in a braid-like fashion. Lightly press together the ends of the strips to seal. Sprinkle with 1/3 of the remaining walnuts. Repeat with remaining ingredients to form 3 braided danishes. Arrange danishes on prepared baking sheet.",
        "Bake for 30 minutes in the preheated oven, or until golden brown. Cool for approximately 30 minutes. While the danishes are cooling, prepare the icing: mix confectioners sugar and water until smooth. Drizzle in fine streams over warm danishes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2432&h=1273&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1989517.jpg",
    "ingredients": [
        "1 cup butter",
        "2 cups sifted all-purpose flour",
        "1 cup sour cream",
        "1 cup butter, softened",
        "2 cups brown sugar",
        "1 ½ cups chopped English walnuts, divided",
        "1 cup confectioners' sugar",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Danish Kringle",
    "url": "http://allrecipes.com/recipe/23971/danish-kringle/"
}