{
    "directions": [
        "Measure 3 1/2 cups flour into a bowl or work bowl of food processor with steel blade in place. Cut the butter into 1/4-inch slices and add to the flour. Process or cut the butter into the flour until the butter is about the size of kidney beans.",
        "In a large bowl, dissolve the yeast in the warm water. Let stand 5 minutes. Stir in the cream or milk, cardamom, salt, eggs, and sugar.",
        "Turn the flour-butter mixture into the liquid ingredients, and with a rubber spatula mix carefully just until the dry ingredients are moistened. Cover and refrigerate 4 hours, overnight, or up to 4 days.",
        "Turn the dough out onto a lightly floured board; dust with flour. Pound and flatten to make a 16- to 20-inch rectangle. Fold into thirds, making 3 layers. Turn dough around and roll out again. Fold from the short sides into thirds. This should result in a perfect square. Repeat folding and rolling again if you wish.",
        "Wrap and chill the dough 30 minutes or as long as overnight.",
        "Cover two baking sheets with parchment paper or lightly grease and flour them.",
        "Divide the chilled dough into 2 parts. Roll each part out to make a rectangle 12 by 6 inches. Place these strips on the prepared baking sheets.",
        "To make the filling, cream the butter and sugar until light. Blend in the almond extract, almonds, almond paste, and egg white.",
        "Spread filling down the length of the center of the strips. Cut slanting strips at 3/4-inch intervals along both sides up toward the center using a pastry wheel. Fold strips over the filling in a crisscross manner",
        "Preheat the oven to 400ºF.",
        "Let strips rise for 15 to 30 minutes, just until the pastry strips look puffy; they will not double.",
        "To make a glaze, beat the egg with the milk or water. Brush the pastry lightly with it. Sprinkle the sugar and/or sliced almonds over the top.",
        "Bake about 15 minutes or until golden.",
        "Frost, if desired, with almond-water icing. Blend the sugar, water, and almond extract until smooth and thin enough to drizzle over the braids."
    ],
    "ingredients": [
        "3 1/2 to 4 cups all-purpose flour",
        "1 1/2 cups (3 sticks) chilled unsalted butter",
        "2 packages active dry yeast",
        "1/2 cup warm water",
        "1/2 cup heavy cream or undiluted evaporated milk",
        "1/2 teaspoon freshly crushed cardamom seed (optional)",
        "1/2 teaspoon salt",
        "2 eggs, room temperature",
        "1/4 cup sugar",
        "1/4 cup (1/2 stick) soft butter",
        "1 cup powdered sugar",
        "1/4 teaspoon almond extract",
        "1 cup finely pulverized almonds",
        "1 (3-ounce) package almond paste",
        "1 egg white",
        "1 slightly beaten egg",
        "2 tablespoons milk or water",
        "Pearl sugar or crushed sugar cubes, for topping",
        "Chopped or sliced almonds for topping",
        "1 cup powdered sugar",
        "2 to 3 teaspoons warm water",
        "1/2 teaspoon almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pastry",
        "Dessert",
        "Christmas",
        "Almond"
    ],
    "title": "Danish Pastry Braid",
    "url": "http://www.epicurious.com/recipes/food/views/danish-pastry-braid"
}
