{
    "directions": [
        "1. Pour the wine into a large saucepan set over medium heat. When the wine is hot, carefully set it aflame. Let the flames die out, then increase the heat so that the wine boils; allow it to boil until it cooks down by half. Remove from the heat.",
        "2. Center a rack in the oven and preheat to 350°F.",
        "3. Warm the oil in a large, heavy, ovenproof pot over medium-high heat. Season the ribs all over with salt and the crushed pepper. Dust half of the ribs with about 1 tablespoon flour. Then, when the oil is hot, slip the ribs into the pot and sear 4 to 5 minutes on each side, until well-browned. Transfer the ribs to a plate. Repeat with remaining ribs. Remove all but 1 tablespoon of the fat from the pot, lower the heat under the pot to medium and toss in the vegetables and herbs. Brown the vegetables lightly, 5 to 7 minutes, then stir in the tomato paste and cook for 1 minute.",
        "4. Add the wine, ribs and broth to the pot. Bring to a boil, cover tightly and place in the oven to braise for 2 1/2 hours or until the ribs are very tender. Every 30 minutes, skim and discard fat from the surface. (It's best to make the recipe to this point, cool and chill the ribs and broth in the pan overnight; scrape off the fat the next day. Rewarm before continuing.)",
        "5. Carefully transfer the meat to a platter; keep warm. Boil the pan liquid until it has reduced to 1 quart. Season with salt and white pepper and pass through a fine strainer; discard the solids. (The ribs and sauce can be combined and kept covered in the refrigerator for 2 to 3 days. Reheat gently, basting frequently, on top of the stove or in a 350°F oven.)",
        "6. To serve, spoon the celery root puree into the center of 8 plates and top each with a short rib. Cross 2 pieces of braised celery over each serving. Pour the sauce onto the plate around the puree."
    ],
    "ingredients": [
        "3 bottles dry red wine",
        "2 tablespoons vegetable oil",
        "8 short ribs, trimmed of excess fat",
        "Salt and crushed black peppercorns",
        "Flour, for dredging",
        "8 large shallots, peeled, trimmed, split, rinsed and dried",
        "2 medium-sized carrots, peeled, trimmed and cut into 1-inch lengths",
        "2 ribs of celery, peeled, trimmed and cut into 1-inch lengths",
        "1 medium-sized leek (white and light-green parts), coarsely chopped, washed and dried",
        "10 cloves of garlic, peeled",
        "6 sprigs flat-leaf parsley",
        "2 bay leaves and 2 thyme sprigs",
        "2 tablespoons tomato paste",
        "3 quarts unsalted beef broth",
        "Freshly ground white pepper",
        "Celery Duo , for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Braise",
        "Dinner",
        "Beef Rib",
        "Celery",
        "Red Wine",
        "Parade",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Daniel Boulud's Short Ribs Braised in Red Wine with Celery Duo",
    "url": "http://www.epicurious.com/recipes/food/views/daniel-bouluds-short-ribs-braised-in-red-wine-with-celery-duo-106671"
}
