{
    "directions": [
        "Combine butter and granulated sugar in a large bowl; scrape in vanilla seeds and discard pod. Using an electric mixer on high speed, beat until very light and fluffy, about 5 minutes. Beat in 1 egg. Reduce speed to low; gradually mix in 2 cups flour. Form dough into a 3/4\"-thick disk. Wrap in plastic and chill until firm, about 2 hours.",
        "Place racks in upper and lower thirds of oven and preheat to 350°F. Let disk of dough sit at room temperature until slightly softened, about 5 minutes. Roll out on a lightly floured sheet of parchment paper, shifting often on sheet and dusting with more flour as needed to keep from sticking, until about 3/8\" thick.",
        "Punch out rounds with large cutter; punch out centers with smaller cutter. Transfer to parchment-lined baking sheets, spacing 1 1/2\" apart. Pat scraps into a 3/4\"-thick disk. Chill 15 minutes.",
        "Beat remaining egg in a small bowl with 1 tsp. water; brush cookies with egg wash; sprinkle with sanding sugar. Freeze 10 minutes. Bake, rotating baking sheets halfway through, until edges are golden brown, 10–15 minutes. Transfer to wire racks; let cool. Repeat with scraps and remaining egg wash and sanding sugar.",
        "Dough can be made 1 month ahead; freeze. Cookies can be baked 2 days ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "1 cup (2 sticks) chilled salted butter, cut into pieces",
        "3/4 cup granulated sugar",
        "1 vanilla bean, split lengthwise",
        "2 large eggs",
        "2 cups all-purpose flour, plus more",
        "1 cup white sanding sugar",
        "A 3\"-diameter and a 1 1/2\"-diameter fluted cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Christmas",
        "Kid-Friendly",
        "Cookies",
        "Vanilla",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Danish Salted-Butter Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/danish-salted-butter-cookies"
}
