{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). In a mortar, smash together 1/4 cup of garlic powder, 1/4 cup of onion powder, the crushed red pepper flakes, and 1 tablespoon of cracked black pepper until the mixture forms a fine powder. Place the spice mix into a large shallow bowl.",
        "Inject the pork roast all over with the Creole marinade; blot moisture from the outside of the roast. Rub the spice mix all over the pork roast to thoroughly coat. Melt the butter in a large skillet over medium heat, then cook and stir the shallots and elephant garlic until the garlic becomes lightly golden brown. Sear the coated pork roast in the hot butter on all sides until the spice coating is golden brown, 1 to 2 minutes per side. Place the roast into a roasting pan or Dutch oven with the fat side up; scrape up the butter, cooked shallots and garlic, and sprinkle around the roast. Arrange the sweet onions, red potatoes, carrots, and celery pieces around the roast. Mix 1 cup of water with the remaining spice rub, and pour evenly over roast.",
        "Cover the roasting pan with a lid, and cook in the preheated oven until the meat is very tender, 3 3/4 to 4 hours.",
        "Remove the roast and set aside on a serving platter; surround the meat with the cooked vegetables. Whisk 1 tablespoon of cracked black pepper, 2 tablespoons of garlic powder, 1 tablespoon of onion powder, and the brown gravy mix together with 2 cups of water in a bowl, and whisk the mixture into the liquid left in the roasting pan. Place the pan over medium heat, and cook, whisking constantly, until the gravy has come to a boil and has thickened, about 5 minutes. Serve alongside the roast and vegetables."
    ],
    "ingredients": [
        "1/4 cup garlic powder",
        "1/4 cup onion powder",
        "1 tablespoon crushed red pepper flakes",
        "1 tablespoon freshly cracked black pepper",
        "1 (3 1/2) pound pork shoulder roast",
        "1/2 cup Creole-style butter injectable marinade (such as Tony Chachere's Roasted Garlic & Herb Marinade®)",
        "1/4 cup butter",
        "2 large shallots, chopped",
        "2 cloves elephant garlic, chopped",
        "1 cup water",
        "3 sweet onions (such as Vidalia®), peeled and quartered",
        "7 red potatoes",
        "10 large baby carrots",
        "4 stalks celery, cut into 4 pieces",
        "1 tablespoon freshly cracked black pepper",
        "2 tablespoons garlic powder",
        "1 tablespoon onion powder",
        "2 cups water",
        "6 tablespoons dry brown gravy mix"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dan's Fallin' Apart Pork Pot Roast with Cracked Pepper Gravy",
    "url": "http://allrecipes.com/recipe/215784/dans-fallin-apart-pork-pot-roast-wi/"
}
