{
    "directions": [
        "Pour milk in a heatproof bowl, and gently warm in a microwave oven set on Low until milk is about 100 degrees F (38 degrees C), about 15 seconds. Mix in the sugar and honey, and stir to dissolve. Mix in the yeast, and let stand until the yeast activates and forms a creamy layer on the milk, about 15 minutes.",
        "Place 4 cups of bread flour and the salt into the mixing bowl of a stand mixer; pour in the yeast mixture, and mix on slow speed with a mixing paddle until thoroughly combined, about 1 minute; dough will be very wet. Add the butter, and mix in the remaining 2 cups of bread flour, or as needed, until the dough begins to gather itself into a ball. Change the fitting from the mixing paddle to a dough hook, and machine-knead the dough until smooth and springy, about 4 minutes.",
        "Transfer the dough onto a well-floured work surface, and knead until you see the surface of the dough begin to break during folding and kneading. Roll dough into a ball, and place into a lightly floured large bowl. Cover the bowl  with a kitchen towel, and set into a warm place to rise until doubled, about 1 hour.",
        "Spray 2 9x5-inch loaf pans with cooking spray.",
        "Punch down the dough, remove to the floured surface, and knead for 2 more minutes; cut the dough in half with a sharp knife. Form the dough into logs, adding more flour if necessary, and place the loaves into the sprayed pans. Cover the pans with a kitchen towel, and place into a warm place to rise until doubled, about 1 more hour.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place the bread loaves into the preheated oven, and turn the heat down to 350 degrees F (175 degrees C). Bake until the tops are golden brown and the loaves make a hollow sound when thumped, about 25 minutes. Cool the pans on baking racks for about 5 minutes before turning the bread loaves out to finish cooling on racks. Cover the loaves with a kitchen towel as they cool."
    ],
    "ingredients": [
        "2 cups milk",
        "1/3 cup white sugar",
        "1/3 cup honey",
        "2 teaspoons active dry yeast",
        "6 cups bread flour, or as needed - divided",
        "1 teaspoon salt",
        "1/4 cup butter, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dan's Old Fashioned White Bread",
    "url": "http://allrecipes.com/recipe/218659/dans-old-fashioned-white-bread/"
}
