{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line with waxed paper. Stir chocolate in top of double boiler set over simmering water until melted. Cool.",
        "Sift flour and baking soda into small bowl. Using electric mixer, beat butter in large bowl until creamy. Add both sugars and beat until fluffy. Beat in eggs 1 at a time. Beat in vanilla, then melted chocolate. Add dry ingredients alternately with buttermilk in 2 additions each, beating just until blended after each addition. Mix in walnuts.",
        "Divide batter between prepared pans. Bake cakes until tester inserted into center comes out with a few moist crumbs attached, about 20 minutes. Cool cakes in pans on racks.",
        "Stir chocolate in top of double boiler set over simmering water until melted. Remove from over water. Using electric mixer, beat butter in large bowl until creamy. Gradually add sugar, beating until smooth. Beat in 2 tablespoons milk. Beat in chocolate. Thin with milk to spreading consistency.",
        "Cut around pan sides. Turn out cakes; peel off paper. Place 1 cake layer flat side down on platter. Spread 1 cup icing over. Top with second cake layer, flat side up. Spread remaining icing over cake. Press nuts onto sides of cake. (Can be made 1 day ahead. Cover with cake dome and store at room temperature.)"
    ],
    "ingredients": [
        "3 ounces unsweetened chocolate, chopped",
        "1 cup all purpose flour",
        "1/2 teaspoon baking soda",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup packed golden brown sugar",
        "1/2 cup sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup buttermilk",
        "3/4 cup chopped walnuts",
        "4 ounces unsweetened chocolate, chopped",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3 cups powdered sugar",
        "6 tablespoons (about) hot milk",
        "1 cup chopped walnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Walnut"
    ],
    "title": "Dark Chocolate Walnut Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-walnut-layer-cake-285"
}
