{
    "directions": [
        "Do not preheat oven. Butter and flour a 12-cup bundt pan, knocking out any excess flour.",
        "Into a small bowl sift together flour, unsweetened cocoa powder, and salt. In another small bowl stir together baking soda and sour cream.",
        "In a large bowl with an electric mixer (preferably a standing electric mixer) beat together butter and sugars until light and fluffy, about 10 minutes. Beat in extracts and add eggs 1 at a time, beating well after each addition. With mixer at low speed, add flour mixture and sour cream mixture alternately in batches, beating until just combined.",
        "Pour batter into bundt pan and put in middle of cold oven. Set oven to 350°F and bake cake 1 hour and 25 minutes, or until a tester comes out clean. Cool cake in pan on a rack 15 minutes and turn out onto rack to cool completely. Pound cake keeps, wrapped in plastic wrap, at room temperature 1 week. Alternatively, pound cake may be frozen, wrapped well in plastic wrap and foil, 3 months.",
        "Chop bittersweet chocolate and in a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate with butter, stirring until smooth. Transfer glaze to a pastry bag fitted with a #3 plain tip (slightly smaller than 1/8 inch). (Alternatively, transfer glaze to a small heavy-duty sealable plastic bag and press out excess air. Snip off 1 corner, making a small hole.) Pipe glaze back and forth over top of cake, letting it drip down sides. Let glaze set 30 minutes at room temperature.",
        "Serve cake with dollops of sour cream and strawberries."
    ],
    "ingredients": [
        "2 1/4 cups cake flour",
        "3/4 cup unsweetened Dutch-process cocoa",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 cup sour cream (8 1/2 ounces)",
        "2 1/4 sticks (1 cup plus 2 tablespoons) unsalted butter, softened",
        "1 1/2 cups granulated sugar",
        "1 1/2 cups packed dark brown sugar",
        "1 tablespoon chocolate extract* (optional)",
        "1 teaspoon vanilla extract",
        "6 large eggs",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "2 tablespoons unsalted butter",
        "Accompaniments:brown sugar sour cream",
        "strawberries",
        "*available by mail order"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Gourmet"
    ],
    "title": "Dark Chocolate Brown Sugar Pound Cake with Chocolate Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-brown-sugar-pound-cake-with-chocolate-glaze-15005"
}
