{
    "directions": [
        "Preheat oven to 325°F. Lightly butter and flour pan. Heat chocolate, sugar, and 1 cup butter in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring, until chocolate is almost completely melted, about 3 minutes; remove from heat and continue to stir until chocolate is completely melted. Let cool completely.",
        "Using an electric mixer on medium speed, add eggs to chocolate mixture 1 at a time, beating to blend after each addition. Beat until mixture has a mousse-like consistency. Reduce speed to low and add salt and 1/3 cup flour; mix until smooth. Scrape batter into prepared pan; smooth top.",
        "Bake cake until top is firm and edges are slightly darkened, 55–65 minutes (rely on visual cues; a tester inserted into cake's center will come out clean before cake is truly done). Transfer pan to a wire rack and let cake cool completely in pan before turning out.",
        "Heat chocolate, butter, and salt in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring, until chocolate and butter are melted, about 5 minutes. Whisk in powdered sugar.",
        "Meanwhile, bring wine just to a boil in a small saucepan.",
        "Remove chocolate mixture from heat and whisk in wine; let cool until slightly thickened and a rubber spatula leaves a trail in mixture when stirring, 8–10 minutes.",
        "Set cake on a wire rack set over a rimmed baking sheet. Pour glaze over cake and spread it across the top and over the edges with an offset spatula. Let cake stand at room temperature until glaze is set, 2–3 hours.",
        "DO AHEAD: Cake can be made and glazed 2 days ahead. Chill. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, cut into pieces, plus more for pan",
        "1/3 cup all-purpose flour, plus more for pan",
        "8 ounces bittersweet chocolate (at least 70% cacao), chopped",
        "1 cup sugar",
        "4 large eggs",
        "3/4 teaspoons kosher salt",
        "8 ounces bittersweet chocolate (at least 70% cacao), finely chopped",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces",
        "1/2 teaspoon kosher salt",
        "1/2 cup powdered sugar",
        "1/2 cup red wine (such as Pinot Noir)",
        "Special equipment: A 9\" springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Red Wine",
        "Birthday",
        "Engagement Party",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Darkest Chocolate Cake With Red Wine Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/darkest-chocolate-cake-with-red-wine-glaze-51214740"
}
