{
    "directions": [
        "Heat chocolate and butter in a heatproof bowl set over a saucepan of simmering water (bottom of bowl should not touch water), stirring occasionally, until chocolate and butter are melted and well blended, about 5 minutes. Set chocolate mixture aside.",
        "Using an electric mixer on medium-high speed, beat egg yolks and 1/4 cup sugar in a medium bowl until pale and fluffy, about 5 minutes.",
        "Using electric mixer with clean beaters, beat egg whites and remaining 3 tablespoons sugar in another medium bowl until medium-stiff peaks form, about 3 minutes. Using a large spatula, gently fold egg yolk mixture into chocolate mixture until no streaks remain. Starting in the center of the mixture and working your way toward the edges of the bowl, gently fold egg whites into chocolate mixture (make sure to scrape up from the bottom), rotating bowl as you go, until no streaks remain (this will incorporate the egg whites without deflating them; you don't want to lose volume).",
        "Divide mousse among ramekins, smooth surface, and chill at least 4 hours.",
        "Mousse can be made 4 days ahead. Cover and keep chilled. Topping and assembly Whip cream and sugar in a medium bowl until medium peaks form."
    ],
    "ingredients": [
        "7 ounces semisweet or bittersweet chocolate (preferably 70% cacao)",
        "6 tablespoons unsalted butter",
        "6 large eggs, separated",
        "1/4 cup plus 3 tablespoons sugar",
        "1 cup chilled heavy cream",
        "3 tablespoons sugar",
        "1 tablespoon unsweetened cocoa powder",
        "Eight 6-ounce ramekins or bowls"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dark-Chocolate Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-mousse-56389988"
}
