{
    "directions": [
        "Preheat oven to 350°F. Lightly coat pan with nonstick spray. Bring molasses and stout to a simmer in a small saucepan, whisking to incorporate. Remove from heat and stir in baking soda; let cool.",
        "Sift rye flour, all-purpose flour, ground ginger, cinnamon, nutmeg, and pepper through a coarse-mesh sieve into a medium bowl. Stir in baking powder and salt. Whisk eggs, granulated sugar, brown sugar, fresh ginger, and vanilla extract in a large bowl to combine. Whisk in coconut oil, vegetable oil, and cooled molasses mixture. Add dry ingredients and fold just until blended. Scrape batter into prepared pan.",
        "Bake cake until a tester inserted into the center comes out clean, about 1 hour. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Run a knife around sides of cake and unmold. Let cool completely.",
        "Break cake into large pieces and arrange on a platter. Swirl honey into yogurt in a small bowl and serve alongside cake.",
        "Cake can be made 3 days ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup robust-flavored (dark) molasses (not blackstrap)",
        "1 cup stout",
        "1/2 teaspoon baking soda",
        "1 1/2 cups rye flour",
        "1/2 cup all-purpose flour",
        "2 tablespoons ground ginger",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon freshly grated nutmeg",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "3 large eggs",
        "1 cup granulated sugar",
        "1 cup (packed) dark brown sugar",
        "1 teaspoon finely grated peeled ginger",
        "1 teaspoon vanilla extract",
        "1/2 cup virgin coconut oil, melted, slightly cooled",
        "1/4 cup vegetable oil",
        "1/4 cup honey",
        "2 cups plain whole-milk yogurt",
        "A 10-inch-diameter springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Ginger",
        "Yogurt",
        "Honey",
        "Molasses",
        "Cinnamon",
        "Dessert",
        "Beer"
    ],
    "title": "Dark Ginger Rye Cake With Yogurt and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/dark-ginger-rye-cake-with-yogurt-and-honey"
}
