{
    "directions": [
        "Preheat oven to 350°F. Brush 9-inch-diameter springform pan with margarine; line bottom with parchment. Stir 1 2/3 cups chocolate chips and 3/4 cup margarine in medium saucepan over low heat until smooth. Whisk in cocoa and espresso. Cool 10 minutes.",
        "Using electric mixer, beat eggs and sugar in large bowl on high speed until thick, about 6 minutes. Fold in chocolate mixture. Pour batter into prepared pan.",
        "Bake torte until dry and cracked on top and tester inserted into center comes out with some moist batter attached, about 42 minutes. Cool in pan on rack 1 hour (center will fall). Using spatula, press raised edges so top is level. Cut around pan sides; remove sides. Place plate atop torte and invert onto plate. Remove pan bottom; peel off paper, and cool torte completely.",
        "Stir remaining 1 cup (6 ounces) chocolate and 1/4 cup margarine in small saucepan over low heat until smooth (do not overheat). Whisk in 2 tablespoons blackberry coulis. Cool glaze 15 minutes. Pour glaze into center of torte. Smooth top with spatula, allowing some of glaze to drip down sides. Refrigerate uncovered until glaze is set, about 1 hour. (Can be made 3 days ahead. Cover and keep refrigerated.)",
        "Cut torte into wedges; spoon coulis alongside. Garnish with mint and berries, if desired."
    ],
    "ingredients": [
        "2 2/3 cups semisweet chocolate chips (16 ounces), divided",
        "1 cup (2 sticks) salted margarine, divided",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon instant espresso powder or instant coffee powder",
        "5 large eggs",
        "1 cup sugar",
        "Spiked Blackberry Coulis",
        "Fresh mint sprigs",
        "Fresh blackberries (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Passover",
        "Blackberry",
        "Spring",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Dark Chocolate Torte with Spiked Blackberry Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-torte-with-spiked-blackberry-coulis-234442"
}
