{
    "directions": [
        "Using vegetable peeler, remove peel (orange part only) from orange in strips. Cut strips into matchstick-size pieces and place in small saucepan. Cover with cold water; bring to boil. Cook 30 seconds; drain. Rinse saucepan; add 1/4 cup sugar, 2 tablespoons water, and peel. Stir over medium-low heat until sugar dissolves. Simmer until peel is translucent and syrup is thick, about 20 minutes. Using tines of fork, transfer peel to plate and cool. (Can be made 1 day ahead. Cover and store at room temperature.)",
        "Using electric mixer, beat butter, sugar, cinnamon, and salt in large bowl until smooth. Beat in cocoa powder. Add flour and beat until dough comes together in moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and chill until firm, at least 1 hour and up to 1 day.",
        "Roll out dough between sheets of waxed paper to 11-inch round. Peel off top sheet of paper. Invert dough over 9-inch-diameter tart pan with removable bottom; peel off paper. Gently press dough into pan. Press dough overhang in to form double-thick sides. Pierce dough all over with fork. Refrigerate 30 minutes.",
        "Preheat oven to 375°F. Bake crust until sides look dry and bottom looks bubbly, about 14 minutes. Transfer crust to rack. Using back of spoon, press up sides of dough if falling. Cool completely.",
        "Toss almonds, sugar, and cinnamon in small bowl. Chop all but 2 strips of peel. Sprinkle chopped orange peel, then almond mixture over bottom of prepared crust. Place cream in heavy medium saucepan. Bring to simmer. Remove from heat. Add chocolate and whisk until chocolate melts and mixture is smooth; mix in Grand Marnier. Pour into crust. Refrigerate until filling is firm, at least 3 hours. Garnish with remaining 2 orange peel strips. (Can be made 1 day ahead. Cover loosely with foil and keep refrigerated.)",
        "Using sharp knife, gently loosen crust from pan sides. Remove pan sides. Cut tart into wedges; serve cold."
    ],
    "ingredients": [
        "1 orange",
        "1/4 cup sugar",
        "2 tablespoons water",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup sugar",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "6 tablespoons unsweetened cocoa powder",
        "3/4 cup all purpose flour",
        "1 cup slivered almonds, toasted, coarsely chopped",
        "2 teaspoons sugar",
        "1 teaspoon ground cinnamon",
        "1 cup heavy whipping cream",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon Grand Marnier or other orange liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Orange",
        "Almond"
    ],
    "title": "Dark Chocolate and Orange Tart with Toasted Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-and-orange-tart-with-toasted-almonds-107836"
}
