{
    "directions": [
        "Cook cream and chocolate in heavy small saucepan over low heat, stirring until chocolate melts and mixture is smooth. Remove from heat and beat in yolks 1 at a time. Mix in Cointreau and orange peel. Cook to tepid. (Can be prepared 2 hours ahead. Cover and let stand at room temperature. Stir over low heat until tepid before continuing.)",
        "Preheat oven to 375°F. Butter one 4-cup or two 1 3/4-cup soufflé dishes; dust with sugar. Beat whites and cream of tartar in medium bowl until soft peaks form. Beat in 2 tablespoons sugar. Fold 1/4 of whites into chocolate. Gently fold in remaining whites. Spoon into prepared dishes. (Can be prepared 1 hour ahead. Cover and let stand in draft-free areas at room temperature.) Bake until soufflé rises but still moves in center when touched, about 20 minutes for individuals and 30 minutes for one large. Dust tops with powdered sugar. Serve immediately, passing whipped cream separately.",
        "Cut chocolate into 1/4-inch dice. Combine cream, sugar and orange peel in medium bowl and beat until stiff peaks form. Mix in Cointreau. Fold in chocolate. (Can be prepared 4 hours ahead. Cover and refrigerate.)"
    ],
    "ingredients": [
        "1/4 cup whipping cream",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "2 egg yolks",
        "1 tablespoon Cointreau or other orange liquer",
        "1 teaspoon grated orange peel",
        "Sugar",
        "3 egg whites, room temperature",
        "Pinch of cream of tartar",
        "2 tablespoons sugar",
        "Powdered sugar",
        "1 ounce imported white chocolate",
        "1/2 cup chilled whipping cream",
        "1 tablespoon sugar",
        "1/2 teaspoon grated orange peel",
        "1 tablespoon Cointreau or other orange liquer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Orange",
        "Winter"
    ],
    "title": "Dark Chocolate Orange Soufflé with White Chocolate Chunk Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-orange-souffle-with-white-chocolate-chunk-whipped-cream-1146"
}
