{
    "directions": [
        "Preheat oven to 350° F. and line 2 buttered 7- by 2-inch round cake pans and 2 buttered 9- by 2-inch round cake pans with rounds of wax paper. Butter paper and dust pans with flour, knocking out excess.",
        "Put cocoa powder in a bowl and whisk in boiling water in a stream until smooth. Stir in chopped chocolate and let stand 5 minutes. Stir mixture until smooth and chocolate is melted and cool mixture. Whisk in sour cream and vanilla.",
        "Into a bowl sift together flour, baking soda, and salt. In large bowl of a standing electric mixer beat together butter and sugars until light and fluffy and add eggs, 1 at a time, beating well after each addition and scraping down side of bowl. Reduce speed to low and add flour mixture and cocoa mixture alternately in batches, beginning and ending with flour mixture and beating until batter is combined well.",
        "Pour 2 cups batter into each 7-inch pan and smooth tops. Divide remaining batter between 9-inch pans (about 33/4 cups each) and smooth tops. In middle and lower thirds of oven arrange one 9-inch layer and one 7-inch layer on each rack, putting 7-inch layers in front part of oven. Bake 7-inch layers 25 to 30 minutes and 9-inch layers 35 to 40 minutes, or until a tester comes out with crumbs adhering. Run a thin knife around edges of pans and invert cakes onto racks. Peel off paper and cool cakes completely. Cake layers may be made 2 days ahead and kept at cool room temperature, wrapped well in plastic wrap, or 2 weeks ahead and frozen, wrapped well in plastic wrap and foil. Defrost cake layers (without unwrapping) at room temperature.",
        "In a small saucepan bring cream just to a boil. Remove pan from heat and add chocolate, butter, zest, and liqueur. Let ganache stand 3 minutes and whisk until chocolate is melted. Chill ganache just until cool, about 40 minutes.",
        "In a bowl with an electric mixer beat ganache just until light and fluffy before using (do not overbeat or it will become grainy).",
        "Put one 9-inch layer on 8-inch cardboard round and spread evenly with 2 cups ganache. Top with remaining 9-inch layer and gently press layers together to form an even tier. Put one 7-inch layer on 6-inch cardboard round and top with remaining ganache and remaining 7-inch layer in same manner.",
        "Frost top and sides of 9-inch tier with some buttercream and chill while frosting 7-inch tier. Chill both tiers until buttercream is firm.",
        "Cut straws in half and insert 1 straw piece all the way into center of 9-inch tier. Trim straw flush with top of tier and insert remaining 5 straw pieces in same manner in a circle about 1 1/2 inches from center straw. Center 7-inch tier (still on cardboard) on top of 9-inch tier. Fill in any gaps between tiers with buttercream and transfer cake to a cake stand or platter. Chill cake at least 6 hours and up to 1 day.",
        "Arrange fraises des bois and roses decoratively on top and around sides of cake. Let cake stand at cool room temperature (buttercream is sensitive to warm temperatures) 2 to 4 hours before serving. Serves about 30 (including top tier).",
        "In a small heavy saucepan whisk together yolks and sugar and whisk in orange juice, butter, and a pinch salt. Cook mixture over moderately low heat, whisking, until it just reaches boiling point, 5 to 7 minutes (do not let boil), and strain through a fine sieve into a bowl. Whisk in lemon juice and cool curd, its surface covered with plastic wrap. Chill orange curd, covered, until cold, at least 4 hours, and up to 2 days.",
        "In a heavy saucepan bring sugar and water to a boil, stirring until sugar is dissolved. Boil syrup, undisturbed, until it registers 248° F. on a candy thermometer. While syrup is boiling, in large bowl of a standing electric mixer beat whites with a pinch salt until foamy and beat in cream of tartar. Beat whites until they just hold stiff peaks and beat in hot syrup in a stream (try to avoid beaters and side of bowl). Beat mixture at medium speed until completely cool, 15 to 20 minutes. Beat in butter, 1 piece at a time, and beat until thickened and smooth. (Buttercream will at first appear very thin and at some point look like it is breaking but, as more butter is beaten in, it will thicken and become glossy and smooth.) Beat in orange curd, salt, and zest until smooth. Buttercream may be made 4 days ahead and chilled in an airtight container or 2 weeks ahead and frozen in an airtight container. Bring buttercream completely to room temperature (this may take several hours if frozen) and beat before using. (If buttercream is too cold when beaten it will not be glossy and smooth.) Makes about 8 cups."
    ],
    "ingredients": [
        "13/4 cups unsweetened cocoa powder (not Dutch-process)",
        "13/4 cups boiling water",
        "4 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "one 8-ounce container sour cream",
        "1 tablespoon plus 1 teaspoon vanilla extract",
        "3 cups all-purpose flour",
        "2 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "3 3/4 sticks (1 3/4 cups plus 2 tablespoons) unsalted butter, softened",
        "1 3/4 cups granulated sugar",
        "3/4 cup firmly packed light brown sugar",
        "5 large eggs",
        "1 cup heavy cream",
        "8 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "2 tablespoons unsalted butter, softened",
        "2 teaspoons freshly grated orange zest",
        "1 tablespoon Cointreau or other orange-flavored liqueur",
        "one 8-inch cardboard round*",
        "one 6-inch cardboard round*",
        "three 8-inch plastic straws",
        "5 large egg yolks",
        "1/4 cup sugar",
        "1/2 cup fresh orange juice",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 1/2 teaspoons fresh lemon juice",
        "1 1/4 cups sugar",
        "1/2 cup water",
        "5 large egg whites",
        "1/2 teaspoon cream of tartar",
        "6 1/2 sticks (3 1/4 cups) unsalted butter, cut into pieces and softened to cool room temperature",
        "1/2 teaspoon salt",
        "2 tablespoons freshly grated orange zest",
        "Note: A cake-decorating turntable* is extremely helpful for assembling and decorating a wedding cake.",
        "Decoration: fraises des bois (wild strawberries)** and small roses with some leaves attached (both fruit and flowers must be nontoxic and pesticide-free)",
        "*available at specialty cookware shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Wedding",
        "Orange",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dark Chocolate Wedding Cake with Chocolate Orange Ganache and Orange Buttercream",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-wedding-cake-with-chocolate-orange-ganache-and-orange-buttercream-13244"
}
