{
    "directions": [
        "Preheat oven to 325 degrees  F. Line 13x9-inch baking pan with foil; lightly grease.",
        "Heat morsels, sugar, butter and water in medium saucepan over low heat, stirring constantly, until chocolate and butter are melted. Remove from heat. Stir in eggs, one at a time, until blended. Stir in vanilla extract. Add flour and salt; stir well. Pour into prepared baking pan.",
        "Bake for 30 to 35 minutes or until wooden pick inserted in center comes out slightly sticky. Cool completely in pan on wire rack. Holding sides of foil, lift brownie from pan to cutting board. Carefully remove foil and return brownie to board. Cut away 1/4-inch from each side. Cut out 15 cakes with cookie cutter, twisting gently to remove. For easier cutting, cutter can be wiped clean and/or greased lightly between cuttings. Scraps can be saved for another use, such as an ice cream topping, milkshakes or a snack. Serve cakes with Dark Chocolate Ganache.",
        "For Dark Chocolate Ganache: Heat cream in 2-cup microwave-safe glass measure or small bowl on high (100%) power for 30 to 40 seconds. Slowly add morsels. Cover with plastic wrap and let stand for 5 minutes. Stir well.  Refrigerate any remaining ganache."
    ],
    "ingredients": [
        "Dark Chocolate Brownie Cakes:",
        "1 2/3 cups NESTLE® TOLL HOUSE® Dark Chocolate Morsels",
        "1 1/2 cups granulated sugar",
        "1/2 cup unsalted butter, cut into pieces",
        "3 tablespoons water",
        "3 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/8 cups all-purpose flour",
        "1/4 teaspoon salt",
        "2 1/2-inch round metal cookie cutter",
        "Dark Chocolate Ganache:",
        "1/2 cup heavy whipping cream",
        "1 cup NESTLE® TOLL HOUSE® Dark Chocolate Morsels"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dark Chocolate Ganache Brownie Cakes",
    "url": "http://allrecipes.com/recipe/239554/dark-chocolate-ganache-brownie-cakes/"
}
