{
    "directions": [
        "Preheat oven to 325°F. Butter two 12-cup mini-muffin pans. Using on/off turns, blend first 4 ingredients in processor until walnuts are finely chopped. Whisk flour and baking powder in small bowl. Stir chocolate and butter in heavy small saucepan over low heat until melted and smooth. Cool slightly.",
        "Using electric mixer, beat sugar, eggs, and vanilla in large bowl until very thick, about 4 minutes. Gradually beat in cooled chocolate mixture. Stir in walnut mixture. Spoon 1 1/2 tablespoons batter into each prepared muffin cup.",
        "Bake cupcakes until tester inserted into center comes out clean, about 15 minutes. Cool in pan on rack. Cut around cupcakes to loosen; turn out onto work surface. (Can be made 1 day ahead. Cover; store at room temperature.)",
        "Bring cream and butter to simmer in heavy small saucepan over medium heat, stirring until butter melts. Remove from heat. Add white chocolate; stir until melted. Mix in crème de menthe. Transfer frosting to bowl; let frosting cool at room temperature until firm enough to pipe, stirring occasionally, about 2 hours.",
        "Spoon frosting into pastry bag fitted with medium star tip. Pipe frosting decoratively atop cupcakes."
    ],
    "ingredients": [
        "2 cups walnuts, toasted, cooled",
        "1 cup whole-milk ricotta cheese",
        "1/4 cup chopped fresh mint",
        "2 tablespoons honey",
        "1 cup all purpose flour",
        "1/2 teaspoon baking powder",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes",
        "1 1/4 cups sugar",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup whipping cream",
        "1 tablespoon unsalted butter",
        "8 ounces high-quality white chocolate, chopped",
        "1 tablespoon green crème de menthe"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Halloween",
        "Back to School",
        "Ricotta",
        "Mint",
        "Walnut",
        "Vanilla",
        "Fall",
        "Winter",
        "Birthday",
        "Shower",
        "Simmer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dark-Chocolate Mint Cupcakes with White-Chocolate Mint Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/dark-chocolate-mint-cupcakes-with-white-chocolate-mint-frosting-109181"
}
