{
    "directions": [
        "1. In a medium bowl and blend together both sugars, the paprika, salt, pepper, granulated onion, and cayenne. Sprinkle the short rib pieces liberally with this mixture until coated on all sides. Let sit at room temperature for about 30 minutes.",
        "2. Oil the grill racks. Preheat your grill using all burners set on high and with the lid closed for 10 to 12 minutes.",
        "3. Place the beef ribs on the grill, close the lid, and reduce the heat to medium. Turn the ribs every 3 to 5 minutes or so, so that every side gets slightly caramelized, 15 to 20 minutes total. (If your short rib pieces are small, it won't take quite this long.) The ribs should yield easily to the touch, not unlike a medium-rare steak or the way the tip of your nose feels. Reduce the heat a little more and brush the ribs with the sauce. Cover the grill and let cook for a minute or two for the sauce to set up, and then continue to turn and brush until all sides of the ribs have been glazed. Remove to a platter and let sit for 5 to 10 minutes, covered with foil. Serve."
    ],
    "ingredients": [
        "1/2 cup packed light brown sugar",
        "1/4 cup granulated sugar",
        "1/2 cup paprika (try 1/4 cup smoked paprika and 1/4 cup sweet paprika)",
        "2 1/2 tablespoons kosher salt",
        "2 1/2 tablespoons freshly ground black pepper",
        "1 tablespoon granulated onion",
        "1/2 teaspoon cayenne",
        "2 pounds boneless beef short ribs, connective tissue removed",
        "1 cup Virginia Pruitt's Perfect Barbecue Sauce or your favorite thick barbecue sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Marinate",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Summer",
        "Tailgating",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Darned Good Boneless Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/darned-good-boneless-short-ribs-352974"
}
