{
    "directions": [
        "To prepare the pastry, combine the flour, confectioners' sugar, and salt in the bowl of a food processor fitted with the metal blade. Add the butter and pulse until the mixture resembles coarse meal. Add the egg yolks and 3 tablespoons of the cream and pulse just until the dough starts to come together. Add more cream if necessary but stop before the dough is too wet. Tip half of the dough out onto a piece of plastic wrap and form it into a disk. Repeat with the remaining dough. Chill the disks for at least 2 hours.",
        "To prepare the filling, bring the dates and the water to a simmer over medium heat in a small saucepan. Cook until the dates are very soft, about 5 minutes. Transfer the dates and the water to the bowl of a food processor fitted with the metal blade and add the pecans, walnuts, honey, orange zest, cardamom, cloves, and salt and pulse until you have a chunky paste. Let cool completely.",
        "Line two baking sheets with parchment paper.",
        "Working with one disk at a time, roll the dough out to a thickness of 1/8 inch on a very lightly floured surface. (Less flour means a more tender cookie.) Using a 2-inch cookie cutter, cut out circles of dough and set them about 1 inch apart on the prepared baking sheets. Repeat with the remaining disk. You can reroll the dough once if you like.",
        "Scoop about a rounded 1/2 teaspoon of filling onto half of the dough circles. Brush the edges of the filling-topped circles with a bit of cream and top with another dough circle, gently pressing the edges to seal. Once you've sandwiched all of the cookies, use a fork to crimp all of the edges.",
        "Chill the cookies until firm, about 30 minutes. Preheat the oven to 350°F.",
        "Brush the top of each cookie with cream and sprinkle with a bit of sanding sugar. Bake until the cookies are golden and crisp, 25 to 30 minutes, rotating the sheets halfway through. Let the cookies cool completely on a rack.",
        "Store the cookies in an airtight container at room temperature for up to 5 days."
    ],
    "ingredients": [
        "3 cups (13 1/2 ounces) all-purpose flour, plus more for the work surface",
        "3/4 cup confectioners' sugar",
        "3/4 teaspoon kosher salt",
        "1 cup plus 2 tablespoons (2 1/4 sticks) chilled unsalted butter, cut into cubes",
        "3 large egg yolks",
        "4 to 6 tablespoons heavy cream, plus more for brushing",
        "Sanding sugar, for sprinkling (optional)",
        "3 1/4 ounces (3/4 cup) chopped pitted Medjool dates",
        "3/4 cup water",
        "1 ounce (1/4 cup) pecans",
        "1 ounce (1/4 cup) walnuts",
        "2 tablespoons honey or sugar",
        "1 tablespoon finely grated orange zest (from 1 orange)",
        "1 teaspoon freshly ground cardamom",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Date",
        "Pecan",
        "Walnut",
        "Pie",
        "Kid-Friendly",
        "Dessert"
    ],
    "title": "Date Nut Cookie Pies",
    "url": "http://www.epicurious.com/recipes/food/views/date-nut-cookie-pies-recipe"
}
