{
    "directions": [
        "Combine dates, walnuts, 3 tablespoons honey, orange peel, and cardamom in processor. Blend until paste forms.",
        "Preheat oven to 375°F. Line rimmed baking sheet with parchment. If using 17 1/2x12 1/2-inch phyllo sheets, place stack of 8 phyllo sheets on work surface. Halve stack crosswise, forming 16 sheets, each 12 1/2x8 3/4 inches; arrange in 1 stack. Or if using 13 1/2x8 1/2-inch phyllo sheets, stack 16 sheets on work surface. Cover phyllo stack with plastic wrap, then damp kitchen towel. Remove 1 phyllo sheet from stack and place on work surface; brush with melted butter. Top with second sheet; brush with butter. Starting 1 inch from edge at short end of phyllo, spoon 3 tablespoons date mixture in dollops in row parallel to edge. Mold date mixture into log, leaving 1/2-inch border at edges of phyllo. Roll up date log in phyllo, enclosing filling and forming roll (filling will be exposed at ends). Transfer to baking sheet; brush with butter. Repeat with remaining phyllo, butter, and date mixture. Bake until golden, about 23 minutes. Cool on baking sheet.",
        "Spoon yogurt into small bowl (or 8 individual bowls); drizzle remaining 1/4 cup honey over yogurt. Place 1 phyllo roll on each of 8 plates. Serve with honey-yogurt for dipping."
    ],
    "ingredients": [
        "14 ounces Medjool dates (about 1 1/2 cups), pitted",
        "1/2 cup walnuts, toasted",
        "3 tablespoons plus 1/4 cup Greek honey or other honey",
        "1 teaspoon finely grated orange peel",
        "1/2 teaspoon cardamom seeds (from about 10 pods), finely ground in spice mill or in mortar with pestle",
        "8 17 1/2x12 1/2-inch or sixteen 13 1/2x8 1/2-inch sheets fresh phyllo pastry or frozen, thawed",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1 cup Greek whole-milk yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Quick & Easy",
        "Yogurt",
        "Date",
        "Walnut",
        "Fall",
        "Winter",
        "Shower",
        "Healthy",
        "Honey",
        "Engagement Party",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Date and Walnut Phyllo Rolls with Greek Yogurt and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/date-and-walnut-phyllo-rolls-with-greek-yogurt-and-honey-233722"
}
