{
    "directions": [
        "Cream the butter and brown sugar together in a mixing bowl until smooth. Add the eggs, one at a time, beating well after each addition. Stir in the vanilla. Sift the cinnamon, salt, baking soda, and flour together in a second mixing bowl. Slowly stir the flour mixture into the egg mixture until evenly blended.",
        "Divide the dough evenly into three portions and place each on a square of waxed paper. Wrap and refrigerate until firm, about 1 hour.",
        "Meanwhile, make the filling by combine the dates, pecans, water and white sugar in a saucepan set over low heat.  Cook and stir until the filling has a paste-like consistency. Cool slightly.",
        "Working with one portion at a time, roll out the dough on a lightly floured surface to make a rectangle about 1/4 inch thick. Spread 1/3 of the filling evenly over the dough; roll up to make a log.  Repeat the process with the remaining dough. Refrigerate until firm, about 1 hour.",
        "Preheat oven to 350 degrees F (180 degrees C). Lightly grease two baking sheets.",
        "Using a sharp, serrated knife, cut the rolls into 1/4 inch slices. Place the slices on prepared baking sheets.",
        "Bake in preheated oven until set and lightly browned, about 15 minutes. Cool on racks."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3664&h=1918&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662670.jpg",
    "ingredients": [
        "1 cup butter (at room temperature)",
        "2 cups packed brown sugar",
        "3  eggs",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground cinnamon",
        "¼ teaspoon salt",
        "½ teaspoon baking soda",
        "4 ½ cups all-purpose flour",
        "8 ounces dates, pitted and chopped",
        "1 cup finely chopped pecans",
        "½ cup water",
        "½ cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Date Nut Pinwheel Cookies II",
    "url": "http://allrecipes.com/recipe/10088/date-nut-pinwheel-cookies-ii/"
}