{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Grease two 9-inch cake pans with the butter.",
        "In a large bowl, add the granulated sugar, oil, brown sugar and eggs and mix together. Add the flour, carrots, coconut, walnuts, cinnamon, almond extract, baking powder, salt and pineapple and fold the ingredients together.",
        "Pour the batter into the prepared pans and place the pans on a baking sheet. Bake until a toothpick inserted into the centers comes out clean, about 40 minutes. Place the cakes on a cooling rack until completely cooled, about an hour.",
        "For the frosting: Meanwhile, in a stand mixer fitted with a paddle attachment, add the cream cheese, confectioners' sugar, butter and pineapple juice. Mix until smooth and incorporated.",
        "To frost the cake: Carefully remove the cooled cakes from the pans. Using an offset spatula, place a dollop of the frosting on the cake stand and spread to create a sticky base. Place one layer on the frosting on the cake stand. Thickly frost the entire top of the cake and place the other layer atop the now frosted one. Beginning with the top of the new layer, frost generously. Place a large dollop of frosting on the side of the cake and spin the cake to evenly frost the sides. Garnish with the remaining walnuts."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1 1/2 cups granulated sugar",
        "1 cup canola oil",
        "1 cup light brown sugar",
        "4 large eggs, lightly beaten",
        "3 cups unbleached all-purpose flour",
        "1 1/2 cups shredded carrots",
        "1 1/2 cups shredded coconut",
        "1 cup chopped walnuts, plus more for garnish",
        "3 tablespoons ground cinnamon",
        "1 tablespoon almond extract",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "One 15-ounce can pineapple rings, drained (reserve the liquid for the frosting) and chopped into 1/2-inch pieces",
        "8 ounces cream cheese, at room temperature",
        "3 cups confectioners' sugar",
        "4 tablespoons unsalted butter, at room temperature",
        "1/4 cup reserved pineapple juice from the canned pineapple"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cream Cheese Recipes",
        "Frosting Recipes",
        "Carrot Cake",
        "Cake",
        "Carrot Recipes",
        "Vegetable",
        "Baking",
        "Dessert",
        "Fruit",
        "Pineapples"
    ],
    "title": "David's Favorite Carrot Cake with Pineapple Cream Cheese Frosting",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/davids-favorite-carrot-cake-with-pineapple-cream-cheese-frosting"
}
