{
    "directions": [
        "Toast the cardamom pod, cloves, star anise, fennel, and coriander in a small skillet over medium-low heat until fragrant, 5 to 7 minutes. Place the spices onto the center of a 8 inch square piece of cheesecloth. Gather together the edges of the cheesecloth, and tie with kitchen twine to secure. Sear both sides of the ginger and 1/2 onion in the same skillet until lightly charred, about 3 minutes on each side.",
        "Place the turkey carcass, water, sachet, ginger, and onion in a large pot over medium-high eat. Bring to a boil, then reduce to a simmer. Simmer for 2 hours.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rice noodles, and return to a boil. Cook the noodles uncovered, stirring occasionally, until the noodles have cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.",
        "Remove the carcass, sachet, ginger, and onion from the soup. Strain the soup to remove any meat that may have fallen off the bones, if necessary. Season with fish sauce and salt. Divide the rice noodles and turkey meat evenly into 4 large bowls. Scatter the basil, cilantro, and sliced onion on top. Ladle the soup on top. Serve with a wedge of lime and hot sauce."
    ],
    "ingredients": [
        "1 whole cardamom pod",
        "2 whole cloves",
        "1 star anise pod",
        "1 teaspoon fennel seeds",
        "2 teaspoons coriander seed",
        "1 (2 inch) piece fresh ginger, peeled and smashed",
        "1/2 onion, peeled",
        "1 turkey carcass",
        "8 cups water, or more as needed",
        "1 (16 ounce) package dried flat rice noodles",
        "1/4 cup fish sauce",
        "salt to taste",
        "1 cup shredded leftover cooked turkey",
        "1 tablespoon shredded fresh basil leaves (optional)",
        "1 tablespoon chopped fresh cilantro (optional)",
        "1/4 onion, thinly sliced (optional)",
        "1 lime, cut into wedges (optional)",
        "1 tablespoon chile-garlic sauce (such as Sriracha®), or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Day After Thanksgiving Turkey Pho",
    "url": "http://allrecipes.com/recipe/216529/day-after-thanksgiving-turkey-pho/"
}
