{
    "directions": [
        "Place the chicken breasts into a large soup pot, cover with water, and sprinkle in the salt, black pepper, and sage. Bring to a boil over medium heat, then reduce heat and simmer until the chicken is no longer pink inside, about 30 minutes. Remove the chicken to a bowl, and let cool; shred chicken when cooled.",
        "While chicken is cooling, bring the chicken broth left in the pot back to a boil over medium heat, and stir in the celery, onion powder, and garlic powder. Reduce heat to a simmer, and cook until the celery is tender, about 20 minutes.",
        "Meanwhile, whisk 1 cup of all-purpose flour, the whole wheat flour, salt, and baking powder together in a mixing bowl. Stir in the cream to make a dough. Sprinkle a work surface with the remaining 1/4 cup of flour, and roll the dough out about 1/4-inch thick. Using a pizza cutter, cut the dough into 1 1/2 inch squares. Toss the dumplings in the flour on the work surface.",
        "Drop the dumplings, a few at a time, into the simmering broth. Stir frequently to keep them from sticking to the bottom; allow to simmer until the dumplings puff up and the broth thickens, about 30 minutes; stir in the cooked shredded chicken and parsley. Bring back to a boil, and serve hot in bowls."
    ],
    "ingredients": [
        "6 chicken breast halves",
        "4 cups water, or as needed to cover",
        "salt and ground black pepper to taste",
        "1 teaspoon dried sage",
        "1 cup chopped celery",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 1/4 cups all-purpose flour, divided",
        "1 cup whole wheat flour",
        "1/2 teaspoon salt",
        "2 1/2 teaspoons baking powder",
        "1 1/4 cups heavy cream",
        "1 tablespoon chopped parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dazzlin' Chicken -n- Dumplin's",
    "url": "http://allrecipes.com/recipe/217177/dazzlin-chicken--n--dumplins/"
}
