{
    "directions": [
        "Rinse chiles and split open, discarding stems, seeds, and ribs. Heat a dry well-seasoned cast-iron skillet over moderate heat, then toast chiles in batches, turning them, about 30 seconds total. Transfer to a heatproof bowl and pour boiling water over them. Cover bowl and soak chiles, stirring occasionally, until softened, about 15 minutes.",
        "Reserve one fourth of soaking liquid, then purée chiles with remaining liquid in a blender until smooth (use caution when blending hot liquids). Pour puréethrough a fine sieve into a bowl, pressing on solids. Whisk in reserved soaking liquid.",
        "Toast bread crumbs in oil in a 2-quart heavy saucepan over moderate heat, stirring constantly, until pale golden, about 1 minute. Add garlic and oregano and cook, stirring, until fragrant, about 1 minute. Stir in chile purée, vinegar, and salt and simmer, stirring occasionally, until slightly thickened, about 25 minutes.",
        "Preheat oven to 350°F.",
        "Cook onions in oil in a 12-inch heavy skillet over moderately low heat, stirring occasionally, until softened, about 20 minutes.",
        "Spoon half of chile sauce evenly over bottom of a lightly oiled 13- by 9-inch (3-quart) baking dish, then cover with 4 tortillas, overlapping slightly. Sprinkle tortillas evenly with one third of cheese, then half of onions and olives. Repeat layering with another 4 tortillas, another third of cheese, and remaining onions and olives. Top with remaining 4 tortillas, sauce, and cheese. Bake, uncovered, in middle of oven until cheese is melted and bubbling, about 25 minutes."
    ],
    "ingredients": [
        "3 ounces dried whole New Mexico chiles",
        "4 cups boiling water",
        "2 tablespoons fine dry bread crumbs",
        "1 1/2 tablespoons vegetable oil",
        "1 garlic clove, minced",
        "1 teaspoon dried oregano, crumbled",
        "1 tablespoon cider vinegar",
        "2 teaspoons salt",
        "3 large onions, chopped (4 cups)",
        "3 tablespoons olive oil",
        "12 (5-inch) white or yellow corn tortillas",
        "3/4 pound white sharp Cheddar, coarsely grated (5 cups)",
        "1 (6-ounce) can pitted black olives, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Onion",
        "Bake",
        "Super Bowl",
        "Vegetarian",
        "Cheddar",
        "Hot Pepper",
        "Potluck",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Dead Horse Ranch Red Chile Enchiladas",
    "url": "http://www.epicurious.com/recipes/food/views/dead-horse-ranch-red-chile-enchiladas-105015"
}
