{
    "directions": [
        "Stir tomato sauce, diced tomatoes, onion, cumin, cayenne pepper, and black pepper together in a large pot over medium heat; keep at a simmer as you prepare the meats.",
        "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until crisp, about 10 minutes. Keep the skillet on heat while transferring bacon to a plate lined with paper towel to drain. Crumble bacon and stir into the tomato mixture.",
        "Cook and stir sausage in the bacon drippings until completely browned, 5 to 7 minutes; drain and discard grease. Stir sausage into the tomato mixture. Return skillet to medium-high heat.",
        "Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir beef into the tomato mixture.",
        "Stir barbeque sauce and chili powder into the tomato mixture; adjust any seasonings to your preference. Add kidney beans and chocolate to the mixture; cook and stir until the chocolate is melted, 1 to 2 minutes.",
        "Pour Irish stout beer into the pot and stir. Bring the mixture to a simmer and cook, stirring occasionally, until the flavors are well integrated with one another, about 1 hour.",
        "Stir masa flour into the chili until smooth. Bring the chili again to a simmer; cook and stir until thickened, about 15 minutes."
    ],
    "ingredients": [
        "2 (29 ounce) cans tomato sauce",
        "2 (28 ounce) cans Italian-style diced tomatoes",
        "2 cups diced onion",
        "2 tablespoons ground cumin",
        "1 teaspoon cayenne pepper",
        "1 teaspoon ground black pepper",
        "1 pound bacon, diced",
        "2 pounds bulk spicy sausage",
        "3 pounds lean ground beef",
        "1 (32 ounce) bottle hickory smoke barbeque sauce",
        "1/2 cup chili powder",
        "4 (15.25 ounce) cans kidney beans, undrained",
        "2 (1 ounce) squares unsweetened chocolate, chopped",
        "2 (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®)",
        "1 cup masa flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Debbie's Chocolate Chili",
    "url": "http://allrecipes.com/recipe/239489/debbies-chocolate-chili/"
}
