{
    "directions": [
        "1. Preheat the oven to 425°F. Cut the squash in half, scrape out the seeds, then cut each half into thirds. Put the pieces in a large baking dish or roasting pan with the pears and all but a few slices of the ginger. Brush with oil, season with salt, and bake until fragrant and tender, about 1 hour. Turn the pieces once or twice so that they have a chance to caramelize on more than one surface. If the squash seems very dry (some varieties are), add 1 cup water to the pan to create steam and cover with foil. When the squash is tender, transfer everything from the pan to a cutting board, add 1 cup water to the pan, and scrape to dissolve the juices, reserving the liquid. Scrape the flesh of the squash away from the skins. You should have about 2 cups.",
        "2. To make a stock, bring 6 cups water to a boil and add the seeds and, eventually,the squash skins, the remaining ginger, and 1/2 teaspoon salt. Lower the heat and simmer, covered, for 20 to 25 minutes.",
        "3. Meanwhile, melt the butter in a soup pot. Add the onion, give it a stir, and cook over medium-low heat, stirring frequently, until it begins to brown a bit and is fragrant, about 10 minutes. Add the pears, ginger, and squash, then the reserved deglazing water. Strain the stock into the pot. Bring to a boil, then lower the heat and simmer, covered, for 25 minutes. Cool briefly, then puree until smooth and pass through a food mill or strainer to ensure a silky texture. Serve as is or swirl in the crème fraîche."
    ],
    "ingredients": [
        "One 2 1/2-pound Buttercup, Perfection, or other dense winter squash, rinsed",
        "3 ripe but firm pears, any variety, quartered, seeds and stems removed",
        "1 chunk fresh ginger, about 2 inches long, thinly sliced",
        "Sunflower seed or olive oil for the squash",
        "Sea salt",
        "2 tablespoons butter or sunflower seed oil",
        "1 onion, thinly sliced",
        "1/2 cup crème fraîche or sour cream, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fruit",
        "Ginger",
        "Vegetable",
        "Bake",
        "Dinner",
        "Lunch",
        "Pear",
        "Squash",
        "Fall",
        "Winter",
        "Healthy",
        "Simmer",
        "Butter"
    ],
    "title": "Deborah Madison's Roasted Squash, Pear, and Ginger Soup",
    "url": "http://www.epicurious.com/recipes/food/views/deborah-madisons-roasted-squash-pear-and-ginger-soup-355879"
}
