{
    "directions": [
        "Heat the frying oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).",
        "Beat the eggs in a mixing bowl until smooth. Mix in the 1/2 cup plus 2 teaspoons cornstarch until no lumps remain. Mix in the chicken until evenly coated in the batter.",
        "In batches, carefully drop the chicken cubes into the hot oil one by one, cooking until the chicken turns golden brown and begins to float, about 3 minutes. Drain on a paper towel-lined plate.",
        "Meanwhile, combine the sugar, white vinegar, rice vinegar, sherry, soy sauce, and garlic in a small saucepan. Bring to a boil over medium-high heat. Stir constantly until the sugar has dissolved and the sauce thickens to the consistency of light pancake syrup, about 3 minutes. Remove from the heat and keep warm.",
        "Heat 2 tablespoons vegetable oil in a wok or large skillet over medium-high heat. Stir in the dried chiles and ginger; cook and stir until the ginger begins to brown, about 30 seconds. Remove the chiles and ginger from the wok and stir them into the sauce. Place the fried chicken cubes into the wok and cook until very crispy and dark golden brown. Serve the chicken with the sauce."
    ],
    "ingredients": [
        "4 cups vegetable oil for frying",
        "3 eggs",
        "1/2 cup cornstarch",
        "2 teaspoons cornstarch",
        "2 pounds skinless, boneless chicken thighs, cut into bite-sized pieces",
        "1 1/2 cups white sugar",
        "1/4 cup distilled white vinegar",
        "1/4 cup rice vinegar",
        "1/4 cup dry sherry",
        "2 1/2 tablespoons soy sauce",
        "2 teaspoons minced garlic",
        "2 tablespoons vegetable oil",
        "12 dried whole red chilies, or to taste",
        "2 tablespoons minced fresh ginger, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deb's General Tso's Chicken",
    "url": "http://allrecipes.com/recipe/92761/debs-general-tsos-chicken/"
}
