{
    "directions": [
        "Dissolve the honey in the water in a large mixing bowl, and stir in the yeast. Set the mixture aside until the yeast forms a creamy layer on top, about 15 minutes. Stir in the salt, 2/3 cup of olive oil, and beaten eggs. Add the flour 1 cup at a time until the dough is slightly tacky, but not sticky wet.",
        "Turn it out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Lightly oil a bowl, place the dough in the bowl, turn the dough over a few times to oil the surface, then let rise until doubled in a warm, draft-free place, about 90 minutes.",
        "To make the loaves, punch down the dough, and cut it into 2 equal-sized pieces. Cut the first piece into 4 equal parts. Set the second piece aside under a cloth to prevent drying out while you braid the first loaf.",
        "To braid the first 4-strand loaf, roll the 4 pieces of dough into thin ropes about the width of your thumb, and about 14 inches long. Make the tops and bottoms of each rope thinner than the middle area. Pinch the tops of the 4 ropes together, and fan the 4 ropes out so they don't touch.",
        "To make an \"under-2, over-1 braid,\"  take the left-most rope, and move it to the right to cross underneath the next 2 ropes, then move it left to cross back over the strand immediately to its left. Take the far right strand, and move it to the left and cross it under the two strands to its left (they are already crossed from the previous braid); then move it right to cross back over the strand immediately to its right. Repeat until the 4 strands are braided together all the way to the end, and pinch the ends tightly together. Repeat  the steps to braid the second loaf, and let the braided loaves rise for 1 hour.",
        "Preheat an oven to 350 degrees F (175 degrees C), and line baking sheets with parchment paper.",
        "Make a glaze by whisking together the milk, 2 tablespoons of olive oil, the egg white, and the sugar in a bowl. Brush the braided loaves with the glaze, to make a shiny crust, and bake the loaves on the prepared baking sheets in the preheated oven until they are light golden brown, about 30 minutes."
    ],
    "ingredients": [
        "1/3 cup honey",
        "1 1/4 cups warm water",
        "2 1/4 teaspoons active dry yeast",
        "1 1/2 teaspoons salt",
        "2/3 cup olive oil",
        "2 eggs",
        "5 cups unbleached flour, plus more if needed",
        "1/4 cup milk",
        "2 tablespoons olive oil",
        "1 egg white",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Decadent Challah Bread",
    "url": "http://allrecipes.com/recipe/66575/decadent-challah-bread/"
}
