{
    "directions": [
        "Preheat the oven to 325 degrees F. Generously spray a 10-inch Bundt pan with cooking spray.",
        "Combine the flour, sugar, baking powder, baking soda, cardamom, and salt in a medium bowl. Combine the cocoa and espresso powder in a small bowl. Pour the boiling water over the cocoa mixture, whisking until smooth. Stir in the vanilla.",
        "Whisk together the yogurt, milk, oil, egg, and egg white in a large bowl; stir in the cocoa mixture until blended. Gradually add the flour mixture, stirring just until combined. Stir in the currants and chopped chocolate.",
        "Pour the batter into the pan. Bake in the center of the oven until a cake tester inserted in the cake comes out clean, about 50 minutes. Cool on a baking rack for 10 minutes, then turn the cake out onto a baking rack to cool completely. Dust generously with confectioners' sugar just before serving.",
        "Nutritional analysis per serving: 1 slice. Calories 180, Total Fat 7 g; (Sat Fat 1 g, Mono Fat 3 g, Poly Fat 1 g); Protein 3.5 g; Carb 29 g; Fiber 1 g; Cholesterol 12 mg; Sodium 180 mg"
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 1/3 cups sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon cardamom",
        "3/4 teaspoon fine salt",
        "2/3 cup unsweetened Dutch-process cocoa powder",
        "1 teaspoon instant espresso powder",
        "1/2 cup boiling water",
        "1 tablespoon vanilla extract",
        "1 cup low-fat (2 percent) Greek-style yogurt",
        "1/2 cup 1 percent low-fat milk",
        "1/3 cup canola oil",
        "1 large egg",
        "1 large egg white",
        "1/3 cup currants, soaked in hot water for 1 minute, drained",
        "1/2 cup chopped semisweet or bittersweet chocolate",
        "Confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Baking",
        "Healthy",
        "Dairy Recipes",
        "Sugar"
    ],
    "title": "Decadent Chocolate Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/decadent-chocolate-cake-recipe"
}
