{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Coat two 8 inch round cake pans with cooking spray, and line bottoms with parchment paper.",
        "Using a vegetable peeler, remove zest from oranges in strips. Place in food processor, and coarsely chop, stopping occasionally to scrape down sides of bowl. Add 1/3 cup sugar and blend until peel is minced. Add 1/4 cup marmalade, and pulse until mixture is pureed. Transfer to a large bowl. Add 3/4 cup unsalted butter, and 1 teaspoon vanilla.",
        "With an electric mixer, cream mixture until light and fluffy. Beat in 1 cup sugar. Add eggs 1 at a time, beating well after each addition. Sift together flour, baking powder, and baking soda into small bowl. Beat in the flour mixture alternately with the orange juice, mixing just until incorporated. Divide batter into prepared pans.",
        "Bake in the preheated oven for 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.",
        "For the Chocolate Ganache:  Bring cream and butter to simmer in heavy large saucepan. Remove from heat, add chocolate chips and stir until melted.",
        "For Orange Cream Cheese Filling: in a small bowl, beat together cream cheese, 1 tablespoon sugar, and 2 tablespoons marmalade.",
        "To assemble cake:  Cut each cake into 2 layers. Place 1 layer on plate. Spread filling on the  bottom cake. Pour hot ganache over bottom layer, let cool slightly. Top with second cake layer. Spread with filling. Pour hot ganache over second layer. Repeat for third layer. Top with fourth cake layer. Pour remaining ganache over entire cake for a shiny finish. Refrigerate uncovered cake until ganache is a hard coating."
    ],
    "ingredients": [
        "2 orange peels, cut into 1/4 inch strips",
        "1/3 cup white sugar",
        "1/4 cup orange marmalade",
        "3/4 cup unsalted butter, softened",
        "1 teaspoon vanilla extract",
        "1 cup white sugar",
        "4 eggs",
        "2 1/2 cups cake flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "3/4 cup orange juice",
        "1 1/4 cups heavy cream",
        "4 tablespoons unsalted butter",
        "15 ounces semisweet chocolate chips",
        "1 (8 ounce) package cream cheese, softened",
        "1 tablespoon white sugar",
        "2 tablespoons orange marmalade"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Decadent Chocolate Orange Cake",
    "url": "http://allrecipes.com/recipe/49762/decadent-chocolate-orange-cake/"
}
