{
    "directions": [
        "Puree tomatoes in blender. Heat oil in large skillet over medium-high heat. Add onion and sauté until beginning to brown, about 6 minutes. Add garlic and sauté 30 seconds. Mix in olives, chiles, and dried herbs, then tomato puree. Reduce heat to medium. Simmer until most liquid is absorbed, stirring occasionally, about 5 minutes. Remove from heat. Mix in crab and parsley; season with salt.",
        "Combine fresh masa or masa harina mixture, lard, flour, baking powder, and salt in large bowl. Knead well, adding warm water by tablespoonfuls as needed until dough is soft but not sticky. Divide into 12 balls. Place on sheet of foil. Cover with plastic wrap.",
        "Cut out two 8-inch rounds from heavy-duty resealable plastic bag. Place 1 plastic round on bottom half of tortilla press. Place 1 dough round in center and top with second plastic round. Close tortilla press, pressing dough to 5-inch round. Peel off top plastic. Spoon 1 heaping tablespoon filling onto half of dough. Using plastic as aid, fold dough over filling, peel back plastic, and seal edges. Flip turnover onto hand; peel off bottom plastic. Place turnover on foil-lined sheet. Repeat with remaining dough and filling.",
        "Pour enough oil into large skillet to reach depth of 3/4 inch. Attach deep-fry thermometer and heat oil to 375°F. Fry 3 turnovers at a time until deep golden brown, about 2 minutes per side. Transfer to paper towels to drain. Arrange turnovers on platter and serve."
    ],
    "ingredients": [
        "1 cup chopped seeded plum tomatoes (about 8 ounces)",
        "1 1/2 tablespoons olive oil",
        "3/4 cup chopped white onion",
        "2 garlic cloves, chopped",
        "1/2 cup chopped pitted green olives",
        "2 pickled jalapeño chiles, chopped",
        "1/2 teaspoon dried marjoram",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon dried oregano",
        "1 1/2 cups shredded fresh crabmeat",
        "2 tablespoons chopped fresh Italian parsley",
        "2 cups freshly ground corn masa dough for tortillas (about 17 ounces)",
        "2 tablespoons lard or solid vegetable shortening",
        "1/4 cup all purpose flour",
        "1 teaspoon baking powder",
        "3/4 teaspoon salt",
        "Warm water",
        "Vegetable oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Olive",
        "Shellfish",
        "Tomato",
        "Fry",
        "Cinco de Mayo",
        "Buffet",
        "Crab",
        "Hot Pepper",
        "Spring",
        "Hominy/Cornmeal/Masa",
        "Simmer"
    ],
    "title": "Deep-Fried Masa Turnovers with Crab",
    "url": "http://www.epicurious.com/recipes/food/views/deep-fried-masa-turnovers-with-crab-108020"
}
