{
    "directions": [
        "Sprinkle yeast and brown sugar over warm water in the bowl of a stand mixer fitted with a dough hook. Let stand 5 to 10 minutes until the yeast softens and begins to form a creamy foam.",
        "Turn mixer to the lowest setting and slowly add 2 cups flour 1/2 cup at a time. Add garlic salt and 1/4 cup butter. Integrate remaining 2 cups flour and knead until dough is smooth and elastic, 5 to 7 minutes.",
        "Coat a large glass bowl with 1 tablespoon grapeseed oil. Shape dough into a ball and place in bowl, turning to coat all sides with oil. Spray a piece of plastic wrap with cooking spray and loosely cover bowl. Cover bowl with a towel and let rise in a warm area until dough has doubled in size, about 45 minutes. Punch down dough and allow to rest for 20 minutes.",
        "While dough is resting, heat a skillet over medium heat; cook and stir bulk sausage until browned and crumbly, about 5 minutes. Transfer cooked sausage to a bowl with a slotted spoon, retaining drippings in the skillet. Fry Italian sausage link in drippings until browned and no longer pink in the center, about 10 minutes. Slice sausage.",
        "Preheat oven to 400 degrees F (200 degrees C). Grease a 12-inch cast iron skillet with 2 tablespoons grapeseed oil.",
        "Press dough into and up the sides of the prepared skillet. Poke holes in dough with a fork to prevent air bubbles. Spread pizza sauce around the base of the crust. Sprinkle 1/3 cup mozzarella cheese over sauce; layer half the bulk sausage, half the sliced sausage, and half the pepperoni over cheese. Repeat the layers of meat. Top with remaining 1/3 cup mozzarella cheese.",
        "Bake in preheated oven on the bottom rack until crust is golden brown, about 25 minutes. Brush crust with 1 tablespoon butter; season with Italian seasoning and garlic powder. Remove pizza from skillet and let rest for 3 to 5 minutes before slicing."
    ],
    "ingredients": [
        "2 1/4 teaspoons active dry yeast",
        "1/2 teaspoon brown sugar",
        "1 1/4 cups warm water (110 degrees F (43 degrees C))",
        "2 cups all-purpose flour",
        "2 teaspoons garlic salt",
        "1/4 cup butter",
        "2 cups all-purpose flour",
        "1 tablespoon grapeseed oil",
        "cooking spray",
        "1/3 cup bulk pork sausage",
        "1 (3.5 ounce) link bulk Italian sausage",
        "2 tablespoons grapeseed oil",
        "1/2 cup pizza sauce",
        "1/3 cup shredded mozzarella cheese",
        "24 slices pepperoni",
        "1/3 cup shredded mozzarella cheese",
        "1 tablespoon butter, softened (optional)",
        "1/8 teaspoon Italian seasoning (optional)",
        "1/8 teaspoon garlic powder (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deep-Dish Cast Iron Pizza",
    "url": "http://allrecipes.com/recipe/223075/deep-dish-cast-iron-pizza/"
}
