{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round baking pans.",
        "Beat 1/2 cup butter and 1 1/4 cups sugar with an electric mixer in a large bowl until light and fluffy. Mixture should be noticeably lighter in color. Add eggs, one at a time, allowing each egg to blend into butter mixture before adding the next. Stir in 1 teaspoon vanilla extract and 1/4 teaspoon lemon peel, mixing well.",
        "Combine 2 cups flour, baking powder, and 1 teaspoon salt in a bowl. Pour flour mixture into the batter alternately with 1 cup eggnog, mixing until just incorporated. Stir in bourbon. Divide batter evenly between prepared pans.",
        "Bake in preheated oven until cake springs back when touched lightly with a fingertip or a toothpick inserted in the centers comes out clean, 30 to 35 minutes (test both cake layers). Cool in pans for 10 minutes before inverting on a wire rack to cool completely.",
        "To make frosting, combine 1/4 cup flour and 1/4 teaspoon salt in a saucepan. Gradually whisk in 1 1/2 cups eggnog, whisking until smooth.",
        "Bring to a boil over medium heat, stirring frequently. When mixture boils, cook for 2 minutes, whisking constantly, until thickened. Remove from heat and let cool completely to room temperature.",
        "Beat 1 cup butter and 1 1/2 cups sugar in a bowl until light and fluffy. Mix in cooled eggnog mixture, 1 1/2 teaspoon vanilla extract, rum extract, and 1/8 teaspoon grated lemon peel. Beat on high speed until mixture is fully incorporated and frosting is fluffy.",
        "Spread cake with plain frosting between cake layers, over the top and on the sides. Coat the sides with toasted pecans, pressing the nuts onto sides in small handfuls. Refrigerate until serving time."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4000&h=2094&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1082030.jpg",
    "ingredients": [
        "½ cup butter, room temperature",
        "1 ¼ cups white sugar",
        "3  eggs, room temperature",
        "1 teaspoon vanilla extract",
        "¼ teaspoon finely grated lemon peel",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1 cup prepared eggnog (or see notes for recipe)",
        "2 tablespoons bourbon whiskey",
        "¼ cup all-purpose flour",
        "¼ teaspoon salt",
        "1 ½ cups prepared eggnog (or see notes for recipe)",
        "1 cup butter, room temperature",
        "1 ½ cups white sugar",
        "1 ½ teaspoons vanilla extract",
        "¼ teaspoon rum-flavored extract",
        "⅛ teaspoon finely grated lemon peel",
        "½ cup finely chopped toasted pecans (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deep South Eggnog Cake",
    "url": "http://allrecipes.com/recipe/230479/deep-south-eggnog-cake/"
}