{
    "directions": [
        "Put a large baking sheet on oven rack in middle position and preheat oven to 425°F.",
        "Whisk together brown sugar and tapioca and toss with blueberries and lemon juice in a large bowl.",
        "Roll out larger piece of dough (keep remaining piece chilled) on a lightly floured surface with a lightly floured rolling pin into a 13-inch round. Fit into pie plate. Trim excess dough, leaving a 1/2-inch overhang. Chill shell while rolling out dough for top crust.",
        "Roll out remaining dough on a lightly floured surface with lightly floured rolling pin into an 11-inch round. Cut out 5 or 6 small holes with small decorative cookie cutters or use a small knife to slash steam vents toward center.",
        "Spoon filling with any accumulated juices into shell, dot with butter, and cover with top crust. Trim top crust with kitchen shears, leaving a 1/2-inch overhang. Fold overhang of top crust under bottom pastry and press against rim of pie plate to reinforce edge, then crimp decoratively and brush with egg wash.",
        "Bake pie on hot baking sheet in oven 30 minutes, then cover edge with a pie shield or foil to prevent overbrowning. Reduce oven temperature to 375°F and continue to bake until crust is golden and filling is bubbling, 45 to 50 minutes more.",
        "Cool pie completely on a rack, about 4 hours (filling will be runny if pie is still warm)."
    ],
    "ingredients": [
        "1 1/4 cups packed light brown sugar",
        "5 tablespoons quick-cooking tapioca",
        "6 cups fresh wild blueberries or 3 (10-ounce) packages frozen (not thawed)",
        "1 tablespoon fresh lemon juice",
        "Pastry dough for a double-crust pie",
        "1 tablespoon unsalted butter, cut into small pieces",
        "1 large egg, beaten with 1 tablespoon water",
        "a 9 1/2-inch deep-dish pie plate (6-cup capacity); small decorative cookie cutters (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Bake",
        "Blueberry",
        "Summer",
        "Tapioca",
        "Gourmet"
    ],
    "title": "Deep-Dish Wild Blueberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/deep-dish-wild-blueberry-pie-235488"
}
