{
    "directions": [
        "Peel, core, and thinly slice all the apples and put in a very large bowl. Pour the lemon juice over the apples and toss. In a small bowl, combine the granulated sugar, light brown sugar, dark brown sugar, cornstarch, cinnamon, nutmeg, and salt and toss with a fork until there are no longer any lumps. Pour the dry ingredients over the apples, toss, and let stand for 5 minutes.",
        "In a large Dutch oven, melt the butter and then add the apple mixture. Stir to coat the apples in the butter and cook down for 10 minutes. Add the bourbon and 1/2 cup of the water and cook over medium heat, stirring frequently, for 20 minutes, or until the apples are tender and the sugar has caramelized. If the mixture begins to thicken too much, add the remaining 1/2 cup water, reduce the heat to low, and continue to cook, stirring occasionally to prevent sticking, about 15 minutes longer.",
        "Remove both disks of the dough from the refrigerator and let stand for 15 minutes. Position an oven rack in the center of the oven and preheat the oven to 400°F.",
        "Dust the work surface with glutinous rice flour and roll one of the dough disks out to a 14-inch round.",
        "Gingerly transfer the rolled dough to a 12-inch deep-dish pie pan, fitting the dough into the pan and being cautious not to tear the dough, as it is delicate. (If you do tear the dough, just join the tear together and brush the tear with water; smooth with your finger until the damage is no longer visible.) Using scissors, trim the overhanging dough to an even 1 inch.",
        "Roll out the second disk of dough to a 14-inch round, adding additional rice flour, if needed. Trim the edges. Using decorative cookie cutters, press into the center of the disk to form a vent. Set aside.",
        "Pour the filling into the pie shell. Brush the overhang of the bottom crust with water. Fold the pit top in half, center the vent hole, and unfold. Pinch the top layer of dough to the bottom and then flute the edges with your fingers.",
        "Brush the dough with milk and sprinkle with sanding sugar. Bake for 30 to 40 minutes, or until golden brown.",
        "Remove from the oven and let cool on a wire rack for at least 2 hours before slicing. Serve cut into wedges and topped with vanilla ice cream.",
        "Cover and store for up to 2 days at room temperature or refrigerate for up to 1 week."
    ],
    "ingredients": [
        "13 mixed baking apples: Golden Delicious, Braeburn, or Red Delicious and either Gala or Fuji",
        "Juice of 1 large lemon",
        "1 cup granulated sugar",
        "1/3 cup packed light brown sugar",
        "1/3 cup dark brown sugar",
        "4 tablespoons cornstarch",
        "2 teaspoons ground cinnamon",
        "1/4 teaspoon grated nutmeg",
        "1/4 teaspoon kosher salt",
        "3 tablespoons cold unsalted butter, diced",
        "1 scant cup of water",
        "2 tablespoons Maker's Mark bourbon",
        "2 disks Sweet Pâte Brisée (Short Crust Dough)",
        "Glutinous rice flour for dusting",
        "Milk for brushing",
        "Sanding sugar for sprinkling",
        "Vanilla ice cream for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Deep-Dish Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/deep-dish-apple-pie-362669"
}
