{
    "directions": [
        "Sprinkle the yeast over the water. Let stand 1 minute, or until the yeast is creamy. Stir until the yeast dissolves.",
        "In a large bowl, combine flour and salt. Add the yeast and stir until a soft dough forms. Turn the dough out onto a lightly floured surface and knead, adding more flour if necessary, until smooth and elastic, about 10 minutes.",
        "Lightly coat a large bowl with oil. Place the dough in the bowl, turning it to oil the top. Cover with plastic wrap. Place in a warm, draft-free place and let rise until doubled in bulk, about 1 1/2 hours.",
        "Preheat oven to 425°F. Punch down dough. Sprinkle a 9 x 13 inch rectangular baking sheet with cornmeal. Place dough in pan. Press dough until it comes up the side of the pan and is an even thickness on bottom. Let dough rise, covered loosely with plastic wrap, in a warm place until double, about 30 minutes.",
        "Drizzle the extra-virgin olive oil over the dough. Sprinkle with grated Parmigiano-Reggiano. Top with tomaotes, basil, and mozzarella. Season with salt and pepper.",
        "Bake pizza until cheese melts and crust is golden brown, 15 to 20 minutes. Transfer pizza to a cutting board. Cut into squares and serve hot."
    ],
    "ingredients": [
        "2 teaspoons active dry yeast",
        "1 1/2 cups warm water (105°F to 115°F)",
        "4 cups unbleached all-purpose flour",
        "1 tablespoon salt",
        "3 tablespoons extra-virgin olive oil, more for oiling the bowl",
        "1/4 cup grated Parmigiano-Reggiano",
        "2-3 plum tomatoes, thinly sliced",
        "8 fresh whole basil leaves",
        "1/2 pound fresh mozzarella, sliced",
        "cornmeal, for dusting",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Kid-Friendly",
        "Mozzarella",
        "Parmesan",
        "Basil",
        "Fall"
    ],
    "title": "Deep-Dish Pizza Margherita",
    "url": "http://www.epicurious.com/recipes/food/views/deep-dish-pizza-margherita-105853"
}
