{
    "directions": [
        "Melt butter in pan over medium heat. Add onions; cook and stir until onions begin to turn translucent, about 5 minutes. Stir in 1/2 cup flour and cook until flour loses its raw taste, 3 or 4 minutes. Add black pepper, nutmeg, and cayenne pepper; stir. Remove from heat.",
        "Pour milk into butter-onion mixture to make the bechamel sauce. Whisk until incorporated. Return pan to medium-high heat and continue whisking until mixture thickens, 1 or 2 minutes; continue to cook and stir 3 or 4 minutes. Remove from heat and stir in salt.",
        "Place chopped chicken, ham, and parsley in bowl. Add bechamel sauce and mix thoroughly. Allow mixture to cool to room temperature; cover with plastic wrap and refrigerate until firm, 2 or 3 hours.",
        "Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Place 1 cup flour, beaten eggs, and bread crumbs in 3 separate shallow bowls.",
        "Scoop out chilled mixture into evenly-sized portions (about the size of a golf ball) to form croquettes. Roll balls first in flour, then in beaten eggs, and then in bread crumbs.",
        "Fry croquettes in batches until crispy, about 4 minutes. Drain on paper towels and transfer to rack."
    ],
    "ingredients": [
        "1/2 cup unsalted butter",
        "1/2 yellow onion, finely chopped",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon freshly ground black pepper",
        "1 pinch freshly grated nutmeg",
        "1 pinch cayenne pepper",
        "2 1/2 cups whole milk",
        "1 teaspoon salt, plus more to taste",
        "2 cups finely chopped, cooked chicken meat",
        "1/2 cup finely chopped ham",
        "2 tablespoons freshly chopped Italian parsley",
        "Breading:",
        "1 cup all-purpose flour, or as needed for dredging",
        "2 eggs, beaten",
        "2 cups bread crumbs",
        "2 cups vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deep-Fried Creamy Chicken Gravy",
    "url": "http://allrecipes.com/recipe/244554/deep-fried-creamy-chicken-gravy/"
}
