{
    "directions": [
        "Line 2 greased jelly-roll pans, 15 by 10 by 1 inch each, with wax paper and butter and flour the paper, shaking out the excess. In a large bowl with an electric mixer beat the egg yolks, add slowly 1 1/2 cups of the sugar, beating, and beat the mixture until it is thick and pale and forms a ribbon when the beaters are lifted. Add the chocolate and combine the batter well. In another large bowl with clean beaters beat the egg whites until they hold soft peaks, add the remaining 1/4 cup sugar slowly, and beat the mixture until it just holds stiff peaks. Stir one fourth of the whites into the yolk mixture, fold in the remaining whites gently but thoroughly, and pour the batter into the pans, spreading it evenly. Bake the cake layers in the middle of a preheated 375°F. oven for 18 to 20 minutes, or until a tester comes out clean. Let the cake layers cool in the pans, covered with kitchen towels, on large racks. Invert the cake layers onto the racks and remove the wax paper carefully.",
        "In a small heavy saucepan dissolve the sugar in 1/3 cup water over moderate heat, stirring, bring the mixture to a boil, and boil it until it registers 240°F. on a candy thermometer. In a large bowl with an electric mixer beat the eggs until they are frothy, add the sugar syrup in a thin stream, beating, and beat the mixture until it is cool. Beat in the butter, 1 tablespoon at a time, the espresso mixture, and a pinch of salt and beat the buttercream until it is combined well. If necessary, chill the buttercream, covered, until it is firm enough to spread.",
        "In a large heavy saucepan bring the cream just to a boil and remove the pan from the heat. Add the chocolate and stir the mixture until it is smooth. Transfer the mixture to a bowl and chill it, covered, stirring occasionally, until it is cool and thickened, but do not let it solidify. Beat the mixture until it just forms soft peaks, but do not overbeat it or it will become granular.",
        "Transfer the cake layers to a work surface, trim the edges, and halve each cake layer lengthwise. On a serving plate arrange one of the cake layers, spread it with one third of the preserved, strained, and spread one third of the ganache over the preserves. Top the ganache with another cake layer and layer the remaining preserves, ganache, and cake layers in the same manner, ending with a cake layer. Spread the sides and top of the cake with a very thin layer of the buttercream and chill the torte for 30 minutes. Spread the sides and top of the torte with some of the remaining buttercream, reserving about 1/3 cup of it for making rosettes, and with a pastry comb or the tines of a fork score the buttercream lengthwise. Draw the back of a knife crosswise across the scored buttercream at intervals. Transfer the reserved buttercream to a small pastry bag fitted with a decorative tip, pipe rosettes on top of the torte along the long sides, and intersperse the rosettes with the chocolate coffee beans. The torte may be made 2 days in advance and kept covered loosely and chilled. Remove the torte from the refrigerator 30 minutes before serving."
    ],
    "ingredients": [
        "14 large eggs, separated",
        "1 3/4 cups sugar",
        "9 ounces fine-quality bittersweet chocolate, melted and cooled",
        "1 cup sugar",
        "2 large eggs",
        "3 sticks (1 1/2 cups) unsalted butter, softened",
        "3 tablespoons instant espresso powder dissolved in 1 tablespoon hot water",
        "1 1/2 cups heavy cream",
        "6 ounces fine-quality bittersweet chocolate, chopped fine",
        "3/4 cup apricot preserves or red currant jelly, heated to lukewarm",
        "chocolate coffee beans (available at specialty foods shops) for decoration"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Gourmet"
    ],
    "title": "Deep Chocolate Torte with Coffee Buttercream",
    "url": "http://www.epicurious.com/recipes/food/views/deep-chocolate-torte-with-coffee-buttercream-11038"
}
