{
    "directions": [
        "Whisk together cream and 2 teaspoons flour in a small bowl until just combined.",
        "Cook shallot in butter in a 9- to 10-inch heavy skillet over moderately low heat, stirring occasionally, until shallot is softened, about 3 minutes. Add spinach, nutmeg, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook, stirring constantly, until excess liquid is evaporated, about 2 minutes. Stir cream mixture, then add to spinach and cook, stirring occasionally, until cream is slightly thickened, about 2 minutes. Remove from heat.",
        "Stir together bread crumbs, 1/4 teaspoon salt, and 1/8 teaspoon pepper in a shallow bowl. Spread remaining 1/2 cup flour on a plate and set aside for dredging.",
        "Gently blot any water from top of poached eggs with paper towels, then sprinkle with remaining 1/4 teaspoon salt and 1/8 teaspoon pepper.",
        "Carefully dredge 1 poached egg in flour, dusting off excess. Transfer to beaten egg, spooning to coat completely, then transfer with a slotted spoon to bread crumbs, letting excess egg drip off. Coat with crumbs and transfer to a plate. Repeat with remaining poached eggs, 1 at a time.",
        "Cut sliced ham crosswise into 1/4-inch-wide strips.",
        "Heat 1 1/2 inches oil in a 3- to 4-quart heavy saucepan (about 1 1/2 inches deep) over high heat until deep-fat thermometer registers 375°F. Fry ham in oil, stirring occasionally with a clean slotted spoon to separate strips, until crisp, 15 to 20 seconds. Transfer ham to paper towels to drain.",
        "Return frying oil to 375°F.",
        "Lower 2 eggs (1 at a time on slotted spoon) into hot oil and fry until golden brown, 15 to 20 seconds. Transfer fried eggs to paper towels to drain. Repeat with remaining 2 eggs.",
        "Reheat spinach over low heat, stirring constantly and adding more cream or water to loosen mixture if necessary, about 1 minute.",
        "Divide creamed spinach among 4 plates, then top with poached eggs and ham."
    ],
    "ingredients": [
        "1 cup heavy cream",
        "1/2 cup plus 2 teaspoons all-purpose flour",
        "2 tablespoons finely chopped shallot",
        "1 tablespoon unsalted butter",
        "1 (10-oz) package frozen chopped spinach, thawed and squeezed dry",
        "1/8 teaspoon freshly grated nutmeg",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 1/2 cups coarse fresh bread crumbs (from firm white bread)",
        "4 poached large eggs >",
        "3 oz thinly sliced serrano ham or prosciutto",
        "7 to 8 cups vegetable oil",
        "1 large egg, lightly beaten with 0 teaspoon water",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Breakfast",
        "Brunch",
        "Fry",
        "Poach",
        "New Year's Day",
        "Ham",
        "Spinach",
        "Deep-Fry",
        "Prosciutto",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Deep-Fried Poached Eggs with Creamed Spinach and Serrano Ham",
    "url": "http://www.epicurious.com/recipes/food/views/deep-fried-poached-eggs-with-creamed-spinach-and-serrano-ham-236721"
}
