{
    "directions": [
        "Place the turkey in the empty fryer pot and cover it with about 2 inches of water. Remove the turkey from the pot, dry it thoroughly with paper towels, and set it aside at room temperature. Use a waterproof marker to mark the water level on the inside or outside of the pot so you know how much oil to put in the pot. Discard the water then wash and dry the pot thoroughly.",
        "Arrange the burner on a flat surface far away from the house, garage, or anything that could easily catch fire. Place the pot over the burner and clip a long-pronged deep-fry thermometer to the side of the pot. Using the mark you made earlier, fill the pot with oil. Heat the oil until the thermometer reaches 375°F.",
        "While the oil is heating, make the rub: In a small bowl, whisk together the salt, pepper, thyme, rosemary, and paprika. DO AHEAD: The herb rub can be prepared ahead and kept, in an airtight container, up to 1 month.",
        "Starting at the neck end of the turkey, slowly and carefully slide your hand between the skin and the meat of the breast, thighs, and upper drumsticks to separate and loosen the skin. Spread the herb rub under the skin on the thighs, drumsticks, and breasts. Spread any remaining rub inside the turkey cavity and on top of the skin. To ensure good oil flow, make sure the neck cavity is wide open, and use a small sharp knife to cut a small slit through the skin where the leg meets the breast.",
        "Place the turkey on the poultry rack, with the breast facing down and the legs facing up. Once the oil reaches 375°F, turn off the burner. Wearing an apron and long heavy-duty oven mitts, use the hook that attaches to the rack to slowly lower the turkey into the oil using a stop-and-go method—slowly lower the turkey 1 to 2 inches into the oil then pull it back out a bit, repeating until the bird is fully submerged. Turn the burner back on and bring the oil to 350°F. Throughout frying, adjust the heat as necessary to maintain the 350°F oil temperature. Fry the turkey for about 3 1/2 minutes per pound. Use the hook that attaches to the rack to slowly and carefully remove the turkey from the oil and place it on a cutting board or large rimmed baking sheet. Using an instant-read thermometer, test the fleshy part of the thighs and the thickest part of the breasts (test both sides, close to but not touching the bone); the thermometer needs to register at least 165°F. If not, use the hook to slowly and carefully lower the turkey back into the oil to finish frying. Once the internal temperature reaches 165°F, transfer the turkey to a cutting board, cover with foil, and let it rest 20 to 30 minutes before carving and serving."
    ],
    "ingredients": [
        "1 (12- to 14- pound) turkey, neck and giblets removed",
        "4 to 5 gallons peanut or canola oil",
        "3 tablespoons kosher salt",
        "1 1/2 tablespoons freshly ground black pepper",
        "1 1/2 tablespoons dried thyme",
        "1 1/2 tablespoons dried rosemary",
        "1 1/2 tablespoons ground paprika",
        "Equipment: Turkey frying kit (30-quart or larger aluminum pot; propane burner with a hose that connects to a propane tank and a gauge for regulating the flame; poultry rack with a hook for lowering and raising the turkey in the pot; 12-inch deep-fry thermometer that clips to the side of the pot to monitor the oil temperature); a full propane gas tank; a waterproof marker; an apron; long heavy-duty oven mitts; an instant-read thermometer; fire extinguisher—just in case"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Deep-Fry"
    ],
    "title": "Deep-Fried Turkey with Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/deep-fried-turkey-with-herbs-51197830"
}
