{
    "directions": [
        "Preheat the oven to 325 degrees F. Spray the inside of a 9-inch springform pan with nonstick cooking spray.",
        "Roll out the pie crust, place into the prepared pan and prick the bottom with a fork. Fill the crust with chopped pecans. Transfer to the refrigerator until the filling is done.",
        "In a medium bowl, whisk together the honey, dark brown sugar, eggs and egg yolks until smooth. Whisk in the beer and allow the foam to settle.",
        "Stir the melted butter into the flour in a separate bowl until smooth and lump free. Whisk the butter mixture into the sugar filling until well combined.",
        "Remove the crust from the refrigerator and fill with the sugar mixture. Place the pie in the center of the oven and bake until the center is set, 50 to 55 minutes. It will still move a little but it won't roll in the pan. Remove from the oven and cool to room temperature before serving. Serve with the Caramel Sauce.",
        "In a large saucepan over medium-high heat, combine the sugar and 1/4 cup water. Add the lemon juice, and brush down the sides of the pot with a wet pastry brush to remove any sugar crystals from the sides of the pot. Bring to a boil. When the sugar starts to turn brown, after about 7 minutes, slowly pour in the cream, whisking constantly. The sauce will bubble dramatically so be careful. When the cream is incorporated, return to a boil, stirring constantly. Once it has returned to a boil, remove from the heat and whisk in the butter, stirring until melted.",
        "Serve immediately or cool completely and store at room temperature in an airtight container for up to one week."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "1 store-bought refrigerated pie crust",
        "4 cups chopped pecans",
        "1 cup honey",
        "3/4 cup dark brown sugar",
        "3 whole large eggs plus 3 yolks",
        "1 cup stout beer or other dark beer",
        "4 tablespoons unsalted butter, melted",
        "2 tablespoon all-purpose flour",
        "Caramel Sauce, recipe follows",
        "2 cups sugar",
        "2 tablespoons lemon juice",
        "1 cup heavy cream",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pecan Pie",
        "Nut Recipes",
        "Pie Recipes",
        "Baking",
        "Dessert"
    ],
    "title": "Deep-Dish Pecan Pie",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/deep-dish-pecan-pie"
}
