{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Cut each apple quarter in thirds crosswise and combine in a bowl with the zests, juices, 1/2 cup sugar, flour, salt, cinnamon, nutmeg, and allspice.",
        "Roll out half the pie dough and drape it over a 9- or 10-inch pie pan to extend about 1/2-inch over the rim. Don't stretch the dough; if it's too small, just put it back on the board and re-roll it.",
        "Fill the pie with the apple mixture. Brush the edge of the bottom pie crust with the egg wash so the top crust will adhere. Top with the second crust and trim the edges to about 1-inch over the rim. Tuck the edge of the top crust under the edge of the bottom crust and crimp the 2 together with your fingers or a fork. Brush the entire top crust with the egg wash, sprinkle with 1 teaspoon sugar, and cut 4 or 5 slits.",
        "Place the pie on a sheet pan and bake for 1 to 1 1/4 hours, or until the crust is browned and the juices begin to bubble out. Serve warm.",
        "Dice the butter and return it to the refrigerator while you prepare the flour mixture. Place the flour, salt, and sugar in the bowl of a food processor fitted with a steel blade and pulse a few times to mix. Add the butter and shortening. Pulse 8 to 12 times, until the butter is the size of peas. With the machine running, pour the ice water down the feed tube and pulse the machine until the dough begins to form a ball. Dump out on a floured board and roll into a ball. Wrap in plastic wrap and refrigerate for 30 minutes.",
        "Cut the dough in half. Roll each piece on a well-floured board into a circle, rolling from the center to the edge, turning and flouring the dough to make sure it doesn't stick to the board. Fold the dough in half, place in a pie pan, and unfold to fit the pan. Repeat with the top crust."
    ],
    "ingredients": [
        "4 pounds Granny Smith apples, peeled, quartered, and cored",
        "1 lemon, zested",
        "1 orange, zested",
        "2 tablespoons freshly squeezed lemon juice",
        "1 tablespoon freshly squeezed orange juice",
        "1/2 cup sugar, plus 1 teaspoon to sprinkle on top",
        "1/4 cup all-purpose flour",
        "1 teaspoon kosher salt",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/8 teaspoon ground allspice",
        "Perfect Pie Crust, recipe follows",
        "1 egg beaten with 1 tablespoon water, for egg wash",
        "12 tablespoons (1 1/2 sticks) very cold unsalted butter",
        "3 cups all-purpose flour",
        "1 teaspoon kosher salt",
        "1 tablespoon sugar",
        "1/3 cup very cold vegetable shortening",
        "6 to 8 tablespoons (about 1/2 cup) ice water"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Pie",
        "Apple",
        "Fruit",
        "Pie Recipes",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Dessert",
        "Baking",
        "American"
    ],
    "title": "Deep-Dish Apple Pie",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/deep-dish-apple-pie-recipe"
}
