{
    "directions": [
        "Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, about 10 minutes; let cool.",
        "Pulse pecans and 1 Tbsp. flour in a food processor until finely ground. Add granulated sugar, salt, cinnamon, and remaining 1 cup plus 7 Tbsp. flour and pulse to combine. With the machine running, add butter, vinegar, and 2 Tbsp. cold water in a slow, steady stream and mix just until incorporated.",
        "Transfer mixture to a large bowl and press with your hands until a dough forms. Form into a 6\" disc, then transfer to pie plate and press into bottom and up sides with a flat-bottomed measuring cup. Crimp edge with a floured fork, if desired, and freeze while you prepare the filling.",
        "Position rack in center of oven and preheat to 350°F. Cook maple syrup in a medium saucepan over medium-high heat until reduced to about 1/2 cup, 8–10 minutes.",
        "Whisk eggs, brown sugar, flour, and salt in a large bowl until smooth. Whisk in cream, bourbon, cinnamon, and reduced maple syrup until combined.",
        "Heat butter over medium in a small saucepan, swirling pan occasionally, until nutty, dark brown, and most of the foam has subsided, about 5 minutes. Immediately whisk into maple syrup mixture.",
        "Place a sheet of parchment paper over dough and fill with pie weights or dried beans. Bake until edge is lightly golden, 10–15 minutes. Remove weights, then cover edge with a pie shield or foil to prevent overbrowning. Continue baking until center is golden brown, 5–10 minutes more.",
        "Pour filling into crust and bake pie until edge is set but center is still very jiggly, 40–45 minutes. Transfer to a wire rack and let cool at least 2 hours (the center will set as pie cools).",
        "Combine cream and yogurt in a large bowl. Scrape in vanilla seeds and reserve pod for another use, or add vanilla extract. Using an electric mixer on medium-low speed, beat until soft peaks form. Mound whipped cream in center of pie."
    ],
    "ingredients": [
        "1/2 cup pecans (2 ounces)",
        "1 1/2 cups all-purpose flour, divided",
        "1/4 cup granulated sugar",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground cinnamon",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 tablespoon apple cider vinegar",
        "3/4 cup maple syrup",
        "3 large eggs plus 2 large egg yolks, lightly beaten",
        "1 cup (packed) dark brown sugar",
        "3 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1 cup heavy cream, room temperature",
        "2 tablespoons bourbon",
        "1/4 teaspoon ground cinnamon",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1 cup chilled heavy cream",
        "1 tablespoon plain whole-fat Greek yogurt",
        "1 vanilla bean, split lengthwise, or 2 teaspoons vanilla extract",
        "A 9\" deep-dish pie plate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Bourbon",
        "Dessert",
        "Thanksgiving",
        "Maple Syrup",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Deep-Dish Maple-Bourbon Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/deep-dish-maple-bourbon-cream-pie"
}
