{
    "directions": [
        "Preheat the oven to 450 degrees  F.",
        "In a small bowl, combine the Monk Fruit In The Raw(R) Bakers Bag, Sugar In The Raw, cinnamon, clove, and salt, and set aside. In a large bowl, toss the apples with the lemon juice. In a large skillet over medium-high heat, melt the butter. Add the apples and cook until they look moist, 3 minutes, stirring frequently. Mix in the sweetening and spice mixture, and cook until the apple slices soften slightly, 3 minutes, stirring occasionally. Spread the hot apples on a baking sheet and cool to room temperature.",
        "Using the remaining 1/2 teaspoon butter, coat a 9-inch deep-dish pie plate or other baking dish. Spread the apples in the prepared baking dish. Arrange the pie crust over the fruit, tucking it under around the edges. Using a fork or your fingers, crimp the edges of the crust decoratively. If desired, brush the crust with the cream or milk. With a sharp knife, cut vents in the crust, placing them decoratively.",
        "Reduce the oven to 400 degrees  F. Bake the pie in the center of the oven for 30 minutes. Cover the edges of the crust with strips of foil to prevent burning. Bake the pie for 30 minutes longer, or until the crust is golden brown. Cool the pie on a wire rack. Serve lukewarm or at room temperature."
    ],
    "ingredients": [
        "5 pounds apples, preferably Golden Delicious and Johnagold - peeled, cored, and cut into 1/4-inch slices",
        "3 tablespoons Monk Fruit In The Raw® Bakers Bag",
        "2 tablespoons Sugar In The Raw®",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "1 tablespoon lemon juice",
        "2 tablespoons unsalted butter",
        "1/2 teaspoon unsalted butter",
        "1 (9 inch) unbaked single pie crust",
        "1 tablespoon cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deep Dish Apple Pie from Sugar In The Raw®",
    "url": "http://allrecipes.com/recipe/245321/deep-dish-apple-pie-from-sugar-in-the/"
}
