{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Line bottoms of two 9-inch cake pans with parchment or waxed paper.",
        "To Make Cake: Melt 6 ounces of semisweet chocolate and 6 ounces of unsweetened chocolate in the top of a double boiler, or in a microwave. Cool, and beat in egg yolks.",
        "In a large bowl, beat butter, 1 1/2 cups sugar, and vanilla until light and fluffy. Add chocolate mixture, and continue beating until smooth. Stir in flour until just combined.",
        "In another bowl, beat egg whites until foamy. Gradually beat in 1/2 cup sugar, and continue beating until the whites hold soft peaks. Fold whites into chocolate batter, in three additions. Pour batter into prepared pans, and smooth tops.",
        "Bake in preheated oven until a toothpick stuck into the centers of the cakes comes out with moist crumbs, about 45 minutes. Cool in pans.",
        "To Make Frosting: In a saucepan, bring cream just to a boil. Chop 6 ounces semisweet chocolate, and stir into the cream. Remove saucepan from heat, and continue stirring until smooth. Pour frosting into bowl, and press sheet of plastic wrap directly against surface of chocolate to prevent a skin from forming. Refrigerate until thick enough to spread.",
        "To Make Filling: Drain the thawed raspberries, if necessary, and combine with the jam. Sandwich the cake layers with raspberry filling. Spread top and sides with chocolate frosting."
    ],
    "ingredients": [
        "6 (1 ounce) squares semi-sweet chocolate",
        "6 (1 ounce) squares unsweetened chocolate",
        "7 eggs, separated",
        "1 cup all-purpose flour",
        "1 cup butter, room temperature",
        "2 cups white sugar",
        "1 1/2 teaspoons vanilla extract",
        "6 (1 ounce) squares semisweet chocolate",
        "3/4 cup heavy whipping cream",
        "1 (4 ounce) package frozen raspberries, thawed",
        "3 tablespoons seedless raspberry preserves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deep Chocolate Raspberry Cake",
    "url": "http://allrecipes.com/recipe/7466/deep-chocolate-raspberry-cake/"
}
