{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Trim any thick pieces of dense, hard fat from the roast, but leave smaller areas of fat in place.",
        "In a bowl, mix 2 cups of beef base with minced garlic, and rub the mixture generously all over the roast. Sprinkle the roast with 1/2 cup of fresh thyme, 1/2 cup of oregano, the black peppercorns, and salt. Place into a roasting pan.",
        "Roast in the preheated oven until the meat has formed a brown crust and a quick-read meat thermometer inserted into the thickest part of the roast measures 135 degrees F (57 degrees C), for medium-rare, about 3 hours. If you prefer the meat well-done, roast an additional 45 minutes. Remove roast from oven, and allow to stand while you make the sauce. Temperature of the meat will rise about 10 more degrees as it rests.",
        "Pour the water into a saucepan, and dissolve 1 tablespoon of beef base in the water. Mix in the red wine, and stir in 1 teaspoon of thyme, 1 teaspoon of oregano, and the garlic powder. Add the celery, onion, and carrot pieces to the sauce. Bring the mixture to a boil, and cook, stirring often, until the sauce reduces by half, 20 to 30 minutes. Strain sauce and discard vegetables before serving sauce with the roast."
    ],
    "ingredients": [
        "1 (10 pound) prime rib loin roast",
        "2 cups concentrated beef base (paste)",
        "1 clove garlic, minced",
        "1/2 cup chopped fresh thyme",
        "1/2 cup dried oregano",
        "1/2 cup whole black peppercorns",
        "2 teaspoons salt",
        "2 1/2 cups water",
        "1 tablespoon concentrated beef base (paste)",
        "2 tablespoons dry red wine",
        "1 teaspoon finely chopped fresh thyme",
        "1 teaspoon dried oregano",
        "1/2 teaspoon garlic powder",
        "1 stalk celery, quartered",
        "1/2 white onion, coarsely chopped",
        "1/2 carrot, peeled and coarsely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Delectable Prime Rib and Au Jus",
    "url": "http://allrecipes.com/recipe/219589/delectable-prime-rib-and-au-jus/"
}
