{
    "directions": [
        "Heat oil in large skillet over medium-high heat. Add onions; sauté until golden, 14 minutes. Add garlic and next 7 ingredients; stir 2 minutes. Scrape mixture into processor. Add 4 cups yogurt. Blend until mixture is coarse puree; transfer to large bowl. Mix in 2 cups yogurt and lemon juice.",
        "Place 1 cup yogurt marinade in small bowl. Cover, chill, and reserve for topping. Place 3 cups marinade in medium bowl; mix in remaining 1 1/2 cups yogurt and season with salt and pepper. Cover, chill, and reserve for sauce.",
        "Place lamb in large roasting pan and shape into rectangle approximately 12x6 inches (some thin layers may overlap). Sprinkle with 2 1/4 teaspoons salt; spread with half of remaining marinade. Carefully turn lamb over. Sprinkle with remaining 2 1/4 teaspoons salt; spread with remaining marinade. Cover with plastic wrap. Refrigerate overnight.",
        "Preheat oven to 375°F. Blend almonds, cashews, sugar, salt, and 1 cup marinade reserved for topping in processor until nuts are coarsely chopped.",
        "Remove plastic and scrape most of marinade off top of lamb. Cover pan with foil and roast lamb 1 1/2 hours. Uncover; spread nut topping evenly over. Roast lamb uncovered until topping is golden and lamb is tender, about 1 hour. Let stand 10 minutes.",
        "Transfer lamb to platter. Serve, passing reserved sauce."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "1 1/4 pounds white onions, chopped",
        "4 garlic cloves, chopped",
        "3 serrano chiles, sliced into rounds",
        "1 2-inch-long piece fresh ginger, peeled, thinly sliced",
        "10 whole cloves",
        "1 tablespoon cumin seeds",
        "1 tablespoon ground cinnamon",
        "2 teaspoons ground cardamom",
        "1 teaspoon black peppercorns",
        "7 1/2 cups (60 ounces) plain whole-milk yogurt, divided",
        "6 tablespoons fresh lemon juice",
        "1 whole lamb shoulder (about 10 pounds), boned, trimmed of all fat (about 4 1/3 pounds)",
        "4 1/2 teaspoons coarse kosher salt, divided",
        "2 cups sliced almonds (about 7 ounces)",
        "1 cup raw cashews (about 5 ounces)",
        "1/2 cup (packed) golden brown sugar",
        "1 tablespoon coarse kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "High Fiber",
        "Tree Nut",
        "Almond"
    ],
    "title": "Delhi-Style Yogurt-Marinated Lamb with Nut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/delhi-style-yogurt-marinated-lamb-with-nut-crust-240113"
}
