{
    "directions": [
        "Combine 2 1/2 cups water and lentils in a saucepan; bring to a boil. Reduce heat, cover saucepan, and simmer until all the liquid is absorbed and lentils are tender, 20 to 30 minutes.",
        "Mix 1/3 cup water and ground flax seed together in a bowl; set aside until thickened, at least 10 minutes.",
        "Heat olive oil in a large pot over medium heat; cook and stir onion, mushrooms, celery, and garlic until softened and liquid from mushrooms has evaporated, 5 to 10 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.",
        "Transfer cooked lentils to a food processor and pulse until about 75 percent of lentils are mashed. Mix onion-mushroom mixture, oats, flour, basil, black pepper, salt, and onion powder into lentils until well combined. Press lentil mixture into the prepared loaf pan.",
        "Combine ketchup, brown sugar, mustard, and barbeque sauce in a saucepan over medium-low heat; cook and stir until glaze is smooth and brown sugar is dissolved, about 5 minutes. Remove saucepan from heat.",
        "Bake loaf in the preheated oven for 35 minutes. Spread 1/4 cup glaze over lentil loaf; continue baking until cooked through, 10 to 15 minutes more. Serve lentil loaf with remaining glaze on the side."
    ],
    "ingredients": [
        "Lentil Loaf:",
        "2 1/2 cups water",
        "1 cup brown lentils",
        "1/3 cup water",
        "3 tablespoons ground flax seed",
        "2 tablespoons olive oil",
        "1 onion, minced",
        "1 cup minced fresh mushrooms",
        "1 cup minced celery",
        "2 large cloves garlic, minced",
        "3/4 cup quick-cooking oats",
        "1/2 cup all-purpose flour",
        "1 teaspoon dried basil",
        "1 teaspoon ground black pepper",
        "1 teaspoon salt",
        "1/2 teaspoon onion powder",
        "Glaze:",
        "1/4 cup ketchup",
        "1/4 cup brown sugar",
        "2 tablespoons mustard",
        "2 tablespoons smoky barbeque sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Delicious Lentil Loaf",
    "url": "http://allrecipes.com/recipe/246344/delicious-lentil-loaf/"
}
