{
    "directions": [
        "1. Squash. If using delicata squash, peel it with a vegetable peeler, cut it lengthwise in half, and scrape out the seeds with a spoon. Cut each piece lengthwise in half again, then crosswise into 1/2-inch -thick slices. Other types of squash should be peeled with a chef's knife, seeded, cut into 1-inch wedges, then sliced 1/2-inch thick.",
        "2. Herb Butter. Melt the butter in a large (12-inch) skillet over low heat. Add the sage and rosemary and cook, stirring, until the butter just begins to turn golden brown, 3 to 5 minutes. Do not brown the herbs. Cooking the herbs in butter mellows their flavor and improves their texture.",
        "3. Cooking the squash. Add the squash to the skillet, then the apple cider, water, vinegar, and salt. Cook, stirring occasionally, over medium heat at an even boil until the cider has boiled down to a glaze and the squash is tender, 20 to 30 minutes. Taste and season with pepper, and additional salt if needed."
    ],
    "ingredients": [
        "2 medium delicata squash (about 2 pounds) or other firm winter squash",
        "3 tablespoons unsalted butter",
        "1/4 cup very coarsely chopped fresh sage",
        "1 tablespoon coarsely chopped fresh rosemary",
        "1 1/2 cups fresh unfiltered apple cider or juice",
        "1 cup water",
        "2 teaspoons sherry vinegar",
        "1 teaspoon salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Herb",
        "Side",
        "Thanksgiving",
        "Squash",
        "Winter",
        "Sage",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Delicata Squash with Rosemary, Sage, and Cider Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/delicata-squash-with-rosemary-sage-and-cider-glaze-104125"
}
