{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.",
        "Whisk together the flour and salt in a large mixing bowl. Cut in the softened butter with a knife or pastry blender until the mixture resembles coarse crumbs. Whisk together the egg yolks in a liquid measuring cup, then add enough milk to reach 2/3 cup of liquid. Gradually stir into the flour mixture until moistened. Turn the dough out onto a lightly floured surface and knead briefly. Roll about half of the dough out to fit the prepared baking dish. Place the bottom crust in the baking dish. Sprinkle the oats evenly over the crust. Roll out the top crust, and set aside.",
        "Mix the cornstarch and lemon juice together until smooth. Heat the cornstarch mixture in a large skillet with the apples, white sugar, brown sugar, cinnamon, and nutmeg over medium heat until the apples are tender, about 15 minutes. Remove from heat, and allow to cool slightly. Spread the apple filling evenly over the oats. Cover the filling with the top crust. Pinch the edges together to seal the crusts, and brush with egg white. Cut a few slits on the top crust to vent.",
        "Bake in the preheated oven until golden brown and the filling has thickened, about 50 minutes.",
        "While pie is baking, prepare the glaze by beating the confections' sugar with 1 tablespoon of milk in a small bowl. Stir in the almond extract. Drizzle the glaze over the warm pie. Mix 1 teaspoon of sugar and 1/2 teaspoon of cinnamon together in a small bowl, and sprinkle cinnamon sugar over the glaze. Cool completely before cutting into bars."
    ],
    "ingredients": [
        "2 1/2 cups sifted all-purpose flour",
        "1 teaspoon salt",
        "1 cup butter, softened but not melted",
        "2 egg yolks",
        "1/3 cup milk, or as needed",
        "1 cup rolled oats",
        "1 tablespoon cornstarch",
        "1 tablespoon lemon juice",
        "6 large apples - peeled, cored, and sliced",
        "1/2 cup white sugar",
        "1/4 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 egg white, beaten until foamy",
        "1/2 cup confectioners' sugar",
        "1 tablespoon milk",
        "1 dash almond extract, or to taste",
        "1 teaspoon white sugar",
        "1/2 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Delicious Apple Pie Bars",
    "url": "http://allrecipes.com/recipe/214721/delicious-apple-pie-bars/"
}
