{
    "directions": [
        "In a medium bowl, toss the cucumber with the salt. Let stand about 1 hour. Transfer to a sieve and rinse well under cold running water. Pat the cucumber dry.",
        "In a small bowl, mix the drained cucumber, mayonnaise, scallion, capers, and anchovy paste. Cover and refrigerate for at least 1 hour. (The tartar sauce can be prepared up to 3 days ahead.)",
        "Mix the 1/2 cup bread crumbs, the mayonnaise, egg, mustard, scallion, Worcestershire sauce, and Delmarva or Old Bay seasoning. Mix in the crabmeat with wet hands, form into 6 cakes about 3 inches wide. Place the remaining 1/2 cup bread crumbs in a deep plate. Coat the crab cakes in the crumbs and set aside.",
        "Line a baking sheet with paper towels. Into a large deep skillet (preferably cast iron), pour vegetable oil to a depth of 1/2 inch, and heat over high heat until very hot but not smoking. Carefully add the crab cakes and cook, turning once, until golden brown, about 3 minutes. Using a slotted spatula, transfer to the paper towels to drain. Serve hot, with the tartar sauce on the side.",
        "<a name=\"del\"></a>To make Delmarva Seasoning: Mix 2 teaspoons salt, 1 teaspoon ground celery seed, 1 teaspoon dry mustard, 1 teaspoon sweet paprika, 1 teaspoon ground black pepper, 1 teaspoon ground bay leaf, 1/4 teaspoon ground cloves, 1/4 teaspoon ground allspice, 1/4 teaspoon ground ginger, 1/4 teaspoon freshly grated nutmeg, 1/4 teaspoon ground cardamom, and 1/4 teaspoon ground cinnamon. Will keep indefinitely in a tightly covered container in a cool, dark place. Makes about 3 tablespoons."
    ],
    "ingredients": [
        "1 cup 1/8-inch cubes peeled and seeded cucumber",
        "1/2 teaspoon salt",
        "1/2 cup mayonnaise",
        "1 scallion, white and green parts, finely chopped",
        "2 tablespoons nonpareil capers, rinsed",
        "1 teaspoon anchovy paste",
        "1/2 cup plus 1/3 cup dried bread crumbs",
        "1/4 cup mayonnaise",
        "1 large egg, beaten",
        "1 tablespoon Dijon mustard",
        "1 scallion, white and green parts, finely chopped",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon Delmarva Seasoning, or store-bought Old Bay Seasoning",
        "1 pound fresh lump crabmeat, picked over for cartilage",
        "vegetable oil for deep-frying"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Fry",
        "Cocktail Party",
        "Super Bowl",
        "Kentucky Derby",
        "Back to School",
        "Lunch",
        "Winter",
        "Shower"
    ],
    "title": "Delmarva Crab Cakes with Cucumber Tartar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/delmarva-crab-cakes-with-cucumber-tartar-sauce-100928"
}
