{
    "directions": [
        "Using vegetable peeler, remove peel from lemon in long strips (yellow part only). Combine half of lemon peel (reserve other half for another use), 1 1/2 cups milk, sugar, and cinnamon in large saucepan. Bring to boil; cover and remove from heat. Let steep 15 minutes.",
        "Whisk remaining 1/2 cup milk, cornstarch, and egg yolks in medium bowl to blend. Bring lemon-milk mixture to simmer. Gradually whisk yolk mixture into lemon-milk mixture. Cook over medium heat until mixture boils and thickens, stirring constantly (custard will be very thick). Strain into medium bowl. Press plastic wrap directly onto surface of custard and refrigerate. DO AHEAD: Can be made 2 days ahead. Keep refrigerated.",
        "Whisk eggs in large bowl to blend. Whisk in milk, Pernod, and salt. Add flour and whisk batter to blend well. Let batter rest 1 hour.",
        "Heat 10-inch-diameter skillet with 8-inch-diameter bottom over medium-high heat. Brush skillet with oil. Add scant 1/4 cup batter to skillet and quickly swirl batter to thinly coat bottom of skillet. Cook until golden brown on bottom, adjusting heat for even browning, about 1 1/2 minutes. Flip pancake over and cook until just cooked through and golden brown in spots, about 30 seconds longer. Transfer to parchment-paper-lined plate. Repeat with remaining batter, placing parchment paper between each pancake. DO AHEAD: Can be made 1 day ahead. Cover with foil and refrigerate.",
        "Preheat oven to 300°F. Place covered pancakes in oven until warm, about 10 minutes. Fold pancakes in half, then in half again, forming triangle. Place 2 pancakes on each plate. Spoon dollop of custard and dollop of whipped cream atop pancakes. Garnish pancakes with fresh raspberries and serve."
    ],
    "ingredients": [
        "1 lemon",
        "2 cups whole milk, divided",
        "2/3 cup sugar",
        "1 cinnamon stick, broken in half",
        "1/3 cup cornstarch",
        "2 large egg yolks",
        "3 large eggs",
        "1 3/4 cups whole milk",
        "2 1/2 tablespoons Pernod or ouzo",
        "1/2 teaspoon (scant) salt",
        "1 cup all purpose flour",
        "Olive oil (for brushing)",
        "Whipped cream",
        "Fresh raspberries (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Egg",
        "Dessert",
        "Pernod",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dessert Pancakes with Custard and Berries",
    "url": "http://www.epicurious.com/recipes/food/views/dessert-pancakes-with-custard-and-berries-358551"
}
