{
    "directions": [
        "Place beef in freezer to make it easier to thinly slice. Set a medium pot of salted water to boil.",
        "Meanwhile, heat a large pot over medium-high; add ginger, garlic, star anise, cinnamon, and cloves. Toast the spices tossing them constantly, until lightly browned and fragrant, about 3 minutes. Immediately add broth, cover, and bring to a gentle boil. Reduce heat to a gentle simmer and cook, partially covered, for 20 minutes. Use a slotted spoon, spider strainer, or small sieve to remove ginger, garlic, and spices from broth; discard. Add fish sauce to broth and taste; season with a little salt and an additional 1/2 teaspoon fish sauce, if desired. Cover pho broth and keep at a gentle simmer.",
        "Add noodles to the medium pot of boiling water; cook according to package directions. Drain noodles and divide among four bowls. Remove beef from freezer and slice as thinly as possible.",
        "Add kale and mushrooms to broth and simmer until soft, 2 to 3 minutes. Add sliced beef and simmer until just barely cooked, 20 to 30 seconds (it will continue to cook in soup). Using tongs, divide beef among bowls.",
        "Ladle broth, kale, and mushrooms into bowls over noodles. Garnish with your choice of toppings, and serve right away."
    ],
    "ingredients": [
        "12 ounces beef eye of round steak",
        "Two 2-inch pieces of ginger, unpeeled and thinly sliced",
        "4 garlic cloves, smashed",
        "2 star anise pods",
        "1 cinnamon stick",
        "5 whole cloves",
        "8 cups Beef Bone Broth or store-bought low-sodium beef broth",
        "1 teaspoon Asian fish sauce",
        "Kosher salt, to taste",
        "4 ounces dried rice noodles, such as vermicelli or bahn pho (rice sticks)",
        "8 ounces kale, stemmed and roughly chopped (about 4 cups)",
        "4 ounces assorted mushrooms, such as cremini, shitake, oyster, beech, and/or maitake, sliced if large",
        "1 cup mung bean sprouts",
        "1/2 cup fresh herbs such as basil, mint, and/or cilantro",
        "1 small red or green chile, thinly sliced",
        "1 scallion, thinly sliced",
        "1/2 small red onion, thinly sliced and rinsed in cold water",
        "1 small carrot, julienned",
        "1 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Boil"
    ],
    "title": "Detox Pho with Beef, Mushrooms, and Kale",
    "url": "http://www.epicurious.com/recipes/food/views/detox-pho-with-beef-mushrooms-and-kale-51260370"
}
