{
    "directions": [
        "1. In a medium-sized bowl combine the crab, mayonnaise, Old Bay seasoning, mustard, scallions, and celery. Mix gently until ingredients are evenly distributed and well coated with mayonnaise.",
        "2. Place four slices of bread on a clean surface and spread a half tablespoon of butter on each slice. Spread each slice with one sixth of the crab salad and top with thin layers of onion, egg, and baby lettuce.",
        "3. Butter both sides of four more slices of bread and top each half sandwich with one of these slices. Spread each sandwich with a third of the remaining deviled crab and the remaining onion, egg, and lettuce.",
        "4. Close the sandwiches with the four remaining bread slices, spread on oneside with the rest of the butter. Press firmly, butter side down, to \"seal\" the sandwich.",
        "5. Slice off crusts then slice each sandwich into four triangular finger sandwiches and place on a platter.",
        "6. Cover sandwiches with damp paper towel and plastic wrap, and chill for at least 30 minutes. (Crab salad may be made up to one day ahead and the assembled sandwiches up to several hours ahead.)"
    ],
    "ingredients": [
        "1 pound jumbo lump crabmeat (about 2 cups)",
        "1 cup mayonnaise",
        "2 teaspoons Old Bay seasoning",
        "2 teaspoons Dijon mustard",
        "1/4 cup thinly sliced scallions",
        "1/4 cup thinly sliced celery",
        "12 thin slices pumpernickel bread (about 3 1/2 inches square and 1/8 inch thick)",
        "8 tablespoons softened butter",
        "1/4 cup thinly sliced red onion",
        "4 hard-boiled eggs, thinly sliced",
        "2–3 heads of crisp baby lettuce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fish",
        "Leafy Green",
        "Mustard",
        "Onion",
        "Vegetable",
        "Freeze/Chill",
        "No-Cook"
    ],
    "title": "Deviled Crab Salad Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/deviled-crab-salad-sandwiches-238629"
}
