{
    "directions": [
        "To bone the turkey, place the turkey, breast-side down, on a work surface. With a very sharp boning knife, slice open skin and meat along the spine.  Work down the spine on each side, around the rib cage, cutting and pulling the skin away from the bones.  Inside of thighs, cut out the thigh-bone.  Break the thighs-to-drum joint.  Break the wing-to-rib cage joint.  Remove rib and thigh bones, leaving wings and legs on. (See Editor's Note)",
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Place the chicken thigh meat into a food processor with the garlic and ginger, and pulse a few times to coarsely grind the meat. Do not pulverize the chicken.",
        "Heat 1 tablespoon of olive oil in a skillet, and cook and stir the chicken mixture until most of the pink is gone from the meat, about 5 minutes. Place the chicken into a large bowl, and stir in the bread cubes, golden and dark raisins, dried cherries, dried cranberries, dried currants, celery, and hard cider, mixing the stuffing well.",
        "Spread the boned turkey out flat on a work surface, skin side down. With your hands, scoop up stuffing and lightly form into a round shape for the chest area, adding more stuffing to fill the thigh area, shoulders, and other parts of the turkey. It's okay to compress the stuffing just a little. Pull the skin and meat around the stuffing, to join at the original backbone cut, completely enclosing the stuffing and recreating the shape of the turkey. Sew or lace the back of the turkey up with kitchen twine and a large needle or skewers. Rub the entire outside of the stuffed turkey with olive oil. Tie the drumstick ends together with kitchen twine. Place the roast in a roasting pan.",
        "Roast the turkey in the preheated oven until the juices run clear and the skin is golden brown, 3 to 4 hours.  An instant-read thermometer inserted into the thickest part of the roast should read 165 degrees F (75 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area  about 10 to 15 minutes before slicing."
    ],
    "ingredients": [
        "1 (10 pound) whole turkey, neck and giblets removed",
        "1 1/2 pounds skinless, boneless chicken thighs, cut into chunks",
        "1 tablespoon finely minced garlic",
        "1 tablespoon finely minced fresh ginger",
        "1 tablespoon extra-virgin olive oil",
        "1 (1 pound) loaf Hawaiian sweet bread, cut into 1-inch cubes",
        "1/4 cup golden raisins",
        "1/4 cup dark raisins",
        "1/4 cup dried cherries",
        "1/4 cup dried cranberries",
        "1/4 cup dried currants",
        "1/4 cup diced celery",
        "1/2 cup hard apple cider (See Cook's Note)",
        "kitchen twine",
        "1 teaspoon extra-virgin olive oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Devil Dan's Fruit-Stuffed Boneless Turkey",
    "url": "http://allrecipes.com/recipe/212685/devil-dans-fruit-stuffed-boneless-tu/"
}
