{
    "directions": [
        "1. Carefully flake the salmon into a bowl, discarding any small bones, cartilage, and skin. Add the onion, celery, corn, salt, and pepper. Fold together with a rubber spatula. Set aside.",
        "2. In another bowl, combine the mayonnaise, mustard, pickle relish, lemon juice, Worcestershire sauce, paprika, and Tabasco sauce. Fold these ingredients into the salmon mixture.",
        "3. Lightly beat the egg. Using the rubber spatula, fold into the salmon mixture along with 1/2 cup of the cracker crumbs. Place the remaining cup of cracker crumbs on a dinner plate.",
        "4. Form the salmon mixture into eight 3-inch patties. Carefully coat them with the cracker crumbs. Refrigerate, loosely covered, for 1 hour.",
        "5. Melt the butter with the oil in a 10-inch nonstick skillet over medium heat. Cook the salmon cakes, four at a time, for 3 to 4 minutes per side, pressing down slightly on them with the back of the spatula and adding more butter or oil to the skillet if necessary. Remove to paper towels to drain.",
        "6. To serve, spoon 2 tablespoons of the Light Lemon Yogurt Sauce onto the center of 8 medium-sized plates. Place a salmon cake atop the sauce in the center of each plate. Serve immediately."
    ],
    "ingredients": [
        "2 cans (7 1/2 ounces each) salmon, drained",
        "1/2 cup finely diced onion",
        "1/2 cup finely diced celery",
        "1/2 cup corn kernels, canned or frozen (thawed, if frozen)",
        "Salt and freshly ground black pepper, to taste",
        "1/2 cup mayonnaise",
        "1 tablespoon Dijon mustard",
        "1 teaspoon drained pickle relish",
        "1 teaspoon fresh lemon juice",
        "1/2 teaspoon Worcestershire sauce",
        "1/4 teaspoon paprika",
        "2 dashes Tabasco sauce",
        "1 egg",
        "1 1/2 cups crushed cracker crumbs (preferably saltines)",
        "2 tablespoons unsalted butter",
        "2 tablespoons corn oil",
        "Light Lemon Yogurt Sauce , for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mustard",
        "Onion",
        "Appetizer",
        "Sauté",
        "Mayonnaise",
        "Salmon",
        "Spice",
        "Celery",
        "Corn",
        "Spring",
        "Parade"
    ],
    "title": "Deviled Salmon Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/deviled-salmon-cakes-107546"
}
