{
    "directions": [
        "Preheat oven to 375°F.",
        "On a lightly floured surface with a floured rolling pin roll out dough into a 14-inch round (about 1/8 inch thick) and fit into an 11-inch round tart pan with a removable fluted rim. Roll rolling pin over top of shell to trim dough flush with rim and lightly press dough up side of pan. With a fork prick bottom and side of shell all over. Chill shell 30 minutes, or until firm.",
        "Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven 25 minutes and carefully remove foil and weights or rice. Bake shell until just pale golden, about 8 minutes more. (Leave oven on.) Shell may be made 8 hours ahead and kept in pan, loosely covered, at room temperature.",
        "Finely chop onion, bell pepper, and celery and in a heavy skillet cook vegetables in butter over moderately low heat, stirring, until bell pepper is softened.",
        "Increase temperature to 425°F.",
        "Pick over crab meat and drain roasted peppers. Finely chop roasted peppers, parsley, and scallion greens, reserving whites for another use. In a large bowl whisk together mayonnaise, Worcestershire sauce, and 1/2 cup fresh bread crumbs and gently stir in onion mixture, crab, roasted peppers, parsley, scallion, cayenne, and salt to taste.",
        "Spoon filling into shell, smoothing top, and sprinkle with remaining bread crumbs. Bake tart in middle of oven until top is golden, 20 to 25 minutes. Serve tart warm or at room temperature."
    ],
    "ingredients": [
        "pastry dough",
        "pie weights or raw rice for weighting shell",
        "1 medium onion",
        "1 medium green bell pepper",
        "2 celery ribs",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 1/2 pounds jumbo lump crab meat",
        "a 7-ounce jar roasted peppers",
        "2/3 cup packed fresh flat-leafed parsley leaves",
        "1 bunch scallions",
        "1/2 cup plus 1 tablespoon mayonnaise",
        "1 1/2 teaspoons Worcestershire sauce",
        "1/2 cup plus 3 tablespoons fine fresh bread crumbs",
        "1/4 teaspoon cayenne"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Bake",
        "Mayonnaise",
        "Crab",
        "Celery",
        "Bell Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Deviled Crab Tart",
    "url": "http://www.epicurious.com/recipes/food/views/deviled-crab-tart-15725"
}
