{
    "directions": [
        "Preheat oven to 450°F.",
        "Remove crabmeat from shell, discarding cartilage, and cut meat into 1/2-inch pieces.",
        "Melt 2 tablespoons butter in a 1 1/2-quart heavy saucepan over moderately low heat, then add flour and cook, whisking, 2 minutes. Add milk in a slow stream, whisking, then add garlic and bring to a boil, whisking. Reduce heat and simmer, whisking, until béchamel is thickened, about 3 minutes. Remove from heat and discard garlic.",
        "Whisk together yolks, Sherry, mustard, nutmeg, cayenne, and salt in a bowl, then add hot béchamel in a slow stream, whisking. Pour mixture into saucepan and cook over very low heat, whisking constantly, until an instant-read thermometer registers 160°F, about 2 minutes. Remove from heat and gently stir in crabmeat and parsley. Divide mixture among 6 (4-ounce) ramekins.",
        "Melt remaining 2 tablespoons butter and cool slightly. Stir together melted butter, bread crumbs, and cheese with a fork, then sprinkle over crab. Put ramekins in a shallow baking pan and bake in upper third of oven until crab is bubbling and crumbs are golden brown, about 5 minutes."
    ],
    "ingredients": [
        "2 lb cooked king crab legs in shell, thawed if frozen and shells split lengthwise",
        "1/2 stick (1/4 cup) unsalted butter",
        "2 tablespoons all-purpose flour",
        "whole milk",
        "1 large garlic clove, lightly crushed",
        "2 large egg yolks",
        "1/3 cup medium-dry Sherry",
        "1/2 teaspoon dry mustard",
        "1/8 teaspoon freshly grated nutmeg",
        "1/8 teaspoon cayenne",
        "1/2 teaspoon salt",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1/4 cup fine dry bread crumbs",
        "1/4 cup finely grated Parmigiano-Reggiano (1/2 oz)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Shellfish",
        "Appetizer",
        "Bake",
        "Quick & Easy",
        "Parmesan",
        "Seafood",
        "Crab",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Deviled Crab with Sherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/deviled-crab-with-sherry-sauce-106250"
}
