{
    "directions": [
        "Melt the butter in a skillet over medium heat. Stir in the onion, and cook until softened and translucent, about 5 minutes. Add the celery and bell pepper; continue cooking until the vegetables are tender, about 5 minutes. Stir in the mustard and cayenne pepper; cook 2 minutes. Scrape the mixture into a mixing bowl and refrigerate until cold.",
        "Stir the mayonnaise into the chilled vegetable mixture along with the soft bread crumbs, 1 tablespoon lemon zest, parsley, and beaten egg. Stir until combined, then gently fold in the crab meat. Season to taste with salt and pepper. Pour the dry bread crumbs into a shallow bowl. Form the crab mixture into 8 cakes, 1/2 inch thick. Press the crab cakes into the bread crumbs one at a time until coated on all sides. Gently shake off excess crumbs, and place the crab cakes onto a plate. Cover with plastic wrap and refrigerate 1 hour to overnight.",
        "Prepare the vinaigrette by whisking 3/4 cup vegetable oil with the zest of 1 lemon, lemon juice, ginger, jalapeno, sugar, and salt. Store in the refrigerator until ready to use.",
        "Heat the frying oil in a large skillet over medium-high heat. While the oil is heating, toss the mixed salad greens with the vinaigrette in a mixing bowl, and divide onto 8 serving plates. Arrange the sliced avocado over the salads, and set aside.",
        "Once the oil is shimmering with heat, fry the crab cakes until golden brown on each side, 2 to 3 minutes per side. Briefly drain on a paper towel-lined plate to rid the cakes of excess grease. Place a crab cake on top of each salad and serve immediately."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/1060653.jpg",
    "ingredients": [
        "Deviled Crab Cakes:",
        "3 tablespoons butter",
        "1 cup finely chopped onion",
        "1/3 cup finely chopped celery",
        "1/4 cup finely chopped red bell pepper",
        "1 tablespoon dry mustard",
        "1/2 teaspoon cayenne pepper",
        "1/3 cup mayonnaise",
        "1/2 cup soft bread crumbs",
        "1 tablespoon lemon zest",
        "1/4 cup chopped fresh parsley",
        "1 egg, lightly beaten",
        "1 pound cooked crabmeat",
        "salt and black pepper to taste",
        "1 cup dry bread crumbs",
        "Ginger-Citrus Vinaigrette:",
        "3/4 cup vegetable oil",
        "lemon, zested",
        "1/4 cup lemon juice",
        "2 tablespoons minced fresh ginger root",
        "1 jalapeno pepper, seeded and minced",
        "1 teaspoon white sugar, or to taste",
        "salt to taste",
        "2 cups vegetable oil for frying",
        "8 cups mixed salad greens",
        "2 avocados - peeled, pitted and sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Deviled Crab Cakes on Mixed Greens with Ginger-Citrus Vinaigrette",
    "url": "http://allrecipes.com/recipe/216766/deviled-crab-cakes-on-mixed-greens-wi/"
}