{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 9-inch cake pans, and dust with 1 tablespoon cocoa.",
        "In a heavy saucepan over low heat, heat 1 cup of stout beer, 1 1/4 cup of unsalted butter, 4 ounces of dark chocolate, and the superfine sugar just until the butter and chocolate have melted; stir to blend mixture, and cool slightly.",
        "Beat the eggs and creme fraiche together in a large mixing bowl; gradually stir in the flour and baking soda. Add the melted chocolate mixture in small additions, stirring to blend. Pour half the batter into each prepared cake pan.",
        "Bake in the preheated oven until the top of the cake bounces back when touched lightly with a finger, about 40 minutes. Cool the cakes on racks.",
        "To make the icing, place 1/2 cup of unsalted butter, 4 ounces of dark chocolate, and 5 tablespoons of stout beer in a heavy saucepan over low heat, and cook, stirring, just until the chocolate has melted; stir to blend mixture.  Remove from heat, and cool slightly.",
        "Sift the confectioners' sugar. In a mixing bowl, blend the cream cheese, 1/3 cup of cocoa powder, and vanilla extract until smooth; gradually beat in 1/2 cup confectioners' sugar. Pour in the cooled chocolate-stout mixture and mix well. Add confectioners' sugar until the icing is your desired consistency, adding more if you like a stiffer icing.",
        "Place a cake on a serving plate, and smooth about one third of the frosting over the cake top. Place the second cake onto the frosted layer, and spread remaining two thirds of the frosting over the top and sides of the cake."
    ],
    "ingredients": [
        "1 tablespoon unsweetened cocoa powder",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 cup Irish stout beer (such as Guinness®)",
        "1 1/4 cups unsalted butter",
        "4 ounces dark chocolate, chopped",
        "2 cups superfine white sugar",
        "2 eggs",
        "1/2 cup creme fraiche",
        "1/2 cup unsalted butter",
        "4 ounces dark chocolate, chopped",
        "5 tablespoons Irish stout beer (such as Guinness®)",
        "4 ounces cream cheese, softened",
        "1/3 cup unsweetened cocoa powder",
        "1 teaspoon vanilla extract",
        "2 1/2 cups confectioners' sugar, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Diana's Guinness® Chocolate Cake with Guinness Chocolate Icing",
    "url": "http://allrecipes.com/recipe/217100/dianas-guinness-chocolate-cake-wi/"
}
