{
    "directions": [
        "Pour 3/4 cup warm water into large bowl; mix in yeast. Let stand until yeast dissolves, about 10 minutes. Mix in oil and salt. Add 2 cups flour. Using rubber spatula, stir until dough forms. Knead in bowl until smooth and elastic, adding more flour by tablespoonfuls if dough is very sticky, about 6 minutes. Transfer dough to oiled bowl; turn to coat. Cover bowl with plastic wrap and towel. Let rise in warm draft-free area until dough is doubled in volume, about 1 1/2 hours.",
        "Combine soy sauce, oil, and wasabi in medium bowl; whisk until blended. Whisk in ginger. Season sauce to taste with pepper.",
        "Position rack in center of oven and preheat to 400°F. Place heavy baking sheet on rack to heat. Gently knead dough to deflate. Divide into 4 equal pieces; shape each into disk. Place on lightly floured surface, cover with towel, and let rest 15 minutes. Roll out each piece to 6-inch diameter round. Cover dough rounds again with towel and let rest 10 minutes.",
        "Roll out 2 dough rounds to 8-inch diameter rounds (dough will be about 1/8 inch thick). Brush each generously with wasabi sauce.",
        "Sprinkle heated baking sheet in oven lightly with flour. Transfer dough rounds to sheet. Bake crusts until golden on top and crisp on bottom, piercing large bubbles with fork if necessary, about 10 minutes Transfer to plates. Repeat with remaining 2 dough rounds.",
        "Brush tuna steak with olive oil; sprinkle with salt and pepper. Heat heavy large nonstick skillet over high heat. Add tuna. Sear until brown outside, but still pink inside, about 5 minutes per side.",
        "Transfer tuna to work surface. Slice thinly. Arrange 1/4 of tuna on each pizza crust. Drizzle each with 1 tablespoon wasabi sauce and sprinkle with chopped green onions. Serve, passing remaining wasabi sauce separately."
    ],
    "ingredients": [
        "3/4 cup warm water (105° to 115°F)",
        "1 package active dry yeast",
        "2 tablespoons olive oil",
        "3/4 teaspoon salt",
        "2 1/4 cups (about) bread flour",
        "1/2 cup soy sauce",
        "1/4 cup olive oil",
        "2 tablespoons puchased prepared wasabi (from sushi counter)",
        "2 teaspoons minced peeled fresh ginger",
        "1 1-inch-thick ahi tuna steak (14 to 16 ounces)",
        "Olive oil",
        "Chopped green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Bake",
        "Wasabi",
        "Seafood",
        "Tuna",
        "Soy Sauce"
    ],
    "title": "Dick Clark's Seared Tuna Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/dick-clarks-seared-tuna-pizza-108264"
}
