{
    "directions": [
        "Preheat oven to 425°F. Mix garlic, 2 Tbsp. dill, 1 Tbsp. lemon zest, 1 Tbsp. lemon juice, 1 Tbsp. oil, 1 1/2 tsp. kosher salt, and pepper in a small bowl with a fork to create a paste. Pat pork tenderloin dry and rub with paste.",
        "Heat 1 Tbsp. oil in a large ovenproof skillet over medium-high. Sear pork, turning occasionally, until golden brown on all sides, 10–12 minutes. Add tomatoes, then transfer to oven and roast until an instant-read thermometer inserted into the thickest part of pork registers 145°F and tomatoes are lightly blistered and softened, about 10 minutes. Transfer pork to a cutting board and let rest at least 5 minutes before slicing.",
        "Meanwhile, whisk remaining 1/4 cup olive oil, 2 Tbsp. lemon juice, and 1 tsp. kosher salt in a medium bowl. Add arugula, farro, peas, feta, and remaining 3 Tbsp. dill and 1 Tbsp. lemon zest; toss well to combine (arugula will wilt slightly when dressed). Gently fold in roasted tomatoes.",
        "Slice pork and transfer to a platter; season with sea salt, if using. Serve with farro salad alongside.",
        "Pork can be marinated 4 hours ahead; keep chilled. Let sit at room temperature 30 minutes before cooking."
    ],
    "ingredients": [
        "2 garlic cloves, finely chopped",
        "5 tablespoons coarsely chopped dill, divided",
        "2 tablespoons finely grated lemon zest, divided",
        "3 tablespoons fresh lemon juice, divided",
        "6 tablespoons olive oil, divided",
        "2 1/2 teaspoons kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper",
        "1 (1 1/2-pound) pork tenderloin",
        "1 pint cherry tomatoes",
        "3 cups (loosely packed) arugula (about 3 ounces)",
        "2 cups cooked whole farro",
        "3/4 cup frozen peas, thawed (about 4 ounces)",
        "1/2 cup (loosely packed) crumbled feta (about 2 ounces)",
        "Flaky sea salt (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Pork Tenderloin",
        "Dinner",
        "Dill",
        "Tomato",
        "Spring",
        "Grains",
        "Pea",
        "30 Days of Groceries",
        "Feta",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Dill-Crusted Pork Tenderloin With Farro, Pea, and Blistered Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/dill-crusted-pork-tenderloin-with-farro-pea-and-blistered-tomato-salad"
}
