{
    "directions": [
        "Season beef with salt and pepper; divide into 4 patties. Form each patty into a thin oval that is slightly larger than a slice of bread you’re using.",
        "Heat 1 Tbsp. oil in a large skillet or griddle, preferably cast iron, over medium-high. Cook onion slices in a single layer, being careful not to let rings separate, until softened and charred, about 4 minutes per side. Transfer to a plate and divide into individual rings.",
        "Add remaining 1 Tbsp. oil to skillet. Working in batches if needed, cook patties, pressing flat with a spatula, until browned but still pink in the center, about 1 1/2 minutes per side. Transfer to a plate.",
        "Wipe out skillet and reduce heat to medium-low. Top each slice of bread with 1 cheese slice, 1 patty, one-quarter of the onions, another slice of cheese, then a second slice of bread. Spread tops of each sandwich with 1 tsp. mayonnaise. Working in batches if needed, cook sandwiches, mayo side down, spreading the top of each sandwich with 1 tsp. mayonnaise, until golden brown, about 3 minutes. Flip and continue to cook until bread is golden brown and cheese is melted, about 3 minutes."
    ],
    "ingredients": [
        "1 pound ground beef chuck (20% fat)",
        "1 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "8 slices rye bread",
        "2 tablespoons vegetable oil, divided",
        "1 large onion, sliced into 1/4\" rounds",
        "8 thin slices cheddar, American, or Swiss cheese",
        "8 teaspoons mayonnaise, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Dinner",
        "Hamburger",
        "Onion",
        "Cheese",
        "Cheddar",
        "Sauté",
        "Lunch",
        "Cook Like a Diner",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Diner-Style Patty Melt",
    "url": "http://www.epicurious.com/recipes/food/views/diner-style-patty-melt"
}
