{
    "directions": [
        "Heat milk in a small saucepan over low until warm to the touch (an instant-read thermometer should register 120°F–130°F). Transfer to a glass measuring cup. Add yeast and whisk to combine. Let sit until yeast starts to foam, 5–10 minutes.",
        "Beat salt and 2 1/2 cups flour in the bowl of a stand mixer fitted with the dough hook on low speed until combined, about 30 seconds.",
        "Add honey and 1/2 cup warm water to milk mixture and mix with a fork to dissolve. Add milk mixture to dry ingredients. Beat on low speed, scraping down sides of bowl if needed, until incorporated. Add 4 Tbsp. softened butter; increase speed to medium-high and continue to beat, adding more flour as needed (1/4–1/2 cup depending on variations), until dough is supple and a little tacky but not sticky, about 10 minutes.",
        "(If you don't have a stand mixer, mix salt and flour in a large bowl, then add milk mixture. Mix with a wooden spoon until dough comes together. Turn out onto a work surface and knead in pieces of butter one at a time. Continue to knead, adding flour as needed, until dough is soft and tacky, about 10 minutes.)",
        "Transfer dough to a large oiled bowl and cover with plastic wrap. Let rise at room temperature until doubled in size, 90–105 minutes.",
        "Turn dough out onto a work surface (don't flour work surface unless dough seems really sticky). Divide dough in half, then continue to divide in half until you get 16 equal pieces (each should weigh about 1.5 oz.). Roll each piece into a ball with your dominant hand (counterclockwise if you're right-handed, clockwise if you're left-handed), keeping outside edge of your hand pressed against work surface and gently pushing base of dough inward. Place rolls a few inches apart on 2 parchment-lined rimmed baking sheets.",
        "Cover loosely with plastic. Let rise at room temperature until puffy and dough springs back slowly when poked gently, filling indentation about halfway, 60–90 minutes.",
        "Arrange racks in upper and lower thirds of oven; preheat oven to 400°F. Score top of each roll with a sharp paring knife or serrated knife. Brush tops with 2 Tbsp. melted butter. Bake rolls, rotating sheets halfway through, until golden brown, about 25 minutes. Let cool slightly before serving.",
        "Shallot-Cheddar:\nAdd 1/4 cup finely chopped shallots and 1/2 cup shredded cheddar cheese to dry ingredients. Sprinkle 1/4 cup shredded cheddar cheese on top after brushing with butter.",
        "Olive-Thyme:\nAdd 1 Tbsp. chopped thyme and 1/2 cup coarsely chopped mixed olives to dry ingredients. Dip tops of rolls in panko (Japanese breadcrumbs) after brushing with butter.",
        "Garlic-Dill:\nAdd 1 Tbsp. finely chopped garlic and 1/4 cup chopped dill to dry ingredients.",
        "Everything Bagel:\nAdd 1/2 cup sunflower seeds to dry ingredients. Mix 1/2 tsp. kosher salt and 1/2 tsp. each of any and all of the following, whatever's in your cupboard: sesame seeds, poppy seeds, granulated onion, granulated garlic, caraway seeds, fennel seeds. Dip rolls in salt-seed mix after brushing with butter.",
        "Black Pepper–Rosemary:\nAdd 1 1/2 tsp. chopped rosemary and 1 1/2 tsp. freshly ground black pepper to dry ingredients. Top rolls with extra black pepper after brushing with butter."
    ],
    "ingredients": [
        "1/2 cup whole milk",
        "1 (1/4-ounce) envelope active dry yeast (about 2 1/4 teaspoons)",
        "2 teaspoons kosher salt",
        "2 1/2 cups all-purpose flour, plus more",
        "1 tablespoon honey",
        "4 tablespoons (1/2 stick) unsalted butter, softened, cut into pieces, plus 2 tablespoons melted",
        "Olive oil (for bowl)",
        "Ingredients for variations (see below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dinner",
        "Christmas",
        "Thanksgiving",
        "Bake",
        "Garlic",
        "Seed",
        "Herb",
        "Shallot",
        "Cheddar"
    ],
    "title": "Dinner Rolls Six Ways",
    "url": "http://www.epicurious.com/recipes/food/views/dinner-rolls-six-ways"
}
