{
    "directions": [
        "Mix paprika, brown sugar, coarse salt, onion powder, black pepper, cinnamon, and cardamom in small bowl for spice rub. Arrange ribs on baking sheet. Sprinkle 3 tablespoons spice rub over each side of each rib rack. Let ribs marinate at room temperature while preparing grill. Fill spray bottle with cherry juice.",
        "Remove top rack from barbecue. Place 1 aluminum pan in center of lower grill rack for drip pan. Light briquettes in chimney; pour onto lower grill rack, arranging around drip pan. Drain wood chips; scatter over coals. Return grill rack to barbecue. (You may need to light additional charcoal in chimney to replenish coals in barbecue.)",
        "Remove top rack from barbecue. Prepare barbecue (medium heat). If using 2-burner grill, light 1 burner. If using 3-burner grill, do not light center burner. Drain wood chips. Stack 2 mini loaf pans (one inside the other); fill with 1 cup wood chips. Stack remaining loaf pans; fill with 1 cup wood chips. Place pans directly on flame (if using 3-burner grill, place both pans on 1 lit side). Place aluminum baking pan over unlit portion of grill. Return top rack to barbecue.",
        "Place ribs on grill rack over drip pan (ribs may extend beyond pan). Cover grill and cook ribs 30 minutes. Uncover grill; rotate ribs for even cooking (do not turn over). Spray ribs with cherry juice. Cover and continue to grill ribs until browned, very tender, and meat begins to shrink away from ends of bones, spraying with cherry juice every 15 minutes, about 1 hour 30 minutes to 1 hour 45 minutes longer.",
        "Brush ribs with Chipotle-Cherry Barbecue Sauce . Turn over; grill over direct heat until slightly charred, about 2 minutes. Transfer to work surface. Cut between bones. Serve with remaining sauce."
    ],
    "ingredients": [
        "3 tablespoons paprika",
        "3 tablespoons golden brown sugar",
        "3 tablespoons coarse kosher salt",
        "1 1/2 tablespoons onion powder",
        "1 1/2 tablespoons ground black pepper",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 teaspoon ground cardamom",
        "2 beef rib racks (6 to 8 pounds total; 8- to 10-inch-long rib bones)",
        "1 1/2 cups cherry juice or apple cider",
        "1 11 3/4 x 8 1/2 x 1 1/4-inch disposable aluminum baking pan (to catch drips)",
        "2 cups hardwood chips, soaked in water 1 hour",
        "4 6 x 3 3/4 x 2-inch disposable mini aluminum loaf pans (for wood chips,if using gas grill)",
        "Chipotle-Cherry Barbecue Sauce",
        "Special equipment: Spray bottle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Cherry",
        "Beef Rib",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cinnamon",
        "Paprika",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Dinosaur Bones with Chipotle-Cherry Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/dinosaur-bones-with-chipotle-cherry-barbecue-sauce-359751"
}
