{
    "directions": [
        "Heat 1 tablespoons oil in a large skillet over medium-high heat. Season chicken livers with salt and pepper and cook until browned on the outside but still pink inside, about 1 1/2 minutes per side.",
        "Transfer to a large plate and let cool. Pulse in a food processor to a coarse paste; set chicken liver paste aside.",
        "Heat remaining 1 tablespoons oil in same skillet over medium-high heat and cook onion, celery, chile, garlic, and ginger, scraping up any browned bits, until vegetables are tender, about 2 minutes.",
        "Add soy sauce, vinegar, hot sauce, crab paste, reserved chicken liver paste, and 1/4 cup water to skillet. Reduce heat to medium and cook, stirring occasionally, until a thick dry paste forms. (You should have about 1/2 cup.)",
        "Heat oil in a large wok or skillet over high heat. Cook eggs, stirring constantly, until fluffy and just set, about 1 minute. Add rice and cook, stirring often, until rice is evenly coated and beginning to brown, about 4 minutes.",
        "Add shrimp and chicken-liver base and stir to coat. Cook, stirring often, until shrimp is cooked through, about 2 minutes.",
        "Remove from heat and stir in jalapeño.",
        "Serve fried rice topped with scallions, Old Bay seasoning, and MSG, if using, and drizzled with chili oil."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil, divided",
        "4 ounces chicken livers, rinsed, patted dry",
        "Kosher salt",
        "freshly ground pepper",
        "1/2 small onion, chopped",
        "1/2 celery stalk, finely chopped",
        "1/2 small poblano chile, with seeds, finely chopped",
        "1 garlic clove, finely chopped",
        "1 tablespoons finely chopped peeled ginger",
        "2 tablespoons soy sauce",
        "1 tablespoons black vinegar",
        "1 tablespoons hot sauce (such as Crystal)",
        "1 tablespoons Thai crab or shrimp paste with bean oil",
        "1/4 cup vegetable oil",
        "3 large eggs, beaten to blend",
        "3 cups cooled cooked jasmine rice (from 1 cup dry)",
        "4 ounces large shrimp (about 6), peeled, deveined, cut into bite-size pieces",
        "1 pickled jalapeno, sliced",
        "2 scallions, thinly sliced",
        "Old Bay seasoning, MSG (optional), and chili oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Shrimp",
        "Pan-Fry",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Dirty Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/dirty-fried-rice-51248620"
}
