{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "To start the sauce: Sauté the onion and garlic in the oil in a heavy-bottomed saucepan set over medium-high heat, until softened, about 3 minutes. Stir in the tomato sauce, brown sugar, apple-cider vinegar, salt, and pepper. Bring to a boil, then reduce the heat, and let simmer for 15 minutes, so all the flavors can build.",
        "Set a large pot of water to boil. Lay each collard leaf out on your work surface, and remove the tough large stem and center vein. Don't cut the whole leaf in half; just cut the toughest part of the stem out in a V-shape. Once the water is boiling, slip the collard leaves in and cook until tender, about 15 minutes. Drain into a colander, and rinse with cold water to help stop the cooking.",
        "While the sauce is simmering, begin the dirty rice filling: Heat the oil in a heavy-bottomed sauté pan set over medium-high heat. Brown the sausage, breaking it up with a wooden spoon. Once the sausage is browned, add the onion, green bell pepper, celery, and garlic, cooking until softened, about 5 minutes more. Stir in the chicken broth, cayenne, cooked rice, and parsley, mixing thoroughly and letting the broth reduce until there is no moisture left in the pan. Taste, and season with salt and pepper.",
        "Lay out each cooked collard leaf and put 1/4 cup of the dirty rice in the center. Fold both the sides into the center, and the top and bottom over the center. Roll up into a cylinder-tightly, like a cigar or a small burrito-and repeat with the remaining leaves. If there happen to be any remaining leaves, you can chop them up and add to the sauce.",
        "Pour a 1/2-inch layer of the sauce into a 13- by-9-inch casserole dish. Arrange the collard rolls, seam sides down, on top of the sauce. Pour the remaining sauce over the stuff ed collards, and cover the pan with foil. Bake in the preheated oven for 40 minutes. Remove from the oven, and serve."
    ],
    "ingredients": [
        "1 large onion, finely chopped",
        "3 cloves garlic, finely chopped",
        "2 tablespoons canola oil",
        "One 28-ounce can plain tomato sauce",
        "1/4 cup light brown sugar",
        "1/4 cup apple-cider vinegar",
        "Kosher salt and freshly ground black pepper",
        "1 large bunch collard greens (about 18 leaves), stalks discarded",
        "1 tablespoon canola oil",
        "1/2 pound pork sweet Italian sausage, removed from casing",
        "1 large onion, finely chopped",
        "1 medium green bell pepper, seeded and finely chopped",
        "2 stalks celery, finely chopped",
        "2 cloves garlic, minced",
        "1 cup chicken broth",
        "1/4 teaspoon cayenne pepper",
        "2 cups cooked long-grain white rice",
        "1/4 cup chopped fresh parsley leaves",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Bake",
        "New Year's Eve",
        "Dinner",
        "Lunch",
        "Sausage",
        "Collard Greens",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Dirty-Rice Collard Green Bundles",
    "url": "http://www.epicurious.com/recipes/food/views/dirty-rice-collard-green-bundles-368672"
}
