{
    "directions": [
        "Chop reserved green bell pepper tops and measure out 1/4 cup.",
        "Bring a pot of water to a boil; cook whole green bell peppers until slightly tender, about 5 minutes. Drain and season inside of bell peppers with a little salt.",
        "Heat a large skillet over medium-high heat. Cook and stir beef, onion, garlic, and reserved 1/4 cup chopped green bell pepper in the hot skillet until ground beef is browned and crumbly, 5 to 7 minutes; drain and discard grease.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Stir canned tomatoes and liquid, rice, 1/2 cup water, Worcestershire sauce, 1 teaspoon salt, hot sauce, and black pepper into ground beef mixture; bring to a boil. Reduce heat, cover skillet with a lid, and simmer until rice is tender, 15 to 18 minutes.",
        "Stir 3/4 the mozzarella cheese and 3/4 the tomato sauce into ground beef-rice mixture. Stuff bell peppers with ground beef-rice mixture; top each with remaining mozzarella cheese and tomato sauce. Arrange stuffed peppers in a baking dish. Cover dish with aluminum foil.",
        "Bake in the preheated oven until cooked through and cheese is melted, 30 to 35 minutes."
    ],
    "ingredients": [
        "6 green bell peppers, tops and seeds removed (reserve tops)",
        "salt to taste",
        "1 pound ground beef",
        "1/2 cup chopped onion",
        "1 clove garlic, minced",
        "1 (16 ounce) can tomatoes, chopped and liquid reserved",
        "1/2 cup long-grain white rice",
        "1/2 cup water",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon salt",
        "1 dash hot pepper sauce (such as Tabasco®) (optional)",
        "1 pinch ground black pepper",
        "1 cup shredded mozzarella cheese, divided",
        "1 (8 ounce) can tomato sauce, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Di's Stuffed Green Peppers",
    "url": "http://allrecipes.com/recipe/235323/dis-stuffed-green-peppers/"
}
