{
    "directions": [
        "Pulse onion, carrot, celery, whole garlic cloves, parsley, and red pepper flakes in a food processor until finely chopped; transfer to a small bowl and set aside. Wipe out food processor bowl and set aside.",
        "Heat 1/4 cup oil in a large heavy pot over medium heat; add reserved vegetable mixture, season with salt, and cook, stirring often, until golden, 8-10 minutes. Stir tomato paste and 1 cup water in a small bowl to combine; add to pot. Cook, scraping up any browned bits from bottom of pot. Bring to a boil, reduce heat, and simmer until liquid has almost evaporated, 5-8 minutes.",
        "Add chickpeas and 2 cups water to pot and simmer for 15 minutes to let flavors meld. Transfer 1 cup chickpea mixture to food processor; purée until smooth, then stir back into sauce to thicken.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 1/2 cups pasta cooking liquid. Add pasta and 1/2 cup pasta cooking liquid to sauce and stir to coat. Increase heat to medium and continue stirring, adding more pasta cooking liquid as needed, until sauce coats pasta.",
        "Heat remaining 1/4 cup oil in a small saucepan over medium-low heat; add chopped garlic and rosemary and cook until sizzling stops, about 1 minute. Divide pasta among bowls and drizzle with garlic-rosemary oil."
    ],
    "ingredients": [
        "1 medium onion, quartered",
        "1 medium carrot, peeled, cut into 1\" pieces",
        "1 celery stalk, cut into 1\" pieces",
        "6 garlic cloves, 4 whole, 2 chopped",
        "1/2 cup flat-leaf parsley leaves",
        "1/4 teaspoons crushed red pepper flakes",
        "1/2 cup olive oil, divided",
        "Kosher salt",
        "2 tablespoons tomato paste",
        "2 15-ounce cans chickpeas, rinsed",
        "1 pound ditalini or elbow macaroni",
        "1 tablespoon chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pasta",
        "Kid-Friendly",
        "Dinner",
        "Rosemary",
        "Chickpea",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Ditalini with Chickpeas and Garlic-Rosemary Oil",
    "url": "http://www.epicurious.com/recipes/food/views/ditalini-with-chickpeas-and-garlic-rosemary-oil-51143800"
}
