{
    "directions": [
        "Preheat oven to 400 degrees F (205 degrees C).  Have ready two 10-inch cardboard circles. Generously grease a 9-inch springform pan with soft butter, and dust with flour.",
        "Beat the egg whites until frothy, and gradually add 1 cup sugar. Beat just to soft peaks.  In another bowl, beat the yolks with the milk, lemon peel, vanilla, and salt.  Fold this into the egg whites.  Sift the flour over the egg mixture, and fold in.",
        "Spread 1 1/3 cups batter into the prepared pan.  Bake for about 5 to 9 minutes, or until small, brown spots begin to appear on cake.  Remove the cake from the oven, and remove layer from pan with a spatula.  Dust the cake lightly with flour, and place on a rack to cool.  Grease pan again, and repeat this process until all of the batter is used, about 6 times more.  Place the layers between wax paper, and cover with a towel.  Chill layers for a few hours.  Make the Chocolate Buttercream.",
        "Layer the chilled layers on one of the cardboard rounds with the buttercream.  Start with one layer; cover with the buttercream, and then press down with another layer to make a good seal.  Repeat this with the remaining layers, but reserve one layer.  Wrap the cake in plastic, and chill for at least 6 hours along with the remaining buttercream.  Grease the other cardboard round with the shortening, and place the last layer on it.",
        "Place 1 cup sugar into a non-stick skillet over medium heat.  Allow sugar to cook until the edges look melted and brown.  Begin stirring with a wooden spoon.  Cook until the sugar become an amber color, and is smooth.  Carefully pour the caramel over the top of the last layer, and spread to the edges with an oiled knife.  Quickly, using an oiled knife, indent the top of the caramel into 16 wedges.  Allow to cool slightly, and then retouch the indents with the knife again.  Place layer onto a counter top dusted with sugar, and allow the caramel to cool completely.",
        "Place some more buttercream on top of the chilled torte, and top with the caramel round.  Frost the sides with the remaining buttercream.  Chill the torte before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2126&h=1113&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6917114.jpg",
    "ingredients": [
        "9  egg whites",
        "8  egg yolks",
        "1 cup white sugar",
        "¼ cup milk",
        "1 tablespoon lemon zest",
        "1 pinch salt",
        "1 ½ teaspoons vanilla extract",
        "1 ½ cups sifted all-purpose flour",
        "½ tablespoon shortening",
        "1 cup white sugar",
        "1 recipe Chocolate Buttercream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dobos Torte",
    "url": "http://allrecipes.com/recipe/7650/dobos-torte/"
}