{
    "directions": [
        "Moisten large piece of cheesecloth with water; squeeze out excess. Line 1 1/2-quart bowl with cheesecloth. Mix liqueurs and grappa in small bowl. Cut pound cake crosswise into 3/8-inch-thick slices. Cut each slice diagonally in half, forming two triangles. Lay cake triangles in single layer on baking sheet; brush with liqueur mixture. Line bottom and sides of prepared bowl with cake triangles (wet sides facing in) in sunburst pattern. Reserve extra triangles for top.",
        "Stir 2 ounces chocolate in metal bowl set over small saucepan of simmering water until chocolate melts. Cool just to room temperature. Beat cream and powdered sugar in large bowl until firm peaks form. Fold in 3 ounces chopped chocolate and nuts. Spread half of mixture over cake, covering completely and creating well in center. Fold cooled melted chocolate into remaining whipped cream mixture; spoon into center well of filling. Cover filling with remaining cake triangles (wet side down), trimming to fit if necessary. Cover with plastic. Chill at least 5 hours and up to 1 day.",
        "Invert cake onto plate. Remove cloth. Sift cocoa powder over and serve."
    ],
    "ingredients": [
        "2 tablespoons cherry liqueur",
        "2 tablespoons orange liqueur",
        "2 tablespoons grappa or brandy",
        "1 10.75-ounce loaf pound cake",
        "5 ounces semisweet chocolate, chopped",
        "2 cups chilled whipping cream",
        "3/4 cup powdered sugar",
        "3/4 cup blanched slivered almonds, toasted, coarsely chopped",
        "1/2 cup hazelnuts, toasted, husked, coarsely chopped",
        "Unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "No-Cook",
        "Almond",
        "Spirit",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dome Cake Filled with Chocolate and Nut Cream",
    "url": "http://www.epicurious.com/recipes/food/views/dome-cake-filled-with-chocolate-and-nut-cream-103463"
}
