{
    "directions": [
        "Cook longaniza (if using) with 1/2 cup water in a 12-inch heavy skillet, covered, over medium heat, turning occasionally, until browned on all sides and water has evaporated, about 10 minutes. Cut crosswise into 1/2-inch pieces, then transfer to an 8-quart pot.",
        "Cook bacon in skillet over medium heat, stirring occasionally, until crisp, then transfer to pot with a slotted spoon, reserving fat in skillet.",
        "Meanwhile, cut meat from beef shank into 1 1/2-inch pieces, reserving bone. Pat beef, pork, and chicken dry, putting them in separate bowls. Toss meat in each bowl with 1/2 teaspoon salt.",
        "Heat fat in skillet over medium-high heat until hot, then add beef and bone in 1 layer and brown, turning occasionally, about 7 minutes. Transfer to pot with slotted spoon. Brown pork and chicken in separate batches in same manner, transferring to pot.",
        "Add onion, peppers, garlic, and 1/2 teaspoon salt to skillet and sauté until softened. Add 1 cup water and boil, stirring and scraping up brown bits, 1 minute. Transfer vegetable mixture to pot. Add cilantro stems, oregano, 2 teaspoons salt, 1/2 teaspoon pepper, and remaining 3 quarts water to pot and bring to a boil. Skim off any foam, then simmer, partially covered, stirring occasionally, until meat is tender, about 1 1/2 hours.",
        "While meat simmers, cut ends from plantains with a sharp small knife, then cut a lengthwise slit through peel. Beginning at slit, pry off peel, then cut plantains crosswise into 1-inch-thick pieces.",
        "Trim ends from yuca and cut crosswise into 2-inch pieces, then peel, removing waxy brown skin and pinkish layer underneath. Quarter lengthwise and cut out coarse center fiber.",
        "Peel ñame and yautía, then cut into 1 1/2-inch pieces and keep in a bowl of cold water.",
        "Seed and peel calabaza, then cut into 1 1/2-inch pieces.",
        "Add plantain and yuca to tender meat in pot and simmer, partially covered, stirring occasionally, 15 minutes. Drain ñame and yautía and add to pot along with calabaza, then simmer, partially covered, stirring occasionally, 20 minutes. Remove and discard beef and chicken bones.",
        "Add corn and simmer, partially covered, stirring occasionally, until corn is tender and all root vegetables are very tender (yuca should be translucent), 10 to 15 minutes. Sancocho broth should be slightly thickened from root vegetables; thin with additional water if necessary. Stir in juice and reheat, then season with salt and pepper."
    ],
    "ingredients": [
        "1 (10-ounce) package Dominican longaniza sausage (optional)",
        "3 quarts plus 1 1/2 cups water, divided",
        "1/4 pound bacon (4 slices), cut into 1-inch pieces",
        "1 (1-pound) beef shank (1 1/2 inches thick)",
        "1 pound boneless pork shoulder, cut into 1 1/2-inch pieces",
        "4 chicken thighs with skin and bone",
        "1 large onion, chopped",
        "1 Cubanelle or other mild frying pepper, chopped",
        "1 red bell pepper, chopped",
        "2 tablespoons chopped garlic (4 to 5 cloves)",
        "1/2 cup chopped cilantro stems (from 2 bunches)",
        "1 teaspoon dried oregano",
        "1 pound unripe (green) plantains",
        "1 pound yuca",
        "1 pound ñame",
        "1 pound white yautía",
        "1 pound calabaza (Caribbean pumpkin; often sold in large wedges) or butternut squash",
        "2 ears corn, cut into 1 1/2-inch rounds",
        "6 tablespoons fresh Seville orange juice (or 3 tablespoons regular fresh orange juice plus 3 tablespoons fresh lime juice)",
        "Accompaniments: white rice; hot sauce; sliced avocado",
        "N/A hot sauce",
        "N/A avocado",
        "Garnish: chopped cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Pork",
        "Orange",
        "Beef Shank",
        "Bacon",
        "Corn",
        "Squash",
        "Winter",
        "Plantain",
        "Yuca",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Dominican Sancocho",
    "url": "http://www.epicurious.com/recipes/food/views/dominican-sancocho-239991"
}
