{
    "directions": [
        "Bring 4 quarts water to a boil in a large pot; add whole chicken to the boiling water. Crush half the ginger and add to the boiling water. Add crushed green onion white. Boil chicken until 3/4 cooked, about 10 minutes. Remove from pot and cool; reserve chicken broth.",
        "Remove skin from cooled chicken and cut meat from the bones. Cut meat into bite-sized pieces and set aside. Discard skin and bones.",
        "Peel the remaining half ginger piece and slice into 1 1/2-inch slivers. Combine ginger slivers, fresh red chile pepper slivers, dried red chile peppers, and red pepper flakes in a bowl.",
        "Heat a wok or large skillet over high heat; add lard and swirl around until melted. Cook and stir ginger-chile pepper mixture in the hot lard, continuously moving wok, until fragrant, about 30 seconds. Add chicken meat; splash cooking wine around the edges of the chicken. Pour in vinegar and season with salt.",
        "Pour about 1 cup (or more as needed) leftover chicken broth into the chicken mixture; bring to a boil. Reduce heat and simmer until chicken is no longer pink in the center and liquid is mostly evaporated, 5 to 10 minutes.",
        "Whisk cornstarch and 1/4 cup cold water together in a small bowl. Stir cornstarch mixture into chicken mixture; stir to coat chicken. Add 5 green onions and stir to combine. Remove from heat and stir in sesame oil."
    ],
    "ingredients": [
        "4 quarts water",
        "1 (3 pound) whole chicken",
        "2 3/4 inch piece fresh ginger, divided",
        "1 green onion, white part only, crushed",
        "2 fresh red chile peppers, seeded and thinly sliced into 1 1/2-inch slivers",
        "6 dried red chile peppers (optional)",
        "1 teaspoon red pepper flakes",
        "1/2 cup lard",
        "4 teaspoons Shaoxing cooking wine",
        "1/4 cup rice vinegar",
        "salt to taste",
        "1 tablespoon cornstarch",
        "1/4 cup cold water",
        "5 green onions, green parts cut into even slivers",
        "2 teaspoons sesame oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dong'an Chicken",
    "url": "http://allrecipes.com/recipe/231420/dongan-chicken/"
}
