{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 11x17 inch baking pan.",
        "In a large bowl, beat together 1 1/2 cups of margarine with sugar until light and fluffy; beat in the eggs, one at a time,fully incorporating each egg before adding the next. Mix in 1 cup of cocoa powder, the flour, and 1 1/2 teaspoons of salt. Stir in 1 tablespoon of vanilla extract and the chopped walnuts, and scoop the brownie batter into the prepared baking pan.",
        "Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes; set on a rack to cool.",
        "To make the first frosting layer, beat 1/2 cup of margarine until fluffy, add the instant pudding powder and 3 tablespoons milk and mix until smooth. Gradually beat in 2 cups of confectioners' sugar. Spread the frosting on the cooled brownies and set them aside to let the frosting firm up.",
        "For the second frosting layer, mix together 3 tablespoons of melted margarine with 1/2 cup of cocoa powder; stir in 1/3 cups milk and gradually beat in 3 1/2 cups of confectioners' sugar. Add more milk as necessary to make a smooth, spreadable frosting. Spread the second frosting on top of the first."
    ],
    "ingredients": [
        "1 1/2 cups margarine, at room temperature",
        "3 cups white sugar",
        "6 eggs",
        "1 cup unsweetened cocoa powder",
        "2 1/4 cups all-purpose flour",
        "1 tablespoon vanilla extract",
        "1 1/2 teaspoons salt",
        "1 cup chopped walnuts",
        "First frosting layer:",
        "1/2 cup margarine, at room temperature",
        "2 tablespoons instant vanilla pudding mix",
        "3 tablespoons milk",
        "2 cups confectioners' sugar",
        "Second frosting layer:",
        "3 tablespoons margarine, melted",
        "1/2 cup unsweetened cocoa powder",
        "1/3 cup milk, or more as needed",
        "1 1/2 teaspoons vanilla extract",
        "3 1/2 cups confectioners' sugar",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Double-Frosted Brownies",
    "url": "http://allrecipes.com/recipe/156158/double-frosted-brownies/"
}
