{
    "directions": [
        "In a bowl, lightly whisk together the cream, confectioners’ sugar and vanilla. Pour into a cream whipper and refrigerate until ready to use.",
        "Preheat an oven to 350ºF (180°C). Line a 12-well muffin pan with paper liners.",
        "In the bowl of an electric mixer fitted with the flat beater, beat the butter on medium speed until light and fluffy, about 2 minutes. Stop the mixer and scrape down the sides of the bowl. Add the cupcake mix and beat on low speed until combined, about 1 minute. Increase the speed to medium-low and add the eggs one at a time, beating until incorporated. Slowly add the milk, stopping the mixer occasionally to scrape down the sides of the bowl. Increase the speed to medium and beat until the batter is smooth, about 1 minute more.",
        "Divide the batter evenly among the prepared muffin cups, filling each about two-thirds full. Bake until a toothpick inserted into the center of the cupcakes comes out clean, 18 to 20 minutes. Transfer the pan to a wire rack and let cool for 5 minutes, then transfer the cupcakes to the rack and let cool completely.",
        "When the cupcakes are cool, using a paring knife or a small scoop, cut a small hole in the top center of each cupcake, about 1 inch (2.5 cm) in diameter. Spoon 1 Tbs. lemon curd into each hole and smooth gently. Using the cream whipper, pipe whipped cream on top of each cupcake. Serve immediately. Makes 12 cupcakes.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 cups (16 fl. oz./500 ml) heavy cream",
        "1/4 cup (1 oz./30 g) confectioners’ sugar",
        "1 tsp. vanilla extract",
        "8 Tbs. (1 stick) (4 oz./125 g) unsalted butter, at room\n  temperature",
        "1 package Meyer lemon cupcake mix",
        "2 eggs, at room temperature",
        "1/2 cup (4 fl. oz./125 ml) milk, at room temperature",
        "3/4 cup (6 fl. oz./180 ml) Meyer lemon curd"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Double Lemon Cupcakes with Whipped Cream",
    "url": "http://www.williams-sonoma.com/recipe/double-lemon-cupcakes-with-cream.html"
}
