{
    "directions": [
        "Line a 9x13-inch cake or jelly roll pan with aluminum foil; coat with cooking spray.",
        "Melt butter in a medium saucepan over medium heat; stir in condensed milk. Pour in chocolate chips; cook and stir until melted, 5 to 10 minutes.",
        "Pour chocolate mixture into the prepared pan. Coat a spatula with cooking spray and use to press chocolate mixture into an even layer. Refrigerate fudge until cooled and set, about 2 hours.",
        "Combine 1/2 cup cold water and gelatin in a bowl; set aside until gelatin starts to thicken, about 15 minutes.",
        "Mix white sugar and 1/2 cup water in a saucepan over medium heat; cook and stir until sugar dissolves, 5 to 8 minutes. Bring sugar mixture to a boil and cook until temperature reaches 240 degrees F (116 degrees C) on a candy thermometer, 2 to 3 minutes. Remove from heat.",
        "Slowly pour sugar mixture into gelatin mixture while simultaneously beating with an electric mixer set on low. Gradually increase speed to high and continue beating until marshmallow batter is very thick but not stiff, 10 to 15 minutes.",
        "Pour marshmallow batter over fudge, smoothing the surface with spatula coated with cooking spray. Let sit uncovered at room temperature until completely set, about 6 hours.",
        "Dust the top of marshmallow layer with most of the confectioners' sugar. Refrigerate marshmallow fudge for at least 2 hours.",
        "Lift marshmallow fudge out of the pan by the edges of the foil and place on a large cutting board. Dip a large knife in the remaining confectioners' sugar and slice fudge into 1 1/2-inch squares, continually dipping knife in the sugar after each slice."
    ],
    "ingredients": [
        "cooking spray",
        "1/4 cup butter",
        "1 (14 ounce) can sweetened condensed milk",
        "3 cups semisweet chocolate chips",
        "1/2 cup cold water",
        "3 (.25 ounce) packages unflavored gelatin",
        "2 cups white sugar",
        "1/2 cup water",
        "1 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Double-Decker Marshmallow Fudge",
    "url": "http://allrecipes.com/recipe/256065/double-decker-marshmallow-fudge/"
}
