{
    "directions": [
        "Cover maíz trillado with water by 2 inches in a medium pot. Bring to a boil, then boil 1 minute. Remove from heat and cover, then soak 1 hour. Drain, discarding water.",
        "Return soaked corn to pot and add 8 cups fresh water and 1/2 teaspoon salt. Simmer, partially covered, until tender, about 1 hour. (Do not drain.)",
        "While corn is simmering, cook bacon in a large heavy pot over medium-high heat, stirring occasionally, until crisp. Transfer bacon with a slotted spoon to paper towels to drain.",
        "Add oil and onion to bacon fat and cook over medium heat, stirring occasionally, until onion is softened, about 10 minutes. Add garlic, bell pepper, and cumin and cook, stirring occasionally, until pepper is softened, about 8 minutes.",
        "Add cooked dried corn with its cooking liquid, remaining 3 cups water, and 1 teaspoon salt, then simmer 15 minutes. Stir in fresh (or frozen) corn and simmer until just tender, about 6 minutes.",
        "Transfer 2 cups chowder to a blender, then add chipotle and purée (use caution when blending hot liquids). Stir purée into chowder with cream and bacon and bring just to a simmer (do not let boil). Season with salt and pepper and serve sprinkled with cilantro."
    ],
    "ingredients": [
        "1/2 pound maíz trillado (dried cracked yellow hominy corn; 1 1/3 cups), picked over and rinsed",
        "11 cups water, divided",
        "4 bacon slices, chopped",
        "2 tablespoons olive oil",
        "1 large white onion, chopped",
        "2 large garlic cloves, finely chopped",
        "1 large red bell pepper, chopped",
        "3/4 teaspoon ground cumin",
        "3 cups fresh or frozen corn",
        "1 medium or large canned chipotle chile in adobo",
        "1 cup heavy cream",
        "1/2 cup chopped cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Onion",
        "Pepper",
        "Bacon",
        "Corn",
        "Winter",
        "Cilantro",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Gourmet"
    ],
    "title": "Double-Corn Chowder with Chipotle and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/double-corn-chowder-with-chipotle-and-bacon-239697"
}
