{
    "directions": [
        "For the doughnuts: Position an oven rack in the center of the oven and preheat to 350 degrees F.",
        "Spray a doughnut pan lightly with nonstick spray. In a medium bowl, combine the flax meal and 2 tablespoons water, and let stand for 2 minutes to thicken. Add the almond milk, grapeseed oil, agave and vanilla, and whisk to combine.",
        "In another medium bowl, combine the cake flour, cocoa powder, baking powder, baking soda and salt, and whisk to incorporate. Add the flour mixture to the almond milk mixture and whisk together until the dry and wet ingredients are well combined. Stir in the chocolate chips with a spoon or spatula. Use a small cookie scoop or spoon to drop 2 to 3 heaping tablespoons of the batter into each doughnut mold, filling the molds two-thirds full.",
        "Bake the doughnuts until puffed and a toothpick inserted into the center comes out clean, 10 to 12 minutes. Allow to cool slightly while you make the glaze.",
        "For the chocolate glaze: Melt the chocolate chips in a microwave in 30-second intervals or over a double boiler. Stir in the grapeseed oil until the chocolate is smooth. Dip each doughnut, top-side down, into the glaze; allow excess glaze to drip off, then decorate with sprinkles.",
        "Chill the doughnuts in the refrigerator for 30 minutes to allow the glaze to set."
    ],
    "ingredients": [
        "Nonstick spray",
        "1 tablespoon ground flax meal",
        "1/2 cup almond milk",
        "1/4 cup grapeseed oil",
        "1/3 cup agave syrup",
        "1 teaspoon pure vanilla extract",
        "1 cup cake flour",
        "1/4 cup unsweeteend cocoa powder",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon fine salt",
        "1/3 cup vegan mini chocolate chips",
        "1/2 cup vegan mini chocolate chips",
        "1 tablespoon grapeseed oil",
        "Sprinkles, for decorating"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Doughnut Recipes",
        "Chocolate"
    ],
    "title": "Double-Chocolate Glazed Doughnuts",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/double-chocolate-glazed-doughnuts"
}
