{
    "directions": [
        "Combine the white sugar and the warm water in a large bowl or in the work bowl of a stand mixer. Sprinkle the yeast over the warm sugar water, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam.  Stir 1 tablespoon olive oil into the yeast mixture.",
        "Stir 1/2 teaspoon salt into the flour.  Mix half of the flour mixture into the yeast water, and stir until no dry spots remain. Stir in the remaining flour, a 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes (or mix with dough hook in stand mixer).",
        "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a light cloth, and let rise in a warm place until doubled in volume, about 1 hour.",
        "Combine the crushed tomatoes, brown sugar, garlic powder, 1 teaspoon olive oil, and salt in small saucepan.  Cover pan, and cook over low heat until tomatoes start to break down, about 30 minutes.",
        "Preheat an oven to 450 degrees F (230 degrees C). Deflate the dough and turn it out onto a lightly floured surface. Cut the dough into 2 equal pieces.  Roll one piece into a 12 inch thin circle.  Roll the other half into a thicker, 9 inch circle.",
        "Place the 12 inch dough round into an ungreased 9 inch springform pan.  Sprinkle dough with 1 cup of cheese.  Shape sausage into a 9 inch patty and place in pan on top of the cheese.  Layer pepperoni, mushrooms, green pepper, red pepper, and remaining cheese on top of sausage patty.  Top with the 9 inch dough round and pinch edges to seal.  Cut several 1/2 inch vent holes in the top crust.  Spread sauce evenly on the top crust, leaving a 1/2 inch border at the edges.",
        "Bake pizza in the preheated oven until the crust is set, the cheese is melted, and the sausage is cooked through, 40 to 45 minutes.  Let hot pizza rest for 15 minutes before cutting into wedges and serving."
    ],
    "ingredients": [
        "1 1/2 teaspoons white sugar",
        "1 cup warm water (100 degrees F/40 degrees C)",
        "1 1/2 teaspoons active dry yeast",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt",
        "2 cups all-purpose flour",
        "1 (8 ounce) can crushed tomatoes",
        "1 tablespoon packed brown sugar",
        "1/2 teaspoon garlic powder",
        "1 teaspoon olive oil",
        "1/2 teaspoon salt",
        "3 cups shredded mozzarella cheese, divided",
        "1/2 pound bulk Italian sausage",
        "1 (4 ounce) package sliced pepperoni",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/2 green bell pepper, chopped",
        "1/2 red bell pepper, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Double Crust Stuffed Pizza",
    "url": "http://allrecipes.com/recipe/184068/double-crust-stuffed-pizza/"
}
