{
    "directions": [
        "Preheat oven to 350° F. Spray two 8-inch round cake pans with cooking spray. In a large bowl, combine the cake mix, eggs, oil, and water and beat with an electric mixer for about 2 minutes, until smooth and creamy.",
        "Using a rubber spatula or spoon, fold the chocolate chips into the cake batter. Divide batter evenly between two cake pans and bake for 30 minutes, or until a toothpick or cake tester placed in the center of the cakes comes out clean. Remove from oven and allow to cool in their pans. When cool, turn one cake out, round side down, on a flat serving platter or cake pedestal covered with two pieces of waxed paper, slightly overlapping in the center. To make flat on top, slice the rounded side off both layers before stacking.",
        "Apply a thin layer of chocolate frosting to the top of the first layer, followed by a layer of raspberry jam. Dot approximately 1/4 cup of fresh raspberries on top of the jam, leaving spaces between berries. Carefully place the second layer of chocolate cake, rounded side up, or if top has been removed, bottom side up, gently aligning the two layers together. With an offset spatula or knife, spread a thin layer of frosting around the sides and top of the cake and add extra frosting until the sides are covered and smooth. Frost the top of the cake until covered and smooth. Finish the top and sides of the cake with the remaining raspberries."
    ],
    "ingredients": [
        "1 box chocolate cake mix",
        "3 eggs",
        "1/2 cup vegetable oil",
        "1/3 cup water",
        "6 ounces semisweet chocolate chips",
        "Chocolate Frosting",
        "1/4 cup raspberry jam",
        "2 fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Egg",
        "Bake",
        "Kid-Friendly",
        "Wedding",
        "Raspberry",
        "Jam or Jelly"
    ],
    "title": "Double Chocolate Raspberry Cake",
    "url": "http://www.epicurious.com/recipes/food/views/double-chocolate-raspberry-cake-234859"
}
