{
    "directions": [
        "Place a rack in middle of oven; preheat to 350°F. Lightly coat cake pans with nonstick spray and line bottoms with parchment paper. Whisk 2 cups flour, 1 tsp. baking powder, 1/2 tsp. baking soda, and 1/4 tsp. salt in a medium bowl; set aside.",
        "Using an electric mixer on medium-high speed, beat 3/4 cup butter and 1 1/2 cups granulated sugar in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 5 minutes. Add 4 egg yolks in 2 additions, scraping down bowl after each. Beat in 1 tsp. vanilla.",
        "Reduce mixer speed to low, then add dry ingredients in 2 additions alternately with 1 cup buttermilk in 2 additions, scraping down sides of bowl as needed.",
        "Using electric mixer on medium speed, beat 4 egg whites in another large bowl until soft peaks form, 2–3 minutes. Slowly add 1/4 cup granulated sugar and continue to beat until stiff, glossy peaks form, about 3 minutes more. Fold half of the egg whites into flour mixture, then gently fold in remaining egg whites.",
        "Scrape batter into prepared pan; smooth surface. Bake, rotating pan halfway through and covering with foil during the last 15 minutes of baking, until golden brown, firm to the touch, and a tester inserted into the center comes out clean, 45–50 minutes. Transfer pan to a wire rack and let cake cool.",
        "Repeat steps with second prepared pan and remaining cake ingredients to bake the second layer.",
        "Combine granulated sugar and 1/4 cup water in a medium saucepan. Scrape in vanilla seeds, add pod, and stir to combine. Bring to a boil, cover, and steep at least 15 minutes. Set aside to cool. Discard pod before using.",
        "Using electric mixer on medium-high speed, beat cream cheese and butter in a large bowl until smooth, about 1 minute. Beat in orange zest, orange juice, and vanilla. Reduce mixer speed to medium and beat in powdered sugar, scraping down bowl as needed, until light and fluffy, 2–3 minutes.",
        "Spread 1 Tbsp. frosting in the center of a platter. Place 1 cake layer, top side down, in the center. Using a pastry brush, brush 3 Tbsp. vanilla syrup over top of cake. Using an offset spatula, spread 1 cup frosting evenly over top. Arrange 6 oz. raspberries in a ring around perimeter of cake, pressing to adhere. Fill interior of ring with 6 oz. raspberries. Spread 1 cup frosting over raspberries inside of ring (do not frost raspberries at the perimeter).",
        "Carefully place second cake layer, top side down, on frosted raspberries, gently pressing down to secure. Brush 3 Tbsp. syrup over top of cake with pastry brush. Spread 2 1/2 cups frosting evenly over top and sides, carefully covering raspberries. Chill at least 30 minutes to let frosting set.",
        "Remove cake from refrigerator. Frost top and sides, swirling decoratively, making sure to cover bottom of platter; reserve remaining frosting for another use. Chill at least 30 minutes or up to overnight to let frosting set. Before serving, top cake with remaining 3 oz. raspberries and edible flowers, if using.",
        "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Syrup can be made 5 days ahead; store in an airtight container and chill. Frosting can be made 3 days ahead; cover with plastic wrap, pressing directly on surface, and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 cups cake flour, divided",
        "2 teaspoons baking powder, divided",
        "1 teaspoon baking soda, divided",
        "1/2 teaspoon kosher salt, divided",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature, divided",
        "3 1/2 cups granulated sugar, divided",
        "8 large eggs, separated",
        "2 teaspoons vanilla extract, divided",
        "2 cups buttermilk, divided",
        "1/4 cup granulated sugar",
        "1 vanilla bean, split lengthwise",
        "4 (8-ounce) packages cream cheese, chilled",
        "1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature",
        "2 teaspoons finely grated orange zest",
        "2 tablespoons fresh orange juice",
        "2 teaspoons vanilla extract",
        "1 1/2 cups powdered sugar, sifted",
        "15 ounces raspberries, divided",
        "Edible flowers (for garnish; optional)",
        "2 (10-inch) round cake pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Birthday",
        "Buttermilk",
        "Cream Cheese",
        "Bake",
        "Dessert",
        "Raspberry",
        "Orange",
        "Wedding",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double-Layer Vanilla-Buttermilk Cake With Raspberries and Orange Cream-Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/double-layer-vanilla-buttermilk-cake-with-raspberries-and-orange-cream-cheese-frosting"
}
