{
    "directions": [
        "Preheat oven to 325° F. and butter and flour a 9-inch springform pan, knocking out excess flour.",
        "In a bowl stir together cherries, 1/4 cup sugar, and kirsch and macerate 15 minutes.",
        "Cut butter into pieces and separate eggs. Coarsely chop bittersweet chocolate and in a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate with butter, stirring occasionally. Remove top of double boiler or bowl from heat and cool mixture slightly. Stir in yolks, flour, and salt until combined well. Gently stir in cherries and chocolate chips until just combined.",
        "In a bowl with an electric mixer beat whites until they hold soft peaks and gradually add remaining 1/2 cup sugar, beating until whites just hold stiff glossy peaks. Stir half of whites into chocolate mixture to lighten and fold in remaining whites gently but thoroughly. Pour batter into pan and smooth top. Bake torte in middle of oven 50 minutes to 1 hour, or until a tester comes out with crumbs adhering.",
        "Cool torte in pan on a rack (top will fall slightly and crack). Run a thin knife around edge of torte and remove side of pan. Torte may be made 1 day ahead and kept, loosely covered with plastic wrap, at cool room temperature.",
        "Serve torte with whipped cream."
    ],
    "ingredients": [
        "1 1/2 cups pitted picked-over fresh tart cherries, halved (about 1 pint)",
        "3/4 cup sugar",
        "1 tablespoon kirsch",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3 large eggs",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup semisweet chocolate chips",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double Chocolate Cherry Torte",
    "url": "http://www.epicurious.com/recipes/food/views/double-chocolate-cherry-torte-14137"
}
