{
    "directions": [
        "Combine dried cherries, tart cherry preserves, and kirsch in processor; blend to chunky puree. (Filling can be made 1 day ahead. Transfer to bowl; cover and refrigerate.)",
        "Preheat oven to 375°F. Line 13x9x2-inch metal baking pan with heavy-duty foil, leaving overhang. Spray foil with nonstick spray. Combine flour, sugar, cinnamon, and salt in processor; blend 5 seconds. Add butter, vanilla extract, and almond extract. Blend, using on/off turns, until mixture resembles coarse meal. Add milk and blend, using on/off turns, until mixture comes together in small clumps. Transfer 1 cup (packed) mixture to medium bowl and reserve for streusel. Blend remaining mixture in processor until large moist clumps form. Gather dough together in large ball.",
        "Press dough over bottom of prepared baking pan; pierce all over with fork. Bake dough until golden, about 22 minutes; cool crust 15 minutes. Maintain oven temperature.",
        "Add sweetened coconut flakes and sliced almonds to reserved 1 cup dough. Mix dough with fork, breaking streusel topping into small clumps.",
        "Spread cherry filling over baked crust. Sprinkle streusel topping over. Bake cookie until cherry filling is bubbling and streusel topping is golden brown, about 30 minutes. Cool cookie in pan on rack. Using foil overhang as aid, lift cookie from pan. Peel off foil and discard. Cut cookie lengthwise into thirds, then cut crosswise into eighths, forming total of 24 bars. (Bars can be made 2 days ahead. Store bars in airtight container and refrigerate.)"
    ],
    "ingredients": [
        "1 cup dried Bing (sweet) cherries (about 6 ounces)",
        "1 cup tart red cherry preserves (such as Tropical or Smuckers; about 11 ounces)",
        "1 tablespoon kirsch (clear cherry brandy)",
        "Nonstick vegetable oil spray",
        "2 cups all purpose flour",
        "2/3 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 3/4 teaspoons vanilla extract",
        "1/4 teaspoon almond extract",
        "3 tablespoons whole milk",
        "1 cup (packed) sweetened flaked coconut (about 3 ounces)",
        "3/4 cup sliced almonds (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Christmas",
        "Cherry",
        "Coconut",
        "Almond",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double-Cherry Streusel Bars",
    "url": "http://www.epicurious.com/recipes/food/views/double-cherry-streusel-bars-107525"
}
