{
    "directions": [
        "Blend together 2 1/2 cups flour, 1 1/2 sticks butter, 1/4 cup shortening, and 1/2 teaspoon salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle evenly with 5 tablespoons ice water and gently stir with a fork (or pulse) until incorporated.",
        "Squeeze a small handful: If it doesn't hold together, add more ice water to dough, 1 tablespoon at a time, stirring (or pulsing) until just combined. (Do not overwork mixture, or pastry will be tough.)",
        "Turn out dough onto a work surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all of dough together with scraper and press into 2 balls, then flatten each into a 5-inch disk. Make 2 more disks in same manner with remaining 2 1/2 cups flour, 1 1/2 sticks butter, 1/4 cup shortening, and 1/2 teaspoon salt. Chill dough, each disk wrapped tightly in plastic wrap, until firm, at least 1 hour.",
        "Cut nectarines into 1/2-inch-wide wedges, then toss with raspberries and lemon juice in a large bowl.",
        "Grind tapioca to a powder in grinder, then whisk together with cornstarch, salt, and sugar in a small bowl (do not toss with fruit until dough is rolled out).",
        "Put oven rack in lower third of oven and put a large sheet of foil on rack. Preheat oven to 425°F.",
        "Roll out 2 disks of dough, 1 at a time (keep remaining disks chilled), on a lightly floured surface with a lightly floured rolling pin, into 13-inch rounds, then fit into pie plates (do not trim) and chill until ready to use.",
        "Roll out remaining 2 disks (for top crusts) in same manner and set aside (keep flat).",
        "Gently toss sugar mixture with fruit and divide between pie shells.",
        "Cover pies with pastry rounds and trim edges with kitchen shears, leaving a 1/2-inch overhang. Press edges together, then crimp decoratively. Brush pastry tops with milk and sprinkle all over with sugar (2 tablespoons total). Cut several steam vents in top of each pie with a small sharp knife.",
        "Bake pies on foil 20 minutes. Reduce oven temperature to 375°F and continue to bake, checking frequently and covering edge of each pie with a strip of foil or pie shield if crusts are browning too fast, until crusts are golden brown and filling is bubbling, about 40 minutes more.",
        "Cool pies to room temperature on racks, at least 2 hours."
    ],
    "ingredients": [
        "5 cups all-purpose flour",
        "3 sticks (1 1/2 cups) cold unsalted butter, cut into 1/2-inch cubes but left in sticks",
        "1/2 cup cold vegetable shortening (preferably trans-fat-free)",
        "1 teaspoon salt",
        "About 3/4 cup ice water",
        "1 tablespoon milk",
        "2 tablespoons sugar",
        "6 lb nectarines",
        "3 cups raspberries (3/4 pound)",
        "3 tablespoons fresh lemon juice",
        "1/4 cup quick-cooking tapioca",
        "1/4 cup cornstarch",
        "1/4 teaspoon salt",
        "1 1/2 cups sugar",
        "Special equipment: a pastry or bench scraper; an electric coffee/spice grinder; 2 (9-inch) glass or metal pie plates (5-cup capacity)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Raspberry",
        "Nectarine",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double-Crust Nectarine Raspberry Pies",
    "url": "http://www.epicurious.com/recipes/food/views/double-crust-nectarine-raspberry-pies-235039"
}
