{
    "directions": [
        "Pulse oil, sage, thyme, salt, and pepper in a small food processor or finely chop on a work surface to form a paste.",
        "Place roasts, bone side down, on a work surface. Using a small knife, score fat 1/4\" deep with six 3\"-long diagonal slices. Rub roasts with herb paste, massaging some into each slit. Let rest at room temperature for 2 hours.",
        "Meanwhile, using a vegetable peeler, remove zest (orange part only) from 1 orange in 3\"-long strips. Using a knife, cut zest crosswise into 1/8\"-wide strips; set aside. Cut peel and white pith from remaining oranges. Slice all oranges into 1/4\"-thick rounds; transfer to a large roasting pan.",
        "Place orange zest strips in a small saucepan. Cover with water; bring to a boil and simmer for 3 minutes. Strain zest; set aside for sauce and discard liquid in pan.",
        "Arrange a rack in lower third of oven and preheat to 425°F. Place pork roasts in roasting pan over orange rounds so that roasts face each other and the rib bones interlock. Wrap bone tips in foil to prevent burning. Roast until meat is golden brown, about 45 minutes. Reduce heat to 350°F and roast until an instant-read thermometer inserted into center of roast registers 135°F, about 25 minutes longer. Transfer pork to a carving board and tent loosely with foil. Let rest for 20 minutes.",
        "Meanwhile, stir sugar and 1/4 cup lemon juice in a small heavy saucepan over medium heat until sugar dissolves. Increase heat to medium-high and cook without stirring, occasionally swirling pan and brushing down sides with a wet pastry brush, until caramel is deep amber, about 8 minutes. Remove pan from heat; gradually whisk in orange juice and bourbon. Set pan over medium heat and simmer for 5 minutes. Stir in reserved orange zest, broth, and marmalade. Boil until reduced to 2 cups, about 15 minutes. Set caramel sauce aside.",
        "Whisk cornstarch and 2 tablespoons water in a small bowl; set aside. Transfer orange slices from roasting pan to a warm platter. Spoon off and discard fat from drippings in pan. Place roasting pan over 2 burners set at medium heat. Pour in reserved caramel sauce; set saucepan aside. Using a wooden spoon, scrape up any browned bits from bottom of roasting pan. Boil for 30 seconds, then return sauce to reserved saucepan. Stir in liqueur. Bring sauce to a boil; whisk in cornstarch mixture. Boil, stirring constantly, for 2 minutes. Season sauce to taste with salt, pepper, and more lemon juice, if desired.",
        "Slice roasts between rib bones to make individual chops. Arrange chops on top of orange slices on platter. Serve with burnt orange-caramel sauce."
    ],
    "ingredients": [
        "4 1/2 tablespoons olive oil",
        "3 tablespoons chopped fresh sage",
        "3 tablespoons chopped fresh thyme",
        "2 1/2 tablespoons kosher salt",
        "1 1/2 tablespoons freshly ground black pepper",
        "2 6-bone racks of pork (about 8 pounds total), chine bone removed, fat trimmed to 1/4\" thickness, rib bones frenched",
        "4 large oranges",
        "1/2 cup sugar",
        "1/4 cup (or more) fresh lemon juice",
        "1 cup fresh orange juice",
        "1/4 cup bourbon",
        "2 cups low-salt chicken broth",
        "2 tablespoons orange marmalade",
        "2 teaspoons cornstarch",
        "2 tablespoons orange liqueur (such as Cointreau or Grand Marnier)",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Christmas",
        "Dinner",
        "Orange",
        "Pork Rib",
        "Winter",
        "Christmas Eve",
        "Orange Juice",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Double Rack of Pork with Burnt Orange-Caramel Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/double-rack-of-pork-with-burnt-orange-caramel-pan-sauce-368932"
}
