{
    "directions": [
        "Coat springform pans with nonstick spray and line bottoms with parchment paper.",
        "On a lightly floured surface, roll one large disc of dough to a 15\" round; keep remaining dough chilled. Roll dough loosely around rolling pin, then unfurl it into one of the prepared pans. Gently lift and settle dough into bottom and up sides of pan. Trim any excess dough with scissors, leaving a 1/4\" overhang, and transfer to refrigerator. Repeat with second large disc of dough and remaining pan. Chill at least 30 minutes.",
        "On a lightly floured piece of parchment, roll out smaller discs of dough to 12\" rounds. Transfer on parchment to a rimmed baking sheet. Chill at least 30 minutes.",
        "Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until fragrant and slightly darkened, about 8 minutes. Let cool slightly, then coarsely chop.",
        "Mix walnuts, cherries, raspberries, granulated sugar, cornstarch, vanilla, and salt in a large bowl until well combined.",
        "Blend granulated sugar and cocoa powder in a food processor until smooth, about 1 minute. Add eggs, butter, evaporated milk, and salt; process until well combined, another 1–2 minutes.",
        "Whisk egg and milk in a small bowl; set aside. Remove springform pans from refrigerator. Fill one crust with cherry-raspberry filling and the other with chocolate filling. Let thaw 5 minutes.",
        "Brush edges of pie with egg wash, reserving any excess. Carefully top one pie with one smaller dough round, pulling it taught across the top and pressing the top and bottom crusts together to seal. Trim top crust to leave a 1/8” overhang, pinching excess dough together to seal. Repeat with second pie.",
        "Brush top of cherry-raspberry pie with remaining egg wash. Using a sharp knife, cut several thin vents on surface of both pies. Chill 30 minutes.",
        "Preheat oven to 400°F. Cover 2 rimmed baking sheets with foil. Transfer pies to sheets and bake until crusts are light golden, about 25 minutes. Rotate trays in oven, reduce temperature to 350°F, and bake until crusts are deep golden brown, 25 minutes more; cover crusts with foil or a pie shield if they begin to darken too much. Carefully transfer pies to a wire rack and let cool 30 minutes. Transfer pies to refrigerator and chill at least 4 hours or up to overnight.",
        "Beat egg whites and powdered sugar on medium-high speed in the bowl of a stand mixer fitted with the whisk attachment until white, thickened, and tripled in volume, about 5 minutes.",
        "Transfer one-third of the icing to a medium bowl. Whip with a spatula, adding water by the teaspoonful, until icing no longer holds a peak but folds back on itself. Fit pastry bag with circle tip, then transfer Royal Icing to bag.",
        "Add cream to remaining icing and continue whipping on medium-high speed until thick, about 5 minutes. Chill both icings at least 5 minutes.",
        "Carefully remove pies from springform pans, trimming top edges of chocolate pie crust with a serrated knife to flatten if needed. Place chocolate pie on a cake stand or pie plate and pipe a thick ring of Royal Icing along top edge of pie. Pour cream-icing mixture into the center and evenly spread with the back of a spoon. Place cherry-raspberry pie on top and decorate with remaining Royal Icing. Chill at least 2 hours.",
        "To serve, bring pie to room temperature for 15 minutes, then slice with serrated knife.",
        "Pies can be baked 3 days ahead; loosely cover with foil and chill."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "All-purpose flour (for dusting)",
        "2 batches Our Favorite Pie Dough, divided into 4 discs, 2 slightly larger and 2 slightly smaller, chilled",
        "1 cup walnuts",
        "1 1/2 pounds dark sweet cherries (about 4 cups)",
        "1 1/2 pounds raspberries (about 4 cups)",
        "1 cup granulated sugar",
        "1/2 cup cornstarch",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon kosher salt",
        "3 cups granulated sugar",
        "3/4 cup high-quality cocoa powder",
        "6 large eggs",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "16 ounces evaporated milk",
        "1/4 teaspoon kosher salt",
        "1 large egg",
        "1 tablespoon whole milk",
        "2 large egg whites",
        "3 1/2 cups powdered sugar",
        "1/2 cup heavy cream",
        "2 (8”) springform pans; a pastry bag; a small circle tip"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Double-Decker Chocolate and Cherry-Raspberry Birthday Pie",
    "url": "http://www.epicurious.com/recipes/food/views/double-decker-chocolate-and-cherry-raspberry-birthday-pie"
}
