{
    "directions": [
        "Preheat oven to 325°F. Butter 10-inch-diameter springform pan; dust with sugar. Melt chocolate and butter in heavy large saucepan over low heat, stirring constantly. Cool to lukewarm. Whisk in sugar. Whisk in eggs 1 at a time, blending well after each addition. Mix in vanilla and salt, then flour. Pour batter into pan. Bake until cake just rises in center (tester inserted into center will not come out clean), about 35 minutes. Cool completely in pan on rack. Cover; chill while making mousse.",
        "Melt butter in medium metal bowl set over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk yolks, 1/4 cup cream and vanilla in small bowl to blend. Gradually whisk yolk mixture into bowl with melted butter. Whisk constantly over simmering water until thermometer registers 150°F, about 6 minutes (mixture may appear broken). Remove from over water; add chocolate and stir to melt. Set aside. Beat egg whites and 1/2 cup sugar in large bowl to medium-stiff peaks. Whisk 1/4 of beaten egg white mixture into warm chocolate mixture to lighten. Fold in remaining egg white mixture. Pour mousse over cake in pan; smooth top. Chill torte until mousse is set, at least 6 hours and up to 1 day.",
        "Run sharp knife around edge of pan to loosen torte. Release pan sides. Transfer torte to platter. Using electric mixer, beat 3/4 cup cream in medium bowl until peaks form. Spread whipped cream over torte. Top whipped cream with raspberries. Brush red currant jelly mixture over raspberries. Sprinkle with 1 1/2 teaspoons sugar. Garnish with currants, if desired."
    ],
    "ingredients": [
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 cup unsalted butter",
        "1 cup sugar",
        "5 large eggs",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon salt",
        "1/4 cup all purpose flour",
        "1/2 cup unsalted butter, cut into pieces",
        "4 large eggs, separated",
        "1 cup whipping cream",
        "1 tablespoon vanilla extract",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/2 cup plus 1 1/2 teaspoons sugar",
        "2 cups fresh raspberries",
        "2 tablespoons red currant jelly melted with 1 tablespoon water",
        "Red currant bunches (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Raspberry",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double Chocolate Torte",
    "url": "http://www.epicurious.com/recipes/food/views/double-chocolate-torte-104512"
}
