{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Halve the squash lengthwise, scoop out the seeds and drizzle with EVOO. Sprinkle with salt, pepper and fresh nutmeg and roast until just tender, 30 to 35 minutes. Remove from the oven and let cool slightly.",
        "While the squash is in the oven, place a small skillet over medium-high heat and melt the butter. Add the sage leaves to the skillet, gently stirring them around for a few minutes, until they are crispy and a deep green color. Remove the skillet from the heat, set the crispy leaves aside on a paper towel and reserve the brown butter.",
        "Carefully scoop the flesh of the squash into a bowl keeping the skins intact. Mash with the chicken stock, 1 cup of the Cheddar, 1 cup of the Parm, all of the ricotta, the reserved brown butter, and then adjust seasonings. Stuff the squash shells with the mashed squash mixture, top with a sprinkle of the remaining Cheddar and Parm and bake until the cheese is melted and golden brown on top.",
        "Remove from the oven and garnish with the fried sage leaves, lightly crushing them in your hand as you sprinkle over the top.",
        "You may serve a whole half as a meal, or cut each half in halves or thirds and serve as a side."
    ],
    "ingredients": [
        "2 butternut squash",
        "EVOO, for drizzling",
        "Salt and freshly ground black pepper",
        "Freshly grated nutmeg",
        "4 tablespoons butter",
        "10 to 12 fresh whole sage leaves",
        "1/4 to 1/2 cup chicken stock",
        "1 1/2 cups shredded sharp yellow Cheddar",
        "1 1/2 cups shredded Parmigiano-Reggiano",
        "1 cup ricotta cheese (fresh cow or sheep's milk)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Thanksgiving Side Dishes",
        "Holiday",
        "Thanksgiving",
        "Butternut Squash",
        "Vegetable",
        "Cheese",
        "Roasting"
    ],
    "title": "Double Stuffed Butternut Squash",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/double-stuffed-butternut-squash-recipe"
}
