{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet, or line with parchment paper.",
        "Combine the flour, salt, cocoa powder, baking powder, cinnamon, and coffee granules in a bowl. Set aside. Beat the butter and sugar with an electric mixer in a large bowl until smooth. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg.  Mix in the flour mixture until just incorporated. Fold in the chocolate chips and walnuts; mixing just enough to evenly combine. Dived the dough in half and shape each into 8x2 inch flat rectangles about 1 inch thick. Place on the baking sheet 3 to 4 inches apart. Beat egg yolk with water in a small bowl. Brush over the top of each loaf.",
        "Bake in the preheated oven until both loaves are firm, 20 to 25 minutes.  Remove from the oven and cool for 10 to 12 minutes. Reduce oven heat to 300 degrees F (150 degrees C). Cut each loaf diagonally into 3/4 inch slices. Place each slice, cut-side up onto the baking sheet. Return to the oven and bake until the biscotti are dry, 10 to 15 minutes on each side. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Store in an airtight container."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup unsweetened cocoa powder",
        "2 teaspoons baking powder",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon instant coffee granules",
        "1/2 cup butter, softened",
        "3/4 cup white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1/2 cup miniature semisweet chocolate chips",
        "1/2 cup chopped walnuts",
        "1 egg yolk",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Double Chocolate Biscotti",
    "url": "http://allrecipes.com/recipe/203247/double-chocolate-biscotti/"
}
