{
    "directions": [
        "Combine dried peaches and water in heavy medium saucepan. Let stand 30 minutes. Bring to boil. Reduce heat and simmer gently until peaches are very soft, about 20 minutes.",
        "Meanwhile, place 1/4 cup Pêcher Mignon in small bowl; sprinkle gelatin over. Set aside to soften. Beat 3 egg yolks, 1/2 cup sugar and remaining 1/4 cup Pêcher Mignon in top of double boiler until light in color. Set over simmering water and stir until thick enough to coat back of spoon when finger is drawn across (do not boil), about 2 minutes. Transfer to small bowl.",
        "Add gelatin to hot peach mixture and stir until dissolved. Transfer to processor and puree until smooth. Pour into large bowl. Cool to room temperature, stirring occasionally (do not let peach mixture set up.)",
        "Add custard to peach mixture and whisk to combine. Using electric mixer, beat cream in medium bowl to soft peaks. Mix 1/3 of whipped cream into peach mixture to lighten. Gently fold in remaining cream in 2 batches.",
        "Using clean dry beaters, beat egg whites and cream of tartar in another medium bowl until frothy. Gradually add remaining 3 1/2 tablespoons sugar and beat until smooth, glossy and almost stiff but not dry. Fold 1/3 of whites into peach mixture to lighten. Gently fold in remaining whites in 2 batches. Cover bowl with plastic and refrigerate mousse 8 hours or overnight.",
        "Spoon mousse into pastry bag fitted with large star tip. Pipe mousse into goblets or wine glasses. Top mousse with fresh mint sprigs and serve."
    ],
    "ingredients": [
        "1 1/2 cups dried peaches (about 8 ounces)",
        "1 1/2 cups water",
        "1/2 cup Pêcher Mignon or other peach liqueur (do not use peach brandy)",
        "1 tablespoon unflavored gelatin",
        "3 large eggs, separated, room temperature",
        "1/2 cup plus 3 1/2 tablespoons sugar",
        "2 cups chilled whipping cream",
        "Pinch of cream of tartar",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Peach",
        "Chill",
        "Long Beach",
        "California"
    ],
    "title": "Double Peach Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/double-peach-mousse-2017"
}
