{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Brush softened butter generously all over inside of 12-cup Bundt pan. Sprinkle raw sugar over butter in pan, tilting pan to coat completely.",
        "Whisk flour, ground ginger, baking powder, and salt in medium bowl. Using electric mixer, beat 1 cup butter in large bowl until smooth. Add 2 cups sugar; beat on medium-high speed until blended, about 2 minutes. Add eggs 1 at a time, beating well after each addition. Beat in 1 egg yolk and vanilla, stopping to scrape down bowl as needed. Add flour mixture in 3 additions alternately with sour cream in 2 additions, beating on low speed just until blended after each addition. Mix in crystallized ginger. Spread batter in pan, being careful not to dislodge raw sugar.",
        "Bake cake until top is light brown and tester inserted near center comes out with a few small crumbs attached, about 55 minutes. Transfer to rack; cool in pan 15 minutes. Gently tap bottom edge of pan on work surface while rotating pan until cake loosens. Place rack atop pan and invert cake onto rack; remove pan. Cool completely.",
        "Combine first 4 ingredients in small saucepan. Bring to boil over medium-high heat, stirring until sugar dissolves. Boil until mixture is reduced to scant 1 cup, about 4 minutes. Remove from heat; cool ginger syrup to room temperature (do not strain). DO AHEAD: Can be made 2 days ahead. Cover and chill.",
        "Place berries in medium bowl. Strain ginger syrup. Pour over berries and toss. Cover; chill at least 1 hour. DO AHEAD: Can be made 2 hours ahead. Keep chilled. Cut cake into slices and place on plates. Spoon berries with syrup alongside. Sprinkle with mint, if desired, and serve.",
        "Also called turbinado or demerara sugar; available at most supermarkets and at natural foods stores."
    ],
    "ingredients": [
        "Softened butter (for brushing pan)",
        "1/2 cup raw sugar*",
        "2 1/4 cups all purpose flour",
        "4 teaspoons ground ginger",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 cups sugar",
        "4 large eggs",
        "1 large egg yolk",
        "2 teaspoons vanilla extract",
        "1 cup sour cream",
        "1 cup chopped crystallized ginger",
        "1 2-inch piece fresh ginger, peeled, very thinly sliced",
        "2/3 cup water",
        "1/2 cup sugar",
        "2 teaspoons fresh lemon juice",
        "2 quarts fresh strawberries, hulled, halved (about 8 cups)",
        "Sliced fresh mint leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Sour Cream",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Double-Ginger Sour Cream and Bundt Cake with Ginger-Infused Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/double-ginger-sour-cream-and-bundt-cake-with-ginger-infused-strawberries-352071"
}
