{
    "directions": [
        "Combine the coconut milk, dates, and salt in a blender and blend until the mixture is smooth. This might take a few minutes. If end up with small bits of dates, that's OK. But you don't want to see chunks or even white slivers of the coconut milk. The color should be a very light tan. Taste, and if you want to add more salt, do it now and then blend for a few more seconds (I really like the saltiness a teaspoon brings). Pour the mixture into a medium jar or container with a lid. Stir in the chia seeds. Put the frosting in the fridge, covered, for at least 6 hours (overnight is best).",
        "Preheat the oven to 350ºF. Line a standard cupcake pan with 12 paper liners.",
        "In a small bowl, combine the almond milk and apple cider vinegar. In another small bowl, make a flax egg: Mix the flax meal and water together. Let both the almond milk mixture and the flax egg rest for at least 10 minutes.",
        "In a large bowl, whisk together the flours, cocoa powder, baking powder, baking soda, and salt.",
        "Combine the vanilla, maple syrup, flax egg, and almond milk mixture in a bowl. Add the wet ingredients into the dry and stir to combine. Do not overstir. Pour in the coconut oil and chocolate chips and give it a few more stirs, until just combined.",
        "Fill each cupcake liner with 1/4 cup of the batter. Bake for 18 to 20 minutes or until a fork or toothpick inserted in the center comes out clean.",
        "Let your cupcakes cool on a wire rack if you have one. When they're completely cool, top them with the frosting. Sprinkle a few more chocolate chips on top."
    ],
    "ingredients": [
        "1 (14-ounce) can full-fat coconut milk",
        "5 Medjool dates, pitted and chopped",
        "1/4–1/2 teaspoon of sea salt",
        "5 tablespoons chia seeds",
        "1 cup unsweetened almond milk",
        "1 tablespoon apple cider vinegar",
        "1 tablespoon flax meal",
        "3 tablespoons water",
        "1 cup chickpea (garbanzo bean) flour",
        "1/2 cup brown rice flour",
        "1/4 cup cocoa powder",
        "1 teaspoon aluminum-free baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon sea salt",
        "2 teaspoons vanilla extract",
        "1/4 cup real maple syrup",
        "1/4 cup coconut oil, melted",
        "1 cup dairy-free chocolate chips (I like Enjoy Life), plus more for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Cupcake",
        "Dessert",
        "Vegan",
        "Wheat/Gluten-Free",
        "Dairy Free",
        "Coconut",
        "Grains",
        "Seed",
        "Maple Syrup",
        "Chocolate"
    ],
    "title": "Double Chocolate Cupcakes With Salted Chia Pudding Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/double-chocolate-cupcakes-with-salted-chia-pudding-frosting"
}
