{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x18-inch pan with cooking spray.",
        "Combine 1 cup pepper-type soda and 1 cup butter in a saucepan over medium-low heat; heat until butter is melted, 3 to 5 minutes. Remove from heat and let cool.",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 8 minutes. Drain on paper towels.",
        "Mix flour, white sugar, 1/4 cup cocoa powder, cinnamon, and salt together in a large bowl.",
        "Whisk buttermilk, vanilla extract, and baking soda together in a small bowl. Pour flour mixture; mix until batter is blended. Add butter mixture, 1/3 of the bacon, and chocolate chips; mix thoroughly. Spread in the prepared pan.",
        "Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 25 to 30 minutes.",
        "Combine 6 tablespoons pepper-type soda, 1/2 cup butter, and 3 tablespoons cocoa powder in a saucepan; bring to a boil. Remove from heat. Add 1/2 of the remaining bacon and confectioners' sugar; whisk until frosting is smooth.",
        "Spread frosting over brownies. Garnish with remaining bacon. Cool until frosting sets, about 20 minutes. Cut into squares."
    ],
    "ingredients": [
        "cooking spray",
        "1 (12 fl oz) can caffeinated pepper-type soda (such as Dr Pepper®)",
        "1 cup butter",
        "12 strips bacon, chopped",
        "2 cups all-purpose flour",
        "2 cups white sugar",
        "1/4 cup cocoa powder",
        "1 teaspoon ground cinnamon (optional)",
        "1 teaspoon salt",
        "1/2 cup buttermilk",
        "2 teaspoons vanilla extract",
        "1 teaspoon baking soda",
        "1 (12 ounce) bag milk chocolate chips",
        "Frosting:",
        "1/2 cup butter",
        "3 tablespoons unsweetened cocoa powder",
        "1 (16 ounce) package confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dr Pepper® Bacon Brownies",
    "url": "http://allrecipes.com/recipe/255431/dr-pepper-bacon-brownies/"
}
