{
    "directions": [
        "In a large saucepan combine the apples with the cider and simmer them, stirring occasionally, for 15 to 20 minutes, or until they are softened but not mushy. Drain the apples and let them cool. In a large bowl toss the apples with the Cheddar, the cranberries or raisins, 3 tablespoons of the sugar, 1/2 teaspoon of the cinnamon, and the allspice and combine the filling well. The filling may be made 1 day in advance and kept covered and chilled.",
        "In a small bowl stir together the bread crumbs and 1 teaspoon of the remaining cinnamon and reserve the mixture. In another small bowl stir together the remaining 1 tablespoon sugar and the remaining 1 teaspoon cinnamon and reserve the cinnamon sugar.",
        "Preheat the oven to 425°F. On a work surface arrange two 20-inch-long sheets of wax paper with the long sides overlapping slightly and facing you. Put a sheet of the phyllo on the wax paper, brush it with some of the butter, and sprinkle it with about 2 teaspoons of the reserved bread crumb mixture. On this, layer, brush, and sprinkle 4 more sheets of the phyllo in the same manner and lay the sixth sheet of the phyllo on top.",
        "Spread the filling in a 3-inch-wide strip, mounding it on the phyllo 4 inches above the near long side, leaving a 2-inch border at each end. Using the wax paper as a guide, lift the bottom 4 inches of the pastry over the filling, fold in the ends, and roll up the strudel tightly. Transfer the strudel carefully, seam side down, to a lightly buttered baking sheet and brush it with the remaining butter. Arrange 1/2-inch-wide strips of wax paper 1/2 inch apart diagonally across the strudel. Transfer the reserved cinnamon sugar to a small sieve, shake it evenly over the strudel, and remove the wax paper strips carefully. Bake the strudel in the lower third of the oven for 20 to 25 minutes, or until it is golden, and let it cool to warm on the baking sheet on a rack. The strudel may be made 1 day in advance and kept covered loosely and chilled. Reheat the strudel in a preheated 400°F. oven for 20 minutes. Serve the strudel warm, cut into 1-inch slices with a serrated knife."
    ],
    "ingredients": [
        "3/4 pound dried apples",
        "3 cups apple cider",
        "1 1/2 cups grated Cheddar (about 6 ounces)",
        "1/4 cup dried cranberries (available at specialty foods shops and some supermarkets) or raisins",
        "4 tablespoons sugar",
        "2 1/2 teaspoons cinnamon",
        "1/4 teaspoon allspice",
        "10 teaspoons fine dry bread crumbs",
        "5 tablespoons unsalted butter, melted",
        "six 18- by 14-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened kitchen towel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Brunch",
        "Dessert",
        "Bake",
        "Cheddar",
        "Cranberry",
        "Raisin",
        "Apple",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dried Apple and Cheddar Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/dried-apple-and-cheddar-strudel-10971"
}
