{
    "directions": [
        "Using on/off turns, blend first 3 ingredients in processor until coarse meal forms. Add sour cream and process just until moist clumps form. Gather dough into ball; divide in half. Flatten each dough piece into thin rectangle. Wrap in plastic and chill until firm enough to roll, at least 30 minutes and up to 2 days.",
        "Preheat oven to 350°F. Line baking sheet with parchment paper. Roll out 1 dough piece on lightly floured surface to 14x12-inch rectangle. Leaving 1-inch plain border at 1 long side, spread with 3/4 cup cherry jam, then sprinkle with 1 cup almonds, 1/2 cup dried cherries and 1/2 cup chocolate chips. Starting opposite plain end, roll up dough jelly-roll style, enclosing filling. Push in ends to compress log to 12-inch length; seal ends. Transfer strudel, seam side down, to prepared baking sheet. Repeat with remaining dough and filling, spacing strudels evenly apart on baking sheet.",
        "Bake strudels until golden, about 1 hour 20 minutes. Slide spatula under hot strudels to loosen from sheet. Cool completely on sheet. Cut strudels crosswise into 3/4-inch-thick bars. (Store airtight at room temperature up to 3 days.)"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 teaspoon salt",
        "1/2 cup sour cream",
        "1 1/2 cups cherry jam",
        "2 cups almonds",
        "1 cup dried tart cherries",
        "1 cup mini semisweet chocolate chips (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer",
        "Jam or Jelly",
        "Illinois",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dried Cherry-Chocolate Strudel Bars",
    "url": "http://www.epicurious.com/recipes/food/views/dried-cherry-chocolate-strudel-bars-104339"
}
