{
    "directions": [
        "Combine first 9 ingredients in 12-inch broilerproof skillet with 3-inch-high sides or wide 3-quart stovetop casserole dish. Scrape in seeds from vanilla bean; add bean. Bring mixture to boil. Reduce heat to low and simmer 2 minutes. Remove from heat. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Whisk flour, 2 tablespoons sugar, baking soda, and sea salt in medium bowl to blend. Add butter and rub in with fingertips until very coarse meal forms (butter pieces will be reduced to size of small peas). Add buttermilk and stir just until dough comes together (dough will be slightly wet). Mix remaining 2 tablespoons sugar and cinnamon in small bowl to blend.",
        "Return dried fruit mixture to simmer. Using generous 1/4 cup biscuit dough for each, scoop 8 mounds of dough atop simmering fruit mixture, spacing apart. Sprinkle cinnamon sugar over each biscuit. Cover skillet tightly and simmer over medium-low heat until biscuits are puffy and cooked through (tester inserted into center of biscuits comes out clean), about 12 minutes. Remove skillet from heat. Let slump stand uncovered 15 minutes.",
        "Meanwhile position rack in upper third of oven at least 6 inches from heat source and preheat broiler. Broil slump just until biscuit tops are light golden, watching closely to prevent burning, 1 to 2 minutes.",
        "Divide fruit slump among bowls. Pour chilled cream over each and serve."
    ],
    "ingredients": [
        "2 cups fruity white wine (such as Riesling)",
        "1 1/2 cups water",
        "1 cup dried black Mission figs (about 6 ounces), stemmed, quartered",
        "1 cup dried apricot halves (about 5 ounces), cut in half",
        "1/2 cup dried tart cherries (about 3 ounces)",
        "1/2 cup golden raisins (about 3 ounces)",
        "1/4 cup matchstick-size strips crystallized ginger",
        "1/4 cup sugar",
        "2 tablespoons fresh lemon juice",
        "1/2 vanilla bean, split lengthwise",
        "1 1/2 cups all purpose flour",
        "4 tablespoons sugar, divided",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon fine sea salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/4-inch cubes",
        "2/3 cup chilled buttermilk",
        "1/8 teaspoon ground cinnamon",
        "Chilled heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Brunch",
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "New Year's Day",
        "Fig",
        "Apricot",
        "Cherry",
        "Winter",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dried Fig, Apricot, and Cherry Slump",
    "url": "http://www.epicurious.com/recipes/food/views/dried-fig-apricot-and-cherry-slump-356951"
}
