{
    "directions": [
        "In a bowl combine the cherries, the raisins and the water, let the fruit soak for 10 minutes, or until it is softened, and drain the mixture, reserving 1 cup of the liquid. In a small saucepan heat the reserved liquid over low heat until it is lukewarm. In the bowl of an electric mixer fitted with the paddle attachment proof the yeast with the granulated sugar in the warm liquid for 5 minutes, or until the mixture is foamy, add the flour, the salt, 1/4 cup of the brown sugar, the cinnamon, and the butter, and combine the dough well. Knead the dough with the dough hook for 2 minutes, or until it is soft and slightly sticky, transfer it to a lightly floured surface, and knead in the fruit mixture, patted dry, until it is incorporated thoroughly. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours, or until it is double in bulk. The dough may be made up to this point, punched down, and kept, covered and chilled, overnight. Let the dough return to room temperature before proceeding with the recipe. Press the dough evenly into an oiled jelly-roll pan, 15 1/2 by 10 1/2 by 1 inches, and let it rise, covered loosely, in a warm place for 1 hour, or until it is almost double in bulk.",
        "Dimple the dough, making 1/4-inch-deep indentations with your fingertips, and sprinkle it with the remaining 1/4 cup brown sugar. Bake the focaccia in the bottom third of a preheated 400°F. for 30 to 35 minutes, or until it is golden brown, let it cool in the pan on a rack, and serve it warm or at room temperature."
    ],
    "ingredients": [
        "2 cups dried sour cherries (about 1/2 pound, available at specialty  foods shops)",
        "1 cup golden raisins",
        "2 cups water",
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon granulated sugar",
        "3 1/2 cups unbleached all-purpose flour",
        "1 teaspoon salt",
        "1/2 cup firmly packed light brown sugar",
        "1/4 teaspoon cinnamon",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Fruit",
        "Bake",
        "Raisin",
        "Cherry",
        "Winter",
        "Gourmet"
    ],
    "title": "Dried Cherry and Golden Raisin Sweet Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/dried-cherry-and-golden-raisin-sweet-focaccia-13551"
}
