{
    "directions": [
        "In a large bowl, cover the cod pieces with 2 inches of cold water and soak, chilled, at least 24 hours and up to 36 hours, changing the water 2 to 3 times per day and tasting the cod to test for saltiness after the first 24 hours.",
        "Once the cod is sufficiently soaked, poach it in a large pot of boiling salted water for 5 minutes. Transfer the cod to a large bowl and reserve 2 cups of the poaching liquid. Using 2 forks, gently shred the cod into small pieces.",
        "In a large, deep sauté pan, heat the oil over moderate heat until hot but not smoking. Add the onion and sauté until translucent, about 2 minutes. Add the garlic and sauté for 1 minute. Add the shredded cod, along with the rice and chopped tomatoes, stir to combine, and cook for 10 minutes. Add the tomato purée, parsley, mint, marjoram, orange zest, cinnamon, allspice, and the 2 cups reserved poaching liquid and simmer for 5 minutes. Season with salt and pepper, remove from the heat, and set aside while you make the phyllo dough.",
        "Place the flour in a large bowl and create a well in the center. Add the wine, olive oil, and salt to the well and use your hands to gradually combine the ingredients. Once all the liquid has been absorbed, gradually start adding water just as needed, while using your hands to incorporate the water into the dough. Continue working the dough and adding water until the dough is fairly uniform and no longer sticky—you may have water left over. Divide the dough into two balls and flatten them into discs. Return the discs of dough to the bowl and cover with plastic wrap followed by a large kitchen towel. Let the dough rest at room temperature for about 30 minutes.",
        "Arrange a rack in the middle of the oven and preheat to 350°F. Generously brush a 13- by 9-inch baking dish with oil.",
        "On a lightly floured surface, roll both discs of dough into roughly 18- by 14-inch rectangles. Arrange 1 rectangle of dough in the prepared baking dish, allowing any excess dough to hang over the edge. Add the cod filling, spreading it evenly in the baking dish. Arrange the second rectangle of dough on top of the cod filling and use your fingers to roll and crimp the edges of the dough together, making sure to create a good seal. Brush the pie with oil then sprinkle it with water. Use a toothpick or fork to poke a few holes in the top of the pie to allow steam to escape during cooking. Bake the pie until the dough is golden brown, about 1 hour. Transfer the pie to a wire rack to let cool for at least 30 minutes before cutting and serving."
    ],
    "ingredients": [
        "1 1/2 pounds boneless, skinless salt cod (bacalao), rinsed well and cut into 4 or 5 large pieces",
        "1/4 cup olive oil",
        "1 medium onion, diced",
        "3 cloves garlic, minced",
        "1 cup long-grain white rice",
        "2 ripe tomatoes, peeled and finely chopped",
        "1 cup tomato purée",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "2 tablespoons chopped fresh mint",
        "2 tablespoons chopped fresh marjoram or oregano",
        "1 packed teaspoon finely grated orange zest (from 1 orange)",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "Table salt and freshly ground black pepper",
        "5 cups all-purpose flour",
        "1/2 cup dry white wine",
        "1/2 cup olive oil, plus more for brushing the baking dish and phyllo dough",
        "1 teaspoon table salt",
        "1 to 1 1/2 cups lukewarm water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Rice",
        "Tomato",
        "Bake",
        "Orange",
        "Mint",
        "Cod"
    ],
    "title": "Dried Cod Fish Pie",
    "url": "http://www.epicurious.com/recipes/food/views/dried-cod-fish-pie-51163830"
}
