{
    "directions": [
        "In a food processor coarsely chop mixed dried fruit and dates with spices, salt, and sugar. In a heavy saucepan combine dried-fruit mixture, cranberries, and 2 cups water and cook at a bare simmer, stirring occasionally, 10 minutes, or until fruit is tender (mixture will be very thick). In a small bowl stir together cornstarch and 2 tablespoons water until combined well. Stir cornstarch mixture into dried-fruit mixture and simmer, stirring frequently, 2 minutes. Stir in brandy and cool mincemeat. Mincemeat may be used immediately but will improve in flavor if kept, covered and chilled, at least 1 day and up to 1 week. Bring mincemeat to room temperature before proceeding.",
        "Preheat oven to 375°F.",
        "Keeping remaining dough chilled, on a lightly floured surface with a floured rolling pin roll out half of dough into a 13-inch round (about 1/8 inch thick). Fit round into a 9-inch (1-quart) glass pie plate and trim edge, leaving a 1/2-inch overhang. Chill shell, covered, 30 minutes, or until firm.",
        "Coarsely chop pecans and in a shallow baking pan toast in middle of oven until a shade darker, about 4 minutes. Stir pecans into mincemeat and spoon into shell, smoothing top. Roll out remaining dough 1/8 inch thick and arrange over filling. Trim dough, leaving a 3/4-inch overhang, and fold overhang under edge of bottom shell, pressing to seal. Crimp edge decoratively.",
        "In a small bowl whisk together 1/2 tablespoon water and yolk and lightly brush crust with egg wash. Sprinkle crust with sugar and with a knife cut several steam vents.",
        "Bake pie in middle of oven until crust is golden, 30 to 35 minutes, and transfer to a rack to cool. Pie may be made 8 hours ahead and kept at room temperature. Serve pie warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups mixed dried fruit such as pears, apricots, apples, prunes, peaches, and figs (about 3/4 pound total)",
        "1/2 cup pitted dates",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt",
        "1/3 cup sugar",
        "1/2 cup dried cranberries (about 3 ounces)",
        "2 cups plus 2 tablespoons water",
        "1 tablespoon cornstarch",
        "2 tablespoons brandy",
        "2 recipes pastry dough 3/4 cup pecans (about 3 ounces)",
        "1/2 tablespoon water",
        "1 large egg yolk",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Food Processor",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Cranberry",
        "Dried Fruit",
        "Date",
        "Spice",
        "Fall",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Dried-Fruit Mincemeat Pie",
    "url": "http://www.epicurious.com/recipes/food/views/dried-fruit-mincemeat-pie-15724"
}
