{
    "directions": [
        "Preheat the oven to 475 degrees F.",
        "Combine the salt, 2 tablespoons of the pepper, the oregano and thyme and rub into the outside of the beef. Place the beef on a rack on a roasting pan and roast it in the oven until medium-rare, 25 to 30 minutes (use a meat thermometer and monitor it till it's medium-rare). Remove the meat from the oven and place on a cutting board to rest.",
        "Place the roasting pan on the burner on medium-high heat. Add the garlic and sliced onions to the drippings, stirring around to cook until slightly tender, about 5 minutes. Add the soup mix.",
        "Pour in the consomme, stock, 1 cup water, the sherry, Worcestershire, soy sauce and the remaining 1 tablespoon pepper and bring to a boil. Reduce the heat and simmer for 1 hour. Pour through a fine mesh strainer and keep warm.",
        "Slice the rested beef very, very thinly.",
        "Split the rolls and spread with butter. Then grill the rolls on a griddle or in a skillet until golden brown and crisp.",
        "To build the sandwiches, pile sliced meat on the bottom half, dip the sliced beef quickly into the jus before putting on the roll, then top with the top half of the roll. Serve with little dishes of au jus.",
        "Melt provolone on top if desired."
    ],
    "ingredients": [
        "2 tablespoons kosher salt",
        "3 tablespoons freshly ground black pepper",
        "1 teaspoon ground oregano",
        "1 teaspoon ground thyme",
        "1 small boneless rib loin roast (4 to 5 pounds)",
        "5 cloves garlic, minced",
        "2 large onions, halved and sliced",
        "1 packet French onion soup mix",
        "1 can beef consomme",
        "1 can beef stock",
        "2 tablespoons dry sherry",
        "2 tablespoons Worcestershire",
        "1 tablespoon soy sauce",
        "8 crusty deli rolls",
        "Butter, softened, for toasting",
        "8 slices provolone cheese, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Lunch",
        "Roasting"
    ],
    "title": "Drippy French Dip Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/drippy-french-dip-sandwiches-recipe"
}
