{
    "directions": [
        "In a saucepan over very low heat, warm up 1/2 cup of milk to no more than 100 degrees F (38 degrees C); stir in 1 tablespoon of flour and 1 tablespoon of sugar. Remove from heat and transfer to a bowl. Crumble the cake yeast into the milk mixture, and gently stir until the mixture becomes creamy. Cover the pan with a cloth, and set aside in a warm place until the yeast forms a spongy texture, 20 to 30 minutes.",
        "Melt margarine in a saucepan over low heat; remove from heat and allow to cool to lukewarm.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish, and sprinkle with bread crumbs.",
        "Place eggs and 1 1/8 cup sugar into a blender, and process until the mixture is yellow and fluffy. In a large mixing bowl, whisk together 8 cups of flour with vanilla sugar. Stir in the egg mixture, activated yeast mixture, and lukewarm margarine; start kneading 1 cup milk, or as needed, into the dough, a little at a time, until the dough stops sticking to your fingers and becomes smooth and even. Knead for at least 15 minutes, working to incorporate as much air as possible into the dough as you knead.",
        "Press the dough evenly into the prepared baking sheet, and arrange the plums over the top of the dough. Set aside.",
        "In a bowl, cut together 1 1/2 cup flour, the butter, and 1/2 cup of sugar with a pastry cutter until the mixture resembles fine crumbs; sprinkle the streusel mixture over the plums. Dust streusel with cinnamon, if desired.",
        "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 1 hour to 1 hour and 10 minutes."
    ],
    "ingredients": [
        "1/2 cup whole milk",
        "1 tablespoon all-purpose flour",
        "1 tablespoon white sugar",
        "2 (0.6 ounce) cakes cake yeast",
        "1 1/3 cups margarine",
        "1/2 cup dry bread crumbs",
        "4 eggs",
        "1 1/8 cups white sugar",
        "8 cups all-purpose flour",
        "4 teaspoons vanilla sugar",
        "1 cup whole milk, or as needed",
        "6 cups fresh plums, pitted and quartered",
        "1 1/2 cups all-purpose flour",
        "1/2 cup butter",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Drozdzowka (Polish Yeast Plum Cake)",
    "url": "http://allrecipes.com/recipe/215136/drozdzowka-polish-yeast-plum-cake/"
}
