{
    "directions": [
        "Combine brown sugar, chile powder, paprika, salt, pepper, cayenne, granulated garlic, mustard powder, coriander, and cumin in a small bowl.",
        "Prepare a grill for medium-high heat; oil grate. Grill corn, turning occasionally, until lightly browned all over, 8–10 minutes; let cool. Cut kernels from cobs and place in a medium bowl. Add onion, jalapeño, tomatoes, cilantro, and lime juice to corn and toss to combine; season with salt and pepper. Set salsa aside.",
        "Meanwhile, coat steak with all of dry rub, packing on more than once if needed, and drizzle with 2 tablespoons oil to help rub adhere. Grill steak, turning occasionally and moving to a cooler spot on grill as needed to control flare-ups, until nicely browned and an instant-read thermometer inserted into the thickest part registers 130°F, about 4 minutes per side for medium-rare. Transfer to a cutting board and let rest 10 minutes.",
        "Return steak to grill just to recrisp exterior, about 1 minute per side. Transfer back to cutting board and slice against the grain. Serve topped with salsa.",
        "Salsa can be made 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "2 tablespoons light brown sugar",
        "1 tablespoon ancho chile powder",
        "1 tablespoon paprika",
        "2 teaspoons kosher salt",
        "2 teaspoons freshly ground black pepper",
        "1 teaspoon cayenne pepper",
        "1 teaspoon granulated garlic",
        "1 teaspoon English mustard powder",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "2 tablespoons olive oil, plus more for grill",
        "3 ears of corn, shucked",
        "1/4 red onion, finely chopped",
        "1 jalapeño, seeds removed, finely chopped",
        "1 pint cherry tomatoes, halved",
        "1 cup fresh cilantro, coarsely chopped",
        "1/3 cup fresh lime juice",
        "Kosher salt, freshly ground pepper",
        "1 1/2 pound flank steak"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Steak",
        "Corn",
        "Healthy",
        "Cumin",
        "Paprika",
        "Dallas",
        "Texas"
    ],
    "title": "Dry-Rubbed Flank Steak with Grilled Corn Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/dry-rubbed-flank-steak-with-grilled-corn-salsa-56389977"
}
