{
    "directions": [
        "Cook and stir the ground beef, onion, and garlic together in a large skillet over medium-high heat until the beef is completely browned; drain fat from the skillet.",
        "Stir the taco seasoning mix and water into the beef mixture; bring to a boil, reduce heat to medium-low, and cook at a simmer, stirring occasionally, for 5 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Place the prepared pizza curst on a baking sheet.",
        "Blend the diced tomatoes with garlic and onion, salsa, and cilantro in a blender until smooth.",
        "Spread the refried beans in an even layer on the prepared pizza crust, leaving a border of about 1/2-inch uncovered around the outside.",
        "Spread about 1 cup of the diced tomato mixture over the refried beans in an even layer; reserve the remaining sauce.",
        "Scatter the ground beef mixture over the layer of sauce.",
        "Cover the beef with 1 1/2 cups Mexican-style shredded cheese blend.",
        "Bake in the preheated oven until the cheese is bubbly and the edges of the crust are golden brown, 15 to 20 minutes; set aside to cool 5 minutes.",
        "Top the pizza with shredded lettuce, chopped tomatoes, black olives, green onions, and 1/2 cup Mexican-style shredded cheese blend. Serve with the reserved sauce, sour cream, and 1 cup salsa."
    ],
    "ingredients": [
        "1/2 pound ground beef",
        "1/2 cup chopped onion",
        "1 clove garlic",
        "1/2 (1 ounce) packet taco seasoning mix",
        "1/3 cup water",
        "1 (14.5 ounce) can diced tomatoes with garlic and onion",
        "1 cup salsa",
        "2 tablespoons chopped fresh cilantro",
        "1 cup refried beans",
        "1 12-inch prepared pizza crust",
        "1 1/2 cups Mexican-style shredded four-cheese blend",
        "2 cups shredded lettuce",
        "2 tomatoes, chopped",
        "1 (2.25 ounce) can sliced black olives, drained",
        "1/4 cup chopped green onion",
        "1/2 cup Mexican-style shredded four-cheese blend",
        "1 cup sour cream, or as desired (optional)",
        "1 cup salsa, or as desired (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "D's Taco Pizza",
    "url": "http://allrecipes.com/recipe/220190/ds-taco-pizza/"
}
