{
    "directions": [
        "Mix the yeast and water together in a large bowl, and let stand until a creamy layer forms on top, about 5 minutes. Beat in 3 eggs, sweetener, butter, whole wheat flour, all-purpose flour, and rolled oats. Turn the dough out onto a floured surface, and knead until smooth and elastic, 5 to 10 minutes.",
        "Form the dough into a compact round shape, and place in an oiled bowl. Turn the dough over several times in the bowl to oil the surface of the dough, cover the bowl with a damp cloth, and let rise in a warm area until doubled in size, about 2 hours.",
        "Punch down the dough, and cut into 3 equal-size pieces. Working on a floured surface, roll the dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Place the braided challah on a baking sheet lined with parchment paper. Cover the loaf with a dry cloth, and let rise in a warm spot until doubled, about 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Brush the loaf with 1 beaten egg, and bake in the preheated oven until golden brown, 30 to 40 minutes. Let cool before slicing."
    ],
    "ingredients": [
        "2 (.25 ounce) packages active dry yeast",
        "1 cup warm water (100 degrees F or 38 degrees C)",
        "1/2 cup granular no-calorie sucralose sweetener (such as Splenda®)",
        "1/2 cup butter at room temperature",
        "2 teaspoons salt",
        "3 eggs",
        "2 cups whole wheat flour",
        "2 cups all-purpose flour",
        "1/2 cup rolled oats, slightly crushed",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "D's Whole Wheat Challah",
    "url": "http://allrecipes.com/recipe/91836/ds-whole-wheat-challah/"
}
