{
    "directions": [
        "Using sharp knife, score skin of duck breast diagonally to create 3/4-inch-wide diamond pattern. Sprinkle crushed juniper berries and thyme over both sides of breast; press to adhere. Place on rimmed baking sheet, cover with plastic wrap, and refrigerate at least 4 hours. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Preheat oven to 500°F. Arrange grape clusters in single layer on baking sheet. Drizzle with olive oil and sprinkle with kosher salt and pepper. Roast until skins are slightly crisp but grapes are still soft and juicy inside, about 14 minutes. Cool. (Can be made 4 hours ahead. Let stand at room temperature.)",
        "Sprinkle both sides of duck breasts with salt and pepper. Heat heavy large skillet over medium heat. Add duck, skin side down; cook until almost all fat is rendered, about 7 minutes. Increase heat to medium-high and cook until skin is brown and crisp, about 4 minutes. Turn duck over and cook about 3 minutes longer for medium-rare. Let duck rest 5 minutes.",
        "Divide arugula among 6 plates. Thinly slice duck breasts crosswise and fan out slightly; place 1 breast atop arugula on each plate. Drizzle crème fraîche over each breast. Divide grapes among plates."
    ],
    "ingredients": [
        "6 6- to 8-ounce duck breasts (thawed if frozen)",
        "1 tablespoon dried juniper berries, crushed in resealable plastic bag using flat side of mallet",
        "1 tablespoon fresh thyme leaves",
        "1/2 pound purple seedless grapes, cut into small clusters",
        "1/2 tablespoon olive oil",
        "Coarse kosher salt",
        "3 cups arugula",
        "1/4 cup crème fraîche or sour cream, stirred to loosen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Duck",
        "Fruit",
        "Poultry",
        "Roast",
        "Sauté",
        "Valentine's Day",
        "Low Carb",
        "Winter",
        "Grape"
    ],
    "title": "Duck Breast with Crème Fraîche and Roasted Grapes",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breast-with-creme-fraiche-and-roasted-grapes-109174"
}
