{
    "directions": [
        "Preheat oven to 450°F. Pierce skin of duck breasts all over with fork. Sprinkle duck with salt and pepper. Heat heavy large skillet over high heat. Add duck breasts, skin side down, to skillet. Cook until skin is well browned, about 4 minutes. Turn duck breasts over; cook 2 minutes. Remove from heat. Set rack in roasting pan. Transfer duck breasts to rack (reserve drippings in skillet). Roast duck to desired doneness, about 20 minutes for medium-rare.",
        "Meanwhile, heat drippings in skillet over medium heat. Add shallots and sauté until beginning to brown, about 5 minutes. Tilt skillet; push shallots to higher end of skillet, allowing drippings to flow to lower end. Spoon off drippings and discard. Add broth, orange juice and tea leaves to skillet. Boil until mixture is reduced to 1 1/4 cups, about 17 minutes. Pour mixture through strainer set over bowl, pressing on solids to extract as much liquid as possible. Discard solids in strainer. Return liquid to same skillet. Add honey; bring to simmer. Whisk in butter. Season sauce with salt and pepper.",
        "Thinly slice duck breasts crosswise. Fan slices on each of 4 plates, dividing equally. Spoon sauce around duck. Garnish with orange segments, if desired."
    ],
    "ingredients": [
        "2 boneless Muscovy duck breast halves (about 1 3/4 pounds total)",
        "3/4 cup chopped shallots",
        "2 1/4 cups canned low-salt chicken broth",
        "1 1/2 cups orange juice",
        "4 1/2 teaspoons Earl Grey tea leaves or 5 tea bags, leaves removed from bags",
        "1 tablespoon honey",
        "3 tablespoons butter, cut into small pieces",
        "Orange segments (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Duck",
        "Roast",
        "Orange",
        "Fall",
        "Honey"
    ],
    "title": "Duck Breasts with Orange, Honey and Tea Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breasts-with-orange-honey-and-tea-sauce-103268"
}
