{
    "directions": [
        "Arrange endive in single layer in heavy large skillet; sprinkle with sugar and salt. Add juice and stock; bring to boil. Reduce heat to medium-low. Cover; simmer 15 minutes. Turn endive over. Cover; simmer until tender, about 10 minutes longer. Using tongs, transfer endive to plate, draining juices back into skillet. Boil juices in skillet until reduced almost to glaze, whisking occasionally, about 9 minutes. Season juices with salt and pepper. Return endive to skillet.",
        "Stir vinegar, sugar, and coriander seeds in heavy small saucepan over low heat until sugar dissolves. Increase heat and boil (do not stir) until syrup is dark at edge of pan and bubbles break thickly on surface, swirling pan occasionally, about 5 minutes. Carefully add juice and stock and boil until sauce is reduced to 1 cup, stirring often, about 12 minutes. Strain sauce into another small saucepan. Add peel. Simmer until sauce is reduced to 1/2 cup, about 3 minutes. (Endive and sauce can be made 1 day ahead. Cover separately; chill.)",
        "Preheat oven to 425°F. Sprinkle duck with salt and pepper. Melt butter with oil in heavy large ovenproof skillet over high heat. Add duck, skin side down; cook until skin is very crisp, about 5 minutes. Using tongs, transfer duck, skin side down, to work surface. Brush meat side of each duck breast with 1/2 tablespoon honey. Press 1/2 tablespoon coriander seeds into honey on each breast. Discard fat from skillet. Return duck, skin side up, to skillet. Press 1/2 tablespoon coriander seeds onto skin of each breast.",
        "Place duck in oven and roast until cooked to desired doneness, about 7 minutes for medium-rare (150°F to 160°F). Rewarm endive in covered skillet. Transfer duck to work surface. Brush most seeds off duck. Cut each breast crosswise into thin slices. Overlap slices of 1 breast on each plate. Spoon sauce over. Set 3 heads of endive on each plate."
    ],
    "ingredients": [
        "12 small heads of Belgian endive",
        "1 tablespoon sugar",
        "1/8 teaspoon salt",
        "3/4 cup fresh orange juice",
        "3/4 cup chicken stock or canned low-salt chicken broth",
        "1/2 cup red wine vinegar",
        "1/4 cup sugar",
        "1 tablespoon whole coriander seeds",
        "1 1/4 cups fresh orange juice",
        "1 cup chicken stock or canned low-salt chicken broth",
        "1/2 teaspoon grated orange peel",
        "4 duck breasts (each about 7 ounces), excess skin trimmed",
        "1 tablespoon unsalted butter",
        "1 tablespoon olive oil",
        "2 tablespoons honey",
        "4 tablespoons whole coriander seeds, coarsely crushed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Orange",
        "Fall",
        "Endive",
        "Coriander"
    ],
    "title": "Duck Breasts with Coriander, Endive, and Sweet-and-Sour Orange Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breasts-with-coriander-endive-and-sweet-and-sour-orange-sauce-105082"
}
