{
    "directions": [
        "Season the duck legs with kosher salt on both sides. Place them in a large resealable bag. Add the lemon zest and slices, garlic, allspice berries, juniper berries and fresh thyme. Seal, and massage the duck legs through the bag until all of the ingredients are evenly dispersed. Refrigerate for 24 hours to marinate.",
        "Preheat the oven to 200 degrees F (93 degrees C).",
        "Remove the duck legs from the marinade. Rinse them off and pat dry. Place the rest of the contents of the bag into the bottom of an oven safe dish just large enough to hold the legs in a single layer, preferably enameled cast iron or glass. Arrange the duck legs skin side down in the dish. Pour the duck fat into a small saucepan and warm over low heat until liquid. Pour over the duck legs until they are completely covered. If the legs are not covered, you can top it off with some olive oil. As the legs cook, more fat will be rendered from the skin. Cover the dish with a lid.",
        "Bake for 6 to 7 hours in the preheated oven, until the meat pulls easily from the bone. Remove the duck legs from the fat and place in a sealable container. You may leave the bones in or remove them. Make sure there is room at the top of the container. Strain all of the solids from the remaining fat and discard the solids. Pour the fat over the duck in the container, covering completely. Seal and allow to come to room temperature. Once the jar is cool, place in the refrigerator and let the duck meat cure for 2 months. Reserve any leftover duck fat for other uses."
    ],
    "ingredients": [
        "2 uncooked Peking duck legs",
        "1 tablespoon kosher salt",
        "1 lemon, zested and thinly sliced",
        "3 cloves garlic, crushed",
        "1 tablespoon whole allspice berries",
        "1 tablespoon juniper berries",
        "2 sprigs fresh thyme",
        "2 cups rendered duck fat"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Duck Confit",
    "url": "http://allrecipes.com/recipe/151010/duck-confit/"
}
