{
    "directions": [
        "Heat oil in a 2- to 3-quart heavy saucepan over moderate heat until hot but not smoking, then cook onion, garlic, and shallot, stirring occasionally, until golden, about 7 minutes.",
        "Add tomato paste, black pepper, cumin, hot pepper flakes, and 1/4 teaspoon salt and cook, stirring, 30 seconds. Add bell pepper and tomato and cook, stirring occasionally, until softened, about 5 minutes.",
        "Stir in wine, vinegar (to taste), and sugar and simmer 1 minute. Stir in mustard, 1 1/2 cups cherries, and remaining 1/2 teaspoon salt and simmer 1 minute.",
        "Purée mixture in a blender until very smooth, about 1 minute (use caution when blending hot liquids). Force cherry sauce through a fine-mesh sieve into a bowl and transfer 1/4 cup sauce to a small bowl for glazing duck.",
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Score duck skin in a crosshatch pattern with a small sharp knife and season duck all over with salt and pepper.",
        "Heat water in an ovenproof 12-inch heavy skillet over low heat until hot, then add duck, skin side down. Cook duck, uncovered, over low heat, without turning, until most of fat is rendered and skin is golden brown, about 25 minutes.",
        "Transfer duck to a plate and discard all but 1 tablespoon fat from skillet. Brush duck all over with cherry sauce from bowl and return to skillet, skin side up.",
        "Roast duck in oven until thermometer registers 135°F (see cooks' note, below), about 8 minutes for medium-rare.",
        "Transfer duck to a cutting board and set skillet aside. Let duck stand, loosely covered with foil, 10 minutes.",
        "Immediately after covering duck, carefully pour off any fat from skillet, leaving any brown bits, and add remaining cherry sauce, stirring and scraping up any brown bits. Add remaining 1 1/2 cups cherries. (Cherries will lose flavor if cooked; heat from skillet will warm sauce.)",
        "Holding a sharp knife at a 45-degree angle, cut duck into slices. Sprinkle with chopped herbs and serve with cherry sauce."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1/2 cup chopped onion (1 small)",
        "3 garlic cloves, crushed",
        "1 tablespoon finely chopped shallot",
        "1 teaspoon tomato paste",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon ground cumin",
        "Scant 1/4 teaspoon dried hot red pepper flakes",
        "3/4 teaspoon salt",
        "1/2 cup coarsely chopped red bell pepper (1/2 medium)",
        "1 plum tomato, coarsely chopped",
        "1/4 cup dry red wine",
        "1 1/2 to 2 tablespoons cider vinegar",
        "2 tablespoons sugar",
        "1/2 teaspoon Dijon mustard",
        "1 1/4 lb dark sweet cherries such as Bing, quartered and pitted (3 cups)",
        "2 (3/4-lb) boneless Moulard duck breasts with skin*",
        "2 tablespoons water",
        "1 tablespoon chopped fresh tarragon or chives",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Fruit",
        "Poultry",
        "Roast",
        "Valentine's Day",
        "Dinner",
        "Cherry",
        "Meat",
        "Summer",
        "Anniversary",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Duck Breast with Sweet Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breast-with-sweet-cherry-sauce-232306"
}
