{
    "directions": [
        "Prick duck skin all over with tip of a knife. In a heavy skillet brown kielbasa and duck in batches over moderately high heat, transferring as browned to paper towels to drain. Combine kielbasa and duck with broth and water in a 6-gallon kettle and bring to a simmer.",
        "Pour off all but 1/4 cup fat from skillet. Add flour and cook roux over moderately low heat, stirring constantly, until a shade darker than peanut butter, about 30 minutes. Add onions, celery, and bell peppers and cook, stirring occasionally, until vegetables are crisp-tender. Add vegetable mixture to kettle and stir until roux is dissolved.",
        "Simmer gumbo, uncovered, 2 hours and let cool completely. Bone duck, discarding skin and bones. Chill gumbo overnight. Gumbo may be made 2 days in advance and kept covered and chilled. Discard fat on surface and reheat gumbo with cayenne, scallions, and salt to taste over moderate heat.",
        "To a kettle of boiling salted water add brown rice, stirring, and boil 15 minutes. Drain rice in a large colander and rinse. Put colander over a kettle of boiling water and steam brown rice, covered with a kitchen towel and a lid, until fluffy and dry, about 25 minutes. Cook white rice in same manner, boiling 10 minutes and steaming 15 minutes. In a bowl toss brown and white rice together. Rice may be made 3 days in advance and kept chilled in resealable plastic bags. Steam rice to reheat.",
        "Serve gumbo over rice."
    ],
    "ingredients": [
        "two 5 1/2-pound ducks, excess fat discarded and ducks cut into serving pieces",
        "2 pounds kielbasa (Polish smoked sausage), cut into 1/4-inch-thick rounds)",
        "12 cups chicken broth",
        "6 cups water",
        "1/3 cup all-purpose flour",
        "2 onions, chopped",
        "2 celery ribs, chopped",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "1 teaspoon cayenne, or to taste",
        "2 cups thinly sliced scallion greens",
        "1 1/2 cups long-grain brown rice",
        "1 1/2 cups long-grain white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Duck",
        "Rice",
        "Sausage",
        "Chill",
        "Gourmet"
    ],
    "title": "Duck and Sausage Gumbo with Brown and White Rice",
    "url": "http://www.epicurious.com/recipes/food/views/duck-and-sausage-gumbo-with-brown-and-white-rice-11116"
}
