{
    "directions": [
        "Remove the duck breasts from the refrigerator, salt them well, and set them aside at room temperature for 30 minutes.",
        "Pan sear the duck breasts. You may have to do this in batches. When the breasts are cooked, set them aside skin side up on a cutting board and let them rest, tented with aluminum foil, while you make the sauce.",
        "To make the sauce, pour off all but about 2 tablespoons of the fat from the pan and place the pan over medium heat. Sprinkle the flour into the pan and stir to combine and make a roux. Let it cook, stirring occasionally, for 4 to 5 minutes, until it is the color of coffee with cream.",
        "Add a pinch of salt and stir to combine, then slowly stir in the stock, orange juice, liqueur, and vinegar. Everything will spatter at first, but it will calm down. Add any accumulated juices from the duck to the sauce. Let this boil down until it is a little thinner than the consistency of Thanksgiving gravy. Add the sugar, then taste and adjust with salt. If you want a more refined sauce, pour it through a fine-mesh sieve into a bowl.",
        "To serve, slice the breasts. Spoon some sauce on each plate and top with breast slices. Garnish with the orange zest and orange slices."
    ],
    "ingredients": [
        "1 1/2 to 2 pounds duck breasts",
        "Kosher salt",
        "1 tablespoon all-purpose flour",
        "1 cup Basic Duck Stock or chicken stock",
        "Juice of 1 orange, preferably Seville (1/2 cup)",
        "1 shot glass Grand Marnier or other orange liqueur, optional",
        "1 tablespoon cider vinegar or sherry vinegar",
        "1 teaspoon sugar",
        "Grated zest of 1 orange",
        "1/2 sweet orange, quartered and thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Duck",
        "Fruit",
        "Poultry",
        "Dinner",
        "Orange",
        "Fall",
        "Winter",
        "Advance Prep Required",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Duck Bigarade",
    "url": "http://www.epicurious.com/recipes/food/views/duck-bigarade-51197620"
}
