{
    "directions": [
        "Preheat the oven to 400°F. Pat turkey breast dry with paper towels and season both sides liberally with salt and pepper.",
        "Heat a large cast-iron skillet over very high heat. Add the duck fat to the skillet. When the fat shimmers, add the turkey breast, skin-side down, and cook until dark golden brown, 3 to 5 minutes.",
        "Remove skillet from heat and remove the turkey from pan. Carefully stir the butter into the pan juices. Arrange the thyme branches in the skillet to make a bed for the turkey. Place the turkey, seared-side-up, on the thyme and sprinkle the garlic around the sides. Baste the turkey, and transfer the pan to the oven.",
        "Roast, basting every 15 minutes, until a meat thermometer inserted into the thickest part of the breast without touching bone registers 155°F, about 1 hour. Baste once more and transfer the turkey to a platter. Let the turkey rest for at least 20 minutes before slicing and serving.",
        "While the turkey roasts, prepare the puree. In a medium saucepan, heat the stock over medium-high, add the green onions, and simmer until tender, about 5 minutes. Using a slotted spoon, transfer the scallions to a blender, reserving the cooking liquid. Blend on high until very smooth, about 5 minutes, adding a splash of cooking liquid if necessary to help the blender puree the scallions. Add the cream cheese and blend for 2 minutes more. Season with salt to taste. Slice the turkey breast across the grain and serve with the green-onion puree."
    ],
    "ingredients": [
        "1 bone-in turkey breast",
        "turkey breast half (about 4 1/2 pounds), preferably brined",
        "Kosher salt",
        "freshly ground black pepper",
        "1/4 cup duck fat",
        "2 tablespoons unsalted butter",
        "1 bunch thyme",
        "4 garlic cloves, smashed and peeled",
        "1/2 pound green onions, trimmed and roughly chopped",
        "1/2 cup low-sodium vegetable stock, preferably homemade",
        "2 teaspoons cream cheese, at room temperature",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Garlic",
        "Onion",
        "turkey",
        "Thanksgiving"
    ],
    "title": "Duck-Fat Turkey Breasts with Green Onion Puree",
    "url": "http://www.epicurious.com/recipes/food/views/duck-fat-turkey-breasts-with-green-onion-puree-51257310"
}
