{
    "directions": [
        "Combine sugar and 2 2/3 cups water in heavy medium saucepan. Bring to simmer, stirring until sugar dissolves. Add orange slices and boil gently until orange peels are almost translucent, about 30 minutes. Drain. Place orange slices on rack set over plate and let drain another 30 minutes. Cut slices into 1/2-inch dice. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Heat 4 tablespoons oil in large nonstick skillet over medium-high heat. Add chicken livers, sage, and garlic; sauté until livers are browned but still slightly pink inside, about 9 minutes. Remove from heat; cool slightly. Cut chicken livers into 1/2-inch dice; return to skillet. Mix in pears and diced candied oranges. Season stuffing to taste with salt and pepper.",
        "Preheat oven to 400°F. Boil wine in small saucepan for 3 minutes to allow alcohol to cook away; set aside. Sprinkle duck cavities with salt and pepper. Fill cavities with liver stuffing, dividing equally. Close cavity openings with small metal skewers. Place ducks in large roasting pan. Brush ducks with remaining 2 tablespoons oil. Sprinkle with salt and pepper. Roast ducks 20 minutes. Pour wine into roasting pan. Brush ducks with honey. Continue to roast until ducks are cooked through and juices run clear when thickest part of thigh is pierced with fork, about 1 hour 10 minutes longer. Transfer ducks to platter. Spoon fat off top of pan juices and discard. Pour pan juices into small bowl; season with salt and pepper. Serve ducks and stuffing with pan juices."
    ],
    "ingredients": [
        "3 cups sugar",
        "2 2/3 cups water",
        "2 oranges, ends trimmed and discarded, each cut into 5 rounds",
        "6 tablespoons extra-virgin olive oil, divided",
        "14 ounces chicken livers, fat trimmed",
        "10 large fresh sage leaves",
        "2 garlic cloves, thinly sliced",
        "2 cups diced peeled pears (about 2 medium)",
        "2 cups dry red wine",
        "2 4 1/2- to 5-pound ducks, thawed if frozen, excess fat trimmed, rinsed, patted dry",
        "2 tablespoons honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Duck",
        "Fruit",
        "Poultry",
        "Roast",
        "Orange",
        "Pear"
    ],
    "title": "Duck Stuffed with Chicken Liver, Candied Orange, and Pears",
    "url": "http://www.epicurious.com/recipes/food/views/duck-stuffed-with-chicken-liver-candied-orange-and-pears-232090"
}
