{
    "directions": [
        "Put a small shallow flameproof roasting pan in middle of oven and preheat oven to 400°F.",
        "Pat duck dry and trim off any fat from sides. Score duck skin in a crosshatch pattern at 1/2-inch intervals with a sharp knife, then season with 1/4 teaspoon salt and 1/8 teaspoon pepper.",
        "Heat a heavy medium skillet (not nonstick) over medium-high heat until hot, then cook duck, skin side down, until golden brown and crisp, about 3 minutes. Turn and cook until other side is golden, about 2 minutes. Transfer to roasting pan and roast in oven until an instant-read thermometer inserted horizontally into center registers 135°F, 10 to 14 minutes. Transfer to a cutting board and let stand, loosely covered with foil, 5 minutes. (Internal temperature will rise to at least 142°F.)",
        "Pour off all but 1 tablespoon fat from roasting pan, then add oil and shallot and cook over medium heat, stirring, until golden brown, about 2 minutes. Remove from heat and add Port, then return to heat (Port may ignite) and cook, stirring and scraping up brown bits, 1 minute.",
        "Remove from heat and stir in mustard and salt and pepper to taste. Add frisée, tossing to combine, and sprinkle with almonds. Serve duck with salad."
    ],
    "ingredients": [
        "1 (8-to 10-ounce) boneless duck breast with skin",
        "1 tablespoon olive oil",
        "1 shallot, finely chopped",
        "1/4 cup tawny Port",
        "1 teaspoon Dijon mustard",
        "3 cups torn frisée",
        "1 tablespoon sliced almonds, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Mustard",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Port",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Duck Breast with Frisée Salad and Port Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breast-with-frisee-salad-and-port-vinaigrette-351415"
}
