{
    "directions": [
        "Put oven rack in middle of oven and preheat oven to 375°F.",
        "Toss bread with oil and kosher salt and spread in 1 layer in a large shallow baking pan, then bake until golden, about 12 minutes.",
        "Whisk together Sherry vinegar, mustard, pepper, and salt to taste in a large bowl, then add oil in a slow stream, whisking until emulsified.",
        "Fry duck slices in 2 batches in a 12-inch heavy skillet over moderate heat, turning over once, until browned, about 3 minutes per batch (use caution; fat will splatter). Transfer duck breast bacon with tongs to a paper-towel-lined platter and loosely cover with foil to keep warm.",
        "Fill a deep 10-inch skillet with 1 1/4 inches cold water. Add distilled vinegar and bring to a simmer.",
        "Break 1 egg into a cup, then slide egg into simmering water. Repeat with remaining eggs, spacing them in skillet, and poach at a bare simmer until whites are firm but yolks are still runny, 2 to 3 minutes.",
        "Gently transfer eggs with a slotted spoon to paper towels to drain and season with salt and pepper.",
        "Toss frisée and croutons with dressing. Serve salad topped with duck bacon and eggs."
    ],
    "ingredients": [
        "3 cups (3/4-inch) bread cubes from a country-style loaf",
        "2 tablespoons olive oil",
        "1/2 teaspoon kosher salt",
        "2 tablespoons Sherry vinegar or red-wine vinegar",
        "4 teaspoons Dijon mustard",
        "1/4 teaspoon black pepper",
        "6 tablespoons olive oil",
        "2 cold-smoked duck breast halves (page 93; see cooks' note, below), cut crosswise into 1/8-inch-thick slices",
        "1 teaspoon distilled white vinegar",
        "4 large eggs",
        "10 oz frisée, torn into bite-size pieces (8 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Duck",
        "Leafy Green",
        "Appetizer",
        "Fry",
        "Lunch",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Duck Breast and Frisée Salad",
    "url": "http://www.epicurious.com/recipes/food/views/duck-breast-and-frisee-salad-232144"
}
