{
    "directions": [
        "Season duck legs with salt and a few thyme leaves. Wrap in paper toweling and refrigerate 24 hours.",
        "The following day: Rinse off seasonings, blot very dry, and wrap in pairs in boilable pouches, then use a FoodSaver or professional vacuum packing device to seal airtight. Cover one stovetop burner with a Simmer Mat or heat diffuser. Place the sealed pouches in a deep flameproof ceramic or cast-iron casserole and cover with hot water. Be sure the pouches are completely submerged; if necessary, weight them down. Place the casserole over the mat or heat diffuser set over medium-low heat. Cover the casserole and heat to 180°F (use an instant-read thermometer), then reduce heat to low and allow to simmer at a constant 180°F temperature for at least 8 hours for Moulard, 9 for Muscovy, or 5 to 6 hours for Pekin. (If you have an electric oven, alternatively, you can place the pouches in very hot water in a casserole and cook at 180°F overnight. (Because of the constant water temperature, the flesh won’t cook beyond its stage of “doneness.”)",
        "The duck is ready when the flesh feels very tender, begins to separate from the bone, and the joint between leg and thigh cracks easily. When you remove the pouches from the casserole, immediately set the pouches in a bowl of ice water to chill until completely cold, about 30 minutes. The fat should congeal. Refrigerate until ready to use, within one week (see Cooks' Notes below).",
        "When ready to serve: Place the pouches under warm running water until you can easily break the chunks of the fat away from the meat. Open each pouch and separate the fat and jelly-like juices from the flesh. Set the fat aside for some other purpose; use juices for sauces or add to the beans. If using for cassoulet, bone the legs and break the meat into large chunks. Brown the skin to a crisp in a skillet; season the flesh side with pepper. Add the meat chunks and skin to the cassoulet"
    ],
    "ingredients": [
        "4 Moulard or large Muscovy duck legs, or 6 Pekin or small Muscovy duck legs (about 3 pounds)",
        "1/4 cup Diamond Crystal kosher salt or 2 teaspoons per pound",
        "2 sprigs fresh thyme",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Thyme"
    ],
    "title": "Duck Legs Confit Cooked in a Pouch (“Confit” de Canard en Sous Vide)",
    "url": "http://www.epicurious.com/recipes/food/views/duck-legs-confit-cooked-in-a-pouch-confit-de-canard-en-sous-vide"
}
