{
    "directions": [
        "Stir sugar and water in heavy medium saucepan over medium heat until sugar dissolves. Increase heat; boil until syrup turns deep amber, occasionally brushing down sides of pan with wet pastry brush and swirling pan, 8 minutes. Remove from heat. Mix in vinegar (mixture will bubble vigorously). Add juice and shallots; boil until reduced to 1/2 cup, stirring occasionally, 15 minutes. Add broth; boil until reduced to 3/4 cup, 30 minutes. Set aside.",
        "Using small knife, cut off peel and white pith from 4 oranges. Working over bowl, cut between membranes to release segments. (Sauce and oranges can be prepared 6 hours ahead. Cover separately; chill.)",
        "Using small knife, score duck skin (do not pierce meat) in crosshatch pattern. Sprinkle duck with salt and pepper. Heat heavy large skillet over medium-high heat. Place duck breasts skin side down in skillet. Cook until brown and crisp, about 8 minutes. Turn duck and cook to desired doneness, about 10 minutes longer for medium-rare. Transfer to cutting board. Let stand 10 minutes.",
        "Meanwhile, bring sauce to simmer. Add butter and 1 tablespoon grated orange peel; whisk just until butter melts. Drain orange segments and mix into sauce. Set aside.",
        "Slice duck breasts crosswise on diagonal. Arrange on 4 plates. Spoon orange segments with sauce alongside. Sprinkle with remaining peel."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "2 tablespoons water",
        "2 tablespoons Sherry wine vinegar",
        "1 1/2 cups fresh orange juice",
        "2 tablespoons minced shallots",
        "1 1/2 cups canned low-salt chicken broth",
        "4 large oranges",
        "2 1-pound boneless Muscovy duck breast halves, thawed if frozen",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 tablespoons grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Citrus",
        "Duck",
        "Poultry",
        "Fall"
    ],
    "title": "Duck a l'Orange",
    "url": "http://www.epicurious.com/recipes/food/views/duck-a-lorange-102145"
}
