{
    "directions": [
        "Arrange a rack in middle of oven; preheat to 425°F. Brush a foil- or parchment-lined baking sheet with butter; set springform ring on top.",
        "Toast caraway in a small skillet over medium heat until fragrant, about 1 minute. Let cool. Place in a resealable plastic bag; crush with a rolling pin or bottom of a skillet. Place in a large bowl. Add duck fat, 2 tablespoons butter, 1 teaspoon salt, and pepper. Add potatoes; toss to coat.",
        "Arrange 1/4 of potatoes in an even layer inside ring on baking sheet, overlapping as needed. Toss onion in a large bowl with 1 tablespoon melted butter. Arrange 1/3 of onion over potatoes. Repeat layers twice more, finishing with a layer of potatoes. Carefully remove ring.",
        "Bake until potatoes are tender, about 45 minutes. Brush with 1 tablespoon butter. Bake until edges of potatoes are deep golden and top is crisp, 5-10 minutes longer.",
        "Run a thin spatula under galette to loosen from foil. Slide onto a platter. Season with salt, if desired."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) unsalted butter, melted, divided, plus more for pan",
        "1/2 teaspoon caraway seeds",
        "2 tablespoons rendered duck or bacon fat, melted",
        "1 teaspoon (or more) kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 pounds medium Yukon Gold potatoes, unpeeled, cut into 1/8\"-thick slices with a mandoline or V-slicer",
        "1 small sweet onion (such as Maui), very thinly sliced",
        "Ingredient info: Rendered duck fat can be found at better supermarkets and at specialty foods stores and dartagnan.com.",
        "Special equipment: The outer ring from a 9\"-diameter springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Winter",
        "Christmas Eve",
        "Caraway",
        "Mandoline",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Duck Fat-Potato Galette with Caraway and Sweet Onions",
    "url": "http://www.epicurious.com/recipes/food/views/duck-fat-potato-galette-with-caraway-and-sweet-onions-368933"
}
