{
    "directions": [
        "Whisk soy sauce and Sherry in medium bowl to blend. Using sharp knife, make diagonal cuts at 1/2-inch intervals in duck skin (not through meat). Place duck, skin side up, in glass baking dish. Pour marinade over. Cover duck with plastic wrap and refrigerate at least 2 hours and up to 6 hours.",
        "Bring cherries, chicken stock, beef stock, Port and thyme sprig to boil in heavy medium saucepan over high heat. Simmer until mixture is reduced to 1/2 cup, about 15 minutes.",
        "Meanwhile, heat heavy large skillet over medium heat. Remove duck from marinade. Add duck breasts, skin side down, to skillet. Cook until skin is crispy, about 10 minutes. Turn duck over and continue cooking to desired doneness, about 5 minutes for medium. Transfer duck to work surface.",
        "Add cornstarch mixture to Port-cherry sauce. Bring to simmer, whisking constantly. Add butter 1 piece at a time, whisking until butter is melted before adding next piece. Season sauce to taste with salt and pepper.",
        "Slice duck breasts thinly on diagonal and fan out on plates. Spoon Port-cherry sauce over duck and serve."
    ],
    "ingredients": [
        "1 cup soy sauce",
        "1 cup Sherry",
        "4 6-ounce duck breast halves",
        "12 frozen dark sweet cherries, thawed, halved",
        "1 cup chicken stock or canned low-salt chicken broth",
        "1 cup beef stock or canned beef broth",
        "1/2 cup ruby Port",
        "1 fresh thyme sprig",
        "1 teaspoon cornstarch dissolved in 2 teaspoons water",
        "1/4 cup (1/2 stick) butter, cut into 1/2-inch pieces, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Sauté",
        "Cherry",
        "Port",
        "Sherry",
        "Winter",
        "Thyme",
        "Soy Sauce"
    ],
    "title": "Duck with Port-Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/duck-with-port-cherry-sauce-104189"
}
