{
    "directions": [
        "Heat heavy large pot over medium-high heat until hot, about 3 minutes. Sprinkle duck with 1 teaspoon salt and 1/2 teaspoon pepper. Add to pot, skin side down, and sear until golden brown, about 8 minutes per side. Using tongs, transfer duck to plate.",
        "Add vegetable oil, then flour to drippings in pot; stir with wooden spoon to blend well. Reduce heat to medium and stir constantly until roux is chocolate-brown color, about 25 minutes. (If roux is still light brown after 20 minutes, increase heat to medium-high for final 5 minutes.) Add mushrooms, onion, celery, bell pepper, and garlic to roux and cook until mushrooms and vegetables are soft, stirring frequently, about 4 minutes. Add stout; stir to blend. Add chicken broth, Emeril's Original Essence, bay leaves, thyme, cayenne, and remaining 2 teaspoons salt; stir to blend well. Return duck pieces to pot. Increase heat and bring to boil. Reduce heat to medium-low; simmer uncovered until duck is tender, skimming foam from surface and stirring occasionally, about 1 1/2 hours.",
        "Using tongs, transfer duck to plate; cool until easy to handle, about 20 minutes. Remove meat from bones; discard bones and skin. Cut meat into 1-inch pieces. Spoon fat off top of gumbo. Return meat to gumbo; season to taste with salt and pepper. (Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold. Cover and keep refrigerated. Bring to simmer before continuing.)",
        "Divide cooked white rice among 10 bowls. Ladle gumbo over. Sprinkle with green onions and parsley and serve.",
        "*A dried herb and spice blend available at some specialty foods stores and in the spice section of some supermarkets. A combination of 1 teaspoon salt, 1 teaspoon dried oregano, 1/2 teaspoon dried thyme, 1 teaspoon onion powder, 1 teaspoon paprika, and 1/2 teaspoon cayenne can be substituted"
    ],
    "ingredients": [
        "1 4- to 5-pound duck, thawed if frozen, excess fat removed, backbone removed, duck quartered",
        "3 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1/4 cup vegetable oil",
        "1 cup all purpose flour",
        "1 1/2 pounds assorted wild mushrooms (such as chanterelle, oyster, and stemmed shiitake), cut into1-inch pieces",
        "1 1/2 cups chopped onion",
        "3/4 cup finely chopped celery",
        "3/4 cup finely chopped red bell pepper",
        "7 garlic cloves, minced",
        "1 12-ounce bottle stout",
        "6 cups low-salt chicken broth",
        "4 teaspoons Emeril's Original Essence*",
        "2 bay leaves",
        "1 teaspoon dried thyme",
        "1/4 teaspoon cayenne pepper",
        "5 cups freshly cooked white rice",
        "1/2 cup chopped green onions",
        "1/2 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beer",
        "Duck",
        "Mushroom",
        "Rice",
        "Vegetable",
        "Sauté",
        "Stew",
        "Fall"
    ],
    "title": "Duck and Wild Mushroom Gumbo",
    "url": "http://www.epicurious.com/recipes/food/views/duck-and-wild-mushroom-gumbo-108579"
}
