{
    "directions": [
        "Preheat oven to 350°F. Finely grind 2 teaspoons fresh or 1 teaspoon dried lavender blossoms, thyme, sea salt and peppercorns in spice grinder or with mortar and pestle. Remove fat deposits and giblets from duck cavity, reserving liver. Trim excess skin and fat from neck area. Rinse inside and out; pat dry. Cutting through skin and fat (but not flesh) of duck breasts, score in crisscross pattern. Rub inside and outside of duck with herb mixture; return duck liver to cavity.",
        "Place duck, breast up, on rack in roasting pan. Roast 2 hours. Remove from oven. Increase oven temperature to 375°F. Transfer duck to plate. Pour pan juices into 4-cup glass measuring cup; spoon off fat. Return juices and 1 tablespoon fat to pan. Add broth and wine. Return duck to pan. Brush with 2 tablespoons honey.",
        "Roast duck 20 minutes, basting once with pan juices. Brush with 2 tablespoons honey; sprinkle with 1 teaspoon fresh or 1/2 teaspoon dried lavender. Roast duck until deep golden and thermometer inserted into innermost part of thigh registers 180°F, about 5 minutes longer.",
        "Transfer duck to platter. Remove liver; mash finely in small bowl. Spread liver over baguette slices. Add 1 teaspoon fresh or 1/2 teaspoon dried lavender to roasting pan. Place over medium heat. Boil juices until thick enough to coat spoon, whisking often, 5 minutes. Season with salt and pepper. Transfer to bowl. Slice duck and serve with baguette slices and pan juices."
    ],
    "ingredients": [
        "4 teaspoons (packed) fresh lavender blossoms or 2 teaspoons dried",
        "1 tablespoon fresh thyme leaves",
        "1 1/2 teaspoons coarse sea salt",
        "1/4 teaspoon black peppercorns",
        "1 6- to 6 1/2-pound duck, fresh or frozen, thawed",
        "1 cup canned low-salt chicken broth",
        "3 tablespoons dry red wine",
        "4 tablespoons lavender honey or orange flower honey",
        "4 toasted baguette slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Poultry",
        "Roast",
        "Fall",
        "Spring",
        "Winter",
        "Honey"
    ],
    "title": "Duck with Honey",
    "url": "http://www.epicurious.com/recipes/food/views/duck-with-honey-101622"
}
