{
    "directions": [
        "Cut breasts from duck and discard skin and all visible fat. Reserve legs and carcass for another use.",
        "Brown duck neck (halved if necessary) in a dry 2- to 3-quart heavy saucepan over moderate heat, turning once, about 10 minutes total. Transfer to a plate. Pat duck breasts dry and season with salt and pepper, then add to pan and brown over moderate heat, turning once, about 8 minutes total. Transfer to plate with duck neck.",
        "Add Armagnac to pan and deglaze by boiling, scraping up any brown bits, until most of liquid is evaporated. Add 2 cups water, shallots, garlic, sliced carrot, thyme, bay leaf, kosher salt, peppercorns, and duck breasts and neck with any juices on plate and cook at a bare simmer, covered, 1 hour. Discard neck, then transfer breasts to a plate and cool. Shred duck meat, then chop.",
        "Pour broth through a sieve into a bowl, discarding solids. (If liquid measures less than 2 cups, add water.) Return to cleaned pan and add chopped carrot. Simmer, covered, until carrot is tender, 3 to 5 minutes.",
        "While carrot is cooking, sprinkle gelatin over remaining 2 tablespoons water in a cup and let soften 1 minute.",
        "Stir softened gelatin into hot broth until dissolved, then stir in duck meat, parsley, and salt and pepper to taste. Ladle into crocks (you'll have about 3 cups total) and chill, covered, until set, 3 to 4 hours. Let stand at room temperature 20 minutes before serving."
    ],
    "ingredients": [
        "1 (5- to 5 1/2 pound) Pekin duck (sometimes called Long Island duck), including neck",
        "2 tablespoons Armagnac or Cognac",
        "2 cups plus 2 tablespoons water",
        "3 medium shallots, sliced",
        "2 garlic cloves, halved",
        "2 carrots, 1 cut into 1/4-inch-thick slices and 1 finely chopped",
        "4 sprigs fresh thyme",
        "1 large bay leaf (not California)",
        "1 3/4 teaspoons kosher salt",
        "1/2 teaspoon whole black peppercorns",
        "1 1/2 teaspoons unflavored gelatin",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "Accompaniment: 1/3-inch-thick baguette slices, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Cocktail Party",
        "Bastille Day",
        "Cognac/Armagnac",
        "Carrot",
        "Chill",
        "Thyme",
        "Shallot",
        "Simmer",
        "Gourmet"
    ],
    "title": "Duck Rillettes",
    "url": "http://www.epicurious.com/recipes/food/views/duck-rillettes-104873"
}
