{
    "directions": [
        "Wash sliced leeks and pat dry. Remove duck meat (with skin) from bones in large pieces, reserving meat and bones separately.",
        "Simmer prunes and Armagnac in a small saucepan until Armagnac is absorbed, about 3 minutes.",
        "Heat rendered duck fat in a 12-inch heavy skillet over medium heat until it shimmers, then cook mushrooms with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring occasionally, until golden brown, 4 to 5 minutes. Transfer to a bowl.",
        "Heat oil in skillet over medium-high heat until it shimmers, then cook leeks with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring once or twice, until beginning to soften and brown on edges, about 6 minutes. Transfer to bowl with mushrooms.",
        "Bring wine, bay leaf, thyme, cloves, and zests to a boil in skillet, scraping up any brown bits. Add reserved bones, then broth and 1 cup water and simmer, covered, 15 minutes. Add potatoes, leeks, and mushrooms (with any juices) and simmer, covered, 10 minutes. Add prunes (with any juices), remaining cup water, 1/2 teaspoon salt, and 1/4 teaspoon pepper and simmer, covered, until potatoes are tender and liquid is slightly thickened, about 5 minutes. (If liquid hasn't thickened, remove lid and boil.)",
        "Meanwhile, cook duck meat, skin side down, covered, in a large heavy nonstick skillet over medium-low heat until skin is well browned and crisp and meat is heated through, about 15 minutes.",
        "Discard bones and bay leaf from ragout, then season with salt and pepper and serve topped with duck confit."
    ],
    "ingredients": [
        "2 large leeks (white and pale green parts only), halved lengthwise, then cut into 1-inch pieces (4 cups)",
        "4 Confit Duck Legs at room temperature",
        "3/4 cup pitted prunes, coarsely chopped",
        "1/4 cup Armagnac or Cognac",
        "2 tablespoons rendered duck fat or extra-virgin olive oil",
        "1/2 pound cremini mushrooms, trimmed and halved lengthwise",
        "2 tablespoons extra-virgin olive oil",
        "1 cup dry white wine",
        "1 Turkish or 1/2 California bay leaf",
        "3 large thyme sprigs",
        "2 whole cloves",
        "6 strips (3- by 1-inch) lemon zest",
        "4 strips (4- by 1-inch) orange zest",
        "1 cup reduced-sodium chicken broth",
        "2 cups water, divided",
        "1 pound (1- to 1 1/2-inch) Yukon Gold potatoes, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Duck",
        "Mushroom",
        "Potato",
        "Dinner",
        "Prune",
        "Cognac/Armagnac",
        "Leek",
        "White Wine",
        "Winter",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Duck Confit with Potato Leek Ragout",
    "url": "http://www.epicurious.com/recipes/food/views/duck-confit-with-potato-leek-ragout-243566"
}
