{
    "directions": [
        "Preheat the oven to 325°F. Generously spray an 8-inch square baking pan or an 8x10-inch baking pan with nonstick baking spray.",
        "Place the chocolate in a microwave-safe bowl and nuke it in about 45-second intervals, stirring each time, until it’s completely melted. Set it aside to cool for 20 minutes or so.",
        "Add the butter and the sugar to the bowl of an electric mixer fitted with the paddle attachment and cream them together until they’re light and fluffy.",
        "Add the eggs, one at a time, beating well after each addition.",
        "With the mixer on low, slowly drizzle in the chocolate until it’s all combined. Add the flour and the vanilla. And mix until it’s all combined, scraping the sides of the bowl halfway through.",
        "Spread the batter into the greased pan.",
        "Next, crack open the can of dulce de leche and place half of it in a glass bowl. Warm it in the microwave for 30 to 45 seconds, just to make it a little more stirrable.",
        "Drop large dollops of dulce de leche on the surface of the batter then use a knife to slowly swirl it through the brownie batter. Don’t drag the knife sideways through the batter; hold it so the thin side of the knife leads the way.",
        "Bake the brownies for 45 to 50 minutes, or until the center is almost totally set.",
        "Let the brownies cool in the pan for 15 minutes then use a very sharp serrated knife to cut the brownies into squares and place them on a pretty cake stand."
    ],
    "ingredients": [
        "Nonstick baking spray",
        "5 (1-ounce) squares unsweetened chocolate",
        "1 cup (2 sticks) butter, softened",
        "2 cups sugar",
        "4 eggs",
        "1 1/4 cups all-purpose flour",
        "1 tablespoon vanilla extract",
        "1/2 (14-ounce) can dulce de leche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dessert",
        "Cinco de Mayo",
        "Brownie",
        "Butterscotch/Caramel",
        "Chocolate",
        "Bake",
        "Christmas"
    ],
    "title": "Dulce de Leche Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/dulce-de-leche-brownies"
}
