{
    "directions": [
        "Place ground veal in a skillet over medium heat. Cook, stirring to crumble, until evenly browned. Set aside.",
        "Melt butter in a saucepan over low heat. Stir in flour until smooth, and cook for about 2 minutes. Gradually stir in milk, then chicken broth to make a smooth thick sauce. Add the cooked ground veal, and season with paprika, chili powder, curry powder, salt, pepper , Worcestershire sauce, and parsley. Stir to blend well. Remove from heat, and set aside to cool to room temperature.",
        "When the meat mixture is cooled and slightly firm, shape into cylinders 3 to 4 inches long, and 1 1 /2 inches wide. If you wish, press a strip of the spiced Gouda cheese into the center, making sure it is completely surrounded.  In a small bowl, whisk together the egg and water. Place bread crumbs on a plate or tray. Coat croquettes with flour, then dip in the beaten egg mixture, then roll the croquettes in the crumbs to coat. Repeat the coating process if a thicker breading is desired.",
        "Heat oil in a large skillet over medium-high heat. When oil is hot, fry croquettes until golden brown on all sides. If you have a deep-fryer, they can be deep-fried instead. Remove to paper towels to drain, and serve hot."
    ],
    "ingredients": [
        "1 pound lean ground veal",
        "2 tablespoons butter",
        "4 tablespoons all-purpose flour",
        "1/2 cup milk",
        "1/2 cup chicken broth",
        "1/2 teaspoon paprika",
        "1/2 teaspoon chili powder (optional)",
        "1 teaspoon curry powder (optional)",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon finely chopped fresh parsley",
        "8 ounces spiced Gouda cheese, cut into strips (optional)",
        "1 egg",
        "1/2 cup all-purpose flour",
        "2 tablespoons water",
        "1 1/2 cups seasoned dry bread crumbs",
        "1 cup oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dutch Croquetten",
    "url": "http://allrecipes.com/recipe/68583/dutch-croquetten/"
}
