{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Generously grease a 10-inch tube pan with a removable bottom.",
        "Combine rolled oats, flax seeds, and 1/2 cup brown sugar in a bowl. Stir flour, cinnamon, baking powder, baking soda, and salt together in a separate bowl. Beat butter in a third large bowl with an electric mixer until creamy; beat 1/2 cup brown sugar and white sugar with butter until mixture is fluffy, about 5 minutes. Beat eggs, one at a time, into butter mixture, incorporating the first egg before adding the next one. Stir in vanilla extract.",
        "Stir flour mixture into butter mixture in several additions, alternating with sour cream and beating well after each addition, until batter is smooth. Stir 1 chopped apple into batter. Pour half the batter into prepared tube pan and spread 2 apples cut in slices over batter. Sprinkle half the oat mixture over apple slices. Pour remaining batter into tube pan and sprinkle remaining oat mixture over top of cake.",
        "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 40 minutes. Let cake stand in the pan for 30 minutes. Loosen sides of cake with a thin spatula or knife. Let cake cool completely and lift from pan."
    ],
    "ingredients": [
        "1/2 cup rolled oats",
        "2 tablespoons flax seeds",
        "1/2 cup brown sugar",
        "2 cups all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup butter, softened",
        "1/2 cup brown sugar",
        "1/2 cup white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1 cup sour cream",
        "1 apple - peeled, cored, and chopped",
        "2 apples - peeled, cored, and thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dylan's Apple Cream Coffee Cake",
    "url": "http://allrecipes.com/recipe/229621/dylans-apple-cream-coffee-cake/"
}
