{
    "directions": [
        "Prepare the almonds the day before. Bring 6 cups of water to a boil. Remove from heat, and add the almonds. Let the almonds soak in water for about 5 minutes, then drain and peel. Spread the almonds on baking sheets, and bake at 200 degrees F(95 degrees C) until completely dry and toasted. This takes several hours, and needs to be prepared ahead. Be careful not to burn the nuts, as this will give a bitter taste to the filling.",
        "Combine 1 cup sugar and 1 cup water in a saucepan, and bring to a boil. Add 1 teaspoon lemon juice, reduce heat to low, and let it simmer until syrupy, about 30 to 40 minutes. Stir in orange blossom water, and remove from heat. Set sugar syrup aside.",
        "Combine flour and salt in a large mixing bowl. Make a hole in the center, and pour oil, egg, 1/2 teaspoon lemon juice, and 1 tablespoon orange blossom water into the center. Mix with fingers until the dough resembles coarse crumbs. Gradually sprinkle with warm water while mixing until the dough becomes soft and pliable. Divide into 4 equal portions. Cover dough with a wet cloth, and set aside.",
        "In a food processor, finely grind the almonds. Measure 3 cups of the finely ground almonds into a mixing bowl, and stir together with 1 cup sugar, baking powder, vanilla powder, lemon zest, and 2 tablespoons orange flower water. Mix in three eggs one at a time, stirring constantly; mix until you get a sticky, paste-like mixture.",
        "Sprinkle cornstarch on the rolling surface  to prevent sticking. Roll each portion of dough very thinly, 1 to 2 millimeters (1/16 inch). Cut the rolled dough into circles of about 10 centimeters (4 inches) in diameter each. Lightly wipe the surface of each circle with cornstarch, and fit into a tart mold, cornstarch side down to prevent sticking. Gently press the dough onto the sides and bottom of the mold, and trim extra dough from around the rim. Fill three quarters of each mold with the almond filling.",
        "Bake on the top shelf at 350 degrees F (175 degrees C) for 20 to 25 minutes, or until the surface of the tart is golden and the dough is firm. Remove the tarts from the molds as soon as they come out of the oven.  Dip each tart in the sugar syrup while still hot. Stick a pine nut into the middle of each tart for decoration. Place on a wire rack to drain."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2688&h=1407&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1705279.jpg",
    "ingredients": [
        "1 cup white sugar",
        "1 cup water",
        "1 teaspoon fresh lemon juice",
        "2 tablespoons orange flower water",
        "2 cups all-purpose flour",
        "2 tablespoons vegetable oil",
        "1  egg",
        "½ teaspoon fresh lemon juice",
        "1 pinch salt",
        "1 tablespoon orange flower water",
        "4 cups raw almonds",
        "1 cup sugar",
        "3  eggs",
        "½ teaspoon baking powder",
        "1 teaspoon vanilla powder",
        "1  lemon, zested",
        "2 tablespoons orange flower water",
        "cornstarch, for rolling out the dough",
        "pine nuts, for decoration"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Dziriat (Algerian Almond Tarts)",
    "url": "http://allrecipes.com/recipe/69501/dziriat-algerian-almond-tarts/"
}