{
    "directions": [
        "Heat 2 tablespoons olive oil in heavy large nonstick skillet over high heat. Add squash; sprinkle with sea salt and sauté until beginning to brown, stirring often, about 5 minutes. Reduce heat to medium, add chopped sage, and cook until just tender, stirring often, about 8 minutes. Sprinkle Sherry wine vinegar over; toss to incorporate. Transfer squash to plate. Wipe skillet clean.",
        "Heat remaining 2 tablespoons olive oil in same skillet over high heat. Add chopped onions, sprinkle with sea salt, and sauté until onions are soft and beginning to brown, about 6 minutes. Reduce heat to low, cover, and cook until onions are soft and deep golden brown, stirring occasionally, about 20 minutes; set aside. Bring 31⁄2 cups water and vegetable broth to simmer in large saucepan. Cover and keep warm over low heat.",
        "Add arborio rice to onions in skillet. Stir until rice is slightly translucent, about 4 minutes. Add Sherry; stir until absorbed. Add 1 cup warm broth mixture; stir until almost all liquid is absorbed, about 3 minutes. Continue adding broth mixture by cupfuls until rice is just tender but still firm to bite and risotto is creamy, stirring almost constantly and adding squash after 15 minutes, about 20 minutes total. Season with salt and pepper. Stir in 6 tablespoons toasted pine nuts. Transfer squash risotto to large wide serving bowl. Sprinkle remaining toasted pine nuts over risotto.",
        "Top risotto with shaved Parmesan and crumbled Pancetta."
    ],
    "ingredients": [
        "4 tablespoons olive oil, divided",
        "1 2 1/2- to 3-pound kabocha or butternut squash, peeled, seeded, cut into 1/2-inch cubes (about 6 generous cups)",
        "Sea salt",
        "1 tablespoon finely chopped fresh sage",
        "1 tablespoon Sherry wine vinegar",
        "2 onions, chopped (about 3 cups)",
        "3 1/2 cups good-quality canned vegetable broth (such as Swanson)",
        "1 1/2 cups arborio rice or medium-grain rice",
        "1/4 cup medium-dry Sherry or Marsala",
        "3/4 cup pine nuts, toasted, divided",
        "Shaved Parmesan cheese (optional)",
        "4 ounces crisply cooked coarsely crumbled thinly sliced pancetta (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Pine Nut",
        "Squash",
        "Winter",
        "Family Reunion",
        "Healthy",
        "Low Cholesterol",
        "Sage"
    ],
    "title": "Kabocha Squash Risotto with Sage and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/kabocha-squash-risotto-with-sage-and-pine-nuts-363710"
}
