{
    "directions": [
        "Place chicken thighs, drumsticks, and breasts into a large pan and pour in 6 cups water; stir in 1 teaspoon salt, 1/2 cup chopped onion, bay leaves, and cinnamon sticks. Bring to a boil, reduce heat to low, and simmer until chicken is tender, about 1 1/2 hours. Remove chicken, strain the broth, and retain 4 cups of broth.",
        "While chicken is simmering, rinse basmati rice thoroughly until water runs clear. Place into a bowl and mix in 1 1/2 teaspoon salt, cardamom pods, whole cloves, nutmeg, baharat spice mix, 1/4 teaspoon ground cinnamon, and black pepper. Let the rice sit while you complete remaining steps.",
        "Soak golden raisins with 1/3 cup water in a small bowl. Heat 2 tablespoons vegetable oil with 1 tablespoon butter in a large pan. Cook and stir 2 cups onion with tomatoes until vegetables soften, about 10 minutes. Mix in the seasoned rice and cook until rice grains are hot, 2 to 3 minutes; pour in reserved 4 cups of chicken broth. Bring to a boil. Mix in soaked golden raisins. Place 3 tablespoons butter into the pan, let melt, and turn heat to low; simmer  covered until rice is tender, about 45 minutes.",
        "Tear chicken meat off the bones into bite-size pieces. Spread the rice onto a large serving platter and distribute cooked chicken over the rice to serve."
    ],
    "ingredients": [
        "2 chicken thighs",
        "2 chicken drumsticks",
        "2 chicken breast halves",
        "6 cups water",
        "1/2 cup chopped onion",
        "1 teaspoon salt",
        "2 bay leaves",
        "2 cinnamon sticks",
        "2 cups basmati rice",
        "1 1/2 teaspoons salt",
        "6 whole cardamom pods",
        "10 whole cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon baharat (Arabic 7-spice mix)",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground black pepper",
        "1/2 cup golden raisins",
        "1/3 cup water",
        "2 tablespoons vegetable oil",
        "1 tablespoon butter",
        "2 cups chopped onions",
        "1 1/2 cups very ripe tomatoes, chopped",
        "3 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kabsa",
    "url": "http://allrecipes.com/recipe/228295/kabsa/"
}
