{
    "directions": [
        "Stir together 1/3 cup cream, sugar, lime leaves, zest, and a pinch of salt in a small heavy saucepan and bring to a bare simmer over moderately low heat, stirring until sugar is dissolved. Remove from heat and let steep, covered, 25 minutes.",
        "Sprinkle gelatin over water and lime juice in a bowl and let soften 1 minute. Return cream mixture to a simmer, then pour through a very fine sieve into gelatin, pressing on and discarding solids. Stir until gelatin is dissolved, about 1 minute. Gradually add yogurt, whisking, and chill, covered, 30 minutes. (Mixture will not be gelled.)",
        "Beat remaining 1/3 cup cream in a chilled bowl with whisk until it just holds soft peaks. Fold into yogurt mixture and chill, covered, at least 8 hours. (Mousse will be softly set.)",
        "Blend honeydew, Midori, lime juice, and a pinch of salt in a blender at high speed until smooth, about 1 minute. Pour through a fine sieve lined with dampened cheesecloth into a bowl. Let drain, undisturbed, 30 minutes, then discard foam remaining in cheesecloth.",
        "Sprinkle gelatin over water in a small saucepan and let soften 1 minute. Add 2 tablespoons melon juice and sugar, then cook over low heat, stirring, until gelatin and sugar are dissolved, 1 to 2 minutes. Gradually whisk in 1 1/8 cups melon juice (reserve remainder for another use if desired), then transfer to a bowl and chill, covered, at least 8 hours. (Honeydew water will be barely set.)",
        "Spoon honeydew water onto 4 dessert plates and top with shiso leaves. Spoon mousse onto leaves."
    ],
    "ingredients": [
        "2/3 cup chilled heavy cream",
        "1/4 cup sugar",
        "3 (2- by 1 1/4-inch) fresh or frozen kaffir lime leaves",
        "1 1/2 teaspoons finely grated fresh lime zest",
        "3/4 teaspoon unflavored gelatin (from a 1/4-ounce envelope)",
        "1 tablespoon water",
        "1/2 teaspoon fresh lime juice",
        "1 cup plain whole-milk yogurt",
        "3 cups (1-inch) pieces honeydew flesh (2 pounds)",
        "2 tablespoons Midori (melon liqueur)",
        "1 tablespoon fresh lime juice",
        "1 teaspoon unflavored gelatin",
        "1 tablespoon water",
        "2 tablespoons sugar",
        "Garnish: 4 fresh green shiso leaves",
        "Accompaniment: chile lime tuiles",
        "Special equipment: cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Mixer",
        "Fruit",
        "Dessert",
        "Yogurt",
        "Lime",
        "Honeydew",
        "Midori",
        "Summer",
        "Chill",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Kaffir Lime Mousse with Honeydew Water",
    "url": "http://www.epicurious.com/recipes/food/views/kaffir-lime-mousse-with-honeydew-water-107037"
}
