{
    "directions": [
        "Whisk first 3 ingredients and pinch of salt in medium saucepan. Gradually whisk in 1 cup water, whisking until smooth. Cook over medium-high heat until sugar dissolves and mixture just begins to boil, whisking often, about 3 minutes. Remove pan from heat. Add 1 1/2 cups water and half and half; whisk to blend. Transfer to pitcher. Pour espresso mixture into ice cube trays, filling cubes almost to top (mixture will make about 45 ice cubes). Freeze espresso mixture in trays. DO AHEAD: Can be made 1 month ahead. Store espresso ice cubes in resealable plastic bag and keep frozen.",
        "Using electric mixer, beat cream, brown sugar, vanilla, and pinch of salt in medium bowl until peaks form. Cover; chill.",
        "Place 6 glass coffee mugs or other glasses in freezer 15 minutes. Working in 3 batches, place 14 espresso ice cubes and 1/4 cup Kahl&eucate;a in processor. Blend until thick and smooth, about 30 seconds. Divide between 2 chilled mugs; place in freezer. Repeat 2 more times with espresso ice cubes, Kahlúa, and chilled mugs. DO AHEAD: Can be made 1 hour ahead. Keep frozen.",
        "Spoon sweetened whipped cream atop frozen mocha lattes and serve."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "5 1/2 teaspoons instant espresso powder",
        "4 teaspoons natural unsweetened cocoa powder",
        "2 pinches of salt",
        "2 1/2 cups water, divided",
        "2 cups half and half",
        "3/4 cup chilled heavy whipping cream",
        "1 1/2 tablespoons (packed) golden brown sugar",
        "1/2 teaspoon (scant) vanilla extract",
        "3/4 cup Kahlúa or other coffee-flavored liqueur",
        "Special equipment: Ice cube trays (enough to make about forty-five 1 3/4 x 1 3/4 x 1 1/4-inch ice cubes)",
        "Even easier: Instead of making whipped cream, try and organic all-natural aerosol whipped cream, like Clover Farms."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Alcoholic",
        "Blender",
        "Food Processor",
        "Backyard BBQ",
        "Frozen Dessert",
        "Kahlúa"
    ],
    "title": "Kahlúa-Spiked Frozen Mocha Lattes",
    "url": "http://www.epicurious.com/recipes/food/views/kahlua-spiked-frozen-mocha-lattes-360236"
}
