{
    "directions": [
        "Cut 1/3 inch off the top of each onion, peel the onions, and scoop out the centers with a melon-ball cutter, forming 1/3-inch-thick shells, with the bottoms slightly thicker, and reserving 1/2 cup of the scooped-out onion. In a steamer set over boiling water steam the onion shells, covered, for 10 to 15 minutes, or until they are tender.",
        "Rinse and drain the kale and mince the reserved onion. In a large skillet cook the garlic in the oil over moderate heat, stirring, until it is pale golden, add the red pepper flakes and the minced onion, and cook the mixture, stirring, until the onion is softened. Add the kale, 1/2 cup of the water, and salt and pepper to taste and cook the mixture, covered, stirring occasionally and adding 1/2 cup of the remaining water every 5 minutes, for 15 minutes, or until the kale is just tender. (If there is excess liquid, boil the mixture, uncovered, until the liquid is evaporated.) Stir the cornstarch mixture, add it to the kale mixture with the pimiento, and simmer the mixture, stirring, for 1 minute, or until it is thickened. Remove the skillet from the heat, stir in the Parmesan and salt and pepper to taste, and fill the onion shells with the kale mixture. The stuffed onions may be made 1 day in advance, kept covered and chilled, and reheated."
    ],
    "ingredients": [
        "8 medium onions (about 3 pounds), the root ends trimmed so the onions can stand upright",
        "3/4 pound kale, stems discarded and the leaves rinsed well and shredded",
        "3 garlic cloves, minced",
        "2 tablespoons olive oil",
        "1/8 teaspoon dried hot red pepper flakes",
        "1 1/2 cups water",
        "1 tablespoon cornstarch dissolved in 2/3 cup chicken broth",
        "3 tablespoons chopped drained bottled pimiento",
        "3 tablespoons freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Side",
        "Steam",
        "Thanksgiving",
        "High Fiber",
        "Parmesan",
        "Kale",
        "Chill",
        "Gourmet"
    ],
    "title": "Kale-Stuffed Onions",
    "url": "http://www.epicurious.com/recipes/food/views/kale-stuffed-onions-13350"
}
