{
    "directions": [
        "Heat broiler. Broil ginger in its skin, turning once, until very dark brown and beginning to scorch in places and a paring knife passes through the center with relative ease, 40–50 minutes (if skin is getting too dark before flesh is tender, turn down the heat or move to the oven). Let cool; slice (leave on the skin).",
        "Pulse ginger, chile, garlic, fish sauce, sugar, oil, and 2 Tbsp. water in a food processor, adding additional water by tablespoonfuls if needed, until a smooth paste forms.",
        "Toss kale and 1/4 cup dressing in a large bowl to coat; massage with your fingers until kale is slightly softened.",
        "Toss English and Persian cucumbers, onion, lime juice, and sugar in a medium bowl to combine; season generously with salt. Let sit 10 minutes to allow cucumbers and onion to soften slightly.",
        "Add cucumber mixture to bowl with kale and toss to combine, adding additional dressing if desired. Serve topped with cilantro and fried onions.",
        "Dressing can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "8 ounces fresh ginger",
        "1 green or red Thai chile",
        "1 garlic clove",
        "3 tablespoons fish sauce",
        "3 tablespoons sugar",
        "3 tablespoons vegetable oil",
        "1 bunch small Red Russian kale, ribs and stems removed, leaves torn into bite-size pieces",
        "1 English hothouse cucumber, very thinly sliced",
        "3 Persian cucumbers, very thinly sliced",
        "1 small red onion, thinly sliced",
        "2 tablespoons fresh lime juice",
        "2 teaspoons sugar",
        "Kosher salt",
        "1 bunch cilantro, coarsely chopped",
        "1/4 cup store-bought fried onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Salad",
        "Kale",
        "Cucumber",
        "Ginger",
        "Fall",
        "Chile Pepper"
    ],
    "title": "Kale and Cucumber Salad With Roasted Ginger Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/kale-and-cucumber-salad-with-roasted-ginger-dressing"
}
