{
    "directions": [
        "Cut stems from center of each kale leaf; discard stems. Bring large pot of salted water to boil. Add kale leaves and cook just until kale is tender but still bright green, 3 to 4 minutes. Drain well. Coarsely chop kale.",
        "Preheat oven to 400°F. Arrange baguette slices in single layer on rimmed baking sheet; brush slices on top side with 2 tablespoons oil. Sprinkle lightly with salt and pepper. Toast in oven until pale golden, about 12 minutes. Cool toasts on baking sheet. DO AHEAD: Kale and baguette toasts can be made 4 hours ahead. Let stand at room temperature.",
        "Heat remaining 3 tablespoons oil in large skillet over medium-high heat. Add garlic and anchovies; stir 1 minute. Add chopped kale and sauté until heated through, 3 to 4 minutes. Season to taste with salt and pepper.",
        "Mound kale mixture atop toasted baguette slices, dividing equally. Top kale with cheese shavings. Arrange crostini on platter and serve.",
        "The bold flavors of this and the chicken liver crostini would be great with Prosecco, the Italian sparkler. We like the light, crisp-and affordable-Zardetto NV Prosecco Brut (Italy, $15).",
        "Also called Tuscan kale, dinosaur kale, lacinato kale, or cavolo nero, black kale has long, narrow, very dark green bumpy leaves; available at some supermarkets and farmers' markets."
    ],
    "ingredients": [
        "1 14-ounce bunch black kale*",
        "12 1/3-inch-thick diagonal baguette slices",
        "5 tablespoons extra-virgin olive oil, divided",
        "3 garlic cloves, thinly sliced",
        "2 oil-packed anchovy fillets, chopped",
        "1 ounce Pecorino Romano cheese, shaved with vegetable peeler into strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Appetizer",
        "Cocktail Party",
        "Low Cal",
        "Kale",
        "Low Cholesterol",
        "Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Kale and Pecorino Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/kale-and-pecorino-crostini-357511"
}
