{
    "directions": [
        "Cover beans with water by 2 inches in a pot and bring to a boil. Remove from heat and let stand, uncovered, 1 hour. Drain beans in a colander and rinse.",
        "Cook onions in oil in an 8-quart pot over moderately low heat, stirring occasionally, until softened, 4 to 5 minutes. Add garlic and cook, stirring, 1 minute. Add beans, broth, 1 quart water, cheese rind, salt, pepper, bay leaf, and rosemary and simmer, uncovered, until beans are just tender, about 50 minutes.",
        "While soup is simmering, brown sausage (if using) in batches in a heavy skillet over moderate heat, turning, then transfer to paper towels to drain.",
        "Stir carrots into soup and simmer 5 minutes. Stir in kale, sausage, and remaining quart water and simmer, uncovered, stirring occasionally, until kale is tender, 12 to 15 minutes. Season soup with salt and pepper."
    ],
    "ingredients": [
        "1 lb dried white beans such as Great Northern, cannellini, or navy",
        "2 onions, coarsely chopped",
        "2 tablespoons olive oil",
        "4 garlic cloves, finely chopped",
        "5 cups chicken broth",
        "2 qt water",
        "1 (3- by 2-inch) piece Parmigiano-Reggiano rind",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 bay leaf (not California)",
        "1 teaspoon finely chopped fresh rosemary",
        "1 lb smoked sausage such as kielbasa (optional), sliced crosswise 1/4 inch thick",
        "8 carrots, halved lengthwise and cut crosswise into 1/2-inch pieces",
        "1 lb kale (preferably lacinato), stems and center ribs discarded and leaves coarsely chopped",
        "Accompaniment:provolone toasts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Dinner",
        "Lunch",
        "Kale",
        "Carrot",
        "Fall",
        "Winter",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Kale and White Bean Soup",
    "url": "http://www.epicurious.com/recipes/food/views/kale-and-white-bean-soup-106153"
}
