{
    "directions": [
        "Preheat oven to 400°F. Using your hands, toss bread in a large bowl while drizzling with 1/2 cup oil, squeezing bread to help it absorb oil. Spread out on 2 rimmed baking sheets, dividing equally; set aside.",
        "Toast bread, stirring often and rotating baking sheets halfway through, until croutons are golden brown and crisp on the outside but still a little soft inside, about 20 minutes. Let cool; return to large bowl.",
        "Meanwhile, toast fennel seeds in a small skillet over medium heat, shaking pan often, until seeds are fragrant and light gold, 2-3 minutes. Let cool. Using a spice mill or a mortar and pestle, coarsely grind fennel seeds; set aside. Alternatively, crush seeds in a resealable freezer bag with bottom of a heavy skillet.",
        "Heat a large skillet over medium heat for 2 minutes. Add remaining 1/4 cup oil and butter. When butter is melted, add rosemary sprigs and chile; let sizzle in pan for 1 minute, then add crushed fennel seeds, fennel, onions, thyme, and garlic. Season with salt and pepper and sauté until vegetables are tender and lightly caramelized, 6-8 minutes. Discard rosemary sprigs and chile. Add vegetable mixture and Slow-Cooked Tuscan Kale to croutons.",
        "Boil wine in same skillet over mediumhigh heat until reduced by 3/4, 1-2 minutes. Add broth; bring to a boil. Add to crouton mixture; toss well. Season with salt and pepper. Add eggs; stir to distribute. Transfer to a 13x9x2\" baking dish. Cover with foil.",
        "Bake dressing until heated through, about 30 minutes (a knife inserted into the center should be hot to the touch). Remove foil and bake until bread is golden and crisped on top, 25-30 minutes longer."
    ],
    "ingredients": [
        "2 pounds country-style white bread, crusts removed, torn into 1\" pieces",
        "3/4 cup extra-virgin olive oil, divided",
        "2 tablespoons fennel seeds",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 sprigs rosemary",
        "1 dried chile de árbol, broken in half",
        "1 1/2 cups minced fennel",
        "1 1/2 cups minced onions",
        "2 tablespoons fresh thyme leaves",
        "3 garlic cloves, thinly sliced",
        "Kosher salt and freshly ground black pepper",
        "Slow-Cooked Tuscan Kale",
        "1/2 cup dry white wine",
        "3 1/2 cups low-sodium chicken or turkey broth",
        "2 large eggs, beaten to blend",
        "Ingredient info: Dried chiles de árbol, thin, red, very hot 3\"-long chiles, are available at Latin markets, specialty foods stores, and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Stuffing/Dressing",
        "Kale",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Kale Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/kale-dressing-51124290"
}
