{
    "directions": [
        "Combine lemon juice, Dijon mustard, shallot, garlic, 1/4 teaspoon salt, and a pinch of pepper in a small bowl. Stir to blend; set aside to let flavors meld. Mix thinly sliced kale and shredded brussels sprouts in a large bowl.",
        "Measure 1/2 cup oil into a cup. Spoon 1 tablespoon oil from cup into a small skillet; heat oil over medium-high heat. Add almonds to skillet and stir frequently until golden brown in spots, about 2 minutes. Transfer nuts to a paper towel¿lined plate. Sprinkle almonds lightly with salt.",
        "Slowly whisk remaining olive oil in cup into lemon-juice mixture. Season dressing to taste with salt and pepper. DO AHEAD: Dressing, kale mixture, and toasted almonds can be prepared 8 hours ahead. Cover dressing and kale mixture separately and chill. Cover almonds and let stand at room temperature.",
        "Add dressing and cheese to kale mixture; toss to coat. Season lightly with salt and pepper. Garnish with almonds."
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "2 tablespoons Dijon mustard",
        "1 tablespoon minced shallot",
        "1 small garlic clove, finely grated",
        "1/4 teaspoon kosher salt plus more for seasoning",
        "Freshly ground black pepper",
        "2 large bunches of Tuscan kale (about 1 1/2 pounds total), center stem discarded, leaves thinly sliced",
        "12 ounces brussels sprouts, trimmed, finely grated or shredded with a knife",
        "1/2 cup extra-virgin olive oil, divided",
        "1/3 cup almonds with skins, coarsely chopped",
        "1 cup finely grated Pecorino"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Side",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "Almond",
        "Kale",
        "Fall",
        "Winter",
        "Family Reunion",
        "Healthy",
        "Brussel Sprout",
        "Potluck",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Kale & Brussels Sprout Salad",
    "url": "http://www.epicurious.com/recipes/food/views/kale-brussels-sprout-salad-368295"
}
