{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté squash with 1/4 teaspoon salt and 1/4 teaspoon pepper, stirring frequently, until browned and just beginning to soften, about 5 minutes. Transfer to a plate and spread in 1 layer to cool.",
        "Add remaining tablespoon oil to skillet and reduce heat to moderate, then cook onion, pancetta, garlic, sage, and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper, stirring frequently, until onion is softened, about 7 minutes. Stir in kale and water and cook, covered, stirring occasionally, until kale is just tender, about 6 minutes. (Skillet will be full, but volume will reduce as vegetables steam.) Cool, uncovered, to room temperature.",
        "Brush springform pan with some of butter. Unroll phyllo and cover stack with plastic wrap and a dampened kitchen towel. Keeping remaining phyllo covered and, working quickly, gently fit 1 sheet into pan with ends overhanging and brush with butter (including overhang). Rotate pan slightly and top with another sheet (sheets should not align) and brush in same manner. Repeat with 5 more sheets, rotating pan each time so sheets cover entire rim.",
        "Spread half of kale mixture in phyllo shell. Gently stir together squash and cheese in a bowl and spread evenly over kale. Top with remaining kale.",
        "Put remaining sheet of phyllo on a work surface and brush with butter. Fold in half crosswise and butter again. Fold again (to quarter) and brush with butter, then lay over center of filling. Bring edges of phyllo up over filling (over quartered sheet of phyllo) to enclose. Brush top with butter and bake until deep golden brown, 20 to 25 minutes. Cool pie in pan on a rack 5 minutes. Remove side of pan and transfer to a platter. Cut into wedges (leave bottom of pan under pie).",
        "*Available at specialty foods shops and many supermarkets."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 (1-pound) piece butternut squash, peeled, seeded, and cut into 1/2-inch pieces (3 1/2 cups)",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 medium onion, finely chopped",
        "4 (1/8-inch-thick) slices pancetta* (Italian unsmoked cured bacon; 3 1/2 ounces), finely chopped",
        "3 garlic cloves, finely chopped",
        "2 teaspoons finely chopped fresh sage",
        "1 1/2 pounds kale, stems and center ribs discarded and leaves coarsely chopped (16 cups)",
        "1/4 cup water",
        "7 tablespoons unsalted butter, melted",
        "8 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "1 ounces finely grated Parmigiano-Reggiano (1/2 cup)",
        "Special equipment: a 9-inch round heavy nonstick springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Vegetable",
        "Bake",
        "Bacon",
        "Kale",
        "Butternut Squash",
        "Fall",
        "Healthy",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Kale, Butternut Squash, and Pancetta Pie",
    "url": "http://www.epicurious.com/recipes/food/views/kale-butternut-squash-and-pancetta-pie-230753"
}
