{
    "directions": [
        "Tie oregano, rosemary, and bay leaves together with kitchen twine.",
        "Heat oil in a large heavy pot over medium. Add pancetta, if using, and cook, stirring often, until browned around the edges, about 5 minutes. Add onion, leek, carrots, celery, garlic, and red pepper flakes; season with salt. Cook, stirring often, until onion is translucent and carrots are tender, 10–12 minutes. Add tomato paste and cook, stirring to coat, until slightly darkened, about 3 minutes.",
        "Add tomatoes, crushing with your hands as you go, then herb bundle, Parmesan rind, if using, and 6 cups water or reserved bean cooking liquid, or a combination. Season with salt and pepper and bring to a boil. Add potatoes, reduce heat, and simmer until potatoes are tender and flavors have melded, 20–25 minutes. Add kale and beans; cook until kale is tender, about 5 minutes. Discard Parmesan rind and herb bundle.",
        "Do ahead: Soup can be made 2 days ahead (or 2 months if frozen). Let cool; transfer to airtight containers and chill.",
        "Pulse garlic and basil in a food processor until finely chopped. Transfer to a small bowl and stir in oil, Parmesan, and lemon zest; season with salt. Serve soup topped with pistou."
    ],
    "ingredients": [
        "3 sprigs oregano",
        "3 sprigs rosemary",
        "2 bay leaves",
        "2 tablespoons olive oil",
        "4 ounces pancetta (Italian bacon), chopped (optional)",
        "1 onion, chopped",
        "1 leek, white and pale-green parts only, thinly sliced",
        "2 carrots, peeled, chopped",
        "2 celery stalks, chopped",
        "4 garlic cloves, thinly sliced",
        "1/2 teaspoon crushed red pepper flakes",
        "Kosher salt",
        "2 tablespoons tomato paste 1 28-ounce can whole peeled tomatoes, drained",
        "1 Parmesan rind (about 2 ounces; optional)",
        "3 cups cooked cannellini beans, cooking liquid reserved if desired, or two 15-ounce cans, rinsed",
        "Freshly ground black pepper",
        "12 ounces baby Yukon Gold potatoes, scrubbed, cut into 1/2\" pieces",
        "1/2 bunch Tuscan kale, ribs and stems removed, leaves torn into 1\" pieces",
        "2 garlic cloves",
        "1 cup fresh basil leaves",
        "1/2 cup olive oil",
        "1/2 ounce finely grated Parmesan",
        "1 teaspoon finely grated lemon zest",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Potato",
        "Kid-Friendly",
        "Low Cal",
        "Lunch",
        "Basil",
        "Kale",
        "Carrot",
        "Healthy",
        "Low Cholesterol",
        "Noodle",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Kale Minestrone with Pistou",
    "url": "http://www.epicurious.com/recipes/food/views/kale-minestrone-with-pistou-51264070"
}
