{
    "directions": [
        "Peel potatoes and cut into 1/3-inch dice (2 1/4 cups). Heat oil in a 10-inch nonstick skillet over moderate heat until hot but not smoking, then reduce heat to moderately low and cook potatoes, onion, and 1 teaspoon salt, stirring occasionally, until potatoes are tender, about 20 minutes.",
        "Cook kale in a 4- to 6-quart pot of boiling salted water until wilted, 2 to 3 minutes. Drain in a colander and immediately transfer to a bowl of cold water to stop cooking. Drain again, squeezing handfuls of kale to extract excess moisture, then coarsely chop.",
        "Add kale to potato mixture and cook, stirring occasionally, until kale is tender, about 5 minutes. Drain vegetables in colander set over a bowl, reserving drained oil, and cool 10 minutes.",
        "Lightly beat eggs in a large bowl, then stir in vegetables, 1 tablespoon drained oil, and remaining 1/2 teaspoon salt.",
        "Add 1 tablespoon drained oil to skillet, then add egg mixture and cook over low heat, covered, until sides are set but center is still loose, about 12 minutes. Remove from heat and let stand, covered, 15 minutes.",
        "Shake skillet gently to make sure tortilla is not sticking (if it is sticking, loosen with a heatproof plastic spatula). Slide tortilla onto a large flat plate, then invert skillet over tortilla and flip it back into skillet. Round off edge of tortilla with plastic spatula and cook over low heat, covered, 10 minutes more. Slide tortilla onto a plate and serve warm, cut into wedges."
    ],
    "ingredients": [
        "1 lb boiling potatoes",
        "1 cup olive oil",
        "1 large onion, chopped",
        "1 1/2 teaspoons salt",
        "1 lb kale, center ribs discarded",
        "7 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Potato",
        "Vegetarian",
        "Winter",
        "Gourmet"
    ],
    "title": "Kale and Potato Spanish Tortilla",
    "url": "http://www.epicurious.com/recipes/food/views/kale-and-potato-spanish-tortilla-107743"
}
