{
    "directions": [
        "Heat oven to 425°F. On a rimmed baking sheet, toss together squash, 2 tsp. olive oil, 1/2 tsp. salt, and 1/4 tsp. pepper. Place whole head of garlic on a sheet of aluminum foil, drizzle with 1 tsp. oil, wrap securely in foil and place on baking sheet with squash. Roast, stirring squash occasionally after the first 15 minutes, until squash is golden and tender and garlic is tender, 35–40 minutes. Remove garlic and squash from oven and set aside to cool.",
        "Meanwhile, heat 1 tsp. oil in a small skillet over medium-high heat. Add pepitas and cook, stirring occasionally, until about half are golden brown, 2–3 minutes. Transfer to a paper towel-lined plate and season with 1/4 tsp. salt. Set aside.",
        "Cut off the top of the garlic head and squeeze all of the softened garlic into a medium bowl. Whisk in the lemon juice, maple syrup, mustard, shallot, 1 tsp. salt and 1/8 tsp. pepper, then whisk in oil in a slow, steady stream.",
        "In a large mixing bowl, combine kale with about 3/4 of the dressing, and use your hands to massage the dressing into the kale. Add more dressing as needed (you may not need all of it). Reserve any leftover dressing for another use.",
        "Add roasted squash, Parmesan, and pomegranate seeds to bowl; toss together to combine, and season with salt and pepper to taste. Transfer to a serving bowl, and sprinkle with pumpkin seeds.",
        "Dressing can be prepared 3 days ahead; cover and chill. Squash and garlic can be roasted, and kale can be sliced 1 day ahead; place separately in airtight containers and chill. Salad can be tossed together 30 minutes ahead; keep at room temperature."
    ],
    "ingredients": [
        "1 large butternut squash (about 3 pounds), peeled cut into 3/4\" cubes",
        "1/2 cup, plus 4 teaspoons extra-virgin olive oil, divided",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 whole head garlic",
        "1/2 cup raw pumpkin seeds (pepitas)",
        "1/4 cup fresh lemon juice (from 1 large lemon)",
        "2 teaspoons pure maple syrup",
        "2 tablespoons Dijon mustard",
        "1 tablespoon finely chopped shallot",
        "1 1/2 pounds Tuscan kale (about 2 large bunches), stemmed, leaves thinly sliced",
        "1 cup finely grated Parmesan cheese (1 1/2 ounces)",
        "1 cup pomegranate seeds (from 1 large pomegranate)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Butternut Squash",
        "Seed",
        "Healthy",
        "Low Cal",
        "Kale",
        "Parmesan",
        "Kid-Friendly",
        "Low Cholesterol"
    ],
    "title": "Kale Salad with Butternut Squash, Pomegranate, and Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/kale-salad-with-roasted-butternut-squash-pomegranate-and-pumpkin-seeds"
}
