{
    "directions": [
        "Heat oven to 350°F. Place hazelnuts on a rimmed baking sheet and toast 8-10 minutes, tossing once or twice, until fragrant and skins have blistered. Bundle nuts in a kitchen towel and rub vigorously to remove skins. Spread out and let cool, then coarsely chop. Set aside.",
        "Meanwhile, whisk lemon juice, mustard, shallot, garlic, 1 tsp. salt, and 1/2 tsp. pepper in a medium bowl, then whisk in oil in a slow, steady stream. Set aside.",
        "Mix together kale and Brussels sprouts in a large mixing bowl. Add about 3/4 of the dressing, and use your hands to massage dressing into greens. Taste and add more dressing as needed (you may not need all of it). Reserve any leftover dressing for another use.",
        "Add cheese, apple, and half of the radishes; toss together to combine, and season with salt and pepper to taste. Transfer to a serving bowl, and top with nuts and remaining radishes.",
        "Dressing can be prepared 3 days ahead; cover and chill. Nuts can be toasted and chopped 1 day ahead; cover and keep at room temperature. Kale and Brussels sprouts can be sliced 1 day ahead; place in an airtight container and chill. Salad can be tossed together 30 minutes ahead; keep at room temperature."
    ],
    "ingredients": [
        "2/3 cup hazelnuts (3 ounces)",
        "1/4 cup fresh lemon juice (from 1 large lemon)",
        "2 tablespoons Dijon mustard",
        "2 tablespoons finely chopped shallot (about 1 medium)",
        "1 small garlic clove, finely grated",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/2 cup extra-virgin olive oil",
        "1 pound Tuscan kale (about 2 small bunches), stemmed, leaves thinly sliced",
        "3/4 pound Brussels sprouts, trimmed, thinly sliced",
        "2 ounces Mimolette cheese or aged gouda, grated on the large holes of a box grater (1 cup)",
        "1 crisp apple, such as Pink Lady or Honeycrisp, cored, cut into matchsticks",
        "6 radishes, halved, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Kale",
        "Brussel Sprout",
        "Cheese",
        "Apple",
        "Radish",
        "Healthy",
        "Low Cal",
        "Low Cholesterol",
        "Kid-Friendly"
    ],
    "title": "Kale Salad With Brussels Sprouts, Apples, and Hazelnuts",
    "url": "http://www.epicurious.com/recipes/food/views/kale-salad-with-brussels-sprouts-apples-and-hazelnuts"
}
