{
    "directions": [
        "To make the coleslaw, place the cabbage in a food processor and pulse until finely chopped, 6 to 8 pulses. Transfer to a large colander, sprinkle with salt and toss to combine. Let stand for 30 minutes to 1 hour. Rinse the cabbage well with cold water and spin in a salad spinner to remove the excess moisture. Transfer to a large bowl, add the carrot and onion and toss to combine.",
        "In a bowl, stir together the mayonnaise, buttermilk, sour cream, vinegar, sugar and parsley until well combined. Season with salt and pepper. Pour the dressing over the coleslaw and toss well to combine. Cover and refrigerate until ready to serve.",
        "Prepare a medium-hot fire in a grill.",
        "Divide the burger blend into 8 portions, each 3 oz., and roll each into a ball. Using a stuffed hamburger press according to the manufacturer’s instructions, make 4 burgers, stuffing each with 1 slice of cheese. Season with salt and pepper.",
        "Place the burgers on the grill and cook, turning once, for about 4 minutes per side for medium, or until done to your liking.",
        "Meanwhile, place the buns, cut sides down, on the grill and toast for about 1 minute.",
        "Place a burger on the bottom half of each bun. Top with barbecue sauce and coleslaw. Cover each with the top half of a bun. Serve immediately. Serves 4.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1/2 head green cabbage, cored and cut into large chunks",
        "Kosher salt, to taste",
        "1 small carrot, peeled and grated",
        "1/2 cup finely chopped red onion",
        "1/3 cup mayonnaise",
        "1/4 cup buttermilk",
        "2 Tbs. sour cream",
        "1 1/2 Tbs. white vinegar",
        "1 Tbs. sugar",
        "1 Tbs. finely chopped fresh flat-leaf parsley",
        "Freshly ground pepper, to taste",
        "",
        "1 1/2 lb. LaFrieda short rib burger blend",
        "4 slices American cheese",
        "Kosher salt and freshly ground pepper, to taste",
        "4 hamburger buns",
        "Cowtown barbecue sauce for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Kansas City Burgers",
    "url": "http://www.williams-sonoma.com/recipe/kansas-city-burgers.html"
}
