{
    "directions": [
        "Cook lobster in large pot of boiling salted water 13 minutes. Using tongs, transfer lobster to rimmed baking sheet. Cool slightly. Twist off claws; reserve for another use. Twist off tail. Scrape out any green tomalley. Using kitchen shears, cut body and legs into 2-inch pieces and place in medium bowl. Cut tail meat from shell; add shell to bowl with body and legs. Cut meat lengthwise into 4 strips, then crosswise into 1/4-inch pieces. Place meat in small bowl, cover, and chill.",
        "Melt 1/2 cup butter in heavy large pot over medium-low heat. Add sliced shallot, garlic, and chile; cook until fragrant, about 5 minutes. Add lobster shell pieces and stir 5 minutes. Increase heat to medium. Add remaining 1/2 cup butter, 1 tablespoon at a time, stirring until melted between additions. Add paprika; stir to blend. Strain butter into medium bowl, pressing on solids in strainer to release all butter. Discard solids in strainer. Let lobster butter cool to room temperature. (Lobster meat and butter can be prepared 1 day ahead. Cover butter and chill. Return lobster butter to room temperature before continuing.)",
        "Combine vinegar, chopped shallot, and capers in medium saucepan. Boil over high heat until almost all liquid evaporates, about 1 minute. Remove from heat. Whisk yolks, lemon juice, and 1 tablespoon water in medium bowl. Place bowl over saucepan of barely simmering water. Whisk constantly until mixture is thick, about 3 minutes. Turn off heat. Whisk in lobster butter in 6 additions. Whisk in shallot mixture and tarragon. Season to taste with salt and pepper. Stir in reserved lobster meat. Season with salt and pepper. Keep lobster bèarnaise sauce over warm water.",
        "Preheat broiler. Rub steaks with coarse kosher salt and pepper. Broil until cooked to desired doneness, about 6 minutes per side for medium-rare (5 minutes per side if boneless). Serve with lobster bèarnaise sauce."
    ],
    "ingredients": [
        "1 2 1/3-pound live lobster",
        "1 cup (2 sticks) unsalted butter, divided",
        "1 shallot, sliced",
        "2 garlic cloves, chopped",
        "1 dried red chile, such as Japones or de árbol",
        "1/2 teaspoon paprika",
        "1/4 cup Sherry wine vinegar",
        "2 tablespoons chopped shallot",
        "1 tablespoon capers, chopped",
        "2 large egg yolks",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon water",
        "1 tablespoon chopped fresh tarragon",
        "6 14- to 16-ounce 1 1/4-inch-thick New York strip steaks with bone, or 9-ounce boneless New York strip steaks",
        "Coarse kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Shellfish",
        "Broil",
        "Sauté",
        "Mother's Day",
        "Steak",
        "Lobster",
        "Boil"
    ],
    "title": "Kansas City Steaks with Lobster Béarnaise Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/kansas-city-steaks-with-lobster-bearnaise-sauce-234139"
}
