{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour an 11x17 inch baking pan.",
        "Melt vegetable oil, 3/4 cup margarine, and cocoa in a large pot over medium heat. Remove from heat, and stir 2 1/2 cups sugar and the salt into the chocolate. Allow the mixture to cool slightly. Beat in the eggs one at a time, mixing well after each, then add the vanilla. Stir 1 3/4 cup flour into the chocolate mixture. Spread the batter evenly into the prepared pan.",
        "Bake for 20 minutes in the preheated oven. Allow to cool completely.",
        "Beat 1 cup margarine, 1 cup brown sugar, and 1 cup white sugar with an electric mixer in a large bowl until smooth. Add milk and 2 teaspoons vanilla extract; beat well. Mix in the flour until just incorporated.",
        "Place chunks of the cookie dough over the cooled brownies; then place a piece of plastic wrap between your hand and the dough and squish it down into place. This gives an even layer of dough and helps \"stick\" it to the top of the brownies. Refrigerate until firm, about 30 minutes.",
        "Melt the chocolate chips with the shortening in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, until the chocolate is warm and smooth, 1 to 3 minutes (depending on your microwave).  Do not overheat or chocolate will scorch. Spread over the chilled brownies. Refrigerate uncovered until set, about 30 minutes, before cutting into squares."
    ],
    "ingredients": [
        "2/3 cup vegetable oil",
        "3/4 cup margarine",
        "3/4 cup unsweetened cocoa powder",
        "2 1/2 cups white sugar",
        "1/2 teaspoon salt",
        "6 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 3/4 cups all-purpose flour",
        "1 cup margarine",
        "1 cup packed brown sugar",
        "1 cup white sugar",
        "1/4 cup milk",
        "2 teaspoons vanilla extract",
        "2 cups all-purpose flour",
        "2 cups semisweet chocolate chips",
        "2 tablespoons shortening"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Karen's Cookie Dough Brownies",
    "url": "http://allrecipes.com/recipe/217269/karens-cookie-dough-brownies/"
}
