{
    "directions": [
        "In a saucepan combine the broth, 1 cup water, and 1 tablespoon of the oil and bring the liquid to a boil. In a bowl combine the kasha and the egg, stirring to coat the kasha well with the egg, transfer the mixture to a deep skillet with a lid, and cook the kasha over moderately high heat, stirring and breaking up the lumps, for 2 to 4 minutes, or until the grains are separated. Remove the skillet from the heat, add the broth mixture slowly (the mixture will spatter), and cover the skillet tightly. Cook the kashya, covered over low heat for 10 to 15 minutes, or until the liquid is absorbed.",
        "While the kasha is cooking, in a skillet cook the onion, the garlic, and the bell pepper in the remaining 2 tablespoons oil over moderately low heat, stirring, until the vegetables are softened. Add the zucchini and salt and black pepper to taste, increase the heat to moderately high, and cook the mixture, stirring, for 3 minutes, or until the zucchini is just tender. Stir the vegetables into the kasha and serve the kasha with a dollop of the yogurt."
    ],
    "ingredients": [
        "1 cup chicken broth",
        "3 tablespoons olive oil",
        "1 cup whole kasha",
        "1 large egg, beaten lightly",
        "1 onion, chopped",
        "1 garlic clove, minced",
        "1 red bell pepper, chopped",
        "1 zucchini, scrubbed, halved lengthwise, and cut into 1/4-inch slices",
        "plain yogurt for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Side",
        "Sauté",
        "Quick & Easy",
        "Bell Pepper",
        "Zucchini",
        "Winter",
        "Pan-Fry",
        "Healthy",
        "Bulgur",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Kasha with Zucchini and Red Bell Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/kasha-with-zucchini-and-red-bell-pepper-13571"
}
