{
    "directions": [
        "Stir together yogurt, mint, garlic, and salt in a small bowl and chill.",
        "Whisk together lemon juice, sugar, salt, pepper, and oil in a large bowl and stir in zucchini slices. Marinate at room temperature while making meatballs.",
        "Cover bread with water in a bowl and soak 10 minutes. Squeeze handfuls of bread to remove as much excess water as possible, then transfer to a bowl.",
        "Pulse onion and herbs in a food processor until finely chopped, then add to bread along with lamb, salt, spices, and pine nuts. Mix with your hands until well blended. Form lamb mixture into 36 balls (1 scant tablespoon each).",
        "Prepare grill for cooking over medium-hot charcoal (moderate heat for gas; see cooks' note below). Thread 6 meatballs 1/4 inch apart onto each of 6 skewers. Thread zucchini lengthwise onto remaining 6 skewers (5 slices per skewer), so cut sides are on the grill, leaving 1/4 inch between slices. Grill zucchini and lamb on oiled grill rack, turning over once, until golden and just cooked through, 4 to 6 minutes. Serve warm, with yogurt sauce."
    ],
    "ingredients": [
        "1 cup plain yogurt (preferably whole-milk)",
        "2 tablespoons chopped fresh mint",
        "1 teaspoon minced garlic",
        "1/8 teaspoon salt",
        "3 tablespoons fresh lemon juice",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/3 cup olive oil",
        "2 medium zucchini (1 1/4 lb total), cut crosswise into 1/2-inch-thick slices",
        "2 slices firm white sandwich bread, torn into small pieces",
        "1 small onion, finely chopped (about 1 cup)",
        "1/4 cup loosely packed fresh parsley leaves",
        "1/4 cup loosely packed fresh cilantro leaves",
        "1 lb ground lamb (from shoulder)",
        "1 teaspoon salt",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon cayenne",
        "1/4 teaspoon cinnamon",
        "1/4 teaspoon black pepper",
        "1/3 cup pine nuts, toasted and finely chopped",
        "Special equipment: 12 (10-inch) wooden skewers, soaked in cold water for 30 minutes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Yogurt",
        "Backyard BBQ",
        "Dinner",
        "Mint",
        "Ground Lamb",
        "Pine Nut",
        "Zucchini",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Parsley",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Kefta and Zucchini Kebabs",
    "url": "http://www.epicurious.com/recipes/food/views/kefta-and-zucchini-kebabs-233538"
}
