{
    "directions": [
        "Pour the warm water into a large mixing bowl, and sprinkle yeast over the water. Allow to stand until the yeast begins to form a creamy foam, 5 to 10 minutes. Stir in evaporated milk, white sugar, pumpkin, olive oil, and egg. Mix until thoroughly combined. Mix in 2 teaspoons of pumpkin pie spice, then add about 5 cups of flour, or as needed to make a stiff dough. Turn the dough out onto a floured work surface, and knead until smooth and elastic, about 8 minutes. Dough will be slightly sticky. Form the dough into a ball, place into an oiled bowl, cover with a cloth, and let rise in a warm place for about 45 minutes. (The dough will rise, but it won't double.)",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Punch down the dough, and roll it out to a rectangle shape on a floured work surface until it measures about 18 inches wide and 26 inches long. Brush the dough with 1/4 cup melted butter. Mix the brown sugar with 2 tablespoons of pumpkin pie spice in a small bowl, and sprinkle the mixture evenly over the dough. Roll up the dough the long way, and pinch the seam closed, then cut the dough into 12 equal-sized pieces with a sharp knife. Lay the rolls into the prepared baking dish.",
        "Bake in the preheated oven until lightly golden brown, 30 to 40 minutes.",
        "While the rolls are baking, mix vanilla extract, cream cheese, 2 tablespoons of melted butter, confectioners' sugar, and milk together to make a glaze. Spread the glaze over the rolls as soon as they come out of the oven."
    ],
    "ingredients": [
        "1/4 cup warm water (100 degrees F/38 degrees C)",
        "1 (.25 ounce) package active dry yeast",
        "1 (5 ounce) can evaporated milk",
        "3/4 cup white sugar",
        "1 (15 ounce) can pumpkin",
        "3 tablespoons olive oil",
        "1 egg, beaten",
        "2 teaspoons pumpkin pie spice",
        "5 cups all-purpose flour, or more if needed",
        "1/4 cup melted butter",
        "1 1/4 cups brown sugar, packed",
        "2 tablespoons pumpkin pie spice",
        "1/2 teaspoon vanilla extract",
        "1 (3 ounce) package cream cheese, softened",
        "2 tablespoons butter, melted",
        "1 cup confectioners' sugar",
        "1/4 cup milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kelsandra's Pumpkin Cinnamon Rolls",
    "url": "http://allrecipes.com/recipe/216059/kelsandras-pumpkin-cinnamon-rolls/"
}
