{
    "directions": [
        "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.  Place the poblano chiles cut-side-down onto the baking sheet.",
        "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 5 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Dice the chiles.",
        "Cook and stir the bacon in a large pot over medium heat until it has released its fat and is beginning to crisp, about 5 minutes. Drain the bacon on a paper towel-lined plate, and discard all but 1 tablespoon of bacon grease from the pot. Increase the heat to medium-high, and add the pork loin cubes. Cook, stirring occasionally until browned on all sides, about 5 minutes. Remove the pork from the pot, and reduce the heat to medium. Stir in the onion and garlic; cook and stir until the onion has softened and is beginning to turn brown, about 5 minutes.",
        "Stir the roasted poblano chiles, jalapeno peppers, oregano, cumin, New Mexico chile powder, cloves, salt, and cilantro into the onions; cook for 1 minute. Pour in the chicken stock and enchilada sauce. Stir in the bacon and pork cubes, and bring to a simmer over medium-high heat. Reduce heat to medium-low, cover, and simmer 1 hour. Stir in the hominy, recover, and continue cooking 1 hour more until the pork is very tender."
    ],
    "ingredients": [
        "2 fresh poblano chile peppers",
        "8 ounces bacon, chopped",
        "1 tablespoon bacon drippings",
        "2 pounds pork loin, cut into 1-inch cubes",
        "1 onion, diced",
        "10 cloves garlic, minced",
        "2 jalapeno peppers, seeded and diced",
        "1 teaspoon dried Mexican oregano",
        "2 teaspoons ground cumin",
        "1 teaspoon New Mexico chile powder",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon kosher salt",
        "1 bunch cilantro, chopped",
        "8 cups chicken stock",
        "1 (14.5 ounce) can mild red enchilada sauce",
        "2 (29 ounce) cans white hominy, rinsed and drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ken's Kickin' Posole",
    "url": "http://allrecipes.com/recipe/214167/kens-kickin-posole/"
}
