{
    "directions": [
        "Warm a 3-qt (3-l) cast-iron kettle over medium-high heat. When hot, add the oil, garlic, shallots, and salt and sauté until golden brown, about 1 minute. Raise the heat to high, add the mussels, and toss to coat with the oil. Add the sugar, fish sauce, and 1 teaspoon pepper and stir to combine.",
        "Reduce the heat to medium-high, cover, and cook until the mussels open, 3-5 minutes. Discard any that failed to open. The sauce should be the consistency of a light syrup. If the sauce is too thin, using a slotted spoon, transfer the mussels to a plate. Raise the heat to high and cook the sauce, stirring frequently, until reduced, 3-5 minutes. Return the mussels to the kettle and toss to coat.",
        "Garnish the mussels with the chile and cilantro sprigs and serve right away.",
        "For a more formal supper, set out a small seafood fork at each place setting. At a more casual meal, your guests can also use an empty mussel shell as a pair of pincers to pick the meats from the shells. Show diners this trick at the table. Set out a large bowl for the empty shells."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "6 cloves garlic, chopped",
        "2 shallots, thinly sliced",
        "1/2 teaspoon coarse sea salt",
        "2 lb (1 kg) mussels, scrubbed and debearded",
        "2 tablespoons each sugar and Asian fish sauce",
        "Coarsely ground pepper",
        "1 red jalapeño chile, seeded and finely diced",
        "Fresh cilantro (fresh coriander) sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Appetizer",
        "Dinner",
        "Mussel",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Kettle-Seared Garlic-Pepper Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/kettle-seared-garlic-pepper-mussels-363229"
}
