{
    "directions": [
        "Fill a pot with water, bring to a boil, and reduce heat to a simmer. Cook the shrimp in the simmering water until they turn pink and opaque, 3 to 4 minutes. Drain the shrimp, and cut in half; mix the shrimp, sour cream, and Swiss cheese in a bowl.",
        "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x12-inch baking dish.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the pasta shells, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 13 minutes. Gently remove the shells with a slotted spoon. Stuff 18 shells with about 1 1/2 tablespoon of the shrimp mixture, place them in the prepared baking dish, then cover each stuffed shell with another shell to enclose the filling.",
        "Melt the butter in a skillet over medium heat. Cook and stir the mushrooms and green onions until the mushrooms give up their juice, about 3 minutes. Stir in the flour, white wine, salt, pepper, and half-and-half cream. Cook, stirring often, until thickened and smooth. Pour the sauce over the stuffed shells. Sprinkle the top with Parmesan cheese.",
        "Bake in the preheated oven until the cheese has melted and begun to brown and the sauce is bubbling, about 25 minutes."
    ],
    "ingredients": [
        "1 1/2 pounds large shrimp, peeled and deveined",
        "1/2 cup sour cream",
        "3/4 cup shredded Swiss cheese",
        "36 jumbo pasta shells",
        "1/4 cup butter",
        "1 cup sliced mushrooms",
        "1/2 cup chopped green onions",
        "1/4 cup all-purpose flour, sifted",
        "1/4 cup white wine",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 cups half-and-half cream",
        "1 cup freshly shredded Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kevin's Sea Shells",
    "url": "http://allrecipes.com/recipe/215983/kevins-sea-shells/"
}
