{
    "directions": [
        "Whisk all ingredients in heavy small saucepan over medium heat until custard thickens and boils for 30 seconds, about 8 minutes. Cool to room temperature, stirring occasionally (mixture will thicken).",
        "Preheat oven to 350°F. Wrap 3 layers of foil around outside of 8- to 8 1/2-inch-diameter springform pan with 3-inch-high sides. Butter pan. Stir first 3 ingredients to blend in medium bowl. Mix in butter until moistened. Press crumb mixture evenly onto bottom and 1 1/2 inches up sides of prepared pan. Bake just until set, about 5 minutes. Cool completely. Maintain oven temperature.",
        "Place cream cheese, 2/3 cup sugar, eggs, lime juice, and lime peel in processor; blend well.",
        "Spoon custard into crust; smooth top. Carefully spoon filling over. Set cheesecake in large baking pan. Add enough hot water to baking pan to come 1 inch up sides of cheesecake pan. Bake until almost set but not puffed and center moves slightly when pan is gently shaken, about 45 minutes.",
        "Meanwhile, stir sour cream and remaining 3 tablespoons sugar in medium bowl to blend.",
        "Carefully spoon sour cream mixture over hot cheesecake; smooth top. Bake until topping sets, about 10 minutes. Cool 10 minutes. Run knife around sides of pan to loosen. Cool cheesecake completely. Cover and refrigerate overnight. Do ahead Can be made 2 days ahead. Keep refrigerated. Release pan sides from cheesecake; transfer to platter. Garnish with lime slices and serve."
    ],
    "ingredients": [
        "6 large egg yolks",
        "3/4 cup sugar",
        "6 tablespoons fresh Key lime juice or regular lime juice",
        "1 teaspoon grated Key lime peel or regular lime peel",
        "1 3/4 cups graham cracker crumbs (about 12 whole graham crackers)",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, melted",
        "2 (8-ounce) packages cream cheese, room temperature",
        "2/3 cup plus 3 tablespoons sugar",
        "2 large eggs",
        "3 tablespoons fresh Key lime juice or regular lime juice",
        "1 tablespoon grated Key lime peel or regular lime peel",
        "1 16-ounce container sour cream",
        "Thin lime slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Cream Cheese",
        "Lime",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Key Lime Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/key-lime-cheesecake-236210"
}
