{
    "directions": [
        "For the crust, blend an 8 oz. box of gluten-free graham crackers to make 2 cups of crumbs. Stir in the melted vegan butter until combined.",
        "Pat the mixture into the bottom of a standard pie dish or a spring form, oiled and sides lined with parchment paper. Use the bottom of a drinking glass to help press the mixture flat to the bottom.",
        "Bake at 350 degrees for 8-10 minutes.",
        "Dairy-free Sweetened Condensed Milk: In a small/medium size saucepan pour in the bottles of coconut culinary milk and bring to a low boil. Allow to boil for 5 minutes while whisking continuously.",
        "Lower the heat bringing the milk to a simmer. Add in the powdered sugar and continue to whisk until the sugar has fully dissolved. Add thyme sprigs, salt and vanilla (if using) and allow to simmer until the mixture has reduced by half - about 30-40 minutes. Remove sprigs from milk.",
        "Candied Thyme Garnish: Create a simple syrup by bringing equal parts water and organic cane syrup to a boil and simmering until the sugar is dissolved. Once the mixture has cooled completely, dip fresh sprigs of thyme into it and lay them onto parchment paper. Sprinkle with sugar.",
        "For the Filling:",
        "Add the key lime juice to the Sweetened Condensed Milk with thyme, to taste.",
        "Fold the CocoWhip in to the mixture and add lime zest to taste.",
        "Add the filling to the crust, lightly cover and freeze for at least 2 hours or overnight.",
        "Garnish with key lime slices and sprigs of candied thyme."
    ],
    "ingredients": [
        "Crust:",
        "2 cups gluten-free graham crackers, blended",
        "1/4 cup vegan butter, melted",
        "Sweetened Condensed Milk:",
        "2 (11 ounce) bottles So Delicious® Culinary Coconut Milk",
        "2 cups powdered sugar",
        "1 pinch salt",
        "1/4 teaspoon vanilla extract (optional)",
        "Filling:",
        "2 tablespoons organic cane sugar",
        "3/4 cup key lime juice, or to taste",
        "1 lime, zested",
        "1 (9 ounce) tub So Delicious® Dairy Free CocoWhip",
        "Topping:",
        "Candied thyme, for garnish (see directions)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Key Lime Thyme Pie",
    "url": "http://allrecipes.com/recipe/247063/key-lime-thyme-pie/"
}
