{
    "directions": [
        "Preheat oven to 350°F. and lightly grease a heavy baking sheet.",
        "Arrange 4 parchment squares on baking sheet. (Oil or butter makes parchment squares stick to baking sheet).",
        "In a food processor blend together coconut and flour until coconut is ground fine. Add butter, sugars, and milk and blend until dough forms a ball, about 10 seconds. Spoon a well-rounded teaspoon of dough onto each of the 4 parchment squares and with slightly wet fingertips evenly pat into 2 inch rounds.",
        "Bake cookies in middle of oven until very thin and golden brown, about 10 minutes. Immediately transfer cookies (still on parchment) to a rack and let stand until just firm enough to hold their shape, 30 to 45 seconds. Working with 1 cookie at a time and using parchment as an aid, quickly roll cookie around a cannoli form to make a cylinder. (If cookies become too firm to roll, return them on parchment on baking sheet to oven 1 minute to soften.) Cool formed cookies or a rack before removing cannoli form. Make more cookies in same manner with remaining dough, baking and forming cookies in batches of 4 and allowing baking sheet to cool completely between each batch. Cookies are fragile. Cookies keep in one layer in an airtight container at room temperature 4 days.",
        "In a bowl with an electric mixer beat cream cheese with sugar, zest, and lime juice until smooth and beat in mascarpone. Chill filling, covered, until firm, at least 4 hours and up to 1 day.",
        "Whisk filling and transfer it to a pastry bag fitted with a 1/4-inch plain or decorative tip. Carefully pipe filling into both ends of 12 cookies. Pour about 1/4 cup mango sauce onto each of 6 dessert plates, tilting plate to distribute sauce evenly, and top with 2 \"cannoli,\" raspberries, and carambola slices."
    ],
    "ingredients": [
        "about twenty 6-inch squares parchment paper",
        "3/4 cup sweetened flaked coconut, toasted and cooled",
        "2 tablespoons all-purpose flour",
        "5 tablespoons unsalted butter, cut into pieces and softened",
        "1/2 cup granulated sugar",
        "2 tablespoons firmly packed light brown sugar",
        "1 tablespoon milk",
        "four 3 1/2- to 4-inch-long cannoli forms (each about 5/8 inch in diameter)",
        "4 ounces cream cheese, softened",
        "1/3 cup granulated sugar",
        "2 teaspoons freshly grated lime zest",
        "4 tablespoons bottled Key lime juice or 5 tablespoons fresh lime juice",
        "1 cup mascarpone cheese (about 1/2 pound)",
        "Mango Sauce",
        "Accompaniments: fresh raspberries",
        "sliced carambola (star fruit) if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Lime",
        "Coconut",
        "Spring",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Key Lime Mascarpone \"Cannoli\" with Mango Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/key-lime-mascarpone-cannoli-with-mango-sauce-11512"
}
