{
    "directions": [
        "Combine huckleberries and sugar in medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer over medium heat, stirring until sugar dissolves. Simmer until reduced to 1 1/4 cups, about 15 minutes. Refrigerate until cold. DO AHEAD: Can be made 2 days ahead. Cover and refrigerate. Discard vanilla bean before serving.",
        "Combine passion fruit puree and sugar in heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves. Simmer until mixture is reduced to 1/2 cup, stirring frequently, about 6 minutes. Transfer coulis to bowl and refrigerate until cold. DO AHEAD: Can be made 2 days ahead. Cover and keep refrigerated. Discard vanilla bean before using.",
        "Preheat oven to 350°F. Combine cracker crumbs, sugar, and salt in medium bowl. Add butter and stir until crumbs are moist. Press mixture onto bottom and up sides of 9-inch-diameter glass pie dish. Bake crust until set and lightly browned, about 10 minutes. Cool crust completely. Maintain oven temperature.",
        "Whisk sweetened condensed milk and egg yolks in medium bowl to blend. Add lime juice and whisk until blended. Pour filling into cooled crust. Bake pie until filling is set, about 18 minutes. Transfer to rack and cool to room temperature. Cover and refrigerate pie overnight.",
        "Cut pie into wedges. Spoon huckleberry compote on top. Garnish with dollop of whipped cream. Drizzle passion fruit coulis around and serve."
    ],
    "ingredients": [
        "16 ounces fresh wild huckleberries or wild Maine blueberries or one 15- to 16-ounce package frozen wild blueberries",
        "1/2 cup sugar",
        "1 vanilla bean, split lengthwise",
        "3/4 cup frozen passion fruit puree,* thawed",
        "1/2 cup sugar",
        "1/2 vanilla bean, split lengthwise",
        "1 1/4 cups graham cracker crumbs",
        "3 tablespoons sugar",
        "Pinch of salt",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1 14-ounce can sweetened condensed milk",
        "4 large egg yolks",
        "1/2 cup fresh Key lime juice or regular lime juice",
        "Whipped cream",
        "*Available at some specialty foods stores and online from lepicerie.com or amazon.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Lime",
        "Summer",
        "Chill",
        "Passion Fruit",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Key Lime Pie with Passion Fruit Coulis and Huckleberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/key-lime-pie-with-passion-fruit-coulis-and-huckleberry-compote-235862"
}
