{
    "directions": [
        "1. Preheat the oven to 350°F and put the oven rack in the middle of the oven.",
        "2. Grease the insides of the ramekins with nonstick cooking spray or butter and evenly coat with the 2 tablespoons sugar (see headnote). Separate the eggs into 2 bowls.",
        "3. Using the stand mixer, or a handheld mixer and medium bowl, first on low speed and then gradually increasing the speed to medium, beat the butter and the 1/2 cup sugar together until smooth. Scrape down the side of the bowl with the rubber spatula. Beat in the egg yolks one at a time, mixing well after each addition, stopping once or twice to scrape down the side of the bowl. Reduce the speed to medium-low, add the flour and salt, and mix until everything is evenly combined. Mix in the milk, 1/3 cup at a time. Then, by hand, stir in the Key lime juice. The batter will be thin. Set aside while you whip the egg whites.",
        "4. With a handheld or stand mixer, whisk the egg whites in a clean dry bowl on medium speed until frothy. Increase the speed to medium-high and whip until the whites hold a peak on the whisk or beaters (stop the mixer and lift to check).",
        "5. Using the rubber spatula, gently fold the egg whites into the Key lime mixture. Using a measuring cup to scoop up the batter evenly, divide it among the ramekins so it comes to within 1/4 inch of the rims.",
        "6. It's best to find a space near your oven to fill the baking pan with water so you don't have to walk too far. Place the ramekins in the baking pan and, using a container with a spout, slowly pour very hot tap water into the pan so that the water comes about half the way up the sides of the ramekins. Carefully transfer the baking pan to the oven. Bake the puddings until some begin to turn golden brown and have cracked slightly on the surface, about 40 minutes.",
        "7. Remove the baking pan from the oven. Let cool until you can pick up the ramekins (15 minutes or so), then remove them from the water.",
        "8. Spread the almonds in one layer in a small baking pan and put it in the still-warm oven. Set a timer for 10 minutes and check the nuts to see if they're a light golden brown. If not, toast 2 minutes longer. Set aside to cool.",
        "9. Serve the cakes warm or at room temperature, the almonds scattered on top just before serving."
    ],
    "ingredients": [
        "6 (6-ounce) ramekins or custard cups",
        "Electric stand mixer or a handheld mixer and medium bowl",
        "Rubber spatula",
        "9- by 13-inch baking pan that will hold the ramekins",
        "2 tablespoons plus 1/2 cup granulated sugar",
        "2 large eggs",
        "3 tablespoons unsalted butter, at room temperature",
        "1/4 cup unbleached all-purpose flour",
        "1/8 teaspoon kosher salt",
        "1 cup whole milk",
        "1/4 cup Key lime juice",
        "1/4 cup sliced almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Almond",
        "Summer",
        "Shower",
        "Engagement Party",
        "Party",
        "Ramekin",
        "Butter"
    ],
    "title": "Key Lime Pudding Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/key-lime-pudding-cakes-366009"
}
