{
    "directions": [
        "Whisk eggs, yolks, sugar, lime juice, lemon juice, and coarse salt in medium metal bowl. Set bowl over medium saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk constantly until curd thickens slightly and instant-read thermometer inserted into curd registers 140°F for 3 minutes, 5 to 6 minutes total (do not allow to boil). Remove bowl from over water. Gradually whisk butter into curd a few cubes at a time until smooth, allowing butter cubes to melt before adding more. Strain curd through fine sieve set over small bowl. Press plastic wrap directly onto surface of curd and chill overnight. DO AHEAD: Lime curd can be made 2 days ahead. Keep chilled.",
        "Using electric mixer, beat butter, cream cheese, and sugar in medium bowl until smooth. Add flour and salt and beat just until blended. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out.",
        "Preheat oven to 375°F. Roll out dough on lightly floured work surface to 11- to 12-inch round. Transfer to 9-inch tart pan with removable bottom. Press dough onto bottom and up sides of pan. Trim dough overhang to 1/2 inch, then fold overhang in, forming double-thick sides extending 1/4 inch above sides of pan. Pierce crust all over with fork. Freeze crust 20 minutes.",
        "Line crust with foil; fill with dried beans or pie weights. Bake until crust is set, about 25 minutes. Remove foil and beans. Continue to bake until crust is golden and cooked through, about 20 minutes longer. Cool crust completely in pan on rack. Spread curd evenly in baked crust. Chill while making meringue.",
        "Using electric mixer, beat egg whites in large bowl on medium speed until foamy. Increase speed to medium-high and beat until soft peaks form. Gradually add sugar and powdered sugar 1 tablespoon at a time; beat until meringue is very thick and glossy, about 5 minutes. Beat in vanilla and coarse kosher salt.",
        "Spoon meringue in dollops atop curd, then spread and swirl decoratively with table knife. Using kitchen torch, brown meringue in spots, creating white and golden peaks and valleys. Chill uncovered at least 1 hour before serving. DO AHEAD: Can be made 4 hours ahead. Keep chilled.",
        "Remove sides from tart pan. Place tart on platter and serve."
    ],
    "ingredients": [
        "3 large eggs",
        "3 large egg yolks",
        "1/2 cup sugar",
        "1/3 cup fresh Key lime juice (from about 18 limes) or regular fresh lime juice",
        "3 tablespoons fresh lemon juice",
        "1/4 teaspoon coarse kosher salt",
        "1/2 cup (1 stick) unsalted butter, cut into 1/4-inch cubes",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "3 ounces chilled cream cheese, cut into 1/2-inch cubes",
        "1 tablespoon sugar",
        "3/4 cup unbleached all purpose flour",
        "1/4 teaspoon coarse kosher salt",
        "4 large egg whites, room temperature",
        "2/3 cup sugar",
        "1/4 cup powdered sugar",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon coarse kosher salt",
        "Special equipment: 9-inch-diameter tart pan with removable bottom Kitchen torch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Easter",
        "Cream Cheese",
        "Lime",
        "Spring",
        "Family Reunion",
        "Potluck",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Key Lime Meringue Tart",
    "url": "http://www.epicurious.com/recipes/food/views/key-lime-meringue-tart-357518"
}
