{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan.",
        "Stir the flour and baking powder together in a mixing bowl.",
        "Cream the shortening with 1 cup butter and 2 cups sugar in a large mixing bowl until light colored and fluffy. Beat in the eggs, one at a time until mixture is light colored. Stir in 2 tablespoons rum, 2 teaspoons Key lime juice, Key lime zest, and vanilla extract until thoroughly blended. Stir in the flour mixture alternating with the milk. Pour the batter into the prepared pan.",
        "Bake in preheated oven until a toothpick inserted into the center comes out clean, about 90 minutes.",
        "Meanwhile, make the glaze by creaming 1/4 cup sugar with 1/4 cup butter in a small saucepan until light colored and fluffy. Stir in 2 tablespoons Key lime juice until evenly blended. Bring to a boil, stirring constantly. Remove from the heat and stir in 3 tablespoons rum.",
        "Cool the cake in its pan for 10 minutes. Turn out onto a wire rack or serving plate. While the cake is still warm, use a toothpick to prick the top in many places. Pour the glaze evenly over the top of the cake so it drizzles down all sides. Cool the cake completely before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F403530.jpg",
    "ingredients": [
        "3 cups all-purpose flour",
        "½ teaspoon baking powder",
        "½ cup shortening",
        "1 cup butter",
        "2 cups white sugar",
        "5  eggs",
        "2 tablespoons rum, or amount desired",
        "2 teaspoons Key lime juice",
        "1 tablespoon grated Key lime zest",
        "1 ½ teaspoons vanilla extract",
        "1 cup milk",
        "¼ cup white sugar",
        "¼ cup butter",
        "2 tablespoons Key lime juice",
        "3 tablespoons rum"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Key Lime Rum Cake",
    "url": "http://allrecipes.com/recipe/151055/key-lime-rum-cake/"
}