{
    "directions": [
        "Heat vegetable oil in a small skillet over medium-low heat; add minced garlic. Slowly cook garlic until golden brown, about 5 minutes. Remove skillet from heat.",
        "Crush peppercorns using a mortar and pestle until powdery. Add peeled garlic and a pinch of salt; crush into a paste. Mix cilantro stems into the paste.",
        "Mix paste, pork, shrimp, water chestnuts, dark soy sauce, 1 tablespoon white sugar, fish sauce, tapioca starch, light soy sauce, and 1/2 teaspoon salt together in a large bowl. Spoon 1 to 2 teaspoons pork-shrimp mixture into the center of each wonton wrapper. Fold the wrapper over the filling, sealing the edges together and creating a purse-like pouch.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add wontons, cover, and steam until the filling is cooked through, about 10 minutes.",
        "Whisk rice vinegar, light soy sauce, 1 tablespoon white sugar, scallions, and bird's eye chile together in a bowl until dipping sauce is well mixed.",
        "Serve Khanom Jeeb with a drizzle of garlic oil and dipping sauce on the side."
    ],
    "ingredients": [
        "Garlic Oil:",
        "3 tablespoons vegetable oil",
        "3 cloves garlic, minced",
        "Wontons:",
        "5 whole black peppercorns",
        "2 cloves garlic, peeled",
        "salt to taste",
        "2 cilantro stems, chopped",
        "5 ounces ground pork",
        "5 ounces shrimp, minced",
        "5 water chestnuts, minced",
        "1 tablespoon dark soy sauce",
        "1 tablespoon white sugar",
        "1 teaspoon fish sauce",
        "1 teaspoon tapioca starch",
        "1 teaspoon light soy sauce",
        "1/2 teaspoon salt",
        "25 wonton wrappers, or as needed",
        "Dipping Sauce:",
        "3 tablespoons rice vinegar",
        "3 tablespoons light soy sauce",
        "1 tablespoon white sugar",
        "2 scallions, sliced into thin rings",
        "1 bird's eye chile, or more to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Khanom Jeeb (Pork and Shrimp Dumplings)",
    "url": "http://allrecipes.com/recipe/246042/khanom-jeeb-pork-and-shrimp-dumpling/"
}
