{
    "directions": [
        "Place the basmati rice in a large container and cover with several inches of cool water; let stand 30 minutes. Drain.",
        "Heat the oil in a large pan with a heavy bottom; fry the onion, garlic paste and, ginger paste in the hot oil until the onions are caramelized and golden brown, about 10 minutes. Stir the turmeric, garam masala, and cumin into the mixture; allow to cook together for 30 seconds. Add the tomatoes and cook until the oil separates, about 10 minutes. Crumble the ground beef into the tomato mixture; season with salt and cook until the beef is no longer pink, about 15 minutes. Mix the frozen peas and the green chile peppers into the beef.",
        "Heat the ghee in a large skillet over medium heat. Cook the cinnamon stick, cardamom pod, bay leaves, and cloves in the ghee until fragrant, about 1 minute. Add the rice to the spice mixture; cook until the rice smells nutty, 1 to 2 minutes more. Spread the rice with the spices over the beef mixture, but do not stir. Gently pour the water over the rice and season with salt; bring the mixture to a boil for 2 minutes. Cover, reduce heat to low, and continue cooking until the rice is tender, 12 to 15 minutes. Remove from heat completely and allow to sit covered another 20 minutes. Garnish with cilantro to serve."
    ],
    "ingredients": [
        "3 cups basmati rice",
        "1/4 cup cooking oil",
        "2 large onions, minced",
        "1 tablespoon garlic paste",
        "1 tablespoon ginger paste",
        "1 teaspoon ground turmeric",
        "1 teaspoon garam masala",
        "1 teaspoon ground cumin",
        "2 tomatoes, chopped",
        "1 pound ground beef",
        "salt to taste",
        "1/2 cup frozen green peas (optional)",
        "4 green chile peppers, halved lengthwise",
        "1 tablespoon ghee (clarified butter)",
        "1 cinnamon stick",
        "1 black cardamom pod",
        "2 bay leaves",
        "4 whole cloves",
        "5 cups water",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kheema Pulao",
    "url": "http://allrecipes.com/recipe/212525/kheema-pulao/"
}
