{
    "directions": [
        "For the wings and dip: Pour about 3 inches of the vegetable oil into a large pot and heat it to 350 degrees F.",
        "While the oil is heating, make the dip. Stir together the sour cream, blue cheese, mayonnaise, Worcestershire, chipotle and lemon juice in a medium bowl. Thin with a little buttermilk if needed. Taste and adjust the seasoning with salt and pepper.",
        "To make the batter, whisk together the flour with some salt, pepper and cayenne in a large bowl. Whisk in the 1 1/2 cups buttermilk to form a smooth but thin batter.",
        "Toss the chicken wings in the batter. Working in batches, fry 6 to 8 wing pieces at a time until golden brown and cooked through, 7 to 8 minutes. Drain on paper towels and keep warm.",
        "For the sauce: In a large bowl, stir together the melted butter, hot sauce, barbecue sauce, honey, pickled jalapeno juice and Worcestershire. Toss the hot wings in the sauce to coat them well. Serve with the creamy dip."
    ],
    "ingredients": [
        "Vegetable oil, for frying",
        "1 cup sour cream",
        "1/2 cup blue cheese crumbles",
        "1/2 cup mayonnaise",
        "4 dashes Worcestershire sauce",
        "1 canned chipotle pepper in adobo, finely chopped",
        "Juice of 1/2 lemon",
        "1 1/2 cups buttermilk, plus more if needed for thinning",
        "Kosher salt and freshly ground black pepper",
        "1 cup all-purpose flour",
        "Cayenne pepper, to taste",
        "4 pounds chicken wings",
        "2 sticks butter, melted",
        "1 small bottle cayenne pepper sauce, such as Frank's",
        "1/4 cup barbecue sauce",
        "1 tablespoon honey",
        "1 tablespoon juice from a jar of pickled jalapenos",
        "2 dashes Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Chicken Wing",
        "Blue Cheese",
        "Cheese",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Appetizer"
    ],
    "title": "Kicked Up Spicy Wings",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/kicked-up-spicy-wings"
}
