{
    "directions": [
        "Measure the water into a large bowl, or the bowl of a stand mixer and stir in 1 tablespoon of brown sugar. Sprinkle the yeast over the top and set aside until foamy, about 10 minutes.",
        "Add 1 cup of the all-purpose flour and 3 cups of whole wheat flour to the bowl along with the brown sugar, salt, vegetable oil and milk. Mix on low speed to blend ingredients. Continue to mix on medium speed, adding the rest of the flour 1/2 cup at a time, until the dough clings to the hook and cleans the sides of the bowl. You may not need to add all of the flour. Mix on medium speed for about 5 minutes. Oil the bowl and turn the dough to coat. Cover loosely and set aside to rise until doubled, about 1 hour.",
        "Punch down the dough and place on a floured surface. Divide into two equal portions and use a rolling pin to roll each one into a rectangle that is about 16x8 inches. Be sure to press out all of the air bubbles. Roll the rectangles into loaves and pinch the seam together.",
        "Place loaves seam side down into greased 9x5 inch loaf pans. Cut a few slits across the top of each loaf using a sharp serrated knife. Set aside to rise until your finger leaves a dimple when you press into a loaf, 30 to 45 minutes. Preheat the oven to 400 degrees F (200 degrees C).",
        "Bake the loaves for 15 minutes in the preheated oven, then reduce the temperature to 350 degrees F (175 degrees C). Bake for an additional 30 minutes, or until loaves are deep brown. Remove from pans to cool on a wire rack."
    ],
    "ingredients": [
        "1 1/2 cups warm water (110 degrees F/45 degrees C)",
        "1 tablespoon brown sugar",
        "2 (.25 ounce) envelopes active dry yeast",
        "2 cups all-purpose flour",
        "4 cups whole wheat flour",
        "1/3 cup packed brown sugar",
        "2 teaspoons salt",
        "1/3 cup vegetable oil",
        "1/2 cup milk, room temperature"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kid-Friendly Wheat Bread",
    "url": "http://allrecipes.com/recipe/54981/kid-friendly-wheat-bread/"
}
