{
    "directions": [
        "Place lentils, carrots and celery in heavy large saucepan. Add enough cold water to cover. Stir in salt and bring to boil. Reduce heat, cover and simmer until lentils are just tender, about 20 minutes. Drain. Transfer lentil mixture to bowl.",
        "Meanwhile, whisk vinegar, mustard and sugar in small bowl to blend; set aside. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add kielbasa and sauté until brown, about 5 minutes. Using slotted spoon, transfer to paper towels. Cover to keep warm.",
        "Pour off any fat from skillet and discard. Add remaining 1/2 cup oil to skillet; heat over medium heat. Add garlic and stir until golden, about 2 minutes. Discard garlic. Add fennel bulb to skillet and sauté until crisp-tender, about 4 minutes. Add green onions and stir 1 minute. Whisk in vinegar mixture and bring to boil. Pour fennel mixture over lentils. Toss to coat. Season with salt and pepper.",
        "Line large shallow bowl with frisée leaves. Spoon in lentil salad. Arrange kielbasa slices atop lentils. Sprinkle with chopped fennel fronds and serve."
    ],
    "ingredients": [
        "1 1-pound package dried lentils",
        "3 carrots, peeled, thinly sliced",
        "2 celery stalks, chopped",
        "2 teaspoons salt",
        "1/3 cup malt vinegar or apple cider vinegar",
        "2 tablespoons coarse-grained Dijon mustard",
        "1 1/2 teaspoons sugar",
        "2 tablespoons plus 1/2 cup olive oil",
        "1 pound fully cooked smoked kielbasa sausage, thinly sliced",
        "3 garlic cloves, peeled, flattened",
        "1 large fennel bulb with fronds, bulb and fronds chopped and reserved separately",
        "5 green onions, chopped",
        "2 heads frisée lettuce or 1 large head curly endive, separated into leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mustard",
        "Onion",
        "Pork",
        "Vinegar",
        "Celery",
        "Fennel",
        "Lentil",
        "Carrot",
        "Winter",
        "Lettuce"
    ],
    "title": "Kielbasa and Lentil Salad with Warm Mustard-Fennel Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/kielbasa-and-lentil-salad-with-warm-mustard-fennel-dressing-104268"
}
