{
    "directions": [
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble and set aside.",
        "Heat a large stock pot over medium-high heat and cook and stir the ground beef until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the bacon and minced garlic. Reduce heat to medium-low and stir in the red wine, diced tomatoes, and tomato sauce.",
        "Heat the vegetable oil in a skillet over medium heat. Stir in the green bell peppers, celery, and chopped onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir onion mixture into the stock pot. Increase the heat to medium-high and bring to a near boil. Mix in the kidney beans, white beans, and black beans. Season with chili powder, brown sugar, cumin, paprika, Italian seasoning, vinegar, basil, dried minced onion, parsley, red pepper flakes, oregano, hot pepper sauce, salt, and pepper. Reduce heat to medium-low and simmer for 1 hour 30 minutes, stirring often."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F935150.jpg",
    "ingredients": [
        "1 (1 pound) package bacon",
        "3 pounds ground beef",
        "4 cloves garlic, minced",
        "2 cups red wine",
        "3 (28 ounce) cans diced tomatoes",
        "2 (14 ounce) cans tomato sauce",
        "2 teaspoons vegetable oil",
        "3  green bell peppers, chopped",
        "4 stalks celery, chopped",
        "2  onions, chopped",
        "2 (19 ounce) cans kidney beans, rinsed and drained",
        "2 (19 ounce) cans white beans, rinsed and drained",
        "1 (19 ounce) can black beans, rinsed and drained",
        "6 tablespoons chili powder",
        "¼ cup brown sugar",
        "¼ cup ground cumin",
        "3 tablespoons paprika",
        "2 tablespoons Italian seasoning",
        "2 tablespoons distilled white vinegar",
        "2 tablespoons dried basil",
        "2 tablespoons dried minced onion",
        "3 tablespoons dried parsley",
        "2 tablespoons crushed red pepper flakes",
        "4 teaspoons dried oregano",
        "12 dashes hot pepper sauce (such as Tabasco®)",
        "salt and ground black pepper to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Killer Chili",
    "url": "http://allrecipes.com/recipe/213463/killer-chili/"
}