{
    "directions": [
        "Mix 1 tablespoon scallion, 2 tablespoons soy sauce, vinegar, and gochugaru in a small bowl. Set dipping sauce aside.",
        "Mix pork, 1 teaspoon garlic, sesame oil, and remaining 1 teaspoon soy sauce in a small bowl. Chill for 30 minutes or up to 1 day.",
        "Drain beans, reserving 1 cup soaking liquid. Purée beans and 1/2 cup soaking liquid in a blender, adding more water by tablespoonfuls if necessary, until mixture is a thick, slightly chunky paste. Transfer to a large bowl. Add 3/4 cup scallions, 1 teaspoon garlic, kimchi, and chile to bean purée. Mix well; season batter with salt. Stir in pork mixture.",
        "Heat 2 tablespoons vegetable oil in a large nonstick or cast-iron skillet over medium-high heat. Working in batches, spoon 1/4-cupfuls of batter into skillet, spreading each out to 3 1/2\"-4\" rounds. Cook, adjusting heat if browning too quickly and adding more oil between batches, until fritters are golden brown and cooked through, 2-3 minutes per side.",
        "Serve pancakes with dipping sauce and Pickled Pears."
    ],
    "ingredients": [
        "1 tablespoon plus 3/4 cup thinly sliced scallions",
        "2 tablespoons plus 1 teaspoon soy sauce",
        "2 teaspoons distilled white vinegar",
        "1/2 teaspoon gochugaru (Korean red pepper powder) or crushed red pepper flakes",
        "4 ounces ground pork (about 1/3 cup)",
        "2 teaspoons finely grated garlic, divided",
        "1/2 teaspoon toasted sesame oil",
        "1 1/2 cups dried peeled split yellow mung beans, soaked for 3 hours or up to overnight",
        "1 1/2 cups (packed) chopped cabbage kimchi (12 ounces), excess liquid squeezed out",
        "1 red or green Thai chile, thinly sliced",
        "Kosher salt",
        "4 tablespoons (about) vegetable oil, divided",
        "Pickled Pears",
        "Ingredient info: Split yellow mung beans are sold at some supermarkets, at Indian and Asian markets, and at amazon.com. Kimchi is sold at some supermarkets, at Korean markets, and at arirangkimchee.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Pork",
        "Appetizer",
        "Side",
        "Fry",
        "Legume",
        "Cabbage",
        "Soy Sauce",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Kimchi Fritters with Soy Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/kimchi-fritters-with-soy-dipping-sauce-394667"
}
