{
    "directions": [
        "Remove discolored, bruised outer leaves of cabbage and rinse cabbage under cold water. Cut cabbage head into 2-inch pieces.",
        "Divide 3 cups water among 3 bowls. Stir 1 cup sea salt into each bowl of water. Sprinkle the remaining 1 cup sea salt over cabbage.",
        "Place salted cabbage in the 3 bowls salted water until partially submerged; let sit 6 to 12 hours.",
        "Rinse cabbage thoroughly under cold water several times. Squeeze cabbage to remove excess water. Cabbage should have a rubbery texture. Transfer cabbage to a colander or basket to thoroughly drain the cabbage, at least 2 hours.",
        "Combine 3 cups water and rice flour in a saucepan; bring to a boil. Whisk mixture until a glue-like consistency, 5 to 10 minutes. Remove saucepan from heat and cool rice mixture to room temperature.",
        "Combine onion, garlic, ginger, and 1 tablespoon water in a food processor; pulse until smooth, adding more water if needed.",
        "Pour chile flakes into a large bowl; stir in onion-garlic mixture, cooled rice flour mixture, fish sauce, shrimp, brown sugar, and sesame seeds until well mixed. Add radish and green onions and mix well.",
        "Coat each cabbage piece with chile mixture by using your hands. (Rubber gloves are highly recommended.) Pack coated cabbage leaves inside air-tight glass jars or containers; cover each tightly with a lid. Keep jars at room temperature for fermentation to occur, about 2 days. Refrigerate kimchi after the 2 days."
    ],
    "ingredients": [
        "3 heads Napa cabbage",
        "3 cups water",
        "4 cups coarse sea salt",
        "3 cups water",
        "3 tablespoons sweet rice flour",
        "1 yellow onion",
        "12 cloves garlic, peeled",
        "2 tablespoons minced fresh ginger root",
        "1 tablespoon water, or as needed",
        "4 cups Korean red chile flakes (gochugaru)",
        "1/2 cup fish sauce",
        "1/4 cup dried salted shrimp (saeujeot)",
        "2 tablespoons brown sugar",
        "1 tablespoon sesame seeds, or more to taste",
        "2 cups Korean radish, cut into matchstick-size pieces",
        "3 green onions, cut into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kimchi (Korean Fermented Spicy Cabbage)",
    "url": "http://allrecipes.com/recipe/238503/kimchi-korean-fermented-spicy-cabbag/"
}
