{
    "directions": [
        "Preheat the oven to 300 degrees F.",
        "In a medium bowl, combine the graham cracker crumbs with the melted butter until well mixed and the consistency of wet sand. Press the crumb mixture into the bottom and up the sides of a 9-inch springform pan to create the crust. Wrap the outside of the pan with aluminum foil and set aside until ready to use.",
        "In the bowl of a stand mixer, add the cream cheese and sugar and cream together. Add the whole eggs one at a time, mixing well after each addition. Add the egg yolks, eggnog, vanilla and cinnamon, mixing well after each ingredient.",
        "Divide the mixture equally among 3 bowls and add purple food coloring to one bowl, yellow to another and green to the third. Mix the color into each bowl of batter, adding more until the desired hue is attained (traditionally the king cake has deep, rich, \"royal\" colors). Transfer all 3 batters into 1 bowl, and use 2 motions with a spoon to swirl the colors together. Pour the mixture into the graham cracker crust.",
        "Place the springform pan into a deep baking dish. Add approximately 1/2 inch of water to the baking dish to create a water bath, and bake until the cake is just set, about 1 hour.",
        "Allow the cake to cool and then refrigerate for at least 2 hours before slicing and serving. Garnish the slices with whipped cream and festive chocolate curls."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs",
        "1/2 cup (1 stick) unsalted butter, melted",
        "Three 8-ounce packages cream cheese, softened",
        "3/4 cup sugar",
        "6 large eggs plus 6 large egg yolks",
        "1/2 cup eggnog",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon cinnamon",
        "Purple food coloring, as needed",
        "Yellow food coloring, as needed",
        "Green food coloring, as needed",
        "Whipped cream, for garnish",
        "Chocolate curls, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cream Cheese Recipes",
        "Dessert"
    ],
    "title": "King Cake Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/king-cake-cheesecake"
}
