{
    "directions": [
        "Place the warm water, salt, softened butter, egg, sour cream, 3 1/2 tablespoons of sugar, flour, and yeast into a bread machine in the order recommended by the manufacturer, select the dough cycle, and start the machine. Check the dough after about 5 minutes of mixing, and add 1 to 2 more tablespoons of water or flour if the dough is too dry or wet.",
        "Mix 1/4 cup of sugar, the cinnamon, and 2 1/2 tablespoons of melted butter together in a bowl. Grease a baking sheet, and set aside.",
        "When the dough cycle is finished, remove the dough and roll out to a 10x28-inch rectangle on a floured surface. Spread the cinnamon-butter mixture over the dough, and sprinkle on an even layer of pecans. Pick up one of the long edges, and roll the dough into a 28-inch long log. Place the rolled dough onto the prepared baking sheet, seam side down, and form the dough into a ring. Moisten the ends of the dough with a little water; pinch the two ends together to seal. Cover the dough ring with a cloth, and let rise in a warm place until doubled in size, about 30 minutes.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Bake the cake in the preheated oven until the top is golden brown, about 15 minutes.",
        "Mix the confectioners' sugar, 1 1/2 tablespoons of melted butter, vanilla extract, and just enough milk to make a smooth but not thin glaze.",
        "Remove the cake from the oven, and cool for about 10 minutes on a wire rack. While the cake is still warm, spoon the glaze onto the cake, allowing drips of glaze to dribble down the sides of the cake. Immediately sprinkle the cake with alternating bands of purple, green, and yellow colored sugar. Allow the cake to cool completely before serving."
    ],
    "ingredients": [
        "1/4 cup warm water (100 to 110 degrees F/40 to 45 degrees C), or as needed",
        "1/2 teaspoon salt",
        "2 tablespoons softened butter",
        "1 egg, slightly beaten",
        "1 cup sour cream",
        "3 1/2 tablespoons white sugar",
        "3 1/2 cups all-purpose flour, or as needed",
        "2 1/2 teaspoons active dry yeast",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "2 1/2 tablespoons melted butter",
        "1/2 cup chopped pecans",
        "1 1/2 cups confectioners' sugar",
        "1 1/2 tablespoons melted butter",
        "1/8 teaspoon vanilla extract",
        "2 tablespoons milk, or as needed",
        "1 tablespoon purple colored sugar, or as needed",
        "1 tablespoon green colored sugar, or as needed",
        "1 tablespoon yellow colored sugar, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "King Cake in a Bread Machine",
    "url": "http://allrecipes.com/recipe/213496/king-cake-in-a-bread-machine/"
}
