{
    "directions": [
        "Make the dough. Sift the flour with the sugar, sea salt, lemon zest, and yeast into the bowl of a food processor. Process on low speed, then add the eggs. Continue processing just until the dough pulls away from the sides of the bowl. Add the orange-flower water and rum and continue processing just until the dough pulls away from the sides of the bowl.",
        "Dice the candied orange peel, chop the butter into pieces, and add them both to the dough mixture. Process again just until the dough pulls away from the sides of the bowl. Place the dough in a large bowl and cover with a damp cloth. Set aside to rise for 2 hours at room temperature.",
        "Punch down the dough then place in the refrigerator for 2 hours.",
        "Remove the dough from the refrigerator and punch it down again. Line a baking sheet with parchment paper, roll out the dough into a square, and place it on the lined baking sheet. Bring the corners of the dough to the center and insert the bean. Turn the dough over and shape it into a ball. Press your thumb in the center to make a depression and push the dough out around it to form a ring or crown. Cover it with a damp cloth and set aside to rise until doubled in volume, at least 2 hours in a warm room (77°F to 82°F [25 to 28°C]).",
        "Preheat the oven to 360°F (180°C).",
        "Prepare the glaze. In a bowl, combine the egg yolks, whole eggs, sugar, and salt. Brush the crown with the glaze. Dip a pair of scissors in water, and make cuts in the top of the cake, so it resembles the points of a crown. Place it in the oven and bake 20 to 25 minutes.",
        "Warm the apricot preserve or jelly, then strain it. Remove the cake from the oven and transfer it to a wire rack, then brush with the jam. Sprinkle with the pearl sugar and decorate with strips of the candied melon, candied orange, and coarsely chopped almonds."
    ],
    "ingredients": [
        "1 cup (250 g) all-purpose flour",
        "2 Tbsp (20 g) superfine granulated sugar",
        "1 tsp (5 g) fleur de sel de Guérande (or other fine sea salt)",
        "Finely grated zest of 1/4 unwaxed lemon",
        "1 1/2 tsp (8 g) active dry yeast",
        "2 eggs (100 g)",
        "2 Tbsp (35 g) orange-flower water",
        "2 tsp (10 g) aged dark rum",
        "1 1/4 oz (35 g) candied orange peel",
        "1 stick plus 2 Tbsp (150 g) unsalted butter",
        "1 dried lima bean",
        "1 egg yolk",
        "2 whole eggs",
        "3 dashes superfine granulated sugar",
        "Dash of table salt",
        "Apricot jelly or preserve",
        "Number 10 pearl sugar (coarse sugar)",
        "2 quarters each of candied red and green melon",
        "Candied orange slices",
        "Coarsely chopped almonds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Fruit",
        "Bake",
        "Christmas",
        "Orange",
        "Melon",
        "Winter",
        "Chill",
        "Advance Prep Required"
    ],
    "title": "King's Cake",
    "url": "http://www.epicurious.com/recipes/food/views/kings-cake-394707"
}
