{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 200°F. Line 2 large baking sheets with parchment.",
        "Beat egg whites in a bowl with an electric mixer at medium-high speed until whites are foamy, then add cream of tartar and salt. Continue beating until whites hold soft peaks. Add 1/2 cup superfine sugar, 1 tablespoon at a time, beating, then increase mixer speed to high and continue to beat until whites hold stiff, glossy peaks, about 5 minutes. Fold in remaining 1/2 cup superfine sugar gently but thoroughly.",
        "With back of a spoon, spread meringue into 10 (4-inch) rounds, 5 on each lined baking sheet. Form a 3-inch-wide depression in center of each round (shape and smooth exterior side of each round with a butter knife if desired).",
        "Using a fine-mesh sieve, lightly dust confectioners sugar evenly over meringues. Bake, with oven door propped open about 1/2 inch with handle of a wooden spoon, until meringue is crisp, about 2 1/2 hours. Turn oven off and let meringues stand in oven, with door propped open, until dry, at least 1 hour. Carefully peel off parchment.",
        "Whisk together flour, cornstarch, a pinch of salt, and 2 tablespoons granulated sugar in a small bowl. Whisk together yolks in a medium bowl, then whisk in flour mixture until smooth.",
        "Bring milk just to a boil with remaining 2 tablespoons sugar in a 1 1/2- to 2-quart heavy saucepan, stirring until sugar is dissolved. Remove from heat and whisk half of milk mixture into egg mixture. Pour custard back into pan, whisking, and bring to a boil over moderate heat, whisking constantly and vigorously, then boil, whisking, 2 minutes. Remove from heat and whisk in butter and vanilla. Using a rubber spatula, force cream through a medium-mesh sieve into a shallow bowl. Chill pastry cream, its surface covered with wax paper, 2 hours.",
        "Whisk heavy cream vigorously in a medium bowl until it just holds stiff peaks. Whisk pastry cream briefly to loosen, then, using spatula, gently fold in whipped cream. Chill, covered, 30 minutes.",
        "Fill each meringue shell with about 3 tablespoons pastry cream and smooth top of filling with back of a spoon.",
        "Divide kiwis evenly among shells, then sprinkle pomegranate seeds over tops."
    ],
    "ingredients": [
        "4 large egg whites (reserve yolks for pastry cream), at room temperature for 30 minutes",
        "1/4 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "1 cup superfine granulated sugar",
        "1 teaspoon confectioners sugar",
        "1 1/2 tablespoons all-purpose flour",
        "2 teaspoons cornstarch",
        "1/4 cup granulated sugar",
        "4 large egg yolks",
        "1 cup whole milk",
        "1 tablespoon unsalted butter, softened",
        "1/2 teaspoon vanilla",
        "1/2 cup chilled heavy cream",
        "8 to 10 kiwifruit (1 1/2 lb), peeled and each cut lengthwise into 8 wedges",
        "1/2 cup pomegranate seeds (from 1 pomegranate)",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Kiwi",
        "Fall",
        "Winter",
        "Pomegranate",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Kiwi-Pomegranate Angel Pies",
    "url": "http://www.epicurious.com/recipes/food/views/kiwi-pomegranate-angel-pies-236431"
}
