{
    "directions": [
        "In a large bowl, stir together the flour, baking soda, baking powder, salt and sugar. Make a well in the center, and pour in the eggs and 1 cup of milk. Stir to blend, and add enough additional milk to make a moist battery dough, not like pancake batter. Use a sturdy wooden spoon to beat the dough at least 200 strokes, rolling it over and over in the bowl until smooth and an occasional bubble appears on the surface. Add the dry white bread cubes, and stir into the dough until they disappear.",
        "Bring a large pot of water to a boil. Place the dough onto a cheesecloth or white cotton cloth, and form into a loaf shape. Wrap the cloth around the loaf, and tie the ends.",
        "Place the loaf into the boiling water, and cook for 45 minutes, turning the loaf over about half way through. Remove from the water, unwrap, and cover with a tea towel. Let stand for 10 minutes.",
        "Fry bacon in a small skillet over medium-high heat until evenly browned. Set aside. Place the drained sauerkraut into a saucepan, and add enough water to cover the surface. Bring to a simmer over medium heat. Add bacon, and season with salt, pepper and caraway seeds. Stir together the cornstarch and water; mix into the sauerkraut, and simmer for a few minutes before removing from the heat.",
        "Slice the dumpling loaf.  Drizzle dumpling slices with some of the roast drippings from the pan. Serve with sauerkraut."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon sugar",
        "3 eggs, beaten",
        "1 1/2 cups milk, or as needed",
        "4 cups dry white bread cubes",
        "4 slices bacon, sliced into small strips",
        "1 (16 ounce) jar sauerkraut - rinsed and drained",
        "salt and pepper to taste",
        "1 teaspoon caraway seeds",
        "2 teaspoons cold water",
        "1 teaspoon cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Knedliky - Czech Dumpling with Sauerkraut (Zeli)",
    "url": "http://allrecipes.com/recipe/69832/knedliky---czech-dumpling-with-sauerk/"
}
