{
    "directions": [
        "For the spicy mango sauce: Combine the mango, chili paste, cilantro, salt and lime juice in a bowl. Set aside.",
        "For the coconut shrimp: Add about 4 inches canola oil to a medium Dutch oven or large high-sided skillet. Heat over medium heat until a deep-frying thermometer inserted in the oil registers 325 degrees F.",
        "Set up a breading station using 2 shallow bowls or pie pans. In one bowl, whisk together the flour, coconut flakes, sugar and some salt and pepper. In the second bowl, whisk together the cream of coconut, hot sauce, eggs and 3 tablespoons warm water.",
        "One at a time, dip the shrimp into the egg mixture, then dredge in the dry mixture, making sure the shrimp are thoroughly coated. Transfer to a baking sheet.",
        "Fry the shrimp in batches until golden brown, about 5 minutes, making sure to turn them occasionally. Remove to a plate or baking sheet lined with paper towels to drain. Serve immediately or hold for up to 10 minutes in the oven at 200 degrees F.",
        "Serve the shrimp with the spicy mango sauce on the side."
    ],
    "ingredients": [
        "1 cup mango puree or nectar",
        "1 tablespoon chili paste",
        "1 tablespoon chopped fresh cilantro",
        "Pinch of kosher salt",
        "Juice of 2 limes (about 1/4 cup)",
        "Canola oil, for deep-frying",
        "1 cup all-purpose flour",
        "1 cup packed sweetened coconut flakes",
        "2 teaspoons sugar",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup sweetened cream of coconut, warm",
        "1 teaspoon hot sauce, such as Calypso",
        "2 eggs",
        "1 pound extra-jumbo shrimp (16/20 count), cleaned, deveined and butterflied"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Coconut Shrimp",
        "Coconut Recipes",
        "Fruit",
        "Shellfish Recipes",
        "Shrimp",
        "Spicy Shrimp",
        "Mango",
        "Main Dish Recipes",
        "Deep-Frying"
    ],
    "title": "Knockout Coconut Shrimp with Spicy Mango Sauce",
    "url": "http://www.foodnetwork.com/recipes/knockout-coconut-shrimp-with-spicy-mango-sauce"
}
