{
    "directions": [
        "Preheat the oven to 350 degrees F. Grease and flour a 9-by-9-inch baking pan.",
        "Begin by pouring 1/3 cup evaporated milk into a bowl with the cake mix. Add the melted butter and the chopped pecans. Mix the ingredients together; it'll be pretty thick!",
        "Divide the dough in half down the middle. Press half of it into the bottom of the prepared pan to make the first brownie layer. Bake until slightly set, 8 to 10 minutes. Then remove from the oven and set aside.",
        "While the brownie layer is baking, in a double boiler (or glass bowl set over a bowl of simmering water) combine the caramels and the remaining 1/2 cup evaporated milk. Stir occasionally until the caramels are totally melted and the mixture is smooth. Pour the caramel mixture over the first baked layer, spreading so it's evenly distributed. Sprinkle the chocolate chips all over the top.",
        "Next, on a clean surface or a sheet of waxed paper, press the remaining dough into a square shape slightly smaller than the baking pan. Carefully set it on top of the chocolate chips. Bake for 20 to 25 minutes. Remove the pan from the oven and let the brownies cool to room temperature. Cover the pan and refrigerate the brownies for several hours to allow them to set.",
        "When you're ready to serve them (or give them to someone you love!) sprinkle generously with the powdered sugar and cut them into large rectangles before removing from the pan. These are absolutely killer, my friends. Make them for someone you really, really love... or someone you want to love you back.",
        "It'll work. Guarantee it."
    ],
    "ingredients": [
        "1 stick butter, melted, plus more for greasing",
        "All-purpose flour, for dusting",
        "1/3 plus 1/2 cup evaporated milk",
        "One 18.5-ounce box German chocolate cake mix (I use Duncan Hines)",
        "1 cup finely chopped pecans",
        "60 caramels, unwrapped",
        "1/3 cup semisweet chocolate chips",
        "1/4 cup powdered sugar, sifted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Brownie",
        "Nut Recipes",
        "Chocolate"
    ],
    "title": "Knock-You-Naked Brownies",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/knock-you-naked-brownies-recipe"
}
