{
    "directions": [
        "Season goat meat with salt and 1 teaspoon turmeric. Sprinkle salt over potato halves.",
        "Heat oil in a pressure cooker over medium heat; add 1/2 teaspoon sugar and cook until browned, 2 to 3 minutes. Place potatoes in the caramelized sugar and cook until potatoes are golden, 2 to 3 minutes per side. Transfer potatoes to a plate.",
        "Combine cardamom, cloves, and cinnamon stick in the pressure cooker. Add onions, garlic, and ginger; cook and stir until softened and golden, 5 to 10 minutes. Mix tomatoes, remaining turmeric powder, and cayenne pepper into onion mixture; cook for 5 minutes. Season mixture with salt. Add goat meat; cook and stir until goat meat is coated with spice mixture and browned, 10 to 15 minutes. Pour enough water over mixture to cover goat meat. Cover pressure cooker with lid and cook according to manufacturer's instructions for 15 minutes.",
        "Remove pressure cooker from heat and let the steam release by itself; open the lid and season with more salt. Add remaining sugar and cut a piece of goat meat to ensure meat is cooked through.",
        "Return potatoes to pressure cooker. Add 1/2 cup water, cover pressure cooker with lid, and cook according to manufacturer's instructions for 2 whistles. Remove pressure cooker from heat and let the steam release naturally; check the salt and transfer goat meat to the serving container. Garnish with cilantro leaves."
    ],
    "ingredients": [
        "3 1/3 pounds baby goat meat, cut into small cubes",
        "salt to taste",
        "1 pinch ground turmeric (holud powder), divided",
        "3 potatoes, peeled and halved",
        "5 tablespoons vegetable oil",
        "1 teaspoon white sugar, divided",
        "3 cardamom pods",
        "4 whole cloves",
        "1 (1/2 inch) piece cinnamon stick",
        "3 onions, sliced",
        "4 cloves garlic, minced, or more to taste",
        "1 (1 inch) piece fresh ginger, cut into thin slices",
        "2 small tomatoes, chopped",
        "1 green chile pepper, chopped, or more to taste",
        "3/4 teaspoon cayenne pepper",
        "2 cups water, or as needed",
        "1 teaspoon chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kochi Panthar Jhol (Goat Curry)",
    "url": "http://allrecipes.com/recipe/245939/kochi-panthar-jhol-goat-curry/"
}
