{
    "directions": [
        "Mix the meat with the onion, salt, pepper, cinnamon, and allspice and knead to a soft paste. Make little balls or ovals the size of a small walnut. You may fry very briefly in oil, shaking the pan, to brown them slightly all over, then drain on paper towels. Alternatively, put them on a baking sheet and roast them for about 7 minutes in the hottest oven, until slightly colored.",
        "In a large saucepan, fry the garlic in the oil till colored. Add the tomatoes, salt, pepper, tomato puree, and sugar and simmer 15 minutes. Then put in the meatballs and simmer another 20 minutes.",
        "Serve with rice.",
        "· Tunisian meatballs may have 3 tablespoons chopped flat-leafed parsley or coriander, 1 tablespoon chopped mint, a small onion chopped fine, a crushed garlic clove, 1 teaspoon cinnamon, 1 teaspoon rosebud powder, and 1/2 teaspoon harissa.",
        "· Spices in an Indian Baghdadi kofta include 1/4 teaspoon ground ginger and 1/4 teaspoon turmeric. Another version has 1 tablespoon garam masala and a pinch of chili powder.",
        "· Some people like to incorporate an egg and 1 or 2 slices of bread soaked in water and squeezed dry, which bind the meat and result in a softer texture.",
        "· Some drop the meatballs in the sauce without preliminary frying or roasting and cook them for 25 minutes. This gives them a slightly different texture.",
        "· For a Syrian version called \"Daoud Pasha,\" stuff each meatball with a few pine nuts.",
        "· In Salonika they sometimes added 1 tablespoon of honey instead of sugar to the tomato sauce.",
        "· Italian Jews make polpette alla giudea on the same principle but with a very special flavor. Soak 4 oz (100 g) bread, crusts removed, in water, and squeeze dry, then blend with 1 lb (500 g) ground meat, 2 crushed cloves of garlic, a bunch of flat-leafed parsley finely chopped, salt, pepper, a pinch of nutmeg, and 2 eggs. Take small lumps and shape them into flat patties. Fry them in oil, turning them over once. Cook 1 lb (500 g) peeled and chopped tomatoes with the grated peel of 1/2 lemon, 2 tablespoons vinegar, 2 teaspoons sugar, salt, and pepper for 10 minutes. Add a tablespoon each of chopped flat-leafed parsley and basil. Drop in the meat patties, and cook 5 minutes longer."
    ],
    "ingredients": [
        "1 1/2 lbs (600 g) ground lamb, beef, or veal",
        "1 large onion, finely chopped or grated",
        "About 1/2—3/4 teaspoon salt",
        "Pepper",
        "1 teaspoon cinnamon",
        "1/2 teaspoon allspice",
        "Sunflower oil for frying (optional)",
        "4 garlic cloves, minced or crushed in a press",
        "2 tablespoons sunflower oil",
        "2 lbs (1 kg) tomatoes, peeled and chopped, or a 28-oz (800-g) can of tomatoes",
        "Salt and pepper",
        "2 tablespoons tomato puree",
        "1-2 teaspoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Lamb",
        "Tomato",
        "Dinner",
        "Veal",
        "Kosher"
    ],
    "title": "Kofta à la Sauce Tomate",
    "url": "http://www.epicurious.com/recipes/food/views/kofta-a-la-sauce-tomate-350154"
}
