{
    "directions": [
        "To make the dipping sauce, peel, core and finely dice the pear. Trim the green onions, including 1 inch of the tender green tops, and then thinly slice. In a nonreactive bowl, whisk together the pear, green onions, garlic, soy sauce, sherry, mirin, sesame oil, brown sugar, honey, ginger, red pepper flakes and toasted sesame seeds. Transfer to a small serving bowl.",
        "In a dry fry pan over medium-low heat, toast the sesame seeds just until golden, 1 to 2 minutes. Set aside. Peel, core and quarter the pear. In a blender or food processor, combine the sesame seeds, pear, garlic, green onions, soy sauce, sherry, mirin, sesame oil, brown sugar and honey. Process on high speed until smooth. Set the marinade aside.",
        "Place the short ribs, bone side down, on a cutting board. Using a sharp knife, cut the meat away from the bones; discard or reserve the bones for the marinade. Working with the blade parallel to the cutting board, butterfly each piece of rib meat by cutting three-fourths of the way through and opening it to form a rectangle. Season the meat with salt and pepper and place in a shallow dish with the bones, if using. Pour the marinade over the meat and turn to coat well. Cover and refrigerate for at least 2 hours or up to 4 hours. Remove from the refrigerator 30 minutes before grilling.",
        "Prepare a medium-hot fire in a grill. Brush and oil the grill grate.",
        "Grill the short ribs directly over medium-high heat, turning once, until browned and caramelized, 6 to 10 minutes per side for medium-rare, or until done to your liking.",
        "Transfer the meat to a carving board. Slice the meat and arrange on a platter with the lettuce leaves (using only the outer leaves) and garnish with the cilantro and sliced peppers. Serve hot with the dipping sauce. Serves 6.",
        "Adapted from Williams-Sonoma",
        "On the Grill,",
        "by Willie Cooper (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1 Asian pear",
        "2 green onions",
        "2 to 3 garlic cloves, minced",
        "1/2 cup soy sauce",
        "1/2 cup dry sherry",
        "2 Tbs. mirin or other rice wine",
        "2 Tbs. sesame oil",
        "1 Tbs. firmly packed light brown sugar",
        "1 Tbs. honey",
        "2 tsp. peeled and grated fresh ginger",
        "1 tsp. red pepper flakes",
        "1 tsp. sesame seeds, toasted",
        "2 Tbs. sesame seeds",
        "1 Asian pear",
        "3 garlic cloves",
        "2 green onions",
        "1/2 cup soy sauce",
        "1/2 cup dry sherry",
        "2 Tbs. mirin or other rice wine",
        "2 Tbs. dark sesame oil",
        "1 Tbs. firmly packed light brown sugar",
        "1 Tbs. honey",
        "6 beef short ribs, about 2 lb. total, each 2 to 3 inches long",
        "Salt and freshly ground pepper, to taste",
        "2 romaine lettuce heads",
        "1/4 cup minced fresh cilantro",
        "Sliced chili peppers for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Korean-Style Barbecue Short Ribs",
    "url": "http://www.williams-sonoma.com/recipe/korean-style-barbecue-short-ribs.html"
}
