{
    "directions": [
        "Cut the beef across the grain into slices 1⁄8 inch thick. Working on a cutting board, use the side of the blade of a chef's knife or cleaver to mash together three-fourths of the chopped garlic and the 1 Tbs. sugar, forming a paste. Place the paste in a bowl and stir in 3 Tbs. of the light soy sauce, the dark soy sauce, the 1 Tbs. sesame oil, 1 Tbs. of the vinegar, all but 1 Tbs. of the minced green onions, the ginger, 1 Tbs. of the sesame seeds, the black pepper and 1 Tbs. of the water. Place the beef in a shallow bowl and pour the marinade on top. Mix well, cover and refrigerate for 1 to 3 hours.",
        "Meanwhile, make the dipping sauce: On a cutting board, use the side of the blade of a chef's knife or cleaver to mash together the remaining chopped garlic and the 1⁄2 tsp. sugar, forming a paste. Place the paste in a bowl and whisk in the remaining 3 Tbs. light soy sauce, the remaining 1 Tbs. vinegar, the chili sauce, the 1 tsp. sesame oil, the reserved 1 Tbs. minced green onions, the remaining 1 Tbs. sesame seeds and the remaining 1 Tbs. water. Set aside until ready to serve.",
        "Prepare a hot fire in a grill or preheat a grill pan over high heat.",
        "Brush the grill rack or pan with the canola oil. Remove the beef from the marinade and pat dry. Discard the marinade. Working in batches, arrange the beef in a single layer on the grill or in the grill pan. Sear, turning once, until crisp and brown on both sides, about 2 minutes per side. Wipe and oil the rack or pan between batches, if necessary.",
        "Transfer to a warmed platter, garnish with the shredded green onion and serve immediately with the dipping sauce. Serves 4 to 6.",
        "Serving Tip:",
        "The beef can be served on red-leaf lettuce leaves with rice, kimchi (spicy fermented cabbage) and a drizzling of the dipping sauce."
    ],
    "ingredients": [
        "1 1⁄2 lb. beef tenderloin, about 5 inches thick",
        "4 garlic cloves, chopped",
        "1 Tbs. plus 1⁄2 tsp. sugar",
        "6 Tbs. light soy sauce",
        "1 Tbs. dark soy sauce",
        "1 Tbs. plus 1 tsp. Asian sesame oil",
        "2 Tbs. rice vinegar",
        "5 green onions, minced, plus shredded green onion for garnish",
        "1 tsp. grated peeled fresh ginger",
        "2 Tbs. sesame seeds, toasted and crushed",
        "1⁄2 tsp. freshly ground black pepper",
        "2 Tbs. water",
        "1 tsp. Sriracha chili sauce",
        "1 Tbs. canola oil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Korean Barbecued Beef",
    "url": "http://www.williams-sonoma.com/recipe/korean-barbecued-beef.html"
}
