{
    "directions": [
        "Wash rice in several changes of cold water until water is almost clear, then drain in a sieve. Bring rice and water (2 cups) to a boil in a 1 1/2- to 2-quart heavy saucepan, uncovered, then reduce heat to low and cook, covered, until water is absorbed and rice is tender, about 20 minutes. Remove from heat and let stand, covered, 10 minutes, then stir rice from top to bottom. Keep warm, covered.",
        "Wash spinach well and cook in a 4- to 5-quart pot of boiling salted water , stirring, until just wilted, 15 to 30 seconds. Transfer with tongs to a large bowl of ice and cold water to stop cooking, reserving cooking water. Drain spinach and squeeze small handfuls to remove as much moisture as possible. Return spinach-cooking water to a boil, then add bean sprouts and cook, stirring, until just tender, 2 to 3 minutes. Drain in a colander.",
        "Holding each carrot at a 45-degree angle to slicer, cut carrots into thin (1/8-inch) matchsticks. Cut skin and firm flesh of zucchini lengthwise into long strips using slicer, avoiding center core with seeds (discard core). Rinse and drain fern stems, then cut off and discard any dark or hard pieces. Cut ferns crosswise into 2-inch pieces.",
        "Heat 2 teaspoons vegetable oil in a 12-inch nonstick skillet over moderately high heat, swirling to coat, until hot but not smoking, then sauté mushrooms, 1 teaspoon garlic, and 1/4 teaspoon salt, stirring, until mushrooms are tender, about 3 minutes. Stir in 1/4 teaspoon sesame oil and transfer to a small bowl. Wipe skillet clean with a paper towel. Working with each vegetable separately, sauté carrots, zucchini, bean sprouts, fern stems, and spinach, each in 2 teaspoons vegetable oil with 1 teaspoon garlic and 1/4 teaspoon salt, in same manner, then stirring in 1/4 teaspoon sesame oil for each. Transfer each vegetable to its own bowl as cooked and season with salt. Stir 1 teaspoon sesame seeds into spinach.",
        "Wipe skillet clean and heat remaining 2 teaspoons vegetable oil over moderate heat until hot but not smoking, then crack eggs into skillet and fry until whites are cooked and yolks begin to set, 4 to 6 minutes.",
        "Divide rice among 4 shallow bowls, mounding it into a dome. Arrange vegetables on top of rice and place 1 egg on top of each rice bowl. Spoon 1 tablespoon hot-pepper paste over each serving, then sprinkle with nori and remaining teaspoon sesame seeds."
    ],
    "ingredients": [
        "1 2/3 cups Asian short-grain white or sushi rice",
        "2 cups water",
        "1 (10- to 12-ounce) bunch flat-leaf spinach, stems discarded",
        "1/2 pound fresh soybean or mung-bean sprouts, trimmed",
        "2 large carrots",
        "1 small zucchini, trimmed",
        "1 cup drained preserved fiddlehead fern stems (also called bracken fern, kosari, or warabi; optional)",
        "1/4 cup plus 2 teaspoons vegetable oil",
        "6 ounces fresh shiitake mushrooms, stems discarded and caps cut into very thin slices (2 cups)",
        "6 teaspoons finely chopped garlic (from 4 cloves)",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons Asian sesame oil",
        "2 teaspoons sesame seeds, toasted and coarsely chopped",
        "4 large eggs",
        "4 tablespoons Korean hot-pepper paste (sometimes labeled \"gochujang\")",
        "8 (3 1/2 - by 3-inch) sheets toasted nori (dried laver, preferably seasoned), cut into thin strips with scissors",
        "Special equipment : an adjustable-blade slicer fitted with julienne blade",
        "Accompaniments: packaged cabbage kimchi (Korean spicy pickled cabbage) or other vegetable kimchi"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Mushroom",
        "Rice",
        "Vegetable",
        "Gourmet"
    ],
    "title": "Korean Vegetable Rice Bowl",
    "url": "http://www.epicurious.com/recipes/food/views/korean-vegetable-rice-bowl-238434"
}
