{
    "directions": [
        "Whisk pear juice, soy sauce, vinegar, vegetable oil, garlic, sesame oil, ginger, gochujang, brown sugar, and salt in a medium bowl.",
        "Pour 1 cup marinade into a large resealable bag or bowl; reserve remaining marinade. Whisk in gochujang, brown sugar, and salt. Add steak and toss to coat, then let rest at room temperature at least 1 hour.",
        "Heat oil in a large skillet over medium-high. Remove steak from marinade and pat dry; discard marinade. Cook steak until an instant-read thermometer inserted into the center registers 125°F, 2–3 minutes per side for medium rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.",
        "Toss cabbage, 1 Tbsp. marinade, and 1 Tbsp. vinegar in a small bowl. Toss carrots, 1 Tbsp. marinade, and remaining 1 Tbsp. vinegar in another small bowl. Let rest at least 10 minutes.",
        "Toss spinach, grains, and salt with 1/2 cup marinade in a large bowl. Divide among 4 bowls. Top with beef, cabbage, carrots, peas, and kimchi, if using. Place 1 fried egg in the center of each bowl, if using. Top with scallion and sesame seeds. Serve with gochujang and remaining marinade alongside.",
        "Steak can be marinated 10 hours ahead; chill in bag. Let steak come to room temperature at least 1 hour before cooking. Cabbage and carrots can be marinated 1 day ahead; cover and chill."
    ],
    "ingredients": [
        "1 cup pear juice",
        "1/2 cup low-sodium soy sauce",
        "1/2 cup rice wine vinegar",
        "1/4 cup neutral vegetable oil, such as grapeseed",
        "3 garlic cloves, finely grated",
        "2 tablespoons toasted sesame oil",
        "1 tablespoon finely grated ginger",
        "1 teaspoon gochujang or Sriracha",
        "1 teaspoon light brown sugar",
        "1/4 teaspoon kosher salt",
        "2 teaspoons gochujang or Sriracha",
        "1 teaspoon light brown sugar",
        "1/2 teaspoon kosher salt",
        "1 1/2 pounds (1/2\"-thick) flanken-cut, bone-in short ribs or 1 pound (1/2\"-thick) boneless rib eye",
        "1 tablespoon neutral vegetable oil, such as grapeseed",
        "1 1/2 cups thinly sliced purple cabbage",
        "2 tablespoons rice wine vinegar, divided",
        "1 large carrot, julienned with a mandolin or coarsely grated using the large holes of a box grater",
        "4 cups baby spinach",
        "4 cups cooked grains, such as farro, quinoa, and/or brown rice",
        "1/2 teaspoon kosher salt",
        "6 ounces sugar snap peas, trimmed, strings removed, or snow peas, blanched",
        "1/2 cup kimchi, preferably daikon radish, sliced (optional)",
        "4 fried eggs (optional)",
        "1 scallion, thinly sliced",
        "2 teaspoons toasted sesame seeds",
        "Gochujang or Sriracha (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Grains",
        "Steak",
        "Asparagus",
        "Chile Pepper",
        "Cabbage",
        "Sugar Snap Pea",
        "Egg",
        "Flaming Hot Summer"
    ],
    "title": "Korean-Style Grain Bowls With Spicy Marinated Steak",
    "url": "http://www.epicurious.com/recipes/food/views/korean-style-grain-bowls-with-spicy-marinated-steak"
}
