{
    "directions": [
        "In a medium saucepan bring 2 cups water and cider vinegar to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, until rice grains are sticky and soft.",
        "In a medium saucepan, place chard in enough water to cover. Bring to a boil, and cook until tender. Cut into thin strips.",
        "Whisk the eggs with soy sauce and 3 tablespoons water. Pour into a medium skillet over medium heat. Cook until thickened. Remove from heat and cut into strips.",
        "Heat the vegetable oil in a medium saucepan over medium high heat. Slowly cook and stir the onion until tender. Mix in the beef and 1 tablespoon soy sauce, and cook until evenly brown. Drain and set aside.",
        "Preheat oven to 350 degrees F (175 degrees C). Place the nori sheets on a medium baking sheet, and heat in the preheated oven 1 to 2 minutes, until slightly crisp.",
        "Place the nori sheets, one at a time , on a bamboo rolling mat. Line the nori sheets evenly with approximately 3/4 inch (2 cm) depth of rice, taking care not to let the rice cover the edges of the nori. Beginning at one end of the nori sheet, top the rice with a stick of carrot, a line of tuna, chard, egg, a cucumber slice, and a line of beef. Repeat until the food reaches approximately the middle of the nori sheet. Roll the sheets carefully and tightly. Seal with a grain or two of the sticky rice. Slice each roll into approximately 4 pieces and serve."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7217666.jpg",
    "ingredients": [
        "2 cups uncooked short-grain white rice",
        "2 cups water",
        "2 tablespoons cider vinegar",
        "2 leaves chard",
        "2  eggs, well beaten",
        "2 tablespoons soy sauce, divided",
        "3 tablespoons water",
        "1  onion, diced",
        "1 tablespoon vegetable oil",
        "¾ pound beef tenderloin, minced",
        "1 (5 ounce) can tuna, drained",
        "1  carrot, julienned",
        "1  cucumber, julienned",
        "6 sheets nori (dry seaweed)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Korean Sushi",
    "url": "http://allrecipes.com/recipe/23954/korean-sushi/"
}