{
    "directions": [
        "Heat a large skillet over medium-high heat. Add ground beef; cook and stir until browned and crumbly, about 5 minutes. Drain off excess fat.",
        "Heat olive oil in a large pot over medium heat. Stir in 3/4 of the onion. Add green bell pepper, poblano pepper, red bell pepper, jalapeno peppers, habanero pepper, and garlic; cook and stir until onion is soft and translucent, about 5 minutes. Stir in cooked beef, chili beans, diced tomatoes, tomato paste, tomato sauce, water, and scallions.",
        "Stir chili powder, cumin, salt, black pepper, garlic powder, and cayenne into the pot. Bring chili to a simmer over medium heat. Reduce heat to medium-low; simmer, stirring occasionally, until flavors combine, about 2 hours.",
        "Remove chili from heat and cool briefly, about 30 minutes. Cover and refrigerate, 8 hours to overnight.",
        "Reheat chili by bringing it to a simmer over medium heat. Reduce heat to low and let chili cook slowly, stirring occasionally, for flavors to develop, 4 to 6 hours.",
        "Top servings of chili with shredded lettuce and remaining 1/4 cup chopped onion."
    ],
    "ingredients": [
        "2 1/2 pounds ground beef",
        "2 tablespoons olive oil",
        "1 large onion, chopped, divided",
        "1 green bell pepper, chopped",
        "1 poblano pepper, chopped",
        "1/2 red bell pepper, chopped",
        "2 jalapeno peppers, seeded and minced",
        "1 habanero pepper, seeded and minced",
        "3 cloves garlic, minced",
        "2 (15 ounce) cans chili beans",
        "1 (14.5 ounce) can diced tomatoes",
        "2 (6 ounce) cans tomato paste",
        "1 (8 ounce) can tomato sauce",
        "1 cup water",
        "3 tablespoons chopped scallions",
        "1/4 cup chili powder",
        "1 tablespoon ground cumin",
        "1 tablespoon salt",
        "1 1/2 teaspoons ground black pepper",
        "1 teaspoon garlic powder",
        "1/2 teaspoon ground cayenne",
        "1 cup shredded iceberg lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kosher Tailgate Chili",
    "url": "http://allrecipes.com/recipe/246242/kosher-tailgate-chili/"
}
