{
    "directions": [
        "Prepare 1 of the 3 fillings and refrigerate before you begin preparing dough:",
        "1. Heat corn oil in a skillet; sauté onions until nicely browned, remove with a slotted spoon, and set aside. Add meat to the pan and sauté on high heat, stirring frequently until all meat is browned. Put the onions back in, and sauté with meat, stirring constantly for 1 minute. Let cool.",
        "2. In a bowl, thoroughly mix meat-onion mixture with all remaining ingredients.",
        "1. Heat corn oil in a skillet, and sauté onions until nicely browned. At the last minute, add garlic, which browns quickly.",
        "2. In a large bowl, combine onion-garlic mixture with all other ingredients, and blend thoroughly.",
        "1. Combine all ingredients in a bowl, and blend thoroughly.",
        "1. Sift flour and 1 teaspoon salt into a large bowl, and create a well in the center.",
        "2. Pour eggs into the well, and, wetting your hands, knead into a dough. Add water, and continue kneading until dough is smooth. Roll dough into a ball, place it in a bowl, cover the bowl with a damp cloth, and refrigerate for 30 minutes.",
        "3. On a well-floured board, roll dough as close as possible to paper-thinness with a floured rolling pin. Cut into 2-inch squares. You can roll each individual square a bit thinner before you fill it. Have bowl with beaten egg, a teaspoon, and filling at hand.",
        "4. Place a flatware teaspoon of filling in the center of the square and fold diagonally to create a triangle. Seal sides with egg mixture.",
        "5. Bring a pot of water to a vigorous boil, add 1 tablespoon salt, drop in the kreplach, and cook for 20 minutes. Serve in chicken soup or, for dairy fillings, with sour cream and fried onions."
    ],
    "ingredients": [
        "3 cups flour",
        "1 teaspoon salt",
        "3 eggs, beaten",
        "3 tablespoons cold water",
        "1 egg, beaten, for binding kreplach",
        "1 tablespoon salt",
        "2 tablespoons corn oil",
        "3/4 cup finely chopped onion",
        "1/2 pound chopmeat",
        "1 egg yolk",
        "2 tablespoons finely chopped fresh parsley",
        "1 teaspoon salt",
        "1/4 teaspoon pepper",
        "2 tablespoons corn oil",
        "3/4 cup finely chopped onion",
        "1 teaspoon finely chopped or crushed fresh garlic",
        "1 egg yolk",
        "1 cup cooked, mashed potato",
        "2 tablespoons minced fresh parsley",
        "1 tablespoon minced scallions",
        "1 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 cup farmer cheese",
        "1/4 cup sugar",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Egg",
        "Potato",
        "Purim",
        "Sukkot",
        "Rosh Hashanah/Yom Kippur",
        "Kosher",
        "Shavuot"
    ],
    "title": "Kreplach",
    "url": "http://www.epicurious.com/recipes/food/views/kreplach-236219"
}
