{
    "directions": [
        "Wrap tofu in a paper towel and cover with plate; rest until moisture is removed, about 10 minutes.",
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Add cauliflower; cook and stir until tender, about 5 minutes.",
        "Preheat oven to 425 degrees F (220 degrees C). (If using a countertop convection oven, preheat to 400 degrees F (200 degrees C)). Place baking sheet inside to warm.",
        "Remove paper towel from tofu; discard. Place tofu onto heated baking sheet using heatproof gloves.",
        "Bake in the preheated oven, flipping once, until tofu is heated through, about 3 minutes per side in the conventional oven and 2 minutes per side in the countertop induction oven.",
        "Heat remaining 1 tablespoon olive oil in a wok on medium heat. Add onions and scallions; cook and stir until onions are slightly softened, about 5 minutes. Stir in garlic. Turn wok to high heat; stir in green peppers.",
        "Combine water and orange liqueur in a bowl. Pour 1 tablespoon liqueur mixture into wok; toss with 2 wooden spoons until mixed. Repeat with remaining liqueur mixture; cook and stir until evaporated, 3 to 5 minutes.",
        "Sprinkle soy sauce into the wok. Fold in tofu until coated.",
        "Place cauliflower in serving bowls and top with tofu mixture. Garnish with red chile peppers; season with salt."
    ],
    "ingredients": [
        "1 (14 ounce) package baked firm tofu, cut into 1-inch cubes",
        "2 tablespoons olive oil, or as needed, divided",
        "12 ounces riced cauliflower (such as Trader Joe's®)",
        "2 onions, chopped",
        "3 scallions, chopped",
        "2 cloves garlic, minced",
        "2 green bell peppers, chopped",
        "2 tablespoons water",
        "1 tablespoon orange liqueur (such as Grand Marnier®)",
        "1 tablespoon soy sauce",
        "2 red chile peppers, shredded",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kristy's Le Tofu Orange",
    "url": "http://allrecipes.com/recipe/255326/kristys-le-tofu-orange/"
}
