{
    "directions": [
        "Place golden raisins into a bowl, drizzle with vodka, and allow raisins to soften overnight.",
        "Mix 1 teaspoon sugar into lukewarm water in a bowl until sugar dissolves. Stir yeast into the water and let stand until the yeast mixture is frothy, about 10 minutes.",
        "Heat milk in a saucepan over medium-low heat until very warm but not simmering. Stir in saffron threads and cardamom, remove from heat, and let the milk mixture stand until lukewarm.",
        "Transfer yeast mixture into a large mixing bowl. Stir milk mixture, 1/2 cup sugar, and 1 cup flour into the yeast mixture, beating until the batter is smooth. Cover the bowl with plastic wrap and allow to rise in a warm place for 1 hour.",
        "Mix melted butter, 1/2 cup sugar, orange blossom honey, lemon zest, vanilla extract, and salt together in a bowl. Beat butter mixture into the batter, then beat in eggs and egg yolk.",
        "Mix 2 1/2 cups of flour into the dough. Sprinkle remaining 1/2 cup flour onto a work surface and knead dough until it holds together, about 5 minutes; knead soaked golden raisins and 1/2 cup almonds into the dough until well distributed.",
        "Form dough into a ball and place into an oiled bowl; turn dough around in the bowl several times to coat outside of dough. Cover bowl with plastic wrap and allow to rise in a warm place until doubled, about 1 1/2 hours.",
        "Punch down dough, knead a few times, and divide dough into 4 pieces. Coat inside of clean 14-ounce cans with butter. Line cans with parchment paper. Roll each piece of dough into a ball, place into a can, and press dough lightly against the inside bottom of can.",
        "Cover cans with a cloth and allow dough to rise to the top of the cans, about 45 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place a baking sheet into the oven; place the cans of dough upright into oven on baking sheet. Bake until kulich are risen and lightly browned, 45 to 50 minutes.",
        "Let kulich cool in the cans for about 15 minutes before gently removing from cans to finish cooling on racks.",
        "Beat egg white in a bowl with an electric mixer on medium speed until frothy; beat in confectioners' sugar until the mixture holds stiff peaks. Beat lemon juice into frosting.",
        "Frost the tops of the kulich and sprinkle tops with 2 tablespoons toasted sliced almonds. Refrigerate leftovers."
    ],
    "ingredients": [
        "1 cup golden raisins",
        "1 tablespoon vodka",
        "1 teaspoon white sugar",
        "1/4 cup lukewarm water",
        "1 (.25 ounce) package active dry yeast",
        "1 cup milk",
        "1 pinch saffron threads",
        "1 teaspoon ground cardamom",
        "1/2 cup white sugar",
        "1 cup all-purpose flour",
        "1/2 cup butter, melted",
        "1/2 cup white sugar",
        "1/4 cup orange blossom honey",
        "1 lemon, zested",
        "2 teaspoons vanilla extract",
        "1 pinch salt",
        "2 eggs",
        "1 egg yolk",
        "3 cups all-purpose flour, divided",
        "1/2 cup sliced almonds",
        "4 clean 14-ounce food cans",
        "1 egg white",
        "1 1/2 cups confectioners' sugar, or more as needed",
        "1/2 teaspoon lemon juice",
        "2 tablespoons toasted sliced almonds, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kulich (Russian Easter Cake)",
    "url": "http://allrecipes.com/recipe/220937/kulich-russian-easter-cake/"
}
