{
    "directions": [
        "Whisk together 1 tablespoon white wine, 1 tablespoon soy sauce, 1 teaspoon brown sugar, and finely chopped green onion.",
        "Stir in chicken pieces to coat. Cover and refrigerate for 1 hour.",
        "Combine white vinegar, rice vinegar, 1 tablespoon soy sauce, sambal chile paste, sesame oil, 2 tablespoons brown sugar, ketchup, 2 tablespoon white wine, and garlic in a bowl. Whisk thoroughly; set aside.",
        "Mix cornstarch with cold water in a small bowl.",
        "Heat peanut oil in a heavy duty, nonstick skillet over high heat. Stir in chicken; cook and stir until chicken begins to brown, about 2 minutes",
        "Stir in zucchini and red bell pepper; cook for 2 more minutes. Add chicken broth and stir.",
        "Stir in vinegar mixture; cook and stir until vegetables are tender and chicken is no longer pink in the center, about 2 minutes. Stir in cornstarch mixture until sauce is thickened, about 30 seconds; remove from heat.",
        "Toss in peanuts; season with salt and pepper to taste. Stir in green onion tops. Serve over white rice."
    ],
    "ingredients": [
        "1 tablespoon white wine",
        "1 tablespoon soy sauce",
        "1 teaspoon brown sugar",
        "3 medium green onions, finely chopped (white parts only)",
        "1 pound skinless, boneless chicken breast, cut into 1-inch pieces",
        "1 tablespoon white vinegar",
        "2 tablespoons rice vinegar",
        "1 tablespoon soy sauce, or to taste",
        "1 tablespoon Asian chili paste (sambal), or more to taste",
        "1 tablespoon sesame oil",
        "2 tablespoons brown sugar",
        "2 teaspoons ketchup",
        "2 tablespoons white wine",
        "4 cloves garlic, minced",
        "1 tablespoon cornstarch",
        "2 tablespoons water",
        "2 tablespoons peanut oil",
        "2 cups cubed zucchini",
        "1 cup cubed red bell pepper",
        "1/2 cup chicken broth",
        "1/4 cup roasted, salted peanuts",
        "salt and ground black pepper to taste",
        "1/4 cup chopped green onion tops",
        "4 cups cooked white rice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kung Wow Chicken",
    "url": "http://allrecipes.com/recipe/220181/kung-wow-chicken/"
}
