{
    "directions": [
        "Toss the beef, flour, and salt in a sealable bag until the beef is coated.",
        "Heat the oil in a large skillet over medium-high heat. Combine the beef and Worcestershire sauce in the skillet; cook until the beef is evenly browned on all sides; transfer to a slow cooker, but do not clean the skillet. Add the carrots, potatoes, parsley, and pepper to the slow cooker.",
        "Combine the boiling water and soup mix in a small bowl; add to slow cooker.",
        "Melt the butter in the skillet over medium-high heat. Cook the onion and garlic in the melted butter until soft; transfer the onion and garlic to the slow cooker and return the skillet to the heat. Combine the wine and mushrooms to the skillet; cook until the mushrooms begin to absorb the wine; pour the mixture into the slow cooker.",
        "Place the cover on the slow cooker and set to High; cook for one hour. Reduce heat to Low and cook until the beef is fork-tender, 6 to 8 hours. Whisk together the warm water and cornstarch; stir into the stew; cook uncovered until stew thickens, about 15 minutes."
    ],
    "ingredients": [
        "3 pounds cubed beef stew meat",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "3 tablespoons olive oil",
        "3 tablespoons Worcestershire sauce",
        "1 pound carrots, peeled and cut into 2-inch pieces",
        "4 large potatoes, cubed",
        "1 tablespoon dried parsley",
        "1 1/2 teaspoons ground black pepper",
        "2 cups boiling water",
        "2 (1 ounce) envelopes onion soup mix",
        "3 tablespoons butter",
        "3 large onions, quartered",
        "2 tablespoons minced garlic",
        "1/2 cup burgundy wine",
        "2 (6 ounce) packages fresh button mushrooms, halved",
        "1/4 cup warm water",
        "3 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Kyle's Favorite Beef Stew",
    "url": "http://allrecipes.com/recipe/149731/kyles-favorite-beef-stew/"
}
