{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Spray two 9-inch round cake pans with nonstick cooking spray and lightly dust with flour. Set aside.",
        "In a small bowl, mash the bananas and then stir in the lemon juice. Set aside. Using an electric mixer, cream the butter and granulated sugar until fluffy, about 5 minutes. Add the eggs, one at a time, beating after each addition. Add the vanilla wafers in 3 additions and the buttermilk in 2 additions, beginning and ending with the wafers. Beat until combined, then add the mashed bananas and vanilla and beat until fully incorporated.",
        "Divide the batter evenly between the prepared pans and bake until a toothpick inserted in the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before turning out onto racks to cool completely.",
        "For the filling: Separate the yolk from the white of 1 of the eggs. Discard the white. In a saucepan, whisk together the granulated sugar, flour, cornstarch and salt until completely combined. Stir in the egg yolk and remaining whole egg, and then stir in the milk. Cook uncovered over medium heat, stirring often, until the pudding thickens, 5 to 7 minutes. Remove from the heat and stir in the vanilla. Cover the pudding with plastic wrap, laying the wrap directly on the surface so a skin doesn't form. Chill in the fridge until completely cooled, about 30 minutes.",
        "Spread the pudding between the cake layers. Chill the cake until the pudding filling is set, 30 minutes to 1 hour. Sprinkle the top of the cake with confectioners' sugar just before serving."
    ],
    "ingredients": [
        "Nonstick cooking spray, for spraying the pan",
        "All-purpose flour, for dusting the pans",
        "3 ripe bananas",
        "2 teaspoons freshly squeezed lemon juice",
        "3/4 cup (1 1/2 sticks) unsalted butter, softened",
        "2 cups granulated sugar",
        "3 large eggs",
        "One 11-ounce box vanilla wafers, crushed",
        "1 cup buttermilk",
        "2 teaspoons vanilla extract",
        "2 large eggs",
        "1/4 cup granulated sugar",
        "1 tablespoon all-purpose flour",
        "1 tablespoon cornstarch",
        "Pinch salt",
        "1 cup milk",
        "1/4 teaspoon vanilla extract",
        "Confectioners' sugar, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Banana Cake",
        "Banana",
        "Cake",
        "Fruit",
        "Baking",
        "Dessert"
    ],
    "title": "Banana Pudding Cake",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/banana-pudding-cake"
}
