{
    "directions": [
        "Season the beef generously with salt and pepper.",
        "In a large Dutch oven over medium heat, cook the pancetta until browned and crisp, 5 to 7 minutes. Using a slotted spoon, transfer the pancetta to a paper towel-lined plate. Set aside.",
        "Increase the heat to medium-high. Working in batches, brown the beef on all sides, 3 to 5 minutes per batch. Transfer the beef to a large bowl.",
        "Reduce the heat to medium and warm the olive oil. Add the onions and carrots and sauté until almost softened, 5 to 7 minutes. Add the garlic, thyme and bay leaves and sauté for about 30 seconds. Stir in the flour and cook until lightly colored, 1 to 2 minutes. Add the wine, stirring to scrape up the browned bits from the pan bottom. Add the stock, demi-glace and the reserved pancetta and bring to a simmer. Return the beef to the pan, reduce the heat to low, cover and simmer until the meat is tender, 2 to 2 1/2 hours.",
        "Remove the bay leaves and discard. Taste and adjust the seasonings with salt and pepper. Serve the stew over buttered parsleyed noodles and garnish with parsley. Serves 8 to 10."
    ],
    "ingredients": [
        "5 1/2 lb. chuck-eye roast, cut into 1-inch cubes",
        "Salt and freshly ground pepper, to taste",
        "4 oz. pancetta, cut into small dice",
        "2 Tbs. olive oil",
        "2 yellow onions, coarsely chopped",
        "4 carrots, peeled and cut into 1/2-inch rounds",
        "3 garlic cloves, minced",
        "1 1/2 tsp. chopped fresh thyme",
        "2 bay leaves",
        "1/4 cup all-purpose flour",
        "1 cup full-bodied red wine",
        "2 cups beef stock",
        "1 Tbs. veal demi-glace",
        "Buttered parsleyed noodles for serving",
        "Minced fresh flat-leaf parsley for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stew",
    "url": "http://www.williams-sonoma.com/recipe/beef-stew.html"
}
