{
    "directions": [
        "In a large bowl whisk together the garlic paste, lemon juice, cumin, and olive oil. Add the steak to the marinade, turning it to coat it well, and let it marinate, covered and chilled, for at least 1 hour or overnight.",
        "Grill the steak, drained, on a well-oiled rack set about 5 inches over glowing coals or in a hot well-seasoned ridged grill pan over moderately high heat for 3 to 4 minutes on each side, or until it is just springy to the touch, for medium-rare meat. (Alternatively, the steak may be broiled on the rack of a broiler pan under a preheated broiler about 4 inches from the heat for 3 to 4 minutes on each side for medium-rare meat.) Transfer the steak to a cutting board and let it stand for 10 minutes.",
        "While the steak is standing, in a large skillet heat the oil over moderately high heat until it is hot but not smoking, add the bell peppers, onion, and garlic, and saute the mixture, stirring, for 5 minutes, or until the bell peppers are softened.",
        "In the oven: Stack 4 tortillas at a time, wrap each stack in foil, and heat the tortillas in the middle of a preheated 325 degree oven for 15 minutes. (If the tortillas are very dry to begin with, pat each tortilla between dampened hands before stacking them.)",
        "In the microwave: Stack 6 tortillas at time, wrap each stack in a microwave-safe plastic bag, and heat the tortillas in a microwave oven at high power (100 percent) for 30 seconds to 1 minute, or until they are heated through and pliable.",
        "Slice the steak thinly, across the grain, on the diagonal and arrange the slices on a platter with the bell pepper mixture. Drizzle any steak juices over the steak and the pepper mixture and serve the steak and the pepper mixture with the tortillas, the guacamole, and the salsa.",
        "To assemble a fajita: Spread some of the guacamole on a tortilla, top it with a few slices of the steak, some of the pepper mixture, and some of the salsa, and roll up the tortilla to enclose the filling.",
        "Halve and pit the avocados and scoop the flesh into a bowl. Mash the avocados coarsely with a fork and stir in the onion, garlic paste, lime juice, cumin, chile, and cilantro. The guacamole may be made 2 hours in advance, its surface covered with plastic wrap, and chilled.",
        "Yield: about 2 cups"
    ],
    "ingredients": [
        "4 garlic cloves, minced and mashed to a paste with 1 teaspoon salt",
        "1/4 cup fresh lemon juice",
        "1 1/2 teaspoons ground cumin",
        "2 tablespoons olive oil",
        "1 1/2 pounds skirt steak, trimmed and cut into large pieces to fit on a grill or broiler pan or in a ridged grill pan",
        "1 tablespoon vegetable oil",
        "2 assorted colored bell peppers, sliced thin",
        "1 large red onion, sliced thin",
        "2 garlic cloves, minced",
        "8 (7 to 8-inch) flour tortillas",
        "Guacamole, as an accompaniment, recipe follows",
        "Salsa, store bought or home made",
        "2 ripe seasonal avocados",
        "1/2 small onion, minced",
        "1 garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "4 teaspoons fresh lime juice, or to taste",
        "1/2 teaspoon ground cumin",
        "1 fresh or pickled jalapeno chile, if desired, seeded and minced (wear rubber gloves)",
        "3 tablespoons chopped fresh cilantro, if desired"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Easy Grilling Recipes",
        "Grilling",
        "Fajita Recipes",
        "Meat",
        "Jalapeno Recipes",
        "Vegetable",
        "Beef",
        "Marinating Recipes"
    ],
    "title": "Beef Fajitas",
    "url": "http://www.foodnetwork.com/recipes/beef-fajitas"
}
