{
    "directions": [
        "In a large fry pan over high heat, warm 1 Tbs. of the olive oil. Pat the beef dry with paper towels and season with salt and pepper. Add half of the beef strips (do not overcrowd the pan) and sauté until nicely browned but still a little pinkish on both sides, about 1 minute per side. Transfer to a bowl. Repeat with 1 Tbs. of the oil and the remaining meat.",
        "In the same pan over medium heat, melt the butter with the remaining 1 Tbs. oil. Add the leeks and sauté until softened and lightly browned, about 5 minutes. Add the mushrooms and sauté until nicely browned, about 5 minutes more. Season with salt and pepper.",
        "Stir in the tomato paste and cook until blended in, about 1 minute. Sprinkle the flour over the vegetables and stir to incorporate. Increase the heat to high, add the stock and bring to a boil, stirring with a wooden spoon to scrape up the browned bits from the pan bottom. Boil for 1 minute, then reduce the heat to medium. Add the crème fraîche, mustard and lemon juice and cook for 1 minute more to allow the flavors to blend. Taste and adjust the seasonings.",
        "Return the meat and any accumulated juices to the pan and cook just until the beef is heated through, about 2 minutes. Garnish with parsley and serve immediately. Serves 6.",
        "Serving Tip:",
        "Stroganoff, though not technically a braise, has a similar consistency when finished. It is traditionally served over wide egg noodles."
    ],
    "ingredients": [
        "3 Tbs. olive oil",
        "1 1/2 lb. top sirloin, cut into thin strips about 1  inch wide and 2 inches long",
        "Salt and freshly ground pepper, to taste",
        "3 Tbs. unsalted butter",
        "3 leeks, white and light green portions only,  cleaned and finely chopped",
        "1 lb. cremini mushrooms, brushed clean and  sliced",
        "1 Tbs. tomato paste",
        "2 Tbs. all-purpose flour",
        "2 1/4 cups beef stock",
        "1/3 cup crème fraîche",
        "2 tsp. Dijon mustard",
        "2 tsp. fresh lemon juice",
        "Finely chopped fresh flat-leaf parsley for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Beef Stroganoff",
    "url": "http://www.williams-sonoma.com/recipe/beef-stroganoff.html"
}
