{
    "directions": [
        "Position a rack in the lower third of the oven and preheat the oven to 350°F. Line the bottom of the cake pan with parchment paper, but leave the sides unlined and ungreased.",
        "Put the clarified butter in a small pot or microwavable container ready to reheat when needed, and have a large bowl ready to pour it into as well. In a medium bowl, whisk the flour and 2 tablespoons of the sugar together thoroughly.",
        "In the bowl of a stand mixer fitted with the whisk attachment, combine eggs, salt, and remaining granulated sugar; beat on high speed until light-colored and tripled in volume, 4 to 5 minutes. You should see well-defined tracks as the whisk spins; when the whisk is lifted, the mixture should fall in a thick, fluffy rope that dissolves slowly on the surface of the batter.",
        "Just before the egg mixture is ready, heat the clarified butter until very hot and pour it into the reserved large bowl.",
        "Remove the bowl with the egg mixture from the mixer. Sift one-third of the flour mixture over the eggs; fold in with a large rubber spatula until the flour is almost blended into the batter. Repeat with half of the remaining flour, then repeat with the rest of the flour. Scrape about a quarter of the batter into the bowl with the hot clarified butter. Fold until the butter is completely blended into the batter. Scrape the buttery batter over the remaining batter and fold just until blended. Scrape the batter into the prepared cake pan.",
        "Bake until the cake is golden brown on top, 30 to 35 minutes. It will have puffed up and then settled level, but it won't have pulled away from the sides of the pan, and a toothpick inserted in the center should come out clean and dry. Set the pan on a rack to cool completely.",
        "When cool, cut around the edge of the cake to release it from the pan, then quickly invert over a cutting board. Cut in a tic-tac-toe grid, creating nine even squares of cake.",
        "While the cake is baking, make the topping: In a medium bowl, toss sliced apples with lemon juice, brown sugar, cinnamon, ginger, salt, and 1/4 cup water. In a large skillet over medium heat, heat butter until melted. Add apple mixture and stir to combine. Cook over medium heat, turning occasionally, until apples have softened but still hold their shape and the sauce has thickened, 10 to 12 minutes.",
        "Meanwhile, in the chilled bowl of an electric mixer with the whisk attachment, or using a handheld electric mixer, whip the cream until it holds a soft shape—not too stiff. (The cream can be covered and refrigerated for up to several hours. If liquid separates from the cream, whisk briefly before using.)",
        "To serve, top each piece of cake with 4 to 5 cooked apple slices and a drizzle of sauce and garnish with a generous dollop of whipped cream and a sprinkle of cinnamon."
    ],
    "ingredients": [
        "3 tablespoons (45 grams) clarified butter or ghee",
        "1 cup (100 grams) oat flour",
        "2/3 cup (130 grams) granulated sugar",
        "4 large eggs",
        "1/8 teaspoon salt",
        "2 large Honeycrisp or Gala apples, unpeeled, cut into 1/4-inch wedges",
        "1 tablespoon lemon juice",
        "1/4 cup packed light-brown sugar",
        "1/2 teaspoon ground cinnamon, plus more for dusting",
        "1/8 teaspoon powdered ginger",
        "1/8 teaspoon salt",
        "3 tablespoon unsalted butter",
        "1 1/2 cups heavy cream",
        "Stand mixer with whisk attachment or handheld electric mixer, 9-inch square cake pan, sifter or medium-mesh strainer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Dessert",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Apple",
        "Healthy",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oat Shortcakes with Sautéed Apples, Cinnamon, and Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/oat-shortcakes-with-sauteed-apples-cinnamon-and-whipped-cream-51262930"
}
