{
    "directions": [
        "Stir warm water and honey in large bowl to blend. Sprinkle yeast over. Let stand until foamy, about 8 minutes. Heat buttermilk in small saucepan to lukewarm (about 100°F.). Stir into yeast mixture. Add 2 cups bread flour, 2 cups oats, wheat flour, oil and salt and stir until smooth. Gradually mix in enough remaining bread flour to form dough. Cover and let dough rest 15 minutes.",
        "Turn out dough onto floured surface. Knead until smooth and elastic, Adding more bread flour if sticky, about 10 minutes. Knead in nuts. Oil large bowl. Add dough; turn to coat. Cover bowl with clean towel; let rise in warm area until doubled, about 50 minutes.",
        "Oil large baking sheet. Punch down dough. Turn out onto oiled surface; knead briefly. Divide dough into 3 pieces. Roll each piece into 16-inch-long rope. Braid ropes together; tuck ends under and pinch to seal. Transfer to prepared sheet. Cover with clean towel. Let rise in warm area until almost doubled, about 45 minutes.",
        "Preheat oven to 375°F. Whisk egg and milk in bowl. Brush loaf generously with some of egg mixture. Sprinkle with additional oats. Bake until golden and tester inserted into center comes out clean, about 50 minutes. Transfer to rack; cool. (Can be made 1 day ahead. Wrap tightly; store at room temperature.)"
    ],
    "ingredients": [
        "1/2 cup warm water (105°F. to 115°F.)",
        "1/4 cup honey",
        "1 envelope dry yeast",
        "2 cups buttermilk",
        "4 1/3 cups (about) bread flour",
        "2 cups old-fashioned oats",
        "1 cup whole wheat flour",
        "2 tablespoons vegetable oil",
        "2 teaspoons salt",
        "1 cup chopped walnuts",
        "1 egg",
        "2 tablespoons milk",
        "Additional old-fashioned oats"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Nut",
        "Bake",
        "Walnut",
        "Oat",
        "Winter"
    ],
    "title": "Oat and Walnut Buttermilk Braid",
    "url": "http://www.epicurious.com/recipes/food/views/oat-and-walnut-buttermilk-braid-524"
}
