{
    "directions": [
        "1. Position a rack in the center of the oven and preheat the oven to 350°F. Grease two baking sheets.",
        "2. Place the walnuts in the bowl of a food processor and process until finely ground, about 15 seconds. Transfer the nuts to a pie plate or shallow bowl and set aside.",
        "3. In a medium bowl, whisk together the oats, flour, and salt; set aside.",
        "4. In the bowl of an electric mixer, using the paddle attachment, beat the butter, shortening, and brown sugar at medium-high speed until light and creamy, about 2 minutes. Beat in the egg yolk until well blended, scraping down the sides of the bowl as necessary. Beat in the vanilla extract. At low speed, add the oat mixture, mixing just until blended.",
        "5. Pinch off pieces of the dough and shape into 1-inch balls. Roll one of the balls in the ground walnuts, coating it completely. Place the ball on one of the baking sheets and flatten it slightly with your palm, then press your thumb into the center of the cookie to form an indentation. Spoon about 1/2 teaspoon of the raspberry preserves into the indentation, filling it. Repeat with the remaining dough balls, arranging them 1 1/2 inches apart on the baking sheets.",
        "6. Bake the cookies, one sheet at a time, for 14 to 16 minutes, until golden brown. Transfer the cookies to a wire rack and cool completely.",
        "7. Dust the cookies lightly with sifted confectioners' sugar before serving.",
        "Store in an airtight container at room temperature for up to a week."
    ],
    "ingredients": [
        "1 1/4 cups walnuts",
        "1 1/4 cups quick-cooking rolled oats",
        "1 cup all-purpose flour",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) unsalted butter, softened",
        "1/2 cup solid vegetable shortening",
        "1/2 cup firmly packed light brown sugar",
        "1 large egg yolk",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup raspberry preserves",
        "Confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Mixer",
        "Berry",
        "Bake",
        "Walnut",
        "Fall",
        "Jam or Jelly"
    ],
    "title": "Oatmeal Raspberry Thumbprints",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-raspberry-thumbprints-107742"
}
