{
    "directions": [
        "In a small heatproof bowl let the golden raisins and the dark raisins soak in 1 cup of boiling hot water, covered, for 30 minutes, or until they are plumped. Drain the raisins over a bowl, reserving 1/3 cup of the soaking liquid. In a large bowl with an electric mixer cream the butter with the brown sugar and the vanilla until the mixture is light and fluffy and beat in the eggs. Into a bowl sift together the flour, the baking powder, the baking soda, the salt, the cinnamon and the cloves, add the mixture to the butter mixture in batches alternately with the reserved soaking liquid, stirring, and stir in the raisins, the oats, the walnuts and the prunes. Drop the batter by heaping tablespoons onto buttered baking sheets, flattening the mounds slightly with the back of the spoon, and bake the cookies in batches in the middle of a preheated 400°F. oven for 6 to 9 minutes, or until they are golden. Let the cookies cool for 3 minutes, transfer them with a spatula to racks, and let them cool completely. Store the cookies in airtight containers."
    ],
    "ingredients": [
        "1 cup golden raisins",
        "3 cups dark raisins",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1 1/2 cups firmly packed light brown sugar",
        "1 teaspoon vanilla",
        "2 large eggs, beaten lightly",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "2 teaspoons cinnamon",
        "1 teaspoon ground cloves",
        "2 cups old-fashioned rolled oats",
        "2 cups chopped walnuts",
        "2 cups chopped pitted prunes or chocolate chips if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Back to School",
        "Prune",
        "Raisin",
        "Walnut",
        "Oat",
        "Spice",
        "Healthy",
        "Gourmet",
        "California",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oatmeal Raisin Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-raisin-cookies-10243"
}
