{
    "directions": [
        "Preheat oven to 375°F. Line rimmed baking sheet with foil. Spread oats out on prepared sheet. Bake oats until light golden, stirring occasionally, about 7 minutes. Set aside.",
        "Combine sugar and 1/3 cup water in heavy medium saucepan. Stir over medium heat until sugar dissolves. Increase heat and boil without stirring until deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 7 minutes. Immediately mix in oats. Pour praline out onto same baking sheet. Cool completely.",
        "Break praline into large chunks. Transfer to heavy resealable plastic bag. Using mallet, pound to small pieces. (Can be made 1 day ahead. Store airtight at room temperature.)",
        "Combine milk, cream, sugar, and egg yolks in heavy large saucepan; whisk to blend. Stir constantly over medium heat until custard thickens enough to coat spoon thinly, about 9 minutes (do not boil). Pour into medium bowl. Refrigerate custard until cold, at least 2 hours. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Mix 1 cup praline into custard (cover and reserve remaining praline for garnish). Freeze custard in ice cream maker according to manufacturer's instructions. Transfer to container, cover, and freeze. (Can be prepared 2 days ahead. Keep frozen.)",
        "Combine all ingredients in heavy large saucepan. Stir over medium-high heat until mixture comes to boil. Reduce heat to medium-low. Simmer until berries are tender and sauce thickens slightly, about 5 minutes. Using back of fork, coarsely mash about 3/4 of berries. (Can be made 1 day ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm sauce before serving.)",
        "Scoop ice cream into goblets. Spoon warm sauce over. Sprinkle with reserved praline and serve."
    ],
    "ingredients": [
        "1 1/2 cups old-fashioned rolled oats (do not use instant)",
        "1 cup sugar",
        "1/3 cup water",
        "2 3/4 cups whole milk",
        "1 3/4 cups heavy whipping cream",
        "2/3 cup sugar",
        "4 large egg yolks",
        "2 cups fresh raspberries or frozen unsweetened",
        "1 cup fresh blackberries or frozen, thawed (about 4 ounces)",
        "3/4 cup gin",
        "2 tablespoons sugar",
        "2 tablespoons (3/4 stick) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gin",
        "Milk/Cream",
        "Ice Cream Machine",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Blackberry",
        "Raspberry",
        "Oat"
    ],
    "title": "Oatmeal Praline Ice Cream with Warm Berry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-praline-ice-cream-with-warm-berry-sauce-109493"
}
