{
    "directions": [
        "Heat milk in a 1 1/2- to 2-quart saucepan over low heat until hot but not boiling, then remove pan from heat and stir in oats. Let stand, uncovered, stirring occasionally, until cooled to warm.",
        "Stir together water, yeast, and 1 teaspoon honey in a small bowl; let stand until foamy, 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.) Stir yeast mixture, melted butter, and remaining honey into cooled oatmeal.",
        "Stir together whole-wheat flour, 1 1/2 cups unbleached flour, and salt in a large bowl. Add oat mixture, stirring with a wooden spoon until a soft dough forms. Turn out onto a well-floured surface and knead with floured hands, adding just enough of remaining unbleached flour to keep from sticking, until dough is smooth, soft, and elastic, about 10 minutes (dough will be slightly sticky). Form dough into a ball and transfer to an oiled large bowl, turning to coat. Cover bowl loosely with plastic wrap and a kitchen towel; let rise at warm room temperature until doubled in bulk, 1 to 1 1/2 hours.",
        "Lightly butter loaf pans. Turn out dough onto a lightly floured surface and knead several times to remove air. Divide dough in half and shape each half into a loaf, then place 1 loaf in each buttered pan, seam side down, tucking ends gently to fit. Cover loaf pans loosely with a kitchen towel and let dough rise in a draft-free place at warm room temperature until doubled in bulk, about 1 hour.",
        "Put oven rack in middle position and preheat oven to 375°F. Lightly brush tops of loaves with some of egg wash and sprinkle with oats, then bake until bread is golden and loaves sound hollow when tapped on bottom, 35 to 40 minutes. (Remove 1 loaf from pan to test for doneness. Run a knife around edge of pan to loosen.)",
        "Remove bread from pans and transfer to a rack to cool completely, about 1 1/2 hours."
    ],
    "ingredients": [
        "2 cups whole milk",
        "1 cup old-fashioned rolled oats (not quick-cooking) plus additional for topping",
        "1/2 cup warm water (105-115°F)",
        "2 tablespoons active dry yeast (from 3 packages)",
        "1/2 cup mild honey",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled, plus additional for buttering pans",
        "3 cups stone-ground whole-wheat flour",
        "About 2 cups unbleached all-purpose flour",
        "1 tablespoon salt",
        "Vegetable oil for oiling bowl",
        "1 large egg, lightly beaten with 1 tablespoon water",
        "Special equipment: 2 (8- by 4-inch) loaf pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Oat",
        "Honey",
        "Whole Wheat",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oatmeal Wheat Bread",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-wheat-bread-232825"
}
