{
    "directions": [
        "Arrange racks in upper and lower thirds of oven and preheat to 375°F. Line 2 large baking sheets with parchment paper.",
        "In food processor, combine oats, all-purpose flour, whole-wheat flour, salt, and baking soda. Pulse until oats are coarsely chopped, about 6 (1-second) pulses. Set aside.",
        "Using electric mixer at high speed, beat butter and brown sugar until fluffy, 2 to 3 minutes. Add egg, honey, and vanilla and beat until smooth, about 1 minute. Add oat mixture and mix at low speed just until incorporated. Stir in chocolate and ginger.",
        "Drop rounded tablespoons of dough about 2 inches apart onto baking sheets. Bake, 2 pans at a time, switching positions of pans halfway through baking, until golden and slightly crisp on edges, about 14 to 16 minutes. Cool on sheets 3 minutes, then transfer to racks to cool completely. Continue making cookies with remaining dough and cooled sheets.",
        "To keep them fresh, pack the cookies in covered containers with waxed paper between each layer. If it's very hot out, you may want to refrigerate them until you leave to ensure that they won't melt before dessert time."
    ],
    "ingredients": [
        "3 cups old-fashioned rolled oats",
        "1 cup all-purpose flour",
        "1/2 cup whole-wheat flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/4 cups (packed) brown sugar",
        "1 large egg",
        "1/4 cup honey",
        "2 teaspoons pure vanilla extract",
        "6 ounces semisweet chocolate (60 to 65 percent cocoa), coarsely chopped (about 1 1/4 cups)",
        "1 cup crystallized ginger, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Chocolate",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Quick & Easy",
        "Oat",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oatmeal Cookies with Chocolate Chunks and Candied Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-cookies-with-chocolate-chunks-and-candied-ginger-238870"
}
