{
    "directions": [
        "Preheat oven to 425°F. Line large baking sheet with parchment paper. Mix flour, oats, brown sugar, baking powder and salt in large bowl. Using fingertips, rub in butter until mixture resembles coarse meal. Add milk; stir until dough forms.",
        "Drop dough onto prepared baking sheet, forming six 2 1/2-inch-diameter biscuits and spacing 3 inches apart. Sprinkle with 2 teaspoons sugar. Bake until biscuits are golden and tester inserted into biscuit comes out clean, about 20 minutes. Transfer to rack. (Can be made 8 hours ahead. Cool. Store airtight at room temperature.)",
        "Combine plums, 1/3 cup sugar, lemon juice, ginger and cinnamon in heavy medium saucepan. Cook over medium heat until plums release their juices but are still firm, stirring occasionally, about 4 minutes. Add butter. Stir until butter melts. Cool slightly.",
        "Using electric mixer, beat cream and powdered sugar in large bowl until stiff peaks form. Using serrated knife, slice off top 1/3 of biscuits. Transfer biscuit bottoms to plates. Spoon half of plum mixture over biscuits. Spoon whipped cream atop plum mixture. Spoon remaining plum mixture atop cream, dividing equally. Place biscuit tops over plum mixture. Serve immediately."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/2 cup old-fashioned oats",
        "1/2 cup (packed) golden brown sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup chilled unsalted butter, cut into small pieces",
        "2/3 cup whole milk",
        "2 teaspoons sugar",
        "1 pound firm but ripe plums (about 6), halved, pitted, each cut into 4 wedges",
        "1/3 cup sugar",
        "2 teaspoons fresh lemon juice",
        "1/2 teaspoon ground ginger",
        "1/8 teaspoon ground cinnamon",
        "2 tablespoons unsalted butter",
        "3/4 cup chilled whipping cream",
        "2 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Plum",
        "Oat",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oatmeal Shortcakes with Spiced Plums",
    "url": "http://www.epicurious.com/recipes/food/views/oatmeal-shortcakes-with-spiced-plums-101821"
}
