{
    "directions": [
        "Preheat oven to 300°F with rack in middle.",
        "Put avocado leaves in bottom of a heavy medium pot with a tight-fitting lid. Sprinkle lamb shanks all over with 2 teaspoons salt and arrange in pot (they don't have to be in 1 layer). Roast, covered, until meat is very tender, about 3 hours.",
        "Meanwhile, slit chiles lengthwise, then stem, seed, and devein. Tear chiles into roughly 1-inch pieces (you should have about 1 1/2 cups). Heat a comal or large heavy skillet (not nonstick) over medium heat until hot, then toast chiles, stirring constantly, until more pliable and slightly changed in color, 1 to 2 minutes. Transfer to a bowl. (Chiles will crisp as they cool.)",
        "Cover tomatillos with water in a medium saucepan and simmer, uncovered, until tender, about 10 minutes. Drain well, then purée with chiles, garlic, cilantro, and 1 1/2 teaspoons salt in a blender (in batches if necessary) until chiles are ground to small flecks.",
        "Transfer shanks to a cutting board to cool. Strain lamb juices remaining in pot into a glass measuring cup. Let fat rise to top and skim off. Coarsely shred meat, discarding bones.",
        "Heat oil in a heavy medium pot over medium-high heat until it shimmers, then cook one fourth of tomatillo sauce (it will spatter), stirring, until slightly thickened, about 2 minutes. Add remaining sauce and lamb juices and simmer, stirring occasionally, 10 minutes. Add lamb. Thin sauce with water if necessary. Simmer, stirring occasionally, until heated through, about 4 minutes."
    ],
    "ingredients": [
        "1/4 ounce dried avocado leaves",
        "4 lamb shanks (about 4 pounds total)",
        "2 oz dried costeño rojo chiles, wiped clean",
        "2 1/4 pounds fresh tomatillos, husked and rinsed",
        "2 garlic cloves, coarsely chopped",
        "2 1/2 cups chopped cilantro",
        "2 tablespoons vegetable oil",
        "warm corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Cinco de Mayo",
        "Lamb Shank",
        "Spring",
        "Tomatillo",
        "Party",
        "Potluck",
        "Gourmet",
        "Mexico"
    ],
    "title": "Oaxacan Lamb in Spicy Tomatillo Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/oaxacan-lamb-in-spicy-tomatillo-sauce-242339"
}
