{
    "directions": [
        "Rinse octopus under cold water, then cover with water by 2 inches in a 5-quart heavy pot.",
        "Using a rolling pin, smash lemongrass stalks. Cut into 3-inch lengths and add to pot with onion, ginger, cilantro, and salt. Bring to a boil, then reduce heat and simmer, covered, until octopus is tender, about 4 hours.",
        "Transfer octopus to a colander using tongs, then discard cooking liquid and any solids remaining in pot. When octopus is cool enough to handle, remove and discard head, then peel, discarding skin. Cut tentacles into 3-inch pieces, then cool to room temperature.",
        "Whisk together all dressing ingredients.",
        "Toss together octopus, roasted peppers, cilantro, scallion, and 2/3 cup dressing until octopus is well coated.",
        "Divide papaya among 4 plates and top with octopus salad. Drizzle remaining dressing over salad.",
        "*Check with your fishmonger or supermarket to see if they have octopus available; you may have to order one in advance. Whole octopuses are usually sold cleaned and frozen in a solid block.",
        "**Available at Asian markets and some supermarkets."
    ],
    "ingredients": [
        "1 (2-pound) cleaned frozen octopus*, thawed",
        "3 fresh lemongrass stalks**",
        "1 small onion, quartered",
        "1 (1-inch) piece fresh ginger, chopped",
        "1/4 cup chopped fresh cilantro stems",
        "1 teaspoon salt",
        "1/2 cup olive oil",
        "1/4 cup fresh lime juice",
        "2 teaspoons packed light brown sugar",
        "1/2 teaspoon minced seeded fresh hot chiles, or to taste",
        "1 teaspoon minced fresh lemongrass (from lower portion of stalk)",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/3 cup 1/4-inch strips bottled roasted red peppers",
        "1/4 cup torn fresh cilantro leaves",
        "1 scallion, minced",
        "2 (1-pound) firm-ripe papayas, peeled, seeded, and cut lengthwise into 1/4-inch thick wedges",
        "Garnish: fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Ginger",
        "Lime",
        "Papaya",
        "Octopus",
        "Bell Pepper",
        "Hot Pepper",
        "Lemongrass",
        "Cilantro",
        "Simmer",
        "Gourmet"
    ],
    "title": "Octopus Salad",
    "url": "http://www.epicurious.com/recipes/food/views/octopus-salad-108871"
}
