{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch cake pans.",
        "Stir cake mix, water, oil, and eggs together in a large bowl until moistened; beat with an electric mixer on medium speed for 2 minutes. Pour cake mixture into prepared pans.",
        "Bake in the preheated oven until a toothpick inserted near the center comes out clean, about 30 minutes; cool completely, about 30 minutes.",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. When cool enough to handle, crumble bacon into a small bowl.",
        "Beat butter until creamy with an electric mixer in a bowl; slowly beat in 2 cups confectioners' sugar until well blended. Beat maple syrup and vanilla extract into butter mixture until smooth and creamy; beat in remaining confectioners' sugar as needed until frosting mixture is a spreadable consistency. Fold crumbled bacon into frosting.",
        "Place one cake layer on a serving plate; spread about 1/2 cup bacon frosting evenly over cake. Place second cake layer over the first; spread remaining frosting evenly over sides and top of cake.",
        "Draw or print a maple leaf shape on a piece of paper. Fold the page in half down the center of the leaf; cut along the outline so that you will have a hole in the paper in the shape of a maple leaf. Center the paper on top of the frosted cake; press down slightly on the cut edges. Sprinkle the open area with red sugar; gently remove the paper stencil."
    ],
    "ingredients": [
        "1 (15.25 ounce) package white cake mix",
        "1 1/4 cups water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "6 slices maple-cured bacon, or more to taste",
        "1 cup unsalted butter, softened",
        "2 1/2 cups confectioners' sugar, or as needed",
        "1/3 cup maple syrup, or as needed",
        "1/2 teaspoon vanilla extract",
        "2 tablespoons red colored sugar, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oh Canada Maple Bacon Cake",
    "url": "http://allrecipes.com/recipe/244412/oh-canada-maple-bacon-cake/"
}
