{
    "directions": [
        "Combine oil and chives in blender and puree until smooth. Season chive oil to taste with salt and pepper.",
        "Cook corn in large pot of boiling salted water until just tender, about 8 minutes. Using tongs, remove corn from cooking liquid. Place on plate; reserve 1/2 cup corn cooking liquid. Cut corn kernels from cobs and reserve 4 cups (save remaining corn for another use).",
        "Preheat oven to 350°F. Combine oil, lemon, crushed garlic, and rosemary in medium ovenproof pot. Attach deep-fry thermometer to side of pot; heat oil to 150°F. Carefully lower swordfish into oil. Transfer pot to oven; poach fish uncovered until just firm to touch, about 15 minutes.",
        "Meanwhile, heat large nonstick skillet over medium heat. Add guanciale; sauté until almost crisp, 2 to 3 minutes. Add minced garlic and shallot; sauté until soft but not brown, about 3 minutes. Stir in reserved 4 cups corn and crushed red pepper. Add butter and 2 tablespoons reserved corn cooking liquid; stir until mixture is moist and creamy, adding more cooking liquid by tablespoonfuls if dry, about 5 minutes. Stir in chives and thyme. Season with sea salt and pepper.",
        "Divide corn among 4 shallow bowls. Top each with swordfish steak. Sprinkle with sea salt; drizzle with chive oil.",
        "An aromatic, medium-bodied white—like the Alois Lageder 2009 \"Vogelmaier\" Moscato Giallo (Italy, $29)— would be perfect."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1/4 cup chopped fresh chives",
        "5 medium ears of white corn, husked",
        "4 cups extra-virgin olive oil",
        "1 lemon, thinly sliced",
        "4 peeled garlic cloves; 2 crushed, 2 minced",
        "1 large fresh rosemary sprig",
        "4 6-ounce swordfish steaks",
        "1 cup 1/3-inch cubes guanciale or pancetta (Italian bacon)",
        "1 tablespoon minced shallot",
        "1 teaspoon dried crushed red pepper",
        "1 tablespoon butter",
        "2 tablespoons chopped fresh chives",
        "1 tablespoon fresh thyme leaves",
        "Fine sea salt",
        "Ingredient info: Guanciale (salt-cured pork jowl) is available at specialty foods stores and from zingermans.com. Pancetta (Italian bacon) makes a good substitute."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poach",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Bacon",
        "Seafood",
        "Corn",
        "Chive",
        "Swordfish",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Oil-Poached Swordfish with White Corn, Guanciale and Chive Oil",
    "url": "http://www.epicurious.com/recipes/food/views/oil-poached-swordfish-with-white-corn-guanciale-and-chive-oil-360711"
}
