{
    "directions": [
        "Combine all the spices in a bowl, mix well. Pat the spice rub onto the meat, making sure to heavily season the entire surface area of the brisket. Cover or wrap the brisket and let it sit at room temperature while getting the smoker or charcoal grill fired up. Do not leave at room temperature for longer than 1 hour.",
        "The grill is ready when the charcoal has burned to a white ash. If using a grill instead of a smoker, arrange the coals on 1 side of the grill, leaving an area large enough for the brisket to cook indirectly with no coals directly underneath the meat.",
        "When the grill has reached 200 to 225 degrees F, scatter 1/4 of the wood chips over the coals, close the grate, put the brisket on the grill and close the lid.",
        "Maintain a 200 to 225 degree F cooking temperature inside the grill, adding coals every 2 hours or as necessary. Add wood chips and spray the brisket with apple juice every time you add new coals. Try not to lift the lid of the grill at any other time.",
        "When the brisket reaches an internal temperature of 165 to 170 degrees F on an instant read meat thermometer (after about 4 to 5 hours), remove it from the grill and double wrap in aluminum foil to keep the juices from leaking out. Return the brisket to the grill (or smoker) The brisket is finished cooking when it is very tender and reaches an internal temperature of 190 degrees F, about another 1 to 2 hours. Let rest for 45 minutes, then unwrap and slice. Serve with BBQ sauce on the side."
    ],
    "ingredients": [
        "1/4 cup kosher salt",
        "1/4 cup sugar",
        "2 tablespoons garlic powder",
        "2 tablespoons onion powder",
        "2 tablespoons Spanish paprika",
        "2 tablespoons chili powder",
        "1 tablespoon celery salt",
        "1 tablespoon lemon pepper",
        "1 tablespoon freshly ground black pepper",
        "1 teaspoon freshly ground white pepper",
        "1 teaspoon cayenne pepper",
        "1 (5 to 8 pound) beef brisket (flat cut)",
        "4 cups oak or hickory wood chips, soaked in water for 30 minutes, drained",
        "1 cup apple juice",
        "1 1/2 cups your favorite BBQ sauce, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southwestern",
        "Apple",
        "Fruit",
        "Celery",
        "Vegetable",
        "Lemon Recipes",
        "Meat",
        "Beef",
        "Main Dish Recipes",
        "Grilling",
        "Barbecuing"
    ],
    "title": "Oklahoma Joe's Smoked Brisket Flat",
    "url": "http://www.foodnetwork.com/recipes/oklahoma-joes-smoked-brisket-flat-recipe"
}
