{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place bacon in a large oven-safe or cast-iron skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. When cool, crumble bacon; leave bacon drippings in the skillet.",
        "Whisk flour, kosher salt, and smoked paprika together in a bowl. Coat chicken thighs in the seasoned flour and brown on both sides in the hot bacon fat over medium heat, about 5 minutes per side; transfer chicken to a plate. Drain bacon grease except for 1 tablespoon; cook and stir onion and apple until onion is translucent and apple is softened, about 5 minutes. Stir red cabbage and bacon into onion-apple mixture, sprinkle with a pinch of kosher salt, and cook, stirring often, until cabbage is softened, 5 to 8 minutes.",
        "Pour red wine vinegar and red wine into skillet. Stir in brown sugar and cinnamon and bring cabbage mixture to a boil; cook until sauce is reduced by half, stirring often, about 10 minutes. Arrange chicken thighs on top of cabbage in the skillet.",
        "Bake in the preheated oven until cabbage is tender and chicken is cooked through, about 40 minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read at least 160 degrees F (70 degrees C)."
    ],
    "ingredients": [
        "4 slices bacon",
        "1 tablespoon bacon drippings",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon smoked paprika",
        "2 pounds skinless chicken thighs",
        "1 red onion, sliced",
        "1 large apple, cored and sliced",
        "1 head red cabbage, cored and sliced",
        "1/2 cup red wine vinegar",
        "1/4 cup dry red wine",
        "1/4 cup brown sugar",
        "1/2 teaspoon ground cinnamon (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oktoberfest Chicken and Red Cabbage",
    "url": "http://allrecipes.com/recipe/228364/oktoberfest-chicken-and-red-cabbage/"
}
