{
    "directions": [
        "Pat chicken dry and season with salt and pepper.",
        "Heat butter and oil in a 4- to 5-quart wide heavy pot over moderately high heat until foam subsides, then lightly brown chicken in 2 batches, turning over occasionally with tongs, about 5 minutes per batch. Transfer chicken as browned to a bowl using tongs.",
        "While chicken is browning, peel potatoes and cut into 1-inch pieces.",
        "Add onion, garlic, and 1 teaspoon thyme to pot and sauté, stirring occasionally, until softened, 4 to 5 minutes, then add flour and cook, stirring, 1 minute. Whisk in broth and water and bring to a boil, whisking.",
        "Add potatoes and corn to onion mixture, then cover and simmer over moderate heat, stirring occasionally, until potatoes are barely tender, about 10 minutes. Stir in chicken (along with any juices accumulated in bowl) and cream, then simmer, covered, until chicken is just cooked through and potatoes are tender, 5 to 10 minutes. Season stew with salt and pepper and sprinkle with remaining teaspoon thyme."
    ],
    "ingredients": [
        "2 pounds skinless boneless chicken breasts and thighs, cut into 2-inch pieces",
        "2 tablespoons unsalted butter",
        "1 tablespoon vegetable oil",
        "1 pound boiling potatoes",
        "1 large onion, halved lengthwise, then cut lengthwise into 1/4-inch slices",
        "1 garlic clove, minced",
        "2 teaspoons chopped fresh thyme",
        "2 tablespoons all-purpose flour",
        "1 3/4 cups low-sodium chicken broth (14 ounces)",
        "3/4 cup water",
        "2 ears frozen corn, cut crosswise into 1-inch pieces",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Chicken",
        "Potato",
        "Sauté",
        "Stew",
        "Quick & Easy",
        "Corn",
        "Fall",
        "Gourmet"
    ],
    "title": "Old-Fashioned Chicken and Corn Stew",
    "url": "http://www.epicurious.com/recipes/food/views/old-fashioned-chicken-and-corn-stew-108728"
}
