{
    "directions": [
        "In a medium heatproof bowl, whisk to combine the sugar, salt, yolks and vanilla seeds until completely smooth. In a large saucepan set over medium-high heat, combine the cream and milk and cook until small bubbles start to form around the edges of the pan and the mixture is hot. Slowly drizzle the eggs into the hot cream mixture, whisking constantly. Reduce the heat to medium-low and cook, stirring constantly, until thickened and the mixture coats the back of a spoon, 5 to 7 minutes. Remove from the heat and strain into a large bowl. Place the bowl in an ice bath and cool the custard, stirring occasionally. Store the custard into the refrigerator until ready to churn.",
        "Place the custard in an ice cream maker and process until smooth and thick, about 20 minutes.",
        "Transfer the ice cream to a quart container or 1 1/4-quart dish and freeze for 2 hours.",
        "Serve the ice cream topped with some Wet Walnuts.",
        "In a medium saucepan, combine the maple syrup, corn syrup, light brown sugar, vanilla and salt, and bring to a boil. Pour over the walnut halves and cool. Store refrigerated in an airtight container for up to 1 month."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "Pinch salt",
        "6 large egg yolks",
        "2 vanilla beans, split and seeds scraped",
        "2 cups heavy cream",
        "1 1/2 cups whole milk",
        "Wet Walnuts, recipe follows",
        "2 cups maple syrup",
        "2/3 cup corn syrup",
        "1/4 cup packed light brown sugar",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "1 cup walnut halves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Ice Cream",
        "Dairy Recipes",
        "Nut Recipes",
        "Dessert"
    ],
    "title": "Old-Fashioned Hand-Churned Vanilla Ice Cream",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/old-fashioned-hand-churned-vanilla-ice-cream"
}
