{
    "directions": [
        "Cut butter into pieces. In a bowl with a pastry blender or in a food processor blend or pulse together flour, salt, butter, and shortening until mixture resembles coarse meal. Add 5 tablespoons ice water and toss or pulse just until mixture forms a dough, adding additional ice water, a little at a time, if dough is too dry. Divide dough in half and flatten each piece into a disk. Chill dough, wrapped in plastic wrap, at least 30 minutes and up to 3 days.",
        "In a small bowl stir together sugar, tapioca, salt, and cinnamon. In a large heavy skillet cook fresh or frozen cherries over moderately high heat, stirring, until slightly softened, about 2 minutes. With a slotted spoon transfer cherries to a heatproof bowl. Add sugar mixture to cherry juices in skillet and simmer, stirring, until thickened, about 3 minutes. Stir cherry sauce and vanilla into cherries and cool.",
        "Line lower rack of oven with foil and preheat oven to 400° F.",
        "On a lightly floured surface with a floured rolling pin roll out 1 piece dough into an 11-inch round (about 1/8 inch thick). Fit dough into a 9-inch (1-quart) pie plate, leaving a 3/4-inch overhang. Pour filling into shell and chill, loosely covered with plastic wrap.",
        "On a lightly floured surface roll out remaining dough into an 11-inch round (about 1/8 inch thick) and with a sharp knife or fluted pastry wheel cut into 1-inch-wide strips. Working on a sheet of wax paper set on a baking sheet, weave pastry strips in a close lattice pattern. Chill or freeze lattice on wax paper on a flat surface 20 minutes, or until firm. Brush edge of filled shell with cold water and slide lattice off wax paper and onto pie. Let lattice stand 10 minutes to soften. Trim edges flush with rim of pie plate and crimp decoratively. Gently brush lattice top with cold water and sprinkle with sugar.",
        "Bake pie in middle of oven 45 minutes, or until pastry is golden and filling just begins to bubble, and transfer to a rack to cool slightly. Serve pie warm with ice cream."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) cold unsalted butter",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 cup cold vegetable shortening",
        "5 to 7 tablespoons ice water",
        "1 cup plus 2 tablespoons sugar",
        "1/4 cup quick-cooking tapioca",
        "1/2 teaspoon salt",
        "1/2 teaspoon cinnamon",
        "6 cups fresh or frozen pitted tart cherries (about 3 1/2 pints fresh, picked over)",
        "2 tablespoons vanilla",
        "1 tablespoon sugar",
        "Accompaniment: vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Bake",
        "Cherry",
        "Summer",
        "Gourmet"
    ],
    "title": "Old-Fashioned Cherry Vanilla Pie",
    "url": "http://www.epicurious.com/recipes/food/views/old-fashioned-cherry-vanilla-pie-14181"
}
