{
    "directions": [
        "Bring water, grits, and salt to a boil in a heavy saucepan with a lid. Stir in half-and-half and simmer until grits are thickened and tender, 15 to 20 minutes. Set aside and keep warm.",
        "Sprinkle shrimp with salt and cayenne pepper; drizzle with lemon juice. Set aside in a bowl.",
        "Place andouille sausage slices in a large skillet over medium heat; fry sausage until browned, 5 to 8 minutes. Remove skillet from heat.",
        "Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Retain bacon drippings in skillet. Transfer bacon slices to paper towels, let cool, and crumble.",
        "Cook and stir green, red, and yellow bell peppers, onion, and garlic in the bacon drippings until the onion is translucent, about 8 minutes.",
        "Stir shrimp and cooked vegetables into the andouille sausage and mix to combine.",
        "Melt butter in a saucepan over medium heat; stir in flour to make a smooth paste. Turn heat to low and cook, stirring constantly, until the mixture is medium brown in color, 8 to 10 minutes. Watch carefully, mixture burns easily.",
        "Pour the butter-flour mixture into the skillet with andouille sausage, shrimp, and vegetables. Place the skillet over medium heat and pour in chicken broth, bacon and Worcestershire sauce, cooking and stirring until the sauce thickens and the shrimp become opaque and bright pink, about 8 minutes.",
        "Just before serving, mix sharp Cheddar cheese into grits until melted and grits are creamy and light yellow. Serve shrimp mixture over cheese grits."
    ],
    "ingredients": [
        "1 cup coarsely ground grits",
        "3 cups water",
        "2 teaspoons salt",
        "2 cups half-and-half",
        "2 pounds uncooked shrimp, peeled and deveined",
        "salt to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 lemon, juiced",
        "1 pound andouille sausage, cut into 1/4-inch slices",
        "5 slices bacon",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1 cup chopped onion",
        "1 teaspoon minced garlic",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 cup chicken broth",
        "1 tablespoon Worcestershire sauce",
        "1 cup shredded sharp Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old Charleston Style Shrimp and Grits",
    "url": "http://allrecipes.com/recipe/220895/old-charleston-style-shrimp-and-grits/"
}
