{
    "directions": [
        "Preheat oven to 325°F. Place ham in large roasting pan. Pour apple juice over ham. Cover ham completely with parchment paper, then cover ham and roasting pan completely with heavy-duty foil, sealing tightly at edges of pan. Bake ham until instant-read thermometer inserted into center of ham registers 145°F, about 3 hours 45 minutes. Remove ham from oven. Increase oven temperature to 375°F.",
        "Remove foil and parchment from ham. Drain and discard liquids from roasting pan. Cut off rind and all but 1/4-inch-thick layer of fat from ham and discard. Using long sharp knife, score fat in 1-inch-wide, 1/4-inch-deep diamond pattern. Spread mustard evenly over fat layer on ham. Pat brown sugar over mustard coating, pressing firmly to adhere. Drizzle honey evenly over. Bake until ham is well glazed, spooning any mustard and sugar glaze that slides into roasting pan back over ham, about 30 minutes. Transfer ham to serving platter; let cool at least 45 minutes. Slice ham and serve slightly warm or at room temperature.",
        "Sauvignon Blanc is a good match for the ham and the asparagus, a notoriously wine-unfriendly ingredient. We like the Joel Gott 2006 Sauvignon Blanc from Napa Valley ($18), which has tropical fruit and citrus flavors with floral aromas and a crisp finish."
    ],
    "ingredients": [
        "1 10-pound smoked ham with rind, preferably shank end",
        "1 cup unsweetened apple juice or apple cider",
        "1/2 cup whole grain Dijon mustard",
        "2/3 cup (packed) golden brown sugar",
        "1/4 cup honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Mustard",
        "Bake",
        "Christmas",
        "Easter",
        "Low Cal",
        "Dinner",
        "Buffet",
        "Apple",
        "Ham",
        "Honey",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Old-Fashioned Ham with Brown Sugar and Mustard Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/old-fashioned-ham-with-brown-sugar-and-mustard-glaze-241636"
}
