{
    "directions": [
        "Heat the port wine over medium heat until just below the simmer point in a large stockpot with a lid. Add bourbon and rum, and bring back to just below simmering. Save the bottles and their caps for storing leftover glogg.",
        "While the wine and liquors are heating, place the cardamom, cinnamon stick, cloves, and orange peel onto the center of the square of cheesecloth. Gather together the edges of the cheesecloth, and tie with kitchen twine to secure.",
        "When mixture is very hot but not boiling, carefully light it with a long-handled match.  Wearing a heatproof cooking mitt, carefully pour the sugar into the flames, and let the mixture burn for 1 minute.  Put the lid on the stockpot to extinguish the flames, and turn off the heat.  Let the mixture cool, covered, for about 10 minutes; add the cheesecloth bundle of spices and the raisins and almonds to the warm wine mixture and let it cool to room temperature, about 1 hour.",
        "Strain the cooled glogg and reserve the raisins and almonds.",
        "To store, pour strained glogg into the bottles, recap, and keep upright in a cool dark place for up to 1 year.  Refrigerate the steeped raisins and almonds in a covered bowl or jar for up to 1 year.",
        "To serve, pour glogg into a saucepan and warm over low-medium heat until hot but not simmering, about 5 minutes.  Ladle 3 ounces of warmed glogg into a small coffee cup or small Swedish-style glogg mug, and garnish each serving with a few reserved raisins and almonds."
    ],
    "ingredients": [
        "5 (750 milliliter) bottles port wine",
        "1 (750 milliliter) bottle 100 proof bourbon whiskey",
        "1 (750 milliliter) bottle white rum",
        "3 whole cardamom pods, cracked",
        "1 small cinnamon stick",
        "4 whole cloves",
        "1 (3 inch) strip of orange peel",
        "1 (8 inch) square of cheesecloth",
        "3/4 cup white sugar",
        "1 (15 ounce) package dark raisins",
        "1 (6 ounce) package blanched slivered almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old-Fashioned Swedish Glogg",
    "url": "http://allrecipes.com/recipe/180453/old-fashioned-swedish-glogg/"
}
