{
    "directions": [
        "In a big bowl, combine the butter, sugar, lemon zest, salt and vanilla and mix until smooth and fluffy. Stir in the baking powder, taking care to mix well. Add the eggs and egg yolk and stir well. Add the flours and gently stir until a smooth ball forms. Wrap the dough in plastic and put in the fridge for at least 1 hour.",
        "Preheat the oven to 375 degrees F and line a baking sheet (or sheets) with parchment paper (no cooking spray).",
        "On a floured surface, roll out tennis ball-size pieces of dough to about 1/4 inch thick and cut out the shapes you want. Lay them on the prepared baking sheet, leaving at least 1/4 inch between each cookie.",
        "Bake for 8 minutes, or until lightly golden. Let the cookies cool on a wire rack, then decorate them however you like with Royal Icing and your favorite sprinkles.",
        "Using a stand mixer and the whisk attachment, whip most of the powdered sugar with most of the other ingredients. Whip for 5 to 8 minutes, or until the royal icing holds its shape and is bright white (not translucent). If it is too soft, add more powdered sugar. If it is too stiff, add a bit more liquid, drop by drop. If you are using only one color, add a few drops of the color at this point and keep whipping until you have the shade you want; otherwise, proceed to the next step.",
        "To store royal icing, the ideal way is to scrape it out of the bowl and into a plastic, disposable piping bag, then leave it at room temperature. Don't cut the bag until you're ready to use the royal icing, and don't overfill the bag--you want enough room to tie the back of the bag off to keep the royal icing airtight. If any air comes into contact with the royal icing, it gets hard and that part of the icing is useless. Never attempt to mix the hard bits back into the royal icing--you'll ruin the whole batch. The other accepted method of storing royal icing is to scrape it into a plastic or ceramic bowl, and cover it with a wet paper towel. This method works, but it wastes both paper towels and royal icing. It's also just annoying. When you're piping small designs, you want to use very small parchment piping bags. It's easy to stick the nose of a large piping bag into a smaller one and extract exactly how much you'll need. When the icing is in a bowl, you have to use a spoon to get it out. The spoon is difficult to get into a piping bag, and you'll keep using spoons and wasting royal icing. Get with the times people. Do it right and don't waste food.",
        "2 cups"
    ],
    "ingredients": [
        "6 sticks (3 cups) butter, softened",
        "2 cups sugar",
        "1 tablespoon lemon zest",
        "1 teaspoon kosher salt",
        "1 teaspoon pure vanilla extract",
        "2 teaspoons baking powder",
        "4 extra-large eggs 1 egg yolk",
        "3 cups all-purpose flour more for flouring",
        "2 cups cake flour",
        "Royal Icing, for decorating",
        "Your favorite sprinkles or other edible candy, for decorating",
        "4 cups powdered sugar (approximately)",
        "3 extra-large pasteurized egg whites",
        "1 teaspoon lemon juice",
        "-or-",
        "4 cups powdered sugar ( approximately )",
        "3 tablespoons meringue powder",
        "5 to 7 tablespoons water",
        "- or -",
        "4 cups royal icing powder",
        "1/2 cup water",
        "Food coloring, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sugar Cookie",
        "Cookie",
        "Sugar",
        "Dessert"
    ],
    "title": "Old School Sugar Cookies",
    "url": "http://www.foodnetwork.com/recipes/duff-goldman/old-school-sugar-cookies"
}
