{
    "directions": [
        "Heat 2 tablespoons oil in a Dutch oven over medium-high heat. Season the beef with 2 teaspoons salt and 1 teaspoon pepper. Add to the pot in batches and cook, turning and adding more oil as needed, until browned all over, about 5 minutes. Transfer to a bowl with a slotted spoon.",
        "Add 2 more tablespoons oil to the pot and reduce the heat to medium. Add the roughly chopped carrot, celery and onion and cook, occasionally stirring with a wooden spoon and scraping up the browned bits on the bottom of the pot, until the vegetables soften, about 5 minutes. Move the vegetables to one side and add the tomato paste to the empty side. Cook until it darkens around the edge, about 2 minutes; stir into the vegetables. Add the wine and bring to a boil.",
        "Return the beef and any juices to the pot; add the stock. Bring to a boil, skimming any foam off the top. Add the thyme. Reduce the heat to low, cover and simmer until the beef is tender, about 2 hours.",
        "Strain the beef and vegetables in a colander set over a large bowl, reserving the cooking liquid. Tent the beef mixture with foil. Let the cooking liquid stand for 5 minutes and then skim off the fat on the surface. Return the liquid to the pot. Add the remaining carrots and celery and the potatoes and bring to a simmer over high heat. Reduce the heat to medium and simmer until the vegetables are just tender, about 20 minutes.",
        "Meanwhile, heat the remaining 2 tablespoons oil in a large skillet over medium-high heat. Add the mushrooms; cook, stirring occasionally, until they release their juices and brown, 10 minutes. (Pour off any extra liquid, if necessary.) Season with salt and pepper. Remove from the heat and set aside.",
        "Melt the butter in a saucepan over medium-low heat. Whisk in the flour to make a roux, then let it bubble (do not brown), 2 minutes. Whisk in 2 cups of the reserved cooking liquid. Stir this sauce into the pot with the vegetables; bring to a simmer. Reduce the heat to medium low and simmer, stirring often, until thickened, 5 minutes.",
        "Return the beef to the pot, discarding the roughly chopped carrot, celery, onion and thyme. Add the mushrooms and simmer until heated through, 5 minutes. Season with salt and pepper; sprinkle with parsley.",
        "Photograph by David Malosh"
    ],
    "ingredients": [
        "6 tablespoons grapeseed or olive oil, plus more as needed",
        "3 pounds beef chuck, cut into 1-inch pieces",
        "Kosher salt and freshly ground pepper",
        "4 carrots (1 roughly chopped, 3 cut into 1/2-inch rounds)",
        "4 stalks celery (1 roughly chopped, 3 cut into 1/2-inch pieces)",
        "1 onion, roughly chopped",
        "1 tablespoon tomato paste",
        "1 cup hearty red wine, such as shiraz",
        "2 quarts beef stock or reduced-sodium beef broth",
        "2 sprigs thyme",
        "1 1/4 pounds russet potatoes, peeled and cut into 1-inch chunks",
        "1 pound mixed mushrooms (such as cremini, chanterelle, oyster and/or stemmed shiitake), sliced or quartered if large",
        "4 tablespoons unsalted butter",
        "1/2 cup all-purpose flour",
        "Chopped fresh parsley, for topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Stew",
        "Beef",
        "Meat",
        "Stew Recipes",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Old-Fashioned Beef Stew with Mushrooms",
    "url": "http://www.foodnetwork.com/recipes/old-fashioned-beef-stew-with-mushrooms"
}
