{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Add the carrots, and cook uncovered until tender, about 5 minutes. Drain well, and set aside.",
        "Place the ham bone, barley, salt, and pepper in large stock pot with 4 cups of water. Simmer over medium heat for 30 to 45 minutes. Add cabbage and tomatoes; continue simmering for 15 more minutes. Stir in the potatoes and carrots. Simmer until the potatoes are tender and easily pierced with a fork, 20 to 30 minutes. Stir in 1 cup of water, corn, green beans, lima beans, and peas. Simmer for 20 minutes.",
        "While the soup is simmering, clean the crabs by opening it and discarding the lungs and mouth. Remove the yellowish-brown tomalley and set aside. Break the crabs in half and add to the soup along with the seafood seasoning. Simmer for 20 minutes, stirring occasionally.",
        "Meanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Cook and stir the reserved tomalley in the remaining bacon grease over low heat until the mixture becomes gravy-like. Stir the cooked tomalley into the soup with 1 more cup of water. Continue simmering for 45 minutes, then add the lump crabmeat. Season with additional salt, pepper, and seafood seasoning, if necessary. Simmer for 1 hour and 15 minutes, stirring occasionally. Reduce heat to low, until ready to serve."
    ],
    "ingredients": [
        "3 carrots, sliced",
        "1 ham bone",
        "2/3 cup barley",
        "2 tablespoons salt, or more to taste",
        "2 tablespoons ground black pepper, or more to taste",
        "4 cups water",
        "1 small head cabbage, shredded",
        "2 (14.5 ounce) cans diced tomatoes",
        "3 potatoes, peeled and cubed",
        "1 cup water",
        "3 (15 ounce) cans white corn, drained",
        "1 pound green beans, cut into 1 inch pieces",
        "1 (10 ounce) package frozen lima beans",
        "1 (6 ounce) package frozen peas",
        "2 tablespoons seafood seasoning (such as Old Bay®), or more to taste",
        "4 female blue crabs",
        "4 slices bacon",
        "1 cup water",
        "2 (6 ounce) cans lump crabmeat, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old-School Baltimore Crab Soup",
    "url": "http://allrecipes.com/recipe/215084/old-school-baltimore-crab-soup/"
}
