{
    "directions": [
        "Whisk yogurt, mayonnaise, mustard, honey, coriander, 3 Tbsp. lemon juice, and 1/2 tsp. salt in a large bowl. Set aside 3/4 cup for dipping sauce. Using the coarse grater disk on a food processor or the largest holes on a box grater, coarsely shred carrots and celery root. Add carrots, celery root, parsley, and remaining 3 Tbsp. lemon juice to remaining yogurt mixture and toss to combine. Season slaw with salt and pepper.",
        "Place eggs, cornstarch, and cornmeal in 3 separate medium bowls. Add Old Bay to cornmeal and stir to combine.",
        "Pat fish dry, then season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Working in batches, dredge fish in cornstarch, shaking off excess, then coat with egg, allowing excess to drip back into bowl, then coat with cornmeal mixture, pressing to adhere and shaking off excess, and transfer to a plate.",
        "Pour oil into a large skillet to a depth of 1/4\". Heat oil over medium-high until shimmering, hot, and an instant-read thermometer registers 350°F. Reduce heat to medium and, working in 2 batches, cook fish until golden brown and cooked through, about 2–3 minutes per side. Transfer to a paper towel-lined plate and season with salt. Serve fish sticks with dipping sauce and slaw.",
        "Fish sticks can be coated, covered, and chilled up to 2 days ahead, or freeze on a rimmed baking sheet, transfer to re-sealable plastic bags, and store in freezer up to 3 months. Frozen fish sticks don't need to be defrosted, but cook time will be 2 to 3 minutes longer."
    ],
    "ingredients": [
        "1/2 cup plain Greek yogurt",
        "1/4 cup mayonnaise",
        "2 tablespoons country-style Dijon mustard",
        "1 teaspoon honey or agave nectar",
        "1/4 teaspoon ground coriander",
        "6 tablespoons lemon juice, divided (about 2 lemons)",
        "Kosher salt",
        "2 large carrots, peeled",
        "1/2 large celery root, peeled",
        "1/2 cup parsley leaves, roughly chopped",
        "Freshly ground black pepper",
        "2 large eggs, beaten",
        "1/4 cup cornstarch",
        "1 cup stone-ground yellow cornmeal",
        "1 tablespoon plus 2 teaspoons Old Bay seasoning",
        "1 pound firm white fish (such as cod), cut into 16 even strips, about 3x1\" each",
        "Kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "Grapeseed or other neutral oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fry",
        "Kid-Friendly",
        "Yogurt",
        "Wheat/Gluten-Free",
        "Dinner",
        "Lunch",
        "Cornmeal",
        "Cod",
        "Carrot",
        "Spring",
        "Summer",
        "Healthy",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Old Bay-Spiced Fish Sticks With Creamy Celery Root and Carrot Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/old-bay-spiced-fish-sticks-with-creamy-celery-root-and-carrot-slaw-56389569"
}
