{
    "directions": [
        "Stir 1 1/2 teaspoons lukewarm milk, 1 1/2 teaspoons lukewarm water and 1 1/2 teaspoons sugar in large bowl. Add yeast cake and stir until smooth. Let stand until foamy, about 10 minutes. Add flour and remaining 1 1/3 cups lukewarm milk and mix well. Cover and let sponge rise in warm draft-free area until doubled in volume, about 1 hour 15 minutes.",
        "Mix 3 tablespoons flour with raisins, slivered almonds and candied fruit in medium bowl. Using electric mixer, beat unsalted butter and sugar in large bowl until light and fluffy. Beat in eggs, cardamom, vanilla and salt. Beat in sponge. Stir in fruit and nuts. Mix in enough remaining flour 1/2 cup at a time to form slightly sticky dough. Turn dough out onto lightly floured surface and knead until smooth and elastic, adding more flour if very sticky, about 10 minutes.",
        "Lightly oil large bowl. Add dough, turning to coat entire surface. Cover bowl with plastic wrap. Let dough rise in warm draft-free area until doubled in volume, about 2 1/2 hours.",
        "Grease heavy large cookie sheet. Punch dough down. Divide dough in half. Pat each half into 10 x 16-inch oval. Fold in half lengthwise; pat gently. Place on prepared sheet. Cover and let rise in warm draft-free area until almost double in volume, about 2 hours.",
        "Position rack in lowest third of oven and preheat to 350°F. Bake until loaves are golden and sound hollow when tapped on bottom, about 1 hour. Transfer to rack and cool slightly. Serve warm or at room temperature. (Stollen can be prepared up to 1 day ahead. Cool completely. Wrap stollen in plastic and store at room temperature.)"
    ],
    "ingredients": [
        "1 1/3 cups plus 1 1/2 teaspoons lukewarm milk (95°F. to 100°F.)",
        "1 1/2 teaspoons lukewarm water (95°F. to 100°F.)",
        "1 1/2 teaspoons sugar",
        "1 fresh yeast cake",
        "2 2/3 cups all purpose flour",
        "3 1/2 cups plus 3 tablespoons (about) all purpose flour",
        "1 1/3 cups raisins",
        "2/3 cup blanched slivered almonds",
        "2/3 cup chopped candied fruit",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup sugar",
        "2 eggs",
        "1 tablespoon ground cardamom",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Old-Fashioned Stollen with Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/old-fashioned-stollen-with-almonds-2568"
}
