{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 9 inch pans. Sift together 2 cups flour, cocoa, baking soda and 1/2 teaspoon salt. Set aside.",
        "In a large bowl, cream shortening and 1 1/2 cup sugar until light and fluffy. Add eggs one at a time, beating well after each. Add flour mixture alternately with sour milk. Add 1 cup boiling water and 1 teaspoon vanilla.",
        "Divide batter into two 9 inch pans. Bake at 350 degrees F (175 degrees C) for 30 minutes, or until a toothpick inserted into the cake comes out clean. Allow layers to cool, then spread Pecan Filling between layers.",
        "To make Pecan Filling:  In a sauce pan, combine 1/3 cup sugar, 1 tablespoon flour, butter, milk and egg yolks. Cook over medium heat, stirring constantly, until thick. Remove from heat, add 1/8 teaspoon salt and 1/2 teaspoon vanilla. Stir in pecans and set aside to cool. Spread between layers of cake, then frost with Satin Seafoam Icing.",
        "To make Satin Seafoam Icing:  In a sauce pan, combine 3/4 cup brown sugar, 3/4 cup white sugar, cream of tartar and 1/3 cup hot water. Cover and bring to a boil. Uncover and cook until 246 degrees F (120 degrees C). Remove from heat. In a large bowl, beat egg whites until foamy. While beating with an electric mixer at medium speed, slowly pour hot syrup in a thin stream over egg whites. Turn mixer to high speed, and continue beating until stiff peaks form, and frosting is thick enough to spread. Add 1/2 teaspoon vanilla."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 cup unsweetened cocoa powder",
        "2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "1/2 cup shortening",
        "2 eggs",
        "1/2 cup sour milk",
        "1 cup boiling water",
        "1 teaspoon vanilla extract",
        "1 1/2 cups white sugar",
        "1/3 cup white sugar",
        "1 tablespoon all-purpose flour",
        "2 tablespoons butter",
        "2/3 cup milk",
        "3 egg yolks",
        "1/8 teaspoon salt",
        "1/2 teaspoon vanilla extract",
        "1 cup chopped pecans",
        "3/4 cup packed brown sugar",
        "3/4 cup white sugar",
        "1/8 teaspoon cream of tartar",
        "1/3 cup hot water",
        "3 egg whites",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old Fashioned Red Devil's Food Cake",
    "url": "http://allrecipes.com/recipe/8477/old-fashioned-red-devils-food-cake/"
}
