{
    "directions": [
        "Beat 1 cup softened butter with white sugar in a large bowl until creamy. Beat egg, whole milk, and 1 1/2 teaspoons vanilla extract into butter mixture until smooth. Whisk flour, baking powder, and salt in a separate bowl and gradually stir dry ingredients into moist ingredients to make a smooth dough. Chill dough in refrigerator for 2 to 3 hours.",
        "Preheat oven to 400 degrees F (200 degrees C). Dust a pastry cloth or kitchen towel generously with flour.",
        "Divide dough into thirds and roll each third out 1/8-inch thick on the prepared pastry cloth. Cut shapes out of the rolled dough with cookie cutters. Place cookies onto ungreased baking sheets.",
        "Bake in the preheated oven until cookies are barely browned, 5 to 8 minutes. Let cookies cool on baking sheets for 5 minutes before removing to finish cooling on a wire rack.",
        "Beat 1 cup softened butter, 3 cups confectioners' sugar, 1 1/2 tablespoons vanilla extract, and evaporated milk in a bowl until smooth. Gradually stir 6 cups confectioners' sugar into mixture until combined. Beat frosting hard until fluffy; stir in additional evaporated milk or confectioners' sugar if needed to reach desired consistency. Frost cooled cookies."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "3/4 cup white sugar",
        "1 egg",
        "2 tablespoons whole milk",
        "1 1/2 teaspoons vanilla extract",
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "Frosting:",
        "1 cup butter, softened",
        "3 cups confectioners' sugar",
        "1 1/2 tablespoons vanilla extract",
        "9 tablespoons evaporated milk, or more as needed",
        "6 cups confectioners' sugar, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old Fashioned Butter Cookies with Butter Frosting",
    "url": "http://allrecipes.com/recipe/230230/old-fashioned-butter-cookies-with-but/"
}
