{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease bottom and sides of a 9x13-inch pan.",
        "Mix 2 cups white sugar, flour, and salt in a mixing bowl.",
        "Combine water, vegetable shortening, margarine, and 3 tablespoons cocoa powder in a saucepan. Bring mixture to a boil over medium heat, stirring frequently. Pour liquid into flour mixture and stir well. Return saucepan to stove and set it aside.",
        "Dissolve baking soda in buttermilk in a large liquid measuring cup and stir in eggs and vanilla extract. Pour egg mixture into cake batter and mix until fully combined. Transfer batter into the prepared pan.",
        "Bake the cake in preheated oven until cake springs back when touched lightly with a finger or a tester comes out clean, 25 to 30 minutes.",
        "While cake is baking, prepare icing using reserved saucepan. Combine confectioners' sugar, 3 tablespoons cocoa powder, butter, milk, vanilla, and pecans in saucepan. Cook and stir over medium heat until hot but not boiling. Pour icing over hot cake immediately after it comes out of the oven. Allow cake to cool completely on a wire rack."
    ],
    "ingredients": [
        "Cake:",
        "2 cups white sugar",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup water",
        "1/2 cup vegetable shortening",
        "1/2 cup margarine",
        "3 tablespoons unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1/2 cup buttermilk",
        "2 eggs, beaten",
        "1 teaspoon vanilla extract",
        "Icing:",
        "1 (16 ounce) box confectioners' sugar",
        "3 tablespoons unsweetened cocoa powder",
        "1/2 cup butter",
        "6 tablespoons milk",
        "1 teaspoon vanilla extract",
        "1 cup chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Old Southern Chocolate Pecan Sheet Cake",
    "url": "http://allrecipes.com/recipe/228344/old-southern-chocolate-pecan-sheet-ca/"
}
