{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Heat the milk in a medium saucepan to a simmer over medium heat. In a second medium saucepan, whisk the egg yolks with 3/4 cup of the sugar until thick and light. Stir in the flour and salt to make a smooth paste.",
        "Whisk the scalded milk into the egg mixture, blend well and then return the pan to gentle heat. (Make sure the cream is perfectly smooth before letting it boil!) Whisk until boiling. Continue to cook the cream, whisking constantly, until thick and creamy, about 2 minutes. Add the vanilla extract and stir to combine. Strain the pastry cream into a bowl; set aside.",
        "Place a layer of the vanilla wafers all over the bottom of a medium baking dish (9-by-13-inch). Spread half of the reserved pastry cream on top of the wafers. Place the bananas evenly over the pastry cream in the baking dish. Top with a second layer of wafers. Spoon the remaining pastry cream over the wafers; set aside.",
        "In a heavy-duty mixer fitted with a whisk attachment, beat the egg whites on high speed until soft peaks form. Gradually add the remaining 1/2 cup sugar, a little at a time, beating until stiff peaks form. Spoon the meringue over the pastry cream and spread evenly to cover the entire surface, sealing well at the edges. Using a spatula, make curls and peaks in the meringue.",
        "Bake until lightly browned, 15 to 20 minutes. Remove to a rack to cool slightly. Serve immediately, warm or cold."
    ],
    "ingredients": [
        "1/4 cup all-purpose flour",
        "Pinch of table salt",
        "1 teaspoon pure vanilla extract",
        "About 45 vanilla wafers, such as Nilla",
        "8 bananas, sliced 1/4 inch thick",
        "2 cups whole milk",
        "6 eggs, separated",
        "1 1/4 cups sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Pudding Recipes",
        "Banana",
        "Fruit",
        "Dessert"
    ],
    "title": "Old-Fashioned Banana Pudding",
    "url": "http://www.foodnetwork.com/recipes/old-fashioned-banana-pudding"
}
