{
    "directions": [
        "Combine 1 quart cold water and 2 tablespoons lemon juice in a large bowl. Working with 1 artichoke at a time, bend back outer leaves until they snap off close to base and discard several more layers of leaves in same manner until exposed leaves are pale green at top and pale yellow at base. Cut off leaves flush with top of base (keep stem attached) and cut a thin slice from end of stem to expose a fresh cross section. Trim dark green fibrous parts from stem and base of artichoke with a sharp paring knife, being careful not to break off stem. Halve artichoke lengthwise, then remove choke by pulling out purple leaves and scraping out fuzzy layer with a melon-ball cutter or spoon. Cut each half lengthwise into thirds, then drop into bowl of lemon water.",
        "Heat 2 tablespoons extra-virgin olive oil in a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then cook onion, celery, and garlic, covered, stirring occasionally, until softened, about 6 minutes. Drain artichokes and pat dry. Stir artichokes into onion mixture with wine, thyme, 1 teaspoon sea salt, 1/4 teaspoon pepper, 1 cup chicken stock, and remaining 2 tablespoons lemon juice. Simmer, covered, stirring and turning artichokes occasionally, until tender, about 40 minutes.",
        "While artichokes braise, boil remaining 2 cups chicken stock in a 2-quart heavy saucepan, uncovered, over high heat until reduced to about 1 cup, about 15 minutes.",
        "Transfer 8 artichoke wedges with a slotted spoon to reduced stock and add vinegar and remaining tablespoon extra-virgin olive oil, remaining 1/2 teaspoon sea salt, and remaining 1/4 teaspoon pepper. Simmer, covered, until artichokes are very tender and falling apart, about 15 minutes. Transfer mixture to a blender along with butter and purée until almost smooth, about 1 minute. Pour through a fine-mesh sieve into a small bowl, pressing hard on and then discarding solids. Keep sauce warm, partially covered.",
        "While reduced stock mixture cooks, transfer remaining artichoke wedges to a bowl and clean and dry pot, then heat 2 to 3 inches olive oil in pot over moderately low heat until thermometer registers 150°F. Gently lower fish into oil with a slotted spatula. Return oil to 150°F, then poach fish until almost cooked through, 8 to 10 minutes (from time oil returns to 150°F). Carefully transfer fish with a slotted spatula to paper towels to drain.",
        "Divide artichoke wedges among 4 plates with slotted spoon, discarding cooking liquid, then top with fish and drizzle sauce on top. Sprinkle with parsley."
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "4 medium artichokes with stems attached (1/2 lb each)",
        "3 tablespoons extra-virgin olive oil",
        "1 small onion, thinly sliced",
        "1 celery rib, sliced",
        "2 garlic cloves, halved crosswise",
        "1 cup Sauvignon Blanc",
        "2 fresh thyme sprigs",
        "1 1/2 teaspoons fine sea salt",
        "1/2 teaspoon black pepper",
        "3 cups chicken stock or reduced-sodium chicken broth",
        "1/2 teaspoon Sherry vinegar",
        "1 stick (1/2 cup) unsalted butter, cut into 8 pieces",
        "About 2 1/2 qt olive oil",
        "4 (2-inch-thick) pieces salmon fillet with skin (about 6 oz each)",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poach",
        "Salmon",
        "Artichoke",
        "White Wine",
        "Gourmet",
        "California"
    ],
    "title": "Olive-Oil-Poached Salmon and Braised Artichokes with Sauvignon Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/olive-oil-poached-salmon-and-braised-artichokes-with-sauvignon-blanc-232832"
}
