{
    "directions": [
        "Whisk together flour, semolina, sugar, pepper, and 1 1/2 teaspoons sea salt, then stir in wine and oil. Transfer to a lightly floured surface and knead with lightly floured hands until smooth and elastic, about 2 minutes.",
        "Put dough in a lightly oiled large bowl and cover bowl with oiled plastic wrap. Let stand at room temperature 1 hour.",
        "Bring 4 cups water to a boil with remaining teaspoon sea salt in a medium pot.",
        "Meanwhile, halve dough, then cut each half into 10 pieces. Keeping remaining dough covered, roll 1 piece of dough into a 20-inch-long rope on an unfloured surface. Cut rope into 5 pieces, then roll each piece into a 4-inch-long rope, connecting ends of each to form a ring. Transfer to a lightly floured kitchen towel (not terry cloth). Repeat with remaining dough.",
        "Preheat oven to 350°F with racks in upper and lower thirds. Oil 2 large baking sheets.",
        "Boil rings in 4 batches just until they float, about 2 minutes per batch. Transfer with a slotted spoon to oiled baking sheets, arranging rings 1/2 inch apart.",
        "Bake, switching position of sheets halfway through baking, until golden, 35 to 40 minutes. Transfer to racks to cool completely."
    ],
    "ingredients": [
        "1 1/4 cups \"00\" flour",
        "1/3 cup semolina (sometimes called semolina flour)",
        "1 teaspoon sugar",
        "3/4 teaspoon freshly ground black pepper",
        "2 1/2 teaspoons fine sea salt, divided",
        "1/3 cup dry white wine",
        "1/3 cup extra-virgin olive oil",
        "4 cups water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Side",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Dinner",
        "Semolina",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Vegan",
        "Party",
        "Potluck",
        "Boil",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Olive-Oil Pepper Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/olive-oil-pepper-biscuits-242011"
}
