{
    "directions": [
        "Line a baking sheet with parchment paper. Bring sugar, honey, cardamom, and 3 cups water to a boil in a medium heavy saucepan, stirring until sugar dissolves. Add orange slices. Reduce heat to medium-low; simmer, turning orange slices occasionally, until tender and syrup is reduced to 3 1/4 cups, about 40 minutes. Arrange orange slices in a single layer on prepared baking sheet; remove cardamom pods and seeds. Strain syrup. DO AHEAD: Can be made 1 day ahead. Cover syrup and orange slices separately; chill. Return orange slices to room temperature and rewarm syrup slightly before using.",
        "Preheat oven to 350°F. Brush pan with oil. Whisk both flours and next 4 ingredients in a medium bowl. Using an electric mixer, beat 1/4 cup sugar and 1/2 cup oil in a large bowl for 1 minute. Beat in yolks, then flour mixture. Beat in yogurt, zest, and vanilla. Using clean, dry beaters, beat egg whites in another medium bowl until soft peaks form. Gradually beat in remaining 1/4 cup sugar until firm peaks form. Fold egg whites into batter just to blend in 2 additions. Transfer to prepared pan; smooth top.",
        "Bake cake until a toothpick inserted into center comes out clean, about 25 minutes. Pierce hot cake all over with a metal skewer. Slowly drizzle 3/4 cup warm syrup all over. When syrup is absorbed, slowly pour 3/4 cup more syrup over. Reserve remaining syrup for serving. Let cake cool in pan on a wire rack. Run a thin knife around edge of pan to release cake. Remove pan sides. Arrange candied orange slices over. Sprinkle pistachios over. Cut into wedges and serve drizzled with more syrup."
    ],
    "ingredients": [
        "1 cup sugar",
        "3/4 cup orange blossom honey",
        "3 tablespoons green cardamom pods, crushed",
        "1 small orange, thinly sliced",
        "1/2 cup olive oil plus more for brushing",
        "1 cup all-purpose flour",
        "1/2 cup semolina flour (pasta flour)",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon ground cardamom",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon baking soda",
        "1/2 cup sugar, divided",
        "3 large eggs, separated",
        "2/3 cup plain whole-milk yogurt",
        "1 1/2 teaspoon grated orange zest",
        "1 teaspoon vanilla extract",
        "Chopped unsalted pistachios, lightly toasted",
        "Special equipment: 9\"-diameter springform pan",
        "**Ingredient Info:**Semolina flour (pasta flour) is available at better supermarkets and at Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Citrus",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Backyard BBQ",
        "Dinner",
        "Orange",
        "Pistachio",
        "Spring",
        "Summer",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Olive-Oil Cake with Candied Orange",
    "url": "http://www.epicurious.com/recipes/food/views/olive-oil-cake-with-candied-orange-365695"
}
