{
    "directions": [
        "In the large bowl of an electric mixer fitted with the dough hook stir together the yeast, the sugar, and 1 3/4 cups lukewarm water and proof the yeast mixture for 5 minutes, or until it is foamy. Stir in 4 1/2 cups of the flour, the salt, and 2 tablespoons of the oil and knead the dough, scraping down the dough hook occasionally and adding as much of the remaining 1/2 cup flour as necessary to form a soft, slightly sticky dough, for 3 minutes. Transfer the dough to a lightly oiled bowl, turn it to coat it with the oil, and let it rise, covered, in a warm place for 1 hour, or until it is double in bulk. Knead in the chopped rosemary, press the dough with lightly oiled hands into a well-oiled 15 1/2- by 10 1/2-inch jelly-roll pan, and let it rise, covered loosely, for 30 minutes. The dough may be made 8 hours in advance and kept covered and chilled.",
        "Dimple the dough with your fingertips, making 1/4-inch-deep indentations, brush it with the remaining 1 tablespoon oil, and top it with the onion, the olives, the salt, and the whole rosemary leaves. Bake the focaccia in the bottom third of a preheated 400°F. oven for 35 to 45 minutes, or until it is golden and cooked through. Transfer the focaccia to a rack, let it cool for 10 minutes, and serve it, cut into squares, warm or at room temperature."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1 teaspoon sugar",
        "4 1/2 to 5 cups all-purpose flour",
        "1 1/4 teaspoons salt",
        "3 tablespoons olive oil",
        "2 teaspoons finely chopped fresh rosemary leaves plus whole rosemary leaves",
        "1/4 cup minced onion",
        "1/2 pound Kalamata, Niçoise, or green Greek olives or a combination, pitted and cut into slivers (about 1 cup)",
        "1 1/2 teaspoons coarse salt, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Olive",
        "Onion",
        "Side",
        "Bake",
        "Rosemary",
        "Gourmet"
    ],
    "title": "Olive, Rosemary, and Onion Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/olive-rosemary-and-onion-focaccia-12784"
}
