{
    "directions": [
        "Bring large saucepan of water to boil. Add basil leaves and simmer 15 seconds. Using strainer or slotted spoon, transfer basil directly to blender. Add 1 teaspoon coarse salt to water in same saucepan and bring to boil. Add carrots and cook 5 minutes. Add broccoli and cauliflower, and cook until all vegetables are tender, about 5 minutes longer. Drain. Using slotted spoon, transfer vegetables to bowl of ice water and let stand until cold. Drain well. Add vegetables, vegetable stock, cranberry beans, parsley, and 1/4 cup oil to basil in blender. Puree until smooth, occasionally scraping down sides of blender with rubber spatula. Transfer pistou to medium bowl, and season to taste with salt and pepper. DO AHEAD: Pistou can be made 1 day ahead. Cover and chill. Rewarm in microwave before serving.",
        "Pour 3 cups olive oil into heavy large saucepan, and add thyme sprigs. Attach deep-fry thermometer to side of saucepan and heat oil over medium heat until thermometer registers between 165°F and 180°F. Sprinkle shrimp with salt and pepper. Add shrimp to hot oil and poach just until shrimp are opaque in center, adjusting heat to maintain temperature between 165°F and 180°F, about 8 minutes. Transfer shrimp to paper towels to drain.",
        "Divide warm pistou among 4 or 6 plates. Top pistou with poached shrimp and serve."
    ],
    "ingredients": [
        "2 cups (packed) fresh basil leaves",
        "1 teaspoon coarse kosher salt",
        "1/2 cup thinly sliced peeled carrots",
        "2 cups small broccoli florets (about 6 ounces)",
        "1 cup small cauliflower florets (4 to 5 ounces)",
        "1 cup vegetable stock or vegetable broth",
        "1/2 cup cooked cranberry beans or other winter beans or canned drained Great Northern or cannellini beans",
        "1/2 cup (packed) fresh Italian parsley leaves",
        "1/4 cup extra-virgin olive oil",
        "3 cups olive oil",
        "3 large fresh thyme sprigs",
        "18 uncooked large shrimp (for first course) or 24 uncooked large shrimp (for main course), peeled, deveined, patted dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Poach",
        "High Fiber",
        "Basil",
        "Shrimp",
        "Broccoli",
        "Cauliflower",
        "Carrot",
        "Winter",
        "Healthy"
    ],
    "title": "Olive-Oil-Poached Shrimp with Winter Pistou",
    "url": "http://www.epicurious.com/recipes/food/views/olive-oil-poached-shrimp-with-winter-pistou-241356"
}
