{
    "directions": [
        "Preheat oven to 375°F. Brush 9-inch-diameter cake pan with 3-inch-high sides with olive oil. Line bottom of pan with parchment paper round; brush parchment with olive oil. Sift flour, baking powder, and salt into medium bowl. Stir in couscous. Whisk olive oil and Muscat in another medium bowl to blend.",
        "Using stand mixer fitted with whisk attachment, beat egg yolks, eggs, and 1 cup sugar on high speed in large bowl until thick and pale yellow, about 7 minutes. Transfer to large wide bowl. Stir in orange peel. Using rubber spatula, gently fold in flour mixture alternately with olive oil mixture in 4 additions each (mixture may deflate slightly). Transfer batter to prepared pan. Tap pan lightly on work surface to eliminate any air bubbles.",
        "Bake cake until dark brown and beginning to pull away from sides of pan and tester inserted into center comes out clean, about 45 minutes. Transfer cake to rack and cool in pan at least 30 minutes. Turn cake out onto platter (cake may fall slightly in center). Do ahead Can be made 1 day ahead. Cool. Cover with foil and store at room temperature.",
        "Using electric mixer, beat cream and créme fraîche in large bowl until soft peaks form.",
        "Cut cake into wedges. Place 1 cake wedge on each plate. Drizzle date syrup over. Spoon whipped cream alongside. Sprinkle dates over."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon coarse kosher salt",
        "1/2 cup uncooked couscous",
        "3/4 cup plus 2 tablespoons extra-virgin olive oil",
        "1/4 cup sweet Muscat wine (such as Beaumes-de-Venise or Bonny Doon)",
        "6 large egg yolks",
        "3 large eggs",
        "1 cup sugar",
        "1 tablespoon finely grated orange peel",
        "1 cup chilled heavy whipping cream",
        "1/4 cup chilled créme fraîche",
        "1/2 cup date syrup*",
        "12 dates (such as Deglet Noor or Medjool), pitted, thinly sliced",
        "*Available at Middle Eastern markets and from igourmet.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Date",
        "Fall",
        "Couscous",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Olive Oil Couscous Cake with Crème Fraîche and Date Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/olive-oil-couscous-cake-with-creme-fraiche-and-date-syrup-236211"
}
