{
    "directions": [
        "Heat 2 Tbsp. oil in a large Dutch oven or pot over medium. Add cauliflower and cook, stirring occasionally, until just beginning to brown and soften, 5–8 minutes. Add onion, garlic, and remaining 1 Tbsp. oil and cook, stirring, until onion and cauliflower are cooked through, 5–7 minutes more. Add curry powder, salt, and cumin. Cook, stirring, until spices are toasted, about 30 seconds.",
        "Add broth and bring to a boil. Add chickpeas, couscous, and lentils, reduce heat, and simmer, stirring occasionally to avoid couscous from sticking, until couscous and lentils are cooked through and liquid is almost completely reduced to a thick sauce, about 10 minutes.",
        "Meanwhile, juice 1 lime to yield 3 Tbsp. juice. Whisk lime juice, yogurt, and 3 Tbsp. chopped cilantro in a medium bowl until smooth. Add water by the tablespoonful until sauce is thin enough to drizzle. Cut remaining lime into wedges.",
        "Fold spinach into chickpea mixture. Top with cilantro leaves and almonds, if using, and serve yogurt sauce and lime wedges alongside.",
        "Stew (without spinach) can be made 3 days ahead; cover and chill. Reheat and fold in spinach before serving."
    ],
    "ingredients": [
        "3 tablespoons virgin coconut oil, room temperature, divided",
        "1 head cauliflower (about 2 pounds), coarsely chopped",
        "1 medium red onion, thinly sliced",
        "3 large garlic cloves, coarsely chopped",
        "2 teaspoons curry powder",
        "2 teaspoons kosher salt",
        "1 1/4 teaspoons ground cumin",
        "3 cups homemade or store-bought low-sodium vegetable broth",
        "1 (15.5-ounce) can chickpeas, drained, rinsed",
        "1 cup pearled couscous",
        "1/2 cup split red lentils",
        "2 limes, divided",
        "1/2 cup Greek-style plain full or low-fat yogurt",
        "3 tablespoons coarsely chopped cilantro leaves, plus whole leaves for serving",
        "5 ounces baby spinach",
        "1/4 cup sliced almonds (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "No Meat, No Problem",
        "Dinner",
        "Vegetarian",
        "Cauliflower",
        "Curry",
        "Couscous",
        "Lentil",
        "Spinach",
        "Quick and Healthy",
        "Healthy"
    ],
    "title": "One-Pot Curried Cauliflower With Couscous and Chickpeas",
    "url": "http://www.epicurious.com/recipes/food/views/one-pot-curried-cauliflower-with-couscous-and-chickpeas"
}
