{
    "directions": [
        "Brown the ribs",
        "Preheat an oven to 325ºF.",
        "Generously season the ribs with salt and pepper. In a Dutch oven or large ovenproof sauté pan over high heat, warm the olive oil. Working in batches if necessary, add the ribs and cook, turning once, until browned, 8 to 10 minutes. Transfer the ribs to a plate.",
        "Braise the ribs",
        "Add the onion to the pot and sauté until softened, 2 to 3 minutes. Add the wine and port and cook, scraping up any browned bits from the pan bottom, 2 to 3 minutes. Return the ribs with any accumulated juices to the pot, and add enough broth so that it comes one-third of the way up the ribs. Bring to a boil, then remove from the heat.",
        "Cover the pot tightly with aluminum foil, place the lid on the pot and transfer to the oven. Cook until the meat is fork-tender, 1 1/2 to 2 hours. Add the potatoes and carrots and cook, covered, until the vegetables are tender, about 30 minutes more.",
        "Finish the dish",
        "Using a slotted spoon, divide the ribs and vegetables among individual shallow bowls. Skim the fat off the sauce. Spoon some of the sauce over the ribs, garnish with the parsley and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "One Pot,",
        "by Carrolyn Carreño (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "4 to 5 lb. beef short ribs, cut into 3-inch pieces",
        "Salt and freshly ground pepper, to taste",
        "3 Tbs. olive oil",
        "1 yellow onion, finely chopped",
        "2 cups dry red wine",
        "1 cup port or brandy",
        "2 cups chicken broth, plus more as needed",
        "1 lb. boiling potatoes, quartered",
        "2 carrots, peeled and cut into large chunks",
        "2 Tbs. minced fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "One-Pot Braised Short Ribs",
    "url": "http://www.williams-sonoma.com/recipe/one-pot-braised-short-ribs-fmf.html"
}
