{
    "directions": [
        "Preheat oven to 350°F. Butter a 13x9\" pan and dust with 2 Tbsp. cocoa powder, tapping out excess.",
        "Melt remaining 1 cup butter in a small saucepan over medium heat. Add chocolate and remaining 1/2 cup cocoa powder; cook, whisking constantly, until smooth. Let cool slightly.",
        "Whisk eggs and vanilla in a large bowl. Add sugar and whisk until smooth, lightened in color, and slightly aerated, about 2 minutes. Stream in buttermilk while whisking, then stream in chocolate mixture while whisking until smooth.",
        "Sift flour, baking powder, baking soda, and salt into chocolate mixture. Whisk until batter is mostly smooth (there will be a few small lumps). Transfer to prepared pan.",
        "Bake cake until a tester inserted into the center comes out clean, 35–40 minutes. Transfer pan to a wire rack and let cake cool completely.",
        "Slice 2 oz. chocolate into long, thin shards; reserve for decorating. Coarsely chop remaining 7 oz. chocolate and transfer to a medium bowl. Add vanilla and salt.",
        "Heat cream in a small pot over medium until just starting to simmer. Pour over chocolate mixture and let sit 3 minutes. Whisk until chocolate is melted and smooth. Whisk in dulce de leche. Chill until firm, at least 1 hour.",
        "Whisk frosting to lighten and loosen, then use a spatula to spread over cake. If it's too stiff to work with, let it sit out on the counter for a few minutes. Sprinkle with reserved chocolate shards. Cut into thirds lengthwise, then into fifths crosswise (you should have 15 pieces).",
        "Cake can be made 3 days ahead; cover and chill. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, plus more for pan",
        "1/2 cup plus 2 tablespoons unsweetened cocoa powder, divided",
        "6 ounces high-quality milk chocolate, chopped",
        "3 large eggs",
        "2 teaspoons vanilla extract",
        "1 3/4 cups sugar",
        "1 1/4 cups buttermilk",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "9 ounces high-quality milk chocolate, divided",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon kosher salt",
        "3/4 cup heavy cream",
        "1/2 cup store-bought dulce de leche or caramel sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#CAKEWEEK",
        "Cake",
        "Chocolate",
        "Father's Day",
        "Potluck",
        "Butterscotch/Caramel",
        "Bake",
        "Dessert",
        "Birthday",
        "Wedding",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "One-Bowl Milk Chocolate Cake With Chocolate-Caramel Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/one-bowl-milk-chocolate-cake-with-chocolate-caramel-frosting"
}
