{
    "directions": [
        "Blend flour and salt in processor. Add butter and shortening; using on/off turns, cut in until mixture resembles coarse meal. Add 2 tablespoons ice water and process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour.",
        "Preheat oven to 400°F. Roll out dough on lightly floured work surface to 11-inch round. Transfer to 9-inch tart pan with removable bottom. Press dough onto bottom and up sides of pan. Pierce crust all over with fork. Freeze 10 minutes. Line crust with foil; fill with dried beans or pie weights. Bake crust 10 minutes. Remove foil and beans. Bake until crust is set and partially cooked through, about 15 minutes longer. Cool crust while making filling. Maintain oven temperature.",
        "Sauté bacon in medium skillet over medium heat until crisp, about 4 minutes. Transfer bacon to paper towels to drain. Add onion and pinch of sugar to drippings in skillet and sauté until onion is deep golden brown, about 20 minutes. Whisk cream, egg, egg yolk, pepper, salt, and nutmeg in small bowl to blend. Spread onion over bottom of baked crust; sprinkle bacon over, then cheese. Pour cream mixture over.",
        "Bake until tart is puffed and filling is set, about 25 minutes. Cool tart on rack 10 minutes. Remove pan sides. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons chilled solid vegetable shortening, cut into 1/2-inch cubes",
        "2 tablespoons (or more) ice water",
        "3 thick-cut bacon slices, chopped",
        "1 large onion, thinly sliced",
        "Pinch of sugar",
        "1 cup whipping cream",
        "1 large egg",
        "1 large egg yolk",
        "1/4 teaspoon ground black pepper",
        "Generous pinch of salt",
        "Generous pinch of ground nutmeg",
        "1/2 cup (packed) coarsely grated Gruyère cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Onion",
        "Bake",
        "Lunch",
        "Bacon",
        "Fall",
        "Swiss Cheese",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Onion, Cheese, and Bacon Tart",
    "url": "http://www.epicurious.com/recipes/food/views/onion-cheese-and-bacon-tart-107130"
}
