{
    "directions": [
        "Stir together water, honey, and yeast in bowl of mixer and let stand until creamy, about 5 minutes. Add flour and salt and beat with paddle attachment at medium speed until a dough forms. Attach dough hook and knead dough at medium speed until dough no longer sticks to side of bowl, 10 to 15 minutes. Cover bowl tightly with plastic wrap and let dough rise at warm room temperature until doubled in bulk, about 4 hours. (Dough will be sticky.)",
        "Put pizza stone in bottom third of oven and preheat oven to 450°F.",
        "Sprinkle bacon in a 12-inch skillet and add water. Cook bacon over moderate heat, stirring occasionally, until fat is rendered and bacon is translucent, about 6 minutes. Transfer bacon with a slotted spoon to paper towels to drain, then pour 1 tablespoon bacon fat into a 15- by 10- by 1-inch baking pan. Cool fat to warm, then grease pan with your fingers. Discard any remaining bacon fat and reserve skillet.",
        "With greased fingers, transfer dough to baking pan and stretch into a small rectangle. Continue to stretch until dough is a 10- by 8-inch rectangle, letting it rest about 3 minutes between stretches. (Dough will become more malleable as it rests.)",
        "Heat butter in reserved skillet over moderate heat until foam subsides, then cook onions with caraway seeds, pepper, and 1/2 teaspoon salt, stirring occasionally, until onions are golden brown, about 20 minutes. Spread onions on a baking sheet and cool completely, 5 to 10 minutes.",
        "Stir together crème fraîche, thyme, and remaining 1/4 teaspoon salt in a small bowl, then dollop over dough and spread evenly to edges with offset spatula. Sprinkle with bacon and onions.",
        "Bake tart in pan on stone until edges of crust are golden, 20 to 25 minutes. Cool in pan on a rack until warm, about 10 minutes, before cutting. Serve warm.",
        "Available from The Baker's Catalogue (800-827-6836)."
    ],
    "ingredients": [
        "1 cup warm water (100–110°F)",
        "1/2 teaspoon honey",
        "1/4 teaspoon active dry yeast (from a 1/4-ounce package)",
        "2 cups high-gluten all-purpose flour (not bread flour) such as Sir Lancelot High Gluten Flour*",
        "1/2 teaspoon salt",
        "5 ounce slab bacon, rind discarded and meat cut into 1/4-inch-thick slices, then cut crosswise into 1/4-inch strips (about 3/4 cup)",
        "3 tablespoons cold water",
        "2 tablespoons unsalted butter",
        "2 pounds small onions (about 8), halved lengthwise and cut crosswise into 1/4-inch-thick slices",
        "1/4 teaspoon caraway seeds",
        "1/2 teaspoon black pepper",
        "3/4 teaspoon salt",
        "2 tablespoons crème fraîche",
        "1 tablespoon minced fresh thyme",
        "Special equipment: a standing electric mixer with paddle attachment and dough hook; a pizza stone; a small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Onion",
        "Bake",
        "Cocktail Party",
        "Lunch",
        "Bacon",
        "Fall",
        "Oktoberfest",
        "Honey",
        "Caraway",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Onion and Bacon Tart",
    "url": "http://www.epicurious.com/recipes/food/views/onion-and-bacon-tart-107185"
}
