{
    "directions": [
        "1. To make the dough, pour the water into a large bowl or the bowl of an electric mixer. Mix in the yeast and 1 cup of the flour, mix, then let sit at room temperature until the mixture begins to bubble, about 30 minutes. Add the salt, stir, then add an additional cup of flour. The dough should be quite soft. Cover and let sit at room temperature until the dough has doubled in bulk, about 1-1/2 hours.",
        "2. Preheat the oven to 450 degrees F.",
        "3. Divide the dough in half. Heavily flour a work surface, and roll out the dough to a 15 x 11-inch rectangle (the dough should be paper-thin except at the edges, where it will be slightly thicker.) Carefully transfer the dough to a well-floured baking sheet.",
        "4. Mix the onions and the cream together in a medium-sized bowl and spread half on the dough. Sprinkle half the bacon evenly over the onions and cream. Repeat with the remaining dough, onions, cream, and bacon.",
        "5. Bake the pizzas in the center of the preheated oven until the crust is golden and the onions soften and begin to turn golden, about 20 to 25 minutes. If you can't fit both pizzas on the center rack of the oven, switch them halfway through baking.",
        "6. Remove the pizzas from the oven and slip them onto a work surface. Season with freshly ground black pepper, then cut into serving pieces."
    ],
    "ingredients": [
        "1 cup lukewarm water",
        "1 teaspoon bread yeast",
        "2 to 2-1/2 cups flour",
        "1/2 teaspoon sea salt",
        "12 ounces white onions, peeled and sliced paper thin",
        "1/2 cup crème fraîche",
        "6 ounces slab bacon, rind removed, cut in matchsticks",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Onion",
        "Pork",
        "Appetizer",
        "Bake",
        "Bacon",
        "Spring",
        "Birthday",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Onion, Bacon and Cream Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/onion-bacon-and-cream-pizza-103172"
}
