{
    "directions": [
        "Place the dough rounds on separate parchment-lined baking sheets and refrigerate for 30 minutes.",
        "Position a rack in the lower third of an oven and preheat to 400°F.",
        "In a sauté pan over medium-high heat, warm 3 Tbs. of the olive oil. Add the onions, salt and pepper and cook, stirring occasionally, until caramelized, 15 to 20 minutes. Add the garlic and cook for 1 minute more. Add the thyme, parsley and 2 tsp. of the vinegar and cook, stirring occasionally, until most of the liquid has evaporated, about 2 minutes. Remove from the heat and let cool to room temperature.",
        "Spread half of the onion mixture on each dough round, leaving a 1-inch border. Fold the dough up and pinch together at 2-inch intervals. Lightly brush the top of the dough with the beaten egg. Bake the tarts until the crusts are golden, 30 to 35 minutes. Transfer the baking sheets to wire racks and let the tarts cool for 10 minutes.",
        "In a bowl, whisk together the remaining 2 tsp. vinegar, the remaining 2 Tbs. olive oil, salt and pepper to form a vinaigrette. Toss half of the vinaigrette with the salad greens, then place the remaining vinaigrette in an oil mister. Top the tarts with the salad, dividing evenly, and sprinkle with the cheese. Mist the salads with the remaining vinaigrette. Serve immediately. Serves 8."
    ],
    "ingredients": [
        "2 rolled-out rounds savory tart dough, each 12 inches in diameter",
        "5 Tbs. olive oil",
        "4 yellow onions, thinly sliced",
        "Salt and freshly ground pepper, to taste",
        "3 garlic cloves, minced",
        "2 tsp. minced fresh thyme",
        "2 Tbs. minced fresh flat-leaf parsley",
        "4 tsp. balsamic vinegar",
        "1 egg, lightly beaten",
        "4 oz. mixed salad greens",
        "2 oz. goat cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Onion Tarts with Mixed Greens",
    "url": "http://www.williams-sonoma.com/recipe/onion-tarts-with-mixed-greens.html"
}
