{
    "directions": [
        "Lightly spray a 2 1/2-quart baking dish, 13 by 9 by 2 inches, with cooking spray.",
        "In a large non-stick skillet cook onion and 1 tablespoon garlic in oil over moderate heat, stirring, until onion is pale golden. Stir in bell peppers and salt and black pepper to taste and cook, covered, over moderately low heat 5 minutes, or until peppers are just tender. Remove lid and cook vegetables, stirring, until any excess liquid is evaporated, 2 to 3 minutes.",
        "Spread half of bread squares evenly in baking dish and top with half of vegetables. Sprinkle 1/4 cup Parmesan evenly over vegetables and top with remaining bread and vegetables.",
        "In a bowl whisk together whole eggs, whites, milk, parsley, remaining 1 1/2 teaspoons garlic, and salt and pepper to taste and pour evenly over bread and vegetables. Chill strata, covered, at least 3 hours and up to 12.",
        "Preheat oven to 375° F. and let >strata stand at room temperature 20 minutes.",
        "Sprinkle remaining 1/4 cup Parmesan over strata and bake in middle of oven 45 to 55 minutes, or until puffed and golden brown around edges.",
        "Serve strata topped with fresh tomato salsa."
    ],
    "ingredients": [
        "vegetable-oil cooking spray",
        "1 medium onion, sliced thin (about 3 cups)",
        "1 1/2 tablespoons minced garlic (about 2 large cloves)",
        "1 1/2 teaspoons olive oil",
        "1 large green bell pepper, sliced thin (about 2 cups)",
        "1 large yellow bell pepper, sliced thin (about 2 cups)",
        "12 very thin slices firm white sandwich bread, cut into 3/4-inch squares  (about 5 cups)",
        "1/2 cup freshly grated Parmesan (about 1 1/2 ounces)",
        "4 large whole eggs",
        "4 large egg whites",
        "2 1/2 cups skim milk",
        "1/2 cup packed fresh parsley leaves, washed well, spun dry, and  chopped fine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Vegetable",
        "Bake",
        "Low Fat",
        "Vegetarian",
        "Spring",
        "Gourmet"
    ],
    "title": "Onion and Bell Pepper Strata with Fresh Tomato Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/onion-and-bell-pepper-strata-with-fresh-tomato-salsa-12193"
}
