{
    "directions": [
        "Preheat an oven to 300°F.",
        "To make the onion confit, cut the butter into several pieces and place in a shallow baking dish large enough to hold the onions in a heaping layer 1 to 1 1/2 inches deep. (If the onions are spread too thinly, they will fry rather than \"melt\" into a confit.) Put the dish in the oven to melt the butter, about 5 minutes. Remove the dish and place half the sliced onions in it. Tear the bay leaves into 2 or 3 pieces and scatter half of the pieces over the onions. Then add 2 each of the thyme and winter savory sprigs, 1/2 tsp. of the pepper and 1/4 tsp. of the salt. Drizzle with 2 Tbs. of the olive oil. Repeat with the remaining onions, seasonings and olive oil, piling them on top.",
        "Return the dish to the oven and bake, turning the onions every 10 to 15 minutes, until they are a light golden brown and have reduced in volume by nearly half, 1 to 1 1/2 hours. Remove from the oven and discard the bay, thyme and winter savory.",
        "Meanwhile, make the dough: In a small bowl, dissolve the yeast in the warm water. Add the sugar and let stand until foamy, about 5 minutes.",
        "In a food processor, combine the yeast mixture, the salt, 1 Tbs. of the olive oil and 3 cups of the flour. Process until the ingredients come together into a ball. If the dough is too wet, add as much of the remaining 1/2 cup flour, a little at a time, as needed to form a smooth, firm ball. If the dough is too dry, add dribbles of warm water until the ball forms. Continue to process after the ball has formed until the dough is silky but firm, 3 to 4 minutes. Turn out the dough onto a well-floured work surface, and knead until the dough is smooth and elastic, 4 to 5 minutes.",
        "Oil a large bowl with the remaining 1 Tbs. olive oil. Place the dough ball in the bowl and turn the dough to coat the surface with oil. Cover with a clean, damp kitchen towel and let stand in a warm place until the dough doubles in size, 1 to 1 1/2 hours. Punch down the dough, re-cover the bowl with the towel and let rest for 30 minutes.",
        "Position a rack in the upper third of an oven and preheat to 500°F.",
        "Punch down the dough and turn out onto a floured work surface. Roll out the dough into a rectangle about 13 by 19 inches. Sprinkle a little flour on the bottom of a 12-by-18-inch baking sheet. Lay the dough on it, patting it up the sides to make a crust. Spread the surface with the onion confit, then arrange the anchovies and olives evenly over the surface.",
        "Bake until the bottom of the crust is crisp and the edges are lightly browned, 12 to 15 minutes. Remove from the oven. While hot, drizzle with the 2 tsp. olive oil, then sprinkle with the marjoram.",
        "Cut the",
        "pissaladière",
        "into rectangles about 3 by 3 1/2 inches and serve warm or at room temperature."
    ],
    "ingredients": [
        "4 Tbs. (1/2 stick) unsalted butter",
        "3 1/2 lb. yellow onions, sliced 1/4 inch  &nbsp thick",
        "2 fresh bay leaves or 1 dried bay leaf",
        "4 large fresh thyme sprigs",
        "4 fresh winter savory sprigs",
        "1 tsp. freshly ground pepper",
        "1/2 tsp. salt",
        "4 Tbs. extra-virgin olive oil",
        "5 tsp. (2 packages) active dry yeast",
        "1 cup warm water (105°F)",
        "1 tsp. sugar",
        "1 tsp. salt",
        "2 Tbs. extra-virgin olive oil",
        "About 3 1/2 cups all-purpose flour",
        "20 anchovy fillets",
        "20 oil-cured black olives",
        "2 tsp. olive oil",
        "2 Tbs. minced fresh marjoram"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Onion Confit Pizza (Pissaladière)",
    "url": "http://www.williams-sonoma.com/recipe/onion-confit-pizza-pissaladiere.html"
}
