{
    "directions": [
        "Sprinkle the yeast and sugar over 1/2 cup of warm water in a large bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Beat in 1 egg and butter. Gently stir in the flour, salt, and lemon zest until the dough has pulled together. Gather the dough into a ball, then place in a lightly oiled bowl. Turn dough ball to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 45 minutes.",
        "Punch down the dough, and place in a 10-inch tart pan with a removable bottom. Spread dough out from the center using fingers. The dough should be thinner in the center and thicker at the edges. Chill in the refrigerator for 20 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Heat the vegetable oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Sprinkle chilled tart shell with Gouda and Parmesan cheeses. Arrange the cooked onion and piquillo peppers decoratively over the cheese. Beat 2 eggs and heavy cream with the mustard in a bowl; pour egg mixture over the onion and cheese.",
        "Bake in the preheated oven until the crust is golden brown and the custard has set, 30 to 45 minutes."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 pinch white sugar",
        "1/2 cup warm water",
        "1 egg, at room temperature",
        "3 tablespoons butter, at room temperature",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "2 teaspoons lemon zest",
        "1/2 teaspoon vegetable oil",
        "1/2 red onion, sliced",
        "1 cup shredded Gouda cheese",
        "1/2 cup grated Parmesan cheese",
        "2 jarred roasted piquillo peppers, diced",
        "1/4 teaspoon ground black pepper to taste",
        "2 eggs",
        "1 1/2 cups heavy cream",
        "1/4 teaspoon stone-ground mustard"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Onion Tart",
    "url": "http://allrecipes.com/recipe/215153/onion-tart/"
}
