{
    "directions": [
        "Melt butter with oil in heavy large pot over medium-high heat. Add onions; sauté until caramelized, about 20 minutes. Add barley and Sherry; cook 30 seconds. Add chicken stock and thyme. Bring to boil. Reduce heat; cover and simmer 30 minutes. Season with salt and pepper. Discard thyme. (Can be made 1 day ahead. Cool, cover, and chill. Bring to simmer before serving.)",
        "Preheat oven to 300°F. Place six 3/4-cup custard cups or soufflé dishes in baking pan. Melt butter in heavy medium skillet over medium heat. Add onions; sauté until tender but not brown, about 8 minutes. Cool slightly; transfer to blender. Add cream, eggs, salt, and pepper; blend until smooth. Stir in cheese. Divide custard among prepared cups. Fill pan with enough hot water to come halfway up sides of cups. Bake flans until centers are softly set, about 30 minutes.",
        "Cool flans 10 minutes in pan. Cut around flans to loosen; turn out each in center of soup bowl. Ladle soup around flans and serve."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons olive oil",
        "8 cups sliced onions",
        "1/3 cup pearl barley",
        "3 tablespoons dry Sherry",
        "8 cups chicken stock or canned low-salt chicken broth",
        "4 fresh thyme sprigs",
        "3 tablespoons butter",
        "2 cups sliced onions",
        "3/4 cup whipping cream",
        "3 large eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 1/4 cups (packed) grated Swiss cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Onion",
        "Bake",
        "Sauté",
        "Barley",
        "Winter",
        "Swiss Cheese",
        "Thyme"
    ],
    "title": "Onion and Barley Soup with Swiss Cheese Flan",
    "url": "http://www.epicurious.com/recipes/food/views/onion-and-barley-soup-with-swiss-cheese-flan-105535"
}
