{
    "directions": [
        "Blend together flour, butter, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until most of mixture resembles coarse meal with some roughly pea-size butter lumps.",
        "Drizzle 3 tablespoons ice water evenly over mixture and gently stir with a fork (or pulse in processor) until incorporated.",
        "Squeeze a small handful: If it doesn't hold together, add more ice water, 1/2 tablespoon at a time, stirring (or pulsing) until incorporated, then test again. (Do not overwork mixture or pastry will be tough.)",
        "Turn out mixture onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough together, with a pastry or bench scraper if you have one, and press into a ball, then flatten into a 5-inch disk. Chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Cook onions in oil and butter in a 12-inch heavy skillet over medium heat, stirring occasionally, until softened and golden, about 30 minutes.",
        "Preheat oven to 375°F with rack in middle.",
        "Finely chop anchovies and garlic together. Stir together with tomato paste and thyme.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round. Transfer to a parchment-lined large baking sheet.",
        "Spread tomato-anchovy mixture over dough, leaving a 2-inch border along edge, then arrange onions on top. Fold edges of dough inward. Bake until pastry is golden, 45 to 50 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 stick cold unsalted butter, cut into 1/2-inch cubes",
        "1/4 teaspoon salt",
        "3 to 5 tablespoons ice water",
        "2 large onions (2 pounds total), sliced",
        "2 tablespoons olive oil",
        "2 tablespoons unsalted butter",
        "5 to 6 anchovy fillets",
        "1 garlic clove",
        "2 tablespoons tomato paste",
        "1/2 teaspoon dried thyme, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Onion",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Lunch",
        "Chill",
        "Potluck",
        "Anchovy",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Onion Anchovy Galette",
    "url": "http://www.epicurious.com/recipes/food/views/onion-anchovy-galette-358118"
}
