{
    "directions": [
        "Cut 1/2 inch from the stem end of each onion, leaving the root end intact, and with a melon-ball cutter scoop out the centers, reserving 1 1/2 cups of the centers and leaving 1/4-inch shells. In a kettle of boiling salted water boil the onion shells gently for 5 minutes and let them drain, inverted, on paper towels. Chop fine the reserved onion. In a heavy skillet cook the bacon over moderate heat until it is crisp, transfer it with tongs to paper towels to drain, and crumble it. Pour all but 1 tablespoon of the fat from the skillet, add the butter, and heat the mixture over moderately high heat until the foam subsides. Add the potatoes, peeled and cut into 1/4-inch dice, the chopped onion, and the bell pepper and sauté the vegetables, stirring frequently, for 4 to 6 minutes, or until the potatoes are golden brown and just tender. Remove the skillet from the heat and stir in the parsley, the thyme, 3/4 cup of the Cheddar, and salt and pepper to taste.",
        "Sprinkle the onion shells with salt and pepper, divide the potato mixture among them, and put the onions in a shallow 15 1/2- by 10 1/2-inch baking pan. Add 1 cup water to the pan and bake the onions in a preheated 350°F. oven for 30 minutes. Top the onions with the remaining 1/4 cup Cheddar and bake them for 10 to 15 minutes more, or until the cheese is melted."
    ],
    "ingredients": [
        "six 3/4-pound onions",
        "6 slices of lean bacon",
        "2 tablespoons unsalted butter",
        "1 pound russet (baking) potatoes",
        "1 small green bell pepper, chopped fine",
        "1/3 cup minced fresh parsley leaves",
        "1 teaspoon dried thyme, crumbled",
        "1 cup grated sharp Cheddar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Sauté",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Bacon",
        "Fall",
        "Gourmet"
    ],
    "title": "Onions Filled with Hashed-Brown Potatoes and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/onions-filled-with-hashed-brown-potatoes-and-bacon-12826"
}
