{
    "directions": [
        "Combine 1 cup flour, 1 cup warm water, and 1 teaspoon yeast in large bowl; stir to blend well. Cover bowl with plastic wrap and let stand until mixture bubbles, about 30 minutes. Stir in salt, then 1 1/4 cups flour. Mix until soft slightly sticky dough forms, adding more flour by tablespoonfuls if very sticky. Cover bowl with plastic wrap. Let dough rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
        "Preheat oven to 500°F. Lightly flour 2 large baking sheets. Lightly flour hands; punch down dough and divide in half. Roll out each half on lightly floured surface to thin 16x10-inch rectangle. Transfer each rectangle to prepared baking sheet. If dough shrinks, roll or stretch each back to size. Puree crème fraîche, cottage cheese, and sour cream in processor until smooth. Season to taste with salt and pepper. Spread cream mixture over crusts. Sprinkle onions and raw bacon over cream mixture, dividing equally. Bake tarts until edges of crusts are crisp and brown, about 14 minutes. Sprinkle generously with pepper; cut into pieces and serve.",
        "*Sold at some supermarkets. If unavailable, heat 1 cup whipping cream to lukewarm (85°F). Remove from heat and mix in 2 tablespoons buttermilk. Cover and let stand in warm, draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Refrigerate until ready to use."
    ],
    "ingredients": [
        "2 1/4 cups (or more) all purpose flour",
        "1 cup warm water (110°F to 115°F)",
        "1 teaspoon active dry yeast",
        "1/2 teaspoon fine sea salt",
        "3/4 cup crème fraîche*",
        "1/3 cup large-curd cottage cheese",
        "1/3 cup sour cream",
        "2 small white onions, very thinly sliced (about 1 1/2 cups)",
        "12 ounces 1/4-inch-thick bacon slices cut crosswise into 1/2-inch-wide strips",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Pork",
        "Bake",
        "Lunch",
        "Cream Cheese",
        "Bacon",
        "Fall",
        "Oktoberfest",
        "Sour Cream",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Onion and Bacon Tart",
    "url": "http://www.epicurious.com/recipes/food/views/onion-and-bacon-tart-108602"
}
