{
    "directions": [
        "1. Combine the chicken, olive oil, salt, pepper, and Worcestershire sauce in a bowl. Cover with plastic wrap and set aside for 30 minutes so the chicken can marinate.",
        "2. Toast the pecans in a small skillet over medium heat for 2 minutes, or until golden brown, stirring occasionally. Alternatively, roast the pecans in a preheated 300°F oven for 15 minutes, or until they smell toasted. Transfer the pecans to a plate and set aside to cool.",
        "3. Grill the chicken under the broiler or on an outdoor grill for 10 to 12 minutes, or until thoroughly cooked, turning once. Whether broiling or grilling, for the best flavor make sure the heat is high so you will get a nice caramelized brown color on the chicken. Allow the chicken to rest for at least 10 minutes to allow the juices to settle in the meat. Using a very sharp knife, slice the chicken as thinly as possible on a bias.",
        "4. Spread each slice of bread evenly with the mayonnaise. Divide the chicken slices between the 2 slices of bread. Sprinkle with bits of the blue cheese and then sprinkle on the toasted pecans.",
        "5. With a sharp knife, quarter each sandwich. Garnish each quarter with a sprig of watercress and serve."
    ],
    "ingredients": [
        "One 6-ounce boneless, skinless chicken breast, cut in half lengthwise",
        "2 tablespoons olive oil",
        "Kosher salt and freshly ground black pepper to taste",
        "Dash of Worcestershire sauce",
        "2 tablespoons chopped pecans",
        "2 slices raisin pumpernickel bread",
        "2 tablespoons mayonnaise, homemade or store-bought",
        "2 tablespoons Maytag Blue cheese",
        "8 watercress sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Chicken",
        "Poultry",
        "Brunch",
        "Picnic",
        "Mother's Day",
        "Lunch",
        "Blue Cheese",
        "Tree Nut",
        "Pecan",
        "Grill",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Open-Face Grilled Chicken, Maytag Blue Cheese, and Toasted Pecan Sandwich",
    "url": "http://www.epicurious.com/recipes/food/views/open-face-grilled-chicken-maytag-blue-cheese-and-toasted-pecan-sandwich-395410"
}
