{
    "directions": [
        "Bring a large saucepan of slated water to boil for won ton wrappers.",
        "In a small saucepan cook shallot and gingerroot in wine until wine is reduced to about 1 tablespoon. Remove pan from heat and whisk butter into sauce, 1 piece at a time, adding each new piece before previous one has melted completely. (Sauce should not become hot enough to liqueify.)",
        "Whisk in zest, juice, and salt and pepper to taste and keep sauce warm, covered.",
        "In a large heavy skillet heat oil over moderately high heat until hot but not smoking and sauté shrimp, carrot, and scallions with salt and pepper to taste, stirring, about 2 minutes, or until shrimp is just cooked through and vegetables are tender. Keep shrimp mixture warm, covered.",
        "Add won tons to boiling water and cook, stirring gently, until al dente, about 3 minutes. Drain won tons in a colander.",
        "Immediately spoon a scant tablespoon sauce on each of 2 plates. On each plate stack 1 won ton, one fourth of the shrimp mixture, and another scant tablespoon sauce. Stack on top the remaining ingredients in same manner, ending each stack with a won ton.",
        "Garnish each serving with some scallion green."
    ],
    "ingredients": [
        "6 won ton wrappers",
        "1/3 cup finely chopped shallot",
        "1/4 teaspoon grated peeled fresh gingerroot",
        "1/2 cup dry white wine",
        "2 tablespoons cold unsalted butter, cut into pieces",
        "1/2 teaspoon freshly grated lime zest",
        "1/2 teaspoon fresh lime juice, or to taste",
        "1 tablespoon olive oil",
        "1/2 pound large shrimp (about 10), shelled and halved lengthwise",
        "1 carrot, cut into 1/4-inch dice",
        "2 scallions, cut diagonally into 1/2-inch pieces",
        "Garnish: 1 scallion green, sliced thin lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pasta",
        "Appetizer",
        "Sauté",
        "Quick & Easy",
        "Lime",
        "Shrimp",
        "Carrot",
        "Spring",
        "Gourmet"
    ],
    "title": "Open Shrimp Ravioli with Lime Ginger Butter",
    "url": "http://www.epicurious.com/recipes/food/views/open-shrimp-ravioli-with-lime-ginger-butter-14096"
}
