{
    "directions": [
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "While grill heats, whisk together yogurt, minced mint, lemon juice, and salt to taste. Mince 1 half of garlic clove and whisk into yogurt sauce.",
        "Mix lamb, parsley, onion, salt, pepper, and allspice with your hands in a bowl until just combined (do not overwork mixture or patties will be tough). Form into 4 (4 1/2-inch) patties (1/2 inch thick).",
        "Brush both sides of bread slices with 2 tablespoons oil (total for all slices) and grill, covered only if using a gas grill, turning over once, until golden, 1 to 2 minutes total. Rub 1 side of each toast with cut side of remaining garlic and season with salt.",
        "Grill patties on lightly oiled grill rack, covered only if using a gas grill, turning over once, until browned but still slightly pink in center, 5 to 7 minutes total.",
        "Toss together mesclun, whole mint leaves, remaining teaspoon oil, and salt and pepper to taste. Divide lamb among toasts on plates, then spoon sauce over and top with greens."
    ],
    "ingredients": [
        "1 cup plain yogurt",
        "1 cup loosely packed whole fresh mint leaves plus 2 tablespoons minced",
        "1 teaspoon fresh lemon juice",
        "1 garlic clove, halved lengthwise",
        "1 1/2 lb ground lamb (not lean)",
        "1/3 cup minced fresh parsley",
        "1/4 cup minced onion",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/8 teaspoon ground allspice",
        "4 (1/2-inch-thick) slices country-style bread (from a crusty round loaf; preferably 6 inches in diameter)",
        "2 tablespoons plus 1 teaspoon extra-virgin olive oil",
        "2 oz mesclun (3 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Lamb",
        "Picnic",
        "Yogurt",
        "Lemon",
        "Mint",
        "Summer",
        "Grill/Barbecue",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Open-Face Lamb Burgers with Mint Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/open-face-lamb-burgers-with-mint-yogurt-sauce-108342"
}
