{
    "directions": [
        "Preheat an oven to 450 degrees F (230 degrees C). Grease a roasting pan. Mix the salt and pepper together in a small bowl, and set aside.",
        "Stir together the butter, thyme, and sage in a small bowl. Place the turkey into the prepared roasting pan, and separate the skin from the breast through the neck cavity. Spread the butter mixture evenly over the breast, then press the skin back down on top of the butter. Brush the outside of the turkey with the olive oil, then sprinkle with the salt and pepper mixture. Whisk together the orange juice, maple syrup, and half of the chicken broth, and set aside.",
        "Bake the turkey in the preheated oven until no longer pink at the bone and the juices run clear, about 3 hours. Baste every 30 minutes with the maple syrup mixture. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area  10 to 15 minutes before slicing.",
        "Once the turkey has rested, remove it from the roasting pan, and place it onto a serving platter. Place the roasting pan onto the stove, and stir in the remaining chicken broth along with the vermouth. Bring to a simmer over medium-high heat. Scrape the bottom of the roasting pan well to dissolve the browned bits, then simmer over medium-low heat until the gravy thickens, about 10 minutes total. Strain before serving with the turkey."
    ],
    "ingredients": [
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 cup butter, softened",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons chopped fresh sage",
        "1 (20 pound) whole turkey, neck and giblets removed",
        "3 tablespoons olive oil",
        "1/4 cup orange juice",
        "1/2 cup maple syrup",
        "1 cup chicken broth, divided",
        "1/2 cup dry vermouth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange and Maple Glazed Turkey",
    "url": "http://allrecipes.com/recipe/183650/orange-and-maple-glazed-turkey/"
}
