{
    "directions": [
        "Position rack in lowest third of oven and preheat to 400°F. Combine sugar and vanilla bean in processor and blend until vanilla bean is finely chopped. Add orange and process until orange is finely chopped. Transfer to bowl. Add rhubarb, cranberries, apricots and flour and toss.",
        "Roll out 1 pie crust disk on lightly floured surface to 13-inch round (about 1/8 inch thick). Roll up dough on rolling pin and transfer to 9-inch-diameter pie plate. Gently press into place. Trim edges of crust, leaving 3/4-inch overhang. Roll out second disk on lightly floured surface to 13-inch round. Cut round into 1/2-inch-wide strips. Spoon rhubarb mixture into crust. Place strips atop pie, forming lattice. Pinch edges to seal strips to crust edge. Fold overhang under strip ends so that crust is flush with edge of pie pan. Crimp edges to make decorative border. Bake until crust is golden and filling bubbles around edges, covering edges of crust if browning too quickly, about 55 minutes. Cool. Serve pie warm or at room temperature with Sour Cream Topping.",
        "Combine sour cream, brown sugar and grated orange peel in small bowl. (Topping can be prepared 2 days ahead. Cover tightly and refrigerate.)"
    ],
    "ingredients": [
        "1 3/4 cups sugar",
        "1 2-inch piece vanilla bean, quartered",
        "1/2 orange (unpeeled), cut into chunks",
        "1 20-ounce bag frozen rhubarb",
        "1/2 cup cranberries, coarsely chopped",
        "1/2 cup thinly sliced dried apricots",
        "1/4 cup all purpose flour",
        "2 Buttermilk Pie Crust Dough disks",
        "Makes about 1 cup",
        "1 cup sour cream",
        "2 tablespoons firmly packed dark brown sugar",
        "1/2 teaspoon grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Orange",
        "Apricot",
        "Fall",
        "Rhubarb",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange-Rhubarb Pie with Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/orange-rhubarb-pie-with-apricots-2695"
}
