{
    "directions": [
        "Mix first 6 ingredients in small bowl. Rinse turkey inside and out; pat dry. Place on rack set in large roasting pan. Rub inside of main cavity and neck cavity with orange quarters (reserve orange quarters); sprinkle with salt and pepper. Rub herb butter over outside of turkey. (Can be prepared 1 day ahead. Cover; chill.)",
        "Set rack at lowest position in oven and preheat to 350°F. If not stuffing turkey, fill main cavity and neck cavity with orange quarters, onion, garlic, celery, thyme sprigs, and sage sprigs. If stuffing turkey, spoon stuffing loosely into both cavities. Tuck wing tips under; tie legs together loosely to hold shape. Mix orange juice and Dijon mustard in small bowl; pour into pan around turkey. Place turkey in oven with tail at back. Roast turkey 45 minutes. Add 2 cups broth to pan; baste turkey. Turn pan around. Roast turkey 45 minutes. Add 1 cup broth; baste with pan juices. Turn pan around and cover turkey loosely with foil. Continue to roast until thermometer inserted into thickest part of thigh registers 175°F, basting with 1 cup broth and rotating pan every 45 minutes, about 1 hour 45 minutes longer if unstuffed and 2 hours 15 minutes longer if stuffed. Transfer turkey to platter; let stand 30 minutes (internal temperature will increase 5 to 10 degrees).",
        "Strain pan juices into 8-cup measuring cup. Spoon off fat. Melt butter in large saucepan over medium-high heat. Add onion; sauté 3 minutes. Add flour and stir until golden, about 5 minutes. Whisk in apple and all remaining ingredients, then pan juices. Bring gravy to boil. Reduce heat to medium and simmer until gravy thickens, whisking occasionally, about 10 minutes. Season gravy with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter, room temperature",
        "1 tablespoon dried tarragon",
        "1 tablespoon dried marjoram",
        "1 tablespoon mustard seeds, coarsely crushed",
        "2 teaspoons coarse salt",
        "1/2 teaspoon ground black pepper",
        "1 12- to 14-pound turkey",
        "1 large orange, quartered",
        "1 onion, peeled, quartered (optional)",
        "1 head of garlic, unpeeled, cut horizontally in half (optional)",
        "2 celery stalks, cut into 2-inch lengths (optional)",
        "3 fresh thyme sprigs (optional)",
        "2 fresh sage sprigs (optional)",
        "1 cup orange juice",
        "1 tablespoon Dijon mustard",
        "5 cups (about) low-salt chicken broth",
        "4 1/2 tablespoons butter",
        "3/4 cup minced onion",
        "3 tablespoons all purpose flour",
        "1 large Gala apple, peeled, cored, cut into 1/4-inch cubes",
        "1 1/2 cups whole milk",
        "1 cup low-salt chicken broth",
        "3/4 cup apple cider",
        "2 small bay leaves, torn into pieces",
        "1 tablespoon Dijon mustard",
        "1 1/2 teaspoons mustard seeds, coarsely crushed",
        "1 1/2 teaspoons chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Mustard",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall"
    ],
    "title": "Orange- and Mustard-Basted Turkey with Apple Cider-Mustard Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/orange-and-mustard-basted-turkey-with-apple-cider-mustard-gravy-107285"
}
