{
    "directions": [
        "Combine sugar, orange juice concentrate and water in heavy medium saucepan. Stir over medium heat until sugar dissolves; bring to rolling boil. Pour syrup into small bow. Refrigerate uncovered until cold and thickened, about 3 hours. (Can be prepared 3 days ahead. Cover and keep refrigerated.)",
        "Preheat oven to 350°F. Grease bottom of 9x9x2-inch baking pan. Combine 1/2 cup cake meal, potato starch and cinnamon in small bowl; whisk to blend. Combine dates and remaining 1 tablespoon cake meal in medium bowl. Toss to coat and separate pieces. Mix chocolate and nuts into dates.",
        "Beat margarine and 1 cup orange syrup in large bowl until blended. Add egg yolks 2 at a time, beating well after each addition. Beat in orange peel, then dry ingredients; stir in date mixture. Using clean dry beaters, beat whites and salt in another large bowl until soft peaks form. Gradually add sugar, beating until stiff but not dry. Fold large spoonful of whites into batter to lighten. Fold in remaining whites in 3 additions.",
        "Transfer batter to prepared pan. Bake until tester inserted into center comes out clean, about 35 minutes. Cool cake in pan on rack. (Can be made 1 day ahead. Cover and let stand at room temperature.)",
        "Using small sharp knife, cut all peel and white pith from oranges. Working over bowl, cut between membranes to release segments. Chill until ready to serve.",
        "Brush some of remaining orange syrup over cake. Cut cake lengthwise into 4 equal strips. Cut each strip into 3 diamonds (reserving remaining cake for nibbling). Place cake on platter. Mix enough of remaining orange syrup into oranges to sweeten to taste. Serve cake with fruit."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "3/4 cup frozen orange juice concentrate, thawed",
        "6 tablespoons water",
        "1/2 cup plus 1 tablespoon matzo cake meal",
        "6 tablespoons potato starch",
        "1 teaspoon ground cinnamon",
        "6 ounces pitted dates (about 1 1/4 cups), chopped",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1 cup walnuts (about 4 ounces), toasted, coarsely chopped",
        "6 tablespoons (3/4 stick) unsalted pareve margarine, melted, cooled",
        "6 large eggs, separated",
        "1 1/2 tablespoons grated orange peel",
        "1/2 teaspoon salt",
        "1/4 cup sugar",
        "8 to 10 oranges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Passover",
        "Orange",
        "Date",
        "Walnut",
        "Kosher"
    ],
    "title": "Orange Date-Nut Diamonds",
    "url": "http://www.epicurious.com/recipes/food/views/orange-date-nut-diamonds-1695"
}
