{
    "directions": [
        "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Dust with flour; tap out excess. Using vegetable peeler, remove peel (orange part only) in strips from oranges. Coarsely chop enough peel to measure 1/2 cup. Combine flour, 1 cup almonds, baking powder and salt in processor; blend until finely ground. Transfer to medium bowl. Place 2 cups sugar and orange peel in processor; blend until peel is finely minced.",
        "Using electric mixer, beat butter in large bowl until blended. Add sugar mixture and beat until fluffy. Beat in eggs 1 at a time. Mix milk and both extracts in small bowl. On low speed, beat flour mixture into egg mixture alternately with milk mixture in 3 additions each. Divide batter among prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes in pans on racks 5 minutes. Turn cakes out onto racks and cool completely. Boil 1 1/2 cups fresh orange juice and remaining generous 1 tablespoon sugar in small saucepan until reduced to 1/2 cup, about 8 minutes. Brush warm juice mixture over tops of cooled cakes.",
        "Place 1 cake layer, orange syrup side up, on cake platter. Spread 1 cup Chocolate Icing over. Top with second cake layer, then 1 cup icing. Top with third cake layer, syrup side up. Spread remaining icing over top and sides of cake. (Can be prepared 1 day ahead. Cover with cake dome and store at room temperature.) Arrange additional almonds, orange triangles and mint leaves around top edge of cake. Slice cake and serve."
    ],
    "ingredients": [
        "3 large oranges",
        "2 cups plus 2 tablespoons all purpose flour",
        "1 cup whole almonds",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "2 cups plus generous 1 tablespoon sugar",
        "1 cup unsalted butter, room temperature",
        "4 large eggs",
        "1 cup whole milk",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1 1/2 cups fresh orange juice",
        "Chocolate Icing",
        "Additional whole almonds",
        "Small orange-slice triangles",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange-Almond Cake with Chocolate Icing",
    "url": "http://www.epicurious.com/recipes/food/views/orange-almond-cake-with-chocolate-icing-101009"
}
