{
    "directions": [
        "Into a bowl sift together the flour, the salt, the baking soda, and the baking powder and stir in the poppy seeds. In a large bowl with an electric mixer cream the butter with 1 cup of the sugar and the zest until the mixture is light and fluffy. In a small bowl whisk together the yolks, the sour cream, and the vanilla until the mixture is combined well and beat the flour mixture and the yolk mixture into the butter mixture alternately, beginning and ending with the flour mixture and beating well after each addition. In another bowl with cleaned beaters beat the whites with a pinch of salt until they are foamy, add the cream of tartar, and beat the white until they hold soft peaks. Add the remaining 1/4 cup sugar, a little at a time, beating, and beat the meringue until it holds stiff peaks. Stir about one third of the meringue into the batter to lighten it, fold in the remaining meringue gently but thoroughly, and pour the batter into a buttered and floured 10-inch springform pan, smoothing the top. Bake the cake in the middle of a preheated 350°F. oven for 40 to 45 minutes, or until a tester comes out clean.",
        "In a small saucepan combine the juice, the liqueur, the sugar, and the zest, heat the mixture over moderately high heat, stirring, until the sugar is dissolved, and remove the pan from the heat.",
        "Transfer the zest with a fork to a bowl, pour 1/3 cup of the syrup into the bowl, reserving the remaining syrup, and add the berries to the bowl. Toss the mixture until it is combined well and chill it, covered, for at least 2 hours and up to 24 hours.",
        "Remove the cake from the oven, transfer it in the pan to a rack, and poke the top immediately all over with a skewer. Brush the top of the cake generously with half the reserved syrup, letting some of it run down between the cake and the side of the pan, and let the cake stand for 10 minutes. Run a thin knife around the edge of the pan, remove the side of the pan, and invert the cake onto the rack. Poke the cake all over with the skewer and brush it generously with the remaining syrup. Re-invert the cake onto another rack and let it cool completely. (The cake may be made 1 day in advance and kept wrapped well in plastic wrap or in an airtight container at room temperature). Just before serving, sift the confectioners' sugar over the top of the cake and serve the cake with the macerated berries and the crème fraîche."
    ],
    "ingredients": [
        "1 1/2 cups cake flour (not self-rising)",
        "3/4 teaspoon salt",
        "1 teaspoon baking soda",
        "1/2 teaspoon double-acting baking powder",
        "1/4 cup poppy seeds",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1 1/4 cups sugar",
        "2 teaspoons freshly grated orange zest",
        "4 large eggs, separated",
        "2/3 cup sour cream",
        "2 teaspoons vanilla",
        "1/4 teaspoon cream of tartar",
        "1 cup fresh orange juice",
        "1/4 cup plus 2 tablespoons Grand Marnier or other orange-flavored liqueur",
        "3 tablespoons sugar",
        "1/4 cup julienne strips of orange zest (preferably removed with a zester)",
        "3 cups mixed berries",
        "confectioner's sugar for sifting over the cake",
        "crème fraîche as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Triple Sec",
        "Summer",
        "Gourmet"
    ],
    "title": "Orange Poppy-Seed Cake with Berries and Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/orange-poppy-seed-cake-with-berries-and-creme-fraiche-11901"
}
