{
    "directions": [
        "Bring cranberries and cranberry concentrate to simmer in medium saucepan. Cover; cook over medium-low heat until berries are very tender, about 12 minutes. Cool; puree in blender until smooth. DO AHEAD: Can be made 1 week ahead. Cover and chill.",
        "Combine egg yolks, sugar, orange juice, corn syrup, and vodka in large metal bowl. Place over saucepan of boiling water. Using electric mixer, beat until thick and billowy and instant-read thermometer registers 140°F for 3 minutes, about 7 minutes total. Remove bowl from over water. Beat mixture 2 minutes. Add 1 cup cranberry puree; beat until mixture is cool, about 5 minutes. Cover; freeze until firm, about 4 hours. DO AHEAD: Can be made 3 days ahead; keep frozen. Chill remaining puree.",
        "Set rack in top third of oven and preheat to 400°F. Line baking sheet with parchment. Whisk egg white and 1/4 cup sugar in small bowl. Add almonds;toss to coat.",
        "Grind 1/2 cup sugar and almond paste in processor to fine meal. Add flour and next 4 ingredients; blend 5 seconds. Add shortening; blend until coarse meal forms. Transfer to large bowl. Whisk egg yolk and orange juice in small bowl; add to dry ingredients, tossing until clumps form. Gather dough into 10-inch-long log. Cut crosswise into 10 pieces. Shape each into 2 1/4-inch round, about 1 inch thick. Place on sheet. Spoon almonds over biscuits (some egg white will be left over).",
        "Bake biscuits until golden and tester inserted into centers comes out clean, 25 minutes. Transfer to rack; cool.",
        "Swirl 1 cup remaining cranberry puree into cream topping (in about 5 turns; do not overmix) for ribboned look. Halve biscuits horizontally. Let cranberry parfait soften slightly at room temperature 10 minutes before assembling shortcakes. Mound parfait onto biscuit bottoms; cover with tops. Mound cream-cranberry mixture alongside.",
        "*Almond paste is available in the baking aisle of supermarkets and specialty foods stores."
    ],
    "ingredients": [
        "1 12-ounce package fresh or frozen cranberries",
        "1 12-ounce container frozen concentrated cranberry juice cocktail, thawed",
        "8 large egg yolks",
        "3/4 cup sugar",
        "2/3 cup orange juice",
        "2 tablespoons light corn syrup",
        "1 tablespoon vodka",
        "1 large egg, separated",
        "3/4 cup sugar, divided",
        "1/2 cup sliced almonds",
        "1/2 7-ounce log almond paste,* diced",
        "2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon finely grated orange peel",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground ginger",
        "6 tablespoons non-hydrogenated vegetable shortening, frozen, diced",
        "2/3 cup orange juice",
        "1 8-ounce container frozen nondairy cream topping, thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Egg",
        "Dessert",
        "Bake",
        "Hanukkah",
        "Kid-Friendly",
        "Cranberry",
        "Orange",
        "Almond",
        "Winter",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Orange-Almond Shortcakes with Cranberry Parfait",
    "url": "http://www.epicurious.com/recipes/food/views/orange-almond-shortcakes-with-cranberry-parfait-240706"
}
