{
    "directions": [
        "Place ribs, 1/2 cup soy sauce, 3 minced garlic cloves, 2 teaspoons cumin seeds, and 1 teaspoon red pepper flakes in a large pot; add water to cover completely. Bring to a boil and immediately reduce to a simmer. Cover with lid ajar; cook until ribs are tender, about 2 hours. Drain ribs; set aside for 10 minutes.",
        "Meanwhile, heat oil in a small saucepan over medium heat; add remaining 3 teaspoons cumin seeds and 2 teaspoons red pepper flakes. Toast lightly until fragrant, about 30 seconds; add remaining 6 minced garlic cloves and white and pale-green scallions. Sauté until just soft, about 2 minutes. Add remaining 1/2 cup soy sauce, orange juice, and honey. Bring to a boil and cook until sauce is thick, 12-15 minutes.",
        "Preheat broiler. Line a rimmed baking sheet with foil. Place ribs on prepared sheet; brush with sauce. Broil until sauce bubbles, 2-3 minutes. Turn, brush with additional sauce, and broil until ribs are heated through and sauce is bubbling, 2-3 minutes longer. Transfer to a platter. Drizzle with remaining sauce. Sprinkle dark-green scallions and citrus zest over."
    ],
    "ingredients": [
        "3 1/2 pounds baby back pork ribs, cut between bones into individual ribs (18-20 ribs)",
        "1 cup soy sauce, divided",
        "9 garlic cloves, minced, divided",
        "5 teaspoons cumin seeds, divided",
        "3 teaspoons crushed red pepper flakes, divided",
        "3 tablespoons vegetable oil",
        "6 scallions (white and light-green parts separated from dark-green parts), finely chopped",
        "1 1/2 cups fresh orange juice plus zest from 1 orange",
        "3 tablespoons honey",
        "Zest from 1 lemon and 1 lime"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Soy",
        "Broil",
        "Dinner",
        "Orange",
        "Meat",
        "Pork Rib",
        "Family Reunion",
        "Potluck",
        "Soy Sauce",
        "Boil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Orange and Soy-Glazed Baby Back Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/orange-and-soy-glazed-baby-back-ribs-380592"
}
