{
    "directions": [
        "Heat the oven to 350 degrees. Grease and flour two 8 1/2 x 4 1/2 x 2 1/2-inch loaf pans. Line the bottoms with parchment paper.",
        "Cream the butter and 2 cups of the granulated sugar in the bowl of an electric mixer fitted with the paddle attachment for about 5 minutes, or until light and fluffy. With the mixer on medium speed, beat in the eggs, one at a time, and the orange zest.",
        "In a large bowl, sift together the flour, baking powder, baking soda, and salt. In another bowl, combine 1/4 cup of the orange juice, the buttermilk, and vanilla. Add the flour and buttermilk mixtures alternately to the batter, beginning and ending with the flour. Divide the batter evenly between the pans, smooth the tops, and bake for 45 minutes to 1 hour, until a cake tester comes out clean.",
        "While the cakes bake, cook the remaining 1/2 cup of granulated sugar with the remaining 1/2 cup orange juice in a small saucepan over low heat until the sugar dissolves. When the cakes are done, let them cool for 10 minutes. Take them out of the pans and place them on a baking rack set over a tray. Spoon the orange syrup over the cakes and allow the cakes to cool completely.",
        "To glaze, combine the confectioners' sugar and orange juice in a bowl, mixing with a wire whisk until smooth. Add a few more drops of juice, if necessary, to make it pour easily. Pour over the top of one cake and allow the glaze to dry. Wrap well, and store in the refrigerator."
    ],
    "ingredients": [
        "1/2 pound (2 sticks) unsalted butter, at room temperature",
        "2 1/2 cups granulated sugar, divided",
        "4 extra-large eggs, at room temperature",
        "1/3 cup grated orange zest (6 oranges)",
        "3 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon kosher salt",
        "3/4 cup freshly squeezed orange juice, divided",
        "3/4 cup buttermilk, at room temperature",
        "1 teaspoon pure vanilla extract",
        "1 cup confectioners' sugar, sifted",
        "1 1/2 tablespoons freshly squeezed orange juice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Breakfast Recipes",
        "Easy Baking",
        "Baking",
        "Cake",
        "Fruit",
        "Orange Recipes",
        "Sugar"
    ],
    "title": "Orange Pound Cake",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/orange-pound-cake-recipe"
}
