{
    "directions": [
        "Pour 2 quarts of water into a large soup pot and stir in orange juice and zest, kosher salt, sugar, black tea bags, bay leaves, cloves, peppercorns, and bourbon. Bring to a boil, reduce heat to low, and simmer for 10 minutes. Mix 4 quarts cold water into brine and let cool. Submerge turkey breast in brine, adding more water if needed to cover. Refrigerate 8 hours to overnight.",
        "Preheat oven to 350 degrees F (175 degrees C). Set oven rack to the lowest position in the oven.",
        "Remove turkey from marinade; discard marinade. Rinse turkey and pat dry with paper towels. Mix coriander seeds, paprika, cumin seeds, and garlic into softened butter in a bowl.",
        "Loosen the skin over turkey breast with your fingers and spread 1/4 cup of seasoned butter beneath the skin. Rub remaining 2 tablespoons seasoned butter over the turkey breast. Place turkey breast onto a roasting rack and set rack into a roasting pan.",
        "Roast in the preheated oven until skin is golden brown and an instant-read meat thermometer inserted into the thickest part of the breast reads 165 degrees F (75 degrees C), about 2 hours. Transfer to a cutting board and let turkey breast rest 30 minutes before slicing."
    ],
    "ingredients": [
        "Brine:",
        "2 quarts water",
        "5 oranges - juiced and zest cut off in large strips",
        "2 cups kosher salt",
        "1 cup white sugar",
        "12 black tea bags",
        "4 bay leaves",
        "6 whole cloves",
        "12 whole black peppercorns",
        "1 cup bourbon whiskey",
        "4 quarts cold water, or as needed",
        "1 (8 pound) whole turkey breast",
        "Seasoned Butter:",
        "2 tablespoons coriander seeds, crushed",
        "1 tablespoon paprika",
        "2 teaspoons cumin seeds, crushed",
        "6 cloves garlic, crushed and chopped",
        "6 tablespoons butter, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange, Tea, Bourbon-Brined Paprika Butter Turkey",
    "url": "http://allrecipes.com/recipe/229663/orange-tea-bourbon-brined-paprika-b/"
}
