{
    "directions": [
        "Stir sugar, star anise, cream of tartar, and 3 tablespoons water in a medium saucepan to blend. Bring to a boil over medium-high heat and cook, swirling occasionally (do not stir), until sugar is caramelized and the color of dark maple syrup, about 8 minutes. Remove from heat and carefully add 1/4 cup red wine (mixture will bubble vigorously), stirring to dissolve. Add remaining 1/4 cup red wine. Boil for 30 seconds, stirring to make sure all sugar is dissolved. Let cool completely. DO AHEAD: Red wine caramel can be made 1 week ahead. Cover and chill. Rewarm slightly to loosen before using.",
        "Using a sharp knife, remove all peel and white pith from oranges. Slice into 1/8\"-1/4\" rings.",
        "Layer 1-2 orange rings (cut slices in half if large) each in the bottom of small glass jars (clear jars or glasses show off the pretty layers, but you can also use bowls). Drizzle with 1 generous teaspoon red wine caramel; top with a spoonful of yogurt. Sprinkle nuts over. Repeat layering twice more, ending with nuts. Drizzle a bit more caramel over; garnish parfaits with mint leaves. DO AHEAD: Parfaits can be made 30 minutes ahead. Cover; chill."
    ],
    "ingredients": [
        "1 cup sugar",
        "3 whole star anise",
        "Pinch of cream of tartar",
        "1/2 cup dry, fruity red wine, such as Syrah, divided",
        "2 large oranges",
        "1 1/2 cups low-fat plain Greek yogurt",
        "1/2 cup toasted hazelnuts, almonds, or pistachios, coarsely chopped",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Dessert",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "High Fiber",
        "Low Sodium",
        "Orange",
        "Winter",
        "Low Cholesterol",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange and Yogurt Parfaits with Red Wine Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/orange-and-yogurt-parfaits-with-red-wine-caramel-51134030"
}
