{
    "directions": [
        "Whisk together flour, zest, cardamom, and salt.",
        "Beat butter and sugar with an electric mixer until pale and fluffy, then beat in yolk and cream. At low speed, mix in flour mixture in 3 batches just until a dough forms. Quarter dough and form each piece into a 6-inch disk, then chill, wrapped separately in plastic wrap, until firm, 2 to 3 hours.",
        "Preheat oven to 350°F with rack in middle.",
        "Roll out 1 piece of dough between sheets of parchment paper into an 11-inch round (1/8 inch thick). Slide dough in parchment onto a tray and chill until firm, about 15 minutes.",
        "Cut out as many cookies as possible with cookie cutter (chill dough again if necessary), reserving and chilling scraps. Transfer cookies to a parchment-lined large baking sheet, arranging them 1 inch apart.",
        "Bake until edges are golden-brown, 9 to 12 minutes. Cool on baking sheet 5 minutes, then slide cookies, still on parchment, onto a rack to cool completely.",
        "Make more cookies with remaining dough and scraps (reroll only once) on cooled freshly lined baking sheets.",
        "If icing cookies and coloring icing, transfer small batches to small bowls, 1 for each color, and tint with food coloring. Spoon each color of icing into separate sealable bags, pressing out excess air, and snip an 1/8-inch opening in 1 bottom corner of each bag. Pipe icing onto a plate to test consistency. If too thick, thin a small batch with a few drops of orange juice.",
        "Decoratively pipe icing onto cookies, then sprinkle with decorative sugar (if using) and let dry completely, about 1 hour (depending on humidity)."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 1/2 tablespoons grated orange zest",
        "1 1/2 teaspoons ground cardamom",
        "1 teaspoon salt",
        "2 sticks (1/2 pound) unsalted butter, softened",
        "3/4 cup sugar",
        "1 large egg yolk",
        "2 tablespoons heavy cream",
        "Equipment: a 3-inch round or 2 3/4-inch square cookie cutter",
        "Garnish: citrus icing (optional); food coloring (optional); decorative sugar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "New Year's Eve",
        "Orange",
        "Spice",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Cardamom Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/orange-cardamom-cookies-240927"
}
