{
    "directions": [
        "Place a rack in the upper third of the oven and preheat oven to 350 degrees F. Line a 9x9 cake pan with Reynolds Wrap(R) Aluminum Foil and grease and flour the foil. Set pan aside.",
        "In a medium bowl, whisk together flour, spices, baking soda and 1/2 teaspoon salt. Set aside.",
        "In a large bowl whisk together 3/4 cup plus 2 tablespoons vegetable oil, sugar and eggs until thick and pale. Stir in molasses, honey and orange zest.",
        "Add the dry ingredients, all at once, to the wet ingredients. Stir together until entirely incorporated. Add the warm water and gently stir until the mixture is silky smooth.",
        "Pour the batter into the prepared pan. Bake cake for 35-45 minutes or until a cake tester inserted into the center of the cake comes out clean.",
        "While the cake bakes, make the cream cheese frosting. In the bowl of an electric stand mixer fitted with a paddle attachment, blend the cream cheese on medium speed until smooth. Stop the mixer and add the softened butter. Scrape down the sides of the bowl. Beat over medium speed until smooth and incorporated. Add one cup of powdered sugar and blend until incorporated. Add vanilla extract (and the paste from inside the scraped bean, if using) and remaining cup of powdered sugar. Beat until frosting is smooth and silky.",
        "Allow cake to cool in the pan for 20 minutes. Remove from the pan and place on wire rack. Allow to cool completely before frosting the cake. Sprinkle with pomegranate seeds before serving. This cake can be stored, well wrapped in the refrigerator, for up to 3 days."
    ],
    "ingredients": [
        "Cake:",
        "2 1/4 cups all-purpose flour",
        "2 teaspoons ground ginger",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1 3/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "3/4 cup vegetable oil, plus",
        "2 tablespoons vegetable oil",
        "3/4 cup granulated sugar",
        "2 large eggs",
        "3/4 cup unsulfured molasses (not blackstrap)",
        "1/4 cup honey",
        "2 teaspoons grated orange zest",
        "3/4 cup warm water",
        "Reynolds Wrap® Aluminum Foil",
        "Frosting:",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup unsalted butter, at room temperature",
        "1 pinch salt",
        "2 cups powdered sugar, sifted",
        "2 teaspoons vanilla extract",
        "Pomegranate seeds for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange Gingerbread Cake with Cream Cheese Frosting",
    "url": "http://allrecipes.com/recipe/244898/orange-gingerbread-cake-with-cream-ch/"
}
