{
    "directions": [
        "Preheat oven to 175°F and line a baking sheet with parchment paper.",
        "Beat whites with cream of tartar and salt using an electric mixer at high speed until they just hold stiff peaks. Gradually add sugar, beating at high speed until whites hold stiff, glossy peaks.",
        "Spoon meringue into pastry bag and pipe 6 mounds (2 inches in diameter and 2 inches high) on baking sheet.",
        "Bake meringues in middle of oven until crisp but still white, about 2 hours.",
        "Turn off oven and let meringues cool in oven 1 hour, then transfer to a rack to cool completely.",
        "Melt chocolate in evaporated milk in a small heavy saucepan over very low heat, whisking until smooth, then cool. (If sauce seems too thick to pour, thin with water.)",
        "Stir together sour cream and zest in a small bowl.",
        "Just before serving, make a hole in base of each meringue with your finger and spoon in 1 tablespoon of orange cream. Put each meringue on a plate and spoon 1 tablespoon chocolate sauce over it."
    ],
    "ingredients": [
        "3 large egg whites",
        "1/4 teaspoon cream of tartar",
        "1/8 teaspoon salt",
        "1/2 cup plus 2 tablespoons sugar",
        "2 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "3 tablespoons canned low-fat evaporated milk",
        "6 tablespoons low-fat sour cream (30% reduced, not nonfat)",
        "1/2 teaspoon finely grated fresh orange zest",
        "Special equipment: parchment paper; a pastry bag fitted with a plain 1/2-inch tip"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Low Fat",
        "Fall",
        "Healthy",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Cream Meringues with Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/orange-cream-meringues-with-chocolate-sauce-105745"
}
