{
    "directions": [
        "In a small saucepan, combine maple syrup and rosemary. Bring to a boil, then reduce to a simmer, cover, and cook for 8 minutes. Remove saucepan from heat and keep covered until you're finished cooking the pancakes. When ready to serve, discard the rosemary and transfer rosemary syrup to a serving vessel.",
        "In a large bowl, combine the flour, poppy seeds, sunflower seeds, baking powder, baking soda, and salt. In a separate medium bowl, whisk together buttermilk, eggs, melted butter, sugar, orange zest, and orange juice. Add the wet ingredients to the dry ingredients, and stir until just combined. (Do not overmix; the batter will be slightly lumpy.)",
        "Heat a large skillet or griddle to medium and brush it with a bit of butter. Using a 1/4-cup scoop, drop batter onto skillet to form pancakes. Cook until bubbles start to form on the surface, 1 to 2 minutes. Flip and cook until lightly browned on the bottom, about 30 seconds more. Repeat with the remaining batter, brushing pan with butter as needed.",
        "Serve pancakes topped with butter and drizzle with the rosemary syrup."
    ],
    "ingredients": [
        "1 cup maple syrup",
        "3 rosemary sprigs",
        "2 cups spelt flour (or all-purpose flour)",
        "1/3 cup poppy seeds",
        "1/3 cup sunflower seeds",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 1/4 cups low-fat buttermilk",
        "2 large eggs",
        "2 tablespoons melted butter",
        "1 tablespoon granulated sugar",
        "1 1/2 tablespoons grated orange zest, plus 1/3 cup orange juice (from 1 large orange)",
        "Unsalted butter, at room temperature, for pan and serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Fry",
        "Kid-Friendly",
        "Quick & Easy",
        "Orange",
        "Rosemary",
        "Poppy",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Poppy Seed Pancakes with Rosemary Maple Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/orange-poppy-seed-pancakes-with-rosemary-maple-syrup-51264010"
}
