{
    "directions": [
        "Combine hartshorn and milk in a small bowl; set aside to dissolve at least 30 minutes and up to 1 hour.",
        "Beat eggs in the bowl of a stand mixer fitted with the paddle attachment on high speed until very pale and thick, 5 to 7 minutes. With mixer running, add 6 cups confectioners' sugar, 2 tablespoons at a time. Beat on high speed after all sugar has been added, 2 to 3 minutes. Reduce speed to medium. Add hartshorn and milk mixture, butter, orange extract, and salt; mix well to combine.",
        "Beat flour into the mixer gradually, 1/2 cup at a time, until dough is too stiff for the mixer. Stir in remaining flour by hand. Turn dough out onto work surface. Divide into 4 pieces, shape into discs, and wrap with plastic wrap. Chill until firm, 3 hours or longer.",
        "Place springerle mold or rolling pin in the freezer. Line baking sheets with a cotton or linen cloth.",
        "Dust work surface with 2 teaspoons confectioners' sugar. Roll one piece of dough into a circle 1/4-inch thick. Press the dough firmly into the springerle mold or rolling pin. Use a pastry cutter to cut extra dough away from the design. Transfer cookies to the baking sheets. Repeat with remaining pieces of dough. Use a delicate brush to brush off excess confectioners' sugar.",
        "Leave cookies out to air dry, uncovered, 12 hours or longer.",
        "Preheat oven to 275 degrees F (135 degrees C). Line baking sheets with parchment paper and spray lightly with cooking spray. Transfer cookies onto baking sheets, spacing them 1-inch apart.",
        "Bake cookies on the middle rack of the oven, one baking sheet at time, until slightly golden on the bottom but still pale on top, 18 to 20 minutes. Transfer to cooling racks to cool completely, about 30 minutes. Store cookies in an airtight container for a week before serving, allowing the flavors to age."
    ],
    "ingredients": [
        "1/2 teaspoon hartshorn (baker's ammonia)",
        "1 tablespoon milk",
        "6 eggs, at room temperature",
        "6 cups confectioners' sugar, sifted",
        "1/2 cup unsalted butter, softened",
        "2 tablespoons orange extract",
        "1/2 teaspoon salt",
        "7 1/2 cups cake flour (such as Swans Down®), sifted",
        "2 teaspoons confectioners' sugar, for dusting",
        "cooking spray"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange-Flavored Springerle Cookies",
    "url": "http://allrecipes.com/recipe/245528/orange-flavored-springerle-cookies/"
}
