{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 325°F. Lightly spray insides of 33 paper molds with nonstick spray; arrange molds on 2 large rimmed baking sheets.",
        "Sift flour, ground cardamom, baking powder, and salt into large bowl. Whisk eggs, orange peel, vanilla, and orange-flower water in bowl to blend. Using electric mixer, beat butter in another large bowl until fluffy. Gradually add sugar, beating until well blended. Beat in egg mixture in 3 additions. Beat in dry ingredients in 4 additions alternately with buttermilk, scraping bowl occasionally.",
        "Spoon 1/3 cup batter into each paper mold. Bake cupcakes until puffed and tester inserted into center comes out clean, reversing sheets after 12 minutes, about 25 minutes total (cupcakes may not brown on top). Transfer cupcakes to racks; cool completely.",
        "Frost orange cupcakes with vanilla frosting. (Can be made ahead. Arrange cupcakes in deep disposable roasting pans. Cover pans with foil. Refrigerate up to 2 days, or store at room temperature 1 day. Bring chilled cupcakes to room temperature before serving.)",
        "Decorate cupcakes with mini roses up to 4 hours before serving.",
        "*A flavoring extract sold at liquor stores and in the liquor section or specialty foods section of some supermarkets."
    ],
    "ingredients": [
        "33 2 1/2-inch-wide by 1 1/2-inch-high paper panettone molds",
        "Nonstick vegetable oil spray",
        "4 1/2 cups cake flour",
        "3 1/2 teaspoons ground cardamom",
        "2 1/4 teaspoons baking powder",
        "3/4 teaspoon salt",
        "9 large eggs",
        "1 1/2 tablespoons grated orange peel",
        "1 tablespoon vanilla extract",
        "2 teaspoons orange-flower water*",
        "2 1/4 cups (4 1/2 sticks) unsalted butter, room temperature",
        "3 3/4 cups sugar",
        "1 cup buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Orange",
        "Vanilla",
        "Summer"
    ],
    "title": "Orange-Cardamom Cupcakes with Vanilla Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/orange-cardamom-cupcakes-with-vanilla-frosting-109555"
}
