{
    "directions": [
        "Wrap foil around outside of 9-inch-diameter springform pan with 3-inch-high sides. Butter pan. Blend first 5 ingredients in processor until nuts are ground. Using on/off turns, blend in butter until crumbs are moist. Press onto bottom and 2 inches up sides of pan.",
        "Preheat oven to 500°F. Using electric mixer, blend first 5 ingredients in large bowl. Blend in eggs and yolks 1 at a time. Pour into crust.",
        "Bake cheesecake until slightly puffed and beginning to brown in spots, about 12 minutes. Reduce oven temperature to 200°F and continue baking until gently set in center (edges may crack), about 1 hour. Transfer to rack and cool 5 minutes. Run knife around pan sides to loosen. Cool completely. Cover and refrigerate overnight. Do ahead: Can be made 2 days ahead; keep refrigerated.",
        "Bring juice to boil in heavy large saucepan. Reduce heat; simmer until reduced to 1 cup, about 35 minutes. Mix in raspberries and sugar. Simmer until reduced to 3 cups, stirring frequently, about 20 minutes. Mix in honey; bring to simmer. Cool slightly. Cover; chill until cold. Do ahead Can be made 1 day ahead; keep refrigerated.",
        "Release pan sides. Cut cheesecake into wedges and transfer to plates. Spoon sauce over cheesecake; serve."
    ],
    "ingredients": [
        "1 3/4 cups graham cracker crumbs (about 12 whole graham crackers)",
        "1 1/4 cups walnuts (about 5 ounces)",
        "6 tablespoons sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cloves",
        "1/2 cup (1 stick) unsalted butter, melted",
        "5 (8-ounce) packages cream cheese, room temperature",
        "1 2/3 cups sugar",
        "3 tablespoons all purpose flour",
        "2 tablespoons grated orange peel",
        "2 teaspoons orange-flower water*",
        "5 large eggs",
        "2 large egg yolks",
        "4 cups pomegranate juice",
        "2 (12-ounce) bags frozen unsweetened raspberries (unthawed)",
        "1/4 cup sugar",
        "1/2 cup honey",
        "*A flavoring extract; available at some supermarkets, liquor stores, and Middle Eastern markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Raspberry",
        "Orange",
        "Chill",
        "Pomegranate",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Blossom Cheesecake with Raspberry and Pomegranate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/orange-blossom-cheesecake-with-raspberry-and-pomegranate-sauce-236212"
}
