{
    "directions": [
        "Blend flour, butter, sugar and salt in processor until mixture resembles coarse meal. Add yolk, 3 tablespoons ice water and orange peel. Process until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill 1 hour. (Can be made 2 days ahead. Keep refrigerated. Let soften slightly at room temperature before rolling out.)",
        "Position rack in bottom third of oven and preheat to 400°F. Roll out dough on lightly floured surface to 14-inch round. Transfer to 9-inch glass pie dish. Trim overhang to 3/4 inch; fold under and press into 1/2-inch-high standing rim. Using scissors, make diagonal cuts in dough rim at 1/2-inch intervals; press cut rim pieces alternately in and out. Pierce crust (not dough rim) all over with fork. Freeze crust 30 minutes.",
        "Line crust with foil; fill with dried beans or pie weights. Bake until crust edge is dry and set, about 12 minutes. Remove foil and beans. Bake crust until lightly colored, pressing with back of fork if crust bubbles, about 8 minutes. Transfer crust to rack and cool completely. Reduce oven temperature to 325°F.",
        "Whisk first 10 ingredients in large bowl until well blended. Pour into prepared crust.",
        "Gently cover crust edge with foil to prevent over-browning. Bake until filling puffs and begins to split at edges and is just set in center, about 1 hour 5 minutes. Cool pie on rack. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Top pie with whipped cream and orange peel strips, if desired. Serve cold or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons sugar",
        "1/2 teaspoon salt",
        "1 large egg yolk",
        "3 tablespoons (or more) ice water",
        "1 1/2 teaspoons grated orange peel",
        "1 15-ounce can solid pack pumpkin",
        "3 large eggs",
        "3/4 cup (packed) golden brown sugar",
        "3/4 cup whipping cream",
        "1/4 cup frozen orange juice concentrate, thawed",
        "1/4 cup crème fraîche or sour cream",
        "2 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon cornstarch",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "Lightly sweetened whipped cream",
        "Fine strips of orange peel (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Orange",
        "Pumpkin",
        "Fall",
        "Cinnamon",
        "Sour Cream"
    ],
    "title": "Orange and Spice Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/orange-and-spice-pumpkin-pie-100324"
}
