{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Mix the cookie crumbs, 1/2 cup sugar, and melted butter together in a bowl. Press mixture evenly into the bottom of 9 inch springform pan.",
        "Melt 1/2 cup chocolate chips in a pan over low heat while stirring constantly. Set aside.",
        "Beat the cream cheese, sugar, and cornstarch together in a mixing bowl until smooth. Slowly beat in the eggs and egg yolk, one at a time, until thoroughly blended. Stir in the orange juice concentrate, orange extract, orange zest, orange food coloring, if desired, and vanilla. Reserve 1 cup of the cream cheese mixture and set aside. Pour the remaining mixture over the prepared crust. Stir the melted chocolate chips into the reserved 1 cup cream cheese mixture. Pour the chocolate mixture into the orange filling, and swirl with a knife.",
        "Bake in preheated oven for 15 minutes. Lower heat to 225 degrees F (105 degrees C), and bake until center springs bake when touched, 75 to 85 minutes. Turn the oven off, and open the oven door; allow cheesecake to cool in the oven at least 30 minutes. Remove from the oven and refrigerate, uncovered, for at least 8 hours, or overnight.",
        "Remove the cheesecake from the springform pan by running a knife around the inside edge. Release the side of the pan and lift off. Run a knife under the bottom of the cheesecake and carefully slide onto a serving plate.",
        "To make the pecan-chocolate topping, melt 1/4 cup chocolate chips in a pan over low heat while stirring constantly. Remove from heat, and stir in the corn syrup and sour cream until smooth and evenly blended. Drizzle over the top of the cheesecake. Garnish with pecans.",
        "To make the orange topping, stir the cornstarch and water together in a small dish to make a smooth syrup. Place the sugar and orange juice in a pan, and bring to a boil over medium-high heat. Reduce heat to medium, and stir in the cornstarch mixture; cook until thick and clear. Cool slightly, and drizzle over the top of the cheesecake."
    ],
    "ingredients": [
        "1 1/2 cups chocolate wafer cookies, crushed",
        "1/2 cup white sugar",
        "1/4 cup butter, melted",
        "1/2 cup semi-sweet chocolate chips",
        "3 (8 ounce) packages cream cheese, softened",
        "3/4 cup white sugar",
        "1/3 cup cornstarch",
        "3 eggs, room temperature",
        "1 egg yolk, room temperature",
        "1/2 cup frozen (thawed) orange juice concentrate",
        "1/2 teaspoon orange extract",
        "1 teaspoon orange zest",
        "1 drop orange food coloring (optional)",
        "1 teaspoon vanilla extract",
        "1/4 cup semi-sweet chocolate chips",
        "1 tablespoon light corn syrup",
        "1 tablespoon sour cream",
        "1/2 cup pecans, for garnish",
        "1 teaspoon cornstarch",
        "2 teaspoons water, or as needed",
        "2 tablespoons white sugar",
        "2 tablespoons orange juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange-Chocolate Twist Cheesecake",
    "url": "http://allrecipes.com/recipe/148882/orange-chocolate-twist-cheesecake/"
}
