{
    "directions": [
        "In a bowl with a potato masher mash 2 cups blackberries with 1/3 cup granulated sugar and stir in remaining blackberries. In 2 more bowls mash separately raspberries and blueberries with remaining granulated sugar in same manner. Let berries stand at room temperature 4 hours. Berry mixtures may be made 1 day ahead and chilled, covered. Bring berries to room temperature before serving.",
        "Preheat oven to 425°F. and lightly butter 2 baking sheets. In a large bowl whisk together flour, granulated sugar, baking powder, baking soda, and salt and blend in butter until mixture resembles coarse meal. In a small bowl whisk together zest, sour cream, and milk and add to flour mixture. Stir mixture until it just forms a soft and sticky dough and drop into 12 mounds at 1-inch intervals onto prepared baking sheets. Pat dough to 1/2-inch thickness and bake 12 to 15 minutes, or until pale golden. Transfer shortcakes to a rack and cool. Shortcakes may be made 4 hours ahead and kept in airtight containers.",
        "In a large bowl beat cream with confectioners' sugar until it holds soft peaks. Whipped cream may be made 1 hour ahead and chilled in a cheesecloth-lined large sieve set over a bowl, its surface covered with plastic wrap. Whisk cream lightly before serving.",
        "Split shortcakes horizontally with a fork and serve with berries and whipped cream."
    ],
    "ingredients": [
        "6 cups blackberries, picked over",
        "1 cup granulated sugar",
        "6 cups raspberries, picked over",
        "6 cups blueberries, picked over",
        "3 cups all-purpose flour",
        "1/3 cup granulated sugar",
        "1 tablespoon baking powder",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into bits",
        "1 1/2 teaspoons freshly grated orange zest",
        "1 cup sour cream",
        "1 cup milk",
        "2 cups well-chilled heavy cream",
        "1/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Citrus",
        "Dairy",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange and Sour-Cream Drop Shortcakes with Assorted Berries",
    "url": "http://www.epicurious.com/recipes/food/views/orange-and-sour-cream-drop-shortcakes-with-assorted-berries-12254"
}
