{
    "directions": [
        "Cut the zest of 2 of the oranges into long, very thin shreds with a knife, in a saucepan of boiling water blanch it for 1 minute, and drain it. In a small heavy saucepan boil the water and the Grand Marnier with the blanched zest and 1 cup of the sugar, stirring and washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water, for 5 minutes. Transfer the candied zest with a slotted spoon to a plate lined with wax paper and let it stand, uncovered, for 2 hours, or until it is dry. Cook the syrup over moderate heat, undisturbed, until it is a deep caramel and divide the caramel among eight 3/4-cup ramekins, coating the bottoms evenly. The candied zest and the caramel may be made and the ramekins coated 1 day in advance and the caramel and the candied zest kept separately, covered, at room temperature.",
        "In a saucepan simmer the milk with the remaining 1 cup sugar and the remaining zest for 5 minutes. In a bowl whisk together gently the egg yolks, the whole eggs, the orange-flower water, and the salt until the mixture is just combined. Discard the zest and add the milk mixture to the eggs mixture in a stream, stirring. Strain the custard through fine sieve into a large measuring cup or heatproof pitcher and divide it evenly among the ramekins. Put the ramekins in a baking pan, add enough hot water to the pan to reach halfway up the sides of the ramekins, and bake the flans, covered with a baking sheet, in the middle of a preheated 325°F. oven for 1 hour to 1 hour and 10 minutes, or until they are just set but still tremble slightly. (The flans will continue to set as they cool.) Remove the ramekins from the pan, let the flans cool, uncovered, to room temperature, and chill them, covered, for 2 hours. The flans may be prepared up to this point 1 day in advance and kept covered and chilled. Run a thin knife around the edge of each flan, invert a dessert plate over each ramekin, and invert the flans onto the plates.",
        "Garnish the flans with the candied zest and the orange sections."
    ],
    "ingredients": [
        "the zest of 5 navel oranges, removed in strips with a vegetable peeler",
        "1/2 cup water",
        "1/2 cup Grand Marnier",
        "2 cups sugar",
        "4 cups milk",
        "8 large egg yolks",
        "4 large whole eggs",
        "1 teaspoon orange-flower water (available at specialty foods shops and some supermarkets) or 1 teaspoon vanilla if desired",
        "1/2 teaspoon salt",
        "orange sections, the rind and pith cut away with a serrated knife, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Orange",
        "Winter",
        "Gourmet"
    ],
    "title": "Orange Flans with Candied Zest",
    "url": "http://www.epicurious.com/recipes/food/views/orange-flans-with-candied-zest-11304"
}
