{
    "directions": [
        "1. Prepare the sauce. Combine all the ingredients in a medium-size bowl and set aside.",
        "2. Prepare the chicken. Rinse the chicken under cold running water and pat dry with paper towels. Place on a plate.",
        "3. Combine the salt, pepper, garlic powder, allspice, and paprika in a small bowl. Rub the spices into the chicken skin.",
        "4. Heat the olive oil in a large pot over medium-high heat. When the oil is very hot, add the chicken pieces and brown, cooking for 2 to 3 minutes on each side. Pour the sauce over the chicken and simmer, covered, over medium heat until the chicken is cooked through and very moist, 30 to 45 minutes.",
        "5. Serve the chicken pieces over rice, with the sauce spooned on top."
    ],
    "ingredients": [
        "1 1/2 cups coarsely chopped yellow onions",
        "2 cups peeled and cubed white potatoes (any kind)",
        "1/4 cup golden raisins",
        "1/2 cup whole Black Mission figs or the larger, amber-colored Calimyrna figs, cut into halves",
        "1 1/2 cups fresh orange juice, strained",
        "4 1/2 teaspoons Worcestershire sauce, (preferably Lea & Perrins, or another brand that lists tamarind as an ingredient",
        "1/2 teaspoon curry powder",
        "1/2 tablespoon soy sauce",
        "3 pounds chicken pieces (white and dark meat)",
        "1 teaspoon salt",
        "Several grindings of black pepper",
        "1 teaspoon garlic powder",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon paprika",
        "4 1/2 teaspoons olive oil",
        "1 recipe Basic Syrian Rice (recipe can be found in book)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Marinate",
        "Orange",
        "Raisin",
        "Fig"
    ],
    "title": "Orange Chicken with Golden Raisins and Figs",
    "url": "http://www.epicurious.com/recipes/food/views/orange-chicken-with-golden-raisins-and-figs-106260"
}
