{
    "directions": [
        "Finely grate enough orange zest to measure 1 teaspoon. Cut remaining peel and white pith from oranges with a sharp knife, then discard. Cut segments free from membranes, letting them drop into a bowl, then squeeze enough juice from membranes to measure 3 tablespoons, adding it to segments. Add liqueur and 2 tablespoons sugar and toss with segments. Let macerate 20 minutes.",
        "While orange segments macerate, cook tapioca, milk, grated zest, 1/3 cup sugar, and 1/8 teaspoon salt in a heavy medium saucepan over medium heat, stirring, until sugar has dissolved. Bring to a boil, stirring occasionally, then reduce heat to medium-low and gently simmer, stirring constantly, until thickened, about 10 minutes. Drain orange segments in a sieve over saucepan to add liquid to tapioca (reserve segments), then gently simmer, stirring constantly, until tapioca pearls are completely translucent, 20 to 30 minutes.",
        "Whisk together egg yolks in a metal bowl, then gradually whisk hot pudding into yolks. Quick-chill by setting bowl in an ice bath and stirring occasionally until cool (pudding will be very thick).",
        "Beat egg whites with a pinch of salt using an electric mixer until they just hold soft peaks. Add remaining tablespoon sugar and beat whites until they just hold stiff peaks.",
        "Beat cream in another bowl with cleaned beaters until it just holds stiff peaks. Fold whites, then cream, into pudding gently but thoroughly.",
        "Divide orange segments among 6 glasses, ramekins, or small bowls and top with pudding. Chill, covered, at least 1 hour."
    ],
    "ingredients": [
        "2 navel oranges",
        "2 tablespoons orange liqueur such as Grand Marnier or Cointreau",
        "1/3 cup plus 3 tablespoons sugar, divided",
        "1/3 cup tapioca pearls (preferably 1/8 inch; not quick-cooking)",
        "3 cups whole milk",
        "2 large eggs, separated",
        "1/2 cup chilled heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Mixer",
        "Fruit",
        "Dessert",
        "Vegetarian",
        "Orange",
        "Chill",
        "Tapioca",
        "Simmer",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Tapioca Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/orange-tapioca-pudding-241518"
}
