{
    "directions": [
        "Combine sugar and 1/3 cup water in heavy medium saucepan. Stir over medium-low heat until sugar dissolves. Increase heat to medium-high; boil without stirring until syrup is deep amber, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 5 minutes. Remove from heat. Carefully add cream (mixture will bubble vigorously). Place pan over low heat; stir until caramel bits dissolve and sauce is smooth. Remove from heat; add butter, cardamom, and pinch of salt. Stir until butter melts. Cool.DO AHEAD: Can be made 1 week ahead. Cover; chill. Bring to room temperature or rewarm over low heat before using.",
        "Preheat oven to 350°F. Sift powdered sugar, flour, and salt 3 times. Place in medium bowl.",
        "Using electric mixer, beat egg whites in large bowl until foamy. Add cream of tartar; beat until whites are opaque and soft peaks form. Gradually add superfine sugar, beating until whites are thick and shiny and fluffy peaks form (peaks should droop over gently; do not overbeat). Add orange peel and vanilla; beat just until blended. Sift 1/4 of flour mixture over whites. Using large rubber spatula, gently fold flour mixture into whites. Repeat with remaining flour mixture in 3 more additions. Transfer batter to ungreased 10-inch-diameter angel food cake pan with removable bottom and 4-inch-high sides (do not use nonstick pan); smooth top.",
        "Bake cake until golden and springy to touch, about 50 minutes. Immediately invert pan onto work surface if pan has feet, or invert center tube of pan onto neck of bottle or funnel. Cool cake completely.",
        "Gently tap bottom edge of pan on work surface while rotating pan until cake loosens. Transfer to platter. DO AHEAD: Can be made 8 hours ahead. Cover with cake dome; let stand at room temperature.",
        "Cut all peel and white pith from oranges. Using small sharp knife and working over bowl to catch juices, cut between membranes to release orange segments into bowl. Squeeze remaining juice from membranes into bowl. If orange segments are large, cut each in half or thirds. Cut passion fruits in half; scoop out pulp and add to orange segments. Add remaining fruits, sugar, mint, and pinch of salt. Toss gently to combine. DO HEAD: an be made 2 hours ahead. Cover and chill.",
        "Slice cake; transfer to plates. Spoon compote alongside; top with caramel."
    ],
    "ingredients": [
        "1 cup sugar",
        "1/3 cup water",
        "1 cup heavy whipping cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "3/4 teaspoon ground cardamom",
        "Pinch of salt",
        "1 1/4 cups powdered sugar",
        "1 cup cake flour",
        "1/4 teaspoon salt",
        "1 1/3 cups egg whites (about 9 large)",
        "1 1/2 teaspoons cream of tartar",
        "1 cup superfine sugar",
        "1 tablespoon finely grated orange peel",
        "1 1/2 teaspoons vanilla extract",
        "2 blood oranges",
        "3 ripe passion fruits",
        "1 kiwi, peeled, quartered lengthwise, then cut crosswise into 1/2-inch slices",
        "1 cup 1/2-inch cubes mango",
        "1/2 cup 1/2-inch cubes pineapple",
        "1 to 2 tablespoons sugar",
        "1 tablespoon chopped fresh mint",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "High Fiber",
        "Wedding",
        "Orange",
        "Tropical Fruit",
        "Kiwi",
        "Mango",
        "Spring",
        "Passion Fruit",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Angel Food Cake with Caramel Sauce and Tropical-Fruit Compote",
    "url": "http://www.epicurious.com/recipes/food/views/orange-angel-food-cake-with-caramel-sauce-and-tropical-fruit-compote-352097"
}
