{
    "directions": [
        "Finely grate zest from oranges, then squeeze enough juice to measure 1 cup.",
        "Pour juice through a fine sieve into a 2-quart heavy saucepan, discarding pulp, and stir in 1 cup sugar. Bring to a boil over moderately high heat, stirring until sugar is dissolved. Boil, without stirring but washing down any sugar crystals with a brush dipped in cold water and skimming froth as necessary, until syrup begins to turn golden, about 5 minutes. Continue to boil, swirling pan occasionally, until syrup is a deep golden caramel. Immediately divide caramel among ramekins, tilting if necessary to coat bottoms.",
        "Preheat oven to 325°F and line bottom of a small roasting pan with a folded kitchen towel.",
        "Bring milk and zest just to a simmer over moderate heat, then remove from heat and let stand, covered, 10 minutes.",
        "Whisk together whole eggs, yolks, and remaining 3/4 cup sugar in a large bowl, then whisk in warm milk. Pour custard through fine sieve into a bowl, pressing on and discarding solids. Divide custard among ramekins and arrange ramekins in roasting pan.",
        "Carefully add enough hot water to pan to reach halfway up sides of ramekins. Bake in middle of oven until custard is just set (but still trembles slightly in center), 50 minutes to 1 hour. Run a thin knife around side of each ramekin to loosen, then transfer ramekins to a rack and cool. Chill, loosely covered, at least 2 hours.",
        "To unmold, invert plates over ramekins and invert custards onto plates."
    ],
    "ingredients": [
        "3 large navel oranges",
        "1 3/4 cups sugar",
        "3 cups whole milk",
        "3 whole large eggs and 3 large egg yolks",
        "Special equipment: 6 (6-oz) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Winter",
        "Anniversary",
        "Chill",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Orange Crème Caramels",
    "url": "http://www.epicurious.com/recipes/food/views/orange-creme-caramels-106086"
}
