{
    "directions": [
        "Using vegetable peeler, remove rind from oranges in strips. Cut rind into matchstick-size strips. Place strips in small saucepan; cover with water. Bring to boil. Drain; rinse with cold water. Drain. Combine 2/3 cup water, sugar, and vinegar in medium saucepan. Bring to simmer, stirring to dissolve sugar. Add orange strips; simmer until translucent, about 10 minutes. Drain. Cool on sheet of foil. (Can be made 1 week ahead. Cover and refrigerate.)",
        "Preheat oven to 375°F. Butter 15x10x1-inch jelly-roll pan. Line bottom of pan with parchment paper; butter parchment. Whisk first 6 ingredients in medium bowl to blend.",
        "Heat milk in medium saucepan over medium heat to 150°F. Using electric mixer, beat sugar and eggs in large bowl until fluffy, about 4 minutes. Beat in vanilla and grated orange peel. Beat in flour mixture until just blended. Gradually beat in warm milk. Pour batter into pan.",
        "Bake cake until tester inserted into center comes out clean, about 10 minutes. Spread kitchen towel on work surface; cover with parchment. Sprinkle parchment lightly with powdered sugar. Run knife around edge of pan to loosen cake. Invert hot cake onto parchment. Peel parchment off top of cake. Starting at 1 long side and using towel as aid, gently roll up cake jelly-roll style. Cool.",
        "Using electric mixer, beat first 5 ingredients in large bowl until smooth. Gradually add powdered sugar, beating until smooth. Cover and chill until firm but spreadable, about 45 minutes.",
        "Unroll cake; remove second sheet of parchment. Spread scant 2 cups frosting over cake; starting at 1 long side, roll up jelly-roll style. Place cake, seam side down, on platter. Starting 1 inch in from end of cake, turn knife on sharp diagonal and cut to remove one 3-inch-long triangular piece of cake. Spread 1 tablespoon frosting on cut side of cake piece. Attach frosted side of cake piece to side of cake near end. Spread remaining frosting over top and sides of cake and cake piece. Using tines of fork, draw circles on cake ends to resemble tree rings. Draw fork along length of cake to form bark design. Cover and chill overnight. (Can be made 1 day ahead. Keep chilled. Let stand 2 hours at room temperature before continuing.) Sprinkle log with glazed orange peel strips."
    ],
    "ingredients": [
        "2 oranges",
        "2/3 cup water",
        "1/2 cup sugar",
        "1 tablespoon apple cider vinegar",
        "1 cup cake flour",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground cloves",
        "1/8 teaspoon salt",
        "1/2 cup whole milk",
        "1 cup sugar",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "1 teaspoon grated orange peel",
        "Powdered sugar",
        "1 8-ounce package cream cheese, room temperature",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1/4 cup fresh orange juice",
        "1 tablespoon grated orange peel",
        "2 teaspoons vanilla extract",
        "4 cups powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Dairy",
        "Dessert",
        "Bake",
        "Christmas",
        "Vinegar",
        "Cream Cheese",
        "Orange",
        "Spice",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange-Spice Bûche de Noël with Orange Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/orange-spice-buche-de-noel-with-orange-cream-cheese-frosting-107515"
}
