{
    "directions": [
        "In a double boiler or metal bowl set over a saucepan of barely simmering water combine chocolate and cream, stirring frequently until melted and smooth. Remove double boiler or bowl from heat and cool mixture. Chill filling 1 hour. Filling may be prepared up to this point 1 day ahead and chilled, covered.",
        "Preheat oven to 325° F. Line a buttered 8-inch round cake pan with wax paper and butter paper. Dust pan with flour, knocking out excess flour.",
        "On a baking sheet bake bread in oven until dry, about 5 minutes, and cool bread. In a food processor grind bread fine.",
        "In a double boiler or metal bowl set over a saucepan of barely simmering water melt chocolate and 1/2 stick butter, stirring occasionally until smooth, and remove double boiler or bowl from heat. In a bowl whisk together bread crumbs, ground almonds, and cocoa powder.",
        "In a large bowl with an electric mixer beat together remaining 1/2 stick butter and 1/3 cup sugar until light and fluffy. Beat in yolks, 1 at a time, beating well after each addition. Beat in chocolate mixture, zest, and bread crumb mixture until batter is smooth.",
        "In another large bowl with cleaned beaters beat whites on low speed until frothy. Increase speed to medium and beat until they just hold soft peaks. Gradually add remaining 1/3 cup sugar and beat on high speed until stiff and glossy. Stir one fourth meringue into batter to lighten and fold in remaining meringue gently but thoroughly. Pour batter into pan, smoothing top, and bake in middle of oven 45 to 50 minutes, or until a tester comes out clean. Cool cake in pan on a rack 5 minutes and invert cake onto rack to cool completely.",
        "In cleaned bowl with cleaned beaters beat filling until light and creamy, about 2 minutes.",
        "In a double boiler or metal bowl set over a saucepan of barely simmering water combine glaze ingredients, stirring until smooth.",
        "Cut cake in half horizontally. On a cake plate spread filling between layers. Spread glaze over cake. Chill cake at least 1 hour and up to 4 before serving."
    ],
    "ingredients": [
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "3/4 cup well-chilled heavy cream",
        "2 slices homemade-type whole-wheat bread",
        "3 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1 stick (1/2 cup) unsalted butter, softened",
        "3/4 cup blanched whole almonds, toasted, cooled completely, and ground fine",
        "1/4 cup unsweetened cocoa powder (Dutch-process)",
        "2/3 cup sugar",
        "4 large eggs, separated",
        "1 tablespoon freshly grated orange zest",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1/3 cup well-chilled heavy cream",
        "1/2 teaspoon brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Chill",
        "Gourmet",
        "California"
    ],
    "title": "Orange-Scented Chocolate Almond Cake Kirkgaard",
    "url": "http://www.epicurious.com/recipes/food/views/orange-scented-chocolate-almond-cake-kirkgaard-13256"
}
