{
    "directions": [
        "Line 12x18x1-inch baking sheet with heavy-duty foil. Whisk eggs, juice and orange peel in large bowl. Mix flour, baking powder, salt, ginger and cinnamon in processor. Add butter and cut in using on/off turns until mixture forms coarse meal. Add sugar and just blend in. Add nuts and chop coarsely using 6 on/off turns. Add nut mixture to egg mixture. Stir until moist dough forms. Mix in 6 ounces chocolate. Drop half of dough by heaping tablespoons in line down length of left half of prepared baking sheet. Repeat with remaining dough down right half of sheet. Chill until dough is firm, about 30 minutes.",
        "Position rack in center of oven and preheat to 375°F. Using moistened fingertips, shape dough into 2-inch-wide 1-inch-high logs. Bake until logs are golden brown and beginning to crack on top, about 25 minutes (each log will spread to about 4-inch width). Reduce oven temperature to 300°F.",
        "Cool logs in pan on rack 10 minutes. Pull foil with logs onto work surface. Score logs crosswise into 3/4-inch-wide slices. Cool until cookies begin to firm, about 15 minutes. Using serrated knife, cut through scored lines. Arrange cookies cut side up on 2 heavy cookie sheets. Bake 15 minutes. Turn cookies over. Bake until crisp, about 15 minutes. Cool on sheets on racks. (Can be made 1 day ahead. Store airtight.)",
        "Line large cookie sheet with heavy-duty foil. Stir 14 ounces chocolate in top of double boiler over barely simmering water until melted. Dip 1 long side of each cookie into chocolate and set chocolate side down on prepared sheet. Chill until chocolate is set. Peel cookies off foil. (Can be made 1 week ahead. Cover and chill in airtight container.) Serve cold."
    ],
    "ingredients": [
        "2 large eggs",
        "1/4 cup frozen orange juice concentrate, thawed",
        "2 1/2 tablespoons grated orange peel",
        "2 cups all purpose flour",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup (1 stick) chilled unsalted butter or margarine, cut into small pieces",
        "1 1/3 cups sugar",
        "1 3/4 cups hazelnuts, toasted, husked",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "14 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Citrus",
        "Nut",
        "Dessert",
        "Bake",
        "Orange",
        "Winter",
        "Chill",
        "Kosher",
        "Edible Gift",
        "Hazelnut",
        "Kidney Friendly"
    ],
    "title": "Orange, Chocolate and Hazelnut Mandelbrot",
    "url": "http://www.epicurious.com/recipes/food/views/orange-chocolate-and-hazelnut-mandelbrot-2792"
}
