{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).  Divide the pie pastry in half, roll out half to a round pie crust about 12 inches in diameter, and place the pie crust in the bottom of a 10-inch pie dish. Refrigerate the other half of the pie pastry until needed.",
        "Stir the 1 1/2 cups of sugar, the salt, orange peel, tapioca, and nutmeg together in a bowl until well blended. Gently stir in the rhubarb, strawberries, and orange juice, taking care not to crush the strawberries; pour into the prepared pie crust. Dot the filling with butter pieces. Roll the reserved pie pastry out to about a 12-inch circle and place the top crust over the fruit filling.",
        "Fold the edges of the top and bottom crust together to seal the two crusts together. Form a rounded indentation in the edge of the pie crust by placing your left index finger against the outer edge of the crust, and pinching the crust against it with the index finger and thumb of your right hand. Move around the edge of the pie, pinching the crust edge against your left index finger to make a fluted crust.  Brush milk over the top crust of the pie and sprinkle with 1 tablespoon of sugar. Cut several vent holes in the top crust.",
        "Bake in the preheated oven until the filling is thickened and bubbling and the crust has browned, 40 to 50 minutes. Check after 30 minutes of baking time; if the crust edges are browning too quickly, cover them with strips of aluminum foil. Cool the pie before serving."
    ],
    "ingredients": [
        "1 pastry for a 10-inch double crust pie",
        "1 1/2 cups white sugar",
        "1/4 teaspoon salt",
        "1/2 teaspoon grated orange peel",
        "1/4 cup quick-cooking tapioca",
        "1/4 teaspoon ground nutmeg",
        "4 cups rhubarb, cut into 1/2 inch pieces",
        "2 cups fresh strawberries, quartered",
        "1/4 cup fresh orange juice",
        "2 tablespoons butter, cut into small chunks",
        "1 tablespoon milk",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Orange-Kissed Strawberry Rhubarb Pie",
    "url": "http://allrecipes.com/recipe/214116/orange-kissed-strawberry-rhubarb-pie/"
}
