{
    "directions": [
        "Preheat oven to 425°F.",
        "Unfold pastry sheet on a lightly floured surface and roll out pastry with a floured rolling pin into a 12-inch square. Brush off excess flour from top and bottom of square and from work surface. Trim a 3/4-inch-wide strip from all sides of square and reserve. Put pastry square on a baking sheet and prick all over with a fork. Brush pastry square with some of egg and arrange 1 strip on each edge of pastry square, overlapping strips at corners, to form a raised edge around pastry, and trim overhang. Brush strips with some of egg, then sprinkle pastry evenly with granulated sugar. Bake in middle of oven until golden brown, 15 to 17 minutes. Carefully slide pastry from baking sheet to a rack to cool, then gently flatten inner part of pastry with your palm if very puffed.",
        "Squeeze 2 tablespoons juice from 1 orange.",
        "Cut peel, including all white pith, from remaining 10 oranges with a sharp paring knife and cut each orange crosswise into 1/4-inch-thick slices. Arrange slices in 1 layer between paper towels to drain briefly.",
        "Whisk together cream cheese, confectioners sugar, vanilla, salt, and orange juice and spread evenly over center of pastry, spreading it to raised edges.",
        "Arrange oranges, overlapping, on pastry and sprinkle with pistachios."
    ],
    "ingredients": [
        "1 frozen puff pastry sheet (from a 17 1/4-oz package), thawed but kept chilled",
        "1 large egg, lightly beaten",
        "2 tablespoons granulated sugar",
        "11 navel oranges",
        "8 oz cream cheese, softened",
        "1/4 cup confectioners sugar",
        "1/2 teaspoon vanilla",
        "1/8 teaspoon salt",
        "2 tablespoons shelled salted roasted pistachios (not dyed red), chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Cream Cheese",
        "Orange",
        "Pistachio",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Tart with Orange Cream and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/orange-tart-with-orange-cream-and-pistachios-107385"
}
