{
    "directions": [
        "Preheat oven to 375°F. Butter 8-inch-diameter springform pan. Line bottom of pan with parchment. Butter parchment; dust with flour. Beat 1/2 cup butter in large bowl until fluffy. Gradually add sugar, beating until blended. Add egg, then yolks, 1 at a time, beating well after each addition. At low speed, beat in almonds, flour, orange juice, peel, coriander and salt, scraping down sides of bowl occasionally.",
        "Using clean dry beaters, beat whites in medium bowl until stiff but not dry. Fold whites into batter in 2 additions. Transfer to prepared pan.",
        "Bake cake until top is golden and tester inserted into center comes out clean, about 40 minutes. Cool cake in pan on rack.(Can be made 1 day ahead. Cover and let stand at room temperature.)",
        "Beat whipping cream and 2 tablespoons sugar in medium bowl until soft peaks form. Mix in Marsala.",
        "Dust cake with powdered sugar. Cut cake into wedges and serve with Orange Sauce and Marsala cream.",
        "Whisk juice and cornstarch in bowl until cornstarch dissolves. Melt butter in heavy small saucepan over medium-high heat. Whisk in sugar, orange peel and orange juice mixture. Whisk until sauce boils and thickens slightly, about 4 minutes. Remove from heat and cool. (Can be made 2 days ahead. Cover and chill. Bring to room temperature before serving.)",
        "Orange sauce makes about 1 1/4 cups."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3/4 cup sugar",
        "1 large egg",
        "2 large egg yolks",
        "1 cup almonds, toasted, finely ground",
        "1/2 cup all purpose flour",
        "2 tablespoons orange juice",
        "1/2 teaspoon ground coriander",
        "Pinch of salt",
        "2 large egg whites",
        "1 cup chilled whipping cream",
        "2 tablespoons powdered sugar",
        "2 tablespoons sweet Marsala",
        "Additional powdered sugar",
        "1 cup fresh orange juice",
        "1 1/2 tablespoons cornstarch",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/4 cup sugar",
        "1 tablespoon grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Nut",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Winter"
    ],
    "title": "Orange Almond Torte with Orange Sauce and Marsala Cream",
    "url": "http://www.epicurious.com/recipes/food/views/orange-almond-torte-with-orange-sauce-and-marsala-cream-541"
}
