{
    "directions": [
        "With a sharp knife halve the whole duck breasts and score the skin in a 1/4-inch cross-hatch pattern. Put the duck in a large resealable bag. In a bowl whisk together the zest, the orange juice, the soy sauce, the oil, the honey, the vinegar, the red pepper flakes, and the salt, pour the marinade over the duck, and seal the bag. Let the duck marinate, chilled, turning the bag occasionally, for 8 hours or overnight.",
        "Remove the duck from the marinade, reserving the marinade, pat it dry between paper towels, and season it with salt and pepper. Heat 2 heavy skillets over moderately high heat until they are hot and in each skillet cook 2 duck breast halves, skin sides down, for 5 minutes. Pour off the fat, reduce the heat to moderate, and cook the duck, skin sides down, for 20 minutes more, adjusting the heat if necessary for the skin to turn dark brown but not burn. Pour off the fat, turn the duck breasts, and cook them, covered, over moderate heat for 8 to 10 minutes more, or until a meat thermometer registers 145°F. to 150°F. for medium meat.",
        "While the duck is cooking in a kettle sauté the garlic in the butter over moderately high heat, stirring, until it begins to turn golden, add the chicory with the water clinging to the leaves, and braise it, covered, stirring occasionally, for 8 to 10 minutes, or until it is just tender. Season the chicory with salt and pepper and keep it warm.",
        "Transfer the duck to a cutting board and let it stand for 5 minutes. To one of the skillets add the water, deglaze the skillet over moderate heat, scraping up the brown bits, and add the deglazing liquid to the other skillet with the reserved marinade. Bring the liquid to a boil and deglaze the second skillet, scraping up the brown bits. Add any juices that have accumulated on the cutting board and simmer the sauce for 2 minutes, or until it is thickened slightly. Strain the sauce through a fine sieve into a small bowl. Cut the duck across the grain into thin slices, divide the chicory among 8 plates, and arrange the duck on it. Drizzle some sauce around each serving."
    ],
    "ingredients": [
        "two 2-pound whole boneless duck breasts with skin*",
        "1 teaspoon freshly grated orange zest",
        "1/2 cup fresh orange juice",
        "1/4 cup soy sauce",
        "1/4 cup vegetable oil",
        "2 tablespoons honey",
        "1 tablespoon white-wine vinegar",
        "1 teaspoon dried hot red pepper flakes",
        "1/4 teaspoon salt",
        "2 large garlic cloves, sliced very thin",
        "2 tablespoons unsalted butter",
        "a 1 1/2-pound head of chicory or curly endive, the leaves torn into large pieces and washed well",
        "1/3 cup water",
        "*available at many butcher shops and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Leafy Green",
        "Braise",
        "Marinate",
        "Sauté",
        "Orange",
        "Gourmet"
    ],
    "title": "Orange Duck Breasts on Braised Chicory",
    "url": "http://www.epicurious.com/recipes/food/views/orange-duck-breasts-on-braised-chicory-13150"
}
