{
    "directions": [
        "Whisk sugar and yolks in heavy large saucepan to blend. Whisk in cornstarch and orange peel. Gradually add orange juice and cream, whisking to blend well. Set pan over medium-high heat and whisk constantly until cream thickens and boils, about 8 minutes. Pour into bowl. Press plastic wrap directly onto surface of pastry cream to prevent skin from forming. Refrigerate until cold, at least 4 hours.",
        "Beat cream cheese in large bowl until fluffy. Beat in pastry cream, 1 cup at a time, scraping bottom and sides of bowl occasionally. Cover; refrigerate until cold. (Can be made 1 day ahead. Keep refrigerated.)",
        "Stir 2 1/2 cups sugar and 1 cup water in heavy large saucepan over medium-low heat until sugar dissolves. Increase heat; boil without stirring until syrup is deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 20 minutes. Remove pan from heat. Immediately add 1 1/4 cups orange juice and peel (mixture will bubble vigorously). Stir over low heat until any hard bits dissolve and caramel comes to boil. Strain into 2-cup glass measuring cup.",
        "Pour 1 cup caramel into small bowl; reserve for frosting. Mix remaining 1/2 cup orange juice into remaining caramel in glass measuring cup; reserve as soaking syrup. Cover caramel in small bowl and soaking syrup separately; refrigerate until cold, at least 4 hours and up to 1 day.",
        "Using electric mixer, beat cream cheese and butter in large bowl until fluffy. Gradually beat in 1 cup caramel reserved for frosting, then powdered sugar and vanilla. (Can be made 1 day ahead. Cover; chill. If necessary, let stand at room temperature until just spreadable before using.)",
        "Preheat oven to 350°F. Butter 12-inch-diameter cake pan with 2-inch-high sides; line bottom with parchment paper. Butter paper; dust pan with flour.",
        "Bring 1/3 cup milk and 1 tablespoon butter to simmer in small saucepan. Remove pan from heat; add 2 teaspoons vanilla extract. Cover pan. Sift 1 1/3 cups flour, 1 teaspoon baking powder and 1/4 teaspoon salt into medium bowl. Using electric mixer at high speed, beat 3 eggs in large bowl until frothy, about 1 minute. Gradually beat in 1 1/3 cups sugar. Continue to beat egg mixture until light colored and thick enough to fall in heavy ribbon when beaters are lifted, about 4 minutes. Pour milk mixture over egg mixture. Using whisk, gently stir until just blended. Add flour mixture. Gently stir with whisk until just blended (do not over mix; batter may deflate). Pour batter into prepared pan.",
        "Bake cake until tester inserted into center comes out clean, about 20 minutes. Transfer pan to rack; cool 10 minutes.",
        "Line cake rack with paper towels. Dust towels generously with powdered sugar. Cut around pan sides; turn cake out onto sugared towels. Peel off parchment. Cool cake completely.",
        "Repeat 2 more times, using same amount of each ingredient to make 2 more cake layers.",
        "Place 1 cake layer on 11-inch tart pan bottom; brush with 1/2 cup soaking syrup. Spread with half of filling (about 3‰ cups). Place in freezer until filling is firm, about 15 minutes. Top with second cake layer; brush with 1/2 cup soaking syrup. Spread with remaining filling. Place in freezer until filling is firm, about 15 minutes. Top with third cake layer; brush with remaining soaking syrup. Spread 2 cups frosting thinly over top and sides of assembled cake to cover completely. Refrigerate until frosting is firm, about 1 hour.",
        "Spoon 1 cup frosting into pastry bag fitted with small (scant 1/4-inch-diameter) star tip. Spread remaining frosting smoothly over top and sides of cake. Pipe frosting in bag decoratively on top and sides of cake. (Can be prepared ahead. Refrigerate until frosting is firm, at least 5 hours; cover loosely and keep refrigerated up to 1 day. Or freeze until frosting is firm, about 2 hours; cover and keep frozen up to 1 week. Defrost covered cake in refrigerator for 2 days.)",
        "Place cake on large platter. Arrange fruit decoratively atop cake. To cut cake, start 2 inches inward from edge and insert knife straight down; cut 8-inch-diameter circle in center of cake. Starting 2 inches in from 8-inch-diameter circle and inserting knife straight down, cut 4-inch-diameter circle in center of 8-inch circle. Cut outer portion of cake into 16 slices. Cut middle portion of cake into 8 slices. Cut inner 4-inch portion of cake into 4 wedges. Serve cake."
    ],
    "ingredients": [
        "1 cup sugar",
        "6 large egg yolks",
        "6 tablespoons cornstarch",
        "1 1/2 tablespoons grated orange peel",
        "3 cups orange juice",
        "1/2 cup whipping cream",
        "2 8-ounce packages Philadelphia- brand cream cheese, room temperature",
        "2 1/2 cups sugar",
        "1 cup water",
        "1 3/4 cups orange juice",
        "2 tablespoons grated orange peel",
        "4 8-ounce packages Philadelphia- brand cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 1/4 cups powdered sugar",
        "1 1/2 teaspoons vanilla extract",
        "One-third of these ingredients is used for each of the three cake layers.",
        "1 cup whole milk",
        "3 tablespoons unsalted butter",
        "6 teaspoons vanilla extract",
        "4 cups cake flour",
        "3 teaspoons baking powder",
        "3/4 teaspoon salt",
        "9 large eggs",
        "4 cups sugar",
        "Powdered sugar",
        "Use a large tart pan bottom, a rimless baking sheet or a cardboard round to move and stack the three cake layers.",
        "Assorted berries and cut fruit (such as strawberries, raspberries, cherries, kiwi and apricot)",
        "cut fruit (such as strawberries, raspberries, cherries, kiwi and apricot)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Orange",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Layer Cake with Orange-Caramel Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/orange-layer-cake-with-orange-caramel-cream-cheese-frosting-5375"
}
