{
    "directions": [
        "Heat oven to 375°F. Coat a 12-inch x 15-inch x 1-inch jelly-roll pan with cooking spray. Line with parchment paper; coat with cooking spray. Whisk flour, cinnamon, baking powder, nutmeg, ginger and salt in a bowl. In another bowl, beat eggs with an electric mixer on high until fluffy. Gradually beat in sugar until combined. Reduce speed to low; add pumpkin, zest and vanilla until just combined. Gently but thoroughly fold in flour mixture. Pour batter into prepared pan. Spread into an even layer. Sprinkle pecans on top. Bake 10 to 12 minutes or until toothpick inserted in center comes out clean. Lightly dust a clean towel with confectioners' sugar. Remove cake from oven. Invert cake onto towel. Remove pan. Gently peel off top parchment. Tightly roll up cake in towel, starting on long side closest to you. Place seam side down on a rack. Place gelatin and 1 tablespoon cold water in a heatproof bowl; place bowl in pan of hot water to melt gelatin. In another bowl, beat ricotta, cream cheese and confectioners' sugar with an electric mixer on medium until smooth. Beat in gelatin and candied peel. Cover; refrigerate at least 1 hour. Gently unroll cake; set towel aside. Spread top with even layer of filling, leaving a 1-inch border on the far side. Gently roll up cake. Place seam side down on a platter. Refrigerate until ready to serve, covered loosely with plastic wrap. Before serving, trim cake by diagonally cutting thin slice off each end. Dust with confectioners' sugar."
    ],
    "ingredients": [
        "Canola-oil cooking spray",
        "Parchment paper",
        "3/4 cup all-purpose flour",
        "1 1/2 teaspoons cinnamon",
        "1 teaspoon baking powder",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "3 large eggs",
        "3/4 cup sugar",
        "2/3 cup pumpkin puree",
        "2 teaspoons grated orange zest",
        "1 teaspoon vanilla extract",
        "3/4 cup finely chopped pecans",
        "2/3 cup confectioners' sugar, plus extra for dusting",
        "1 teaspoon gelatin",
        "1 cup lowfat ricotta cheese",
        "6 ounces lowfat cream cheese",
        "1 tablespoon finely minced candied orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Cheese",
        "Chocolate",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Vegetable",
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Orange",
        "Pumpkin",
        "Fall",
        "Winter",
        "Chill",
        "Healthy",
        "Self",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Orange-Pumpkin Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/orange-pumpkin-roulade-236928"
}
