{
    "directions": [
        "Cut ends off oranges. Cut oranges with peel lengthwise in half, then cut each half lengthwise into 3 wedges. Combine 2 1/2 cups water and sugar in large saucepan. Bring to boil, stirring until sugar dissolves. Add orange wedges and any accumulated juices to syrup and bring to boil. Reduce heat and simmer until orange peel is soft and translucent and syrup is reduced and thickened, turning orange wedges occasionally and adding more water by 1/4 cupfuls as needed if syrup is too thick before orange wedges are soft, 35 to 40 minutes. Remove from heat. Stir in orange liqueur. Cool 15 minutes. Transfer to small container. Cover and chill. DO AHEAD: Can be made 1 week ahead. Keep chilled. Bring to room temperature before using.",
        "Position rack in center of oven and preheat to 325°F. Lightly butter 10-inch-diameter cake pan with 2-inch-high sides. Line bottom of pan with parchment paper; butter parchment.",
        "Whisk flour, baking powder, and salt in medium bowl to blend. Combine chocolate and butter in large metal bowl. Set bowl over saucepan of simmering water; stir until chocolate-butter mixture is melted and smooth. Remove bowl from over water; add both sugars, orange liqueur, and orange peel and whisk until blended (mixture will look grainy). Add eggs, 2 at a time, and whisk until just blended after each addition. Whisk in sour cream. Add flour mixture and stir in with rubber spatula just until incorporated. Transfer batter to prepared pan; spread evenly.",
        "Bake cake until tester inserted into center comes out with moist crumbs attached, about 50 minutes. Cool cake in pan on rack 30 minutes. Run small knife around sides of cake to loosen. Invert cake onto rack; peel off parchment. Cool cake completely (center may sink slightly).",
        "Combine chocolate and butter in small metal bowl. Set bowl over saucepan of simmering water; stir until chocolate-butter mixture is melted and smooth. Whisk in corn syrup. Cool glaze until barely warm but still pourable, about 10 minutes.",
        "Pour glaze onto center of cake. Using small offset spatula, spread glaze over top of cake, leaving 1/2-inch plain border around top edge. Let stand at room temperature until glaze sets, about 2 hours. DO AHEAD: Can be made 2 days ahead. Cover with cake dome and store at room temperature.",
        "Using hot dry knife and wiping knife clean between slices, cut cake into slices. Divide among plates. Serve some candied orange compote alongside."
    ],
    "ingredients": [
        "3 medium or 4 small blood oranges",
        "2 1/2 cups (or more) water",
        "1 cup sugar",
        "2 tablespoons Grand Marnier or other orange-flavored liqueur",
        "2 cups all purpose flour",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 pound bittersweet chocolate (do not exceed 61% cacao), chopped",
        "1 cup (2 sticks) unsalted butter, cut into 8 pieces",
        "1 1/4 cups sugar",
        "1 cup (packed) golden brown sugar",
        "1 tablespoon Grand Marnier or other orange-flavored liqueur",
        "2 teaspoons finely grated orange peel",
        "4 large eggs",
        "3/4 cup sour cream",
        "6 ounces bittersweet chocolate (do not exceed 61% cacao), chopped",
        "1/2 cup (1 stick) unsalted butter, cut into 4 pieces",
        "2 tablespoons dark corn syrup",
        "Special equipment: 10-inch-diameter cake pan with 2-inch-high sides",
        "Small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Chocolate",
        "Citrus",
        "Egg",
        "Dessert",
        "Christmas",
        "High Fiber",
        "Orange",
        "Christmas Eve",
        "Sour Cream",
        "Simmer",
        "Boil",
        "Butter",
        "Grand Marnier",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange-Scented Bittersweet Chocolate Cake with Candied Blood Orange Compote",
    "url": "http://www.epicurious.com/recipes/food/views/orange-scented-bittersweet-chocolate-cake-with-candied-blood-orange-compote-356338"
}
