{
    "directions": [
        "Position rack in center of oven and preheat to 275°F. Line large baking sheet with parchment paper. Using cookie cutter or glass as aid, trace six 2 1/2-inch circles on parchment, spacing 2 to 3 inches apart; turn parchment over.",
        "Using electric mixer, beat egg whites in large bowl until soft peaks begin to form. With mixer running, gradually add 6 tablespoons sugar. Whisk 2 tablespoons sugar and cornstarch in small bowl. With mixer running, gradually beat sugar-cornstarch mixture into meringue. Continue beating meringue until stiff glossy peaks form. Beat in vinegar and orange-flower water. Divide meringue among parchment paper circles, spreading to fill completely (meringues will be about 1 1/2 inches high). Using back of spoon, form slight depression in center of each meringue.",
        "Bake meringues until beige and dry to touch, about 20 minutes. Turn off oven and prop door open slightly with wooden spoon. Let meringues cool in oven until completely dry, about 1 hour. Transfer to rack to cool completely. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Puree all ingredients in blender until smooth. Transfer to bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Mix strawberries, 1 tablespoon sugar, and orange-flower water in medium bowl. Let stand at room temperature until sugar dissolves and juices form, stirring occasionally, about 20 minutes.",
        "Using electric mixer, beat chilled cream, vanilla, and remaining 1 teaspoon sugar in another medium bowl until soft peaks form. DO AHEAD: Strawberries and whipped cream can be made 2 hours ahead. Cover separately and chill. Stir strawberry mixture and rewhisk cream just before using.",
        "Spoon small dollop of whipped cream in center of each plate. Place 1 meringue atop whipped cream on each plate, pressing lightly to anchor meringue. Spoon generous dollop of whipped cream in center of each meringue. Spoon coulis around meringues; top with sliced strawberry mixture."
    ],
    "ingredients": [
        "2 large egg whites, room temperature",
        "8 tablespoons sugar, divided",
        "3/4 teaspoon cornstarch",
        "1/4 teaspoon white balsamic vinegar",
        "1/8 teaspoon orange-flower water",
        "1 12-ounce basket strawberries, hulled, quartered (about 2 cups)",
        "1 tablespoon sugar",
        "1/8 teaspoon orange-flower water",
        "1 12-ounce basket fresh strawberries, hulled, sliced (about 2 cups)",
        "1 tablespoon plus 1 teaspoon sugar",
        "1/8 teaspoon orange-flower water",
        "3/4 cup chilled heavy whipping cream",
        "1 teaspoon vanilla extract",
        "Ingredient info: Orange-flower water is a flavoring extract. It can be found in the liquor aisle or baking section of some supermarkets and at liquor stores and Middle Eastern markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "Mother's Day",
        "Wedding",
        "Strawberry",
        "Spring",
        "Shower",
        "Engagement Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange-Flower Pavlovas with Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/orange-flower-pavlovas-with-strawberries-364674"
}
