{
    "directions": [
        "Combine water and sugar in medium saucepan. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves. Add kumquats; reduce heat. Simmer until kumquat slices are translucent, about 25 minutes. Remove from heat; cool kumquats in syrup. Strain kumquats, reserving syrup. Combine kumquats and 1/4 cup syrup in small bowl. Return remaining syrup to same saucepan; boil until reduced to 1 1/4 cups, about 8 minutes. DO AHEAD: Can be made 2 days ahead. Cover separately and chill.",
        "Position rack in center of oven and preheat to 350°F. Combine cookie crumbs and brown sugar in medium bowl; add 6 tablespoons melted butter and stir until crumbs feel moist when pressed together with fingertips, adding remaining 1 tablespoon melted butter if mixture is dry. Press crumb mixture evenly onto bottom and 1 inch up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake crust until set and edges are golden brown, about 20 minutes. Cool crust in pan on rack. Maintain oven temperature.",
        "Wrap 4 layers of heavy-duty foil tightly around outside of pan with crust to make pan waterproof.",
        "Combine orange juice, 1/4 cup sugar, and orange peel in small saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat. Simmer until mixture is reduced to 3/4 cup, about 10 minutes. Chill until cool.",
        "Meanwhile, using electric mixer, beat cream cheese and remaining 3/4 cup sugar in large bowl until smooth. Mix in sour cream, flour, and salt. Beat in eggs 1 at a time. Mix in cooled orange juice mixture. Pour filling into crust; place springform pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of springform pan.",
        "Bake cake until just set in center, about 1 hour 35 minutes. Remove cake from roasting pan; remove foil. Place cake directly in refrigerator and chill overnight. Arrange kumquat slices atop cake, covering completely. DO AHEAD: Can be made 1 day ahead. Tent cake with foil and refrigerate.",
        "Remove pan sides; place cake on platter. Cut cake into wedges; drizzle some kumquat syrup over and serve.",
        "The KUMQUAT SYRUP is perfect with the cake—but don't stop there. It's also yummy drizzled over vanilla or coffee ice cream or in a cup of tea, a glass of club soda, or even a vodka Martini."
    ],
    "ingredients": [
        "2 cups water",
        "2 cups sugar",
        "1 vanilla bean, split lengthwise",
        "9 ounces kumquats (about 25 medium), thinly sliced crosswise, seeds removed",
        "2 cups vanilla wafer cookie crumbs (made from about 9 ounces cookies, finely ground in processor)",
        "1/3 cup (packed) golden brown sugar",
        "6 to 7 tablespoons unsalted butter, melted",
        "1 cup fresh orange juice",
        "1 cup sugar, divided",
        "2 tablespoons finely grated orange peel",
        "4 8-ounce packages cream cheese, room temperature",
        "1 cup sour cream",
        "3 tablespoons all purpose flour",
        "1/4 teaspoon salt",
        "5 large eggs, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Orange",
        "Vanilla",
        "Kumquat",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orange Cheesecake with Candied Kumquats",
    "url": "http://www.epicurious.com/recipes/food/views/orange-cheesecake-with-candied-kumquats-240424"
}
