{
    "directions": [
        "Mix 2/3 cup orange juice, honey, 3 garlic cloves, minced thyme and orange peel in 13x9x2-inch glass baking dish. Add chicken breasts and turn to coat. Cover and chill overnight, turning occasionally.",
        "Prepare barbecue (medium-high heat) or preheat broiler. Remove chicken from marinade; reserve marinade. Season chicken with salt and pepper. Grill chicken until cooked through, about 4 minutes per side. Transfer to plate.",
        "Boil reserved marinade in heavy small saucepan until reduced to 1/4 cup, about 10 minutes. Cut oranges between membranes to release segments. (Chicken, reduced marinade and orange segments can be prepared 2 hours ahead. Cover separately and store at room temperature. Rewarm marinade before using.)",
        "Whisk oil, vinegar, shallot and remaining 1/4 cup orange juice and garlic clove in small bowl to blend. Season dressing with salt and pepper. Combine greens, bell pepper and orange segments in a very large bowl. Toss with dressing. Arrange greens in center of large platter."
    ],
    "ingredients": [
        "2/3 cup plus 1/4 cup fresh orange juice",
        "1/4 cup honey",
        "4 large garlic cloves, minced",
        "1 tablespoon minced fresh thyme or 1 teaspoon dried",
        "2 teaspoons grated orange peel",
        "8 boneless chicken breast halves with skin",
        "3 oranges, peel and white pits removed",
        "6 tablespoons olive oil",
        "1/4 cup white wine vinegar",
        "1 large shallot, minced",
        "1 pound mixed greens",
        "1 orange or yellow bell pepper, seeded, thinly sliced",
        "Fresh thyme sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Leafy Green",
        "Poultry",
        "Marinate",
        "Wheat/Gluten-Free",
        "Orange",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Orange Chicken and Mixed Greens Salad",
    "url": "http://www.epicurious.com/recipes/food/views/orange-chicken-and-mixed-greens-salad-257"
}
