{
    "directions": [
        "Into a large bowl sift together the flour, 3/4 cup of the sugar, the baking powder, and the salt. In a bowl whisk together the oil, the egg yolks, the orange juice, the zest, and the vanilla and whisk the mixture into the flour mixture, whisking until the batter is smooth. In the large bowl of an electric mixer beat the egg whites with a pinch of salt until they are foamy, add the cream of tartar, and beat the whites until they hold stiff peaks. Add the remaining 3/4 cup sugar, a little at a time, and beat the whites until they hold stiff glossy peaks. Stir one third of the whites into the batter to lighten it and fold in the remaining whites gently but thoroughly. Spoon the batter into an ungreased 10-inch tube pan, 4 inches deep, with feet and a removable bottom, and bake the cake in the middle of a preheated 325°F. oven for 1 hour, or until a tester comes out clean. Invert the pan immediately onto a rack and let the cake cool completely in the pan upside down on the rack. Run a long thin knife around the outer and tube edges of the pan and turn the cake out of the pan onto the rack. Using a serrated knife cut the cake in half horizontally.",
        "In a large bowl, chilled, with an electric mixer beat together the cream, the Grand Marnier, the zest, the sugar, the orange-flower water, and a pinch of salt until the mixture holds stiff peaks.",
        "Transfer the bottom layer of the cake to a platter, spread some of the frosting on it, and top it with the remaining layer. Spread the remaining frosting on the top layer and side of the cake and garnish the cake with the candied mimosa balls, the candied violets, and the orange sections."
    ],
    "ingredients": [
        "2 1/4 cups cake flour (not self-rising)",
        "1 1/2 cups sugar",
        "1 tablespoon double-acting baking powder",
        "1/2 teaspoon salt",
        "1/2 cup vegetable oil",
        "7 large egg yolks",
        "3/4 cup fresh orange juice",
        "2 tablespoons freshly grated orange zest",
        "2 teaspoons vanilla",
        "9 large egg whites",
        "1 teaspoon cream of tartar",
        "2 cups well-chilled heavy cream",
        "3 tablespoons Grand Marnier or other orange-flavored liqueur",
        "2 teaspoons freshly grated orange zest",
        "1/4 cup sugar",
        "1/4 teaspoon orange-flower water (available at specialty foods shops), or to taste, if desired",
        "candied mimosa balls and candied violets (both available at specialty foods shops) for garnish if desired",
        "fresh orange sections, membranes discarded, for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "Orange",
        "Gourmet"
    ],
    "title": "Orange Chiffon Cake",
    "url": "http://www.epicurious.com/recipes/food/views/orange-chiffon-cake-11583"
}
