{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Sprinkle duck with salt and pepper. Add duck to pot and sauté until brown, about 3 minutes per side. Transfer duck to plate. Add basil, garlic, thyme, cinnamon stick, and crushed red pepper to pot; sauté 3 minutes. Return duck to pot. Add tomatoes; bring to boil. Reduce heat to medium-low, cover, and simmer until duck is tender, about 1 hour. Remove cinnamon stick. Transfer duck to work surface. Cut all meat from bones; cut meat into strips. Return meat to pot. Season duck ragù to taste with salt and pepper. (Can be prepared 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Rewarm over medium heat before serving.)",
        "Cook orecchiette in large pot of boiling salted water until just tender but still firm to bite. Drain pasta. Return to pot. Add duck ragù, arugula, and Parmesan; toss to blend. Divide pasta among small bowls. Sprinkle with feta cheese."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil",
        "2 breast halves and 2 leg-thigh pieces from one 4 1/2-pound duck, skinned; or 2 pounds chicken thighs with bones, skinned",
        "1/4 cup coarsely chopped fresh basil",
        "3 garlic cloves, chopped",
        "1 tablespoon chopped fresh thyme",
        "1/2 cinnamon stick",
        "1/2 teaspoon dried crushed red pepper",
        "3 1/2 cups canned crushed tomatoes or canned tomato puree (from two 28-ounce cans)",
        "12 ounces orecchiette (little ear-shaped pasta)",
        "1 cup coarsely chopped arugula",
        "2 tablespoons freshly grated Parmesan cheese",
        "1/2 cup 1/4-inch-dice feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Duck",
        "Pasta",
        "Poultry",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Parmesan",
        "Arugula",
        "Fall",
        "Winter",
        "Thyme",
        "Cinnamon",
        "Simmer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Orecchiette with Spiced Duck Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/orecchiette-with-spiced-duck-ragu-109057"
}
