{
    "directions": [
        "Pat rabbit dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Heat 1/4 cup oil in a deep 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown rabbit in 2 batches, turning over once, about 7 minutes per batch. Transfer to a platter, reserving fat in skillet.",
        "Add remaining 3 tablespoons oil to fat in skillet and heat until hot but not smoking, then sauté onion, carrot, celery, garlic, bay leaves, rosemary, and 1/4 teaspoon salt, stirring occasionally, until vegetables are golden brown, 8 to 10 minutes.",
        "Add wine and boil, stirring and scraping up any brown bits, until most of liquid is evaporated, about 3 minutes. Stir in tomatoes, broth, and 1/2 teaspoon salt and bring to a boil. Return rabbit along with any juices accumulated on platter to skillet and nestle rabbit into sauce. Cover skillet and simmer, stirring and turning rabbit over occasionally, until both saddle pieces are tender, about 15 minutes. Transfer saddle pieces to a plate, then continue to simmer leg pieces 10 minutes more.",
        "Remove from heat and transfer remaining rabbit pieces to plate. When cool enough to handle, remove meat from bones, discarding bones and gristle, and shred. Return meat along with any juices to sauce in skillet, then add remaining 1/4 teaspoon salt and 1/4 teaspoon pepper and bring sauce to a boil. Discard bay leaves.",
        "Meanwhile, cook pasta in a 6- to 8-quart pot of boiling salted water, uncovered, until al dente. Drain in a colander.",
        "Transfer pasta to a large serving dish and top with sauce, stirring to combine."
    ],
    "ingredients": [
        "1 (3-pound) rabbit, cut into 6 pieces",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1/4 cup plus 3 tablespoons extra-virgin olive oil",
        "1 large onion, finely chopped",
        "1 carrot, finely chopped",
        "1 celery rib, finely chopped",
        "2 garlic cloves, finely chopped",
        "2 Turkish bay leaves or 1 California",
        "3/4 teaspoon finely chopped fresh rosemary",
        "1 cup dry white wine",
        "1 (28-ounce) can whole tomatoes in juice (preferably San Marzano), drained and chopped",
        "1/2 cup reduced-sodium chicken broth (4 fluid ounces)",
        "1 1/2 pounds fresh semolina orecchiette (ear-shaped pasta) or 1 pound dried orecchiette",
        "Garnish: finely grated Grana Padano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Dairy",
        "Garlic",
        "Herb",
        "Onion",
        "Pasta",
        "Vegetable",
        "Gourmet"
    ],
    "title": "Orecchiette with Rabbit Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/orecchiette-with-rabbit-ragu-236988"
}
