{
    "directions": [
        "1. Trim all the leaves away from the broccoli rabe and remove the central core from each leaf. Remove the bottom 3 inches of the stem and peel the rest up to the flower buds. Rinse well in cold running water.",
        "2. Bring a large pot of salted water to a boil. Add the broccoli rabe and stir to submerge. Cook, uncovered, until tender and deep green in color, 3 to 4 minutes. Using a slotted spoon or tongs, lift the greens out of the water and rinse under cold running water. Drain the leaves in a colander for a few minutes then coarsely chop them and set aside.",
        "3. Bring another large pot of salted water to a boil. Add the orecchiette and stir to submerge and separate the pasta. Cook, uncovered, until the pasta is al dente, about 8 minutes. Reserve about 1/4 cup of the pasta cooking water for finishing the dish if necessary.",
        "4. While the pasta is cooking, in a large skillet over moderate heat, warm the oil. Add the garlic and sauté, stirring frequently, until light golden in color, about 1 minute. Add the red pepper flakes, if using, the blanched broccoli rabe, and the reserved pasta cooking water as needed. Drain the orecchiette in a colander, shaking well to remove excess water, then add it the broccoli rabe in the skillet and toss together over moderate heat until heated through, about 1 minute.",
        "5. Serve the pasta garnished with Pecorino Romano."
    ],
    "ingredients": [
        "1 pound broccoli rabe",
        "1 1/2 pounds dried orecchiette",
        "Kosher salt",
        "1/2 cup extra-virgin olive oil",
        "4 garlic cloves, sliced",
        "1 teaspoon red pepper flakes (optional)",
        "3/4 cup freshly grated Pecorino Romano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Vegetarian",
        "Dinner",
        "Broccoli Rabe",
        "Boil",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Orecchiette with Broccoli Rabe (Orecchiette con Cime di Rapa)",
    "url": "http://www.epicurious.com/recipes/food/views/orecchiette-with-broccoli-rabe-orecchiette-con-cime-di-rapa-51112630"
}
