{
    "directions": [
        "Working in batches, cook kale in a large pot of boiling salted water until just tender, about 4 minutes. Using tongs, transfer to a rimmed baking sheet; let cool. Set aside pot with water. Squeeze out excess liquid from kale; chop leaves and finely chop stems; set aside.",
        "Heat 3 tablespoons oil in a small skillet over medium heat. Add breadcrumbs and cook, stirring often, until beginning to brown, about 4 minutes. Add one-third of chopped garlic and cook, stirring often, until breadcrumbs are golden, about 3 minutes. Season with salt and pepper and transfer to a paper towel-lined plate; let cool.",
        "Heat butter and remaining 2 tablespoons oil in a large heavy pot over medium-low heat. Add anchovies, red pepper flakes, and remaining two-thirds of chopped garlic; cook, mashing anchovies with a spoon, until a paste forms, about 2 minutes. Add reserved kale and 1/2 cup water. Cook, stirring often, until kale is warmed through, about 4 minutes. Season with salt and pepper.",
        "Meanwhile, bring reserved kale cooking liquid to a boil; add pasta and cook, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.",
        "Add pasta and 1/2 cup pasta cooking liquid to kale mixture and stir to coat. Increase heat to medium and continue stirring, adding more cooking liquid as needed, until sauce coats pasta. Mix in Parmesan and 1/2 cup breadcrumbs; toss to combine. Divide pasta among bowls, drizzle with oil, and top with remaining breadcrumbs."
    ],
    "ingredients": [
        "1 pound Tuscan kale, or other variety (about 2 large bunches), stems trimmed",
        "Kosher salt",
        "5 tablespoons olive oil, divided, plus more for drizzling",
        "1 cup coarse fresh breadcrumbs",
        "3 garlic cloves, chopped, divided",
        "Freshly ground black pepper",
        "2 tablespoons (1/4 stick) unsalted butter",
        "4 anchovy fillets packed in oil, drained",
        "1/4 teaspoons crushed red pepper flakes",
        "1 pound orecchiette (little ear-shaped pasta)",
        "3/4 cup finely grated Parmesan or Grana Padano",
        "Ingredient info: Tuscan kale, also called black kale or cavolo nero, is available at farmers' markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Kale",
        "Anchovy",
        "Breadcrumbs",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Orecchiette with Kale and Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/orecchiette-with-kale-and-breadcrumbs-51143610"
}
