{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan.",
        "Mix crushed cookies, melted butter, and 2 tablespoons white sugar together in a bowl; press into the bottom of the prepared springform pan forming a crust.",
        "Beat the four 8-ounce packages cream cheese and 1 1/2 cups white sugar together in a large bowl until smooth; gradually beat in 3/4 cup milk until smooth. Beat eggs, 1 at a time, into cream cheese mixture, beating well after each addition. Mix sour cream, flour, and 1 tablespoon vanilla extract into cream cheese mixture until smooth.",
        "Pour 1/3 of the cream cheese mixture over the crust; top with chopped cookies. Pour remaining cream cheese mixture over cookies.",
        "Bake in the preheated oven for 1 hour. Turn off oven and let cake cool in oven with the door closed for 15 minutes. Refrigerate cheesecake until completely chilled, at least 1 hour.",
        "Beat confectioners' sugar, half 8-ounce package cream cheese, and chocolate-hazelnut spread together in a bowl. Add 1 1/2 teaspoons milk, 1 teaspoon vanilla extract, and salt to cream cheese mixture until frosting is smooth.",
        "Remove the ring of the springform pan from cheesecake. Spread frosting over entire cheesecake. Place wafer candy bars around the sides of cheesecake. Sprinkle chocolate pieces over top of cheesecake."
    ],
    "ingredients": [
        "Crust:",
        "1 cup crushed chocolate sandwich cookies (such as Oreo®)",
        "1/4 cup butter, melted",
        "2 tablespoons white sugar",
        "Cheesecake:",
        "4 (8 ounce) packages cream cheese",
        "1 1/2 cups white sugar",
        "3/4 cup milk",
        "4 eggs",
        "1 cup sour cream",
        "1/4 cup all-purpose flour",
        "1 tablespoon vanilla extract",
        "1 cup chopped chocolate sandwich cookies (such as Oreo®)",
        "Frosting:",
        "2 cups confectioners' sugar",
        "1/2 (8 ounce) package cream cheese, softened",
        "3 tablespoons chocolate-hazelnut spread (such as Nutella®)",
        "1 1/2 teaspoons milk",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "7 (1.5 ounce) bars chocolate-covered wafer candy bars (such as Kit Kat®)",
        "5 (1.69 ounce) packages candy-coated milk chocolate pieces (such as M&M's®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oreo® Cheesecake with Kit Kat® and M&M's®",
    "url": "http://allrecipes.com/recipe/240310/oreo-cheesecake-with-kit-kat-an/"
}
