{
    "directions": [
        "Position 1 rack in the upper third and 1 rack in the lower third of an oven. Preheat to 400°F (200°C). Line a baking sheet with parchment paper.",
        "In a bowl, toss the squash with 2 Tbs. of the olive oil, season with salt and pepper, and spread on the prepared baking sheet. Place the chicken on another baking sheet, brush with the remaining 1 Tbs. olive oil, and season with salt and pepper. Place the squash on the top rack in the oven and the chicken on the lower rack. Roast until the chicken is cooked through and an instant-read thermometer inserted into the thickest part registers 160°F (71°C), about 20 minutes. Remove the chicken from the oven and continue to roast the squash until it is tender and caramelized, about 10 minutes more. When the chicken is cool enough to handle, shred it into bite-size pieces.",
        "Meanwhile, in a saucepan, bring 6 cups (48 fl. oz./1.5 l) water to a boil over medium-high heat. Add the 1/2 tsp. salt and the orzo and cook for 7 minutes. Drain the pasta and set aside.",
        "In a large, heavy pot over medium-high heat, melt the butter. Add the onion, garlic and sage and sauté until soft, about 5 minutes. Add the broth and bring to a boil. Add the orzo, chicken and squash and reduce the heat to low. Simmer for 15 minutes, then season with salt and pepper. Ladle the soup into warmed bowls and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Soup of the Day,",
        "by Kate McMillan (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "4 delicata squash, about 2 3/4 lb. (1.4 kg) total, peeled, seeded\n  and cubed",
        "3 Tbs. olive oil",
        "Salt, to taste, plus 1/2 tsp.",
        "Freshly ground pepper, to taste",
        "2 small boneless, skinless chicken breast halves, about 3/4 lb.\n  (375 g) total",
        "1 cup (7 oz./220 g) orzo",
        "3 Tbs. unsalted butter",
        "1 small yellow onion, chopped",
        "3 garlic cloves, minced",
        "5 sage leaves, torn into pieces",
        "4 cups (32 fl. oz./1 l) chicken broth"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Orzo, Delicata Squash and Chicken Soup with Sage",
    "url": "http://www.williams-sonoma.com/recipe/orzo-squash-and-chicken-soup.html"
}
