{
    "directions": [
        "Season the veal shanks with salt and pepper and dredge them in the flour, shaking off the excess. In a heavy skillet heat 3 tablespoons of the butter and 3 tablespoons of the oil over moderately high heat until the foam subsides, in the fat brown the veal shanks in batches, adding some of the additional butter and oil as necessary and transferring the shanks as they are browned to a platter. Add the wine to the skillet, boil the mixture, scraping up the brown bits clinging to the bottom and sides of the skillet, until the liquid is reduced to about 1/2 cup, and reserve the wine mixture in a small bowl.",
        "In a flameproof casserole just large enough to hold the veal shanks in one layer cook the onion, the carrots, the celery, and the garlic in the remaining 4 tablespoons butter over moderately low heat, stirring occasionally, until the vegetables are softened and add the shanks with any juices that have accumulated on the platter, the reserved wine mixture, and enough of the broth to almost cover the shanks. Spread the tomatoes over the shanks, add the cheesecloth bag, the salt, and pepper to taste, and bring the liquid to a simmer over moderately high heat. Braise the mixture, covered, in the middle of a preheated 325°F. oven for 2 hours, or until the veal is tender. Transfer the shanks with a slotted spoon to an ovenproof serving dish, discard the strings, and keep the shanks warm. Strain the pan juices into a saucepan, pressing hard on the solids, and skim the fat. Boil the juices for 15 minutes, or until they are reduced to about 3 cups, baste the shanks with some of the reduced juices, and bake them, basting them 3 or 4 times with some of the remaining juices, for 10 minutes more, or until they are glazed.",
        "In a bowl stir together the parsley, the zest, and the garlic.",
        "Sprinkle the veal shanks with the gremolata, pour some of the juices around them, and serve the remaining juices separately."
    ],
    "ingredients": [
        "8 to 10 large 2 1/2-inch-thick veal shanks, each patted dry and tied securely with kitchen string to keep the meat attached to the bone",
        "all-purpose flour for dredging the veal shanks",
        "7 tablespoons unsalted butter plus additional if necessary",
        "3 tablespoons olive oil plus additional if necessary",
        "1 1/2 cups dry white wine",
        "1 1/2 cups finely chopped onion",
        "3/4 cup finely chopped carrots",
        "3/4 cup finely chopped celery",
        "1 teaspoon minced garlic",
        "3 to 4 cups chicken broth or beef broth",
        "1 1/2 cups peeled, seeded, and chopped tomato or 1 1/2 cups drained canned plum tomatoes, chopped",
        "a cheesecloth bag containing 6 fresh parsley sprigs, 4 fresh thyme sprigs, and 1 bay leaf",
        "1/2 teaspoon salt",
        "1/2 cup minced fresh parsley leaves (preferably flat-leafed)",
        "2 tablespoons freshly grated lemon zest",
        "1 tablespoon minced garlic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Braise",
        "Veal",
        "Celery",
        "Carrot",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Osso Buco",
    "url": "http://www.epicurious.com/recipes/food/views/osso-buco-11052"
}
