{
    "directions": [
        "Preheat oven to 325°F.",
        "Pat shanks dry and season with salt and pepper. Divide shanks and flour between 2 large sealable plastic bags and shake to coat, then remove shanks from bags, shaking off excess flour. Heat oil and 2 tablespoons butter in ovenproof pot over moderately high heat until foam subsides, then brown shanks well in 2 batches, 10 to 12 minutes per batch, transferring to a plate.",
        "Reduce heat to moderate and add remaining tablespoon butter to pot along with onions, carrot, celery, and garlic and cook, stirring, until onions are pale golden, about 5 minutes. Add remaining stew ingredients and bring to a boil, stirring. Arrange shanks in pot in 1 layer and return to a simmer. Cover pot and braise shanks in middle of oven until very tender, about 2 1/2 hours. Remove strings from osso buco and discard along with parsley sprigs and bay leaf.",
        "Stir together gremolata ingredients in a small bowl and sprinkle over osso buco. Serve immediately."
    ],
    "ingredients": [
        "8 to 10 (10-oz) meaty cross-cut veal shanks (osso buco; 5 to 6 1/2 lb total), each tied with kitchen string",
        "1/2 cup all-purpose flour",
        "2 tablespoons olive oil",
        "3 tablespoons unsalted butter",
        "2 medium onions, halved lengthwise and thinly sliced",
        "1 small carrot, finely chopped",
        "1 celery rib, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 cup dry white wine",
        "1 cup chicken broth",
        "1 (28- to 32-oz) can whole plum tomatoes with juice (not in purée), coarsely chopped",
        "1 cup Kalamata or other brine-cured black olives, pitted and halved",
        "1 1/2 teaspoons fresh thyme leaves",
        "2 fresh flat-leaf parsley sprigs",
        "1 Turkish or 1/2 California bay leaf",
        "2 (2- by 1/2-inch) strips fresh lemon zest , cut crosswise into fine julienne",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon black pepper, or to taste",
        "3 tablespoons chopped fresh flat-leaf parsley",
        "1 large garlic clove, minced",
        "1 teaspoon finely grated fresh fresh lemon zest",
        "Special equipment: a 7- to 9-quart heavy ovenproof pot (wide enough to hold shanks in 1 layer)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Citrus",
        "Olive",
        "Tomato",
        "Braise",
        "Stew",
        "Veal",
        "Celery",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Osso Buco with Tomatoes, Olives, and Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/osso-buco-with-tomatoes-olives-and-gremolata-107747"
}
