{
    "directions": [
        "Place the rosemary, thyme, bay leaf and cloves into cheesecloth and secure with twine. This will be your bouquet garni.",
        "For the veal shanks, pat dry with paper towels to remove any excess moisture. Veal shanks will brown better when they are dry. Secure the meat to the bone with the kitchen twine. Season each shank with salt and freshly ground pepper. Dredge the shanks in flour, shaking off excess.",
        "In a large Dutch oven pot, heat vegetable oil until smoking. Add tied veal shanks to the hot pan and brown all sides, about 3 minutes per side. Remove browned shanks and reserve.",
        "In the same pot, add the onion, carrot and celery. Season with salt at this point to help draw out the moisture from the vegetables. Saute until soft and translucent, about 8 minutes. Add the tomato paste and mix well. Return browned shanks to the pan and add the white wine and reduce liquid by half, about 5 minutes. Add the bouquet garni and 2 cups of the chicken stock and bring to a boil. Reduce heat to low, cover pan and simmer for about 1 1/2 hours or until the meat is falling off the bone. Check every 15 minutes, turning shanks and adding more chicken stock as necessary. The level of cooking liquid should always be about 3/4 the way up the shank.",
        "Carefully remove the cooked shanks from the pot and place in decorative serving platter. Cut off the kitchen twine and discard.",
        "Remove and discard bouquet garni from the pot.",
        "Pour all the juices and sauce from the pot over the shanks. Garnish with chopped parsley and lemon zest."
    ],
    "ingredients": [
        "1 sprig fresh rosemary",
        "1 sprig fresh thyme",
        "1 dry bay leaf",
        "2 whole cloves",
        "Cheesecloth",
        "Kitchen twine, for bouquet garni and tying the veal shanks",
        "3 whole veal shanks (about 1 pound per shank), trimmed",
        "Sea salt and freshly ground black pepper",
        "All purpose flour, for dredging",
        "1/2 cup vegetable oil",
        "1 small onion, diced into 1/2-inch cubes",
        "1 small carrot, diced into 1/2-inch cubes",
        "1 stalk celery, diced into 1/2 inch cubes",
        "1 tablespoon tomato paste",
        "1 cup dry white wine",
        "3 cups chicken stock",
        "3 tablespoons fresh flat-leaf Italian parsley, chopped",
        "1 tablespoon lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Dutch Oven",
        "Italian",
        "Osso Buco",
        "Celery",
        "Vegetable",
        "Carrot Recipes",
        "Meat",
        "Veal",
        "Tomato"
    ],
    "title": "Osso Buco",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/osso-buco-recipe"
}
