{
    "directions": [
        "1. Preheat the oven to 350 degrees F.",
        "2. Season the veal shanks generously with salt and pepper. Dredge the shanks in flour and shake away any excess.",
        "3. Heat the oil in an ovenproof casserole or Dutch oven over high heat until it shimmers. Sear the veal shanks in the oil, turning as necessary, until they have a good color on all sides, 10 to 12 minutes. Remove them to a platter and cover loosely with foil.",
        "4. Add the onion, carrot, and 2 teaspoons minced garlic to the hot oil and sauté over medium heat, stirring frequently, until the onion is a deep golden brown, about 10 minutes. Add the tomato paste and sauté, stirring frequently, until the tomato paste turns a rust color, 2 to 3 minutes. Add the wine and stir well to dissolve the tomato paste.",
        "5. Return the veal shanks to the casserole along with any juices they may have released and add enough broth to cover the shanks by about 1/2. Bring the broth to a simmer, cover the casserole, and place it in the oven. Braise the shanks, turning them as necessary to keep them evenly moistened, until they are very tender, about 1 1/2 hours. Transfer the shanks to a serving platter and keep warm while finishing the sauce.",
        "6. Strain the sauce, return it to the casserole, and bring it to a boil over high heat, skimming the surface as necessary. Reduce the heat to low simmer until the sauce has a lightly thickened consistency, about 10 minutes. Season to taste with salt and pepper.",
        "7. Combine the remaining garlic, the lemon zest, parsley, and anchovy fillets to form the gremolata. Serve the shanks on heated plates garnished with the gremolata."
    ],
    "ingredients": [
        "4 veal shank pieces, about 12 ounces each",
        "Salt as needed",
        "Freshly ground black pepper as needed",
        "Flour as needed for dredging veal shanks",
        "3 tablespoons olive oil",
        "1 cup diced yellow onion",
        "1/2 cup diced carrot",
        "4 teaspoons minced garlic",
        "3 tablespoons tomato paste",
        "3/4 cup dry white wine",
        "4 cups beef or chicken broth",
        "1 teaspoon finely grated lemon zest",
        "3 tablespoons chopped flat-leaf parsley",
        "2 anchovy fillets, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Braise",
        "Dinner",
        "Veal",
        "White Wine",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Osso Buco Milanese",
    "url": "http://www.epicurious.com/recipes/food/views/osso-buco-milanese-51194610"
}
