{
    "directions": [
        "Preheat oven to 275°F.",
        "In a heavy casserole large enough to hold lamb shanks in one layer without crowding arrange shanks and season with salt and pepper. Roast shanks in middle of oven, covered tightly, 3 hours, or until tender. (Meat will give off juices as it cooks.) Pour off pan juices, reserving about 1 cup, and skim fat. Keep shanks warm, covered.",
        "In a small saucepan combine broth, reserved pan juices, water, and one-third zucchini and simmer 5 minutes, or until zucchini is tender but still bright green. In a blender purée broth mixture until smooth.",
        "In a bowl whisk together egg and lemon juice and whisk in puréed; broth mixture. Return mixture to pan and heat over moderate heat, stirring constantly, until 170°F. on a candy thermometer and thickened slightly (do not boil). Season avgolemono with salt and pepper and keep warm.",
        "In a large non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté remaining zucchini until crisp-tender, about 5 minutes. Stir in dill and salt and pepper to taste.",
        "Arrange shanks on a deep platter and scatter with zucchini. Drizzle shanks with some avgolemono and serve remaining sauce separately. Serve shanks with orzo>/I>."
    ],
    "ingredients": [
        "4 lamb shanks (about 4 pounds total), cut crosswise into 1 1/2-inch -thick pieces by butcher",
        "1 3/4 cups chicken broth",
        "1/4 cup water",
        "3 zucchini (about 1 1/2 pounds total), cut into 1/4-inch-thick slices",
        "1 large egg",
        "1/3 cup fresh lemon juice",
        "1 tablespoon olive oil",
        "1 tablespoon minced fresh dill",
        "Accompaniment: cooked orzo (rice-shaped pasta)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Sauté",
        "Lemon",
        "Zucchini",
        "Fall",
        "Dill",
        "Gourmet"
    ],
    "title": "Osso Buco of Lamb Shanks with Zucchini and Avgolemono",
    "url": "http://www.epicurious.com/recipes/food/views/osso-buco-of-lamb-shanks-with-zucchini-and-avgolemono-11389"
}
