{
    "directions": [
        "Heat 1 tablespoon oil in heavy large saucepan over medium-high heat. Add onion, celery, carrot and garlic; sauté until brown, about 10 minutes. Add tomato paste and cook 2 minutes. Add white wine and simmer until liquid is reduced by half, scraping up browned bits, about 5 minutes. Add next 7 ingredients; simmer until mixture is reduced to 3 cups, about 50 minutes. Discard bay leaf. Season sauce with salt and pepper.",
        "Preheat oven to 350°F. Sprinkle halibut with salt, pepper and cayenne pepper. Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Add fish to skillet and cook until brown, about 2 minutes per side. Transfer fish to plate. Pour off oil from skillet. Reduce heat to low. Add balsamic vinegar to skillet; simmer 1 minute. Add sauce. Whisk in butter. Season with salt and pepper. Pour sauce into 13x9x2-inch glass baking dish. Place fish atop sauce in dish. Bake until fish is opaque in center, about 10 minutes.",
        "Divide potatoes among 6 plates. Top potatoes with fish and sauce. Sprinkle with Gremolata and serve immediately.",
        "*Available at Asian markets and in the produce section of some supermarkets."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1/2 medium onion, chopped",
        "3/4 cup chopped celery",
        "3/4 cup chopped peeled carrot",
        "2 garlic cloves, minced",
        "1 tablespoon tomato paste",
        "1 cup white wine",
        "4 cups chicken stock or canned low-salt chicken broth",
        "1 cup crushed tomatoes in puree (from 15-ounce can)",
        "1/2 cup freshly squeezed orange juice",
        "1/3 cup chopped lemongrass* (from about 3 stalks)",
        "1/4 cup soy sauce",
        "4 fresh thyme sprigs",
        "1 bay leaf",
        "6 5-ounce halibut fillets",
        "Cayenne pepper",
        "1/4 cup balsamic vinegar",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "Whipped Potatoes with Herbs",
        "Gremolata"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Vinegar",
        "Orange",
        "Halibut",
        "White Wine",
        "Spring",
        "Lemongrass",
        "Soy Sauce",
        "Simmer"
    ],
    "title": "Osso Buco-style Halibut and Whipped Potatoes with Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/osso-buco-045style-halibut-and-whipped-potatoes-with-herbs-104938"
}
