{
    "directions": [
        "For the dough: Add the yeast into 1/2 cup of the warm water (think bathtub temperature) and give it a nice stir. It needs to foam up. If it doesn't, it means it's not active, it's dead and your bread won't rise. Add a pinch of sugar to help the yeast grow. Let sit 5 minutes or so.",
        "Add the butter to your mixer, turn on to begin creaming and add the 1 cup sugar. When it's light and fluffy, add the milk powder and salt. Add your eggs, incorporating 1 before adding the other. Turn off and scrape down the bowl, making sure to get any batter off the bottom and that there are no lumps. Add the remaining 1 cup warm water and then the yeast. Add the flour in stages, it should start to look like dough. Beat for 5 to 10 minutes. Turn off the mixer.",
        "Flour a work surface so the dough doesn't stick. Dump out the dough, adding more flour if sticky. Begin kneading by folding the dough in on itself, and keep pushing it out. Keep kneading until it's lump-free and no longer sticky. Put in a nicely greased bowl and cover with plastic wrap. Put in a warm place until it doubles, 2 1/2 hours or so.",
        "While the dough is growing, make your glaze: Put your butter in a bowl. (Having the butter at room temperature means that the sugar will incorporate better and make easier to stir.) Add your honey, dark corn syrup and brown sugar. Give it a good stir and add 1/4 cup water. The butter might separate, and that's fine. It won't look pretty, but it will taste good when done baking!",
        "Preheat the oven to 350 degrees F. Butter a deep pie plate with fluted edges.",
        "Pour the glaze in the bottom of your dish, sprinkle the pecans over top and set aside while you roll out the dough.",
        "Flour your work surface. Punch the dough down to deflate it and then cut in half. Put the first piece on the floured surface, adding more flour if it's still sticky. Flour your rolling pin as well and roll the dough out into a square about 10 inches.",
        "Combine your cinnamon and sugar in a small bowl, brush with half the melted butter and sprinkle with half the cinnamon sugar. Take the long side and fold and roll it up in on itself. Cut the dough in half, then divide the halves into thirds, ending up with 6 pieces. Stick them right onto the glaze and nuts in your pan. Repeat with the second piece of dough. Cover with plastic and let rise about 1 hour or so in a warm space. Bake until the buns are a nice golden brown, about 30 minutes.",
        "Mix together the confectioners' sugar and water to desired consistency. Invert your cake stand or a plate on top of the buns, then flip the pan over. Tap the bottom of the pan to loosen the buns and lift the pan away. Drizzle your royal icing over the top in zig zags, cut and serve."
    ],
    "ingredients": [
        "2 tablespoons dry yeast",
        "1 1/2 cups warm water (110 to 115 degrees F), divided",
        "1 cup granulated sugar, plus a pinch",
        "1 stick unsalted butter, at room temperature",
        "1/2 cup dry nonfat milk powder",
        "1 teaspoons fine sea salt",
        "2 large eggs",
        "5 1/4 to 5 3/4 cups all-purpose flour, plus more as needed",
        "1 stick unsalted butter, at room temperature, plus more for pan, plus 1/2 stick, melted",
        "3 tablespoons honey, local preferred",
        "1/3 cup dark corn syrup",
        "1 cup packed brown sugar",
        "1 1/2 cups pecans",
        "1 tablespoon ground cinnamon",
        "1 tablespoon granulated sugar",
        "Confectioners' sugar",
        "Water"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pastry Recipes",
        "Nut Recipes",
        "Sugar",
        "Brunch"
    ],
    "title": "Other Worldly Sticky Buns",
    "url": "http://www.foodnetwork.com/recipes/anne-thornton/other-worldly-sticky-buns-recipe2"
}
