{
    "directions": [
        "Preheat oven to 250°F. Set racks in upper and lower thirds of oven. Place wire cooling racks in the rimmed baking sheets and place in the oven.",
        "Using a food processor with a grating insert, grate the potatoes and then the onions, transferring grated vegetables to a large bowl when the bowl of the food processor is filled. Alternately, use a box grater. Working in batches, place the potatoes and onions in a clean dishtowel and thoroughly wring out the excess liquid over the sink, then transfer the potato-onion mixture to a large bowl. The more liquid you remove, the crispier your latkes will be, so take your time and use several dish towels if necessary. Reserve the potato-onion mixture.",
        "In another large bowl, whisk together the matzo meal, salt, and pepper. Add the eggs and whisk to combine. Add the potato-onion mixture and mix well.",
        "In a large skillet over medium heat, melt equal parts schmaltz and oil (or oil only if omitting the schmaltz) until a scant 1/4-inch depth of fat is reached. Drop 2 tablespoons of latke mixture into the hot fat, spacing them 2 inches apart. Flatten latkes slightly using a spatula and cook, turning once, until crisp, golden brown, and cooked through, 3 to 4 minutes per side.",
        "Transfer latkes to wire racks and season with salt; return to the oven to keep warm; season with salt. As you remove latkes from the pan, replace them with fresh spoonfuls of potato mixture to maintain oil temperature. Add additional schmaltz and/or oil around the edge of the pan as needed to maintain a scant 1/4-inch depth of fat.",
        "Keep latkes warm in oven and serve hot with applesauce or sour cream."
    ],
    "ingredients": [
        "4 pounds unpeeled russet potatoes (about 5 large potatoes)",
        "1 pound yellow onions (about 2 medium onions)",
        "1/4 cup matzo meal",
        "2 teaspoons kosher salt, plus more to taste",
        "1/2 teaspoon freshly ground black pepper",
        "2 large eggs, lightly beaten",
        "1/4 - 1/2 cup (or more) vegetable oil",
        "1/4 cup (or more) schmaltz (rendered chicken fat; optional)",
        "Apple sauce, for serving",
        "Sour cream, for serving",
        "food processor with grating blade or box grater, 2 large wire cooling racks, 2 large rimmed baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Hanukkah",
        "Kid-Friendly",
        "Deep-Fry",
        "Fat Free",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Our Favorite Latkes",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-latkes-51259720"
}
