{
    "directions": [
        "Cover potatoes, garlic, and 1 Tbsp. salt with cold water in a large pot. Bring to a low boil, then reduce heat and simmer (do not boil) until potatoes are very tender when pierced with the tip of a paring knife but not falling apart, 20–25 minutes.",
        "Meanwhile, heat milk, thyme, and 3/4 cup butter in a small pot over medium, stirring, until butter is melted. Remove from heat; set aside.",
        "Drain potatoes and garlic; return to pot. Toss over low heat until moisture evaporates, 1–2 minutes. Using potato ricer or food mill, immediately press potatoes and garlic into a large bowl (do not let cool).",
        "Discard thyme from milk mixture and gradually stir into potatoes, reserving about 1/2 cup if you plan to make in advance (see Do Ahead). Season with 2 tsp. salt and 3/4 tsp. pepper. Fold in sour cream and stir with a spoon until incorporated and very smooth (do not overmix or potatoes will become gummy). Taste and adjust seasonings. Serve topped with remaining 2 Tbsp. butter and more pepper.",
        "Mashed potatoes can be made 2 hours ahead; cover and store at room temperature. Or chill, covered, up to 8 hours; reheat over medium with reserved 1/2 cup milk mixture."
    ],
    "ingredients": [
        "4 pounds Yukon Gold potatoes, peeled, cut into 2\" pieces",
        "6 large garlic cloves, peeled",
        "1 tablespoon plus 2 teaspoons kosher salt, divided, plus more",
        "1 1/4 cups whole milk",
        "4 thyme sprigs",
        "3/4 cup (1 1/2 sticks) plus 2 tablespoons unsalted butter, divided",
        "3/4 teaspoon freshly ground black pepper, plus more",
        "1/2 cup sour cream",
        "A potato ricer or food mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Frankenrecipe",
        "Potato",
        "Butter",
        "Milk/Cream",
        "Sour Cream",
        "Garlic",
        "Side",
        "Thanksgiving"
    ],
    "title": "Our Favorite Creamy Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-creamy-mashed-potatoes"
}
