{
    "directions": [
        "Heat a large, wide pot over medium-low and add oil and garlic. Cook, stirring occasionally, until garlic is golden brown on all sides (if it starts to burn, reduce heat), 8–10 minutes. While garlic cooks, break up tomatoes into smaller pieces with a paring knife or kitchen shears. When garlic is almost ready, add red pepper flakes and cook, stirring occasionally, until toasted and fragrant, about 30 seconds. Add tomatoes, bay leaves, salt, oregano, and pepper and stir, breaking up tomatoes with a wooden spoon, until well combined.",
        "Increase heat slightly and gently simmer, stirring occasionally, until sauce has thickened and flavors have concentrated, at least 2 hours and up to 3 hours.",
        "Place bread in a medium bowl, add milk, and let rest until moistened, about 5 minutes. Squeeze bread with your hands to remove excess milk, discarding milk. Tear bread into smaller, pea-size pieces and return to the medium bowl.",
        "Combine beef, pork, veal, eggs, garlic, 1 cup Parmesan, 1/2 cup parsley, 1 tsp. salt, oregano, pepper, fennel, and red pepper flakes in a large bowl. Using your hands, gently mix in bread until ingredients are evenly distributed (do not overmix).",
        "Fill a small bowl with cool water. Moisten your hands and roll meat mixture between palms into golf-ball-sized balls, occasionally moistening hands as needed. Place meatballs on a rimmed baking sheet-you should have about 24-and chill until sauce is ready.",
        "After 2–3 hours of simmering, pluck out bay leaves and add basil. Using an immersion blender (or transfer sauce to a food processor or blender, working in batches, if necessary), purée until slightly chunky but not smooth. Reserve 1 1/2 cups sauce; keep remaining sauce in pot warm over very low heat.",
        "Heat a large skillet over medium-high and add oil. Once hot, add meatballs to skillet (without crowding) and work in batches to brown on all sides, turning frequently, about 5 minutes per batch. Return meatballs to baking sheet as you brown them.",
        "Once all meatballs are browned, add them to pot with tomato sauce. If your pot is not large enough, divide sauce and meatballs between 2 pots. Increase heat to medium-low, cover, and simmer until meatballs are cooked through, 10–15 minutes.",
        "Meanwhile, cook spaghetti in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid, and return pasta to pot over medium-low heat. Spoon reserved 1 1/2 cups sauce over pasta and toss to coat. Add pasta cooking liquid, 1/4 cup at a time, as needed to loosen sauce and coat pasta.",
        "Divide pasta among plates and top with meatballs and remaining sauce. Sprinkle with remaining 1/4 cup Parmesan and 1/4 cup parsley.",
        "Sauce can be made, cooled, and refrigerated for up to 5 days or frozen for up to 3 months. Meatballs can be shaped and refrigerated 1 day in advance. Meatballs can be cooked in sauce, cooled, and refrigerated for up to 5 days or frozen for up to 3 months."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "12 garlic cloves, peeled",
        "4 (28-ounce) cans whole tomatoes",
        "1/2 teaspoon red pepper flakes",
        "2 dried bay leaves",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons dried oregano",
        "1/2 teapoon freshly ground pepper",
        "2/3 cup (packed) basil leaves",
        "1 cup roughly torn day-old Italian bread",
        "1 cup whole milk",
        "8 ounces ground beef",
        "8 ounces ground pork",
        "8 ounces ground veal",
        "3 large eggs, beaten to blend",
        "4 garlic cloves, finely chopped",
        "1 1/4 cups grated Parmesan, divided",
        "3/4 cup coarsely chopped fresh parsley, divided",
        "1 teaspoon kosher salt, plus more",
        "1 teaspoon dried oregano",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground fennel seeds",
        "1/2 teaspoon red pepper flakes",
        "1/4 cup olive oil",
        "1 pound spaghetti"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pasta",
        "Pork",
        "Kid-Friendly",
        "Dinner",
        "Veal",
        "Back to School",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Our Favorite Spaghetti and Meatballs",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-spaghetti-and-meatballs-56389489"
}
