{
    "directions": [
        "Place rack in the center of oven and preheat to 350°F.",
        "Pulse graham crackers, sugar, cinnamon, and salt in a food processor until fine crumbs form. With the motor running, drizzle in melted butter and process until well-combined. Transfer mixture to pie pan and press into bottom and up sides with a flat-bottomed measuring cup.",
        "Bake crust until golden brown and set, 8–10 minutes. Transfer to a wire rack and let cool to room temperature, about 15 minutes.",
        "Whisk condensed milk and yolks together in a large bowl. Add key lime and lemon juice and whisk until well-combined (mixture will thicken slightly).",
        "Pour filling into crust and bake until center is just set, about 15 minutes. Transfer pie to a wire rack and let cool completely (filling will set as it cools), about 1 hour. Transfer to refrigerator and chill until cold, at least 1 hour.",
        "When ready to serve, whip cream with a whisk or electric mixer to very soft peaks. Sprinkle sugar over cream and continue whipping until it holds stiff peaks. Dollop cream in center of pie (leaving at least a 1\" border of visible pie filling) and serve.",
        "Pie (without topping) can be made, loosely covered, and chilled for up to 2 days."
    ],
    "ingredients": [
        "11 (2 1/4x4 3/4\") graham crackers",
        "2 tablespoons sugar",
        "1 1/2 teaspoons ground cinnamon",
        "Pinch kosher salt",
        "6 tablespoons unsalted butter, melted",
        "1 (14-ounce) can sweetened condensed milk",
        "4 large egg yolks",
        "7 tablespoons fresh key lime juice",
        "2 tablespoons fresh lemon juice",
        "1 cup chilled heavy cream",
        "2 tablespoons powdered sugar",
        "A 9\" pie pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Lime",
        "Spring",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Our Favorite Key Lime Pie",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-key-lime-pie-56389684"
}
