{
    "directions": [
        "Position the rack in the upper third of the oven and preheat to 375°F.",
        "In a large pot over medium-high heat, heat the oil. Add the sausage, onion and 3/4 teaspoon salt and 1/4 teaspoon pepper; cook, breaking up sausage with a wooden spoon, until browned and cooked through, 8 to 10 minutes. Reduce heat to medium and add garlic, red-pepper flakes, and tomato paste; cook, stirring often, until fragrant, 1 to 2 minutes more. Add tomatoes (along with their juice) and oregano; bring to a simmer, and cook, breaking up the tomatoes with a wooden spoon until in small pieces, about 5 minutes. Taste and adjust seasoning, adding more red-pepper flakes if desired.",
        "In the bowl of a food processor, combine all of the filling ingredients and process until mostly smooth.",
        "Squeeze the spinach in a paper towel or clean dishcloth until very dry. Transfer to a bowl and season with a pinch of salt.",
        "Coat baking dish with cooking spray and spread the bottom with 2 cups sauce. Top with a layer of three noodles, then a third of the ricotta mixture (about 1 1/3 cups), and a third of the spinach (about 2/3 cup). Sprinkle with 1 cup grated mozzarella.",
        "Repeat twice more, skipping the mozzarella on the third layer. Top the lasagna with the remaining sauce. Sprinkle the remaining 2 cups mozzarella in clusters so some of the sauce peeks through.",
        "Place the baking pan on a rimmed baking sheet. Lightly spray a piece of foil with cooking spray, cover the lasagna, and bake for 45 minutes. Remove the foil and continue baking until lightly browned and bubbly, about 20 minutes more. Let cool at least 10 minutes before serving.",
        "DO AHEAD: The sauce can be prepared up to 2 days in advance and refrigerated. The filling can be prepared up to 1 day in advance and refrigerated."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 pound sweet Italian sausage, casings removed",
        "1 medium onion, chopped",
        "3/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "4 garlic cloves, minced",
        "1/2 teaspoon red-pepper flakes, plus more to taste",
        "2 tablespoons tomato paste",
        "Two 28-ounce cans whole tomatoes",
        "2 teaspoons dried oregano",
        "Two 15-ounce containers part-skim ricotta cheese",
        "1 1/2 cups packed basil leaves",
        "1/2 cup grated Parmesan (about 2 ounces)",
        "2 large egg yolks",
        "3/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 10-ounce packages frozen chopped spinach, thawed, or 1 1/2 pounds fresh spinach, steamed",
        "Pinch kosher salt",
        "Vegetable-oil cooking spray",
        "9 no-boil lasagna noodles (such as Barilla)",
        "1 pound fresh mozzarella, grated (about 4 cups)",
        "9 x 13 x 2-inch baking dish, preferably glass"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Kid-Friendly",
        "Spinach",
        "Noodle",
        "Dinner",
        "Pasta",
        "Sausage",
        "Casserole/Gratin"
    ],
    "title": "Our Favorite Lasagna With Sausage, Spinach, and Three Cheeses",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-lasagna-with-sausage-spinach-and-three-cheeses-51253440"
}
