{
    "directions": [
        "Heat a large, dry skillet over high heat and toast peppers in batches, until browned in spots but not burned, 30 to 45 seconds per side. Toast garlic cloves in their skins in the same skillet, tossing, until browned in spots, about 3 minutes.",
        "If chiles are dusty, rub them gently with a damp paper towel. Cut peppers in half lengthwise; remove stems and seeds. Place chiles de árbol in a small heatproof bowl. Place all other chiles in a large heatproof bowl. Pour very hot water over chiles until submerged and let soak for 45 minutes, placing a plate on top of chiles to keep them submerged if necessary",
        "Peel garlic cloves and place cloves in blender. Add all the soaked chiles except for the chiles de árbol along with 4 cups of the soaking liquid. Add 1 tablespoon salt, 1 teaspoon pepper, and honey. Purée until smooth. Taste and add chiles de árbol to your preference (start with 4 for mild or 6 for medium heat; add additional to taste if you would like more heat).",
        "Strain the purée through a fine-mesh sieve into a large bowl, using a rubber spatula to press the purée through. Set puree aside.",
        "In a large Dutch oven or pot over medium-high heat, melt 2 tablespoons of lard. Add 1/3 of the beef, 1/2 teaspoon salt, and 1/4 teaspoon pepper and lightly brown the meat, 6 to 8 minutes per batch. Transfer to a bowl, reserve, and repeat with remaining 2 batches of beef, seasoning each with 1/2 teaspoon salt and 1/4 teaspoon pepper.",
        "Lower the heat to medium and add 1 more tablespoon lard. Cook the onion with 1/4 teaspoon salt until soft, stirring, about 5 minutes. Add cumin and cook, stirring, 1 minute more. Add the chile purée and bring to a simmer. Cook, stirring, until purée has lost its raw chile flavor, about 15 minutes. Add 4 cups broth, oregano, and the beef. Combine the masa harina with 2 cups water and add to the mixture. Bring to a boil, reduce to a simmer, and cook, uncovered, until meat is tender and broth is thickened, about 3 hours.",
        "Add sugar and vinegar 1 tablespoon at a time, tasting to see if the chili needs more. Add cayenne, salt, and pepper to taste. Allow the chili to sit at least an hour and up to overnight to allow the flavors to meld. Serve with lime wedges, sour cream, onion, jalapeño, and/or cilantro."
    ],
    "ingredients": [
        "4 ounces dried ancho chiles (about 9 chiles)",
        "2 ounces dried guajillo chiles (about 7 chiles)",
        "2 ounces dried pasilla chiles (about 10 chiles)",
        "2 ounces dried chipotle chiles (about 8 chiles)",
        "8 to 12 dried chiles de árbol",
        "8 garlic cloves, unpeeled",
        "1 tablespoon plus 1 3/4 teaspoons kosher salt, divided",
        "1 3/4 teaspoons freshly ground black pepper, divided",
        "1 teaspoon honey",
        "7 tablespoons lard or vegetable oil",
        "6 pounds boneless beef chuck, trimmed and cut into 1/2-inch cubes",
        "2 cups finely chopped yellow onion",
        "1 tablespoon plus 1 teaspoon ground cumin",
        "4 cups low-sodium beef broth",
        "2 teaspoons dried oregano",
        "2 tablespoons masa harina, recommended but optional (see Cooks' Note)",
        "2 tablespoons dark-brown sugar",
        "2 tablespoons red-wine vinegar",
        "1/2 teaspoon cayenne pepper, plus more to taste",
        "Lime wedges, sour cream, chopped red or white onion, jalapeño, and/or cilantro, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chili",
        "Texas",
        "Beef",
        "Soup/Stew",
        "Stew",
        "Dinner",
        "Chile Pepper",
        "Hot Pepper"
    ],
    "title": "Our Favorite Texas Beef Chili",
    "url": "http://www.epicurious.com/recipes/food/views/our-favorite-texas-beef-chili-51249010"
}
