{
    "directions": [
        "Preheat oven to 275 degrees F (135 degrees C).",
        "Prepare the dressing in a glass jar by combining the garlic, oil, salt, mustard, pepper, Worcestershire sauce, cayenne, and lemon juice. Rinse anchovy filets under warm water, pat dry on paper towels, and roughly chop them. Place anchovy in jar with other ingredients. Cover with tight fitting lid and shake to mix.",
        "To coddle the egg, bring 2 inches of water to a boil in a small saucepan. Carefully lower egg into water; remove from heat and let stand for 1 minute. Remove and set aside to cool.  Crack open the egg and with a spoon, scrape out all yolk (even the runny white). Use a wire whisk and whip in a small bowl until very frothy. Pour egg to the rest of the dressing and mix well.",
        "Prepare the croutons by combining the bread cubes, melted butter, Italian seasoning, Worcestershire sauce and 1 tablespoon grated cheese. Toss well to coat bread, then place in a single layer on a 10x15 inch jelly roll pan and bake in preheated oven for 30 minutes.",
        "Prepare salad in a large bowl by combining the romaine, 1/2 cup grated cheese, dressing and croutons to taste. Toss well to coat and serve."
    ],
    "ingredients": [
        "2 cloves garlic, crushed",
        "6 tablespoons safflower oil",
        "3/4 teaspoon salt",
        "1/4 teaspoon mustard powder",
        "1/4 teaspoon ground black pepper",
        "1 1/2 teaspoons Worcestershire sauce",
        "1/8 teaspoon cayenne pepper",
        "2 tablespoons fresh lemon juice",
        "1 (2 ounce) can anchovy filets",
        "1 egg",
        "1 French baguette, cut into 1/2 inch pieces",
        "4 tablespoons melted butter",
        "1 teaspoon Italian seasoning",
        "1/2 teaspoon Worcestershire sauce",
        "1 tablespoon grated Parmigiano Reggiano cheese",
        "1 large head romaine lettuce - rinsed, dried, and torn into bite-size pieces",
        "1/2 cup grated Parmigiano Reggiano cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Outrageous Caesar Salad",
    "url": "http://allrecipes.com/recipe/18497/outrageous-caesar-salad/"
}
