{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Brush two 8 1/2 x 4 1/2 x 2 1/2-inch metal loaf pans with olive oil. Line pan bottoms with parchment paper; brush parchment with olive oil. Spread 1 1/2 cups almonds on rimmed baking sheet; toast in oven 10 minutes. Cool. Transfer to processor and coarsely grind (some small almond pieces should remain); set aside. Finely chop 1/2 cup untoasted almonds in processor. Boil ouzo in small saucepan until reduced to 1/2 cup, about 2 minutes. Cool.",
        "Sprinkle 1 1/2 tablespoons finely chopped untoasted almonds over bottom of each pan. Whisk flour, ground star anise, baking powder, sea salt, and ground toasted almonds in large bowl.",
        "Using electric mixer, beat egg yolks and 1 1/2 cups sugar in medium bowl until well blended (mixture will look grainy at first). Add 1 cup light olive oil; beat 1 minute. Add ouzo and yogurt and beat until well blended, about 30 seconds. Gradually add flour mixture to yolk mixture, beating just until incorporated (batter will be thick).",
        "Using dry clean beaters, beat egg whites in large bowl until stiff but not dry. Fold 1/3 of whites into batter to lighten. Fold in remaining whites in 2 additions. Divide batter between prepared pans (about 3 1/2 cups for each). Sprinkle each with remaining finely chopped untoasted almonds, dividing equally. Sprinkle each with 1 tablespoon sugar.",
        "Bake cakes until golden brown and tester inserted into centers comes out clean, about 1 hour 5 minutes. Cool cakes in pans on rack 15 minutes. Turn cakes out onto rack and cool completely. DO AHEAD Can be made 1 day ahead. Wrap in foil and store at room temperature."
    ],
    "ingredients": [
        "2 cups whole almonds, divided",
        "3/4 cup ouzo (unsweetened anise liqueur) or Pernod",
        "3 1/2 cups unbleached all purpose flour",
        "3 whole star anise,* finely ground in spice mill or in mortar with pestle (about 1 3/4 teaspoons ground)",
        "1 tablespoon baking powder",
        "1/2 teaspoon fine sea salt",
        "4 large eggs, separated",
        "1 1/2 cups plus 2 tablespoons sugar",
        "1 cup extra-light olive oil or 1/2 cup regular olive oil mixed with 1/2 cup sunflower oil",
        "1 cup plus 2 tablespoons plain whole-milk yogurt",
        "*Available in the spice section of some supermarkets and at specialty foods stores and Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Yogurt",
        "Almond",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ouzo-Scented Almond, Yogurt, and Olive Oil Cake",
    "url": "http://www.epicurious.com/recipes/food/views/ouzo-scented-almond-yogurt-and-olive-oil-cake-238253"
}
