{
    "directions": [
        "Pour beer and water into a large stock pot. Add salt and stir to dissolve. Bring mixture to a boil over medium high heat.",
        "In a large skillet or frying pan, heat vegetable oil over high heat. Sear ribs on both sides. Place on paper towels to briefly drain. Add seared ribs to the beer/water mixture. Add more water as needed to cover the ribs. Cover pot and simmer for 2 hours.",
        "While the ribs are simmering, melt the butter in a sauce pan and saute the onions and garlic until onions are translucent. Stir in tomatoes, ketchup, molasses, Worcestershire, mustard, salt, hot pepper sauce and vinegar. Bring to a slow boil, stirring constantly. Reduce heat to low and leave it simmering until the ribs are finished.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Drain ribs and arrange them in a shallow roasting pan, or pans.  Ladle the sauce over the ribs evenly, slice  each slice of lemon in half, and distribute the half slices on top of the sauce.  Cover with foil loosely, and place in the oven for 15 minutes, and then uncover for the last 10, a total of 25 minutes oven time.  Remove rind from lemon slices, discard rind, returning lemon \"meat\" to sauce on top of the ribs, and serve ribs covering each with sauce on the plate."
    ],
    "ingredients": [
        "1 (12 fluid ounce) can or bottle beer",
        "1 1/2 cups water",
        "1 tablespoon salt",
        "3 tablespoons vegetable oil",
        "5 pounds pork spareribs",
        "1 tablespoon butter",
        "1 cup thinly sliced onions",
        "2 cloves garlic, pressed",
        "2 (8 ounce) cans diced tomatoes with juice",
        "1 cup ketchup",
        "3 tablespoons molasses",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon prepared mustard",
        "1/4 teaspoon salt",
        "1/2 tablespoon hot pepper sauce",
        "1 tablespoon white vinegar",
        "1/2 lemon, sliced into rounds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oven BBQ Ribs",
    "url": "http://allrecipes.com/recipe/24680/oven-bbq-ribs/"
}
