{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Pat the steaks very dry with paper towels; season both sides with salt and pepper. Allow steaks to rest at room temperature for about 30 minutes while the oven pre-heats.",
        "Heat a 10-inch cast iron pan over medium-high heat for about one minute. Add the oil to pan and swirl to evenly distribute the oil. Place the steaks in the pan, allowing room between steaks. Cook without moving steaks for 2 minutes. Using tongs, lift the steaks and flip them over. If properly seared the steaks should release easily, without sticking to the pan. Immediately place cast iron pan into the hot oven.",
        "Cook steaks until firm and reddish-pink and juicy in the center, about 7 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove skillet from oven and transfer steaks to a warm plate lightly tented with foil. (The internal temperature of the steaks will increase by about 5 degrees while resting.)",
        "Melt unsalted butter in the same skillet over low heat; add diced shallots. Cook and stir, releasing the browned bits from the bottom of the pan, about 1 minute.  Stir in the deli mustard.",
        "Increase the heat to medium-high. Whisk in Swanson(R) Beef Stock and Worcestershire sauce, continuing to scrape up browned bits from the pan. Bring to a boil and cook until slightly reduced, about 5 minutes.",
        "Reduce the heat to medium. Whisk in the cream; simmer until sauce clings to the back of a spoon, about 2 minutes. Stir in the parsley, chives, thyme, and oregano.",
        "Spoon the herb sauce over steaks; serve immediately."
    ],
    "ingredients": [
        "2 beef tenderloin steaks (1 1/2 inches thick)",
        "1/4 teaspoon kosher salt",
        "1/2 teaspoon coarsely ground pepper",
        "2 tablespoons vegetable oil",
        "Herb Pan Sauce:",
        "1 tablespoon unsalted butter",
        "2 tablespoons finely diced shallots",
        "1 tablespoon deli-style brown mustard",
        "1 cup Swanson® Beef Stock",
        "1 tablespoon Worcestershire sauce",
        "2 tablespoons heavy cream",
        "2 teaspoons chopped fresh parsley",
        "1 teaspoon chopped fresh chives",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oven-Seared Beef Tenderloin with Herb Pan Sauce",
    "url": "http://allrecipes.com/recipe/244816/oven-seared-beef-tenderloin-with-herb/"
}
