{
    "directions": [
        "Preheat oven to 450°F.",
        "Rinse snappers and pat dry with paper towels. Cut 3 slashes about 1/2 inch deep on each side of fish and rub gingerroot, garlic, and salt to taste into slashes. Arrange fish in one layer in a 13- by 9-inch baking dish and drizzle on both sides with Sherry and soy sauce. Sprinkle mushrooms, carrots, scallions, and black beans over fish and cover dish tightly with foil.",
        "Bake fish in middle of oven 40 minutes, or until just cooked through. Gently push black bean mixture off fish. Transfer fish to platter with large metal spatulas and keep warm.",
        "Transfer black bean mixture and pan juices to a saucepan. In a small bowl stir together water and cornstarch and stir into black bean mixture. Simmer sauce 1 minute, or until thickened slightly, and pour over fish.",
        "Serve fish with rice."
    ],
    "ingredients": [
        "two 1 1/2-pound red snappers, cleaned, leaving heads and tails intact",
        "1 tablespoon minced peeled fresh gingerroot",
        "2 garlic cloves, minced",
        "1/4 cup medium-dry Sherry",
        "3 tablespoons soy sauce",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps sliced thin",
        "4 medium carrots (about 1/2 pound), cut into julienne strips",
        "6 scallions, cut into julienne strips",
        "2 tablespoons fermented black beans,* rinsed lightly",
        "2 tablespoons water",
        "2 teaspoons cornstarch",
        "1 cup long-grain white rice, cooked according to package instructions and omitting any butter or margarine",
        "*available at Asian markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Fish",
        "Vegetable",
        "Bake",
        "Low Fat",
        "Snapper",
        "Spring",
        "Gourmet"
    ],
    "title": "Oven-Steamed Whole Snapper with Black Bean Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/oven-steamed-whole-snapper-with-black-bean-sauce-12019"
}
