{
    "directions": [
        "Preheat the oven to 400 degrees F. Set a rack on a foil-lined baking sheet. Spray the rack generously with cooking spray.",
        "Finely grind the bagel chips and cereal together in a food processor. Transfer the crumbs to a gallon-size plastic bag. Add the oil, salt, cayenne, paprika and ground pepper and toss to mix thoroughly. Whisk the light mayonnaise and Dijon mustard together in a medium shallow bowl.",
        "Add the chicken to the mayonnaise mixture and turn to coat all the pieces evenly. Drop the chicken into the plastic bag, seal and shake until each piece is evenly coated. Place the coated pieces on the prepared rack. Spray the chicken pieces evenly with cooking spray.",
        "Bake until the coating crisps and browns and an instant-read thermometer inserted in the thickest part of the pieces registers 160 degrees F, 35 to 40 minutes.",
        "Transfer to a platter and serve hot or at room temperature."
    ],
    "ingredients": [
        "Nonstick cooking spray, for spraying the rack and chicken",
        "2 1/4 cups broken bagel chips or Melba toast",
        "1 1/3 cups rice-corn crispy cereal, such as Crispix",
        "1 tablespoon canola oil",
        "2 teaspoons kosher salt",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon sweet paprika",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 cup light mayonnaise",
        "1 teaspoon Dijon mustard",
        "4 bone-in, skinless chicken pieces, about 6 ounces each (see Cook's Note)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy Dinner",
        "Healthy",
        "Oven Fried Chicken",
        "Low Calorie",
        "Diabetes-Friendly"
    ],
    "title": "Oven Fried Chicken",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/oven-fried-chicken-recipe"
}
