{
    "directions": [
        "Arrange a rack in upper third of oven; preheat to 400°F. Combine scallion, 1/4 cup cilantro, and next 4 ingredients in a small bowl. Whisk in 1 1/2 tablespoons oil. Season cilantro-lime sauce with salt and pepper; set aside.",
        "Heat remaining 2 tablespoons oil in a large skillet over high heat until shimmering. Working in batches if needed, add bok choy, cut side down, and sear until golden brown, 2-4 minutes per batch. Turn bok choy cut side up and remove pan from heat. Add sake. Season flounder fillets with salt and pepper and arrange in a single layer over bok choy. Roast in oven until fish is just cooked through, 8-10 minutes.",
        "Spoon sake sauce from skillet into the bottom of 4 shallow bowls, dividing evenly. Add bok choy to each bowl, dividing evenly; top each bowl with 1 fish fillet. Spoon some cilantro-lime sauce over fish and garnish with cilantro sprigs. Serve remaining cilantro-lime sauce alongside for drizzling."
    ],
    "ingredients": [
        "1 scallion, thinly sliced",
        "1/4 cup coarsely chopped cilantro, plus small sprigs for garnish",
        "1/4 cup fresh lime juice",
        "3 tablespoons reduced-sodium soy sauce",
        "2 tablespoons unseasoned rice vinegar",
        "2 teaspoons finely minced peeled ginger",
        "3 1/2 tablespoons vegetable oil, divided",
        "Kosher salt and freshly ground black pepper",
        "1 pound baby bok choy (2–3 bunches), cut in half lengthwise",
        "1/2 cup sake or dry white wine",
        "4 (4-ounce) fillets flounder or other delicate white fish (up to 1/2\" thick)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Roast",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Lime",
        "Healthy",
        "Bok Choy",
        "Cilantro",
        "Lime Juice",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Oven-Roasted Flounder With Bok Choy, Cilantro, and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/oven-roasted-flounder-with-bok-choy-cilantro-and-lime-51133820"
}
