{
    "directions": [
        "Squeeze juice from lemon halves into large bowl; add lemon halves. Fill bowl with water. Trim stem of 1 artichoke. Starting at base, bend leaves back and snap off where leaves break naturally, continuing until all tough outer leaves have been removed. Using small sharp knife, trim outside of base until smooth and no dark green areas remain. Cut artichoke lengthwise in half. Using tip of knife, remove any purple-tipped leaves from center. Add artichoke to lemon water. Repeat with remaining artichokes. Bring large pot of salted water to boil. Drain artichokes. Add to boiling water; cook until just tender, about 8 minutes. Drain; set aside. (Can be made 1 day ahead; cover and chill.)",
        "Preheat oven to 375°F. Spray 3 large rimmed baking sheets with nonstick spray. Arrange artichoke halves, fennel and leeks in single layer on 2 prepared sheets. Arrange asparagus and carrots in single layer on third sheet. Brush vegetables with olive oil. Sprinkle with salt and pepper. Roast vegetables until tender, turning over halfway through, about 35 minutes total for artichokes, fennel and leeks and 20 minutes total for asparagus and carrots.",
        "Divide vegetables among 6 plates. Drizzle Salsa Verde over and serve."
    ],
    "ingredients": [
        "1 lemon, halved",
        "12 baby artichokes",
        "Nonstick olive oil spray",
        "2 large fennel bulbs, trimmed, each cut lengthwise into 8 wedges",
        "6 slender leeks (white and pale green parts only), root ends trimmed, each leek cut lengthwise in half",
        "18 thick asparagus spears, tough ends trimmed",
        "12 very slender small carrots, peeled",
        "Olive oil",
        "Salsa Verde"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Easter",
        "Vegetarian",
        "Artichoke",
        "Asparagus",
        "Fennel",
        "Leek",
        "Carrot",
        "Spring",
        "Healthy",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Oven-Roasted Spring Vegetables with Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/oven-roasted-spring-vegetables-with-salsa-verde-104964"
}
