{
    "directions": [
        "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers, then cook onions with 1/2 teaspoon salt and 1/4 teaspoon pepper, covered, stirring occasionally, until golden, 15 to 20 minutes. Transfer to a small bowl and keep warm, covered.",
        "Put a large heavy baking sheet (17 by 14 inches) on lowest rack of oven, then preheat oven to 500°F.",
        "Meanwhile, roll out dough on a lightly floured surface with a floured rolling pin, stretching corners with your hands to form a 16- by 13-inch rectangle. (Dough will be easier to roll out as it warms.) Transfer to a large tray lined with sheet of parchment paper. Lightly prick dough all over with a fork, then slide dough (on parchment) from tray onto hot baking sheet.",
        "Bake until top is puffed and pale golden in patches, about 10 minutes. (Prick any large bubbles with a fork and flatten.) Remove crust from oven and leave oven on.",
        "Sprinkle crust evenly with cheese, walnuts, and parsley. Bake pizza until edge of crust is deep golden, cheese is bubbling and golden in patches, and underside is golden brown, 2 to 4 minutes. Serve immediately."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 1/4 pound onions (2 large), halved and thinly sliced",
        "14 to 16 ounces pizza dough, thawed if frozen",
        "1/4 pound Gorgonzola dolce, crumbled (1 cup)",
        "1/2 cup walnuts, toasted and coarsely chopped",
        "1/4 cup chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Appetizer",
        "Bake",
        "Quick & Easy",
        "Dinner",
        "Walnut",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Oven-Baked Pizza with Caramelized Onions, Gorgonzola, and Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/oven-baked-pizza-with-caramelized-onions-gorgonzola-and-walnuts-358016"
}
