{
    "directions": [
        "Whisk olive oil, lemon juice, lime juice, garlic, mint, oregano, marjoram, thyme, rosemary, nutmeg, cinnamon, ginger, white pepper, and salt together in a bowl. Cover bowl with plastic wrap; refrigerate marinade at least 1 hour.",
        "Pierce lamb in multiple places evenly over the lamb; place into a gallon-sized freezer bag. Pour marinade over the lamb, squeeze excess air from the bag, and seal the bag. Marinate in the refrigerator 8 hours to overnight.",
        "Preheat oven to 325 degrees F (165 degrees C). Prepare a shallow roasting pan with cooking spray.",
        "Remove lamb from marinade; shake to remove excess liquid. Reserve 2 tablespoons marinade; discard remainder.",
        "Place lamb in the middle of the prepared roasting pan.",
        "Combine potatoes and carrots in a large bowl. Pour vegetable oil and reserved marinade over the vegetables; toss to coat. Arrange vegetables around the lamb. Cover the roasting pan with aluminum foil.",
        "Roast lamb in preheated oven until an instant-read thermometer inserted into the center reads 140 degrees F (60 degrees C), about 80 minutes. Remove foil and continue cooking until firm and meat is hot and slightly pink in the center, about 10 more minutes.  Rest lamb 10 minutes before cutting to serve."
    ],
    "ingredients": [
        "2/3 cup extra virgin olive oil",
        "1/4 cup lemon juice",
        "1/4 cup lime juice",
        "2 tablespoons minced garlic",
        "1/2 teaspoon dried mint flakes",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried marjoram",
        "3/4 teaspoon dried thyme",
        "1/2 teaspoon crushed rosemary",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground white pepper",
        "1/4 teaspoon salt",
        "2 1/4 pounds boneless leg of lamb",
        "cooking spray",
        "3 white potatoes, cut into large chunks (optional)",
        "3 large carrots, cut into large chunks (optional)",
        "2 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Oven-Roasted Boneless Leg of Lamb",
    "url": "http://allrecipes.com/recipe/230206/oven-roasted-boneless-leg-of-lamb/"
}
