{
    "directions": [
        "In a small bowl, combine 2 teaspoons of the crushed caraway seeds, garlic, salt and ground black pepper. Rub the pork with the dry rub mixture, cover and refrigerate for 24 hours.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat 1 tablespoon of the oil in a large skillet over medium high heat. Add the onion, carrots, bay leaves, 1 teaspoon of the crushed caraway seeds and salt and pepper to taste. Saute for 8 minutes, or until vegetables are tender. Transfer this to a 10x15 inch roasting pan.",
        "In the same skillet over high heat, combine 1/2 tablespoon of the olive oil, half (1 1/4 pounds) of the cabbage, and 1/2 teaspoon crushed caraway seeds. Saute, stirring often, until this cooks down, about 5 to 10 minutes. Transfer this to the roasting pan and repeat with another 1/2 tablespoon of oil, the remaining half (1 1/4 pounds) of the cabbage, and the remaining crushed caraway seeds. Once cooked down, transfer this to the roasting pan.",
        "Heat the remaining olive oil in the same skillet over medium high heat. Place the pork loin in the heated oil and brown well on all sides. Set the roast on top of all the vegetables in the roasting pan. Add the beer and molasses to the skillet and bring to a boil, scraping up all the browned bits on the bottom of the skillet. Pour this and the broth over the pork roast and vegetables. Season with salt and pepper to taste.",
        "Bake at 350 degrees F (175 degrees C) for 45 minutes. Turn pork over and bake until the internal temperature of the pork reaches 145 degrees F (63 degrees C). At this point, remove the pan from the oven and let the pork sit on a cutting board for 5 minutes. Then slice the pork into serving size pieces. Discard the bay leaves. Return the sliced pork to the pan resting over the vegetables. Top off with the mashed potatoes.",
        "Bake at 350 degrees F (175 degrees C) for 10 to 15 minutes, or until potatoes are lightly browned."
    ],
    "ingredients": [
        "4 teaspoons caraway seeds, crushed and divided",
        "2 cloves garlic, minced",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "3 pounds boneless pork loin roast",
        "3 tablespoons olive oil, divided",
        "1 onion, thinly sliced",
        "4 carrots",
        "2 bay leaves",
        "2 1/2 pounds shredded fresh cabbage",
        "1 (12 fluid ounce) can or bottle beer",
        "2 tablespoons molasses",
        "1 cup beef broth",
        "4 potatoes, cooked and mashed",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Overnight Pork Roast With Cabbage",
    "url": "http://allrecipes.com/recipe/16371/overnight-pork-roast-with-cabbage/"
}
