{
    "directions": [
        "Stir milk in a heavy saucepan over medium-high heat until milk starts to show small bubbles, steams, and reaches 85 to 100 degrees F (30 to 38 degrees C). Cool. Stir yeast into cooled milk.",
        "Melt 6 tablespoons butter in a saucepan over high heat; cook until butter is slightly browned, 2 to 3 minutes. Remove from heat and stir 2 tablespoons butter into melted butter. Stir mashed potatoes and 2/3 cup white sugar into butter until well combined.",
        "Beat eggs in a small bowl; add to mashed potatoes mixture and stir well. Pour milk-yeast mixture into mashed potato mixture and stir with a wooden spoon.",
        "Stir flour into potato mixture 1/2 cup at a time, stirring well with a wooden spoon after each addition, until a dough comes together. Turn dough out onto a floured work surface and knead until soft, 1 to 3 minutes. Lightly oil dough with canola oil, place dough in a bowl, cover the bowl with a clean, damp towel, and let rise in a warm place until doubled in size, at least 1 hour.",
        "Melt 1/2 cup butter in a large saucepan over high heat; cook until browned, 2 to 3 minutes. Pour butter into a bowl. Add remaining butter, brown sugar, 1/2 cup white sugar, and cinnamon; mix until filling is well combined.",
        "Roll 1/2 of the dough into a 1/4-inch thick rectangle. Spread 1/2 of the filling over dough rectangle. Cut dough width-wise into 12 equal strips. Roll up each strip and place in a greased 9x13-inch baking dish. Repeat with remaining dough and filling. Cover the baking dish with plastic wrap and refrigerate, 8 hours to overnight.",
        "Preheat oven to 400 degrees F (200 degrees C). Line baking sheets with parchment paper.",
        "Place rolls 4-inches apart on prepared baking sheets.",
        "Bake in the preheated oven, rotating the baking sheets once, until golden and set, 11 to 13 minutes.",
        "Whisk 2 teaspoons vanilla extract and corn syrup together in a bowl. Whisk confectioners' sugar and cream into corn syrup mixture until desired glaze consistency is reached. Drizzle glaze over cinnamon rolls."
    ],
    "ingredients": [
        "Dough:",
        "1/2 cup milk",
        "1 (.25 ounce) package active dry yeast",
        "1/2 cup butter, divided",
        "1 cup mashed potatoes",
        "2/3 cup white sugar",
        "1 1/2 teaspoons vanilla extract",
        "2 eggs, room temperature",
        "4 cups all-purpose flour, or more as needed",
        "1 teaspoon canola oil, or as needed",
        "Filling:",
        "3/4 cup butter",
        "1/2 cup light brown sugar",
        "1/2 cup white sugar",
        "1 tablespoon ground cinnamon",
        "Glaze (optional):",
        "2 teaspoons vanilla extract",
        "1 teaspoon light corn syrup",
        "1 cup confectioners' sugar",
        "3 tablespoons heavy whipping cream, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Overnight Burnt-Butter Cinnamon Rolls",
    "url": "http://allrecipes.com/recipe/241916/overnight-burnt-butter-cinnamon-rolls/"
}
