{
    "directions": [
        "For the dough: in the bowl of a stand mixer with the whisk attachment, whisk the egg yolks, whole egg, sugar, butter, and buttermilk. Add approximately 2 cups of the flour along with the yeast and salt; whisk until moistened and combined. Remove the whisk attachment and replace with a dough hook. Add all but 3/4 cup of the remaining flour and knead on low speed for 5 minutes. Check the consistency of the dough, add more flour if necessary; the dough should feel soft and moist but not sticky. Knead on low speed 5 minutes more or until the dough clears the sides of the bowl. Turn the dough out onto a lightly floured work surface; knead by hand about 30 seconds. Lightly oil a large bowl. Transfer the dough to the bowl, lightly oil the top of the dough, cover and let double in volume, 2 to 2 1/2 hours.",
        "Combine the brown sugar, cinnamon and salt in a medium bowl. Mix until well incorporated. Set aside until ready to use.",
        "Butter a 9 by 13-inch glass baking dish. Turn the dough out onto a lightly floured work surface. Gently shape the dough into a rectangle with the long side nearest you. Roll into an 18 by 12-inch rectangle. Brush the dough with the 3/4-ounce of melted butter, leaving 1/2-inch border along the top edge. Sprinkle the filling mixture over the dough, leaving a 3/4-inch border along the top edge; gently press the filling into the dough. Beginning with the long edge nearest you, roll the dough into a tight cylinder. Firmly pinch the seam to seal and roll the cylinder seam side down. Very gently squeeze the cylinder to create even thickness. Using a serrated knife, slice the cylinder into 1 1/2-inch rolls; yielding 12 rolls. Arrange rolls cut side down in the baking dish; cover tightly with plastic wrap and store in the refrigerator overnight or up to 16 hours.",
        "Remove the rolls from the refrigerator and place in an oven that is turned off. Fill a shallow pan 2/3-full of boiling water and set on the rack below the rolls. Close the oven door and let the rolls rise until they look slightly puffy; approximately 30 minutes. Remove the rolls and the shallow pan of water from the oven.",
        "Preheat the oven to 350 degrees F.",
        "When the oven is ready, place the rolls on the middle rack and bake until golden brown, or until the internal temperature reaches 190 degrees F on an instant-read thermometer, approximately 30 minutes.",
        "While the rolls are cooling slightly, make the icing by whisking the cream cheese in the bowl of a stand mixer until creamy. Add the milk and whisk until combined. Sift in the powdered sugar, and whisk until smooth. Spread over the rolls and serve immediately."
    ],
    "ingredients": [
        "4 large egg yolks, room temperature",
        "1 large whole egg, room temperature",
        "2 ounces sugar, approximately 1/4 cup",
        "3 ounces unsalted butter, melted, approximately 6 tablespoons",
        "6 ounces buttermilk, room temperature",
        "20 ounces all-purpose flour, approximately 4 cups, plus additional for dusting",
        "1 package instant dry yeast, approximately 2 1/4 teaspoons",
        "1 1/4 teaspoons kosher salt",
        "Vegetable oil or cooking spray",
        "8 ounces light brown sugar, approximately 1 cup packed",
        "1 tablespoon ground cinnamon",
        "Pinch salt",
        "3/4-ounce unsalted butter, melted, approximately 1 1/2 tablespoons",
        "2 1/2 ounces cream cheese, softened, approximately 1/4 cup",
        "3 tablespoons milk",
        "5 1/2 ounces powdered sugar, approximately 1 1/2 cups"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cinnamon Roll",
        "Bread",
        "Buttermilk",
        "Dairy Recipes",
        "Egg Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Brunch"
    ],
    "title": "Overnight Cinnamon Rolls",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/overnight-cinnamon-rolls-recipe"
}
