{
    "directions": [
        "Warm the milk in a small saucepan until it bubbles, then remove from heat.  Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.",
        "In a large bowl, combine yeast mixture, milk, sugar, oil, baking powder, salt, egg and 3 cups flour. Beat until smooth. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Heat brown sugar and 1/2 cup butter until melted. Remove from heat; stir in corn syrup. Divide mixture between two 9x13 inch baking pans. Sprinkle 1/2 cup pecans in each pan.",
        "When dough has doubled in size, punch down and turn out onto a lightly floured surface. Roll out into a large rectangle and spread with butter. Sprinkle with sugar and cinnamon. Starting with the long side, roll up the rectangle into a log, and slice into 1 inch wide rolls. Place the rolls slightly apart in pans. Wrap pans with aluminum foil and refrigerate at least 12 hours but no longer than 48.",
        "Remove rolls from refrigerator and let stand in a warm place until doubled in size, about 30 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).",
        "Bake uncovered in preheated oven until golden 30 to 35 minutes. Immediately invert pan on heatproof serving plate. Wait for 1 or 2 minutes before removing pan, so that caramel drizzles over rolls."
    ],
    "ingredients": [
        "2 cups milk",
        "2 (.25 ounce) packages active dry yeast",
        "1/2 cup warm water",
        "1/3 cup white sugar",
        "1/3 cup vegetable oil",
        "1 tablespoon baking powder",
        "2 teaspoons salt",
        "1 egg",
        "7 cups all-purpose flour",
        "1 cup packed brown sugar",
        "1/2 cup butter",
        "2 tablespoons light corn syrup",
        "1 cup pecan halves",
        "1/4 cup butter, softened",
        "1/2 cup white sugar",
        "1 1/2 tablespoons ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Overnight Caramel Pecan Rolls",
    "url": "http://allrecipes.com/recipe/24574/overnight-caramel-pecan-rolls/"
}
