{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over medium-high heat. Sprinkle oxtails with salt and pepper. Add oxtails to pot and brown on all sides, about 20 minutes. Add 10 cups water, beef broth and 2 cups wine. Bring to simmer. Reduce heat to medium-low. Cover partially and simmer gently until meat is tender, stirring occasionally, about 3 hours.",
        "Using tongs, transfer oxtails to large bowl. Carefully pour cooking liquid into 8-cup glass measuring cup or large bowl. Freeze cooking liquid until fat separates from liquid, about 45 minutes. Spoon fat from top of cooking liquid. Remove meat from oxtails; discard bones. Add meat to cooking liquid. (Can be made 1 day ahead. Cover and chill.)",
        "Heat 3 tablespoons oil in same pot over medium-high heat. Add onions, leeks, carrots, parsnips, garlic, thyme and bay leaf. Sauté until vegetables are golden, about 12 minutes. Add cooking liquid with meat and remaining 1 cup wine. Bring to boil. Add potatoes. Cover and simmer until potatoes are tender, stirring occasionally, about 20 minutes.",
        "Add parsley to soup. Season to taste with salt and pepper. Ladle into bowls."
    ],
    "ingredients": [
        "5 tablespoons vegetable oil",
        "31/4 pounds meaty oxtails (about seven 3-inch segments), patted dry",
        "10 cups water",
        "5 14 1/2-ounce cans beef broth",
        "3 cups dry red wine",
        "2 medium onions, chopped",
        "2 medium leeks (white and pale green parts only), chopped",
        "3 medium carrots, peeled, very finely chopped",
        "2 medium parsnips, peeled, cut into 1/2-inch cubes",
        "6 garlic cloves, minced",
        "1 teaspoon dried thyme",
        "1 bay leaf",
        "2 large russet potatoes, peeled, cut into 1/2-inch cubes",
        "1/3 cup finely chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Vegetable",
        "Red Wine",
        "Fall"
    ],
    "title": "Oxtail Soup with Red Wine and Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/oxtail-soup-with-red-wine-and-root-vegetables-102123"
}
