{
    "directions": [
        "Trim any excess fat from the oxtail pieces. Combine the oxtail with the brandy and lime juice in a large bowl and marinate for at least 2 hours and up to overnight in the refrigerator.",
        "Preheat the oven to 350 degrees F. Remove the oxtail from the marinade, rub all over with the oil and season with salt and pepper. In a large heavy-bottomed pan, cook the oxtail in the oven, uncovered, until brown, about 30 minutes. Add the red wine and cook uncovered for 15 minutes more.",
        "Combine the beef broth, tomato paste, garlic powder, herbes de Provence, Italian seasoning, paprika, lemon pepper, cumin, garlic pepper, nutmeg and sage in a bowl. Add to the oxtail and mix well. Cover and cook until the meat is almost tender, about 1 hour 30 minutes. Add the celery, carrots and potatoes and cook until the meat is fully tender and the vegetables are done, 15 to 20 minutes. Remove from the oven and skim any excess fat from the top using a flat wide-bottomed spoon.",
        "Combine the cornstarch with 1 cup cold water in a small bowl, stirring until the cornstarch is fully dissolved. Stir the cornstarch into the stew and cook until thickened, 15 to 20 minutes. Season with salt and pepper to taste. Ladle into bowls and serve."
    ],
    "ingredients": [
        "3 to 4 pounds oxtail pieces",
        "1/2 cup brandy",
        "Juice of 3 limes",
        "2 tablespoons extra-virgin olive oil",
        "Kosher salt and black pepper",
        "2 to 3 cups red wine",
        "2 to 3 cups beef broth",
        "3 tablespoons tomato paste",
        "1 1/2 tablespoons garlic powder",
        "1 tablespoon herbes de Provence",
        "1 tablespoon Italian seasoning",
        "1 tablespoon paprika",
        "1 1/2 teaspoons lemon pepper",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon garlic pepper seasoning",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon dried sage",
        "4 ribs celery, cut in 1-inch pieces",
        "3 large carrots, cut in 1 1/2-inch pieces",
        "3 large russet potatoes, peeled and cut in 1 1/2-inch pieces",
        "1 tablespoon cornstarch"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Stew Recipes",
        "Vegetable",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Oxtail Stew",
    "url": "http://www.foodnetwork.com/recipes/oxtail-stew"
}
