{
    "directions": [
        "Toss oxtails, flour, pepper, 2 Tbsp. or 1 Tbsp. salt in a large bowl until oxtails are evenly coated. Heat oil in a large heavy pot over medium-high. Working in batches, cook oxtails in a single layer, turning occasionally, until browned all over, 15–20 minutes. Transfer oxtails to a plate as they’re done.",
        "Cook onion, carrots, celery, garlic, and rosemary in same pot, stirring often, until vegetables are browned around edges, 10–15 minutes. Add wine, tomatoes, vinegar, and honey, stirring and scraping up browned bits; bring to a boil. Season with several generous pinches of salt and return oxtails to pot. Pour in water just to cover oxtails; bring to a gentle simmer. Partially cover and cook, reducing heat as needed to keep at a bare simmer, until meat is falling off the bone, 3–3 1/2 hours. Let cool; cover and chill at least 12 hours.",
        "Line a 13x9\" baking dish with parchment paper, leaving overhang on 2 sides. Bring milk, butter, and several pinches of salt to a simmer in a large saucepan over medium. Gradually whisk in semolina and cook, whisking, until very thick and bubbling, about 3 minutes. Remove from heat; add 1 cup Parmesan and whisk until smooth. Whisk in egg yolk and scrape gnocchi mixture into prepared pan; smooth top. Cover and chill until set, at least 2 hours and up to 12 hours.",
        "Meanwhile, remove ragù from fridge and skim fat from surface. Warm ragù over low until heated through, then transfer oxtails to a plate. Increase heat to medium and bring braising liquid to a simmer. Cook until reduced to the consistency of gravy, 5–10 minutes. Taste and season with more salt if needed. Pick meat from bones and shred into small pieces. Return meat to ragù; discard bones. Transfer 2 cups ragù to an airtight container and save for later. Cover pot; keep remaining ragù warm over low heat.",
        "Turn out gnocchi mixture onto a clean surface and remove parchment paper; slice into about 1\" squares.",
        "Heat oil in a large nonstick skillet over medium. Add half of gnocchi to skillet, arrange in a single layer, and cook, undisturbed, until browned and crisp underneath, about 3 minutes. Toss to turn and cook until other side is browned and crisp, about 2 minutes. Spoon into pot with ragù. Repeat with remaining gnocchi. Gently toss gnocchi in ragù; season with more salt if needed. Divide among bowls; top with parsley and more Parmesan.",
        "Ragù can be made 2 days ahead. Cover and chill, or freeze up to 4 weeks."
    ],
    "ingredients": [
        "5 pounds oxtails, cut crosswise into pieces",
        "1/4 cup all-purpose flour",
        "2 teaspoons freshly ground black pepper",
        "2 tablespoons Diamond Crystal or 1 tablespoon Morton kosher salt, plus more",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "2 large carrots, peeled, chopped",
        "2 celery stalks, chopped",
        "1 head of garlic, cloves separated, smashed",
        "4 sprigs rosemary",
        "1 (750-ml) bottle red wine",
        "1 (15-ounce) can crushed tomatoes",
        "1/4 cup red wine vinegar or Sherry vinegar",
        "1 tablespoon honey",
        "3 cups whole milk",
        "2 tablespoons unsalted butter",
        "Kosher salt",
        "1 cup fine-grind semolina flour",
        "1 cup finely grated Parmesan, plus more for serving",
        "1 large egg yolk",
        "2 tablespoons olive oil",
        "1/4 cup finely chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Meat",
        "Pasta",
        "Garlic",
        "Red Wine",
        "Tomato",
        "Vinegar",
        "Parmesan",
        "Dinner",
        "Winter"
    ],
    "title": "Oxtail Ragù With Semolina Gnocchi",
    "url": "http://www.epicurious.com/recipes/food/views/oxtail-ragu-with-semolina-gnocchi"
}
