{
    "directions": [
        "Soak the tapioca in 1 cup of the milk for 1 hour. (Setting it in a warm place will speed up the rehydration of the pearls.)",
        "Shuck the oysters. Trim away the muscle and the outer ruffled edge of each oyster and place the trimmings in a saucepan. Reserve the whole trimmed oysters and strain the oyster juice into a separate bowl. You should have about 1/2 cup of juice.",
        "In a bowl, whip 1/2 cup of the cream just until it holds its shape; reserve in the refrigerator.",
        "Drain the softened tapioca in a strainer and discard the milk. Rinse the tapioca under cold running water, then place it in a small heavy pot.",
        "Pour the remaining 3/4 cup milk and 3/4 cup cream over the oyster trimmings. Bring to a simmer, then strain the infused liquid onto the tapioca. Discard the trimmings.",
        "Cook the tapioca over medium heat, stirring constantly with a wooden spoon, until it has thickened and the spoon leaves a trail when it is pulled through, 7 to 8 minutes. Continue to cook for another 5 to 7 minutes, until the tapioca has no resistance in the center and is translucent. The mixture will be sticky and if you lift some on the spoon and let it fall, some should still cling to the spoon. Remove the pot from the heat and set aside in a warm place.",
        "Place the egg yolks and the 1/4 cup oyster juice in a metal bowl set over a pan of hot water. Whisk vigorously over medium heat for 2 to 3 minutes to incorporate as much air as possible. The finished sabayon will have thickened and lightened, the foam will have subsided, and the sabayon will hold a ribbon when it falls from the whisk. If the mixture begins to break, remove it from the heat and whisk quickly off the heat for a moment to recombine, then return to the heat.",
        "Stir the hot sabayon into the tapioca, along with a generous amount of black pepper. Mix in the crème fraîche and the whipped cream. The tapioca will be a creamy pale yellow with the tapioca pearls suspended in the mixture. Season lightly with salt, remembering that the oysters and the caviar garnish will both be salty. Immediately spoon 1/4 cup tapioca into each of eight 4- by 5- inch gratin dishes (with a 3- to 4- ounce capacity). Tap the gratin dishes on the counter so that the tapioca forms an even layer. Cover and refrigerate until ready to use, or for up to a day.",
        "Preheat the oven to 350º F.",
        "Combine the vermouth, the remaining reserved oyster juice, the shallots, and vinegar in a small saucepan. Bring to a simmer and simmer until most of the liquid has evaporated but the shallots are glazed, not dry. Whisk in the butter piece by piece, adding a new piece only when the previous one is almost incorporated.",
        "Meanwhile, place the dishes of tapioca on a baking sheet and heat in the oven for 4 to 5 minutes, or until they just begin to puff up.",
        "Add the oysters and the chives to the sauce to warm through.",
        "Spoon 2 oysters and some of the sauce over each gratin and garnish the top with a quenelle, or small oval scoop, of caviar. Serve immediately."
    ],
    "ingredients": [
        "1/3 cup small pearl tapioca",
        "1 3/4 cups milk",
        "16 meaty oysters, such as Malpeque, scrubbed with a brush",
        "1 1/4 cups heavy cream",
        "Freshly ground black pepper",
        "1/4 cup crème fraîche",
        "Kosher salt",
        "4 large egg yolks",
        "1/4 cup reserved oyster juice (from above)",
        "3 tablespoons dry vermouth",
        "Remaining reserved oyster juice (from above)",
        "1 1/2 tablespoons minced shallots",
        "1 1/2 tablespoons white wine vinegar",
        "8 tablespoons (4 ounces) unsalted butter, cut into 8 pieces",
        "1 tablespoon minced chives",
        "1 to 2 ounces osetra caviar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Shellfish",
        "Cocktail Party",
        "Oscars",
        "New Year's Eve",
        "Oyster",
        "Fortified Wine",
        "Tapioca"
    ],
    "title": "Oysters and Pearls",
    "url": "http://www.epicurious.com/recipes/food/views/oysters-and-pearls-105859"
}
