{
    "directions": [
        "Preheat oven to 350°. Combine broth, sage sprig, and rosemary sprig in a small saucepan; bring to a boil. Remove pan from heat and let stock steep until ready to use.",
        "Meanwhile, heat a large skillet over medium heat and cook sausage, breaking it up with a spoon, until cooked through, 7-8 minutes. Using a slotted spoon, transfer sausage to a large bowl, leaving any rendered fat in pan.",
        "Melt butter in skillet; add onions and celery and cook until softened, about 10 minutes. Add onion mixture, sliced sage, parsley, and thyme to bowl with sausage. Mix well; season with salt and pepper. Add oysters with liquor, reserved broth (sprigs removed), and eggs; toss to combine. Add cornbread; toss until well blended and cornbread absorbs most of liquid.",
        "Spoon stuffing into a 3-quart baking dish. If any liquid remains in bowl, drizzle 1/4 to 1/2 cup over to moisten cornbread (amount varies depending on dryness of cornbread). Bake until browned and liquid is absorbed, 1 hour-1 hour 15 minutes, tenting with foil if top gets too dark."
    ],
    "ingredients": [
        "2 cups low-salt chicken broth",
        "1 sprig sage plus 1 tablespoon thinly sliced sage leaves",
        "1 sprig rosemary",
        "1 pound breakfast sausage, casings removed",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 medium onions, finely chopped",
        "1 1/2 cups finely chopped celery",
        "1/4 cup finely chopped flat-leaf parsley",
        "2 tablespoons finely chopped fresh thyme",
        "Kosher salt, freshly ground pepper",
        "4 dozen small shucked oysters in their liquor (about 1 cup liquor)",
        "4 large eggs, whisked",
        "12 cups savory (not sweet) cornbread cut into 3/4\" cubes, stale or toasted in a 300° oven until dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Side",
        "Bake",
        "Thanksgiving",
        "Dinner",
        "Stuffing/Dressing",
        "Sausage",
        "Oyster",
        "Fall",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Oyster-Cornbread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/oyster-cornbread-stuffing-368297"
}
