{
    "directions": [
        "Preheat oven to 325°F. Place bread on baking sheet. Bake until beginning to dry, about 12 minutes. Cool completely. (Can be prepared 1 day ahead. Cover bread and store at room temperature.)",
        "Butter 11x7x2-inch baking dish. Melt 4 tablespoons butter in large pot over medium-high heat. Add mushrooms and sauté until mushroom liquid evaporates and mushrooms are beginning to brown, about 8 minutes. Transfer to large bowl. In same pot, melt 4 tablespoons butter over medium-high heat. Add celery and cook until softened, about 4 minutes. Add leeks; cook until vegetables are tender, about 4 minutes longer. Add sautéed vegetables, parsley and dried herbs to mushrooms; toss. Season with salt and pepper.",
        "Add bread cubes and oysters to vegetables in bowl; stir to combine. Mix in reserved 1/2 cup oyster juices and Turkey Stock. Season with salt and pepper. Use 9 cups stuffing for turkey. Transfer remaining stuffing to prepared baking dish; cover with foil and chill until ready to bake. Bake stuffing, covered, at 325°F, until heated through, about 45 minutes."
    ],
    "ingredients": [
        "1 pound sliced firm white sandwich bread, cut into 3/4-inch cubes (about 10 cups)",
        "8 tablespoons (1 stick) butter",
        "1 pound shiitake mushrooms, stemmed, caps cut into 1/4-inch slices",
        "3 large celery stalks with leaves, chopped",
        "3 medium leeks (white and pale green parts only), chopped (about 3 cups)",
        "1/3 cup chopped fresh parsley",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1 teaspoon crumbled dried sage leaves",
        "2 8-ounce jars shucked oysters, drained, 1/2 cup juices reserved, oysters cut into 3/4-inch pieces",
        "1 cup Turkey Stock or canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Oyster",
        "Celery",
        "Leek",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Oyster Stuffing with Shiitake Mushrooms and Leeks",
    "url": "http://www.epicurious.com/recipes/food/views/oyster-stuffing-with-shiitake-mushrooms-and-leeks-104283"
}
