{
    "directions": [
        "Preheat the oven to 500 degrees F. Moisten the breadcrumbs with a little bit of olive oil.",
        "Shuck the oysters: There is a top flat \"lid\" and a bottom cupped shell for each oyster. Insert the tip of an oyster knife into the hinge where the two shells come together in a point. Twist until the lid pops open. Pull the knife out and wipe it clean so you don't get mud in the oyster. Insert the knife back into the oyster from the opposite side of the hinge, lightly scraping against the top shell to disconnect the muscle. Then go under the oyster to cut the muscle on the bottom. Flip the oyster over onto the prettier side.",
        "Top each oyster with a teaspoon of the creamed spinach, a piece of bacon and a bit of the breadcrumbs. On a baking sheet, create a small mound of coarse salt for each oyster to prevent them from tipping over. Nestle the oysters in the salt mounds, and bake until the bacon is cooked and the breadcrumbs browned.",
        "Transfer the baked oysters to a serving platter and garnish with a sprinkle of fennel pollen. If desired, garnish with grated horseradish and a drizzle of smoked olive oil. Serve with lemon wedges.",
        "Bring a large pot of generously salted water to a boil. Add the spinach. As soon as it's wilted and tender, drain and run under cold water. When the spinach is cool enough to handle, squeeze out any excess water. If you have used whole spinach with long stems, roughly chop it; you should have 1 1/2 cups of chopped spinach.",
        "Finely mince the fennel and onion. Heat a medium saute pan over medium heat and glaze it with the olive oil. Add the fennel, onion, garlic and a few pinches of salt, and cook until the onion is translucent; you don't want it to brown. Add the flour and stir. When the flour has gathered up all the onion mixture, add the Herbsaint and bring to a boil. Let it reduce by half before stirring in the milk to make a bechamel. Season to taste with salt and pepper. Cook at a low simmer until the sauce thickens to the point where it coats the back of a spoon, and where drawing your finger down the spoon leaves a clear line.",
        "Pour half of the bechamel into a blender along with 1/2 cup of the spinach. Blend until completely smooth. Add the remaining spinach to the pan with the remaining bechamel, then add the spinach puree. Heat, stirring, and season with salt and pepper. Finish by stirring in the butter, nutmeg and Parmesan."
    ],
    "ingredients": [
        "1/4 cup panko breadcrumbs",
        "Extra-virgin olive oil",
        "12 medium, sweet and briny oysters, such as Kumamoto",
        "1/4 cup Double-Creamed Spinach, recipe follows",
        "3 slices bacon, cut into 1 1/2-inch pieces",
        "Coarse salt, for baking sheet",
        "Fennel pollen, for garnish",
        "Fresh horseradish, grated, optional",
        "Smoked olive oil, optional",
        "3 lemons, cut into wedges",
        "3/4 pound fresh spinach, cleaned",
        "Kosher salt and freshly ground black pepper",
        "1/2 fennel bulb",
        "1/2 large onion",
        "3/4 teaspoon extra-virgin olive oil",
        "1 clove garlic, minced",
        "1 1/2 tablespoons flour",
        "2 tablespoons Herbsaint",
        "1/2 cup whole milk",
        "1 tablespoon butter",
        "1/4 teaspoon grated nutmeg",
        "2 to 3 tablespoons freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bacon Recipes",
        "Meat",
        "Oyster Recipes",
        "Shellfish Recipes",
        "Spinach",
        "Vegetable",
        "Appetizer"
    ],
    "title": "Oysters Rockefeller",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/oysters-rockefeller"
}
