{
    "directions": [
        "1. Add 1 tablespoon oil to a large cast-iron skillet over medium-low heat. Add the shrimp and cook them on both sides until they are pink and completely opaque and cooked through, about 5 minutes. Remove the shrimp from the pan and set them aside in a bowl. (If you're substituting tempeh, thaw if frozen, then place in a large cast-iron skillet with half the coconut oil over medium heat. Use a wooden spoon to break the tempeh brick apart into small pieces and fry them until cooked through and some pieces are crispy, 5 to 8 minutes. Set aside.)",
        "2. Increase the heat to medium, add 1 more tablespoon oil, and sauté the chopped onion for 2 minutes, until softened but not browned. Add the garlic and ginger. Stir continuously to make sure the garlic does not burn. After 2 minutes, add the mushrooms and sauté until the mushrooms are softened. Add the soy sauce, sriracha, and sesame oil (if using) and stir to combine. Add the snow peas, kale, and carrot and cook until the kale is slightly wilted, about 3 minutes. Add remaining tablespoon of oil and the rice and toss in the pan until the rice is heated through. Chop the shrimp into bite-size pieces and add them to the rice mixture.",
        "3. In a small bowl, whisk the eggs. Push the rice to one side of the pan and pour the eggs onto the pan surface, moving them with a spatula to scramble and cook. Stir the cooked egg throughout the rice. Drizzle the rice with the vinegar, mirin, and syrup and give it a final toss before serving with a sprinkle of salt and pepper, sesame seeds, and thinly sliced scallions."
    ],
    "ingredients": [
        "3 tablespoons organic coconut oil, softened",
        "1 pound medium shrimp, cleaned and deveined, or one 8-ounce package tempeh",
        "1 medium yellow onion, chopped",
        "6 garlic cloves, peeled and minced",
        "1 tablespoon minced fresh peeled ginger",
        "1 cup sliced shiitake mushrooms (3 ounces)",
        "1/3 cup low-sodium soy sauce or tamari",
        "2 tablespoons sriracha chile sauce",
        "2 tablespoons toasted sesame oil (optional)",
        "1 cup snow peas",
        "2 cups chiffonade-cut kale (long strips)",
        "1 large carrot, peeled and shredded",
        "4 cups cooked short-grain brown rice (day old is best)",
        "3 eggs",
        "2 tablespoons rice wine vinegar",
        "2 tablespoons mirin",
        "2 tablespoons pure maple syrup",
        "Sea salt and fresh-cracked black pepper",
        "2 scallions (white and light green parts), sliced thin",
        "4 tablespoons toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Shellfish",
        "Soy",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Seafood",
        "Shrimp",
        "Healthy",
        "Potluck",
        "Sesame",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Oz Family Stir-Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/oz-family-stir-fried-rice-51169000"
}
