{
    "directions": [
        "Stir the sugar and yeast into the warm water. Let sit for 10 minutes, until foamy. Combine the whole-wheat flour, all-purpose flour, and salt. Add the yeast mixture, mix well, and let sit in a warm place for 30 minutes.",
        "Combine the walnuts, goat cheese, honey, and orange-blossom water.",
        "Combine the sugar and water in a saucepan over medium heat, and heat, stirring, until the sugar is dissolved. Add the corn syrup and cinnamon and continue to cook, stirring, until thickened, 7 to 10 minutes. Remove from the heat and stir in the orange-blossom water.",
        "Butter a large griddle, and set it over low heat. Fill a frying pan with 1 inch of oil, and set it over medium heat. Line plates with paper towels for draining the fried cakes.",
        "Drop a small piece of bread into the oil; when it browns, the oil is ready for frying. Pour the batter onto the buttered griddle in 4- to 5-inch round cakes. When bubbles form in the tops of the cakes, transfer the cakes to a plate (do not flip them). Spread 1 1/2 tablespoons of the walnut-cheese filling on each cake, on the uncooked side. Fold the cake in half and press the edges together to seal.",
        "Drop the cakes into the hot oil in the frying pan. Fry the cakes for 15 to 20 seconds, or until golden on one side, then flip them and cook until the other side is golden. Drain on paper towels.",
        "Transfer the cakes to serving plates, and serve with the syrup.",
        "Palestinian Coconut Qatayef Replace the goat cheese with unsweetened shredded coconut and the orange-blossom water with lemon juice."
    ],
    "ingredients": [
        "1 teaspoon sugar",
        "1/2 teaspoon active dry yeast",
        "1 1/4 cups warm water",
        "2 1/2 cups whole-wheat flour",
        "1/2 cup all-purpose flour",
        "1/8 teaspoon salt",
        "Vegetable oil for frying",
        "1 cup chopped walnuts",
        "1 cup goat cheese",
        "2 tablespoons honey",
        "1 tablespoon orange-blossom water",
        "1 cup sugar",
        "1/4 cup water",
        "3/4 cup light corn syrup",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons orange-blossom water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Fry",
        "Ramadan",
        "Goat Cheese",
        "Walnut",
        "Pan-Fry",
        "Honey",
        "Cinnamon",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Qatayef",
    "url": "http://www.epicurious.com/recipes/food/views/qatayef-366170"
}
