{
    "directions": [
        "Combine dry ingredients in food processor and pulse several times. Place chilled butter, cut into pieces, into food processor and pulse until a crumb-like substance appears. Add water and pulse until a ball begins to form. Form into a flattened patty, cover with plastic wrap and refrigerate for one hour.",
        "Roll out dough on a well floured surface, place in a 10-inch quiche pan and chill for 30 minutes. Blind bake in a 375° F oven for 20-25 minutes until edges are slightly colored. Allow to cool to room temperature.",
        "Lightly rub onions with olive oil, season with salt and pepper and roast in 400° oven soft (about 25 minutes). Allow to cool and cut into small pieces. Sauté artichoke hearts in olive oil and season with salt and pepper. Allow to cool. Sauté zucchini for 45 seconds in olive oil and season with salt and pepper. Allow to cool on a large plate to avoid overcooking them. Sauté portobello mushroom in a very hot pan with olive olive oil so that the mushrooms sear and keep in the natural juices. As all of the ingredients are cooling, combine eggs, milk, cream and seasoning into a bowl and incorporate with a whisk.",
        "Assemble the quiche by layering each vegetable, one on top of the other, in the pie crust. Use the asparagus tips as garnish for the top of the quiche by placing them in a pinwheel around the dish. Add egg/cream filling so that it stops just before covering the asparagus. Bake in a preheated 350° for about 30 minutes or until filling sets and top of quiche is lightly browned. Allow to cool 10 minutes before serving.",
        "Combine wine, water, peppercorns and allspice into a pot and bring to a boil. Allow to simmer for 5 minutes. Place tuna in a pot and cook for 3-5 minutes (the tuna will cook very quickly). Remove tuna from bouillon and allow to cool.",
        "Slice the quiche into wedges. Using a ring 1 1/2 to 2 inches in diameter, layer the small dice of tomato in the ring. Place several pieces of the tuna on top of the tomato, add several capers, place quiche on plate and remove the ring. Garnish with watercress and chive. With the reverie realized, you can now envision your guests as the royal family — what's left of it."
    ],
    "ingredients": [
        "1 1/4 cup all-purpose flour",
        "1 stick unsalted chilled butter",
        "1/4 tablespoon salt",
        "4 tablespoons ice water",
        "3 spring onions (tops of)",
        "2 medium artichokes, turned and sliced in eighths",
        "2 green zucchini, core removed, quatered and sliced thin",
        "1 medium portobello mushroom, sliced in eighths",
        "2 tomatoes skin off, seeded and large dice",
        "6 asparagus tips, blanched, shocked and split in half lengthwise",
        "1 cup whole milk",
        "1/2 cup heavy cream",
        "3 medium eggs",
        "salt, pepper and nutmeg to taste",
        "1 lpound fresh tuna, cut in small, uniform pieces",
        "1 cup white wine",
        "1 cup water",
        "1 teaspoon whole black peppercorns",
        "3 allspice berries",
        "4 tomatoes peeled, seeded and small dice",
        "3 tablespoons capers",
        "1 bunch watercress",
        "fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Egg",
        "Mushroom",
        "Bake",
        "Tuna",
        "Artichoke",
        "Asparagus",
        "Zucchini"
    ],
    "title": "Queen Elizabeth's Favorite Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/queen-elizabeths-favorite-quiche-6001"
}
