{
    "directions": [
        "Mix tomato, chile, and oregano in a small bowl. Season with salt; let salsa stand for 30 minutes. Meanwhile, toss both cheeses with flour in a medium bowl. Cook chorizo in a medium saucepan over medium heat, breaking up with a wooden spoon, until it begins to render, about 1 minute. Add onion and continue cooking until chorizo is cooked and onion is soft and translucent, about 5 minutes.",
        "Transfer chorizo mixture to a small bowl; return saucepan to heat. Add beer; simmer, stirring occasionally and scraping up any browned bits. Whisking constantly, add cheese mixture a 1/4-cupful at a time, allowing it to become blended and smooth between additions. Stir in chorizo mixture. DO AHEAD: Queso can be made 30 minutes ahead. Let stand at room temperature.",
        "To reheat, warm skillet with queso fundido over medium heat; stir until melted and bubbly.",
        "Using a slotted spoon, spoon salsa over queso. Serve in skillet with a basket of tortilla chips on the side."
    ],
    "ingredients": [
        "1 small tomato, chopped",
        "1 serrano chile, seeded, chopped",
        "2 tablespoons chopped fresh oregano",
        "Kosher salt",
        "8 ounces coarsely grated mild yellow cheddar",
        "8 ounces coarsely grated Monterey Jack",
        "1 tablespoon all-purpose flour",
        "1 4-ounce link fresh chorizo or hot Italian sausage, casing removed",
        "1/2 cup minced onion",
        "1/2 cup lager",
        "Tortilla chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Cheese",
        "Tomato",
        "Appetizer",
        "Bake",
        "Cinco de Mayo",
        "Cheddar",
        "Sausage",
        "Party",
        "Monterey Jack",
        "Chile Pepper",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Queso Fundido",
    "url": "http://www.epicurious.com/recipes/food/views/queso-fundido-51117480"
}
