{
    "directions": [
        "Combine first 11 ingredients in heavy medium skillet. Cook over medium-high heat until chicken is cooked through, stirring occasionally, about 5 minutes. Transfer mixture to processor; grind coarsely. Transfer to medium bowl. Mix in breadcrumbs. Season filling to taste with salt and pepper. Refrigerate filling until cold, about 1 hour. (Can be made 1 day ahead. Cover and keep refrigerated.)",
        "Line baking sheet with foil; sprinkle with flour. Place gyoza wrappers on work surface. Lightly brush edge of each wrapper with beaten egg. Place heaping 1 teaspoon filling in center of each gyoza wrapper. Fold gyoza wrapper in half and crimp edges with tines of fork to seal. Transfer empanadas to prepared baking sheet. (Can be prepared 6 hours ahead. Cover empanadas and refrigerate.)",
        "Heat canola oil in heavy medium skillet over medium-high heat. Working in batches, add empanadas to oil and fry until golden brown, about 30 seconds per side. Drain empanadas on paper towels. Serve warm.",
        "*Gyoza wrappers can be found at Asian markets and in the refrigerator section of many supermarkets. If unavailable, substitute wonton wrappers and cut into 3 1/2-inch rounds."
    ],
    "ingredients": [
        "8 ounces skinless boneless chicken breast halves, cut into 1/2-inch cubes",
        "1/4 cup chopped onion",
        "1/4 cup chopped red bell pepper",
        "1/4 cup chopped tomato",
        "1/4 cup water",
        "2 tablespoons raisins",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon tomato paste",
        "1 tablespoon chopped pimiento-stuffed green olives",
        "1 garlic clove, minced",
        "1/2 teaspoon ground cumin",
        "2 tablespoons dry breadcrumbs",
        "36 gyoza (potsticker) wrappers*",
        "1 large egg, lightly beaten",
        "2 cups (about) canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Poultry",
        "Appetizer",
        "Quick & Easy",
        "Winter",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quick Chicken and Olive Empañadas",
    "url": "http://www.epicurious.com/recipes/food/views/quick-chicken-and-olive-empanadas-1041112"
}
