{
    "directions": [
        "Heat a large skillet over medium-high heat.  Place 1/2 cup of flour in a heavy plastic bag or large bowl; add the ribs and toss until completely coated.  Pour the oil into the preheated pan, heat until shimmering.  Shake any excess flour off of the ribs, then add them to the hot oil.  Brown well on all sides without burning, about 10 minutes.",
        "While the ribs are browning, stir together the hot water and bouillon cubes in a pressure cooker until dissolved.  Using tongs, remove the ribs from the skillet, and place into the pressure cooker.  Seal according to manufacturer's directions and cook for 25 minutes.",
        "After 25 minutes, release pressure, and open cooker according to manufacturer's directions.  Pour in the canned tomatoes, garlic, onion, and carrots.  Simmer, uncovered until the vegetables are tender, about 20 minutes. Meanwhile, cook the diced potatoes in enough water to cover until tender, about 20 minutes.",
        "Remove the meat to a serving platter. Stir together 3 tablespoons of flour with 1 cup of water.  Stir into the vegetables, and cook until the sauce thickens, about 5 minutes.",
        "Drain the cooked potatoes, and add to the stew along with the can of peas. Heat until warmed through, then season to taste with salt and pepper."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour for coating",
        "4 pounds beef short ribs",
        "2 tablespoons canola or vegetable oil",
        "1 cup hot water",
        "2 cubes beef bouillon",
        "1 (28 ounce) can diced or stewed tomatoes",
        "2 cloves garlic, thinly sliced",
        "2 medium onions, chopped",
        "6 medium carrots, peeled and sliced",
        "6 medium potatoes, peeled and cubed",
        "3 tablespoons all-purpose flour, dissolved in",
        "1 cup water",
        "1 (15 ounce) can peas, with liquid",
        "Salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Quick Short Rib Stew",
    "url": "http://allrecipes.com/recipe/101733/quick-short-rib-stew/"
}
