{
    "directions": [
        "Sliver the basil",
        "Preheat an oven to 200°F and place a serving bowl in the oven to warm. Working in 2 batches, stack the basil leaves on top of one another. Roll the stack of leaves lengthwise as tightly as possible into a cylinder. Using a chef's knife, cut the leaves crosswise, which will create thin slivers. These slivers are known as a chiffonade. Measure out 2 Tbs. of the slivered basil. Set aside.",
        "Prepare the onions",
        "Red onion shoots are treated just like green onions. Using the chef's knife, trim off the root ends and tough green tops of the onions. Line up the onions and cut the red (or white) parts and about 1 inch of the tender green parts crosswise into thin slices. Reserve the remaining green parts for another use.",
        "Shell the peas",
        "Remove the peas from their pods, or shell them, just before cooking so that they don't dry out. Have ready a bowl. Working with 1 pod at a time, pinch the tip at each end to begin splitting the pod. Squeeze the pod, pressing your thumb against the seam to continue opening it. Sweep your thumb down along the inside of the pod to pop out the peas from the pod and let them fall into the bowl. Discard the pod.",
        "Cook the onions",
        "In a wide, shallow sauté pan over medium-high heat, melt 1 Tbs. of the butter. Add the onions, stir with a wooden spoon to coat them evenly with the butter and cook, stirring once or twice, until softened, about 1 minute.",
        "Simmer the peas",
        "Add the stock, peas and salt to the pan and stir to combine. Bring to a boil, then reduce the heat to medium and simmer until the peas are heated through and the onions are tender, 3 to 4 minutes. Remove from the heat and stir in the remaining 1 Tbs. butter, the pepper and the basil.",
        "Adjust the seasonings and serve",
        "Taste and adjust the seasonings, adding more salt or pepper if desired to suit your taste. Transfer to the warmed serving bowl and serve immediately. Serves 4 to 6.",
        "Chef's Tip:",
        "Peas are only in season in the spring before the weather turns hot. If they are not available, you can use frozen peas to make this dish. Simply substitute 3 cups frozen petite peas for the fresh ones.",
        "Adapted from Williams-Sonoma Mastering Series,",
        "Vegetables",
        ", by Deborah Madison (Simon & Schuster, 2006)."
    ],
    "ingredients": [
        "12 to 16 fresh basil leaves",
        "1 bunch red onion shoots or green onions",
        "3 lb. English peas in their pods",
        "2 Tbs. unsalted butter",
        "3⁄4 cup chicken stock, canned low-sodium chicken broth or water",
        "1⁄4 tsp. sea salt",
        "1⁄8 tsp. freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Quick Braise of Spring Peas with Red Onion Shoots",
    "url": "http://www.williams-sonoma.com/recipe/quick-braise-of-spring-peas-with-red-onion-shoots.html"
}
