{
    "directions": [
        "Place a rimmed baking sheet in oven and preheat oven to 450°F.",
        "In a large bowl, toss potatoes with 1 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Spread in a single layer on pre-heated baking sheet, and roast until golden brown and tender, tossing halfway through, about 20 minutes.",
        "In a medium bowl, whisk together 2 tablespoons oil, 1/4 cup soy sauce, chile paste, and 1/4 teaspoon each salt and pepper. Add steaks, turning to coat them in the marinade, and let stand at room temperature for 5 minutes.",
        "Meanwhile, heat a large cast-iron skillet over medium-high heat. Add 2 tablespoons oil and let oil heat briefly. Working in batches if necessary, sear steaks until medium rare, 3 to 4 minutes per side. Remove steaks from skillet and transfer to a cutting board or plate to rest, reserving skillet.",
        "Add broth and remaining 1 tablespoon soy sauce to skillet over medium-high heat, scraping bottom of skillet to deglaze the pan. Add spinach to the skillet and cover; cook until wilted, about 3 minutes.",
        "In a medium bowl, mix mayonnaise and sriracha. Divide spinach among four plates and top with steak; serve potatoes alongside, drizzled with sriracha mayo and garnished with bonito flakes, if desired."
    ],
    "ingredients": [
        "1 pound small fingerling potatoes, halved lengthwise",
        "5 tablespoons vegetable oil, such as grapeseed, divided",
        "3/4 teaspoon kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper, divided",
        "1/4 cup plus 1 tablespoon soy sauce, divided",
        "1/4 cup hot chile paste, such as sambal oelek",
        "1 1/2 pounds skirt steak, cut into four equal-sized pieces",
        "1/4 cup chicken or vegetable broth",
        "1 1/2 pounds spinach, trimmed if needed",
        "3 tablespoons mayonnaise",
        "1 tablespoon Sriracha paste",
        "Bonito flakes, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Steak",
        "Spinach",
        "Soy Sauce",
        "22-Minute Meals",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Quick-Marinated Skirt Steak with Sriracha Potatoes and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/quick-marinated-skirt-steak-with-sriracha-potatoes-and-spinach-51261040"
}
