{
    "directions": [
        "Heat a dry large cast-iron skillet over medium-high. Cook onion, cut side down, until lightly charred, about 5 minutes; transfer to a plate.",
        "Add chiles (if using crushed red pepper flakes, add with fennel seeds), garlic, cinnamon stick, and star anise to skillet and cook, stirring, until fragrant, about 1 minute. Add fennel seeds and cook, stirring, until fragrant, about 20 seconds (do not burn). Quickly transfer to a large saucepan (reserve skillet) and add onion, ginger, and broth; bring to a boil. Reduce heat and simmer until broth is flavorful. Meanwhile, heat oil in reserved skillet over medium-high heat. Season pork with salt and pepper and cook until browned and cooked through, about 4 minutes per side. Transfer to a cutting board and let rest 5 minutes before thinly slicing.",
        "Cook noodles according to package directions. Divide among bowls; add pork. Strain broth and ladle into bowls. Top pho with bean sprouts, cilantro, scallions, and peanuts and serve with lime wedges."
    ],
    "ingredients": [
        "1 medium onion, peeled, halved through root end",
        "2 chiles de árbol or 1/2 teaspoon crushed red pepper flakes",
        "2 garlic cloves, crushed",
        "1 cinnamon stick",
        "2 star anise pods",
        "1 teaspoon fennel seeds",
        "1 1\" piece ginger, peeled, crushed",
        "8 cups low-sodium chicken broth",
        "2 tablespoons vegetable oil",
        "2 bone-in pork shoulder steaks (about 12 ounces each)",
        "Kosher salt",
        "freshly ground pepper",
        "8 ounces thin rice stick noodles",
        "Mung bean sprouts",
        "fresh cilantro leaves with tender stems",
        "thinly sliced scallions",
        "chopped unsalted, roasted peanuts",
        "lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Dinner",
        "Lunch",
        "Meat",
        "Anise",
        "Cinnamon",
        "Noodle"
    ],
    "title": "Quick Pork Pho",
    "url": "http://www.epicurious.com/recipes/food/views/quick-pork-pho-51252620"
}
