{
    "directions": [
        "Place mushrooms in a medium bowl and cover with hot water. Let sit until ready to use.",
        "Pour 10 cups hot water into a medium pot. Season generously with salt, cover, and bring to a boil. Cook noodles according to package directions, adding bok choy during the last minute of cooking. Drain noodles and bok choy; rinse with cold water.",
        "Meanwhile, heat 1 Tbsp. oil in a large pot over high. Add pork, 3/4 tsp. salt, and 1/2 tsp. pepper and cook, stirring and breaking up meat slightly, 3 minutes. Add half of the scallions and cook, stirring occasionally, until pork is just cooked through, about 3 minutes more. Add miso and cook, stirring, until incorporated, about 30 seconds. Stir in broth, soy sauce, and 2 tsp. Sriracha.",
        "Drain and slice mushrooms; add to pot. Cover and bring to a low boil. Uncover pot, reduce heat to medium, and simmer 5 minutes. Taste and adjust seasonings, if necessary.",
        "Meanwhile, using a mandoline or the large holes on a box grater, coarsely grate carrot and zucchini until you have 1 1/2 cups each. Divide noodles, bok choy, carrot, and zucchini among bowls. Top evenly with soup, eggs, if using, basil, and remaining scallions. Serve with additional sesame oil and Sriracha for drizzling alongside."
    ],
    "ingredients": [
        "1 ounce dried mushrooms (preferably shiitake or porcini)",
        "Kosher salt",
        "16 ounces fresh or 10 ounces dried ramen noodles",
        "2 small heads baby bok choy, quartered lengthwise",
        "1 tablespoon toasted sesame oil, plus more",
        "1 pound ground pork",
        "1/2 teaspoon freshly ground black pepper",
        "4 scallions, thinly sliced, divided",
        "3 tablespoons white or yellow miso paste",
        "6 cups homemade chicken stock or low-sodium chicken broth",
        "2 tablespoons low-sodium soy sauce",
        "2 teaspoons Sriracha, plus more for serving",
        "1 medium carrot",
        "1 medium zucchini",
        "4 large soft-boiled eggs (optional)",
        "1/4 cup coarsely chopped basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Soup/Stew",
        "Summer",
        "Noodle",
        "Pork",
        "Dinner",
        "Carrot",
        "Zucchini",
        "Egg",
        "Basil",
        "Green Onion/Scallion",
        "Sesame Oil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Quick Pork Ramen With Carrots, Zucchini, and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/quick-pork-ramen-with-carrots-zucchini-and-bok-choy"
}
