{
    "directions": [
        "Bring large pot of salted water to boil; add collard greens and boil until soft, about 2 minutes. Drain, reserving 1 cup cooking liquid. Cool greens slightly and cut into 1-inch strips.",
        "Place sausages and 1/2 cup water in heavy large skillet. Cook over medium heat until water evaporates and sausages start to brown, about 12 minutes. Continue cooking until sausages are cooked through, 12 to 15 minutes longer, depending on size of links.",
        "Meanwhile, heat oil in another heavy large skillet over medium heat. Add onion and sauté until translucent, about 5 minutes. Add dried crushed red pepper and next 3 ingredients; stir 1 minute. Add greens and cook 5 minutes, stirring occasionally. Stir in currants. Add reserved 1 cup cooking liquid to skillet; bring to simmer. Partially cover pan and cook until liquid has reduced slightly, about 5 minutes. Season to taste with salt and pepper.",
        "Stir cilantro and butter into hot couscous; divide among plates. Top with greens and sausages."
    ],
    "ingredients": [
        "2 pounds collard greens, stemmed",
        "1 1/2 pounds merguez sausage links",
        "1/2 cup water",
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "1/4 teaspoon dried crushed red pepper",
        "1 garlic clove, minced",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup dried currants",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons unsalted butter",
        "10 ounces plain couscous, cooked according to package directions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Dried Fruit",
        "Sausage",
        "Winter",
        "Collard Greens",
        "Couscous",
        "Cilantro"
    ],
    "title": "Quick Collard Greens with Merguez Sausage and Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/quick-collard-greens-with-merguez-sausage-and-couscous-233925"
}
