{
    "directions": [
        "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. Stir in milk, salt, sugar, 1 egg, 1 cup flour and melted butter. Beat to make a smooth batter; set aside.",
        "In a large bowl, cut the one cup firm butter into remaining four cups flour until butter particles are the size of dried kidney beans. Pour the yeast batter over this and carefully turn the mixture over with a spatula to blend, just until all flour is moistened. Cover with plastic wrap and refrigerate until well chilled, at least 4 hours or up to four days.",
        "Turn dough out  onto a floured surface; press into compact balls and knead about 6 turns to release air bubbles. Divide dough into four equal parts. Shape one at a time. Refrigerate the remaining dough.",
        "Roll one part of the dough on a floured board into a circle 17 inches in diameter. With a sharp knife or pizza cutter, cut the circle into eight equal pie-shaped wedges. Roll the wedges loosely toward the point. Shape each roll into a crescent and place on an ungreased baking sheet. Allow 1 1/2 inches space between each roll.",
        "Cover and let rise at room temperature until almost doubled in size. Approximately 2 hours. Meanwhile, preheat oven to 325 degrees F (165 degrees C).",
        "Brush croissants with beaten egg. Bake in preheated oven for 35 minutes, until golden."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "3/4 cup evaporated milk",
        "1 1/2 teaspoons salt",
        "1/3 cup white sugar",
        "1 egg",
        "5 cups all-purpose flour, divided",
        "1/4 cup butter, melted",
        "1 cup butter, chilled and diced",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Quick Butter Croissants",
    "url": "http://allrecipes.com/recipe/24017/quick-butter-croissants/"
}
