{
    "directions": [
        "Arrange racks in top and bottom of oven and place a rimmed baking sheet on bottom rack; preheat to 450°F.",
        "Beat eggs in a large shallow bowl. Using a fork or your fingertips, mix breadcrumbs, Parmesan, 3 Tbsp. oil, 3 tsp. oregano, 1/2 tsp. salt, and 1/2 tsp. pepper in another large shallow bowl or plate.",
        "Working with 1 cutlet at a time, dip in egg, allowing excess to drip back into bowl. Dredge in breadcrumb mixture, shaking off excess, then pressing to adhere. Transfer chicken to a baking sheet.",
        "Carefully remove preheated baking sheet from oven and generously brush with oil. Transfer chicken to baking sheet and return to bottom rack. Roast 6 minutes, then carefully flip (use a spatula to scrape under cutlets) and sprinkle with mozzarella. Place baking sheet on top rack and continue to roast until juices run clear, mozzarella is melted, and an instant-read thermometer inserted into the center of cutlet registers 165°F, about 4 minutes more.",
        "Meanwhile, heat remaining 2 Tbsp. oil in a large skillet over medium-high. Cook onion, stirring, until softened, 3–4 minutes. Add garlic and cook until fragrant, about 1 minute more. Add marinara sauce, red pepper flakes (if using), 1/4 cup basil, and remaining 1/2 tsp. oregano, 1/4 tsp. salt, and 1/4 tsp. pepper. Cook, stirring, until sauce starts to bubble. Reduce heat to medium and simmer until chicken is ready, stirring occasionally, at least 5 minutes.",
        "Divide sauce among 4 plates. Top with chicken and torn basil."
    ],
    "ingredients": [
        "2 large eggs",
        "1 1/2 cups breadcrumbs or panko (Japanese breadcrumbs)",
        "3/4 cup finely grated Parmesan (about 2 ounces)",
        "5 tablespoons olive oil, divided, plus more for brushing",
        "3 1/2 teaspoons dried oregano, divided",
        "3/4 teaspoon kosher salt, divided",
        "3/4 teaspoon freshly ground black pepper, divided",
        "4 (6-ounce) chicken cutlets, pounded 1/2\" thick",
        "6 ounces coarsely grated mozzarella (about 1 cup)",
        "1/2 medium onion, chopped",
        "2 garlic cloves, pressed or finely chopped",
        "1 (24-ounce) jar marinara sauce",
        "1/4 teaspoon crushed red pepper flakes (optional)",
        "1/4 cup (packed) basil leaves, torn if large, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Chicken",
        "Parmesan",
        "Tomato",
        "Mozzarella",
        "Quick & Easy"
    ],
    "title": "Quick Baked Chicken Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/quick-baked-chicken-parmesan"
}
