{
    "directions": [
        "Separate rolls onto a cornmeal-sprinkled work surface. Cover with plastic wrap and let rest while preparing filling.",
        "Fry sausage in a 12-inch skillet, breaking it up into small bits with a spoon, until it loses its raw color, about 5 minutes. Depending on the amount of fat in the pan, drain or add oil to equal about 2 Tbs. Add onion and peppers; saute until tender, about 5 minutes. Stir in garlic. Transfer to a bowl. Cool to room temperature; stir in cheeses and optional parsley.",
        "Adjust oven rack to center position and heat oven to 450 degrees.",
        "Sprinkling with cornmeal as necessary, roll out each roll into a 7-inch circle. Spoon a scant 1/2 cup of filling just below the center line, leaving a 1-inch border along the bottom half of the dough circle. Spoon filling just below the center line of the circle of dough, leaving a border along the bottom half of the circle. With wet fingertips, moisten the bottom border. Fold dough over filling and press edges together. Thoroughly seal by using fingertips to crimp and flute the edges or by pressing with the tines of a fork. Place on a large cookie sheet lined with parchment paper. (At this point, can be frozen up to 2 weeks.)",
        "Brush tops with oil. Bake until golden brown, about 16 minutes (longer if frozen). Let cool slightly and serve with warm marinara sauce."
    ],
    "ingredients": [
        "1 (11.3 ounce) can refrigerated dinner rolls, at room temperature",
        "Cornmeal for rolling",
        "1 pound spicy Italian sausage, removed from its casing",
        "Olive oil, for sauteing, if necessary",
        "1 medium onion, finely chopped",
        "1/2 large yellow bell pepper, cored and seeded, cut into small dice",
        "1/2 large red bell pepper, cored and seeded, cut into small dice",
        "2 large garlic cloves, minced",
        "1 cup grated mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons minced fresh parsley (optional)",
        "Olive oil, for brushing",
        "Your favorite marinara-style pasta sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Quick Sausage and Bell Pepper Calzones",
    "url": "http://allrecipes.com/recipe/82063/quick-sausage-and-bell-pepper-calzone/"
}
