{
    "directions": [
        "Preheat oven to 300°F. Sauté bacon in large nonstick skillet over medium-high heat until crisp. Using slotted spoon, transfer to bowl. Sprinkle chicken with salt, pepper, and 1 tablespoon parsley. Add to drippings in skillet. Sauté until cooked through, about 6 minutes per side; transfer to pie dish (reserve skillet). Place in oven to keep warm.",
        "Add mushrooms and shallots to skillet; sprinkle lightly with salt and pepper. Sauté until brown, about 4 minutes. Add garlic; toss 10 seconds. Add wine, 1 1/4 cups broth, bacon, and 1 tablespoon parsley. Bring to boil, stirring occasionally. Boil 10 minutes. Meanwhile, place flour in small cup.",
        "Add 1/4 cup broth, stirring until smooth. Add flour mixture to sauce. Cook until sauce thickens, 3 to 4 minutes. Season sauce to taste with salt and pepper. Arrange chicken on platter; stir juices from pie dish into sauce and spoon over chicken. Sprinkle with 1 tablespoon parsley."
    ],
    "ingredients": [
        "4 bacon slices, coarsely chopped",
        "4 skinless boneless chicken breast halves",
        "3 tablespoons chopped fresh Italian parsley, divided",
        "8 ounces large crimini (baby bella) mushrooms, halved",
        "8 large shallots, peeled, halved through root end",
        "2 garlic cloves, pressed",
        "1 1/2 cups dry red wine (such as Syrah)",
        "1 1/2 cups low-salt chicken broth, divided",
        "4 teaspoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Sauté",
        "Low Fat",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Bacon",
        "Red Wine",
        "Fall",
        "Healthy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Quick Coq au Vin",
    "url": "http://www.epicurious.com/recipes/food/views/quick-coq-au-vin-361231"
}
