{
    "directions": [
        "In a large pot over medium heat, warm the oil. Add the chopped onion and ginger and sauté until the onion is translucent, about 5 minutes. Add the broth, 2 cups (16 fl. oz./500 ml) water, the fish sauce and sugar. Place the star anise and cloves in a tea strainer or wrap in cheesecloth and add to the pot. Bring to a boil. Reduce the heat to low and simmer for 30 minutes to develop the flavors.",
        "Meanwhile, prepare the accompaniments: Place the noodles in a large heatproof bowl. Cover with boiling water and let soak 8 minutes to soften. Drain the noodles. Place the chiles, sprouts, basil sprigs and lime wedges on a platter or in small bowls and set them on the table. Cut the steak in half lengthwise and trim off the fat. Slice it across the grain as thinly as possible.",
        "Just before serving, remove the spices from the broth, add the noodles and simmer for 2 minutes. Using tongs, divide the noodles among 4 warmed deep bowls. Place the steak atop the noodles, arranging it in a single layer. Ladle the simmering broth over the steak. Sprinkle the green onions, cilantro and a few grinds of black pepper atop each bowl. Serve immediately, allowing diners to add the chiles, sprouts, herbs and lime juice to taste. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free",
        ", by Kristine Kidd (Weldon Owen, 2013)"
    ],
    "ingredients": [
        "1 Tbs. vegetable oil",
        "1 yellow onion, coarsely chopped",
        "3 Tbs. minced fresh ginger",
        "8 cups (64 fl. oz./2 l) beef broth",
        "2 Tbs. Asian fish sauce",
        "1 Tbs. sugar",
        "10 star anise pods",
        "6 whole cloves",
        "8 to 10 oz. (215 to 315 g) pad Thai (wide rice) noodles",
        "6 Thai chiles or 1 serrano chile, thinly sliced",
        "Bean sprouts for serving",
        "Fresh basil sprigs for serving",
        "Lime wedges for serving",
        "1/2 to 3/4 lb. (265 to 375 g) New York strip steak",
        "3 green onions, white and light green portions, thinly sliced",
        "1/3 cup (1/2 oz./15 g) chopped fresh cilantro",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Quick Vietnamese Beef and Noodle Soup",
    "url": "http://www.williams-sonoma.com/recipe/quick-vietnamese-beef--and-noodle-soup.html"
}
