{
    "directions": [
        "Preheat oven to 400°F. Mix white wine and saffron threads in small measuring cup; set aside. Combine salt, smoked paprika, and black pepper in small bowl; rub spice mixture all over chicken thighs. Heat heavy large ovenproof skillet over medium-high heat. Add chorizo and sauté until fat begins to render and sausage browns, stirring occasionally, about 3 minutes. Transfer chorizo to large plate. Add olive oil to skillet. Add chicken thighs to skillet and cook until browned, about 4 minutes per side. Transfer chicken to plate with chorizo.",
        "Pour off all but 1 tablespoon drippings from skillet. Reduce heat to medium. Add chopped onion and cook until translucent, stirring often, about 5 minutes. Add minced garlic and stir 30 seconds. Add long-grain rice and stir to coat. Add wine-saffron mixture and bring to boil, scraping up browned bits from bottom of skillet. Add chicken broth, tomatoes with juice, and roasted red peppers. Bring to simmer. Stir in browned chorizo. Place chicken thighs, skin side up, atop mixture in skillet. Cover skillet tightly with foil, then cover skillet with lid. Bake paella until rice is almost tender, about 25 minutes.",
        "Transfer chicken to plate. Stir rice; season to taste with salt and pepper. Scatter snap peas over. Return chicken to skillet, nestling into rice. Cover with foil and lid. Bake until snap peas are crisp-tender, rice is tender, and chicken is cooked through, about 10 minutes longer.",
        "Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from latienda.com.",
        "** Spanish chorizo, a pork-link sausage flavored with garlic and spices, is milder than Mexican chorizo. It's available at specialty foods stores and Spanish markets and from latienda.com."
    ],
    "ingredients": [
        "1/2 cup dry white wine",
        "1/2 teaspoon saffron threads",
        "1 1/2 teaspoons salt",
        "1 1/4 teaspoons smoked paprika*",
        "1 teaspoon freshly ground black pepper",
        "6 large chicken thighs with skin and bones, excess skin and fat trimmed (about 2 1/2 pounds)",
        "4 ounces 1/4-inch-thick slices fully cooked smoked Spanish chorizo**",
        "1 tablespoon olive oil",
        "1 1/2 cups chopped onion (about 1 large)",
        "4 garlic cloves, minced",
        "1 1/2 cups long-grain rice",
        "2 cups low-salt chicken broth",
        "1 14.5-ounce can diced tomatoes in juice",
        "1/4 cup chopped roasted red peppers from jar",
        "2 1/2 cups sugar snap peas, trimmed (about 8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Rice",
        "Bake",
        "Sauté",
        "Dinner",
        "Sausage",
        "Legume",
        "Pea",
        "Spring",
        "Family Reunion",
        "Potluck",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quick Chicken Paella with Sugar Snap Peas",
    "url": "http://www.epicurious.com/recipes/food/views/quick-chicken-paella-with-sugar-snap-peas-358212"
}
