{
    "directions": [
        "Put eggs in a small saucepan and cover with cold water. Bring to a boil, then cover pan, and remove from heat. Let eggs stand, covered, 15 minutes, then drain, and transfer to a bowl of ice water to cool completely. Remove shells and finely grate eggs with a Microplane or the fine holes of box grater into a small bowl. Set aside.",
        "Rinse quinoa well in a large fine-mesh sieve under cold running water. Set sieve over a bowl and let quinoa drain well for at least 5 minutes. Bring 2 1/2 cups water to a boil with 1/2 teaspoon salt (kosher or fine) in a 3-quart saucepan. Add quinoa and simmer, covered, until water is absorbed and quinoa is tender, 16 to 20 minutes. Remove pan from heat and let quinoa stand, covered, 5 minutes. Spoon quinoa onto a large rimmed baking sheet, spreading it in a single layer, and let it cool to room temperature.",
        "Cut scallions into 2-inch pieces. Halve each piece lengthwise, then slice lengthwise into thin strips (julienne). Transfer to a large bowl.",
        "Using vegetable peeler, peel lengthwise strips from asparagus, beginning at bottom end, and add to scallion. Once you can't peel any more slices from a stalk, break off the thick end (reserving it for another use, such as soup) and add the remaining thin strip to bowl with scallions.",
        "Whisk together lemon juice with honey and 3/4 teaspoon kosher (1/2 teaspoon fine) salt until smooth. Add oil in a steady stream, whisking until combined. Taste and adjust seasoning, if desired, then whisk in grated eggs.",
        "Transfer quinoa to another large bowl and toss with herbs and 1/2 cup vinaigrette, or to taste. Toss asparagus with 3 tablespoons vinaigrette and salt and pepper to taste.",
        "Spoon quinoa onto salad plates, and top with a tangle of asparagus and scallion. Serve remaining vinaigrette on the side, or save, chilled, for another salad."
    ],
    "ingredients": [
        "2 large eggs",
        "1 1/4 cups (8 ounces) quinoa",
        "2 1/2 cups water",
        "Kosher or fine salt",
        "5 scallions, trimmed",
        "1 pound asparagus, tough ends trimmed",
        "4 tablespoons fresh lemon juice, or to taste",
        "2 teaspoons mild honey",
        "6 tablespoons extra-virgin olive oil",
        "1 cup flat-leaf parsley leaves",
        "1/2 cup fresh mint leaves",
        "1/2 cup fresh cilantro leaves",
        "Freshly ground black pepper",
        "Special equipment: A sharp vegetable peeler"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Passover",
        "Mint",
        "Quinoa",
        "Asparagus",
        "Spring",
        "Healthy",
        "Cilantro",
        "Lemon Juice",
        "Green Onion/Scallion",
        "Gourmet"
    ],
    "title": "Quinoa and Asparagus Salad with Mimosa Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/quinoa-and-asparagus-salad-with-mimosa-vinaigrette-395372"
}
