{
    "directions": [
        "Bring water and 2 1/2 cups sugar to a boil in a 4-quart heavy saucepan, stirring until sugar is dissolved. Add quinces and cook at a bare simmer, partially covered, turning occasionally, until tender when pierced near core with a fork (core will remain hard), about 45 minutes to 1 hour. Cool quinces, uncovered, in syrup, about 1 1/2 hours, then transfer with a slotted spoon to a plate.",
        "While quinces are cooling, simmer prunes in Armagnac in a small saucepan, uncovered, until plump, about 10 minutes, then cool. Drain prunes in a sieve set over a bowl, reserving Armagnac. Set aside 6 prune halves and finely chop remainder. Cook butter and remaining 2 tablespoons sugar in a 2-quart heavy saucepan over moderate heat, stirring, until sugar is dissolved, about 5 minutes. Carefully add 1/4 cup Grand Marnier and 6 tablespoons reserved Armagnac. (Mixture may ignite. If so, let flames burn out.) Simmer until slightly syrupy, about 2 minutes. Transfer Grand Marnier sauce to a measuring cup.",
        "Core quinces using a large melon-ball cutter and a sharp small knife. Scoop 1 tablespoon flesh from center of each quince half and transfer to a bowl. Scrape seeds from vanilla bean with sharp small knife into bowl with quince flesh, reserving pod. Stir in chopped prunes and remaining tablespoon Grand Marnier.",
        "Transfer quince halves to a shallow baking pan and spoon filling into cavity of each, then top with prune halves. Drizzle each quince half with 1 teaspoon Grand Marnier sauce, reserving remaining sauce. Cut vanilla pod halves crosswise into thirds and stick 1 piece into filling of each quince.",
        "Preheat broiler.",
        "Scrape seeds from vanilla bean with sharp small knife into a shallow bowl, then whisk together with cream, eggs, sugar, and Grand Marnier. Dip brioche slices into batter 1 at a time, letting them soak 1 minute on each side. Transfer to a buttered shallow (1-inch-deep) flameproof baking pan.",
        "Broil 4 to 6 inches from heat until golden brown, about 2 minutes on each side. Transfer brioche to a cutting board and halve diagonally, then return to baking pan.",
        "Preheat oven to 400°F.",
        "Bake quinces in upper third of oven until heated through, about 10 minutes. At the same time, reheat brioche in lower third of oven until hot, about 6 minutes. Divide quinces and brioche among 6 plates and drizzle remaining Grand Marnier sauce over and around quinces. Spoon crème fraî:che on top."
    ],
    "ingredients": [
        "4 cups water",
        "2 1/2 cups plus 2 tablespoons sugar",
        "3 fragrant small pineapple quinces* (1 lb total), halved lengthwise",
        "7 pitted prunes, halved",
        "2/3 cup Armagnac",
        "2 tablespoons unsalted butter",
        "1/4 cup plus 1 tablespoon Grand Marnier or other orange liqueur",
        "1 vanilla bean, halved lengthwise",
        "1 vanilla bean, halved lengthwise",
        "2/3 cup heavy cream",
        "3 large eggs",
        "1/2 cup sugar",
        "1 tablespoon Grand Marnier",
        "6 (3/4-inch-thick) slices from a large brioche or challah loaf",
        "Accompaniment: crème fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Dessert",
        "Bake",
        "Prune",
        "Quince",
        "Vanilla",
        "Cognac/Armagnac",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quinces and Prunes with Caramelized Brioche",
    "url": "http://www.epicurious.com/recipes/food/views/quinces-and-prunes-with-caramelized-brioche-105628"
}
