{
    "directions": [
        "Preheat oven to 350°F.",
        "On a baking sheet in middle of oven toast almonds in one layer until golden, about 10 minutes. Peel, quarter, and core quinces. Cut each quarter lengthwise into 5 slices. In a 3-quart heavy saucepan bring water and sugar to a boil, stirring until sugar is dissolved. Add quince and simmer, covered, 2 1/4 hours.",
        "When mixture has been simmering 2 hours, peel, quarter, and core apples. Cut each quarter lengthwise into 1/4-inch-thick wedges. Stir apples into quince mixture and simmer, covered, until apples are crisp-tender, about 10 minutes. Remove pan from heat and stir in almonds and extract. Cool filling. (Filling may be made 3 days ahead and chilled, covered.)",
        "In a large sieve set over a bowl drain quince filling, reserving syrup. Transfer quince to a bowl and stir in 3 tablespoons reserved syrup. Make an egg wash by lightly beating egg with 2 teaspoons water.",
        "Halve dough and on a lightly floured surface roll out each half into a 12- by 8-inch rectangle (about 1/4 inch thick). Transfer 1 pastry rectangle to a floured large baking sheet and put quince filling lengthwise along center, forming a 9- by 5-inch mound. Brush pastry around filling with some egg wash. Carefully drape remaining pastry rectangle lengthwise over quince and seal edges by gently pressing together. With a sharp large knife trim edges of pastry. Crimp edges and make a decorative pattern of about 8 slits in pastry, exposing filling. Chill jalousie, loosely covered, 30 minutes.",
        "Preheat oven to 425°F.",
        "Brush jalousie evenly with some egg wash and sprinkle with sugar. Bake jalousie in middle of oven until deep golden, about 30 minutes, and transfer on pan to a rack to cool.",
        "Serve jalousie warm or at room temperature with remaining reserved syrup and whipped cream."
    ],
    "ingredients": [
        "1/2 cup sliced almonds",
        "2 medium quinces (about 1 pound total)",
        "2 1/2 cups water",
        "1 cup sugar",
        "2 Golden Delicious apples",
        "1/8 teaspoon almond extract",
        "1 large egg",
        "2 teaspoons water",
        "Frozen Butter Pastry Dough",
        "2 tablespoons sugar",
        "Accompaniment: whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Quince",
        "Almond",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quince, Apple, and Almond Jalousie",
    "url": "http://www.epicurious.com/recipes/food/views/quince-apple-and-almond-jalousie-14626"
}
