{
    "directions": [
        "1. In a small saucepan over high heat, bring the quinoa and water to a boil. Reduce the heat to low, cover, and cook until the water has been absorbed and the quinoa is tender, 18 to 20 minutes. Turn off the heat and let the quinoa sit for 5 minutes. Fluff with a fork.",
        "2. Preheat the oven to 200°F. In a small bowl, stir together the quinoa flour, salt, and baking powder. In another small bowl, whisk the egg, then add the milk and whisk to combine. Pour the egg mixture into the quinoa flour mixture and whisk to combine. Fold in the bacon, quinoa, blue cheese, and parsley.",
        "3. Line a rimmed baking sheet with paper towels. Pour enough oil into a large nonstick skillet to cover the bottom by about 1/4 inch. Heat the oil over medium heat until it shimmers. Test the oil's temperature by dropping in a tiny bit of batter; if it sizzles, it's hot enough. Spoon heaping teaspoons of batter into the skillet. Do not overcrowd. Fry until browned, about 3 minutes on the first side and 2 minutes on the second side. Transfer to the prepared baking sheet and repeat with the remaining batter and additional oil, as needed. Keep cooked fritters warm in a 200°F oven.",
        "4. Stir together the yogurt, horseradish, and chives in a small bowl, and serve with the fritters for dipping. Fritters should be served hot, as soon as possible after frying."
    ],
    "ingredients": [
        "1/3 cup red quinoa, or a mix of red and white, rinsed",
        "2/3 cup water",
        "1 cup quinoa flour",
        "1/2 teaspoon kosher salt",
        "1 1/2 teaspoons baking powder",
        "1 large egg",
        "3/4 cup whole milk",
        "4 slices cooked bacon, crumbled",
        "1/2 cup crumbled blue cheese (3 ounces)",
        "2 tablespoons chopped flat-leaf parsley",
        "1/2 to 1 cup canola oil, as needed for frying",
        "1/2 cup plain low-fat yogurt",
        "1 tablespoon bottled horseradish",
        "1 tablespoon minced chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Side",
        "Fry",
        "Yogurt",
        "Horseradish",
        "Blue Cheese",
        "Meat",
        "Bacon",
        "Quinoa",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Quinoa, Bacon, and Blue Cheese Fritters with Horseradish-Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/quinoa-bacon-and-blue-cheese-fritters-with-horseradish-yogurt-sauce-51125000"
}
