{
    "directions": [
        "Peel, quarter, and core quinces. Cut quarters crosswise into 1/8-inch-thick slices. In a 3-quart heavy saucepan bring quince, water, sugar, honey, lemon juice, and cinnamon to a boil. Reduce heat and simmer mixture, stirring occasionally, 2 1/2 hours (quince will be deep pinkish orange). Drain quince in a large sieve and transfer to paper towels. Pat quince dry and cool. Chill quince, covered, at least 1 hour and up to 3 days.",
        "Preheat oven to 350°F. Butter and flour a 9- by 2-inch round cake pan, knocking out excess flour.",
        "Into a bowl sift together twice flour, cinnamon, and salt. In another bowl with an electric mixer beat together butter and sugar until combined well. Add yolk and whole eggs, 1 at a time, to butter mixture, beating well after each addition. Beat in half of flour mixture and all of cream until just combined. Add remaining flour mixture and vanilla, beating until just combined. Fold quince slices into batter until combined well and spread batter evenly in pan.",
        "Bake cake in middle of oven 1 1/4 hours, or until a tester comes out clean, and cool in pan on a rack 20 minutes. Turn cake out onto rack and cool completely. (Cake keeps, in an airtight container at room temperature, 4 days.)"
    ],
    "ingredients": [
        "2 medium quinces (about 1 pound total)",
        "2 cups water",
        "3/4 cup sugar",
        "1/2 cup honey",
        "2 teaspoons fresh lemon juice",
        "1/2 teaspoon cinnamon",
        "1 3/4 cups cake flour (not self-rising)",
        "1/4 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 1/2 cups sugar",
        "1 large egg yolk",
        "3 whole large eggs",
        "1/2 cup heavy cream",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Quince",
        "Pecan",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quince Pound Cake",
    "url": "http://www.epicurious.com/recipes/food/views/quince-pound-cake-14625"
}
