{
    "directions": [
        "Bring 1 cup of water to a boil in a small saucepan. Meanwhile, in a small cast-iron skillet (if possible), toast the quinoa over moderately-high heat until the grains give off a nutty aroma and start to pop. Pour the quinoa into the boiling water, taking care that the pot doesn't boil over! Turn it down to a simmer, cover, and cook until the water is absorbed and the quinoa is tender, 12 to 15 minutes. Remove it from the heat and allow to cool.",
        "Whisk together the lemon juice, olive oil, 1/2 rounded teaspoon of salt, pepper and nutmeg.",
        "Combine the parsley, mint, cherry tomatoes, cucumber, peppadews and the cooled cooked quinoa in a large bowl. Pour the dressing over the salad and toss to coat. Taste for seasoning, and let sit for about 5 minutes before you serve. (This tastes even better the next day!)",
        "Another way to serve it is with the tabbouleh in the center of a platter encircled with endive or romaine leaves to scoop it up."
    ],
    "ingredients": [
        "1/2 cup quinoa (red or white), rinsed",
        "1/2 cup freshly squeezed lemon juice",
        "1/4 cup extra-virgin olive oil",
        "Kosher salt and freshly ground pepper",
        "A pinch of freshly grated nutmeg",
        "3 bunches of fresh flat-leaf parsley, finely chopped (about 4 cups), see Cook's Note*",
        "1/2 cup finely chopped fresh mint leaves",
        "1 pint cherry tomatoes, quartered",
        "1 English cucumber, diced",
        "Small handful jarred peppadew peppers or roasted red peppers, finely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Salad Recipes",
        "Grain Recipes",
        "Quinoa",
        "Tomato",
        "Vegetable",
        "Cucumber",
        "Low-Fat",
        "Gluten Free",
        "Low-Cholesterol",
        "Low Calorie",
        "Low-Carb",
        "Heart-Healthy",
        "Low Sodium",
        "Diabetes-Friendly"
    ],
    "title": "Quinoa Tabbouleh",
    "url": "http://www.foodnetwork.com/recipes/aarti-sequeira/quinoa-tabbouleh-recipe"
}
