{
    "directions": [
        "1. Place the rice, quinoa, and 3 cups water into a rice cooker and cook according to the manufacturer's instructions. (You can also cook the rice and quinoa in 3 cups water in a pressure cooker for 15 minutes).",
        "2. Bring a saucepan of water to a boil and cook the carrots until softened, about 30 seconds. Drain and rinse them under cold water.",
        "3. Unroll a bamboo sushi mat on a work surface and put a sheet of nori on it. Wet your hands and divide the rice into 4 equal portions. Divide one portion into 4 small, firm balls and press them evenly onto the nori, covering the entire sheet with a thin layer of grains. Evenly spread one-quarter of the bean curd, one quarter of the carrots, one-quarter of the cucumbers, and one quarter of the avocado in the center of the rice. Using the mat as a guide, roll the topped nori tightly and evenly into a sushi roll, wetting the edges of the nori sheet with water if necessary, so it sticks together at the seam. Repeat three more times with the remaining nori, rice, and vegetables.",
        "4. Slice the rolls into 1 1/2-inch-thick pieces with a sharp, wet knife and transfer them to a serving platter. Garnish with cilantro and pickled ginger."
    ],
    "ingredients": [
        "1 cup sticky brown rice",
        "1/2 cup quinoa",
        "8 ounces baked bean curd/tofu, cut into long thin strips",
        "4 to 5 carrots cut into matchsticks",
        "4 nori seaweed sheets",
        "2 pickled cucumbers (low sodium), cut into matchsticks",
        "2 avocados, peeled, pitted, and sliced",
        "Cilantro sprigs, for garnish",
        "Pickled ginger, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soy",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Quinoa",
        "Tofu",
        "Avocado",
        "Root Vegetable",
        "Carrot",
        "Healthy",
        "Vegan",
        "Brown Rice",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Quinoa Brown Rice Sushi",
    "url": "http://www.epicurious.com/recipes/food/views/quinoa-brown-rice-sushi-51156610"
}
