{
    "directions": [
        "Combine quince with reserved star-fruit syrup in a 3-quart heavy saucepan and bring to a boil, stirring until sugar is dissolved. Scrape seeds from vanilla bean into mixture, then add pod and strip of zest. Reduce heat and simmer, partially covered, until quince is very tender and begins to turn pinkish, 50 to 60 minutes.",
        "While quince is simmering, put oven rack in middle position and preheat oven to 400°F.",
        "Meanwhile, toss apples with butter, finely grated zest, salt, and 1/4 cup sugar in a large shallow baking pan until coated well, spreading in an even layer. Roast, stirring occasionally, until apples are very tender and any liquid they release is evaporated, 45 minutes to 1 hour.",
        "Pour quince mixture into a large sieve set over a bowl, discarding pod and zest, and reserve syrup. If syrup measures more than 1 cup, return to saucepan and boil until reduced to about 1 cup; if less, add enough water to total 1 cup. Cool syrup completely.",
        "Stir together quince and cherries in a large bowl. Fold roasted apples and lemon juice into quince mixture and cool to room temperature, stirring occasionally, about 30 minutes.",
        "Pulse bread in a blender or food processor to fine crumbs, then add nuts and remaining 1/4 cup sugar and pulse just until nuts are finely chopped. Set aside.",
        "Stir together bread flour, granulated sugar, and salt in bowl of mixer, then make a well in center and add yolk, lukewarm water, and 2 tablespoons melted butter. Beat at medium speed until dough becomes silky and elastic, and then forms a soft sticky ball that comes away from side of bowl, 8 to 10 minutes.",
        "Turn dough out onto a lightly floured surface and form into a ball. Lightly brush with some melted butter, then cover with a warmed inverted bowl (rinse bowl with hot water to warm and dry) and let stand 1 to 1 1/4 hours to let the gluten relax and make stretching easier.",
        "Put oven rack in middle position and preheat oven to 375°F. Line a large baking sheet (17 by 13 inches) with parchment paper. In a draft-free room, cover work table with sheet, then rub all-purpose flour into sheet all over, except overhang.",
        "Put dough in center of table and stretch it into a 12-inch round with your fingers. Using floured backs of hands (remove all rings, bracelets, and watches), reach under dough and begin gently stretching and thinning dough from center out to edges, moving around table as you work and intermittently stretching and thinning thicker edges slightly. Gradually stretch dough paper-thin into at least a 36-inch square (square will hang over edge of table), letting it rest for a few minutes whenever it resists stretching and occasionally reflouring hands. (Stretching may take as long as 20 minutes; try not to make any holes in dough, but if you do, cut off pieces from overhang to patch them.) Let dough stand 5 minutes to dry.",
        "Very gently brush dough with 1/3 cup melted butter and sprinkle evenly with reserved almond mixture. Mound filling in 2 (11- by 3-inch) strips, end to end, along edge of dough nearest you, leaving 3 inches between strips and a 4-inch border along sides and edge of dough nearest you. Cut off dough overhang to table edge with kitchen shears. Fold edge of dough nearest you over filling, and, holding sheet tautly, use sheet to make dough roll over filling, away from you.",
        "Brush strudel all over with remaining melted butter and cut into 2 pieces through space between mounds. Using 2 metal spatulas, carefully transfer strudels to baking sheet, arranging them 4 inches apart, and sprinkle with 2 tablespoons confectioners sugar. Cut 3 or 4 steam vents about 2 inches apart in top of each strudel and bake until golden, 40 to 45 minutes. Cool for 10 minutes on sheet on a rack, then carefully transfer to rack and cool to warm or room temperature, about 30 minutes. Dust evenly with remaining 2 tablespoons confectioners sugar. If desired, carefully move blowtorch flame evenly back and forth over sugar until sugar is melted and caramelized.",
        "Cut strudels into 2-inch-wide pieces and serve with ice cream and star-fruit chips . Drizzle with reserved quince syrup."
    ],
    "ingredients": [
        "2 pounds quinces (4 or 5), peeled, quartered, cored, and cut into 3/4-inch pieces",
        "Reserved syrup from star-fruit chips",
        "1/2 vanilla bean, halved lengthwise",
        "1 (4- by 1-inch) strip fresh lemon zest plus 1 teaspoon finely grated",
        "2 pounds Gala apples (4 or 5), peeled, cored, and cut into 3/4-inch pieces",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "1/4 teaspoon salt",
        "1/2 cup sugar",
        "1 cup soft dried tart cherries (6 ounces)",
        "1 tablespoon fresh lemon juice",
        "1 slice firm white sandwich bread",
        "1/2 cup slivered almonds (2 ounces), lightly toasted",
        "2 cups bread flour",
        "1 tablespoon granulated sugar",
        "1/2 teaspoon salt",
        "1 large egg yolk",
        "3/4 cup lukewarm water",
        "1 1/4 sticks (10 tablespoons) unsalted butter, melted and cooled slightly",
        "About 1/2 cup all-purpose flour for rubbing into cloth",
        "1/4 cup confectioners sugar",
        "Special equipment: a stand mixer fitted with paddle attachment; parchment paper; a (36-inch) round or square work table; a cotton sheet or smooth, lint-free tablecloth large enough to hang over edge of table; a small blowtorch (optional)",
        "Accompaniment: 1 qt store-bought premium vanilla ice cream; star-fruit chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Citrus",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Roast",
        "Christmas",
        "Apple",
        "Quince",
        "Fall",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quince Apple Strudels with Quince Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/quince-apple-strudels-with-quince-syrup-236661"
}
