{
    "directions": [
        "Wash, peel, and core the quinces, reserving the cores and peels. Coarsely chop the flesh and transfer the fruit to a large pan. Wrap the cores and peels in cheesecloth, tie the bag with kitchen string, and add it to the pan. (The peels contain most of the fruit's pectin, which contributes to the firmness of the quince paste.)",
        "Pour in enough water to cover the quinces and boil, half-covered, for 30 to 40 minutes or until the fruit is very soft. Remove the bag of peels and pass the quince flesh through a sieve or food mill. (For best results, don't use a food processor as it will result in too fine a texture.) You should have about 2 1/2 pounds of fruit pulp.",
        "Transfer the quince pulp to a saucepan and add the sugar (ideally, you should add the same amount of sugar, by weight, as the fruit pulp). Cook and stir over low heat until the sugar is dissolved. Continue cooking for about 1 1/2 hours, stirring frequently with a wooden spoon, until the paste becomes very thick and has a deep orange color. Draw the wooden spoon along the bottom of the saucepan: it should leave a trail and the quince mixture will stick to the spoon.",
        "Lightly grease a 9x13-inch baking dish or line it with greased parchment paper. Transfer the quince paste to the baking dish, spreading it about 1 1/2-inch thick. Smooth the top and allow it to cool.",
        "Dry the paste on your lowest oven setting, no more than 125 degrees F (52 degrees C), for about 1 1/2 hours. Allow the quince paste to cool completely before slicing. (In Europe, the traditional method of drying the quince paste is to leave it in a cupboard for about 7 days. The remaining juices will continue to evaporate and render a drier paste.)",
        "Store quince paste in an airtight container in the refrigerator; the color will deepen with age."
    ],
    "ingredients": [
        "4 1/2 pounds ripe quinces",
        "5 1/2 cups white sugar",
        "water to cover"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Quince Paste",
    "url": "http://allrecipes.com/recipe/157011/quince-paste/"
}
