{
    "directions": [
        "Mix first 3 ingredients in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Mix 3 tablespoons ice water and vinegar in small bowl; add to processor. Blend until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; refrigerate at least 1 hour. Do ahead Can be made 1 day ahead. Keep refrigerated. Soften slightly at room temperature before rolling out.",
        "Fill large skillet with ice cubes; set aside.",
        "Combine first 3 ingredients in heavy 11–inch–diameter ovenproof skillet. Stir over medium heat until sugar dissolves. Increase heat to medium–high; boil until caramel is deep amber color, occasionally brushing down sides of skillet with wet pastry brush and swirling skillet, about 8 minutes. Remove from heat; stir in butter and cinnamon. Immediately place skillet with caramel atop ice in large skillet; let stand until caramel is cold and hardened, about 30 minutes. Remove skillet from ice.",
        "Position rack in center of oven; preheat to 400°F. Arrange quince wedges tightly together, rounded side down, in concentric circles atop caramel in skillet. Fill center with any broken quince pieces. Roll out dough on lightly floured surface to 12 1/2–inch round. Place dough atop quinces; tuck edges of dough down around sides of quinces. Make three 2–inch–long cuts in center of dough to allow steam to escape during baking. Place skillet on rimmed baking sheet. Bake until quinces are tender and crust is deep golden brown, about 1 hour 15 minutes. Remove from oven; let cool 30 minutes.",
        "Place large platter atop skillet. Using oven mitts, hold platter and skillet firmly together and invert, allowing tart to slide out onto platter. Rearrange any dislodged quince wedges, if necessary. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 1/2 tablespoons sugar",
        "1 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2–inch cubes",
        "3 tablespoons (or more) ice water",
        "1 1/2 teaspoons cider vinegar",
        "1 cup sugar",
        "1/4 cup water",
        "1 tablespoon honey",
        "5 tablespoons unsalted butter, room temperature",
        "1/2 teaspoon ground cinnamon",
        "8 small quinces (about 3 1/4 pounds), peeled, each cut into 1–inch–wide wedges, cored"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Quince",
        "Winter",
        "Pastry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Quince Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/quince-tarte-tatin-236809"
}
