{
    "directions": [
        "Coarsely chop 1 onion half. Coarsely chop 2 pineapple rounds, discarding core; cover and chill remaining pineapple. Place chopped onion and chopped pineapple in blender. Add orange juice and next 7 ingredients; puree marinade until smooth. Place pork in large resealable plastic bag. Add marinade and seal bag, releasing excess air. Turn to coat. Chill at least 4 hours and up to 1 day.",
        "Prepare barbecue (medium-high heat). Grill remaining pineapple until warm and slightly charred, 4 to 6 minutes per side. Grill pork with some marinade still clinging until slightly charred and cooked through, 2 to 4 minutes per side. Transfer pineapple and pork to work surface; chop pineapple into 1/2-inch cubes, discarding cores. Chop pork. Transfer to platter; toss to combine.",
        "Meanwhile, finely chop remaining onion half and place in medium bowl. Add cilantro; toss to combine. Grill tortillas until warm and slightly charred, about 10 seconds per side.",
        "Serve pork-pineapple mixture with onion-cilantro relish, Smoky Two-Chile Salsa, and lime wedges."
    ],
    "ingredients": [
        "1 large white onion, halved",
        "1 pineapple, peeled, cut crosswise into 1/2-inch-thick rounds",
        "1/2 cup fresh orange juice",
        "1/4 cup distilled white vinegar",
        "1/4 cup guajillo chile powder",
        "3 garlic cloves, halved",
        "2 teaspoons coarse kosher salt",
        "1 teaspoon dried oregano (preferably Mexican)",
        "1 teaspoon ground cumin",
        "1 large or 2 small chipotle chiles and 1 to 2 teaspoons adobo from canned chipotle chiles in adobo",
        "1 2 1/2-to 3-pound boneless pork loin, cut into 1/2-inch slices",
        "1/4 cup chopped fresh cilantro",
        "Corn tortillas",
        "Smoky Two-Chile Salsa",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Onion",
        "Pork",
        "Kid-Friendly",
        "Low Cal",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Orange",
        "Pineapple",
        "Spring",
        "Summer",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tacos al Pastor",
    "url": "http://www.epicurious.com/recipes/food/views/tacos-al-pastor-242132"
}
