{
    "directions": [
        "Lay the flank steak in a large baking dish and pour the mojo over it. Wrap tightly in plastic wrap and refrigerate for 1 hour or up to 8 hours, so the flavors can sink into the meat. Don't marinate the steak for more than 8 hours though, or the fibers break down too much and the meat gets mushy.",
        "Preheat an outdoor grill or a ridged grill pan over medium-high flame (you can also use a broiler). Brush the grates with a little oil to prevent the meat from sticking. Pull the steak out of the mojo marinade and season the steak on both sides with salt and pepper. Grill (or broil) the steak for 7 to 10 minutes per side, turning once, until medium-rare. Remove the steak to a cutting board and let it rest for 5 minutes to allow the juices to settle. Thinly slice the steak across the grain on a diagonal.",
        "Warm the tortillas for 30 seconds on each side in a dry skillet or on the grill, until toasty and pliable.",
        "To make the tacos, stack up 2 of the warm tortillas, lay about 4 ounces of beef down the center, and sprinkle with some lettuce, onion, and cheese. Top each taco with a spoonful of the Pico de Gallo salsa and garnish with lime wedges. Repeat with the remaining tortillas.",
        "In a mortar and pestle or bowl, mash together the garlic, jalapeno, cilantro, salt, and pepper to make a paste. Put the paste in a glass jar or plastic container. Add the lime juice, orange juice, vinegar, and oil. Shake it up really well to combine. Use as a marinade for chicken or beef or as a table condiment.",
        "Yield: approximately 1 1/4 cups",
        "In a mixing bowl, combine all ingredients together. Toss thoroughly. Let it sit for 15 minutes hour to allow the flavors to marry.",
        "Yield: 2 cups"
    ],
    "ingredients": [
        "2 pounds flank or skirt steak, trimmed of excess fat",
        "1 recipe Mojo, recipe follows",
        "Olive oil, for coating the grill",
        "Kosher salt and freshly ground black pepper",
        "16 (7-inch) corn tortillas",
        "Shredded romaine or iceberg lettuce, for serving",
        "Chopped white onion, for serving",
        "Shredded Jack cheese, for serving",
        "1/2 cup Pico de Gallo, recipe follows",
        "2 limes, cut in wedges for serving",
        "4 garlic cloves, minced",
        "1 jalapeno, minced",
        "1 large handful fresh cilantro leaves, finely chopped",
        "Kosher salt and freshly ground black pepper",
        "2 limes, juiced",
        "1 orange, juiced",
        "2 tablespoons white vinegar",
        "1/2 cup olive oil",
        "4 vine-ripe tomatoes, chopped",
        "1/2 medium red onion, chopped",
        "2 green onions, white and green parts, sliced",
        "1 Serrano chile, minced",
        "1 handful fresh cilantro leaves, chopped",
        "3 garlic cloves, minced",
        "1 lime, juiced",
        "1/4 cup extra-virgin olive oil",
        "1 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Grilling Recipes",
        "Grilling",
        "American",
        "Southwestern",
        "Taco Recipes",
        "Holiday",
        "Jalapeno Recipes",
        "Vegetable",
        "Meat",
        "Lettuce Recipes",
        "Beef",
        "Cinco de Mayo",
        "Marinating Recipes"
    ],
    "title": "Tacos Carne Asada",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/tacos-carne-asada-recipe"
}
