{
    "directions": [
        "Gently boil the lentils in a large saucepan of cold water (around 4 cups will do) and stir in the turmeric and black cardamom pods (if using)—this will add a subtle smoky flavor. Allow to cook for around 45 minutes, or until the lentils have softened and started to break down. Skim off any foam that sits on the top and give the lentils a stir every now and again in case they begin to stick on the bottom. If they boil dry, add more water.",
        "Once the lentils have softened, turn down the heat and make the tadka. Gently heat the oil in a skillet and add the cinnamon sticks, green cardamom pods and cloves. When the cardamoms have turned white and the heads of the cloves have swollen, you are ready to stir in the mustard and cumin seeds. When they are sizzling, stir in the scallions, chiles, garlic and ginger.",
        "After a minute, stir through the tomatoes and turn off the heat. Pour the tadka into the dhal so that it floats on top. This is the traditional way to serve it, with the scented oil sitting on top, but I prefer to stir it through. Season with salt, sugar and lemon juice. Finally, stir through plenty of chopped cilantro and serve with some rice or fresh bread for the ultimate comfort food."
    ],
    "ingredients": [
        "1 1/2 cups dried toor dhal (yellow lentils/yellow split peas), rinsed in several changes of water",
        "1 teaspoon ground turmeric",
        "2 black cardamom pods (optional)",
        "3 tablespoons vegetable oil",
        "2 cinnamon sticks",
        "4 green cardamom pods",
        "6 cloves",
        "2 teaspoons black mustard seeds",
        "1 teaspoon cumin seeds",
        "2 scallions, finely sliced",
        "2–3 chiles, any color, seeded if you don’t like it fiery, some chopped and the rest left whole",
        "2 fat cloves garlic, finely chopped",
        "1 tablespoon peeled and finely chopped fresh ginger",
        "6 cherry tomatoes, cut in half",
        "Good pinch of sea salt, or to taste",
        "1 teaspoon sugar, or to taste",
        "Juice of 1/2 lemon, or to taste",
        "Lots of chopped cilantro, to garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Vegetarian",
        "Vegan",
        "Lentil",
        "Garlic",
        "Ginger",
        "Chile",
        "Wheat/Gluten-Free",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tadka Dhal",
    "url": "http://www.epicurious.com/recipes/food/views/tadka-dhal"
}
