{
    "directions": [
        "In a small Dutch oven or enameled casserole over medium-high heat, heat the olive oil and sauté the turmeric, ginger, and lamb until the meat is well coated and lightly browned, 2 to 3 minutes. Finely dice one of the onions. Add it to the meat along with the broth, saffron, and cilantro. Cover and reduce the heat to medium-low. Cook until the meat is fork tender, 1 to 1 1/2 hours. Discard the cilantro.",
        "Preheat the oven to 200 degrees F. With a slotted spoon, transfer the meat to an ovenproof dish and keep warm in the oven until ready to serve. Bring the sauce in the casserole back to a simmer.",
        "Finely slice the remaining onion. Add it, along with the prunes, honey, cinnamon, and pepper to the simmering sauce. Season with salt. Cook until the mixture thickens somewhat, 6 to 8 minutes. Spoon the prune sauce over the meat and sprinkle the dish with the sesame seeds. Serve with warm bread.",
        "<a name=\"note\">Note:</a> To toast and crush saffron, place threads in a small nonstick skillet and stir constantly over medium-high heat for 2 to 3 minutes. Crush the threads between your fingers, or pound them in a mortar along with a pinch of salt before using."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground ginger",
        "2 pounds leg of lamb, trimmed of fat and cut into 2-inch chunks",
        "2 onions",
        "1 cup chicken broth",
        "8 threads Spanish saffron, toasted and crushed (see Note for instructions)",
        "15 fresh cilantro sprigs, tied with cotton string",
        "1 cup pitted prunes",
        "2 tablespoons honey",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon pepper",
        "salt to taste",
        "1 tablespoon unhulled sesame seeds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Lamb",
        "Stew",
        "Ramadan",
        "Prune",
        "Spice",
        "Saffron",
        "Winter",
        "Honey",
        "Sesame"
    ],
    "title": "Tagine Bil Kok",
    "url": "http://www.epicurious.com/recipes/food/views/tagine-bil-kok-15841"
}
