{
    "directions": [
        "Combine the flour, eggs, egg yolks, and salt and mix either by hand or in a stand mixer until fully incorporated. Wrap in plastic wrap and let rest in refrigerator for two hours. After the dough has rested, roll it out by hand on a lightly floured surface into thin sheets, or run through a pasta machine, making 6-inch x 12-inch sheets. Using a paste cutter or sharp knife, cut tagliatelle into 1/2 inch strands. Cover and reserve.",
        "Season the ricotta salata with salt, pepper, parsley, and olive oil, and bake in a preheated oven at 375°F until the outside is lightly browned, about 30 minutes. Remove from oven and reserve.",
        "While the ricotta is baking, slice the eggplant lengthwise into 3/4-inch slices and salt it. Drain over a rack. After about 1 hour, pat eggplant dry and season with canola oil and freshly ground pepper. Roast eggplant in an oven uncovered at 450°F until it is golden brown and tender, about 20 to 25 minutes. Remove the eggplant, cool, and cut into 1/2 inch cubes.",
        "Bring a large pot of salted water to a boil. Add the pasta and cook until al dente, about 2 to 3 minutes. Remove pasta from water, but do not strain and rinse it.",
        "While the pasta is cooking, heat canola oil in a medium saucepan. Sweat shallots and minced garlic. Add the eggplant and sauté quickly. Add vegetable stock. Add the sardines and the Speck, followed by the vegetable stock. Add butter piece by piece, whisking after each addition. Season with salt and pepper to taste. Toss the reserved pasta in the sauce to coat. Finish with extra-virgin olive oil and grated Parmesan cheese. Divide pasta among. Top with grated ricotta salata, and enjoy.",
        "*Available at Italian specialty markets and some supermarkets."
    ],
    "ingredients": [
        "34 ounces (about 7 cups) 00 flour* (or about 6 1/2 cups all-purpose flour)",
        "4 whole eggs",
        "2 egg yolks",
        "Salt, to taste",
        "8-ounce piece of ricotta salata",
        "2 tablespoons chopped flat leaf parsley",
        "1 cup extra-virgin olive oil",
        "1 medium eggplant",
        "1 tablespoon canola oil",
        "1 shallot, minced",
        "3 garlic cloves, minced",
        "8 ounces fresh spotted sardines, cleaned and filleted",
        "3 slices of Speck (smoked and cured ham), very thinly sliced",
        "2/3 cup vegetable stock",
        "2 ounces butter, cubed",
        "1/2 cup Parmigano-Reggiano cheese, grated",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Cheese",
        "Fish",
        "Pasta",
        "Pork",
        "Bake",
        "Parmesan",
        "Ricotta",
        "Ham",
        "Eggplant",
        "Summer"
    ],
    "title": "Tagliatelle with Spotted Sardines, Eggplant, and House-Baked Ricotta Salata",
    "url": "http://www.epicurious.com/recipes/food/views/tagliatelle-with-spotted-sardines-eggplant-and-house-baked-ricotta-salata-232419"
}
