{
    "directions": [
        "Prepare fresh pasta if using.",
        "Soak dried morels in 1 cup warm water 20 minutes. Agitate morels to dislodge grit, then remove from water, squeezing liquid from mushrooms back into bowl. Reserve liquid. When grit has settled, carefully pour mushroom liquid into a small bowl, leaving sediment behind (if necessary, strain liquid through a dampened coffee filter or cheesecloth). Remove any tough stems from morels.",
        "Trim and discard tough ends from asparagus. Cut off top 2 inches of tips and halve tips lengthwise. Cut remaining asparagus into long diagonal slices about 1/4 inch thick.",
        "Simmer wine, lemon juice, and shallots in a large heavy skillet until liquid is reduced to about 2 tablespoons. Add cream and simmer 1 minute. Add morels, mushroom soaking liquid, and broth, then simmer 5 minutes. Add butter all at once and cook sauce over moderately low heat, whisking constantly, just until creamy and butter is incorporated. (Do not let sauce get so hot that butter separates and sauce loses creamy consistency.) Remove skillet from heat and season sauce with salt and pepper. Keep warm, covered.",
        "If using fresh taglierini, shake off excess flour. Cook fresh taglierini with asparagus in a 6-quart pot of boiling salted water until pasta is al dente, about 1 minute. (For dried pasta, follow package instructions and add asparagus during last minute of cooking.) Reserve 1/2 cup cooking water and drain pasta and asparagus in a colander.",
        "Toss pasta and asparagus in a large bowl with ‚ cup sauce (without morels), one third of nasturtiums, and enough reserved pasta water to keep moist. Stir remaining nasturtiums into sauce.",
        "To serve, wind each portion of taglierini around a carving fork and transfer to center of a soup plate. Surround with asparagus, morels, and sauce."
    ],
    "ingredients": [
        "3/4 pound fresh taglierini or 1/2 pound dried 1/8-inch-wide flat egg noodles",
        "1 ounce small dried morels",
        "3/4 pound thin asparagus stalks",
        "1 cup dry white wine",
        "3 tablespoons fresh lemon juice",
        "1/4 cup finely chopped shallots",
        "1/3 cup heavy cream",
        "1 cup chicken broth",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into pieces",
        "50 nontoxic and organic nasturtiums, halved if large"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Lunch",
        "Asparagus",
        "White Wine",
        "Spring",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Taglierini with Morels, Asparagus, and Nasturtiums",
    "url": "http://www.epicurious.com/recipes/food/views/taglierini-with-morels-asparagus-and-nasturtiums-103309"
}
