{
    "directions": [
        "Roll out the pasta dough and cut into tagliatelle. Let dry for 30 minutes or up to 3 hours.",
        "Cut off and discard the dark green leaves from the leeks and trim away the root end. Cut the white portion of each leek lengthwise into eighths, then cut the pieces crosswise on the diagonal into 1 1/2-inch lengths.",
        "Have ready a bowl of ice water. In a large pot, bring 2 quarts water to a boil over high heat and add 1 Tbs. of the kosher salt. Add the leeks and blanch for 2 minutes. Using a wire skimmer or a sieve, remove the leeks and immediately immerse them in the ice water to stop the cooking. Drain and pat dry, then refill the bowl with ice water. If using fresh peas, add them to the boiling water and blanch for 2 minutes, then drain and immediately immerse in the ice water. Drain again and pat dry. If using frozen peas, do not blanch.",
        "In a fry pan large enough to accommodate the pasta later, melt the butter over medium heat. Add the shallots and onion and sauté until translucent and softened, 3 to 4 minutes. Add the leeks and peas, stir well and add the sherry. Reduce the heat to medium-low and cook, stirring occasionally, until most of the alcohol has evaporated, about 2 minutes. Add the cream, reduce the heat to low and simmer until the sauce thickens, about 3 minutes. Season with sea salt and pepper. Remove from the heat and cover to keep warm.",
        "In a large pot, bring 5 quarts water to a rapid boil over high heat. Add the remaining 2 Tbs. kosher salt and the pasta and cover the pot. When the water returns to a boil, uncover and cook for about 5 seconds. Drain the pasta, add it to the sauce in the pan and toss until the strands are well coated with the sauce. Transfer to a warmed large, shallow serving bowl or individual shallow bowls, sprinkle with the parsley and serve immediately. Pass the cheese at the table. Serves 4.",
        "Adapted from Williams-Sonoma",
        "The Pasta Book,",
        "by Julia della Croce (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "1 lb. egg pasta",
        "2 large leeks, rinsed well",
        "3 Tbs. kosher salt",
        "1/2 cup fresh or frozen shelled English peas",
        "4 Tbs. (1/2 stick) unsalted butter",
        "2 shallots, minced",
        "1 small white onion, sliced lengthwise paper-thin",
        "1/2 cup dry sherry",
        "1 1/2 cups heavy cream",
        "Fine sea salt and freshly ground pepper, to taste",
        "2 Tbs. chopped fresh flat-leaf parsley",
        "Grated Parmigiano-Reggiano cheese for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tagliatelle with Leeks and Peas",
    "url": "http://www.williams-sonoma.com/recipe/tagliatelle-leeks-peas.html"
}
