{
    "directions": [
        "Heat butter and oil in a deep 10-inch heavy skillet over medium heat until foam subsides.",
        "Meanwhile, pat duck dry and sprinkle with 1/4 teaspoon each of salt and pepper.",
        "Sear duck, skin side down, until golden brown and some of fat has rendered, about 6 minutes. Turn over and cook until browned, about 2 minutes more. Transfer duck to a plate, then add onion to fat in skillet with garlic, rosemary, and 1/8 teaspoon salt and cook, stirring occasionally, until onion is softened and golden brown, about 6 minutes. Add wine and boil 3 minutes.",
        "Return duck, skin side up, to skillet, then add any juices from plate, stock, and tomatoes with their juice. Bring to a boil, then gently simmer, covered, 1 hour.",
        "Transfer duck to a cutting board, then skim off about three fourths of fat from sauce and discard.",
        "Purée sauce in batches in a blender (use caution when blending hot liquids). Return sauce to skillet and boil, stirring occasionally, until reduced to about 2 1/2 cups, about 8 minutes.",
        "While sauce reduces, finely chop duck with skin.",
        "Return chopped duck to sauce and season with salt and pepper.",
        "Cook tagliatelle in a pasta pot of boiling salted water (3 tablespoons salt for 6 quarts water) until al dente, then drain pasta and toss with duck ragú."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "1 teaspoon olive oil",
        "1 (1-pound) boneless Muscovy duck breast with skin or 2 (7- to 8-ounce) Long Island (also called Pekin) duck breast halves with skin",
        "1/2 medium onion, chopped",
        "1 garlic clove, smashed",
        "1 teaspoon chopped rosemary",
        "1/2 cup dry red wine",
        "2 cups rich chicken stock or reduced-sodium chicken broth",
        "1 (14- to 15-ounce) can whole tomatoes in juice, drained, reserving juice, and chopped",
        "1/2 pound dried egg tagliatelle or egg fettuccine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Pasta",
        "Tomato",
        "Braise",
        "Dinner",
        "Red Wine",
        "Spring",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tagliatelle with Duck Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/tagliatelle-with-duck-ragu-242037"
}
