{
    "directions": [
        "Bring water, soy sauce, rice wine, brown sugar, ginger, white parts of scallion, garlic, cilantro stems, tangerine peel, star anise, and red pepper flakes to a boil in a 5- to 6-quart pot, then reduce heat and simmer, uncovered, 10 minutes. Add short ribs and gently simmer, covered, turning occasionally, until meat is very tender but not falling apart, 2 1/4 to 2 1/2 hours. Let meat stand in cooking liquid, uncovered, 1 hour.",
        "Transfer meat to a cutting board with tongs and discard bones and membranes, then cut meat across the grain into 1/2-inch-thick slices. 3Pour beef broth through a cheesecloth-lined sieve into a bowl and discard solids. Skim fat from cooking liquid and transfer liquid to a 3-quart saucepan. Add chicken broth and meat and reheat soup over moderately low heat.",
        "Meanwhile, cook noodles in a 6- to 8-quart pot of (unsalted) boiling water until tender, about 7 minutes (14 to 15 minutes for linguine). Drain noodles well in a colander and divide among 4 large soup bowls.",
        "Ladle broth over noodles and top with meat, scallion greens, bean sprouts, pickled mustard greens, cilantro sprigs, and red chile (if using).",
        "*Available at some Asian markets.",
        "**Available at some Asian markets and Uwajimaya (800-889-1928)."
    ],
    "ingredients": [
        "5 cups water",
        "1 cup soy sauce",
        "1 cup Chinese rice wine or medium-dry Sherry",
        "1/4 cup packed light brown sugar",
        "1 (1-inch) cube peeled fresh ginger, smashed",
        "1 bunch scallions, white parts smashed with flat side of a large knife and green parts chopped",
        "3 garlic cloves, smashed",
        "10 fresh cilantro stems plus 1/2 cup loosely packed fresh cilantro sprigs",
        "2 (2-inch-long) pieces Asian dried tangerine peel*",
        "4 whole star anise",
        "1/4 teaspoon dried hot red pepper flakes",
        "2 1/2 pounds meaty beef short ribs",
        "1 3/4 cups reduced-sodium chicken broth (14 ounces)",
        "10 ounces dried Chinese wheat noodles* or linguine",
        "1 cup fresh mung bean sprouts",
        "4 tablespoons Chinese pickled mustard greens**",
        "1 (4-inch-long) fresh red chile (optional), thinly sliced",
        "Special equipment: cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Dinner",
        "Winter",
        "Noodle",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Taiwanese Beef Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/taiwanese-beef-noodle-soup-231502"
}
