{
    "directions": [
        "Sprinkle chicken cubes with salt and pepper. Heat 1 tablespoon olive oil in a large skillet over medium heat, and cook and stir the chicken until the juices run clear, 5 to 10 minutes. Transfer the chicken to a bowl, and heat 1 more tablespoon olive oil in skillet over medium heat. Cook and stir the mushrooms, bell peppers, onion, and garlic until the vegetables are beginning to brown, about 10 minutes. Transfer the vegetables into the bowl with the chicken.",
        "Melt butter over medium-high heat in the same skillet, and whisk in the flour. Cook the mixture, whisking constantly, until the roux is lightly browned and gives off a toasted fragrance, about 2 minutes. Whisk in the broth, bring to a simmer, and whisk until thickened. Reduce heat to low, and whisk in the cream, sour cream, ketchup, hot sauce, cumin, and ground dried chiles. Cover the skillet, and simmer until thick and the flavors have blended, about 15 minutes, stirring occasionally. Gently stir in the chicken and vegetables. Serve rolled in flour tortillas."
    ],
    "ingredients": [
        "4 large skinless, boneless chicken breast halves - cubed",
        "salt and pepper to taste",
        "2 tablespoons extra virgin olive oil, divided",
        "1 (8 ounce) package sliced fresh mushrooms",
        "2 large red bell peppers, cut into chunks",
        "1 large yellow onion, sliced",
        "2 cloves garlic, minced",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 1/2 cups low-sodium chicken broth",
        "1 1/2 cups heavy cream",
        "1/4 cup sour cream",
        "3 tablespoons ketchup, or to taste",
        "2 dashes hot pepper sauce (such as Frank's RedHot®), or to taste",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground dried Anaheim or California chiles (optional)",
        "12 (6 inch) flour tortillas"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Take-Out Fake-Out Pollo Con Crema",
    "url": "http://allrecipes.com/recipe/214823/take-out-fake-out-pollo-con-crema/"
}
