{
    "directions": [
        "Preheat an oven to 400°F.",
        "In an All-Clad lasagna pan or a large, deep sauté pan over medium heat, warm the oil until almost smoking. Add the onions, bell peppers and chilies and cook, stirring occasionally, until softened, 10 to 15 minutes. Transfer to a bowl.",
        "In the same pan over medium heat, cook the ground beef, stirring occasionally with a wooden spoon to break up the meat, until browned, about 10 minutes. Stir in the onion mixture, the corn, cumin, chili powder, tomatoes, tomato paste and the 3 1⁄2 Tbs. salt and bring to a simmer. Reduce the heat to low and simmer for 20 minutes. Taste and adjust the seasonings with salt. Remove from the heat and let stand for 15 minutes. If the meat mixture was cooked in a sauté pan, transfer it to a lasagna pan. Sprinkle with the cilantro.",
        "Put the corn bread mix in a large bowl and stir in the cheese. Prepare the corn bread batter according to the package instructions and spread the batter evenly over the meat mixture. Bake until the corn bread is golden brown and a knife inserted into the center comes out clean, about 30 minutes. Let the tamale pie rest for 20 minutes before serving. Accompany with sour cream. Serves 16.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "3 Tbs. canola oil",
        "3 yellow onions, thinly sliced with a mandoline",
        "3 large green bell peppers, seeded and chopped",
        "3 to 5 serrano chilies, seeded and minced",
        "4 1⁄2 lb. ground lean beef",
        "4 cups corn kernels, fresh or thawed frozen",
        "1⁄4 cup ground cumin",
        "4 1⁄2 Tbs. chili powder",
        "1 can (14.5 oz.) diced tomatoes, drained",
        "1 can (6 oz.) tomato paste",
        "3 1⁄2 Tbs. coarse salt, plus more, to taste",
        "1 cup chopped fresh cilantro",
        "1 box Buckeye corn bread mix",
        "1 cup shredded Monterey jack cheese",
        "Sour cream for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tamale Pie",
    "url": "http://www.williams-sonoma.com/recipe/tamale-pie.html"
}
