{
    "directions": [
        "Heat chiles over gas flame or in broiler until softened, turning often with tongs to avoid burning, 1 to 2 minutes. Cool. Remove stems and seeds. Tear chiles into 2-inch pieces; place in small bowl. Add 1/2 cup hot water. Let stand until softened, about 20 minutes. Place chiles with soaking liquid, orange juice, and next 6 ingredients in blender. Puree until smooth. Strain into small saucepan; discard solids in strainer. Simmer uncovered over medium-low heat until slightly thickened and glaze measures 1 1/3 cups, about 10 minutes. Season glaze with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat broiler. Sprinkle fillets with salt and pepper. Broil until brown, about 2 minutes per side. Spoon 1 tablespoon glaze over each fillet; sprinkle with pepper. Broil until just cooked through and glaze is bubbling, about 2 minutes. Top with Habanero-Orange Salsa; serve immediately.",
        "* Available at many supermarkets and at specialty foods stores and Latin markets."
    ],
    "ingredients": [
        "3 dried ancho chiles*",
        "1/2 cup hot water",
        "1/2 cup fresh orange juice",
        "1/4 cup honey",
        "2 garlic cloves",
        "3 tablespoons tamarind concentrate",
        "2 tablespoons red wine vinegar",
        "2 tablespoons extra-virgin olive oil",
        "2 teaspoons dry mustard",
        "4 6-ounce black cod fillets, with or without skin",
        "Habanero-Orange Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Low Cal",
        "Dinner",
        "Cod",
        "Hot Pepper",
        "Healthy",
        "Tamarind",
        "Orange Juice",
        "Chile Pepper",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tamarind-Glazed Black Cod with Habanero-Orange Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/tamarind-glazed-black-cod-with-habanero-orange-salsa-359350"
}
