{
    "directions": [
        "Thoroughly thaw the banana leaves, taking care not to break the leaves when unfolding them. Place the leaves on a cutting board and use a sharp knife to remove the hard center rib. Using a moist towel, clean the leaves. Reserve a few leaves and cut the rest crosswise into 10-by-12-inch rectangles.",
        "Place the masa in a bowl. Spoon some of the residual oil from the mole that separated while frying into the masa—just enough to slightly color the masa. Mix in the lard and knead for about 10 minutes, adding enough chicken broth to form a soft dough. Continue kneading for an additional 10 to 15 minutes. Season to taste with salt.",
        "Arrange a banana leaf rectangle, smooth side down, on a work surface and top with a large spoonful of masa. Spread the masa to cover the entire leaf with a thin, even layer. Place three pieces of chicken in the center of the leaf and cover with two tablespoons of mole. Fold in thirds, as if folding a letter, then tuck the ends under. Repeat with remaining banana leaves, chicken, and mole.",
        "Fill a large steamer or tamalera with salted water to just below the steamer rack and bring to a boil. Arrange the tamales in a crisscross pattern on the rack, leaving enough space between them to allow steam to circulate. Cover the tamales with the reserved banana leaves and cover the pot with a lid. Steam the tamales at a full boil for about 1 hour and serve."
    ],
    "ingredients": [
        "1 1/2 packages frozen banana leaves",
        "1 pound fresh corn masa",
        "4 cooked chicken breasts, cut into 1-inch pieces",
        "2 cups Mole Poblano",
        "1/4 pound fresh lard (see Cooks' note)",
        "1 cup chicken stock or low-sodium chicken broth",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Cinco de Mayo",
        "Dinner",
        "Lunch",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Tamales de Mole Poblano",
    "url": "http://www.epicurious.com/recipes/food/views/tamales-de-mole-poblano-51110610"
}
