{
    "directions": [
        "In a small pot or saucepan, mix together the first 7 ingredients (tamarind paste to 3/4 cup water). Bring the mixture to a boil over medium heat, then reduce to low and cook for 10 minutes.",
        "In a separate bowl, mix the cornstarch with the 2 tablespoons of water until it is dissolved and smooth. Add the cornstarch mixture to the pot and stir until it is well combined and the sauce begins to thicken like a glaze. Continue to cook and reduce by one third, 2 to 3 minutes. Then turn the heat to the lowest possible setting and cover the pot with a lid to keep the sauce warm.",
        "In a large skillet, heat the sesame oil over medium-high heat. Add your chicken pieces and about a quarter of the sauce and cook for 5 minutes without stirring. Then toss the chicken pieces, doing your best to flip them over, adding another quarter of the sauce. Cook until the inside of the meat is white, 6 to 8 minutes more.",
        "Remove the chicken from the heat and allow it to rest until the pieces are cool enough to handle. Weave the chicken onto the bamboo skewers, about 4 per skewer, and lay them flat on a serving dish or a large plate. Drizzle the remaining sauce over the skewers and sprinkle with white toasted sesame seeds and the sliced green onions. Serve and eat immediately."
    ],
    "ingredients": [
        "1 tablespoon tamarind paste (or substitute with pomegranate molasses)",
        "1 tablespoon dark brown sugar",
        "2 teaspoons unseasoned rice vinegar",
        "2 teaspoons molasses",
        "1/4 teaspoon garlic powder",
        "3 garlic cloves, diced",
        "3/4 cup water plus 2 tablespoons",
        "1 tablespoon cornstarch",
        "2 teaspoons sesame oil",
        "8 boneless, skinless chicken thighs, cut into 1/2-inch-wide strips",
        "Bamboo skewers",
        "White toasted sesame seeds, for garnish",
        "2 green onions, thinly sliced (everything but the bulb), for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Low Sodium",
        "Dinner",
        "Healthy",
        "Advance Prep Required",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tamarind \"Teriyaki\" Chicken Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/tamarind-teriyaki-chicken-skewers-51171800"
}
