{
    "directions": [
        "To make the marinade, in a large bowl, stir together the yogurt, tomato paste, lemon juice, garam masala, turmeric, salt and cayenne. Set aside.",
        "Using a sharp, heavy knife, separate the chicken wings into drumettes and wings, discarding the wing tip joint. Add the chicken pieces to the bowl with the marinade and toss to coat well. Cover and let marinate in the refrigerator for 30 minutes.",
        "Preheat a broiler. Coat a baking sheet lightly with cooking spray, line with aluminum foil and coat again.",
        "Remove the chicken wings from the marinade and arrange on the prepared pan. Slip under the broiler about 6 inches (15 cm) from the heat source and broil for 8 minutes. Remove the pan from the oven, flip the wings over and broil until the chicken is opaque throughout, about 8 minutes longer. Don’t worry if the wings have blackened spots on them.",
        "Meanwhile, make the yogurt sauce: In a bowl, combine the yogurt, lemon juice and zest, and cilantro and stir to mix well. Season with salt and pepper.",
        "To serve, transfer the wings to a platter and spoon the yogurt sauce into a serving bowl alongside. Serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Chicken Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "3/4 cup (6 oz./180 g) plain whole-milk yogurt",
        "1 Tbs. tomato paste",
        "1 Tbs. fresh lemon juice",
        "2 tsp. garam masala",
        "1 tsp. ground turmeric",
        "1 tsp. kosher salt",
        "1/4 tsp. cayenne pepper",
        "3 lb. (1.5 kg) whole chicken wings",
        "3/4 cup (6 oz./185 g) yogurt",
        "Grated zest and juice of 1 lemon",
        "1 Tbs. chopped fresh cilantro",
        "Kosher salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tandoori Chicken Wings with Lemon",
    "url": "http://www.williams-sonoma.com/recipe/tandoori-chicken-wings-with-lemon.html"
}
