{
    "directions": [
        "Mince garlic with salt and mash to a paste. Wearing protective gloves, mince chile (including seeds for a spicier paste) and in a bowl stir together with garlic paste and remaining spice paste ingredients.",
        "Make 3 diagonal cuts about 1/4 inch deep in each chicken breast and rub spice paste into cuts and all over chicken. Marinate chicken, covered, 30 minutes at cool room temperature.",
        "Preheat broiler and line broiler pan with foil. Halve onion through root end and reserve 1 half for sauce. Thinly slice remaining onion half, separating layers, and in a small bowl soak onion slices in ice water to cover while broiling chicken.",
        "Arrange chicken without crowding on rack of broiler pan. Brush chicken with 1 teaspoon vegetable oil and broil about 3 inches from heat 8 minutes. Turn chicken over and brush with remaining teaspoon vegetable oil. Broil chicken until lightly browned and just cooked through, about 6 minutes more.",
        "Mince enough reserved onion to measure 1 tablespoon and in a small bowl stir together with all sauce ingredients.",
        "Drain soaked onion and pat dry between paper towels. Top chicken with onion slices and serve with yogurt sauce."
    ],
    "ingredients": [
        "1 large garlic clove",
        "1 1/2 teaspoons coarse salt",
        "1 small fresh red or green chile such as serrano or cayenne",
        "1/3 cup low-fat plain yogurt",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons grated peeled fresh gingerroot",
        "1 1/2 teaspoons ground coriander seeds",
        "3/4 teaspoon turmeric",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground cloves",
        "4 skinless boneless chicken breast halves (about 1 1/4 pounds total)",
        "1 small red onion",
        "2 teaspoons vegetable oil",
        "1/2 cup low-fat plain yogurt",
        "1 teaspoon fresh lemon juice",
        "a pinch cayenne"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Poultry",
        "Broil",
        "Marinate",
        "Low Fat",
        "Yogurt",
        "Hot Pepper",
        "Spring",
        "Healthy",
        "Gourmet"
    ],
    "title": "Tandoori-Spiced Chicken Breasts",
    "url": "http://www.epicurious.com/recipes/food/views/tandoori-spiced-chicken-breasts-101511"
}
