{
    "directions": [
        "Force chutney through a sieve into a bowl and whisk in lime juice, oil, cayenne, and salt to taste. Dressing may be made 1 day ahead and chilled, covered. Bring dressing to room temperature before using.",
        "In a large non-stick skillet dry-roast paprika, cumin, and coriander seeds over moderate heat, stirring occasionally, until fragrant and several shades darker, about 2 minutes, being careful not to burn them, and transfer to a bowl. Cool spices and stir in remaining marinade ingredients and salt and pepper to taste.",
        "Pat shrimp dry and add to marinade, stirring to coat well. Marinate shrimp at room temperature 15 minutes. Alternatively, shrimp may be marinated, covered and chilled, up to 1 day.",
        "In large non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté shrimp in batches, turning once, until golden and cooked through, 3 to 4 minutes. Transfer shrimp as sautéed with tongs to paper towels to drain and cool slightly.",
        "In a large bowl gently toss together shrimp, watercress, coriander sprigs, bell peppers, mangoes, and dressing."
    ],
    "ingredients": [
        "1/2 cup Major Grey's chutney",
        "2/3 cup fresh lime juice",
        "1/2 cup vegetable oil",
        "1 teaspoon cayenne",
        "1 tablespoon paprika",
        "2 teaspoons ground cumin",
        "2 teaspoons ground coriander seeds",
        "4 garlic cloves, crushed",
        "a 1-inch piece fresh gingerroot, peeled and chopped",
        "2 fresh serrano or jalapeño chilies, seeded and chopped (wear rubber gloves)",
        "3/4 cup plain yogurt",
        "1 teaspoon freshly grated lime zest (about 1 lime)",
        "2 pounds medium shrimp (about 50), shelled and deveined",
        "1/4 cup vegetable oil for frying",
        "6 cups packed tender watercress sprigs, washed well and spun dry",
        "1 cup fresh coriander sprigs, washed well and spun dry",
        "3 red bell peppers, cut into julienne strips",
        "2 firm-ripe mangoes, peeled and cut into julienne strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Leafy Green",
        "Pepper",
        "Shellfish",
        "Marinate",
        "Sauté",
        "Mango",
        "Summer",
        "Gourmet"
    ],
    "title": "Tandoori Shrimp and Mango Salad",
    "url": "http://www.epicurious.com/recipes/food/views/tandoori-shrimp-and-mango-salad-13007"
}
