{
    "directions": [
        "Arrange boneless chicken breasts in single layer in large glass baking dish. Sprinkle with fresh lemon juice: season with salt. Mix plain yogurt, chopped fresh ginger, chopped garlic, ground cumin, ground coriander, cayenne pepper and turmeric in medium bowl. Pour yogurt marinade over chicken breasts and turn to coat. Cover chicken and refrigerate 3 to 8 hours.",
        "Prepare barbecue (medium-high heat) or preheat broiler. Remove chicken breasts from marinade (do not wipe clean). Grill or broil chicken until just cooked through, about 5 minutes per side. Cool slightly. (Chicken can be prepared up to 2 hours ahead. Cover and let stand at room temperature.)",
        "Lightly toast (or grill) sourdough bread. Spread 1 side of each piece of bread generously with Indian Spiced Mayonnaise. Slice chicken breasts diagonally. Place slices of 1 breast atop each of 6 sourdough bread slices. Top with remaining bread slices. Cut chicken sandwiches in half. Serve sandwiches warm or at room temperature.",
        "Combine 1 cup mint leaves, 1 cup cilantro leaves, minced jalapeño chili and chopped onion in work bowl of processor. Process until very finely chopped. Mix in cider vinegar. Add mayonnaise and process just until combined. Season mayonnaise to taste with salt and pepper. (Mayonnaise can be prepared 3 days ahead. Cover tightly and refrigerate.) Makes about 1 scant cup."
    ],
    "ingredients": [
        "6 skinless boneless chicken breast halves",
        "2 tablespoons fresh lemon juice",
        "1 cup plain yogurt",
        "2 tablespoons chopped fresh ginger",
        "2 garlic cloves, chopped",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon turmeric",
        "12 slices sourdough bread",
        "1 cup packed fresh mint leaves",
        "1 cup packed fresh cilantro leaves",
        "1 jalapeño chili, seeded, minced",
        "3 tablespoons chopped onion",
        "2 teaspoons cider vinegar",
        "1/2 cup mayonnaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Ginger",
        "Marinate",
        "Yogurt",
        "Lunch",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tandoori Chicken Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/tandoori-chicken-sandwiches-2344"
}
