{
    "directions": [
        "Position a rack in the lower third of an oven and preheat to 425°F.",
        "On a lightly floured work surface, roll out the larger pastry disk into a 13-inch round about 1/8 inch thick. Transfer to a 9-inch pie dish, easing it into the bottom and sides. Trim the overhang to 1/2 inch. Roll out the remaining pastry and transfer to a baking sheet. Place both pans in the refrigerator.",
        "In a large bowl, gently stir together the strawberries and rhubarb. In a small bowl, stir together the sugar and cornstarch until free of lumps. Add to the fruit mixture and stir to combine.",
        "Remove the pastry from the refrigerator and brush the bottom and sides with the egg mixture. Spoon the fruit mixture evenly into the dish. Dot with the butter. Place the top crust over the fruit and trim the edges to leave a 3/4-inch overhang. Fold the edge of the top crust under the edge of the bottom crust, then crimp to seal. Cut a few vents in the top. Set the pie on a baking sheet.",
        "Bake until the crust is golden, about 40 minutes. Transfer the pie to a wire rack and let cool for at least 1 hour before serving. Serves 8.",
        "Adapted from Williams-Sonoma",
        "Cooking from the Farmers’ Market,",
        "by Tasha DeSerio & Jodi Liano (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "Basic Pie Dough for a 9-inch double-crust pie, shaped into 2 disks, 1 slightly larger than the other",
        "1 1/2 lb. strawberries, hulled and thickly sliced (about 3 cups)",
        "1 1/2 lb. rhubarb, trimmed and cut into 3/4-inch pieces (about 3 cups)",
        "1 cup sugar",
        "1/4 cup plus 1 Tbs. cornstarch",
        "1 egg white, lightly beaten with a few drops of water until slightly foamy",
        "1 Tbs. unsalted butter, cut into small pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tangy Rhubarb-Strawberry Pie",
    "url": "http://www.williams-sonoma.com/recipe/tangy-rhubarb-strawberry-pie.html"
}
