{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Bring 1/2 cup sugar and 1/4 cup water to boil in heavy small saucepan over medium-low heat, stirring until sugar dissolves and brushing down sides of pan with wet pastry brush. Increase heat and boil without stirring until syrup is deep amber color, swirling pan occasionally, about 7 minutes. Pour caramel syrup into 8-inch-diameter cake pan with 1 1/2-inch-high sides; quickly rotate pan so syrup covers bottom.",
        "Whisk eggs, yolks, honey, vanilla, and salt in medium bowl to blend. Bring cream, condensed milk, and tangerine peel to simmer in medium saucepan. Slowly whisk hot cream mixture into egg mixture. Whisk in tangerine juice. Strain custard into caramel-lined pan. Place pan into 13x9x2-inch metal baking pan. Pour enough hot water into baking pan to come halfway up sides of cake pan.",
        "Bake flan until set in center when cake pan is slightly moved, about 40 minutes. Remove from water; cool 30 minutes. Chill flan uncovered until very cold and firm, at least 6 hours. (Can be made 1 day ahead. Cover; keep chilled.)",
        "Cut all peel and pith from each grapefruit. Working over medium bowl, cut between membranes, releasing segments. Chill until ready to use.",
        "Cut around flan in pan. Place plate on top of pan and invert, releasing flan. Cut into wedges; serve with grapefruit."
    ],
    "ingredients": [
        "3/4 cup sugar, divided",
        "1/4 cup water",
        "2 large eggs",
        "4 large egg yolks",
        "1 tablespoon honey",
        "1 teaspoon vanilla extract",
        "Pinch of salt",
        "3/4 cup heavy whipping cream",
        "1/4 cup sweetened condensed milk",
        "1/4 cup finely chopped tangerine peel (cut from 3 large tangerines with vegetable peeler)",
        "1 cup fresh tangerine juice",
        "2 pink grapefruits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Grapefruit",
        "Summer",
        "Chill",
        "Honey",
        "Tangerine",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tangerine-Honey Flan with Grapefruit Segments",
    "url": "http://www.epicurious.com/recipes/food/views/tangerine-honey-flan-with-grapefruit-segments-234825"
}
