{
    "directions": [
        "Cut the flank steak across the grain into slices 1/8 inch (3 mm) thick. In a large bowl, combine 1/2 tsp. of the sugar, the baking soda and 1 tsp. salt and stir to mix well. Add the beef slices and stir to coat thoroughly. Let stand at room temperature for 30 minutes.",
        "In a small bowl, stir together the tangerine zest and juice, sherry, hoisin sauce, soy sauce, chili bean paste, ginger, sesame oil, cornstarch and the remaining 1/4 tsp. sugar until the sugar and cornstarch dissolve. Set aside.",
        "Pat the beef slices dry with paper towels. Warm a wok or large fry pan over high heat, then swirl in 2 Tbs. of the canola oil. Add half of the beef in a single layer and sear until brown on the first side, about 1 minute. Using tongs, turn and sear until brown on the second side, about 30 seconds. Transfer the meat to a colander to drain. Return the pan to high heat, warm another 1 Tbs. of the oil and repeat to sear the remaining beef. Transfer the second batch to the colander to drain.",
        "Wipe the pan clean. Reheat over high heat and add the remaining 1 Tbs. oil. When the oil is hot, add the onion and bell pepper and stir-fry until the edges begin to brown, 3 to 4 minutes. Add the chile and garlic and stir-fry for 1 minute. Pour in the tangerine juice mixture and return the beef to the pan. Stir-fry until the sauce thickens and the beef is heated through, about 1 minute. Transfer to a bowl or platter and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Cook Good Food",
        "(Weldon Owen, 2014)"
    ],
    "ingredients": [
        "1 1/2 lb. (750 g) flank steak",
        "3/4 tsp. sugar",
        "1/4 tsp. baking soda",
        "Kosher salt",
        "1 tsp. finely grated tangerine or orange zest",
        "1/4 cup (2 fl. oz./60 ml) fresh tangerine or orange juice",
        "1 Tbs. dry sherry",
        "1 Tbs. hoisin sauce",
        "1/4 cup (2 fl. oz./60 ml) soy sauce",
        "1 tsp. chili bean paste",
        "1 tsp. peeled and minced fresh ginger",
        "1/2 tsp. Asian sesame oil",
        "1/4 tsp. cornstarch",
        "4 Tbs. (2 fl. oz./60 ml) canola oil",
        "1 small yellow onion, halved and thinly sliced",
        "1 small green bell pepper, seeded and thinly sliced lengthwise",
        "1 red Fresno chile, seeded and thinly sliced lengthwise",
        "2 garlic cloves, minced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tangerine Beef",
    "url": "http://www.williams-sonoma.com/recipe/tangerine-beef.html"
}
