{
    "directions": [
        "Combine 2 cups boiling water, tangerine, and dates in bowl. Cover; chill overnight. Drain dates. Peel each and quarter lengthwise.",
        "Blend flour, sugar, and salt in processor. Add butter and process until coarse meal forms. Add 3 tablespoons ice water. Process until dough comes together in moist clumps, adding more ice water by teaspoonfuls if dry. Gather into ball; flatten into disk. Wrap and chill at least 2 hours and up to 1 day.",
        "Preheat oven to 400°F. Roll out dough on floured surface to scant 1/8-inch thickness. Using small plate as guide, cut out 6-inch rounds. Gather dough scraps; reroll. Cut out additional rounds for total of 6. Fit each into 4-inch-diameter tart pan with removable bottom and 3/4-inch-high sides. Trim overhang; press dough to come 1/4 inch above top of pan sides. Freeze crusts in pans 10 minutes.",
        "Bake crusts until golden, pressing with back of fork if crusts bubble and sides begin to slide, about 20 minutes. Remove from oven. Brush hot crusts with some beaten egg white to coat. Cool while preparing filling. Reduce oven temperature to 350°F.",
        "Cook butter in heavy small skillet over medium heat until brown, swirling occasionally, about 3 minutes. Cool butter slightly. Whisk corn syrup, eggs, yolks, sugar, tangerine juice, brandy, tangerine peel, and salt in medium bowl to blend. Whisk in browned butter.",
        "Fill prepared crusts completely with filling (some may be left over). Bake tartlets until filling is set, about 25 minutes. Cool 15 minutes. Push up pan bottoms, releasing pan sides, and cool tarts completely. DO AHEAD Can be made 1 day ahead. Cover tarts; store at room temperature.",
        "Whisk cream, buttermilk, and 2 tablespoons sugar in medium bowl until peaks form. Refrigerate up to 1 hour.",
        "Place tartlets on plates. Top each tartlet with 4 date quarters in sunburst pattern and dollop of buttermilk whipped cream. Spoon tangerine granita into 6 small cups and place alongside."
    ],
    "ingredients": [
        "2 cups boiling water",
        "1 tangerine, halved horizontally",
        "6 Medjool dates, slit on 1 side, pits carefully removed",
        "1 1/2 cups all purpose flour",
        "1 tablespoon sugar",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "1 large egg white, beaten to blend",
        "1/4 cup (1/2 stick) unsalted butter",
        "3/4 cup dark corn syrup",
        "2 large eggs",
        "2 large egg yolks",
        "1/4 cup sugar",
        "1/4 cup fresh tangerine juice (from 2 small tangerines or purchased fresh juice)",
        "2 tablespoons brandy",
        "1 teaspoon (packed) finely grated tangerine peel",
        "1/4 teaspoon coarse kosher salt",
        "3/4 cup chilled heavy whipping cream",
        "1/4 cup chilled buttermilk",
        "2 tablespoons sugar",
        "Tangerine Granita"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "New Year's Day",
        "Date",
        "Brandy",
        "Winter",
        "Tangerine",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tangerine-Date Tartlets with Buttermilk Whipped Cream and Tangerine Granita",
    "url": "http://www.epicurious.com/recipes/food/views/tangerine-date-tartlets-with-buttermilk-whipped-cream-and-tangerine-granita-236544"
}
