{
    "directions": [
        "Bring a large pot of water to a boil and season generously with salt. Add lobsters head first to water and cook, covered, until shells are bright red and an antennae or leg pulls off easily, 8 to 10 minutes. Crack one open where the tail meets the body of the lobster. The flesh should be firm, white, and opaque. If it is still translucent, then the lobster needs more time to finish cooking. Drain lobsters head down in a colander to release excess liquid.",
        "When cool enough to handle, crack lobster shells and remove meat from tails, claws, and knuckles. Tear the meat by hand into 1-inch pieces and place in a large bowl.",
        "In a small bowl, combine the mayonnaise, lemon, celery, tarragon, cayenne, pepper, and 1/4 teaspoon salt. Pour over lobster meat and gently stir until lobster is well coated. Taste and adjust seasoning, adding more mayonnaise if desired. Chill lobster mixture for 15 to 30 minutes.",
        "Spread cut sides of buns with butter. Heat a large skillet over medium heat and toast buns, buttered side down, until golden brown, about 2 minutes per bun. Fill each bun with lobster mixture and sprinkle with an extra dash cayenne, if desired. Serve immediately."
    ],
    "ingredients": [
        "Kosher salt",
        "3 live Maine lobsters, 1 1/4 pound each",
        "3 tablespoons mayonnaise, plus more if desired",
        "2 tablespoons lemon juice",
        "1/4 cup finely diced celery",
        "1 tablespoon chopped fresh tarragon",
        "Dash cayenne pepper, plus more to taste",
        "1/4 teaspoon freshly ground black pepper",
        "4 split-top, white hot dog buns",
        "2 tablespoons unsalted butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Mayonnaise",
        "Lobster",
        "Summer",
        "Tarragon",
        "Sandwich Theory"
    ],
    "title": "Tarragon Lobster Roll",
    "url": "http://www.epicurious.com/recipes/food/views/tarragon-lobster-roll-51245010"
}
