{
    "directions": [
        "To make the marinade, mix 1/2 cup lemon juice, olive oil, garlic, and red pepper flakes together in a bowl.",
        "Place the chicken breasts on a flat surface, and cut from one side through the middle of the breasts to within one half inch of the other side. Open the two sides and spread them out flat like an open book. Place in a shallow dish, and pour the olive oil mixture over the chicken, turning once to coat evenly with marinade. Refrigerate for at least 30 minutes.",
        "To make the dressing, mix the sour cream, mayonnaise, vinegar, and 1/4 cup lemon juice together in a bowl, and blend thoroughly. Set aside.",
        "Preheat an outdoor grill for medium-high heat. Lightly oil grill grate, and place about 4 inches from heat source.",
        "Remove chicken from marinade, and discard marinade. Cook chicken on preheated grill, turning once, until meat is firm, and juices run clear, about 4 to 5 minutes per side. Remove chicken from grill, and cool. Finely chop chicken, and place in a large bowl.",
        "Add the grapes, apples, celery, tarragon, and dill to the bowl with the chicken. Stir in the mayonnaise dressing, and toss until ingredients are evenly coated. Season to taste with salt and pepper. Serve immediately, or refrigerate overnight to let flavors blend further."
    ],
    "ingredients": [
        "1/2 cup lemon juice",
        "1/4 cup olive oil",
        "4 cloves garlic, minced",
        "1 tablespoon crushed red pepper flakes, or to taste",
        "3 (6 ounce) skinless boneless chicken breasts",
        "1/2 cup sour cream",
        "1/2 cup reduced-fat mayonnaise",
        "1/4 cup rice vinegar or cider vinegar",
        "1/4 cup fresh lemon juice",
        "1 cup seedless red grapes, halved",
        "1 large Granny Smith apple, cored and chopped",
        "1/2 cup celery, diced",
        "1/2 onion, finely chopped",
        "1/2 cup fresh tarragon, finely chopped",
        "2 teaspoons finely chopped fresh dill",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tarragon-Dill Grilled Chicken Salad",
    "url": "http://allrecipes.com/recipe/145421/tarragon-dill-grilled-chicken-salad/"
}
