{
    "directions": [
        "Mix 5 tablespoons butter, 2 tablespoons vermouth, 1 tablespoon tarragon, and garlic in medium saucepan. Bring to simmer over medium-low heat, stirring until butter melts. Simmer for 1 minute. Season mixture with salt and pepper. (Can be made 1 day ahead. Cover; chill. Before using, stir over low heat until butter melts.)",
        "Set rack in bottom third of oven and preheat to 400°F. Rinse turkey inside and out; pat dry. Place turkey on rack in large roasting pan. Place reserved turkey parts in roasting pan. Sprinkle turkey inside and out with salt and pepper. Tuck wing tips under turkey; tie legs together. Cover turkey breast tightly with foil. Roast 2 hours, lifting foil and brushing entire turkey with some of butter mixture every 30 minutes. Remove foil. Brush turkey with any remaining butter mixture. Reduce heat to 325°F. Continue roasting turkey until thermometer inserted into thickest part of thigh registers 175°F, about 30 minutes longer. Transfer turkey to platter. Tent loosely with foil; let stand 30 minutes (internal temperature of turkey will increase by 5 to 10 degrees). Reserve pan juices for gravy.",
        "Remove turkey parts from roasting pan and discard. Pour pan juices into large measuring cup. Spoon off fat. Return pan juices to roasting pan. Add 1 3/4 cups broth, remaining 1/2 tablespoon tarragon, and 3 tablespoons butter. Position roasting pan directly over 2 burners set at medium-high heat. Bring mixture to boil, scraping up browned bits. Boil 5 minutes. Transfer mixture to heavy medium saucepan. Add remaining 2/3 cup vermouth. Whisk remaining 1/4 cup broth and cornstarch in small bowl until smooth. Add to gravy mixture. Bring to boil, whisking constantly. Boil until gravy coats back of spoon thinly, about 8 minutes. Season gravy with salt and pepper. Serve turkey with gravy."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) unsalted butter",
        "2 tablespoons plus 2/3 cup dry white vermouth",
        "1 1/2 tablespoons dried tarragon",
        "4 garlic cloves, mashed, chopped",
        "1 12- to 14-pound turkey; neck, gizzard and heart reserved",
        "2 cups canned low-salt chicken broth",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Tarragon"
    ],
    "title": "Tarragon Roast Turkey with Vermouth",
    "url": "http://www.epicurious.com/recipes/food/views/tarragon-roast-turkey-with-vermouth-105800"
}
