{
    "directions": [
        "Preheat oven to 425°F.",
        "Roll pastry sheet into a 101/2-inch square on a floured work surface with a floured rolling pin. Brush off excess flour and cut out a 10-inch round with a sharp knife, using a plate as a guide. Transfer round to a baking sheet and chill.",
        "Spread butter thickly on bottom and side of skillet and pour sugar evenly over bottom. Arrange as many apples as will fit vertically on sugar, packing them tightly in concentric circles. Apples will stick up above rim of skillet.",
        "Cook apples over moderately high heat, undisturbed, until juices are deep golden and bubbling, 18 to 25 minutes. (Don't worry if juices color unevenly.)",
        "Put skillet in middle of oven over a piece of foil to catch any drips. Bake 20 minutes (apples will settle slightly), then remove from oven and lay pastry round over apples.",
        "Bake tart until pastry is browned, 20 to 25 minutes. Transfer skillet to a rack and cool at least 10 minutes.",
        "Just before serving, invert a platter with lip over skillet and, using potholders to hold skillet and plate tightly together, invert tart onto platter. Replace any apples that stick to skillet. (Don't worry if there are black spots; they won't affect the flavor of the tart.) Brush any excess caramel from skillet over apples. Serve immediately."
    ],
    "ingredients": [
        "frozen puff pastry sheet (from a 17 1/4-ounce package)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/2 cup sugar",
        "7 to 9 Gala apples (3 to 4 pounds), peeled, quartered lengthwise, and cored",
        "Special equipment: a well-seasoned 10-inch cast-iron skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/tarte-tatin-104777"
}
