{
    "directions": [
        "Place pears and granulated sugar in a medium saucepan. Pour in wine, then add enough water to cover the pears by at least 1/2 inch.",
        "Simmer, uncovered, until pears can be easily pierced with the tip of a knife, but are not mushy, 10 to 15 minutes.",
        "Strain pears, discarding the liquid, and set aside on a cutting board. Once completely cool, cut pears into thin slices.",
        "Preheat the oven to 350°F. Line pans with 24 baking cups.",
        "In a stand mixer with the paddle attachment, combine the pears, granulated sugar, and brown sugar, and mix on medium-low until well combined, about 1 minute.",
        "With mixer running, slowly pour in the oil. Continue mixing until combined. Stop the mixer, remove the bowl and paddle, and use the paddle to scrape the insides of bowl, making sure everything is fully incorporated.",
        "Sift together the flour, baking powder, baking soda, salt, cardamom, and nutmeg and add to the batter. Reattach the bowl and paddle to the mixer, and mix on medium until just combined, then add eggs and continue mixing until the batter is homogenous, about 10 to 20 seconds. Remove the bowl and paddle from the mixer and, once again, use the paddle to scrape the bottom and sides of the bowl, ensuring that everything is well mixed.",
        "Scoop cake batter into the prepared baking cups, filling them three quarters of the way.",
        "Bake in the middle of the oven for 20 to 25 minutes, rotating the pan halfway through. The cupcakes are done when the centers spring back when you touch them.",
        "Remove the cupcakes from oven, and let cool completely while you make the almonds and buttercream. Leave the oven on.",
        "Depending on the kind of pears you use, your cake batter may appear loose and watery. If this happens to you, add another 1/4 cup of flour, then allow cake to sit in the refrigerator for 10 minutes or so to allow the batter to hydrate a bit before baking.",
        "Line a baking sheet with aluminum foil. Using a sturdy chefs knife, roughly chop the almonds.",
        "Place in a hot oven until toasted, 5 to 7 minutes.",
        "Remove the sheet from the oven, and immediately add the butter and salt. Gather up the corners of the aluminum foil, pinch to seal, then vigorously shake to coat the almonds. Set aside to cool.",
        "Prepare the recipe for French Buttercream . Add the almond extract and beat well.",
        "Fill a pastry bag fitted with a fluted tip with the almond buttercream, and pipe onto each pear cupcake.",
        "Fan a few slices of pear across each cupcake. Sprinkle the chopped roasted almonds on top."
    ],
    "ingredients": [
        "2 Bosc or Anjou pears, peeled, cored and quartered",
        "1/2 cup granulated sugar",
        "1 cup white wine (pick something delicious, fruity, and not too expensive: ask the clerk at the wine store to help you)",
        "2 cups peeled, shredded, drained, and pressed pears (about 2 large cooking pears)",
        "1 cup granulated sugar",
        "1 cup brown sugar",
        "1 1/4 cup canola oil or grapeseed oil",
        "2 1/4 cups all-purpose flour, sifted",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "4 large eggs, beaten",
        "1 teaspoon kosher salt",
        "1/2 teaspoon cardamom",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 cup whole almonds",
        "1/2 teaspoon unsalted butter",
        "1/2 teaspoon kosher salt",
        "One recipe French Buttercream",
        "1 1/2 teaspoons pure all-natural almond extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Tarte Bourdaloue",
    "url": "http://www.epicurious.com/recipes/food/views/tarte-bourdaloue-51194810"
}
