{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out pastry on a lightly floured surface with a lightly floured rolling pin into an 11-inch square. Trim off corners of pastry with a sharp knife to form an 11-inch round, then transfer to a baking sheet and prick all over with a fork. Chill until ready to use.",
        "Peel and core apples and cut each into 6 wedges.",
        "Stir together sugar and water with a fork in an ovenproof 12-inch heavy skillet, then cook over moderate heat, stirring occasionally and washing down any sugar crystals on side of skillet with pastry brush dipped in cold water, until sugar is melted and pale golden, 5 to 6 minutes. Continue cooking, without stirring, swirling skillet, until melted into a deep amber caramel, about 1 minute more. Remove from heat and whisk in vinegar and butter until incorporated (use caution; mixture will bubble and steam vigorously).",
        "Arrange apple wedges, a cut side down, side by side, overlapping slightly, in caramel in skillet in even concentric circles and cook over moderately low heat, undisturbed, until apples are tender and caramel is thickened, 15 to 20 minutes. Drape pastry round over apples, tucking it around them.",
        "Transfer skillet to oven and bake tart until pastry is golden brown, about 30 minutes.",
        "Cool tart in skillet on a rack 15 minutes. Invert platter over skillet, and using pot holders to hold platter and skillet firmly together, invert tart onto platter. Replace any apples that may stick to skillet and pour any caramel remaining in skillet over apples. Serve warm, with scoops of chestnut ice cream and candied bacon."
    ],
    "ingredients": [
        "1 puff pastry sheet (from a 17 1/4-oz package), thawed",
        "5 medium Macoun, Pippin, Gravenstein, or Golden Delicious apples (2 3/4 lb)",
        "1 cup sugar",
        "1/4 cup water",
        "1 1/2 tablespoons cider vinegar",
        "3 tablespoons unsalted butter, cut into pieces",
        "Special equipment: a pastry brush; a round 12-inch platter with a lip",
        "Accompaniments: Chestnut ice cream and candied bacon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Gourmet",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/tarte-tatin-237188"
}
