{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 6 4-inch tart pans with butter, then dust with flour.",
        "In a bowl, stir 2/3 cup confectioners' sugar and ground almonds together until well combined. Mix in the flour, then stir in the unsalted butter and egg. Mix a few times until the dough is smooth and pliable, then form into a ball and place into the freezer for about 15 minutes.",
        "Divide the dough into 6 pieces, then roll each piece out to a circle about 5 inches in diameter. Pat the dough into the prepared tart pans; place parchment paper on top of the dough. Place several tablespoons of dried beans or pie weights into the bottom of each shell.",
        "Bake the tart shells in the preheated oven until golden brown, about 20 minutes. Set the shells aside in their pans to cool on a rack. Remove and discard paper; save beans or pie weights for other baking use.",
        "In a bowl, whisk together the mascarpone cheese, yogurt, 4 1/2 tablespoons of confectioners' sugar, and scraped vanilla beans until the mixture is thick and smooth. Spoon about 2 tablespoons of mascarpone filling into each cooled tart shell; arrange raspberries on top of the filling in an attractive low mound. Sprinkle each tart with pistachios. Refrigerate at least 15 minutes before serving."
    ],
    "ingredients": [
        "2/3 cup confectioners' sugar",
        "1/4 cup ground almonds",
        "1 7/8 cups sifted all-purpose flour",
        "1/2 cup softened unsalted butter",
        "1 egg",
        "9 ounces mascarpone cheese",
        "1/2 cup Greek yogurt",
        "4 1/2 tablespoons confectioners' sugar",
        "1 vanilla bean, slit lengthwise, seeds scraped",
        "1 pound fresh raspberries",
        "3/4 cup coarsely chopped unsalted pistachios"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tartelettes de Framboises au Mascarpone (Raspberry Tartlets)",
    "url": "http://allrecipes.com/recipe/216652/tartelettes-de-framboises-au-mascarpo/"
}
