{
    "directions": [
        "Trim excess fat from short ribs then cut between the bones.",
        "In a saucepan over moderate heat, dry-roast the chiles. Transfer to a spice grinder and grind into a powder.",
        "In the same saucepan, dry-roast the onions and garlic. Transfer to a blender, add the piloncillo, beer or pulque, agave, tequila, and the powdered chiles, and process until smooth.",
        "In a medium saucepan, heat the lard and fry the chile mixture. Season with salt and let cool. Coat the meat with the chile mixture, cover, and marinate in the refrigerator overnight.",
        "Preheat the oven to 375°F and arrange a steamer in a roasting pan.",
        "In a saucepan over moderate heat, dry-roast the maguey or agave leaves. Transfer to the roasting pan on the steamer and top with 2 cactus paddles. Place the ribs with the marinade on top and cover with the remaining 2 cactus paddles. Cover the pan with foil or a lid and bake until the ribs are fork tender, 3 to 4 hours, checking the water level every 30 minutes and adding 1/2 cup of water when it gets very low.",
        "Transfer the short ribs to a serving platter. Slice the cactus paddles into strips and place them on top of the ribs. Serve with Frijoles de la Olla and tortillas."
    ],
    "ingredients": [
        "4 (3-inch cut) short ribs",
        "8 ancho chiles, veins removed and seeded",
        "1 pound onions, cut into quarters",
        "5 cloves garlic",
        "3 ounces piloncillo (Mexican brown sugar)",
        "1 quart beer or pulque",
        "1/2 cup agave nectar",
        "1/2 cup tequila",
        "1 ounce lard",
        "3 maguey or agave leaves",
        "4 cactus paddles, trimmed of spines",
        "Frijoles de la Olla",
        "Tortillas",
        "Special equipment: Spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Beef",
        "Onion",
        "Braise",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Chile Pepper"
    ],
    "title": "Tatemado de Costilla de Res (Tatemado Short Ribs)",
    "url": "http://www.epicurious.com/recipes/food/views/tatemado-de-costilla-de-res-tatemado-short-ribs-51110270"
}
