{
    "directions": [
        "Pat duck breasts dry. Score skin about 1/2 inch apart through fat (do not cut into meat) in a crosshatch pattern with a sharp knife.",
        "Combine rice wine, soy sauce, sesame oil, and ginger in a sealable plastic bag. Add duck, skin side up, and press out as much air as possible before sealing. Marinate duck (skin side up), chilled, at least 2 hours or overnight. Transfer duck breasts to a plate and pat dry, discarding marinade.",
        "Toast peppercorns and salt in a dry small heavy skillet over moderately low heat, stirring mixture and shaking skillet occasionally, until peppercorns are fragrant, 3 to 5 minutes. Coarsely grind mixture in grinder. Rub mixture all over duck, then let stand, uncovered, at room temperature, 1 hour.",
        "Meanwhile, line bottom of wok and inside of lid with a double layer of heavy-duty foil, leaving a 3-inch overhang along edges. Stir together tea leaves, rice, brown sugar, and cinnamon pieces in a small bowl, then spread in an even layer (1/4 inch thick) on bottom of wok. Invert rack and set in wok. (It will rest 1 1/2 to 2 inches from bottom of wok.)",
        "Heat a 12-inch heavy skillet over moderately high heat until hot but not smoking, then swirl in vegetable oil. Add duck breasts, skin sides down, and sear, without turning, until skin is deep golden brown, 2 to 3 minutes.",
        "Using tongs, transfer duck breasts, skin sides up, to center of rack in wok, arranging them 1 inch apart. Heat wok, uncovered, over high heat, until steady wisps of smoke begin to appear, 5 to 10 minutes. Reduce heat to moderate, then cover wok and, using oven mitts, fold overhang from wok and lid together, crimping to seal tightly (foil will be very hot). Smoke duck breasts, covered, 8 minutes, then remove wok from heat and let stand, covered, 10 minutes for medium-rare to medium. Carefully unwrap foil (smoke and steam will billow out) and transfer duck to a cutting board. Let stand, loosely covered with foil, 10 minutes. Cut each duck breast across the grain into thin slices. Serve duck warm or at room temperature."
    ],
    "ingredients": [
        "2 (1-lb) Muscovy or Moulard duck breast halves with skin",
        "2 tablespoons Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "1 tablespoon soy sauce",
        "1 teaspoon Asian sesame oil",
        "1/2 teaspoon finely grated (preferably with a Microplane rasp) peeled fresh ginger",
        "1 tablespoon Sichuan peppercorns",
        "2 1/2 teaspoons kosher salt",
        "1/3 cup loose black tea leaves",
        "1/3 cup rice",
        "3 tablespoons packed dark brown sugar",
        "1 (3-inch) cinnamon stick, broken into small pieces",
        "1/2 teaspoon vegetable oil",
        "Special equipment: an electric coffee/spice grinder; a 14-inch flat-bottomed wok with a lid; heavy-duty foil; a 10- to 11-inch round metal rack"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Wok",
        "Duck",
        "Game",
        "Poultry",
        "Christmas",
        "Gourmet"
    ],
    "title": "Tea-Smoked Duck Breasts",
    "url": "http://www.epicurious.com/recipes/food/views/tea-smoked-duck-breasts-235728"
}
