{
    "directions": [
        "Draw desired shape of cookie on a Styrofoam plate, then cut out shape with X-Acto knife and discard shape. If desired, cut out additional shapes from same plate. Trim plate, leaving a 1-inch border around stencil(s). Make more stencils with more plates if desired.",
        "Put oven rack in middle position and preheat oven to 350°F. Line a large baking sheet with nonstick liner.",
        "Beat together butter, confectioners sugar, honey, and tea leaves in a large bowl with an electric mixer at medium speed until combined well. Add egg whites 1 at a time, beating well after each addition. Reduce speed to low, then mix in flour until just combined.",
        "Place stencil on liner and spread batter with spatula over stencil to completely cover opening. Carefully lift stencil from liner and stencil more cookies in same manner about 1 inch apart. Bake until edges are deep golden brown, 6 to 9 minutes. Cool cookies 1 minute on sheet, then transfer with spatula to a rack to cool completely. (To curl cookies, drape while hot over handles of wooden spoons or rolling pins to cool.) Stencil and bake more cookies with remaining batter."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup confectioners sugar",
        "1/4 cup mild honey",
        "2 1/4 teaspoons decaffeinated Earl Grey tea leaves (from 2 to 3 tea bags)",
        "2 large egg whites",
        "1 cup all-purpose flour",
        "Special equipment: disposable Styrofoam plates; a small sharp knife such as an X-Acto; a 17- by 11-inch nonstick bakeware liner such as Silpat; a small offset spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Tea",
        "Mixer",
        "Dessert",
        "Bake",
        "Christmas",
        "New Year's Eve",
        "Honey",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tea-and-Honey Crisps",
    "url": "http://www.epicurious.com/recipes/food/views/tea-and-honey-crisps-236667"
}
