{
    "directions": [
        "Whisk flour and salt in medium bowl to blend well. Using electric mixer, beat butter and 2/3 cup sugar in large bowl until fluffy. Beat in milk, lemon peel, and vanilla extract. Add flour mixture and beat until blended. Gather dough into ball; divide in half. Flatten into disks. Wrap in plastic and chill at least 2 hours. (Can be made 2 days ahead. Keep chilled. Let soften slightly before rolling out.)",
        "Roll out each dough disk between sheets of waxed paper to 14x11-inch rectangle, occasionally lifting waxed paper to smooth out wrinkles. Refrigerate dough on baking sheets, still between sheets of waxed paper, until cold and firm, about 30 minutes. Place 1 dough piece on work surface. Peel off top sheet of waxed paper. Press same waxed paper gently back onto dough. Turn dough over (still between waxed paper sheets). Peel off top sheet of waxed paper and discard. Using 2 1/4-inch scalloped round cutter and with dough still on waxed paper bottom, cut out cookies. Using 1- to 1 1/4-inch scalloped round cutter, cut out center from half of cookies. Gather dough centers and excess dough around cutouts; shape excess dough into disk and chill. Slide waxed paper with cutouts onto baking sheet and chill. Repeat with remaining dough disk, cutting out rounds, cutting centers from half of rounds to make top rings, and gathering and chilling excess dough. Roll out excess dough between sheets of waxed paper, making more cookie bottoms and top rings. Repeat rolling and cutting until all of dough is used.",
        "Position rack in center of oven and preheat to 350°F. Spray 2 large baking sheets with nonstick spray. Using metal spatula to lift cutouts from waxed paper, transfer cookie bottoms to 1 prepared sheet and top rings to second sheet, spacing slightly apart (cookies spread very little). Sprinkle some top rings with colored sugar crystals (or leave plain to decorate later). Bake cookies, 1 sheet at a time, until pale golden, about 8 minutes. Cool cookies on baking sheets 5 minutes. Transfer cookies to racks; cool completely.",
        "Arrange cookie bottoms on work surface. Spread each with 1 teaspoon preserves. Sift powdered sugar over plain cookie rings or decorate with icing and sugar crystals or edible glitter as desired. Press 1 top ring onto each prepared cookie bottom. (Cookies can be made 3 days ahead. Store airtight between sheets of waxed paper in refrigerator.)"
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "1/2 teaspoon salt",
        "1 1/4 cups (21/2 sticks) unsalted butter, room temperature",
        "2/3 cup sugar",
        "2 1/2 tablespoons whole milk",
        "1 tablespoon grated lemon peel",
        "2 teaspoons vanilla extract",
        "Nonstick vegetable oil spray",
        "Assorted decorations (such as powdered sugar, icing, colored sugar crystals, and edible glitter)",
        "2/3 cup preserves (such as apricot, seedless raspberry, or seedless blackberry)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Bake",
        "Christmas",
        "Winter",
        "Jam or Jelly"
    ],
    "title": "Tea Cake Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/tea-cake-sandwich-cookies-107527"
}
