{
    "directions": [
        "1. The tart can be made in a tarte Tatin pan (available in specialty shops), or a 9- to 10-inch (24- to 26-cm) cast-iron skillet (a great pan for this tart), or other heavy, ovenproof skillet. (This is not a recipe that demands extraordinary precision.)",
        "If you've got a pan that is slightly larger or slightly smaller, you can adjust the number of apples by eye as you go along.) Working on a well-floured counter, roll out the puff pastry until it is 1/8 inch (3 mm) thick, then cut out a round that is about 1 inch (2.5 cm) larger in diameter than the pan you'll be using.",
        "Slide the rolled-out dough onto a parchment-lined baking sheet, prick it all over with the tines of a fork or the tip of a paring knife, cover with plastic wrap, and chill until needed. (The dough can remain in the refrigerator for 1 day.)",
        "2. Line a sieve with a single layer of moistened cheesecloth and set the sieve over a bowl. Melt the butter in a small saucepan, then pull the pan from the heat and stir in the tea and vanilla extract. Allow the tea to infuse for 1 minute, then strain the flavored butter into the bowl; discard the tea leaves.",
        "3. Center a rack in the oven and preheat the oven to 375°F (190°C). Line a baking sheet with parchment paper and set it aside.",
        "4. Use a pastry brush to cover the sides of the tart pan with some of the vanilla butter, then coat the sides with some of the sugar. Pour the remaining butter into the pan and sprinkle the remaining sugar over the butter. Arrange a single layer of apples, rounded (peeled) side down, in closely packed concentric circles.",
        "The apples will shrink as they cook, so make sure to get as snug a fit as you can. It might be necessary to custom-cut a few of the apple quarters to fill odd spaces. If you want a second layer of apples (a second layer will give you a higher tart), cut the remaining apple quarters lengthwise in half (or peel and core as many additional apples as you need and cut the apples into eighths) and build another layer with them. Don't worry about arranging them neatly—this layer will never be seen.",
        "5. Set the pan over medium heat and cook until the sugar caramelizes to a deep golden brown color, about 20 minutes. (Don't go too far from the stove—you may have to adjust the heat to keep the sugar from burning.) Pull the pan from the heat and place it on the parchment-lined baking sheet.",
        "6. Using a wooden spoon, press down gently on the apples and, if necessary,nudge them a bit to fill any gaps you see. Put the puff pastry circle over the apples, tucking the edges in very loosely.When you tuck, you may have to double the pastry over on itself, and that's OK. It's also OK if some of the pastry overlaps the rim of the pan; it will shrink to the right size as it bakes. Slide the baking sheet into the oven and bake the tart for 30 to 40 minutes, or until the pastry is puffed and, most important, golden.",
        "7. Moving with speed and conviction—this isn't an operation for a timid slowpoke—cover the pan with a large serving plate and invert the tart onto the plate; remove the pan. If any of the apples have stuck to the pan (as some usually will), gently loosen them from the pan with a small metal spatula and reunite them with their companions. Allow the tart to cool for 10 minutes or so before serving, or wait until it is only just warm."
    ],
    "ingredients": [
        "About 8 ounces (240 grams) puff pastry, homemade or store-bought",
        "1 stick (4 ounces; 115 grams) unsalted butter",
        "2 tablespoons (15 grams) vanilla tea, preferably Vanille Impériale from Mariage Frères",
        "1 teaspoon pure vanilla extract",
        "I cup (150 grams) sugar",
        "6 to 8 medium apples, preferably a sweet firm apple such as Gala or Golden Delicious, peeled, cored, and quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Pastry"
    ],
    "title": "Tea-Flavored Tarte Tatin (_Tarte Tatin au Thé_)",
    "url": "http://www.epicurious.com/recipes/food/views/tea-flavored-tarte-tatin-em-tarte-tatin-au-the-em-355925"
}
