{
    "directions": [
        "Rinse breasts and pat dry. Using sharp knife, score skin in 1/2-inch crosshatch pattern, taking care not to cut through fat into meat below. Sprinkle breasts with pepper and teaspoon salt.",
        "In large bowl, stir together scallions, cinnamon, ginger, remaining 1/8 teaspoon salt, and star anise. Add duck breasts and toss to combine, making sure both breasts are completely covered with mixture. Cover and chill in refrigerator for at least 8 hours or overnight.",
        "Preheat oven to 350°F.",
        "Prick potatoes all over with fork, wrap each in aluminum foil, and place on rimmed baking sheet. Roast, turning over once, until tender, 35 to 45 minutes.",
        "Unwrap potatoes and let cool to room temperature. Slice lengthwise into 1/4-inch-thick slices. Refrigerate until ready to use. (Potatoes can be roasted up to 4 hours in advance and refrigerated, covered.)",
        "Have ready large bowl of ice water.",
        "In medium saucepan over high heat, bring salted water to boil. Transfer corn to medium sieve and plunge sieve into boiling water. Cook corn in sieve, uncovered, until crisp-tender, 2 to 3 minutes, then lift sieve from boiling water and immediately plunge into ice water to stop cooking. Drain corn, pat dry, and transfer to large bowl. Repeat process with asparagus then carrots, allowing water to return to boil between each batch. Refrigerate vegetables until ready to use. (Vegetables can be cooked up to 4 hours in advance and refrigerated, covered.)",
        "Line large rimmed baking sheet with paper towels and top with wire cooling rack. In 3-quart saucepan over high heat, stir together 4 cups water, lemon juice, cinnamon, and salt. Bring to boil, then reduce heat to moderately low, add pears standing upright, and partially cover with lid. Simmer pears until just tender, about 15 minutes, then, using slotted spoon, transfer to rack. Allow to drain and cool to room temperature, then refrigerate until ready to use. (Pears can be poached up to 24 hours in advance and refrigerated, covered).",
        "In heavy, 1 1/2-quart saucepan over moderate heat, heat oil until hot but not smoking. Add onion, carrot, and leek, and saut until softened and light golden, about 10 minutes. Add wine, raise heat to high, and bring to boil. Lower heat to moderately high and simmer vigorously, uncovered, until the liquid has reduced by 2/3, 4 to 5 minutes. Add stock, cinnamon stick, and cardamom pod, raise heat to high and bring to boil. Reduce heat to moderate and simmer until mixture is thick enough to lightly coat back of spoon, 30 to 45 minutes. Pour through fine-mesh strainer into small, clean saucepan. Cover and keep warm.",
        "Preheat oven to 350°F.",
        "Line bottom of wok and inside of lid with double layer of heavy-duty foil, leaving 3-inch overhang along edges. In small bowl, stir together tea leaves and cilantro. Sprinkle mixture in even layer on bottom of wok and set rack in wok (it should rest about 2 inches from bottom).",
        "Heat heavy, 12-inch skillet over moderately high heat until hot but not smoking. Remove duck breasts from marinade and transfer, skin-side down, to skillet. Sear without moving until skin is deep golden brown, about 5 minutes.",
        "Using tongs, transfer breasts, skin side up, to rack in wok, arranging about 1 inch apart. Heat wok over high heat, uncovered, until steady wisps of smoke begin to appear, 5 to 10 minutes. Reduce heat to moderate, then cover wok and, using oven mitts, fold foil overhang from wok and lid together, crimping to seal tightly (foil will be very hot). Smoke duck breasts 10 minutes.",
        "Slice each pear in half lengthwise and, using small spoon or melon baller, remove seeds.",
        "In heavy, 12-inch skillet over moderately high heat, melt butter. Stir in sugar, then add pears and gently toss to coat. Cook, uncovered, turning over once, until pears are caramelized, about 5 to 6 minutes per side. Remove from pan and keep warm, covered.",
        "When breasts have smoked 10 minutes, carefully unwrap foil (smoke and steam will billow out). Using tongs, transfer breasts to baking dish and place in oven. Transfer potatoes to rimmed baking sheet and place alongside duck in oven. Roast duck to desired doneness, 7 to 8 minutes for medium-rare (instant-read thermometer inserted into breasts will read 135°F). Transfer breasts to carving board, tent with foil, and let rest 5 minutes before slicing. When potatoes are warm, remove from oven, cover and keep warm.",
        "In heavy, 12-inch skillet over moderately high heat, heat oil until hot but not smoking. Add asparagus, carrots, and baby corn and sauté until lightly browned and heated through, about 7 minutes. Keep warm.",
        "If necessary, rewarm sauce over low heat. Stir in blueberries.",
        "Divide potato slices among 4 large plates. Sprinkle duck breasts with pepper. Holding sharp knife at 45°F angle, cut each duck breast into thin slices. Arrange slices on top of potatoes. Place 1 pear half on side of each plate and arrange vegetables on other side. Spoon blueberry jus over plates and serve immediately."
    ],
    "ingredients": [
        "2 (3/4-pound) boneless Moulard* duck breast halves with skin",
        "1/8 teaspoon freshly ground black pepper",
        "3/8 teaspoon fine sea salt",
        "4 scallions, white and light green parts only, finely chopped",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon ground ginger",
        "1 whole star anise",
        "2 large sweet potatoes (about 1 pound total)",
        "12 ears fresh baby corn,** husked",
        "12 asparagus spears, trimmed and cut crosswise into thirds",
        "12 baby carrots",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon ground cinnamon",
        "1 teaspoon fine sea salt",
        "2 firm Bosc pears, peeled",
        "1 tablespoon extra-virgin olive oil",
        "1 red onion, cut into large dice (about 1 1/2 cups)",
        "1 medium carrot, peeled and cut into large dice (about 1/2 cup)",
        "1 leek, white part only, cut into large dice (about 3/4 cup)",
        "1/2 cup fortified red wine, such as port, Marsala, or Madeira",
        "2 1/2 cups chicken stock or low-sodium chicken broth",
        "1 whole cinnamon stick",
        "1 green cardamom pod, lightly crushed",
        "2 tablespoons whole fresh blueberries",
        "1 teaspoon Darjeeling tea leaves",
        "1 tablespoon fresh cilantro leaves, coarsely chopped",
        "2 tablespoons unsalted butter",
        "1 tablespoon superfine sugar",
        "2 tablespoons fresh blueberries",
        "teaspoon freshly ground black pepper",
        "*Moulard duck breasts, also called magrets, are available from D'Artagnan.",
        "*Fresh baby corn—actually just tiny, immature ears of sweet corn—is available at Asian markets and farmers' markets. Alternatively, substitute thawed frozen baby corn or canned, rinsed twice to remove excess salt, and skip blanching step.",
        "Special equipment: wok with lid, heavy-duty foil, 12-inch round wire rack, 3-quart (9- by 13-inch) baking dish; instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Wok",
        "Duck",
        "Marinate",
        "Poach",
        "Roast",
        "Blueberry",
        "Pear",
        "Asparagus",
        "Leek",
        "Corn",
        "Carrot",
        "Sweet Potato/Yam",
        "Healthy"
    ],
    "title": "Tea-Smoked Duck Breast with Pears and Blueberry Jus",
    "url": "http://www.epicurious.com/recipes/food/views/tea-smoked-duck-breast-with-pears-and-blueberry-jus-240799"
}
