{
    "directions": [
        "Combine steak, beer, 1 tablespoon lime juice, 1 teaspoon salt, and 1/4 teaspoon pepper in a resealable plastic bag. Seal; chill 3 hours.",
        "Cook onion, garlic, and oil in a small skillet over medium heat until soft and translucent, 5 minutes. Let cool.",
        "Prepare a grill for high heat (if using charcoal, prepare two zones of heat, high and medium-high). Grill tomatoes over high heat, turning occasionally, until well charred but still holding their shape, 6–8 minutes.",
        "Reduce grill to medium-high heat (or use medium-high zone if using a charcoal grill). Remove steak from marinade and pat dry. Season with salt and pepper and grill until charred, about 3 minutes per side for medium-rare. Transfer to a cutting board and let steak rest 10 minutes.",
        "Meanwhile, blend onion and garlic, tomatoes, chipotle, and remaining 3 tablespoons lime juice in a blender until smooth. Add chopped cilantro, season with salt, and pulse until just combined. Transfer salsa to a small bowl.",
        "Grill tortillas until soft and beginning to char, about 30 seconds per side. Slice steak against the grain into 1/2\" trips. Top each tortilla with a few pieces of steak, then some salsa, cilantro leaves, avocado, and Cotija cheese. Serve with lime wedges for squeezing over."
    ],
    "ingredients": [
        "1 pound skirt steak, silver skin removed, cut into 6\" pieces",
        "1 12-ounce can pale lager (such as Tecate)",
        "4 tablespoons fresh lime juice, divided",
        "1 teaspoon kosher salt, plus more",
        "1/4 teaspoon freshly ground black pepper, plus more",
        "1/4 medium onion, chopped",
        "2 garlic cloves, thinly sliced",
        "1 tablespoon olive oil",
        "2 large plum tomatoes, cored",
        "1/2 canned chipotle chile in adobo, coarsely chopped",
        "3 tablespoons chopped fresh cilantro, plus leaves for serving",
        "8 fresh corn tortillas",
        "Avocado slices, crumbled Cotija cheese, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Steak",
        "Grill/Barbecue",
        "Tortillas"
    ],
    "title": "Tecate Skirt-Steak Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/tecate-skirt-steak-tacos-56389643"
}
