{
    "directions": [
        "Place 1/2 of the chocolate pieces in a bowl. Line a baking sheet with parchment paper or waxed paper.",
        "Heat cream in a small saucepan just until it boils; pour over chocolate pieces. Let mixture stand for 1 to 2 minutes. Gently whisk until ganache is smooth; whisk in bourbon, a little at a time, until smooth. The ganache will thicken as it cools.",
        "Insert a fork into 1 end of a marshmallow without pushing it through all the way. Toast over a gas or electric burner set to medium-low, rotating until all sides are browned and marshmallow is puffed, about 1 minute per side. Hold the marshmallow high enough so the heat causes the marshmallow to puff up without catching on fire. Don't brown the top end where the fork is inserted.",
        "Place marshmallow on the prepared baking sheet, using a second fork to help slide the marshmallow off the fork. After a few seconds, the untoasted top will sink down, forming a hollow space in the center of the marshmallow. Repeat with the rest of the marshmallows. Chill in the refrigerator for 10 minutes.",
        "Melt the remaining chocolate pieces in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 2 minutes. Stir chocolate until smooth; cool slightly.",
        "Spread melted chocolate onto top and bottom of each marshmallow and dip into the crushed graham crackers. Chill in refrigerator for 10 minutes.",
        "Whisk the cooled ganache until fluffy; pipe into each marshmallow using a pastry bag or plastic bag with a corner cut off. Garnish each \"hot tub\" with a teddy bear-shaped graham snack."
    ],
    "ingredients": [
        "2 (4 ounce) bars dark chocolate, broken into pieces, divided",
        "4 fluid ounces heavy whipping cream",
        "2 tablespoons bourbon (optional)",
        "1 (10 ounce) package regular-size marshmallows",
        "2 graham crackers, crushed",
        "36 teddy bear-shaped graham snacks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Teddy Bear Hot Tub S'Mores",
    "url": "http://allrecipes.com/recipe/244236/teddy-bear-hot-tub-smores/"
}
