{
    "directions": [
        "Preheat oven to 350°F. Toast almonds on a rimmed baking sheet, tossing halfway through, until golden brown, 8–10 minutes. Let cool, then coarsely chop; set aside.",
        "Meanwhile, heat 1 Tbsp. vegetable oil in a large heavy pot over medium-high until oil begins to glisten, about 1 minute. Cook mushrooms, stirring occasionally, until golden brown and tender, about 5 minutes. Season with 1/4 teaspoon salt and transfer to a plate; set aside.",
        "Wipe out pot and pour in canola oil to a depth of 2\"; fit pot with thermometer. Heat oil over medium-high until thermometer registers 350°F.",
        "Meanwhile, cut 3 cups kale leaves into 1\" pieces. Thinly slice remaining leaves and set aside separately.",
        "Combine sparkling water, 1/2 cup rice flour, and 3/4 tsp. salt with a fork in a medium bowl. Toss 1\" piece kale leaves, 2 1/4 cups kale stems, and remaining 2 Tbsp. rice flour in another medium bowl. Pour sparkling water mixture over kale, then massage into kale with your hands, coating completely.",
        "Working in batches, fry battered kale until golden, about 2 minutes per batch. Transfer to paper towels and season with salt.",
        "Blend vinegar, honey, miso, sesame oil, 1/8 tsp. white pepper, 3/4 cup kale stems, and remaining 6 Tbsp. vegetable oil in a blender until smooth.",
        "Massage three-quarters of the dressing into reserved sliced kale leaves in a large bowl. Add reserved mushrooms, three-quarters of the tempura kale, and half of the raisins and reserved almonds; toss to combine. Season with salt and white pepper to taste. Transfer to a platter, then top with remaining raisins, almonds, and tempura kale. Drizzle with remaining dressing.",
        "Dressing can be made 1 day ahead; cover and chill. Kale can be prepped 1 day ahead; store in airtight containers and chill."
    ],
    "ingredients": [
        "3/4 cup almonds",
        "7 tablespoons vegetable oil, divided",
        "4 cups shiitake mushrooms (about 9 ounces), stemmed, quartered",
        "1 teaspoon kosher salt, divided, plus more",
        "Canola oil (for frying; about 2 quarts)",
        "2 bunches Tuscan kale (about 1 3/4 pounds), stems removed and cut lengthwise into 1\" pieces, leaves reserved",
        "3/4 cup cold sparkling water",
        "1/2 cup plus 2 tablespoons rice flour, divided",
        "1/4 cup rice vinegar",
        "2 tablespoons honey",
        "2 tablespoons white miso",
        "1 tablespoon toasted sesame oil",
        "1/8 teaspoon white pepper, plus more",
        "1/2 cup golden raisins, divided",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Kale",
        "Fry",
        "Almond",
        "Mushroom",
        "#WasteLess",
        "Raisin",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "No Meat, No Problem"
    ],
    "title": "Tempura Kale Salad With Shiitake Mushrooms, Raisins, and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/tempura-kale-salad-with-shiitake-mushrooms-raisins-and-almonds"
}
