{
    "directions": [
        "Preheat an oven to 350°F.",
        "Arrange the bread slices in a single layer on a rimmed baking sheet. Bake, turning once halfway through baking, until lightly golden, about 20 minutes. Remove from the oven and set aside. Increase the oven temperature to 450°F.",
        "In a small bowl, whisk together 2 Tbs. of the olive oil, 1 1/2 tsp. of the salt and 1 tsp. of the pepper. Brush the oil mixture on all sides of the beef tenderloin. Place the tenderloin on a rack in a shallow roasting pan just large enough to accommodate it.",
        "Roast the tenderloin until an instant-read thermometer inserted into the thickest part of the meat registers 125°F for very rare to rare, about 20 minutes; 130°F for medium-rare, about 25 minutes; or 135°F for medium, about 30 minutes. Transfer the beef to a cutting board, cover loosely with aluminum foil and let rest for 15 to 20 minutes. Carve against the grain into thin slices.",
        "Chop the tomatoes and place them in a colander to drain for 10 minutes. Sort through the basil leaves and set aside 30 small whole leaves. Cut the remaining basil leaves into thin strips.",
        "In a large bowl, combine the remaining 2 Tbs. olive oil, 1 tsp. salt and 1/2 tsp. pepper. Add the tomatoes and sliced basil and turn gently to coat the tomatoes evenly.",
        "To assemble, place 1 or 2 slices of beef on a toasted baguette slice and top with 1 tsp. of tomatoes and a basil leaf. Arrange the canapés on a platter and serve. Serves 12 to 14.",
        "Adapted from Williams-Sonoma",
        "Entertaining with the Seasons",
        "(Free Press, 2010)."
    ],
    "ingredients": [
        "30 baguette slices, each 1/4 inch thick (about 1 large baguette)",
        "4 Tbs. extra-virgin olive oil",
        "2 1/2 tsp. salt",
        "1 1/2 tsp. freshly ground pepper",
        "1 1/2 to 2 lb. piece beef tenderloin, trimmed of fat and sinew",
        "1 1/2 lb. mixed heirloom tomatoes",
        "2 cups fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tenderloin and Heirloom Tomato Canapés",
    "url": "http://www.williams-sonoma.com/recipe/tenderloin-and-heirloom-tomato-canapes.html"
}
