{
    "directions": [
        "Mix the brown sugar, fajita seasoning, and paprika in a bowl. Rub both sides of the pork spareribs with the brown sugar mixture. Place the spareribs in a 9x13-inch baking pan; cover and refrigerate overnight.",
        "Preheat an oven to 250 degrees F (120 degrees C). Whisk together the beer, garlic, honey, Worcestershire sauce, and mustard in a bowl. Set aside.",
        "Tear off 2 large sheets of heavy duty aluminum foil and lay them shiny-side down. Place a rack of spareribs on each sheet, meaty-side up. Tear off 2 more sheets of foil and place them on top of the ribs, shiny-side up. Begin tightly folding the edges of the foil together to create a sealed packet. Just before sealing completely, divide the beer mixture evenly into each packet. Complete the seal. Place the packets side-by-side on an 11x14-inch baking sheet.",
        "Bake in the preheated oven until the ribs are very tender, 3 hours and 30 minutes to 4 hours. Carefully open each packet, and drain the drippings into a saucepan. You may only need the drippings from one packet. Set ribs aside. Simmer the drippings over medium-high heat until the sauce begins to thicken, about 5 minutes. Brush the thickened sauce over the ribs.",
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.",
        "Place the ribs back into the oven and broil until the sauce is lightly caramelized, 5 to 7 minutes."
    ],
    "ingredients": [
        "1 cup brown sugar",
        "1/2 cup fajita seasoning (such as Fiesta®)",
        "2 tablespoons Hungarian sweet paprika",
        "2 racks pork spareribs, fat trimmed",
        "1 cup beer",
        "3 cloves garlic, minced",
        "1 tablespoon honey",
        "3 tablespoons Worcestershire sauce",
        "1 tablespoon prepared brown mustard"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tender Pork Spare Ribs",
    "url": "http://allrecipes.com/recipe/216985/tender-pork-spare-ribs/"
}
