{
    "directions": [
        "Blend all ingredients in processor until smooth, occasionally scraping down sides of bowl. Season dressing with salt and pepper. Transfer to small bowl. Cover; chill. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Using large holes on box grater, coarsely grate zucchini into large colander. Sprinkle 1 teaspoon coarse salt over and toss to coat evenly. Place colander over large bowl. Let zucchini stand 30 minutes, tossing occasionally. Press on zucchini to release as much liquid as possible. Empty zucchini into kitchen towel. Roll up to enclose and squeeze dry.",
        "Whisk flour, baking powder, 1/2 teaspoon pepper, and 1/2 teaspoon coarse salt in medium bowl to blend. Mix in beer. Scrape zucchini from towel into bowl; stir to coat evenly (batter will be thick). Mix in cheese.",
        "Heat 1/3 cup oil in heavy large skillet over medium heat until very hot, about 2 minutes. Working in batches, drop batter into skillet by 1/4 cupfuls, flattening to 3-inch rounds. Sauté until brown and cooked through, 4 to 5 minutes per side. Transfer fritters to rimmed baking sheet. Repeat with remaining batter, adding more oil as needed. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 375°F oven 5 to 6 minutes.",
        "Place mâche in large bowl. Toss with 2 to 3 tablespoons dressing. Place 2 fritters on each of 6 plates. Top with mound of mâche salad. Serve fritters, passing remaining dressing alongside."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/4 cup chopped fresh dill",
        "1/4 cup chopped fresh chives",
        "2 tablespoons chopped fresh tarragon",
        "2 tablespoons chopped fresh Italian parsley",
        "1 tablespoon distilled white vinegar",
        "1 anchovy fillet, chopped",
        "1 1/2 pounds medium zucchini (5 to 6), trimmed",
        "1 1/2 teaspoons coarse kosher salt, divided",
        "6 1/2 tablespoons all purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 cup beer",
        "1 4-ounce package soft fresh goat cheese, coarsely crumbled, chilled (about 1 cup)",
        "1/3 cup (or more) extra-virgin olive oil",
        "3 1/2 cups (lightly packed) mâche (lamb's lettuce; 2 to 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Leafy Green",
        "Appetizer",
        "Fry",
        "Sauté",
        "Goat Cheese",
        "Zucchini",
        "Summer",
        "Tarragon",
        "Chive",
        "Dill",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tender Zucchini Fritters with Green Goddess Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/tender-zucchini-fritters-with-green-goddess-dressing-360250"
}
