{
    "directions": [
        "The day before beginning the sauce, remove the stems and tops from the chiles; carefully shake out and reserve the seeds. Rinse the chiles under cold running water. Spread them out in a single layer where they can dry completely. Let stand until the following day, turning occasionally and checking to be sure not a drop of moisture remains.",
        "Crush the bread to fine crumbs or grind in a food processor. You should have about 1 cup. Set aside.",
        "Preheat oven to 350° F.",
        "Spread the chiles (they must be bone-dry) in one layer on a baking sheet. Toast them in the oven, turning frequently, until crisp and deeply blackened, about 20 minutes. Let the chiles stand at room temperature until completely cooled.",
        "Spread the pecans and almonds on a baking sheet. Toast them in the oven until golden brown, about 10 minutes. Set aside.",
        "Place the crisp toasted chiles in a food processor and process until finely ground. Set aside.",
        "On a griddle or in a small cast-iron skillet, heat the reserved chile seeds over high heat, shaking the pan occasionally, until thoroughly charred and black on all sides, about 5 minutes. (Because of the fumes, this is best done outdoors if you have the means.) You can speed the process by sprinkling a few drops of vegetable oil over the seeds and igniting with a match, standing well back from the flame and taking care to shield your face, clothing, and hair. Place the charred seeds in a bowl, cover with at least 2 cups cold water, and soak for 1 1/2 hours, changing the water twice. Drain and set aside.",
        "Heat a griddle or medium-size cast-iron skillet over low heat. If using 1 large onion, cut it in half crosswise (leaving the skin on). Place the onion, individual unpeeled garlic cloves, tomato (stem side down), and tomatillos (in the husks) on the griddle. Cook, turning frequently. The onion and garlic are done when they are somewhat softened, about 8 minutes for the garlic and 20 to 25 minutes for the onion. The tomato is done when the skin is blackened and blistered all over, about 15 to 20 minutes. The tomatillos are done when they are lightly softened all over, about 10 to 15 minutes. (Handle them delicately so as not to squeeze them and pierce the skin, and turn frequently to avoid scorching.) Remove each kind of vegetable as it is done and set it aside in a separate small bowl.",
        "When the vegetables are cool enough to handle, remove the husks from the tomatillos and peel the rest, making sure to save the juices. If using a large onion cut in half, scrape the black bits off the cut side.",
        "Place the sesame seeds in a medium-size heavy skillet over medium heat and toast just until golden (about 3 minutes), stirring constantly and shaking the pan. Immediately scrape out the seeds into a small bowl to stop the cooking. Set aside.",
        "In a small, heavy skillet, heat 1 tablespoon lard over medium-high heat until rippling. Add the canela, thyme, oregano, cloves, allspice, nutmeg and ginger. Fry the spices, stirring constantly, until fragrant, about 2 minutes. Set aside.",
        "In a small skillet, heat another 2 tablespoons lard over medium heat until rippling. Add the raisins and bread crumbs; cook, stirring, until the raisins are puffed and the bread is lightly colored, about 2 minutes. Set aside.",
        "Now you are ready to purée all the ingredients, using either a blender/food processor combination or a blender alone.",
        "If using both machines, place the pecans, almonds, sesame seeds, bread-raisin mixture, ground chiles, and drained chile seeds in the food processor (working in batches as necessary). Process to a smooth purée. Next, place the fried spices, peeled garlic, onion, tomatoes, and tomatillos in the blender and process to a smooth purée. Combine the two mixtures in a large bowl.",
        "If using only a blender, line up all the prepared ingredients next to the machine on the counter, place some of each in the blender container, add a few tablespoons chicken stock, and process until smooth, adding more stock as necessary to facilitate blending. (This method requires great patience; small batches will be well puréed in 1 to 2 minutes while large ones may retain coarse bits of the spices. If thoroughly processed, the mixture will not require sieving, so try not to rush things.) Pour each batch into a bowl as it is done and proceed with the next batch.",
        "In a large, heavy saucepan or Dutch oven, heat the remaining 4 tablespoons lard over high heat until rippling. Add the purée, all at once, watching for splatters, and reduce the heat to medium-low. Cover and cook, stirring frequently, until the harshness of the chiles is mellowed, 35 to 40 minutes.",
        "The mole should now be a heavy paste like a thick frosting mixture. It can be stored in the refrigerator for at least 4 to 6 days, or in the freezer for up to 6 months. In either case, it should be thinned before further cooking. Place the paste in the blender when ready to thin it; add 1 cup chicken stock (or as necessary) and process to combine thoroughly."
    ],
    "ingredients": [
        "4 ounces ancho chiles (see Tips, below)",
        "4 ounces guajillo chiles (see Tips, below)",
        "1 thick slice day-old brioche or challah",
        "1/3 cup pecan meats",
        "1/4 cup blanched almonds",
        "1 large or 2 medium unpeeled onions",
        "4 unpeeled garlic cloves",
        "1 large ripe tomato",
        "4 ounces tomatillos, with husks",
        "2/3 cup (about 3 ounces) sesame seeds",
        "7 tablespoons lard (preferably home-rendered; see Tips, below)",
        "One 6-inch piece canela (see Tips, below)",
        "1/2 bunch or 1 small bunch thyme (about 2 dozen sprigs), or 2 teaspoons dried, crumbled",
        "1/4 cup dried Oaxacan oregano or 1 teaspoon dried Mexican oregano, crumbled (see Tips, below)",
        "16 whole cloves",
        "14 allspice berries",
        "1/4 teaspoon freshly grated nutmeg",
        "One 1-inch piece fresh ginger, peeled and minced",
        "1 cup dark raisins",
        "2 to 4 cups homemade chicken stock, or as necessary (see Tips, below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Nut",
        "Almond",
        "Pecan",
        "Spice",
        "Tomatillo"
    ],
    "title": "Teotitlan-Style Black Mole",
    "url": "http://www.epicurious.com/recipes/food/views/teotitlan-style-black-mole-232061"
}
