{
    "directions": [
        "Stir together tequila, lime juice, and sugar until sugar is dissolved.",
        "Peel pineapple with a large sharp knife, keeping crown of leaves attached. Trim bottom.",
        "Remove eyes from pineapple in spiral channels with a sharp paring knife: Cut along each side of diagonal row of eyes that spirals down pineapple, forming a V-shaped channel. Cut out channel and eyes and repeat procedure with remaining rows of eyes.",
        "Preheat oven to 425°F.",
        "Lay pineapple on its side, then, beginning at base and moving upward, carefully cut pineapple lengthwise in half through leaves, keeping leaves attached. Cut out core from each half and pull out some of long innermost leaves so no leaves are longer than about 7 inches.",
        "Arrange pineapple halves, flat sides down, in a glass or ceramic 13- by 9-inch baking dish, then pierce all over and all the way through with a skewer.",
        "Stir tequila mixture and spoon over pineapple. Lay a sheet of wax paper over pineapple and bake in middle of oven, basting with juices every 10 minutes, until pineapple is tender and slightly caramelized, about 50 minutes. Halve pineapple halves lengthwise and serve with any juices remaining in baking dish."
    ],
    "ingredients": [
        "3 tablespoons tequila (preferably reposado or añejo)",
        "3 tablespoons fresh lime juice",
        "2 tablespoons sugar",
        "1 (3-lb) pineapple (labeled \"extra sweet\")"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tequila",
        "Dessert",
        "Bake",
        "Low Fat",
        "Quick & Easy",
        "Lime",
        "Pineapple",
        "Summer",
        "Vegan",
        "Gourmet",
        "Fat Free",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tequila and Lime Baked Pineapple",
    "url": "http://www.epicurious.com/recipes/food/views/tequila-and-lime-baked-pineapple-108004"
}
