{
    "directions": [
        "Preheat oven to 325°F.",
        "Make crust:",
        "Into a food processor crumble graham crackers and finely grind enough to measure 11/2 cups. Transfer to a bowl. In food processor pulse pine nuts with sugar until finely ground. Melt butter and cool to lukewarm. Stir nut mixture and butter into crumbs and press evenly onto bottom and up side of tart pan.",
        "Make filling:",
        "Squeeze enough juice from limes to measure 1/2 cup. In a large bowl whisk together lime juice, condensed milk, yolks, and tequila until just combined well. In another large bowl with an electric mixer beat whites with sugar until they hold soft peaks. Stir one fourth meringue into milk mixture to lighten and fold in remaining meringue gently but thoroughly.",
        "Spoon filling into crust. (If using a 9 1/2-inch tart pan, filling will be mounded and look as if it will overflow, but don’t worry, it won’t.) Bake tart until edges of filling are puffed but not browned and center seems almost set when gently shaken, 25 to 30 minutes. Cool tart completely on a rack. Chill tart, loosely covered, until cold, about 2 hours, and up to 1 day.",
        "Serve tart in wedges with dollops of whipped cream. Garnish with lime slices."
    ],
    "ingredients": [
        "about eleven 4 3/4- by 2 1/4-inch graham crackers",
        "1/4 cup pine nuts",
        "2 tablespoons sugar",
        "1/2 cup unsalted butter",
        "1 14-ounce can sweetened condensed milk",
        "4 large egg yolks",
        "1/2 cup fresh lime juice",
        "1/4 cup gold tequila",
        "2 large egg whites",
        "1 tablespoon sugar",
        "Accompaniment: whipped cream, fresh lime slices",
        "Special equipment: a 9 1/2- to 10-inch tart pan (1 inch deep) with a removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tequila",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Picnic",
        "Cinco de Mayo",
        "Lime",
        "Summer",
        "Chill",
        "Potluck",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tequila Lime Tart",
    "url": "http://www.epicurious.com/recipes/food/views/tequila-lime-tart-102000"
}
