{
    "directions": [
        "Mix coriander, salt, and red pepper. Sprinkle mixture all over chicken. Arrange chicken, skin side up, on baking sheet; cover and chill at least 6 hours or overnight.",
        "Combine orange juice, tequila, brown sugar, honey, 1 jalapeño, and shallot in small saucepan. Bring to boil, stirring until sugar dissolves. Reduce heat to medium-low; simmer until mixture thickens slightly, about 10 minutes. Add 1 more jalapeño if more heat is desired. Cool glaze. Transfer 3 tablespoons glaze to small bowl and set aside for serving.",
        "Spray grill with nonstick spray. Prepare barbecue (medium heat). Arrange chicken, skin side up, on grill. Grill 15 minutes, turning occasionally. Brush chicken with glaze in saucepan. Turn chicken over; brush with glaze. Grill until juices run clear when pierced with fork or until instant-read thermometer inserted into chicken registers 170°F, turning and brushing occasionally with glaze, about 10 minutes longer. Transfer to platter. Spoon reserved glaze over."
    ],
    "ingredients": [
        "1 1/2 tablespoons whole coriander seeds, coarsely ground in spice mill or mortar with pestle",
        "1 3/4 teaspoons coarse kosher salt",
        "1/2 teaspoon dried crushed red pepper",
        "1 (3 1/2- to 4-pound) cut-up (best of fryer) chicken",
        "1/3 cup orange juice or pineapple juice",
        "1/4 cup gold or silver tequila",
        "2 tablespoons (packed) golden brown sugar",
        "2 tablespoons honey",
        "1 to 2 red jalapeño chiles with seeds, finely chopped",
        "1 shallot, minced",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tequila",
        "Chicken",
        "Fruit",
        "Pepper",
        "Backyard BBQ",
        "Pineapple",
        "Summer",
        "Grill/Barbecue",
        "Coriander"
    ],
    "title": "Tequila-Glazed Chicken with Jalapeño",
    "url": "http://www.epicurious.com/recipes/food/views/tequila-glazed-chicken-with-jalapeno-239067"
}
