{
    "directions": [
        "Heat the olive oil in a large nonstick skillet over medium heat, and cook and stir the pancetta until it begins to turn dark brown, 5 to 8 minutes. Remove the pancetta pieces from the skillet with a slotted spoon and set aside.",
        "Mix the flour, Italian seasoning, and red pepper flakes in a shallow bowl.",
        "Press the chicken thighs into the flour mixture, tapping off any loose flour.",
        "Brown the chicken thighs in the skillet with the oil and pancetta drippings, 8 to 10 minutes per side. Transfer the chicken thighs to a platter and keep warm.",
        "Cook and stir the green bell pepper, sweet onion, and portobello mushrooms in the same skillet until the onion turns translucent, about 8 minutes.",
        "Stir the basil, garlic, tomato paste, diced tomatoes with their juice, and red wine into the sauce.",
        "Bring the sauce to a boil, and return the chicken and pancetta to the sauce. If sauce does not almost cover the chicken pieces, mix in more dry red wine.",
        "Reduce heat to low, and simmer the chicken and sauce until the chicken thighs are tender and no longer pink inside, 35 to 50 minutes.",
        "If you prefer a thicker sauce, whisk cornstarch with water and 1 tablespoon of the sauce, and stir the mixture into the skillet until thickened.",
        "About 15 minutes before serving time, bring a large pot of lightly salted water and bring to a boil.",
        "Stir in the rigatoni and return to a boil. Cook uncovered over medium heat, stirring occasionally, until the pasta has cooked through but is still slightly firm, about 13 minutes; drain.",
        "To serve, transfer the cooked rigatoni to a large platter and top with the chicken thighs.",
        "Generously ladle sauce over the chicken and pasta, and sprinkle the dish with Parmesan cheese, salt, and black pepper. Serve any extra sauce on the side."
    ],
    "ingredients": [
        "extra virgin olive oil",
        "1/4 pound pancetta (Italian bacon), thickly sliced",
        "1/2 cup all-purpose flour",
        "1 tablespoon dried Italian herb seasoning",
        "1 tablespoon red pepper flakes",
        "6 chicken thighs with skin and bone",
        "1 small green bell pepper, chopped",
        "1 small sweet onion, diced",
        "1 pound baby portobello mushrooms, sliced",
        "1/2 cup chopped fresh basil",
        "3 cloves garlic, chopped",
        "3 tablespoons tomato paste",
        "1 (28 ounce) can diced tomatoes with juice",
        "1/2 cup dry red wine, or more to taste",
        "1 tablespoon cornstarch (optional)",
        "2 tablespoons water (optional)",
        "1 (16 ounce) package rigatoni pasta",
        "freshly shredded Parmesan cheese to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Teresa's Hearty Chicken Cacciatore",
    "url": "http://allrecipes.com/recipe/219762/teresas-hearty-chicken-cacciatore/"
}
