{
    "directions": [
        "Bring a large pot of water to a rapid boil. Prepare a bowl of ice water. Add the bok choy to the boiling water and cook for 30 seconds. Drain the bok choy and immediately transfer it to the ice water for 2 minutes to cool. Drain the bok choy and set aside on a clean kitchen towel to soak up excess moisture.",
        "Prepare the sticky rice cakes. Put the rice in a large bowl and cover with cold water. Use your hand to swish the rice around a few times. Drain and repeat until the water in the bowl is clear; you may need to rinse it several times.",
        "Put the rice in a small, heavy-bottomed saucepan and add water to cover by 1 inch. Cover the pan; for best results, do not uncover the pan at any time during cooking. Bring to a boil over medium-high heat, 4 to 5 minutes; you will be able to tell the water is boiling by the large amount of steam pouring out from under the lid. Reduce the heat to low and simmer, covered, for 10 minutes. Remove the pan from the heat and let stand, covered, for 15 minutes.",
        "Spray a small sauté pan with grapeseed oil and heat over medium heat. Add the scallions, garlic, and ginger and cook, stirring, until just softened and fragrant, about 30 seconds. Fold the scallion mixture into the warm, cooked rice along with the vinegar, mirin, salt, and pepper.",
        "Line a platter or baking sheet with parchment paper sprayed with oil or with waxed paper. Have a separate bowl of water ready. Dip your hands into the water and scoop up 1/4 cup rice. Form it into a tightly packed cake about 2 inches thick and place the cake on the platter. Repeat with the remaining rice to form five more cakes. Set aside in the refrigerator.",
        "Meanwhile, in a small saucepan, combine the soy sauce, orange juice, mirin, and ginger. Bring to a boil and reduce the heat to low. Simmer just until reduced by half, 30 to 40 minutes. In a small dish, mix the cornstarch and 1 teaspoon water and stir this slurry into the simmering sauce. Simmer 30 seconds and remove the pan from the heat."
    ],
    "ingredients": [
        "9 baby bok choy, halved lengthwise",
        "3/4 cup sushi rice",
        "Grapeseed or canola oil spray",
        "2 tablespoons sliced scallions (white and green parts)",
        "1 teaspoon minced garlic",
        "1 tablespoon minced peeled fresh ginger",
        "1 tablespoon unseasoned rice vinegar",
        "1 1/2 teaspoons mirin",
        "Pinch of kosher salt",
        "Pinch of freshly ground black pepper",
        "1/2 cup low-sodium soy sauce",
        "3/4 cup fresh orange juice (from 3 oranges)",
        "1/4 cup mirin",
        "1 teaspoon minced peeled fresh ginger",
        "1/2 teaspoon cornstarch",
        "6 (4-ounce) skinless black cod fillets, each 1 inch thick",
        "1/4 teaspoon freshly ground black pepper",
        "Grapeseed or canola oil spray",
        "1/2 cup thinly sliced scallions (white and light green parts), for serving",
        "1 tablespoon sesame seeds, toasted, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Rice",
        "Dinner",
        "Seafood",
        "Cod",
        "Chill",
        "Bok Choy",
        "Advance Prep Required",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Teriyaki Black Cod with Sticky Rice Cakes and Seared Baby Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/teriyaki-black-cod-with-sticky-rice-cakes-and-seared-baby-bok-choy-363330"
}
