{
    "directions": [
        "In small saucepan, combine all the sauce ingredients. Boil sauce over medium-high heat for 10 minutes. Cool sauce to room temperature. If desired, remove garlic and ginger, transfer sauce to tightly covered container, and refrigerate for up to 24 hours.",
        "Preheat oven to 425 degrees  F. Line baking pan, 15\" x 11\" or larger, with foil. Coat 2(10\" x 10\") wire racks with cooking spray and set in the pan, overlapping them.",
        "Cut off first joint of chicken wings and discard. Arrange wings in prepared baking pan in one layer, smooth side up. Bake wings for 10 minutes.",
        "Brush wings on both sides with sauce and bake, smooth side up, for 5 minutes. Brush with sauce again and bake, underside up, for 5 minutes. Brush wings a third time and bake, smooth side up, for 5 minutes. Brush wings again, and bake, underside up, for 10 minutes. Reduce oven to 400 degrees  F. Brush tops of wings with sauce and bake, topside up, for 10 minutes.",
        "Arrange wings on serving plate. Discard any remaining sauce.",
        "In mini-food processor, whirl all sauce ingredients except scallions together until smooth. Transfer sauce to bowl and garnish with scallions."
    ],
    "ingredients": [
        "Wings:",
        "1/2 cup reduced sodium soy sauce",
        "1/2 cup reduced sodium chicken broth",
        "1/4 cup mirin",
        "1/3 cup Stevia In The Raw® Bakers Bag",
        "2 tablespoons frozen (thawed) orange juice concentrate",
        "2 garlic cloves, sliced lengthwise",
        "3/4 inch piece fresh ginger, in 3 slices",
        "16 chicken wings",
        "Sauce:",
        "1 cup diced fresh mango",
        "2 tablespoons brown mustard",
        "2 tablespoons orange marmalade fruit spread",
        "2 (1 gram) packets Stevia In The Raw®",
        "1 tablespoon fresh lime juice",
        "1/8 teaspoon cayenne pepper",
        "1/2 teaspoon salt",
        "1/8 teaspoon freshly ground pepper",
        "2 tablespoons chopped scallions"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Teriyaki Chicken Wings with Hot Mango Dipping Sauce",
    "url": "http://allrecipes.com/recipe/245323/teriyaki-chicken-wings-with-hot-mango/"
}
