{
    "directions": [
        "Heat 1 tablespoon of oil in a large stock pot over medium-high heat. Crumble turkey into the pot, stirring with a wooden spoon to break apart as much as possible. Season with taco seasoning mix, coriander, oregano, chili flakes, and tomato paste, and mix until meat is evenly coated with seasonings. Continue cooking, reducing heat if necessary, until turkey is well browned.",
        "Pour in beef broth, and simmer to reduce liquid slightly, about 5 minutes. Add salsa, tomatoes, and green chilies, and continue cooking at a moderate simmer for ten minutes. Adjust the thickness at any time you feel necessary by adding water.",
        "While chili is still cooking, heat one tablespoon of oil in a large skillet over medium-high heat. Cook onion and green bell pepper, stirring occasionally for 5 minutes, or until onion is translucent and bell pepper is lightly browned. Add onion and bell pepper to the chili, and continue cooking at a very low simmer.",
        "In the same skillet, heat the remaining tablespoon of oil over medium-high heat. Add the zucchini, and cook stirring occasionally, for 5 minutes, or until lightly browned. Add the zucchini to the chili, reduce heat, and continue cooking 15 minutes more. Again, adjust the consistency with water as needed.",
        "Ladle chili into serving bowls. Top with sour cream, green onion, and cheddar cheese, and serve."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "1 1/2 pounds ground turkey",
        "1 (1 ounce) package taco seasoning mix",
        "1 teaspoon ground coriander",
        "1 teaspoon dried oregano",
        "1 teaspoon chili pepper flakes",
        "2 tablespoons tomato paste",
        "1 (14.5 ounce) can beef broth",
        "1 (7 ounce) can salsa",
        "1 (14.5 ounce) can crushed tomatoes, or coarsely chopped tomatoes packed in puree",
        "1 (7 ounce) can chopped green chile peppers",
        "1 medium onion, finely chopped",
        "1 green bell pepper, diced",
        "3 medium zucchini, halved lengthwise and sliced",
        "1 bunch green onions, chopped",
        "1 cup sour cream",
        "1 cup shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Terrific Turkey Chili",
    "url": "http://allrecipes.com/recipe/62763/terrific-turkey-chili/"
}
