{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place chicken breasts in baking pans and cover with aluminum foil.",
        "Bake chicken in the preheated oven until tender and cooked through, 1 1/4 to 1 1/2 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Cool until easily handled. Remove skin and discard. Bone chicken and chop into 1/2-inch pieces.",
        "Combine bones with drippings from baking pans in a large pot; add enough water to cover. Bring to a boil and simmer for 1 hour. Strain broth and discard bones.",
        "Place tomatoes, onion, tomatillos, garlic, and red chile pods in a blender or food processor; puree until chile pods are reduced to small flecks. Pour into a pot.",
        "Mix 1 cup chicken broth, salt, cumin, and oregano into pureed mixture in the pot. Bring to a boil; reduce heat and simmer, about 5 minutes. Stir in chicken. Remove from heat.",
        "Microwave 1 cup chicken broth and lard together in a microwave-safe bowl until lard is just melted, about 2 minutes. Mix in masa harina with your hands to make a smooth paste.",
        "Press paste evenly into the bottom of a 10x13-inch baking pan. Spread chicken mixture on top. Cover with aluminum foil.",
        "Bake in the preheated oven until chicken is heated through, about 40 minutes. Sprinkle shredded Cheddar and Monterey Jack cheese blend on top. Continue baking until cheese is melted and starting to bubble, 3 to 5 minutes. Let stand before serving, about 5 minutes."
    ],
    "ingredients": [
        "6 pounds bone-in chicken breasts",
        "water to cover",
        "1 (15 ounce) can crushed tomatoes",
        "1 onion, quartered",
        "4 tomatillos - stemmed, husked, and halved (optional)",
        "3 cloves garlic, peeled",
        "4 New Mexico dried red chile pods, stemmed and seeded",
        "1 teaspoon salt",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dried oregano",
        "1/2 cup lard",
        "1 cup masa harina",
        "1 (12 ounce) bag shredded Cheddar and Monterey Jack cheese blend"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tex-Mex Chicken Tamale Pie",
    "url": "http://allrecipes.com/recipe/254335/tex-mex-chicken-tamale-pie/"
}
