{
    "directions": [
        "Place hollandaise ingredients (avocado, lime juice, 3 tablespoons olive oil, water) in your blender and turn on until smooth. Scrape the sides as needed. Add salt to taste. The sauce should be thick and creamy, but if needed add a bit more lime juice, oil, and/or water to get it moving more. Refrigerate until ready to use.",
        "Preheat your grill to 375 degrees F. Slice the potatoes lengthwise into 1/3-inch-thick slabs. Drizzle with 2 teaspoons olive oil and rub over both sides. Generously top with salt and pepper. Place on the grill for about 12-15 minutes. Flip and continue to grill until fork tender, about 15 minutes. If your potatoes finish before you're done cooking the vegetables, turn the heat off on the grill with the lid shut and leave them there to stay warm until you're ready.",
        "My egg poaching method: While the potatoes grill, place about 4 inches of water in a large pot. Heat over high with the lid on until the water simmers. Uncover and reduce heat so the water is just barely simmering a few small bubbles. Maintain this heat throughout the poaching process. Place 2 paper towels on a large plate. Crack 1 egg in a small bowl. Gently swirl your water with a spatula in one direction and slowly pour the egg into the center of the pot. Gently swirl the water a few times around the egg then let it be for 4 minutes. Carefully remove with a slotted spoon and drain on the paper towels; repeat for each egg, using the same water.",
        "Heat a pan over medium with a drizzle of oil. Place the onion in the pan with a good pinch of salt and let it cook, stirring every minute or so, for about 8 minutes. Add the garlic, cumin, and chili powder and cook for another minute. Return the pot of water to just below a simmer. Add the bell pepper to the pan and cook for another 3-4 minutes, stirring once in a while, until just starting to soften. Add the corn and black beans and cook until hot. Stir in the adobo sauce and turn to low.",
        "Place all eggs gently back in the warm water and let them reheat for no longer than 1 minute. Place potato slabs on 2 plates with the veggie mixture over top. Remove eggs with a slotted spoon or place on the paper towel to drain the water and then place them on top of the veggie mixture (2 for each serving). Top with the avocado hollandaise, salt, pepper, and hot sauce if desired. Serve immediately."
    ],
    "ingredients": [
        "Avocado-Lime Hollandaise:",
        "1 ripe avocado, pitted, peeled",
        "1/4 cup fresh lime juice, or more to taste",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons water",
        "Salt to taste",
        "Eggs Benedict:",
        "2 large russet potatoes",
        "2 teaspoons extra-virgin olive oil",
        "Salt and black pepper to taste",
        "4 large eggs",
        "1/2 cup thinly sliced red onion",
        "1 teaspoon minced garlic",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "1/2 large bell pepper, thinly sliced",
        "1/2 cup corn kernels, fresh or frozen (thawed)",
        "1/2 cup drained canned black beans",
        "2 teaspoons adobo sauce from chipotle peppers"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tex-Mex Eggs Benedict with Grilled Potato Slabs and Avocado-Lime Hollandaise",
    "url": "http://allrecipes.com/recipe/245452/tex-mex-eggs-benedict-with-grilled-po/"
}
