{
    "directions": [
        "Stir together oil, garlic, chile powder, cumin, pepper, 1/2 teaspoon cayenne, and 2 teaspoons salt in a small bowl. Pat lamb dry and rub all over with spice mixture. Transfer lamb to a large sealable plastic bag and seal bag, pressing out excess air. Marinate lamb, chilled, at least 8 hours.",
        "Bring lamb to room temperature, about 1 hour.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Transfer lamb to a 17- by 12-inch heavy shallow baking pan and cover pan tightly with foil, then bake 1 1/4 hours.",
        "Meanwhile, stir together marmalade, vinegar, and remaining 1/2 teaspoon cayenne and 1/2 teaspoon salt in a 1-quart heavy saucepan and bring to a simmer, stirring occasionally.",
        "Discard foil from lamb and carefully pour off and discard fat from pan. Brush lamb with some of marmalade glaze and roast, basting every 10 minutes (use all of glaze) and turning racks over every 20 minutes, until browned and tender, about 1 hour. Cut racks into individual ribs.",
        "Whisk together water, grits, and salt in a 2-quart heavy saucepan and bring to a boil, whisking constantly. Reduce heat to low and simmer, stirring frequently, until very thick, about 10 minutes. Remove from heat and stir in cheeses. Serve grits with ribs."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "2 garlic cloves, minced",
        "2 tablespoons pure chile powder (preferably ancho)",
        "2 teaspoons ground cumin",
        "1 teaspoon black pepper",
        "1 teaspoon cayenne",
        "2 1/2 teaspoons salt",
        "3 to 3 1/4 pounds Denver ribs (lamb breast spareribs; 2 racks)",
        "1/2 cup orange marmalade (not bitter)",
        "1/2 cup red-wine vinegar",
        "2 cups cold water",
        "3/4 cup white grits",
        "1 teaspoon salt",
        "2 ounces coarsely shredded sharp white Cheddar (2/3 cup)",
        "1 ounce finely grated Parmigiano-Reggiano (1/2 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Lamb",
        "Bake",
        "Marinate",
        "Rack of Lamb",
        "Hominy/Cornmeal/Masa",
        "Gourmet"
    ],
    "title": "Tex-Mex Roasted Lamb Ribs With Cheese Grits",
    "url": "http://www.epicurious.com/recipes/food/views/tex-mex-roasted-lamb-ribs-with-cheese-grits-237590"
}
