{
    "directions": [
        "Preheat oven to 375°F.",
        "Chop onion, bell pepper, and cilantro and mince garlic, transferring all to a large bowl. Into a blender tear 2 bread slices and grind into fine crumbs. Add crumbs to onion mixture. Make more bread crumbs in same manner with remaining 2 bread slices and add to onion mixture. Add ‚ cup chili sauce and all remaining ingredients and with your hands mix until just combined (do not overmix).",
        "Transfer mixture to an 8 1/2 x 4 1/2 x 2 1/2-inch glass loaf pan, pressing down on mixture to eliminate any air pockets (mixture will completely fill pan), and spread remaining 6 tablespoons chili sauce evenly over top. Line a shallow baking pan with foil and put loaf pan in baking pan (to catch any drippings). Bake meat loaf, uncovered, in middle of oven 1 1/2 hours, or until a meat thermometer inserted 2 inches into middle of loaf registers 170°F. Transfer meat loaf in pan to a rack and let stand, loosely covered with foil, 20 minutes before slicing. Meat loaf may be made 1 day ahead and cooled, uncovered, before being chilled, covered. If desired, reheat meat loaf, covered, in a 350°F. oven about 20 minutes.",
        "Cut meat loaf into 6 or 12 slices and serve with potatoes."
    ],
    "ingredients": [
        "1 medium onion",
        "1 bell pepper (orange or red)",
        "3/4 cup packed fresh cilantro sprigs",
        "5 garlic cloves",
        "4 slices firm white sandwich bread",
        "1/2 cup plus 6 tablespoons bottled chili sauce such as Heinz",
        "1 1/2 pounds lean ground turkey",
        "1/2 cup nonfat sour cream",
        "1 large egg",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons ground cumin",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "Accompaniment:chipotle mashed potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pepper",
        "Potato",
        "turkey",
        "Winter",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Tex-Mex Turkey Meat Loaf and Chipotle Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/tex-mex-turkey-meat-loaf-and-chipotle-mashed-potatoes-101065"
}
