{
    "directions": [
        "Finely chop onions and bell pepper and mince garlic. Cut chicken into 3/4-inch cubes. In a 12-inch skillet cook onion, bell pepper, and garlic with salt and pepper to taste in 3 tablespoons oil over moderate heat, stirring, until onion is softened. Add chicken and spices and cook, stirring, until most of chicken begins to turn opaque on outside, about 2 minutes. Stir in vinegar and 1 1/4 cups beer, reserving remainder, and simmer, uncovered, stirring occasionally, until chicken is just cooked through, about 5 minutes.",
        "Transfer chicken with a slotted spoon to a bowl and boil sauce, stirring occasionally, until slightly thickened, about 5 minutes. Season sauce with salt and pepper and pour over chicken, stirring to coat.",
        "In a saucepan heat beans with reserved beer and 1/4 cup salsa over moderate heat, stirring, until mixture is of a spreadable consistency.",
        "In a 9-inch skillet heat remaining 1/2 cup oil over moderate heat until hot but not smoking and cook tortillas 1 at a time until softened but not crisp, about 5 seconds. With tongs transfer tortillas as cooked to paper towels to drain. In a bowl gently toss cheeses together.",
        "Preheat oven to 325°F. and lightly oil a 13- by 9- by 3-inch glass or ceramic baking dish.",
        "In baking dish arrange 4 tortillas in one layer, overlapping slightly (tortillas will not cover bottom completely). Spread half of bean mixture evenly over tortillas in dish and top with half of chicken mixture. Sprinkle one third cheese over chicken and spread half of remaining salsa over cheese.",
        "Repeat layering of tortillas, beans, chicken, cheese, and salsa and top with remaining 4 tortillas, gently pressing them into salsa. Sprinkle remaining cheese over tortillas. Bake lasagne in middle of oven 35 minutes.",
        "Increase temperature to 425°F.",
        "Continue baking lasagne until golden and bubbling, about 10 minutes more. Let lasagne stand 15 minutes.",
        "Serve lasagne with sour cream, cilantro, and jalapeño slices."
    ],
    "ingredients": [
        "2 medium onions",
        "1 red bell pepper",
        "5 garlic cloves",
        "4 skinless boneless chicken breast halves (about 1 1/4 pounds total)",
        "1/2 cup plus 3 tablespoons vegetable oil",
        "1 tablespoon chili powder",
        "1 tablespoon ground cumin",
        "1 tablespoon ground coriander seeds",
        "1 teaspoon freshly ground black pepper",
        "1/4 teaspoon cayenne",
        "2 tablespoons cider vinegar",
        "a 12-ounce bottle of beer (not dark)",
        "a 16-ounce can refried beans",
        "two 16-ounce jars salsa",
        "twelve 6- to 7-inch corn tortillas",
        "2 cups coarsely grated Monterey Jack cheese (about 8 ounces)",
        "2 cups coarsely grated Colby cheese (about 8 ounces)",
        "Accompaniments:",
        "sour cream",
        "fresh cilantro sprigs",
        "pickled jalapeño slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Bean",
        "Cheese",
        "Chicken",
        "Pepper",
        "Poultry",
        "Bake",
        "Super Bowl",
        "Casserole/Gratin",
        "Fall",
        "Winter",
        "Potluck",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Tex-Mex \"Lasagne\"",
    "url": "http://www.epicurious.com/recipes/food/views/tex-mex-lasagne-15736"
}
