{
    "directions": [
        "Using a mortar and pestle or a spice grinder, finely grind the cumin seeds. Transfer to a bowl, add the chile powder, paprika and oregano, and mix well. Set aside.",
        "Season the beef with salt and pepper. In a large, heavy pot over medium-high heat, warm 2 Tbs. of the oil. Working in batches, sear the beef, turning occasionally, until browned, about 5 minutes. Transfer to a plate.",
        "Add the remaining 1 Tbs. oil to the pot. Add the onion, jalapeño, bell pepper and garlic and reduce the heat to medium. Cover and cook, stirring occasionally, until the onion softens, about 5 minutes. Uncover, add the spice mixture and stir well for 30 seconds. Stir in the beer and broth. Return the beef to the pot, cover and reduce the heat to low. Simmer until the beef is fork-tender, 1 1/2 to 2 hours.",
        "Remove the chili from the heat and let stand for 5 minutes. Skim any fat from the surface. Bring the chili to a simmer over medium heat. Transfer about 1/2 cup (4 fl. oz./125 ml) of the cooking liquid to a small bowl and whisk in the cornmeal. Stir into the chili and cook until lightly thickened, about 1 minute. Season with salt and pepper. Spoon the chili into bowls and serve, garnished with cheese, red onions, sour cream and jalapeños. Serves 8.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)"
    ],
    "ingredients": [
        "2 tsp. cumin seeds, toasted",
        "1/4 cup (3/4 oz./20 g) ancho chile powder",
        "1 Tbs. Spanish smoked paprika",
        "2 tsp. dried oregano",
        "4 lb. (2 kg) boneless beef chuck roast, cut into 1/2-inch (12-mm) chunks",
        "Kosher salt and freshly ground pepper",
        "3 Tbs. olive oil",
        "1 large yellow onion, chopped",
        "1 jalapeño chile, seeded and minced",
        "1 large red bell pepper, seeded and chopped",
        "4 garlic cloves, minced",
        "1 1/2 cups (12 fl. oz./375 ml) lager beer",
        "1 cup (8 fl. oz./250 ml) beef broth",
        "2 Tbs. yellow cornmeal",
        "Shredded Cheddar cheese, chopped red onions, sour cream and minced jalapeño chiles for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Texas Beef Chili",
    "url": "http://www.williams-sonoma.com/recipe/texas-beef-chili.html"
}
