{
    "directions": [
        "In a food processor, combine the salt, pepper, brown sugar, paprika, onion powder, garlic, mustard, cumin and chili powder. Process into a coarse powder.",
        "Rinse the brisket under cold running water and pat dry with paper towels. Generously season the brisket all over with the spice rub, massaging it into the meat. Wrap in plastic wrap and refrigerate for at least 1 hour or up to overnight. Remove from the refrigerator 30 minutes before grilling.",
        "Prepare a charcoal or gas grill for indirect grilling over medium-low heat. Brush and oil the grill grate. Unwrap the brisket, season again with the rub and place it, fat side up, in a large, disposable aluminum roasting pan.",
        "For a charcoal grill:",
        "Sprinkle half of the soaked wood chips over the coals. Place the roasting pan with the brisket on the grill grate toward side of the grill where the heat is less intense, cover the grill and cook, basting with any accumulated juices, until the meat is mahogany brown in color, 3 1/2 to 4 hours. Replenish the coals and wood chips every 30 minutes.",
        "For a gas grill:",
        "Increase one burner to high heat. Heat a smoker box half full of soaked wood chips until smoking, then reduce the heat to medium-low. Place the roasting pan with the brisket on the grill grate over the area of lower heat, cover the grill and cook, basting with any accumulated juices, until mahogany brown in color, 3 1/2 to 4 hours. Replenish the wood chips every 30 minutes.",
        "Transfer the brisket to a cutting board, cover loosely with aluminum foil and let rest for 10 minutes. Cut the meat into thin slices. Serve with barbecue sauce and slices of white bread. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "On the Grill,",
        "by Willie Cooper (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1/4 cup coarse salt",
        "3 Tbs. freshly ground pepper",
        "3 Tbs. firmly packed light brown sugar",
        "3 Tbs. paprika",
        "3 Tbs. onion powder",
        "2 Tbs. granulated garlic",
        "2 Tbs. dry mustard",
        "1 Tbs. ground cumin",
        "1 Tbs. chili powder",
        "1 beef brisket, 5 to 7 lb., trimmed to leave a 1/4-inch layer of fat",
        "5 lb. mesquite chips, soaked in water for 30 minutes",
        "White bread for serving (optional)",
        "Barbecue sauce for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Texas-Style Barbecued Brisket",
    "url": "http://www.williams-sonoma.com/recipe/texas-style-barbecued-brisket.html"
}
