{
    "directions": [
        "Place chiles in medium bowl. Pour enough boiling water over to cover. Soak until chiles soften, at least 30 minutes and up to 4 hours.",
        "Preheat oven to 350°F. Sauté bacon in heavy large oven-proof pot over medium-high heat until beginning to brown. Add onions. Reduce heat to medium; cover and cook until tender, about 5 minutes. Sprinkle beef all over with coarse salt and pepper. Add to pot; stir to coat. Set aside.",
        "Drain chiles, reserving soaking liquid. Place chiles in blender. Add 1 cup soaking liquid, garlic, chili powder, cumin seeds, oregano, coriander, and 1 1/2 teaspoons coarse salt; blend to puree, adding more soaking liquid by 1/4 cupfuls if very thick. Pour puree over brisket in pot. Add tomatoes with juices, beer, green chiles, and cilantro stems. Stir to coat evenly.",
        "Bring chili to simmer. Cover and place in oven. Cook 2 hours. Uncover and cook until beef is almost tender, about 1 hour. Add squash; stir to coat. Roast uncovered until beef and squash are tender, adding more soaking liquid if needed to keep meat covered, about 45 minutes longer. Season chili to taste with salt and pepper. Tilt pot and spoon off any fat from surface of sauce. DO AHEAD: Can be made 2 days ahead. Cool 1 hour. Chill uncovered until cold, then cover and keep chilled."
    ],
    "ingredients": [
        "6 large dried ancho chiles*",
        "6 ounces bacon, diced",
        "1 1/4 pounds onions, chopped (about 4 cups)",
        "1 5-pound flat-cut (also called first-cut) beef brisket, cut into 2 1/2- to 3-inch cubes",
        "Coarse kosher salt",
        "6 large garlic cloves, peeled",
        "2 tablespoons chili powder",
        "2 teaspoons cumin seeds",
        "1 teaspoon dried oregano",
        "1 teaspoon ground coriander",
        "1 1/2 teaspoons coarse kosher salt",
        "1 1/2 10-ounce cans fire-roasted diced tomatoes with green chiles (1 3/4 cups)",
        "1 12-ounce bottle Mexican beer",
        "1 7-ounce can diced roasted green chiles",
        "1/2 cup finely chopped fresh cilantro stems",
        "4 cups 1 1/2- to 2-inch chunks seeded peeled butternut squash (from 3 1/2-pound squash)",
        "Fresh cilantro leaves",
        "1 Red onion",
        "Diced avocado",
        "Shredded Monterey Jack cheese",
        "Warm corn and/or flour tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beer",
        "Pepper",
        "Tomato",
        "Bake",
        "Roast",
        "Super Bowl",
        "Kid-Friendly",
        "High Fiber",
        "Back to School",
        "Dinner",
        "Brisket",
        "Butternut Squash",
        "Fall",
        "Winter",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Texas Beef Brisket Chili",
    "url": "http://www.epicurious.com/recipes/food/views/texas-beef-brisket-chili-350108"
}
