{
    "directions": [
        "In a large kettle heat the oil over moderately high heat until it is hot but not smoking and in it brown the chicken, patted dry, in batches, transferring it as it is browned to a plate. To the kettle add the gingerroot and the garlic and cook the mixture for 1 minute. Add the flour and the curry powder and cook the mixture, stirring, for 1 minute. Whisk in the Sherry, the coconut cream, and the broth and bring the mixture to a boil, whisking. Add the black pepper, the chopped coriander, the soy sauce, the jalapeño, the chicken, and any juices that have accumulated on the plate and simmer the mixture, covered, for 10 minutes. Add the bell peppers and simmer the mixture, covered, for 20 to 25 minutes, or until the chicken is cooled through. Transfer the chicken with a slotted spoon to a serving dish and keep it warm. Boil the liquid until it is thickened and reduced to about 2 cups, skim off the fat, and season the sauce with salt and pepper and the lime juice. Nap the chicken with some of the sauce, garnish it with the coriander sprigs, and serve it with the rice."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "6 whole chicken legs (about 3 pounds), cut into drumstick and thigh sections",
        "2 teaspoons minced peeled fresh gingerroot",
        "2 teaspoons finely chopped garlic",
        "1 1/2 tablespoons all-purpose flour",
        "1/2 teaspoon curry powder",
        "2 tablespoons dry Sherry",
        "an 8 1/2-ounce can cream of coconut",
        "1 1/2 cups chicken broth",
        "1/2 teaspoon black pepper",
        "1/4 cup finely chopped fresh coriander plus, if desired, coriander sprigs for garnish",
        "1/4 cup soy sauce",
        "2 1/2 teaspoons minced seeded fresh jalapeño pepper, or to taste (wear rubber gloves)",
        "2 red bell peppers, chopped",
        "1 tablespoon fresh lime juice, or to taste",
        "cooked rice as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Coconut",
        "Curry",
        "Gourmet"
    ],
    "title": "Thai-Style Chicken in Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/thai-style-chicken-in-coconut-sauce-12159"
}
