{
    "directions": [
        "Preheat oven to 350°F. Arrange ribs in single layer in large roasting pan. Add just enough boiling water to cover ribs. Cover pan with foil. Oven-braise ribs until almost tender, about 1 1/2 hours.",
        "Meanwhile, cut bottom 2 inches from each lemongrass stalk (discard upper portions). Slice lemongrass into thin rounds; place in blender. Add 1/2 cup tamari, sugar, Sherry, peanut sauce, sesame oil, garlic, and ginger; blend until almost smooth. Blend in coconut milk and remaining 6 tablespoons tamari for marinade.",
        "Cool ribs, still covered, 30 minutes. transfer ribs to heavy-duty 2-gallon resealable plastic bag; discard braising liquid. Pour marinade into bag. Seal top and turn several times to coat ribs evenly. Refrigerate overnight, turning occasionally.",
        "Preheat oven to 350°F. Using tongs, arrange ribs in single layer on large rimmed baking sheet. Spoon marinade from bag over ribs. Roast uncovered until ribs are very tender, basting often with marinade, about 1 1/2 hours. Arrange ribs on platter. Scrape marinade into pitcher for sauce; spoon off fat that rises to surface. Brush sauce generously over ribs. Serve with Sesame-Cilantro Rice , passing remaining sauce alongside."
    ],
    "ingredients": [
        "6 pounds meaty spareribs (about 2 racks), cut into 2-rib portions",
        "Boiling water",
        "2 large lemongrass stalks",
        "1/2 cup plus 6 tablespoons tamari soy sauce",
        "1/2 cup (packed) golden brown sugar",
        "1/2 cup dry Sherry",
        "2 tablespoons Thai peanut sauce",
        "2 tablespoons Asian sesame oil",
        "4 large garlic cloves, peeled",
        "1 1 1/2-inch piece fresh ginger, peeled, chopped",
        "3/4 cup canned unsweetened coconut milk",
        "Sesame-Cilantro Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Braise",
        "Marinate",
        "Super Bowl",
        "Dinner",
        "Tailgating",
        "Chill",
        "Party",
        "Advance Prep Required"
    ],
    "title": "Thai Spareribs",
    "url": "http://www.epicurious.com/recipes/food/views/thai-spareribs-363719"
}
