{
    "directions": [
        "Marinate the steak and cook the noodles",
        "In a shallow glass or ceramic dish just large enough to hold the steak, stir together the garlic, fish sauce, soy sauce, sugar and 1/4 cup of the peanut oil. Pour 1/4 cup of the marinade into a small bowl, cover and refrigerate to use later as a vinaigrette. Season the steak with pepper. Add the steak to the marinade and turn to coat. Let stand at room temperature for 15 minutes.",
        "Meanwhile, bring a large pot of water to a boil over high heat. Add the vermicelli noodles and cook according to the package directions. Drain and set aside.",
        "Cook the steak",
        "Prepare a hot fire in a grill and oil the grill rack. Or, preheat a broiler.",
        "Remove the steak from the marinade, discarding the marinade. Place the steak on the grill rack, or put on a baking sheet and place under the broiler. Cook, turning once, 10 to 12 minutes total for medium-rare, or until done to your liking. Transfer the steak to a carving board, cover loosely with aluminum foil and let rest for 5 minutes.",
        "Make the vinaigrette and assemble the salad",
        "Whisk the remaining 1/4 cup oil and the vinegar into the reserved marinade. Season with pepper. Cut the steak across the grain into thin slices. In a large bowl, combine the salad greens, vermicelli noodles, onion, basil and steak slices. Drizzle with the vinaigrette and toss to combine. Divide among 4 plates and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Weeknight",
        ", by Melanie Barnard (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "4 garlic cloves, minced",
        "1/4 cup Asian fish sauce",
        "1 1/2 Tbs. soy sauce",
        "2 tsp. sugar",
        "1/2 cup peanut oil",
        "1 1/2 lb. flank steak",
        "Freshly ground pepper, to taste",
        "1/2 lb. rice vermicelli noodles",
        "2 Tbs. rice vinegar",
        "6 cups mixed salad greens",
        "1 small red onion, halved and thinly sliced",
        "1/2 cup fresh basil, preferably Thai"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Thai Beef Noodle Salad",
    "url": "http://www.williams-sonoma.com/recipe/thai-beef-noodle-salad.html"
}
