{
    "directions": [
        "Put the broccoli and water in a microwavable bowl. Cover and cook in the microwave on high until the broccoli is just crisp-tender, 3 to 4 minutes.",
        "In a large nonstick fry pan over medium-high heat, warm the oil. Season the beef lightly with salt and pepper. Working in batches, add the beef (do not crowd the pan) and cook, turning once, until just browned, about 1 minute per side. Transfer to a plate.",
        "Add the shallots and ginger to the pan and sauté until fragrant, about 1 minute. Add the curry paste and stir for 2 minutes. Add the coconut milk, brown sugar and fish sauce and simmer, stirring up the browned bits, until the sauce thickens, about 2 minutes. Add the broccoli and beef and simmer until heated through.",
        "Fluff the rice with a fork and divide among 4 warmed bowls. Top with the beef-broccoli mixture. Sprinkle with the basil and serve immediately with lime wedges to squeeze over the top. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free,",
        "by Kristine Kidd (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "3/4 lb. (375 g) broccoli florets (1 1/2-inch/4-cm florets)",
        "2 Tbs. water",
        "1 Tbs. vegetable oil",
        "3/4 lb. (375 g) beef tenderloin, trimmed and cut across the grain\n  into thin slices",
        "Kosher salt and freshly ground pepper, to taste",
        "2 large shallots, sliced",
        "3 Tbs. minced fresh ginger",
        "1 Tbs. Thai red curry paste",
        "1 can (14 fl. oz./430 ml) coconut milk, stirred thoroughly",
        "1 Tbs. firmly packed brown sugar",
        "1 Tbs. Asian fish sauce",
        "Steamed brown jasmine or basmati rice for serving",
        "1/2 cup (1/2 oz./15 g) slivered fresh basil",
        "Lime wedges for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Thai-Style Beef and Broccoli Curry",
    "url": "http://www.williams-sonoma.com/recipe/thai-style-beef-and-broccoli-curry.html"
}
