{
    "directions": [
        "Combine stock, water, curry paste, garlic, ginger, coriander seeds, and whole cilantro leaves in a 3- to 4-quart saucepan, then simmer, uncovered, until ginger is softened, about 15 minutes. Pour through a paper-towel-lined sieve into a 5- to 6-quart heavy pot and discard solids. Stir rice into soup and simmer, uncovered, stirring occasionally, until tender, about 15 minutes.",
        "Add chicken or shrimp and poach at a bare simmer, uncovered, until just cooked through, about 3 minutes. Stir in coconut milk, snow peas, and fish sauce and simmer, uncovered, until peas are crisp-tender, about 2 minutes. Remove from heat and stir in lime juice, salt, and chopped cilantro.",
        "*Available at Asian markets, some specialty foods shops, and some supermarkets."
    ],
    "ingredients": [
        "8 cups chicken stock or low-sodium chicken broth (64 fl oz)",
        "4 cups water",
        "1 tablespoon Thai green curry paste*",
        "4 garlic cloves, coarsely chopped",
        "1 (2-inch) piece peeled fresh ginger, coarsely chopped",
        "1 teaspoon coriander seeds, crushed",
        "2 cups loosely packed whole fresh cilantro leaves plus 1/2 cup chopped (from 2 large bunches)",
        "1 cup jasmine rice",
        "3/4 lb boneless skinless chicken breast, thinly sliced crosswise, then slices cut lengthwise into thin strips, or 3/4 lb medium shrimp in shell (31 to 35 per lb), peeled and deveined",
        "1 (13- to 14-oz) can unsweetened coconut milk, stirred well",
        "1/4 lb snow peas, trimmed and cut diagonally into 1/4-inch strips",
        "2 tablespoons Asian fish sauce",
        "2 tablespoons fresh lime juice",
        "1 1/2 teaspoons salt, or to taste",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Poultry",
        "Rice",
        "Coconut",
        "Curry",
        "Winter",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Thai-Style Chicken and Rice Soup",
    "url": "http://www.epicurious.com/recipes/food/views/thai-style-chicken-and-rice-soup-109019"
}
