{
    "directions": [
        "Cut dried chiles into 1/4-inch pieces with kitchen shears and soak in warm water until softened, about 20 minutes. Drain well in a sieve.",
        "While chiles soak, toast coriander in a dry small heavy skillet over moderate heat, shaking skillet, until fragrant, 3 to 4 minutes, then cool. Thinly slice lower 6 inches of lemongrass stalks and finely chop.",
        "Finely grind coriander and peppercorns with mortar and pestle (or in mini food processor), about 2 minutes, then toss together with lemongrass, galangal, lime leaves, cilantro, shallot, garlic, fresh chiles, and soaked dried chiles in a bowl. Pound mixture in 3 batches with mortar and pestle until a fairly smooth paste is formed, 8 to 10 minutes per batch, transferring to cleaned bowl. (If using food processor, add about 1 1/2 tablespoons water per batch.) Return all of curry paste to mortar, then add shrimp paste and salt and pound (or pulse) until combined well, about 1 minute."
    ],
    "ingredients": [
        "17 to 20 (2- to 3-inch-long) prik haeng (dried hot red chiles), halved and seeds discarded",
        "4 teaspoons coriander seeds",
        "2 fresh lemongrass stalks, 1 or 2 outer leaves discarded (or use reserved bottoms from iced lemongrass tea, page 160)",
        "1 teaspoon whole black peppercorns",
        "4 teaspoons finely chopped peeled fresh or thawed frozen greater galangal (sometimes called kha)",
        "6 (4-inch-long) fresh or frozen Kaffir lime leaves (sometimes called bai makroot), finely chopped",
        "2 tablespoons chopped fresh cilantro roots or stems",
        "5 small shallots, chopped (6 tablespoons)",
        "1/4 cup chopped garlic",
        "15 to 20 (1-inch-long) red prik kii noo (fresh bird's-eye chiles) or serrano chiles, finely chopped",
        "2 teaspoons ga-pi (Thai shrimp paste)",
        "1/2 teaspoon salt",
        "Special equipment: a large (2-cup) mortar and pestle (preferably granite) or a mini food processor"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Garlic",
        "Pepper",
        "Hot Pepper",
        "Shallot",
        "Lemongrass",
        "Cilantro",
        "Coriander",
        "Gourmet"
    ],
    "title": "Thai Red Curry Paste",
    "url": "http://www.epicurious.com/recipes/food/views/thai-red-curry-paste-109465"
}
