{
    "directions": [
        "In a saucepan, bring vinegar and honey to a boil. Stir frequently until the honey has dissolved and continue to cook for 10-15 minutes. Remove from heat. Once cooled, add cucumber, chiles and coriander and stir well. Set aside until ready to serve.",
        "Heat the coconut milk in a large saucepan or casserole dish which has a lid. Add shallot, garlic and ginger, and cook over a low to medium heat for 3-5 minutes. Add chicken and turn up the heat until it is evenly browned. Add curry powder and turmeric powder and stir well to evenly coat chicken. Add rice, soy sauce and miso paste, and stir well. Pour in 250 ml (9 fl oz/1 cup) water and stir well. Add cardamom pods, bay leaf and cinnamon stick. Cover and bring to a boil. Reduce heat and simmer gently for 30-35 minutes or until the rice is cooked and tender. Remove from heat and leave for 10 minutes leaving the lid on. After 10 minutes, fluff the rice with a fork and discard cardamom pods, bay leaf and cinnamon stick. Serve rice curry warm with cucumber relish on the side."
    ],
    "ingredients": [
        "300 ml (10 fl oz/ 1 1/4 cup) rice vinegar",
        "260 g (9 oz) honey",
        "360 g (12 oz) cucumber, peeled, cored and finely chopped",
        "4 tbsp finely chopped long red chiles",
        "3 tbsp chopped coriander",
        "60 ml (2 1/4 fl oz / 1/4 cup) coconut milk",
        "1 shallot, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 tbsp finely chopped fresh ginger",
        "4 chicken breasts, skinned and boned",
        "1 tbsp curry powder",
        "1/4 tsp turmeric powder",
        "300 g (10 1/2 oz) brown jasmine rice",
        "3 tbsp soy sauce",
        "1 tbsp miso paste",
        "4 cardamom pods",
        "1 bay leaf",
        "1 cinnamon stick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Herb",
        "Rice",
        "Dinner",
        "Curry",
        "Cucumber",
        "Healthy",
        "Honey",
        "Soy Sauce",
        "Cardamom",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Thai Rice Curry with Herbed Chicken (_Khao Mok Gai_)",
    "url": "http://www.epicurious.com/recipes/food/views/thai-rice-curry-with-herbed-chicken-em-khao-mok-gai-em-355289"
}
