{
    "directions": [
        "Wearing rubber gloves, cut chili crosswise into thin slices and in a small saucepan stir together with vinegar and sugar. Bring mixture to a boil and simmer 30 seconds. Remove chili vinegar from heat.",
        "Remove and discard tough outer layer of lemongrass if necessary and finely chop enough to measure 1 teaspoon. In a small bowl stir together lemongrass, garlic, and gingerroot. Peel shrimp and devein if desired. Pat shrimp dry with paper towels and season with salt and pepper. Add shrimp to lemongrass mixture, stirring to coat well, and marinate at room temperature 15 minutes.",
        "While shrimp are marinating, diagonally cut carrots into 1/8-inch-thick slices. Halve zucchini lengthwise and diagonally cut halves into 1/8-inch-thick slices. Halve cucumber lengthwise and seed. Diagonally cut cucumber halves into thin slices. Diagonally cut scallions into thin slices. Chop coriander and coarsely chop peanuts.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 1 tablespoon oil, swirling wok or skillet to coat evenly, and heat until hot but not smoking. Add carrots and stir-fry until barely crisp-tender, about 3 minutes. Add zucchini and stir-fry until crisp-tender, about 2 minutes. Transfer vegetables to a large bowl.",
        "Add 1 tablespoon oil to wok or skillet and heat until just smoking. Stir-fry half of shrimp until just cooked through, about 3 minutes, and transfer to bowl of vegetables. Add remaining tablespoon oil and stir-fry remaining shrimp in same manner.",
        "Return shrimp-vegetable mixture to wok or skillet and stir-fry until combined and heated through. Add chili vinegar, cucumber, scallions, coriander, peanuts, and salt and pepper to taste and stir to combine.",
        "Serve stir-fry over rice in bowls, garnished with mint, coriander, and lime wedges."
    ],
    "ingredients": [
        "half of a 4-inch-long fresh red chili",
        "1/4 cup seasoned rice vinegar",
        "1/4 cup sugar",
        "a 1-inch piece fresh lemongrass",
        "2 teaspoons minced garlic",
        "2 teaspoons minced peeled fresh gingerroot",
        "1 pound large shrimp (16 to 20)",
        "3 medium carrots",
        "2 medium zucchini",
        "1/2 English cucumber",
        "3 scallions",
        "1/4 cup packed fresh coriander leaves",
        "1/4 cup salted peanuts (about 1 ounce)",
        "3 tablespoons peanut oil",
        "Accompaniment:Cooked Rice",
        "Garnish: fresh mint leaves cut into thin strips, fresh coriander leaves, and lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Shellfish",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Thai-Inspired Shrimp Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/thai-inspired-shrimp-stir-fry-14487"
}
