{
    "directions": [
        "Drain tofu and cut each piece into 4 squares; cut each square diagonally into 2 triangles. Set tofu triangles aside.",
        "Place shiitake mushrooms into a bowl of hot water and allow to rehydrate until moist and plump, about 20 minutes. Cut out woody stems and finely chop mushrooms.",
        "Place zucchini, onion, garlic, and jalapeno pepper into a food processor and process until the vegetables are almost a paste; transfer to a bowl and stir in shiitake mushrooms, egg, soy sauce, ginger, cornstarch, and hoisin sauce. Fold shredded cabbage into the stuffing.",
        "Heat 2 tablespoons vegetable oil in a large skillet over medium heat. Pat tofu triangles dry with paper towels and pan-fry in the hot oil until browned on all sides except 1 narrow side for stuffing, 2 to 3 minutes frying time per side. Remove tofu triangles and let cool until you can handle them.",
        "With a sharp paring knife, cut a slit into the unbrowned side of a tofu triangle; scoop out center of the tofu with a grapefruit spoon, leaving the walls of the triangle about 1/4-inch thick. Use a spoon to fill each triangle generously with the stuffing, letting stuffing mound out of the tofu piece.",
        "Heat remaining 2 tablespoons vegetable oil in skillet over medium heat; place tofu triangles, stuffing sides down, into the hot oil and pan-fry until stuffing edge is browned and stuffing is hot and set inside, about 5 minutes. Turn triangles on their sides and refry for a minute or two in the hot oil to rewarm."
    ],
    "ingredients": [
        "2 (12 ounce) packages extra firm tofu",
        "1/4 cup dried shiitake mushrooms",
        "1 zucchini, coarsely chopped",
        "1 onion, halved",
        "3 cloves garlic",
        "1 jalapeno pepper, seeded and coarsely chopped",
        "1 egg",
        "2 tablespoons soy sauce",
        "2 tablespoons minced fresh ginger, or to taste",
        "1 tablespoon cornstarch",
        "1 tablespoon hoisin sauce",
        "1/4 cup shredded cabbage",
        "1/4 cup vegetable oil, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thai Stuffed Tofu",
    "url": "http://allrecipes.com/recipe/221926/thai-stuffed-tofu/"
}
