{
    "directions": [
        "Mix together soy, honey, 1 tablespoon fish sauce, and 1/4 teaspoon salt in a shallow baking dish, then add steak and turn to coat. Marinate at room temperature 20 minutes.",
        "While steak marinates, heat 2 tablespoons oil in a small heavy saucepan over medium-high heat until it shimmers, then cook shallots, stirring occasionally, until browned well, about 8 minutes. Add ginger and curry paste and cook, stirring occasionally, 1 minute, then add broth and simmer 5 minutes. Stir in lime juice, remaining tablespoon fish sauce, and salt to taste and keep warm, covered.",
        "Heat grill pan over medium-high heat until hot, then lightly oil. Grill steak, turning once, about 8 minutes total (for rare). Transfer to a cutting board and let stand 5 minutes.",
        "Meanwhile, toss bell pepper and scallions with remaining tablespoon oil, then grill, turning frequently, until softened, about 5 minutes. Transfer to a large bowl.",
        "While steak stands, cook noodles in a pasta pot of boiling unsalted water until al dente, 4 to 7 minutes. Drain well, then add to vegetables and toss well. Divide noodles among 4 deep bowls and top with broth. Cut steak in half lengthwise, then thinly slice across the grain and serve on top of noodles."
    ],
    "ingredients": [
        "1 tablespoon soy sauce",
        "1 tablespoon mild honey",
        "2 tablespoons Asian fish sauce, divided",
        "1 pound flank steak",
        "3 tablespoons vegetable oil, divided",
        "2 large shallots, thinly sliced (1 cup)",
        "1 tablespoon finely chopped peeled ginger",
        "1 1/2 teaspoons Thai green-curry paste",
        "1 3/4 cups reduced-sodium beef broth",
        "1 tablespoon fresh lime juice",
        "1 red bell pepper, cut into 1/4-inch strips",
        "1 bunch scallions, trimmed and cut into 3-inch pieces",
        "3/4 pound dried Asian egg noodles",
        "Equipment: a large (2-burner) ridged grill pan (preferably cast-iron)",
        "Garnish: lime wedges; Asian fish sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Ginger",
        "Dinner",
        "Steak",
        "Curry",
        "Winter",
        "Grill/Barbecue",
        "Honey",
        "Noodle",
        "Soy Sauce",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Thai-Style Beef with Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/thai-style-beef-with-noodles-241478"
}
