{
    "directions": [
        "Combine orange juice, carrot, cilantro, grated fresh ginger, garlic, minced jalapeño, ground cumin and Thai red curry base in heavy medium saucepan over medium-high heat. Boil mixture until carrot is very tender and liquid is reduced by half, stirring occasionally, about 12 minutes. Puree sauce in blender or processor in batches until smooth. Strain sauce and return to same saucepan. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Stir molasses, soy sauce, curry base and ginger in large glass baking dish. Add pork tenderloin and turn to coat. Cover and refrigerate at least 1 hour and up to 4 hours.",
        "Preheat oven to 350°F. Remove pork from marinade; discard marinade. Heat oil in heavy large ovenproof skillet over medium-high heat. Add pork and cook until golden brown, about 3 minutes per side. Transfer skillet to oven and cook pork until thermometer inserted into thickest part registers 160°F, about 25 minutes. Transfer pork to platter. Tent with foil to keep warm.",
        "Bring sauce to simmer. Remove from heat. Gradually add 6 tablespoons butter, whisking just until melted. Season to taste with salt and pepper.",
        "Cut pork into 1-inch-thick slices. Serve with sauce."
    ],
    "ingredients": [
        "3 cups orange juice",
        "1 carrot, chopped",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons grated peeled fresh ginger",
        "2 large garlic cloves, sliced",
        "1 jalapeño chili, seeded, minced",
        "1 tablespoon ground cumin",
        "1 tablespoon Thai red curry base",
        "1/2 cup molasses",
        "1/2 cup reduced-sodium soy sauce",
        "1/4 cup Thai red curry base",
        "1 tablespoon grated peeled fresh ginger",
        "1 1/2 pounds pork tenderloin, trimmed",
        "1 tablespoon vegetable oil",
        "6 tablespoons (3/4 stick) chilled butter, cut into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Marinate",
        "Roast",
        "Sauté",
        "Orange",
        "Pork Tenderloin",
        "Curry"
    ],
    "title": "Thai-Spiced Pork Tenderloin with Orange Curry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/thai-spiced-pork-tenderloin-with-orange-curry-sauce-1671"
}
