{
    "directions": [
        "Process lemongrass, garlic, kaffir lime leaves, ginger, and 2 chiles in a food processor until a fine paste forms.",
        "Season beef with salt and pepper. Heat oil in a large Dutch oven over medium-high heat. Working in batches, cook beef, turning occasionally, until browned, 10–15 minutes; transfer to a plate.",
        "Cook lemongrass paste in same pot, stirring often, until lemongrass is beginning to soften, 5–8 minutes. Add star anise, cinnamon, soy sauce, fish sauce, brown sugar, beef with any juices, and 10 cups water. Bring to a boil, reduce heat, and simmer, partially covered, skimming occasionallly, until beef is tender and liquid is slightly thickened, 2 1/2–3 hours.",
        "Meanwhile, preheat oven to 350°F. Toast coconut flakes on a rimmed baking sheet, tossing occasionally, until golden around the edges, about 4 minutes; set aside.",
        "Add shallots and carrots to stew and cook, partially covered, until vegetables are soft and beef is falling apart, 35–45 minutes. Mix in scallions (they should wilt slightly).",
        "Meanwhile, cook noodles according to package directions.",
        "Divide noodles among bowls and ladle stew over; top with toasted coconut and more scallions. Serve with lime wedges.",
        "DO AHEAD: Stew (without noodles) can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "4 lemongrass stalks, trimmed, tough outer layers removed, thinly sliced",
        "4 garlic cloves, chopped",
        "4 kaffir lime leaves, chopped",
        "2 tablespoons chopped peeled ginger",
        "2 red Thai chiles, with seeds, sliced",
        "3 pounds boneless beef chuck, cut into 2\" pieces",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "2 whole star anise pods",
        "1 cinnamon stick",
        "1/2 cup reduced-sodium soy sauce",
        "1 tablespoon fish sauce (such as nam pla or nuoc nam)",
        "1/4 cup (packed) light brown sugar",
        "1 cup unsweetened coconut flakes",
        "4 medium shallots, quartered",
        "1 pound carrots, peeled, cut into 2\" lengths, halved if large",
        "4 scallions, cut into 1\" lengths, plus more for serving",
        "8 ounces wide rice noodles",
        "Lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Dinner",
        "Lunch",
        "Meat",
        "Fall",
        "Winter",
        "Noodle",
        "Lemongrass",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Thai Beef Stew With Lemongrass and Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/thai-beef-stew-with-lemongrass-and-noodles-51214670"
}
