{
    "directions": [
        "For the sauce: Whisk the granulated sugar, vinegar, lime juice, fish sauce, garlic, and red pepper flakes together in a bowl; set aside for serving.",
        "For the pork: Combine the Melt(R), fish sauce, soy sauce, brown sugar, garlic, and pepper in a bowl. Combine the marinade and pork in a large zipper-lock bag. Seal the bag tightly, toss to coat the pork, and let the pork marinate in the refrigerator for up to 1 hour.",
        "Weave 2 pieces of pork onto each skewer.",
        "For a Charcoal grill: Open the bottom grill vents completely. Light a large chimney starter filled with charcoal briquettes (100 briquettes; 6 quarts). When the coals are hot, pour them in an even layer over the grill.  Set the cooking grate in place, cover, and heat the grill until hot, about 5 minutes.",
        "For a gas grill: Turn all the burners to high, cover, and heat the grill until hot, about 15 minutes. (Adjust the burners as needed to maintain a hot fire.)",
        "Clean and oil the cooking grate. Place skewers on the grill and cook until the meat is cooked through and lightly charred around the edges, 7 to 10 minutes, flipping the skewers halfway through.",
        "Transfer the skewers to a platter and let rest for 5 minutes. Remove the meat from the skewers, sprinkle the cilantro leaves over the top, and serve, passing the sauce separately."
    ],
    "ingredients": [
        "Sauce:",
        "1/3 cup granulated sugar",
        "1/4 cup white vinegar",
        "1/4 cup fresh lime juice",
        "2 tablespoons fish sauce",
        "2 garlic cloves, minced",
        "1 teaspoon red pepper flakes",
        "Pork:",
        "2 tablespoons Melt® Organic Buttery Spread",
        "2 tablespoons fish sauce",
        "2 tablespoons low-sodium soy sauce",
        "1 tablespoon brown sugar",
        "3 garlic cloves, minced",
        "1/2 teaspoon pepper",
        "2 (1 pound) pork tenderloins, trimmed all visible fat, and cut into 3-by-1/4-inch strips",
        "1/2 cup lightly packed fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thai-Style Grilled Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/219871/thai-style-grilled-pork-tenderloin/"
}
