{
    "directions": [
        "Place noodles in a bowl; add enough warm water to cover and let sit until soft, about 15 minutes. Drain. Combine broth, pepper, garlic, ginger, lemon zest, lime zest, lemon juice and 3 tablespoon fish sauce in a medium saucepan. Season with salt. Bring to a simmer, add noodles and cook 3 minutes more. Using tongs, transfer noodles to a bowl and cover with foil to keep warm. Add mushrooms to broth; season with salt, if desired; simmer 3 minutes more. Add chicken and coconut milk and simmer, stirring, until chicken is just cooked, about 3 minutes. Stir in spinach until it begins to wilt, about 1 minute. Add chopped cilantro and season with remaining 1 tablespoon fish sauce. Using tongs, divide noodles among 4 bowls. Ladle soup into bowls and garnish with sprigs of cilantro and slices of pepper."
    ],
    "ingredients": [
        "4 ounces cellophane noodles",
        "6 cups low-sodium chicken broth",
        "1–2 red Thai (or jalapeño) peppers, seeded and finely chopped (plus slices for garnish)",
        "1 additional red Thai (or jalapeño) pepper slices for garnish",
        "3 cloves garlic, chopped",
        "1 tablespoon grated ginger",
        "2 teaspoons grated lemon zest",
        "1 teaspoon grated lime zest",
        "1/4 cup fresh lemon (or lime) juice",
        "4 tablespoons Thai fish sauce, divided",
        "1/2 pound shiitake mushrooms, sliced (3 cups)",
        "2 boneless, skinless chicken breasts (about 5 ounces each), cut into 2 1/2-inch-long by 1/4-inch-wide strips",
        "1 cup light coconut milk",
        "2 cups baby spinach",
        "2 tablespoon chopped cilantro (plus sprigs for garnish)",
        "1 cilantro sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Citrus",
        "Ginger",
        "Mushroom",
        "Lunch",
        "Coconut",
        "Spinach",
        "Hot Pepper",
        "Healthy",
        "Self",
        "Quick and Healthy"
    ],
    "title": "Thai Chicken-Coconut Soup",
    "url": "http://www.epicurious.com/recipes/food/views/thai-chicken-coconut-soup-241463"
}
