{
    "directions": [
        "Blend basil, nuts and vinegar in processor until nuts are finely ground. With machine running, gradually add oil and blend well. Season to taste with salt and pepper. Transfer to small bowl. (Dressing can be made 1 day ahead. Cover and refrigerate. Bring to room temperature before using.)",
        "Whisk coconut milk and curry paste in medium saucepan over medium-low heat until blended; bring to simmer. Add shrimp and simmer until shrimp are almost opaque in center, about 3 minutes. Remove from heat. Refrigerate shrimp in curry liquid, uncovered, until very cold, about 2 hours.",
        "Place rice sticks in medium bowl. Cover with very hot water. Let stand until tender, about 25 minutes. Drain rice sticks. (If using pasta, cook in pot of boiling salted water until just tender but still firm to bite. Drain well; rinse pasta with cold water and drain again.) Using knife or poultry shears, cut rice sticks or pasta into shorter (about 6-inch) lengths. Place noodles in medium bowl and toss with enough dressing to coat.",
        "Combine cabbage, bok choy, green onions and chopped cilantro in large bowl. Toss with enough dressing to coat. Season with salt and pepper. Divide greens among plates. Top with noodles. Drain shrimp; place atop noodles, dividing equally. Garnish with cilantro sprigs. Pass any remaining dressing separately."
    ],
    "ingredients": [
        "3/4 cup (packed) coarsely chopped fresh basil",
        "1/3 cup macadamia nuts, toasted",
        "4 1/2 tablespoons balsamic vinegar",
        "1/2 cup plus 1 tablespoon olive oil (preferably extra-virgin)",
        "1 cup canned unsweetened coconut milk",
        "1 tablespoon Thai red curry paste",
        "24 uncooked large shrimp (about 1 pound), peeled, deveined",
        "2 ounces dried thin Chinese rice sticks (maifun) or angel hair pasta",
        "4 cups thinly sliced Napa cabbage",
        "4 cups thinly sliced bok choy leaves",
        "1/2 cup chopped green onions",
        "1/2 cup chopped fresh cilantro",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Pasta",
        "Coconut",
        "Basil",
        "Macadamia Nut",
        "Shrimp",
        "Curry",
        "Chill",
        "Cabbage",
        "Cilantro",
        "Simmer",
        "Boil"
    ],
    "title": "Thai Spices Shrimp Salad with Asian Greens and Pesto Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/thai-spices-shrimp-salad-with-asian-greens-and-pesto-dressing-4268"
}
