{
    "directions": [
        "Combine pork, fish sauce, garlic, ginger, lemon grass paste, cilantro, and peanut oil in a mixing bowl. Mix well. Refrigerate at least 1 hour to blend flavors.",
        "Shape pork mixture into 1 1/4-inch meatballs. (Mixture should yield approximately 34 to 36 meatballs.)",
        "Heat 1 tablespoon peanut oil in a large skillet over medium heat. Cook meatballs in batches, giving the pan a shake occasionally. Turn meatballs until brown on all sides and cooked through, approximately 14 to 16 minutes. Remove meatballs to a bowl.",
        "In a large saucepan, heat remaining 1 tablespoon oil over medium heat. Cook onion until translucent, 5 to 6 minutes. Add tomatoes and bring to a simmer. Stir in curry paste. Cover and simmer over low heat until sauce begins to reduce, 20 to 25 minutes. Remove from heat and cool slightly.",
        "Process sauce with an immersion blender until smooth. Stir in coconut milk and adjust taste by adding additional salt if needed. Return meatballs to sauce and simmer for an additional 5 minutes, or until warmed through.",
        "Garnish with cilantro if desired."
    ],
    "ingredients": [
        "Meatballs:",
        "1 1/2 pounds lean ground pork",
        "2 teaspoons fish sauce",
        "1 1/2 teaspoons minced garlic",
        "1 1/2 teaspoons minced fresh ginger root",
        "3/4 teaspoon lemon grass puree",
        "3 tablespoons minced fresh cilantro",
        "1 tablespoon peanut oil",
        "Sauce:",
        "2 tablespoons peanut oil, divided",
        "1/2 cup minced onion",
        "1 (28 ounce) can Hunt's® Diced Tomatoes",
        "2 tablespoons red curry paste",
        "3/4 cup canned coconut milk",
        "Salt to taste",
        "Fresh chopped cilantro (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thai Meatballs in a Tomato Coconut Curry Sauce",
    "url": "http://allrecipes.com/recipe/256310/thai-meatballs-in-a-tomato-coconut-cu/"
}
