{
    "directions": [
        "Combine 1 cup peanut sauce, ginger, garlic, and 1 teaspoon soy sauce in a bowl. Add the chicken and mix until the chicken is coated. Place in refrigerator to marinate for 30 minutes.",
        "Heat 1 teaspoon peanut oil in a wok or skillet over medium heat. Cook the snow peas, bean sprouts and green onion in the oil until heated but still crisp, 3 to 4 minutes. Transfer to a large bowl. Mix in the watercress and cilantro. Use a vegetable peeler to have long slices of carrot into the watercress mixture. Drizzle 1 teaspoon soy sauce into the watercress mixture; toss to coat.",
        "Heat 1 teaspoon of oil to the wok or skillet. Cook the marinated chicken until no longer pink inside, about 10 minutes.",
        "Fill a large bowl with hot water. Dip wrappers one at a time into the water for about 2 seconds each. As wrappers are removed from the water, fill each with 2 large spoonfuls of the chicken and a small handful of the watercress mixture. Fold in two opposite ends of the wrapper to meet the filling. Then fold the bottom of the wrapper over the top of the filling and roll. Serve with 1/2 cup peanut sauce for dipping."
    ],
    "ingredients": [
        "1 cup peanut sauce",
        "1 (1 1/2 inch) piece fresh ginger root, minced",
        "2 cloves garlic, minced",
        "1 teaspoon soy sauce",
        "1 pound skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "1 teaspoon peanut oil",
        "6 ounces fresh snow pea pods",
        "12 ounces bean sprouts",
        "4 green onion, chopped",
        "1 pound watercress, chopped",
        "1/4 cup chopped fresh cilantro",
        "2 large carrots, peeled",
        "1 teaspoon peanut oil",
        "1 teaspoon soy sauce",
        "12 spring roll wrappers",
        "1/2 cup peanut sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thai Chicken Spring Rolls",
    "url": "http://allrecipes.com/recipe/149687/thai-chicken-spring-rolls/"
}
