{
    "directions": [
        "Place a rack in upper third of oven; preheat to 500°F. On a lightly floured surface, roll dough to a 12\" round (if dough springs back, cover with plastic and let rest 5 minutes, then roll again, resting as needed).",
        "Heat 2 Tbsp. oil in a cast-iron skillet over medium-high until very hot. Carefully transfer dough to skillet. Brush top of dough with remaining 1 Tbsp. oil. Cook, shaking pan occasionally and turning pan to avoid hot spots, until bottom of dough is golden brown and crispy, 3–4 minutes.",
        "Meanwhile, toss turkey with 1/4 cup cranberry sauce, if using, in a medium bowl.",
        "Remove skillet from heat. Using a large flat spatula, flip dough. Spread potatoes over dough, leaving a 3/4\" border on all sides; season with salt and pepper. Top with 1 cup cheese, then turkey mixture, vegetables, and onion. Top with remaining 1 cup cheese and red pepper flakes, if using. Bake pizza until dough is golden brown and cheese is melted, 6–8 minutes.",
        "Transfer pizza to a cutting board and cut into wedges. Serve with additional cranberry sauce alongside, if using."
    ],
    "ingredients": [
        "All-purpose flour (for surface)",
        "8 ounces prepared pizza dough, room temperature",
        "3 tablespoons olive oil, divided",
        "1 1/2 cups shredded cooked turkey or rotisserie chicken",
        "1/4 cup cranberry sauce, plus more for serving (optional)",
        "1 cup mashed white  or sweet potatoes",
        "Kosher salt, freshly ground black pepper",
        "2 cups shredded mozzarella, cheddar, and/or Fontina cheese (about 6 ounces), divided",
        "1 cup cooked vegetables, such as green beans, Brussels sprouts, sautéed greens, carrots, squash, or mushrooms",
        "1/2 cup sliced red onion",
        "Pinch crushed red pepper flakes (optional)",
        "A 12-inch cast-iron skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Thanksgiving",
        "leftovers",
        "turkey",
        "Pizza",
        "Potato",
        "Sweet Potato/Yam",
        "Cranberry Sauce",
        "Mozzarella"
    ],
    "title": "Thanksgiving Skillet Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/thanksgiving-skillet-pizza"
}
