{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place the ground beef into a skillet, and cook and stir the meat until browned and crumbly, breaking it up into chunks as it cooks, about 10 minutes. Drain grease. Place the ground beef into a large mixing bowl.",
        "Tear the bread into rough chunks, and place into a bowl; soak bread in water until moistened, and squeeze the water out of the bread. Crumble the wet bread into the bowl with the ground beef. Mix in the onion, celery, mushrooms, 4 cloves of garlic, flat-leaf parsley, Parmesan cheese, and egg until thoroughly combined. Season with salt and black pepper.",
        "Rinse the turkey, and pat dry with paper towels. Lightly stuff the turkey with the ground beef mixture, and place into a roasting pan with a lid. Rub the turkey with olive oil, squeeze lemons over the turkey, and sprinkle 2 more cloves of garlic, the garlic powder, and more salt and black pepper over the bird.",
        "Roast the turkey uncovered in the preheated oven until the skin is browned, about 45 minutes. Reduce heat to 350 degrees C (175 degrees C), and cover the turkey with the lid. Continue roasting until the juices run clear and an instant-read meat thermometer inserted into the thickest part of a thigh reads 180 degrees F (80 degrees C), about 5 more hours. Baste occasionally. If the bottom of the roasting pan looks dry, pour in water."
    ],
    "ingredients": [
        "1 pound ground beef",
        "1/2 (1 pound) loaf day-old Italian bread",
        "1 large onion, chopped",
        "2 large stalks celery with leaves, chopped",
        "1/2 cup chopped fresh mushrooms (optional)",
        "4 cloves garlic, chopped, or more to taste",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1/2 cup freshly shredded Parmesan cheese",
        "1 large egg",
        "salt and ground black pepper to taste",
        "1 (15 pound) whole turkey, neck and giblets removed",
        "2 tablespoons olive oil",
        "2 lemons, cut in half",
        "2 cloves garlic, chopped, or to taste",
        "2 teaspoons garlic powder, or to taste",
        "1 cup water (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thanksgiving Turkey with Italian Meat Stuffing",
    "url": "http://allrecipes.com/recipe/219613/thanksgiving-turkey-with-italian-meat/"
}
