{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a large pot of salted water to a boil. Cook shell pasta in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Whisk flour into 3 tablespoons of turkey broth in a bowl until the mixture is smooth and free of lumps; transfer to a saucepan. Whisk turkey gravy, sherry, and 1/2 cup turkey broth into the flour mixture and bring to a boil; reduce heat to medium and cook until thick, about 5 minutes, whisking constantly. Remove from heat.",
        "Process turkey and stuffing in a food processor until finely ground, about 1 minute. Add ricotta cheese, Swiss cheese, Parmesan cheese, and 1/2 cup mozzarella cheese to the food processor and blend until filling is thoroughly combined, about 1 more minute. Add egg and pulse 1 or 2 times to combine. Transfer turkey and cheese filling to a bowl and gently stir in 1/2 cup more mozzarella cheese and chopped parsley.",
        "Pour about 1/4 of the turkey gravy mixture into the bottom of a 9x13-inch baking dish and swirl to coat the bottom. Stuff shells with about 1 1/2 tablespoons of the turkey filling and arrange in the baking dish. Pour remaining turkey gravy over the shells and sprinkle remaining 1/2 cup mozzarella cheese over the gravy. Cover the baking dish tightly with aluminum foil.",
        "Bake in the preheated oven until the filling is set, the casserole is bubbling, and the cheese topping has melted, about 45 minutes."
    ],
    "ingredients": [
        "18 jumbo pasta shells",
        "1 1/2 tablespoons all-purpose flour",
        "3 tablespoons turkey broth",
        "2 cups turkey gravy",
        "1/4 cup dry sherry",
        "1/2 cup turkey broth",
        "1 1/2 cups shredded cooked turkey",
        "1 cup prepared stuffing",
        "1 cup ricotta cheese",
        "1/2 cup finely shredded Swiss cheese",
        "1/4 cup grated Parmesan cheese",
        "1 1/2 cups shredded mozzarella cheese, divided",
        "1 extra large egg, beaten",
        "1 tablespoon chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thanksgiving Leftover Stuffed Shells",
    "url": "http://allrecipes.com/recipe/230063/thanksgiving-leftover-stuffed-shells/"
}
