{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C). Grease a 9x9 inch square baking dish.",
        "Mix the ground turkey with the eggs, onion, rolled oats, green beans, cranberries, rosemary, and bay leaf in a large bowl. Use your hands to thoroughly blend the ingredients. Season to taste with salt and pepper. Spread the ground turkey mixture over the bottom of the prepared dish. Top with a layer of pancetta.",
        "Bake the meatloaf in preheated oven for 45 minutes to 1 hour. Check for doneness when juices run clear, and an internal thermometer inserted into the meatloaf reaches 160 degrees F (70 degrees C).",
        "Meanwhile, to make the gravy, melt the butter in a pan over medium heat. Stir in the flour, and cook for 1 to 2 minutes until the mixture becomes paste-like and light brown. Stir in the garlic, cinnamon, and nutmeg. Gradually whisk in the milk and chicken broth, bringing the mixture to a boil. Lower the heat to medium, and continue cooking and whisking until desired thickness is reached. Season to taste with salt and pepper. Serve spooned over sliced meatloaf."
    ],
    "ingredients": [
        "2 pounds ground turkey",
        "2 eggs, beaten slightly",
        "1 onion, coarsely chopped",
        "3/4 cup regular rolled oats",
        "1/2 cup fresh green beans, chopped",
        "1/2 cup fresh cranberries, chopped",
        "1 teaspoon dried rosemary",
        "1 teaspoon bay leaf, crumbled",
        "salt and ground black pepper to taste",
        "1/4 pound thinly sliced pancetta",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 clove garlic, minced",
        "1 teaspoon ground cinnamon",
        "1 teaspoon freshly grated nutmeg",
        "1 cup milk",
        "1/2 cup chicken broth",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thanksgiving-Style Turkey Meatloaf",
    "url": "http://allrecipes.com/recipe/130486/thanksgiving-style-turkey-meatloaf/"
}
