{
    "directions": [
        "Cut the top 1/2 inch from each onion, peel the onions, and with a melon-ball cutter scoop out the centers, reserving the onion pieces, leaving 2 layers of onion or 1/3-inch-thick shells, and leaving the bottoms slightly thicker. Transfer the reserved onion pieces to a 13- by 9-inch glass baking dish, drizzle the broth over them, and arrange the onion shells, inverted on top. Cover the dish tightly with foil and bake the onions in the middle of preheated 425°F. oven for 45 to 50 minutes, or until the shells are just tender. Remove and reserve the shells, into the onion pieces stir the cream, the sugar, and salt and pepper to taste, and bake the mixture, uncovered, in the 425°F. oven, stirring occasionally, for 25 minutes.",
        "While the creamed onions are baking, in each reserved onion shell layer 1/4 cup of the stuffing, 1 1/2 tablespoons of the cranberry sauce, and another 1/4 cup of the turkey and holding each shell in one hand pack the layers lightly. Arrange the stuffed onions on top of the baked creamed onions and pour 2 tablespoons of the gravy into each stuffed onion. Top each stuffed onion with 1/3 cup of the mashed potatoes, mounding them and scoring them with a fork, and bake the onions in the 425°F. oven, stirring the creamed onions occasionally, for 35 to 40 minutes, or until the potatoes are golden."
    ],
    "ingredients": [
        "4 large onions (about 3/4 pound each)",
        "1/4 cup chicken broth",
        "1/4 cup heavy cream",
        "1/2 teaspoon sugar",
        "2 cups chopped cooked turkey",
        "1 cup cooked turkey stuffing",
        "6 tablespoons cranberry sauce",
        "1/2 cup turkey gravy or chicken broth",
        "1 1/3 cups mashed potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Potato",
        "turkey",
        "Bake",
        "Cranberry",
        "Fall",
        "Gourmet"
    ],
    "title": "Thanksgiving Stuffed Onions",
    "url": "http://www.epicurious.com/recipes/food/views/thanksgiving-stuffed-onions-13376"
}
