{
    "directions": [
        "Place sixteen 4-ounce ramekins on a rimmed baking sheet.",
        "Split vanilla bean lengthwise with the tip of a sharp knife. Holding the pod open, scrape seeds from each half using the flat side of your knife.",
        "Fill a large pot halfway with water and bring to a simmer over medium heat.",
        "Combine vanilla pods, scraped beans, heavy cream, and 1 cup sugar in a large bowl that will fit snugly into the pot; whisk thoroughly to mix. Place bowl over simmering water; whisk until cream mixture is just warm and sugar is dissolved, about 5 minutes.",
        "Remove bowl from heat and strain cream mixture using a fine-mesh strainer. Pour out hot water.",
        "Sprinkle gelatin over 1/2 cup water in a small bowl and stir quickly with a large toothpick until granules are separated. Pour gelatin into cream mixture and whisk thoroughly. Let sit until slightly cool, about 20 minutes.",
        "Whisk buttermilk thoroughly into cream mixture; pour into ramekins. Cover with plastic wrap and chill until set, at least 6 hours and preferably overnight.",
        "Place blueberries in a large saucepan over medium heat; cook until slightly toasted and starting to release their juices, about 5 minutes. Stir in orange juice and 1 cup sugar. Bring to a simmer and cook until mixture is reduced by half, about 10 minutes. Remove from heat and let cool until thickened and syrupy, about 30 minutes.",
        "Run a thin knife around the edges of each ramekin. Invert panna cotta onto serving plates. Serve topped with blueberry topping."
    ],
    "ingredients": [
        "2 vanilla beans",
        "2 1/2 cups heavy whipping cream",
        "1 cup white sugar",
        "1 tablespoon unflavored gelatin",
        "1/2 cup water",
        "1 quart buttermilk",
        "Blueberry Topping:",
        "8 ounces fresh blueberries",
        "1/2 cup orange juice",
        "1 cup white sugar, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Best Panna Cotta You Will Ever Have",
    "url": "http://allrecipes.com/recipe/246288/the-best-panna-cotta-you-will-ever-ha/"
}
