{
    "directions": [
        "Place cucumber, radishes, and scallions in a colander set inside a bowl of ice water. Press down on vegetables to submerge. Let soak, stirring occasionally, until very firm and crunchy, at least 15 minutes and up to 1 hour. Drain and pat dry.",
        "Meanwhile, cook beans in a large pot of boiling generously salted water just until their color intensifies and they are barely softened, about 1 minute. Using a slotted spoon, immediately transfer to a large bowl of salted ice water (use about 1 Tbsp. salt for every 2 quarts water).",
        "Return water in pot to a boil and repeat cooking process with sugar snap peas; add to bowl of ice water with beans. Let vegetables cool; drain and pat dry. Trim beans and remove strings from sugar snap peas. Slice into large pieces on a steep diagonal.",
        "Whisk lime juice, oil, soy sauce, sesame seeds, and sugar in a large bowl; season dressing with salt and pepper. Add beans and peas and toss to coat. Taste and adjust seasoning if needed. Add cucumber, radishes, and scallions and toss to combine. Transfer to a platter.",
        "Beans and peas can be blanched 2 days ahead. Cover and chill.\nDressing can be made 2 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1/2 English hothouse cucumber, very thinly sliced",
        "4 small radishes, trimmed, very thinly sliced",
        "2 scallions, very thinly sliced",
        "1 pound mixed snap beans (such as green, wax, and/or Romano)",
        "Kosher salt",
        "4 ounces sugar snap peas",
        "3 tablespoons fresh lime juice",
        "3 tablespoons olive oil",
        "1 tablespoon soy sauce",
        "2 teaspoons toasted sesame seeds",
        "1/4 teaspoon sugar",
        "Kosher salt, freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Summer",
        "Cucumber",
        "Radish",
        "Green Onion/Scallion",
        "Green Bean",
        "Lime Juice",
        "Sesame",
        "Soy Sauce",
        "Dinner",
        "Brunch"
    ],
    "title": "The Crunchiest Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/the-crunchiest-vegetable-salad"
}
