{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned but not totally crisp, about 8 minutes. Drain on paper towels. Retain 1 tablespoon bacon drippings.",
        "Mix ground beef, bread crumbs, red pepper flakes, black pepper, and retained bacon drippings in a bowl until thoroughly combined; divide meat mixture into 4 equal portions. Form each portion into a large patty, making them as thin as possible. Sprinkle shredded Colby-Jack cheese onto 2 of the patties, leaving an edge about 3/4 inch wide uncovered. Place second patty onto the cheese and press the edges of the patties together to create 2 cheese-stuffed burgers. Place stuffed patties into freezer to chill slightly, about 10 minutes.",
        "Preheat an outdoor grill for high heat.",
        "Spray the grill grate with cooking spray and place burgers onto grill; turn heat to low, place lid over grill, and cook until outsides of burgers are lightly charred and cheese has melted, about 10 minutes per side. Maintain grill temperature at about 300 degrees F (150 degrees C). Use a spray bottle of water to control flames; flames should just lightly contact the bottoms of the burgers to create a slight char. After the first flip, place 3 partially-cooked bacon slices onto each burger.",
        "About 2 minutes before burgers are done, place a Colby-Jack cheese slice onto each burger; top with tomato and avocado slices and transfer burgers to plate to rest for 1 or 2 minutes. Serve burgers on hamburger buns."
    ],
    "ingredients": [
        "6 slices bacon",
        "1 tablespoon bacon drippings",
        "1 pound ground beef",
        "1 cup dry bread crumbs",
        "1 tablespoon red pepper flakes",
        "1 pinch freshly ground black pepper",
        "1/2 cup shredded Colby-Jack cheese, or more to taste",
        "cooking spray",
        "2 slices Colby-Jack cheese (optional)",
        "2 thin tomato slices",
        "2 slices avocado",
        "2 hamburger buns, split"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Labor Day Burger",
    "url": "http://allrecipes.com/recipe/223523/the-labor-day-burger/"
}
