{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Butter 8 small ovenproof ramekins.",
        "Cut fish into 8 pieces, and arrange in a shallow 9x13 inch baking dish. Pour wine over fish, and sprinkle with 1/8 teaspoon ground white pepper.",
        "Bake in preheated oven for 20 minutes, or until fish flakes easily; keep oven on for final step.",
        "Melt 2 tablespoons butter in a large saucepan over medium heat. Saute mushrooms, onion and red bell pepper until tender; remove from heat and set aside.",
        "Melt remaining 2 tablespoons butter in the saucepan over low heat. Mix in flour, and cook for 1 minute, stirring constantly until smooth. Gradually add milk and increase heat to medium; stir constantly until mixture is thick and bubbly.",
        "Stir in mushroom mixture, salt and remaining 1/8 teaspoon ground white pepper to saucepan, stirring until well combined. Remove sauce from heat and set aside.",
        "Remove fish from wine carefully with a slotted spoon, and place 1 piece into each ramekin. Sprinkle crabmeat evenly on tops, followed by 2 tablespoons sauce and 1 1/2 teaspoons cheese in each dish.",
        "Bake in preheated oven for 5 minutes or until cheese is hot and bubbly; serve immediately."
    ],
    "ingredients": [
        "1 pound halibut",
        "1/2 cup white wine",
        "1/8 teaspoon ground white pepper",
        "2 tablespoons butter",
        "1/2 cup chopped button mushrooms",
        "1/4 cup minced onion",
        "1/4 cup minced red bell pepper",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup evaporated milk",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground white pepper",
        "1/2 pound crabmeat, flaked",
        "1/4 cup shredded Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Way to a Man's Heart",
    "url": "http://allrecipes.com/recipe/17170/the-way-to-a-mans-heart/"
}
