{
    "directions": [
        "To make the marinade, place the beef in a large glass or plastic container. Add 8 sprigs of thyme, carrots, garlic, red onions, orange peel, cloves, peppercorns, bay leaves, and the wine. Mix well to coat, then cover and refrigerate for 4 hours.",
        "Remove beef from the marinade and blot dry on paper towels. Heat the oil and butter and the remaining 4 sprigs thyme in a heavy-bottomed saucepan on a high heat. When the oil begins to smoke, remove the thyme. Add the beef and brown evenly on all sides. Season with salt and freshly ground black pepper. Strain the marinade into the beef and stir with a wooden spoon, scraping up the flavorful bits in the bottom of the pot. Add bouquet garni and beef stock. Bring to a simmer and cook, uncovered, until the liquid starts to thicken, about 15 to 20 minutes. Cover and cook on low heat for 2 hours.",
        "After about 2 hours add the baby carrots, garden peas, and mushrooms, along with a pinch of sugar to balance out the acid from the red wine. Turn the heat up slightly and simmer, uncovered, for 30 minutes more, until the vegetables and meat are tender. Season with salt and pepper.",
        "Garnish with chopped parsley and chives. Squeeze some of the roasted garlic onto the Croutons, drizzle with extra-virgin olive oil and serve with the stew.",
        "Preheat oven to 350 degrees F.",
        "Put garlic on a sheet of aluminum foil. Drizzle with olive oil, and season with salt and freshly ground black pepper. Add a sprig of thyme and fold the foil around the garlic. Cook for 30 to 40 minutes or until garlic is tender and golden brown.",
        "Heat about 1/4-inch of the olive oil in a frying pan. When the oil is hot, add the bread in batches and fry until golden on both sides, about 1 minute per side. Remove from pan and dry on paper towels."
    ],
    "ingredients": [
        "2 to 3 pounds beef shoulder, cut into 2-inch pieces",
        "8 fresh thyme sprigs, plus 4 sprigs",
        "2 carrots, cut into 1/4-inch slices",
        "6 garlic cloves, smashed",
        "2 cups blanched and peeled red pearl onions",
        "1 orange, peel cut in large strips",
        "Cloves, a few",
        "1 teaspoon whole black peppercorns",
        "2 bay leaves",
        "1 bottle good quality dry red wine (recommended: Burgundy)",
        "1/4 cup extra-virgin olive oil, for frying, plus more to drizzle",
        "3 tablespoons butter",
        "Sea salt and freshly ground black pepper",
        "Bouquet Garni",
        "2 1/2 cups beef stock",
        "1/2 pound baby carrots",
        "1/2 pound garden peas",
        "1 pound white mushrooms, cut in half",
        "Pinch sugar",
        "Fresh flat-leaf parsley, chopped, as garnish",
        "Chives, finely chopped, as garnish",
        "Garlic Puree, recipe follows",
        "Croutons, recipe follows",
        "Serving suggestion: buttery mashed potatoes with chives and warm croutons with garlic puree",
        "2 heads garlic, cut in half horizontally",
        "2 tablespoons olive oil",
        "1 sprig thyme",
        "Salt and pepper",
        "Olive oil, for frying",
        "6 slices bread"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Stew",
        "Beef",
        "Meat",
        "Stew Recipes",
        "Fruit",
        "Orange Recipes",
        "Mushroom",
        "Vegetable",
        "Carrot Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Main Dish Recipes"
    ],
    "title": "The Ultimate Beef Stew",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-beef-stew-recipe"
}
