{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).",
        "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain on a paper towel-lined plate and set aside. Bring a large pot of lightly salted water to a boil over high heat with 2 tablespoons of olive oil. Add the rigatoni pasta, and cook until al dente, 8 to 10 minutes; drain.",
        "Meanwhile, melt the butter in a large skillet over medium heat. Add the sirloin strips, and cook until no longer pink, about 6 minutes. Remove the sirloin to a casserole dish, then stir the mushrooms into the hot skillet. Cook and stir for 2 minutes, then season with the mustard, ginger, salt, and pepper, and cook 3 minutes more. Pour in the red wine and Marsala wine, and bring to a simmer over medium-high heat. Add the cream and half of the crumbled feta cheese, reduce heat to medium-low, and simmer 5 minutes, stirring occasionally. The feta helps thicken the cream. The cream sauce is not a gravy, so it will not thicken like gravy. Once ready, pour the mushroom mixture over the sirloin strips, and sprinkle with the remaining feta cheese.",
        "Bake in the preheated oven for 10 minutes until hot and bubbly. Crumble the bacon overtop, and serve over the rigatoni pasta."
    ],
    "ingredients": [
        "4 slices bacon",
        "2 tablespoons olive oil",
        "1 (16 ounce) package rigatoni pasta",
        "1/2 cup butter",
        "1 pound beef top sirloin, thinly sliced",
        "1 (6 ounce) package sliced fresh mushrooms",
        "1 teaspoon prepared yellow mustard",
        "1/4 teaspoon minced fresh ginger root",
        "1 pinch salt and pepper to taste",
        "2 tablespoons red wine",
        "1 tablespoon Marsala wine",
        "1 cup crumbled feta cheese",
        "2/3 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Mushroom Steak Stuff",
    "url": "http://allrecipes.com/recipe/168300/the-mushroom-steak-stuff/"
}
