{
    "directions": [
        "Preheat a large cast-iron skillet to medium hot. Take a few paper towels and fold them several times to make a thick square. Blot a small amount of oil on the paper towel and carefully and quickly wipe the hot skillet to make a nonstick surface.",
        "Season the ground meat in a bowl with salt and pepper. Give it about 3 turns in the bowl with your hands or a big spoon and it's done. Shape into 4 patties. When the skillet is hot, put the burgers on the skillet and cook 4 minutes on the first side and 5 for the second side for rare; 7 minutes per side for medium, adding the cheese during the final minute or 2 to melt. Remove the burgers to a plate. Rub the skillet with the folded paper towel again to clean it. Then toast the buns cut side down for about 1 minute, just to mark them. Serve the hamburgers in the buns with the accompaniments below.",
        "Saute 1 pound thickly sliced mushrooms in 1/4 cup olive oil with 2 sliced garlic cloves and 1 tablespoon fresh thyme leaves over super-high heat until nicely browned, 8 to 10 minutes. Stir in a couple of drops fresh lemon juice to brighten the flavor.",
        "Heat 2 tablespoons unsalted butter with 2 tablespoons olive oil in a large pan over medium heat. Add 2 onions, cut into 1/2-inch-thick slices, sprinkle with salt and pepper and cook slowly until well caramelized, 15 to 20 minutes.",
        "Thickly slice 2 pounds red and yellow beefsteak tomatoes, drizzle with olive oil, and sprinkle with sea salt and 1/2 bunch chopped fresh chives.;",
        "Lay out 1/2 pound sliced bacon on a baking sheet, strip leaves from 1 sprig rosemary and throw them on top with lots of cracked black pepper and roast at 400 degrees F until the bacon is crisp, about 10 minutes.",
        "Stir together 1 cup mayonnaise, 1 tablespoon prepared horseradish, 1/4 cup freshly minced herbs such as parsley, basil, chives or scallion, 2 tablespoons olive oil, a little squeeze of lemon juice, and salt and pepper."
    ],
    "ingredients": [
        "2 pounds brisket, ground",
        "Kosher salt and freshly ground black pepper",
        "4 thin slices Swiss cheese",
        "4 hamburger buns, split"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Beef",
        "Burger",
        "Meat",
        "Skillet Recipes",
        "American",
        "Holiday",
        "Memorial Day Recipes",
        "Cheese",
        "Swiss Cheese Recipes",
        "Tomato",
        "Vegetable",
        "Bacon Recipes",
        "Onion Recipes",
        "Mushroom",
        "Father's Day Recipes",
        "4th of July",
        "Outdoor Party",
        "Recipes for Parties",
        "Sauteing Recipes",
        "Caramelizing"
    ],
    "title": "The Burger Bar",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/the-burger-bar-recipe"
}
