{
    "directions": [
        "Rub the spice mix all over the chicken and marinate chicken for 1 hour in the refrigerator.",
        "Heat oil in a paella pan over medium-high heat. Saute the chorizo until browned, remove and reserve. Add chicken skin-side down and brown on all sides, turning with tongs. Add salt and freshly ground pepper. Remove from pan and reserve.",
        "In the same pan, make a sofrito by sauteing the onions, garlic, and parsley. Cook for 2 or 3 minutes on a medium heat. Then, add tomatoes and cook until the mixture caramelizes a bit and the flavors meld. Fold in the rice and stir-fry to coat the grains. Pour in water and simmer for 10 minutes, gently moving the pan around so the rice cooks evenly and absorbs the liquid. Add chicken, chorizo, and saffron. Add the clams and shrimp, tucking them into the rice. The shrimp will take about 8 minutes to cook. Give the paella a good shake and let it simmer, without stirring, until the rice is al dente, for about 15 minutes. During the last 5 minutes of cooking, when the rice is filling the pan, add the lobster tails. When the paella is cooked and the rice looks fluffy and moist, turn the heat up for 40 seconds until you can smell the rice toast at the bottom, then it's perfect.",
        "Remove from heat and rest for 5 minutes. Garnish with peas, parsley and lemon wedges.",
        "Spice Mix for chicken:",
        "Combine ingredients in a small bowl. Rub the spice mixture all over the chicken; marinate for 1 hour, covered"
    ],
    "ingredients": [
        "Spice Mix for chicken, recipe follows",
        "1 (3-pound) frying chicken, cut into 10 pieces",
        "1/4 cup extra-virgin olive oil",
        "2 Spanish chorizo sausages, thickly sliced",
        "Kosher salt and freshly ground pepper",
        "1 Spanish onion, diced",
        "4 garlic cloves, crushed",
        "Bunch flat-leaf parsley leaves, chopped, reserve some for garnish",
        "1 (15-ounce) can whole tomatoes, drained and hand-crushed",
        "4 cups short grain Spanish rice",
        "6 cups water, warm",
        "Generous pinch saffron threads",
        "1 dozen littleneck clams, scrubbed",
        "1 pound jumbo shrimp, peeled and de-veined",
        "2 lobster tails",
        "1/2 cup sweet peas, frozen and thawed",
        "Lemon wedges, for serving",
        "1 tablespoon sweet paprika",
        "2 teaspoons dried oregano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Saffron Rice",
        "Rice Recipes",
        "Skillet Recipes",
        "European Recipes",
        "Spanish",
        "Chorizo",
        "Sausage Recipes",
        "Grain Recipes",
        "Fruit",
        "Lemon Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Clam Recipes",
        "Chicken",
        "Poultry Recipes",
        "Tomato",
        "Vegetable",
        "Lobster",
        "Meat",
        "Main Dish Recipes",
        "Lunch",
        "Dinner Parties",
        "Recipes for Parties",
        "4th of July",
        "Holiday",
        "Marinating Recipes",
        "Sauteing Recipes",
        "Caramelizing"
    ],
    "title": "The Ultimate Paella",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-paella-recipe"
}
