{
    "directions": [
        "Grate the cucumbers and onions into a large bowl using the large holes of a box grater. Sprinkle the pickling salt over the top. Cover tightly, and allow to rest at room temperature overnight.",
        "Squeeze as much liquid as possible out of the cucumber mixture; set aside. Whisk together the sugar, flour, turmeric, ginger, and celery seed. Heat the vinegar and water in a large, heavy pot over medium-high heat. Whisk in the sugar mixture until smooth. Stir in the cucumber mixture. Bring to a boil and cook, stirring frequently, until thickened, about 15 minutes.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process pint jars for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "7 large English cucumbers",
        "4 large sweet onions, peeled",
        "1/4 cup pickling salt",
        "3 cups white sugar",
        "1/2 cup all-purpose flour",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground ginger",
        "1 teaspoon celery seed",
        "3 cups distilled white vinegar",
        "1 cup water",
        "4 (1 pint) canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Best Relish I've Ever Had",
    "url": "http://allrecipes.com/recipe/166211/the-best-relish-ive-ever-had/"
}
