{
    "directions": [
        "Crust: Pulse flour with cocoa,1/3 cup sugar, coconut and salt in a food processor. Pulse in butter until finely crumbed. Whisk 1 egg yolk with 2 tablespoons (30 mL) ice water; pulse into flour mixture until it clumps together.",
        "Press dough evenly into the bottom and 1 1/2 inches (4 cm) up the sides of a 10-inch (25 cm) springform pan. Prick with a fork. Freeze for 15 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Bake, on a lower rack, for 15 minutes or until set. Cool to room temperature.",
        "Filling: Whisk milk with 2/3 cup sugar and cornstarch in a heavy saucepan set over medium heat. Bring to a boil, stirring often, until thickened. Whisk some of the hot milk mixture into 2 beaten egg yolks. Whisk back into remaining milk. Cook, whisking, for 1 minute. Remove from heat; stir in butter and vanilla.",
        "Line cooled shell with bananas. Pour hot filling over top to cover bananas completely. Cool to room temperature; chill for at least 2 hours or up to 2 days. Just before serving, remove ring and arrange on serving platter. Pipe coconut whipped cream to cover custard completely and garnish with toasted coconut."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/2140281.jpg",
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/3 cup cocoa powder",
        "1/3 cup granulated sugar",
        "1/4 cup sweetened flaked coconut",
        "1/2 teaspoon salt",
        "3/4 cup cold, cubed Gay Lea Salted Butter",
        "1 egg yolk",
        "2 tablespoons ice water",
        "Filling:",
        "2 1/2 cups milk",
        "2/3 cup granulated sugar",
        "1/3 cup cornstarch",
        "2 egg yolks, beaten",
        "2 tablespoons Gay Lea Salted Butter",
        "1 tablespoon vanilla extract",
        "3 bananas, thinly sliced",
        "1 canister Gay Lea Real Coconut Whipped Cream",
        "Toasted coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Ultimate Chocolate Coconut Banana Cream Pie",
    "url": "http://allrecipes.com/recipe/241598/the-ultimate-chocolate-coconut-banana/"
}