{
    "directions": [
        "Blend tomatoes, onions, serrano pepper, anaheim pepper, zucchini, and garlic together in a blender until vegetables are completely pureed.",
        "Heat olive oil in a large pot over medium heat. Cook lamb and beef with a pinch of salt, stirring occasionally, until lamb is cooked through and browned on all sides, about 25 minutes.",
        "Stir vegetable puree, vegetable bouillon, cumin, black pepper, paprika, coriander, turmeric, and cayenne pepper into lamb mixture. Bring to a simmer and reduce heat to medium-low; cook, stirring occasionally, until flavors begin to blend, about 35 minutes.",
        "Pour water and tomato paste into lamb mixture. Bring to a simmer, reduce heat to medium-low, and cook until lamb starts to tenderize, about 1 1/2 hours. Add freekeh; simmer until freekeh is incorporated into the soup, about 30 minutes.",
        "Stir peas and butter into soup. Remove pot from heat and stir cilantro into soup. Ladle soup into bowls and squeeze lemon juice into bowls."
    ],
    "ingredients": [
        "2 large tomatoes, cut into chunks",
        "2 onions, cut into chunks",
        "1 serrano pepper, cut into chunks",
        "1 Anaheim pepper, cut into chunks",
        "1/2 zucchini, cut into chunks",
        "3 cloves garlic",
        "1/4 cup olive oil",
        "1 pound lamb stew meat, cut into 1-inch cubes",
        "3/4 pound ground beef",
        "2 teaspoons salt",
        "2 cubes vegetable bouillon, or more to taste",
        "2 teaspoons ground cumin",
        "1 teaspoon ground black pepper",
        "1 teaspoon paprika",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon cayenne pepper",
        "2 1/2 quarts water",
        "1 (6 ounce) can tomato paste",
        "1/2 cup finely ground freekeh",
        "2 cups green peas",
        "2 tablespoons butter",
        "1 bunch cilantro, coarsely chopped",
        "1 lemon, cut into wedges, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Shorba Freekeh of Algeria",
    "url": "http://allrecipes.com/recipe/237695/the-shorba-freekeh-of-algeria/"
}
