{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "For the Crust:",
        "In a mixing bowl, combine the ingredients with a fork until evenly moistened. Lightly coat the bottom and sides of an 8-inch springform pan with non-stick cooking spray.",
        "Pour the crumbs into the pan and, using the bottom of a measuring cup or the smooth bottom of a glass, press the crumbs down into the base and 1-inch up the sides. Refrigerate for 5 minutes.",
        "For the Filling:",
        "In the bowl of an electric mixer, beat the cream cheese on low speed for 1 minute until smooth and free of any lumps. Add the eggs, 1 at a time, and continue to beat slowly until combined. Gradually add sugar and beat until creamy, for 1 to 2 minutes.",
        "Add sour cream, lemon zest, and vanilla. Periodically scrape down the sides of the bowl and the beaters. The batter should be well-mixed but not over-beaten. Pour the filling into the crust-lined pan and smooth the top with a spatula.",
        "Set the cheesecake pan on a large piece of aluminum foil and fold up the sides around it. Place the cake pan in a large roasting pan. Pour boiling water into the roasting pan until the water is about halfway up the sides of the cheesecake pan; the foil will keep the water from seeping into the cheesecake. Bake for 45 minutes. The cheesecake should still jiggle (it will firm up after chilling), so be careful not to overcook. Let cool in pan for 30 minutes. Chill in the refrigerator, loosely covered, for at least 4 hours. Loosen the cheesecake from the sides of the pan by running a thin metal spatula around the inside rim. Unmold and transfer to a cake plate. Using a spatula spread a layer of Warm Lemon Blueberry topping over the surface.",
        "Slice the cheesecake with a thin, non-serrated knife that has been dipped in hot water. Wipe dry after each cut.",
        "In a small saucepan add all the ingredients and simmer over medium heat for 5 minutes or so until the fruit begins to break down slightly. Leave to cool before spreading on cheesecake."
    ],
    "ingredients": [
        "2 cups finely ground graham crackers (about 30 squares)",
        "1/2 teaspoon ground cinnamon",
        "1 stick unsalted butter, melted",
        "1 pound cream cheese, two 8-ounce blocks, softened",
        "3 eggs",
        "1 cup sugar",
        "1 pint sour cream",
        "1 lemon, zested",
        "1 dash vanilla extract",
        "Warm Lemon Blueberry Topping, recipe follows",
        "1 pint blueberries",
        "1 lemon, zested and juiced",
        "2 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "American",
        "Dairy Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Blueberry",
        "Fruit"
    ],
    "title": "The Ultimate Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-cheesecake-recipe"
}
