{
    "directions": [
        "1. Shuck the corn and use a paring knife to strip the kernels into a bowl. Put the cobs in a pot with 4 cups water; bring to a boil, cover, and simmer for 10 minutes.",
        "2. Meanwhile, put the butter or oil in a saucepan and turn the heat to medium-high. When the butter melts or the oil is hot, add the onion and potatoes, along with a sprinkling of salt and pepper. Cook, stirring occasionally, until the onion softens, about 5 minutes; add the tomatoes if you're using them and cook, stirring, for another minute or two.",
        "3. After the corn cobs have cooked for at least 10 minutes, strain the liquid into the onion-potato mixture. Bring to a boil, then turn the heat down so the mixture simmers. When the potatoes are tender, about 10 minutes, add the corn kernels and milk and heat through. Taste and adjust seasoning if necessary, garnish with the parsley, and serve.",
        "STRIP THE KERNELS from the cob with a sharp knife, and make sure to catch any liquid that seeps out during the process.",
        "TO MINIMIZE COOKING TIME, chop the potatoes into 1/4-inch pieces. Leave them larger if you're not in a hurry.",
        "AS LONG AS your corn is young and tender, the kind you can just about eat raw, the kernels should be held out of the mix until the chowder is just about ready, so they don't overcook. But the new supersweet hybrids, which retain much of their flavor in the refrigerator for a few days, are not as tender, and their kernels should be cooked for a few minutes at least. Just keep tasting and stop cooking when the texture seems right."
    ],
    "ingredients": [
        "4 to 6 ears corn",
        "1 tablespoon butter or neutral oil, like canola or grapeseed",
        "1 medium onion, chopped",
        "2 medium potatoes, peeled and chopped",
        "Salt and freshly ground black pepper",
        "2 tomatoes, cored, seeded, and chopped, optional",
        "1 cup milk",
        "1/2 cup chopped fresh parsley leaves, optional"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Pepper",
        "Potato",
        "Tomato",
        "Dinner",
        "Corn",
        "Summer",
        "Healthy",
        "Parsley",
        "Simmer",
        "Boil",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "The Minimalist's Corn Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/the-minimalists-corn-chowder-358354"
}
