{
    "directions": [
        "Heat 2 tablespoons vegetable oil in a medium skillet over medium heat and cook 2 thinly sliced large onions, stirring often and adding water as needed to prevent burning, until deep golden brown and very soft, 20-25 minutes.",
        "Gently mix 1/4 small onion, finely chopped, 1 pound ground beef chuck (20% fat), 1 tablespoon ketchup, 1/2 teaspoon garlic powder, 1/4 teaspoon freshly ground black pepper, and 1 teaspoon kosher salt in a medium bowl. Divide into 4 portions and press each between 2 pieces of parchment or waxed paper until about 1/4 \" thick (you want them roughly the same dimensions as the bread you're using).",
        "Heat 1 tablespoon vegetable oil in a large skillet, preferably cast iron, over medium-high. Working in 2 batches, cook patties, pressing gently, until browned but still pink in the center, about 2 minutes per side. Transfer to a plate. Do ahead: Patties can be formed 8 hours ahead. Cover and chill.",
        "Wipe out skillet; reduce heat to medium. Top 4 slices seeded rye bread with 4 ounces thinly sliced aged sharp cheddar, then patties, onions, 4 ounces thinly sliced Swiss cheese, and another 4 slices bread; spread tops with 1 teaspoon mayonnaise each. Cook, mayo side down and weighted with a foil-covered heavy pan, until golden brown, about 3 minutes. Remove pan; spread top of each melt with 1 teaspoon mayonnaise. Flip; weight with pan. Cook until bread is golden brown and cheese is melted, about 3 minutes."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "2 thinly sliced large onions",
        "1/4 small onion, finely chopped",
        "1 pound ground beef chuck (20% fat)",
        "1 tablespoon ketchup",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon freshly ground black pepper",
        "1 teaspoon kosher salt",
        "4 slices seeded rye bread",
        "4 ounces thinly sliced aged sharp cheddar",
        "4 ounces thinly sliced Swiss cheese",
        "4 slices bread",
        "1 teaspoon mayonnaise",
        "parchment or waxed paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Dinner",
        "Lunch",
        "Meat",
        "Ground Beef",
        "Pan-Fry"
    ],
    "title": "The BA Patty Melt",
    "url": "http://www.epicurious.com/recipes/food/views/the-ba-patty-melt-51252650"
}
