{
    "directions": [
        "Whisk 2 1/2 cups flour, salt, and 1 Tbsp. sugar in a large bowl. Drizzle in butter. Stir just to combine but do not fully incorporate. Texture should be crumbly with some large clumps.",
        "Transfer 1 1/4 cups (loosely packed) crust mixture to a medium bowl; add cinnamon and remaining 3 Tbsp. sugar. Knead with fingertips until well-combined but still crumbly with a few pea-sized pieces remaining. Freeze until ready to use.",
        "Add vinegar and 2 Tbsp. cold water to remaining crust mixture. Stir to form a dough, then transfer to a lightly floured surface and knead a few times until the texture is smooth. Transfer to pie pan and press into bottom and up sides with a flat-bottomed measuring cup. Crimp edge with a floured fork, if desired, and freeze while you prepare the filling.",
        "Position 1 rack in bottom third and 1 rack in center of oven; preheat to 425°F. Place a foil-lined rimmed baking sheet on bottom rack to preheat.",
        "Slice peaches into 1/4-inch-thick wedges, then transfer to a large bowl. Add raspberries, sugar, cornstarch, vanilla, and salt and toss well to combine. Fill pie crust with fruit mixture, then sprinkle with crumb topping.",
        "Place pie on preheated sheet and bake until crust begins to turn golden, 20–25 minutes. Rotate sheet, move to center rack, and reduce oven temperature to 350°F. Continue to bake pie until crust is golden brown and thickened juices are bubbling, 35-45 minutes more; cover crust with foil or a pie shield if it begins to darken too much before juices are bubbling. Cool on a wire rack at least 2 hours to allow juices to set before slicing.",
        "Pie dough and crumb topping can be made and frozen for up to 3 months; thaw before using."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour, plus more for surface",
        "1 teaspoon salt",
        "1/4 cup sugar, divided",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "1 teaspoon ground cinnamon",
        "1 tablespoon apple cider vinegar",
        "1 1/2 pounds ripe yellow peaches (about 3–4 medium)",
        "2 pints raspberries (about 4 cups)",
        "1 cup sugar",
        "6 tablespoons cornstarch",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "9\" pie pan (not deep dish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Kid-Friendly",
        "Raspberry",
        "Peach",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "The Easiest Peach-Raspberry Pie with Press-In Crust",
    "url": "http://www.epicurious.com/recipes/food/views/the-easiest-peach-raspberry-pie-with-press-in-crust-56389627"
}
