{
    "directions": [
        "Put the rice and all the vegetables in a large bowl. Drizzle with vinaigrette and use two big forks to combine, fluffing the rice and tossing gently to separate the grains.",
        "Stir in the parsley, taste, and adjust the seasoning or moisten with a little more dressing. Serve at room temperature or refrigerate for up to a day, bringing the salad back to room temperature before serving.",
        "Rice Salad, Japanese Style: Use brown or white short-grain rice. Halve the amount of celery and carrot and finely chop them or shred them on a grater. Add 1 cup cubed firm tofu (preferably baked). Instead of the vinaigrette, toss with 1/4 cup or so of Simple Miso Dipping Sauce (made by whisking together 6 tablespoons miso paste, 3/4 cup warm water or sake, 1 teaspoon sugar, 1 tablespoon mirin or honey, 1 tablespoon rice vinegar plus more to taste, and salt to taste). Instead of the parsley, crumble 2 sheets of nori over the rice salad and sprinkle with 2 tablespoons black or white sesame seeds.",
        "Rice Salad, Mexican Style: Long-grain or medium-grain, white or brown, all work well here. When blending the vinaigrette, add 1 tablespoon chili powder and 2 tablespoons Mexican crema or mayonnaise. Instead of celery and carrot, add 1 cup chopped fresh tomato. Substitute chopped fresh cilantro for the parsley and, at the same time, add 2 chopped hard-cooked eggs and chopped jalapeño chiles if you like. Serve with lime wedges.",
        "Rice Salad, Indian Style: Use brown or white basmati rice. When making the vinaigrette, use rice wine vinegar, replace the oil with coconut milk, and add 1 tablespoon curry powder, or more to taste. Instead of the bell pepper, celery, and carrot, add 1/2 cup each cubed cooked potato, cooked cauliflower florets, and green peas (cooked frozen are fine). Substitute cilantro for the parsley.",
        "Citrus Rice Salad: Use any rice. Instead of red wine vinegar, make the vinaigrette with freshly squeezed citrus juice—choose from lemon, lime, orange, blood orange, tangerine, pink grapefruit, or a combination. Whatever you use, add 2 tablespoons of the grated zest and 1 tablespoon of sugar or honey to the blender. Do not include the scallion or the vegetables. (You might want to use a little less dressing.) Instead of the parsley, use mint if you like. A handful of chopped almonds or pecans make a nice addition.",
        "Tomato Rice Salad: Use any kind of brown or white rice. When making the vinaigrette, eliminate the vinegar and add 1 medium tomato to the blender. Instead of the scallion and other vegetables, add 2 cups chopped fresh tomato (a mixture of heirloom varieties is nice).Instead of the parsley, use chopped fresh basil or mint, or 1/4 cup chopped fresh chives, chervil, dill, or about a tablespoon of fresh thyme leaves."
    ],
    "ingredients": [
        "3 to 4 cups cooked rice, cooled",
        "1/4 cup chopped scallion",
        "1 small or 1/2 large red or yellow bell pepper, cored, seeded, and chopped",
        "1/2 cup chopped celery",
        "1/2 cup chopped carrot",
        "1/4 to 1/2 cup Vinaigrette, made with extra virgin olive oil and red wine vinegar, plus more as needed",
        "1/2 cup chopped fresh parsley",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Salad",
        "Potluck",
        "Side",
        "Citrus",
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Peanut Free"
    ],
    "title": "The World of Rice Salads",
    "url": "http://www.epicurious.com/recipes/food/views/the-world-of-rice-salads"
}
