{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and lightly flour one 13x9 inch pan.",
        "In large saucepan, melt 1/2 cup butter and 1 ounce chocolate over low heat. Remove from heat, stir in 1 cup white sugar, 1 cup flour, walnuts, baking powder, 1 teaspoon vanilla, and 2 eggs, and mix well. Spread chocolate base evenly into prepared pan.",
        "In a small bowl, combine 6 ounces cream cheese, 1/2 cup white sugar, 2 tablespoons flour, 1 egg, and 1/2 teaspoon vanilla. Beat for one minute with an electric mixer at medium speed, or until smooth and fluffy. Spread cream cheese filling over chocolate mixture.",
        "Bake base and filling at 350 degrees F (175 degrees C) for 25 to 35 minutes.",
        "Meanwhile, prepare frosting. Melt 1/3 cup butter, 2 ounces chocolate, milk, and 2 ounces cream cheese in large saucepan over low heat. Remove from heat, and add confectioners' sugar and 1 teaspoon vanilla; beat well. Use heat to soften if it begins to dry before you are ready to use it.",
        "Spread marshmallows over the top the chocolate bar in pan. Pour warm frosting over marshmallows. Use kitchen knife to somewhat mix the two. Let cool to room temperature.  When cool, cover with foil and refrigerate overnight.  Cut cold into small pieces."
    ],
    "ingredients": [
        "1/2 cup butter",
        "1 (1 ounce) square unsweetened chocolate",
        "1 cup white sugar",
        "1 cup all-purpose flour",
        "1/2 cup chopped walnuts",
        "1 teaspoon baking powder",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "6 ounces cream cheese, softened",
        "1/2 cup white sugar",
        "2 tablespoons all-purpose flour",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "2 cups miniature marshmallows",
        "1/3 cup butter",
        "2 (1 ounce) squares unsweetened chocolate",
        "1/3 cup milk",
        "2 ounces cream cheese",
        "4 cups confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Ultimate Chocolate Bar",
    "url": "http://allrecipes.com/recipe/9366/the-ultimate-chocolate-bar/"
}
