{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C). Grease 8 muffin cups.",
        "In a bowl, beat the corn muffin mix, egg, and milk together until moistened; batter will be slightly lumpy. Allow the batter to rest 3 to 4 minutes, stir again, and spoon the batter into the prepared muffin cups, filling them halfway.",
        "Bake in the preheated oven until the muffins have risen and are golden brown, 15 to 20 minutes. A toothpick inserted into the center of a muffin should come out clean. Remove the muffins, let cool, and coarsely crumble the muffins into a very large bowl.",
        "Increase the oven heat to 450 degrees F (230 degrees C).",
        "Place the biscuit mix into a bowl, and lightly stir in 1/2 cup of water to make a soft dough. Turn the dough out onto a floured work surface, and gently knead 2 or 3 times; pat the dough out 1/2-inch thick. With a 2-inch floured cutter, cut the biscuit dough into rounds, and place biscuits onto an ungreased baking sheet.",
        "Bake the biscuits in the 450-degree oven until lightly golden brown, about 10 minutes. Remove biscuits, allow to cool on a rack, and coarsely crumble the biscuits in the bowl with the muffin crumbs.",
        "Reduce oven heat to 350 degrees F (175 degrees C); grease an 11x15-inch baking dish.",
        "Melt 1/4 cup of unsalted butter in a large skillet; cook and stir the onion and chicken livers in the butter until the onion is translucent and the chicken livers are no longer pink, about 10 minutes. Press a fork into the chicken livers to mash them as they cook. Remove from heat and set aside.",
        "Place the herb stuffing mix into the large bowl with the crumbs. Melt the remaining 1/4 cup of butter with 1 1/2 cup of water in a saucepan over medium heat. If stuffing mix comes with a separate packet of herbs, empty the herb packet into the saucepan and bring to a boil. Pour the mixture over the dry stuffing mix and crumbs.",
        "Pour in the turkey gravy and mix in the cooked chicken livers with onions and butter. With a large wooden spoon, begin stirring in turkey broth until the stuffing is moist but not soggy. Stir in sage, thyme, salt, and black pepper, and lightly spoon the dressing into the prepared baking sheet.",
        "Bake in the preheated oven for 20 minutes; remove from oven, and gently stir in the oysters and their juices. Cook for an additional 15 minutes. If you need to hold the stuffing for a short while, cook for 10 minutes after stirring in oysters, remove from oven, cover the dish with aluminum foil, and serve as soon as possible."
    ],
    "ingredients": [
        "1 (8.5 ounce) package corn muffin mix",
        "1 egg",
        "1/3 cup milk",
        "1 (8 ounce) box buttermilk biscuit mix",
        "1/2 cup water",
        "1/2 cup unsalted butter, divided",
        "1 onion, chopped",
        "1 cup chicken livers, rinsed and trimmed",
        "1 (14 ounce) package dry herb-seasoned stuffing mix",
        "1 1/2 cups water",
        "1 (12 ounce) jar turkey gravy",
        "2 cups turkey broth, or as desired",
        "1 teaspoon crumbled dried sage",
        "1 tablespoon crushed dried thyme leaves",
        "salt and pepper to taste",
        "2 cups shucked oysters with their liquor"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "The Very Best Family-Style Oyster Dressing",
    "url": "http://allrecipes.com/recipe/218907/the-very-best-family-style-oyster-dre/"
}
