{
    "directions": [
        "Day One: In a large glass jar or bowl, combine 2 cups of the starter with 1 can of the sliced peaches and their juice (each slice chopped into 4 pieces). Add 2 1/2 cups of the white sugar and stir once every day for 10 days. When  not stirring mixture, keep it covered with a paper towel, foil, or a loose lid. Let sit at room temperature. Don't refrigerate it or cover it airtight. A pan of water underneath the jar or bowl will keep the ants out.",
        "Day Ten: Add 1 can of chunk pineapple and it's juice. Cut each chunk of pineapple in half. Stir in 1/2 cup of white sugar. Stir once everyday for 10 days. The color should change, and the mixture should foam when stirred.",
        "Day Twenty:  Slice each cherry in half, and stir in. Add 2 1/2 cups of the white sugar. Stir once every day for the final 10 days. The cherries will give the juice back its pinkish color.",
        "Day Thirty: Drain fruit and reserve it and the liquid. The fruit will be used in the cake. Pour the liquid into 3 glass or ceramic pint jars. One for you to start your next cake, and two for friends. Cake must be started within 3 days after receiving the starter, or you should freeze the starter to use at a later date. Do not use plastic or metal containers to store liquid!",
        "Preheat oven to 325 degrees F (165 degrees C). Grease and flour two 9x13 inch baking pans.",
        "It's best to mix the two cakes separately. Combine 1 box of the cake mix, 1 box of the instant vanilla pudding, 2/3 cup of the vegetable oil, and 4 of the eggs. Stir, then add 1/2 of the drained reserved fruit from the starter. Stir, then add 1 cup of the golden raisins, 1 cup of the chopped nuts and 1 cup of the coconut. Stir until all ingredients are combined. The batter will be stiff. Pour batter into the prepared cake pan. Repeat for cake number two.",
        "Bake cakes at 325 degrees F (165 degrees C) for 55 to 65 minutes."
    ],
    "ingredients": [
        "2 cups Friendship Fruit Starter",
        "1 (15 ounce) can sliced peaches with juice",
        "2 1/2 cups white sugar",
        "1 (15 ounce) can pineapple chunks with juice",
        "1/2 cup white sugar",
        "2 (10 ounce) jars maraschino cherries",
        "2 1/2 cups white sugar",
        "2 (18.25 ounce) packages yellow cake mix",
        "2 (3.4 ounce) packages instant vanilla pudding mix",
        "1 1/3 cups vegetable oil",
        "8 eggs",
        "2 cups golden raisins",
        "2 cups chopped walnuts",
        "2 cups flaked coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thirty Day Friendship Cake",
    "url": "http://allrecipes.com/recipe/7900/thirty-day-friendship-cake/"
}
