{
    "directions": [
        "In a small bowl proof the yeast with the sugar in 1/4 cup of the water for 5 minutes, or until the mixture is foamy. In a large bowl stir together 2 3/4 cups of the flour, the salt, 1 tablespoon of the oil, the remaining 2/3 cup water, and the yeast mixture until the mixture forms a dough and knead the dough on a lightly floured surface, kneading in enough of the remaining 1/4 cup flour to form a soft dough. Knead the dough for 8 to 10 minutes more, or until it is smooth and elastic, and form it into a ball. Transfer the dough to a lightly oiled bowl, turning it to coat it well, and let it rise, covered loosely, in a warm place for 1 1/2 hours, or until it is double in bulk.",
        "In a heavy skillet cook the white onions in the remaining 1 tablespoon oil over moderate heat, stirring occasionally, until they are softened and golden and let them cool. In a bowl whisk together the sour cream and the eggs and stir in the white onions and salt and pepper to taste.",
        "Punch down the dough and roll it into a 17- by 13-inch rectangle on a lightly floured surface. Transfer the rectangle to a large baking sheet, with your fingers form a 1/4-inch rim around the edges of the rectangle, and spread the sour-cream mixture evenly over the dough. Scatter the red onion and the scallion greens over half the dough and scatter the sun-dried tomatoes and the olives over the remaining half. Bake the tart in the middle of a preheated 350°F. oven for 25 minutes, transfer it to a rack, and let it cool for 10 minutes. Cut the tart into 2-inch-wide diamonds."
    ],
    "ingredients": [
        "a 1/4-ounce package (about 2 1/2 teaspoons) active dry yeast",
        "a pinch of sugar",
        "1/4 cup plus 2/3 cup lukewarm water",
        "2 3/4 to 3 cups all-purpose flour",
        "1 teaspoon salt",
        "2 tablespoons olive oil",
        "1 pound white or yellow onions, chopped fine (about 3 cups)",
        "1/2 cup sour cream",
        "2 large eggs",
        "1 cup thinly sliced red onion",
        "1/3 cup thinly sliced scallion greens",
        "1/4 cup minced drained sun-dried tomatoes packed in oil",
        "1/3 cup minced Kalamata or other brine-cured black olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Onion",
        "Tomato",
        "Appetizer",
        "Brunch",
        "Bake",
        "Vegetarian",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Three-Onion, Sun-Dried Tomato, Olive Tart",
    "url": "http://www.epicurious.com/recipes/food/views/three-onion-sun-dried-tomato-olive-tart-11087"
}
