{
    "directions": [
        "Put a large baking sheet in middle of oven and preheat oven to 450°F.",
        "Whisk together granulated sugar, cornstarch, tapioca, and salt, then toss with berries.",
        "Roll out 1 piece of dough (keep remaining piece chilled) on a lightly floured surface with a lightly floured rolling pin into a 13-inch round and fit into pie plate. Trim edge, leaving a 1/2-inch overhang. Chill shell while rolling out dough for top crust.",
        "Roll out remaining piece of dough on lightly floured surface with floured rolling pin into an 11-inch round.",
        "Spoon filling into shell, then cover pie with pastry round and trim with kitchen shears, leaving a 1/2-inch overhang. Press edges together, then crimp edge decoratively. Brush top of pie with egg and sprinkle all over with sanding sugar. Cut 3 steam vents in top crust with a small sharp knife.",
        "Bake pie on hot baking sheet in middle of oven 15 minutes, then reduce oven temperature to 375°F and continue to bake until crust is golden brown and filling is bubbling, about 45 minutes more.",
        "Cool pie on a rack at least 3 hours before serving to allow juices to thicken slightly (filling will still be juicy)."
    ],
    "ingredients": [
        "1 cup granulated sugar",
        "3 tablespoons cornstarch",
        "2 tablespoons quick-cooking tapioca",
        "1/4 teaspoon salt",
        "3 cups fresh blackberries (3/4 to 1 pound)",
        "2 cups fresh raspberries (1/2 to 3/4 pound)",
        "2 cups fresh blueberries (1/2 to 3/4 pound)",
        "Pastry dough",
        "1 large egg, lightly beaten",
        "1 tablespoon sanding or granulated sugar",
        "Special equipment: a 9-inch metal or glass pie plate (4-cup capacity)",
        "Accompaniment: vanilla cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Summer",
        "Gourmet"
    ],
    "title": "Three-Berry Pie with Vanilla Cream",
    "url": "http://www.epicurious.com/recipes/food/views/three-berry-pie-with-vanilla-cream-108420"
}
