{
    "directions": [
        "Position a rack in the middle of an oven and preheat to 350°F (180°C). Butter and flour three 8-inch (20-cm) round cake pans.",
        "In a bowl, sift together the flour, baking soda, baking powder, cinnamon, salt and allspice. In a large bowl, whisk together the eggs, vegetable oil, granulated sugar, brown sugar and buttermilk until blended. Stir the flour mixture into the egg mixture just until combined. Fold in the carrots, walnuts and coconut. Divide the batter evenly among the prepared pans.",
        "Bake until a toothpick inserted into the center of each cake comes out clean, 35 to 40 minutes. Transfer the pans to wire racks and let the cakes cool in the pans for 15 minutes. Invert the cakes onto the racks and let cool completely.",
        "Meanwhile, make the cream cheese frosting: In the bowl of an electric mixer, beat together the cream cheese and butter on medium-high speed until smooth and creamy. Reduce the speed to low, add the confectioners' sugar and beat until smooth. Beat in the vanilla extract until well blended.",
        "Place 1 cake layer on a serving platter. Spread about a quarter of the frosting over the top of the cake. Place another cake layer on top of the first and spread another quarter of the frosting over the cake. Top with the third cake layer, and spread the remaining frosting decoratively over the top and sides of the cake.",
        "Serve immediately, or cover with a cake dome and refrigerate for up to 2 days. Bring to room temperature and garnish with coconut flakes before cutting into slices and serving. Serves 12.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "3 cups (15 oz./470 g) unbleached all-purpose flour",
        "1 Tbs. baking soda",
        "1 Tbs. baking powder",
        "1 Tbs. ground cinnamon",
        "3/4 tsp. kosher salt",
        "3/4 tsp. ground allspice",
        "5 eggs",
        "1 cup (8 fl. oz./250 ml) plus 2 Tbs. vegetable oil",
        "1 cup (8 oz./250 g) granulated sugar",
        "1 1/2 cups (12 oz./375 g) firmly packed brown sugar",
        "3/4 cup (6 fl. oz./180 ml) buttermilk",
        "1 1/2 lb. (750 g) peeled and shredded carrots",
        "1 cup (4 oz./125 g) toasted chopped walnuts",
        "1 cup (3 oz./90g) toasted flaked coconut, plus more for garnish",
        "1 1/2 lb. (750 g) cream cheese, at room temperature",
        "6 Tbs. (3/4 stick) (3 oz./90 g) unsalted butter, at room temperature",
        "1 3/4 cups (7 oz./220 g) confectioners’ sugar",
        "2 tsp. vanilla extract"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Three-Layer Carrot Cake with Cream Cheese Frosting",
    "url": "http://www.williams-sonoma.com/recipe/three-layer-carrot-cake-with-cream-cheese-frosting.html"
}
