{
    "directions": [
        "Heat oil in heavy small skillet over medium heat. Mix in shallots. Cover and cook 5 minutes. Transfer shallots to medium bowl and cool. Add all cheeses and toss to coat.",
        "Place 2 wonton wrappers on work surface; brush with egg white. Mound 1 rounded tablespoon filling in center of 1 wrapper; cover with second wrapper, egg white side facing down. Using fingertips, press around edges and filling to seal. Repeat with remaining wrappers, egg white, and filling, forming total of 18 ravioli. Place ravioli in single layer on lightly floured baking sheet. Cover with dry towel, then plastic wrap. DO AHEAD Can be made 6 hours ahead; refrigerate.",
        "Heat oil in heavy large skillet over medium-high heat. Add onion, garlic, and jalapeño; sauté 5 minutes. Add all tomatoes, all olives, and basil. Cover and simmer 12 minutes to blend flavors. Season to taste with salt and pepper.",
        "Cook ravioli in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally, about 6 minutes.",
        "Meanwhile, melt butter in heavy large skillet over medium heat; set aside. Using strainer, transfer ravioli to skillet with melted butter. Toss gently over medium heat to coat with butter, about 2 minutes. Spoon tomato sauce onto 6 plates. Top each with 3 ravioli and serve."
    ],
    "ingredients": [
        "1/2 tablespoon olive oil",
        "3/4 cup chopped shallots",
        "1 8-ounce piece Brie, rind trimmed, cheese cut into 1/4-inch dice",
        "1 cup (scant) diced mozzarella (about 4 ounces)",
        "1/2 cup diced soft fresh goat cheese (about 4 ounces)",
        "36 wonton wrappers",
        "1 egg white, beaten to blend",
        "1/4 cup olive oil",
        "1 cup chopped onion",
        "1 garlic clove, chopped",
        "1 large red jalapeño chile, seeded, chopped",
        "2 cups chopped plum tomatoes (about 12 ounces)",
        "1 cup canned diced tomatoes with juices",
        "1/4 cup chopped pitted green Greek olives",
        "1/4 cup chopped pitted Kalamata olives",
        "1/4 cup chopped fresh basil",
        "1/4 cup (1/2 stick) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Pasta",
        "Tomato",
        "Vegetarian",
        "Brie",
        "Goat Cheese",
        "Mozzarella",
        "Jalapeño"
    ],
    "title": "Three-Cheese Sorrentinos with Tomato-Olive Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/three-cheese-sorrentinos-with-tomato-olive-sauce-236471"
}
