{
    "directions": [
        "Place pork shoulder on a rimmed baking sheet. Season with 1 tablespoon each kosher salt and freshly ground pepper. Cover pork with plastic wrap and refrigerate overnight.",
        "Preheat oven to 400°F.",
        "Heat a large heavy pot (such as a Dutch oven) over high; add 1/4 cup oil, onion, carrot, and celery. Cook, stirring occasionally, until vegetables start to sizzle; reduce heat to medium and cook, stirring occasionally, until vegetables are soft and lightly browned, about 10 minutes. Add the garlic, herbs, and spices and sauté for 1 minute more. Add the wine and bring to a simmer.",
        "Place the pork on top of the aromatics and add enough stock or water to come halfway up the pork. Bring liquid to a simmer, and then cover pot with a lid or a couple layers of foil.",
        "Transfer pot to oven and cook for 10 minutes; reduce heat to 325°F and cook until the meat is quite tender, about 3 hours. (To test for doneness, insert a slender, sharp knife into the middle of the roast; it should pull out easily.)",
        "When meat is cooked, transfer it to a separate container, reserving the pan juices. Set a colander over a large bowl, and strain the pan juice into the bowl, pressing on the solids to extract all the liquid. Let strained pan juices until fat rises to the top, about 5 minutes. With a small ladle, skim off and discard the fat. Pour the skimmed, strained pan juices over the pork and let cool to room temperature; cover and refrigerate overnight.",
        "One hour before you're ready to serve the pork, remove the meat from its cooking liquid and cut (while still cold) into neat 1-inch slices; set aside. Pour cooking liquid in a medium saucepan; bring to a simmer and reduce by a third. Season to taste, cover, and keep warm.",
        "While your pork comes to room temperature, prepare the salsa verde. Line a large plate with a paper towel, and place it next to the stove, alongside a slotted spoon or \"spider\" spatula. In a small skillet, heat 1/2 inch of vegetable oil over medium heat. When the oil starts to look swirly, drop in a single rosemary leaf to test for readiness: if it sinks quietly to the bottom, the oil's not ready. When a leaf sizzles, but not in a frantic way, you are ready to fry.",
        "Add the rosemary leaves to the oil and fry until the sizzling subsides, about 1 minute. Using the slotted spoon or spider, scoop the herbs from the oil and place the on the paper-towel-lined plate. Repeat with the sage leaves in the same oil; remove skillet from heat.",
        "On a cutting board, gather the parsley leaves into a ball, holding them down on the cutting board as if they were trying to run away. Slice this parsley bundle thinly, as if it were a single vegetable. As you slice, the ball will come apart, but just bunch it back together as best you can, keep slicing, and you'll have a nice head start on the chopping that remains. Anchor the tip of the knife to the cutting board and use a paper cutter-like motion to chop away at your pile. Go over it a couple of times, then slide the knife under, like a spatula, and flip it over. Continue chopping and flipping until the parsley is finely chopped; transfer to a medium bowl.",
        "Render the garlic a paste by either pounding it in a mortar with a pinch of salt, or with a knife on a cutting board, again with salt. When the garlic is almost a thick liquid, transfer it the bowl with the parsley; add the fried herbs and the olive oil. Stir salsa verde to combine, adding more salt or oil as needed.",
        "Heat a grill, grill pan, griddle, or cast-iron skillet over medium-high heat. When hot, coat the grill or pan with 1 tablespoon vegetable oil. Working in batches and adding more oil as needed, cook until well browned and crispy on both sides, about 2 minutes per side.",
        "Pour the reduced pan juices onto a serving platter with the pork (but not over the slices or they will lose some crispness) and arrange pork slices on top. Serve with salsa verde spooned over the top, or served alongside."
    ],
    "ingredients": [
        "One 4 to 5-pound boneless, skinless pork shoulder",
        "1 tablespoon kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1/4 cup vegetable oil, plus more for reheating",
        "1 yellow onion, halved and thickly sliced",
        "1 large carrot, cut in thick slices",
        "1 celery stalk, cut in thick slices",
        "3 garlic cloves, unpeeled and cut in half",
        "1 bay leaf",
        "3 parsley sprigs",
        "3 thyme sprigs",
        "2 tablespoons fennel seeds",
        "1 tablespoon coriander seeds",
        "1 cup dry white wine, such as Riesling",
        "3 to 6 cups homemade chicken stock or water",
        "Vegetable oil, for frying (about 1/2 cup)",
        "1/4 cup rosemary leaves",
        "1/4 cup sage leaves",
        "Pinch kosher salt",
        "1 bunch parsley, washed, dried, and leaves picked from stems",
        "1 to 2 garlic cloves, peeled",
        "1/2 cup good-quality extra-virgin olive oil",
        "A grill, grill pan, griddle, or cast-iron skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Kid-Friendly",
        "Dinner",
        "Rosemary",
        "Sage",
        "Parsley",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Three-Day, Twice-Cooked Pork Roast with Fried-Herb Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/three-day-twice-cooked-pork-roast-with-fried-herb-salsa-verde-51262510"
}
