{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Lightly butter and flour the cake pans.",
        "Put the flour, salt, baking soda, cinnamon, and cocoa in a mixing bowl, and whisk together to blend. Put the sugars in a large mixing bowl, and whisk in the peanut oil. Then whisk in the eggs, 1 at a time, followed by the vanilla. When fully blended, add the flour mixture all at once, and mix just until smooth. Stir in the grated carrots and the pecans. Divide the batter evenly between the 3 cake pans. Drop each pan sharply onto the counter from a height of about 6 inches to remove any air pockets. Bake for 25 minutes, or until the center springs back gently when touched. Remove from the oven and place on cooling racks until completely cooled; then unmold.",
        "Place 1 of the cake layers, bottom side up, on a cake plate or pedestal. Spoon approximately 1/4 of the frosting onto the layer, and spread it over evenly. Place a second layer, bottom side down, on top of the first, and spread with an equal amount of frosting. Place the final layer, bottom side down, on top of the others and frost the top and sides with the remaining frosting. Store in a cool but not refrigerated area until ready to serve.",
        "Place the butter in the mixing bowl of an electric mixer. Mix on medium speed just until the butter begins to become malleable, about 3 to 4 minutes. Add the cream cheese, in pieces, and mix until thoroughly blended. Slowly add the confectioners' sugar and vanilla, and mix until blended. Increase mixer speed slightly, and continue mixing for 2 to 3 minutes, until the frosting becomes light and fluffy. Remove from the mixer, and fold in the pecans."
    ],
    "ingredients": [
        "2 cups all-purpose flour, sifted after measuring",
        "1 teaspoon salt",
        "2 teaspoons baking soda",
        "1 tablespoon ground Ceylon cinnamon",
        "1 tablespoon cocoa powder",
        "1 cup light brown sugar",
        "1 cup granulated sugar",
        "1 1/4 cups peanut oil",
        "4 eggs",
        "1 tablespoon vanilla extract",
        "3 cups finely grated carrots",
        "1 1/2 cups pecans, chopped, not too finely",
        "Frosting, recipe follows",
        "12 tablespoons (1 1/2 sticks) unsalted butter, chilled and cut into 2-inch pieces",
        "24 ounces cream cheese, chilled",
        "1 1/2 cups confectioners' sugar, sifted",
        "1 teaspoon vanilla",
        "1 1/2 cups chopped pecans"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Carrot Cake",
        "Cake",
        "Carrot Recipes",
        "Vegetable",
        "Baking",
        "Dessert",
        "Sugar",
        "Dairy Recipes",
        "Nut Recipes",
        "Egg Recipes",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Three-Layer Carrot Cake",
    "url": "http://www.foodnetwork.com/recipes/three-layer-carrot-cake-recipe"
}
