{
    "directions": [
        "Preheat oven to 350°F.",
        "In a shallow baking pan spread bread in one layer and bake in middle of oven, stirring occasionally, until golden, 10 to 15 minutes. Transfer bread to a large bowl.",
        "In a bowl of water wash leeks and drain by lifting leeks from water into a colander.",
        "In a large heavy skillet cook leeks, red onions, shallots, celery, garlic, and herbs with salt and pepper to taste in butter and oil over moderate heat, stirring, until onion mixture is softened, about 10 minutes. Add onion mixture to bread with salt and pepper to taste and toss to combine well. Cool stuffing and transfer to a buttered 4-quart baking dish. Stuffing may be made 1 day ahead and chilled, covered.",
        "During last 1 1/2 hours of grilling turkey, drizzle stuffing with stock or broth and bake, covered, in middle of oven 1 hour. Bake stuffing, uncovered, 20 to 30 minutes more, or until golden brown."
    ],
    "ingredients": [
        "7 cups 1/2-inch pieces firm white sandwich bread (about 12 slices)",
        "1 1/4 pounds leeks (about 8 small), halved lengthwise and cut crosswise into 1/2-inch-thick pieces (about 5 1/4 cups)",
        "3 medium red onions, cut into 1-inch pieces (about 5 1/2 cups)",
        "12 large shallots (about 1/2 pound), cut lengthwise into sixths",
        "3 large celery ribs, chopped (about 1 1/4 cups)",
        "3 tablespoons minced garlic (about 10 small cloves)",
        "2 tablespoons chopped fresh thyme leaves",
        "1 tablespoon chopped fresh sage leaves",
        "1 cup fresh flat-leafed parsley leaves, washed well, spun dry, and chopped",
        "3 tablespoons unsalted butter",
        "3 tablespoons olive oil",
        "1 cup turkey giblet stock or chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Leek",
        "Shallot",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Three-Onion Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/three-onion-stuffing-13277"
}
