{
    "directions": [
        "Place pizza stone on floor of gas oven or on lowest rack if using an electric oven and preheat oven to 500°F (allow 1 hour for pizza stone to heat).",
        "Stir together yeast, 1 tablespoon flour, and 1/4 cup warm water in a measuring cup and let stand until mixture develops a creamy foam on surface, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Stir together 1 1/4 cups flour with salt in a large bowl. Add yeast mixture, oil, and remaining 1/2 cup warm water and stir until smooth. Stir in enough flour (about 1/2 cup) to make dough come away from sides of bowl. (Dough will be wetter than other pizza doughs you may have made.)",
        "Knead dough on lightly floured surface with lightly floured hands (reflour hands when dough becomes too sticky) until smooth, soft, and elastic, about 8 minutes. Form dough into a ball, put on a lightly floured surface, and generously dust with flour. Loosely cover with plastic wrap and let rise in a warm draft-free place until doubled in bulk, about 1 1/4 hours. Dust a wooden peel or a large baking sheet (without sides) with cornmeal.",
        "Do not punch down dough. Carefully dredge dough in a bowl of flour to coat and transfer to a dry work surface. Holding one edge of dough in the air with both hands and letting bottom just touch the work surface, carefully and quickly move hands around edge of dough (like turning a steering wheel), allowing weight of dough to stretch round to roughly 10 inches. Lay dough flat on peel or baking sheet. Continue to work edge of dough with your fingers, stretching it into a 14-inch round.",
        "Brush dough with oil, leaving a 1-inch border, then scatter Fontina and Gorgonzola over dough (leaving a 1-inch border). Scatter onion and sage leaves over cheese. Sprinkle pizza with Parmigiano-Reggiano, then line up far edge of peel with far edge of stone in oven and tilt peel, jerking it gently to start pizza moving. When edge of pizza touches stone, quickly pull back peel to transfer pizza to stone (do not pull back pizza). Bake until crust is golden and cheese is bubbling, 10 to 12 minutes. Slide peel under pizza to remove from oven, then top with arugula."
    ],
    "ingredients": [
        "1 (1/4-oz) package active dry yeast (2 1/4 teaspoons)",
        "About 2 cups unbleached all-purpose flour",
        "3/4 cup warm water (105-115°F)",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons extra-virgin olive oil",
        "1 to 2 tablespoons cornmeal",
        "1 tablespoon extra-virgin olive oil",
        "1/4 lb Italian Fontina cut into 1/2-inch pieces (2/3 cup)",
        "2 oz Gorgonzola dolce, cut into 1/4-inch pieces",
        "1/2 cup thinly sliced red onion (1 medium)",
        "6 large fresh sage leaves, thinly sliced crosswise (1 tablespoon)",
        "1/2 oz finely grated Parmigiano-Reggiano (1/4 cup)",
        "1/4 lb loosely packed baby arugula leaves (4 cups)",
        "Special equipment: a pizza stone"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Vegetarian",
        "Blue Cheese",
        "Parmesan",
        "Arugula",
        "Sage",
        "Fontina",
        "Gourmet"
    ],
    "title": "Three-Cheese Pizza with Onion, Sage, and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/three-cheese-pizza-with-onion-sage-and-arugula-233543"
}
