{
    "directions": [
        "Heat the olive oil in a deep skillet.  Add onion, celery, and carrot, and cook over moderate heat until softened. Add the garlic, and cook 1 minute.  Add veal, pork, and beef.  Cook, stirring occasionally, until meat is no longer pink.  Add wine, and reduce for 1 minute.  Stir in broth.  Add herbs, bay leaf, and salt and pepper.  Bring the mixture to a boil.  Reduce heat, cover, and simmer for 15 minutes.  Uncover, and reduce until almost dry.  Discard bay leaf.  Set aside to cool.",
        "Meanwhile, melt the butter or margarine in a saucepan set over moderately low heat.  Whisk in flour for approximately 2 minutes.  Whisk in milk, grated nutmeg, and salt and pepper.  Simmer, stirring occasionally, for 5 minutes or until thickened.  Stir in parsley and 1/2 cup Parmesan cheese.",
        "Transfer the cooled meat mixture to a large bowl.  Mix in egg yolks.  Mix in the cheese and parsley sauce.  Set aside.",
        "Combine the tomato sauce and cream, set aside.",
        "Cut the pasta sheets crosswise into 5 inch lengths.  In a pot of boiling salted water, cook the noodles a few at a time until al dente.  This should take only a minute or two with fresh pasta. Transfer to a bowl of cold water.  Spread the noodles in one layer on paper towels to drain.",
        "Spoon 1/4 cup of the filling down the center of one noodle, and roll the noodle to enclose the filing. Transfer the cannelloni, seam side down, to a well buttered gratin dish. Repeat with the remaining noodles and filling, arranging in single layer. Ladle the tomato sauce over the cannelloni, and sprinkle with the remaining Parmesan cheese.",
        "Bake at 400 degrees F (205 degrees C) for 10 minutes, or until bubbling.  Run under the broiler about 4 inches from the heat for 2 minutes, or until golden."
    ],
    "ingredients": [
        "1 cup minced onion",
        "1/2 cup minced celery",
        "1/3 cup minced carrot",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "12 ounces ground veal",
        "12 ounces ground pork",
        "12 ounces lean ground beef",
        "1/2 cup white wine",
        "1 cup beef broth",
        "2 teaspoons chopped fresh rosemary",
        "1 teaspoon Italian seasoning",
        "1 bay leaf",
        "salt to taste",
        "ground black pepper to taste",
        "2 egg yolks",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup milk",
        "1/4 teaspoon freshly ground nutmeg",
        "3/4 cup grated Parmesan cheese",
        "1/4 cup chopped parsley",
        "4 cups tomato sauce",
        "1/2 cup heavy whipping cream",
        "1 pound fresh pasta sheets"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Three Meat Cannelloni Bake",
    "url": "http://allrecipes.com/recipe/11876/three-meat-cannelloni-bake/"
}
