{
    "directions": [
        "Preheat your oven's broiler. Line a baking sheet with a sheet of foil.",
        "Cook andouille sausage in a skillet over medium heat until cooked through, about 15 minutes. Remove from skillet and cut into 1/4-inch slices; set aside.",
        "While the sausage is cooking, cut the peppers in half lengthwise and remove the stem and seeds. Place peppers, cut-side-down onto baking sheet and place into preheated oven. Broil peppers until the skins blacken, about 7 minutes, then place into a bowl and cover with plastic wrap. Allow the peppers to steam for 10 minutes until the skins loosen, then remove and discard blackened skins; chop peppers into 1/2 inch pieces and set aside.",
        "Heat the canola oil in a stockpot over high heat. Toss the chicken with Cajun seasoning and sear in batches in the oil until light brown and no longer pink in the center, about 6 minutes. Remove chicken, leaving oil in the stockpot, and drain on paper towels.",
        "Add 1 1/2 tablespoons of butter to the oil. Stir in the onion, banana peppers, celery, garlic, and shallot; cook until the onions are translucent, 3 to 4 minutes. Stir in rice and 1 1/2 tablespoon butter. Stir in the chicken stock, tomato sauce, and diced tomato with chilies. Cover and simmer until liquid is mostly absorbed into the rice, 10 to 12 minutes. Stir in the beer and cover; cook another 5 minutes until the rice is tender. Season with salt, then mix in the corn, poblano, bell pepper, chicken, and andouille sausage. Return to a simmer, then turn off heat and allow to rest 5 minutes before serving."
    ],
    "ingredients": [
        "1/2 pound andouille sausage links",
        "1 poblano chile",
        "1 red bell pepper",
        "3 tablespoons canola oil",
        "1 1/2 pounds skinless, boneless chicken thighs, cut into 1 1/2-inch chunks",
        "3 tablespoons Cajun-style seasoning",
        "1 1/2 tablespoons butter",
        "2 yellow onions, finely chopped",
        "2 banana (or hot) peppers, seeded and chopped",
        "2 celery ribs, finely chopped",
        "6 cloves garlic, minced",
        "1 shallot, minced",
        "3 cups long grain white rice",
        "1 1/2 tablespoons butter",
        "3 cups chicken stock",
        "1 (10 ounce) can tomato sauce",
        "1 (10 ounce) can diced tomatoes with mild green chilies, undrained",
        "1 (12 fluid ounce) can or bottle beer",
        "salt to taste",
        "1 cup frozen corn kernels, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Three-Pepper Rice and Chicken Pot",
    "url": "http://allrecipes.com/recipe/143310/three-pepper-rice-and-chicken-pot/"
}
