{
    "directions": [
        "Whisk flour, salt, and sugar in a bowl; work 1/2 cup unsalted butter pieces into dry ingredients with your fingers until flour mixture looks like coarse meal. Mix ice water into dough a little at a time until it just holds together. Form into a ball and press dough down to form a flat disk; wrap in plastic wrap and refrigerate at least 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Roll dough out to a circle on a floured work surface and fit crust into a 9-inch pie dish; crimp the edges.",
        "Place onion slices into a saucepan, cover with water, and bring to a boil; reduce heat to medium and boil until onion is translucent, about 5 minutes. Drain and cool onion slices; spread into bottom of pie crust and top with Cheddar, mozzarella, and Parmesan cheeses in layers. Spread egg slices over cheese. Pour half-and-half over filling and sprinkle with black pepper.",
        "Mix buttery round cracker crumbs and 1/4 cup melted butter in a bowl; sprinkle crumb mixture evenly over pie.",
        "Bake in the preheated oven until browned, about 40 minutes."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon white sugar",
        "1/2 cup cold unsalted butter, cut into small pieces",
        "2 tablespoons ice water, or as needed",
        "1 large yellow onion, sliced",
        "1 (8 ounce) package shredded Cheddar cheese",
        "1/2 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "3 hard-boiled eggs, peeled and sliced",
        "1/2 cup half-and-half",
        "freshly ground black pepper to taste",
        "3/4 cup finely crushed buttery round crackers",
        "1/4 cup butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Three Cheese and Onion Easter Egg Pie",
    "url": "http://allrecipes.com/recipe/231593/three-cheese-and-onion-easter-egg-pie/"
}
