{
    "directions": [
        "Preheat oven to 400°F. Roll out pie crust disk on lightly floured surface to 13-inch-diameter round (about 1/8 inch thick). Roll up dough on rolling pin and transfer to 9-inch-diameter glass pie plate. Gently press into place. Trim edges of crust, leaving 3/4-inch overhang. Fold overhang under crust so that crust is flush with edge of pie pan. Crimp edges to make decorative border. Freeze crust until firm, about 15 minutes.",
        "Line pie crust with foil, leaving 3-inch overhang. Fill foil with beans or pie weights. Fold extra foil gently over crust edges. Bake until crust is set, about 15 minutes. Remove foil and beans and continue baking until crust just begins to color, piercing with toothpick if crust bubbles, about 10 minutes. Cool. Maintain oven temperature.",
        "Meanwhile, combine chopped walnuts, pecans and almonds on cookie sheet. Toast nuts until just golden, about 10 minutes. Cool.",
        "Whisk brown sugar, light corn syrup, butter, eggs, molasses, vanilla extract and salt to blend in bowl. Stir in toasted nuts and cranberries. Pour filing into prepared crust. Bake until center of filling is set, about 45 minutes. Cool pie completely."
    ],
    "ingredients": [
        "1 Buttermilk Pie Crust Dough disk",
        "1/2 cup coarsely chopped walnuts",
        "1/2 cup coarsely chopped pecans",
        "1/2 cup sliced almonds",
        "3/4 cup firmly packed dark brown sugar",
        "1/2 cup light corn syrup",
        "1/4 cup plus 2 tablespoons (3/4 stick) unsalted butter, melted, room  temperature",
        "3 large eggs",
        "2 tablespoons unsulfured (light) molasses",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1 1/2 cups cranberries (about 6 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Almond",
        "Pecan",
        "Walnut",
        "Fall",
        "Molasses",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Three-Nut Pie with Cranberries",
    "url": "http://www.epicurious.com/recipes/food/views/three-nut-pie-with-cranberries-2692"
}
