{
    "directions": [
        "Preheat oven to 350°F. Spread bread cubes in single layer on large rimmed baking sheet. Bake until lightly browned and slightly crisp, about 18 minutes. Cool.",
        "Combine porcini mushrooms and 2 cups boiling water in medium bowl; let stand until mushrooms are soft, about 30 minutes. Strain, reserving soaking liquid. Chop mushrooms.",
        "Heat oil in heavy large skillet over medium-high heat. Add prosciutto and cook until crisp, stirring occasionally, about 4 minutes. Transfer to paper towels. Melt butter in same skillet over medium-high heat. Add button mushrooms, shiitake mushrooms, and onion to skillet and sauté until soft and brown, about 10 minutes. Add garlic, rosemary, and porcini mushrooms. Sprinkle with salt and pepper. Add wine and boil until almost all liquid evaporates, about 4 minutes. Transfer to bowl.",
        "DO AHEAD: Bread cubes, mushroom soaking liquid, prosciutto, and mushroom mixture can be made 1 day ahead. Cover and store bread cubes at room temperature. Cover mushroom soaking liquid, prosciutto, and mushroom mixture separately and chill.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch baking dish. Combine bread cubes, 1/2 cup prosciutto, mushroom mixture, and 3/4 cup green onions in large bowl; toss to distribute evenly. Add eggs; toss to coat. Pour mushroom soaking liquid into 2-cup measuring cup. Add enough chicken broth to soaking liquid to measure 2 cups. Add broth mixture to bread mixture; toss to coat (mixture will be moist).",
        "Transfer dressing to prepared dish. Bake uncovered until top is slightly crisp, about 30 minutes. Sprinkle with remaining prosciutto and green onions.",
        "*Available in the produce section of many supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "8 cups 1/2-inch cubes rustic rosemary bread (from one 14 1/2-ounce loaf)",
        "1 ounce dried porcini mushrooms*",
        "2 cups boiling water",
        "4 teaspoons vegetable oil",
        "1 3-ounce package thinly sliced prosciutto, cut crosswise into 1/4-inch-wide slices",
        "6 tablespoons (3/4 stick) butter",
        "1/2 pound small button mushrooms, trimmed",
        "1/2 pound small fresh shiitake mushrooms, stemmed, quartered",
        "1 cup chopped onion",
        "3 garlic cloves, minced",
        "2 1/2 teaspoons crushed dried rosemary",
        "1 cup dry white wine",
        "1 cup chopped green onions, divided",
        "2 large eggs, beaten to blend",
        "1 cup (about) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Stuffing/Dressing",
        "Winter",
        "Prosciutto",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Three-Mushroom Dressing with Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/three-mushroom-dressing-with-prosciutto-240383"
}
