{
    "directions": [
        "Bring a large saucepan half full of salted water to a boil over high heat. Add the snap peas and peas and cook until tender-crisp, about 1 minute. Using a slotted spoon, transfer the vegetables to a colander and rinse under cold water. Set aside. Return the saucepan to a boil, add the barley and cook until tender, about 45 minutes. Drain and set aside.",
        "In a small bowl, whisk together the rice vinegar, soy sauce, 2 tbsp water, brown sugar, and sambal oelek until blended. In a large, heavy frying pan over high heat, warm the sesame oil. Add the green garlic, green onions, and lime leaves and stir-fry until the green onions are tender, about 30 seconds. Add the reserved snap peas, peas, and barley along with the pea shoots, and stir to coat. Pour in the soy sauce mixture and stir and toss until the peas and pea shoots are tender and the liquid is absorbed, about 4 minutes. Transfer to a warmed serving dish and serve."
    ],
    "ingredients": [
        "kosher salt",
        "sugar snap peas, 6 oz (185 g), trimmed",
        "English peas, 1 cup (5 oz/155 g) shelled",
        "pearl barley, 1/2 cup (3 1/2 oz/105 g)",
        "rice vinegar, 2 tbsp",
        "soy sauce, 2 tbsp",
        "golden brown sugar, 1 tbsp firmly packed",
        "sambal oelek or other pure chile paste, 1 tsp",
        "Asian sesame oil, 1 tbsp",
        "green garlic, 1/4 cup (3/4 oz/20 g) thinly sliced, or 4 cloves garlic, minced",
        "green onions, 1/4 cup (1/4 oz/20 g) sliced",
        "fresh kaffir lime leaves, 2",
        "pea shoots, about 1/4 lb (125 g)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Stir-Fry",
        "Vegetarian",
        "Barley",
        "Pea",
        "Spring",
        "Vegan",
        "Sugar Snap Pea",
        "Green Onion/Scallion",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Three Peas with Barley, Chile & Green Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/three-peas-with-barley-chile-green-garlic-51166410"
}
