{
    "directions": [
        "Heat oil in heavy large saucepan over medium heat. Add onion, carrots and garlic; sauté until softened, about 12 minutes. Add beef and sausages to pan; sauté until cooked through, breaking up meat with back of spoon, about 5 minutes. Add remaining ingredients. Cover and simmer until flavors blend and sauce measures about 5 cups, stirring occasionally, about 15 minutes. Discard bay leaf. Cool.",
        "Preheat oven to 350°F. Cook noodles in large pot of boiling salted water until almost tender, about 7 minutes. Drain; cover with cold water.",
        "Combine ricotta and 3/4 cup Parmesan cheese in medium bowl. Mix in spinach. Season to taste with salt and pepper. Mix in eggs.",
        "Drain pasta and pat dry. Spread 1/2 cup sauce over bottom of 13x9-inch glass baking dish. Place 5 noodles over sauce, overlapping to fit. Spread half of ricotta-spinach mixture evenly over noodles. Sprinkle 2 cups mozzarella cheese evenly over ricotta-spinach mixture. Spoon 1 1/2 cups sauce over cheese, spreading with spatula to cover (sauce will be thick). Repeat layering with 5 noodles, remaining ricotta-spinach mixture, 2 cups mozzarella and 1 1/2 cups sauce. Arrange remaining 5 noodles over sauce. Spread remaining sauce over noodles. Sprinkle remaining 3/4 cup mozzarella cheese and 1/4 cup Parmesan cheese evenly over lasagna. (Can be prepared up to 1 day ahead. Cover tightly with plastic wrap and refrigerate.) Cover baking dish with aluminum foil. Bake lasagna 40 minutes; uncover and bake until hot and bubbly, about 40 minutes. Let lasagna stand 15 minutes before serving."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 cup chopped onion",
        "3/4 cup finely chopped peeled carrots",
        "2 tablespoons minced garlic",
        "8 ounces lean ground beef",
        "6 ounces spicy Italian sausages, casings removed",
        "1 28-ounce can crushed tomatoes with added puree",
        "1/4 cup tomato paste",
        "1/4 cup chopped fresh basil",
        "1 tablespoon golden brown sugar",
        "1 tablespoon dried oregano",
        "1 bay leaf",
        "1/2 teaspoon dried crushed red pepper",
        "15 lasagna noodles (about 12 ounces)",
        "2 15-ounce containers part-skim ricotta cheese",
        "1 cup grated Parmesan cheese (about 3 ounces)",
        "1 10-ounce package frozen chopped spinach, thawed, drained, squeezed dry",
        "2 large eggs",
        "4 3/4 cups grated mozzarella cheese (about 1 1/4 pounds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Mozzarella",
        "Ricotta",
        "Ground Beef",
        "Sausage",
        "Spinach",
        "Winter",
        "Potluck",
        "Massachusetts",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Three-Cheese Lasagna with Italian Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/three-cheese-lasagna-with-italian-sausage-3152"
}
