{
    "directions": [
        "1. Heat 3 tablespoons of the olive oil over medium heat in a large, preferably nonstick, skillet and cook the onions until soft and lightly golden, or 10 to 12 minutes. Stir as you cook them. Remove from the heat and set aside.",
        "2. Combine the cheeses, yogurt, remaining olive oil, cooked onions, and dill. Beat the eggs lightly and add to the mixture, mixing well. Season with salt and pepper.",
        "3. Have the phyllo ready. Place the sheets in front of you and, using a sharp knife, cut lengthwise into 4 equal columns. Stack them, and keep the stack covered with a dry kitchen towel and then over that a damn kitchen towel. Preheat the oven to 350°F, and lightly oil 2 baking sheets.",
        "4. Remove 1 strip of phyllo, brush it lightly with olive oil, and place another strip on top. Brush that with oil, too. Place a teaspoon of the filling in the lower right-hand corner of the phyllo, about 1/2 inch from the edge. Fold up the right corner to form a right triangle, and continue folding, the way one folds a flag. Place seam side down on the baking sheet. Continue until the phyllo and filling are used up. Bake in the center of the oven for 12 to 15 minutes, or until puffed and golden. Serve warm."
    ],
    "ingredients": [
        "1/3 cup extra virgin olive oil, plus more for brushing pastries",
        "2 large onions, finely chopped (about 2 cups)",
        "1 1/2 cups (about 12 ounces) fresh Greek myzithra, whole milk ricotta, or farmer's cheese, crumbled",
        "3/4 cup (about 3 ounces) Greek feta, crumbled",
        "3/4 cup (about 2 ounces) grated Greek kefalotyri cheese or other hard sheep's milk cheese, such as pecorino",
        "1/2 cup thick Greek or Mediterranean-style yogurt or drained plain yogurt",
        "1/3 cup finely chopped fresh dill",
        "2 large eggs",
        "Salt and freshly ground black pepper to taste",
        "1 pound (about 18 sheets) commercial phyllo, defrosted and at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Onion",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Yogurt",
        "Feta",
        "Dill",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Three-Cheese Phyllo Triangles with Onions and Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/three-cheese-phyllo-triangles-with-onions-and-yogurt-109733"
}
