{
    "directions": [
        "In a standing electric mixer fitted with paddle attachment beat together yeast, sugar, and water and let stand 5 minutes, or until foamy. In a bowl stir together table salt and 5 cups flour. Stir oil into yeast mixture. With motor on low speed, gradually add flour mixture to yeast mixture. With dough hook knead dough 2 minutes, or until soft and slightly sticky.",
        "Transfer dough to a floured surface and knead in enough remaining flour to form a soft but not sticky dough. Form dough into a ball and put in an oiled large bowl, turning to coat. Cover bowl with a kitchen towel and let dough rise in a warm place until doubled in bulk, about 45 minutes.",
        "Transfer dough to a lightly floured surface and divide in half. Knead thyme into one half and knead plain half 1 minute. Form each half into an oval and invert bowl over them. Let dough rest 5 minutes for easier rolling.",
        "Preheat oven to 450° F.",
        "Oil two 13- by 9-inch baking pans and sprinkle each with 1 tablespoon cornmeal. On lightly floured surface with a floured rolling pin roll out dough halves into 13- by 9-inch rectangles and fit into pans. Cover each pan with a kitchen towel and let dough rise in a warm place until doubled in bulk, about 20 minutes.",
        "Sprinkle plain dough with Parmesan and sprinkle both doughs with coarse salt and pepper. With lightly oiled fingertips make indentations, about 1/2 inch deep and 1 inch apart, all over dough rectangles and bake in middle of oven 12 minutes, or until golden. Remove focaccie from pans and cool on racks."
    ],
    "ingredients": [
        "two 1/4-ounce packages (5 teaspoons) active dry yeast",
        "1 teaspoon sugar",
        "2 cups warm water (105°‐115° F.)",
        "1 tablespoon table salt",
        "about 5 1/2 cups all-purpose flour",
        "1/3 cup olive oil",
        "2 teaspoons minced fresh thyme leaves",
        "2 tablespoons cornmeal",
        "1/2 cup coarsely grated Parmesan",
        "coarse salt for sprinkling",
        "freshly ground black pepper for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Cheese",
        "Herb",
        "Bake",
        "Parmesan",
        "Thyme",
        "Gourmet"
    ],
    "title": "Thyme Focaccia and Parmesan Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/thyme-focaccia-and-parmesan-focaccia-14160"
}
