{
    "directions": [
        "Place the salmon pieces into a mixing bowl. Drizzle with 2 tablespoons of extra virgin olive oil, then toss with 4 cloves of crushed garlic. Refrigerate at least 30 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Line a baking sheet with aluminum foil. Place the salmon onto the foil, and season with salt and thyme. Fold the foil over the salmon to form a sealed pouch. Bake in the preheated oven until the salmon is no longer translucent in the center, 15 to 20 minutes.",
        "Meanwhile, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink, then return to the cooking pot.",
        "Melt the butter in a small saucepan over medium heat. Cook until the butter has browned lightly. Stir in the sage and garlic until the sage has wilted. Stir in 1 tablespoon of olive oil ,the frozen peas, the juice of 1 lime, and 1 1/2 teaspoons of salt. Stir into the pasta, and place into a serving bowl. Remove the salmon from the foil, and place onto the pasta. Squeeze another lime over top to serve."
    ],
    "ingredients": [
        "1 1/2 pounds skinned salmon fillet, cut into 4-inch pieces",
        "2 tablespoons extra virgin olive oil",
        "4 cloves garlic, crushed",
        "salt to taste",
        "1 teaspoon dried thyme leaves",
        "1 (12 ounce) package egg noodles",
        "2 tablespoons salted butter",
        "1/2 cup chopped fresh sage",
        "2 cloves crushed garlic",
        "1 tablespoon extra virgin olive oil",
        "2 cups frozen peas, thawed",
        "1 lime, juiced",
        "1 1/2 teaspoons salt",
        "1 lime, juiced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Thyme Salmon with Sage Pasta",
    "url": "http://allrecipes.com/recipe/214075/thyme-salmon-with-sage-pasta/"
}
