{
    "directions": [
        "Boil cider in large saucepan until reduced to 2/3 cup, about 28 minutes. Whisk in butter. Season glaze with 1 teaspoon coarse salt. DO AHEAD: Can be made 1 week ahead. Cover; chill. Rewarm; whisk before using.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 425°F. Butter 2 large rimmed baking sheets. Toss onions in large bowl with 2 teaspoons thyme and 3 tablespoons glaze. Arrange in single layer on 1 sheet. Toss apples in same bowl with 2 teaspoons thyme and 3 tablespoons glaze. Arrange in single layer on second sheet. Sprinkle onions and apples with coarse salt and pepper.",
        "Roast onions on upper oven rack 10 minutes. Place apples on bottom rack. Roast onions and apples 20 minutes. Remove both sheets from oven. Drizzle remaining glaze evenly over onions and apples. Reverse position of sheets. Roast 20 minutes longer.",
        "Increase oven temperature to 475°F. Roast onions and apples until tender and slightly caramelized, watching closely to prevent burning, about 10 minutes longer. Transfer onions and apples to large bowl. Season with coarse salt and pepper. Sprinkle with remaining 2 teaspoons thyme."
    ],
    "ingredients": [
        "4 cups apple cider",
        "5 tablespoons unsalted butter",
        "1 teaspoon coarse kosher salt plus additional for sprinkling",
        "6 7-to 8-ounce onions, halved through root end, each half cut into 6 wedges",
        "6 teaspoons coarsely chopped fresh thyme, divided",
        "6 Braeburn apples (about 2 3/4 pounds total), peeled, halved, cored, each half cut into 4 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Roast",
        "Thanksgiving",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Apple",
        "Fall",
        "Healthy",
        "Thyme",
        "Butter",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Thyme-Roasted Apples and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/thyme-roasted-apples-and-onions-355760"
}
