{
    "directions": [
        "Combine boiling water and morels in small bowl. Let stand until morels soften, about 35 minutes. Strain; reserve soaking liquid. Coarsely chop morels.",
        "Preheat oven to 400°F. Sprinkle chicken with salt and pepper. Heat oil in large nonstick skillet over medium-high heat. Add chicken to skillet; cook until golden, about 4 minutes per side. Transfer chicken to shallow baking dish (do not clean skillet). Bake until chicken is cooked through, about 15 minutes.",
        "Meanwhile, heat same skillet over medium-high heat. Add onion, garlic and thyme and sauté until golden, about 5 minutes. Add morel soaking liquid, leaving any residue in bowl. Boil mixture until most of liquid evaporates, about 4 minutes. Add chicken broth and 1/4 cup Madeira; boil until gravy is reduced to 1 1/2 cups, about 5 minutes. Strain gravy into small saucepan; add morels. Cover and simmer 5 minutes. Whisk 1 tablespoon cornstarch and remaining 1 tablespoon Madeira in small bowl. Whisk into gravy; simmer until thickened, about 30 seconds. Season gravy with salt and pepper. Spoon over chicken and serve."
    ],
    "ingredients": [
        "1 cup boiling water",
        "1 ounce dried morels, rinsed, drained",
        "2 chicken breast halves with skin",
        "1 tablespoon vegetable oil",
        "3/4 cup chopped onion",
        "2 large garlic cloves, minced",
        "1 tablespoon minced fresh thyme or 1 teaspoon dried",
        "1 1/2 cups canned low-salt chicken broth",
        "1/4 cup plus 1 tablespoon dry Madeira",
        "1 tablespoon cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Bake",
        "Sauté",
        "Fortified Wine",
        "Thyme"
    ],
    "title": "Thyme-Roasted Chicken Breast with Morel-Madeira Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/thyme-roasted-chicken-breast-with-morel-madeira-gravy-1678"
}
