{
    "directions": [
        "Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 7–10 minutes. Let cool.",
        "Pulse walnuts and whole wheat flour in a food processor until finely ground. Add all-purpose flour and salt and pulse to combine.",
        "Using your fingers, work thyme into granulated sugar in a small bowl until mixture starts to look moist and clump together. Using an electric mixer on medium-high speed, beat thyme sugar, butter, and powdered sugar in a large bowl until light and smooth, about 2 minutes. Reduce speed to low and gradually add dry ingredients and mix just until combined. Use a rubber spatula to mix in any remaining dry spots or flour at the bottom of the bowl.",
        "Transfer dough to a sheet of parchment paper and form into a 12\" log. Firmly roll up log in parchment paper, then wrap tightly in plastic. Chill on a flat surface until firm, at least 4 hours.",
        "Preheat oven to 350°. Slice off both ends of log to make neat edges, then remove plastic and parchment. Slice dough into 1/4\"-thick rounds and place on parchment-lined rimmed baking sheets, spacing about 1\" apart. Bake, rotating baking sheets halfway through, until edges of cookies are light golden but centers are still pale, 10–15 minutes. Let cookies cool on baking sheets 5 minutes, then transfer to wire racks and let cool completely.",
        "Whisk powdered sugar, orange zest, orange juice, cream, coconut oil, thyme, and salt in a medium bowl until no lumps remain.",
        "Using a spoon or small offset spatula, spread about 1 tsp. icing over each cooled cookie (you will have some icing left over). Let cookies sit until icing is set, at least 45 minutes.",
        "Dough can be made 1 day ahead. Keep chilled, or freeze up to 1 month.\nCookies can be frosted 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "2/3 cup walnuts",
        "1/2 cup whole wheat flour",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon kosher salt",
        "2 tablespoons chopped thyme",
        "1 tablespoon granulated sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup powdered sugar",
        "2 3/4 cups powdered sugar",
        "1/2 teaspoon finely grated orange zest",
        "1/4 cup fresh orange juice",
        "1 tablespoon heavy cream",
        "1 tablespoon virgin coconut oil, melted",
        "1 teaspoon thyme leaves",
        "1/4 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Walnut",
        "Nut",
        "Thyme",
        "Bake"
    ],
    "title": "Thyme–Walnut Sandies",
    "url": "http://www.epicurious.com/recipes/food/views/thyme-walnut-sandies"
}
