{
    "directions": [
        "In a bowl stir together flour, confectioners' sugar, and salt. With a pastry blender or fingertips blend in butter until mixture resembles coarse meal. In a small bowl stir together egg yolk and cold water. Add yolk mixture to flour mixture, 1 tablespoon at a time, tossing to incorporate until mixture forms a dough. On a work surface smear dough in several forward motions with heel of hand to develop gluten in flour and make dough easier to work with. Scrape dough together to form a ball and flatten to a 1-inch-thick disk. Chill dough, wrapped in plastic wrap, 30 minutes.",
        "Halve and core apples (do not peel) and cut crosswise into 1/4-inch slices. In a large bowl toss apple slices gently with wine.",
        "Preheat oven to 400°F.",
        "On a lightly floured surface roll out dough to a 15-inch round and transfer to a large baking sheet. Fold in edge 1 inch all around to form a border.",
        "Arrange apple slices on pastry round in overlapping concentric circles. Brush apple slices and pastry border with wine remaining in bowl and sprinkle with sugar.",
        "Bake galette 45 minutes, or until apples are tender and pastry border is golden. Cool galette on baking sheet on a rack.",
        "In a small saucepan simmer wine with jelly and thyme until liquid is reduced by half, about 15 minutes.",
        "Remove thyme with a slotted spoon and brush hot glaze generously over apple slices. Garnish galette with thyme sprigs and leaves."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/4 cup confectioners' sugar",
        "1 teaspoon salt",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into bits",
        "1 large egg yolk",
        "2 tablespoons cold water",
        "4 medium Gala or Empire apples (about 2 pounds)",
        "1/4 cup white wine",
        "1/3 cup sugar",
        "1/2 cup white wine",
        "1/2 cup apple jelly",
        "1/4 cup loosely packed fresh thyme sprigs",
        "Garnish: fresh thyme sprigs and 1 tablespoon fresh thyme leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Brunch",
        "Dessert",
        "Bake",
        "White Wine",
        "Fall",
        "Thyme",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Thyme-Scented Apple Galette",
    "url": "http://www.epicurious.com/recipes/food/views/thyme-scented-apple-galette-10892"
}
