{
    "directions": [
        "Sautépancetta in large nonstick skillet over medium heat until crisp. Transfer to small bowl. Add breadcrumbs and 1 tablespoon chopped sage to drippings in skillet; stir over medium-high heat until breadcrumbs are almost crisp, 5 minutes. Transfer to bowl with pancetta. Cool (reserve skillet).",
        "Place yams on plate and microwave on high until very soft, 5 to 8 minutes per side, depending on size of yam. Transfer yams to work surface. Cut yams in half lengthwise; scoop out pulp and place in medium glass bowl. Discard skin. Add remaining 11/2 teaspoons chopped sage and 1 tablespoon butter to yams; mash until almost smooth. Season to taste with salt and freshly ground black pepper.",
        "Sprinkle fish fillets with salt and freshly ground black pepper. Melt remaining 2 tablespoons butter in same nonstick skillet over medium-high heat. Add fish fillets and cook until golden brown on outside and just opaque in center, 3 to 4 minutes per side. If necessary, rewarm yams in microwave. Divide mashed yams among 4 plates. Top each serving with 1 fish fillet, sprinkle generously with pancetta-sage breadcrumbs, and serve."
    ],
    "ingredients": [
        "2 ounces thinly sliced pancetta (Italian bacon), chopped",
        "1 cup fresh breadcrumbs (from French or sourdough bread with crust, ground in processor)",
        "1 tablespoon plus 1 1/2 teaspoons chopped fresh sage",
        "2 pounds medium yams (red-skinned sweet potatoes), pierced all over with fork",
        "3 tablespoons butter, divided",
        "4 5-to 6-ounce tilapia fillets or eight 2-to 3-ounce fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Low Fat",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Bacon",
        "Tilapia",
        "Sweet Potato/Yam",
        "Healthy",
        "Sage",
        "Breadcrumbs",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tilapia and Mashed Yams with Pancetta-Sage Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/tilapia-and-mashed-yams-with-pancetta-sage-breadcrumbs-356710"
}
