{
    "directions": [
        "Boil potatoes until tender, about 20 minutes. Drain; return to pot. Add butter, 6 tablespoons cream, and thyme; mash. Season with salt and pepper. Do ahead Can be made 2 hours ahead. Let stand at room temperature. Rewarm over medium heat, stirring often and adding more cream by tablespoonfuls if dry.",
        "Simmer vinegar and garlic in small saucepan over medium heat until reduced to thick syrup, about 5 minutes. Set aside.",
        "Cook snap peas in boiling salted water until crisp-tender, about 1 minute. Drain. Return to same pan; set aside.",
        "Heat 1 tablespoon oil in each of 2 large skillets over high heat. Sprinkle fish with salt and pepper. Sauté fish until golden, about 2 minutes per side.",
        "Rewarm balsamic syrup over medium-low heat. Whisk in 1/2 cup butter 1 piece at a time. Add remaining 1 tablespoon butter to peas; stir over medium heat until warmed. Season with salt and pepper.",
        "Divide potatoes, tilapia, and peas among plates; drizzle with sauce."
    ],
    "ingredients": [
        "3 pounds russet or Yukon Gold potatoes, peeled, quartered",
        "4 1/2 tablespoons butter, room temperature",
        "6 tablespoons (or more) warm whipping cream",
        "1 1/2 tablespoons minced fresh thyme",
        "1/4 cup balsamic vinegar",
        "1 garlic clove, minced",
        "2 cups sugar snap peas, strings removed",
        "2 tablespoons olive oil",
        "6 4- to 5-ounce tilapia fillets",
        "1/2 cup (1 stick) plus 1 tablespoon chilled unsalted butter, cut into 1/2-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Garlic",
        "Potato",
        "Sauté",
        "High Fiber",
        "Vinegar",
        "Tilapia",
        "Thyme",
        "Sugar Snap Pea"
    ],
    "title": "Tilapia with Balsamic Butter Sauce, Thyme Mashed Potatoes, and Sugar Snap Peas",
    "url": "http://www.epicurious.com/recipes/food/views/tilapia-with-balsamic-butter-sauce-thyme-mashed-potatoes-and-sugar-snap-peas-236885"
}
