{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray.",
        "Sprinkle 1/4 teaspoon fajita seasoning over tilapia fillets and arrange on the prepared baking sheet.",
        "Bake tilapia in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes. Remove fish from oven and cut each fillet into 3 pieces.",
        "Spray a skillet with cooking spray and add corn, black beans, and 1/8 teaspoon fajita seasoning; cook and stir over medium-high heat until heated through, about 3 minutes. Remove skillet from heat.",
        "Spray a separate skillet with cooking spray and add pineapple; cook and stir over medium-high heat until lightly browned, about 2 minutes. Add onion to pineapple; cook and stir until heated through, about 1 minute more. Remove skillet from heat.",
        "Pour 1 teaspoon olive oil in a large skillet over high heat; add 4 tortillas and cook until heated through, about 30 seconds per side. Remove tortillas from skillet and repeat cooking the remaining tortillas in the remaining oil.",
        "Place a piece of tilapia onto each tortilla and top with corn mixture, pineapple mixture, cilantro, avocado, cabbage, sour cream and a squeeze of lime."
    ],
    "ingredients": [
        "cooking spray",
        "1/4 teaspoon fajita seasoning",
        "4 (4 ounce) tilapia fillets",
        "3/4 cup frozen white corn",
        "3/4 cup canned black beans",
        "1/8 teaspoon fajita seasoning",
        "2 pineapple rings, cut into chunks",
        "1/2 small red onion, chopped",
        "1 tablespoon olive oil, divided",
        "12 (6 inch) corn tortillas",
        "1/4 cup chopped fresh cilantro",
        "1 avocado, sliced",
        "1/8 head cabbage, chopped",
        "1/4 cup sour cream",
        "1/2 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tilapia Fish Tacos",
    "url": "http://allrecipes.com/recipe/238378/tilapia-fish-tacos/"
}
