{
    "directions": [
        "Heat oil in a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté guanciale and onion, stirring, until onion is golden, about 6 minutes. Add garlic and sauté, stirring, until golden, about 1 minute. Add tomatoes with reserved juice, water, sugar, and salt and simmer, uncovered, stirring occasionally, until thickened, about 30 minutes.",
        "Cover potatoes with salted cold water by 2 inches in a large pot, then simmer, uncovered, until very tender, about 25 minutes. Drain in a colander and, when cool enough to handle, peel.",
        "Force warm potatoes through ricer into a large bowl. Add flour and salt and stir with a wooden spoon until mixture begins to come together. Gently form dough into a ball and cut in half.",
        "Knead each dough half on a floured surface until smooth, about 1 minute (if dough sticks to surface, dust lightly with additional flour). Cut each half evenly into 10 pieces. Roll 1 piece into a 14-inch-long rope (1/2 inch thick), keeping remaining pieces covered with a kitchen towel. Cut rope crosswise into 1/4-inch pieces and toss pieces lightly with flour on work surface.",
        "Press a piece of dough against tines of a floured fork and push with a floured thumb in a forward rolling motion toward end of tines, letting gnocchetti fall from fork into a well-floured shallow baking pan. Make more gnocchetti in same manner.",
        "Just before cooking, gently shake gnocchetti in 4 batches in a large medium-mesh sieve to knock off excess flour. Cook gnocchetti in 4 batches in a 5- to 6-quart pot of boiling salted water until they float, about 1 minute. Transfer with a slotted spoon to a large shallow bowl as cooked and spoon some sauce on top."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "5 oz guanciale (cured pork jowl)* or pancetta, finely chopped (1/2 cup)",
        "1 large red onion, finely chopped (1 1/4 cups)",
        "1 small garlic clove, minced",
        "1 (28- to 32-oz) can plum tomatoes, drained (reserving juice) and finely chopped",
        "1/2 cup water",
        "1 teaspoon sugar",
        "1/2 teaspoon salt",
        "1 1/2 lb yellow-fleshed potatoes such as Yukon Gold",
        "1 1/2 cups all-purpose flour plus additional for dusting",
        "1 1/4 teaspoons salt",
        "Accompaniment: finely grated Pecorino Romano",
        "Special equipment: a potato ricer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Potato",
        "Tomato",
        "Sauté",
        "Winter",
        "Gourmet"
    ],
    "title": "Tiny Potato Dumplings with Tomato, Onion, and Guanciale Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tiny-potato-dumplings-with-tomato-onion-and-guanciale-sauce-107797"
}
