{
    "directions": [
        "Bring milk and cream just to a boil in a 3-quart heavy saucepan and remove from heat. Whisk together yolks, sugar, cornstarch, and a pinch of salt in a bowl and add hot milk mixture in a slow stream, whisking constantly. Pour custard into pan and boil, whisking, until thick and smooth, about 1 minute. Force custard through a fine sieve into a bowl. Set bowl of custard frosting in a larger bowl of ice and cold water, then cool, stirring occasionally, until cold. Chill frosting, its surface covered with plastic wrap to prevent a skin from forming, 2 hours.",
        "Preheat oven to 350°F. Butter 2 (8- by 2-inch) round cake pans and line bottoms with wax paper. Butter paper and dust with flour, knocking out excess. Sift together 1 1/2 cups cake flour, baking powder, and salt. Beat together butter, sugar, and vanilla in a large bowl with an electric mixer until light and fluffy. Add eggs, 1 at a time, then yolk, beating well after each addition. With mixer on low speed, alternately add milk and flour mixture in 4 batches, beginning and ending with milk (mixture will look curdled; do not overbeat).",
        "Divide batter between cake pans, smoothing tops. Bake in middle of oven until pale and a tester comes out clean, about 20 minutes. Run a thin knife around edges of pans and invert layers onto a rack. Carefully remove wax paper and cool layers completely.",
        "Halve cake layers horizontally with a long serrated knife. Arrange 1 cake half, cut side up, on a plate and brush with 2 tablespoons Sherry. Spread evenly with 3 tablespoons jam. Repeat with remaining 3 layers, ending with a layer cut side down. Brush top with Sherry. Frost cake with custard."
    ],
    "ingredients": [
        "1 cup whole milk",
        "3/4 cup heavy cream",
        "4 large egg yolks",
        "1/2 cup sugar",
        "5 teaspoons cornstarch",
        "1 1/2 cups cake flour (not self-rising)",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 1/4 sticks unsalted butter, softened",
        "1/2 cup sugar",
        "3/4 teaspoon vanilla",
        "2 large eggs",
        "1 large egg yolk",
        "3/4 cup whole milk",
        "8 tablespoons sweet Sherry, brandy, or dessert wine",
        "9 tablespoons strawberry jam",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Sherry",
        "Birthday",
        "Chill",
        "Jam or Jelly",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tipsy Cake",
    "url": "http://www.epicurious.com/recipes/food/views/tipsy-cake-103211"
}
