{
    "directions": [
        "Heat oven to 350°F with rack in middle. Butter pan and line bottom and sides with 1 sheet of parchment paper. Butter paper and dust with additional flour, knocking out excess.",
        "Beat together yolks, vanilla, and 1/2 cup sugar in a large bowl with an electric mixer at high speed until thick and pale and mixture forms a ribbon that takes 2 seconds to dissolve when beaters are lifted, 5 to 8 minutes in a stand mixer or 8 to 12 minutes with a handheld. Sift half of flour over yolks and fold it in gently but thoroughly, then sift and fold in remaining flour.",
        "Beat whites with salt and cream of tartar in a large metal bowl with cleaned beaters at medium speed until they just hold soft peaks. Beat in remaining 2 tablespoons sugar, 1/2 tablespoon at a time, and continue to beat until whites just hold stiff peaks.",
        "Fold 1/4 of whites into yolk mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Stir 1/2 cup batter into melted butter in a small bowl until combined, then fold butter mixture into batter gently but thoroughly. Spread batter evenly in sheet pan and rap once on counter to help eliminate air bubbles.",
        "Bake until top of cake springs back when gently pressed with finger, 7 to 10 minutes.",
        "Sift top of hot cake evenly with confectioners' sugar and cover cake with a clean kitchen towel (not terry cloth) followed by a baking sheet. Holding sheet and cake pan together with oven mitts, flip cake onto cloth on baking sheet. Carefully peel off and discard parchment paper.",
        "With a long side nearest you and using towel as an aid, roll up cake in towel, jelly-roll style, keeping it wrapped in towel. Cool cake completely, seam-side down in towel, on a rack.",
        "Bring espresso and sugar to a boil in a small saucepan, stirring until sugar dissolves, then boil until reduced to a scant 1/4 cup. Remove pan from heat and stir in Cognac, then cool to room temperature.",
        "Slowly mix mascarpone, sugar, cinnamon, and Cognac in a large bowl with an electric mixer until combined. If mixture is very loose after adding sugar, beat mixture briefly to thicken slightly (see Cooks' notes).",
        "Beat heavy cream in another bowl with same beaters at medium speed until it just holds stiff peaks. Fold whipped cream into mascarpone mixture.",
        "Put chopped chocolate in a large bowl. Heat cream in a small saucepan over medium heat until it just comes to a boil, then pour over chocolate and let stand 3 minutes. Stir slowly with a whisk until smooth. If bits of chocolate remain unmelted, set bowl over a pan of barely simmering water and heat, stirring gently, until completely smooth, and remove from pan. Stir in corn syrup. Chill, stirring a couple of times, until it thickens to an easily spreadable consistency, about 15 to 20 minutes.",
        "Gently unroll cooled cake on a baking sheet, keeping it on towel, then arrange baking sheet so that long side of cake that was inside roll is nearest to you. Brush all of cooled espresso syrup all over surface of cake. Spread filling with offset spatula evenly over cake, leaving a 1/2-inch border all around. Starting from long side nearest you, roll up cake without towel, leaving it seam-side down on baking sheet. Gently brush off any excess confectioners' sugar.",
        "Cut a 1 1/2-inch-long diagonal slice from each end of roll and reserve. Transfer cake, using 2 metal slotted spatulas as aids, seam-side down on platter. Using ganache as \"glue,\" attach end pieces, diagonal sides down, on top and side of log to resemble branches.",
        "Spread ganache all over roll and branches with offset spatula, making it resemble tree bark (see Cooks' notes).",
        "Arrange a few meringue mushrooms, if using, around Yule log, and very lightly sift a little cocoa over log and mushrooms first, followed by a little confectioners' sugar to resemble a light dusting of snow."
    ],
    "ingredients": [
        "1/2 cup sifted cake flour (not self-rising; sift before measuring), plus additional for dusting pan",
        "5 large eggs, separated, left at room temperature for 30 minutes",
        "1 teaspoon vanilla",
        "1/2 cup plus 2 tablespoons granulated sugar, divided",
        "1/4 teaspoon salt",
        "1/4 teaspoon cream of tartar",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "2 tablespoons confectioners' sugar",
        "1/2 cup espresso or very strong black coffee",
        "2 tablespoons sugar",
        "1 tablespoon Cognac or brandy",
        "8 ounces mascarpone cheese",
        "1/4 cup granulated sugar",
        "1/4 teaspoon ground cinnamon",
        "1 tablespoon Cognac or brandy",
        "1/2 cup chilled heavy cream",
        "12 ounces 60% bittersweet chocolate, finely chopped",
        "3/4 cup heavy cream",
        "2 tablespoons light corn syrup",
        "Meringue mushrooms",
        "Unsweetened cocoa for dusting",
        "Confectioners' sugar for dusting",
        "Special equipment: A 15- by 10- by 1-inch rimmed sheet pan (aka jelly-roll pan; small offset spatula (optional, but really helpful); long rectangular or oval platter or wooden serving board"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Bake",
        "Christmas",
        "Cognac/Armagnac",
        "Winter",
        "Christmas Eve",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tiramisu Yule Log",
    "url": "http://www.epicurious.com/recipes/food/views/tiramisu-yule-log-51142210"
}
