{
    "directions": [
        "On a baking sheet toast the pound cake slices in one layer in the middle of a preheated 350 °F. oven for 8 to 10 minutes, or until they are colored lightly and dry. In a small bowl stir together the rum and the Kahlúa, brush the slices on both sides with the mixture, and let them cool on a rack.",
        "In a bowl with an electric mixer beat the whole eggs and the sugar until the mixture is thick and very pale and beat in the vanilla, a pinch of salt, and the mascarpone until the mixture is combined well. In a bowl beat the egg white until it holds soft peaks and beat it into the mascarpone mixture. Chill the mixture until it is cold and freeze it in an ice-cream freezer according to the manufacturer's instructions.",
        "In a bowl with an electric mixer beat the eggs and the sugar until the mixture is thick and very pale and beat in the vanilla, the milk, the cream, and the espresso mixture, cooled. Chill the mixture until it is cold and freeze it in an ice-cream freezer according to the manufacturer's instructions.",
        "Line a loaf pan 9 by 5 by 3 inches, with plastic wrap, letting the plastic wrap hang over the edges by several inches, Arrange one row of cake slices, overlapping them slightly, down the middle of the pan, pack in half the mascarpone ice cream, smoothing it, and sprinkle the top with 3 tablespoons of the chocolate. Arrange one layer of the cake slices, overlapping them slightly, to cover the chocolate completely, pack in the espresso ice cream, smoothing it, and sprinkling the top with 3 tablespoons of the remaining chocolate. Arrange another layer of cake slices in the same manner, pack in the remaining mascarpone ice cream, smoothing it, and arrange any remaining cake slices on top, packing the cake in firmly. Fold the plastic wrap over the top and freeze the cake overnight. Invert the cake onto a platter, discarding the plastic wrap, and sprinkle any remaining chocolate decoratively over the top."
    ],
    "ingredients": [
        "a 10- to 12-ounce frozen pound cake, partially defrosted and sliced crosswise into 1/4 inch-thick slices (about 28)",
        "3 tablespoons dark rum",
        "2 tablespoons Kahlúa",
        "2 large whole eggs",
        "1/2 cup sugar",
        "1/2 teaspoon vanilla",
        "2 cups mascarpone (about 17 1/2 ounces, available at most cheese shops and some specialty food shops)",
        "1 large egg white",
        "2 large eggs",
        "1/2 cup sugar",
        "1 teaspoon vanilla",
        "1/2 cup milk",
        "1 1/2 cups heavy cream",
        "4 tablespoons instant espresso powder dissolved in 3 tablespoons boiling water",
        "3 ounces fine-quality bittersweet chocolate, grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Kahlúa",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tiramisu Ice-Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/tiramisu-ice-cream-cake-11308"
}
