{
    "directions": [
        "Position racks in top and bottom thirds of oven and preheat to 350°F. Butter one 12-inch-diameter cake pan with 3-inch-high sides, one 9-inch-diameter cake pan with 3-inch-high sides and one 6-inch-diameter cake pan with 3-inch-high sides.* Line bottoms with parchment. Sift flour, baking powder and salt into medium bowl. Using handheld electric mixer, beat butter in 12-quart bowl on medium-high speed until light. Gradually add sugar and beat until well blended. Beat in extracts. On medium-low speed, beat in dry ingredients alternately with milk in 3 additions each, beating just until combined (batter will be thick).",
        "Using electric mixer fitted with clean dry beaters, beat whites in another large bowl until stiff but not dry. Fold 1/3 of whites into batter to lighten. Fold in remaining whites. Spoon batter into prepared pans so that depth of batter is the same in each pan; smooth tops. Bake until tops are deep golden brown and tester inserted into center comes out clean, about 55 minutes for 6-inch cake, about 1 hour 5 minutes for 9-inch cake and about 1 hour 20 minutes for 12-inch cake. Cool cakes in pans on racks 20 minutes. Run knife around pan sides to loosen cakes. Turn out cakes onto racks and peel off parchment. Cool cakes completely.",
        "Mix all ingredients in heavy large saucepan. Boil over medium-high heat until mixture is reduced to 2 2/3 cups, stirring occasionally, about 10 minutes. Cool syrup completely.",
        "Using electric mixer, beat cream cheese in large bowl until light. Gradually add sugar and beat until fluffy. Add cream, Marsala and vanilla and beat until well blended. Cover and let stand at room temperature up to 1 hour.",
        "Finely grind chopped chocolate in processor (do not overprocess or chocolate will clump together). Using serrated knife, cut each cake horizontally into 3 equal layers. Spread dab of frosting on 6-inch cardboard round; top with bottom layer of 6-inch cake, cut side up. Brush cake with 2 tablespoons syrup. Spread 1/2 cup frosting over. Sprinkle with 2 tablespoons ground chocolate. Top with middle 6-inch cake layer. Brush with 2 tablespoons syrup. Spread 1/2 cup frosting over. Sprinkle with 2 tablespoons ground chocolate. Brush 2 tablespoons syrup over cut side of top 6-inch cake layer. Using hands, turn cake layer over and place cut side down atop frosted layers. Cover and refrigerate cake.",
        "Spread dab of frosting on 9-inch cardboard round; top with bottom layer of 9-inch cake, cut side up. Brush with 1/4 cup syrup. Spread 1 cup frosting over. Sprinkle with 1/4 cup ground chocolate. Top with middle 9-inch cake layer. Brush with 1/4 cup syrup. Spread 1 cup frosting over. Sprinkle with 1/4 cup ground chocolate. Brush 1/4 cup syrup over cut side of top 9-inch cake layer. Slide large tart pan bottom or springform cake pan bottom under cake layer. Using pan bottom as aid, lift cake layer and turn cut side down atop frosted layers. Cover and refrigerate cake.",
        "Spread dab of frosting on 12-inch cardboard round; top with bottom layer of 12-inch cake, cut side up. Brush with 1/2 cup syrup. Spread 2 cups frosting over. Sprinkle with 1/2 cup ground chocolate. Top with middle 12-inch cake layer. Brush with 1/2 cup syrup. Spread 2 cups frosting over. Sprinkle with 1/2 cup ground chocolate. Brush 1/2 cup syrup over cut side of top 12-inch cake layer. Slide large tart pan bottom or cake pan bottom under cake. Using pan bottom as aid, lift cake layer and turn cut side down atop frosted layers. Cover cake; refrigerate all cakes until firm, about 4 hours. Cover remaining frosting and let stand at room temperature.",
        "Place 12-inch cake on its cardboard on large flat platter. Place platter on cake stand. Using icing spatula, spread 4 cups frosting over top and sides of cake; smooth top. Swirl frosting decoratively on sides of cake. Press 1 dowel into center of 12-inch cake. Mark dowel 1/4 inch above top of cake. Remove dowel and cut with serrated knife at marked point. Cut 4 more dowels to same length. Press 4 cut dowels into 12-inch cake, inserting 4 inches inward from cake edges and spacing evenly; press 1 dowel into center of cake. Refrigerate cake on platter.",
        "Place 9-inch cake on its cardboard on large flat plate or tart pan bottom. Place plate on cake stand. Using icing spatula, spread 3 cups frosting over top and sides of cake; smooth top. Swirl frosting decoratively on sides of cake. Press 1 dowel into center of 9-inch cake. Mark dowel 1/4 inch above top of cake. Remove dowel and cut at marked point. Cut remaining 3 dowels to same length. Press 4 cut dowels into 9-inch cake, inserting 3 inches inward from cake edges and spacing evenly. Refrigerate 9-inch cake on plate.",
        "Place 6-inch cake on its cardboard on another large flat plate or tart pan bottom. Place plate on cake stand. Using icing spatula, spread 2 cups frosting over top and sides of cake; smooth top. Swirl frosting decoratively on sides of cake. Refrigerate all cakes until frosting sets, about 2 hours. (Can be made 1 day ahead. Cover cakes and remaining frosting separately with plastic wrap; chill. Bring frosting to room temperature before continuing.)",
        "Using metal spatula as aid, gently place 9-inch cake on its cardboard atop 12-inch cake, centering carefully on dowels. Gently place 6-inch cake on its cardboard atop dowels in 9-inch cake.",
        "Spoon remaining frosting into pastry bag fitted with medium star tip. Pipe decorative border around base of 12-inch cake and around top edge of each tier. Arrange berries decoratively inside piped borders atop each tier. (Can be prepared 8 hours ahead; refrigerate.)",
        "Let cake stand at room temperature at least 3 and up to 6 hours before serving. Garnish with mint.",
        "Toss berries with sugar in large bowl. Let stand at least 30 minutes and up to 2 hours at room temperature.",
        "Remove top and middle cake tiers. Remove dowels from middle cake. Cut top and middle cakes into slices; transfer to plates. remove dowels from bottom cake. Starting 3 inches inward from edge of bottom cake and cutting through from top to bottom, cut 6-inch-diameter circle in center of cake. Cut outer portion of cake into slices, then cut inner portion into slices. Spoon berries around cake slices."
    ],
    "ingredients": [
        "7 1/2 cups unbleached all purpose flour",
        "3 tablespoons baking powder",
        "2 teaspoons salt",
        "2 3/4 cups (5 1/2 sticks) unsalted butter, room temperature",
        "5 2/3 cups sugar",
        "2 1/2 tablespoons vanilla extract",
        "2 teaspoons almond extract",
        "3 3/4 cups whole milk (do not use low-fat or nonfat)",
        "18 large egg whites (about 2 1/3 cups), room temperature",
        "2 cups Kahlúa or other coffee liqueur",
        "1 1/2 cups water",
        "1/2 cup plus 1 tablespoon instant espresso powder or coffee powder",
        "14 8-ounce packages cream cheese, room temperature",
        "7 cups powdered sugar",
        "2 1/3 cups chilled whipping cream",
        "7 tablespoons sweet Marsala",
        "3 1/2 tablespoons vanilla extract",
        "12 ounces semisweet chocolate, chopped",
        "1 6-inch-diameter cardboard cake round",
        "1 9-inch-diameter cardboard cake round",
        "1 12-inch-diameter cardboard cake round",
        "1 11-inch-diameter revolving cake stand (optional)",
        "9 12-inch-long, 1/4-inch-diameter wood dowels",
        "4 1/2 cups assorted berries (such as raspberries, blueberries, blackberries and strawberries)",
        "Fresh mint sprigs",
        "12 cups mixed berries (such as raspberries, blueberries, blackberries and hulled, quartered strawberries)",
        "6 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Berry",
        "Cheese",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Wedding",
        "Summer",
        "Chill"
    ],
    "title": "Tiramisu Wedding Cake with Mixed Berries",
    "url": "http://www.epicurious.com/recipes/food/views/tiramisu-wedding-cake-with-mixed-berries-289"
}
