{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place cake mix and 1 1/4 cup of water in a large glass or metal mixing bowl; beat with an electric mixer on low speed for 30 seconds to mix the ingredients. Change mixer speed to medium and beat 1 minute more.",
        "Pour the batter into an ungreased 9x13-inch baking pan.",
        "Bake in the preheated oven on the center rack until the cake is golden brown and a toothpick inserted into the middle comes out clean, 35 to 45 minutes.",
        "Remove cake from the oven, allow to cool completely, and remove from the pan. Cut the cake horizontally into 2 layers. Place 1 layer onto a serving platter to serve as the bottom of the cake; set the second layer aside.",
        "Mix instant coffee with 3/4 cup of water in a bowl until dissolved; drizzle the coffee mixture evenly over the bottom cake layer.",
        "Drizzle coffee liqueur over the bottom cake layer.",
        "Beat 8 ounces cream cheese, 1/2 cup cream, butter, and French vanilla pudding mix with an electric mixer in a bowl until the mixture is smooth and creamy, about 3 minutes.",
        "Spread pudding mixture over the bottom cake layer.",
        "Place the top cake layer onto the filling.",
        "Beat 4 ounces cream cheese, 2 tablespoons cream, confectioners' sugar, and vanilla extract with an electric mixer in a bowl until smooth.",
        "Spread the frosting over the top and sides of the cake. Refrigerate leftovers."
    ],
    "ingredients": [
        "1 (18.25 ounce) package angel food cake mix",
        "1 1/4 cups water",
        "1 (3.3 gram) packet instant coffee (such as Starbucks VIA®)",
        "3/4 cup water",
        "3 tablespoons coffee-flavored liqueur",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup heavy cream",
        "2 tablespoons butter, softened",
        "1 (3.5 ounce) package instant French vanilla pudding mix",
        "1 (4 ounce) package cream cheese, softened",
        "2 tablespoons heavy cream",
        "1 cup confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tiramisu Angel Cake",
    "url": "http://allrecipes.com/recipe/220000/tiramisu-angel-cake/"
}
