{
    "directions": [
        "For the cupcakes: Preheat the convection oven to 325 degrees F. Line 24 regular cupcake pans with liners.",
        "Rough chop the chocolate covered coffee beans and set aside. Combine the flour, baking powder and salt in a bowl. In a stand mixer fitted with the paddle attachment, cream the butter and sugar on medium speed until light and fluffy, 4 to 8 minutes. Slowly add the eggs, one at a time, scraping the bowl as needed. Add the vanilla extract. On low speed, gradually alternate adding the flour mixture and the milk, beginning and ending with the dry ingredients.",
        "When the batter is smooth, divide evenly into the cupcake liners. Sprinkle 1 teaspoon crushed coffee beans on each cupcake. Bake until lightly browned and fully cooked through, about 15 minutes. Cool completely.",
        "For the espresso syrup: In a small saucepan, combine 1/3 cup water, sugar and espresso powder. Heat over medium-high heat until the sugar is completely melted, stirring occasionally. Remove from the heat and stir in the coffee liqueur.",
        "For the mascarpone cream: In a medium bowl, combine the mascarpone, confectioners' sugar, coffee liqueur and vanilla extract. Place the heavy cream in the bowl of a stand mixer. Using the whisk attachment, whip the cream until soft peaks form. Gradually fold one-third of the whipped cream into the mascarpone mixture. Continue folding in the cream in two more additions.",
        "To assemble: Using a fork, poke holes in the tops of the baked cupcakes. Gradually spoon 2 tablespoons of espresso syrup over each cupcake. Place the mascarpone cream in a piping bag fitted with a metal tube and pipe desired amount of cream onto each cupcake. Dust with cocoa powder and sprinkle with chocolate shavings.",
        "This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."
    ],
    "ingredients": [
        "Crushed chocolate covered coffee beans",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "2 sticks (8 ounces) unsalted butter",
        "2 cups sugar",
        "4 eggs",
        "1 teaspoon vanilla extract",
        "1 cup milk",
        "1/3 cup sugar",
        "2 tablespoons espresso powder",
        "2 tablespoons coffee liqueur",
        "One 8-ounce container mascarpone",
        "1/2 cup confectioners' sugar",
        "2 tablespoons coffee liqueur",
        "1 1/2 teaspoons vanilla extract",
        "1 cup heavy cream",
        "Cocoa powder, for garnish",
        "Chocolate shavings, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cupcake",
        "Chocolate",
        "Cupcake",
        "Baking",
        "Dessert",
        "Tiramisu",
        "Cheese",
        "Coffee Recipes"
    ],
    "title": "Tiramisu Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/tiramisu-cupcakes-recipe4"
}
