{
    "directions": [
        "Heat currants, maple extract, and 1 tablespoon water in a saucepan over low heat until currants are soft, about 5 minutes. Set aside to cool to room temperature, about 10 minutes.",
        "Preheat oven to 450 degrees F (230 degrees C). Spray 24 muffin cups or individual tart pans with cooking spray.",
        "Whisk flour and 1 teaspoon salt together in a large bowl. Cut in shortening and cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Add ice water, 1 tablespoon at a time, tossing with a fork, until flour mixture is moistened. Do not add more water than you need: when you squeeze a handful of the moistened pastry mixture, it should form a ball. Divide dough in half and shape into balls.",
        "Roll out one half of dough on a lightly-floured surface. Cut tart shells out of dough with a 3 1/2-inch circular cutter, and press into prepared tins. Repeat with the remaining dough. Cover tins; set aside.",
        "Heat brown sugar, 2/3 cup butter, cream, and vanilla over low heat until smooth, stirring occasionally; remove from heat. Whisk a few spoonfuls of the warm butter mixture into beaten eggs, then whisk egg mixture into the butter mixture.",
        "Divide the currants, along with their liquid, into the bottom of the prepared tart shells. Fill each shell about 3/4-full with butter mixture. Place a pecan half on top of each tart.",
        "Bake tarts in the preheated oven for 8 minutes. With oven door closed, reduce temperature to 350 degrees F (180 degrees C); continue baking until filling is bubbly, about 10 minutes. Remove from oven; allow to cool for a few minutes before loosening tarts from pan with a knife. Remove tarts to cool completely on a wire rack."
    ],
    "ingredients": [
        "1 cup dried currants",
        "1 tablespoon maple extract",
        "1 tablespoon water",
        "Pastry:",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1 cup shortening (such as Tenderflake®)",
        "1/4 cup cold butter",
        "1/3 cup ice water",
        "Filling:",
        "2 cups brown sugar",
        "2/3 cup butter",
        "1/4 cup heavy whipping cream",
        "2 teaspoons vanilla extract",
        "2 eggs, lightly beaten",
        "24 pecan halves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "To-Die-For Butter Tarts",
    "url": "http://allrecipes.com/recipe/239116/to-die-for-butter-tarts/"
}
