{
    "directions": [
        "Place a rack in upper third of oven; preheat to 375°F. Pulse bacon in a food processor, scraping down sides as needed, until very finely chopped, about 1 minute; transfer to the bowl of a stand mixer and wipe out food processor. Add veal and pork to bacon and mix with your hands to combine.",
        "Pulse whole garlic cloves and half of onion in food processor until finely chopped. Add one-fourth of meat mixture along with breadcrumbs, milk, coriander, red pepper flakes, allspice, paprika, 1 tsp. salt, and 1/4 tsp. black pepper and process until well blended, about 1 minute. Transfer to bowl with remaining meat mixture. Mix briefly on low speed with paddle attachment until uniform in texture, about 1 minute.",
        "Working one at a time, form mixture into golf ball-size portions (about 3-tablespoonfuls each); roll between your palms, pressing lightly to compact.",
        "Place meatballs in a broilproof 11x9\" baking dish; pour broth over. Cook until meatballs are firm to the touch, 18–20 minutes. Heat broiler. Broil meatballs until browned, about 1 minute.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and toss in a medium bowl with 1 Tbsp. oil.",
        "Meanwhile, thinly slice remaining onion half. Heat 1 Tbsp. oil in a large skillet, preferably cast iron, over medium. Cook mushrooms, half of sliced onion, and half of chopped garlic, stirring occasionally, until mushrooms are tender and beginning to crisp around the edges, about 5 minutes; season with salt and black pepper. Transfer mushroom mixture to a plate.",
        "Wipe out skillet. Heat 1 Tbsp. oil over medium and cook kale and remaining onion and chopped garlic. Cook, stirring occasionally, until kale is tender but not limp, about 4 minutes; season with salt and pepper. Transfer to plate with mushroom mixture.",
        "Wipe out skillet again and heat remaining 2 Tbsp. oil over medium-high. Cook pasta undisturbed 1 minute (you want it to fry in the oil, resulting in lovely crisp edges); toss pasta. Repeat process several times until pasta is well-crisped.",
        "Add sliced garlic and mushroom-kale mixture to pasta; season with black pepper. Cook, stirring occasionally until heated through, about 2 minutes.",
        "Transfer pasta to a large bowl. Arrange meatballs on top of pasta and ladle hot cooking liquid over. Top with Parmesan.",
        "Meatballs can be formed 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "2 ounces smoked bacon (about 4 slices), frozen",
        "8 ounces ground veal",
        "8 ounces ground pork",
        "8 garlic cloves, 2 whole, 4 finely chopped, 2 thinly sliced",
        "1 onion, halved, divided",
        "1/2 cup dried breadcrumbs",
        "2 tablespoons milk",
        "1/2 teaspoon coriander, ground",
        "1/8 teaspoon crushed red pepper flakes",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon hot smoked Spanish paprika",
        "1 teaspoon kosher salt, plus more",
        "1/4 teaspoon freshly ground black pepper, plus more",
        "2 cups low-sodium chicken broth",
        "12 ounces orecchiette",
        "5 tablespoons olive oil, divided",
        "8 ounces maitake mushrooms, tough stems removed, torn into pieces",
        "1 bunch Tuscan kale, ribs and stems removed, leaves chopped",
        "Finely grated Parmesan (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bacon",
        "Veal",
        "Pork",
        "Garlic",
        "Pasta",
        "Dinner",
        "Kid-Friendly",
        "Mushroom",
        "Kale",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Toasted Orecchiette With Veal Meatballs",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-orecchiette-with-veal-meatballs"
}
