{
    "directions": [
        "Stir sugar, cornstarch and salt in heavy medium saucepan. Gradually whisk in half and half, then yolks. Whisk over medium heat until custard thickens and boils, about 8 minutes (custard may be lumpy; whisk until smooth). Remove from heat. Whisk in extracts. Transfer to medium bowl. Press plastic onto surface; chill until cold and firm,at least 4 hours.",
        "Beat 1/2 cup cream in medium bowl until stiff peaks form. Whisk 1/4 of cream into filling to loosen. Fold remaining cream into filling; then fold in ground almonds. Cover and refrigerate up to 1 day.",
        "Preheat oven to 375°F. Rollout dough disk on floured surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish. Fold overhang under; crimp edge, forming high-standing rim. Press whole almonds on diagonal into crust edge, spacing 1/2 inch apart. Pierce crust all over with fork. Freeze 10 minutes. Line with foil and beans or pie weights.",
        "Bake crust until sides are set, about 15 minutes. Remove foil and beans. Bake until cooked through and pale golden, covering edge with foil if nuts brown too quickly and piercing with fork if crust bubbles, about 10 minutes. Transfer to rack; cool. Spoon filling into crust; chill.",
        "Reserve 1/4 cup berries. Transfer remaining berries to processor; puree. Firmly press puree through sieve into measuring cup. If necessary, stir in enough reserved juice to yield 1 cup. Transfer 1/2 cup puree to saucepan; mix in crème de cassis. Sprinkle gelatin over. Let stand 15 minutes. Add sugar. Stir over medium-low heat until gelatin dissolves and mixture begins to simmer, about 2 minutes. Mix in remaining 1/2 cup puree. Chill just until cold but not set, 30 minutes.",
        "Spoon topping over filling; chill until set, at least 3 hours and up to 1 day.",
        "Garnish pie with whipped cream and reserved berries."
    ],
    "ingredients": [
        "5 tablespoons sugar",
        "3 tablespoons cornstarch",
        "Large pinch of salt",
        "1 1/3 cups half and half",
        "4 large egg yolks",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/2 cup chilled whipping cream",
        "1/2 cup whole blanched almonds, toasted, coarsely ground",
        "1Easy Pastry Dough disk",
        "1/2 cup whole blanched almonds",
        "1 1-pound package frozen boysenberries, thawed, drained, juice reserved",
        "1 tablespoon crème de cassis",
        "1 3/4 teaspoons unflavored gelatin",
        "6 tablespoons sugar",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Almond",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Toasted Almond Cream Pie with Boysenberry Topping",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-almond-cream-pie-with-boysenberry-topping-4418"
}
