{
    "directions": [
        "Whisk 1 cup flour, cornstarch, salt, and baking powder in a medium bowl. Using an electric mixer, beat butter, sugar, and powdered sugar in another medium bowl until pale yellow and well blended, about 3 minutes. Add egg; beat to blend, occasionally scraping bowl. Add dry ingredients in 3 batches, beating just to blend between additions. Gather dough into a ball; flatten into a disk. Wrap in plastic and chill for at least 1 hour. DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Preheat oven to 375°F. Roll out dough on a lightly floured surface to a 12\" round. Transfer to pan. Press onto bottom and up sides of pan. Trim dough flush with top of pan (reserve any scraps in case needed for patching crust after baking). Prick dough all over with a fork and freeze for 10 minutes.",
        "Line chilled tart shell with foil or parchment paper, leaving a 1\" overhang. Fill with pie weights or dried beans. Bake until edges of crust are just beginning to turn golden brown, 35-40 minutes. Remove foil and pie weights. Patch any cracks in crust with reserved dough. Return to oven; continue baking until golden all over, 15-20 minutes. Transfer to a wire rack; let cool completely. DO AHEAD: Can be made 1 day ahead. Store airtight in pan at room temperature.",
        "Preheat oven to 350°F. Place tart pan on a rimmed baking sheet; set aside. Spread out pistachios, hazelnuts, and pine nuts on 3 separate small rimmed baking sheets. Toast nuts until fragrant and light brown, about 5 minutes for pistachios, 10 minutes for pine nuts, and 20 minutes for hazelnuts. Let nuts cool completely.",
        "Melt butter in a small saucepan over medium-high heat. Cook, stirring occasionally, until golden-brown bits form on bottom of pan, about 5 minutes. Remove from heat and set aside.",
        "Stir brown sugar, corn syrup, salt, and vanilla in a medium bowl. Stir in eggs, then whisk in browned butter. Fold in nuts. Pour filling into tart shell.",
        "Bake tart, rotating pan halfway through, until filling is set around edges and jiggles slightly in center when nudged, about 1 hour. Loosely tent foil over tart if crust gets too dark. Transfer to a wire rack to cool. DO AHEAD: Can be made 1 day ahead. Let stand at room temperature. Dust with powdered sugar just before serving. Serve with pistachio or hazelnut gelato, if desired."
    ],
    "ingredients": [
        "1 cup all-purpose flour plus more for surface",
        "2 tablespoons cornstarch",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon baking powder",
        "1/4 cup (1/2 stick) unsalted butter, room temperature, cut into 1/2\" cubes",
        "1/4 cup sugar",
        "2 tablespoons powdered sugar",
        "1 large egg",
        "1/2 cup natural unsalted pistachios, coarsely chopped",
        "1/2 cup toasted hazelnuts, skins rubbed off, coarsely chopped",
        "1/4 cup pine nuts",
        "1/4 cup (1/2 stick) unsalted butter",
        "1 cup (packed) dark brown sugar",
        "1 cup light corn syrup",
        "1 teaspoon kosher salt",
        "1 teaspoon vanilla extract",
        "3 large eggs",
        "Powdered sugar (for dusting)",
        "Pistachio or hazelnut gelato (optional)",
        "Special equipment: A 9\"-diameter tart pan with a removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Low Sodium",
        "Pine Nut",
        "Pistachio",
        "Fall",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Toasted Nut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-nut-tart-368287"
}
