{
    "directions": [
        "In a small saucepan heat 2 teaspoons olive oil over moderate heat until hot but not smoking and cook shallots, stirring, until golden brown. Stir in cranberries, 3 tablespoons vinegar, water, and sugar and simmer mixture, stirring occasionally, until syrupy, about 4 minutes. Transfer mixture to a bowl and cool to room temperature.",
        "In a small skillet heat 1 teaspoon olive oil over moderate heat until hot but not smoking and cook hazelnuts with salt and pepper to taste, stirring, until golden brown, about 3 minutes. Transfer nuts to a plate and cool.",
        "In a small bowl whisk together mustard and remaining tablespoon vinegar with salt and pepper to taste. In a stream whisk in hazelnut oil and remaining 2 tablespoons olive oil until emulsified.",
        "In a large bowl toss greens with just enough dressing to coat and divide among 6 plates. Sprinkle salads with cranberry mixture and hazelnuts. Serve salad with soup as a main course or align as a first course."
    ],
    "ingredients": [
        "3 tablespoons olive oil, or to taste",
        "2 large shallots, chopped fine (about 1/2 cup)",
        "1/2 cup dried cranberries (about 2 ounces)",
        "4 tablespoons Sherry vinegar, or to taste",
        "3 tablespoons water",
        "1 tablespoon sugar",
        "1/2 cup hazelnuts (about 2 ounces), toasted lightly and skinned",
        "1/2 teaspoon Dijon mustard",
        "1 tablespoon hazelnut oil if desired",
        "3 cups baby Bibb lettuce (about 3 medium heads)",
        "2 cups frisée (about 2 ounces)",
        "2 cups baby spinach or tatsoi (thick, spoon shaped Asian greens), about 2 ounces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetarian",
        "Lunch",
        "Cranberry",
        "Spinach",
        "Vegan",
        "Hazelnut",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Toasted Hazelnut Salad with Dried Cranberries and Hazelnut Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-hazelnut-salad-with-dried-cranberries-and-hazelnut-vinaigrette-14282"
}
