{
    "directions": [
        "Preheat oven to 350°F. and grease a 9-inch springform pan.",
        "Rub hot toasted nuts in a kitchen towel to remove some of skins, then cool completely.",
        "Pulse nuts, cake meal, and 1/4 cup sugar in a food processor until nuts are very finely chopped, being careful not to process to a paste.",
        "Beat yolks and 1/2 cup sugar in a large bowl with an electric mixer on high speed until pale and very thick. Stir in zest.",
        "Beat whites with salt in another bowl with cleaned beaters on high speed until soft peaks form. Gradually beat in remaining 1/4 cup sugar and beat until whites just hold stiff, glossy peaks.",
        "In 3 batches, alternately fold nut mixture and whites into yolk mixture.",
        "Spoon batter into pan and smooth top.",
        "Bake cake in middle of oven until golden and a tester comes out clean, about 35 minutes. Cool in pan on a rack 3 minutes, then loosen edge with a knife and remove side of pan. Cool completely. (Cake will sink slightly in center.)",
        "Invert cake onto a rack set over a shallow baking pan. Carefully loosen bottom of pan and remove. Pour warm glaze over cake, allowing it to drip down sides, and spread to coat evenly. Chill until glaze is set, about 5 minutes."
    ],
    "ingredients": [
        "1 1/2 cups hazelnuts (8 ounces), toasted",
        "1/4 cup matzo cake meal",
        "1 cup sugar",
        "4 large eggs, separated, at room temperature",
        "1 teaspoon finely grated fresh lemon zest",
        "1/4 teaspoon salt",
        "Warm Sweet Chocolate Glaze"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Passover",
        "Spring",
        "Kosher",
        "Hazelnut",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Toasted-Hazelnut Cake",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-hazelnut-cake-103338"
}
