{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add onions; cook until just beginning to color, stirring often, about 20 minutes. Add sugar and cook until onions are deep golden brown and very soft, stirring occasionally, about 25 minutes. Remove from heat. Mix in vinegar and raisins. Season caramelized onions to taste with salt and pepper. Cool. (Can be made 3 days ahead. Cover and refrigerate.)",
        "Arrange 4 bread slices on work surface. Top with cheese, dividing equally. Top each with 1/4 cup caramelized onions. Top with remaining bread slices to form 4 sandwiches. Spread half of butter over tops of sandwiches. Heat heavy large skillet over medium heat. Add sandwiches, buttered side down. Spread remaining butter over tops of bread. Partially cover and cook until bottoms are brown, about 3 minutes. Turn sandwiches over. Cook until second sides brown, about 3 minutes. Transfer to cutting board. Cut each sandwich into 6 wedges."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 large white onions, thinly sliced",
        "2 tablespoons (packed) golden brown sugar",
        "2 tablespoons rice vinegar",
        "2 tablespoons chopped golden raisins",
        "8 5 1/2x3x1/2-inch slices rustic country bread, such as walnut, pecan, or walnut-raisin",
        "2 6-ounce wedges soft blue cheese (such as Cambazola, rind trimmed, or Gorgonzola dolcelatte), sliced",
        "1/4 cup (1/2 stick) butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Onion",
        "Appetizer",
        "Sauté",
        "Blue Cheese",
        "Raisin",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Toasted Blue Cheese and Caramelized Onion Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-blue-cheese-and-caramelized-onion-sandwiches-107686"
}
