{
    "directions": [
        "Combine mayonnaise, sour cream, cilantro, green onions, ground chipotle peppers, lime juice, garlic basil spread, cumin, salt, and black pepper in a small bowl. Stir until combined. Cover and refrigerate for at least 1 hour.",
        "Preheat oven to 500 degrees F (260 degrees C).",
        "Heat olive oil in large skillet over medium-high heat. Stir onions, red pepper flakes, and oregano in the hot oil until onions begin to soften, about 5 minutes. Season with salt and ground black pepper to taste. Add half the jalapeno pepper rings and cook until they begin to soften, 2 to 3 minutes. Reserve remaining jalapeno rings.",
        "Spread each ciabatta roll with 1 tablespoon sweet hot mustard and 2 tablespoons chipotle mayonnaise. Evenly divide the Swiss cheese slices, slices of pork loin, ham, dill pickles, and remaining jalapeno rings among the four sandwiches. Top with cooked onion mixture.",
        "Place sandwiches onto a baking sheet and bake in the preheated oven until cheese is melted and bread is toasted and warm, 4 to 5 minutes."
    ],
    "ingredients": [
        "Chipotle Mayonnaise:",
        "1 1/2 cups mayonnaise",
        "1/2 cup sour cream",
        "1/4 cup chopped fresh cilantro",
        "1/4 cup diced green onions",
        "1 1/2 tablespoons ground chipotle peppers",
        "1 tablespoon lime juice",
        "1 tablespoon garlic basil spread (see footnote for recipe link)",
        "1 teaspoon ground cumin",
        "salt and ground black pepper to taste",
        "Fillings:",
        "2 tablespoons olive oil",
        "2 sweet onions, sliced",
        "1 teaspoon red pepper flakes",
        "1 teaspoon dried oregano",
        "2 jalapeno peppers cut into rings, divided",
        "4 ciabatta sandwich rolls, sliced horizontally",
        "1/4 cup sweet hot mustard, divided",
        "1/2 pound sliced Swiss cheese, divided",
        "1/2 pound sliced deli roast pork loin, divided",
        "1/2 pound sliced ham, divided",
        "2 dill pickles, cut into strips lengthwise - divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Toasted Cuban Sandwich",
    "url": "http://allrecipes.com/recipe/229856/toasted-cuban-sandwich/"
}
