{
    "directions": [
        "Heat chocolate and 1/4 cup cream in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until chocolate is melted and mixture is smooth. Let ganache cool slightly, then scrape into pie crust and spread evenly over bottom. Let sit until set, 30–45 minutes.",
        "Preheat oven to 300°F. Mix brown sugar, cornmeal, salt, and butter in a medium bowl with a wooden spoon until no lumps remain. In a separate medium bowl, whisk eggs, milk, vanilla, and remaining 2/3 cup cream until no streaks remain. Whisking constantly, gradually add egg mixture to butter mixture and whisk just until combined and smooth. Pour filling into crust and place on a foil-lined rimmed baking sheet. Bake until filling is browned and puffed around the edges and the center 4\" wobbles when pie is jostled, 55–70 minutes. Transfer to a wire rack and let cool, at least 4 hours and up to 12 hours (longer is better; do not refrigerate).",
        "Using an electric mixer on medium-high, beat corn syrup, 1 egg white, and 1/4 tsp. salt in a medium bowl until mixture is white, glossy, and tripled in volume, about 2 minutes. Reduce speed to low; gradually add powdered sugar. Increase speed to medium and beat until mixture falls back on itself in a thick, barely dissolving ribbon, about 2 minutes. Beat in vanilla. Set aside 3/4 cup marshmallow fluff in a small bowl; reserve remaining fluff for another use.",
        "Heat granulated sugar, cream of tartar, and remaining 2 egg whites in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), whisking constantly, until mixture is warm (not hot) and sugar is dissolved, about 2 minutes (rub a bit between your fingers to check; it should be free of grit).",
        "Using an electric mixer on high speed, beat until stiff, glossy peaks form and the sides of bowl are cool to the touch, 5–7 minutes. Add reserved marshmallow fluff to meringue and beat just to combine. Dollop marshmallow topping over top of cooled pie filling and use a spatula to spread, creating decorative peaks and swirls. Use a kitchen torch to toast marshmallow topping, if desired. Decorate with chocolate chips.",
        "Pie (without marshmallow topping) can be made 1 day ahead. Let cool, then store covered at room temperature."
    ],
    "ingredients": [
        "2 ounces bittersweet chocolate, chopped",
        "1/4 cup plus 2/3 cup heavy cream",
        "1 blind-baked Sister Pie Crust, cooled",
        "1 1/4 cups (packed) dark brown sugar",
        "1/4 cup fine-grind yellow cornmeal",
        "1/4 teaspoon kosher salt",
        "1/2 cup (1 stick) unsalted butter, melted",
        "3 large eggs, room temperature",
        "3 tablespoons whole milk",
        "1 teaspoon vanilla extract",
        "2/3 cup light corn syrup",
        "3 large egg whites, room temperature",
        "1/4 teaspoon kosher salt",
        "2/3 cup powdered sugar",
        "1 teaspoon vanilla extract",
        "2/3 cup plus 1 tablespoon granulated sugar",
        "1/2 teaspoon cream of tartar",
        "3 tablespoons semisweet or bittersweet chocolate chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Marshmallow",
        "Butterscotch/Caramel",
        "Bake"
    ],
    "title": "Toasted Marshmallow Butterscotch Pie",
    "url": "http://www.epicurious.com/recipes/food/views/toasted-marshmallow-butterscotch-pie"
}
