{
    "directions": [
        "Brown the brisket. Heat the oven to 325°F. Mix together the salt, paprika, mustard seed, and pepper in a small bowl. Rub the spice mixture all over the brisket. Heat the oil in a large heavy skillet over medium-high heat. Add the brisket and cook until brown on both sides, turning once—5 to 7 minutes per side.",
        "Bake the brisket. Transfer the brisket to a baking dish just large enough to hold it. Then add the rosemary, thyme, and garlic. Add the chopped vegetables and pour in the veal stock, wine, and vinegar. Cover the dish with heavy-duty aluminum foil and bake until the brisket is fork-tender—3 to 4 hours. Transfer the brisket temporarily to a plate while you strain the liquid through a mesh strainer into a small saucepan (discard the herbs, vegetables, and garlic) and wash and dry the baking dish.",
        "Press the brisket. Return the brisket to the clean baking dish. Place another heavy dish on top of it, directly on the meat, to weight it down. The ideal weight for this is 2. pounds, so add some canned goods to the top dish. Then wrap the entire assemblage in foil (over weights and all) and refrigerate overnight and until shortly before ready to serve.",
        "Make the sauce. Meanwhile, heat the strained braising liquid over medium heat until it is reduced to about 2. cups—about 20 minutes. The finished sauce should have a glaze-like consistency. Taste the sauce and add salt or pepper if you wish. Refrigerate the sauce until ready to reheat the brisket.",
        "Complete the brisket. Shortly before ready to serve, remove the brisket from refrigerator and transfer to a cutting board. Also remove the sauce. Cut the brisket into 3-inch cubes: You don't want to waste any of the meat, so the cubes don't need to be exactly this size or perfect along the edges. Place the brisket in a pan just large enough to hold it in a single layer. Pour in enough sauce to just cover the meat (you may add a little stock or water if there isn't enough sauce to do this). Heat over low heat until warmed through—about 10 minutes. Spoon the brisket onto a serving platter; pour the sauce over and serve."
    ],
    "ingredients": [
        "2 tablespoons salt",
        "1 tablespoon smoked paprika",
        "1 tablespoon mustard seed",
        "1 teaspoon freshly ground black pepper",
        "One 3-pound beef brisket, trimmed of excess fat",
        "2 tablespoons canola oil",
        "2 sprigs fresh rosemary",
        "2 sprigs fresh thyme",
        "3 garlic cloves, crushed",
        "1 carrot, chopped",
        "2 celery rib, chopped",
        "1 small onion, chopped",
        "4 cups veal stock",
        "2 cups dry red wine (such as Cabernet Sauvignon)",
        "1/2 cup balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Bake",
        "Passover",
        "Meat",
        "Brisket",
        "Chill",
        "Kosher for Passover",
        "Advance Prep Required"
    ],
    "title": "Todd's Modern Day Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/todds-modern-day-brisket-51154000"
}
