{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with a silicone liner or parchment paper.",
        "Place tofu in a large bowl; crumble into small pieces using a pastry blender. Add cornmeal, rolled oats, oat bran, ground flax seeds, Dijon mustard, steak seasoning, soy sauce, Worcestershire sauce, paprika, oregano, liquid smoke, brown sugar, and black pepper.",
        "Place grated mushrooms in a large skillet over medium heat; cook and stir until they soften and release their liquid, 3 to 5 minutes. Add to tofu mixture in the bowl; stir well to combine.",
        "Place onion and garlic in the same skillet; cover and cook until softened, about 5 minutes. Stir into tofu mixture in the bowl.",
        "Place parsley in the skillet and cook, covered, until wilted, 3 to 5 minutes. Mix into tofu mixture. Add enough wine to make the mixture moist enough to shape into balls. Arrange balls on the lined baking sheet.",
        "Bake meatballs in the preheated oven until browned and crisp on the outside, about 1 hour."
    ],
    "ingredients": [
        "1 (14 ounce) package firm tofu (such as Nasoya® Lite Firm), drained",
        "1/4 cup cornmeal",
        "1/4 cup rolled oats",
        "1/4 cup oat bran",
        "1/4 cup ground flax seeds",
        "2 tablespoons Dijon mustard",
        "1 1/2 tablespoons steak seasoning (such as Mrs. Dash®)",
        "1 tablespoon soy sauce",
        "1 tablespoon vegan Worcestershire sauce",
        "2 teaspoons smoked paprika",
        "1 teaspoon dried oregano",
        "1/2 teaspoon liquid smoke",
        "1/2 teaspoon brown sugar",
        "fresh cracked black pepper, or to taste",
        "8 ounces mushrooms, grated, or more to taste",
        "1 onion, minced",
        "1 clove garlic, minced, or more to taste",
        "1 bunch parsley, minced",
        "1 splash dry red wine, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tofu Meatballs with No Fat Added",
    "url": "http://allrecipes.com/recipe/246926/tofu-meatballs-with-no-fat-added/"
}
