{
    "directions": [
        "Bring 1 1/2 tablespoons sake just to boil in small saucepan. Remove from heat. Mix in white miso and 1 teaspoon sugar. Mix in yuzu and shiso, if desired. Set white miso sauce aside.",
        "Bring remaining 1 1/2 tablespoons sake just to boil in another small saucepan. Remove from heat. Mix in red miso and remaining 6 teaspoons sugar. Set red miso sauce aside.",
        "Combine 4 cups water and dashi-kombu in medium saucepan. Bring just to simmer over high heat, then immediately remove broth from heat (to prevent dashi-kombu from becoming bitter). Add bonito; let stand until bonito settles at bottom of pan, about 20 minutes.",
        "Strain broth into large saucepan. Mix in soy sauce and mirin. Bring to boil. Reduce heat and simmer 10 minutes to blend flavors. Set broth aside.",
        "Line large rimmed baking sheet with foil. Cut tofu into 2 x 1 x 1/2-inch rectangles. Add tofu rectangles to broth and simmer over medium-low heat 10 minutes to flavor tofu. Using slotted spoon, carefully remove tofu rectangles and place on prepared baking sheet. Cool tofu. DO AHEAD: Sauces and tofu can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat broiler. Starting at 1 short end of tofu, insert skewer through center, extending to opposite short end. Repeat with remaining tofu and skewers. Brush half of tofu pieces (top only) with red miso mixture. Brush remaining tofu pieces (top only) with white miso mixture. Place sheet of foil over exposed portion of skewers to prevent burning. Broil tofu 6 to 8 inches from heat source until golden brown and charred in spots, watching closely, 2 to 4 minutes. Remove foil. Transfer skewers to platter. Sprinkle with sesame seeds."
    ],
    "ingredients": [
        "3 tablespoons sake, divided",
        "1/4 cup white miso",
        "7 teaspoons sugar, divided",
        "1/2 teaspoon finely grated yuzu peel (optional)",
        "1 tablespoon chopped shiso leaf (optional)",
        "1/4 cup red miso",
        "4 cups water",
        "1 3 x 5-inch piece dashi-kombu (dried seaweed)",
        "1 cup dried shaved bonito flakes",
        "1/3 cup light soy sauce",
        "1/3 cup mirin (sweet Japanese rice wine)",
        "20 ounces extra-firm tofu, well drained",
        "20 6- to 8-inch-long wooden skewers",
        "Toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Broil",
        "Low Fat",
        "Low Cal",
        "High Fiber",
        "Tofu",
        "Sake",
        "Healthy",
        "Low Cholesterol",
        "Soy Sauce",
        "New York",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Tofu Dengaku",
    "url": "http://www.epicurious.com/recipes/food/views/tofu-dengaku-357333"
}
