{
    "directions": [
        "Wash leeks in a bowl of cold water, then lift out and drain well.",
        "Dissolve 1/2 teaspoon salt in 2 cups hot water in a medium bowl, and add tofu. Soak 5 minutes, then drain in a sieve.",
        "Heat a wok or 12-inch heavy skillet over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add oil, swirling wok to coat, and heat until it begins to smoke. Add beef and stir-fry, breaking up lumps, until no longer pink, about 2 minutes. Stir in wine and 1/2 teaspoon soy sauce and stir-fry 30 seconds.",
        "Add chile bean sauce and stir-fry until fragrant, about 15 seconds. Add ginger, chile powder, and black beans and stir-fry until fragrant, about 30 seconds. Add broth, remaining 1/2 teaspoon soy sauce, and tofu, then reduce heat and simmer, stirring gently, about 2 minutes.",
        "Add leeks and simmer, stirring occasionally, until just tender, 2 to 3 minutes. Stir potato starch mixture and add to tofu, then cook, stirring, until sauce is thickened, about 1 minute."
    ],
    "ingredients": [
        "2 baby leeks (1/2 lb total; white and pale green parts only), cut diagonally into 1/8-inch-thick slices",
        "10 oz soft or firm tofu (not silken or extra-firm), drained and cut into 1/2-inch cubes",
        "1 tablespoon peanut oil",
        "1/4 lb ground beef",
        "1 teaspoon Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "1 teaspoon dark soy sauce",
        "1/2 tablespoon Chinese chile bean sauce or paste",
        "1 teaspoon minced peeled fresh ginger",
        "1 teaspoon mild pure chile powder",
        "1/2 teaspoon Chinese fermented black beans, soaked in water 10 minutes and drained",
        "1/4 cup chicken broth",
        "1/2 teaspoon potato starch or cornstarch mixed with 2 teaspoons cold water",
        "Accompaniment: white rice",
        "Garnish: 1/2 teaspoon Sichuan peppercorns, toasted and ground with a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Stir-Fry",
        "Quick & Easy",
        "Dinner",
        "Ground Beef",
        "Tofu",
        "Leek",
        "Gourmet",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Tofu and Leek Stir-Fry with Ground Beef",
    "url": "http://www.epicurious.com/recipes/food/views/tofu-and-leek-stir-fry-with-ground-beef-107984"
}
