{
    "directions": [
        "Stir together pork, wine, and salt in a small bowl.",
        "Cut tofu lengthwise into 1/4-inch-thick slices, then cut each slice crosswise into thirds. Blot tofu pieces between layers of paper towels to absorb excess moisture. Repeat with 1 or 2 changes of dry paper towels.",
        "Heat 1 cup peanut oil in wok over high heat until thermometer registers 375°F. Cook tofu in 5 or 6 batches, stirring to keep slices from sticking together and turning over as needed, until golden, 1 to 2 minutes per batch. Transfer tofu as fried with a slotted spoon to paper towels to drain. Return oil to 375°F between batches. Carefully transfer oil to a heatproof container to cool (before discarding), then wipe wok clean.",
        "Reheat wok over high heat until smoking, then add remaining 3 tablespoons peanut oil, swirling to coat wok evenly. Add chiles and garlic and stir-fry until fragrant, about 1 minute. Add pork mixture and stir-fry until no longer pink, 1 to 2 minutes, then add black beans and stir-fry until fragrant, about 1 minute. Add stock, tofu, and soy sauce and simmer 3 minutes.",
        "Stir together potato starch and water in a small bowl, then add to tofu mixture in wok and simmer, stirring until sauce is thickened, about 1 minute. Add scallion greens, stirring until just wilted, then remove from heat and stir in sesame oil. Stir in chile oil to taste."
    ],
    "ingredients": [
        "3 oz pork tenderloin (preferably from tail end), thinly sliced crosswise (1/3 cup)",
        "1 teaspoon Chinese Shaoxing cooking wine or medium-dry Sherry",
        "1/4 teaspoon salt",
        "1 (14- to 16-oz) block of firm tofu",
        "1 cup plus 3 tablespoons peanut oil",
        "2 (4- to 5-inch) fresh mild red chiles (sometimes called finger chiles), thinly sliced diagonally, then seeded",
        "1 tablespoon finely chopped garlic",
        "2 1/2 to 3 tablespoons Chinese fermented black beans, rinsed well and drained",
        "3/4 cup chicken stock or reduced-sodium chicken broth",
        "1/4 teaspoon dark soy sauce",
        "3/4 teaspoon potato starch",
        "1 tablespoon water",
        "3 scallions, greens thinly sliced diagonally (reserve remainder for another use)",
        "1/2 teaspoon Asian sesame oil",
        "1 to 2 teaspoons Asian chile oil",
        "Special equipment: a well-seasoned 14-inch flat-bottomed wok; a deep-fat thermometer",
        "Accompaniment: white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Chicken",
        "Garlic",
        "Onion",
        "Pepper",
        "Pork",
        "Soy",
        "Stir-Fry",
        "Gourmet"
    ],
    "title": "Tofu, Fried, with Pork and Black-Bean Sauce (Peng's Home-Style Bean Curd)",
    "url": "http://www.epicurious.com/recipes/food/views/tofu-fried-with-pork-and-black-bean-sauce-pengs-home-style-bean-curd-236021"
}
