{
    "directions": [
        "Cook kale in large pot of boiling salted water until tender, about 5 minutes. Drain. Cool; squeeze dry. Heat oil in heavy large skillet over medium heat. Add onion and garlic and sauté until tender, about 7 minutes. Cool.",
        "Finely chop tofu, cheeses, dill and flour in processor. Transfer to bowl. Stir in onion mixture, kale and sun-dried tomatoes. Season with salt and pepper.",
        "Preheat oven to 350°F. Spray large baking sheet with oil spray. Stack 2 phyllo sheets, one atop the other, on work surface; spray phyllo with oil spray. Top with 2 more phyllo sheets. Spray with oil spray. Repeat with remaining 2 phyllo sheets. Spread tofu mixture lengthwise down center of phyllo in 3-inch-wide strip, leaving about 1 1/2-inch border on each short side. Fold short sides of phyllo in over filling, then roll up into log, enclosing filling completely. Spray phyllo log with oil spray. Transfer strudel to prepared baking sheet.",
        "Bake strudel until golden brown, about 40 minutes. (Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 350°F oven until heated through, about 15 minutes.) Cool 10 minutes. Cut strudel crosswise into 6 pieces. Place on plates. Spoon Red Pepper Sauce alongside."
    ],
    "ingredients": [
        "1 bunch kale, stems and ribs cut away and discarded, leaves finely chopped (about 4 cups)",
        "1 tablespoon olive oil",
        "1 1/2 cups chopped onion",
        "3 garlic cloves, minced",
        "7 ounces firm tofu (half of one 14-ounce package), drained, cut into 1/2-inch pieces",
        "4 ounces grated reduced-fat provolone cheese",
        "1/2 cup grated Asiago cheese",
        "2 tablespoons chopped fresh dill",
        "1 1/2 teaspoons all purpose flour",
        "6 oil-packed sun-dried tomato halves, patted dry, chopped",
        "Nonstick olive oil spray",
        "6 frozen phyllo pastry sheets, thawed",
        "Red Pepper Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Dairy",
        "Leafy Green",
        "Pepper",
        "Soy",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Side",
        "Bake",
        "Vegetarian",
        "Dinner",
        "Tofu",
        "Kale",
        "Fall",
        "Healthy",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Tofu, Greens and Sun-Dried Tomato Strudel with Red Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tofu-greens-and-sun-dried-tomato-strudel-with-red-pepper-sauce-103891"
}
