{
    "directions": [
        "Place tofu on a rimmed baking sheet layered with paper towels; top with several more paper towels and press gently to squeeze out excess liquid. Transfer tofu to a shallow baking dish.",
        "Give garlic, soy sauce, chili paste, cilantro, and ginger a whirl in a blender, scraping down the sides as needed, until smooth, about 3 minutes (consistency will be similar to ketchup). Pour over tofu and turn to coat. Chill at least 2 hours.",
        "Do ahead: Tofu can be marinated 12 hours ahead. Cover and keep chilled.",
        "Place rice in a sieve and rinse under cold running water, rubbing with your fingers, until water runs clear. (This yields fluffy grains that won't clump.) Let drain 5 minutes.",
        "Transfer rice to a medium saucepan; cover with 3 cups water and season with salt. Bring to a boil. Reduce heat, cover, and simmer until rice is tender and liquid is absorbed, 12–15 minutes.",
        "Remove saucepan from heat and fluff rice with a fork. Cover with a kitchen towel, then replace lid. Let sit 10 minutes for steam to absorb.",
        "Pour oil into a medium pot to a depth of 2\" and fit pot with thermometer. Heat oil over medium-high until thermometer registers 350°.",
        "Place cornstarch in a shallow bowl. Working in batches, remove tofu from marinade (do not scrape it off) and toss in cornstarch; shake off excess. Working in batches, fry tofu, turning occasionally, until golden brown, about 3 minutes. Transfer to a wire rack set inside a rimmed baking sheet; let drain.",
        "Divide rice among bowls. Make a small well in the center of each and nestle a poached egg inside. Top with fried tofu, then kimchi, cilantro, basil, scallions, peanuts, and sesame seeds."
    ],
    "ingredients": [
        "1 14 ounce package extra-firm tofu, drained, cut into 8 pieces",
        "1 small head garlic, cloves coarsely chopped (about 1/4 cup)",
        "1/2 cup soy sauce",
        "1/4 cup hot chili paste (such as sambal oelek)",
        "1/4 cup coarsely chopped fresh cilantro",
        "1 1/2 teaspoons coarsely chopped peeled ginger",
        "2 cups short-grain rice",
        "Kosher salt",
        "Vegetable oil (for frying; about 4 cups)",
        "1/2 cup cornstarch",
        "4 poached eggs",
        "1 cup kimchi",
        "1 cup cilantro leaves",
        "1/2 cup basil leaves",
        "Thinly sliced scallions (for serving)",
        "1/4 cup unsalted, roasted peanuts, lightly crushed",
        "2 tablespoons toasted sesame seeds",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Tofu",
        "Hot Pepper",
        "Soy Sauce",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tofu Yum-Yum Rice Bowl",
    "url": "http://www.epicurious.com/recipes/food/views/tofu-yum-yum-rice-bowl-56389364"
}
