{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Stir bread crumbs, 3 tablespoons Parmesan cheese, 2 teaspoons oregano, salt, and black pepper together in a bowl.",
        "Place tofu in a bowl of cold water. Place mushrooms in a separate bowl of cold water. Remove 1 mushroom from water; press mushroom into bread crumb mixture and turn to coat all sides. Transfer breaded mushroom to a plate. Repeat with remaining mushrooms and tofu slices.",
        "Heat 2 tablespoons olive oil in a skillet over medium heat. Cook breaded tofu and mushrooms in hot oil until browned on one side, 2 to 3 minutes. Drizzle a little olive oil over the top, turn mushrooms and tofu slices, and cook until browned on the other side, about 2 minutes more.",
        "Whisk tomato sauce, garlic, remaining oregano, and basil together in a bowl until sauce is smooth. Spread a thin layer of sauce into the bottom of an 8-inch square baking dish. Arrange tofu slices in a single layer over sauce, and top each tofu slice with a mushroom. Spoon remaining sauce over mushrooms and tofu; top with mozzarella cheese and remaining Parmesan cheese.",
        "Bake in the preheated oven until cheese melts and mixture is bubbling, about 20 minutes."
    ],
    "ingredients": [
        "1 cup seasoned bread crumbs",
        "1/2 cup grated Parmesan cheese, divided",
        "4 teaspoons dried oregano, divided",
        "salt and ground black pepper to taste",
        "1 (12 ounce) package firm tofu, cut into four 1/4-inch thick slices",
        "4 portobello mushrooms, stems removed",
        "1/4 cup olive oil, divided",
        "1 (8 ounce) can tomato sauce",
        "2 cloves garlic, minced",
        "1/2 teaspoon dried basil",
        "6 ounces shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tofu and Portobello Mushroom Parmigiana",
    "url": "http://allrecipes.com/recipe/240229/tofu-and-portobello-mushroom-parmigia/"
}
