{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Stir eggs and soy sauce together in a bowl. Heat a non-stick skillet over medium heat; pour in egg mixture and cook until firm, 3 to 5 minutes. Slide eggs onto work surface and cut into bite-size cubes.",
        "Heat sesame oil and canola oil in a large skillet over medium heat. Add tofu; cook until golden brown on all sides, 8 to 10 minutes. Transfer tofu to a plate. Add mushrooms and broccoli to skillet; cook until broccoli is tender, 5 to 7 minutes.",
        "Place cashews in a baking dish; cook in preheated oven, tossing occasionally to avoid burning, until toasted, 8 to 12 minutes.",
        "Place edamame in a microwave-safe bowl, cover and cook in the microwave until hot, 1 to 2 minutes.",
        "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in egg noodles, bring back to a boil, and cook over medium heat until tender yet firm to the bite, about 8 minutes. Drain.",
        "Combine soy milk, peanut butter, coconut milk, and tahini together in a large saucepan over medium heat. Stir until peanut butter and tahini have dissolved, 2 to 4 minutes. Add egg, tofu, mushroom and broccoli mixture, edamame, and egg noodles; toss to combine. Top with toasted cashews to serve."
    ],
    "ingredients": [
        "4 eggs",
        "1 tablespoon soy sauce, or to taste",
        "1 tablespoon sesame oil, or as needed",
        "canola oil, or as needed",
        "1 (12 ounce) package extra-firm tofu, cubed",
        "2 cups sliced fresh mushrooms",
        "2 cups broccoli florets",
        "1/4 cup chopped cashews",
        "1 (10 ounce) package frozen shelled edamame (green soybeans)",
        "1 (16 ounce) package egg noodles",
        "1/2 cup unsweetened soy milk",
        "1/2 cup peanut butter",
        "1/4 cup reduced-fat coconut milk",
        "1 teaspoon tahini"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tofu Egg Noodles In Coconut Sauce",
    "url": "http://allrecipes.com/recipe/246092/tofu-egg-noodles-in-coconut-sauce/"
}
