{
    "directions": [
        "1.Preheat oven to 325°F. Season the lamb with salt and pepper.",
        "2.Heat 3 tablespoons oil in a pot over medium-high heat. Add the celery, carrot, and onion; cook until very soft, 8 to 10 minutes.",
        "3.Add the tomato paste and cook 1 to 2 minutes. Add the thyme, bay leaf, peppercorns, anchovies, and garlic; cook 3 minutes.",
        "4.Add the wines, vinegar, and sugar; raise the heat to high and bring to a boil. Lower the heat to medium and add the broths. Leave over medium heat while you brown the lamb shanks.",
        "5.Pour the remaining 1/4 cup of olive oil into a sauté pan. Over medium-high heat, brown the lamb shanks well on all sides, using tongs to flip them over.",
        "6.Transfer lamb shanks to a roasting pan and pour the braising liquid on top. Cover with aluminum foil and cook in the preheated oven for 1 hour. Remove the foil and cook 2 1/2 to 3 hours more, turning the shanks over every half hour until the meat is very soft.",
        "7.Remove the shanks from the braising liquid and strain the liquid. Skim any fat that rises to the surface, then use the liquid as a sauce. Serve in shallow bowls atop White Bean Puree."
    ],
    "ingredients": [
        "6 lamb foreshanks",
        "Coarse salt and pepper, to taste",
        "3 tablespoons plus 1/4 cup olive oil",
        "2 ribs of celery, roughly chopped",
        "1 carrot, roughly chopped",
        "1 onion, roughly chopped",
        "1/3 cup tomato paste",
        "5 sprigs of fresh thyme",
        "1 bay leaf",
        "8 whole black peppercorns",
        "3 anchovy fillets",
        "1 whole head of garlic, cut in half crosswise",
        "2 cups red wine",
        "1 cup white wine",
        "1/3 cup white-wine vinegar",
        "1 teaspoon sugar",
        "2 cups beef broth and 2 cups chicken broth",
        "White Bean Puree , for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Tomato",
        "Vegetable",
        "Braise",
        "Dinner",
        "Vinegar",
        "Lamb Shank",
        "Red Wine",
        "White Wine",
        "Winter",
        "Parade",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tom Valenti's Lamb Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/tom-valentis-lamb-shanks-105869"
}
