{
    "directions": [
        "Pulse salt, sugar, and 1 1/4 cups flour in a food processor until well combined. Add butter and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining, about 10 seconds. With the motor running, add 1/4 cup ice water and process until dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers; if it's very crumbly, add more ice water, 1 Tbsp. at a time (2 Tbsp. maximum). Do not over-process.",
        "Turn dough out onto a lightly floured surface and push together to form a rough ball. Knead a few times to combine, then roll into a ball. Flatten ball into a disc with smooth edges (no cracks), cover with plastic wrap, and chill at least 1 hour or up to overnight.",
        "Line a rimmed baking sheet with several layers of paper towels. Arrange tomato slices on prepared sheet, sprinkle with 1/4 tsp. salt, and cover with more paper towels. Let drain at least 30 minutes.",
        "Position rack in bottom rung of oven and preheat to 350°F. After dough has chilled, lightly flour work surface and roll out dough to a 13\" round. Roll dough loosely around rolling pin, then release into pie pan. Trim edges to leave a 1\" overhang and crimp as desired. Freeze dough at least 15 minutes.",
        "Line crust with parchment paper or foil and fill bottom with baking beans or weights. Bake crust, rotating halfway through, 20 minutes. Remove weights, pierce bottom of crust all over with a fork, and bake again until very light brown and dry, about 10 minutes more.",
        "Meanwhile, heat a large skillet over medium. Add onion, butter, and 1/4 tsp. salt and cook, stirring occasionally, until onion is softened and just starting to brown, 5–8 minutes. Let cool.",
        "Combine cheese, mayonnaise, herbs, hot sauce, pepper, onion mixture, and remaining 1/4 tsp. salt in a medium bowl. Blot tomatoes with fresh paper towels to remove as much remaining moisture as possible. Arrange tomato slices in pie shell and top with filling; smooth.",
        "Bake pie, rotating halfway through, until golden brown, 40–45 minutes. Let cool to room temperature before slicing.",
        "Dough can be frozen for up to 3 months; thaw before using. Tomato pie can be chilled for up to 2 days."
    ],
    "ingredients": [
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon sugar",
        "1 1/4 cups all-purpose flour, plus more for surface",
        "1/2 cup (1 stick) cold unsalted butter, cut into cubes",
        "3 large heirloom tomatoes (about 2 pounds), sliced 1/4\" thick",
        "3/4 teaspoon kosher salt, divided",
        "All-purpose flour (for surface)",
        "1 cup finely chopped Vidalia onion (about 1/2 medium onion)",
        "1/2 tablespoon unsalted butter",
        "1 1/2 cups grated sharp cheddar (about 4 ounces)",
        "1/2 cup mayonnaise (preferably Duke's)",
        "1/4 cup coarsely chopped fresh herbs, such as basil, oregano, parsley, and/or thyme",
        "1 teaspoon mild hot sauce",
        "1/2 teaspoon freshly ground black pepper",
        "A 9\" pie pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Tomato",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Cheddar",
        "Summer",
        "Sugar Conscious",
        "Kidney Friendly"
    ],
    "title": "Tomato-Cheddar Pie",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-cheddar-pie-56389874"
}
