{
    "directions": [
        "Cut chiles into 1/4-inch pieces with kitchen shears and soak in warm water until softened, about 20 minutes. Drain in a sieve.",
        "While chiles soak, blanch beans in a saucepan of boiling salted water 1 minute, then transfer to a bowl of ice and cold water to stop cooking. Drain well.",
        "Pound chiles, shallots, garlic, salt, shrimp paste, and sugar to a coarse paste with mortar and pestle, about 8 minutes. Transfer half of paste to a small bowl, then add half of tomatoes to mortar and pound until tomatoes begin to break up and form a chunky sauce. Transfer tomato mixture to another bowl and pound remaining chile paste and tomatoes in same manner.",
        "Pat pork dry. Heat oil in wok over moderate heat until hot but not smoking, then cook pork, stirring, until no longer pink, 3 to 4 minutes. Add tomato mixture and cook, stirring occasionally, until liquid is reduced and slightly thickened, 3 to 5 minutes. Add fish sauce and cook, stirring occasionally, 1 minute.",
        "Serve relish warm or at room temperature with vegetables on the side."
    ],
    "ingredients": [
        "10 to 18 (2- to 3-inch-long) prik haeng (dried red chiles), halved and seeds discarded",
        "6 oz Chinese long beans, trimmed and cut into 3-inch pieces",
        "6 small shallots, chopped (1/2 cup)",
        "4 garlic cloves, chopped",
        "1/2 teaspoon salt",
        "1/4 teaspoon ga-pi (Thai shrimp paste)",
        "1/8 teaspoon sugar",
        "1/2 lb red cherry tomatoes, quartered",
        "1/2 lb boneless pork shoulder, cut into 1/4-inch pieces",
        "2 tablespoons vegetable oil",
        "1 tablespoon nam pla (Asian fish sauce; preferably Thai)",
        "4 carrots, cut diagonally into 1/4-inch-thick slices",
        "1/2 head cabbage (1 1/2 lb), cut into 8 wedges (including core)",
        "Special equipment: a large (2-cup) mortar and pestle (preferably granite); a large (6-qt) wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Pork",
        "Tomato",
        "Appetizer",
        "Side",
        "Stir-Fry",
        "Green Bean",
        "Carrot",
        "Cabbage",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tomato and Minced Pork Relish with Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-minced-pork-relish-with-vegetables-109427"
}
