{
    "directions": [
        "Put oven racks in middle and lower third of oven and preheat oven to 400°F.",
        "Toss tomatoes in a bowl with 1 tablespoon oil, teaspoon salt, 1/4 teaspoon pepper, and 1 teaspoon herbes de Provence. Arrange tomatoes, cut sides up, in a shallow baking pan and reserve bowl (do not wipe clean).",
        "Quarter fennel lengthwise, then slice 1/8 inch thick with slicer. Toss fennel in reserved bowl with 1 tablespoon oil, 1/2 teaspoon salt, 1/4 teaspoon pepper, and remaining teaspoon herbes de Provence, then spread out in a 17- by 12-inch heavy shallow baking pan.",
        "Roast fennel in lower third of oven and tomatoes in middle of oven, stirring fennel halfway through roasting, until fennel begins to caramelize and tomatoes are browned lightly on edges (but are still juicy) and their juices have accumulated in bottom of pan, 40 to 50 minutes.",
        "Remove from oven. If there are no tomato juices in pan, gently press on tomatoes to extract enough juice to measure 2 tablespoons (leave juices in pan). Increase oven temperature to 450°F.",
        "Line a 17- by 12-inch shallow baking pan with heavy-duty foil and coat foil with 1 tablespoon oil. Position salmon diagonally in roasting pan, then open fish. Sprinkle inside of fish with remaining 3/4 teaspoon salt and 1/2 teaspoon pepper, then coat with 1 tablespoon oil. Arrange roasted tomatoes evenly inside fish on bottom half (with head and tail attached), reserving juices in pan (for sauce). Top tomatoes with roasted fennel, then pour wine over vegetables and close fish (like a book) to enclose stuffing (stuffing will not be completely covered). Secure opening with several wooden picks, then rub top of fish with remaining tablespoon oil. If head and tail hang over edge of pan, put a baseball-size ball of foil under head and a golf-ball-size ball of foil under tail to prop them up so that juices run into pan (head and tail will curve upward slightly).",
        "Roast salmon in middle of oven until fish is just cooked through (thickest part will be opaque), about 25 minutes.",
        "Combine saffron and hot water in a small cup and let stand 1 minute. Blend together saffron mixture, remaining sauce ingredients, and 2 tablespoons reserved tomato juices in a blender until smooth. Transfer to a bowl and chill, covered, until ready to use.",
        "Slide whole fish (still on foil) onto a platter. To remove foil, lift head end of fish slightly with a long or wide spatula and push foil toward middle of fish. Lower head end back onto platter and lift tail end in same manner to gently remove foil completely. Serve fish with sauce on the side."
    ],
    "ingredients": [
        "2 pounds plum tomatoes, halved lengthwise",
        "1/4 cup plus 1 tablespoon extra-virgin olive oil",
        "1 3/4 teaspoons salt",
        "1 teaspoon black pepper",
        "2 teaspoons herbes de Provence",
        "2 large fennel bulbs (sometimes labeled \"anise\"; 2 pounds), stalks cut off and discarded",
        "1 (8-pound) whole salmon (preferably wild coho), cleaned, butterflied, and boned, leaving head and tail intact",
        "1/4 cup dry white wine",
        "10 saffron threads",
        "1/4 teaspoon hot water",
        "1 cup mayonnaise",
        "1/2 cup loosely packed fresh basil leaves",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon Dijon mustard",
        "1 large garlic clove",
        "1 1/2 teaspoons finely grated fresh orange zest",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: an adjustable-blade slicer; heavy-duty foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Herb",
        "Tomato",
        "Roast",
        "Dinner",
        "Basil",
        "Seafood",
        "Salmon",
        "Fennel",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tomato-and-Fennel-Stuffed Salmon with Basil Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-fennel-stuffed-salmon-with-basil-sauce-238698"
}
