{
    "directions": [
        "Preheat oven to 375°F.",
        "If necessary, roll out dough on a lightly floured surface into an 11-inch round and fit into tart pan. Trim excess dough, leaving a 1/2-inch overhang, then fold overhang inward and press against side of pan to reinforce edge. Lightly prick bottom and sides with a fork.",
        "Line tart shell with foil and fill with pie weights. Bake in middle of oven until pastry is pale golden around rim, about 20 minutes. Carefully remove weights and foil and bake until golden all over, 8 to 10 minutes more. Cool in pan on a rack.",
        "While tart shell is baking, heat 2 tablespoons oil in a 12-inch heavy skillet over moderate heat, then cook onion with salt and black pepper to taste, stirring frequently, until golden brown, 15 to 20 minutes.",
        "Preheat broiler.",
        "Spread onion over bottom of tart shell and top with 1 rounded cup goat cheese. Arrange tomatoes, slightly overlapping, in concentric circles over cheese. Sprinkle with remaining cheese and salt and pepper to taste and drizzle with remaining tablespoon oil. Put foil over edge of crust (to prevent overbrowning).",
        "Put tart pan on a baking sheet and broil tart about 7 inches from heat until cheese starts to brown slightly, 3 to 4 minutes."
    ],
    "ingredients": [
        "1 (9-inch) prepared pie dough, thawed if frozen (not pie shells)",
        "3 tablespoons olive oil",
        "1 large onion, very thinly sliced",
        "6 oz crumbled goat cheese (1 1/3 cups)",
        "1 lb plum tomatoes, thinly sliced crosswise",
        "Garnish: fresh basil leaves",
        "Special equipment: a 9-inch tart pan with a removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Tomato",
        "Bake",
        "Quick & Easy",
        "Lunch",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tomato, Goat Cheese, and Onion Tart",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-goat-cheese-and-onion-tart-106898"
}
