{
    "directions": [
        "Put oven rack in middle position and preheat oven to 300°F.",
        "Cut an X in bottom of each tomato with a sharp paring knife and blanch tomatoes together in a 3-quart saucepan of boiling water 10 seconds. Transfer tomatoes with a slotted spoon to a bowl of ice and cold water to cool. Drain tomatoes and peel off skin, using paring knife and beginning from scored end. Cut two thirds of tomatoes into quarters and arrange, cut sides down, in a lightly oiled shallow baking pan. Sprinkle with half of garlic and 1/2 teaspoon thyme and roast until tomatoes are caramelized, about 3 hours.",
        "While tomatoes are roasting, seed remaining tomatoes and finely chop. Cook onion and remaining garlic in 1/4 cup oil in a 12-inch heavy skillet over low heat, stirring occasionally, until very soft and golden, about 20 minutes. Add chopped tomatoes, bay leaf, and remaining 1/2 teaspoon thyme and cook, covered, stirring occasionally, until all moisture has evaporated, about 2 hours (mixture will resemble a thick purée). Drain tomato sauce in a fine-mesh sieve set over a bowl, then discard liquid in bowl. Discard bay leaf.",
        "Macerate raisins in rum 30 minutes.",
        "While raisins macerate, bring rice and water to a boil in a 1-quart heavy saucepan, then reduce heat to low and cook, tightly covered, until water is absorbed, about 15 minutes. Remove from heat and let rice stand, covered, 10 minutes, then transfer to a bowl and sprinkle with vinegar. Toss rice gently with a fork and cool. Stir in tomato sauce, raisins (with any liquid), pine nuts, and mint. Add salt and pepper to taste and a pinch of sugar.",
        "Scoop rice mixture into ice cream scoop, packing it by pressing against side of bowl. Press lever to release \"sushi\" onto a platter. Top each piece with a roasted tomato, smooth side up, then lightly brush with oil and dust with cumin."
    ],
    "ingredients": [
        "3 lb firm-ripe 2- to 3-inch tomatoes",
        "3 garlic cloves, minced",
        "1 teaspoon chopped fresh thyme",
        "1 small onion, finely chopped",
        "1/4 cup extra-virgin olive oil plus additional for brushing",
        "1 Turkish or 1/2 California bay leaf",
        "1/4 cup golden raisins (1 oz)",
        "2 tablespoons light rum",
        "1/3 cup sushi rice*",
        "1/2 cup water",
        "1 teaspoon rice vinegar (not seasoned)",
        "1/2 cup pine nuts (2 oz), toasted",
        "2 tablespoons finely chopped fresh mint",
        "Granulated sugar to taste",
        "Ground cumin for dusting",
        "Special equipment: a 1 1/2-tablespoon ice cream/cookie scoop with a release lever**"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Rice",
        "Tomato",
        "Roast",
        "Low Carb",
        "Vegetarian",
        "Raisin",
        "Pine Nut",
        "Gourmet"
    ],
    "title": "Tomato \"Sushi\"",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-sushi-109633"
}
