{
    "directions": [
        "Cut off and discard top third of tomatoes and scoop out insides (leave shells intact for stuffing), transferring to a sieve set over a bowl to drain excess liquid. Coarsely chop tomato from sieve and reserve for making braised eggplant .",
        "Sprinkle insides of tomato shells with 1/2 teaspoon salt and drain upside down on a rack set in a pan while preparing filling.",
        "Simmer lentils in 1/2 cup water in a small saucepan until just tender, 18 to 20 minutes. Drain in a sieve, then rinse under cold water and drain well.",
        "Heat oil in a 5-quart heavy pot over moderate heat until hot, then cook pine nuts, stirring, until golden, about 2 minutes. Transfer with a slotted spoon to paper towels to drain.",
        "Cook onion in oil remaining in pot over moderate heat, stirring occasionally, until softened but not browned, 6 to 8 minutes. Add bulgur, chard, remaining 3/4 teaspoon salt, and pepper and cook, stirring, until greens are wilted, about 2 minutes. Add remaining cup water, then remove from heat and let stand, covered, until bulgur is tender, about 30 minutes.",
        "Stir in pine nuts, currants, parsley, dill, lemon juice, lentils, and salt and pepper to taste. Spoon filling into tomato shells."
    ],
    "ingredients": [
        "6 large tomatoes (3 lb)",
        "1 1/4 teaspoons salt",
        "2 tablespoons lentils (preferably French green lentils)",
        "1 1/2 cups water",
        "1/4 cup extra-virgin olive oil",
        "1/2 cup pine nuts",
        "1 large onion, finely chopped",
        "1/2 cup bulgur (preferably coarse)",
        "1 lb Swiss chard or spinach, stems discarded and leaves thinly sliced (4 cups)",
        "1/4 teaspoon black pepper",
        "1/2 cup dried currants",
        "1/3 cup chopped fresh flat-leaf parsley",
        "2 tablespoons chopped fresh dill",
        "2 tablespoons fresh lemon juice",
        "Accompaniment: yogurt garlic sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Side",
        "Vegetarian",
        "Pine Nut",
        "Lentil",
        "Summer",
        "Chard",
        "Bulgur",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tomatoes Stuffed with Bulgur and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/tomatoes-stuffed-with-bulgur-and-pine-nuts-105228"
}
