{
    "directions": [
        "Heat the butter in a large soup pot over medium-high heat. Add the bacon and cook, stirring, until crisp and most of the fat has rendered, about 1 minute. Using a slotted spoon, transfer the bacon to a paper towel-lined plate and set aside. Lower the heat to medium, add the onion, carrots, celery, and garlic and cook, covered, stirring occasionally, until soft and fragrant, about 8 minutes.",
        "Stir in the flour and cook, stirring, for 3 minutes. Pour in the broth and tomatoes and bring to a boil while whisking constantly. Tie the parsley sprigs, thyme, and bay leaf together with a piece of kitchen twine and add to the pot. Lower the heat and simmer for 30 minutes. Remove from the heat and allow to cool.",
        "When the soup base is cool, remove and discard the herb bundle. Working in batches, transfer the mixture to a blender and puree until smooth. Using a sieve over a large bowl, strain the tomato puree. Return the puree to the pot and reheat over medium heat.",
        "Whisk the heavy cream and salt into the soup and season with pepper to taste. Divide among warm soup bowls, garnish with the crispy bacon, and serve immediately."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "1 tablespoon minced bacon (about 1/2 ounce)",
        "1 Spanish onion, chopped",
        "1 carrot, chopped",
        "1 stalk celery, chopped",
        "4 cloves garlic, minced",
        "5 tablespoons all-purpose flour",
        "5 cups chicken broth, homemade or low-sodium canned",
        "1 (28-ounce) can whole, peeled tomatoes (with liquid), roughly chopped",
        "3 parsley sprigs",
        "3 fresh thyme sprigs",
        "1 bay leaf",
        "1 cup heavy cream",
        "1 3/4 teaspoon kosher salt",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Tomato Soup",
        "Vegetable Soup",
        "Soup",
        "Tomato",
        "Vegetable",
        "American",
        "Dairy Recipes",
        "Bacon Recipes",
        "Meat",
        "Appetizer",
        "Sauteing Recipes",
        "Pureeing Recipes"
    ],
    "title": "Tomato Bisque",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/tomato-bisque-recipe"
}
