{
    "directions": [
        "Whisk egg whites in a large bowl until foamy and add eggshells. Separately pulse tomatoes and celery in a food processor until coarsely chopped, then add to egg whites. Whisk in beef, salt, and peppercorns.",
        "Heat veal stock, if jellied, in a 4-quart heavy saucepan just until it becomes liquid, then whisk in beef mixture. Heat over moderately high heat, stirring and scraping bottom constantly with a wooden spoon to prevent egg white from sticking, until stock comes to a simmer (this will take about 20 minutes). Reduce heat and gently simmer broth, without stirring, until all impurities rise to surface and form a crust, and broth underneath is clear, about 30 minutes.",
        "Ladle broth with crust into a large sieve lined with a double thickness of dampened paper towels set over a large bowl and let all liquid drain through. (If liquid doesn't drain completely, tap edge of sieve repeatedly with a metal spoon to help drain.) Broth should be completely clear; if it's not, repeat procedure with clean dampened paper towels. Discard solids.",
        "Before serving, bring consommé to a boil and season with salt. Ladle into bowls and top with profiteroles and garnishes."
    ],
    "ingredients": [
        "4 large egg whites plus shells, crushed",
        "1 lb plum tomatoes, quartered",
        "1 lb celery (5 to 6 large ribs), cut into 1-inch pieces",
        "1/2 lb lean ground sirloin",
        "1 tablespoon kosher salt",
        "20 black peppercorns, cracked",
        "6 cups veal stock",
        "Accompaniment: tiny choux puffs",
        "Garnish: celery leaves and diced seeded peeled tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Tomato",
        "Celery",
        "Fall",
        "Simmer",
        "Gourmet"
    ],
    "title": "Tomato and Celery-Infused Beef Consommé with Tiny Choux Puffs",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-celery-infused-beef-consomme-with-tiny-choux-puffs-105485"
}
