{
    "directions": [
        "Puree tomatoes in processor until smooth. Strain through fine sieve, pressing on solids to release enough tomato puree to measure 2 cups. Discard any remaining puree and solids in strainer. Add 1 cup chilled Simple Syrup and pinch of coarse kosher salt to strained tomato puree; stir to blend.",
        "Transfer tomato mixture to ice cream maker and process according to manufacturer's instructions. Transfer gelato to container; cover and freeze until firm, about 3 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.",
        "Bring 1 1/2 cups Simple Syrup to simmer in small saucepan. Remove from heat; add 3 cups basil leaves to syrup and stir until wilted. Transfer basil mixture to bowl and refrigerate until cold, about 2 hours. Puree basil mixture and 6 tablespoons water in blender until smooth.",
        "Transfer basil mixture to ice cream maker and process according to manufacturer's instructions. Transfer gelato to container; cover and freeze until firm, about 3 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.",
        "Combine ricotta cheese and milk in processor; puree until smooth. Add 3/4 cup Simple Syrup and process until blended and smooth.",
        "Transfer ricotta mixture to ice cream maker and process according to manufacturer's instructions. Transfer gelato to container; cover and freeze until firm, about 3 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.",
        "Stir 1 cup sugar and 1/3 cup water in heavy small saucepan over medium heat until sugar dissolves. Increase heat and boil without stirring until color is medium amber (not deep amber), occasionally brushing down sides of pan with pastry brush dipped in water and swirling pan, about 7 minutes. Remove pan from heat. Gently drop tomatoes into hot caramel syrup, tilting pan to coat. Using fork, quickly lift out tomatoes and transfer to sheet of foil. Cool tomatoes completely. DO AHEAD: Candied cherry tomatoes can be made 5 hours ahead. Let stand at room temperature.",
        "Pour enough vegetable oil into heavy small saucepan to reach depth of 1 inch. Attach deep-fry thermometer to side of saucepan. Heat oil over medium heat to 350°F. Add basil leaves and fry just until translucent, about 2 minutes. Using slotted spoon, transfer basil to paper towels to drain. DO AHEAD: Can be made 5 hours ahead. Let stand at room temperature.",
        "Using 1- to 1 1/2-inch ice cream scoop, spoon out 1 scoop of each gelato into shallow bowls or glasses. Garnish with candied cherry tomatoes and fried basil leaves and serve."
    ],
    "ingredients": [
        "2 pounds medium-size deep-red ripe tomatoes (such as Early Girl), halved, seeded, cored, coarsely chopped",
        "1 cup chilled Simple Syrup",
        "Pinch of coarse kosher salt",
        "1 1/2 cups Simple Syrup",
        "3 cups fresh basil leaves (slightly packed; about 2 ounces)",
        "6 tablespoons water",
        "2 cups fresh whole-milk ricotta cheese (about 16 ounces)",
        "1/4 cup whole milk",
        "3/4 cup chilled Simple Syrup",
        "1 cup sugar",
        "1/3 cup water",
        "12 small cherry tomatoes (such as Sweet 100s) or teardrop tomatoes",
        "Vegetable oil (for frying)",
        "12 fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Tomato",
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Ricotta",
        "Basil",
        "Pittsburgh",
        "Pennsylvania"
    ],
    "title": "Tomato, Basil, and Ricotta Gelati",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-basil-and-ricotta-gelati-239808"
}
