{
    "directions": [
        "To make the naan, in a glass measuring pitcher, combine the yeast and sugar. Add the water and stir well to combine. Set aside until the mixture is foamy, about 5 minutes.",
        "In a large bowl, sift together the 1 cup flour and salt. Make a well in the center of the flour and pour the yeast mixture and the 1/4 cup vegetable oil in the center. Mix together with your fingers until a smooth dough forms, working in a small amount of additional flour if needed to make a dough that is soft but not too sticky. Turn the dough out onto a lightly floured surface and knead for 3 minutes.",
        "Oil a small bowl with the remaining 1 tsp. vegetable oil. Place the dough in the bowl and turn once to coat with oil. Set aside in a warm place until it is doubled in size, about 1 hour.",
        "Preheat an oven to 400°F (200°C).",
        "Divide the dough into 6 balls of equal size. Using your hands, stretch each ball into into an oval about 8 inches (20 cm) long. As you are finished shaping the naan, arrange them on a baking sheet in a single layer. Lightly brush each naan with olive oil. Set aside.",
        "To make the chicken, in a large fry pan over medium heat, warm the oil. Add the chicken to the pan and sear until golden brown all over, about 5 minutes. Add the curry sauce and reduce the heat to medium-low. Bring to a simmer, cover and cook until the chicken is cooked through, about 15 minutes.",
        "While the chicken is cooking, transfer the baking sheet to the oven and bake the naan until golden brown and puffed, about 10 minutes.",
        "To serve, divide the chicken and sauce among four bowls. Serve immediately with the hot naan alongside. Serves 4.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "For the naan:",
        "1 tsp. active dried yeast",
        "1/2 tsp. sugar",
        "1/2 cup (4 fl. oz./125 ml) warm water",
        "1 cup (5 oz./155 g) all-purpose flour, plus more as needed",
        "1/2 tsp. kosher salt",
        "1/4 cup (2 fl. oz./60 ml) plus 1 tsp. vegetable oil",
        "Olive oil for brushing",
        "2 Tbs. vegetable oil",
        "2 lb. (1 kg) boneless, skinless chicken breasts or thighs, cut into 1-inch (2.5-cm) cubes",
        "1 jar tomato turmeric curry sauce",
        "Chopped fresh cilantro for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tomato Turmeric Chicken with Homemade Naan",
    "url": "http://www.williams-sonoma.com/recipe/tomato-turmeric-chicken-with-homemade-naan.html"
}
