{
    "directions": [
        "Reserve 1 cup chopped tomatoes for peach salsa. Place remaining tomatoes in processor and puree until smooth. Transfer to 2-quart glass measuring cup. Add enough tomato juice to puree to equal 5 cups tomato mixture. Place 2 cups tomato mixture in blender. Add 2 tablespoons onion, 2 tablespoons cilantro, 2 teaspoons chipotle chilies and garlic to blender. Puree until very smooth. Stir puree back into tomato mixture in measuring cup. Season to taste with salt and pepper. Add more chopped chipotles, if desired. Cover; refrigerate until well chilled, about 1 hour. (Can be made 1 day ahead. Keep soup chilled. Cover reserved chopped tomatoes and chill.)",
        "Mix reserved chopped tomatoes, remaining 2 tablespoons onion and 1 tablespoon cilantro, peach and jalapeño in small bowl. Ladle tomato soup into bowls. Sprinkle with peach salsa; serve.",
        "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "2 1/2 pounds plum tomatoes, seeded, chopped (about 6 cups)",
        "1 cup (about) tomato juice",
        "4 tablespoons chopped onion",
        "3 tablespoons chopped fresh cilantro",
        "2 teaspoons (or more) chopped canned chipotle chilies*",
        "1 garlic clove, minced",
        "1 ripe peach, peeled, pitted, diced",
        "1 teaspoon minced jalapeño chili"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Fruit",
        "Onion",
        "Tomato",
        "Appetizer",
        "Lunch",
        "Peach",
        "Summer",
        "Healthy",
        "Jalapeño",
        "Cilantro",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tomato-Chipotle Soup with Fresh Peach Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-chipotle-soup-with-fresh-peach-salsa-103763"
}
