{
    "directions": [
        "Place the green tomatoes, tomatillos, raisins, onion, brown sugar, salt, apple cider vinegar, pickling spice, chili powder, crystallized ginger, and brown mustard seed into a large pot over medium heat. Bring to a boil, and stir until the brown sugar has dissolved. Reduce heat, and simmer the chutney until thickened, 1 to 2 hours, stirring occasionally to keep chutney from burning on the bottom.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the chutney into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 to 20 minutes, or the time recommended by your county Extension office.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area. Any uncanned chutney can be refrigerated or frozen."
    ],
    "ingredients": [
        "5 cups chopped green tomatoes",
        "4 cups fresh tomatillos, husked, rinsed, and chopped",
        "1 1/2 cups golden raisins",
        "1 1/2 cups chopped onion",
        "2 1/4 cups packed brown sugar",
        "1/2 teaspoon salt",
        "1 3/4 cups apple cider vinegar",
        "1 1/2 tablespoons pickling spice",
        "1 1/2 teaspoons chili powder",
        "2 tablespoons finely chopped crystallized ginger",
        "1 tablespoon brown mustard seed",
        "5 (1 pint) canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tomato Tomatillo Chutney - 'Tom Tom'",
    "url": "http://allrecipes.com/recipe/218771/tomato-tomatillo-chutney---tom-tom/"
}
