{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "To make the paste, place the sun-dried tomatoes and garlic in the bowl of a food processor fitted with the steel blade. Process for 30 seconds. Add the basil, salt, and pepper. With the processor running, slowly pour the olive oil into the bowl through the feed tube and process until pureed. Add the Parmesan and puree for 15 seconds. Set aside.",
        "Unfold 1 sheet of puff pastry and place it on a lightly floured board. With a rolling pin, lightly roll the dough until it's a 13-inch square. Using a knife, spread the paste over the top of the puff pastry. Fold the sides of the square toward the center so they go halfway to the middle. Fold them again so the 2 folds meet exactly at the middle of the dough. Then fold one half over the other half as though closing a book. You will have 6 layers. Slice the dough into 3/8-inch slices and place the slices, cut side up, on baking sheets lined with parchment paper. Brush each piece with egg wash and place in the oven. Bake for 6 minutes. Turn each pastry slice over and continue baking an additional 5 minutes."
    ],
    "ingredients": [
        "1 1/4 cups sun-dried tomatoes, chopped",
        "3 tablespoons chopped garlic (9 cloves)",
        "5 cups basil leaves, packed",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "3/4 cup good olive oil",
        "1 cup freshly grated Parmesan",
        "1 sheet puff pastry, defrosted (recommended: Pepperidge Farm)",
        "1 egg mixed with 1 tablespoon water, for egg wash"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Vegetarian",
        "Italian",
        "Pastry Recipes",
        "Cheese",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Recipes for Parties",
        "Holiday",
        "Pureeing Recipes"
    ],
    "title": "Tomato Basil Elephant Ears",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/tomato-basil-elephant-ears-recipe"
}
