{
    "directions": [
        "Cook onions in butter and oil with oregano, thyme, and salt and pepper to taste in a 4-quart saucepan over moderate heat, stirring, until onions are softened. Add garlic and cook, stirring, 1 minute. Add tomatoes and simmer, uncovered, stirring occasionally, until slightly thickened, about 18 minutes. Remove from heat and stir in parsley, orange juice, and salt and pepper to taste.",
        "Preheat oven to 375°F. and butter 2 (13- by 9-inch) baking dishes.",
        "Soak lasagne sheets in hot water to cover by 1 inch until softened and flexible, about 20 minutes.",
        "Spread 1 1/2 cups sauce in each baking dish and top sauce in each dish with 3 drained pasta sheets, overlapping if necessary. Sprinkle 1 cup mozzarella and 1/4 cup parmesan evenly in each dish. Top with 3 drained pasta sheets per dish, overlapping if necessary. Repeat layering with 1 cup mozzarella, 1/4 cup parmesan, 1 cups sauce, and 3 drained pasta sheets in each dish. Finish assembling lasagne by topping each with 1 cups sauce. (You will have leftover sauce and mozzarella.)",
        "Bake lasagne, covered with foil, in middle of oven 30 minutes. Remove foil and sprinkle evenly with remaining 2 cups mozzarella. Bake until bubbling and cheese is melted, about 10 minutes more.",
        "Serve lasagne with some of remaining sauce, reheated."
    ],
    "ingredients": [
        "3 onions, chopped",
        "1 tablespoon unsalted butter",
        "2 tablespoons olive oil",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried thyme",
        "6 garlic cloves, minced",
        "3 (28- to 32-oz) cans crushed tomatoes in thick purée",
        "1 cup chopped fresh parsley",
        "1/4 cup fresh orange juice",
        "18 (7- by 3 1/2-inch sheets) dry no-boil lasagne (1 lb)",
        "2 1/2 lb fresh mozzarella (smoked or plain), chilled and coarsely grated (6 cups)",
        "1 cup freshly grated parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Mozzarella",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Gourmet"
    ],
    "title": "Tomato and Mozzarella Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-mozzarella-lasagne-103062"
}
