{
    "directions": [
        "1 Heat the olive oil in a 3- or 4-quart saucepan over medium heat until shimmering. Add the onion, garlic, and 1/4 teaspoon of the salt. Cook, stirring frequently, until the onion softens and starts to brown at the edges, about 5 minutes. Add the tomato paste and Aleppo pepper and cook, stirring, until the mixture darkens, about 1 minute. Add the broth, the tomatoes with their juices, and the bulgur and bring to a boil, stirring and scraping the bottom of the pan.",
        "2 Decrease the heat to maintain a simmer, cover, and cook until the liquid is absorbed and the bulgur is tender but still slightly chewy, about 15 minutes. Add a tad more water if necessary. Remove the saucepan from the heat and season with the remaining 1/4 teaspoon salt. Taste for salt and adjust, and then stir in 1/4 cup of the basil. Cover and set aside for 3 minutes. Garnish with the remaining 2 tablespoons basil and serve."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 cup red onion, cut into 1/4-inch dice (about 1 small)",
        "1 clove garlic, peeled and crushed",
        "1/2 teaspoon fine sea salt",
        "2 tablespoons tomato paste",
        "1/2 to 1 teaspoon Aleppo pepper",
        "1 1/2 cups low-sodium chicken broth or vegetable broth",
        "1 cup coarsely chopped fresh tomatoes or diced canned tomatoes",
        "1 cup medium-coarse bulgur",
        "1/4 cup chopped fresh basil, plus 2 tablespoons for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Tomato",
        "Vegetable",
        "Side",
        "Basil",
        "Bulgur",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tomato-Infused Bulgur Pilaf with Fresh Basil",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-infused-bulgur-pilaf-with-fresh-basil-51195020"
}
