{
    "directions": [
        "Pulse leek, shallot, and garlic in a food processor until finely chopped. Transfer to a small bowl; set aside. Pulse watercress in processor until finely chopped but not a paste. Transfer to a medium bowl; set aside.",
        "Melt butter in a large heavy pot over medium-low heat. Add leek mixture; season with salt and pepper and cook, stirring often, until translucent, 7-8 minutes. Increase heat to medium. Add watercress; cook, stirring often, until watercress is wilted and tender, 8-10 minutes. Stir in cheese, cream, and parsley. Season to taste with salt and pepper. Transfer to a medium bowl; chill until cold. DO AHEAD: Can be made 1 day ahead. Cover; keep chilled.",
        "Preheat broiler. Arrange oysters on half shells on a rimmed baking sheet. Dividing equally, spoon watercress mixture over oysters, spreading to cover completely.",
        "Broil until cheese is melted, top of watercress mixture begins to brown in spots, and oysters are just cooked through, 3-4 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 small leek (white and pale-green parts only), coarsely chopped",
        "1 large shallot, coarsely chopped",
        "1 garlic clove, coarsely chopped",
        "1 large bunch watercress, coarsely chopped (about 4 cups packed)",
        "1/4 cup (1/2 stick) unsalted butter",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup finely grated Gruyère",
        "1/2 cup heavy cream",
        "1/4 cup finely chopped flat-leaf parsley",
        "24 large oysters, freshly shucked, on the half shell, with juices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Shellfish",
        "Appetizer",
        "Broil",
        "Low Sodium",
        "Seafood",
        "Oyster",
        "Leek",
        "Watercress",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tomales Bay Oysters Rockefellar",
    "url": "http://www.epicurious.com/recipes/food/views/tomales-bay-oysters-rockefellar-395476"
}
