{
    "directions": [
        "Make Parmesan toasts:",
        "Preheat oven to 325° F.",
        "On a large baking sheet arrange bread slices in one layer and lightly brush both sides of each slice with oil. Toast slices in middle of oven 15 minutes and turn over. Sprinkle slices with Parmesan and toast 15 minutes, or until golden. Transfer toasts to a rack and cool. Toasts may be made 2 days ahead and kept in a sealable plastic bag at room temperature.",
        "In a large heavy skillet toast pine nuts in 3 tablespoons oil over moderate heat until golden and with a slotted spoon transfer to a small bowl. In oil remaining in skillet sauté eggplant, onion, minced garlic, and salt to taste over moderately high heat, stirring, until eggplant begins to brown. Cook mixture, covered, over moderate heat, stirring occasionally, until eggplant is tender, about 10 minutes, and transfer to a bowl. Cool mixture.",
        "Into eggplant mixture stir garlic paste, tomatoes, basil, parsley, lemon juice, sugar, remaining 3 tablespoons oil, and salt and pepper to taste. Spread may be made 2 days ahead and chilled, covered. Keep toasted pine nuts in a sealable plastic bag at room temperature. Bring spread to room temperature before serving.",
        "Just before serving, stir pine nuts into spread. Serve spread with toasts."
    ],
    "ingredients": [
        "For Parmesan toasts",
        "1 baguette (about 15 inches long), cut diagonally into 1/4-inch-thick slices",
        "1/4 cup olive oil",
        "1/3 cup freshly grated Parmesan (about 1 ounce)",
        "1/4 cup pine nuts",
        "6 tablespoons olive oil",
        "1 firm eggplant (about 11/4 pounds), cut into 1/2-inch cubes",
        "1 onion, chopped",
        "2 garlic cloves, 1 chopped and mashed to a paste with 1/2 teaspoon salt and 1 minced",
        "3 vine-ripened tomatoes (about 3/4 pound total), cut into 1/2-inch cubes",
        "1/2 cup packed fresh basil leaves, washed well, spun dry, and chopped",
        "1/3 cup packed fresh flat-leafed parsley leaves, washed well, spun dry, and chopped",
        "3 tablespoons fresh lemon juice",
        "1/2 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Nut",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tomato Eggplant Spread and Parmesan Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-eggplant-spread-and-parmesan-toasts-13011"
}
