{
    "directions": [
        "Position racks in top third and bottom third of oven. Preheat oven to 400°F. Line 2 baking sheets with parchment paper. Working with 1 pastry sheet at a time, roll out on floured surface to 13-inch square. Using 6-inch-diameter plate, cut out 4 rounds from 1 sheet and 2 rounds from second sheet (reserve remaining pastry for another use). Transfer 3 rounds to each baking sheet. Pierce each round with fork. Top rounds with another sheet of parchment. Place another baking sheet atop parchment on each sheet.",
        "Place 1 baking sheet stack on each rack in oven and bake 10 minutes. Rotate baking sheets and bake until rounds are golden, about 10 minutes longer. Using oven mitts, carefully remove top baking sheets and top sheets of parchment. Continue baking pastries until deep golden, about 3 minutes longer. Transfer sheets to rack to cool. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Increase oven temperature to 450°F. Spread generous tablespoon tapenade over each pastry round, leaving 1/2-inch border around edges. Alternate 4 tomato slices with 4 mozzarella slices atop each pastry in pinwheel pattern. Bake just until cheese begins to melt, about 2 minutes. Sprinkle with fleur de sel and pepper, then drizzle with olive oil and balsamic vinegar. Arrange a few basil leaves and olive slices atop each tartlet and serve immediately."
    ],
    "ingredients": [
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "1/2 cup (about) green- or black-olive tapenade*",
        "5 to 6 ripe medium tomatoes, preferably assorted colors, cut into 1/4-inch slices",
        "12 ounces fresh mozzarella cheese, thinly sliced",
        "Fleur de sel or coarse kosher salt",
        "Extra-virgin olive oil",
        "Balsamic vinegar",
        "18 small fresh basil leaves",
        "6 green or black olives, pitted, sliced",
        "A thick paste or spread made from brine-cured olives, capers, anchovies, and various seasonings; available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Mozzarella",
        "Basil",
        "Summer",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tomato and Tapenade Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-tapenade-tartlets-242980"
}
