{
    "directions": [
        "Make the masala podi by heating 1 tablespoon oil in a skillet over medium heat; fry the chana dal, urad dal, dried chile peppers, coriander seeds, and cumin seeds in the hot oil until fragrant and beginning to brown, about 5 minutes. Grind the mixture with the coconut into a fine powder using a mortar and pestle.",
        "Heat 2 tablespoons oil in a large skillet. Fry the peanuts and mustard seeds in the hot oil until the peanuts begin to brown, 2 to 3 minutes. Add the onions, green chile peppers, curry leaves, and asafoetida powder to the peanut mixture; cook and stir until the onions are browned, 5 to 7 minutes. Stir the tomatoes, turmeric, sugar, and salt into the mixture; continue cooking until the tomatoes are soft, about 10 minutes more. Season with the masala podi. Crumble the rice into the skillet, using the back of a spoon to separate the individual grains. Cook and stir until the rice is mixed into the dish and hot, 5 to 7 minutes. Garnish with the cilantro to serve."
    ],
    "ingredients": [
        "1 tablespoon cooking oil",
        "1 tablespoon split Bengal gram (chana dal)",
        "1 teaspoon skinned split black lentils (urad dal)",
        "4 dried red chile peppers",
        "2 teaspoons coriander seeds",
        "1 teaspoon cumin seeds",
        "1 tablespoon flaked coconut",
        "2 tablespoons cooking oil",
        "1/4 cup peanuts",
        "1 teaspoon mustard seeds",
        "2 large onions, minced",
        "3 green chile peppers, halved lengthwise",
        "2 sprigs fresh curry leaves",
        "1/4 teaspoon asafoetida powder",
        "3 tomatoes, minced",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon white sugar",
        "salt to taste",
        "3 cups cold, cooked white rice",
        "2 tablespoons chopped fresh cilantro, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tomato Bhath (Tomato Rice)",
    "url": "http://allrecipes.com/recipe/212492/tomato-bhath-tomato-rice/"
}
