{
    "directions": [
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.",
        "Arrange the pepper pieces on the broiler rack so they don't touch each other, and broil until the skin is mostly charred and the peppers are softened, 8 to 10 minutes. Place the peppers into a resealable plastic zipper bag and allow to cool; strip off skin once cooled. Coarsely chop the peppers.",
        "Place the chopped peppers, onions, celery, garlic, chicken stock, and bay leaves into a large saucepan over medium heat, and bring to a boil. Cover, reduce heat to medium-low, and simmer until the onions are and celery are tender, about 15 minutes. Stir in 2 28-ounce cans of diced tomatoes, and remove from heat. Remove and discard bay leaves.",
        "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Return the blended soup to the saucepan, and stir in the 14.5 ounce can of diced tomatoes and the Parmesan cheese. Bring the soup to a simmer over medium-low heat, whisking constantly to melt the cheese. Season to taste with salt and pepper.",
        "Bring a pot of water to a boil, and stir in the tortellini. Boil the tortellini over medium-low heat until tender, about 5 minutes; drain in a colander set in the sink, rinse with water, and stir into the soup."
    ],
    "ingredients": [
        "4 red bell peppers, quartered and seeded",
        "2 large onions, chopped",
        "4 stalks celery, chopped",
        "5 cloves garlic, chopped",
        "5 cups chicken stock",
        "4 bay leaves",
        "2 (28 ounce) cans diced tomatoes, undrained",
        "1 (14.5 ounce) can diced tomatoes, undrained",
        "1 cup grated Parmesan cheese",
        "salt and black pepper to taste",
        "2 cups refrigerated cheese tortellini (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tomato Red Pepper Soup",
    "url": "http://allrecipes.com/recipe/214984/tomato-red-pepper-soup/"
}
