{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Brush custard cups with 1 teaspoon melted butter (total), then coat each with 1 tablespoon Parmigiano-Reggiano. Put 1 tomato slice in bottom of each cup and arrange cups in a shallow baking pan.",
        "Heat remaining 2 tablespoons butter in a 1 1/2-quart heavy saucepan over moderate heat until foam subsides, then whisk in flour. Cook roux, whisking, 1 minute, then whisk in milk, salt, pepper, and cayenne. Bring to a boil over moderate heat, whisking constantly, and boil until thickened, 3 to 4 minutes. Remove from heat and whisk in 1/2 cup Cheddar, 2 tablespoons Parmigiano-Reggiano, and yolks.",
        "Beat whites with a small pinch of salt using an electric mixer until they just hold stiff peaks. Fold one third of whites into cheese sauce to lighten, then fold in remaining whites gently but thoroughly. Divide mixture among cups and sprinkle with remaining 2 tablespoons each of Parmigiano-Reggiano and Cheddar.",
        "Bake soufflés until puffed and golden, 17 to 20 minutes. Serve (in cups) immediately."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter plus 1 teaspoon, melted",
        "1/2 oz Parmigiano-Reggiano, finely grated with a rasp (1/2 cup)",
        "4 (1/4-inch-thick) center-cut slices from a small tomato",
        "2 tablespoons all-purpose flour",
        "1 cup whole milk",
        "1/8 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1/8 teaspoon cayenne",
        "2 oz coarsely shredded sharp Cheddar (1/2 cup) plus 2 tablespoons for sprinkling",
        "2 large eggs, separated",
        "Special equipment: 4 (6-oz) ovenproof custard cups or ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Tomato",
        "Side",
        "Bake",
        "Vegetarian",
        "Quick & Easy",
        "Cheddar",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly"
    ],
    "title": "Tomato and Cheddar Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-and-cheddar-souffles-232169"
}
