{
    "directions": [
        "Purée one fourth of tomatoes with ginger in a food processor until smooth, about 2 minutes. Transfer to a small heavy saucepan and simmer, covered, stirring occasionally, 5 minutes.",
        "Clean processor thoroughly, then purée remaining tomatoes in batches with chiles, salt, and sugar until smooth, 2 to 3 minutes. Transfer to a bowl and stir in cooked tomato ginger purée.",
        "Line a large sieve with stacked cheesecloth squares and set over a deep nonreactive pot or a large clean bucket. Carefully pour purée into center of cheesecloth. Gather sides of cheesecloth up over purée to form a large sack and tie sides together securely with string as close to purée as possible but without squeezing purée. Tie sack to a wooden spoon longer than diameter of pot and remove sieve. Set spoon across top of pot, suspending sack inside pot and leaving a couple of inches underneath sack so that it will not sit in any tomato water that accumulates. (Alternatively, transfer tomato water to another container as it accumulates.) Let sack hang 4 hours at room temperature.",
        "Bring 1 cup water to a boil in a 7- to 8-quart heavy pot. Add clams and cook, covered, over moderately high heat, until clams are opened wide, stirring and checking frequently after 6 minutes and transferring clams as opened to a bowl. (Discard any clams that have not opened after 10 minutes.) When cool enough to handle, shuck clams.",
        "Discard cheesecloth sack and its contents without squeezing. Pour tomato water through large sieve lined with a dampened paper towel into a bowl. Measure out 4 cups tomato water and reserve remainder for another use.",
        "Transfer 1/2 cup tomato water to a small saucepan, then sprinkle with gelatin and let soften 1 minute. Heat over low heat, stirring, just until gelatin is dissolved, then stir into remaining 31/2 cups tomato water.",
        "Arrange glasses on trays and put 1 or 2 cilantro leaves in each, then a clam, and then 1 or 2 more cilantro leaves. Add about 1 tablespoon tomato water to each glass (stir water each time so gelatin remains well distributed) and chill, loosely covered with plastic wrap, at least 3 hours. (Gelatin will be thickened but not set; it needs to slide easily out of glass.)"
    ],
    "ingredients": [
        "4 pounds ripe tomatoes, quartered",
        "1/2 cup finely grated peeled fresh ginger (5 ounces)",
        "2 fresh serrano chiles, finely chopped (including seeds)",
        "1 tablespoon salt",
        "1 tablespoon sugar",
        "1 cup water",
        "60 small hard-shelled clams such as littlenecks (less than 2 inches in diameter; 7 pounds), scrubbed well",
        "2 teaspoons unflavored gelatin (from a 1/4-ounce envelope)",
        "3/4 cup loosely packed fresh cilantro leaves",
        "Special equipment: 4 (20-inch) squares of cheesecloth; kitchen string; 60 (1- to 1 1/2-ounce) tiny stemmed glasses or shot glasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ginger",
        "Shellfish",
        "Tomato",
        "Cocktail Party",
        "Clam",
        "Hot Pepper",
        "Summer",
        "Chill",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Tomato Ginger Gelée Clam Shooters",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-ginger-gelee-clam-shooters-108160"
}
