{
    "directions": [
        "Stir together all olive ingredients in an airtight container and marinate olives, chilled, at least 8 hours. Bring to room temperature before using.",
        "Preheat oven to 350°F.",
        "Brush rough sides of pita halves with oil and sprinkle with za'atar. Cut each round into 8 wedges, then halve each wedge diagonally. Arrange triangles, oiled sides up, on 2 baking sheets and bake in batches in middle of oven until crisp and pale golden, about 10 minutes. Cool on a rack.",
        "Add lemon juice to marinated olives, then close container and shake vigorously. Divide olive mixture between 2 large salad bowls. Divide romaine, cucumber, tomatoes, feta, and pita toasts between bowls, then sprinkle with za'atar and toss."
    ],
    "ingredients": [
        "1 cup Kalamata or other brine-cured black olives (5 oz), halved lengthwise and pitted",
        "3/4 cup extra-virgin olive oil",
        "2 teaspoons minced garlic",
        "1 tablespoon chopped fresh oregano or 1 teaspoon dried, crumbled",
        "2 (2- by 1/2-inch) strips fresh lemon zest, thinly sliced crosswise",
        "1/2 teaspoon coarsely ground black pepper",
        "1/4 teaspoon coarse salt",
        "4 (6-inch) pita loaves with pockets, split horizontally",
        "1/4 cup olive oil",
        "2 tablespoons za'atar",
        "3 tablespoons fresh lemon juice",
        "4 hearts of romaine (1 1/2 lb), cut into 2-inch pieces",
        "1 seedless cucumber (usually plastic-wrapped), peeled, halved lengthwise, cored, and thinly sliced crosswise",
        "1 pt grape or cherry tomatoes, halved",
        "3/4 lb feta, coarsely crumbled (2 1/2 cups)",
        "3 tablespoons za'atar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Vegetable",
        "Bake",
        "Ramadan",
        "Summer",
        "Gourmet"
    ],
    "title": "Tomato, Cucumber, and Pita Salad",
    "url": "http://www.epicurious.com/recipes/food/views/tomato-cucumber-and-pita-salad-106758"
}
