{
    "directions": [
        "Place tomatoes, bay leaves, honey, oregano, 1 tablespoon salt, and black pepper in a large stockpot and cover with water. Stir to combine, cover, and bring to a low boil over medium-high heat. Remove cover and simmer 20 minutes, stirring occasionally. Remove bay leaves. Taste and adjust seasoning.",
        "Heat olive oil in a large skillet over medium-high heat. Cook and stir onions and garlic in the hot oil until the onions are softened but not browned, about 10 minutes.",
        "Transfer the cooked tomatoes to a food mill placed over a bowl and puree in batches, separating the tomato pulp and juice from the tomato skins and seeds. Return the tomato pulp and juice to the stockpot, add the cooked onions and garlic, and cook, uncovered, over medium-high heat until sauce thickens and reduces by about half, about 1 to 1-1/2 hours. Stir occasionally to prevent scorching.",
        "Prepare quart jars, rings, and lids by heating them in boiling water in a canning kettle for at least 5 minutes. When the sauce is ready, remove jars and lids and place on dry towel.",
        "To each jar, add 1 teaspoon salt and 3 tablespoons bottled lemon juice. Ladle the hot tomato sauce into jars, leaving 1/2-inch of space at the top of each jar. Wipe jar rims with a clean, damp cloth, place lids onto jars, and screw on rings.",
        "Place filled jars in the canning kettle. Return water to a simmer, adding more water if needed to cover the jars by at least 1/2 inch. Cover kettle and bring water to a boil. Cook at a steady boil to process the jars until fully sealed, about 45 minutes. Turn off heat and let jars rest 5 minutes before removing and cooling on a clean, dry towel placed on kitchen counter or table. Check that the lids have sealed, and store in a cool, dark place for up to 1 year."
    ],
    "ingredients": [
        "25 pounds plum tomatoes, cored and halved lengthwise",
        "3 bay leaves",
        "1 1/2 tablespoons honey",
        "1 tablespoon dried oregano",
        "1 tablespoon salt",
        "2 teaspoons ground black pepper",
        "1/2 cup extra-virgin olive oil",
        "1 pound yellow onions, finely chopped",
        "10 cloves garlic, finely chopped",
        "10 1-quart canning jars with rings and lids",
        "10 teaspoons salt, divided",
        "1 3/4 cups bottled lemon juice, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tomato Harvest Marinara Sauce",
    "url": "http://allrecipes.com/recipe/229024/tomato-harvest-marinara-sauce/"
}
