{
    "directions": [
        "Fill a small pot halfway with water. Bring to a boil; add egg and cook for 15 minutes. Drain. Run cold water over egg and let cool.",
        "Pour sesame oil into a large skillet. Add pork slices. Cover pork with half the olive oil, sesame seeds, basil, and sage. Flip and cover pork with remaining olive oil, sesame seeds, basil, and sage.",
        "Cook pork, covered, over medium-low heat, until evenly browned on the bottom, about 5 minutes. Flip and continue cooking until second side is browned, about 5 minutes more. Remove from heat.",
        "Bring a large pot of water to a boil. Add ramen noodles; cook for 3 minutes. Drain in a colander set in the sink; rinse noodles until water runs clear. Return noodles to the pot.",
        "Stir kombu, bonito stock, soy sauce, and miso paste into the noodles. Cook, stirring with chopsticks, over medium heat, until miso paste is dissolved, 3 to 5 minutes. Transfer noodles to a bowl.",
        "Peel and cut egg in half lengthwise. Top noodles with egg, pork slices, and fish paste slices. Garnish with tonkatsu sauce, ginger, green onion, and black pepper."
    ],
    "ingredients": [
        "1 egg",
        "1 1/2 teaspoons spicy sesame oil",
        "2 (1x3-inch) boneless pork chop slices",
        "2 tablespoons olive oil, divided",
        "1 tablespoon black sesame seeds, divided",
        "2 leaves fresh basil, chopped, divided",
        "1 leaf fresh sage, chopped, divided",
        "1 (3 ounce) package instant ramen noodles (such as Shirakiku®), seasoning packet discarded",
        "3 tablespoons shredded dried kombu",
        "1 3/4 tablespoons bonito soup stock (such as Hondashi®)",
        "1 3/4 tablespoons soy sauce (shoyu)",
        "1/2 teaspoon white miso paste with dashi",
        "Toppings:",
        "4 1/3-inch slices fish paste stick (naruto)",
        "1 tablespoon tonkatsu sauce",
        "1 tablespoon sushi ginger (shoga), finely chopped",
        "1 green onion, thinly sliced",
        "1 pinch ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tonkatsu Shoyu Ramen (Pork Cutlet Soy Sauce Ramen)",
    "url": "http://allrecipes.com/recipe/254262/tonkatsu-shoyu-ramen-pork-cutlet-soy/"
}
