{
    "directions": [
        "Bring a large pot of salted water to a boil, filling pot slightly less than normal. (This increases the amount of starch leached from the pasta as it boils.)",
        "Add pasta and cook, stirring frequently, until al dente, about 10 minutes. Drain pasta, transferring 6 cups pasta cooking liquid to a medium saucepan; keep warm. Wipe out pasta pot.",
        "Cook oil, pepper, and butter in pasta pot over high heat, stirring, until fragrant, 2 minutes. Add 1 1/2 cups pasta cooking liquid, bring to a boil, and cook, stirring occasionally, until reduced by half, 3–4 minutes. Add pasta and 1 1/2 cups pasta cooking liquid and cook over high heat, stirring vigorously to help draw starch from pasta, until sauce is thickened, about 5 minutes.",
        "Remove pot from heat and add 1 cup pasta cooking liquid. Add 3 cups Pecorino Romano in large handfuls, stirring and tossing vigorously with tongs, until very creamy. Stir in Grana Padano, adding more pasta cooking liquid if pasta is dry. Transfer to a serving bowl and serve immediately with more Pecorino Romano on the side."
    ],
    "ingredients": [
        "Kosher salt",
        "1 1/2 pounds dried tonnarelli or spaghetti alla chitarra",
        "1/4 cup olive oil",
        "2 tablespoons freshly ground black pepper",
        "2 tablespoons unsalted butter",
        "3 cups finely grated Pecorino Romano (about 6 ounces), plus more for serving",
        "1/2 cup finely grated Grana Padano (about 1 ounce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Cheese",
        "Kid-Friendly",
        "Quick & Easy",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tonnarelli a Cacio e Pepe",
    "url": "http://www.epicurious.com/recipes/food/views/tonnarelli-a-cacio-e-pepe"
}
