{
    "directions": [
        "Trim the roots from the end of the leeks and peel off the tough outer leaves. Cut off the green tops and save for soup. Slice the leeks in half and carefully rinse in warm water to eliminate all dirt between the leaves. Cut the leeks into 1/2-inch slices.",
        "Bring 6 cups water to a rolling boil in a 3-quart pot. Add 1 to 2 teaspoons salt and sprinkle the cornmeal into the water, stirring with a whisk to prevent lumping. Place the pot in another, larger pot of boiling water (or the bottom of a double boiler over boiling water) and cook over low heat for 45 minutes or until creamy.",
        "While the polenta is cooking, sauté the sausage over high heat in a large nonstick skillet, mashing with a wooden spoon to crumble the sausage. Remove the sausage with a slotted spoon and add to the polenta. Traditionalists will utilize the fat rendered by the sausage but I throw it out.",
        "Place the leeks in the skillet, drizzle with extra virgin olive oil (or use the sausage fat), and cook over low heat for 10 minutes or until soft.",
        "Add the leeks to the polenta and continue cooking until the farinata  is done, 45 minutes in all.",
        "Ladle the farinata  into soup bowls and top each bowl with a sprinkle of grated cheese, a drizzle of extra virgin olive oil, and a few twists of freshly ground pepper."
    ],
    "ingredients": [
        "2 leeks, about 2 cups chopped",
        "6 cups water",
        "1 to 2 teaspoons salt",
        "1 cup cornmeal",
        "1 pound sausage, casing removed",
        "3 tablespoons extra virgin olive oil plus more for garnish",
        "freshly ground black pepper",
        "1/2 cup grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Vegetable",
        "Fall"
    ],
    "title": "Torquato's Leek and Sausage Farinata",
    "url": "http://www.epicurious.com/recipes/food/views/torquatos-leek-and-sausage-farinata-40034"
}
