{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "On a baking sheet, toss the tomatillos, garlic, jalapenos and onions with 1/4 cup canola oil. Season with salt and pepper. Roast in the oven until everything is nice and soft, 20 to 25 minutes. Reduce the oven heat to 200 degrees.",
        "Transfer the roasted vegetables to the bowl of a food processor and process until smooth. Pulse in the lime juice and honey. Set aside.",
        "Heat 1 tablespoon canola oil in a large skillet. Add the shredded chicken, season with salt and pepper, and cook, stirring a bit, to just warm the chicken, about 2 minutes. Stir in the salsa and cook until warmed through, another 1 to 2 minutes. Cover and keep warm.",
        "Heat 2 tablespoons canola oil in a medium nonstick pan over medium-high heat. When hot, add the chicken skin and cook until golden brown and crispy on both sides, about 20 seconds. With a slotted spoon, remove the chicken skin to a paper-towel-lined plate and season with salt and pepper.",
        "Whisk together the eggs in a large baking dish until light and fluffy. Sprinkle with salt and pepper, and add a few dashes of hot sauce if using.",
        "Heat 2 tablespoons canola oil in a large nonstick pan until it begins to shimmer. Dip a tortilla in the egg mixture and turn to coat; make sure the tortilla is totally submerged and fully covered in egg. Transfer the tortilla to the pan, letting excess egg run off; fry until golden brown on both sides, about 1 1/2 minutes per side. Remove to a plate. Repeat with the remaining tortillas.",
        "Stir the chopped cilantro into the chicken mixture. Spoon some of the chicken and salsa verde across the center of the tortillas, leaving 2-inch borders on either end. Top the chicken with some Cheddar and Monterey Jack and some of the crispy chicken skin. Fold the short sides of the tortilla over the ends of the chicken, then roll up into a burrito and place, seam-side down, on serving plate. Keep the first two burritos warm in the oven while you repeat with the remaining tortillas and filling.",
        "To serve, dollop each burrito with some creme fraiche and garnish with cilantro leaves. Serve hot."
    ],
    "ingredients": [
        "6 tomatillos, husks removed, halved or quartered",
        "4 whole garlic cloves",
        "3 jalapenos, stems removed, halved lengthwise",
        "1 small red onion, coarsely chopped",
        "Canola oil",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup fresh lime juice",
        "2 tablespoons honey",
        "1 store-bought rotisserie chicken, skin removed and cut into pieces, meat shredded in large pieces",
        "5 large eggs",
        "Few dashes hot sauce, optional",
        "Four 10-inch flour tortillas",
        "1/2 cup chopped fresh cilantro, plus whole leaves for serving",
        "3/4 cup grated sharp Cheddar",
        "3/4 cup grated Monterey Jack",
        "1/4 cup creme fraiche"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Mexican Chicken",
        "Chicken",
        "Poultry Recipes",
        "Salsa",
        "Omelet Recipes",
        "Burrito",
        "Tomatillos",
        "Vegetable",
        "Egg Recipes",
        "Main Dish Recipes",
        "Brunch"
    ],
    "title": "Tortilla Omelet Burrito with Pulled Chicken and Salsa Verde",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/tortilla-omelet-burrito-with-pulled-chicken-and-salsa-verde"
}
