{
    "directions": [
        "Preheat broiler.",
        "Coarsely chop onion. In a well-seasoned 9-inch cast-iron or other heavy ovenproof skillet arrange onion, tomatoes, and garlic in one layer and broil about 2 inches from heat, turning vegetables occasionally with tongs, until tomato skins are blistered and lightly charred, about 20 minutes. Cool vegetables.",
        "While vegetables are broiling, remove stems, seeds, and ribs from chilies (wear rubber gloves). Heat a dry griddle or heavy skillet over moderate heat until hot but not smoking and toast chilies, 1 or 2 at a time, pressing down with tongs, a few seconds on each side, or until more pliable. Transfer chilies as toasted to a bowl. Cover chilies with hot water and soak about 20 minutes, or until soft.",
        "Drain chilies, discarding soaking liquid, and in a blender purée with vegetable mixture until smooth.",
        "Cut 6 tortillas into quarters and cut remaining 4 tortillas into 1/4-inch-wide strips. In cleaned 9-inch skillet heat 1/2 inch oil until a deep-fat thermometer registers 375°F. and fry tortilla quarters in 3 batches, turning them, until crisp and pale golden, 30 seconds to 1 minute. With a slotted spoon transfer quarters as fried to paper towels to drain.",
        "Fry tortilla strips in 2 batches in same manner, transferring with tongs to paper towels to drain and keeping them separate from fried tortilla quarters. In a plastic bag with a rolling pin finely crush tortilla quarters.",
        "In a 5-quart heavy kettle bring stock and chili pur\u2029e to a boil, stirring. Stir in crushed tortillas, oregano, and salt and simmer, uncovered, whisking occasionally, until tortillas are soft and soup is slightly thickened, 30 to 45 minutes. If necessary, season soup with salt and pepper.",
        "Quarter avocados, removing pits, and peel. Cut avocados into 1/4-inch dice and finely chop tomato. Wearing rubber gloves, finely chop chilies, including seeds if desired. In a bowl gently stir together avocados, tomato, onion, chilies, and remaining relish ingredients until combined well.",
        "Divide relish, fried tortilla strips, and coriander among 8 soup plates and ladle soup over mixture. Garnish soup with lime wedges."
    ],
    "ingredients": [
        "1/2 white onion",
        "1 pound plum tomatoes",
        "6 peeled garlic cloves",
        "2 [dried] guajillo chilies* (about 1 ounce)",
        "2 [dried] ancho chilies* (about 1 ounce)",
        "ten 5- to 6-inch white corn tortillas",
        "about 2 cups peanut or vegetable oil for deep-frying",
        "8 cups chicken stock*",
        "1/2 teaspoon dried oregano, crumbled",
        "1 teaspoon coarse salt",
        "2 ripe California avocados",
        "1 small vine-ripened tomato",
        "2/3 cup finely chopped white onion (about 1/2 onion)",
        "1 to 2 fresh serrano chilies",
        "2 tablespoons chopped fresh coriander sprigs",
        "2 teaspoons fresh lime juice",
        "1 teaspoon coarse salt",
        "1/2 teaspoon coarsely crushed black peppercorns",
        "8 fresh coriander sprigs",
        "Garnish: lime wedges",
        "*available at Latino markets, specialty foods shops, and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Herb",
        "Onion",
        "Tomato",
        "Steak",
        "Avocado",
        "Hot Pepper",
        "Red Wine",
        "Fall",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Tortilla Soup with Crisp Tortillas and Avocado Relish",
    "url": "http://www.epicurious.com/recipes/food/views/tortilla-soup-with-crisp-tortillas-and-avocado-relish-101126"
}
