{
    "directions": [
        "Toast chiles in a dry heavy skillet (not nonstick) over medium-high heat, turning with tongs, until pliable and slightly changed in color, about 30 seconds. Coarsely crumble 1 pasilla chile and set aside.",
        "Purée tomatoes, onion, garlic, chiles de á:rbol (including seeds), and remaining 3 pasilla chiles with 1/2 cup stock in a blender.",
        "Heat lard in a large heavy pot over medium heat until it shimmers, then cook purée, stirring frequently, until reduced by half and beginning to stick to pot, 15 to 20 minutes. Stir in remaining 7 1/2 cups stock, epazote, and 1 teaspoon salt, then simmer, uncovered, 45 minutes.",
        "While soup simmers, heat 1 inch oil to 350°F in a deep 10-inch heavy skillet, then fry tortilla squares, a handful at a time, until golden, 30 to 45 seconds per batch. Transfer with a slotted spoon to paper towels to drain and season lightly with salt.",
        "Divide tortillas and avocado among soup bowls and ladle in soup. Sprinkle with cheese, drizzle with crema, and top with crumbled chile."
    ],
    "ingredients": [
        "4 dried pasilla chiles, wiped clean, stemmed, and seeded",
        "2 dried chiles de á:rbol, stemmed",
        "1/2 pound tomatoes, quartered",
        "1 large white onion, coarsely chopped",
        "2 large garlic cloves, chopped",
        "2 quarts rich and flavorful chicken stock ; or 5 cups reduced-sodium chicken broth diluted with 3 cups water",
        "2 tablespoons lard or vegetable oil",
        "1 teaspoon dried epazote or oregano, crumbled",
        "3 to 4 cups vegetable oil for frying",
        "12 (6-to 7-inch) corn tortillas, cut into 1-inch squares",
        "1 (6-to 8-ounces) avocado, cut into 1/2-inch pieces",
        "1/2 cup crumbled cotija cheese (also called queso añejo) or ricotta salata, crumbled (2 ounces)",
        "1/4 cup crema, or sour cream diluted with 1 tablespoon water",
        "Equipment: a deep-fat thermometer",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Onion",
        "Tomato",
        "Dinner",
        "Winter",
        "Tortillas",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tortilla Soup with Chiles and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/tortilla-soup-with-chiles-and-tomatoes-351417"
}
