{
    "directions": [
        "Preheat oven to 350°F.",
        "Wrap each garlic head in foil and roast until soft, about 1 hour. Unwrap and let cool. Peel cloves and set aside.",
        "In medium bowl, whisk together egg yolks and lemon. Set aside.",
        "Place 2 tablespoons hot water in small bowl. In small, dry skillet over moderate heat, toast saffron for 30 seconds. Stir into hot water, then fold saffron water into egg mixture.",
        "In blender, combine 4 tablespoons canola oil, raw garlic, roasted garlic, and salt. Blend on high speed until creamy, about 2 minutes. Add egg mixture and blend 1 more minute. With motor running, very slowly add olive oil and remaining canola oil in steady stream, and continue blending until thick, about 2 minutes. Set aside.",
        "Preheat oven to 300°F",
        "In medium pot, combine potatoes and enough water to cover. Bring to boil, lower heat to moderately low, and cook, covered, until potatoes can be pierced with fork, about 5 minutes. Drain and set aside to cool.",
        "In small sauté pan, over moderate heat, sauté onions and garlic in vegetable oil until soft, about 5 minutes.",
        "In medium bowl, combine eggs, potatoes, onions, and garlic. Heat 10-inch nonstick skillet over medium heat and add egg mixture. Cook 4 minutes, then invert tortilla into ovenproof nonstick pan. Cover and bake until just set, about 10 minutes. Serve with saffron aïoli."
    ],
    "ingredients": [
        "2 whole heads garlic",
        "3 large egg yolks",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon saffron threads",
        "3/4 cup canola oil",
        "8 garlic cloves, minced",
        "1 teaspoon salt",
        "3/4 cup extra-virgin olive oil",
        "2 small boiling potatoes, peeled and cut into 1-inch pieces",
        "1/4 medium onion, finely chopped",
        "1 large garlic clove, minced",
        "1 tablespoon vegetable oil",
        "2 large eggs, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Egg",
        "Onion",
        "Sauté",
        "Cocktail Party"
    ],
    "title": "Tortilla Espanola with Saffron Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/tortilla-espanola-with-saffron-aioli-235622"
}
