{
    "directions": [
        "Cut slit in 1 long side of each chile; pull open. Remove seeds and membranes; press chiles flat. Cut pasilla chiles into 1x1/4-inch strips.",
        "Cut 6 tortillas into 1x1/4-inch strips. Heat 2/3 cup oil in heavy medium skillet over medium-high heat until very hot. Working in batches, add tortilla strips to skillet; toss until crisp and golden, about 1 minute. Using slotted spoon, transfer strips to paper towels. One at a time, fry 6 whole tortillas in oil until golden and almost crisp, about 30 seconds per side. Transfer to paper towels. Working in batches, add guajillo chiles to skillet; press with spatula until chiles begin to blister, about 10 seconds per side. Transfer to paper towels. Add pasilla chile strips to skillet; stir 10 seconds. Transfer to paper towels to drain.",
        "Combine tomatoes and next 5 ingredients in heavy large pot. Coarsely crumble whole tortillas, then guajillo chiles into pot. Bring to boil. Reduce heat to medium; cover and simmer until water is almost absorbed and chiles are soft, stirring occasionally, about 6 minutes. Working in 3 batches, puree mixture in blender until smooth, adding 1/4 cup broth to each batch. Heat 2 tablespoons oil in large saucepan over medium-high heat. Add tomato mixture; stir until thick and deeper in color, about 2 minutes. Add 3 1/4 cups broth; bring to boil. Simmer 8 minutes to develop flavors. Season with salt.",
        "Ladle soup into bowls. Garnish each serving with tortilla strips, chile strips, cheese, diced avocado, and crema.",
        "*Cultured Mexican cream with a slightly nutty flavor and consistency of thin sour cream."
    ],
    "ingredients": [
        "6 dried guajillo chiles, stemmed",
        "2 dried pasilla chiles, stemmed",
        "12 5- to 6-inch-diameter white corn tortillas",
        "2/3 cup plus 2 tablespoons corn oil",
        "2 cups coarsely chopped plum tomatoes",
        "1 1/2 cups water",
        "1/4 small white onion",
        "2 large garlic cloves",
        "1 large sprig fresh epazote or 2 large fresh cilantro sprigs",
        "Pinch of baking soda",
        "4 cups low-salt chicken broth",
        "1/2 cup crumbled queso fresco",
        "1 small avocado, peeled, pitted, diced",
        "1/4 cup crema mexicana* or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Herb",
        "Tomato",
        "Hot Pepper",
        "Winter",
        "Tortillas",
        "Simmer"
    ],
    "title": "Tortilla Soup",
    "url": "http://www.epicurious.com/recipes/food/views/tortilla-soup-108033"
}
