{
    "directions": [
        "Mix flour, cornmeal, and salt in a bowl.  Cut in butter with pastry blender until mixture resembles coarse crumbs.  Beat 2 eggs with 3 tablespoons cold water; stir into flour mixture until dough holds together.  Add another tablespoon water if needed.  Shape 2/3 of the dough into flattened round; repeat with remaining 1/3.  Wrap.  Refrigerate at least 30 minutes, or until firm enough to roll.",
        "In another bowl, combine ricotta cheese, crumbled feta, Parmesan cheese, 1 egg, parsley, basil, and oregano until well blended.",
        "Have an 8 or 9 inch springform pan ready.  On a lightly floured surface, roll out the larger portion of dough into a 15 inch diameter circle.  Carefully place in ungreased pan;  press lightly against bottom and sides.  Trim overhanging dough to 1 inch from pan rim.",
        "Scatter half of the mozzarella over the bottom of the crust. Next arrange half the ham slices in an even layer. Spread with ricotta cheese mixture, then sprinkle with spinach.  Cover with the remaining ham slices.  Press down gently to pack layers.  Add red peppers in a single layer, and  top with the remaining mozzarella. Press down again.",
        "Roll out remaining dough to 8 or 9 inch circle.  Place over filling to cover.  Moisten edges, and seal crusts together.  Crimp or flute edges.  Crust should not extend above pan rim.  Beat remaining egg, and brush over the crust.  Cut several small vents in top crust for steam to escape.",
        "Bake at 375 degrees F (190 degrees C) for 1 hour, or until crust is deep golden brown and pulls away from sides.  Cool in pan on wire rack 45 minutes.  Remove pan sides; cool completely.  Cut into 12 wedges.  Serve at room temperature."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "3/4 cup cornmeal",
        "1/2 teaspoon salt",
        "3/4 cup butter, diced",
        "2 eggs",
        "4 tablespoons cold water",
        "1 1/2 cups ricotta cheese",
        "4 ounces feta cheese",
        "1 cup grated Parmesan cheese",
        "1 egg",
        "1/4 cup chopped parsley",
        "2 tablespoons chopped fresh basil",
        "2 teaspoons chopped fresh oregano",
        "2 cups shredded mozzarella cheese",
        "1/2 pound ham slices",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "1/2 (16 ounce) jar roasted red peppers, drained and patted dry",
        "1 egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Torta Rustica",
    "url": "http://allrecipes.com/recipe/12562/torta-rustica/"
}
