{
    "directions": [
        "Place beans in heavy large pot. Add enough cold water to cover by 2 inches. Add 1/2 cup onion, epazote, lard, garlic, and aniseed; bring to boil over high heat. Reduce heat to low, cover, and simmer until beans are just tender, adding more boiling water by cupfuls if less than 1 inch of water covers beans, and stirring occasionally, about 1 hour (beans should have soupy consistency). Season beans generously with salt; continue to simmer until very tender, about 15 minutes longer. (Can be made 2 days ahead. Cool slightly, cover, and chill. Rewarm beans before continuing.)",
        "Drain beans, reserving bean cooking liquid. Place 3 cups beans (about half) and 1 1/2 cups bean cooking liquid in blender. Puree until smooth. Transfer sauce to large saucepan. Repeat with remaining beans and bean cooking liquid (supplementing with water if necessary). Season sauce with salt and pepper. Bring sauce to simmer; reduce heat and keep warm over low heat.",
        "Heat oil in heavy medium skillet over medium heat. Add 1 tortilla and heat 20 seconds. Using tongs, turn tortilla over and cook until beginning to bubble and soften, about 20 seconds longer. Dip tortilla into warm bean sauce to coat. Place tortilla on plate; fold into quarters. Repeat with remaining tortillas and sauce, arranging 3 folded tortillas in center of each of 6 plates. Spoon additional bean sauce over. Top with cheese, remaining 1/2 cup onion, cilantro, and crema, then pickled jalapeño chile half.",
        "*Cultured Mexican cream with a slightly nutty flavor and consistency of thin sour cream."
    ],
    "ingredients": [
        "1 pound dried black beans, rinsed",
        "1 cup chopped white onion",
        "4 large fresh epazote sprigs or marjoram sprigs",
        "2 tablespoons lard or corn oil",
        "2 large garlic cloves, halved",
        "1 1/4 teaspoons aniseed, ground or finely crushed in plastic bag or in mortar with pestle",
        "1/2 cup corn oil (for frying)",
        "18 5- to 6-inch-diameter white corn tortillas",
        "1 1/2 cups crumbled queso fresco or feta cheese (about 6 ounces)",
        "1/2 cup chopped fresh cilantro",
        "6 tablespoons crema mexicana* or sour cream",
        "3 pickled jalapeño chiles, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Brunch",
        "Fry",
        "Vegetarian",
        "Lunch",
        "Buffet",
        "Spring",
        "Anise",
        "Jalapeño",
        "Sour Cream",
        "Tortillas",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tortillas in Black Bean Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tortillas-in-black-bean-sauce-108041"
}
