{
    "directions": [
        "Put beans in a 4-quart pot and cover with water by 2 inches. Bring to a boil and boil 1 minute, then remove from heat and let beans and water stand in pot, covered, 1 hour. Drain, discarding water.",
        "Return drained beans to pot and add 7 cups water. Add onion, garlic, and salt and bring to a boil, skimming froth. Reduce heat and simmer beans, partially covered, until tender, 45 minutes to 1 hour. Do not drain.",
        "Purée 2 cups beans with 2 cups bean broth, including some of onion and garlic if desired, in a blender until smooth (use caution if puréeing while hot); reserve remaining beans in broth for another use.",
        "Heat a dry 10-inch heavy skillet (not nonstick) over moderate heat until hot, 2 to 3 minutes.",
        "Toast chile and avocado leaf, turning with tongs, until fragrant, about 10 seconds total. Open chile (wear protective gloves), then discard stem and seed cluster. Grind chile in grinder with avocado leaf to a powder.",
        "Heat 3 tablespoons oil in a 12-inch heavy skillet over moderate heat until hot but not smoking. Add bean purée and ground chile mixture and simmer, stirring frequently, until thickened but still liquid, 5 to 10 minutes, then reduce heat to very low.",
        "Meanwhile, heat remaining 1 1/2 cups oil in cleaned 10-inch heavy skillet over moderate heat until hot but not smoking.",
        "Have ready a heated serving platter. Add 1 tortilla to hot oil and soft-fry, turning over once with tongs, until puffed slightly but not crisp, about 10 seconds total, then lift out with tongs, letting excess oil drip back into skillet. Transfer tortilla to bean purée, submerging tortilla in purée, and spooning purée over it if necessary to completely coat top. Fold tortilla in half, using a metal spatula, and transfer to one end of warm platter.",
        "Fry and coat remaining tortillas, 1 at a time, in same manner, overlapping them on platter. Drizzle crema over tortillas and sprinkle with cheese, then serve enfrijoladas immediately.",
        "*Found in some supermarkets, Latino markets, and kitchenmarket.com."
    ],
    "ingredients": [
        "1/2 pound dried black beans, picked over",
        "7 cups water",
        "1 medium onion, halved",
        "2 garlic cloves, peeled and smashed",
        "1/2 tablespoon salt",
        "1 dried guajillo chile*",
        "1 dried avocado leaf",
        "1 1/2 cups plus 3 tablespoons corn oil",
        "12 (6- to 7-inch) corn tortillas",
        "1/2 cup crema or crème fraîche, thinned to pouring consistency with water if necessary",
        "1 cup crumbled queso fresco or mild feta (1/4 pound)",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Bean",
        "Garlic",
        "Herb",
        "Onion",
        "Vegetable",
        "Vegetarian",
        "Feta",
        "Avocado",
        "Summer",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Tortillas in Black-Bean Purée",
    "url": "http://www.epicurious.com/recipes/food/views/tortillas-in-black-bean-puree-235024"
}
