{
    "directions": [
        "Heat 1/2 cup olive oil in a large skillet over medium-low heat. Add half of the potato slices, and cook, stirring occasionally, until just tender, 15 to 20 minutes. When done, remove potatoes to a large bowl, leaving oil in the skillet. Cook the remaining potatoes in the oil until tender, then add to the bowl, leaving oil in the skillet. Gently toss potatoes with salt and pepper to taste.",
        "Meanwhile, heat 2 tablespoons olive oil in a skillet over medium heat. Stir in onion rings, and gently cook until soft and golden brown, about 15 minutes. Spoon onions onto a plate, and allow to cool while the potatoes finish cooking.",
        "Whisk eggs in a large bowl until smooth. Stir in cooled onions, roasted peppers, and serrano ham. Gently fold in cooked potatoes.",
        "Heat the skillet with the reserved oil over low heat. Pour in the egg mixture, and gently cook until the sides have started to set and the bottom has turned golden brown, 8 to 10 minutes. Loosen the tortilla with a spatula if needed, then carefully slide onto a large plate. Turn the skillet upside down and place onto the uncooked side of the tortilla. Turn the skillet right-side-up, and remove the plate. Return the skillet to the stove, and continue cooking until the tortilla has set in the center, about 4 minutes.",
        "Slide the tortilla onto a serving plate and allow to cool to room temperature. Cut into six wedges and sprinkle with parsley to serve."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "2 pounds baking potatoes, peeled and cut into 1/4-inch slices",
        "salt and pepper to taste",
        "2 tablespoons olive oil",
        "2 onions, sliced into rings",
        "6 eggs",
        "1 roasted red pepper, drained and cut into strips",
        "3 ounces Spanish serrano ham, chopped",
        "2 tablespoons chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tortilla Espanola (Spanish Tortilla)",
    "url": "http://allrecipes.com/recipe/147109/tortilla-espanola-spanish-tortilla/"
}
