{
    "directions": [
        "Cook parsnips in medium saucepan of boiling salted water until very tender, about 20 minutes. Drain; reserve saucepan. Transfer parsnips to processor. Add 1 1/2 cups milk. Blend until smooth. With machine running, gradually add remaining 1 cup milk through feed tube. Add 3/4 cup Parmesan cheese and nutmeg; blend well. Return sauce to reserved pan. Simmer over low heat until reduced to 3 cups, whisking often, about 5 minutes. Season béchamel sauce to taste with salt and freshly ground black pepper.",
        "Melt 2 1/2 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms, garlic, and rosemary. Sauté until mushrooms are brown and tender, 6 to 7 minutes. Season to taste with salt and pepper. DO AHEAD: Béchamel sauce and mushrooms can be made 1 day ahead. Cool, cover separately, and chill. Rewarm béchamel sauce before using.",
        "Preheat oven to 400°F. Butter 12-cup- capacity baking dish. Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain pasta; return to pot. Add remaining 2 tablespoons butter and toss to coat. Stir in mushroom mixture. Transfer pasta to prepared baking dish. Spread béchamel sauce over; sprinkle with Gorgonzola, then remaining 1/4 cup Parmesan.",
        "Bake pasta until heated through and sauce is bubbling, 18 to 20 minutes. If desired, broil until top is golden, about 2 minutes. Let stand 10 minutes and serve."
    ],
    "ingredients": [
        "12 ounces of parsnips",
        "2 1/2 cups whole milk, divided",
        "1 cup freshly grated Parmesan cheese, divided",
        "Large pinch of freshly grated nutmeg",
        "4 1/2 tablespoons butter, divided",
        "1 1/4 pounds baby portobello mushrooms (portobellini), thinly sliced",
        "2 large garlic cloves, finely chopped",
        "2 teaspoons minced fresh rosemary",
        "3 8-to 9-ounce packages cheese-filled tortellini or tortelloni",
        "6 ounces imported creamy Gorgonzola dolce cheese, cut into small pieces (about 1 1/2 cups)",
        "Ingredient Info: Gorgonzola dolce is milder and softer than regular Gorgonzola."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Pasta",
        "Bake",
        "Dinner",
        "Buffet",
        "Casserole/Gratin",
        "Blue Cheese",
        "Parsnip",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tortellini Gratinata with Mushrooms and Parsnip \"Béchamel",
    "url": "http://www.epicurious.com/recipes/food/views/tortellini-gratinata-with-mushrooms-and-parsnip-bechamel-364034"
}
