{
    "directions": [
        "Roast the bones",
        "Preheat an oven to 400°F.",
        "Arrange the bones in a single layer in a roasting pan. Add the carrot and onion slices. Roast until the bones are browned, 45 to 60 minutes. Transfer the bones and vegetables to a stockpot or Dutch oven.",
        "Simmer the stock",
        "Add the water, salt and pepper to the stockpot. Bring to a boil over medium heat. Using a slotted spoon, skim off any foam from the surface and then add the celery, leeks and garlic. Reduce the heat to low, cover partially and simmer for 4 to 5 hours, skimming any foam from the surface. Remove the bones from the pot and discard. Pour the contents of the pot through a fine-mesh sieve into a large bowl and discard the solids.",
        "Cook the tortellini",
        "In a saucepan over medium-high heat, bring 6 cups of the stock to a boil. Add the tortellini and cook for about 5 minutes, or according to the package instructions. Season with salt and pepper.",
        "Ladle the tortellini and stock into warmed bowls, garnish with the cheese and basil and serve immediately. Serves 4; makes about 5 quarts stock total.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Soup",
        ", by Georgeanne Brennan (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "6 lb. beef and veal soup bones",
        "3 carrots, cut into 1/2-inch-thick slices",
        "3 yellow onions, cut into 1/2-inch-thick slices",
        "8 quarts water",
        "1 Tbs. salt",
        "2 tsp. freshly ground pepper",
        "3 celery stalks, coarsely chopped",
        "2 leeks, white and light green parts, halved, rinsed and coarsely chopped",
        "1 garlic clove",
        "",
        "12 oz. cheese tortellini",
        "Salt and freshly ground pepper, to taste",
        "1/3 cup grated Parmigiano-Reggiano cheese",
        "1/4 cup slivered fresh basil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Tortellini in Broth",
    "url": "http://www.williams-sonoma.com/recipe/tortellini-in-broth.html"
}
