{
    "directions": [
        "Remove stems, seeds, and membranes from chiles, then break into large pieces and set aside.",
        "In 4-quart saucepan over moderate heat, heat oil until hot but not smoking. Add onion, garlic, cloves, cinnamon, peppercorns, and cumin seeds and cook until onion is soft and golden brown, about 6 minutes. Add chilies and cook until darkened on both sides, about 1 minute.",
        "Add enough water to cover mixture halfway and bring to boil. Continue boiling until liquid reduces by half, about 5 to 8 minutes. Transfer mixture to blender and purée until smooth. Strain, pressing on solids with rubber spatula and discarding solids.",
        "In re-sealable, 1-gallon, plastic bag, place 1/2 cup adobo sauce, orange juice, vinegar, honey, salt, and pepper. Add pork loin, seal, and chill at least 2 hours and no more than 6 hours.",
        "Preheat grill (medium heat) or broiler.",
        "Remove pork from marinade and discard marinade. Grill or broil pork about 6-inches from heat, turning occasionally, until internal temperature reaches 145°F, about 25 minutes. Let stand, loosely covered in foil, 10 minutes. Chop pork into small dice and place in medium saucepan. Add 1/4 cup adobo and keep warm over low heat.",
        "Grill or broil pineapple until it starts to get soft, about 3 to 5 minutes. Place in bowl and let cool. Once cool enough to handle, chop into small dice and return to bowl. Add oil, onion, cilantro, and lemon juice and stir to combine. Set aside.",
        "In blender puree oil and chives until smooth. Set aside.",
        "In 10-inch skillet over moderate heat, heat oil until hot but not smoking, add tomatillos and onion and cook until lightly browned and soft, about 10 minutes. Add garlic, chiles, salt, and pepper and cook until garlic is light brown, about 2 minutes. Remove from heat and check sauce. If bitter or sour, add 1 to 2 tablespoons honey.",
        "Transfer tomatillo mixture to blender, add cilantro, and purée until smooth. Season with salt and pepper and set aside.",
        "In medium bowl, mix together masa and 1 cup plus 2 tablespoons lukewarm water. Knead in bowl until soft dough forms, adding more water if dough seems too dry. Shape dough into 16 small balls, about 1 ounce each, and cover with kitchen towel.",
        "Heat griddle or heavy cast-iron skillet over medium heat, using two burners if necessary. If using two burners, keep part of surface a little cooler by turning one burner lower.",
        "Meanwhile, lay plastic wrap or waxed paper on bottom plate of tortilla press. Place ball of dough in center, and lay plastic wrap or wax paper on top. Lower top plate and press ball into circle. Raise top plate and peel off top piece of plastic wrap—the tortilla should be about 5 to 6 inches in diameter and about 1/8-inch-thick. Invert tortilla onto fingers of one hand and carefully peel off second piece of plastic wrap. Lay tortilla on cooler part of griddle, sweeping hand from underneath. Let tortilla sit until released from griddle, 10 to 15 seconds. Using fingers or spatula, carefully flip tortilla over, place on hotter part of griddle, and let cook until bottom begins to speckle with brown spots, 30-40 seconds. Flip tortilla over and let cook until bottom side becomes speckled, another 30 seconds or so. (Tortilla may puff a little.) Transfer to clean kitchen towel and cover with foil to keep warm. Repeat with remaining dough, cooking 2 tortillas at a time if possible. As you take tortillas off griddle, stack on clean kitchen towel and keep covered with foil.",
        "Transfer pork and pineapple to platter and place tomatillo sauce and chive oil in small bowls. Serve tortillas in covered basket to keep warm."
    ],
    "ingredients": [
        "10 dried guajillo chiles",
        "2 tablespoons canola oil",
        "1/2 medium white Spanish onion, thinly sliced",
        "2 garlic cloves, smashed with back of knife and peeled",
        "2 whole cloves",
        "6 (6-inch) cinnamon sticks, broken into thirds",
        "24 whole black peppercorns",
        "1/4 teaspoon cumin seeds, crushed",
        "1 cup adobo sauce",
        "1/4 cup freshly squeezed orange juice",
        "1 tablespoon sherry wine vinegar",
        "2 teaspoons honey",
        "1/4 teaspoon salt",
        "1/8 teaspoon freshly ground black pepper",
        "1 (1 1/4-pound) pork tenderloin, trimmed",
        "4 slices fresh pineapple (1/4 regular pinapple or 1 small pineapple)",
        "1 teaspoon canola oil",
        "1 cup white Spanish onions, finely chopped (1 medium onion)",
        "1 tablespoon fresh cilantro, finely chopped",
        "1 tablespoon fresh lemon juice (1/2 medium lemon)",
        "1 cup canola oil",
        "1/4 cup fresh chives, coarsely chopped",
        "1 tablespoon canola oil",
        "1 pound fresh tomatillos, husks removed, thoroughly rinsed, and quartered",
        "1/2 cup white Spanish onion, coarsely chopped (1/2 medium onion)",
        "1 large clove garlic",
        "2 fresh Serrano chiles, seeds removed, and chopped",
        "1/4 teaspoons kosher salt, plus more to taste",
        "1/8 teaspoon freshly ground black pepper, plus more to taste",
        "1 to 2 tablespoons honey, optional",
        "1 tablespoon fresh cilantro, coarsely chopped",
        "2 cups instant corn masa mix for tortillas",
        "*Store bought corn tortillas, heated following package directions, can be substituted.",
        "Special equipment: tortilla press"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Citrus",
        "Fruit",
        "Garlic",
        "Herb",
        "Onion",
        "Pork",
        "Broil",
        "Marinate",
        "Pineapple",
        "Grill/Barbecue"
    ],
    "title": "Tortillas with Grilled Adobo Pork and Pineapple",
    "url": "http://www.epicurious.com/recipes/food/views/tortillas-with-grilled-adobo-pork-and-pineapple-236064"
}
