{
    "directions": [
        "Heat oil in large nonstick skillet over medium-high heat. Add sliced fennel bulb, sausage, and mushrooms; sauté until sausage is brown and cooked through and fennel is almost tender, 12 to 15 minutes. Add garlic and fennel seeds; stir 1 minute. Stir in cream, then 1 cup broth; boil until liquid is reduced and very slightly thickened, 2 to 3 minutes.",
        "Meanwhile, cook tortellini in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain tortellini; return to same pot.",
        "Add sausage mixture to tortellini in pot. Toss over medium heat until blended. Add spinach; toss gently until spinach wilts. Stir in 1/2 cup cheese; add more broth by 1/4 cupfuls to moisten if dry. Season with salt and pepper, sprinkle with chopped fennel fronds, and serve, passing additional cheese."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 large fennel bulb, trimmed, halved through core, thinly sliced lengthwise (about 3 cups), fronds chopped",
        "1 pound spicy Italian sausages, casings removed, sausage coarsely crumbled",
        "1 8-ounce package sliced fresh crimini (baby bella) mushrooms",
        "4 large garlic cloves, pressed",
        "1 tablespoon fennel seeds, coarsely crushed",
        "1/2 cup heavy whipping cream",
        "1 cup (or more) low-salt chicken broth",
        "1 16-ounce package dried tortellini with pesto filling or fresh tortellini with 3-cheese filling",
        "1 5-ounce package fresh baby spinach leaves",
        "1/2 cup finely grated Parmesan cheese plus additional (for serving)",
        "**Test-kitchen tip:**To crush the fennel seeds, enclose the seeds in a heavy-duty resealable plastic bag, then pound them with a meat mallet or a small heavy skillet."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Pasta",
        "Quick & Easy",
        "Dinner",
        "Buffet",
        "Sausage",
        "Fennel",
        "Spinach",
        "Winter",
        "Family Reunion",
        "Potluck",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tortellini with Italian Sausage, Fennel, and Mushroom",
    "url": "http://www.epicurious.com/recipes/food/views/tortellini-with-italian-sausage-fennel-and-mushroom-362553"
}
