{
    "directions": [
        "Cut a thick plastic food-storage bag into two squares to fit the tortilla press.",
        "Put the masa harina in the bowl of a stand mixer fitted with the paddle attachment and slowly add 3 cups warm water, mixing on low speed. Begin to knead the masa by hand until it feels like soft dough and is slightly warmer than your body, 5 to 8 minutes. Cover the masa and let it rest for 10 to 15 minutes.",
        "Divide the masa into 30 balls of equal size.",
        "Heat a well-seasoned comal or cast-iron skillet over moderately high heat.",
        "Arrange the two plastic squares on the bottom plate of the tortilla press. Place a ball of masa between the squares, press slightly, then open the press, flip the tortilla over, and press again to form a thin, even tortilla. Place the tortilla, still between the plastic, on your left hand (if you are right handed, or vice versa). Peel off the top sheet of plastic. Invert the tortilla onto the closely spaced fingers of your right hand (not on your palm) and remove the other plastic sheet. Carefully slide the tortilla onto the comal or cast-iron skillet and cook for several seconds or until the tortilla begins to dry on the outer edges. Using a thin spatula, flip the tortilla and cook slightly longer on the other side, then flip again. The tortilla should start to puff, the two layers separating by steam. Do not overcook the tortillas or they will be dry and hard. Immediately transfer the tortillas to a kitchen towel. Cover and keep warm until served."
    ],
    "ingredients": [
        "4 cups masa harina",
        "Kosher salt",
        "Special equipment: Tortilla press"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Side",
        "Hominy/Cornmeal/Masa",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tortillas de Masa Harina",
    "url": "http://www.epicurious.com/recipes/food/views/tortillas-de-masa-harina-51110230"
}
