{
    "directions": [
        "The lettuce may be Bibb or Boston, romaine or leaf; the greens may be a few leaves of any or all of those listed above, or you may select others of your choosing. The prime requisite is that they be fresh and crisp, well washed and thoroughly dried. No drop of water should be allowed to lurk in the fold of a leaf, or the salad will be watery and quick to wilt.",
        "Rub an outsize salad bowl with the garlic, peeled and halved, until there is a good coating well up on all sides. Break the lettuce and greens into the bowl. Snip the herbs small and crush them lightly as you add them to the greens. Measure the oil into a big spoon and sprinkle it over the salad. Dissolve the salt and pepper in the vinegar in the same spoon, and sprinkle this on the salad. Then begin a light and rhythmic tossing, which is more a gentle turning of the greens over and over until every leaf is coated and the seasonings well distributed. Add the chives, taste to see if more salt is needed, then serve."
    ],
    "ingredients": [
        "1 clove garlic",
        "1 head lettuce",
        "Salad greens: curly endive, celery cabbage, leaves of spinach, rhubarb chard, sprigs of watercress",
        "1 teaspoon each fresh cut dill, basil, marjoram, chervil",
        "8 tablespoons olive oil",
        "2 tablespoons wine vinegar",
        "1 teaspoon salt",
        "1/2 teaspoon pepper",
        "1 tablespoon chopped chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Appetizer",
        "No-Cook",
        "Quick & Easy",
        "Spinach",
        "Summer",
        "Cabbage",
        "Endive",
        "Watercress",
        "Lettuce",
        "House & Garden",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tossed Green Salad with Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/tossed-green-salad-with-herbs-20065"
}
