{
    "directions": [
        "Preheat broiler. Arrange chiles in a single layer on a rimmed baking sheet. Broil, turning once, until blackened in spots, about 15 minutes. Transfer chiles to a large bowl, cover with plastic wrap, and let steam 15 minutes. Peel, seed, devein, and thinly slice chiles lengthwise.",
        "Meanwhile, prepare a grill or grill pan for medium-high heat. Grill corn, turning occasionally, until kernels are tender and charred in spots, 15–20 minutes. Let cool, then cut kernels off cob.",
        "Heat oil in a large skillet over medium. Add onion and cook, stirring occasionally, until light golden and tender, 10–12 minutes. Reduce heat to low, add chiles, corn, and 1 tsp. salt, and cook, stirring occasionally, until warmed through, about 2 minutes. Stir in crema and just heat through (do not bring to boil)-vegetables should be just coated; add more crema if needed. Season with salt.",
        "If frying tortillas, fit a large skillet with candy or deep-fry thermometer; pour in oil to measure 1\". Heat over medium-high until thermometer registers 375°F. Fry tortillas in batches until crispy, turning every 30 seconds, about 2 minutes total. Drain on paper towel-lined baking sheets and season with salt.",
        "Spread 1 Tbsp. Creamy Black Bean Spread, if using, on a tostada shell. Top with 1/4 cup rajas, then lettuce, onion, queso fresco, and cilantro. Repeat with remaining tostada shells. Serve at room temperature.",
        "Rajas can be chilled for up to 1 day. Reheat and let cool to room temperature before serving."
    ],
    "ingredients": [
        "10 poblano chiles",
        "2 ears of corn, husked",
        "2 tablespoons vegetable oil",
        "1 large white onion, thinly sliced",
        "1 teaspoon kosher salt, plus more to taste",
        "1/4 cup crema (Mexican salted cream) or sour cream",
        "16 small corn tortillas or store-bought crispy tostada shells",
        "Vegetable oil (for frying; if needed)",
        "Kosher salt (if needed)",
        "1 1/2 cups Creamy Black Bean Spread (optional)",
        "Shredded iceberg lettuce, thinly sliced white onion, queso fresco, cilantro leaves with tender stems (for serving)",
        "A candy or deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Spring",
        "Summer",
        "Healthy",
        "Tortillas",
        "Chile Pepper",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tostadas with Creamy Roasted Poblanos and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/tostadas-with-creamy-roasted-poblanos-and-corn-56389834"
}
