{
    "directions": [
        "1. Heat a heavy sauté pan over high heat and add the onion halves, cut side down. Cook until they blacken on their cut sides, about 10 minutes.",
        "2. Fill a stockpot halfway with water and set it over high heat. When the water boils, salt it well, then add the meat, onions, and 2 of the marrowbones. Reduce the heat to medium-low. Partially cover the pot and bring the water to a very low simmer; it should bubble only slightly for the duration of the cooking time. Simmer for 3 hours, checking on the meat periodically, turning it occasionally and adding a little more water if necessary to keep the meat covered.",
        "3. Add the carrots, turnips, kohlrabi, celery root, juniper berries, allspice berries, pepper, and bay leaf. Simmer until the vegetables are cooked, 20 to 30 minutes. Use a slotted spoon to transfer the vegetables to a platter as they become tender. Continue to cook the meat until there is no resistance when it is pierced in its center with a long fork yet it still retains its shape, another 30 minutes.",
        "4. Place the remaining 3 marrowbones, marrow sides up, in a saucepan. Cover with cold water, and add the thyme and garlic. Bring to a simmer, then remove from the heat and let the bones poach until the marrow is translucent and soft, about 5 minutes. Drain the bones. Slide a paring knife around the inside of the hole to gently push the marrow free, and cut the marrow into 1/2-inch slices. Reheat the marrow in a 250°F oven or at a low setting in a microwave just before serving.",
        "5. Meanwhile, prepare the spinach puree: In a wide saucepan or sauté pan, melt 3 tablespoons of the butter over medium heat. Let it cook until the white milk solids fall to the bottom and turn nut-brown, 2 to 3 minutes. Add the shallots and 1/2 teaspoon of the salt, and cook, stirring, until the shallots soften, 5 minutes. Add the garlic and continue to cook for 2 more minutes.",
        "6. Add the cream and thyme to the pan and bring the liquid to a boil. Simmer until reduced by one third, 3 to 4 minutes. Pour in the vegetable stock and let the liquid return to a boil. Add the spinach and cook gently, stirring and tossing, until it is tender, about 2 minutes.",
        "7. Remove the thyme. Use a slotted spoon to transfer the spinach to a blender or food processor, reserving 1/2 cup of the cooking liquid. Puree the spinach, and season it with the remaining 1/2 teaspoon salt, white pepper, a pinch of cayenne, and nutmeg to taste. If necessary, add some of the reserved cooking liquid so the puree is just loose enough to pour. Keep warm (or reheat gently before serving).",
        "8. Prepare the apple-horseradish sauce: Peel the apples, reserving the peels and submerging the apples in a bowl of water acidulated with the lemon juice.",
        "9. Place the apple peels in a small saucepan. Cover with 3/4 cup water and add the sugar, cinnamon stick, and clove. Bring to a boil and let simmer, stirring, until the sugar dissolves, about 5 minutes. Turn off the heat and let the peels steep in the liquid until cool.",
        "10. Place the horseradish in a large bowl and grate the apples finely over it. Strain the apple-peel liquid, and pour 1/2 cup of the liquid over the grated apple. Toss to combine. and add more horseradish if desired. Set aside.",
        "11. To prepare the chive mayonnaise, place the bread cubes in a bowl and cover with the milk. Let soak until soft, about 20 minutes.",
        "12. Use your hands to squeeze the milk from the bread cubes, and place them in a blender with the egg yolks, 1/4 cup broth taken from the kavalierspitz, chopped cornichons, crème fraîche, and sour cream. Blend to combine. With the motor running, add a few drops of Champagne vinegar, then drizzle in a small amount of the canola oil in a very thin stream, processing until the oil is absorbed before adding a little more vinegar. Continue alternating vinegar and oil until you have used it all. The mixture should be of a thick but pourable consistency, and just slightly piquant. Season it to taste with salt and white pepper, and set it aside. Just before serving, stir in the hard-cooked egg and chives.",
        "13. When the beef is tender, transfer it to a platter and cover it with plastic wrap. Strain the broth through a fine-mesh strainer. If you're not going to serve it immediately, place the beef in a clean pot, cover with the strained broth, and surround with the baby vegetables. Heat gently just before serving.",
        "14. To serve, slice the steak across the grain into 2-inch-wide pieces. Lay them in the center of each soup plate, and garnish with the baby vegetables. Ladle the cooking liquid on top of and around the meat. Garnish with a slice of bone marrow, and any or all of the garnishes (freshly grated horseradish, lovage, grated nutmeg, a sprinkle of fleur de sel, chopped chives). Serve with the spinach puree, apple horseradish sauce, and chive mayonnaise on the side.",
        "• \"To elevate and refine this traditional dish, we paid close attention to every detail, using only the highest-quality ingredients and sophisticated techniques,\" says Lohninger. He prefers the Kavalierspitz, a tender cut from the shoulder, over the more common tafelspitz cut from the upper leg. \"This was Kaiser Franz Josef's favorite cut,\" says Lohninger. \"Because it has gelatin running through the middle, it stays very moist and juicy.\" Kavalierspitz is sold in the United States as Yankee steak or chicken steak, and you'll probably have to call ahead at a good butcher to get it. Beef cheeks or short ribs could also be substituted.",
        "• \"The garnishes in this recipe are very authentic,\" says Lohninger. \"But if you're pressed for time, you can substitute unsweetened store bought applesauce mixed with a little horseradish for the applesauce recipe here, and sour cream mixed with chives for the white sauce. But in my opinion, you need the creamed spinach — or a cabbage dish — to really feel like you're having boiled beef.\".",
        "• Purple-black, pea-sized juniper berries are the flavoring in gin, so you'll recognize their piney-sweet flavor. In Austrian cooking they are added to everything from cabbage to meat. They're generally available in the spice section of better supermarkets. Look for berries that are still somewhat soft rather than hard and shriveled.",
        "• Kohlrabi are bulbous, green vegetables, sometimes tinged with purple, that are popular in Austrian cooking for their crisp, nutty, white flesh, similar to a mild turnip. Lovage is a celerylike vegetable. A mix of parsley and celery leaves can be substituted for the lovage leaves."
    ],
    "ingredients": [
        "1 large onion, halved crosswise",
        "Fine sea salt",
        "1 large or 2 small \"chicken steaks,\" from the chuck (about 4 1/2 pounds total), trimmed",
        "5 veal marrowbones",
        "6 baby carrots",
        "4 baby turnips",
        "4 small kohlrabi (see tips, below)",
        "1 celery root, quartered",
        "1 tablespoon juniper berries (see tips, below)",
        "1 teaspoon allspice berries",
        "Freshly ground black pepper",
        "1 bay leaf, preferably fresh, cut in half",
        "1 sprig fresh thyme",
        "1 garlic clove",
        "6 tablespoons unsalted butter",
        "3 shallots, diced",
        "1 teaspoon fine sea salt",
        "2 large garlic cloves, minced",
        "1/2 cup heavy cream",
        "1 sprig fresh thyme",
        "3/4 cup vegetable stock or canned low-sodium vegetable broth",
        "12 ounces (1 bunch) spinach, stems removed",
        "Freshly ground white pepper",
        "Cayenne pepper",
        "Freshly grated nutmeg",
        "3 Golden Delicious apples (1 1/2 pounds)",
        "Juice of 1 lemon",
        "2 tablespoons sugar",
        "1/2 cinnamon stick, about 3 inches",
        "1 whole clove",
        "2 tablespoons prepared horseradish, or more to taste",
        "1 cup cubed white bread, crusts removed",
        "3/4 cup whole milk",
        "2 extra-large egg yolks",
        "8 small cornichons, chopped",
        "1 heaping tablespoon crème fraîche",
        "1 heaping tablespoon sour cream",
        "1/4 cup Champagne vinegar",
        "1 1/2 cups canola oil",
        "Fine sea salt and freshly ground white pepper",
        "1 hard-cooked egg, finely diced",
        "3 tablespoons finely chopped fresh chives",
        "Optional Garnish",
        "Freshly grated horseradish",
        "Sliced fresh lovage leaves (see tips, below)",
        "Freshly grated nutmeg",
        "Fleur de sel (see Note)",
        "Finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Horseradish",
        "Apple",
        "Spinach",
        "Fall",
        "Winter"
    ],
    "title": "Traditional Boiled Beef with Spinach Purée, Apple Horseradish Sauce, and Baby Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/traditional-boiled-beef-with-spinach-puree-apple-horseradish-sauce-and-baby-vegetables-231040"
}
