{
    "directions": [
        "Place 1/2 cup milk in a cup or small bowl. Stir in sugar and sprinkle yeast over the top. Set aside until foamy, about 10 minutes. Pour the remaining milk into a large bowl.",
        "Add the melted butter, egg, salt and 1 cup of flour to the large bowl with the milk. Stir in the yeast mixture. Mix in flour 1 cup at a time until dough pulls away from the sides of the bowl and doesn't stick to your hands. Cover the bowl loosely and set in a warm place to rise for about 1 hour. Dough should almost triple in size.",
        "While you wait for the dough to rise, melt the remaining butter in a large skillet over medium heat. Add cabbage and cook, stirring frequently, until cabbage has wilted. Mix in the eggs and season with salt and pepper. Continue to cook, stirring occasionally until cabbage is tender. Set this aside for the filling.",
        "Place the risen dough onto a floured surface and gently form into a long snake about 2 inches wide. Cut into 1 inch pieces and roll each piece into a ball. Flatten the balls by hand until they are 4 to 5 inches across. Place a spoonful of the cabbage filling in the center and fold in half to enclose. Pinch the edges together to seal in the filling.",
        "Preheat the oven to 400 degrees F (200 degrees C). Line one or two baking sheets with aluminum foil. Place the pirozhki onto the baking sheet, leaving room between them for them to grow.",
        "Bake for 20 minutes in the preheated oven, or until golden brown."
    ],
    "ingredients": [
        "2 cups milk, warmed",
        "1 tablespoon white sugar",
        "1 tablespoon active dry yeast",
        "2 tablespoons butter, melted",
        "1 egg",
        "1 teaspoon salt",
        "6 cups all-purpose flour",
        "1 tablespoon butter",
        "1/2 medium head cabbage, finely chopped",
        "6 hard-cooked eggs, chopped",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Traditional Russian Pirozhki",
    "url": "http://allrecipes.com/recipe/140517/traditional-russian-pirozhki/"
}
