{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "In a medium-mixing bowl cut the shortening and salt into the flour by hand or with a pastry blender hands until it's the texture of cornmeal. Sprinkle 1 tablespoon of ice water over the mixture and mix just until the dough is moistened. Repeat by adding 6 to 8 tablespoons water (one at a time) until all the dough is just moist. Take care not to over mix.",
        "Preheat the oven to 375 degrees F. Divide the dough in half and roll into a ball. Roll 1 ball into a circle to fit a 9 to 10-inch pie plate. To transfer the pastry to the pie plate, wrap it around a rolling pin and ease it into the pie plate. Be careful not to stretch the pastry. Trim it even with the edges of the pie plate. Add the apple filling into the pastry lined pie plate. Make sure they are laying flat. Cut butter into small pieces and put on top of the filling.",
        "Roll the remaining pastry into a 12-inch circle. Place on top of the filling. Trim off 1-inch beyond the edge of the pie plate. Crimp the edges as desired. Cut slits to allow steam to escape when baking. Sprinkle a little sugar and cinnamon over the pie.",
        "Cover the edges with foil to prevent over browning. Bake for 25 minutes. Remove the foil and bake for another 20 to 25 minutes, or until it is golden brown. Serve warm with vanilla ice cream.",
        "In a medium bowl combine the apples, with the brown and white sugar. Add flour, cinnamon and continue mixing until they are well coated."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "3/4 cup shortening (recommended: Crisco)",
        "Ice water",
        "Filling, recipe follows",
        "Serving suggestion: warm with vanilla ice-cream",
        "1/2 cup to 1 cup all-purpose flour",
        "6 to 7 cups apples cut into thin slices (recommended: Green Golden and Jonathans)",
        "1 cup white sugar",
        "1 cup brown sugar",
        "1 teaspoon cinnamon",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Apple Pie",
        "Apple",
        "Fruit",
        "Pie Recipes",
        "Apple Dessert",
        "Fruit Dessert Recipes",
        "Dessert",
        "Baking",
        "Dairy Recipes",
        "Sugar",
        "Holiday",
        "Fall"
    ],
    "title": "Traditional Apple Pie",
    "url": "http://www.foodnetwork.com/recipes/traditional-apple-pie-recipe0"
}
