{
    "directions": [
        "In a small bowl, stir the yeast into the orange-flower water. Let it sit until dissolved, about 5 minutes.",
        "Sift the flour and salt into a large bowl. Make a well in the flour and add the eggs, sugar, oil, and the yeast mixture. Mix the liquid ingredients together, using your fingers, until blended. Add the zest, anise seeds, and candied fruit.",
        "Gradually incorporate the flour into the liquid mixture, mixing just until it is all combined. Then knead four or five times. The dough will be quite sticky; lightly dust the work surface with flour and use a plastic dough scraper to help you knead.",
        "For the dough into a ball and place it in a bowl. Cover the bowl with a damp cloth and let it sit in a warm sot (68°-70°F.) until it has risen by half, about 2 hours.",
        "Preheat the oven to 350°F. Lightly oil two baking sheets.",
        "Punch down the dough and divide it in half. Knead both batches slightly on a well-floured work surface (use no more than 3 tablespoons flour to dust the work surface) to remove any air pockets. Roll each half out between two sheets of parchment paper to form a 12 x 8-inch oval that is about 1/4-inch thick, and transfer them to the prepared baking sheets. (To do this, peel off the top piece of paper, flip the bread over onto the baking sheet, and remove the second piece of paper. Or roll the dough over a rolling pin, then unroll it on the baking sheet. The soft dough will stretch some, but don't be concerned).",
        "Make a design on each loaf: Working quickly and using a sharp knife, cut a 2 1/2 inch diameter circle in the center of the rolled out dough, cutting all the way through the dough but leaving the circle in place, Then cut five rays out from the circle so the design resembles a sun. Let the dough rise in a warm spot (68°-70°F.) until it has risen slightly, about 30 minutes.",
        "Bake the pompes in the center of the oven until they are golden and puffed, and have developed a scattering of small bumps on their surfaces, about 25 minutes.",
        "Remove the pompes from the oven and transfer them to wire racks to cool. Serve at room temperature."
    ],
    "ingredients": [
        "1 1/2 teaspoons active dry yeast",
        "2 tablespoons orange-flower water",
        "3 1/4 cups unbleached, all-purpose flour",
        "1/4 teaspoon sea salt",
        "4 large eggs, lightly beaten",
        "3/4 cup sugar",
        "6 tablespoons olive oil",
        "Zest of 1 lemon, minced",
        "1/2 teaspoon anise seeds",
        "1/4 cup candied fruit, diced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Lemon",
        "Orange",
        "Winter",
        "Anise",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Traditional Provencal Christmas Cake",
    "url": "http://www.epicurious.com/recipes/food/views/traditional-provencal-christmas-cake-15780"
}
