{
    "directions": [
        "1. Dissolve 1 cup salt in 1/2 gallon water. Soak cabbage in the salt water for 3 to 4 hours.",
        "2. Combine garlic, ginger, and fish sauce or shrimp in food processor or blender until finely minced.",
        "3. In large bowl, combine radish, green onions, mustard greens, garlic mixture, chili powder, 1 tablespoon salt and optional sugar. Toss gently but thoroughly. (If mixing with your hands, be sure to wear rubber gloves to avoid chili burn.)",
        "4. Remove cabbage from water and rinse thoroughly. Drain cabbage in colander, squeezing as much water from the leaves as possible. Take cabbage and stuff radish mixture between leaves, working from outside in, starting with largest leaf to smallest. Do not overstuff, but make sure radish mixture adequately fills leaves. When entire cabbage is stuffed, take one of the larger leaves and wrap tightly around the rest of the cabbage. Divide cabbage among 4 (1-quart) jars or 1-gallon jar, pressing down firmly to remove any air bubbles.",
        "5. Let sit for 2 to 3 days in a cool place before serving. Remove kimchi from jar and slice into 1-inch-length pieces. If serving before kimchi is fermented, sprinkle with a little bit of sesame oil and sesame seeds. Refrigerate after opening."
    ],
    "ingredients": [
        "1 cup plus 1 tablespoon coarse sea salt or kosher salt",
        "Water",
        "2 heads Napa cabbage, cut into quarters or 2-inch wedges, depending on size of cabbage",
        "1 bulb garlic, cloves separated and peeled",
        "1 (2-inch) piece of ginger root",
        "1/4 cup fish sauce or Korean salted shrimp",
        "1 Asian radish, peeled and grated",
        "1 bunch of green onions, cut into 1-inch lengths",
        "1/2 cup Korean chili powder",
        "1 teaspoon sugar (optional)",
        "Sesame oil (optional)",
        "Sesame seeds (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pepper",
        "Vegetable",
        "Side",
        "Lunar New Year",
        "Shrimp",
        "Radish",
        "Cabbage",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Traditional Napa Cabbage Kimchi",
    "url": "http://www.epicurious.com/recipes/food/views/traditional-napa-cabbage-kimchi-233839"
}
