{
    "directions": [
        "In a skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and sauté bell peppers until softened. Cool peppers. In a food processor grind bread into fine crumbs.",
        "In a bowl stir together bell peppers, crab, coriander, mayonnaise, Old Bay seasoning, jalapeño, garlic, 2 tablespoons bread crumbs, black pepper, and salt to taste until combined well and chill 20 minutes.",
        "With a 2-ounce ice-cream scoop or 1/4-cup measure, scoop crab mixture into 8 portions and pat each into 3/4-inch-thick disk. Spread remaining bread crumbs on a sheet of wax paper and gently press each crab cake into them, turning it, to coat evenly. To help prevent crumbling during cooking chill crab cakes, covered loosely, at least 1 hour and up to 1 day.",
        "Preheat oven to 375°F.",
        "In a 12-inch skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and sauté half of crab cakes until golden brown, 3 to 5 minutes. Turn crab cakes carefully and brown other sides. Transfer sautéed crab cakes carefully to a baking sheet. Add remaining tablespoon oil to skillet and sauté remaining crab cakes in same manner. On baking sheet bake all crab cakes 6 minutes, or until heated through.",
        "Serve crab cakes with mayonnaise."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "1 red bell pepper, cut into 1/4-inch dice",
        "1 yellow bell pepper, cut into 1/4-inch dice",
        "6 slices firm white sandwich bread, crusts discarded",
        "1 pound jumbo lump crab meat, picked over",
        "1/4 cup fresh coriander leaves, washed well, spun dry, and chopped",
        "1/4 cup mayonnaise",
        "2 tablespoons Old Bay seasoning*",
        "1 jalapeño chili, or to taste, seeded and chopped fine (wear rubber  gloves)",
        "1 tablespoon minced garlic",
        "freshly ground black pepper to taste",
        "chili mayonnaise or mayonnaise flavored with mustard or horseradish",
        "*available at seafood and specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Sauté",
        "Mayonnaise",
        "Crab",
        "Bell Pepper",
        "Jalapeño",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Traditional Crab Cakes '21' Club",
    "url": "http://www.epicurious.com/recipes/food/views/traditional-crab-cakes-21-club-13282"
}
