{
    "directions": [
        "Place each slice of pork tenderloin between two pieces of sturdy plastic (such as a cut-up large plastic freezer bag), and flatten the cutlet until it's about 1/4 inch thick, and about 3 1/2 by 5 inches in size.",
        "Beat the eggs and milk together in a shallow bowl, and whisk in the garlic powder, onion powder, seasoned salt, marjoram, oregano, salt, and pepper until the spices are well blended into the mixture. Place the bread crumbs in a shallow bowl.",
        "Dip each flattened cutlet into the seasoned milk-egg mixture and then into the bread crumbs, thoroughly coating the cutlets with crumbs. Set the breaded cutlets aside on a piece of parchment or waxed paper; do not stack.",
        "Heat the oil in a large skillet until the oil is shimmering. Gently lower the cutlets, one at a time, into the hot oil, and fry until golden brown on each side, about 8 minutes per cutlet. Drain the cutlets on paper towels.",
        "Preheat  oven broiler, and set the oven rack about 6 inches from the heat source.",
        "Spread the Kaiser rolls open with the cut sides up, and broil until the rolls are toasted and hot, about 1 minute. Top each roll with a fried cutlet (hopefully the sides of the meat will hang out of the roll by at least an inch on each side); top each cutlet with choice of mayonnaise, ketchup, mustard, lettuce, tomato, onion, and a pickle slice, if desired."
    ],
    "ingredients": [
        "4 (4 ounce) slices of pork tenderloin, cut across the grain",
        "1 egg, beaten",
        "2 tablespoons milk",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon seasoned salt",
        "1/4 teaspoon dried marjoram",
        "1/4 teaspoon dried oregano",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 1/2 cups bread crumbs",
        "1/2 cup peanut oil for frying",
        "4 Kaiser rolls, split",
        "4 teaspoons mayonnaise, or as needed (optional)",
        "4 teaspoons ketchup, or as needed (optional)",
        "4 teaspoons prepared yellow mustard, or as needed (optional)",
        "4 leaves lettuce (optional)",
        "4 slices tomato (optional)",
        "4 slices onion (optional)",
        "4 slices pickle, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Traditional Indiana Breaded Tenderloin Sandwich",
    "url": "http://allrecipes.com/recipe/213440/traditional-indiana-breaded-tenderloi/"
}
