{
    "directions": [
        "Finely grind basil, oil, 6 tablespoons each Romano and Parmesan cheeses, toasted pine nuts and minced garlic in processor. Season pesto to taste with salt and pepper. (Pesto can be prepared 2 days ahead. Press plastic wrap onto surface of pesto and refrigerate.)",
        "Cook potatoes in large pot of boiling salted water until just tender, about 5 minutes. Using slotted spoon, transfer potatoes to large bowl. Add green beans to same pot and cook until crisp-tender, about 3 minutes. Using slotted spoon, transfer to bowl with potatoes. Cook pasta in same pot until tender but still firm to bite. Drain, reserving 1/2 cup cooking liquid. Transfer pasta to bowl with potatoes and green beans.",
        "Whisk reserved 1/2 cup cooking liquid into pesto. Add pesto to pasta mixture and toss thoroughly to coat. Transfer pasta to large platter. Serve, passing additional Pecorino Romano separately."
    ],
    "ingredients": [
        "1 cup packed fresh basil leaves (about 2 bunches)",
        "1/2 cup olive oil (preferably extra-virgin)",
        "6 tablespoons freshly grated Pecorino Romano cheese (about 1 ounce)",
        "6 tablespoons freshly grated Parmesan cheese (about 1 ounce)",
        "1/4 cup pine nuts, toasted",
        "1 1/2 teaspoons minced garlic",
        "2 medium russet potatoes (about 3/4 pound), peeled, cut into 1/2-inch cubes",
        "6 ounces green beans, trimmed, cut into 3-inch lengths",
        "1 pound trenette",
        "Additional freshly grated Pecorino Romano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Pasta",
        "Potato",
        "Vegetarian",
        "Lunch",
        "Basil",
        "Green Bean",
        "Healthy",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Trenette with Pesto, Potatoes and Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/trenette-with-pesto-potatoes-and-green-beans-354"
}
