{
    "directions": [
        "Preheat oven to 325°F.",
        "Cut mushrooms into 1/4-inch-thick slices. Pat rabbit and reserved liver dry. Season rabbit with salt and pepper and dredge in flour, shaking off excess.",
        "In a large heavy ovenproof skillet heat oil over moderately high heat until hot but not smoking and brown rabbit on all sides. Transfer rabbit to a plate and in the skillet sauté pancetta or bacon, stirring, until golden. Add onion and chopped garlic and sauté stirring, until onion is golden. Add vinegar and wine and deglaze skillet, scraping up brown bits. Simmer onion mixture until liquid is evaporated, about 5 minutes. Cut off and discard top 1/4 inch of head of garlic, exposing cloves, and add head to onion mixture with broth, water, and herbs. Bring mixture to a simmer and season with salt and pepper. Stir in mushrooms and rabbit and braise, covered, in middle of oven 1 hour, or until meat is tender.",
        "Transfer rabbit to a plate and cool slightly. Remove garlic head and squeeze softened cloves into sauce, discarding skins. Mash garlic with fork and stir sauce well.",
        "Using 2 forks shred meat, discarding bones, and stir into sauce with reserved liver if using. Simmer sauce over moderate heat 10 minutes and season with salt and pepper. Sauce may be made 1 day ahead and cooled, uncovered, and before being chilled, covered.",
        "In an 8-quart kettle bring 7 quarts of salted water to a boil. Cook pasta until al dente (about 2 minutes for fresh, longer for dried) and drain in a colander. In a heated bowl immediately toss pasta with sauce and garnish with parsley."
    ],
    "ingredients": [
        "3/4 pound fresh shiitake mushrooms, stems discarded",
        "a 2-pound rabbit, thawed if frozen, cut into serving pieces and liver chopped and reserved if desired",
        "all-purpose flour for dredging",
        "3 tablespoons olive oil",
        "5 ounces pancetta (Italian unsmoked cured bacon) or bacon, chopped coarse",
        "1 large onion, chopped",
        "2 large garlic cloves, chopped, plus 1 small head garlic, left unpeeled and whole",
        "1/4 cup white-wine vinegar",
        "1/2 cup dry white wine",
        "2 cups beef broth",
        "1 cup water",
        "2 tablespoons finely chopped mixed fresh herbs such as sage, rosemary, and thyme leaves",
        "3/4 pound Fresh Trenette or 3/4 pound trenette or pappardelle",
        "Garnish: finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Pasta",
        "Braise",
        "Sauté",
        "Rabbit",
        "Bacon",
        "Winter",
        "Gourmet"
    ],
    "title": "Trenette with Rabbit and Shiitake Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/trenette-with-rabbit-and-shiitake-mushroom-sauce-10518"
}
