{
    "directions": [
        "Preheat the oven to 350 degrees F. Spray and flour a 10-inch cake pan with 2-inch high sides and then line with parchment paper. Grease the parchment paper.",
        "Mix the flour and baking powder in a medium bowl. Set aside.",
        "In a large mixing bowl, using an electric mixer with the whisk attachment, whip the egg whites until frothy. With the mixer running, gradually add the sugar and beat to stiff peaks. Beat in the yolks, 1 at a time, blending well after each addition. Add the flour mixture in 3 additions, alternating with the whole milk in 2 additions.",
        "Pour the batter into the prepared pan and bake until a tester inserted into the center comes out clean, about 30 minutes. Cool the cake slightly, about 10 minutes, then invert onto a platter with 1-inch high sides.",
        "Pierce the top of the cake all over with a thick skewer. Mix the sweetened condensed milk, evaporated milk, 1 cup heavy cream and orange liqueur in a medium bowl. Pour the mixture over the cake while warm. Cover and refrigerate until cold, about 3 hours or overnight.",
        "Combine the remaining 1 cup heavy cream and powdered sugar in a medium bowl. Using an electric mixer, beat the cream until soft peaks form. Spread the whipped cream onto top of the cake and sprinkle with the ground cinnamon."
    ],
    "ingredients": [
        "Nonstick cooking spray, for the cake pan",
        "1 1/2 cups all-purpose flour, plus more for dusting the cake pan",
        "1 tablespoon baking powder",
        "4 large eggs, separated",
        "1 1/2 cups sugar",
        "1/2 cup whole milk",
        "1 (14-ounce) can sweetened condensed milk",
        "1 (12-ounce) can evaporated milk",
        "2 cups heavy cream, divided",
        "3 tablespoons orange liqueur (recommended: Grand Marnier)",
        "1 tablespoon powdered sugar",
        "1/2 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Cake",
        "Dairy Recipes"
    ],
    "title": "Tres Leches Cake",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/tres-leches-cake-recipe"
}
