{
    "directions": [
        "Preheat oven to 350 degrees F and place rack in the center of the oven. Line a 9x13 inch baking pan with Reynolds Wrap(R) Non-Stick Foil and set aside.",
        "Combine the flour, baking powder and salt in a medium bowl and set aside.",
        "Whip together the egg whites in the bowl of an electric stand mixer fitted with a whisk attachment.  Add the cream of tartar and whip until soft peaks form, about 5 to 7 minutes.  Remove the egg whites to a separate bowl.",
        "Beat the egg yolks in the mixing bowl using a paddle attachment until thick and pale in color. Add the granulated sugar and beat on high for about 5 minutes, until very thick and ribbons fall when you lift the paddle attachment. Stir in the vanilla extract, almond extract and milk until smooth. Add the flour mixture and stir until just combined.",
        "Fold in the egg whites, in three increments, making sure to thoroughly incorporate the whites but try not to over-mix.",
        "Pour batter into prepared baking pan and bake for about 25 to 30 minutes, or until a toothpick inserted in the middle comes out clean. Remove from the oven and allow to cool completely on a wire rack.",
        "Whisk together the three milks in a medium bowl. Whisk in the rum and vanilla extract. Using a wooden skewer, poke holes all throughout the cooled cake. This will allow for the milk mixture to seep in. Pour the milk evenly over the cake. Cover with Reynolds Wrap(R) Non-Stick Foil and allow to chill in the fridge for about 3 hours or overnight.",
        "Whip together the heavy cream along with the powdered sugar, salt and vanilla extract until soft peaks form. Spread the whipped cream over the chilled cake. Decorate with sprinkles and cherries. Slice generously and enjoy!"
    ],
    "ingredients": [
        "Cake:",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "6 large eggs, separated",
        "1/2 teaspoon cream of tartar",
        "1 1/2 cups granulated sugar",
        "1/3 cup whole milk",
        "2 teaspoons pure vanilla extract",
        "1/2 teaspoon pure almond extract",
        "Reynolds Wrap® Non Stick Aluminum Foil",
        "Milks:",
        "1 cup heavy cream",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (5 ounce) can evaporated milk",
        "2 tablespoons rum",
        "2 teaspoons pure vanilla extract",
        "Frosting:",
        "2 cups heavy cream",
        "3/4 cup confectioners' sugar",
        "1 pinch salt",
        "1 teaspoon pure vanilla extract",
        "Assorted sprinkles, for garnish",
        "Maraschino cherries, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tres Leches Cake from Reynolds Wrap®",
    "url": "http://allrecipes.com/recipe/246796/tres-leches-cake-from-reynolds-wrapr/"
}
