{
    "directions": [
        "Preheat the oven to 350 degrees F. Line cupcake tins with paper liners.",
        "Sift together the flour, baking powder, baking soda and salt.",
        "Cream the butter and granulated sugar with an electric mixer until fluffy and light. Add the eggs, one at a time beating well between each addition. Then add the vanilla and mix until fluffy. Fold in the flour mixture, alternating with the milk. Do not over mix. Portion into the prepared cupcake tins. Bake for about 20 minutes.",
        "Once the cupcakes have cooled, about 30 minutes, you can inject the cake with about 2 ounces of the Tres Leches Mix. If you do not have an injector, then fork the cupcake gently on the top, and then spoon the tres leches over top so as to not break up the cake. Let sit in the fridge for at least an hour.",
        "Top each cupcake with some of the Whipped Cream Mascarpone Frosting.",
        "Combine the three milks in a blender until well combined, and then chill in the refrigerator for at least 1 hour.",
        "Chill a metal bowl. Add the heavy cream, vanilla extract and confectioners' sugar. Start to beat the heavy cream until you see the liquid thicken, and continue to beat until stiff peaks form. Mix in the mascarpone cheese and blend to combine."
    ],
    "ingredients": [
        "2 1/2 cups cake flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon fine salt",
        "1 stick unsalted butter, at room temperature",
        "1 1/2 cups granulated sugar",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "1 1/4 cup milk",
        "Tres Leches Mix, recipe follows",
        "Whipped Cream Mascarpone Frosting, recipe follows",
        "One 12-ounce can evaporated milk",
        "Half 14-ounce can sweetened condensed milk",
        "3/4 cup heavy cream",
        "4 cups heavy cream",
        "1 teaspoon vanilla extract",
        "3/4 cup confectioners' sugar",
        "4 ounces mascarpone cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Cupcake",
        "Dairy Recipes",
        "Cheese"
    ],
    "title": "Tres Leches Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/tres-leches-cupcakes-recipe"
}
