{
    "directions": [
        "Melt 1 tablespoon butter with 1 tablespoon olive oil in large nonstick skillet over medium heat. Add sliced wild mushrooms to skillet; sprinkle with coarse kosher salt and pepper and sauté until mushrooms release juices, about 6 minutes. Increase heat to medium-high; sauté until mushrooms are tender and brown, about 4 minutes longer. DO AHEAD: Can be made 2 hours ahead. Remove from heat. Let stand at room temperature.",
        "Add vermouth to mushrooms and boil until almost evaporated but still moist, scraping up browned bits, about 1 minute. Stir in crème fraîche; remove from heat. Season to taste with coarse kosher salt and pepper. Cover; set aside.",
        "Melt remaining 1 tablespoon butter with 1 tablespoon olive oil in another large nonstick skillet over medium-high heat. Working in batches, add beef slices to skillet and sauté just until brown outside but still pink in center, about 30 seconds per side. Transfer beef slices to plate; sprinkle with coarse salt and pepper. Add sliced shallots to same skillet, reduce heat to medium, and sauté until golden brown and tender, about 4 minutes. Stir in flour and 1 teaspoon tomato paste (mixture will clump). Add broth and paprika and whisk to blend, scraping up browned bits. Simmer until sauce thickens slightly, about 2 minutes. Season sauce to taste with coarse kosher salt and pepper. Remove from heat; cover and keep warm.",
        "Meanwhile, preheat broiler. Whisk remaining 3 tablespoons oil and 2 1/2 tablespoons tomato paste in small bowl to blend. Arrange bread slices in single layer on rimmed baking sheet. Brush oil-tomato paste mixture lightly over both sides of bread slices. Broil bread just until lightly toasted, watching closely to avoid burning, about 1 minute per side. Arrange sourdough toasts on large platter.",
        "Add beef slices and any accumulated juices to shallot mixture in skillet; bring to simmer, stirring occasionally, then stir in sour cream. Remove from heat. Season to taste with coarse salt and pepper. Rewarm mushroom mixture over medium heat.",
        "Divide beef mixture among toasts, then top each with mushroom mixture. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter, divided",
        "5 tablespoons extra-virgin olive oil, divided",
        "1 pound assorted fresh wild mushrooms (such as chanterelle, oyster, crimini, and stemmed shiitake), cut into 1/4-inch-thick slices",
        "Coarse kosher salt",
        "1/4 cup dry white vermouth or dry Sherry",
        "1/4 cup crème fraîche or heavy whipping cream",
        "1 1 1/2-pound tri-tip roast, excess fat trimmed, meat cut against grain into 1/4-inch-thick slices, slices cut crosswise into 3-inch lengths",
        "1 cup thinly sliced shallots (about 4 large)",
        "1 tablespoon all purpose flour",
        "1 teaspoon plus 2 1/2 tablespoons tomato paste",
        "1 cup beef broth",
        "1/2 teaspoon Hungarian sweet paprika",
        "6 5 x 3 x 1/2-inch slices crusty sourdough bread",
        "1/4 cup sour cream",
        "2 tablespoons chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Low Cal",
        "Father's Day",
        "Dinner",
        "Party",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tri-Tip Beef Stroganoff with Wild Mushrooms on Sourdough Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/tri-tip-beef-stroganoff-with-wild-mushrooms-on-sourdough-toasts-357530"
}
