{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.",
        "Pat roast dry and sprinkle with salt and pepper. Heat oil in skillet over moderately high heat until hot but not smoking, then sear roast until underside is browned, about 4 minutes. Turn meat over, then transfer skillet to upper rack of oven and roast until thermometer inserted 2 inches into center of meat registers 120°F, 20 to 25 minutes. Transfer to a cutting board and let stand 15 minutes. (Internal temperature of meat will rise to 130 to 135°F for medium-rare.)",
        "Toss together tomatoes, salt, red-pepper flakes, and 1/4 cup oil in a 13- by 9-inch glass baking dish. Roast on lower rack until tomatoes burst and release their juices, about 30 minutes.",
        "Meanwhile, pulse parsley and garlic with vinegar and remaining 2 tablespoons oil in a food processor until chopped, then transfer to a bowl.",
        "Stir tomatoes with their juices into parsley mixture. Slice roast across the grain and serve with sauce."
    ],
    "ingredients": [
        "1 (2- to 2 1/4-lb) tri-tip beef roast (also called triangular roast; about 2 inches thick)",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon olive oil",
        "1 1/2 lb cherry tomatoes (5 cups)",
        "1/2 teaspoon salt",
        "1/4 teaspoon dried hot red-pepper flakes",
        "1/4 cup plus 2 tablespoons extra-virgin olive oil",
        "1 cup firmly packed fresh flat-leaf parsley leaves",
        "1 garlic clove, sliced",
        "1 tablespoon red-wine vinegar",
        "Special equipment: a well-seasoned 10-inch cast-iron skillet; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Tomato",
        "Roast",
        "Quick & Easy",
        "Parsley",
        "Gourmet"
    ],
    "title": "Tri-Tip Roast with Parsley Cherry-Tomato",
    "url": "http://www.epicurious.com/recipes/food/views/tri-tip-roast-with-parsley-cherry-tomato-234661"
}
