{
    "directions": [
        "Roast bell pepper on rack of a gas burner over high heat (or broil 2 to 3 inches from heat), turning with tongs, until skin is blackened, 10 to 15 minutes. Transfer to a bowl and tightly cover, then let stand 20 minutes. Peel, then discard stem and seeds. Chop pepper and return to bowl.",
        "Mince and mash garlic to a paste with a pinch of salt, then stir into roasted pepper with sun-dried tomatoes, 1 tablespoon oil, capers, zest, juice, fennel seeds, sugar, 1/2 teaspoon salt, and 1/2 teaspoon pepper.",
        "Preheat oven to 425°F with rack in middle.",
        "Pat beef dry and season with 1 1/2 teaspoon salt and 1/2 teaspoon pepper. Heat remaining tablespoon oil in an ovenproof 12-inch heavy skillet over medium-high heat until it shimmers, then sear beef until underside is browned, about 4 minutes.",
        "Turn meat over and transfer skillet to oven. Roast until an instant-read thermometer inserted 2 inches into center of meat registers 125°F for medium-rare, 20 to 25 minutes. Let beef rest on a cutting board, uncovered, about 15 minutes (temperature will rise to between 130 and 135°F).",
        "Add roasted-pepper mixture to meat juices in hot skillet, scraping up brown bits. Transfer to a serving bowl and stir in parsley and basil. Serve sliced beef with roasted-pepper relish."
    ],
    "ingredients": [
        "1 red bell pepper",
        "1 garlic clove",
        "1/2 cup sun-dried tomatoes in oil, drained and chopped",
        "2 tablespoons extra-virgin olive oil, divided",
        "2 tablespoons drained capers, chopped",
        "1 teaspoon grated lemon zest",
        "2 teaspoon fresh lemon juice",
        "1 teaspoon fennel seeds, toasted and coarsely ground",
        "1/2 teaspoon sugar, or to taste",
        "1 (2- to 2 1/2-pounds) tri-tip beef roast (also called triangular roast; about 2 inches thick)",
        "1/2 cup chopped flat-leaf parsley",
        "1/2 cup chopped basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Roast",
        "Father's Day",
        "Dinner",
        "Lemon",
        "Meat",
        "Bell Pepper",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tri-Tip Roast with Sun-Dried Tomato and Roasted-Pepper Relish",
    "url": "http://www.epicurious.com/recipes/food/views/tri-tip-roast-with-sun-dried-tomato-and-roasted-pepper-relish-350251"
}
