{
    "directions": [
        "Preheat oven to 350°F. Lightly spray 15 1/2 x 10 1/2 x 1-inch jelly roll pan with vegetable oil spray. Line bottom of pan with waxed paper, extending paper slightly at short ends; spray paper. Using electric mixer, beat 5 eggs, 1/2 cup plus 2 tablespoons sugar, 1 3/4 teaspoons vanilla and 1/2 teaspoon salt in large bowl until mixture triples in volume and is thick enough to fall in heavy ribbon when beaters are lifted, about 12 minutes. (This means there is enough air and structure in the mixture to support the flour and batter.) Sift 1/2 cup plus 2 tablespoons flour over batter in 2 additions, gently folding just to combine after each addition. (To help prevent the batter from deflating, \"fold\" the flour in by cutting into the center with a rubber spatula; slide it across the bottom of the bowl, then up the sides, bringing up some batter each time.) Drizzle 2 1/2 tablespoons butter over and fold in gently (do not over mix or batter will deflate). Pour batter evenly into prepared pan.",
        "Bake cake until golden and tester inserted into center comes out clean, about 12 minutes. Transfer pan to rack; cool cake. Repeat with remaining ingredients and another pan to make second cake. (Can be prepared 1 day ahead. Cover cakes with foil and store at room temperature.)",
        "Place milk in medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to boil. Whisk yolks, sugar and flour in medium bowl until smooth. Gradually whisk in hot milk mixture. Return mixture to pan; whisk over medium heat until custard thickens and boils, about 4 minutes. Strain into medium bowl. Press plastic wrap onto surface. Chill until cold, about 3 hours.",
        "Using electric mixture, beat cream in medium bowl to stiff peaks. Fold cream into cold custard. (Can be prepared 1 day ahead. Cover and refrigerate.",
        "Stir sugar and 1/3 cup water in heavy small saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until syrup turns deep amber, brushing down sides of pan with wet pastry brush and swirling pan occasionally. Remove from heat. Add 3 tablespoons water (mixture will bubble vigorously). Stir until caramel is smooth. Pour caramel into medium bowl; mix in remaining 2 tablespoons water. Cool. (Can be made 1 day ahead. Cover; let stand at room temperature.)",
        "Sift generous amounts of powdered sugar over 2 kitchen towels. Cut around pan sides to loosen cakes. Turn each cake out onto prepared towels. Hold the cake in place, and gently peel off the waxed paper, pulling it straight back and almost parallel to the cake.",
        "Stir jam and 2 tablespoons rum in small bowl to blend. Cut each cake crosswise in half. Spread half of jam mixture over the golden sides of 1 piece of each cake. Gently press second piece of each cake onto jam.",
        "Cut cake sandwiches crosswise into 3/4-inch-wide strips. Arrange enough cake strips in 3 1/2- to 4-quart glass trifle dish or bowl to cover bottom, trimming strips to fit and allowing jam layer to show at sides. Brush cake layer with 2 tablespoons rum. Next, set up a decorative row of strawberries around the side of the bowl; then fill in center.",
        "Add banana slices to caramel syrup; gently stir to coat. Using slotted soon, remove banana slices, a few at a time, draining all excess caramel back into bowl. As with strawberries, layer half of banana slices atop berries, arranging some to show at sides of dish.",
        "Spoon half of custard over bananas, spreading to side of dish, using the back of the spoon to press the custard to the edge of the bowl in a clearly defined layer. Repeat layering with cake, rum, berries, banana slices and custard. Arrange remaining cake strips atop custard; press gently to compact. Brush with 2 tablespoons rum. Cover trifle. Chill at least 4 hours and up to 10 hours. Cover remaining caramel syrup; store at room temperature.",
        "Halve additional berries. Slice additional bananas. Arrange fruit atop trifle, leaving 1-inch plain border at edge. Brush fruit with enough caramel syrup to glaze. Spoon cream into pastry bag fitted with medium star tip. Pipe cream around fruit. Garnish with mint, if desired."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "10 large eggs, room temperature",
        "1 cup plus 4 tablespoons sugar",
        "3 1/2 teaspoons vanilla extract",
        "1 teaspoon salt",
        "1 cup plus 4 tablespoons all purpose flour",
        "5 tablespoons unsalted butter, melted, lukewarm",
        "1 1/2 cups milk (do not use low-fat or nonfat)",
        "1 vanilla bean, split lengthwise",
        "6 large egg yolks",
        "1/3 cup sugar",
        "2 1/2 tablespoons all purpose flour",
        "1/2 cup chilled whipping cream",
        "1 cup sugar",
        "1/3 cup plus 5 tablespoons water",
        "Powdered sugar",
        "2/3 cup raspberry jam",
        "8 tablespoons dark rum",
        "2 1-pound baskets fresh strawberries, hulled, sliced, or three 10-ounce package sliced frozen strawberries in syrup, thawed, drained well",
        "8 medium bananas, peeled, cut into 1/3-inch-thick slices",
        "Additional fresh strawberries",
        "Additional bananas",
        "Whipped cream",
        "Fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Strawberry",
        "Banana",
        "Vanilla",
        "Winter",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Trifle with Strawberries and Caramel-Coated Bananas",
    "url": "http://www.epicurious.com/recipes/food/views/trifle-with-strawberries-and-caramel-coated-bananas-105461"
}
