{
    "directions": [
        "Cut goat cheese into twelve 1/2-inch-thick rounds. Set rounds aside.",
        "Preheat oven to 350°F. Place garlic in heavy small pan. Drizzle with 2 tablespoons oil. Bake until garlic is tender when pierced with small sharp knife, about 20 minutes. Cool slightly; peel garlic cloves. Reserve oil in pan.",
        "Place sun-dried tomatoes in small bowl. Add enough boiling water to cover. Let tomatoes stand until softened, about 15 minutes. Drain; pat dry.",
        "Put 1 tomato, 1 garlic clove and 1 sprig each rosemary and thyme in bottom of 8-ounce jar. Drizzle with 1 1/2 teaspoons oil reserved from garlic. Place 1 cheese round atop herbs. Drizzle with more reserved olive oil. Repeat layering, using remaining tomatoes, garlic, herbs, garlic oil and 3 more cheese rounds. Pour in enough olive oil to fill jar completely. Seal tightly. (Can be prepared 1 week ahead; refrigerate.)",
        "Rinse mushrooms briefly with cold water; drain. Place mushrooms in small bowl. Add enough boiling water to cover and let stand until softened, about 30 minutes. Drain mushrooms.",
        "Heat 2 tablespoons olive oil in heavy small skillet. Add garlic and sauté until just golden, about 3 minutes. Add mushrooms and cook until just heated through, stirring occasionally, about 1 minute. Mix in parsley. Season with salt and pepper. Cool completely.",
        "Layer mushrooms, olive oil and 4 goat cheese rounds in 8-ounce jar, beginning and ending with mushrooms. Pour in enough oil to fill jar completely. Seal tightly. (Can be prepared up to 1 week ahead; refrigerate.)",
        "Preheat oven to 350°F. Place walnuts on small cookie sheet. Toast until golden brown and fragrant, stirring occasionally, about 12 minutes. Cool completely.",
        "Finely chop walnuts. Layer walnuts, walnut oil and remaining 4 goat cheese rounds in 8-ounce jar, seasoning each layer generously with pepper. Pour in enough walnut oil to fill jar completely. Seal tightly. (Can be prepared up to 1 week ahead; refrigerate.)"
    ],
    "ingredients": [
        "1 11-ounce log fresh soft goat cheese (such as Montrachet)",
        "5 large garlic cloves (unpeeled), pierced",
        "1/2 cup (about) plus 2 tablespoons olive oil",
        "5 sun-dried tomatoes",
        "5 small sprigs fresh rosemary",
        "5 small sprigs fresh thyme",
        "7/8 to 1 ounce dried porcini mushrooms*",
        "1/2 cup (about) plus 2 tablespoons olive oil",
        "1 large garlic clove, minced",
        "1 tablespoon minced fresh parsley",
        "Salt and pepper",
        "1/4 cup plus 2 tablespoons walnuts (about 1 1/2 ounces)",
        "1/2 cup (about) walnut oil",
        "Pepper",
        "*Dried porcini are available at Italian markets and specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Mushroom",
        "Tomato",
        "Cocktail Party",
        "Goat Cheese",
        "Walnut"
    ],
    "title": "Trio of Marinated Goat Cheeses",
    "url": "http://www.epicurious.com/recipes/food/views/trio-of-marinated-goat-cheeses-2889"
}
