{
    "directions": [
        "Place bananas in freezer to chill 10 minutes. Bring sugar and 1/2 cup water to simmer in heavy small saucepan over medium heat, stirring until sugar dissolves. Beat egg yolks in small bowl to blend. Gradually whisk hot syrup into yolks. Return mixture to same saucepan and stir over low heat just until bubbles appear at pan edge and mixture thickens slightly, stirring constantly, about 2 minutes. Pour yolk mixture into processor. Add fresh lemon juice, salt and ground ginger. Peel cold bananas and slice. Add to processor bowl. Puree until smooth. Immediately transfer custard to ice cream maker and freeze according to manufacturer's instructions. Transfer to container and freeze. (Sorbet can be prepared 2 days ahead. Store in freezer.)",
        "Bring 1 cup water and 1 cup sugar to boil in heavy small saucepan over medium heat, stirring until sugar dissolves. pour into processor bowl and cool.",
        "Combine remaining 1 cup water, apricots and wine in heavy medium saucepan. Cover and cook over medium-low heat until apricots are very tender, stirring occasionally, about 25 minutes. Add mixture to syrup in processor. Add ginger and salt and puree. Cool.",
        "Transfer apricot mixture to ice cream maker and freeze according to manufacturer's instructions. Transfer sorbet to container and freeze. (Can be prepared 2 days ahead. Store in freezer.)",
        "Bring sugar and 1/2 cup water to boil in heavy small saucepan over medium heat, stirring until sugar dissolves. Cool.",
        "Puree diced kiwi in processor. Set aside 1 cup puree. Strain remaining puree through fine sieve. Combine both purees and syrup in ice cream maker and freeze according to manufacturer's instructions. Transfer to container and freeze. (Sorbet can be prepared 2 days ahead. Store in freezer.)",
        "Puree all ingredients in processor. Strain through fine sieve. (Can be prepared 2 days ahead. Cover and refrigerate.)",
        "Spread Raspberry Coulis in center of each dessert plate. Arrange 1 scoop of each sorbet on sauce. Garnish with fresh fruit if desired and serve."
    ],
    "ingredients": [
        "1 1/2 pounds ripe bananas (about 4 medium-large)",
        "2/3 cup sugar",
        "1/2 cup water",
        "2 egg yolks",
        "1 tablespoon plus 1 teaspoon fresh lemon juice",
        "Pinch of salt",
        "Pinch of ground ginger",
        "2 cups water",
        "1 cup sugar",
        "1 6-ounce package dried apricots",
        "1/2 cup dry white wine",
        "1/8 teaspoon ground ginger",
        "Pinch of salt",
        "1 cup sugar",
        "1/2 cup water",
        "2 pounds kiwis (about 9 large), peeled, diced",
        "Fresh banana slices, kiwi slices and raspberries (optional)",
        "2 12-ounce bags frozen unsweetened raspberries, thawed",
        "1/2 cup sugar",
        "1/4 cup raspberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ice Cream Machine",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Raspberry",
        "Apricot",
        "Banana",
        "Kiwi",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Trio of Sorbets with Raspberry Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/trio-of-sorbets-with-raspberry-coulis-1637"
}
