{
    "directions": [
        "Lightly oil a 9- by 5-inch loaf pan and line with plastic wrap.",
        "In a double boiler or a small metal bowl set over a saucepan of barely simmering water melt milk chocolate with 1/2 cup cream, stirring until smooth, and remove double boiler or pan from heat. Spoon mixture into loaf pan and tap pan on counter to level surface. Cool mixture to room temperature and chill, uncovered, 15 minutes.",
        "In cleaned top of double boiler or bowl melt white chocolate with remaining 1/2 cup cream in same manner. Stir hazelnuts into white chocolate mixture and pour evenly onto chilled milk chocolate layer. Chill confection, loosely covered, at least 6 hours, and up to 1 week.",
        "Lift confection out of pan and peel off plastic wrap. On a cutting board with a sharp large knife cut confection lengthwise into 6 strips and cut strips crosswise into 11 strips (to make a total of 66 truffles, each about 3/4-inch-square).",
        "In a double boiler or small metal bowl set over a saucepan of barely simmering water melt bittersweet chocolate, stirring until smooth, and remove double boiler or pan from heat. Cool chocolate 10 minutes. Dip 1/8 inch of white chocolate portion of each truffle into melted chocolate, letting excess chocolate drip off. Top each truffle with a small piece of crystallized violet and chill, uncovered, until firm. Truffles may be made 2 weeks ahead and chilled in layers separated by wax paper in an airtight container."
    ],
    "ingredients": [
        "9 ounces fine-quality milk chocolate, chopped",
        "1 cup heavy cream",
        "9 ounces fine-quality white chocolate, chopped",
        "1/2 cup hazelnuts, toasted and chopped",
        "4 ounces fine-quality bittersweet chocolate (not unsweetened)",
        "Garnish: crystallized violets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Nut",
        "Dessert",
        "Wedding",
        "Spring",
        "Chill",
        "Edible Gift",
        "Hazelnut",
        "Double Boiler",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Triple-Chocolate Hazelnut Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/triple-chocolate-hazelnut-truffles-14099"
}
