{
    "directions": [
        "Place lemon juice in small bowl or custard cup. Sprinkle gelatin over. Let stand 15 minutes.",
        "Whisk sugar, orange juice, yolks, orange peel, and lemon peel in heavy large saucepan to blend. Add butter. Whisk over medium heat until curd thickens and bubbles begin to appear at edges, about 9 minutes. Remove from heat. Add gelatin mixture. Whisk until gelatin dissolves. Transfer curd to small bowl. Press plastic wrap onto surface of curd. Chill overnight.",
        "Preheat oven to 350°F. Butter and flour three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Sift flour, 1 1/4 cups sugar, baking powder, and salt into medium bowl. Whisk oil and egg yolks in large bowl until well blended. Whisk in sour cream, then milk, orange peel, and vanilla. Whisk in dry ingredients in 3 additions. Using electric mixer, beat egg whites in another large bowl until soft peaks form. Gradually add remaining 2/3 cup sugar, beating until whites are stiff but not dry; fold into batter in 4 additions. Divide batter among prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 20 minutes. Cool cakes in pans 5 minutes. Cut around pan sides. Turn cakes out onto racks and cool completely. Place 1 cake layer, flat side up, on 8-inch tart pan bottom or platter. Spread 1 cup curd over. Top with second cake layer, flat side down. Spread 1 cup curd over. Top with third cake layer, flat side down. Cover; refrigerate assembled cake.",
        "Using electric mixer, beat cream cheese and butter in medium bowl until smooth. Beat in powdered sugar, then 3/4 cup orange curd. Spread frosting over cake. (Can be made 1 day ahead. Cover with cake dome; refrigerate.)"
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "2 teaspoons unflavored gelatin",
        "1 1/2 cups sugar",
        "1 cup orange juice",
        "9 large egg yolks",
        "3 tablespoons grated orange peel",
        "2 teaspoons grated lemon peel",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes",
        "2 3/4 cups cake flour",
        "1 1/4 cups plus 2/3 cup sugar",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3/4 cup vegetable oil",
        "4 large egg yolks",
        "6 tablespoons sour cream",
        "1/2 cup plus 1 tablespoon whole milk",
        "2 teaspoons grated orange peel",
        "1 1/2 teaspoons vanilla extract",
        "6 large egg whites",
        "10 ounces cream cheese, room temperature",
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1 2/3 cups powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Mixer",
        "Citrus",
        "Egg",
        "Dessert",
        "Bake",
        "Orange",
        "Winter",
        "Sour Cream",
        "Double Boiler"
    ],
    "title": "Triple-Layer White Cake with Orange Curd Filling and Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/triple-layer-white-cake-with-orange-curd-filling-and-frosting-107719"
}
