{
    "directions": [
        "Trim any fat from tripe, then rinse tripe under cold water. Soak tripe in a large bowl of fresh cold water 1 hour, then rinse again.",
        "Put tripe in an 8-quart pot of cold water and bring to a boil, then drain and rinse. Bring tripe to a boil again in pot filled with fresh cold water, then reduce heat and simmer, uncovered, turning tripe occasionally and adding more hot water to pot if necessary to keep tripe covered, until very tender, about 4 hours (tripe will have a pungent aroma while simmering). Drain in a colander and cool completely.",
        "While tripe is cooking, heat olive oil in a 6- to 8-quart heavy pot over moderate heat until hot but not smoking, then cook onion, carrots, celery, and garlic, stirring frequently, until softened, about 8 minutes. Add salt, pepper, and wine and boil, stirring, 1 minute. Pour juice from tomatoes into sauce, then chop tomatoes and add to sauce with the 2 cups cold water and mint. Simmer sauce, uncovered, 30 minutes.",
        "Trim any remaining fat from tripe and cut tripe into 2- by 1/2-inch strips. Add to sauce and simmer, uncovered, stirring occasionally, until tripe is a little bit more tender but still slightly chewy, 45 minutes to 1 hour. Season with salt and pepper.",
        "Serve tripe sprinkled with finely grated Pecorino Romano and additional chopped fresh mint."
    ],
    "ingredients": [
        "3 lb raw beef honeycomb tripe (not partially cooked)",
        "1/3 cup extra-virgin olive oil",
        "1 large onion, chopped",
        "2 carrots, chopped",
        "2 celery ribs, chopped",
        "2 garlic cloves, chopped",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "2/3 cup dry white wine",
        "1 (32-oz) can whole tomatoes in juice, with juice reserved",
        "2 cups cold water",
        "1/4 cup fresh mint, chopped",
        "Salt and pepper, to taste",
        "Garnish: Pecorino Romano and chopped mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Tomato",
        "Mint",
        "Celery",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Trippa alla Romana",
    "url": "http://www.epicurious.com/recipes/food/views/trippa-alla-romana-107811"
}
