{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 round cake pans.",
        "Mix cake mix, 1 1/2 cups eggnog, eggs, butter, nutmeg, and 1/2 teaspoon rum-flavored extract together in a bowl using an electric mixer until batter is smooth, about 4 minutes. Pour batter into the prepared pans.",
        "Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes. Remove cakes from pans and cool on a wire rack.",
        "Mix 2 cups eggnog, vanilla pudding mix, and 1/2 teaspoon rum-flavored extract together in a bowl until smooth; refrigerate until pudding thickens, at least 30 minutes.",
        "Mix cold water and gelatin together in a bowl until gelatin is dissolved. Beat cream in a separate bowl using an electric mixer until soft peaks form; add gelatin mixture, white sugar, 1/2 teaspoon rum-flavored extract, and salt and beat until stiff peaks form. Refrigerate topping until chilled, at least 30 minutes.",
        "Place 1 cake on a serving plate and spread 1/2 of the filling on top. Place the second cake over the filling and top with remaining filling. Cover entire cake with whipped cream topping. Store cake in refrigerator."
    ],
    "ingredients": [
        "Cake:",
        "1 (15.25 ounce) package yellow cake mix",
        "1 1/2 cups eggnog, or more to taste",
        "2 eggs",
        "1/4 cup melted butter",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon rum-flavored extract",
        "Filling:",
        "2 cups eggnog",
        "1 (3.5 ounce) package instant vanilla pudding mix",
        "1/2 teaspoon rum-flavored extract",
        "Topping:",
        "2 tablespoons cold water",
        "1 tablespoon unflavored gelatin",
        "2 cups heavy whipping cream",
        "1 1/4 cups white sugar",
        "1/2 teaspoon rum-flavored extract",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Triple Eggnog Cake",
    "url": "http://allrecipes.com/recipe/240635/triple-eggnog-cake/"
}
