{
    "directions": [
        "Preheat oven to 325°F. Lightly grease three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of pans with waxed paper. Lightly grease waxed paper. Using electric mixer, beat sugar and vegetable oil in bowl until combined. Add eggs 1 at a time, beating well after each addition. Sift flour, baking powder, baking soda, salt, cinnamon and nutmeg into sugar and oil mixture. Stir in carrots, chopped pecans and raisins.",
        "Pour batter into prepared pans, dividing equally. Bake until toothpick inserted into center comes out clean and cakes begin to pull away from sides of pans, about 45 minutes. Cool in pans on racks 15 minutes. Turn out cakes onto racks and cool completely. (Can be made 1 day ahead. Wrap tightly in plastic and store at room temperature.)",
        "Using electric mixer, beat all ingredients in medium bowl until smooth and creamy.",
        "Place 1 cake layer on platter. Spread with 3/4 cup frosting. Top with another cake layer. Spread with 3/4 cup frosting. Top with remaining cake layer. Using icing spatula, spread remaining frosting in decorative swirls over sides and top of cake. (Can be prepared 2 days ahead. Cover with cake dome and refrigerate.) Serve cake cold or at room temperature."
    ],
    "ingredients": [
        "2 cups sugar",
        "1 1/2 cups vegetable oil",
        "4 large eggs",
        "2 cups all purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "3/4 teaspoon ground nutmeg",
        "3 cups finely grated peeled carrots (about 1 pound)",
        "1/2 cup chopped pecans (about 1/2 ounce)",
        "1/2 cup raisins",
        "4 cups powdered sugar",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "4 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Raisin",
        "Pecan",
        "Carrot",
        "Chill",
        "Ohio",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Triple-Layer Carrot Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/triple-layer-carrot-cake-with-cream-cheese-frosting-799"
}
