{
    "directions": [
        "Stir salt pork pieces in heavy large pot over medium-low heat until crisp and golden, about 20 minutes. Using slotted spoon, remove salt pork pieces and discard. Add chopped onion, chopped celery and dried thyme to drippings in pot. Increase heat to medium and sauté until vegetables are pale golden, about 10 minutes. Add crushed crackers and stir until beginning to color, about 3 minutes. Add reserved juices from clams, potatoes and 2 1/2 cups bottled clam juice to pot. Bring mixture to boil. Reduce heat to low, partially cover pot and simmer until potatoes are almost tender, about 15 minutes. Add cod fillet pieces; simmer until fish is cooked through and potatoes are tender, about 5 minutes longer. Add 1 cup half and half, whipping cream and canned baby clams. Cook just until heated through, about 5 minutes (do not boil). Mix in chopped dill. Season chowder to taste with salt and pepper.",
        "Ladle seafood chowder into serving bowls. Top each bowl with heaping tablespoon of Smoked Salmon Butter and serve immediately."
    ],
    "ingredients": [
        "8 ounces salt pork, trimmed, cut into 1/4-inch dice",
        "1 3/4 cups chopped onion",
        "1 1/2 cups chopped celery",
        "3/4 teaspoon dried thyme",
        "1/2 cup finely crushed saltine crackers",
        "2 10-ounce cans baby clams, drained, juices reserved",
        "1 1/4 pounds white potatoes, peeled, cut into 1/2-inch pieces",
        "2 1/2 cups bottled clam juice",
        "1 1/2 pounds thick cod fillets, cut into 3/4-inch pieces",
        "1 cup half and half",
        "1/2 cup whipping cream",
        "1/4cup chopped fresh dill",
        "Smoked Salmon Butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Fish",
        "Pork",
        "Potato",
        "Shellfish",
        "Dinner",
        "Lunch",
        "Seafood",
        "Cod",
        "Clam",
        "Winter",
        "Party",
        "Dill",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Triple Seafood Chowder with Dill",
    "url": "http://www.epicurious.com/recipes/food/views/triple-seafood-chowder-with-dill-4968"
}
