{
    "directions": [
        "To make this burger, the meats, suet, and marrow must be ground. There are three different ways to do this.",
        "1 Have the butcher grind the meats. Ask your butcher to cut all trimmed meats into 3/4-inch pieces, chop the suet and marrow, and grind everything into 1/16-inch pieces.",
        "2 Use a meat grinder.",
        "3 Use a food processor. Cut all trimmed meats into 1/4-inch pieces. Chop the suet and marrow. Freeze until partially frozen. Working in batches and using on/off turns, grind into 1/16-inch pieces.",
        "Combine all ground meats, beef suet, and bone marrow in large bowl and mix lightly with fork. Add miso mixture and stir lightly just to incorporate (do not overmix). Divide meat mixture into 8 equal portions. Form each portion into scant 4-inch-diameter patty. Sprinkle both sides of patties generously with salt and pepper.",
        "Brush 2 large skillets with oil; heat over medium-high heat. Add 4 burgers to each skillet; cook 3 minutes. Turn burgers over. Cook 2 minutes; top with cheese and cook 30 seconds to 1 minute longer for medium-rare. Remove from heat.",
        "Place 1 bun bottom on each of 8 plates. Top each with 1 burger, 1 tomato slice, 1 red onion slice, watercress, and Red Vinegar Pickles. Spread bun tops generously with Spiced Ketchup and place atop burgers."
    ],
    "ingredients": [
        "1 1/4 pounds well-chilled beef brisket, trimmed of excess fat and sinew",
        "1 1/4 pounds well-chilled boneless short ribs, trimmed of excess fat and sinew",
        "1 1/4 pounds well-chilled hanger steak, skirt steak, or carne asada meat, trimmed of excess fat and sinew",
        "5 ounces well-chilled beef suet",
        "3 ounces well-chilled beef bone marrow",
        "2 tablespoons red miso mixed with 1/4 cup water until smooth",
        "Olive oil (for brushing)",
        "8 large slices sharp cheddar cheese",
        "8 large sesame seed buns, halved",
        "8 tomato slices",
        "8 red onion slices",
        "Fresh watercress sprigs",
        "Red Vinegar Pickles",
        "Spiced Ketchup",
        "Ingredient Info: Suet and bone marrow are sold at some upscale supermarkets. To make sure your market carries both, be sure to call ahead. You may need to special-order the items. Red miso (sometimes labeled aka miso) can be found in the refrigerated Asian foods section of some supermarkets and at natural foods stores and Japanese markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Dinner",
        "Lunch",
        "Brisket",
        "Steak",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Triple-Beef Cheeseburgers with Spiced Ketchup and Red Vinegar Pickles",
    "url": "http://www.epicurious.com/recipes/food/views/triple-beef-cheeseburgers-with-spiced-ketchup-and-red-vinegar-pickles-360757"
}
