{
    "directions": [
        "Mix flour, sugar and salt in processor. Add butter and cut in, using on/off turns, until mixture resembles coarse meal. Whisk egg yolk, cream and vanilla in small bowl. Add to flour mixture; process until moist clumps form. Gather dough into ball. Flatten into disk. Wrap in plastic; refrigerate 4 hours.",
        "Pour milk into heavy medium saucepan. Bring just to simmer. Whisk yolks, sugar and cornstarch in medium bowl to blend. Gradually whisk in hot milk. Return mixture to same saucepan. Whisk over medium heat until mixture thickens and comes to boil. Boil 1 minute. Pour pastry cream into medium bowl. Stir in minced ginger. Press plastic onto surface of pastry cream. Cover; chill until cold, about 4 hours. (Dough and pastry cream can be made 1 day ahead. keep chilled separately. Let dough soften slightly before pressing into pan.)",
        "Preheat oven to 375°F. Press dough onto bottom and up sides of 11x7 1/2-inch rectangular or 11-inch round tart pan with removable bottom. Line crust with foil. Fill with dried beans or pie weights. Bake until sides of crust are set, about 15 minutes. Remove foil and beans. Bake until crust is golden, piercing with fork if bubbles form, about 15 minutes. Transfer pan to rack and cool completely. Remove sides from pan.",
        "Combine preserves and Cognac in small saucepan. Stir over medium heat until preserves melt and mixture is thick, about 2 minutes. Strain syrup into another small saucepan; discard solids. Brush half of syrup onto bottom of crust. let stand at room temperature until set, about 5 minutes. Spread pastry cream evenly over. Arrange fruit over pastry cream. Rewarm ginger syrup. Brush over fruit. (Can be made 2 hours ahead. Cover and chill.) Garnish tart with mint."
    ],
    "ingredients": [
        "1 3/4 cups all purpose flour",
        "1/4 cup sugar",
        "1/4 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, but into small pieces",
        "1 large egg yolk",
        "3 tablespoons whipping cream",
        "1/2 teaspoon vanilla extract",
        "1 cup milk (do not use low-fat or nonfat)",
        "3 large egg yolks",
        "1/3 cup sugar",
        "2 tablespoons cornstarch",
        "2 tablespoons minced crystallized ginger",
        "2/3 cup ginger preserves",
        "2 tablespoons Cognac or brandy",
        "3 kiwis, peeled, thinly sliced",
        "1 papaya, seeded, peeled, thinly sliced",
        "1 ripe mango, pitted, peeled, thinly sliced",
        "Fresh mint springs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Kiwi",
        "Mango",
        "Papaya",
        "Brandy",
        "Chill",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tropical Fruit Tart",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-fruit-tart-1219"
}
