{
    "directions": [
        "If you are using dried chipotle or pasilla de Oaxaca chiles, soak them in warm water for minutes to soften, then drain, seed, and finely chop them. If using canned chipotles, rinse, seed, and finely chop them. If using jalapeño chiles, seed and finely chop them. Ready the poblano chiles. Set all the chiles aside.",
        "Halve the mango lengthwise, remove the pit, scoop out the flesh from each half with a spoon, and cut into 1/2-inch dice. Twist the stem off the pineapple half and stand the pineapple upright. Cut downward on all sides to remove the peel. Then, with a paring knife, remove the \"eyes\" by making diagonal cuts across the flesh just deep enough to lift them out. Cut the pineapple lengthwise into quarters, and cut away the strip of core that runs along each wedge. Cut the quarters crosswise into wedges about 1/4 inch wide, and cut the wedges into 1/4-inch dice. Peel the papaya, cut it in half lengthwise, and spoon out the seeds. Cut the halves lengthwise into wedges about 1/2 inch wide, and cut the wedges into 1/2-inch dice.",
        "In a bowl, combine the chiles, mango, pineapple, papaya, onion, cilantro, and lime juice. Toss together to mix well and then season with salt."
    ],
    "ingredients": [
        "2 dried chipotle chiles or chipotle chiles in adobo sauce, 2 pasilla de Oaxaca chiles, or 4 jalapeño chiles",
        "2 poblano chiles, charred, peeled, and seeded and then chopped medium-fine",
        "1 mango, about 1 pound",
        "1/2 pineapple, preferably Golden",
        "1 Hawaiian or 1/2 Mexican papaya",
        "1 red onion, finely chopped",
        "3 tablespoons finely chopped fresh cilantro, chopped at the last minute",
        "3 tablespoons fresh lime juice",
        "Salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Fruit",
        "Side",
        "Cinco de Mayo",
        "Summer",
        "Party",
        "Fat Free",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tropical Fruit Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-fruit-salsa-395212"
}
