{
    "directions": [
        "Whisk eggs, 3/4 cup sugar, lime juice and lime peel in heavy medium saucepan to blend. Whisk over medium-high heat until mixture thickens and just comes to boil, about 6 minutes. Transfer lime curd to small bowl; press plastic wrap directly onto surface. Chill until very cold, at least 3 hours and up to 3 days.",
        "Line 9 1/4x51/4x23/4-inch loaf pan with 2 layers of plastic wrap, leaving long overhang. Stir rum and remaining 2 tablespoons sugar in small bowl until sugar dissolves. Trim brown layer from outside of cake. Cut cake horizontally into 3 equal layers. Beat cream cheese in large bowl until fluffy; gently fold in cold lime curd.",
        "Trim bottom cake layer to fit pan bottom; reserve cake trimmings. Brush layer on both sides with 1/3 of rum syrup. Place in pan; spread 1 1/2 cups lime curd mixture over top. Brush second cake layer on both sides with 1/3 of rum syrup. Place in pan; spread remaining lime curd mixture over top. Brush third cake layer on both sides with remaining rum syrup. Place on lime curd mixture; press to adhere. Press reserved cake trimmings around sides. Cover torte with plastic overhang. Refrigerate torte at least 1 and up to 2 days.",
        "Stir first 4 ingredients in large bowl until sugar dissolves. Mix in mangoes.",
        "Cover; chill up to 1 day.",
        "Using plastic as aid, lift torte out of pan and unwrap. Cut crosswise into 12 slices. Arrange slices on plates. Top with compote. Garnish with lime slices."
    ],
    "ingredients": [
        "4 large eggs",
        "3/4 cup plus 2 tablespoons sugar",
        "1/2 cup fresh lime juice",
        "1 tablespoon grated lime peel",
        "1/2 cup dark rum",
        "1 16-ounce frozen all-butter pound cake, thawed",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup water",
        "1/2 cup sugar",
        "1/2 cup fresh lime juice",
        "1/2 teaspoon grated lime peel",
        "4 large ripe mangoes (5 to 6 pounds), peeled, pitted, diced",
        "Lime slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Cream Cheese",
        "Lime",
        "Mango",
        "Spring",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tropical Lime Torte with Mango Compote",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-lime-torte-with-mango-compote-104982"
}
