{
    "directions": [
        "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of pans with parchment paper. Combine 1/3 cup flour and next 3 ingredients in processor. Process until nuts are finely chopped. Whisk remaining 2 cups flour, cinnamon, baking powder, salt, and baking soda in medium bowl to blend.",
        "Using electric mixer, beat sugar and oil in large bowl to blend. Add eggs 1 at a time, beating well after each addition. Beat in vanilla. Beat in flour-spice mixture. Stir in coconut-macadamia mixture, then carrots and crushed pineapple.",
        "Divide batter among pans. Bake until tester inserted into center of cakes comes out clean, about 30 minutes. Cool in pans on racks 1 hour. Run knife around edge of pans to loosen cakes. Turn cakes out onto racks; cool completely.",
        "Beat cream cheese and butter in large bowl until smooth. Beat in powdered sugar, then cream of coconut and both extracts. Chill until firm enough to spread, about 30 minutes.",
        "Place 1 cake layer, flat side up, on platter. Spread 3/4 cup frosting over top of cake. Top with second cake layer, flat side up. Spread 3/4 cup frosting over. Top with third cake layer, rounded side up, pressing slightly to adhere. Spread thin layer of frosting over top and sides of cake. Chill cake and remaining frosting 30 minutes. Spread remaining frosting over top and sides of cake. Arrange whole nuts and ginger around top edge of cake. Chill 1 hour. (Can be made 1 day ahead. Cover with cake dome and chill. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2 1/3 cups sifted all purpose flour (sifted, then measured)",
        "1 cup sweetened flaked coconut",
        "1 cup dry-roasted macadamia nuts",
        "3/4 cup chopped crystallized ginger",
        "3 1/2 teaspoons ground cinnamon",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "2 cups sugar",
        "1 cup vegetable oil",
        "4 large eggs",
        "2 teaspoons vanilla extract",
        "2 cups finely grated peeled carrots",
        "2 8-ounce cans crushed pineapple in its own juice, well drained",
        "3 8-ounce packages Philadelphia-brand cream cheese, room temperature",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "2 cups powdered sugar",
        "3/4cup canned sweetened cream of coconut (such as Coco López)",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon (scant) coconut extract",
        "14 whole dry-roasted macadamia nuts",
        "1/4 cup chopped crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Ginger",
        "Dessert",
        "Bake",
        "Wedding",
        "Cream Cheese",
        "Coconut",
        "Pineapple",
        "Macadamia Nut",
        "Carrot"
    ],
    "title": "Tropical Carrot Cake with Coconut Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-carrot-cake-with-coconut-cream-cheese-frosting-107949"
}
