{
    "directions": [
        "In heavy, 12-inch skillet over moderately high heat, melt 4 tablespoons butter and brown sugar, stirring, until sugar dissolves, about 4 minutes. Add mango and pineapple and sauté until coated with butter, about 1 minute. Add bananas and sauté until coated with butter, about 1 minute.",
        "Pour rum into pan, but do not stir into sauce. Allow rum to heat, about 1 minute, then tilt pan away from you and use long match to carefully ignite sauce. Let sauce burn, swirling skillet to prolong flame, until it dies out, about 1 to 2 minutes. Using slotted spoon, remove bananas from pan, place, cut side up, on plate, and sprinkle with sugar.",
        "Pour cream and coconut extract into pan and bring to boil. Reduce heat and simmer, uncovered, until thickened, about 3 to 4 minutes. Keep warm.",
        "In large, nonstick skillet over moderately high heat, melt remaining 2 tablespoons butter until foam subsides. Add bananas, cut side down, and sauté until golden brown, about 4 to 5 minutes. Remove from heat.",
        "Into each of 4 chilled bowls, scoop 1/3 cup ice cream. Place 3 pieces banana in each bowl. Divide mango and pineapple among bowls. Spoon sauce over fruit and garnish with wafer cookies if desired. Serve immediately."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "1/2 cup dark brown sugar",
        "1 mango, peeled, pitted, and cut into 1/2-inch dice",
        "1/4 pineapple, peeled, cored, and cut into 1/2-inch dice",
        "3 bananas, peeled and quartered (cut in half both lengthwise and crosswise)",
        "1/4 cup Meyers dark rum",
        "1/2 cup heavy cream",
        "1/2 teaspoon coconut extract",
        "1 tablespoon sugar",
        "1 pint vanilla ice cream",
        "12 vanilla wafer cookies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Citrus",
        "Dairy",
        "Fruit",
        "Dessert",
        "Sauté",
        "Quick & Easy",
        "Banana",
        "Mango",
        "Pineapple",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tropical Fruit Foster Split",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-fruit-foster-split-236221"
}
