{
    "directions": [
        "Combine all ingredients in blender. Blend until smooth. DO AHEAD: Crepe batter can be made 4 hours ahead. Cover and refrigerate. Reblend before using.",
        "Line plate with paper towel or parchment paper. Heat 9-inch-diameter nonstick skillet with 7-inch-diameter bottom over medium heat. Add 2 tablespoons crepe batter to skillet; tilt and swirl skillet to spread batter evenly over bottom. Cook until center of crepe is cooked through and edges are lightly browned, about 1 minute. Run spatula around crepe and invert onto prepared paper-towel-lined plate. Repeat with remaining batter, placing paper towels or parchment paper between crepes. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Using electric mixer, beat sugar, butter, and salt in medium bowl until fluffy, about 2 minutes. Gradually add rum and beat until well blended. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Melt butter in large nonstick skillet over medium-high heat. Add pineapple to skillet and scrape in seeds from vanilla bean; add bean. Add sugar and salt; stir until sugar dissolves and pineapple and pan juices are lightly browned, about 4 minutes. Stir in lime juice. Remove from heat. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 300°F. Place crepe stack (with paper towels between crepes) on rimmed baking sheet. Cover baking sheet with foil; warm crepes in oven until heated through, about 15 minutes. Place rum butter sauce mixture in small saucepan; heat over medium heat until melted and smooth, stirring occasionally. Rewarm tropical fruit mixture over medium heat, stirring occasionally, about 3 minutes. Stir in papaya and mango.",
        "Place 1 crepe on plate, browned side down. Spoon 2 teaspoons rum butter sauce over crepe, then fold crepe into quarters. Repeat with 2 more crepes on same plate. Spoon tropical fruit over. Repeat with remaining crepes, rum butter sauce, and tropical fruit, placing 3 crepes on each of 6 plates. Spoon any remaining rum butter sauce over crepes and serve."
    ],
    "ingredients": [
        "1 cup whole milk",
        "1/2 cup cornstarch",
        "1/4 cup all purpose flour",
        "3 large eggs",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons sugar",
        "1 tablespoon dark rum",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon coarse kosher salt",
        "1/2 cup sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1/4 teaspoon coarse kosher salt",
        "3 tablespoons dark rum",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 cup 3/4-inch cubes peeled fresh pineapple",
        "1/2 vanilla bean, split lengthwise",
        "1/4 cup sugar",
        "1/4 teaspoon coarse kosher salt",
        "2 tablespoons fresh lime juice",
        "1 cup 3/4-inch cubes peeled seeded papaya (from about 1 large)",
        "1 cup 3/4-inch cubes peeled pitted mango (from about 1 large)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Mixer",
        "Citrus",
        "Egg",
        "Fruit",
        "Dessert",
        "Tropical Fruit",
        "Vanilla",
        "Summer",
        "Anniversary",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tropical Fruit Crepes with Vanilla Bean and Rum Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-fruit-crepes-with-vanilla-bean-and-rum-butter-sauce-237312"
}
