{
    "directions": [
        "Stir together rum, boiling-hot water, and vanilla. Cook sugar in a 3-quart heavy saucepan over moderately low heat, stirring slowly with a fork, until melted and pale golden. Cook caramel without stirring, swirling pan, until deep golden. Remove pan from heat and carefully stir in rum mixture (caramel will harden and steam vigorously). (Pan is removed from the flame to prevent alcohol from igniting. If it does ignite, simply allow flames to burn out on their own.) Simmer sauce until smooth. Remove pan from heat and when bubbling subsides stir in butter. Cool sauce to room temperature.",
        "Prepare grill for cooking. Standing mango upright, cut 1 lengthwise slice from each broad side of mango (be careful because peeled mango is slippery) and discard pit.",
        "Cut each papaya half lengthwise into thirds.",
        "Standing pineapple upright, cut lengthwise into 1/2-inch-thick slices.",
        "Halve bananas lengthwise. Sprinkle all fruit lightly on 1 side with chili powder.",
        "Grill fruit on a well-oiled rack set 5 to 6 inches over glowing coals until grill marks form, about 1 minute. Turn fruit over and grill 1 minute more. Transfer to a cutting board and slice into decorative pieces.",
        "Coarsely chop three fourths of brittle, reserving remainder for garnish.",
        "Put 3 scoops ice cream into each of 8 dishes and top with grilled fruit and sauce. Sprinkle splits with chopped brittle and garnish with larger pieces of brittle and coconut."
    ],
    "ingredients": [
        "1/2 cup dark rum",
        "1/4 cup boiling-hot water",
        "1 teaspoon vanilla",
        "2 cups sugar",
        "1 tablespoon unsalted butter",
        "1 firm-ripe mango, peeled",
        "1 papaya, peeled, halved, and seeded",
        "1/2 fresh pineapple, peeled and cored",
        "12 small ripe finger bananas or 6 small regular bananas",
        "1 tablespoon chili powder",
        "Chile-macadamia brittle",
        "3 pints premium vanilla ice cream",
        "Garnish: toasted fresh coconut shavings or toasted sweetened flaked coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Fruit",
        "Dessert",
        "Picnic",
        "Macadamia Nut",
        "Summer",
        "Grill/Barbecue",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tropical Fruit Splits with Rum Sauce and Chile-Macadamia Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/tropical-fruit-splits-with-rum-sauce-and-chile-macadamia-brittle-103580"
}
