{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F. Butter bottom and sides of a 13- by 9-inch glass baking dish.",
        "Cut carrot and celery lengthwise with slicer into very thin matchsticks (less than 1/8 inch wide and 2 1/2 inches long).",
        "Rinse trout and remove any pin bones with tweezers or needlenose pliers. Pat dry, then sprinkle 1/2 teaspoon each of salt and pepper on fish (flesh sides only). Arrange fillets in baking dish, skin sides down, overlapping slightly.",
        "Heat butter (2 tablespoons) in a 12-inch heavy skillet over moderate heat until foam subsides, then cook shallots, stirring, until softened, about 3 minutes (do not brown). Add carrot, celery, parsley, and peppercorns and cook, stirring, until vegetables are crisp-tender, about 5 minutes. Add water, wine, and 1/2 teaspoon salt and boil 1 minute. Remove skillet from heat and pour liquid over fish, then spread vegetables evenly in baking dish. Set skillet aside. Cover dish tightly with foil and bake until fish is just cooked through, 6 to 8 minutes.",
        "Transfer fish (topped with vegetables) to a platter and cover with foil to keep warm. Pour cooking liquid with any remaining vegetables through a sieve set over a bowl. Sprinkle vegetables from sieve over fish (discard peppercorns) and re-cover with foil.",
        "Spoon 1 cup of strained cooking liquid into cleaned skillet. Boil over high heat until reduced to about 1/2 cup, about 2 minutes. Whisk cream into cornstarch until smooth, then whisk into sauce and boil, whisking, until thickened, about 1 minute. Stir in tarragon, lemon juice, and remaining 1/2 teaspoon each of salt and pepper.",
        "Remove foil from fish and blot any liquid accumulated on platter with paper towels. Pour sauce over fish."
    ],
    "ingredients": [
        "2 tablespoons (1 oz) unsalted butter plus additional for greasing",
        "1 medium carrot",
        "1 celery rib",
        "4 (6- to 8-oz) trout fillets with skin",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "4 medium shallots, cut lengthwise into 1/8-inch-thick slices (1 cup)",
        "2 fresh parsley sprigs",
        "5 black peppercorns",
        "1 1/2 cups water",
        "1 1/2 cups dry Riesling",
        "3/4 cup heavy cream",
        "2 teaspoons cornstarch",
        "2 teaspoons chopped fresh tarragon",
        "1/2 teaspoon fresh lemon juice",
        "Special equipment: an adjustable-blade slicer; tweezers or needlenose pliers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Poach",
        "Quick & Easy",
        "Trout",
        "White Wine",
        "Tarragon",
        "Shallot",
        "Gourmet"
    ],
    "title": "Trout in Riesling",
    "url": "http://www.epicurious.com/recipes/food/views/trout-in-riesling-232619"
}
