{
    "directions": [
        "Divide oven into thirds and preheat to 350°F. Bake 12 to 16 minutes. Prepare the cookie sheets as directed.",
        "In a medium bowl, whisk together the flour, baking soda, salt and cinnamon.",
        "In a large bowl, using a sturdy spoon, or in the bowl of an electric mixer, preferably with a paddle attachment, beat the butter until soft and creamy, then beat in both sugars. Scrape down the bowl and beater, if using, and beat until smooth. Beat in the eggs and vanilla and scrape down the bowl again.",
        "Stirring slowly, or with the mixer on the lowest speed, gradually work in the flour mixture, then the oats and raisins. The dough will feel very stiff. (You can make the dough ahead, cover, and refrigerate for several hours.)",
        "Drop the dough onto the prepared cookie sheets by the heaping tablespoon, placing the cookies about 2 inches apart. Bake 12 to 16 minutes (or for the time indicated for your altitude in the chart), or until the cookies are golden brown; the longer they bake, the crisper they will be.",
        "Cool the cookies on a wire rack. If the cookies were baked on parchment or a baking mat, simply slide it off the cookie sheet onto the wire rack to cool. When the cookies are completely cool, store them in an airtight container."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 pound (2 sticks) unsalted butter, at room temperature",
        "1 cup granulated sugar",
        "1/2 cup dark brown sugar, packed",
        "2 large eggs at room temperature",
        "1 teaspoon vanilla extract",
        "3 cups old-fashioned rolled oats",
        "1 cup (6 ounces) raisins",
        "Special Equipment: Cookie sheets (not insulated); baking parchment or Silpat or other nonstick baking mats (optional); flat paddle aattachment for electric mixer (optional)",
        "Pan Preparation: Line the cookie sheets with baking parchment or nonstick mats or coat with butter or nonstick vegetable spray."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Raisin",
        "Oat",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Trout Dale Oatmeal-Raisin Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/trout-dale-oatmeal-raisin-cookies-240345"
}
