{
    "directions": [
        "With scissors, cut away the dorsal fin along the back of each fish. Hold each pectoral fin (the one closest to the head) and cut away and discard the gill plate and pectoral fin. Turn the fish on its back and open it up. Starting at the head, cut away the belly flap on each side, along with the pelvic fin. Remove the tail by cutting across the fish about an inch from the bottom of the tail. Set aside.",
        "Bring a large pot of generously salted water to a boil. Prepare an ice bath. Blanch the haricots verts in the boiling water for 2 to 6 minutes, or until they are barely tender, with a slight bite still left to them. Drain the beans and transfer to the ice bath to chill quickly, then drain again and dry on paper towels.",
        "Lightly sprinkle both sides of each trout with salt and pepper. If you have them, heat two 12-inch nonstick pans (special oval pans work best for fish) over medium-high heat. If you have only one pan, cook two trout first, cover, and keep them in a warm place while you cook the final two. Coat each pan with a light film of canola oil. Add the trout skin side down and sauté for about 4 minutes on one side only. The fish may still look undercooked at the top of the flesh, but the hot ingredients that will top them will complete the cooking.",
        "Meanwhile, put the beans in a sauté pan, add 2 tablespoons of the butter and 1/3 cup water, and place over medium heat. Heat, stirring occasionally, until the water has evaporated and the beans are hot and glazed with butter. Season to taste with salt and pepper. Remove the pan from the heat and keep warm.",
        "When the fish are done, cut off the heads and discard, if desired, and place the fish on serving plates. Drain the oil from one of the pans and return the pan to the heat. Add the remaining 8 tablespoons butter and a pinch of salt to the hot pan. When the butter begins to brown, add the almonds, shaking the pan to brown them evenly. When they are a rich golden brown, add the parsley and lemon juice.",
        "Meanwhile, cover each trout with one-quarter of the beans.",
        "Spoon the foaming butter and almonds over the haricots verts and around the edges of the plates."
    ],
    "ingredients": [
        "Four 10-ounce boned whole rainbow trout",
        "8 ounces haricots verts, stem ends removed",
        "Kosher salt and freshly ground white pepper",
        "Canola oil",
        "10 tablespoons (5 ounces) unsalted butter",
        "3/4 cup sliced blanched (skinned) almonds, lightly toasted",
        "2 teaspoons minced Italian parsley",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Nut",
        "Sauté",
        "Low/No Sugar",
        "Dinner",
        "Almond",
        "Trout",
        "Green Bean",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Trout with Haricots Verts and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/trout-with-haricots-verts-and-almonds-231344"
}
