{
    "directions": [
        "Cook bacon in a 10-inch nonreactive heavy skillet over medium-low heat, turning occasionally, until lightly browned but still flexible. Drain on paper towels.",
        "Pour off all but 2 tablespoons fat from skillet, then cook onion with butter in skillet over medium heat, stirring occasionally, until golden, 10 to 15 minutes. Stir in remaining ingredients, except trout, and 1/8 teaspoon each of salt and pepper and simmer, covered, stirring occasionally, until liquid is absorbed and mixture is tender and lightly browned, 25 to 35 minutes.",
        "While sauerkraut mixture cooks, put trout, skin sides down, on a work surface. Pat fillets dry and lightly season with salt and pepper, then put a strip of bacon on each. Roll up fillets from wider end, enclosing bacon and securing each with a wooden pick.",
        "Arrange rolls, wider spiral sides up, on sauerkraut mixture and cover with a round of buttered parchment paper, then with a lid. Cook, covered, over medium heat until fish is just cooked through, 10 to 12 minutes. Discard bay leaf, juniper berries, and wooden picks. Serve trout on sauerkraut."
    ],
    "ingredients": [
        "4 bacon slices",
        "1 large onion, halved lengthwise and thinly sliced",
        "3 tablespoons unsalted butter",
        "1 pound sauerkraut, drained, rinsed, and squeezed dry",
        "2 juniper berries, slightly crushed",
        "1 Turkish or 1/2 California bay leaf",
        "1 1/2 teaspoons sugar",
        "2/3 cup dry white wine (preferably Alsatian Riesling)",
        "3/4 cup water",
        "4 (4- to 5-ounce) trout fillets with skin, pin bones removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Bacon",
        "Trout",
        "White Wine",
        "Cabbage",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Trout Choucroute",
    "url": "http://www.epicurious.com/recipes/food/views/trout-choucroute-241724"
}
