{
    "directions": [
        "Place chicken breasts on a solid, level surface. Pound with a meat tenderizer to an even thickness; season with salt and pepper and toss with 2 tablespoons peanut oil until evenly coated.",
        "Heat a cast iron or heavy skillet over medium heat. Place chicken in heated skillet and cook until no longer pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Brush barbeque sauce on top of chicken. Cover skillet and cook until chicken is glazed, about 1 minute per side. Transfer chicken to a plate and cover with aluminum foil to keep warm.",
        "(A countertop induction oven can be used in place of the skillet to cook the chicken. Preheat the oven with the grill pan inside on the grill setting. Grill chicken on medium until no longer pink in the center, about 4 minutes per side. Brush barbeque sauce on top of chicken and return to oven; cook until chicken is glazed, about 1 minute per side.)",
        "Wipe skillet with a paper towel. Heat remaining 2 tablespoons peanut oil over medium heat. Add luncheon meat; cook and stir until browned and crisp, 3 to 5 minutes.",
        "Heat butter in a separate skillet over medium heat. Add pickled carrot and daikon, kimchee, and rice; cook and stir until heated through, 1 to 2 minutes. Season rice mixture with liquid seasoning and soy sauce; stir in garlic flakes. Cook and stir until rice is crisp in places, 3 to 5 minutes. Add gochujang and luncheon meat to fried rice and mix well.",
        "Divide fried rice among serving plates. Slice chicken breasts; arrange over rice.",
        "Mix mayonnaise and Sriracha hot sauce together in a small bowl; spoon over chicken. Sprinkle green onion on top."
    ],
    "ingredients": [
        "2 skin-on, boneless chicken breasts",
        "salt and ground black pepper to taste",
        "1/4 cup peanut oil, divided",
        "1/4 cup Korean barbeque sauce",
        "1 slice fully cooked luncheon meat (such as SPAM®), cubed",
        "1 tablespoon butter, or more to taste",
        "1/2 cup chopped Napa cabbage kimchee",
        "1/4 cup chopped pickled carrot and daikon radish (optional)",
        "2 cups cooked white rice, cooled",
        "1 tablespoon soy-based liquid seasoning (such as Maggi®)",
        "2 teaspoons soy sauce",
        "1 tablespoon dried garlic flakes",
        "2 tablespoons gochujang (Korean hot pepper paste), or to taste",
        "1 tablespoon mayonnaise, or to taste",
        "1 teaspoon Sriracha hot sauce, or to taste",
        "1 green onion, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Troy's Korean Glazed Chicken Breast with Kimchee Fried Rice",
    "url": "http://allrecipes.com/recipe/255319/troys-korean-glazed-chicken-breast-w/"
}
