{
    "directions": [
        "Rinse the dried mushrooms well under cold running water to remove dirt. Place in a small bowl along with 1 cup of boiling water. Allow to rest for 15 minutes, then drain, reserving 1/2 cup of the liquid.",
        "Heat a large stockpot over medium heat. Add the truffle oil or olive oil, flour, salt, and black pepper. Cook 1 to 2 minutes, stirring often, until a thick paste forms. Reduce the heat to low, add half of the milk, and whisk well to create a soft paste. Whisk in the remaining milk and reserved mushroom liquid. Add the shiitakes and cook 2 to 3 minutes, stirring occasionally, until the mushrooms are soft and a thick mixture forms.",
        "Add the Fontina, Parmesan, and goat cheese. Stir together well and cook 1 minute, until the cheese melts. Add the artichokes and cooked pasta. Stir well to coat. Serve immediately with the broccoli on the side."
    ],
    "ingredients": [
        "2 ounces (2 cups) dried mushrooms, any type",
        "1 cup boiling water",
        "2 tablespoons truffle oil or olive oil",
        "3 tablespoons whole-wheat pastry flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 cup skim milk",
        "4 ounces shiitake mushrooms, stems discarded, caps thinly sliced",
        "1 cup grated Fontina cheese (about 2 ounces; grate on a microplane)",
        "1/2 cup grated Parmesan",
        "1 ounce goat cheese",
        "1 9-ounce package frozen artichoke hearts, defrosted and roughly chopped",
        "6 ounces dry, whole-wheat macaroni, cooked according to the package instructions",
        "1 head broccoli, cut into florets, stalk discarded, steamed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Side",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Parmesan",
        "Artichoke",
        "Broccoli",
        "Healthy",
        "Fontina",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Truffled Mac 'N' Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/truffled-mac-n-cheese-51186230"
}
