{
    "directions": [
        "Coarsely chop 1 1/2 truffles; place in processor. Add butter; process mixture until well blended and truffles are finely chopped, about 1 minute. Season truffle butter with salt and pepper. Thinly slice remaining 1/2 truffle; cover and chill.",
        "Rinse turkey inside and out; pat dry with paper towels. Sprinkle main cavity with salt and pepper. Starting at neck end, carefully slide hand between skin and breast meat to loosen skin. Rub truffle butter, 1 tablespoon at a time, over breast meat under skin. Rub any truffle butter that remains on hands all over outside of turkey. Place turkey on small rack set in large roasting pan. Using kitchen string, tie 4 thyme sprigs, 2 parsley sprigs, and 3 bay leaves together. Repeat with remaining 4 thyme sprigs, 2 parsley sprigs, and 3 bay leaves. Place 1 herb bouquet in main cavity of turkey and 1 in neck cavity. Tie legs together loosely to hold shape. Cover turkey with plastic wrap. Chill overnight.",
        "Preheat oven to 375°F. Tuck turkey wings under. Place shallots and turkey neck around turkey in pan. Sprinkle turkey, shallots, and neck with salt and pepper. Roast until turkey and shallots are golden brown, about 1 hour 15 minutes. Gently stir shallots. Pour 1 cup broth over turkey. Roast 30 minutes. Pour 1 cup broth over turkey. Cover turkey breast and legs loosely with foil. Roast until instant-read thermometer inserted into thickest part of thigh registers 175°F, basting every 30 minutes with pan drippings and adding 1 cup more broth to pan after 45 minutes, about 1 hour 15 minutes longer. Transfer turkey to platter; tent loosely with foil. Let stand 30 minutes (internal temperature of turkey will increase 5 to 10 degrees). Using slotted spoon, transfer shallots to bowl. Discard turkey neck.",
        "Pour pan juices into 4-cup measuring cup. Spoon off fat from top of pan juices, reserving 6 tablespoons fat. Discard remaining fat. Add enough chicken broth to pan juices to measure 3 cups. Pour Cognac into roasting pan; place over low heat and bring to boil, scraping up any browned bits. Add to pan juices. Melt 2 tablespoons reserved turkey fat in heavy large saucepan over medium-low heat. Add flour and stir 1 minute. Gradually whisk in pan juices. Boil until sauce thickens very slightly, whisking occasionally, about 5 minutes (gravy will be thin). Stir reserved sliced 1/2 truffle into gravy. Season with salt and pepper. Cover to keep warm.",
        "Melt 4 tablespoons fat in heavy large skillet over medium-high heat. Add chestnuts and sauté until heated through, about 5 minutes. Add roasted shallots and chopped parsley; sauté until heated through, about 4 minutes. Season with salt and pepper. Surround turkey with chestnut-shallot mixture. Serve with gravy.",
        "*Available at specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "2 1-inch-diameter black truffles from jar*",
        "6 tablespoons (3/4 stick) butter, room temperature",
        "1 16-pound turkey, neck reserved",
        "8 large fresh thyme sprigs",
        "4 large fresh parsley sprigs",
        "6 bay leaves",
        "12 large shallots (about 1 1/2 pounds), peeled, cut in half",
        "3 cups (or more) canned low-salt chicken broth",
        "1/2 cup Cognac or brandy",
        "3 tablespoons all purpose flour",
        "3 7.4-ounce jars whole roasted peeled chestnuts*",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Winter",
        "Chestnut",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Truffle-Scented Roast Turkey with Shallots and Chestnuts",
    "url": "http://www.epicurious.com/recipes/food/views/truffle-scented-roast-turkey-with-shallots-and-chestnuts-105996"
}
