{
    "directions": [
        "Melt butter in heavy large saucepan over medium heat. Add leek, fennel, onion, and garlic. Stir until vegetables are soft, about 5 minutes. Add tomato paste and cook until beginning to brown on bottom of pan, about 2 minutes. Add cheese rinds, thyme, and parsley. Add enough water just to cover. Bring to boil; reduce heat to medium-low, cover, and simmer 2 hours, stirring occasionally. Strain, discarding solids in strainer. Return broth to saucepan. Boil over medium-high heat until reduced to 1 1/2 cups, about 15 minutes. Season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cover and chill. Rewarm before using, whisking to blend.",
        "Place first 5 ingredients in double layer of cheesecloth; gather ends. Tie tightly with kitchen string; trim excess cloth.",
        "Bring chicken and beef broths to simmer in medium saucepan. Cover and keep warm. Melt butter in large saucepan over medium heat. Add herb bundle, onion, and garlic. Cook until onion is soft, stirring occasionally, about 5 minutes. Add rice and stir to coat. Add wine; increase heat to high. Boil until almost dry, about 6 minutes. Add warm broth mixture 1 cup at a time, allowing each addition to be absorbed before adding next and stirring often until rice is tender but still firm to bite, about 20 minutes. Add truffle butter, verjus, parsley, and chives. Stir until butter is melted. Season to taste with salt and pepper. Divide risotto among bowls. Pour 1/4 cup warm parmesan broth around risotto in each bowl and serve."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 small leek (white part only), chopped",
        "1 small fennel bulb, chopped",
        "1/2 onion, chopped",
        "1/2 head of garlic, halved crosswise",
        "1 teaspoon tomato paste",
        "1 1/2 pounds Parmesan cheese rinds, broken into 2- to 3-inch squares",
        "2 fresh thyme sprigs",
        "2 fresh parsley sprigs",
        "8 cups (about) water",
        "4 fresh thyme sprigs",
        "2 fresh Italian parsley sprigs",
        "2 bay leaves",
        "1 teaspoon whole black peppercorns",
        "1 teaspoon fennel seeds",
        "2 cups low-salt chicken broth",
        "2 cups beef broth",
        "1/2 cup (1 stick) butter",
        "1/2 cup minced onion",
        "1 garlic clove, minced",
        "2 cups carnaroli rice or arborio rice",
        "2 cups Pinot Noir",
        "6 ounces white truffle butter*",
        "2 tablespoons red or white verjus or 1 tablespoon red or white wine vinegar",
        "2 tablespoons minced fresh Italian parsley",
        "1 tablespoon minced fresh chives",
        "Special equipment: cheesecloth",
        "*White truffle butter can be found at specialty foods stores, at Italian markets, and online at cooking.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Herb",
        "Mushroom",
        "Rice",
        "Side",
        "Parmesan",
        "Red Wine",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Truffled Red Wine Risotto with Parmesan Broth",
    "url": "http://www.epicurious.com/recipes/food/views/truffled-red-wine-risotto-with-parmesan-broth-235854"
}
