{
    "directions": [
        "To make the crust, combine the flour, salt, cold butter, and cold shortening in the bowl of a food processor. Pulse until the butter and shortening are the size of small peas. Transfer the mixture to a bowl. Add the coconut water and rum 1 tablespoon at a time, tossing with a fork to mix. When the mixture can be squeezed into a ball, wrap it with plastic wrap and refrigerate for 30 minutes.",
        "Grease an 8-inch pie pan. Roll out the dough on a lightly floured surface into a 12-inch circle. Carefully transfer the dough to the pie pan. Trim the edges and fold the dough under itself; crimp the crust. Cover loosely with plastic wrap and refrigerate for 30 minutes.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Prick the bottom and sides of the pie dough with a fork. Line the dough with parchment paper or aluminum foil and weigh it down with pie weights or dried beans (see Editor's Note). Bake until the edges of the crust are golden and the bottom of the crust is just beginning to color, 15 to 20 minutes. Remove the crust from the oven, carefully remove the foil and beans, and set aside.",
        "Combine the coconut milk, 1/2 cup sugar, 1 cup toasted coconut, and the scraped vanilla bean seeds and pod in a saucepan over medium-low heat. Stir occasionally to dissolve the sugar. Bring the mixture to a boil and remove from the heat.",
        "Whisk the remaining 1/2 cup sugar with the cornstarch. Whisk the eggs and egg yolk together in a large heat-proof bowl; whisk in the milk and the cornstarch mixture. Gradually pour the hot coconut milk into the egg mixture, whisking constantly. Return the custard mixture to the saucepan.",
        "Cook the custard over medium heat, stirring constantly with a spatula or wooden spoon. Bring the mixture to a boil and cook, stirring, for 2 minutes. The mixture will thicken. Remove the pan from the heat and discard the vanilla bean pod. Whisk in the butter. Pour the custard into the cooled pie crust. Chill the pie for 1 hour.",
        "Place a mixing bowl and beaters in the freezer for 15 minutes to chill. Whip the cream on high speed until it begins to thicken; gradually add the confectioner's sugar, vanilla, and lemon juice. Continue beating until stiff. Pipe or spread the cream onto the chilled pie and sprinkle with the remaining toasted coconut."
    ],
    "ingredients": [
        "Crust:",
        "1 cup all-purpose flour",
        "3/8 teaspoon salt",
        "1/4 cup unsalted butter, chilled and cubed",
        "2 tablespoons butter flavored shortening, chilled",
        "1 1/2 tablespoons coconut water, or as needed",
        "3/4 fluid ounce coconut-flavored rum",
        "Filling:",
        "1 (18 ounce) can coconut milk",
        "1 cup white sugar, divided",
        "1 cup flaked sweetened coconut, toasted",
        "1 vanilla bean, split and scraped",
        "1/3 cup cornstarch",
        "3/4 cup whole milk",
        "2 eggs",
        "1 egg yolk",
        "2 tablespoons butter, room temperature",
        "Topping:",
        "2 cups heavy whipping cream",
        "1/4 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 teaspoon lemon juice",
        "2 tablespoons flaked sweetened coconut, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Truly Coconutty Cream Pie",
    "url": "http://allrecipes.com/recipe/216873/truly-coconutty-cream-pie/"
}
