{
    "directions": [
        "Heat oil in a small pot over low heat. Add 1 teaspoon ginger and garlic; cook and stir until slightly browned, about 2 minutes. Stir in 1/4 cup tamari, 1/4 cup sake, mirin, brown sugar, and sesame seeds; simmer until glaze is slightly thickened, about 5 minutes.",
        "Combine ground chicken, egg, green onions, carrot, bread crumbs, miso, 2 tablespoons ginger, potato starch, seaweed, 1 tablespoon tamari, 1 tablespoon sake, soy sauce, white sugar, and paprika in a large bowl; mix well into a thick paste, at least 5 minutes.",
        "Preheat grill for medium heat and lightly oil the grate.",
        "Roll ground chicken mixture into balls the size of your palm. Flatten them slightly into patties. Grill until well-browned, 3 to 4 minutes. Flip and continue grilling until browned on the second side, 2 to 3 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Brush glaze over meatballs before serving."
    ],
    "ingredients": [
        "Teriyaki Sauce:",
        "1 teaspoon vegetable oil",
        "1 teaspoon minced ginger",
        "1 teaspoon minced garlic",
        "1/4 cup tamari",
        "1/4 cup cooking sake",
        "1/4 cup mirin",
        "2 tablespoons brown sugar",
        "1 teaspoon sesame seeds",
        "Meatballs:",
        "10 1/2 ounces ground chicken",
        "1 egg",
        "3 green onions, chopped",
        "1/2 carrot, grated",
        "1/4 cup panko bread crumbs, or to taste",
        "2 tablespoons red miso paste, or more to taste",
        "2 tablespoons grated ginger",
        "1 tablespoon potato starch",
        "1 tablespoon crumbled seaweed",
        "1 tablespoon tamari, or more to taste",
        "1 tablespoon cooking sake, or more to taste",
        "1 teaspoon soy sauce",
        "1 teaspoon white sugar, or more to taste",
        "1 teaspoon ground paprika, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tsukune (Japanese Chicken Meatballs)",
    "url": "http://allrecipes.com/recipe/254234/tsukune-japanese-chicken-meatballs/"
}
