{
    "directions": [
        "In a sterile 2 quart jar, blend together the yeast, 2 teaspoons of castor sugar, and 2 teaspoons of ground ginger. Stir in the cold water until well blended. Cover with a clean cheesecloth, and let sit in a convenient corner at room temperature where it will be out of the way for the next seven days.",
        "Every morning for the next seven days, feed the yeast mixture by stirring in 1 teaspoon of castor sugar, and 1 teaspoon of ground ginger.",
        "On the eighth day, give the mixture a good stir, then strain it through a clean tea towel into a large new plastic bucket, bin, or glass carbuoy. Wring all of the liquid out of the cloth, and set aside. You will be dealing with this later.",
        "Dissolve the white sugar in 5 cups of boiling water by stirring vigorously. Pour the cold water into the bucket with the ginger juice, then stir in the sugar syrup and lemon juice.",
        "Siphon the mixture into sterile screw top bottles, filling to within 2 inches of the top. Old cleaned out soda bottles will do. Screw on the tops tightly. Store the bottles of ginger beer in a cool dark place where they can remain undisturbed for 7 days. Be very careful upon opening as the beer is very fizzy.",
        "Go back to the cloth now. The residue looks disgusting! However, lay the towel out flat with the disgusting side up. Use a knife to scrape the stuff to the center, then divide in half, and place each half into a separate sterile jar. Top each jar with 2 cups of cold water, and you are ready to go again. Twice! Begin with step 2 for subsequent batches. Unless you are very thirsty, I suggest you give one of them away."
    ],
    "ingredients": [
        "1 (0.6 ounce) cake compressed fresh yeast",
        "2 teaspoons castor sugar or superfine sugar",
        "2 teaspoons ground ginger",
        "2 cups cold water",
        "7 teaspoons castor sugar or superfine sugar, divided",
        "7 teaspoons ground ginger, divided",
        "3 3/4 cups white sugar",
        "5 cups boiling water",
        "12 1/2 cups cold water",
        "1/2 cup strained fresh lemon juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tudor",
    "url": "http://allrecipes.com/recipe/74832/tudor-recipe-for-ginger-beer/"
}
