{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F. Butter a shallow 2-quart baking dish.",
        "Cook onion in 1 1/2 tablespoons butter with a pinch of salt in a 12-inch heavy skillet over moderately low heat, covered, stirring occasionally, until softened, about 5 minutes. Increase heat to moderately high and add mushrooms, then sauté, stirring occasionally, until mushrooms begin to give off liquid, about 2 minutes. Add soy sauce and continue to sauté mushrooms, stirring, until liquid mushrooms give off is evaporated. Add Sherry and boil, stirring occasionally, until evaporated. Remove from heat.",
        "Melt remaining 3 tablespoons butter in a 2- to 3-quart heavy saucepan over moderately low heat and whisk in flour, then cook roux, whisking, 3 minutes. Add broth in a stream, whisking, and bring to a boil, whisking. Whisk in milk and simmer sauce, whisking occasionally, 5 minutes. Stir in mushroom mixture, lemon juice, and salt. Flake tuna into sauce and stir gently. Season sauce with salt and pepper.",
        "Cook noodles in a 5- to 6-quart pot of boiling salted water until al dente. Drain noodles in a colander and return to pot. Add sauce and stir gently to combine. Transfer mixture to baking dish, spreading evenly.",
        "Toss together bread crumbs and cheese in a bowl. Drizzle with oil and toss again, then sprinkle evenly over casserole. Bake until topping is crisp and sauce is bubbling, 20 to 30 minutes."
    ],
    "ingredients": [
        "1 medium onion, finely chopped",
        "4 1/2 tablespoons unsalted butter",
        "10 oz mushrooms, trimmed and sliced 1/4 inch thick (4 cups)",
        "2 teaspoons soy sauce",
        "1/4 cup Sherry",
        "1/4 cup all-purpose flour",
        "2 cups low-sodium chicken broth",
        "1 cup whole milk",
        "2 teaspoons fresh lemon juice",
        "1/4 teaspoon salt",
        "1 (6-oz) can tuna in olive oil, drained",
        "6 oz dried curly egg noodles (preferably Pennsylvania Dutch style; about 3 1/4 cups)",
        "1 1/2 cups coarse fresh bread crumbs (from 3 slices firm white sandwich bread)",
        "4 oz coarsely grated Cheddar (1 cup)",
        "1 tablespoon vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Onion",
        "Pasta",
        "Bake",
        "Casserole/Gratin",
        "Cheddar",
        "Tuna",
        "Winter",
        "Noodle",
        "Gourmet",
        "Washington, D.C."
    ],
    "title": "Tuna Noodle Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-noodle-casserole-109434"
}
