{
    "directions": [
        "Preheat oven to 400°F. Place beets on sheet of foil. Drizzle beets with olive oil, sprinkle with salt and pepper, and seal foil tightly. Roast beets until tender, about 50 minutes. Cool and peel beets. DO AHEAD Can be made 1 day ahead. Cover and chill.",
        "Cut beets into 1/4-inch cubes. Whisk yogurt, 2 tablespoons lemon juice, tahini, and 2 tablespoons water in medium bowl. Add beets and fold to coat. Season with salt and pepper. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Place cucumber, parsley, green onions, 2 tablespoons extra-virgin olive oil, and remaining 2 tablespoons lemon juice in medium bowl; toss to coat. Season with salt and pepper.",
        "Preheat barbecue (medium-high heat). Divide tuna cubes among 6 metal skewers. Brush tuna with olive oil. Sprinkle with salt and pepper, then oregano. Grill tuna until charred on all sides but still pink in centers, about 1 minute per side. Grill pita breads until warmed and charred, about 1 minute per side.",
        "Place 1 pita bread on each of 6 plates. Spoon parsley salad atop pita. Place 1 tuna skewer atop each. Spoon beet tahini over. Garnish with onion rings and lemon wedges and serve."
    ],
    "ingredients": [
        "2 medium red beets (about 2 to 2 1/2 inches in diameter), trimmed, scrubbed",
        "Olive oil for drizzling and brushing",
        "1/4 cup whole-milk plain yogurt",
        "4 tablespoons fresh lemon juice, divided",
        "2 tablespoons tahini (sesame seed paste)*",
        "2 tablespoons cold water",
        "1 cup finely chopped halved and seeded peeled cucumber",
        "1/3 cup (lightly packed) fresh Italian parsley leaves",
        "1/3 cup thinly sliced green onions, green part only",
        "2 tablespoons extra-virgin olive oil",
        "1 3/4 pounds ahi tuna steaks, cut into 3/4-inch cubes",
        "1 teaspoon dried oregano",
        "6 pita breads",
        "1 small red onion, thinly sliced",
        "1 lemon, cut into 6 wedges",
        "*Available at some supermarkets and natural foods stores, and at Middle Eastern markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Herb",
        "Onion",
        "Vegetable",
        "Roast",
        "Yogurt",
        "Grill/Barbecue"
    ],
    "title": "Tuna Souvlaki Gyro with Beet Tahini and Parsley Salad",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-souvlaki-gyro-with-beet-tahini-and-parsley-salad-238189"
}
