{
    "directions": [
        "Place beans in medium bowl. Add enough cold water to cover beans by 3 inches. Let stand overnight. Drain.",
        "Combine beans and stock in large saucepan. Bring to boil. Reduce heat to medium; cover and simmer until beans are just tender, about 1 hour. Drain, reserving 1/2 cup cooking liquid.",
        "Heat 3 tablespoons oil in heavy large skillet over medium heat. Add onion, carrot and celery and sauté until almost tender, about 5 minutes. Add thyme and lemon peel and stir 1 minute. Add beans, reserved 1/2 cup cooking liquid and 2 tablespoons oil and toss until heated through, about 5 minutes. Season to taste with salt and pepper. Remove from heat. Cover to keep warm.",
        "Heat remaining 2 tablespoons oil in another heavy large skillet over medium-high heat. Sprinkle tuna with salt and pepper. Add tuna to skillet and cook to desired doneness, about 3 minutes per side for medium.",
        "Spoon beans onto center of each of 4 plates, dividing equally among plates. Top each with tuna steak. Spoon Sun-dried Tomato Sauce over tuna steaks and serve immediately."
    ],
    "ingredients": [
        "1 cup dried Great Northern beans (about 6 1/2 ounces)",
        "5 cups chicken stock or canned low-salt chicken broth",
        "7 tablespoons olive oil",
        "1/2 cup chopped onion",
        "1/2 cup chopped carrot",
        "1/2 cup chopped celery",
        "5 teaspoons chopped fresh thyme or 2 teaspoons dried",
        "1 tablespoon grated lemon peel",
        "4 6- to 8-ounceahi tuna steaks (each about 3/4 to 1 inch thick)",
        "Sun-dried Tomato Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Fish",
        "Tomato",
        "Sauté",
        "Dinner",
        "Tuna",
        "Legume",
        "Fall",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tuna with White Beans and Sun-Dried Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-with-white-beans-and-sun-dried-tomato-sauce-103890"
}
