{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "In a large mixing bowl, combine tuna fish, mayonnaise, egg, pickles, 2 tablespoons pimentos, and 1 tablespoon chopped green bell pepper. Mix well, and set bowl aside.",
        "Sift together 2 cups flour, baking powder, and salt. Cut in vegetable shortening until mixture resembles coarse crumbs. Stir in 1 cup Cheddar cheese and 2 tablespoons chopped pimento. Add 2/3 cup milk and stir until mixture forms a ball. Knead about 15 times.",
        "Roll out dough 1/4 inch thick. Cut into 3 inch rounds (should be about 20 rounds total). Spoon a tablespoon of the tuna mixture onto the top half of each round (using 10 rounds). Moisten the edges of these 10 rounds with water and place each of the remaining 10 rounds over each tuna-layer round. Press edges together with the tines of a fork and prick the tops to vent the dough. Place on a cookie sheet.",
        "Bake tuna rounds at 450 degrees F (230 degrees C) for 12 to 15 minutes.",
        "To Make Cheese Sauce: In a double-boiler, heat 3 tablespoons butter and add 3 tablespoons chopped bell pepper; cook until softened.  Blend in 3 tablespoons flour, and mix until smooth.  Add 1 1/2 cups milk and cook, stirring constantly, until thickened. Sift in 1 1/2 cups Cheddar cheese, 2 tablespoons chopped pimento and 1/2 teaspoon salt. Continue to cook until cheese has completely melted.",
        "Serve Tuna Wellingtons with the cheese sauce poured over them."
    ],
    "ingredients": [
        "1 egg",
        "1 (6 ounce) can canned tuna",
        "1/4 cup mayonnaise",
        "2 tablespoons diced dill pickles",
        "2 tablespoons chopped pimento",
        "1 tablespoon chopped green bell pepper",
        "2 cups all-purpose flour, sifted",
        "3 teaspoons baking powder",
        "1 teaspoon salt",
        "1/3 cup vegetable shortening",
        "1 cup shredded sharp Cheddar cheese",
        "2 tablespoons chopped pimento",
        "2/3 cup milk",
        "3 tablespoons butter",
        "3 tablespoons diced green bell pepper",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups milk",
        "1 1/2 cups shredded sharp Cheddar cheese",
        "2 tablespoons minced pimento",
        "1/2 teaspoon salt",
        "1 cup shredded sharp Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tuna Wellingtons with Pimento Cheese Sauce",
    "url": "http://allrecipes.com/recipe/17911/tuna-wellingtons-with-pimento-cheese/"
}
