{
    "directions": [
        "For the marinade: Mix together all the marinade ingredients in a medium bowl.",
        "For the skewers: Toss the cubed tuna in the marinade and let sit in the refrigerator for 30 minutes. Bring a medium pot of salted water to a boil over high heat. Add the green onions and cook until tender but still firm to the bite, about 1 to 2 minutes. Transfer the green onions to a medium bowl of ice water. When the green onions are cool, pat dry with paper towels. Trim the stalks and the root end off the fennel. Halve the fennel lengthwise then cut each half into 3 pieces. Cut each lemon into 6 pieces. Cut the red onion in half from stem to root end. Cut each half in half again lengthwise and cut each quarter into thirds. There should be 12 pieces of each vegetable.",
        "Preheat the oven to 400 degrees F.",
        "Remove the tuna and toss the vegetables in the marinade. Thread each skewer starting with a tomato. Then begin to thread the green onion starting with the tip of the white end. Add a piece of tuna. Keeping the ingredients near to the top of the skewer, ribbon the green onion around a piece of tuna and back through the skewer. Next add the red onion, and ribbon the green onion around again and onto the skewer. Next add another piece of tuna, and ribbon the green onion around again and onto the skewer. Next add a piece of fennel, and ribbon the green onion around for the final time. Top with a piece of lemon. Center the ingredients on the skewer.",
        "Place on a baking sheet. Sprinkle both sides with salt and freshly ground black pepper. Bake for 8 to 10 minutes. Serve warm."
    ],
    "ingredients": [
        "3/4 cups extra-virgin olive oil",
        "1 lemon, juiced",
        "1 lemon, zested",
        "2 tablespoons chopped fresh rosemary leaves",
        "1 clove garlic, minced",
        "Skewers:",
        "1 pound tuna, cut into 1-inch cubes, about 24 pieces",
        "12 green onions, trimmed",
        "2 fennel bulbs",
        "2 lemons",
        "1 large red onion",
        "12 cherry tomatoes",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "12 bamboo skewers, soaked in water for 30 minutes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Dinner",
        "Healthy",
        "Healthy Lunch",
        "Lunch",
        "Italian",
        "Vegetable",
        "Fish",
        "Tuna Recipes",
        "Fruit",
        "Lemon Recipes",
        "Appetizer",
        "Low-Fat",
        "Low Calorie",
        "Heart-Healthy",
        "Marinating Recipes"
    ],
    "title": "Tuna Spiedini",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/tuna-spiedini-recipe"
}
