{
    "directions": [
        "1. For the white beans, put the beans in a bowl, cover with cold water, and leave overnight to soak. Drain them and put in a large saucepan with the whole onion, bouquet garni, and enough water to cover by 3/4 inch (2 cm). (Add salt only three-quarters through cooking or the beans will be tough.) Bring to a boil, skimming any foam that collects on the surface. Cover the pan and simmer until the beans are nearly tender, 1 to 3 hours depending on the age and type of bean. Stir occasionally as they cook and add more water so at the end of cooking the beans are moist and soupy but not swimming in liquid.",
        "2. Just before the beans are tender, heat the oil in a pan, add the chopped onion, and fry until soft but not brown. Stir in the garlic, salt, and pepper and continue cooking 1 minute. Stir this mixture into the beans. When the beans are very tender, discard the whole onion and bouquet garni. Taste and adjust the seasoning. You can cook the beans up to 3 days ahead, storing them in the refrigerator. If you cook the beans ahead, then only the tuna steaks need be sautéed at dinnertime.",
        "3. For the steaks, heat the oil in a skillet. Sprinkle the fish with salt and pepper and sauté over quite high heat about 2 minutes. Turn and brown the other side, allowing 1 to 2 minutes if you like your tuna rare, or 3 to 4 minutes if you prefer it well done. Transfer the steaks to individual plates and keep warm.",
        "4. Allow the pan to cool somewhat before adding the shallots, and sauté, stirring, for 1 minute. Stir in the garlic and cook 1 minute more. Add the wine and boil rapidly until it is reduced by about half. Stir in the chopped herbs and taste for seasoning. Spoon the sauce over the tuna, pile the beans beside the steaks, and serve.",
        "I must confess that I often resort to ready-cooked canned beans, preferably cannellini. Just add the onion and garlic, with plenty of chopped thyme as a personal note."
    ],
    "ingredients": [
        "4 tuna steaks (about 150 g/5 oz each)",
        "2 tablespoons olive oil",
        "2 shallots, chopped",
        "1 garlic clove, chopped",
        "1 cup (250 ml/8 fl oz) any red wine",
        "3 to 4 sprigs of mixed fresh herbs (see above)",
        "salt and pepper",
        "1 1/2 cups (250g/1/2 lb) dried white kidney beans",
        "1 onion, peeled and stuck with a clove",
        "a bouquet garni made with parsley stems, a bay leaf, and generous amounts of thyme",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "4 garlic cloves, chopped",
        "salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Fish",
        "Garlic",
        "Sauté",
        "Dinner",
        "Tuna",
        "Red Wine",
        "Fall",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tuna Steak Marchand de Vin",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-steak-marchand-de-vin-105464"
}
