{
    "directions": [
        "Preheat the oven to 400 degrees F. Bring a large pot of salted water to a boil. Add the noodles and cook as the label directs. Reserve 1/2 cup cooking water, then drain the noodles and return to the pot.",
        "Meanwhile, melt 1 tablespoon butter in a large skillet over medium-high heat. Add the scallion whites and sliced celery. Cook, stirring occasionally, until softened, 2 minutes. Add the evaporated milk, 1/2 teaspoon salt and a few grinds of pepper. Stir in the peas and carrots and the mustard. Bring to a boil, then reduce the heat to medium low. Cook, stirring occasionally, until slightly thickened, 2 to 3 minutes.",
        "Pour the sauce over the noodles; stir in the sour cream, 1/2 cup cheese, the tuna and reserved cooking water. Transfer to a 1 1/2-quart baking dish.",
        "Melt the remaining 1 tablespoon butter. Toss with the panko, scallion greens, celery leaves and remaining 1/4 cup cheese; season with salt and pepper. Sprinkle over the casserole. Bake until golden, 15 to 20 minutes."
    ],
    "ingredients": [
        "Kosher salt",
        "6 ounces wide egg noodles",
        "2 tablespoons unsalted butter",
        "6 scallions (white parts sliced, green parts finely chopped)",
        "3 stalks celery, thinly sliced, plus 2 tablespoons chopped leaves",
        "1 12-ounce can fat-free evaporated milk",
        "Freshly ground pepper",
        "1 cup frozen peas and carrots",
        "1 tablespoon dijon mustard",
        "1/2 cup light sour cream",
        "3/4 cup shredded low-fat monterey jack cheese (about 3 ounces)",
        "1 5-ounce can water-packed tuna, drained and flaked",
        "1/4 cup panko breadcrumbs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Casserole",
        "Fish",
        "Tuna Recipes"
    ],
    "title": "Tuna Noodle Casserole",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/tuna-noodle-casserole"
}
