{
    "directions": [
        "Puree first 5 ingredients in blender until smooth. With machine running, gradually add vegetable oil, then olive oil. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Cook asparagus in large skillet of boiling salted water until just tender, 4 to 5 minutes. Transfer asparagus to 13x9x2-inch pan of ice water to cool. Drain asparagus and pat dry. DO AHEAD: Can be made 8 hours ahead. Wrap in paper towels, then plastic, and chill.",
        "Place potatoes in large saucepan. Add enough water to cover potatoes by 1 inch. Sprinkle with salt. Bring to boil and cook until potatoes are tender, 10 to 15 minutes, depending on size of potatoes. Drain; let cool 5 minutes. Place in medium bowl. Add 1/4 cup vinaigrette; toss to coat. Season to taste with salt and pepper.",
        "Heat olive oil in small skillet over medium-high heat. Add capers and fry until capers are crisp and open like flowers, stirring often, 45 to 60 seconds. Using slotted spoon, transfer capers to paper towels to drain. DO AHEAD: Potatoes and capers can be made 2 hours ahead. Let stand at room temperature.",
        "Place asparagus in large bowl. Add 2 tablespoons vinaigrette and toss to coat. Toss potatoes again to coat, adding 1 more tablespoon vinaigrette if dry. Place greens and radishes in another large bowl. Toss with enough vinaigrette to coat. Spread greens and radishes over large platter. Arrange potatoes, asparagus, eggs, and tuna atop greens. Drizzle some vinaigrette over tuna. Sprinkle with fried capers and chive blossoms, if desired."
    ],
    "ingredients": [
        "1/3 cup chopped fresh chives",
        "1/4 cup Champagne vinegar",
        "1 small shallot, coarsely chopped",
        "1 teaspoon honey",
        "1 teaspoon Dijon mustard",
        "2/3 cup vegetable oil",
        "1/3 cup extra-virgin olive oil",
        "1 1/2 pounds thick asparagus, stems peeled",
        "1 1/4 pounds baby red potatoes, halved or quartered",
        "1/3 cup olive oil",
        "1/2 cup capers, drained, patted dry",
        "8 ounces mixed spring greens",
        "16 large radishes, trimmed, very thinly sliced (about 3 cups)",
        "3 large hard-boiled eggs, peeled, quartered",
        "12 ounces imported tuna packed in oil, drained",
        "Chive blossoms (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "High Fiber",
        "Lunch",
        "Tuna",
        "Asparagus",
        "Radish",
        "Spring",
        "Chive",
        "Capers",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tuna, Asparagus, and New Potato Salad with Chive Vinaigrette and Fried Capers",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-asparagus-and-new-potato-salad-with-chive-vinaigrette-and-fried-capers-352094"
}
