{
    "directions": [
        "Combine vinegar and mustard in small bowl; whisk in 4 tablespoons olive oil. Season dressing to taste with sea salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Place 1 sheet of plastic wrap on damp work surface (to prevent plastic from slipping). Arrange 1/4 of tuna squares 1 inch apart in circle on plastic. Cover with second sheet of plastic. Using flat side of mallet, gently pound tuna squares until they are very thin and form an 8- to 9-inch solid round. Place tuna round, still in plastic, on plate. Form 3 more rounds with remaining tuna. Refrigerate tuna carpaccio at least 30 minutes and up to 4 hours.",
        "Peel 1 plastic sheet from each tuna carpaccio round; invert onto plates and peel off remaining plastic. Brush each with 1 tablespoon olive oil, then sprinkle with lemon juice, chives, shallot, sea salt, and pepper. Toss watercress and 2 tablespoons dressing in medium bowl; season to taste with sea salt and pepper. Mound watercress atop and serve."
    ],
    "ingredients": [
        "2 tablespoons balsamic vinegar",
        "1/4 teaspoon Dijon mustard",
        "8 tablespoons extra-virgin olive oil, divided",
        "Fine sea salt",
        "1 pound sushi-grade ahi tuna steaks, cut into 1-inch squares",
        "4 teaspoons fresh lemon juice",
        "2 teaspoons thinly sliced fresh chives",
        "1 teaspoon minced shallot",
        "2 cups (loosely packed) watercress sprigs (about 2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Leafy Green",
        "Herb",
        "Mustard",
        "Appetizer",
        "Freeze/Chill",
        "No-Cook",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tuna Carpaccio with Watercress Salad and Balsamic Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-carpaccio-with-watercress-salad-and-balsamic-dressing-235832"
}
