{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place 1 tablespoon butter in a non-stick skillet and add onions. Cook over low heat for thirty minutes until onions develop a light brown color.",
        "While onions are cooking, on a lightly floured piece of parchment paper, unfold 1 sheet of pastry and roll into a rectangle, about 10 inches by 12 inches and place on a baking sheet. Lightly brush the entire pastry rectangle with beaten egg.",
        "Unfold the other sheet of pastry and cut four 1 inch strips from the longest side. Place each strip along each edge of egg-washed pastry, forming a thicker edge. Discard unused pastry. Lightly brush strips with beaten egg.  Reserve remaining egg. Pierce pastry inside formed edges several times with a fork.",
        "Place pastry in the pre-heated oven and bake for 8 minutes, rotate pan and continue baking for another 8 minutes. Remove pastry from oven and allow to cool slightly.",
        "In a separate pan, melt 1 tablespoon of butter, add mushrooms, wine, salt and pepper, and cook over medium heat until the mushrooms are tender and most of the liquid is absorbed.",
        "While mushrooms are cooking, whisk together the remaining beaten egg, herb cheese and cream until smooth. Carefully spread cheese mixture over pastry. Distribute onions, mushrooms, artichokes and tuna evenly over the cheese mixture.",
        "Return to the oven and bake 20 minutes, or until the crust is brown and the cheese mixture is set.",
        "Remove from the oven and sprinkle either snipped parsley or snipped chives.  Cut into 9 equal pieces and serve."
    ],
    "ingredients": [
        "1 cup thinly sliced onions",
        "2 tablespoons butter, divided",
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "1 tablespoon all-purpose flour for dusting",
        "1 egg, beaten",
        "1 cup button mushrooms, quartered",
        "2 tablespoons red wine",
        "Salt and black pepper to taste",
        "1 (5.2 ounce) package herb and garlic-flavored cream cheese",
        "2 tablespoons heavy cream",
        "1 (5 ounce) can Bumble Bee® Solid White Albacore Tuna in Water",
        "1 (7.5 ounce) jar marinated artichoke hearts, drained and chopped",
        "Chopped fresh parsley (optional)",
        "Chopped fresh chives (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tuna Tart with Mushrooms and Artichokes",
    "url": "http://allrecipes.com/recipe/247014/tuna-tart-with-mushrooms-and-artichok/"
}
