{
    "directions": [
        "Melt 4 tablespoons butter in heavy medium saucepan over medium heat. Add flour and stir 2 minutes. Gradually whisk in milk. Stir over medium heat until sauce thickens, about 5 minutes. Remove from heat.",
        "Melt 1 tablespoon butter in medium skillet over medium-high heat. Add all mushrooms, green onions and celery. Sauté until mushrooms are tender, about 5 minutes. Stir in rosemary and thyme. Stir mushroom mixture into sauce.",
        "Preheat oven to 350°F. Butter 8-inch square glass baking dish. Cook noodles in large pot of boiling salted water until tender but still firm to bite. Drain. Rinse under cold water. Drain well. Place tuna in large bowl. Using fork, flake tuna into bite-size pieces. Add noodles and sauce. Toss to coat. Season with salt and pepper. Transfer mixture to prepared dish. (Can be made 1 day ahead. Cover; chill.)",
        "Melt remaining 4 tablespoons butter in heavy medium skillet over medium heat. Add breadcrumbs and stir until golden brown, about 10 minutes. Sprinkle breadcrumbs over casserole. Bake until casserole bubbles around edges, about 30 minutes. Serve hot."
    ],
    "ingredients": [
        "9 tablespoons butter",
        "1/4 cup all purpose flour",
        "2 1/2 cups milk (do not use low-fat or nonfat)",
        "1 cup sliced stemmed fresh shiitake mushrooms (about 2 ounces)",
        "1 cup sliced trimmed button mushrooms (about 2 ounces)",
        "1/2 cup chopped green onions",
        "1/4 cup chopped celery",
        "1 tablespoon chopped fresh rosemary or 1 teaspoon dried",
        "1 tablespoon chopped fresh thyme or 1 teaspoon dried",
        "8 ounces egg noodles",
        "1 12 1/4-ounce can tuna packed in water, drained well",
        "1 1/2 cups fresh white breadcrumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Pasta",
        "Bake",
        "Kid-Friendly",
        "Casserole/Gratin",
        "Tuna",
        "Winter",
        "Potluck",
        "Oregon"
    ],
    "title": "Tuna Noodle Casserole with Mushrooms and Fresh Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-noodle-casserole-with-mushrooms-and-fresh-herbs-980"
}
