{
    "directions": [
        "Bring 3 cups water and piloncillo to boil in medium saucepan. Add white vinegar, canela, and salt; simmer until piloncillo has dissolved, stirring often, about 1 minute. Remove from heat. Add chiles and soak until softened, occasionally pressing to submerge, about 1 hour; drain. Pat chiles dry; slit lengthwise and remove seeds.",
        "Cook red-skinned potatoes in pot of boiling salted water until skewer easily pierces centers, about 35 minutes. Drain. Cool, peel, and cut potatoes into 1-inch cubes.",
        "Prepare barbecue (medium-high heat). Season tuna with salt. Grill until light brown at edges but pink in center, about 3 minutes per side. Cut tuna into 1-inch cubes. Whisk together 1/4 cup oil and next 5 ingredients in large bowl. Fold in potatoes and tuna. Season with salt. Fill chiles with tuna-potato mixture.",
        "Whisk remaining 1/4 cup oil, apple cider vinegar, and cilantro in medium bowl. Season with salt. In large bowl, toss greens with 2 tablespoons vinaigrette to coat. Divide salad among plates. Top with chiles and avocado slices; drizzle with some of remaining vinaigrette.",
        "*Mexican raw sugar shaped into hard cones. Smaller chunks are sometimes labeled panocha. If neither is available, substitute and equal weight of packed dark brown sugar.",
        "**Mexican cinnamon sticks with a delicate, floral flavor."
    ],
    "ingredients": [
        "3 cups water",
        "9 ounces piloncillo*",
        "1 cup distilled white vinegar",
        "1 2-inch piece canela** or cinnamon stick",
        "1/4 teaspoon salt",
        "6 large ancho chiles",
        "1 pound red-skinned potatoes",
        "1 pound 1-inch-thick ahi tuna steaks",
        "1/2 cup olive oil",
        "1/4 cup chopped white onion",
        "3 tablespoons chopped fresh parsley",
        "2 tablespoons whipping cream",
        "2 tablespoons mayonnaise",
        "1 tablespoon fresh lime juice",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon chopped fresh cilantro",
        "4 ounces mixed baby greens",
        "1 large avocado, halved, pitted, peeled, cut into 12 slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Potato",
        "Backyard BBQ",
        "Tuna",
        "Avocado",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Cinnamon",
        "Lettuce"
    ],
    "title": "Tuna- and Potato-Stuffed Ancho Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-and-potato-stuffed-ancho-chiles-108047"
}
