{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Roll out puff pastry on floured work surface to 11-inch square. Using 4 1/2-inch bowl as guide, cut out 4 rounds from pastry. Transfer pastry to large ungreased baking sheet, spacing apart. Place another baking sheet atop pastry rounds to weigh down slightly. Bake until pastry is golden brown and baked through, about 20 minutes. Uncover pastry and cool completely. DO AHEAD: Pastry can be made 6 hours ahead. Let stand at room temperature.",
        "Preheat oven to 400°F. Heat 2 teaspoons olive oil in medium nonstick skillet over medium heat. Add green onions; sauté until soft but not brown, about 2 minutes. Remove from heat. Divide green onions among pastry rounds. Brush tuna lightly with olive oil; sprinkle with salt and pepper. Alternate 3 tuna slices, 3 mozzarella slices, and 3 basil leaves in concentric circles, slightly overlapping, atop green onions on each pastry round. Scatter tomatoes, olives, and radish slices over each. Sprinkle each with ginger and drizzle with olive oil. Bake just until tuna is opaque around edges but still translucent in center, about 3 minutes. Transfer to plates."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "2 teaspoons extra-virgin olive oil plus additional for brushing and drizzling",
        "4 large green onions, chopped",
        "1 8-ounce ahi tuna steak, cut crosswise into twelve 1/4-inch-thick slices",
        "1/2 8-ounce ball fresh mozzarella cheese, cut into 12 thin slices, drained on several layers of paper towels",
        "12 large fresh basil leaves",
        "4 cherry tomatoes, quartered",
        "4 Kalamata olives, pitted, quartered",
        "2 radishes, thinly sliced",
        "1 teaspoon minced peeled fresh ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Mozzarella",
        "Basil",
        "Tuna",
        "Summer",
        "Healthy",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tuna, Fresh Mozzarella, and Basil Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-fresh-mozzarella-and-basil-pizza-242120"
}
