{
    "directions": [
        "Butter 8 x 8 x 2-inch glass baking dish. Melt unsalted butter in heavy large saucepan over medium heat. Add leeks and celery seeds to saucepan; sprinkle lightly with coarse kosher salt. Cover saucepan and cook until leeks are tender but not brown, stirring often, about 8 minutes. Add flour; stir 1 minute. Gradually add milk and half and half; simmer until mixture thickens slightly, stirring often, about 5 minutes. Stir in lemon juice. Season leek sauce to taste with coarse kosher salt and pepper. Remove sauce from heat.",
        "Meanwhile, cook egg noodles in large pot of boiling salted water until tender, stirring occasionally. Drain noodles, reserving 3/4 cup noodle cooking liquid. Transfer noodles to large bowl. Pour leek sauce over noodles. Add grated Gruyère cheese and dill and stir to blend; add reserved noodle cooking liquid by tablespoons until mixture is moist and creamy (about 8 tablespoons). Fold in tuna. Transfer to prepared baking dish. DO AHEAD: Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover with foil and keep refrigerated.",
        "Preheat oven to 375°F. Bake noodle casserole, covered with foil, until heated through, about 20 minutes if freshly made or 30 minutes if chilled. Remove foil. Sprinkle crushed potato chips over and continue to bake, uncovered, until top is golden brown and filling bubbles, about 10 minutes longer. Serve hot."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "2 1/2 cups thinly sliced leeks (white and pale green parts only; from about 2 large)",
        "1/4 teaspoon celery seeds",
        "Coarse kosher salt",
        "1/4 cup all purpose flour",
        "2 cups whole milk",
        "1/2 cup half and half",
        "1 teaspoon fresh lemon juice",
        "8 ounces wide egg noodles",
        "1/2 cup coarsely grated Gruyère cheese (about 2 1/2 ounces)",
        "2 tablespoons chopped fresh dill",
        "2 5- to 6-ounce cans albacore tuna (preferably packed in olive oil), drained, broken into 1/2-inch chunks",
        "2 cups coarsely crushed salted potato chips (about 2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pasta",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Tuna",
        "Leek",
        "Family Reunion",
        "Potluck",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tuna Noodle Casserole with Leeks and Fresh Dill",
    "url": "http://www.epicurious.com/recipes/food/views/tuna-noodle-casserole-with-leeks-and-fresh-dill-357514"
}
