{
    "directions": [
        "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).",
        "Beat the egg into a shallow bowl with a tablespoon of water. Place the bread crumbs in a shallow bowl. Dip the fish pieces into the beaten egg and then into the crumbs until well coated. Fry the catfish nuggets in batches, about 1 minute on each side. Drain on paper towels and set aside.",
        "Heat the olive oil in a skillet or Dutch oven over medium heat. Stir in the onion and bell pepper strips; cook and stir until the onion has softened and turned translucent, about 5 minutes.",
        "Coarsely crush the anise seed. Add the anise seed, tomato paste, and chopped tomatoes to the skillet and cook, stirring frequently, until the tomato paste has darkened and the tomatoes have softened, about 5 minutes.",
        "Chop the lemon wedge, peel and all, into five pieces. Stir the lemon wedge and crushed garlic into the tomato mixture and cook for 1 minute more. Mix in 1 cup water, salt and pepper, cayenne pepper, brown sugar, and olives. Bring the sauce to a boil and simmer for 20 minutes. Stir in more water if the sauce gets too thick. Gently stir in the catfish nuggets, and simmer for an additional 10 minutes."
    ],
    "ingredients": [
        "vegetable oil for frying",
        "1 pound catfish, cut into bite-sized pieces",
        "1 egg",
        "1 tablespoon water",
        "2 cups dry bread crumbs",
        "1/4 cup olive oil",
        "1 onion, halved and sliced",
        "1/2 green bell pepper, cut into 1/4 inch strips",
        "1/2 teaspoon anise seed",
        "3 tablespoons tomato paste",
        "2 roma (plum) tomatoes, chopped",
        "1 lemon wedge",
        "1 clove garlic, crushed",
        "1 cup water",
        "salt and pepper to taste",
        "1 pinch cayenne pepper (optional)",
        "1 teaspoon brown sugar",
        "1/2 cup olives",
        "1 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Tunisian-Style Catfish Nuggets",
    "url": "http://allrecipes.com/recipe/215279/tunisian-style-catfish-nuggets/"
}
