{
    "directions": [
        "Bring 4 quarts lightly salted water to a boil in a large pot.",
        "Between two sheets of plastic wrap, pound turkey breast pieces to an even 1/4-inch thickness with a meat mallet. If you don't have a meat mallet, the back of a frying pan will work fine. You can do this a day ahead and leave them stored in the plastic wrap, folded over on each other. You can also ask a good butcher to cut and pound the turkey for you.",
        "Heat olive oil in a large saute pan over medium-high heat. Lightly coat the turkey pieces with flour, and pat off the excess; dip in beaten eggs and then dredge in bread crumbs.  When oil is hot an bubbling, add turkey pieces. Do not crowd the pan. Let brown 2-3 minutes, then turn to cook the second side, another 30 seconds to 1 minute. The turkey will cook very quickly and will dry out if overcooked. When done, remove to a baking sheet or platter and keep warm. Do not wash saute pan!",
        "To make the sauce, add butter to saute pan and place over medium-high heat. At the same time, drop ravioli into the boiling water. When butter begins to turn light brown, add fresh sage. Stir for a few seconds; then add cranberries, and saute until skins begin to burst. Add molasses, balsamic vinegar, and broth, scraping bottom of the pan to pick up all the flavor of the turkey. Simmer until cranberries are soft and the sauce coats the back of a spoon, about 12-15 minutes. Season to taste with salt and pepper. Be sure to taste sauce for seasoning before you pour it over the turkey!",
        "Test ravioli for doneness in about 3 minutes--pinch edges of dough; it should be tender. Drain. Arrange 1/4 of the raviolis per person on hot plates and layer a piece of turkey over the ravioli. Spoon sauce over them."
    ],
    "ingredients": [
        "8 (4 ounce) portions boneless turkey breast",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup all-purpose flour",
        "2 eggs, beaten",
        "2 cups Progresso® plain Panko crispy bread crumbs",
        "8 tablespoons unsalted butter",
        "1 (18 ounce) package frozen squash ravioli",
        "1/4 cup chopped fresh sage",
        "1 1/2 cups fresh cranberries",
        "3 tablespoons dark molasses",
        "1/4 cup balsamic vinegar",
        "1 cup Progresso® chicken broth or reduced-sodium chicken broth",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Scallopini and Squash Ravioli with Cranberry Brown Butter",
    "url": "http://allrecipes.com/recipe/215607/turkey-scallopini-and-squash-ravioli/"
}
