{
    "directions": [
        "Heat 1 tablespoon of olive oil and butter in a skillet over medium-low heat, and stir in the shiitake mushroom, shallot, salt, red pepper flakes, and sage. Cook and stir until the shallot is translucent, about 5 minutes. Mix in the turkey and vermouth, and stir for a minute or two just to heat; remove from heat.",
        "Beat the eggs with a fork in a bowl until well blended, and season with a pinch of salt and white pepper. Heat 2 teaspoons of olive oil in an omelette pan over medium heat until hot, and pour the beaten eggs into the pan. Use a spatula to gently stir the eggs just until they begin to set, 1 to 2 minutes; shake the pan to cover the bottom completely with egg. Smooth out the top of the partially set eggs with the spatula, cook just until the bottom is firm and the top is still slightly soft, and turn off the heat.",
        "Spoon turkey filling into the center of the omelette, filling about the middle third of the omelette; dot with small dollops of creme fraiche. Do not overfill omelet. With spatula, fold the upper third of the egg over the filling, and gently tip the skillet and shake the omelette towards the edge of the skillet. With spatula, fold the omelet over one more time, forming a loose cigar shape, and gently tip the omelet onto a serving plate."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "2 teaspoons unsalted butter",
        "1 tablespoon chopped fresh shiitake mushroom",
        "1 shallot, finely chopped",
        "1/4 teaspoon salt",
        "1 fresh sage leaf, minced",
        "1/4 teaspoon crushed red pepper flakes",
        "1/4 cup shredded cooked turkey",
        "1 teaspoon dry vermouth (optional)",
        "2 eggs, chilled",
        "1 pinch ground white pepper",
        "2 teaspoons olive oil",
        "1 tablespoon creme fraiche"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Filled Omelette",
    "url": "http://allrecipes.com/recipe/218298/turkey-filled-omelette/"
}
