{
    "directions": [
        "Bring stock to a simmer in a medium pot over medium heat. Reduce heat to low. Cover and keep warm.",
        "Meanwhile, melt 3 tablespoons butter in a large pot over medium heat until it begins to foam. Add onion. Sauté, stirring occasionally, until onion is soft and translucent and just beginning to turn golden, about 5 minutes.",
        "Add mushrooms; cook, stirring occasionally, until soft, and any liquid released has evaporated, 5-7 minutes.",
        "Add rice; stir to coat. Add 1/2 cup warm stock and stir constantly until liquid is absorbed. Continue adding stock by 1/2-cupfuls, stirring constantly, until rice is tender but still firm to the bite, about 20 minutes. Add leftover turkey meat, if using; stir to combine and to warm through, adding a little stock or water if necessary to keep mixture creamy, about 3 minutes.",
        "Stir Parmesan and remaining 1 tablespoons butter into risotto. Season to taste with salt and pepper. Divide among warm bowls. Garnish with chopped parsley."
    ],
    "ingredients": [
        "8 cups Day-After Turkey Stock",
        "4 tablespoons (1/2 stick) unsalted butter, divided",
        "1 small yellow onion, thinly sliced",
        "2 cups assorted fresh mushrooms (preferably wild, but white buttons will do), thinly sliced",
        "2 cups arborio or carnaroli rice",
        "1 cup shredded leftover turkey meat (optional)",
        "1/2 cup shredded Parmesan",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons finely chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Rice",
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Lunch",
        "Parmesan",
        "Fall",
        "Simmer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Turkey and Mushroom Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-and-mushroom-risotto-51122690"
}
