{
    "directions": [
        "Bring turkey, onion, ginger, cinnamon, star anise, and 14 cups cold water to a boil in a large heavy pot. Reduce heat and simmer gently, turning turkey over halfway through, until liquid is reduced to 8 cups, 50–65 minutes. Discard carcass; strain stock through a fine-mesh sieve into a medium saucepan.",
        "Add rice to stock and bring to a boil. Reduce heat and simmer, stirring occasionally, until soup begins to thicken, 35–45 minutes (make sure to stir the bottom of pot to prevent rice from sticking). Continue to cook, stirring constantly, until rice begins to break into smaller pieces and mixture resembles the consistency of oatmeal, 10–15 minutes longer; season congee with salt.",
        "Meanwhile, heat oil in a large nonstick skillet over medium-high. Cook mushrooms, tossing occasionally, until browned and crisp, 6–8 minutes. Remove from heat and add soy sauce; season generously with pepper.",
        "Divide congee among bowls. Top with crispy mushrooms and cilantro and drizzle with chili oil."
    ],
    "ingredients": [
        "1 (3–4-pound) turkey carcass",
        "1 medium onion, unpeeled, quartered",
        "1 (2-inch) piece ginger, peeled, thinly sliced",
        "1 (2-inch) piece cinnamon, whacked into pieces",
        "1 star anise pod",
        "1/2 cup long-grain rice, rinsed well",
        "Kosher salt",
        "3 tablespoons vegetable oil",
        "6 ounces shiitake mushrooms, stems removed, thinly sliced",
        "1 tablespoon soy sauce",
        "Freshly ground black pepper",
        "Cilantro leaves with tender stems and chili oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "leftovers",
        "Thanksgiving",
        "Rice",
        "Ginger",
        "Anise",
        "Mushroom",
        "Dinner"
    ],
    "title": "Turkey Congee With Crispy Shiitake Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-congee-with-crispy-shiitake-mushrooms"
}
