{
    "directions": [
        "Char poblanos directly over gas flame or in broiler until blackened on all sides. Enclose in plastic bag; let stand 10 minutes. Peel, seed, and chop poblanos.",
        "Heat oil in large pot over medium heat. Add chorizo; sauté until cooked through, breaking up with back of fork, about 5 minutes. Add onions and garlic. Cover and cook 10 minutes. Mix in chili powder and cumin. Sprinkle turkey with salt and pepper. Add to pot and stir. Add broth and next 5 ingredients. Mix in roasted poblanos. Bring chili to boil, stirring occasionally. Reduce heat to medium-low; simmer uncovered until turkey is tender, about 45 minutes. Season chili with more lime juice, if desired, and salt and pepper. (Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm before serving.)",
        "*Fresh dark green chiles, often called pasillas. Available at Latin American markets and some supermarkets.",
        "**Green tomato-like vegetables with paper-thin husks. Available at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "1 1/2 pounds poblano chiles*",
        "2 tablespoons olive oil",
        "1/2 pound pork, chicken, or turkey chorizo sausages, casings removed",
        "3 cups chopped onions",
        "6 large garlic cloves, chopped",
        "2 tablespoons chili powder",
        "1 teaspoon ground cumin",
        "5 pounds turkey thighs with bones, skinned, boned, meat cut into 1-inch cubes",
        "2 cups low-salt chicken broth",
        "12 ounces fresh tomatillos,** husked, rinsed, chopped",
        "1 cup drained canned diced tomatoes",
        "1/2 cup chopped fresh cilantro stems",
        "2 tablespoons (or more) fresh lime juice",
        "1 tablespoon chopped jalapeño chile with seeds (about 1 small)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Poultry",
        "Tomato",
        "turkey",
        "Sauté",
        "Stew",
        "Super Bowl",
        "Sausage",
        "Fall",
        "Winter",
        "Poker/Game Night",
        "Tomatillo",
        "Jalapeño",
        "Potluck",
        "Simmer"
    ],
    "title": "Turkey Green Chili",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-green-chili-109176"
}
