{
    "directions": [
        "Pull about 2 cups of meat off the turkey carcass and reserve for the soup. Using a large chef's knife, chop the turkey carcass into small fist-size pieces. Transfer to a large pot and add the country ham, onion, carrots, daikon radish, garlic, ginger, and lemon halves. Add enough water to cover the ingredients by 1 inch and bring to a boil, skimming off any foam that rises to the top. Lower the heat to moderately low and let the stock simmer, adjusting the heat as necessary to maintain a very gentle simmer, until richly aromatic, about 4 hours. Let the stock cool slightly then pour through a fine-mesh sieve into a large bowl, discarding solids. Measure 8 cups of stock for the ramen bowls and reserve the rest for later use. DO AHEAD: The turkey stock can be prepared ahead and kept, covered in the refrigerator, up to 4 days, or frozen, in an airtight container, up to 3 months.",
        "Fill a medium bowl with cold water.",
        "Bring a small saucepan of water to a boil. Using a slotted spoon, gently lower the eggs, 1 at a time, into the boiling water. Make sure the water returns to a boil then cook the eggs for 7 minutes. Using a slotted spoon, transfer the eggs to the bowl of cold water. Once the eggs are cool enough to handle, with the back of a knife, gently tap on the shell to crack it. Carefully peel the eggs then cut them in half and set aside.",
        "While the eggs are boiling, in a large pot, bring 8 cups of the turkey stock to a boil. Add the miso, fish sauce, soy sauce, vinegar, and hot sauce and stir to combine. Add the ramen noodles, discarding the flavor packet if using packaged ramen soup, and boil until tender but still firm, about 3 minutes.",
        "Divide the ramen noodles and broth evenly into 4 bowls. Into each bowl, evenly divide the tofu, mushrooms, avocado, scallions, watercress, turkey, and soft-boiled egg halves. Garnish with freshly grated Parmesan then squeeze a few drops of lemon juice over the bowls and serve immediately. Mix everything together and let the broth warm all the ingredients before eating."
    ],
    "ingredients": [
        "Carcass from 1 (12- to 14-pound) turkey, including skin, or 2 rotisserie chicken carcasses",
        "1 pound bone-in country ham steak or prosciutto, diced",
        "1 large onion, diced",
        "2 medium carrots, peeled and diced",
        "1 (6-inch) daikon radish, peeled and diced",
        "5 cloves garlic, peeled",
        "1 (2-inch) knob ginger, peeled and sliced",
        "1 lemon, cut in half",
        "About 1 gallon water",
        "2 large eggs",
        "2 tablespoons red miso",
        "1 tablespoon fish sauce",
        "2 1/2 teaspoons soy sauce",
        "2 teaspoons white distilled vinegar",
        "A few dashes of hot sauce",
        "12 ounces ramen noodles (from 4 packages ramen soup) or thin spaghettini",
        "10 ounces soft tofu, drained and diced (about 1 1/3 cup total)",
        "6 ounces shiitake mushrooms, trimmed and thinly sliced",
        "1 avocado, peeled, pitted, and thinly sliced",
        "2 scallions, chopped",
        "1 bunch fresh watercress (thin stems and leaves only)",
        "2 cups pulled cooked turkey or chicken (from the carcass used for stock)",
        "3/4 ounce Parmesan cheese, freshly grated (about 1/4 cup total)",
        "About 1 teaspoon freshly squeezed lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Lunch",
        "Tofu",
        "Noodle",
        "Watercress",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Turkey Ramen",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-ramen-51197040"
}
