{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cook shallot in oil with salt and pepper in an 8-inch skillet over moderate heat, stirring occasionally, until golden, 2 to 3 minutes, then transfer to a bowl. Add turkey and mix gently but thoroughly.",
        "Turn out turkey mixture onto a sheet of wax paper and divide into 8 equal mounds. Pat 1 mound into a 4-inch patty and top with 1 piece of cheese, then put a second mound on top, patting it onto other patty to enclose cheese. Pinch edges together to seal and shape into a single patty. Make 3 more burgers in same manner.",
        "Heat an oiled well-seasoned ridged grill pan over moderately high heat until hot but not smoking, then grill burgers, turning over once, until just cooked through (no longer pink), 8 to 9 minutes total.",
        "While burgers are cooking, heat rolls on a baking sheet in oven until crusty, about 5 minutes. Transfer rolls to a rack to cool slightly.",
        "Purée tomatoes with water, vinegar, and salt in a blender or mini food processor, scraping down sides as necessary, then blend in mayonnaise.",
        "Cut rolls in half horizontally (if necessary) and spread cut sides with tomato mayonnaise. Serve burgers on rolls with lettuce."
    ],
    "ingredients": [
        "1 large shallot, finely chopped (1/4 cup)",
        "2 tablespoons olive oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 1/2 pounds ground turkey (not labeled \"all breast meat\")",
        "5 ounces extra-sharp Cheddar, cut into 4 (1/2-inch-thick) slices",
        "4 hamburger or kaiser rolls",
        "1/4 cup oil-packed sun-dried tomatoes, drained",
        "1 tablespoon water",
        "2 teaspoons cider vinegar",
        "1/4 teaspoon salt",
        "1/4 cup mayonnaise",
        "Accompaniment: lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Tomato",
        "turkey",
        "Kid-Friendly",
        "Quick & Easy",
        "Backyard BBQ",
        "Lunch",
        "Mayonnaise",
        "Cheddar",
        "Grill/Barbecue",
        "Pan-Fry",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Turkey Cheddar Burgers",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-cheddar-burgers-109321"
}
