{
    "directions": [
        "Heat the oven to 350 degrees F. Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, about 7 minutes or according to package instructions. Drain in a colander. Toss with tongs to loosen and separate the strands and place in a large bowl.",
        "Butter a large casserole dish. Set aside. Melt 1 tablespoon of the butter and combine in a small bowl with the breadcrumbs, 1/2 cup of the Parmesan and the parsley. Set aside.",
        "Heat the remaining 2 tablespoons of butter in the now-empty pasta pot. Add the mushrooms and saute until soft and all the liquid in the pan has evaporated, about 5 minutes. Add the onion and cook until translucent, 3 to 5 minutes more. Add the thyme and nutmeg. Taste and adjust the seasoning with salt and pepper.",
        "Add the flour and stir to combine and coat, about 1 minute. Add the wine, increase heat to high and bring to a boil. Cook until the liquid is reduced, about 1 minute. Add the stock and optional cream and stir to combine. Reduce the heat to simmer and cook until the liquid is thick enough to coat the back of a spoon, about 3 minutes. Add the remaining 1/2 cup of Parmesan and stir until combined. Taste and adjust the seasoning with salt and pepper.",
        "Pour the mushroom mixture into the bowl with the cooked spaghetti. Add the turkey and peas and stir to combine. Taste and adjust the seasoning with salt and pepper.",
        "While still hot, pour the mixture into the buttered casserole dish, sprinkle with the reserved breadcrumb mixture and bake until bubbly and the top is golden brown, about 15 minutes. Remove to a rack to cool slightly before slicing. Serve on warmed plates."
    ],
    "ingredients": [
        "1 pound thin spaghetti",
        "3 tablespoons unsalted butter, plus more for the casserole dish",
        "1 cup fresh, plain or whole wheat panko breadcrumbs",
        "1 cup freshly grated Parmigiano-Reggiano cheese (4 ounces)",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1 pound mushrooms, sliced",
        "1 onion, chopped",
        "1 tablespoon chopped fresh thyme leaves",
        "1/4 teaspoon freshly grated nutmeg",
        "Coarse salt and freshly ground black pepper",
        "1/2 cup all-purpose flour",
        "1/2 cup dry white wine",
        "4 cups homemade chicken stock or reduced-fat low-sodium chicken broth",
        "1/2 cup heavy cream, optional",
        "4 cups cooked boneless turkey or chicken meat, shredded into 1-inch pieces",
        "2 cups English peas, defrosted if frozen"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Poultry Recipes",
        "Turkey Recipes",
        "Spaghetti",
        "Mushroom",
        "Vegetable",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Main Dish Recipes"
    ],
    "title": "Turkey Tetrazzini",
    "url": "http://www.foodnetwork.com/recipes/turkey-tetrazzini0"
}
