{
    "directions": [
        "In a heavy kettle cook onions and three fourths of garlic in oil over moderately low heat, stirring occasionally, until onions are softened. Add turkey, carrots, and bell pepper and cook, stirring to break up turkey, until carrots are barely tender. Stir in tomatoes, wine, herbs, spices, and salt and pepper to taste, breaking up tomatoes, and simmer, uncovered, 25 minutes. Stir in remaining garlic and simmer 5 minutes. Sauce may be made 3 days ahead, cooled completely, and chilled, covered.",
        "Preheat oven to 375°F.",
        "In a bowl stir together ricotta, egg, scallions, and salt and pepper to taste.",
        "Pour 1 cup sauce into a baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagne sheets, making sure they do not touch each other. Spread about 2 cups sauce over pasta. Drop one third of ricotta mixture by spoonfuls onto sauce and gently spread with back of a spoon. Sprinkle one fourth of mozzarella over ricotta mixture and make 2 more layers in same manner, beginning and ending with pasta. Spread remaining sauce evenly over top, making sure pasta is completely covered, and sprinkle with Parmesan and remaining mozzarella.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes before serving."
    ],
    "ingredients": [
        "2 large onions, chopped (about 2 cups)",
        "4 large garlic cloves, minced",
        "2 tablespoons olive oil",
        "1 1/2 pounds ground turkey",
        "2 carrots, chopped fine",
        "1 large red bell pepper, chopped fine",
        "a 28- to 32-ounce can whole tomatoes with thick purée",
        "1 1/2 cups dry red wine",
        "1 teaspoon basil, crumbled",
        "3/4 teaspoon dried thyme, crumbled",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/8 teaspoon ground allspice",
        "15 ounces part-skim ricotta (about 2 cups)",
        "1 large egg, beaten lightly",
        "2 scallions, chopped",
        "twelve 7- by 3 1/2-inch sheets dry no-boil lasagne pasta",
        "12 ounces part-skim mozzarella, grated (about 3 cups)",
        "1/4 cup freshly grated Parmesan (about 1 ounce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Poultry",
        "Tomato",
        "turkey",
        "Bake",
        "Winter",
        "Gourmet"
    ],
    "title": "Turkey, Tomato, Ricotta, and Mozzarella Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-tomato-ricotta-and-mozzarella-lasagne-13474"
}
