{
    "directions": [
        "Preheat oven to 350°F.",
        "Pulse onion and garlic in a food processor until finely chopped. Add mushrooms and pulse until finely chopped, scraping down bowl frequently, then stir in salt, pepper, and spices (this makes a duxelles).",
        "Cook duxelles in a 12-inch nonstick skillet over moderate heat, stirring, until a shade darker and most of liquid mushrooms give off has evaporated, about 10 minutes. (Duxelles should not be dry in this recipe.)",
        "Soak baguette pieces in milk in a large bowl until milk is absorbed. Stir in egg white, parsley, brandy, turkey, liver, and ham, then duxelles until combined well.",
        "Spoon into lightly oiled terrine and bake, uncovered, in middle of oven until an instant-read thermometer inserted 2 inches into center registers 170°F and top is firm and browned, about 1 hour and 10 minutes. Transfer terrine to a rack and cool. Chill, covered, at least 8 hours (overnight) for flavors to develop.",
        "To unmold pâté, drain off any liquid in terrine, then loosen bottom with a spatula. Invert pâté onto a plate, then reinvert onto a serving platter. Cut into slices with a serrated knife and bring to room temperature."
    ],
    "ingredients": [
        "1 medium onion, quartered",
        "2 garlic cloves",
        "1 pound cremini mushrooms, trimmed and halved (quartered if large)",
        "1 teaspoon salt",
        "3/4 teaspoon black pepper",
        "3/4 teaspoon freshly grated nutmeg",
        "Pinch of ground cloves",
        "Pinch of ground cinnamon",
        "1 (1-ounce) piece of baguette, crust discarded and bread torn into small pieces (1/2 cup)",
        "1/4 cup fat-free milk",
        "1 large egg white, lightly beaten",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "2 tablespoons brandy",
        "3/4 pound ground turkey (mix of dark and light meat)",
        "1/4 pound chicken livers, trimmed and cut into 1/2-inch cubes",
        "1 (1/4-pound ) piece cooked ham, cut into 1/2-inch cubes",
        "Accompaniments: toasted baguette slices and Dijon mustard",
        "Special equipment: a 6-cup ceramic terrine or an 8- by 4-inch glass loaf pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Mushroom",
        "turkey",
        "Bake",
        "Cocktail Party",
        "Buffet",
        "Ham",
        "Spice",
        "Brandy",
        "Chill",
        "Gourmet"
    ],
    "title": "Turkey, Chicken Liver, and Mushroom Pâté",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-chicken-liver-and-mushroom-pate-104762"
}
