{
    "directions": [
        "Finely chop white part of onions. Place green parts side by side on 15x10x1-inch heavy rimmed baking sheet to form mat. Mix chopped onions, sausage, raisins, 1 1/2 teaspoons fennel, 1/4 teaspoon salt, and 1/4 teaspoon pepper in medium bowl.",
        "Place turkey on work surface, skin side down. Sprinkle with salt and pepper. Spoon sausage mixture in row between breast halves. Starting at 1 long side, roll up turkey breast to enclose filling. Tie with kitchen string at 1-inch intervals to hold shape. Place turkey atop onion mat. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 400°F. Brush oil all over turkey. Sprinkle with salt, pepper, and 2 teaspoons fennel. Roast until thermometer inserted into filling registers 155°F, basting turkey every 15 minutes with 1/4 cup broth and adding more broth to pan if drippings burn, about 1 hour 20 minutes. Transfer to platter; let stand 5 minutes. Set baking sheet with onions atop 2 burners. Add 1 cup broth to baking sheet. Bring to boil over medium-high heat, scraping up browned bits. Boil 2 minutes. Strain pan juices into medium bowl; discard solids. Serve turkey with pan juices."
    ],
    "ingredients": [
        "12 green onions",
        "3/4 pound Italian sweet sausages, casings removed",
        "1/2 cup golden raisins",
        "3 1/2 teaspoons fennel seeds",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 3-pound boneless whole turkey breast",
        "2 tablespoons olive oil",
        "2 1/4 cups (about) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Raisin",
        "Sausage",
        "Fall"
    ],
    "title": "Turkey Breast Stuffed with Sausage, Fennel, and Golden Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-breast-stuffed-with-sausage-fennel-and-golden-raisins-107287"
}
