{
    "directions": [
        "Place the water, butter, and raisins into a saucepan; bring to a boil. Remove from the heat, stir in the stuffing mix, cover, and let stand until the stuffing mixture absorbs the liquid, about 5 minutes. Stir 1 tablespoon of poultry seasoning and the apple lightly into the stuffing. Allow the stuffing mixture to cool.",
        "Preheat oven to 350 degrees F (175 degrees C). Place a rack into a roasting pan.",
        "Carefully remove the turkey breast skin in one piece without tearing the skin, and set aside. Bone the turkey breast (see notes) keeping the meat in one piece but removing the strip of cartilage and gristle between the two breast halves, if necessary. Pull the two tenderloin sections outward from the main part of the breast, keeping them attached, to expand the boneless piece of turkey into a roughly square-shaped piece of meat. Sprinkle the inside of the breast with salt, pepper, and 1 tablespoon of poultry seasoning.",
        "Spread the stuffing mixture all over the inside of the breast meat piece, and firmly roll the stuffed breast into a compact roll. Spread the reserved turkey skin out, and place the stuffed roll in the middle of the skin. Pull and roll the skin over the stuffed meat, and tie the stuffed roll together with cooking twine. Place the roll onto the roasting rack with the seam side down.",
        "Roast the stuffed breast in the preheated oven until the skin is golden brown, the meat is no longer pink inside, and the temperature of the roll, measured at the thickest part, reads 170 degrees F (75 degrees C), 1 1/2 to 2 hours. Allow the roast to stand covered with a tent of aluminum foil for at least 10 minutes before removing the twine for slicing."
    ],
    "ingredients": [
        "1 1/2 cups water",
        "1/4 cup butter",
        "1/3 cup raisins",
        "1 (6 ounce) package low sodium stuffing mix (such as Stove Top® Lower Sodium Chicken Flavor)",
        "1 tablespoon poultry seasoning",
        "1 apple - peeled, cored, and chopped",
        "1 (6 pound) whole bone-in turkey breast with skin",
        "salt and pepper to taste",
        "1 tablespoon poultry seasoning"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Breast Roulade with Apple and Raisin Stuffing",
    "url": "http://allrecipes.com/recipe/212662/turkey-breast-roulade-with-apple-and/"
}
