{
    "directions": [
        "Using a sharp knife, cut a shallow X in bottom of tomato and immerse in a saucepan of boiling water 10 seconds. Immediately transfer tomato with a slotted spoon to a bowl of ice and cold water to cool, then drain. Peel, seed, and finely chop tomato.",
        "Cook onion in butter with salt in a 10-inch heavy skillet over moderate heat, stirring occasionally, until golden, about 4 minutes. Add mushrooms and cook, stirring occasionally, until mushrooms begin to brown, about 3 minutes. Sprinkle with flour and cook, stirring constantly, 1 minute, then stir in broth and bring to a boil over moderate heat, stirring constantly. Reduce heat and simmer, stirring, 1 minute (sauce will be thick). Remove from heat and stir in turkey, parsley, chopped tomato, and pepper to taste.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Bring water to a boil with butter and salt in a 1 1/2- to 2-quart heavy saucepan. Reduce heat to low and add flour all at once, then stir vigorously with a wooden spoon until dough forms a ball and pulls away from sides of pan, 1 to 2 minutes.",
        "Remove from heat and stir vigorously for 1 minute more to release steam, then beat in 3 eggs, 1 at a time, beating until incorporated after each addition. Stir in Swiss cheese, 1 tablespoon parmesan, and mustard, then spread dough with dampened hands into a buttered 9-inch pie plate. Create a 6-inch-wide hole in center by pulling dough toward edge of pie plate, then mound filling in hole. Push dough 1 inch up sides of filling, leaving top of filling exposed. Lightly beat remaining egg and brush some over dough (reserve remainder for another use), then sprinkle with remaining tablespoon parmesan.",
        "Bake pie until dough is puffed and golden, about 40 minutes, then cut 4 slits with a small knife around side of dough to release steam and bake 10 minutes more. Let pie stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 small tomato",
        "1 small onion, finely chopped (1/2 cup)",
        "2 tablespoons unsalted butter",
        "1/8 teaspoon salt",
        "2 large white mushrooms, finely chopped (1/4 cup)",
        "1 tablespoon all-purpose flour",
        "1/4 cup plus 2 tablespoons reduced-sodium chicken broth",
        "1 1/4 cups finely chopped cooked turkey",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "3/4 cup water",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into small pieces",
        "1/2 teaspoon salt",
        "3/4 cup all-purpose flour, sifted after measuring",
        "4 large eggs, at room temperature for 30 minutes",
        "3 oz Swiss cheese, cut into 1/4-inch dice (about 3/4 cup)",
        "2 tablespoons finely grated Parmigiano-Reggiano (using a Microplane rasp)",
        "1/2 teaspoon dry mustard powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Poultry",
        "turkey",
        "Vegetable",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Fall",
        "Pastry",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Turkey Cream Puff Pie",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-cream-puff-pie-232982"
}
