{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C).  Grease 2 9x12 inch baking pans.",
        "Heat the butter and olive oil in a large skillet over medium heat. Stir in the onion and chopped green, yellow, and orange bell peppers; cook and stir until the peppers have softened and onion has turned translucent, about 10 minutes. Add the kosher salt, black pepper, chipotle pepper, ancho pepper, cumin, and paprika. Cook and stir until seasonings start to become fragrant, about 5 more minutes.",
        "Pour in the sour cream and heavy cream, and add the cream cheese.  Stir well to combine, and cook over low heat until mixture is heated through and creamy, about 5 minutes. Remove pan from heat and allow mixture to cool about 10 to 15 minutes.  Divide mixture, and reserve half for topping.",
        "Combine shredded turkey with 2 1/2 cups of shredded Cheddar cheese in a large bowl.  Add in half of the cooled cream and pepper mixture, and stir lightly to mix. Set aside.",
        "Heat vegetable oil in a skillet over medium heat until the oil is hot but not smoking, about 2 minutes.  Slide one tortilla at a time into the oil and allow to heat through, about 20 to 30 seconds, until the tortilla is hot and pliable.  Stack the warmed tortillas and cover to retain heat.",
        "To assemble the enchiladas, place 1/4 cup of creamy turkey filling in a line down the center of each tortilla, roll the tortillas, and lay 11 enchiladas, seam sides down, into each prepared baking dish.  Top each dish with half of the reserved cream and pepper mixture.  Bake the pans in the oven for 20 to 25 minutes, until enchiladas are heated through and sauce begins to brown and bubble.",
        "Remove the pans from the oven, sprinkle each with about 3/4 cup of shredded Cheddar cheese, and return to the oven to finish baking, about 15 more minutes, until topping is melted, browned, and bubbling.  Let stand about 10 minutes to rest before serving."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "1 green bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1 orange bell pepper, chopped",
        "2 teaspoons kosher salt",
        "2 teaspoons ground black pepper",
        "1/2 teaspoon ground chipotle chile pepper",
        "1/2 teaspoon ground ancho chile pepper",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons paprika",
        "1 cup sour cream",
        "1/3 cup heavy cream",
        "1 (8 ounce) package cream cheese, cut into pieces",
        "5 cups shredded cooked turkey",
        "2 1/2 cups shredded Cheddar cheese",
        "1 teaspoon hot pepper sauce, or to taste",
        "22 (6 inch) corn tortillas",
        "1 cup vegetable oil for frying",
        "1 1/2 cups shredded Cheddar cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Cream Cheese Enchiladas",
    "url": "http://allrecipes.com/recipe/79286/turkey-cream-cheese-enchiladas/"
}
