{
    "directions": [
        "Remove the breast meat from the bones in two whole fillets and cut each fillet into slices about 3/8-inch thick. Pound lightly between sheets of waxed paper as you would for scaloppine of veal. Flour the slices lightly.",
        "Use 2 skillets for sautéing so the pan will not be overcrowded. Melt half the butter in each skillet and add half the oil to each. Sauté the breast slices gently, turning them often, season with salt and add a few grinds of pepper. They should cook about 10 minutes. Then add a slice of ham to each slice and either 1 or 2 slices of white truffle (the Urbani white truffles are good, although expensive). If you use mushrooms instead, add a tablespoon to each turkey slice. Spoon a little broth over each one and sprinkle with freshly grated Parmesan cheese. Reduce the heat, cover the pan, and simmer for about 5 minutes, or until the cheese melts and blends with the pan juices. Arrange turkey slices on a hot platter and spoon the sauce over them. Sprinkle with chopped parsley. Serve with sauté potatoes, chopped spinach flavored with oil and a touch of garlic and nutmeg. Drink a good white wine — a Verdicchio or a Pouilly Fumé."
    ],
    "ingredients": [
        "Breast from an 8- to 9-pound turkey",
        "Flour",
        "12 tablespoons butter",
        "6 tablespoons oil",
        "Salt, freshly ground pepper",
        "Ham slices",
        "Sliced white truffles, or sliced mushrooms, lightly sautéed in butter",
        "Chicken or turkey broth",
        "Freshly grated Parmesan cheese",
        "Chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "turkey",
        "Sauté",
        "Parmesan",
        "Ham",
        "Fall",
        "Parsley",
        "House & Garden"
    ],
    "title": "Turkey Breast Pappagallo",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-breast-pappagallo-20138"
}
