{
    "directions": [
        "Mix yogurt, garlic, lemon zest, and 2 tsp. lemon juice in a medium bowl; season with salt. Set yogurt sauce aside.",
        "Mix black pepper, coriander, cumin, paprika, cinnamon, turmeric, and cayenne in a small bowl. Heat 2 Tbsp. butter and 1 Tbsp. oil in a large skillet over medium. As soon as butter is melted, add half of spice mixture and cook, stirring, until fragrant, about 30 seconds. Add half of turkey meat and toss to coat. Transfer to a large bowl. Repeat with remaining 2 Tbsp. butter, 1 Tbsp. oil, spice mixture, and turkey meat. Add remaining 1 tsp. lemon juice to turkey mixture and toss to combine.",
        "Toss onion, cucumbers, carrot, radishes, and vinegar in a large bowl to combine. Add herbs, season with salt, and gently toss again.",
        "Cut 1\" off top of each pita and stuff back into pocket, nudging it all the way to the bottom. Spread some of the yogurt sauce inside each pita without tearing sides and fill with turkey and vegetable mixture. Serve with hot sauce and remaining yogurt sauce."
    ],
    "ingredients": [
        "1 cup plain whole-milk Greek yogurt",
        "1 garlic clove, finely grated",
        "1 teaspoon finely grated lemon zest",
        "3 teaspoons fresh lemon juice, divided",
        "Kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon smoked paprika",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground turmeric",
        "Pinch of cayenne pepper",
        "4 tablespoons unsalted butter, divided",
        "2 tablespoons vegetable oil, divided",
        "4 cups shredded turkey meat, room temperature, divided",
        "1 small red onion, halved, very thinly sliced",
        "2 medium Persian cucumbers, cut into matchsticks",
        "1 medium carrot, peeled, cut into matchsticks",
        "4 radishes, trimmed, thinly sliced",
        "1 tablespoon plus 2 teaspoons red wine vinegar",
        "2 cups mixed tender herbs (such as torn mint leaves, parsley leaves with tender stems, and/or dill fronds)",
        "6 white pitas with pockets, warmed",
        "Hot sauce (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Thanksgiving",
        "leftovers",
        "turkey",
        "Herb",
        "Spice",
        "Yogurt",
        "Cucumber"
    ],
    "title": "Turkey Shawarma With Crunchy Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-shawarma-with-crunchy-vegetables"
}
