{
    "directions": [
        "In a saucepan over medium-high heat, combine the farro and water and bring to a boil. Reduce the heat to low and simmer until tender, about 20 minutes. Drain and set aside.",
        "Meanwhile, preheat an oven to 375°F (190°C). Lightly spray a rimmed baking sheet with cooking spray.",
        "In a bowl, combine the ground turkey, panko, cheese, egg, parsley and lemon zest. Season well with salt and pepper. Using 1 Tbs. of the turkey mixture at a time, form into small meatballs and transfer to the prepared baking sheet. Bake until cooked through, about 12 minutes.",
        "In a large saucepan over medium-high heat, warm the olive oil. Add the onion and garlic and sauté until translucent, about 6 minutes. Add the broth, season with salt and pepper and bring to a boil. Reduce the heat to low and simmer for 10 minutes. Add the turkey meatballs, farro and spinach and cook just until the spinach wilts, about 3 minutes. Season the soup with salt and pepper, ladle into warmed bowls and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Healthy Dish of the Day,",
        "by Kate McMillan (Weldon Owen, 2014)."
    ],
    "ingredients": [
        "1 cup (7 1/4 oz./230 g) farro, rinsed",
        "3 cups (24 fl. oz./750 ml) water",
        "Nonstick cooking spray",
        "1 lb. (500 g) ground turkey",
        "6 Tbs. (1/2 oz./15 g) whole-wheat panko bread crumbs",
        "3 Tbs. grated Parmigiano-Reggiano cheese",
        "1 egg, lightly beaten",
        "2 Tbs. chopped fresh flat-leaf parsley",
        "Grated zest of 1 lemon",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "1 small yellow onion, chopped",
        "3 garlic cloves, chopped",
        "6 cups (48 fl. oz./1.5 l) low-sodium chicken broth",
        "4 oz. (125 g) spinach leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Turkey Meatball Soup with Spinach and Farro",
    "url": "http://www.williams-sonoma.com/recipe/turkey-meatball-soup-with-spinach-and-farro.html"
}
