{
    "directions": [
        "In the stovetop-safe insert of a slow cooker over medium-high heat, warm 1 Tbs. of the oil. Add the ground turkey and cook, stirring occasionally, until browned, about 10 minutes. Season with salt and black pepper. Transfer to a bowl.",
        "Add the remaining 1 Tbs. oil, the jalapeños, onions and bell pepper to the insert. Cook, stirring occasionally, until softened, 4 to 6 minutes. Add the garlic, tomato paste, chili powder, cumin, oregano and red pepper flakes and cook, stirring, until fragrant, 1 to 2 minutes. Add the tomatoes, beans, sweet potatoes, stock, water and turkey and bring to a simmer.",
        "Transfer the insert to a slow-cooker base. Cover and cook on high according to the manufacturer’s instructions until the beans are tender, 3 to 3 1/2 hours. Skim off the excess fat. Adjust the seasonings with salt and black pepper.",
        "In a bowl, toss together the cabbage, lime juice and cilantro and season with salt. Ladle the chili into warmed bowls. Garnish with the cheese, avocado and cabbage slaw and serve immediately. Serves 10 to 12.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 Tbs. canola oil",
        "2 lb. ground turkey",
        "Kosher salt and freshly ground black pepper, to taste",
        "3 jalapeños, cored, seeded and diced",
        "2 yellow onions, diced",
        "1 large red bell pepper, cored, seeded; and diced",
        "3 garlic cloves, minced",
        "2 Tbs. tomato paste",
        "1/4 cup chili powder",
        "1 tsp. ground cumin",
        "1 tsp. dried oregano",
        "1/2 tsp. red pepper flakes",
        "2 cans (each 14 oz.) diced tomatoes with juices",
        "12 oz. dried snow cap beans, rinsed, soaked overnight and\n  drained",
        "12 oz. dried Good Mother Stallard beans, rinsed, soaked\n  overnight and drained",
        "2 sweet potatoes, each about 1 lb., peeled and cut into 1/2-inch\n  dice",
        "2 cups chicken stock",
        "2 cups water",
        "1/2 head green cabbage, quartered, cored and shredded",
        "Juice of 1 lime",
        "1/4 cup chopped fresh cilantro",
        "Grated Monterey jack cheese and diced avocado for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Turkey, Two-Bean and Sweet Potato Chili",
    "url": "http://www.williams-sonoma.com/recipe/turkey-two-bean-sweet-potato.html"
}
