{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.",
        "Mix tomato sauce, tomato paste, ketchup, sugar, onion powder, garlic powder, 1 teaspoon oregano, 1 teaspoon black pepper, and 1 teaspoon Worcestershire sauce in a bowl.",
        "Place stewed tomatoes in a large bowl; crush tomatoes using a fork. Add turkey, crushed crackers, onion, green bell pepper, eggs, 1 tablespoon oregano, thyme, 2 tablespoons Worcestershire sauce, garlic, and 2 teaspoons black pepper; mix until evenly combined. Spoon meatloaf mixture into the prepared baking dish. Form into a loaf, leaving about 1/2 inch between loaf and sides of dish.",
        "Spoon half the tomato topping over the loaf.",
        "Bake in the preheated oven for 45 minutes. Spoon the remaining tomato topping over loaf and top with mozzarella cheese. Bake until no longer pink in the center, 15 to 20 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/1032492.jpg",
    "ingredients": [
        "Topping:",
        "1 (15 ounce) can tomato sauce",
        "1 (6 ounce) can tomato paste",
        "1/2 cup ketchup",
        "2 teaspoons white sugar",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 teaspoon dried oregano",
        "1 teaspoon ground black pepper",
        "1 teaspoon Worcestershire sauce",
        "Meat Loaf:",
        "1 (14.5 ounce) can Italian-style stewed tomatoes, undrained",
        "3 pounds ground turkey",
        "1 sleeve roasted vegetable-flavored buttery round crackers (such as Ritz®), crushed",
        "1 onion, diced",
        "1 green bell pepper, diced",
        "2 eggs, slightly beaten",
        "1 tablespoon dried oregano",
        "1 tablespoon dried thyme",
        "2 tablespoons Worcestershire sauce",
        "1 clove garlic, minced",
        "2 teaspoons ground black pepper",
        "1/2 cup shredded mozzarella cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Meat Loaf: Almost As Good As Mom's Used To Be",
    "url": "http://allrecipes.com/recipe/232315/turkey-meat-loaf-almost-as-good-as-m/"
}