{
    "directions": [
        "Mix the ground meats, garlic, 1/2 cup cognac, the eggs, 1/4 teaspoon quatre épices, 1 1/4 teaspoons salt, the pepper and thyme in a large bowl. Blend well with the hands. If you wish to test the flavor, cook a small amount of the mixture in butter until cooked through.",
        "Split the turkey down the back and carefully bone the bird, being careful not to slit the skin. With your fingers and a small, sharp-pointed knife, pull and cut the meat away from the bones. When you come to the legs and thighs, use your fingers to help locate and slip out the thigh bones. You may remove the wings and, if you wish, remove the leg and leave only the thigh. When the bird is completely boned, remove the breast fillets. Marinate the fillets for 1 hour in a mixture of cognac, 1 teaspoon salt and a sprinkling of quatre épices or Spice Parisienne.",
        "To assemble the galantine, spread the boned turkey, skin side down, on a table or marble slab. Spread the farce (the ground meat mixture) over the meat of the turkey. Place the well-trimmed marinate fillets in the center of the turkey.",
        "Arrange the fingers of meat and truffles along the sides of the fillets and push them well into the farce. Sprinkle with pistachio nuts and then roll up the stuffed turkey like a giant sausage. Turn in the ends of the skin and bring the sides together so that they overlap. Sew them with light twine and a needle. Roll the turkey in a damp towel and tie securely at the ends and around the middle, leaving pieces of string at the ends.",
        "Half fill a long fish cooker with meat stock and tie the galantine by the strings to the handles at either end so that it is suspended in the stock. Cover well with several thicknesses of aluminum foil. Press the foil around the edge of the cooker and steam the turkey for 2 to 2 1/2 hours. Remove from the broth after it is partially cooled and weight it so that it holds its shape and become very firm as it cools. Chill in the refrigerator for 36 hours before serving. To serve, remove the covering and arrange on a large platter or carving board and surround with chopped aspic. Carve in thinnish slices and serve as an hors d'oeuvre or as one dish for a buffet meal."
    ],
    "ingredients": [
        "2 pounds ground fat pork",
        "2 pounds ground ham",
        "1 pound ground veal",
        "3 cloves garlic, chopped fine",
        "Cognac",
        "3 eggs",
        "Quatre épices or Spice Parisienne",
        "2 1/4 teaspoons salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 teaspoon thyme",
        "6- to 8-pound turkey",
        "Long fingers of boiled tongue and ham, cut about 1/4-inch square",
        "Fresh or canned truffles",
        "Pistachio nuts",
        "Meat stock"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Egg",
        "Pork",
        "turkey",
        "Marinate",
        "Steam",
        "Thanksgiving",
        "Cognac/Armagnac",
        "Fall",
        "House & Garden"
    ],
    "title": "Turkey Galantine",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-galantine-20137"
}
