{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Press pie crust pastry into the bottom of a 10-inch pie dish; reserve top crust.",
        "Heat canola oil in a large skillet over medium heat; cook and stir onion, carrots, celery, parsley, oregano, salt, and black pepper until vegetables are slightly tender, about 5 minutes. Stir in 1 tablespoon butter until melted. Pour in chicken broth and bring to a boil. Add sweet potato; simmer until tender, about 15 minutes. Stir in peas; reduce heat to low.",
        "Melt remaining 1 tablespoon butter in a saucepan over medium-low heat; cook and stir turkey and flour until turkey is heated through, about 5 minutes. Pour milk into saucepan with turkey and bring to a simmer. Transfer turkey sauce to vegetable mixture and continue to cook until thickened, about 10 minutes more. Remove from heat and allow to cool.",
        "Bake bottom crust in preheated oven until lightly browned, about 8 minutes. Allow to cool for 5 minutes; pour turkey and vegetable mixture into crust. Roll reserved top crust over turkey filling and pinch edges to seal. Cut four slits in the top crust for steam to escape.",
        "Return to oven and bake for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and continue to bake until crust is golden brown, about 10 minutes more."
    ],
    "ingredients": [
        "1 (15 ounce) package pastry for a 10-inch double crust pie",
        "2 teaspoons canola oil",
        "1 small onion, minced",
        "2 carrots, diced",
        "1 stalk celery, finely chopped",
        "2 tablespoons dried parsley",
        "1 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "1 tablespoon butter",
        "2 cups low-sodium chicken broth",
        "1 cup peeled and cubed sweet potato",
        "1 cup frozen green peas",
        "1 tablespoon butter",
        "2 cups cubed cooked turkey",
        "3 tablespoons all-purpose flour",
        "2/3 cup milk",
        "1 stalk celery, finely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Pot Pie a la Kat",
    "url": "http://allrecipes.com/recipe/228840/turkey-pot-pie-a-la-kat/"
}
