{
    "directions": [
        "Place the lamb, beef, salt, pepper, cumin, paprika, and tomato paste in a large bowl. Do not mix together; simply set aside.",
        "Place onions and garlic into a blender. Blend, and slowly drizzle in olive oil until the mixture has a paste-like texture. Add the chopped parsley to the onion paste and blend for 5 seconds.",
        "Pour the onion paste into the bowl with the meat mixture. Knead the mixture lightly with clean hands. Sprinkle the flour over the meat mixture. Crack the eggs into a small bowl; add them to the meat mixture and knead lightly to combine. Let the mixture rest for 5 minutes to allow flavor to develop, then knead lightly once more to be sure that all ingredients are well combined.",
        "Take a small handful of the meat and place it in the palm of your hand. Close fingers around meat to shape gently into small balls, then press the meatball lightly between palms to form a patty. Place on a large plate.  Repeat this process until all of the mixture has been formed into patties, using plastic wrap to separate layers of patties. Cover the plate with plastic wrap, and refrigerate for at least one hour.",
        "Preheat the oven's broiler and set the oven rack at about 3 inches from the heat source. Line a pan with aluminum foil and arrange rissoles 1/2 inch apart in the pan. Broil rissoles 3 inches from the heat source until deep golden brown on both sides, turning only once."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F479354.jpg",
    "ingredients": [
        "1 pound ground lamb",
        "1 pound ground beef",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 tablespoon ground cumin",
        "2 teaspoons ground sweet paprika",
        "3 tablespoons tomato paste",
        "2  onions, peeled and cut into chunks",
        "4 cloves garlic, peeled",
        "1 tablespoon olive oil",
        "¼ bunch fresh parsley, chopped",
        "3 tablespoons all-purpose flour",
        "2 small eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkish Rissoles",
    "url": "http://allrecipes.com/recipe/165607/turkish-rissoles/"
}