{
    "directions": [
        "Put yogurt in a paper towel-lined sieve set over a bowl and keep covered and chilled 8 to 12 hours.",
        "Boil pomegranate juice in a small heavy saucepan until syrupy and reduced to about 2 tablespoons, about 10 minutes. Keep warm off heat, covered.",
        "Soak whole slices of bread for 30 minutes in a mixing bowl filled with water, then fold and squeeze gently to remove as much water as possible.",
        "Pulse onion in a food processor until finely chopped, then add parsley and pulse again until finely chopped. Add lamb, bread (torn into pieces), allspice, red-pepper flakes, cinnamon, and 1/2 teaspoon salt and pulse, stopping and scraping down sides, until combined. (Do not overblend.)",
        "Roll level tablespoons of meat mixture into balls (about 42), arranging them on plates or on another sheet pan.",
        "Preheat oven to 350°F with rack in middle. Line a large, rimmed sheet pan with foil.",
        "Heat olive oil and vegetable oil together in a 12-inch nonstick skillet over medium-high heat until oils shimmer (put one meatball in to test; it should sizzle). Brown meatballs all over in batches of 10 to 12, turning occasionally with a spoon or shaking skillet (lower heat if oil begins to smoke), about 2 minutes per batch. Transfer, as browned, to lined sheet pan.",
        "Once all meatballs are browned, transfer the sheet pan to the oven and bake until meatballs are cooked through (cut one open to look, or use an instant-read thermometer; it should register 160°F), 10 to 15 minutes. Drain briefly on paper towels.",
        "Spoon drained yogurt into a small serving bowl and drizzle with pomegranate syrup, then swirl it in briefly with a spoon. Sprinkle some pomegranate seeds over top. Spear each meatball with a toothpick and serve yogurt alongside for dipping."
    ],
    "ingredients": [
        "2 cups whole-milk yogurt or 1 cup labne or plain Greek yogurt",
        "1 cup pomegranate juice",
        "Pomegranate seeds for garnish (about 2 tablespoons, or to taste)",
        "2 slices firm white sandwich bread",
        "1 small onion, chopped",
        "1/3 cup chopped flat-leaf parsley",
        "1 pound ground lamb (preferably shoulder) or ground chuck",
        "3/4 teaspoon ground allspice",
        "1/2 teaspoon hot red-pepper flakes (see Cooks' notes)",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons olive oil",
        "2 tablespoons vegetable or canola oil",
        "Decorative picks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Yogurt",
        "Oscars",
        "New Year's Eve",
        "Ground Lamb",
        "Spice",
        "Family Reunion",
        "Poker/Game Night",
        "Shower",
        "Pomegranate",
        "Party",
        "Pomegranate Juice",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Turkish Spiced Meatballs with Pomegranate Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkish-spiced-meatballs-with-pomegranate-yogurt-sauce-51142260"
}
