{
    "directions": [
        "Put turkey breast in a 6- to 8-quart pasta pot and add broth and enough water to cover turkey by 1 inch. Remove turkey and bring liquid to a boil. Season with salt and return turkey to pot, then poach at a bare simmer, uncovered, skimming any froth, until an instant-read thermometer inserted 2 inches diagonally into thickest part of breast (do not touch bone) registers 155°F, 1 to 1 1/4 hours. Cool turkey in broth 30 minutes (internal temperature will rise to 170°F).",
        "Purée tuna, anchovies, mayonnaise, oil, lemon juice, and water in a blender until very smooth.",
        "Transfer turkey to a cutting board, then bring remaining poaching liquid to a boil.",
        "Add half of beans and cook, uncovered, until crisp-tender, 3 to 5 minutes. Transfer with a slotted spoon to a colander and refresh under cold water. Cook remaining beans and refresh in same way. Add potatoes to broth in pot and simmer until just tender, about 10 minutes. Drain potatoes, reserving broth for another use.",
        "Thinly slice turkey breast on the diagonal. Arrange beans on a platter and top with potatoes, then drizzle vegetables with some tonnato sauce. Top with turkey slices and more tonnato sauce. Sprinkle dish with capers, olives, and basil. Serve remaining sauce on the side."
    ],
    "ingredients": [
        "1 (2 1/2- to 3-lb) turkey breast half (with bones and skin)",
        "1 qt chicken broth",
        "2 to 2 1/2 qt water",
        "1 (6-oz) can tuna packed in olive oil, drained",
        "3 large anchovy fillets",
        "3/4 cup mayonnaise",
        "1/3 cup extra-virgin olive oil",
        "3 to 4 tablespoons fresh lemon juice (to taste)",
        "1 tablespoon water",
        "1 lb haricots verts (thin French green beans), trimmed",
        "2 lb small (1 1/2- to 2-inch) red potatoes, peeled and quartered",
        "2 tablespoons bottled capers, rinsed and drained",
        "1/2 cup Kalamata or other brine-cured black olives, pitted and quartered lengthwise",
        "Garnish: small fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Poultry",
        "turkey",
        "Green Bean",
        "Summer",
        "Gourmet"
    ],
    "title": "Turkey Tonnato with Potatoes and Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-tonnato-with-potatoes-and-green-beans-105125"
}
