{
    "directions": [
        "Preheat oven to 400°F.",
        "Cook onion and garlic in oil in a 12-inch nonstick skillet over moderate heat, stirring, until onion is softened, about 2 minutes. Add carrot and cook, stirring, until softened, about 3 minutes. Add mushrooms, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook, stirring occasionally, until liquid mushrooms give off is evaporated and they are very tender, 10 to 15 minutes. Stir in Worcestershire sauce, parsley, and 3 tablespoons ketchup, then transfer vegetables to a large bowl and cool.",
        "Stir together bread crumbs and milk in a small bowl and let stand 5 minutes. Stir in egg and egg white, then add to vegetables. Add turkey and remaining 1/2 teaspoon salt and 1/4 teaspoon pepper to vegetable mixture and mix well with your hands. (Mixture will be very moist.)",
        "Form into a 9- by 5-inch oval loaf in a lightly oiled 13- by 9- by 2-inch metal baking pan and brush meatloaf evenly with remaining 2 tablespoons ketchup. Bake in middle of oven until thermometer inserted into meatloaf registers 170°F, 50 to 55 minutes.",
        "Let meatloaf stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "1 tablespoon minced garlic",
        "1 teaspoon olive oil",
        "1 medium carrot, cut into 1/8-inch dice",
        "3/4 pound cremini mushrooms, trimmed and very finely chopped in a food processor",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 1/2 teaspoons Worcestershire sauce",
        "1/3 cup finely chopped fresh parsley",
        "1/4 cup plus 1 tablespoon ketchup",
        "1 cup fine fresh bread crumbs (from 2 slices firm white sandwich bread)",
        "1/3 cup 1% milk",
        "1 whole large egg, lightly beaten",
        "1 large egg white, lightly beaten",
        "1 1/4 pound ground turkey (mix of dark and light meat)",
        "Accompaniment:roasted red pepper tomato sauce or ketchup",
        "Special equipment: a meat thermometer or an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Garlic",
        "Mushroom",
        "turkey",
        "Bake",
        "Sauté",
        "Spice",
        "Fall",
        "Healthy",
        "Gourmet"
    ],
    "title": "Turkey Meatloaf",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-meatloaf-107599"
}
