{
    "directions": [
        "In a large kettle cook the onion and the garlic in the oil over moderate heat, stirring, until they are golden, add the tomatoes with the juice, the tomato purée, 2 cups water, the chili powder, the cumin, the red pepper flakes, the orégano, the cinnamon, the salt, and the black pepper, and combine the mixture well. Add the turkey parts and simmer the chili, uncovered, stirring occasionally, for 2 hours. Transfer the turkey parts with a slotted spoon to a plate and let them cool until they can be handled. Stir the bell peppers and the beans into the chili, add the turkey meat, discarding the skin and bones, and simmer the chili, stirring occasionally, for 40 minutes, or until the bell peppers are tender. The chili may be in advance, cooled completely, uncovered, and kept covered and chilled for 2 days or covered and frozen for 2 minutes. Serve the chili topped with the Cheddar."
    ],
    "ingredients": [
        "2 cups chopped onion",
        "4 garlic cloves, chopped fine",
        "1/4 cup olive oil",
        "two 35-ounce cans plum tomatoes including the juice",
        "a 15-ounce can tomato purée",
        "1/4 cup chili powder",
        "1 1/2 tablespoons ground cumin",
        "1 tablespoon dried hot red pepper flakes",
        "1 teaspoon dried orégano",
        "1/2 teaspoon cinnamon",
        "1 tablespoon salt",
        "1/2 teaspoon black pepper",
        "the drumsticks, legs, and wings from a cooked turkey",
        "2 green bell peppers, chopped coarse",
        "two 19-ounce cans kidney beans rinsed and drained well",
        "sour cream as an accompaniment if desired",
        "coarsely grated Cheddar as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Pepper",
        "Tomato",
        "turkey",
        "Fall",
        "Gourmet",
        "Quick and Healthy"
    ],
    "title": "Turkey Chili",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-chili-13383"
}
