{
    "directions": [
        "In a large kettle or stockpot combine the carcass with 4 1/2 quarts of the water, or enough to cover it, and simmer the mixture, uncovered, for 3 hours. Strain the stock through a large sieve into a large bowl, return it to the kettle, and boil it until it is reduced to about 10 cups.",
        "In a blender purée the garlic and the gingerroot with the remaining 1/3 cup water. In a heavy kettle heat the oil over moderately high heat until it is hot but not smoking and in it cook the purée, stirring, for 2 minutes, or until the liquid is evaporated. Add the potatoes, peeled and cut into cubes, the onion, the carrots, and 5 cups of the stock and simmer the mixture, covered, for 30 minutes, or until the vegetables are very soft. In the blender purée the mixture it batches until it is smooth, transfering it as it is puréed to another large kettle. Stir in the remaining stock, the coconut milk, the lime juice, and salt to taste, simmer the soup for 10 minutes, and stir in the chopped coriander. The soup may be made 2 days in advance, cooled completely, uncovered, and kept covered and chilled. The soup keeps, covered and frozen, for 2 months. Serve the soup garnished with coriander sprigs."
    ],
    "ingredients": [
        "the carcass of a roast turkey, broken into large pieces",
        "about 4 1/2 quarts (18 cups) plus 1/3 cup water",
        "4 garlic cloves",
        "three 1-inch cubes of peeled fresh gingerroot",
        "1/4 cup vegetable oil",
        "2 tablespoons curry powder",
        "3/4 teaspoon ground cumin",
        "2 large boiling potatoes (about 1 pound total)",
        "4 cups chopped onion",
        "3 carrots, sliced",
        "1 cup canned unsweetened coconut milk (available at Asian markets, specialty foods shops, and some supermarkets)",
        "1/4 cup fresh lime juice, or to taste",
        "1/3 cup finely chopped fresh coriander plus coriander sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Ginger",
        "Onion",
        "Potato",
        "turkey",
        "Lunch",
        "Coconut",
        "Curry",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Turkey Mulligatawny Soup with Coriander",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-mulligatawny-soup-with-coriander-13317"
}
