{
    "directions": [
        "Heat oil in large skillet over medium heat. Add sausages; sauté until brown, using fork to break up meat into coarse pieces, about 7 minutes. Add Spicy Tomato Sauce. Simmer 5 minutes.",
        "Position rack in center of oven; preheat to 375°F. Whisk ricotta, spinach, 1 cup Parmesan, eggs, cream, basil, oregano and pepper in large bowl. Set aside. Spoon 1 cup sauce over bottom of 13 x 9 x 2-inch glass baking dish. Place 3 noodles over sauce in single layer. Spread 1 cup sauce over noodles. Spoon 1 cup ricotta mixture over sauce. Sprinkle 1/4 cup Parmesan and 1 cup provolone over ricotta mixture. Repeat layering with 3 noodles, 1 cup sauce, 1 cup ricotta mixture, 1/4 cup Parmesan and 1 cup provolone. Arrange remaining 3 noodles over cheese. Spoon 1 cup sauce over noodles. Sprinkle remaining 1/4 cup Parmesan and 1 cup provolone over lasagna. Dollop remaining ricotta mixture atop lasagna. Spoon 2 1/2 cups sauce around ricotta dollops. Tightly cover baking dish with foil.",
        "Bake lasagna 50 minutes; uncover and continue baking until noodles are tender and lasagna is hot and bubbly, about 25 minutes longer. Let lasagna stand 15 minutes before serving. (Can be prepared 1 day ahead. Cool slightly. Cover and refrigerate. Rewarm, covered with foil, in 350°F. oven about 45 minutes.)",
        "Meanwhile, rewarm remaining sauce in small saucepan over medium heat. Serve lasagna, passing remaining sauce."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 1/4 pounds hot Italian turkey sausages, casings removed",
        "Spicy Tomato Sauce",
        "1 15-ounce container ricotta cheese",
        "1 10-ounce package frozen chopped spinach, thawed, squeezed dry",
        "1 3/4 cups grated Parmesan cheese",
        "2 large eggs",
        "3 tablespoons whipping cream",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "9 uncooked lasagna noodles",
        "3 cups shredded provolone cheese (about 12 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "turkey",
        "Bake",
        "Back to School",
        "Parmesan",
        "Ricotta",
        "Spinach"
    ],
    "title": "Turkey Sausage-Spinach Lasagna with Spicy Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-sausage-spinach-lasagna-with-spicy-tomato-sauce-100988"
}
