{
    "directions": [
        "Bring 2 cups of water to a boil in a small saucepan.  Turn off heat; stir in rice noodles. Cover, and allow noodles to soak until soft, 5 to 7 minutes. Rinse with cold water. Drain well.",
        "Heat 1 teaspoon of the oil in a large skillet over medium-high heat.  Cook the mushrooms in the hot oil until they are browned and softened, about 2 minutes.  Remove the mushrooms from the pan. Reserve.",
        "Heat the remaining 2 teaspoons of oil in the pan.  Cook and stir the turkey in the oil until it is no longer pink, 5 to 7 minutes.  Stir in the green onions, water chestnuts, ginger, and garlic; continue to cook for 1 minute.  Mix in the reserved mushrooms, soy sauce, and brown sugar. Simmer briefly to combine the flavors.  Take the pan off the heat; stir in the rice vinegar, sesame oil, and orange zest.",
        "To assemble lettuce wraps, place a bit of turkey filling on each lettuce leaf.  Top each with cooked noodles, and a sprinkle of bean sprouts, carrots, peanuts, and cilantro.  Serve with sweet chili sauce for dipping."
    ],
    "ingredients": [
        "2 cups water",
        "2 ounces mai fun (angel hair) rice noodles",
        "1 teaspoon vegetable oil",
        "4 shiitake mushrooms, sliced",
        "2 teaspoons vegetable oil",
        "1 (16 ounce) package ground turkey",
        "6 green onions, chopped",
        "1/4 cup chopped water chestnuts",
        "4 teaspoons finely minced fresh ginger root",
        "2 teaspoons minced garlic",
        "3 tablespoons soy sauce",
        "2 tablespoons brown sugar",
        "1 tablespoon rice vinegar",
        "1 teaspoon sesame oil",
        "1 teaspoon finely grated orange zest",
        "12 leaves green leaf lettuce",
        "Toppings",
        "1/2 cup bean sprouts",
        "1 carrot, grated",
        "1/2 cup salted peanuts",
        "1/2 cup chopped fresh cilantro",
        "1/2 cup sweet chili sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Lettuce Wraps with Shiitake Mushrooms",
    "url": "http://allrecipes.com/recipe/202709/turkey-lettuce-wraps-with-shiitake-mu/"
}
