{
    "directions": [
        "Preheat the oven to 425°F.",
        "In a deep ovenproof skillet or a Dutch oven, heat the EVOO over high heat. Add the turkey and break it up with a wooden spoon; season with salt and pepper and the poultry seasoning. Place the sweet potatoes in a pot with water to cover. Cover the pot, bring to a boil, then salt the water and cook the potatoes for 15 minutes, or until tender.",
        "Grate the onion and carrots directly into the skillet with the turkey. Add the celery, stir, and cook for 5 minutes. While the vegetables are cooking, heat 2 tablespoons of the butter in a small pot over medium heat. Add the flour to the melted butter and whisk for 1 minute, then whisk in the stock and season with salt, pepper, and Worcestershire. Cook for a few minutes, until thickened, then add to the turkey mixture. Stir in the peas into the turkey mixture and turn off the heat.",
        "Drain the potatoes and return the hot pot to the heat. Add the remaining 2 tablespoons of butter and melt over medium heat. Add the banana and potatoes to the pot and season with salt, pepper, and hot sauce. Mash the potatoes and banana to combine, and adjust the seasoning.",
        "Spoon the potatoes onto the meat, and cover the potatoes with the cheese. Bake uncovered for 5 minutes to melt the cheese."
    ],
    "ingredients": [
        "2 tablespoons EVOO (extra-virgin olive oil)",
        "2 pounds ground turkey or chopped leftover turkey",
        "Salt and pepper",
        "2 teaspoons poultry seasoning",
        "2 1/2 pounds sweet potatoes, peeled and cubed",
        "1 onion, peeled",
        "2 carrots, peeled",
        "4 celery stalks from the heart, chopped",
        "4 tablespoons (1/2 stick) butter",
        "2 tablespoons all-purpose flour",
        "2 cups turkey or chicken stock",
        "A few dashes of Worcestershire sauce",
        "1 (10-ounce) box frozen peas",
        "1 very ripe banana, sliced",
        "A few dashes of hot sauce",
        "2 cups shredded sharp yellow cheddar cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Vegetable",
        "Thanksgiving",
        "Dinner",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Turkey Sweet Potato Shepherd's Pie",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-sweet-potato-shepherds-pie-363344"
}
