{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Grease a pie pan.",
        "In a bowl, mix cornmeal and water and allow to stand for 10 minutes. Meanwhile, whisk the whole wheat flour, sugar, baking powder, and salt together in a large bowl. Whisk the egg and vegetable oil into the wet cornmeal; stir the wet ingredients into the flour mixture until just combined and pour into the prepared pie pan.",
        "Bake the cornbread in the preheated oven until lightly browned and a knife inserted into the center of the cornbread comes out clean, 20 to 30 minutes. Remove from oven and set aside to cool.",
        "Reduce oven heat to 325 degrees F (165 degrees C).",
        "Cook the bacon in a large skillet over medium-high heat until browned and crisp, about 6 minutes per side; drain on a paper towel-lined plate. Crumble the bacon when cool. Stir the onion, garlic, celery, red bell pepper, poultry seasoning, sage, and oregano into the bacon drippings left in the skillet; cook and stir until the onion is translucent, about 10 minutes.",
        "Remove cooled cornbread from the pie pan and cut into small cubes; place into a large bowl and mix in the rye bread cubes. Stir the bacon and cooked vegetables into the stuffing until well combined; drizzle the chicken broth into the dressing, stirring to evenly moisten the bread cubes.",
        "Rinse the turkey inside and out and pat dry with paper towels. Place turkey into a large roasting pan with a lid. Fill the body and neck cavities loosely with stuffing, folding the neck skin over the stuffing and securing in place with toothpicks. Place any leftover stuffing onto a large square of aluminum foil and fold and seal the edges to enclose the stuffing. Refrigerate stuffing packet until about 45 minutes before serving time.",
        "Place the turkey in the oven, and roast until a meat thermometer inserted into the thickest part of the thigh reads 180 degrees F (80 degrees C), 3 1/2 to 4 hours. Remove lid after about 2 1/2 hours to brown skin. Baste occasionally with pan drippings. About 45 minutes before serving, bake the extra stuffing if desired."
    ],
    "ingredients": [
        "3/4 cup cornmeal",
        "1 1/4 cups water",
        "1 cup whole wheat flour",
        "1/3 cup white sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 egg",
        "1/4 cup vegetable oil",
        "1/4 pound bacon, or more to taste",
        "1 large onion, chopped",
        "2 cloves garlic, minced",
        "6 celery stalk, chopped",
        "1 red bell pepper, diced (optional)",
        "4 teaspoons poultry seasoning",
        "4 teaspoons dried rubbed sage",
        "4 teaspoons dried oregano",
        "1 (1 pound) loaf rye bread, cubed",
        "2 cups low-sodium chicken broth",
        "1 whole turkey, neck and giblets removed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey with Cornbread Stuffing",
    "url": "http://allrecipes.com/recipe/219611/turkey-with-cornbread-stuffing/"
}
