{
    "directions": [
        "In a large heavy saucepan cook the mushrooms in 1/4 cup of the butter over moderate heat, stirring, until most of the liquid they give off has evaporated, stir in the flour, and cook the mixture over low heat, stirring, for 3 minutes. Add in a stream the milk, the broth, and the wine, stirring, bring the mixture to a boil, stirring, and simmer the sauce for 5 minutes. In a kettle of boiling salted water cook the spaghetti until it is al dente and drain it well.",
        "In a large bowl combine well the spaghetti, the mushroom sauce, the turkey, the peas, and salt and pepper to taste, stir in 1/3 cup of the Parmesan, and transfer the mixture to a buttered shallow 3-quart casserole. In a small bowl combine well the remaining 1/3 cup Parmesan, the bread crumbs, and salt and pepper to taste, sprinkle the mixture evenly over the Tetrazzini, and dot the top with the remaining 1 tablespoon butter, cut into bits. The Tetrazzini may be prepared up to this point 1 month in advance and kept frozen, covered. Bake the Tetrazzini in the middle of a preheated 375°F. oven for 30 to 40 minutes, or until it is bubbling and the top is golden."
    ],
    "ingredients": [
        "10 ounces mushrooms, sliced thin (about 4 cups)",
        "5 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "1 3/4 cups milk",
        "2 cups chicken broth",
        "1/4 cup dry white wine",
        "10 ounces spaghetti",
        "3 cups coarsely chopped cooked turkey, including cooked giblets if desired",
        "1 cup cooked peas",
        "2/3 cup freshly grated Parmesan",
        "1/3 cup fine fresh bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "turkey",
        "Bake",
        "Casserole/Gratin",
        "Parmesan",
        "Pea",
        "Gourmet"
    ],
    "title": "Turkey Tetrazzini",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-tetrazzini-13377"
}
