{
    "directions": [
        "Combine first 13 ingredients and 2 tablespoons oil in large bowl; mix to blend thoroughly. (Can be prepared 1 day ahead. Cover and refrigerate.) Using moistened hands and 1/4 cup for each, shape lamb mixture into about 20 oval patties measuring approximately 3x1 1/2x1/2 inches. Arrange patties on sheet of foil.",
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add patties; cook until browned, about 4 minutes per side. Using slotted spoon, return patties to foil. Reserve drippings in skillet.",
        "Heat drippings in skillet over medium heat. Add onion and garlic; sauté until onion is soft, about 5 minutes. Add tomatoes, lemon juice, and allspice. Bring to boil, scraping up browned bits. Stir in pomegranate molasses. Return patties to skillet. Reduce heat to medium-low, cover, and simmer until patties are cooked through and tender, about 20 minutes. Transfer patties to bowl. Tilt skillet and spoon fat off top of sauce. Simmer sauce until slightly thickened, mashing tomatoes with back of fork, about 5 minutes. Season with salt and pepper. Return patties to sauce. Remove from heat.",
        "Meanwhile, preheat oven to 350°F. Wrap pitas in foil; bake 12 minutes to heat.",
        "Simmer patties in sauce until heated through; mix in green onions. Cut pitas in half; gently open each half. Place 1 or 2 patties and some sauce into each pita half and top with dollop of yogurt.",
        "*A thick pomegranate syrup that is available at Middle Eastern markets and some supermarkets."
    ],
    "ingredients": [
        "1 1/2 pounds ground lamb",
        "1/2 cup fresh breadcrumbs made from crustless French bread",
        "1/2 cup chopped fresh cilantro",
        "1/2 cup minced white onion",
        "1/4 cup chopped fresh mint",
        "1 large egg",
        "1 large shallot, minced",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon ground allspice",
        "4 tablespoons olive oil",
        "1 cup finely chopped white onion",
        "3 garlic cloves, chopped",
        "2 cups drained canned diced tomatoes in juice",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon ground allspice",
        "1 tablespoon pomegranate molasses*",
        "6 6- to 7-inch-diameter pita rounds",
        "1/2 cup chopped green onions",
        "Plain whole-milk yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Lamb",
        "Onion",
        "Tomato",
        "Bake",
        "Fry",
        "Spice",
        "Winter",
        "Molasses",
        "Simmer"
    ],
    "title": "Turkish Lamb Pitas with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkish-lamb-pitas-with-tomato-sauce-107650"
}
