{
    "directions": [
        "Heat vegetable oil in a large stockpot over medium-high heat. Add turkey bones to hot oil; cook, turning occasionally, until browned, about 10 minutes. Transfer bones to a bowl.",
        "Cook and stir quartered onion, coarsely chopped celery, and coarsely chopped carrot in the hot oil in the same stockpot until fragrant, about 2 minutes. Return turkey bones to stockpot and add 16 cups water and thyme sprigs. Bring to a boil, skim off foam, reduce heat to medium-low, and simmer until liquid reduces to 10 cups, about 2 hours. Strain stock into a large bowl and let stand for 15 minutes. Spoon fat off top of stock.",
        "Bring 2 1/2 cup water and barley to a boil in a saucepan. Cover saucepan, reduce heat to low, and simmer until the barley is tender, 30 to 40 minutes.",
        "Heat olive oil in a large stockpot over medium-high heat; cook and stir diced onion, sliced carrots, sliced celery, and garlic until slightly softened, about 5 minutes. Add turkey stock to onion mixture and bring to a boil.",
        "Mix turkey meat, barley, parsley, thyme leaves, salt, black pepper, and cayenne pepper into soup; reduce heat to medium-low and simmer for 20 minutes. Stir lemon juice into soup."
    ],
    "ingredients": [
        "Stock:",
        "2 tablespoons vegetable oil",
        "3 pounds turkey bones",
        "1 onion, quartered",
        "1 stalk celery, coarsely chopped",
        "1 carrot, coarsely chopped",
        "16 cups water",
        "2 sprigs fresh thyme",
        "Soup:",
        "2 1/2 cups water",
        "1 cup barley",
        "2 tablespoons olive oil",
        "1 onion, diced",
        "2 carrots, sliced",
        "2 stalks celery, sliced",
        "2 cloves garlic, minced",
        "2 cups chopped cooked turkey",
        "1/4 cup chopped fresh parsley",
        "2 sprigs fresh thyme, leaves stripped",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon cayenne pepper",
        "1/2 lemon, juiced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Barley Soup",
    "url": "http://allrecipes.com/recipe/240497/turkey-barley-soup/"
}
