{
    "directions": [
        "In large bowl, combine tomatoes, bread, chocolate, sesame seeds, cinnamon, coriander seeds, black pepper, and cloves. Set aside.",
        "In large, heavy skillet over moderately high heat, heat 2 tablespoons oil until hot but not smoking. Working in about 5 batches and adding 1 tablespoon oil between each batch, fry mulato, pasilla, and ancho chiles until beginning to blister and change color, about 15 seconds per side (do not burn). Using tongs and shaking off excess oil, transfer chiles to large bowl. Add boiling water to cover and let soak until softened, about 45 minutes.",
        "Meanwhile, in same skillet over moderately high heat, heat remaining 2 tablespoons oil until hot but not smoking. Add almonds and sauté until golden, about 4 minutes. Using slotted spoon, transfer to paper towel–lined plate, reserving oil. Add raisins to oil in skillet and sauté until plump, about 2 minutes. Transfer to paper towel–lined plate, again reserving oil. Add onion and garlic to skillet and sauté until softened, about 5 minutes. Remove skillet from heat.",
        "Transfer onion, garlic, almonds, and raisins to bowl with tomato mixture. Add 1/2 cup stock. Transfer mixture to food processor and purée until smooth. Return to skillet and set aside.",
        "When chiles have softened, drain, pat dry, and transfer to food processor. Add chipotle and 1/2 cup stock and purée until smooth.",
        "Transfer chile mixture to skillet with tomato mixture. Stir in remaining 1 cup stock, brown sugar, and salt. Set over moderately high heat and bring to simmer, then reduce heat to moderately low and simmer, uncovered, 10 minutes. Let cool, then use to coat turkey or store in refrigerator up to 3 days."
    ],
    "ingredients": [
        "1 (15-ounce) can chopped tomatoes, drained",
        "1 small, firm white roll, toasted and torn into small pieces",
        "3 ounces Mexican chocolate (such as Ibarra), chopped",
        "1/4 cup sesame seeds, toasted",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon whole coriander seeds, toasted",
        "1/4 teaspoon freshly ground black pepper",
        "1/8 teaspoon ground cloves",
        "About 1/2 cup vegetable oil",
        "16 dried mulato chiles, stemmed, seeded, and deveined (about 8 ounces)",
        "6 pasilla chiles, stemmed, seeded, and deveined (about 2 ounces)",
        "4 ancho chiles, stemmed, seeded, and deveined (about 3 ounces)",
        "1/2 cup whole almonds",
        "1/2 cup raisins",
        "1 small onion, roughly chopped",
        "2 cloves garlic, sliced",
        "2 cups Quick Turkey Stock",
        "1 chipotle chile (canned, from 1 can chipotle chiles in adobo sauce; reserve sauce and remaining chiles for another use)",
        "1 tablespoon (packed) dark brown sugar",
        "1 1/4 teaspoons kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Food Processor",
        "Chocolate",
        "Tomato",
        "Thanksgiving",
        "Raisin",
        "Almond",
        "Spice",
        "Hot Pepper",
        "Fall",
        "Winter",
        "Pan-Fry"
    ],
    "title": "Turkey Mole Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-mole-sauce-240456"
}
