{
    "directions": [
        "In a skillet cook the onion, the bell pepper, the garlic, the jalapeño,and the cumin in the oil over moderately low heat, stirring occasionally, until the vegetables are softened, stir in the corn muffin crumbs and the Monterey Jack, and cook the filling, stirring, until it is combined well and the cheese is melted. Season the filling with salt and pepper and let it cool for 5 minutes. Spread about 3 tablespoons of the filling on each cutlet and roll up each cutlet jelly-roll fashion, tucking in the sides and fastening them with wooden picks. Transfer the roulades, seam sides down, with a spatula to a lightly oiled small baking dish, pour in the broth, and bake the roulades in the middle of a preheated 375°F. oven, basting them occasionally, for 18 minutes, or until the turkey is cooked through. Transfer the roulades with a slotted spoon to 2 heated plates. Pour the cooking liquid through a fine sieve into a small saucepan, add the vinegar and salt and pepper to taste, and boil the sauce until it is thickened slightly. Pour the sauce over the roulades."
    ],
    "ingredients": [
        "1/3 cup minced onion",
        "1/4 cup minced red bell pepper",
        "1/2 teaspoon minced garlic",
        "1 tablespoon minced bottled jalapeño",
        "a pinch of ground cumin",
        "4 teaspoons vegetable oil",
        "1 large corn muffin, crumbled (about 1 cup)",
        "1/4 cup grated Monterey Jack",
        "4 turkey cutlets (about 3/4 pound total), pounded 1/16 inch thick between sheets of dampened plastic wrap",
        "3/4 chicken broth",
        "3/4 teaspoon white-wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pepper",
        "turkey",
        "Bake",
        "Fall",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Turkey Roulades with Corn Bread, Jalapeño, & Monterey Jack Filling",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-roulades-with-corn-bread-jalapeno-monterey-jack-filling-10768"
}
