{
    "directions": [
        "If using turkey wings, halve at joints with a cleaver or large knife, then crack wing bones in several places with back of cleaver or knife. (Do not crack bones if using other parts.) Pat turkey dry.",
        "Put oven rack in lowest position of oven and preheat oven to 500°F. Roast turkey parts, skin sides down, in dry roasting pan, turning over once, until browned well, about 45 minutes. Transfer to an 8- to 10-quart stockpot with tongs, reserving fat in roasting pan.",
        "Add onions (cut sides down), celery, and carrots to fat in pan and roast, stirring halfway through roasting, until golden, about 20 minutes total. Add vegetables to turkey in stockpot.",
        "Straddle pan across 2 burners, then add 2 cups water and deglaze by boiling, stirring and scraping up brown bits, 1 minute. Add deglazing liquid to turkey and vegetables in stockpot, then add parsley, bay leaf, peppercorns, salt, and remaining 4 1/2 quarts water. Reduce heat and gently simmer, partially covered, 3 hours.",
        "Pour stock through a large fine-mesh sieve into a large bowl, discarding solids. Measure stock: If there is more than 13 cups, boil in cleaned pot until reduced to 13 cups. If there is less, add enough water to bring total to 13 cups. If using immediately, let stand until fat rises to top, 1 to 2 minutes, then skim off and discard fat. If not, cool completely, uncovered, then chill, covered, before skimming fat (it will be easier to remove when cool or cold)."
    ],
    "ingredients": [
        "6 lb turkey parts such as wings, drumsticks, and thighs",
        "3 medium yellow onions, left unpeeled, trimmed and halved",
        "3 celery ribs, cut into 2-inch lengths",
        "3 carrots, quartered",
        "5 qt cold water",
        "6 fresh parsley stems (without leaves)",
        "1 Turkish or 1/2 California bay leaf",
        "10 black peppercorns",
        "1 1/2 teaspoons salt",
        "Special equipment: a 17- by 14-inch flameproof roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Poultry",
        "turkey",
        "Vegetable",
        "Christmas",
        "Thanksgiving",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Turkey Stock",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-stock-236436"
}
