{
    "directions": [
        "Make slits in turkey with tip of small sharp knife; put 1 anchovy piece and 1 garlic sliver into each slit. Place turkey in large saucepan or Dutch oven. Add all remaining ingredients. Add water to cover. Bring to boil. Reduce heat, cover partially and simmer until meat thermometer inserted in center of turkey registers 140°F, about 1 hour. Turn off heat and let turkey cool in cooking liquid.",
        "Puree tuna, anchovies, lemon juice and 3 tablespoons capers in processor until very smooth, scraping down sides of work bowl occasionally. With machine running, gradually mix in oil and blend until creamy. Add mayonnaise and just blend using on/off turns (do not overmix).",
        "Remove turkey from broth (reserve broth for another use). Cut off string and pull off turkey skin. Slice turkey into thin rounds. Coat platter with some of sauce. Top with single layer of turkey slices. Spread turkey with more sauce. Sprinkle generously with parsley and capers. Continue layering turkey, sauce, parsley and capers until all of turkey is used. Surround with lemon slices. Cover with plastic; chill turkey and any remaining sauce separately for at least 8 hours. (Can be prepared 2 days ahead.) Let turkey stand at room temperature 1 hour. Serve, passing any remaining sauce separately."
    ],
    "ingredients": [
        "1 3 1/2-pound boned, rolled and tied turkey breast",
        "3 anchovies, cut into 1/2-inch pieces",
        "1 large garlic clove, slivered",
        "2 14 1/2-ounce cans chicken broth",
        "2 cups dry white wine",
        "2 onions, quartered",
        "2 carrots, cut into 2-inch pieces",
        "4 fresh parsley sprigs",
        "2 bay leaves",
        "1 6 1/2-ounce can white meat tuna packed in water, well drained",
        "5 anchovies",
        "3 tablespoons fresh lemon juice",
        "3 tablespoons drained capers",
        "1 1/4 cups extra-virgin olive oil",
        "1 8-ounce jar mayonnaise (1 cup plus 1 tablespoon)",
        "Chopped fresh Italian parsley",
        "Drained capers",
        "2 lemons, halved lengthwise, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fish",
        "Onion",
        "Poultry",
        "turkey",
        "Roast",
        "Tuna",
        "Carrot",
        "White Wine",
        "Summer"
    ],
    "title": "Turkey Tonnato",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-tonnato-2203"
}
