{
    "directions": [
        "Heat the vegetable oil in a large skillet over medium heat; cook the onion and garlic in the hot oil until fragrant, 5 to 7 minutes. Break the turkey into small pieces into the skillet; cook and stir until completely browned, 7 to 10 minutes. Stir the crushed tomatoes, tomato paste, water, basil, fennel seeds, Italian seasoning, 1/4 teaspoon black pepper, and 1/4 cup parsley into the turkey mixture. Reduce heat to medium-low and simmer, stirring occasionally, until the sauce reaches a desired consistency, 60 to 90 minutes.",
        "While the sauce simmers, place the butternut squash in a large, microwave-safe bowl; cover with plastic wrap and cook in microwave on High until tender, about 5 minutes. Set aside.",
        "Cook and stir the spinach in a large skillet over medium heat until wilted, about 5 minutes. Set aside.",
        "Stir the ricotta cheese, egg, 2 tablespoons parsley, 1/4 teaspoon black pepper, and about 2/3 of the mozzarella cheese together in a bowl. Set aside.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Pour 1 1/2 cups of the sauce into the bottom of a 9x13-inch baking dish. Arrange 3 of the lasagna noodles in a layer over the sauce. Spread 1 cup of the ricotta cheese mixture over the noodles. Sprinkle about half of the butternut squash over the ricotta cheese mixture. Layer about half the wilted spinach over the butternut squash. Lay about half the zucchini slices over the spinach in a layer. Repeat the layering. Top with the 3 remaining lasagna noodles. Spread any remaining ricotta cheese mixture over the top of the lasagna. Finish by topping with any remaining sauce mixture. Cover with aluminum foil.",
        "Bake in the preheated oven for 30 minutes. Remove the aluminum foil and sprinkle the remaining mozzarella over the top of the lasagna. Return to oven and bake uncovered until the top is golden brown, about 30 minutes more. Remove and allow the lasagna to rest 15 minutes before cutting to serve."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1 onion, diced",
        "4 cloves garlic, chopped",
        "1 (20 ounce) package ground turkey",
        "1 (28 ounce) can crushed tomatoes",
        "3 (6 ounce) cans tomato paste",
        "1 1/2 cups water",
        "1 1/2 teaspoons dried basil",
        "1 teaspoon fennel seeds",
        "1 teaspoon Italian seasoning",
        "1/4 teaspoon ground black pepper",
        "1/4 cup chopped fresh parsley",
        "3 1/2 cups peeled and cubed butternut squash",
        "1 (10 ounce) package fresh spinach",
        "1 (15 ounce) container fat-free ricotta cheese",
        "1 egg",
        "2 tablespoons chopped fresh parsley",
        "1/4 teaspoon ground black pepper",
        "1 (6 ounce) package shredded part-skim mozzarella cheese, divided",
        "9 no-boil lasagna noodles",
        "2 zucchini, sliced lengthwise"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Lasagna with Butternut Squash, Zucchini, and Spinach",
    "url": "http://allrecipes.com/recipe/214121/turkey-lasagna-with-butternut-squash/"
}
