{
    "directions": [
        "In a saucepan bring the water to a boil, in it cook the squash with salt to taste for 6 to 8 minutes, or until it is just tender, and with a slotted spoon transfer the squash to a bowl of ice and cold water to stop the cooking. In the boiling water cook the lima beans for 3 minutes, or until they are just tender, with the slotted spoon transfer them to the bowl, and reserve 1 cup of the cooking liquid.",
        "In a large saucepan melt the butter over moderate heat, add the flour, and cook the roux, whisking, for 3 minutes. Add the turkey or chicken broth and the reserved cooking liquid in a stream, whisking, add the minced sage and salt and pepper to taste, and simmer the sauce, stirring occasionally, for 10 minutes. Drain the squash and lima beans, stir them into the sauce with the onions and the turkey, and pour the mixture into a 1 1/2-quart shallow baking dish. The potpie may be prepared up to this point 1 day in advance and kept covered and chilled.__",
        "Preheat the oven to 425°F.",
        "Into a bowl sift together the flour, the baking powder, and the salt, add the butter, and blend the mixture until it resembles meal. Stir in the Cheddar and the bacon and stir in enough of the milk to form a soft, sticky dough. Transfer the dough to a pastry bag fitted with a 3/4-inch star tip and pipe it around the edge of the turkey mixture. (Alternatively, the dough may be dropped by rounded tablespoons onto the turkey mixture.)",
        "Bake the potpie in the lower third of the oven for 20 to 25 minutes, or until the crust is golden, and garnish it with the sage sprig."
    ],
    "ingredients": [
        "3 cups water",
        "1 pound peeled seeded butternut squash, cut into 3/4-inch cubes (about 1 1/2 cups)",
        "1 cup thawed frozen baby lima beans",
        "3 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "1 cup turkey broth or chicken broth",
        "2 tablespoons minced fresh sage leaves plus a sage sprig for garnish",
        "5 ounces pearl onions (about 15), blanched in boiling water for 2 minutes, drained, and peeled",
        "3 cups cubed cooked turkey",
        "1 1/4 cups all-purpose flour",
        "1 1/2 teaspoons double-acting baking powder",
        "1/2 teaspoon salt",
        "2 tablespoons cold unsalted butter, cut into bits",
        "5 ounces extra-sharp Cheddar, grated (about 1 1/2 cups)",
        "4 slices of bacon, cooked until crisp and crumbled",
        "1/2 to 2/3 cup milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "turkey",
        "Bake",
        "Cheddar",
        "Bacon",
        "Lima Bean",
        "Butternut Squash",
        "Fall",
        "Sage",
        "Gourmet"
    ],
    "title": "Turkey, Squash, and Lima Bean Potpie with Cheddar Bacon Crust",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-squash-and-lima-bean-potpie-with-cheddar-bacon-crust-10915"
}
