{
    "directions": [
        "In a large bowl, whisk together the flour, salt, and baking powder. Add the shortening and use a pastry blender or 2 forks to cut the shortening into the flour mixture until it resembles a coarse meal. Gradually add the water in 3 batches and use the pastry blender or forks to gently work it into the dough (the dough will be shaggy at first). Transfer to a work surface, and knead the dough until it's hydrated and starting to smooth out, about 5 minutes (the surface of the dough will still appear shaggy; it will smooth out during resting). Wrap the dough in plastic wrap and let it rest at room temperature for 2 hours.",
        "In a heavy large saucepan over moderate heat, melt the butter. Add the onion, garam masala, mustard seeds, cumin seeds, and curry powder and sauté, stirring occasionally, until the mustard seeds begin to pop and the onion is translucent, about 3 minutes. Add the garlic and sauté, stirring occasionally, until fragrant, about 30 seconds. Remove the pan from the heat and add the turkey, mashed potatoes, peas, and hot chiles and stir to combine. Adjust the seasoning as needed with salt and set aside to let cool before filling the samosas.",
        "Divide the samosa dough into 6 equal parts and roll each into a ball. On a lightly floured surface using a lightly floured rolling pin, roll each ball into a circle that measures about 8 inches across and is about 1/8 inch thick. DO AHEAD: The circles of samosa dough can be made ahead, layered between sheets of wax paper, wrapped in a double layer of plastic, and refrigerated for 24 hours or frozen up to 3 months. Defrost before using.",
        "Cut the dough circles in half, so that there are 12 semicircles. Use a pastry brush to lightly brush the flat edge of 1 semicircle with water then fold 1 corner up and over middle. Fold the second corner over to make a triangle, and pinch the corners of the triangle to seal (leave the rounded side open). Hold the triangle in your hand with the open rounded side facing up and let dough fall open to make a cone. Fill with 1/4 cup filling, lightly brush the remaining open edge of the dough with water and then pinch along the rounded side to seal. Repeat with the remaining dough and filling. DO AHEAD: Filled samosas can be frozen, well wrapped in plastic, up to 3 months. Fry them from a partially defrosted state.",
        "Line a large baking sheet with paper towels.",
        "In a heavy large saucepan or Dutch oven over moderate heat, heat the oil until a deep-fry thermometer registers 325°F. Working in batches, fry the samosas until dark golden brown, about 4 minutes. Transfer as done to the paper-towel-lined baking sheet to drain and cool. Continue to fry the remaining samosas, returning the oil to 325°F between batches. Serve hot with the Cilantro-Mint Chutney and/or the mango Chutney, if desired."
    ],
    "ingredients": [
        "4 1/2 cups all-purpose flour",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon baking powder",
        "4 ounces (10 tablespoons) vegetable shortening, preferably trans-fat-free, cut into small pieces",
        "3/4 cup plus 2 tablespoons water",
        "4 tablespoons (1/2 stick) unsalted butter",
        "1/2 small yellow onion, chopped",
        "1 teaspoon garam masala",
        "1 teaspoon brown mustard seeds",
        "1/2 teaspoon black or regular cumin seeds",
        "1/2 teaspoon yellow Madras curry powder",
        "4 large cloves garlic, minced",
        "3 cups chopped cooked turkey or rotisserie chicken",
        "1 cup mashed potatoes",
        "1/2 cup cooked peas or diced green beans",
        "1 or 2 fresh hot red or green chiles, thinly sliced",
        "Fine sea salt",
        "1/2 gallon vegetable or canola oil",
        "Cilantro-Mint Chutney (optional)",
        "Purchased mango chutney (optional)",
        "Equipment: Pastry brush; 1 large baking sheet; deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "turkey",
        "Appetizer",
        "Fry",
        "Thanksgiving",
        "Curry",
        "Deep-Fry",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Turkey Samosas",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-samosas-51197210"
}
