{
    "directions": [
        "Stir oil and flour together in a large, heavy-bottomed pot over medium heat. Cook, stirring slowly and constantly to keep the roux from burning, until the mixture becomes a dark chocolate brown, about 25 minutes. Add the onions, celery, and bell peppers to the roux all at once, and continue to stir until vegetables are wilted, about 5 minutes. Season with salt and cayenne pepper.",
        "Stir in the smoked sausage and bay leaves, and continue to stir for 3 to 4 minutes. Pour in the turkey stock and stir until the stock and roux mixture are well combined. Bring the gumbo to a boil, then reduce heat to medium-low. Cook, uncovered, stirring occasionally, for 1 hour. Stir in the turkey and the file powder; simmer for 2 hours.",
        "About 30 minutes before serving, bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.",
        "Skim off any fat that rises to the surface of the gumbo; remove from heat. Stir in the parsley and green onions. Remove the bay leaves, and serve the gumbo in deep bowls with rice."
    ],
    "ingredients": [
        "1 1/8 cups vegetable oil",
        "1 1/4 cups all-purpose flour",
        "1 1/2 cups chopped onion",
        "1 cup chopped celery",
        "1 cup chopped green bell pepper",
        "1/2 teaspoon salt",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1 pound smoked sausage, cut into 1/2-inch slices",
        "3 bay leaves",
        "6 cups turkey stock",
        "3 1/2 cups coarsely chopped leftover turkey",
        "1 tablespoon file powder",
        "1 cup uncooked white rice",
        "2 cups water",
        "2 tablespoons chopped fresh parsley",
        "1/2 cup chopped green onions"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Gumbo",
    "url": "http://allrecipes.com/recipe/68216/turkey-gumbo/"
}
