{
    "directions": [
        "Place leftover turkey (meat, bones, skin) into a stock pot. Add 1 chopped onion and 2 ribs chopped celery and water or chicken broth (or half of each). Bring to a simmer over high heat; reduce heat to low and continue to cook at a low simmer. Skim off scum as it forms, but don't remove any fat. Cook until broth is rich and any turkey meat has been rendered flavorless, about 3 hours. While broth cooks, skim off fat as it rises to the surface and save it in a bowl. Save about 4 tablespoons turkey fat.",
        "After removing surface fat, strain broth into a bowl.",
        "Lightly whisk 2 eggs in a separate mixing bowl. Add 2 tablespoons cooled rendered turkey fat and whisk to mix. Whisk in salt, pepper, and cayenne. Mix in seltzer water. Add matzo meal and mix with a fork until mixture begins to thicken up, 1 or 2 minutes. Cover bowl with plastic wrap and refrigerate until firm, about 30 minutes.",
        "Heat 2 tablespoons turkey fat in a large pot over medium heat. Add 1 cup diced onions, 1/2 cup diced carrots, 1/2 cup diced celery, and salt. Cook until onions start to turn translucent, 6 or 7 minutes. Add sliced garlic and cook an additional minute. Add turkey broth and bring to a simmer. Simmer until vegetables are tender, about 20 minutes. Check seasoning and adjust salt, if necessary.",
        "Divide matzo ball dough into 8 pieces and roll each into a ball using your wet hands.",
        "Bring a pot of salted cold water to a boil. Gently place matzo balls into the boiling water. Reduce heat so they simmer gently; cover the pot. Simmer until matzo balls are cooked through, about 30 minutes, adjusting heat as they cook so a gentle simmer continues. Transfer to hot serving bowls, 2 per serving.",
        "Stir freshly chopped parsley and dill into soup. Ladle hot soup over the matzo balls."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/3882539.jpg",
    "ingredients": [
        "Turkey Broth:",
        "3 pounds roasted turkey bones and meat scraps, the fattier the better",
        "1 large onion, chopped",
        "2 ribs celery, chopped",
        "2 quarts water or chicken broth, or more to cover bones",
        "Matzo Balls:",
        "2 large eggs, beaten",
        "2 tablespoons rendered melted turkey fat",
        "1 teaspoon fine salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper",
        "2 tablespoons seltzer water or club soda",
        "1/2 cup matzo meal",
        "Soup:",
        "2 tablespoons rendered melted turkey fat",
        "1 cup diced onion",
        "1/2 cup diced carrot",
        "1/2 cup diced celery",
        "1 clove garlic, thinly sliced",
        "6 cups homemade rich turkey broth or chicken broth",
        "salt and pepper to taste",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh dill"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Matzo Ball Soup",
    "url": "http://allrecipes.com/recipe/255022/turkey-matzo-ball-soup/"
}