{
    "directions": [
        "Combine turkey bones, broth and bay leaf in large saucepan. Bring to a boil. Add potato and turnips. Reduce heat, cover and simmer until vegetables are almost tender, about 12 minutes. Remove vegetables using slotted spoon. Simmer broth until reduced to 1 1/2 cups, about 15 minutes. Strain. Cut vegetables into 1/2 inch dice.",
        "Melt butter in heavy large skillet over medium-low heat. Add onions and cook until golden brown, stirring occasionally, about 10 minutes. Increase heat to high and add mushrooms, turnips and potato. Cook until vegtables are golden brown, stirring frequently, about 4 minutes. Add chicken broth and boil until slightly syrupy, about 5 minutes. Mix in turkey and stir to heat through. Remove from heat. Combine cream and yolk. Add to turkey. Mix in 1 teaspoon tarragon. Place over low heat and stir until sauce thickens, about 30 seconds; do not boil. Season with salt and pepper. Sprinkle with minced tarragon and serve."
    ],
    "ingredients": [
        "2 cups 1/2-inch dice skinned roasted turkey or chicken, bones reserved",
        "3 cups unsalted chicken broth",
        "1 bay leaf",
        "1 8-ounce sweet potato, peeled and quarted lengthwise",
        "1/2 pound turnips, peeled and quartered",
        "2 tablespoons (1/4 stick) butter",
        "2 large onions, chopped",
        "4 ounces mushrooms, quartered",
        "1/4 cup whipping cream",
        "1 egg yolk",
        "1 teaspoon minced fresh tarragon or 1/2 teaspoon dried, crumbled",
        "Salt and freshly ground pepper",
        "Minced fresh tarragon or dried, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Sauté",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Turnip",
        "Sweet Potato/Yam",
        "Fall",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Turkey Hash with Sweet Potatoes and Turnips",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-hash-with-sweet-potatoes-and-turnips-102434"
}
