{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Pat turkey legs dry. Stir together flour, salt, and pepper, then dredge 1 leg in flour mixture, knocking off excess. Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown leg, turning occasionally, about 5 minutes, and transfer to a large (17- by 12-inch) roasting pan. Meanwhile, dredge another leg. Continue to prepare, brown, and transfer legs in same manner, adding up to 4 tablespoons oil to skillet as needed.",
        "Add remaining 2 tablespoons oil to skillet, then add onion and anchovies and cook over moderate heat, stirring frequently, until onion is golden and anchovies are dissolved, 7 to 8 minutes. Add wine and boil until reduced by half, about 3 minutes, then stir in broth and tomatoes with their juice.",
        "Pour liquid over turkey legs and cover surface with a sheet of parchment paper, then tightly cover pan with foil. Transfer to oven and braise until meat is very tender, 2 to 2 1/2 hours. Transfer legs to a cutting board and cut them into thigh and drumstick portions, then transfer to a deep platter. Skim off fat from sauce. If sauce measures more than 3 cups, boil until reduced. Season sauce with salt and pepper and pour over turkey.",
        "Stir together garlic, parsley, and zests and sprinkle over turkey just before serving."
    ],
    "ingredients": [
        "5 1/2 to 6 pounds whole fresh turkey legs",
        "1/2 cup all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "6 to 8 tablespoons olive oil",
        "1 large onion, chopped",
        "4 flat anchovy fillets, rinsed, patted dry, and chopped",
        "1 cup dry white wine",
        "2 cups reduced-sodium chicken broth (16 fluid ounces)",
        "1 (14-ounce) can whole tomatoes in juice, drained, reserving juice, and chopped",
        "1 garlic clove, minced",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "1 teaspoon finely grated fresh lemon zest",
        "1 teaspoon finely grated fresh orange zest",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Herb",
        "Onion",
        "Tomato",
        "turkey",
        "Lemon",
        "Parsley",
        "Gourmet"
    ],
    "title": "Turkey Osso Buco",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-ossobuco-237660"
}
