{
    "directions": [
        "Place a rack in the upper third of the oven and preheat oven to 350 degrees F. Line a baking sheet with Reynolds Wrap(R) Aluminum Foil and set aside. In a small bowl, combine bread crumbs and milk. Set aside so the bread can absorb the milk.",
        "In a medium skillet over medium heat, stir together the diced onion, minced garlic and diced bacon. Allow to cook down until the entire mixture is well browned, about 10 minutes. Remove from heat and allow to cool for about 5 minutes.",
        "In a large bowl combine ground turkey, egg, 3 tablespoons ketchup, Worcestershire sauce, salt and pepper flakes. Add the milk-soaked bread; discard any remaining milk. Add the cooked onions, garlic and bacon. Stir together with a large spoon until the mixture is thoroughly combined. Divide the mixture in half and form each portion into an oblong mound on the prepared baking sheet. Top with the bacon strips.",
        "To make the glaze, combine 1/2 cup ketchup, mustard and brown sugar in a small saucepan over medium-low heat. Stir together until the sugar is dissolved and the mixture is just starting to boil. Remove from heat and use a pastry brush to paint a thick layer of glaze onto each loaf.",
        "Bake the meatloaf for about 1 hour or until the internal temperature reaches 160 degrees F. Allow the loaves to rest for about 20 minutes before slicing and serving."
    ],
    "ingredients": [
        "2 slices soft white bread, torn into pieces",
        "1 cup whole milk",
        "1 large yellow onion, diced",
        "1 clove garlic, minced",
        "1 cup diced raw bacon",
        "2 pounds ground turkey breast",
        "1 large egg, beaten",
        "3 tablespoons ketchup",
        "2 tablespoons Worcestershire sauce",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon crushed red pepper flakes",
        "3 strips raw bacon, cut in half",
        "Glaze:",
        "1/2 cup ketchup",
        "3 tablespoons Dijon mustard",
        "1/4 cup light brown sugar, packed",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey and Bacon Meatloaf",
    "url": "http://allrecipes.com/recipe/244912/turkey-and-bacon-meatloaf/"
}
