{
    "directions": [
        "Melt the butter and stir in the flour over medium heat in a heavy skillet or saucepan. Gradually add the broth and stir until thickened. Add salt and simmer the sauce for approximately 4 to 5 minutes.",
        "Add the cream-and-egg-yolk mixture and dissolved gelatin to the sauce. Stir until the ingredients are well blended and the gelatin is thoroughly melted. Do not let the sauce boil after adding the egg yolks. Taste for seasoning and add salt if necessary. Allow this chaudfroid sauce to cook until it is ready to set. Cool.",
        "Arrange the chilled turkey on a rack over a large pan. You may skin the turkey or leave the skin on. If you wish to carve the bird and put the pieces back in place before adding the decorations, remove the skin and breast fillets whole, slice very carefully and replace on the bone. You may also slice the thigh meat if you wish, but for this dish it is better to leave the thighs whole.",
        "Spoon the chaudfroid sauce, which should be all but congealed, over the entire surface of the chilled bird, being careful to cover all visible parts.",
        "When it is completely covered with the sauce, decorate according to your own fancy. Leaves of tarragon or leaf shapes cut from leek or scallion green, truffle slices, flowers cut from pimiento and green pepper can be combined in effective designs. The white of hard-cooked eggs, truffles and other decorative ingredients may be cut into fancy shapes with truffle cutters or vegetable cutters. It is best to work out the design ahead of time and lay out the ingredients you will use for decorating.",
        "When the turkey is decorated, chill again and then brush with or carefully spoon over aspic, which should be syrupy and just about to set. Cool until serving time, arrange on a platter and decorate the platter with chopped set aspic and any greens you desire. Tiny tomatoes stuffed with Salad Russe and glazed with aspic, of stuffed eggs filled with a mixture piped through a pastry bag with a rosette tube, make a pretty, edible decoration.",
        "Serve the Turkey en Chaudfroid with a cold ham and tongue and a selection of whole vegetables vinaigrette. A chilled Meursault or Montrachet goes well with this."
    ],
    "ingredients": [
        "6 tablespoons butter",
        "8 tablespoons flour",
        "3 cups chicken or turkey broth",
        "1 1/2 teaspoons salt",
        "1 cup heavy cream blended with 3 egg yolks",
        "2 envelopes unflavored gelatin dissolved in 1/2 cup cold water",
        "8- to 10-pound poached or roasted turkey, chilled",
        "For decorations: tarragon leaves; green tops of leek and scallions; sliced truffles; black or stuffed olives; pimiento; green pepper; hardcooked eggs",
        "Quick or Beef Aspic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Egg",
        "turkey",
        "Thanksgiving",
        "Fall",
        "House & Garden"
    ],
    "title": "Turkey en Chaudfroid",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-en-chaudfroid-20133"
}
