{
    "directions": [
        "Arrange rack in center of oven and preheat to 425°F. In roasting pan, toss bones with 1/4 cup oil. Roast until well browned, about 20 minutes. Remove from oven and set aside.",
        "In heavy, large pot over moderately low heat, heat remaining 1/4 cup oil until hot but not smoking. Add garlic, onions, celery, and carrots and sauté until golden brown, 16 to 18 minutes. Add peppercorns and continue cooking until aromatic, 2 to 3 minutes. Add brandy and simmer, uncovered, until reduced by half, about 1 minute.",
        "Add turkey bones, chicken stock, and demi-glace and bring to a boil. Reduce heat to low and simmer until thickened and reduced by half, 2 to 2 1/2 hours. Strain, return to pot, and place over moderately low heat. Skim excess fat, then add basil, remove from heat, cover, and let steep 10 minutes.",
        "Strain gravy through cheesecloth-lined sieve into large pot. Stir in salt and keep warm."
    ],
    "ingredients": [
        "3 pounds turkey bones*",
        "1/2 cup canola oil",
        "6 cloves garlic, roughly chopped",
        "2 medium onions, roughly chopped (about 2 1/2 cups)",
        "2 stalks celery, roughly chopped (about 3/4 cup)",
        "2 large carrots, roughly chopped (about 3/4 cup)",
        "4 teaspoons fresh black peppercorns, smashed with back of knife",
        "1 cup brandy",
        "1 gallon chicken stock or low-sodium chicken broth",
        "2 cups veal demi-glace",
        "1/2 bunch fresh basil, for steeping (about 1 1/4 ounces)",
        "2 teaspoons kosher salt",
        "*If turkey bones are unavailable, use chicken backs, or, for more turkey flavor, a combination of chicken backs and turkey necks."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Garlic",
        "turkey",
        "Vegetable",
        "Roast",
        "Thanksgiving",
        "Basil",
        "Brandy",
        "Fall",
        "Simmer"
    ],
    "title": "Turkey Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-gravy-236465"
}
