{
    "directions": [
        "Arrange turkey cutlets in 15x10x2-inch glass baking dish. Spread onion slices in 13x9x2- inch glass baking dish. Mix turmeric, coarse salt, ground coriander, ground cumin, black pepper, white pepper, and hot paprika in small bowl. Sprinkle onion slices with 1 tablespoon spice mixture, then drizzle 2 tablespoons olive oil over, turning onions to coat both sides. Sprinkle remaining spice mixture over both sides of turkey cutlets, rubbing in spice mixture with fingertips to coat. Drizzle 4 tablespoons olive oil over turkey, turning cutlets to coat both sides. Cover and chill onions and turkey at least 4 hours and up to 8 hours.",
        "Prepare barbecue (medium-high heat). Brush grill rack with oil. Brush pita breads with 2 tablespoons oil. Grill onion slices until tender, about 4 minutes per side. Grill turkey cutlets until cooked through, about 3 minutes per side. Grill pita breads until grill marks appear, about 2 minutes per side. Transfer turkey cutlets and onion slices to cutting board and keep pita breads warm. Working in batches, stack several turkey slices and cut thinly crosswise. Repeat stacking and cutting with onion slices. Mix together turkey and onions in large bowl. Place 1 pita bread on each of 8 plates. Top with turkey-onion mixture, then Tomato Relish, Tahini Sauce, and eggplant and serve.",
        "*Eggplant packed in a pickling brine of water, vinegar, salt, herbs, and spices; sold at Middle Eastern markets."
    ],
    "ingredients": [
        "2 1/2 pounds 1/4-inch-thick turkey cutlets",
        "2 onions, cut into 1/4-inch-thick rounds",
        "1 tablespoon turmeric",
        "2 teaspoons coarse kosher salt",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground white pepper",
        "1 teaspoon hot paprika or cayenne pepper",
        "8 tablespoons (about) extra-virgin olive oil, divided",
        "8 whole pita breads",
        "Tomato Relish",
        "Tahini Sauce",
        "1 cup thinly sliced pickled eggplant* or sour dill pickles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "turkey",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Paprika",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Turkey Shawarma with Tomato Relish and Tahini Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-shawarma-with-tomato-relish-and-tahini-sauce-353778"
}
