{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.",
        "Melt butter in a large heavy skillet over medium heat. Saute white onions, green onions, carrots, celery, green and red bell peppers, and garlic until soft, about 10 minutes. Remove from heat.",
        "In a large bowl, combine salt, black pepper, cayenne pepper, nutmeg and cumin. Stir in eggs, ketchup and half-and-half. Blend in vegetable mixture from skillet. Add ground turkey, chicken sausage and bread crumbs. Mix well with hands, then shape into a loaf. Place into greased 9x5 inch loaf pan.",
        "Bake in preheated oven for 50 to 70 minutes, or until cooked through and nicely browned. Let rest for 10 minutes, then serve with gravy.",
        "To make the gravy:  Melt 1 tablespoon butter in a heavy skillet over medium heat. Saute shallots with red and yellow peppers until tender, about 10 minutes. Season with thyme, bay leaf and black pepper. Stir in half-and-half, garlic, beef stock and chicken stock. Increase heat to high, and boil uncovered until liquid is reduced by 1/4, about 10 minutes. Stir in tomatoes and ketchup. Simmer uncovered for 20 minutes. Stir in remaining tablespoon butter, and season to taste with salt and pepper. Strain gravy, discarding bay leaf and thyme before serving."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "2/3 cup minced white onion",
        "3/4 cup minced green onions",
        "1/2 cup minced carrots",
        "1/2 cup minced celery",
        "1/4 cup minced green bell pepper",
        "1/4 cup minced red bell pepper",
        "2 teaspoons minced garlic",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cumin",
        "3 eggs",
        "1/2 cup ketchup",
        "1/2 cup half-and-half cream",
        "1 1/2 pounds ground turkey",
        "1/2 pound chicken sausage",
        "3/4 cup fresh bread crumbs",
        "2 tablespoons butter, divided",
        "4 shallots, minced",
        "1/4 cup minced red bell pepper",
        "1/2 cup minced yellow bell pepper",
        "1 sprig fresh thyme",
        "1 bay leaves",
        "freshly ground black pepper to taste",
        "1/2 cup half-and-half cream",
        "2 tablespoons minced garlic",
        "1 cup beef stock",
        "1 cup chicken stock",
        "2 roma tomatoes - peeled, seeded and chopped",
        "1/2 cup ketchup",
        "salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turkey Meatloaf and Gravy",
    "url": "http://allrecipes.com/recipe/32151/turkey-meatloaf-and-gravy/"
}
