{
    "directions": [
        "Using very sturdy kitchen scissors, cut on either side of the backbone and remove it. With the turkey or chicken skin side down and using a large sturdy knife, place the blade of the knife in the center of the breast bone, lengthwise. Using a meat mallet, firmly whack the knife to partially split the bone. Press the turkey or chicken to flatten slightly. Turn the turkey skin side up and press until flattened. Starting from the neck end, work your hands between the skin and flesh, being careful not to tear the skin. Work your hands as far down the legs as possible",
        "In a small bowl, combine the pepper flakes with all but 1 teaspoon of the garlic paste, the salt, pepper, coriander and 1/2 cup of the oil. Rub half of the mixture under the skin.",
        "Set the turkey on a work surface skin side up and tuck the wing tips behind the shoulders. Using 2 very long metal skewers, pierce the turkey crosswise diagonally, from drumstick through the opposite breast and through the wing forming a big X. Using the third skewer, pierce the turkey sideways through each breast. Rub the remaining paste all over the turkey or chicken and set it in a baking dish. Add the lemon halves, cover with plastic and refrigerate at least 4 hours, preferably overnight.",
        "In another small bowl, combine the yogurt with the chives, oregano and remaining 1 teaspoon garlic paste. Season with salt and pepper and whisk in the remaining 2 tablespoons of oil.",
        "Light a grill and oil the grates. Grill over medium flame for about 1 3/4 to 2 hours, turning occasionally, until lightly charred in spots and an instant read thermometer inserted into the thigh nearest the joint registers 170°.",
        "Let the turkey or chicken rest for 20 minutes before slicing. Serve with the yogurt sauce and Tabbouleh."
    ],
    "ingredients": [
        "1 9-pound whole turkey or chicken",
        "2 tablespoons Aleppo pepper flakes or Korean pepper flakes (gochugaru)",
        "1 head garlic, peeled and mashed to a paste (about 3 tablespoons)",
        "1 1/2 tablespoons kosher salt (Diamond crystal), plus more for seasoning",
        "1 teaspoon freshly ground pepper, plus more for seasoning",
        "1 tablespoon ground coriander",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "2 lemons, halved",
        "2 cups whole milk Greek-style yogurt",
        "2 tablespoons chopped chives",
        "2 tablespoons chopped parsley",
        "2 teaspoons chopped oregano",
        "Tabbouleh for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Poultry",
        "turkey",
        "Yogurt",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Turkish Grilled Turkey or Chicken with Tangy Herbed Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/turkish-grilled-turkey-or-chicken-with-tangy-herbed-yogurt-51237070"
}
