{
    "directions": [
        "Cut bread horizontally in half. Cut out soft insides, leaving 1/2-inch-thick shells. Brush inside of bread shells with 1 tablespoon olive oil.",
        "Crumble sausage into large non-stick broilerproof skillet. Sauté over medium heat until brown, about 5 minutes. Transfer sausage to bowl. Add onion, zucchini, bell pepper, tomato and garlic to skillet and sauté until vegetables are tender and liquid evaporates, about 9 minutes. Mix in basil. Cool briefly.",
        "Preheat broiler. Beat eggs in large bowl to blend. Season with salt and pepper. Mix in sausage, then vegetable mixture. Heat remaining 2 tablespoons oil in same skillet over medium heat. Pour in egg mixture. Cover and cook until almost set, occasionally lifting edges to allow uncooked eggs to flow underneath, about 7 minutes.",
        "Sprinkle top of frittata with Parmesan. Broil until eggs are set in center and golden brown, about 3 minutes. Run spatula around edge of skillet to loosen frittata and slide into bottom shell of bread over, pressing to fit. Press top half of bread over. Cut into wedges and serve or wrap in foil and serve within 1 hour."
    ],
    "ingredients": [
        "1 10- to 12-inch round French bread or sheepherder's bread",
        "3 tablespoons olive oil",
        "1/2 pound spicy Italian turkey sausages, casings removed",
        "1 onion, chopped",
        "2 zucchini, trimmed, diced",
        "1 green bell pepper, diced",
        "1 large tomato, seeded, diced",
        "3 garlic cloves, chopped",
        "1/4 cup chopped fresh basil",
        "10 large eggs",
        "1/3 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Egg",
        "Poultry",
        "turkey",
        "Vegetable",
        "Basil",
        "Zucchini",
        "Summer",
        "Dallas",
        "Texas"
    ],
    "title": "Turkey Sausage and Vegetable Frittata Sandwich",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-sausage-and-vegetable-frittata-sandwich-276"
}
