{
    "directions": [
        "Finely chop onion, carrots, celery, and bell pepper. Mince garlic.",
        "In a large heavy non-stick skillet melt butter with oil over moderate heat until foam subsides and cook turkey, stirring and breaking up lumps, until just cooked through, about 3 minutes. With a slotted spoon transfer turkey to a bowl and in fat remaining in skillet cook chopped vegetables, garlic, rosemary, oregano, and salt and pepper to taste over moderate heat, stirring occasionally, until vegetables are just softened, about 4 minutes. Add wine and cook until most of liquid is evaporated. Stir in 1 can tomatoes with purée, tomato paste, broth, and cinnamon and simmer 15 minutes. Add turkey with any juices in bowl and remaining can tomatoes with purée and simmer, stirring, 15 minutes. Season sauce with salt and pepper and keep warm, covered. Sauce may be made 1 day ahead and cooled, uncovered, before being chilled, covered. Reheat sauce over low heat.",
        "Fill a 6-quart kettle three fourths full with salted water and bring to a boil for pasta. Cook pasta in boiling water until al dente. Drain pasta in a colander and in a serving bowl toss pasta with sauce."
    ],
    "ingredients": [
        "1 medium onion",
        "2 carrots",
        "1 celery rib",
        "1 red bell pepper",
        "3 garlic cloves",
        "1 teaspoon unsalted butter",
        "1 teaspoon olive oil",
        "1 pound lean ground turkey",
        "1 teaspoon dried rosemary, crumbled",
        "1/4 teaspoon dried oregano, crumbled",
        "1/2 cup dry red wine",
        "two 14-ounce cans crushed tomatoes in thick purée",
        "1 tablespoon tomato paste",
        "1 3/4 cups beef broth (14 fluid ounces)",
        "2 pinches cinnamon, or to taste",
        "1 pound dried spiral-shaped pasta such as fusilli (long spiral spaghetti)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "turkey",
        "Low Fat",
        "Kid-Friendly",
        "Back to School",
        "Gourmet"
    ],
    "title": "Turkey Ragù with Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-ragu-with-pasta-101058"
}
