{
    "directions": [
        "For the sauce: In a blender or food processor, combine the peppers with the stock, garlic, onions, cilantro and some salt and pepper, then puree. In a saucepot over medium heat, melt the butter, then whisk in the flour. Add the milk and cream and raise the heat a bit. Add the poblano puree and simmer to thicken and cook the sauce, 20 to 25 minutes.",
        "For the casserole: Heat the EVOO in a large skillet over medium-high heat; add the butter and melt into the oil. Brown the mushrooms, about 10 minutes. Then add the corn and shallots, and cook to lightly brown the corn and soften the shallots, about 5 minutes more. Add the turkey and stock and heat through.",
        "Char the tortillas over an open flame on a gas burner, or in dry skillet.",
        "Layer half the turkey, mushrooms and corn in a casserole dish, and top with half the sauce, cheese and a shingled layer of 3 tortillas. Top the tortillas with the remaining turkey, mushrooms and corn, tortillas, sauce and cheese. Cool and store for a make-ahead meal, or bake to serve. Bake at 400 degrees F from room temperature until heated through and brown and bubbly."
    ],
    "ingredients": [
        "3 medium poblano peppers, seeded and stemmed, chopped",
        "1 cup chicken stock",
        "2 cloves garlic, chopped",
        "1 small onion, chopped",
        "A small handful fresh cilantro leaves, plus a few leaves for garnishing",
        "Salt and freshly ground black pepper",
        "3 tablespoons butter",
        "2 tablespoons flour",
        "1 cup milk",
        "1/2 cup heavy cream or Mexican crema",
        "2 tablespoons EVOO",
        "3 tablespoons butter",
        "12 ounces sliced button or crimini mushrooms",
        "2 cups fresh (about 4 ears) or frozen and defrosted corn kernels",
        "2 shallots or 1 small red onion, chopped",
        "4 to 5 cups chopped cooked turkey meat",
        "1 cup chicken stock",
        "Six 8-inch flour tortillas",
        "2 1/2 cups shredded Monterey Jack or Cheddar",
        "1 1/2 cups shredded Manchego cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Casserole",
        "Poultry Recipes",
        "Turkey Recipes",
        "Corn Recipes",
        "Vegetable",
        "Mushroom",
        "Main Dish Recipes",
        "Holiday",
        "Cinco de Mayo"
    ],
    "title": "Turkey, Mushroom and Corn Mexican Casserole",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/turkey-mushroom-and-corn-mexican-casserole-recipe"
}
