{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Toast bread cubes on a baking sheet until dry and just beginning to brown around edges, 12 to 15 minutes",
        "Simmer cranberries in water (1/2 cup) in a small heavy saucepan over low heat, uncovered, stirring once or twice, until cranberries are tender and all of water is absorbed, about 8 minutes. Remove from heat.",
        "Cook celery, onion, garlic, 1 teaspoon sage, 1/4 teaspoon salt, and 3/4 teaspoon pepper in 2 tablespoons butter in a 12-inch heavy skillet over moderate heat, stirring occasionally, until vegetables are softened, about 3 minutes. Transfer to a small bowl. Wipe skillet clean.",
        "Pat livers dry and sprinkle with 1/4 teaspoon salt and 3/4 teaspoon pepper. Heat 2 tablespoons butter in cleaned skillet over high heat until foam subsides, then sauté livers until edges are browned but livers are still pink inside, about 3 minutes. Transfer with a slotted spoon to a cutting board, reserving pan juices, and cool completely, then cut into 1/4-inch dice.",
        "Whisk together egg and milk in a large bowl, then stir in toasted bread cubes, cranberries, onion mixture, livers, reserved pan juices, 1/4 teaspoon salt, and 3/4 teaspoon pepper. Let stand at room temperature until bread has absorbed all of liquid and stuffing is completely cool, about 10 minutes.",
        "Leave oven rack in middle position and preheat oven to 450°F.",
        "Arrange turkey, skin side up, on a work surface with narrower, pointed end nearest you. Determine which long side of the breast is thickest, then, starting from that side and holding knife parallel to work surface, cut breast horizontally almost in half, stopping 1 inch from other side. Open breast like a book and put between 2 sheets of plastic wrap.",
        "Pound turkey to 1-inch thickness with flat side of a meat pounder or with a rolling pin. Discard top sheet of plastic wrap and pat turkey dry. Arrange with a short side nearest you and sprinkle with 1/4 teaspoon salt and 3/4 teaspoon pepper.",
        "Spread stuffing evenly over turkey, leaving a 1-inch border on all sides. Fold short end nearest you over stuffing to enclose, gently pressing on stuffing, then roll up breast tightly.",
        "Arrange rolled turkey breast seam side down, then tie crosswise at 1-inch intervals with string. Brush turkey with melted butter (1 tablespoon), then sprinkle with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper.",
        "Roast turkey, seam side down, in a 13- by 9- by 2-inch roasting pan, uncovered, until golden brown, about 30 minutes.",
        "Add Sherry, soy sauce, cloves, bay leaf, 1 cup cider, and remaining teaspoon sage to roasting pan. Cover roasting pan with heavy-duty foil and continue roasting until thermometer inserted diagonally 2 inches into center of roulade registers 170°F, 35 to 45 minutes more. Transfer turkey to a cutting board and let stand, loosely covered with foil, 15 minutes before slicing. (Internal temperature will rise to 180°F.)",
        "Pour juices from roasting pan through a fine-mesh sieve into a small heavy saucepan. Skim off fat and bring to a boil.",
        "Whisk together cornstarch and remaining 1/4 cup cider, then whisk into boiling sauce and boil, whisking, until slightly thickened, 1 to 2 minutes.",
        "Slice turkey and serve with sauce."
    ],
    "ingredients": [
        "2 cups diced (1/4 inch) firm white sandwich bread (from 4 slices)",
        "1 cup dried cranberries",
        "1/2 cup water",
        "1/2 cup diced (1/4 inch) celery",
        "1/2 cup finely chopped onion",
        "1 teaspoon finely chopped garlic",
        "2 teaspoons finely chopped fresh sage",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon black pepper",
        "1/2 stick (1/4 cup) unsalted butter at room temperature plus 1 tablespoon melted",
        "1/2 lb chicken livers, trimmed",
        "1 large egg",
        "1/4 cup whole milk",
        "1 (4 1/2- to 5-lb) boneless turkey breast half with skin",
        "1/2 cup medium-dry Sherry",
        "1/3 cup soy sauce",
        "2 whole cloves",
        "1 Turkish or 1/2 California bay leaf",
        "1 1/4 cups apple cider (preferably unfiltered)",
        "1 tablespoon cornstarch",
        "Special equipment: kitchen string; heavy-duty foil; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Poultry",
        "turkey",
        "Vegetable",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Cranberry",
        "Apple",
        "Meat",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Turkey Roulade with Cider Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-roulade-with-cider-sauce-236408"
}
