{
    "directions": [
        "In a small skillet heat the oil over moderately high heat until it is hot but not smoking, in it cook the tortillas, 1 at a time, for 5 seconds, or until they are softened but not crisp, and transfer them with tongs, letting the excess oil drip off, to paper-towel-lined baking sheets to drain. On each tortilla mound 1/4 cup of the turkey, 1 tablespoon of the Cheddar, 1 tablespoon of onion, and 1 teaspoon of the chopped coriander, roll up the tortillas jelly-roll fashion, and arrange the enchiladas, seam sides down, in a shallow 3-quart baking dish. Pour the chili sauce over the enchiladas, sprinkle the enchiladas with the remaining 2 1/4 cups Cheddar, and bake them in a preheated 350°F. oven for 15 to 20 minutes, or until the cheese is bubbly. Sprinkle the enchiladas with the remaining chopped coriander. Serve the enchiladas with the avocado, peeled and diced, and the coriander sprigs.",
        "In a large saucepan simmer the chilies, the onion, and the garlic in the water for 20 minutes. Transfer half the chilies, the onion, and the garlic with tongs to a blender, add 3/4 cup of the cooking liquid, and purée the mixture until it is smooth. Force the purée through a sieve into a bowl, pressing hard on the solids with a spoon. Repeat the procedure with the remaining chilies and 3/4 cup of the remaining cooking liquid, stir in salt to taste, and discard the remaining cooking liquid. The sauce may be made 2 weeks in advance and kept covered and chilled.",
        "Makes about 3 1/2 cups."
    ],
    "ingredients": [
        "1/2 cup vegetable oil",
        "twelve 6- to 7-inch corn tortillas",
        "3 cups 1/3-inch pieces cooked turkey or chicken",
        "10 ounces extra-sharp Cheddar, grated (about 3 cups)",
        "1 cup finely chopped red onion",
        "1/3 cup finely chopped fresh coriander plus coriander sprigs for  garnish",
        "2 cups red chili sauce or two 10-ounce cans enchilada  sauce",
        "2 avocados (preferably California) for garnish",
        "3 ounces (about 15) dried New Mexican red chilies (available at some  specialty foods shop, stemmed and seeded (wear rubber gloves)",
        "1 large onion, halved",
        "1 large garlic clove",
        "6 cups water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Onion",
        "turkey",
        "Bake",
        "Cheddar",
        "Avocado",
        "Gourmet"
    ],
    "title": "Turkey Enchiladas with Red Chili Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-enchiladas-with-red-chili-sauce-13316"
}
