{
    "directions": [
        "Preheat oven to 350°F. Stack tortillas and wrap in foil. Warm in oven until heated through, about 15 minutes.",
        "Meanwhile, heat oil in 12-inch ovenproof skillet over medium heat. Add onion and sauté until soft, about 5 minutes. Stir in enchilada sauce, 2 tablespoons cilantro, and chopped chiles. Simmer over medium heat 5 minutes to blend flavors, stirring often.",
        "While enchilada sauce simmers, mix turkey, 1/2 cup bell peppers, 2 tablespoons cilantro, and 1 teaspoon adobo sauce in small bowl. Unwrap tortillas and arrange in single layer on work surface. Fill each tortilla with about 1/4 cup turkey mixture and roll up.",
        "Preheat broiler. Place enchiladas, seam side down, in simmering sauce, spooning some sauce over each. Remove from heat. Sprinkle with cheese and remaining 1/4 cup bell peppers. Place skillet in broiler and cook until enchiladas are heated through and cheese is melted, about 4 minutes.",
        "Sprinkle enchiladas with remaining 2 tablespoons cilantro and serve."
    ],
    "ingredients": [
        "8 6-inch-diameter corn tortillas",
        "2 tablespoons olive oil",
        "1 medium onion, coarsely chopped",
        "1 16-ounce can or jar enchilada sauce",
        "6 tablespoons chopped fresh cilantro, divided",
        "2 teaspoons chopped canned chipotle chiles plus 1 teaspoon adobo sauce",
        "2 cups (about 10 ounces) diced roasted turkey",
        "3/4 cup 1/3-inch dice assorted red, green, yellow, and/or orange bell peppers, divided",
        "1 cup (packed) grated Monterey Jack cheese or Mexican-style cheese blend (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Poultry",
        "turkey",
        "Broil",
        "Sauté",
        "Bell Pepper",
        "Hot Pepper",
        "Fall",
        "Winter",
        "Cilantro",
        "Tortillas"
    ],
    "title": "Turkey Enchiladas Adobo",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-enchiladas-adobo-109175"
}
