{
    "directions": [
        "Coarsely chop enough escarole to measure about 7 cups loosely packed and reserve remaining escarole. In a 12-inch skillet heat 2 tablespoons oil over moderately high heat until hot but not smoking and sauté onion, stirring occasionally, until it begins to brown. To onion add chopped escarole and cook, stirring frequently, until wilted. Stir in raisins and 1/2 cup broth and cook over high heat until most liquid is evaporated. Remove skillet from heat and stir Parmesan, pine nuts, and bread into filling.",
        "Put turkey on a long sheet of plastic wrap. Butterfly turkey breast: Beginning from a long side make a horizontal lengthwise cut almost but not all the way through turkey and spread turkey open to form a larger, thinner piece of meat. Top turkey with another sheet of plastic wrap and pound with a meat mallet or bottom of a heavy skillet until meat measures about 12 by 8 inches, being careful not to make any holes in it.",
        "Discard top sheet of plastic wrap and arrange prosciutto, overlapping slightly, in one layer over turkey. Spread a 1/2-inch-thick layer of filling over prosciutto, leaving a 1/2-inch border all around and reserving any remaining filling. Beginning with a long side and using plastic wrap as a guide, roll up turkey and turn it seam side down (discard plastic wrap). Tie rolled turkey with kitchen string lengthwise and them crosswise at 1-inch intervals and season with salt and pepper.",
        "In a 12-inch deep skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and brown turkey, turning it. Add wine, remaining cup broth, and any remaining filling and braise, covered, over moderately low heat, turning turkey halfway through cooking, 35 minutes. Transfer turkey to a cutting board and cool. Strain braising liquid through a sieve into s small saucepan. Boil liquid until reduces to about 1/2 cup and skim off foam. Stir in lemon juice and cool sauce completely. Turkey and sauce may be made 2 days ahead and chilled separately, covered with plastic wrap.",
        "Discard string from turkey and cut turkey crosswise into 1/2-inch-thick slices. Shred reserved escarole and in a bowl toss with half of sauce. Arrange escarole on a platter with turkey slices and drizzle turkey with remaining sauce."
    ],
    "ingredients": [
        "1 large head escarole (about 1 1/2 pounds), washed well and drained",
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "1/2 cup raisins",
        "1 1/2 cups low-salt chicken broth",
        "1/3 cup freshly grated Parmesan cheese",
        "1/4 cup pine nuts, toasted",
        "1 slice homemade-type white bread, minced (about 1/2 cup coarse bread crumbs)",
        "1 skinless boneless turkey breast half (2 to 2 1/2 pounds)",
        "1/4 pound thinly sliced prosciutto",
        "1/2 cup dry white wine",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Braise",
        "Sauté",
        "Parmesan",
        "Raisin",
        "Pine Nut",
        "White Wine",
        "Prosciutto",
        "Escarole",
        "Boil",
        "Gourmet"
    ],
    "title": "Turkey Breast Braciola",
    "url": "http://www.epicurious.com/recipes/food/views/turkey-breast-braciola-14417"
}
