{
    "directions": [
        "Place chicken, onions, garlic, ginger, bay leaves, turmeric, peppercorns, coriander seeds, and several pinches of salt in a large pot. Pour in cold water to cover and bring to a boil over medium heat. Reduce heat and gently simmer until an instant-read thermometer inserted into the thickest part of breast registers 155°F, 30–35 minutes. Transfer chicken to a plate and let cool slightly; keep stock simmering. Remove skin from chicken; discard. Pull meat from bones and shred into bite-size pieces; set aside. Return bones and carcass to stock. Increase heat and bring stock to a boil; cook until reduced by about one-third, 15–20 minutes. Season with more salt if needed.",
        "Strain stock into a large saucepan; discard solids. Add carrots, bring to a simmer, and cook until carrots are tender, about 5 minutes.",
        "Meanwhile, cook noodles in a large pot of boiling salted water, stirring occasionally, until al dente; drain and rinse under cold water to stop cooking.",
        "Divide noodles among bowls. Add shredded chicken meat to stock and cook just until heated through; season stock with more salt if needed. Ladle over noodles. Top soup with scallions and drizzle with chili oil."
    ],
    "ingredients": [
        "1 (3 1/2–4-pound) chicken",
        "2 medium onions, unpeeled, quartered",
        "2 heads of garlic, halved crosswise",
        "1 (4-inch) piece ginger, unpeeled, thinly sliced",
        "3 dried bay leaves",
        "1 tablespoon ground turmeric",
        "2 teaspoons black peppercorns",
        "2 teaspoons coriander seeds",
        "Kosher salt",
        "12 ounces carrots (about 4 medium), peeled, cut into 1/2-inch pieces on a diagonal",
        "8 ounces dried udon noodles\tscallions, very thinly sliced",
        "Chili oil (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Noodle",
        "Ginger",
        "Coriander",
        "Garlic",
        "Carrot",
        "Healthy",
        "Dinner"
    ],
    "title": "Turmeric-Ginger Chicken Soup",
    "url": "http://www.epicurious.com/recipes/food/views/turmeric-ginger-chicken-soup"
}
