{
    "directions": [
        "Peel the turnips (thickly, if they are large and mature) and slice them into rounds about 1/4 inch thick. Bring 3 quarts of water to a boil; then add 2 teaspoons salt and the turnips. Cover the pot and cook for 1 minute; then drain.",
        "Melt 3 tablespoons of the butter in a soup pot with 1/2 cup water. Add the leeks, the blanched turnips, the thyme, and 1 teaspoon salt. Stew them, covered, over medium-low heat for 5 minutes, and then add the milk. Slowly heat it without bringing it to a boil, and cook, stirring occasionally, until the turnips are completely tender.",
        "Cool the soup briefly; then purée it in a blender. If necessary, thin it with additional milk or water. Season to taste with salt, if needed, and freshly ground pepper.",
        "Sort through the turnip greens and remove any that are bruised or especially tough looking, and wash them. Melt the remaining 2 tablespoons of butter in a pan, add the turnip greens, and cook them over medium heat until they are tender, about 5 to 10 minutes. Season with salt and pepper. Remove the cooked greens to a cutting board and chop them, roughly or fine, as you prefer; then add them to the soup and serve. Or garnish with fresh chopped thyme."
    ],
    "ingredients": [
        "None is needed for this soup",
        "1 1/2 pounds small turnips (about 1 to 2 inches across), weighed without their greens",
        "Salt",
        "5 tablespoons butter, in all",
        "2 to 3 leeks, white parts only (about 8 ounces), sliced",
        "6 branches thyme or 1/4 teaspoon dried thyme",
        "4 cups milk",
        "White or black pepper",
        "About 2 to 3 cups turnip greens",
        "Fresh chopped thyme for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Appetizer",
        "Vegetarian",
        "Lunch",
        "Root Vegetable",
        "Turnip",
        "Fall",
        "Winter",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Turnip Soup with Turnip Greens",
    "url": "http://www.epicurious.com/recipes/food/views/turnip-soup-with-turnip-greens-368511"
}
