{
    "directions": [
        "In a small mixing bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.",
        "Heat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter and stir until melted; let cool until lukewarm.",
        "In a large mixing bowl, combine the yeast mixture with the cooled milk, butter, egg, 2 cups flour and salt; beat well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Cover dough and let rest for 10 minutes.",
        "Divide dough into seven pieces. One round 2 inches in diameter, five rounds 1 inch in diameter and the remainder in one large round.",
        "Place the large round on a lightly greased cookie sheet and flatten slightly. Shape four of the 1 inch rounds into 'feet' and one into a 'tail' for the turtle. Shape the two inch round into a 'head' for the turtle Attach each piece by flattening the end which attaches to the body, wetting it slightly with water and pinching it under the turtle's 'body'. Press raisins into the turtle's head for 'eyes'.",
        "Cover the turtle with as damp cloth and let rise for 20 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).",
        "With a sharp knife, make crisscross cuts in the turtle's body to make the 'shell'. Finally, use a scissors to make a cut for the turtle's mouth. Bake at 400 degrees F (200 degrees C) for 20 to 25 minutes, or until golden brown."
    ],
    "ingredients": [
        "1 (.25 ounce) package instant yeast",
        "1 tablespoon white sugar",
        "1/2 cup warm water (110 degrees F)",
        "1/2 cup hot milk",
        "1 tablespoon butter",
        "1 egg",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1/4 tablespoon raisins for decorating"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Turtle Bread",
    "url": "http://allrecipes.com/recipe/17655/turtle-bread/"
}
