{
    "directions": [
        "Coat a large wide pot with olive oil over medium heat and add the onions. Season with salt and crushed red pepper, to taste, and cook until the onions are soft and very aromatic, about 8 to 10 minutes. Toss in the garlic and cook for 2 to 3 more minutes. Add the wine and cook until it has reduced by half. Stir in the tomatoes, season with salt, to taste, and cook until the tomatoes are really soft and juicy, about 12 to 15 minutes. Toss in the whole basil leaves.",
        "Working in batches, carefully puree the tomatoes in a blender*. Return the tomato puree to the pot and add the tomato juice and the bread. Cook the soup over medium heat for until the bread has completely lost its shape and the soup is really thick, about 20 minutes. Taste the soup and adjust the seasoning, if needed.",
        "Ladle the soup into bowls and serve garnished with grated cheese, basil chiffonade and a drizzle of big fat finishing oil."
    ],
    "ingredients": [
        "Extra virgin olive oil, plus high quality finishing oil, for garnish",
        "1 large red onion, diced",
        "Kosher salt",
        "Pinch crushed red pepper flakes",
        "3 garlic cloves, smashed and finely chopped",
        "1 cup white wine",
        "2 pounds ripe summer tomatoes, diced",
        "10 basil leaves, half whole and half cut into chiffonade",
        "2 cups tomato juice",
        "2 cups day-old Italian bread, crusts removed and cubed",
        "1/2 cup grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Tomato Soup",
        "Vegetable Soup",
        "Soup",
        "Tomato",
        "Vegetable",
        "Healthy",
        "Italian",
        "Low-Cholesterol",
        "Low Calorie",
        "Low-Fat",
        "Heart-Healthy",
        "High Fiber"
    ],
    "title": "Tuscan Tomato and Bread Soup - Pappa al Pomodoro",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/tuscan-tomato-and-bread-soup-pappa-al-pomodoro-recipe"
}
