{
    "directions": [
        "Rinse and pat tuna steaks dry. Place zest on top of cutting board. Pile rosemary and parsley leaves on top of zest. Pile garlic and some coarse salt and black pepper or grill seasoning on top of herbs. Finely chop the garlic, herbs, and spices. Drizzle the olive oil over the tuna steaks just enough to coat each side. Rub herb and garlic mixture into fish, coating pieces evenly on each side. Let stand 10 minutes.",
        "Grill tuna steaks 6 minutes on each side or 4 minutes on each side, if you prefer pink tuna at the center. Cook steaks over: high setting on indoor electric grill, medium high heat on outdoor gas grill or, 6 inches from hot, prepared charcoal.",
        "Combine first 4 ingredients in a bowl or large food storage plastic bag. Coat mushroom caps evenly in marinade.",
        "Place mushroom caps on the grill cap-side-up and season with grill seasoning or salt and pepper. If you are using an indoor tabletop electric grill, preheat to 400 degrees F or \"high\" setting. If you are using an outdoor gas grill, preheat to medium high; for a charcoal grill, prepare coals and cook mushrooms 6 inches from hot coals. Mushrooms will cook 4 to 6 minutes on each side. Cook mushrooms covered or under tin foil tent and turn occasionally.",
        "Combine tomatoes, rosemary, and smoked mozzarella. Drizzle with oil and toss.",
        "Fill mushroom caps with tomato mixture and top with sliced mozzarella. The mushrooms will look like small pizzas. Place caps in oven at 425 degrees F until cheese melts or you can close grill lid or replace tin foil tent over mushroom caps to melt cheese, it will take 1 to 3 minutes. Serve as-is or, place stuffed caps on garlic toast or sliced crusty bread to catch the juices."
    ],
    "ingredients": [
        "4 fresh tuna steaks, 8 ounces each, 1-inch thick",
        "1 lemon, zested",
        "3 sprigs fresh rosemary, about 2 tablespoons leaves stripped from stem",
        "Handful flat leaf parsley",
        "3 cloves garlic, crushed",
        "Coarse salt and black pepper or grill seasoning",
        "Extra-virgin olive oil, for cooking",
        "Stuffed Portobellos, recipe follows",
        "Serving suggestions: Mixed green salad dressed with oil and vinegar",
        "2 tablespoons balsamic vinegar",
        "1 large lemon, juiced",
        "2 teaspoons Worcestershire sauce",
        "2 tablespoons extra-virgin olive oil, plus more, for drizzling",
        "4 medium to large portobello mushroom caps",
        "Coarse salt and black pepper, or grill seasoning spice blend",
        "3 large, firm plum tomatoes, seeded and diced",
        "2 sprigs fresh rosemary, leaves finely chopped to about 2 tablespoons",
        "1/2 pound fresh smoked mozzarella, thinly sliced",
        "Serving suggestions: Garlic toasts or grilled crusty bread"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Grilling Recipes",
        "Grilling",
        "Grilled Steak",
        "Steak",
        "Italian",
        "Fish",
        "Tuna Recipes",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Mozzarella Recipes"
    ],
    "title": "Tuscan-Style Grilled Tuna Steaks",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/tuscan-style-grilled-tuna-steaks-recipe"
}
