{
    "directions": [
        "Soak beans in cold water to cover by 2 inches in a bowl at room temperature at least 8 hours, or quick-soak (see cooks' note, below). Drain in a colander.",
        "Cook pancetta in oil in a wide 6- to 8-quart heavy pot over moderate heat, stirring occasionally, until browned, about 5 minutes. Transfer pancetta with a slotted spoon to paper towels to drain.",
        "Cook onion and fennel in oil remaining in pot over moderate heat, stirring occasionally, until softened, 6 to 8 minutes. Add garlic and cook, stirring, 1 minute. Add beans, stock, water, cheese rind, bay leaf, and pepper and simmer, uncovered, until beans are tender, 45 minutes to 1 hour. Discard cheese rind and bay leaf.",
        "Stir in Swiss chard and salt and simmer, uncovered, stirring occasionally, until chard is tender, 8 to 10 minutes. Season soup with salt and pepper."
    ],
    "ingredients": [
        "1 lb dried white beans such as Great Northern, cannellini, or navy (2 cups), picked over and rinsed",
        "1/4 lb sliced pancetta, chopped",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1 fennel bulb (sometimes called anise), stalks discarded and bulb chopped",
        "4 garlic cloves, finely chopped",
        "4 cups \">chicken stock or low-sodium chicken broth (32 fl oz)",
        "4 cups water",
        "1 (3- by 2-inch) piece Parmigiano-Reggiano rind",
        "1 Turkish or 1/2 California bay leaf",
        "1/4 teaspoon black pepper",
        "1/2 lb Swiss chard (preferably red or rainbow), stems discarded and leaves halved lengthwise, then thinly sliced crosswise",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Pork",
        "Low/No Sugar",
        "Bacon",
        "Fall",
        "Winter",
        "Chard",
        "Gourmet"
    ],
    "title": "Tuscan Bean and Swiss Chard Soup",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-bean-and-swiss-chard-soup-109022"
}
