{
    "directions": [
        "Break down carcass into smaller pieces. Simmer carcass, water, reserved leek greens, and 1/2 teaspoon salt in a 7- to 10-quart heavy pot, uncovered, skimming froth, 3 hours.",
        "Discard large bones with a slotted spoon or tongs, then strain stock through a large sieve into a large bowl (discard solids).",
        "If stock measures less than 10 cups, add water. If it measures more, boil until reduced.",
        "If using stock right away, let stand until fat rises to top, 1 to 2 minutes, then skim off and discard fat. If not, chill (covered once cool) before removing fat. (It will be easier to remove when cool or cold.)",
        "Cook garlic in oil in cleaned pot over medium heat, stirring, until pale golden, about 1 minute. Add onion and 1/4 teaspoon salt and cook, stirring occasionally, until golden, 5 to 8 minutes. Stir in chopped leeks and rosemary and cook, covered, stirring occasionally, until leeks are softened, about 5 minutes. Add carrots, celery, and 1/4 teaspoon salt and cook, stirring occasionally, 3 minutes. Stir in tomatoes and stock and simmer, uncovered, stirring occasionally, until vegetables are tender, about 20 minutes. Season with salt and pepper.",
        "Stir in pasta and briskly simmer soup, stirring occasionally, until pasta is al dente. Add spinach and stir until wilted."
    ],
    "ingredients": [
        "Carcass from a 12- to 14-pound roast turkey, including skin, or 6 pound turkey wings",
        "4 quarts water",
        "2 medium leeks, greens reserved and white and pale green parts washed (see Cooking Tips) and chopped",
        "6 large garlic cloves, finely chopped",
        "1/4 cup olive oil",
        "1 medium onion, chopped",
        "1 1/2 tablespoons chopped rosemary",
        "3 carrots, chopped",
        "3 celery ribs, chopped",
        "1 (28-ounce) can whole tomatoes in juice, drained and chopped",
        "8 ounces dried egg pasta squares (such as Cipriani brand tagliardi), or dried no-boil egg lasagne sheets (such as Barilla), broken into roughly 1- to 1 1/2-inch pieces",
        "5 to 8 ounces baby spinach",
        "grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Onion",
        "Pasta",
        "Tomato",
        "turkey",
        "Thanksgiving",
        "Dinner",
        "Rosemary",
        "Leek",
        "Spinach",
        "Party",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Tuscan Turkey Soupy Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-turkey-soupy-noodles-358113"
}
