{
    "directions": [
        "Combine the first 4 ingredients in a blender; purée until smooth. With machine running, slowly add oil, drop by drop, to make a creamy dressing. Transfer dressing to a bowl and stir in 1/4 cup Parmesan. Season to taste with salt and pepper. Cover and chill. DO AHEAD: Dressing can be made 2 days ahead. Keep chilled.",
        "Separate egg white from yolk. Place egg white in a coarse-mesh strainer set over a bowl. Press egg white through strainer with the back of a spoon; scrape egg white from bottom of strainer. Repeat with egg yolk, using a clean strainer and bowl. DO AHEAD: Can be made 6 hours ahead. Cover bowls separately and chill.",
        "Toss kale and dressing in a large bowl to coat. Season to taste with salt and pepper. Top with remaining 1/4 cup Parmesan and sieved eggs."
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "8 anchovy fillets packed in oil, drained",
        "1 garlic clove",
        "1 teaspoon Dijon mustard",
        "3/4 cup extra-virgin olive oil",
        "1/2 cup finely grated Parmesan, divided",
        "Kosher salt and freshly ground black pepper",
        "1 hard-boiled egg, peeled",
        "14 ounces Tuscan kale or other kale, center stalks removed, thinly sliced crosswise (about 8 cups)",
        "**Ingredient Info:**Tuscan kale—also called cavolo nero, Lacinato, black kale, or dinosaur kale—has long, narrow, bumpy dark-green leaves. You can find it at better supermarkets and at farmers' markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Side",
        "No-Cook",
        "Fourth of July",
        "Picnic",
        "Thanksgiving",
        "Mother's Day",
        "Graduation",
        "Backyard BBQ",
        "Dinner",
        "Buffet",
        "Parmesan",
        "Kale",
        "Fall",
        "Spring",
        "Summer",
        "Family Reunion",
        "Engagement Party",
        "Potluck",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Tuscan Kale Caesar Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-kale-caesar-slaw-366450"
}
