{
    "directions": [
        "1. Preheat the oven to 300°F.",
        "2. In a bowl, toss the bread with the olive oil and salt and pepper to taste. Spread the bread on a baking sheet and bake for 7 to 10 minutes, until slightly crisp. (The pieces should not be as crispy as croutons.) Alternatively, spread the bread cubes on a baking sheet and let them dry, uncovered, for about 24 hours.",
        "3. In a large bowl, whisk together the vinegar, capers, zest, and garlic. Season to taste with salt and pepper. Whisking constantly, add the extra virgin olive oil in a stream until well incorporated.",
        "4. Add the onion, tomatoes, bell peppers, cucumber, fennel, and olives and toss with the vinaigrette. Adjust the salt and pepper.",
        "5. Tear the fennel fronds and add them to the bowl along with the basil and bread. Toss to coat. Set aside for 20 minutes.",
        "6. Divide the salad among 4 plates. Garnish each plate with shaved cheese and serve. If you prefer a moister salad, drizzle with a little more extra virgin olive oil."
    ],
    "ingredients": [
        "4 cups torn pieces of sourdough or rustic peasant bread, 1 to 1 1/2 inches wide",
        "3 tablespoons olive oil",
        "Kosher salt and cracked black pepper",
        "1/4 cup red wine vinegar",
        "1 tablespoon drained capers",
        "2 teaspoons grated lemon zest",
        "1 garlic clove, minced",
        "1/2 cup extra virgin olive oil",
        "1 cup thinly sliced red onion",
        "5 assorted ripe heirloom tomatoes, halved or quartered, depending on size and shape",
        "1 red bell pepper, julienned",
        "1 yellow bell pepper, julienned",
        "1 cucumber, peeled, seeded, and chopped",
        "1 fennel bulb, trimmed and thinly sliced, fronds reserved",
        "1/2 cup pitted and halved Niçoise olives",
        "1/4 cup chopped fresh basil leaves",
        "1/4 cup shaved Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Garlic",
        "Olive",
        "Onion",
        "Pepper",
        "Tomato",
        "Vegetable",
        "Side",
        "Quick & Easy",
        "Lunch",
        "Parmesan",
        "Lemon",
        "Basil",
        "Fennel",
        "Cucumber",
        "Bell Pepper",
        "Summer",
        "Capers",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Tuscan Panzanella",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-panzanella-355873"
}
