{
    "directions": [
        "In heavy, large saucepan over moderately high heat, heat oil until hot but not smoking. Add onion, carrot, and celery and sauté, stirring occasionally, until light golden brown, about 10 minutes. Add beef and sauté, stirring occasionally, until brown on all sides, about 5 minutes. Add wine and thyme, stir well, and bring to boil. Add tomatoes, salt, and pepper, then lower heat to moderately low, cover, and simmer, stirring every 15 minutes, until beef is tender, about 2 hours.",
        "Pour olive oil into large serving bowl and swirl to coat. Set aside.",
        "In heavy, large pot over moderately high heat, bring stock to boil. Lower heat to moderate and slowly add polenta, stirring constantly. Continue cooking, stirring constantly, until polenta thickens and pulls away from sides of pan, about 10 minutes. Transfer to oil-coated serving bowl and keep warm.",
        "When beef is tender, use tongs to remove tomato skins (if desired) and thyme sprigs. Transfer stew to large serving bowl. Serve polenta alongside."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 red onion, cut into medium dice",
        "3 carrots, peeled and cut into 1/2-inch pieces",
        "3 stalks celery, cut into 1/2-inch pieces",
        "2 pounds stew beef, such as boneless chuck, trimmed of excess fat and cut into 1-inch cubes",
        "2 1/2 cups dry red wine",
        "8 sprigs fresh thyme",
        "3 medium tomatoes, halved",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon olive oil",
        "4 cups vegetable stock or broth",
        "1 cup polenta (coarse cornmeal)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Tomato",
        "Stew",
        "Dinner",
        "Cornmeal",
        "Carrot",
        "Red Wine",
        "Fall",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Tuscan Beef Stew with Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-beef-stew-with-polenta-241243"
}
