{
    "directions": [
        "Let steak sit at room temperature 15 minutes. Meanwhile, preheat oven to 450°F.",
        "Pat steak dry and season both sides with peppercorns and kosher salt. Heat oil and 1 tablespoon of butter in skillet over medium heat until butter melts. Add rosemary, thyme, and garlic and cook over medium heat, stirring occasionally, until herbs and garlic are fragrant, about 1 minute.",
        "Add steak and cook until nicely browned, about 3 minutes per side. Transfer skillet to oven and cook until an instant-read thermometer registers 110°F for medium-rare, about 5 minutes (or 120°F for medium, about 10 minutes).",
        "Transfer steak with tongs to a small platter, reserving skillet, and let rest 10 minutes.",
        "While steak rests, pour off oil from skillet, leaving garlic and herbs in skillet. Add wine and boil over medium-high heat, scraping up browned bits, until reduced by half, about 2 minutes. Add chicken broth and any meat juices from platter and boil until reduced by half, 5 to 6 minutes. Whisk in remaining 2 tablespoons butter until incorporated, then season with salt and keep warm.",
        "To carve: Transfer the steak to a cutting board and cut meat off both sides of the bone (you should have two solid pieces of steak). Thinly slice each piece, then rearrange the slices around the bone on a platter. Drizzle with the jus."
    ],
    "ingredients": [
        "1 (1 1/2-pound) porterhouse steak (1- to 1 1/4-inches thick)",
        "2 teaspoons black peppercorns, coarsely crushed (see Cooks' Notes)",
        "2 teaspoons kosher salt",
        "1 tablespoon vegetable oil",
        "3 tablespoons unsalted butter, cut into tablespoon pieces, divided",
        "3 garlic cloves, crushed",
        "2 (4-inch) sprigs fresh rosemary",
        "5 sprigs fresh thyme",
        "1/2 cup medium-bodied dry red wine (such as Chianti, Rioja, or merlot)",
        "1 cup low-sodium chicken broth",
        "Special equipment: ovenproof 12-inch heavy skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Valentine's Day",
        "Meat",
        "Steak",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Tuscan Porterhouse Steak with Red Wine-Peppercorn Jus",
    "url": "http://www.epicurious.com/recipes/food/views/tuscan-porterhouse-steak-with-red-wine-peppercorn-jus-388552"
}
