{
    "directions": [
        "Line a rimmed baking sheet with a silicone baking mat or parchment paper.",
        "Cook bacon in a medium nonstick skillet over medium heat until most of the fat is rendered and bacon is starting to crisp. Transfer bacon to a sieve set over a small bowl; reserve drippings.",
        "Return bacon, 1 tablespoon drippings, sugar, and sesame seeds to same skillet. Cook over medium heat, stirring frequently, until sugar turns the color of milk chocolate, about 5 minutes. Transfer mixture to prepared baking sheet and use a spatula to spread out evenly; let cool. Break brittle into shards. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Preheat oven to 400°F. Place sweet potatoes on a foil-lined baking sheet. Roast until tender, 45-55 minutes. Let sit until cool enough to handle.",
        "Slice potatoes in half lengthwise. Working over a large bowl, scoop out flesh from 8 halves, leaving a 1/2\"-thick layer inside skins. Place potato halves on same foil-lined baking sheet. Scoop flesh from remaining 4 halves; discard skins. Mash flesh with a whisk; add eggs, butter, miso, and ginger and stir until mixture is smooth. Spoon or pipe filling into reserved skins. DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Bake potatoes until the tops are lightly puffed and golden brown, 30-35 minutes (potatoes will take longer if they've been chilled). Top potatoes with bacon-sesame brittle and scallions."
    ],
    "ingredients": [
        "4 slices bacon, cut into 1/2\"-wide pieces",
        "1/3 cup sugar",
        "1 tablespoon sesame seeds",
        "6 medium sweet potatoes (6-8 ounces each)",
        "2 large eggs",
        "3 tablespoons unsalted butter, room temperature",
        "2 tablespoons white miso (fermented soybean paste)",
        "1 2/3\" piece ginger, peeled, finely grated (about 2 teaspoons)",
        "2 1\" pieces scallion (dark-green parts only), thinly sliced lengthwise",
        "Ingredient info: White miso, also called shiro miso, can be found at Asian markets and amazon.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soy",
        "Side",
        "Bake",
        "Bacon",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Sesame",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Twice-Baked Sweet Potatoes with Bacon-Sesame Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-sweet-potatoes-with-bacon-sesame-brittle-394716"
}
