{
    "directions": [
        "Preheat oven to 375°F and butter six 3/4-cup ramekins (3 3/4 by 2 inches). Crumble goat cheese and separate eggs. In a saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking, 3 minutes and whisk in milk. Bring mixture to a boil, whisking constantly, and simmer, whisking occasionally, 3 minutes. Remove pan from heat and add yolks, mustard, 1 teaspoon thyme, two thirds cheese, and salt and pepper to taste, whisking until cheese is melted. Transfer yolk mixture to a large bowl.",
        "In another large bowl with an electric mixer beat whites with a pinch salt until they just hold stiff peaks. Stir one fourth whites into yolk mixture to lighten and fold in remaining whites and remaining cheese gently but thoroughly.",
        "Divide soufflé mixture among ramekins and arrange in a large baking pan just large enough to hold them. Add enough hot water to baking pan to reach halfway up sides of ramekins. Bake soufflés in middle of oven until slightly puffed and golden brown, about 20 minutes, and transfer to a rack. Let soufflés stand, uncovered, 30 minutes (soufflés will fall slightly).",
        "Lightly butter a baking sheet. Run a thin knife around edges of soufflés. Invert each soufflé onto palm of your hand and carefully put, right side up, onto baking sheet. Soufflés may be made up to this point 2 days ahead and chilled, covered.",
        "Increase temperature to 425°F.",
        "In a small saucepan bring cream with remaining teaspoon thyme and salt and pepper to taste to a boil. Remove pan from heat and keep cream warm, covered. Bake soufflés in middle of oven until slightly puffed and heated through, about 5 minutes.",
        "Transfer soufflés to plates. Spoon 2 tablespoons cream over each soufflé and arrange salad decoratively alongside."
    ],
    "ingredients": [
        "1/2 pound aged (firm) goat cheese",
        "4 large eggs",
        "3 1/2 tablespoons unsalted butter",
        "1/3 cup all-purpose flour",
        "1 1/3 cups whole milk",
        "2 teaspoons Dijon mustard",
        "2 teaspoons finely chopped fresh thyme leaves",
        "3/4 cup heavy cream",
        "Accompaniment: salad greens tossed with vinaigrette"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Cheese",
        "Egg",
        "Mustard",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Winter",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Twice-Baked Goat Cheese Souffles with Salad",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-goat-cheese-souffles-with-salad-15812"
}
