{
    "directions": [
        "Preheat oven to 400°F. Pierce potatoes in several places with fork, then brush lightly with oil. Place potatoes directly on oven rack and bake until tender when pierced with fork, about 55 minutes. Cool potatoes slightly.",
        "Cut off thin slice from both short ends of each potato and discard. Cut each potato crosswise in half; stand each half on its small flat end. Using teaspoon, scoop out cooked potato pulp from each half, leaving 1/3-inch-thick shell and forming potato cup. Place potato cups in 13x9x2-inch glass baking dish. Place potato pulp in medium bowl; add cheese, sour cream, milk, and cayenne. Using potato masher or fork, mash until well blended and almost smooth. Season to taste with salt and pepper. Mound mashed potato mixture in potato cups.",
        "Melt butter in heavy medium skillet over medium heat. Add shallots and sauté until tender and deep brown, about 12 minutes. Top potato cups with shallots. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 350°F. Bake potato cups until heated through, about 20 minutes. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "4 12-ounce russet potatoes, scrubbed",
        "Vegetable oil",
        "1 cup coarsely grated Havarti cheese (about 4 ounces)",
        "1/2 cup sour cream",
        "1/4 cup whole milk",
        "1/4 teaspoon cayenne pepper",
        "3 tablespoons butter",
        "1 1/2 cups thinly sliced shallots (about 8 ounces)",
        "1 tablespoon chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Thanksgiving",
        "Fall",
        "Sour Cream",
        "Shallot",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Twice-Baked Potato Cups with Caramelized Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-potato-cups-with-caramelized-shallots-107319"
}
