{
    "directions": [
        "Bring large pot of water to boil. Add lamb; reduce heat to medium and boil gently 15 minutes. Drain. Set aside.",
        "Combine sugar and 6 tablespoons water in heavy medium saucepan. Stir over medium heat until sugar dissolves. Increase heat and boil without stirring until caramel is deep amber color, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 8 minutes, depending on pan. Remove from heat; add 3 cups water, soy sauce, and black vinegar to caramel; stir over medium heat to dissolve any caramel bits. Transfer caramel mixture to very large wide pot. Add remaining 3 cups water, ginger, star anise, garlic, chiles, and five-spice powder, then lamb shanks. Bring to boil (liquid will not cover shanks completely). Reduce heat to medium-low, cover tightly, and simmer until lamb is very tender, turning occasionally, about 3 hours.",
        "Transfer lamb to work surface. Skim any fat from sauce and discard; season sauce with salt and pepper. Remove meat from bones in bite-size pieces; discard bones. Return meat to sauce in pot. DO AHEAD Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled.",
        "Bring lamb and sauce to simmer; transfer to large serving bowl. Sprinkle green onions over and serve."
    ],
    "ingredients": [
        "6 large meaty lamb shanks (about 7 1/2 pounds)",
        "2/3 cup sugar",
        "6 tablespoons plus 6 cups water, divided",
        "1 cup soy sauce",
        "1/2 cup black vinegar",
        "1 (4-ounce) piece fresh ginger, peeled, sliced (about 2/3 cup)",
        "12 whole star anise",
        "8 large garlic cloves, peeled, crushed",
        "4 2-inch-long small dried red chiles",
        "2 teaspoons Chinese five-spice powder",
        "2 green onions, thinly sliced on diagonal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Lunar New Year",
        "Hot Pepper",
        "Anise",
        "Soy Sauce",
        "Simmer"
    ],
    "title": "Twice-Cooked Five-Spice Lamb with Red Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/twice-cooked-five-spice-lamb-with-red-chiles-237099"
}
