{
    "directions": [
        "Combine sugar and water in a small saucepan. Split vanilla bean with a sharp small knife and scrape seeds into sugar mixture. Add pod and bring to a boil, stirring until sugar is dissolved. Simmer 1 minute, then remove from heat and stir in orange juice.",
        "Pulse almonds with 2 tablespoons sugar in a food processor until finely ground. Add almond paste and pulse until finely chopped.",
        "Beat together butter, remaining 2 tablespoons sugar, almond mixture, and a pinch of salt with an electric mixer at medium speed until fluffy, 2 to 3 minutes. Whisk together egg, rum, and extract in a small bowl and gradually add to almond cream, beating until combined well. Chill, covered, until set, about 1 hour.",
        "Preheat oven to 350°F.",
        "Cut croissants in half horizontally. Brush insides of croissants (both top and bottom halves) with some orange syrup. Spread 2 tablespoons almond cream on each bottom half, mounding in centers, and cover with tops. Spread 1 tablespoon almond cream on each top. Transfer croissants to a parchment-lined baking sheet and sprinkle about 2 tablespoons toasted almonds on each.",
        "Bake croissants in middle of oven until golden brown, 20 to 25 minutes. Cool slightly, then dust with confectioners sugar."
    ],
    "ingredients": [
        "3/4 cup granulated sugar",
        "1/2 cup water",
        "1 vanilla bean",
        "1/4 cup fresh orange juice",
        "1/2 cup natural almonds (2 1/2 ounces)",
        "1/4 cup granulated sugar",
        "1/4 cup almond paste (not marzipan; 2 ounces), cut into pieces",
        "5 tablespoons unsalted butter, softened",
        "1 large egg",
        "1 tablespoon rum",
        "1/2 teaspoon pure almond extract",
        "8 (day-old) croissants",
        "3/4 cup sliced natural almonds (3 ounces), toasted",
        "Confectioners sugar for dusting",
        "Special equipment: a pastry brush, parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Fruit Juice",
        "Dairy",
        "Nut",
        "Breakfast",
        "Brunch",
        "Bake",
        "Mother's Day",
        "Father's Day",
        "New Year's Day",
        "Almond",
        "Fall",
        "Pastry",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Twice-Baked Almond Croissants",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-almond-croissants-103999"
}
