{
    "directions": [
        "Preheat oven to 400°F. Cut both squash in half lengthwise; scoop out seeds. Transfer cut side down to a parchment-lined rimmed baking sheet. Poke outside of skin all over with a fork, then roast until flesh is very soft, about 1 1/2 hours for large squash and about 1 hour for medium squash.",
        "Meanwhile, heat 1 cup cream in a medium pot over medium until just beginning to simmer. Reduce heat to medium-low and whisk in 1/4 cup cheese and cook, whisking, until smooth, about 1 minute. Transfer to a medium bowl and chill until very cold, about 45 minutes (do not freeze).",
        "Cook bacon in a medium skillet over medium heat, turning occasionally, until crisp, 8–10 minutes. Transfer to paper towels, reserving bacon fat in skillet. Let cool, then finely chop.",
        "Spread 3 Tbsp. sugar in a thin layer in the center of a medium dry skillet. Cook over medium heat, mostly undisturbed (it's ok to swirl pan gently to get sugar to melt evenly), until sugar melts and starts to turn light brown, about 6 minutes. Quickly stir in bacon and hazelnuts and cook, stirring, until coated and melted sugar is chestnut brown, about 1 minute more. Scrape onto a parchment-lined rimmed baking sheet and spread out to cool, then finely chop.",
        "Reduce oven temperature to 375°F. Using a spoon, scoop flesh out of large squash into a large bowl, leaving a 1/2\" border around squash shell to help maintain its shape. Transfer large shells to a rimmed baking sheet; arrange a few pieces of crumpled foil around shells to keep them upright. Scoop flesh out of medium shells into same bowl (you should have 6 cups squash); discard medium shells. Using a potato masher or spatula, mix in salt, pepper, nutmeg, 1 Tbsp. reserved bacon fat, and remaining 1 cup cream, 3/4 cup cheese, and 1 Tbsp. sugar until smooth. Fold in 2 Tbsp. chives. Divide filling between large squash shells, then create attractive swoops with a spoon. Bake squash until warmed through, 20–30 minutes.",
        "Meanwhile, using an electric mixer on medium-high speed or a whisk, whip chilled cream to medium peaks. Chill until ready to use.",
        "Dollop squash with whipped cream, then top with candied bacon bits and remaining 1 Tbsp. chives. Serve extra candied hazelnut-bacon bits on the side.",
        "Squash shells can be filled (not baked) 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1 large (about 5 pounds) and 1 medium (about 3 1/2 pounds) butternut squash",
        "2 cups heavy whipping cream, divided",
        "1 cup finely grated Parmesan (about 3 ounces), divided",
        "3 strips bacon (about 3 ounces)",
        "4 tablespoons sugar, divided",
        "2 tablespoons finely chopped hazelnuts",
        "1 1/4 teaspoons kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "3 tablespoons chopped chives, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Winter",
        "Fall",
        "Butternut Squash",
        "Parmesan",
        "Hazelnut",
        "Bacon"
    ],
    "title": "Twice-Baked Butternut Squash With Parmesan Cream and Candied Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-butternut-squash-with-parmesan-cream-and-candied-bacon"
}
