{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Mix breadcrumbs and hazelnuts in small bowl. Butter four 8-ounce soufflé dishes or custard cups. Coat sides and bottoms of dishes with breadcrumb mixture. Place dishes in large roasting pan.",
        "Bring milk to boil in heavy large saucepan. Set aside. Melt butter in heavy small saucepan over medium heat. Add flour and stir until pale golden, about 5 minutes. Gradually whisk in hot milk. Bring mixture to boil, stirring constantly. Reduce heat and simmer 1 minute. Remove from heat. Whisk in 1/4 cup cheese and egg yolk. Cool slightly.",
        "Using electric mixer, beat egg whites, lemon juice and pinch of salt in large bowl until stiff but not dry. Gently fold 1/4 of whites into lukewarm cheese mixture to lighten. Fold in remaining whites.",
        "Divide half of soufflé mixture among prepared dishes. Sprinkle 1 tablespoon cheese over each soufflé. Top with remaining soufflé mixture. Pour enough hot water into roasting pan to come 1/2 inch up sides of dishes.",
        "Bake soufflés until puffed and tops are golden brown, about 15 minutes. Remove dishes from water. Cool 10 minutes. Run small knife around sides of soufflés. Gently turn soufflés out onto baking sheet. (Can be prepared 1 day ahead. Cool. Cover and refrigerate.)",
        "Sprinkle remaining 1/4 cup cheese evenly over soufflés. Bake until soufflés are heated through, about 8 minutes if baked immediately or 10 minutes if refrigerated overnight. Transfer to plates."
    ],
    "ingredients": [
        "1/4 cup dry breadcrumbs",
        "2 tablespoons finely chopped toasted hazelnuts",
        "1/3 cup whole milk",
        "1 tablespoon butter",
        "1 tablespoon all purpose flour",
        "3/4 cup grated sharp cheddar cheese (about 4 1/2 ounces)",
        "1 large egg yolk",
        "4 large egg whites",
        "1 tablespoon fresh lemon juice",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Spring",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Twice-Baked Cheddar Cheese Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/twice-baked-cheddar-cheese-souffles-5350"
}
