{
    "directions": [
        "In a kettle combine the black beans with enough cold water to cover them by 2 inches, simmer them, covered, for 1 hour, or until they are tender, and drain them well. While the beans are cooking, in a large saucepan combine the barley with 4 cups boiling salted water and simmer it, covered, for 45 minutes, or until it is cooked but still al dente. Drain the barley in a colander, rinse it, and drain it well. In a small bowl whisk together the lemon juice, the mustard, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. In a large bowl combine the black beans, the barley, and the onion, add the dressing, and toss the salad until it is combined well. The salad may be prepared up to this point 1 day in advance and kept covered and chilled. In a saucepan of boiling salted water cook the green beans for 4 to 5 minutes, or until they are just tender, refresh them under cold water, and drain them well. Cut the beans crosswise into 1/4-inch pieces, add them to the salad with pine nuts and salt and pepper to taste, and toss the salad until it is combined well. Serve the salad chilled or at room temperature.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "1 pound dried black beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "1 cup barley (not quick-cooking)",
        "6 tablespoons fresh lemon juice",
        "1 tablespoon Dijon-style mustard",
        "3/4 cup olive oil",
        "1 1/2 cups finely chopped red onion",
        "1 pound green beans, trimmed",
        "1/2 cup pine nuts, toasted lightly",
        "1/2 to 1 pound dried beans, picked over"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Mustard",
        "Onion",
        "Side",
        "Low Fat",
        "Vegetarian",
        "High Fiber",
        "Lemon",
        "Pine Nut",
        "Barley",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Two-Bean and Barley Salad with Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/two-bean-and-barley-salad-with-pine-nuts-11494"
}
