{
    "directions": [
        "Mix shrimp, 2 tablespoons wine, ginger, black pepper and crushed red pepper in large bowl. Cover and chill 30 minutes. Drain, reserving marinade.",
        "Pour 7 tablespoons rice vinegar into another large bowl. Add 2 cups cold water to bowl. Add shredded lettuce and radishes. Let stand 5 minutes. Drain.",
        "Whisk clam juice, remaining 2 tablespoons wine and remaining 1 tablespoon vinegar in medium bowl to blend. Add cornstarch, salt and sugar; whisk until cornstarch dissolves. Whisk in reserved shrimp marinade. Set aside.",
        "Heat 2 teaspoons olive oil in large nonstick skillet over medium-high heat. Add shrimp and sauté until just cooked through, about 2 minutes. Using slotted spoon, transfer shrimp to plate. Heat remaining 2 teaspoons oil in same skillet over medium-high heat. Add onions and sauté until beginning to soften, about 4 minutes. Add remaining 2 tablespoons water and stir 1 minute. Add tomatoes and garlic and stir 30 seconds. Rewhisk clam juice mixture to blend. Add to skillet and boil until sauce thickens, about 1 minute. Add shrimp and parsley and toss to coat. Season to taste with salt and pepper. Remove from heat.",
        "Divide lettuce and radishes among 4 plates. Spoon shrimp mixture and sauce over and serve."
    ],
    "ingredients": [
        "1 pound uncooked large shrimp, peeled, deveined",
        "4 tablespoons dry white wine",
        "2 teaspoons grated peeled fresh ginger",
        "1/2 teaspoon cracked black pepper",
        "1/4 teaspoon dried crush red pepper",
        "8 tablespoons rice vinegar",
        "2 cups plus 2 tablespoons cold water",
        "5 cups shredded romaine lettuce",
        "8 radishes, trimmed, thinly sliced",
        "1/2 cup bottled clam juice",
        "2 teaspoons cornstarch",
        "1/2 teaspoon salt",
        "1/4 teaspoon sugar",
        "4 teaspoons vegetable oil",
        "1 pound onions, thinly sliced",
        "1/2 cup drained canned diced tomatoes",
        "1 garlic cloves, minced",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Leafy Green",
        "Marinate",
        "Sauté",
        "Low Fat",
        "Shrimp",
        "Chill"
    ],
    "title": "Two-Pepper Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/two-pepper-shrimp-1664"
}
