{
    "directions": [
        "In a small dry skillet over low heat add the ancho peppers, oregano, paprika, coriander, cumin, and chili powder. Cook until they begin to smell, about 2 minutes. Put the spices into a spice mill or food processor and grind until they are powdered. Set aside.",
        "Heat a large heavy bottomed casserole over medium heat; add 3 tablespoons olive oil and the onions. Cook until the onions are soft and beginning to caramelize, about 10 minutes. Pat the beef dry and season it with salt and pepper. Add it to the pot and cook, stirring frequently, until it has browned on all sides, about 10 minutes. Add 2 tablespoons of the toasted spice mix, the garlic, chipotle, jalapeno, tomatoes, cinnamon stick, and sugar. Season with salt and stir well. Add some hot water until the meat is just covered with liquid. Return to the boil, reduce to a simmer, cover, and cook for 1 1/2 hours. Remove the meat and shred it with a fork. Return it to the pot, stir in the masa harina and chocolate, and cook for another 10 minutes, uncovered, to thicken. Taste and adjust seasoning. Serve with the queso fresco, cilantro, and lime for garnish."
    ],
    "ingredients": [
        "3 dried ancho peppers, stemmed and seeded",
        "2 tablespoons dried oregano",
        "2 tablespoons sweet paprika",
        "2 tablespoons whole coriander",
        "1 tablespoon cumin seed",
        "1 tablespoon chili powder",
        "3 tablespoons extra-virgin olive oil",
        "2 onions, chopped",
        "3 pounds beef chuck, cut into 1-inch cubes",
        "Kosher salt and freshly ground black pepper",
        "6 cloves garlic, chopped",
        "1 canned chipotle chile, chopped",
        "1/2 jalapeno pepper, chopped",
        "2 (28-ounce) cans whole tomatoes, hand crushed",
        "1 cinnamon stick",
        "1 teaspoon sugar",
        "2 tablespoons masa harina",
        "1/2 tablet Mexican chocolate (about 1 1/2 ounces)",
        "Grated queso fresco, for garnish",
        "Cilantro leaves, for garnish",
        "Lime wedges, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Chili",
        "Beef",
        "Chili",
        "Meat",
        "American",
        "Southwestern",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Queso",
        "Main Dish Recipes",
        "Lunch",
        "Recipes for Parties",
        "Tailgate Party",
        "Super Bowl",
        "4th of July",
        "Holiday"
    ],
    "title": "Tyler's Texas Chili",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/tylers-texas-chili-recipe2"
}
