{
    "directions": [
        "Prepare grill (or preheat broiler).",
        "Halve tenderloin horizontally to form 2 approximately 1-inch-thick pieces. Rub both sides of each piece with black pepper, pressing it into meat.",
        "Grill beef on an oiled rack set 5 to 6 inches over glowing coals 5 to 8 minutes on each side for medium-rare. (Alternatively, broil beef on oiled rack of a broiler pan about 3 to 5 inches from heat 6 to 7 minutes on each side for medium-rare.) Transfer beef to a cutting board and cool 30 minutes. If desired, chill beef, loosely wrapped, at least 2 hours and up to 1 day to facilitate thin slicing. But beef across grain into very thin slices.",
        "In a large bowl stir together lime juice, fish sauce, sugar, and chilies until combined will (sugar should be dissolved if using).",
        "Add beef, shallots, scallions, coriander, and mint and toss will. Score cucumber lengthwise with tines of a fork and cut crosswise into thin slices.",
        "Arrange cucumber around edge of a platter and mound beef salad in center. Garnish beef with coriander sprig and serve with rice."
    ],
    "ingredients": [
        "1 pound center cut beef tenderloin at room temperature",
        "1/2 teaspoon freshly ground black pepper",
        "5 tablespoons fresh lime juice, or to taste",
        "2 tablespoons Asian fish sauce (preferably naam pla), or to taste",
        "1/2 teaspoon sugar, or to taste, if desired",
        "2 to 3 small fresh red or green Thai (bird) chilies or serrano chilies, or to taste, seeded and minced (wear rubber gloves)",
        "1/2 cup thinly slices shallots (about 2 large)",
        "4 scallions, cut into 1/2-inch pieces",
        "1/2 cup packed fresh coriander leaves, washed well and spun dry",
        "2 tablespoons finely chopped fresh mint leaves",
        "1 seedless cucumber",
        "Garnish: fresh coriander sprigs",
        "Accompaniment:Thai Sticky Rice or Thai Jasmine Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Backyard BBQ",
        "Lime",
        "Mint",
        "Beef Tenderloin",
        "Cucumber",
        "Hot Pepper",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Yam Neua",
    "url": "http://www.epicurious.com/recipes/food/views/yam-neua-14421"
}
