{
    "directions": [
        "Preheat oven to 400°F. Pierce each yam in several places with fork. Place directly on oven rack and roast until just tender, 40 to 50 minutes, depending on size of yams.",
        "Transfer roasted yams to work surface. Using scissors, cut off ends of each yam, then cut skin on 1 long side and peel off in 1 piece, being careful not to break warm yams. Let yams cool to room temperature. Tear or cut skins into long ribbons, about 1 inch wide.",
        "Cut yams crosswise into 1/2-inch thick rounds. Arrange rounds, slightly overlapping, in 13 x 9 x 2-inch glass baking dish or other ovenproof dish. Cover yams with aluminum foil to keep moist. DO AHEAD: Yams can be made up to 3 hours ahead. Let stand at room temperature. Rewarm yams in 350°F oven 15 to 20 minutes before serving.",
        "Melt butter in large skillet over medium heat. Cook until butter browns (milk solids will turn deep golden brown), stirring occasionally, 8 to 10 minutes. Carefully pour butter, including all brown milk solids, into small bowl.",
        "Blend shallot, garlic, and 1 teaspoon coarse salt in processor until smooth, occasionally scraping down sides of bowl. Add Dijon mustard, then red wine vinegar. With motor running, gradually drizzle in butter (including browned milk solids). Season vinaigrette to taste with pepper and additional salt, if desired. do ahead Vinaigrette can be made 1 hour ahead. Let stand at room temperature. Blend again 5 seconds before using.",
        "Pour enough vegetable oil into large deep skillet to reach depth of 1 inch. Attach deep-fry thermometer to side of skillet and heat oil to 350°F. Add yam skins in batches (oil will bubble up) and fry until skins are crisp and brown, stirring occasionally, about 3 minutes. Using slotted spoon, carefully transfer yam skins to paper towels to drain. Sprinkle skins with coarse salt and pepper.",
        "Spoon vinaigrette over potatoes. Scatter crisp skins over and serve."
    ],
    "ingredients": [
        "8 slender medium garnet yams or other yams (red-skinned sweet potatoes; about 5 pounds total), rinsed, dried",
        "1 cup (2 sticks) unsalted butter",
        "1 small shallot, peeled",
        "1 garlic clove, peeled",
        "1 teaspoon coarse kosher salt plus additional for seasoning",
        "1 tablespoon Dijon mustard",
        "1 1/2 tablespoons red wine vinegar",
        "Vegetable oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Vinegar",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Christmas Eve",
        "Shallot",
        "Butter",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yams with Crispy Skins and Brown-Butter Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/yams-with-crispy-skins-and-brown-butter-vinaigrette-356314"
}
