{
    "directions": [
        "In medium saucepan over high heat, combine rice and 1 1/4 cups water. Cover and bring to boil, then reduce heat to low and simmer until water is absorbed, about 25 minutes. Remove from heat and let stand, covered, 10 minutes. Fluff with large fork or chopsticks, then cool. (Rice can be made ahead and refrigerated, covered, up to 2 days.)",
        "In wok or heavy large sauté pan over moderately high heat, heat oil until hot but not smoking. Add half of scallions (reserve remainder for garnish). Add shrimp and stir-fry until shrimp are pink and cooked through, 2 to 3 minutes. Add eggs and rice and stir-fry until eggs are just set, about 1 minute. Add mushrooms, peas, ham, oyster sauce, sugar, salt, and pepper and stir-fry until heated through and fluffy, 4 to 5 minutes. Garnish with remaining scallions and serve."
    ],
    "ingredients": [
        "1 cup long-grain white rice, rinsed several times in cold water until water runs clear",
        "3 tablespoons vegetable or peanut oil",
        "8 scallions (white and green parts), thinly sliced on diagonal (about 1 cup)",
        "4 ounces fresh shrimp, peeled, deveined, and finely diced (about 1 cup or 6 large shrimp)",
        "3 large eggs, lightly beaten",
        "4 ounces fresh shiitake mushroom, stems discarded and caps finely diced (about 2 cups)",
        "4 ounces fresh or frozen peas (about 1 cup)",
        "4 ounces ham, finely diced (about 1 cup)",
        "1 tablespoon oyster sauce",
        "1 teaspoon sugar",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Mushroom",
        "Rice",
        "Side",
        "Stir-Fry",
        "Lunar New Year",
        "Ham",
        "Shrimp",
        "Pea",
        "Dairy Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Yangzhou Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/yangzhou-fried-rice-243064"
}
