{
    "directions": [
        "Whisk flour, baking powder, cardamom, and salt in a medium bowl; set aside. Using an electric mixer, beat 1/2 cup butter and sugar in a medium bowl until pale and fluffy, about 3 minutes. Beat in egg yolk and milk. With mixer running on low speed, gradually add dry ingredients and beat just until thoroughly combined.",
        "Pat dough into a ball; break off one-quarter of dough. Form each piece into a ball. Flatten balls into disks. Cover separately and chill dough disks for at least 2 hours or overnight.",
        "Butter tart pan. Break larger dough disk into small pieces and scatter over bottom of tart pan. Using your fingertips, press dough onto bottom and up sides of pan. Use the flat bottom of a measuring cup to smooth the surface and trim the edges. Roll out smaller dough disk to about 1/8\" thick. Using decorative cookie cutters, cut out shapes and place on a parchment paper-lined baking sheet. Cover and chill crust and cutouts for 1 hour.",
        "Preheat oven to 350°F. Pulse almonds, powdered sugar, cardamom, and nutmeg in a food processor until nuts are finely ground. Transfer dry ingredients to a large bowl. Using an electric mixer, beat egg whites and vanilla in a medium bowl until medium peaks form. Gently fold egg whites into dry ingredients.",
        "Whisk egg yolk and 2 teaspoons water in a small bowl to blend. Fill chilled crust with almond mixture; smooth top. Arrange cutouts on top and brush cutouts with egg wash.",
        "Bake tart until crust and cutouts are golden brown and filling is set, 30-35 minutes. Transfer to a wire rack; let cool. DO AHEAD: Tart can be made 2 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon ground cardamom, preferably freshly ground",
        "1/4 teaspoon kosher salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup sugar",
        "1 large egg yolk",
        "2 teaspoons whole milk or heavy cream",
        "Unsalted butter (for pan)",
        "2 cups slivered almonds",
        "1 cup powdered sugar",
        "3/4 teaspoon ground cardamom, preferably freshly ground",
        "1/4 teaspoon freshly grated nutmeg",
        "3 large egg whites",
        "1/2 teaspoons vanilla extract",
        "1 large egg yolk",
        "Special equipment: A 9\"-diameter fluted tart pan with removable bottom; decorative cookie cutters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "High Fiber",
        "Low Sodium",
        "Almond",
        "Cardamom",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Yarnall Family's Fyrstekake (Norwegian Cardamom-Almond Tart)",
    "url": "http://www.epicurious.com/recipes/food/views/yarnall-familys-fyrstekake-norwegian-cardamom-almond-tart-51135090"
}
