{
    "directions": [
        "In a large nonreactive bowl, prepare a marinade by mixing the lemon juice, onions, salt, pepper, minced chile, and 4 tablespoons of the peanut oil in a large bowl. Place the chicken pieces in the marinade, making sure that they are all well covered. Cover the bowl with plastic wrap and allow the chicken to marinate for at least 3 hours in the refrigerator.",
        "Preheat the broiler. Remove the chicken pieces, reserving the marinade and onions, and place the chicken in a shallow pan. Broil the the chicken until it is lightly browned on both sides. Remove the onions from the marinade. Heat the remaining tablespoon of oil in a flameproof 5-quart casserole or Dutch oven and cook the onions slowly until tender and translucent. Add the reserved marinade. When the liquid is thoroughly heated, add the chicken pieces, pricked chile, olives, carrots, mustard, and water. When the dish has reached the desired degree of hotness, remove the chile and reserve (it can be served separately to the chile heads). Stir to mix well, then bring the yassa slowly to a boil. Lower the heat and simmer, covered, for about 30 minutes, or until the chicken is cooked through. Serve hot over white rice."
    ],
    "ingredients": [
        "1/4 cup freshly squeezed lemon juice",
        "4 large onions, thinly sliced",
        "salt and freshly ground black pepper, to taste",
        "1/8 teaspoon minced fresh habanero chile, or to taste",
        "5 tablespoons peanut oil",
        "1 frying chicken (2 1/2 to 3 1/2 pounds), cut into serving pieces",
        "1 habanero chile, pricked with a fork",
        "1/2 cup pimento-stuffed olives",
        "4 carrots, scraped and thinly sliced",
        "1 tablespoon Dijon-style mustard",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Onion",
        "Poultry",
        "Marinate",
        "Dinner",
        "Hot Pepper",
        "Winter",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yassa au Poulet II (Chicken Yassa)",
    "url": "http://www.epicurious.com/recipes/food/views/yassa-au-poulet-ii-chicken-yassa-100674"
}
