{
    "directions": [
        "Butter a 13x9\" shallow baking dish. Mix yeast, 2 Tbsp. brown sugar, and 1/4 cup warm water in the bowl of a stand mixer; let sit until it foams, about 5 minutes. Whisk in egg and remaining brown sugar, then stir in 1 cup flour and mix with a wooden spoon to incorporate. Sprinkle remaining 2 cups flour over top but do not mix in. Cover with plastic wrap and let sit in a warm, draft-free spot until mixture is visibly puffed and flour has cracks in places, 60–90 minutes.",
        "Add sour cream, orange zest, orange juice, baking powder, and salt to mixture and mix on medium speed with dough hook until smooth, elastic, and just sticking to the sides of bowl, about 4 minutes. Add 6 Tbsp. butter in 2 additions, beating well between additions; beat until a soft, slightly glossy, sticky dough-batter hybrid forms, about 4 minutes.",
        "Using buttered fingers, pat dough into prepared pan in an even layer, spreading to edges. Cover and let sit in a warm, draft-free spot until puffed and nearly doubled in size, 60–70 minutes.",
        "Just before dough is finished rising, preheat oven to 350°F. Pulse flour, oats, brown sugar, granulated sugar, cinnamon, and a pinch of salt in a food processor a few times to combine. Add butter and process in long pulses until streusel is the consistency of moist crumbs.",
        "Working with several slices at a time, fan out apples slightly and arrange over dough, shingling rows in different directions; sprinkle streusel over top. Bake until apples are tender and a tester inserted into the center comes out clean, 35–45 minutes. Transfer to a wire rack and let cool.",
        "Whisk powdered sugar, orange juice, and a pinch of salt in a medium bowl, adding more orange juice by the teaspoonful as needed, until icing is very thick and smooth and falls back onto itself in a slowly dissolving ribbon. Drizzle over coffee cake."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, melted, slightly cooled, plus more",
        "1 1/4-ounce envelope active dry yeast (about 2 1/4 teaspoons)",
        "2/3 cup (packed) light brown sugar, divided",
        "1 large egg, room temperature",
        "3 cups all-purpose flour, divided",
        "1/2 cup sour cream, room temperature",
        "2 teaspoons finely grated orange zest",
        "1/3 cup fresh orange juice",
        "2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "1/2 cup all-purpose flour",
        "1/2 cup old-fashioned oats",
        "1/3 cup (packed) light brown sugar",
        "2 tablespoons granulated sugar",
        "1 teaspoon ground cinnamon",
        "Kosher salt",
        "6 tablespoons unsalted butter, melted, slightly cooled",
        "2 pounds firm baking apples (about 4 large), halved, cored, very thinly sliced",
        "1 1/2 cups powdered sugar",
        "2 tablespoons (or more) fresh orange juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bake",
        "Breakfast",
        "Apple",
        "Sour Cream",
        "Oat",
        "Dessert",
        "Brunch",
        "Fall",
        "Cinnamon",
        "Tree Nut Free"
    ],
    "title": "Yeasted Apple Coffee Cake",
    "url": "http://www.epicurious.com/recipes/food/views/yeasted-apple-coffee-cake"
}
