{
    "directions": [
        "Place bay leaves and peppercorns in center of cheesecloth and tie closed with kitchen twine; set sachet aside. Toast turmeric in a dry small skillet over medium-low heat, stirring often, just until fragrant (be careful not to let it brown), about 3 minutes. Transfer to a plate.",
        "Cook coconut in same skillet over medium-high heat, stirring occasionally, until burnt (not browned: burnt), about 3 minutes. Grind in a spice mill or with a mortar and pestle or finely chop. Transfer to another plate.",
        "Heat oven to 375°F. Toss cauliflower and squash on a large rimmed baking sheet with 1 Tbsp. oil to coat; season with salt and pepper. Roast vegetables, tossing occasionally, until browned and tender, 30–40 minutes.",
        "Heat remaining 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Add onion, shallots, garlic, and ginger and cook, stirring often, until golden brown and very fragrant, 8–10 minutes. Add red pepper flakes and cook, stirring often, just until fragrant, about 1 minute. Stir in toasted turmeric, coconut milk, and 3/4 cup vinegar. Bring to a boil and cook until liquid is reduced by about one-third, 20–30 minutes.",
        "Meanwhile, prepare a grill for medium-high heat (or heat a grill pan over medium-high). Season chicken with salt and pepper and grill, turning occasionally, just until skin is charred (chicken will not be cooked through at this point), 8–10 minutes.",
        "Add chicken and reserved sachet to turmeric sauce. Cook, partially covered, until chicken is tender, 60–80 minutes. Stir honey and remaining 1/4 cup vinegar in a small bowl until honey is dissolved; add to braise, then add roasted cauliflower and squash. Taste and season with more salt or honey as needed.",
        "Divide adobo among bowls and top with burnt coconut, pumpkin seeds, chiles, and scallion.",
        "Adobo can be made 3 days ahead. Let cool; cover and chill. Reheat gently before serving."
    ],
    "ingredients": [
        "10 dried bay leaves",
        "2 tablespoons black peppercorns",
        "2 tablespoons ground turmeric",
        "1/4 cup unsweetened shredded coconut",
        "1/2 head of cauliflower, broken into small florets",
        "1/4 kabocha squash, cut into 1-inch pieces (about 2 cups)",
        "3 tablespoons vegetable oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 small white onion, chopped",
        "2 medium shallots, chopped",
        "6 large garlic cloves, chopped",
        "1 (3-inch) piece ginger, peeled, finely grated",
        "1 teaspoon crushed red pepper flakes",
        "2 (13.5-ounce) cans unsweetened coconut milk",
        "1 cup sugarcane vinegar or distilled white vinegar, divided",
        "4 chicken legs, drumsticks and thighs, separated",
        "3 tablespoons (or more) honey",
        "Unsalted, roasted pumpkin seeds (pepitas), thinly sliced Fresno chiles, and sliced scallion (for serving)",
        "A layer of cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Philippines",
        "Soup/Stew",
        "Fall",
        "Winter",
        "Vinegar",
        "Coconut",
        "Chicken",
        "Ginger",
        "Dinner",
        "Stew"
    ],
    "title": "Yellow Chicken Adobo",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-chicken-adobo"
}
