{
    "directions": [
        "1. Combine the sugar and 3/4 cup (180 ml) water in a medium saucepan. Bring them to a boil, stirring often to dissolve the sugar. Reduce the heat to medium-low and cover. Simmer until the syrup is lightly thickened, about 5 minutes. Remove the saucepan from the heat. Stir in the mint sprigs, and let the pan stand, uncovered, until the syrup is completely cooled. Drain the syrup in a wire sieve over a bowl, squeezing the mint between your fingertips to extract the very last drops; discard the mint.",
        "2. Purée the watermelon in a food processor or blender. (If you wish, leave some of the watermelon in tiny chunks that are small enough to fit into the mold.) Pour the purée into a bowl. Stir in enough of the mint syrup to make a very sweet mixture (see Tips). Stir in the sliced mint. Divide the purée evenly among the eight ice pop molds, leaving a little clearance at the top of each mold to allow for expansion. Cover the molds with the lids (adding wooden sticks, if needed).",
        "3. Freeze the pops until they are solid, at least 4 hours. (The pops can be frozen for up to 1 week.) To serve, run the bottom of the molds briefly under lukewarm water and unmold."
    ],
    "ingredients": [
        "3/4 cup (150 g) sugar",
        "5 to 6 large sprigs fresh mint plus 2 teaspoons very thinly sliced fresh mint",
        "1 quart (960 ml) peeled, seeded, and chopped yellow watermelon",
        "2 tablespoons fresh lemon juice",
        "Special equipment: 8 (1/2-cup/120-ml) ice pop molds (and wooden sticks, if required for your molds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Kid-Friendly",
        "Frozen Dessert",
        "Watermelon",
        "Mint",
        "Summer",
        "Fat Free",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Yellow Watermelon & Mint Pops",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-watermelon-mint-pops-51201630"
}
