{
    "directions": [
        "Put oven rack in lower third of oven and put a large shallow baking pan on rack, then preheat oven to 475°F.",
        "Toss one third of squash with 1 tablespoon oil, 1/2 teaspoon salt, and 1/2 teaspoon pepper in a bowl, then spread in preheated baking pan in 1 layer and roast in oven, stirring once, until tender, 12 to 15 minutes. Transfer squash to a large bowl. Roast remaining squash in 2 batches in same manner, tossing with 1 tablespoon oil, 1/2 teaspoon salt, and 1/2 teaspoon pepper (per batch) just before roasting and adding to bowl when done.",
        "Toss onions and bell peppers with remaining tablespoon oil, remaining 1/2 teaspoon salt, and remaining 1/2 teaspoon pepper in another large bowl, then spread in baking pan and roast, stirring once, until onions are golden, 8 to 10 minutes. Transfer to bowl with squash.",
        "Move oven rack to middle position and reduce oven temperature to 400°F.",
        "Melt 3 tablespoons butter in a saucepan and remove from heat, then add bread crumbs and a pinch of salt, tossing to coat crumbs. Spread evenly in cleaned baking pan and bake, without stirring, until pale golden, about 5 minutes.",
        "Melt remaining 4 tablespoons butter in a 3-quart heavy saucepan over moderately low heat, then whisk in flour and cook roux, whisking constantly, 3 minutes. Add broth, whisking, and bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, 3 minutes. Remove from heat and cool 5 minutes, whisking occasionally, then whisk in sour cream and salt and pepper to taste. Pour sauce over squash mixture and stir gently until combined well.",
        "Butter a 13- by 9- by 2-inch glass or ceramic baking dish (3-quart capacity), then spread squash mixture evenly into it and sprinkle with bread crumbs. Bake casserole until golden and bubbling, 15 to 20 minutes. Serve immediately."
    ],
    "ingredients": [
        "4 lb yellow squash (10 medium), trimmed, halved lengthwise, and sliced crosswise 1/8 inch thick",
        "1/4 cup vegetable oil",
        "2 teaspoons salt",
        "2 teaspoons black pepper",
        "2 medium onions, chopped (2 cups)",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "7 tablespoons unsalted butter",
        "4 slices firm white sandwich bread with crust, coarsely ground in a food processor (about 2 1/4 cups)",
        "1/4 cup all-purpose flour",
        "1 3/4 cups reduced-sodium chicken broth (14 fl oz)",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Sauté",
        "Casserole/Gratin",
        "Bell Pepper",
        "Fall",
        "Yellow Squash",
        "Sour Cream",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Yellow Squash Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-squash-casserole-232628"
}
