{
    "directions": [
        "In a skillet cook peppers in water and 2 tablespoons of butter, covered partially, over moderate heat, stirring occasionally, until very soft, about 20 minutes. Purée peppers in a food processor or blender and strain through a coarse sieve into a small bowl. Season purée with salt and pepper.",
        "In the cleaned skillet cook zucchini in 1 tablespoon remaining butter over moderate heat, stirring until crisp-tender, about 2 minutes, and season with salt and pepper.",
        "In a saucepan heat broth and keep at a bare simmer.",
        "In a heavy 2- to 3-quart saucepan cook shallot and garlic in remaining 2 tablespoons butter over moderately low heat until very soft but not browned, about 5 minutes. Stir in rice and cook over moderate heat, stirring constantly, until edges become translucent, about 5 minutes. Add wine and cook, stirring constantly, until wine is absorbed. Add about 1/2 cup simmering broth and cook, stirring constantly, until broth is absorbed. Continue adding broth, about 1/2 cup at a time, and cooking, stirring constantly and letting each addition be absorbed before adding the next, until rice is al dente, about 20 minutes.",
        "Remove pan from heat and stir in pepper purée, zucchini, Parmesan, 1 tablespoon of parsley, and salt and pepper to taste. Sprinkle risotto with remaining 1 tablespoon parsley."
    ],
    "ingredients": [
        "3 yellow bell peppers, chopped",
        "1 tablespoon water",
        "5 tablespoons unsalted butter",
        "1 cup finely diced zucchini",
        "4 cups low-salt chicken broth",
        "6 shallots, minced (about 1 cup)",
        "1 garlic clove, minced",
        "1 cup Arborio rice*",
        "1/3 cup dry white wine",
        "1 cup freshly grated Parmesan cheese",
        "2 tablespoons minced flat-leafed parsley leaves",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Parmesan",
        "Bell Pepper",
        "Zucchini",
        "Shallot",
        "Gourmet"
    ],
    "title": "Yellow Pepper Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-pepper-risotto-11539"
}
