{
    "directions": [
        "Preheat oven to 400°F.",
        "In a medium saucepan over moderately high heat, warm the canola oil. Add the rice, vermicelli noodles, onion, celery, bell pepper, and scallions, and sauté, stirring frequently, until golden and toasted, 2 to 3 minutes. Add the garlic, turmeric, cumin, and cayenne, and sauté, stirring constantly, until the spices are toasted, about 30 seconds. Add the chicken stock and salt, stir thoroughly, and bring to a boil. Transfer to the baking dish. DO AHEAD: The rice can be prepared up to this point, covered, and refrigerated up to 8 hours. Bring to room temperature before proceeding.",
        "Dot the rice with the butter, cover the baking dish snugly with foil, and bake for 15 minutes. Remove the foil and continue baking until the rice is tender, about 10 minutes. Sprinkle with parsley and serve hot."
    ],
    "ingredients": [
        "1/4 cup canola oil",
        "2 cups converted long-grain rice such as Uncle Ben's",
        "1 cup vermicelli noodles, broken into roughly 1-inch pieces",
        "1 small yellow onion, peeled and diced",
        "1 small celery rib, diced",
        "1/2 yellow bell pepper, diced",
        "4 scallions, white and light green parts only, cut on a diagonal, into 1/2-inch pieces",
        "2 cloves garlic, peeled and minced",
        "2 teaspoons ground turmeric",
        "2 teaspoons ground cumin",
        "1/2 to 1 teaspoon cayenne pepper",
        "4 cups chicken stock or low-sodium chicken broth",
        "1 teaspoon kosher salt",
        "2 tablespoons unsalted butter, cut into small pieces",
        "1/4 cup coarsely chopped fresh flat-leaf parsley",
        "Special equipment: 1 (9- by 13-inch) baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Side",
        "Christmas",
        "Spice",
        "Celery",
        "Noodle",
        "Parsley",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Yellow Rice Pilaf",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-rice-pilaf-51126870"
}
