{
    "directions": [
        "Blend flour and salt in processor. Add butter. Using on/off turns, blend until coarse meal forms. Add 4 tablespoons ice water. Using on/off turns, blend until dough comes together in moist clumps, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap and chill at least 1 hour and up to 1 day.",
        "Preheat oven to 375°F. Roll out dough on floured surface to 14 1/2-inch round. Transfer to 10-inch-diameter tart pan with removable bottom. Fold overhang in; press to form double-thick sides. Push sides up until 1/4 inch higher than top edge of pan. Pierce crust all over with fork. Freeze 10 minutes.",
        "Line dough with foil and dried beans or pie weights. Bake until sides are set, about 25 minutes. Remove foil and beans. Bake until crust is golden, piercing with fork if crust bubbles, about 15 minutes. Transfer crust to rack; cool completely. Reduce oven temperature to 350°F.",
        "Melt butter in heavy medium skillet over medium heat. Add squash and thyme. Sauté until squash is just tender and translucent, about 5 minutes. Cool to room temperature.",
        "Whisk eggs, cream, salt, pepper, and hot sauce in bowl. Arrange squash over bottom of crust. Sprinkle with mozzarella. Place tart pan on oven rack. Pour egg mixture into crust, filling completely (some egg mixture may be left over).",
        "Bake quiche until filling is golden and set in center, about 35 minutes. Transfer quiche to rack; cool 15 minutes."
    ],
    "ingredients": [
        "1 1/4 cups unbleached all purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "4 tablespoons (or more) ice water",
        "1 tablespoon butter",
        "12 ounces yellow crookneck squash, cut into 1/4-inch-thick rounds",
        "2 teaspoons chopped fresh thyme",
        "6 large eggs",
        "1 cup whipping cream",
        "3/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon hot pepper sauce",
        "3/4 cup (packed) coarsely grated mozzarella cheese (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Brunch",
        "Bake",
        "Mozzarella",
        "Squash",
        "Thyme",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yellow Squash and Mozzarella Quiche with Fresh Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-squash-and-mozzarella-quiche-with-fresh-thyme-230610"
}
