{
    "directions": [
        "Arrange racks in upper and lower thirds of oven; preheat to 350°F. Coat cake pans with nonstick spray. Line bottom of pans with parchment-paper rounds; coat paper. Whisk flour, baking powder, baking soda, and salt in a large bowl until no lumps remain. Combine buttermilk, oil, and vanilla in a medium bowl.",
        "Combine sugar, butter, and brown sugar in another large bowl. Scrape in seeds from vanilla bean. Using an electric mixer, beat butter mixture until light and fluffy, 3-4 minutes. Add yolks and eggs one at a time, beating to blend between additions and occasionally scraping down sides and bottom of bowl.",
        "Continue to beat mixture, occasionally scraping down sides and bottom of bowl, until almost doubled in volume and very light, airy, and pale yellow, 5-6 minutes. It's very important that no lumps remain at this stage. (Occasional scraping of the bowl, especially the bottom, helps prevent lumps.)",
        "With mixer on low, add dry ingredients in 3 additions, alternating with buttermilk mixture in 2 additions, beginning and ending with dry ingredients.",
        "Divide batter evenly among prepared pans, about 3 1/2 cups per pan. Smooth tops.",
        "Bake, rotating cakes from left to right and top to bottom halfway through, until cakes are light golden brown, the centers spring back when gently pressed, and a tester inserted into the centers comes out with a few moist crumbs attached, 35-40 minutes.",
        "Transfer cakes to wire racks; let cool in pans for at least 30 minutes. Invert cakes onto racks, peel off parchment, and let cool completely.",
        "Using a long serrated knife, remove top dome and any bumps from each cake to create a flat surface. Slice each cake in half horizontally to make 6 layers total. DO AHEAD: Cakes can be baked 1 day ahead. Wrap tightly in plastic wrap and store at room temperature.",
        "Stir chocolate and corn syrup in a large metal bowl set over a large saucepan of simmering water until melted and smooth; remove from heat. Stir sour cream, salt, and vanilla in a medium metal bowl; set over same saucepan of simmering water. Stir until mixture is warm but not hot, about 2 minutes. Add sour cream mixture to chocolate mixture; stir until smooth and glossy. Set aside.",
        "Using an electric mixer, beat powdered sugar and butter in a medium bowl until light and fluffy, 2-3 minutes. Scrape down sides of bowl. Slowly beat in chocolate mixture. Continue beating until no lumps remain, about 2 minutes. Frosting should be smooth and shiny. Cover and chill until slightly firmed up, about 30 minutes.",
        "Place 1 cake layer on a cake stand or large plate. Spoon 1/3 cup frosting over; using an offset spatula or the back of a spoon, smooth frosting to edge of cake, creating an even layer. Place another cake layer on top. Repeat with frosting and remaining cake layers. Spread remaining frosting over top and sides of cake. DO AHEAD: Cake can be made 1 day ahead. Cover with a cake dome and store at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 cups cake flour",
        "2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons kosher salt",
        "1 1/2 cups buttermilk",
        "1/2 cup vegetable oil",
        "2 teaspoons vanilla extract",
        "2 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup (packed) light brown sugar",
        "1 vanilla bean, split lengthwise",
        "6 large egg yolks",
        "3 large eggs",
        "14 ounces semisweet or bittersweet chocolate, chopped",
        "1/4 cup light corn syrup",
        "2 cups sour cream",
        "1 1/2 teaspoons kosher salt",
        "1 1/2 teaspoons vanilla extract",
        "2 3/4 cups powdered sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "Special equipment: Three 9\"-diameter cake pans with 2\" sides"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Birthday",
        "Party",
        "Potluck",
        "Sour Cream",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Yellow Layer Cake with Chocolate-Sour Cream Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-layer-cake-with-chocolate-sour-cream-frosting-51118090"
}
