{
    "directions": [
        "In a medium bowl, combine the mushrooms with the olive oil, shallots, rosemary, and thyme; let sit for about 10 minutes.",
        "Light a fire in a charcoal or gas grill. Using tongs, remove the mushrooms from the marinade and grill until slightly softened and browned, about 2 minutes on each side. Set them aside. (You can also complete this step ahead of time, refrigerate the mushrooms, and then bring them to room temperature when you're ready to stuff the tomatoes.)",
        "Meanwhile, prepare the tomatoes so that you can use them to serve your salad in. Preheat the oven to 325° F. Using a sharp knife, slice the tops off the tomatoes either flat or in a zigzag pattern; you need them later so don't discard them. Using a melon baller or spoon, scoop out the insides. (You may want to save the insides for a sauce or another salad.) Set aside. Place the tomatoes into a 1-inch baking pan (you may have to adjust the bottoms—cutting carefully and only slightly—if they can't sit upright), with their tops. Bake until the skins start to wrinkle, about 15 minutes.",
        "When the tomatoes are finished, remove the tops and stuff with alternate layers of the mushroom mixture and the cheese. Place the tomatoes back into the oven (without the tops) just until the cheese starts to melt, about 5 minutes.",
        "Top each tomato with a bit of the mixed baby greens and a drizzle of the vinaigrette. Cover with the tomato tops, and serve."
    ],
    "ingredients": [
        "1 cup sliced oyster, shiitake, or portobello mushrooms (domestic or imported)",
        "2 tablespoons olive oil",
        "1 tablespoon minced shallots",
        "1/4 teaspoon chopped fresh rosemary",
        "1/4 teaspoon chopped fresh thyme",
        "4 perfectly ripe yellow (or red) medium-size beefsteak tomatoes",
        "1/4 cup fresh grated Parmesan cheese",
        "1 handful mixed baby greens",
        "Sweet Shallot Vinaigrette"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Marinate",
        "Fourth of July",
        "Vegetarian",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Advance Prep Required",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Yellow Tomatoes Stuffed with Grilled Wild Mushrooms and Parmesan Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-tomatoes-stuffed-with-grilled-wild-mushrooms-and-parmesan-cheese-358969"
}
