{
    "directions": [
        "Place noodles in a large bowl and pour boiling water over to cover. Let noodles soak until tender but not mushy, 10–15 minutes; drain. Rinse under cold water; snip into 2\" lengths with kitchen shears and return to bowl.",
        "Meanwhile, soak arame in 1/2 cup cold water in a small bowl until softened, 8–10 minutes. Drain; set aside.",
        "Whisk vinegar, soy sauce, mirin, lemon juice, chile, and oil in a large bowl. Transfer ⅓ cup lemon-chile shoyu to bowl with noodles and toss to coat. Add pear, sweet onion, yellowtail, mint, chives, reserved arame, and 2 tsp. sesame seeds to remaining shoyu in large bowl and gently toss; season with salt.",
        "Divide noodles among bowls and top with yellowtail mixture; sprinkle with gochugaru and more sesame seeds.",
        "Shoyu can be made 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "4 ounces thin bean thread noodles",
        "1/4 cup dried arame (seaweed)",
        "3 tablespoons unseasoned rice vinegar",
        "3 tablespoons white soy sauce",
        "2 tablespoons mirin",
        "2 teaspoons fresh lemon juice",
        "1 1/2 teaspoons finely grated green chile (such as serrano)",
        "1 teaspoon toasted sesame oil",
        "1 firm green pear, cut into matchsticks",
        "1/2 small sweet onion, cut lengthwise into quarters, thinly sliced crosswise",
        "12 ounces yellowtail, cut into 1/2-inch pieces",
        "1/2 cup torn mint leaves",
        "2 tablespoons finely chopped chives",
        "2 teaspoons toasted white and/or black sesame seeds, plus more for serving",
        "Kosher salt",
        "Gochugaru (coarse Korean hot pepper powder) or crushed red pepper flakes (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tuna",
        "Raw",
        "Fish",
        "Seafood",
        "Dinner",
        "Hawaii",
        "Chile Pepper",
        "Mint",
        "Pear"
    ],
    "title": "Yellowtail Poke With Glass Noodles and Pear",
    "url": "http://www.epicurious.com/recipes/food/views/yellowtail-poke-with-glass-noodles-and-pear"
}
