{
    "directions": [
        "Preheat oven to 425°F with rack in middle.",
        "Toss bell peppers with 1 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a 17-by 11-inch 4-sided sheet pan. Roast, turning once, until softened, 25 to 30 minutes.",
        "While bell peppers roast, heat 3 tablespoons oil with garlic in a 12-inch heavy skillet over medium heat until oil is hot. Add one third of squash with 1/4 teaspoon each of salt and pepper and cook, turning once, until just tender (do not overcook), 6 to 8 minutes total. Transfer cooked squash with garlic to a tray using a slotted spoon. Cook remaining squash in 2 batches with salt and pepper in same manner, using another tablespoon oil if necessary and transferring squash to tray.",
        "Add 1 tablespoon oil to skillet and cook onions with 1/2 teaspoon each of salt and pepper, stirring occasionally, until just tender, 16 to 18 minutes. Add vinegar and briskly simmer until liquid has evaporated. Cool to room temperature.",
        "Flip bottom of springform pan so lip is facing down (to make torte easier to slide off), then lock in place. Lightly oil pan. Layer one third of squash with garlic in pan, slightly overlapping. Sprinkle with some of grated cheese and basil. Layer half of bell peppers over squash, then half of onions and more cheese and basil. Repeat with half of remaining squash and all of remaining onions, then all remaining bell peppers, sprinkling with remaining cheese and basil. Arrange a final layer of squash on top.",
        "Put springform pan in a small baking pan and cover springform with plastic wrap. Place a small plate (to just fit inside springform) on top of vegetables, then weight with 2 or 3 heavy (15-to 19-ounces) cans. Chill until cold, at least 6 hours (torte will release liquid).",
        "Remove weights, plate, and plastic wrap. Remove torte from pan and put on a plate. Blot any excess moisture. Bring torte to room temperature and cut into wedges."
    ],
    "ingredients": [
        "4 yellow bell peppers, halved lengthwise, stemmed, and seeded",
        "5 to 6 tablespoons olive oil, divided",
        "6 garlic cloves, thinly sliced",
        "2 pounds yellow squash (4 medium), sliced diagonally 1/2 inch thick, divided",
        "1 pound red onions (2 medium), cut crosswise into 1/3-inch-thick rounds",
        "3 tablespoons red-wine vinegar",
        "1/2 cup grated Parmigiano-Reggiano",
        "1/3 cup chopped basil",
        "Equipment: an 8- to 9-inch springform pan",
        "Garnish: Parmigiano-Reggiano shavings and basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Vegetarian",
        "Dinner",
        "Casserole/Gratin",
        "Parmesan",
        "Basil",
        "Bell Pepper",
        "Chill",
        "Healthy",
        "Yellow Squash",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yellow Squash and Bell Pepper Torte",
    "url": "http://www.epicurious.com/recipes/food/views/yellow-squash-and-bell-pepper-torte-354988"
}
