{
    "directions": [
        "Child: Store the celery, zucchini, carrots, tomato, and potatoes in separate covered containers in the refrigerator until you need them the next day. The potatoes must be in cold water or they will turn a terrible gray color.",
        "Adult with Child: Place the beef and chicken in a large kettle with enough water to cover them. Bring to a boil, lower the heat, and simmer, until a froth forms. Remove the meat and bones and discard the water. Clean the kettle.",
        "Child: Put the beef and bones back in the kettle and cover with fresh water. Bring to a boil again. Lower the heat and add the unpeeled garlic cloves (by being left in their skins, they won't soften in cooking). Add the onions, turnip, and leeks or green onions. Cook, covered, about 1 1/2 hours, or until the meat seems fairly tender.",
        "Adult: Remove the marrow bones, add the chicken, cover, and simmer another 20 minutes. Let cool and refrigerate overnight.",
        "Child: Bring the soup to a boil. Add the celery, zucchini, carrots, tomato, and potatoes. Lower the heat, cover, and simmer another 20 minutes. Just before serving, add the parsley or coriander, salt, and hawayij, and cook, covered, for a few minutes.",
        "Adult: Remove the garlic cloves. Adjust the seasonings.",
        "Eat by dipping bread into the soup, scooping up the meat and vegetables and/or the sauce."
    ],
    "ingredients": [
        "3 celery stalks, cut into 2-inch pieces",
        "1 medium zucchini, peeled and cubed",
        "3 carrots, cut into 3-inch pieces",
        "1 large tomato, almost quartered but not cut apart at bottom",
        "3 potatoes, peeled and diced, kept in cold water",
        "3 pounds beef shoulder, ribs, or stew meat (fat removed)",
        "3 pieces (about 2 pounds) marrow bones",
        "1 3-pound chicken, cleaned and quartered",
        "Up to 5 quarts water",
        "10-12 cloves garlic, unpeeled",
        "9 small white onions",
        "1 large white turnip, quartered but unpeeled",
        "4 leeks or 8 green onions, coarsely cut",
        "1 small bunch fresh parsley or fresh coriander, woody stems trimmed away",
        "Salt to taste",
        "1 tablespoon hawayij (Yemenite spices), or to taste",
        "Storage cups for refrigerating",
        "Covered soup kettle",
        "Large slotted spoon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Chicken",
        "Garlic",
        "Onion",
        "Potato",
        "Tomato",
        "Kid-Friendly",
        "High Fiber",
        "Wheat/Gluten-Free",
        "Rosh Hashanah/Yom Kippur",
        "Celery",
        "Leek",
        "Zucchini",
        "Fall",
        "Kosher"
    ],
    "title": "Yemenite High Holy Day Soup",
    "url": "http://www.epicurious.com/recipes/food/views/yemenite-high-holy-day-soup-40002"
}
