{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Butter cake pan, then line bottom with a rectangle of parchment paper and butter parchment. Dust with flour, knocking out excess.",
        "Sift together cake flour, baking powder, baking soda, and salt.",
        "Beat together butter, sugar, and vanilla with an electric mixer at high speed until pale and fluffy, 3 to 5 minutes. Beat in eggs, 1 at a time, at medium speed. At low speed, mix in flour mixture in 3 batches, alternating with yogurt, beginning and ending with flour mixture, and mixing until just combined. Spread batter evenly in pan and rap pan on counter several times to eliminate air bubbles.",
        "Bake until cake pulls away from sides of pan and a wooden pick inserted in center comes out clean, 35 to 45 minutes. Cool in pan 10 minutes, then run a knife around edge. Invert onto a rack and discard parchment. Cool completely, about 1 hour.",
        "Stir together currants, 2 cups raspberries, sugar, and 1/8 teaspoon salt in a medium saucepan and let stand until juicy, about 15 minutes. Simmer, stirring occasionally, until fruit breaks down, about 8 minutes. Force through a fine-mesh sieve into a bowl, discarding solids. Cool sauce.",
        "Stir together confectioners sugar, corn syrup, cream, and vanilla until smooth.",
        "Put cake on a platter and spread icing on top in a thick layer, letting it run down sides. Let icing set at least 15 minutes. Serve with sauce and remaining 2 cups raspberries on the side."
    ],
    "ingredients": [
        "3 cups sifted cake flour (not self-rising; sift before measuring)",
        "2 teaspoons baking powder",
        "1 teaspoons baking soda",
        "1/2 teaspoon salt",
        "2 sticks unsalted butter, softened",
        "2 cups granulated sugar",
        "2 teaspoons pure vanilla extract",
        "3 large eggs, warmed in shell in warm water 10 minutes",
        "2 cups well-stirred plain whole-milk yogurt (not Greek-style) atroom temperature 30 minutes",
        "2 cups fresh red currants (1/2 pound), stemmed",
        "4 cups fresh raspberries (16 ounces), divided",
        "2/3 cup granulated sugar room temperature 30 minutes",
        "3 cups confectioners sugar",
        "3 tablespoons light corn syrup",
        "1/2 cup heavy cream",
        "Scant 1/2 teaspoon pure vanilla extract",
        "Equipment: a 13- by 9-inch cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Bake",
        "Currant",
        "Raspberry",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Yogurt Cake with Currant Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/yogurt-cake-with-currant-raspberry-sauce-354477"
}
