{
    "directions": [
        "In a small bowl, combine the yogurt, onion, garlic, lemon, mint, and olive oil. Cut the chicken into 1- to 2-inch (2.5 to 5 cm) pieces and place them in a medium bowl or a plastic ziplock bag. Pour the marinade over the chicken, cover the bowl or seal the bag, and refrigerate for at least 8 and up to 24 hours (the longer, the more flavorful).",
        "Preheat a grill or broiler on medium-high. Place the chicken in a colander and drain off the marinade. Pat the chicken dry with paper towels. Thread 6 skewers with the chicken, leaving some breathing room (about 1/8 inch / 3 mm) between the pieces. Generously season the chicken all over with salt and pepper.",
        "Grill the chicken over medium-high heat, or broil them on a broiler or sheet pan, until the chicken is cooked through and is slightly charred around the edges, about 10 minutes on the grill and about 20 minutes under the broiler. Turn the skewers over halfway through cooking.",
        "Remove the cooked chicken from the skewers with a fork. Serve the chicken hot with the toum, either on the side for dipping or drizzled over the chicken after it has been removed from the skewers."
    ],
    "ingredients": [
        "1 cup (245 g) plain, unsweetened whole milk yogurt",
        "1 medium-size sweet onion, grated",
        "3 garlic cloves, minced",
        "Juice of 1/2 lemon",
        "2 tablespoons crushed dried mint",
        "3 tablespoons extra-virgin olive oil",
        "4 skinless, boneless free-range chicken breast halves",
        "1 teaspoon kosher salt, plus more as needed",
        "Few grinds of black pepper",
        "1 recipe Toum"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Skewer",
        "Garlic",
        "Mint",
        "Yogurt",
        "Dinner",
        "Grill"
    ],
    "title": "Yogurt Marinated Chicken Skewers With Toum Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/yogurt-marinated-chicken-skewers-with-toum-garlic-sauce"
}
