{
    "directions": [
        "In a small bowl, sprinkle the gelatin over 1/2 cup (4 fl. oz./125 ml) of the milk. Let stand without stirring until the gelatin is moistened, about 10 minutes.",
        "Pour the remaining 1 cup (8 fl. oz./250 ml) milk into a small saucepan. Scrape the seeds from the vanilla bean into the milk, then add the pod. Add the sugar and orange zest strips. Set the pan over medium heat and bring to a simmer, stirring to dissolve the sugar. Remove from the heat. Add the gelatin mixture and stir until completely dissolved, 3 to 5 minutes. Transfer to a large bowl and let cool until lukewarm, about 10 minutes. Remove the vanilla bean and zest strips. Whisk in the yogurt until well blended.",
        "Divide the yogurt mixture among six 3/4-cup (6-fl.-oz./180-ml) ramekins or custard cups. Cover each with plastic wrap and refrigerate until set, at least 8 hours or up to 2 days.",
        "To make the compote, using a sharp knife, cut a slice off both ends of each orange to reveal the flesh. Place the orange upright on a cutting board and cut downward to remove all of the peel and white pith, following the contour of the fruit. Holding the fruit over a bowl to catch the juices, cut on either side of each segment to free it from the membrane, letting it fall into the bowl. In a small saucepan over medium-high heat, combine the sugar, lemon juice and water and bring to a boil. Remove the syrup from the heat and pour over the oranges. Refrigerate until chilled, then stir in the pomegranate seeds.",
        "To serve, top the panna cotta with spoonfuls of the compote. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Dessert of the Day,",
        "by Kim Laidlaw (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "2 1/4 tsp. (1 package) unflavored powdered gelatin",
        "1 1/2 cups (12 fl. oz./375 ml) whole milk",
        "1 vanilla bean, split lengthwise",
        "1/2 cup (4 oz./125 g) sugar",
        "3 orange zest strips, each 2 to 3 inches (5 to 7.5 cm) long",
        "2 cups (1 lb./500 g) plain whole-milk yogurt",
        "2 1/2 lb. oranges or tangerines",
        "1/4 cup (2 oz./60 g) sugar",
        "1 Tbs. fresh lemon juice",
        "1/4 cup (2 fl. oz./60 ml) water",
        "1/4 cup (1 oz./30 g) pomegranate seeds"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Yogurt Panna Cotta with Orange-Pomegranate Compote",
    "url": "http://www.williams-sonoma.com/recipe/yogurt-panna-cotta-flecked-with-vanilla-bean.html"
}
