{
    "directions": [
        "Bring the water a boil in a saucepan. Stir barley into the water and return to a boil; reduce heat to medium low, cover, and simmer until the moisture is completely absorbed, about 45 minutes. Remove from heat, fluff with a fork, and set aside.",
        "Heat 2 tablespoons olive oil in a large skillet over medium heat; cook the garlic, about 1/4 of the white part of the green onion, and a pinch of salt in the hot oil until the onion begins to turn glassy, 1 to 2 minutes. Stir the tofu into the onion and garlic; continue cooking and stirring another 4 to 5 minutes. Remove the tofu from the skillet to a bowl and set aside.",
        "Pour 2 tablespoons olive oil into the skillet; when the oil is again hot, cook the remaining white part of the green onion in the hot oil with a pinch of sea salt until they are soft and translucent. Stir the yogurt, green onion, oregano, and flour together in a small bowl and add to the skillet along with the cooked barley; mix thoroughly and cook until the mixture begins to bubble. Fold the tofu into the mixture; continue cooking until thoroughly reheated, 1 to 2 minutes. Season with pepper and remove from heat. Sprinkle paprika over the dish to serve."
    ],
    "ingredients": [
        "3 cups water",
        "1 cup white pearl barley",
        "2 tablespoons olive oil",
        "2 tablespoons minced garlic",
        "1 large green onion, white and green parts separated and chopped",
        "1 pinch salt",
        "1 (8 ounce) container extra firm tofu, drained and cubed",
        "2 tablespoons olive oil",
        "coarse sea salt",
        "1 1/2 cups Greek-style yogurt",
        "4 1/2 teaspoons dried oregano",
        "2 tablespoons all-purpose flour",
        "ground black pepper to taste",
        "1 pinch paprika, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Yogurty Tofu Barley Simmer",
    "url": "http://allrecipes.com/recipe/205087/yogurty-tofu-barley-simmer/"
}
