{
    "directions": [
        "Combine shallot, vinegar, and lemon juice in a small bowl. Season with salt and let sit 20 minutes to lightly pickle.",
        "Using a spoon, scoop avocado flesh into a food processor; discard skins. Puree until smooth. Add preserved lemon, yogurt, oil, and shallot along with pickling liquid; season with salt and pulse to combine.",
        "Transfer avocado mixture to a medium bowl and stir in herbs. Taste and adjust seasoning with salt and/or more lemon juice, if needed.",
        "Herbed avocado can be made 1 day ahead. Cover, pressing plastic wrap directly onto surface, and chill.",
        "Whisk lemon juice and agave in a medium bowl; season with salt. Whisk in grapeseed oil, then olive oil. Taste vinaigrette and adjust seasoning with more salt if needed.",
        "Vinaigrette can be made 5 days ahead. Cover and chill.",
        "Toss lettuces, spicy greens, herbs, and edible flowers in a large bowl to combine. Drizzle about half of lemon vinaigrette over and toss to coat. Season salad with salt.",
        "Spoon 2 dollops of herbed avocado onto each plate and loosely mound salad over top. Scatter pistachios over and around salad and drizzle with remaining lemon vinaigrette."
    ],
    "ingredients": [
        "1 small shallot, finely chopped",
        "1 tablespoon Champagne vinegar or white wine vinegar",
        "1 tablespoon (or more) fresh lemon juice",
        "Kosher salt",
        "2 large avocados, pitted",
        "1/2 preserved lemon, seeds removed, finely chopped",
        "3/4 cup plain whole-milk Greek yogurt",
        "2 tablespoons olive oil",
        "1/4 cup finely chopped tender herbs (such as cilantro, parsley, tarragon and/or mint)",
        "2 tablespoons fresh lemon juice",
        "2 teaspoons light agave syrup (nectar)",
        "Kosher salt",
        "2 tablespoons grapeseed or vegetable oil",
        "1 tablespoon olive oil",
        "3 heads of baby romaine, red leaf, or Little Gem lettuces, leaves separated",
        "2 cups spicy greens (such as mizuna, watercress, buckwheat sprouts, or purslane)",
        "1 cup tender herbs (such as mint leaves, cilantro leaves, and/or fennel fronds)",
        "1/2 cup edible flowers (such as nasturtiums, bachelor's buttons, and/or pansies)",
        "Flaky sea salt",
        "1/2 cup finely chopped unsalted, roasted pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Side",
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Yogurt",
        "Pistachio",
        "Avocado",
        "Healthy",
        "Low Cholesterol",
        "Lettuce",
        "Lemon Juice",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Young Lettuces With Herbed Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/young-lettuces-with-herbed-avocado-56389981"
}
