{
    "directions": [
        "In 10-inch sauté pan over moderately high heat, bring vegetable stock and salt to boil. Add peas and simmer, uncovered, until bright green and almost tender, 1 to 2 minutes.",
        "Transfer peas and cooking liquid to blender and blend on high until very smooth, about 1 minute. Set aside. (Purée can be made ahead and refrigerated, tightly wrapped in plastic wrap, up to 12 hours. To maintain peas' vibrant green color, cool purée over ice bath before refrigerating.)",
        "In medium saucepan over moderate heat, stir together buttermilk, yuba, peas, and 1/4 teaspoon salt. Bring to simmer, then reduce heat to low, cover, and cook until peas are just tender, about 2 minutes. Stir in pea purée and fava leaves, cover, and cook until fava leaves are wilted, about 30 seconds. Remove from heat and stir in basil, remaining 1/4 teaspoon salt, and pepper. Serve immediately."
    ],
    "ingredients": [
        "1/2 cup homemade or purchased vegetable stock",
        "1/4 teaspoon fine sea salt",
        "2 cups (12 ounces) fresh English peas",
        "2 cups Homemade Buttermilk or whole milk (see Test-Kitchen Tips, below)",
        "6 sheets fresh or frozen (thawed) yuba (about 6 ounces) cut in half lengthwise and then crosswise into 1-inch-wide strips (see Test-Kitchen Tips, below)",
        "1 cup (6 ounces) fresh English peas",
        "1/2 teaspoon fine sea salt",
        "1 cup fresh fava leaves, loosely packed (see Test-Kitchen Tips, below)",
        "1/2 cup fresh basil leaves, torn and loosely packed (about 24 leaves)",
        "1/4 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Soy",
        "Dinner",
        "Basil",
        "Pea",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yuba Pappardelle with English Peas, Fava Leaves, and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/yuba-pappardelle-with-english-peas-fava-leaves-and-basil-242046"
}
