{
    "directions": [
        "Put pork in a large bowl and rub with 1 teaspoon salt and 2 tablespoons juice.",
        "Toast peppercorns, cumin, and allspice together, then cool slightly. Transfer to grinder along with annatto seeds and grind to a powder. Transfer to a small bowl.",
        "Mince garlic and mash to a paste with remaining 1 1/2 teaspoons salt using side of a large heavy knife. Add to ground spices along with oregano and remaining 6 tablespoons juice and stir to make a paste.",
        "Toss pork with paste to coat well. Add onion and toss to combine.",
        "Holding both ends of a banana leaf, drag leaf over a burner on moderately high heat slowly until it changes color slightly and becomes shinier, then turn over and toast other side. Toast remaining banana leaves in same manner.",
        "Line roasting pan with leaves, shinier sides down, by arranging 1 leaf lengthwise and 2 leaves crosswise, letting excess hang over sides. Trim overhang to about 8 inches on all sides.",
        "Transfer pork mixture to banana leaves, then fold overhang of leaves over pork to enclose completely. Cover pan tightly with foil and chill, at least 6 hours.",
        "Put oven rack in middle position, then put pan with pork in oven and heat to 400°F (to take chill off pork gently).",
        "Once oven has reached 400°F, bake until pork is very tender, 2 1/4 to 2 3/4 hours.",
        "Discard foil and open banana leaves, then serve pork with salsa and tortillas."
    ],
    "ingredients": [
        "6 pound boneless pork shoulder (not lean), cut into 3-inch chunks",
        "2 1/2 teaspoons salt",
        "1/2 cup fresh Seville (bitter) orange juice",
        "1 teaspoon black peppercorns",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon whole allspice",
        "3 tablespoons annatto (achiote) seeds",
        "6 garlic cloves",
        "1 teaspoon dried oregano (preferably Mexican), crumbled",
        "1 large white onion, halved lengthwise, then cut crosswise into 1/2-inch slices",
        "3 fresh or thawed frozen banana leaves",
        "Special equipment : an electric coffee/spice grinder; a 15- by 1O-inch roasting pan (2 inches deep)",
        "Accompaniments: habanero salsa ; warm tortillas or rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Onion",
        "Pork",
        "Bake",
        "Freeze/Chill",
        "Gourmet"
    ],
    "title": "Yucatecan-Style Pork",
    "url": "http://www.epicurious.com/recipes/food/views/yucatecan-style-pork-238432"
}
