{
    "directions": [
        "About an hour before serving the dessert, rinse the strawberries (stems on) and drain them on paper towels. Slice off the stems and halve or quarter the strawberries lengthwise, depending on size, into a bowl. Sprinkle over the sugar and the lemon juice; fold gently together to blend well. Taste a strawberry, add more sugar or lemon juice if needed, and set aside to macerate.",
        "If you want to serve the sabayon warm, make it at the last minute. If you want to glaze the sabayon under the broiler, or make it ahead of time to serve chilled, have ready a large bowl (larger than the one in which you whip the sauce) partly filled with ice cubes.",
        "Whisk to blend the yolks, Marsala, and sugar in the stainless-steel bowl. Rest the bowl in the saucepan over hot water. Whisk constantly for 4 to 5 minutes or more to cook the sauce, until it has the consistency of lightly whipped cream. Clear the bottom of the bowl constantly with the whisk so that the eggs do not scramble, and adjust the heat as needed. Taste the sauce — the sabayon should never get so hot that you can't stick your very clean finger in it — and whisk drops of lemon juice or more sugar if you want. When thick, foamy, and tripled in volume, remove from heat. It can be served hot as is, tepid, or cool.",
        "Spoon a portion of strawberries — 1/2 cup or more — into each goblet or glass, and top with 1/3 to 1/2 cup of warm or cool sabayon. Or put the sauce in the glass first, then the strawberries.",
        "Cool the sabayon to room temperature. Whip the cream and sugar until soft peaks form, and fold the cream into the sabayon with a rubber spatula.",
        "Turn on the broiler. Spread the strawberries in the baking dish in one layer (or in individual dishes). Spoon the sauce over the berries so they are completely covered and set the dish under the broiler, 5 to 6 inches from the heat. With the door open — so you can watch carefully — broil for a minute or two, turning the dish as needed to glaze evenly, until the top of the sabayon is nicely browned and slightly crusted. Serve right away."
    ],
    "ingredients": [
        "1 to 1 1/2 pounds fresh ripe strawberries (3 pints)",
        "1 tablespoon sugar, plus more to taste",
        "2 teaspoons freshly squeezed lemon juice, plus more to taste",
        "6 egg yolks",
        "1 cup sweet Marsala wine or port, sherry, or Madeira",
        "1/3 cup sugar, plus more to taste",
        "Drops of freshly squeezed lemon juice (optional)",
        "1/2 cup heavy cream",
        "1 teaspoon sugar",
        "Special equipment: A large stainless steel or copper bowl, plus a larger bowl for holding (optional)",
        "A large saucepan of simmering water",
        "A balloon whisk",
        "Dessert goblets or large martini glasses, or a medium gratin baking dish (4-cup volume) or individual gratin dishes (for glazed sabayon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Dessert",
        "Strawberry",
        "Marsala",
        "Fall"
    ],
    "title": "Sabayon with Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/sabayon-with-strawberries-105472"
}
