{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a 9-inch springform pan; place a circle of parchment paper inside, and butter that as well.",
        "Melt 4 ounces of chocolate in a metal bowl placed over gently simmering water. Stir frequently until melted, then remove from the heat and let cool slightly.",
        "Beat the butter together with confectioners' sugar until creamy. Mix in the melted chocolate, then beat in the egg yolks, one at a time. In a clean bowl, beat egg whites with white sugar until stiff and glossy. Fold into chocolate mixture, then fold in cake flour, until incorporated. Pour into prepared springform pan, and smooth the top.",
        "Bake in the preheated oven until the edges begin to pull away from the sides of the pan, and a toothpick inserted into the center comes out dry, about 45 minutes. Cool pan on a wire rack for 15 minutes, then run a small knife around the edge and remove the sides of the pan. Allow cake to cool completely on the base of the pan. When cool, remove from pan, and remove parchment paper; slice cake in half horizontally.",
        "Bring 1/4 cup water and sugar to a boil in a small saucepan. When the sugar has dissolved and the syrup is clear, remove from heat and stir in 2 tablespoons rum. Brush 1/3 of the syrup onto the cut side of the cake bottom.",
        "Puree the apricot preserves with 1 tablespoon of water until smooth. Bring to a simmer over medium heat in a small saucepan, and cook until thickened, about 2 minutes. Stir in remaining rum, then spread 1/3 of the jam mixture onto the cut side of the cake bottom. Place the top of the cake onto the bottom. Brush the outside of the cake with the remaining syrup, then spread remaining apricot preserves over the top and sides; refrigerate until the icing is ready.",
        "To make the icing, melt 9 ounces of chocolate over a double boiler or in the microwave until smooth. Bring the cream to a simmer in a small saucepan, then stir into melted chocolate. Cool slightly, stirring often, until the chocolate reaches a spreadable consistency.",
        "Set the cake on a cooling rack set over a cookie sheet or waxed paper to catch any drips. Pour the icing on top of the cake, and spread around the edges; allow excess icing to drip through the rack. Cool cake to room temperature, then carefully remove from the cooling rack using a spatula. Transfer to a dessert plate and store in the refrigerator. Allow cake to come to room temperature before serving."
    ],
    "ingredients": [
        "Cake:",
        "4 ounces semi sweet chocolate (chopped)",
        "1/2 cup butter, softened",
        "1/4 cup confectioners' sugar",
        "2 teaspoons confectioners' sugar",
        "6 eggs, separated",
        "1/2 cup white sugar",
        "2 tablespoons white sugar",
        "1 cup cake flour",
        "Filling:",
        "1/4 cup water",
        "1/4 cup white sugar",
        "3 tablespoons dark rum, divided",
        "1 (12 ounce) jar apricot preserves",
        "1 tablespoon water",
        "Icing:",
        "9 ounces semisweet chocolate, chopped",
        "3 ounces heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sacher Torte",
    "url": "http://allrecipes.com/recipe/110312/sacher-torte/"
}
