{
    "directions": [
        "Heat olive oil in a very large skillet or paella pan over medium-high heat. Add the head-on shrimp and sear on each side until they turn orange and have lightly browned (they should still be raw on the inside). Remove the shrimp and set aside.",
        "Reduce heat to medium and stir in red onion and garlic. Cook for a few minutes until the onion has softened and turned translucent. Stir in Arborio rice until coated with oil. Pour in the fish stock and season with saffron, paprika, lemon zest, and oregano. Bring to a simmer over medium-high heat then stir in sea salt to taste. Reduce heat to medium-low and gently simmer uncovered for 15 minutes, stirring occasionally.",
        "Decoratively nestle the mussels and head-on shrimp into the rice, cover, and simmer for 5 minutes. Next, push the red snapper and deveined shrimp into the rice, recover and simmer an additional 10 minutes. Finally, add lobster and sprinkle with diced tomatoes. Cover and simmer until the mussels have opened, the rice is tender, and the lobster is hot; about 5 minutes more.",
        "Serve in the paella pan garnished with lemon wedges."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "16 head-on medium shrimp",
        "1 red onion, diced",
        "2 teaspoons minced garlic",
        "2 cups Arborio rice",
        "5 1/2 cups hot fish stock",
        "1/4 teaspoon saffron threads",
        "1 1/2 teaspoons smoked paprika",
        "1 teaspoon lemon or lime zest",
        "1 tablespoon chopped fresh oregano",
        "sea salt to taste",
        "16 mussels, scrubbed and debearded",
        "1 pound red snapper fillets, cut into 1 inch pieces",
        "1/4 pound medium shrimp, peeled and deveined",
        "1 (10 ounce) cooked lobster tail, cut into 1/2-inch thick slices",
        "2 tomatoes, seeded and diced",
        "2 lemons, cut into wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Saffron-Scented Lobster Paella",
    "url": "http://allrecipes.com/recipe/103510/saffron-scented-lobster-paella/"
}
