{
    "directions": [
        "Rinse marrowbones, then cover with cold water in a large bowl and soak, covered and chilled, at least 2 hours and up to 24. Scrape off any bone fragments from exposed marrow with a knife. Push marrow out of 1 bone by pressing on smaller opening (marrow will be forced out opposite end). Discard bone and repeat with remaining bones. Pat marrow dry, then cut crosswise into 1/2-inch-thick slices, removing and discarding any connective tissue or bone fragments. Transfer to a plate and chill, covered.",
        "Bring demi-glace concentrate and 6 cups fresh water to a simmer in a 2-quart heavy saucepan, whisking, until concentrate is dissolved (to make stock), then bring to a simmer. Transfer 1 cup stock to a measuring cup and stir in saffron. Keep remaining stock at a bare simmer, covered.",
        "Cook shallot in 3 tablespoons butter in a 3- to 4-quart heavy saucepan over moderate heat, stirring occasionally, until softened, about 3 minutes. Add rice and cook, stirring, 1 minute. Add wine and simmer, stirring, until liquid is absorbed.",
        "Add 1/2 cup hot stock (without saffron), salt, and pepper and simmer briskly, stirring frequently with a long-handled wooden spoon, until stock is absorbed. Continue simmering and adding hot stock, 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding the next, 10 minutes. Add half of saffron broth and simmer, stirring, until absorbed. Add remaining saffron broth and simmer, stirring, until absorbed. Continue simmering and adding stock mixture, 1/2 cup at a time, until rice is very creamy-looking but still al dente, 18 to 25 minutes total (there will be stock left over). Remove from heat and stir in cheese and remaining 2 tablespoons butter.",
        "Heat dry cast-iron skillet over high heat until smoking, then add marrow all at once and quickly arrange, cut sides down, in 1 layer using tongs. Sear marrow, turning over once carefully (fat will splatter), until golden and translucent, 1 to 2 minutes total. Transfer marrow with a slotted spoon to paper towels to drain.",
        "If risotto seems dry, thin to a creamy consistency with some of remaining hot stock. Divide risotto among 6 bowls and top with marrow. Sprinkle with sea salt. Serve immediately, with additional cheese."
    ],
    "ingredients": [
        "9 (2-inch-long) center-cut beef or veal marrowbones (2 1/2 to 3 lb)",
        "1/4 cup beef-veal demi-glace concentrate such as More than Gourmet (2 1/2 ounces)",
        "6 cups water",
        "1/4 teaspoon crumbled saffron threads",
        "1/4 cup minced shallot (1 large)",
        "5 tablespoons unsalted butter",
        "1 1/4 cups Carnaroli or Arborio rice",
        "1/2 cup dry white wine",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 ounce finely grated Parmigiano-Reggiano (1/2 cup) plus additional for serving",
        "Special equipment: a well-seasoned 10-inch cast-iron skillet",
        "Garnish: coarse sea salt (crushed if large)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Dairy",
        "Rice",
        "Dinner",
        "Meat",
        "Saffron",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Saffron Risotto with Marrow",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-risotto-with-marrow-236965"
}
