{
    "directions": [
        "Crush saffron, if using, with the handle of a wooden spoon (or crush between your fingers) in a small bowl until a powder forms. Add 1 Tbsp. hot water. Swirl gently; set aside to steep.",
        "Heat 1 Tbsp. oil in a large pot over medium-high. Add almonds, cinnamon, cayenne, and 1/4 tsp. salt and cook, stirring occasionally, until toasted and fragrant, about 2 minutes. Using a slotted spoon, transfer almonds to a small bowl; reserve oil in pot.",
        "Heat oil in pot over medium-high. Add onion and remaining 2 Tbsp. oil and 1 1/2 tsp. salt, reduce heat to medium, and cook until onion is light brown and translucent, about 5 minutes. Add quinoa and cook, tossing to coat, until fragrant and beginning to brown, 1–2 minutes.",
        "Stir in 4 cups water, cover pot, and bring to a boil. Reduce heat to low and simmer until quinoa is cooked and water is absorbed, 20–30 minutes. Remove from heat, sprinkle cherries over, cover, and let sit 10 minutes.",
        "Transfer 2 cups quinoa mixture to a medium bowl. Reserve 1/2 cup toasted almonds, then toss remaining almonds with remaining quinoa mixture and transfer to a platter. Toss quinoa in bowl with saffron water until coated, then garnish platter with saffron quinoa. Top with remaining toasted almonds.",
        "Quinoa, with cherries, can be cooked 3 days ahead. Transfer to a resealable container and chill. Reheat over low on stovetop or in a 300°F oven until warmed."
    ],
    "ingredients": [
        "1/4 teaspoon saffron threads (optional)",
        "3 tablespoons coconut oil or olive oil, divided",
        "1 1/2 cups sliced almonds",
        "1 teaspoon ground cinnamon",
        "Pinch of cayenne pepper",
        "1 3/4 teaspoons kosher salt, divided",
        "1 medium onion, chopped",
        "2 cups quinoa",
        "1 1/2 cups dried cherries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Passover",
        "Quinoa",
        "Spring",
        "Dried Fruit",
        "Cherry",
        "Saffron",
        "Almond",
        "Wheat/Gluten-Free",
        "Vegetarian",
        "Vegan"
    ],
    "title": "Saffron Quinoa with Dried Cherries and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-quinoa-with-dried-cherries-and-almonds"
}
