{
    "directions": [
        "In a small bowl combine yeast and granulated sugar and stir in 1 1/4 cups lukewarm water. Let mixture stand until foamy, about 10 minutes. In another small bowl combine boiling water and saffron.",
        "Into a bowl sift 1 1/2 cups flour and stir in yeast mixture and powdered milk, stirring to make a batter. Let batter rise, covered with plastic wrap, in a warm place 30 minutes.",
        "In bowl of a standing electric mixer stir together remaining 4 cups flour, superfine sugar, and salt and blend in butter until mixture resembles coarse meal. Add batter, saffron mixture, and remaining 3/4 cup lukewarm water and with paddle attachment beat on low speed until smooth, soft, and sticky. Let dough rise, covered with plastic wrap, in a warm place until doubled in bulk, about 1 hour.",
        "Preheat oven to 375°F. and butter eighteen 1/2-cup muffin tins.",
        "Punch down dough and beat with paddle attachment on low speed 5 minutes. Add orange peel, raisins, and currants and beat until combined well. With a 1/4-cup measure scoop dough into muffin tins and let rise, covered with buttered wax paper and kitchen towels, in a warm place until dough is level with tops of tins, about 30 minutes.",
        "Bake cakes in middle of oven 20 minutes, or until golden, and cool on racks. Cakes may be made 1 day ahead and cooled before keeping in airtight containers."
    ],
    "ingredients": [
        "a 1/4-ounce package active dry yeast (2 1/2 teaspoons)",
        "1 teaspoon granulated sugar",
        "2 cups lukewarm water",
        "3 tablespoons boiling water",
        "a slightly rounded 1/4 teaspoon saffron threads",
        "5 1/2 cups bread flour",
        "1 tablespoon nonfat powdered milk",
        "4 tablespoons superfine sugar",
        "1 1/2 teaspoons salt",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into pieces",
        "1/2 cup chopped glacéed orange peel*",
        "1/2 cup golden raisins",
        "1/2 cup dried currants",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Currant",
        "Orange",
        "Raisin",
        "Saffron",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Saffron Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-cakes-13139"
}
