{
    "directions": [
        "Stir saffron threads in dry skillet over medium-low heat just until brittle and slightly darkened, being careful not to burn saffron, about 20 seconds. Transfer saffron to mortar and grind with pestle to fine powder. Mix butter and half of ground saffron in small bowl to blend; cover and refrigerate. Add 2 tablespoons oil to remaining saffron in mortar, scraping sides and bottom of mortar with rubber spatula to blend well.",
        "Place chicken breasts in large bowl. Add saffron oil, parsley, lemon peel, and 2 teaspoons thyme leaves; toss to coat chicken. Cover and refrigerate at least 4 hours or overnight.",
        "Heat 1 tablespoon oil in each of 2 large nonstick skillets over medium-high heat. Sprinkle chicken with salt and pepper. Add 3 chicken breasts to each skillet, skin side down. Cook until skin is deep golden brown, about 6 minutes. Turn chicken over; reduce heat to medium and cook until chicken is cooked through, about 8 minutes longer. Transfer chicken to platter; cover and keep warm.",
        "Add white parts of green onions and remaining 1 teaspoon thyme to one skillet; sauté over medium heat until onions are translucent, about 3 minutes. Add saffron butter, pea shoots, green parts of green onions, and 1 tablespoon water; stir until pea shoots are barely wilted, about 10 seconds. Remove from heat; stir in mint and lemon juice. Season to taste with salt and pepper.",
        "Divide English Pea Puree among 6 plates. Top with chicken. Spoon pea shoots mixture and juices over and serve."
    ],
    "ingredients": [
        "1/4 teaspoon saffron threads",
        "3 tablespoons butter, room temperature",
        "4 tablespoons extra-virgin olive oil, divided",
        "6 large boneless chicken breast halves with skin",
        "2 tablespoons chopped fresh Italian parsley",
        "1 tablespoon (scant) finely grated lemon peel",
        "3 teaspoons fresh thyme leaves, divided",
        "2 1/2 cups sliced green onions, white and green parts separated",
        "6 cups loosely packed fresh pea shoots or pea sprouts (about 4 ounces)",
        "1 tablespoon water",
        "1/4 cup torn fresh mint leaves",
        "2 teaspoons fresh lemon juice",
        "English Pea Puree"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Marinate",
        "Sauté",
        "High Fiber",
        "Mint",
        "Saffron",
        "Pea",
        "Spring"
    ],
    "title": "Saffron Chicken Breasts with English Pea Purée, Pea Shoots, and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-chicken-breasts-with-english-pea-puree-pea-shoots-and-mint-234429"
}
