{
    "directions": [
        "Bring all ingredients to boil in very large pot. Reduce heat to medium-low, partially cover, and simmer 2 hours, stirring occasionally. Strain broth into another pot. Spoon 1/4 cup fat from top of broth and place in medium bowl; add 1/4 cup broth. Cool fat mixture and reserve for matzo balls. Remove enough meat from chicken wings to measure 1 generous cup. Finely mince chicken; reserve for matzo balls. Chill remaining broth until ready to use. (Can be made 2 days ahead. Cover and keep chilled.)",
        "Whisk eggs, salt, and pepper into chicken fat mixture. Mix in matzo meal, then spinach and reserved minced chicken. Cover and chill until firm, at least 1 hour and up to 1 day.",
        "Bring large pot of generously salted water to boil. Using wet hands and about 2 tablespoons for each, shape matzo mixture into 16 balls; drop into boiling water. Reduce heat to low, cover pot, and simmer until tender, about 45 minutes. Using slotted spoon, transfer matzo balls to 13x9x2-inch dish. (Can be made 1 day ahead; chill.)",
        "Skim any fat from top of broth; bring to simmer. Season with salt and pepper. Add cooked matzo balls; simmer until heated through, about 10 minutes. Ladle broth and 2 matzo balls into each of 8 bowls and serve."
    ],
    "ingredients": [
        "6 pounds chicken wings",
        "16 cups water",
        "1 1/2 pounds onions, quartered",
        "6 bay leaves",
        "1 tablespoon coarse kosher salt",
        "1 1/2 teaspoons saffron threads",
        "1/2 teaspoon whole black peppercorns",
        "4 large eggs",
        "1 1/4 teaspoons coarse kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 cup unsalted matzo meal",
        "1 10-ounce package frozen chopped spinach, thawed, squeezed dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Passover",
        "Saffron",
        "Spinach",
        "Spring",
        "Kosher"
    ],
    "title": "Saffron Chicken Broth with Spinach Matzo Balls",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-chicken-broth-with-spinach-matzo-balls-231865"
}
