{
    "directions": [
        "Combine milk, cardamom pods, and saffron in small saucepan; bring to simmer. Swirl pan to distribute saffron; remove from heat. Cover and let steep until instant-read thermometer inserted into milk mixture registers 110°F, about 20 minutes.",
        "Strain milk mixture into bowl of stand mixer fitted with paddle attachment; discard solids in strainer. Sprinkle yeast and 1 teaspoon sugar over milk mixture. Let stand until yeast is dissolved and mixture is foamy, about 10 minutes. Mix in remaining 1/2 cup sugar, butter, 4 eggs, and salt. Add 2 cups flour and beat on low speed until smooth. Increase speed to medium. Gradually add 2 1/2 cups flour; beat until smooth. Beat in candied orange peel and raisins. Continue beating until dough pulls away fromsides of bowl in long stretchy strands, about 3 minutes (dough will be sticky). Butter large bowl; scrape dough into bowl and cover with plastic wrap, then towel. Let rise in warm draft-free area until doubled, about 2 hours.",
        "Butter 10x4-inch angel food cake pan. Using rubber spatula, press lightly on dough to release air. Turn out onto lightly floured surface; form into 18- to 20-inch rope. Transfer to prepared pan and wrap around center tube, pushing and pinching ends together and pressing top of dough slightly with rubber spatula to distribute evenly. Cover loosely with plastic wrap, then towel. Let dough rise in warm draft-free area until almost doubled, about 45 minutes.",
        "Position rack in center of oven and preheat to 350°F. Brush top of dough with beaten egg white. Sprinkle with crushed sugar cubes. Bake until golden brown and tester inserted near center comes out clean, about 45 minutes. Cool in pan on rack about 30 minutes. Turn out onto rack to cool completely. (Can be made 1 day ahead. Wrap in foil; store at room temperature.)",
        "*Candied orange peel can be found at specialty foods stores or at chefshop.com.",
        "Beating the dough until it forms stretchy strands traps air bubbles that expand with heatthus helping the dough rise."
    ],
    "ingredients": [
        "1 cup whole milk",
        "8 green cardamom pods",
        "1/8 teaspoon crumbled saffron threads",
        "2 envelopes active dry yeast",
        "1 teaspoon plus 1/2 cup sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "4 large eggs",
        "3/4 teaspoon salt",
        "4 1/2 cups all purpose flour",
        "1 cup diced candied orange peel*",
        "1 cup golden raisins",
        "1 egg white, beaten to blend",
        "8 sugar cubes, coarsely crushed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Herb",
        "Breakfast",
        "Brunch",
        "Bake",
        "Raisin",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Saffron Panettone with Crushed Sugar Topping",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-panettone-with-crushed-sugar-topping-233914"
}
