{
    "directions": [
        "Pulse all sauce ingredients in a food processor until smooth. Transfer to a small bowl and chill, covered, until ready to use.",
        "Sprinkle saffron into water in a 1-quart heavy saucepan and boil over moderately high heat until liquid is reduced to 1 tablespoon, about 5 minutes. Remove from heat and transfer to a small bowl, then cool completely.",
        "Heat oil (1 tablespoon) in a 10-inch heavy skillet over moderate heat until hot but not smoking, then cook onion, carrot, and celery, stirring occasionally, until pale golden, about 8 minutes. Transfer to a plate to cool.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 400°F. Line 2 baking sheets with parchment paper and lightly brush parchment with oil.",
        "Whisk together 1 egg, cream, 1/8 teaspoon salt, and 1/2 teaspoon pepper.",
        "Pat shrimp dry and transfer half of shrimp to clean food processor, then add saffron reduction, shallot, garlic, chipotle, and 1/2 cup panko. Purée until smooth, then, with motor running, add egg mixture in a slow stream, blending until just incorporated.",
        "Chop remaining shrimp very coarsely (about 1/3-inch pieces) and stir together with remaining 1/2 cup panko, 1/2 teaspoon salt, 1/2 teaspoon black pepper, and carrot mixture. Lightly beat remaining egg and stir into shrimp and vegetable mixture along with shrimp purée, then fold in crabmeat until just combined.",
        "Loosely fill a 1/4-cup measure with crab mixture and drop onto a lined baking sheet. Make about 23 more cakes in same manner, dropping onto baking sheets about 1 inch apart. Flatten tops gently to form 2 1/2-inch-wide cakes (about 1 inch high) and bake, switching position of sheets halfway through baking, until tops are lightly browned, about 15 minutes total. Serve shrimp crab cakes with sauce on the side."
    ],
    "ingredients": [
        "1 cup crème fraîche",
        "1 tablespoon chopped canned chipotle chiles in adobo",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon crumbled saffron threads",
        "1/4 cup water",
        "1 tablespoon olive oil plus additional for brushing",
        "1/2 cup diced (1/8-inch) onion",
        "1/4 cup diced (1/8-inch) carrot",
        "1/4 cup diced (1/8-inch) celery",
        "2 large eggs",
        "1/2 cup heavy cream",
        "1 1/4 teaspoons salt",
        "1 teaspoon black pepper",
        "1 1/2 lb medium shrimp in shell (31 to 35 per lb), peeled and deveined",
        "1 teaspoon finely chopped shallot",
        "1 1/2 teaspoons finely chopped garlic",
        "1 teaspoon chopped canned chipotle chiles in adobo",
        "1 cup panko (Japanese bread crumbs)",
        "1/8 lb jumbo lump crabmeat, picked over for shells and cartilage",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Bake",
        "Crab",
        "Shrimp",
        "Saffron",
        "Celery",
        "Hot Pepper",
        "Carrot",
        "Gourmet"
    ],
    "title": "Saffron Shrimp Crab Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-shrimp-crab-cakes-232830"
}
