{
    "directions": [
        "Put a kettle of water on to boil for cooking linguine.",
        "In a bowl toss shrimp with 1 teaspoon oil, 1/8 teaspoon red pepper flakes, and salt and pepper to taste. Heat a 12-inch non-stick skillet over moderately high heat until hot enough to make drops of water scatter and sauté shrimp in 2 batches until golden and cooked through, 1 to 2 minutes on each side, transferring as cooked to a plate.",
        "To skillet add wine and boil until most is evaporated. Add remaining 1/2 teaspoon oil, onion, garlic, remaining 1/8 teaspoon red pepper flakes, and salt and pepper to taste and cook over moderate heat, stirring, until onion is softened. In a bowl whisk together tomato paste and chicken broth and add to skillet with fennel and bell pepper. Simmer mixture, covered, until fennel is tender, about 10 minutes.",
        "In a very small bowl or ramekin combine hot water and saffron.",
        "While fennel mixture is simmering, add salt to taste and linguine to boiling water and cook until al dente. Drain linguine well in a colander and return to kettle. Toss linguine with saffron mixture until evenly coated and keep warm.",
        "To simmering fennel mixture add tomatoes and fish stock and simmer 2 minutes. Add shrimp and spinach and cook, covered, until just heated through until spinach is slightly wilted, 1 to 2 minutes. To pasta add vegetable mixture, parsley, and salt and pepper to taste and toss well."
    ],
    "ingredients": [
        "1/2 pound linguine",
        "3/4 pound medium shrimp (about 24), shelled, leaving tails intact, and deveined if desired",
        "1 1/2 teaspoons olive oil",
        "1/4 teaspoon dried hot red pepper flakes, or to taste",
        "1/4 cup dry white wine or vermouth",
        "1 medium onion, chopped fine (about 3/4 cup)",
        "1 tablespoon minced garlic, or to taste",
        "1 1/2 tablespoons tomato paste",
        "1/2 cup chicken broth",
        "1 medium fennel bulb (sometimes called anise, about 1 pound), trimmed and chopped coarse",
        "1 medium yellow bell pepper, cut into thin strips",
        "1 tablespoon very hot water",
        "1/4 teaspoon crumbled saffron threads",
        "a 14- to 16-ounce can whole tomatoes, drained and chopped, or 2 cups cherry tomatoes, quartered",
        "1 cup fish stock (available at many fish markets and specialty food shops) or bottled clam juice",
        "1/2 pound fresh spinach, coarse stems discarded, washed well, spun dry, and chopped coarse (about 4 cups packed)",
        "1/3 cup finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Vegetable",
        "Shrimp",
        "Saffron",
        "Fennel",
        "Spinach",
        "Simmer",
        "Gourmet"
    ],
    "title": "Saffron Linguine with Spicy Shrimp and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/saffron-linguine-with-spicy-shrimp-and-vegetables-10056"
}
