{
    "directions": [
        "Preheat the oven to 375°F. Line a 9 inch loaf pan (about 4 inches deep) with parchment paper.",
        "In a large frying pan over medium heat, heat the olive oil and gently saute the chopped onions and celery for about 5-10 minutes. Stir in the pine nuts, walnuts, chestnuts, chopped sage, and the crumbled veggie burgers. Saute for a minute or two until heated through. Now add the breadcrumbs and cook for another 8-10 minutes.",
        "Stir in the vegetable stock and cook for a couple of minutes. Transfer the mixture to a large mixing bowl and let cool for a couple of minutes. Then stir in the beaten eggs, season with salt and plenty of black pepper, and mix together well.",
        "Spoon the mixture into the lined loaf pan and press it down evenly. Bake the terrine in the middle of the oven for 30 minutes. Remove it from the oven and turn it upside down onto a non-stick baking sheet, peeling away the parchment. Put it back in the oven to bake for 30 more minutes, until the outside is crisp and golden. Slice and serve."
    ],
    "ingredients": [
        "3 tablespoons light olive oil",
        "2 medium onions, finely chopped",
        "2 stalks celery, finely chopped",
        "1/3 cup pine nuts, lightly toasted in a frying pan (no oil needed)",
        "1/3 cup walnut halves, chopped",
        "3/4 cup chestnuts, peeled, cooked, and chopped",
        "3 tablespoons fresh sage, chopped",
        "3 veggie burgers, cooked and crumbled",
        "1 1/4 cups dried breadcrumbs",
        "3/4 cup vegetable stock",
        "3 large, free-range eggs, beaten",
        "sea salt and black pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Onion",
        "Vegetable",
        "Roast",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Tree Nut",
        "Pine Nut",
        "Walnut",
        "Sage",
        "Chestnut",
        "Pescatarian",
        "Peanut Free",
        "Kosher"
    ],
    "title": "Sage and Onion \"Roast\"",
    "url": "http://www.epicurious.com/recipes/food/views/sage-and-onion-roast-51158800"
}
