{
    "directions": [
        "1. Brush the tomato halves all over with olive oil. Season them generously all over with salt and pepper, then sprinkle the garlic and chopped sage over them. Press a whole sage leaf in the center of the cut side of each tomato half. Set any leftover olive oil aside.",
        "2. Cook the tomatoes, following the instructions below for any of the grills, until nicely browned.",
        "3. Transfer the tomatoes to a platter or plates and drizzle any remaining olive oil over them. Serve at once.",
        "•This recipe calls for fresh sage because I like its earthy flavor and I also like the way the whole leaves look when grilled into the tomato halves. If you don't like or can't find sage, you can achieve a similar effect with small sprigs of fresh rosemary, tarragon, thyme, flat-leaf parsley, or another herb.",
        "• You can also grill small whole plum tomatoes this way. Skewer the sage leaves onto the tomatoes with wooden toothpicks.",
        "Preheat the grill; if your contact grill has a temperature control, preheat the grill to high. Place the drip pan under the front of the grill. When ready to cook, lightly oil the grill surface. Arrange the tomato halves on the hot grill, cut side up, then close the lid. The tomatoes will be done after cooking 4 to 6 minutes.",
        "Place the grill pan on the stove and preheat it to medium-high over medium heat. When the grill pan is hot a drop of water will skitter in the pan. When ready to cook, lightly oil the ridges of the grill pan. Arrange the tomato halves, cut side down, in the hot grill pan on a diagonal to the ridges. The tomatoes will be done after cooking 4 to 6 minutes per side. Rotate the tomatoes a quarter turn after grilling 2 minutes on the first side to create a handsome crosshatch of grill marks.",
        "Preheat the grill to high, then, if it does not have a nonstick surface, brush and oil the grill grate. Arrange the tomato halves, cut side down, on the hot grate on a diagonal to the ridges. The tomatoes will be done after cooking 4 to 6 minutes per side. Rotate the tomatoes a quarter turn after grilling 2 minutes on the first side to create a handsome crosshatch of grill marks.",
        "Preheat the grill to high; there's no need to oil the grate. Arrange the tomato halves, cut side down, on the hot grate on a diagonal to the ridges. The tomatoes will be done after cooking 5 to 7 minutes per side. Rotate the tomatoes a quarter turn after grilling 2 minutes on the first side to create a handsome crosshatch of grill marks.",
        "Rake red hot embers under the gridiron and preheat it for 3 to 5 minutes; you want a hot, 2 to 3 Mississippi fire. When ready to cook, brush and oil the gridiron. Arrange the tomato halves, cut side down, on the hot grate on a diagonal to the ridges. The tomatoes will be done after cooking 4 to 6 minutes per side. Rotate the tomatoes a quarter turn after grilling 2 minutes on the first side to create a handsome crosshatch of grill marks."
    ],
    "ingredients": [
        "6 plum tomatoes (about 1 1/4 pounds), cut in half lengthwise",
        "2 tablespoons extra-virgin olive oil",
        "Coarse salt (kosher or sea) and cracked black pepper",
        "3 cloves garlic, minced",
        "1 tablespoon finely chopped fresh sage, plus 12 whole fresh sage leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Tomato",
        "Side",
        "Super Bowl",
        "Low/No Sugar",
        "Summer",
        "Grill/Barbecue",
        "Sage",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sage and Garlic Grilled Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/sage-and-garlic-grilled-tomatoes-231538"
}
