{
    "directions": [
        "Preheat oven to 450°F.",
        "Whisk together flour, sage, baking powder, sugar, baking soda, and salt. Blend in butter with your fingers or a pastry blender until mixture resembles coarse meal. Stir in grated cheese, then buttermilk, stirring until a dough forms. Gather dough into a ball and gently knead on a lightly floured surface 8 times. Pat dough into an 8- by 4-inch rectangle and cut into 8 (2-inch) squares.",
        "Arrange squares about 1 inch apart on a greased baking sheet and brush tops with additional buttermilk. Bake in middle of oven until golden brown and biscuits are cooked through, about 15 minutes. Leave oven on. Transfer biscuits to a rack to cool 10 minutes.",
        "Cut sausage crosswise into 8 equal pieces and flatten each into a 3-inch round. Cook sausage in 2 batches in a large nonstick skillet over moderate heat, turning, until cooked through, about 8 minutes per batch. Transfer to paper towels to drain.",
        "Split biscuits, then make sandwiches, each with 1 biscuit, 1 slice cheese, 1 sausage round, and another slice of cheese. Bake sandwiches on baking sheet in middle of oven until cheese is melted, about 10 minutes."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "2 tablespoons finely chopped fresh sage",
        "2 teaspoons baking powder",
        "2 teaspoons sugar",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 stick cold unsalted butter, cut into pieces",
        "1/4 cup grated sharp Cheddar (2 ounces)",
        "3/4 cup well-shaken buttermilk plus additional for brushing",
        "3/4 pound bulk fresh pork sausage",
        "16 thin slices sharp Cheddar (8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Dairy",
        "Herb",
        "Pork",
        "Breakfast",
        "Brunch",
        "Side",
        "Bake",
        "Cheddar",
        "Meat",
        "Sausage",
        "Sage",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Sage Buttermilk Biscuits with Sausage and Cheddar",
    "url": "http://www.epicurious.com/recipes/food/views/sage-buttermilk-biscuits-with-sausage-and-cheddar-102972"
}
