{
    "directions": [
        "Position rack in bottom third of oven and preheat to 425°F. Toss onions and 2 tablespoons oil in large roasting pan. Roast until onions are golden brown, stirring every 15 minutes, about 1 hour.",
        "Meanwhile, rinse turkey inside and out; pat dry. Slide hand under skin of turkey breast to loosen skin. Spread butter under skin over breast meat. Arrange 4 sage leaves under skin on each side of breast. If stuffing turkey, spoon stuffing loosely into main cavity. Tuck wing tips under turkey; tie legs together loosely. Rub turkey all over with 1 tablespoon oil; sprinkle with salt and pepper.",
        "Place turkey atop onions in pan. Add neck, heart and gizzard pieces to pan. Roast turkey 30 minutes. Pour 1 cup broth into pan. Tent turkey loosely with foil. Reduce oven temperature to 325°F. Roast turkey 2 hours. Uncover; continue to roast until turkey is golden brown and thermometer inserted into thickest part of thigh registers 180°F, basting occasionally with pan juices, about 1 hour longer if unstuffed or about 1 hour 30 minutes longer if stuffed. Transfer to platter. Tent loosely with foil; let stand 30 minutes. Remove neck and giblet pieces from pan; discard. Pour onion mixture into large glass measuring cup; spoon off fat, reserving 2 tablespoons. Add more chicken broth to onion mixture if necessary to measure 5 cups.",
        "Heat reserved 2 tablespoons turkey fat in large saucepan over medium-high heat. Add chopped sage; stir 30 seconds. Add flour; whisk until beginning to color, about 3 minutes (mixture will be dry and crumbly). Gradually whisk in onion mixture, wine and nutmeg. Simmer until gravy thickens to desired consistency, whisking frequently, about 5 minutes; season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 1/2 pounds onions, sliced",
        "3 tablespoons vegetable oil",
        "1 14- to 15-pound turkey; neck, heart and gizzard cut into 1-inch pieces and reserved",
        "2 tablespoons (1/4 stick) butter, room temperature",
        "8 large whole fresh sage leaves plus 1 1/2 teaspoons chopped",
        "1 cup (or more) canned low-salt chicken broth",
        "6 tablespoons all purpose flour",
        "3/4 cup dry white wine",
        "Pinch of ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Sage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sage-Roasted Turkey with Caramelized Onions and Sage Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/sage-roasted-turkey-with-caramelized-onions-and-sage-gravy-102479"
}
