{
    "directions": [
        "Rub salt and dried sage together in small bowl. Place turkey in roasting pan; sprinkle all over with sage salt. Cover pan with plastic wrap; chill turkey overnight.",
        "Set rack at lowest position in oven and preheat to 375°F. Pat turkey dry. Tuck wing tips under; tie legs together loosely. Stir butter and chopped sage in small saucepan over low heat until butter melts. Brush all over turkey; sprinkle with pepper.",
        "Roast turkey 1 hour; baste with any pan juices. Reduce oven temperature to 350°F. Roast turkey 45 minutes. Pour 3/4 cup apple cider over; turn pan around. Continue to roast turkey until instant-read thermometer inserted into thickest part of thigh registers 165°F, basting and turning pan occasionally for even cooking, about 11/4 hours longer. Transfer turkey to platter; tent loosely with foil and let rest 30 to 45 minutes (internal temperature will rise 5 to 10 degrees).",
        "Pour all pan juices into large measuring cup. Spoon off fat that rises to surface. Transfer 2 tablespoons fat to heavy large saucepan; discard remaining fat. Place turkey roasting pan over 2 burners. Add 2 cups stock or broth and 3/4 cup cider. Bring to boil over high heat, scraping up browned bits. Boil liquid until reduced to 1 1/2 cups, about 6 minutes. Add mixture from roasting pan to degreased pan juices. If necessary, add enough stock to measure 3 1/2 cups stock mixture.",
        "Place saucepan with turkey fat over medium-high heat. Add flour; whisk 2 minutes. Whisk in stock mixture. Boil until gravy thickens enough to coat spoon thinly, about 6 minutes. Whisk in 2 tablespoons Calvados, or more to taste, and sage. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "3 tablespoons coarse kosher salt",
        "1 tablespoon dried rubbed sage",
        "1 16-to 18-pound turkey, rinsed, patted dry; neck, heart, andgizzard reserved for Turkey Stock",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/4 cup chopped fresh sage",
        "3/4 cup fresh refrigerated apple cider or fresh refrigerated apple juice",
        "2 cups (or more) Turkey Stock or low-salt chicken broth",
        "3/4 cup fresh refrigerated apple cider or fresh refrigerated apple juice",
        "2 tablespoons all purpose flour",
        "2 to 3 tablespoons Calvados (apple brandy) or applejack brandy",
        "1 tablespoon chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Low Cal",
        "Dinner",
        "Family Reunion",
        "Sage",
        "Christmas Eve",
        "Potluck",
        "Calvados",
        "Butter",
        "Apple Juice",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sage Butter-Roasted Turkey with Cider Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/sage-butter-roasted-turkey-with-cider-gravy-355753"
}
