{
    "directions": [
        "In a large bowl make the vinaigrette by whisking together the vinegar and the mustard. Slowly whisk in the oil in a thin stream to emulsify the mixture. Stir in the garlic and the onions. Mince the parsley and add it, with the tarragon and chervil, to the dressing, mixing well. Season to taste with salt and pepper.",
        "Rinse the tuna, pat it dry and refrigerate it until just before cooking.",
        "Build a small fire in a barbecue. When the coals are red and dusted with ash, spread them out, and lay the rosemary atop them. Set the grill atop the coals. Rub the tuna on all sides lightly with olive oil, and place on the grill. Cover the grill, leaving the vents open, so the tuna grills and smokes at the same time. Grill until the tuna is lightly golden and almost cooked through, 5 to 7 minutes. Carefully turn the tuna and cook until it is golden on the other side and opaque through, an additional 5 to 7 minutes. The cooking time will vary depending on the heat of the fire, so check it carefully. Transfer the tuna to a plate, season it lightly all over with salt and pepper, and let it cool to room temperature. When it is cool enough to handle, carefully remove the skin and any bones. Drizzle it on both sides with about 3 tablespoons of the vinaigrette, then reserve at room temperature.",
        "Drain the anchovies of oil and pat them dry.",
        "Bring 4 cups water to a boil in the bottom of a steamer. Add half the beans, cover, and steam until they are tender firm, about 6 minutes. Remove from the steamer and let cool on a wire rack covered with a cotton tea towel. Repeat with the remaining beans.",
        "Transfer one-third of the dressing to a medium sized bowl.",
        "Bring a medium-sized pot of salted water to a boil, and add the potatoes. Cook just until they are tender through, about 15 minutes. Drain. If you want to peel them, do so as soon as they are cool enough to handle. Add them, still warm, to the one-third of the vinaigrette. Toss, and reserve.",
        "To assemble the salad, just before serving toss the beans and the peppers with enough vinaigrette to fully moisten them, and arrange them in the center of a serving platter. Top them with the anchovy fillets, arranging them attractively on top. Quarter the eggs, and place them, with the tomatoes, around the beans and peppers. Drizzle them with 2 to 3 tablespoons of the vinaigrette.",
        "Place the potatoes on another platter. Break the tuna apart into large pieces, and arrange the pieces attractively atop the potatoes. Sprinkle with the olives. Drizzle with any remaining vinaigrette, and garnish with several sprigs of parsley and chervil. Serve immediately."
    ],
    "ingredients": [
        "3 tablespoons best quality cider vinegar",
        "1 tablespoon Dijon-style mustard",
        "1 cup plus 2 tablespoons extra virgin olive oil",
        "1 medium new white onion, sliced paper-thin",
        "2 cloves garlic, minced",
        "3 cups flat-leaf parsley leaves, loosely packed",
        "3/4 cup mixture of tarragon and fresh chervil leaves, loosely packed",
        "Sea salt and freshly ground black pepper to taste",
        "N/A freshly ground black pepper",
        "2 pounds fresh tuna",
        "1 tablespoon extra-virgin olive oil, for rubbing on the tuna",
        "N/A Sea salt",
        "N/A freshly ground black pepper",
        "20 anchovy fillets (preferably packed in oil)",
        "1 pound green beans, trimmed",
        "1 pound yellow beans, trimmed",
        "2 pounds of tiny new potatoes, scrubbed",
        "1/2 each red and yellow bell peppers, cut in thin (1/4-inch) strips",
        "1/2 yellow bell peppers",
        "6 medium red and yellow tomatoes, stemmed and quartered",
        "5 farm eggs, hard-cooked and peeled",
        "1 cup nicoise olives",
        "Sprigs of parsley and chervil, for garnish",
        "N/A chervil Sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Olive",
        "Potato",
        "Tomato",
        "Low Fat",
        "Tuna",
        "Green Bean",
        "Healthy",
        "Lettuce"
    ],
    "title": "Salade Niçoise",
    "url": "http://www.epicurious.com/recipes/food/views/salade-nicoise-15533"
}
