{
    "directions": [
        "In a small bowl proof the yeast in 1 cup of the water for 5 minutes, or until the mixture is foamy, and in another small bowl dissolve the table salt in the remaining 1 cup water. In a large bowl stir together the yeast mixture, the salt water, and 4 cups of the flour until a dough is formed, turn the dough out onto a floured surface, and knead in the salami, the rosemary, and enough of the remaining 2 cups flour to form a slightly sticky dough. Knead the dough for 10 minutes, form it into a ball, and transfer it to a lightly oiled bowl, turning it to coat it with the oil.",
        "Let the dough rise, covered with plastic wrap, in a warm place for 1 hour, or until it is double in bulk, knead it for 30 seconds, and form it into a 16-inch-long loaf. Transfer the loaf to a lightly oiled baking sheet and let it rise, uncovered, in a warm place for 1 hour, or until it is double in bulk. Make four 1/4-inch-deep slashes in the top of the loaf and brush the loaf with the glaze. Sprinkle the loaf with the coarse salt and bake it in the middle of a preheated 425°F. oven for 15 minutes. Reduce the temperature to 350°F. and bake the loaf for 30 minutes more, or until it sounds hollow when the bottom is tapped. Transfer the loaf to a rack and let it cool."
    ],
    "ingredients": [
        "two 1/4-ounce packages active dry yeast (5 teaspoons)",
        "2 cups lukewarm water",
        "2 teaspoons table salt",
        "5 to 6 cups bread flour",
        "1/2 pound pork salami, chopped fine",
        "2 teaspoons dried rosemary",
        "a glaze made by beating 1 large egg white with 1 tablespoon water",
        "coarse salt for sprinkling the bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Pork",
        "Side",
        "Bake",
        "Rosemary",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Salami Rosemary Bread",
    "url": "http://www.epicurious.com/recipes/food/views/salami-rosemary-bread-11595"
}
