{
    "directions": [
        "Whisk shallot, vinegar, 1/4 teaspoon sumac, and cumin in small bowl. Gradually whisk in 4 tablespoons oil. Season dressing with salt and pepper. Combine herbs and greens in large bowl. (Dressing and salad can be made 2 hours ahead. Cover separately and chill.)",
        "Using vegetable peeler, remove eggplant peel in vertical strips every 1 to 1 1/2 inches, making striped pattern. Cut eggplants crosswise into 1/3-inch-thick rounds. Place rounds in large colander. Sprinkle generously with kosher salt and toss to coat evenly. Let stand until rounds soften and release moisture, tossing occasionally, about 1 hour. Rinse rounds, 1 at a time, and press to release excess moisture. Arrange rounds in single layer on several thicknesses of paper towels. Pat dry with additional towels.",
        "Heat 3 tablespoons oil in large skillet over medium-high heat. Working in batches, fry eggplant until golden and soft, adding more oil by tablespoonfuls as needed, about 2 minutes per side. Transfer eggplant to paper towels to drain.",
        "Overlap eggplant rounds on platter. Sprinkle with pepper and more sumac, if desired. Toss herbs and greens with dressing; season to taste with salt and pepper. Mound salad atop eggplant. Garnish with nasturtium blossoms, if desired, and serve.",
        "*A fruity and acidic seasoning powder made from ground dried sumac berries. It is available at Middle Eastern markets and by mail from Adriana's Caravan (adrianascaravan.com)."
    ],
    "ingredients": [
        "1 small shallot, minced",
        "2 tablespoons Champagne vinegar or fresh lemon juice",
        "1/4 teaspoon (or more) ground sumac* (optional)",
        "1/4 teaspoon ground cumin",
        "7 tablespoons (or more) extra-virgin olive oil, divided",
        "1 1/2 cups (loosely packed) fresh Italian parsley leaves",
        "1 1/2 cups (loosely packed) arugula, torn if large",
        "1 cup (loosely packed) small fresh basil leaves",
        "1 cup (loosely packed) torn fresh sorrel or baby spinach leaves",
        "1 cup (loosely packed) fresh mint leaves",
        "1/3 cup (loosely packed) 1-inch pieces fresh chives",
        "1/3 cup (loosely packed) fresh chervil leaves (optional)",
        "2 10- to 12-ounce eggplants, stems cut off",
        "Coarse kosher salt",
        "Nasturtium blossoms or other edible flowers (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Fry",
        "Vegetarian",
        "Mint",
        "Basil",
        "Eggplant",
        "Arugula",
        "Spinach",
        "Summer",
        "Vegan",
        "Chive",
        "Parsley",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Salad of Fresh Herbs and Greens with Fried Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/salad-of-fresh-herbs-and-greens-with-fried-eggplant-232546"
}
