{
    "directions": [
        "Place a drizzle of EVOO in a skillet over medium heat and melt the butter into the oil. Add the onions, season with salt and pepper, a little ground thyme and add the bay. Caramelize the onions until very soft and sweet and light golden in color, 20 to 25 minutes.",
        "Meanwhile, soak the bread in milk or half-n-half. Place the meat in a bowl and add the egg. Squeeze out the bread and crumble into crumbs as you add to the bowl. Add the Worcestershire and grated onion to the beef. Sprinkle with salt and pepper and combine. Form into 4 (1-inch thick) oval loaves. Heat a drizzle of EVOO in a large skillet over medium-high heat. Add the loaves and cook until cooked through, about 15 minutes, turning occasionally. Transfer the meat to a plate.",
        "Sprinkle the flour over the caramelized onions, stir 1 minute. Deglaze the pan you cooked the meat in with the wine and pour into the onions. Add the beef stock and thicken a moment. Serve the gravy over the Salisbury steaks. Garnish with a little watercress, if desired."
    ],
    "ingredients": [
        "EVOO for liberal drizzling",
        "2 tablespoons butter",
        "2 large onions, sliced",
        "Salt and coarse black pepper",
        "Ground thyme",
        "1 bay leaf",
        "2 pieces stale white bread, crust trimmed",
        "Milk or half-n-half",
        "About 1 2/3 pounds ground sirloin",
        "1 large egg, beaten",
        "1/4 cup Worcestershire sauce",
        "3 tablespoons grated onion",
        "2 tablespoons flour",
        "1/2 cup dry white wine",
        "1 cup beef stock",
        "Watercress, for garnish, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Gravy",
        "Salisbury Steak",
        "Beef",
        "Meat",
        "Onion Recipes",
        "Vegetable"
    ],
    "title": "Salisbury Steaks with French Onion Gravy",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/salisbury-steaks-with-french-onion-gravy-recipe"
}
