{
    "directions": [
        "Mix ground beef, chopped onion, celery, milk, chopped mushrooms, and panko together in a large bowl; shape into 10 patties.",
        "Mix all-purpose and whole wheat flours together in a wide, shallow bowl. Dredge patties in the flour mixture just to coat and move to a platter, taking care to not stack the patties.",
        "Heat 2 tablespoons oil in a large skillet over medium-high heat. Cook patties in hot oil until browned, 3 to 5 minutes per side. Arrange browned patties in a slow cooker crock.",
        "Heat remaining oil in a small skillet over medium heat. Cook and stir sliced mushrooms and sliced onion in hot oil until tender, about 5 minutes.",
        "Stir cooked mushroom and onion mixture with cream of mushroom soup, beef broth, Worcestershire sauce, onion gravy mix, and black pepper together in a bowl until smooth; pour over the beef patties in the slow cooker.",
        "Cook on High until patties are very firm, hot, and grey in the center, 3 to 3 1/2 hours (or on Low for 4 to 5 hours). An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C)."
    ],
    "ingredients": [
        "2 1/2 pounds extra lean ground beef",
        "3/4 cup finely chopped onion",
        "3/4 cup finely chopped celery",
        "1/2 cup milk",
        "1/2 cup finely chopped mushrooms",
        "1/2 cup Italian-seasoned panko (Japanese bread crumbs)",
        "2 tablespoons all-purpose flour",
        "2 tablespoons whole wheat flour",
        "3 tablespoons vegetable oil, divided",
        "1 (4 ounce) package sliced fresh mushrooms",
        "1/2 onion, thinly sliced",
        "2 (10.75 ounce) cans reduced-fat, reduced-sodium cream of mushroom soup (such as Campbell's® Healthy Request)",
        "3/4 cup low-sodium beef broth",
        "2 tablespoons low-sodium Worcestershire sauce",
        "1 (1 ounce) packet dry onion gravy mix",
        "1 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salisbury Steak Slow Cooker-Style",
    "url": "http://allrecipes.com/recipe/239538/salisbury-steak-slow-cooker-style/"
}
