{
    "directions": [
        "In a saucepan simmer dried fruit and cider, covered, stirring occasionally, until cider is absorbed, about 10-minutes. Cool fruit mixture and chop coarse. In a bowl stir together fruit mixture, walnuts, butter, and 3/4 cup sugar.",
        "Preheat oven to 375°F.",
        "Roll out 1 pastry sheet into a 13-inch square and transfer to an 11-inch round tart pan with a removable fluted rim. Trim overhang to 1/2 inch and fold toward center of tart, pressing gently against edge of pan. Spread fruit filling evenly in shell.",
        "Roll out remaining pastry sheet into a 10-inch square and with a saw-toothed pastry wheel cut into 10-by 1/2 inch strips. Weave pastry strips into a lattice pattern over tart and trim overhanging ends to 1/4 inch, tucking them between pastry edge and filling. Brush lattice with egg wash and sprinkle with remaining tablespoon sugar. Bake tart in middle of oven 40 minutes, or until crust is golden brown, and cool in pan on a rack.",
        "Serve tart warm or room temperature with whipped cream or ice cream."
    ],
    "ingredients": [
        "2 cups pitted prunes",
        "2 cups dried apricots",
        "1 cup dried unsweetened sour cherries*",
        "1/2 cup dried apple slices",
        "1 1/2 cups apple cider",
        "1 cup walnuts, toasted and chopped coarse",
        "1 stick (1/2 cup) unsalted butter, cut into bits",
        "3/4 cup plus 1 tablespoon sugar",
        "one 17 3/4-ounce package frozen puff pastry sheets, thawed",
        "an egg wash made by beating 1 large egg with 1 tablespoon water",
        "Accompaniment: sweetened whipped cream flavored with vanilla or brandy, or vanilla ice cream",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Walnut",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sally Darr's Updated Dried Fruit Tart",
    "url": "http://www.epicurious.com/recipes/food/views/sally-darrs-updated-dried-fruit-tart-10806"
}
