{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Grease two 2-cup baking dishes.",
        "Bring the clam juice to a simmer in a small pot. Place salmon fillet into clam juice; poach until fish flakes easily with a fork, about 10 minutes. Remove salmon to a plate; reserve poaching liquid.",
        "Heat olive oil and butter in a skillet over medium heat. Stir in carrot, celery, leek, and shallot; cook and stir until vegetables are tender, about 5 minutes. Whisk flour into vegetable mixture; cook and stir until flour is golden, about 5 minutes.",
        "Whisk reserved poaching liquid and cream into vegetable mixture; return to a simmer and cook, stirring occasionally, until sauce thickens, about 3 minutes. Stir dill and lemon juice into mixture; season with salt and pepper.",
        "Break salmon fillet into bite-size pieces; divide into prepared baking dishes. Cover salmon with 1/3 the sauce; layer 5 shrimp into each dish. Cover shrimp with 1/3 the sauce; divide smoked salmon evenly into each dish. Top with remaining 1/3 the sauce.",
        "Roll out puff pastry sheet 1/8-inch thick on a lightly floured surface. Cut two pastry circles large enough to cover the baking dishes and place one circle over each dish. Place dishes on a baking sheet.",
        "Bake in the preheated oven until pastry is risen and golden brown, about 15 minutes. Cool for 5 minutes before serving."
    ],
    "ingredients": [
        "3 cups clam juice",
        "1 (3 ounce) salmon fillet, skin removed",
        "1 tablespoon olive oil",
        "2 tablespoons butter",
        "1 carrot, peeled and diced",
        "1 stalk celery, diced",
        "1 small leek, diced",
        "1 shallot, minced",
        "3 tablespoons all-purpose flour, or as needed",
        "1 cup heavy whipping cream",
        "3 tablespoons chopped fresh dill, or to taste",
        "1/2 lemon, juiced, or to taste",
        "salt and ground black pepper to taste",
        "10 medium shrimp, peeled and deveined",
        "1 1/2 ounces smoked salmon, chopped",
        "1/2 sheet frozen puff pastry, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salmon Pot Pie",
    "url": "http://allrecipes.com/recipe/234686/salmon-pot-pie/"
}
