{
    "directions": [
        "Stir cucumber, mayonnaise, horseradish, parsley, and chives in medium bowl to blend. Season sauce to taste with salt and pepper. DO AHEAD: Sauce can be made 1 day ahead. Cover and refrigerate.",
        "Line large rimmed baking sheet with plastic wrap. Heat 3 tablespoons oil in heavy large skillet over medium heat. Add carrots and leeks. Saut233 until soft but not brown, about 15 minutes. Cool in skillet.",
        "Beat eggs, matzo meal, coarse salt, and white pepper in large bowl to blend. Stir in carrot mixture. Place whitefish and salmon cubes in processor. Using on/off turns, chop fish to coarse paste (small pieces of fish will remain). Stir fish into matzo meal mixture.",
        "Using wet hands and about 1/3 cup for each, shape fish mixture into sixteen 1/2-inch-thick cakes. Arrange on prepared baking sheet. DO AHEAD: Can be made 1 day ahead. Cover with plastic and chill.",
        "Add enough oil to 2 heavy large skillets to coat bottom. Heat oil over medium-high heat. Add 8 fish cakes to each skillet. Sauté until golden and cooked through, about 3 minutes per side. DO AHEAD: Can be made 2 hours ahead. Transfer to another baking sheet, cover, and refrigerate. Rewarm uncovered in 350°F oven 10 minutes.",
        "Arrange 2 fish cakes on each plate. Spoon sauce over or alongside. Garnish with lemon wedges and parsley.",
        "A Chardonnay would be delicious with the haroseth and the salmon and whitefish cakes. We like the apple, pear, and vanilla notes of the Baron Herzog 2006 Chardonnay from Herzog Wine Cellars on California's Central Coast. It's a great kosher wine and a good value at $13."
    ],
    "ingredients": [
        "1 cup finely chopped unpeeled English hothouse cucumber",
        "3/4 cup mayonnaise",
        "3 tablespoons prepared white horseradish",
        "2 tablespoons finely chopped fresh Italian parsley",
        "1 tablespoon finely chopped fresh chives",
        "3 tablespoons olive oil plus more for frying fish cakes",
        "3 medium carrots, peeled, finely chopped",
        "1 2/3 cups finely chopped leeks (white and pale green parts only)",
        "2 large eggs",
        "6 tablespoons unsalted matzo meal",
        "1 3/4 teaspoons coarse kosher salt",
        "3/4 teaspoon ground white pepper",
        "18 ounces skinless whitefish fillets, cut into 1-inch cubes",
        "1 9-ounce skinless salmon fillet, cut into 1-inch cubes",
        "Lemon wedges",
        "Fresh Italian parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Appetizer",
        "Sauté",
        "Passover",
        "Low Cal",
        "Horseradish",
        "Salmon",
        "Spring",
        "Healthy",
        "Kosher for Passover",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Salmon and Whitefish Cakes with Horseradish Cucumber Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-and-whitefish-cakes-with-horseradish-cucumber-sauce-241880"
}
