{
    "directions": [
        "In a small saucepan simmer sauce ingredients, stirring until sugar is dissolved, until reduced to about 1/2 cup and cool to room temperature in a metal bowl set in a larger bowl of ice and cold water.",
        "In a baking dish large enough to just hold salmon steaks in one layer marinate salmon in sauce, turning to coat, 15 minutes.",
        "While salmon is marinating, in a large saucepan of boiling salted water blanch vegetables 2 minutes, or until crisp-tender, and drain in a colander. Transfer vegetables to a bowl of ice and cold water to stop cooking and drain well.",
        "In a 10-inch heavy skillet (preferably cast iron) heat oil over moderately high heat until hot but not smoking. Transfer salmon to skillet with a metal spatula, letting excess sauce drip off into reserved marinade, and reduce heat to moderate. Sauté salmon, turning once, until just cooked through and browned well, about 2 1/2 minutes on each side, and transfer to 2 plates. Pour off oil and cook vegetables, stirring, 1 minute. Add reserved sauce and boil, stirring, 1 minute, or until thickened.",
        "Spoon vegetables and sauce over salmon and garnish with scallion greens."
    ],
    "ingredients": [
        "1/3 cup soy sauce",
        "2 tablespoons mirin (sweet Japanese rice wine) or medium-dry Sherry",
        "2 1/2 tablespoons cider vinegar",
        "2 tablespoons sugar",
        "1 1/2 tablespoons chopped peeled fresh gingerroot",
        "two 1/2 inch-thick salmon steaks",
        "2 carrots, halved lengthwise and cut diagonally into 1/4-inch slices",
        "1 onion, cut into 1/4-inch slices",
        "1 tablespoon vegetable oil",
        "Garnish: 2 scallion greens, cut decoratively"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Onion",
        "Marinate",
        "Sauté",
        "Quick & Easy",
        "Vinegar",
        "Salmon",
        "Carrot",
        "Healthy",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Salmon Teriyaki with Carrots and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-teriyaki-with-carrots-and-onions-10018"
}
