{
    "directions": [
        "Preheat oven to 325°F. Spray nonstick spray inside 8 1/2 x 4 1/2 x 2 1/2-inch loaf pan. Melt butter in small saucepan over medium-low heat. Add shallots; sauté until tender, about 2 minutes. Add vermouth and simmer until liquid is reduced to 1 tablespoon, about 6 minutes. Cool.",
        "Finely chop salmon and scallops in processor. Add shallot mixture, breadcrumbs, egg, salt, pepper and pepper sauce. With machine running, gradually add cream and process just until puréed.",
        "In medium bowl, mix spinach with 1 cup salmon purée. Spread half of remaining purée in pan. Spread spinach mixture over purée in pan. Spread remaining salmon purée over spinach mixture. Cover with buttered waxed paper.",
        "Place loaf pan in roasting pan. Add enough hot water to roasting pan to come 1/2 inch up sides of loaf pan. Bake terrine until thermometer inserted into center registers 140°F, about 55 minutes. Transfer loaf pan to rack and cool. Remove waxed paper. Cover and chill until cold, at least 4 hours and up to 1 day.",
        "Invert terrine onto platter. Cut crosswise into 12 slices. Transfer 1 slice to each plate. Spoon Cucumber-Dill Sauce alongside. Garnish with dill sprigs."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 tablespoon butter",
        "3 tablespoons finely chopped shallots",
        "1/2 cup dry vermouth",
        "18 ounces skinless boneless salmon fillets, cut into 2-inch pieces",
        "4 ounces bay scallops",
        "1/2 cup fresh breadcrumbs made from French bread",
        "1 large egg",
        "1 1/4 teaspoons salt",
        "1/4 teaspoon ground white pepper",
        "1/8 teaspoon hot pepper sauce",
        "1 1/2 cups chilled whipping cream",
        "1 10-ounce package frozen chopped spinach, thawed, squeezed dry",
        "Cucumber-Dill Sauce",
        "Fresh dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Fish",
        "Bake",
        "Salmon",
        "Scallop",
        "Spinach",
        "Fortified Wine",
        "Summer",
        "Chill"
    ],
    "title": "Salmon and Spinach Terrine with Cucumber-Dill Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-and-spinach-terrine-with-cucumber-dill-sauce-5753"
}
