{
    "directions": [
        "Mix all the ingredients together in a small bowl. You can make the cure in advance and it will keep, stored in an airtight jar out of the sunlight, for up to 6 months.",
        "In a medium bowl, mix the salmon with 2 tablespoons of the Gravlax Cure and then add the olive oil, snipped chives, orange zest, and pepper. Cover and refrigerate overnight, or for at least 6 hours. Serve topped with a scattering of freshly minced dill on a Crisp Potato Slice or an English cucumber slice.",
        "Strew some more minced dill on the plate or tray that you're using to pass the hors d'oeuvres — then the Crisp Potato Slices won't skid around and the cucumber will be easier to pick up.",
        "Position a rack in the top third of the oven and preheat to 350°F.",
        "Arrange the potatoes in a single layer on a baking sheet; brush each slice with oil, then turn them and brush the other side. Sprinkle with salt and pepper and bake for 10 minutes, then turn slices and bake for another 5 minutes. Remove all crisp slices with a spatula and continue cooking any slices that look like they need more time. Cool on a rack, then use immediately or store in an airtight container for up to 2 days."
    ],
    "ingredients": [
        "1 tablespoon juniper berries, chopped",
        "2 teaspoons dried dill",
        "3 tablespoons sugar",
        "4 tablespoons kosher salt (if you only have table salt, 3 tablespoons plus 1 teaspoon would be the correct equivalent)",
        "5 ounces center-cut fresh salmon, skinned, pin-boned, and cut into tiny dice",
        "2 tablespoons Gravlax Cure",
        "1 teaspoon extra-virgin olive oil",
        "1 tablespoon snipped chives",
        "1/8 teaspoon grated orange zest",
        "1/8 teaspoon freshly ground black pepper",
        "1 bunch dill, minced, for decoration",
        "10 small round potatoes (red or white), cut into 1/8-inch circular slices (discarding rounded ends)",
        "1/2 cup olive oil",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fish",
        "Herb",
        "Potato",
        "Bake",
        "Cocktail Party",
        "Salmon",
        "Party",
        "Dill"
    ],
    "title": "Salmon Gravlax Tartare on Crisp Potato Slices",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-gravlax-tartare-on-crisp-potato-slices-231149"
}
