{
    "directions": [
        "Place a large baking sheet on bottom rack of oven and remove any other racks. Preheat oven to 400°F.",
        "Halve fennel bulb lengthwise. Remove most of core, leaving enough intact to keep layers together when sliced.",
        "Using manual slicer, cut fennel bulb (lengthwise), carrots (diagonally), and potatoes into 1/8-inch-thick slices, keeping vegetables separate.",
        "Blanch vegetables, separately, in salted boiling water: fennel 2 minutes, carrots 1 minute, potatoes 2 minutes. Transfer fennel and carrots with a slotted spoon to a bowl of ice water, then drain well. Drain potatoes.",
        "Toss fennel and carrots with olives, zest, thyme, half of garlic, 2 tablespoons olive oil, and salt and pepper to taste.",
        "Toss potatoes with remaining oil and garlic and salt and pepper to taste.",
        "Divide potato mixture among centers of parchment squares. Season salmon with salt and pepper and place on top of potatoes, then top salmon with fennel mixture.",
        "Gather sides of parchment up over fennel mixture to form a pouch, leaving no openings, and tie tightly with string. 3Place packages directly on hot baking sheet in oven and cook 20 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 small fennel bulb, stalks discarded",
        "3 medium carrots (1/2 lb)",
        "1/2 lb small red potatoes",
        "1/2 cup Kalamata olives, slivered",
        "2 teaspoons finely grated fresh lemon zest",
        "4 teaspoons fresh thyme leaves",
        "2 large garlic cloves, minced",
        "3 tablespoons extra-virgin olive oil",
        "1 (1 1/2-lb) piece center-cut salmon fillet, skinned and fish cut into 4 square pieces",
        "Special equipment: a mandoline or other manual slicer, 4 (15-inch) squares parchment paper kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Potato",
        "Vegetable",
        "Bake",
        "Dinner",
        "Salmon",
        "Fennel",
        "Fall",
        "Winter",
        "Anniversary",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon Papillotes with Fennel, Potatoes, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-papillotes-with-fennel-potatoes-and-olives-104017"
}
