{
    "directions": [
        "In a slow cooker, stir together the water, wine, stock, onion, tarragon sprigs, the 1/2 tsp. salt and several grinds of pepper. Cover and cook on low according to the manufacturer’s instructions for 30 minutes. Add the salmon fillets (they can overlap), cover and cook until the fish is opaque throughout, firm and very tender, about 1 hour.",
        "About 15 minutes before the fish is ready, remove the tough ends from the asparagus spears. Using a vegetable peeler, peel the lower 2 inches of each spear, then cut the spears into 2-inch lengths. Bring a saucepan three-fourths full of salted water to a boil over high heat. Add all the asparagus pieces except the tips and cook for 4 minutes. Add the tips and cook until all the pieces are just tender, about 2 minutes more. Drain and run under cold running water until cool. Spread the asparagus on a kitchen towel to dry.",
        "In a large fry pan over medium heat, melt the butter with the olive oil. Add the leeks and sauté for 2 minutes. Add the peas and cook for 1 minute, then add the asparagus and sauté until heated through, 1 to 2 minutes more. Stir in the lemon juice and remove from the heat.",
        "Transfer the salmon to warmed plates. Discard the braising liquid. Arrange the vegetables alongside the salmon and scatter the lemon zest and chives over the top. Serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "The New Slow Cooker,",
        "by Brigit Binns (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "1/2 cup water",
        "1 cup dry white wine",
        "1/2 cup vegetable stock",
        "1/2 small yellow onion, sliced",
        "3 fresh tarragon sprigs",
        "1/2 tsp. salt, plus more, to taste",
        "Freshly ground pepper, to taste",
        "4 salmon fillets, each about 6 oz.",
        "1 bunch asparagus, about 1 lb.",
        "1 Tbs. unsalted butter",
        "1 Tbs. olive oil",
        "2 leeks, white and light green portions, cut into 2-inch\n  matchsticks",
        "2 cups fresh or thawed, frozen English peas",
        "Grated zest and juice of 1/2 lemon",
        "Snipped fresh chives for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Salmon with Spring Vegetables",
    "url": "http://www.williams-sonoma.com/recipe/salmon-with-spring-vegetables.html"
}
