{
    "directions": [
        "Preheat the oven to 325 degrees F (165 degrees C).",
        "Coat salmon fillet with 2 tablespoons pesto. Place in a 9x13 inch baking dish.",
        "Bake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes.",
        "Remove from oven and flake salmon into chunks; set salmon aside.",
        "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in rigatoni, and return to a boil. Cook uncovered, stirring occasionally, until rigatoni has cooked through, but is still firm to the bite, about 11 minutes. Drain in a colander.",
        "Heat olive oil in a skillet over medium-low heat.",
        "Cook and stir spinach in oil until wilted, 3 to 4 minutes. Remove spinach and set aside.",
        "Cook and stir garlic, shallots, red pepper flakes, and black pepper in the same skillet until garlic and shallots are lightly browned, about 5 minutes. Pour in extra oil if needed.",
        "Stir in drained artichoke hearts and cook until heated, about 3 minutes.",
        "Pour in white wine and simmer until slightly reduced, 5 to 10 minutes.",
        "Combine 2 tablespoons pesto, cooked spinach, salmon, Parmesan cheese, and cooked pasta in the skillet and lightly toss until mixed, 1 to 2 minutes."
    ],
    "ingredients": [
        "3/4 pound salmon fillet",
        "2 tablespoons prepared pesto",
        "2 cups dried whole wheat rigatoni pasta",
        "1 tablespoon olive oil",
        "1 (14 ounce) bag fresh baby spinach",
        "3 cloves garlic, chopped",
        "3 small shallots, chopped",
        "1/4 teaspoon crushed red pepper flakes, or to taste",
        "ground black pepper to taste",
        "1 (14 ounce) can artichoke hearts, drained",
        "1/2 cup white wine",
        "2 tablespoons prepared pesto",
        "1/2 cup shredded Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salmon Pasta with Spinach and Artichokes",
    "url": "http://allrecipes.com/recipe/220230/salmon-pasta-with-spinach-and-articho/"
}
