{
    "directions": [
        "Combine mussels and wine in large saucepan over medium-high heat. Cover and cook until mussels begin to open, stirring occasionally, about 4 minutes. Using slotted spoon, transfer mussels to large bowl (discard any mussels that do not open). Pour liquid from saucepan into 2-cup measuring cup. Stir in saffron. Let cooking liquid stand 15 minutes.",
        "Add enough cream to cooking liquid to measure 1 1/3 cups. Transfer to large saucepan. Stir in tomatoes, garlic, bay leaf, and cayenne. Simmer over medium heat until sauce thickens slightly, about 5 minutes. Season with salt and pepper. (Can be made 4 hours ahead. Cover and chill mussels and sauce separately.)",
        "Heat oil in large nonstick skillet over high heat. Add salmon, rounded side down. Cook until bottom is golden, about 3 minutes. Turn salmon over. Reduce heat to low; cover and cook until salmon is opaque in center, about 4 minutes longer. Remove from heat. Leave covered to keep warm.",
        "Bring sauce in large saucepan to simmer over low heat. Add mussels in shells; stir until heated through, about 2 minutes. Stir in lemon juice.",
        "Place 1 salmon fillet on each of 4 plates. Divide mussels among plates. Spoon sauce over salmon and mussels."
    ],
    "ingredients": [
        "1 pound mussels, scrubbed, debearded",
        "1/2 cup dry white wine",
        "1/2 teaspoon saffron threads, crushed",
        "3/4 cup (about) whipping cream",
        "1/2 cup canned crushed tomatoes with added puree",
        "1 garlic clove, minced",
        "1 bay leaf",
        "1/8 teaspoon cayenne pepper",
        "1 tablespoon olive oil",
        "4 8-ounce skinless salmon fillets",
        "1/2 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Tomato",
        "Sauté",
        "Low Carb",
        "Salmon",
        "Mussel",
        "Saffron",
        "White Wine",
        "Spring"
    ],
    "title": "Salmon in Saffron Mussel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-in-saffron-mussel-sauce-106308"
}
