{
    "directions": [
        "Preheat oven to 250°F. Place potatoes in a medium pot. Pour in water to cover and add a few generous pinches of salt. Bring to a boil; reduce heat and gently simmer until a paring knife easily pierces potatoes, 20–25 minutes.",
        "Meanwhile, place salmon in a large baking dish and coat with oil. Season both sides with salt and pepper; place skin side down and sprinkle with caraway. Bake until a cake tester or thin knife blade inserted laterally through fillet meets no resistance, 25–30 minutes. (Fish should be opaque throughout and just able to flake.) While the potatoes and salmon are doing their thing, make the dressing and the horseradish yogurt.",
        "Whisk oil and vinegar in a bowl big enough to hold the potatoes. Whisk half of scallions and tarragon into dressing. Set remaining scallions and tarragon aside for serving.",
        "Combine horseradish, vinegar, and a large pinch of salt in a small bowl; let sit 5 minutes. Whisk in yogurt and oil; season with salt and pepper.",
        "As soon as potatoes are done cooking, drain and add to bowl with dressing. Toss to coat and season with kosher salt and pepper.",
        "Heat oil in a large saucepan over medium. Toss herbs and cornstarch in a fine-mesh sieve. Test oil temperature by adding an herb leaf. The oil should sizzle intensely (it may spatter) and the leaf should darken on contact. Fry herbs in batches until crisp and vibrant green, about 5 seconds per batch. Transfer to paper towels with a slotted spoon. Season lightly with kosher salt. (If you’d like to skip this step, we get it. Chop herbs instead.)",
        "Dress salmon with fried herbs and sea salt. Toss potatoes to redistribute dressing and top with sea salt and reserved scallions and tarragon. Serve salmon with potatoes and horseradish yogurt alongside."
    ],
    "ingredients": [
        "1 1/2 pounds small Yukon Gold potatoes, scrubbed, sliced 1/2-inch thick",
        "Kosher salt",
        "1 1/2 pounds skin-on salmon fillet",
        "2 tablespoons olive oil",
        "Freshly ground black pepper",
        "3/4 teaspoon caraway seeds, coarsely chopped",
        "1/4 cup olive oil",
        "1 tablespoon white wine vinegar",
        "3 scallions",
        "1 tablespoon torn tarragon",
        "1 tablespoon finely grated peeled horseradish (from about a 2-inch piece)",
        "1 teaspoon white wine vinegar",
        "Kosher salt",
        "1 cup plain Greek yogurt",
        "1 tablespoon olive oil",
        "Freshly ground black pepper",
        "Kosher salt, freshly ground pepper",
        "1/2 cup vegetable oil",
        "1/2 cup mixed tender herb sprigs (such as parsley, tarragon, and sage)",
        "1 tablespoon cornstarch",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Salmon",
        "Potato Salad",
        "Potato",
        "Salad",
        "Horseradish",
        "Yogurt",
        "Fish",
        "Seafood",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon With Potato Salad and Horseradish Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-potato-salad-and-horseradish-yogurt"
}
