{
    "directions": [
        "Blend together eggs, water, flour, and salt in a blender until smooth. Transfer to a bowl and stir in tarragon.",
        "Lightly brush a 10-inch nonstick skillet with melted butter and heat over moderate heat until hot but not smoking. Ladle about 1/4 cup batter into skillet, tilting and rotating skillet to coat bottom, then pour excess batter back into bowl. (If batter sets before skillet is coated, reduce heat slightly for next crespella.) Cook until just set and underside is lightly browned, about 30 seconds, then invert crespella onto a clean kitchen towel in one layer to cool. (It will be cooked on one side only.) Make 5 more crespelle with remaining batter in same manner, brushing skillet with butter as needed and transferring to towel as cooked, arranging them in one layer.",
        "Heat butter in a 1- to 2-quart heavy saucepan over moderately low heat until foam subsides. Add flour and cook, whisking, 2 minutes. Add clam juice and water in a slow stream, whisking, then bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, 5 minutes. Stir in cream, zest, and pepper, then remove from heat.",
        "Put oven rack in middle position and preheat oven to 425°F. Butter a 13- by 9-inch or other 3-quart glass or ceramic baking dish and spread half of sauce in dish.",
        "Stir together butter (2 tablespoons), shallot, salt, and pepper and spread 1 teaspoon on top of each fillet.",
        "Put 1 crespella, pale side down, on a work surface, then place 1 salmon fillet, buttered side down, in center of crespella and fold crespella around salmon, leaving ends open. Transfer to baking dish, arranging, seam side down, in sauce. Make 5 more cannelloni with remaining salmon and crespelle in same manner, arranging in baking dish. Spoon remaining sauce over cannelloni.",
        "Bake until salmon is just cooked through and sauce is bubbling, 15 to 20 minutes."
    ],
    "ingredients": [
        "2 large eggs",
        "2/3 cup water",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "1 tablespoon finely chopped fresh tarragon",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons unsalted butter, cut into pieces",
        "2 tablespoons all-purpose flour",
        "1 (8-ounce) bottle clam juice",
        "1/3 cup water",
        "1/4 cup heavy cream",
        "2 teaspoons finely grated fresh lemon zest",
        "1/4 teaspoon black pepper",
        "2 tablespoons unsalted butter, softened",
        "1 shallot, finely chopped",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "6 (5-ounce) center-cut pieces salmon fillet (preferably wild; 1 inch thick), skin and little bones discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Citrus",
        "Dairy",
        "Fish",
        "Herb",
        "Shellfish",
        "Bake",
        "Christmas",
        "Dinner",
        "Lemon",
        "Salmon",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon Cannelloni with Lemon Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-cannelloni-with-lemon-cream-sauce-236980"
}
