{
    "directions": [
        "Preheat oven to 350°F. Place salmon on baking sheet; season with salt and pepper. Bake just until cooked through, about 18 minutes. transfer to plate. Cover; chill until cold. Flake salmon into 1/2-inch pieces. Cook potatoes in pot of boiling salted water until just tender, about 10 minutes. Drain potatoes well; cool, peel and dice.",
        "Whisk 5 tablespoons cream, 2 tablespoons horseradish and 2 tablespoons dill in small bowl until very thick. Whisk in vinegar. Season to taste with salt and pepper. Chill.",
        "Mash 3/4 cup diced potatoes, 1 tablespoon cream, 2 tablespoons horseradish and 1 tablespoon dill in medium bowl until almost smooth. Lightly mix in salmon, onions and remaining potatoes. Season with salt and pepper. Melt butter in heavy medium nonstick skillet over high heat. Add hash; press to compact. Reduce heat to medium and cook until bottom is brown and crusty, about 10 minutes. Using large spatula, turn over hash in sections. Press lightly and cook until bottom is brown, about 5 minutes. Turn out hash onto 2 plates. Serve with horseradish cream."
    ],
    "ingredients": [
        "1 12-ounce salmon fillet (about 1 inch thick)",
        "12 ounces small white potatoes",
        "6 tablespoons chilled whipping cream",
        "4 tablespoons prepared white horseradish",
        "3 tablespoons chopped fresh dill",
        "1/2 teaspoon white wine vinegar",
        "1/2 cup chopped green onions",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Potato",
        "Brunch",
        "Bake",
        "Horseradish",
        "Salmon",
        "Pan-Fry",
        "Dill",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon Hash with Horseradish-Dill Cream",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-hash-with-horseradish-dill-cream-419"
}
