{
    "directions": [
        "In a large bowl, whisk together marinade ingredients with salt and pepper to taste.",
        "Cut salmon crosswise into 12 pieces, each about 2 1/2 by 1 inch, and add to marinade. Marinate salmon, turning pieces occasionally, 30 minutes.",
        "In a small bowl, whisk together all dipping sauce ingredients except coriander. (Coriander will be added just before serving.)",
        "Remove salmon from marinade and pat dry.",
        "Fill a small shallow baking pan or cake pan with warm water. Soak 4 sheets rice paper until very pliable, about 45 seconds. Carefully, stack soaked sheets, 1 at a time, between single layers of paper towels to drain, ending with a rice paper. Put 1 sheet of rice paper on a clean dry work surface, reserving dampened paper towel, and arrange 1 salmon piece crosswise on bottom half of sheet, leaving a 1-inch border on bottom edge and on each side. Top salmon with about 4 coriander leaves, 1 teaspoon scallion greens, and salt and pepper to taste. Roll up filling in sheet, folding in sides after first roll to completely enclose filling, and continue rolling. Wrap filled spring roll in reserved dampened paper towel to help form spring roll and keep it moist.",
        "Make more spring rolls in same manner with remaining 3 soaked sheets. Transfer assembled rolls in dampened paper towels to a tray and repeat procedure with remaining 8 rice paper sheets, 4 at a time, and ingredients.",
        "Carefully unwrap 4 spring rolls from paper towels. In a deep 12-inch non-stick heavy skillet, heat 1/4 inch oil over moderately high heat until hot but not smoking and fry 4 spring rolls, turning once, until golden brown and salmon is cooked through, about 3 minutes. Transfer spring rolls as fried with metal tongs to a baking sheet lined with paper towels to drain. Repeat procedure with remaining spring rolls.",
        "Stir coriander into dipping sauce. Serve spring rolls as an hors d'oeuvre or first course with dipping sauce and garnish with coriander sprigs."
    ],
    "ingredients": [
        "1/4 cup seasoned rice vinegar",
        "1/4 cup fresh lime juice",
        "2 tablespoons chopped fresh coriander",
        "1 teaspoon grated peeled fresh gingerroot",
        "a 1-pound salmon fillet about 1 inch thick, skinned",
        "1/4 cup plus 2 tablespoons lime juice",
        "2 tablespoons seasoned rice vinegar",
        "1 tablespoon soy sauce",
        "2 1/2 teaspoons sugar, or to taste",
        "1 tablespoon water, or to taste",
        "2 teaspoons grated peeled fresh gingerroot",
        "2 tablespoons chopped fresh coriander",
        "twelve 6 1/4-inch rounds of rice paper*",
        "48 fresh coriander leaves (about 1/2 cup loosely packed)",
        "4 tablespoons finely chopped scallion greens",
        "vegetable oil for frying",
        "Garnish: Coriander sprigs",
        "Rice paper is available at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Vegetable",
        "Fry",
        "Marinate",
        "Cocktail Party",
        "Lunar New Year",
        "Vinegar",
        "Lime",
        "Salmon",
        "Spring",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Salmon Spring Rolls with Coriander Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-spring-rolls-with-coriander-dipping-sauce-10046"
}
