{
    "directions": [
        "Line rimmed baking sheet with foil. Coat with nonstick spray. Whisk chili sauce, 2 tablespoons soy sauce, and 1 tablespoon ginger in small bowl. Place salmon fillets, skin side down, on prepared sheet. Spoon chili sauce marinade over and let stand at room temperature 30 minutes.",
        "Preheat broiler. Spoon any marinade remaining on baking sheet over salmon fillets. Broil salmon without turning until browned in spots and almost opaque in center, 6 to 10 minutes, depending on thickness of fillet.",
        "Meanwhile, heat vegetable oil in wok or heavy large skillet over medium-high heat. Add remaining 1 tablespoon ginger and minced garlic; stir until aromatic, about 30 seconds. Add sugar snap peas and stir until crisp-tender, about 2 minutes. Add remaining 1 tablespoon soy sauce, rice wine, and pea tendrils and stir just until wilted, about 1 minute. Drizzle with sesame oil.",
        "Place 1 salmon fillet on each plate. Spoon warm pea mixture over salmon fillets and serve.",
        "Available in the Asian foods section of some supermarkets, at Asian markets, and from amazon.com.",
        "** Available at natural foods stores, farmers' markets, and Asian markets."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1/4 cup Asian sweet chili sauce*",
        "3 tablespoons soy sauce, divided",
        "2 tablespoons finely grated peeled fresh ginger, divided",
        "6 6-ounce salmon fillets with skin",
        "2 tablespoons vegetable oil",
        "3 garlic cloves, minced",
        "8 ounces sugar snap peas, trimmed",
        "1 1/2 tablespoons Chinese rice wine or dry Sherry",
        "3 cups pea tendrils** or pea sprouts** (about 6 ounces)",
        "1 teaspoon Asian sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Vegetable",
        "Broil",
        "Marinate",
        "Stir-Fry",
        "Dinner",
        "Seafood",
        "Salmon",
        "Legume",
        "Pea",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Salmon with Sweet Chili Glaze, Sugar Snap Peas, and Pea Tendrils",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-sweet-chili-glaze-sugar-snap-peas-and-pea-tendrils-358190"
}
