{
    "directions": [
        "Bring medium saucepan of salted water to boil. Add rice; boil uncovered until just tender, about 18 minutes. Drain.",
        "Melt butter in heavy medium skillet over medium-low heat. Add leek; sauté until beginning to soften, about 4 minutes. Add mushrooms. Cover skillet; cook until mushrooms release their juices, stirring occasionally, about 5 minutes. Uncover skillet. Increase heat to medium-high; sauté until liquid evaporates, about 3 minutes. Transfer to bowl. Add rice. Season with salt and pepper. Cool completely.",
        "Butter large baking sheet. Roll out 1 pastry sheet on floured surface to 12-inch square. Cut into 4 equal squares. Divide rice mixture among centers of squares, mounding in oval shape with ends toward 2 corners of pastry. Set salmon atop rice. Sprinkle with salt and pepper. Bring pastry corners up around salmon (pastry will not enclose salmon completely.) Roll out remaining pastry sheet on floured surface to 13-inch square. Cut into 4 equal squares. Lay 1 square atop each salmon fillet, tucking corners under bottom pastry to enclose salmon completely. Pinch edges together to seal, brushing with egg mixture if necessary to adhere. Arrange salmon packages, seam side down, on prepared baking sheet. Cover and chill 30 minutes. (Can be made 8 hours ahead. Keep chilled.)",
        "Preheat oven to 400°F. Brush top of pastry with egg mixture. Bake until golden and thermometer inserted into fish registers 145°F, about 30 minutes.",
        "Combine clam juice and wine in heavy small nonaluminum saucepan. Boil until reduced to 1/3 cup, about 9 minutes. Reduce heat to medium. Whisk in creème fraîche. Boil until reduced to 1 cup, about 5 minutes. Remove from heat. Stir in dill. Season with salt and pepper.",
        "If crème fraîche is unavailable, heat 1 cup whipping cream to lukewarm (85°F). Remove from heat and mix in 2 tablespoons buttermilk. Cover and let stand in warm draft-free area until slightly thickened (24 to 48 hours, depending on temperature of room). Refrigerate until ready to use.",
        "Transfer salmon packages to plates. Spoon Dill Sauce around and serve."
    ],
    "ingredients": [
        "1/2 cup long-grain white rice",
        "2 tablespoons (1/4 stick) butter",
        "1/2 cup minced leek (white and pale green parts only)",
        "6 ounces fresh shiitake mushrooms, stemmed, chopped",
        "2 sheets frozen puff pastry (one 17 1/4-ounce package), thawed",
        "4 6-ounce (4x2 1/2-inch) skinless salmon fillet",
        "1 egg beaten with 1 tablespoon water",
        "2/3 cup bottled clam juice",
        "1/2 cup dry white wine",
        "1 1/4 cups crème fraîche or whipping cream",
        "3 tablespoons minced fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Rice",
        "Bake",
        "Salmon",
        "Winter",
        "Engagement Party",
        "Dill"
    ],
    "title": "Salmon and Rice Wrapped in Pastry with Dill Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-and-rice-wrapped-in-pastry-with-dill-sauce-1248"
}
