{
    "directions": [
        "Prepare a gas grill for direct-heat cooking over medium heat; see Grilling Procedure .",
        "Whisk together dressing ingredients in a bowl.",
        "Cover potatoes with water in a 4-quart pot and season well with salt. Bring to a boil, then reduce heat and simmer, uncovered, until just tender, 15 to 20 minutes.",
        "While potatoes cook, season salmon with 1/2 teaspoon salt and 1/4 teaspoon pepper. Oil grill rack, then grill salmon, covered, turning once, until just cooked through, 8 to 10 minutes total. Cool slightly, then gently break into large flakes. If desired, reserve skin for crumbling over salad.",
        "Transfer potatoes with a slotted spoon to a bowl. Add green beans to boiling water and cook, uncovered, until crisp-tender, 4 to 5 minutes. Drain and transfer to an ice bath to stop cooking.",
        "Halve potatoes while still warm and toss with 2 tablespoons dressing.",
        "Toss green beans, cherry tomatoes, and arugula with enough dressing to coat, then toss with potatoes. Divide among plates with salmon and eggs. Sprinkle with basil (and salmon skin, if using). Serve with lemon wedges and remaining dressing."
    ],
    "ingredients": [
        "10 pitted Kalamata olives, finely chopped",
        "1 tablespoon finely chopped shallot",
        "1 teaspoon finely chopped garlic",
        "1 teaspoon anchovy paste",
        "3 tablespoons red-wine vinegar",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons finely chopped basil",
        "3/4 pound small Yukon Gold or boiling potatoes",
        "1 (1 1/4-pound) piece salmon fillet (preferably center-cut; about 1 inch thick) with skin",
        "3/4 pound green beans, trimmed",
        "1 cup cherry tomatoes, halved",
        "2 ounces baby arugula (4 cups)",
        "2 hard-boiled eggs, cut into quarters",
        "Handful of small basil leaves",
        "4 lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Olive",
        "Potato",
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Salmon",
        "Green Bean",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon Niçoise Salad with Black Olive Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-nicoise-salad-with-black-olive-vinaigrette-354494"
}
