{
    "directions": [
        "Preheat oven to 350°F.",
        "Whisk together sour cream and lemon juice. Add oil in a slow stream, whisking until emulsified. (If necessary, add water, 1/2 tablespoon at a time, for a thick yet spoonable consistency.) Stir in chives, tarragon, salt, and pepper to taste.",
        "Soak onion in cold water to cover 10 minutes, then drain and pat dry.",
        "Halve and peel avocados and cut crosswise into 1/4-inch-thick slices, then sprinkle slices with lemon juice. Put 2 brioche toasts on each of 8 plates and season with salt and pepper. Arrange a few sorrel leaves on each toast, then top with avocado and onion.",
        "Fill a well-buttered 17- by 11- by 2-inch flameproof baking pan with 1 1/4 inches water and stir in vinegar (to help whites coagulate faster). Set pan to straddle 2 burners and bring water to a simmer.",
        "Break 1 egg into a cup and slide into water. Repeat with remaining eggs, adding them in rows so you can easily take them out in same order. Poach eggs at a bare simmer 3 to 4 minutes, or until whites are firm but yolks are still runny. Transfer eggs as cooked with a slotted spoon to kitchen towels to drain and season with salt and pepper.",
        "Wrap each egg in a slice of salmon. Put a wrapped egg on top of each toast and drizzle sauce over salmon."
    ],
    "ingredients": [
        "1/2cup sour cream",
        "2 teaspoons fresh lemon juice",
        "1/4 cup olive oil",
        "1 tablespoon finely chopped fresh chives",
        "1/2 tablespoon chopped fresh tarragon",
        "1/2 teaspoon kosher salt",
        "1 small red onion, thinly sliced",
        "2 ripe California avocados",
        "1 to 2 tablespoons fresh lemon juice",
        "6 individual brioches, each cut horizontally into 3 (1/2-inch-thick) rounds and lightly toasted",
        "1/4 lb sorrel or arugula, coarse stems discarded",
        "4 teaspoons distilled white vinegar",
        "16 large eggs",
        "1 lb thinly sliced smoked salmon",
        "Garnish: chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fish",
        "Breakfast",
        "Brunch",
        "Poach",
        "Salmon",
        "Avocado",
        "Arugula",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Salmon Wrapped Poached Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-wrapped-poached-eggs-103664"
}
