{
    "directions": [
        "Preheat oven to 350°F.",
        "Finely grind bread in a food processor, then pulse with butter and salt until combined. Press crumbs onto bottom of a 9-inch square metal baking pan and bake in middle of oven until top is crisp, 12 to 15 minutes. Cool crust completely in pan on a rack.",
        "Bring a 4-quart heavy saucepan three-fourths full of salted water to a simmer, then poach fresh salmon until just cooked through, about 10 minutes. Transfer with a slotted spoon to a plate to cool. Scrape off and discard all brown flesh and finely chop remaining poached salmon, transferring to a large bowl.",
        "Remove any brown flesh from smoked salmon. Finely chop smoked salmon and stir into poached salmon along with butter, shallot, and lemon juice.",
        "Beat cream in another bowl with an electric mixer until it holds soft peaks, then fold into salmon. Spoon salmon filling over pumpernickel crust, smoothing top.",
        "Toss cucumber with dill, then scatter evenly over salmon filling, pressing slightly to help adhere. Chill, covered with plastic wrap, until firm, at least 8 hours.",
        "Cut into 36 squares and serve cold or at room temperature."
    ],
    "ingredients": [
        "6 slices pumpernickel bread (6 oz)",
        "2 tablespoons unsalted butter, melted",
        "1/2 teaspoon salt",
        "1 (1-lb) piece fresh salmon fillet, skinned",
        "1 (1/2-lb) piece smoked salmon, skinned",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons minced shallot",
        "1 1/2 tablespoons fresh lemon juice",
        "3/4 cup heavy cream",
        "1 English cucumber, halved lengthwise, seeded, and cut into 1/8-inch dice",
        "4 teaspoons chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Vegetable",
        "Bake",
        "Poach",
        "Cocktail Party",
        "Salmon",
        "Dill",
        "Gourmet"
    ],
    "title": "Salmon and Cucumber Pumpernickel Squares",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-and-cucumber-pumpernickel-squares-105903"
}
