{
    "directions": [
        "Stir together 2 tablespoons oil and 1/2 teaspoon zest in a bowl and set aside.",
        "Combine lemon juice, garlic, 1/8 teaspoon salt, 1/8 teaspoon pepper, and remaining 1/4 teaspoon zest in a small bowl, then add remaining 2 tablespoons oil in a slow stream, whisking until combined. Whisk in cream and chives.",
        "Blanch sugar snaps in a 3- to 4-quart saucepan of boiling salted water , uncovered, until crisp-tender, about 2 minutes. Transfer sugar snaps with a slotted spoon to a bowl of ice and cold water to stop cooking. Keep cooking water at a boil. Once sugar snaps are cool, pat dry between paper towels. Cook baby peas in boiling water 5 minutes, then drain in a sieve and set sieve in ice water to stop cooking. Drain peas, then pat dry between paper towels.",
        "Cut sugar snaps diagonally into 1/4-inch-thick slices and transfer to a bowl, then toss with peas and lettuce.",
        "Preheat broiler.",
        "Arrange 1 fillet, skinned side down, between 2 sheets of plastic wrap and lightly sprinkle top of plastic with water (this helps pounder slide a little), then gently pound to an even 1/4-inch thickness with flat side of a meat pounder or with a rolling pin. Flatten remaining fillets in same manner and leave in plastic wrap.",
        "Lightly brush bottoms of 2 shallow baking pans with some lemon oil. Flip each paillard over and carefully peel off sheet of plastic wrap from skinned side, then invert fillets into baking pans (2 per pan). Carefully peel off remaining plastic wrap.",
        "Sprinkle fillets with remaining 1/8 teaspoon salt and 1/8 teaspoon pepper, then brush with remaining lemon oil. Working in 2 batches, broil fillets 4 inches from heat until just cooked through, about 1 1/2 minutes per batch. Keep first batch warm, covered with foil, while cooking second batch.",
        "Toss salad with just enough dressing to coat.",
        "Carefully transfer paillards with a metal spatula to 4 plates and spoon salad on top."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "3/4 teaspoon finely grated fresh lemon zest",
        "2 teaspoons fresh lemon juice",
        "1/4 teaspoon finely chopped garlic",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon heavy cream",
        "1 tablespoon finely chopped fresh chives",
        "6 ounces sugar snap peas, trimmed and strings discarded (2 cups)",
        "1/2 cup frozen baby peas (not thawed)",
        "1 1/2 cups thinly sliced Boston lettuce (from 1 head)",
        "4 (1/4-lb) pieces skinless center-cut salmon fillet (preferably wild)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Vegetable",
        "Broil",
        "Dinner",
        "Lunch",
        "Seafood",
        "Salmon",
        "Pea",
        "Shower",
        "Lettuce",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Salmon Paillards with Lettuce and Pea Salad",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-paillards-with-lettuce-and-pea-salad-238703"
}
