{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Pour in 1 teaspoon of olive oil. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.",
        "Heat 1/4 cup of olive oil, the white pepper, dill, and 1/4 teaspoon of salt in a skillet over medium-low heat until the oil is shimmering. Gently lay the salmon fillet into the oil, and sprinkle with 1 pinch of salt. Arrange the cut asparagus and bits of minced garlic around the salmon in the skillet. Squeeze the lemon slices over the salmon and asparagus, and place the squeezed slices into the skillet. Cover and cook for 8 minutes. Flip the salmon, and cook until the salmon is no longer translucent in the center, about 8 more minutes.",
        "Remove the salmon, asparagus, garlic, and lemon slices from the skillet to a warmed plate, leaving the juices in the skillet. Whisk in the cream and enough Parmesan cheese to thicken the sauce. Let the cheese melt, and season to taste with salt. To serve, divide the cooked penne pasta, salmon, and asparagus between two plates, with the pasta to the side of the salmon. Spoon the cream sauce over the pasta, and serve."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1/2 cup uncooked penne pasta, or as needed",
        "1/4 cup olive oil",
        "1/4 teaspoon white pepper",
        "1/4 teaspoon dried dill weed",
        "1/4 teaspoon salt",
        "1/2 pound salmon fillet",
        "1 pinch salt (optional)",
        "1/2 cup cut fresh asparagus (1 inch pieces), or as needed",
        "2 cloves garlic, minced, or to taste",
        "2 slices fresh lemon",
        "1 1/2 cups heavy cream",
        "1/4 cup freshly grated Parmesan cheese, or to taste",
        "1 pinch salt, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salmon and Asparagus with Penne and Light Cream Sauce",
    "url": "http://allrecipes.com/recipe/213639/salmon-and-asparagus-with-penne-and-l/"
}
