{
    "directions": [
        "In a small saucepan warm brandy over moderate heat and add currants. Remove pan from heat. Let mixture stand, covered, 20 minutes.",
        "Halve onions lengthwise and cut crosswise into 1/4-inch-thick slices. In a large skillet heat oil over moderately high heat until hot but not smoking and cook onions, stirring occasionally, until softened, about 5 minutes. Reduce heat to moderate and cook onions, stirring occasionally, until golden, about 15 minutes more. Add currant mixture, cinnamon, nutmeg, and salt and pepper to taste and cook, stirring, 2 minutes. Transfer mixture to a bowl and cool. Caramelized onions may be made 1 day ahead and chilled, covered.",
        "Preheat oven to 475°F.",
        "Fold each parchment piece in half crosswise and cut each piece to make a large rounded heart shape. (Folded piece should be at least 2 inches larger all around than salmon fillet.) Open a parchment \"heart\" and put a salmon fillet in middle of one side. Sprinkle fillet with 1 tablespoon wine and salt and pepper to taste. Spread one fourth caramelized onions on fillet and fold other side of parchment over. Beginning at bottom end of center crease, in overlapping 1-inch segments fold edges of parchment, crimping as you go, to form a tight seal. Make 3 more papillotes in same manner. Papillotes may be made up to this point 4 hours ahead and chilled, covered.",
        "Put papillotes on a large baking sheet and bake 9 to 15 minutes, or until a skewer inserted through parchment and into fish slides out smoothly.",
        "Serve papillotes immediately, cutting them open at table."
    ],
    "ingredients": [
        "1/4 cup brandy",
        "1/2 cup dried currants",
        "4 large sweet onions such as Walla Walla or Vidalia",
        "1/4 cup olive oil",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "four 24- by 16 1/2-inch pieces parchment paper",
        "four 6-ounce salmon fillets",
        "1/4 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Currant",
        "Salmon",
        "Brandy",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Salmon Papillotes with Caramelized Onions and Currants",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-papillotes-with-caramelized-onions-and-currants-100631"
}
