{
    "directions": [
        "Whisk sugar, ginger, and 1 Tbsp. vinegar in a small bowl. Toss cucumbers and a pinch of salt in a sieve, then gently massage cucumbers to expel excess liquid. Add cucumbers to sugar mixture; cover and chill until cold, at least 30 minutes. Taste pickled cucumbers and season with more salt if needed.",
        "Meanwhile, remove dark green tops from scallions and thinly slice on a diagonal; transfer to a small bowl of ice water and let sit until scallions begin to curl, 10–15 minutes. Drain scallion tops, then squeeze out excess liquid with paper towels.",
        "Thinly slice pale green and white parts of scallions, then whisk in a medium bowl with soy sauce, mirin, grapefruit juice, lemon juice, and remaining 1 Tbsp. vinegar to combine. Transfer 3 Tbsp. ponzu to a second medium bowl. Add lettuce to bowl used to make ponzu; toss to coat and season with salt. Add salmon to second bowl with 3 Tbsp. ponzu and gently toss to coat. Add avocado, drained pickled cucumbers, and scallion tops to bowl with salmon and toss again. Season with more salt if needed.",
        "Divide dressed lettuce among bowls. Top with salmon mixture and wasabi green peas; sprinkle with furikake.",
        "Cucumbers can be pickled 3 days ahead; keep chilled. Ponzu can be made 1 day ahead; cover and chill."
    ],
    "ingredients": [
        "1 teaspoon sugar",
        "1/2 teaspoon finely grated peeled ginger",
        "2 tablespoons unseasoned rice vinegar, divided",
        "2 Persian cucumbers, thinly sliced",
        "Kosher salt",
        "2 scallions",
        "3 tablespoons white or dark soy sauce",
        "1 tablespoon plus 1 1/2 teaspoons mirin",
        "1 tablespoon plus 1 1/2 teaspoons fresh grapefruit juice",
        "1 teaspoon fresh lemon juice",
        "5 heads of Little Gem lettuce, cores removed, leaves separated",
        "12 ounces fresh salmon, cut into 1/2-inch pieces",
        "1 avocado, cut into 1/2-inch pieces",
        "1/4 cup prepared wasabi green peas, crushed",
        "Furikake (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salmon",
        "Raw",
        "Hawaii",
        "Ginger",
        "Lettuce",
        "Avocado",
        "Wasabi",
        "Pea",
        "Cucumber",
        "Dinner"
    ],
    "title": "Salmon Poke on Greens With Wasabi Peas",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-poke-on-greens-with-wasabi-peas"
}
