{
    "directions": [
        "Bring wine, shallots, and vinegar to boil in heavy small saucepan. Reduce heat to low and simmer until liquid is reduced to 2 tablespoons, about 5 minutes. Remove pan from heat and cover.",
        "Do ahead: Can be made 4 hours ahead. Let stand at room temperature.",
        "Preheat oven to 400°F. Place each potato on separate sheet of foil, sprinkle with sea salt, and wrap tightly. Bake until tender, about 1 hour. Remove foil; cool to just warm, about 20 minutes. Cut lengthwise in half. Scoop flesh into medium microwave-safe bowl, leaving 1/4-inch-thick potato shell. Add 2 tablespoons butter and milk to potatoes in bowl; mash well. Stir in sour cream and 3 tablespoons green onion tops. Season to taste with salt and pepper.",
        "Do ahead: Can be made 2 hours ahead. Loosely cover shells and filling separately and let stand at room temperature.",
        "Rewarm potato shells, then filling, in microwave at 20-second intervals until heated through. Stir smoked salmon into filling; season with sea salt and pepper. Mound filling in shells.",
        "Place 1/4 cup water and salmon fillets in heavy large skillet; sprinkle with salt and pepper. Cover; steam over medium-high heat until salmon is just opaque in center, about 3 minutes.",
        "Meanwhile, rewarm wine-shallot reduction over medium-low heat. Add remaining 8 tablespoons butter, 1 tablespoon at a time, whisking until each is melted before adding next; continue whisking until beurre rouge is thick (do not overheat or sauce may separate). Season with salt and pepper.",
        "Spoon sauce onto 4 plates. Place potatoes on 1 side; sprinkle with remaining green onions. Arrange 2 salmon strips atop sauce on each plate; sprinkle with peppercorns and chives."
    ],
    "ingredients": [
        "1/2 cup dry red wine",
        "1/4 cup minced shallots",
        "1/2 teaspoon red wine vinegar",
        "2 8-ounce Yukon Gold potatoes",
        "Fine sea salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, divided",
        "2 tablespoons whole milk",
        "1/2 cup sour cream",
        "4 tablespoons chopped green onion tops, divided",
        "4 ounces smoked salmon, chopped",
        "1/4 cup water",
        "4 7- to 8-ounce skinless salmon fillets, each cut lengthwise into 2 strips",
        "Cracked black peppercorns",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Herb",
        "Onion",
        "Potato",
        "Steam"
    ],
    "title": "Salmon with Beurre Rouge and Smoked-Salmon-Stuffed Baked Potato",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-beurre-rouge-and-smoked-salmon-stuffed-baked-potato-235839"
}
