{
    "directions": [
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add onions and sauté until deep golden brown, about 28 minutes. Set aside.",
        "Boil cream and clam juice in heavy large saucepan until reduced to 1 cup, about 15 minutes. Remove from heat. Whisk in horseradish. Season sauce to taste with salt and pepper. (Caramelized onions and sauce can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Cook broccoli rabe in large pot of boiling salted water until crisp-tender, about 2 minutes. Using tongs, transfer to plate. Reserve cooking water. Cut broccoli rabe lengthwise in half, then chop coarsely crosswise. Return water in pot to boil. Add pasta and cook until tender but still firm to bite, stirring occasionally. Drain, reserving 1 cup cooking liquid. Return pasta to same pot. Add 2 tablespoons oil, caramelized onions, broccoli rabe, Parmesan cheese, and 3/4 cup reserved cooking liquid. Toss pasta mixture over medium-high heat until heated through, adding remaining reserved cooking liquid if pasta is dry, about 5 minutes. Season pasta to taste with salt and pepper.",
        "Meanwhile, sprinkle salmon with salt and pepper. Heat remaining 2 tablespoons oil in heavy large skillet over high heat. Add salmon to skillet, skin side up, and cook until brown on bottom, about 3 minutes. Turn salmon over and cook until skin is golden brown and crisp and salmon is just opaque in center, about 3 minutes longer.",
        "Bring horseradish sauce to simmer. Divide pasta mixture among 4 plates. Top with salmon, skin side down. Spoon horseradish sauce over salmon and serve.",
        "*Available at specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "6 tablespoons olive oil",
        "1 1/4 pounds onions, thinly sliced",
        "2 cups whipping cream",
        "1 8-ounce bottle clam juice",
        "3 tablespoons prepared white horseradish",
        "1 10- to 12-ounce bunch broccoli rabe* (also called rapini)",
        "12 ounces orecchiette (little ear-shaped pasta)",
        "1 cup grated Parmesan cheese (about 3 ounces)",
        "4 6-ounce salmon fillets with skin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Onion",
        "Pasta",
        "Sauté",
        "Horseradish",
        "Parmesan",
        "Salmon",
        "Fall",
        "Broccoli Rabe"
    ],
    "title": "Salmon with Orecchiette, Caramelized Onions, and Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-orecchiette-caramelized-onions-and-horseradish-cream-108239"
}
