{
    "directions": [
        "Trim 1 to 2 inches off thinner (belly) side of salmon fillets so that remaining fillets have a more even thickness. Reserve the belly strips for another use. You will now have 2 more square-shaped pieces of salmon fillet. Cut each fillet into 4 roughly equal-size pieces for a total of 8 pieces.",
        "Arrange fish, skin side down, on a baking sheet (or 2 dinner plates). Season with 1 teaspoon each salt and pepper.",
        "Scrub potatoes well. Cut several 1/16-inch-thick slices lengthwise from wider side of 1 potato with slicer (discard outer piece or pieces that are all peel). Stack slices of potato and cut out as many rounds as possible with cookie cutter.",
        "Dip potato rounds, one at a time, in butter and lay slices on top of one piece of fish in an overlapping pattern (to resemble fish scales), covering surface completely. Continue cutting and stacking a few potato slices at a time and cutting and applying potato \"scales\" to fish in batches, until tops of all pieces of fish are coated. Lightly brush any remaining butter over scales, and chill until butter is firm, about 1 hour.",
        "Preheat oven to 400°F with rack in middle. Line a large rimmed sheet pan with foil.",
        "Heat oil in a 12-inch nonstick skillet over medium heat until it shimmers (dip a corner of a fish fillet into skillet to test; it should sizzle). Add 2 to 3 pieces of fish, potato sides down, to skillet. Cook until potatoes are golden brown and crisp, 2 to 4 minutes. Carefully turn fish over using 2 spatulas and cook until skin is golden and crisp, about 2 minutes. Carefully transfer fillets (again using 2 spatulas), skin sides down, to sheet pan. Brown remaining fillets.",
        "Roast fish in oven until just cooked through, 4 to 8 minutes (depending on thickness; a possible visual clue—the better quality the salmon, the less likely you'll see it—is when the white albumin in the fish exudes from the fish and begins to set)."
    ],
    "ingredients": [
        "2 (2 pound) pieces center-cut salmon fillet",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "2 large russet (baking) potatoes (about 1 1/2 pounds total)",
        "1 stick (1/2 cup) unsalted butter, melted",
        "2 tablespoons olive oil",
        "Lemon slices for serving",
        "Special equipment: An adjustable-blade slicer; a 1- to 1 1/2-inch round cookie cutter; two slotted spatulas (see Cooks' notes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Potato",
        "Roast",
        "Hanukkah",
        "Dinner",
        "Seafood",
        "Salmon",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Salmon with Potato \"Scales\"",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-potato-scales-51142400"
}
