{
    "directions": [
        "Combine 4 cups water, wine, 2 tbsp. Old Bay, and 1 tbsp. salt in a 10\" skillet. Bring to a boil over high heat.",
        "Add salmon skin side down, turn off the heat, cover, and let salmon cook gently in the hot liquid for 10 minutes.",
        "Using a metal spatula, transfer salmon to a plate skin side up and let cool. (The salmon should still be rare in the middle.)",
        "Peel off and discard salmon skin. Break salmon into small pieces and places pieces in a large bowl.",
        "Add the remaining Old Bay and salt along with the bread crumbs, Melt(R), scallions, onions, eggs, and lemon juice. Stir ingredients until just combined and refrigerate for 1/2 hour.",
        "Spoon some of the salmon mixture into a 1/3-cup measuring cup and gently pack it with your hands. Unmold and press gently with your hand to form a 2\"-wide patty; transfer patty to a parchment paper-lined baking sheet. Repeat to make 12 patties. Refrigerate patties for at least 1 hour or overnight.",
        "Add oil to a 12\" cast-iron skillet until it reaches a depth of 1/2\". Heat over medium-high heat until oil registers 325 degrees  on a deep-fry thermometer. Using a metal spatula, gently transfer half of the patties to skillet and cook, flipping once with the spatula, until golden brown, about 5 minutes.",
        "Transfer cakes to a paper towel-lined plate and repeat with remaining patties."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/988205.jpg",
    "ingredients": [
        "1/2 cup white wine",
        "3 tablespoons Old Bay seasoning, divided",
        "1 tablespoon kosher salt",
        "1 (1 pound) boneless salmon fillet",
        "1 teaspoon kosher salt",
        "1 1/2 cups dried bread crumbs",
        "3 tablespoons Melt® Organic Buttery Spread",
        "4 scallions, finely chopped",
        "1 small yellow onion, finely chopped",
        "2 eggs, beaten",
        "Juice of 1 lemon",
        "Canola oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salmon Cakes by Melt® Buttery Spread",
    "url": "http://allrecipes.com/recipe/220539/salmon-cakes-by-melt-buttery-sprea/"
}