{
    "directions": [
        "Preheat oven to 350°F. Place large piece of foil on baking sheet; brush with oil. Place salmon fillet in center of foil; sprinkle with salt and pepper. Place 3 fennel fronds atop salmon. Enclose salmon in foil. Bake until salmon is just opaque in center, about 30 minutes. Unwrap salmon; cool completely.",
        "Remove any bones from salmon. Place salmon in processor. Add smoked salmon, cream cheese and lemon juice. Blend to coarse puree using on/off turns. Transfer to bowl. Mix in 3 tablespoons chives. Season with salt and pepper.Using 1 1/2- to 1 3/4-inch-diameter cookie cutter or biscuit cutter, cut out rounds from pumpernickel bread. (Salmon spread and pumpernickel rounds can be made 1 day ahead. Cover and chill salmon spread. Store pumpernickel rounds in sealed plastic bag at room temperature.)",
        "Spread 1 tablespoon salmon mixture atop each pumpernickel round. Top with 1/4 teaspoon salmon caviar. Garnish with additional fennel fronds or chives. Place on platter. Surround with lemon. (Can be made 4 hours ahead. Cover and chill.)"
    ],
    "ingredients": [
        "Olive oil",
        "1 1-pound center-cut skinless salmon fillet (about 1 1/2 inches thick)",
        "3 fresh fennel fronds (from 1 fennel bulb)",
        "8 ounces smoked salmon, chopped",
        "1 8-ounce package cream cheese, room temperature",
        "1 tablespoon fresh lemon juice",
        "3 tablespoons chopped fresh chives or green onion tops",
        "2 8-ounce packages sliced Westphalian-style or Danish-style pumpernickel bread (about 20 slices)",
        "3 2-ounce jars red salmon caviar",
        "Additional fresh fennel fronds or chopped fresh chives",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Cream Cheese",
        "Salmon",
        "Winter"
    ],
    "title": "Salmon, Cream Cheese and Caviar on Pumpernickel Rounds",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-cream-cheese-and-caviar-on-pumpernickel-rounds-4546"
}
