{
    "directions": [
        "In a saucepan, cook the wild rice (two parts water to one part rice) by boiling for 45 minutes. Leave to the side to cool.",
        "Meanwhile, in another saucepan, cover the beet with water; bring to a boil, then reduce the heat and simmer for about 30 minutes, until the beet is tender. Drain, and when cool enough to handle, peel off the skin and cut the beet into coarse chunks.",
        "Chop the pomegranate in half and extract the seeds. Add the pomegranate, beet, olive oil, and mint to the rice. Leave to the side.",
        "Make the wasabi coating by mixing together the mayonnaise, cumin, and wasabi. Taste and adjust if you want. Preheat the oven to 350°F/180°C.",
        "Wash and dry the salmon, and season. Heat a griddle or ovenproof frying pan big enough to fit both salmon fillets and, when it is searing hot, drop in the salmon, skin-side down. Turn after 5 minutes or when the skin is brown and crispy. Take off the heat, carefully turn again, and spoon the wasabi coating onto the top of the salmon. Put the pan into the oven and cook for around 10 minutes, until the coating begins to brown. Serve on the wild rice."
    ],
    "ingredients": [
        "3/4 cup/100 g wild rice",
        "1 large beet",
        "1 pomegranate",
        "1 tablespoon olive oil",
        "A small handful of chopped fresh mint",
        "Salt and pepper",
        "2 tablespoons mayonnaise",
        "1/2 teaspoon ground cumin",
        "1 teaspoon wasabi paste or powder mixed to a paste with water",
        "2 salmon fillets, about 6 ounces/175 g each",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Rice",
        "Dinner",
        "Wasabi",
        "Seafood",
        "Salmon",
        "Beet",
        "Fall",
        "Anniversary",
        "Pomegranate",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Salmon Fillets with a Wasabi Coating",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-fillets-with-a-wasabi-coating-51137410"
}
