{
    "directions": [
        "In large sealable plastic bag, combine chives, basil, tarragon, parsley, 2 tablespoons mint, garlic, and 3/4 cup olive oil. Add salmon and seal bag, pressing out air. Turn bag to coat salmon, then refrigerate, turning bag over occasionally, at least 1 hour and up to 4 hours. (Alternatively, marinate salmon in large glass baking dish.)",
        "Preheat grill to moderate heat.",
        "Remove fish from marinade and pat dry. Sprinkle with salt and pepper. Grill steaks, turning once, until just opaque in center, about 4 minutes per side. Transfer to platter and cover loosely with foil to keep warm.",
        "In 6-quart heavy stock pot over moderate heat, heat remaining 1/2 cup olive oil until hot but not smoking. Add fennel and onion and sauté until just soft, about 2 minutes. Add wine, butter, saffron, remaining 1/2 cup mint, and clams, cover and bring to boil. Cook until clams open, about 10 minutes. Discard any clams that have not opened.",
        "Place 1 piece salmon on center of each of 8 wide shallow bowls. Spoon clams, broth, onions, and fennel around salmon and serve immediately."
    ],
    "ingredients": [
        "2 tablespoons fresh chives, chopped",
        "2 tablespoons fresh basil, chopped",
        "2 tablespoons fresh tarragon, chopped",
        "2 tablespoons fresh parsley, chopped",
        "1/2 cup plus 2 tablespoons fresh mint, chopped (from 2 bunches)",
        "6 cloves garlic, finely chopped (about 2 tablespoons)",
        "1 1/4 cup extra-virgin olive oil",
        "8 (1-inch-thick) salmon steaks, preferably sockeye or another wild variety",
        "2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 medium fennel bulb, stalks cut off and discarded, and bulb cored and thinly sliced lengthwise",
        "1 medium sweet onion, such as Vidalia, thinly sliced",
        "1 cup dry white wine",
        "1/2 cup (1 stick) unsalted butter",
        "1 teaspoon saffron threads",
        "32 small (less than 2 inches wide) hard-shelled clams such as littleneck*, scrubbed (about 3 1/2 pounds total)",
        "*If littleneck clams are unavailable, Manila or brown-shelled may be substituted.",
        "Special Equipment: charcoal or gas grill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Herb",
        "Onion",
        "Shellfish",
        "Marinate",
        "Sauté",
        "Grill/Barbecue"
    ],
    "title": "Salmon Steaks with Littleneck Clams and Saffron-Mint Broth",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-steaks-with-littleneck-clams-and-saffron-mint-broth-238204"
}
