{
    "directions": [
        "In a saucepan cook the spinach according to the package instructions, drain it, and let it cool. When the spinach is cool enough to handle, squeeze it dry by handfuls, transferring it as it is squeezed to a bowl. (The spinach should be very dry.) In the saucepan cook the onion and the fennel bulb and seeds in 2 tablespoons of the butter over moderate heat, stirring, until the vegetables are softened, stir in the flour, and cook the mixture, stirring, for 1 minute. Add the milk and apéritif and cook the mixture, stirring, for 3 minutes. (The mixture will be extremely thick.) Stir the fennel mixture into the spinach with 1/2 cup of the Parmesan and salt and pepper to taste. The filling may be made 1 day in advance and kept covered and chilled.",
        "In a non-stick skillet melt 1 tablespoon of the remaining butter over moderately high heat until the foam subsides and in it sauté the salmon steaks, patted dry and seasoned with salt and pepper, for 1 minute on each side. Add the water to the skillet and cook the salmon, covered, over moderately low heat for 5 to 6 minutes, or until it is just cooked through. Remove the skillet from the heat and let the salmon cool. Discard the skin from the salmon, halve the steaks, and discard the bones. In a small bowl stir together the remaining 2 tablespoons Parmesan and the bread crumbs.",
        "Preheat the oven to 425°F. In a small saucepan melt the remaining 5 tablespoons butter. On a work surface arrange two 20-inch-long sheets of wax paper with the long sides slightly overlapping and facing you. Put 1 sheet of the phyllo on the wax paper, brush it with some of the butter, and sprinkle it with about 2 teaspoons of the Parmesan crumbs. On this, layer, brush, and sprinkle 4 more sheets of the phyllo in the same manner and lay the sixth sheet on top.",
        "Spread the spinach filling in a 3-inch-wide strip, mounding it on the phyllo 4 inches above the near long side, leaving a 2-inch border at each end, and arrange the salmon on top, pressing it gently into the filling. Using the wax paper as a guide, lift the bottom 4 inches of the pastry over the filling, fold in the ends, and roll up the strudel tightly. Transfer the strudel carefully, seam side down, to a lightly buttered baking sheet, brush it with the remaining butter, and bake it in the lower third of the oven for 25 minutes, or until it is golden. Let the strudel cool to warm on the baking sheet on a rack. The strudel may be made 1 day in advance and kept covered loosely and chilled. Reheat the strudel in a preheated 400°F. oven for 15 minutes. Serve the strudel warm, cut into 1-inch slices with a serrated knife, with the lemon wedges."
    ],
    "ingredients": [
        "two 10-ounce packages frozen chopped spinach",
        "1 cup chopped onion",
        "3/4 cup chopped fennel bulb (sometimes called anise)",
        "2 teaspoons fennel seeds",
        "1 stick (1/2 cup) unsalted butter",
        "2 tablespoons all-purpose flour",
        "1/2 cup milk",
        "2 tablespoons Ricard or other anise-flavored spirit",
        "1/2 cup plus 2 tablespoons freshly grated Parmesan",
        "two 3/4-inch-thick salmon steaks (about 1/2 pound each)",
        "2 tablespoons water",
        "2 tablespoons fine dry bread crumbs",
        "six 18- by 14-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened kitchen towel",
        "lemon wedges as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Parmesan",
        "Salmon",
        "Pernod",
        "Fennel",
        "Spinach",
        "Winter",
        "Gourmet"
    ],
    "title": "Salmon and Spinach Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-and-spinach-strudel-10973"
}
