{
    "directions": [
        "Whisk crème fraîche, 1 tablespoon lemon juice, and 1/2 teaspoon lemon peel in small bowl. Season with salt and generous amount of pepper.",
        "Whisk honey, 1 tablespoon olive oil, shallot, 2 tablespoons lemon juice, and remaining 1/2 teaspoon lemon peel in 11x7x2-inch glass baking dish. Add salmon fillets and turn to coat. Cover and chill at least 15 minutes and up to 1 hour, turning salmon fillets occasionally. Position rack in top third of oven and preheat to 400°F. Line large baking sheet with foil and brush with olive oil. Transfer salmon fillets, with some marinade still clinging, to rimmed baking sheet. Roast until salmon is just opaque in center, about 14 minutes.",
        "Meanwhile, toss watercress leaves and sprigs, dill sprigs, tarragon leaves, remaining 2 teaspoons lemon juice, and remaining 2 teaspoons olive oil in medium bowl. Season to taste with fleur de sel and pepper.",
        "Place 1 salmon fillet on each of 6 plates. Top with watercress salad. Drizzle with lemon-pepper sauce and garnish with lemon wedges. Serve, passing additional sauce alongside.",
        "*A type of sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "1 cup crème fraîche or sour cream",
        "3 tablespoons plus 2 teaspoons fresh lemon juice, divided",
        "1 teaspoon finely grated lemon peel, divided",
        "2 tablespoons honey",
        "1 tablespoon plus 2 teaspoons olive oil plus additional for brushing",
        "2 tablespoons chopped shallot",
        "6 6-ounce salmon fillets",
        "1 1/2 cups (lightly packed) watercress leaves and small sprigs",
        "1/4 cup small fresh dill sprigs",
        "1/4 cup fresh tarragon leaves",
        "Fleur de sel*",
        "6 lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Lemon",
        "Salmon",
        "Healthy",
        "Honey",
        "Tarragon",
        "Watercress",
        "Dill"
    ],
    "title": "Salmon with Lemon-Pepper Sauce and Watercress-Herb Salad",
    "url": "http://www.epicurious.com/recipes/food/views/salmon-with-lemon-pepper-sauce-and-watercress-herb-salad-241621"
}
