{
    "directions": [
        "Put the flank steak, the thickly sliced onion, garlic, peppercorns and bay leaves in a large pot or saucepan and add water to cover. Bring to a boil over high heat, then reduce the heat so that only a few bubbles occasionally rise to the surface. Skim off any foam that forms on the surface and add the oregano and the 2 tsp. sea salt. Let simmer until a piece of the flank steak shreds easily, 30 to 45 minutes.",
        "Meanwhile, in a fry pan over medium heat, warm the olive oil. Add the thinly sliced onion and sauté until translucent, about 4 minutes. Stir in the lime juice, chilies and pickling liquid and simmer until the flavors are well mingled, about 2 minutes. Remove from the heat and set aside.",
        "When the beef is tender, remove the pan from the heat. Let the beef cool in the broth, then remove it from the broth. Measure out 1/2 cup of the broth and reserve. Refrigerate the remaining broth for another use.",
        "Trim off any excess fat from the beef, then finely shred the beef. Put it into a bowl with the 1/2 cup broth and let stand until the beef has absorbed all of the liquid, about 5 minutes. Add the onion mixture, cheese and cilantro. Season with sea salt and pepper, then toss together with your hands or a fork until well mixed. Let rest for 15 to 20 minutes to allow the flavors to blend.",
        "Make a bed of the whole romaine leaves on a platter. Mound the beef mixture on the lettuce and garnish with the avocado slices, shredded lettuce and finely chopped onion. Serve at room temperature. Serves 6."
    ],
    "ingredients": [
        "2 lb. beef flank steak, cut into 2 equal pieces",
        "1 white onion, thickly sliced, plus 1/2 white\n onion, thinly sliced, and 1/2 cup finely\n chopped white onion",
        "3 garlic cloves",
        "6 peppercorns",
        "2 bay leaves",
        "1 Tbs. dried oregano, preferably Mexican",
        "2 tsp. sea salt, plus more, to taste",
        "1/2 cup olive oil",
        "1/4 cup fresh lime juice",
        "4 pickled jalapeño or serrano chilies, finely chopped, with 2 Tbs. pickling liquid",
        "1/2 cup cubed Monterey jack cheese",
        "1/2 cup fresh cilantro leaves, chopped",
        "Freshly ground pepper, to taste",
        "Inner leaves from 1 small head romaine lettuce, plus 1 cup shredded romaine",
        "1 firm but ripe Haas avocado, pitted, peeled and sliced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Salpicón of Beef",
    "url": "http://www.williams-sonoma.com/recipe/salpicon-of-beef.html"
}
