{
    "directions": [
        "Bring the tomatillos, garlic cloves, and water to a boil in a small saucepan over high heat. Reduce heat to medium-low, and simmer until the tomatillos have lost their shape, 15 to 20 minutes.",
        "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.  Cut the serrano peppers and poblano peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut-side-down onto the prepared baking sheet.",
        "Cook under the preheated broiler until about 3/4 of the skin has blackened and blistered, 3 to 5 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam for 5 to 7 minutes. Remove and discard the blackened skins. Stir the peppers into the simmering tomatillos; cook 5 minutes more.",
        "Heat the vegetable oil in a skillet over medium heat. Stir in the yellow onion, and cook until the onion has softened and is beginning to turn brown, 7 to 10 minutes. Place the yellow onions into a blender along with the tomatillo mixture. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the salsa moving before leaving it on to puree. Puree until no large chunks remain. Return to the skillet, and simmer over medium-high heat 5 to 7 minutes until the salsa thickens slightly. Pour into a bowl, and cool to room temperature.",
        "Once cool, stir in the salt, cilantro, red onion, and lime juice to serve."
    ],
    "ingredients": [
        "10 fresh tomatillos, husks removed",
        "3 cloves garlic",
        "1 cup water",
        "4 serrano chiles, stemmed",
        "2 poblano chiles, stemmed",
        "3 tablespoons vegetable oil",
        "1 yellow onion, chopped",
        "1 teaspoon coarse salt",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons minced red onion",
        "1 tablespoon fresh lime juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salsa de Tomatillos Como Las Asadas y Big Star",
    "url": "http://allrecipes.com/recipe/214638/salsa-de-tomatillos-como-las-asadas-y/"
}
