{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 5x9-inch loaf pan.",
        "Mix the croutons with salsa in a large bowl, and set aside to soften, about 15 minutes. Heat olive oil in a skillet over medium heat, and cook the jalapeno pepper, onion, and garlic until the onion is translucent, 5 to 8 minutes.",
        "Mix the ground chicken, ground pork, egg, taco seasoning, Worcestershire sauce, pepperjack cheese, and cilantro into the crouton mixture, and mash any unbroken croutons. Mix in the cooked onion mixture. Transfer the meatloaf into the prepared loaf pan. Mix the barbecue sauce and brown sugar together in a bowl, stirring until the sugar has dissolved, and brush the barbecue sauce mixture over the loaf. Fold a 12-inch long piece of aluminum foil into a tent, and place the foil tent over the loaf.",
        "Bake in the preheated oven until the juices run clear and the loaf is no longer pink in the center, about 1 hour. Remove foil tent for last 10 minutes of baking. An instant-read thermometer inserted into the center of the loaf should read at least 160 degrees F (72 degrees C). Remove from oven, cover the loaf with foil, and let stand for 15 minutes before serving."
    ],
    "ingredients": [
        "1 1/4 cups herb-seasoned croutons",
        "1 (12 ounce) jar salsa",
        "1 tablespoon olive oil",
        "1 jalapeno pepper, seeded and minced",
        "1 cup finely chopped onion",
        "3 cloves garlic, minced",
        "1 pound ground chicken",
        "1/2 pound ground pork",
        "1 egg",
        "1 1/2 tablespoons taco seasoning mix",
        "1 tablespoon Worcestershire sauce",
        "1 cup shredded pepperjack cheese",
        "1/4 cup cilantro, minced",
        "2 tablespoons barbecue sauce",
        "2 tablespoons brown sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salsa Chicken Meatloaf",
    "url": "http://allrecipes.com/recipe/217911/salsa-chicken-meatloaf/"
}
