{
    "directions": [
        "To prepare the dough, in a small bowl, whisk together the yeast, sugar and warm water and let stand until foamy, about 5 minutes.",
        "In the bowl of a food processor fitted with the dough blade, combine the 2 1/4 cups flour and the salt and pulse 3 or 4 times.",
        "Whisk 1 Tbs. of the olive oil into the yeast mixture. With the motor running, slowly add the yeast mixture to the flour mixture, allowing each addition to be absorbed before adding more. Pulse the machine 10 to 15 times to knead the dough. The dough should clean the insides of the bowl but will be slightly sticky.",
        "Coat the inside of a large bowl with the remaining 1 Tbs. olive oil. Dust your hands with flour and remove the dough from the food processor. Form the dough into a ball and place in the bowl. Cover the bowl tightly with plastic wrap and let the dough rise in a warm place until doubled in size, 1 to 1 1/2 hours.",
        "Meanwhile, prepare the toppings: In a large nonstick fry pan over medium-high heat, warm the 2 tsp. olive oil. Add the sausage and cook, breaking it up into small pieces with a spatula, until browned, about 6 minutes. Transfer to a paper towel-lined plate. Wipe out the pan, return it to medium-high heat and warm the 2 Tbs. olive oil. Add the garlic and cook, stirring frequently, for 30 seconds. Add the broccoli rabe, season with salt and pepper and cook, stirring frequently, until crisp-tender, about 4 minutes. Transfer to a bowl.",
        "Forty-five minutes to 1 hour before cooking, build a small fire in an outdoor pizza oven according to the manufacturer’s instructions; let the temperature reach 475°F.",
        "Divide the pizza dough into 2 equal portions. On a lightly floured surface, roll out 1 piece of dough into an 11-inch round. Transfer to a floured pizza peel. Top with half of the tomato sauce, then with half each of the cheese, broccoli rabe and sausage. Transfer the pizza to the oven and bake until the bottom of the crust is crisp and the cheese is melted, 4 to 5 minutes. Transfer the pizza to a cutting board and cover loosely with aluminum foil. Repeat to make the second pizza. Drizzle the pizzas with the dipping oil, cut into slices and serve immediately. Makes two 11-inch pizzas.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1 1/2 tsp. active dry yeast",
        "1 tsp. sugar",
        "3/4 cup warm water (105° to 115°F)",
        "2 1/4 cups “00” flour, plus more for dusting",
        "1 1/4 tsp. kosher salt",
        "2 Tbs. extra-virgin olive oil",
        "2 tsp. plus 2 Tbs. olive oil",
        "1 lb. sweet Italian sausage, casings removed",
        "1 tsp. minced garlic",
        "1 bunch broccoli rabe, about 11 oz., cut crosswise into 1-inch pieces",
        "Kosher salt and freshly ground pepper, to taste",
        "1 cup prepared tomato sauce",
        "2 cups shredded mozzarella cheese",
        "Red pepper garlic dipping oil for drizzling"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Salsiccia Pizza with Broccoli Rabe",
    "url": "http://www.williams-sonoma.com/recipe/salsiccia-pizza-broccoli-rabe.html"
}
