{
    "directions": [
        "Prepare barbecue (medium-high heat). Thread garlic onto skewer. Grill garlic, tomatillos, onion quarters, and chiles until dark brown spots form on all sides, about 9 minutes for onion, 6 minutes for tomatillos and chiles, and 4 minutes for garlic. Cool. Peel garlic. Trim core from onion. Scrape some of burnt skin off chiles; stem. Seed chiles for milder salsa, if desired. Coarsely chop onion, chiles, and garlic. Transfer tomatillos and all vegetables to blender. Add cilantro and 1/2 teaspoon sugar; puree until smooth. Season to taste with coarse salt.",
        "Heat oil in heavy large saucepan over high heat. Carefully add tomatillo mixture (juices may splatter). Stir until slightly thickened, stirring often, about 2 minutes. Add broth and 2 tablespoons lime juice. Bring to boil; reduce heat to medium and simmer until mixture measures 2 1/2 cups, about 10 minutes. Season to taste with salt and more sugar and lime juice, if desired. DO AHEAD: Can be made 1 day ahead. Cool slightly, then cover and chill."
    ],
    "ingredients": [
        "3 unpeeled garlic cloves",
        "1 pound fresh tomatillos, husked, rinsed",
        "1 small onion, quartered through root end",
        "3 to 6 serrano chiles or 2 to 4 jalapeño chiles",
        "1/4 cup chopped fresh cilantro",
        "1/2 teaspoon (or more) sugar",
        "Coarse kosher salt",
        "2 tablespoons olive oil",
        "1 cup low-salt chicken broth",
        "2 tablespoons (or more) fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Blender",
        "Onion",
        "Low Fat",
        "Low Cal",
        "Lime",
        "Hot Pepper",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Low Cholesterol",
        "Tomatillo",
        "Cilantro"
    ],
    "title": "Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/salsa-verde-242139"
}
