{
    "directions": [
        "Cream together butter and sugar. Add egg and vanilla extract and beat until well blended.",
        "Whisk together flour, Diamond Crystal(R) Fine Sea Salt, baking powder and baking soda in a separate bowl.  Add dry ingredients to wet ingredients and mix until just combined. Form in 2 balls. Cover bowl with plastic wrap.  Refrigerate for 1 hour.",
        "Preheat oven to 350 degrees F. Line a baking sheet with parchment paper.",
        "Roll out each ball to 1/4 inch thickness on a sheet of waxed paper sprinkled with confectioner's sugar. Cut out circles or little shapes using a small 1 1/2-inch cookie cutter. Place on prepared baking sheet. (Note:  If dough becomes too soft when rolling out, place back in the refrigerator.)",
        "Bake 5 to 7 minutes. Allow cookies to cool on the baking sheet for 5 minutes. Remove cookies and place on wire rack to cool.",
        "Salted Caramel Filling: Use a microwave safe glass measuring cup. Remove wrappers from caramels. Add caramels, Diamond Crystal(R) Fine Sea Salt, and heavy whipping cream to measuring cup. Microwave using 20-second intervals, for approximately 1 minute. Stir after each interval.",
        "Chocolate Ganache: Use a 1 cup measuring cup. Add 1/4 cup of heavy cream. Microwave until the cream starts to bubble. (Approximately 25-30 seconds.) Remove the heavy cream from the microwave. Add chocolate chips. Let the mixture rest for 2 minutes. Then stir with a spoon until smooth.",
        "To make sandwich cookies, add 1/2 teaspoon of caramel and 1/2 teaspoon of chocolate ganache to the bottom side of half the cookies. Top with another cookie to make a sandwich cookie."
    ],
    "ingredients": [
        "1/2 cup butter, softened",
        "1/2 cup granulated sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1/4 teaspoon Diamond Crystal® Fine Sea Salt",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/4 cup confectioners' sugar for rolling",
        "Salted Caramel Filling:",
        "10 caramels (wrappers removed)",
        "1/8 teaspoon Diamond Crystal® Fine Sea Salt",
        "1/4 cup heavy whipping cream",
        "Ganache:",
        "1/3 cup semisweet chocolate chips",
        "1/4 cup heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salted Caramel Chocolate Sandwich Cookie",
    "url": "http://allrecipes.com/recipe/239419/salted-caramel-chocolate-sandwich-coo/"
}
