{
    "directions": [
        "Dissolve the yeast in water and honey in the bowl of a stand mixer fitted with a dough hook. Allow to stand for 5 minutes or until a creamy foam forms. Add olive oil, Diamond Crystal(R) Fine Sea Salt, caraway seed, onion powder, and garlic powder. Mix until blended. Cover and allow to rest for 15 minutes.",
        "Stir 2 cups of flour into the yeast mixture and mix, adding as much additional flour as necessary for dough to pull away from the sides of the bowl and form a ball on the hook. Knead on low speed for 6 to 8 minutes until smooth and slightly sticky.",
        "Transfer the dough to an oiled bowl, turning to coat. Cover and let rise for about an hour or until doubled.",
        "Stir dough down. Cover bowl again and refrigerate for 4 to 6 hours or overnight to relax the dough.",
        "Line a baking sheet with parchment paper. Lightly scatter half the Diamond Crystal(R) Coarse Sea Salt and half the whole caraway seeds over the surface.",
        "Divide the dough in quarters; cover and refrigerate all but one quarter at a time. Divide each quarter into 6 equal pieces and roll each into a rope about 12 inches long. Place each on the prepared pan and lightly press down.  Repeat with the rest of the dough.",
        "Cover the baking sheet lightly and allow to rest for 30 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Spray or brush each rope with water and sprinkle with the remaining Diamond Crystal(R) Coarse Sea Salt and caraway seeds.",
        "Bake in preheated oven until nicely browned, 20 to 25 minutes.",
        "Transfer to a rack to cool."
    ],
    "ingredients": [
        "2 teaspoons active dry yeast",
        "1 teaspoon honey",
        "1 1/3 cups tepid water (about 100 degrees F)",
        "1 tablespoon olive oil",
        "1 1/2 cups rye flour",
        "1 teaspoon Diamond Crystal® Fine Sea Salt",
        "2 tablespoons ground caraway seeds",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "2 1/4 cups all-purpose flour, or more as needed",
        "1 tablespoon Diamond Crystal® Coarse Sea Salt, divided",
        "1 tablespoon caraway seeds, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salted Caraway Rye Breadsticks",
    "url": "http://allrecipes.com/recipe/239420/salted-caraway-rye-breadsticks/"
}
