{
    "directions": [
        "For the crust: Preheat the oven to 350 degrees F. Line a 9-by-13-inch rectangular baking pan with foil and spray with cooking spray.",
        "Place the vanilla wafers and pecans into the bowl of a food processor and pulse until the mixture becomes crumbs. Add the butter and vanilla and pulse again until combined. Pour into the prepared pan and press the crumbs into the bottom of the pan. If they come up the sides, that's okay!",
        "For the filling: Beat the cream cheese, granulated sugar and vanilla in a medium bowl with an electric mixer until smooth. Add the eggs 1 at a time, beating after each addition. Add the sour cream and mix again.",
        "Pour the mixture into the crust, smooth the top and bake for 50 minutes. Turn off the oven and open the door, leaving the cheesecake to sit in the oven with the door open for 15 minutes. Remove and set aside to cool for an hour.",
        "For the caramel topping: Add the brown sugar and butter to a pan, set over medium heat and cook, stirring, until the butter is melted and the sugar is dissolved. Add the condensed milk, corn syrup and vanilla and bring to a boil, stirring continuously.",
        "Place a candy thermometer in the caramel mixture and continue to boil until the caramel reaches 225 degrees F. Turn off the heat and let the caramel cool for about 5 minutes before pouring over the cheesecake.",
        "Allow to set for 2 hours, then cut into squares with a sharp knife. Arrange on a plate and garnish each square with a pinch of sea salt."
    ],
    "ingredients": [
        "Cooking spray, for spraying the foil",
        "One 11-ounce box vanilla wafers",
        "1/2 cup pecans",
        "8 tablespoons (1 stick) salted butter, melted",
        "1 1/2 teaspoons vanilla extract",
        "Three 8-ounce packages cream cheese, softened",
        "1 1/2 cups granulated sugar",
        "1 1/2 teaspoons vanilla extract",
        "4 large eggs",
        "1/2 cup sour cream",
        "1/2 cup packed dark brown sugar",
        "6 tablespoons salted butter",
        "One 14-ounce can sweetened condensed milk",
        "2 tablespoons dark corn syrup",
        "1 teaspoon vanilla extract",
        "Flaky sea salt, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cream Cheese Recipes",
        "Dessert"
    ],
    "title": "Salted Caramel Cheesecake Squares",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/salted-caramel-cheesecake-squares"
}
