{
    "directions": [
        "Parboil potatoes in a large pot of boiling salted water just until a paring knife slides into the center with some resistance, 15–20 minutes. Drain; transfer to a rimmed baking sheet and chill uncovered until cold, at least 30 minutes.",
        "Place racks in highest and lowest positions in oven; preheat to 425°F. Line two 8\" cake pans with parchment; brush with 2 Tbsp. oil. Toss onions, vinegar, and 1 Tbsp. kosher salt in a large bowl. Let sit until onions are softened, 5–10 minutes (massage gently to speed up process).",
        "Meanwhile, grate parboiled potatoes on a box grater or in a food processor, or cut using a julienne slicer. Place prepared pans on lower rack and heat 5 minutes.",
        "Add potatoes to onion mixture and toss to combine; season with kosher salt and pepper. Divide potato mixture between hot pans and press down as firmly as possible to compact (a thin flexible spatula works well). Place on lower rack and bake until potatoes are very brown around the edges, 45–60 minutes. Remove rösti from oven; let cool slightly.",
        "Heat broiler. Broil rösti on upper rack until tops are golden brown all over. Cut around sides with a small knife or offset spatula to loosen and invert rösti onto a wire rack set inside a rimmed baking sheet. Carefully remove parchment paper (if potatoes stick, let cool slightly). Brush top of rösti with more oil, sprinkle with sea salt, and broil until second side is deep golden brown.",
        "Potatoes can be parboiled 1 day ahead; once cold, cover. rösti can be made 3 hours ahead; store uncovered at room temperature (or keep warm in a 250°F oven up to 1 hour). Reheat in a 300°F oven for 10 minutes before serving."
    ],
    "ingredients": [
        "4 pounds russet potatoes, peeled",
        "1 tablespoon kosher salt, plus more",
        "2 tablespoons olive oil, plus more",
        "2 onions, thinly sliced",
        "1 tablespoon distilled white vinegar",
        "Freshly ground black pepper",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Thanksgiving",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Salt-and-Vinegar Rösti",
    "url": "http://www.epicurious.com/recipes/food/views/salt-and-vinegar-rosti"
}
