{
    "directions": [
        "Rub first 6 ingredients in small bowl to crush herbs finely. DO AHEAD: Can be made 1 week ahead. Cover; store at room temperature. Stir in peel before using.",
        "Rinse turkey inside and out (do not pat dry). Pull any fat pads from main cavity and neck cavity of turkey; wrap, chill, and reserve fat for roasting. Place turkey in roasting bag; sprinkle inside and out with herbed salt. Close bag. Place on baking sheet; refrigerate 18 to 24 hours.",
        "Set rack at lowest position in oven and preheat to 325°F. Rinse turkey inside and out; pat very dry. Stir chopped onion and next 5 ingredients in small bowl. Divide onion mixture between main and neck cavities. Fold neck skin under and secure with skewer. Tuck wing tips under. Tie legs together loosely. Place turkey on rack set in large roasting pan. Spread butter all over turkey. Place reserved fat pads and reserved neck, heart, and gizzard in pan; pour in 2 cups Golden Turkey Stock.",
        "Roast turkey 45 minutes. Baste with pan juices. Continue to roast until thermometer inserted into thickest part of thigh registers 165°F to 170°F, basting every 45 minutes, adding stock or water to pan if dry, and tenting loosely with foil if browning too quickly, 3 to 3 1/2 hours longer. Transfer turkey to platter; tent very loosely with foil and let rest 30 to 45 minutes. Reserve roasting pan with juices for gravy.",
        "Remove turkey neck, heart, and gizzard from roasting pan. Pull meat off neck; chop neck meat, heart, and gizzard and reserve for gravy, if desired. Pour pan juices into 8-cup measuring cup. Spoon off fat from surface, reserving 1/2 cup fat. Add enough turkey stock to degreased pan juices to measure 5 1/2 cups total.",
        "Place roasting pan over 2 burners on medium heat. Add 1/2 cup reserved fat and shallots; sauté 1 minute. Whisk in flour. Cook until roux is light brown, whisking constantly, about 2 minutes. Whisk in wine, stock mixture, mustard, and fresh rosemary. Bring to boil, whisking to blend. Boil until gravy coats spoon, about 3 minutes. Add neck, heart, and gizzard, if desired. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1/3 cup plus 1 tablespoon coarse kosher salt",
        "1 1/2 teaspoons dried rosemary",
        "1 1/2 teaspoons dried rubbed sage",
        "1 1/2 teaspoons dried thyme",
        "1 teaspoon black peppercorns, crushed",
        "3 small bay leaves, coarsely torn",
        "1 teaspoon finely grated lemon peel",
        "1 14- to 16-pound turkey (neck, heart, and gizzard reserved)",
        "1 large onion, chopped",
        "1 large celery stalk, chopped",
        "1 whole lemon, chopped with peel",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried rubbed sage",
        "1 teaspoon dried thyme",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 cups (or more) Golden Turkey Stock",
        "3 1/2 cups (about) Golden Turkey Stock",
        "2/3 cup chopped shallots",
        "1/2 cup all purpose flour",
        "1/2 cup dry white wine",
        "2 tablespoons Dijon mustard",
        "2 teaspoons chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "turkey",
        "Marinate",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Family Reunion",
        "Chill",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Salted Roast Turkey with Herbs and Shallot-Dijon Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/salted-roast-turkey-with-herbs-and-shallot-dijon-gravy-350432"
}
