{
    "directions": [
        "Place a rack in middle of oven and preheat to 375\u0081°. Place butter in a small saucepan and scrape in vanilla seeds; add pod. Cook over medium heat, stirring often, until butter foams, then browns (be careful not to burn), 5-8 minutes. Remove pan from heat and remove pod.",
        "Roll out dough on a lightly floured surface into a rough 14x10\" rectangle about 1/8\" thick (alternatively, roll out into a 12\" round). Transfer to a parchment-lined baking sheet. Arrange apples on top, overlapping and leaving a 1 1/2\" border. Brush apples with brown butter and sprinkle with muscovado sugar. Lift edges of dough over apples, tucking and overlapping as needed to keep rectangular shape.",
        "Beat egg with 1 teaspoon water in a small bowl and brush crust with egg wash. Sprinkle with granulated sugar and bake, rotating once, until apples are soft and juicy and crust is golden brown, 40-50 minutes. Let cool slightly on baking sheet before slicing.",
        "Beat cream in a medium bowl to medium-soft peaks. Fold in maple syrup and serve alongside galette.",
        "Do ahead: Galette can be baked 2 days ahead. Store tightly wrapped at room temperature. Reheat slightly before serving."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) salted butter",
        "1/2 vanilla bean, split lengthwise",
        "Basic Tart Dough",
        "All-purpose flour (for dusting)",
        "1 pound baking apples (such as Pink Lady; about 2 large), scrubbed, sliced 1/8\" thick",
        "3 tablespoons dark muscovado or dark brown sugar",
        "1 large egg",
        "1 tablespoon granulated sugar",
        "2 cups heavy cream",
        "2 tablespoons pure maple syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Thanksgiving",
        "Kid-Friendly",
        "Apple",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Salted-Butter Apple Galette with Maple Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/salted-butter-apple-galette-with-maple-whipped-cream-51255600"
}
