{
    "directions": [
        "Toast cumin in skillet over medium heat until darker and beginning to smoke, stirring often, about 2 minutes. Cool; grind finely in spice mill or in mortar with pestle. Transfer to bowl. Mix in remaining ingredients. DO AHEAD: Can be made 1 week ahead. Cover; store at room temperature.",
        "Rinse turkey inside and out (do not pat dry). Pull any fat pads from main cavity and neck cavity of turkey; wrap, chill, and reserve fat for roasting. Place turkey in roasting bag; sprinkle inside and out with southwestern-spiced salt. Close bag. Place on baking sheet; refrigerate 18 to 24 hours.",
        "Position rack in bottom third of oven and preheat to 325°F. Mix honey and 1 teaspoon ground chipotle chile in small bowl; reserve for glaze. Rinse turkey inside and out; pat very dry. Stir chopped onion, garlic, and 1 teaspoon ground chipotle chile in medium bowl to blend. Divide mixture between main and neck cavities. Fold neck skin under and secure with skewer. Tuck wing tips under. Tie legs together loosely.",
        "Place turkey on rack set in large roasting pan. Spread butter all over turkey. Place reserved fat pads and reserved neck, heart, and gizzard in roasting pan; pour in 2 cups Golden Turkey Stock.",
        "Roast turkey 45 minutes. Baste with pan juices. Continue to roast until thermometer inserted into thickest part of thigh registers 165°F to 170°F, basting every 45 minutes, adding water to pan by cupfuls if dry, and tenting turkey loosely with foil if browning too quickly, 3 to 3 1/2 hours longer. Brush turkey with glaze twice during last 30 minutes. Transfer turkey to platter; tent very loosely with foil and let rest 30 to 45 minutes. Reserve roasting pan with juices for gravy.",
        "Melt butter in medium skillet over medium-high heat. Add onions; sauté 5 minutes. Reduce heat to medium-low; cook until onions are deep brown, stirring occasionally, about 30 minutes. Set aside.",
        "Remove turkey neck, heart, and gizzard from roasting pan. Pull meat off neck; chop neck meat, heart, and gizzard and reserve for gravy, if desired. Pour pan juices into 8-cup measuring cup. Spoon off fat from surface, reserving 1/2 cup fat. Add enough turkey stock to degreased pan juices to measure 5 1/2 cups total.",
        "Place roasting pan over 2 burners on medium heat. Add 1/2 cup reserved fat and 1/2 cup flour to pan. Whisk until roux is light brown, about 2 minutes. Whisk in stock mixture. Bring to boil, scraping up browned bits and whisking. Boil until gravy coats spoon, stirring occasionally, about 5 minutes. Add chopped neck, heart, and gizzard, if desired. Season with salt and pepper.",
        "Serve turkey with gravy.",
        "Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from tienda.com.",
        "** Available in the spice section of many supermarkets."
    ],
    "ingredients": [
        "1 tablespoon cumin seeds",
        "1/3 cup mild oak-smoked sea salt (such as Halen Mõn)",
        "1 tablespoon smoked paprika*",
        "1 tablespoon dried oregano",
        "1 teaspoon ground chipotle chile powder**",
        "1 14- to 16-pound turkey (neck, heart, and gizzard reserved)",
        "1/4 cup honey",
        "2 teaspoons ground chipotle chile powder,** divided",
        "1 large onion, chopped",
        "12 garlic cloves, chopped",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 cups Golden Turkey Stock",
        "3 tablespoons unsalted butter",
        "1 1/2 pounds onions, chopped",
        "4 cups (about) Golden Turkey Stock",
        "1/2 cup all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "turkey",
        "Marinate",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Family Reunion",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Salted Roast Turkey with Chipotle Glaze and Caramelized-Onion Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/salted-roast-turkey-with-chipotle-glaze-and-caramelized-onion-gravy-350435"
}
