{
    "directions": [
        "Cover cod with 2 inches of cold water in a large bowl and soak, chilled, changing water 3 times a day, up to 3 days (see cooks' note, below).",
        "Drain cod and transfer to a 3-quart saucepan, then add 6 cups water. Bring just to a simmer and remove from heat. (Cod will just begin to flake; do not boil or it will become tough.) Gently transfer cod with a slotted spatula to a paper-towel-lined plate to drain. Cover with a dampened paper towel and chill while making confit.",
        "Cook garlic in oil in a 12-inch heavy skillet over moderately low heat, turning occasionally, until golden, 10 to 15 minutes. Add tomatoes and sugar and cook, stirring frequently, until tomatoes break down into a very thick sauce and oil separates, 45 minutes to 1 hour.",
        "Mash garlic cloves into sauce and add salt and pepper to taste. Spread sauce in a 3-quart gratin dish or other flameproof shallow baking dish and arrange fish over sauce.",
        "Preheat broiler.",
        "Whisk together mayonnaise, crème fraîche, and water and spread over each piece of fish. Broil fish 5 to 6 inches from heat just until mayonnaise mixture is lightly browned, about 2 minutes."
    ],
    "ingredients": [
        "1 pound center-cut skinless boneless salt cod (bacalao), rinsed well and cut into 1 1/2-inch pieces",
        "8 large garlic cloves, peeled",
        "1/3 cup extra-virgin olive oil",
        "4 (14-ounce) cans diced tomatoes, drained",
        "1/4 teaspoon sugar",
        "6 tablespoons mayonnaise",
        "1/4 cup crème fraîche",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Tomato",
        "Appetizer",
        "Side",
        "Broil",
        "Cod",
        "Chill",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Salt Cod in Tomato Garlic Confit",
    "url": "http://www.epicurious.com/recipes/food/views/salt-cod-in-tomato-garlic-confit-231376"
}
