{
    "directions": [
        "Soak cod in a large bowl with cold water to cover by 2 inches, chilled, changing water 3 times a day, 1 to 3 days (see cooks' note, below).",
        "Drain cod and transfer to a 3- to 4-quart pot with fresh water to cover by 2 inches. Bring just to a simmer and remove from heat. (Cod should just flake; do not boil, or it will become tough.) Drain in a colander.",
        "Cook onion in 1/2 tablespoon butter in a 10-inch heavy skillet over moderate heat, stirring occasionally, until pale golden, about 7 minutes. Transfer to a large bowl.",
        "Peel potatoes and parsnip. Halve parsnip lengthwise and remove core if tough. Cut potatoes and parsnip into 1-inch pieces and steam together in a steamer over boiling water in a large pot, covered, until tender, 18 to 20 minutes. 3Add to cooked onions and coarsely mash, then cool slightly. Flake cod and stir into potato mixture along with salt to taste and pepper. Stir in egg until just combined.",
        "Put bread crumbs in a shallow baking dish.",
        "Form rounded 1/4-cup scoops of cod mixture into 12 (3-inch-diameter) cakes and transfer to a sheet of wax paper. Gently dredge fish cakes in bread crumbs to coat and transfer to a wax-paper-lined tray. Chill, covered with plastic wrap, at least 30 minutes.",
        "Preheat oven to 200°F.",
        "Heat 1 tablespoon butter and 1 tablespoon oil in 10-inch heavy skillet over moderate heat until foam subsides. Cook 4 fish cakes, turning over once, until golden brown, 7 to 8 minutes total.",
        "Transfer to a paper-towel-lined baking sheet and keep warm in middle of oven. Wipe skillet clean and cook remaining fish cakes in 2 batches, adding 1 tablespoon each of butter and oil per additional batch."
    ],
    "ingredients": [
        "1 lb skinless boneless salt cod (preferably center-cut)",
        "1 medium onion, finely chopped (1 cup)",
        "3 1/2 tablespoons unsalted butter",
        "1 lb russet (baking) potatoes",
        "1 parsnip (1/4 lb)",
        "1/2 teaspoon black pepper",
        "1 large egg, lightly beaten",
        "1/2 cup plain dry bread crumbs",
        "3 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fish",
        "Potato",
        "Appetizer",
        "Fry",
        "Picnic",
        "Quick & Easy",
        "Cod",
        "Parsnip",
        "Summer",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Salt Cod Fish Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/salt-cod-fish-cakes-108331"
}
