{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Place 6 (6.5 ounce) ramekins in a baking dish.",
        "Place sugar evenly in a heavy-bottomed saucepan over medium heat. Without stirring, allow sugar to slowly melt around the edges of the pan, about 5 minutes, adjusting heat as necessary. When edges start to bubble, shake and swirl pan to dissolve remaining sugar but without stirring it. Keep pan moving until you have a clear, dark caramel, about 10 minutes. When sugar is completely dissolved, whisk in cream; caramel will cool into a lump; this is normal. Keep stirring over medium heat until caramel melts and mixture comes up to temperature and sugar has dissolved. Remove from heat",
        "Stir in kosher salt, vanilla, and cold milk; mix well.",
        "Place egg yolks in a large mixing bowl. Whisk in a ladleful of caramel/milk mixture to the yolks. Add 2 more ladlefuls, one at a time. Then mix in the remainder of the caramel/milk mixture to the yolks, whisking until thoroughly blended.",
        "Divide custard mixture evenly among the ramekins. Carefully pour into the baking dish enough water so that it comes halfway up the sides of the filled ramekins.",
        "Bake in preheated oven until custard is set and the top of custard jiggles evenly across the surface, 45 to 60 minutes (depending on the size of your ramekins and how full they are). If the center seems looser than the edges, continue to bake another minute or so.",
        "Transfer ramekins to a cooling rack; cool to room temperature. Cover ramekins with plastic wrap and refrigerate at least 1 hour until they are very cold.",
        "Serve topped with a pinch of light, flaky sea salt."
    ],
    "ingredients": [
        "9 large egg yolks",
        "2/3 cup white sugar",
        "2 cups heavy cream",
        "1/2 teaspoon kosher salt",
        "2 teaspoons vanilla extract",
        "1 cup whole milk",
        "Flaky sea salt (such as Maldon®), to garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salted Caramel Custard",
    "url": "http://allrecipes.com/recipe/245943/salted-caramel-custard/"
}
