{
    "directions": [
        "Place racks in the center and upper third of the oven and line two baking sheets with Reynolds Wrap® Aluminum Foil. Set aside. In a medium bowl, whisk together flour, baking soda and salt.",
        "In a stand mixer fitted with a paddle attachment, beat together butter and sugars until light and fluffy, about 3-5 minutes. Scrape down the sides of the bowl. Add the egg and egg yolk and beat on medium speed until mixture is fluffy, about 1-2 minutes. Beat in the vanilla and soy sauce. Add the dry ingredients, all at once, to the butter mixture. Beat on low speed until just combined. Add 2 tablespoons sesame seeds and chocolate chunks and fold together with a spatula until well combined.",
        "Lay a piece of foil on work surface. Spoon the dough onto the foil, wrap well and refrigerate for at least 1 hour.",
        "Preheat the oven to 350 degrees F. Place 1/4 cup black sesame seeds in a small bowl.",
        "Scoop cookie dough by the heaping tablespoonful. Roll into a ball and coat with black sesame seeds. Place on foil-lined baking sheets. Add a few flakes of coarse sea salt on the tops of the cookies. Bake for about 12 minutes, until lightly browned around the edges. Remove from the oven and allow to cool on the baking sheet for about 10 minutes. Transfer to a wire rack and cool completely. Store cookies in an airtight container. Cookies will keep for a day or two -- so eat quickly!"
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1 cup unsalted butter, softened",
        "3/4 cup packed brown sugar",
        "3/4 cup granulated sugar",
        "1 large egg",
        "1 large egg yolk",
        "1 teaspoon pure vanilla extract",
        "3/4 teaspoon soy sauce, or more to taste",
        "2 tablespoons black sesame seeds",
        "1 cup dark chocolate chips",
        "1/4 cup black sesame seeds",
        "Coarse sea salt",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salty Sesame Dark Chocolate Cookies",
    "url": "http://allrecipes.com/recipe/245243/salty-sesame-dark-chocolate-cookies/"
}
