{
    "directions": [
        "Stir flour, coarse salt, 1/4 cup minced herbs and black pepper in large bowl to blend. Beat egg whites in medium bowl just until foamy. Gradually pour 1/2 cup plus 2 tablespoons water, then egg whites into flour mixture. Using wooden spoon, stir until mixture begins to clump together. Knead in bowl, adding more water by tablespoonfuls until firm moist dough forms. Turn dough out onto floured surface. Knead until smooth, about 4 minutes. Form into ball. Cover dough with plastic; let rest at least 4 hours and up to 24 hours at room temperature.",
        "Preheat oven to 400°F. Heat oil in heavy large skillet over medium-high heat. Add beef to skillet; brown on all sides, about 5 minutes. Transfer to plate.",
        "Roll out dough on floured surface to 13 x 10-inch rectangle. Place beef in center of dough. Sprinkle 1/4 cup minced herbs all over beef. Wrap dough tightly around beef; pinch edges firmly to seal. Place seam side up on baking sheet.",
        "Roast until thermometer inserted through dough into center of beef registers 120°F for rare, about 25 minutes. Remove from oven; let beef stand at least 30 minutes and up to 1 hour (beef will continue cooking, becoming medium-rare after about 30 minutes). Cut crust to open. Remove beef and cut into thick slices. Arrange on platter. Sprinkle lightly with fleur de sel."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1 1/2 cups coarse salt",
        "1/2 cup minced assorted fresh herbs (such as rosemary, oregano, thyme and Italian parsley)",
        "2 tablespoons ground black pepper",
        "2 large egg whites",
        "1/2 cup plus 4 tablespoons water",
        "2 tablespoons olive oil",
        "1 1 1/2-pound (thick-end) piece beef tenderloin, trimmed",
        "Fleur de sel or other salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Roast",
        "Winter",
        "Pastry"
    ],
    "title": "Salt-Encrusted Beef Tenderloin",
    "url": "http://www.epicurious.com/recipes/food/views/salt-encrusted-beef-tenderloin-5137"
}
