{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Pour the containers of Diamond Crystal(R) Kosher Salt into a large mixing bowl.  Add egg whites. Mix well with your hands or by blending with two spoons until the texture resembles moist sand.",
        "Layer half of the prepared salt on the bottom of a glass 9x13-inch baking dish; pat down firmly.  Salt should be about 1/2-inch thick.",
        "Place the lemon slices edge to edge on top of the salt.  You don't want the fish to actually touch the salt or it will absorb too much; the lemon slices will serve as a barrier and a flavor infuser.  Save extra lemon slices for serving and garnish.",
        "Rub the fish fillets with olive oil on both sides, and season well with Diamond Crystal(R) Kosher Salt and pepper.",
        "Arrange the fish fillets on top of the lemon slices, making sure no edges touch the salt base.",
        "Arrange the dill on top so that it covers the fish completely, reserving a few sprigs to chop for garnish.  Again, this will serve as a barrier against the salt crust since there is no skin to protect it from absorbing too much salt during baking, as well as give it a bold, tangy flavor.",
        "Pour the rest of the salt mixture evenly onto the dill, smoothing carefully. Make sure all corners are covered; pat firmly to ensure a proper seal with no cracks.",
        "Place in middle rack of oven and bake for 15 minutes.",
        "Let fish rest for 5 minutes, then crack sides of salt crust with a strong knife before prying open.",
        "Cut each fillet in half. Serve with remaining lemon slices and fresh, chopped dill."
    ],
    "ingredients": [
        "4 (13 ounce) round containers Diamond Crystal® Kosher Salt",
        "4 egg whites, lightly beaten",
        "2 lemons, sliced 1/4-inch thick",
        "2 1/2 pounds skinless cod fillets",
        "1 tablespoon olive oil",
        "1/2 teaspoon Diamond Crystal® Kosher Salt",
        "1/4 teaspoon black pepper",
        "2 bunches fresh dill"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salt-Crusted Lemon-Dill Cod Fillets",
    "url": "http://allrecipes.com/recipe/239415/salt-crusted-lemon-dill-cod-fillets/"
}
