{
    "directions": [
        "In a large bowl cover salt cod with cold water by 2 inches. Chill cod, changing water several times, at least 1 day and up to 2.",
        "In a colander drain salt cod and in a saucepan simmer in water to cover by 1 inch until cod just flakes, about 3 minutes. Drain cod in colander and cool. Flake cod.",
        "Peel potatoes and cut into 1 1/2-inch cubes. In a saucepan simmer potatoes in salted water to cover by 1 inch until tender, about 15 minutes. Drain potatoes in colander and force through a ricer or food mill fitted with medium disk into a bowl. In a small bowl whisk together egg and milk and add to potatoes, stirring until combined well.",
        "In a 9-inch skillet cook fennel bulb, fennel seeds, and salt to taste in oil over moderate heat, stirring, until fennel is pale golden. Cover skillet and cook fennel mixture, stirring occasionally, until tender, about 5 minutes more. Add cod and sauté over moderately high heat, stirring, 2 minutes. Add 1/4 cup water and deglaze skillet, scraping up brown bits.",
        "Stir cod mixture and reserved fennel fronds into potato mixture until combined well and season with salt and pepper. Filling may be made 1 day ahead and chilled, covered.",
        "In a large flat-bottomed dish soak lasagne sheets in very hot water to cover until soft and pliable, about 15 minutes.",
        "Remove 1 lasagne sheet from water and halve crosswise to form 2 squares. Spread a scant 1/4 cup filling lengthwise along 1 edge of each square and roll each square to enclose filling, leaving ends open. Arrange both cannelloni, seam sides down, in a buttered 3-quart gratin dish, 15 by 10 by 2 inches, or other shallow baking dish. make 18 more cannelloni with remaining 9 lasagne sheets (halved crosswise) and filling in same manner.",
        "Preheat oven to 400°F.",
        "In a small heavy saucepan bring milk just to a simmer over moderately low heat. Remove pan from heat and keep warm, covered. In a heavy saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking, 3 minutes and whisk in warm milk. Bring sauce to a boil, whisking, and simmer, whisking, 3 minutes. Season sauce with salt and pepper and pour evenly over cannelloni. Cannelloni may be prepared up to this point 1 day ahead and chilled, covered.",
        "Bake cannelloni in upper third of oven 30 minutes, or until bubbling and lightly browned."
    ],
    "ingredients": [
        "1/2 pound skinless boneless salt cod (preferably center cut), rinsed well and cut into 1-inch pieces",
        "1 pound large red potatoes",
        "1 large egg",
        "1/4 cup milk",
        "1 fennel bulb (sometimes called anise), stalks trimmed flush with bulb, reserving any fennel fronds for use, and bulb cut into 1/4-inch dice",
        "1 teaspoon fennel seeds, ground fine in an electric coffee/spice grinder",
        "3 tablespoons olive oil",
        "1/4 cup water",
        "1/4 cup chopped reserved fennel fronds if desired",
        "ten 7- by 3 1/2-inch sheets dried no-boil lasagne",
        "3 cups milk",
        "1/2 stick (1/4 cup) unsalted butter",
        "4 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Pasta",
        "Potato",
        "Bake",
        "Cod",
        "Fennel",
        "Winter",
        "Gourmet"
    ],
    "title": "Salt Cod, Fennel, and Potato Cannelloni",
    "url": "http://www.epicurious.com/recipes/food/views/salt-cod-fennel-and-potato-cannelloni-13620"
}
