{
    "directions": [
        "To Make Starter: Heat the milk, and stir in 1 tablespoon of the sugar, the cornmeal and 1 teaspoon of the salt. Place this in a jar in an electric skillet or crock pot with hot water in it. Maintain the temperature around 105 to 115 degrees F (40 to 47 degrees C) for 7-12 hours or until it shows fermentation. You can hear the gas escaping when it has fermented sufficiently. The bubble foam, which forms over the starter, can take as long as 24 hours. Do not go on with the bread-making until the starter responds. As the starter ferments, the unusual salt-rising smell appears.",
        "When the starter is bubbly, it is time to make the sponge. Place the starter mixture in a medium-size bowl. Stir in 2 cups of the warm water, 2 tablespoons of the sugar, the shortening and 2 cups of the all-purpose flour. Beat the sponge thoroughly. Put bowl back in the water to maintain an even 105 to 115 degrees F (40 to 47 degrees C) temperature. Cover, and let rise until light and full of bubbles. This will take 2 1/2 to 3 hours.",
        "Dissolve the baking soda in 1 tablespoon of the warm water and combine it with the sponge. Stir 5 1/4 cups of the flour into the sponge; knead in more flour as necessary. Knead the dough for 10 minutes or until smooth and manageable. Cut dough into 3 parts. Shape dough and place it in three greased 9x5x3 inch pans. Place covered pans in warm water or uncovered pans in a warm oven with a bowl of hot water, maintaining a temperature of 85 degrees F (30 degrees C). It will take approximately 5 hours for the bread to rise 2 1/2 times the original size. The bread will round to the top of the pans.",
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Bake bread at 375 degrees F (190 degrees C) for 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and bake for an additional 20 minutes or until light golden brown. YOU CAN DRY SALT RISING CULTURE!!! Save 1/4 cup of a successful sponge and pour it  into a saucer, cover with cheesecloth and allow to dry. Store dried flakes in plastic in a cool, dry place or freeze until needed for salt rising bread. When ready to make the bread; dissolve the flakes in the new warm starter and continue with recipe. This will give a flavor boost to your bread."
    ],
    "ingredients": [
        "1 cup milk",
        "1/2 cup cornmeal",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "2 cups warm water (110 degrees F/45 degrees C)",
        "2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "3 tablespoons shortening",
        "1/2 teaspoon baking soda",
        "1 tablespoon warm water (110 degrees F/45 degrees C)",
        "6 cups all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salt Rising Bread",
    "url": "http://allrecipes.com/recipe/7061/salt-rising-bread/"
}
