{
    "directions": [
        "Melt butter in a 1- to 2-quart heavy saucepan over medium-low heat, then cook over low heat, swirling pan occasionally, until butter has a nutty aroma and is a rich brown color, and bottom of pan is speckled with browned bits of the milk solids, 8 to 10 minutes. Transfer to a bowl, including browned milk solids on bottom, and chill until almost firm, about 30 minutes.",
        "Whisk together flour and cornstarch in a bowl. Beat together butter and sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, then beat in egg, salt, and vanilla. Add flour mixture and mix on low speed until just combined well.",
        "Form dough into 2 balls and flatten each into a 6-inch disk. Chill disks, wrapped in plastic wrap, until firmer, but not hard, 15 to 30 minutes.",
        "Heat oven to 350°F with rack in middle position. Line a large baking sheet with parchment paper.",
        "Roll out 1 disk of dough (keep remaining dough chilled) between 2 large sheets of wax paper 1/8 inch thick (this is when the rolling pin rings are really helpful). Freeze or chill dough on a baking sheet or tray until firm, 5 to 15 minutes, then cut out as many cookies as possible from dough. Transfer cookies to lined baking sheet, arranging cookies about 1 inch apart. If the cookies become too warm to transfer, freeze or chill until firm (see Cooks' notes).",
        "Bake cookies, 1 sheet at a time, until edges are golden, 8 to 10 minutes, then transfer to racks to cool completely.",
        "Meanwhile, gather scraps of dough and repeat cookie process above. Parchment can be reused, but make sure baking sheet cools between batches. Make more cookies with remaining dough.",
        "Beat together all ingredients in a large bowl with an electric mixer at medium speed until just combined, about 1 minute.",
        "Increase speed to high and continue to beat until icing holds stiff peaks, about 3 minutes in a stand mixer or 10 minutes with a handheld. If not using icing immediately, cover surface with a dampened paper towel, then cover bowl with plastic wrap.",
        "Transfer icing to a heavy-duty resealable bag and press out excess air. Snip a 1/8-inch opening in bottom corner of bag, then twist bag firmly just above icing and decoratively pipe icing onto cookies. If desired, sprinkle with sanding sugars or colorful sea salts while icing is still wet. (For tinted icing, see Cooks' notes.)",
        "Let icing dry completely (about 1 hour) before storing cookies."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into pieces",
        "2 cups all-purpose flour",
        "1/4 cup cornstarch",
        "3/4 cup packed light brown sugar",
        "1 large egg",
        "3/4 teaspoon fine sea salt",
        "1 teaspoon vanilla",
        "1 (1-pound) box confectioners' sugar",
        "4 teaspoons powdered egg whites (not reconstituted), such as Just Whites, or meringue powder (see Cooks' notes)",
        "1/3 cup water",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon vanilla",
        "Decorative sugars and or salts, if desired",
        "Special equipment: Wax paper and parchment paper; rolling pin rings (optional, but really helpful; see Cooks' notes:); 3- to 4-inch holiday cookie cutters; several small, heavy-duty sealable plastic bags (not pleated), if icing cookies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Bake",
        "Christmas",
        "Edible Gift",
        "Christmas Eve",
        "Butter",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Salted Brown Butter Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/salted-brown-butter-cookies-51142250"
}
