{
    "directions": [
        "Bring 6 quarts water to a boil in a large pot; season with salt. The water should taste like ocean water, so keep adding salt until it tastes very, very saline (you should use around 1/4 cup).",
        "Meanwhile, heat 1/4 cup oil in a large skillet over medium. Add shallots, garlic, and 1/2 tsp. red pepper flakes; season lightly with salt. Cook, stirring occasionally, until shallots are translucent, about 4 minutes. Remove from heat and set aside.",
        "Remove florets from broccolini and cut into bite-size pieces. Slice stems into 1/2\" pieces. Add to boiling water. Cook 1 minute, then, using a spider or slotted spoon, transfer to reserved skillet.",
        "Return water in pot to a boil and cook tubetti, stirring occasionally, until very al dente, 7–9 minutes. Drain, reserving 3/4 cup pasta cooking liquid. Add pasta and pasta cooking liquid to skillet, tossing to combine. Cook over medium-high heat, gradually adding 1 1/2 oz. Parmesan and tossing often, until pasta is al dente and liquid has reduced to form a thick, glossy sauce, about 4 minutes. Taste and season with more salt if needed.",
        "To serve, squeeze lemon wedges over pasta, drizzle with oil, and top with more grated Parmesan and red pepper flakes."
    ],
    "ingredients": [
        "Kosher salt",
        "1/4 cup olive oil, plus more for serving",
        "3 large shallots, chopped",
        "5 garlic cloves, finely chopped",
        "1/2 teaspoon crushed red pepper flakes, plus more for serving",
        "2 small bunches of broccolini",
        "12 ounces tubetti or other short tube pasta",
        "1 1/2 ounces Parmesan, finely grated, plus more for serving",
        "Lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Pasta",
        "Broccoli",
        "Parmesan",
        "Lemon Juice",
        "Kidney Friendly",
        "Garlic",
        "Kid-Friendly",
        "Vegetarian",
        "Quick & Easy"
    ],
    "title": "Salt-As-You-Go Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/salt-as-you-go-pasta"
}
