{
    "directions": [
        "Mix sage and parsley in small bowl. In a separate medium bowl, mix flour, Diamond Crystal(R) Kosher Salt, pepper and 2 tablespoons of the sage and parsley mixture. Cover and refrigerate remaining sage and parsley.",
        "Whisk egg whites and water in separate bowl until well blended; stir into flour mixture (sprinkle with additional water if dough is too stiff to knead). Knead on lightly floured surface for 2 to 3 minutes. Place in bowl or plastic food storage bag; cover and let stand at room temperature for 4 (or up to 24) hours.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat nonstick griddle or large skillet over high heat; brush beef with olive oil. Place beef on griddle and brown evenly on all sides. Remove from heat and let stand 10 minutes.",
        "Meanwhile, roll dough out to 1/4-inch thick rectangle (at least 2 inches longer than beef tenderloin) on parchment paper or plastic wrap**. Cover loosely and set aside.",
        "Sprinkle remaining herbs over tenderloin, pressing lightly. Place beef in center of dough. Bring sides of dough together to encase beef; crimp to seal. Fold and crimp ends to enclose beef. Carefully place on large baking sheet. Roast about 25 to 35 minutes or until internal temperature of beef reaches 135 to 145 degrees F, depending on desired doneness (temperature will rise as roast stands). Remove from oven and let stand 10 to 15 minutes.",
        "Cut and remove the salt crust; discard crust. Slice beef and serve immediately."
    ],
    "ingredients": [
        "1/4 cup chopped fresh sage, divided",
        "1/4 cup chopped fresh parsley, divided",
        "2 1/2 cups all-purpose flour",
        "1 1/4 cups Diamond Crystal® Kosher Salt",
        "4 teaspoons coarsely ground black pepper",
        "3 egg whites",
        "3/4 cup water",
        "1 (2.5 pound) well-trimmed beef tenderloin*",
        "1 tablespoon extra virgin olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salt Encrusted Beef Tenderloin",
    "url": "http://allrecipes.com/recipe/239039/salt-encrusted-beef-tenderloin/"
}
