{
    "directions": [
        "Coarsely grind first 5 ingredients in spice mill; transfer to small bowl. Place cinnamon stick in spice mill and grind coarsely; add to bowl. Mix in coarse salt. DO AHEAD: Can be made 1 week ahead. Cover and store at room temperature. Stir orange peel into Asian-spiced salt before using.",
        "Rinse turkey inside and out (do not pat dry). Pull any fat pads from main cavity and neck cavity of turkey; wrap, chill, and reserve for roasting. Place turkey in roasting bag; sprinkle inside and out with Asian-spiced salt. Close bag. Place on baking sheet; refrigerate 18 to 24 hours.",
        "Mix green onions and next 4 ingredients in medium bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Set rack at lowest position in oven and preheat to 325°F. Mix soy sauce and molasses in small bowl; reserve for glaze. Rinse turkey inside and out; pat very dry. Divide chopped green onion mixture between main and neck cavities. Fold neck skin under and secure with skewer. Tuck wing tips under. Tie legs together loosely. Place turkey on rack set in large roasting pan. Spread butter all over turkey. Place reserved fat pads and reserved neck, heart, and gizzard in roasting pan; pour in 2 cups Golden Turkey Stock.",
        "Roast turkey 45 minutes. Baste with pan juices. Continue to roast until thermometer inserted into thickest part of thigh registers 165°F to 170°F, basting every 45 minutes, adding stock or water to pan by cupfuls if dry, and tenting turkey loosely with foil if browning too quickly, 3 to 31/2 hours longer. Brush turkey with soy sauce glaze twice during last 30 minutes. Transfer turkey to platter; tent very loosely with foil and let rest 30 to 45 minutes. Reserve roasting pan with juices for gravy.",
        "Remove turkey neck, heart, and gizzard from roasting pan. Pull meat off neck; chop neck meat, heart, and gizzard and reserve for gravy, if desired. Pour pan juices into 8-cup measuring cup. Spoon off fat from surface, reserving 1/2 cup fat. Add enough turkey stock to degreased pan juices to measure 5 1/4 cups total.",
        "Place reserved roasting pan over 2 burners on medium heat; add 1/2 cup reserved turkey fat and 1/2 cup flour. Whisk until roux is light brown, about 2 minutes. Whisk in Sherry, then stock mixture. Bring to boil, scraping up browned bits and whisking to blend. Boil until gravy is thick enough to coat spoon, about 8 minutes. Add chopped neck, heart, and gizzard, if desired. Whisk in 1 tablespoon soy sauce; season with salt and pepper.",
        "Serve turkey with gravy.",
        "A brown star-shaped seedpod; available in the spice section of some supermarkets and at specialty foods stores and Asian markets.",
        "** Sometimes called wild pepper or sansho peppercorns; available at some specialty foods stores and at Asian markets."
    ],
    "ingredients": [
        "2 whole star anise*",
        "2 teaspoons Szechuan peppercorns**",
        "1 teaspoon whole cloves",
        "1 teaspoon coriander seeds",
        "1 teaspoon fennel seeds",
        "1 cinnamon stick, broken into 3 pieces",
        "1/3 cup plus 1 tablespoon coarse kosher salt",
        "1 large orange, peel removed in long strips with vegetable peeler and finely chopped (about 2 tablespoons); orange reserved for another use",
        "1 14- to 16-pound turkey (neck, heart, and gizzard reserved)",
        "5 large green onions, chopped",
        "1 whole large orange, coarsely chopped with peel",
        "1/4 cup finely chopped peeled fresh ginger",
        "2 whole star anise*",
        "1 cinnamon stick, broken into 3 pieces",
        "2 tablespoons soy sauce",
        "2 tablespoons mild-flavored (light) molasses",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 cups (or more) Golden Turkey Stock",
        "3 2/3 cups (about) Golden Turkey Stock",
        "1/2 cup all purpose flour",
        "1/3 cup dry Sherry",
        "1 tablespoon soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Marinate",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Orange",
        "Spice",
        "Sherry",
        "Fall",
        "Cinnamon",
        "Soy Sauce"
    ],
    "title": "Salted Roast Turkey with Orange, Fall Spices, and Sherry Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/salted-roast-turkey-with-orange-fall-spices-and-sherry-gravy-350434"
}
