{
    "directions": [
        "Blend flour and 1 teaspoon Diamond Crystal(R) Fine Sea Salt in mixing bowl. Cut shortening into flour mixture using a pastry blender until it resembles pea-sized crumbs. Sprinkle ice water over the top, 1 tablespoon at a time. Mix gently with a fork after each addition until dough holds together. Divide the dough into 2 pieces; one a little larger than the other. Flatten into round disks, wrap in plastic film, and refrigerate for at least 30 minutes.",
        "Put apple slices in a large bowl and sprinkle with lemon extract. Combine sugar, flour, cinnamon, nutmeg, allspice, ginger, Diamond Crystal(R) Fine Sea Salt in a small bowl. Sprinkle sugar mixture over apples and mix to distribute evenly.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Lightly flour flat rolling surface. Roll out the larger disk until it is 2 inches bigger than the pie plate. Carefully place crust into bottom of pie plate, and press evenly into bottom and sides. Pierce the botton with a fork several times. Fill bottom crust with filling and dot with butter pats.",
        "Roll out top crust and carefully place over top. Fold bottom crust edge over top and flute. Cut 2 to 4 slits in top. Cover edges of crust with aluminum foil.",
        "Bake for 50 minutes. Remove foil for the last 15 minutes. Cool on rack. Serve warm, if desired.",
        "Make topping just before serving. Place caramels in a microwave-safe bowl. Add 1 tablespoon of water. Heat for 1 minute at a time on high stirring after each time until caramels are creamy, but no more than 3 minutes. Add additional water, if needed, to get desired consistency.",
        "Top slices of pie with your favorite vanilla ice cream. Drizzle caramel sauce over ice cream and pie. Then sprinkle a pinch of Diamond Crystal(R) Coarse Sea Salt over the caramel sauce."
    ],
    "ingredients": [
        "Crust:",
        "1 3/4 cups all-purpose flour, or more as needed",
        "3/4 cup shortening, chilled and cubed",
        "1 teaspoon Diamond Crystal® Fine Sea Salt",
        "6 tablespoons ice-cold water, or more as needed",
        "Filling:",
        "2/3 cup granulated sugar",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1/8 teaspoon ground ginger",
        "1/8 teaspoon Diamond Crystal® Fine Sea Salt",
        "8 Red Delicious apples, peeled and thinly sliced",
        "1/2 teaspoon lemon extract",
        "2 tablespoons butter, cut in small pieces",
        "Topping:",
        "1 (11 ounce) package caramels, unwrapped",
        "1 tablespoon water, or more as needed",
        "Vanilla ice cream",
        "Diamond Crystal® Coarse Sea Salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salted Caramel Apple Pie a la Mode",
    "url": "http://allrecipes.com/recipe/239418/salted-caramel-apple-pie-a-la-mode/"
}
