{
    "directions": [
        "To make the tomato sauce, in a large saucepan over medium heat, warm the olive oil. Add the onion, garlic and pizza seasoning and cook, stirring frequently, until the onion is tender, 5 to 6 minutes. Stir in the tomatoes and bring to a simmer. Reduce the heat to medium-low and cook, stirring occasionally, until the sauce is thickened, about 30 minutes. Let cool to room temperature before using. This recipe makes about 2 3/4 cups sauce; you will need 1/2 cup sauce for the pizza. Refrigerate the rest for another use.",
        "Place a pizza stone in an oven and preheat the oven to 450ºF.",
        "In a small sauté pan over medium-high heat, warm the oil. Add the onion, salt and pepper and cook, stirring occasionally, until soft and caramelized, about 6 minutes. Transfer the onion to a paper towel-lined plate.",
        "On a floured surface, roll out the pizza dough into a 12-inch round. Transfer to a floured pizza peel. Spread 1/2 cup tomato sauce evenly over the dough, leaving a 1-inch border. Top with the cheese, then with the onion and salumi.",
        "Carefully slide the pizza onto the preheated pizza stone. Bake until the cheese is bubbly and the crust is crisp, 12 to 15 minutes. Using the pizza peel, transfer the pizza to a cutting board and garnish with the cilantro leaves. Cut into slices and serve immediately. Makes one 12-inch pizza.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "1/2 yellow onion, diced",
        "2 large garlic cloves, minced",
        "1 1/2 tsp. pizza seasoning",
        "2 cans (each 14 1/2 oz.) diced tomatoes, drained and pureed in a food processor",
        "1 Tbs. vegetable oil",
        "1/2 small red onion, thinly sliced",
        "Kosher salt and freshly ground pepper, to taste",
        "All-purpose flour for dusting",
        "1/2 batch food-processor Food Processor Pizza Dough",
        "3 oz. mozzarella cheese, grated",
        "1 oz. thinly sliced salumi",
        "1 Tbs. fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Salumi, Red Onion and Cilantro Pizza",
    "url": "http://www.williams-sonoma.com/recipe/salumi-red-onion-and-cilantro-pizza.html"
}
