{
    "directions": [
        "To make the pizza dough, in the bowl of an electric mixer fitted with the dough hook, combine the yeast, sugar and warm water and let stand for 5 minutes. Add the flour and salt and start the mixer on low speed. Slowly drizzle in the olive oil and knead the dough for 5 minutes. The dough should come together into a large ball and pull away from the sides of the bowl; it should be moist but not sticky.",
        "Stop the mixer, remove the dough hook and cover the bowl with plastic wrap. Let stand at room temperature until the dough is doubled in size, about 1 hour.",
        "Transfer the dough to a lightly floured work surface. Divide the dough into 3 equal pieces and roll each into a ball. Set on a flour-dusted baking sheet and cover tightly with plastic wrap. Let stand at room temperature for 30 to 45 minutes.",
        "Place a granite pizza stone in a cold oven and preheat to 450°F. Place a ball of dough on a floured work surface. Roll out the dough into a 9-by-14-inch rectangle and transfer to a floured pizza peel.",
        "Spread 1/2 cup of the crushed tomatoes evenly over the dough, leaving a 1/2-inch border. Top evenly with one-third",
        "each",
        "of the mozzarella and salumi. Carefully slide the pizza onto the preheated pizza stone. Bake until the crust is browned and the cheese is melted, 15 to 18 minutes. Using the pizza peel, transfer the pizza to a cutting board and sprinkle with 1 1/2 Tbs. of the basil. Cut into slices and serve immediately. Repeat with the remaining dough and toppings to make 2 more pizzas. Makes 3 pizzas; serves 12.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "4 tsp. active dry yeast",
        "2 tsp. sugar",
        "2 cups warm water",
        "4 1/2 cups bread flour",
        "4 tsp. salt",
        "2 Tbs. olive oil",
        "1 1/2 cups crushed canned tomatoes",
        "6 cups shredded mozzarella cheese",
        "9 oz. thinly sliced salumi",
        "4 1/2 Tbs. thinly sliced fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Salumi and Cheese Pizza",
    "url": "http://www.williams-sonoma.com/recipe/salumi-and-cheese-pizza.html"
}
