{
    "directions": [
        "Place an oven rack in the topmost position and preheat oven on the broil setting. Line a baking sheet with aluminum foil.",
        "Place tomatoes and bell pepper onto the baking sheet, cut-side down. Broil on top rack of preheated oven until the skins begin to blacken, about 5 minutes. Place charred vegetables into a bowl and seal with plastic wrap to steam until their skins loosen. Lower oven rack to accommodate a roasting pan, and turn oven to 325 degrees F (165 degrees C).",
        "Meanwhile, pour vegetable oil into a roasting pan (or skillet large enough to fit the turkey), and place over medium-high heat. When hot, add the turkey and sear on all sides until browned, about 10 minutes. Once the turkey has been browned, place breast side up into the roasting pan, and stuff with quartered apples and olives. Set aside.",
        "Heat a skillet over medium-high heat. Add the ancho chiles, pumpkin seeds, and bay leaves. Cook and stir until the pumpkin seeds begin to smell toasted, about 5 minutes, then pour the mixture into a blender.",
        "Once the tomatoes and peppers have steamed enough that the skins have loosened, remove and discard the skins. Place tomatoes, green peppers, and onion into the blender with the pumpkin seeds. Blend until you have a thick, smooth sauce. Season with salt and pepper to taste, adding a little liquid from the olives if desired.",
        "Brush the sauce onto the turkey, and place into preheated oven. Cook until a meat thermometer inserted in the meaty part of the thigh reads 180 degrees F (80 degrees C), about 3 hours, basting occasionally."
    ],
    "ingredients": [
        "10 large Roma (plum) tomatoes, halved and seeded",
        "1 large green bell pepper, halved and seeded",
        "2 tablespoons vegetable oil",
        "1 (10 pound) whole turkey, neck and giblets removed",
        "1 Granny Smith apple - peeled, quartered, and cored",
        "1 (5 ounce) jar pitted green olives, drained",
        "2 dried ancho chiles, stemmed and seeded",
        "1/2 cup raw pumpkin seeds",
        "2 bay leaves",
        "1 onion, cut into chunks",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Salvadorian Roasted Turkey",
    "url": "http://allrecipes.com/recipe/139633/salvadorian-roasted-turkey/"
}
