{
    "directions": [
        "1. To make the meatballs, place the crabmeat in a mixing bowl and shred with a fork. Add the eggs, milk, dry mustard, pepper, and cracker crumbs. Mix well. Season with salt and hot sauce to taste. Moisten your hands and roll the mixture into balls that are about 3/4- to 1-inch in diameter (about 1/2 ounce each); keep your hands slightly wet so the balls are very smooth. Place on a cookie sheet. You should have about 36 balls. Cover and refrigerate while you prepare the chowder.",
        "2. To cook the crabs, fill a 6- to 8-quart pot with 1/2-inch ocean water or tap water with enough salt added to make it very salty. Bring to a boil, place the crab(s) top shell (carapace) down in the pot, cover, and steam for about 12 minutes for smaller crabs, about 20 minutes for a Dungeness crab. Remove and allow to cool at room temperature.",
        "3. When cool enough to handle, remove the crab legs, break into sections, and neatly crack the large pieces. Pick the meat from the small pieces and reserve. Remove the apron (tail flap) from the bottom of each crab and discard. Remove the top shell, scoop the green stuff (tomalley) out of it, and reserve; discard the shell. Remove the gills from the body and discard. Cut the body into quarters and trim away any extraneous shell or cartilage. Refrigerate all the crabmeat, crab pieces, and tomalley until ready to use.",
        "4. Heat a 4- to 6-quart heavy pot over low heat and add the bacon. Once it has rendered a few tablespoons of fat, increase the heat to medium and cook until the bacon is a crisp golden brown. Pour off all but 1 tablespoon of the fat, leaving the bacon in the pot.",
        "5. Add the garlic and cook for 30 seconds. Add the butter, onion, bell pepper, bay leaves, and the Old Bay Seasoning and cook, stirring occasionally with a wooden spoon, for about 10 minutes, until the onion and pepper are softened but not browned.",
        "6. Add the potatoes and crab stock, turn up the heat, and bring to a boil. Cover the pot and cook the potatoes vigorously for about 10 minutes, until they are soft on the outside but still firm in the center. If the broth hasn’t thickened lightly, smash a few potatoes against the side of the pot and cook a minute or two longer to release their starch.",
        "7. Lower the heat to medium, add the tomatoes, and bring back to a simmer. Season with salt and pepper. Remove the pot from the heat and stir in the cracked crab legs, picked leg meat, tomalley, and body sections. If you are not serving the chowder within the hour, let it cool a bit, then refrigerate; cover the chowder after it has chilled completely. Otherwise, let it sit at room temperature for up to an hour, allowing the flavors to meld.",
        "8. When ready to serve, reheat the chowder over low heat. While it is reheating, place an 8- or 9-inch skillet or sauté pan over medium-high heat, add about 1/2 inch vegetable oil, and heat to about 350°F. Carefully but quickly add 8 to 10 meatballs to the hot oil and pan-fry, turning them as needed, until they are a rich brown color on all sides, so they resemble real meatballs. Using a slotted spoon, remove the meatballs, letting the excess oil drain back into the pan, then place on paper towels to drain. Repeat with the remaining meatballs.",
        "9. Ladle the chowder into shallow bowls or large soup plates, making sure that the crab, onions, peppers, tomatoes, and potatoes are evenly divided. Place 4 meatballs in each bowl and sprinkle generously with the chopped parsley. Serve the remaining meatballs on a plate or platter; your guests can add more, if desired.",
        "In addition to the crab meatballs, the chowder contains two whole crabs. Steaming and cracking the crabs is a bit of work, but they add great flavor. If you use the full amount of crab stock called for in the recipe, you can omit the crabs and still have a great chowder, but do not omit them if you make the chowder with fish or chicken stock. Without any crab flavor in the chowder, the meatballs dont connect. Even with crab stock, I recommend the cracked crabs; they add character and rustic charm.",
        "For equipment, you will need a 6- to 8-quart pot with a tight-fitting lid (for steaming the crabs), a 4- to 6-quart heavy pot with a lid (for making the chowder), a wooden spoon, and an 8- to 9-inch skillet or sauté pan, a slotted spoon, and a ladle."
    ],
    "ingredients": [
        "1 pound crabmeat, picked over for shells and cartilage",
        "2 large eggs, lightly beaten",
        "1/4 cup milk",
        "1 heaping teaspoon Coleman’s dry English mustard",
        "1/4 teaspoon freshly ground black pepper",
        "4 ounces oyster crackers, Pilot crackers, or other similar crackers, finely ground (about 1 cup)",
        "Kosher or sea salt",
        "Tabasco or other hot sauce",
        "About 1 cup vegetable oil, for cooking the meatballs",
        "2 medium blue or rock crabs (12 ounces each) or 1 Dungeness crab (1 1/2 to 2 pounds)",
        "4 ounces slab (unsliced) bacon, rind removed and cut into 1/3-inch dice",
        "3 cloves garlic, finely chopped (1 tablespoon)",
        "2 tablespoons unsalted butter",
        "1 medium onion (8 ounces), cut into 3/4-inch dice",
        "1 medium green bell pepper (4 to 6 ounces), cut into 1/2-inch dice",
        "2 dried bay leaves",
        "1 tablespoon Old Bay Seasoning",
        "1 1/2 pounds Yukon Gold, Maine, PEI, or other all-purpose potatoes, peeled and cut into 3/4-inch dice",
        "4 cups Crab Stock ,Traditional Fish Stock , or Chicken Stock",
        "1 can (28 ounces) peeled whole tomatoes in juice, cut into 1/2-inch dice",
        "Kosher or sea salt and freshly ground black pepper",
        "1/4 cup coarsely chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Shellfish",
        "Fry",
        "Crab",
        "Summer"
    ],
    "title": "San Francisco Crab \"Meatball\" Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/san-francisco-crab-meatball-chowder-105203"
}
