{
    "directions": [
        "Place yeast and warm water in the bowl of a stand mixer; whisk to mix. Add flour and salt.",
        "Knead with dough hook until mixture forms a soft, sticky dough ball and easily pulls away from the sides and the hook, about 5 minutes. (If still too sticky, add a bit more flour and knead a few more seconds.) Transfer dough to a work surface and form into a smooth ball. Place dough back in the mixing bowl. Drizzle the dough and sides of bowl a few drops of vegetable oil. Spread a film of oil over the surface of the dough.",
        "Cover the bowl and transfer to a warm, draft-free place until dough is doubled in size, 60 to 90 minutes.",
        "Transfer dough to a floured work surface. Form into a rectangle shape and cut into 6 equal pieces. Using your cupped hand and the work surface, roll each section of dough into a smooth round ball. Cover with a clean, dry cloth and let rest 15 minutes.",
        "Flatten dough balls into 6- or 7-inch long ovals. Starting with a long edge, roll the dough into a cylinder, applying extra pressure to the ends to form pointy tips for a classic French roll shape. Transfer to parchment-lined baking sheets (do not crowd them) and cover with clean dry towels until doubled, about 1 hour.",
        "Preheat oven to 450 degrees F (230 degrees C). Place a pan of water on the bottom rack.",
        "With a very sharp knife, score each roll about 1/4 inch deep along one side somewhere between the side and the top. Spritz loaves lightly with water from a spray bottle.",
        "Bake in preheated oven about 20 minutes. Spritz loaves again and rotate pans for a more even bake. Bake until loaves are golden brown, about 10 more minutes. Transfer to a cooling rack; cool completely before cutting."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 1/2 cups warm water (100 to 110 degrees F)",
        "1 1/2 teaspoons fine salt",
        "19 ounces bread flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sandwich Rolls",
    "url": "http://allrecipes.com/recipe/246125/sandwich-rolls/"
}
