{
    "directions": [
        "Remove a wide, 2-inch-long strip of zest from 1 orange with a paring knife. Finely grate the zest of the other orange and set aside. Peel and segment both oranges, cover and refrigerate.",
        "Combine the wine, 5 tablespoons sugar, the honey, cinnamon stick and orange zest strip in a small saucepan. Simmer over medium-low heat until reduced to 1 1/2 cups, about 40 minutes. Discard the cinnamon and zest and cool the wine reduction completely. Set aside 1/2 cup for serving.",
        "Combine the milk with the remaining 2 tablespoons sugar in a medium saucepan. Sprinkle in the gelatin and let stand, undisturbed,",
        "until the gelatin softens, about 4 minutes. Cook over medium heat, stirring occasionally, until the gelatin and sugar are just dissolved (do not boil); let cool. Whisk in 1 cup of the wine reduction, the grated orange zest and yogurt until smooth. Pour into six 6-ounce ramekins or jars, cover and refrigerate until set, at least 3 hours or overnight.",
        "Just before serving, core and finely dice the apple, then toss with the reserved orange segments. Dip the bottom of each ramekin in warm water to loosen. Invert each panna cotta onto a plate, drizzle with the reserved wine reduction and top with the fruit.",
        "Photograph by Ngoc Minh Ngo"
    ],
    "ingredients": [
        "2 oranges",
        "3 cups boxed red wine",
        "7 tablespoons sugar",
        "2 teaspoons honey",
        "1 cinnamon stick",
        "1 cup whole milk",
        "1 1/4-ounce packet unflavored powdered gelatin",
        "2 cups whole-milk plain yogurt",
        "1 Granny Smith apple"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Panna Cotta",
        "Gelatin Recipes",
        "Mixed Drink Recipes",
        "Sangria Recipes",
        "Dairy Recipes"
    ],
    "title": "Sangria Panna Cotta",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/sangria-panna-cotta-recipe"
}
