{
    "directions": [
        "In a large heavy skillet cook the kielbasa over moderate heat, stirring, until it is browned and transfer it with a slotted spoon to a large bowl. In the fat remaining in the skillet cook the onions and the celery, stirring, until they are softened and add them to the bowl. In the skillet sauté the pecans in the remaining fat and the butter over moderately high heat, stirring, until they are golden and add the mixture to the bowl with the stuffing, the corn bread, the sage, the parsley, and the chilies. Add enough of the broth to moisten the stuffing to the desired consistency and let the stuffing cool completely. Makes about 14 cups, or enough to stuff a 12-to 16-pound turkey with plenty to cook separately for those who like their stuffing less sinfully rich.",
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or boil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)"
    ],
    "ingredients": [
        "1 pound kielbasa or other smoked sausage, halved lengthwise and cut  into 1/4-inch slices",
        "4 cups chopped onions (about 2 very large)",
        "2 cups chopped celery",
        "1 1/2 cups chopped pecans (a 6-ounce can)",
        "1 stick (1/2 cup) unsalted butter",
        "An 8-ounce package herb-seasoned stuffing",
        "Buttermilk corn bread or 3 cups packaged corn bread stuffing",
        "2 tablespoons crumbled dried sage",
        "1 1/2 cups chopped fresh parsley leaves",
        "three 4-ounce cans green chilies, chopped, or 5 to 7 fresh poblano  chilies, roasted and peeled and chopped, or to taste",
        "1 cup chicken broth, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Nut",
        "Onion",
        "Pork",
        "Vegetable",
        "Side",
        "Christmas",
        "Stuffing/Dressing",
        "Winter",
        "Gourmet"
    ],
    "title": "Sante Fe Christmas Turkey Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/sante-fe-christmas-turkey-stuffing-13527"
}
