{
    "directions": [
        "Combine flour, baking powder and salt in medium bowl; set aside. Beat butter and sugar in large bowl with electric mixer on medium speed until light and fluffy. Add eggs, vanilla and almond extracts; mix well. Gradually add flour mixture, beating on low speed after each addition until well blended. Divide dough into 3 portions; wrap each tightly in plastic wrap. Refrigerate dough 2 hours or until thoroughly chilled and firm enough to handle.",
        "Preheat oven to 375 degrees F. Spray baking sheets and 5-inch Santa face cookie cutter with cooking spray; set aside. Roll out 1 portion of dough to 1/4-inch thickness on floured surface with floured rolling pin. Cut out cookies with prepared cutter. Transfer with metal spatula to baking sheet, placing 1 inch apart. Repeat with remaining dough portions, spraying cutter with additional cooking spray as needed.",
        "Bake 7 to 10 minutes or until edges of cookies are browned lightly. Cool on baking sheet 1 minute before removing cookies and placing on wire racks to cool completely.",
        "Use red icing to fill in the hat, leaving the tip of the hat blank. Use white icing to fill in the tip of the hat, the brim of the hat, the beard and to make 2 dots in the center of the face for the eyes. Place a red candy centered between the eyes at the top of the beard for the nose and a mini morsel on each white dot to make eyes. Top beard with Reddi-wip(R) just before serving."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup butter, softened",
        "1 1/2 cups granulated sugar",
        "2 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 teaspoons almond extract",
        "PAM® Original No-Stick Cooking Spray",
        "2 (7 ounce) pouches red decorating cookie icing",
        "2 (7 ounce) pouches white decorating cookie icing",
        "22 red candy-coated chocolate pieces",
        "44 semisweet chocolate morsels",
        "Reddi-wip® Original Dairy Whipped Topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Santa Sugar Cookies",
    "url": "http://allrecipes.com/recipe/244829/santa-sugar-cookies/"
}
