{
    "directions": [
        "Place the garlic, salt, peppercorns, cumin, and allspice in a large mortar and pound to a paste with a pestle. Stir in the bitter orange juice. (You can also puree these ingredients in a blender or food processor.) Set aside.",
        "Trim the skin from the inner part of the leg only. Wipe the meat clean with a damp cloth. Make several deep incisions all over the skinned portion and rub with the salt. Let rest for a few minutes. Rub the marinade all over the pork, pushing it into the gashes and between the meat and the skin. Cover with plastic wrap and refrigerate for 2 to 3 hours or a maximum of 12 hours. Wipe the marinade from the skin with a clean cloth.",
        "Preheat the oven to 400°F. Place the pork in a roasting pan and bake uncovered, skin side up, for 3 to 4 hours. Check the roast often. As the pan juices evaporate, replenish them with a little of the diluted sweet orange juice. The pork is done when the skin is crackling and the juices run clear when the meat is pierced at the thickest part of the leg (about 160°F on a meat thermometer).",
        "Remove the pork from the oven and lift it onto a cutting board, holding the bone with a cloth. With a sharp knife, remove the crisp skin and cut it into small serving pieces. Place them on a cookie sheet and set in the turned-off oven, uncovered (if you cover the crackling, it steams and gets soggy).",
        "To deglaze the pan juices, place the roasting pan on the stove over medium heat and add the sherry, scraping up the browned bits with a wooden spoon.",
        "Carve the pork and return to the roasting pan with the pan juices to keep the meat moist and flavorful. Pork dries out easily, so if you must hold it for more than 30 minutes, cover the pan with aluminum foil and return it to a warm oven."
    ],
    "ingredients": [
        "1 head garlic, separated into cloves and peeled",
        "1 tablespoon salt",
        "2 teaspoons black peppercorns",
        "2 teaspoons ground cumin",
        "2 teaspoons allspice berries or ground allspice",
        "3/4 cup bitter orange juice (from about 6 oranges) or equal parts lime juice and orange juice",
        "1 cup sweet orange juice diluted with about 1/4 cup water",
        "One 8- to 9-pound leg of pork, with skin",
        "1 teaspoon salt",
        "1/4 cup sweet sherry or port wine, for deglazing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Roast",
        "Christmas"
    ],
    "title": "Santiago de Cuba's Roast Pork Marinated in a Garlicky Allspice-Cumin _Adobo_ (_Cerdo Brujo_)",
    "url": "http://www.epicurious.com/recipes/food/views/santiago-de-cubas-roast-pork-marinated-in-a-garlicky-allspice-cumin-em-adobo-em-em-cerdo-brujo-em-51203240"
}
