{
    "directions": [
        "Combine the granulated garlic and pepper in a small bowl and set aside. Mince the garlic and slowly incorporate the salt and sugar, alternating, to create a paste. Add the Achiote Oil and mix well. Be careful, this oil will stain.",
        "Rinse and pat dry the roast and rub with the garlic paste, evenly coating the meat. Sprinkle evenly with the granulated garlic and pepper mixture and wrap tightly in plastic wrap. Refrigerate for 24 hours and up to 48 hours.",
        "Remove the wrap and allow the roast to rest while you preheat a well-oiled grill to medium-high heat. Add the roast and cook for 9 minutes, turn, repeat and check the temperature. Once 90 degrees F is achieved, turn the middle burner to high and sear all sides of the roast. Remove from the grill and allow to rest for 10 to 15 minutes, loosely covered with aluminum foil.",
        "Slice across the grain in thin (1/8-inch) pieces, drizzle any juices that have accumulated back onto the sliced meat and serve immediately.",
        "In a small saucepan over medium-high heat, add the seeds and toast for 2 to 3 minutes. Add the oil, reduce the heat to low and cook for 5 to 6 minutes. The oil will become bright orange. Immediately remove from the heat, cool and strain. Store the oil in a glass container in the refrigerator. The oil will keep for several months."
    ],
    "ingredients": [
        "2 tablespoons granulated garlic",
        "1/3 cup fresh cracked black pepper",
        "1/2 cup garlic cloves",
        "3 tablespoons kosher salt",
        "2 tablespoons sugar",
        "2 tablespoons Achiote Oil, recipe follows",
        "One 3- to 4-pound prime tri-tip roast",
        "1 1/2 tablespoons achiote seeds",
        "1/2 cup canola oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Grilling Recipes",
        "Easy Recipes",
        "Grilling",
        "Beef",
        "Meat"
    ],
    "title": "Santa Maria Tri-Tip",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/santa-maria-tri-tip-recipe"
}
