{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Add chorizo; sauté until fat is rendered, about 3 minutes. Add next 6 ingredients; sauté until onion begins to soften, about 5 minutes. Mix in oregano and cumin, then tomatoes, corn, and bottled clam juice. Bring to boil. Reduce heat to medium-low. Cover and simmer until potatoes are almost tender, about 12 minutes. (Can be made 1 day ahead. Refrigerate uncovered until cool, then cover and chill. Bring to simmer before continuing.)",
        "Add clams to mixture in pot; cover and cook over medium-high heat until clams open and potatoes are tender, about 7 minutes (discard any clams that do not open). Mix in 4 tablespoons cilantro. Season to taste with salt and pepper. Divide clams among 6 shallow soup bowls. Ladle chowder over. Sprinkle with remaining cilantro and serve.",
        "A smoked-pork link sausage flavored with garlic and spices, but milder than Mexican chorizo. Spanish chorizo is available at Spanish markets and specialty foods stores."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "4 ounces Spanish chorizo * or andouille sausage, cut into 1/3-inch dice",
        "12 ounces white-skinned potatoes, peeled, cut into 1/2-inch cubes",
        "1 medium onion, chopped",
        "1 celery stalk, chopped",
        "1/3 cup canned diced green chilies",
        "1 large jalapeño chili, seeded, chopped",
        "1 garlic clove, minced",
        "1 teaspoon dried oregano",
        "1 teaspoon ground cumin",
        "1 cup canned crushed tomatoes with added puree",
        "1 cup frozen white corn kernels",
        "3 8-ounce bottles clam juice",
        "24 littleneck clams, scrubbed",
        "6 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Potato",
        "Tomato",
        "Sauté",
        "Sausage",
        "Clam",
        "Corn",
        "Jalapeño",
        "Cilantro"
    ],
    "title": "Santa Fe Clam Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/santa-fe-clam-chowder-106296"
}
