{
    "directions": [
        "Prepare the egg sponge and while it is baking make the sauce.",
        "In a saucepan cook the garlic in the oil over moderately low heat, stirring occasionally, until it is golden, add the tomatoes with the juice, and simmer the mixture, breaking up the tomatoes, for 15 minutes, or until the sauce is thickened. Season the sauce with salt and pepper.",
        "Spread the sauce on the warm egg sponge, leaving a 1-inch border on the long sides, sprinkle it with the sardines, the jalapeño, and 1 cup of the Monterey Jack, and starting with a long side roll up the egg sponge jelly-roll fashion. With the aid of the towel and the wax paper transfer the roulade, seam side down, to a shallow baking pan, brush the top lightly with the butter, and sprinkle it with the remaining 1/4 cup Monterey Jack. Bake the roulade in the upper third of a preheated 375°F. oven for 8 to 10 minutes, or until the Monterey Jack is melted, and slice it.",
        "Line a buttered jelly-roll pan, 15 1/2 by 10 1/2 by 1 inches, with wax paper, butter the paper, and dust it with flour, knocking out the excess. In a saucepan melt the butter, add the flour, and cook the roux  over moderately low heat, stirring for 3 minutes. Add the milk in a stream, whisking, and simmer the mixture, whisking occasionally, for 5 minutes. Transfer the mixture to a large bowl and whisk in the yolks, 1 at a time, whisking well after each addition. In a bowl with an electric mixer beat the whites until they just hold stiff peaks, stir one third of them into the yolk mixture, and fold in the remaining whites gently, but thoroughly. Spread the batter evenly in the prepared pan and bake it in the middle of a preheated 350° F. oven for 25 minutes, or until it is golden and firm to the touch. Cover the egg sponge with a sheet of buttered wax paper, buttered side down, and a kitchen towel, invert a baking sheet over the towel, and invert the egg sponge onto the baking sheet, removing the wax paper from the top carefully. Trim 1/4 inch from the short sides of the egg sponge."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "6 tablespoons all-purpose flour",
        "1 1/4 cups milk",
        "4 large eggs, separated, the whites at room temperature",
        "1 garlic clove, minced",
        "2 teaspoons olive oil",
        "a 14-ounce can plum tomatoes including the juice",
        "a 3 3/4-ounce can brisling sardines packed in oil, drained and chopped coarse",
        "2 teaspoons minced pickled jalapeño chili (wear rubber gloves)",
        "1 1/4 cups grated Monterey Jack",
        "unsalted butter, softened, for brushing the roulade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Cheese",
        "Fish",
        "Tomato",
        "Bake",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Sardine Roulade with Jalapeño, Monterey Jack, and Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sardine-roulade-with-jalapeno-monterey-jack-and-tomato-sauce-10351"
}
