{
    "directions": [
        "Preheat oven to 500°F. Toss tomatoes with oil on a rimmed baking sheet to coat. Roast until skin is blackened and tomatoes are very soft, 20–25 minutes. Pass tomatoes through finest disk of a food mill or a coarse-mesh sieve into a small saucepan; season with salt. Bring to a simmer over medium-low heat, stirring often, and cook until you have about 1/2 cup tomato purée. Let cool.",
        "Meanwhile, toast fenugreek, cumin, and peppercorns in a dry small skillet over medium heat, tossing often, until fragrant. Let cool and finely grind in spice mill or with mortar and pestle.",
        "Mix tomato purée, spice mixture, and mayonnaise in a bowl; season with salt.",
        "Prepare a grill for medium-high heat. (Alternatively, heat a grill pan over medium-high.) Brush both sides of bread with 2 Tbsp. oil total and grill until lightly charred, about 2 minutes per side.",
        "Toss fennel, dill, parsley, lemon juice, and remaining 1 Tbsp. oil in a medium bowl; season with salt. Spread tomato mayonnaise over toast and top each with a few sardines and some fennel salad.",
        "Tomato mayonnaise can be made 5 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 1/2 pounds plum tomatoes (about 10), halved lengthwise",
        "1/4 cup olive oil",
        "Kosher salt",
        "1/2 teaspoon fenugreek seeds",
        "1/4 teaspoon cumin seeds",
        "1/4 teaspoon black peppercorns",
        "1/2 cup mayonnaise",
        "4 (3/4-inch-thick) slices country-style bread",
        "3 tablespoons olive oil, divided",
        "1 small fennel bulb, quartered lengthwise, very thinly sliced",
        "1 tablespoon coarsely chopped dill",
        "1 tablespoon coarsely chopped parsley",
        "1 tablespoon fresh lemon juice",
        "Kosher salt",
        "2 (4.2-ounce) cans oil-packed sardines, drained, pin bones removed",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sardine",
        "Fish",
        "Appetizer",
        "Tomato",
        "Mayonnaise",
        "Dill",
        "Fennel",
        "Spring",
        "Hors D'Oeuvre",
        "Bread",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sardine Toasts With Tomato Mayonnaise and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/sardine-toasts-with-tomato-mayonnaise-and-fennel"
}
