{
    "directions": [
        "Place rice in a medium bowl, and pour boiling water over it. Let soak for 15 minutes, then drain.",
        "Heat 2 tablespoons of oil in a large skillet over medium-high heat. Add the carrots, parsley roots, onions and tomato paste. Cook and stir until the vegetables are tender. Transfer the vegetables to the bowl with the rice.",
        "Heat 2 more tablespoons of oil in the same skillet over medium-high heat. Add the pork, and cook for about 2 minutes, just until browned on the outside. Transfer to the bowl with the rice and vegetables; season with dill and black pepper. Stir until everything is well blended. Set the mixture aside to cool.",
        "Carefully remove the leaves from the head of cabbage, and place them in a large pot with about 2 inches of water. Bring to a boil, and cook for 5 to 10 minutes, until tender and flexible.",
        "Remove the cabbage leaves from the pot, but leave enough in the bottom to cover. On each of the remaining leaves, place about 2 tablespoons of the pork and rice mixture in the center, and wrap the leaf around to cover. Place the stuffed cabbage leaves into the pot.",
        "When the pot is full, place a few boiled cabbage leaves over the top. Pour boiling water into the pot to cover the cabbage rolls, and place over medium-low heat.  Cover, and simmer for about 30 minutes, until the rice is tender."
    ],
    "ingredients": [
        "3 1/4 cups long grain rice, rinsed",
        "2 pounds pork loin roast, finely diced",
        "1 pound carrots, chopped",
        "1 pound onions, chopped",
        "1 pinch salt to taste",
        "3 tablespoons tomato paste",
        "1/2 teaspoon dried dill weed",
        "1/4 cup sunflower seed oil",
        "6 ounces parsley roots, chopped",
        "1 medium head cabbage"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sarmale (Stuffed Cabbage or Vine Leaves)",
    "url": "http://allrecipes.com/recipe/75615/sarmale-stuffed-cabbage-or-vine-leav/"
}
