{
    "directions": [
        "Place the chiles into a dry skillet over medium heat, and cook and stir until the chiles turn dark red-brown in color and give off their fragrance, 1 to 2 minutes. Remove from heat, allow to cool, and remove stems of chiles; shake out the seeds, and tear the flesh of the roasted chiles into pieces. Set aside.",
        "Place the spinach into a saucepan over medium heat; place mustard greens into a separate saucepan.  If leaves are dry, mix in 1 or 2 of tablespoons of water. If leaves are still wet, just cover the pans and simmer the greens until tender, about 10 minutes. Allow to cool.",
        "Place greens together into the work bowl of a food processor, and pulse several times to break up the greens, then process to a paste, about 1 minute.",
        "Heat ghee in a large saucepan over medium heat, and stir in the cumin seeds, stirring for about 30 seconds or until the seeds sizzle and turn a darker brown color. Mix in the onion, cook and stir until lightly browned, about 3 minutes, and mix in the roasted peppers, ginger paste, garlic paste, and tomato. Mix in the pureed greens, bring to a simmer, and stir in salt and sugar to taste. If dish is too thick, mix in up to about 1/4 cup of water, 1 tablespoon at a time, until the greens are the desired thickness."
    ],
    "ingredients": [
        "2 large dried red chile peppers (optional)",
        "2 bunches fresh spinach, washed and chopped",
        "1 bunch mustard greens, washed and chopped",
        "2 tablespoons ghee (clarified butter)",
        "1/2 teaspoon cumin seeds",
        "1/4 cup finely chopped onion",
        "1/2 teaspoon ginger paste",
        "2 teaspoons garlic paste",
        "1/2 tomato, chopped",
        "salt to taste",
        "1/2 teaspoon white sugar, or to taste",
        "1/4 cup water (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sarson Ka Saag (Indian Mustard Greens)",
    "url": "http://allrecipes.com/recipe/218505/sarson-ka-saag-indian-mustard-greens/"
}
