{
    "directions": [
        "Whisk 2 cups flour and salt together in a large bowl; cut in lard with a knife or pastry blender until the mixture resembles peas. Add 1/4 cup cold water, 1 tablespoon at a time, tossing with a fork, until mixture is moistened just enough to form a ball when squeezed. Divide dough into two pieces, form each into a ball, and refrigerate until cold, about 1 hour.",
        "Place berries and 1/2 cup water in a saucepan; bring to a boil. Reduce heat and simmer berries until tender, about 10 minutes.",
        "Whisk sugar, 1 1/2 tablespoons flour, and cornstarch together in a small bowl. Stir sugar mixture into berries, return to a boil, and cook, stirring constantly, until filling is clear, about 2 minutes; stir in lemon juice. Cool filling to room temperature, about 30 minutes.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Roll one ball of pastry out on a lightly floured surface to fit an 8-inch pie plate; line pie plate with crust. Pour berry mixture into pie crust; dot with butter. Roll remaining pastry out for top crust, place over filled pie, and crimp edges tightly together.",
        "Bake in the preheated oven for 15 minutes; reduce oven temperature to 350 degrees F (175 degrees C) and bake until crust is golden brown and filling is bubbly, about 35 minutes."
    ],
    "ingredients": [
        "Pastry:",
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 cup lard",
        "3/4 cup cold water, divided",
        "Pie Filling:",
        "4 cups saskatoon berries, or as needed",
        "3/4 cup white sugar",
        "1 1/2 tablespoons all-purpose flour",
        "1 1/2 tablespoons cornstarch",
        "2 teaspoons lemon juice",
        "1 tablespoon butter, cut into small pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Saskatoon Berry (Serviceberry) Pie",
    "url": "http://allrecipes.com/recipe/236756/saskatoon-berry-serviceberry-pie/"
}
