{
    "directions": [
        "Pierce each sausage several times with tip of knife. Place sausages in heavy large saucepan; add onion. Cover; cook over medium-low heat 5 minutes. Turn sausages over; stir onion. Cover and continue to cook until sausages release some fat and onion begins to color, about 5 minutes. Uncover; increase heat to medium. Add wine and simmer until wine evaporates and onion is golden, stirring often, about 5 minutes. Remove from heat.",
        "Fit food mill directly onto pan. Add tomatoes with juices and puree through mill into pan, leaving only seeds behind and scraping all tomato pulp from underside of food mill into pan; or puree tomatoes with juices in processor, then strain out seeds and add puree to pan. Add crushed red pepper. Simmer very gently over low heat until sauce thickens and reduces to scant 2 cups, stirring sauce and turning sausages occasionally, about 1 hour 15 minutes. Add slivered basil and simmer sauce 5 minutes longer. Using tongs, transfer sausages to plate and cool. Season sauce to taste with salt and pepper.",
        "Place ricotta in medium bowl. Mix in provolone cubes, 2 tablespoons grated Parmesan, and black pepper. Cut sausages into 1/4-inch cubes; stir into cheese mixture. Season filling to taste with salt. (Sauce and filling can be made 1 day ahead. Cover separately and chill.)",
        "Cook manicotti in large pot of boiling salted water until still somewhat firm to bite and about 3/4 cooked, about 7 minutes (depending on brand). Using tongs, carefully transfer manicotti from pot to foil-lined baking sheet and cool.",
        "Brush olive oil over bottom of 13x9x2-inch glass baking dish; spread 3 tablespoons sauce over. Using teaspoon, fill each of 12 manicotti with about 1/3 cup cheese-sausage mixture. Arrange stuffed pasta in single layer in prepared dish and spoon remaining sauce over. (Can be made 2 hours ahead. Cover with plastic wrap; let stand at room temperature.)",
        "Preheat oven to 350°F. Sprinkle remaining 3/4 cup Parmesan atop sauce. Bake manicotti uncovered until heated through and sauce is bubbling on bottom of dish, about 20 minutes. Let manicotti stand 5 minutes and serve."
    ],
    "ingredients": [
        "12 ounces Italian sweet sausages with fennel seeds (about 3 1/2 sausages)",
        "1/2 cup finely chopped onion",
        "1/2 cup dry white wine",
        "1 28-ounce can Italian plum tomatoes with basil",
        "1/8 teaspoon dried crushed red pepper",
        "8 large fresh basil leaves, slivered",
        "2 cups fresh whole-milk ricotta cheese or one 15-ounce container whole-milk ricotta cheese",
        "1 cup 1/4-inch cubes mild imported provolone cheese (provola) or sharp domestic provolone cheese",
        "2 tablespoons plus 3/4 cup freshly grated Parmesan cheese",
        "1/4 teaspoon coarsely ground black pepper",
        "1 pound manicotti (large tubular pasta)",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Tomato",
        "Bake",
        "Ricotta",
        "Basil",
        "Sausage",
        "Winter"
    ],
    "title": "Sausage and Cheese Manicotti",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-cheese-manicotti-107863"
}
