{
    "directions": [
        "In a bowl blend together the flour, the butter, the shortening, and a pinch of salt until the mixture resembles meal, add 1 1/2 tablespoons ice water, and toss the mixture until the water is incorporated, adding more water if necessary to form the dough into a ball. Pat the dough into 7 1/2-inch tart pan with a removable rim and bake the shell in the bottom third of a preheated 425°F. oven for 7 minutes, or until it is just golden.",
        "While the shell is baking, in a large skillet cook the sausage with the bell peppers, covered, over moderately high heat, stirring and breaking up any lumps, for 7 minutes, or until the sausage is no longer pink and the bell peppers are soft, and drain the mixture, discarding the excess fat. Transfer the mixture to a bowl, stir in the remaining salt, the Cheddar, and the Parmesan, and spread the mixture in the bottom of the shell. In a bowl whisk together the eggs, the cream, and the milk, pour the egg mixture over the sausage mixture, and bake the quiche on a baking sheet in the middle of a preheated 425°F. oven for 15 minutes. Reduce the temperature to 350°F. and bake the quiche for 10 minutes more."
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons all-purpose flour",
        "3 tablespoons cold unsalted butter, cut into bits",
        "1 tablespoon cold vegetable shortening",
        "1/2 teaspoon salt",
        "3/4 pound hot or sweet Italian sausage, casings discarded and the meat chopped",
        "2 red bell peppers, minced (about 1 1/4 cups)",
        "1/4 cup grated Cheddar",
        "2 tablespoons freshly grated Parmesan",
        "2 large eggs",
        "1/2 cup heavy cream",
        "3 tablespoons milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Brunch",
        "Side",
        "Bake",
        "Sauté",
        "Quick & Easy",
        "Sausage",
        "Bell Pepper",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sausage and Red Bell Pepper Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-red-bell-pepper-quiche-10355"
}
