{
    "directions": [
        "Heat oil in heavy large pot over medium-high heat. Add sausages, onion, garlic, oregano and crushed red pepper and sauté until sausage is cooked through, mashing sausage into small pieces with back of fork, about 10 minutes. Add crushed tomatoes and diced tomatoes with juices. Bring sauce to boil. Reduce heat to medium and simmer 5 minutes to blend flavors. Season with salt and pepper. (Can be made 1 day ahead. Chill until cold, then cover and keep chilled.)",
        "Using on/off turns, chop fresh basil leaves finely in processor. Add ricotta, mozzarella, Parmesan, egg, 1/2 teaspoon salt and 1/4 teaspoon pepper. Using on/off turns, process filling until just blended and texture is still chunky.",
        "Preheat oven to 375°F. Spread 1 1/4 cups sauce in 13x9x2-inch glass baking dish. Arrange 3 noodles on sauce. Drop 1 1/2 cups filling over noodles, then spread evenly to cover. Sprinkle with 3/4 cup mozzarella cheese and 1/4 cup Parmesan cheese. Repeat layering of sauce, noodles, filling and cheeses 2 more times. Top with remaining 3 noodles. Spoon remaining sauce atop noodles. Sprinkle with remaining cheeses. Spray large piece of foil with nonstick olive oil spray. Cover lasagna with foil, sprayed side down.",
        "Bake lasagna 40 minutes. Carefully uncover. Increase oven temperature to 400°F. Bake until noodles are tender, sauce bubbles thickly and edges of lasagna are golden and puffed, about 20 minutes. Transfer to work surface; let stand 15 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 pound spicy Italian sausages, casings removed",
        "1 cup chopped onion",
        "3 large garlic cloves, chopped",
        "2 teaspoons dried oregano",
        "1/4 teaspoon dried crushed red pepper",
        "1 28-ounce can crushed tomatoes with added puree",
        "1 14 1/2-ounce can diced tomatoes with green pepper and onion (do not drain)",
        "1 1/2 cups (packed) fresh basil leaves",
        "1 15-ounce container plus 1 cup part-skim ricotta cheese",
        "1 1/2 cups (packed) grated mozzarella cheese (about 6 ounces)",
        "3/4 cup grated Parmesan cheese (about 2 ounces)",
        "1 large egg",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "12 no-boil lasagna noodles from one 8-ounce package",
        "3 cups (packed) grated mozzarella cheese (about 12 ounces)",
        "1 cup grated Parmesan cheese (about 3 ounces)",
        "Nonstick olive oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Pork",
        "Tomato",
        "Bake",
        "Sauté",
        "Dinner",
        "Mozzarella",
        "Parmesan",
        "Meat",
        "Sausage",
        "Fall",
        "Winter",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sausage, Cheese and Basil Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-cheese-and-basil-lasagna-103005"
}
