{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 baking dish.",
        "Heat olive oil in a large skillet over medium heat; cook and stir onion, mushrooms, garlic, and salt until onion is slightly translucent and softened, 7 to 10 minutes.",
        "Cook and stir sausage in a separate skillet over medium heat, breaking into crumbles, until browned, about 10 minutes. Add bacon, Neufchatel cheese, and sour cream; stir to combine. Add mushroom mixture to sausage mixture, reserving about 1/4 cup mushroom mixture. Season with garlic and herb seasoning, salt, and black pepper.",
        "Warm Alfredo sauce with the reserved mushroom mixture in a pan over medium-low heat, 3 to 5 minutes.",
        "Stuff each bell pepper with sausage-mushroom mixture; place in the prepared baking dish. Top each bell pepper with Cheddar cheese; pour warmed Alfredo sauce over and around the bell peppers. Cover baking dish with aluminum foil.",
        "Bake in the preheated oven until bell peppers are beginning to soften, about 30 minutes. Remove aluminum foil and bake until cheese is melted, 10 to 20 more minutes."
    ],
    "ingredients": [
        "2 teaspoons olive oil",
        "1 yellow onion, chopped",
        "1 (12 ounce) package fresh mushrooms, chopped",
        "2 cloves garlic, minced",
        "salt to taste",
        "1 pound bulk spicy pork sausage",
        "1/2 (14 ounce) package cooked bacon, diced",
        "1 1/2 (8 ounce) packages Neufchatel cheese",
        "1 cup sour cream",
        "2 teaspoons garlic and herb seasoning, or more to taste",
        "salt and ground black pepper to taste",
        "3 large green bell peppers, tops and seeds removed",
        "1 (16 ounce) jar Alfredo sauce",
        "1/2 cup shredded Cheddar cheese, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sausage Alfredo Stuffed Peppers",
    "url": "http://allrecipes.com/recipe/223213/sausage-alfredo-stuffed-peppers/"
}
