{
    "directions": [
        "Using wet hands, lightly roll sausage into 12 golf ball–size balls (about 2 oz. each). Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Cook meatballs, turning occasionally, until browned all over, 10–12 minutes. Transfer to a plate.",
        "Add fennel, onion, half of garlic, and 2 Tbsp. oil to same pot; season with salt and pepper and cook, stirring often, until onion is translucent and golden brown around edges, 8–10 minutes.",
        "Add tomatoes, crushing with your hands as you go, and bring to a simmer. Season with salt and pepper and cook, stirring occasionally, until sauce just begins to thicken, 5–8 minutes.",
        "Return meatballs to pot, bring to a simmer, and cook, stirring occasionally, until sauce is reduced by half and meatballs are coated and cooked through, 15–20 minutes.",
        "Meanwhile, heat broiler. Process basil, remaining garlic, and remaining 4 Tbsp. oil in a food processor to a smooth paste; season with salt and pepper. Smear half of basil mixture over cut sides of rolls and place on a rimmed baking sheet. Broil rolls until golden brown, about 2 minutes.",
        "Place meatballs inside rolls, then top with sauce and mozzarella. Broil until mozzarella is melted and bubbling, about 5 minutes. Spoon remaining basil mixture over sandwiches."
    ],
    "ingredients": [
        "1 1/2 pounds hot and/or sweet Italian sausage, casings removed",
        "8 tablespoons olive oil, divided",
        "1 fennel bulb, core removed, thinly sliced",
        "1 large onion, chopped",
        "10 cloves garlic, thinly sliced, divided",
        "Kosher salt, freshly ground pepper",
        "1 28-ounce can whole peeled tomatoes",
        "1 cup (packed) basil leaves",
        "4 soft hoagie rolls, split lengthwise down tops",
        "4 ounces fresh mozzarella, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lunch",
        "Sandwich",
        "Meatball",
        "Sausage",
        "Fennel",
        "Garlic",
        "Mozzarella",
        "Tomato",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sausage Meatball Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-meatball-sandwiches"
}
