{
    "directions": [
        "Place onion and 3 cloves of garlic in a food processor. Process while drizzling in 1/4 cup of olive olive, until smooth. Set aside.",
        "Heat a large skillet over medium-high heat and stir in the sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Stir in onion mixture, reduce heat to medium, and cook, stirring occasionally, for 5 minutes. Remove from heat. Pour mixture into the food processor along with the ricotta cheese. Process until smooth, streaming more olive oil as necessary. Stir in paprika and cayenne, and season with salt and pepper to taste.",
        "Spoon about 1 tablespoon full of the sausage mixture onto the center of one wonton wrapper. Brush the edges of the wrapper with the egg, then fold the wrapper into a triangle, sealing the edges tightly. Place ravioli on a baking sheet sprayed with cooking spray. Repeat until all the wonton wrappers have been filled. Cover and refrigerate the ravioli until ready to cook.",
        "Meanwhile, place the basil and pine nuts in a clean food processor. Pulse 4 or 5 times, then add 2 garlic cloves. Pulse 2 or 3 more times, then process until smooth while slowly adding in 5 tablespoons of olive oil. Stir in the balsamic vinegar, and season to taste with salt and pepper.",
        "Fill a large pot with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in the ravioli. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 3 to 4 minutes. Drain well in a colander set in the sink. Place ravioli in a large bowl and toss with 4 to 5 tablespoons of pesto."
    ],
    "ingredients": [
        "1 large white onion, quartered",
        "3 cloves garlic",
        "1/4 cup extra-virgin olive oil, or more as needed",
        "5 (3.5 ounce) links Italian sausage links, casings removed",
        "2 1/2 cups ricotta cheese",
        "1 tablespoon paprika",
        "1 teaspoon cayenne pepper",
        "salt and pepper to taste",
        "1 (16 ounce) package wonton wrappers",
        "1 egg, beaten",
        "1/3 cup pine nuts",
        "2 cups chopped fresh basil",
        "5 tablespoons extra-virgin olive oil",
        "1 dash balsamic vinegar",
        "2 cloves garlic",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sausage and Ricotta Ravioli with Pesto Sauce",
    "url": "http://allrecipes.com/recipe/213118/sausage-and-ricotta-ravioli-with-pest/"
}
