{
    "directions": [
        "In a soup pot or large Dutch oven, heat 1 tablespoon extra-virgin olive oil. Add the sausage, breaking it into pieces, and cook until lightly brown. Add the onions, celery, carrots, potato, chile pepper, rosemary, garlic, cumin, salt, and pepper, and cook to soften, 8 to10 minutes.",
        "Wilt in the kale, and season the kale leaves with a little freshly grated nutmeg. Stir in the tomato paste for 30 seconds, then add white wine. Cook to reduce by 1/2 and stir in the lentils, stock, and water. Bring to a boil, reduce the heat to low, and simmer the soup until the lentils are tender, about 35 minutes. Serve immediately or cool, store, and reheat. Serve with chopped celery greens, to garnish."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 pound hot sausage, bulk or casing removed",
        "1 onion, chopped",
        "2 ribs celery, chopped, leafy tops reserved",
        "1 large carrot, peeled and chopped",
        "1 large Idaho (russet) potato, peeled and chopped into small dice",
        "1 Fresno or Holland chile pepper, thinly sliced or finely chopped",
        "2 sprigs fresh rosemary, leaves picked and finely chopped",
        "2 large cloves garlic, chopped or sliced",
        "1/2 tablespoon ground cumin",
        "Kosher salt and freshly ground black pepper",
        "1 bundle Tuscan, black, or dinosaur kale, stemmed and very thinly sliced",
        "1/4 cup tomato paste",
        "1 cup white wine",
        "Freshly grated nutmeg",
        "1 3/4 cups lentils",
        "4 cups chicken stock",
        "2 cups water"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bean Soup",
        "Lentil Soup",
        "Beans and Legumes",
        "Lentil Recipes",
        "Soup",
        "Sausage Recipes",
        "Kale",
        "Vegetable"
    ],
    "title": "Sausage, Kale, and Lentil Soup",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/sausage-kale-and-lentil-soup-recipe"
}
