{
    "directions": [
        "Preheat oven to 425°F. Unfold crust on work surface. Press together any cracks in dough to seal crust. Place crust in 9-inch-diameter tart pan with removable bottom; fold in excess dough and press, forming double-thick sides that extend about 1/4 inch above rim of pan. Pierce crust with fork. Bake crust 5 minutes; press with back of fork if crust bubbles up. Continue to bake until crust is golden brown, about 10 minutes. Set aside. Reduce oven temperature to 400°F.",
        "Meanwhile, sauté sausages in heavy medium skillet over medium-high heat until brown, breaking into small pieces with back of fork, about 6 minutes. Using slotted spoon, transfer sausage to large bowl; cool. Add mozzarella, salami, Parmesan, and basil. Toss sausage mixture to blend. Spoon sausage mixture into prepared crust. Beat eggs, milk, and nutmeg in medium bowl to blend; season with pepper. Pour custard over sausage mixture in crust.",
        "Bake tart until filling is set in center and golden brown on top, about 30 minutes. Let cool 10 minutes and serve."
    ],
    "ingredients": [
        "1 refrigerated pie crust (half of 15-ounce package), room temperature",
        "8 ounces Italian sweet sausages, casings removed",
        "3/4 cup coarsely grated mozzarella cheese (about 3 ounces)",
        "2/3 cup diced Italian salami (such as Genoa)",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup chopped fresh basil",
        "4 large eggs",
        "1/2 cup whole milk",
        "1/8 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Pork",
        "Bake",
        "Cocktail Party",
        "Super Bowl",
        "Quick & Easy",
        "Lunch",
        "Mozzarella",
        "Parmesan",
        "Basil",
        "Sausage",
        "Winter",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sausage, Salami, and Mozzarella Tart",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-salami-and-mozzarella-tart-104926"
}
