{
    "directions": [
        "In a medium skillet cook sausages in oil over moderate heat, turning them, until browned on all sides and cooked through, about 8 minutes, and transfer to paper towels to drain.",
        "In fat remaining in skillet cook onions and garlic, stirring, until golden, and stir in herbs (including bay leaf), scallions or parsley, tomatoes with juice, and salt and pepper to taste. Boil mixture, stirring, 5 minutes. Cut sausage into 1/4-inch-thick slices. Add sausage and beans to tomato mixture and cook, stirring, until heated through. Discard bay leaf and keep \"cassoulet\" warm, covered.",
        "In a small skillet heat oil over moderately high heat until hot but not smoking and sauté bread until pale golden. Stir in garlic, parsley, and salt and pepper to taste and sauté, stirring, 1 minute.",
        "Transfer \"cassoulet\" to a 1-quart serving dish and cover evenly with topping."
    ],
    "ingredients": [
        "4 sweet Italian sausage links (about 10 ounces total), skins pricked all over with a fork",
        "1 teaspoon olive oil",
        "2 medium onions, halves and sliced thin lengthwise (about 1 1/2 cups)",
        "2 garlic cloves, chopped fine",
        "1 1/2 teaspoon mixed chopped fresh herbs such as rosemary, thyme, and/or sage or 3/4 teaspoon mixed dried herbs, crumbled",
        "1 bay leaf",
        "1/2 cup chopped scallion greens or fresh parsley (wash and dry before chopping)",
        "a 14 1/2-ounce can diced tomatoes including juice",
        "19-ounce can white beans such as cannellini, navy, or Great Northern, drained and rinsed",
        "1 tablespoon olive oil",
        "2 slices firm white sandwich bread, crusts discarded, cut into 1/4-inch dice",
        "1 small garlic clove, chopped fine",
        "2 tablespoons finely chopped fresh parsley leaves (wash and dry before chopping)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Casserole/Gratin",
        "Sausage",
        "Winter",
        "Parsley",
        "Gourmet"
    ],
    "title": "Sausage and White Bean \"Cassoulet\"",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-white-bean-cassoulet-14292"
}
