{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 9x13 inch baking dish.",
        "Place the cubed cornbread and bread stuffing mix into a large bowl. Set aside.",
        "Place the chopped sausage links and ground sausage in a skillet; cook and stir over medium-high heat until evenly browned. Drain, and place sausage into a bowl. Using the same skillet, cook the bacon over medium heat until evenly browned. Drain bacon on paper towels. Drain excess bacon fat from the skillet. Stir the cooked sausage and bacon into the cornbread mixture.",
        "Using the same skillet, cook the celery and onion over medium heat until transparent and tender, about 5 minutes. Stir into the cornbread mixture.",
        "Stir the mushrooms, parsley, and apples into the cornbread mixture. Season with salt, pepper, and sage. Pour enough chicken broth over the cornbread mixture to moisten thoroughly, and toss to distribute evenly. Spoon the mixture into the prepared baking dish.",
        "Bake in preheated oven until top is toasted and the center is firm, about 45 minutes."
    ],
    "ingredients": [
        "1 (9x9 inch) pan cornbread, cut into small cubes",
        "1 (14 ounce) package dry bread stuffing mix",
        "8 ounces pork sausage links, finely chopped",
        "1 pound bulk pork sausage",
        "1/2 pound bacon slices, chopped",
        "1 cup chopped celery",
        "1 cup chopped onion",
        "1 (16 ounce) package mushrooms, sliced",
        "1 cup chopped fresh parsley",
        "2 Granny Smith apples - peeled, cored and chopped",
        "1 pinch salt and ground black pepper to taste",
        "1 tablespoon dried sage leaves, or amount to taste",
        "2 (13.75 ounce) cans chicken broth, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sausage, Bacon, Apple and Cornbread Stuffing",
    "url": "http://allrecipes.com/recipe/149276/sausage-bacon-apple-and-cornbread-s/"
}
