{
    "directions": [
        "Preheat oven to 350°F. Spray rimmed baking sheet with nonstick spray. Scatter squash on sheet in single layer; sprinkle lightly with salt and pepper. Roast squash until tender, stirring occasionally, about 55 minutes. Transfer to large bowl; cool.",
        "Melt butter in heavy large skillet over medium heat. Add onions, celery, and fennel. Sauté 8 minutes. Add sausage. Sauté until vegetables are tender and sausage is cooked through, breaking up sausage with fork, about 10 minutes. Add all herbs; sauté 1 minute longer. Add to bowl with squash. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill.",
        "Preheat oven to 350°F. Divide bread between 2 rimmed baking sheets. Bake until bread is crusty but not hard, reversing sheets after 5 minutes, 10 to 12 minutes total. Transfer to very large bowl and cool.",
        "Butter 13x9x2-inch baking dish. vegetable mixture into bread. Whisk salt, and pepper in small bowl to blend whisk in 1 cup broth. Add egg mixture stuffing, tossing to combine evenly and adding more broth by 1/4 cupfuls if dry. Transfer stuffing to prepared dish.",
        "Bake stuffing uncovered until cooked through and brown and crusty on top, 60 minutes. Let stand 10 minutes."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 cups 1/2- to 3/4-inch cubes peeled seeded butternut squash (from one 13/4-pound squash)",
        "1/2 cup (1 stick) unsalted butter",
        "3 cups chopped onions (about 1 pound)",
        "2 cups chopped celery (4 to 5 stalks)",
        "1 1/2 cups coarsely chopped fresh fennel bulb (about 1 medium)",
        "1 1-pound pork sausage log",
        "1/4 cup chopped fresh Italian parsley",
        "2 tablespoons chopped fresh sage",
        "2 tablespoons chopped fresh marjoram",
        "12 cups (generous) 1-inch cubes day-old pain rustique or ciabatta bread with crust (about 1 1/4 pounds)",
        "2 large eggs",
        "1 1/2 teaspoons fine sea salt",
        "1 teaspoon coarsely ground black pepper",
        "1 cup (or more) low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Stuffing/Dressing",
        "Sausage",
        "Fennel",
        "Squash",
        "Butternut Squash",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sausage Stuffing with Fennel and Roasted Squash",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-stuffing-with-fennel-and-roasted-squash-350469"
}
