{
    "directions": [
        "In a large skillet cook the sausage meat over moderately high heat, stirring and breaking up any large pieces, until it is cooked through and browned, transfer it to a fine sieve, and let it drain. In the skillet cook the onion and the garlic in the unsalted butter over moderately low heat until the onion is softened, add the mushrooms, and cook the mixture over moderate heat, stirring occasionally, until all the liquid the mushrooms give off is evaporated. Add the cumin, the allspice and the mint and cook the mixture, stirring, for 2 minutes. Transfer the mixture to a bowl and stir in the parsley, the cream cheese, and salt and pepper to taste.",
        "Working quickly to keep the phyllo from drying out, put 1 sheet of phyllo on a wok surface, brush it lightly with some of the clarified butter, and sprinkle it with 1 tablespoon of the bread crumbs. Lay another sheet of phyllo on top of the first sheet and brush it lightly with some of the remaining clarified butter. Cut the sheets into thirds lengthwise and into quarters crosswise to for 12 squares. Put a rounded teaspoon of the filling in each square, gather the corners of the phyllo over the filling, and twist the phyllo gently to seal it. Continue to make hors d'oeuvres in the same manner with the remaining phyllo, butter, crumbs and filling. Bake the hors d'oeuvres in jelly-roll pans in a preheated 400°F. oven for 10 to 12 minutes, or until the phyllo is golden brown."
    ],
    "ingredients": [
        "1/2 pound pork sausage meat, crumbled",
        "1 small onion minced",
        "1 garlic clove, minced",
        "1 tablespoon unsalted butter",
        "1/2 pound mushrooms, chopped fine",
        "1/2 teaspoon ground cumin",
        "a pinch of allspice",
        "1/2 teaspoon dried mint, crumbled",
        "1/4 cup minced fresh parsley leaves",
        "2 ounces cream cheese, softened",
        "four 16-by 12-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened dish towel",
        "1/4 cup clarified butter",
        "2 tablespoons fine fresh bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "Bake",
        "Cocktail Party",
        "Sausage",
        "Gourmet"
    ],
    "title": "Sausage and Mushroom Phyllo Twists",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-mushroom-phyllo-twists-101565"
}
