{
    "directions": [
        "Preheat oven to 325° F.",
        "Cut corn bread into 1/2-inch cubes and in 2 large shallow baking pans bake in middle of oven until just dry, about 20 minutes. Transfer corn bread from 1 pan to a large bowl and in pan toast pecans in oven until insides are golden, 10 to 20 minutes.",
        "Halve leeks lengthwise and then cut crosswise into 1/2-inch pieces. In a bowl of cold water wash leeks well and lift from water into a sieve to drain. Chop celery. In a 12-inch skillet cook leeks and celery in butter with salt and pepper to taste over moderately low heat, stirring, until leeks are tender, about 25 minutes. Remove sausage from casings and break into small pieces. Add sausage to leek mixture and cook over moderate heat, stirring occasionally, 5 minutes, or until sausage is cooked through.",
        "In a small heavy saucepan cook cranberries with sugar over moderately high heat, stirring, 5 minutes, or until some begin to burst. Chop parsley.",
        "To bowl of corn bread add remaining corn bread cubes, pecans, sausage mixture, cranberries, parsley, broth, and salt and pepper to taste and toss together. Cool stuffing completely. Stuffing may be made up to this point 1 day ahead and chilled, covered. Bring stuffing to room temperature before proceeding.",
        "Any frozen poultry destined for stuffing should be completely thawed, and the stuffing itself brought to room temperature before it's put into the turkey. Do not stuff your bird the night before you cook it; such a seeming time-saver can have dangerous results. Instead, it is best to loosely fill the bird's neck and body cavities immediately before roasting. And always use a meat or instant-read thermometer: The meat is done when the temperature of the thickest part of the thigh (be careful not to touch the bones) reaches 180°F.; the stuffing baked inside the bird is done at 160°-165°F. After roasting, let your stuffed poultry stand 15 to 20 minutes, a double assurance that the requisite temperatures for food safety have been reached.",
        "In a shallow baking dish bake stuffing in preheated 325° F. oven 1 hour (for moist stuffing, bake covered entire time; for less moist stuffing with a slightly crisp top, uncover halfway through baking time)."
    ],
    "ingredients": [
        "1 1/2 loavesCorn Bread",
        "2 cups pecans",
        "7 leeks (about 1 pound; white and pale green parts only)",
        "3 celery ribs",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1/2 pound sweet Italian sausage (about 3 links)",
        "2 cups fresh or unthawed frozen cranberries",
        "1/4 cup sugar",
        "1/2 cup packed fresh flat-leafed parsley leaves",
        "2 cups chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Cranberry",
        "Sausage",
        "Cornmeal",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sausage, Cranberry, and Corn Bread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-cranberry-and-corn-bread-stuffing-14452"
}
