{
    "directions": [
        "Place sauerkraut in large bowl. Fill bowl with enough cold water to cover; soak 30 minutes. Drain.",
        "Preheat oven to 350°F. Cook bacon in heavy large Dutch oven over medium-high heat until brown and almost crisp, about 5 minutes. Using slotted spoon, transfer bacon to paper towels. Add pork chops to Dutch oven; cook over medium-high heat until golden, about 6 minutes per side. Transfer to plate. Add sausages to Dutch oven; stir until golden, about 3 minutes. Transfer to plate with pork chops. Reduce heat to medium. Add onions and carrots to Dutch oven and sauté until tender, about 8 minutes.",
        "Add broth, wine, sauerkraut, and bacon to Dutch oven; stir to blend. Cover and bake 45 minutes.",
        "Mix apricots and prunes into sauerkraut. Arrange pork chops and sausages over sauerkraut. Cover Dutch oven; bake until chops are cooked through and most of liquid is absorbed, about 30 minutes. Serve hot, passing mustards separately."
    ],
    "ingredients": [
        "1 2-pound jar sauerkraut, drained",
        "5 bacon slices, chopped",
        "4 pork loin chops (each about 1 1/4 inches thick)",
        "4 assorted fully cooked sausages (such as bratwurst and knockwurst)",
        "2 cups chopped onions",
        "1 cup chopped carrots",
        "2 1/2 cups canned chicken broth",
        "1 cup dry white wine",
        "1/2 cup quartered dried apricots (about 3 ounces)",
        "1/2 cup quartered prunes (about 3 1/2 ounces)",
        "Assorted mustards"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Sauté",
        "Dinner",
        "Prune",
        "Apricot",
        "Bacon",
        "Pork Chop",
        "Sausage",
        "Oktoberfest",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sausages and Pork Chops Baked with Fruited Sauerkraut",
    "url": "http://www.epicurious.com/recipes/food/views/sausages-and-pork-chops-baked-with-fruited-sauerkraut-866"
}
