{
    "directions": [
        "Preheat oven to 375°F and butter a 3- to 4-quart shallow baking dish. Cut bread into 1/2-inch cubes. In 2 shallow baking pans arrange bread in one layer and toast in upper and lower thirds of oven until golden, 10 to 15 minutes.",
        "Quarter kielbasa lengthwise and cut crosswise into 1/4-inch-thick pieces. Chop onions and celery and mince garlic. In a large heavy skillet brown kielbasa over moderate heat, stirring occasionally, and transfer with a slotted spoon to paper towels to drain. To skillet add 6 tablespoons butter (do not discard any fat in skillet) and cook onions, celery, and garlic over moderately low heat, stirring, until celery is crisp-tender.",
        "Finely chop apples. Stir apples into vegetable mixture and cook, stirring occasionally, until apple is softened. Mince parsley. In a large bowl toss together bread, kielbasa, vegetable mixture, parsley, broth, and salt and pepper to taste and transfer to baking dish. Stuffing may be made 1 day ahead and cooled completely before being chilled, covered.",
        "Dot stuffing with remaining 2 tablespoons butter and bake, uncovered, in middle of oven until golden, about 30 minutes. (Stuffing may be baked while making gravy for roast goose)"
    ],
    "ingredients": [
        "12 light rye bread slices (about 1 pound)",
        "1 pound smoked kielbasa (not low-fat)",
        "2 onions",
        "2 celery ribs",
        "1 large garlic clove",
        "1 stick (1/2 cup) unsalted butter",
        "2 Granny Smith apples",
        "1 cup packed fresh flat-leafed parsley leaves",
        "2 cups chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Pork",
        "Side",
        "Bake",
        "Christmas",
        "Apple",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sausage, Apple and Rye-Bread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-apple-and-rye-bread-stuffing-14540"
}
