{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "Combine 1 cup flour, undissolved yeast, sugar and salt in a large bowl.  Add very warm water and oil; mix until well blended, about 1 minute.  Gradually add enough remaining flour to make a soft dough.  Dough should form a ball and will be slightly sticky. Knead** on a floured surface, adding additional flour if necessary, until smooth and elastic, about 4 minutes.  Cover and let rest on floured surface while preparing filling.",
        "Cook sausage in skillet over medium-high heat until cooked through; remove from skillet and drain excess fat.  Add spinach and water to skillet; saute 1 to 2 minutes until spinach is wilted; drain.  Return sausage to pan.",
        "Combine ricotta, mozzarella and egg in a mixing bowl.  Stir in Italian herb seasoning, crushed red pepper and garlic salt; set aside.",
        "To make calzones divide dough into four portions.  Roll 1 portion into an 8-inch circle on a floured surface. Spread approximately 1/3 cup ricotta mixture in center bottom half of dough.  Top with heaping 1/3 cup sausage spinach mixture leaving outer 1/2-inch free of filling. Fold top half of dough over filling.  Pull edge of lower crust over top; folding and pressing layers together to form a seal.  Carefully transfer to greased baking sheet.  Cut 3 to 4 vents in top.  Repeat with remaining dough.  Bake for 15 to 20 minutes until lightly browned.  Transfer to cooling rack to keep bottom crust crisp while cooling slightly.  Serve with pizza sauce or other sauce for dipping."
    ],
    "ingredients": [
        "Crust:",
        "1 1/2 cups all-purpose flour, or more if needed",
        "1 envelope Fleischmann's® Pizza Crust Yeast",
        "1 teaspoon sugar",
        "3/4 teaspoon salt",
        "2/3 cup very warm water (120 degrees to 130 degrees F)*",
        "1 tablespoon vegetable oil",
        "Filling:",
        "8 ounces Italian sausage",
        "2 cups fresh spinach leaves",
        "1/4 cup water",
        "3/4 cup ricotta cheese",
        "3/4 cup shredded mozzarella cheese",
        "1 egg",
        "1 teaspoon Spice Islands® Italian Herb Seasoning",
        "1/2 teaspoon Spice Islands® Crushed Red Pepper",
        "1/2 teaspoon Spice Islands® Garlic Salt",
        "Pizza sauce OR marinara sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sausage, Spinach and Ricotta Calzone",
    "url": "http://allrecipes.com/recipe/215381/sausage-spinach-and-ricotta-calzone/"
}
