{
    "directions": [
        "1. Preheat the oven to 350 degrees F. In a small pot bring the tomatoes, wine, whole basil sprigs, garlic, red pepper flakes, and salt and pepper, to taste, to a simmer; cook until slightly thickened, 10 minutes; set aside.",
        "2. Meanwhile, puree the cottage cheese in the bowl of a food processor until smooth. add the ricotta, spinach, 1/4 cup chopped basil, scallions, nutmeg, and salt and pepper and pulse until just combined; set aside.",
        "3. Coat a large nonstick skillet with nonstick cooking spray set over medium heat. Cook the sausage and onion, breaking it up with a wooden spoon into small pieces, until the meat is browned and the onion tender, 10 minutes.",
        "4. Assemble the lasagna: Mist a 9-inch by 13-inch baking dish with nonstick cooking spray. Spread 1/2 cup tomato sauce on the bottom of the prepared baking dish. Top with 3 noodles, half the ricotta mixture, half the sausage and 1/2 cup shredded mozzarella cheese. Repeat layers with sauce, noodles, remaining ricotta and sausage and 1/2 cup mozzarella cheese. Top with remaining noodles and sauce. Cover with aluminum foil and bake until the noodles are tender and the sauce is bubbling around the edges of the pan, 1 hour.",
        "5. Uncover, sprinkle with remaining mozzarella cheese and continue to bake until melted, 10 minutes. Let stand 15 minutes. Sprinkle with remaining 1/4 cup basil. Serve."
    ],
    "ingredients": [
        "1 (28-ounce) can crushed tomatoes",
        "1/4 cup dry red wine",
        "1/2 cup chopped fresh basil leaves, plus 2 whole sprigs",
        "2 cloves garlic, minced",
        "Pinch crushed red pepper flakes",
        "Kosher salt and freshly ground black pepper",
        "1 (16-ounce) container 1 percent low-fat cottage cheese",
        "1 (15-ounce) container part-skim ricotta cheese",
        "1 (10-ounce) box frozen chopped spinach, thawed and squeezed dry",
        "2 scallions, chopped",
        "1/4 teaspoon freshly grated nutmeg",
        "8 ounces lean sweet Italian-style turkey sausage, casings removed",
        "1/2 cup finely chopped onion",
        "9 sheets no-boil lasagna noodles, 5 1/2-ounces, (recommended: Barilla)",
        "1 1/2 cups part-skim shredded mozzarella cheese, 6 ounces"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pasta Recipes",
        "Lasagna Recipes",
        "Cheese",
        "Ricotta",
        "Sausage Recipes",
        "Main Dish Recipes"
    ],
    "title": "Sausage Lasagna",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/sausage-lasagna-recipe"
}
