{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 450°F. Lightly flour 2 baking sheets. Place dough on work surface; let stand until room temperature, about 20 minutes. Divide dough in half. Press and stretch each piece out on lightly floured surface to 5-inch round. Sprinkle each with 1/3 cup Piave cheese, 3/4 teaspoon rosemary, and 1/4 teaspoon crushed red pepper; sprinkle with coarse salt. Roll each piece of dough out to 10-inch round, pressing in seasonings. Transfer dough rounds to prepared baking sheets.",
        "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add sausage. Sauté until brown, breaking into 1/2-inch pieces with back of spoon, about 5 minutes. Using slotted spoon, transfer sausage to bowl. Add onion to skillet. Sauté until crisp-tender, about 2 minutes; transfer to plate. Add remaining 1/2 tablespoon oil to skillet. Add mushrooms and remaining 3/4 teaspoon rosemary; sprinkle with salt and pepper. Sauté until brown, about 5 minutes. Leaving 1/2-inch plain border, top each dough round with 3/4 cup mozzarella, then onion, sausage, and mushrooms.",
        "Bake until crust bottoms are crisp and brown, reversing sheets after 10 minutes, about 20 minutes total. Using large spatula, transfer pizzas to work surface. Sprinkle each with 2 tablespoons mozzarella, then parsley, if desired.",
        "Pizza-wheel cutters can drag toppings, so use a large chef's knife to cut pizzas into wedges."
    ],
    "ingredients": [
        "1 16-ounce ball purchased fresh pizza dough",
        "2/3 cup finely grated Piave or Parmesan cheese",
        "2 1/4 teaspoons finely chopped fresh rosemary, divided",
        "1/2 teaspoon dried crushed red pepper",
        "Coarse kosher salt",
        "1 1/2 tablespoons olive oil, divided",
        "2 1/2 hot Italian sausages, casings removed",
        "1 small red onion, thinly sliced",
        "7 ounces fresh wild mushrooms (such as stemmed shiitake, oyster, and chanterelle), thickly sliced",
        "1 3/4 cups coarsely grated whole-milk mozzarella cheese (about 7 ounces), divided",
        "Chopped fresh parsley (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Onion",
        "Bake",
        "Kid-Friendly",
        "Mozzarella",
        "Parmesan",
        "Sausage",
        "Fall"
    ],
    "title": "Sausage, Red Onion, and Wild Mushroom Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-red-onion-and-wild-mushroom-pizza-231717"
}
