{
    "directions": [
        "Bring sugar and 1/4 cup water to a boil in a 10-inch heavy skillet, stirring until sugar is dissolved and washing down any sugar crystals on side of skillet with a pastry brush dipped in cold water. Boil syrup, without stirring, gently swirling skillet, until mixture is a deep golden caramel.",
        "Carefully stir in vinegar (mixture will steam vigorously and caramel will harden). Remove from heat and stir until caramel is dissolved, about 30 seconds. Transfer to a heatproof cup and reserve skillet (do not clean skillet).",
        "Peel pears, quarter lengthwise, and core. Toss with 1 teaspoon lemon juice.",
        "Add 1/4 cup water, butter, and shallots to reserved skillet, then cook, uncovered, over moderate heat, stirring occasionally, until liquid is evaporated and shallots begin to brown, about 5 minutes.",
        "Add pears and cook, turning occasionally, until golden brown but not soft, about 6 minutes.",
        "Stir in caramel, salt, and pepper, then cook 1 minute. Remove from heat and stir in remaining 1/2 teaspoon lemon juice.",
        "While pears and shallots are sautéing, cook sausages in oil and remaining 1/4 cup water in a 12-inch heavy skillet, covered, over moderate heat, 5 minutes.",
        "Remove lid from skillet and cook sausages, turning occasionally, until liquid is evaporated and sausages are browned and cooked through, about 6 to 12 minutes more. Serve sausages with shallots and pears."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "3/4 cup water",
        "1/4 cup Sherry vinegar",
        "2 firm-ripe Bosc pears",
        "1 1/2 teaspoons fresh lemon juice",
        "1 tablespoon unsalted butter",
        "3 large shallots, quartered lengthwise",
        "1/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "1 1/2 pound fresh pork sausages (4 to 8 links)",
        "1 tablespoon vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Pear",
        "Meat",
        "Sausage",
        "Sherry",
        "Fall",
        "Shallot",
        "Gourmet"
    ],
    "title": "Sausages with Sherry Caramel Glazed Pears",
    "url": "http://www.epicurious.com/recipes/food/views/sausages-with-sherry-caramel-glazed-pears-235754"
}
