{
    "directions": [
        "Preheat oven to 325°F.",
        "Spread bread crumbs in 2 shallow baking pans and bake in upper and lower thirds of oven until golden and dry, about 15 minutes. Cool crumbs in pans on racks, then transfer to a large bowl.",
        "Cook sausage in a dry 12-inch nonstick skillet over moderate heat, stirring and breaking up pieces with a fork, until browned and cooked through, 6 to 8 minutes. Transfer to bowl with bread crumbs with a slotted spoon.",
        "Melt 6 tablespoons butter in skillet over moderate heat, then add onions, fennel bulb, salt, and pepper and cook, stirring frequently, until vegetables are softened, 10 to 15 minutes.",
        "Finely grind fennel seeds in coffee/spice grinder, then add to vegetables in skillet along with thyme and tarragon and cook, stirring, 1 minute.",
        "Transfer vegetables to bowl with bread crumbs and sausage and toss gently but thoroughly. Spoon stuffing into a buttered 3- to 3 1/2-quart shallow baking dish. Drizzle with stock and dot with remaining 2 tablespoons butter, cut into bits. Bake, covered, in middle of oven 30 minutes, then uncover and bake until browned, about 30 minutes more."
    ],
    "ingredients": [
        "7 cups coarsely crumbled buttermilk corn bread",
        "1 lb sweet Italian sausage, casings discarded",
        "1 stick (1/2 cup) unsalted butter",
        "2 medium onions, finely chopped (2 cups)",
        "1 1/2 lb fennel (sometimes called anise; 2 medium), stalks cut off and discarded and bulbs coarsely chopped",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 teaspoons fennel seeds",
        "2 teaspoons dried thyme, crumbled",
        "2 teaspoons dried tarragon, crumbled",
        "1 cup turkey giblet stock or low-sodium chicken broth",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pork",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Sausage",
        "Fennel",
        "Fall",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sausage Fennel Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-fennel-stuffing-107373"
}
