{
    "directions": [
        "In a small bowl soak tomatoes in boiling water 30 minutes and drain in a sieve set over a bowl, reserving soaking liquid. Chop tomatoes fine.",
        "In a large non-stick skillet cook onions in 1 1/2 tablespoons oil over moderate heat, stirring, until soft. Add sausage, stirring to break up, and simmer 5 minutes. Discard excess fat.",
        "In a saucepan melt butter over moderately low heat and whisk in flour until smooth. Cook roux, whisking, 3 minutes. Add reserved soaking liquid and milk in a stream, whisking, and salt and pepper to taste and simmer, whisking occasionally, 5 minutes, or until thick. Stir in sausage mixture and tomatoes. Sausage sauce may be made 3 days ahead, cooled completely, and chilled, covered.",
        "In cleaned skillet heat remaining 1 1/2 tablespoons oil over moderately high heat until hot but not smoking and sauté broccoli rabe, stirring, until wilted. Add 1/4 cup water and salt and pepper to taste and simmer, covered partially, until broccoli rabe is crisp-tender and almost all liquid is evaporated, about 2 minutes. Remove skillet from heat and remove lid.",
        "Preheat oven to 375°F.",
        "Pour 1 cup sausage sauce into a baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagne sheets, making sure they do not touch each other. Stir broccoli rabe into remaining sausage sauce. Spread about 1 1/2 cups sausage broccoli rabe sauce over pasta and sprinkle with 3/4 cup mozzarella . Make 2 more layers in same manner, beginning and ending with pasta. Spread tomato sauce over pasta, making sure pasta is completely covered, and sprinkle with remaining mozzarella.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling. Let lasagne stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 1/2 ounces (1/2 cup packed) dried tomatoes (not packed in oil)",
        "1 1/4 cups boiling water",
        "2 large onions, chopped",
        "3 tablespoons olive oil",
        "1 1/2 pounds hot Italian sausage, casings discarded",
        "2 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "1 cup milk",
        "1 pound broccoli rabe, tough and hollow stems discarded and leaves chopped (about 9 cups)",
        "twelve 7- by 3 1/2-inch sheets dry no-boil lasagne pasta",
        "10 ounces mozzarella, grated (about 2 1/2 cups)",
        "1 1/2 cups Rich Winter Tomato Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Bake",
        "Winter",
        "Gourmet"
    ],
    "title": "Sausage, Broccoli Rabe, and Tomato Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-broccoli-rabe-and-tomato-lasagne-13505"
}
