{
    "directions": [
        "Heat oil in a large Dutch oven or other heavy pot over medium-high. Fry rosemary, turning, until crisp, about 2 minutes. Transfer to paper towels to drain.",
        "Add sausage to same pot and cook, breaking up with a wooden spoon and stirring occasionally, until browned and cooked through, 8–10 minutes. Transfer with a slotted spoon to a plate.",
        "Add chickpeas to pot and cook, tossing occasionally and mashing some chickpeas with spoon, until browned in spots, about 5 minutes. Transfer about half of chickpeas to plate with sausage. Add wine to pot, bring to a boil, and cook until liquid is almost completely evaporated, about 2 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.",
        "Using a spider or a slotted spoon, transfer pasta to pot with chickpeas and add escarole and 1 cup pasta cooking liquid. Cook, tossing often, until escarole is wilted, pasta is al dente, and sauce is thickened, about 4 minutes. Add another 1/4 cup pasta cooking liquid, then gradually add 1/2 cup cheese, tossing until melted and dissolved into a luxurious, glossy sauce. Thin with more pasta cooking liquid if needed. Season with pepper, and more salt if needed. Add butter and toss to combine, then mix in reserved sausage and chickpeas.",
        "Divide pasta among bowls. Crumble rosemary over top and sprinkle with remaining 1/4 cup cheese."
    ],
    "ingredients": [
        "1/3 cup olive oil",
        "2 sprigs rosemary",
        "8 ounces spicy Italian sausage, casings removed",
        "1 (15.5-ounce) can chickpeas or cannellini (white kidney) beans, rinsed, patted dry",
        "1/4 cup dry white wine",
        "12 ounces paccheri, rigatoni, or other large tubular pasta",
        "Kosher salt",
        "8 cups (lightly packed) torn escarole, kale, or Swiss chard leaves",
        "3/4 cup finely grated Parmesan, divided",
        "Freshly ground black pepper",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sausage",
        "Chickpea",
        "Bean",
        "Rosemary",
        "Chard",
        "Escarole",
        "Parmesan"
    ],
    "title": "Sausage, Greens, and Beans Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-greens-and-beans-pasta"
}
