{
    "directions": [
        "In a heavy skillet measuring at least 12 inches across the top cook sausage over moderate heat, stirring and breaking it up, until cooked through and transfer with a slotted spoon to a bowl. Pour off all but 1 tablespoon fat from skillet and add 1 tablespoon oil, white mushrooms, and salt and pepper to taste. Cook white mushrooms over moderate heat, stirring, until all liquid given off is evaporated and add to sausage. Add remaining tablespoon oil to skillet and cook onion with garlic, rosemary, red pepper flakes, and salt and pepper to taste until softened. Stir in bell peppers and tomatoes and cook, covered, over moderately low heat, stirring occasionally, until peppers are very soft, about 20 minutes. In a blender or food processor purée tomato pepper mixture in batches, transferring to a large saucepan as puréed, and stir in vinegar. Add sausage mixture to sauce and simmer, uncovered, 5 minutes.",
        "Preheat oven to 375°F. and oil a 13- by 9-inch baking dish.",
        "In a small bowl soak porcini in the hot water 30 minutes and drain liquid through a sieve lined with a rinsed and squeezed paper towel into a measuring cup. reserve 1/2 cup soaking liquid and chop porcini fine. In a heavy saucepan melt butter over moderately low heat. Add flour and cook roux, whisking, 3 minutes. Add milk and reserved soaking liquid in a stream, whisking, and bring to a boil, whisking. Stir in porcini, nutmeg, and salt and pepper to taste and simmer over low heat, whisking occasionally, until thickened, about 5 minutes.",
        "In a large bowl of cold water soak lasagne squares until softened, about 15 minutes. Drain squares and pat dry between paper towels. In a small bowl toss together mozzarella and Parmesan. Spread enough red pepper tomato sauce in prepared dish to coat bottom. Over sauce in dish layer in this order: 2 lasagne sheets (cut to fit in one layer), a third wild mushroom mixture, a third cheese, and a third remaining red pepper tomato sauce. Repeat twice, reversing order of red pepper tomato sauce and cheese at end of last round of layering so that cheese is on top.",
        "Bake lasagne in middle of oven 35 to 40 minutes, or until golden, and let stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 pound hot and/or sweet Italian sausage, removed from casings",
        "2 tablespoons olive oil",
        "1 pound white mushrooms, sliced",
        "2 cups finely chopped onion",
        "3 large garlic cloves, minced",
        "3/4 teaspoon dried rosemary, crumbled",
        "a pinch dried hot pepper flakes",
        "4 red bell peppers, sliced thin",
        "2 pounds plum tomatoes, chopped",
        "2 tablespoons balsamic vinegar, or to taste",
        "1 1/2 ounce dried porcini mushrooms*",
        "1 1/2 cups hot water",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup all-purpose flour",
        "2 1/2 cups milk",
        "freshly grated nutmeg to taste",
        "six 7-inch squares instant (no-boil) lasagne*",
        "2 cups coarsely grated mozzarella cheese (about 8 ounces)",
        "2 cups freshly grated Parmesan cheese (about 6 ounces)",
        "*available at specialty foods shops and many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Pasta",
        "Pepper",
        "Tomato",
        "Bake",
        "Mozzarella",
        "Parmesan",
        "Sausage",
        "Winter",
        "Gourmet"
    ],
    "title": "Sausage and Wild Mushroom Lasagne with Red Pepper Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-wild-mushroom-lasagne-with-red-pepper-tomato-sauce-11626"
}
