{
    "directions": [
        "Preheat oven to 450 degrees F. Cover two large baking sheets with Reynolds Wrap(R) Heavy Duty Aluminum Foil. Sprinkle with cornmeal.",
        "Divide Whole Wheat Sesame Seed Dough or thawed pizza dough into 8 equal portions. Cover and let rest for 10 minutes.",
        "Roll each portion of dough on a lightly floured surface into a 6-inch circle. Transfer to prepared baking sheets. Prick the crusts with a fork. Do not let rise.",
        "Bake about 7 minutes or until light brown. In a small bowl, combine pizza sauce and crushed red pepper. Top each crust with pizza sauce, then with sausage and mushrooms. Sprinkle with Italian blend cheese. Bake 5 minutes more or until cheese melts. If desired, sprinkle with Parmesan cheese and/or fresh basil.",
        "Grilling: Line grill rack with heavy duty aluminum foil. Preheat grill; reduce heat to medium-hot. Brush tops of dough circles with 1 tablespoon olive oil. Place dough circles, oiled sides down, on foil-lined grill rack. Cover and grill about 1 minute or until bottom is browned and firm. Transfer dough circles to a clean surface, grilled side up. Top pizzas as directed above. Return assembled pizzas to the foil-lined grill rack. Cover and grill 2 to 3 minutes or until bottom is browned and cheese has melted, rearranging pizzas as necessary to assure even browning."
    ],
    "ingredients": [
        "2 tablespoons cornmeal",
        "2 pounds frozen pizza dough, thawed or Whole Wheat Sesame Dough (below)",
        "1/2 cup pizza sauce",
        "1/8 teaspoon crushed red pepper",
        "8 ounces bulk Italian sausage, cooked and drained",
        "1 cup thinly sliced fresh mushrooms",
        "8 ounces shredded Italian cheese blend",
        "Grated Parmesan cheese (optional)",
        "Snipped fresh basil (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sausage Mushroom Pizza",
    "url": "http://allrecipes.com/recipe/238759/sausage-mushroom-pizza/"
}
