{
    "directions": [
        "Place the sausages in a large nonstick skillet. Pierce the casings with a fork. Add 1-inch water to the pan. Bring liquid to a boil. Cover sausages, reduce heat and simmer 10 minutes.",
        "Heat a second skillet over medium high heat. Add oil, 2 turns of the pan. Add garlic, onion, cubanelle and red peppers. Season vegetables with salt and pepper.",
        "Drain sausages and return pan to stove, raising heat back to medium high. Add a drizzle of oil to the skillet, brown and crisp the casings. Remove sausages, slice into 2 inch pieces on an angle and set pieces back into the pan to sear.",
        "Split and toast the bread under broiler. Melt oil, butter together in small pan over medium heat. Add garlic and let it sizzle 1 or 2 minutes. Brush rolls with garlic butter and sprinkle with a little dried Italian seasoning blend.",
        "Combine the cooked peppers and onions to the sausages. Add hot peppers and hot pepper juice to the skillet. Toss and turn the sausage, peppers and onions, picking up all the drippings from the pan. Pile the meat and peppers into the garlic sub rolls and serve."
    ],
    "ingredients": [
        "3/4 pound sweet Italian sausage",
        "3/4 pound hot Italian sausage",
        "2 tablespoons extra virgin olive oil, 2 turns of the pan",
        "2 large cloves garlic, crushed",
        "1 large onion, thinly sliced",
        "2 cubanelle peppers (light green mild Italian peppers), seeded and thinly sliced",
        "1 red bell pepper, seeded and thinly sliced",
        "Salt and pepper",
        "2 or 3 jarred hot cherry peppers, banana peppers or pepperoncini, finely chopped",
        "3 tablespoons hot pepper juice, from the jar",
        "4 crusty, semolina submarine sandwich rolls, 8 inches, sesame seeded or plain",
        "1 tablespoon extra-virgin olive oil",
        "3 tablespoons butter",
        "1 large clove garlic",
        "1 1/2 teaspoons dried Italian seasoning, 1/2 a handful or 1/2 teaspoons each oregano, thyme, parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Skillet Recipes",
        "American",
        "Sandwich",
        "Cherry",
        "Fruit",
        "Dairy Recipes",
        "Meat",
        "Banana",
        "Vegetable",
        "Sausage Recipes",
        "Onion Recipes",
        "Pork",
        "4th of July",
        "Holiday",
        "Recipes for Parties",
        "Tailgate Party",
        "Super Bowl"
    ],
    "title": "Sausage, Pepper and Onion Hoagies",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/sausage-pepper-and-onion-hoagies-recipe"
}
