{
    "directions": [
        "In a large dry skillet over medium heat, lightly toast the caraway seeds until fragrant, 1 to 2 minutes. Scrape out and reserve seeds.",
        "Add 1 tablespoon oil to the skillet and heat over medium-high heat. Working in two to three batches, sear bok choy on all sides until lightly browned, 2 to 3 minutes per cut side. Add 1/4 teaspoon salt, 1/8 teaspoon pepper to each batch, and 1 teaspoon oil to sear each subsequent batch of bok choy.",
        "Add 1 teaspoon oil to the skillet and sauté apples with 1/4 teaspoon salt and 1/8 teaspoon pepper until softened but still holding their shape, 5 to 7 minutes. Reserve apples.",
        "Add remaining tablespoon oil to skillet and sear sausages on all sides until golden brown, 3 to 5 minutes per side. Add toasted caraway seeds, sauerkraut, and broth. Bring to a simmer, reduce heat to medium, cover the skillet, and simmer until sausages are cooked through (150°F for pork sausages, 160°F for poultry sausages), about 10 minutes. Remove cover and fold in reserved bok choy, apples, vinegar, and butter. Cook, tossing, until some of the liquid has evaporated and the bok choy and apples are warm, 3 to 5 minutes. Taste and adjust seasoning. Serve with mustard for dipping."
    ],
    "ingredients": [
        "1 teaspoon caraway seeds",
        "2 tablespoons plus 3 teaspoons vegetable oil, such as grapeseed, divided",
        "1 pound baby bok choy, heads trimmed and quartered lengthwise",
        "1 teaspoon kosher salt, divided",
        "1/2 teaspoon freshly ground black pepper, divided",
        "1 Honeycrisp or Gala apple, sliced into 1/4-inch wedges",
        "8 links fresh sausage (about 2 pounds), such as hot or sweet Italian sausage",
        "2 1/2 cups prepared sauerkraut, drained",
        "1/2 cup low-sodium chicken broth",
        "1 tablespoon cider vinegar",
        "1 tablespoon unsalted butter",
        "Grainy Dijon mustard, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Sausage",
        "Fall",
        "Winter",
        "Bok Choy",
        "Cabbage",
        "One-Pot Meal",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sausage with Sauerkraut, Apples, and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-with-sauerkraut-apples-and-bok-choy-51254430"
}
