{
    "directions": [
        "Place sun-dried tomatoes in medium bowl. Pour enough boiling water over to cover. Let stand until softened, about 15 minutes. Drain.",
        "Sauté sausages in heavy medium skillet over medium heat until cooked through, breaking up with back of spoon, about 5 minutes. Using slotted spoon, transfer sausage to paper towels and drain well.",
        "Butter 13x9x2-inch glass baking dish. Whisk milk, eggs, thyme, salt and pepper in large bowl to blend. Add sun-dried tomatoes, sausage, bread, onion and Parmesan cheese and stir to blend. Transfer to prepared dish. Cover and refrigerate at least 4 hours or overnight.",
        "Preheat oven to 375°F. Bake strata uncovered until puffed and golden brown, about 45 minutes. Sprinkle with mozzarella and goat cheese and bake until mozzarella melts, about 5 minutes. Transfer pan to rack and cool 5 minutes. Sprinkle with parsley."
    ],
    "ingredients": [
        "1/2 cup sun-dried tomatoes (not oil packed), chopped",
        "12 ounces hot Italian sausage, casing removed",
        "3 1/2 cups milk (do not use low-fat or nonfat)",
        "8 large eggs",
        "2 teaspoons minced fresh thyme or 3/4 teaspoon dried",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "11 slices white sandwich bread (about 1 pound), crusts trimmed, bread cut into 1-inch pieces",
        "1/2 cup chopped onion",
        "1/2 cup fresh grated Parmesan cheese (about 1 1/2 ounces)",
        "1 cup (packed) grated mozzarella cheese (about 4 ounces)",
        "1/4 cup crumbled soft fresh goat cheese (such as Montrachet)",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Tomato",
        "Brunch",
        "Bake",
        "Sauté",
        "Casserole/Gratin",
        "Sausage"
    ],
    "title": "Sausage and Cheese Strata with Sun-Dried Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/sausage-and-cheese-strata-with-sun-dried-tomatoes-1658"
}
