{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add onion; sauté until translucent, about 4 minutes. Add mushrooms; sauté until beginning to brown, about 3 minutes. Remove skillet from heat; add brandy. Carefully ignite; when flames subside, return to heat. Simmer until brandy is almost evaporated, about 1 minute. Add beef stock and chicken stock; boil 5 minutes. Add cream; boil until sauce coats spoon, about 14 minutes. Pour sauce into bowl; clean skillet.",
        "Place flour in shallow dish. Sprinkle veal cutlets with salt and pepper; coat with flour. Melt 2 tablespoons butter in same heavy large skillet over high heat. Add 3 veal cutlets to skillet and sauté until brown and cooked through, about 2 minutes per side. Transfer veal to plate. Repeat with remaining veal cutlets. Cover veal to keep warm.",
        "Melt remaining butter in same skillet. Add shrimp; sauté until just opaque in center, about 3 minutes. Pour sauce into skillet; stir until heated through, scraping up any browned bits. Divide veal among plates. Top with shrimp and sauce."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) unsalted butter",
        "1 red onion, halved, thinly sliced",
        "8 ounces shiitake mushrooms, stemmed, caps thinly sliced",
        "6 tablespoons brandy",
        "1 cup beef stock or canned beef broth",
        "1 cup chicken stock or canned low-salt chicken broth",
        "1 cup whipping cream",
        "All purpose flour",
        "6 4-ounce veal cutlets, each pounded to 1/4-inch thickness",
        "24 uncooked shrimp, peeled, deveined"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Shellfish",
        "Sauté",
        "Dinner",
        "Meat",
        "Veal",
        "Shrimp",
        "Fall",
        "Winter",
        "Anniversary",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sauteed Veal with Shrimp, Mushroom, and Brandy Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-veal-with-shrimp-mushroom-and-brandy-cream-sauce-106115"
}
