{
    "directions": [
        "Mix all ingredients except cilantro in medium bowl. Season with salt and pepper. Let stand at room temperature 1 hour. Stir in cilantro.",
        "Sprinkle chicken with salt and pepper. Place flour in wide shallow bowl. Dredge chicken in flour, shaking off excess. Place on baking sheet.",
        "Melt 1 tablespoon butter with 1 tablespoon oil in heavy large skillet over high heat. Add 3 chicken breast pieces to skillet and cook until brown and cooked through, about 3 minutes per side. Transfer to plate. Add remaining 1 tablespoon butter and 1 tablespoon oil to skillet and cook remaining chicken. Transfer to plate; tent chicken with foil to keep warm. Add broth to skillet and bring to boil, scraping up browned bits. Stir in pear nectar, mustard, and lemon juice. Boil until thick enough to coat spoon, about 4 minutes. Season to taste with salt and pepper. Place 1 chicken breast piece on each plate. Spoon sauce over. Divide salsa among plates."
    ],
    "ingredients": [
        "2 firm but ripe Anjou or Bosc pears (about 1 1/4 pounds total), peeled, cored, cut into 1/2-inch cubes",
        "1 cup finely diced seeded red bell pepper (about 1 large)",
        "1/2 cup finely chopped red onion",
        "1/4 cup finely chopped seeded jalapeo chiles (about 2 medium)",
        "1/4 cup fresh lemon juice",
        "3 tablespoons extra-virgin olive oil",
        "1/2 cup coarsely chopped fresh cilantro",
        "3 skinless boneless chicken breast halves (about 1 1/2 pounds total), halved horizontally",
        "1/2 cup all purpose flour",
        "2 tablespoons (1/4 stick) butter, divided",
        "2 tablespoons extra-virgin olive oil, divided",
        "2/3 cup low-salt chicken broth",
        "2/3 cup pear nectar",
        "1 tablespoon Dijon mustard",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Pear",
        "Bell Pepper",
        "Fall",
        "Cilantro"
    ],
    "title": "Sauteed Chicken Breasts with Pear, Bell Pepper, and Cilantro Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-chicken-breasts-with-pear-bell-pepper-and-cilantro-salsa-240090"
}
