{
    "directions": [
        "Mix first 5 ingredients in small bowl; cover gremolata and set aside. Heat heavy large skillet over medium-high heat. Add saffron and stir until slightly darker, about 30 seconds. Transfer to another small bowl; cool and crumble saffron. DO AHEAD: Gremolata and saffron can be made 2 hours ahead. Let stand at room temperature.",
        "Sprinkle chicken lightly with coarse salt and pepper. Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Working in batches and adding more oil as needed, cook chicken until lightly browned and just cooked through, about 2 minutes per side. Arrange chicken on platter; tent with foil.",
        "Add 1 tablespoon oil and butter to same skillet. Add white and green parts of onions and sauté until beginning to soften, about 4 minutes. Add asparagus. Sprinkle saffron over vegetables. Sprinkle with coarse salt and pepper and sauté 1 minute. Add broth, reduce heat to medium, and simmer uncovered until vegetables are tender and broth reduces and thickens to glaze, about 5 minutes. Stir in crème fraîche and gremolata. Season with salt and pepper. Using slotted spoon, transfer vegetables to platter, arranging around chicken. Drizzle sauce over chicken and serve."
    ],
    "ingredients": [
        "1/4 cup finely chopped fresh Italian parsley",
        "1 tablespoon finely chopped fresh tarragon",
        "1 tablespoon minced shallot",
        "2 teaspoons finely grated orange peel",
        "1/2 teaspoon finely grated lemon peel",
        "1/4 teaspoon (scant) saffron threads",
        "12 chicken cutlets (1/4 to 1/2 inch thick; about 2 pounds)",
        "Coarse kosher salt",
        "2 tablespoons (or more) extra-virgin olive oil, divided",
        "1 tablespoon butter",
        "3/4 pound spring onions or green onions (dark green parts discarded); white parts cut into 1/4-inch-thick slices, pale green parts cut into 1/2-inchthick slices (scant 2 cups)",
        "1 1/2 pounds slender asparagus, tops cut into 3-inch pieces, stems cut into 1/2-inch pieces",
        "3/4 cup low-salt chicken broth",
        "2 tablespoons crème fraîche or heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Orange",
        "Asparagus",
        "Spring",
        "Family Reunion",
        "Tarragon",
        "Parsley",
        "Green Onion/Scallion",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sauteéd Chicken Cutlets with Asparagus, Spring Onions, and Parsley-Tarragon Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-chicken-cutlets-with-asparagus-spring-onions-and-parsley-tarragon-gremolata-352069"
}
