{
    "directions": [
        "Place broccoli in a large microwave-safe glass baking dish. Add 1/2 cup water, wrap tightly with plastic, and microwave on high for 8 to 10 minutes, or until just done. Set aside.",
        "Place rice and remaining 3 1/2 cups water in an 8-cup glass measuring cup or microwave-safe bowl. (Rice doubles in size during cooking, so choose a container large enough to accommodate it when cooked. ) Microwave uncovered on high for 10 minutes. Microwave uncovered on medium-low for 15 minutes more. Or use the rice setting on your microwave if you have one. Do not stir at any time during the cooking process. Season with salt to taste. Fluff with a fork. Set aside.",
        "Heat peanut oil in a large nonstick pan over medium-high heat until hot but not smoking. Add onion and cook, stirring often, until crispy and just wilted, 3 to 4 minutes. Add beef and cook, stirring often, 3 to 4 minutes. Add garlic, ginger, brown sugar, curry powder, broth or water, and soy sauce. Bring to a boil, then reduce heat to a steady simmer. Cook, stirring often, until sauce has thickened slightly. Add broccoli and cook until just heated through. Serve immediately with rice.",
        "Yes, you can use chicken, pork, or shrimp instead of beef.",
        "Cauliflower, sliced red, green, and orange bell peppers, snow, snap, or sugar peas, green beans, bamboo shoots, and carrots are all great in this dish."
    ],
    "ingredients": [
        "1 pound broccoli, stems and heads cut into bite-size pieces",
        "4 cups water",
        "2 cups long-grain rice",
        "Coarse-grained salt",
        "1 teaspoon roasted peanut oil",
        "1 medium onion, very thinly sliced",
        "1 pound flank steak, very thinly sliced across the grain",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh ginger",
        "2 tablespoons light or dark brown sugar",
        "1 tablespoon curry powder",
        "1/2 cup low-sodium chicken or beef broth or water",
        "2 tablespoons low-sodium soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Onion",
        "Rice",
        "Sauté",
        "Quick & Easy",
        "Curry",
        "Broccoli",
        "Winter",
        "Soy Sauce"
    ],
    "title": "Sauteed Curried Beef and Broccoli",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-curried-beef-and-broccoli-109564"
}
