{
    "directions": [
        "In a small bowl whisk together well the mustard, the vinegar,",
        "2 tablespoons of the oil, and salt and pepper to taste. In a skillet (preferably non-stick) just large enough to hold the scallops in one layer heat the remaining 1 tablespoon oil over moderately high heat until it is hot but not smoking and in it sauté the scallops, patted dry and seasoned with salt and pepper, for 2 minutes on each side, or until they are just golden and cooked through. With a slotted spoon transfer the scallops to a bowl and keep them warm. To the skillet add the shallot and about 1 tablespoon of the vinaigrette and cook the mixture over moderate heat, stirring, until the shallot is softened. Remove the skillet from the heat, add the scallops, and shake the skillet to coat them with the vinaigrette. In another bowl toss the remaining vinaigrette with the watercress, the carrot, and the corn, divide the salad between 2 dinner plates, and arrange half the scallops around each salad."
    ],
    "ingredients": [
        "1/4 teaspoon Dijon-style mustard",
        "1 tablespoon balsamic vinegar",
        "3 tablespoons olive oil",
        "1/2 pound sea scallops",
        "2 tablespoons minced shallot",
        "1 large bunch of watercress, coarse stems discarded, rinsed and spun  dry (about 3 cups)",
        "1 carrot, shredded",
        "1/2 cup cooked fresh or thawed frozen corn kernels"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Shellfish",
        "Appetizer",
        "Sauté",
        "Quick & Easy",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sauteed Scallops with Watercress and Corn Salad",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-scallops-with-watercress-and-corn-salad-12084"
}
