{
    "directions": [
        "Sauté sausage in heavy large skillet over medium-high heat until brown, breaking sausage into pieces with fork, about 5 minutes. Using slotted spoon, transfer sausage to paper towels. Add mushrooms to skillet and sauté until golden brown, about 8 minutes. Season mushrooms to taste with salt and pepper. Transfer mushrooms to bowl. Heat 1 tablespoon olive oil in same skillet. Add leek and thyme and sauté until very soft, about 6 minutes. Season leek mixture to taste with salt and pepper. Remove from heat.",
        "Whisk 3 eggs and 1 1/2 teaspoons chopped rosemary in small bowl. Season with salt and pepper. Stir in half of leek mixture. Heat 1 1/2 teaspoons olive oil in 8-inch nonstick skillet over medium heat. Add egg mixture to skillet and swirl with rubber spatula. Cook until bottom of mixture is light brown and eggs are set on top, lifting sides of omelet to let uncooked egg flow under, about 3 minutes. Remove skillet from heat. Arrange half of sausage, mushrooms, peppers and cheese on 1/3 of omelet. Fold one side of omelet over filling and roll out onto heated plate. Garnish with rosemary sprig. Repeat with remaining mushrooms, peppers and cheese, forming second omelet."
    ],
    "ingredients": [
        "6 ounces hot Italian sausage, casings removed",
        "1 cup mushrooms (about 4 ounces), quartered",
        "2 tablespoons olive oil",
        "1 large leek, thinly sliced (white and pale green parts only)",
        "1/2 teaspoon dried thyme, crumbled",
        "6 eggs",
        "3 teaspoons chopped fresh rosemary or 1 1/2 teaspoons dried, crumbled",
        "1/2 cup sliced drained roasted red bell peppers (available in jars)",
        "1 cup grated provolone or Italian Fontina cheese (about 3 1/2 ounces)",
        "Fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Mushroom",
        "Pepper",
        "Pork",
        "Brunch",
        "Sauté",
        "Lunch",
        "Sausage",
        "Leek",
        "Oregon",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sauteed Leek and Sausage Omelet",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-leek-and-sausage-omelet-2688"
}
