{
    "directions": [
        "Sprinkle each quail with 1/2 teaspoon Worcestershire sauce, 1 teaspoon oil, thyme, and salt and pepper to taste and rub gently into cavity and skin. In a resealable plastic bag set in a shallow pan marinate quail, chilled, at least 4 hours or overnight.",
        "Preheat oven to 300°F. Line a plate with wax paper.",
        "Pat quail dry inside and out and in a shallow dish combine flour, paprika, and salt and pepper to taste. Dredge quail in mixture, 1 at a time, shaking off excess, and transfer to prepared plate.",
        "Heat a large heavy skillet (preferably cast iron) over moderately high heat until hot and add remaining 1 tablespoon oil and butter. Heat fat until foam begins to subside and sauté quail until golden brown and cooked through, about 3 to 5 minutes on each side. Transfer quail to a shallow baking pan and keep warm in oven.",
        "In fat remaining in skillet sauté mushrooms with garlic, stirring, until liquid mushrooms give off is evaporated and add broth, Port, and remaining 2 teaspoons Worcestershire sauce. Simmer sauce until thickened and reduced to about 3/4 cup, about 15 minutes, and stir in vinegar and salt and pepper to taste.",
        "On a cutting board halve quail and stir any quail juices from pan and board into sauce."
    ],
    "ingredients": [
        "4 semi-boneless quail*",
        "4 teaspoons Worcestershire sauce",
        "2 tablespoons plus 1 teaspoon olive oil",
        "1/4 teaspoon dried thyme, crumbled",
        "1 cup all-purpose flour",
        "2 tablespoons paprika",
        "1 tablespoon unsalted butter",
        "4 fresh large shiitake mushrooms, stems discarded and caps sliced thin",
        "1 small garlic clove, minced",
        "1 cup chicken broth",
        "1/4 cup Tawny Port",
        "1/4 teaspoon balsamic vinegar",
        "*available at butcher shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Game",
        "Mushroom",
        "Poultry",
        "Sauté",
        "Christmas",
        "Fall",
        "Gourmet"
    ],
    "title": "Sauteed Quail with Shiitake Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-quail-with-shiitake-port-sauce-10676"
}
