{
    "directions": [
        "Remove excess fat from duck breasts. Brush breasts with oil; sprinkle with 1/2 teaspoon thyme and pepper. Cover and let stand 1 hour. (Can be prepared 1 day ahead. Refrigerate.)",
        "Heat 1 tablespoon oil in heavy medium saucepan over medium-high heat. Add duck bones, chicken backs and onion and cook until brown, turning occasionally, about 12 minutes. Add both stocks. Bring to boil. Reduce heat and simmer until reduced to 3/4 cup liquid, about 1 hour. Strain and degrease duck stock. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Season duck breasts with salt; add to skillet skin side down and cook 4 minutes. Turn and cook about 2 minutes longer for medium-rare. Transfer to heated platter and tent with foil to keep warm.",
        "Pour off fat from skillet. Add 1 tablespoon butter to skillet and melt over medium heat. Add shallot and sauté until translucent, about 2 minutes. Add Port and figs. Increase heat and boil until liquid is reduced to glaze, scraping up any browned bits, about 4 minutes. Add duck stock and boil until syrupy, adding any juices accumulated on duck platter, about 6 minutes. Remove from heat and whisk in remaining 2 tablespoons butter 1 tablespoon at a time. Season with salt and pepper.",
        "Thinly slice duck on diagonal. Arrange on plates. Spoon sauce over. Sprinkle with 3/4 teaspoon thyme."
    ],
    "ingredients": [
        "2 large duck breast halves, boned (bones reserved)",
        "Olive oil",
        "1/2 teaspoon minced fresh thyme or dried, crumbled",
        "Freshly ground pepper",
        "2 tablespoons olive oil",
        "1 3/4 pounds chicken backs or wings",
        "1 onion, quartered",
        "1 cup beef stock or canned unsalted broth",
        "1 cup chicken stock or canned low-salt broth",
        "Salt",
        "3 tablespoons butter",
        "1 shallot, minced",
        "1/2 cup Port",
        "6 dried Calimyrna figs, stemmed and quartered",
        "3/4 teaspoon minced fresh thyme or 1/4 teaspoon dried, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Fruit",
        "Sauté",
        "New Year's Eve",
        "Fig",
        "Port",
        "Winter"
    ],
    "title": "Sauteed Duck Breast with Figs and Port",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-duck-breast-with-figs-and-port-1145"
}
