{
    "directions": [
        "Sprinkle chicken with salt and pepper. Melt 1 tablespoon butter with 1 tablespoon oil in large skillet over medium-high heat. Add chicken to skillet and cook until browned and cooked through, 5 to 6 minutes per side, depending on thickness. Transfer chicken to plate; cover to keep warm. Add shallot to same skillet; stir over medium-high heat 1 minute. Add wine, then broth to skillet; bring to boil. Whisk in mustard and chopped tarragon; boil until sauce thickens enough to coat spoon lightly and is reduced to scant 1/2 cup, 5 to 6 minutes. Stir in 1/2 tablespoon butter; set aside.",
        "Meanwhile, melt remaining 1 tablespoon butter with remaining 1 tablespoon oil in heavy medium skillet over medium-high heat. Add radishes; sprinkle with coarse salt and pepper; cook without stirring until radishes begin to brown, about 4 minutes. Continue to cook radishes until crisp-tender, stirring occasionally, 5 to 7 minutes longer.",
        "Cut chicken breast halves crosswise into 1/2-inch-thick slices; arrange on platter. Place radishes around and over chicken. Spoon sauce over chicken and radishes. Garnish with tarragon sprigs and serve."
    ],
    "ingredients": [
        "4 skinless boneless chicken breast halves",
        "Coarse kosher salt",
        "2 1/2 tablespoons butter, divided",
        "2 tablespoons olive oil, divided",
        "2 tablespoons minced shallot",
        "1/4 cup dry white wine",
        "1 cup low-salt chicken broth",
        "2 teaspoons Dijon mustard",
        "2 teaspoons chopped fresh tarragon",
        "2 bunches radishes (such as red, pink, purple, and white; about 20), trimmed of all but 1/2 inch of green tops, radishes halved lengthwise",
        "Fresh tarragon sprigs (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mustard",
        "Vegetable",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Radish",
        "Spring",
        "Pan-Fry",
        "Healthy",
        "Tarragon",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sautéed Chicken and Radishes with Mustard and Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-chicken-and-radishes-with-mustard-and-tarragon-364591"
}
