{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Cook bacon in a 4- to 5-quart wide heavy pot over moderate heat, stirring occasionally, until crisp, and transfer with a slotted spoon to paper towels to drain. Measure fat and, if less than 2 tablespoons, add enough vegetable oil to bring total to 2 tablespoons. Heat fat over moderately high heat until hot but not smoking, then cook onion, stirring occasionally, until it begins to turn golden, about 2 minutes. Add cabbage and turn with tongs until coated with fat. Stir in red-wine vinegar, water, sugar, caraway seeds, 3/4teaspoon salt, and 1/4 teaspoon pepper and braise cabbage over moderately low heat, covered, stirring occasionally, until tender, 25 to 35 minutes.",
        "Meanwhile, pat 2 pork chops dry and sprinkle both sides with 1/4 teaspoon salt and 1/4 teaspoon pepper (total). Heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown seasoned chops, turning over once, 5 minutes total, and transfer to a shallow baking pan (1 inch deep). Season remaining 2 chops and brown in oil remaining in skillet in same manner, transferring to baking pan. Roast chops in oven until thermometer inserted horizontally 2 inches into center of a chop (do not touch bone) registers 145°F, 5 to 8 minutes.",
        "Meanwhile, stir half of bacon into cabbage, then finely chop remaining bacon for sprinkling.",
        "Let chops stand in pan, loosely covered with foil, 5 minutes. Serve chops over cabbage, with any pan juices spooned over and sprinkled with bacon."
    ],
    "ingredients": [
        "6 bacon slices, chopped",
        "1 to 3 tablespoons vegetable oil",
        "1 medium onion, chopped",
        "1 small red cabbage (1 3/4 lb), halved lengthwise, cored, and sliced 1/4 inch thick",
        "1/4 cup red-wine vinegar",
        "3/4 cup water",
        "2 tablespoons sugar",
        "1/2 teaspoon caraway seeds",
        "1 1/4 teaspoons salt",
        "3/4 teaspoon black pepper",
        "4 (1-inch-thick) bone-in rib pork chops (2 1/2 to 3 lb total)",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Roast",
        "Dinner",
        "Meat",
        "Pork Chop",
        "Fall",
        "Oktoberfest",
        "Cabbage",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sauteed Pork Chops with Sweet-and-Sour Red Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-pork-chops-with-sweet-and-sour-red-cabbage-235750"
}
