{
    "directions": [
        "Bring a saucepan of lightly salted water to a boil over high heat. Add the fava beans and cook just until the outer skins loosen, about 2 minutes. Drain well and rinse under cold running water until cool. Pinch each bean to remove its tough outer skin. You should have about 3/4 cup beans. Coarsely chop the white and pale green bottoms of the green garlic and set aside. Thinly slice the green tops and set aside separately.",
        "Preheat an oven to 200°F.",
        "Using a flat meat pounder, pound each chicken breast half until flattened to an even thickness of about 3/4 inch. Season the chicken breasts with 1 tsp. salt and 1/2 tsp. pepper.",
        "In a large fry pan over medium-high heat, warm the olive oil until very hot but not smoking. Add the chicken breasts and cook, without moving them, until golden brown, 3 to 4 minutes. Turn them over and cook until golden brown underneath and the chicken springs back when pressed in the center, about 4 minutes more. Transfer to a rimmed baking sheet and keep warm in the oven.",
        "Pour off the fat from the fry pan. Set the pan over medium-high heat and melt 1 Tbs. of the butter. Add the green garlic bottoms and sauté until wilted, about 1 minute. Add the wine and cook, scraping up the browned bits from the pan bottom, until almost evaporated, about 30 seconds. Add the fava beans and 1/4 cup of the broth, cover and cook, stirring occasionally, until tender, about 3 minutes. Stir in the remaining 1/2 cup broth and bring to a boil. Remove from the heat and stir in the remaining 1 Tbs. butter. Adjust the seasonings with salt and pepper.",
        "Transfer the chicken to a cutting board. Cut each breast half across the grain into slices about 1/2 inch thick and transfer to warmed individual plates. Spoon some of the fava beans and sauce over each breast. Sprinkle with the green garlic tops and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Chicken",
        ", by Rick Rodgers (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "Kosher salt and freshly ground pepper, to taste",
        "2 lb. fava beans in their pods, shelled",
        "2 stalks green garlic",
        "4 boneless, skinless chicken breast halves, each about 6 oz.",
        "2 Tbs. extra-virgin olive oil",
        "2 Tbs. unsalted butter",
        "1/4 cup dry white wine or vermouth",
        "3/4 cup low-sodium chicken broth"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sautéed Chicken Breasts with Fava Beans and Green Garlic",
    "url": "http://www.williams-sonoma.com/recipe/sauteed-chicken-breasts-with-fava-beans-and-green-garlic.html"
}
